#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "Проведение"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаСервере
Процедура ПодборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ДатаФильтра = ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата());
	ПараметрыОтрытия = Новый Структура;
	СтруктураОтбора  = Новый Структура("Организация, Дата", Объект.Организация, ДатаФильтра);
	
	ПараметрыОтрытия.Вставить("Отборы", СтруктураОтбора);
	
	
	АдресТаблицыВХранилище = ПоместитьТаблицуВХранилище();
	ПараметрыОтрытия.Вставить("АдресТаблицыВХранилище", АдресТаблицыВХранилище);
	
	ОткрытьФорму("Документ.ТаможенноеОформление.Форма.ФормаПодбора", ПараметрыОтрытия, ЭтаФорма,,,, Новый ОписаниеОповещения("ПодборЗаполнениеТабЧастиТовары", ЭтотОбъект, Новый Структура("АдресТаблицыВХранилище", АдресТаблицыВХранилище)));
	
КонецПроцедуры

Функция ПоместитьТаблицуВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.Запасы.Выгрузить(,
			"ДокументПоступления,
			|Номенклатура,
			|Характеристика,
			|Количество,
			|ЕдиницаИзмерения,
			|Цена,
			|Сумма,
			|СтавкаНДС
			|"),
		УникальныйИдентификатор
	);
	
КонецФункции

&НаКлиенте
Процедура ПодборЗаполнениеТабЧастиТовары(Результат, ДополнительныеПараметры) Экспорт

	АдресТаблицыВХранилище = ДополнительныеПараметры.АдресТаблицыВХранилище;
    
    КодВозврата = Результат;
    
    РедактироватьЗачетПредоплатыФрагмент(АдресТаблицыВХранилище, КодВозврата);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗачетПредоплатыФрагмент(Знач АдресТаблицыВХранилище, Знач КодВозврата)
    
    Если (КодВозврата = КодВозвратаДиалога.OK) Тогда
        ПолучитьПредоплатаИзХранилища(АдресТаблицыВХранилище);
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьПредоплатаИзХранилища(АдресТаблицыВХранилище)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресТаблицыВХранилище);
	Объект.Запасы.Загрузить(ТаблицаДляЗагрузки);
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.РассчитатьТаблицы(ИСТИНА);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗапасыНоменклатураПриИзмененииНаСервере(УИД)
	
	ТекСтрок = Объект.Запасы.НайтиПоИдентификатору(УИД);
	Если НЕ ЗначениеЗаполнено(ТекСтрок.ДокументПоступления) Тогда 
		Сообщить(НСтр("ka='Укажите документ!';ru='Укажите документ!';en='Specify the document!'"));
		ТекСтрок.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		ТекСтрок.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
		ТекСтрок.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		ТекСтрок.Количество = 0;
		ТекСтрок.Цена = 0;
		ТекСтрок.Сумма = 0;
		ТекСтрок.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
	тчЗапасыДокумента = ТекСтрок.ДокументПоступления.Запасы;
	
	МассивСтрокЗапасов = тчЗапасыДокумента.НайтиСтроки(Новый Структура("Номенклатура", ТекСтрок.Номенклатура));
	
	Если МассивСтрокЗапасов.Количество() = 0 Тогда 
		Сообщить(НСтр("ka='В документе нет указанной номенклатуры!';ru='В документе нет указанной номенклатуры!';en='The document is not specified range!'"));
		ТекСтрок.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
	ТекСтрок.СтавкаНДС = ТекСтрок.Номенклатура.СтавкаНДС;
	ТекСтрок.ЕдиницаИзмерения = ТекСтрок.Номенклатура.ЕдиницаИзмерения;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	ОчиститьСообщения();
	ТекСтрокаЗапасы = Элементы.Запасы.ТекущиеДанные;
	УИД = ТекСтрокаЗапасы.ПолучитьИдентификатор();
	
	ЗапасыНоменклатураПриИзмененииНаСервере(УИД);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрокаЗапасы = Элементы.Запасы.ТекущиеДанные;
	
	МассивНоменклатур = Новый Массив;
	
	Если ЗначениеЗаполнено(ТекСтрокаЗапасы.ДокументПоступления) Тогда 
		МассивНоменклатур = ПолучитьМассивНоменклатурыНаСервере(ТекСтрокаЗапасы.ПолучитьИдентификатор());
	КонецЕсли;
	
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", МассивНоменклатур);
    НовыйМассив = Новый Массив();
    НовыйМассив.Добавить(НовыйПараметр);
    НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
    Элементы.ЗапасыНоменклатура.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаСервере
Функция  ПолучитьМассивНоменклатурыНаСервере(УИДСтроки)

	ТекСтрока = Объект.Запасы.НайтиПоИдентификатору(УИДСтроки);
	тчЗапасыПрихода = ТекСтрока.ДокументПоступления.Запасы;
	
	МассивВозврата = тчЗапасыПрихода.ВыгрузитьКолонку("Номенклатура");

	Возврат МассивВозврата;
	
КонецФункции

&НаКлиенте
Процедура ЗапасыДокументПоступленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НовыйПараметрПроведен = Новый ПараметрВыбора("Отбор.Проведен", Истина);
	НовыйПараметрОрганизация = Новый ПараметрВыбора("Отбор.Организация", Объект.Организация);
	НовыйПараметрВидОперации = Новый ПараметрВыбора("Отбор.ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика"));
	
    НовыйМассив = Новый Массив();
    НовыйМассив.Добавить(НовыйПараметрПроведен);
	НовыйМассив.Добавить(НовыйПараметрОрганизация);
	НовыйМассив.Добавить(НовыйПараметрВидОперации);
    НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
    Элементы.ЗапасыНоменклатура.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьПоСуммеНДСНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.РаспределитьСуммуНДСПоСуммеНДС();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоСуммеНДС(Команда)
	
	Если Объект.СуммаНДС = 0 Тогда 
		УправлениеНебольшойФирмойКлиент.СообщитьОбОшибке(Объект, НСтр("ka='დღგ–ს გადანაწილებამდე მიუთითეთ დღგ–ს თანხა!';ru='Укажите сумму НДС!';en='Specify the amount of VAT!'"));
		Возврат;
	КонецЕсли;
	
	РаспределитьПоСуммеНДСНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	//ОбновитьПодвалФормы();
	//РассчитатьОбъемИВесВДокументе();
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	// Цена.
	Если СтрокаТабличнойЧасти.Количество <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуНДС(СтрокаТабличнойЧасти)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаРасходовНДС = СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100;
	
КонецПроцедуры // РассчитатьСуммуНДС()

&НаКлиенте
Процедура ЗапасыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура CalculatedByCustomsПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СтрокаТабличнойЧасти = Элементы.CalculatedByCustoms.ТекущиеДанные;
	CalculatedByCustomsПриОкончанииРедактированияНаСервере(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура CalculatedByCustomsПриОкончанииРедактированияНаСервере(ИдентификаторСтроки)
	
	СтрокаТабличнойЧасти = Объект.CalculatedByCustoms.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если НЕ СтрокаТабличнойЧасти = НЕОПРЕДЕЛЕНО Тогда
	
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ТоварнаяНоменклатураВЭД) Тогда
			
			Документ = РеквизитФормыВЗначение("Объект");
		
			МассивНайденныхСтрок = Объект.Запасы.НайтиСтроки(Новый Структура("ТоварнаяНоменклатураВЭД", СтрокаТабличнойЧасти.ТоварнаяНоменклатураВЭД));
			Для каждого СтрМассивНайденныхСтрок Из МассивНайденныхСтрок Цикл
				Документ.РассчитатьПоСтрокеCostOfTheProduct(СтрМассивНайденныхСтрок.НомерСтроки);
			КонецЦикла;
			
			ЗначениеВРеквизитФормы(Документ, "Объект");
		
		КонецЕсли;
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТаблицы(Команда)
	
	ПересчитатьТаблицыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьТаблицыНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.РассчитатьТаблицы(ЛОЖЬ);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры


