

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АдресЗарплатыВХранилище") Тогда 
		АдресЗарплатыВХранилище = Параметры.АдресЗарплатыВХранилище;
	КонецЕсли;
	
	Элементы.РезультатРаспознания.Видимость = ЛОЖЬ;
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбразецФормата_xlsx(Команда)
	
	ОткрытьОбразец("xlsx");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспознатьДанные(Команда)
	
	ОчиститьСообщения();
	ПроверитьЗаполнение();
	РаспознатьДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ЗаписатьПодборВХранилище();
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    ДиалогВыбораФайла.ПолноеИмяФайла = "";
    Фильтр = "Табличный документ (*.xls, *.xlsx, *.mxl)|*.xls;*.xlsx;*.mxl|";
    ДиалогВыбораФайла.Фильтр = Фильтр;
    ДиалогВыбораФайла.Заголовок = "Выберите файлы";
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
  		
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
		//++Lazare 
		БинДанные = Новый ДвоичныеДанные(ДиалогВыбораФайла.ПолноеИмяФайла);		
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(БинДанные, ЭтаФорма.УникальныйИдентификатор);
		ВыполнитьЗагрузкуНаСервере(АдресВременногоХранилища);
		//--Lazare
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере(Адрес)
	
	// Получение данных из временного хранилища
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	
	// Получение имени временного файла	
	//ИмяВременногоФайла = ПолучитьИмяВременногоФайла("*.xls, *.xlsx, *.mxl)|*.xls;*.xlsx;*.mxl|");
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	
	ПутьКФайлуНаСервере = ИмяВременногоФайла;
	// Сохранение данных во временный файл
	Данные.Записать(ИмяВременногоФайла);
	
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла);

КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьДанныеФайлаОбразцаЗагрузки(ДанныеФайла, Расширение)
	
	Перем Менеджер;	
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ПолучитьМенеджерПоИмениОбъектаЗаполнения("Документ.НачислениеЗарплаты",Менеджер);
	
	Образец_xlsx = Менеджер.ПолучитьМакетЗагрузки();
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);	
	Адрес = ОбразецЗагрузкиДанных_xlsx;
	                   	
	НаименованиеФайлаБезРасширения = Нстр("ka='მონაცემების ჩატვირთვის ნიმუში';ru='ОбразецЗагрузкиДанных';en='ObrazetsZagruzkiDannyh'");
	
	ДанныеФайла.Вставить("ДатаМодификацииУниверсальная",ТекущаяДата());
	ДанныеФайла.Вставить("Зашифрован", 					Ложь);
	ДанныеФайла.Вставить("ИмяФайла",					НаименованиеФайлаБезРасширения + "." + Расширение);
	ДанныеФайла.Вставить("Наименование",				НаименованиеФайлаБезРасширения);
	ДанныеФайла.Вставить("ОтносительныйПуть",			"LD\"); //LoadData
	ДанныеФайла.Вставить("ПодписанЭП",					Ложь);
	ДанныеФайла.Вставить("Размер",						Неопределено);
	ДанныеФайла.Вставить("Расширение",					Расширение);
	ДанныеФайла.Вставить("Редактирует",					Неопределено);
	ДанныеФайла.Вставить("СсылкаНаДвоичныеДанныеФайла", Адрес);
	ДанныеФайла.Вставить("ФайлРедактируетТекущийПользователь", Ложь);
	ДанныеФайла.Вставить("ФайлРедактируется",			Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбразец(Расширение)
	
	ДанныеФайла = Новый Структура;
	ЗаполнитьДанныеФайлаОбразцаЗагрузки(ДанныеФайла, Расширение);
	
	ПрисоединенныеФайлыКлиент.ОткрытьФайл(ДанныеФайла, Ложь);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапроса(ИмяКолонки)
	
	Если ИмяКолонки = "Сотрудники" Тогда 	
		
		Возврат
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.Наименование КАК Наименование,
		|	Сотрудники.Код КАК Код,
		|	Сотрудники.Физлицо.ИНН КАК ИНН
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ЭтоГруппа = ЛОЖЬ"		 
	Иначе		 
		Возврат
		"ВЫБРАТЬ
		|	ВидыНачисленийИУдержаний.Ссылка КАК Ссылка,
		|	ВидыНачисленийИУдержаний.Код КАК Код,
		|	ВидыНачисленийИУдержаний.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ВидыНачисленийИУдержаний КАК ВидыНачисленийИУдержаний
		|ГДЕ
		|	ВидыНачисленийИУдержаний.ЭтоГруппа = ЛОЖЬ"
		
	КонецЕсли;

	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуПоиску(ИмяКолонки)

	ТаблицаВозврата = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса(ИмяКолонки);
	ТаблицаВозврата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаВозврата;
	
КонецФункции // ПолучитьТаблицуПоиску(ЭлемСписка.Представление)()

&НаСервере
Функция ОпределитьСсылку(ТаблицаПоиска, ТекстЯчейки, НомерСтроки, МетодПоиска )

	
	Если МетодПоиска = 1 Тогда 		
		
		ПоискСтрокиНаименование = ТаблицаПоиска.НайтиСтроки(Новый Структура("Наименование", ТекстЯчейки));	
		
		Если ПоискСтрокиНаименование.Количество() = 1 Тогда 
			Возврат ПоискСтрокиНаименование[0].Ссылка;
		ИначеЕсли ПоискСтрокиНаименование.Количество() > 1 Тогда
			Сообщить("სტრიქონი №: "+НомерСтроки+", სახელის მიხედვით მოიძებნა ერთზე მეტი ელემენტი """+ТекстЯчейки+"""");
			Возврат НЕОПРЕДЕЛЕНО;
		КонецЕсли;
		
	ИначеЕсли  МетодПоиска = 2 Тогда		
		
		ПоискСтрокиКод = ТаблицаПоиска.НайтиСтроки(Новый Структура("Код", ТекстЯчейки));
		
		Если ПоискСтрокиКод.Количество() = 1 Тогда 
			Возврат ПоискСтрокиКод[0].Ссылка;
		ИначеЕсли ПоискСтрокиКод.Количество() > 1 Тогда
			Сообщить("სტრიქონი №: "+НомерСтроки+", კოდის მიხედვით მოიძებნა ერთზე მეტი ელემენტი """+ТекстЯчейки+"""");
			Возврат НЕОПРЕДЕЛЕНО;
		КонецЕсли;
		
	ИначеЕсли  МетодПоиска = 3 Тогда
		ПоискСтрокиИНН = ТаблицаПоиска.НайтиСтроки(Новый Структура("ИНН", ТекстЯчейки));
		
		Возврат ПоискСтрокиИНН[0].Ссылка;
		
	КонецЕсли;
	
	Сообщить("სტრიქონი №: "+НомерСтроки+", კოდისა და სახელის ძიებამ შედეგი არ გამოიღო. ძებნის მნიშვნელობა: """+ТекстЯчейки+"""");
	Возврат НЕОПРЕДЕЛЕНО;
	
КонецФункции 

&НаСервере
Процедура РаспознатьДанныеНаСервере()
	
	ТаблицаРезультат.Очистить();
	Элементы.Декорация1.Видимость = Истина;
	
	Элементы.ТабличныйДокумент.Видимость = ЛОЖЬ;
	
	тзОбрабоки = ТаблицаРезультат.Выгрузить();
	МассивНомеровКолонок = Новый Массив;
	
	СтруктураТаблицПоиска = Новый Структура;
	СтруктураТаблицПоиска.Вставить("Сотрудники", ПолучитьТаблицуПоиску("Сотрудники"));
	СтруктураТаблицПоиска.Вставить("ВидыНачисленийИУдержаний", ПолучитьТаблицуПоиску("ВидыНачисленийИУдержаний"));
 
	
	НомерСтроки = ?(НачальнаяСтрокаЧтения = 0, 3, НачальнаяСтрокаЧтения);
	КолСтрок = ТабличныйДокумент.ВысотаТаблицы;
	КолвоПустыхСтрокПодряд = 0;
	
	
	ВсяСтрокаПустая = Истина;
	СтруктураЗаполнения = Новый Структура;
	
	Для НомерСтроки = 3  По КолСтрок Цикл			
		
		ТаблицаПоискаСотрудников = СтруктураТаблицПоиска["Сотрудники"];
		ТаблицаПоискаВидыНачисленийИУдержаний = СтруктураТаблицПоиска["ВидыНачисленийИУдержаний"];		
		
		//Сотрудники
		ТекстЯчейкиСотрудники = ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C1").Текст;		
		СтруктураЗаполнения.Вставить("Сотрудник", ОпределитьСсылку(ТаблицаПоискаСотрудников, ТекстЯчейкиСотрудники, НомерСтроки, МетодПоискаСотрудника));	
		
		//ДатаНачала
		ТекстЯчейкиДатаНачала = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C2").Текст);			
		Если НЕ СтруктураЗаполнения.Свойство("ДатаНачала") Тогда 
			СтруктураЗаполнения.Вставить("ДатаНачала", Дата(1,1,1));
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтруктураЗаполнения["ДатаНачала"], ТекстЯчейкиДатаНачала);
		
		//ДатаОкончания
		ТекстЯчейкиДатаОкончания = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C3").Текст);			
		Если НЕ СтруктураЗаполнения.Свойство("ДатаОкончания") Тогда 
			СтруктураЗаполнения.Вставить("ДатаОкончания", Дата(1,1,1));
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтруктураЗаполнения["ДатаОкончания"], ТекстЯчейкиДатаОкончания);
		
		//ВидНачисленияУдержания
		ТекстЯчейкаНачУдержанияи = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C4").Текст);		
		Если  МетодПоискаВидаНачисленияУдержания = 1 Тогда 		
			СтруктураЗаполнения.Вставить("ВидНачисленияУдержания", Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию(ТекстЯчейкаНачУдержанияи,Истина));		
		Иначе 
			СтруктураЗаполнения.Вставить("ВидНачисленияУдержания", Справочники.ВидыНачисленийИУдержаний.НайтиПоКоду(ТекстЯчейкаНачУдержанияи));
		КонецЕсли;
			
		//Сумма		
		ТекстЯчейкаСумма = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C5").Текст);	
		Если НЕ СтруктураЗаполнения.Свойство("Сумма") Тогда 
			СтруктураЗаполнения.Вставить("Сумма", 0);
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтруктураЗаполнения["Сумма"], ТекстЯчейкаСумма, 0);
		
		//ВидУдержанияПФ
		ТекстЯчейкаВидУдержанияПФ = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C6").Текст);		
		Если  МетодПоискаВидаНачисленияУдержания = 1 Тогда 		
			СтруктураЗаполнения.Вставить("ВидУдержанияПФ", Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию(ТекстЯчейкаВидУдержанияПФ,Истина));		
		Иначе 
			СтруктураЗаполнения.Вставить("ВидУдержанияПФ", Справочники.ВидыНачисленийИУдержаний.НайтиПоКоду(ТекстЯчейкаВидУдержанияПФ));
		КонецЕсли;
	
		//ОтработаноДней		
		ТекстЯчейкаОтработаноДней = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C7").Текст);	
		Если НЕ СтруктураЗаполнения.Свойство("ОтработаноДней") Тогда 
			СтруктураЗаполнения.Вставить("ОтработаноДней", 0);
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтруктураЗаполнения["ОтработаноДней"], ТекстЯчейкаОтработаноДней, 0);

		//ОтработаноЧасов		
		ТекстЯчейкаОтработаноЧасов = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C8").Текст);	
		Если НЕ СтруктураЗаполнения.Свойство("ОтработаноЧасов") Тогда 
			СтруктураЗаполнения.Вставить("ОтработаноЧасов", 0);
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтруктураЗаполнения["ОтработаноЧасов"], ТекстЯчейкаОтработаноЧасов, 0);
		
		//ВидУдержания
		ТекстЯчейкаВидУдержания = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C9").Текст);			
		Если  МетодПоискаВидаНачисленияУдержания = 1 Тогда 		
			СтруктураЗаполнения.Вставить("ВидУдержания", Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию(ТекстЯчейкаВидУдержания,Истина));		
		Иначе 
			СтруктураЗаполнения.Вставить("ВидУдержания", Справочники.ВидыНачисленийИУдержаний.НайтиПоКоду(ТекстЯчейкаВидУдержания));
		КонецЕсли;

		//СуммаБезНалогов		
		ТекстЯчейкаСуммаБезНалогов = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C10").Текст);	
		Если НЕ СтруктураЗаполнения.Свойство("СуммаБезНалогов") Тогда 
			СтруктураЗаполнения.Вставить("СуммаБезНалогов", 0);
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтруктураЗаполнения["СуммаБезНалогов"], ТекстЯчейкаСуммаБезНалогов, 0);

		//ВидУдержанияНДФЛ
		ТекстЯчейкаВидУдержанияНДФЛ = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C11").Текст);			
		Если  МетодПоискаВидаНачисленияУдержания = 1 Тогда 		
			СтруктураЗаполнения.Вставить("ВидУдержанияНДФЛ", Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию(ТекстЯчейкаВидУдержанияНДФЛ,Истина));		
		Иначе 
			СтруктураЗаполнения.Вставить("ВидУдержанияНДФЛ", Справочники.ВидыНачисленийИУдержаний.НайтиПоКоду(ТекстЯчейкаВидУдержанияНДФЛ));
		КонецЕсли;
		
		//ВидУдержанияПФТзУдержаний
		ТекстЯчейкаВидУдержанияПФТзУдержаний = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C12").Текст);			
		Если  МетодПоискаВидаНачисленияУдержания = 1 Тогда 		
			СтруктураЗаполнения.Вставить("ВидУдержанияПФТзУдержаний", Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию(ТекстЯчейкаВидУдержанияПФТзУдержаний,Истина));		
		Иначе 
			СтруктураЗаполнения.Вставить("ВидУдержанияПФТзУдержаний", Справочники.ВидыНачисленийИУдержаний.НайтиПоКоду(ТекстЯчейкаВидУдержанияПФТзУдержаний));
		КонецЕсли;
		
		//СуммаЛгот		
		ТекстЯчейкаСуммаЛгот = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C13").Текст);	
		Если НЕ СтруктураЗаполнения.Свойство("СуммаЛгот") Тогда 
			СтруктураЗаполнения.Вставить("СуммаЛгот", 0);
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтруктураЗаполнения["СуммаЛгот"], ТекстЯчейкаСуммаЛгот, 0);
		
		//ВидНачисленияУдержанияНалоги
		ТекстЯчейкаВидНачУдер = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C14").Текст);			
		Если  МетодПоискаВидаНачисленияУдержания = 1 Тогда 		
			СтруктураЗаполнения.Вставить("ВидНачисленияУдержанияНалоги", Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию(ТекстЯчейкаВидНачУдер,Истина));		
		Иначе 
			СтруктураЗаполнения.Вставить("ВидНачисленияУдержанияНалоги", Справочники.ВидыНачисленийИУдержаний.НайтиПоКоду(ТекстЯчейкаВидНачУдер));
		КонецЕсли;
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураЗаполнения);
		
		
	КонецЦикла;
	
	
	Элементы.Декорация1.Видимость = ЛОЖЬ;
	
	Элементы.ТабличныйДокумент.Видимость = ИСтина;
	
	Элементы.РезультатРаспознания.Видимость = Истина;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.РезультатРаспознания;
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	ТзЗарплаты = ТаблицаРезультат.Выгрузить();
	ПоместитьВоВременноеХранилище(ТзЗарплаты, АдресЗарплатыВХранилище);
	
	УдалитьФайлы(ПутьКФайлуНаСервере);
	
КонецПроцедуры

#КонецОбласти

