
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКомандуПечати(Результат.Команда);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСтруктурнойЕдиницыПриИзменении(СтруктурнаяЕдиница)
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ПодписьОтветственного", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктурнаяЕдиница, "ПодписьМОЛ"));
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", УправлениеНебольшойФирмойСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеОрганизацияПриИзменении(Организация)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Компания", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	СтруктураДанные.Вставить("ПодписьРуководителя", Организация.ПодписьРуководителя);
	СтруктураДанные.Вставить("ПодписьГлавногоБухгалтера", Организация.ПодписьГлавногоБухгалтера);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеОрганизацияПриИзменении()

// Процедура - устанавливает дни недели в шапке таблицы.
//
&НаКлиенте
Процедура УстановитьДниНедели()
	
	Если Объект.СпособВводаДанных <> ПредопределенноеЗначение("Перечисление.СпособыВводаДанныхОВремени.ВцеломЗаПериод") Тогда
	
		СоответствиеДнейНедели = Новый Соответствие; 	
		СоответствиеДнейНедели.Вставить(1, НСтр("ru = 'Пн'; ka = 'ორშ'"));
		СоответствиеДнейНедели.Вставить(2, НСтр("ru = 'Вт'; ka = 'სამ'"));
		СоответствиеДнейНедели.Вставить(3, НСтр("ru = 'Ср'; ka = 'ოთხ'"));
		СоответствиеДнейНедели.Вставить(4, НСтр("ru = 'Чт'; ka = 'ხუთ'"));
		СоответствиеДнейНедели.Вставить(5, НСтр("ru = 'Пт'; ka = 'პარ'"));
		СоответствиеДнейНедели.Вставить(6, НСтр("ru = 'Сб'; ka = 'შაბ'"));
		СоответствиеДнейНедели.Вставить(7, НСтр("ru = 'Вс'; ka = 'კვ'")); 
		
		Для День = 1 По День(КонецМесяца(Объект.ПериодРегистрации)) Цикл
			Элементы["ОтработанноеВремяПоДнямПервыйЧасы" + День].Заголовок = СоответствиеДнейНедели.Получить(ДеньНедели(Дата(Год(Объект.ПериодРегистрации), Месяц(Объект.ПериодРегистрации), День)));
		КонецЦикла;
		
		Для День = 29 По День(КонецМесяца(Объект.ПериодРегистрации)) Цикл
			Элементы["ОтработанноеВремяПоДнямПервыйЧасы" + День].Видимость = Истина;
			Элементы["ОтработанноеВремяПоДнямВторойЧасы" + День].Видимость = Истина;
			Элементы["ОтработанноеВремяПоДнямТретийЧасы" + День].Видимость = Истина;
			Элементы["ОтработанноеВремяПоДнямПервыйВидВремени" + День].Видимость = Истина;
			Элементы["ОтработанноеВремяПоДнямВторойВидВремени" + День].Видимость = Истина;
			Элементы["ОтработанноеВремяПоДнямТретийВидВремени" + День].Видимость = Истина;
		КонецЦикла;
		
		Для День = День(КонецМесяца(Объект.ПериодРегистрации)) + 1 По 31 Цикл
			Элементы["ОтработанноеВремяПоДнямПервыйЧасы" + День].Видимость = Ложь;
			Элементы["ОтработанноеВремяПоДнямВторойЧасы" + День].Видимость = Ложь;
			Элементы["ОтработанноеВремяПоДнямТретийЧасы" + День].Видимость = Ложь;
			Элементы["ОтработанноеВремяПоДнямПервыйВидВремени" + День].Видимость = Ложь;
			Элементы["ОтработанноеВремяПоДнямВторойВидВремени" + День].Видимость = Ложь;
			Элементы["ОтработанноеВремяПоДнямТретийВидВремени" + День].Видимость = Ложь;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - возвращает должность сотрудника.
//
&НаСервереБезКонтекста
Функция ЗаполнитьДолжность(Структура)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СотрудникиСрезПоследних.Должность
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Сотрудник = &Сотрудник) КАК СотрудникиСрезПоследних");
	
	Запрос.УстановитьПараметр("Дата", Структура.Дата);
	Запрос.УстановитьПараметр("Организация", Структура.Организация);
	Запрос.УстановитьПараметр("Сотрудник", Структура.Сотрудник);
	Результат = Запрос.Выполнить();
	
	Возврат ?(Результат.Пустой(), 
		Справочники.Должности.ПустаяСсылка(), 
			Результат.Выгрузить()[0].Должность);
	
КонецФункции // ЗаполнитьДолжность()

&НаСервере
Процедура ЗаполнитьДанныеПоЧасам(РезультатЗапроса)
	
	ВидВремени = Справочники.ВидыРабочегоВремени.Работа;
	ВидВремениВыходныеДни = Справочники.ВидыРабочегоВремени.ВыходныеДни; //++Lazare >> X -Выходные Дни и праздники 
	//--------------------------------------------------------------------------
	// © Шишка В.В. [20 сентября 2022]  НАЧАЛО
	//ВыборкаРабочихДней = РезультатЗапроса[0].Выбрать();
	//ДеталиСотрудников = РезультатЗапроса[10].Выгрузить();
	//ВыборкаВыходныеДни = РезультатЗапроса[11].Выбрать(); // ++Lazare >> X -Выходные Дни и праздники 
	ВыборкаРабочихДней = РезультатЗапроса[1].Выбрать();
	ДеталиСотрудников = РезультатЗапроса[11].Выгрузить();
	ВыборкаВыходныеДни = РезультатЗапроса[12].Выбрать(); // ++Lazare >> X -Выходные Дни и праздники 
	ТаблицаРабочиеДни = РезультатЗапроса[13].Выгрузить();
	ТаблицаРабочиеДни.Индексы.Добавить("ГрафикРаботы, День");
	СтруктураПоискаДней = Новый Структура("ГрафикРаботы, День, ТипГрафика");
	// © Шишка В.В. [20 сентября 2022]  КОНЕЦ
	//--------------------------------------------------------------------------
	Для каждого СтрокаТаблицы Из ДеталиСотрудников Цикл
		
		ДобавитьСтроку = Истина;
		ПериодНачало = СтрокаТаблицы.Период;
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПериодДо) Тогда
			
			ПериодаОкончание = СтрокаТаблицы.ПериодДо - (24*60*60);
			
		ИначеЕсли СтрокаТаблицы.ЭтоУвольнение Тогда
			
			ДобавитьСтроку = Ложь;
			ПериодаОкончание = СтрокаТаблицы.Период;
			
		Иначе
			
			ПериодаОкончание = КонецМесяца(Объект.ПериодРегистрации);
			
		КонецЕсли;
		
		Если Объект.ПериодРегистрации > ПериодаОкончание Тогда
			
			Продолжить;
			
		КонецЕсли;   
		
		
		Если ДобавитьСтроку Тогда
			
			НоваяСтрока 			= Объект.ОтработанноеВремяПоДням.Добавить();
			НоваяСтрока.Сотрудник 	= СтрокаТаблицы.Сотрудник;
			НоваяСтрока.Должность 	= СтрокаТаблицы.Должность;
			
		КонецЕсли;
		//Lazare_
		ВыборкаВыходныеДни.Сбросить();
		Пока ВыборкаВыходныеДни.Следующий() Цикл
			
			
			//--------------------------------------------------------------------------
			// © Шишка В.В. [21 сентября 2022]  НАЧАЛО
			Если СтрокаТаблицы.ПроизводственныйКалендарь.ПроизводственныйКалендарь <> ВыборкаВыходныеДни.ПроизводственныйКалендарь Тогда
				
				Продолжить;	
				
			КонецЕсли;	
			// © Шишка В.В. [21 сентября 2022]  КОНЕЦ
			//--------------------------------------------------------------------------
			Если ДобавитьСтроку Тогда		
				День = День(ВыборкаВыходныеДни.Дата);	
				НоваяСтрока["ПервыйВидВремени" + День]	= ВидВремениВыходныеДни;
			КонецЕсли;
		КонецЦикла  ;
		//_Lazare
		
		ВыборкаРабочихДней.Сбросить();
		Пока ВыборкаРабочихДней.Следующий() Цикл
			
			Если ДобавитьСтроку Тогда //++Lazare ONESOFT-3141
				
				//--------------------------------------------------------------------------
				// © Шишка В.В. [21 сентября 2022]  НАЧАЛО
				Если СтрокаТаблицы.ПроизводственныйКалендарь <> ВыборкаРабочихДней.ПроизводственныйКалендарь
					//ИЛИ СтрокаТаблицы.ТипГрафика <> ВыборкаРабочихДней.ТипГрафика
					Тогда
					
					Продолжить;	
					
				КонецЕсли;	
				// © Шишка В.В. [21 сентября 2022]  КОНЕЦ
				//--------------------------------------------------------------------------
				
				Если ВыборкаРабочихДней.ДатаГрафика > ПериодаОкончание Тогда
					
					Прервать;
					
				КонецЕсли;
				
				Если ВыборкаРабочихДней.ДатаГрафика >= ПериодНачало
					И ВыборкаРабочихДней.ДатаГрафика <= ПериодаОкончание Тогда
					
					День = День(ВыборкаРабочихДней.ДатаГрафика);
					
					НоваяСтрока["ПервыйВидВремени" + День]	= ВидВремени;
					//--------------------------------------------------------------------------
					// © Шишка В.В. [20 сентября 2022]  НАЧАЛО
					//НоваяСтрока["ПервыйЧасы" + День] 		= 8 * СтрокаТаблицы.ЗанимаемыхСтавок;
					СтруктураПоискаДней.ГрафикРаботы = СтрокаТаблицы.ГрафикРаботы;
					СтруктураПоискаДней.ТипГрафика = СтрокаТаблицы.ТипГрафика;
					СтруктураПоискаДней.День = День;
					СтрокиГрафика = ТаблицаРабочиеДни.НайтиСтроки(СтруктураПоискаДней);
					НоваяСтрока["ПервыйЧасы" + День] 		= 0;
					Если СтрокиГрафика.Количество() Тогда
						Для каждого ТекущийДеньГрафика Из СтрокиГрафика Цикл
							
							НоваяСтрока["ПервыйЧасы" + День] = НоваяСтрока["ПервыйЧасы" + День] + ТекущийДеньГрафика.ЧасовРаботы;	
							
						КонецЦикла;
						
					Иначе	
						
						//НоваяСтрока["ПервыйЧасы" + День] 		= 8 * СтрокаТаблицы.ЗанимаемыхСтавок;
						НоваяСтрока["ПервыйВидВремени" + День]	= ВидВремениВыходныеДни;
						
					КонецЕсли;
					// © Шишка В.В. [20 сентября 2022]  КОНЕЦ
					//--------------------------------------------------------------------------
				КонецЕсли;
				
				//--------------------------------------------------------------------------
				// © Шишка В.В. [24 сентября 2022]  НАЧАЛО
				Если СтрокаТаблицы.ТипГрафика = Перечисления.ТипыГрафикаРаботы.Сменный Тогда
					
					Для Сч = День(ПериодНачало) По День(ПериодаОкончание) Цикл
						
						Если Не ЗначениеЗаполнено(НоваяСтрока["ПервыйЧасы" + Сч]) Тогда
							
							НоваяСтрока["ПервыйВидВремени" + Сч]	= ВидВремениВыходныеДни;	
							
						КонецЕсли;	
						
					КонецЦикла;	
					
				КонецЕсли;	
				// © Шишка В.В. [24 сентября 2022]  КОНЕЦ
				//--------------------------------------------------------------------------
				
			КонецЕсли;//++Lazare ONESOFT-3141
	
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоДням(РезультатЗапроса)
	
	ВидВремени = Справочники.ВидыРабочегоВремени.Работа;
	
	//ВыборкаРабочихДней = РезультатЗапроса[0].Выбрать();
	//ДеталиСотрудников = РезультатЗапроса[10].Выгрузить();
	// Олег Литвиненко 13.02.23 --->
	//Запрос изменился. Теперь 0 и 10 - это временная таблица
	ВыборкаРабочихДней = РезультатЗапроса[13].Выбрать();
	ДеталиСотрудников = РезультатЗапроса[14].Выгрузить();
	// Олег Литвиненко <---
	
	Для каждого СтрокаТаблицы Из ДеталиСотрудников Цикл
		
		ДобавитьСтроку = Истина;
		ПериодНачало = СтрокаТаблицы.Период;
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПериодДо) Тогда
			
			ПериодаОкончание = СтрокаТаблицы.ПериодДо - (24*60*60);
			
		ИначеЕсли СтрокаТаблицы.ЭтоУвольнение Тогда
			
			ДобавитьСтроку = Ложь;
			ПериодаОкончание = СтрокаТаблицы.Период;
			
		Иначе
			
			ПериодаОкончание = КонецМесяца(Объект.ПериодРегистрации);
			
		КонецЕсли;
		
		Если Объект.ПериодРегистрации > ПериодаОкончание Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ДобавитьСтроку Тогда
			
			НоваяСтрока 			= Объект.ОтработанноеВремяЗаПериод.Добавить();
			НоваяСтрока.Сотрудник 	= СтрокаТаблицы.Сотрудник;
			НоваяСтрока.Должность 	= СтрокаТаблицы.Должность;
			НоваяСтрока.ВидВремени1 = ВидВремени;
			
		КонецЕсли;
		
		ВыборкаРабочихДней.Сбросить();
		Пока ВыборкаРабочихДней.Следующий() Цикл
			
			Если ВыборкаРабочихДней.ДатаГрафика > ПериодаОкончание Тогда
				
				Прервать;
				
			КонецЕсли;
			
			Если ВыборкаРабочихДней.ДатаГрафика >= ПериодНачало
				И ВыборкаРабочихДней.ДатаГрафика <= ПериодаОкончание Тогда
				
				НоваяСтрока.Дней1 	= НоваяСтрока.Дней1 + 1;
				НоваяСтрока.Часов1 	= НоваяСтрока.Часов1 + (8 * СтрокаТаблицы.ЗанимаемыхСтавок);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполняет табличную часть сотрудниками подразделения по производственному календарю.
//
&НаСервере
Процедура ЗаполнитьТабель()
	
	Запрос = Новый Запрос;
		
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Календарь", Компания.ПроизводственныйКалендарь);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ПериодРегистрации);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Объект.ПериодРегистрации));
	
	Запрос.Текст =
	//--------------------------------------------------------------------------
	// © Шишка В.В. [20 сентября 2022]  НАЧАЛО
	"ВЫБРАТЬ
	|	1 КАК НомерЗапроса,
	|	ГрафикиРаботы.ГрафикРаботы КАК ГрафикРаботы,
	|	НАЧАЛОПЕРИОДА(ГрафикиРаботы.ВремяНачала, ДЕНЬ) КАК ДатаГрафика,
	|	СУММА(ВЫБОР
	|			КОГДА КОНЕЦПЕРИОДА(ГрафикиРаботы.ВремяОкончания, ДЕНЬ) = ГрафикиРаботы.ВремяОкончания
	|					И НАЧАЛОПЕРИОДА(ГрафикиРаботы.ВремяНачала, ДЕНЬ) = ГрафикиРаботы.ВремяНачала
	|				ТОГДА 24
	|			ИНАЧЕ (ЧАС(ГрафикиРаботы.ВремяОкончания) * 3600 + МИНУТА(ГрафикиРаботы.ВремяОкончания) * 60 + СЕКУНДА(ГрафикиРаботы.ВремяОкончания) - (ЧАС(ГрафикиРаботы.ВремяНачала) * 3600 + МИНУТА(ГрафикиРаботы.ВремяНачала) * 60 + СЕКУНДА(ГрафикиРаботы.ВремяНачала))) / 3600
	|		КОНЕЦ) КАК ЧасовРаботы,
	|	ГрафикиРаботы.Год КАК Год,
	|	ДЕНЬ(ГрафикиРаботы.ВремяНачала) КАК День,
	|	ГрафикиРаботы.ГрафикРаботы.ТипГрафика КАК ТипГрафика,
	|	ГрафикиРаботы.ВремяНачала КАК ВремяНачала,
	|	ГрафикиРаботы.ВремяОкончания КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_ДанныеТабеля
	|ИЗ
	|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
	|ГДЕ
	|	ГрафикиРаботы.ВремяНачала >= &ДатаНачала
	|	И ГрафикиРаботы.ВремяОкончания <= &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиРаботы.ГрафикРаботы,
	|	НАЧАЛОПЕРИОДА(ГрафикиРаботы.ВремяНачала, ДЕНЬ),
	|	ГрафикиРаботы.Год,
	|	ДЕНЬ(ГрафикиРаботы.ВремяНачала),
	|	ГрафикиРаботы.ГрафикРаботы.ТипГрафика,
	|	ГрафикиРаботы.ВремяОкончания,
	|	ГрафикиРаботы.ВремяНачала
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикРаботы,
	|	Год,
	|	ДатаГрафика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	2 КАК НомерЗапроса,
	|	КалендарныеГрафики.ДатаГрафика КАК ДатаГрафика,
	|	КалендарныеГрафики.Календарь КАК ПроизводственныйКалендарь
	|ИЗ
	|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	|ГДЕ
	|	КалендарныеГрафики.ДатаГрафика >= &ДатаНачала
	|	И КалендарныеГрафики.ДатаГрафика <= &ДатаОкончания
	|	И КалендарныеГрафики.ДеньВключенВГрафик
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПроизводственныйКалендарь,
	|	ДатаГрафика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	3 КАК НомерЗапроса,
	|	ДанныеУвольнения.Период КАК ДатаУвольнения,
	|	ДанныеУвольнения.Сотрудник КАК УволенныйСотрудник
	|ПОМЕСТИТЬ ДанныеУвольнения
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			&ДатаОкончания,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|				И Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК ДанныеУвольнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	4 КАК НомерЗапроса,
	|	ДанныеУвольнения.УволенныйСотрудник КАК УволенныйСотрудник,
	|	МАКСИМУМ(УсловияРаботыДоУвольнения.Период) КАК ПериодЗаписиПередУвольнением
	|ПОМЕСТИТЬ ПериодЗаписиУсловийТрудаДоУвольнения
	|ИЗ
	|	ДанныеУвольнения КАК ДанныеУвольнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК УсловияРаботыДоУвольнения
	|		ПО (УсловияРаботыДоУвольнения.Период < ДанныеУвольнения.ДатаУвольнения)
	|			И ДанныеУвольнения.УволенныйСотрудник = УсловияРаботыДоУвольнения.Сотрудник
	|ГДЕ
	|	УсловияРаботыДоУвольнения.Период <= &ДатаОкончания
	|	И УсловияРаботыДоУвольнения.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеУвольнения.УволенныйСотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	5 КАК НомерЗапроса,
	|	ДанныеУвольнения.ДатаУвольнения КАК ДатаУвольнения,
	|	УсловияРаботыДоУвольнения.Организация КАК Организация,
	|	УсловияРаботыДоУвольнения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УсловияРаботыДоУвольнения.Должность КАК Должность,
	|	УсловияРаботыДоУвольнения.Сотрудник КАК Сотрудник,
	|	УсловияРаботыДоУвольнения.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	ИСТИНА КАК ЭтоУвольнение,
	|	УсловияРаботыДоУвольнения.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ДанныеУвольненияСДеталями
	|ИЗ
	|	ДанныеУвольнения КАК ДанныеУвольнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодЗаписиУсловийТрудаДоУвольнения КАК ПериодЗаписиУсловийТрудаДоУвольнения
	|		ПО ДанныеУвольнения.УволенныйСотрудник = ПериодЗаписиУсловийТрудаДоУвольнения.УволенныйСотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК УсловияРаботыДоУвольнения
	|		ПО (ПериодЗаписиУсловийТрудаДоУвольнения.ПериодЗаписиПередУвольнением = УсловияРаботыДоУвольнения.Период)
	|			И (ПериодЗаписиУсловийТрудаДоУвольнения.УволенныйСотрудник = УсловияРаботыДоУвольнения.Сотрудник)
	|ГДЕ
	|	УсловияРаботыДоУвольнения.Организация = &Организация
	|	И УсловияРаботыДоУвольнения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	УсловияРаботыДоУвольнения.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	6 КАК НомерЗапроса,
	|	ВЫБОР
	|		КОГДА СотрудникиСрезПоследних.Период < &ДатаНачала
	|			ТОГДА &ДатаНачала
	|		ИНАЧЕ СотрудникиСрезПоследних.Период
	|	КОНЕЦ КАК Период,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СотрудникиСрезПоследних.Должность КАК Должность,
	|	СотрудникиСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ДанныеСотрудникаНаНачалоМесяца
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			&ДатаНачала,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК СотрудникиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	7 КАК НомерЗапроса,
	|	МИНИМУМ(КадровыеПеремещения.Период) КАК Период,
	|	КадровыеПеремещения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	КадровыеПеремещения.Сотрудник КАК Сотрудник,
	|	КадровыеПеремещения.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	КадровыеПеремещения.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ЗаписьКадровогоПеремещения
	|ИЗ
	|	РегистрСведений.Сотрудники КАК КадровыеПеремещения,
	|	ДанныеСотрудникаНаНачалоМесяца КАК ДанныеСотрудникаНаНачалоМесяца
	|ГДЕ
	|	КадровыеПеремещения.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И КадровыеПеремещения.Организация = &Организация
	|	И НЕ(КадровыеПеремещения.СтруктурнаяЕдиница В (ДанныеСотрудникаНаНачалоМесяца.СтруктурнаяЕдиница)
	|				И КадровыеПеремещения.Должность В (ДанныеСотрудникаНаНачалоМесяца.Должность))
	|	И КадровыеПеремещения.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	КадровыеПеремещения.СтруктурнаяЕдиница,
	|	КадровыеПеремещения.Сотрудник,
	|	КадровыеПеремещения.ЗанимаемыхСтавок,
	|	КадровыеПеремещения.ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	8 КАК НомерЗапроса,
	|	ВЫБОР
	|		КОГДА СотрудникиСрезПоследних.Период < &ДатаНачала
	|			ТОГДА &ДатаНачала
	|		ИНАЧЕ СотрудникиСрезПоследних.Период
	|	КОНЕЦ КАК Период,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СотрудникиСрезПоследних.Должность КАК Должность,
	|	СотрудникиСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	ЛОЖЬ КАК ЭтоУвольнение,
	|	СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
	|	СотрудникиСрезПоследних.ГрафикРаботы.Календарь КАК ПроизводственныйКалендарь
	|ПОМЕСТИТЬ УсловияОплатыТруда
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(&ДатаНачала, Организация = &Организация) КАК СотрудникиСрезПоследних
	|ГДЕ
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	8,
	|	Сотрудники.Период,
	|	Сотрудники.СтруктурнаяЕдиница,
	|	Сотрудники.Сотрудник,
	|	Сотрудники.Должность,
	|	Сотрудники.ЗанимаемыхСтавок,
	|	ЛОЖЬ,
	|	Сотрудники.ГрафикРаботы,
	|	Сотрудники.ГрафикРаботы.Календарь
	|ИЗ
	|	РегистрСведений.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Сотрудники.Организация = &Организация
	|	И Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8,
	|	ДанныеУвольненияСДеталями.ДатаУвольнения,
	|	ДанныеУвольненияСДеталями.СтруктурнаяЕдиница,
	|	ДанныеУвольненияСДеталями.Сотрудник,
	|	ДанныеУвольненияСДеталями.Должность,
	|	ДанныеУвольненияСДеталями.ЗанимаемыхСтавок,
	|	ИСТИНА,
	|	ДанныеУвольненияСДеталями.ГрафикРаботы,
	|	ДанныеУвольненияСДеталями.ГрафикРаботы.Календарь
	|ИЗ
	|	ДанныеУвольненияСДеталями КАК ДанныеУвольненияСДеталями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	9 КАК НомерЗапроса,
	|	УсловияОплатыТруда.Период КАК Период,
	|	УсловияОплатыТруда.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УсловияОплатыТруда.Сотрудник КАК Сотрудник,
	|	УсловияОплатыТруда.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	УсловияОплатыТруда.ЭтоУвольнение КАК ЭтоУвольнение,
	|	УсловияОплатыТруда.ГрафикРаботы КАК ГрафикРаботы,
	|	УсловияОплатыТруда.ГрафикРаботы.Календарь КАК ПроизводственныйКалендарь
	|ПОМЕСТИТЬ ПериодыУсловияОплатыТруда
	|ИЗ
	|	УсловияОплатыТруда КАК УсловияОплатыТруда
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9,
	|	ЗаписьКадровогоПеремещения.Период,
	|	ЗаписьКадровогоПеремещения.СтруктурнаяЕдиница,
	|	ЗаписьКадровогоПеремещения.Сотрудник,
	|	ЗаписьКадровогоПеремещения.ЗанимаемыхСтавок,
	|	ЛОЖЬ,
	|	ЗаписьКадровогоПеремещения.ГрафикРаботы,
	|	NULL
	|ИЗ
	|	ЗаписьКадровогоПеремещения КАК ЗаписьКадровогоПеремещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	10 КАК НомерЗапроса,
	|	ПериодыУсловияОплатыТруда.Период КАК ПериодДо,
	|	МАКСИМУМ(УсловияОплатыТруда.Период) КАК ПериодС,
	|	УсловияОплатыТруда.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ СовмещенныеПериоды
	|ИЗ
	|	УсловияОплатыТруда КАК УсловияОплатыТруда
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыУсловияОплатыТруда КАК ПериодыУсловияОплатыТруда
	|		ПО УсловияОплатыТруда.Период < ПериодыУсловияОплатыТруда.Период
	|			И УсловияОплатыТруда.Сотрудник = ПериодыУсловияОплатыТруда.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыУсловияОплатыТруда.Период,
	|	УсловияОплатыТруда.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	11 КАК НомерЗапроса,
	|	УсловияОплатыТруда.Период КАК Период,
	|	СовмещенныеПериоды.ПериодДо КАК ПериодДо,
	|	УсловияОплатыТруда.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УсловияОплатыТруда.Сотрудник КАК Сотрудник,
	|	УсловияОплатыТруда.Должность КАК Должность,
	|	УсловияОплатыТруда.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	УсловияОплатыТруда.ЭтоУвольнение КАК ЭтоУвольнение,
	|	УсловияОплатыТруда.ГрафикРаботы КАК ГрафикРаботы,
	|	УсловияОплатыТруда.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
	|	УсловияОплатыТруда.ГрафикРаботы.ТипГрафика КАК ТипГрафика
	|ПОМЕСТИТЬ ТаблицаСПолнымиДанными
	|ИЗ
	|	СовмещенныеПериоды КАК СовмещенныеПериоды
	|		ПОЛНОЕ СОЕДИНЕНИЕ УсловияОплатыТруда КАК УсловияОплатыТруда
	|		ПО СовмещенныеПериоды.ПериодС = УсловияОплатыТруда.Период
	|			И СовмещенныеПериоды.Сотрудник = УсловияОплатыТруда.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	12 КАК НомерЗапроса,
	|	ТаблицаСПолнымиДанными.Период КАК Период,
	|	ТаблицаСПолнымиДанными.ПериодДо КАК ПериодДо,
	|	ТаблицаСПолнымиДанными.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаСПолнымиДанными.Сотрудник КАК Сотрудник,
	|	ТаблицаСПолнымиДанными.Должность КАК Должность,
	|	ТаблицаСПолнымиДанными.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	ТаблицаСПолнымиДанными.ЭтоУвольнение КАК ЭтоУвольнение,
	|	ТаблицаСПолнымиДанными.ГрафикРаботы КАК ГрафикРаботы,
	|	ЕСТЬNULL(ТаблицаСПолнымиДанными.ГрафикРаботы.Календарь, ЗНАЧЕНИЕ(справочник.календари.пустаяссылка)) КАК ПроизводственныйКалендарь,
	|	ТаблицаСПолнымиДанными.ТипГрафика КАК ТипГрафика
	|ИЗ
	|	ТаблицаСПолнымиДанными КАК ТаблицаСПолнымиДанными
	|ГДЕ
	|	НЕ ТаблицаСПолнымиДанными.Сотрудник В
	|				(ВЫБРАТЬ
	|					ДанныеУвольненияСДеталями.Сотрудник
	|				ИЗ
	|					ДанныеУвольненияСДеталями КАК ДанныеУвольненияСДеталями
	|				ГДЕ
	|					ДанныеУвольненияСДеталями.ДатаУвольнения < &ДатаНачала)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаСПолнымиДанными.Сотрудник,
	|	ТаблицаСПолнымиДанными.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	13 КАК НомерЗапроса,
	|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
	|	ДанныеПроизводственногоКалендаря.Год КАК Год,
	|	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня,
	|	ДанныеПроизводственногоКалендаря.ДатаПереноса КАК ДатаПереноса,
	|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.ВидДня <> ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	|	И ДанныеПроизводственногоКалендаря.Дата >= &ДатаНачала
	|	И ДанныеПроизводственногоКалендаря.Дата <= &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	14 КАК НомерЗапроса,
	|	ВТ_ДанныеТабеля.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_ДанныеТабеля.ДатаГрафика КАК ДатаГрафика,
	|	ВТ_ДанныеТабеля.ЧасовРаботы КАК ЧасовРаботы,
	|	ВТ_ДанныеТабеля.Год КАК Год,
	|	ВТ_ДанныеТабеля.День КАК День,
	|	ВТ_ДанныеТабеля.ГрафикРаботы.Календарь КАК ПроизводственныйКалендарь,
	|	ВТ_ДанныеТабеля.ТипГрафика КАК ТипГрафика
	|ИЗ
	|	ВТ_ДанныеТабеля КАК ВТ_ДанныеТабеля
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	15 КАК НомерЗапроса,
	|	ТаблицаСПолнымиДанными.Период КАК Период,
	|	ТаблицаСПолнымиДанными.ПериодДо КАК ПериодДо,
	|	ТаблицаСПолнымиДанными.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаСПолнымиДанными.Сотрудник КАК Сотрудник,
	|	ТаблицаСПолнымиДанными.Должность КАК Должность,
	|	ТаблицаСПолнымиДанными.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	ТаблицаСПолнымиДанными.ЭтоУвольнение КАК ЭтоУвольнение,
	|	ТаблицаСПолнымиДанными.ГрафикРаботы КАК ГрафикРаботы,
	|	ТаблицаСПолнымиДанными.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
	|	ТаблицаСПолнымиДанными.ТипГрафика КАК ТипГрафика
	|ИЗ
	|	ТаблицаСПолнымиДанными КАК ТаблицаСПолнымиДанными";
	// Олег Литвиненко <---
	СтарыйТекст =	
	// © Шишка В.В. [20 сентября 2022]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	"ВЫБРАТЬ
	|	КалендарныеГрафики.ДатаГрафика КАК ДатаГрафика
	|ИЗ
	|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	|ГДЕ
	|	КалендарныеГрафики.Календарь = &Календарь
	|	И КалендарныеГрафики.ДатаГрафика >= &ДатаНачала
	|	И КалендарныеГрафики.ДатаГрафика <= &ДатаОкончания
	|	И КалендарныеГрафики.ДеньВключенВГрафик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	19 КАК НомерЗапроса,
	|	ДанныеУвольнения.Период КАК ДатаУвольнения,
	|	ДанныеУвольнения.Сотрудник КАК УволенныйСотрудник
	|ПОМЕСТИТЬ ДанныеУвольнения
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			&ДатаОкончания,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|				И Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК ДанныеУвольнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеУвольнения.УволенныйСотрудник КАК УволенныйСотрудник,
	|	МАКСИМУМ(УсловияРаботыДоУвольнения.Период) КАК ПериодЗаписиПередУвольнением
	|ПОМЕСТИТЬ ПериодЗаписиУсловийТрудаДоУвольнения
	|ИЗ
	|	ДанныеУвольнения КАК ДанныеУвольнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК УсловияРаботыДоУвольнения
	|		ПО (УсловияРаботыДоУвольнения.Период <= ДанныеУвольнения.ДатаУвольнения)
	|			И ДанныеУвольнения.УволенныйСотрудник = УсловияРаботыДоУвольнения.Сотрудник
	|ГДЕ
	|	УсловияРаботыДоУвольнения.Период <= &ДатаОкончания
	|	И УсловияРаботыДоУвольнения.Организация = &Организация
	|	И УсловияРаботыДоУвольнения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеУвольнения.УволенныйСотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеУвольнения.ДатаУвольнения КАК ДатаУвольнения,
	|	УсловияРаботыДоУвольнения.Организация КАК Организация,
	|	УсловияРаботыДоУвольнения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УсловияРаботыДоУвольнения.Должность КАК Должность,
	|	УсловияРаботыДоУвольнения.Сотрудник КАК Сотрудник,
	|	УсловияРаботыДоУвольнения.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	ИСТИНА КАК ЭтоУвольнение
	|ПОМЕСТИТЬ ДанныеУвольненияСДеталями
	|ИЗ
	|	ДанныеУвольнения КАК ДанныеУвольнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодЗаписиУсловийТрудаДоУвольнения КАК ПериодЗаписиУсловийТрудаДоУвольнения
	|		ПО ДанныеУвольнения.УволенныйСотрудник = ПериодЗаписиУсловийТрудаДоУвольнения.УволенныйСотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК УсловияРаботыДоУвольнения
	|		ПО (ПериодЗаписиУсловийТрудаДоУвольнения.ПериодЗаписиПередУвольнением = УсловияРаботыДоУвольнения.Период)
	|			И (ПериодЗаписиУсловийТрудаДоУвольнения.УволенныйСотрудник = УсловияРаботыДоУвольнения.Сотрудник)
	|ГДЕ
	|	УсловияРаботыДоУвольнения.Организация = &Организация
	|	И УсловияРаботыДоУвольнения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	УсловияРаботыДоУвольнения.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СотрудникиСрезПоследних.Период < &ДатаНачала
	|			ТОГДА &ДатаНачала
	|		ИНАЧЕ СотрудникиСрезПоследних.Период
	|	КОНЕЦ КАК Период,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СотрудникиСрезПоследних.Должность КАК Должность,
	|	СотрудникиСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок
	|ПОМЕСТИТЬ ДанныеСотрудникаНаНачалоМесяца
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			&ДатаНачала,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК СотрудникиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(КадровыеПеремещения.Период) КАК Период,
	|	КадровыеПеремещения.СтруктурнаяЕдиница,
	|	КадровыеПеремещения.Сотрудник,
	|	КадровыеПеремещения.ЗанимаемыхСтавок
	|ПОМЕСТИТЬ ЗаписьКадровогоПеремещения
	|ИЗ
	|	РегистрСведений.Сотрудники КАК КадровыеПеремещения,
	|	ДанныеСотрудникаНаНачалоМесяца КАК ДанныеСотрудникаНаНачалоМесяца
	|ГДЕ
	|	КадровыеПеремещения.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И КадровыеПеремещения.Организация = &Организация
	|	И НЕ(КадровыеПеремещения.СтруктурнаяЕдиница В (ДанныеСотрудникаНаНачалоМесяца.СтруктурнаяЕдиница)
	|				И КадровыеПеремещения.Должность В (ДанныеСотрудникаНаНачалоМесяца.Должность))
	|	И КадровыеПеремещения.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	КадровыеПеремещения.СтруктурнаяЕдиница,
	|	КадровыеПеремещения.Сотрудник,
	|	КадровыеПеремещения.ЗанимаемыхСтавок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СотрудникиСрезПоследних.Период < &ДатаНачала
	|			ТОГДА &ДатаНачала
	|		ИНАЧЕ СотрудникиСрезПоследних.Период
	|	КОНЕЦ КАК Период,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СотрудникиСрезПоследних.Должность КАК Должность,
	|	СотрудникиСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	ЛОЖЬ КАК ЭтоУвольнение
	|ПОМЕСТИТЬ УсловияОплатыТруда
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			&ДатаНачала,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК СотрудникиСрезПоследних
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Период,
	|	Сотрудники.СтруктурнаяЕдиница,
	|	Сотрудники.Сотрудник,
	|	Сотрудники.Должность,
	|	Сотрудники.ЗанимаемыхСтавок,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Сотрудники.Организация = &Организация
	|	И Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДанныеУвольненияСДеталями.ДатаУвольнения,
	|	ДанныеУвольненияСДеталями.СтруктурнаяЕдиница,
	|	ДанныеУвольненияСДеталями.Сотрудник,
	|	ДанныеУвольненияСДеталями.Должность,
	|	ДанныеУвольненияСДеталями.ЗанимаемыхСтавок,
	|	ИСТИНА
	|ИЗ
	|	ДанныеУвольненияСДеталями КАК ДанныеУвольненияСДеталями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УсловияОплатыТруда.Период,
	|	УсловияОплатыТруда.СтруктурнаяЕдиница,
	|	УсловияОплатыТруда.Сотрудник КАК Сотрудник,
	|	УсловияОплатыТруда.ЗанимаемыхСтавок,
	|	УсловияОплатыТруда.ЭтоУвольнение
	|ПОМЕСТИТЬ ПериодыУсловияОплатыТруда
	|ИЗ
	|	УсловияОплатыТруда КАК УсловияОплатыТруда
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаписьКадровогоПеремещения.Период,
	|	ЗаписьКадровогоПеремещения.СтруктурнаяЕдиница,
	|	ЗаписьКадровогоПеремещения.Сотрудник,
	|	ЗаписьКадровогоПеремещения.ЗанимаемыхСтавок,
	|	ЛОЖЬ
	|ИЗ
	|	ЗаписьКадровогоПеремещения КАК ЗаписьКадровогоПеремещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыУсловияОплатыТруда.Период КАК ПериодДо,
	|	МАКСИМУМ(УсловияОплатыТруда.Период) КАК ПериодС,
	|	УсловияОплатыТруда.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ СовмещенныеПериоды
	|ИЗ
	|	УсловияОплатыТруда КАК УсловияОплатыТруда
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыУсловияОплатыТруда КАК ПериодыУсловияОплатыТруда
	|		ПО УсловияОплатыТруда.Период < ПериодыУсловияОплатыТруда.Период
	|			И УсловияОплатыТруда.Сотрудник = ПериодыУсловияОплатыТруда.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыУсловияОплатыТруда.Период,
	|	УсловияОплатыТруда.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УсловияОплатыТруда.Период,
	|	СовмещенныеПериоды.ПериодДо,
	|	УсловияОплатыТруда.СтруктурнаяЕдиница,
	|	УсловияОплатыТруда.Сотрудник,
	|	УсловияОплатыТруда.Должность,
	|	УсловияОплатыТруда.ЗанимаемыхСтавок,
	|	УсловияОплатыТруда.ЭтоУвольнение
	|ПОМЕСТИТЬ ТаблицаСПолнымиДанными
	|ИЗ
	|	СовмещенныеПериоды КАК СовмещенныеПериоды
	|		ПОЛНОЕ СОЕДИНЕНИЕ УсловияОплатыТруда КАК УсловияОплатыТруда
	|		ПО СовмещенныеПериоды.ПериодС = УсловияОплатыТруда.Период
	|			И СовмещенныеПериоды.Сотрудник = УсловияОплатыТруда.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСПолнымиДанными.Период КАК Период,
	|	ТаблицаСПолнымиДанными.ПериодДо КАК ПериодДо,
	|	ТаблицаСПолнымиДанными.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаСПолнымиДанными.Сотрудник КАК Сотрудник,
	|	ТаблицаСПолнымиДанными.Должность КАК Должность,
	|	ТаблицаСПолнымиДанными.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	ТаблицаСПолнымиДанными.ЭтоУвольнение КАК ЭтоУвольнение
	|ИЗ
	|	ТаблицаСПолнымиДанными КАК ТаблицаСПолнымиДанными
	|ГДЕ
	|	НЕ ТаблицаСПолнымиДанными.Сотрудник В
	|				(ВЫБРАТЬ
	|					ДанныеУвольненияСДеталями.Сотрудник
	|				ИЗ
	|					ДанныеУвольненияСДеталями КАК ДанныеУвольненияСДеталями
	|				ГДЕ
	|					ДанныеУвольненияСДеталями.ДатаУвольнения < &ДатаНачала)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаСПолнымиДанными.Сотрудник,
	|	ТаблицаСПолнымиДанными.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата,
	|	ДанныеПроизводственногоКалендаря.Год,
	|	ДанныеПроизводственногоКалендаря.ВидДня,
	|	ДанныеПроизводственногоКалендаря.ДатаПереноса
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.ВидДня <> ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	|	И ДанныеПроизводственногоКалендаря.Дата >= &ДатаНачала
	|	И ДанныеПроизводственногоКалендаря.Дата <= &ДатаОкончания";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Объект.ОтработанноеВремяПоДням.Очистить();
	Объект.ОтработанноеВремяЗаПериод.Очистить();
	
	Если Объект.СпособВводаДанных = Перечисления.СпособыВводаДанныхОВремени.ПоДням Тогда
		
		ЗаполнитьДанныеПоЧасам(РезультатЗапроса);
		
	Иначе
		
		ЗаполнитьДанныеПоДням(РезультатЗапроса);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция заполняет список доступных для выбора видов времени.
// В процедуре осуществляется очистка номера документа,
// а также производится установка параметров функциональных опций формы.
// Переопределяет соответствующий параметр формы.
//
&НаСервереБезКонтекста
Функция ПолучитьСписокВыбора(МассивОграничений)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыРабочегоВремени.Ссылка
	                      |ИЗ
	                      |	Справочник.ВидыРабочегоВремени КАК ВидыРабочегоВремени
	                      |ГДЕ
	                      |	(НЕ ВидыРабочегоВремени.Ссылка В (&МассивОграничений))
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВидыРабочегоВремени.Наименование");
						  
	Запрос.УстановитьПараметр("МассивОграничений", МассивОграничений);					  
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокВыбора = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Ссылка);	
	КонецЦикла; 
	
	Возврат СписокВыбора

КонецФункции // ПолучитьСписокВыбора()

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ПодольскийАИ #УчетПроектов 28.10.2020 {
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.Табель.ТабличныеЧасти.ОтработанноеВремяПоДням, НастройкиЗагрузкиДанных, ЭтотОбъект, Ложь);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	//ПодольскийАИ #УчетПроектов 28.10.2020 }
	
	ОтображениеПериодаРегистрации = Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	Если Объект.СпособВводаДанных = ПредопределенноеЗначение("Перечисление.СпособыВводаДанныхОВремени.ВцеломЗаПериод") Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаОтработанноеВремяЗаПериод;
	Иначе	
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаОтработанноеВремяПоДням;
	КонецЕсли;
	
	Если Объект.СпособВводаДанных <> ПредопределенноеЗначение("Перечисление.СпособыВводаДанныхОВремени.ВцеломЗаПериод") Тогда
	
		СоответствиеДнейНедели = Новый Соответствие;
 
		СоответствиеДнейНедели.Вставить(1, НСтр("ru = 'Пн'; ka = 'ორშ'")); 
		СоответствиеДнейНедели.Вставить(2, НСтр("ru = 'Вт'; ka = 'სამ'"));
		СоответствиеДнейНедели.Вставить(3, НСтр("ru = 'Ср'; ka = 'ოთხ'"));
		СоответствиеДнейНедели.Вставить(4, НСтр("ru = 'Чт'; ka = 'ხუთ'"));
		СоответствиеДнейНедели.Вставить(5, НСтр("ru = 'Пт'; ka = 'პარ'"));
		СоответствиеДнейНедели.Вставить(6, НСтр("ru = 'Сб'; ka = 'შაბ'"));
		СоответствиеДнейНедели.Вставить(7, НСтр("ru = 'Вс'; ka = 'კვ'"));
		
		
		Для День = 1 По День(КонецМесяца(Объект.ПериодРегистрации)) Цикл
			Элементы["ОтработанноеВремяПоДнямПервыйЧасы" + День].Заголовок = СоответствиеДнейНедели.Получить(ДеньНедели(Дата(Год(Объект.ПериодРегистрации), Месяц(Объект.ПериодРегистрации), День)));
		КонецЦикла;
		
		Для День = 28 По День(КонецМесяца(Объект.ПериодРегистрации)) Цикл
			Элементы["ОтработанноеВремяПоДнямПервыйЧасы" + День].Видимость = Истина;
			Элементы["ОтработанноеВремяПоДнямВторойЧасы" + День].Видимость = Истина;
			Элементы["ОтработанноеВремяПоДнямТретийЧасы" + День].Видимость = Истина;
			Элементы["ОтработанноеВремяПоДнямПервыйВидВремени" + День].Видимость = Истина;
			Элементы["ОтработанноеВремяПоДнямВторойВидВремени" + День].Видимость = Истина;
			Элементы["ОтработанноеВремяПоДнямТретийВидВремени" + День].Видимость = Истина;
		КонецЦикла;
		
		Для День = День(КонецМесяца(Объект.ПериодРегистрации)) + 1 По 31 Цикл
			Элементы["ОтработанноеВремяПоДнямПервыйЧасы" + День].Видимость = Ложь;
			Элементы["ОтработанноеВремяПоДнямВторойЧасы" + День].Видимость = Ложь;
			Элементы["ОтработанноеВремяПоДнямТретийЧасы" + День].Видимость = Ложь;
			Элементы["ОтработанноеВремяПоДнямПервыйВидВремени" + День].Видимость = Ложь;
			Элементы["ОтработанноеВремяПоДнямВторойВидВремени" + День].Видимость = Ложь;
			Элементы["ОтработанноеВремяПоДнямТретийВидВремени" + День].Видимость = Ложь;
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ Константы.ФункциональнаяОпцияИспользоватьСовместительство.Получить() Тогда
		Если Элементы.Найти("ОтработанноеВремяЗаПериодСотрудникКод") <> Неопределено Тогда
			Элементы.ОтработанноеВремяЗаПериодСотрудникКод.Видимость = Ложь;
		КонецЕсли;
		Если Элементы.Найти("ОтработанноеВремяПоДнямСотрудникКод") <> Неопределено Тогда
			Элементы.ОтработанноеВремяПоДнямСотрудникКод.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
		И СтрНайти(ИсточникВыбора.ИмяФормы, "ФормаКалендаря") > 0 Тогда
		
		Объект.ПериодРегистрации = КонецДня(ВыбранноеЗначение);
		УправлениеНебольшойФирмойКлиент.ПриИзмененииПериодаРегистрации(ЭтотОбъект);
		УстановитьДниНедели();
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаВыбора()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	СтруктураДанных = ПолучитьДанныеСтруктурнойЕдиницыПриИзменении(Объект.СтруктурнаяЕдиница);
	Объект.ПодписьОтветственного = СтруктураДанных.ПодписьОтветственного;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДатаКалендаряПриОткрытии = ?(ЗначениеЗаполнено(Объект.ПериодРегистрации), Объект.ПериодРегистрации, УправлениеНебольшойФирмойПовтИсп.ПолучитьТекущуюДатаСеанса());
	
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", УправлениеНебольшойФирмойКлиент.ПолучитьПараметрыОткрытияФормыКалендаря(ДатаКалендаряПриОткрытии), ЭтотОбъект);
	
КонецПроцедуры //ПериодРегистрацииНачалоВыбора()

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	УправлениеНебольшойФирмойКлиент.ПриРегулированииПериодаРегистрации(ЭтотОбъект, Направление);
	УправлениеНебольшойФирмойКлиент.ПриИзмененииПериодаРегистрации(ЭтотОбъект);
	УстановитьДниНедели();
	
КонецПроцедуры //ПериодРегистрацииРегулирование()

&НаКлиенте
Процедура СпособВводаДанныхПриИзменении(Элемент)
	
	Если Объект.СпособВводаДанных = ПредопределенноеЗначение("Перечисление.СпособыВводаДанныхОВремени.ВцеломЗаПериод") Тогда	
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаОтработанноеВремяЗаПериод;
	Иначе	
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаОтработанноеВремяПоДням;
	КонецЕсли;
	
	Если Объект.СпособВводаДанных = ПредопределенноеЗначение("Перечисление.СпособыВводаДанныхОВремени.ВцеломЗаПериод") Тогда
		Объект.ОтработанноеВремяПоДням.Очистить();
	Иначе
		Объект.ОтработанноеВремяЗаПериод.Очистить();
	КонецЕсли;

КонецПроцедуры

// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДатаПриИзменении()

// В процедуре осуществляется очистка номера документа.
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	// Обработка события изменения организации.
	Объект.Номер = "";
	СтруктураДанные = ПолучитьДанныеОрганизацияПриИзменении(Объект.Организация);
	Компания = СтруктураДанные.Компания;
	
	Объект.ПодписьРуководителя = СтруктураДанные.ПодписьРуководителя;
	Объект.ПодписьГлавногоБухгалтера = СтруктураДанные.ПодписьГлавногоБухгалтера;
	
КонецПроцедуры // ОрганизацияПриИзменении()

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
		
КонецПроцедуры

&НаКлиенте
Процедура ОтработанноеВремяЗаПериодСотрудникПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущиеДанные = Элементы.ОтработанноеВремяЗаПериод.ТекущиеДанные;
	
	Структура = Новый Структура;
	Структура.Вставить("Дата", КонецМесяца(Объект.ПериодРегистрации));
	Структура.Вставить("Организация", Объект.Организация);
	Структура.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
	ТекущиеДанные.Должность = ЗаполнитьДолжность(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработанноеВремяПоДнямСотрудникПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущиеДанные = Элементы.ОтработанноеВремяПоДням.ТекущиеДанные;
	
	Структура = Новый Структура;
	Структура.Вставить("Дата", КонецМесяца(Объект.ПериодРегистрации));
	Структура.Вставить("Организация", Объект.Организация);
	Структура.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
	ТекущиеДанные.Должность = ЗаполнитьДолжность(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработанноеВремяЗаПериодВидВремениНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ОтработанноеВремяЗаПериод.ТекущиеДанные;
	НомерЭлемента = Прав(Элемент.Имя, 1);
	
	МассивОграничений = Новый Массив;
	Для Счетчик = 1 По 6 Цикл
		Если Счетчик = НомерЭлемента Тогда
			Продолжить;
		КонецЕсли; 
		МассивОграничений.Добавить(ТекущаяСтрока["ВидВремени" + Счетчик]);	
	КонецЦикла; 
	
	ДанныеВыбора = ПолучитьСписокВыбора(МассивОграничений);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработанноеВремяПоДнямПервыйВидВремениНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ОтработанноеВремяПоДням.ТекущиеДанные;
	НомерЭлемента = СтрЗаменить(Элемент.Имя, "ОтработанноеВремяПоДнямПервыйВидВремени", "");
	
	МассивОграничений = Новый Массив;
	МассивОграничений.Добавить(ТекущаяСтрока["ВторойВидВремени" + НомерЭлемента]);
	МассивОграничений.Добавить(ТекущаяСтрока["ТретийВидВремени" + НомерЭлемента]);
	
	ДанныеВыбора = ПолучитьСписокВыбора(МассивОграничений);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработанноеВремяПоДнямВторойВидВремениНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ОтработанноеВремяПоДням.ТекущиеДанные;
	НомерЭлемента = СтрЗаменить(Элемент.Имя, "ОтработанноеВремяПоДнямВторойВидВремени", "");
	
	МассивОграничений = Новый Массив;
	МассивОграничений.Добавить(ТекущаяСтрока["ПервыйВидВремени" + НомерЭлемента]);
	МассивОграничений.Добавить(ТекущаяСтрока["ТретийВидВремени" + НомерЭлемента]);
	
	ДанныеВыбора = ПолучитьСписокВыбора(МассивОграничений);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработанноеВремяПоДнямТретийВидВремениНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ОтработанноеВремяПоДням.ТекущиеДанные;
	НомерЭлемента = СтрЗаменить(Элемент.Имя, "ОтработанноеВремяПоДнямТретийВидВремени", "");
	
	МассивОграничений = Новый Массив;
	МассивОграничений.Добавить(ТекущаяСтрока["ВторойВидВремени" + НомерЭлемента]);
	МассивОграничений.Добавить(ТекущаяСтрока["ПервыйВидВремени" + НомерЭлемента]);
	
	ДанныеВыбора = ПолучитьСписокВыбора(МассивОграничений);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДекорацияПечатьНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияРеквизитовПечати", ЭтотОбъект);
	ОткрытьФорму("Обработка.РеквизитыПечати.Форма.РеквизитыПечатиТабель", Новый Структура("КонтекстПечати", Объект), ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		УправлениеНебольшойФирмойКлиент.СообщитьОбОшибке(Объект, "Не указано подразделение!");
		Возврат;
	КонецЕсли;
	
	Если Объект.ПериодРегистрации = '00010101000000' Тогда
		УправлениеНебольшойФирмойКлиент.СообщитьОбОшибке(Объект, "Не указан период регистрации!");
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Если Объект.ОтработанноеВремяПоДням.Количество() > 0
	 ИЛИ Объект.ОтработанноеВремяЗаПериод.Количество() > 0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), НСтр("ka='ცხრილი გასუფთავდება! გავაგრძელოთ?';ru='Табличная часть будет очищена! Продолжить?';en='Tabular section will be cleared! Proceed?'"), Режим, 0);
	Иначе
		ЗаполнитьТабель();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТабель();
	Иначе 
		Возврат;
	КонецЕсли;

КонецПроцедуры // Заполнить()

//ПодольскийАИ #УчетПроектов 28.10.2020 {
// СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоИсточникаПоДням(Команда)
	
	НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Документ.Табель.ТабличнаяЧасть.ОтработанноеВремяПоДням";
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоИсточникаЗаПериод(Команда)
	
	НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Документ.Табель.ТабличнаяЧасть.ОтработанноеВремяЗаПериод";
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		ПолноеИмяОбъектаЗаполнения = ДополнительныеПараметры.ПолноеИмяОбъектаЗаполнения;
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			Если ПолноеИмяОбъектаЗаполнения = "Документ.Табель.ТабличнаяЧасть.ОтработанноеВремяПоДням" Тогда
				ОбработатьПодготовленныеДанныеПоДням(РезультатЗагрузки);
			ИначеЕсли ПолноеИмяОбъектаЗаполнения = "Документ.Табель.ТабличнаяЧасть.ОтработанноеВремяЗаПериод" Тогда
				ОбработатьПодготовленныеДанныеЗаПериод(РезультатЗагрузки);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ЗагрузитьИзФайлаЗавершение(РезультатЗагрузки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодготовленныеДанныеПоДням(РезультатЗагрузки)
	
	Попытка
		
		НачатьТранзакцию();
		
		ЭтоВидВремени = Истина;
		ТекСотрудник = Неопределено;
		ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			Если ЗагрузкаВПриложениеВозможна Тогда
				
				Если ТекСотрудник = Неопределено Тогда
					ТекСотрудник = СтрокаТаблицы.Сотрудник;
				КонецЕсли;
				
				Если ТекСотрудник <> СтрокаТаблицы.Сотрудник Тогда
					ЭтоВидВремени = Истина;
				КонецЕсли;
				
				Если ЭтоВидВремени Тогда
					НоваяСтрока = Объект.ОтработанноеВремяПоДням.Добавить();
				КонецЕсли;
				
				НоваяСтрока.Сотрудник = СтрокаТаблицы.Сотрудник;
				НоваяСтрока.Должность = СтрокаТаблицы.Должность;
				
				Для НомСтр = 1 По 31 Цикл
					ИмяПоля = "День" + Строка(НомСтр);
					ИмяПоляВхДанные = ИмяПоля + "_ВходящиеДанные";
					МассивЗначений = СтрРазделить(СтрокаТаблицы[ИмяПоляВхДанные], "/", Ложь);
					НомерВидВремени = 1;
					Для Каждого ТекЗначение Из МассивЗначений Цикл
						ИмяПоляСтроки = ОпределитьИмяПоляДокумента(ЭтоВидВремени, НомерВидВремени, НомСтр);
						Если ЭтоВидВремени Тогда
							ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьВидРабочегоВремени(НоваяСтрока[ИмяПоляСтроки], ТекЗначение);
						Иначе
							ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(НоваяСтрока[ИмяПоляСтроки], ТекЗначение);
						КонецЕсли;
						НомерВидВремени = НомерВидВремени + 1;
						Если НомерВидВремени >= 4 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
				ЭтоВидВремени = Не ЭтоВидВремени;
				ТекСотрудник = СтрокаТаблицы.Сотрудник;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Модифицированность = Истина;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ka='მონაცემების ჩატვირთვა';ru='Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.Табель, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодготовленныеДанныеЗаПериод(РезультатЗагрузки)
	
	Попытка
		
		НачатьТранзакцию();
		
		ЭтоВидВремени = Истина;
		ЭтоДни = Ложь;
		ЭтоЧасы = Ложь;
		ТекСотрудник = Неопределено;
		ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			Если ЗагрузкаВПриложениеВозможна Тогда
				
				Если ТекСотрудник = Неопределено Тогда
					ТекСотрудник = СтрокаТаблицы.Сотрудник;
				КонецЕсли;
				
				Если ТекСотрудник <> СтрокаТаблицы.Сотрудник Тогда
					ЭтоВидВремени = Истина;
					ЭтоДни = Ложь;
					ЭтоЧасы = Ложь;
				КонецЕсли;
				
				Если ЭтоВидВремени Тогда
					НоваяСтрока = Объект.ОтработанноеВремяЗаПериод.Добавить();
				КонецЕсли;
				
				НоваяСтрока.Сотрудник = СтрокаТаблицы.Сотрудник;
				НоваяСтрока.Должность = СтрокаТаблицы.Должность;
				
				Для НомСтр = 1 По 6 Цикл
					Если ЭтоВидВремени Тогда
						ИмяПоля = "ВидВремени" + Строка(НомСтр);
					ИначеЕсли ЭтоДни Тогда
						ИмяПоля = "Дней" + Строка(НомСтр);
					ИначеЕсли ЭтоЧасы Тогда
						ИмяПоля = "Часов" + Строка(НомСтр);
					Иначе
						Продолжить;
					КонецЕсли;
					
					ИмяПоляВхДанные = "ВидВремени" + Строка(НомСтр) + "_ВходящиеДанные";
					Если ЭтоВидВремени Тогда
						ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьВидРабочегоВремени(НоваяСтрока[ИмяПоля], СтрокаТаблицы[ИмяПоляВхДанные]);
					Иначе
						ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(НоваяСтрока[ИмяПоля], СтрокаТаблицы[ИмяПоляВхДанные]);
					КонецЕсли;
					
				КонецЦикла;
				
				Если ЭтоВидВремени Тогда
					ЭтоВидВремени = Ложь;
					ЭтоДни = Истина;
					ЭтоЧасы = Ложь;
				ИначеЕсли ЭтоДни Тогда
					ЭтоВидВремени = Ложь;
					ЭтоДни = Ложь;
					ЭтоЧасы = Истина;
				ИначеЕсли ЭтоЧасы Тогда
					ЭтоВидВремени = Истина;
					ЭтоДни = Ложь;
					ЭтоЧасы = Ложь;
				КонецЕсли;
				
				ТекСотрудник = СтрокаТаблицы.Сотрудник;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Модифицированность = Истина;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ka='მონაცემების ჩატვირთვა';ru='Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.Табель, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных)

КонецПроцедуры

&НаСервере
Функция ОпределитьИмяПоляДокумента(ЭтоВидВремени, НомерВидВремени, НомСтр)
	
	ИмяПоля = "Первый";
	Если НомерВидВремени = 2 Тогда
		ИмяПоля = "Второй";
	ИначеЕсли НомерВидВремени = 3 Тогда
		ИмяПоля = "Третий";
	КонецЕсли;
	
	Если ЭтоВидВремени Тогда
		ИмяПоля = ИмяПоля + "ВидВремени";
	Иначе
		ИмяПоля = ИмяПоля + "Часы";
	КонецЕсли;
	
	ИмяПоля = ИмяПоля + Строка(НомСтр);
	
	Возврат ИмяПоля;
	
КонецФункции

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла
//ПодольскийАИ #УчетПроектов 28.10.2020 }

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти
