// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
#Область AzRy

&НаКлиенте
Процедура ПослеЗакрытияВопросаСоздатьДокументСчетФактураОтправленный(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе 		    
		ПослеЗакрытияВопросаСоздатьДокументСчетФактураОтправленныйСервер();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗакрытияВопросаСоздатьДокументСчетФактураОтправленныйСервер()
	
	Массив = Объект.Ссылка.ДокументыОснования.ВыгрузитьКолонку("ДокументОснование");	
	Если ТипЗнч(Массив[0].Ссылка) <> Тип("ДокументСсылка.ЧекККМ") Или Массив.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли Массив[0].Контрагент.НалогообложениеНДС <> Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не AzRyРаботаСДокументамыКлиентСервер.ОснованиеСуществует(Массив) Тогда		
		Ответ = AzRyРаботаСДокументамыКлиентСервер.СоздатьСчетФактуру(Объект.Ссылка.ДокументыОснования.ВыгрузитьКолонку("ДокументОснование"), Объект.Ссылка);
		Если Ответ.Ошибка Тогда
			Сообщить(Ответ.ТекстОшибки, СтатусСообщения.ОченьВажное);		
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
