
Перем ВремяСозданияДокументов;  

// Олег Литвиненко 04.11.22 --->
Перем ВариантЗаполненияРасшифровки;// Олег Литвиненко <---

&НаСервере
Процедура СоздатьДокументы(СтруктураБанков)Экспорт
	
	ВремяСозданияДокументов = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВремяДляДокументовПомошникаЗагрузкиИзБанка");
	СтруктураОтбора  = Новый Структура; 
	СтруктураОтбора.Вставить("_Загружать", Истина); 
	ТаблицаСоздаваемыхДокументов = ТаблицаВыписки.Выгрузить().Скопировать(СтруктураОтбора);
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.ИНН КАК ИНН
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И НЕ Контрагенты.ЭтоГруппа";
	
	тзКонтрагенты = Запрос.Выполнить().Выгрузить();      
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеСчета.Ссылка КАК Ссылка,
		|	БанковскиеСчета.НомерСчета КАК НомерСчета
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	НЕ БанковскиеСчета.ПометкаУдаления";
	
	тзБанковскиеСчета = Запрос.Выполнить().Выгрузить();
	
	//Для Каждого стрДанные Из МассивДанных Цикл 
	//	Если ЗначениеЗаполнено(стрДанные._ШаблонЗаполнения) И Не ЗначениеЗаполнено(стрДанные._СсылкаНаДокумент) Тогда 
	//		СоздатьДокументПоДанным(стрДанные);
	//	ИначеЕсли НЕ ЗначениеЗаполнено(стрДанные._ШаблонЗаполнения)Тогда 
	//		Сообщить(Строка(стрДанные.НомерСтроки) + НСтр("ru = ' სტრიქონზე არ არის შვესებული შევსების წესი'; ka = ' სტრიქონზე არ არის შვესებული ""შევსების წესი""'"));
	//	ИначеЕсли ЗначениеЗаполнено(стрДанные._СсылкаНаДокумент)Тогда 
	//		Сообщить(Строка(стрДанные.НомерСтроки) + НСтр("ru = ' დოკუმენტი უკვე შექმნილია'; ka = ' დოკუმენტი უკვე შექმნილია'"));
	//	КонецЕсли;
	//КонецЦикла;
	
	// Олег Литвиненко 04.11.22 --->
	//++lyskov 19.02.2023 Замена на оптимизированный метод получения учетной политики из кэша.
	ВариантЗаполненияРасшифровки = РегистрыСведений.УчетнаяПолитикаРегл.ЗначениеПоляУчетнойПолитики("ВариантЗаполненияРасшифровки", Организация);
	// Олег Литвиненко <---
	
	Для Каждого стрДанные Из ТаблицаСоздаваемыхДокументов Цикл
		
		ПоисхДулейНомеровдокументов = ТаблицаСоздаваемыхДокументов.НайтиСтроки(Новый Структура("НомерДокумента", стрДанные.НомерДокумента));  
		ЕстьДублиДокументов = ПоисхДулейНомеровдокументов.Количество() > 1;
			
		Если ЗначениеЗаполнено(стрДанные._ШаблонЗаполнения) И Не ЗначениеЗаполнено(стрДанные._СсылкаНаДокумент) Тогда 
			
			СоздатьДокументПоДанным(стрДанные, тзКонтрагенты, СтруктураБанков, ЕстьДублиДокументов, тзБанковскиеСчета);
			
		ИначеЕсли ЗначениеЗаполнено(стрДанные._СсылкаНаДокумент)Тогда 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(стрДанные.НомерСтроки) + НСтр("ru = ' Документ уже создан'; ka = ' დოკუმენტი უკვე შექმნილია'"));
			
		ИначеЕсли НЕ ЗначениеЗаполнено(стрДанные._ШаблонЗаполнения)Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(стрДанные.НомерСтроки) + НСтр("ru = ' В строке не указано правило заполнения'; ka = ' სტრიქონზე არ არის შვესებული ""შევსების წესი""'"));
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьСозданиеКомиссийИДозаполнениеОсновныхДокументов(СтруктураБанков)
	
	ТаблицаКоммисий = Неопределено;
	
	Если СтруктураБанков.ЭтоBOG Тогда 
		ТаблицаКоммисий = ТаблицаВыписки.Выгрузить(Новый Структура("_Загружать,ТипОперации", Истина, "COM"));
	ИначеЕсли СтруктураБанков.ЭтоTBC Тогда 
		ТаблицаКоммисий = ТаблицаВыписки.Выгрузить(Новый Структура("_Загружать,ТипОперации", Истина, "*TF%*"));
	Иначе
		//Не обрабатываемы банки
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаКомиссии Из ТаблицаКоммисий Цикл 
		
		ПоискОсновногоДокумента = ТаблицаВыписки.НайтиСтроки(Новый Структура("НомерДокумента", СтрокаКомиссии.НомерДокумента));
		
		Для Каждого СтрокаПоиска Из ПоискОсновногоДокумента Цикл 
			
			//Нашли самого семя или нечего обрабатывать
			Если СтруктураБанков.ЭтоBOG И СтрокаПоиска.ТипОперации = "COM" Тогда 
				Продолжить;
			ИначеЕсли СтруктураБанков.ЭтоTBC И СтрокаПоиска.ТипОперации = "*TF%*" Тогда 
				Продолжить;
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаПоиска._СсылкаНаДокумент) Тогда 
				Продолжить;
			КонецЕсли; 
			
			//Дополним документ комиссией и добавим документ в строку выписки комиссии
			ДокументОбъект = СтрокаПоиска._СсылкаНаДокумент.ПолучитьОбъект();
			
			ДокументОбъект.СуммаКомиссииБанка = СтрокаКомиссии.СуммаДТ; 
			ДокументОбъект.ВалютаКомисииБанка = ДокументОбъект.ВалютаДокумента;  
			ДокументОбъект.КурсКомиссииБанка = 1;
			ДокументОбъект.КратностьКомиссииБанка = 1;
			ДокументОбъект.СтатьяРасходовКомиссииБанка = СтрокаПоиска._ШаблонЗаполнения.СтатьяРасходовКомиссииБанка;
			ДокументОбъект.СчетРасходовКомиссииБанка = ДокументОбъект.СтатьяРасходовКомиссииБанка.СчетУчета;
			
			Если ДокументОбъект.Проведен Тогда 
				
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					СтрокаКомиссии._СсылкаНаДокумент = СтрокаПоиска._СсылкаНаДокумент;
				Исключение
			        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось перепровести документ " + СтрокаПоиска._СсылкаНаДокумент);
				КонецПопытки;
				
			Иначе                                                                                                
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				СтрокаКомиссии._СсылкаНаДокумент = СтрокаПоиска._СсылкаНаДокумент;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	

КонецПроцедуры

&НаСервере
Процедура СоздатьДокументПоДанным(Данные, тзКонтрагенты, СтруктураБанков, ЕстьДублиДокументов, тзБанковскиеСчета) Экспорт
	
	НацВалюта = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("НациональнаяВалюта");

	текШаблонЗаполнения =  Данные._ШаблонЗаполнения;
	ОбъектШаблон = текШаблонЗаполнения.ПолучитьОбъект();	


	
	
	этоПеремещениеДС = текШаблонЗаполнения.СсылкаИсточника = "ПеремещениеДС";
	этоКонвертация	 = текШаблонЗаполнения.СсылкаИсточника = "Конвертация";
	
	ЗаполнитьВидОперации = 	не этоПеремещениеДС И не этоКонвертация;
	
	//Malyshev 2024-05-24 ONESOFT-3063 - перенес в модуль объекта шаблона и дополнил - начало
	//ЗаполнитьКонтрагент = текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя 
	//ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика
	//ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам//Паганини
	//ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Покупателю	
	//ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Поставщику
	//; 
	ЗаполнитьКонтрагент = ОбъектШаблон.ВидимостьКонтрагента();                      
	//Malyshev 2024-05-24 ONESOFT-3063 - окончание
	
	ЗаполнитьСчетКонтрагента = текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет;
	
	ЗаполнитьПодотчетник=  текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику;

	ЗаполнитьВидНалога =  текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Налоги
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги;
	
	ЗаполнитьКорреспонденция =  текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Прочее
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Прочее;

	СоздаватьКонтрагента = НЕ текШаблонЗаполнения.СсылкаИсточника = "ПеремещениеДС";
	//+++ Дмгг, 11.04.2025, ONESOFT-3973
	ЭтоРасходСоСчетаПереводОднимДокументом = ОбъектШаблон.ЭтоРасходдСосчетаПереводСПометкойПеремещения();
	//--- Дмгг, 11.04.2025, ONESOFT-3973
	// Олег Литвиненко 20.04.23 --->
	КонтрагентИзШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(текШаблонЗаполнения, "Контрагент");
	СоздаватьКонтрагента = СоздаватьКонтрагента И Не ЗначениеЗаполнено(КонтрагентИзШаблона);
	
	Данные.Контрагент1С = ?(ЗначениеЗаполнено(КонтрагентИзШаблона), КонтрагентИзШаблона, Данные.Контрагент1С);
	// Олег Литвиненко <---
	
	врСсылкаИсточника   =  текШаблонЗаполнения.СсылкаИсточника;
	
	ТекСумма = 0;
	ТекСуммаКомиссии = 0;
	
	Если Данные.СуммаКТ > 0 Тогда 	
		ТекСумма =  Данные.СуммаКТ;
	ИначеЕсли Данные.СуммаДТ > 0 Тогда
		ТекСумма =  Данные.СуммаДТ;
	КонецЕсли;
	
	Пользователь = Пользователи.ТекущийПользователь();  
	ВидДоговора = Перечисления.ВидыДоговоров.ПустаяСсылка();
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если НЕ ЗначениеЗаполнено(Данные.Контрагент1С) И СоздаватьКонтрагента И СоздаватьНеНайденныхКонтрагентов
		И (ЗначениеЗаполнено(Данные.Наименование) ИЛИ ЗначениеЗаполнено(Данные.ИНН)) Тогда   
		
		СтруктураТипаКонтрагента = Новый Структура("Покупатель,Поставщик,ПрочиеОтношения", Ложь, Ложь, Ложь);
		
		Если текШаблонЗаполнения.СсылкаИсточника = "РасходСоСчета" Тогда  
			
			СтруктураТипаКонтрагента.Поставщик 	= Истина;      
			Данные.Контрагент1С 				= СоздатьКонтрагента(Данные.ИНН, Данные.Наименование, СтруктураТипаКонтрагента, тзКонтрагенты);     
			ВидДоговора = Перечисления.ВидыДоговоров.СПоставщиком; 
			   
		ИначеЕсли текШаблонЗаполнения.СсылкаИсточника = "ПоступлениеНаСчет" Тогда
			
			СтруктураТипаКонтрагента.Покупатель = Истина;      
			Данные.Контрагент1С 				= СоздатьКонтрагента(Данные.ИНН, Данные.Наименование, СтруктураТипаКонтрагента, тзКонтрагенты);  
			ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем;
			
		ИначеЕсли этоКонвертация И не ЗначениеЗаполнено(Данные.СчетКонтрагента1С) Тогда
			
			Если Данные.ИННДт = Данные.ИННКт Тогда 
				ВладелецСчета = Организация;
				Данные.Контрагент1С = Организация;
				Данные.СчетКонтрагента1С = СоздатьСчетКонтрагента(ВладелецСчета, Данные.СчетБанк, тзБанковскиеСчета);
			КонецЕсли;
			
		КонецЕсли; 
		
	ИначеЕсли ЗначениеЗаполнено(Данные.Контрагент1С) Тогда 
		
		Если  текШаблонЗаполнения.СсылкаИсточника = "ПоступлениеНаСчет" Тогда 
			
			ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем;
			
		ИначеЕсли текШаблонЗаполнения.СсылкаИсточника = "РасходСоСчета" Тогда
			
			ВидДоговора = Перечисления.ВидыДоговоров.СПоставщиком;
			
			//Malyshev 2024-05-24 ONESOFT-3063
			Если текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам Тогда
				ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
			КонецЕсли;	
			
		КонецЕсли;
		
	Иначе
		ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем;
	КонецЕсли;    
	
	Если НЕ ЗначениеЗаполнено(Данные.СчетКонтрагента1С) 
		И (ЗначениеЗаполнено(Данные.Контрагент1С) ИЛИ ЗначениеЗаполнено(Данные.Подотчетник1С))
		И СоздаватьБанковскиеСчета Тогда    
		
		Если НЕ текШаблонЗаполнения.СсылкаИсточника = "ПеремещениеДС" Тогда 
			//ВладелецСчета = ?(ЗначениеЗаполнено(Данные.Контрагент1С), Данные.Контрагент1С, Данные.Подотчетник1С.Физлицо);
			ВладелецСчета = ?(ЗначениеЗаполнено(Данные.Контрагент1С), Данные.Контрагент1С, Данные.Подотчетник1С);
		Иначе
			ВладелецСчета = Организация;
		КонецЕсли;
		
		Данные.СчетКонтрагента1С = СоздатьСчетКонтрагента(ВладелецСчета, Данные.СчетБанк, тзБанковскиеСчета); 
		
	ИначеЕсли  НЕ ЗначениеЗаполнено(Данные.СчетКонтрагента1С) И этоКонвертация И СоздаватьБанковскиеСчета Тогда 
		
		Данные.СчетКонтрагента1С = СоздатьСчетКонтрагента(Организация, Данные.СчетБанк, тзБанковскиеСчета);
		
	ИначеЕсли  НЕ ЗначениеЗаполнено(Данные.СчетКонтрагента1С) И этоКонвертация Тогда 
		
		ПоисСчета = тзБанковскиеСчета.НайтиСтроки(Новый Структура("НомерСчета", Данные.СчетБанк));
		Если ПоисСчета.Количество() > 0 Тогда 
			Данные.СчетКонтрагента1С = ПоисСчета[0].Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	новыйДокумент = Документы[врСсылкаИсточника].СоздатьДокумент();
	//+++ Дмгг
	//новыйДокумент.Дата = Данные.Дата;
	МетаданныеДокумента = новыйДокумент.Метаданные();
	ОсновнаяДата = Формат(НачалоДня(Данные.Дата), "ДФ=""ггггММдд""");
	ВремяДляДаты = Формат(ВремяСозданияДокументов, "ДФ=""ЧЧммсс""");
	ДатаДокумента  = Дата(ОсновнаяДата + ВремяДляДаты);
	новыйДокумент.Дата = ДатаДокумента;  
	//--- Дмгг
	новыйДокумент.Организация = Организация;                                 
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НалогообложениеНДС", МетаданныеДокумента)
		И ЗначениеЗаполнено(Организация) Тогда 
		новыйДокумент.НалогообложениеНДС = Организация.НалогообложениеНДС; 
	КонецЕсли;
	Если ЗаполнитьВидОперации Тогда 
		новыйДокумент.ВидОперации = текШаблонЗаполнения.ВидОперации;
		//+++ Дмгг
		Если новыйДокумент.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Прочее Тогда 
			новыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		КонецЕсли;
		//--- Дмгг   
		
		//Malyshev 2024-05-30 ONESOFT-3187
		Если (
				новыйДокумент.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПереводСДругогоСчета 
	            ИЛИ
				новыйДокумент.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет
			)
			и ЗначениеЗаполнено(Данные.СчетКонтрагента1С) 
			и ТипЗнч(Данные.СчетКонтрагента1С.Владелец)=Тип("СправочникСсылка.Организации")
			Тогда
				новыйДокумент.СчетКонтрагента = Данные.СчетКонтрагента1С;
		//+++ Дмгг, 20.06.2025, ONESOFT-4128     
		// Ноаведь есть и другие виды операций...   
		ИначеЕсли ЗначениеЗаполнено(Данные.СчетКонтрагента1С)  Тогда 
		    	новыйДокумент.СчетКонтрагента = Данные.СчетКонтрагента1С;   
		//--- Дмгг, 20.06.2025, ONESOFT-4128
		КонецЕсли;	
		
			    
		
	КонецЕсли; 
	
	//Малышев 2024-09-19 ONESOFT-3463
	Если ТипЗнч(новыйДокумент) = Тип("ДокументОбъект.РасходСоСчета")
		и ОбъектШаблон.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет 
		Тогда
		новыйДокумент.Перемещение = ОбъектШаблон.Перемещение;
	КонецЕсли;	
	
	

	//Malyshev 2024-05-24 ONESOFT-2757
	Если ОбъектШаблон.ВидимостьВидаУдержания() 
		и ОбщегоНазначения.ЕстьРеквизитОбъекта("ВидУдержания", МетаданныеДокумента) 
		и ЗначениеЗаполнено(ОбъектШаблон.ВидУдержания) 
	Тогда
		новыйДокумент.ВидУдержания = ОбъектШаблон.ВидУдержания; 
	КонецЕсли;	
	
	//Malyshev 2024-05-24 ONESOFT-3063
	Если ОбъектШаблон.ВидимостьСотрудника() 
		и ОбщегоНазначения.ЕстьРеквизитОбъекта("Подотчетник", МетаданныеДокумента) 
		и ЗначениеЗаполнено(ОбъектШаблон.Сотрудник) 
	Тогда     
		новыйДокумент.Подотчетник = ОбъектШаблон.Сотрудник; 	
	КонецЕсли;
	
	Если ОбъектШаблон.ВидимостьДоговораКредитаЗайма() 
		и ОбщегоНазначения.ЕстьРеквизитОбъекта("ДоговорКредитаЗайма", МетаданныеДокумента) 
		и ЗначениеЗаполнено(ОбъектШаблон.ДоговорКредитаЗайма) 
	Тогда     
		новыйДокумент.ДоговорКредитаЗайма = ОбъектШаблон.ДоговорКредитаЗайма; 	
	КонецЕсли;
	
	
	
	новыйДокумент.Статья = текШаблонЗаполнения.Статья;
	новыйДокумент.Автор  = Автор; 
	Если МетаданныеДокумента.Реквизиты.Найти("ДополнительноеЗначение") <> Неопределено Тогда
		
		новыйДокумент.ДополнительноеЗначение = Данные.ДополнительноеЗначение;	
	
	КонецЕсли;
	
	Если этоКонвертация Тогда 
		
		ОбработатьДанныеДляКонвертации(новыйДокумент, Данные, НацВалюта, ВалютаУчета);
		
	ИначеЕсли этоПеремещениеДС Тогда 
		
		новыйДокумент.ТипДенежныхСредств			= Перечисления.ТипыДенежныхСредств.Безналичные;
		новыйДокумент.ТипДенежныхСредствПолучатель  = Перечисления.ТипыДенежныхСредств.Безналичные;
		новыйДокумент.ВалютаДенежныхСредств			= БанковскийСчет.ВалютаДенежныхСредств;
		новыйДокумент.СуммаДокумента			    = ТекСумма;
		
		Если текШаблонЗаполнения.ТекСчетПолучатель Тогда 
			новыйДокумент.БанковскийСчетПолучатель = БанковскийСчет;
			новыйДокумент.БанковскийСчет =  Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", Данные.СчетБанк);
		Иначе 
			новыйДокумент.БанковскийСчет = БанковскийСчет;
			новыйДокумент.БанковскийСчетПолучатель =  Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", Данные.СчетБанк);
		КонецЕсли;
		
	Иначе 
		
			

		
		СпособЗаполненияРасшифровки = РегистрыСведений.УчетнаяПолитикаРегл.ЗначениеПоляУчетнойПолитики("ВариантЗаполненияРасшифровки", БанковскийСчет.Владелец, ДатаДокумента);
		//+++ Дмгг, 11.04.2025, ONESOFT-3973
		Если ЭтоРасходСоСчетаПереводОднимДокументом Тогда 
			
			Если Данные.СуммаКТ > 0 Тогда
				новыйДокумент.БанковскийСчет = Данные.СчетКонтрагента1С;
				новыйДокумент.ВалютаДенежныхСредств = Данные.СчетКонтрагента1С.ВалютаДенежныхСредств;
			Иначе
				новыйДокумент.БанковскийСчет = БанковскийСчет;
				новыйДокумент.ВалютаДенежныхСредств = БанковскийСчет.ВалютаДенежныхСредств;
			КонецЕсли;
			
		Иначе
			
			новыйДокумент.БанковскийСчет = БанковскийСчет;
			новыйДокумент.ВалютаДенежныхСредств = БанковскийСчет.ВалютаДенежныхСредств;
			
		КонецЕсли;
		//--- Дмгг, 11.04.2025, ONESOFT-3973
		
		Если ЗаполнитьКонтрагент Тогда
			новыйДокумент.Контрагент = Данные.Контрагент1С;
			новыйДокумент.СчетКонтрагента = Данные.СчетКонтрагента1С; 
			Если ЗначениеЗаполнено(Данные.Контрагент1С) Тогда
				новыйДокумент.НалогообложениеНДС = Данные.Контрагент1С.НалогообложениеНДС;
			Иначе
				новыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
			КонецЕсли;//Паганини
		ИначеЕсли ЗаполнитьСчетКонтрагента Тогда 
			//+++ Дмгг, 11.04.2025, ONESOFT-3973
			Если ЭтоРасходСоСчетаПереводОднимДокументом Тогда
				Если Данные.СуммаКТ > 0 Тогда
					новыйДокумент.СчетКонтрагента = БанковскийСчет;
				Иначе
					новыйДокумент.СчетКонтрагента = Данные.СчетКонтрагента1С;
				КонецЕсли;
			Иначе 
				новыйДокумент.СчетКонтрагента = Данные.СчетКонтрагента1С;
			КонецЕсли;
			//--- Дмгг, 11.04.2025, ONESOFT-3973
		КонецЕсли;
		Если ЗаполнитьПодотчетник Тогда
			новыйДокумент.Подотчетник = Данные.Подотчетник1С;
		КонецЕсли;
		новыйДокумент.СуммаДокумента  = ТекСумма;
		
		
		//Малышев 2024-09-19 ONESOFT-3467
		Если ТипЗнч(новыйДокумент) = Тип("ДокументОбъект.ПоступлениеНаСчет")
			и ОбъектШаблон.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам 
			Тогда
			новыйДокумент.ЭквайринговыйТерминал = ОбъектШаблон.ЭквайринговыйТерминал;
			
			НомерПлатежнойКарты = "б/н";
			ВидПлатежнойКарты = "" + новыйДокумент.ЭквайринговыйТерминал.ВидыПлатежныхКарт[0].ВидПлатежнойКарты;
			
			//Малышев 2024-09-24 ONESOFT-3472
			//Выделим комиссию банку за эквайринг
			Если СтруктураБанков.ЭтоTBC Тогда
				МассивНазначения = СтрРазделить(Данные.НазначениеПлатежа,",");
				Если МассивНазначения.Количество() >= 4 Тогда
					СуммаПлатежа = Число("0" + СокрЛП(МассивНазначения[3]));
					Если СуммаПлатежа>ТекСумма Тогда
						ТекСуммаКомиссии = СуммаПлатежа - ТекСумма;
						ТекСумма = СуммаПлатежа;
						
						новыйДокумент.СуммаДокумента = ТекСумма;
						новыйДокумент.СуммаКомиссииДокумента = ТекСуммаКомиссии;
						новыйДокумент.СуммаУчета = ТекСумма;
						
					КонецЕсли;	
					
					ВидПлатежнойКарты = СокрЛП(МассивНазначения[2]);
				КонецЕсли;
				
			ИначеЕсли СтруктураБанков.ЭтоBOG Тогда
				МассивНазначения = СтрРазделить(Данные.НазначениеПлатежа,";");
				Если МассивНазначения.Количество()>2 ТОгда
					СтрокаСуммы = МассивНазначения[1];
					Если СтрНайти(СтрокаСуммы,"თანხა")>0 Тогда
						МассивНазначенияСуммы = СтрРазделить(СтрокаСуммы," ", Ложь);
						Если МассивНазначенияСуммы.Количество() >= 2 Тогда
							СуммаПлатежа = Число("0" + СокрЛП(МассивНазначенияСуммы[1]));
							Если СуммаПлатежа>ТекСумма Тогда
								ТекСуммаКомиссии = СуммаПлатежа - ТекСумма;
								ТекСумма = СуммаПлатежа;
								
								новыйДокумент.СуммаДокумента = ТекСумма;
								новыйДокумент.СуммаКомиссииДокумента = ТекСуммаКомиссии;
								новыйДокумент.СуммаУчета = ТекСумма;
							КонецЕсли;	
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;
				
				Если МассивНазначения.Количество()>4 ТОгда
					МассивОписаниеКарты = СтрРазделить(МассивНазначения[3]," ", Ложь);
					Если МассивОписаниеКарты.Количество()>=2 Тогда
						ВидПлатежнойКарты = МассивОписаниеКарты[1];
					КонецЕсли;	
					Если МассивОписаниеКарты.Количество()>=3 Тогда
						НомерПлатежнойКарты = МассивОписаниеКарты[2];
					КонецЕсли;	
				КонецЕсли;	
				
				//СтрокаПроцента = МассивНазначения[2];
				
			КонецЕсли;	
			
			//Малышев 2024-09-25 ONESOFT-3473
			ЗаполнимЭквайринговыеОперацииНовогоДокумента(новыйДокумент, ТекСумма, ТекСуммаКомиссии, ВидПлатежнойКарты, НомерПлатежнойКарты);
			
		КонецЕсли;
		
		
		ПересчитатьСуммыДокумента(новыйДокумент,Неопределено,1, 1);
		
		Если текШаблонЗаполнения.СсылкаИсточника = "РасходСоСчета" Тогда 
			СуммаДокументаПриИзмененииРасход(новыйДокумент);
		ИначеЕсли текШаблонЗаполнения.СсылкаИсточника = "ПоступлениеНаСчет" Тогда
			ПриИзмененииСуммыПоступленияНаССчет(новыйДокумент);
		КонецЕсли;
		
		Если ЗаполнитьВидНалога Тогда
			новыйДокумент.ВидНалога = текШаблонЗаполнения.ВидНалога;
		КонецЕсли;
		
		Если ЗаполнитьКорреспонденция Тогда
			новыйДокумент.Корреспонденция = текШаблонЗаполнения.Корреспонденция;
			новыйДокумент.КорреспонденцияРегл = текШаблонЗаполнения.КорреспонденцияРегл;
		КонецЕсли;
		
		
		Если текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Поставщику Тогда //+++ Дмгг
			
			НовСтрокДоговорыАвтоЗачетаДолгов = новыйДокумент.ДоговорыАвтоЗачетаДолгов.Добавить();     
			Если ЗаполнитьКонтрагент И текШаблонЗаполнения.ЗаполнитьДоговор Тогда
				Если новыйДокумент.ВалютаДенежныхСредств = УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета() Тогда 
					ДоговорКонтрагента = новыйДокумент.Контрагент.ДоговорПоУмолчанию;
				Иначе
					ДоговорКонтрагента = НайтиДоговорКонтрагентаПоВалюте(новыйДокумент.Контрагент,БанковскийСчет.ВалютаДенежныхСредств);
				КонецЕсли;
				НовСтрокДоговорыАвтоЗачетаДолгов.Договор = ДоговорКонтрагента;
			КонецЕсли;         
			НовСтрокДоговорыАвтоЗачетаДолгов.СуммаПлатежа = новыйДокумент.СуммаДокумента;
			новыйДокумент.ВариантЗаполненияРасшифровки = Перечисления.ВариантыЗаполненияРасшифровкиПлатежа.Автоматически;
			ЗаполнитьРасшифровкуПлатежаАвтоЗачетДолговРасход(новыйДокумент);
			новыйДокумент.ВариантЗаполненияРасшифровки = СпособЗаполненияРасшифровки;
			
		ИначеЕсли текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя Тогда	
			
			НовСтрокДоговорыАвтоЗачетаДолгов = новыйДокумент.ДоговорыАвтоЗачетаДолгов.Добавить();     
			Если ЗаполнитьКонтрагент И текШаблонЗаполнения.ЗаполнитьДоговор Тогда
				Если новыйДокумент.ВалютаДенежныхСредств = УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета() Тогда 
					ДоговорКонтрагента = новыйДокумент.Контрагент.ДоговорПоУмолчанию;
				Иначе
					ДоговорКонтрагента = НайтиДоговорКонтрагентаПоВалюте(новыйДокумент.Контрагент,БанковскийСчет.ВалютаДенежныхСредств);
				КонецЕсли;
				НовСтрокДоговорыАвтоЗачетаДолгов.Договор = ДоговорКонтрагента;
			КонецЕсли;         
			НовСтрокДоговорыАвтоЗачетаДолгов.СуммаПлатежа = новыйДокумент.СуммаДокумента;
			новыйДокумент.ВариантЗаполненияРасшифровки = Перечисления.ВариантыЗаполненияРасшифровкиПлатежа.Автоматически;
			ЗаполнитьРасшифровкуПлатежаАвтоЗачетДолговПриход(новыйДокумент);
			новыйДокумент.ВариантЗаполненияРасшифровки = СпособЗаполненияРасшифровки;
			
		Иначе     
			
			нстрРасшифровкаПлатежа = новыйДокумент.РасшифровкаПлатежа.Добавить();
			НовСтрокДоговорыАвтоЗачетаДолгов = новыйДокумент.ДоговорыАвтоЗачетаДолгов.Добавить(); //+++ Дмгг
			Если ЗаполнитьКонтрагент И текШаблонЗаполнения.ЗаполнитьДоговор Тогда
				//+++ Дмгг
				//нстрРасшифровкаПлатежа.Договор = НайтиДоговорКонтрагентаПоВалюте(новыйДокумент.Контрагент,БанковскийСчет.ВалютаДенежныхСредств); 
				Если новыйДокумент.ВалютаДенежныхСредств = УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета() Тогда 
					ДоговорКонтрагента = новыйДокумент.Контрагент.ДоговорПоУмолчанию;
				Иначе
					ДоговорКонтрагента = НайтиДоговорКонтрагентаПоВалюте(новыйДокумент.Контрагент,БанковскийСчет.ВалютаДенежныхСредств);
				КонецЕсли;
				нстрРасшифровкаПлатежа.Договор = ДоговорКонтрагента;
				НовСтрокДоговорыАвтоЗачетаДолгов.Договор = ДоговорКонтрагента;
				//++lazare 09.08.2022
				СтруктураДанные = Новый Структура;
				//--------------------------------------------------------------------------
				// © Шишка В.В. [11 апреля 2023]  НАЧАЛО
				//СтруктураДанные.Вставить("ВалютаКурсКратность",РегистрыСведений.КурсыВалют.ПолучитьПоследнее(новыйДокумент.Дата,Новый Структура("Валюта", БанковскийСчет.ВалютаДенежныхСредств)));
				ВалютаРасчетов = ?(ЗначениеЗаполнено(ДоговорКонтрагента), ДоговорКонтрагента.ВалютаРасчетов, БанковскийСчет.ВалютаДенежныхСредств);	
				СтруктураДанные.Вставить("ВалютаКурсКратность",РегистрыСведений.КурсыВалют.ПолучитьПоследнее(новыйДокумент.Дата,Новый Структура("Валюта", ВалютаРасчетов)));
				// © Шишка В.В. [11 апреля 2023]  КОНЕЦ
				//--------------------------------------------------------------------------
				нстрРасшифровкаПлатежа.Курс  = СтруктураДанные.ВалютаКурсКратность.Курс ;
				нстрРасшифровкаПлатежа.Кратность  = СтруктураДанные.ВалютаКурсКратность.Кратность ;
				//--lazare 09.08.2022
				
				//--- Дмгг
			КонецЕсли;
			
			нстрРасшифровкаПлатежа.ПризнакАванса = текШаблонЗаполнения.ПризнакАванса; 
			нстрРасшифровкаПлатежа.СуммаПлатежа = новыйДокумент.СуммаДокумента;
			НовСтрокДоговорыАвтоЗачетаДолгов.СуммаПлатежа = новыйДокумент.СуммаДокумента; //+++ Дмгг
			ПересчитатьСуммыДокумента(новыйДокумент,нстрРасшифровкаПлатежа,1, 1);
			
			//Паганини_
			Если ЗаполнитьКонтрагент Тогда
				Если новыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда
					нстрРасшифровкаПлатежа.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
				ИначеЕсли новыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
					нстрРасшифровкаПлатежа.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
				Иначе
					нстрРасшифровкаПлатежа.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
				КонецЕсли;
				нстрРасшифровкаПлатежа.СуммаНДС = нстрРасшифровкаПлатежа.СуммаПлатежа - (нстрРасшифровкаПлатежа.СуммаПлатежа) / ((нстрРасшифровкаПлатежа.СтавкаНДС.Ставка + 100) / 100);
			КонецЕсли;
			//_Паганини
			
			//новыйДокумент.ВариантЗаполненияРасшифровки = Перечисления.ВариантыЗаполненияРасшифровкиПлатежа.Автоматически;
			// Олег Литвиненко 04.11.22 --->
			новыйДокумент.ВариантЗаполненияРасшифровки = ?(ЗначениеЗаполнено(ВариантЗаполненияРасшифровки), ВариантЗаполненияРасшифровки, Перечисления.ВариантыЗаполненияРасшифровкиПлатежа.Автоматически);
			// Олег Литвиненко <---
			//
			// Олег Литвиненко 14.03.23 --->
			Если ЗначениеЗаполнено(ВариантЗаполненияРасшифровки) 
				И Не ВариантЗаполненияРасшифровки = Перечисления.ВариантыЗаполненияРасшифровкиПлатежа.Автоматически
				И Не ЕстьДолг(новыйДокумент.Контрагент) Тогда
				нстрРасшифровкаПлатежа.ПризнакАванса = Истина;
			КонецЕсли;
			// Олег Литвиненко <---
			
		КонецЕсли;  
		
		//Malyshev 2024-05-24 ONESOFT-3063
		//ТипСуммы расшифровки платежа
		Если ОбъектШаблон.ВидимостьТипаСуммы() 
			и ЗначениеЗаполнено(ОбъектШаблон.ТипСуммы) 
			Тогда     
			Для каждого СтрРасшифровки из новыйДокумент.РасшифровкаПлатежа Цикл
				СтрРасшифровки.ТипСуммы = ОбъектШаблон.ТипСуммы; 	
			КонецЦикла;	
		КонецЕсли;
		
		
		
	КонецЕсли; 

	
	
	
	
	//Если МетаданныеДокумента.Реквизиты.Найти("НазначениеПлатежа") <> Неопределено Тогда
	Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia Тогда
		Если этоКонвертация Тогда 
			новыйДокумент.НазначениеПлатежа = Данные.НазначениеПлатежа + " " + Данные.ДополнительноеЗначение;
		Иначе 
			новыйДокумент.НазначениеПлатежа = Данные.НазначениеПлатежа;
		КонецЕсли;
	Иначе
		новыйДокумент.НазначениеПлатежа = Данные.НазначениеПлатежа;
	КонецЕсли;
	//КонецЕсли;
	новыйДокумент.Комментарий		= Данные.Комментарий;
	
	новыйДокумент.ID = Данные.ID;
	новыйДокумент.TransactionID = Данные.TransactionID;
	//+++ Дмгг
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение", МетаданныеДокумента)
		И ТипЗнч(новыйДокумент) <> Тип("ДокументОбъект.ПоступлениеНаСчет") И НЕ ЗначениеЗаполнено(новыйДокумент.Подразделение) Тогда
		Пользователь = Пользователи.ТекущийПользователь();
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновноеПодразделение");
		новыйДокумент.Подразделение = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	КонецЕсли;
	//--- Дмгг
	
	Если ПроводитьСозданныеДокументы Тогда 
		Попытка
			новыйДокумент.записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			новыйДокумент.записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
	Иначе
		Попытка
			новыйДокумент.записать(РежимЗаписиДокумента.Запись);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		новыйДокумент.записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;      
	
	Если этоКонвертация Тогда 
		
		// Убираем суммц, что бы в контр выписке был определено документ
		КлючУИД =                                 
			Лев(Строка(НовыйДокумент.Дата), 10)
			+ "_" + Данные.НомерДокумента //Данные.НомерДокумента 
			+ "_" //+ ?(ЗначениеЗаполнено(НовыйДокумент.СуммаКонвертации), Строка(НовыйДокумент.СуммаКонвертации), Строка(НовыйДокумент.СуммаПолучено)) //Строка(НовыйДокумент.СуммаДокумента)
			//+ "_" + Строка(НовыйДокумент.НазначениеПлатежа);
			+ "_" + Строка(Данные.НазначениеПлатежа);
			
		Если ЗначениеЗаполнено(новыйДокумент.Ссылка) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Создан документ конвертации: ""'; ka = 'შექმნილია დოკუმენტი: ""'; en = 'შექმნილია დოკუმენტი: ""'") + новыйДокумент.Ссылка + НСтр("ru = '"" ; Строка №'; ka = ' ; სტრიქონის:'; en = ' ; სტრიქონის:'") + Данные.НомерСтроки +  НСтр("ru = ', пожалуйста, перепроверте внесенную информацию'; ka = ', გთხოვთ, შეამოწმეთ შესყვანილი ინფორმცაიია'; en = ', გთხოვთ, შეამოწმეთ შესყვანილი ინფორმცაიია'"));	
		КонецЕсли;
		
	Иначе
		
		КлючУИД =                                 
			Лев(Строка(НовыйДокумент.Дата), 10) 
			+ "_" + Данные.НомерДокумента 
			+ "_" + Строка(НовыйДокумент.СуммаДокумента)
			+ "_" + Строка(НовыйДокумент.НазначениеПлатежа);
		
	КонецЕсли;
	
				
	НаборЗаписейКлючДокИБ = РегистрыСведений.КлючДокументаИнтернетБанка.СоздатьНаборЗаписей();
	НаборЗаписейКлючДокИБ.Отбор.Документ.Установить(НовыйДокумент.Ссылка);
		
	НовыйУИД = НаборЗаписейКлючДокИБ.Добавить();
	НовыйУИД.Документ = НовыйДокумент.Ссылка;
	НовыйУИД.Ключ = КлючУИД;   
		
	НаборЗаписейКлючДокИБ.Записать();
	
	ТаблицаВыписки[Данные.НомерСтроки-1]._СсылкаНаДокумент = новыйДокумент.Ссылка;
	ТаблицаВыписки[Данные.НомерСтроки-1].ДокументПроведен = новыйДокумент.Проведен;
	
КонецПроцедуры  //СоздатьДокументПоДанным


Процедура ЗаполнимЭквайринговыеОперацииНовогоДокумента(новыйДокумент, ТекСумма, ТекСуммаКомиссии, ВидПлатежнойКарты, НомерПлатежнойКарты)
	
	новыйДокумент.ЭквайринговыеОперации.Очистить();
	
	ОстатокСумма = ТекСумма;
	ОстатокКомиссия = ТекСуммаКомиссии;
	
	УчетнаяПолитика = УправлениеНебольшойФирмойПовтИсп.УчетнаяПолитикаОрганизации(новыйДокумент.Организация, новыйДокумент.Дата);
			
	Подбирать = УчетнаяПолитика.ЗагрузкаВыписок_ОтчетЭквайера_АвтозаполнениеДокументов;
	Если Подбирать = Истина Тогда 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация", новыйДокумент.Организация);
		Запрос.УстановитьПараметр("Контрагент", новыйДокумент.ЭквайринговыйТерминал.Эквайрер);
		Запрос.УстановитьПараметр("ПериодРасчетовДатаНачала", Дата(1,1,1));
		Запрос.УстановитьПараметр("ПериодРасчетовДатаОкончания", КонецДня(новыйДокумент.Дата));
		Запрос.УстановитьПараметр("ЭквайринговыйТерминал", новыйДокумент.ЭквайринговыйТерминал);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.Организация КАК Организация,
		|	Т.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
		|	Т.ДатаПлатежа КАК ДатаПлатежа,
		|	Т.Документ КАК Документ,
		|	Т.СуммаОстаток КАК СуммаОстаток,
		|	Т.СуммаВалОстаток КАК СуммаВалОстаток,
		|	Т.КомиссияОстаток КАК КомиссияОстаток,
		|	Т.КомиссияВалОстаток КАК КомиссияВалОстаток,
		|	Т.Заказ КАК Заказ,
		|	Т.ВидОперацииЭквайринга КАК ВидОперацииЭквайринга,
		|	Т.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
		|	Т.НомерПлатежнойКарты КАК НомерПлатежнойКарты
		|ИЗ
		|	РегистрНакопления.РасчетыПоЭквайрингу.Остатки(
		|			,
		|			ДатаПлатежа >= &ПериодРасчетовДатаНачала
		|				И ВЫБОР
		|					КОГДА &ПериодРасчетовДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
		|						ТОГДА ДатаПлатежа <= &ПериодРасчетовДатаОкончания
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И Организация = &Организация
		|				И ЭквайринговыйТерминал.Эквайрер = &Контрагент
		|				И ЭквайринговыйТерминал = &ЭквайринговыйТерминал) КАК Т";
		
		ТабОстатков = Запрос.Выполнить().Выгрузить();
		
		НайденныйДокумент = ТабОстатков.Найти(ОстатокСумма,"СуммаОстаток");
		Если НайденныйДокумент<>Неопределено тогда //найдем точное совпадение по сумме
			НоваяСтрокаОперации = новыйДокумент.ЭквайринговыеОперации.Добавить();
			НоваяСтрокаОперации.СуммаРасчетов = ОстатокСумма;
			НоваяСтрокаОперации.СуммаПлатежаИтогоПоСтроке = ОстатокСумма;
			НоваяСтрокаОперации.Документ = НайденныйДокумент.Документ;
			
			
			НоваяСтрокаОперации.ДатаПлатежа = НайденныйДокумент.ДатаПлатежа;
			НоваяСтрокаОперации.ВидПлатежнойКарты = НайденныйДокумент.ВидПлатежнойКарты; 
			НоваяСтрокаОперации.НомерПлатежнойКарты = НайденныйДокумент.НомерПлатежнойКарты;
			НоваяСтрокаОперации.СуммаРасчетовКомиссии = НайденныйДокумент.КомиссияОстаток;
			НоваяСтрокаОперации.СуммаКомиссииИтогоПоСтроке = НайденныйДокумент.КомиссияОстаток;	
			
			ОстатокСумма = 0;
			ОстатокКомиссия = 0; 
			НайденныйДокумент.СуммаОстаток = 0;
		КонецЕсли;
		
		//распределим остатки
		Для каждого стр из ТабОстатков Цикл
			Если стр.СуммаОстаток=0 тогда 
				Продолжить;
			КонецЕсли;	
			
			Если ОстатокСумма = 0 тогда 
				Прервать;
			КонецЕсли;	
			
			Если ОстатокСумма > стр.СуммаОстаток Тогда
				ЗачетСумма = стр.СуммаОстаток; 
				ЗачетКомиссия = Окр(ОстатокКомиссия * стр.СуммаОстаток/ОстатокСумма,2); 
			Иначе
				ЗачетСумма = ОстатокСумма;
				ЗачетКомиссия = ОстатокКомиссия;
			КонецЕсли;	        
			
			ЗачетКомиссия = стр.КомиссияОстаток;
			
			Если ЗачетСумма = 0 тогда 
				Продолжить;
			КонецЕсли;	
		
				
			ОстатокСумма = ОстатокСумма - ЗачетСумма;
			ОстатокКомиссия = ОстатокКомиссия - ЗачетКомиссия;
			
			
			НоваяСтрокаОперации = новыйДокумент.ЭквайринговыеОперации.Добавить();
			НоваяСтрокаОперации.СуммаРасчетов = ЗачетСумма;
			НоваяСтрокаОперации.СуммаПлатежаИтогоПоСтроке = ЗачетСумма;
			НоваяСтрокаОперации.Документ = стр.Документ;
			
			НоваяСтрокаОперации.ДатаПлатежа = Стр.ДатаПлатежа;
			НоваяСтрокаОперации.ВидПлатежнойКарты = стр.ВидПлатежнойКарты; 
			НоваяСтрокаОперации.НомерПлатежнойКарты = стр.НомерПлатежнойКарты;
			НоваяСтрокаОперации.СуммаРасчетовКомиссии = ЗачетКомиссия;
			НоваяСтрокаОперации.СуммаКомиссииИтогоПоСтроке = ЗачетКомиссия;
			
		КонецЦикла;
		
	КонецЕсли;	         
	
	//Если чтото осталось после распределения		
	Если ОстатокСумма>0 Тогда
		
		НоваяСтрокаОперации = новыйДокумент.ЭквайринговыеОперации.Добавить();
		НоваяСтрокаОперации.СуммаРасчетов = ОстатокСумма;
		НоваяСтрокаОперации.СуммаПлатежаИтогоПоСтроке = ОстатокСумма;
		
		НоваяСтрокаОперации.ДатаПлатежа = новыйДокумент.Дата;
		НоваяСтрокаОперации.ВидПлатежнойКарты = ВидПлатежнойКарты; 
		НоваяСтрокаОперации.НомерПлатежнойКарты = НомерПлатежнойКарты;
		НоваяСтрокаОперации.СуммаРасчетовКомиссии = 0; //ОстатокКомиссия;
		НоваяСтрокаОперации.СуммаКомиссииИтогоПоСтроке = 0; //ОстатокКомиссия;
		
	КонецЕсли;		
			

КонецПроцедуры	

Процедура ОбработатьданныеДляКонвертации(новыйДокумент, Данные, НацВалюта, ВалютаУчета)
	
	//Данные
	//новыйДокумент
	
	СтруктураДополнительногоЗначение = Неопределено;
	Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia Тогда 
		СтруктураДополнительногоЗначение = BOG_РазобратьСтрокуДополнительногоЗначенияВСтруктуру(Данные.ДополнительноеЗначение);
	ИначеЕсли ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.ProCredit Тогда
		СтруктураДополнительногоЗначение = PC_РазобратьСтрокуДополнительногоЗначенияВСтруктуру(Данные.НазначениеПлатежа);
	ИначеЕсли ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC Тогда
		СтруктураДополнительногоЗначение = новый Структура; 
		СтруктураДополнительногоЗначение.Вставить("Курс", Данные.Курс);
		СтруктураДополнительногоЗначение.Вставить("Кратность", 1);
	КонецЕсли;
	
	новыйДокумент.ВидОперации = Перечисления.ВидыОперацийКонвертация.СоСчета;
	новыйДокумент.Комментарий = Данные.Комментарий;
	
	Если ЗначениеЗаполнено(Данные.СуммаДт) Тогда
		
		новыйДокумент.Отправитель		= БанковскийСчет;
		новыйДокумент.ВалютаОтправитель = БанковскийСчет.ВалютаДенежныхСредств;
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(новыйДокумент.Дата, Новый Структура("Валюта", новыйДокумент.ВалютаОтправитель));
		Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia Тогда
			//+++ Дмгг, 02.02.24, ONESOFT-2925
			//новыйДокумент.КурсОтправитель = СтруктураДополнительногоЗначение.Курс;
			новыйДокумент.КурсОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			//--- Дмгг, 02.02.24, ONESOFT-2925
		Иначе
			//+++ Дмгг, 02.02.24, ONESOFT-3438
			//новыйДокумент.КурсОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			Если новыйДокумент.ВалютаОтправитель = НацВалюта Тогда 
				новыйДокумент.КурсОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс); 
			Иначе
				новыйДокумент.КурсОтправитель = СтруктураДополнительногоЗначение.Курс;
			КонецЕсли;    
			//--- Дмгг, 02.02.24, ONESOFT-3438
		КонецЕсли;
		//Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC Тогда 
		//	новыйДокумент.КурсОтправитель = Данные.Курс;
		//Иначе
		//	новыйДокумент.КурсОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
		//КонецЕсли;
		новыйДокумент.КурсОтправительНацБанк = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
		новыйДокумент.КратностьОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
		новыйДокумент.СуммаКонвертации 	= Данные.СуммаДт;
		
		
		
		новыйДокумент.Получатель	 	= Данные.СчетКонтрагента1С;
		новыйДокумент.ВалютаПолучатель	= Данные.СчетКонтрагента1С.ВалютаДенежныхСредств;
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(новыйДокумент.Дата, Новый Структура("Валюта", новыйДокумент.ВалютаПолучатель));
		новыйДокумент.КурсПолучательНацБанк= ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
		новыйДокумент.КратностьПолучатель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
		
		Если СтруктураДополнительногоЗначение <> Неопределено Тогда 
			
			Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia Тогда
				
				новыйДокумент.КурсПолучатель= СтруктураДополнительногоЗначение.Курс;//СтруктураПоВалюте.Курс;
				
				//Малышев 2024-05-30 ONESOFT-3188 - при национальной валюте курс ставим у другой валюты
				Если ЗначениеЗаполнено(новыйДокумент.Получатель) и новыйДокумент.Получатель.ВалютаДенежныхСредств = ВалютаУчета Тогда
					новыйДокумент.КурсОтправитель = новыйДокумент.КурсПолучатель;
					новыйДокумент.КурсПолучатель = 1;						
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(новыйДокумент.Отправитель) и новыйДокумент.Отправитель.ВалютаДенежныхСредств = ВалютаУчета Тогда
					новыйДокумент.КурсОтправитель = 1;
				КонецЕсли;
				
				новыйДокумент.СуммаПолучено = СтруктураДополнительногоЗначение.КонтрСумма;
				
			Иначе
				новыйДокумент.КурсПолучатель= СтруктураДополнительногоЗначение.Курс;    
				//+++ Дмгг, 02.02.24, ONESOFT-3438
				//новыйДокумент.КурсПолучатель= СтруктураДополнительногоЗначение.Курс;    
				Если новыйДокумент.ВалютаОтправитель = НацВалюта Тогда 
					новыйДокумент.КурсПолучатель = СтруктураДополнительногоЗначение.Курс;
				Иначе
					новыйДокумент.КурсПолучатель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
				КонецЕсли;    
				//--- Дмгг, 02.02.24, ONESOFT-3438
			КонецЕсли;
			
			//Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC Тогда 
			//	новыйДокумент.КурсПолучатель = СтруктураПоВалюте.Курс;
			//Иначе
			//	новыйДокумент.КурсПолучатель= СтруктураДополнительногоЗначение.Курс;
			//КонецЕсли;
			
			// Kuzmich, 01.12.2025, (ES4001-99) Помощик загрузки банковской выписки - TBC - конвертация
			Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC Тогда
				СтруктураРазбораНазначениеПлатежа = РазборСтрокиНазначениеПлатежа(Данные);
				Если СтруктураРазбораНазначениеПлатежа.ЕстьКурсБанка Тогда
					
					СтруктураКурсаБанка = СтруктураРазбораНазначениеПлатежа.СтруктураКурсаБанка;
					
					Если БанковскийСчет.ВалютаДенежныхСредств = НацВалюта Тогда
						
						Если НацВалюта = СтруктураКурсаБанка.ПерваяВалюта Тогда
							
							новыйДокумент.КурсОтправитель = СтруктураКурсаБанка.КурсВторойВалюты;
							новыйДокумент.КратностьОтправитель = 1;
							
							новыйДокумент.КурсПолучатель = СтруктураКурсаБанка.КурсПервойВалюты;
							новыйДокумент.КратностьПолучатель = 1;
							
						ИначеЕсли НацВалюта = СтруктураКурсаБанка.ВтораяВалюта Тогда
							
							новыйДокумент.КурсОтправитель = СтруктураКурсаБанка.КурсПервойВалюты;
							новыйДокумент.КратностьОтправитель = 1;
							
							новыйДокумент.КурсПолучатель = СтруктураКурсаБанка.КурсВторойВалюты;
							новыйДокумент.КратностьПолучатель = 1;
							
						КонецЕсли;
					
					Иначе	
						
						Если НацВалюта = СтруктураКурсаБанка.ПерваяВалюта Тогда
							
							новыйДокумент.КурсОтправитель = СтруктураКурсаБанка.КурсПервойВалюты;
							новыйДокумент.КратностьОтправитель = 1;
							
							новыйДокумент.КурсПолучатель = СтруктураКурсаБанка.КурсВторойВалюты;
							новыйДокумент.КратностьПолучатель = 1;
							
						ИначеЕсли НацВалюта = СтруктураКурсаБанка.ВтораяВалюта Тогда
							
							новыйДокумент.КурсОтправитель = СтруктураКурсаБанка.КурсВторойВалюты;
							новыйДокумент.КратностьОтправитель = 1;
							
							новыйДокумент.КурсПолучатель = СтруктураКурсаБанка.КурсПервойВалюты;
							новыйДокумент.КратностьПолучатель = 1;
							
						КонецЕсли;
						
					КонецЕсли;				
					
				КонецЕсли;
			КонецЕсли;
			// Kuzmich, 01.12.2025, (ES4001-99) Помощик загрузки банковской выписки - TBC - конвертация
			
			Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.ProCredit Тогда
				новыйДокумент.СуммаПолучено = новыйДокумент.СуммаКонвертации * (новыйДокумент.КурсОтправитель * новыйДокумент.КратностьПолучатель) / (новыйДокумент.КурсПолучатель * новыйДокумент.КратностьОтправитель);
			ИначеЕсли ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC Тогда
				Если (НацВалюта = новыйДокумент.ВалютаПолучатель
					ИЛИ НацВалюта = новыйДокумент.ВалютаОтправитель) 
					И новыйДокумент.КурсПолучатель <> 0 
					И новыйДокумент.КратностьОтправитель <> 0 Тогда 
					новыйДокумент.СуммаПолучено = новыйДокумент.СуммаКонвертации * (новыйДокумент.КурсОтправитель * новыйДокумент.КратностьПолучатель) / (новыйДокумент.КурсПолучатель * новыйДокумент.КратностьОтправитель);
				Иначе
					новыйДокумент.КурсПолучатель = ?(новыйДокумент.КурсПолучатель=0, новыйДокумент.КурсПолучательНацБанк, новыйДокумент.КурсПолучатель);
					новыйДокумент.СуммаПолучено = новыйДокумент.СуммаКонвертации * новыйДокумент.КурсОтправитель;
				КонецЕсли;
			КонецЕсли;
		Иначе 
			новыйДокумент.КурсПолучатель	= ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			новыйДокумент.СуммаПолучено 	= новыйДокумент.СуммаКонвертации * (новыйДокумент.КурсОтправитель * новыйДокумент.КратностьПолучатель) / (новыйДокумент.КурсПолучатель * новыйДокумент.КратностьОтправитель);
		КонецЕсли;
		
		новыйДокумент.Статья = Справочники.СтатьиДвиженияДенежныхСредств.Прочее;
		Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia Тогда
			Если новыйДокумент.КурсОтправитель < новыйДокумент.КурсОтправительНацБанк Тогда
				новыйДокумент.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница;
			ИначеЕсли новыйДокумент.КурсОтправитель > новыйДокумент.КурсОтправительНацБанк Тогда
				новыйДокумент.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница;
			КонецЕсли;
		Иначе
			Если новыйДокумент.КратностьПолучатель > новыйДокумент.КурсПолучательНацБанк Тогда
				новыйДокумент.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница;
			ИначеЕсли новыйДокумент.КратностьПолучатель < новыйДокумент.КурсПолучательНацБанк Тогда
				новыйДокумент.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		новыйДокумент.Отправитель		= Данные.СчетКонтрагента1С;
		новыйДокумент.ВалютаОтправитель = Данные.СчетКонтрагента1С.ВалютаДенежныхСредств;
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(новыйДокумент.Дата, Новый Структура("Валюта", новыйДокумент.ВалютаОтправитель));
		
		Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia Тогда
			новыйДокумент.КурсОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);//СтруктураДополнительногоЗначение.Курс;
			
			
		ИначеЕсли ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC Тогда 
			новыйДокумент.КурсОтправитель = СтруктураПоВалюте.Курс;//Данные.Курс; //+++ Дмгг, 14.03.24, ONESOFT-3041
		Иначе
			новыйДокумент.КурсОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
		КонецЕсли;
		//Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC Тогда 
		//	новыйДокумент.КурсОтправитель = Данные.Курс;
		//Иначе
		//	новыйДокумент.КурсОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
		//КонецЕсли;
		новыйДокумент.КурсОтправительНацБанк = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
		новыйДокумент.КратностьОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
		//новыйДокумент.СуммаКонвертации 	= Данные.СуммаКт;
		
		
		новыйДокумент.Получатель	 	= БанковскийСчет;
		новыйДокумент.ВалютаПолучатель	= БанковскийСчет.ВалютаДенежныхСредств;
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(новыйДокумент.Дата, Новый Структура("Валюта", новыйДокумент.ВалютаПолучатель));
		//новыйДокумент.КурсПолучатель	= ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
		новыйДокумент.КратностьПолучатель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
		новыйДокумент.КурсПолучательНацБанк = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
		новыйДокумент.СуммаПолучено 	= Данные.СуммаКт;
		
		// Kuzmich, 01.12.2025, (ES4001-99) Помощик загрузки банковской выписки - TBC - конвертация
		Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC Тогда
			СтруктураРазбораНазначениеПлатежа = РазборСтрокиНазначениеПлатежа(Данные);
			Если СтруктураРазбораНазначениеПлатежа.ЕстьКурсБанка Тогда
				
				СтруктураКурсаБанка = СтруктураРазбораНазначениеПлатежа.СтруктураКурсаБанка;
				
				Если БанковскийСчет.ВалютаДенежныхСредств = НацВалюта Тогда
					
					Если НацВалюта = СтруктураКурсаБанка.ПерваяВалюта Тогда
						
						новыйДокумент.КурсОтправитель = СтруктураКурсаБанка.КурсПервойВалюты;
						новыйДокумент.КратностьОтправитель = 1;
						
						новыйДокумент.КурсПолучатель = СтруктураКурсаБанка.КурсВторойВалюты;
						новыйДокумент.КратностьПолучатель = 1;
						
					ИначеЕсли НацВалюта = СтруктураКурсаБанка.ВтораяВалюта Тогда
						
						новыйДокумент.КурсОтправитель = СтруктураКурсаБанка.КурсВторойВалюты;
						новыйДокумент.КратностьОтправитель = 1;
						
						новыйДокумент.КурсПолучатель = СтруктураКурсаБанка.КурсПервойВалюты;
						новыйДокумент.КратностьПолучатель = 1;
						
					КонецЕсли;
					
				Иначе
					
					Если НацВалюта = СтруктураКурсаБанка.ПерваяВалюта Тогда
						
						новыйДокумент.КурсОтправитель = СтруктураКурсаБанка.КурсВторойВалюты;
						новыйДокумент.КратностьОтправитель = 1;
						
						новыйДокумент.КурсПолучатель = СтруктураКурсаБанка.КурсПервойВалюты;
						новыйДокумент.КратностьПолучатель = 1;
						
					ИначеЕсли НацВалюта = СтруктураКурсаБанка.ВтораяВалюта Тогда
						
						новыйДокумент.КурсОтправитель = СтруктураКурсаБанка.КурсПервойВалюты;
						новыйДокумент.КратностьОтправитель = 1;
						
						новыйДокумент.КурсПолучатель = СтруктураКурсаБанка.КурсВторойВалюты; 
						новыйДокумент.КратностьПолучатель = 1;
						
					КонецЕсли;	
					
				КонецЕсли;			
				
			КонецЕсли;
		КонецЕсли;
		// Kuzmich, 01.12.2025, (ES4001-99) Помощик загрузки банковской выписки - TBC - конвертация		
		
		Если СтруктураДополнительногоЗначение <> Неопределено Тогда 
			Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia Тогда
				новыйДокумент.КурсОтправитель = СтруктураДополнительногоЗначение.Курс;//СтруктураПоВалюте.Курс;
				
				//Малышев 2024-05-30 ONESOFT-3188 - при национальной валюте курс ставим у другой валюты
				Если ЗначениеЗаполнено(новыйДокумент.Отправитель) и новыйДокумент.Отправитель.ВалютаДенежныхСредств = ВалютаУчета Тогда
					новыйДокумент.КурсПолучатель = новыйДокумент.КурсОтправитель;
					новыйДокумент.КурсОтправитель = 1;						
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(новыйДокумент.Получатель) и новыйДокумент.Получатель.ВалютаДенежныхСредств = ВалютаУчета Тогда
					новыйДокумент.КурсПолучатель = 1;
				КонецЕсли;
				
				
				
			Иначе
				//новыйДокумент.КурсПолучатель= СтруктураДополнительногоЗначение.Курс;
				// Kuzmich, 01.12.2025, (ES4001-99) Помощик загрузки банковской выписки - TBC - конвертация	
				Если новыйДокумент.КурсПолучатель=0 Тогда
					новыйДокумент.КурсПолучатель= СтруктураДополнительногоЗначение.Курс;
				КонецЕсли;
				// Kuzmich, 01.12.2025, (ES4001-99) Помощик загрузки банковской выписки - TBC - конвертация	
			КонецЕсли;
			//новыйДокумент.КурсПолучатель	= СтруктураДополнительногоЗначение.Курс;
			Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia Тогда
				новыйДокумент.СуммаКонвертации 	= СтруктураДополнительногоЗначение.КонтрСумма;
			ИначеЕсли ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.ProCredit Тогда
				новыйДокумент.СуммаКонвертации = новыйДокумент.СуммаПолучено * (новыйДокумент.КурсОтправитель * новыйДокумент.КратностьПолучатель) * (новыйДокумент.КурсПолучатель * новыйДокумент.КратностьОтправитель);
			ИначеЕсли ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC Тогда
				//новыйДокумент.КурсПолучатель	= 1;
				//новыйДокумент.СуммаКонвертации = новыйДокумент.СуммаПолучено / (новыйДокумент.КурсОтправитель * новыйДокумент.КратностьПолучатель) * (новыйДокумент.КурсПолучатель * новыйДокумент.КратностьОтправитель);
				Если (НацВалюта = новыйДокумент.ВалютаПолучатель
					ИЛИ НацВалюта = новыйДокумент.ВалютаОтправитель)   
					И новыйДокумент.КурсОтправитель <> 0  
					И новыйДокумент.КурсПолучатель <> 0 Тогда
					новыйДокумент.СуммаКонвертации = новыйДокумент.СуммаПолучено / (новыйДокумент.КурсОтправитель * новыйДокумент.КратностьПолучатель) * (новыйДокумент.КурсПолучатель * новыйДокумент.КратностьОтправитель);
				Иначе          
					новыйДокумент.КурсПолучатель = ?(новыйДокумент.КурсПолучатель=0, новыйДокумент.КурсПолучательНацБанк, новыйДокумент.КурсПолучатель);
					новыйДокумент.КурсОтправитель = ?(новыйДокумент.КурсОтправитель=0, новыйДокумент.КурсОтправительНацБанк, новыйДокумент.КурсОтправитель);
					новыйДокумент.СуммаКонвертации = новыйДокумент.СуммаПолучено / новыйДокумент.КурсПолучатель;
				КонецЕсли;
			КонецЕсли;
		Иначе 
			новыйДокумент.КурсПолучатель	= ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			новыйДокумент.СуммаКонвертации 	= новыйДокумент.СуммаПолучено * (новыйДокумент.КурсОтправитель * новыйДокумент.КратностьПолучатель) * (новыйДокумент.КурсПолучатель * новыйДокумент.КратностьОтправитель);
		КонецЕсли;
		
		новыйДокумент.Статья = Справочники.СтатьиДвиженияДенежныхСредств.Прочее;
		//Если новыйДокумент.КурсОтправитель > новыйДокумент.КурсОтправительНацБанк Тогда
		//	новыйДокумент.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница;
		//ИначеЕсли новыйДокумент.КурсОтправитель < новыйДокумент.КурсОтправительНацБанк Тогда 
		//	новыйДокумент.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница;
		//КонецЕсли;
		Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia Тогда
			Если новыйДокумент.КурсОтправитель < новыйДокумент.КурсОтправительНацБанк Тогда
				новыйДокумент.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница;
			ИначеЕсли новыйДокумент.КурсОтправитель > новыйДокумент.КурсОтправительНацБанк Тогда
				новыйДокумент.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница;
			КонецЕсли;
		Иначе
			Если новыйДокумент.КратностьПолучатель > новыйДокумент.КурсПолучательНацБанк Тогда
				новыйДокумент.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница;
			ИначеЕсли новыйДокумент.КратностьПолучатель < новыйДокумент.КурсПолучательНацБанк Тогда
				новыйДокумент.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница;
			КонецЕсли;
		КонецЕсли;
		//новыйДокумент.СуммаКонвертации 	= Данные.СуммаДт / (новыйДокумент.КурсОтправитель * новыйДокумент.КратностьПолучатель) / (новыйДокумент.КурсПолучатель * новыйДокумент.КратностьОтправитель);
		
	КонецЕсли;
	
	Если новыйДокумент.ВалютаОтправитель = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("НациональнаяВалюта") Тогда 
		Если новыйДокумент.КурсОтправитель > новыйДокумент.КурсОтправительНацБанк
			ИЛИ новыйДокумент.КурсПолучатель > новыйДокумент.КурсПолучательНацБанк Тогда 
			
			новыйДокумент.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница;
			
		ИначеЕсли новыйДокумент.КурсОтправитель < новыйДокумент.КурсОтправительНацБанк
			ИЛИ новыйДокумент.КурсПолучатель < новыйДокумент.КурсПолучательНацБанк Тогда 
			
			новыйДокумент.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	
Конецпроцедуры	


Процедура СуммаДокументаПриИзмененииРасход(Объект)
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаДенежныхСредств));
	Курс = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	Кратность = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 И
		НЕ (Объект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Поставщику И 
		Объект.ВариантЗаполненияРасшифровки = Перечисления.ВариантыЗаполненияРасшифровкиПлатежа.СПомощником) Тогда
		
		СтрокаТабличнойЧасти = Объект.РасшифровкаПлатежа[0];
		
		СтрокаТабличнойЧасти.СуммаПлатежа = Объект.СуммаДокумента;
		
		// Эквайринг
		Если Объект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты Тогда
			СтрокаТабличнойЧасти.СуммаПлатежа = СтрокаТабличнойЧасти.СуммаПлатежа + Объект.СуммаКомиссииДокумента;
		КонецЕсли;
		// Конец Эквайринг
		
		СтрокаТабличнойЧасти.Курс = ?(
			СтрокаТабличнойЧасти.Курс = 0,
			1,
			СтрокаТабличнойЧасти.Курс
		);
		
		СтрокаТабличнойЧасти.Кратность = ?(
			СтрокаТабличнойЧасти.Кратность = 0,
			1,
			СтрокаТабличнойЧасти.Кратность
		);
		
		СтрокаТабличнойЧасти.СуммаРасчетов = ПересчитатьИзВалютыВВалюту(
			СтрокаТабличнойЧасти.СуммаПлатежа,
			Курс,
			СтрокаТабличнойЧасти.Курс,
			Кратность,
			СтрокаТабличнойЧасти.Кратность
		);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
			СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.НДС18;
		КонецЕсли;
		
		//СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса, СтрокаТабличнойЧасти.СуммаПлатежа, 0);
		
		РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
		
	КонецЕсли;
	
	//+++
	Если Объект.СуммаДокумента < 10000 Тогда 
		Объект.ТипОтправки = ПредопределенноеЗначение("Перечисление.ТипыОтправки.BULK");
	Иначе
		Объект.ТипОтправки = ПредопределенноеЗначение("Перечисление.ТипыОтправки.MT103");
	КонецЕсли;
	//---
	
	//ПересчитатьИтогиПриИзмененииАвансаНаСервере(Истина);
	
КонецПроцедуры

Процедура ПриИзмененииСуммыПоступленияНаССчет(Объект)
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаДенежныхСредств));
	
	Курс = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	Кратность = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
		
	Если Объект.РасшифровкаПлатежа.Количество() = 1 И
		НЕ (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя") И 
		Объект.ВариантЗаполненияРасшифровки = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияРасшифровкиПлатежа.СПомощником")) Тогда
	 
		СтрокаТабличнойЧасти = Объект.РасшифровкаПлатежа[0];
		
		СтрокаТабличнойЧасти.СуммаПлатежа = Объект.СуммаДокумента;
			СтрокаТабличнойЧасти.Курс = ?(
			СтрокаТабличнойЧасти.Курс = 0,
			1,
		СтрокаТабличнойЧасти.Курс
		);
		
		СтрокаТабличнойЧасти.Кратность = ?(
			СтрокаТабличнойЧасти.Кратность = 0,
			1,
			СтрокаТабличнойЧасти.Кратность
		);
		
		СтрокаТабличнойЧасти.СуммаРасчетов = ПересчитатьИзВалютыВВалюту(
			СтрокаТабличнойЧасти.СуммаПлатежа,
			Курс,
			СтрокаТабличнойЧасти.Курс,
			Кратность,
			СтрокаТабличнойЧасти.Кратность
		);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
			СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.НДС18;//СтавкаНДСПоУмолчанию;
		КонецЕсли;
		
		//СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса, СтрокаТабличнойЧасти.СуммаПлатежа, 0);
		
		РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
		
	КонецЕсли;
	
	РассчитатьСуммуУчета(Объект);
	
КонецПроцедуры

Процедура РассчитатьСуммуУчета(Объект)
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Константы.ВалютаУчета.Получить()));
	
	КурсВалютыУчета = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	КратностьВалютыУчета = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
	Объект.Курс = ?(
		Объект.Курс = 0,
		1,
		Объект.Курс
	);
	Объект.Кратность = ?(
		Объект.Кратность = 0,
		1,
		Объект.Кратность
	);
	
	Объект.СуммаУчета = ПересчитатьИзВалютыВВалюту(
		Объект.СуммаДокумента,
		Объект.Курс,
		КурсВалютыУчета,
		Объект.Кратность,
		КратностьВалютыУчета
	);
	
КонецПроцедуры

Функция ПересчитатьИзВалютыВВалюту(Сумма, КурсНач, КурсКон,	КратностьНач = 1, КратностьКон = 1) Экспорт
	
	Если (КурсНач = КурсКон) И (КратностьНач = КратностьКон) Тогда
		Возврат Сумма;
	КонецЕсли;
	
	Если КурсНач = 0 ИЛИ КурсКон = 0 ИЛИ КратностьНач = 0 ИЛИ КратностьКон = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='აღმოჩენილია ვალუტის ნულოვანი კურსი. გადათვლა არ შესრულდა.';ru='Обнаружен нулевой курс валюты. Пересчет не выполнен.';en='Discovered a zero rate. Adjustment is not performed.'");
		Сообщение.Сообщить();
		Возврат Сумма;
	КонецЕсли;
	
	СуммаПересчитанная = Окр((Сумма * КурсНач * КратностьКон) / (КурсКон * КратностьНач), 2);
	
	Возврат СуммаПересчитанная;
	
КонецФункции

Процедура РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаПлатежа - (СтрокаТабличнойЧасти.СуммаПлатежа) / ((СтавкаНДС + 100) / 100);
	
КонецПроцедуры

// Олег Литвиненко 14.03.23 --->
Функция ЕстьДолг(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиВзаиморасчетов.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.ОстаткиВзаиморасчетов КАК ОстаткиВзаиморасчетов
	|ГДЕ
	|	ОстаткиВзаиморасчетов.Контрагент = &Контрагент
	|	И НЕ Сумма = 0";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции// Олег Литвиненко <---

Процедура УстановитьВалютуПоУмолчанию(ДокументОбъект, ОтправительПолучатель)
	
	Если ОтправительПолучатель = "Отправитель" Тогда 
		Если ТипЗнч(ДокументОбъект.Отправитель) = Тип("СправочникСсылка.БанковскиеСчета")
			И ЗначениеЗаполнено(ДокументОбъект.Отправитель) Тогда 
			ДокументОбъект.ВалютаОтправитель = ДокументОбъект.Отправитель.ВалютаДенежныхСредств;
			СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокументОбъект.Дата, Новый Структура("Валюта", ДокументОбъект.ВалютаОтправитель));
			
			ДокументОбъект.КурсОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			ДокументОбъект.КратностьОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
		КонецЕсли;
	ИначеЕсли ОтправительПолучатель = "Получатель" Тогда 
		Если ТипЗнч(ДокументОбъект.Получатель) = Тип("СправочникСсылка.БанковскиеСчета")
			И ЗначениеЗаполнено(ДокументОбъект.Получатель)
			Тогда
			ДокументОбъект.ВалютаПолучатель = ДокументОбъект.Получатель.ВалютаДенежныхСредств;
			СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокументОбъект.Дата, Новый Структура("Валюта", ДокументОбъект.ВалютаПолучатель));
			
			ДокументОбъект.КурсПолучатель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			ДокументОбъект.КратностьПолучатель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиДоговорКонтрагентаЭкваера(Контрагент)
	
	ДоговорВозврата = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыОплатОрганизаций.ДоговорКонтрагента КАК ДоговорКонтрагента
		|ИЗ
		|	Справочник.ВидыОплатОрганизаций КАК ВидыОплатОрганизаций
		|ГДЕ
		|	ВидыОплатОрганизаций.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	тзЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если тзЗапроса.Количество() > 0 Тогда 
		ДоговорВозврата = тзЗапроса[0].ДоговорКонтрагента;
	КонецЕсли;
	
	Возврат ДоговорВозврата;

КонецФункции // НайтиДоговорКонтрагентаЭкваера(новыйДокумент.Контрагент)()

Функция ПолучитьДанныеКурсаВалют(ДатаДокумента, Валюта)

	Возврат РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаДокумента, Новый Структура("Валюта", Валюта));

КонецФункции

Функция СоздатьСчетКонтрагента(ВладелецСчета, НомерСчета, тзСозданныСчетов)  
	
	ПоисКонтрагента = тзСозданныСчетов.НайтиСтроки(Новый Структура("НомерСчета", НомерСчета));
	Если ПоисКонтрагента.Количество() > 0 Тогда 
		Возврат ПоисКонтрагента[0].Ссылка;
	КонецЕсли;
	
	КодБанка = Сред(НомерСчета, 5, 2);
	НаименованиеВалюты = Прав(НомерСчета, 3);
	
	Банк = Справочники.Банки.ПустаяСсылка();   
	Валюта = Справочники.Валюты.НайтиПоНаименованию(НаименованиеВалюты);    
	СчетУчета = ПланыСчетов.Управленческий.ПустаяСсылка();
	СчетУчетаРегл = ПланыСчетов.Хозрасчетный.НайтиПоКоду("1200");
	
	Если КодБанка = "TB" Тогда 
		СВИФТБИК = "TBCBGE22";
		Банк = Справочники.Банки.НайтиПоРеквизиту("СВИФТБИК", СВИФТБИК);
	ИначеЕсли КодБанка = "BG" Тогда
		СВИФТБИК = "BAGAGE22";   
		Банк = Справочники.Банки.НайтиПоРеквизиту("СВИФТБИК", СВИФТБИК);
	ИначеЕсли КодБанка = "PC" Тогда
		СВИФТБИК = "MIBGGE22";   
		Банк = Справочники.Банки.НайтиПоРеквизиту("СВИФТБИК", СВИФТБИК);
	КонецЕсли;
	
	НовыйСчет = Справочники.БанковскиеСчета.СоздатьЭлемент();  
	НовыйСчет.Наименование = НомерСчета;
	НовыйСчет.ВидСчета = "Расчетный";
	НовыйСчет.Владелец = ВладелецСчета;
	НовыйСчет.НомерСчета = НомерСчета; 
	НовыйСчет.ВалютаДенежныхСредств = ?(ЗначениеЗаполнено(Валюта), Валюта, БанковскийСчет.ВалютаДенежныхСредств);
	НовыйСчет.Банк = Банк;
	НовыйСчет.СчетУчета = СчетУчета;
	НовыйСчет.СчетУчетаРегл = СчетУчетаРегл;
	
	НовыйСчет.Записать(); 
	
	// Сделаем новый счет, счетом по умолчанию
	Если ТипЗнч(ВладелецСчета) = Тип("СправочникСсылка.Контрагенты") Тогда 
		Контрагентобъект = ВладелецСчета.ПолучитьОбъект();
		Контрагентобъект.БанковскийСчетПоУмолчанию = НовыйСчет.Ссылка;
		Контрагентобъект.Записать();
	КонецЕсли;
	
	СтрокаСчета = тзСозданныСчетов.Добавить();
	СтрокаСчета.НомерСчета = НомерСчета;
	СтрокаСчета.Ссылка = НовыйСчет.Ссылка;
	
	Возврат НовыйСчет.Ссылка;
	
КонецФункции

Функция СоздатьКонтрагента(ИНН, Наименование, СтруктураТипаКонтрагента, тзСозданныеКонтрагенты)
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		ПоисКонтрагента = тзСозданныеКонтрагенты.НайтиСтроки(Новый Структура("ИНН", ИНН));
		Если ПоисКонтрагента.Количество() > 0 Тогда 
			Возврат ПоисКонтрагента[0].Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеКонтрагента = Неопределено;
	Если ЗначениеЗаполнено(ИНН) Тогда 
		ДанныеКонтрагента = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьИнфоИзRSНаСервере(ИНН);
	КонецЕсли;
	
	ДлинаИНН = СтрДлина(СокрЛп(ИНН));
	
	СправочникМенеджер = Справочники.Контрагенты;
	НовыйКонтрагент = СправочникМенеджер.СоздатьЭлемент(); 
	НовыйКонтрагент.Заполнить(Неопределено);
	СтруктураСчетов = РегламентированныйУчетСервер.ПолучитьСчетаКонтрагентаПоУмолчанию(); 
	
	НовыйКонтрагент.СчетУчетаРасчетовСПокупателемРегл = СтруктураСчетов.СчетУчетаРасчетовСПокупателемРегл;
	НовыйКонтрагент.СчетУчетаАвансовПокупателяРегл = СтруктураСчетов.СчетУчетаАвансовПокупателяРегл;
	НовыйКонтрагент.СчетУчетаРасчетовСПоставщикомРегл = СтруктураСчетов.СчетУчетаРасчетовСПоставщикомРегл;
	НовыйКонтрагент.СчетУчетаАвансовПоставщикуРегл = СтруктураСчетов.СчетУчетаАвансовПоставщикуРегл;
	
	НовыйКонтрагент.СчетУчетаРасчетовСПокупателем = ПланыСчетов.Управленческий.РасчетыСПокупателями;
	НовыйКонтрагент.СчетУчетаАвансовПокупателя = ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным;
	НовыйКонтрагент.СчетУчетаРасчетовСПоставщиком = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
	НовыйКонтрагент.СчетУчетаАвансовПоставщику = ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным;
	
	НовыйКонтрагент.ВестиРасчетыПоДоговорам = Истина;
	НовыйКонтрагент.ВестиРасчетыПоДокументам = Истина;
	НовыйКонтрагент.ВестиРасчетыПоЗаказам = Истина;
	НовыйКонтрагент.ВестиУчетОплатыПоСчетам = Истина;
	
	Если ДлинаИНН = 12 Тогда 
		НовыйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
	ИначеЕсли ДлинаИНН = 9 Тогда
		НовыйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	Иначе
		НовыйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
	КонецЕсли;
	
	Если ДанныеКонтрагента = Неопределено ИЛИ (ТипЗнч(ДанныеКонтрагента) = Тип("Структура") И ДанныеКонтрагента.Свойство("ИНН") И ДанныеКонтрагента.ИНН = "")  Тогда 
		ЗаполнитьКонтрагентаИмеющимисяДанными(НовыйКонтрагент, ИНН, Наименование, СтруктураСчетов, СтруктураТипаКонтрагента);
	Иначе        
		НовыйКонтрагент.ИНН = ИНН; 
		ЗаполнитьКонтрагентаДаннымиRS(НовыйКонтрагент, ДанныеКонтрагента, СтруктураСчетов, СтруктураТипаКонтрагента);
	КонецЕсли;
	
	НовыйКонтрагент.Записать();     
	
	СтрокаКонтра = тзСозданныеКонтрагенты.Добавить();
	СтрокаКонтра.ИНН = ИНН;
	СтрокаКонтра.Ссылка = НовыйКонтрагент.Ссылка;
	
	Возврат НовыйКонтрагент.Ссылка;
	
КонецФункции

Функция ПолучитьЗаписьНачисления(СтруктураОтбора)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Период КАК Период,
		|	ПлановыеНачисленияИУдержания.Организация КАК Организация,
		|	ПлановыеНачисленияИУдержания.Подразделение КАК Подразделение,
		|	ПлановыеНачисленияИУдержания.Сотрудник КАК Сотрудник,
		|	ПлановыеНачисленияИУдержания.Должность КАК Должность,
		|	ПлановыеНачисленияИУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
		|	ПлановыеНачисленияИУдержания.Валюта КАК Валюта,
		|	ПлановыеНачисленияИУдержания.Сумма КАК Сумма,
		|	ПлановыеНачисленияИУдержания.Актуальность КАК Актуальность,
		|	ПлановыеНачисленияИУдержания.СчетЗатрат КАК СчетЗатрат,
		|	ПлановыеНачисленияИУдержания.СтатьяДоходовИРасходов КАК СтатьяДоходовИРасходов
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ВложенныйЗапрос.Период) КАК Период,
		|		ВложенныйЗапрос.ВидНачисленияУдержанияТип КАК ВидНачисленияУдержанияТип
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ПлановыеНачисленияИУдержания.Период КАК Период,
		|			ПлановыеНачисленияИУдержания.ВидНачисленияУдержания.Тип КАК ВидНачисленияУдержанияТип
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияИУдержания КАК ПлановыеНачисленияИУдержания
		|		ГДЕ
		|			ПлановыеНачисленияИУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний."+СтруктураОтбора.ТипНачисленияУдержания+")
		|			И ПлановыеНачисленияИУдержания.Период <= &ДатаДокумента) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.ВидНачисленияУдержанияТип) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания КАК ПлановыеНачисленияИУдержания
		|		ПО ВложенныйЗапрос.Период = ПлановыеНачисленияИУдержания.Период
		|			И ВложенныйЗапрос.ВидНачисленияУдержанияТип = ПлановыеНачисленияИУдержания.ВидНачисленияУдержания.Тип
		|ГДЕ
		|	ПлановыеНачисленияИУдержания.Организация = &Организация
		|	И ПлановыеНачисленияИУдержания.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("ДатаДокумента"	, СтруктураОтбора.Дата);  
	Запрос.УстановитьПараметр("Организация"		, СтруктураОтбора.Организация);
	Запрос.УстановитьПараметр("Сотрудник"		, СтруктураОтбора.Сотрудник);
	
	тзРезультат = Запрос.Выполнить().Выгрузить();
	                                                
	Возврат тзРезультат;

КонецФункции // ПолучитьЗаписьНачисления()

Процедура ЗаполнитьКонтрагентаИмеющимисяДанными(НовыйКонтрагент, ИНН, Наименование, СтруктураСчетов, СтруктураТипаКонтрагента)
	     
	ДлиннаИНН = СтрДлина(СокрЛП(ИНН));
	
	ВидКонтрагента = Перечисления.ВидыКонтрагентов.ПустаяСсылка();  
	ОтметкаНеРезидента = Ложь;
	//по длинне ИНН определяем Физ или Юр Лицо
	Если ДлиннаИНН = 9 Тогда 
		//Юр лицо
		ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	ИначеЕсли ДлиннаИНН = 11 Тогда
		//физ лицо   
		ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
	ИначеЕсли ДлиннаИНН = 0 Тогда 
		//скорее всего не резидент 
		ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	Иначе
		ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо; 
		ОтметкаНеРезидента = Истина;
	КонецЕсли;
	
	НовыйКонтрагент.ВидКонтрагента = ВидКонтрагента; 
	НовыйКонтрагент.Покупатель = СтруктураТипаКонтрагента.Покупатель;
	НовыйКонтрагент.Поставщик = СтруктураТипаКонтрагента.Поставщик;      
	НовыйКонтрагент.ПрочиеОтношения = СтруктураТипаКонтрагента.ПрочиеОтношения;
	НовыйКонтрагент.Наименование = ?(СокрЛП(Наименование) <> "", Наименование, НСтр("ru='Создан помощником загрузки выписки';ka='შექმნილია განცხადების ჩამოტვირთვის ასისტენტის მიერ'"));
	НовыйКонтрагент.НаименованиеПолное = ?(СокрЛП(Наименование) <> "", Наименование, НСтр("ru='Создан помощником загрузки выписки';ka='შექმნილია განცხადების ჩამოტვირთვის ასისტენტის მიერ'")); 
	НовыйКонтрагент.ЯвляетсяНеРезидентом = ОтметкаНеРезидента; 
	НовыйКонтрагент.СчетУчетаАвансовПокупателяРегл = СтруктураСчетов.СчетУчетаАвансовПокупателяРегл;
	НовыйКонтрагент.СчетУчетаАвансовПоставщикуРегл = СтруктураСчетов.СчетУчетаАвансовПоставщикуРегл;
	НовыйКонтрагент.СчетУчетаРасчетовСПокупателемРегл = СтруктураСчетов.СчетУчетаРасчетовСПокупателемРегл;
	НовыйКонтрагент.СчетУчетаРасчетовСПоставщикомРегл = СтруктураСчетов.СчетУчетаРасчетовСПоставщикомРегл;
	НовыйКонтрагент.ИНН = ИНН;	 
	
КонецПроцедуры

Процедура ЗаполнитьКонтрагентаДаннымиRS(НовыйКонтрагент, ДанныеКонтрагента, СтруктураСчетов, СтруктураТипаКонтрагента)

	НовыйКонтрагент.Наименование       	= ДанныеКонтрагента.Имя;
	НовыйКонтрагент.НаименованиеПолное 	= ДанныеКонтрагента.Имя;
	
	Если ДанныеКонтрагента.ТипОрганизаций = "ფიზიკური პირი" Тогда
		НовыйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
		НовыйКонтрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
	ИначеЕсли ДанныеКонтрагента.ТипОрганизаций = "შ\პ\ს" ИЛИ ДанныеКонтрагента.ТипОрганизаций = "სააქციო საზოგადოება" ИЛИ ДанныеКонтрагента.ТипОрганизаций = "საჯარო სამართლის იურიდიული პირი" Тогда	
		НовыйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	ИначеЕсли ДанныеКонтрагента.ТипОрганизаций = "სახელმწიფო ორგანოები" Тогда	
		НовыйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ГосударственныйОрган;
	ИначеЕсли ДанныеКонтрагента.ТипОрганизаций = "ინდივიდუალური მეწარმე" Тогда	
		НовыйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
	Иначе
		НовыйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	КонецЕсли;	
			
	// Юридический адрес
	
	ДобавитьЮрАдресс(НовыйКонтрагент, ДанныеКонтрагента.Адрес);
	
	ДанныеКонтрагента = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьИнфоИзRSНаСервереНов(НовыйКонтрагент.ИНН);
	
	//ЗаполнитьФизлицПоИНН(НовыйКонтрагент, ДанныеКонтрагента);
	Если ДанныеКонтрагента = Неопределено Или ДанныеКонтрагента.UnID = 0  Тогда
		Возврат;
	КонецЕсли;	
	
	Если ДанныеКонтрагента.IsVatPayer Тогда
		Если НовыйКонтрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
			НовыйКонтрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		КонецЕсли;			
	Иначе 
		НовыйКонтрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
	КонецЕсли;      
	
	НовыйКонтрагент.Покупатель = СтруктураТипаКонтрагента.Покупатель;
	НовыйКонтрагент.Поставщик = СтруктураТипаКонтрагента.Поставщик;      
	НовыйКонтрагент.ПрочиеОтношения = СтруктураТипаКонтрагента.ПрочиеОтношения;
	
	НовыйКонтрагент.СчетУчетаАвансовПокупателяРегл = СтруктураСчетов.СчетУчетаАвансовПокупателяРегл;
	НовыйКонтрагент.СчетУчетаАвансовПоставщикуРегл = СтруктураСчетов.СчетУчетаАвансовПоставщикуРегл;
	НовыйКонтрагент.СчетУчетаРасчетовСПокупателемРегл = СтруктураСчетов.СчетУчетаРасчетовСПокупателемРегл;
	НовыйКонтрагент.СчетУчетаРасчетовСПоставщикомРегл = СтруктураСчетов.СчетУчетаРасчетовСПоставщикомРегл;

КонецПроцедуры

Процедура ДобавитьЮрАдресс(НовыйКонтрагент, ЮрАдресс)
	
	ТЗ = НовыйКонтрагент.КонтактнаяИнформация.Выгрузить();	

	СтруктураПараметров = Новый Структура("Вид",Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	СтрокаКИ = ТЗ.НайтиСтроки(СтруктураПараметров);
	Если СтрокаКИ.Количество() = 0 Тогда
		СтрокаКИ = ТЗ.Добавить();
		СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	Иначе
		СтрокаКИ = СтрокаКИ[0];
	КонецЕсли;
	
	СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	СтрокаКИ.Представление = ЮрАдресс;
	
	НовыйКонтрагент.КонтактнаяИнформация.Загрузить(ТЗ);
	
КонецПроцедуры

Процедура ЗаполнитьФизлицПоИНН(НовыйКонтрагент, ДанныеКонтрагента)

	Если НовыйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо
		ИЛИ НовыйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель
		И ЗначениеЗаполнено(НовыйКонтрагент.ИНН)
		Тогда
		
		ФИО = СокрЛП(НовыйКонтрагент.Наименование);
		ФИО = СтрЗаменить(ФИО, "  ", " ");
		МассивФИО = СтрРазделить(ФИО, " ", Ложь);
		ПорядокФИО = Константы.ПорядокИмен.Получить();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФизическиеЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.ИНН = &ИНН
		|	И НЕ ФизическиеЛица.ПометкаУдаления
		|	И НЕ ФизическиеЛица.ЭтоГруппа";
		
		Запрос.УстановитьПараметр("ИНН", НовыйКонтрагент.ИНН);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
		
			НовыйКонтрагент.КонтактноеЛицо = Выборка.Ссылка;	
			НовыйКонтрагент.ФизическоеЛицо = Выборка.Ссылка;	
		
		Иначе
		
			НовоеФЛ = Справочники.ФизическиеЛица.СоздатьЭлемент();
			НовоеФЛ.ИНН = НовыйКонтрагент.ИНН;
			НовоеФЛ.Наименование = НовыйКонтрагент.Наименование;
			НовоеФЛ.Записать();
			НовыйКонтрагент.КонтактноеЛицо = НовоеФЛ.Ссылка;	
			НовыйКонтрагент.ФизическоеЛицо = НовоеФЛ.Ссылка;	
		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовыйКонтрагент.ФизическоеЛицо) Тогда
		
			Фамилия = "";
			Имя = "";
			Если МассивФИО.Количество() И ПорядокФИО = Перечисления.ПорядокИмен.ФамилияИмяОтчество Тогда
			
				Фамилия = МассивФИО[0];
				Если МассивФИО.Количество() >= 2 Тогда
				
					Имя = МассивФИО[1];
				
				КонецЕсли; 
			
			ИначеЕсли МассивФИО.Количество() И ПорядокФИО = Перечисления.ПорядокИмен.ИмяОтчествоФамилия Тогда
			
				Имя = МассивФИО[0];
				Если МассивФИО.Количество() >= 3 Тогда
				
					Фамилия = МассивФИО[2];
				
				КонецЕсли; 
			
			ИначеЕсли МассивФИО.Количество() И ПорядокФИО = Перечисления.ПорядокИмен.ИмяФамилияОтчество Тогда
			
				Если МассивФИО.Количество() >= 2 Тогда
				
					Фамилия = МассивФИО[1];
				
				КонецЕсли; 
				Имя = МассивФИО[0];
			
			КонецЕсли; 
			
			Если Не ПустаяСтрока(Фамилия) Или Не ПустаяСтрока(Имя) Тогда
			
				МенеджерЗаписи = РегистрыСведений.ФИОФизЛиц.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ТекущаяДатаСеанса();
				МенеджерЗаписи.ФизЛицо = НовыйКонтрагент.ФизическоеЛицо;
				МенеджерЗаписи.Фамилия = Фамилия;
				МенеджерЗаписи.Имя = Имя;
				МенеджерЗаписи.Записать(Истина);
			
			КонецЕсли; 
		
		КонецЕсли; 
		
	КонецЕсли; 	

КонецПроцедуры // ЗаполнитьФизлицПоИНН()

Процедура ПересчитатьСуммыДокумента(ДокументБанк,СтрокаТабличнойЧасти,Курс, Кратность)
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить("ВалютаКурсКратность",РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокументБанк.Дата,	Новый Структура("Валюта", БанковскийСчет.ВалютаДенежныхСредств)));
	СтруктураДанные.Вставить("ВалютаДенежныхСредств",БанковскийСчет.ВалютаДенежныхСредств);
	
	естьПоступлениеНаСчет = ТипЗнч(ДокументБанк) = Тип("ДокументОбъект.ПоступлениеНаСчет");
	Если ЗначениеЗаполнено(ДокументБанк.ВалютаДенежныхСредств) И естьПоступлениеНаСчет Тогда
		Курс = ?(
		СтруктураДанные.ВалютаКурсКратность.Курс = 0,
		1,
		СтруктураДанные.ВалютаКурсКратность.Курс
		);
		Кратность = ?(
		СтруктураДанные.ВалютаКурсКратность.Кратность = 0,
		1,
		СтруктураДанные.ВалютаКурсКратность.Кратность
		);
		//Если ДокументБанк.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПокупкаВалюты") Тогда
		//	ДокументБанк.Курс = Курс;
		//	ДокументБанк.Кратность = Кратность;
		//КонецЕсли;
		
		ДокументБанк.Курс = ?(
		ДокументБанк.Курс = 0,
		1,
		ДокументБанк.Курс
		);
		ДокументБанк.Кратность = ?(
		ДокументБанк.Кратность = 0,
		1,
		ДокументБанк.Кратность
		);
		
		ДокументБанк.СуммаУчета = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
		ДокументБанк.СуммаДокумента,
		ДокументБанк.Курс,
		Курс,
		ДокументБанк.Кратность,
		Кратность
		);

	КонецЕсли;
	
	Если Не СтрокаТабличнойЧасти = Неопределено Тогда  
		СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
		);
		СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
		);
		СтрокаТабличнойЧасти.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаПлатежа,
		Курс,
		СтрокаТабличнойЧасти.Курс,
		Кратность,
		СтрокаТабличнойЧасти.Кратность
		);
	КонецЕсли;
	
КонецПроцедуры // ПересчитатьСуммыДокумента()

Функция ПолучитьДатуИзСтроки(ДатаСтрока);
	ДатаСтрока = Лев(ДатаСтрока,10);
	
	Год   = прав(ДатаСтрока,4);
	Месяц  = Сред(ДатаСтрока,4,2);
	День = Лев(ДатаСтрока,2);
	
	Возврат Дата(Год,Месяц,День);
	
КонецФункции

Функция НайтиДоговорКонтрагентаПоВалюте(Контрагент,ВалютаДенежныхСредств)
	
	знчВозврата = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.ВалютаРасчетов = &ВалютаРасчетов
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВалютаРасчетов", ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		знчВозврата = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат знчВозврата;
	
КонецФункции

Функция ПолучитьДатуПроверки(ДокОбъект)

	Возврат ?(ЗначениеЗаполнено(ДокОбъект.Дата),Новый МоментВремени(ДокОбъект.Дата, ДокОбъект.Ссылка), ТекущаяДатаСеанса());

КонецФункции        

Функция ПолучитьДатуПроверки2(ДокОбъект)

	Возврат ?(ЗначениеЗаполнено(ДокОбъект.Дата),Новый Граница(ДокОбъект.Дата, ВидГраницы.Исключая),ТекущаяДатаСеанса());

КонецФункции

Процедура УстановитьСчетУчетаВСтрокеТабличнойЧасти(ДокументОбъект, СтрокаТабличнойЧасти, ИзменятьСчетУчета=ЛОЖЬ, УчетнаяПолитика)
	
	Если (НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СчетУчета)) ИЛИ (ИзменятьСчетУчета) Тогда
	
		Если ЗначениеЗаполнено(ДокументОбъект.БанковскийСчетКасса) Тогда
			
			Если (ТипЗНЧ(ДокументОбъект.БанковскийСчетКасса) = Тип("СправочникСсылка.БанковскиеСчета")) ИЛИ (ТипЗНЧ(ДокументОбъект.БанковскийСчетКасса) = Тип("СправочникСсылка.Кассы")) Тогда
		
				СтрокаТабличнойЧасти.СчетУчета = ДокументОбъект.БанковскийСчетКасса.СчетУчета;
				
			ИначеЕсли ТипЗНЧ(ДокументОбъект.БанковскийСчетКасса) = Тип("СправочникСсылка.Сотрудники") Тогда
				
				СтрокаТабличнойЧасти.СчетУчета = ДокументОбъект.БанковскийСчетКасса.СчетРасчетовСПодотчетником;
				
			КонецЕсли;
		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СчетУчета) Тогда
		
			Если ТипЗНЧ(ДокументОбъект.БанковскийСчетКасса) = Тип("СправочникСсылка.Кассы") Тогда
			
				СтрокаТабличнойЧасти.СчетУчета = УчетнаяПолитика.СчетУчетаНаличныхДС;
				
			ИначеЕсли ТипЗНЧ(ДокументОбъект.БанковскийСчетКасса) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			
				СтрокаТабличнойЧасти.СчетУчета = УчетнаяПолитика.СчетУчетаБезналичныхДС;
			
			КонецЕсли;
		
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры         

Процедура УстановитьВидыУдержанийВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ИзменятьВидыУдержаний=ИСТИНА)
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) И ИзменятьВидыУдержаний Тогда
		
		Если СтрокаТабличнойЧасти.Договор.УчитыватьНДФЛ Тогда
		
			СтрокаТабличнойЧасти.ВидУдержанияНДФЛ = СтрокаТабличнойЧасти.Договор.ТипНДФЛ;
			СтрокаТабличнойЧасти.ВидУдержанияПФ = СтрокаТабличнойЧасти.Договор.ТипПФ;
		
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры      

Процедура РасшифровкаПлатежаДоговорПриИзменении(ДокументОбъект, СтрокаТабличнойЧасти, УчетнаяПолитика)
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
	
		СтрокаТабличнойЧасти.Валюта = СтрокаТабличнойЧасти.Договор.ВалютаРасчетов;
		
		КурсыВалют = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокументОбъект.Дата, Новый Структура("Валюта", СтрокаТабличнойЧасти.Валюта));
	    ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,КурсыВалют);
		
		СтрокаТабличнойЧасти.Документ = НЕОПРЕДЕЛЕНО;
		
		СтрокаТабличнойЧасти.СуммаРасчетов = 0;
		СтрокаТабличнойЧасти.СуммаПлатежа = 0;
		
		СтрокаТабличнойЧасти.СтавкаНДС = УчетнаяПолитика.СтавкаНДС;
		
		СтрокаТабличнойЧасти.СтатьяДДС = СтрокаТабличнойЧасти.Договор.СтатьяДДС;
	
	КонецЕсли;
	
	УстановитьСчетаРасчетовВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ИСТИНА, УчетнаяПолитика);
	УстановитьВидыУдержанийВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ИСТИНА);
	
КонецПроцедуры     

Процедура УстановитьСчетаРасчетовВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти,ИзменятьСчетРасчетов=ИСТИНА, УчетнаяПолитика, ЕстьПризнакАвансаВРасшифровки = ЛОЖЬ)

	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.СчетРасчетов) ИЛИ ИзменятьСчетРасчетов Тогда
		
		Если ЕстьПризнакАвансаВРасшифровки И СтрокаТабличнойЧасти.ПризнакАванса Тогда
			
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
				СтрокаТабличнойЧасти.СчетРасчетов = СтрокаТабличнойЧасти.Договор.СчетУчетаАвансовПоставщику;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СчетРасчетов) Тогда
				СтрокаТабличнойЧасти.СчетРасчетов = УчетнаяПолитика.СчетУчетаАвансовПоставщику;
			КонецЕсли;
			
		Иначе	
			
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
				СтрокаТабличнойЧасти.СчетРасчетов = СтрокаТабличнойЧасти.Договор.СчетУчетаРасчетовСПоставщиком;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СчетРасчетов) Тогда
				СтрокаТабличнойЧасти.СчетРасчетов = УчетнаяПолитика.СчетУчетаРасчетовСПоставщиком;
			КонецЕсли;		
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры     

Процедура ЗаполнитьРасшифровкуПлатежаАвтоЗачетДолговРасход(ДокОбъект)
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(ДокОбъект.Организация);
	
	Если ДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		СтавкаНДСПоУмолчанию = ДокОбъект.Организация.СтавкаНДСПоУмолчанию;
	ИначеЕсли ДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
		СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
	Иначе
		СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
	КонецЕсли;
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокОбъект.Дата, Новый Структура("Валюта", ДокОбъект.ВалютаДенежныхСредств));
	
	КурсВалютыДС = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	КратностьВалютыДС = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
	// Заполнение расшифровки расчетов по умолчанию.
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	РасходСоСчетаДоговорыАвтоЗачетаДолгов.Договор,
	|	РасходСоСчетаДоговорыАвтоЗачетаДолгов.СуммаПлатежа КАК СуммаПлатежа
	|ПОМЕСТИТЬ ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная
	|ИЗ
	|	&ДоговорыАвтоЗачетаДолгов КАК РасходСоСчетаДоговорыАвтоЗачетаДолгов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная.Договор,
	|	СУММА(ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная.СуммаПлатежа) КАК СуммаПлатежа
	|ПОМЕСТИТЬ ВременнаяТаблицаДоговорыАвтоЗачета
	|ИЗ
	|	ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная КАК ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная
	|ГДЕ
	|	ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная.Договор <> НЕОПРЕДЕЛЕНО
	|	И ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная.Договор <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиОстатки.Организация КАК Организация,
	|	РасчетыСПоставщикамиОстатки.Контрагент КАК Контрагент,
	|	РасчетыСПоставщикамиОстатки.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиОстатки.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА РасчетыСПоставщикамиОстатки.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиОстатки.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА РасчетыСПоставщикамиОстатки.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	РасчетыСПоставщикамиОстатки.ТипРасчетов КАК ТипРасчетов,
	|	СУММА(ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0)) КАК СуммаОстаток,
	|	СУММА(ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0)) КАК СуммаВалОстаток,
	|	РасчетыСПоставщикамиОстатки.Документ.Дата КАК ДокументДата,
	|	СУММА(ВЫРАЗИТЬ(РасчетыСПоставщикамиОстатки.СуммаВалОстаток * КурсыВалютРасчетов.Курс * КурсыВалютДокумента.Кратность / (КурсыВалютДокумента.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаВалДокумента,
	|	КурсыВалютДокумента.Курс КАК КурсДенежныхСредств,
	|	КурсыВалютДокумента.Кратность КАК КратностьДенежныхСредств,
	|	КурсыВалютРасчетов.Курс КАК Курс,
	|	КурсыВалютРасчетов.Кратность КАК Кратность,
	|	ВременнаяТаблицаДоговорыАвтоЗачета.СуммаПлатежа КАК СуммаПлатежаАвто,
	|	ВременнаяТаблицаДоговорыАвтоЗачета.Договор КАК ДоговорАвто,
	|	РасчетыСПоставщикамиОстатки.ВидУдержанияНДФЛ,
	|	РасчетыСПоставщикамиОстатки.ВидУдержанияПФ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.ВидУдержанияПФ, ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|				ТОГДА 0
	|			ИНАЧЕ (ВЫРАЗИТЬ(РасчетыСПоставщикамиОстатки.СуммаВалОстаток * КурсыВалютРасчетов.Курс * КурсыВалютДокумента.Кратность / (КурсыВалютДокумента.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))) * 0.02
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаПФ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.ВидУдержанияНДФЛ, ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|				ТОГДА 0
	|			ИНАЧЕ ((ВЫРАЗИТЬ(РасчетыСПоставщикамиОстатки.СуммаВалОстаток * КурсыВалютРасчетов.Курс * КурсыВалютДокумента.Кратность / (КурсыВалютДокумента.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.ВидУдержанияПФ, ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|							ТОГДА 0
	|						ИНАЧЕ (ВЫРАЗИТЬ(РасчетыСПоставщикамиОстатки.СуммаВалОстаток * КурсыВалютРасчетов.Курс * КурсыВалютДокумента.Кратность / (КурсыВалютДокумента.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))) * 0.02
	|					КОНЕЦ КАК ЧИСЛО(15, 2)))) * 0.2
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДФЛ
	|ИЗ
	|	ВременнаяТаблицаДоговорыАвтоЗачета КАК ВременнаяТаблицаДоговорыАвтоЗачета
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РасчетыСПоставщикамиОстатки.Организация КАК Организация,
	|			РасчетыСПоставщикамиОстатки.Контрагент КАК Контрагент,
	|			РасчетыСПоставщикамиОстатки.Договор КАК Договор,
	|			РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|			РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|			РасчетыСПоставщикамиОстатки.ТипРасчетов КАК ТипРасчетов,
	|			ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|			ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
	|			ВЫБОР
	|				КОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.Договор.УчитыватьНДФЛ, ЛОЖЬ)
	|					ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.Договор.ВидУдержанияНДФЛ, ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка))
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|			КОНЕЦ КАК ВидУдержанияНДФЛ,
	|			ЕСТЬNULL(УдержанияДляПенсионногоФондаСрезПоследних.ВидУдержания, ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)) КАК ВидУдержанияПФ
	|		ИЗ
	|			РегистрНакопления.РасчетыСПоставщиками.Остатки(&Период
	|					,
	|					Организация = &Организация
	|						И Контрагент = &Контрагент
	|						И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК РасчетыСПоставщикамиОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УдержанияДляПенсионногоФонда.СрезПоследних(&Период, Контрагент = &Контрагент) КАК УдержанияДляПенсионногоФондаСрезПоследних
	|				ПО РасчетыСПоставщикамиОстатки.Контрагент = УдержанияДляПенсионногоФондаСрезПоследних.Контрагент
	|					И РасчетыСПоставщикамиОстатки.Договор = УдержанияДляПенсионногоФондаСрезПоследних.Договор
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ДвиженияДокументаРасчетыСПоставщиками.Организация,
	|			ДвиженияДокументаРасчетыСПоставщиками.Контрагент,
	|			ДвиженияДокументаРасчетыСПоставщиками.Договор,
	|			ДвиженияДокументаРасчетыСПоставщиками.Документ,
	|			ДвиженияДокументаРасчетыСПоставщиками.Заказ,
	|			ДвиженияДокументаРасчетыСПоставщиками.ТипРасчетов,
	|			ВЫБОР
	|				КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|				ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|				ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Договор.УчитыватьНДФЛ, ЛОЖЬ)
	|					ТОГДА ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Договор.ВидУдержанияНДФЛ, ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка))
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|			КОНЕЦ,
	|			ЕСТЬNULL(УдержанияДляПенсионногоФондаСрезПоследних.ВидУдержания, ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка))
	|		ИЗ
	|			РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокументаРасчетыСПоставщиками
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УдержанияДляПенсионногоФонда.СрезПоследних(&Период, Контрагент = &Контрагент) КАК УдержанияДляПенсионногоФондаСрезПоследних
	|				ПО ДвиженияДокументаРасчетыСПоставщиками.Контрагент = УдержанияДляПенсионногоФондаСрезПоследних.Контрагент
	|					И ДвиженияДокументаРасчетыСПоставщиками.Договор = УдержанияДляПенсионногоФондаСрезПоследних.Договор
	|		ГДЕ
	|			ДвиженияДокументаРасчетыСПоставщиками.Регистратор = &Ссылка
	|			И ДвиженияДокументаРасчетыСПоставщиками.Период <= &Период
	|			И ДвиженияДокументаРасчетыСПоставщиками.Организация = &Организация
	|			И ДвиженияДокументаРасчетыСПоставщиками.Контрагент = &Контрагент
	|			И ДвиженияДокументаРасчетыСПоставщиками.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК РасчетыСПоставщикамиОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютДокумента
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютРасчетов
	|			ПО РасчетыСПоставщикамиОстатки.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|		ПО ВременнаяТаблицаДоговорыАвтоЗачета.Договор = РасчетыСПоставщикамиОстатки.Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиОстатки.Организация,
	|	РасчетыСПоставщикамиОстатки.Контрагент,
	|	РасчетыСПоставщикамиОстатки.Договор,
	|	РасчетыСПоставщикамиОстатки.Документ,
	|	РасчетыСПоставщикамиОстатки.Заказ,
	|	РасчетыСПоставщикамиОстатки.ТипРасчетов,
	|	РасчетыСПоставщикамиОстатки.Документ.Дата,
	|	КурсыВалютДокумента.Курс,
	|	КурсыВалютДокумента.Кратность,
	|	КурсыВалютРасчетов.Курс,
	|	КурсыВалютРасчетов.Кратность,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиОстатки.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА РасчетыСПоставщикамиОстатки.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиОстатки.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА РасчетыСПоставщикамиОстатки.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВременнаяТаблицаДоговорыАвтоЗачета.Договор,
	|	ВременнаяТаблицаДоговорыАвтоЗачета.СуммаПлатежа,
	|	РасчетыСПоставщикамиОстатки.ВидУдержанияНДФЛ,
	|	РасчетыСПоставщикамиОстатки.ВидУдержанияПФ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.ВидУдержанияПФ, ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|				ТОГДА 0
	|			ИНАЧЕ (ВЫРАЗИТЬ(РасчетыСПоставщикамиОстатки.СуммаВалОстаток * КурсыВалютРасчетов.Курс * КурсыВалютДокумента.Кратность / (КурсыВалютДокумента.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))) * 0.02
	|		КОНЕЦ КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.ВидУдержанияНДФЛ, ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|				ТОГДА 0
	|			ИНАЧЕ ((ВЫРАЗИТЬ(РасчетыСПоставщикамиОстатки.СуммаВалОстаток * КурсыВалютРасчетов.Курс * КурсыВалютДокумента.Кратность / (КурсыВалютДокумента.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.ВидУдержанияПФ, ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|							ТОГДА 0
	|						ИНАЧЕ (ВЫРАЗИТЬ(РасчетыСПоставщикамиОстатки.СуммаВалОстаток * КурсыВалютРасчетов.Курс * КурсыВалютДокумента.Кратность / (КурсыВалютДокумента.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))) * 0.02
	|					КОНЕЦ КАК ЧИСЛО(15, 2)))) * 0.2
	|		КОНЕЦ КАК ЧИСЛО(15, 2))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата
	|ИТОГИ
	|	СУММА(СуммаОстаток),
	|	СУММА(СуммаВалОстаток),
	|	СУММА(СуммаВалДокумента),
	|	МАКСИМУМ(СуммаПлатежаАвто)
	|ПО
	|	ДоговорАвто";
		
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Контрагент", ДокОбъект.Контрагент);
	Запрос.УстановитьПараметр("Период", ДокОбъект.Дата);
	Запрос.УстановитьПараметр("Валюта", ДокОбъект.ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("Ссылка", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("ДоговорыАвтоЗачетаДолгов", ДокОбъект.ДоговорыАвтоЗачетаДолгов.Выгрузить());
	
	НуженОтборПоДоговорам = УправлениеНебольшойФирмойПовтИсп.ТребуетсяКонтрольДоговоровКонтрагентов();
	СписокВидовДоговоров = Справочники.ДоговорыКонтрагентов.ПолучитьСписокВидовДоговораДляДокумента(ДокОбъект.Ссылка, ДокОбъект.ВидОперации);
	Если НуженОтборПоДоговорам
	   И ДокОбъект.Контрагент.ВестиРасчетыПоДоговорам Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "// ТекстДоговорОтбор", "И Договор.ВидДоговора В (&СписокВидовДоговоров)");
		Запрос.УстановитьПараметр("СписокВидовДоговоров", СписокВидовДоговоров);
	КонецЕсли;
	
	Если ДокОбъект.Контрагент.ВестиРасчетыПоДоговорам Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "// ТекстДоговорАвтозаполнениеОтбор", "И Договор В (&ТаблицаДоговоровАвтоЗачета)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "// ТекстДоговорДвиженийАвтозаполнениеОтбор", "И ДвиженияДокументаРасчетыСПоставщиками.Договор В (&ТаблицаДоговоровАвтоЗачета)");
		Запрос.УстановитьПараметр("ТаблицаДоговоровАвтоЗачета", ДокОбъект.ДоговорыАвтоЗачетаДолгов.ВыгрузитьКолонку("Договор"));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДокОбъект.РасшифровкаПлатежа.Очистить();
	
	//+++ Дмгг
	Если ЗначениеЗаполнено(ДокОбъект.Контрагент) Тогда 
		Если ДокОбъект.Контрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда 
			СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
		ИначеЕсли ДокОбъект.Контрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
			СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
		ИначеЕсли ДокОбъект.Контрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
			СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
		КонецЕсли;
	КонецЕсли;
	СтавкаНДСПоУмолчаниюЧисло = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтавкаНДСПоУмолчанию);
	//--- Дмгг
	
	ВыборкаИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтоги.Следующий() Цикл
		
		ТекущийДоговор = ВыборкаИтоги.ДоговорАвто;
		
		СтруктураКурсВалютыДоговораПоУмолчанию = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
			ДокОбъект.Дата,
			Новый Структура("Валюта", ТекущийДоговор.ВалютаРасчетов)
		);
		
		ВыборкаРезультатаЗапроса = ВыборкаИтоги.Выбрать();
		
		СуммаОсталосьРаспределить = ВыборкаИтоги.СуммаПлатежаАвто;
		
		Пока СуммаОсталосьРаспределить > 0 Цикл
			
			Если ВыборкаРезультатаЗапроса.Следующий() Тогда
				
				Если ВыборкаРезультатаЗапроса.СуммаВалОстаток <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ДокОбъект.РасшифровкаПлатежа.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
				
				Если ВыборкаРезультатаЗапроса.СуммаВалДокумента <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
					
					НоваяСтрока.СуммаРасчетов = ВыборкаРезультатаЗапроса.СуммаВалОстаток;
					НоваяСтрока.СуммаПлатежа = ВыборкаРезультатаЗапроса.СуммаВалДокумента;
					НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
					//+++ Дмгг
					//НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаПлатежа - (НоваяСтрока.СуммаПлатежа) / ((СтавкаНДСПоУмолчанию.Ставка + 100) / 100);
					НоваяСтрока.ВидУдержанияНДФЛ = ВыборкаРезультатаЗапроса.ВидУдержанияНДФЛ;
					НоваяСтрока.ВидУдержанияПФ = ВыборкаРезультатаЗапроса.ВидУдержанияПФ;
					РС_ОбщегоНазначения.ПересчитатьСуммыСтроки_РасходИзКассы_РасходСоСчета("СуммаПлатежа", НоваяСтрока, Истина);
					//--- Дмгг
					СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - ВыборкаРезультатаЗапроса.СуммаВалДокумента;
					
				Иначе // сумма остатка больше чем нужно распределить
					
					НоваяСтрока.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
						СуммаОсталосьРаспределить,
						ВыборкаРезультатаЗапроса.КурсДенежныхСредств,
						ВыборкаРезультатаЗапроса.Курс,
						ВыборкаРезультатаЗапроса.КратностьДенежныхСредств,
						ВыборкаРезультатаЗапроса.Кратность
					);
					НоваяСтрока.СуммаПлатежа = СуммаОсталосьРаспределить;
					НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
					//+++ Дмгг
					//НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаПлатежа - (НоваяСтрока.СуммаПлатежа) / ((СтавкаНДСПоУмолчанию.Ставка + 100) / 100);
					НоваяСтрока.ВидУдержанияНДФЛ = ВыборкаРезультатаЗапроса.ВидУдержанияНДФЛ;
					НоваяСтрока.ВидУдержанияПФ = ВыборкаРезультатаЗапроса.ВидУдержанияПФ;
					РС_ОбщегоНазначения.ПересчитатьСуммыСтроки_РасходИзКассы_РасходСоСчета("СуммаПлатежа", НоваяСтрока, Истина);
					//--- Дмгг
					СуммаОсталосьРаспределить = 0;
					
				КонецЕсли;
				
			Иначе
				
				НоваяСтрока = ДокОбъект.РасшифровкаПлатежа.Добавить();
				НоваяСтрока.Договор = ТекущийДоговор;
				
				НоваяСтрока.Курс = ?(
					СтруктураКурсВалютыДоговораПоУмолчанию.Курс = 0,
					1,
					СтруктураКурсВалютыДоговораПоУмолчанию.Курс
				);
				НоваяСтрока.Кратность = ?(
					СтруктураКурсВалютыДоговораПоУмолчанию.Кратность = 0,
					1,
					СтруктураКурсВалютыДоговораПоУмолчанию.Кратность
				);
				НоваяСтрока.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
					СуммаОсталосьРаспределить,
					КурсВалютыДС,
					НоваяСтрока.Курс,
					КратностьВалютыДС,
					НоваяСтрока.Кратность
				);
				НоваяСтрока.ПризнакАванса = Истина;
				НоваяСтрока.СуммаПлатежа = СуммаОсталосьРаспределить;
				НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
				//НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаПлатежа - (НоваяСтрока.СуммаПлатежа) / ((СтавкаНДСПоУмолчанию.Ставка + 100) / 100);
				//+++ Дмгг
				Если ДокОбъект.ДоговорДляЗачетаАвансаСПомощником.УчитыватьНДФЛ Тогда 
					НоваяСтрока.ВидУдержанияНДФЛ = ДокОбъект.ДоговорДляЗачетаАвансаСПомощником.ВидУдержанияНДФЛ;
				КонецЕсли;
				
				тзСрезПФ = РегистрыСведений.УдержанияДляПенсионногоФонда.СрезПоследних(ДокОбъект.Дата, Новый Структура("Контрагент, Договор", ДокОбъект.Контрагент, ДокОбъект.ДоговорДляЗачетаАвансаСПомощником));
				Если тзСрезПФ.Количество() > 0 Тогда 
					НоваяСтрока.ВидУдержанияПФ = тзСрезПФ[0].ВидУдержания;
				КонецЕсли;
				
				РС_ОбщегоНазначения.ПересчитатьСуммыСтроки_РасходИзКассы_РасходСоСчета("СуммаПлатежа", НоваяСтрока, Истина);
				//--- Дмгг
				СуммаОсталосьРаспределить = 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла; // Пока ВыборкаИтоги.Следующий() Цикл
	
	Если ДокОбъект.РасшифровкаПлатежа.Количество() = 0 Тогда
		ДокОбъект.РасшифровкаПлатежа.Добавить();
		ДокОбъект.РасшифровкаПлатежа[0].СуммаПлатежа = ДокОбъект.СуммаДокумента;
	КонецЕсли;
	
	СуммаПлатежа = ДокОбъект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	
КонецПроцедуры

Процедура ЗаполнитьРасшифровкуПлатежаАвтоЗачетДолговПриход(ДокОбъект) Экспорт
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(ДокОбъект.Организация);
	
	Если ДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		СтавкаНДСПоУмолчанию = Организация.СтавкаНДСПоУмолчанию;
	ИначеЕсли ДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
		СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
	Иначе
		СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
	КонецЕсли;
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокОбъект.Дата, Новый Структура("Валюта", ДокОбъект.ВалютаДенежныхСредств));
	
	КурсВалютыДС = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	КратностьВалютыДС = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
	// Заполнение расшифровки расчетов по умолчанию.
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	РасходСоСчетаДоговорыАвтоЗачетаДолгов.Договор КАК Договор,
	|	РасходСоСчетаДоговорыАвтоЗачетаДолгов.СуммаПлатежа КАК СуммаПлатежа
	|ПОМЕСТИТЬ ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная
	|ИЗ
	|	&ДоговорыАвтоЗачетаДолгов КАК РасходСоСчетаДоговорыАвтоЗачетаДолгов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная.Договор КАК Договор,
	|	СУММА(ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная.СуммаПлатежа) КАК СуммаПлатежа
	|ПОМЕСТИТЬ ВременнаяТаблицаДоговорыАвтоЗачета
	|ИЗ
	|	ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная КАК ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная
	|ГДЕ
	|	ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная.Договор <> НЕОПРЕДЕЛЕНО
	|	И ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная.Договор <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаДоговорыАвтоЗачетаПредварительная.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПокупателямиОстатки.Организация КАК Организация,
	|	РасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
	|	РасчетыСПокупателямиОстатки.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА РасчетыСПокупателямиОстатки.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА РасчетыСПокупателямиОстатки.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА РасчетыСПокупателямиОстатки.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА РасчетыСПокупателямиОстатки.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	РасчетыСПокупателямиОстатки.ТипРасчетов КАК ТипРасчетов,
	|	СУММА(ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0)) КАК СуммаОстаток,
	|	СУММА(ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0)) КАК СуммаВалОстаток,
	|	РасчетыСПокупателямиОстатки.Документ.Дата КАК ДокументДата,
	|	СУММА(ВЫРАЗИТЬ(РасчетыСПокупателямиОстатки.СуммаВалОстаток * КурсыВалютРасчетов.Курс * КурсыВалютДокумента.Кратность / (КурсыВалютДокумента.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаВалДокумента,
	|	КурсыВалютДокумента.Курс КАК КурсДенежныхСредств,
	|	КурсыВалютДокумента.Кратность КАК КратностьДенежныхСредств,
	|	КурсыВалютРасчетов.Курс КАК Курс,
	|	КурсыВалютРасчетов.Кратность КАК Кратность,
	|	ВременнаяТаблицаДоговорыАвтоЗачета.СуммаПлатежа КАК СуммаПлатежаАвто,
	|	ВременнаяТаблицаДоговорыАвтоЗачета.Договор КАК ДоговорАвто
	|ИЗ
	|	ВременнаяТаблицаДоговорыАвтоЗачета КАК ВременнаяТаблицаДоговорыАвтоЗачета
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РасчетыСПокупателямиОстатки.Организация КАК Организация,
	|			РасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
	|			РасчетыСПокупателямиОстатки.Договор КАК Договор,
	|			РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|			РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|			РасчетыСПокупателямиОстатки.ТипРасчетов КАК ТипРасчетов,
	|			ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|			ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток
	|		ИЗ
	|			РегистрНакопления.РасчетыСПокупателями.Остатки(
	|					&Период,
	|					Организация = &Организация
	|						И Контрагент = &Контрагент
	|						И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК РасчетыСПокупателямиОстатки
	|		ГДЕ
	|			РасчетыСПокупателямиОстатки.Документ.Дата < &Период
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ДвиженияДокументаРасчетыСПоставщиками.Организация,
	|			ДвиженияДокументаРасчетыСПоставщиками.Контрагент,
	|			ДвиженияДокументаРасчетыСПоставщиками.Договор,
	|			ДвиженияДокументаРасчетыСПоставщиками.Документ,
	|			ДвиженияДокументаРасчетыСПоставщиками.Заказ,
	|			ДвиженияДокументаРасчетыСПоставщиками.ТипРасчетов,
	|			ВЫБОР
	|				КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|				ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|				ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|			КОНЕЦ
	|		ИЗ
	|			РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокументаРасчетыСПоставщиками
	|		ГДЕ
	|			ДвиженияДокументаРасчетыСПоставщиками.Регистратор = &Ссылка
	|			И ДвиженияДокументаРасчетыСПоставщиками.Период <= &Период
	|			И ДвиженияДокументаРасчетыСПоставщиками.Организация = &Организация
	|			И ДвиженияДокументаРасчетыСПоставщиками.Контрагент = &Контрагент
	|			И ДвиженияДокументаРасчетыСПоставщиками.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК РасчетыСПокупателямиОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютДокумента
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютРасчетов
	|			ПО РасчетыСПокупателямиОстатки.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|		ПО ВременнаяТаблицаДоговорыАвтоЗачета.Договор = РасчетыСПокупателямиОстатки.Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПокупателямиОстатки.Организация,
	|	РасчетыСПокупателямиОстатки.Контрагент,
	|	РасчетыСПокупателямиОстатки.Договор,
	|	РасчетыСПокупателямиОстатки.Документ,
	|	РасчетыСПокупателямиОстатки.Заказ,
	|	РасчетыСПокупателямиОстатки.ТипРасчетов,
	|	РасчетыСПокупателямиОстатки.Документ.Дата,
	|	КурсыВалютДокумента.Курс,
	|	КурсыВалютДокумента.Кратность,
	|	КурсыВалютРасчетов.Курс,
	|	КурсыВалютРасчетов.Кратность,
	|	ВЫБОР
	|		КОГДА РасчетыСПокупателямиОстатки.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА РасчетыСПокупателямиОстатки.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыСПокупателямиОстатки.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА РасчетыСПокупателямиОстатки.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВременнаяТаблицаДоговорыАвтоЗачета.Договор,
	|	ВременнаяТаблицаДоговорыАвтоЗачета.СуммаПлатежа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата
	|ИТОГИ
	|	СУММА(СуммаОстаток),
	|	СУММА(СуммаВалОстаток),
	|	СУММА(СуммаВалДокумента),
	|	МАКСИМУМ(СуммаПлатежаАвто)
	|ПО
	|	ДоговорАвто";
		
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Контрагент", ДокОбъект.Контрагент);
	Запрос.УстановитьПараметр("Период", ДокОбъект.Дата);
	Запрос.УстановитьПараметр("Валюта", ДокОбъект.ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("Ссылка", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("ДоговорыАвтоЗачетаДолгов", ДокОбъект.ДоговорыАвтоЗачетаДолгов.Выгрузить());
	
	НуженОтборПоДоговорам = УправлениеНебольшойФирмойПовтИсп.ТребуетсяКонтрольДоговоровКонтрагентов();
	СписокВидовДоговоров = Справочники.ДоговорыКонтрагентов.ПолучитьСписокВидовДоговораДляДокумента(ДокОбъект.Ссылка, ДокОбъект.ВидОперации);
	Если НуженОтборПоДоговорам
	   И ДокОбъект.Контрагент.ВестиРасчетыПоДоговорам Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "// ТекстДоговорОтбор", "И Договор.ВидДоговора В (&СписокВидовДоговоров)");
		Запрос.УстановитьПараметр("СписокВидовДоговоров", СписокВидовДоговоров);
	КонецЕсли;
	
	Если ДокОбъект.Контрагент.ВестиРасчетыПоДоговорам Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "// ТекстДоговорАвтозаполнениеОтбор", "И Договор В (&ТаблицаДоговоровАвтоЗачета)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "// ТекстДоговорДвиженийАвтозаполнениеОтбор", "И ДвиженияДокументаРасчетыСПоставщиками.Договор В (&ТаблицаДоговоровАвтоЗачета)");
		Запрос.УстановитьПараметр("ТаблицаДоговоровАвтоЗачета", ДокОбъект.ДоговорыАвтоЗачетаДолгов.ВыгрузитьКолонку("Договор"));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДокОбъект.РасшифровкаПлатежа.Очистить();
	
	ВыборкаИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтоги.Следующий() Цикл
		
		ТекущийДоговор = ВыборкаИтоги.ДоговорАвто;
		
		СтруктураКурсВалютыДоговораПоУмолчанию = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
			ДокОбъект.Дата,
			Новый Структура("Валюта", ТекущийДоговор.ВалютаРасчетов)
		);
		
		ВыборкаРезультатаЗапроса = ВыборкаИтоги.Выбрать();
		
		СуммаОсталосьРаспределить = ВыборкаИтоги.СуммаПлатежаАвто;
		
		Пока СуммаОсталосьРаспределить > 0 Цикл
			
			Если ВыборкаРезультатаЗапроса.Следующий() Тогда
				
				Если ВыборкаРезультатаЗапроса.СуммаВалОстаток <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ДокОбъект.РасшифровкаПлатежа.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
				
				Если ВыборкаРезультатаЗапроса.СуммаВалДокумента <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
					
					НоваяСтрока.СуммаРасчетов = ВыборкаРезультатаЗапроса.СуммаВалОстаток;
					НоваяСтрока.СуммаПлатежа = ВыборкаРезультатаЗапроса.СуммаВалДокумента;
					НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
					НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаПлатежа - (НоваяСтрока.СуммаПлатежа) / ((СтавкаНДСПоУмолчанию.Ставка + 100) / 100);
					СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - ВыборкаРезультатаЗапроса.СуммаВалДокумента;
					
				Иначе // сумма остатка больше чем нужно распределить
					
					НоваяСтрока.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
						СуммаОсталосьРаспределить,
						ВыборкаРезультатаЗапроса.КурсДенежныхСредств,
						ВыборкаРезультатаЗапроса.Курс,
						ВыборкаРезультатаЗапроса.КратностьДенежныхСредств,
						ВыборкаРезультатаЗапроса.Кратность
					);
					НоваяСтрока.СуммаПлатежа = СуммаОсталосьРаспределить;
					НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
					НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаПлатежа - (НоваяСтрока.СуммаПлатежа) / ((СтавкаНДСПоУмолчанию.Ставка + 100) / 100);
					СуммаОсталосьРаспределить = 0;
					
				КонецЕсли;
				
			Иначе
				
				НоваяСтрока = ДокОбъект.РасшифровкаПлатежа.Добавить();
				НоваяСтрока.Договор = ТекущийДоговор;
				
				НоваяСтрока.Курс = ?(
					СтруктураКурсВалютыДоговораПоУмолчанию.Курс = 0,
					1,
					СтруктураКурсВалютыДоговораПоУмолчанию.Курс
				);
				НоваяСтрока.Кратность = ?(
					СтруктураКурсВалютыДоговораПоУмолчанию.Кратность = 0,
					1,
					СтруктураКурсВалютыДоговораПоУмолчанию.Кратность
				);
				НоваяСтрока.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
					СуммаОсталосьРаспределить,
					КурсВалютыДС,
					НоваяСтрока.Курс,
					КратностьВалютыДС,
					НоваяСтрока.Кратность
				);
				НоваяСтрока.ПризнакАванса = Истина;
				НоваяСтрока.СуммаПлатежа = СуммаОсталосьРаспределить;
				НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
				НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаПлатежа - (НоваяСтрока.СуммаПлатежа) / ((СтавкаНДСПоУмолчанию.Ставка + 100) / 100);
				СуммаОсталосьРаспределить = 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла; // Пока ВыборкаИтоги.Следующий() Цикл
	
	Если ДокОбъект.РасшифровкаПлатежа.Количество() = 0 Тогда
		ДокОбъект.РасшифровкаПлатежа.Добавить();
		ДокОбъект.РасшифровкаПлатежа[0].СуммаПлатежа = ДокОбъект.СуммаДокумента;
	КонецЕсли;
	
	СуммаПлатежа = ДокОбъект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	
КонецПроцедуры // ЗаполнитьРасшифровкуПлатежа()

Функция BOG_РазобратьСтрокуДополнительногоЗначенияВСтруктуру(СтрокаРазбора)

	// ищем курс и контр сумму они вернуться структурой
	ЗначениеКурсаТекст = ""; 
	ИмяВалюты = "";
	ПозицияТекстаКурс = СтрНайти(СтрокаРазбора, "კურსი:");
	//+++ Дмгг, Помимо колонок переводиться еще и текс платежа, ONESOFT-2874
	ДлиннаТекстаПоиска = ?(ПозицияТекстаКурс <> 0, 6, 8);
	ИскатьТочку = ?(ПозицияТекстаКурс <> 0, ЛОЖЬ, Истина);
	ПозицияТекстаКурс = ?(ПозицияТекстаКурс <> 0, ПозицияТекстаКурс, СтрНайти(СтрокаРазбора, "FX Rate:"));	
	//--- Дмгг, Помимо колонок переводиться еще и текс платежа, ONESOFT-2874
	Если ПозицияТекстаКурс <> 0 Тогда                             
		//+++ Дмгг, Помимо колонок переводиться еще и текс платежа, ONESOFT-2874
		//ПоискЗначенияКурса = Сред(СтрокаРазбора, ПозицияТекстаКурс + 6); 
		//ПоискПробелаОкончанияЗначенияКурс = СтрНайти(ПоискЗначенияКурса, " ");   
		//ЗначениеКурсаТекст = Сред(ПоискЗначенияКурса, 1, ПоискПробелаОкончанияЗначенияКурс);
		ПоискЗначенияКурса = Сред(СтрокаРазбора, ПозицияТекстаКурс + ДлиннаТекстаПоиска);
		Если ИскатьТочку Тогда                                               
			ПоискПробелаОкончанияЗначенияКурс = СтрНайти(ПоискЗначенияКурса, ". ");  
			ЗначениеКурсаТекст = Сред(ПоискЗначенияКурса, 1, ПоискПробелаОкончанияЗначенияКурс-1);
		Иначе
			ПоискПробелаОкончанияЗначенияКурс = СтрНайти(ПоискЗначенияКурса, " "); 
			ЗначениеКурсаТекст = Сред(ПоискЗначенияКурса, 1, ПоискПробелаОкончанияЗначенияКурс);
		КонецЕсли;
		//--- Дмгг, Помимо колонок переводиться еще и текс платежа, ONESOFT-2874
	КонецЕсли;
	
	ЗначениеКонтрСуммыТекст = "";
	ПозицияТекстаКонтрСуммы = СтрНайти(СтрокаРазбора, "კონტრთანხა: ");
	//+++ Дмгг, Помимо колонок переводиться еще и текс платежа, ONESOFT-2874
	ДлиннаТекстаПоиска = ?(ПозицияТекстаКонтрСуммы <> 0, 15, 19);
	ПозицияТекстаКонтрСуммы = ?(ПозицияТекстаКонтрСуммы <> 0, ПозицияТекстаКонтрСуммы, СтрНайти(СтрокаРазбора, "Counter-amount: ")); 
	//--- Дмгг, Помимо колонок переводиться еще и текс платежа, ONESOFT-2874
	Если ПозицияТекстаКонтрСуммы <> 0 Тогда   
		ИмяВалюты = Сред(СтрокаРазбора, ПозицияТекстаКонтрСуммы + ДлиннаТекстаПоиска-3,3); 
		//+++ Дмгг, Помимо колонок переводиться еще и текс платежа, ONESOFT-2874
		//ПоискЗначенияКонтрСуммы = Сред(СтрокаРазбора, ПозицияТекстаКонтрСуммы + 15); 
		ПоискЗначенияКонтрСуммы = Сред(СтрокаРазбора, ПозицияТекстаКонтрСуммы + ДлиннаТекстаПоиска);
		//-- Дмгг, Помимо колонок переводиться еще и текс платежа, ONESOFT-2874
		ПоискПробелаОкончанияЗначенияКонтрСуммы = СтрНайти(ПоискЗначенияКонтрСуммы, ".");
		ЗначениеКонтрСуммыТекст = Сред(ПоискЗначенияКонтрСуммы, 1, ПоискПробелаОкончанияЗначенияКонтрСуммы-1);
		ЗначениеКонтрСуммыТекстКопейки = Сред(ПоискЗначенияКонтрСуммы, ПоискПробелаОкончанияЗначенияКонтрСуммы+1, 2);
	КонецЕсли;
	
	Если СокрЛП(ЗначениеКурсаТекст) <> "" Тогда 
		ЗначениеКурса = Число(СтрЗаменить(СокрЛП(ЗначениеКурсаТекст), ",", "."));
	Иначе
		ЗначениеКурса = 0;
	КонецЕсли;
	
	Если СокрЛП(ЗначениеКонтрСуммыТекст) <> "" Тогда
		//ЗначениеКонтрСуммы = Число(СтрЗаменить(СокрЛП(ЗначениеКонтрСуммыТекст), ",", "")) + Число(ЗначениеКонтрСуммыТекстКопейки)/100;
		
		//++Lazare 30.10.2024 ONESOFT-3569	
		//ЗначениеКонтрСуммы = Число(СтрЗаменить(СокрЛП(ЗначениеКонтрСуммыТекст), ",", "")) + ?(СтрДлина(Число(ЗначениеКонтрСуммыТекстКопейки)) = 1,Число(ЗначениеКонтрСуммыТекстКопейки)/10,Число(ЗначениеКонтрСуммыТекстКопейки)/100);//++Lazare 07.05.2024 ONESOFT-3134  
		ТекстКопейки = СтрЗаменить(СокрЛП(ЗначениеКонтрСуммыТекстКопейки), ".", "");
		Если ЗначениеЗаполнено(ТекстКопейки) Тогда 
			ЗначениеКонтрСуммы = Число(СтрЗаменить(СокрЛП(ЗначениеКонтрСуммыТекст), ",", "")) + ?(СтрДлина(ТекстКопейки) = 1,Число(ТекстКопейки)/10,Число(ТекстКопейки)/100);
		Иначе 
			ЗначениеКонтрСуммы = Число(СтрЗаменить(СокрЛП(ЗначениеКонтрСуммыТекст), ",", ""));
		КонецЕсли;
		//++Lazare 30.10.2024 ONESOFT-3569
	Иначе
		ЗначениеКонтрСуммы = 0;
	КонецЕсли;
	
	Возврат Новый Структура("Курс, КонтрСумма, ИмяВалюты", ЗначениеКурса, ЗначениеКонтрСуммы, ИмяВалюты)
	
КонецФункции // BOG_РазобратьСтрокуДополнительногоЗначенияВСтруктуру(Данные.ДополнительноеЗначение)()

Функция PC_РазобратьСтрокуДополнительногоЗначенияВСтруктуру(СтрокаРазбора)

	Позиция = СтрНайти(СтрокаРазбора, " GEL");
	
	Если Позиция <> 0 Тогда 
		КурсТекст = СокрЛП(Сред(СтрокаРазбора, Позиция-6, 6));
		ЗначениеКурса = Число(КурсТекст);
		ЗначениеКонтрСуммы = 0;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Новый Структура("Курс, КонтрСумма", ЗначениеКурса, ЗначениеКонтрСуммы)
	
КонецФункции // BOG_РазобратьСтрокуДополнительногоЗначенияВСтруктуру(Данные.ДополнительноеЗначение)()

Процедура ДополнитьДокументыКонвертации() Экспорт

	СтруктураОтбора  = Новый Структура; 
	СтруктураОтбора.Вставить("_Загружать", Истина); 
	ТаблицаВыбранныхСтрок = ТаблицаВыписки.Выгрузить().Скопировать(СтруктураОтбора);	
	
	Для Каждого Данные Из ТаблицаВыбранныхСтрок Цикл 
		
		Если ТипЗнч(Данные._СсылкаНаДокумент) <> Тип("ДокументСсылка.Конвертация") Тогда 
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Данные._СсылкаНаДокумент.ПолучитьОбъект();
		
		Если ЗначениеЗаполнено(Данные.СуммаДт) Тогда
			
			//новыйДокумент.Отправитель		= БанковскийСчет;
			//новыйДокумент.ВалютаОтправитель = БанковскийСчет.ВалютаДенежныхСредств;
			//СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(новыйДокумент.Дата, Новый Структура("Валюта", новыйДокумент.ВалютаОтправитель));
			//новыйДокумент.КурсОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			//новыйДокумент.КурсОтправительНацБанк = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			//новыйДокумент.КратностьОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
			ДокументОбъект.СуммаКонвертации 	= Данные.СуммаДт;
			
			//новыйДокумент.Получатель	 	= Данные.СчетКонтрагента1С;
			//новыйДокумент.ВалютаПолучатель	= Данные.СчетКонтрагента1С.ВалютаДенежныхСредств;
			//СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(новыйДокумент.Дата, Новый Структура("Валюта", новыйДокумент.ВалютаПолучатель));
			//новыйДокумент.КурсПолучательНацБанк= ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			//новыйДокумент.КратностьПолучатель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
			//Если СтруктураДополнительногоЗначение <> Неопределено Тогда 
			//	новыйДокумент.КурсПолучатель= СтруктураДополнительногоЗначение.Курс;
			//	Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia Тогда
			//		новыйДокумент.СуммаПолучено = СтруктураДополнительногоЗначение.КонтрСумма;
			//	ИначеЕсли ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.ProCredit Тогда
			//		новыйДокумент.СуммаПолучено = новыйДокумент.СуммаКонвертации * (новыйДокумент.КурсОтправитель * новыйДокумент.КратностьПолучатель) / (новыйДокумент.КурсПолучатель * новыйДокумент.КратностьОтправитель);
			//	КонецЕсли;
			//Иначе 
				ДокументОбъект.КурсПолучатель	= ДокументОбъект.СуммаКонвертации / ДокументОбъект.СуммаПолучено;//?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			//	новыйДокумент.СуммаПолучено 	= новыйДокумент.СуммаКонвертации * (новыйДокумент.КурсОтправитель * новыйДокумент.КратностьПолучатель) / (новыйДокумент.КурсПолучатель * новыйДокумент.КратностьОтправитель);
			//КонецЕсли;
			
		Иначе
			
			//новыйДокумент.Отправитель		= Данные.СчетКонтрагента1С;
			//новыйДокумент.ВалютаОтправитель = Данные.СчетКонтрагента1С.ВалютаДенежныхСредств;
			//СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(новыйДокумент.Дата, Новый Структура("Валюта", новыйДокумент.ВалютаОтправитель));
			//новыйДокумент.КурсОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			//новыйДокумент.КурсОтправительНацБанк = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			//новыйДокумент.КратностьОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
			////новыйДокумент.СуммаКонвертации 	= Данные.СуммаКт;
			
			
			//новыйДокумент.Получатель	 	= БанковскийСчет;
			//новыйДокумент.ВалютаПолучатель	= БанковскийСчет.ВалютаДенежныхСредств;
			//СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(новыйДокумент.Дата, Новый Структура("Валюта", новыйДокумент.ВалютаПолучатель));
			////новыйДокумент.КурсПолучатель	= ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			//новыйДокумент.КратностьПолучатель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
			//новыйДокумент.КурсПолучательНацБанк = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			ДокументОбъект.СуммаПолучено 	= Данные.СуммаКт;
			ДокументОбъект.КурсПолучатель	= ДокументОбъект.СуммаКонвертации / ДокументОбъект.СуммаПолучено;
			
			//Если СтруктураДополнительногоЗначение <> Неопределено Тогда 
			//	новыйДокумент.КурсПолучатель	= СтруктураДополнительногоЗначение.Курс;
			//	Если ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia Тогда
			//		новыйДокумент.СуммаКонвертации 	= СтруктураДополнительногоЗначение.КонтрСумма;
			//	ИначеЕсли ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.ProCredit Тогда
			//		новыйДокумент.СуммаКонвертации = новыйДокумент.СуммаПолучено * (новыйДокумент.КурсОтправитель * новыйДокумент.КратностьПолучатель) * (новыйДокумент.КурсПолучатель * новыйДокумент.КратностьОтправитель);
			//	КонецЕсли;
			//Иначе 
			//	новыйДокумент.КурсПолучатель	= ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			//	новыйДокумент.СуммаКонвертации 	= новыйДокумент.СуммаПолучено * (новыйДокумент.КурсОтправитель * новыйДокумент.КратностьПолучатель) * (новыйДокумент.КурсПолучатель * новыйДокумент.КратностьОтправитель);
			//КонецЕсли;
			
		КонецЕсли;
		//ДокументОбъект=Документы.Конвертация.НайтиПоНомеру();
		Если ДокументОбъект.Проведен Тогда 
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Обновлен документ конвертации: ""'; ka = 'განახლებულია დოკუმენტი: ""'; en = 'განახლებულია დოკუმენტი: ""'") + ДокументОбъект.Ссылка + НСтр("ru = '"" ; Строка №'; ka = ' ; სტრიქონის:'; en = ' ; სტრიქონის:'") + Данные.НомерСтроки +  НСтр("ru = ', пожалуйста, перепроверте внесенную информацию'; ka = ', გთხოვთ, შეამოწმეთ შესყვანილი ინფორმცაიია'; en = ', გთხოვთ, შეამოწმეთ შესყვანილი ინფორმცაიია'"));	
			Исключение
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Обновлен документ конвертации: ""'; ka = 'განახლებულია დოკუმენტი: ""'; en = 'განახლებულია დოკუმენტი: ""'") + ДокументОбъект.Ссылка + НСтр("ru = '"" ; Строка №'; ka = ' ; სტრიქონის:'; en = ' ; სტრიქონის:'") + Данные.НомерСтроки +  НСтр("ru = ', пожалуйста, перепроверте внесенную информацию'; ka = ', გთხოვთ, შეამოწმეთ შესყვანილი ინფორმცაიია'; en = ', გთხოვთ, შეამოწმეთ შესყვანილი ინფორმცაიია'"));	
			КонецПопытки;
		Иначе
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Обновлен документ конвертации: ""'; ka = 'განახლებულია დოკუმენტი: ""'; en = 'განახლებულია დოკუმენტი: ""'") + ДокументОбъект.Ссылка + НСтр("ru = '"" ; Строка №'; ka = ' ; სტრიქონის:'; en = ' ; სტრიქონის:'") + Данные.НомерСтроки +  НСтр("ru = ', пожалуйста, перепроверте внесенную информацию'; ka = ', გთხოვთ, შეამოწმეთ შესყვანილი ინფორმცაიია'; en = ', გთხოვთ, შეამოწმეთ შესყვანილი ინფორმცაიია'"));	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Kuzmich, 01.12.2025, (ES4001-99) Помощик загрузки банковской выписки - TBC - конвертация
Функция РазборСтрокиНазначениеПлатежа(Данные)
	ПЕРЕМ РЕЗ, НазначениеПлатежа;
	
	РЕЗ = Новый Структура("ЕстьКурсБанка", ЛОЖЬ);
	
	НазначениеПлатежа = СОКРЛП(Данные.НазначениеПлатежа);
	
	Если НЕ ПустаяСтрока(НазначениеПлатежа) Тогда
	
		СтруктураКурсаБанка = Новый Структура("ПерваяВалюта,КурсПервойВалюты,ВтораяВалюта,КурсВторойВалюты",НЕОПРЕДЕЛЕНО,0,НЕОПРЕДЕЛЕНО,0);
		
		ПерваяВалюта = НЕОПРЕДЕЛЕНО;
		КурсПервойВалюты = НЕОПРЕДЕЛЕНО;
		ВтораяВалюта = НЕОПРЕДЕЛЕНО;
		КурсВторойВалюты = НЕОПРЕДЕЛЕНО;
		
		ПрошлыйСимвол = "";
		ТекущийСимвол = "";
		ТекущаяЛексема = "";
		Разделители = " "+Символы.НПП;
		СимволыЧисла = "0123456789";
		СимволыСкобки = "(){}";
		РазделителиЧисла = ",.";
		ЗнакРавно = "=";
		СоставлениеЧисла = ЛОЖЬ;
		ПоискПервогоКурса = ИСТИНА;
		ПоискВторогоКурса = ЛОЖЬ;
		
		НазначениеПлатежаДлина = СтрДлина(НазначениеПлатежа);
		и1=1;
		Пока и1<=НазначениеПлатежаДлина Цикл
			
			ТекущийСимвол = СРЕД(НазначениеПлатежа,и1,1);
			
			Если СтрНайти(Разделители,ТекущийСимвол)=0 Тогда // Собираем лексему
				
				Если СтрНайти(Разделители,ПрошлыйСимвол)>0 И СтрНайти(СимволыЧисла,ТекущийСимвол)>0 Тогда
					
					СоставлениеЧисла = ИСТИНА;
					
				КонецЕсли;
				
				Если СоставлениеЧисла И СтрНайти(СимволыЧисла,ТекущийСимвол)=0 И СтрНайти(РазделителиЧисла,ТекущийСимвол)=0 Тогда // Ожидаем число, но символ не из чисел и не из разделителей - это ошибка 
					
					СоставлениеЧисла = ЛОЖЬ;
					
				КонецЕсли;
				
				Если СоставлениеЧисла И (СтрНайти(РазделителиЧисла,ТекущийСимвол)>0 И СтрНайти(РазделителиЧисла,ПрошлыйСимвол)>0) Тогда // Два раделителя подряд - это ошибка
					
					СоставлениеЧисла = ЛОЖЬ;
					
				КонецЕсли;
				
				Если СтрНайти(СимволыСкобки,ТекущийСимвол)>0 Тогда // Скобки отбрасываем
					
					ПрошлыйСимвол = ТекущийСимвол;
					
					и1 = и1 + 1;
					
					Продолжить;
					
				КонецЕсли;
				
				ТекущаяЛексема = ТекущаяЛексема + ТекущийСимвол;
				
			Иначе // Собрали лексему, начинаем обрабатывать
				
				Если СтрДлина(ТекущаяЛексема)=0 Тогда // Два или более пробела подрад
					
					ПрошлыйСимвол = ТекущийСимвол;
					
					и1 = и1 + 1;
					
					Продолжить;
				
				КонецЕсли;
				
				Если СтрНайти(ЗнакРавно,ТекущаяЛексема)>0 И СтрДлина(ТекущаяЛексема)=1 Тогда // Это знак "=", начинаем искать второй курс
					
					ПоискПервогоКурса = ЛОЖЬ;
					ПоискВторогоКурса = ИСТИНА;
					
				ИначеЕсли СоставлениеЧисла Тогда
					
					ТекущаяЛексема = СтрЗаменить(ТекущаяЛексема,",",".");
					ЧислоТекущейЛексемы = Число(ТекущаяЛексема);
					
					Если ЧислоТекущейЛексемы>0 Тогда
						
						Если ПоискПервогоКурса Тогда
						
							КурсПервойВалюты = ЧислоТекущейЛексемы;
							
						ИначеЕсли ПоискВторогоКурса Тогда
						
							КурсВторойВалюты = ЧислоТекущейЛексемы;
						
						КонецЕсли;
					
					КонецЕсли;
				
				Иначе
					
					ТекущаяВалюта = Справочники.Валюты.НайтиПоНаименованию(ТекущаяЛексема);
					
					Если НЕ(ТекущаяВалюта = НЕОПРЕДЕЛЕНО) И НЕ(ТекущаяВалюта = Справочники.Валюты.ПустаяСсылка()) Тогда
						
						Если ПоискПервогоКурса Тогда
						
							ПерваяВалюта = ТекущаяВалюта;
							
						ИначеЕсли ПоискВторогоКурса Тогда
						
							ВтораяВалюта = ТекущаяВалюта;
						
						КонецЕсли;
						
					КонецЕсли;
				
				КонецЕсли;
				
				ТекущаяЛексема = "";
				
			КонецЕсли;
			
			ПрошлыйСимвол = ТекущийСимвол;
			
			и1 = и1 + 1;
			
		КонецЦикла;
		
		// Завершение обработки после последненго символа
		Если СтрДлина(ТекущаяЛексема)>0 Тогда // Два или более пробела подрад
			
			Если СтрНайти(ЗнакРавно,ТекущаяЛексема)>0 И СтрДлина(ТекущаяЛексема)=1 Тогда // Это знак "=", начинаем искать второй курс
				
				ПоискПервогоКурса = ЛОЖЬ;
				ПоискВторогоКурса = ИСТИНА;
				
			ИначеЕсли СоставлениеЧисла Тогда
				
				ТекущаяЛексема = СтрЗаменить(ТекущаяЛексема,",",".");
				ЧислоТекущейЛексемы = Число(ТекущаяЛексема);
				
				Если ЧислоТекущейЛексемы>0 Тогда
					
					Если ПоискПервогоКурса Тогда
						
						КурсПервойВалюты = ЧислоТекущейЛексемы;
						
					ИначеЕсли ПоискВторогоКурса Тогда
						
						КурсВторойВалюты = ЧислоТекущейЛексемы;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				ТекущаяВалюта = Справочники.Валюты.НайтиПоНаименованию(ТекущаяЛексема);
				
				Если НЕ(ТекущаяВалюта = НЕОПРЕДЕЛЕНО) И НЕ(ТекущаяВалюта = Справочники.Валюты.ПустаяСсылка()) Тогда
					
					Если ПоискПервогоКурса Тогда
						
						ПерваяВалюта = ТекущаяВалюта;
						
					ИначеЕсли ПоискВторогоКурса Тогда
						
						ВтораяВалюта = ТекущаяВалюта;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если 
			ТипЗНЧ(ПерваяВалюта)=Тип("СправочникСсылка.Валюты")
			И
			КурсПервойВалюты>0
			И
			ТипЗНЧ(ВтораяВалюта)=Тип("СправочникСсылка.Валюты")
			И
			КурсВторойВалюты>0
		Тогда
		
			РЕЗ.ЕстьКурсБанка = ИСТИНА;                                      
			
			СтруктураКурсаБанка.ПерваяВалюта = ПерваяВалюта;
			СтруктураКурсаБанка.КурсПервойВалюты = КурсПервойВалюты;
			СтруктураКурсаБанка.ВтораяВалюта = ВтораяВалюта;
			СтруктураКурсаБанка.КурсВторойВалюты = КурсВторойВалюты;
			РЕЗ.Вставить("СтруктураКурсаБанка",СтруктураКурсаБанка);
		
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат РЕЗ;
КонецФункции
// Kuzmich, 01.12.2025, (ES4001-99) Помощик загрузки банковской выписки - TBC - конвертация
