
&НаСервере
Процедура СоздатьДокументы()Экспорт
	
	СтруктураОтбора  = Новый Структура; 
	СтруктураОтбора.Вставить("_Загружать", Истина); 
	МассивДанных = ТаблицаВыписки.Выгрузить(СтруктураОтбора);
	Для Каждого стрДанные Из МассивДанных Цикл 
		Если ЗначениеЗаполнено(стрДанные._ШаблонЗаполнения) И Не ЗначениеЗаполнено(стрДанные._СсылкаНаДокумент) Тогда 
			СоздатьДокументПоДанным(стрДанные);
		ИначеЕсли НЕ ЗначениеЗаполнено(стрДанные._ШаблонЗаполнения)Тогда 
			Сообщить(Строка(стрДанные.НомерСтроки) + НСтр("ru = ' სტრიქონზე არ არის შვესებული შევსების წესი'; ka = ' სტრიქონზე არ არის შვესებული ""შევსების წესი""'"));
		ИначеЕсли ЗначениеЗаполнено(стрДанные._СсылкаНаДокумент)Тогда 
			Сообщить(Строка(стрДанные.НомерСтроки) + НСтр("ru = ' დოკუმენტი უკვე შექმნილია'; ka = ' დოკუმენტი უკვე შექმნილია'"));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументПоДанным(Данные)Экспорт
	текШаблонЗаполнения =  Данные._ШаблонЗаполнения;
	
	этоПеремещениеДС = текШаблонЗаполнения.СсылкаИсточника = "ПеремещениеДС";
	
	ЗаполнитьВидОперации = 	не этоПеремещениеДС;
	
	ЗаполнитьКонтрагент = текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя 
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам//Паганини
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Покупателю	
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Поставщику;
	
	ЗаполнитьПодотчетник=  текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику;

	ЗаполнитьВидНалога =  текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Налоги
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги;
	
	ЗаполнитьКорреспонденция =  текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Прочее
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Прочее;

	
	врСсылкаИсточника   =  текШаблонЗаполнения.СсылкаИсточника;
	
	ТекСумма = 0;
	Если Данные.СуммаКТ > 0 Тогда 	
		ТекСумма =  Данные.СуммаКТ;
	ИначеЕсли Данные.СуммаДТ > 0 Тогда
		ТекСумма =  Данные.СуммаДТ;
	КонецЕсли;
	
	новыйДокумент = Документы[врСсылкаИсточника].СоздатьДокумент();
	новыйДокумент.Дата = Данные.Дата;
	новыйДокумент.Организация = Организация;
	Если ЗаполнитьВидОперации Тогда 
		новыйДокумент.ВидОперации = текШаблонЗаполнения.ВидОперации;
	КонецЕсли;
	
	новыйДокумент.Статья = текШаблонЗаполнения.Статья;
	новыйДокумент.Автор  = Автор; 
	
	Если этоПеремещениеДС Тогда 
		
		новыйДокумент.ТипДенежныхСредств			= Перечисления.ТипыДенежныхСредств.Безналичные;
		новыйДокумент.ТипДенежныхСредствПолучатель  = Перечисления.ТипыДенежныхСредств.Безналичные;
		новыйДокумент.ВалютаДенежныхСредств			= БанковскийСчет.ВалютаДенежныхСредств;
		новыйДокумент.СуммаДокумента			    = ТекСумма;
		
		Если текШаблонЗаполнения.ТекСчетПолучатель Тогда 
			новыйДокумент.БанковскийСчетПолучатель = БанковскийСчет;
			новыйДокумент.БанковскийСчет =  Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", Данные.СчетБанк);
		Иначе 
			новыйДокумент.БанковскийСчет = БанковскийСчет;
			новыйДокумент.БанковскийСчетПолучатель =  Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", Данные.СчетБанк);
		КонецЕсли;
		
	Иначе 
		новыйДокумент.БанковскийСчет = БанковскийСчет;
		
		новыйДокумент.ВалютаДенежныхСредств = БанковскийСчет.ВалютаДенежныхСредств;
		Если ЗаполнитьКонтрагент Тогда
			новыйДокумент.Контрагент = Данные.Контрагент1С;
			новыйДокумент.СчетКонтрагента = Данные.СчетКонтрагента1С; 
			Если ЗначениеЗаполнено(Данные.Контрагент1С) Тогда
				новыйДокумент.НалогообложениеНДС = Данные.Контрагент1С.НалогообложениеНДС;
			Иначе
				новыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
			КонецЕсли;//Паганини
		КонецЕсли;
		Если ЗаполнитьПодотчетник Тогда
			новыйДокумент.Подотчетник = Данные.Подотчетник1С;
		КонецЕсли;
		новыйДокумент.СуммаДокумента  = ТекСумма;
		
		ПересчитатьСуммыДокумента(новыйДокумент,Неопределено,1, 1);
		
		
		Если ЗаполнитьВидНалога Тогда
			новыйДокумент.ВидНалога = текШаблонЗаполнения.ВидНалога;
		КонецЕсли;
		
		Если ЗаполнитьКорреспонденция Тогда
			новыйДокумент.Корреспонденция = текШаблонЗаполнения.Корреспонденция;
			новыйДокумент.КорреспонденцияРегл = текШаблонЗаполнения.КорреспонденцияРегл;
		КонецЕсли;
		
		нстрРасшифровкаПлатежа = новыйДокумент.РасшифровкаПлатежа.Добавить();
		Если ЗаполнитьКонтрагент И текШаблонЗаполнения.ЗаполнитьДоговор Тогда
			нстрРасшифровкаПлатежа.Договор = НайтиДоговорКонтрагентаПоВалюте(новыйДокумент.Контрагент,БанковскийСчет.ВалютаДенежныхСредств);
		КонецЕсли;
		
		нстрРасшифровкаПлатежа.ПризнакАванса = текШаблонЗаполнения.ПризнакАванса; 
		нстрРасшифровкаПлатежа.СуммаПлатежа = новыйДокумент.СуммаДокумента;
		ПересчитатьСуммыДокумента(новыйДокумент,нстрРасшифровкаПлатежа,1, 1);
		
		//Паганини_
		Если ЗаполнитьКонтрагент Тогда
			Если новыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда
				нстрРасшифровкаПлатежа.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
			ИначеЕсли новыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
				нстрРасшифровкаПлатежа.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
			Иначе
				нстрРасшифровкаПлатежа.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
			КонецЕсли;
			нстрРасшифровкаПлатежа.СуммаНДС = нстрРасшифровкаПлатежа.СуммаПлатежа - (нстрРасшифровкаПлатежа.СуммаПлатежа) / ((нстрРасшифровкаПлатежа.СтавкаНДС.Ставка + 100) / 100);
		КонецЕсли;
		//_Паганини
		
	КонецЕсли; 
	
	новыйДокумент.НазначениеПлатежа = Данные.НазначениеПлатежа;
	новыйДокумент.Комментарий		= Данные.Комментарий;
	
	новыйДокумент.ID = Данные.ID;
	
	Попытка
		новыйДокумент.записать(РежимЗаписиДокумента.Запись);
		ТаблицаВыписки[Данные.НомерСтроки-1]._СсылкаНаДокумент = новыйДокумент.Ссылка;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Процедура ПересчитатьСуммыДокумента(ДокументБанк,СтрокаТабличнойЧасти,Курс, Кратность)
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить("ВалютаКурсКратность",РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокументБанк.Дата,	Новый Структура("Валюта", БанковскийСчет.ВалютаДенежныхСредств)));
	СтруктураДанные.Вставить("ВалютаДенежныхСредств",БанковскийСчет.ВалютаДенежныхСредств);
	
	естьПоступлениеНаСчет = ТипЗнч(ДокументБанк) = Тип("ДокументОбъект.ПоступлениеНаСчет");
	Если ЗначениеЗаполнено(ДокументБанк.ВалютаДенежныхСредств) И естьПоступлениеНаСчет Тогда
		Курс = ?(
		СтруктураДанные.ВалютаКурсКратность.Курс = 0,
		1,
		СтруктураДанные.ВалютаКурсКратность.Курс
		);
		Кратность = ?(
		СтруктураДанные.ВалютаКурсКратность.Кратность = 0,
		1,
		СтруктураДанные.ВалютаКурсКратность.Кратность
		);
		//Если ДокументБанк.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПокупкаВалюты") Тогда
		//	ДокументБанк.Курс = Курс;
		//	ДокументБанк.Кратность = Кратность;
		//КонецЕсли;
		
		ДокументБанк.Курс = ?(
		ДокументБанк.Курс = 0,
		1,
		ДокументБанк.Курс
		);
		ДокументБанк.Кратность = ?(
		ДокументБанк.Кратность = 0,
		1,
		ДокументБанк.Кратность
		);
		
		ДокументБанк.СуммаУчета = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
		ДокументБанк.СуммаДокумента,
		ДокументБанк.Курс,
		Курс,
		ДокументБанк.Кратность,
		Кратность
		);

	КонецЕсли;
	
	Если Не СтрокаТабличнойЧасти = Неопределено Тогда  
		СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
		);
		СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
		);
		СтрокаТабличнойЧасти.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаПлатежа,
		Курс,
		СтрокаТабличнойЧасти.Курс,
		Кратность,
		СтрокаТабличнойЧасти.Кратность
		);
	КонецЕсли;
	
КонецПроцедуры // ПересчитатьСуммыДокумента()

Функция ПолучитьДатуИзСтроки(ДатаСтрока);
	ДатаСтрока = Лев(ДатаСтрока,10);
	
	Год   = прав(ДатаСтрока,4);
	Месяц  = Сред(ДатаСтрока,4,2);
	День = Лев(ДатаСтрока,2);
	
	Возврат Дата(Год,Месяц,День);
	
КонецФункции

Функция НайтиДоговорКонтрагентаПоВалюте(Контрагент,ВалютаДенежныхСредств)
	
	знчВозврата = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.ВалютаРасчетов = &ВалютаРасчетов
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВалютаРасчетов", ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		знчВозврата = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат знчВозврата;
	
КонецФункции