
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИнтеграцияСБанком_ВыгрузкаЗавершина" Тогда
		
		Если Параметр.Свойство("ВыгруженныеСсылки") Тогда
			ОтобразитьИзменениеДанных(Параметр.ВыгруженныеСсылки[0],ВидИзмененияДанных.Изменение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Паганини_
	ФункционалЗапретаРедактированияДокументов = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалЗапретаРедактированияДокументов");
	//_Паганини
КонецПроцедуры
