
//Проверяет уникальность реквизита
Функция РеквизитУникален(Ссылка, РеквизитИмя, РеквизитЗначение, ИмяСправочника) Экспорт
	
	Если Не ЗначениеЗаполнено(РеквизитЗначение) Тогда
		Возврат Истина; 
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
					|	Мета.Ссылка
					|ИЗ
					|	Справочник." + ИмяСправочника + " КАК Мета
		            |ГДЕ
		            |	НЕ Мета.Ссылка = &Ссылка
					|	И НЕ Мета.ПометкаУдаления
		            |	И Мета." + РеквизитИмя + " = &РеквизитЗначение";
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("РеквизитЗначение",	РеквизитЗначение);
	
	Возврат Запрос.Выполнить().Пустой();
					
КонецФункции

  //Проверяет уникальность реквизитов в документе- приходная накладная
  //_Лазаре
Функция РеквизитНомерТТНДокументаУникален(Ссылка,ИмяРеквизитаНомерТТН,ЗначениеРеквизитаНомерТТН,ИмяДокумента) Экспорт
		  
	Если Не ЗначениеЗаполнено(ЗначениеРеквизитаНомерТТН)
		Тогда
		Возврат Истина; 
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
					|	Мета.Ссылка
					|ИЗ
					|	Документ." + ИмяДокумента + " КАК Мета
		            |ГДЕ
		            |	НЕ Мета.Ссылка = &Ссылка
					|	И НЕ Мета.ПометкаУдаления
		            |	И Мета." + ИмяРеквизитаНомерТТН + " = &ЗначениеРеквизитаНомерТТН";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ЗначениеРеквизитаНомерТТН",ЗначениеРеквизитаНомерТТН);

	Возврат Запрос.Выполнить().Пустой();
					
КонецФункции	

Функция РеквизитIDTТНДокументаУникален(Ссылка,ИмяРеквизитаIDTТН,ЗначениеРеквизитаIDTТН,ИмяДокумента) Экспорт
		  
	Если  Не ЗначениеЗаполнено(ЗначениеРеквизитаIDTТН)  Тогда
		Возврат Истина; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
					|	Мета.Ссылка
					|ИЗ
					|	Документ." + ИмяДокумента + " КАК Мета
		            |ГДЕ
		            |	НЕ Мета.Ссылка = &Ссылка
					|	И НЕ Мета.ПометкаУдаления				
					|	И Мета." + ИмяРеквизитаIDTТН + "    = &ЗначениеРеквизитаIDTТН";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ЗначениеРеквизитаIDTТН",ЗначениеРеквизитаIDTТН);
	
	Возврат Запрос.Выполнить().Пустой();
					
КонецФункции

Функция получитьДопСвойство(ТекОбъект, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено)  Экспорт
	
	Перем ЗначениеСвойства;
	
	Если Не ТекОбъект.ДополнительныеСвойства.Свойство(ИмяСвойства, ЗначениеСвойства) Тогда
		ЗначениеСвойства = ЗначениеПоУмолчанию; 			
	КонецЕсли;
	
	Возврат ЗначениеСвойства;	
		
КонецФункции

Процедура ИзменитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено, ОтборПоПериоду = Ложь) Экспорт
	
	УдалитьЭлементОтбораСписка(Список, ИмяПоля);
	
	Если Установить Тогда
		Если ОтборПоПериоду Тогда
			УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение.ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
			УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение.ДатаОкончания, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);		
		Иначе
		    УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения);	
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры // ИзменитьЭлементОтбораСписка()
Процедура УдалитьЭлементОтбораСписка(Список, ИмяПоля) Экспорт
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Счетчик = 1;
	Пока Счетчик <= Список.Отбор.Элементы.Количество() Цикл
		ЭлементОтбора = Список.Отбор.Элементы[Счетчик - 1];
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			Список.Отбор.Элементы.Удалить(ЭлементОтбора);
		Иначе
			Счетчик = Счетчик + 1;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()
Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено) Экспорт
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения     = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	ЭлементОтбора.Использование    = Истина;
	ЭлементОтбора.ПравоеЗначение   = ПравоеЗначение;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита) Экспорт
	Возврат Ссылка[ИмяРеквизита];
КонецФункции

Функция ПолучитьЗначенияРеквизитов(Ссылка, Реквизиты) Экспорт

	МассивИменРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Реквизиты, ",");
	
	СтруктураРеквизитов = Новый Структура;
	Для Каждого ИмяРеквизита Из МассивИменРеквизитов Цикл
		СтруктураРеквизитов.Вставить(ИмяРеквизита, Ссылка[ИмяРеквизита]);
	КонецЦикла;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

Функция ПолучитьСкладПоАдресу(Адрес) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка КАК Склад
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы.КонтактнаяИнформация КАК СтруктурныеЕдиницыКонтактнаяИнформация
		|ГДЕ
		|	СтруктурныеЕдиницыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы)
		|	И СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|	И СтруктурныеЕдиницыКонтактнаяИнформация.Представление = &Адрес";
	Запрос.УстановитьПараметр("Адрес", Адрес);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Склад;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПредставлениеНоменклатуры(Номенклатура, Характеристика, Серия) Экспорт

	СтрПредставление = СокрЛП(Номенклатура.Наименование);

	Если ЗначениеЗаполнено(Характеристика)Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(Характеристика.Наименование);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Серия) Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(Серия.Наименование);
	КонецЕсли;

	Возврат СтрПредставление;

КонецФункции

Процедура ЗаполнитьЦену(СтрокаТЧ, ВидЦены) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ВидЦены) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Цена     = 0;
		СтрокаТЧ.Сумма    = 0;
		СтрокаТЧ.СуммаНДС = 0;
		Возврат;
	КонецЕсли;
	
	Цены = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(, Новый Структура("ВидЦен, Номенклатура, Характеристика", ВидЦены, СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика));
	Если Не Цены.Количество() = 0 Тогда
		СтрокаТЧ.СтавкаНДС	= СтрокаТЧ.Номенклатура.СтавкаНДС;
		СтавкаНДС = СтрокаТЧ.СтавкаНДС.Ставка;
		СтрокаТЧ.Цена     	= Цены[0].Цена;
		СтрокаТЧ.Сумма    	= СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		СтрокаТЧ.СуммаНДС 	= Окр(СтрокаТЧ.Сумма  * СтавкаНДС/(100 + СтавкаНДС), 2);
	Иначе
		СтрокаТЧ.Цена     = 0;
		СтрокаТЧ.Сумма    = 0;
		СтрокаТЧ.СуммаНДС = 0;
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьФИОФизЛиц(ФизЛицо, Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Фамилия КАК ИмяФамилия
		|ИЗ
		|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИмяФамилия;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗначенииСтавок(СтавкаНДС	 = 0, ВидУдержанияНДФЛ	    = 0, ВидУдержанияПФ		= 0,
							   ПредСтавкаНДС = 0, ПредВидУдержанияНДФЛ	= 0, ПредВидУдержанияПФ	= 0) Экспорт

	СтруктураСтавок = Новый Структура;
	Если НЕ СтавкаНДС = 0 Тогда
		СтруктураСтавок.Вставить("СтавкаНДС",		СтавкаНДС.Ставка);
	КонецЕсли;
	Если НЕ ПредСтавкаНДС = 0 Тогда
		СтруктураСтавок.Вставить("ПредСтавкаНДС",	ПредСтавкаНДС.Ставка);
	//+++ Дмгг
	Иначе
		СтруктураСтавок.Вставить("ПредСтавкаНДС",	0);
	КонецЕсли;
	
	Если НЕ ВидУдержанияНДФЛ = 0 Тогда
		СтруктураСтавок.Вставить("СтавкаНДФЛ",		ВидУдержанияНДФЛ.СтавкаНДФЛ);
	КонецЕсли;
	Если НЕ ПредВидУдержанияНДФЛ = 0 Тогда
		СтруктураСтавок.Вставить("ПредСтавкаНДФЛ",	ПредВидУдержанияНДФЛ.СтавкаНДФЛ);
		//+++ Дмгг
	Иначе
		СтруктураСтавок.Вставить("ПредСтавкаНДФЛ",	0);
	КонецЕсли;
	
	Если НЕ ВидУдержанияПФ = 0 Тогда
		СтруктураСтавок.Вставить("СтавкаПФ",		ВидУдержанияПФ.СтавкаПФ);
	КонецЕсли;
	Если НЕ ПредВидУдержанияПФ = 0 Тогда
		СтруктураСтавок.Вставить("ПредСтавкаПФ",	ПредВидУдержанияПФ.СтавкаПФ);
		//+++ Дмгг
	Иначе
		СтруктураСтавок.Вставить("ПредСтавкаПФ",	0);
	КонецЕсли;

	Возврат СтруктураСтавок;
	
КонецФункции

//Процедура ПересчитатьСуммыСтрокиРасхода_ПриходнаяНакладная(ИмяПоля, ТекДанные, СуммаВключаетНДС = Ложь) Экспорт
// Kuzmich, 13.10.2023, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
Процедура ПересчитатьСуммыСтрокиРасхода_ПриходнаяНакладная(ИмяПоля, ТекДанные, СуммаВключаетНДС = Ложь
	,КонтрагентЯвляетсяНеРезидентом=ЛОЖЬ) Экспорт
// Kuzmich, 13.10.2023, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)

	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ставки			= ПолучитьЗначенииСтавок(ТекДанные.СтавкаНДС,ТекДанные.ВидУдержанияНДФЛ, ТекДанные.ВидУдержанияПФ);
	ПересчитатьЦену = Истина;
	
	Если ИмяПоля = "СуммаБезНалогов" ИЛИ ИмяПоля = "ВидУдержанияНДФЛ" ИЛИ ИмяПоля = "СтавкаНДС" ИЛИ ИмяПоля = "ВидУдержанияНДФЛ" ИЛИ ИмяПоля = "ВидУдержанияПФ" Тогда
		//СуммаБезНалогов = ТекДанные.СуммаБезНалогов;
		//СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		//СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		//СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		//Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		//Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
		
		Сумма			= Окр(ТекДанные.Цена * ТекДанные.Количество * (100 - ТекДанные.ПроцентСкидкиНаценки)/100, 2);
		Если СуммаВключаетНДС Тогда
			//СуммаБезНалогов =Сумма;// / (1 + (Ставки.СтавкаНДС/100));//Окр(Сумма /(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2);
			//+++ Дмгг
			//СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);    =(B10)/((100-B2)/100)*B2%
			//СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2); ((B10+D10)/((100-C2)/100))*C2%
			//СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);   
			//СуммаДляРасчета = Окр(Сумма * (1 + (Ставки.СтавкаНДС / 100)) / ((100 - Ставки.СтавкаНДФЛ) / 100) / ((100 - Ставки.СтавкаПФ) / 100), 2);
			СуммаНДФЛ		= Окр(Сумма/((100-Ставки.СтавкаНДФЛ)/100)*(Ставки.СтавкаНДФЛ/100), 2);//Окр((СуммаДляРасчета - СуммаПФ) * (Ставки.СтавкаНДФЛ / 100), 2);
			СуммаПФ			= Окр(((Сумма+СуммаНДФЛ)/((100-Ставки.СтавкаПФ)/100))*(Ставки.СтавкаПФ/100), 2);//Окр(СуммаДляРасчета * (Ставки.СтавкаПФ / 100), 2);
			//СуммаНДС		= Окр(Сумма - Сумма/(1+(Ставки.СтавкаНДС/100)), 2);//Окр(Сумма * (Ставки.СтавкаНДС / 100), 2);//Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
			
			// Kuzmich, 13.10.2023, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
			СуммаДляНДС = Сумма;
			Если КонтрагентЯвляетсяНеРезидентом Тогда
				СуммаДляНДС = (СуммаДляНДС + СуммаНДФЛ)*(1+(Ставки.СтавкаНДС/100));// Kuzmich, 03.02.2024, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
			КонецЕсли;
			СуммаНДС		= Окр(СуммаДляНДС - СуммаДляНДС/(1+(Ставки.СтавкаНДС/100)), 2);
			// Kuzmich, 13.10.2023, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
			
			СуммаБезНалогов = Сумма - СуммаНДС;
			//--- Дмгг
			//Прибавить копейку
			//Погрешность = Сумма - (СуммаБезНалогов + СуммаНДС);
			//СуммаНДС		= СуммаНДС + Погрешность;
			//Прибавить копейку
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаПФ;
		Иначе
			СуммаБезНалогов = Сумма;
			//СуммаНДС		= Окр(Сумма - Сумма*((100-Ставки.СтавкаНДС)/100), 2);//Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);   B8-((100-E2)/100)*B8
			//СуммаНДФЛ		= Окр((Сумма + СуммаНДС)/((100-Ставки.СтавкаНДФЛ)/100)*(Ставки.СтавкаНДФЛ/100), 2);//Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);       (B8+C8)/((100-B2)/100)*B2%
			//СуммаПФ			= Окр(((Сумма + СуммаНДС + СуммаНДФЛ)/((100-Ставки.СтавкаПФ)/100)) * (Ставки.СтавкаПФ / 100), 2);//Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);   ((B8+C8+D8)/((100-C2)/100))*C2%
			
			// Kuzmich, 03.02.2024, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
			Если КонтрагентЯвляетсяНеРезидентом Тогда
				
				СуммаНДФЛ	= Окр(Сумма/((100-Ставки.СтавкаНДФЛ)/100)*(Ставки.СтавкаНДФЛ/100), 2);
				СуммаДляНДС = (СуммаБезНалогов + СуммаНДФЛ)*(1+(Ставки.СтавкаНДС/100));
				
				СуммаНДС	= СуммаДляНДС - (СуммаБезНалогов + СуммаНДФЛ);
				
				СуммаПФ		= 0;
				
			Иначе
				
				СуммаНДС	= Окр(Сумма - Сумма*((100-Ставки.СтавкаНДС)/100), 2);//Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);   B8-((100-E2)/100)*B8
				СуммаНДФЛ	= Окр((Сумма + СуммаНДС)/((100-Ставки.СтавкаНДФЛ)/100)*(Ставки.СтавкаНДФЛ/100), 2);//Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);       (B8+C8)/((100-B2)/100)*B2%
				СуммаПФ		= Окр(((Сумма + СуммаНДС + СуммаНДФЛ)/((100-Ставки.СтавкаПФ)/100)) * (Ставки.СтавкаПФ / 100), 2);//Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);   ((B8+C8+D8)/((100-C2)/100))*C2%
			
			КонецЕсли;
			// Kuzmich, 03.02.2024, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
			
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		КонецЕсли;
		ПересчитатьЦену = Ложь;
		
	ИначеЕсли ИмяПоля = "Всего" Тогда
		Всего			= ТекДанные.Всего;
		СуммаНДС		= Окр(Всего * Ставки.СтавкаНДС/(100 + Ставки.СтавкаНДС), 2);		
		СуммаПФ			= Окр((Всего - СуммаНДС) * Ставки.СтавкаПФ/100, 2);
		СуммаНДФЛ		= Окр((Всего - СуммаПФ - СуммаНДС) * Ставки.СтавкаНДФЛ/100, 2);
		СуммаБезНалогов = Всего - СуммаПФ - СуммаНДС - СуммаНДФЛ;
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
	// Kuzmich, 29.09.2023, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
	//ИначеЕсли ИмяПоля = "Сумма" Тогда
	//	СуммаБезНалогов = ?(СуммаВключаетНДС, 
	//					  Окр(ТекДанные.Сумма/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2),
	//					  ТекДанные.Сумма);
	//	СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
	//	СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	//	СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
	//	Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
	//	Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
	//	
	//	//+++ Дмгг проверка на сьеденный тетри при округлении
	//	Если (СуммаБезНалогов + СуммаНДС) <> ТекДанные.Сумма Тогда 
	//		РазницаСумм = ТекДанные.Сумма - (СуммаБезНалогов + СуммаНДС);
	//		СуммаНДС 	= СуммаНДС + РазницаСумм;
	//		Сумма		= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
	//		Всего		= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
	//	КонецЕсли;
	//	//--- Дмгг
	//ИначеЕсли ИмяПоля = "СкидкаПроцент" ИЛИ ИмяПоля = "ПроцентСкидкиНаценки" ИЛИ ИмяПоля = "Цена" ИЛИ ИмяПоля = "СкидкаСумма" ИЛИ ИмяПоля = "Количество" Тогда
	//	Сумма			= Окр(ТекДанные.Цена * ТекДанные.Количество * (100 - ТекДанные.ПроцентСкидкиНаценки)/100, 2);
	
	ИначеЕсли ИмяПоля = "СкидкаПроцент" ИЛИ ИмяПоля = "ПроцентСкидкиНаценки" ИЛИ ИмяПоля = "Цена" ИЛИ ИмяПоля = "СкидкаСумма" ИЛИ ИмяПоля = "Количество" 
		ИЛИ ИмяПоля = "Сумма" Тогда
		
		Если ИмяПоля = "Сумма" Тогда
			Сумма			= ТекДанные.Сумма;
		Иначе
			Сумма			= Окр(ТекДанные.Цена * ТекДанные.Количество * (100 - ТекДанные.ПроцентСкидкиНаценки)/100, 2);
		КонецЕсли;
	// Kuzmich, 29.09.2023, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)		
		Если СуммаВключаетНДС Тогда
			//СуммаБезНалогов =Сумма;// / (1 + (Ставки.СтавкаНДС/100));//Окр(Сумма /(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2);
			//+++ Дмгг
			//СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);    =(B10)/((100-B2)/100)*B2%
			//СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2); ((B10+D10)/((100-C2)/100))*C2%
			//СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);   
			//СуммаДляРасчета = Окр(Сумма * (1 + (Ставки.СтавкаНДС / 100)) / ((100 - Ставки.СтавкаНДФЛ) / 100) / ((100 - Ставки.СтавкаПФ) / 100), 2);
			СуммаНДФЛ		= Окр(Сумма/((100-Ставки.СтавкаНДФЛ)/100)*(Ставки.СтавкаНДФЛ/100), 2);//Окр((СуммаДляРасчета - СуммаПФ) * (Ставки.СтавкаНДФЛ / 100), 2);
			СуммаПФ			= Окр(((Сумма+СуммаНДФЛ)/((100-Ставки.СтавкаПФ)/100))*(Ставки.СтавкаПФ/100), 2);//Окр(СуммаДляРасчета * (Ставки.СтавкаПФ / 100), 2);
			//СуммаНДС		= Окр(Сумма - Сумма/(1+(Ставки.СтавкаНДС/100)), 2);//Окр(Сумма * (Ставки.СтавкаНДС / 100), 2);//Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
			
			// Kuzmich, 13.10.2023, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
			СуммаДляНДС = Сумма;
			Если КонтрагентЯвляетсяНеРезидентом Тогда
				СуммаДляНДС = (СуммаДляНДС + СуммаНДФЛ)*(1+(Ставки.СтавкаНДС/100));// Kuzmich, 03.02.2024, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
			КонецЕсли;
			СуммаНДС		= Окр(СуммаДляНДС - СуммаДляНДС/(1+(Ставки.СтавкаНДС/100)), 2);
			// Kuzmich, 13.10.2023, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
			
			СуммаБезНалогов = Сумма - СуммаНДС;
			//--- Дмгг
			//Прибавить копейку
			//Погрешность = Сумма - (СуммаБезНалогов + СуммаНДС);
			//СуммаНДС		= СуммаНДС + Погрешность;
			//Прибавить копейку
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаПФ + СуммаНДС;
		Иначе
			СуммаБезНалогов = Сумма;
			//СуммаНДС		= Окр(Сумма - Сумма*((100-Ставки.СтавкаНДС)/100), 2);//Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);   B8-((100-E2)/100)*B8
			//СуммаНДФЛ		= Окр((Сумма + СуммаНДС)/((100-Ставки.СтавкаНДФЛ)/100)*(Ставки.СтавкаНДФЛ/100), 2);//Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);       (B8+C8)/((100-B2)/100)*B2%
			//СуммаПФ			= Окр(((Сумма + СуммаНДС + СуммаНДФЛ)/((100-Ставки.СтавкаПФ)/100)) * (Ставки.СтавкаПФ / 100), 2);//Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);   ((B8+C8+D8)/((100-C2)/100))*C2%
			
			// Kuzmich, 03.02.2024, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
			Если КонтрагентЯвляетсяНеРезидентом Тогда
				
				СуммаНДФЛ	= Окр(Сумма/((100-Ставки.СтавкаНДФЛ)/100)*(Ставки.СтавкаНДФЛ/100), 2);
				СуммаДляНДС = (СуммаБезНалогов + СуммаНДФЛ)*(1+(Ставки.СтавкаНДС/100));
				
				СуммаНДС	= СуммаДляНДС - (СуммаБезНалогов + СуммаНДФЛ);
				
				СуммаПФ		= 0;
				
			Иначе
				
				СуммаНДС	= Окр(Сумма - Сумма*((100-Ставки.СтавкаНДС)/100), 2);
				СуммаНДФЛ	= Окр((Сумма + СуммаНДС)/((100-Ставки.СтавкаНДФЛ)/100)*(Ставки.СтавкаНДФЛ/100), 2);
				СуммаПФ		= Окр(((Сумма + СуммаНДС + СуммаНДФЛ)/((100-Ставки.СтавкаПФ)/100)) * (Ставки.СтавкаПФ / 100), 2);//Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);   ((B8+C8+D8)/((100-C2)/100))*C2%
			
			КонецЕсли;
			// Kuzmich, 03.02.2024, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
			
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		КонецЕсли;
		//ПересчитатьЦену = Ложь;
		// Kuzmich, 29.09.2023, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)	
		Если ИмяПоля = "Сумма" Тогда
			
			////+++ Дмгг проверка на сьеденный тетри при округлении
			//Если (СуммаБезНалогов + СуммаНДС) <> Сумма Тогда 			
			//	РазницаСумм = Сумма - (СуммаБезНалогов + СуммаНДС);
			//	СуммаНДС 	= СуммаНДС + РазницаСумм;
			//	Сумма		= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
			//	Всего		= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
			//КонецЕсли;
			////--- Дмгг
			
			// Kuzmich, 03.02.2024, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
			//+++ Дмгг проверка на сьеденный тетри при округлении
			СуммаДляПроверки = ?(СуммаВключаетНДС, Сумма, Сумма + СуммаНДС);
			Если (СуммаБезНалогов + СуммаНДС) <> СуммаДляПроверки Тогда 			
				РазницаСумм = СуммаДляПроверки - (СуммаБезНалогов + СуммаНДС);
				СуммаНДС 	= СуммаНДС + РазницаСумм;
				Сумма		= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
				Всего		= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
			КонецЕсли;
			//--- Дмгг
			// Kuzmich, 03.02.2024, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
			
			ПересчитатьЦену = ИСТИНА;
			
		Иначе
			
			ПересчитатьЦену = ЛОЖЬ;
			
		КонецЕсли;
		// Kuzmich, 29.09.2023, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)	
	Иначе
		СуммаБезНалогов = ?(СуммаВключаетНДС, 
						  Окр(ТекДанные.Сумма/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2),
						  ТекДанные.Сумма);
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов;
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
	КонецЕсли;
	
	ТекДанные.Сумма				= Сумма;
	ТекДанные.СуммаБезНалогов	= СуммаБезНалогов;
	ТекДанные.СуммаНДФЛ			= СуммаНДФЛ;
	ТекДанные.СуммаНДС			= СуммаНДС;
	ТекДанные.СуммаПФ			= СуммаПФ;
	ТекДанные.Всего				= Всего;
	Если ПересчитатьЦену Тогда
		Если ТекДанные.ПроцентСкидкиНаценки = 0 Тогда
			ТекДанные.Цена 	= ?(ТекДанные.Количество = 0, 0, Окр(ТекДанные.Сумма/ТекДанные.Количество, 2));
		ИначеЕсли НЕ ТекДанные.ПроцентСкидкиНаценки = 0 И НЕ ТекДанные.Количество = 0 Тогда
			ТекДанные.Цена	= ТекДанные.Сумма / ((1 - ТекДанные.ПроцентСкидкиНаценки / 100) * ТекДанные.Количество);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьСуммыСтрокиРасхода_ДополнительныеРасходы(ИмяПоля, ТекДанные, СуммаВключаетНДС = Ложь) Экспорт

	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ставки			= ПолучитьЗначенииСтавок(ТекДанные.СтавкаНДС,ТекДанные.ВидУдержанияНДФЛ, ТекДанные.ВидУдержанияПФ);
	ПересчитатьЦену = Истина;
	
	Если ИмяПоля = "СуммаБезНалогов" ИЛИ ИмяПоля = "ВидУдержанияНДФЛ" ИЛИ ИмяПоля = "СтавкаНДС" ИЛИ ИмяПоля = "ВидУдержанияНДФЛ" ИЛИ ИмяПоля = "ВидУдержанияПФ" Тогда
		СуммаБезНалогов = ТекДанные.СуммаБезНалогов;
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
	ИначеЕсли ИмяПоля = "Всего" Тогда
		Всего			= ТекДанные.Всего;
		СуммаНДС		= Окр(Всего * Ставки.СтавкаНДС/(100 + Ставки.СтавкаНДС), 2);		
		СуммаПФ			= Окр((Всего - СуммаНДС) * Ставки.СтавкаПФ/100, 2);
		СуммаНДФЛ		= Окр((Всего - СуммаПФ - СуммаНДС) * Ставки.СтавкаНДФЛ/100, 2);
		СуммаБезНалогов = Всего - СуммаПФ - СуммаНДС - СуммаНДФЛ;
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
	ИначеЕсли ИмяПоля = "Сумма" Тогда
		СуммаБезНалогов = ?(СуммаВключаетНДС, 
						  Окр(ТекДанные.Сумма/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2),
						  ТекДанные.Сумма);
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
	ИначеЕсли ИмяПоля = "Цена" ИЛИ ИмяПоля = "Количество" Тогда
		Сумма			= Окр(ТекДанные.Цена * ТекДанные.Количество, 2);
		Если СуммаВключаетНДС Тогда
			СуммаБезНалогов = Окр(Сумма /(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2);
			СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
			СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
			СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
			//Прибавить копейку
			Погрешность = Сумма - (СуммаБезНалогов + СуммаНДС);
			СуммаНДС		= СуммаНДС + Погрешность;
			//Прибавить копейку
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		Иначе
			СуммаБезНалогов = Сумма;
			СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
			СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
			СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		КонецЕсли;
		ПересчитатьЦену = Ложь;
	Иначе
		СуммаБезНалогов = ?(СуммаВключаетНДС, 
						  Окр(ТекДанные.Сумма/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2),
						  ТекДанные.Сумма);
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов;
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
	КонецЕсли;
	
	ТекДанные.Сумма				= Сумма;
	ТекДанные.СуммаБезНалогов	= СуммаБезНалогов;
	ТекДанные.СуммаНДФЛ			= СуммаНДФЛ;
	ТекДанные.СуммаНДС			= СуммаНДС;
	ТекДанные.СуммаПФ			= СуммаПФ;
	ТекДанные.Всего				= Всего;
	Если ПересчитатьЦену Тогда
		ТекДанные.Цена 	= ?(ТекДанные.Количество = 0, 0, Окр(ТекДанные.Сумма/ТекДанные.Количество, 2));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьСуммыСтроки_РасходИзКассы_РасходСоСчета(ИмяПоля, ТекДанные, ИспользоватьНулевуеПредЗначения = ЛОЖЬ) Экспорт
//Процедура ПересчитатьСуммыСтроки_РасходИзКассы_РасходСоСчета(ИмяПоля, ТекДанные) Экспорт


	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//+++ Дмгг
	Если ИспользоватьНулевуеПредЗначения Тогда 
		
		Ставки			= ПолучитьЗначенииСтавок(ТекДанные.СтавкаНДС,ТекДанные.ВидУдержанияНДФЛ, ТекДанные.ВидУдержанияПФ, 0, 0, 0);
		
	Иначе
		
		Ставки			= ПолучитьЗначенииСтавок(ТекДанные.СтавкаНДС,ТекДанные.ВидУдержанияНДФЛ, ТекДанные.ВидУдержанияПФ, ТекДанные.ПредСтавкаНДС, ТекДанные.ПредВидУдержанияНДФЛ, ТекДанные.ПредВидУдержанияПФ);
		
	КонецЕсли;
	//--- Дмгг
	
	ПересчитатьЦену = Истина;
	
	Изменилась_СтавкаНДС 	= НЕ (Ставки.СтавкаНДС  = Ставки.ПредСтавкаНДС);
	Изменилась_СтавкаНДФЛ	= НЕ (Ставки.СтавкаНДФЛ = Ставки.ПредСтавкаНДФЛ);
	Изменилась_СтавкаПФ		= НЕ (Ставки.СтавкаПФ   = Ставки.ПредСтавкаПФ);
	
	Если Изменилась_СтавкаНДС ИЛИ Изменилась_СтавкаНДФЛ ИЛИ Изменилась_СтавкаПФ Тогда
		СуммаБезНалогов = Окр(ТекДанные.СуммаПлатежа/(1 + (100 * Ставки.ПредСтавкаНДС)/((100 - Ставки.ПредСтавкаНДФЛ)*(100 - Ставки.ПредСтавкаПФ))), 2);
	Иначе
		СуммаБезНалогов = Окр(ТекДанные.СуммаПлатежа/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2);
	КонецЕсли;
	
	Если НЕ ИспользоватьНулевуеПредЗначения Тогда//+++ Дмгг 
		ТекДанные.ПредСтавкаНДС 		= ТекДанные.СтавкаНДС;
		ТекДанные.ПредВидУдержанияПФ	= ТекДанные.ВидУдержанияПФ;
		ТекДанные.ПредВидУдержанияНДФЛ	= ТекДанные.ВидУдержанияНДФЛ;
	КонецЕсли;
	
	Если ИмяПоля = "ВидУдержанияНДФЛ" Тогда
		Если НЕ Изменилась_СтавкаНДФЛ Тогда
			Возврат;
		КонецЕсли;
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов + СуммаНДС;
	ИначеЕсли ИмяПоля = "СтавкаНДС" Тогда
		Если НЕ Изменилась_СтавкаНДС Тогда
			Возврат;
		КонецЕсли;
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов + СуммаНДС;
	ИначеЕсли ИмяПоля = "ВидУдержанияПФ" Тогда
		Если НЕ Изменилась_СтавкаПФ Тогда
			Возврат;
		КонецЕсли;
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов + СуммаНДС;
	ИначеЕсли ИмяПоля = "СуммаПлатежа" Тогда
		Сумма			= ТекДанные.СуммаПлатежа;
		СуммаБезНалогов = Окр(ТекДанные.СуммаПлатежа/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2);
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		//Прибавить копейку
		Погрешность = Сумма - (СуммаБезНалогов + СуммаНДС);
		СуммаНДС	= СуммаНДС + Погрешность;
		//Прибавить копейку
	КонецЕсли;
	
	ТекДанные.СуммаПлатежа		= Сумма;
	ТекДанные.СуммаНДФЛ			= СуммаНДФЛ;
	ТекДанные.СуммаНДС			= СуммаНДС;
	ТекДанные.СуммаПФ			= СуммаПФ;
	
КонецПроцедуры


Процедура ПересчитатьСуммыСтроки_АвансовыйОтчет_Запасы(ИмяПоля, ТекДанные, СуммаВключаетНДС = Ложь) Экспорт

	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ставки			= ПолучитьЗначенииСтавок(ТекДанные.СтавкаНДС,ТекДанные.ВидУдержанияНДФЛ, ТекДанные.ВидУдержанияПФ, ТекДанные.ПредСтавкаНДС, ТекДанные.ПредВидУдержанияНДФЛ, ТекДанные.ПредВидУдержанияПФ);
	ПересчитатьЦену = Истина;
	
	Изменилась_СтавкаНДС 	= НЕ (Ставки.СтавкаНДС  = Ставки.ПредСтавкаНДС);
	Изменилась_СтавкаНДФЛ	= НЕ (Ставки.СтавкаНДФЛ = Ставки.ПредСтавкаНДФЛ);
	Изменилась_СтавкаПФ		= НЕ (Ставки.СтавкаПФ   = Ставки.ПредСтавкаПФ);
	
	Если Изменилась_СтавкаНДС ИЛИ Изменилась_СтавкаНДФЛ ИЛИ Изменилась_СтавкаПФ Тогда
		Если СуммаВключаетНДС Тогда
			СуммаБезНалогов = Окр(ТекДанные.Сумма/(1 + (100 * Ставки.ПредСтавкаНДС)/((100 - Ставки.ПредСтавкаНДФЛ)*(100 - Ставки.ПредСтавкаПФ))), 2);
		Иначе
			СуммаБезНалогов = ТекДанные.Сумма;
		КонецЕсли;
	Иначе
		Если СуммаВключаетНДС Тогда
			СуммаБезНалогов = Окр(ТекДанные.Сумма/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2);
		Иначе
			СуммаБезНалогов = ТекДанные.Сумма;
		КонецЕсли;
	КонецЕсли;
	ТекДанные.ПредСтавкаНДС 		= ТекДанные.СтавкаНДС;
	ТекДанные.ПредВидУдержанияПФ	= ТекДанные.ВидУдержанияПФ;
	ТекДанные.ПредВидУдержанияНДФЛ	= ТекДанные.ВидУдержанияНДФЛ;
	
	Если ИмяПоля = "ВидУдержанияНДФЛ" ИЛИ ИмяПоля = "СтавкаНДС" ИЛИ ИмяПоля = "ВидУдержанияНДФЛ" ИЛИ ИмяПоля = "ВидУдержанияПФ" Тогда
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
	ИначеЕсли ИмяПоля = "Всего" Тогда
		Всего			= ТекДанные.Всего;
		СуммаНДС		= Окр(Всего * Ставки.СтавкаНДС/(100 + Ставки.СтавкаНДС), 2);		
		СуммаПФ			= Окр((Всего - СуммаНДС) * Ставки.СтавкаПФ/100, 2);
		СуммаНДФЛ		= Окр((Всего - СуммаПФ - СуммаНДС) * Ставки.СтавкаНДФЛ/100, 2);
		СуммаБезНалогов = Всего - СуммаПФ - СуммаНДС - СуммаНДФЛ;
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
	ИначеЕсли ИмяПоля = "Сумма" Тогда
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
	ИначеЕсли ИмяПоля = "Цена" ИЛИ ИмяПоля = "Количество" Тогда
		Сумма			= Окр(ТекДанные.Цена * ТекДанные.Количество, 2);
		Если СуммаВключаетНДС Тогда
			СуммаБезНалогов = Окр(Сумма/(1 + (100 * Ставки.ПредСтавкаНДС)/((100 - Ставки.ПредСтавкаНДФЛ)*(100 - Ставки.ПредСтавкаПФ))), 2);
		Иначе
			СуммаБезНалогов = Сумма;
		КонецЕсли;
		Если СуммаВключаетНДС Тогда
			СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
			СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
			СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
			//Прибавить копейку
			Погрешность = Сумма - (СуммаБезНалогов + СуммаНДС);
			СуммаНДС		= СуммаНДС + Погрешность;
			//Прибавить копейку
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		Иначе
			СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
			СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
			СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		КонецЕсли;
		ПересчитатьЦену = Ложь;
	Иначе
		//СуммаБезНалогов = ?(СуммаВключаетНДС, 
		//				  Окр(ТекДанные.Сумма/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2),
		//				  ТекДанные.Сумма);
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов;
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
	КонецЕсли;
	
	ТекДанные.Сумма				= Сумма;
	//ТекДанные.СуммаБезНалогов	= СуммаБезНалогов;
	ТекДанные.СуммаРасходовНДФЛ	= СуммаНДФЛ;
	ТекДанные.СуммаНДС			= СуммаНДС;
	ТекДанные.СуммаПФ			= СуммаПФ;
	ТекДанные.Всего				= Всего;
	Если ПересчитатьЦену Тогда
		ТекДанные.Цена 	= ?(ТекДанные.Количество = 0, 0, Окр(ТекДанные.Сумма/ТекДанные.Количество, 2));
	КонецЕсли;
	
	
	
	
	//ТекДанные.ПредСтавкаНДС 		= ТекДанные.СтавкаНДС;
	//ТекДанные.ПредВидУдержанияПФ	= ТекДанные.ВидУдержанияПФ;
	//ТекДанные.ПредВидУдержанияНДФЛ	= ТекДанные.ВидУдержанияНДФЛ;
	//
	//Если ИмяПоля = "ВидУдержанияНДФЛ" Тогда
	//	Если НЕ Изменилась_СтавкаНДФЛ Тогда
	//		Возврат;
	//	КонецЕсли;
	//	СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
	//	СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	//	СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
	//	Сумма			= СуммаБезНалогов + СуммаНДС;
	//	Всего			= Сумма + СуммаПФ + СуммаНДФЛ + ?(СуммаВключаетНДС, 0, СуммаНДС);
	//ИначеЕсли ИмяПоля = "СтавкаНДС" Тогда
	//	Если НЕ Изменилась_СтавкаНДС Тогда
	//		Возврат;
	//	КонецЕсли;
	//	СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
	//	СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	//	СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
	//	Сумма			= СуммаБезНалогов + СуммаНДС;
	//ИначеЕсли ИмяПоля = "ВидУдержанияПФ" Тогда
	//	Если НЕ Изменилась_СтавкаПФ Тогда
	//		Возврат;
	//	КонецЕсли;
	//	СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
	//	СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	//	СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
	//	Сумма			= СуммаБезНалогов + СуммаНДС;
	//ИначеЕсли ИмяПоля = "Сумма" Тогда
	//	Сумма			= ТекДанные.Сумма;
	//	СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
	//	СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	//	СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
	//	//Прибавить копейку
	//	Погрешность = Сумма - (СуммаБезНалогов + СуммаНДС);
	//	СуммаНДС	= СуммаНДС + Погрешность;
	//	//Прибавить копейку
	//ИначеЕсли ИмяПоля = "Цена" Тогда
	//	
	//	
	//ИначеЕсли ИмяПоля = "Количество" Тогда
	//	
	//КонецЕсли;
	//
	//ТекДанные.Сумма				= Сумма;
	//ТекДанные.СуммаНДФЛ			= СуммаНДФЛ;
	//ТекДанные.СуммаНДС			= СуммаНДС;
	//ТекДанные.СуммаПФ			= СуммаПФ;
	//ТекДанные.Всего				= Всего;
	
КонецПроцедуры

Процедура ПересчитатьСуммыСтроки_АвансовыйОтчет_Оплата(ИмяПоля, ТекДанные) Экспорт

	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ставки			= ПолучитьЗначенииСтавок( ,ТекДанные.ВидУдержанияНДФЛ, ТекДанные.ВидУдержанияПФ);
	ПересчитатьЦену = Истина;
	
	СуммаБезНалогов = ТекДанные.СуммаПлатежа;
	
	Если ИмяПоля = "ВидУдержанияНДФЛ" Тогда
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	ИначеЕсли ИмяПоля = "ВидУдержанияПФ" Тогда
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	ИначеЕсли ИмяПоля = "СуммаПлатежа" Тогда
		Сумма			= ТекДанные.СуммаПлатежа;
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	КонецЕсли;
	
	ТекДанные.СуммаПлатежа		= СуммаБезНалогов;
	ТекДанные.СуммаНДФЛ			= СуммаНДФЛ;
	ТекДанные.СуммаПФ			= СуммаПФ;
	
КонецПроцедуры

Функция ПолучитьСтавкиНалогов(Дата, Контрагент, Договор, Организация) Экспорт

	СтруктураВозврата = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		СтруктураВозврата.Вставить("ВидУдержанияНДФЛ",	Неопределено);
		СтруктураВозврата.Вставить("ВидУдержанияПФ",	Неопределено);
	Иначе
		СтруктураВозврата.Вставить("ВидУдержанияНДФЛ",	Договор.ВидУдержанияНДФЛ);
		СтруктураВозврата.Вставить("ВидУдержанияПФ",	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьВидУдержанияПФ(Дата, Контрагент, Договор));
	КонецЕсли;
	СтруктураВозврата.Вставить("СтавкаНДС",			ПолучитьСтавкуНДСКонтрагента(Контрагент, Организация));
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьСтавкуНДСКонтрагента(Контрагент, Организация) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат ?(ЗначениеЗаполнено(Организация), Организация.СтавкаНДСПоУмолчанию, Неопределено);
	Иначе
		ТипНалогооблаженияНДС = Контрагент.НалогообложениеНДС;
		Если ТипНалогооблаженияНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
			Возврат УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
		ИначеЕсли ТипНалогооблаженияНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда
			Возврат УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
		Иначе
			Возврат УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

//Паганини_
Процедура ЗапретЗаписьДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если НЕ ЗначениеЗаполнено(Источник.Ссылка) Тогда
		Источник.ЗапретРедактированияДокументов = Ложь;
		Возврат;
	КонецЕсли;
	
	// Олег Литвиненко 22.05.23 --->
	ЗапретРедактированияОбъектов.ЗапретРедактированияЗаписанныхДокументов(Источник, Отказ, РежимЗаписи, РежимПроведения);
	Если Отказ Тогда
		ТекстСообщения = СтрШаблон(НСтр("ka='%1. მოცემული დოკუმენტი დაბლოკილია!';ru='%1. Запрещено редактировать записанный документ';en='%1. Current Document Blocked!'"), Источник);
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Источник.Ссылка,ТекстСообщения, , , ,Отказ);
		Возврат;
	КонецЕсли;
	// Олег Литвиненко <---
	
	Если НЕ УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалЗапретаРедактированияДокументов") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЗапретРедактированияДокументов И Не Источник.ДополнительныеСвойства.Свойство("ПроводитЗапретныеДляРедактированияДокументов") Тогда
		ТекстСообщения = НСтр("ka='მოცემული დოკუმენტი დაბლოკილია!';ru='Текущий документ заблокированн!';en='Current Document Blocked!'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Источник.Ссылка,ТекстСообщения, , , ,Отказ);
	КонецЕсли;
			
КонецПроцедуры

Функция ПереводВДату(ДатаСтрока) Экспорт
	
	День 	= Сред(ДатаСтрока, 9, 2);
	Месяц 	= Сред(ДатаСтрока, 6, 2);
	Год 	= Сред(ДатаСтрока, 1, 4);

	Если ДатаСтрока = Неопределено или СтрДлина(ДатаСтрока) > 10 Тогда
		Час = Сред(ДатаСтрока, 12, 2);
		Минута = Сред(ДатаСтрока, 15, 2);
		Секунда = Сред(ДатаСтрока, 18, 2);
		Возврат Дата(Год, Месяц, День, Час, Минута, Секунда);
	ИначеЕсли Год <> "" и Месяц <> "" и День <> "" Тогда
		Возврат Дата(Год, Месяц, День);
	Иначе
		Возврат Дата('00010101');
	КонецЕсли;
	
КонецФункции
//_Паганини

Функция ПолучитьСуммоНалоговыхЛгот(Организация,Сотрудник,Подразделение,Дата) Экспорт
	
	Запрос = Новый Запрос;
	
	//+++ Дмгг Ниже из запроса убераю подраздиление из РН НалоговыеЛьготы
	// Сотрудники могут исчерпать свой леми работая в другом подраздиление
	
	Запрос.Текст = 
					////+++ Дмгг, Изменяем. Льгота может действовать только в пределах периода действия, если не использована то она анулируется
				   //// для старых записей оставляем проверку на пустую дату, и принимаем её концом года
				   //"ВЫБРАТЬ
				   //|	СУММА(НалоговыеЛготы.Сумма) КАК Сумма,
				   //|	НалоговыеЛготы.Организация,
				   //|	НалоговыеЛготы.Сотрудник
				   ////|	НалоговыеЛготы.Подразделение //+++ Дмгг
				   //|ПОМЕСТИТЬ ВТНачисленно
				   //|ИЗ
				   //|	РегистрНакопления.НалоговыеЛготы КАК НалоговыеЛготы
				   //|ГДЕ
				   //|	НалоговыеЛготы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
				   //|	И НалоговыеЛготы.Период < &Дата
				   //|
				   //|СГРУППИРОВАТЬ ПО
				   //|	НалоговыеЛготы.Организация,
				   //|	НалоговыеЛготы.Сотрудник
				   ////|	НалоговыеЛготы.Подразделение //--- Дмгг
				   //|;
				   //|
				   //|////////////////////////////////////////////////////////////////////////////////
				   //|ВЫБРАТЬ
				   
				   //|	ЕСТЬNULL(СУММА(НалоговыеЛготыИнформацияСрезПоследних.Сумма - ЕСТЬNULL(НалоговыеЛготыОстатки.Сумма, 0)), 0) КАК Сумма,
				   //|	НалоговыеЛготыИнформацияСрезПоследних.ПроцентПодоходного
				   //|ИЗ
				   //|	РегистрСведений.НалоговыеЛготыИнформация.СрезПоследних(
				   //|			&Дата,
				   //|			Подразделение = &Подразделение
				   //|				И Сотрудник = &Сотрудник
				   //|				И Организация = &Организация) КАК НалоговыеЛготыИнформацияСрезПоследних
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленно КАК НалоговыеЛготыОстатки
				   //|		ПО НалоговыеЛготыИнформацияСрезПоследних.Организация = НалоговыеЛготыОстатки.Организация
				   //|			И НалоговыеЛготыИнформацияСрезПоследних.Сотрудник = НалоговыеЛготыОстатки.Сотрудник
				   ////|			И НалоговыеЛготыИнформацияСрезПоследних.Подразделение = НалоговыеЛготыОстатки.Подразделение  //+++ Дмгг
				   //|
				   //|СГРУППИРОВАТЬ ПО
				   //|	НалоговыеЛготыИнформацияСрезПоследних.ПроцентПодоходного";
				     "ВЫБРАТЬ
				     |	НалоговыеЛготыИнформацияСрезПоследних.Период КАК Период,
				     |	НалоговыеЛготыИнформацияСрезПоследних.Регистратор КАК Регистратор,
				     |	НалоговыеЛготыИнформацияСрезПоследних.НомерСтроки КАК НомерСтроки,
				     |	НалоговыеЛготыИнформацияСрезПоследних.Активность КАК Активность,
				     |	НалоговыеЛготыИнформацияСрезПоследних.Организация КАК Организация,
				     |	НалоговыеЛготыИнформацияСрезПоследних.Сотрудник КАК Сотрудник,
				     |	НалоговыеЛготыИнформацияСрезПоследних.Подразделение КАК Подразделение,
				     |	МАКСИМУМ(НалоговыеЛготыИнформацияСрезПоследних.ДатаОкончанияДействияЛьготы) КАК ДатаОкончанияДействияЛьготы,
				     |	НалоговыеЛготыИнформацияСрезПоследних.Сумма КАК Сумма,
				     |	НалоговыеЛготыИнформацияСрезПоследних.ПроцентПодоходного КАК ПроцентПодоходного
				     |ПОМЕСТИТЬ ВТ_ИнформацияЛьготСрекзПоследних
				     |ИЗ
				     |	РегистрСведений.НалоговыеЛготыИнформация.СрезПоследних(
				     |			&Дата,
				     |			Подразделение = &Подразделение
				     |				И Сотрудник = &Сотрудник
				     |				И Организация = &Организация
				     |				И &Дата < ДатаОкончанияДействияЛьготы) КАК НалоговыеЛготыИнформацияСрезПоследних
				     |
				     |СГРУППИРОВАТЬ ПО
				     |	НалоговыеЛготыИнформацияСрезПоследних.Период,
				     |	НалоговыеЛготыИнформацияСрезПоследних.Регистратор,
				     |	НалоговыеЛготыИнформацияСрезПоследних.НомерСтроки,
				     |	НалоговыеЛготыИнформацияСрезПоследних.Активность,
				     |	НалоговыеЛготыИнформацияСрезПоследних.Организация,
				     |	НалоговыеЛготыИнформацияСрезПоследних.Сотрудник,
				     |	НалоговыеЛготыИнформацияСрезПоследних.Подразделение,
				     |	НалоговыеЛготыИнформацияСрезПоследних.Сумма,
				     |	НалоговыеЛготыИнформацияСрезПоследних.ПроцентПодоходного
				     |;
				     |
				     |////////////////////////////////////////////////////////////////////////////////
				     |ВЫБРАТЬ
				     |	СУММА(НалоговыеЛготыОбороты.СуммаПриход) КАК Сумма,
				     |	НалоговыеЛготыОбороты.Организация КАК Организация,
				     |	НалоговыеЛготыОбороты.Сотрудник КАК Сотрудник
				     |ПОМЕСТИТЬ ВТНачисленно
				     |ИЗ
				     |	РегистрНакопления.НалоговыеЛготы.Обороты(, , Регистратор, Сотрудник = &Сотрудник) КАК НалоговыеЛготыОбороты,
				     |	ВТ_ИнформацияЛьготСрекзПоследних КАК ВТ_ИнформацияЛьготСрекзПоследних
					 
					 //|ИЗ
					 //|	РегистрНакопления.НалоговыеЛготы.Обороты(, , Регистратор, Сотрудник = &Сотрудник) КАК НалоговыеЛготыОбороты,
					 //|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнформацияЛьготСрекзПоследних КАК ВТ_ИнформацияЛьготСрекзПоследних
					 //|		ПО НалоговыеЛготыОбороты.Сотрудник = ВТ_ИнформацияЛьготСрекзПоследних.Сотрудник
					 
					 
					 
					 |ГДЕ
				     |	НалоговыеЛготыОбороты.Период МЕЖДУ ВТ_ИнформацияЛьготСрекзПоследних.Период И ВТ_ИнформацияЛьготСрекзПоследних.ДатаОкончанияДействияЛьготы
				     |
				     |СГРУППИРОВАТЬ ПО
				     |	НалоговыеЛготыОбороты.Организация,
				     |	НалоговыеЛготыОбороты.Сотрудник,
				     |	ВТ_ИнформацияЛьготСрекзПоследних.Период,
				     |	ВТ_ИнформацияЛьготСрекзПоследних.Регистратор,
				     |	ВТ_ИнформацияЛьготСрекзПоследних.НомерСтроки,
				     |	ВТ_ИнформацияЛьготСрекзПоследних.Активность,
				     |	ВТ_ИнформацияЛьготСрекзПоследних.Организация,
				     |	ВТ_ИнформацияЛьготСрекзПоследних.Сотрудник,
				     |	ВТ_ИнформацияЛьготСрекзПоследних.Подразделение,
				     |	ВТ_ИнформацияЛьготСрекзПоследних.ДатаОкончанияДействияЛьготы,
				     |	ВТ_ИнформацияЛьготСрекзПоследних.Сумма,
				     |	ВТ_ИнформацияЛьготСрекзПоследних.ПроцентПодоходного
				     |;
				     |
				     |////////////////////////////////////////////////////////////////////////////////
					 
					 //Малышев 2025-12-03 ONESOFT-4567 ((--
	
					 //|ВЫБРАТЬ
					 //|	СУММА(ВЫБОР
					 //|			КОГДА ВТ_ИнформацияЛьготСрекзПоследних.ДатаОкончанияДействияЛьготы = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					 //|				ТОГДА ВЫБОР
					 //|						КОГДА НАЧАЛОПЕРИОДА(&Дата, ГОД) = НАЧАЛОПЕРИОДА(ВТ_ИнформацияЛьготСрекзПоследних.Период, ГОД)
					 //|							ТОГДА ЕСТЬNULL(ВТ_ИнформацияЛьготСрекзПоследних.Сумма - ЕСТЬNULL(НалоговыеЛготыОстатки.Сумма, 0), 0)
					 //|						ИНАЧЕ 0
					 //|					КОНЕЦ
					 //|			ИНАЧЕ ВЫБОР
					 //|					КОГДА КОНЕЦПЕРИОДА(&Дата, ДЕНЬ) <= КОНЕЦПЕРИОДА(ВТ_ИнформацияЛьготСрекзПоследних.ДатаОкончанияДействияЛьготы, ДЕНЬ)
					 //|						ТОГДА ЕСТЬNULL(ВТ_ИнформацияЛьготСрекзПоследних.Сумма - ЕСТЬNULL(НалоговыеЛготыОстатки.Сумма, 0), 0)
					 //|					ИНАЧЕ 0
					 //|				КОНЕЦ
					 //|		КОНЕЦ) КАК сумма,
					 //|	ВТ_ИнформацияЛьготСрекзПоследних.ПроцентПодоходного
					 //|ИЗ
					 //|	ВТ_ИнформацияЛьготСрекзПоследних КАК ВТ_ИнформацияЛьготСрекзПоследних
					 //|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленно КАК НалоговыеЛготыОстатки
					 //|		ПО ВТ_ИнформацияЛьготСрекзПоследних.Организация = НалоговыеЛготыОстатки.Организация
					 //|			И ВТ_ИнформацияЛьготСрекзПоследних.Сотрудник = НалоговыеЛготыОстатки.Сотрудник
					 //|
					 //|СГРУППИРОВАТЬ ПО
					 //|	ВТ_ИнформацияЛьготСрекзПоследних.ПроцентПодоходного
					 
					 
					 |ВЫБРАТЬ
				     |	СУММА(ВЫБОР
				     |			КОГДА ВТ_ИнформацияЛьготСрекзПоследних.ДатаОкончанияДействияЛьготы = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				     |				ТОГДА ВЫБОР
				     |						КОГДА НАЧАЛОПЕРИОДА(&Дата, ГОД) = НАЧАЛОПЕРИОДА(ВТ_ИнформацияЛьготСрекзПоследних.Период, ГОД)
				     |							ТОГДА ЕСТЬNULL(ВТ_ИнформацияЛьготСрекзПоследних.Сумма - ЕСТЬNULL(НалоговыеЛготыОстатки.Сумма, 0), 0)
				     |						ИНАЧЕ 0
				     |					КОНЕЦ
				     |			ИНАЧЕ ВЫБОР
				     |					КОГДА КОНЕЦПЕРИОДА(&Дата, ДЕНЬ) <= КОНЕЦПЕРИОДА(ВТ_ИнформацияЛьготСрекзПоследних.ДатаОкончанияДействияЛьготы, ДЕНЬ)
				     |						ТОГДА ЕСТЬNULL(ВТ_ИнформацияЛьготСрекзПоследних.Сумма - ЕСТЬNULL(НалоговыеЛготыОстатки.Сумма, 0), 0)
				     |					ИНАЧЕ 0
				     |				КОНЕЦ
				     |		КОНЕЦ) КАК сумма2,
					 |  СУММА(ISNULL(ОстаткиНалоговыхЛьготОстатки.СуммаОстаток,0)) как Сумма,
				     |	ВТ_ИнформацияЛьготСрекзПоследних.ПроцентПодоходного
				     |ИЗ
				     |	ВТ_ИнформацияЛьготСрекзПоследних КАК ВТ_ИнформацияЛьготСрекзПоследних
				     |		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленно КАК НалоговыеЛготыОстатки
				     |		ПО ВТ_ИнформацияЛьготСрекзПоследних.Организация = НалоговыеЛготыОстатки.Организация
				     |			И ВТ_ИнформацияЛьготСрекзПоследних.Сотрудник = НалоговыеЛготыОстатки.Сотрудник
				     |      ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНалоговыхЛьгот.Остатки(&Дата, Сотрудник = &Сотрудник) КАК ОстаткиНалоговыхЛьготОстатки
				     |		ПО ВТ_ИнформацияЛьготСрекзПоследних.Организация = ОстаткиНалоговыхЛьготОстатки.Организация
				     |			И ВТ_ИнформацияЛьготСрекзПоследних.Сотрудник = ОстаткиНалоговыхЛьготОстатки.Сотрудник
				     |СГРУППИРОВАТЬ ПО
				     |	ВТ_ИнформацияЛьготСрекзПоследних.ПроцентПодоходного
					 //Малышев 2025-12-03 ONESOFT-4567  --))
					 
					 |";
					 
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДатаОборотов", КонецМесяца(Дата));
    Запрос.УстановитьПараметр("Организация",Организация);	
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Сумма",0);
	СтруктураОтвета.Вставить("ПроцентПодоходного",0);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОтвета,Выборка);
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции	

Процедура ПроверкаСуммиИДниЗадолженности(ДокументСсылка, Отказ) Экспорт 
	
	ТекстСообщение = "";
	НачалоПериодКонтроляЛимитов = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("НачалоПериодаКонтроляЛимитовЗадолжностиПокупателей");
	Если НачалоДня(ДокументСсылка.Дата) < НачалоПериодКонтроляЛимитов Тогда 
		Возврат;
	КонецЕсли;
	Договор = ДокументСсылка.Договор;
		
	Если Договор.ДопустимыйЛимитЗадолженностиОтПокупателя > 0 Тогда 
		ОстатокЛимита = Договор.ДопустимыйЛимитЗадолженностиОтПокупателя;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасчетыСПокупателямиОстатки.Организация,
			|	РасчетыСПокупателямиОстатки.Договор,
			|	РасчетыСПокупателямиОстатки.СуммаОстаток КАК Сумма,
			|	РасчетыСПокупателямиОстатки.СуммаВалОстаток КАК СуммаВал
			|ИЗ
			|	РегистрНакопления.РасчетыСПокупателями.Остатки(
			|			&Дата,
			|			Организация = &Организация
			|				И Договор = &Договор) КАК РасчетыСПокупателямиОстатки";
		Запрос.УстановитьПараметр("Договор", 		Договор);
		Запрос.УстановитьПараметр("Дата", 			ДокументСсылка.Дата);
		Запрос.УстановитьПараметр("Организация",	ДокументСсылка.Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ОстатокЛимита = Договор.ДопустимыйЛимитЗадолженностиОтПокупателя - Выборка.Сумма;
		КонецЕсли;
		Если ОстатокЛимита < 0 ИЛИ ОстатокЛимита < ДокументСсылка.СуммаДокумента Тогда
			Отказ = Истина;
			врТекстСообщение = НСтр("ru = 'Задолжность превышает сумму лимита на текущий договор на сумму '; ka = 'დავალიანება მოცემული ხელშეკრულებისთვის აჭარბებს დასაშვებ ლიმიტს თანხით '") + Строка((ОстатокЛимита-ДокументСсылка.СуммаДокумента)*-1);
			ТекстСообщение = ?(ТекстСообщение = "",врТекстСообщение,ТекстСообщение+Символы.ПС+врТекстСообщение);
		КонецЕсли;
	КонецЕсли;
		
	Если Договор.СрокОплатыПокупателя > 0 Тогда
		Если Не Договор.Владелец.ВестиРасчетыПоДокументам Тогда
			врТекстСообщение = НСтр("ka='თუ ხელშეკრულებაში მითითებულია დღეების ლიმიტი, აუცილებელია აღრიცხვა წარმოებდეს დოკუმენტების მიხედვით.';ru='Если в договоре указан срок оплаты покупателя, обязательно учет проводить по документам.';en='If in the contract the buyer payment deadline specified, be sure to account to spend on the documents.'");
			ТекстСообщение = ?(ТекстСообщение = "",врТекстСообщение,ТекстСообщение+Символы.ПС+врТекстСообщение);
			Отказ = Истина;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РасчетыСПокупателямиОстатки.Договор КАК Договор,
		               |	МИНИМУМ(РасчетыСПокупателямиОстатки.Документ.Дата) КАК ДатаПервДок
		               |ПОМЕСТИТЬ врТаб
		               |ИЗ
		               |	РегистрНакопления.РасчетыСПокупателями.Остатки(&Дата, Договор = &Договор) КАК РасчетыСПокупателямиОстатки
		               |ГДЕ
		               |	НЕ РасчетыСПокупателямиОстатки.Документ.Дата ЕСТЬ NULL
		               |	И РасчетыСПокупателямиОстатки.СуммаОстаток > 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасчетыСПокупателямиОстатки.Договор
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	врТаб.Договор КАК Договор,
		               |	врТаб.ДатаПервДок КАК ДатаПервДок,
		               |	РАЗНОСТЬДАТ(врТаб.ДатаПервДок, &Дата, ДЕНЬ) КАК РазностьДатВДнях
		               |ИЗ
		               |	врТаб КАК врТаб";
		Запрос.УстановитьПараметр("Договор", 	ДокументСсылка.Договор);
		Запрос.УстановитьПараметр("Дата", 		ДокументСсылка.Дата);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.РазностьДатВДнях > 0 И Выборка.РазностьДатВДнях > Договор.СрокОплатыПокупателя  Тогда
				Отказ = Истина;
				врТекстСообщение = НСтр("ru = 'Дата задолжности превышает лимита дней на '; ka = 'დავალიანება აჭარბებს დასაშვებ დროით ლიმიტს '") + 
								   Строка(Выборка.РазностьДатВДнях - Договор.СрокОплатыПокупателя) + НСТР("ru = ' дня'; ka = ' დღით'");
				ТекстСообщение = ?(ТекстСообщение = "",врТекстСообщение,ТекстСообщение+Символы.ПС+врТекстСообщение);
			КонецЕсли;  
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ТекстСообщение = "" Тогда
		Сообщить(ТекстСообщение, СтатусСообщения.Важное);
	КонецЕсли;
		

КонецПроцедуры
//_Паганини

&НаСервере
Функция ПолучитьСуммуИНДСДокументаВВалютеРасчета(Документ) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Закупки.Сумма), 0) КАК Сумма,
	|	ЕСТЬNULL(СУММА(Закупки.СуммаНДС), 0) КАК СуммаНДС
	|ИЗ
	|	РегистрНакопления.Закупки КАК Закупки
	|ГДЕ
	|	Закупки.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор",Документ);
	
	СтруктураОтвета = Новый Структура;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураОтвета.Вставить("Сумма",Выборка.Сумма);
		СтруктураОтвета.Вставить("СуммаНДС",Выборка.СуммаНДС);
		СтруктураОтвета.Вставить("СуммаВсего",Выборка.Сумма);
	Иначе
		СтруктураОтвета.Вставить("Сумма",0);
		СтруктураОтвета.Вставить("СуммаНДС",0);
		СтруктураОтвета.Вставить("СуммаВсего",0);
	КонецЕсли;	
	
	Возврат СтруктураОтвета;	
	
КонецФункции

//++Lazare
Процедура ПроверитьсуммуЗадолженности(ДокументСсылка, Отказ) Экспорт 
	
	ТекстСообщение = "";	
	
	Договор = ДокументСсылка.Договор;
		
	ТипДокумента = ТипЗнч(ДокументСсылка);
	
	Если Договор.ЧислоМесяцаПокупатель > 0 и ТипДокумента = Тип("ДокументСсылка.РасходнаяНакладная") Тогда 
		
		ЧислоМесяца = Договор.ЧислоМесяцаПокупатель ;
		ТекущийДень = День(ДокументСсылка.Дата);
		
		Если ТекущийДень <= ЧислоМесяца Тогда 	
		    //Предыдущий месяц -  проверка на дату "ЧислоМесяца" . 
			Разность = ЧислоМесяца - ТекущийДень ;		
			ПровДата = конецдня(ДокументСсылка.Дата +86400*Разность);
			ПроверяемаяДата =КонецДня(ДобавитьМесяц(Дата(ПровДата),-1));		   		
		ИначеЕсли ТекущийДень > ЧислоМесяца  Тогда 
			//Тек.месяц - проверка на дату "ЧислоМесяца" 
			Разность = ТекущийДень - ЧислоМесяца ;
			ПроверяемаяДата = конецдня(ДокументСсылка.Дата - 86400*Разность);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасчетыСПокупателямиОстатки.Организация,
			|	РасчетыСПокупателямиОстатки.Договор,
			|	РасчетыСПокупателямиОстатки.СуммаОстаток КАК Сумма,
			|	РасчетыСПокупателямиОстатки.СуммаВалОстаток КАК СуммаВал
			|ИЗ
			|	РегистрНакопления.РасчетыСПокупателями.Остатки(
			|			&ПроверяемаяДата,
			|			Организация = &Организация
			|				И Договор = &Договор) КАК РасчетыСПокупателямиОстатки";
		Запрос.УстановитьПараметр("Договор", 		Договор);
		Запрос.УстановитьПараметр("ПроверяемаяДата",ПроверяемаяДата);
		Запрос.УстановитьПараметр("Организация",	ДокументСсылка.Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДолгПокупателя = 0 ;
		Если Выборка.Следующий() Тогда 
			ДолгПокупателя = Выборка.Сумма;
		КонецЕсли;
		
		Если ДолгПокупателя > 0 Тогда
			Отказ = Истина;
			врТекстСообщение = НСтр("ru = 'Невозможно провести документ. Задолжность покупателя > 0  '; ka = 'დოკუმენტის გატარება შეუძლებელია. მოცემული ხელშეკრულებით არსებული  დავალიანების თანხა > 0 '" );
			ТекстСообщение = ?(ТекстСообщение = "",врТекстСообщение,ТекстСообщение+Символы.ПС+врТекстСообщение);
		КонецЕсли;
	КонецЕсли;
	
	
	Если Договор.ЧислоМесяцаПоставщик > 0 и ТипДокумента = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда 
		
		ЧислоМесяца = Договор.ЧислоМесяцаПоставщик ;
		ТекущийДень = День(ДокументСсылка.Дата);
		
		Если ТекущийДень <= ЧислоМесяца Тогда 	
		    //Предыдущий месяц -  проверка на дату "ЧислоМесяца" . 
			Разность = ЧислоМесяца - ТекущийДень ;		
			ПровДата = конецдня(ДокументСсылка.Дата +86400*Разность);
			ПроверяемаяДата =КонецДня(ДобавитьМесяц(Дата(ПровДата),-1));		   		
		ИначеЕсли ТекущийДень > ЧислоМесяца  Тогда 
			//Тек.месяц - проверка на дату "ЧислоМесяца" 
			Разность = ТекущийДень - ЧислоМесяца ;
			ПроверяемаяДата = конецдня(ДокументСсылка.Дата - 86400*Разность);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасчетыСПоставщикамиОстатки.Организация КАК Организация,
			|	РасчетыСПоставщикамиОстатки.Договор КАК Договор,
			|	РасчетыСПоставщикамиОстатки.СуммаОстаток КАК Сумма,
			|	РасчетыСПоставщикамиОстатки.СуммаВалОстаток КАК СуммаВал
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщиками.Остатки(
			|			&ПроверяемаяДата,
			|			Организация = &Организация
			|				И Договор = &Договор) КАК РасчетыСПоставщикамиОстатки";
		Запрос.УстановитьПараметр("Договор", 		Договор);
		Запрос.УстановитьПараметр("ПроверяемаяДата",ПроверяемаяДата);
		Запрос.УстановитьПараметр("Организация",	ДокументСсылка.Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ДолгПередПоставщиком =0 ;
		Если Выборка.Следующий() Тогда 
			ДолгПередПоставщиком = Выборка.Сумма;
		КонецЕсли;
		
		Если ДолгПередПоставщиком > 0 Тогда
			Отказ = Истина;
			врТекстСообщение = НСтр("ru = 'Невозможно провести документ. Задолжность Перед Поставщиком > 0  '; ka = 'დოკუმენტის გატარება შეუძლებელია. მოცემული ხელშეკრულებით არსებული  დავალიანების თანხა > 0 '" );
			ТекстСообщение = ?(ТекстСообщение = "",врТекстСообщение,ТекстСообщение+Символы.ПС+врТекстСообщение);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ТекстСообщение = "" Тогда
		Сообщить(ТекстСообщение, СтатусСообщения.Важное);
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Функция  ПроверкаЗаполненияПоляКомментарий(Организация)  Экспорт
	
	Проверять = Ложь;	
	
	запрос = Новый Запрос; 
	запрос.Текст =
	"ВЫБРАТЬ
	|	УчетнаяПолитикаРеглСрезПоследних.ЧекККМВозвратПроверкаЗаполненияПоляКомментарий КАК ЧекККМВозвратПроверкаЗаполненияПоляКомментарий
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(, Организация = &Организация) КАК УчетнаяПолитикаРеглСрезПоследних
	|ГДЕ
	|	УчетнаяПолитикаРеглСрезПоследних.ЧекККМВозвратПроверкаЗаполненияПоляКомментарий = ИСТИНА" ;	
	
	запрос.УстановитьПараметр("Организация" , Организация) ;	
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда 
		Проверять = Истина ;
		Возврат Проверять ;
	КонецЕсли;
	Возврат  Проверять ;
КонецФункции

&НаСервере
Функция СчетДляСписанияОприходованияЗапасов(Документ) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(&Документ) = ТИП(Документ.ОприходованиеЗапасов)
		|			ТОГДА СчетыДляСписанияИОприходованияЗапасов.СчетДляОприходованияЗапасов
		|		ИНАЧЕ СчетыДляСписанияИОприходованияЗапасов.СчетДляСписаянияЗапасов
		|	КОНЕЦ КАК Счет
		|ИЗ
		|	РегистрСведений.СчетыДляСписанияИОприходованияЗапасов КАК СчетыДляСписанияИОприходованияЗапасов";
	Запрос.УстановитьПараметр("Документ",Документ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если  РезультатЗапроса.Количество()>0 Тогда 	
		Возврат  РезультатЗапроса[0].Счет ;
	КонецЕсли;
	
	Возврат ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	
	КонецФункции
	
Процедура СформироватьТаблицаКонтрольСроковГодностиТовара(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	//Если ДокументСсылкаРасходнаяНакладная.ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
	//	Возврат;
	//КонецЕсли;
	
	КопияТаблицаЗапасы = Новый ТаблицаЗначений;
	КопияТаблицаЗапасы.Колонки.Добавить("Организация");
	КопияТаблицаЗапасы.Колонки.Добавить("СтруктурнаяЕдиница");
	КопияТаблицаЗапасы.Колонки.Добавить("Документ");
	КопияТаблицаЗапасы.Колонки.Добавить("Номенклатура");
	КопияТаблицаЗапасы.Колонки.Добавить("Характеристика");
	КопияТаблицаЗапасы.Колонки.Добавить("Количество");
	КопияТаблицаЗапасы.Колонки.Добавить("Период");
	КопияТаблицаЗапасы.Колонки.Добавить("ВидДвижения");
	КопияТаблицаЗапасы.Колонки.Добавить("СрокГодности");

	
	НовЗапрос = Новый Запрос;
	НовЗапрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	НовЗапрос.Текст =
	"ВЫБРАТЬ
	|	КонтрольСроковГодностиТовара.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	КонтрольСроковГодностиТовара.Период КАК Период,
	|	КонтрольСроковГодностиТовара.Организация КАК Организация,
	|	КонтрольСроковГодностиТовара.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	КонтрольСроковГодностиТовара.Номенклатура КАК Номенклатура,
	|	КонтрольСроковГодностиТовара.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВтПродажи
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК КонтрольСроковГодностиТовара
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтрольСроковГодностиТовара.Номенклатура,
	|	КонтрольСроковГодностиТовара.Характеристика,
	|	КонтрольСроковГодностиТовара.Количество,
	|	КонтрольСроковГодностиТовара.Период,
	|	КонтрольСроковГодностиТовара.Организация,
	|	КонтрольСроковГодностиТовара.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 3000000
	|	ВтПродажи.Номенклатура КАК Номенклатура,
	|	ВтПродажи.Количество КАК Количество,
	|	КонтрольСроковГодностиТовараОбороты.Документ КАК Документ,
	|	СУММА(КонтрольСроковГодностиТовараОбороты.КоличествоОборот) КАК КоличествоОстаток,
	|	КонтрольСроковГодностиТовараОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВтПродажи.Организация КАК Организация,
	|	ВтПродажи.Период КАК Период,
	|	ВтПродажи.ВидДвижения КАК ВидДвижения,
	|	КонтрольСроковГодностиТовараОбороты.СрокГодности КАК СрокГодности
	|ПОМЕСТИТЬ ВтСрокиГодности
	|ИЗ
	|	РегистрНакопления.КонтрольСроковГодностиТовара.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						ВтПродажи.Номенклатура КАК Номенклатура,
	|						ВтПродажи.Характеристика КАК Характеристика
	|					ИЗ
	|						ВтПродажи КАК ВтПродажи)) КАК КонтрольСроковГодностиТовараОбороты,
	|	ВтПродажи КАК ВтПродажи
	|ГДЕ
	|	КонтрольСроковГодностиТовараОбороты.Регистратор <> &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтПродажи.Номенклатура,
	|	ВтПродажи.Организация,
	|	ВтПродажи.Период,
	|	ВтПродажи.ВидДвижения,
	|	КонтрольСроковГодностиТовараОбороты.Документ,
	|	КонтрольСроковГодностиТовараОбороты.СтруктурнаяЕдиница,
	|	КонтрольСроковГодностиТовараОбороты.СрокГодности,
	|	ВтПродажи.Количество
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрольСроковГодностиТовараОбороты.СрокГодности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтСрокиГодности.Номенклатура КАК Номенклатура,
	|	ВтСрокиГодности.Количество КАК Количество,
	|	ВтСрокиГодности.Документ КАК Документ,
	|	СУММА(ВтСрокиГодности.КоличествоОстаток) КАК КоличествоОстаток,
	|	ВтСрокиГодности.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВтСрокиГодности.Организация КАК Организация,
	|	ВтСрокиГодности.Период КАК Период,
	|	ВтСрокиГодности.ВидДвижения КАК ВидДвижения,
	|	ВтСрокиГодности.СрокГодности КАК СрокГодности
	|ИЗ
	|	ВтСрокиГодности КАК ВтСрокиГодности
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтСрокиГодности.Организация,
	|	ВтСрокиГодности.ВидДвижения,
	|	ВтСрокиГодности.СтруктурнаяЕдиница,
	|	ВтСрокиГодности.Документ,
	|	ВтСрокиГодности.Номенклатура,
	|	ВтСрокиГодности.Период,
	|	ВтСрокиГодности.Количество,
	|	ВтСрокиГодности.СрокГодности
	|ИТОГИ
	|	МАКСИМУМ(Количество),
	|	СУММА(КоличествоОстаток)
	|ПО
	|	Номенклатура";

	
	НовЗапрос.УстановитьПараметр("Регистратор",ДокументСсылка);
	НовЗапрос.УстановитьПараметр("Организация",ДокументСсылка.Организация);
	НовЗапрос.УстановитьПараметр("СтруктурнаяЕдиница",ДокументСсылка.СтруктурнаяЕдиница);
		
	ВыборкаНоменклатура = НовЗапрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаНоменклатура.Следующий() Цикл
		КоличествоПогасить=0;
		КоличествоПогасить = ВыборкаНоменклатура.Количество;
		
		ВыборкаПродажи = ВыборкаНоменклатура.Выбрать(); 		
		Пока ВыборкаПродажи.Следующий() Цикл
			Если Не ВыборкаПродажи.КоличествоОстаток > 0 Тогда
				Продолжить;
			КонецЕсли;
			Если   КоличествоПогасить <> Null Тогда 
				Если КоличествоПогасить >0 Тогда  
					стрЗапасы = КопияТаблицаЗапасы.Добавить();
					ЗаполнитьЗначенияСвойств(стрЗапасы,ВыборкаПродажи);
					стрЗапасы.Количество = Мин(ВыборкаПродажи.КоличествоОстаток,КоличествоПогасить);
					КоличествоПогасить 	 = КоличествоПогасить - ВыборкаПродажи.КоличествоОстаток;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаКонтрольСроковГодностиТовара", КопияТаблицаЗапасы);

КонецПроцедуры

Процедура ПересчитатьСуммыСтроки_ПоступлениеВКассу_ПоступлениеНаСчетa(ИмяПоля, ТекДанные, ИспользоватьНулевуеПредЗначения = ЛОЖЬ) Экспорт
//Процедура ПересчитатьСуммыСтроки_РасходИзКассы_РасходСоСчета(ИмяПоля, ТекДанные) Экспорт


	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//
	////+++ Дмгг
	//Если ИспользоватьНулевуеПредЗначения Тогда 
	//	
	//	Ставки			= ПолучитьЗначенииСтавок(ТекДанные.СтавкаНДС,ТекДанные.ВидУдержанияНДФЛ, ТекДанные.ВидУдержанияПФ, 0, 0, 0);
	//	
	//Иначе
	//	
		Ставки			= ПолучитьЗначенииСтавок(ТекДанные.СтавкаНДС,ТекДанные.ВидУдержанияНДФЛ, ТекДанные.ВидУдержанияПФ, ТекДанные.ПредСтавкаНДС, ТекДанные.ПредВидУдержанияНДФЛ, ТекДанные.ПредВидУдержанияПФ);
	//	
	//КонецЕсли;
	////--- Дмгг
	
	ПересчитатьЦену = Истина;
	
	Изменилась_СтавкаНДС 	= НЕ (Ставки.СтавкаНДС  = Ставки.ПредСтавкаНДС);
	Изменилась_СтавкаНДФЛ	= НЕ (Ставки.СтавкаНДФЛ = Ставки.ПредСтавкаНДФЛ);
	Изменилась_СтавкаПФ		= НЕ (Ставки.СтавкаПФ   = Ставки.ПредСтавкаПФ);
	
	Если Изменилась_СтавкаНДС ИЛИ Изменилась_СтавкаНДФЛ ИЛИ Изменилась_СтавкаПФ Тогда
		СуммаБезНалогов = Окр(ТекДанные.СуммаПлатежа/(1 + (100 * Ставки.ПредСтавкаНДС)/((100 - Ставки.ПредСтавкаНДФЛ)*(100 - Ставки.ПредСтавкаПФ))), 2);
	Иначе
		СуммаБезНалогов = Окр(ТекДанные.СуммаПлатежа/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2);
	КонецЕсли;
	
	Если НЕ ИспользоватьНулевуеПредЗначения Тогда//+++ Дмгг 
		ТекДанные.ПредСтавкаНДС 		= ТекДанные.СтавкаНДС;
		ТекДанные.ПредВидУдержанияПФ	= ТекДанные.ВидУдержанияПФ;
		ТекДанные.ПредВидУдержанияНДФЛ	= ТекДанные.ВидУдержанияНДФЛ;
	КонецЕсли;
	
	Если ИмяПоля = "ВидУдержанияНДФЛ" Тогда
		Если НЕ Изменилась_СтавкаНДФЛ Тогда
			Возврат;
		КонецЕсли;
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов + СуммаНДС;
	ИначеЕсли ИмяПоля = "СтавкаНДС" Тогда
		Если НЕ Изменилась_СтавкаНДС Тогда
			Возврат;
		КонецЕсли;
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов + СуммаНДС;
	ИначеЕсли ИмяПоля = "ВидУдержанияПФ" Тогда
		Если НЕ Изменилась_СтавкаПФ Тогда
			Возврат;
		КонецЕсли;
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов + СуммаНДС;
	ИначеЕсли ИмяПоля = "СуммаПлатежа" Тогда
		Сумма			= ТекДанные.СуммаПлатежа;
		СуммаБезНалогов = Окр(ТекДанные.СуммаПлатежа/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2);
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		//Прибавить копейку
		Погрешность = Сумма - (СуммаБезНалогов + СуммаНДС);
		СуммаНДС	= СуммаНДС + Погрешность;
		//Прибавить копейку
	КонецЕсли;
	
	ТекДанные.СуммаПлатежа		= Сумма;
	ТекДанные.СуммаНДФЛ			= СуммаНДФЛ;
	ТекДанные.СуммаНДС			= СуммаНДС;
	ТекДанные.СуммаПФ			= СуммаПФ;
	
КонецПроцедуры
//--Lazare

//++lyskov
Процедура СинхронизироватьРеквизитыДокументовОснованийСчетаФактуры(СчетФактураОбъект) Экспорт
	
	ДанныеДокументовДляОбработки = Новый Соответствие;
	
	ВсеДокументыОснования = ОбщегоНазначения.ВыгрузитьКолонку(СчетФактураОбъект.ДокументыОснования, "ДокументОснование", Истина);
	ДокументыПоТипам = ДокументыРазобранныеПоТипам(ВсеДокументыОснования);
	
	Для Каждого НаборДокументов Из ДокументыПоТипам Цикл
		МетаданныеДокумента = Метаданные.НайтиПоТипу(НаборДокументов.Ключ);
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("IDСФ", МетаданныеДокумента)
			И ОбщегоНазначения.ЕстьРеквизитОбъекта("НомерСФ", МетаданныеДокумента) Тогда
			
			ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ДанныеДокументовДляОбработки,
				ОбщегоНазначения.ЗначенияРеквизитовОбъектов(НаборДокументов.Значение, "IDСФ,НомерСФ"));
				
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ДанныеДокумента Из ДанныеДокументовДляОбработки Цикл
		
		ДокументСсылка     = ДанныеДокумента.Ключ;
		РеквизитыДокумента = ДанныеДокумента.Значение;
		
		// Если счет-фактура записывается - поля документа-основания требуется заполнить из данных счета-фактуры.
		// Если счет-фактура удаляется - поля документа-основания требуется очистить.
		
		НомерСФДляЗаполнения = ?(СчетФактураОбъект.ПометкаУдаления, "", СчетФактураОбъект.НомерВходящегоДокумента);
		ИдСФДляЗаполнения    = ?(СчетФактураОбъект.ПометкаУдаления, "", Формат(СчетФактураОбъект.Идентификатор, "ЧН=' '; ЧГ=0"));
		
		Если РеквизитыДокумента.НомерСФ <> НомерСФДляЗаполнения
			Или РеквизитыДокумента.IDСФ <> ИдСФДляЗаполнения Тогда
			
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.НомерСФ = НомерСФДляЗаполнения;
			ДокументОбъект.IDСФ    = ИдСФДляЗаполнения;
			ДокументОбъект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДокументыРазобранныеПоТипам(Документы)
	
	ДокументыПоТипам = Новый Соответствие;
	
	Для Каждого Документ Из Документы Цикл
		ТипДокумента = ТипЗнч(Документ);
		Если ДокументыПоТипам.Получить(ТипДокумента) = Неопределено Тогда
			ДокументыПоТипам.Вставить(ТипДокумента, Новый Массив);
		КонецЕсли;
		ДокументыПоТипам[ТипДокумента].Добавить(Документ);
	КонецЦикла;
	
	Возврат ДокументыПоТипам;
	
КонецФункции
//--lyskov


