
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// При вызове из классификатора.
	Если Параметры.Свойство("Код") Тогда
		Объект.Код = Параметры.Код;
	КонецЕсли;	
	
	Если Параметры.Свойство("Наименование") Тогда
		Объект.Наименование = Параметры.Наименование;
	КонецЕсли;
	
	Если Параметры.Свойство("МеждународноеСокращение") Тогда
		Объект.МеждународноеСокращение = Параметры.МеждународноеСокращение;
	КонецЕсли;
	
	Если Параметры.Свойство("НаименованиеПолное") Тогда
		Объект.НаименованиеПолное = Параметры.НаименованиеПолное;
	КонецЕсли;	
	
	ВесовойШтучныйНаФорму();//Kuzmich, 13.02.2019, Проблемы с выгрузкой штучного товара
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

//Kuzmich, 13.02.2019, Проблемы с выгрузкой штучного товара
#Область ВесовойШтучный
&НаСервере
Процедура ВесовойШтучныйНаФорму()

	Если Объект.Весовая Тогда
	
		ВесовойШтучный = 1;
		
	ИначеЕсли Объект.Штучный Тогда
	
		ВесовойШтучный = 2;
		
	Иначе
		
		ВесовойШтучный = 0;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВесовойШтучныйПриИзменении(Элемент)
	Если ВесовойШтучный = 1 Тогда
	
		Объект.Весовая = ИСТИНА;
		Объект.Штучный = ЛОЖЬ; 
		
	ИначеЕсли ВесовойШтучный = 2 Тогда
	
		Объект.Весовая = ЛОЖЬ;
		Объект.Штучный = ИСТИНА;
		
	Иначе
		
		Объект.Весовая = ЛОЖЬ;
		Объект.Штучный = ЛОЖЬ;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры
#КонецОбласти
//Kuzmich, 13.02.2019, Проблемы с выгрузкой штучного товара
