#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредства(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("РасходДенежныхСредств", НСтр("ka='ფულადი სახსრების დანახარჯი';ru='Расход денежных средств';en='Flow of funds'"));
	Запрос.УстановитьПараметр("ПеремещениеДенежныхСредств", НСтр("ka='ფულადი სახსრების გადაადგილება';ru='Перемещение денежных средств';en='Moving funds'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ИспользуютсяПереводыВПути",РегистрыСведений.ПрименениеПереводовВПути.ИспользуютсяПереводыВПути(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата,СтруктураДополнительныеСвойства.ДляПроведения.Организация));
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаДС", ДокументСсылкаРасходСоСчета.ВалютаДенежныхСредств);
	
	
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	Если ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь") Тогда
		Итог = ДокументСсылкаРасходСоСчета.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	Иначе
		Итог = 0;
	КонецЕсли;
	ОстатокСуммы = ДокументСсылкаРасходСоСчета.СуммаДокумента - Итог;
	Запрос.УстановитьПараметр("ПлатежныйКалендарь", ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"));
	Запрос.УстановитьПараметр("ОстатокСуммы", ОстатокСуммы);
	Запрос.УстановитьПараметр("УчетВалютныхОпераций", ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	1 КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|				ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|		ИНАЧЕ &РасходДенежныхСредств
	|	КОНЕЦ КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные) КАК ТипДенежныхСредств,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	ТаблицаДокумента.БанковскийСчет КАК БанковскийСчетКасса,
	|	ТаблицаДокумента.АналитикаДДС КАК Аналитика,
	|	ТаблицаДокумента.ВалютаДенежныхСредств КАК Валюта,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(&ОстатокСуммы) КАК СуммаВал,
	|	-СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаДляОстатка,
	|	-СУММА(&ОстатокСуммы) КАК СуммаВалДляОстатка,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчета КАК СчетУчета,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл КАК СчетУчетаРегл,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект КАК Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare_ 26.02.2021	
	|	ТаблицаДокумента.ЭтоПеремещение КАК ЭтоПеремещение
	|ПОМЕСТИТЬ ВременнаяТаблицаДенежныеСредства
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПенсионномуФонду)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|				И &ИспользуютсяПереводыВПути)
	|	И &ОстатокСуммы > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|				ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|		ИНАЧЕ &РасходДенежныхСредств
	|	КОНЕЦ,
	|	ТаблицаДокумента.АналитикаДДС,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&РасходДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	////+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	(ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|				И &ИспользуютсяПереводыВПути)
	|	И &ПлатежныйКалендарь
	|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС,
	////+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&РасходДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	////+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//Lazare_ 26.02.2021
	|	ЛОЖЬ
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	(ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	////+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	МАКСИМУМ(ВыплатаЗаработнойПлаты.НомерСтроки),
	|	&РасходДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ВЫБОР
	|		КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.Сотрудник
	|	КОНЕЦ,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаПлатежа),
	|	-СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(ПлатежнаяВедомостьСотрудники.СуммаПлатежа),
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчета,	
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчетаРегл,
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВыплатаЗаработнойПлаты.Проект,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|				ИЛИ ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|			ТОГДА Выбор
	|					КОГДА ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|					ИНАЧЕ ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником
	|				КОНЕЦ
	|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|			ПО ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|		ПО ПлатежнаяВедомостьСотрудники.Ссылка = ВыплатаЗаработнойПлаты.Ведомость
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	|		И ПлатежнаяВедомостьСотрудники.Проект = ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|				ИЛИ ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|			ТОГДА Выбор
	|					КОГДА ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|					ИНАЧЕ ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником
	|				КОНЕЦ
	|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	|	КОНЕЦ
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	////_Lazare 26.02.2021
	//|   ВЫБОР
	//|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	//|	КОНЕЦ,
	////Lazare_ 26.02.2021
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВыплатаЗаработнойПлаты.Ссылка = &Ссылка
	|	И ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Зарплата)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчета,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчетаРегл,
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВыплатаЗаработнойПлаты.Проект,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|				ИЛИ ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|			ТОГДА Выбор
	|					КОГДА ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|					ИНАЧЕ ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником
	|				КОНЕЦ
	|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВЫБОР
	|		КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.Сотрудник
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	2,
	|	&ПеремещениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.СчетКонтрагента,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(&ОстатокСуммы),
	|	-СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(&ОстатокСуммы),
	|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	////--- Дмгг
    //_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|	И НЕ &ИспользуютсяПереводыВПути
	|	И &ОстатокСуммы > 0
	|	И НЕ ТаблицаДокумента.ЭтоПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл,
	|	ТаблицаДокумента.СчетКонтрагента,
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&ПеремещениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|	И НЕ &ИспользуютсяПереводыВПути
	|	И &ПлатежныйКалендарь
	|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	1,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.СчетКонтрагента,
	|	ТаблицаДокумента.АналитикаДДС,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(&ОстатокСуммы),
	|	-СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(&ОстатокСуммы),
	|	ТаблицаДокумента.СчетКонтрагента.СчетУчета,
	|	ТаблицаДокумента.СчетКонтрагента.СчетУчетаРегл,
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|				И &ИспользуютсяПереводыВПути)
	|	И &ОстатокСуммы > 0
	|	И ТаблицаДокумента.ЭтоПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.СчетКонтрагента,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.СчетКонтрагента.СчетУчета,
	|	ТаблицаДокумента.СчетКонтрагента.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|	КОНЕЦ,
	|	ТаблицаДокумента.АналитикаДДС,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&РасходДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	//|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента
	|	ВЫБОР 
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС 
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента.СчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента.СчетУчетаРегл,
	////+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	(ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|				И &ИспользуютсяПереводыВПути
	|				И ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение)
	|	И &ПлатежныйКалендарь
	|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа > 0
	|	И ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	//|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента,
	|	ВЫБОР 
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС 
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента.СчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента.СчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	9,
	|	2,
	|	&ПеремещениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.СчетКонтрагента,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(&ОстатокСуммы),
	|	-СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(&ОстатокСуммы),
	|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл,
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|	И НЕ &ИспользуютсяПереводыВПути
	|	И &ОстатокСуммы > 0
	|	И ТаблицаДокумента.ЭтоПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл,
	|	ТаблицаДокумента.СчетКонтрагента,
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	10,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&ПеремещениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|	И НЕ &ИспользуютсяПереводыВПути
	|	И &ПлатежныйКалендарь
	|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа > 0
	|	И ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	11,
	|	1,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|				ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|		ИНАЧЕ &РасходДенежныхСредств
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные),
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.АналитикаДДС,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(&ОстатокСуммы),
	|	-СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(&ОстатокСуммы),
	|	ТаблицаДокумента.АналитикаДДС.СчетУчета,
	|	ТаблицаДокумента.АналитикаДДС.СчетУчетаРегл,
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|				И &ИспользуютсяПереводыВПути)
	|	И &ОстатокСуммы > 0
	|	И ТаблицаДокумента.ЭтоПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.АналитикаДДС.СчетУчета,
	|	ТаблицаДокумента.АналитикаДДС.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|				ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|		ИНАЧЕ &РасходДенежныхСредств
	|	КОНЕЦ,
	|	ТаблицаДокумента.АналитикаДДС,
	|	ТаблицаДокумента.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	12,
	|	ВыплатаЗаработнойПлаты.НомерСтроки,
	|	&РасходДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ВыплатаЗаработнойПлаты.Сотрудник,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(ВыплатаЗаработнойПлаты.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(ВыплатаЗаработнойПлаты.СуммаПлатежа),
	|	-СУММА(ВЫРАЗИТЬ(ВыплатаЗаработнойПлаты.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(ВыплатаЗаработнойПлаты.СуммаПлатежа),
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчета,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчетаРегл,
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВыплатаЗаработнойПлаты.Проект,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ЛОЖЬ
	|ИЗ
	|	Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВыплатаЗаработнойПлаты.Ссылка = &Ссылка
	|	И ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчета,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчетаРегл,
	|	ВыплатаЗаработнойПлаты.НомерСтроки,
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВыплатаЗаработнойПлаты.Проект,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	|	КОНЕЦ,
	|	ВыплатаЗаработнойПлаты.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ТипДенежныхСредств,
	|	БанковскийСчетКасса,
	|	Валюта,
	|	СчетУчета,
	//+++ Дмгг
	//|	Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ Проект
	|	КОНЕЦ,
	//_Lazare 26.02.2021
	|	СчетУчетаРегл"; //+++ Дмгг
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков денежных средств.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВременнаяТаблицаДенежныеСредства.Организация КАК Организация,
	|	ВременнаяТаблицаДенежныеСредства.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ВременнаяТаблицаДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ВременнаяТаблицаДенежныеСредства.Валюта КАК Валюта,
	//+++ Дмгг
	//|	ВременнаяТаблицаДенежныеСредства.Проект
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаДенежныеСредства.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаДенежныеСредства.Проект
	|	КОНЕЦ КАК Проект
	//_Lazare 26.02.2021
	|ИЗ
	|	ВременнаяТаблицаДенежныеСредства КАК ВременнаяТаблицаДенежныеСредства";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДенежныеСредства");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредства(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредстваРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДенежныеСредства()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВозникновениеДолгаПодотчетника", НСтр("ka='საქვეანგარიშო პირის ვალის წარმოშობა';ru='Возникновение долга подотчетника';en='The emergence of debt podotchetnika'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	//ПодольскийАИ #УчетПроектов 09.02.2021 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 09.02.2021 }
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	&ВозникновениеДолгаПодотчетника КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.БанковскийСчет КАК БанковскийСчет,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|			ТОГДА &Ссылка
	|		ИНАЧЕ ТаблицаДокумента.Документ
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.Подотчетник КАК Сотрудник,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.ВалютаДенежныхСредств КАК Валюта,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаДокумента) КАК СуммаВал,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаДляОстатка,
	|	СУММА(ТаблицаДокумента.СуммаДокумента) КАК СуммаВалДляОстатка,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетниками
	|		ИНАЧЕ ТаблицаДокумента.Подотчетник.СчетРасчетовПоПерерасходу
	|	КОНЕЦ СчетУчета,
	|	ТаблицаДокумента.Статья КАК Статья,
	//+++ Дмгг
	//|	ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником КАК Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником
	|	КОНЕЦ КАК Проект,
	//_Lazare 26.02.2021
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетникамиРегл
	|		ИНАЧЕ ТаблицаДокумента.Подотчетник.СчетРасчетовПоПерерасходуРегл
	|	КОНЕЦ КАК СчетУчетаРегл
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПодотчетниками
	|ИЗ
	|	Документ.РасходСоСчета КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.Подотчетник,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|			ТОГДА &Ссылка
	|		ИНАЧЕ ТаблицаДокумента.Документ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетниками
	|		ИНАЧЕ ТаблицаДокумента.Подотчетник.СчетРасчетовПоПерерасходу
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья,
	//+++ Дмгг
	//|	ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником
	|	КОНЕЦ,
	//_Lazare 26.02.2021
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетникамиРегл
	|		ИНАЧЕ ТаблицаДокумента.Подотчетник.СчетРасчетовПоПерерасходуРегл
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	Валюта,
	|	Документ,
	|	СчетУчета,
	|	СчетУчетаРегл,
	|	Проект";//+++
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с подотчетными лицами.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПодотчетниками.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПодотчетниками.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблицаРасчетыСПодотчетниками.Валюта КАК Валюта,
	|	ВременнаяТаблицаРасчетыСПодотчетниками.Документ КАК Документ
	//+++ Дмгг
	//|	ВременнаяТаблицаРасчетыСПодотчетниками.Проект КАК Проект
	//--- Дмгг
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПодотчетниками КАК ВременнаяТаблицаРасчетыСПодотчетниками";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПодотчетниками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПодотчетниками(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПодотчетникамиРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПодотчетниками", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПодотчетниками()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВозникновениеАвансаПоставщику", "Возникновение аванса поставщику");
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	//Паганини#Удержания_
	Запрос.УстановитьПараметр("ВалютаУчета",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета"));
	Запрос.УстановитьПараметр("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении"));
	Запрос.УстановитьПараметр("ПогашениеОбязательствПередПоставщиком", НСтр("ka='მომწოდებლის წინაშე ვალდებულებების დაფარვა';ru='Погашение обязательств перед поставщиком';en='Repayment of liabilities to the supplier'"));
	Запрос.УстановитьПараметр("ПогашениеОбязательствПередПерсоналом", НСтр("ka='პერსონალის წინაშე ვალდებულებების დაფარვა';ru='Погашение обязательств перед персоналом';en='Repayment of liabilities to employees'"));
	//_Паганини#Удержания
	
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	
	//Паганини_Добавлена 5 поля: "ТипНДФЛ","СуммаНДФЛ","СуммаНДФЛВал", "КурсПоступления", "КратностьПоступления"_Паганини
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет КАК БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ КАК ТипРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Дата,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК Сумма,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВал,
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК СуммаДляОстатка,
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВалДляОстатка,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ КАК СчетУчета,
	//+++
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья КАК Статья,
	//---
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов КАК Валюта,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ КАК СодержаниеПроводки,
	//Паганини ПФ_
	//|	ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ = ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|				ТОГДА 0
	//|			ИНАЧЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета / (1 - ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ КАК Справочник.ТипыНДФЛ).Ставка / 100) КАК ЧИСЛО(15, 2))) - ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета
	//|		КОНЕЦ) КАК СуммаНДФЛ,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ = ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|				ТОГДА 0
	//|			ИНАЧЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов / (1 - ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ КАК Справочник.ТипыНДФЛ).Ставка / 100) КАК ЧИСЛО(15, 2))) - ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов
	//|		КОНЕЦ) КАК СуммаНДФЛВал,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияНДФЛ,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДФЛ),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДФЛВал),
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛКОплате,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛНачислении,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияПФ,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПФВал),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПФ),
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ДоговорПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.КонтрагентПФ,
	//_Паганини ПФ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Курс
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Курс
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КурсПоступления,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Кратность
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Кратность
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КратностьПоступления,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	//--- Дмгг
	////ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ КАК Проект
	////ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект 
	 //Lazare_ 26.02.2021	
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщиками
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ,
	 //Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	//+++
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	//---
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ,
	//Паганини ПФ_
	//|	ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияНДФЛ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛКОплате,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛНачислении,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ДоговорПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.КонтрагентПФ,
	//_Паганини ПФ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Курс
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Курс
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Кратность
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Кратность
	|		ИНАЧЕ 0
	|	КОНЕЦ
	//Паганини#Удержания_
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВыплатаЗаработнойПлаты.НомерСтроки),
	|	НЕОПРЕДЕЛЕНО,
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Договор,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаРасчетов),
	|	-СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(ПлатежнаяВедомостьСотрудники.СуммаРасчетов),
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником КАК Проект
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВыплатаЗаработнойПлаты.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ КАК Проект
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВыплатаЗаработнойПлаты.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект 
	 //Lazare_ 26.02.2021
	|ИЗ
	|	Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|			ПО ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|		ПО ПлатежнаяВедомостьСотрудники.Ссылка = ВыплатаЗаработнойПлаты.Ведомость
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВыплатаЗаработнойПлаты.Ссылка = &Ссылка
	|	И ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Зарплата)
	|	И ВЫБОР
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВыплатаЗаработнойПлаты.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВыплатаЗаработнойПлаты.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ, 
	 //Lazare_ 26.02.2021
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Договор,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ
	//_Паганини#Удержания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов,
	|	СчетУчета,
	|	СчетУчетаРегл,
	|	Проект"; //+++ Дмгг
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПоставщиками.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблицаРасчетыСПоставщиками";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщиками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПоставщиками()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ПогашениеАвансаПокупателя", НСтр("ka='მყიდველის ავანსის დაფარვა';ru='Погашение аванса покупателя';en='Repayment of the advance of the buyer'"));
	Запрос.УстановитьПараметр("ВозникновениеОбязательствПокупателя", НСтр("ka='მყიდველის ვალდებულებების წარმოშობა';ru='Возникновение обязательств покупателя';en='The emergence of the obligations of the buyer'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	//ПодольскийАИ #УчетПроектов 09.02.2021 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 09.02.2021 }
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет КАК БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ КАК ТипРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Дата,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК Сумма,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВал,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК СуммаДляОстатка,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВалДляОстатка,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПокупателя
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПокупателем
	|	КОНЕЦ КАК СчетУчета,
	//+++
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПокупателяРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПокупателемРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья КАК Статья,
	//---
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов КАК Валюта,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ПогашениеАвансаПокупателя
	|		ИНАЧЕ &ВозникновениеОбязательствПокупателя
	|	КОНЕЦ КАК СодержаниеПроводки,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ КАК Проект
	//Lazare 26.02.2021
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателями
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПокупателя
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПокупателем
	|	КОНЕЦ,
	//+++
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПокупателяРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПокупателемРегл
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	//---
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ПогашениеАвансаПокупателя
	|		ИНАЧЕ &ВозникновениеОбязательствПокупателя
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов,
	|	СчетУчета,
	|	СчетУчетаРегл,
	|	Проект";//+++
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПокупателями.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПокупателями.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПокупателями.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПокупателями.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПокупателями.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов КАК ТипРасчетов
	//+++ Дмгг
	//|	ВременнаяТаблицаРасчетыСПокупателями.Проект КАК Проект
	//--- Дмгг
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПокупателями КАК ВременнаяТаблицаРасчетыСПокупателями";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПокупателями");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателямиРегл(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПокупателями()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ПогашениеОбязательствПередПерсоналом", НСтр("ka='პერსონალის წინაშე ვალდებულებების დაფარვა';ru='Погашение обязательств перед персоналом';en='Repayment of liabilities to employees'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ВалютаУчета",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета"));
 	//Паганини#Удержания_
	Запрос.УстановитьПараметр("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении"));
	Запрос.УстановитьПараметр("ПогашениеОбязательствПередПоставщиком", НСтр("ka='მომწოდებლის წინაშე ვალდებულებების დაფარვა';ru='Погашение обязательств перед поставщиком';en='Repayment of liabilities to the supplier'"));
	//_Паганини#Удержания
	
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", ПолучитьФункциональнуюОпцию("УчетПоПроектам"));
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлатежнаяВедомость.Ссылка
	|ИЗ
	|	Документ.ПлатежнаяВедомость КАК ПлатежнаяВедомость
	|ГДЕ
	|	ПлатежнаяВедомость.Ссылка В
	|			(ВЫБРАТЬ
	|				ВыплатаЗаработнойПлаты.Ведомость
	|			ИЗ
	|				Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|			ГДЕ
	|				ВыплатаЗаработнойПлаты.Ссылка = &Ссылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.ПлатежнаяВедомость");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	МАКСИМУМ(ВыплатаЗаработнойПлаты.НомерСтроки) КАК НомерСтроки,
	|	&Организация КАК Организация,
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата КАК Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник КАК Сотрудник,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов КАК Валюта,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаРасчетов) КАК СуммаВал,
	|	-СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаДляОстатка,
	|	-СУММА(ПлатежнаяВедомостьСотрудники.СуммаРасчетов) КАК СуммаВалДляОстатка,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник.СчетРасчетовСПерсоналом КАК СчетУчета,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник.СчетРасчетовСПерсоналомРегл КАК СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
	|			ТОГДА &ПогашениеОбязательствПередПоставщиком
	|		ИНАЧЕ &ПогашениеОбязательствПередПерсоналом
	|	КОНЕЦ КАК СодержаниеПроводки,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет КАК БанковскийСчет,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.НДФЛПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаНДФЛ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ,
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаПФПлатежа) КАК СуммаПФВал,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПФПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаПФ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФСотрудника,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФОрганизации,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации КАК ВедомостьВидОперации,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент КАК Контрагент,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Договор КАК Договор,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаЛгот) КАК СуммаЛгот,
	//+++ Дмгг
	//|   ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником КАК Проект
	//--- Дмгг
	////ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВыплатаЗаработнойПлаты.Проект
	////|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)  //+++lazare_26.02.2021
	//|	КОНЕЦ КАК Проект
	////ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВыплатаЗаработнойПлаты.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект 
	 //Lazare_26.02.2021		
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПерсоналом
	|ИЗ
	|	Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|			ПО ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|		ПО ПлатежнаяВедомостьСотрудники.Ссылка = ВыплатаЗаработнойПлаты.Ведомость
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	|			И ВЫБОР 
	|				КОГДА &УчетПоПроектам 
	|					ТОГДА ПлатежнаяВедомостьСотрудники.Проект = ВыплатаЗаработнойПлаты.Проект
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВыплатаЗаработнойПлаты.Ссылка = &Ссылка
	|	И ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Зарплата)
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|   ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	|   ВыплатаЗаработнойПлаты.Проект,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	//|	КОНЕЦ,
	////Lazare
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.СтруктурнаяЕдиница,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ПериодРегистрации,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник.СчетРасчетовСПерсоналом,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник.СчетРасчетовСПерсоналомРегл,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Договор,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщикомРегл,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
	|			ТОГДА &ПогашениеОбязательствПередПоставщиком
	|		ИНАЧЕ &ПогашениеОбязательствПередПерсоналом
	|	КОНЕЦ,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.Договор,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ВыплатаЗаработнойПлаты.НомерСтроки,
	|	&Организация,
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница,
	|	ВыплатаЗаработнойПлаты.Сотрудник,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	ВыплатаЗаработнойПлаты.Ведомость.ПериодРегистрации,
	|	СУММА(ВЫРАЗИТЬ(ВыплатаЗаработнойПлаты.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(ВыплатаЗаработнойПлаты.СуммаПлатежа),
	|	-СУММА(ВЫРАЗИТЬ(ВыплатаЗаработнойПлаты.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(ВыплатаЗаработнойПлаты.СуммаПлатежа),
	|	ВыплатаЗаработнойПлаты.Сотрудник.СчетРасчетовСПерсоналом,
	|	ВыплатаЗаработнойПлаты.Сотрудник.СчетРасчетовСПерсоналомРегл,
	|	&ПогашениеОбязательствПередПерсоналом,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ,
	|	СУММА(ВЫРАЗИТЬ(ВыплатаЗаработнойПлаты.НДФЛПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	ВыплатаЗаработнойПлаты.ВидУдержанияПФ,
	|	СУММА(ВыплатаЗаработнойПлаты.СуммаПФПлатежа),
	|	СУММА(ВЫРАЗИТЬ(ВыплатаЗаработнойПлаты.СуммаПФПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	ВыплатаЗаработнойПлаты.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл,
	|	ВыплатаЗаработнойПлаты.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл,
	|	ВыплатаЗаработнойПлаты.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл,
	|	ВыплатаЗаработнойПлаты.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл,
	|	ВыплатаЗаработнойПлаты.ВидУдержанияПФ.Договор,
	|	ВыплатаЗаработнойПлаты.ВидУдержанияПФ.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	СУММА(ВыплатаЗаработнойПлаты.СуммаЛьгот), //+++ Дмгг
	//+++ Дмгг
	//|   ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА ВыплатаЗаработнойПлаты.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)  //+++lazare_26.02.2021
	|	КОНЕЦ
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	|ИЗ
	|	Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВыплатаЗаработнойПлаты.Ссылка = &Ссылка
	|	И ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|   ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	|   ВыплатаЗаработнойПлаты.Проект,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	//|	КОНЕЦ,
	////Lazare
	|	ВыплатаЗаработнойПлаты.НомерСтроки,
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	ВыплатаЗаработнойПлаты.Ведомость.СтруктурнаяЕдиница,
	|	ВыплатаЗаработнойПлаты.Сотрудник,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	ВыплатаЗаработнойПлаты.Ведомость.ПериодРегистрации,
	|	ВыплатаЗаработнойПлаты.Сотрудник.СчетРасчетовСПерсоналом,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ВыплатаЗаработнойПлаты.Сотрудник.СчетРасчетовСПерсоналомРегл,
	|	ВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ,
	|	ВыплатаЗаработнойПлаты.ВидУдержанияПФ,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл,
	|	ВыплатаЗаработнойПлаты.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл,
	|	ВыплатаЗаработнойПлаты.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл,
	|	ВыплатаЗаработнойПлаты.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл,
	|	ВыплатаЗаработнойПлаты.ВидУдержанияПФ.Договор,
	|	ВыплатаЗаработнойПлаты.ВидУдержанияПФ.Контрагент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	Сотрудник,
	|	Валюта,
	|	ПериодРегистрации,
	|	СчетУчета,
	|	СчетУчетаРегл,
	|	Проект"; //+++ Дмгг
	
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(ДокументСсылкаРасходСоСчета.Дата),ДокументСсылкаРасходСоСчета.Дата,ТекущаяДата())));
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПерсоналом.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПерсоналом.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВременнаяТаблицаРасчетыСПерсоналом.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблицаРасчетыСПерсоналом.Валюта КАК Валюта,
	|	ВременнаяТаблицаРасчетыСПерсоналом.ПериодРегистрации КАК ПериодРегистрации,
	//+++ Дмгг
	//|   ВременнаяТаблицаРасчетыСПерсоналом.Проект КАК Проект
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасчетыСПерсоналом.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасчетыСПерсоналом.Проект
	|	КОНЕЦ КАК Проект
	//Lazare	
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПерсоналом КАК ВременнаяТаблицаРасчетыСПерсоналом";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПерсоналом");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПерсоналом(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПерсоналом", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПерсоналом()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	МассивСчетовФинРезРасходы = РегламентированныйУчетСервер.ПолучитьСчетаФинРезРасход();
	СтруктураСчетовКурсРазниц = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(СтруктураДополнительныеСвойства.ДляПроведения.Организация, СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОтражениеРасходов", НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("СчетаФинРезРасходы", МассивСчетовФинРезРасходы);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность);
		
	Иначе
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);

	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	1 КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы) И НЕ &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ТаблицаДокумента.Подразделение
	|		КОГДА ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы) И &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ТаблицаДокумента.Подразделение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы) И НЕ &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ТаблицаДокумента.Заказ
	|		КОГДА ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы) И &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы) И НЕ &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ТаблицаДокумента.НаправлениеДеятельности
	|		КОГДА ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы) И &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ТаблицаДокумента.НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.Корреспонденция КАК СчетУчета,
	|	ТаблицаДокумента.КорреспонденцияРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.АналитикаПрочихДоходовИРасходов КАК Аналитика,
	|	&ОтражениеРасходов КАК СодержаниеПроводки,
	|	0 КАК СуммаДоходов,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * КурсыВалютРасчетов.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаРасходов,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * КурсыВалютРасчетов.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	//+++ Дмгг
	//|	ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником КАК Проект
	//--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником
	|	КОНЕЦ КАК Проект
	//Lazare 09.03.2021
	|ИЗ
	|	Документ.РасходСоСчета КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	//+++ Дмгг
	|	И (ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|				ИЛИ ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ТаблицаДокумента.КорреспонденцияРегл В (&СчетаФинРезРасходы)
	|		ИНАЧЕ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|				ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ТаблицаДокумента.КорреспонденцияРегл В (&СчетаФинРезРасходы)
	|		КОНЕЦ)
	//--- Дмгг
	|	И (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ
	//Lazare 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницДенежныеСредства КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ
	//Lazare 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ
	//Lazare 09.03.202
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ
	//Lazare 09.03.202
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ
	//Lazare 09.03.202
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПерсоналом КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ
	//Lazare 09.03.202
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ
	//Lazare 09.03.202
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницПрочиеРасчеты КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", ТаблицаДоходыИРасходы);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Активность = Истина;
	КонецЦикла; 
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", Новый ТаблицаЗначений);
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	//
	//Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	//Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	//Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	//Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	//Запрос.УстановитьПараметр("Содержание", НСтр("ka='ფულადი სახსრების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание денежных средств на произвольный счет';en='Debiting an arbitrary score'"));
	//Запрос.УстановитьПараметр("СодержаниеСнятиеНаличных", НСтр("ka='Оприходование денежных средств в кассу';ru='Оприходование денежных средств в кассу';en='Posting of cash on hand'"));
	//Запрос.УстановитьПараметр("ОплатаНалога", НСтр("ka='გადასახადის გადახდა';ru='Оплата налога';en='Payment of tax'"));
	//Запрос.УстановитьПараметр("СодержаниеОплатаОтБанкаЭквайрера", НСтр("ka='გადახდა ეკვაირერი ბანკისგან';ru='Оплата от банка-эквайрера';en='Payment by the acquirer'"));
	//Запрос.УстановитьПараметр("СодержаниеКомиссияБанкаЭквайрера", НСтр("ka='ბანკი-ექვაირერის კომისია';ru='Комиссия банка-эквайрера';en='the acquirer Commission'"));
	//Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	//Запрос.УстановитьПараметр("ИспользуютсяПереводыВПути",РегистрыСведений.ПрименениеПереводовВПути.ИспользуютсяПереводыВПути(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата,СтруктураДополнительныеСвойства.ДляПроведения.Организация));
	////Паганини
	////Добавлена таблица 18;
	//Запрос.УстановитьПараметр("НДФЛ", НСтр("ka='საშემოსავლო';ru='НДФЛ';en='НДФЛ'"));
	//Запрос.УстановитьПараметр("КурсоваяРазницаНДФЛ", НСтр("ka='Курсовая разница НДФЛ';ru='Курсовая разница НДФЛ';en='The exchange rate difference of personal income tax'"));
	////_Паганини
	//
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	1 КАК Порядок,
	//|	1 КАК НомерСтроки,
	//|	ТаблицаДокумента.Дата КАК Период,
	//|	&Организация КАК Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	//|	ТаблицаДокумента.Корреспонденция КАК СчетДт,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета КАК СчетКт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Корреспонденция.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК ВалютаДт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК ВалютаКт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Корреспонденция.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаДокумента
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК СуммаВалДт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаДокумента
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК СуммаВалКт,
	//|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * КурсыВалютРасчетов.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	//|			ТОГДА ВЫРАЗИТЬ(&СодержаниеСнятиеНаличных КАК СТРОКА(100))
	//|		ИНАЧЕ ВЫРАЗИТЬ(&Содержание КАК СТРОКА(100))
	//|	КОНЕЦ КАК Содержание
	//|ИЗ
	//|	Документ.РасходСоСчета КАК ТаблицаДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчетаСрезПоследних
	//|		ПО (ИСТИНА)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	//|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютРасчетов.Валюта
	////+++ Истомин, Интеграция с Банком
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПроверкиНаСтатус КАК ВременнаяТаблицаПроверкиНаСтатус
	//|		ПО ТаблицаДокумента.Ссылка = ВременнаяТаблицаПроверкиНаСтатус.Ссылка
	////--- Истомин
	//|ГДЕ
	//|	ТаблицаДокумента.Ссылка = &Ссылка
	//|	И (ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	//|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	//|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	//|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	//|				И &ИспользуютсяПереводыВПути)
	////+++ Истомин, Интеграция с Банком
	//|	И ВременнаяТаблицаПроверкиНаСтатус.СформироватьПроводки
	////--- Истомин
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	1 КАК Порядок,
	//|	1 КАК НомерСтроки,
	//|	ТаблицаДокумента.Дата КАК Период,
	//|	&Организация КАК Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета КАК СчетДт,
	//|	ТаблицаДокумента.Корреспонденция КАК СчетКт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК ВалютаДт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Корреспонденция.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК ВалютаКт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаДокумента
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК СуммаВалДт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Корреспонденция.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаДокумента
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК СуммаВалКт,
	//|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * КурсыВалютРасчетов.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	//|			ТОГДА ВЫРАЗИТЬ(&СодержаниеСнятиеНаличных КАК СТРОКА(100))
	//|		ИНАЧЕ ВЫРАЗИТЬ(&Содержание КАК СТРОКА(100))
	//|	КОНЕЦ КАК Содержание
	//|ИЗ
	//|	Документ.РасходСоСчета КАК ТаблицаДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчетаСрезПоследних
	//|		ПО (ИСТИНА)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	//|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютРасчетов.Валюта
	////+++ Истомин, Интеграция с Банком
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПроверкиНаСтатус КАК ВременнаяТаблицаПроверкиНаСтатус
	//|		ПО ТаблицаДокумента.Ссылка = ВременнаяТаблицаПроверкиНаСтатус.Ссылка
	////--- Истомин
	//|ГДЕ
	//|	ТаблицаДокумента.Ссылка = &Ссылка
	//|	И (ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	//|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	//|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	//|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	//|				И &ИспользуютсяПереводыВПути)
	//|				И ТаблицаДокумента.Перемещение
	////+++ Истомин, Интеграция с Банком
	//|	И ВременнаяТаблицаПроверкиНаСтатус.СформироватьПроводки
	////--- Истомин
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	2,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	&Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.ВидНалога.СчетУчета,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ВидНалога.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ВидНалога.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаДокумента
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаДокумента
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * КурсыВалютРасчетов.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)),
	//|	ВЫРАЗИТЬ(&ОплатаНалога КАК СТРОКА(100))
	//|ИЗ
	//|	Документ.РасходСоСчета КАК ТаблицаДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчетаСрезПоследних
	//|		ПО (ИСТИНА)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	//|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютРасчетов.Валюта
	////+++ Истомин, Интеграция с Банком
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПроверкиНаСтатус КАК ВременнаяТаблицаПроверкиНаСтатус
	//|		ПО ТаблицаДокумента.Ссылка = ВременнаяТаблицаПроверкиНаСтатус.Ссылка
	////--- Истомин
	//|ГДЕ
	//|	ТаблицаДокумента.Ссылка = &Ссылка
	//|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	////+++ Истомин, Интеграция с Банком
	//|	И ВременнаяТаблицаПроверкиНаСтатус.СформироватьПроводки
	////--- Истомин
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	3,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПодотчетниками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	4,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	5,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	6,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	7,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	8,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	9,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницДенежныеСредства КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	10,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПерсоналом КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	11,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПерсоналом КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	12,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	&Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчетаЭквайринг,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчетаЭквайринг.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчетаЭквайринг.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.СуммаУчета,
	//|	ВЫРАЗИТЬ(&СодержаниеОплатаОтБанкаЭквайрера КАК СТРОКА(100))
	//|ИЗ
	//|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	//|ГДЕ
	//|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	13,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	&Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетЗатратЭквайринг,
	//|	ТаблицаДокумента.СчетУчетаЭквайринг,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетЗатратЭквайринг.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчетаЭквайринг.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетЗатратЭквайринг.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаРасчетовКомиссии
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчетаЭквайринг.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаРасчетовКомиссии
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.СуммаУчетаКомиссии,
	//|	ВЫРАЗИТЬ(&СодержаниеКомиссияБанкаЭквайрера КАК СТРОКА(100))
	//|ИЗ
	//|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	//|ГДЕ
	//|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты)
	//|	И ТаблицаДокумента.СуммаРасчетовКомиссии <> 0
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	14,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	15,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	16,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницПрочиеРасчеты КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	17,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаПрочиеРасчеты КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	18,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ,
	//|	ТаблицаДокумента.ТипНДФЛ.СчетОплатыНДФЛ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетОплатыНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаНДФЛ
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетОплатыНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаНДФЛВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.СуммаНДФЛ,
	//|	&НДФЛ
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
	//|ГДЕ
	//|	НЕ ТаблицаДокумента.ТипНДФЛ = ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	19,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ > 0
	//|			ТОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ < 0
	//|			ТОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ > 0
	//|				И ВЫРАЗИТЬ(ТаблицаДокумента.ТипНДФЛ КАК Справочник.ТипыНДФЛ).СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ > 0
	//|				И ВЫРАЗИТЬ(ТаблицаДокумента.ТипНДФЛ КАК Справочник.ТипыНДФЛ).СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА (ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2))) > 0
	//|			ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2))
	//|		ИНАЧЕ -(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2)))
	//|	КОНЕЦ,
	//|	&КурсоваяРазницаНДФЛ
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	//|				&МоментВремени,
	//|				Валюта В
	//|					(ВЫБРАТЬ
	//|						КонстантаВалютаУчета.Значение
	//|					ИЗ
	//|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсВалютыУчета
	//|		ПО (ИСТИНА)
	//|ГДЕ
	//|	ТаблицаДокумента.ТипНДФЛ <> ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|	И (ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2))) <> 0
	//|	И ТаблицаДокумента.КурсПоступления <> 0
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Порядок,
	//|	НомерСтроки";
	//
	//

	//РезультатЗапроса = Запрос.Выполнить();
	//
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаУправленческий()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаДС", ДокументСсылкаРасходСоСчета.ВалютаДенежныхСредств);
	
	Если ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь") Тогда
		Итог = ДокументСсылкаРасходСоСчета.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	Иначе
		Итог = 0;
	КонецЕсли;
	ОстатокСуммы = ДокументСсылкаРасходСоСчета.СуммаДокумента - Итог;
	Запрос.УстановитьПараметр("ПлатежныйКалендарь", ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"));
	Запрос.УстановитьПараметр("ОстатокСуммы", ОстатокСуммы);
	Запрос.УстановитьПараметр("УчетВалютныхОпераций", ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ТаблицаДокумента.ДоговорОбслуживанияНаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	0 КАК СуммаДоходов,
	|	ТаблицаДокумента.СуммаУчета КАК СуммаРасходов,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект КАК Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект
	//Lazare 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|	И (ТаблицаДокумента.ПризнакАванса
	|			ИЛИ ТаблицаДокумента.ВестиУчетРасходовПоДоговорамОбслуживания)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.Период,
	|	Таблица.Организация,
	|	Таблица.НаправлениеДеятельности,
	|	Таблица.Статья,
	|	0,
	|	Таблица.СуммаРасходов,
	////+++ Дмгг
	//|	Таблица.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА Таблица.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ Таблица.Проект
	|	КОНЕЦ 
	//Lazare 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаТаблицаДоходыИРасходыОтложенные КАК Таблица
	|ГДЕ
	|	Таблица.СуммаРасходов > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья,
	|	0,
	|	ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютРасчетов.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)),
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ 
	//Lazare 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И (ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Зарплата)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги))
	|	И &ОстатокСуммы > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья,
	|	0,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)),
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ 
	//Lazare 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И (ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Зарплата)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги))
	|	И ТаблицаДокумента.СуммаПлатежа > 0
	|	И &ПлатежныйКалендарь
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ТаблицаДокумента.ДоговорОбслуживанияНаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья,
	|	-ТаблицаДокумента.СуммаУчета,
	|	0,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ 
	//Lazare 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|	И (ТаблицаДокумента.ПризнакАванса
	|			ИЛИ ТаблицаДокумента.ВестиУчетРасходовПоДоговорамОбслуживания)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.Период,
	|	Таблица.Организация,
	|	Таблица.НаправлениеДеятельности,
	|	Таблица.Статья,
	|	-Таблица.СуммаДоходов,
	|	0,
	////+++ Дмгг
	//|	Таблица.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА Таблица.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ Таблица.Проект
	|	КОНЕЦ 
	//Lazare 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаТаблицаДоходыИРасходыОтложенные КАК Таблица
	|ГДЕ
	|	Таблица.СуммаДоходов > 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыКассовыйМетод", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыКассовыйМетод()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА &Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	0 КАК СуммаДоходов,
	|	ТаблицаДокумента.СуммаУчета КАК СуммаРасходов,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект КАК Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект
	//Lazare 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|	И НЕ ТаблицаДокумента.ВестиУчетРасходовПоДоговорамОбслуживания
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА &Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья,
	|	-ТаблицаДокумента.СуммаУчета,
	|	0,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект КАК Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект
	//Lazare 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|	И НЕ ТаблицаДокумента.ВестиУчетРасходовПоДоговорамОбслуживания
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыНераспределенные", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыНераспределенные()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	Запрос.УстановитьПараметр("Период", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	
	// Формирование таблицы с суммами к списанию.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	СУММА(ТаблицаДокумента.СуммаУчета) КАК СуммаКСписанию,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект КАК Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект
	//Lazare 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|	И НЕ ТаблицаДокумента.ВестиУчетРасходовПоДоговорамОбслуживания
	|	И НЕ ТаблицаДокумента.ПризнакАванса
	|
	|СГРУППИРОВАТЬ ПО
	////+++ Дмгг
	|	ТаблицаДокумента.Проект,
	////--- Дмгг
	////_Lazare 09.03.2021
	//|   ВЫБОР
	//|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаДокумента.Проект
	//|	КОНЕЦ,
	////Lazare 09.03.2021
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков денежных средств.
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДоходыИРасходыОтложенные");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Организация");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Документ", "Документ");
	Блокировка.Заблокировать();
	
	ТаблицаСуммыКСписанию = РезультатЗапроса.Выгрузить();
	
	// Формирование таблицы с остатками.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ДоходыИРасходыОтложенныеОстатки.Организация КАК Организация,
	|	ДоходыИРасходыОтложенныеОстатки.Документ КАК Документ,
	|	ДоходыИРасходыОтложенныеОстатки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) КАК Статья,
	|	0 КАК СуммаДоходов,
	|	0 КАК СуммаРасходов,
	|	-СУММА(ДоходыИРасходыОтложенныеОстатки.СуммаДоходовОстаток) КАК СуммаДоходовОстаток,
	|	СУММА(ДоходыИРасходыОтложенныеОстатки.СуммаРасходовОстаток) КАК СуммаРасходовОстаток,
	//+++ Дмгг
	|	ДоходыИРасходыОтложенныеОстатки.Проект
	//--- Дмгг
	////_Lazare 09.03.2021
	//|   ВЫБОР
	//|		КОГДА ДоходыИРасходыОтложенныеОстатки.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ДоходыИРасходыОтложенныеОстатки.Проект
	//|	КОНЕЦ
	////Lazare 09.03.2021
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДоходыИРасходыОтложенныеОстатки.Организация КАК Организация,
	|		ДоходыИРасходыОтложенныеОстатки.Документ КАК Документ,
	|		ДоходыИРасходыОтложенныеОстатки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ДоходыИРасходыОтложенныеОстатки.СуммаДоходовОстаток КАК СуммаДоходовОстаток,
	|		ДоходыИРасходыОтложенныеОстатки.СуммаРасходовОстаток КАК СуммаРасходовОстаток,
	//+++ Дмгг
	|		ДоходыИРасходыОтложенныеОстатки.Проект
	//--- Дмгг
	////_Lazare 09.03.2021
	//|   ВЫБОР
	//|		КОГДА ДоходыИРасходыОтложенныеОстатки.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ДоходыИРасходыОтложенныеОстатки.Проект
	//|	КОНЕЦ
	////Lazare 09.03.2021
	|	ИЗ
	|		РегистрНакопления.ДоходыИРасходыОтложенные.Остатки(
	|				,
	|				Организация = &Организация
	|					И Документ В
	|						(ВЫБРАТЬ
	|							ТаблицаДокумента.Документ
	|						ИЗ
	|							ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|						ГДЕ
	|							(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|								ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)))) КАК ДоходыИРасходыОтложенныеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаДоходыИРасходыОтложенные.Организация,
	|		ДвиженияДокументаДоходыИРасходыОтложенные.Документ,
	|		ДвиженияДокументаДоходыИРасходыОтложенные.НаправлениеДеятельности,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаДоходыИРасходыОтложенные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаДоходыИРасходыОтложенные.СуммаДоходов, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаДоходыИРасходыОтложенные.СуммаДоходов, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаДоходыИРасходыОтложенные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаДоходыИРасходыОтложенные.СуммаРасходов, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаДоходыИРасходыОтложенные.СуммаРасходов, 0)
	|		КОНЕЦ,
	////+++ Дмгг
	//|		ДвиженияДокументаДоходыИРасходыОтложенные.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ДвиженияДокументаДоходыИРасходыОтложенные.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ДвиженияДокументаДоходыИРасходыОтложенные.Проект
	|	КОНЕЦ
	//Lazare 09.03.2021
	|	ИЗ
	|		РегистрНакопления.ДоходыИРасходыОтложенные КАК ДвиженияДокументаДоходыИРасходыОтложенные
	|	ГДЕ
	|		ДвиженияДокументаДоходыИРасходыОтложенные.Регистратор = &Ссылка) КАК ДоходыИРасходыОтложенныеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	|	ДоходыИРасходыОтложенныеОстатки.Проект,
	//--- Дмгг
	////_Lazare 09.03.2021
	//|   ВЫБОР
	//|		КОГДА ДоходыИРасходыОтложенныеОстатки.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ДоходыИРасходыОтложенныеОстатки.Проект
	//|	КОНЕЦ,
	////Lazare 09.03.2021
	|	ДоходыИРасходыОтложенныеОстатки.Организация,
	|	ДоходыИРасходыОтложенныеОстатки.Документ,
	|	ДоходыИРасходыОтложенныеОстатки.НаправлениеДеятельности
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ";
	
	ТаблицаСуммыОстатки = Запрос.Выполнить().Выгрузить();

	ТаблицаСуммыОстатки.Индексы.Добавить("Документ");
	
	// Расчет сумм списания.
	Для каждого СтрокаСуммыКСписанию Из ТаблицаСуммыКСписанию Цикл
		СуммаКСписанию = СтрокаСуммыКСписанию.СуммаКСписанию;
		Отбор = Новый Структура("Документ", СтрокаСуммыКСписанию.Документ);
		МассивСтрокСуммыОстатки = ТаблицаСуммыОстатки.НайтиСтроки(Отбор);
		Для каждого СтрокаСуммыОстатки Из МассивСтрокСуммыОстатки Цикл
			Если СуммаКСписанию = 0 Тогда
				Продолжить
			ИначеЕсли СтрокаСуммыОстатки.СуммаРасходовОстаток < СуммаКСписанию Тогда
				СтрокаСуммыОстатки.СуммаРасходов = СтрокаСуммыОстатки.СуммаРасходовОстаток;
				СтрокаСуммыОстатки.Статья = СтрокаСуммыКСписанию.Статья;
				СуммаКСписанию = СуммаКСписанию - СтрокаСуммыОстатки.СуммаРасходовОстаток;
			ИначеЕсли СтрокаСуммыОстатки.СуммаРасходовОстаток >= СуммаКСписанию Тогда
				СтрокаСуммыОстатки.СуммаРасходов = СуммаКСписанию;
				СтрокаСуммыОстатки.Статья = СтрокаСуммыКСписанию.Статья;
				СуммаКСписанию = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Формирование таблицы с суммами к списанию.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	СУММА(ТаблицаДокумента.СуммаУчета) КАК СуммаКСписанию,
	////+++ Дмгг
	//|		ТаблицаДокумента.Проект КАК Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект
	//Lazare 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|	И НЕ ТаблицаДокумента.ПризнакАванса
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	|		ТаблицаДокумента.Проект,
	//--- Дмгг
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья"; 
	
	ТаблицаСуммыКСписанию = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаСуммыКСписанию Из ТаблицаСуммыКСписанию Цикл
		СуммаКСписанию = СтрокаСуммыКСписанию.СуммаКСписанию;
		Отбор = Новый Структура("Документ", СтрокаСуммыКСписанию.Документ);
		МассивСтрокСуммыОстатки = ТаблицаСуммыОстатки.НайтиСтроки(Отбор);
		Для каждого СтрокаСуммыОстатки Из МассивСтрокСуммыОстатки Цикл
			Если СуммаКСписанию = 0 Тогда
				Продолжить
			ИначеЕсли СтрокаСуммыОстатки.СуммаДоходовОстаток < СуммаКСписанию Тогда
				СтрокаСуммыОстатки.СуммаДоходов = СтрокаСуммыОстатки.СуммаДоходовОстаток;
				СтрокаСуммыОстатки.Статья = СтрокаСуммыКСписанию.Статья;
				СуммаКСписанию = СуммаКСписанию - СтрокаСуммыОстатки.СуммаДоходовОстаток;
			ИначеЕсли СтрокаСуммыОстатки.СуммаДоходовОстаток >= СуммаКСписанию Тогда
				СтрокаСуммыОстатки.СуммаДоходов = СуммаКСписанию;
				СтрокаСуммыОстатки.Статья = СтрокаСуммыКСписанию.Статья;
				СуммаКСписанию = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Формирование временной таблицы с суммами, статьями и направлениями
	// деятельности. Понадобится для формирования движений по доходам и расходам
	// кассовым методом.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Период КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Документ КАК Документ,
	|	Таблица.Статья КАК Статья,
	|	Таблица.СуммаДоходов КАК СуммаДоходов,
	|	Таблица.СуммаРасходов КАК СуммаРасходов,
	|	Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	////+++ Дмгг
	//|	Таблица.Проект КАК Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА Таблица.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ Таблица.Проект
	|	КОНЕЦ КАК Проект
	//Lazare 09.03.2021
	|ПОМЕСТИТЬ ВременнаяТаблицаТаблицаДоходыИРасходыОтложенные
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	(Таблица.СуммаДоходов > 0
	|			ИЛИ Таблица.СуммаРасходов > 0)";
	
	Запрос.УстановитьПараметр("Таблица", ТаблицаСуммыОстатки);
	
	Запрос.Выполнить();
	
	// Формирование таблицы для записи в регистр.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Таблица.Период КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Документ КАК Документ,
	|	Таблица.Статья КАК Статья,
	|	-Таблица.СуммаДоходов КАК СуммаДоходов,
	|	Таблица.СуммаРасходов КАК СуммаРасходов,
	|	Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	////+++ Дмгг
	//|	Таблица.Проект КАК Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|   ВЫБОР
	|		КОГДА Таблица.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ Таблица.Проект
	|	КОНЕЦ КАК Проект
	//Lazare 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаТаблицаДоходыИРасходыОтложенные КАК Таблица";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыОтложенные", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыНераспределенные()  

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", 		ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	//Запрос.УстановитьПараметр("ВалютаДокумента",ДокументСсылкаРасходСоСчета.ВалютаДенежныхСредств);
	Если ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам И ЗначениеЗаполнено(ДокументСсылкаРасходСоСчета.ДоговорКредитаЗайма) Тогда 
		Запрос.УстановитьПараметр("ВалютаДокумента",	ДокументСсылкаРасходСоСчета.ДоговорКредитаЗайма.ВалютаРасчетов);
	Иначе 
		Запрос.УстановитьПараметр("ВалютаДокумента",	ДокументСсылкаРасходСоСчета.ВалютаДенежныхСредств);
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация",	СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени",	Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОплатаНалога",	НСтр("ka='გადასახადის გადახდა';ru='Оплата налога';en='Payment of tax'"));
	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	
	//Паганини_
	//Если не ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата тогда
	Если ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги Тогда	
	//_Паганини
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ПОМЕСТИТЬ КурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаДокумента)) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НачислениеНалоговНалоги.СрокУплаты,
		////ПодольскийАИ #УчетПроектов 10.02.2021 {
		////Исправление ошибок. Было---
		//////+++ Дмгг
		////|	РасходСоСчета.Проект КАК Проект
		//////--- Дмгг
		////Стало+++
		//|	РасходСоСчета.ПроектДляЗачетаАвансаСПомощником КАК Проект
		////ПодольскийАИ #УчетПроектов 10.02.2021 }
		
		//_Lazare 09.03.2021
		|   ВЫБОР
		|		КОГДА 	РасходСоСчета.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|		ИНАЧЕ РасходСоСчета.ПроектДляЗачетаАвансаСПомощником
		|	КОНЕЦ КАК Проект
		//Lazare 09.03.2021
		|ПОМЕСТИТЬ ВременнаяТаблицаСрокУплаты
		|ИЗ
		|	Документ.РасходСоСчета КАК РасходСоСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеНалогов.Налоги КАК НачислениеНалоговНалоги
		|		ПО (РасходСоСчета.Ссылка = &Ссылка)
		|			И (НачислениеНалоговНалоги.Ссылка = РасходСоСчета.ДокументОснование
		|				ИЛИ НачислениеНалоговНалоги.Ссылка = РасходСоСчета.ДокументОснование.ДокументОснование)
		|			И РасходСоСчета.ВидНалога = НачислениеНалоговНалоги.ВидНалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Организация КАК Организация,
		|	ТаблицаДокумента.ВидНалога КАК ВидНалога,
		|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫБОР
		|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
		|			ТОГДА ТаблицаДокумента.ВидНалога.СчетУчетаРегл  //+++ Дмгг
		|		ИНАЧЕ ТаблицаДокумента.ВидНалога.СчетУчета
		|	КОНЕЦ КАК СчетУчета,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СрокУплаты = &ПустаяДата
		|			ТОГДА ТаблицаСрокУплаты.СрокУплаты
		|		ИНАЧЕ ТаблицаДокумента.СрокУплаты
		|	КОНЕЦ КАК СрокУплаты,
		|	&ОплатаНалога КАК СодержаниеПроводки,
		|	ТаблицаДокумента.Подотчетник КАК Сотрудник,
		////ПодольскийАИ #УчетПроектов 10.02.2021 {
		////Исправление ошибок. Было---
		//////+++ Дмгг
		////|	ТаблицаДокумента.Проект КАК Проект
		//////--- Дмгг
		////Стало+++
		//|	ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником КАК Проект
		////ПодольскийАИ #УчетПроектов 10.02.2021 }
		
		//_Lazare 09.03.2021
		|   ВЫБОР
		|		КОГДА ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|		ИНАЧЕ ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником
		|	КОНЕЦ КАК Проект
		//Lazare 09.03.2021
		|ИЗ
		|	Документ.РасходСоСчета КАК ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыДокумента
		|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыУчета
		|		ПО (КурсВалютыУчета.Валюта = &ВалютаУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСрокУплаты КАК ТаблицаСрокУплаты
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		//Паганини_
		//|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
		//_Паганини
		|";
		
		//Паганини_
		РезультатЗапроса = Запрос.Выполнить();
		врТаблицаРасчетыНДФЛ = РезультатЗапроса.Выгрузить();  
		врТаблицаРасчетыПоНалогам = врТаблицаРасчетыНДФЛ.Скопировать();	
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", Новый ТаблицаЗначений);		
		
		врТаблицаРасчетыПоНалогам.Свернуть("Период,ВидДвижения,Организация,ВидНалога,СчетУчета,СрокУплаты,СодержаниеПроводки","Сумма");
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", врТаблицаРасчетыПоНалогам);
		//_Паганини
		
	ИначеЕсли ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата Или ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам Тогда
		
		Запрос.УстановитьПараметр("НачислениеНалога",	НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога';en='tax accrual'"));
		Запрос.УстановитьПараметр("ПогашениеНалога",	НСтр("ka='გადასახადის დაფარვა';ru='Погашение налога';en='repayment of the tax'"));
	 	//Паганини#Удержания_
		Запрос.УстановитьПараметр("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении"));
	 	//_Паганини#Удержания
		Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ПОМЕСТИТЬ КурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаДокумента)) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НачислениеНалоговНалоги.СрокУплаты
		|ПОМЕСТИТЬ ВременнаяТаблицаСрокУплаты
		|ИЗ
		|	Документ.РасходСоСчета КАК РасходСоСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеНалогов.Налоги КАК НачислениеНалоговНалоги
		|		ПО (РасходСоСчета.Ссылка = &Ссылка)
		|			И (НачислениеНалоговНалоги.Ссылка = РасходСоСчета.ДокументОснование
		|				ИЛИ НачислениеНалоговНалоги.Ссылка = РасходСоСчета.ДокументОснование.ДокументОснование)
		|			И РасходСоСчета.ВидНалога = НачислениеНалоговНалоги.ВидНалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалога КАК НДФЛсНачислений,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалогаВыплат КАК НДФЛсВыплат,
		|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета КАК НДФЛсВыплатСчетУчета,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалога.СчетУчета КАК НДФЛсНачисленийСчетУчета,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК НДФЛсВыплатСчетУчетаРегл,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК НДФЛсНачисленийСчетУчетаРегл,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРегл,
		|	ПлатежнаяВедомостьСотрудники.НДФЛПлатежа,
		|	ПлатежнаяВедомостьСотрудники.НДФЛРасчетов,
		|	ПлатежнаяВедомостьСотрудники.Сотрудник,
		|	ПлатежнаяВедомостьСотрудники.Ссылка.ПериодРегистрации,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.Статья,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчетаРегл,
		|	0 КАК СуммаРасчетов,
		|	0 КАК СуммаПлатежа, //+++ Дмгг
		//+++ Дмгг
		//|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.Проект КАК Проект
		//--- Дмгг
		////ПодольскийАИ #УчетПроектов 25.11.2020 {
		//|	ВЫБОР 
		//|		КОГДА &УчетПоПроектам 
		//|			ТОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Проект
		//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		//|	КОНЕЦ КАК Проект
		////ПодольскийАИ #УчетПроектов 25.11.2020 }
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА 
		|       		ВЫбор
		|					КОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|                    ИНАЧЕ РасходСоСчетаВыплатаЗаработнойПлаты.Проект 
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	 КОНЕЦ КАК Проект 
		//Lazare_ 09.03.2021
		|ПОМЕСТИТЬ ВТ_НДФЛ
		|ИЗ
		|	Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК РасходСоСчетаВыплатаЗаработнойПлаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
		|		ПО РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость = ПлатежнаяВедомостьСотрудники.Ссылка
		|			И (РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка = &Ссылка)
		|			И (НЕ ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка))
		|			И (ЕСТЬNULL(ПлатежнаяВедомостьСотрудники.НДФЛПлатежа, 0) > 0)
		//ПодольскийАИ #УчетПроектов 25.11.2020 {
		|			И ВЫБОР 
		|				КОГДА &УчетПоПроектам 
		|					ТОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Проект = ПлатежнаяВедомостьСотрудники.Проект
		|				ИНАЧЕ Истина
		|			КОНЕЦ
		//ПодольскийАИ #УчетПроектов 25.11.2020 }
		//Паганини#Удержания_
		|	И ВЫБОР
		|			КОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
		|				ТОГДА НЕ &СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		//_Паганини#Удержания
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат,
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога.СчетУчета,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаРегл,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл,
		|	РасходИзКассыВыплатаЗаработнойПлаты.СуммаНДФЛ,
		//+++ Дмгг Неправильно заполнен набор полей тут должна быть какая-то сумма а Истина не на своем месте
		|	0, 
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.Контрагент,
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.Дата,
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.Статья,
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
		//|	ИСТИНА, 
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчетаРегл,
		|	РасходИзКассыВыплатаЗаработнойПлаты.СуммаРасчетов,
		|	РасходИзКассыВыплатаЗаработнойПлаты.СуммаПлатежа,
		//+++ Дмгг
		//|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.Проект КАК Проект
		//--- Дмгг
		////ПодольскийАИ #УчетПроектов 25.11.2020 {
		//|	ВЫБОР 
		//|		КОГДА &УчетПоПроектам 
		//|			ТОГДА РасходИзКассыВыплатаЗаработнойПлаты.Проект
		//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		//|	КОНЕЦ КАК Проект
		////ПодольскийАИ #УчетПроектов 25.11.2020 }
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА 
		|       		ВЫбор
		|					КОГДА РасходИзКассыВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|                    ИНАЧЕ РасходИзКассыВыплатаЗаработнойПлаты.Проект 
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	 КОНЕЦ КАК Проект 
		//Lazare_ 09.03.2021
		|ИЗ
		|	Документ.РасходСоСчета.РасшифровкаПлатежа КАК РасходИзКассыВыплатаЗаработнойПлаты
		|ГДЕ
		|	ЕСТЬNULL(РасходИзКассыВыплатаЗаработнойПлаты.СуммаНДФЛ, 0) > 0
		|	И РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Организация КАК Организация,
		|	ВТ_НДФЛ.ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
		|	ВТ_НДФЛ.НДФЛсНачислений КАК ВидНалога,
		//|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа КАК ЧИСЛО(15, 2)) КАК Сумма,
		//|	ВЫРАЗИТЬ(ВТ_НДФЛ.СуммаРасчетов * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаРасчетовРегл,
		|	ВЫРАЗИТЬ(ВЫБОР 
		|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам) 
		|			И ТаблицаДокумента.ВалютаДенежныхСредств = &ВалютаУчета
		|			ТОГДА ВТ_НДФЛ.СуммаПлатежа
		|		ИНАЧЕ ВТ_НДФЛ.СуммаРасчетов * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность)
		|	КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаРасчетовРегл,
		|	ВЫРАЗИТЬ(ВТ_НДФЛ.СуммаПлатежа * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаПлатежаРегл,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета КАК СчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл КАК СчетУчетаРегл,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СрокУплаты = &ПустаяДата
		|			ТОГДА ТаблицаСрокУплаты.СрокУплаты
		|		ИНАЧЕ ТаблицаДокумента.СрокУплаты
		|	КОНЕЦ КАК СрокУплаты,
		|	&НачислениеНалога КАК СодержаниеПроводки,
		|	ВТ_НДФЛ.Сотрудник,
		|	ВТ_НДФЛ.НДФЛПлатежа КАК СуммаВал,
		|	ВТ_НДФЛ.ПериодРегистрации,
		|	ТаблицаДокумента.ВалютаДенежныхСредств КАК Валюта,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		|	ВТ_НДФЛ.Статья,
		|	ВТ_НДФЛ.БанковскийСчет,
		|	ВТ_НДФЛ.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРегл,
		|	ВТ_НДФЛ.БанковскийСчетСчетУчетаРегл,
		|	ВТ_НДФЛ.СуммаРасчетов,
		|	ВТ_НДФЛ.СуммаПлатежа,
		//+++ Дмгг
		//|	ТаблицаДокумента.Проект КАК Проект
		//--- Дмгг
		////ПодольскийАИ #УчетПроектов 25.11.2020 {
		//|	ВТ_НДФЛ.Проект КАК Проект
		////ПодольскийАИ #УчетПроектов 25.11.2020 }
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВТ_НДФЛ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВТ_НДФЛ.Проект 
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ПОМЕСТИТЬ ВТ_ДанныеНДФЛ
		|ИЗ
		|	ВТ_НДФЛ КАК ВТ_НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходСоСчета КАК ТаблицаДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыДокумента
		//|			ПО РасходИзКассы.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			ПО ВЫБОР 
		|				КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам) 
		|					ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.ВалютаРасчетов  = КурсВалютыДокумента.Валюта
		|				ИНАЧЕ ТаблицаДокумента.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			КОНЕЦ
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыУчета
		|			ПО (КурсВалютыУчета.Валюта = &ВалютаУчета)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСрокУплаты КАК ТаблицаСрокУплаты
		|			ПО (ИСТИНА)
		|		ПО ВТ_НДФЛ.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Организация,
		|	ВТ_НДФЛ.ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате),
		|	ВТ_НДФЛ.НДФЛсВыплат,
		//|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа КАК ЧИСЛО(15, 2)) КАК Сумма,
		//|	ВЫРАЗИТЬ(ВТ_НДФЛ.СуммаРасчетов * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаРасчетовРегл,
		|	ВЫРАЗИТЬ(ВЫБОР 
		|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам) 
		|			И ТаблицаДокумента.ВалютаДенежныхСредств = &ВалютаУчета
		|			ТОГДА ВТ_НДФЛ.СуммаПлатежа
		|		ИНАЧЕ ВТ_НДФЛ.СуммаРасчетов * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность)
		|	КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаРасчетовРегл,
		|	ВЫРАЗИТЬ(ВТ_НДФЛ.СуммаПлатежа * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)),
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СрокУплаты = &ПустаяДата
		|			ТОГДА ТаблицаСрокУплаты.СрокУплаты
		|		ИНАЧЕ ТаблицаДокумента.СрокУплаты
		|	КОНЕЦ,
		|	&ПогашениеНалога,
		|	ВТ_НДФЛ.Сотрудник,
		|	ВТ_НДФЛ.НДФЛПлатежа,
		|	ВТ_НДФЛ.ПериодРегистрации,
		|	ТаблицаДокумента.ВалютаДенежныхСредств,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		|	ВТ_НДФЛ.Статья,
		|	ВТ_НДФЛ.БанковскийСчет,
		|	ВТ_НДФЛ.СчетУчетаКВозмещениюРегл,
		|	ВТ_НДФЛ.БанковскийСчетСчетУчетаРегл,
		|	ВТ_НДФЛ.СуммаРасчетов,
		|	ВТ_НДФЛ.СуммаПлатежа,
		//+++ Дмгг
		//|	ТаблицаДокумента.Проект КАК Проект
		//--- Дмгг
		////ПодольскийАИ #УчетПроектов 25.11.2020 {
		//|	ВТ_НДФЛ.Проект
		////ПодольскийАИ #УчетПроектов 25.11.2020 }
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВТ_НДФЛ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВТ_НДФЛ.Проект 
		|	КОНЕЦ
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВТ_НДФЛ КАК ВТ_НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходСоСчета КАК ТаблицаДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыДокумента
		//|			ПО РасходИзКассы.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			ПО ВЫБОР 
		|				КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам) 
		|					ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.ВалютаРасчетов  = КурсВалютыДокумента.Валюта
		|				ИНАЧЕ ТаблицаДокумента.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			КОНЕЦ
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыУчета
		|			ПО (КурсВалютыУчета.Валюта = &ВалютаУчета)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСрокУплаты КАК ТаблицаСрокУплаты
		|			ПО (ИСТИНА)
		|		ПО ВТ_НДФЛ.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеНДФЛ.Период,
		|	ВТ_ДанныеНДФЛ.ВидДвижения,
		|	ВТ_ДанныеНДФЛ.Организация,
		|	ВТ_ДанныеНДФЛ.ВидНачисленияУдержания,
		|	ВТ_ДанныеНДФЛ.Операция,
		|	ВТ_ДанныеНДФЛ.ВидНалога,
		|	ВТ_ДанныеНДФЛ.Сумма,
		|	ВТ_ДанныеНДФЛ.СчетУчета,
		|	ВТ_ДанныеНДФЛ.СчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.СрокУплаты,
		|	ВТ_ДанныеНДФЛ.СодержаниеПроводки,
		|	ВТ_ДанныеНДФЛ.Сотрудник,
		|	ВТ_ДанныеНДФЛ.СуммаВал,
		|	ВТ_ДанныеНДФЛ.ПериодРегистрации,
		|	ВТ_ДанныеНДФЛ.Валюта,
		|	ВТ_ДанныеНДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_ДанныеНДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_ДанныеНДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.Статья,
		|	ВТ_ДанныеНДФЛ.БанковскийСчет,
		////+++ Дмгг
		//|	ВТ_ДанныеНДФЛ.Проект КАК Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВТ_ДанныеНДФЛ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВТ_ДанныеНДФЛ.Проект
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВТ_ДанныеНДФЛ КАК ВТ_ДанныеНДФЛ";

		РезультатЗапроса = Запрос.Выполнить();
		
		врТаблицаРасчетыНДФЛ = РезультатЗапроса.Выгрузить();  
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", врТаблицаРасчетыНДФЛ);
		
		врТаблицаРасчетыПоНалогам = врТаблицаРасчетыНДФЛ.Скопировать();
		врТаблицаРасчетыПоНалогам.Свернуть("Период,ВидДвижения,Организация,ВидНалога,СчетУчета,СчетУчетаРегл,СрокУплаты,СодержаниеПроводки","Сумма");
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", врТаблицаРасчетыПоНалогам);
	
	// Kuzmich, 26.02.2019,Зарплата по ведомости в разрезе сотрудников
	ИначеЕсли ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников Тогда
		
		Запрос.УстановитьПараметр("НачислениеНалога",	НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога';en='tax accrual'"));
		Запрос.УстановитьПараметр("ПогашениеНалога",	НСтр("ka='გადასახადის დაფარვა';ru='Погашение налога';en='repayment of the tax'"));
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ПОМЕСТИТЬ КурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаДокумента)) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НачислениеНалоговНалоги.СрокУплаты
		|ПОМЕСТИТЬ ВременнаяТаблицаСрокУплаты
		|ИЗ
		|	Документ.РасходСоСчета КАК РасходСоСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеНалогов.Налоги КАК НачислениеНалоговНалоги
		|		ПО (РасходСоСчета.Ссылка = &Ссылка)
		|			И (НачислениеНалоговНалоги.Ссылка = РасходСоСчета.ДокументОснование
		|				ИЛИ НачислениеНалоговНалоги.Ссылка = РасходСоСчета.ДокументОснование.ДокументОснование)
		|			И РасходСоСчета.ВидНалога = НачислениеНалоговНалоги.ВидНалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога КАК НДФЛсНачислений,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат КАК НДФЛсВыплат,
		|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета КАК НДФЛсВыплатСчетУчета,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога.СчетУчета КАК НДФЛсНачисленийСчетУчета,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК НДФЛсВыплатСчетУчетаРегл,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК НДФЛсНачисленийСчетУчетаРегл,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРегл,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.НДФЛПлатежа,
		//|	РасходСоСчетаВыплатаЗаработнойПлаты.НДФЛПлатежа КАК НДФЛРасчетов,
		|	ПлатежнаяВедомостьСотрудники.Сотрудник,
		|	ПлатежнаяВедомостьСотрудники.Ссылка.ПериодРегистрации,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.Статья,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчетаРегл,
		//+++ Дмгг
		//|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.Проект КАК Проект
		//--- Дмгг
		////ПодольскийАИ #УчетПроектов 25.11.2020 {
		//|	ВЫБОР 
		//|		КОГДА &УчетПоПроектам 
		//|			ТОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Проект
		//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		//|	КОНЕЦ КАК Проект
		////ПодольскийАИ #УчетПроектов 25.11.2020 }
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА 
		|       		ВЫбор
		|					КОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|                    ИНАЧЕ РасходСоСчетаВыплатаЗаработнойПлаты.Проект 
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	 КОНЕЦ КАК Проект 
		//Lazare_ 09.03.2021
		|ПОМЕСТИТЬ ВТ_НДФЛ
		|ИЗ
		|	Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК РасходСоСчетаВыплатаЗаработнойПлаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
		|		ПО РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость = ПлатежнаяВедомостьСотрудники.Ссылка
		|			И РасходСоСчетаВыплатаЗаработнойПлаты.Сотрудник = ПлатежнаяВедомостьСотрудники.Сотрудник
		|			И (РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка = &Ссылка)
		|			И (НЕ РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка))
		|			И (ЕСТЬNULL(РасходСоСчетаВыплатаЗаработнойПлаты.НДФЛПлатежа, 0) > 0)
		//ПодольскийАИ #УчетПроектов 25.11.2020 {
		|			И ВЫБОР 
		|				КОГДА &УчетПоПроектам 
		|					ТОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Проект = ПлатежнаяВедомостьСотрудники.Проект
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		//ПодольскийАИ #УчетПроектов 25.11.2020 }
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Организация КАК Организация,
		|	ВТ_НДФЛ.ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
		|	ВТ_НДФЛ.НДФЛсНачислений КАК ВидНалога,
		|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета КАК СчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл КАК СчетУчетаРегл,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СрокУплаты = &ПустаяДата
		|			ТОГДА ТаблицаСрокУплаты.СрокУплаты
		|		ИНАЧЕ ТаблицаДокумента.СрокУплаты
		|	КОНЕЦ КАК СрокУплаты,
		|	&НачислениеНалога КАК СодержаниеПроводки,
		|	ВТ_НДФЛ.Сотрудник,
		|	ВТ_НДФЛ.НДФЛПлатежа КАК СуммаВал,
		|	ВТ_НДФЛ.ПериодРегистрации,
		|	ТаблицаДокумента.ВалютаДенежныхСредств КАК Валюта,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		|	ВТ_НДФЛ.Статья,
		|	ВТ_НДФЛ.БанковскийСчет,
		|	ВТ_НДФЛ.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРегл,
		|	ВТ_НДФЛ.БанковскийСчетСчетУчетаРегл,
		////+++ Дмгг
		//|	ВТ_НДФЛ.Проект КАК Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВТ_НДФЛ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВТ_НДФЛ.Проект
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ПОМЕСТИТЬ ВТ_ДанныеНДФЛ
		|ИЗ
		|	ВТ_НДФЛ КАК ВТ_НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходСоСчета КАК ТаблицаДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыДокумента
		|			ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыУчета
		|			ПО (КурсВалютыУчета.Валюта = &ВалютаУчета)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСрокУплаты КАК ТаблицаСрокУплаты
		|			ПО (ИСТИНА)
		|		ПО ВТ_НДФЛ.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Организация,
		|	ВТ_НДФЛ.ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате) КАК Операция, //Начисленный) КАК Операция,
		|	ВТ_НДФЛ.НДФЛсВыплат,
		|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)),
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СрокУплаты = &ПустаяДата
		|			ТОГДА ТаблицаСрокУплаты.СрокУплаты
		|		ИНАЧЕ ТаблицаДокумента.СрокУплаты
		|	КОНЕЦ,
		|	&ПогашениеНалога,
		|	ВТ_НДФЛ.Сотрудник,
		|	ВТ_НДФЛ.НДФЛПлатежа,
		|	ВТ_НДФЛ.ПериодРегистрации,
		|	ТаблицаДокумента.ВалютаДенежныхСредств,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		|	ВТ_НДФЛ.Статья,
		|	ВТ_НДФЛ.БанковскийСчет,
		|	ВТ_НДФЛ.СчетУчетаКВозмещениюРегл,
		|	ВТ_НДФЛ.БанковскийСчетСчетУчетаРегл,
		//+++ Дмгг
		//|	ТаблицаДокумента.Проект КАК Проект
		//--- Дмгг
		////ПодольскийАИ #УчетПроектов 25.11.2020 {
		//|	ВТ_НДФЛ.Проект
		////ПодольскийАИ #УчетПроектов 25.11.2020 }
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВТ_НДФЛ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВТ_НДФЛ.Проект
		|	КОНЕЦ
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВТ_НДФЛ КАК ВТ_НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходСоСчета КАК ТаблицаДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыДокумента
		|			ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыУчета
		|			ПО (КурсВалютыУчета.Валюта = &ВалютаУчета)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСрокУплаты КАК ТаблицаСрокУплаты
		|			ПО (ИСТИНА)
		|		ПО ВТ_НДФЛ.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеНДФЛ.Период,
		|	ВТ_ДанныеНДФЛ.ВидДвижения,
		|	ВТ_ДанныеНДФЛ.Организация,
		|	ВТ_ДанныеНДФЛ.ВидНачисленияУдержания,
		|	ВТ_ДанныеНДФЛ.Операция,
		|	ВТ_ДанныеНДФЛ.ВидНалога,
		|	ВТ_ДанныеНДФЛ.Сумма,
		|	ВТ_ДанныеНДФЛ.СчетУчета,
		|	ВТ_ДанныеНДФЛ.СчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.СрокУплаты,
		|	ВТ_ДанныеНДФЛ.СодержаниеПроводки,
		|	ВТ_ДанныеНДФЛ.Сотрудник,
		|	ВТ_ДанныеНДФЛ.СуммаВал,
		|	ВТ_ДанныеНДФЛ.ПериодРегистрации,
		|	ВТ_ДанныеНДФЛ.Валюта,
		|	ВТ_ДанныеНДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_ДанныеНДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_ДанныеНДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.Статья,
		|	ВТ_ДанныеНДФЛ.БанковскийСчет,
		////+++ Дмгг
		//|	ВТ_ДанныеНДФЛ.Проект КАК Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВТ_ДанныеНДФЛ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВТ_ДанныеНДФЛ.Проект
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВТ_ДанныеНДФЛ КАК ВТ_ДанныеНДФЛ";

		//Паганини_
		РезультатЗапроса = Запрос.Выполнить();
		врТаблицаРасчетыНДФЛ = РезультатЗапроса.Выгрузить();  
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", врТаблицаРасчетыНДФЛ);		
		
		врТаблицаРасчетыПоНалогам = врТаблицаРасчетыНДФЛ.Скопировать();	
		врТаблицаРасчетыПоНалогам.Свернуть("Период,ВидДвижения,Организация,ВидНалога,СчетУчета,СчетУчетаРегл,СрокУплаты,СодержаниеПроводки","Сумма");
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", врТаблицаРасчетыПоНалогам);
		//_Паганини
	
	// Kuzmich, 26.02.2019,Зарплата по ведомости в разрезе сотрудников
	
	ИначеЕсли ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Поставщику Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(ДокументСсылкаРасходСоСчета.Дата),ДокументСсылкаРасходСоСчета.Дата,ТекущаяДата())));
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ТаблицаРасчетыПоНалогам.Дата КАК Период,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
		//_Паганини ПФ
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛНачислении КАК ВидНалога,
		|	ТаблицаРасчетыПоНалогам.Контрагент КАК Сотрудник,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ) КАК ПериодРегистрации,
		|	ТаблицаРасчетыПоНалогам.Валюта КАК Валюта,
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛ) КАК Сумма,
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛВал) КАК СуммаВал,
		|	&ПогашениеНалога КАК СодержаниеПроводки,
		////+++ Дмгг
		//|	ТаблицаРасчетыПоНалогам.Проект КАК Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ТаблицаРасчетыПоНалогам.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ТаблицаРасчетыПоНалогам.Проект
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчетыПоНалогам
		|ГДЕ
		|	НЕ ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		////+++ Дмгг
		//|	ТаблицаРасчетыПоНалогам.Проект,
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ТаблицаРасчетыПоНалогам.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ТаблицаРасчетыПоНалогам.Проект
		|	КОНЕЦ,
		//Lazare_ 09.03.2021
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ,
		//_Паганини ПФ
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛНачислении,
		|	ТаблицаРасчетыПоНалогам.Контрагент,
		|	ТаблицаРасчетыПоНалогам.Валюта,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ)
		|
		//Паганини ПФ_
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛ) = 0
		|
		//_Паганини ПФ
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате) КАК Операция,
		//_Паганини ПФ
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛКОплате,
		|	ТаблицаРасчетыПоНалогам.Контрагент,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ),
		|	ТаблицаРасчетыПоНалогам.Валюта,
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛ),
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛВал),
		|	&НачислениеНалога,
		////+++ Дмгг
		//|	ТаблицаРасчетыПоНалогам.Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ТаблицаРасчетыПоНалогам.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ТаблицаРасчетыПоНалогам.Проект
		|	КОНЕЦ
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчетыПоНалогам
		|ГДЕ
		|	НЕ ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		////+++ Дмгг
		//|	ТаблицаРасчетыПоНалогам.Проект,
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ТаблицаРасчетыПоНалогам.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ТаблицаРасчетыПоНалогам.Проект
		|	КОНЕЦ,
		//Lazare_ 09.03.2021
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ,
		//_Паганини ПФ
		|	ТаблицаРасчетыПоНалогам.Контрагент,
		|	ТаблицаРасчетыПоНалогам.Валюта,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ),
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛКОплате
		//Паганини ПФ_
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛ) = 0
		|
		//_Паганини ПФ
		|";
		
		Запрос.УстановитьПараметр("НачислениеНалога",	НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога';en='tax accrual'"));
		Запрос.УстановитьПараметр("ПогашениеНалога",	НСтр("ka='გადასახადის დაფარვა';ru='Погашение налога';en='repayment of the tax'"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		//Паганини_		
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", РезультатЗапроса.Выгрузить());
		ТаблицаНДФЛ = РезультатЗапроса.Выгрузить();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", 		ТаблицаНДФЛ);
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам",	ТаблицаНДФЛ);
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", 		Новый ТаблицаЗначений);		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам",	Новый ТаблицаЗначений);
		//_Паганини
	КонецЕсли;	
	
КонецПроцедуры // СформироватьТаблицаРасчетыПоНалогам()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПлатежныйКалендарь(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьПлатежныйКалендарь", Константы.ФункциональнаяОпцияПлатежныйКалендарь.Получить());
	Запрос.УстановитьПараметр("ИспользуютсяПереводыВПути",РегистрыСведений.ПрименениеПереводовВПути.ИспользуютсяПереводыВПути(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата,СтруктураДополнительныеСвойства.ДляПроведения.Организация));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные) КАК ТипДенежныхСредств,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыУтвержденияПлатежей.Утвержден) КАК СтатусУтвержденияПлатежа,
	|	ТаблицаДокумента.БанковскийСчет КАК БанковскийСчетКасса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.РасчетыВУсловныхЕдиницах
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ ТаблицаДокумента.ВалютаДенежныхСредств
	|	КОНЕЦ КАК Валюта,
	|	ТаблицаДокумента.СчетНаОплатуДляПлатежногоКалендаря КАК СчетНаОплату,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.Договор.РасчетыВУсловныхЕдиницах
	|				ТОГДА -ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ -ТаблицаДокумента.СуммаПлатежа
	|		КОНЕЦ) КАК СуммаОплаты,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект КАК Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|	ВЫБОР 
	|		 КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|        ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект
	//Lazare_ 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&ИспользоватьПлатежныйКалендарь
	|	И ТаблицаДокумента.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Зарплата)
	|	И (ТаблицаДокумента.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ИЛИ &ИспользуютсяПереводыВПути)
	|СГРУППИРОВАТЬ ПО
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	////--- Дмгг
	//_Lazare 09.03.2021
	|	ВЫБОР 
	|		 КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|        ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 09.03.2021
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.РасчетыВУсловныхЕдиницах
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ ТаблицаДокумента.ВалютаДенежныхСредств
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетНаОплатуДляПлатежногоКалендаря
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные) КАК ТипДенежныхСредств,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыУтвержденияПлатежей.Утвержден) КАК СтатусУтвержденияПлатежа,
	|	ТаблицаДокумента.СчетКонтрагента КАК БанковскийСчетКасса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.РасчетыВУсловныхЕдиницах
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ ТаблицаДокумента.ВалютаДенежныхСредств
	|	КОНЕЦ КАК Валюта,
	|	ТаблицаДокумента.СчетНаОплатуДляПлатежногоКалендаря КАК СчетНаОплату,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.Договор.РасчетыВУсловныхЕдиницах
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ТаблицаДокумента.СуммаПлатежа
	|		КОНЕЦ) КАК СуммаОплаты,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|	ВЫБОР 
	|		 КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|        ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ
	//Lazare_ 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&ИспользоватьПлатежныйКалендарь
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|		И НЕ &ИспользуютсяПереводыВПути
	|
	|СГРУППИРОВАТЬ ПО
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	////--- Дмгг
	//_Lazare 09.03.2021
	|	ВЫБОР 
	|		 КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|        ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ ,
	//Lazare_ 09.03.2021
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.СчетКонтрагента,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.РасчетыВУсловныхЕдиницах
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ ТаблицаДокумента.ВалютаДенежныхСредств
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетНаОплатуДляПлатежногоКалендаря
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ТаблицаДокумента.Ссылка.Статья,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыУтвержденияПлатежей.Утвержден),
	|	ТаблицаДокумента.Ссылка.БанковскийСчет,
	|	ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.ДокументПланирования,
	|	СУММА(-ТаблицаДокумента.СуммаПлатежа),
	//+++ Дмгг
	|	ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником
	//--- Дмгг
	|ИЗ
	|	Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК ТаблицаДокумента
	|ГДЕ
	|	&ИспользоватьПлатежныйКалендарь
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Зарплата)
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	|	ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.ДокументПланирования,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Ссылка.Статья,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет,
	|	ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	1,
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ТаблицаДокумента.Статья,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыУтвержденияПлатежей.Утвержден),
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	НЕОПРЕДЕЛЕНО,
	|	-ТаблицаДокумента.СуммаДокумента,
	//+++ Дмгг
	|	ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником
	//--- Дмгг
	|ИЗ
	|	Документ.РасходСоСчета КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КОЛИЧЕСТВО(ЕСТЬNULL(ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки, 0)) КАК Количество
	|		ИЗ
	|			ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа) КАК ВложенныйЗапрос
	|		ПО (ИСТИНА)
	|ГДЕ
	|	&ИспользоватьПлатежныйКалендарь
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И ВложенныйЗапрос.Количество = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлатежныйКалендарь", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПлатежныйКалендарь()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.СчетНаОплату КАК СчетНаОплату,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА ТаблицаДокумента.ВалютаДенежныхСредств = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаПлатежа
	|			КОГДА ТаблицаДокумента.ВалютаРасчетов = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СуммаАванса,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА ТаблицаДокумента.ВалютаДенежныхСредств = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаПлатежа
	|			КОГДА ТаблицаДокумента.ВалютаРасчетов = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СуммаОплаты,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект КАК Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|	ВЫБОР 
	|		 КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|        ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект
	//Lazare_ 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютСчета
	|		ПО ТаблицаДокумента.СчетНаОплату.ВалютаДокумента = КурсыВалютСчета.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	ТаблицаДокумента.ВестиУчетОплатыПоСчетам
	|	И ТаблицаДокумента.СчетНаОплату <> ЗНАЧЕНИЕ(Документ.СчетНаОплату.ПустаяСсылка)
	|	И ТаблицаДокумента.СчетНаОплату <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПоставщика.ПустаяСсылка)
	|	И ТаблицаДокумента.СчетНаОплату <> НЕОПРЕДЕЛЕНО
	|	И (ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю))
	|
	|СГРУППИРОВАТЬ ПО
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	////--- Дмгг
	//_Lazare 09.03.2021
	|	ВЫБОР 
	|		 КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|        ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 09.03.2021
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.ВидОперации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ТаблицаДокумента.Заказ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА ТаблицаДокумента.ВалютаДенежныхСредств = ТаблицаДокумента.Заказ.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаПлатежа
	|			КОГДА ТаблицаДокумента.ВалютаРасчетов = ТаблицаДокумента.Заказ.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА ТаблицаДокумента.ВалютаДенежныхСредств = ТаблицаДокумента.Заказ.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаПлатежа
	|			КОГДА ТаблицаДокумента.ВалютаРасчетов = ТаблицаДокумента.Заказ.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|	ВЫБОР 
	|		 КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|        ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ 
	//Lazare_ 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютСчета
	|		ПО ТаблицаДокумента.Заказ.ВалютаДокумента = КурсыВалютСчета.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	ТаблицаДокумента.ВестиУчетОплатыПоСчетам
	|	И (ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Заказ) = ТИП(Документ.ЗаказПокупателя)
	|				И ТаблицаДокумента.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Заказ) = ТИП(Документ.ЗаказПоставщику)
	|				И ТаблицаДокумента.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка))
	|	И (ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю))
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	|	ТаблицаДокумента.Проект,
	//--- Дмгг
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.ВидОперации
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОплатаСчетовИЗаказов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаОплатаСчетовИЗаказов()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьНДФЛРасчетыНалоговыхАгентовСБюджетом(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетыСНДФЛ.Период,
	|	РасчетыСНДФЛ.Организация,
	|	РасчетыСНДФЛ.ВидДвижения,
	|	РасчетыСНДФЛ.ПериодРегистрации,
	|	РасчетыСНДФЛ.Сумма,
	////+++ Дмгг
	//|	РасчетыСНДФЛ.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|	ВЫБОР 
	|		 КОГДА РасчетыСНДФЛ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|        ИНАЧЕ РасчетыСНДФЛ.Проект
	|	КОНЕЦ 
	//Lazare_ 09.03.2021
	|ИЗ
	|	ВТРасчетыСНДФЛ КАК РасчетыСНДФЛ";	
	// Обрабатываем НДФЛ
	ВыборкаПоНДФЛ = Запрос.Выполнить().Выбрать();
	ТаблицаПоНДФЛ = Новый ТаблицаЗначений();
	ТаблицаПоНДФЛ.Колонки.Добавить("Период",Новый ОписаниеТипов("Дата"));
	ТаблицаПоНДФЛ.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаПоНДФЛ.Колонки.Добавить("ВидДвижения",Новый ОписаниеТипов("ВидДвиженияНакопления"));
	ТаблицаПоНДФЛ.Колонки.Добавить("ПериодРегистрации",Новый ОписаниеТипов("Дата"));
	ТаблицаПоНДФЛ.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаПоНДФЛ.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"),Новый КвалификаторыЧисла(15,2));
	
	Если ВыборкаПоНДФЛ.Следующий() Тогда
		СтрокиРаспределения = Сотрудники.РаспределитьПеречисленныйНалогПоФизическимЛицам(ДокументСсылкаРасходИзКассы, ДокументСсылкаРасходИзКассы.Организация,ВыборкаПоНДФЛ.Период , ВыборкаПоНДФЛ.Сумма, ВыборкаПоНДФЛ.ПериодРегистрации);
		Для Каждого СтрокаТЗ Из СтрокиРаспределения Цикл
			НоваяСтрока = ТаблицаПоНДФЛ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНДФЛ, , "Сумма");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЦикла;
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНДФЛРасчетыНалоговыхАгентовСБюджетом", ТаблицаПоНДФЛ);
	
КонецПроцедуры // СформироватьНДФЛРасчетыНалоговыхАгентовСБюджетом()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьРасчетыСФондамиПоСтраховымВзносам(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетыСФондамиПоСтраховымВзносам.Период,
	|	РасчетыСФондамиПоСтраховымВзносам.Организация,
	|	РасчетыСФондамиПоСтраховымВзносам.ВидДвижения,
	|	РасчетыСФондамиПоСтраховымВзносам.ЭтоСтраховыеВзносы,
	|	РасчетыСФондамиПоСтраховымВзносам.ВидОбязательногоСтрахованияСотрудников,
	|	РасчетыСФондамиПоСтраховымВзносам.Сумма,
	////+++ Дмгг
	//|	РасчетыСФондамиПоСтраховымВзносам.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|	ВЫБОР 
	|		 КОГДА РасчетыСФондамиПоСтраховымВзносам.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|        ИНАЧЕ РасчетыСФондамиПоСтраховымВзносам.Проект
	|	КОНЕЦ 
	//Lazare_ 09.03.2021
	|ИЗ
	|	ВТРасчетыСФондамиПоСтраховымВзносам КАК РасчетыСФондамиПоСтраховымВзносам";
		
	// Обрабатываем НДФЛ
	ВыборкаПоВзносам = Запрос.Выполнить().Выбрать();
	ТаблицаПоВзносам = Новый ТаблицаЗначений();
	ТаблицаПоВзносам.Колонки.Добавить("Период",Новый ОписаниеТипов("Дата"));
	ТаблицаПоВзносам.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаПоВзносам.Колонки.Добавить("ВидДвижения",Новый ОписаниеТипов("ВидДвиженияНакопления"));
	ТаблицаПоВзносам.Колонки.Добавить("ЭтоСтраховыеВзносы",Новый ОписаниеТипов("Булево"));
	ТаблицаПоВзносам.Колонки.Добавить("ВидОбязательногоСтрахованияСотрудников",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОбязательногоСтрахованияСотрудников"));
	ТаблицаПоВзносам.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаПоВзносам.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"),Новый КвалификаторыЧисла(15,2));
	
	Если ВыборкаПоВзносам.Следующий() Тогда
		СтрокиРаспределения = Сотрудники.РаспределитьПеречисленныйВзносПоФизическимЛицам(ДокументСсылкаРасходИзКассы, ДокументСсылкаРасходИзКассы.Организация,ВыборкаПоВзносам.Период , ВыборкаПоВзносам.Сумма, ВыборкаПоВзносам.ВидОбязательногоСтрахованияСотрудников);
		Для Каждого СтрокаТЗ Из СтрокиРаспределения Цикл
			НоваяСтрока = ТаблицаПоВзносам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоВзносам, , "Сумма");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЦикла;
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСФондамиПоСтраховымВзносам", ТаблицаПоВзносам);
	
КонецПроцедуры // СформироватьРасчетыСФондамиПоСтраховымВзносам()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗакупкиПоставщиковДляКУДиР(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("ДатаДокумента", СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Период,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК ДатаДокумента,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ОрганизацияВНУ КАК Организация,
	|	&Ссылка КАК ДенежныйДокумент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК ТоварныйДокумент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.УчитыватьВНУ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СтавкаНДС.Ставка КАК СтавкаНДС,
	|	ЛОЖЬ КАК ЭтоТоварыКРеализации,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВал,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов КАК Валюта
	|ПОМЕСТИТЬ ВременнаяТаблицаЗакупкиПоставщиковДляКУДиР
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|	И ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|	И НЕ ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|	И ВременнаяТаблицаРасшифровкаПлатежа.ОрганизацияВНУ.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ОрганизацияВНУ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.УчитыватьВНУ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СтавкаНДС.Ставка,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ТоварныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗакупкиПоставщиковДляКУДиР.ТоварныйДокумент
	|ПОМЕСТИТЬ ВТТоварныеДокументы
	|ИЗ
	|	ВременнаяТаблицаЗакупкиПоставщиковДляКУДиР КАК ВТЗакупкиПоставщиковДляКУДиР
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная КАК ДокументПриходнаяНакладная
	|		ПО (ДокументПриходнаяНакладная.Ссылка = ВТЗакупкиПоставщиковДляКУДиР.ТоварныйДокумент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПримененияЕНВД.СрезПоследних(&ДатаДокумента, ) КАК ПримененияЕНВД
	|		ПО ВТЗакупкиПоставщиковДляКУДиР.Организация = ПримененияЕНВД.Организация
	|			И (ПримененияЕНВД.СтруктурнаяЕдиница = ДокументПриходнаяНакладная.СтруктурнаяЕдиница)
	|ГДЕ
	|	(ДокументПриходнаяНакладная.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ЕСТЬNULL(ПримененияЕНВД.РозничнаяТорговляОблагаетсяЕНВД, ЛОЖЬ))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗакупкиПоставщиковДляКУДиР.ТоварныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТоварныеДокументы.ТоварныйДокумент,
	|	ЗакупкиДляКУДиР.Номенклатура,
	|	ЗакупкиДляКУДиР.ЭтоТоварыКРеализации,
	|	СУММА(ЗакупкиДляКУДиР.СуммаВал) КАК Сумма,
	|	СУММА(ЗакупкиДляКУДиР.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТУчтенныеТовары
	|ИЗ
	|	РегистрНакопления.ЗакупкиДляКУДиР КАК ЗакупкиДляКУДиР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварныеДокументы КАК ВТТоварныеДокументы
	|		ПО (ВТТоварныеДокументы.ТоварныйДокумент = ЗакупкиДляКУДиР.ТоварныйДокумент)
	|			И (ЗакупкиДляКУДиР.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТТоварныеДокументы.ТоварныйДокумент,
	|	ЗакупкиДляКУДиР.Номенклатура,
	|	ЗакупкиДляКУДиР.ЭтоТоварыКРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗакупкиПоставщиковДляКУДиР.Период,
	|	ВТЗакупкиПоставщиковДляКУДиР.ДатаДокумента,
	|	ВТЗакупкиПоставщиковДляКУДиР.НомерСтроки,
	|	ВТЗакупкиПоставщиковДляКУДиР.Организация,
	|	ВТЗакупкиПоставщиковДляКУДиР.ДенежныйДокумент,
	|	ВТЗакупкиПоставщиковДляКУДиР.ТоварныйДокумент,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	ВТЗакупкиПоставщиковДляКУДиР.УчитыватьВНУ,
	|	ВТЗакупкиПоставщиковДляКУДиР.ЭтоТоварыКРеализации,
	|	ВТЗакупкиПоставщиковДляКУДиР.СуммаВал,
	|	ВТЗакупкиПоставщиковДляКУДиР.СуммаВал КАК Сумма,
	|	ВТЗакупкиПоставщиковДляКУДиР.СтавкаНДС,
	|	0 КАК Количество,
	|	0 КАК СуммаНДС
	|ИЗ
	|	ВременнаяТаблицаЗакупкиПоставщиковДляКУДиР КАК ВТЗакупкиПоставщиковДляКУДиР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТоварныеДокументы.ТоварныйДокумент КАК ТоварныйДокумент,
	|	Закупки.Номенклатура,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Закупки.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА Закупки.Количество  - ЕСТЬNULL(ВТУчтенныеТовары.Количество, 0)
	|		ИНАЧЕ Закупки.Количество * Закупки.ЕдиницаИзмерения.Коэффициент  - ЕСТЬNULL(ВТУчтенныеТовары.Количество, 0)
	|	КОНЕЦ КАК Количество,
	|	Закупки.Всего - ЕСТЬNULL(ВТУчтенныеТовары.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(Закупки.СтавкаНДС.Ставка, 0) КАК СтавкаНДС,
	|	НЕ Закупки.ТоварыДляПроизводства КАК ЭтоТоварыКРеализации
	|ИЗ
	|	ВТТоварныеДокументы КАК ВТТоварныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Запасы КАК Закупки
	|		ПО (Закупки.Ссылка = ВТТоварныеДокументы.ТоварныйДокумент)
	|			И (Закупки.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУчтенныеТовары КАК ВТУчтенныеТовары
	|		ПО (ВТУчтенныеТовары.ТоварныйДокумент = ВТТоварныеДокументы.ТоварныйДокумент)
	|			И (ВТУчтенныеТовары.Номенклатура = Закупки.Номенклатура)
	|ГДЕ
	|	Закупки.Всего - ЕСТЬNULL(ВТУчтенныеТовары.Сумма, 0) <> 0
	|ИТОГИ ПО
	|	ТоварныйДокумент";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаОплаты = РезультатЗапроса[3].Выгрузить();
	ТаблицаРезультат = ТаблицаОплаты.Скопировать(Новый Массив());
	ВыборкаДокументовСТоварами = РезультатЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	УчетВалюты = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	НацВалюта = Константы.НациональнаяВалюта.Получить();
	ВалютаДокумента = ДокументСсылкаРасходСоСчета.ВалютаДенежныхСредств;
	
	Если УчетВалюты И ВалютаДокумента <> НацВалюта Тогда
		ТекущийКурс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ДокументСсылкаРасходСоСчета.Дата);
	КонецЕсли;
	
	Пока ВыборкаДокументовСТоварами.Следующий() Цикл
		СвободныеОплаты = ТаблицаОплаты.НайтиСтроки(Новый Структура("ТоварныйДокумент", ВыборкаДокументовСТоварами.ТоварныйДокумент));
		ВыборкаЗаписей = ВыборкаДокументовСТоварами.Выбрать();
		Для Каждого ДокументОплаты Из СвободныеОплаты Цикл
			Пока ДокументОплаты.Сумма <> 0 И ВыборкаЗаписей.Следующий() Цикл
				НовСтр = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаЗаписей);
				ЗаполнитьЗначенияСвойств(НовСтр, ДокументОплаты,,"ЭтоТоварыКРеализации");
				Если ДокументОплаты.Сумма >= ВыборкаЗаписей.Сумма Тогда
					НовСтр.Сумма = ВыборкаЗаписей.Сумма;
				Иначе
					НовСтр.Сумма = ДокументОплаты.Сумма;
				КонецЕсли;
				ДокументОплаты.Сумма = ДокументОплаты.Сумма - НовСтр.Сумма;
				НовСтр.СуммаВал = НовСтр.Сумма;
				
				Если УчетВалюты И ВалютаДокумента <> НацВалюта Тогда
					НовСтр.Сумма = НовСтр.Сумма * ТекущийКурс.Курс / ТекущийКурс.Кратность;
				КонецЕсли;
				НовСтр.СуммаНДС = НовСтр.Сумма - НовСтр.Сумма /((100+ ВыборкаЗаписей.СтавкаНДС)/100);
				НовСтр.Номенклатура = ВыборкаЗаписей.Номенклатура;
				НовСтр.Количество =  ВыборкаЗаписей.Количество;
				НовСтр.Сумма = НовСтр.Сумма - НовСтр.СуммаНДС;
			КонецЦикла;
			Если ДокументОплаты.Сумма <> 0 Тогда
				НовСтр = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ДокументОплаты);
				НовСтр.СуммаВал = НовСтр.Сумма;
				Если УчетВалюты И ВалютаДокумента <> НацВалюта Тогда
					НовСтр.Сумма = НовСтр.Сумма * ТекущийКурс.Курс / ТекущийКурс.Кратность;
				КонецЕсли;
				НовСтр.СуммаНДС = НовСтр.Сумма - НовСтр.Сумма /((100+ ДокументОплаты.СтавкаНДС)/100);
				НовСтр.Сумма = НовСтр.Сумма - НовСтр.СуммаНДС;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗакупкиДляКУДиР", ТаблицаРезультат);
	
КонецПроцедуры // СформироватьТаблицаЗакупкиПоставщиковДляКУДиР()

#Область Биллинг

// Формирует таблицу значений, содержащую данные для проведения по регистру ВыполнениеДоговоровОбслуживания.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВыполнениеДоговораОбслуживания(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылкаРасходСоСчета.НаправлениеДеятельности)
		ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьБиллинг")
		ИЛИ НЕ Константы.БиллингВестиУчетРасходовПоДоговорамОбслуживания.Получить() Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыполнениеДоговораОбслуживания", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаШапка.Дата КАК Период,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ВременнаяТаблицаШапка.Корреспонденция КАК ОбъектДоговораОбслуживания,
	|	ИСТИНА КАК УказанаСтоимость,
	|	1 КАК Количество,
	|	ВременнаяТаблицаШапка.СуммаПоДоговоруОбслуживания КАК Сумма,
	////+++ Дмгг
	//|	ВременнаяТаблицаШапка.Проект
	////--- Дмгг
	//_Lazare 09.03.2021
	|	ВЫБОР 
	|		 КОГДА ВременнаяТаблицаШапка.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|        ИНАЧЕ ВременнаяТаблицаШапка.Проект
	|	КОНЕЦ 
	//Lazare_ 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВременнаяТаблицаШапка.НаправлениеДеятельности = ДоговорыКонтрагентов.ДоговорОбслуживанияНаправлениеДеятельности
	|ГДЕ
	|	(ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|			ИЛИ ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы))
	|	И ДоговорыКонтрагентов.ЭтоДоговорОбслуживания";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыполнениеДоговораОбслуживания", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ОрганизацияДляРегОтчетности", ДокументСсылкаРасходСоСчета.Организация);
	
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаДС", ДокументСсылкаРасходСоСчета.ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("ВалютаДоговораКредитаЗайма", ДокументСсылкаРасходСоСчета.ДоговорКредитаЗайма.ВалютаРасчетов);
	Если НЕ ЗначениеЗаполнено(ДокументСсылкаРасходСоСчета.НаправлениеДеятельности)
		ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьБиллинг")
		ИЛИ НЕ Константы.БиллингВестиУчетРасходовПоДоговорамОбслуживания.Получить() Тогда
		Запрос.УстановитьПараметр("ВалютаДоговораОбслуживания", Справочники.Валюты.ПустаяСсылка());
	Иначе
		ДоговорОбслуживания = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("ДоговорОбслуживанияНаправлениеДеятельности", ДокументСсылкаРасходСоСчета.НаправлениеДеятельности);
		Запрос.УстановитьПараметр("ВалютаДоговораОбслуживания", ?(ЗначениеЗаполнено(ДоговорОбслуживания), ДоговорОбслуживания.ВалютаРасчетов, Справочники.Валюты.ПустаяСсылка()));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОбъединятьНакопительнуюИСтраховуюЧасть", ?(ЗначениеЗаполнено(ДокументСсылкаРасходСоСчета.ДокументОснование), ДокументСсылкаРасходСоСчета.ДокументОснование.Дата >= УчетСтраховыхВзносов.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР(), Истина));
	Запрос.УстановитьПараметр("ПериодРегистрацииНДФЛ", НачалоМесяца(ДобавитьМесяц(ДокументСсылкаРасходСоСчета.СрокУплаты, -1)));
	
	СтраховыеВидыВзаиморасчетов = Новый Массив();
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ПФРНакопительнаяСотрудники);
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ПФРСтраховаяСотрудники);
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ФОМССотрудники);
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ФСССотрудники);
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ФССТравматизмСотрудники);
	
	Запрос.УстановитьПараметр("СтраховыеВидыВзаиморасчетов",СтраховыеВидыВзаиморасчетов);
	
	Запрос.УстановитьПараметр("ИспользоватьСтатьиДДС", ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиДвиженияДенежныхСредств"));
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	Если СтруктураДополнительныеСвойства.ДляПроведения.Свойство("ПроектДокумента") Тогда
		СтруктураДополнительныеСвойства.ДляПроведения.ПроектДокумента = ДокументСсылкаРасходСоСчета.ПроектДляЗачетаАвансаСПомощником;
	Иначе
		СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ПроектДокумента", ?(Не ЗначениеЗаполнено(ДокументСсылкаРасходСоСчета.ПроектДляЗачетаАвансаСПомощником),ПредопределенноеЗначение("Справочник.Проекты.БезПроекта"),ДокументСсылкаРасходСоСчета.ПроектДляЗачетаАвансаСПомощником));
		//+++ Lazare_26.04.2021
		  //СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ПроектДокумента", ПредопределенноеЗначение("Справочник.Проекты.БезПроекта"));
		//--- Lazare_26.04.2021
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	
	//Паганини_В запроце "ВременнаяТаблицаРасшифровкаПлатежа" добавленн поле ТипНДФЛ_Паганини
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаДС, &ВалютаДоговораКредитаЗайма, &ВалютаДоговораОбслуживания)) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.Ссылка.ВидОперации КАК ВидОперации,
	|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.УчитыватьВНУ КАК УчитыватьВНУ,
	|	ТаблицаДокумента.Ссылка.Организация КАК ОрганизацияВНУ,
	|	ТаблицаДокумента.СтавкаНДС,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.ЭтоДоговорОбслуживания
	|				И ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВестиУчетРасходовПоДоговорамОбслуживания,
	|	ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности КАК ДоговорОбслуживанияНаправлениеДеятельности,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет КАК БанковскийСчет,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьСтатьиДДС
	|				ИЛИ ТаблицаДокумента.СтатьяДДС = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Ссылка.Статья
	|		ИНАЧЕ ТаблицаДокумента.СтатьяДДС
	|	КОНЕЦ КАК Статья,
	|	ТаблицаДокумента.Ссылка.Корреспонденция КАК Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл КАК КорреспонденцияРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|				И ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|				И ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ КАК Заказ,
	|	ТаблицаДокумента.ПризнакАванса КАК ПризнакАванса,
	|	ТаблицаДокумента.Ссылка.Дата КАК Дата,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаУчета,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаРасчетов,
	|	СУММА(ТаблицаДокумента.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов + ТаблицаДокумента.СуммаРасчетовКомиссии) КАК СуммаРасчетовДляЭквайринга,
	|	СУММА(ТаблицаДокумента.СуммаПлатежа + ТаблицаДокумента.СуммаПлатежаКомиссии) КАК СуммаПлатежаДляЭквайринга,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаДокумента.СуммаПлатежа + ТаблицаДокумента.СуммаПлатежаКомиссии) * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаУчетаДляЭквайринга,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежаКомиссии * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаУчетаКомиссии,
	|	СУММА(ТаблицаДокумента.СуммаПлатежаКомиссии) КАК СуммаПлатежаКомиссии,
	|	СУММА(ТаблицаДокумента.СуммаРасчетовКомиссии) КАК СуммаРасчетовКомиссии,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументПланирования) = ТИП(Документ.РасходДСПлан)
	|				И ТаблицаДокумента.ДокументПланирования <> ЗНАЧЕНИЕ(Документ.РасходДСПлан.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.ДокументПланирования
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументПланирования) = ТИП(Документ.ПеремещениеДСПлан)
	|				И ТаблицаДокумента.ДокументПланирования <> ЗНАЧЕНИЕ(Документ.ПеремещениеДСПлан.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.ДокументПланирования
	|		КОГДА ТаблицаДокумента.СчетНаОплату.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.СчетНаОплату
	|		КОГДА ТаблицаДокумента.Заказ.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетНаОплатуДляПлатежногоКалендаря,
	|	ТаблицаДокумента.СчетНаОплату КАК СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет.СчетУчета КАК БанковскийСчетКассаСчетУчета,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетУчета КАК СчетУчетаЭквайринг,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетЗатрат КАК СчетЗатратЭквайринг,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет.СчетУчетаРегл КАК БанковскийСчетКассаСчетУчетаРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл КАК СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл КАК СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетУчетаРегл КАК СчетУчетаЭквайрингРегл,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетЗатратРегл КАК СчетЗатратЭквайрингРегл,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал,
	|	ТаблицаДокумента.ТипСуммы,
	|	ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма,
	|	ТаблицаДокумента.Ссылка.Подотчетник КАК Сотрудник,
	|	ТаблицаДокумента.Ссылка.СчетКонтрагента КАК СчетКонтрагента,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчета
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаПроцентов
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаКомиссии
	|	КОНЕЦ КАК СчетУчетаПоТипуСуммы,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаКомиссииРегл
	|	КОНЕЦ КАК СчетУчетаПоТипуСуммыРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ""Оплата основного долга по кредиту""
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ""Оплата процентов по кредиту""
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ""Оплата комиссии по кредиту""
	|	КОНЕЦ КАК СодержаниеПоТипуСуммы,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ТОГДА ТаблицаДокумента.Ссылка.ВидНалога
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ТОГДА ТаблицаДокумента.Ссылка.Корреспонденция
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ТОГДА ТаблицаДокумента.Ссылка.СчетКонтрагента
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА ТаблицаДокумента.Ссылка.Касса
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент
	|	КОНЕЦ КАК АналитикаДДС,
	|	ТаблицаДокумента.Ссылка.НаправлениеДеятельности,
	|	ТаблицаДокумента.Ссылка.Перемещение КАК ЭтоПеремещение,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчета КАК НДФЛсНачисленийСчетУчета,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК НДФЛсНачисленийСчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета КАК НДФЛсВыплатСчетУчета,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК НДФЛсВыплатСчетУчетаРегл,
	|	ЕСТЬNULL(ТаблицаДокумента.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0) КАК СтавкаНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат КАК ВидНалогаНДФЛКОплате,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога КАК ВидНалогаНДФЛНачислении,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛ * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаНДФЛ,
	|	СУММА(ТаблицаДокумента.СуммаНДФЛ) КАК СуммаНДФЛВал,
	|	ТаблицаДокумента.ВидУдержанияПФ,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПФ * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаПФ,
	|	СУММА(ТаблицаДокумента.СуммаПФ) КАК СуммаПФВал,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФСотрудника,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФОрганизации,
	|	ТаблицаДокумента.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	ТаблицаДокумента.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДС * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаНДС,
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект КАК Проект,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|				Выбор
	|					КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|							ИЛИ ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|						ТОГДА 
	|							ВЫБОР 
	|								КОГДА ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|								ИНАЧЕ ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником
	|							КОНЕЦ
	|						ИНАЧЕ ТаблицаДокумента.Проект
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОНЕЦ КАК Проект
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА 
	////|       		ВЫбор
	////|					КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	////|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	////|                    ИНАЧЕ ТаблицаДокумента.Проект 
	////|				КОНЕЦ КАК Проект,
	//|		ИНАЧЕ ТаблицаДокумента.Проект
	//|	 КОНЕЦ КАК Проект, 
	 //Lazare_ 26.02.2021
	|ПОМЕСТИТЬ ВременнаяТаблицаРасшифровкаПлатежа
	|ИЗ
	|	Документ.РасходСоСчета.РасшифровкаПлатежа КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|				Выбор
	|					КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|							ИЛИ ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|						ТОГДА 
	|							ВЫБОР 
	|								КОГДА ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|								ИНАЧЕ ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником
	|							КОНЕЦ
	|						ИНАЧЕ ТаблицаДокумента.Проект
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА 
	////|       		ВЫбор
	////|					КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	////|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	////|                    ИНАЧЕ ТаблицаДокумента.Проект 
	////|				КОНЕЦ,
	//|		ИНАЧЕ ТаблицаДокумента.Проект 
	//|	 КОНЕЦ, 
	 //Lazare_ 26.02.2021
	|	ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет,
	|	ТаблицаДокумента.Ссылка.СчетКонтрагента,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|				И ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|				И ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументПланирования) = ТИП(Документ.РасходДСПлан)
	|				И ТаблицаДокумента.ДокументПланирования <> ЗНАЧЕНИЕ(Документ.РасходДСПлан.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.ДокументПланирования
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументПланирования) = ТИП(Документ.ПеремещениеДСПлан)
	|				И ТаблицаДокумента.ДокументПланирования <> ЗНАЧЕНИЕ(Документ.ПеремещениеДСПлан.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.ДокументПланирования
	|		КОГДА ТаблицаДокумента.СчетНаОплату.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.СчетНаОплату
	|		КОГДА ТаблицаДокумента.Заказ.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет.СчетУчета,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет.СчетУчетаРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетУчета,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетЗатрат,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетУчетаРегл,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетЗатратРегл,
	|	ТаблицаДокумента.ТипСуммы,
	|	ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма,
	|	ТаблицаДокумента.Ссылка.Подотчетник,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчета
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаПроцентов
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаКомиссии
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаКомиссииРегл
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ""Оплата основного долга по кредиту""
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ""Оплата процентов по кредиту""
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ""Оплата комиссии по кредиту""
	|	КОНЕЦ,
	|	ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.ЭтоДоговорОбслуживания
	|				И ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ТОГДА ТаблицаДокумента.Ссылка.ВидНалога
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ТОГДА ТаблицаДокумента.Ссылка.Корреспонденция
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ТОГДА ТаблицаДокумента.Ссылка.СчетКонтрагента
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА ТаблицаДокумента.Ссылка.Касса
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьСтатьиДДС
	|				ИЛИ ТаблицаДокумента.СтатьяДДС = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Ссылка.Статья
	|		ИНАЧЕ ТаблицаДокумента.СтатьяДДС
	|	КОНЕЦ,
	|	ТаблицаДокумента.СтавкаНДС,
	|	ТаблицаДокумента.Ссылка.УчитыватьВНУ,
	|	ТаблицаДокумента.Ссылка.Организация,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчета
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета
	|	КОНЕЦ,
	|	ЕСТЬNULL(ТаблицаДокумента.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0),
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога,
	|	ТаблицаДокумента.ВидУдержанияПФ,
	|	ТаблицаДокумента.Ссылка.Перемещение,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.Договор,
	|	ТаблицаДокумента.ВидУдержанияПФ.Контрагент,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчета,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	ТаблицаДокумента.ВидОперации КАК ВидОперации,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	ТаблицаДокумента.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ТаблицаДокумента.СуммаДокумента КАК СуммаВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА &ВалютаДоговораОбслуживания <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|					И &ВалютаДоговораОбслуживания = ТаблицаДокумента.ВалютаДенежныхСредств
	|				ТОГДА ТаблицаДокумента.СуммаДокумента
	|			КОГДА &ВалютаДоговораОбслуживания <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|					И &ВалютаДоговораОбслуживания <> ТаблицаДокумента.ВалютаДенежныхСредств
	|				ТОГДА ТаблицаДокумента.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность * КурсыВалютДоговорОбслуживания.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность * КурсыВалютДоговорОбслуживания.Курс)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаПоДоговоруОбслуживания,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет.СчетУчета КАК БанковскийСчетКассаСчетУчета,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет.СчетУчетаРегл КАК БанковскийСчетКассаСчетУчетаРегл,
	|	ТаблицаДокумента.ВидНалога КАК ВидНалога,
	|	ТаблицаДокумента.ВидНалога.СчетУчета КАК ВидНалогаСчетУчета,
	|	ТаблицаДокумента.Подразделение КАК Подразделение,
	|	ТаблицаДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж КАК НаправлениеДеятельностиСчетУчетаВыручкиОтПродаж,
	|	ТаблицаДокумента.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиСчетУчетаСебестоимостиПродаж,
	|	ТаблицаДокумента.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл КАК НаправлениеДеятельностиСчетУчетаВыручкиОтПродажРегл,
	|	ТаблицаДокумента.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиСчетУчетаСебестоимостиПродажРегл,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ТаблицаДокумента.Корреспонденция КАК Корреспонденция,
	|	ТаблицаДокумента.КорреспонденцияРегл КАК КорреспонденцияРегл,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ТаблицаДокумента.КорреспонденцияРегл.ТипСчета
	|		ИНАЧЕ ТаблицаДокумента.Корреспонденция.ТипСчета
	|	КОНЕЦ КАК КорреспонденцияТипСчета,
	|	ТаблицаДокумента.Подотчетник КАК Подотчетник,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПерсоналом КАК ПодотчетникСчетРасчетовСперсоналом,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетниками КАК ПодотчетникСчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПерсоналомРегл КАК ПодотчетникСчетРасчетовСперсоналомРегл,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетникамиРегл КАК ПодотчетникСчетРасчетовСПодотчетникамиРегл,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.ДокументОснование КАК ДокументОснование,
	|	ТаблицаДокумента.АналитикаПрочихДоходовИРасходов КАК АналитикаДоходовИРасходов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчетПрочихРасчетов,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ТОГДА ТаблицаДокумента.Подотчетник
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ТОГДА ТаблицаДокумента.ВидНалога
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|				ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ТОГДА ТаблицаДокумента.КорреспонденцияРегл
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ТОГДА ТаблицаДокумента.Контрагент
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ТОГДА ТаблицаДокумента.Контрагент
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ТОГДА ТаблицаДокумента.Подотчетник
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ТОГДА ТаблицаДокумента.СчетКонтрагента
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА ТаблицаДокумента.Касса
	|		ИНАЧЕ ТаблицаДокумента.Контрагент
	|	КОНЕЦ КАК АналитикаДДС,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВидУдержания КАК ВидУдержанияПФ,
	|	ТаблицаДокумента.ВидУдержания.ПенсионныйНалогСотрудника КАК ПенсионныйНалогСотрудника,
	|	ТаблицаДокумента.ВидУдержания.ПенсионныйНалогОрганизации КАК ПенсионныйНалогОрганизации,
	|	ТаблицаДокумента.ВидУдержания.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетСотрудникаКВозмещению,
	|	ТаблицаДокумента.ВидУдержания.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетОрганизацииКВозмещению,
	|	ТаблицаДокумента.ВидУдержания.Контрагент КАК КонтрагентПФ,
	|	ТаблицаДокумента.ВидУдержания.Договор КАК ДоговорПФ,
	|	ТаблицаДокумента.Перемещение КАК ЭтоПеремещение,
	|	ТаблицаДокумента.СчетКонтрагента,
	//+++ Дмгг
	//|	ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником КАК Проект,
	//--- Дмгг
	////ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ КАК Проект,
	////ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект 
	 //Lazare_ 26.02.2021
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.РасходСоСчета КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютДоговорОбслуживания
	|		ПО (КурсыВалютДоговорОбслуживания.Валюта = &ВалютаДоговораОбслуживания)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходСоСчета.Дата КАК Период,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА РасходСоСчета.ДокументОснование.Дата ЕСТЬ NULL
	|			ТОГДА &ПериодРегистрацииНДФЛ
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(РасходСоСчета.ДокументОснование.Дата, МЕСЯЦ)
	|	КОНЕЦ КАК ПериодРегистрации,
	|	РасходСоСчета.Сумма КАК Сумма,
	//+++ Дмгг
	//|	РасходСоСчета.Проект КАК Проект
	//--- Дмгг
	////ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА РасходСоСчета.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ КАК Проект
	////ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА РасходСоСчета.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ РасходСоСчета.Проект
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект 
	 //Lazare_ 26.02.2021
	|ПОМЕСТИТЬ ВТРасчетыСНДФЛ
	|ИЗ
	|	ВременнаяТаблицаШапка КАК РасходСоСчета
	|ГДЕ
	|	РасходСоСчета.Сумма <> 0
	|	И РасходСоСчета.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.НДФЛСотрудники)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходСоСчета.Дата КАК Период,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ИСТИНА КАК ЭтоСтраховыеВзносы,
	|	ВЫБОР
	|		КОГДА РасходСоСчета.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ПФРНакопительнаяСотрудники)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРНакопительная)
	|		КОГДА РасходСоСчета.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ПФРСтраховаяСотрудники)
	|			ТОГДА ВЫБОР
	|					КОГДА &ОбъединятьНакопительнуюИСтраховуюЧасть
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРПоСуммарномуТарифу)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРСтраховая)
	|				КОНЕЦ
	|		КОГДА РасходСоСчета.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ФОМССотрудники)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФФОМС)
	|		КОГДА РасходСоСчета.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ФСССотрудники)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФСС)
	|		КОГДА РасходСоСчета.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ФССТравматизмСотрудники)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)
	|	КОНЕЦ КАК ВидОбязательногоСтрахованияСотрудников,
	|	РасходСоСчета.Сумма КАК Сумма,
	//+++ Дмгг
	//|	РасходСоСчета.Проект КАК Проект
	//--- Дмгг
	////ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА РасходСоСчета.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ КАК Проект
	////ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА РасходСоСчета.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ РасходСоСчета.Проект
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект 
	 //Lazare_ 26.02.2021
	|ПОМЕСТИТЬ ВТРасчетыСФондамиПоСтраховымВзносам
	|ИЗ
	|	ВременнаяТаблицаШапка КАК РасходСоСчета
	|ГДЕ
	|	РасходСоСчета.Сумма <> 0
	|	И РасходСоСчета.ВидНалога В(&СтраховыеВидыВзаиморасчетов)";
	
	Запрос.Выполнить();
	
	// Формирование таблиц движений по разделам учета.
	СформироватьТаблицаДенежныеСредства(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	// Прочие расчеты
	СформироватьТаблицаРасчетыСПрочимиКонтрагентами(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоКредитамИЗаймам(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	// Конец Прочие расчеты
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПлатежныйКалендарь(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	// Эквайринг
	СформироватьТаблицаРасчетыПоЭквайрингу(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыКассовыйМетодЭквайринг(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыЭквайринг(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	// Конец Эквайринг
	Если Не ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата //Тогда 
		И НЕ (ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников) Тогда // Kuzmich, 26.02.2019,Зарплата по ведомости в разрезе сотрудников
		СформироватьТаблицаУправленческий(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_РасходСоСчета(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
		//Паганини ПФ_
		Если ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПенсионномуФонду Тогда
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыСПенсионнымФондом_РасходСоСчета_ПенсионномуФонду(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
		Иначе
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыСПенсионнымФондом_РасходСоСчета_РасходИзКассы(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);//Паганини ПФ
		КонецЕсли;
		//_Паганини ПФ	
	Иначе 
		СформироватьТаблицаУправленческий_РС(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_РасходСоСчета_Зарплата(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыСПенсионнымФондом_РасходСоСчета_РасходИзКассы_Зарплата(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);//Паганини ПФ
	КонецЕсли;
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаДекларация_РасходСоСчета(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);//ПаганиниПФ
	//Паганини#Удержания_
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыПоУдержаниям_РасходСоСчета(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	//_Паганини#Удержания
	СформироватьНДФЛРасчетыНалоговыхАгентовСБюджетом(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьРасчетыСФондамиПоСтраховымВзносам(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	// Биллинг
	СформироватьТаблицаВыполнениеДоговораОбслуживания(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗакупкиПоставщиковДляКУДиР(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаНалоговыеЛготы(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОстаткиНалоговыхЛьгот(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаРасходСоСчета, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь, ПроверятьИтогиРегистров = ЛОЖЬ) Экспорт
	
	Если НЕ Константы.КонтролироватьОстаткиПриПроведении.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы содержат записи, необходимо выполнить контроль
	// отрицательных остатков.
	Если СтруктураВременныеТаблицы.ДвиженияДенежныеСредстваИзменение
	 ИЛИ СтруктураВременныеТаблицы.ДвиженияРасчетыСПодотчетникамиИзменение
	 ИЛИ СтруктураВременныеТаблицы.ДвиженияРасчетыПоЭквайрингуИзменение // Эквайринг
	 ИЛИ СтруктураВременныеТаблицы.ДвиженияРасчетыСПоставщикамиИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияДенежныеСредстваИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияДенежныеСредстваИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияДенежныеСредстваИзменение.БанковскийСчетКасса КАК БанковскийСчетКассаПредставление,
		|	ДвиженияДенежныеСредстваИзменение.Валюта КАК ВалютаПредставление,
		|	ДвиженияДенежныеСредстваИзменение.ТипДенежныхСредств КАК ТипДенежныхСредствПредставление,
		|	ДвиженияДенежныеСредстваИзменение.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ДвиженияДенежныеСредстваИзменение.СуммаВалИзменение + ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) КАК ОстатокДенежныхСредств,
		|	ДвиженияДенежныеСредстваИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияДенежныеСредстваИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияДенежныеСредстваИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияДенежныеСредстваИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияДенежныеСредстваИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияДенежныеСредстваИзменение.СуммаВалИзменение КАК СуммаВалИзменение
		|ИЗ
		|	ДвиженияДенежныеСредстваИзменение КАК ДвиженияДенежныеСредстваИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства.Остатки(&МоментКонтроля, ) КАК ДенежныеСредстваОстатки
		|		ПО ДвиженияДенежныеСредстваИзменение.Организация = ДенежныеСредстваОстатки.Организация
		|			И ДвиженияДенежныеСредстваИзменение.ТипДенежныхСредств = ДенежныеСредстваОстатки.ТипДенежныхСредств
		|			И ДвиженияДенежныеСредстваИзменение.БанковскийСчетКасса = ДенежныеСредстваОстатки.БанковскийСчетКасса
		|			И ДвиженияДенежныеСредстваИзменение.Валюта = ДенежныеСредстваОстатки.Валюта
		|ГДЕ
		|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияРасчетыСПодотчетникамиИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.Сотрудник КАК СотрудникПредставление,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.Валюта КАК ВалютаПредставление,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.Документ КАК ДокументПредставление,
		|	ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаВалОстаток, 0) КАК ОстатокУПодотчетногоЛица,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.СуммаВалИзменение КАК СуммаВалИзменение
		|ИЗ
		|	ДвиженияРасчетыСПодотчетникамиИзменение КАК ДвиженияРасчетыСПодотчетникамиИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПодотчетниками.Остатки(&МоментКонтроля, ) КАК РасчетыСПодотчетникамиОстатки
		|		ПО ДвиженияРасчетыСПодотчетникамиИзменение.Организация = РасчетыСПодотчетникамиОстатки.Организация
		|			И ДвиженияРасчетыСПодотчетникамиИзменение.Сотрудник = РасчетыСПодотчетникамиОстатки.Сотрудник
		|			И ДвиженияРасчетыСПодотчетникамиИзменение.Валюта = РасчетыСПодотчетникамиОстатки.Валюта
		|			И ДвиженияРасчетыСПодотчетникамиИзменение.Документ = РасчетыСПодотчетникамиОстатки.Документ
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(РасчетыСПодотчетникамиОстатки.Документ) = ТИП(Документ.АвансовыйОтчет)
		|				И ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаВалОстаток, 0) > 0
		|			ИЛИ ТИПЗНАЧЕНИЯ(РасчетыСПодотчетникамиОстатки.Документ) <> ТИП(Документ.АвансовыйОтчет)
		|				И ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаВалОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияРасчетыСПоставщикамиИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Контрагент КАК КонтрагентПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Договор КАК ДоговорПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Договор.ВалютаРасчетов КАК ВалютаПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Документ КАК ДокументПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Заказ КАК ЗаказПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов КАК ТипРасчетовПредставление,
		|	ИСТИНА КАК ДвиженияДенежныхДокументов,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаОстаткаЗадолженности,
		|	-(ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0)) КАК СуммаНепогашенныхАвансов,
		|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов КАК ТипРасчетов
		|ИЗ
		|	ДвиженияРасчетыСПоставщикамиИзменение КАК ДвиженияРасчетыСПоставщикамиИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Остатки(&МоментКонтроля, ) КАК РасчетыСПоставщикамиОстатки
		|		ПО ДвиженияРасчетыСПоставщикамиИзменение.Организация = РасчетыСПоставщикамиОстатки.Организация
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Контрагент = РасчетыСПоставщикамиОстатки.Контрагент
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Договор = РасчетыСПоставщикамиОстатки.Договор
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Документ = РасчетыСПоставщикамиОстатки.Документ
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Заказ = РасчетыСПоставщикамиОстатки.Заказ
		|			И ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов = РасчетыСПоставщикамиОстатки.ТипРасчетов
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|				ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) > 0
		|			ИНАЧЕ ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) < 0
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияРасчетыПоЭквайрингуИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.ВидОперацииЭквайринга КАК ТипДенежныхСредствПредставление,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.ЭквайринговыйТерминал.БанковскийСчетЭквайринг.ВалютаДенежныхСредств КАК ВалютаПредставление,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.ЭквайринговыйТерминал КАК ЭквайринговыйТерминалПредставление,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.ДатаПлатежа КАК ДатаПлатежаПредставление,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.Документ КАК ДокументПредставление,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.Заказ КАК ЗаказПредставление,
		|	ИСТИНА КАК ДвиженияДенежныхДокументов,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.КомиссияПередЗаписью КАК КомиссияПередЗаписью,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.КомиссияПриЗаписи КАК КомиссияПриЗаписи,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.КомиссияИзменение КАК КомиссияИзменение,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.КомиссияВалПередЗаписью КАК КомиссияВалПередЗаписью,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.КомиссияВалПриЗаписи КАК КомиссияВалПриЗаписи,
		|	ДвиженияРасчетыПоЭквайрингуИзменение.КомиссияВалИзменение КАК КомиссияВалИзменение,
		|	ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.СуммаВалОстаток, 0) + ДвиженияРасчетыПоЭквайрингуИзменение.СуммаВалПриЗаписи КАК СуммаОстаткаЗадолженности,
		|	ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.КомиссияВалОстаток, 0) + ДвиженияРасчетыПоЭквайрингуИзменение.КомиссияВалПриЗаписи КАК СуммаОстаткаКомиссии,
		|	ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.КомиссияОстаток, 0) КАК КомиссияОстаток,
		|	ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.КомиссияВалОстаток, 0) КАК КомиссияВалОстаток,
		|	РасчетыПоЭквайрингуОстатки.ВидПлатежнойКарты КАК ВидПлатежнойКартыПредставление,
		|	РасчетыПоЭквайрингуОстатки.НомерПлатежнойКарты КАК НомерПлатежнойКартыПредставление
		|ИЗ
		|	ДвиженияРасчетыПоЭквайрингуИзменение КАК ДвиженияРасчетыПоЭквайрингуИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЭквайрингу.Остатки(&МоментКонтроля, ) КАК РасчетыПоЭквайрингуОстатки
		|		ПО ДвиженияРасчетыПоЭквайрингуИзменение.ВидОперацииЭквайринга = РасчетыПоЭквайрингуОстатки.ВидОперацииЭквайринга
		|			И ДвиженияРасчетыПоЭквайрингуИзменение.Организация = РасчетыПоЭквайрингуОстатки.Организация
		|			И ДвиженияРасчетыПоЭквайрингуИзменение.ЭквайринговыйТерминал = РасчетыПоЭквайрингуОстатки.ЭквайринговыйТерминал
		|			И ДвиженияРасчетыПоЭквайрингуИзменение.ДатаПлатежа = РасчетыПоЭквайрингуОстатки.ДатаПлатежа
		|			И ДвиженияРасчетыПоЭквайрингуИзменение.Документ = РасчетыПоЭквайрингуОстатки.Документ
		|			И ДвиженияРасчетыПоЭквайрингуИзменение.Заказ = РасчетыПоЭквайрингуОстатки.Заказ
		|			И ДвиженияРасчетыПоЭквайрингуИзменение.ВидПлатежнойКарты = РасчетыПоЭквайрингуОстатки.ВидПлатежнойКарты
		|			И ДвиженияРасчетыПоЭквайрингуИзменение.НомерПлатежнойКарты = РасчетыПоЭквайрингуОстатки.НомерПлатежнойКарты
		|ГДЕ
		|	(&УдалениеПроведения
		|				И (ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.СуммаВалОстаток, 0) < 0
		|					ИЛИ ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.КомиссияВалОстаток, 0) < 0)
		|			ИЛИ НЕ &УдалениеПроведения
		|				И (ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.СуммаВалОстаток, 0) <> 0
		|					ИЛИ ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.КомиссияВалОстаток, 0) <> 0))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		//+++ Дмгг
		Если (ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата
			ИЛИ ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников)  
			И СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Таблицы.Найти("ДвиженияОстаткиНалоговыхЛьготИзменение") <> Неопределено Тогда
			
			Запрос.Текст = Запрос.Текст + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДвиженияОстаткиНалоговыхЛьготИзменение.НомерСтроки КАК НомерСтроки,
			|	ДвиженияОстаткиНалоговыхЛьготИзменение.Организация КАК ОрганизацияПредставление,
			|	ДвиженияОстаткиНалоговыхЛьготИзменение.Сотрудник КАК СотрудникПредставление,
			|	ЕСТЬNULL(ОстаткиНалоговыхЛьготОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
			|	ДвиженияОстаткиНалоговыхЛьготИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
			|	ДвиженияОстаткиНалоговыхЛьготИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
			|	ДвиженияОстаткиНалоговыхЛьготИзменение.СуммаИзменение КАК СуммаИзменение
			|ИЗ
			|	ДвиженияОстаткиНалоговыхЛьготИзменение КАК ДвиженияОстаткиНалоговыхЛьготИзменение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНалоговыхЛьгот.Остатки(&МоментКонтроля, ) КАК ОстаткиНалоговыхЛьготОстатки
			|		ПО ДвиженияОстаткиНалоговыхЛьготИзменение.Организация = ОстаткиНалоговыхЛьготОстатки.Организация
			|			И ДвиженияОстаткиНалоговыхЛьготИзменение.Сотрудник = ОстаткиНалоговыхЛьготОстатки.Сотрудник
			|ГДЕ
			|	ЕСТЬNULL(ОстаткиНалоговыхЛьготОстатки.СуммаОстаток, 0) < 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
		КонецЕсли;
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Если НЕ ПроверятьИтогиРегистров Тогда 
			Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		Иначе 
			Запрос.УстановитьПараметр("МоментКонтроля", Дата(2999,12,31));
		КонецЕсли;
		Запрос.УстановитьПараметр("УдалениеПроведения", УдалениеПроведения);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Если НЕ МассивРезультатов[0].Пустой()
			ИЛИ НЕ МассивРезультатов[1].Пустой()
			ИЛИ НЕ МассивРезультатов[2].Пустой()
			//+++ Дмгг
			//ИЛИ НЕ МассивРезультатов[3].Пустой() Тогда
			ИЛИ НЕ МассивРезультатов[3].Пустой()
			ИЛИ (МассивРезультатов.Количество() = 5 И НЕ МассивРезультатов[4].Пустой()) Тогда
			//--- Дмгг
			ДокументОбъектРасходСоСчета = ДокументСсылкаРасходСоСчета.ПолучитьОбъект()
		КонецЕсли;
		
		// Отрицательный остаток по денежным средствам.
		Если НЕ МассивРезультатов[0].Пустой()И НЕ Константы.ОтключениеКонтроляОстатковВДокументахДенежныхСредств.Получить() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[0].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструДенежныеСредства(ДокументСсылкаРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструДенежныеСредства(ДокументСсылкаРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток по расчетам с подотчетными лицами.
		Если НЕ МассивРезультатов[1].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[1].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПодотчетниками(ДокументСсылкаРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПодотчетниками(ДокументСсылкаРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток по расчетам с поставщиками.
		Если НЕ МассивРезультатов[2].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[2].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПоставщиками(ДокументСсылкаРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПоставщиками(ДокументСсылкаРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Эквайринг
		// Отрицательный остаток расчетов по эквайрингу.
		Если НЕ МассивРезультатов[3].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[3].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыПоЭквайрингу(ДокументСсылкаРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыПоЭквайрингу(ДокументСсылкаРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		// Конец Эквайринг
		
		//+++ Дмгг
		// Отрицательный остаток Остатки налоговых льгот.
		Если (ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата
			ИЛИ ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников)  
			И СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Таблицы.Найти("ДвиженияОстаткиНалоговыхЛьготИзменение") <> Неопределено Тогда
			
			Если НЕ МассивРезультатов[4].Пустой() Тогда
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[4].Выбрать();
				Если НЕ ПроверятьИтогиРегистров Тогда 
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструОстаткиНалоговыхЛьгот(ДокументСсылкаРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ);
				Иначе 
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструОстаткиНалоговыхЛьгот(ДокументСсылкаРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		//--- Дмгг
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтроль()
//--- Дмгг

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область Эквайринг

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыПоЭквайрингу(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Если ДокументСсылкаРасходСоСчета.ВидОперации <> Перечисления.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЭквайрингу", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ОплатаПлатежнойКартой", "Оплата от банка-эквайрера");
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВозвратОплатыНаПлатежныеКарты", Перечисления.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям", ПолучитьФункциональнуюОпцию("РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям"));
	
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаДС", ДокументСсылкаРасходСоСчета.ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	// Блокировка
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходСоСчета.ЭквайринговыйТерминал,
	|	&Организация
	|ИЗ
	|	Документ.РасходСоСчета КАК РасходСоСчета
	|ГДЕ
	|	РасходСоСчета.Ссылка = &Ссылка
	|	И РасходСоСчета.ВидОперации = &ВозвратОплатыНаПлатежныеКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(РасходСоСчетаЭквайринговыеОперации.ДатаПлатежа) КАК ДатаНачала,
	|	МАКСИМУМ(РасходСоСчетаЭквайринговыеОперации.ДатаПлатежа) КАК ДатаОкончания
	|ИЗ
	|	Документ.РасходСоСчета.ЭквайринговыеОперации КАК РасходСоСчетаЭквайринговыеОперации
	|ГДЕ
	|	РасходСоСчетаЭквайринговыеОперации.Ссылка = &Ссылка
	|";

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыПоЭквайрингу");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = МассивРезультатов[0];
	
	Для каждого КолонкаРезультатЗапроса из МассивРезультатов[0].Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	
	Если ПолучитьФункциональнуюОпцию("РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям") Тогда
		Выборка = МассивРезультатов[1].Выбрать();
		Выборка.Следующий();
		Если Выборка.ДатаНачала <> Null И Выборка.ДатаНачала <> '00010101' Тогда
			ДиапазонДатПлатежа = Новый Диапазон(Выборка.ДатаНачала, Выборка.ДатаОкончания);
			ЭлементБлокировки.УстановитьЗначение("ДатаПлатежа", ДиапазонДатПлатежа);
		КонецЕсли;
	КонецЕсли;
	
	Блокировка.Заблокировать();
	// Конец Блокировка
	
	// Валюта расчетов и валюта платежа при эквайринговых операциях совпадает.
	// В документе не отображается информация о сумме платежа для вида операции "Продажи по платежным картам".
	// В этом случае достаточно для всех регистров использовать сумму расчетов.
	
	Если ПолучитьФункциональнуюОпцию("РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПараметрыУчетаЭквайринговыхОпераций.ЭквайринговыйТерминал,
		|	ПараметрыУчетаЭквайринговыхОпераций.ЭквайринговыйТерминал.СчетУчета КАК СчетУчетаЭквайринг,
		|	ПараметрыУчетаЭквайринговыхОпераций.ЭквайринговыйТерминал.СчетЗатрат КАК СчетЗатратЭквайринг,
		|	ПараметрыУчетаЭквайринговыхОпераций.НаправлениеДеятельностиЗатраты КАК НаправлениеДеятельностиЗатраты,
		|	ПараметрыУчетаЭквайринговыхОпераций.ПодразделениеЗатраты КАК ПодразделениеЗатраты,
		|	ПараметрыУчетаЭквайринговыхОпераций.НаправлениеДеятельностиЗатраты КАК НаправлениеДеятельностиЗатраты1,
		|	ПараметрыУчетаЭквайринговыхОпераций.ЭквайринговыйТерминал.СчетУчетаРегл КАК СчетУчетаЭквайрингРегл,
		|	ПараметрыУчетаЭквайринговыхОпераций.ЭквайринговыйТерминал.СчетЗатратРегл КАК СчетЗатратЭквайрингРегл,
		//+++ Дмгг
		|	ПараметрыУчетаЭквайринговыхОпераций.Проект КАК Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций
		|ИЗ
		|	Документ.РасходСоСчета КАК ПараметрыУчетаЭквайринговыхОпераций
		|ГДЕ
		|	ПараметрыУчетаЭквайринговыхОпераций.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	РасходСоСчетаЭквайринговыеОперации.НомерСтроки,
		|	РасходСоСчетаЭквайринговыеОперации.СуммаРасчетов + РасходСоСчетаЭквайринговыеОперации.СуммаРасчетовВозврата КАК СуммаВал,
		|	РасходСоСчетаЭквайринговыеОперации.СуммаРасчетовКомиссии + РасходСоСчетаЭквайринговыеОперации.СуммаРасчетовКомиссииВозврата КАК КомиссияВал,
		|	ВЫРАЗИТЬ((РасходСоСчетаЭквайринговыеОперации.СуммаРасчетов + РасходСоСчетаЭквайринговыеОперации.СуммаРасчетовВозврата) * КурсыВалютБанковскогоСчета.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютБанковскогоСчета.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫРАЗИТЬ((РасходСоСчетаЭквайринговыеОперации.СуммаРасчетовКомиссии + РасходСоСчетаЭквайринговыеОперации.СуммаРасчетовКомиссииВозврата) * КурсыВалютБанковскогоСчета.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютБанковскогоСчета.Кратность) КАК ЧИСЛО(15, 2)) КАК Комиссия,
		|	ВЫБОР
		|		КОГДА &РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям
		|			ТОГДА РасходСоСчетаЭквайринговыеОперации.Документ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Документ,
		|	ВЫБОР
		|		КОГДА &РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям
		|			ТОГДА РасходСоСчетаЭквайринговыеОперации.Заказ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Заказ,
		|	РасходСоСчетаЭквайринговыеОперации.Ссылка.ЭквайринговыйТерминал,
		|	ВЫБОР
		|		КОГДА &РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям
		|			ТОГДА РасходСоСчетаЭквайринговыеОперации.ДатаПлатежа
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаПлатежа,
		|	РасходСоСчетаЭквайринговыеОперации.НомерПлатежнойКарты,
		|	РасходСоСчетаЭквайринговыеОперации.ВидПлатежнойКарты,
		|	&Организация,
		|	РасходСоСчетаЭквайринговыеОперации.Ссылка.Контрагент КАК Эквайрер,
		|	ВЫБОР
		|		КОГДА РасходСоСчетаЭквайринговыеОперации.Документ ССЫЛКА Документ.ОперацияПоПлатежнымКартам
		|			ТОГДА РасходСоСчетаЭквайринговыеОперации.Документ.ВидОперации
		|		КОГДА РасходСоСчетаЭквайринговыеОперации.СуммаРасчетов > 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЭквайринга.ПоступлениеОплатыОтПокупателя)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЭквайринга.ВозвратОплатыПокупателю)
		|	КОНЕЦ КАК ВидОперацииЭквайринга,
		|	&ОплатаПлатежнойКартой КАК СодержаниеПроводки,
		|	РасходСоСчетаЭквайринговыеОперации.Ссылка.Дата КАК Период,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.СчетУчетаЭквайринг,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.СчетЗатратЭквайринг,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.СчетУчетаЭквайрингРегл,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.СчетЗатратЭквайрингРегл,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.НаправлениеДеятельностиЗатраты КАК НаправлениеДеятельности,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.СчетУчетаЭквайринг.ТипСчета КАК СчетУчетаЭквайрингТипСчета,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.СчетЗатратЭквайринг.ТипСчета КАК СчетЗатратЭквайрингТипСчета,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.ПодразделениеЗатраты КАК Подразделение,
		//+++ Дмгг
		|	РасходСоСчетаЭквайринговыеОперации.Ссылка.Проект КАК Проект
		//--- Дмгг
		|ИЗ
		|	Документ.РасходСоСчета.ЭквайринговыеОперации КАК РасходСоСчетаЭквайринговыеОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчета
		|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютБанковскогоСчета
		|		ПО (КурсыВалютБанковскогоСчета.Валюта = &ВалютаДС)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций КАК ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций
		|		ПО РасходСоСчетаЭквайринговыеОперации.Ссылка.ЭквайринговыйТерминал = ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.ЭквайринговыйТерминал
		|ГДЕ
		|	РасходСоСчетаЭквайринговыеОперации.Ссылка = &Ссылка";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПараметрыУчетаЭквайринговыхОпераций.ЭквайринговыйТерминал,
		|	ПараметрыУчетаЭквайринговыхОпераций.ЭквайринговыйТерминал.СчетУчета КАК СчетУчетаЭквайринг,
		|	ПараметрыУчетаЭквайринговыхОпераций.ЭквайринговыйТерминал.СчетЗатрат КАК СчетЗатратЭквайринг,
		|	ПараметрыУчетаЭквайринговыхОпераций.НаправлениеДеятельностиЗатраты КАК НаправлениеДеятельностиЗатраты,
		|	ПараметрыУчетаЭквайринговыхОпераций.ПодразделениеЗатраты КАК ПодразделениеЗатраты,
		|	ПараметрыУчетаЭквайринговыхОпераций.НаправлениеДеятельностиЗатраты КАК НаправлениеДеятельностиЗатраты1,
		|	ПараметрыУчетаЭквайринговыхОпераций.ЭквайринговыйТерминал.СчетУчетаРегл КАК СчетУчетаЭквайрингРегл,
		|	ПараметрыУчетаЭквайринговыхОпераций.ЭквайринговыйТерминал.СчетЗатратРегл КАК СчетЗатратЭквайрингРегл,
		//+++ Дмгг
		|	ПараметрыУчетаЭквайринговыхОпераций.Проект КАК Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций
		|ИЗ
		|	Документ.РасходСоСчета КАК ПараметрыУчетаЭквайринговыхОпераций
		|ГДЕ
		|	ПараметрыУчетаЭквайринговыхОпераций.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	РасходСоСчетаЭквайринговыеОперации.НомерСтроки,
		|	-(РасходСоСчетаЭквайринговыеОперации.СуммаРасчетов + РасходСоСчетаЭквайринговыеОперации.СуммаРасчетовВозврата) КАК СуммаВал,
		|	РасходСоСчетаЭквайринговыеОперации.СуммаРасчетовКомиссии + РасходСоСчетаЭквайринговыеОперации.СуммаРасчетовКомиссииВозврата КАК КомиссияВал,
		|	-(ВЫРАЗИТЬ((РасходСоСчетаЭквайринговыеОперации.СуммаРасчетов + РасходСоСчетаЭквайринговыеОперации.СуммаРасчетовВозврата) * КурсыВалютБанковскогоСчета.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютБанковскогоСчета.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
		|	ВЫРАЗИТЬ((РасходСоСчетаЭквайринговыеОперации.СуммаРасчетовКомиссии + РасходСоСчетаЭквайринговыеОперации.СуммаРасчетовКомиссииВозврата) * КурсыВалютБанковскогоСчета.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютБанковскогоСчета.Кратность) КАК ЧИСЛО(15, 2)) КАК Комиссия,
		|	ЗНАЧЕНИЕ(Документ.ОперацияПоПлатежнымКартам.ПустаяСсылка) КАК Документ,
		|	НЕОПРЕДЕЛЕНО КАК Заказ,
		|	РасходСоСчетаЭквайринговыеОперации.Ссылка.ЭквайринговыйТерминал,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПлатежа,
		|	"""" КАК НомерПлатежнойКарты,
		|	"""" КАК ВидПлатежнойКарты,
		|	&Организация,
		|	НЕОПРЕДЕЛЕНО КАК Эквайрер,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЭквайринга.ПустаяСсылка) КАК ВидОперацииЭквайринга,
		|	&ОплатаПлатежнойКартой КАК СодержаниеПроводки,
		|	РасходСоСчетаЭквайринговыеОперации.Ссылка.Дата КАК Период,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.СчетУчетаЭквайринг,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.СчетЗатратЭквайринг,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.СчетУчетаЭквайрингРегл,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.СчетЗатратЭквайрингРегл,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.НаправлениеДеятельностиЗатраты КАК НаправлениеДеятельности,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.СчетУчетаЭквайринг.ТипСчета КАК СчетУчетаЭквайрингТипСчета,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.СчетЗатратЭквайринг.ТипСчета КАК СчетЗатратЭквайрингТипСчета,
		|	ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.ПодразделениеЗатраты КАК Подразделение,
		//+++ Дмгг
		|	РасходСоСчетаЭквайринговыеОперации.Ссылка.Проект КАК Проект
		//--- Дмгг
		|ИЗ
		|	Документ.РасходСоСчета.ЭквайринговыеОперации КАК РасходСоСчетаЭквайринговыеОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчета
		|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютБанковскогоСчета
		|		ПО (КурсыВалютБанковскогоСчета.Валюта = &ВалютаДС)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций КАК ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций
		|		ПО РасходСоСчетаЭквайринговыеОперации.Ссылка.ЭквайринговыйТерминал = ВременнаяТаблицаПараметрыУчетаЭквайринговыхОпераций.ЭквайринговыйТерминал
		|ГДЕ
		|	РасходСоСчетаЭквайринговыеОперации.Ссылка = &Ссылка";
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЭквайрингу", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПлатежныйКалендарь()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыКассовыйМетодЭквайринг(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Если Не СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов Или
		ДокументСсылкаРасходСоСчета.ВидОперации <> Перечисления.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыКассовыйМетодЭквайринг", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	ТаблицаРасчетыПоЭквайрингу = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыПоЭквайрингу;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	Запрос.УстановитьПараметр("ТаблицаРасчетыПоЭквайрингу", ТаблицаРасчетыПоЭквайрингу);
	Запрос.УстановитьПараметр("МоментКонтроля", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментКонтроля, ВидГраницы.Включая));

	// Установка исключительной блокировки контролируемых остатков запасов.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетыПоЭквайрингу.Организация,
	|	РасчетыПоЭквайрингу.Документ
	|ПОМЕСТИТЬ ВременнаяТаблицаИсточникДанныхДляБлокировки
	|ИЗ
	|	&ТаблицаРасчетыПоЭквайрингу КАК РасчетыПоЭквайрингу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаИсточникДанныхДляБлокировки.Организация,
	|	ВременнаяТаблицаИсточникДанныхДляБлокировки.Документ
	|ИЗ
	|	ВременнаяТаблицаИсточникДанныхДляБлокировки КАК ВременнаяТаблицаИсточникДанныхДляБлокировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаИсточникДанныхДляБлокировки.Документ,
	|	ВременнаяТаблицаИсточникДанныхДляБлокировки.Организация";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДоходыИРасходыКассовыйМетодЭквайринг");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	// Получение остатков.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаРасчетыПоЭквайрингу.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
		|	ТаблицаРасчетыПоЭквайрингу.Документ КАК Документ,
		|	ТаблицаРасчетыПоЭквайрингу.ДатаПлатежа КАК ДатаПлатежа,
		|	ТаблицаРасчетыПоЭквайрингу.Сумма КАК Сумма,
		|	ТаблицаРасчетыПоЭквайрингу.СуммаВал КАК СуммаВал,
		|	ТаблицаРасчетыПоЭквайрингу.Комиссия КАК Комиссия,
		|	ТаблицаРасчетыПоЭквайрингу.КомиссияВал КАК КомиссияВал,
		|	ТаблицаРасчетыПоЭквайрингу.ВидОперацииЭквайринга КАК ВидОперацииЭквайринга,
		|	ТаблицаРасчетыПоЭквайрингу.НаправлениеДеятельности КАК НаправлениеДеятельности,
		////+++ Дмгг
		//|	ТаблицаРасчетыПоЭквайрингу.Проект КАК Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ТаблицаРасчетыПоЭквайрингу.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ТаблицаРасчетыПоЭквайрингу.Проект
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ПОМЕСТИТЬ ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам
		|ИЗ
		|	&ТаблицаРасчетыПоЭквайрингу КАК ТаблицаРасчетыПоЭквайрингу
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЭквайринговыйТерминал,
		|	Документ,
		|	ДатаПлатежа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыИРасходыКассовыйМетодЭквайрингОстатки.Документ,
		|	ДоходыИРасходыКассовыйМетодЭквайрингОстатки.Организация,
		|	ДоходыИРасходыКассовыйМетодЭквайрингОстатки.НаправлениеДеятельности,
		|	ДоходыИРасходыКассовыйМетодЭквайрингОстатки.Статья,
		|	ДоходыИРасходыКассовыйМетодЭквайрингОстатки.СуммаДоходовОстаток,
		|	ДоходыИРасходыКассовыйМетодЭквайрингОстатки.СуммаРасходовОстаток,
		|	ДоходыИРасходыКассовыйМетодЭквайрингОстатки.СуммаКомиссииДоходовОстаток,
		|	ДоходыИРасходыКассовыйМетодЭквайрингОстатки.СуммаКомиссииРасходовОстаток,
		|	ДоходыИРасходыКассовыйМетодЭквайрингОстатки.ВидОперацииЭквайринга,
		////+++ Дмгг
		//|	ДоходыИРасходыКассовыйМетодЭквайрингОстатки.Проект КАК Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ДоходыИРасходыКассовыйМетодЭквайрингОстатки.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ДоходыИРасходыКассовыйМетодЭквайрингОстатки.Проект
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ПОМЕСТИТЬ ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки
		|ИЗ
		|	РегистрНакопления.ДоходыИРасходыКассовыйМетодЭквайринг.Остатки(
		|			&МоментКонтроля,
		|			Документ В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.Документ
		|				ИЗ
		|					ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам КАК ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам)) КАК ДоходыИРасходыКассовыйМетодЭквайрингОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДоходыИРасходыКассовыйМетодЭквайринг.Документ,
		|	ДоходыИРасходыКассовыйМетодЭквайринг.Организация,
		|	ДоходыИРасходыКассовыйМетодЭквайринг.НаправлениеДеятельности,
		|	ДоходыИРасходыКассовыйМетодЭквайринг.Статья,
		|	ВЫБОР
		|		КОГДА ДоходыИРасходыКассовыйМетодЭквайринг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА ЕСТЬNULL(ДоходыИРасходыКассовыйМетодЭквайринг.СуммаДоходов, 0)
		|		ИНАЧЕ -ЕСТЬNULL(ДоходыИРасходыКассовыйМетодЭквайринг.СуммаДоходов, 0)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДоходыИРасходыКассовыйМетодЭквайринг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА ЕСТЬNULL(ДоходыИРасходыКассовыйМетодЭквайринг.СуммаРасходов, 0)
		|		ИНАЧЕ -ЕСТЬNULL(ДоходыИРасходыКассовыйМетодЭквайринг.СуммаРасходов, 0)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДоходыИРасходыКассовыйМетодЭквайринг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА ЕСТЬNULL(ДоходыИРасходыКассовыйМетодЭквайринг.СуммаКомиссииДоходов, 0)
		|		ИНАЧЕ -ЕСТЬNULL(ДоходыИРасходыКассовыйМетодЭквайринг.СуммаКомиссииДоходов, 0)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДоходыИРасходыКассовыйМетодЭквайринг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА ЕСТЬNULL(ДоходыИРасходыКассовыйМетодЭквайринг.СуммаКомиссииРасходов, 0)
		|		ИНАЧЕ -ЕСТЬNULL(ДоходыИРасходыКассовыйМетодЭквайринг.СуммаКомиссииРасходов, 0)
		|	КОНЕЦ,
		|	ДоходыИРасходыКассовыйМетодЭквайринг.ВидОперацииЭквайринга,
		////+++ Дмгг
		//|	ДоходыИРасходыКассовыйМетодЭквайринг.Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ДоходыИРасходыКассовыйМетодЭквайринг.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ДоходыИРасходыКассовыйМетодЭквайринг.Проект
		|	КОНЕЦ 
		//Lazare_ 09.03.2021
		|ИЗ
		|	РегистрНакопления.ДоходыИРасходыКассовыйМетодЭквайринг КАК ДоходыИРасходыКассовыйМетодЭквайринг
		|ГДЕ
		|	ДоходыИРасходыКассовыйМетодЭквайринг.Регистратор = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.Документ,
		|	ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.Организация,
		|	ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.НаправлениеДеятельности,
		|	ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.Статья,
		|	-СУММА(ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.СуммаДоходовОстаток) КАК СуммаДоходовОстаток,
		|	СУММА(ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.СуммаРасходовОстаток) КАК СуммаРасходовОстаток,
		|	СУММА(ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.СуммаКомиссииДоходовОстаток) КАК СуммаКомиссииДоходовОстаток,
		|	СУММА(ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.СуммаКомиссииРасходовОстаток) КАК СуммаКомиссииРасходовОстаток,
		|	ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.ВидОперацииЭквайринга,
		////+++ Дмгг
		//|	ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.Проект КАК Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.Проект
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки КАК ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки
		|
		|СГРУППИРОВАТЬ ПО
		////+++ Дмгг
		//|	ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.Проект,
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.Проект
		|	КОНЕЦ,
		//Lazare_ 09.03.2021
		|	ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.Документ,
		|	ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.Организация,
		|	ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.НаправлениеДеятельности,
		|	ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.Статья,
		|	ВременнаяТаблицаДоходыИРасходыКассовыйМетодЭквайрингОстатки.ВидОперацииЭквайринга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.Документ КАК Документ,
		|	ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.ДатаПлатежа,
		|	СУММА(ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.Сумма) КАК Сумма,
		|	СУММА(ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.Комиссия) КАК Комиссия,
		|	ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.НаправлениеДеятельности КАК НаправлениеДеятельностиЗатраты,
		|	ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.ВидОперацииЭквайринга,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.ВидОперацииЭквайринга = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЭквайринга.ВозвратОплатыПокупателю)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоВозврат,
		////+++ Дмгг
		//|	ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.Проект КАК Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.Проект
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам КАК ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам
		|
		|СГРУППИРОВАТЬ ПО
		//+++ Дмгг
		|	ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.Проект,
		//--- Дмгг
		|	ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.Документ,
		|	ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.ДатаПлатежа,
		|	ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.ВидОперацииЭквайринга,
		|	ВременнаяТаблицаЗачтенаОплатаПоПлатежнымКартам.НаправлениеДеятельности";
	
	МРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаДоходыИРасходыКассовыйМетодЭквайринг = РегистрыНакопления.ДоходыИРасходыКассовыйМетодЭквайринг.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ТаблицаДоходыИРасходыКассовыйМетод = РегистрыНакопления.ДоходыИРасходыКассовыйМетод.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	ТаблицаДоходыИРасходыКассовыйМетодЭквайринг.Колонки.Удалить("Активность");
	ТаблицаДоходыИРасходыКассовыйМетод.Колонки.Удалить("Активность");
	
	ТаблицаДоходыИРасходыЭквайринг = МРезультатов[2].Выгрузить();
	ВыборкаИтоги = МРезультатов[3].Выбрать();
	
	// По данным о зачтенных суммах перенесем данные из регистра ДоходыИРасходыКассовыйМетодЭквайринг в регистр ТаблицаДоходыИРасходыЭквайринг.
	Пока ВыборкаИтоги.Следующий() Цикл
		
		ПараметрыОтбора = Новый Структура("Документ, ВидОперацииЭквайринга", ВыборкаИтоги.Документ, ВыборкаИтоги.ВидОперацииЭквайринга);
		ТаблицаРезультатПоиска = ТаблицаДоходыИРасходыЭквайринг.НайтиСтроки(ПараметрыОтбора);
		МожноЗачесть = ВыборкаИтоги.Сумма;
		МожноЗачестьКомиссию = ВыборкаИтоги.Комиссия;
		
		Если ЗначениеЗаполнено(ТаблицаРезультатПоиска) Тогда
			Для Каждого ТекущаяСтрока Из ТаблицаРезультатПоиска Цикл
				
				// Сумма оплаты (вместе с комиссией).
				Если (МожноЗачесть > 0 И ТекущаяСтрока.СуммаДоходовОстаток > 0) Тогда
					
					НоваяСтрокаЭквайринг = ТаблицаДоходыИРасходыКассовыйМетодЭквайринг.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаЭквайринг, ТекущаяСтрока);
					НоваяСтрокаЭквайринг.ВидДвижения = ВидДвиженияНакопления.Расход;
					НоваяСтрокаЭквайринг.Период = СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата;
					
					Если МожноЗачесть >= ТекущаяСтрока.СуммаДоходовОстаток Тогда
						НоваяСтрокаЭквайринг.СуммаДоходов = -ТекущаяСтрока.СуммаДоходовОстаток;
						МожноЗачесть = МожноЗачесть - ТекущаяСтрока.СуммаДоходовОстаток;
					Иначе
						НоваяСтрокаЭквайринг.СуммаДоходов = -МожноЗачесть;
						МожноЗачесть = 0;
					КонецЕсли;
					
					НоваяСтрока = ТаблицаДоходыИРасходыКассовыйМетод.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, НоваяСтрокаЭквайринг);
					Если ВыборкаИтоги.ЭтоВозврат Тогда
						НоваяСтрока.СуммаДоходов = НоваяСтрока.СуммаДоходов;
					КонецЕсли;
					
				КонецЕсли;
				
				// Сумма комиссии.
				Если МожноЗачестьКомиссию > 0 И ТекущаяСтрока.СуммаКомиссииДоходовОстаток > 0 Тогда
					НоваяСтрокаЭквайринг = ТаблицаДоходыИРасходыКассовыйМетодЭквайринг.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаЭквайринг, ТекущаяСтрока);
					НоваяСтрокаЭквайринг.ВидДвижения = ВидДвиженияНакопления.Расход;
					НоваяСтрокаЭквайринг.Период = СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата;
					
					Если МожноЗачестьКомиссию > ТекущаяСтрока.СуммаКомиссииДоходовОстаток Тогда
						НоваяСтрокаЭквайринг.СуммаКомиссииДоходов = ТекущаяСтрока.СуммаКомиссииДоходовОстаток;
						МожноЗачестьКомиссию = МожноЗачестьКомиссию - ТекущаяСтрока.СуммаКомиссииДоходовОстаток;
					Иначе
						НоваяСтрокаЭквайринг.СуммаКомиссииДоходов = МожноЗачестьКомиссию;
						МожноЗачестьКомиссию = 0;
					КонецЕсли;
				
					НоваяСтрока = ТаблицаДоходыИРасходыКассовыйМетод.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, НоваяСтрокаЭквайринг);
					НоваяСтрока.СуммаДоходов = 0;
					НоваяСтрока.СуммаРасходов = НоваяСтрокаЭквайринг.СуммаКомиссииДоходов;
					НоваяСтрока.НаправлениеДеятельности = ДокументСсылкаРасходСоСчета.НаправлениеДеятельностиЗатраты;
				КонецЕсли;
				
				Если МожноЗачесть = 0 и МожноЗачестьКомиссию = 0 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		// Ситуация может возникнуть, когда поступление на счет оформляется РАНЬШЕ чем операция оплаты, которая указан в ТЧ "ЭквайринговыеОперации".
		// Данная ситуация обрабатываевтся перед записью текущего документа на сервере.
		// Возможны и другие ситуации.
		Если МожноЗачестьКомиссию > 0 Или МожноЗачесть <> 0 Тогда
			
			Продолжить;
			
			Если МожноЗачесть > 0 Тогда
				
				НоваяСтрокаЭквайринг = ТаблицаДоходыИРасходыКассовыйМетодЭквайринг.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаЭквайринг, ВыборкаИтоги);
				НоваяСтрокаЭквайринг.Организация = СтруктураДополнительныеСвойства.ДляПроведения.Организация;
				НоваяСтрокаЭквайринг.ВидДвижения = ВидДвиженияНакопления.Расход;
				НоваяСтрокаЭквайринг.Период = СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата;
				
				НоваяСтрокаЭквайринг.СуммаДоходов = -МожноЗачесть;
				НоваяСтрокаЭквайринг.Комментарий = "Сумма не распределилась по остаткам";
				
				НоваяСтрока = ТаблицаДоходыИРасходыКассовыйМетод.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НоваяСтрокаЭквайринг);
				Если ВыборкаИтоги.ЭтоВозврат Тогда
					НоваяСтрока.СуммаДоходов = НоваяСтрока.СуммаДоходов;
				КонецЕсли;
				
			КонецЕсли;
					
			Если МожноЗачестьКомиссию > 0 Тогда
				
				НоваяСтрокаЭквайринг = ТаблицаДоходыИРасходыКассовыйМетодЭквайринг.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаЭквайринг, ВыборкаИтоги);
				НоваяСтрокаЭквайринг.Организация = СтруктураДополнительныеСвойства.ДляПроведения.Организация;
				НоваяСтрокаЭквайринг.ВидДвижения = ВидДвиженияНакопления.Расход;
				НоваяСтрокаЭквайринг.Период = СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата;
				
				НоваяСтрокаЭквайринг.СуммаКомиссииДоходов = МожноЗачестьКомиссию;
				НоваяСтрокаЭквайринг.Комментарий = "Сумма не распределилась по остаткам";
				
				НоваяСтрока = ТаблицаДоходыИРасходыКассовыйМетод.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НоваяСтрокаЭквайринг);
				НоваяСтрока.СуммаДоходов = 0;
				НоваяСтрока.СуммаРасходов = НоваяСтрокаЭквайринг.СуммаКомиссииДоходов;
				НоваяСтрока.НаправлениеДеятельности = ВыборкаИтоги.НаправлениеДеятельностиЗатраты;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыКассовыйМетодЭквайринг", ТаблицаДоходыИРасходыКассовыйМетодЭквайринг);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыКассовыйМетод", ТаблицаДоходыИРасходыКассовыйМетод);
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыКассовыйМетод()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыЭквайринг(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	ТаблицаРасчетыПоЭквайрингу = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыПоЭквайрингу;
	ТаблицаДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	Для каждого ТекущаяСтрокаРасчетов Из ТаблицаРасчетыПоЭквайрингу Цикл
	
		Если ТекущаяСтрокаРасчетов.Комиссия = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = ТаблицаДоходыИРасходы.Добавить();
		Движение.Период = СтруктураДополнительныеСвойства.ДляПроведения.Дата;
		Движение.Организация = СтруктураДополнительныеСвойства.ДляПроведения.Организация;
				
		Если Не ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(ДокументСсылкаРасходСоСчета.Дата),ДокументСсылкаРасходСоСчета.Дата,ТекущаяДата())) Тогда
			Движение.СчетУчета = ТекущаяСтрокаРасчетов.СчетЗатратЭквайринг;
		Иначе
			Движение.СчетУчета = Неопределено;
		КонецЕсли;
		
		Движение.СчетУчетаРегл = ТекущаяСтрокаРасчетов.СчетЗатратЭквайрингРегл;
		Движение.Аналитика = ТекущаяСтрокаРасчетов.Эквайрер;
		Если ТекущаяСтрокаРасчетов.СчетЗатратЭквайрингТипСчета = ПредопределенноеЗначение("Перечисление.ТипыСчетов.Расходы") Тогда
			Движение.НаправлениеДеятельности = ТекущаяСтрокаРасчетов.НаправлениеДеятельности;
			Движение.ЗаказПокупателя = ТекущаяСтрокаРасчетов.Заказ;
			Движение.СтруктурнаяЕдиница = ТекущаяСтрокаРасчетов.Подразделение;
		Иначе
			Движение.НаправлениеДеятельности = ПредопределенноеЗначение("Справочник.НаправленияДеятельности.Прочее");
			Движение.ЗаказПокупателя = Неопределено;
			Движение.СтруктурнаяЕдиница = Неопределено;
		КонецЕсли;
		Движение.СуммаРасходов = ТекущаяСтрокаРасчетов.Комиссия;
		Движение.СодержаниеПроводки = НСтр("ka='ბანკი-ესქვაირერის კომისია';ru='Комиссия банка-эквайера';en='acquiring bank commission'");
		Движение.Активность = Истина;
		
	КонецЦикла;
	
	Если ТаблицаДоходыИРасходы.Количество() > 0 Тогда
		Если СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Количество() = 0 Тогда
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", ТаблицаДоходыИРасходы);
		Иначе
			
			Для Каждого ТекущаяСтрока Из ТаблицаДоходыИРасходы Цикл
				НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

#КонецОбласти

#Область ПрочиеРасчеты

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПрочимиКонтрагентами(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("УчетРасчетовПоПрочимОперациям", НСтр("ka='სხვა ოპერაციების მიხედვით ანგარიშსწორების აღრიცხვა';ru='Учет расчетов по прочим операциям';en='The account of calculations on other transactions'"));
	Запрос.УстановитьПараметр("Комментарий", НСтр("ka='კონტრაგენტის ვალის გაზრდა';ru='Увеличение долга контрагента';en='The increase in the debt of the counterparty'"));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Документ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|							ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.Документ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|							ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.Документ = НЕОПРЕДЕЛЕНО
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов КАК Валюта,
	|	ВременнаяТаблицаШапка.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Дата,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК Сумма,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВал,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК СуммаДляОстатка,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВалДляОстатка,
	|	&УчетРасчетовПоПрочимОперациям КАК СодержаниеПроводки,
	|	&Комментарий КАК Комментарий,
	|	ВременнаяТаблицаШапка.Корреспонденция КАК СчетУчета,
	//+++
	|	ВременнаяТаблицаШапка.КорреспонденцияРегл КАК СчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья КАК Статья,
	//---
	|	ВременнаяТаблицаШапка.БанковскийСчет КАК БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Период,
	//+++ Дмгг
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	//--- Дмгг
	////_Lazare 09.03.2021
	//	|	ВЫБОР 
	//	|		 КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//	|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//	|        ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//	|	КОНЕЦ КАК Проект
	////Lazare_ 09.03.2021
	|ПОМЕСТИТЬ ВременнаяТаблицаПрочиеРасчеты
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ПО (ВременнаяТаблицаШапка.УчетПрочихРасчетов)
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	////_Lazare 09.03.2021
	//	|	ВЫБОР 
	//	|		 КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//	|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//	|        ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//	|	КОНЕЦ,
	////Lazare_ 09.03.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов,
	|	ВременнаяТаблицаШапка.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Документ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|							ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.Документ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|							ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.Документ = НЕОПРЕДЕЛЕНО
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВременнаяТаблицаШапка.Корреспонденция,
	//+++
	|	ВременнаяТаблицаШапка.КорреспонденцияРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	//---
	|	ВременнаяТаблицаШапка.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с подотчетными лицами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаПрочиеРасчеты.СчетУчета КАК СчетУчета,
	|	ВременнаяТаблицаПрочиеРасчеты.Организация КАК Организация,
	|	ВременнаяТаблицаПрочиеРасчеты.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаПрочиеРасчеты.Договор КАК Договор,
	|	ВременнаяТаблицаПрочиеРасчеты.Проект КАК Проект
	|ИЗ
	|	ВременнаяТаблицаПрочиеРасчеты КАК ВременнаяТаблицаПрочиеРасчеты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПрочимиКонтрагентами");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоПрочимОперациям(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоПрочимОперациямРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПрочимиКонтрагентами", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПрочимиКонтрагентами()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыПоКредитамИЗаймам(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("УчетРасчетовПоЗаймамСотрудникам", НСтр("ka='თანამშრომლისთვის სესხის გაცემა';ru='Выдача займа сотруднику';en='Issuance of the loan officer'"));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаДС", ДокументСсылкаРасходСоСчета.ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА РасходСоСчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.КредитПолученный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику)
	|	КОНЕЦ КАК ВидДоговора,
	|	РасходСоСчета.Дата КАК Дата,
	|	РасходСоСчета.Дата КАК Период,
	|	&УчетРасчетовПоЗаймамСотрудникам КАК СодержаниеПроводки,
	|	РасходСоСчета.Подотчетник КАК Контрагент,
	|	РасходСоСчета.СуммаДокумента КАК СуммаПлатежа,
	|	ВЫРАЗИТЬ(РасходСоСчета.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютДоговора.Кратность / (КурсыВалютДоговора.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК ОсновнойДолгВал,
	|	ВЫРАЗИТЬ(РасходСоСчета.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК ОсновнойДолг,
	|	ВЫРАЗИТЬ(РасходСоСчета.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютДоговора.Кратность / (КурсыВалютДоговора.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК ОсновнойДолгВалДляОстатка,
	|	ВЫРАЗИТЬ(РасходСоСчета.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК ОсновнойДолгДляОстатка,
	|	0 КАК ПроцентыВал,
	|	0 КАК Проценты,
	|	0 КАК ПроцентыВалДляОстатка,
	|	0 КАК ПроцентыДляОстатка,
	|	0 КАК КомиссияВал,
	|	0 КАК Комиссия,
	|	0 КАК КомиссияВалДляОстатка,
	|	0 КАК КомиссияДляОстатка,
	|	ВЫРАЗИТЬ(РасходСоСчета.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютДоговора.Кратность / (КурсыВалютДоговора.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаВал,
	|	ВЫРАЗИТЬ(РасходСоСчета.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	РасходСоСчета.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
	|	РасходСоСчета.ДоговорКредитаЗайма.ВалютаРасчетов КАК Валюта,
	|	РасходСоСчета.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	РасходСоСчета.ДоговорКредитаЗайма.СчетУчета КАК СчетУчета,
	//+++
	|	РасходСоСчета.ДоговорКредитаЗайма.СчетУчетаРегл КАК СчетУчетаРегл,
	|	РасходСоСчета.Статья КАК Статья,
	//---
	|	ЛОЖЬ КАК УдержаноИзЗарплаты,
	|	РасходСоСчета.БанковскийСчет,
	////+++ Дмгг
	//|	РасходСоСчета.ПроектДляЗачетаАвансаСПомощником КАК Проект
	////--- Дмгг
	//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА РасходСоСчета.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ РасходСоСчета.ПроектДляЗачетаАвансаСПомощником
		|	КОНЕЦ КАК Проект
	//Lazare_ 09.03.2021
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыПоКредитамИЗаймам
	|ИЗ
	|	Документ.РасходСоСчета КАК РасходСоСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютДоговора
	|		ПО (КурсыВалютДоговора.Валюта = РасходСоСчета.ДоговорКредитаЗайма.ВалютаРасчетов)
	|ГДЕ
	|	РасходСоСчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|	И РасходСоСчета.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.КредитПолученный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику)
	|	КОНЕЦ,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.СодержаниеПоТипуСуммы,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.СуммаПлатежа,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаРасчетов,
	|	ТаблицаДокумента.СуммаУчета,
	|	ТаблицаДокумента.ДоговорКредитаЗайма,
	|	ТаблицаДокумента.ДоговорКредитаЗайма.ВалютаРасчетов,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.СчетУчета
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.СчетУчетаПроцентов
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.СчетУчетаКомиссии
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	//+++
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.СчетУчетаРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.СчетУчетаКомиссииРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья КАК Статья,
	//---
	|	ЛОЖЬ,
	|	ТаблицаДокумента.БанковскийСчет,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект КАК Проект
	////--- Дмгг
	//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ТаблицаДокумента.Проект
		|	КОНЕЦ КАК Проект
	//Lazare_ 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с подотчетными лицами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
	////+++ Дмгг
	//|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам.Проект КАК Проект
	////--- Дмгг
	//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВременнаяТаблицаРасчетыПоКредитамИЗаймам.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВременнаяТаблицаРасчетыПоКредитамИЗаймам.Проект
		|	КОНЕЦ КАК Проект
	//Lazare_ 09.03.2021
	|ИЗ
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам КАК ВременнаяТаблицаРасчетыПоКредитамИЗаймам";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыПоКредитамИЗаймам");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоКредитамИЗаймам(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоКредитамИЗаймамРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоКредитамИЗаймам", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область Доработки
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий_РС(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", Новый ТаблицаЗначений);
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	//
	//Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	//Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	//Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	//Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	//Запрос.УстановитьПараметр("Содержание", НСтр("ka='ფულადი სახსრების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание денежных средств на произвольный счет';en='Debiting an arbitrary score'"));
	//Запрос.УстановитьПараметр("СодержаниеСнятиеНаличных", НСтр("ka='Оприходование денежных средств в кассу';ru='Оприходование денежных средств в кассу';en='Posting of cash on hand'"));
	//Запрос.УстановитьПараметр("ОплатаНалога", НСтр("ka='გადასახადის გადახდა';ru='Оплата налога';en='Payment of tax'"));
	//Запрос.УстановитьПараметр("СодержаниеОплатаОтБанкаЭквайрера", НСтр("ka='გადახდა ეკვაირერი ბანკისგან';ru='Оплата от банка-эквайрера';en='Payment by the acquirer'"));
	//Запрос.УстановитьПараметр("СодержаниеКомиссияБанкаЭквайрера", НСтр("ka='ბანკი-ექვაირერის კომისია';ru='Комиссия банка-эквайрера';en='the acquirer Commission'"));
	//Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	//Запрос.УстановитьПараметр("ИспользуютсяПереводыВПути",РегистрыСведений.ПрименениеПереводовВПути.ИспользуютсяПереводыВПути(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата,СтруктураДополнительныеСвойства.ДляПроведения.Организация));
	////Паганини
	////Добавлена таблица 18;
	//Запрос.УстановитьПараметр("НДФЛ", НСтр("ka='საშემოსავლო';ru='НДФЛ';en='НДФЛ'"));
	//Запрос.УстановитьПараметр("КурсоваяРазницаНДФЛ", НСтр("ka='Курсовая разница НДФЛ';ru='Курсовая разница НДФЛ';en='The exchange rate difference of personal income tax'"));
	////_Паганини
	//Запрос.УстановитьПараметр("СодержаниеПроводкиПоЗарплате",НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога';en='tax accrual'"));

	//
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	1 КАК Порядок,
	//|	1 КАК НомерСтроки,
	//|	ТаблицаДокумента.Дата КАК Период,
	//|	&Организация КАК Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	//|	ТаблицаДокумента.Корреспонденция КАК СчетДт,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета КАК СчетКт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Корреспонденция.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК ВалютаДт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК ВалютаКт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Корреспонденция.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаДокумента
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК СуммаВалДт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаДокумента
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК СуммаВалКт,
	//|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * КурсыВалютРасчетов.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	//|			ТОГДА ВЫРАЗИТЬ(&СодержаниеСнятиеНаличных КАК СТРОКА(100))
	//|		ИНАЧЕ ВЫРАЗИТЬ(&Содержание КАК СТРОКА(100))
	//|	КОНЕЦ КАК Содержание
	//|ИЗ
	//|	Документ.РасходСоСчета КАК ТаблицаДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчетаСрезПоследних
	//|		ПО (ИСТИНА)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	//|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютРасчетов.Валюта
	//|ГДЕ
	//|	ТаблицаДокумента.Ссылка = &Ссылка
	//|	И (ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	//|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	//|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	//|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	//|				И &ИспользуютсяПереводыВПути)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	2,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	&Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.ВидНалога.СчетУчета,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ВидНалога.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ВидНалога.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаДокумента
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаДокумента
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * КурсыВалютРасчетов.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)),
	//|	ВЫРАЗИТЬ(&ОплатаНалога КАК СТРОКА(100))
	//|ИЗ
	//|	Документ.РасходСоСчета КАК ТаблицаДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчетаСрезПоследних
	//|		ПО (ИСТИНА)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	//|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютРасчетов.Валюта
	//|ГДЕ
	//|	ТаблицаДокумента.Ссылка = &Ссылка
	//|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	3,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПодотчетниками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	4,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	5,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	6,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	7,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	8,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	9,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницДенежныеСредства КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	10,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПерсоналом КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	11,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПерсоналом КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	12,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	&Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчетаЭквайринг,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчетаЭквайринг.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчетаЭквайринг.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.СуммаУчета,
	//|	ВЫРАЗИТЬ(&СодержаниеОплатаОтБанкаЭквайрера КАК СТРОКА(100))
	//|ИЗ
	//|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	//|ГДЕ
	//|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	13,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	&Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетЗатратЭквайринг,
	//|	ТаблицаДокумента.СчетУчетаЭквайринг,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетЗатратЭквайринг.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчетаЭквайринг.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетЗатратЭквайринг.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаРасчетовКомиссии
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчетаЭквайринг.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаРасчетовКомиссии
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.СуммаУчетаКомиссии,
	//|	ВЫРАЗИТЬ(&СодержаниеКомиссияБанкаЭквайрера КАК СТРОКА(100))
	//|ИЗ
	//|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	//|ГДЕ
	//|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты)
	//|	И ТаблицаДокумента.СуммаРасчетовКомиссии <> 0
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	14,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	15,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	16,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницПрочиеРасчеты КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	17,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаПрочиеРасчеты КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	18,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ,
	//|	ТаблицаДокумента.ТипНДФЛ.СчетОплатыНДФЛ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетОплатыНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаНДФЛ
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетОплатыНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаНДФЛВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.СуммаНДФЛ,
	//|	&НДФЛ
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
	//|ГДЕ
	//|	НЕ ТаблицаДокумента.ТипНДФЛ = ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	19,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ > 0
	//|			ТОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ < 0
	//|			ТОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ > 0
	//|				И ВЫРАЗИТЬ(ТаблицаДокумента.ТипНДФЛ КАК Справочник.ТипыНДФЛ).СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ > 0
	//|				И ВЫРАЗИТЬ(ТаблицаДокумента.ТипНДФЛ КАК Справочник.ТипыНДФЛ).СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА (ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2))) > 0
	//|			ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2))
	//|		ИНАЧЕ -(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2)))
	//|	КОНЕЦ,
	//|	&КурсоваяРазницаНДФЛ
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	//|				&МоментВремени,
	//|				Валюта В
	//|					(ВЫБРАТЬ
	//|						КонстантаВалютаУчета.Значение
	//|					ИЗ
	//|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсВалютыУчета
	//|		ПО (ИСТИНА)
	//|ГДЕ
	//|	ТаблицаДокумента.ТипНДФЛ <> ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|	И (ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2))) <> 0
	//|	И ТаблицаДокумента.КурсПоступления <> 0
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	18,
	//|	1,
	//|	ВТ_НДФЛ.Период,
	//|	ВТ_НДФЛ.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета,
	//|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
	//|	ВЫБОР
	//|		КОГДА ВТ_НДФЛ.НДФЛсВыплатСчетУчета.Валютный
	//|			ТОГДА ВТ_НДФЛ.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ВТ_НДФЛ.НДФЛсНачисленийСчетУчета.Валютный
	//|			ТОГДА ВТ_НДФЛ.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ВТ_НДФЛ.НДФЛсВыплатСчетУчета.Валютный
	//|			ТОГДА ВТ_НДФЛ.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ВТ_НДФЛ.НДФЛсНачисленийСчетУчета.Валютный
	//|			ТОГДА ВТ_НДФЛ.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВТ_НДФЛ.Сумма,
	//|	&СодержаниеПроводкиПоЗарплате
	//|ИЗ
	//|	ВТ_ДанныеНДФЛ КАК ВТ_НДФЛ
	//|ГДЕ
	//|	ВТ_НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Порядок,
	//|	НомерСтроки";
	//
	//

	//РезультатЗапроса = Запрос.Выполнить();
	//
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаУправленческий()

Процедура СформироватьТаблицаНалоговыеЛготы(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	Если ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата ИЛИ
		ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаРасчетыСПерсоналом.ПериодРегистрации КАК Период,
		|	ВременнаяТаблицаРасчетыСПерсоналом.Организация КАК Организация,
		|	ВременнаяТаблицаРасчетыСПерсоналом.Сотрудник КАК Сотрудник,
		|	ВременнаяТаблицаРасчетыСПерсоналом.СтруктурнаяЕдиница КАК Подразделение,
		|	ВременнаяТаблицаРасчетыСПерсоналом.СуммаЛгот КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРасчетыСПерсоналом.ВедомостьВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипЛгот.УдержаниеДляКонтрагента)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипЛгот.Прочее)
		|	КОНЕЦ КАК ТипЛгот,
		////+++ Дмгг
		//|	ВременнаяТаблицаРасчетыСПерсоналом.Проект КАК Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВременнаяТаблицаРасчетыСПерсоналом.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВременнаяТаблицаРасчетыСПерсоналом.Проект
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПерсоналом КАК ВременнаяТаблицаРасчетыСПерсоналом
		|ГДЕ
		|	ВременнаяТаблицаРасчетыСПерсоналом.СуммаЛгот <> 0";
		
		
				
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНалоговыеЛготы", Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьТаблицаОстаткиНалоговыхЛьгот(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Если ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата ИЛИ
		ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаРасчетыСПерсоналом.Дата КАК Период,
		|	ВременнаяТаблицаРасчетыСПерсоналом.Организация КАК Организация,
		|	ВременнаяТаблицаРасчетыСПерсоналом.Сотрудник КАК Сотрудник,
		|	СУММА(ВременнаяТаблицаРасчетыСПерсоналом.СуммаЛгот) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРасчетыСПерсоналом.ВедомостьВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипЛгот.УдержаниеДляКонтрагента)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипЛгот.Прочее)
		|	КОНЕЦ КАК ТипЛгот
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПерсоналом КАК ВременнаяТаблицаРасчетыСПерсоналом
		|ГДЕ
		|	ВременнаяТаблицаРасчетыСПерсоналом.СуммаЛгот <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаРасчетыСПерсоналом.Дата,
		|	ВременнаяТаблицаРасчетыСПерсоналом.Организация,
		|	ВременнаяТаблицаРасчетыСПерсоналом.Сотрудник,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРасчетыСПерсоналом.ВедомостьВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипЛгот.УдержаниеДляКонтрагента)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипЛгот.Прочее)
		|	КОНЕЦ";
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНалоговыхЛьгот", Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//+++ Дмгг
// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтрольПередБанком(ДокументСсылкаРасходСоСчета, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если НЕ Константы.КонтролироватьОстаткиПриПроведении.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;	
	Запрос.УстановитьПараметр("НаДату", ДокументСсылкаРасходСоСчета.Дата - 1);
	тзДенежныеСредства = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредства;
	тзДенежныеСредства.Свернуть("Организация, ТипДенежныхСредств, БанковскийСчетКасса, Валюта, ВидДвижения", "Сумма, СуммаВал");	
	Запрос.УстановитьПараметр("ТаблицаДенежныеСредства", тзДенежныеСредства);
	Запрос.УстановитьПараметр("ТаблицаРасчетыСПодотчетниками", ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПодотчетниками);
	Запрос.УстановитьПараметр("ТаблицаРасчетыСПоставщиками", ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПоставщиками);
	Запрос.УстановитьПараметр("ТаблицаРасчетыПоЭквайрингу", ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыПоЭквайрингу);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДенежныеСредства.Организация,
	|	ТаблицаДенежныеСредства.ТипДенежныхСредств,
	|	ТаблицаДенежныеСредства.БанковскийСчетКасса,
	|	ТаблицаДенежныеСредства.Валюта,
	|	ТаблицаДенежныеСредства.Сумма,
	|	ТаблицаДенежныеСредства.СуммаВал,
	|	ТаблицаДенежныеСредства.ВидДвижения
	|ПОМЕСТИТЬ ТаблицаДенежныеСредства
	|ИЗ
	|	&ТаблицаДенежныеСредства КАК ТаблицаДенежныеСредства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРасчетыСПодотчетниками.Организация,
	|	ТаблицаРасчетыСПодотчетниками.Сотрудник,
	|	ТаблицаРасчетыСПодотчетниками.Документ,
	|	ТаблицаРасчетыСПодотчетниками.Валюта,
	|	ТаблицаРасчетыСПодотчетниками.Сумма,
	|	ТаблицаРасчетыСПодотчетниками.СуммаВал,
	|	ТаблицаРасчетыСПодотчетниками.ВидДвижения
	|ПОМЕСТИТЬ ТаблицаРасчетыСПодотчетниками
	|ИЗ
	|	&ТаблицаРасчетыСПодотчетниками КАК ТаблицаРасчетыСПодотчетниками
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРасчетыСПоставщиками.Организация,
	|	ТаблицаРасчетыСПоставщиками.ТипРасчетов,
	|	ТаблицаРасчетыСПоставщиками.Документ,
	|	ТаблицаРасчетыСПоставщиками.Контрагент,
	|	ТаблицаРасчетыСПоставщиками.Договор,
	|	ТаблицаРасчетыСПоставщиками.Заказ,
	|	ТаблицаРасчетыСПоставщиками.Сумма,
	|	ТаблицаРасчетыСПоставщиками.СуммаВал,
	|	ТаблицаРасчетыСПоставщиками.ВидДвижения
	|ПОМЕСТИТЬ ТаблицаРасчетыСПоставщиками
	|ИЗ
	|	&ТаблицаРасчетыСПоставщиками КАК ТаблицаРасчетыСПоставщиками
	|;
	|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТаблицаРасчетыПоЭквайрингу.ВидОперацииЭквайринга,
	//|	ТаблицаРасчетыПоЭквайрингу.Организация,
	//|	ТаблицаРасчетыПоЭквайрингу.ЭквайринговыйТерминал,
	//|	ТаблицаРасчетыПоЭквайрингу.ДатаПлатежа,
	//|	ТаблицаРасчетыПоЭквайрингу.Документ,
	//|	ТаблицаРасчетыПоЭквайрингу.Заказ,
	//|	ТаблицаРасчетыПоЭквайрингу.ВидПлатежнойКарты,
	//|	ТаблицаРасчетыПоЭквайрингу.НомерПлатежнойКарты,
	//|	ТаблицаРасчетыПоЭквайрингу.ВидДвижения,
	//|	ТаблицаРасчетыПоЭквайрингу.Сумма,
	//|	ТаблицаРасчетыПоЭквайрингу.СуммаВал,
	//|	ТаблицаРасчетыПоЭквайрингу.Комиссия,
	//|	ТаблицаРасчетыПоЭквайрингу.КомиссияВал
	//|ПОМЕСТИТЬ ТаблицаРасчетыПоЭквайрингу
	//|ИЗ
	//|	&ТаблицаРасчетыПоЭквайрингу КАК ТаблицаРасчетыПоЭквайрингу
	//|;
	//|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ТипДенежныхСредств,
	|	ТаблицаДокумента.БанковскийСчетКасса КАК БанковскийСчетКассаПредставление,
	|	ТаблицаДокумента.Валюта КАК ВалютаПредставление,
	|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма КАК СуммаОстаток,
	|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал КАК СуммаВалОстаток,
	|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) КАК ОстатокДенежныхСредств
	|ИЗ
	|	ТаблицаДенежныеСредства КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства.Остатки(
	|				&НаДату,
	|				(БанковскийСчетКасса, Валюта, Организация, ТипДенежныхСредств) В
	|					(ВЫБРАТЬ
	|						а.БанковскийСчетКасса,
	|						а.Валюта,
	|						а.Организация,
	|						а.ТипДенежныхСредств
	|					ИЗ
	|						ВременнаяТаблицаДенежныеСредства КАК а)) КАК ДенежныеСредстваОстатки
	|		ПО ТаблицаДокумента.Организация = ДенежныеСредстваОстатки.Организация
	|			И ТаблицаДокумента.ТипДенежныхСредств = ДенежныеСредстваОстатки.ТипДенежныхСредств
	|			И ТаблицаДокумента.БанковскийСчетКасса = ДенежныеСредстваОстатки.БанковскийСчетКасса
	|			И ТаблицаДокумента.Валюта = ДенежныеСредстваОстатки.Валюта
	|ГДЕ
	|	ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма < 0
	|			ИЛИ ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал < 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ТипДенежныхСредств,
	|	ТаблицаДокумента.БанковскийСчетКасса КАК БанковскийСчетКассаПредставление,
	|	ТаблицаДокумента.Валюта КАК ВалютаПредставление,
	|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма КАК СуммаОстаток,
	|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал КАК СуммаВалОстаток,
	|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) КАК ОстатокДенежныхСредств
	|ИЗ
	|	ТаблицаДенежныеСредства КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства.Остатки(
	|				,
	|				(БанковскийСчетКасса, Валюта, Организация, ТипДенежныхСредств) В
	|					(ВЫБРАТЬ
	|						а.БанковскийСчетКасса,
	|						а.Валюта,
	|						а.Организация,
	|						а.ТипДенежныхСредств
	|					ИЗ
	|						ВременнаяТаблицаДенежныеСредства КАК а)) КАК ДенежныеСредстваОстатки
	|		ПО ТаблицаДокумента.Организация = ДенежныеСредстваОстатки.Организация
	|			И ТаблицаДокумента.ТипДенежныхСредств = ДенежныеСредстваОстатки.ТипДенежныхСредств
	|			И ТаблицаДокумента.БанковскийСчетКасса = ДенежныеСредстваОстатки.БанковскийСчетКасса
	|			И ТаблицаДокумента.Валюта = ДенежныеСредстваОстатки.Валюта
	|ГДЕ
	|	ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма < 0
	|			ИЛИ ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал < 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Сотрудник,
	|	ТаблицаДокумента.Валюта,
	|	ТаблицаДокумента.Документ,
	|	ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма КАК СуммаОстаток,
	|	ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал КАК СуммаВалОстаток
	|ИЗ
	|	ТаблицаРасчетыСПодотчетниками КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПодотчетниками.Остатки(
	|				&НаДату,
	|				(Организация, Сотрудник, Валюта, Документ) В
	|					(ВЫБРАТЬ
	|						а.Организация,
	|						а.Сотрудник,
	|						а.Валюта,
	|						а.Документ
	|					ИЗ
	|						ВременнаяТаблицаРасчетыСПодотчетниками КАК а)) КАК РасчетыСПодотчетникамиОстатки
	|		ПО ТаблицаДокумента.Организация = РасчетыСПодотчетникамиОстатки.Организация
	|			И ТаблицаДокумента.Сотрудник = РасчетыСПодотчетникамиОстатки.Сотрудник
	|			И ТаблицаДокумента.Валюта = РасчетыСПодотчетникамиОстатки.Валюта
	|			И ТаблицаДокумента.Документ = РасчетыСПодотчетникамиОстатки.Документ
	|ГДЕ
	|	ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма < 0
	|			ИЛИ ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал < 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Сотрудник,
	|	ТаблицаДокумента.Валюта,
	|	ТаблицаДокумента.Документ,
	|	ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма КАК СуммаОстаток,
	|	ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал КАК СуммаВалОстаток
	|ИЗ
	|	ТаблицаРасчетыСПодотчетниками КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПодотчетниками.Остатки(
	|				,
	|				(Организация, Сотрудник, Валюта, Документ) В
	|					(ВЫБРАТЬ
	|						а.Организация,
	|						а.Сотрудник,
	|						а.Валюта,
	|						а.Документ
	|					ИЗ
	|						ВременнаяТаблицаРасчетыСПодотчетниками КАК а)) КАК РасчетыСПодотчетникамиОстатки
	|		ПО ТаблицаДокумента.Организация = РасчетыСПодотчетникамиОстатки.Организация
	|			И ТаблицаДокумента.Сотрудник = РасчетыСПодотчетникамиОстатки.Сотрудник
	|			И ТаблицаДокумента.Валюта = РасчетыСПодотчетникамиОстатки.Валюта
	|			И ТаблицаДокумента.Документ = РасчетыСПодотчетникамиОстатки.Документ
	|ГДЕ
	|	ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма < 0
	|			ИЛИ ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал < 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ТипРасчетов,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.Организация КАК ОрганизацияПредставление,
	|	ТаблицаДокумента.Контрагент КАК КонтрагентПредставление,
	|	ТаблицаДокумента.Договор КАК ДоговорПредставление,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов КАК ВалютаПредставление,
	|	ТаблицаДокумента.Документ КАК ДокументПредставление,
	|	ТаблицаДокумента.Заказ КАК ЗаказПредставление,
	|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетовПредставление,
	|	ИСТИНА КАК ДвиженияДенежныхДокументов,
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма КАК СуммаОстаток,
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал КАК СуммаВалОстаток,
	|	ТаблицаДокумента.Сумма КАК СуммаПередЗаписью,
	|	ТаблицаДокумента.Сумма КАК СуммаПриЗаписи,
	|	ТаблицаДокумента.Сумма КАК СуммаИзменение,
	|	ТаблицаДокумента.СуммаВал КАК СуммаВалПередЗаписью,
	|	ТаблицаДокумента.СуммаВал КАК СуммаВалПриЗаписи,
	|	ТаблицаДокумента.СуммаВал КАК СуммаВалИзменение,
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаткаЗадолженности,
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаНепогашенныхАвансов
	|ИЗ
	|	ТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|				&НаДату,
	|				(Организация, ТипРасчетов, Контрагент, Договор, Документ, Заказ) В
	|					(ВЫБРАТЬ
	|						а.Организация,
	|						а.ТипРасчетов,
	|						а.Контрагент,
	|						а.Договор,
	|						а.Документ,
	|						а.Заказ
	|					ИЗ
	|						ТаблицаРасчетыСПоставщиками КАК а)) КАК РасчетыСПоставщикамиОстатки
	|		ПО ТаблицаДокумента.Организация = РасчетыСПоставщикамиОстатки.Организация
	|			И ТаблицаДокумента.ТипРасчетов = РасчетыСПоставщикамиОстатки.ТипРасчетов
	|			И ТаблицаДокумента.Контрагент = РасчетыСПоставщикамиОстатки.Контрагент
	|			И ТаблицаДокумента.Договор = РасчетыСПоставщикамиОстатки.Договор
	|			И ТаблицаДокумента.Документ = РасчетыСПоставщикамиОстатки.Документ
	|			И ТаблицаДокумента.Заказ = РасчетыСПоставщикамиОстатки.Заказ
	|ГДЕ
	|	ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (ВЫБОР 
	|		КОГДА ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|			ТОГДА (ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма) > 0
	|		ИНАЧЕ (ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма < 0)
	|	КОНЕЦ
	|			ИЛИ ВЫБОР 
	|		КОГДА ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|			ТОГДА (ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал) > 0
	|		ИНАЧЕ (ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал) < 0
	|	КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ТипРасчетов,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.Организация КАК ОрганизацияПредставление,
	|	ТаблицаДокумента.Контрагент КАК КонтрагентПредставление,
	|	ТаблицаДокумента.Договор КАК ДоговорПредставление,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов КАК ВалютаПредставление,
	|	ТаблицаДокумента.Документ КАК ДокументПредставление,
	|	ТаблицаДокумента.Заказ КАК ЗаказПредставление,
	|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетовПредставление,
	|	ИСТИНА КАК ДвиженияДенежныхДокументов,
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма КАК СуммаОстаток,
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал КАК СуммаВалОстаток,
	|	ТаблицаДокумента.Сумма КАК СуммаПередЗаписью,
	|	ТаблицаДокумента.Сумма КАК СуммаПриЗаписи,
	|	ТаблицаДокумента.Сумма КАК СуммаИзменение,
	|	ТаблицаДокумента.СуммаВал КАК СуммаВалПередЗаписью,
	|	ТаблицаДокумента.СуммаВал КАК СуммаВалПриЗаписи,
	|	ТаблицаДокумента.СуммаВал КАК СуммаВалИзменение,
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаткаЗадолженности,
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаНепогашенныхАвансов
	|ИЗ
	|	ТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|				,
	|				(Организация, ТипРасчетов, Контрагент, Договор, Документ, Заказ) В
	|					(ВЫБРАТЬ
	|						а.Организация,
	|						а.ТипРасчетов,
	|						а.Контрагент,
	|						а.Договор,
	|						а.Документ,
	|						а.Заказ
	|					ИЗ
	|						ТаблицаРасчетыСПоставщиками КАК а)) КАК РасчетыСПоставщикамиОстатки
	|		ПО ТаблицаДокумента.Организация = РасчетыСПоставщикамиОстатки.Организация
	|			И ТаблицаДокумента.ТипРасчетов = РасчетыСПоставщикамиОстатки.ТипРасчетов
	|			И ТаблицаДокумента.Контрагент = РасчетыСПоставщикамиОстатки.Контрагент
	|			И ТаблицаДокумента.Договор = РасчетыСПоставщикамиОстатки.Договор
	|			И ТаблицаДокумента.Документ = РасчетыСПоставщикамиОстатки.Документ
	|			И ТаблицаДокумента.Заказ = РасчетыСПоставщикамиОстатки.Заказ
	|ГДЕ
	|	ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВЫБОР 
	|		КОГДА ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|			ТОГДА (ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма < 0
	|					ИЛИ ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал < 0)
	|		ИНАЧЕ (ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма > 0
	|					ИЛИ ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал > 0)
	|	КОНЕЦ";
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТаблицаДокумента.ВидОперацииЭквайринга,
	//|	ТаблицаДокумента.Организация,
	//|	ТаблицаДокумента.ЭквайринговыйТерминал,
	//|	ТаблицаДокумента.ДатаПлатежа,
	//|	ТаблицаДокумента.Документ,
	//|	ТаблицаДокумента.Заказ,
	//|	ТаблицаДокумента.ВидПлатежнойКарты,
	//|	ТаблицаДокумента.НомерПлатежнойКарты,
	//|	ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма КАК СуммаОстаток,
	//|	ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал КАК СуммаВалОстаток,
	//|	ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.КомиссияОстаток, 0) - ТаблицаДокумента.Комиссия КАК КомиссияОстаток,
	//|	ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.КомиссияВалОстаток, 0) - ТаблицаДокумента.КомиссияВал КАК КомиссияВалОстаток
	//|ИЗ
	//|	ТаблицаРасчетыПоЭквайрингу КАК ТаблицаДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЭквайрингу.Остатки(
	//|				&НаДату,
	//|				(ВидОперацииЭквайринга, Организация, ЭквайринговыйТерминал, ДатаПлатежа, Документ, Заказ, ВидПлатежнойКарты, НомерПлатежнойКарты) В
	//|					(ВЫБРАТЬ
	//|						а.ВидОперацииЭквайринга,
	//|						а.Организация,
	//|						а.ЭквайринговыйТерминал,
	//|						а.ДатаПлатежа,
	//|						а.Документ,
	//|						а.Заказ,
	//|						а.ВидПлатежнойКарты,
	//|						а.НомерПлатежнойКарты
	//|					ИЗ
	//|						ВременнаяТаблицаРасчетыСПодотчетниками КАК а)) КАК РасчетыПоЭквайрингуОстатки
	//|		ПО (ТаблицаДокумента.ВидОперацииЭквайринга = ТаблицаДокумента.ВидОперацииЭквайринга)
	//|			И ТаблицаДокумента.Организация = РасчетыПоЭквайрингуОстатки.Организация
	//|			И ТаблицаДокумента.ЭквайринговыйТерминал = РасчетыПоЭквайрингуОстатки.ЭквайринговыйТерминал
	//|			И ТаблицаДокумента.ДатаПлатежа = РасчетыПоЭквайрингуОстатки.ДатаПлатежа
	//|			И ТаблицаДокумента.Документ = РасчетыПоЭквайрингуОстатки.Документ
	//|			И ТаблицаДокумента.Заказ = РасчетыПоЭквайрингуОстатки.Заказ
	//|			И ТаблицаДокумента.ВидПлатежнойКарты = РасчетыПоЭквайрингуОстатки.ВидПлатежнойКарты
	//|			И ТаблицаДокумента.НомерПлатежнойКарты = РасчетыПоЭквайрингуОстатки.НомерПлатежнойКарты
	//|ГДЕ
	//|	ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|	И (ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма < 0
	//|			ИЛИ ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал < 0
	//|			ИЛИ ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.КомиссияОстаток, 0) - ТаблицаДокумента.Комиссия < 0
	//|			ИЛИ ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.КомиссияВалОстаток, 0) - ТаблицаДокумента.КомиссияВал < 0)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТаблицаДокумента.ВидОперацииЭквайринга,
	//|	ТаблицаДокумента.Организация,
	//|	ТаблицаДокумента.ЭквайринговыйТерминал,
	//|	ТаблицаДокумента.ДатаПлатежа,
	//|	ТаблицаДокумента.Документ,
	//|	ТаблицаДокумента.Заказ,
	//|	ТаблицаДокумента.ВидПлатежнойКарты,
	//|	ТаблицаДокумента.НомерПлатежнойКарты,
	//|	ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма КАК СуммаОстаток,
	//|	ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал КАК СуммаВалОстаток,
	//|	ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.КомиссияОстаток, 0) - ТаблицаДокумента.Комиссия КАК КомиссияОстаток,
	//|	ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.КомиссияВалОстаток, 0) - ТаблицаДокумента.КомиссияВал КАК КомиссияВалОстаток
	//|ИЗ
	//|	ТаблицаРасчетыПоЭквайрингу КАК ТаблицаДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЭквайрингу.Остатки(
	//|				,
	//|				(ВидОперацииЭквайринга, Организация, ЭквайринговыйТерминал, ДатаПлатежа, Документ, Заказ, ВидПлатежнойКарты, НомерПлатежнойКарты) В
	//|					(ВЫБРАТЬ
	//|						а.ВидОперацииЭквайринга,
	//|						а.Организация,
	//|						а.ЭквайринговыйТерминал,
	//|						а.ДатаПлатежа,
	//|						а.Документ,
	//|						а.Заказ,
	//|						а.ВидПлатежнойКарты,
	//|						а.НомерПлатежнойКарты
	//|					ИЗ
	//|						ВременнаяТаблицаРасчетыСПодотчетниками КАК а)) КАК РасчетыПоЭквайрингуОстатки
	//|		ПО (ТаблицаДокумента.ВидОперацииЭквайринга = ТаблицаДокумента.ВидОперацииЭквайринга)
	//|			И ТаблицаДокумента.Организация = РасчетыПоЭквайрингуОстатки.Организация
	//|			И ТаблицаДокумента.ЭквайринговыйТерминал = РасчетыПоЭквайрингуОстатки.ЭквайринговыйТерминал
	//|			И ТаблицаДокумента.ДатаПлатежа = РасчетыПоЭквайрингуОстатки.ДатаПлатежа
	//|			И ТаблицаДокумента.Документ = РасчетыПоЭквайрингуОстатки.Документ
	//|			И ТаблицаДокумента.Заказ = РасчетыПоЭквайрингуОстатки.Заказ
	//|			И ТаблицаДокумента.ВидПлатежнойКарты = РасчетыПоЭквайрингуОстатки.ВидПлатежнойКарты
	//|			И ТаблицаДокумента.НомерПлатежнойКарты = РасчетыПоЭквайрингуОстатки.НомерПлатежнойКарты
	//|ГДЕ
	//|	ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|	И (ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.СуммаОстаток, 0) - ТаблицаДокумента.Сумма < 0
	//|			ИЛИ ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.СуммаВалОстаток, 0) - ТаблицаДокумента.СуммаВал < 0
	//|			ИЛИ ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.КомиссияОстаток, 0) - ТаблицаДокумента.Комиссия < 0
	//|			ИЛИ ЕСТЬNULL(РасчетыПоЭквайрингуОстатки.КомиссияВалОстаток, 0) - ТаблицаДокумента.КомиссияВал < 0)";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Если НЕ МассивРезультатов[3].Пустой()
		ИЛИ НЕ МассивРезультатов[4].Пустой()
		ИЛИ НЕ МассивРезультатов[5].Пустой()
		ИЛИ НЕ МассивРезультатов[6].Пустой()
		ИЛИ НЕ МассивРезультатов[7].Пустой()
		ИЛИ НЕ МассивРезультатов[8].Пустой() Тогда 
		//ИЛИ НЕ МассивРезультатов[10].Пустой()
		//ИЛИ НЕ МассивРезультатов[11].Пустой()Тогда
		ДокументОбъектРасходСоСчета = ДокументСсылкаРасходСоСчета.ПолучитьОбъект()
	КонецЕсли;
	
	// Отрицательный остаток по денежным средствам.
	Если НЕ МассивРезультатов[3].Пустой() Тогда
		ВыборкаИзРезультатаЗапроса = МассивРезультатов[3].Выбрать();
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструДенежныеСредства(ДокументОбъектРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ);
	КонецЕсли;
	
	Если НЕ МассивРезультатов[4].Пустой() Тогда
		ВыборкаИзРезультатаЗапроса = МассивРезультатов[4].Выбрать();
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструДенежныеСредства(ДокументОбъектРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ,,Истина);
	КонецЕсли;
	
	// Отрицательный остаток по расчетам с подотчетными лицами.
	Если НЕ МассивРезультатов[5].Пустой() Тогда
		ВыборкаИзРезультатаЗапроса = МассивРезультатов[5].Выбрать();
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПодотчетниками(ДокументОбъектРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ);
	КонецЕсли;
	
	Если НЕ МассивРезультатов[6].Пустой() Тогда
		ВыборкаИзРезультатаЗапроса = МассивРезультатов[6].Выбрать();
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПодотчетниками(ДокументОбъектРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ,,Истина);
	КонецЕсли;
	
	// Отрицательный остаток по расчетам с поставщиками.
	Если НЕ МассивРезультатов[7].Пустой() Тогда
		ВыборкаИзРезультатаЗапроса = МассивРезультатов[7].Выбрать();
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПоставщиками(ДокументОбъектРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ);
	КонецЕсли;
	
	Если НЕ МассивРезультатов[8].Пустой() Тогда
		ВыборкаИзРезультатаЗапроса = МассивРезультатов[8].Выбрать();
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПоставщиками(ДокументОбъектРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ,,Истина);
	КонецЕсли;
	
	// Эквайринг
	// Отрицательный остаток расчетов по эквайрингу.
	//Если НЕ МассивРезультатов[10].Пустой() Тогда
	//	ВыборкаИзРезультатаЗапроса = МассивРезультатов[10].Выбрать();
	//	УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыПоЭквайрингу(ДокументОбъектРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ);
	//КонецЕсли;
	//
	//Если НЕ МассивРезультатов[11].Пустой() Тогда
	//	ВыборкаИзРезультатаЗапроса = МассивРезультатов[11].Выбрать();
	//	УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыПоЭквайрингу(ДокументОбъектРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ,,Истина);
	//КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтроль()

#КонецЕсли