&НаСервере
Функция ТаблицаВыгрузкиТоваров(Подразделение) Экспорт 
	
	ТаблицаВыгрузкиТоваров = Новый Массив;                
    ОтборПоТоварам = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Штрихкод,
	               |	ШтрихкодыНоменклатуры.Номенклатура,
	               |	&ВидЦены КАК ВидЦены,
	               |	ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Номенклатура.НаименованиеПолное КАК СТРОКА(256)) КАК НаименованиеНоменклатуры,
	               |	ШтрихкодыНоменклатуры.PLU КАК PLU,
	               |	ШтрихкодыНоменклатуры.PLU КАК Код,
	               |	ШтрихкодыНоменклатуры.Номенклатура.СрокГодности КАК СрокГодности,
	               |	ВЫБОР
	               |		КОГДА ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 2, 1) = ""2""
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Весовая,
	               |	ШтрихкодыНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ВЫБОР
	               |		КОГДА ШтрихкодыНоменклатуры.ЕдиницаИзмерения.Код = ""805""
	               |				ИЛИ ШтрихкодыНоменклатуры.ЕдиницаИзмерения.Код = ""166""
	               |			ТОГДА ""kg""
	               |		КОГДА ШтрихкодыНоменклатуры.ЕдиницаИзмерения.Код = ""163""
	               |			ТОГДА ""g""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ПредставлениеВесовойЕдиницы,
	               |	0 КАК Цена,
	               |	ШтрихкодыНоменклатуры.Номенклатура.Родитель.Код КАК КодРодитель
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Номенклатура.ВыгружатьВВесы = ИСТИНА
	               |	И ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 1, 1) = ""2"""  + 
		?(ОтборПоТоварам = Неопределено,""," И Номенклатура В (&ОтборПоТоварам)");
	
	Запрос.УстановитьПараметр("ВидЦены",ВидЦены);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЧ Из РезультатЗапроса Цикл
		
		СтрокаТЧ.Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатуры(СтрокаТЧ.Номенклатура, ТекущаяДата(), ВидЦены, СтрокаТЧ.Номенклатура.ЕдиницаИзмерения);
		
		Если СтрокаТЧ.PLU = 0 Тогда
			//сгенерируем новый PLU
			СтрокаТЧ.PLU = ОбменСВесамиСПечатьюЭтикетокСервер.СгенерироватьНовыйPLU(СтрокаТЧ.Штрихкод);
			СтрокаТЧ.Код = СтрокаТЧ.PLU;			
		КонецЕсли;
		
		СтруктураСтроки = Новый Структура("Штрихкод,НаименованиеНоменклатуры,Весовая,ЕдиницаИзмерения,ПредставлениеВесовойЕдиницы,Номенклатура,PLU,Код,КодРодитель,Цена,СрокГодности");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,СтрокаТЧ);
		
		ТаблицаВыгрузкиТоваров.Добавить(СтруктураСтроки);
	
	КонецЦикла;		
		
	Возврат ТаблицаВыгрузкиТоваров;
	
КонецФункции
