
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
	ПересчитатьНДСВСТроках();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БалыЛояльностиОстатки.КоличествоОстаток КАК Количество,
	|	БалыЛояльностиОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.БалыЛояльности.Остатки(
	|			&ДатаОтчета,
	|			Контрагент = &Контрагент
	|				И КартаЛояльности = &КартаЛояльности
	|				И Договор = &Договор) КАК БалыЛояльностиОстатки";
	
	Запрос.УстановитьПараметр("ДатаОтчета", Новый Граница(Объект.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("КартаЛояльности", Объект.КартаЛояльности);
	Запрос.УстановитьПараметр("Договор", Объект.Договор);
	Объект.КартыЛояльности.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныИВалютаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЦеныИВалютаНажатие(Элемент, СтандартнаяОбработка)

	Если ЭтаФорма.ТолькоПросмотр = Истина Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ОбработатьИзмененияПоКнопкеЦеныИВалюты(Объект.ВалютаДокумента);
	Модифицированность = Истина;
	
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалюты(Знач ВалютаРасчетовПередИзменением, ПерезаполнитьЦены = Ложь, ПересчитатьЦены = Ложь, ТекстПредупреждения = "")
	
	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВалютаДокумента",		  Объект.ВалютаДокумента);
	СтруктураПараметров.Вставить("Курс",				  Объект.Курс);
	СтруктураПараметров.Вставить("Кратность",			  Объект.Кратность);
	СтруктураПараметров.Вставить("НалогообложениеНДС",	  Объект.НалогообложениеНДС);
	СтруктураПараметров.Вставить("СуммаВключаетНДС",	  Объект.СуммаВключаетНДС);
	//СтруктураПараметров.Вставить("НДСВключатьВСтоимость", Объект.НДСВключатьВСтоимость);
	СтруктураПараметров.Вставить("Контрагент",			  Объект.Контрагент);
	СтруктураПараметров.Вставить("Договор",				  Объект.Договор);
	СтруктураПараметров.Вставить("Организация",			  Объект.Организация);
	СтруктураПараметров.Вставить("ДатаДокумента",		  Объект.Дата);
	//СтруктураПараметров.Вставить("ПерезаполнитьЦены",	  ПерезаполнитьЦены);
	//СтруктураПараметров.Вставить("ПересчитатьЦены",		  ПересчитатьЦены);
	СтруктураПараметров.Вставить("БылиВнесеныИзменения",  Ложь);
	СтруктураПараметров.Вставить("ТекстПредупреждения",   ТекстПредупреждения);
	
	//СтруктураПараметров.Вставить("ВидЦен", Объект.ВидЦен);
	СтруктураПараметров.Вставить("ОсновнаяСтавкаНДС",   Объект.ОсновнаяСтавкаНДС);   
	
	//Открываем форму "Цены и Валюта".
	//Перезаполняем табличную часть "Затраты" если были внесены изменения в форме "Цены и Валюта".
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуЦеныИВалютаЗавершение", ЭтотОбъект, Новый Структура("ВалютаРасчетовПередИзменением", ВалютаРасчетовПередИзменением));
	ОткрытьФорму("ОбщаяФорма.ФормаЦеныИВалюта", СтруктураПараметров, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОбработатьИзмененияПоКнопкеЦеныИВалюты()

&НаКлиенте
Процедура ОткрытьФормуЦеныИВалютаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;	
	
	СтруктураЦеныИВалюта = РезультатЗакрытия;
	ВалютаРасчетовПередИзменением = ДополнительныеПараметры.ВалютаРасчетовПередИзменением;
	
	Объект.ОсновнаяСтавкаНДС = СтруктураЦеныИВалюта.ОсновнаяСтавкаНДС;
	Объект.НалогообложениеНДС = СтруктураЦеныИВалюта.НалогообложениеНДС;
	Объект.СуммаВключаетНДС = СтруктураЦеныИВалюта.СуммаВключаетНДС;
	Объект.Кратность = СтруктураЦеныИВалюта.Кратность;
	Объект.Курс = СтруктураЦеныИВалюта.Курс;
	
	ОбновитьЗаголовокВалюты();
	
	ПересчитатьНДСВСТроках();
	
	
КонецПроцедуры // ОткрытьФормуЦеныИВалютаЗавершение()

&НаКлиенте
Процедура ПересчитатьНДСВСТроках()
	Для каждого СтрокаДокумента из 	Объект.КартыЛояльности Цикл
		РассчетСуммСтроки(СтрокаДокумента);
	КонецЦикла;	
КонецПРоцедуры	

&НаКлиенте
Процедура РассчетСуммСтроки(СтрокаДокумента)
	СтавкаНДС = 0;
	Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") Тогда
		СтавкаНДС = ПолучитьСтавкуНДС(Объект.ОсновнаяСтавкаНДС);	
	КонецЕсли;
	
	Если Объект.СуммаВключаетНДС Тогда
		СтрокаДокумента.СуммаНДС = СтрокаДокумента.Количество * СтавкаНДС /(100+СтавкаНДС);  
		СтрокаДокумента.Всего = СтрокаДокумента.Количество;
	Иначе
		СтрокаДокумента.СуммаНДС = СтрокаДокумента.Количество * СтавкаНДС /100;  
		СтрокаДокумента.Всего = СтрокаДокумента.Количество + СтрокаДокумента.СуммаНДС;
	КонецЕсли;	

КонецПроцедуры

&НаСервереБезКонтекста
функция ПолучитьСтавкуНДС(СтавкаНДС)
	
	Если ЗначениеЗаполнено(СтавкаНДС) ТОгда
		Возврат СтавкаНДС.Ставка;	
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЗаголовокВалюты();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокВалюты()                                                                                      
	
	ЦеныИВалюта = НСтр("ru='НДС';ka='დღგ-ს განაკვეთები';en='VAT'") 
					+ Объект.НалогообложениеНДС + " " 
					+ Объект.ОсновнаяСтавкаНДС + 
					?(Объект.СуммаВключаетНДС,НСтр("ru='(сумма с НДС)';ka='თანხა დღგ-ს ჩათვლით';en='VAT included'"),"");
	
КонецПроцедуры	

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Объект.Договор = Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(Объект.Контрагент, Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КартыЛояльностиКоличествоПриИзменении(Элемент)
	СтрокаДокумента = Элементы.КартыЛояльности.ТекущиеДанные;
	РассчетСуммСтроки(СтрокаДокумента)
КонецПроцедуры

&НаКлиенте
Процедура КартаЛояльностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДатаНачала = ?(Объект.Дата = НачалоДня(ТекущаяДата()), ТекущаяДата(), Объект.Дата);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораКартыЛояльностиЗавершение", ЭтотОбъект); //, Новый Структура("Отбор", СтруктураОтбора));
	ОткрытьФорму("Справочник.КартыЛояльности.ФормаВыбора", Новый Структура("Контрагент, ОтборПоКонтрагенту, ДатаНачала, ОтборПоДатеНачала, ОтборПоДатеОкончания", Объект.Контрагент, Истина, ДатаНачала, Истина, Истина), Элемент, ЭтаФорма.УникальныйИдентификатор, , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораКартыЛояльностиЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда 
		Объект.КартаЛояльности = РезультатЗакрытия;
	КонецЕсли;
	
КонецПроцедуры

