//// +++ { AzRy - [30.09.2021] - Jira: - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment: დროებით შემოწმება გაითიშა, ძველი ბაზიდან იმპორტირებული მონაცემების კორექტული გადატარებისთვის
//&После("ВыполнитьПредварительныйКонтроль_Deprecated")
//Процедура РасшAzRy_ВыполнитьПредварительныйКонтроль(Отказ)
//	
//	Если ЭтотОбъект.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
//		Отказ = Ложь;	
//	КонецЕсли; 		

//КонецПроцедуры
//// +++ } AzRy - [30.09.2021] - Jira: - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment: დროებით შემოწმება გაითიშა, ძველი ბაზიდან იმპორტირებული მონაცემების კორექტული გადატარებისთვის
