
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ПериодВыписки.ДатаНачала) 
		И НЕ ЗначениеЗаполнено(ПериодВыписки.ДатаОкончания) Тогда 
		
		ПериодВыписки.ДатаНачала 	= НачалоМесяца(ТекущаяДата());
		ПериодВыписки.ДатаОкончания = КонецМесяца(ТекущаяДата());  
		
	КонецЕсли;
	
	УстановитьВидимость(); 
	
КонецПроцедуры

&НаКлиенте
Функция  ПолучитьСтруктуруПараметров()
	
	СтруктураВозврата = Новый Структура; 
	СтруктураВозврата.Вставить("ВариантЗагрузки", ВариантЗагрузки);  
	СтруктураВозврата.Вставить("ДатаНачала", ПериодВыписки.ДатаНачала);
	СтруктураВозврата.Вставить("ДатаОкончания", ПериодВыписки.ДатаОкончания);
	СтруктураВозврата.Вставить("ПутьКФайлу", СокрЛП(ПутьКФайлу));
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимость()

	ВидимостьГруппыБанк = ?(ВариантЗагрузки = 0, Истина, ЛОЖЬ);
	
	Элементы.ГруппаПериод.Видимость 	= ВидимостьГруппыБанк;
	Элементы.ГруппаПутьКФайлу.Видимость = НЕ ВидимостьГруппыБанк;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр                      = НСтр("ka='ფაილი Excel 2007 (*.xlsx)|*.xlsx';ru='Книга Excel 2007 (*.xlsx)|*.xlsx';en='Book Excel 2007 (* .xlsx) | * .xlsx'");
	ДиалогВыбораФайла.Заголовок                   = Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "xlsx";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантЗагрузкиПриИзменении(Элемент) 
	
	УстановитьВидимость(); 
	
КонецПроцедуры

&НаКлиенте
Процедура OK(Команда)
	
	СтруктураПараметров = ПолучитьСтруктуруПараметров();
	СтруктураПараметров.Вставить("Отмена", ЛОЖЬ); 
	
	ЭтаФорма.Закрыть(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	СтруктураПараметров = ПолучитьСтруктуруПараметров();
	СтруктураПараметров.Вставить("Отмена", Истина); 
	
	ЭтаФорма.Закрыть(СтруктураПараметров);
	
КонецПроцедуры
