#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["Основной"].Теги = НСтр("ru = 'CRM'; ka = 'CRM'; en = 'CRM'");

	НастройкиВариантов["Основной"].Рекомендуемый = Истина;
	Для Каждого НастройкиТекВарианта Из НастройкиВариантов Цикл
		НастройкиТекВарианта.Значение.Теги = НСтр("ka='Зарплата,Налоги,Льготы,Заказы,Номенклатура,Продажи';ru='Зарплата,Налоги,Льготы,Заказы,Номенклатура,Продажи'");
	КонецЦикла;

	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Период = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ДатаОкончания = Период.Значение;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрольСроковГодностиТовараОстатки.Организация КАК Организация,
	|	КонтрольСроковГодностиТовараОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	КонтрольСроковГодностиТовараОстатки.Номенклатура КАК Номенклатура,
	|	КонтрольСроковГодностиТовараОстатки.Характеристика КАК Характеристика,
	|	КонтрольСроковГодностиТовараОстатки.Документ КАК Документ,
	|	СУММА(КонтрольСроковГодностиТовараОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	&СроковГодности КАК СроковГодности
	|ИЗ
	|	РегистрНакопления.КонтрольСроковГодностиТовара.Остатки(&ДатаОКончания, ) КАК КонтрольСроковГодностиТовараОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтрольСроковГодностиТовараОстатки.Характеристика,
	|	КонтрольСроковГодностиТовараОстатки.СтруктурнаяЕдиница,
	|	КонтрольСроковГодностиТовараОстатки.Документ,
	|	КонтрольСроковГодностиТовараОстатки.Организация,
	|	КонтрольСроковГодностиТовараОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("СроковГодности",Дата(1,1,1) );
	Запрос.УстановитьПараметр("ДатаОКончания",ДатаОкончания);

	ТзРезултат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр из ТзРезултат  Цикл 
		  Стр.СроковГодности = ПолучитСрокГодности(Стр.Документ,Стр.Номенклатура,Стр.Документ)	
	КонецЦикла;
	
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("НаборДанных2", ТзРезултат);
	
	//Макет компоновки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	//Компоновка данных 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВнешниеНаборыДанных", ПоместитьВоВременноеХранилище(ВнешниеНаборыДанных,Новый УникальныйИдентификатор));
	ОтчетыУНФ.ПриКомпоновкеРезультата(ЭтотОбъект.КомпоновщикНастроек, ЭтотОбъект.СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка );
		
КонецПроцедуры

Функция ПолучитСрокГодности(Документ,Номенклатура,ДокументСсылка)
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.СборкаЗапасов") Тогда 
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	Запасы.СрокГодности КАК СрокГодности
		|ИЗ
		|	Документ.СборкаЗапасов.Продукция КАК Запасы
		|ГДЕ
		|	Запасы.Ссылка = &Ссылка
		|	И Запасы.Номенклатура = &Номенклатура";
		
		Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		
		Резултат = Запрос.Выполнить().Выгрузить();
		
		Если Резултат.Количество() >  0 Тогда 	
			Возврат  Резултат[0].СрокГодности ;
		Иначе 
			Возврат Дата(1,1,1);
		КонецЕсли;
	
	Иначе 	
		ДокументИмя =  Метаданные.НайтиПоТипу(ТипЗнч(Документ)).имя ;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	Запасы.СрокГодности КАК СрокГодности
		|ИЗ
		|	Документ.%1.Запасы КАК Запасы
		|ГДЕ
		|	Запасы.Ссылка = &Ссылка
		|	И Запасы.Номенклатура = &Номенклатура";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%1",ДокументИмя);
		Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		
		Резултат = Запрос.Выполнить().Выгрузить();
		
		Если Резултат.Количество() >  0 Тогда 
			
			Возврат  Резултат[0].СрокГодности ;
		Иначе 
			Возврат Дата(1,1,1);
		КонецЕсли;
	КонецЕсли;
	  

	  
КонецФункции


#КонецОбласти

ЭтоОтчетУНФ = Истина;

#КонецЕсли
