#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установим формат для текущей даты: ДФ=Ч:мм
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(Список);
	
	// Для создания расхода из кассы с видом операции "Подотчетнтику" из авансового отчета.
	Если Параметры.Свойство("ВидОперацииБанк") Тогда
		Параметры.Отбор.Вставить("ВидОперации", Параметры.ВидОперацииБанк);
	КонецЕсли;
	
	Если Параметры.Свойство("ОрганизацияДляОтбора") И НЕ Константы.УчетПоКомпании.Получить() Тогда
		Параметры.Отбор.Вставить("Организация", Параметры.ОрганизацияДляОтбора);
	КонецЕсли;
	
	//+++ Дмгг, 11.06.2025, ONESOFT-4145
	//УстановитьВидимостьДостуаностьКомандОтправкиДокументаВБанк();
	//--- Дмгг, 11.06.2025, ONESOFT-4145
	
КонецПроцедуры

#КонецОбласти

//+++ Дмгг, 11.06.2025, ONESOFT-4145
Процедура УстановитьВидимостьДостуаностьКомандОтправкиДокументаВБанк()
	
	//Пользователь = Пользователи.ТекущийПользователь();
	//ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ЗапретВыгрузкиДокументовВБанк");	
	//
	//Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элементы.ГруппаГлобальныеКоманды.ПодчиненныеЭлементы, "ФормаОбработкаИнтеграцияСБанкомВыгрузитьДокументВБанк") Тогда 
	//	
	//	Элементы.ГруппаГлобальныеКоманды.ПодчиненныеЭлементы.ФормаОбработкаИнтеграцияСБанкомВыгрузитьДокументВБанк.Видимость = НЕ ЗначениеНастройки;
	//    Элементы.ГруппаГлобальныеКоманды.ПодчиненныеЭлементы.ФормаОбработкаИнтеграцияСБанкомВыгрузитьДокументВБанк.Доступность = НЕ ЗначениеНастройки;
	//	
	//КонецЕсли;

	//Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элементы.ГруппаГлобальныеКоманды.ПодчиненныеЭлементы, "ФормаОбработкаИнтеграцияСБанкомОбновитьСтатусыДокументов") Тогда 
	//	
	//	Элементы.ГруппаГлобальныеКоманды.ПодчиненныеЭлементы.ФормаОбработкаИнтеграцияСБанкомОбновитьСтатусыДокументов.Видимость = НЕ ЗначениеНастройки;	
	//	Элементы.ГруппаГлобальныеКоманды.ПодчиненныеЭлементы.ФормаОбработкаИнтеграцияСБанкомОбновитьСтатусыДокументов.Доступность = НЕ ЗначениеНастройки;	
	//	
	//КонецЕсли;

КонецПроцедуры
//--- Дмгг, 11.06.2025, ONESOFT-4145