
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресВариантовПродукцииВХранилище = Параметры.АдресВариантовПродукцииВХранилище;
	
	Запасы.Загрузить(ПолучитьИзВременногоХранилища(АдресВариантовПродукцииВХранилище));
	
	ЗаполнитьТаблицуВариантовПродукции();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуВариантовПродукции()

	тзЗапасы = Запасы.Выгрузить();
	
	КолвоСтрок = тзЗапасы.Количество();
	ТекстЗапроса = ПолучитьТекстЗапроса(КолвоСтрок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);
	тзВариантыПродукции = Запрос.Выполнить().Выгрузить();
	
	ВариантыПродукции.Загрузить(тзВариантыПродукции);

КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапроса(КолвоСтрок)

	ТекстЗапроса =  "ВЫБРАТЬ
		|	тзЗапасы.НомерСтроки КАК НомерСтроки,
		|	тзЗапасы.Номенклатура КАК Номенклатура,
		|	тзЗапасы.Характеристика КАК Характеристика,
		|	тзЗапасы.Количество КАК Количество,
		|	тзЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.НомерСтроки КАК НомерСтроки,
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	ВТ_Запасы.Характеристика КАК Характеристика,
		|	ВТ_Запасы.Количество КАК КоличествоДокумент,
		|	ВТ_Запасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТ_ВсеМатериалы
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВариантыПроизводстваМатериалы.КлючСвязи КАК КлючСвязи,
		|	ВариантыПроизводстваМатериалы.Материал КАК Материал,
		|	ВариантыПроизводстваМатериалы.ВсегоМатериалов КАК ВсегоМатериалов,
		|	ВариантыПроизводстваМатериалы.Количество КАК КоличествоМатериалаНеобходходимо,
		|	ВариантыПроизводстваМатериалы.ЕдиницаИзмерений КАК ЕдиницаИзмерений,
		|	ВариантыПроизводстваМатериалы.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ__ВариантыМатериалов
		|ИЗ
		|	РегистрСведений.ВариантыПроизводстваМатериалы КАК ВариантыПроизводстваМатериалы
		|ГДЕ
		|	(ВариантыПроизводстваМатериалы.Материал, ВариантыПроизводстваМатериалы.Характеристика) В
		|			(ВЫБРАТЬ
		|				а.Номенклатура,
		|				а.Характеристика
		|			ИЗ
		|				ВТ_ВсеМатериалы КАК а)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
	
	Для Сч = 1 По КолвоСтрок Цикл 
		
		Если Сч > 1 Тогда 
			
		    ТекстЗапроса = ТекстЗапроса + "
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|";
			
		КонецЕсли;
		
			
		ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		|	ВТ_ВсеМатериалы.Номенклатура КАК Номенклатура,
		|	ВТ_ВсеМатериалы.Характеристика КАК Характеристика,
		|	ВТ_ВсеМатериалы.КоличествоДокумент КАК КоличествоДокумент,
		|	ВТ_ВсеМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ__ВариантыМатериалов.КлючСвязи КАК КлючСвязи,
		|	ВТ__ВариантыМатериалов.ВсегоМатериалов КАК ВсегоМатериалов,
		|	ВТ__ВариантыМатериалов.КоличествоМатериалаНеобходходимо КАК КоличествоМатериалаНеобходходимо,
		|	ВариантыПроизводстваПродукция.Продукция КАК Продукция,
		|	ВариантыПроизводстваПродукция.Характеристика КАК ХарактеристикаПродукции
		|"+?(Сч = 1, "ПОМЕСТИТЬ ВТ_ДокСВариантом", "") + "
		|ИЗ
		|	ВТ_ВсеМатериалы КАК ВТ_ВсеМатериалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ__ВариантыМатериалов КАК ВТ__ВариантыМатериалов
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыПроизводстваПродукция КАК ВариантыПроизводстваПродукция
		|			ПО ВТ__ВариантыМатериалов.КлючСвязи = ВариантыПроизводстваПродукция.КлючСвязи
		|		ПО ВТ_ВсеМатериалы.Номенклатура = ВТ__ВариантыМатериалов.Материал
		|			И ВТ_ВсеМатериалы.Характеристика = ВТ__ВариантыМатериалов.Характеристика
		|ГДЕ
		|	ВТ_ВсеМатериалы.НомерСтроки = " + Сч + "
		|";
		
	КонецЦикла;
	
		//|ВЫБРАТЬ
		//|	СборкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
		//|	СборкаЗапасовЗапасы.Характеристика КАК Характеристика,
		//|	СборкаЗапасовЗапасы.Количество КАК КоличествоДокумент,
		//|	СборкаЗапасовЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		//|	ВТ__ВариантыМатериалов.КлючСвязи КАК КлючСвязи,
		//|	ВТ__ВариантыМатериалов.ВсегоМатериалов КАК ВсегоМатериалов,
		//|	ВТ__ВариантыМатериалов.КоличествоМатериалаНеобходходимо КАК КоличествоМатериалаНеобходходимо,
		//|	ВариантыПроизводстваПродукция.Продукция КАК Продукция,
		//|	ВариантыПроизводстваПродукция.Характеристика КАК ХарактеристикаПродукции
		//|ПОМЕСТИТЬ ВТ_ДокСВариантом
		//|ИЗ
		//|	Документ.СборкаЗапасов.Запасы КАК СборкаЗапасовЗапасы
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ__ВариантыМатериалов КАК ВТ__ВариантыМатериалов
		//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыПроизводстваПродукция КАК ВариантыПроизводстваПродукция
		//|			ПО ВТ__ВариантыМатериалов.КлючСвязи = ВариантыПроизводстваПродукция.КлючСвязи
		//|		ПО СборкаЗапасовЗапасы.Номенклатура = ВТ__ВариантыМатериалов.Материал
		//|			И СборкаЗапасовЗапасы.Характеристика = ВТ__ВариантыМатериалов.Характеристика
		//|ГДЕ
		//|	СборкаЗапасовЗапасы.Ссылка = &Ссылка
		//|	И СборкаЗапасовЗапасы.НомерСтроки = 1
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	СборкаЗапасовЗапасы.Номенклатура,
		//|	СборкаЗапасовЗапасы.Характеристика,
		//|	СборкаЗапасовЗапасы.Количество,
		//|	СборкаЗапасовЗапасы.ЕдиницаИзмерения,
		//|	ВТ__ВариантыМатериалов.КлючСвязи,
		//|	ВТ__ВариантыМатериалов.ВсегоМатериалов,
		//|	ВТ__ВариантыМатериалов.КоличествоМатериалаНеобходходимо,
		//|	ВариантыПроизводстваПродукция.Продукция,
		//|	ВариантыПроизводстваПродукция.Характеристика
		//|ИЗ
		//|	Документ.СборкаЗапасов.Запасы КАК СборкаЗапасовЗапасы
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ__ВариантыМатериалов КАК ВТ__ВариантыМатериалов
		//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыПроизводстваПродукция КАК ВариантыПроизводстваПродукция
		//|			ПО ВТ__ВариантыМатериалов.КлючСвязи = ВариантыПроизводстваПродукция.КлючСвязи
		//|		ПО СборкаЗапасовЗапасы.Номенклатура = ВТ__ВариантыМатериалов.Материал
		//|			И СборкаЗапасовЗапасы.Характеристика = ВТ__ВариантыМатериалов.Характеристика
		//|ГДЕ
		//|	СборкаЗапасовЗапасы.Ссылка = &Ссылка
		//|	И СборкаЗапасовЗапасы.НомерСтроки = 2
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	СборкаЗапасовЗапасы.Номенклатура,
		//|	СборкаЗапасовЗапасы.Характеристика,
		//|	СборкаЗапасовЗапасы.Количество,
		//|	СборкаЗапасовЗапасы.ЕдиницаИзмерения,
		//|	ВТ__ВариантыМатериалов.КлючСвязи,
		//|	ВТ__ВариантыМатериалов.ВсегоМатериалов,
		//|	ВТ__ВариантыМатериалов.КоличествоМатериалаНеобходходимо,
		//|	ВариантыПроизводстваПродукция.Продукция,
		//|	ВариантыПроизводстваПродукция.Характеристика
		//|ИЗ
		//|	Документ.СборкаЗапасов.Запасы КАК СборкаЗапасовЗапасы
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ__ВариантыМатериалов КАК ВТ__ВариантыМатериалов
		//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыПроизводстваПродукция КАК ВариантыПроизводстваПродукция
		//|			ПО ВТ__ВариантыМатериалов.КлючСвязи = ВариантыПроизводстваПродукция.КлючСвязи
		//|		ПО СборкаЗапасовЗапасы.Номенклатура = ВТ__ВариантыМатериалов.Материал
		//|			И СборкаЗапасовЗапасы.Характеристика = ВТ__ВариантыМатериалов.Характеристика
		//|ГДЕ
		//|	СборкаЗапасовЗапасы.Ссылка = &Ссылка
		//|	И СборкаЗапасовЗапасы.НомерСтроки = 3
		ТекстЗапроса = ТекстЗапроса + ";
		|
		|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_ДокСВариантом.Номенклатура КАК Номенклатура,
		//|	ВТ_ДокСВариантом.Характеристика КАК Характеристика,
		//|	ВТ_ДокСВариантом.КоличествоДокумент КАК КоличествоДокумент,
		//|	ВТ_ДокСВариантом.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		//|	ВТ_ДокСВариантом.КлючСвязи КАК КлючСвязи,
		//|	ВТ_ДокСВариантом.ВсегоМатериалов КАК ВсегоМатериалов,
		//|	ВТ_ДокСВариантом.КоличествоМатериалаНеобходходимо КАК КоличествоМатериалаНеобходходимо,
		//|	ВТ_ДокСВариантом.Продукция КАК Продукция,
		//|	ВТ_ДокСВариантом.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		//|	ВТ_ДокСВариантом.КоличествоМатериалаНеобходходимо / ВТ_ДокСВариантом.КоличествоДокумент КАК КоэфКоличества,
		//|	ВЫБОР
		//|		КОГДА ВТ_ДокСВариантом.КоличествоМатериалаНеобходходимо - ВТ_ДокСВариантом.КоличествоДокумент >= 0
		//|			ТОГДА 1 / ВТ_ДокСВариантом.ВсегоМатериалов * 100
		//|		ИНАЧЕ 1 / ВТ_ДокСВариантом.ВсегоМатериалов * 100 * (ВТ_ДокСВариантом.КоличествоМатериалаНеобходходимо / ВТ_ДокСВариантом.КоличествоДокумент)
		//|	КОНЕЦ КАК Процент
		//|ИЗ
		//|	ВТ_ДокСВариантом КАК ВТ_ДокСВариантом
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДокСВариантом.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_ДокСВариантом.КлючСвязи КАК КлючСвязи,
		|	ВТ_ДокСВариантом.ВсегоМатериалов КАК ВсегоМатериалов,
		|	ВТ_ДокСВариантом.Продукция КАК Номенклатура,
		|	ВТ_ДокСВариантом.ХарактеристикаПродукции КАК Характеристика,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_ДокСВариантом.КоличествоМатериалаНеобходходимо - ВТ_ДокСВариантом.КоличествоДокумент >= 0
		|				ТОГДА 1 / ВТ_ДокСВариантом.ВсегоМатериалов * 100
		|			ИНАЧЕ 1 / ВТ_ДокСВариантом.ВсегоМатериалов * 100 * (ВТ_ДокСВариантом.КоличествоМатериалаНеобходходимо / ВТ_ДокСВариантом.КоличествоДокумент)
		|		КОНЕЦ) КАК Процент,
		|	МИНИМУМ(ВТ_ДокСВариантом.КоличествоМатериалаНеобходходимо / ВТ_ДокСВариантом.КоличествоДокумент) КАК КоличествоМожноПроизвести
		|ПОМЕСТИТЬ ВТ_ПредФинал
		|ИЗ
		|	ВТ_ДокСВариантом КАК ВТ_ДокСВариантом
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДокСВариантом.ЕдиницаИзмерения,
		|	ВТ_ДокСВариантом.КлючСвязи,
		|	ВТ_ДокСВариантом.ВсегоМатериалов,
		|	ВТ_ДокСВариантом.Продукция,
		|	ВТ_ДокСВариантом.ХарактеристикаПродукции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПредФинал.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_ПредФинал.КлючСвязи КАК КлючСвязи,
		|	ВТ_ПредФинал.ВсегоМатериалов КАК ВсегоМатериалов,
		|	ВТ_ПредФинал.Номенклатура КАК Номенклатура,
		|	ВТ_ПредФинал.Характеристика КАК Характеристика,
		|	ВТ_ПредФинал.Процент КАК Процент,
		|	ВТ_ПредФинал.КоличествоМожноПроизвести КАК КоличествоМожноПроизвести
		|ИЗ
		|	ВТ_ПредФинал КАК ВТ_ПредФинал
		|ГДЕ
		|	ВТ_ПредФинал.Процент > 85";	
		
		Возврат ТекстЗапроса;
КонецФункции

// Процедура - обработчик нажатия кнопки ОК.
//
&НаКлиенте
Процедура OK(Команда)
	
	Отказ = Истина;
	КоличествоПродукции = 1;
	Если ВвестиЧисло(КоличествоПродукции, НСтр("ru = 'Введите количество продукции для производства'; ka = 'მიუთითეთ პროდუქციის რაოდენობა საწარმოებლად'; en = 'Введите количество продукции для производства'"), 15, 3) Тогда
		Отказ = ЛОЖЬ;
	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ВариантыПродукции.ТекущиеДанные;
	УИДСтроки = ТекущаяСтрока.ПолучитьИдентификатор();
	
	ЗаписатьПодборВХранилище(УИДСтроки, КоличествоПродукции);
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры

// Процедура помещает результаты варианта в хранилище.
//
&НаСервере
Процедура ЗаписатьПодборВХранилище(УИДСтроки, КоличествоПродукции)
	
	СтрокаВарианта = ВариантыПродукции.НайтиПоИдентификатору(УИДСтроки);
	
	СтрокаВарианта.Количество = КоличествоПродукции;
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(СтрокаВарианта);
	
	ВариантВХранилище = ВариантыПродукции.Выгрузить(МассивСтрок);
	ПоместитьВоВременноеХранилище(ВариантВХранилище, АдресВариантовПродукцииВХранилище);
	
КонецПроцедуры // ЗаписатьПодборВХранилище()

&НаКлиенте
Процедура ВариантыПродукцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВариантыПродукцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	OK(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНоменклатуру(Команда)
	
	ТекущаяСтрока = Элементы.ВариантыПродукции.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	НоменелатураСсылка = ТекущаяСтрока.Номенклатура;
	
	ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", Новый Структура("Ключ", НоменелатураСсылка), ЭтаФорма).Открыть();
	
КонецПроцедуры