

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Запасы.Итог("Сумма");
	
КонецПроцедуры

// Олег Литвиненко 05.10.22 --->
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.ЗаказНаВозврат.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, ЭтотОбъект);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	//--------------------------------------------------------------------------
	// © Шишка В.В. [29 сентября 2023]  НАЧАЛО
	//ONESOFT-1539 этот регистр не нужен
	//УправлениеНебольшойФирмойСервер.ОтразитьПроданныеИВозвращенныеТовары(ДополнительныеСвойства, Движения, Отказ);
	КонтрольКоличества = Ложь;
	ДополнительныеСвойства.ДляПроведения.Свойство("КонтрольКоличества", КонтрольКоличества);
	//Если КонтрольКоличества Тогда
	//
	//	УправлениеНебольшойФирмойСервер.ОтразитьЗаявкиНаВозврат(ДополнительныеСвойства, Движения, Отказ);
	//
	//КонецЕсли; 
	// © Шишка В.В. [29 сентября 2023]  КОНЕЦ
	//--------------------------------------------------------------------------

КонецПроцедуры// Олег Литвиненко <-


Процедура ПриЗаписи(Отказ)
	
	
	// Вставить содержимое обработчика.
	//--------------------------------------------------------------------------
	// © Шишка В.В. [29 сентября 2023]  НАЧАЛО
	//Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение И (Не ДополнительныеСвойства.Свойство("ЗаписьИзДокумента") Или НЕ ДополнительныеСвойства.ЗаписьИзДокумента) Тогда
	//	
	//	СписокСтрок = Документы.ЗаказНаВозврат.КонтрольКоличестваПриВозврате(ЭтотОбъект);
	//	
	//	Документы.ЗаказНаВозврат.ВывестиОшибкиКонтроляКоличестваПриВозврате(СписокСтрок);

	//КонецЕсли;
	// © Шишка В.В. [29 сентября 2023]  КОНЕЦ
	//--------------------------------------------------------------------------
	
КонецПроцедуры

