#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура СоздатьНовуюТаблицуРеквизитов(ДоступныеПоля)
	
	ДоступныеПоля = Новый ТаблицаЗначений;
	ДоступныеПоля.Колонки.Добавить("Использование");
	ДоступныеПоля.Колонки.Добавить("РеквизитНоменклатуры");
	ДоступныеПоля.Колонки.Добавить("РеквизитПредставление");
	ДоступныеПоля.Колонки.Добавить("ПараметрРасшифровки");
	ДоступныеПоля.Колонки.Добавить("Ширина");
	ДоступныеПоля.Колонки.Добавить("СлужебныйУправлениеВидимостью");
	
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Использование, РеквизитНоменклатуры, РеквизитПредставление, ПараметрРасшифровки = "", Ширина, СлужебныйУправлениеВидимостью = Истина)
	
	НоваяСтрока							= ДоступныеПоля.Добавить();
	НоваяСтрока.Использование			= Использование;
	НоваяСтрока.РеквизитНоменклатуры	= РеквизитНоменклатуры;
	НоваяСтрока.РеквизитПредставление	= РеквизитПредставление;
	НоваяСтрока.ПараметрРасшифровки		= ПараметрРасшифровки;
	НоваяСтрока.Ширина					= Ширина;
	НоваяСтрока.СлужебныйУправлениеВидимостью = СлужебныйУправлениеВидимостью;
	
КонецПроцедуры

Процедура ДоступныеПоляНоменклатуры(ДоступныеПоля) Экспорт
	
	СоздатьНовуюТаблицуРеквизитов(ДоступныеПоля);
	
	ИспользованиеХарактеристик = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
	ПредставлениеКолонки = НСтр("ru='Картинка';ka='სურათი';en='Picture'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Картинка",				"Картинка",				"НоменклатураСсылка",			8);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Картинка",				ПредставлениеКолонки,				"НоменклатураСсылка",			8);
	
	ПредставлениеКолонки = НСтр("ru='Код';ka='კოდი';en='Code'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Код",					"Код",					"НоменклатураСсылка",			11);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Код",					ПредставлениеКолонки,					"НоменклатураСсылка",			11);
	
	ПредставлениеКолонки = НСтр("ru='Артикул';ka='არტიკული';en='vendor code'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Артикул",				"Артикул",				"НоменклатураСсылка",			11);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Артикул",				ПредставлениеКолонки,				"НоменклатураСсылка",			11);
	
	ПредставлениеКолонки = НСтр("ru='Наименование';ka='დასახელება';en='Name'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Наименование",			"Наименование",			"НоменклатураСсылка",			30);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Наименование",			ПредставлениеКолонки,			"НоменклатураСсылка",			30);
	
	ПредставлениеКолонки = НСтр("ru='Полное наименование';ka='დასაბეჭდი სახელწოდება';en='Full name'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "НаименованиеПолное",	"Полное наименование",	"НоменклатураСсылка",			30);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "НаименованиеПолное",	ПредставлениеКолонки,	"НоменклатураСсылка",			30);
	
	ПредставлениеКолонки = НСтр("ru='Описание';ka='აღწერა';en='Description'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Комментарий",			"Описание",				"НоменклатураСсылка",			30);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Комментарий",			ПредставлениеКолонки,				"НоменклатураСсылка",			30);
	
	ПредставлениеКолонки = НСтр("ru='Характеристика';ka='მახასიათებელი';en='Characteristic'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, ИспользованиеХарактеристик, "Характеристика", "Характеристика", "РасшифровкаХарактеристика", 14, ИспользованиеХарактеристик);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, ИспользованиеХарактеристик, "Характеристика", ПредставлениеКолонки, "РасшифровкаХарактеристика", 14, ИспользованиеХарактеристик);
	
	ПредставлениеКолонки = НСтр("ru='Страна';ka='ქვეყანა';en='Country'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "СтранаПроисхождения",	"Страна",				"НоменклатураСсылка",			7);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "СтранаПроисхождения",	ПредставлениеКолонки,				"НоменклатураСсылка",			7);
	
	ПредставлениеКолонки = НСтр("ru='Свободный остаток';ka='თავისუფალი ნაშთი';en='Free balance'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Ложь,	"СвободныйОстаток",		"Свободный остаток",	"НоменклатураСсылка",			10);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Ложь,	"СвободныйОстаток",		ПредставлениеКолонки,	"НоменклатураСсылка",			10);
	
	ПредставлениеКолонки = НСтр("ru='Штрихкод';ka='შტრიხკოდი';en='Barcode'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Ложь,	"Штрихкод",				"Штрихкод",				"НоменклатураСсылка",			17); //++Lazare 
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Ложь,	"Штрихкод",				ПредставлениеКолонки,				"НоменклатураСсылка",			17); //++Lazare 
	
КонецПроцедуры

#КонецЕсли