#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов);
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыУНФ.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов)
	
	Для каждого НастройкиТекВарианта Из НастройкиВариантов Цикл
		
		ВариантыОформления = НастройкиТекВарианта.Значение.ВариантыОформления;
		ОтчетыУНФ.ДобавитьВариантыОформленияСумм(
		ВариантыОформления,
		"НачисленоПроцентов,ОстатокКомиссииКонОстаток,ОстатокОсновногоДолгаКонОстаток,"
		+ "ОстатокОсновногоДолгаНачОстаток,ОстатокПроцентовКонОстаток,ПогашеноОсновногоДолга,"
		+ "ПогашеноПроцентов,Выплачено,НачисленаКомиссия,ПогашенаКомиссия");
		
	КонецЦикла
	
КонецПроцедуры

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["ЗаймыСотрудникам"].Теги = НСтр("ka='Деньги,Кредиты,Займы,Зарплата';ru='Деньги,Кредиты,Займы,Зарплата';en='Money, Credit, Loans, Salary'");
	НастройкиВариантов["КредитыПолученные"].Теги = НСтр("ka='Деньги,Кредиты,Займы';ru='Деньги,Кредиты,Займы';en='Money, credit, loans'");
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ЗаймыСотрудникам"].СвязанныеПоля, "Сотрудник", "Справочник.Сотрудники");
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["КредитыПолученные"].СвязанныеПоля, "Контрагент", "Справочник.Контрагенты");
	
КонецПроцедуры

#КонецОбласти

ЭтоОтчетУНФ = Истина;

#КонецЕсли
