
//&Вместо("ИнициализироватьДанныеДокумента_Deprecated")
//Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаРаспределениеЗатрат, СтруктураДополнительныеСвойства)

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Затраты.НомерСтроки КАК НомерСтроки,
//	|	Затраты.Ссылка.Дата КАК Период,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//	|	&Организация КАК Организация,
//	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
//	|	Затраты.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	Затраты.Ссылка.СтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
//	|	Затраты.СчетЗатрат КАК СчетУчета,
//	|	Затраты.ВнеоборотныйАктив КАК Имущество,
//	|	РаспределениеЗатрат.Номенклатура.СчетУчетаЗатрат КАК КоррСчетУчета,
//	//+++
//	|	Затраты.СчетЗатратРегл КАК СчетУчетаРегл,
//	|	РаспределениеЗатрат.Номенклатура.СчетУчетаЗатратРегл КАК КоррСчетУчетаРегл,
//	//---
//	|	РаспределениеЗатрат.Номенклатура КАК КоррНоменклатура,
//	//+++ Дмгг
//	//|	НЕОПРЕДЕЛЕНО КАК Номенклатура,
//	|	Затраты.Номенклатура КАК Номенклатура,
//	//--- Дмгг
//	|	ВЫБОР
//	|		КОГДА &ИспользоватьХарактеристики
//	|			ТОГДА РаспределениеЗатрат.Характеристика
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
//	|	КОНЕЦ КАК КоррХарактеристика,
//	//+++ Дмгг
//	//|	НЕОПРЕДЕЛЕНО КАК Характеристика,
//	//--- Дмгг
//	|	ВЫБОР
//	|		КОГДА &ИспользоватьХарактеристики
//	|			ТОГДА Затраты.Характеристика
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
//	|	КОНЕЦ КАК Характеристика,
//	//--- Дмгг
//	|	ВЫБОР
//	|		КОГДА &ИспользоватьПартии
//	|			ТОГДА РаспределениеЗатрат.Партия
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
//	|	КОНЕЦ КАК КоррПартия,
//	|	НЕОПРЕДЕЛЕНО КАК Партия,
//	|	РаспределениеЗатрат.Спецификация КАК КоррСпецификация,
//	|	НЕОПРЕДЕЛЕНО КАК Спецификация,
//	|	Затраты.ЗаказПокупателя КАК ЗаказПокупателя,
//	|	РаспределениеЗатрат.ЗаказПокупателя КАК КоррЗаказПокупателя,
//	|	РаспределениеЗатрат.Сумма КАК Сумма,
//	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит) КАК ВидДвиженияУправленческий,
//	|	ЛОЖЬ КАК ЗатратыНаВыпуск,
//	|	ИСТИНА КАК ФиксированнаяСтоимость,
//	|	0 КАК Количество,
//	|	0 КАК КоличествоРаспределенияЗапасов, //+++ Дмгг
//	|	РаспределениеЗатрат.Номенклатура.СчетУчетаЗатрат КАК СчетДт,
//	|	Затраты.СчетЗатрат КАК СчетКт,
//	//+++
//	|	РаспределениеЗатрат.Номенклатура.СчетУчетаЗатратРегл КАК СчетДтРегл,
//	|	Затраты.СчетЗатратРегл КАК СчетКтРегл,
//	//---
//	|	ВЫРАЗИТЬ(&РаспределениеРаходов КАК СТРОКА(100)) КАК Содержание,
//	|	ВЫРАЗИТЬ(&РаспределениеРаходов КАК СТРОКА(100)) КАК СодержаниеПроводки
//	// +++ { AzRy - [09.08.2022] - Jira: - Developer:გიორგი მამულაშვილი - Comment:  
//	|	,Затраты.AzRyПроект КАК Проект,
//	|	РаспределениеЗатрат.AzRyПроект КАК Проект1
//	// +++ } AzRy - [09.08.2022] - Jira: - Developer:გიორგი მამულაშვილი - Comment:	
//	|ИЗ
//	|	Документ.РаспределениеЗатрат.Затраты КАК Затраты
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеЗатрат.РаспределениеЗатрат КАК РаспределениеЗатрат
//	|		ПО Затраты.Ссылка = РаспределениеЗатрат.Ссылка
//	|			И Затраты.КлючСвязи = РаспределениеЗатрат.КлючСвязи
//	|ГДЕ
//	|	Затраты.Ссылка = &Ссылка
//	|	И РаспределениеЗатрат.Ссылка = &Ссылка";
//			
//	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРаспределениеЗатрат);
//	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
//	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
//	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
//	Запрос.УстановитьПараметр("РаспределениеРаходов", НСтр("ka='დანახარჯების გადანაწილება';ru='Распределение затрат';en='cost sharing'"));
//	
//	// Формирование структуры таблицы проводок.
//	УправлениеНебольшойФирмойСервер.СформироватьТаблицуПроводок(ДокументСсылкаРаспределениеЗатрат, СтруктураДополнительныеСвойства);
//		
//	ТаблицаЗапасы = Запрос.Выполнить().Выгрузить();
//	Для н = 0 По ТаблицаЗапасы.Количество() - 1 Цикл
//		
//		// Расход.
//		СтрокаТаблицаЗапасыРасход = ТаблицаЗапасы[н];
//		СтрокаТаблицаЗапасыРасход.ЗатратыНаВыпуск = Истина;
//		
//		// Приход.
//		СтрокаТаблицаЗапасыПриход = ТаблицаЗапасы.Добавить();
//		ЗаполнитьЗначенияСвойств(СтрокаТаблицаЗапасыПриход, СтрокаТаблицаЗапасыРасход);

//		СтрокаТаблицаЗапасыПриход.ВидДвижения               = ВидДвиженияНакопления.Приход;

//		СтрокаТаблицаЗапасыПриход.Организация = СтрокаТаблицаЗапасыРасход.Организация; 
//		
//		СтрокаТаблицаЗапасыПриход.СтруктурнаяЕдиница = СтрокаТаблицаЗапасыРасход.КоррСтруктурнаяЕдиница;
//		СтрокаТаблицаЗапасыПриход.СчетУчета = СтрокаТаблицаЗапасыРасход.КоррСчетУчета;
//		СтрокаТаблицаЗапасыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасыРасход.КоррСчетУчетаРегл;
//		СтрокаТаблицаЗапасыПриход.Номенклатура = СтрокаТаблицаЗапасыРасход.КоррНоменклатура; 
//		СтрокаТаблицаЗапасыПриход.Характеристика = СтрокаТаблицаЗапасыРасход.КоррХарактеристика;
//		СтрокаТаблицаЗапасыПриход.Партия = СтрокаТаблицаЗапасыРасход.КоррПартия;
//		СтрокаТаблицаЗапасыПриход.Спецификация = СтрокаТаблицаЗапасыРасход.КоррСпецификация;
//		СтрокаТаблицаЗапасыПриход.ЗаказПокупателя = СтрокаТаблицаЗапасыРасход.КоррЗаказПокупателя;

//		СтрокаТаблицаЗапасыПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасыРасход.СтруктурнаяЕдиница;
//		СтрокаТаблицаЗапасыПриход.КоррСчетУчета = СтрокаТаблицаЗапасыРасход.СчетУчета;
//		СтрокаТаблицаЗапасыПриход.КоррСчетУчетаРегл = СтрокаТаблицаЗапасыРасход.СчетУчетаРегл;
//		СтрокаТаблицаЗапасыПриход.КоррСпецификация = СтрокаТаблицаЗапасыРасход.Спецификация;
//		СтрокаТаблицаЗапасыПриход.КоррЗаказПокупателя = СтрокаТаблицаЗапасыРасход.ЗаказПокупателя;

//		СтрокаТаблицаЗапасыПриход.ВидДвиженияУправленческий = ВидДвиженияБухгалтерии.Дебет;
//		СтрокаТаблицаЗапасыПриход.ЗатратыНаВыпуск = Ложь;
//		
//		// Сформируем проводки.
//		Если СтрокаТаблицаЗапасыРасход.Сумма > 0 Тогда
//			СтрокаТаблицаУправленческий = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
//			ЗаполнитьЗначенияСвойств(СтрокаТаблицаУправленческий, СтрокаТаблицаЗапасыРасход);
//			
//			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_РаспределениеЗатрат1(ДокументСсылкаРаспределениеЗатрат, СтруктураДополнительныеСвойства, СтрокаТаблицаЗапасыРасход);
//		КонецЕсли;
//		
//		// +++ { AzRy - [09.08.2022] - Jira: - Developer:გიორგი მამულაშვილი - Comment:  
//		СтрокаТаблицаЗапасыРасход.Проект = СтрокаТаблицаЗапасыРасход.Проект1;			
//		// +++ } AzRy - [09.08.2022] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
//		
//	КонецЦикла;	
//	
//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", ТаблицаЗапасы);
//	
//	ИнициализироватьДанныеПоЗапасам(ДокументСсылкаРаспределениеЗатрат, СтруктураДополнительныеСвойства);
//	
//КонецПроцедуры
