
&НаСервереБезКонтекста
&Вместо("ЗаполнитьДанныеБанка")
Процедура РасшAzRy_ЗаполнитьДанныеБанка(БИКБанка, КоррСчетБанка, ЯвляетсяБанкомРФ, Знач Банк, Знач ВладелецСчета)
	
	РеквизитыБанка = Справочники.Банки.РеквизитыБанка(Банк);
	
	// +++ { AzRy - [10.02.2021] - // -- // - Developer:გიორგი მამულაშვილი - Comment: ცვლილება იმპორტისთვის
	БИКБанка = РеквизитыБанка.Код;
	//Если РеквизитыБанка.ЯвляетсяБанкомРФ Тогда 
	//	БИКБанка = РеквизитыБанка.Код;
	//Иначе
	//	БИКБанка = РеквизитыБанка.СВИФТБИК;
	//КонецЕсли;	
	// +++ } AzRy - [10.02.2021] - // -- // - Developer:გიორგი მამულაშვილი - Comment: ცვლილება იმპორტისთვის
	
	КоррСчетБанка = РеквизитыБанка.КоррСчет;
	ЯвляетсяБанкомРФ = РеквизитыБанка.ЯвляетсяБанкомРФ;
	
КонецПроцедуры

&НаСервере
&Вместо("УстановитьНаименованиеБанка")
Процедура РасшAzRy_УстановитьНаименованиеБанка()
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		НаименованиеБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Банк, "Наименование");
		Объект.Наименование = Лев(СокрЛп(Объект.НомерСчета) + ?(ЗначениеЗаполнено(НаименованиеБанка), ", в " + НаименованиеБанка, ""), 100);	
	КонецЕсли; 

КонецПроцедуры
