
&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ОчиститьСообщения();
	ПарольВерные = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПроверитьВозможностьВключениеКонстанты_ПоказыватьБухгалтерскиеПроводки(Пароль);
	Элементы.ОПТИМУС_КоличествоПлановОбменаДистрибуции.Доступность = ПарольВерные;
	Если НЕ ПарольВерные Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСТР("ka='პაროლი არასწორია!';ru='Пароль неверный!';en='Wrong password!'");
		Сообщение.Поле =  "Пароль";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ПарольВерные Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСТР("ka='პაროლი არასწორია!';ru='Пароль неверный!';en='Wrong password!'");
		Сообщение.Поле =  "Пароль";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры
