
&Вместо("ВДокументеКонтрагентЯвляетсяНеРезидентом")
Функция РасшAzRy_ВДокументеКонтрагентЯвляетсяНеРезидентом(Документ)
	
	Если Тип("ДокументСсылка.РасходСоСчета") = ТипЗнч(Документ) Тогда
		Договор = ?(Документ.РасшифровкаПлатежа.Количество() > 0, Документ.РасшифровкаПлатежа[0].Договор, Документ.ДоговорДляЗачетаАвансаСПомощником);
		Возврат КонтрагентЯвляетсяНеРезидентом(Документ.Контрагент, Договор);
	ИначеЕсли Тип("ДокументСсылка.ПриходнаяНакладная") = ТипЗнч(Документ) Тогда	
		Возврат КонтрагентЯвляетсяНеРезидентом(Документ.Контрагент, Документ.Договор);
	КонецЕсли;
	
КонецФункции
