
&Вместо("ВДокументеКонтрагентЯвляетсяНеРезидентом")
Функция РасшAzRy_ВДокументеКонтрагентЯвляетсяНеРезидентом(Документ)
	
	Если Тип("ДокументСсылка.РасходСоСчета") = ТипЗнч(Документ) Тогда
		Договор = ?(Документ.РасшифровкаПлатежа.Количество() > 0, Документ.РасшифровкаПлатежа[0].Договор, Документ.ДоговорДляЗачетаАвансаСПомощником);
		Возврат КонтрагентЯвляетсяНеРезидентом(Документ.Контрагент, Договор);
	ИначеЕсли Тип("ДокументСсылка.ПриходнаяНакладная") = ТипЗнч(Документ) Тогда	
		Возврат КонтрагентЯвляетсяНеРезидентом(Документ.Контрагент, Документ.Договор);
	КонецЕсли;
	
КонецФункции

Функция СоответствиеКодовУправленческийХозрасчетный(Код) Экспорт

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("3120", "3120");
	Соответствие.Вставить("1480", "1480");
	Соответствие.Вставить("1410", "1410");
	Соответствие.Вставить("3110", "3110");
	
	Возврат ПланыСчетов.Хозрасчетный.НайтиПоКоду(Соответствие.Получить(Код)); 	

КонецФункции
	
&После("AzRyЗапретРедактированияДокументовПередЗаписью")
Процедура РасшAzRy_AzRyЗапретРедактированияДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)
	
	Если Источник.AzRyЗапретРедактированияДокументов И Не ПараметрыСеанса.AzRyОтключитьЗапретРедактированияДокументов Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Текущий документ заблокированн!'; ka = 'მოცემული დოკუმენტი გადმოტანილია ძველი ბაზიდან და დაბლოკილია ცვლილებებზე!'; en = 'Current Document Blocked!'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Источник.Ссылка,ТекстСообщения, , , ,Отказ);		
	КонецЕсли;	
	
КонецПроцедуры
