#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов);
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//+++ Дмгг, 02.07.25, ONESOFT-4188
	//Перенесено в модуль формы общей форми отчетов
	//// Kuzmich, 14.01.2025, (ONESOFT-3767) Новая форма Декларации (Приложение "А")
	ТекущиеНастройки = КомпоновщикНастроек.Настройки;        
	//
	ДополнительныеСвойства = КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	//
	//ТекущийАдресСхемы = НЕОПРЕДЕЛЕНО;
	//ТекущийУникальныйИдентификатор = НЕОПРЕДЕЛЕНО;
	//
	//Если НЕ ДополнительныеСвойства.Свойство("ТекущийАдресСхемы",ТекущийАдресСхемы) Тогда
	//	Если НЕ ДополнительныеСвойства.Свойство("ТекущийУникальныйИдентификатор",ТекущийУникальныйИдентификатор) Тогда
	//		ТекущийУникальныйИдентификатор = Новый УникальныйИдентификатор();
	//	КонецЕсли;
	//	ТекущийАдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ТекущийУникальныйИдентификатор);
	//КонецЕсли;

	//ТекущийПараметрПериод  = ТекущиеНастройки.ПараметрыДанных.Элементы.Найти("Период");
	//ДатаНачала = ТекущийПараметрПериод.Значение.ДатаНачала;
	//ДатаОкончания = ТекущийПараметрПериод.Значение.ДатаОкончания;
	//Если ДатаОкончания < Дата("20241201000000")  Тогда
	//	
	//	СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	//	
	//	ОсновныеНастройки = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки;
	//	
	//	Для каждого ЭлементПараметра Из ТекущиеНастройки.ПараметрыДанных.Элементы Цикл
	//	
	//		ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Найти(ЭлементПараметра.ИдентификаторПользовательскойНастройки);
	//		Если ПараметрОсновнойНастройки = НЕОПРЕДЕЛЕНО Тогда
	//		
	//			ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Добавить();
	//		
	//		КонецЕсли;
	//		
	//		ЗаполнитьЗначенияСвойств(ПараметрОсновнойНастройки,ЭлементПараметра);
	//	
	//	КонецЦикла;  
	//	
	//	//+++ Дмгг, 25.03.25, ONESOFT-3938
	//	ОсновныеНастройки.Отбор.Элементы.Очистить();
	//	Для каждого ЭлементОтбор Из ТекущиеНастройки.Отбор.Элементы Цикл                             
	//	
	//		ОтборОсновнойНастройки = ОсновныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		
	//		ЗаполнитьЗначенияСвойств(ОтборОсновнойНастройки,ЭлементОтбор);
	//	
	//	КонецЦикла;    
	//	//--- Дмгг, 25.03.25, ONESOFT-3938
	//	
	//	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ТекущийАдресСхемы);
	//	
	//	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	//	КомпоновщикНастроек.ЗагрузитьНастройки(ОсновныеНастройки);
	//	КомпоновщикНастроек.Восстановить();
	//	
	//ИначеЕсли ДатаНачала >= Дата("20241201000000")  Тогда
	//	
	//	СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных2025");
	//	
	//	ОсновныеНастройки = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки;
	//	
	//	Для каждого ЭлементПараметра Из ТекущиеНастройки.ПараметрыДанных.Элементы Цикл
	//	
	//		ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Найти(ЭлементПараметра.ИдентификаторПользовательскойНастройки);
	//		Если ПараметрОсновнойНастройки = НЕОПРЕДЕЛЕНО Тогда
	//		
	//			ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Добавить();
	//		
	//		КонецЕсли;
	//		
	//		ЗаполнитьЗначенияСвойств(ПараметрОсновнойНастройки,ЭлементПараметра);
	//	
	//	КонецЦикла;                                                       
	//	
	//	//+++ Дмгг, 25.03.25, ONESOFT-3938
	//	ОсновныеНастройки.Отбор.Элементы.Очистить();
	//	Для каждого ЭлементОтбор Из ТекущиеНастройки.Отбор.Элементы Цикл                             
	//	
	//		ОтборОсновнойНастройки = ОсновныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		
	//		ЗаполнитьЗначенияСвойств(ОтборОсновнойНастройки,ЭлементОтбор);
	//	
	//	КонецЦикла;    
	//	//--- Дмгг, 25.03.25, ONESOFT-3938   
	//	
	//	//+++ Дмгг, 02.07.25, ONESOFT-4188 
	//	// Перенесем сделаные настройки группировок в новую СКД                              //КомпоновщикНастроек.Настройки.Структура[0].ПоляГруппировки.Элементы
	//	Для каждого УровеньГруппировки Из ТекущиеНастройки.Структура Цикл
	//	
	//		//ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Найти(ЭлементПараметра.ИдентификаторПользовательскойНастройки);
	//		//Если ПараметрОсновнойНастройки = НЕОПРЕДЕЛЕНО Тогда
	//		//
	//		//	ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Добавить();
	//		//
	//		//КонецЕсли;
	//		//
	//		//ЗаполнитьЗначенияСвойств(ПараметрОсновнойНастройки,ЭлементПараметра);
	//	
	//	КонецЦикла;
	//	//+++ Дмгг, 02.07.25, ONESOFT-4188
	//	
	//	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ТекущийАдресСхемы);
	//	
	//	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	//	КомпоновщикНастроек.ЗагрузитьНастройки(ОсновныеНастройки);
	//	КомпоновщикНастроек.Восстановить();
	//
	//КонецЕсли;
	//// Kuzmich, 14.01.2025, (ONESOFT-3767) Новая форма Декларации (Приложение "А")  
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(ДополнительныеСвойства.ТекущийАдресСхемы);
	//--- Дмгг, 02.07.25, ONESOFT-4188
	
	ОтчетыУНФ.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов)
	
	Для Каждого НастройкиТекВарианта Из НастройкиВариантов Цикл
		НастройкиТекВарианта.Значение.Теги = НСтр("ka='Зарплата,Налоги,Льготы,';ru='Зарплата,Налоги,Льготы,'");
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["Основной"].Теги = НСтр("ka='ხელფასი';ru='Зарплата';en='Salary'");
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
КонецПроцедуры
 
#КонецОбласти 

ЭтоОтчетУНФ = Истина;

#КонецЕсли
