
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗапроситьЛицензииУникальныхУслуг();
	
	ПоказатьПредупреждение(, НСтр("ka='Услуги успешно запрошены у Менеджера сервиса';ru='Услуги успешно запрошены у Менеджера сервиса';en='Services successfully requested from the service manager'"));
	
КонецПроцедуры

&НаСервере
Процедура ЗапроситьЛицензииУникальныхУслуг()
	
	ТарификацияСлужебный.ЗапроситьЛицензииУникальныхУслуг_ОбработчикОбновления(Истина);
	
КонецПроцедуры
