
&НаКлиенте
Процедура СгенерироватьКод(Команда)
	Запись.Код = ГенерацияСлучайногоСимвола(ТекущаяУниверсальнаяДатаВМиллисекундах());
КонецПроцедуры

&НаСервере
Функция ГенерацияСлучайногоСимвола(Счетчик)
    ГСЧ = Новый ГенераторСлучайныхЧисел(Счетчик);    
    СлучайнаяСтрока = "";
    // генерируем случайное число из 6-ти символов, например "d0c8Yf"
	Для Сч = 1 по 6 Цикл        
		СлучайныйСимвол = ГСЧ.СлучайноеЧисло(0,9);    
		СлучайнаяСтрока = СлучайнаяСтрока + СлучайныйСимвол;
	КонецЦикла;      
	Возврат(СлучайнаяСтрока);    
КонецФункции