Перем ТаблицаОстатковПоДням;
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидимостьОбновлений = Ложь;
	УстановитьВидимость();
	Объект.ИдентификаторПриложения = Константы.ИдентификаторПриложенияBoG.Получить();
	
	УстановитьОтбор();
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда 
		Объект.Организация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
								Пользователи.ТекущийПользователь(),
								"ОсновнаяОрганизация");
	КонецЕсли;
							
	Если СчетаУчетаПоУмолчаниюВходящие.Количество() = 0 Тогда 
		
		ЗаполнитьТаблицуСчетовПоУмолчанию("Входящие");
		
	КонецЕсли;
	
	Если СчетаУчетаПоУмолчаниюРасход.Количество() = 0 Тогда 
		
		ЗаполнитьТаблицуСчетовПоУмолчанию("Расход");
		
	КонецЕсли;
	
	НациональнаяВалюта = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("НациональнаяВалюта");//.Получить();
	
	РабочийБанк = Справочники.Банки.НайтиПоРеквизиту("СВИФТБИК","BAGAGE22");
	
	Если ЗначениеЗаполнено(РабочийБанк) Тогда 
		Объект.Банк = РабочийБанк;
		Элементы.Банк.Вид = ВидПоляФормы.ПолеНадписи;
	Иначе
		Элементы.Банк.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	АвторизацияАккаунта(Неопределено);
	УстановитьОтбор();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ


// Авторизация--
&НаКлиенте
Процедура АдресСтраницыАутентификацииДокументСформирован(Элемент)
	
	Если ТокенПолучен Тогда
		Возврат;
	КонецЕсли;
	
	Если Найти(Элемент.Документ.location.href, "access_token=") <> 0 Тогда	
		ТокенДоступа = ПолучитьТокенИзURL();
		УстановитьТокенДоступа(ТокенДоступа);
		Токен = ТокенДоступа;
		ТокенПолучен = Истина;
		Элементы.СтраницаОбщая.Видимость = Истина;
		Элементы.СтраницыВебСервисов.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТокенИзURL()
	
	ТекущийURL = Элементы.АдресСтраницыАутентификации.Документ.location.href;
	НачалоТокена = Найти(ТекущийURL, "access_token=") + 13;
	КонецТокена = Найти(Сред(ТекущийURL, НачалоТокена), "&") - 1;
	Если КонецТокена > -1 Тогда 
		Возврат Сред(ТекущийURL, НачалоТокена, КонецТокена);
	Иначе
		Возврат Сред(ТекущийURL, НачалоТокена);	
	КонецЕсли;	
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьТокенДоступа(ТокенДоступа)
	
	Константы.ТокенДоступаBoG.Установить(ТокенДоступа);
	
	// плюс новая система
	ТекПользователь = Пользователи.АвторизованныйПользователь();
	
	НаборЗаписейТокена = РегистрыСведений.ТокеныПользователейBOG.СоздатьНаборЗаписей();
	
	НаборЗаписейТокена.Отбор.Пользователь.Установить(ТекПользователь);
	
	НоваяЗапись = НаборЗаписейТокена.Добавить();
	НоваяЗапись.Пользователь = ТекПользователь;
	НоваяЗапись.Токен = ТокенДоступа;
	НоваяЗапись.ДатаВремяПолучения = ТекущаяДата();
	
	НаборЗаписейТокена.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияАккаунта(Команда)	
	
	Если НЕ Объект.ЗапускатьРеальныйБанк Тогда 
		ID_Пользователя = ПолучитьIDПользователя();
		
		АдресСтраницыАутентификации = "https://cib2-web-dev.bog.ge:8090/Oauth/Connect/Authorize.aspx?client_id="+ID_Пользователя+"&response_type=token&scope=read+write&redirect_uri=https%3A%2F%2Fcib2-web-dev.bog.ge%3A8090%2FOauth%2FConnect%2FToken.aspx&state=e46fcdf4-a4bf-4dc6-8a42-e1b12e27826b";
	Иначе
		ID_Пользователя = IDРеальногоБанка;
		ДатаНачалИспользованияНовогоДоступаКБанкуBOG = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ДатаНачалаИспользованияНовогоДоступаКБанкуBOG");
		Если НачалоДня(ДатаНачалИспользованияНовогоДоступаКБанкуBOG) <= НачалоДня(ТекущаяДата()) Тогда 
			//АдресСтраницыАутентификации = "https://account.bog.ge/auth/realms/bog/protocol/openid-connect/auth?client_id="+ID_Пользователя+"&response_type=token&scope=read+write&redirect_uri=https://account.bog.ge/auth/realms/bog/protocol/openid-connect/token&state=e46fcdf4-a4bf-4dc6-8a42-e1b12e27826b";
			АдресСтраницыАутентификации = "https://account.bog.ge/auth/realms/bog/protocol/openid-connect/auth?client_id="+ID_Пользователя+"&response_type=token&scope=corp&redirect_uri=https://account.bog.ge/auth/realms/bog/protocol/openid-connect/token&state=e46fcdf4-a4bf-4dc6-8a42-e1b12e27826b";
		Иначе
			АдресСтраницыАутентификации = "https://businessonline.ge/Oauth/Connect/Authorize.aspx?client_id="+ID_Пользователя+"&response_type=token&scope=read+write&redirect_uri=https://businessonline.ge/Oauth/Connect/Token.aspx&state=e46fcdf4-a4bf-4dc6-8a42-e1b12e27826b";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры                          //https://cib2-web-dev.bog.ge:8090  571f5232-817f-403a-9c2e-f3215b6fc5db
// Авторизация


// Даты --
&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	//ПроверитьПравильностьДат();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	//ПроверитьПравильностьДат();	
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПравильностьДат()	
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончания) И ЗначениеЗаполнено(Объект.ДатаНачала) Тогда 
		Если Не Объект.ДатаНачала < Объект.ДатаОкончания Тогда 
			ТекстСообщения = НСтр("ka='დაწყების თარიღი არ უნდა იყოს დასრულების თარიღზე მეტი ან ტოლი!';ru='Дата начала не может быть больше или ровна дате окончания!';en='Start date can not be greater than or equal to the end date!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Объект,, Истина);
			Возврат;
		КонецЕсли;
	Иначе 
		ТекстСообщения = НСтр("ka='დაწყების თარიღი და დასრულების თარიღი აუცილებლად შესავსები ველებია!';ru='Дата начала и дата окончания обязательны для заполнения!';en='Start date and end date are required!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Объект,, Истина);	
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры
// Даты


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьТаблицуСчетовПоУмолчанию(ИмяТаблицы)
	
	Если ИмяТаблицы = "Входящие" Тогда
		
		Для Каждого Элемент Из Метаданные.Перечисления.ВидыОперацийПоступлениеНаСчет.ЗначенияПеречисления Цикл 
			НовСтрокВход = СчетаУчетаПоУмолчаниюВходящие.Добавить();
			НовСтрокВход.ВидОперации 			= Перечисления.ВидыОперацийПоступлениеНаСчет[Элемент.Имя];
			НовСтрокВход.Корреспонденция 		= ПланыСчетов.Управленческий.ПустаяСсылка();
			НовСтрокВход.КорреспонденцияРегл	= ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			НовСтрокВход.Статья					= Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
		КонецЦикла;
		
	ИначеЕсли ИмяТаблицы = "Расход" Тогда
		
		Для Каждого Элемент Из Метаданные.Перечисления.ВидыОперацийРасходСоСчета.ЗначенияПеречисления Цикл 
			НовСтрокВход = СчетаУчетаПоУмолчаниюРасход.Добавить();
			НовСтрокВход.ВидОперации 			= Перечисления.ВидыОперацийРасходСоСчета[Элемент.Имя];
			НовСтрокВход.Корреспонденция 		= ПланыСчетов.Управленческий.ПустаяСсылка();
			НовСтрокВход.КорреспонденцияРегл	= ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			НовСтрокВход.Статья					= Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.СтраницыОбновлений.Видимость = ВидимостьОбновлений;
	
	Элементы.ДатаНачала.АвтоОтметкаНезаполненного = ВидимостьОбновлений И НЕ ЗначениеЗаполнено(Объект.ДатаНачала);
	Элементы.ДатаНачала.ОтметкаНезаполненного = ВидимостьОбновлений И НЕ ЗначениеЗаполнено(Объект.ДатаНачала);
	
	Элементы.ДатаОкончания.АвтоОтметкаНезаполненного = ВидимостьОбновлений И НЕ ЗначениеЗаполнено(Объект.ДатаОкончания);
	Элементы.ДатаОкончания.ОтметкаНезаполненного = ВидимостьОбновлений И НЕ ЗначениеЗаполнено(Объект.ДатаОкончания); 
	
	//Элементы.Валюта.АвтоОтметкаНезаполненного = ВидимостьОбновлений И НЕ ЗначениеЗаполнено(Объект.Валюта);
	//Элементы.Валюта.ОтметкаНезаполненного = ВидимостьОбновлений И НЕ ЗначениеЗаполнено(Объект.Валюта); 
	
	//Элементы.Банк.АвтоОтметкаНезаполненного = ВидимостьОбновлений И НЕ ЗначениеЗаполнено(Объект.Банк);
	//Элементы.Банк.ОтметкаНезаполненного = ВидимостьОбновлений И НЕ ЗначениеЗаполнено(Объект.Банк); 
	
	Элементы.СчетОрганизации.АвтоОтметкаНезаполненного = ВидимостьОбновлений И НЕ ЗначениеЗаполнено(Объект.СчетОрганизации);
	Элементы.СчетОрганизации.ОтметкаНезаполненного = ВидимостьОбновлений И НЕ ЗначениеЗаполнено(Объект.СчетОрганизации); 
	
	Элементы.ПредИСлед.Видимость = НомерСтраницы > 0; 
	
	Элементы.ШапкаВыгрузка.Видимость = IDВыпискиПолучен; 
	Элементы.ПредИСледППВ.Видимость = НомерСтраницы > 0;
	
КонецПроцедуры

// Заполнение ТЧ --
&НаКлиенте
Процедура ЗаполнитьПоДокументам(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Проведен", Истина);
	ПараметрыОтбора.Вставить(СокрЛП("КодБанкаСчетаОтправителя"), "BAGAGE22");
	//ПараметрыОтбора.Вставить("УИД", "");
	//ПараметрыОтбора.Вставить("Выгружен", Ложь);
	//ПараметрыОтбора.Вставить("Оплачено", Истина);
	
	НовыйМассив = Новый Массив;
	НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыДокументовВИнтернетБанке.ПустаяСсылка"));
	НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПакетныхПеречисленийВИнтернетБанке.ПустаяСсылка"));
	НовыйМассив.Добавить(Неопределено);
	
	ФиксированныйМассив = Новый ФиксированныйМассив(НовыйМассив);
	ПараметрыОтбора.Вставить("СтатусВИнтернетБанке", ФиксированныйМассив);
	
	//ВыбранныеСтроки = ОткрытьФормуМодально("Документ.ПлатежноеПоручениеИсходящее.ФормаВыбора", Новый Структура("МножественныйВыбор, Отбор", Истина, ПараметрыОтбора), ЭтаФорма,);	
	
	//DO-26259
	СтруктураВыбора = Новый Структура("МножественныйВыбор, Отбор", Истина, ПараметрыОтбора);
	//ФормаППИ = ПолучитьФорму("Документ.ПлатежноеПоручениеИсходящее.ФормаВыбора", СтруктураВыбора);
	ФормаППИ = ПолучитьФорму("Документ.РасходСоСчета.ФормаВыбора", СтруктураВыбора);
	Если Не ФормаППИ = Неопределено Тогда 
		НоваяГруппа = ФормаППИ.Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		НоваяГруппа.Использование = Истина;
		
		НоваяГруппа11 = НоваяГруппа.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа11.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		НоваяГруппа11.Использование = Истина;
		
		НовыйЭлемент = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		//НовыйЭлемент.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		НовыйЭлемент.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Прочее");
		НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент.Использование = Истина;
		
		//НовыйЭлемент = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		////НовыйЭлемент.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		//НовыйЭлемент.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных");
		//НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		//НовыйЭлемент.Использование = Истина;
		//
		//НовыйЭлемент = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		////НовыйЭлемент.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		//НовыйЭлемент.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты");
		//НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		//НовыйЭлемент.Использование = Истина;
		
		//НовыйЭлемент11 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//НовыйЭлемент11.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Оплачено"); 
		//НовыйЭлемент11.ПравоеЗначение = Истина;
		//НовыйЭлемент11.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//НовыйЭлемент11.Использование = Истина;
		
		НоваяГруппа1 = НоваяГруппа.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		НоваяГруппа1.Использование = Истина;
		
		НовыйЭлемент1 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		//НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Прочее");
		НовыйЭлемент1.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент1.Использование = Истина;
		
		НовыйЭлемент2 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		//НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		НовыйЭлемент2.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.НаРасходы");
		НовыйЭлемент2.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент2.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		//НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		НовыйЭлемент3.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных");
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БанковскийСчет.Банк.ИспользуетсяДляИнтеграцииСБанком"); 
		//НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		НовыйЭлемент3.ПравоеЗначение = Истина;
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Выгружен"); 
		//НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		НовыйЭлемент3.ПравоеЗначение = Ложь;
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УИД"); 
		//НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		НовыйЭлемент3.ПравоеЗначение = "";
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		//НовыйЭлемент2 = НоваяГруппа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//НовыйЭлемент2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Оплачено"); 
		//НовыйЭлемент2.ПравоеЗначение = Ложь;
		//НовыйЭлемент2.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//НовыйЭлемент2.Использование = Истина;
		
		ВыбранныеСтроки = ФормаППИ.ОткрытьМодально();
		//_DO-26259
		
		Если Не ВыбранныеСтроки = Неопределено Тогда 
			
			Если Объект.ПлатежныеПоручения.Количество() > 0 Тогда
				ТекстВопроса = НСтр("ka='ცხრილური ნაწილი გასუფთავდება. გავაგრძელოთ?';ru='Табличная часть будет очищена. Продолжить?';en='Tabular section is cleared. Proceed?'");
				Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
				
				Если Ответ <> КодВозвратаДиалога.Да Тогда
					Возврат;
				Иначе 
					Объект.ПлатежныеПоручения.Очистить();
				КонецЕсли;
			КонецЕсли;	
			ЗаполнитьПоДокументамСервер(ВыбранныеСтроки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере  
Процедура ЗаполнитьПоДокументамСервер(ВыбранныеДокументы)  //Нужна проверка предыдущей процедуры И самой процедцры
	
	Для Каждого Док Из ВыбранныеДокументы Цикл 
		
		НоваяСтрока = Объект.ПлатежныеПоручения.Добавить();
		
		ЗаполнитьСтрокуТЧПлатежныеПаручения(Док, НоваяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуТЧПлатежныеПаручения(Док, НоваяСтрока);
	
	Если Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата 
		ИЛИ Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников ТОгда//Перечисления.ВидыОперацийППИсходящее.ВыплатаЗаработнойПлатыРаботнику Тогда 
		
		НоваяСтрока.ПлатежноеПоручениеИсходящее = Док.Ссылка;
		НоваяСтрока.Пометка                  = Ложь;
		НоваяСтрока.ComissionAccountNumber   =
		НоваяСтрока.AdditionalInformation    = Док.Комментарий;
		НоваяСтрока.PaymentDetail            = Док.НазначениеПлатежа;
		НоваяСтрока.ValueDate                = Док.Дата;
		НоваяСтрока.Amount                   = СтрЗаменить(СтрЗаменить(Строка(Док.СуммаДокумента),",", ""), " ", "");
		НоваяСтрока.Currency                 = Док.ВалютаДенежныхСредств;
		НоваяСтрока.DocumentNo               = Док.Номер;
		НоваяСтрока.SourceAccountNumber      = Док.БанковскийСчет.НомерСчета;
		НоваяСтрока.Nomination               = Док.НазначениеПлатежа;
		НоваяСтрока.DispatchType             = Док.ТипОтправки; //если не заполнено банк сам присвоит нужное значение
		НоваяСтрока.PayerInn                 = Док.Организация.ИНН;
		НоваяСтрока.PayerName                = Док.Организация;			
		
	ИначеЕсли Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику ТОгда//Перечисления.ВидыОперацийППИсходящее.ВыплатаЗаработнойПлатыРаботнику Тогда 
		
		
		НоваяСтрока.ПлатежноеПоручениеИсходящее = Док.Ссылка;
		НоваяСтрока.Пометка                  = Ложь;
		НоваяСтрока.Charges                  = Док.ТипКомиссии;
		НоваяСтрока.ComissionAccountNumber   = Док.БанковскийСчет.НомерСчета;//СчетОрганизации.НомерСчета;
		НоваяСтрока.BeneficiaryBankCode      = Док.СчетКонтрагента.Банк.СВИФТБИК;//?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет, Док.СчетКонтрагента.Банк.СВИФТБИК, Док.СчетКонтрагента.Банк.СВИФТБИК);    
		НоваяСтрока.BeneficiaryBankName      = Док.СчетКонтрагента.Банк.Наименование;//?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет, Док.СчетКонтрагента.Банк.Наименование, Док.СчетКонтрагента.Банк.Наименование); 
		НоваяСтрока.BeneficiaryInn           = Док.Подотчетник.ФизЛицо.ИНН;//?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги, "", ИНН);
		НоваяСтрока.BeneficiaryName          = Док.Подотчетник;//.Наименование;//?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет, Док.Организация, Док.Контрагент);
		НоваяСтрока.IntermediaryBankCode     = Док.ПромежуточныйБанк.Код;
		НоваяСтрока.IntermediaryBankName     = Док.ПромежуточныйБанк.Наименование;
		НоваяСтрока.AdditionalInformation    = Док.Комментарий;//?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги, "", Док.Комментарий);
		НоваяСтрока.PaymentDetail            = Док.НазначениеПлатежа;
		НоваяСтрока.ValueDate                = Док.Дата;
		НоваяСтрока.Amount                   = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Док.СуммаДокумента),",", ""), " ", ""),Символы.НПП, "");; 
		НоваяСтрока.Currency                 = Док.ВалютаДенежныхСредств;//ВалютаДокумента;  //поправить
		НоваяСтрока.DocumentNo               = Док.Номер;
		НоваяСтрока.SourceAccountNumber      = Док.БанковскийСчет.НомерСчета;//СчетОрганизации.НомерСчета;
		НоваяСтрока.BeneficiaryAccountNumber = ?(ЗначениеЗаполнено(Док.СчетКонтрагента), Док.СчетКонтрагента.НомерСчета, Док.Подотчетник.БанковскийСчетПоУмолчанию.НомерСчета);
		НоваяСтрока.Nomination               = Док.НазначениеПлатежа;
		НоваяСтрока.DispatchType             = Док.ТипОтправки;  //"BULK";
		НоваяСтрока.PayerInn                 = Док.Организация.ИНН;
		НоваяСтрока.PayerName                = Док.Организация;
		
	ИначеЕсли Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги Тогда 
		
		НоваяСтрока.ПлатежноеПоручениеИсходящее = Док.Ссылка;
		НоваяСтрока.Пометка                  = Ложь;
		НоваяСтрока.Charges                  = Док.ТипКомиссии;
		НоваяСтрока.ComissionAccountNumber   = Док.БанковскийСчет.НомерСчета;
		НоваяСтрока.BeneficiaryBankCode      = Док.КодКазначейства.БанковскийСчет.Банк.СВИФТБИК;//?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет, Док.СчетОрганизацииПолучатель.Банк.Код, Док.СчетКонтрагента.Банк.Код);    
		НоваяСтрока.BeneficiaryBankName      = Док.КодКазначейства.БанковскийСчет.Банк.СВИФТБИК;//?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет, Док.СчетОрганизацииПолучатель.Банк.Наименование, Док.СчетКонтрагента.Банк.Наименование); 
		
		ИНН = Док.КодКазначейства.ИНН;
		
		НоваяСтрока.BeneficiaryInn           = ИНН;//"";//?(Док.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога, "", ИНН);
		НоваяСтрока.BeneficiaryName          = Док.КодКазначейства;//?(Док.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПереводСоСчетаНаСчет, Док.Организация, Док.Контрагент);  
		НоваяСтрока.AdditionalInformation    = "";//?(Док.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога, "", Док.Комментарий);
		НоваяСтрока.PaymentDetail            = Док.НазначениеПлатежа;
		НоваяСтрока.ValueDate                = Док.Дата;//?????????
		НоваяСтрока.Amount                   = СтрЗаменить(СтрЗаменить(Строка(Док.СуммаДокумента),",", ""), " ", ""); 
		НоваяСтрока.Currency                 = Док.ВалютаДенежныхСредств;
		НоваяСтрока.DocumentNo               = Док.Номер;
		НоваяСтрока.SourceAccountNumber      = Док.БанковскийСчет.НомерСчета;
		НоваяСтрока.BeneficiaryAccountNumber = Док.КодКазначейства.БанковскийСчет.НомерСчета;//?(Док.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога, Док.КодКазначейства, ?(Док.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПереводСоСчетаНаСчет, Док.СчетОрганизацииПолучатель.НомерСчета, Док.СчетКонтрагента.НомерСчета));   
		НоваяСтрока.Nomination               = Док.НазначениеПлатежа;
		НоваяСтрока.DispatchType             = Док.ТипОтправки;  //"BULK";
		
	ИначеЕсли Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Поставщику
		ИЛИ Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Покупателю Тогда  
		
		НоваяСтрока.ПлатежноеПоручениеИсходящее = Док.Ссылка;
		НоваяСтрока.Пометка                  = Ложь;
		НоваяСтрока.Charges                  = Док.ТипКомиссии;
		НоваяСтрока.ComissionAccountNumber   = Док.БанковскийСчет.НомерСчета;//СчетОрганизации.НомерСчета;
		НоваяСтрока.BeneficiaryBankCode      = ?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет, Док.СчетКонтрагента.Банк.СВИФТБИК, Док.СчетКонтрагента.Банк.СВИФТБИК);    
		НоваяСтрока.BeneficiaryBankName      = ?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет, Док.СчетКонтрагента.Банк.Наименование, Док.СчетКонтрагента.Банк.Наименование); 
		НоваяСтрока.BeneficiaryInn           = Док.Контрагент.ИНН;
		НоваяСтрока.BeneficiaryName          = ?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет, Док.Организация, Док.Контрагент);
		НоваяСтрока.IntermediaryBankCode     = Док.ПромежуточныйБанк.Код;
		НоваяСтрока.IntermediaryBankName     = Док.ПромежуточныйБанк.Наименование;
		НоваяСтрока.AdditionalInformation    = ?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги, "", Док.Комментарий);
		НоваяСтрока.PaymentDetail            = Док.НазначениеПлатежа;
		НоваяСтрока.ValueDate                = Док.Дата;
		НоваяСтрока.Amount                   = СтрЗаменить(СтрЗаменить(Строка(Док.СуммаДокумента),Символы.НПП, ""), " ", ""); 
		НоваяСтрока.Currency                 = Док.ВалютаДенежныхСредств;//ВалютаДокумента;  //поправить
		НоваяСтрока.DocumentNo               = Док.Номер;
		НоваяСтрока.SourceAccountNumber      = Док.БанковскийСчет.НомерСчета;//СчетОрганизации.НомерСчета;
		НоваяСтрока.BeneficiaryAccountNumber = ?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги, Док.КодКазначейства, ?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет, Док.СчетКонтрагента.НомерСчета, Док.СчетКонтрагента.НомерСчета));
		НоваяСтрока.Nomination               = Док.НазначениеПлатежа;
		НоваяСтрока.DispatchType             = Док.ТипОтправки;  //"BULK";
		НоваяСтрока.PayerInn                 = "";//Док.Организация.ИНН;
		НоваяСтрока.PayerName                = "";//Док.Организация;
		
	Иначе 
		
		НоваяСтрока.ПлатежноеПоручениеИсходящее = Док.Ссылка;
		НоваяСтрока.Пометка                  = Ложь;
		НоваяСтрока.Charges                  = Док.ТипКомиссии;
		НоваяСтрока.ComissionAccountNumber   = Док.БанковскийСчет.НомерСчета;//СчетОрганизации.НомерСчета;
		НоваяСтрока.BeneficiaryBankCode      = ?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет, Док.СчетКонтрагента.Банк.СВИФТБИК, Док.СчетКонтрагента.Банк.СВИФТБИК);    
		НоваяСтрока.BeneficiaryBankName      = ?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет, Док.СчетКонтрагента.Банк.Наименование, Док.СчетКонтрагента.Банк.Наименование); 
		
		Если Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет Тогда
			ИНН = Док.Организация.ИНН;
		ИначеЕсли Не Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет 
			И Не Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику Тогда	
			ИНН = Док.Контрагент.ИНН;
		ИначеЕсли Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику Тогда
			ИНН = Док.Подотчетник.ФизЛицо.ИНН;//"";
		КонецЕсли;
		
		НоваяСтрока.BeneficiaryInn           = ?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги, "", ИНН);
		
		Если Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику Тогда
			НоваяСтрока.BeneficiaryName          = Док.Подотчетник;
		ИНаче
			НоваяСтрока.BeneficiaryName          = ?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет, Док.Организация, Док.Контрагент);
		КонецЕсли;
		НоваяСтрока.IntermediaryBankCode     = Док.ПромежуточныйБанк.Код;
		НоваяСтрока.IntermediaryBankName     = Док.ПромежуточныйБанк.Наименование;
		НоваяСтрока.AdditionalInformation    = ?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги, "", Док.Комментарий);
		НоваяСтрока.PaymentDetail            = Док.НазначениеПлатежа;
		НоваяСтрока.ValueDate                = Док.Дата;
		НоваяСтрока.Amount                   = СтрЗаменить(СтрЗаменить(Строка(Док.СуммаДокумента),",", ""), " ", ""); 
		НоваяСтрока.Currency                 = Док.ВалютаДенежныхСредств;//ВалютаДокумента;  //поправить
		НоваяСтрока.DocumentNo               = Док.Номер;
		НоваяСтрока.SourceAccountNumber      = Док.БанковскийСчет.НомерСчета;//СчетОрганизации.НомерСчета;
		НоваяСтрока.BeneficiaryAccountNumber = ?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги, Док.КодКазначейства, ?(Док.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет, Док.СчетКонтрагента.НомерСчета, Док.СчетКонтрагента.НомерСчета));
		НоваяСтрока.Nomination               = Док.НазначениеПлатежа;
		НоваяСтрока.DispatchType             = Док.ТипОтправки;  //"BULK";
		Если Док.ВидОперации <> Перечисления.ВидыОперацийРасходСоСчета.ПрочиеРасчеты 
			И Док.ВидОперации <> Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам 
			И Док.ВидОперации <> Перечисления.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику 
			И Док.ВидОперации <> Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику Тогда
			НоваяСтрока.PayerInn                 = Док.Организация.ИНН;
		КонецЕсли;
		НоваяСтрока.PayerName                = Док.Организация;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументамКонвертаций(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Проведен", Истина);
	ПараметрыОтбора.Вставить(СокрЛП("КодБанкаСчетаОтправителя"), "BAGAGE22");	
	ПараметрыОтбора.Вставить("УникальныйКлючВИнтернетБанке", "");
	ПараметрыОтбора.Вставить("СтатусВИнтернетБанке", ПредопределенноеЗначение("Перечисление.СтатусыДокументовВИнтернетБанке.ПустаяСсылка"));
	
	СтруктураВыбора = Новый Структура("МножественныйВыбор, Отбор", Истина, ПараметрыОтбора);
	
	ФормаКонвертации = ПолучитьФорму("Документ.Конвертация.ФормаВыбора", СтруктураВыбора); 
	Если Не ФормаКонвертации = Неопределено Тогда 
		
		НоваяГруппа = ФормаКонвертации.Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		НоваяГруппа.Использование = Истина;
		
		НоваяГруппа11 = НоваяГруппа.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа11.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		НоваяГруппа11.Использование = Истина;
		
		НовыйЭлемент1 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.Касса");
		НовыйЭлемент1.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент1.Использование = Истина;
		
		НовыйЭлемент2 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		НовыйЭлемент2.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.Подотчетник");
		НовыйЭлемент2.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент2.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отправитель.Банк.ИспользуетсяДляИнтеграцииСБанком"); 
		НовыйЭлемент3.ПравоеЗначение = Истина;
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Выгружен"); 
		НовыйЭлемент3.ПравоеЗначение = Ложь;
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УИДДокументаВБанке"); 
		НовыйЭлемент3.ПравоеЗначение = "";
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		ВыбранныеСтроки = ФормаКонвертации.ОткрытьМодально();

		Если Не ВыбранныеСтроки = Неопределено Тогда 
			
			Если Объект.КонвертацииДС.Количество() > 0 Тогда
				ТекстВопроса = НСтр("ka='ცხრილური ნაწილი გასუფთავდება. გავაგრძელოთ?';ru='Табличная часть будет очищена. Продолжить?';en='Tabular section is cleared. Proceed?'");
				Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
				
				Если Ответ <> КодВозвратаДиалога.Да Тогда
					Возврат;
				Иначе 
					Объект.КонвертацииДС.Очистить();
				КонецЕсли;
			КонецЕсли;
			
			ЗаполнитьПоДокументамКонвертацийСервер(ВыбранныеСтроки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументамКонвертацийСервер(ВыбранныеДокументы)
	
	Для Каждого Док Из ВыбранныеДокументы Цикл 
		
		НоваяСтрока = Объект.КонвертацииДС.Добавить();
		
		НоваяСтрока.КонвертацияБезналичныхДенежныхСредств = Док.Ссылка;
		НоваяСтрока.Пометка                               = Ложь;
		НоваяСтрока.UniqueId                              = 1;
		НоваяСтрока.DocumentNo                            = Док.Номер;
		Если ТипЗнч(Док.Отправитель) = Тип("СправочникСсылка.БанковскиеСчета") Тогда 
			НоваяСтрока.SourceAccountNumber                   = Док.Отправитель.НомерСчета;//СчетОтправитель.НомерСчета;
			НоваяСтрока.SourceCurrency                        = Док.Отправитель.ВалютаДенежныхСредств;//СчетОтправитель.ВалютаДенежныхСредств;
			ВалютаОтправителя = Док.Отправитель.ВалютаДенежныхСредств;
		ИначеЕсли ТипЗнч(Док.Отправитель) = Тип("СправочникСсылка.Сотрудники") Тогда
			НоваяСтрока.SourceAccountNumber                   = Док.Отправитель.БанковскийСчетПоУмолчанию.НомерСчета;//СчетОтправитель.НомерСчета;
			НоваяСтрока.SourceCurrency                        = Док.Отправитель.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств;//СчетОтправитель.ВалютаДенежныхСредств;
			ВалютаОтправителя = Док.Отправитель.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств;
		КонецЕсли;
		
		Если ТипЗнч(Док.Получатель) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			НоваяСтрока.DestinationAccountNumber              = Док.Получатель.НомерСчета;//СчетПолучатель.НомерСчета;
			НоваяСтрока.DestinationCurrency                   = Док.Получатель.ВалютаДенежныхСредств;//СчетПолучатель.ВалютаДенежныхСредств;
			ВалютаПолучателя = Док.Получатель.ВалютаДенежныхСредств;
		ИначеЕсли ТипЗнч(Док.Отправитель) = Тип("СправочникСсылка.Сотрудники") Тогда
			НоваяСтрока.DestinationAccountNumber              = Док.Получатель.БанковскийСчетПоУмолчанию.НомерСчета;//СчетПолучатель.НомерСчета;
			НоваяСтрока.DestinationCurrency                   = Док.Получатель.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств;//СчетПолучатель.ВалютаДенежныхСредств;
			ВалютаПолучателя = Док.Получатель.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств;
		КонецЕсли;
		
		НоваяСтрока.Amount                                = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Док.СуммаКонвертации),",", ""), " ", ""),Символы.НПП, "");//СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Док.СуммаСписанная),",", ""), " ", ""),Символы.НПП, "");
		
		НацВалюта = Константы.НациональнаяВалюта.Получить();
		//СтруктураКурсаОтправителя = МодульВалютногоУчета.ПолучитьКурсВалюты(Док.СчетОтправитель.ВалютаДенежныхСредств, Док.Дата);
		Если Док.Получатель.ВалютаДенежныхСредств = НацВалюта ИЛИ Док.Отправитель.ВалютаДенежныхСредств = НацВалюта Тогда 		
			////НоваяСтрока.Rate           = СтруктураКурсаОтправителя.Курс;
			НоваяСтрока.Rate           = Док.КоммерческийКурс;
		ИначеЕсли Док.Отправитель.ВалютаДенежныхСредств <> НацВалюта И Док.Получатель.ВалютаДенежныхСредств <> НацВалюта Тогда 
			НоваяСтрока.Rate           = Док.КроссКурс;
		КонецЕсли;
		//НоваяСтрока.Rate = ?(ВалютаОтправителя = Справочники.Валюты.НайтиПоКоду("643"), Док.КурсПолучатель, Док.КурсОтправитель);
		НоваяСтрока.AdditionalInfo = Док.Комментарий;
		
	КонецЦикла;
	
КонецПроцедуры
// Заполнение ТЧ

// Добавить в ТЧ --
&НаКлиенте
Процедура ДобавитьПоДокументамППИ(Команда)	
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Проведен", Истина);
	ПараметрыОтбора.Вставить(СокрЛП("КодБанкаСчетаОтправителя"), "BAGAGE22");
	
	НовыйМассив = Новый Массив;
	НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыДокументовВИнтернетБанке.ПустаяСсылка"));
	НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПакетныхПеречисленийВИнтернетБанке.ПустаяСсылка"));
	НовыйМассив.Добавить(Неопределено);
	
	ФиксированныйМассив = Новый ФиксированныйМассив(НовыйМассив);
	ПараметрыОтбора.Вставить("СтатусВИнтернетБанке", ФиксированныйМассив);	
	
	
	//DO-26259
	СтруктураВыбора = Новый Структура("МножественныйВыбор, Отбор", Истина, ПараметрыОтбора);
	//ФормаППИ = ПолучитьФорму("Документ.ПлатежноеПоручениеИсходящее.ФормаВыбора", СтруктураВыбора); 
	ФормаППИ = ПолучитьФорму("Документ.РасходСоСчета.ФормаВыбора", СтруктураВыбора); 
	Если Не ФормаППИ = Неопределено Тогда 
		НоваяГруппа = ФормаППИ.Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		НоваяГруппа.Использование = Истина;
		
		НоваяГруппа11 = НоваяГруппа.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа11.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		НоваяГруппа11.Использование = Истина;
		
		//НовыйЭлемент = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		////НовыйЭлемент.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		//НовыйЭлемент.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Прочее");
		//НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		//НовыйЭлемент.Использование = Истина;
		
		//НовыйЭлемент11 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//НовыйЭлемент11.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Оплачено"); 
		//НовыйЭлемент11.ПравоеЗначение = Истина;
		//НовыйЭлемент11.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//НовыйЭлемент11.Использование = Истина;
		
		НоваяГруппа1 = НоваяГруппа.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		НоваяГруппа1.Использование = Истина;
		
		//НовыйЭлемент1 = НоваяГруппа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//НовыйЭлемент1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		////НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		//НовыйЭлемент.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Прочее");
		//НовыйЭлемент1.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//НовыйЭлемент1.Использование = Истина;
		
		//НовыйЭлемент2 = НоваяГруппа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//НовыйЭлемент2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Оплачено"); 
		//НовыйЭлемент2.ПравоеЗначение = Ложь;
		//НовыйЭлемент2.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//НовыйЭлемент2.Использование = Истина;
		
		НовыйЭлемент1 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		//НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Прочее");
		НовыйЭлемент1.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент1.Использование = Истина;
		
		НовыйЭлемент2 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		//НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		НовыйЭлемент2.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.НаРасходы");
		НовыйЭлемент2.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент2.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		//НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		НовыйЭлемент3.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных");
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БанковскийСчет.Банк.ИспользуетсяДляИнтеграцииСБанком"); 
		//НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		НовыйЭлемент3.ПравоеЗначение = Истина;
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Выгружен"); 
		//НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		НовыйЭлемент3.ПравоеЗначение = Ложь;
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УИД"); 
		//НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИсходящее.ПрочийРасходДенежныхСредств");
		НовыйЭлемент3.ПравоеЗначение = "";
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		ВыбранныеСтроки = ФормаППИ.ОткрытьМодально();
		//_DO-26259

		Если Не ВыбранныеСтроки = Неопределено Тогда 
			ЗаполнитьПоДокументамСервер(ВыбранныеСтроки);		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоДокументамКонвертаций(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Проведен", Истина);
	ПараметрыОтбора.Вставить(СокрЛП("КодБанкаСчетаОтправителя"), "BAGAGE22");
	ПараметрыОтбора.Вставить("УникальныйКлючВИнтернетБанке", "");
	ПараметрыОтбора.Вставить("СтатусВИнтернетБанке", ПредопределенноеЗначение("Перечисление.СтатусыДокументовВИнтернетБанке.ПустаяСсылка"));
	
	
	СтруктураВыбора = Новый Структура("МножественныйВыбор, Отбор", Истина, ПараметрыОтбора);
	
	ФормаКонвертации = ПолучитьФорму("Документ.Конвертация.ФормаВыбора", СтруктураВыбора); 
	Если Не ФормаКонвертации = Неопределено Тогда 
		
		НоваяГруппа = ФормаКонвертации.Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		НоваяГруппа.Использование = Истина;
		
		НоваяГруппа11 = НоваяГруппа.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа11.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		НоваяГруппа11.Использование = Истина;
		
		НовыйЭлемент1 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.Касса");
		НовыйЭлемент1.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент1.Использование = Истина;
		
		НовыйЭлемент2 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		НовыйЭлемент2.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.Подотчетник");
		НовыйЭлемент2.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент2.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отправитель.Банк.ИспользуетсяДляИнтеграцииСБанком"); 
		НовыйЭлемент3.ПравоеЗначение = Истина;
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Выгружен"); 
		НовыйЭлемент3.ПравоеЗначение = Ложь;
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УИДДокументаВБанке"); 
		НовыйЭлемент3.ПравоеЗначение = "";
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		ВыбранныеСтроки = ФормаКонвертации.ОткрытьМодально();
		//_DO-26259

		Если Не ВыбранныеСтроки = Неопределено Тогда 
			ЗаполнитьПоДокументамКонвертацийСервер(ВыбранныеСтроки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
// Добавить в ТЧ

// Выгурзка --
&НаКлиенте
Процедура ВыгурзкаППИ(Команда)
	
	ОчиститьСообщения();
	ВыгурзкаППИСервер();	
	
КонецПроцедуры

&НаСервере
Процедура ВыгурзкаППИСервер()
	
	МенеджерОбработки = Обработки.ИнтеграцияСБанком;	
	КоличествоСозданныхДокуметов = 0;
	
	Для Каждого СтрокаТЧ ИЗ Объект.ПлатежныеПоручения Цикл		
		Если СтрокаТЧ.Пометка Тогда 
			
			Если СтрокаТЧ.ПлатежноеПоручениеИсходящее.Выгружено ИЛИ СтрокаТЧ.ПлатежноеПоручениеИсходящее.УникальныйКлючВИнтернетБанке <> "" Тогда 
				Сообщить(НСтр("ru = 'Документме " + СтрокаТЧ.ПлатежноеПоручениеИсходящее + ", рание был выгружен!'; ka = 'Документме " + СтрокаТЧ.ПлатежноеПоручениеИсходящее + ", рание был выгружен!"));
				Продолжить;
			КонецЕсли;
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("Документ"                , СтрокаТЧ.ПлатежноеПоручениеИсходящее);
			ПараметрыЗапроса.Вставить("Charges"                 , СтрокаТЧ.Charges);
			ПараметрыЗапроса.Вставить("ComissionAccountNumber"  , СтрокаТЧ.ComissionAccountNumber);
			ПараметрыЗапроса.Вставить("BeneficiaryBankCode"     , СтрокаТЧ.BeneficiaryBankCode);
			ПараметрыЗапроса.Вставить("BeneficiaryBankName"     , СтрокаТЧ.BeneficiaryBankName);
			ПараметрыЗапроса.Вставить("BeneficiaryInn"          , СтрокаТЧ.BeneficiaryInn);
			ПараметрыЗапроса.Вставить("BeneficiaryName"         , СтрокаТЧ.BeneficiaryName);
			ПараметрыЗапроса.Вставить("IntermediaryBankCode"    , СтрокаТЧ.IntermediaryBankCode);
			ПараметрыЗапроса.Вставить("IntermediaryBankName"    , СтрокаТЧ.IntermediaryBankName);
			ПараметрыЗапроса.Вставить("AdditionalInformation"   , СтрокаТЧ.AdditionalInformation);
			ПараметрыЗапроса.Вставить("PaymentDetail"           , СтрокаТЧ.PaymentDetail);
			ПараметрыЗапроса.Вставить("ValueDate"               , СтрокаТЧ.ValueDate);
			ПараметрыЗапроса.Вставить("UniqueId"                , СтрокаТЧ.UniqueId);
			ПараметрыЗапроса.Вставить("Amount"                  , СтрокаТЧ.Amount);
			ПараметрыЗапроса.Вставить("Currency"                , СтрокаТЧ.Currency);
			ПараметрыЗапроса.Вставить("DocumentNo"              , СтрокаТЧ.DocumentNo);
			ПараметрыЗапроса.Вставить("SourceAccountNumber"     , СтрокаТЧ.SourceAccountNumber);
			ПараметрыЗапроса.Вставить("BeneficiaryAccountNumber", СтрокаТЧ.BeneficiaryAccountNumber);
			ПараметрыЗапроса.Вставить("Nomination"              , СтрокаТЧ.Nomination);
			ПараметрыЗапроса.Вставить("DispatchType"            , СтрокаТЧ.DispatchType);
			ПараметрыЗапроса.Вставить("PayerInn"                , СтрокаТЧ.PayerInn);
			ПараметрыЗапроса.Вставить("PayerName"               , СтрокаТЧ.PayerName);
			
			//Перебить коды (нет предопределенной валюты), поменять пречисления аида операции
			//Если СтрокаТЧ.Currency = Справочники.Валюты.ლარი И Не СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВыплатаЗаработнойПлатыРаботнику И Не СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийППИсходящее.НачисленияИВыплатаЗаработнойПлатыРаботнику Тогда 
			//	ИмяМетода = "api/documents/domestic";
			//ИначеЕсли СтрокаТЧ.Currency = Справочники.Валюты.ლარი И (СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВыплатаЗаработнойПлатыРаботнику ИЛИ СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийППИсходящее.НачисленияИВыплатаЗаработнойПлатыРаботнику) Тогда 
			//	ИмяМетода = "api/documents/bulk/domestic";
			//ИначеЕсли СтрокаТЧ.Currency <> Справочники.Валюты.ლარი И СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВыплатаЗаработнойПлатыРаботнику Тогда 
			//	ИмяМетода = "api/documents/bulk/foreign";
			//Иначе 
			//	ИмяМетода = "api/documents/foreign";			
			//КонецЕсли;
			Если СтрокаТЧ.Currency = Справочники.Валюты.НайтиПоКоду("643") 
				И Не СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата 
				И Не СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников Тогда 
				//И Не СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.НачисленияИВыплатаЗаработнойПлатыРаботнику Тогда 
				ИмяМетода = "api/documents/domestic";
			ИначеЕсли СтрокаТЧ.Currency = Справочники.Валюты.НайтиПоКоду("643")
				И (СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата 
				ИЛИ СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников) ТОгда
				//ИЛИ СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийППИсходящее.НачисленияИВыплатаЗаработнойПлатыРаботнику) Тогда 
				ИмяМетода = "api/documents/bulk/domestic";
			ИначеЕсли СтрокаТЧ.Currency <> Справочники.Валюты.НайтиПоКоду("643") 
				И (СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата
				ИЛИ СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников) Тогда 
				ИмяМетода = "api/documents/bulk/foreign";
			Иначе 
				ИмяМетода = "api/documents/foreign";			
			КонецЕсли;
			
			//медленно работающая штука
			СтруктураОтвета = МенеджерОбработки.ВыполнитьМетодСервиса(ИмяМетода, ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
			//медленно работающая штука
			
			Если Не СтруктураОтвета = Неопределено Тогда 
				Если СтруктураОтвета.Результат = 0 //если создался док
					ИЛИ СтруктураОтвета.Результат = 444 Тогда  //если недостаточно средств (но док выгрузился)
					
					ДокументОбъект = СтрокаТЧ.ПлатежноеПоручениеИсходящее.ПолучитьОбъект(); 		
					ДокументОбъект.УникальныйКлючВИнтернетБанке = СтруктураОтвета.УникальныйКлюч;
					
					НаборЗаписейУИДДокумента = РегистрыСведений.УИДДокументовВИнтернетБанке.СоздатьНаборЗаписей();
					НаборЗаписейУИДДокумента.Отбор.ДокументСсылка.Установить(СтрокаТЧ.ПлатежноеПоручениеИсходящее);
					НаборЗаписейУИДДокумента.Отбор.Сотрудник.Установить(Справочники.Сотрудники.ПустаяСсылка());
					НаборЗаписейУИДДокумента.Отбор.Банк.Установить(Объект.Банк);
					
					НовыйУИД = НаборЗаписейУИДДокумента.Добавить();
					НовыйУИД.ДокументСсылка = СтрокаТЧ.ПлатежноеПоручениеИсходящее;
					НовыйУИД.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
					НовыйУИД.Банк = Объект.Банк;
					НовыйУИД.УИДДокументаВБанке = СтрЗаменить(СтрЗаменить(СтруктураОтвета.УникальныйКлюч,",",""),Символы.НПП,"");
					НовыйУИД.Выгружен = Истина;
					
					НаборЗаписейУИДДокумента.Записать();
					
					ДокументОбъект.Выгружено = Истина;
					
					////Илона// тут же заполнить статус первоначальный			
					//ПараметрыЗапроса = Новый Структура;
					//УникальныйКлюч = СтрЗаменить(СокрЛП(ДокументОбъект.УникальныйКлючВИнтернетБанке), "," , "");
					ПараметрыЗапроса.Вставить("Key", СтрЗаменить(СтрЗаменить(СтруктураОтвета.УникальныйКлюч,",",""),Символы.НПП,""));			
					//ДокументОбъект.Записать();
					//
					//Если СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата Тогда 
					//	Статус = МенеджерОбработки.ВыполнитьМетодСервиса("api/documents/bulk/status/", ПараметрыЗапроса, Режим, Токен);
					//Иначе 			
					//	Статус = МенеджерОбработки.ВыполнитьМетодСервиса("api/documents/status/", ПараметрыЗапроса, Режим, Токен);
					//КонецЕсли;
					//
					//// тут надо сделать проверки , если статус не получен или еще что-то надо проверять
					//Если Не Статус = Неопределено Тогда 						
					//	Если СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата Тогда 
					//		//ДокументОбъект.СтатусВИнтернетБанке = Перечисления.СтатусыПакетныхПеречисленийВИнтернетБанке[Статус];
					//		//Перечисления.СтатусыДокументовВИнтернетБанке.ПолучитьДанныеВыбора(Получить(
					//		Попытка
					//			ЗначениеЗтатуса = Перечисления.СтатусыДокументовВИнтернетБанке[Статус[0].Статус];
					//		Исключение
					//			ЗначениеЗтатуса = Перечисления.СтатусыПакетныхПеречисленийВИнтернетБанке[Статус[0].Статус];
					//		КонецПопытки;
					//		
					//		ВнестиНовыйСтатусДокумента(ТекущаяДата(), 
					//				СтрокаТЧ.ПлатежноеПоручениеИсходящее, 
					//				ЗначениеЗтатуса,//СтатусыПакетныхПеречисленийВИнтернетБанке[Статус[0].Статус], 
					//				"");
					//	Иначе 
					//		//ДокументОбъект.СтатусВИнтернетБанке = Перечисления.СтатусыДокументовВИнтернетБанке[Статус];
					//		ВнестиНовыйСтатусДокумента(ТекущаяДата(), 
					//				СтрокаТЧ.ПлатежноеПоручениеИсходящее, 
					//				Перечисления.СтатусыДокументовВИнтернетБанке[Статус], 
					//				"");
					//	КонецЕсли;
					//КонецЕсли;	
					
					Статус = Перечисления.СтатусыДокументовВИнтернетБанке.T;
					
					ВнестиНовыйСтатусДокумента(ТекущаяДата(), 
									СтрокаТЧ.ПлатежноеПоручениеИсходящее, 
									Статус, 
									"");
					
					ДокументОбъект.Записать();
					КоличествоСозданныхДокуметов = КоличествоСозданныхДокуметов + 1;
					
				КонецЕсли;
				
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоСозданныхДокуметов > 0 Тогда 
		Сообщение = Новый СообщениеПользователю;
		//Если СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВыплатаЗаработнойПлатыРаботнику Тогда 
		//	Сообщение.Текст = НСтр("ru = 'Выгружен/о " + КоличествоСозданныхДокуметов + " пакет/ов.'; ka = 'ატვირთულია " + КоличествоСозданныхДокуметов + " პაკეტი.'");	
		//Иначе 
		//	Сообщение.Текст = НСтр("ru = 'Выгружен/о " + КоличествоСозданныхДокуметов + " документ/ов.'; ka = 'ატვირთულია " + КоличествоСозданныхДокуметов + " დოკუმენტი.'");
		//КонецЕсли;
		Если СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата Тогда 
			Сообщение.Текст = НСтр("ru = 'Выгружен/о " + КоличествоСозданныхДокуметов + " пакет/ов.'; ka = 'ატვირთულია " + КоличествоСозданныхДокуметов + " პაკეტი.'");	
		Иначе 
			Сообщение.Текст = НСтр("ru = 'Выгружен/о " + КоличествоСозданныхДокуметов + " документ/ов.'; ka = 'ატვირთულია " + КоличествоСозданныхДокуметов + " დოკუმენტი.'");
		КонецЕсли;
		Сообщение.Сообщить();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгурзкаКонвертаций(Команда)
	
	ОчиститьСообщения();

	ВыгурзкаКонвертацийСервер();
	
КонецПроцедуры

&НаСервере
Процедура ВыгурзкаКонвертацийСервер()
	
	МенеджерОбработки = Обработки.ИнтеграцияСБанком;	
	КоличествоСозданныхДокуметов = 0;
	
	Для Каждого СтрокаТЧ ИЗ Объект.КонвертацииДС Цикл
		
		Если СтрокаТЧ.Пометка Тогда 	
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("UniqueId"                 , СтрокаТЧ.UniqueId);
			ПараметрыЗапроса.Вставить("DocumentNo"               , СтрокаТЧ.DocumentNo);
			ПараметрыЗапроса.Вставить("SourceAccountNumber"      , СтрокаТЧ.SourceAccountNumber);
			ПараметрыЗапроса.Вставить("SourceCurrency"           , СтрокаТЧ.SourceCurrency);
			ПараметрыЗапроса.Вставить("DestinationAccountNumber" , СтрокаТЧ.DestinationAccountNumber);
			ПараметрыЗапроса.Вставить("DestinationCurrency"      , СтрокаТЧ.DestinationCurrency);
			ПараметрыЗапроса.Вставить("Amount"                   , СтрокаТЧ.Amount);
			ПараметрыЗапроса.Вставить("Rate"                     , СтрокаТЧ.Rate);
			ПараметрыЗапроса.Вставить("AdditionalInfo"           , СтрокаТЧ.AdditionalInfo);
			
			ИмяМетода = "api/documents/conversion";
			
			//медленно работающая штука
			СтруктураОтвета = МенеджерОбработки.ВыполнитьМетодСервиса(ИмяМетода, ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
			//медленно работающая штука
			
			Если Не СтруктураОтвета = Неопределено Тогда
				Если СтруктураОтвета.Результат = 0 Тогда  //если создался док
					
					ДокументОбъект = СтрокаТЧ.КонвертацияБезналичныхДенежныхСредств.ПолучитьОбъект(); 		
					ДокументОбъект.УникальныйКлючВИнтернетБанке = СтруктураОтвета.УникальныйКлюч;
					
					
					НаборЗаписейУИДДокумента = РегистрыСведений.УИДДокументовВИнтернетБанке.СоздатьНаборЗаписей();
					НаборЗаписейУИДДокумента.Отбор.ДокументСсылка.Установить(СтрокаТЧ.КонвертацияБезналичныхДенежныхСредств);
					НаборЗаписейУИДДокумента.Отбор.Сотрудник.Установить(Справочники.Сотрудники.ПустаяСсылка());
					НаборЗаписейУИДДокумента.Отбор.Банк.Установить(Объект.Банк);
					
					НовыйУИД = НаборЗаписейУИДДокумента.Добавить();
					НовыйУИД.ДокументСсылка = СтрокаТЧ.КонвертацияБезналичныхДенежныхСредств;
					НовыйУИД.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
					НовыйУИД.Банк = Объект.Банк;
					НовыйУИД.УИДДокументаВБанке = СтрЗаменить(СтрЗаменить(СтруктураОтвета.УникальныйКлюч,",",""),Символы.НПП,"");
					НовыйУИД.Выгружен = Истина;
					
					НаборЗаписейУИДДокумента.Записать();
					
					////тут же заполнить статус
					//ПараметрыЗапроса = Новый Структура;
					//УникальныйКлюч = СтрЗаменить(СокрЛП(СтрокаТЧ.КонвертацияБезналичныхДенежныхСредств.УникальныйКлючВИнтернетБанке), "," , "");
					//ПараметрыЗапроса.Вставить("Key", УникальныйКлюч);
					//ДокументОбъект.Записать();
					
					//Статус = МенеджерОбработки.ВыполнитьМетодСервиса("api/documents/status/", ПараметрыЗапроса, Режим, Токен);
					
					//// тут надо сделать проверки, если статус не получен или еще что-то надо проверять
					//Если Не Статус = Неопределено Тогда 
					//	ДокументОбъект = СтрокаТЧ.КонвертацияБезналичныхДенежныхСредств.ПолучитьОбъект(); 		
					//	ДокументОбъект.СтатусВИнтернетБанке = Перечисления.СтатусыДокументовВИнтернетБанке[Статус];
					//			
					//	Сообщение = Новый СообщениеПользователю;
					//	Сообщение.Текст = НСтр("ka='დოკუმენტის სტატუსები განახლებულია.';ru='Статусы документов обновлены.';en='Document statuses are updated.'");	
					//	Сообщение.Сообщить();	
					//КонецЕсли;
					
					ДокументОбъект.Записать();
					КоличествоСозданныхДокуметов = КоличествоСозданныхДокуметов + 1;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = НСтр("ru = 'Создано " + КоличествоСозданныхДокуметов + " документов.'; ka = 'შექმნილია " + КоличествоСозданныхДокуметов + " დოკუმენტი.'");	
	Сообщение.Сообщить();	
	
КонецПроцедуры
// Выгурзка

// обновление статусов--
&НаКлиенте
Процедура ОтобразитьОбновление(Команда)
	
	//Если ВидимостьОбновлений Тогда 
	//	ВидимостьОбновлений = Ложь;
	//	Элементы.ФормаОтобразитьОбновление.Пометка = Ложь;
	//Иначе
	//	ВидимостьОбновлений = Истина;
	//	Элементы.ФормаОтобразитьОбновление.Пометка = Истина;
	//КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыДокументовППИ(Команда)
	
	ОчиститьСообщения();
	ОбновитьСтатусыДокументовППИСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыДокументовППИСервер()
	
	МенеджерОбработки = Обработки.ИнтеграцияСБанком;	
	КоличествоОбновленныхСтатусов = 0;
	
	Для Каждого СтрокаТЧ ИЗ Объект.ПлатежныеПоручения Цикл		
		Если СтрокаТЧ.Пометка Тогда 		
			ПараметрыЗапроса = Новый Структура;
			УникальныйКлюч = ПолучитьУИДДокументаПоСсылке(СтрокаТЧ.ПлатежноеПоручениеИсходящее);//СтрЗаменить(СтрЗаменить(СокрЛП(СтрокаТЧ.ПлатежноеПоручениеИсходящее.УникальныйКлючВИнтернетБанке), "," , ""), Символы.НПП,"");
			ПараметрыЗапроса.Вставить("Key", УникальныйКлюч);
			
			//Если СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВыплатаЗаработнойПлатыРаботнику Тогда
			Если СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата Тогда
				ТаблицаСтатусов = МенеджерОбработки.ВыполнитьМетодСервиса("api/documents/bulk/status/", ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
			Иначе 			
				Статус = МенеджерОбработки.ВыполнитьМетодСервиса("api/documents/status/", ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
			КонецЕсли;
			
			// тут надо сделать проверки , если статус не получен или еще что-то надо проверять
			
			//ДокументОбъект = СтрокаТЧ.ПлатежноеПоручениеИсходящее.ПолучитьОбъект();
			ДокументСсылка = СтрокаТЧ.ПлатежноеПоручениеИсходящее;
			
			Если Не ТаблицаСтатусов = Неопределено Тогда 
				
				//Для Каждого СтрТЧ Из ДокументОбъект.ВыплатаЗаработнойПлаты Цикл
				Для Каждого СтрТЧ Из ДокументСсылка.ПлатежныеВедомости Цикл
					//ВедомостьОбъект = СтрТЧ.Ведомость.ПолучитьОбъект();
					ВедомостьСсылка = СтрТЧ.Ведомость;
					//Для Каждого СтрокаТЧ Из ВедомостьОбъект.СуммаКВыплате Цикл 
					Для Каждого СтрокаТЧ Из ВедомостьСсылка.Сотрудники Цикл
						Для Каждого Строка ИЗ ТаблицаСтатусов Цикл
							
							Отбор = Новый Структура("УникальныйИД", СтрокаТЧ.УникальныйИдентификаторВИнтернетБанке);
							НайденныеСтроки = ТаблицаСтатусов.НайтиСтроки(Отбор);
							Если НайденныеСтроки.Количество() = 1 И Не НайденныеСтроки[0].Статус = "" Тогда
								//СтрокаТЧ.СтатусВИнтернетБанке = Перечисления.СтатусыДокументовВИнтернетБанке[НайденныеСтроки[0].Статус];	
								
								ВнестиНовыйСтатусДокумента(ТекущаяДата(), 
								ВедомостьСсылка, 
								Перечисления.СтатусыДокументовВИнтернетБанке[НайденныеСтроки[0].Статус],
								УникальныйКлюч,
								СтрокаТЧ.Сотрудник);
								
								КоличествоОбновленныхСтатусов = КоличествоОбновленныхСтатусов + 1;
							ИначеЕсли Строка.УникальныйИД = "" И ЗначениеЗаполнено(Строка.Статус) И Не Строка.Статус = "" Тогда 
								//ДокументОбъект.СтатусВИнтернетБанке = Перечисления.СтатусыДокументовВИнтернетБанке[Строка.Статус];
								
								ВнестиНовыйСтатусДокумента(ТекущаяДата(), 
								ДокументСсылка, 
								Перечисления.СтатусыДокументовВИнтернетБанке[Строка.Статус],
								УникальныйКлюч,
								СтрокаТЧ.Сотрудник);
								
								КоличествоОбновленныхСтатусов = КоличествоОбновленныхСтатусов + 1; 
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
				
				//ДокументСсылка;//.Записать();
				
				//ВедомостьОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДокументЗарплатыКВыплате", Истина);
				//ВедомостьОбъект.Записать();
			КонецЕсли;
			
			Если Не Статус = Неопределено Тогда 
				//ДокументОбъект.СтатусВИнтернетБанке = Перечисления.СтатусыДокументовВИнтернетБанке[Статус];
				
				ВнестиНовыйСтатусДокумента(ТекущаяДата(), 
					ДокументСсылка,//Объект.Ссылка, 
					Перечисления.СтатусыДокументовВИнтернетБанке[Статус],
					УникальныйКлюч);
								
				КоличествоОбновленныхСтатусов = КоличествоОбновленныхСтатусов + 1;				
			КонецЕсли;				
		КонецЕсли;		
	КонецЦикла;
	
	Если КоличествоОбновленныхСтатусов > 0 Тогда 
		Сообщение = Новый СообщениеПользователю;
		//Если СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВыплатаЗаработнойПлатыРаботнику Тогда 
		Если СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата Тогда 		
		Сообщение.Текст = НСтр("ru = 'Статусы "+КоличествоОбновленныхСтатусов+" пакетов обновлены.'; ka = 'განახლებულია "+КоличествоОбновленныхСтатусов+" პაკეტების სტატუსები.'");	
		Иначе 
			Сообщение.Текст = НСтр("ru = 'Статусы "+КоличествоОбновленныхСтатусов+" документов обновлены.'; ka = 'განახლებულია "+КоличествоОбновленныхСтатусов+" დოკუმენტის სტატუსები.'");
		КонецЕсли;
		Сообщение.Сообщить();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыДокументовКонвертаций(Команда)
	
	ОчиститьСообщения();
	ОбновитьСтатусыДокументовКонвертацийСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыДокументовКонвертацийСервер()
	
	МенеджерОбработки = Обработки.ИнтеграцияСБанком;	
	КоличествоОбновленныхСтатусов = 0;
	
	Для Каждого СтрокаТЧ ИЗ Объект.КонвертацииДС Цикл
		
		Если СтрокаТЧ.Пометка Тогда
			ПараметрыЗапроса = Новый Структура;
			УникальныйКлюч = ПолучитьУИДДокументаПоСсылке(СтрокаТЧ.КонвертацияБезналичныхДенежныхСредств);//СтрЗаменить(СокрЛП(СтрокаТЧ.КонвертацияБезналичныхДенежныхСредств.УникальныйКлючВИнтернетБанке), "," , "");
			ПараметрыЗапроса.Вставить("Key", УникальныйКлюч);
			
			Статус = МенеджерОбработки.ВыполнитьМетодСервиса("api/documents/status/", ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
			
			// тут надо сделать проверки, если статус не получен или еще что-то надо проверять
			Если Не Статус = Неопределено Тогда 
				//ДокументОбъект = СтрокаТЧ.КонвертацияБезналичныхДенежныхСредств.ПолучитьОбъект(); 		
				//ДокументОбъект.СтатусВИнтернетБанке = Перечисления.СтатусыДокументовВИнтернетБанке[Статус];
				//
				//ДокументОбъект.Записать();	
				
				ВнестиНовыйСтатусДокумента(ТекущаяДата(), 
					СтрокаТЧ.КонвертацияБезналичныхДенежныхСредств, 
					Перечисления.СтатусыДокументовВИнтернетБанке[Статус],
					УникальныйКлюч);
					
				КоличествоОбновленныхСтатусов = КоличествоОбновленныхСтатусов + 1;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ka='დოკუმენტის სტატუსები განახლებულია.';ru='Статусы документов обновлены.';en='Document statuses are updated.'");	
				Сообщение.Сообщить();	
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыДокументовГлобально(Команда)		
	
	ОчиститьСообщения();
	ОбновитьСтатусыДокументовГлобальноСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыДокументовГлобальноСервер()
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончания) И ЗначениеЗаполнено(Объект.ДатаНачала) Тогда 
		Если Не Объект.ДатаНачала <= Объект.ДатаОкончания Тогда 
			ТекстСообщения = НСтр("ka='დაწყების თარიღი არ უნდა იყოს დასრულების თარიღზე მეტი ან ტოლი!';ru='Дата начала не может быть больше или равна дате окончания!';en='Start date can not be greater than or equal to the end date!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Объект,, Истина);
			Возврат;
		КонецЕсли;
	Иначе 
		ТекстСообщения = НСтр("ka='დაწყების თარიღი და დასრულების თარიღი აუცილებლად შესავსები ველებია!';ru='Дата начала и дата окончания обязательны для заполнения!';en='Start date and end date are required!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Объект,, Истина);	
		Возврат;
	КонецЕсли;	
	
	МенеджерОбработки = Обработки.ИнтеграцияСБанком;	
	КоличествоОбновленныхСтатусов = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыДокументовВИнтернетБанке.ДокументСсылка КАК Документ,
	               |	УИДДокументовВИнтернетБанке.УИДДокументаВБанке КАК УникальныйКлючВИнтернетБанке,
	               |	СтатусыДокументовВИнтернетБанке.ДокументСсылка.Дата КАК Дата,
	               |	ВЫБОР
	               |		КОГДА СтатусыДокументовВИнтернетБанке.ДокументСсылка ССЫЛКА Документ.Конвертация
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Конвертация,
	               |	СтатусыДокументовВИнтернетБанке.СтатусДокументаВИнтернетБанке КАК ТекущийСтатусДокумента
	               |ПОМЕСТИТЬ ДокументыДляОбновления
	               |ИЗ
	               |	РегистрСведений.СтатусыДокументовВИнтернетБанке.СрезПоследних(
	               |			&ТекДата,
	               |			ДокументСсылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |				И (ДокументСсылка ССЫЛКА Документ.Конвертация
	               |					ИЛИ ДокументСсылка ССЫЛКА Документ.РасходСоСчета)
	               |				И СтатусДокументаВИнтернетБанке <> ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовВИНтернетБанке.ПустаяСсылка)
	               |				И СтатусДокументаВИнтернетБанке <> ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовВИНтернетБанке.ПрисутствуетТолькоВТекущейБазе)) КАК СтатусыДокументовВИнтернетБанке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
	               |		ПО СтатусыДокументовВИнтернетБанке.ДокументСсылка = УИДДокументовВИнтернетБанке.ДокументСсылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДокументыДляОбновления.Документ,
	               |	ДокументыДляОбновления.УникальныйКлючВИнтернетБанке,
	               |	ДокументыДляОбновления.Дата,
	               |	ДокументыДляОбновления.Документ.ВидОперации КАК ВидОперации,
	               |	ДокументыДляОбновления.Конвертация,
	               |	ДокументыДляОбновления.ТекущийСтатусДокумента
	               |ИЗ
	               |	ДокументыДляОбновления КАК ДокументыДляОбновления
	               |ГДЕ
	               |	ДокументыДляОбновления.Дата >= &ДатаНачала
	               |	И ДокументыДляОбновления.Дата <= &ДатаОкончания
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДокументыДляОбновления.УникальныйКлючВИнтернетБанке,
	               |	ДокументыДляОбновления.Дата,
	               |	ДокументыДляОбновления.Конвертация,
	               |	ДокументыДляОбновления.Документ,
	               |	ДокументыДляОбновления.Документ.ВидОперации,
	               |	ДокументыДляОбновления.ТекущийСтатусДокумента";
	
	Граница = Новый Граница(КонецДня(Объект.ДатаОкончания), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("ДатаНачала"   , Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Граница.Значение); //Объект.ДатаОкончания
	Запрос.УстановитьПараметр("ТекДата"		 , ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		
		ПараметрыЗапроса = Новый Структура;
		УникальныйКлюч = СтрЗаменить(СокрЛП(Выборка.УникальныйКлючВИнтернетБанке), "," , "");
		ПараметрыЗапроса.Вставить("Key", УникальныйКлюч);
		
		//Если Выборка.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВыплатаЗаработнойПлатыРаботнику И НЕ Выборка.Конвертация Тогда 
		Если (Выборка.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата 
			ИЛИ Выборка.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников)
			И НЕ Выборка.Конвертация Тогда 
			ТаблицаСтатусов = МенеджерОбработки.ВыполнитьМетодСервиса("api/documents/bulk/status/", ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
		Иначе 			
			Статус = МенеджерОбработки.ВыполнитьМетодСервиса("api/documents/status/", ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
		КонецЕсли;
		
		// тут надо сделать проверки , если статус не получен или еще что-то надо проверять
		
		//ДокументОбъект = Выборка.Документ.ПолучитьОбъект();
		
		Если Не ТаблицаСтатусов = Неопределено Тогда 
			
			//Для Каждого СтрТЧ Из ДокументОбъект.ВыплатаЗаработнойПлаты Цикл      
			Для Каждого СтрТЧ Из Выборка.Документ.ВыплатаЗаработнойПлаты Цикл
				
				//ВедомостьОбъект = СтрТЧ.Ведомость.ПолучитьОбъект();
				///??? пока не знаю что с этим делать
				//Для Каждого СтрокаТЧ Из ВедомостьОбъект.СуммаКВыплате Цикл 
				Для Каждого СтрокаТЧ Из СтрТЧ.Ведомость.Сотрудники Цикл 
					Для Каждого Строка ИЗ ТаблицаСтатусов Цикл
						
						Отбор = Новый Структура("УникальныйИД", СтрокаТЧ.УникальныйИдентификаторВИнтернетБанке);
						НайденныеСтроки = ТаблицаСтатусов.НайтиСтроки(Отбор);
						Если НайденныеСтроки.Количество() = 1 И Не НайденныеСтроки[0].Статус = "" Тогда
							//СтрокаТЧ.СтатусВИнтернетБанке = Перечисления.СтатусыДокументовВИнтернетБанке[НайденныеСтроки[0].Статус];	
							
							ВнестиНовыйСтатусДокумента(ТекущаяДата(), 
								СтрТЧ.Ведомость, 
								Перечисления.СтатусыДокументовВИнтернетБанке[НайденныеСтроки[0].Статус],
								УникальныйКлюч, СтрокаТЧ.Сотрудник);
							
							КоличествоОбновленныхСтатусов = КоличествоОбновленныхСтатусов + 1;
						ИначеЕсли Строка.УникальныйИД = "" И ЗначениеЗаполнено(Строка.Статус) И Не Строка.Статус = "" Тогда 
							//ДокументОбъект.СтатусВИнтернетБанке = Перечисления.СтатусыДокументовВИнтернетБанке[Строка.Статус];
							
							ВнестиНовыйСтатусДокумента(ТекущаяДата(), 
								СтрТЧ.Ведомость, 
								Перечисления.СтатусыДокументовВИнтернетБанке[Строка.Статус],
								УникальныйКлюч, СтрокаТЧ.Сотрудник);
							
							КоличествоОбновленныхСтатусов = КоличествоОбновленныхСтатусов + 1; 
						КонецЕсли;
					КонецЦикла;
					
				КонецЦикла;
			КонецЦикла;
			
			//ДокументОбъект.Записать();
			
			//ВедомостьОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДокументЗарплатыКВыплате", Истина);
			//ВедомостьОбъект.Записать();
		КонецЕсли;
		
		Если Не Статус = Неопределено Тогда 
			//ДокументОбъект.СтатусВИнтернетБанке = Перечисления.СтатусыДокументовВИнтернетБанке[Статус];
			
			//ДокументОбъект.Записать();	
			
			ПолученыйСтатус = Перечисления.СтатусыДокументовВИнтернетБанке[Статус];
			
			Если ПолученыйСтатус <> Выборка.ТекущийСтатусДокумента Тогда 
				ВнестиНовыйСтатусДокумента(ТекущаяДата(), 
						Выборка.Документ, 
						Перечисления.СтатусыДокументовВИнтернетБанке[Статус],
						УникальныйКлюч);
			КонецЕсли;
			КоличествоОбновленныхСтатусов = КоличествоОбновленныхСтатусов + 1;				
		КонецЕсли;	
		
		ТаблицаСтатусов = Неопределено;
		Статус = Неопределено;
		
		
		/////
		
	КонецЦикла;
	
	Если КоличествоОбновленныхСтатусов > 0 Тогда 
		Сообщение = Новый СообщениеПользователю;
		//Если СтрокаТЧ.ПлатежноеПоручениеИсходящее.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВыплатаЗаработнойПлатыРаботнику Тогда 
		//	Сообщение.Текст = НСтр("ru = 'Статусы "+КоличествоОбновленныхСтатусов+" пакетов обновлены.'; ka = 'განახლებულია "+КоличествоОбновленныхСтатусов+" პაკეტების სტატუსები.'");	
		//Иначе 
		Сообщение.Текст = НСтр("ru = 'Статусы "+КоличествоОбновленныхСтатусов+" документов обновлены.'; ka = 'განახლებულია "+КоличествоОбновленныхСтатусов+" დოკუმენტის სტატუსები.'");
		//КонецЕсли;
		Сообщение.Сообщить();	
	КонецЕсли;
	
КонецПроцедуры
// обновление статусов

// Обновление коммерческих курсов --
&НаКлиенте
Процедура ОбновитьКоммерческиеКурсы(Команда)
	
	ОчиститьСообщения();
	ОбновитьКоммерческиеКурсыСервер();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруВалют();
	
	СтруктураВозврата = Новый Структура("Коммерческий, Кросс");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	НЕ Валюты.ПометкаУдаления
		|	И Валюты.Ссылка <> &НациональнаяВалюта";
	
	Запрос.УстановитьПараметр("НациональнаяВалюта", НациональнаяВалюта);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивКомерческихВалют = Новый Массив;
	СоответствиеКроссВалют = Новый Соответствие;
	Для Каждого Строк Из РезультатЗапроса Цикл 
		МассивКомерческихВалют.Добавить(Строк.Ссылка);
		СоответствиеКроссВалют.Вставить(Строк.Ссылка);
	КонецЦикла;
	
	Для Каждого ЭлеметСоответствия Из СоответствиеКроссВалют Цикл 
		//ЭлеметСоответствия.Значение = МассивКомерческихВалют;
		СоответствиеКроссВалют[ЭлеметСоответствия.Ключ] = МассивКомерческихВалют;
	КонецЦикла;
	
	СтруктураВозврата.Коммерческий = МассивКомерческихВалют;
	СтруктураВозврата.Кросс = СоответствиеКроссВалют;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Процедура ОбновитьКоммерческиеКурсыСервер()	
	
	Если Не ЗначениеЗаполнено(Объект.Банк) Тогда //Или Не ЗначениеЗаполнено(Объект.Валюта) Тогда 		
		ТекстСообщения = НСтр("ka='ბანკი და ვალუტა არის აუცილებლად შესავსები ველები!';ru='Банк и валюта обязательны для заполнения!';en='Bank and currency are required!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Объект,, Истина);	
		Возврат;
	КонецЕсли;	
	
	СтруктураВалют = ПолучитьСтруктуруВалют();
	
	МенеджерОбработки = Обработки.ИнтеграцияСБанком;	
	//КоличествоОбновленныхСтатусов = 0;
	
	Для Каждого ЭлементаМассива Из СтруктураВалют.Коммерческий Цикл 
		ПараметрыЗапроса = Новый Структура;
		
		ПараметрыЗапроса.Вставить("currency", ЭлементаМассива);
		
		СтруктураКурсов = МенеджерОбработки.ВыполнитьМетодСервиса("api/rates/commercial/", ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
		
		Если Не СтруктураКурсов = Неопределено Тогда 
			//
			//НаборЗаписей = РегистрыСведений.КоммерческиеКурсыВалют.СоздатьНаборЗаписей();
			//
			//НаборЗаписей.Отбор.Банк.Установить(Объект.Банк);
			//НаборЗаписей.Отбор.Валюта.Установить(Объект.Валюта);
			//НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
			//
			//Запись = НаборЗаписей.Добавить();
			//Запись.Период      = ТекущаяДата(); 
			//Запись.Банк        = Объект.Банк;
			//Запись.Валюта      = Объект.Валюта;
			//Запись.КурсПродажи = СтруктураКурсов.КурсПродажи;
			//Запись.КурсПокупки = СтруктураКурсов.КурсПокупки;
			//Запись.Кратность   = 1;
			
			
			НаборЗаписей = РегистрыСведений.КурсыВалютБанков.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.ВидКурса.Установить(Перечисления.ВидыКурсовВалютБанка.Коммерческий);
			НаборЗаписей.Отбор.Банк.Установить(Объект.Банк);
			НаборЗаписей.Отбор.Валюта.Установить(ЭлементаМассива);
			НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
			
			Запись = НаборЗаписей.Добавить();
			Запись.Период      = ТекущаяДата(); 
			Запись.ВидКурса    = Перечисления.ВидыКурсовВалютБанка.Коммерческий;
			Запись.Банк        = Объект.Банк;
			Запись.Валюта      = ЭлементаМассива;
			//Запись.КурсПродажи = СтруктураКурсов.КурсПродажи;
			//Запись.КурсПокупки = СтруктураКурсов.КурсПокупки;
			// Меняем продажу банка на нашу покупку
			Запись.КурсПокупки = СтруктураКурсов.КурсПродажи;
			Запись.КратностьПокупки   = 1;
			Запись.КурсПродажи = СтруктураКурсов.КурсПокупки;
			Запись.КратностьПродажи   = 1;
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
			
			Сообщение = Новый СообщениеПользователю;
			//Сообщение.Текст = НСтр("ka='კომერციული კურსები განახლებულია.';ru='Комерческие курсы обновлены.';en='Commercial courses updated.'");
			Сообщение.Текст = НСтр("ru = 'Курс "+ЭлементаМассива+" обновлены.'; ka = 'კურსები "+ЭлементаМассива+" განახლებულია.'");	
			Сообщение.Сообщить();
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
// обновление коммерческих курсов


// Обновление кросс курсов --
&НаКлиенте
Процедура ОбновитьКроссКурсы(Команда)
	ОбновитьКроссКурсыСервер();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКроссКурсыСервер()	
	
	Если Не ЗначениеЗаполнено(Объект.Банк) Тогда //Или Не ЗначениеЗаполнено(Объект.ВалютаПокупки) Или Не ЗначениеЗаполнено(Объект.ВалютаПродажи) Тогда 		
		ТекстСообщения = НСтр("ka='ბანკი და ვალუტები არის აუცილებლად შესავსები ველები!';ru='Банк и валюты обязательны для заполнения!';en='Bank and currency are required!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Объект,, Истина);	
		Возврат;
	КонецЕсли;	
	
	МенеджерОбработки = Обработки.ИнтеграцияСБанком;	
	//КоличествоОбновленныхСтатусов = 0;
	
	СтруктураВалют = ПолучитьСтруктуруВалют();
	
	Для Каждого ЭлементСоответствия Из СтруктураВалют.Кросс Цикл 
		ДЛя Каждого ЭлементМассива Из ЭлементСоответствия.Значение Цикл
			Если ЭлементСоответствия.Ключ = ЭлементМассива Тогда Продолжить; КонецЕсли;
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("buyCurrency", ЭлементСоответствия.Ключ);//Объект.ВалютаПокупки);
	ПараметрыЗапроса.Вставить("sellCurrency", ЭлементМассива);//Объект.ВалютаПродажи);
	
	
	СтруктураКурсов = МенеджерОбработки.ВыполнитьМетодСервиса("api/rates/commercial//", ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
	
	Если Не СтруктураКурсов = Неопределено Тогда 
		
		//НаборЗаписей = РегистрыСведений.КроссКурсыВалют.СоздатьНаборЗаписей();
		//
		//НаборЗаписей.Отбор.Банк.Установить(Объект.БанкКроссКурсов);
		//НаборЗаписей.Отбор.ВалютаПродажи.Установить(Объект.ВалютаПродажи);
		//НаборЗаписей.Отбор.ВалютаПокупки.Установить(Объект.ВалютаПокупки);
		//НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
		//
		//Запись = НаборЗаписей.Добавить();
		//Запись.Период        = ТекущаяДата(); 
		//Запись.Банк          = Объект.БанкКроссКурсов;
		//Запись.ВалютаПродажи = Объект.ВалютаПродажи;
		//Запись.ВалютаПокупки = Объект.ВалютаПокупки;
		//
		//Запись.КроссКурс = СтруктураКурсов.КроссКурс;
		//Запись.Кратность   = 1;
		//
		//НаборЗаписей.ОбменДанными.Загрузка = Истина;
		//НаборЗаписей.Записать();
		//
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = НСтр("ka='კროს კურსები განახლებულია.';ru='Кросс курсы обновлены.';en='Cross training updated.'");	    Объект.ВалютаПокупки   Объект.ВалютаПродажи
		//Сообщение.Сообщить();
		
		НаборЗаписей = РегистрыСведений.КурсыВалютБанков.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.ВидКурса.Установить(Перечисления.ВидыКурсовВалютБанка.Кросс);
		НаборЗаписей.Отбор.Банк.Установить(Объект.Банк);
		НаборЗаписей.Отбор.ВалютаПокупки.Установить(ЭлементСоответствия.Ключ);
		НаборЗаписей.Отбор.ВалютаПродажи.Установить(ЭлементМассива);
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период      = ТекущаяДата(); 
		Запись.Банк		   = Объект.Банк;
		Запись.ВидКурса    = Перечисления.ВидыКурсовВалютБанка.Кросс;
		Запись.ВалютаПродажи = ЭлементМассива;
		Запись.ВалютаПокупки = ЭлементСоответствия.Ключ;
		Запись.КурсКросс = СтруктураКурсов.КроссКурс;
		Запись.КратностьКросс   = 1;

		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		
		Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = НСтр("ka='კომერციული კურსები განახლებულია.';ru='Комерческие курсы обновлены.';en='Commercial courses updated.'");
		Сообщение.Текст = НСтр("ru = 'Курс "+ЭлементСоответствия.Ключ+" - "+ЭлементМассива+" обновлен.'; ka = 'კურსები "+ЭлементСоответствия.Ключ+" - "+ЭлементМассива+"  განახლებულია.'");	
		Сообщение.Сообщить();
	КонецЕсли;
КонецЦикла;
КонецЦикла;
	
КонецПроцедуры
// обновление кросс курсов

// Остаток на счету --
&НаКлиенте
Процедура ПолучитьОстатокНаСчету(Команда)
	ОчиститьСообщения();
	ПолучитьОстатокНаСчетуСервер();
КонецПроцедуры

&НаСервере
Процедура ПолучитьОстатокНаСчетуСервер()
	
	Если Не ЗначениеЗаполнено(Объект.СчетОрганизации) Тогда 		
		ТекстСообщения = НСтр("ka='ანგარიში არის აუცილებლად შესავსები ველი!';ru='Счет обязателен для заполнения!';en='Account mandatory to fill in!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Объект,, Истина);	
		Возврат;
	КонецЕсли;	
	
	МенеджерОбработки = Обработки.ИнтеграцияСБанком;	
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("currency", Объект.СчетОрганизации.ВалютаДенежныхСредств);
	ПараметрыЗапроса.Вставить("accountNumber", Лев(Объект.СчетОрганизации.НомерСчета, 22));
	
	СтруктураОстатков = МенеджерОбработки.ВыполнитьМетодСервиса("api/accounts/", ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
	//СтруктураОстатков = МенеджерОбработки.ВыполнитьМетодСервиса("api/statement/", ПараметрыЗапроса, Режим, Токен);
	
	Если Не СтруктураОстатков = Неопределено Тогда 
		Объект.ДоступныйОстатокНаСчете = СтруктураОстатков.ДоступныйОстатокНаСчете;
		Объект.ТекущийОстатокНаСчете   = СтруктураОстатков.ТекущийОстатокНаСчете;		
	КонецЕсли;
	
КонецПроцедуры
// Остаток на счету

// Отборы для доков --
&НаКлиенте
Процедура ПлатежныеПорученияПлатежноеПоручениеИсходящееНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Проведен", Истина);
	ПараметрыОтбора.Вставить(СокрЛП("КодБанкаСчетаОтправителя"), "BAGAGE22");
	ПараметрыОтбора.Вставить("УникальныйКлючВИнтернетБанке", "");
	
	НовыйМассив = Новый Массив;
	НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыДокументовВИнтернетБанке.ПустаяСсылка"));
	НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПакетныхПеречисленийВИнтернетБанке.ПустаяСсылка"));
	НовыйМассив.Добавить(Неопределено);
	
	ФиксированныйМассив = Новый ФиксированныйМассив(НовыйМассив);
	ПараметрыОтбора.Вставить("СтатусВИнтернетБанке", ФиксированныйМассив);
	
	СтруктураВыбора = Новый Структура("Отбор", ПараметрыОтбора);
	
	ТекСтрока = Элементы.ПлатежныеПоручения.ТекущиеДанные;
	Если Не ТекСтрока = Неопределено И ЗначениеЗаполнено(ТекСтрока.ПлатежноеПоручениеИсходящее) Тогда 
		СтруктураВыбора.Вставить("ТекущаяСтрока", ТекСтрока.ПлатежноеПоручениеИсходящее);
	КонецЕсли;	

	ФормаППИ = ПолучитьФорму("Документ.РасходСоСчета.ФормаВыбора", СтруктураВыбора, Элемент); 
	Если Не ФормаППИ = Неопределено Тогда 
		НоваяГруппа = ФормаППИ.Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		НоваяГруппа.Использование = Истина;
		
		НоваяГруппа1 = НоваяГруппа.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		НоваяГруппа1.Использование = Истина;
		
		НовыйЭлемент2 = НоваяГруппа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Оплачено"); 
		НовыйЭлемент2.ПравоеЗначение = Ложь;
		НовыйЭлемент2.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент2.Использование = Истина;
		
		НовыйЭлемент1 = НоваяГруппа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Прочее");
		НовыйЭлемент1.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент1.Использование = Истина;
		
		НовыйЭлемент2 = НоваяГруппа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		НовыйЭлемент2.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.НаРасходы");
		НовыйЭлемент2.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент2.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		НовыйЭлемент3.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных");
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БанковскийСчет.Банк.ИспользуетсяДляИнтеграцииСБанком"); 
		НовыйЭлемент3.ПравоеЗначение = Истина;
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Выгружен"); 
		НовыйЭлемент3.ПравоеЗначение = Ложь;
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УИД"); 
		НовыйЭлемент3.ПравоеЗначение = "";
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		ФормаППИ.Открыть();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КонвертацииДСДокументКонвертацииДСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Проведен", Истина);
	ПараметрыОтбора.Вставить(СокрЛП("КодБанкаСчетаОтправителя"), "BAGAGE22");
	ПараметрыОтбора.Вставить("УникальныйКлючВИнтернетБанке", "");
	ПараметрыОтбора.Вставить("СтатусВИнтернетБанке", ПредопределенноеЗначение("Перечисление.СтатусыДокументовВИнтернетБанке.ПустаяСсылка"));
	
	
	СтруктураВыбора = Новый Структура("МножественныйВыбор, Отбор", Истина, ПараметрыОтбора);
	
	ТекСтрока = Элементы.КонвертацииДС.ТекущиеДанные;
	Если Не ТекСтрока = Неопределено И ЗначениеЗаполнено(ТекСтрока.КонвертацияБезналичныхДенежныхСредств) Тогда 
		СтруктураВыбора.Вставить("ТекущаяСтрока", ТекСтрока.КонвертацияБезналичныхДенежныхСредств);
	КонецЕсли;	

	ФормаКонвертации = ПолучитьФорму("Документ.Конвертация.Форма.ФормаВыбора", СтруктураВыбора, Элемент); 
	Если Не ФормаКонвертации = Неопределено Тогда 
		
		НоваяГруппа = ФормаКонвертации.Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		НоваяГруппа.Использование = Истина;
		
		НоваяГруппа11 = НоваяГруппа.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа11.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		НоваяГруппа11.Использование = Истина;
		
		НовыйЭлемент1 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		НовыйЭлемент1.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.Касса");
		НовыйЭлемент1.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент1.Использование = Истина;
		
		НовыйЭлемент2 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации"); 
		НовыйЭлемент2.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.Подотчетник");
		НовыйЭлемент2.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлемент2.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отправитель.Банк.ИспользуетсяДляИнтеграцииСБанком"); 
		НовыйЭлемент3.ПравоеЗначение = Истина;
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Выгружен"); 
		НовыйЭлемент3.ПравоеЗначение = Ложь;
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		НовыйЭлемент3 = НоваяГруппа11.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УИДДокументаВБанке"); 
		НовыйЭлемент3.ПравоеЗначение = "";
		НовыйЭлемент3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент3.Использование = Истина;
		
		ФормаКонвертации.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОтбор()
	
	ПараметрыОтбораКонв = Новый Структура;
	ПараметрыОтбораКонв.Вставить("Проведен", Истина);
	ПараметрыОтбораКонв.Вставить(СокрЛП("КодБанкаСчетаОтправителя"), "BAGAGE22");
	ПараметрыОтбораКонв.Вставить("УникальныйКлючВИнтернетБанке", "");
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Проведен", Истина);
	ПараметрыОтбора.Вставить(СокрЛП("КодБанкаСчетаОтправителя"), "BAGAGE22");
	ПараметрыОтбора.Вставить("УникальныйКлючВИнтернетБанке", "");
	
	НовыйМассив = Новый Массив;
	НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыДокументовВИнтернетБанке.ПустаяСсылка"));
	НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПакетныхПеречисленийВИнтернетБанке.ПустаяСсылка"));
	НовыйМассив.Добавить(Неопределено);
	
	ФиксированныйМассив = Новый ФиксированныйМассив(НовыйМассив);
	ПараметрыОтбора.Вставить("СтатусВИнтернетБанке", ФиксированныйМассив);
	
	Элементы.КонвертацииДСДокументКонвертацииДС.ПараметрыВыбора = ОбработатьПараметрВыбора(ПараметрыОтбораКонв);			
	Элементы.ПлатежныеПорученияПлатежноеПоручениеИсходящее.ПараметрыВыбора = ОбработатьПараметрВыбора(ПараметрыОтбора);	
	
КонецПроцедуры
// Отбор для доков

Функция ОбработатьПараметрВыбора(Параметры, НачальныеДанные = Неопределено) Экспорт
	
	НовыйМассив = Новый Массив();
	Если НЕ Параметры = Неопределено Тогда 
		Для Каждого Парам Из Параметры Цикл
			НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор." + Парам.Ключ, Парам.Значение));	
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ НачальныеДанные = Неопределено Тогда
		Для Каждого СтрокаДанных Из НачальныеДанные Цикл
			НовыйМассив.Добавить(Новый ПараметрВыбора(СтрокаДанных.Имя, СтрокаДанных.Значение));			
		КонецЦикла;
	КонецЕсли;	
	
	Возврат Новый ФиксированныйМассив(НовыйМассив); 	
	
КонецФункции


// ППИ при изменении --
&НаКлиенте
Процедура ПлатежныеПорученияПлатежноеПоручениеИсходящееПриИзменении(Элемент)
	
	//СтрокаТЧ = Элементы.ПлатежныеПоручения.ТекущиеДанные;
	//
	//ЗаполнитьСтрокуТЧ(СтрокаТЧ.ПлатежноеПоручениеИсходящее);
	//		
	////ПлатежныеПорученияППИПриИзмененииСервер(СтрокаТЧ, СтрокаТЧ.ПлатежноеПоручениеИсходящее);			
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДокОбъект(Документ)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "";
	
	//СтруктураПолейТЧ = Новый Структура;
	//СтруктураПолейТЧ.Вставить("Charges", "");
	//СтруктураПолейТЧ.Вставить("ComissionAccountNumber", "");
	//СтруктураПолейТЧ.Вставить("BeneficiaryBankCode", "");
	//СтруктураПолейТЧ.Вставить("BeneficiaryBankName", "");
	//СтруктураПолейТЧ.Вставить("BeneficiaryInn", "");
	//СтруктураПолейТЧ.Вставить("BeneficiaryName", "");
	//СтруктураПолейТЧ.Вставить("IntermediaryBankCode", "");
	//СтруктураПолейТЧ.Вставить("IntermediaryBankName", "");
	//СтруктураПолейТЧ.Вставить("AdditionalInformation", "");
	//СтруктураПолейТЧ.Вставить("PaymentDetail", "");
	//СтруктураПолейТЧ.Вставить("ValueDate", "");
	//СтруктураПолейТЧ.Вставить("UniqueId", "");
	//СтруктураПолейТЧ.Вставить("Amount", "");
	//СтруктураПолейТЧ.Вставить("Currency", "");	
	//СтруктураПолейТЧ.Вставить("DocumentNo", "");
	//СтруктураПолейТЧ.Вставить("SourceAccountNumber", "");
	//СтруктураПолейТЧ.Вставить("BeneficiaryAccountNumber", "");
	//СтруктураПолейТЧ.Вставить("Nomination", "");
	//СтруктураПолейТЧ.Вставить("DispatchType", "");
	//СтруктураПолейТЧ.Вставить("PayerInn", "");
	//СтруктураПолейТЧ.Вставить("PayerName", "");
	//СтруктураПолейТЧ.Вставить("Пометка", "");
	//
	//
	////СтрокаТЧ.Charges                   = ტიპი «OUR» – აირჩევა იმ შემთხვევაში, როდესაც გზავნილის საკომისიოს იხდის გამგზავნი.
	//                                     //ტიპი «SHA» – აირჩევა იმ შემთხვევაში, როდესაც გამგზავნის მხარეს არსებულ ხარჯებს იხდის გაგზავნი,ხარჯები გზავნილის მიმღების მხარეზე უნდა გადაიხადოს მიმღებმა.	
	////СтрокаТЧ.ComissionAccountNumber    =
	//СтрокаТЧ.BeneficiaryBankCode       = Док.СчетКонтрагента.Банк.Код;  //Док.СчетОрганизацииПолучатель.Банк.Код; 
	//СтрокаТЧ.BeneficiaryBankName       = Док.СчетКонтрагента.Банк.Наименование;  ///Док.СчетОрганизацииПолучатель.Банк.Наименование;
	//СтрокаТЧ.BeneficiaryInn            = Док.Контрагент.ИНН;   //Док.Организация.КодОрганизации; // 
	//СтрокаТЧ.BeneficiaryName           = Док.Контрагент;  //Док.Организация;
	////СтрокаТЧ.IntermediaryBankCode      =
	////СтрокаТЧ.IntermediaryBankName      = 
	//СтрокаТЧ.AdditionalInformation     = Док.Комментарий;
	//СтрокаТЧ.PaymentDetail             = Док.НазначениеПлатежа;
	//СтрокаТЧ.ValueDate                 = Док.Дата;
	//СтрокаТЧ.UniqueId                  = 1;
	//СтрокаТЧ.Amount                    = Док.СуммаДокумента;
	//СтрокаТЧ.Currency                  = Док.ВалютаДокумента;
	//СтрокаТЧ.DocumentNo                = Док.Номер;
	//СтрокаТЧ.SourceAccountNumber       = Док.СчетОрганизации.НомерСчета;
	//СтрокаТЧ.BeneficiaryAccountNumber  = Док.СчетКонтрагента.НомерСчета;   //Док.СчетОрганизацииПолучатель.НомерСчета;
	//СтрокаТЧ.Nomination                = Док.НазначениеПлатежа;
	////СтрокаТЧ.DispatchType              = если не заполнено банк сам присвоит нужное значение.
	//СтрокаТЧ.PayerInn                  = Док.Организация.ИНН;
	//СтрокаТЧ.PayerName                 = Док.Организация;
	//СтрокаТЧ.Пометка                   = Ложь;
	
КонецПроцедуры
// ППИ при изменении


// Конвертация при изменении --
&НаКлиенте
Процедура КонвертацииДСДокументКонвертацииДСПриИзменении(Элемент)
	
	//СтрокаТЧ = Элементы.КонвертацииДС.ТекущиеДанные;		
	//КонвертацииДСДокументКонвертацииДСПриИзмененииСервер(СтрокаТЧ, СтрокаТЧ.КонвертацияБезналичныхДенежныхСредств);
	
КонецПроцедуры

&НаСервере
Процедура КонвертацииДСДокументКонвертацииДСПриИзмененииСервер(СтрокаТЧ, ДокКонвертации)
	
	Док = ДокКонвертации.ПолучитьОбъект();
	
	СтрокаТЧ.Пометка                               = Ложь;
	СтрокаТЧ.UniqueId                              = 1;
	СтрокаТЧ.DocumentNo                            = Док.Номер;
	//СтрокаТЧ.SourceAccountNumber                   = Док.СчетОтправитель.НомерСчета;
	//СтрокаТЧ.SourceCurrency                        = Док.СчетОтправитель.ВалютаДенежныхСредств;
	//СтрокаТЧ.DestinationAccountNumber              = Док.СчетПолучатель.НомерСчета;
	//СтрокаТЧ.DestinationCurrency                   = Док.СчетПолучатель.ВалютаДенежныхСредств;
	//СтрокаТЧ.Amount                                = Док.СуммаСписанная;
	СтрокаТЧ.SourceAccountNumber                   = Док.Отправитель.НомерСчета;
	СтрокаТЧ.SourceCurrency                        = Док.Отправитель.ВалютаДенежныхСредств;
	СтрокаТЧ.DestinationAccountNumber              = Док.Отправитель.НомерСчета;
	СтрокаТЧ.DestinationCurrency                   = Док.Отправитель.ВалютаДенежныхСредств;
	СтрокаТЧ.Amount                                = Док.СуммаКонвертации;
	
	//СтруктураКурсаОтправителя = ПолучитьКурсВалюты(Док.СчетОтправитель.ВалютаДенежныхСредств, Док.Дата);
	СтруктураКурсаОтправителя = ПолучитьКурсВалюты(Док.Отправитель.ВалютаДенежныхСредств, Док.Дата);
	
	СтрокаТЧ.Rate           = СтруктураКурсаОтправителя.Курс;
	СтрокаТЧ.AdditionalInfo = Док.Комментарий;
	
КонецПроцедуры
// Конвертация при изменении

Функция ПолучитьКурсВалюты(Валюта, ДатаКурса) Экспорт
	
	Структура = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(?(ДатаКурса = Дата('00010101'),ТекущаяДата(),ДатаКурса), Новый Структура("Валюта", Валюта));
	Возврат Структура;
	
КонецФункции

// Флажки --
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Модифицированность = Истина;
	Для Каждого СтрокаТЧ Из Объект.ПлатежныеПоручения Цикл
		СтрокаТЧ.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Модифицированность = Истина;	
	Для Каждого СтрокаТЧ Из Объект.ПлатежныеПоручения Цикл
		СтрокаТЧ.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиКонвертаций(Команда)
	
	Модифицированность = Истина;	
	Для Каждого СтрокаТЧ Из Объект.КонвертацииДС Цикл
		СтрокаТЧ.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиКонвертации(Команда)
	
	Модифицированность = Истина;
	Для Каждого СтрокаТЧ Из Объект.КонвертацииДС Цикл
		СтрокаТЧ.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры
// Флажки

&НаКлиенте
Процедура СчетОрганизацииПриИзменении(Элемент)
	
	Объект.ДоступныйОстатокНаСчете = Неопределено;
	Объект.ТекущийОстатокНаСчете = Неопределено;
	
КонецПроцедуры

// выписка
&НаКлиенте
Процедура ПолучитьВыписку(Команда)
	
	ОчиститьСообщения();
	ПолучитьIDВыписки();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьIDВыписки()
	
	Если Не ЗначениеЗаполнено(Объект.СчетВыписки) Тогда 		
		ТекстСообщения = НСтр("ka='ანგარიში არის აუცილებლად შესავსები ველი!';ru='Счет обязателен для заполнения!';en='Account mandatory to fill in!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Объект,, Истина);	
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияВыписки) И ЗначениеЗаполнено(Объект.ДатаНачалаВыписки) Тогда 
		Если Не Объект.ДатаНачалаВыписки <= Объект.ДатаОкончанияВыписки Тогда 
			ТекстСообщения = НСтр("ka='დაწყების თარიღი არ უნდა იყოს დასრულების თარიღზე მეტი ან ტოლი!';ru='Дата начала не может быть больше или ровна дате окончания!';en='Start date can not be greater than or equal to the end date!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Объект,, Истина);
			Возврат;
		КонецЕсли;
	Иначе 
		ТекстСообщения = НСтр("ka='დაწყების თარიღი და დასრულების თარიღი აუცილებლად შესავსები ველებია!';ru='Дата начала и дата окончания обязательны для заполнения!';en='Start date and end date are required!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Объект,, Истина);	
		Возврат;
	КонецЕсли;	
	
	МенеджерОбработки = Обработки.ИнтеграцияСБанком;	
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("currency", Объект.СчетВыписки.ВалютаДенежныхСредств);
	ПараметрыЗапроса.Вставить("accountNumber", Лев(Объект.СчетВыписки.НомерСчета, 22));
	ПараметрыЗапроса.Вставить("startDate", ДельтаНСФ.ДатаВСтроку(Объект.ДатаНачалаВыписки));
	ПараметрыЗапроса.Вставить("endDate", ДельтаНСФ.ДатаВСтроку(Объект.ДатаОкончанияВыписки));
	
	IDИКоличествоСтрок = МенеджерОбработки.ВыполнитьМетодСервиса("api/statement/", ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
	
	Если Не IDИКоличествоСтрок = Неопределено Тогда 
		IDВыписки = СтрЗаменить(IDИКоличествоСтрок.ID, ",", "");
		КоличествоСтрок  = СтрЗаменить(IDИКоличествоСтрок.Count, ",", "");
		IDВыпискиПолучен = Истина;
		НомерСтраницы = ?(Цел(КоличествоСтрок / 1000) < КоличествоСтрок / 1000, Цел(КоличествоСтрок / 1000) + 1, Цел(КоличествоСтрок / 1000));
		ПоследняяСтраница = НомерСтраницы;
		УстановитьВидимость();
	КонецЕсли;
	
	Если НомерСтраницы <> 0 И НомерСтраницы <> Неопределено ИЛИ IDВыпискиПолучен И IDИКоличествоСтрок <> Неопределено Тогда 
		ЗаполнитьТЧВыписки();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Следующая(Команда)
	
	НомерСтраницыПред = НомерСтраницы;
	НомерСтраницы = ?(НомерСтраницы + 1 > ПоследняяСтраница, НомерСтраницы, НомерСтраницы + 1);
	Если НомерСтраницыПред <> НомерСтраницы Тогда 
		ЗаполнитьТЧВыписки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Предыдущая(Команда)
	
	НомерСтраницыПред = НомерСтраницы;
	НомерСтраницы = ?(НомерСтраницы = 1 ИЛИ НомерСтраницы = 0, НомерСтраницы, НомерСтраницы - 1); 
	// если не измениласть страница нет смысла запусткат всю байду
	Если НомерСтраницыПред <> НомерСтраницы Тогда 
		ЗаполнитьТЧВыписки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧВыписки()	
	
	МенеджерОбработки = Обработки.ИнтеграцияСБанком;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("currency", Объект.СчетВыписки.ВалютаДенежныхСредств);
	ПараметрыЗапроса.Вставить("accountNumber", Лев(Объект.СчетВыписки.НомерСчета, 22));
	ПараметрыЗапроса.Вставить("id", IDВыписки);
	ПараметрыЗапроса.Вставить("page", НомерСтраницы);
	
	МассивЗаписей = МенеджерОбработки.ВыполнитьМетодСервиса("api/statement////", ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
	
	СуммарныеДанные = МенеджерОбработки.ВыполнитьМетодСервиса("api/statement/summary/", ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
	ШапкаВыписки = СуммарныеДанные["GlobalSummary"];
	ДанныепоДням = СуммарныеДанные["DailySummaries"]; 
	
	Если ШапкаВыписки.Количество() > 0 Тогда 
		
		Объект.OutAmountBase   = ШапкаВыписки["OutAmountBase"];
		Объект.OutAmount       = ШапкаВыписки["OutAmount"];				
		Объект.InAmountBase    = ШапкаВыписки["InAmountBase"];			
		Объект.InAmount        = ШапкаВыписки["InAmount"];
		Объект.CreditSum       = ШапкаВыписки["CreditSum"];			
		Объект.DebitSum        = ШапкаВыписки["DebitSum"];
		Объект.StartDate       = ШапкаВыписки["StartDate"];
		Объект.InRate          = ШапкаВыписки["InRate"];
		Объект.AccountNumber   = ШапкаВыписки["AccountNumber"];
		Объект.PeriodEndDate   = ШапкаВыписки["PeriodEndDate"];
		Объект.Currency        = ШапкаВыписки["Currency"];
		Объект.EndDate         = ШапкаВыписки["EndDate"];
		Объект.PeriodStartDate = ШапкаВыписки["PeriodStartDate"];
		Объект.OutRate         = ШапкаВыписки["OutRate"];
		
	КонецЕсли;	
	
	
	Если ДанныепоДням.Количество() > 0 Тогда
		
		ТаблицаОстатковПоДням = Новый ТаблицаЗначений;  
		ТаблицаОстатковПоДням.Колонки.Добавить("BalanceBase", Новый ОписаниеТипов("Строка"));
		ТаблицаОстатковПоДням.Колонки.Добавить("DebitSum", Новый ОписаниеТипов("Строка"));
		ТаблицаОстатковПоДням.Колонки.Добавить("Balance", Новый ОписаниеТипов("Строка"));
		ТаблицаОстатковПоДням.Колонки.Добавить("Date", Новый ОписаниеТипов("Дата"));
		ТаблицаОстатковПоДням.Колонки.Добавить("Rate", Новый ОписаниеТипов("Строка"));
		ТаблицаОстатковПоДням.Колонки.Добавить("CreditSum", Новый ОписаниеТипов("Строка"));
		ТаблицаОстатковПоДням.Колонки.Добавить("EntryCount", Новый ОписаниеТипов("Строка"));
		
		Для Каждого Элемент ИЗ ДанныепоДням Цикл			
			НоваяСтрока = ТаблицаОстатковПоДням.Добавить();
			
			НоваяСтрока.BalanceBase = Элемент.Получить("BalanceBase");
			НоваяСтрока.DebitSum    = Элемент.Получить("DebitSum");
			НоваяСтрока.Balance     = Элемент.Получить("Balance");
			НоваяСтрока.Date        = ДельтаНСФ.ПереводВДату(Элемент.Получить("Date"));
			НоваяСтрока.Rate        = Элемент.Получить("Rate");
			НоваяСтрока.CreditSum   = Элемент.Получить("CreditSum");
			НоваяСтрока.EntryCount  = Элемент.Получить("EntryCount");			
		КонецЦикла;
	КонецЕсли;		
	
	Объект.Выписка.Очистить();
	
	Если Не МассивЗаписей = Неопределено Тогда 
		Если МассивЗаписей.Количество() > 0 Тогда 
			
			Для Каждого ЭлементМассива ИЗ МассивЗаписей Цикл
				
				НоваяСтрокаТЧ = Объект.Выписка.Добавить();
				
				НоваяСтрокаТЧ.BeneficiaryName                    = ЭлементМассива.Получить("BeneficiaryDetails").Получить("Name");
				НоваяСтрокаТЧ.BeneficiaryBankName                = ЭлементМассива.Получить("BeneficiaryDetails").Получить("BankName");
				НоваяСтрокаТЧ.BeneficiaryAccountNumber           = ЭлементМассива.Получить("BeneficiaryDetails").Получить("AccountNumber");
				НоваяСтрокаТЧ.BeneficiaryBankCode                = ЭлементМассива.Получить("BeneficiaryDetails").Получить("BankCode");
				НоваяСтрокаТЧ.BeneficiaryInn                     = ЭлементМассива.Получить("BeneficiaryDetails").Получить("Inn");	
				НоваяСтрокаТЧ.SenderName                         = ЭлементМассива.Получить("SenderDetails").Получить("Name");
				НоваяСтрокаТЧ.SenderBankName                     = ЭлементМассива.Получить("SenderDetails").Получить("BankName");
				НоваяСтрокаТЧ.SenderAccountNumber                = ЭлементМассива.Получить("SenderDetails").Получить("AccountNumber");
				НоваяСтрокаТЧ.SenderBankCode                     = ЭлементМассива.Получить("SenderDetails").Получить("BankCode");
				НоваяСтрокаТЧ.SenderInn                          = ЭлементМассива.Получить("SenderDetails").Получить("Inn");						
				НоваяСтрокаТЧ.DocumentActualDate                 = ЭлементМассива.Получить("DocumentActualDate");				
				НоваяСтрокаТЧ.DocumentBeneficiaryInstitution     = ЭлементМассива.Получить("DocumentBeneficiaryInstitution");
				НоваяСтрокаТЧ.DocumentBranch                     = ЭлементМассива.Получить("DocumentBranch");
				НоваяСтрокаТЧ.DocumentCorrespondentAccountNumber = ЭлементМассива.Получить("DocumentCorrespondentAccountNumber");
				НоваяСтрокаТЧ.DocumentCorrespondentBankCode      = ЭлементМассива.Получить("DocumentCorrespondentBankCode");
				НоваяСтрокаТЧ.DocumentCorrespondentBankName      = ЭлементМассива.Получить("DocumentCorrespondentBankName");
				НоваяСтрокаТЧ.DocumentDepartment                 = ЭлементМассива.Получить("DocumentDepartment");
				НоваяСтрокаТЧ.DocumentDestinationAmount          = ЭлементМассива.Получить("DocumentDestinationAmount");
				НоваяСтрокаТЧ.DocumentDestinationCurrency        = ЭлементМассива.Получить("DocumentDestinationCurrency");
				НоваяСтрокаТЧ.DocumentExpiryDate                 = ЭлементМассива.Получить("DocumentExpiryDate");
				НоваяСтрокаТЧ.DocumentIntermediaryInstitution    = ЭлементМассива.Получить("DocumentIntermediaryInstitution");
				НоваяСтрокаТЧ.DocumentInformation                = ЭлементМассива.Получить("DocumentInformation");
				НоваяСтрокаТЧ.DocumentKey                        = ЭлементМассива.Получить("DocumentKey");
				НоваяСтрокаТЧ.DocumentNomination                 = ЭлементМассива.Получить("DocumentNomination");
				НоваяСтрокаТЧ.DocumentPayee                      = ЭлементМассива.Получить("DocumentPayee");
				НоваяСтрокаТЧ.DocumentProductGroup               = ЭлементМассива.Получить("DocumentProductGroup");
				НоваяСтрокаТЧ.DocumentRate                       = ЭлементМассива.Получить("DocumentRate");
				НоваяСтрокаТЧ.DocumentRateLimit                  = ЭлементМассива.Получить("DocumentRateLimit");
				НоваяСтрокаТЧ.DocumentReceiveDate                = ЭлементМассива.Получить("DocumentReceiveDate");
				НоваяСтрокаТЧ.DocumentRegistrationRate           = ЭлементМассива.Получить("DocumentRegistrationRate");
				НоваяСтрокаТЧ.DocumentSenderInstitution          = ЭлементМассива.Получить("DocumentSenderInstitution");
				НоваяСтрокаТЧ.DocumentSourceAmount               = ЭлементМассива.Получить("DocumentSourceAmount");
				НоваяСтрокаТЧ.DocumentSourceCurrency             = ЭлементМассива.Получить("DocumentSourceCurrency");
				НоваяСтрокаТЧ.DocumentTreasuryCode               = ЭлементМассива.Получить("DocumentTreasuryCode");
				НоваяСтрокаТЧ.DocumentValueDate                  = ЭлементМассива.Получить("DocumentValueDate");
				НоваяСтрокаТЧ.EntryAccountNumber                 = ЭлементМассива.Получить("EntryAccountNumber");
				НоваяСтрокаТЧ.EntryAccountPoint                  = ЭлементМассива.Получить("EntryAccountPoint");
				НоваяСтрокаТЧ.EntryAmountBase                    = ЭлементМассива.Получить("EntryAmountBase");
				НоваяСтрокаТЧ.EntryAmountCredit                  = ЭлементМассива.Получить("EntryAmountCredit");
				НоваяСтрокаТЧ.EntryAmountCreditBase              = ЭлементМассива.Получить("EntryAmountCreditBase");
				НоваяСтрокаТЧ.EntryAmountDebit				     = ЭлементМассива.Получить("EntryAmountDebit");
				НоваяСтрокаТЧ.EntryAmountDebitBase               = ЭлементМассива.Получить("EntryAmountDebitBase");
				НоваяСтрокаТЧ.EntryComment                       = ЭлементМассива.Получить("EntryComment");
				НоваяСтрокаТЧ.EntryDate                          = ДельтаНСФ.ПереводВДату(ЭлементМассива.Получить("EntryDate"));
				НоваяСтрокаТЧ.EntryDepartment                    = ЭлементМассива.Получить("EntryDepartment");
				НоваяСтрокаТЧ.EntryDocumentNumber                = ЭлементМассива.Получить("EntryDocumentNumber");
				НоваяСтрокаТЧ.EntryId			                 = ЭлементМассива.Получить("EntryId");
				
			КонецЦикла;			
		Иначе 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Для страницы №" + НомерСтраницы + " не найдено записей.'; ka = 'გვერდისთვის № " + НомерСтраницы + " ჩანაწერები ვერ მოიძებნა.'");
			Сообщение.Сообщить();	
		КонецЕсли;
		
		//Заполнение остатков по дням
		ИтоговаяТаблица = Новый ТаблицаЗначений;
		ИтоговаяТаблица = Объект.Выписка.Выгрузить().Скопировать();
		ИтоговаяТаблица.Очистить();	
		
		ТабЧасть = Объект.Выписка.Выгрузить();
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//|	ТаблицаЗаписей.DocumentActualDate КАК DocumentActualDate,
		//|	ТаблицаЗаписей.DocumentBeneficiaryInstitution,
		//|	ТаблицаЗаписей.DocumentCorrespondentAccountNumber,
		//|	ТаблицаЗаписей.DocumentCorrespondentBankCode,
		//|	ТаблицаЗаписей.DocumentCorrespondentBankName,
		//|	ТаблицаЗаписей.DocumentDepartment,
		//|	ТаблицаЗаписей.DocumentDestinationAmount,
		//|	ТаблицаЗаписей.DocumentDestinationCurrency,
		//|	ТаблицаЗаписей.DocumentExpiryDate,
		//|	ТаблицаЗаписей.DocumentIntermediaryInstitution,
		//|	ТаблицаЗаписей.DocumentInformation,
		//|	ТаблицаЗаписей.DocumentKey,
		//|	ТаблицаЗаписей.DocumentNomination,
		//|	ТаблицаЗаписей.DocumentPayee,
		//|	ТаблицаЗаписей.DocumentProductGroup,
		//|	ТаблицаЗаписей.DocumentRate,
		//|	ТаблицаЗаписей.DocumentRateLimit,
		//|	ТаблицаЗаписей.DocumentReceiveDate,
		//|	ТаблицаЗаписей.DocumentRegistrationRate,
		//|	ТаблицаЗаписей.DocumentSenderInstitution,
		//|	ТаблицаЗаписей.DocumentSourceAmount,
		//|	ТаблицаЗаписей.DocumentSourceCurrency,
		//|	ТаблицаЗаписей.DocumentTreasuryCode,
		//|	ТаблицаЗаписей.DocumentValueDate,
		//|	ТаблицаЗаписей.EntryAccountNumber,
		//|	ТаблицаЗаписей.EntryAccountPoint,
		//|	ТаблицаЗаписей.EntryAmountBase,
		//|	ТаблицаЗаписей.EntryAmountCredit,
		//|	ТаблицаЗаписей.EntryAmountCreditBase,
		//|	ТаблицаЗаписей.EntryAmountDebit,
		//|	ТаблицаЗаписей.EntryAmountDebitBase,
		//|	ТаблицаЗаписей.EntryComment,
		//|	ТаблицаЗаписей.EntryDate,
		//|	ТаблицаЗаписей.EntryDepartment,
		//|	ТаблицаЗаписей.EntryDocumentNumber,
		//|	ТаблицаЗаписей.EntryId,
		//|	ТаблицаЗаписей.BeneficiaryName,
		//|	ТаблицаЗаписей.BeneficiaryBankName,
		//|	ТаблицаЗаписей.BeneficiaryAccountNumber,
		//|	ТаблицаЗаписей.BeneficiaryBankCode,
		//|	ТаблицаЗаписей.BeneficiaryInn,
		//|	ТаблицаЗаписей.SenderName,
		//|	ТаблицаЗаписей.SenderBankName,
		//|	ТаблицаЗаписей.SenderAccountNumber,
		//|	ТаблицаЗаписей.SenderBankCode,
		//|	ТаблицаЗаписей.SenderInn,
		//|	ТаблицаЗаписей.DocumentBranch
		//|ПОМЕСТИТЬ ТаблицаЗаписей
		//|ИЗ
		//|	&ТаблицаЗаписей КАК ТаблицаЗаписей
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ТаблицаЗаписей.EntryDate КАК EntryDate,
		//|	ТаблицаЗаписей.DocumentActualDate КАК DocumentActualDate,
		//|	ТаблицаЗаписей.DocumentBeneficiaryInstitution,
		//|	ТаблицаЗаписей.DocumentCorrespondentAccountNumber,
		//|	ТаблицаЗаписей.DocumentCorrespondentBankCode,
		//|	ТаблицаЗаписей.DocumentCorrespondentBankName,
		//|	ТаблицаЗаписей.DocumentDepartment,
		//|	ТаблицаЗаписей.DocumentDestinationAmount,
		//|	ТаблицаЗаписей.DocumentDestinationCurrency,
		//|	ТаблицаЗаписей.DocumentExpiryDate,
		//|	ТаблицаЗаписей.DocumentIntermediaryInstitution,
		//|	ТаблицаЗаписей.DocumentInformation,
		//|	ТаблицаЗаписей.DocumentKey,
		//|	ТаблицаЗаписей.DocumentNomination,
		//|	ТаблицаЗаписей.DocumentPayee,
		//|	ТаблицаЗаписей.DocumentProductGroup,
		//|	ТаблицаЗаписей.DocumentRate,
		//|	ТаблицаЗаписей.DocumentRateLimit,
		//|	ТаблицаЗаписей.DocumentReceiveDate,
		//|	ТаблицаЗаписей.DocumentRegistrationRate,
		//|	ТаблицаЗаписей.DocumentSenderInstitution,
		//|	ТаблицаЗаписей.DocumentSourceAmount,
		//|	ТаблицаЗаписей.DocumentSourceCurrency,
		//|	ТаблицаЗаписей.DocumentTreasuryCode,
		//|	ТаблицаЗаписей.DocumentValueDate,
		//|	ТаблицаЗаписей.EntryAccountNumber,
		//|	ТаблицаЗаписей.EntryAccountPoint,
		//|	ТаблицаЗаписей.EntryAmountBase,
		//|	ТаблицаЗаписей.EntryAmountCredit,
		//|	ТаблицаЗаписей.EntryAmountCreditBase,
		//|	ТаблицаЗаписей.EntryAmountDebit,
		//|	ТаблицаЗаписей.EntryAmountDebitBase,
		//|	ТаблицаЗаписей.EntryComment,
		//|	ТаблицаЗаписей.EntryDepartment,
		//|	ТаблицаЗаписей.EntryDocumentNumber,
		//|	ТаблицаЗаписей.EntryId,
		//|	ТаблицаЗаписей.BeneficiaryName,
		//|	ТаблицаЗаписей.BeneficiaryBankName,
		//|	ТаблицаЗаписей.BeneficiaryAccountNumber,
		//|	ТаблицаЗаписей.BeneficiaryBankCode,
		//|	ТаблицаЗаписей.BeneficiaryInn,
		//|	ТаблицаЗаписей.SenderName,
		//|	ТаблицаЗаписей.SenderBankName,
		//|	ТаблицаЗаписей.SenderAccountNumber,
		//|	ТаблицаЗаписей.SenderBankCode,
		//|	ТаблицаЗаписей.SenderInn,
		//|	ТаблицаЗаписей.DocumentBranch
		//|ИЗ
		//|	ТаблицаЗаписей КАК ТаблицаЗаписей
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	EntryDate
		//|ИТОГИ ПО
		//|	EntryDate";
		
		//Запрос.УстановитьПараметр("ТаблицаЗаписей", ТабЧасть);
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//ВыборкаДата = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//
		//Пока ВыборкаДата.Следующий() Цикл
		//	
		//	//Если Не ВыборкаДата.EntryDate = "0001-01-01T00:00:00" Тогда //первая строчка поддельная
		//	НоваяСтрока = ИтоговаяТаблица.Добавить();
		//	
		//	НоваяСтрока.EntryDate   = ВыборкаДата.EntryDate;
		//	СтруктураДанных = Новый Структура;
		//	
		//	СтруктураДанных = ПолучитьОстатокНаДату(ВыборкаДата.EntryDate);
		//	
		//	НоваяСтрока.BalanceBase = СтруктураДанных.BalanceBase;
		//	НоваяСтрока.BalanceBase = СтруктураДанных.BalanceBase;
		//	НоваяСтрока.DebitSum    = СтруктураДанных.DebitSum;
		//	НоваяСтрока.Balance     = СтруктураДанных.Balance;
		//	НоваяСтрока.Rate        = СтруктураДанных.Rate;
		//	НоваяСтрока.CreditSum   = СтруктураДанных.CreditSum;
		//	НоваяСтрока.EntryCount  = СтруктураДанных.EntryCount;
		//	НоваяСтрока.Date        = ДельтаНСФ.ДатаВремяВСтроку(СтруктураДанных.Date); 
		//	
		//	ВыборкаДетальныеЗаписи = ВыборкаДата.Выбрать();
		//	
		//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//		
		//		НоваяСтрокаТЧ = ИтоговаяТаблица.Добавить();
		//		
		//		НоваяСтрокаТЧ.BeneficiaryName                    = ВыборкаДетальныеЗаписи.BeneficiaryAccountNumber;
		//		НоваяСтрокаТЧ.BeneficiaryBankName                = ВыборкаДетальныеЗаписи.BeneficiaryBankCode;
		//		НоваяСтрокаТЧ.BeneficiaryAccountNumber           = ВыборкаДетальныеЗаписи.BeneficiaryName;
		//		НоваяСтрокаТЧ.BeneficiaryBankCode                = ВыборкаДетальныеЗаписи.BeneficiaryBankName;
		//		НоваяСтрокаТЧ.BeneficiaryInn                     = ВыборкаДетальныеЗаписи.BeneficiaryInn;			
		//		НоваяСтрокаТЧ.SenderName                         = ВыборкаДетальныеЗаписи.SenderName;
		//		НоваяСтрокаТЧ.SenderBankName                     = ВыборкаДетальныеЗаписи.SenderBankName;
		//		НоваяСтрокаТЧ.SenderAccountNumber                = ВыборкаДетальныеЗаписи.SenderAccountNumber;
		//		НоваяСтрокаТЧ.SenderBankCode                     = ВыборкаДетальныеЗаписи.SenderBankCode;
		//		НоваяСтрокаТЧ.SenderInn                          = ВыборкаДетальныеЗаписи.SenderInn;			
		//		НоваяСтрокаТЧ.DocumentActualDate                 = ВыборкаДетальныеЗаписи.DocumentActualDate;				
		//		НоваяСтрокаТЧ.DocumentBeneficiaryInstitution     = ВыборкаДетальныеЗаписи.DocumentBeneficiaryInstitution;
		//		НоваяСтрокаТЧ.DocumentBranch                     = ВыборкаДетальныеЗаписи.DocumentBranch;
		//		НоваяСтрокаТЧ.DocumentCorrespondentAccountNumber = ВыборкаДетальныеЗаписи.DocumentCorrespondentAccountNumber;
		//		НоваяСтрокаТЧ.DocumentCorrespondentBankCode      = ВыборкаДетальныеЗаписи.DocumentCorrespondentBankCode;
		//		НоваяСтрокаТЧ.DocumentCorrespondentBankName      = ВыборкаДетальныеЗаписи.DocumentCorrespondentBankName;
		//		НоваяСтрокаТЧ.DocumentDepartment                 = ВыборкаДетальныеЗаписи.DocumentDepartment;
		//		НоваяСтрокаТЧ.DocumentDestinationAmount          = ВыборкаДетальныеЗаписи.DocumentDestinationAmount;
		//		НоваяСтрокаТЧ.DocumentDestinationCurrency        = ВыборкаДетальныеЗаписи.DocumentDestinationCurrency;
		//		НоваяСтрокаТЧ.DocumentExpiryDate                 = ВыборкаДетальныеЗаписи.DocumentExpiryDate;
		//		НоваяСтрокаТЧ.DocumentIntermediaryInstitution    = ВыборкаДетальныеЗаписи.DocumentIntermediaryInstitution;
		//		НоваяСтрокаТЧ.DocumentInformation                = ВыборкаДетальныеЗаписи.DocumentInformation;
		//		НоваяСтрокаТЧ.DocumentKey                        = ВыборкаДетальныеЗаписи.DocumentKey;
		//		НоваяСтрокаТЧ.DocumentNomination                 = ВыборкаДетальныеЗаписи.DocumentNomination;
		//		НоваяСтрокаТЧ.DocumentPayee                      = ВыборкаДетальныеЗаписи.DocumentPayee;
		//		НоваяСтрокаТЧ.DocumentProductGroup               = ВыборкаДетальныеЗаписи.DocumentProductGroup;
		//		НоваяСтрокаТЧ.DocumentRate                       = ВыборкаДетальныеЗаписи.DocumentRate;
		//		НоваяСтрокаТЧ.DocumentRateLimit                  = ВыборкаДетальныеЗаписи.DocumentRateLimit;
		//		НоваяСтрокаТЧ.DocumentReceiveDate                = ВыборкаДетальныеЗаписи.DocumentReceiveDate;
		//		НоваяСтрокаТЧ.DocumentRegistrationRate           = ВыборкаДетальныеЗаписи.DocumentRegistrationRate;
		//		НоваяСтрокаТЧ.DocumentSenderInstitution          = ВыборкаДетальныеЗаписи.DocumentSenderInstitution;
		//		НоваяСтрокаТЧ.DocumentSourceAmount               = ВыборкаДетальныеЗаписи.DocumentSourceAmount;
		//		НоваяСтрокаТЧ.DocumentSourceCurrency             = ВыборкаДетальныеЗаписи.DocumentSourceCurrency;
		//		НоваяСтрокаТЧ.DocumentTreasuryCode               = ВыборкаДетальныеЗаписи.DocumentTreasuryCode;
		//		НоваяСтрокаТЧ.DocumentValueDate                  = ВыборкаДетальныеЗаписи.DocumentValueDate;
		//		НоваяСтрокаТЧ.EntryAccountNumber                 = ВыборкаДетальныеЗаписи.EntryAccountNumber;
		//		НоваяСтрокаТЧ.EntryAccountPoint                  = ВыборкаДетальныеЗаписи.EntryAccountPoint;
		//		НоваяСтрокаТЧ.EntryAmountBase                    = ВыборкаДетальныеЗаписи.EntryAmountBase;
		//		НоваяСтрокаТЧ.EntryAmountCredit                  = ВыборкаДетальныеЗаписи.EntryAmountCredit;
		//		НоваяСтрокаТЧ.EntryAmountCreditBase              = ВыборкаДетальныеЗаписи.EntryAmountCreditBase;
		//		НоваяСтрокаТЧ.EntryAmountDebit				     = ВыборкаДетальныеЗаписи.EntryAmountDebit;
		//		НоваяСтрокаТЧ.EntryAmountDebitBase               = ВыборкаДетальныеЗаписи.EntryAmountDebitBase;
		//		НоваяСтрокаТЧ.EntryComment                       = ВыборкаДетальныеЗаписи.EntryComment;
		//		НоваяСтрокаТЧ.EntryDate                          = ВыборкаДетальныеЗаписи.EntryDate;
		//		НоваяСтрокаТЧ.EntryDepartment                    = ВыборкаДетальныеЗаписи.EntryDepartment;
		//		НоваяСтрокаТЧ.EntryDocumentNumber                = ВыборкаДетальныеЗаписи.EntryDocumentNumber;
		//		НоваяСтрокаТЧ.EntryId			                 = ВыборкаДетальныеЗаписи.EntryId;
		//		
		//	КонецЦикла;
		//КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаЗаписей.DocumentActualDate КАК DocumentActualDate,
		|	ТаблицаЗаписей.DocumentBeneficiaryInstitution,
		|	ТаблицаЗаписей.DocumentCorrespondentAccountNumber,
		|	ТаблицаЗаписей.DocumentCorrespondentBankCode,
		|	ТаблицаЗаписей.DocumentCorrespondentBankName,
		|	ТаблицаЗаписей.DocumentDepartment,
		|	ТаблицаЗаписей.DocumentDestinationAmount,
		|	ТаблицаЗаписей.DocumentDestinationCurrency,
		|	ТаблицаЗаписей.DocumentExpiryDate,
		|	ТаблицаЗаписей.DocumentIntermediaryInstitution,
		|	ТаблицаЗаписей.DocumentInformation,
		|	ТаблицаЗаписей.DocumentKey,
		|	ТаблицаЗаписей.DocumentNomination,
		|	ТаблицаЗаписей.DocumentPayee,
		|	ТаблицаЗаписей.DocumentProductGroup,
		|	ТаблицаЗаписей.DocumentRate,
		|	ТаблицаЗаписей.DocumentRateLimit,
		|	ТаблицаЗаписей.DocumentReceiveDate,
		|	ТаблицаЗаписей.DocumentRegistrationRate,
		|	ТаблицаЗаписей.DocumentSenderInstitution,
		|	ТаблицаЗаписей.DocumentSourceAmount,
		|	ТаблицаЗаписей.DocumentSourceCurrency,
		|	ТаблицаЗаписей.DocumentTreasuryCode,
		|	ТаблицаЗаписей.DocumentValueDate,
		|	ТаблицаЗаписей.EntryAccountNumber,
		|	ТаблицаЗаписей.EntryAccountPoint,
		|	ТаблицаЗаписей.EntryAmountBase,
		|	ТаблицаЗаписей.EntryAmountCredit,
		|	ТаблицаЗаписей.EntryAmountCreditBase,
		|	ТаблицаЗаписей.EntryAmountDebit,
		|	ТаблицаЗаписей.EntryAmountDebitBase,
		|	ТаблицаЗаписей.EntryComment,
		|	ТаблицаЗаписей.EntryDate,
		|	ТаблицаЗаписей.EntryDepartment,
		|	ТаблицаЗаписей.EntryDocumentNumber,
		|	ТаблицаЗаписей.EntryId,
		|	ТаблицаЗаписей.BeneficiaryName,
		|	ТаблицаЗаписей.BeneficiaryBankName,
		|	ТаблицаЗаписей.BeneficiaryAccountNumber,
		|	ТаблицаЗаписей.BeneficiaryBankCode,
		|	ТаблицаЗаписей.BeneficiaryInn,
		|	ТаблицаЗаписей.SenderName,
		|	ТаблицаЗаписей.SenderBankName,
		|	ТаблицаЗаписей.SenderAccountNumber,
		|	ТаблицаЗаписей.SenderBankCode,
		|	ТаблицаЗаписей.SenderInn,
		|	ТаблицаЗаписей.DocumentBranch,
		|	1 КАК Приоритет
		|ПОМЕСТИТЬ ТаблицаЗаписей
		|ИЗ
		|	&ТаблицаЗаписей КАК ТаблицаЗаписей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаОстатковПоДням.Date,
		|	ТаблицаОстатковПоДням.BalanceBase,
		|	ТаблицаОстатковПоДням.DebitSum,
		|	ТаблицаОстатковПоДням.Balance,
		|	ТаблицаОстатковПоДням.Rate,
		|	ТаблицаОстатковПоДням.CreditSum,
		|	ТаблицаОстатковПоДням.EntryCount,
		|	2 КАК Приоритет
		|ПОМЕСТИТЬ ТаблицаОстатковПоДням
		|ИЗ
		|	&ТаблицаОстатковПоДням КАК ТаблицаОстатковПоДням
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаЗаписей.EntryDate КАК EntryDate,
		|	ТаблицаЗаписей.DocumentActualDate КАК DocumentActualDate,
		|	ТаблицаЗаписей.DocumentBeneficiaryInstitution,
		|	ТаблицаЗаписей.DocumentCorrespondentAccountNumber,
		|	ТаблицаЗаписей.DocumentCorrespondentBankCode,
		|	ТаблицаЗаписей.DocumentCorrespondentBankName,
		|	ТаблицаЗаписей.DocumentDepartment,
		|	ТаблицаЗаписей.DocumentDestinationAmount,
		|	ТаблицаЗаписей.DocumentDestinationCurrency,
		|	ТаблицаЗаписей.DocumentExpiryDate,
		|	ТаблицаЗаписей.DocumentIntermediaryInstitution,
		|	ТаблицаЗаписей.DocumentInformation,
		|	ТаблицаЗаписей.DocumentKey,
		|	ТаблицаЗаписей.DocumentNomination,
		|	ТаблицаЗаписей.DocumentPayee,
		|	ТаблицаЗаписей.DocumentProductGroup,
		|	ТаблицаЗаписей.DocumentRate,
		|	ТаблицаЗаписей.DocumentRateLimit,
		|	ТаблицаЗаписей.DocumentReceiveDate,
		|	ТаблицаЗаписей.DocumentRegistrationRate,
		|	ТаблицаЗаписей.DocumentSenderInstitution,
		|	ТаблицаЗаписей.DocumentSourceAmount,
		|	ТаблицаЗаписей.DocumentSourceCurrency,
		|	ТаблицаЗаписей.DocumentTreasuryCode,
		|	ТаблицаЗаписей.DocumentValueDate,
		|	ТаблицаЗаписей.EntryAccountNumber,
		|	ТаблицаЗаписей.EntryAccountPoint,
		|	ТаблицаЗаписей.EntryAmountBase,
		|	ТаблицаЗаписей.EntryAmountCredit,
		|	ТаблицаЗаписей.EntryAmountCreditBase,
		|	ТаблицаЗаписей.EntryAmountDebit,
		|	ТаблицаЗаписей.EntryAmountDebitBase,
		|	ТаблицаЗаписей.EntryComment,
		|	ТаблицаЗаписей.EntryDepartment,
		|	ТаблицаЗаписей.EntryDocumentNumber,
		|	ТаблицаЗаписей.EntryId,
		|	ТаблицаЗаписей.BeneficiaryName,
		|	ТаблицаЗаписей.BeneficiaryBankName,
		|	ТаблицаЗаписей.BeneficiaryAccountNumber,
		|	ТаблицаЗаписей.BeneficiaryBankCode,
		|	ТаблицаЗаписей.BeneficiaryInn,
		|	ТаблицаЗаписей.SenderName,
		|	ТаблицаЗаписей.SenderBankName,
		|	ТаблицаЗаписей.SenderAccountNumber,
		|	ТаблицаЗаписей.SenderBankCode,
		|	ТаблицаЗаписей.SenderInn,
		|	ТаблицаЗаписей.DocumentBranch,
		|	NULL КАК BalanceBase,
		|	NULL КАК DebitSum,
		|	NULL КАК Balance,
		|	NULL КАК Rate,
		|	NULL КАК CreditSum,
		|	NULL КАК EntryCount,
		|	ТаблицаЗаписей.Приоритет КАК Приоритет,
		|	NULL КАК Date
		|ИЗ
		|	ТаблицаЗаписей КАК ТаблицаЗаписей
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаОстатковПоДням.Date,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ТаблицаОстатковПоДням.BalanceBase,
		|	ТаблицаОстатковПоДням.DebitSum,
		|	ТаблицаОстатковПоДням.Balance,
		|	ТаблицаОстатковПоДням.Rate,
		|	ТаблицаОстатковПоДням.CreditSum,
		|	ТаблицаОстатковПоДням.EntryCount,
		|	ТаблицаОстатковПоДням.Приоритет,
		|	ТаблицаОстатковПоДням.Date
		|ИЗ
		|	ТаблицаОстатковПоДням КАК ТаблицаОстатковПоДням
		|
		|УПОРЯДОЧИТЬ ПО
		|	EntryDate,
		|	Приоритет";
		
		Запрос.УстановитьПараметр("ТаблицаЗаписей", ТабЧасть);
		Запрос.УстановитьПараметр("ТаблицаОстатковПоДням", ТаблицаОстатковПоДням);
		
		//ВыборкаДата = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		//Пока ВыборкаДата.Следующий() Цикл
		//	
		//	//Если Не ВыборкаДата.EntryDate = "0001-01-01T00:00:00" Тогда //первая строчка поддельная
		//	НоваяСтрока = ИтоговаяТаблица.Добавить();
		//	
		//	НоваяСтрока.EntryDate   = ВыборкаДата.EntryDate;
		//	СтруктураДанных = Новый Структура;
		//	
		//	СтруктураДанных = ПолучитьОстатокНаДату(ВыборкаДата.EntryDate);
		//	
		//	НоваяСтрока.BalanceBase = СтруктураДанных.BalanceBase;
		//	НоваяСтрока.BalanceBase = СтруктураДанных.BalanceBase;
		//	НоваяСтрока.DebitSum    = СтруктураДанных.DebitSum;
		//	НоваяСтрока.Balance     = СтруктураДанных.Balance;
		//	НоваяСтрока.Rate        = СтруктураДанных.Rate;
		//	НоваяСтрока.CreditSum   = СтруктураДанных.CreditSum;
		//	НоваяСтрока.EntryCount  = СтруктураДанных.EntryCount;
		//	НоваяСтрока.Date        = ДельтаНСФ.ДатаВремяВСтроку(СтруктураДанных.Date); 
		//	
		//	ВыборкаДетальныеЗаписи = ВыборкаДата.Выбрать();
		//	
		//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//		
		//		НоваяСтрокаТЧ = ИтоговаяТаблица.Добавить();
		//		
		//		НоваяСтрокаТЧ.BeneficiaryName                    = ВыборкаДетальныеЗаписи.BeneficiaryAccountNumber;
		//		НоваяСтрокаТЧ.BeneficiaryBankName                = ВыборкаДетальныеЗаписи.BeneficiaryBankCode;
		//		НоваяСтрокаТЧ.BeneficiaryAccountNumber           = ВыборкаДетальныеЗаписи.BeneficiaryName;
		//		НоваяСтрокаТЧ.BeneficiaryBankCode                = ВыборкаДетальныеЗаписи.BeneficiaryBankName;
		//		НоваяСтрокаТЧ.BeneficiaryInn                     = ВыборкаДетальныеЗаписи.BeneficiaryInn;			
		//		НоваяСтрокаТЧ.SenderName                         = ВыборкаДетальныеЗаписи.SenderName;
		//		НоваяСтрокаТЧ.SenderBankName                     = ВыборкаДетальныеЗаписи.SenderBankName;
		//		НоваяСтрокаТЧ.SenderAccountNumber                = ВыборкаДетальныеЗаписи.SenderAccountNumber;
		//		НоваяСтрокаТЧ.SenderBankCode                     = ВыборкаДетальныеЗаписи.SenderBankCode;
		//		НоваяСтрокаТЧ.SenderInn                          = ВыборкаДетальныеЗаписи.SenderInn;			
		//		НоваяСтрокаТЧ.DocumentActualDate                 = ВыборкаДетальныеЗаписи.DocumentActualDate;				
		//		НоваяСтрокаТЧ.DocumentBeneficiaryInstitution     = ВыборкаДетальныеЗаписи.DocumentBeneficiaryInstitution;
		//		НоваяСтрокаТЧ.DocumentBranch                     = ВыборкаДетальныеЗаписи.DocumentBranch;
		//		НоваяСтрокаТЧ.DocumentCorrespondentAccountNumber = ВыборкаДетальныеЗаписи.DocumentCorrespondentAccountNumber;
		//		НоваяСтрокаТЧ.DocumentCorrespondentBankCode      = ВыборкаДетальныеЗаписи.DocumentCorrespondentBankCode;
		//		НоваяСтрокаТЧ.DocumentCorrespondentBankName      = ВыборкаДетальныеЗаписи.DocumentCorrespondentBankName;
		//		НоваяСтрокаТЧ.DocumentDepartment                 = ВыборкаДетальныеЗаписи.DocumentDepartment;
		//		НоваяСтрокаТЧ.DocumentDestinationAmount          = ВыборкаДетальныеЗаписи.DocumentDestinationAmount;
		//		НоваяСтрокаТЧ.DocumentDestinationCurrency        = ВыборкаДетальныеЗаписи.DocumentDestinationCurrency;
		//		НоваяСтрокаТЧ.DocumentExpiryDate                 = ВыборкаДетальныеЗаписи.DocumentExpiryDate;
		//		НоваяСтрокаТЧ.DocumentIntermediaryInstitution    = ВыборкаДетальныеЗаписи.DocumentIntermediaryInstitution;
		//		НоваяСтрокаТЧ.DocumentInformation                = ВыборкаДетальныеЗаписи.DocumentInformation;
		//		НоваяСтрокаТЧ.DocumentKey                        = ВыборкаДетальныеЗаписи.DocumentKey;
		//		НоваяСтрокаТЧ.DocumentNomination                 = ВыборкаДетальныеЗаписи.DocumentNomination;
		//		НоваяСтрокаТЧ.DocumentPayee                      = ВыборкаДетальныеЗаписи.DocumentPayee;
		//		НоваяСтрокаТЧ.DocumentProductGroup               = ВыборкаДетальныеЗаписи.DocumentProductGroup;
		//		НоваяСтрокаТЧ.DocumentRate                       = ВыборкаДетальныеЗаписи.DocumentRate;
		//		НоваяСтрокаТЧ.DocumentRateLimit                  = ВыборкаДетальныеЗаписи.DocumentRateLimit;
		//		НоваяСтрокаТЧ.DocumentReceiveDate                = ВыборкаДетальныеЗаписи.DocumentReceiveDate;
		//		НоваяСтрокаТЧ.DocumentRegistrationRate           = ВыборкаДетальныеЗаписи.DocumentRegistrationRate;
		//		НоваяСтрокаТЧ.DocumentSenderInstitution          = ВыборкаДетальныеЗаписи.DocumentSenderInstitution;
		//		НоваяСтрокаТЧ.DocumentSourceAmount               = ВыборкаДетальныеЗаписи.DocumentSourceAmount;
		//		НоваяСтрокаТЧ.DocumentSourceCurrency             = ВыборкаДетальныеЗаписи.DocumentSourceCurrency;
		//		НоваяСтрокаТЧ.DocumentTreasuryCode               = ВыборкаДетальныеЗаписи.DocumentTreasuryCode;
		//		НоваяСтрокаТЧ.DocumentValueDate                  = ВыборкаДетальныеЗаписи.DocumentValueDate;
		//		НоваяСтрокаТЧ.EntryAccountNumber                 = ВыборкаДетальныеЗаписи.EntryAccountNumber;
		//		НоваяСтрокаТЧ.EntryAccountPoint                  = ВыборкаДетальныеЗаписи.EntryAccountPoint;
		//		НоваяСтрокаТЧ.EntryAmountBase                    = ВыборкаДетальныеЗаписи.EntryAmountBase;
		//		НоваяСтрокаТЧ.EntryAmountCredit                  = ВыборкаДетальныеЗаписи.EntryAmountCredit;
		//		НоваяСтрокаТЧ.EntryAmountCreditBase              = ВыборкаДетальныеЗаписи.EntryAmountCreditBase;
		//		НоваяСтрокаТЧ.EntryAmountDebit				     = ВыборкаДетальныеЗаписи.EntryAmountDebit;
		//		НоваяСтрокаТЧ.EntryAmountDebitBase               = ВыборкаДетальныеЗаписи.EntryAmountDebitBase;
		//		НоваяСтрокаТЧ.EntryComment                       = ВыборкаДетальныеЗаписи.EntryComment;
		//		НоваяСтрокаТЧ.EntryDate                          = ВыборкаДетальныеЗаписи.EntryDate;
		//		НоваяСтрокаТЧ.EntryDepartment                    = ВыборкаДетальныеЗаписи.EntryDepartment;
		//		НоваяСтрокаТЧ.EntryDocumentNumber                = ВыборкаДетальныеЗаписи.EntryDocumentNumber;
		//		НоваяСтрокаТЧ.EntryId			                 = ВыборкаДетальныеЗаписи.EntryId;
		//		
		//	КонецЦикла;
		//КонецЦикла;
		
		
		//Объект.Выписка.Загрузить(ИтоговаяТаблица);
		Объект.Выписка.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСтраницыПриИзменении(Элемент)
	
	ЗаполнитьТЧВыписки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВExcel(Команда)
	
	//ПараметрыФормы = Новый Структура();
	//ПараметрыФормы.Вставить("ТаблицаПолей", Объект.Выписка);
	//
	//ОткрытьФорму("ОбщаяФорма.ВыборПолейДляВыгрузкиВExcel", ПараметрыФормы, ЭтаФорма);
	
	//ВыгрузитьВExcelНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьВExcelНаСервере()
	
	//ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("Выбрано", Истина);	
	//ВыбранныеПоля = ВсеПоля.Выгрузить(ПараметрыОтбора, "Поле, СинонимПоля");
	//ВыбранныеПоля = РегистрыСведений.СохранениеВыбранныхПолей.СрезПоследних(ТекущаяДата(), ПараметрыОтбора); по неизвестным причинам не сработало
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СохранениеВыбранныхПолейСрезПоследних.СинонимПоля,
	|	СохранениеВыбранныхПолейСрезПоследних.Поле,
	|	СохранениеВыбранныхПолейСрезПоследних.Пользователь
	|ИЗ
	|	РегистрСведений.СохранениеВыбранныхПолей.СрезПоследних(
	|			&Период,
	|			ЕСТЬNULL(Выбрано, ЛОЖЬ) = ИСТИНА
	|				И Пользователь = &Пользователь) КАК СохранениеВыбранныхПолейСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Пользователь", ОбщегоНазначения.ТекущийПользователь());
	ВыбранныеПоля = Запрос.Выполнить().Выгрузить();
	
	ТаблицаExcel = Объект.Выписка.Выгрузить();
	ТаблицаExcel.Колонки.Добавить("СинонимПоля", Новый ОписаниеТипов("Строка"));
	
	Для Каждого Стр Из Объект.Выписка.Выгрузить().Колонки Цикл 
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Поле", Стр.Имя);
		
		ПолеВыбрано = ВыбранныеПоля.НайтиСтроки(ПараметрыОтбора);
		
		Если Не ПолеВыбрано.Количество() > 0 Тогда 		
			ТаблицаExcel.Колонки.Удалить(Стр.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	// создаем txcel
	Попытка
		Excel = Новый COMОбъект("Excel.Application"); 
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
	
	//Excel.Visible = Истина;
	Книга = Excel.WorkBooks.Add();
	//При создании книги автоматически создаются листы (по умолчанию 3). Нам остается только выбрать нужный:
	
	Лист = Книга.WorkSheets(1);
	//Или добавить в книгу новый лист:	
	
	Строка  = 15; 
	Строка  = Строка + 1;  
	Колонка = 1;
	Шапка   = Истина;
	Индекс  = 0;            
	
	Лист.Cells(4, 3).Value  = "ამონაწერი";
	Лист.Cells(4, 3).Font.Bold = 1;
	
	Лист.Cells(5, 1).Value  = "ანგარიშის მფლობელი: " + Объект.СчетВыписки.Владелец.Наименование;
	Лист.Cells(6, 1).Value  = "საიდენტიფიკაციო კოდი: " + Объект.СчетВыписки.Владелец.ИНН;
	Лист.Cells(7, 1).Value  = "ანგარიში: " + Объект.СчетВыписки.НомерСчета;
	Лист.Cells(8, 1).Value  = "ვალუტა: " + Объект.СчетВыписки.ВалютаДенежныхСредств.Код;
	Лист.Cells(9, 1).Value  = "პერიოდი: " + ДельтаНСФ.ДатаВремяВСтроку(Объект.ДатаНачалаВыписки) + " - " + ДельтаНСФ.ДатаВремяВСтроку(Объект.ДатаОкончанияВыписки);
	Лист.Cells(10, 1).Value = "საწყისი ნაშთი: " + Объект.InAmount;
	Лист.Cells(11, 1).Value = "საბოლოო ნაშთი: " + Объект.OutAmount;
	Лист.Cells(12, 1).Value = "საწყისი ნაშთი ექვ ლარში: " + Объект.InAmountBase;
	Лист.Cells(13, 1).Value = "საბოლოო ნაშთი ექვ ლარში: " + Объект.OutAmountBase;	
	
	Для Каждого СтрокаТаблицы Из ТаблицаExcel Цикл 
		
		Счетчик = 1;
		Для Каждого СтрокаПоле ИЗ ВыбранныеПоля Цикл 
			
			Если Шапка Тогда 
				Лист.Cells(Строка - 1, Счетчик).Value = СтрокаПоле.СинонимПоля;
				Лист.Cells(Строка - 1, Счетчик).Font.Bold = 1;
				//илона
				Лист.Cells(Строка - 1, Счетчик).Borders.Linestyle = 1;
				Лист.Cells(Счетчик).ColumnWidth = 20;
				//илона
			КонецЕсли;							
			
			Лист.Cells(Строка, Счетчик).Value = ?(ТипЗнч(СтрокаТаблицы[СтрЗаменить(СтрокаПоле.Поле, " ", "")]) = ТИП("Дата"), ДельтаНСФ.ДатаВСтроку(СтрокаТаблицы[СтрЗаменить(СтрокаПоле.Поле, " ", "")]), СтрокаТаблицы[СтрЗаменить(СтрокаПоле.Поле, " ", "")]);
			//илона
			Лист.Cells(Строка, Счетчик).Borders.Linestyle = 1;
			//илона
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
		Шапка = Ложь;
		Строка = Строка + 1;
		
	КонецЦикла;
	 //Лист.Columns(НомерКолонки).ColumnWidth
	 //Лист.Cells(НомерСтроки,НомерКолонки).Borders.Linestyle = ТипЛинии;
	Попытка	
		//C:\Users\USR1CV82\Desktop\
		ИмяФайла = "C:\Users\USR1CV82\Desktop\"+СтрЗаменить(СтрЗаменить(ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата()),"-", " "), ":", " ")+".xlsx";
		
		Книга.SaveAs(ИмяФайла);
		Excel.Visible = Истина;
		//Книга.Close();
		//Excel.WorkBooks.Open(ИмяФайла);		
	Исключение
		Сообщить(ОписаниеОшибки()+" Файл не сохранен!");
	КонецПопытки;	
	//Excel.Quit();
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ВыборПолейДляВыгрузкиВExcel" Тогда 
		ЗаписатьПоля(ВыбранноеЗначение);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстатокНаДату(EntryDate)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаОстатковПоДням.Date,
	|	ТаблицаОстатковПоДням.BalanceBase,
	|	ТаблицаОстатковПоДням.DebitSum,
	|	ТаблицаОстатковПоДням.Balance,
	|	ТаблицаОстатковПоДням.Rate,
	|	ТаблицаОстатковПоДням.CreditSum,
	|	ТаблицаОстатковПоДням.EntryCount
	|ПОМЕСТИТЬ ТаблицаОстатковПоДням
	|ИЗ
	|	&ТаблицаОстатковПоДням КАК ТаблицаОстатковПоДням
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОстатковПоДням.Date,
	|	ТаблицаОстатковПоДням.BalanceBase,
	|	ТаблицаОстатковПоДням.DebitSum,
	|	ТаблицаОстатковПоДням.Balance,
	|	ТаблицаОстатковПоДням.Rate,
	|	ТаблицаОстатковПоДням.CreditSum,
	|	ТаблицаОстатковПоДням.EntryCount
	|ИЗ
	|	ТаблицаОстатковПоДням КАК ТаблицаОстатковПоДням
	|ГДЕ
	|	ТаблицаОстатковПоДням.Date = &EntryDate";
	
	Запрос.УстановитьПараметр("ТаблицаОстатковПоДням", ТаблицаОстатковПоДням);
	Запрос.УстановитьПараметр("EntryDate", ДельтаНСФ.ПереводВДату(EntryDate));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	
	СтруктураПолей = Новый Структура();
	СтруктураПолей.Вставить("Date",        Выборка.Date);
	СтруктураПолей.Вставить("BalanceBase", Выборка.BalanceBase);
	СтруктураПолей.Вставить("DebitSum",    Выборка.DebitSum);
	СтруктураПолей.Вставить("Balance",     Выборка.Balance);
	СтруктураПолей.Вставить("CreditSum",   Выборка.CreditSum);
	СтруктураПолей.Вставить("Rate",        Выборка.Rate);
	СтруктураПолей.Вставить("EntryCount",  Выборка.EntryCount);
	
	Возврат СтруктураПолей;
	
КонецФункции

&НаСервере
Процедура ЗаписатьПоля(ВсеПоля)
	
	// запомнить поля	
	НаборЗаписей = РегистрыСведений.СохранениеВыбранныхПолей.СоздатьНаборЗаписей();
	
	Для Каждого Стр ИЗ ВсеПоля Цикл   
		//НаборЗаписей.Отбор.Поле.Установить(Стр.Поле);
		//НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
		Запись = НаборЗаписей.Добавить();
		
		Запись.Период       = ТекущаяДата(); 
		Запись.Поле         = Стр.Поле;
		Запись.Пользователь = ОбщегоНазначения.ТекущийПользователь();
		Запись.СинонимПоля  = Стр.СинонимПоля;		
		Запись.Выбрано      = Стр.Выбрано;		
	КонецЦикла;  
	НаборЗаписей.ОбменДанными.Загрузка = Истина;   
	НаборЗаписей.Записать();
	// запомнить поля
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПоляДляВыгрузкиВExcel(Команда)
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение); 
	ДиалогСохраненияФайла.ПолноеИмяФайла = "Выгрузка_"+ Формат(Объект.ДатаНачалаВыписки, "Л=ka_GE; ДФ=dd.MM.yyyy") + " - " + Формат(Объект.ДатаОкончанияВыписки, "Л=ka_GE; ДФ=dd.MM.yyyy"); 
	Фильтр = "Текст(*.xlsx)|*.xlsx";                 
	ДиалогСохраненияФайла.Фильтр = Фильтр; 
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь; 
	ДиалогСохраненияФайла.Заголовок = НСтр(("ru = 'Укажите место сохранения'; en = 'Укажите место сохранения'")); 
	Если ДиалогСохраненияФайла.Выбрать() Тогда 
		ПутьКФайлу = ДиалогСохраненияФайла.ПолноеИмяФайла; 
	КонецЕсли; 
	
	ТабличныйДокумент = ВыбратьПоляДляВыгрузкиВExcelНаСервере();
	
	ТабличныйДокумент.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLSX);
	
КонецПроцедуры

&НаСервере
Функция ВыбратьПоляДляВыгрузкиВExcelНаСервере()
	
	ТЗВыписки = Объект.Выписка.Выгрузить(,"Date,EntryDocumentNumber,EntryAccountNumber,DebitSum,CreditSum,EntryComment,DocumentProductGroup,EntryId,DocumentKey,SenderName,SenderInn,SenderAccountNumber,SenderBankCode,SenderBankName,BeneficiaryName,BeneficiaryInn,BeneficiaryAccountNumber,BeneficiaryBankCode,BeneficiaryBankName,DocumentNomination,DocumentInformation,EntryAmountCredit,EntryAmountCreditBase,EntryAmountDebit,EntryAmountDebitBase,Balance,BalanceBase");
	
	ТабДокумент = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТЗВыписки);       
	Построитель.Вывести(ТабДокумент);
	//ТабДокумент.Показать("Пользователи"); 
	
	Возврат ТабДокумент;
	
КонецФункции

//Выписка

// ППВ
&НаКлиенте
Процедура ЗагрузитьВходящиеЗаписи(Команда)
	
	ОчиститьСообщения();
	ПолучитьIDВыпискиДляППВ();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	ОчиститьСообщения();
	СоздатьДокументыНаОснованииТранзакцийBoG();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеКонтрагентаДоговораСчета(СтрокаЗаполнения, СтруктураЗаполненияКонтрагента, ВалютаЗаполнения, ИмяТаблицы);
	
	ЕстьКонтрагент = ЗначениеЗаполнено(СтрокаЗаполнения.Контрагент);
	ЕстьДоговор = ЗначениеЗаполнено(СтрокаЗаполнения.ДоговорКонтрагента);
	ЕстьСтчет = ЗначениеЗаполнено(СтрокаЗаполнения.СчетКонтрагента);
	
	Если ИмяТаблицы = "Расход" Тогда 
		ИННКонтрагента 				= СокрЛП(СтрокаЗаполнения.BeneficiaryInn);
		ИмяКонтрагента 				= СокрЛП(СтрокаЗаполнения.BeneficiaryName);
		НомерСчетаКонтраегента 		= СокрЛП(СтрокаЗаполнения.BeneficiaryAccountNumber);
		НаименованиеБанкаКонтрагента= СокрЛП(СтрокаЗаполнения.BeneficiaryBankName);
		КодБанкаКонтрагента         = СокрЛП(СтрокаЗаполнения.BeneficiaryBankCode);
	ИначеЕсли ИмяТаблицы = "Входящие" Тогда 
		ИННКонтрагента 				= СокрЛП(СтрокаЗаполнения.SenderInn);
		ИмяКонтрагента 				= СокрЛП(СтрокаЗаполнения.SenderName);
		НомерСчетаКонтраегента 		= СокрЛП(СтрокаЗаполнения.SenderAccountNumber);
		НаименованиеБанкаКонтрагента= СокрЛП(СтрокаЗаполнения.SenderBankName);
		КодБанкаКонтрагента         = СокрЛП(СтрокаЗаполнения.SenderBankCode);
	КонецЕсли;
	//Возможно уже создали или определился Счет
	Если НЕ ЕстьКонтрагент Тогда 
		Если ЕстьСтчет Тогда 
			СтрокаЗаполнения.Контрагент = СтрокаЗаполнения.СчетКонтрагента.Владелец;
			ЕстьКонтрагент = Истина;
		Иначе
			
			ЭтоСотрудник = Ложь;
			Если СтрокаЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником 
				ИЛИ СтрокаЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника 
				ИЛИ СтрокаЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику 
				ИЛИ СтрокаЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику Тогда
				ЭтоСотрудник = Истина;
			КонецЕсли;
			СтруктураПоиска = Новый Структура("ИНН, Наименование, ЭтоСотрудник", ИННКонтрагента, ИмяКонтрагента, ЭтоСотрудник);
			
			МассивНайденныхСтрок = ТаблицаСозданныхКонтрагентов.НайтиСтроки(СтруктураПоиска);
			
			Если МассивНайденныхСтрок.Количество() <> 0 Тогда
				СтрокаЗаполнения.Контрагент = МассивНайденныхСтрок[0].Контрагент;
				ЕстьКонтрагент = Истина;
			Иначе 
				ПоискКонтрагента = ПолучитьКонтрагентаСотрудник(ИННКонтрагента, ЭтоСотрудник);
				Если ЗначениеЗаполнено(ПоискКонтрагента) Тогда 
					СтрокаЗаполнения.Контрагент = ПоискКонтрагента;
					ЕстьКонтрагент = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрокаЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником 
		ИЛИ СтрокаЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника 
		ИЛИ СтрокаЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику 
		ИЛИ СтрокаЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику Тогда 
		
		Если НЕ ЕстьКонтрагент Тогда
			
			
			НовФизЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
			НовФизЛицо.Наименование = ИмяКонтрагента;
			НовФизЛицо.ИНН = ИННКонтрагента;
			НовФизЛицо.Гражданство = Справочники.СтраныМира.НайтиПоКоду("GEO");
			
			Попытка
				НовФизЛицо.Записать();
			Исключение
				Сообщить(НСтр("ru = 'Не удалось создать сотрудника: "+ИмяКонтрагента+"'; ka = 'Не удалось создать сотрудника: "+ИмяКонтрагента+"'"));
				// далее делать нечего
				Возврат;
			КонецПопытки;
			
			
			НовыйСотрудник = Справочники.Сотрудники.СоздатьЭлемент();
			НовыйСотрудник.Наименование = ИмяКонтрагента;
			НовыйСотрудник.Физлицо = НовФизЛицо.Ссылка;
			ЗаполнитьЗначенияСвойств(НовыйСотрудник, СтруктураЗаполненияКонтрагента);
			
			Попытка
				НовыйСотрудник.Записать();
				СтрокаЗаполнения.Контрагент = НовыйСотрудник.Ссылка;
				Сообщить(НСтр("ru = 'Был создан сотрудник: "+ИмяКонтрагента+"'; ka = 'Был создан сотрудник: "+ИмяКонтрагента+"'"));
				НовСтрокТЗ = ТаблицаСозданныхКонтрагентов.Добавить();
				НовСтрокТЗ.Контрагент 	= НовыйСотрудник.Ссылка;
				НовСтрокТЗ.ИНН          = ИННКонтрагента;
				НовСтрокТЗ.Наименование = ИмяКонтрагента;
				НовСтрокТЗ.ЭтоСотрудник = Истина;
			Исключение
				Сообщить(НСтр("ru = 'Не удалось создать сотрудника: "+ИмяКонтрагента+"'; ka = 'Не удалось создать сотрудника: "+ИмяКонтрагента+"'"));
				// далее делать нечего
				Возврат;
			КонецПопытки;
		КонецЕсли;
		
	Иначе 
		
		Если НЕ ЕстьКонтрагент Тогда 
			НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
			НовыйКонтрагент.Наименование = ИмяКонтрагента;
			НовыйКонтрагент.НаименованиеПолное = ИмяКонтрагента;
			НовыйКонтрагент.ИНН = ИННКонтрагента;
			ЗаполнитьЗначенияСвойств(НовыйКонтрагент, СтруктураЗаполненияКонтрагента);
			
			Попытка
				НовыйКонтрагент.Записать();
				СтрокаЗаполнения.Контрагент = НовыйКонтрагент.Ссылка;
				Сообщить(НСтр("ru = 'Был создан контрагент: "+ИмяКонтрагента+"'; ka = 'Был создан контрагент: "+ИмяКонтрагента+"'"));
				
				НовСтрокТЗ = ТаблицаСозданныхКонтрагентов.Добавить();
				НовСтрокТЗ.Контрагент 	= НовыйКонтрагент.Ссылка;
				НовСтрокТЗ.ИНН          = ИННКонтрагента;
				НовСтрокТЗ.Наименование = ИмяКонтрагента;
				НовСтрокТЗ.ЭтоСотрудник = Ложь;
			Исключение
				Сообщить(НСтр("ru = 'Не удалось создать контрагента: "+ИмяКонтрагента+"'; ka = 'Не удалось создать контрагента: "+ИмяКонтрагента+"'"));
				// далее делать нечего
				Возврат;
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЕстьДоговор
		И НЕ СтрокаЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником 
		И НЕ СтрокаЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника Тогда 
		
		Если ЗначениеЗаполнено(СтрокаЗаполнения.Контрагент.ДоговорПоУмолчанию) Тогда 
			СтрокаЗаполнения.ДоговорКонтрагента = СтрокаЗаполнения.Контрагент.ДоговорПоУмолчанию;
		Иначе 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДоговорыКонтрагентов.Ссылка
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	ДоговорыКонтрагентов.Владелец = &Владелец";
			
			Запрос.УстановитьПараметр("Владелец", СтрокаЗаполнения.Контрагент);
			
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			
			
			Если РезультатЗапроса.Количество() > 0 Тогда 
				СтрокаЗаполнения.ДоговорКонтрагента = РезультатЗапроса[0].Ссылка;
			Иначе
				
				ДоговорСоздан = ЛОЖЬ;
				НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
				НовыйДоговор.Наименование = "Основной Договор";
				НовыйДоговор.ВалютаРасчетов = ВалютаЗаполнения;
				НовыйДоговор.ВидЦен = Справочники.ВидыЦен.Оптовая;
				НовыйДоговор.Владелец = СтрокаЗаполнения.Контрагент;
				
				Попытка
					НовыйДоговор.Записать();
					СтрокаЗаполнения.ДоговорКонтрагента = НовыйДоговор.Ссылка;
					Сообщить(НСтр("ru = 'Был создан новый договор для контрагента: "+ИмяКонтрагента+"'; ka = 'Был создан новый договор для контрагента: "+ИмяКонтрагента+"'"));
					ДоговорСоздан = Истина;
				Исключение
					Сообщить(НСтр("ru = 'Не удалось создать новый договор для контрагента: "+ИмяКонтрагента+"'; ka = 'Не удалось создать новый договор для контрагента: "+ИмяКонтрагента+"'"));
				КонецПопытки;
				
				Если ДоговорСоздан Тогда 
					//Поскольку не было основного договора попробуем добавить новый договор как основной
					Попытка
						КонтрОбъект = СтрокаЗаполнения.Контрагент.ПолучитьОбъект();
						КонтрОбъект.ДоговорПоУмолчанию = НовыйДоговор.Ссылка;
					Исключение
						// Повезет в другой раз
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЕстьСтчет Тогда 
		
		НайденныйБанковскийСчет = ПолучитьСчетОрганизации(Лев(НомерСчетаКонтраегента, 22), НомерСчетаКонтраегента, ВалютаЗаполнения);//Справочники.БанковскиеСчета.НайтиПоНаименованию(Лев(СтрокаЗаполнения.SenderAccountNumber, 22),,,СтрокаЗаполнения.Контрагент);
		
		Если НайденныйБанковскийСчет = Неопределено ИЛИ НайденныйБанковскийСчет = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда 
			
			НовыйСчет						= Справочники.БанковскиеСчета.СоздатьЭлемент();
			НовыйСчет.Владелец				= СтрокаЗаполнения.Контрагент;
			НовыйСчет.ВалютаДенежныхСредств = ВалютаЗаполнения;
			НовыйСчет.ВидСчета 				= "Расчетный";
			НовыйСчет.Наименование 			= НомерСчетаКонтраегента;
			НовыйСчет.НомерСчета			= НомерСчетаКонтраегента;
			
			БанкДляСчета = ПолучитьбанкПоСВИФТБИК(НаименованиеБанкаКонтрагента, КодБанкаКонтрагента);
			Если БанкДляСчета = Неопределено Тогда 
				НовыйСчет.Банк 				= Справочники.Банки.ПустаяСсылка();
			Иначе
				НовыйСчет.Банк 				= БанкДляСчета;
			КонецЕсли;
			
			НовыйСчет.СчетУчета 			= ПредопределенноеЗначение("ПланСчетов.Управленческий.Банк");
			НовыйСчет.СчетУчетаРегл 		= ПланыСчетов.Хозрасчетный.НайтиПоКоду("1210");
			
			Попытка
				НовыйСчет.Записать();
				СтрокаЗаполнения.СчетКонтрагента = НовыйСчет.Ссылка;
				Сообщить(НСтр("ru = 'Был создан новый банковский счет для "+?(ТипЗНЧ(СтрокаЗаполнения.Контрагент) = Тип("СправочникСсылка.Контрагенты"), "контрагента", "сотрудника") + ": "+ИмяКонтрагента+"';
				| ka = 'Был создан новый банковский счет для "+?(ТипЗНЧ(СтрокаЗаполнения.Контрагент) = Тип("СправочникСсылка.Контрагенты"), "контрагента", "сотрудника") + ": "+ИмяКонтрагента+"'"));
			Исключение
				Сообщить(НСтр("ru = 'Не удалось создать новый банковский счет для "+?(ТипЗНЧ(СтрокаЗаполнения.Контрагент) = Тип("СправочникСсылка.Контрагенты"), "контрагента", "сотрудника") + ": "+ИмяКонтрагента+"'; 
				| ka = 'Не удалось создать новый банковский счет для "+?(ТипЗНЧ(СтрокаЗаполнения.Контрагент) = Тип("СправочникСсылка.Контрагенты"), "контрагента", "сотрудника") + ": "+ИмяКонтрагента+"'"));
			КонецПопытки;
			
		Иначе
			СтрокаЗаполнения.СчетКонтрагента = НайденныйБанковскийСчет;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьбанкПоСВИФТБИК(ИмяБанка, СвифтБанка)
	
	БанкВозврат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Банки.Ссылка
		|ИЗ
		|	Справочник.Банки КАК Банки
		|ГДЕ
		|	НЕ Банки.ПометкаУдаления
		|	И Банки.СВИФТБИК = &СВИФТБИК
		|	ИЛИ Банки.Код = &СВИФТБИК";
	
	Запрос.УстановитьПараметр("СВИФТБИК", СвифтБанка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 0 Тогда 
		НовыйБанк = Справочники.Банки.СоздатьЭлемент();
		НовыйБанк.Наименование = ИмяБанка;
		НовыйБанк.Код = СвифтБанка;
		НовыйБанк.СВИФТБИК = СвифтБанка;
		
		Попытка
			НовыйБанк.Записать();
			БанкВозврат = НовыйБанк.Ссылка;
			Сообщить(НСтр("ru = 'В справочник банки, добавлен новый банк: "+ИмяБанка+"'; ka = 'В справочник банки, добавлен новый банк: "+ИмяБанка+"'"));
		Исключение
			//укажем пользователю чтобы поправил после загрузки
		КонецПопытки;
		
	Иначе
		БанкВозврат = РезультатЗапроса[0].Ссылка;
	КонецЕсли;
	
	Возврат БанкВозврат;
	
КонецФункции

&НаСервере
Процедура СоздатьДокументыНаОснованииТранзакцийBoG()
	
	КолВоСозданныхДокументов = 0;		
	КоличествоПовторныхПопыток = 0;
	
	МассивНомеровСтрок = Новый Массив;
	
	ТаблицаСозданныхДокументов = Новый ТаблицаЗначений;
	//ТаблицаСозданныхДокументов.Колонки.Добавить("ДокументСсылка", Новый ОписаниеТипов("ДокументСсылка.ПлатежноеПоручениеВходящее"));
	ТаблицаСозданныхДокументов.Колонки.Добавить("ДокументСсылка", Новый ОписаниеТипов("ДокументСсылка.ПоступлениеНаСчет"));
	ТаблицаСозданныхДокументов.Колонки.Добавить("EntryId", Новый ОписаниеТипов("Строка"));
	
	СтруктураЗаполненияКонтрагента = Новый Структура;
	
	СтруктураЗаполненияКонтрагента.Вставить("Покупатель", Истина);
	СтруктураЗаполненияКонтрагента.Вставить("ВестиРасчетыПоДоговорам", Истина);
	СтруктураЗаполненияКонтрагента.Вставить("ВестиРасчетыПоДокументам", Истина);
	СтруктураЗаполненияКонтрагента.Вставить("ВестиРасчетыПоЗаказам", Истина);
	СтруктураЗаполненияКонтрагента.Вставить("ВестиУчетОплатыПоСчетам", Истина);
	СтруктураЗаполненияКонтрагента.Вставить("ВидКонтрагента", Перечисления.ВидыКонтрагентов.ЮридическоеЛицо);
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаРасчетовСПокупателем", ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыСПокупателями"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаАвансовПокупателя", ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыПоАвансамПолученным"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаРасчетовСПоставщиком", ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыСПоставщиками"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаАвансовПоставщику", ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыПоАвансамВыданным"));
	СтруктураЗаполненияКонтрагента.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
	СтруктураЗаполненияКонтрагента.Вставить("ВидВыдачиНДФЛ", "7");
	
	СчетаУчета = РегламентированныйУчетСервер.ПолучитьСчетаКонтрагентаПоУмолчанию();	
	
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаРасчетовСПокупателемРегл", СчетаУчета.СчетУчетаРасчетовСПокупателемРегл);
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаАвансовПокупателяРегл", СчетаУчета.СчетУчетаАвансовПокупателяРегл);
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаРасчетовСПоставщикомРегл", СчетаУчета.СчетУчетаРасчетовСПоставщикомРегл);
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаАвансовПоставщикуРегл", СчетаУчета.СчетУчетаАвансовПоставщикуРегл);
	
	СтруктураЗаполненияКонтрагента.Вставить("СчетРасчетовСПерсоналом", ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыСПерсоналомПоОплатеТруда"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетРасчетовСПодотчетниками", ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыСПодотчетниками"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетРасчетовПоПерерасходу", ПредопределенноеЗначение("ПланСчетов.Управленческий.ПерерасходПодотчетников"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетРасчетовСПерсоналомРегл", РегламентированныйУчетСервер.ПолучитьСчетПоНомеру("3130"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетРасчетовСПодотчетникамиРегл", РегламентированныйУчетСервер.ПолучитьСчетПоНомеру("1430"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетРасчетовПоПерерасходуРегл", РегламентированныйУчетСервер.ПолучитьСчетПоНомеру("3160"));
	СтруктураЗаполненияКонтрагента.Вставить("Гражданство", Справочники.СтраныМира.НайтиПоКоду("GEO"));
	
	Для Каждого Транзакция ИЗ Объект.ПлатежныеПорученияВходящие Цикл
		
		СуществуетДокумент = ПроверкаНаСуществованиеДанногоДокумента(Транзакция.EntryId);
		
		Если Транзакция.Пометка И НЕ ЗначениеЗаполнено(Транзакция.СозданныйДокумент) И Не СуществуетДокумент Тогда 
			
			ВалютаЗаполнения = ПолучитьВалюту(Транзакция.DocumentDestinationCurrency);
			Если СоздаватьКотрагентовИСчита Тогда 
				ПроверитьЗаполнениеКонтрагентаДоговораСчета(Транзакция, СтруктураЗаполненияКонтрагента, ВалютаЗаполнения, "Входящие");
			КонецЕсли;
			
			//НовыйДокумент 								= Документы.ПлатежноеПоручениеВходящее.СоздатьДокумент();
			НовыйДокумент 								= Документы.ПоступлениеНаСчет.СоздатьДокумент();
			
			НовыйДокумент.ВариантЗаполненияРасшифровки = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияРасшифровкиПлатежа.Вручную");
			Сотрудник = Ложь;
			//ТорговыйПредставитель = Ложь;
			Если  ТипЗнч(Транзакция.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
				//Контрагент = ПолучитьКонтрагента(Транзакция.SenderInn, Сотрудник, ТорговыйПредставитель);
				НовыйДокумент.Контрагент = Транзакция.Контрагент;//Контрагент; 
				//Транзакция.Контрагент = Контрагент;
				НовыйДокумент.НалогообложениеНДС = ?(ЗначениеЗаполнено(НовыйДокумент.Контрагент), НовыйДокумент.Контрагент.НалогообложениеНДС, Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
			Иначе
				Сотрудник = Истина;
				НовыйДокумент.Подотчетник = Транзакция.Контрагент;
			//	Если ТипЗнч(Транзакция.SenderName) = Тип("СправочникСсылка.Контрагенты") Тогда 
			//		НовыйДокумент.НалогообложениеНДС = ?(ЗначениеЗаполнено(Контрагент), Контрагент.НалогообложениеНДС, Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
			//	Иначе
			//		НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
			//	КонецЕсли;
			//	
			//	//Если ТипЗнч(Транзакция.SenderName) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
			//	//	Сотрудник = Истина;
			//	//	ПроверкаТорговогоПредставителя(ТорговыйПредставитель, Транзакция.SenderName);
			//	//КонецЕсли;
			//
			КонецЕсли;
			
			//НовыйДокумент.ВалютаДокумента               = ПолучитьВалюту(Транзакция.DocumentDestinationCurrency);
			НовыйДокумент.ВалютаДенежныхСредств           = ВалютаЗаполнения;//ПолучитьВалюту(Транзакция.DocumentDestinationCurrency);
			//НовыйДокумент.ВводНачальныхОстатков         = Транзакция;
			НовыйДокумент.ВидОперации               		= Транзакция.ВидОперации;
			//Если Сотрудник Тогда
			//	//НовыйДокумент.ВидОперации               = Перечисления.ВидыОперацийППВходящее.ОплатаДенежныхСредствПодотчетником;
			//	НовыйДокумент.ВидОперации               = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника;
			//	Если ТорговыйПредставитель Тогда
			//		//НовыйДокумент.ВидРасчета            = Справочники.ВидыРачетовСПодотчетниками.ПриемДенегОтПодотчетникаВКассу;	
			//	КонецЕсли;
			//	//НовыйДокумент.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаДенежныхСредствПодотчетником;
			//	НовыйДокумент.Статья					 = Справочники.СтатьиДвиженияДенежныхСредств.Прочее;//ОплатаДенежныхСредствПодотчетником;
			//Иначе
			//	НовыйДокумент.ВидОперации               = Транзакция.ВидОперации; //Перечисления.ВидыОперацийППВходящее.ОплатаПокупателя;
			//КонецЕсли;
			//НовыйДокумент.ВидОплаты                     = Транзакция;
			//НовыйДокумент.ВидРасчета                    = Транзакция;
			НовыйДокумент.Статья					 	= Справочники.СтатьиДвиженияДенежныхСредств.Прочее;
			НовыйДокумент.Дата                          = Транзакция.EntryDate;
			//НовыйДокумент.ДатаОплаты                    = Транзакция.EntryDate;
			НовыйДокумент.ДатаВходящегоДокумента        = Транзакция.EntryDate;
			//НовыйДокумент.ДокументРасчета               = Транзакция;
			//НовыйДокумент.Комисионные                   = Транзакция;
			НовыйДокумент.Комментарий                   = Транзакция.EntryComment;
			
			НовыйДокумент.ВариантЗаполненияРасшифровки	= Перечисления.ВариантыЗаполненияРасшифровкиПлатежа.Автоматически;
			//НовыйДокумент.КратностьДокумента            = 1;
			НовыйДокумент.Кратность			            = 1;
			//НовыйДокумент.КурсДокумента                 = Число(Транзакция.DocumentRate);
			НовыйДокумент.Курс			                = ?(Транзакция.DocumentRate = "", 1, Число(Транзакция.DocumentRate));
			НовыйДокумент.НазначениеПлатежа             = Транзакция.DocumentNomination;
			//НовыйДокумент.Налог                         = Транзакция;
			//НовыйДокумент.НомерПлатежа                  = Транзакция;
			НовыйДокумент.Оплачено                      = Истина;
			НовыйДокумент.Организация                   = Объект.Организация;//УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Неопределено);//УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ОбщегоНазначения.ТекущийПользователь(), "ОсновнаяОрганизация");//ПолучитьОрганизацию("404411908");
			//НовыйДокумент.Ответственный                 = ОбщегоНазначения.ТекущийПользователь();
			НовыйДокумент.Автор			                = ПараметрыСеанса.ТекущийПользователь;//ОбщегоНазначения.ТекущийПользователь();
			//НовыйДокумент.ДоговорДляЗачетаАвансаСПомощником= Транзакция.ДоговорКонтрагента;
			НовДог = НовыйДокумент.ДоговорыАвтоЗачетаДолгов.Добавить();
			НовДог.Договор = Транзакция.ДоговорКонтрагента;
			//НовДог.НомерСтроки =1;
			НовДог.СуммаПлатежа = Число(Транзакция.EntryAmountCredit);
			//НовыйДокумент.СтатьяДвиженияДенежныхСредств = Транзакция;
			НовыйДокумент.СуммаДокумента                = Число(Транзакция.EntryAmountCredit);
			СтрокаРасшифровки = НовыйДокумент.РасшифровкаПлатежа.Добавить();
			//Если ТипЗнч(НовыйДокумент.Контрагент) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(НовыйДокумент.Контрагент) Тогда 
				СтрокаРасшифровки.Договор = Транзакция.ДоговорКонтрагента;//ПолучитьДоговорКонтрагента(НовыйДокумент.Контрагент);
				СтрокаРасшифровки.ПризнакАванса = Истина;
			//КонецЕсли;
			
			ПриИзмененииСуммыПоступленияНаССчет(НовыйДокумент);
			//НовыйДокумент.СуммаНДФЛ                     = Транзакция;
			НовыйДокумент.СчетКонтрагента               = Транзакция.СчетКонтрагента;//Справочники.БанковскиеСчета.НайтиПоНаименованию(Транзакция.SenderAccountNumber,,,Контрагент);
			//НовыйДокумент.СчетОрганизации               = ПолучитьСчетОрганизации(Лев(Транзакция.BeneficiaryAccountNumber, 22), Транзакция.BeneficiaryAccountNumber, Транзакция.DocumentDestinationCurrency);
			НовыйДокумент.БанковскийСчет                = Объект.СчетДляППВ;//ПолучитьСчетОрганизации(Лев(Транзакция.BeneficiaryAccountNumber, 22), Транзакция.BeneficiaryAccountNumber, Транзакция.DocumentDestinationCurrency);
			НовыйДокумент.EntryId                       = СтрЗаменить(СтрЗаменить(СтрЗаменить(Транзакция.EntryId,",",""),Символы.НПП,""), " ", "");
			
			
			НовыйДокумент.Корреспонденция 				= Транзакция.Корреспонденция;
			НовыйДокумент.КорреспонденцияРегл			= Транзакция.КорреспонденцияРегл;
			НовыйДокумент.Статья						= Транзакция.Статья;
			НовыйДокумент.ЗагруженоИзБанка				= Истина;
			
			НовыйДокумент.Записать();
			КолВоСозданныхДокументов = КолВоСозданныхДокументов + 1;
			
			НаборЗаписейУИДДокумента = РегистрыСведений.УИДДокументовВИнтернетБанке.СоздатьНаборЗаписей();
			НаборЗаписейУИДДокумента.Отбор.ДокументСсылка.Установить(НовыйДокумент.Ссылка);
			НаборЗаписейУИДДокумента.Отбор.Сотрудник.Установить(Справочники.Сотрудники.ПустаяСсылка());
			НаборЗаписейУИДДокумента.Отбор.Банк.Установить(Объект.Банк);
			
			НовыйУИД = НаборЗаписейУИДДокумента.Добавить();
			НовыйУИД.ДокументСсылка = НовыйДокумент.Ссылка;
			НовыйУИД.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
			НовыйУИД.Банк = Объект.Банк;
			НовыйУИД.УИДДокументаВБанке = НовыйДокумент.EntryId;
			НовыйУИД.Выгружен = Истина;
			
			НаборЗаписейУИДДокумента.Записать();
			
			// Запись нового статуса
			НаборЗаписейСтатусовДокумента = РегистрыСведений.СтатусыДокументовВИнтернетБанке.СоздатьНаборЗаписей();
			НаборЗаписейСтатусовДокумента.Отбор.ДокументСсылка.Установить(НовыйДокумент.Ссылка);
			НаборЗаписейСтатусовДокумента.Отбор.Сотрудник.Установить(Справочники.Сотрудники.ПустаяСсылка());
			НаборЗаписейСтатусовДокумента.Отбор.Период.Установить(ТекущаяДата());
			НаборЗаписейСтатусовДокумента.Отбор.Банк.Установить(Объект.Банк);
			
			НовыйСтатус = НаборЗаписейСтатусовДокумента.Добавить();
			НовыйСтатус.ДокументСсылка = НовыйДокумент.Ссылка;
			НовыйСтатус.Период = ТекущаяДата();
			НовыйСтатус.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
			НовыйСтатус.СтатусДокументаВИнтернетБанке = Перечисления.СтатусыДокументовВИнтернетБанке.ЗагруженИзИнтернетБанка;
			НовыйСтатус.Банк = Объект.Банк;
			
			НаборЗаписейСтатусовДокумента.Записать();
			
			Если ПытатьсяПровестиДокумент Тогда 
				Попытка
					НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					Транзакция.Проведен = Истина;
				Исключение
					а=1;
				КонецПопытки;
				
			КонецЕсли;
			Транзакция.СозданныйДокумент = НовыйДокумент.Ссылка;
			
		КонецЕсли;	
		
		Если СуществуетДокумент И Транзакция.Пометка Тогда
			
			СозданныйДокумент = ПолучитьСуществующийДокумент(Транзакция.EntryId);
			
			НоваяСтрока = ТаблицаСозданныхДокументов.Добавить();
			НоваяСтрока.ДокументСсылка = СозданныйДокумент;
			НоваяСтрока.EntryId = Транзакция.EntryId;
			
			МассивНомеровСтрок.Добавить(Транзакция.НомерСтроки);			
			КоличествоПовторныхПопыток = КоличествоПовторныхПопыток + 1;
		КонецЕсли;	
		
		Для Каждого СтрокаТЧ ИЗ Объект.ПлатежныеПорученияВходящие Цикл
			Для Каждого Строка ИЗ ТаблицаСозданныхДокументов Цикл 			
				Если СтрокаТЧ.EntryId = Строка.EntryId Тогда 
					СтрокаТЧ.СозданныйДокумент = Строка.ДокументСсылка;
				КонецЕсли;
			КонецЦикла;	
			
			// Дозаполним поле контрагент
			СтруктураПоиска = Новый Структура("ИНН, Наименование", СокрЛП(СтрокаТЧ.SenderInn), СокрЛП(СтрокаТЧ.SenderName));
			
			МассивНайденныхСтрок = ТаблицаСозданныхКонтрагентов.НайтиСтроки(СтруктураПоиска);
			
			Если МассивНайденныхСтрок.Количество() <> 0 Тогда
				СтрокаТЧ.Контрагент = МассивНайденныхСтрок[0].Контрагент;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;	
	
	ТекстКолВоСозданныхДокументов = Нстр("ka='შექმნილია "+ КолВоСозданныхДокументов + " დოკუმენტი! ';ru='Создано "+ КолВоСозданныхДокументов + " документа/ов'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстКолВоСозданныхДокументов,,Объект,, ЛОЖЬ);
	
	Если КоличествоПовторныхПопыток > 0 Тогда 		
		Для Каждого ЭлементМассива ИЗ МассивНомеровСтрок Цикл 
			ТекстКолВоСозданныхДокументов = Нстр("ka='სტრიქონისთვის № "+ ЭлементМассива + " არ შეიქმნა დოკუმენტი, რადგან ამ ჩანაწერისთვის სისტემაში უკვე არსებობს დოკუმენტი! ';ru='Для строки № "+ ЭлементМассива + " не создано документа, так как для этой записи в системе уже создан документ!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстКолВоСозданныхДокументов,,Объект,, ЛОЖЬ);		
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДоговорКонтрагента(Владелец)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Владелец
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий(); 
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

&НаСервере
Процедура ПриИзмененииСуммыПоступленияНаССчет(Объект)
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаДенежныхСредств));
	
	Курс = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	Кратность = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
		
	Если Объект.РасшифровкаПлатежа.Количество() = 1 И
		НЕ (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя") И 
		Объект.ВариантЗаполненияРасшифровки = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияРасшифровкиПлатежа.СПомощником")) Тогда
	 
		СтрокаТабличнойЧасти = Объект.РасшифровкаПлатежа[0];
		
		СтрокаТабличнойЧасти.СуммаПлатежа = Объект.СуммаДокумента;
			СтрокаТабличнойЧасти.Курс = ?(
			СтрокаТабличнойЧасти.Курс = 0,
			1,
		СтрокаТабличнойЧасти.Курс
		);
		
		СтрокаТабличнойЧасти.Кратность = ?(
			СтрокаТабличнойЧасти.Кратность = 0,
			1,
			СтрокаТабличнойЧасти.Кратность
		);
		
		СтрокаТабличнойЧасти.СуммаРасчетов = ПересчитатьИзВалютыВВалюту(
			СтрокаТабличнойЧасти.СуммаПлатежа,
			Курс,
			СтрокаТабличнойЧасти.Курс,
			Кратность,
			СтрокаТабличнойЧасти.Кратность
		);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
			СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.НДС18;//СтавкаНДСПоУмолчанию;
		КонецЕсли;
		
		//СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса, СтрокаТабличнойЧасти.СуммаПлатежа, 0);
		
		РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
		
	КонецЕсли;
	
	РассчитатьСуммуУчета(Объект);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуУчета(Объект)
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Константы.ВалютаУчета.Получить()));
	
	КурсВалютыУчета = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	КратностьВалютыУчета = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
	Объект.Курс = ?(
		Объект.Курс = 0,
		1,
		Объект.Курс
	);
	Объект.Кратность = ?(
		Объект.Кратность = 0,
		1,
		Объект.Кратность
	);
	
	Объект.СуммаУчета = ПересчитатьИзВалютыВВалюту(
		Объект.СуммаДокумента,
		Объект.Курс,
		КурсВалютыУчета,
		Объект.Кратность,
		КратностьВалютыУчета
	);
	
КонецПроцедуры

&НаСервере
Функция ПересчитатьИзВалютыВВалюту(Сумма, КурсНач, КурсКон,	КратностьНач = 1, КратностьКон = 1) Экспорт
	
	Если (КурсНач = КурсКон) И (КратностьНач = КратностьКон) Тогда
		Возврат Сумма;
	КонецЕсли;
	
	Если КурсНач = 0 ИЛИ КурсКон = 0 ИЛИ КратностьНач = 0 ИЛИ КратностьКон = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='აღმოჩენილია ვალუტის ნულოვანი კურსი. გადათვლა არ შესრულდა.';ru='Обнаружен нулевой курс валюты. Пересчет не выполнен.';en='Discovered a zero rate. Adjustment is not performed.'");
		Сообщение.Сообщить();
		Возврат Сумма;
	КонецЕсли;
	
	СуммаПересчитанная = Окр((Сумма * КурсНач * КратностьКон) / (КурсКон * КратностьНач), 2);
	
	Возврат СуммаПересчитанная;
	
КонецФункции 

&НаСервере
Процедура РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаПлатежа - (СтрокаТабличнойЧасти.СуммаПлатежа) / ((СтавкаНДС + 100) / 100);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьIDВыпискиДляППВ()
	
	Если Не ЗначениеЗаполнено(Объект.СчетДляППВ) Тогда 		
		ТекстСообщения = НСтр("ka='ანგარიში არის აუცილებლად შესავსები ველი!';ru='Счет обязателен для заполнения!';en='Account mandatory to fill in!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Объект,, Истина);	
		Возврат;
	КонецЕсли;	
	
	//Если ЗначениеЗаполнено(Объект.До) И ЗначениеЗаполнено(Объект.От) Тогда
	Если ЗначениеЗаполнено(ПериодВходящиеДоументы.ДатаОкончания) И ЗначениеЗаполнено(ПериодВходящиеДоументы.ДатаНачала) Тогда
		//Если Не Объект.ДатаНачалаВыписки <= Объект.ДатаОкончанияВыписки Тогда 
		//	ТекстСообщения = НСтр("ka='დაწყების თარიღი არ უნდა იყოს დასრულების თარიღზე მეტი ან ტოლი!';ru='Дата начала не может быть больше или ровна дате окончания!';en='Start date can not be greater than or equal to the end date!'");
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Объект,, Истина);
		//	Возврат;
		//КонецЕсли;
	Иначе 
		ТекстСообщения = НСтр("ka='დაწყების თარიღი და დასრულების თარიღი აუცილებლად შესავსები ველებია!';ru='Дата начала и дата окончания обязательны для заполнения!';en='Start date and end date are required!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Объект,, Истина);	
		Возврат;
	КонецЕсли;	
	
	МенеджерОбработки = Обработки.ИнтеграцияСБанком;	
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("currency", Объект.СчетДляППВ.ВалютаДенежныхСредств);
	ПараметрыЗапроса.Вставить("accountNumber", Лев(Объект.СчетДляППВ.НомерСчета, 22));
	ПараметрыЗапроса.Вставить("startDate", ДельтаНСФ.ДатаВСтроку(ПериодВходящиеДоументы.ДатаНачала));
	ПараметрыЗапроса.Вставить("endDate", ДельтаНСФ.ДатаВСтроку(ПериодВходящиеДоументы.ДатаОкончания));
	
	IDИКоличествоСтрок = МенеджерОбработки.ВыполнитьМетодСервиса("api/statement/", ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
	
	Если Не IDИКоличествоСтрок = Неопределено Тогда 
		IDВыписки = СтрЗаменить(IDИКоличествоСтрок.ID, ",", "");
		КоличествоСтрок  = СтрЗаменить(IDИКоличествоСтрок.Count, ",", "");
		IDВыпискиПолучен = Истина;
		НомерСтраницыППВ = ?(Цел(КоличествоСтрок / 1000) < КоличествоСтрок / 1000, Цел(КоличествоСтрок / 1000) + 1, Цел(КоличествоСтрок / 1000));
		ПоследняяСтраница = НомерСтраницыППВ;
		УстановитьВидимость();
	КонецЕсли;
	
	Если IDВыпискиПолучен Тогда 
		ЗаполнитьТЧПлатежныеПорученияВходящие();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧПлатежныеПорученияВходящие()	
	
	МенеджерОбработки = Обработки.ИнтеграцияСБанком;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("currency", Объект.СчетДляППВ.ВалютаДенежныхСредств);
	ПараметрыЗапроса.Вставить("accountNumber", Лев(Объект.СчетДляППВ.НомерСчета, 22));
	ПараметрыЗапроса.Вставить("id", IDВыписки);
	ПараметрыЗапроса.Вставить("page", НомерСтраницыППВ);
	
	МассивЗаписей = МенеджерОбработки.ВыполнитьМетодСервиса("api/statement////", ПараметрыЗапроса, Режим, Токен, Объект.ЗапускатьРеальныйБанк);
	
	Объект.ПлатежныеПорученияВходящие.Очистить();
	
	КопияТЧ = Объект.ПлатежныеПорученияВходящие.Выгрузить().Скопировать();
	КопияТЧ.Колонки.Удалить("ВидОперации");
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийРасходСоСчета"));//Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийРасходСоСчета"));
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийПоступлениеНаСчет"));//Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоступлениеНаСчет"));
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийКонвертация"));
	
	КопияТЧ.Колонки.Добавить("ВидОперации",	Новый ОписаниеТипов(МассивТипов));
	
	ТаблицаСчетовСтатейВходящие = СчетаУчетаПоУмолчаниюВходящие.Выгрузить();
	ТаблицаСчетовСтатейРасход = СчетаУчетаПоУмолчаниюРасход.Выгрузить();
	
	Если Не МассивЗаписей = Неопределено Тогда 
		Если МассивЗаписей.Количество() > 0 Тогда 
			
			Для Каждого ЭлементМассива ИЗ МассивЗаписей Цикл
				
				НоваяСтрокаТЧ = КопияТЧ.Добавить();
				
				НоваяСтрокаТЧ.BeneficiaryName                    = ПреобразоватьКодировкиВСимволы(ЭлементМассива.Получить("BeneficiaryDetails").Получить("Name"));
				НоваяСтрокаТЧ.BeneficiaryBankName                = ПреобразоватьКодировкиВСимволы(ЭлементМассива.Получить("BeneficiaryDetails").Получить("BankName"));
				НоваяСтрокаТЧ.BeneficiaryAccountNumber           = ЭлементМассива.Получить("BeneficiaryDetails").Получить("AccountNumber");
				НоваяСтрокаТЧ.BeneficiaryBankCode                = ЭлементМассива.Получить("BeneficiaryDetails").Получить("BankCode");
				НоваяСтрокаТЧ.BeneficiaryInn                     = ЭлементМассива.Получить("BeneficiaryDetails").Получить("Inn");	
				НоваяСтрокаТЧ.SenderName                         = ПреобразоватьКодировкиВСимволы(ЭлементМассива.Получить("SenderDetails").Получить("Name"));
				НоваяСтрокаТЧ.SenderBankName                     = ПреобразоватьКодировкиВСимволы(ЭлементМассива.Получить("SenderDetails").Получить("BankName"));
				НоваяСтрокаТЧ.SenderAccountNumber                = ЭлементМассива.Получить("SenderDetails").Получить("AccountNumber");
				НоваяСтрокаТЧ.SenderBankCode                     = ЭлементМассива.Получить("SenderDetails").Получить("BankCode");
				НоваяСтрокаТЧ.SenderInn                          = ЭлементМассива.Получить("SenderDetails").Получить("Inn");						
				НоваяСтрокаТЧ.DocumentActualDate                 = ЭлементМассива.Получить("DocumentActualDate");				
				НоваяСтрокаТЧ.DocumentBeneficiaryInstitution     = ЭлементМассива.Получить("DocumentBeneficiaryInstitution");
				НоваяСтрокаТЧ.DocumentBranch                     = ЭлементМассива.Получить("DocumentBranch");
				НоваяСтрокаТЧ.DocumentCorrespondentAccountNumber = ЭлементМассива.Получить("DocumentCorrespondentAccountNumber");
				НоваяСтрокаТЧ.DocumentCorrespondentBankCode      = ЭлементМассива.Получить("DocumentCorrespondentBankCode");
				НоваяСтрокаТЧ.DocumentCorrespondentBankName      = ПреобразоватьКодировкиВСимволы(ЭлементМассива.Получить("DocumentCorrespondentBankName"));
				НоваяСтрокаТЧ.DocumentDepartment                 = ЭлементМассива.Получить("DocumentDepartment");
				НоваяСтрокаТЧ.DocumentDestinationAmount          = ЭлементМассива.Получить("DocumentDestinationAmount");
				НоваяСтрокаТЧ.DocumentDestinationCurrency        = ЭлементМассива.Получить("DocumentDestinationCurrency");
				НоваяСтрокаТЧ.DocumentExpiryDate                 = ЭлементМассива.Получить("DocumentExpiryDate");
				НоваяСтрокаТЧ.DocumentIntermediaryInstitution    = ЭлементМассива.Получить("DocumentIntermediaryInstitution");
				НоваяСтрокаТЧ.DocumentInformation                = ПреобразоватьКодировкиВСимволы(ЭлементМассива.Получить("DocumentInformation"));
				НоваяСтрокаТЧ.DocumentKey                        = СтрЗаменить(СтрЗаменить(СтрЗаменить(ЭлементМассива.Получить("DocumentKey"),",","")," ", ""),Символы.НПП,"");
				НоваяСтрокаТЧ.DocumentNomination                 = ПреобразоватьКодировкиВСимволы(ЭлементМассива.Получить("DocumentNomination"));
				НоваяСтрокаТЧ.DocumentPayee                      = ЭлементМассива.Получить("DocumentPayee");
				НоваяСтрокаТЧ.DocumentProductGroup               = ЭлементМассива.Получить("DocumentProductGroup");
				НоваяСтрокаТЧ.DocumentRate                       = ЭлементМассива.Получить("DocumentRate");
				НоваяСтрокаТЧ.DocumentRateLimit                  = ЭлементМассива.Получить("DocumentRateLimit");
				НоваяСтрокаТЧ.DocumentReceiveDate                = ЭлементМассива.Получить("DocumentReceiveDate");
				НоваяСтрокаТЧ.DocumentRegistrationRate           = ЭлементМассива.Получить("DocumentRegistrationRate");
				НоваяСтрокаТЧ.DocumentSenderInstitution          = ЭлементМассива.Получить("DocumentSenderInstitution");
				НоваяСтрокаТЧ.DocumentSourceAmount               = ЭлементМассива.Получить("DocumentSourceAmount");
				НоваяСтрокаТЧ.DocumentSourceCurrency             = ЭлементМассива.Получить("DocumentSourceCurrency");
				НоваяСтрокаТЧ.DocumentTreasuryCode               = ЭлементМассива.Получить("DocumentTreasuryCode");
				НоваяСтрокаТЧ.DocumentValueDate                  = ЭлементМассива.Получить("DocumentValueDate");
				НоваяСтрокаТЧ.EntryAccountNumber                 = ЭлементМассива.Получить("EntryAccountNumber");
				НоваяСтрокаТЧ.EntryAccountPoint                  = ЭлементМассива.Получить("EntryAccountPoint");
				НоваяСтрокаТЧ.EntryAmountBase                    = ЭлементМассива.Получить("EntryAmountBase");
				НоваяСтрокаТЧ.EntryAmountCredit                  = ЭлементМассива.Получить("EntryAmountCredit");
				НоваяСтрокаТЧ.EntryAmountCreditBase              = ЭлементМассива.Получить("EntryAmountCreditBase");
				НоваяСтрокаТЧ.EntryAmountDebit				     = ЭлементМассива.Получить("EntryAmountDebit");
				НоваяСтрокаТЧ.EntryAmountDebitBase               = ЭлементМассива.Получить("EntryAmountDebitBase");
				НоваяСтрокаТЧ.EntryComment                       = ЭлементМассива.Получить("EntryComment");
				НоваяСтрокаТЧ.EntryDate                          = ДельтаНСФ.ПереводВДату(ЭлементМассива.Получить("EntryDate"));
				НоваяСтрокаТЧ.EntryDepartment                    = ЭлементМассива.Получить("EntryDepartment");
				НоваяСтрокаТЧ.EntryDocumentNumber                = ЭлементМассива.Получить("EntryDocumentNumber");
				НоваяСтрокаТЧ.EntryId			                 = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(ЭлементМассива.Получить("EntryId"))," ",""),",",""),Символы.НПП,"");
				Если Строка(ЭлементМассива.Получить("DocumentProductGroup")) = "COM" 
					ИЛИ Строка(ЭлементМассива.Получить("DocumentProductGroup")) = "FEE" Тогда 
					НоваяСтрокаТЧ.ВидОперации                        = Перечисления.ВидыОперацийРасходСоСчета.Прочее;
				ИначеЕсли Строка(ЭлементМассива.Получить("DocumentProductGroup")) = "CCO" Тогда 
					НоваяСтрокаТЧ.ВидОперации                        = Перечисления.ВидыОперацийКонвертация.СоСчета;
				Иначе 
					НоваяСтрокаТЧ.ВидОперации                        = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя;//Перечисления.ВидыОперацийППВходящее.ОплатаПокупателя;
				КонецЕсли;            
			КонецЦикла;				
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ТЗНастройкиВходящие.ВидОперации КАК ВидОперации,
			               |	ТЗНастройкиВходящие.Корреспонденция,
			               |	ТЗНастройкиВходящие.КорреспонденцияРегл,
			               |	ТЗНастройкиВходящие.Статья
			               |ПОМЕСТИТЬ ТаблицаНастройкиВходящие
			               |ИЗ
			               |	&ТаблицаСчетовСтатейВходящие КАК ТЗНастройкиВходящие
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ТЗНастройкиРасход.ВидОперации КАК ВидОперации,
			               |	ТЗНастройкиРасход.Корреспонденция,
			               |	ТЗНастройкиРасход.КорреспонденцияРегл,
			               |	ТЗНастройкиРасход.Статья
			               |ПОМЕСТИТЬ ТаблицаНастройкиРасход
			               |ИЗ
			               |	&ТаблицаСчетовСтатейРасход КАК ТЗНастройкиРасход
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	КопияТЧ.BeneficiaryName,
			               |	КопияТЧ.BeneficiaryBankName,
			               |	КопияТЧ.BeneficiaryAccountNumber,
			               |	КопияТЧ.BeneficiaryBankCode,
			               |	КопияТЧ.BeneficiaryInn,
			               |	КопияТЧ.SenderName,
			               |	КопияТЧ.SenderBankName,
			               |	КопияТЧ.SenderAccountNumber,
			               |	КопияТЧ.SenderBankCode,
			               |	КопияТЧ.SenderInn,
			               |	КопияТЧ.DocumentActualDate,
			               |	КопияТЧ.DocumentBeneficiaryInstitution,
			               |	КопияТЧ.DocumentBranch,
			               |	КопияТЧ.DocumentCorrespondentAccountNumber,
			               |	КопияТЧ.DocumentCorrespondentBankCode,
			               |	КопияТЧ.DocumentCorrespondentBankName,
			               |	КопияТЧ.DocumentDepartment,
			               |	КопияТЧ.DocumentDestinationAmount,
			               |	КопияТЧ.DocumentDestinationCurrency,
			               |	КопияТЧ.DocumentExpiryDate,
			               |	КопияТЧ.DocumentIntermediaryInstitution,
			               |	КопияТЧ.DocumentInformation,
			               |	КопияТЧ.DocumentKey,
			               |	КопияТЧ.DocumentNomination,
			               |	КопияТЧ.DocumentPayee,
			               |	КопияТЧ.DocumentProductGroup,
			               |	КопияТЧ.DocumentRate,
			               |	КопияТЧ.DocumentRateLimit,
			               |	КопияТЧ.DocumentReceiveDate,
			               |	КопияТЧ.DocumentRegistrationRate,
			               |	КопияТЧ.DocumentSenderInstitution,
			               |	КопияТЧ.DocumentSourceAmount,
			               |	КопияТЧ.DocumentSourceCurrency,
			               |	КопияТЧ.DocumentTreasuryCode,
			               |	КопияТЧ.DocumentValueDate,
			               |	КопияТЧ.EntryAccountNumber,
			               |	КопияТЧ.EntryAccountPoint,
			               |	КопияТЧ.EntryAmountBase,
			               |	КопияТЧ.EntryAmountCredit,
			               |	КопияТЧ.EntryAmountCreditBase,
			               |	КопияТЧ.EntryAmountDebit,
			               |	КопияТЧ.EntryAmountDebitBase,
			               |	КопияТЧ.EntryComment,
			               |	КопияТЧ.EntryDate,
			               |	КопияТЧ.EntryDepartment,
			               |	КопияТЧ.EntryDocumentNumber,
			               |	КопияТЧ.EntryId,
			               |	КопияТЧ.ВидОперации,
			               |	КопияТЧ.СозданныйДокумент,
			               |	ВЫБОР
			               |		КОГДА КопияТЧ.DocumentProductGroup = ""CCO""
			               |				ИЛИ КопияТЧ.DocumentProductGroup = ""COM""
			               |				ИЛИ КопияТЧ.DocumentProductGroup = ""FEE""
			               |			ТОГДА ЛОЖЬ
			               |		ИНАЧЕ ИСТИНА
			               |	КОНЕЦ КАК ЭтоПриход
			               |ПОМЕСТИТЬ КопияТЧ
			               |ИЗ
			               |	&КопияТЧ КАК КопияТЧ
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	УИДДокументовВИнтернетБанке.ДокументСсылка,
			               |	УИДДокументовВИнтернетБанке.Банк,
			               |	УИДДокументовВИнтернетБанке.УИДДокументаВБанке
			               |ПОМЕСТИТЬ ВТ_СозданныеДокументы
			               |ИЗ
			               |	РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
			               |ГДЕ
			               |	ПОДСТРОКА(УИДДокументовВИнтернетБанке.Банк.СВИФТБИК, 1, 8) = ""BAGAGE22""
			               |	И УИДДокументовВИнтернетБанке.УИДДокументаВБанке <> """"
			               |	И УИДДокументовВИнтернетБанке.УИДДокументаВБанке В
			               |			(ВЫБРАТЬ
			               |				а.EntryId
			               |			ИЗ
			               |				КопияТЧ КАК а)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	Контрагенты.Ссылка КАК Контрагент,
			               |	Контрагенты.ИНН,
			               |	Контрагенты.ДоговорПоУмолчанию КАК ДоговорКонтрагента,
			               |	1 КАК Приоритет
			               |ПОМЕСТИТЬ ВТ_КонтрагентыСотрудники
			               |ИЗ
			               |	Справочник.Контрагенты КАК Контрагенты
			               |ГДЕ
			               |	НЕ Контрагенты.ПометкаУдаления
			               |	И НЕ Контрагенты.ЭтоГруппа
			               |	И (Контрагенты.ИНН В
			               |				(ВЫБРАТЬ
			               |					а.BeneficiaryInn
			               |				ИЗ
			               |					КопияТЧ КАК а
			               |				ГДЕ
			               |					а.BeneficiaryInn <> """")
			               |			ИЛИ Контрагенты.ИНН В
			               |				(ВЫБРАТЬ
			               |					а.SenderInn
			               |				ИЗ
			               |					КопияТЧ КАК а
			               |				ГДЕ
			               |					а.SenderInn <> """"))
			               |	И Контрагенты.ИНН <> """"
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	Сотрудники.Ссылка,
			               |	Сотрудники.Физлицо.ИНН,
			               |	NULL,
			               |	2
			               |ИЗ
			               |	Справочник.Сотрудники КАК Сотрудники
			               |ГДЕ
			               |	НЕ Сотрудники.ПометкаУдаления
			               |	И НЕ Сотрудники.ЭтоГруппа
			               |	И Сотрудники.Физлицо.ИНН <> """"
			               |	И (Сотрудники.Физлицо.ИНН В
			               |				(ВЫБРАТЬ
			               |					а.BeneficiaryInn
			               |				ИЗ
			               |					КопияТЧ КАК а
			               |				ГДЕ
			               |					а.BeneficiaryInn <> """")
			               |			ИЛИ Сотрудники.Физлицо.ИНН В
			               |				(ВЫБРАТЬ
			               |					а.SenderInn
			               |				ИЗ
			               |					КопияТЧ КАК а
			               |				ГДЕ
			               |					а.SenderInn <> """"))
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	КодыКазначейства.Ссылка,
			               |	КодыКазначейства.ИНН,
			               |	NULL,
			               |	3
			               |ИЗ
			               |	Справочник.КодыКазначейства КАК КодыКазначейства
			               |ГДЕ
			               |	НЕ КодыКазначейства.ПометкаУдаления
			               |	И (КодыКазначейства.ИНН В
			               |				(ВЫБРАТЬ
			               |					а.BeneficiaryInn
			               |				ИЗ
			               |					КопияТЧ КАК а
			               |				ГДЕ
			               |					а.BeneficiaryInn <> """")
			               |			ИЛИ КодыКазначейства.ИНН В
			               |				(ВЫБРАТЬ
			               |					а.SenderInn
			               |				ИЗ
			               |					КопияТЧ КАК а
			               |				ГДЕ
			               |					а.SenderInn <> """"))
			               |	И КодыКазначейства.ИНН <> """"
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_КонтрагентыСотрудники.ИНН,
			               |	МИНИМУМ(ВТ_КонтрагентыСотрудники.Приоритет) КАК Приоритет
			               |ПОМЕСТИТЬ ВТ_КонтрагентыМинГрупИНН
			               |ИЗ
			               |	ВТ_КонтрагентыСотрудники КАК ВТ_КонтрагентыСотрудники
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВТ_КонтрагентыСотрудники.ИНН
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_КонтрагентыМинГрупИНН.ИНН,
			               |	ВТ_КонтрагентыСотрудники.Контрагент,
			               |	ВТ_КонтрагентыСотрудники.ДоговорКонтрагента
			               |ПОМЕСТИТЬ ВТ_КонтрагентыДляСвязи
			               |ИЗ
			               |	ВТ_КонтрагентыМинГрупИНН КАК ВТ_КонтрагентыМинГрупИНН
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтрагентыСотрудники КАК ВТ_КонтрагентыСотрудники
			               |		ПО ВТ_КонтрагентыМинГрупИНН.ИНН = ВТ_КонтрагентыСотрудники.ИНН
			               |			И ВТ_КонтрагентыМинГрупИНН.Приоритет = ВТ_КонтрагентыСотрудники.Приоритет
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	БанковскиеСчета.Ссылка,
			               |	БанковскиеСчета.Владелец,
			               |	БанковскиеСчета.НомерСчета,
			               |	БанковскиеСчета.ВалютаДенежныхСредств.Наименование
			               |ПОМЕСТИТЬ ВТ_БанковскиеСчетаДля
			               |ИЗ
			               |	Справочник.БанковскиеСчета КАК БанковскиеСчета
			               |ГДЕ
			               |	НЕ БанковскиеСчета.ПометкаУдаления
			               |	И ((ПОДСТРОКА(БанковскиеСчета.НомерСчета, 1, 22), БанковскиеСчета.ВалютаДенежныхСредств.Наименование) В
			               |				(ВЫБРАТЬ
			               |					ПОДСТРОКА(а.BeneficiaryAccountNumber, 1, 22),
			               |					а.DocumentDestinationCurrency
			               |				ИЗ
			               |					КопияТЧ КАК а
			               |				ГДЕ
			               |					а.BeneficiaryAccountNumber <> """")
			               |			ИЛИ (ПОДСТРОКА(БанковскиеСчета.НомерСчета, 1, 22), БанковскиеСчета.ВалютаДенежныхСредств.Наименование) В
			               |				(ВЫБРАТЬ
			               |					ПОДСТРОКА(а.SenderAccountNumber, 1, 22),
			               |					а.DocumentSourceCurrency
			               |				ИЗ
			               |					КопияТЧ КАК а
			               |				ГДЕ
			               |					а.SenderAccountNumber <> """"))
			               |	И БанковскиеСчета.НомерСчета <> """"
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	КопияТЧ.BeneficiaryName,
			               |	КопияТЧ.BeneficiaryBankName,
			               |	КопияТЧ.BeneficiaryAccountNumber,
			               |	КопияТЧ.BeneficiaryBankCode,
			               |	КопияТЧ.BeneficiaryInn,
			               |	КопияТЧ.SenderName,
			               |	КопияТЧ.SenderBankName,
			               |	КопияТЧ.SenderAccountNumber,
			               |	КопияТЧ.SenderBankCode,
			               |	КопияТЧ.SenderInn,
			               |	КопияТЧ.DocumentActualDate,
			               |	КопияТЧ.DocumentBeneficiaryInstitution,
			               |	КопияТЧ.DocumentBranch,
			               |	КопияТЧ.DocumentCorrespondentAccountNumber,
			               |	КопияТЧ.DocumentCorrespondentBankCode,
			               |	КопияТЧ.DocumentCorrespondentBankName,
			               |	КопияТЧ.DocumentDepartment,
			               |	КопияТЧ.DocumentDestinationAmount,
			               |	КопияТЧ.DocumentDestinationCurrency,
			               |	КопияТЧ.DocumentExpiryDate,
			               |	КопияТЧ.DocumentIntermediaryInstitution,
			               |	КопияТЧ.DocumentInformation,
			               |	КопияТЧ.DocumentKey,
			               |	КопияТЧ.DocumentNomination,
			               |	КопияТЧ.DocumentPayee,
			               |	КопияТЧ.DocumentProductGroup,
			               |	КопияТЧ.DocumentRate,
			               |	КопияТЧ.DocumentRateLimit,
			               |	КопияТЧ.DocumentReceiveDate,
			               |	КопияТЧ.DocumentRegistrationRate,
			               |	КопияТЧ.DocumentSenderInstitution,
			               |	КопияТЧ.DocumentSourceAmount,
			               |	КопияТЧ.DocumentSourceCurrency,
			               |	КопияТЧ.DocumentTreasuryCode,
			               |	КопияТЧ.DocumentValueDate,
			               |	КопияТЧ.EntryAccountNumber,
			               |	КопияТЧ.EntryAccountPoint,
			               |	КопияТЧ.EntryAmountBase,
			               |	КопияТЧ.EntryAmountCredit,
			               |	КопияТЧ.EntryAmountCreditBase,
			               |	КопияТЧ.EntryAmountDebit,
			               |	КопияТЧ.EntryAmountDebitBase,
			               |	КопияТЧ.EntryComment,
			               |	КопияТЧ.EntryDate,
			               |	КопияТЧ.EntryDepartment,
			               |	КопияТЧ.EntryDocumentNumber,
			               |	КопияТЧ.EntryId,
			               |	ВЫБОР
			               |		КОГДА ЕСТЬNULL(ВТ_СозданныеДокументы.ДокументСсылка, КопияТЧ.СозданныйДокумент) = КопияТЧ.СозданныйДокумент
			               |			ТОГДА КопияТЧ.ВидОперации
			               |		ИНАЧЕ ВТ_СозданныеДокументы.ДокументСсылка.ВидОперации
			               |	КОНЕЦ КАК ВидОперации,
			               |	ЕСТЬNULL(ВТ_СозданныеДокументы.ДокументСсылка, КопияТЧ.СозданныйДокумент) КАК СозданныйДокумент,
			               |	КопияТЧ.ЭтоПриход,
			               |	ВЫБОР
			               |		КОГДА ЕСТЬNULL(ВТ_СозданныеДокументы.ДокументСсылка, КопияТЧ.СозданныйДокумент) = КопияТЧ.СозданныйДокумент
			               |			ТОГДА ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
			               |		ИНАЧЕ ВЫБОР
			               |				КОГДА ВТ_СозданныеДокументы.ДокументСсылка ССЫЛКА Документ.Конвертация
			               |					ТОГДА ВТ_СозданныеДокументы.ДокументСсылка.Отправитель
			               |				ИНАЧЕ ВТ_СозданныеДокументы.ДокументСсылка.СчетКонтрагента
			               |			КОНЕЦ
			               |	КОНЕЦ КАК СчетКонтрагента,
			               |	ВЫБОР
			               |		КОГДА ЕСТЬNULL(ВТ_СозданныеДокументы.ДокументСсылка, КопияТЧ.СозданныйДокумент) = КопияТЧ.СозданныйДокумент
			               |			ТОГДА ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
			               |		ИНАЧЕ ВЫБОР
			               |				КОГДА ВТ_СозданныеДокументы.ДокументСсылка ССЫЛКА Документ.Конвертация
			               |					ТОГДА ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
			               |				ИНАЧЕ ВТ_СозданныеДокументы.ДокументСсылка.ДоговорДляЗачетаАвансаСПомощником
			               |			КОНЕЦ
			               |	КОНЕЦ КАК ДоговорКонтрагента,
			               |	ВЫБОР
			               |		КОГДА ЕСТЬNULL(ВТ_СозданныеДокументы.ДокументСсылка, КопияТЧ.СозданныйДокумент) = КопияТЧ.СозданныйДокумент
			               |			ТОГДА ЛОЖЬ
			               |		ИНАЧЕ ВТ_СозданныеДокументы.ДокументСсылка.Проведен
			               |	КОНЕЦ КАК Проведен,
			               |	ВЫБОР
			               |		КОГДА ЕСТЬNULL(ВТ_СозданныеДокументы.ДокументСсылка, КопияТЧ.СозданныйДокумент) = КопияТЧ.СозданныйДокумент
			               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
			               |		ИНАЧЕ ВЫБОР
			               |				КОГДА ВТ_СозданныеДокументы.ДокументСсылка ССЫЛКА Документ.Конвертация
			               |					ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
			               |				ИНАЧЕ ВЫБОР
			               |						КОГДА ВТ_СозданныеДокументы.ДокументСсылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
			               |								ИЛИ ВТ_СозданныеДокументы.ДокументСсылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
			               |								ИЛИ ВТ_СозданныеДокументы.ДокументСсылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника)
			               |								ИЛИ ВТ_СозданныеДокументы.ДокументСсылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником)
			               |							ТОГДА ВТ_СозданныеДокументы.ДокументСсылка.Подотчетник
			               |						ИНАЧЕ ВТ_СозданныеДокументы.ДокументСсылка.Контрагент
			               |					КОНЕЦ
			               |			КОНЕЦ
			               |	КОНЕЦ КАК Контрагент
			               |ПОМЕСТИТЬ ВТ_СДокументами
			               |ИЗ
			               |	КопияТЧ КАК КопияТЧ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СозданныеДокументы КАК ВТ_СозданныеДокументы
			               |		ПО КопияТЧ.EntryId = ВТ_СозданныеДокументы.УИДДокументаВБанке
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_СДокументами.BeneficiaryName,
			               |	ВТ_СДокументами.BeneficiaryBankName,
			               |	ВТ_СДокументами.BeneficiaryAccountNumber,
			               |	ВТ_СДокументами.BeneficiaryBankCode,
			               |	ВТ_СДокументами.BeneficiaryInn,
			               |	ВТ_СДокументами.SenderName,
			               |	ВТ_СДокументами.SenderBankName,
			               |	ВТ_СДокументами.SenderAccountNumber,
			               |	ВТ_СДокументами.SenderBankCode,
			               |	ВТ_СДокументами.SenderInn,
			               |	ВТ_СДокументами.DocumentActualDate,
			               |	ВТ_СДокументами.DocumentBeneficiaryInstitution,
			               |	ВТ_СДокументами.DocumentBranch,
			               |	ВТ_СДокументами.DocumentCorrespondentAccountNumber,
			               |	ВТ_СДокументами.DocumentCorrespondentBankCode,
			               |	ВТ_СДокументами.DocumentCorrespondentBankName,
			               |	ВТ_СДокументами.DocumentDepartment,
			               |	ВТ_СДокументами.DocumentDestinationAmount,
			               |	ВТ_СДокументами.DocumentDestinationCurrency,
			               |	ВТ_СДокументами.DocumentExpiryDate,
			               |	ВТ_СДокументами.DocumentIntermediaryInstitution,
			               |	ВТ_СДокументами.DocumentInformation,
			               |	ВТ_СДокументами.DocumentKey,
			               |	ВТ_СДокументами.DocumentNomination,
			               |	ВТ_СДокументами.DocumentPayee,
			               |	ВТ_СДокументами.DocumentProductGroup,
			               |	ВТ_СДокументами.DocumentRate,
			               |	ВТ_СДокументами.DocumentRateLimit,
			               |	ВТ_СДокументами.DocumentReceiveDate,
			               |	ВТ_СДокументами.DocumentRegistrationRate,
			               |	ВТ_СДокументами.DocumentSenderInstitution,
			               |	ВТ_СДокументами.DocumentSourceAmount,
			               |	ВТ_СДокументами.DocumentSourceCurrency,
			               |	ВТ_СДокументами.DocumentTreasuryCode,
			               |	ВТ_СДокументами.DocumentValueDate,
			               |	ВТ_СДокументами.EntryAccountNumber,
			               |	ВТ_СДокументами.EntryAccountPoint,
			               |	ВТ_СДокументами.EntryAmountBase,
			               |	ВТ_СДокументами.EntryAmountCredit,
			               |	ВТ_СДокументами.EntryAmountCreditBase,
			               |	ВТ_СДокументами.EntryAmountDebit,
			               |	ВТ_СДокументами.EntryAmountDebitBase,
			               |	ВТ_СДокументами.EntryComment,
			               |	ВТ_СДокументами.EntryDate,
			               |	ВТ_СДокументами.EntryDepartment,
			               |	ВТ_СДокументами.EntryDocumentNumber,
			               |	ВТ_СДокументами.EntryId,
			               |	ВТ_СДокументами.ВидОперации,
			               |	ВТ_СДокументами.СозданныйДокумент,
			               |	ВТ_СДокументами.ЭтоПриход,
			               |	ВТ_СДокументами.СчетКонтрагента,
			               |	ВЫБОР
			               |		КОГДА ВТ_СДокументами.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
			               |			ТОГДА ЕСТЬNULL(ВТ_КонтрагентыДляСвязи.ДоговорКонтрагента, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
			               |		ИНАЧЕ ВТ_СДокументами.ДоговорКонтрагента
			               |	КОНЕЦ КАК ДоговорКонтрагента,
			               |	ВТ_СДокументами.Проведен,
			               |	ВЫБОР
			               |		КОГДА ВТ_СДокументами.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
			               |				ИЛИ ВТ_СДокументами.Контрагент = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			               |			ТОГДА ЕСТЬNULL(ВТ_КонтрагентыДляСвязи.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
			               |		ИНАЧЕ ВТ_СДокументами.Контрагент
			               |	КОНЕЦ КАК Контрагент
			               |ПОМЕСТИТЬ ВТ_ДокиКонтрагенты
			               |ИЗ
			               |	ВТ_СДокументами КАК ВТ_СДокументами
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтрагентыДляСвязи КАК ВТ_КонтрагентыДляСвязи
			               |		ПО (ВЫБОР
			               |				КОГДА НЕ ВТ_СДокументами.ЭтоПриход
			               |					ТОГДА ВТ_СДокументами.BeneficiaryInn = ВТ_КонтрагентыДляСвязи.ИНН
			               |				КОГДА ВТ_СДокументами.ЭтоПриход
			               |					ТОГДА ВТ_СДокументами.SenderInn = ВТ_КонтрагентыДляСвязи.ИНН
			               |				ИНАЧЕ ЛОЖЬ
			               |			КОНЕЦ)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_ДокиКонтрагенты.BeneficiaryName,
			               |	ВТ_ДокиКонтрагенты.BeneficiaryBankName,
			               |	ВТ_ДокиКонтрагенты.BeneficiaryAccountNumber,
			               |	ВТ_ДокиКонтрагенты.BeneficiaryBankCode,
			               |	ВТ_ДокиКонтрагенты.BeneficiaryInn,
			               |	ВТ_ДокиКонтрагенты.SenderName,
			               |	ВТ_ДокиКонтрагенты.SenderBankName,
			               |	ВТ_ДокиКонтрагенты.SenderAccountNumber,
			               |	ВТ_ДокиКонтрагенты.SenderBankCode,
			               |	ВТ_ДокиКонтрагенты.SenderInn,
			               |	ВТ_ДокиКонтрагенты.DocumentActualDate,
			               |	ВТ_ДокиКонтрагенты.DocumentBeneficiaryInstitution,
			               |	ВТ_ДокиКонтрагенты.DocumentBranch,
			               |	ВТ_ДокиКонтрагенты.DocumentCorrespondentAccountNumber,
			               |	ВТ_ДокиКонтрагенты.DocumentCorrespondentBankCode,
			               |	ВТ_ДокиКонтрагенты.DocumentCorrespondentBankName,
			               |	ВТ_ДокиКонтрагенты.DocumentDepartment,
			               |	ВТ_ДокиКонтрагенты.DocumentDestinationAmount,
			               |	ВТ_ДокиКонтрагенты.DocumentDestinationCurrency,
			               |	ВТ_ДокиКонтрагенты.DocumentExpiryDate,
			               |	ВТ_ДокиКонтрагенты.DocumentIntermediaryInstitution,
			               |	ВТ_ДокиКонтрагенты.DocumentInformation,
			               |	ВТ_ДокиКонтрагенты.DocumentKey,
			               |	ВТ_ДокиКонтрагенты.DocumentNomination,
			               |	ВТ_ДокиКонтрагенты.DocumentPayee,
			               |	ВТ_ДокиКонтрагенты.DocumentProductGroup,
			               |	ВТ_ДокиКонтрагенты.DocumentRate,
			               |	ВТ_ДокиКонтрагенты.DocumentRateLimit,
			               |	ВТ_ДокиКонтрагенты.DocumentReceiveDate,
			               |	ВТ_ДокиКонтрагенты.DocumentRegistrationRate,
			               |	ВТ_ДокиКонтрагенты.DocumentSenderInstitution,
			               |	ВТ_ДокиКонтрагенты.DocumentSourceAmount,
			               |	ВТ_ДокиКонтрагенты.DocumentSourceCurrency,
			               |	ВТ_ДокиКонтрагенты.DocumentTreasuryCode,
			               |	ВТ_ДокиКонтрагенты.DocumentValueDate,
			               |	ВТ_ДокиКонтрагенты.EntryAccountNumber,
			               |	ВТ_ДокиКонтрагенты.EntryAccountPoint,
			               |	ВТ_ДокиКонтрагенты.EntryAmountBase,
			               |	ВТ_ДокиКонтрагенты.EntryAmountCredit,
			               |	ВТ_ДокиКонтрагенты.EntryAmountCreditBase,
			               |	ВТ_ДокиКонтрагенты.EntryAmountDebit,
			               |	ВТ_ДокиКонтрагенты.EntryAmountDebitBase,
			               |	ВТ_ДокиКонтрагенты.EntryComment,
			               |	ВТ_ДокиКонтрагенты.EntryDate,
			               |	ВТ_ДокиКонтрагенты.EntryDepartment,
			               |	ВТ_ДокиКонтрагенты.EntryDocumentNumber,
			               |	ВТ_ДокиКонтрагенты.EntryId,
			               |	ВТ_ДокиКонтрагенты.ВидОперации,
			               |	ВТ_ДокиКонтрагенты.СозданныйДокумент,
			               |	ВТ_ДокиКонтрагенты.ЭтоПриход,
			               |	ВЫБОР
			               |		КОГДА ВТ_ДокиКонтрагенты.СчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
			               |			ТОГДА ЕСТЬNULL(ВТ_БанковскиеСчетаДля.Ссылка, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка))
			               |		ИНАЧЕ ВТ_ДокиКонтрагенты.СчетКонтрагента
			               |	КОНЕЦ КАК СчетКонтрагента,
			               |	ВТ_ДокиКонтрагенты.ДоговорКонтрагента,
			               |	ВТ_ДокиКонтрагенты.Проведен,
			               |	ВТ_ДокиКонтрагенты.Контрагент
			               |ПОМЕСТИТЬ ВТ_ОбработаннаяВыписка
			               |ИЗ
			               |	ВТ_ДокиКонтрагенты КАК ВТ_ДокиКонтрагенты
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БанковскиеСчетаДля КАК ВТ_БанковскиеСчетаДля
			               |		ПО (ВЫБОР
			               |				КОГДА НЕ ВТ_ДокиКонтрагенты.ЭтоПриход
			               |					ТОГДА ПОДСТРОКА(ВТ_ДокиКонтрагенты.BeneficiaryAccountNumber, 1, 22) = ПОДСТРОКА(ВТ_БанковскиеСчетаДля.НомерСчета, 1, 22)
			               |				КОГДА ВТ_ДокиКонтрагенты.ЭтоПриход
			               |					ТОГДА ПОДСТРОКА(ВТ_ДокиКонтрагенты.SenderAccountNumber, 1, 22) = ПОДСТРОКА(ВТ_БанковскиеСчетаДля.НомерСчета, 1, 22)
			               |				ИНАЧЕ ЛОЖЬ
			               |			КОНЕЦ)
			               |			И (ВЫБОР
			               |				КОГДА НЕ ВТ_ДокиКонтрагенты.ЭтоПриход
			               |					ТОГДА ВТ_ДокиКонтрагенты.DocumentDestinationCurrency = ВТ_БанковскиеСчетаДля.ВалютаДенежныхСредствНаименование
			               |				КОГДА ВТ_ДокиКонтрагенты.ЭтоПриход
			               |					ТОГДА ВТ_ДокиКонтрагенты.DocumentSourceCurrency = ВТ_БанковскиеСчетаДля.ВалютаДенежныхСредствНаименование
			               |				ИНАЧЕ ЛОЖЬ
			               |			КОНЕЦ)
			               |			И (ВЫБОР
			               |				КОГДА ВТ_ДокиКонтрагенты.Контрагент ССЫЛКА Справочник.Сотрудники
			               |					ТОГДА ВТ_ДокиКонтрагенты.Контрагент.Физлицо.ИНН = ВТ_БанковскиеСчетаДля.Владелец.Физлицо.ИНН
			               |				ИНАЧЕ ВТ_ДокиКонтрагенты.Контрагент.ИНН = ВТ_БанковскиеСчетаДля.Владелец.ИНН
			               |			КОНЕЦ)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryName,
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryBankName,
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryAccountNumber,
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryBankCode,
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryInn,
			               |	ВТ_ОбработаннаяВыписка.SenderName,
			               |	ВТ_ОбработаннаяВыписка.SenderBankName,
			               |	ВТ_ОбработаннаяВыписка.SenderAccountNumber,
			               |	ВТ_ОбработаннаяВыписка.SenderBankCode,
			               |	ВТ_ОбработаннаяВыписка.SenderInn,
			               |	ВТ_ОбработаннаяВыписка.DocumentActualDate,
			               |	ВТ_ОбработаннаяВыписка.DocumentBeneficiaryInstitution,
			               |	ВТ_ОбработаннаяВыписка.DocumentBranch,
			               |	ВТ_ОбработаннаяВыписка.DocumentCorrespondentAccountNumber,
			               |	ВТ_ОбработаннаяВыписка.DocumentCorrespondentBankCode,
			               |	ВТ_ОбработаннаяВыписка.DocumentCorrespondentBankName,
			               |	ВТ_ОбработаннаяВыписка.DocumentDepartment,
			               |	ВТ_ОбработаннаяВыписка.DocumentDestinationAmount,
			               |	ВТ_ОбработаннаяВыписка.DocumentDestinationCurrency,
			               |	ВТ_ОбработаннаяВыписка.DocumentExpiryDate,
			               |	ВТ_ОбработаннаяВыписка.DocumentIntermediaryInstitution,
			               |	ВТ_ОбработаннаяВыписка.DocumentInformation,
			               |	ВТ_ОбработаннаяВыписка.DocumentKey,
			               |	ВТ_ОбработаннаяВыписка.DocumentNomination,
			               |	ВТ_ОбработаннаяВыписка.DocumentPayee,
			               |	ВТ_ОбработаннаяВыписка.DocumentProductGroup,
			               |	ВТ_ОбработаннаяВыписка.DocumentRate,
			               |	ВТ_ОбработаннаяВыписка.DocumentRateLimit,
			               |	ВТ_ОбработаннаяВыписка.DocumentReceiveDate,
			               |	ВТ_ОбработаннаяВыписка.DocumentRegistrationRate,
			               |	ВТ_ОбработаннаяВыписка.DocumentSenderInstitution,
			               |	ВТ_ОбработаннаяВыписка.DocumentSourceAmount,
			               |	ВТ_ОбработаннаяВыписка.DocumentSourceCurrency,
			               |	ВТ_ОбработаннаяВыписка.DocumentTreasuryCode,
			               |	ВТ_ОбработаннаяВыписка.DocumentValueDate,
			               |	ВТ_ОбработаннаяВыписка.EntryAccountNumber,
			               |	ВТ_ОбработаннаяВыписка.EntryAccountPoint,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountBase,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountCredit,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountCreditBase,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountDebit,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountDebitBase,
			               |	ВТ_ОбработаннаяВыписка.EntryComment,
			               |	ВТ_ОбработаннаяВыписка.EntryDate,
			               |	ВТ_ОбработаннаяВыписка.EntryDepartment,
			               |	ВТ_ОбработаннаяВыписка.EntryDocumentNumber,
			               |	ВТ_ОбработаннаяВыписка.EntryId,
			               |	ВТ_ОбработаннаяВыписка.ВидОперации,
			               |	ВТ_ОбработаннаяВыписка.СозданныйДокумент,
			               |	ВТ_ОбработаннаяВыписка.ЭтоПриход,
			               |	ВТ_ОбработаннаяВыписка.СчетКонтрагента,
			               |	ВТ_ОбработаннаяВыписка.ДоговорКонтрагента,
			               |	ВТ_ОбработаннаяВыписка.Проведен,
			               |	ВТ_ОбработаннаяВыписка.Контрагент,
			               |	ТаблицаНастройкиВходящие.Корреспонденция,
			               |	ТаблицаНастройкиВходящие.КорреспонденцияРегл,
			               |	ТаблицаНастройкиВходящие.Статья
			               |ИЗ
			               |	ВТ_ОбработаннаяВыписка КАК ВТ_ОбработаннаяВыписка
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНастройкиВходящие КАК ТаблицаНастройкиВходящие
			               |		ПО ВТ_ОбработаннаяВыписка.ВидОперации = ТаблицаНастройкиВходящие.ВидОперации
			               |ГДЕ
			               |	ПОДСТРОКА(ВТ_ОбработаннаяВыписка.BeneficiaryAccountNumber, 1, 22) = ПОДСТРОКА(&СчетОрганизации, 1, 22)
			               |	И ВЫБОР
			               |			КОГДА ВТ_ОбработаннаяВыписка.EntryAmountCredit = """"
			               |				ТОГДА 0
			               |			ИНАЧЕ 1
			               |		КОНЕЦ <> 0
			               |	И ВТ_ОбработаннаяВыписка.ЭтоПриход
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryName,
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryBankName,
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryAccountNumber,
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryBankCode,
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryInn,
			               |	ВТ_ОбработаннаяВыписка.SenderName,
			               |	ВТ_ОбработаннаяВыписка.SenderBankName,
			               |	ВТ_ОбработаннаяВыписка.SenderAccountNumber,
			               |	ВТ_ОбработаннаяВыписка.SenderBankCode,
			               |	ВТ_ОбработаннаяВыписка.SenderInn,
			               |	ВТ_ОбработаннаяВыписка.DocumentActualDate,
			               |	ВТ_ОбработаннаяВыписка.DocumentBeneficiaryInstitution,
			               |	ВТ_ОбработаннаяВыписка.DocumentBranch,
			               |	ВТ_ОбработаннаяВыписка.DocumentCorrespondentAccountNumber,
			               |	ВТ_ОбработаннаяВыписка.DocumentCorrespondentBankCode,
			               |	ВТ_ОбработаннаяВыписка.DocumentCorrespondentBankName,
			               |	ВТ_ОбработаннаяВыписка.DocumentDepartment,
			               |	ВТ_ОбработаннаяВыписка.DocumentDestinationAmount,
			               |	ВТ_ОбработаннаяВыписка.DocumentDestinationCurrency,
			               |	ВТ_ОбработаннаяВыписка.DocumentExpiryDate,
			               |	ВТ_ОбработаннаяВыписка.DocumentIntermediaryInstitution,
			               |	ВТ_ОбработаннаяВыписка.DocumentInformation,
			               |	ВТ_ОбработаннаяВыписка.DocumentKey,
			               |	ВТ_ОбработаннаяВыписка.DocumentNomination,
			               |	ВТ_ОбработаннаяВыписка.DocumentPayee,
			               |	ВТ_ОбработаннаяВыписка.DocumentProductGroup,
			               |	ВТ_ОбработаннаяВыписка.DocumentRate,
			               |	ВТ_ОбработаннаяВыписка.DocumentRateLimit,
			               |	ВТ_ОбработаннаяВыписка.DocumentReceiveDate,
			               |	ВТ_ОбработаннаяВыписка.DocumentRegistrationRate,
			               |	ВТ_ОбработаннаяВыписка.DocumentSenderInstitution,
			               |	ВТ_ОбработаннаяВыписка.DocumentSourceAmount,
			               |	ВТ_ОбработаннаяВыписка.DocumentSourceCurrency,
			               |	ВТ_ОбработаннаяВыписка.DocumentTreasuryCode,
			               |	ВТ_ОбработаннаяВыписка.DocumentValueDate,
			               |	ВТ_ОбработаннаяВыписка.EntryAccountNumber,
			               |	ВТ_ОбработаннаяВыписка.EntryAccountPoint,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountBase,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountCredit,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountCreditBase,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountDebit,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountDebitBase,
			               |	ВТ_ОбработаннаяВыписка.EntryComment,
			               |	ВТ_ОбработаннаяВыписка.EntryDate,
			               |	ВТ_ОбработаннаяВыписка.EntryDepartment,
			               |	ВТ_ОбработаннаяВыписка.EntryDocumentNumber,
			               |	ВТ_ОбработаннаяВыписка.EntryId,
			               |	ВТ_ОбработаннаяВыписка.ВидОперации,
			               |	ВТ_ОбработаннаяВыписка.СозданныйДокумент,
			               |	ВТ_ОбработаннаяВыписка.ЭтоПриход,
			               |	ВТ_ОбработаннаяВыписка.СчетКонтрагента,
			               |	ВТ_ОбработаннаяВыписка.ДоговорКонтрагента,
			               |	ВТ_ОбработаннаяВыписка.Проведен,
			               |	ВТ_ОбработаннаяВыписка.Контрагент,
			               |	ТаблицаНастройкиРасход.Корреспонденция,
			               |	ТаблицаНастройкиРасход.КорреспонденцияРегл,
			               |	ТаблицаНастройкиРасход.Статья
			               |ИЗ
			               |	ВТ_ОбработаннаяВыписка КАК ВТ_ОбработаннаяВыписка
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНастройкиРасход КАК ТаблицаНастройкиРасход
			               |		ПО ВТ_ОбработаннаяВыписка.ВидОперации = ТаблицаНастройкиРасход.ВидОперации
			               |ГДЕ
			               |	НЕ ВТ_ОбработаннаяВыписка.ЭтоПриход
			               |	И ВТ_ОбработаннаяВыписка.DocumentProductGroup <> ""CCO""
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryName,
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryBankName,
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryAccountNumber,
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryBankCode,
			               |	ВТ_ОбработаннаяВыписка.BeneficiaryInn,
			               |	ВТ_ОбработаннаяВыписка.SenderName,
			               |	ВТ_ОбработаннаяВыписка.SenderBankName,
			               |	ВТ_ОбработаннаяВыписка.SenderAccountNumber,
			               |	ВТ_ОбработаннаяВыписка.SenderBankCode,
			               |	ВТ_ОбработаннаяВыписка.SenderInn,
			               |	ВТ_ОбработаннаяВыписка.DocumentActualDate,
			               |	ВТ_ОбработаннаяВыписка.DocumentBeneficiaryInstitution,
			               |	ВТ_ОбработаннаяВыписка.DocumentBranch,
			               |	ВТ_ОбработаннаяВыписка.DocumentCorrespondentAccountNumber,
			               |	ВТ_ОбработаннаяВыписка.DocumentCorrespondentBankCode,
			               |	ВТ_ОбработаннаяВыписка.DocumentCorrespondentBankName,
			               |	ВТ_ОбработаннаяВыписка.DocumentDepartment,
			               |	ВТ_ОбработаннаяВыписка.DocumentDestinationAmount,
			               |	ВТ_ОбработаннаяВыписка.DocumentDestinationCurrency,
			               |	ВТ_ОбработаннаяВыписка.DocumentExpiryDate,
			               |	ВТ_ОбработаннаяВыписка.DocumentIntermediaryInstitution,
			               |	ВТ_ОбработаннаяВыписка.DocumentInformation,
			               |	ВТ_ОбработаннаяВыписка.DocumentKey,
			               |	ВТ_ОбработаннаяВыписка.DocumentNomination,
			               |	ВТ_ОбработаннаяВыписка.DocumentPayee,
			               |	ВТ_ОбработаннаяВыписка.DocumentProductGroup,
			               |	ВТ_ОбработаннаяВыписка.DocumentRate,
			               |	ВТ_ОбработаннаяВыписка.DocumentRateLimit,
			               |	ВТ_ОбработаннаяВыписка.DocumentReceiveDate,
			               |	ВТ_ОбработаннаяВыписка.DocumentRegistrationRate,
			               |	ВТ_ОбработаннаяВыписка.DocumentSenderInstitution,
			               |	ВТ_ОбработаннаяВыписка.DocumentSourceAmount,
			               |	ВТ_ОбработаннаяВыписка.DocumentSourceCurrency,
			               |	ВТ_ОбработаннаяВыписка.DocumentTreasuryCode,
			               |	ВТ_ОбработаннаяВыписка.DocumentValueDate,
			               |	ВТ_ОбработаннаяВыписка.EntryAccountNumber,
			               |	ВТ_ОбработаннаяВыписка.EntryAccountPoint,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountBase,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountCredit,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountCreditBase,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountDebit,
			               |	ВТ_ОбработаннаяВыписка.EntryAmountDebitBase,
			               |	ВТ_ОбработаннаяВыписка.EntryComment,
			               |	ВТ_ОбработаннаяВыписка.EntryDate,
			               |	ВТ_ОбработаннаяВыписка.EntryDepartment,
			               |	ВТ_ОбработаннаяВыписка.EntryDocumentNumber,
			               |	ВТ_ОбработаннаяВыписка.EntryId,
			               |	ВТ_ОбработаннаяВыписка.ВидОперации,
			               |	ВТ_ОбработаннаяВыписка.СозданныйДокумент,
			               |	ВТ_ОбработаннаяВыписка.ЭтоПриход,
			               |	ВТ_ОбработаннаяВыписка.СчетКонтрагента КАК СчетОтправителя,
			               |	ВТ_ОбработаннаяВыписка.ДоговорКонтрагента,
			               |	ВТ_ОбработаннаяВыписка.Проведен,
			               |	ВТ_ОбработаннаяВыписка.Контрагент,
			               |	ВТ_БанковскиеСчетаДля.Ссылка КАК СчетКонтрагента
			               |ИЗ
			               |	ВТ_ОбработаннаяВыписка КАК ВТ_ОбработаннаяВыписка
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БанковскиеСчетаДля КАК ВТ_БанковскиеСчетаДля
			               |		ПО (ПОДСТРОКА(ВТ_ОбработаннаяВыписка.SenderAccountNumber, 1, 22) = ПОДСТРОКА(ВТ_БанковскиеСчетаДля.НомерСчета, 1, 22))
			               |			И ВТ_ОбработаннаяВыписка.DocumentSourceCurrency = ВТ_БанковскиеСчетаДля.ВалютаДенежныхСредствНаименование
			               |			И (&ИННОрганизации = ВТ_БанковскиеСчетаДля.Владелец.ИНН)
			               |ГДЕ
			               |	НЕ ВТ_ОбработаннаяВыписка.ЭтоПриход
			               |	И ВТ_ОбработаннаяВыписка.DocumentProductGroup = ""CCO""";
						   
			
			Запрос.УстановитьПараметр("КопияТЧ",					КопияТЧ);
			Запрос.УстановитьПараметр("ФильтрСерого", 				ФильтрСерогоВходящие);
			Запрос.УстановитьПараметр("ФильтрКрасного", 			ФильтрКрасногоВходящие);
			Запрос.УстановитьПараметр("ФильтрЖолтого", 				ФильтрЖолтогоВходящие);
			Запрос.УстановитьПараметр("ФильтрЗеленого", 			ФильтрЗеленогоВходящие);
			Запрос.УстановитьПараметр("СчетОрганизации", 			Сред(ОБъект.СчетДляППВ.НомерСчета,1,22));
			Запрос.УстановитьПараметр("ИННОрганизации", 			Объект.Организация.ИНН);
			Запрос.УстановитьПараметр("ТаблицаСчетовСтатейВходящие",ТаблицаСчетовСтатейВходящие);
			Запрос.УстановитьПараметр("ТаблицаСчетовСтатейРасход", 	ТаблицаСчетовСтатейРасход);
			РезультатПакет = Запрос.ВыполнитьПакет();
			тзПриходы = РезультатПакет[11].Выгрузить();
			тзРасход = РезультатПакет[12].Выгрузить();
			тзКонвертации = РезультатПакет[13].Выгрузить();
			Объект.ПлатежныеПорученияВходящие.Загрузить(тзПриходы);//тзРезультат);
			Объект.ПлатежныеПорученияВходящиеРасходы.Загрузить(тзРасход);
			Объект.ПлатежныеПорученияВходящиеКонвертации.Загрузить(тзКонвертации);
			
			ОбновитьВидимость("");
			ОбновитьВидимость("Расходы");
			ОбновитьВидимость("Конвертации");
			
			Если тзПриходы.Количество() = 0 Тогда 			
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Для счета """+ Объект.СчетДляППВ +""" на указаный период не найдено входящих записей!'; ka = 'ანგარიშისთვის  """+ Объект.СчетДляППВ +""" მითითებულ პერიოდზე ვერ მოიძებნა შემოსვლის ოპერაციები!'");
				Сообщение.Сообщить();
			Иначе 
				КоличествоСтрок = тзПриходы.Количество();
				НомерСтраницыППВ = ?(Цел(КоличествоСтрок / 1000) < КоличествоСтрок / 1000, Цел(КоличествоСтрок / 1000) + 1, Цел(КоличествоСтрок / 1000));
				ПоследняяСтраница = НомерСтраницыППВ;
				УстановитьВидимость();
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СледующаяППВ(Команда)
	
	НомерСтраницыПред = НомерСтраницыППВ;
	НомерСтраницыППВ = ?(НомерСтраницыППВ + 1 > ПоследняяСтраница, НомерСтраницыППВ, НомерСтраницыППВ + 1);
	Если НомерСтраницыПред <> НомерСтраницыППВ Тогда 
		ЗаполнитьТЧПлатежныеПорученияВходящие();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущаяППВ(Команда)
	
	НомерСтраницыПред = НомерСтраницыППВ;
	НомерСтраницыППВ = ?(НомерСтраницыППВ = 1 ИЛИ НомерСтраницыППВ = 0, НомерСтраницыППВ, НомерСтраницыППВ - 1); 
	// если не измениласть страница нет смысла запусткат всю байду
	Если НомерСтраницыПред <> НомерСтраницыППВ Тогда 
		ЗаполнитьТЧПлатежныеПорученияВходящие();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиППВ(Команда)
	
	Модифицированность = Истина;
	Для Каждого СтрокаТЧ Из Объект.ПлатежныеПорученияВходящие Цикл
		СтрокаТЧ.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиППВ(Команда)
	
	Модифицированность = Истина;	
	Для Каждого СтрокаТЧ Из Объект.ПлатежныеПорученияВходящие Цикл
		СтрокаТЧ.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьФлажкиППВРасход(Команда)
	
	Модифицированность = Истина;
	Для Каждого СтрокаТЧ Из Объект.ПлатежныеПорученияВходящиеРасходы Цикл
		СтрокаТЧ.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиППВРасход(Команда)
	
	Модифицированность = Истина;	
	Для Каждого СтрокаТЧ Из Объект.ПлатежныеПорученияВходящиеРасходы Цикл
		СтрокаТЧ.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиППВКонвертации(Команда)
	
	Модифицированность = Истина;
	Для Каждого СтрокаТЧ Из Объект.ПлатежныеПорученияВходящиеКонвертации Цикл
		СтрокаТЧ.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиППВКонвертации(Команда)
	
	Модифицированность = Истина;	
	Для Каждого СтрокаТЧ Из Объект.ПлатежныеПорученияВходящиеКонвертации Цикл
		СтрокаТЧ.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКонтрагента(ИНН, Сотрудник = Ложь, ТорговыйПредставитель = Ложь)
	
	Если ИНН = "" Тогда Возврат Справочники.Контрагенты.ПустаяСсылка() КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Контрагент;
	
КонецФункции

&НаСервере
Функция ПолучитьКонтрагентаСотрудник(ИНН, ИскатьСотрудника = Неопределено)
	
	Если ИНН = "" Тогда Возврат Справочники.Контрагенты.ПустаяСсылка() КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Контрагент
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ИНН = &ИНН
	               |	И ВЫБОР
	               |			КОГДА &ИскатьСотрудника = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ НЕ &ИскатьСотрудника
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Сотрудники.Ссылка
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.Физлицо.ИНН = &ИНН
	               |	И ВЫБОР
	               |			КОГДА &ИскатьСотрудника = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ &ИскатьСотрудника
	               |		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("ИскатьСотрудника", ИскатьСотрудника);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Контрагент;
	
КонецФункции

&НаСервере
Функция ПолучитьОрганизацию(ИНН)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Организация;
	
КонецФункции

&НаСервере
Функция ПроверкаНаСуществованиеДанногоДокумента(EntryId)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПлатежноеПоручениеВходящее.Ссылка
	               |ПОМЕСТИТЬ ВТ_Ссылки
	               |ИЗ
	               |	Документ.ПоступлениеНаСчет КАК ПлатежноеПоручениеВходящее
	               |ГДЕ
	               |	ЕСТЬNULL(ПлатежноеПоручениеВходящее.EntryId, """") = &EntryId
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПлатежноеПоручениеВходящее.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	УИДДокументовВИнтернетБанке.ДокументСсылка
	               |ИЗ
	               |	РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
	               |ГДЕ
	               |	ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") = &EntryId
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Ссылки.Ссылка
	               |ИЗ
	               |	ВТ_Ссылки КАК ВТ_Ссылки";
	
	Запрос.УстановитьПараметр("EntryId", EntryId);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции

&НаСервере
Функция ПолучитьСчетОрганизации(НомерСчетаБезВалюты, НомерСчетаСВалютой, ВалютаСчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка КАК СчетОрганизации
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	(БанковскиеСчета.НомерСчета = &НомерСчетаСВалютой
	|			ИЛИ БанковскиеСчета.НомерСчета = &НомерСчетаБезВалюты)
	|	И БанковскиеСчета.ВалютаДенежныхСредств = &ВалютаСчета
	|	И НЕ БанковскиеСчета.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НомерСчетаСВалютой", НомерСчетаСВалютой);
	Запрос.УстановитьПараметр("НомерСчетаБезВалюты", НомерСчетаБезВалюты);
	Запрос.УстановитьПараметр("ВалютаСчета", ?(ТипЗнч(ВалютаСчета) = Тип("Строка"),ПолучитьВалюту(ВалютаСчета),ВалютаСчета));	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.СчетОрганизации;

КонецФункции

&НаСервере
Функция ПолучитьВалюту(Валюта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Валюты.Ссылка КАК Валюта
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Наименование = &Валюта";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Валюта;
	
КонецФункции

&НаСервере
Функция ПолучитьСуществующийДокумент(EntryId)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УИДДокументовВИнтернетБанке.ДокументСсылка
	               |ИЗ
	               |	РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
	               |ГДЕ
	               |	УИДДокументовВИнтернетБанке.УИДДокументаВБанке = &EntryId";
	
	Запрос.УстановитьПараметр("EntryId", EntryId);
	
	Результат = Запрос.Выполнить();	
	Выборка = Результат.Выбрать();	
	Выборка.Следующий();
	
	Возврат Выборка.ДокументСсылка;
	
КонецФункции

// ППВ

Функция ПолучитьIDПользователя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиПользователей.Значение КАК IDПользователяАппликацииBoG
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь = &Пользователь
	|	И НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.IDПользователяАппликацииBoG)";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.IDПользователяАппликацииBoG;	
	
КонецФункции

&НаСервере
Процедура ПроверкаТорговогоПредставителя(ТорговыйПредставитель, Сотрудник)

	Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник.ФизЛицо);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
				   //|	Пользователи.Сотрудник = &Сотрудник
				   |	Пользователи.Сотрудник.ФизическоеЛицо = &Сотрудник
	               |	И НЕ Пользователи.ПометкаУдаления
				   //|	И Пользователи.ТорговыйПредставитель
				   |";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		ТорговыйПредставитель = Истина;
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПлатежныеПорученияВходящиеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекСтрока = Элементы.ПлатежныеПорученияВходящие.ТекущиеДанные;
	ДокПлатежа = ТекСтрока.СозданныйДокумент;
	ТекСтрока.Проведен = ПолучитьПроведениеНаСервере(ДокПлатежа);
	ТекСтрока.Видимость = ОпределитьВидимость(ТекСтрока.СозданныйДокумент, ТекСтрока.Контрагент, ТекСтрока.ДоговорКонтрагента, ТекСтрока.СчетКонтрагента, "Входящие");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПроведениеНаСервере(ДокСсылка)
	
	Возврат ДокСсылка.Проведен
	
КонецФункции


&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	
	ИмяТаблицы = "";
	Если Найти(Элемент.Имя, "Расходы") <> 0 Тогда 
		ИмяТаблицы = "Расходы";
	ИначеЕсли Найти(Элемент.Имя, "Конвертации") <> 0 Тогда
		ИмяТаблицы = "Конвертации";
	Иначе
		ИмяТаблицы = ""; // просто Входящике
	КонецЕсли;
	
	ОбновитьВидимость(ИмяТаблицы);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимость(ИмяТаблицы)
	
	ОкончаниеФильтра = ?(ИмяТаблицы = "", "Входящие", ИмяТаблицы);
	
	Для Каждого Строк Из Объект["ПлатежныеПорученияВходящие" + ИмяТаблицы] Цикл
		
		СчетОтправителя = Неопределено;
		Если ИмяТаблицы = "Конвертации" Тогда 
			СчетОтправителя = Строк.СчетОтправителя;
		КонецЕсли;
		
		Строк.Видимость = ЛОЖЬ;
		Строк.Видимость = ОпределитьВидимость(Строк.СозданныйДокумент,Строк.Контрагент,Строк.ДоговорКонтрагента,Строк.СчетКонтрагента, ОкончаниеФильтра, СчетОтправителя);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьВидимость(ДокСсылка, Контрагент, Договор, БанковскийСчет, ИмяТаблицы, СчетОтправителя = Неопределено)
	                          
	Если ЭтаФорма["ФильтрЗеленого"+ИмяТаблицы] Тогда 
		
		Если ЗначениеЗаполнено(ДокСсылка) И ДокСсылка.Проведен Тогда 
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтаФорма["ФильтрСерого"+ИмяТаблицы] Тогда 
		
		Если ЗначениеЗаполнено(ДокСсылка) И НЕ ДокСсылка.Проведен Тогда 
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтаФорма["ФильтрКрасного"+ИмяТаблицы] Тогда 
		
		Если ИмяТаблицы = "Конвертации" Тогда 
			Если НЕ ЗначениеЗаполнено(ДокСсылка) 
				И (НЕ ЗначениеЗаполнено(БанковскийСчет) 
				ИЛИ НЕ ЗначениеЗаполнено(СчетОтправителя)) Тогда 
				
				Возврат Истина;
			КонецЕсли;
		Иначе
			
			Если НЕ ЗначениеЗаполнено(ДокСсылка) 
				И (НЕ ЗначениеЗаполнено(Контрагент)
				ИЛИ НЕ ЗначениеЗаполнено(Договор)
				ИЛИ НЕ ЗначениеЗаполнено(БанковскийСчет)) Тогда 
				
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтаФорма["ФильтрЖолтого"+ИмяТаблицы] Тогда 
		
		Если ИмяТаблицы = "Конвертации" Тогда 
			Если НЕ ЗначениеЗаполнено(ДокСсылка) 
				И ЗначениеЗаполнено(БанковскийСчет) 
				И ЗначениеЗаполнено(СчетОтправителя) Тогда 
				
				Возврат Истина;
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеЗаполнено(ДокСсылка) 
				И ЗначениеЗаполнено(Контрагент)
				И ЗначениеЗаполнено(Договор)
				И ЗначениеЗаполнено(БанковскийСчет) Тогда 
				
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЛОЖЬ;
	
КонецФункции

&НаСервере
Процедура ВнестиНовыйСтатусДокумента(ДатаЗаполнения, ДокументСсылка, СтатусСсылка, УИДДокуента, Сотрудник = Неопределено)
	
	Если Сотрудник = Неопределено Тогда 
		Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	НоборЗаписейСтатусыДокументовBOG = РегистрыСведений.СтатусыДокументовВИнтернетБанке.СоздатьНаборЗаписей();
	НоборЗаписейСтатусыДокументовBOG.Отбор.Период.Установить(ДатаЗаполнения);
	НоборЗаписейСтатусыДокументовBOG.Отбор.ДокументСсылка.Установить(ДокументСсылка);
	НоборЗаписейСтатусыДокументовBOG.Отбор.Сотрудник.Установить(Сотрудник);
	НоборЗаписейСтатусыДокументовBOG.Отбор.Банк.Установить(Объект.Банк);
	
	НоваяЗапись = НоборЗаписейСтатусыДокументовBOG.Добавить();
	НоваяЗапись.ДокументСсылка = ДокументСсылка;
	НоваяЗапись.Период = ДатаЗаполнения;
	НоваяЗапись.Банк = Объект.Банк;
	НоваяЗапись.СтатусДокументаВИнтернетБанке = СтатусСсылка;
	НоваяЗапись.Сотрудник = Сотрудник;
	
	НоборЗаписейСтатусыДокументовBOG.Записать();	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьУИДДокументаПоСсылке(ДокументСсылка, Сотрудник = Неопределено)
	
	Если Сотрудник = Неопределено Тогда 
		Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("ДокументСсылка, Сотрудник", ДокументСсылка, Сотрудник);
	НаборЗапичейУИД = РегистрыСведений.УИДДокументовВИнтернетБанке.СоздатьНаборЗаписей();
	НаборЗапичейУИД.Отбор.ДокументСсылка.Установить(ДокументСсылка);//СрезПоследних(ТекущаяДата(), СтруктураОтбора);
	НаборЗапичейУИД.Отбор.Сотрудник.Установить(Сотрудник);
	НаборЗапичейУИД.Банк.Сотрудник.Установить(Объект.Банк);
	НаборЗапичейУИД.Прочитать();
	
	Если НаборЗапичейУИД.Количество() > 0 Тогда 
		//Обновим статус
		Возврат НаборЗапичейУИД[0].УИДДокументаВБанке;
		
	Иначе
		
		Возврат "";
	КонецЕсли;
	
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруСтаатьиКорреспонденциюКонтрагентаПоВидуОперации(ИмяТаблицыНастройки, ВидОперации, КонтрагентСотрудник, ИННКонтрагента)
	
	СтруктураВозврата = Новый Структура("Корреспонденция, КорреспонденцияРегл, Статья, Контрагент, СчетКонтрагента, ДоговорКонтрагента");
	
	СтруктураОтбора = Новый Структура("ВидОперации", ВидОперации);
	
	МассивНайденныхСтрок = Новый Массив;
	Если ИмяТаблицыНастройки = "Входящие" Тогда 
		МассивНайденныхСтрок = СчетаУчетаПоУмолчаниюВходящие.НайтиСтроки(СтруктураОтбора);
	ИначеЕсли ИмяТаблицыНастройки = "Расход" Тогда 
		МассивНайденныхСтрок = СчетаУчетаПоУмолчаниюРасход.НайтиСтроки(СтруктураОтбора);
	КонецЕсли;
	
	Если МассивНайденныхСтрок.Количество() <> 0 Тогда 
		СтруктураВозврата.Корреспонденция 		= МассивНайденныхСтрок[0].Корреспонденция;
		СтруктураВозврата.КорреспонденцияРегл 	= МассивНайденныхСтрок[0].КорреспонденцияРегл;
		СтруктураВозврата.Статья 				= МассивНайденныхСтрок[0].Статья;
	КонецЕсли;
	
	НуженСотрудник = (ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника"));
	
	Если ВидОперации <> ПредыдущиеЗначениеВидаОперации Тогда 
		Если НуженСотрудник 
			И (ТипЗнч(КонтрагентСотрудник) = Тип("СправочникСсылка.Контрагенты") 
				ИЛИ НЕ ЗначениеЗаполнено(КонтрагентСотрудник)) Тогда 
			
			// 1-контрагент, 2-Сотрудник, 0-Любого найденного
			НайтиКонтрагентаСотрудникаПоИНН(ИННКонтрагента, 2, СтруктураВозврата); 
			
			Если СтруктураВозврата.Контрагент = Неопределено Тогда 
				СтруктураВозврата.Контрагент = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
			КонецЕсли;
			
		ИначеЕсли НЕ НуженСотрудник 
			И (ТипЗнч(КонтрагентСотрудник) = Тип("СправочникСсылка.Сотрудники") 
				ИЛИ НЕ ЗначениеЗаполнено(КонтрагентСотрудник)) Тогда 
			
			// 1-контрагент, 2-Сотрудник, 0-Любого найденного
			НайтиКонтрагентаСотрудникаПоИНН(ИННКонтрагента, 1, СтруктураВозврата); 
			
			Если СтруктураВозврата.Контрагент = Неопределено Тогда 
				СтруктураВозврата.Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
			КонецЕсли;
			
		Иначе 
			СтруктураВозврата.Контрагент = Неопределено;
		КонецЕсли;
	Иначе
		СтруктураВозврата.Контрагент = Неопределено;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
		
КонецФункции

&НаСервере
Процедура НайтиКонтрагентаСотрудникаПоИНН(ИННКонтрагента, ПриоритетеПоиска, СтруктураВозврата)
	
	СтруктураВозврата.Контрагент = Неопределено;
	СтруктураВозврата.СчетКонтрагента = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка");
	СтруктураВозврата.ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	1 КАК ПриоритетПоиска,
		|	Контрагенты.ДоговорПоУмолчанию,
		|	Контрагенты.БанковскийСчетПоУмолчанию
		|ПОМЕСТИТЬ ВТ_КонтрагентСотрудник
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИННКонтрагента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка,
		|	2,
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
		|	Сотрудники.БанковскийСчетПоУмолчанию
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Физлицо.ИНН = &ИННКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка,
		|	ДоговорыКонтрагентов.Владелец
		|ПОМЕСТИТЬ ВТ_Договра
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец В
		|			(ВЫБРАТЬ
		|				а.Ссылка
		|			ИЗ
		|				ВТ_КонтрагентСотрудник КАК а
		|			ГДЕ
		|				а.Ссылка ССЫЛКА Справочник.Контрагенты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	БанковскиеСчета.Ссылка,
		|	БанковскиеСчета.Владелец
		|ПОМЕСТИТЬ ВТ_БанковскиеСчета
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Владелец В
		|			(ВЫБРАТЬ
		|				а.Ссылка
		|			ИЗ
		|				ВТ_КонтрагентСотрудник КАК а)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КонтрагентСотрудник.Ссылка КАК Контрагент,
		|	ВТ_КонтрагентСотрудник.ПриоритетПоиска,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_КонтрагентСотрудник.ДоговорПоУмолчанию, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(ВТ_Договра.Ссылка, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
		|		ИНАЧЕ ВТ_КонтрагентСотрудник.ДоговорПоУмолчанию
		|	КОНЕЦ КАК ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_КонтрагентСотрудник.БанковскийСчетПоУмолчанию, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(ВТ_БанковскиеСчета.Ссылка, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка))
		|		ИНАЧЕ ВТ_КонтрагентСотрудник.БанковскийСчетПоУмолчанию
		|	КОНЕЦ КАК СчетКонтрагента
		|ИЗ
		|	ВТ_КонтрагентСотрудник КАК ВТ_КонтрагентСотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Договра КАК ВТ_Договра
		|		ПО ВТ_КонтрагентСотрудник.Ссылка = ВТ_Договра.Владелец
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БанковскиеСчета КАК ВТ_БанковскиеСчета
		|		ПО ВТ_КонтрагентСотрудник.Ссылка = ВТ_БанковскиеСчета.Владелец";
	
	Запрос.УстановитьПараметр("ИННКонтрагента", ИННКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ПриоритетеПоиска = 0 Тогда 
			СтруктураВозврата.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
			СтруктураВозврата.СчетКонтрагента = ВыборкаДетальныеЗаписи.СчетКонтрагента;
			СтруктураВозврата.ДоговорКонтрагента = ВыборкаДетальныеЗаписи.ДоговорКонтрагента;
			Прервать;
		ИначеЕсли ВыборкаДетальныеЗаписи.ПриоритетПоиска = ПриоритетеПоиска Тогда 
			СтруктураВозврата.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
			СтруктураВозврата.СчетКонтрагента = ВыборкаДетальныеЗаписи.СчетКонтрагента;
			СтруктураВозврата.ДоговорКонтрагента = ВыборкаДетальныеЗаписи.ДоговорКонтрагента;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеПорученияВходящиеВидОперацииПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПлатежныеПорученияВходящие.ТекущиеДанные;
	
	СтруктураНастройки = ПолучитьСтруктуруСтаатьиКорреспонденциюКонтрагентаПоВидуОперации("Входящие", ТекущаяСтрока.ВидОперации, ТекущаяСтрока.Контрагент, СокрЛП(ТекущаяСтрока.SenderInn));
	
	ТекущаяСтрока.Корреспонденция 		= СтруктураНастройки.Корреспонденция;
	ТекущаяСтрока.КорреспонденцияРегл   = СтруктураНастройки.КорреспонденцияРегл;
	ТекущаяСтрока.Статья                = СтруктураНастройки.Статья;
	
	// Если СтруктураНастройки.Контрагент <> Неопределено, то менять ничего не нужно
	Если СтруктураНастройки.Контрагент <> Неопределено Тогда 
		ТекущаяСтрока.Контрагент 		= СтруктураНастройки.Контрагент;
		ТекущаяСтрока.СчетКонтрагента   = СтруктураНастройки.СчетКонтрагента;
		ТекущаяСтрока.ДоговорКонтрагента= СтруктураНастройки.ДоговорКонтрагента;
	КонецЕсли;
	
	ПредыдущиеЗначениеВидаОперации = ТекущаяСтрока.ВидОперации;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеПорученияВходящиеРасходыВидОперацииПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПлатежныеПорученияВходящиеРасходы.ТекущиеДанные;
	
	СтруктураНастройки = ПолучитьСтруктуруСтаатьиКорреспонденциюКонтрагентаПоВидуОперации("Расход", ТекущаяСтрока.ВидОперации, ТекущаяСтрока.Контрагент, СокрЛП(ТекущаяСтрока.BeneficiaryInn));
	
	ТекущаяСтрока.Корреспонденция 		= СтруктураНастройки.Корреспонденция;
	ТекущаяСтрока.КорреспонденцияРегл   = СтруктураНастройки.КорреспонденцияРегл;
	ТекущаяСтрока.Статья                = СтруктураНастройки.Статья;
	
	// Если СтруктураНастройки.Контрагент <> Неопределено, то менять ничего не нужно
	Если СтруктураНастройки.Контрагент <> Неопределено Тогда 
		ТекущаяСтрока.Контрагент 		= СтруктураНастройки.Контрагент;
		ТекущаяСтрока.СчетКонтрагента   = СтруктураНастройки.СчетКонтрагента;
		ТекущаяСтрока.ДоговорКонтрагента= СтруктураНастройки.ДоговорКонтрагента;
	КонецЕсли;
	
	ПредыдущиеЗначениеВидаОперации = ТекущаяСтрока.ВидОперации;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаУчетаПоУмолчаниюВходящиеПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущаяСтрока = Элементы.СчетаУчетаПоУмолчаниюВходящие.ТекущиеДанные;
	
	Для Каждого Строк Из СчетаУчетаПоУмолчаниюВходящие Цикл 
		Если Строк <> ТекущаяСтрока Тогда 
			Если Строк.ВидОперации = ТекущаяСтрока.ВидОперации Тогда 
				Отказ = Истина;
				Сообщить(НСтр("ru = 'Вид операции: "+ ТекущаяСтрока.ВидОперации +" уже есть в таблице!'; ka = 'Вид операции: "+ ТекущаяСтрока.ВидОперации +" уже есть в таблице!'"));
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыРасходаНаСервере()
	
	КолВоСозданныхДокументов = 0;		
	КоличествоПовторныхПопыток = 0;
	
	МассивНомеровСтрок = Новый Массив;
	
	ТаблицаСозданныхДокументов = Новый ТаблицаЗначений;
	//ТаблицаСозданныхДокументов.Колонки.Добавить("ДокументСсылка", Новый ОписаниеТипов("ДокументСсылка.ПлатежноеПоручениеВходящее"));
	ТаблицаСозданныхДокументов.Колонки.Добавить("ДокументСсылка", Новый ОписаниеТипов("ДокументСсылка.РасходСоСчета"));
	ТаблицаСозданныхДокументов.Колонки.Добавить("EntryId", Новый ОписаниеТипов("Строка"));
	
	СтруктураЗаполненияКонтрагента = Новый Структура;
	
	СтруктураЗаполненияКонтрагента.Вставить("Покупатель", Истина);
	СтруктураЗаполненияКонтрагента.Вставить("ВестиРасчетыПоДоговорам", Истина);
	СтруктураЗаполненияКонтрагента.Вставить("ВестиРасчетыПоДокументам", Истина);
	СтруктураЗаполненияКонтрагента.Вставить("ВестиРасчетыПоЗаказам", Истина);
	СтруктураЗаполненияКонтрагента.Вставить("ВестиУчетОплатыПоСчетам", Истина);
	СтруктураЗаполненияКонтрагента.Вставить("ВидКонтрагента", Перечисления.ВидыКонтрагентов.ЮридическоеЛицо);
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаРасчетовСПокупателем", ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыСПокупателями"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаАвансовПокупателя", ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыПоАвансамПолученным"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаРасчетовСПоставщиком", ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыСПоставщиками"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаАвансовПоставщику", ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыПоАвансамВыданным"));
	СтруктураЗаполненияКонтрагента.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
	СтруктураЗаполненияКонтрагента.Вставить("ВидВыдачиНДФЛ", "7");
	
	СчетаУчета = РегламентированныйУчетСервер.ПолучитьСчетаКонтрагентаПоУмолчанию();	
	
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаРасчетовСПокупателемРегл", СчетаУчета.СчетУчетаРасчетовСПокупателемРегл);
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаАвансовПокупателяРегл", СчетаУчета.СчетУчетаАвансовПокупателяРегл);
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаРасчетовСПоставщикомРегл", СчетаУчета.СчетУчетаРасчетовСПоставщикомРегл);
	СтруктураЗаполненияКонтрагента.Вставить("СчетУчетаАвансовПоставщикуРегл", СчетаУчета.СчетУчетаАвансовПоставщикуРегл);
	
	СтруктураЗаполненияКонтрагента.Вставить("СчетРасчетовСПерсоналом", ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыСПерсоналомПоОплатеТруда"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетРасчетовСПодотчетниками", ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыСПодотчетниками"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетРасчетовПоПерерасходу", ПредопределенноеЗначение("ПланСчетов.Управленческий.ПерерасходПодотчетников"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетРасчетовСПерсоналомРегл", РегламентированныйУчетСервер.ПолучитьСчетПоНомеру("3130"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетРасчетовСПодотчетникамиРегл", РегламентированныйУчетСервер.ПолучитьСчетПоНомеру("1430"));
	СтруктураЗаполненияКонтрагента.Вставить("СчетРасчетовПоПерерасходуРегл", РегламентированныйУчетСервер.ПолучитьСчетПоНомеру("3160"));
	СтруктураЗаполненияКонтрагента.Вставить("Гражданство", Справочники.СтраныМира.НайтиПоКоду("GEO"));
	
	Для Каждого Транзакция ИЗ Объект.ПлатежныеПорученияВходящиеРасходы Цикл
		
		IDВходящегоДокумента = СтрЗаменить(СтрЗаменить(СтрЗаменить(Транзакция.EntryId,",",""),Символы.НПП,""), " ", "");
		СуществуетДокумент = ПроверкаНаСуществованиеДанногоДокумента(IDВходящегоДокумента);
		
		Если Транзакция.Пометка И НЕ ЗначениеЗаполнено(Транзакция.СозданныйДокумент) И Не СуществуетДокумент Тогда 
			
			ВалютаЗаполнения = ПолучитьВалюту(Транзакция.DocumentDestinationCurrency);
			Если СоздаватьКотрагентовИСчитаРасход Тогда 
				ПроверитьЗаполнениеКонтрагентаДоговораСчета(Транзакция, СтруктураЗаполненияКонтрагента, ВалютаЗаполнения, "Расход");
			КонецЕсли;
			
			//НовыйДокумент 								= Документы.ПлатежноеПоручениеВходящее.СоздатьДокумент();
			НовыйДокумент 								= Документы.РасходСоСчета.СоздатьДокумент();
			
			НовыйДокумент.ВариантЗаполненияРасшифровки = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияРасшифровкиПлатежа.Вручную");
			Сотрудник = Ложь;
			//ТорговыйПредставитель = Ложь;
			Если  ТипЗнч(Транзакция.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
				//Контрагент = ПолучитьКонтрагента(Транзакция.SenderInn, Сотрудник, ТорговыйПредставитель);
				НовыйДокумент.Контрагент = Транзакция.Контрагент;//Контрагент; 
				//Транзакция.Контрагент = Контрагент;
				НовыйДокумент.НалогообложениеНДС = ?(ЗначениеЗаполнено(НовыйДокумент.Контрагент), НовыйДокумент.Контрагент.НалогообложениеНДС, Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
			Иначе
				Сотрудник = Истина;
				НовыйДокумент.Подотчетник = Транзакция.Контрагент;
			//	Если ТипЗнч(Транзакция.SenderName) = Тип("СправочникСсылка.Контрагенты") Тогда 
			//		НовыйДокумент.НалогообложениеНДС = ?(ЗначениеЗаполнено(Контрагент), Контрагент.НалогообложениеНДС, Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
			//	Иначе
			//		НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
			//	КонецЕсли;
			//	
			//	//Если ТипЗнч(Транзакция.SenderName) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
			//	//	Сотрудник = Истина;
			//	//	ПроверкаТорговогоПредставителя(ТорговыйПредставитель, Транзакция.SenderName);
			//	//КонецЕсли;
			//
			КонецЕсли;
			
			//НовыйДокумент.ВалютаДокумента               = ПолучитьВалюту(Транзакция.DocumentDestinationCurrency);
			НовыйДокумент.ВалютаДенежныхСредств           = ВалютаЗаполнения;//ПолучитьВалюту(Транзакция.DocumentDestinationCurrency);
			//НовыйДокумент.ВводНачальныхОстатков         = Транзакция;
			НовыйДокумент.ВидОперации               		= Транзакция.ВидОперации;
			//Если Сотрудник Тогда
			//	//НовыйДокумент.ВидОперации               = Перечисления.ВидыОперацийППВходящее.ОплатаДенежныхСредствПодотчетником;
			//	НовыйДокумент.ВидОперации               = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника;
			//	Если ТорговыйПредставитель Тогда
			//		//НовыйДокумент.ВидРасчета            = Справочники.ВидыРачетовСПодотчетниками.ПриемДенегОтПодотчетникаВКассу;	
			//	КонецЕсли;
			//	//НовыйДокумент.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаДенежныхСредствПодотчетником;
			//	НовыйДокумент.Статья					 = Справочники.СтатьиДвиженияДенежныхСредств.Прочее;//ОплатаДенежныхСредствПодотчетником;
			//Иначе
			//	НовыйДокумент.ВидОперации               = Транзакция.ВидОперации; //Перечисления.ВидыОперацийППВходящее.ОплатаПокупателя;
			//КонецЕсли;
			//НовыйДокумент.ВидОплаты                     = Транзакция;
			//НовыйДокумент.ВидРасчета                    = Транзакция;
			//НовыйДокумент.Статья					 	= Справочники.СтатьиДвиженияДенежныхСредств.Прочее;
			НовыйДокумент.Дата                          = Транзакция.EntryDate;
			//НовыйДокумент.ДатаОплаты                    = Транзакция.EntryDate;
			НовыйДокумент.ДатаВходящегоДокумента        = Транзакция.EntryDate;
			//НовыйДокумент.ДокументРасчета               = Транзакция;
			//НовыйДокумент.Комисионные                   = Транзакция;
			НовыйДокумент.Комментарий                   = Транзакция.EntryComment;
			
			//НовыйДокумент.КратностьДокумента            = 1;
			//НовыйДокумент.Кратность			            = 1;
			////НовыйДокумент.КурсДокумента                 = Число(Транзакция.DocumentRate);
			//НовыйДокумент.Курс			                = ?(Транзакция.DocumentRate = "", 1, Число(Транзакция.DocumentRate));
			НовыйДокумент.НазначениеПлатежа             = Транзакция.DocumentNomination;
			//НовыйДокумент.Налог                         = Транзакция;
			//НовыйДокумент.НомерПлатежа                  = Транзакция;
			НовыйДокумент.Оплачено                      = Истина;
			НовыйДокумент.Организация                   = Объект.Организация;//УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Неопределено);//УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ОбщегоНазначения.ТекущийПользователь(), "ОсновнаяОрганизация");//ПолучитьОрганизацию("404411908");
			//НовыйДокумент.Ответственный                 = ОбщегоНазначения.ТекущийПользователь();
			НовыйДокумент.Автор			                = ПараметрыСеанса.ТекущийПользователь;//ОбщегоНазначения.ТекущийПользователь();
			//НовыйДокумент.СтатьяДвиженияДенежныхСредств = Транзакция;
			НовыйДокумент.СуммаДокумента                = Число(Транзакция.EntryAmountDebit);//Credit);
			СтрокаРасшифровки = НовыйДокумент.РасшифровкаПлатежа.Добавить();
			//Если ТипЗнч(НовыйДокумент.Контрагент) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(НовыйДокумент.Контрагент) Тогда 
				СтрокаРасшифровки.Договор = Транзакция.ДоговорКонтрагента;//ПолучитьДоговорКонтрагента(НовыйДокумент.Контрагент);
				СтрокаРасшифровки.ПризнакАванса = Истина;
			//КонецЕсли;
			
			СуммаДокументаПриИзмененииРасход(НовыйДокумент);
			//НовыйДокумент.СуммаНДФЛ                     = Транзакция;
			НовыйДокумент.СчетКонтрагента               = Транзакция.СчетКонтрагента;//Справочники.БанковскиеСчета.НайтиПоНаименованию(Транзакция.SenderAccountNumber,,,Контрагент);
			//НовыйДокумент.СчетОрганизации               = ПолучитьСчетОрганизации(Лев(Транзакция.BeneficiaryAccountNumber, 22), Транзакция.BeneficiaryAccountNumber, Транзакция.DocumentDestinationCurrency);
			НовыйДокумент.БанковскийСчет                = Объект.СчетДляППВ;//ПолучитьСчетОрганизации(Лев(Транзакция.BeneficiaryAccountNumber, 22), Транзакция.BeneficiaryAccountNumber, Транзакция.DocumentDestinationCurrency);
			//НовыйДокумент.EntryId                       = СтрЗаменить(СтрЗаменить(СтрЗаменить(Транзакция.EntryId,",",""),Символы.НПП,""), " ", "");
			
			НовыйДокумент.Корреспонденция 				= Транзакция.Корреспонденция;
			НовыйДокумент.КорреспонденцияРегл			= Транзакция.КорреспонденцияРегл;
			НовыйДокумент.Статья						= Транзакция.Статья;
			
			НовыйДокумент.Записать();
			КолВоСозданныхДокументов = КолВоСозданныхДокументов + 1;
			
			НаборЗаписейУИДДокумента = РегистрыСведений.УИДДокументовВИнтернетБанке.СоздатьНаборЗаписей();
			НаборЗаписейУИДДокумента.Отбор.ДокументСсылка.Установить(НовыйДокумент.Ссылка);
			НаборЗаписейУИДДокумента.Отбор.Сотрудник.Установить(Справочники.Сотрудники.ПустаяСсылка());
			НаборЗаписейУИДДокумента.Отбор.Банк.Установить(Объект.Банк);
			
			НовыйУИД = НаборЗаписейУИДДокумента.Добавить();
			НовыйУИД.ДокументСсылка = НовыйДокумент.Ссылка;
			НовыйУИД.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
			НовыйУИД.Банк = Объект.Банк;
			НовыйУИД.УИДДокументаВБанке = IDВходящегоДокумента;
			НовыйУИД.Выгружен = Истина;
			
			НаборЗаписейУИДДокумента.Записать();
			
			// Запись нового статуса
			НаборЗаписейСтатусовДокумента = РегистрыСведений.СтатусыДокументовВИнтернетБанке.СоздатьНаборЗаписей();
			НаборЗаписейСтатусовДокумента.Отбор.ДокументСсылка.Установить(НовыйДокумент.Ссылка);
			НаборЗаписейСтатусовДокумента.Отбор.Сотрудник.Установить(Справочники.Сотрудники.ПустаяСсылка());
			НаборЗаписейСтатусовДокумента.Отбор.Период.Установить(ТекущаяДата());
			НаборЗаписейСтатусовДокумента.Отбор.Банк.Установить(Объект.Банк);
			
			НовыйСтатус = НаборЗаписейСтатусовДокумента.Добавить();
			НовыйСтатус.ДокументСсылка = НовыйДокумент.Ссылка;
			НовыйСтатус.Период = ТекущаяДата();
			НовыйСтатус.Банк = Объект.Банк;
			НовыйСтатус.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
			НовыйСтатус.СтатусДокументаВИнтернетБанке = Перечисления.СтатусыДокументовВИнтернетБанке.ЗагруженИзИнтернетБанка;
			
			НаборЗаписейСтатусовДокумента.Записать();
			
			Если ПытатьсяПровестиДокументРасход Тогда 
				Попытка
					НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					Транзакция.Проведен = Истина;
				Исключение
					а=1;
				КонецПопытки;
				
			КонецЕсли;
			Транзакция.СозданныйДокумент = НовыйДокумент.Ссылка;
			
		КонецЕсли;	
		
		Если СуществуетДокумент И Транзакция.Пометка Тогда
			
			СозданныйДокумент = ПолучитьСуществующийДокумент(IDВходящегоДокумента);
			
			НоваяСтрока = ТаблицаСозданныхДокументов.Добавить();
			НоваяСтрока.ДокументСсылка = СозданныйДокумент;
			НоваяСтрока.EntryId = IDВходящегоДокумента;
			
			МассивНомеровСтрок.Добавить(Транзакция.НомерСтроки);			
			КоличествоПовторныхПопыток = КоличествоПовторныхПопыток + 1;
		КонецЕсли;	
		
		Для Каждого СтрокаТЧ ИЗ Объект.ПлатежныеПорученияВходящиеРасходы Цикл
			Для Каждого Строка ИЗ ТаблицаСозданныхДокументов Цикл 			
				Если СтрокаТЧ.EntryId = Строка.EntryId Тогда 
					СтрокаТЧ.СозданныйДокумент = Строка.ДокументСсылка;
				КонецЕсли;
			КонецЦикла;	
			
			// Дозаполним поле контрагент
			СтруктураПоиска = Новый Структура("ИНН, Наименование", СокрЛП(СтрокаТЧ.SenderInn), СокрЛП(СтрокаТЧ.SenderName));
			
			МассивНайденныхСтрок = ТаблицаСозданныхКонтрагентов.НайтиСтроки(СтруктураПоиска);
			
			Если МассивНайденныхСтрок.Количество() <> 0 Тогда
				СтрокаТЧ.Контрагент = МассивНайденныхСтрок[0].Контрагент;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;	
	
	ТекстКолВоСозданныхДокументов = Нстр("ka='შექმნილია "+ КолВоСозданныхДокументов + " დოკუმენტი! ';ru='Создано "+ КолВоСозданныхДокументов + " документа/ов'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстКолВоСозданныхДокументов,,Объект,, ЛОЖЬ);
	
	Если КоличествоПовторныхПопыток > 0 Тогда 		
		Для Каждого ЭлементМассива ИЗ МассивНомеровСтрок Цикл 
			ТекстКолВоСозданныхДокументов = Нстр("ka='სტრიქონისთვის № "+ ЭлементМассива + " არ შეიქმნა დოკუმენტი, რადგან ამ ჩანაწერისთვის სისტემაში უკვე არსებობს დოკუმენტი! ';ru='Для строки № "+ ЭлементМассива + " не создано документа, так как для этой записи в системе уже создан документ!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстКолВоСозданныхДокументов,,Объект,, ЛОЖЬ);		
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура СуммаДокументаПриИзмененииРасход(Объект)
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаДенежныхСредств));
	Курс = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	Кратность = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 И
		НЕ (Объект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Поставщику И 
		Объект.ВариантЗаполненияРасшифровки = Перечисления.ВариантыЗаполненияРасшифровкиПлатежа.СПомощником) Тогда
		
		СтрокаТабличнойЧасти = Объект.РасшифровкаПлатежа[0];
		
		СтрокаТабличнойЧасти.СуммаПлатежа = Объект.СуммаДокумента;
		
		// Эквайринг
		Если Объект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты Тогда
			СтрокаТабличнойЧасти.СуммаПлатежа = СтрокаТабличнойЧасти.СуммаПлатежа + Объект.СуммаКомиссииДокумента;
		КонецЕсли;
		// Конец Эквайринг
		
		СтрокаТабличнойЧасти.Курс = ?(
			СтрокаТабличнойЧасти.Курс = 0,
			1,
			СтрокаТабличнойЧасти.Курс
		);
		
		СтрокаТабличнойЧасти.Кратность = ?(
			СтрокаТабличнойЧасти.Кратность = 0,
			1,
			СтрокаТабличнойЧасти.Кратность
		);
		
		СтрокаТабличнойЧасти.СуммаРасчетов = ПересчитатьИзВалютыВВалюту(
			СтрокаТабличнойЧасти.СуммаПлатежа,
			Курс,
			СтрокаТабличнойЧасти.Курс,
			Кратность,
			СтрокаТабличнойЧасти.Кратность
		);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
			СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.НДС18;
		КонецЕсли;
		
		//СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса, СтрокаТабличнойЧасти.СуммаПлатежа, 0);
		
		РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
		
	КонецЕсли;
	
	//+++
	Если Объект.СуммаДокумента < 10000 Тогда 
		Объект.ТипОтправки = ПредопределенноеЗначение("Перечисление.ТипыОтправки.BULK");
	Иначе
		Объект.ТипОтправки = ПредопределенноеЗначение("Перечисление.ТипыОтправки.MT103");
	КонецЕсли;
	//---
	
	//ПересчитатьИтогиПриИзмененииАвансаНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыРасхода(Команда)
	
	ОчиститьСообщения();
	СоздатьДокументыРасходаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеПорученияВходящиеРасходыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекСтрока = Элементы.ПлатежныеПорученияВходящиеРасходы.ТекущиеДанные;
	ДокПлатежа = ТекСтрока.СозданныйДокумент;
	ТекСтрока.Проведен = ПолучитьПроведениеНаСервере(ДокПлатежа);
	ТекСтрока.Видимость = ОпределитьВидимость(ТекСтрока.СозданныйДокумент, ТекСтрока.Контрагент, ТекСтрока.ДоговорКонтрагента, ТекСтрока.СчетКонтрагента, "Расходы");
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПлатежныеПорученияВходящиеВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	ТекущаяСтрока = Элементы.ПлатежныеПорученияВходящие.ТекущиеДанные;
//	УстановитьПредЗначениеВидаОперации(ТекущаяСтрока.ВидОперации);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПлатежныеПорученияВходящиеРасходыВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	ТекущаяСтрока = Элементы.ПлатежныеПорученияВходящиеРасходы.ТекущиеДанные;
//	УстановитьПредЗначениеВидаОперации(ТекущаяСтрока.ВидОперации);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьПредЗначениеВидаОперации(ВидОперации)
//	
//	ПредыдущиеЗначениеВидаОперации = ВидОперации;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеПорученияВходящиеРасходыКонтрагентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПлатежныеПорученияВходящиеРасходы.ТекущиеДанные;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Контрагент",		ТекущаяСтрока.Контрагент);
	СтруктураВозврата.Вставить("СчетКонтрагента",	ТекущаяСтрока.СчетКонтрагента);
	СтруктураВозврата.Вставить("ДоговорКонтрагента",ТекущаяСтрока.ДоговорКонтрагента);
	
	ПриоритетПоиска = ?(ТипЗнч(ТекущаяСтрока.Контрагент) = Тип("СправочникСсылка.Контрагенты"), 1, 2);
	
	// 1-контрагент, 2-Сотрудник, 0-Любого найденного
	НайтиКонтрагентаСотрудникаПоИНН(СокрЛП(ТекущаяСтрока.BeneficiaryInn), ПриоритетПоиска, СтруктураВозврата);
	
	Если СтруктураВозврата.Контрагент = Неопределено ИЛИ СтруктураВозврата.Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда 
		// Мало вероятно, но всё же
		ТекущаяСтрока.Контрагент 		= ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		ТекущаяСтрока.СчетКонтрагента 	= СтруктураВозврата.СчетКонтрагента;
		ТекущаяСтрока.ДоговорКонтрагента= СтруктураВозврата.ДоговорКонтрагента;
	Иначе
		ТекущаяСтрока.Контрагент 		= СтруктураВозврата.Контрагент;
		ТекущаяСтрока.СчетКонтрагента 	= СтруктураВозврата.СчетКонтрагента;
		ТекущаяСтрока.ДоговорКонтрагента= СтруктураВозврата.ДоговорКонтрагента;
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеПорученияВходящиеКонтрагентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПлатежныеПорученияВходящие.ТекущиеДанные;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Контрагент",		ТекущаяСтрока.Контрагент);
	СтруктураВозврата.Вставить("СчетКонтрагента",	ТекущаяСтрока.СчетКонтрагента);
	СтруктураВозврата.Вставить("ДоговорКонтрагента",ТекущаяСтрока.ДоговорКонтрагента);
	
	ПриоритетПоиска = ?(ТипЗнч(ТекущаяСтрока.Контрагент) = Тип("СправочникСсылка.Контрагенты"), 1, 2);
	
	// 1-контрагент, 2-Сотрудник, 0-Любого найденного
	НайтиКонтрагентаСотрудникаПоИНН(СокрЛП(ТекущаяСтрока.BeneficiaryInn), ПриоритетПоиска, СтруктураВозврата);
	
	Если СтруктураВозврата.Контрагент = Неопределено ИЛИ СтруктураВозврата.Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда 
		// Мало вероятно, но всё же
		ТекущаяСтрока.Контрагент 		= ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		ТекущаяСтрока.СчетКонтрагента 	= СтруктураВозврата.СчетКонтрагента;
		ТекущаяСтрока.ДоговорКонтрагента= СтруктураВозврата.ДоговорКонтрагента;
	Иначе
		ТекущаяСтрока.Контрагент 		= СтруктураВозврата.Контрагент;
		ТекущаяСтрока.СчетКонтрагента 	= СтруктураВозврата.СчетКонтрагента;
		ТекущаяСтрока.ДоговорКонтрагента= СтруктураВозврата.ДоговорКонтрагента;
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПлатежныеПорученияВходящиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
//	
//	ТекущаяСтрока = Элементы.ПлатежныеПорученияВходящие.ТекущиеДанные;
//	ПредыдущиеЗначениеВидаОперации = ТекущаяСтрока.ВидОперации;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеПорученияВходящиеПередНачаломИзменения(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.ПлатежныеПорученияВходящие.ТекущиеДанные;
	ПредыдущиеЗначениеВидаОперации = ТекущаяСтрока.ВидОперации;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеПорученияВходящиеРасходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.ПлатежныеПорученияВходящиеРасходы.ТекущиеДанные;
	ПредыдущиеЗначениеВидаОперации = ТекущаяСтрока.ВидОперации;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеПорученияВходящиеРасходыПриАктивизацииСтроки(Элемент)
	// Вставити вміст обробника.
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеПорученияВходящиеРасходыКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ПлатежныеПорученияВходящиеРасходы.ТекущиеДанные;
	
	Если ТекущаяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику") 
		ИЛИ ТекущаяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику") Тогда 
		
		Массив = Новый Массив; 
		Массив.Добавить(Тип("СправочникСсылка.Сотрудники")); 
		
	ИначеЕсли ТекущаяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Налоги") Тогда 
		
		Массив = Новый Массив; 
		Массив.Добавить(Тип("СправочникСсылка.КодыКазначейства"));
		
	ИНаче
		
		Массив = Новый Массив; 
		Массив.Добавить(Тип("СправочникСсылка.Контрагенты"));
		
	КонецЕсли;
	
	Элемент.ОграничениеТипа = новый ОписаниеТипов(Массив);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеПорученияВходящиеКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ПлатежныеПорученияВходящие.ТекущиеДанные;
	
	Если ТекущаяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником") 
		ИЛИ ТекущаяСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника") Тогда 
		
		Массив = Новый Массив; 
		Массив.Добавить(Тип("СправочникСсылка.Сотрудники")); 
		
	ИНаче
		
		Массив = Новый Массив; 
		Массив.Добавить(Тип("СправочникСсылка.Контрагенты"));
		
	КонецЕсли;
	
	Элемент.ОграничениеТипа = новый ОписаниеТипов(Массив);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	а=1;
КонецПроцедуры

&НаКлиенте
Процедура ВалютаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	а=1;
КонецПроцедуры

&НаСервере
Функция ПреобразоватьКодировкиВСимволы(ВходящаяСтрока) 
	
	ПЕРЕМ РЕЗ;
	
	РЕЗ=Строка(ВходящаяСтрока);
	
	ТекДлинаСтроки = СтрДлина(ВходящаяСтрока);
	
	РЕЗ=СтрЗаменить(РЕЗ,"&amp;","&");
	РЕЗ=СтрЗаменить(РЕЗ,"&lt;","<");
	РЕЗ=СтрЗаменить(РЕЗ,"&gt;",">");
	РЕЗ=СтрЗаменить(РЕЗ,"&apos;","'");
	РЕЗ=СтрЗаменить(РЕЗ,"&quot;","""");
	
	Возврат РЕЗ;	
	
КонецФункции

&НаКлиенте
Процедура ПлатежныеПорученияПлатежноеПоручениеИсходящееОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;     
	ТекСтрока = Элементы.ПлатежныеПоручения.ТекущиеДанные;
	
	УИДСтроки = ТекСтрока.ПолучитьИдентификатор();
	
	ОпределитьСтрокуНаСервереИЗаполнитьСтрокуНаСервере(УИДСтроки, ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьСтрокуНаСервереИЗаполнитьСтрокуНаСервере(УИДСтроки, Док)
	
	СтрокаПлатежногоПолучения = Объект.ПлатежныеПоручения.НайтиПоИдентификатору(УИДСтроки);
	
	ЗаполнитьСтрокуТЧПлатежныеПаручения(Док, СтрокаПлатежногоПолучения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеПорученияВходящиеРасходыВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставити вміст обробника.
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеСчетовОрганизации(СтрокаТЧ, Владелец, ВалютаОтправитель, ВалютаПолучатель)
	
	ПустойБанковскийСчет = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка");
	ЕстьСчетОтправителя = ЗначениеЗаполнено(СтрокаТЧ.СчетОтправителя); 
	ЕстьСчетПолучателя  = ЗначениеЗаполнено(СтрокаТЧ.СчетКонтрагента);
	
	ДобавитьНайденныйСчет = Ложь;
	
	Если НЕ ЕстьСчетОтправителя Тогда 
		
		//Попробуем ОтыскатьСчет по номеру и в таблице созданных
		НайденныйСчет = ПустойБанковскийСчет;
		СтруктураПоиска = Новый Структура("НомерСчета", СокрЛП(СтрокаТЧ.SenderAccountNumber));
		МассивПоиска = ТаблицаСозданныхСчетовОрганизации.НайтиСтроки(СтруктураПоиска);
		
		Если МассивПоиска.Количество() <> 0 Тогда 
			НайденныйСчет = МассивПоиска[0].БанковскийСчет;
		Иначе
			НайденныйСчет = ПолучитьСчетОрганизации(Лев(СокрЛП(СтрокаТЧ.SenderAccountNumber),22), СокрЛП(СтрокаТЧ.SenderAccountNumber), ВалютаОтправитель);
			ДобавитьНайденныйСчет = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденныйСчет) Тогда 
			
			СтрокаТЧ.СчетОтправителя = НайденныйСчет;
			
			Если ДобавитьНайденныйСчет Тогда 
				
				НоваяСтрокаСозданныхСчетов = ТаблицаСозданныхСчетовОрганизации.Добавить();
				НоваяСтрокаСозданныхСчетов.НомерСчета = СокрЛП(СтрокаТЧ.SenderAccountNumber);
				НоваяСтрокаСозданныхСчетов.БанковскийСчет = НайденныйСчет;
				ДобавитьНайденныйСчет = Ложь;
				
			КонецЕсли;
			
		Иначе
			
			НовыйСчет = Объект.СчетДляППВ.Скопировать();
			// Меняем только номерСчета, валюту, наименование
			НовыйСчет.НомерСчета 			= СокрЛП(СтрокаТЧ.SenderAccountNumber);
			НовыйСчет.ВалютаДенежныхСредств = ВалютаОтправитель;
			НаименованиеБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйСчет.Банк, "Наименование");
			НовыйСчет.Наименование 			= Лев(СокрЛП(НовыйСчет.НомерСчета) + ?(ЗначениеЗаполнено(НаименованиеБанка), ", в " + НаименованиеБанка, ""), 100);
			
			Попытка
				
				НовыйСчет.Записать();
				Сообщить(НСтр("ru = 'Был создан новый банковский счет организации: """+ СокрЛП(СтрокаТЧ.SenderAccountNumber) +"""!'; ka = 'Был создан новый банковский счет организации: """+ СокрЛП(СтрокаТЧ.SenderAccountNumber) +"""!'"));
				СтрокаТЧ.СчетОтправителя = НовыйСчет.Ссылка;
				
				НоваяСтрокаСозданныхСчетов = ТаблицаСозданныхСчетовОрганизации.Добавить();
				НоваяСтрокаСозданныхСчетов.НомерСчета = СокрЛП(СтрокаТЧ.SenderAccountNumber);
				НоваяСтрокаСозданныхСчетов.БанковскийСчет = НовыйСчет.Ссылка;
				
			Исключение
				
				Сообщить(НСтр("ru = 'Не удалось создать банковский счет организации: """+ СокрЛП(СтрокаТЧ.SenderAccountNumber) +"""!'; ka = 'Не удалось создать банковский счет организации: """+ СокрЛП(СтрокаТЧ.SenderAccountNumber) +"""!'"));
				
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	
	ДобавитьНайденныйСчет = Ложь;
	
	Если НЕ ЕстьСчетПолучателя Тогда 
		
		//Попробуем ОтыскатьСчет по номеру и в таблице созданных
		НайденныйСчет = ПустойБанковскийСчет;
		СтруктураПоиска = Новый Структура("НомерСчета", СокрЛП(СтрокаТЧ.BeneficiaryAccountNumber));
		МассивПоиска = ТаблицаСозданныхСчетовОрганизации.НайтиСтроки(СтруктураПоиска);
		
		Если МассивПоиска.Количество() <> 0 Тогда 
			НайденныйСчет = МассивПоиска[0].БанковскийСчет;
		Иначе
			НайденныйСчет = ПолучитьСчетОрганизации(Лев(СокрЛП(СтрокаТЧ.BeneficiaryAccountNumber),22), СокрЛП(СтрокаТЧ.BeneficiaryAccountNumber), ВалютаОтправитель);
			ДобавитьНайденныйСчет = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденныйСчет) Тогда 
			
			СтрокаТЧ.СчетКонтрагента = НайденныйСчет;
			
			Если ДобавитьНайденныйСчет Тогда 
				НоваяСтрокаСозданныхСчетов = ТаблицаСозданныхСчетовОрганизации.Добавить();
				НоваяСтрокаСозданныхСчетов.НомерСчета = СокрЛП(СтрокаТЧ.BeneficiaryAccountNumber);
				НоваяСтрокаСозданныхСчетов.БанковскийСчет = НайденныйСчет;
				ДобавитьНайденныйСчет = Ложь;
			КонецЕсли;
			
		Иначе
			
			НовыйСчет = Объект.СчетДляППВ.Скопировать();
			// Меняем только номерСчета, валюту, наименование
			НовыйСчет.НомерСчета 			= СокрЛП(СтрокаТЧ.BeneficiaryAccountNumber);
			НовыйСчет.ВалютаДенежныхСредств = ВалютаПолучатель;
			НаименованиеБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйСчет.Банк, "Наименование");
			НовыйСчет.Наименование 			= Лев(СокрЛП(НовыйСчет.НомерСчета) + ?(ЗначениеЗаполнено(НаименованиеБанка), ", в " + НаименованиеБанка, ""), 100);
			
			Попытка
				
				НовыйСчет.Записать();
				Сообщить(НСтр("ru = 'Был создан новый банковский счет организации: """+ СокрЛП(СтрокаТЧ.BeneficiaryAccountNumber) +"""!'; ka = 'Был создан новый банковский счет организации: """+ СокрЛП(СтрокаТЧ.BeneficiaryAccountNumber) +"""!'"));
				СтрокаТЧ.СчетКонтрагента = НовыйСчет.Ссылка;
				
				НоваяСтрокаСозданныхСчетов = ТаблицаСозданныхСчетовОрганизации.Добавить();
				НоваяСтрокаСозданныхСчетов.НомерСчета = СокрЛП(СтрокаТЧ.BeneficiaryAccountNumber);
				НоваяСтрокаСозданныхСчетов.БанковскийСчет = НовыйСчет.Ссылка;
				
			Исключение
				
				Сообщить(НСтр("ru = 'Не удалось создать банковский счет организации: """+ СокрЛП(СтрокаТЧ.BeneficiaryAccountNumber) +"""!'; ka = 'Не удалось создать банковский счет организации: """+ СокрЛП(СтрокаТЧ.BeneficiaryAccountNumber) +"""!'"));
				
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыКонвертацииНаСервере()
	
	КолВоСозданныхДокументов = 0;		
	КоличествоПовторныхПопыток = 0;
	
	МассивНомеровСтрок = Новый Массив;
	
	ТаблицаСозданныхДокументов = Новый ТаблицаЗначений;
	ТаблицаСозданныхДокументов.Колонки.Добавить("ДокументСсылка", Новый ОписаниеТипов("ДокументСсылка.Конвертация"));
	ТаблицаСозданныхДокументов.Колонки.Добавить("EntryId", Новый ОписаниеТипов("Строка"));
	
	
	СтруктураПоискаПомеченыхСтрок = Новый Структура("Пометка", Истина);
	МассивОбхода = Объект.ПлатежныеПорученияВходящиеКонвертации.НайтиСтроки(СтруктураПоискаПомеченыхСтрок);
	
	Для Каждого Транзакция ИЗ МассивОбхода Цикл
		
		СуществуетДокумент = ПроверкаНаСуществованиеДанногоДокумента(Транзакция.EntryId);
		
		Если НЕ ЗначениеЗаполнено(Транзакция.СозданныйДокумент) И Не СуществуетДокумент Тогда 
			
			ВалютаОтправитель = ПолучитьВалюту(Транзакция.DocumentDestinationCurrency);
			ВалютаПолучатель = ПолучитьВалюту(Транзакция.DocumentSourceCurrency);
			Если СоздаватьСчетаОрганизации Тогда 
				ПроверитьЗаполнениеСчетовОрганизации(Транзакция, Объект.Организация, ВалютаОтправитель, ВалютаПолучатель);
			КонецЕсли;
			
			НовыйДокумент 						= Документы.Конвертация.СоздатьДокумент();
			
			НовыйДокумент.Автор 				= ПараметрыСеанса.ТекущийПользователь;
			НовыйДокумент.ВалютаОтправитель     = ВалютаОтправитель;
			НовыйДокумент.ВалютаПолучатель      = ВалютаПолучатель;
			НовыйДокумент.ВидОперации           = Транзакция.ВидОперации;
			НовыйДокумент.Дата                  = Дата(Транзакция.EntryDate);
			НовыйДокумент.Комментарий           = Транзакция.DocumentInformation;
			
			
			
			НовыйДокумент.Организация           = Объект.Организация;
			НовыйДокумент.Отправитель           = Транзакция.СчетОтправителя;
			НовыйДокумент.Получатель            = Транзакция.СчетКонтрагента;
			
			ВалютаОтправитель = Транзакция.СчетОтправителя.ВалютаДенежныхСредств;
			ВалютаПолучатель = Транзакция.СчетКонтрагента.ВалютаДенежныхСредств;
			
			НовыйДокумент.ВалютаОтправитель     = ВалютаОтправитель;
			НовыйДокумент.ВалютаПолучатель      = ВалютаПолучатель;
			НовыйДокумент.Статья                = СтатьяПоУмолчанию;
			НовыйДокумент.СуммаКонвертации      = Число(Транзакция.DocumentDestinationAmount);
			НовыйДокумент.СуммаПолучено         = Число(Транзакция.DocumentSourceAmount);
			EntryId = СтрЗаменить(СтрЗаменить(СтрЗаменить(Транзакция.EntryId, " ", ""), ",", ""), Символы.НПП, "");
			НовыйДокумент.УникальныйКлючВИнтернетБанке = EntryId;
			
			
			Если ВалютаОтправитель = НациональнаяВалюта ИЛИ ВалютаПолучатель = НациональнаяВалюта Тогда 
				НовыйДокумент.КоммерческийКурс      = Число(Транзакция.DocumentRate); 
			Иначе
				НовыйДокумент.КроссКурс             = Число(Транзакция.DocumentRate);
			КонецЕсли;
			
			НовыйДокумент.КратностьОтправитель  = 1;
			НовыйДокумент.КратностьПолучатель   = 1;
			
			Если ВалютаОтправитель = НациональнаяВалюта Тогда 
				НовыйДокумент.КурсОтправитель       = 1; //Число(Транзакция.DocumentRate);
				НовыйДокумент.КурсПолучатель        = Число(Транзакция.DocumentRate); //1;
			ИначеЕсли ВалютаПолучатель = НациональнаяВалюта Тогда
				НовыйДокумент.КурсОтправитель       = Число(Транзакция.DocumentRate); //1;
				НовыйДокумент.КурсПолучатель        = 1; //Число(Транзакция.DocumentRate);
			Иначе 
				НовыйДокумент.КурсОтправитель       = 1;
				НовыйДокумент.КурсПолучатель        = 1;
			КонецЕсли;
			
			/////////////////////////////////////////////////////////////////
			//НовыйДокумент.ЗагруженоИзБанка				= Истина;
			
			НовыйДокумент.Записать();
			КолВоСозданныхДокументов = КолВоСозданныхДокументов + 1;
			
			// Запись нового УИД банка
			НаборЗаписейУИДДокумента = РегистрыСведений.УИДДокументовВИнтернетБанке.СоздатьНаборЗаписей();
			НаборЗаписейУИДДокумента.Отбор.ДокументСсылка.Установить(НовыйДокумент.Ссылка);
			НаборЗаписейУИДДокумента.Отбор.Сотрудник.Установить(Справочники.Сотрудники.ПустаяСсылка());
			НаборЗаписейУИДДокумента.Отбор.Банк.Установить(Объект.Банк);
			
			НовыйУИД = НаборЗаписейУИДДокумента.Добавить();
			НовыйУИД.ДокументСсылка = НовыйДокумент.Ссылка;
			НовыйУИД.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
			НовыйУИД.Банк = Объект.Банк;
			НовыйУИД.УИДДокументаВБанке = EntryId;
			НовыйУИД.Выгружен = Истина;
			
			НаборЗаписейУИДДокумента.Записать();
			
			// Запись нового статуса
			НаборЗаписейСтатусовДокумента = РегистрыСведений.СтатусыДокументовВИнтернетБанке.СоздатьНаборЗаписей();
			НаборЗаписейСтатусовДокумента.Отбор.ДокументСсылка.Установить(НовыйДокумент.Ссылка);
			НаборЗаписейСтатусовДокумента.Отбор.Сотрудник.Установить(Справочники.Сотрудники.ПустаяСсылка());
			НаборЗаписейСтатусовДокумента.Отбор.Период.Установить(ТекущаяДата());
			НаборЗаписейСтатусовДокумента.Отбор.Банк.Установить(Объект.Банк);
			
			НовыйСтатус = НаборЗаписейСтатусовДокумента.Добавить();
			НовыйСтатус.ДокументСсылка = НовыйДокумент.Ссылка;
			НовыйСтатус.Период = ТекущаяДата();
			НовыйСтатус.Банк = Объект.Банк;
			НовыйСтатус.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
			НовыйСтатус.СтатусДокументаВИнтернетБанке = Перечисления.СтатусыДокументовВИнтернетБанке.ЗагруженИзИнтернетБанка;
			
			НаборЗаписейСтатусовДокумента.Записать();
			////////////////////////////////////
			
			Если ПытатьсяПровестиДокументКонвертация Тогда 
				Попытка
					НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					Транзакция.Проведен = Истина;
				Исключение
					а=1;
				КонецПопытки;
				
			КонецЕсли;
			Транзакция.СозданныйДокумент = НовыйДокумент.Ссылка;
			
		КонецЕсли;	
		
		Если СуществуетДокумент И Транзакция.Пометка Тогда
			
			СозданныйДокумент = ПолучитьСуществующийДокумент(Транзакция.EntryId);
			
			НоваяСтрока = ТаблицаСозданныхДокументов.Добавить();
			НоваяСтрока.ДокументСсылка = СозданныйДокумент;
			НоваяСтрока.EntryId = Транзакция.EntryId;
			
			МассивНомеровСтрок.Добавить(Транзакция.НомерСтроки);			
			КоличествоПовторныхПопыток = КоличествоПовторныхПопыток + 1;
		КонецЕсли;	
		
		Для Каждого СтрокаТЧ ИЗ Объект.ПлатежныеПорученияВходящие Цикл
			Для Каждого Строка ИЗ ТаблицаСозданныхДокументов Цикл 			
				Если СтрокаТЧ.EntryId = Строка.EntryId Тогда 
					СтрокаТЧ.СозданныйДокумент = Строка.ДокументСсылка;
				КонецЕсли;
			КонецЦикла;	
			
			// Дозаполним поле контрагент
			//СтруктураПоиска = Новый Структура("ИНН, Наименование", СокрЛП(СтрокаТЧ.SenderInn), СокрЛП(СтрокаТЧ.SenderName));
			//
			//МассивНайденныхСтрок = ТаблицаСозданныхКонтрагентов.НайтиСтроки(СтруктураПоиска);
			//
			//Если МассивНайденныхСтрок.Количество() <> 0 Тогда
			//	СтрокаТЧ.Контрагент = МассивНайденныхСтрок[0].Контрагент;
			//КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;	
	
	ТекстКолВоСозданныхДокументов = Нстр("ka='შექმნილია "+ КолВоСозданныхДокументов + " დოკუმენტი! ';ru='Создано "+ КолВоСозданныхДокументов + " документа/ов'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстКолВоСозданныхДокументов,,Объект,, ЛОЖЬ);
	
	Если КоличествоПовторныхПопыток > 0 Тогда 		
		Для Каждого ЭлементМассива ИЗ МассивНомеровСтрок Цикл 
			ТекстКолВоСозданныхДокументов = Нстр("ka='სტრიქონისთვის № "+ ЭлементМассива + " არ შეიქმნა დოკუმენტი, რადგან ამ ჩანაწერისთვის სისტემაში უკვე არსებობს დოკუმენტი! ';ru='Для строки № "+ ЭлементМассива + " не создано документа, так как для этой записи в системе уже создан документ!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстКолВоСозданныхДокументов,,Объект,, ЛОЖЬ);		
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыКонвертации(Команда)
	
	ОчиститьСообщения();
	СоздатьДокументыКонвертацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонвертацииДСДокументКонвертацииДСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;     
	ТекСтрока = Элементы.КонвертацииДС.ТекущиеДанные;
	
	УИДСтроки = ТекСтрока.ПолучитьИдентификатор();
	
	ОпределитьСтрокуНаСервереИЗаполнитьСтрокуКонвертацииНаСервере(УИДСтроки, ВыбранноеЗначение);
	
КонецПроцедуры

Процедура ОпределитьСтрокуНаСервереИЗаполнитьСтрокуКонвертацииНаСервере(УИДСтроки, Док)
	
	СтрокаКонвертации = Объект.КонвертацииДС.НайтиПоИдентификатору(УИДСтроки);
	
	//ЗаполнитьСтрокуТЧПлатежныеПаручения(Док, СтрокаПлатежногоПолучения);
	
	СтрокаКонвертации.КонвертацияБезналичныхДенежныхСредств = Док.Ссылка;
	СтрокаКонвертации.Пометка                               = Ложь;
	СтрокаКонвертации.UniqueId                              = 1;
	СтрокаКонвертации.DocumentNo                            = Док.Номер;
	Если ТипЗнч(Док.Отправитель) = Тип("СправочникСсылка.БанковскиеСчета") Тогда 
		СтрокаКонвертации.SourceAccountNumber                   = Док.Отправитель.НомерСчета;//СчетОтправитель.НомерСчета;
		СтрокаКонвертации.SourceCurrency                        = Док.Отправитель.ВалютаДенежныхСредств;//СчетОтправитель.ВалютаДенежныхСредств;
		ВалютаОтправителя = Док.Отправитель.ВалютаДенежныхСредств;
	ИначеЕсли ТипЗнч(Док.Отправитель) = Тип("СправочникСсылка.Сотрудники") Тогда
		СтрокаКонвертации.SourceAccountNumber                   = Док.Отправитель.БанковскийСчетПоУмолчанию.НомерСчета;//СчетОтправитель.НомерСчета;
		СтрокаКонвертации.SourceCurrency                        = Док.Отправитель.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств;//СчетОтправитель.ВалютаДенежныхСредств;
		ВалютаОтправителя = Док.Отправитель.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств;
	КонецЕсли;
	
	Если ТипЗнч(Док.Получатель) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		СтрокаКонвертации.DestinationAccountNumber              = Док.Получатель.НомерСчета;//СчетПолучатель.НомерСчета;
		СтрокаКонвертации.DestinationCurrency                   = Док.Получатель.ВалютаДенежныхСредств;//СчетПолучатель.ВалютаДенежныхСредств;
		ВалютаПолучателя = Док.Получатель.ВалютаДенежныхСредств;
	ИначеЕсли ТипЗнч(Док.Отправитель) = Тип("СправочникСсылка.Сотрудники") Тогда
		СтрокаКонвертации.DestinationAccountNumber              = Док.Получатель.БанковскийСчетПоУмолчанию.НомерСчета;//СчетПолучатель.НомерСчета;
		СтрокаКонвертации.DestinationCurrency                   = Док.Получатель.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств;//СчетПолучатель.ВалютаДенежныхСредств;
		ВалютаПолучателя = Док.Получатель.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств;
	КонецЕсли;
	
	СтрокаКонвертации.Amount                                = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Док.СуммаКонвертации),",", ""), " ", ""),Символы.НПП, "");//СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Док.СуммаСписанная),",", ""), " ", ""),Символы.НПП, "");
	
	НацВалюта = Константы.НациональнаяВалюта.Получить();
	//СтруктураКурсаОтправителя = МодульВалютногоУчета.ПолучитьКурсВалюты(Док.СчетОтправитель.ВалютаДенежныхСредств, Док.Дата);
	Если Док.Получатель.ВалютаДенежныхСредств = НацВалюта ИЛИ Док.Отправитель.ВалютаДенежныхСредств = НацВалюта Тогда 		
		////НоваяСтрока.Rate           = СтруктураКурсаОтправителя.Курс;
		СтрокаКонвертации.Rate           = Док.КоммерческийКурс;
	ИначеЕсли Док.Отправитель.ВалютаДенежныхСредств <> НацВалюта И Док.Получатель.ВалютаДенежныхСредств <> НацВалюта Тогда 
		СтрокаКонвертации.Rate           = Док.КроссКурс;
	КонецЕсли;
	//НоваяСтрока.Rate = ?(ВалютаОтправителя = Справочники.Валюты.НайтиПоКоду("643"), Док.КурсПолучатель, Док.КурсОтправитель);
	СтрокаКонвертации.AdditionalInfo = Док.Комментарий;
	
КонецПроцедуры
