&НаКлиенте
Перем старыйПолучатель;

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ОбновитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОбновитьНаСервере()
	
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ЗапасыОстатки.СтруктурнаяЕдиница КАК Склад,
	//			   |	ЗапасыОстатки.ЗаказПокупателя КАК Заказ,
	//			   |	ЗапасыОстатки.Номенклатура,
	//			   |	ЗапасыОстатки.КоличествоОстаток КАК Количество,
	//			   |	ЗапасыОстатки.ЗаказПокупателя.СтруктурнаяЕдиницаРезерв КАК Получатель,
	//			   |	ЗапасыОстатки.Характеристика
	//			   |ИЗ
	//			   |	РегистрНакопления.Запасы.Остатки(, СтруктурнаяЕдиница В (&СписокСкладов)) КАК ЗапасыОстатки
	//			   |ГДЕ
	//			   |	ТИПЗНАЧЕНИЯ(ЗапасыОстатки.ЗаказПокупателя) = ТИП(Документ.ЗаказПокупателя)
	//			   |	И НЕ ЗапасыОстатки.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//			   |	И ЗапасыОстатки.КоличествоОстаток > 0
	//			   |	И ЗапасыОстатки.СтруктурнаяЕдиница <> ЗапасыОстатки.ЗаказПокупателя.СтруктурнаяЕдиницаРезерв
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	Склад,
	//			   |	Получатель,
	//			   |	Заказ";
				   
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапасыОстатки.СтруктурнаяЕдиница КАК Склад,
	               |	ЗапасыОстатки.ЗаказПокупателя КАК Заказ,
	               |	ЗапасыОстатки.Номенклатура,
	               |	ЗапасыОстатки.КоличествоОстаток КАК Количество,
	               |	ЗапасыОстатки.ЗаказПокупателя.СтруктурнаяЕдиницаРезерв КАК Получатель,
	               |	ЗапасыОстатки.Характеристика
	               |ПОМЕСТИТЬ ВТ_Заказы
	               |ИЗ
	               |	РегистрНакопления.Запасы.Остатки(
	               |			,
	               |			СтруктурнаяЕдиница В (&СписокСкладов)
	               |				И НЕ ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	               |				И НЕ СтруктурнаяЕдиница = ЗаказПокупателя.СтруктурнаяЕдиницаРезерв) КАК ЗапасыОстатки
	               |ГДЕ
	               |	ЗапасыОстатки.КоличествоОстаток > 0
	               |;
	               |
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Заказы.Склад КАК Склад,
	               |	ВТ_Заказы.Заказ КАК Заказ,
	               |	ВТ_Заказы.Номенклатура,
	               |	ВТ_Заказы.Количество,
	               |	ВТ_Заказы.Получатель КАК Получатель,
	               |	ВТ_Заказы.Характеристика
	               |ИЗ
	               |	ВТ_Заказы КАК ВТ_Заказы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Склад,
	               |	Получатель,
	               |	Заказ";
	//Запрос.УстановитьПараметр("Склад",	Склад);	 //Структурная единица, Контрагент
	Запрос.УстановитьПараметр("СписокСкладов",	СписокСкладов.ВыгрузитьЗначения());	 //Структурная единица, Контрагент

	РезультатЗапроса = Запрос.Выполнить();
	//СписокПеремещений.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	Элементы.СписокПеремещений.Обновить();
	
	Заказано.Загрузить(РезультатЗапроса.Выгрузить());
	
	//учтновим склад 
	//текСтрока = Элементы.Заказано.ТекущиеДанные;
	//Если текСтрока <> Неопределено Тогда
	//	Склад = текСтрока.Склад;
	//КонецЕсли;
	
	Если Заказано.Количество() > 0 Тогда
		Склад = Заказано[0].Склад;	
	КонецЕсли;
	
	ОбновитьТаблицуОстатков();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказаноПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	новыйПолучатель = Элемент.ТекущиеДанные.Получатель;
	новыйСклад		= Элемент.ТекущиеДанные.Склад;
 
	
	Если НЕ (новыйПолучатель = старыйПолучатель И новыйСклад = Склад) Тогда
		Получатель = новыйПолучатель;
		старыйПолучатель = новыйПолучатель;
		Склад = новыйСклад;
		
		ОбновитьТаблицуОстатков();
		
	КонецЕсли;
	
	Элементы.Остатки.ОтборСтрок = Новый ФиксированнаяСтруктура("Заказ", Элемент.ТекущиеДанные.Заказ);//_Паганини
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуОстатков()
	
	Остатки.Очистить();
	
	//массивСтрок = Заказано.НайтиСтроки(структураПоиска);
	Для Каждого текСтрока ИЗ Заказано Цикл
		текСтрока.Передать = 0;
	КонецЦикла;

	
	//получим остатки на текущем складе по 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапасыНаСкладахОстатки.Номенклатура,
	               |	ЗапасыНаСкладахОстатки.Характеристика,
	               |	ЗапасыНаСкладахОстатки.Ячейка,
	               |	ЗапасыНаСкладахОстатки.КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ЗапасыНаСкладах.Остатки(
	               |			,
	               |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |				И Номенклатура В (&НоменклатураТекущегоЗаказчика)) КАК ЗапасыНаСкладахОстатки
	               |ГДЕ
	               |	ЗапасыНаСкладахОстатки.КоличествоОстаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗапасыНаСкладахОстатки.Ячейка.Код";//_Паганини
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Склад);
	Запрос.УстановитьПараметр("НоменклатураТекущегоЗаказчика", Заказано.Выгрузить().ВыгрузитьКолонку("Номенклатура"));

	РезультатЗапроса = Запрос.Выполнить();
	таблицаОстатков = РезультатЗапроса.Выгрузить();
	
	// теперь будем ити по закзам и выбирать из остатков
	
	Для Каждого текСтрока Из Заказано Цикл
		
		Если Не текСтрока.Получатель = Получатель Тогда
			Продолжить;
		КонецЕсли;
		
		НужноОтгрузить = текСтрока.Количество;
		Номенклатура = текСтрока.Номенклатура;
		Заказ = текСтрока.Заказ;
		
		// получим таблицу подходящих строк 
		массивСтрок = таблицаОстатков.НайтиСтроки(Новый Структура ("Номенклатура", Номенклатура));
		Для Каждого строкаОстатков из массивСтрок  Цикл
			
			Если строкаОстатков.КоличествоОстаток = 0 Тогда
				Продолжить;; 
			КонецЕсли;
			
			отгружаем = Мин(НужноОтгрузить, строкаОстатков.КоличествоОстаток);
			
			новаяСтрока = Остатки.Добавить();
			
			новаяСтрока.Номенклатура = Номенклатура;
			новаяСтрока.Ячейка = строкаОстатков.Ячейка;
			новаяСтрока.Остаток = отгружаем;
			новаяСтрока.Передать = отгружаем;
			новаяСтрока.Характеристика = строкаОстатков.Характеристика;
			новаяСтрока.Заказ = Заказ;

			текСтрока.Передать = текСтрока.Передать + отгружаем;
			НужноОтгрузить = НужноОтгрузить - отгружаем;
			строкаОстатков.КоличествоОстаток = строкаОстатков.КоличествоОстаток - отгружаем;
			
			Если НужноОтгрузить = 0 Тогда 
				Прервать; // уже все есть
			КонецЕсли;

			
		КонецЦикла;
		
		//// пока от пустых строк отказались
		// добьем пустыми сторками по номенклатуре
		//Для Каждого строкаОстатков Из таблицаОстатков  Цикл
		//	
		//	Если строкаОстатков.Номенклатура <> Номенклатура ИЛИ 
		//		строкаОстатков.КоличествоОстаток = 0 Тогда
		//		Продолжить;
		//	КонецЕсли;
		//	
		//	новаяСтрока = Остатки.Добавить();
		//	
		//	новаяСтрока.Номенклатура = Номенклатура;
		//	новаяСтрока.Ячейка = строкаОстатков.Ячейка;
		//	новаяСтрока.Остаток = строкаОстатков.КоличествоОстаток;
		//	новаяСтрока.Передать = 0;
		//	новаяСтрока.Характеристика = строкаОстатков.Характеристика;
		//	
		//КонецЦикла;
		
		
		
	КонецЦикла;
	
	Остатки.Сортировать("Номенклатура, Ячейка");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПередачи(Команда)
	СоздатьДокументыПередачиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыПередачиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Товары.Ячейка,
	               |	Товары.Номенклатура,
	               |	Товары.Заказ,
	               |	Товары.Передать КАК Количество,
	               |	Товары.Характеристика,
	               |	Товары.ОК
	               |ПОМЕСТИТЬ Товары
	               |ИЗ
	               |	&Остатки КАК Товары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Товары.Ячейка КАК Ячейка,
	               |	Товары.Номенклатура,
	               |	Товары.Заказ КАК ЗаказПокупателя,
	               |	Товары.Количество КАК Количество,
	               |	Товары.Характеристика,
	               |	Товары.Количество КАК Резерв
	               |ИЗ
	               |	Товары КАК Товары
	               |ГДЕ
	               |	Товары.ОК
	               |ИТОГИ
	               |	СУММА(Количество)
	               |ПО
	               |	Ячейка";
	Запрос.УстановитьПараметр("Остатки", Остатки.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	
	
	НачатьТранзакцию();
	
	обходПоЯчейкам = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Отказ = Ложь;
	
	Пока обходПоЯчейкам.Следующий() Цикл
		
		Если обходПоЯчейкам.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СоздатьИПровестиПеремещение(обходПоЯчейкам, Отказ);
		
		Если Отказ Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьИПровестиПеремещение(обходПоЯчейкам, Отказ)
	
	новыйДокумент = Документы.ПеремещениеЗапасов.СоздатьДокумент();
	
	новыйДокумент.Организация = Справочники.Организации.НайтиПоКоду("00-000001"); ///!!!!!!!!!!!!!!!!
	новыйДокумент.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение;
	новыйДокумент.СтруктурнаяЕдиница = Склад;
	новыйДокумент.Ячейка = обходПоЯчейкам.Ячейка;
	новыйДокумент.СтруктурнаяЕдиницаПолучатель = Получатель;
	//новыйДокумент.ДокументОснование = ;
	//новыйДокумент.ЗаказПокупателя = текущийЗаказ;
	новыйДокумент.Автор = Пользователи.ТекущийПользователь();
	новыйДокумент.Дата = ТекущаяДата();
	новыйДокумент.ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
	
	выборка = обходПоЯчейкам.Выбрать();
	
	Пока выборка.следующий() Цикл
		
		Если выборка.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = новыйДокумент.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, выборка);
		НоваяСтрока.ЕдиницаИзмерения = выборка.Номенклатура.ЕдиницаИзмерения;
			
	КонецЦикла;
	
	Если новыйДокумент.Запасы.Количество() > 0 Тогда
		
		Попытка
			новыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,,Отказ);
		КонецПопытки;
		
	КонецЕсли;
		
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПеремещенийПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокСкладовПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры
