&НаКлиенте
Перем КонтекстЭДОКлиент Экспорт;

&НаКлиенте
Перем ДанныеОрганизации;

&НаКлиенте
Перем СтруктураДанныхСпецоператорыСвязи;

&НаСервере
Перем ОбработкаЭДО;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	РучнойВвод 					= Параметры.РучнойВвод;
	ЗначениеКопированияДокумент = Параметры.ЗначениеКопирования;
	
	ЗаполнитьСписокВыбораРегионовРФ();
	
	ВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект);
	
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Модифицированность Тогда
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект);
		ПроверитьЗаполнениеДокумента(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаполнитьСводнуюИнформациюПоЗаявлениюАбонентаСпецоператораСвязи" Тогда
		Если Параметр = Объект.Ссылка Тогда
			ОбновитьДанныеОбъекта();
			ЗаполнитьСводнуюИнформацию();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "Завершение отправки" И ТипЗнч(Параметр) = Тип("Структура") И Параметр.Ссылка = Объект.Ссылка Тогда
		ЗаполнитьСводнуюИнформацию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкачатьVipNetCSPНажатие(Элемент)
	КонтекстЭДОКлиент.ОткрытьСтраницуДляСкачивания(ПредопределенноеЗначение("Перечисление.ТипыКриптоПровайдеров.VipNet"));
КонецПроцедуры

&НаКлиенте
Процедура СкачатьCryptoProCSPНажатие(Элемент)
	КонтекстЭДОКлиент.ОткрытьСтраницуДляСкачивания(ПредопределенноеЗначение("Перечисление.ТипыКриптоПровайдеров.CryptoPro"));
КонецПроцедуры

&НаКлиенте
Процедура АдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.Имя = "АдресЮридический" Тогда
		Адрес = Объект.АдресЮридический;
	Иначе
		Адрес = Объект.АдресФактический;
	КонецЕсли;
	
	Если Лев(СокрЛП(ВерсияБСП) + ".", 4) = "2.1." Тогда
		НовыйАдрес = КонтекстЭДОКлиент.РедактироватьАдрес(Адрес, Элемент.Имя, Элемент);
		ОбновитьАдрес(НовыйАдрес, Элемент);
		
	Иначе
		ДополнительныеПараметры = Элемент;
		
		ТипЗначения = Тип("ОписаниеОповещения");
		ПараметрыКонструктора = Новый Массив(3);
		ПараметрыКонструктора[0] = "ОткрытьФормуКонтактнойИнформацииЗавершение";
		ПараметрыКонструктора[1] = ЭтаФорма;
		ПараметрыКонструктора[2] = ДополнительныеПараметры;
		
		Оповещение = Новый(ТипЗначения, ПараметрыКонструктора);
		
		КонтекстЭДОКлиент.РедактироватьАдрес(Адрес, Элемент.Имя, Элемент, Оповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпецоператорИУЦОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.СпецоператорСвязи = ВыбранноеЗначение;
	ПолеHTMLЛицензии = КонтекстЭДОКлиент.ЗаменитьЭлементыВСоглашении(СтруктураДанныхСпецоператорыСвязи,Объект.СпецоператорСвязи);
КонецПроцедуры

&НаКлиенте
Процедура АдресЮридическийОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПризнакОбособленногоПодразделения = Ложь;
	ОчиститьДанныеСотрудника();
	Объект.Получатели.Очистить();
	ОчиститьРеквизитыФормы();
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		СтруктураРеквизитов = Новый Структура("Организация,ПриОткрытии",?(ЗначениеЗаполнено(Объект.Организация),Объект.Организация,Неопределено),Ложь);
		КонтекстЭДОКлиент.ЗаполнитьДанныеОрганизации(СтруктураРеквизитов);
		ДанныеЗаполнения = КонтекстЭДОКлиент.ДополнитьДанныеОрганизацииДаннымиПоОтветственнымЛицам(СтруктураРеквизитов);
		ДанныеОрганизации = ДанныеЗаполнения.СтруктураДанныхОрганизации;
		
		ЗаполнитьДанныеПоОрганизации(ДанныеЗаполнения);
	КонецЕсли;
	
	ОбновитьЭлементыСтраницыОтчетностьВФСРАР(ЭтотОбъект);
	ОбновитьЭлементыСтраницыОтчетностьВРПН(ЭтотОбъект);
	ОбновитьЭлементыСтраницыОтчетностьВФТС(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	ОчиститьРеквизитыФормы();
	Объект.Организация = "";
КонецПроцедуры

&НаКлиенте
Процедура АдресФактическийОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникОчистка(Элемент, СтандартнаяОбработка)
	Объект.ВладелецЭЦП = Неопределено;
	ОчиститьДанныеСотрудника();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпецоператорИУЦПриИзменении(Элемент)
	Модифицированность = Истина;
	ОбновитьЭлементыСтраницыОтчетностьВФСРАР(ЭтотОбъект);
	ОбновитьЭлементыСтраницыОтчетностьВРПН(ЭтотОбъект);
	ОбновитьЭлементыСтраницыОтчетностьВФТС(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Декорация3Нажатие(Элемент)
	КонтекстЭДОКлиент.ОткрытьСтраницуУЦНажатие(СпецоператорИУЦ);
КонецПроцедуры

&НаКлиенте
Процедура ВыборКриптопровайдераПриИзменении(Элемент)
	Модифицированность	= Истина;
	КартинкаВидимость	= Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКриптопровайдераПриИзмененииЗавершение", ЭтотОбъект);
	КонтекстЭДОКлиент.ПолеВыбораКриптопровайдераПриИзменении(Элемент,ТаблицаЗначенийКС,КартинкаВидимость,ВыборКриптопровайдера,КриптопровайдерРекомендация,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура СпецоператорИУЦОчистка(Элемент, СтандартнаяОбработка)
	ПолеHTMLЛицензии = "";
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ТолькоПросмотр Тогда
		РедактироватьВыбранноеНаправление();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодатьЗаявкуНаСертификатДляФСРАРПриИзменении(Элемент)
	
	ОбновитьЭлементыСтраницыОтчетностьВФСРАР(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодатьЗаявкуНаПодключениеРПНПриИзменении(Элемент)
	
	ОбновитьЭлементыСтраницыОтчетностьВРПН(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодатьЗаявкуНаПодключениеФТСПриИзменении(Элемент)
	
	ОбновитьЭлементыСтраницыОтчетностьВФТС(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьПротоколИзПанелиОтправки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОтправкиНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьСостояниеОтправкиИзПанелиОтправки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьКритическиеОшибкиИзПанелиОтправки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ЗаполнитьДанныеВладельцаЭЦП();
КонецПроцедуры

&НаКлиенте
Процедура ВладелецЭЦПТипПриИзменении(Элемент)
	
	ОчиститьДанныеСотрудника();
	СменитьВладельцаЭЦП();
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецЭЦПВидДокументаПриИзменении(Элемент)
	УстановитьВидимостьКодаПодразделения(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДействияФормыПечатьЗаявка(Команда)
	
	Если ПроверкаЗаполненияУЦ() Тогда Возврат КонецЕсли;
	
	КонтекстЭДОКлиент.ПечатьЗаявленияНаПодключение(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияФормыПечатьСоглашение(Команда)
	
	Если ПроверкаЗаполненияУЦ() Тогда Возврат КонецЕсли;
	
	КонтекстЭДОКлиент.ПечатьСоглашенияобОказанииУслуг(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияФормыПечатьЛицензия(Команда)
	
	КонтекстЭДОКлиент.ПечатьСоглашенияобОказанииУслуг(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияФормыПечатьСертификат(Команда)
	
	КонтекстЭДОКлиент.ПечатьСертификатаПользователя(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеФормыПечатьПакет(Команда)
	
	КонтекстЭДОКлиент.ПечатьПакетаДокументов(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСоглашений(Команда)
	Элементы.ПолеHTMLЛицензии.Документ.execCommand("Print");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНаправление(Команда)
	
	Если ПроверитьОрганизацию() Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуНаправления("Добавить", "Получатели");
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьНаправление(Команда)
	
	РедактироватьВыбранноеНаправление();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНаправление(Команда)
	
	КонтекстЭДОКлиент.УдалитьНаправление(
		ЭтотОбъект, 
		Объект.Получатели, 
		"Получатели",
		"Удалить");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗаявление(Команда)
	ТребуетсяПроверка = (Объект.ТипЗаявления = ПредопределенноеЗначение("Перечисление.ТипыЗаявленияАбонентаСпецоператораСвязи.Первичное"));
	ПроверкаОтправкаЗаявления(ТребуетсяПроверка);
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНаправления(Команда)
	
	ПодтвердитьВосстановлениеНаправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатус(Команда)
	Если Объект.Статус=КонтекстЭДОКлиент.СтруктураСсылочныхДанных.Перечисления.СтатусыЗаявленияАбонентаСпецоператораСвязи_Подготовлено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьСтатусПослеПроверкиЗавершение", ЭтотОбъект);
		ПроверитьЗаполнениеДокумента(ОписаниеОповещения);
	ИначеЕсли Объект.Статус=ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Отправлено") Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьСтатусЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ka='Вы уверены, что хотите проверить наличие ответа на заявление?';ru='Вы уверены, что хотите проверить наличие ответа на заявление?';en='Are you sure you want to check the response to the statement?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	ПолучитьЗарегистрироватьОтвет();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеотправленноеИзвещение(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьНеотправленноеИзвещениеИзПанелиОтправки(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьКодаПодразделения(Форма)
	
	ПаспортРФ = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
			"Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ");
			
	ВыбранПаспортРФ = Форма.Объект.ВладелецЭЦПВидДокумента = ПаспортРФ;
	
	ВидимостьКодаПодразделения = ВыбранПаспортРФ;
	
	Форма.Элементы.ВладелецЭЦПКодПодразделения.Видимость = ВидимостьКодаПодразделения;
	
КонецПроцедуры

#Область ДобавлениеУдалениеРедактированиеКодовОрганов

#Область ДобавлениеИРедактирование

&НаКлиенте
Процедура РедактироватьВыбранноеНаправление()
	
	ТекущаяСтрока = Элементы.Получатели.ТекущаяСтрока;
	
	Если КонтекстЭДОКлиент.ТекущаяСтрокаВыбрана(Объект.Получатели, ТекущаяСтрока,"редактирования") Тогда

		ОткрытьФормуНаправления("Редактировать", "Получатели");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНаправления(Действие, ИмяТаблицыФормы)
	
	ДанныеОрганизации.Вставить("ОбъектДополнительныйКодФСС", Объект.ДополнительныйКодФСС);
	АдресПолучателей = АдресПолучателей(ИмяТаблицыФормы);
	
	КонтекстЭДОКлиент.ОткрытьФормуНаправления(
		ЭтотОбъект, 
		Действие, 
		ИмяТаблицыФормы, 
		ДанныеОрганизации, 
		Ложь,
		АдресПолучателей);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ОткрытьФормуНаправленияЗавершение(Результат, ВходящийКонтекст) Экспорт
	
	КонтекстЭДОКлиент.ОткрытьФормуНаправленияЗавершение(
		ЭтотОбъект,
		Объект.Получатели,
		Результат, 
		ВходящийКонтекст);
		
	СкрытьКнопкуУдаленияНаправления();
	
	Модифицированность = Истина;
		
КонецПроцедуры

&НаСервере
Функция АдресПолучателей(ИмяТаблицыФормы) Экспорт

	ТаблицаПолучателей = Объект.Получатели.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПолучателей, Новый УникальныйИдентификатор);

КонецФункции

#КонецОбласти

#Область Восстановление

&НаКлиенте
Процедура ПодтвердитьВосстановлениеНаправления()
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения(
		"ВосстановитьНаправленияЗавершение", 
		ЭтотОбъект);
		
	ТекстВопроса = НСтр("ka='Восстановить значения кодов по умолчанию?';ru='Восстановить значения кодов по умолчанию?';en='Reset to default codes?'");
	
	ПоказатьВопрос(
		ОписаниеОповещения, 
		ТекстВопроса, 
		РежимДиалогаВопрос.ДаНет
		,
		,
		КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНаправленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Объект.Получатели.Очистить();
		
		КонтекстЭДОКлиент.ВосстановитьНаправленияПоУмолчанию(
			Объект.Получатели, 
			ДанныеОрганизации);
			
		СкрытьКнопкуУдаленияНаправления();
		
		Модифицированность = Истина;
			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНаправленияПоУмолчанию(ПрограммноеДействие = Ложь)
	
	Если НЕ ПрограммноеДействие И ПроверитьОрганизацию() тогда
		Возврат;
	КонецЕсли;
	
	КонтекстЭДОКлиент.ВосстановитьНаправленияПоУмолчанию(Объект.Получатели,ДанныеОрганизации);
	
	Элементы.Удалить.Доступность = Объект.Получатели.Количество() <> 0;
	
КонецПроцедуры

#КонецОбласти

#Область Удаление

&НаКлиенте
Процедура УдалитьНаправлениеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент.УдалитьНаправлениеЗавершение(
		ЭтотОбъект, 
		Объект.Получатели,
		РезультатВопроса, 
		ДополнительныеПараметры);
		
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СкрытьКнопкуУдаленияНаправления()
	
	Элементы.Удалить.Доступность = Объект.Получатели.Количество() <> 0;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьСписокУЦ()
	
	Спецоператоры = КонтекстЭДОКлиент.ПолучитьСпецоператорыСвязи(
		СтруктураДанныхСпецоператорыСвязи.СпецоператорыСвязи,
		СтруктураДанныхСпецоператорыСвязи.Макет);
		
	Элементы.СпецоператорИУЦ.СписокВыбора.ЗагрузитьЗначения(Спецоператоры);
	
	Если НЕ ПустаяСтрока(Объект.СпецоператорСвязи) Тогда
		
		СпецоператорИУЦ = Объект.СпецоператорСвязи;
		
	ИначеЕсли Элементы.СпецоператорИУЦ.СписокВыбора.Количество() = 1 Тогда
		
		СпецоператорИУЦ = Элементы.СпецоператорИУЦ.СписокВыбора.Получить(0).Значение;
		Объект.СпецоператорСвязи = СпецоператорИУЦ;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СпецоператорСвязи) 
		И НЕ СтруктураДанныхСпецоператорыСвязи.ЗначениеЗаполненияСпецоператораСвязи = Неопределено Тогда
		
		СпецоператорИУЦ = СтруктураДанныхСпецоператорыСвязи.ЗначениеЗаполненияСпецоператораСвязи;
		Объект.СпецоператорСвязи = СпецоператорИУЦ;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокКриптопровайдеровЗавершение(Результат, ВходящийКонтекст) Экспорт
	
	Инфотекс = ВходящийКонтекст.Инфотекс;
	КриптоПро = ВходящийКонтекст.КриптоПро;

	Если Результат.Выполнено Тогда
		Для Каждого Криптопровайдер Из Результат.Криптопровайдеры Цикл
			Если Криптопровайдер.Имя = Инфотекс.Имя И Строка(Криптопровайдер.Тип) = Инфотекс.Тип Тогда 
				ТаблицаЗначенийКС.Получить(0).УстановленОС = Истина;
			ИначеЕсли Криптопровайдер.Имя = КриптоПро.Имя И Строка(Криптопровайдер.Тип) = КриптоПро.Тип Тогда 
				ТаблицаЗначенийКС.Получить(1).УстановленОС = Истина;
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
	ТипИмяКриптопровайдера = КонтекстЭДОКлиент.ПолучитьИмяТипКриптопровайдера();
	Имя = ТипИмяКриптопровайдера.Имя;
	Тип = ТипИмяКриптопровайдера.Тип;
	
	Если Тип <> Неопределено И Имя <> Неопределено Тогда
		Если Имя = Инфотекс.Имя И Строка(Тип) = Инфотекс.Тип Тогда
			ТаблицаЗначенийКС.Получить(0).Выбран1с = Истина;
		ИначеЕсли Имя = КриптоПро.Имя И Строка(Тип) = КриптоПро.Тип	 Тогда
			ТаблицаЗначенийКС.Получить(1).Выбран1с = Истина;
		КонецЕсли;
	КонецЕсли;
	
	КоличествоУстановленных = 0;
	
	Для каждого Строка из ТаблицаЗначенийКС Цикл
		
		Инфотекс = Строка.Криптопровайдер =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПолучитьПараметрыКриптопровайдера(ПредопределенноеЗначение("Перечисление.ТипыКриптоПровайдеров.VipNet")).ОтображаемоеНазвание;
		
		Если Строка.УстановленОС Тогда
			Строка.Статус = "(установлен на компьютере)";
			КоличествоУстановленных = КоличествоУстановленных + 1;
		ИначеЕсли Инфотекс Тогда 	
			Строка.Статус = "(требуется установка)";
		Иначе
			Строка.Статус = "(требуется приобретение и установка)";
		КонецЕсли;
		
		Строка.ОтображаемыйТекст = Строка.Криптопровайдер + " " + Строка.Статус;
		Если Инфотекс Тогда
			Элементы.ВыборКриптопровайдера.СписокВыбора[0].Представление = Строка.ОтображаемыйТекст;
		Иначе 
			Элементы.ВыборКриптопровайдера.СписокВыбора[1].Представление = Строка.ОтображаемыйТекст;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если КоличествоУстановленных = 1 тогда
			
			Для каждого Строка из ТаблицаЗначенийКС Цикл
				Если Строка.УстановленОС Тогда
					Если Строка.Криптопровайдер = "VipNet CSP" Тогда
						ВыборКриптопровайдера = 1;
					Иначе
						ВыборКриптопровайдера = 2;
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
		Если СокрЛП(Объект.ТипКриптопровайдера) <> "Vip net" Тогда
			ВыборКриптопровайдера = 2;
		Иначе
			ВыборКриптопровайдера = 1;
		КонецЕсли;
		
	КонецЕсли;
	
	КартинкаВидимость = Ложь;
	
	КонтекстЭДОКлиент.ВыработатьРекомендацииПоКриптопровайдеру(ТаблицаЗначенийКС,КриптопровайдерРекомендация,ВыборКриптопровайдера,КартинкаВидимость);
	
	Элементы.ПолеКартинкиВнимание48.Видимость = КартинкаВидимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСводнуюИнформацию()
	
	ПараметрыПрорисовкиПанелиОтправки = ДокументооборотСКОВызовСервера.ПараметрыПрорисовкиПанелиОтправки(Объект.Ссылка, Объект.Организация);
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПрименитьПараметрыПрорисовкиПанелиОтправки(ЭтаФорма, ПараметрыПрорисовкиПанелиОтправки);

	// Определяем доступность кнопки обновления в зависимости от состояния заявления
	Элементы.ОбновитьОтправку.Видимость = КонтекстЭДОКлиент.КнопкаОбновленияВЗаявленииНаПодключениеДоступна(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
		
	ЭтоНовый = Объект.Ссылка.Пустая();

	Если ЭтоНовый И НЕ РучнойВвод Тогда
		Если ЭтоЗаявлениеНаИзменениеРеквизитовПодключения(ЗначениеКопированияДокумент) Тогда
			ПараметрыОткрытияФормы = Новый Структура();
			ПараметрыОткрытияФормы.Вставить("Реквизит", ЗначениеКопированияДокумент);
			ОткрытьФорму(КонтекстЭДОКлиент.ПутьКОбъекту + ".Форма.МастерФормированияЗаявкиНаИзменениеПараметровПодключения", ПараметрыОткрытияФормы);
		Иначе
			ПараметрыФормы = Новый Структура("Реквизит",ЗначениеКопированияДокумент);
			ОткрытьФорму(КонтекстЭДОКлиент.ПутьКОбъекту + ".Форма.МастерФормированияЗаявкиНаПодключение",ПараметрыФормы);
		КонецЕсли;
		Закрыть();
		Возврат;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("Организация,ПриОткрытии",?(ЗначениеЗаполнено(Объект.Организация),Объект.Организация,Неопределено),Истина);
	
	ОрганизацияЗаполнена = ЗначениеЗаполнено(Объект.Организация);
	Если ОрганизацияЗаполнена Тогда
		СтруктураРеквизитов.Вставить("АдресЮридический",Объект.АдресЮридический);
		СтруктураРеквизитов.Вставить("АдресФактический",Объект.АдресФактический);
	КонецЕсли;
	
	КонтекстЭДОКлиент.ЗаполнитьДанныеОрганизации(СтруктураРеквизитов);
	ДанныеЗаполнения = КонтекстЭДОКлиент.ДополнитьДанныеОрганизацииДаннымиПоОтветственнымЛицам(СтруктураРеквизитов);
	
	Если ОрганизацияЗаполнена Тогда
		
		ЮрАдрес		= ДанныеЗаполнения.ЮрАдрес;
		ФактАдрес	= ДанныеЗаполнения.ФактАдрес;
		
		ДанныеОрганизации = ДанныеЗаполнения.СтруктураДанныхОрганизации;
		
		Если ЭтоНовый Тогда
			ЗаполнитьДанныеПоОрганизации(ДанныеЗаполнения);
			Объект.ВладелецЭЦПТип = ПредопределенноеЗначение("Перечисление.ТипыВладельцевЭЦП.Руководитель");
		КонецЕсли;
		
		Если ТолькоПросмотр Тогда
			Элементы.Сотрудник.ТолькоПросмотр 	= ТолькоПросмотр;
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураДанныхСпецоператорыСвязи = Новый Структура();
	СтруктураДанныхСпецоператорыСвязи.Вставить("СпецоператорыСвязи",                   ДанныеЗаполнения.СпецоператорыСвязи);
	СтруктураДанныхСпецоператорыСвязи.Вставить("Макет",                                ДанныеЗаполнения.МакетПараметрыСпецоператоровСвязи);
	СтруктураДанныхСпецоператорыСвязи.Вставить("ТекстМакетаСоглашение",                ДанныеЗаполнения.ТекстМакетаСоглашение);
	СтруктураДанныхСпецоператорыСвязи.Вставить("ЗначениеЗаполненияСпецоператораСвязи", ДанныеЗаполнения.ЗначениеЗаполненияСпецоператораСвязи);
	
	ЗаполнитьСписокУЦ();
	
	ТекстМакетаСоглашение = Строка(ДанныеЗаполнения.ТекстМакетаСоглашение);
	
	Если СпецоператорИУЦ <> Неопределено Тогда
		ПолеHTMLЛицензии = КонтекстЭДОКлиент.ЗаменитьЭлементыВСоглашении(СтруктураДанныхСпецоператорыСвязи,СпецоператорИУЦ);
	КонецЕсли;

	ЗаполнитьСводнуюИнформацию();
	
	Если НЕ Объект.ЭлектроннаяПодписьВМоделиСервиса Тогда
		
		Инфотекс  = ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПолучитьПараметрыКриптопровайдера(
			ПредопределенноеЗначение("Перечисление.ТипыКриптоПровайдеров.VipNet"));
		КриптоПро = ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПолучитьПараметрыКриптопровайдера(
			ПредопределенноеЗначение("Перечисление.ТипыКриптоПровайдеров.CryptoPro"));
		
		НоваяСтрока = ТаблицаЗначенийКС.Добавить();
		НоваяСтрока.Криптопровайдер 	= Инфотекс.ОтображаемоеНазвание;
		НоваяСтрока.УстановленОС 		= Ложь;
		НоваяСтрока.Выбран1с 			= Ложь;
		
		НоваяСтрока = ТаблицаЗначенийКС.Добавить();
		НоваяСтрока.Криптопровайдер 	= КриптоПро.ОтображаемоеНазвание;
		НоваяСтрока.УстановленОС 		= Ложь;
		НоваяСтрока.Выбран1с 			= Ложь;
		
		Контекст 	= Новый Структура("Инфотекс, КриптоПро", Инфотекс, КриптоПро);
		Оповещение 	= Новый ОписаниеОповещения("ЗаполнитьСписокКриптопровайдеровЗавершение", ЭтотОбъект, Контекст);
		
		КриптографияЭДКОКлиент.ПолучитьКриптопровайдеры(Оповещение);

	КонецЕсли;
	
	Если Объект.ТипЗаявления = ПредопределенноеЗначение("Перечисление.ТипыЗаявленияАбонентаСпецоператораСвязи.Изменение") Тогда
		СформироватьТаблицуИзмененныхДанных();
	Иначе
		Элементы.Сотрудник.Видимость = Объект.ВладелецЭЦПТип = ПредопределенноеЗначение("Перечисление.ТипыВладельцевЭЦП.ДругойСотрудник");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	ЭтоНовый = Объект.Ссылка.Пустая();
	
	Элементы.УкажитеКриптопровайдер.Видимость 					= Не Объект.ЭлектроннаяПодписьВМоделиСервиса;
	Элементы.ПутьКонтейнерЗакрытогоКлюча.Видимость 				= Не Объект.ЭлектроннаяПодписьВМоделиСервиса;
	
	Если Объект.ТипЗаявления = Перечисления.ТипыЗаявленияАбонентаСпецоператораСвязи.Изменение Тогда
		ЭтаФорма.Заголовок = "Заявление на изменение подключения к 1С-Отчетности";
		Элементы.ДополнительнаяИнформация.Видимость = Ложь;
	КонецЕсли;
	
	Если ЭтоНовый Тогда
		Объект.ТипЗаявления					 = Перечисления.ТипыЗаявленияАбонентаСпецоператораСвязи.Первичное;
		Объект.Дата							 = ТекущаяДатаСеанса();
		Объект.Статус						 = Перечисления.СтатусыЗаявленияАбонентаСпецоператораСвязи.Подготовлено;
		Объект.ИдентификаторДокументооборота = нрег(СтрЗаменить(Строка(Новый("УникальныйИдентификатор")),"-",""));
		ТолькоПросмотр = Ложь;
	ИначеЕсли Объект.Статус = Перечисления.СтатусыЗаявленияАбонентаСпецоператораСвязи.Подготовлено Тогда
		ТолькоПросмотр = Ложь;
	Иначе
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ТолькоПросмотр И Объект.ПодключитьЭДО Тогда
		Элементы.ПодключениеЭДО.Видимость = Истина;
		
		СтруктураПараметров = Новый Структура("СсылкаОписаниеСервиса");
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиПереопределяемый.ЗаполнитьПараметрыСервисаЭлектронныхДокументовДляФормыПодключенияК1СООтчетности(Объект.Организация, СтруктураПараметров);
		
		Если ЗначениеЗаполнено(СтруктураПараметров.СсылкаОписаниеСервиса) Тогда
			СсылкаОписаниеСервисаЭДО = СтруктураПараметров.СсылкаОписаниеСервиса;	
		КонецЕсли;
	Иначе
		Элементы.ПодключениеЭДО.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.Организация.ТолькоПросмотр				 = ТолькоПросмотр;
	Элементы.СпецоператорИУЦ.ТолькоПросмотр			 = ТолькоПросмотр;
	Элементы.Получатели.КоманднаяПанель.Доступность	 = НЕ ТолькоПросмотр;
	
	ОрганизацияЗаполнена = ЗначениеЗаполнено(Объект.Организация);
	
	Если НЕ ТолькоПросмотр Тогда
		Элементы.АдресЮридический.ЦветФона = Новый Цвет(255,255,255);
		Элементы.АдресФактический.ЦветФона = Новый Цвет(255,255,255);
		Если ОрганизацияЗаполнена Тогда
			Элементы.АдресЮридический.КнопкаВыбора = Истина;
			Элементы.АдресФактический.КнопкаВыбора = Истина;
		КонецЕсли;
	иначе
		Элементы.АдресЮридический.КнопкаВыбора = Ложь;
		Элементы.АдресФактический.КнопкаВыбора = Ложь;
	КонецЕсли;
	
	Элементы.ВыборКриптопровайдера.ТолькоПросмотр = ТолькоПросмотр;	
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
	Если Объект.Статус = Перечисления.СтатусыЗаявленияАбонентаСпецоператораСвязи.Подготовлено Тогда
		Элементы.ОтправитьЗаявление.Доступность	= Истина;
	КонецЕсли;
	
	// Открываем документ с различным внешним видом в зависимости от типа заявления
	Если Объект.ТипЗаявления = Перечисления.ТипыЗаявленияАбонентаСпецоператораСвязи.Первичное Тогда
		Элементы.ИнтерфейсыЗаявления.ТекущаяСтраница = Элементы.ПервичноеЗаявление;
	Иначе
		Элементы.ИнтерфейсыЗаявления.ТекущаяСтраница = Элементы.ВторичноеЗаявление;
	КонецЕсли;
	
	ОбновитьЭлементыСтраницыОтчетностьВФСРАР(ЭтотОбъект);
	ОбновитьЭлементыСтраницыОтчетностьВРПН(ЭтотОбъект);
	ОбновитьЭлементыСтраницыОтчетностьВФТС(ЭтотОбъект);
	
	УстановитьВидимостьКодаПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеКонстант(Тип,Имя)
	Константы.ДокументооборотСКонтролирующимиОрганами_ТипКриптопровайдера.Установить(Тип);
	Константы.ДокументооборотСКонтролирующимиОрганами_ИмяКриптопровайдера.Установить(Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеДокумента(ВыполняемоеОповещение)

	ИтогПроверки = Истина;
	
	ИтогПроверки = НЕ ПроверкаЗаполненияУЦ();
	
	Если ПроверитьОрганизацию() тогда
		ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Ложь);
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ПолноеНаименование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите полное наименование организации.';ru='Укажите полное наименование организации.';en='Enter the full name of the organization.'"), ,"Объект.ПолноеНаименование");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.КраткоеНаименование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите краткое наименование организации.';ru='Укажите краткое наименование организации.';en='Specify the short name of the organization.'"), ,"Объект.КраткоеНаименование");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	СтрЦифры = "0123456789";
	Если ПустаяСтрока(Объект.НомерОсновнойПоставки1с) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Не указан регистрационный номер.';ru='Не указан регистрационный номер.';en='Unknown registration number.'"), ,"Объект.НомерОсновнойПоставки1с");
		ИтогПроверки = Ложь;
	КонецЕсли;

	Если ПустаяСтрока(Объект.ИНН)Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите ИНН организации.';ru='Укажите ИНН организации.';en='Enter the VAT number of the organization.'"), ,"Объект.ИНН");
		ИтогПроверки = Ложь;
	ИначеЕсли КонтекстЭДОКлиент.ПроверитьЦифровойКодЗаданнойДлины(Объект.ИНН,10) Тогда
		
		Если НЕ (КонтекстЭДОКлиент.ПроверитьКПП(Объект.КПП)) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите КПП организации.';ru='Укажите КПП организации.';en='Specify PPC organization.'"), ,"Объект.КПП");
			ИтогПроверки = Ложь;
		КонецЕсли;
		
		Если НЕ (КонтекстЭДОКлиент.ПроверитьЦифровойКодЗаданнойДлины(Объект.ОГРН, 13)) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите ОГРН организации.';ru='Укажите ОГРН организации.';en='Specify BIN organization.'"), ,"ОГРН");
			ИтогПроверки = Ложь;
		КонецЕсли;
		
		Объект.ТипОрганизации = Истина;
	ИначеЕсли КонтекстЭДОКлиент.ПроверитьЦифровойКодЗаданнойДлины(Объект.ИНН,12) Тогда
		
		Если (КонтекстЭДОКлиент.ПроверитьКПП(Объект.КПП)) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Указан ИНН физического лица и КПП юридического лица.';ru='Указан ИНН физического лица и КПП юридического лица.';en='Set INN natural person or legal entity PPC.'"), ,"Объект.КПП");
			ИтогПроверки = Ложь;
		КонецЕсли;
		
		Если НЕ (КонтекстЭДОКлиент.ПроверитьЦифровойКодЗаданнойДлины(Объект.ОГРН, 15, Истина)) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Некорректно заполнен ОГРН организации.';ru='Некорректно заполнен ОГРН организации.';en='Incorrectly filled BIN organization.'"), ,"ОГРН");
				ИтогПроверки = Ложь;
		КонецЕсли;
		
		Объект.ТипОрганизации = Ложь;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Некорректно заполнен ИНН организации.';ru='Некорректно заполнен ИНН организации.';en='Incorrectly filled INN organization.'"), ,"Объект.ИНН");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если НЕ КонтекстЭДОКлиент.ПроверитьРегистрационныйНомерПФР(Объект.РегНомерПФР, Истина) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Некорректно заполнен регистрационный номер в ПФР.';ru='Некорректно заполнен регистрационный номер в ПФР.';en='Correctly filled registration number to the FIU.'"), ,"Объект.РегНомерПФР");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если НЕ КонтекстЭДОКлиент.ПроверитьЦифровойКодЗаданнойДлины(Объект.РегНомерФСС, 10, Истина) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Некорректно заполнен регистрационный номер в ФСС.';ru='Некорректно заполнен регистрационный номер в ФСС.';en='Correctly filled the registration number in the FSS.'"), ,"Объект.РегНомерФСС");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если НЕ КонтекстЭДОКлиент.ПроверитьЦифровойКодЗаданнойДлины(Объект.ДополнительныйКодФСС, 10, Истина) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Некорректно заполнен дополнительный регистрационный номер в ФСС.';ru='Некорректно заполнен дополнительный регистрационный номер в ФСС.';en='Incorrectly filled Additional registration number in the FSS.'"), ,"Объект.ДополнительныйКодФСС");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Объект.ЭлектроннаяПочта) Тогда
		Если НЕ ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Объект.ЭлектроннаяПочта) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Некорректно заполнен адрес электронной почты,"
"реквизит необязательный для заполнения.';ka='Некорректно заполнен адрес электронной почты,"
"реквизит необязательный для заполнения.'"), ,"Объект.ЭлектроннаяПочта");
		ИтогПроверки = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ТелефонОсновной) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите основной телефон организации.';ru='Укажите основной телефон организации.';en='Enter the main phone company.'"), ,"Объект.ТелефонОсновной");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.АдресЮридический) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Не указан юридический адрес.';ru='Не указан юридический адрес.';en='No business address.'"), ,"ЮрАдрес");
		ИтогПроверки = Ложь;
	Иначе
		ИтогПроверкиАдресЮр = Истина;
		ПреобразоватьАдресКодРегиона(Объект.АдресЮридический,0,ИтогПроверкиАдресЮр);
		Если ИтогПроверкиАдресЮр тогда
			СтрокаОшибкаАдреса = КонтекстЭДОКлиент.ПроверитьАдрес(Объект.АдресЮридический);
			Если Не ПустаяСтрока(СтрокаОшибкаАдреса) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='Некорректно заполнен юридический адрес: %1';ru='Некорректно заполнен юридический адрес: %1';en='Incorrectly filled with legal address:% 1'"),СтрокаОшибкаАдреса), ,"ЮрАдрес");
				ИтогПроверки = Ложь;
			КонецЕсли;
		Иначе
			ИтогПроверки = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.АдресФактический) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Не указан фактический адрес.';ru='Не указан фактический адрес.';en='Unknown actual address.'"), ,"ФактАдрес");
		ИтогПроверки = Ложь;
	Иначе
		ИтогПроверкиАдресФакт = Истина;
		ПреобразоватьАдресКодРегиона(Объект.АдресФактический,1,ИтогПроверкиАдресФакт);
		Если ИтогПроверкиАдресФакт тогда
			СтрокаОшибкаАдреса = КонтекстЭДОКлиент.ПроверитьАдрес(Объект.АдресФактический);
			Если Не ПустаяСтрока(СтрокаОшибкаАдреса) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='Некорректно заполнен фактический адрес: %1';ru='Некорректно заполнен фактический адрес: %1';en='Incorrectly filled with actual address:% 1'"),СтрокаОшибкаАдреса), ,"ФактАдрес");
				ИтогПроверки = Ложь;
			КонецЕсли;
		Иначе
			ИтогПроверки = Ложь;
		КонецЕсли;
	КонецЕсли;
		
	Если ПустаяСтрока(Объект.ВладелецЭЦПФамилия) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите фамилию сотрудника.';ru='Укажите фамилию сотрудника.';en='Specify the name of the employee.'"), ,"Объект.ВладелецЭЦПФамилия");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ВладелецЭЦПИмя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите имя сотрудника.';ru='Укажите имя сотрудника.';en='Specify the name of the employee.'"), ,"Объект.ВладелецЭЦПИмя");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если НЕ КонтекстЭДОКлиент.ПроверитьСНИЛС(Объект.ВладелецЭЦПСНИЛС) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Некорректно указан СНИЛС сотрудника. Не соответствует маске 999-999-999 99';ru='Некорректно указан СНИЛС сотрудника. Не соответствует маске 999-999-999 99';en='Incorrectly Set SNILS employee. Do not conform to the mask 99 999-999-999'"), ,"Объект.ВладелецЭЦПСНИЛС");
		ИтогПроверки = Ложь;
	ИначеЕсли НЕ КонтекстЭДОКлиент.ПроверитьСНИЛС(Объект.ВладелецЭЦПСНИЛС, Ложь, Истина) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Некорректно указан СНИЛС сотрудника. Не сошлось контрольное число (СНИЛС не существует)';ru='Некорректно указан СНИЛС сотрудника. Не сошлось контрольное число (СНИЛС не существует)';en='Incorrectly Set SNILS employee. Do not come together control number (SNILS does not exist)'"), ,"Объект.ВладелецЭЦПСНИЛС");
		ИтогПроверки = Ложь;
	ИначеЕсли Объект.ВладелецЭЦПСНИЛС = "000-000-000 00" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Предупреждение. Указан ""нулевой"" СНИЛС 000-000-000 00. Обычно это допустимо только для иностранных граждан.';ru='Предупреждение. Указан ""нулевой"" СНИЛС 000-000-000 00. Обычно это допустимо только для иностранных граждан.';en='A warning. Set ""zero"" SNILS 000-000-000 00. Usually it is only allowed for foreign nationals.'"));
	КонецЕсли;
	
	// Пол
	Если НЕ ЗначениеЗаполнено(Объект.ВладелецЭЦППол) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Заполните поле ""Пол""';ru='Заполните поле ""Пол""';en='Fill in the field ""Gender""'"), ,"Объект.ВладелецЭЦППол");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если Объект.ТипОрганизации И ПустаяСтрока(Объект.ВладелецЭЦПДолжность) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите должность сотрудника.';ru='Укажите должность сотрудника.';en='Specify Officer.'"), ,"Объект.ВладелецЭЦПДолжность");
		ИтогПроверки = Ложь;
	ИначеЕсли СтрДлина(Объект.ВладелецЭЦПДолжность) > 64 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Длина значения в поле Должность не должна превышать 64 символа.';ru='Длина значения в поле Должность не должна превышать 64 символа.';en='Field value function should not exceed 64 characters.'"), ,"Объект.ВладелецЭЦПВидДокумента");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если СтрДлина(Объект.ВладелецЭЦППодразделение) > 64 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Длина значения в поле Подразделение не должна превышать 64 символа.';ru='Длина значения в поле Подразделение не должна превышать 64 символа.';en='The length field value in the branch should not exceed 64 characters.'"), ,"Объект.ВладелецЭЦППодразделение");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	// Гражданство
	Если НЕ ЗначениеЗаполнено(Объект.ВладелецЭЦПГражданство) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Заполните поле ""Гражданство""';ru='Заполните поле ""Гражданство""';en='Fill in the ""Citizenship""'"), ,"Объект.ВладелецЭЦПГражданство");
		ИтогПроверки = Ложь;
	ИначеЕсли НЕ ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.КодАльфа2Заполнен(Объект.ВладелецЭЦПГражданство)
		И Объект.ВладелецЭЦПГражданство <> ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СтраныМира.Россия")  Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Заполните код альфа-2 у страны, указанной в качестве гражданства сотрудника-владельца ЭП';ru='Заполните код альфа-2 у страны, указанной в качестве гражданства сотрудника-владельца ЭП';en=""Fill the alpha-2 code of the country, said in an employee's citizenship-owner FL"""), ,"Объект.ВладелецЭЦПГражданство");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ВладелецЭЦПВидДокумента) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите вид документа, удостоверяющего личность сотрудника.';ru='Укажите вид документа, удостоверяющего личность сотрудника.';en='Specify the type of identity document employee.'"), ,"Объект.ВладелецЭЦПВидДокумента");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ВладелецЭЦПСерияДокумента) И НЕ КонтекстЭДОКлиент.ПроверитьСериюДокумента(Объект.ВладелецЭЦПВидДокумента,Объект.ВладелецЭЦПСерияДокумента) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите серию документа удостоверяющего личность сотрудника.';ru='Укажите серию документа удостоверяющего личность сотрудника.';en='Specify a series of identity document employee.'"), ,"Объект.ВладелецЭЦПСерияДокумента");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ВладелецЭЦПНомерДокумента) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите номер документа удостоверяющего личность сотрудника.';ru='Укажите номер документа удостоверяющего личность сотрудника.';en='Enter the number of the identity card of the employee.'"), ,"Объект.ВладелецЭЦПНомерДокумента");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ВладелецЭЦПКемВыданДокумент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите кем выдан документ удостоверяющий личность сотрудника.';ru='Укажите кем выдан документ удостоверяющий личность сотрудника.';en='Specify whom issued identity document employee.'"), ,"Объект.ВладелецЭЦПКемВыданДокумент");
		ИтогПроверки = Ложь;
	ИначеЕсли СтрДлина(Объект.ВладелецЭЦПКемВыданДокумент) > 200 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Наименование органа """+Объект.ВладелецЭЦПКемВыданДокумент+""","+Символы.ПС+"выдавшего документ удостоверяющий личность сотрудника, не должно быть больше 200 символов.'"), ,"Объект.ВладелецЭЦПКемВыданДокумент");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВладелецЭЦПДатаВыдачиДокумента) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите дату выдачи документа удостоверяющего личность сотрудника.';ru='Укажите дату выдачи документа удостоверяющего личность сотрудника.';en='Specify the date of issue of the identity card of the employee.'"), ,"Объект.ВладелецЭЦПДатаВыдачиДокумента");
		ИтогПроверки = Ложь;
	ИначеЕсли Объект.ВладелецЭЦПДатаВыдачиДокумента > КонтекстЭДОКлиент.ТекущаяДатаНаСервере() ИЛИ Год(Объект.ВладелецЭЦПДатаВыдачиДокумента) < 1900 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Указана недопустимая дата выдачи документа удостоверяющего личность.';ru='Указана недопустимая дата выдачи документа удостоверяющего личность.';en='An invalid date of issue of identity document.'"), ,"Объект.ВладелецЭЦПДатаВыдачиДокумента");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	// Код подразделения. Только для паспорта РФ.
	ПаспортРФ = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
		"Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ");
		
	Если Объект.ВладелецЭЦПВидДокумента = ПаспортРФ Тогда
		КодПодразделенияБезТире = СтрЗаменить(Объект.ВладелецЭЦПКодПодразделения, "-","");
		Если ПустаяСтрока(КодПодразделенияБезТире) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Заполните поле ""Код подразделения""';ru='Заполните поле ""Код подразделения""';en='Fill in the ""Unit Code""'"), ,"Объект.ВладелецЭЦПКодПодразделения");
			ИтогПроверки = Ложь;
		ИначеЕсли СтрДлина(Объект.ВладелецЭЦПКодПодразделения) <> 7
			ИЛИ НЕ КонтекстЭДОКлиент.ПроверитьЦифровойКодЗаданнойДлины(КодПодразделенияБезТире, 6, Истина) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Некорректно указан код подразделения. Не соответствует маске ХХХ-ХХХ, где X – любая цифра';ru='Некорректно указан код подразделения. Не соответствует маске ХХХ-ХХХ, где X – любая цифра';en='Incorrectly specified department code. Do not conform to the mask XXX-XXX, where X - any number'"), ,"Объект.ВладелецЭЦПКодПодразделения");
			ИтогПроверки = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Дата рождения
	Если Не ЗначениеЗаполнено(Объект.ВладелецЭЦПДатаРождения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Заполните поле ""Дата рождения""';ru='Заполните поле ""Дата рождения""';en='Fill in the field ""Date of Birth""'"), ,"Объект.ВладелецЭЦПДатаРождения");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	// Место рождения
	Если ПустаяСтрока(Объект.ВладелецЭЦПМестоРождения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Заполните поле ""Место рождения""';ru='Заполните поле ""Место рождения""';en='Fill in the ""Place of Birth""'"), ,"Объект.ВладелецЭЦПМестоРождения");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Если Объект.Получатели.Количество() < 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Укажите хотя бы одно направление сдачи, ФНС или ПФР.';ru='Укажите хотя бы одно направление сдачи, ФНС или ПФР.';en='Please provide at least one direction of delivery of FTS or the FIU.'"), ,"Объект.Получатели");
		ИтогПроверки = Ложь;
	ИначеЕсли Объект.Получатели.Количество()=1 
				И Объект.Получатели[0].ТипПолучателя <> ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФНС") 
				И Объект.Получатели[0].ТипПолучателя <> ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ПФР") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Среди направлений сдачи должен быть ФНС или ПФР.';ru='Среди направлений сдачи должен быть ФНС или ПФР.';en='Among the areas to be putting FTS or FIU.'"), ,"Объект.Получатели");
			ИтогПроверки = Ложь;
	КонецЕсли;
	
	ОтборФСГС = Новый Структура("ТипПолучателя",ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФСГС"));
	ОтборФНС = Новый Структура("ТипПолучателя",ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФНС"));
	
	Если Объект.Получатели.НайтиСтроки(ОтборФСГС).Количество() > 0
		И Объект.Получатели.НайтиСтроки(ОтборФНС).Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Для подключения направления Росстат должно быть подключено направление ФНС, необходимо добавить направление ФНС.';ru='Для подключения направления Росстат должно быть подключено направление ФНС, необходимо добавить направление ФНС.';en='To connect Rosstat direction must be connected the direction of the Federal Tax Service, you must add the direction of the Federal Tax Service.'"), ,"Объект.Получатели");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Отбор = Новый Структура("ТипПолучателя",ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ПФР"));
	
	Если ПустаяСтрока(Объект.РегНомерПФР)
		И Объект.Получатели.НайтиСтроки(Отбор).Количество() >0 тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Указано направление ПФР, но в сведениях об организации не заполнен регистрационный номер в ПФР.';ru='Указано направление ПФР, но в сведениях об организации не заполнен регистрационный номер в ПФР.';en='It indicates the direction of the RPF, but information about the organization is not full registration number to the FIU.'"), ,"Объект.РегНомерПФР");
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	Отбор = Новый Структура("ТипПолучателя",ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФСС"));
	
	Если Объект.Получатели.НайтиСтроки(Отбор).Количество() > 0 Тогда
		
		ТекстОшибки = "";
		
		Если НЕ Объект.ПризнакОбособленногоПодразделения И ПустаяСтрока(Объект.РегНомерФСС) Тогда
			ТекстОшибки = "регистрационный номер в ФСС.";
			ОбъектНомерФСС ="Объект.РегНомерФСС";
		ИначеЕсли Объект.ПризнакОбособленногоПодразделения И ПустаяСтрока(Объект.ДополнительныйКодФСС) Тогда
			ТекстОшибки = "дополнительный регистрационный номер в ФСС.";
			ОбъектНомерФСС ="Объект.ДополнительныйКодФСС";
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
			ТекстОшибки = "Указано направление ФСС, но в сведениях об организации не заполнен "+ТекстОшибки;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = '"+ТекстОшибки+"'"),,ОбъектНомерФСС);
			ИтогПроверки = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.ЭлектроннаяПодписьВМоделиСервиса Тогда
		Если Не ЗначениеЗаполнено(Объект.ИдентификаторПроверкиТелефонаДляПаролей) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Проверка телефона для получения паролей не выполнена. Воспользуйтесь мастером подключения для отправки заявления.';ru='Проверка телефона для получения паролей не выполнена. Воспользуйтесь мастером подключения для отправки заявления.';en='Check phone is not performed for obtaining a password. Use the Connection Wizard to send the request.'"));
			ИтогПроверки = Ложь;
		КонецЕсли;
	Иначе
		Если ВыборКриптопровайдера = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Не выбран криптопровайдер.';ru='Не выбран криптопровайдер.';en='Not selected crypto.'"), ,"ВыборКриптопровайдера");
			ИтогПроверки = Ложь;
		Иначе
			
			Если ВыборКриптопровайдера = 1 Тогда
				Объект.ТипКриптопровайдера = ПредопределенноеЗначение("Перечисление.ТипыКриптоПровайдеров.VipNet");
			Иначе
				Объект.ТипКриптопровайдера = ПредопределенноеЗначение("Перечисление.ТипыКриптоПровайдеров.CryptoPro");
			КонецЕсли;
			
			Криптопровайдер = ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПолучитьПараметрыКриптопровайдера(Объект.ТипКриптопровайдера);
			
			УстановитьЗначениеКонстант(Криптопровайдер.Тип,Криптопровайдер.Имя);
			
		КонецЕсли;
	КонецЕсли;
	
	//Страница Росалкогольрегулирование
	Если Объект.ПодатьЗаявкуНаСертификатДляФСРАР Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.КодРегионаФСРАР) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='На закладке ""Прочие контролирующие органы"" не указан код региона Росалкогольрегулирования';ru='На закладке ""Прочие контролирующие органы"" не указан код региона Росалкогольрегулирования';en='On the tab ""Other regulatory authorities"" Unknown region code Rosalkogolregulirovaniya'"), ,"Объект.КодРегионаФСРАР");
			ИтогПроверки = Ложь;
		КонецЕсли;
		
		Если ИтогПроверки = Истина Тогда
			
			КодРегионаЮрАдреса = РегламентированнаяОтчетностьКлиентСервер.РазложитьАдрес(Объект.АдресЮридический).Регион;
			
			Если Объект.КодРегионаФСРАР <> КодРегионаЮрАдреса И ЗначениеЗаполнено(КодРегионаЮрАдреса) Тогда
				НаименованиеРегионаЮрАдреса = НаименованиеСубъектаРФ(Число(КодРегионаЮрАдреса));
				КодРегионаСНаименованием = Формат(Число(КодРегионаЮрАдреса), "ЧН=0; ЧГ=; ЧЦ=2; ЧВН=;") + ?(ЗначениеЗаполнено(НаименованиеРегионаЮрАдреса), " - ", "") + НаименованиеРегионаЮрАдреса;
				ДополнительныеПараметры = Новый Структура("ВыполняемоеОповещение, ИтогПроверки", ВыполняемоеОповещение, ИтогПроверки);
				ОписаниеОповещения = Новый ОписаниеОповещения("ВопросРосалкогольрегулированияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
				ТекстВопроса = "Регион заявки для Росалкогольрегулирования отличается от указанного в юридическом адресе (""" + КодРегионаСНаименованием + """). Продолжить?";
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
				Возврат;
			КонецЕсли;
			
			Если ИтогПроверки И ЗначениеЗаполнено(Объект.КодРегионаФСРАР) Тогда
				
				ИнформацияОРегионе = ИнформацияОРегионеФСРАРНаСервере(Объект.КодРегионаФСРАР);
				
				СхемаСдачиОтчетности = ПредопределенноеЗначение("Перечисление.СхемыСдачиОтчетностиФСРАР.СдачаВручную");
				Если ИнформацияОРегионе <> Неопределено Тогда
					СхемаСдачиОтчетности = КонтекстЭДОКлиент.СхемаСдачиОтчетностиФСРАР(Ложь, ИнформацияОРегионе.ТипПортала, Объект.КодРегионаФСРАР);
				КонецЕсли;
				
				Если СхемаСдачиОтчетности = ПредопределенноеЗначение("Перечисление.СхемыСдачиОтчетностиФСРАР.СдачаВручную") Тогда
					ДополнительныеПараметры = Новый Структура("ВыполняемоеОповещение, ИтогПроверки", ВыполняемоеОповещение, ИтогПроверки);
					ОписаниеОповещения = Новый ОписаниеОповещения("ВопросФСРАРСдачаВручнуюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
					ТекстВопроса = "Для выбранного региона поддерживается функция формирования пакета, содержащего подписанную отчетность, для последующей загрузки на соответствующий портал в интернете." + Символы.ВК + Символы.ПС + Символы.ВК + Символы.ПС
						+ "Обратите внимание, функция отправки отчетности непосредственно из программы (кнопка ""Отправить"") в текущей версии не поддерживается. Продолжить?";
					ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ВыполнитьОбработкуПослеПроверки(ВыполняемоеОповещение, ИтогПроверки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросРосалкогольрегулированияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ИтогПроверки = ДополнительныеПараметры.ИтогПроверки;
	ВыполняемоеОповещение = ДополнительныеПараметры.ВыполняемоеОповещение;
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		ИтогПроверки = Ложь;
		ВыполнитьОбработкуПослеПроверки(ВыполняемоеОповещение, ИтогПроверки);
	ИначеЕсли ЗначениеЗаполнено(Объект.КодРегионаФСРАР) Тогда
		
		ИнформацияОРегионе = ИнформацияОРегионеФСРАРНаСервере(Объект.КодРегионаФСРАР);
		
		СхемаСдачиОтчетности = ПредопределенноеЗначение("Перечисление.СхемыСдачиОтчетностиФСРАР.СдачаВручную");
		Если ИнформацияОРегионе <> Неопределено Тогда
			СхемаСдачиОтчетности = КонтекстЭДОКлиент.СхемаСдачиОтчетностиФСРАР(Ложь, ИнформацияОРегионе.ТипПортала, Объект.КодРегионаФСРАР);
		КонецЕсли;
		
		Если СхемаСдачиОтчетности = ПредопределенноеЗначение("Перечисление.СхемыСдачиОтчетностиФСРАР.СдачаВручную") Тогда
			ДопПараметры = Новый Структура("ВыполняемоеОповещение, ИтогПроверки", ВыполняемоеОповещение, ИтогПроверки);
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросФСРАРСдачаВручнуюЗавершение", ЭтотОбъект, ДопПараметры);
			ТекстВопроса = "Для выбранного региона поддерживается функция формирования пакета, содержащего подписанную отчетность, для последующей загрузки на соответствующий портал в интернете." + Символы.ВК + Символы.ПС + Символы.ВК + Символы.ПС
				+ "Обратите внимание, функция отправки отчетности непосредственно из программы (кнопка ""Отправить"") в текущей версии не поддерживается. Продолжить?";
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
		Иначе
			ВыполнитьОбработкуПослеПроверки(ВыполняемоеОповещение, ИтогПроверки);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросФСРАРСдачаВручнуюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ИтогПроверки = ДополнительныеПараметры.ИтогПроверки;
	ВыполняемоеОповещение = ДополнительныеПараметры.ВыполняемоеОповещение;
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		ИтогПроверки = Ложь;
	КонецЕсли;
	
	ВыполнитьОбработкуПослеПроверки(ВыполняемоеОповещение, ИтогПроверки);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработкуПослеПроверки(ВыполняемоеОповещение, ИтогПроверки)
	
	Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();//Пользователи.ТекущийПользователь();
	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, ИтогПроверки);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнформацияОРегионеФСРАРНаСервере(Знач КодРегиона)
	
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	Возврат КонтекстЭДОСервер.ИнформацияОРегионеФСРАР(КодРегиона);
	
КонецФункции

&НаКлиенте
Функция ПроверкаЗаполненияУЦ()
	Если НЕ ЗначениеЗаполнено(Объект.СпецоператорСвязи) ИЛИ СпецоператорИУЦ = Неопределено тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Не выбран Удостоверяющий центр.';ru='Не выбран Удостоверяющий центр.';en='Not selected Certification Authority.'"), ,"СпецоператорИУЦ");
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуКонтактнойИнформацииЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	НовыйАдрес = КонтекстЭДОКлиент.РедактироватьАдресКонвертацияРезультата(РезультатЗакрытия);
	ОбновитьАдрес(НовыйАдрес, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьАдрес(НовыйАдрес, Элемент)
	
	Если НовыйАдрес.Модифицированность Тогда
		Модифицированность = Истина;
		Если Элемент.Имя = "АдресЮридический" Тогда
			Объект.АдресЮридический = НовыйАдрес.Адрес;
			юрАдрес					= НовыйАдрес.АдресПредставление;
		Иначе
			Объект.АдресФактический = НовыйАдрес.Адрес;
			ФактАдрес				= НовыйАдрес.АдресПредставление;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПредставлениеАдресаИзСписка(СписокПолейАдреса)
	
	СтруктураПолей = Новый Структура;
	
	СтруктураПолей.Вставить("Индекс","");
	СтруктураПолей.Вставить("Регион","");
	СтруктураПолей.Вставить("Район","");
	СтруктураПолей.Вставить("Город","");
	СтруктураПолей.Вставить("НаселенныйПункт","");
	СтруктураПолей.Вставить("Улица","");
	СтруктураПолей.Вставить("Дом","");
	СтруктураПолей.Вставить("Корпус","");
	СтруктураПолей.Вставить("Квартира","");
	СтруктураПолей.Вставить("ТипДома","");
	СтруктураПолей.Вставить("ТипКорпуса","");
	СтруктураПолей.Вставить("ТипКвартиры","");
	
	Для каждого ЭлементСписка Из СписокПолейАдреса Цикл
		
		Если СтруктураПолей.Свойство(ЭлементСписка.Представление) Тогда
			СтруктураПолей[ЭлементСписка.Представление] = ЭлементСписка.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	ПредставлениеАдреса = СтруктураПолей.Индекс + ","
	+ СтруктураПолей.Регион + ","
	+ СтруктураПолей.Район + ","
	+ СтруктураПолей.Город + ","
	+ СтруктураПолей.НаселенныйПункт + ","
	+ СтруктураПолей.Улица + ","
	+ ?(ПустаяСтрока(СтруктураПолей.ТипДома), "", СтруктураПолей.ТипДома + " № ") + СтруктураПолей.Дом + ","
	+ ?(ПустаяСтрока(СтруктураПолей.ТипКорпуса), "", СтруктураПолей.ТипКорпуса + " ") + СтруктураПолей.Корпус + ","
	+ ?(ПустаяСтрока(СтруктураПолей.ТипКвартиры), "", СтруктураПолей.ТипКвартиры + " ") + СтруктураПолей.Квартира;
	
	Возврат ПредставлениеАдреса;
	
КонецФункции

&НаКлиенте
Функция ПреобразоватьПредставлениеАдреса(ПредставлениеАдреса)
	
	ЧастьАдреса = СокрЛП(ПредставлениеАдреса);
	
	Если Лев(ПредставлениеАдреса, 3) = "643" ИЛИ Лев(ПредставлениеАдреса, 3) = "999" Тогда
		ЧастьАдреса = СокрЛ(Сред(ЧастьАдреса, 5));
	КонецЕсли;
	
	СтруктураПолей = Новый Структура;
	
	СтруктураПолей.Вставить("Индекс","");
	СтруктураПолей.Вставить("Регион","");
	СтруктураПолей.Вставить("Район","");
	СтруктураПолей.Вставить("Город","");
	СтруктураПолей.Вставить("НаселенныйПункт","");
	СтруктураПолей.Вставить("Улица","");
	СтруктураПолей.Вставить("Дом","");
	СтруктураПолей.Вставить("Корпус","");
	СтруктураПолей.Вставить("Квартира","");
	СтруктураПолей.Вставить("ТипДома","");
	СтруктураПолей.Вставить("ТипКорпуса","");
	СтруктураПолей.Вставить("ТипКвартиры","");
	
	Для каждого ЭлементСтруктуры Из СтруктураПолей Цикл
		
		ПозицияРазд = СтрНайти(ЧастьАдреса, ",");
		Если ПозицияРазд = 0 Тогда
			ЗначениеПоля = ЧастьАдреса;
			ЧастьАдреса = "";
		Иначе
			ЗначениеПоля = Лев(ЧастьАдреса, ПозицияРазд - 1);
			ЧастьАдреса = Сред(ЧастьАдреса, ПозицияРазд + 1);
		КонецЕсли;
		
		СтруктураПолей[ЭлементСтруктуры.Ключ] = СокрЛП(ЗначениеПоля);
		
	КонецЦикла;
	
	СтрПолеАдреса = СтруктураПолей.Дом;
	Для ПозСим = 1 По СтрДлина(СтрПолеАдреса) Цикл
		Если СтрНайти("0123456789", Сред(СтрПолеАдреса, ПозСим, 1)) > 0 Тогда
			СтруктураПолей.Дом = Сред(СтрПолеАдреса, ПозСим);
			СтруктураПолей.ТипДома = СокрЛП(СтрЗаменить(Лев(СтрПолеАдреса, ПозСим - 1), "№", ""));
			Прервать;
		КонецЕсли;
	КонецЦикла;
	СтрПолеАдреса = СтруктураПолей.Корпус;
	Для ПозСим = 1 По СтрДлина(СтрПолеАдреса) Цикл
		Если СтрНайти("0123456789", Сред(СтрПолеАдреса, ПозСим, 1)) > 0 Тогда
			СтруктураПолей.Корпус = Сред(СтрПолеАдреса, ПозСим);
			СтруктураПолей.ТипКорпуса = СокрЛП(Лев(СтрПолеАдреса, ПозСим - 1));
			Прервать;
		КонецЕсли;
	КонецЦикла;
	СтрПолеАдреса = СтруктураПолей.Квартира;
	Для ПозСим = 1 По СтрДлина(СтрПолеАдреса) Цикл
		Если СтрНайти("0123456789", Сред(СтрПолеАдреса, ПозСим, 1)) > 0 Тогда
			СтруктураПолей.Квартира = Сред(СтрПолеАдреса, ПозСим);
			СтруктураПолей.ТипКвартиры = СокрЛП(Лев(СтрПолеАдреса, ПозСим - 1));
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	ЗначенияПолей = Новый СписокЗначений;
	
	Для каждого ЭлементСтруктуры Из СтруктураПолей Цикл
		ЗначенияПолей.Добавить(ЭлементСтруктуры.Значение, ЭлементСтруктуры.Ключ);
	КонецЦикла;
	
	Возврат ЗначенияПолей;
КонецФункции

&НаКлиенте
Процедура ОтправитьЗаявлениеНаСервер()
	
	РежимДиалога = Новый СписокЗначений;
	РежимДиалога.Добавить(КодВозвратаДиалога.Да, "Продолжить");
	РежимДиалога.Добавить(КодВозвратаДиалога.Нет, "Отмена");
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьЗаявлениеНаСерверЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ka='Нажимая <Продолжить>, вы подтверждаете, что принимаете ""Соглашение о присоединении к регламенту удостоверяющего центра"". Продолжить ?';ru='Нажимая <Продолжить>, вы подтверждаете, что принимаете ""Соглашение о присоединении к регламенту удостоверяющего центра"". Продолжить ?';en='Press the <Continue>, you confirm that you accept the ""Agreement on Accession to the rules of the certification center."" Proceed ?'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалога, 0, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗаявлениеНаСерверЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	Попытка
		Записать();
		ЗаполнитьСводнуюИнформацию();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ka='Не удалось записать заявление по причине: %1';ru='Не удалось записать заявление по причине: %1';en='Could not write the statement for a reason:% 1'"),
				ОписаниеОшибки()));
		Возврат;
	КонецПопытки;
	
	ИдентификаторАбонента = "";
	УчетнаяЗаписьОбмена = КонтекстЭДОКлиент.НастройкиУчетнойЗаписиОрганизации(Объект.Организация);
	Если УчетнаяЗаписьОбмена <> Неопределено Тогда
		ИдентификаторАбонента = Строка(УчетнаяЗаписьОбмена.ИдентификаторАбонента);
		ИдентификаторСпецоператора = Строка(УчетнаяЗаписьОбмена.ИдентификаторСпецоператора);
		ДлинаИдентификатораСпецоператора = СтрДлина(ИдентификаторСпецоператора);
		ПрефиксИдентификатораАбонента = Лев(ИдентификаторАбонента, ДлинаИдентификатораСпецоператора);
		
		Если ЗначениеЗаполнено(ИдентификаторСпецоператора) И нрег(ПрефиксИдентификатораАбонента) = нрег(ИдентификаторСпецоператора) Тогда
			ИдентификаторАбонента = Сред(ИдентификаторАбонента, ДлинаИдентификатораСпецоператора + 1);
		КонецЕсли;
	КонецЕсли;
	
	ФормироватьЗакрытыйКлючИЗапросНаСертификат = Истина;
	Если Объект.ТипЗаявления = КонтекстЭДОКлиент.СтруктураСсылочныхДанных.Перечисления_ТипыЗаявленияАбонентаСпецоператораСвязи_Изменение Тогда
		// Если в табличной части ИзменившиесяРеквизитыВторичногоЗаявления указано, что необходимо переиздание сертификата, то переиздаем сертификат  
		СтруктураПоиска = Новый Структура("ИзмененныйРеквизит", ПредопределенноеЗначение("Перечисление.ПараметрыПодключенияК1СОтчетности.ПереизданиеСертификата"));
		ФормироватьЗакрытыйКлючИЗапросНаСертификат = Объект.ИзменившиесяРеквизитыВторичногоЗаявления.НайтиСтроки(СтруктураПоиска).Количество() > 0;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьЗаявлениеНаСерверПослеФормированияЗавершение", ЭтотОбъект);
	
	КонтекстЭДОКлиент.СформироватьИОтправитьЗаявление(
		Объект, 
		ИдентификаторАбонента,, 
		ОписаниеОповещения, 
		ФормироватьЗакрытыйКлючИЗапросНаСертификат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗаявлениеНаСерверПослеФормированияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьСводнуюИнформацию();
	ОповеститьОбИзменении(Объект.Ссылка);
	
	Если Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Подготовлено") Тогда
		Элементы.ОтправитьЗаявление.Доступность	 = Ложь;
		
		Для каждого Элемент из ЭтаФорма.Элементы Цикл
			Попытка
				Элемент.ТолькоПросмотр = Истина;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		Элементы.ПолеHTMLЛицензии.ТолькоПросмотр										 = Ложь;
		Элементы.Получатели.КоманднаяПанель.Доступность									 = Ложь;
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаЗаписатьИЗакрыть.Доступность	 = Ложь;
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаЗаписать.Доступность			 = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОтправкаЗаявления(ТребуетсяПроверка)
	
	// Общая проверка
	Если ТребуетсяПроверка Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаОтправкаЗаявленияЗавершение", ЭтотОбъект);
		ПроверитьЗаполнениеДокумента(ОписаниеОповещения);
	Иначе
		ОтправитьЗаявлениеНаСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОтправкаЗаявленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		ОтправитьЗаявлениеНаСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗарегистрироватьОтвет()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьЗарегистрироватьОтветЗавершение", ЭтотОбъект);
	ОбработкаЗаявленийАбонентаКлиент.ОбновитьСтатусЗаявленияАбонента(ОписаниеОповещения, ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗарегистрироватьОтветЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОповеститьОбИзменении(Объект.Ссылка);
	ЗаполнитьСводнуюИнформацию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПреобразоватьАдресКодРегиона(Адрес,ТипАдреса,ИтогПроверки)
	
	СтрокаАдреса = "";
	
	АдресСписок = ПреобразоватьПредставлениеАдреса(Адрес);
	ЗначРегионаСтрока = АдресСписок[1].Значение;
	
	Если СтрДлина(СокрЛП(ЗначРегионаСтрока)) = 2 Тогда
		СтрокаАдреса = Адрес;
	Иначе
		КодРегиона = РегламентированнаяОтчетностьВызовСервера.КодРегионаПоНазванию(ЗначРегионаСтрока);
		
		Если ПустаяСтрока(КодРегиона) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='%1, неверно указан регион.';ru='%1, неверно указан регион.';en='% 1, has an invalid region.'"),?(ТипАдреса = 0," Юридический адрес"," Фактический адрес")), ,?(ТипАдреса = 0,"ЮрАдрес","ФактАдрес"));
			ИтогПроверки = Ложь;
		Иначе
			АдресСписок[1].Значение = КодРегиона;
			СтрокаАдреса = "643,"+ПолучитьПредставлениеАдресаИзСписка(АдресСписок);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаАдреса) тогда
		Если ТипАдреса = 0 тогда
			Объект.АдресЮридический = СтрокаАдреса;
		Иначе
			Объект.АдресФактический = СтрокаАдреса;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		Модифицированность = Ложь;
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеСотрудника()
	
	Объект.ВладелецЭЦП 						= Неопределено;
	Объект.ВладелецЭЦППодразделение 		= "";
	Объект.ВладелецЭЦПДолжность 			= "";
	Объект.ВладелецЭЦПФамилия	 			= "";
	Объект.ВладелецЭЦПИмя	 				= "";
	Объект.ВладелецЭЦПОтчество 				= "";
	Объект.ВладелецЭЦПВидДокумента 			= ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ПустаяСсылка");
	Объект.ВладелецЭЦПСерияДокумента 		= "";
	Объект.ВладелецЭЦПНомерДокумента 		= "";
	Объект.ВладелецЭЦПДатаВыдачиДокумента   = "";
	Объект.ВладелецЭЦПКемВыданДокумент 		= "";
	Объект.ВладелецЭЦПСНИЛС					= "";
	Объект.ВладелецЭЦПДатаРождения          = Неопределено;
	Объект.ВладелецЭЦПМестоРождения         = Неопределено;
	Объект.ВладелецЭЦПКодПодразделения      = Неопределено;
	Объект.ВладелецЭЦППол                   = Неопределено;
	Объект.ВладелецЭЦПГражданство           = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизитыФормы() 
	
	Объект.ВладелецЭЦПТип					   = Неопределено;
	Объект.АдресФактический                    = "";
	Объект.АдресЮридический                    = "";
	ЮрАдрес                                    = "";
	ФактАдрес                                  = "";
	Объект.ИНН                                 = "";
	Объект.КПП                                 = "";
	Объект.КраткоеНаименование                 = "";
	Объект.ПолноеНаименование                  = "";
	Объект.ТелефонДополнительный               = "";
	Объект.ТелефонОсновной                     = "";
	Объект.ЭлектроннаяПочта                    = "";
	Объект.РегНомерПФР                         = "";
	Объект.РегНомерФСС                         = "";
	Объект.ПризнакОбособленногоПодразделения   = Ложь;
	Объект.КодРегионаФСРАР				   	   = Неопределено;
	ОчиститьДанныеСотрудника();
	Объект.Получатели.Очистить();
	Модифицированность                         = Истина;
	Элементы.АдресЮридический.КнопкаВыбора     = Ложь;
	Элементы.АдресФактический.КнопкаВыбора     = Ложь;
	Элементы.Сотрудник.Видимость          	   = Ложь;
	Объект.ОГРН 							   = "";
	Объект.ВладелецЭЦПСНИЛС 				   = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеВладельцаЭЦП()
	
	ВидВладельцаЭЦП = Объект.ВладелецЭЦПТип;
	
	ДанныеСотрудника = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ПолучитьДанныеСотрудника(
		ВидВладельцаЭЦП, 
		ДанныеОрганизации, 
		Объект.ВладелецЭЦП);
	
	Объект.ВладелецЭЦПИмя                 = ДанныеСотрудника.ФИО.Имя;
	Объект.ВладелецЭЦПФамилия             = ДанныеСотрудника.ФИО.Фамилия;
	Объект.ВладелецЭЦПОтчество            = ДанныеСотрудника.ФИО.Отчество;
	Объект.ВладелецЭЦПВидДокумента        = ДанныеСотрудника.ВидДокумента;
	Объект.ВладелецЭЦПСерияДокумента      = ДанныеСотрудника.Серия;
	Объект.ВладелецЭЦПНомерДокумента      = ДанныеСотрудника.Номер;
	Объект.ВладелецЭЦПДатаВыдачиДокумента = ДанныеСотрудника.ДатаВыдачи;
	Объект.ВладелецЭЦПКемВыданДокумент    = ДанныеСотрудника.КемВыдан;
	Объект.ВладелецЭЦПДолжность           = ДанныеСотрудника.Должность;
	Объект.ВладелецЭЦППодразделение       = ДанныеСотрудника.Подразделение;
	Объект.ВладелецЭЦПСНИЛС               = ДанныеСотрудника.СНИЛС;
	Объект.ВладелецЭЦПДатаРождения        = ДанныеСотрудника.ДатаРождения;
	Объект.ВладелецЭЦПМестоРождения       = ДанныеСотрудника.МестоРождения;
	Объект.ВладелецЭЦППол                 = ДанныеСотрудника.Пол;
	Объект.ВладелецЭЦПГражданство         = ДанныеСотрудника.Гражданство;
	Объект.ВладелецЭЦПКодПодразделения    = ДанныеСотрудника.КодПодразделения;
	
	УстановитьВидимостьКодаПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоОрганизации(ДанныеЗаполнения)
	
	ЮрАдрес 	= ДанныеЗаполнения.ЮрАдрес;
	ФактАдрес 	= ДанныеЗаполнения.ФактАдрес;
	
	СменитьВладельцаЭЦП();
	
	Элементы.Сотрудник.Видимость = Объект.ВладелецЭЦПТип = ПредопределенноеЗначение("Перечисление.ТипыВладельцевЭЦП.ДругойСотрудник");
	
	ТипОрганизации               = ДанныеОрганизации.ТипОрганизации;
	Объект.ТипОрганизации        = ТипОрганизации;
	Объект.ПолноеНаименование    = ДанныеОрганизации.НаимЮЛПол;
	Объект.КраткоеНаименование   = ДанныеОрганизации.КраткоеНаименование;
	Объект.ИНН                   = ДанныеОрганизации.ИННЮЛ;
	Объект.КПП                   = ДанныеОрганизации.КППЮЛ;
	Объект.РегНомерПФР           = ДанныеОрганизации.РегНомПФР;
	Объект.РегНомерФСС           = ДанныеОрганизации.РегистрационныйНомерФСС;
	Объект.АдресЮридический	     = ДанныеЗаполнения.АдресЮридический;
	Объект.АдресФактический      = ДанныеЗаполнения.АдресФактический;
	Объект.ТелефонОсновной       = ДанныеОрганизации.ТелОрганизации;
	Объект.ТелефонДополнительный = ДанныеОрганизации.ТелРук;
	Объект.ОГРН					 = ДанныеОрганизации.ОГРН;
	
	Если ПустаяСтрока(Объект.НомерОсновнойПоставки1с) Тогда
		Объект.НомерОсновнойПоставки1с = ДанныеОрганизации.НомерОсновнойПоставки1с;
	КонецЕсли;
		
	Если ЮрАдрес = ",,,,,,,,," Тогда
		ЮрАдрес = "";
	КонецЕсли;
	
	Если ФактАдрес = ",,,,,,,,," Тогда
		ФактАдрес = "";
	КонецЕсли;
	
	Элементы.АдресЮридический.КнопкаВыбора = Истина;
	Элементы.АдресФактический.КнопкаВыбора = Истина;
	
	Если ТипОрганизации Тогда
		Объект.ПризнакОбособленногоПодразделения	= ДанныеОрганизации.ПризнакОбособленногоПодразделения;
	КонецЕсли;
	
	Элементы.ВладелецЭЦПДолжность.АвтоОтметкаНезаполненного = ТипОрганизации;
	Элементы.ВладелецЭЦПДолжность.ОтметкаНезаполненного 	= ТипОрганизации;
	Элементы.КПП.АвтоОтметкаНезаполненного 					= ТипОрганизации;
	Элементы.КПП.ОтметкаНезаполненного 						= ПустаяСтрока(Объект.КПП) И ТипОрганизации;
	Элементы.ОГРН.АвтоОтметкаНезаполненного 				= ТипОрганизации;
	Элементы.ОГРН.ОтметкаНезаполненного 					= ПустаяСтрока(Объект.ОГРН) И ТипОрганизации;
	

	Объект.ЭлектроннаяПочта 	=  ДанныеОрганизации.ЭлектроннаяПочта;
	Объект.ДополнительныйКодФСС = ДанныеОрганизации.РеквизитДопКодФСС;
	
	КонтекстЭДОКлиент.ПоказатьДопКодФСС(
		ДанныеОрганизации.РеквизитДопКодФСС,
		Элементы.ДополнительныйКодФСС,
		Объект.ПризнакОбособленногоПодразделения,
		Объект.РегНомерФСС);

	ВосстановитьНаправленияПоУмолчанию(Истина);
	
	Объект.КодРегионаФСРАР = РегламентированнаяОтчетностьКлиентСервер.РазложитьАдрес(Объект.АдресЮридический).Регион;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьОрганизацию()
	Булево = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Сначала укажите организацию!';ru='Сначала укажите организацию!';en='First, enter the organization!'"), ,"Объект.Организация");
		Булево = Истина;
	КонецЕсли;
	Возврат Булево;
КонецФункции

&НаКлиенте
Процедура СменитьВладельцаЭЦП()
	
	Если Объект.ВладелецЭЦПТип = ПредопределенноеЗначение("Перечисление.ТипыВладельцевЭЦП.Руководитель") Тогда 
		Объект.ВладелецЭЦП = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПереопределяемый.Руководитель(Объект.Организация);
	ИначеЕсли Объект.ВладелецЭЦПТип = ПредопределенноеЗначение("Перечисление.ТипыВладельцевЭЦП.ГлавныйБухгалтер") Тогда
		Объект.ВладелецЭЦП = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПереопределяемый.ГлБухгалтер(Объект.Организация);
	ИначеЕсли Объект.ВладелецЭЦПТип = ПредопределенноеЗначение("Перечисление.ТипыВладельцевЭЦП.ДругойСотрудник") Тогда
		// Ничего не делаем
	ИначеЕсли Объект.ВладелецЭЦПТип = ПредопределенноеЗначение("Перечисление.ТипыВладельцевЭЦП.ПустаяСсылка") Тогда
		Объект.ВладелецЭЦПТип = ПредопределенноеЗначение("Перечисление.ТипыВладельцевЭЦП.Руководитель");
	КонецЕсли;
	
	Элементы.Сотрудник.Видимость = Объект.ВладелецЭЦПТип = ПредопределенноеЗначение("Перечисление.ТипыВладельцевЭЦП.ДругойСотрудник");
	
	ЗаполнитьДанныеВладельцаЭЦП();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусПослеПроверкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОтправитьЗаявлениеНаРегистрациюЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ka='Вы уверены, что хотите отправить заявление на регистрацию?';ru='Вы уверены, что хотите отправить заявление на регистрацию?';en='Are you sure you want to send an application for registration?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПолучитьЗарегистрироватьОтвет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОтправитьЗаявлениеНаРегистрациюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПроверкаОтправкаЗаявления(Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыборКриптопровайдераПриИзмененииЗавершение(СтруктураВозврата, ДополнительныеПараметры) Экспорт
	
	КриптопровайдерРекомендация = СтруктураВозврата.КриптопровайдерРекомендация;
	Элементы.ПолеКартинкиВнимание48.Видимость = СтруктураВозврата.КартинкаВидимость;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭлементыСтраницыОтчетностьВФСРАР(Форма)
	
	Элементы 	= Форма.Элементы;
	Объект 		= Форма.Объект;
	
	ПризнакПоддержкиФСРАР = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ПолучитьПараметрСпецоператора(Объект.СпецоператорСвязи, "ФСРАРПризнак");
	ПризнакПоддержкиФСРАР = (ПризнакПоддержкиФСРАР = Истина ИЛИ ПризнакПоддержкиФСРАР = "Истина");
	
	ДоступностьПодачиЗаявкиНаСертификатДляФСРАР = 
		ЗначениеЗаполнено(Объект.Организация) 
		И ПризнакПоддержкиФСРАР 
		И (Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Подготовлено"));
	
	ДоступностьЭлементов = 
		ДоступностьПодачиЗаявкиНаСертификатДляФСРАР 
		И Объект.ПодатьЗаявкуНаСертификатДляФСРАР;
	
	Элементы.ПодатьЗаявкуНаСертификатДляФСРАР.Доступность = ДоступностьПодачиЗаявкиНаСертификатДляФСРАР;
	
	Элементы.КодРегионаФСРАР.ТолькоПросмотр 			= НЕ ДоступностьЭлементов;
	Элементы.КодРегионаФСРАР.АвтоВыборНезаполненного 	= ДоступностьЭлементов;
	Элементы.КодРегионаФСРАР.АвтоОтметкаНезаполненного 	= ДоступностьЭлементов;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭлементыСтраницыОтчетностьВРПН(Форма)
	
	Элементы 	= Форма.Элементы;
	Объект 		= Форма.Объект;
	
	ПризнакПоддержкиРПН = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ПолучитьПараметрСпецоператора(Объект.СпецоператорСвязи, "РПНПризнак");
	ПризнакПоддержкиРПН = (ПризнакПоддержкиРПН = Истина ИЛИ ПризнакПоддержкиРПН = "Истина");
	
	ДоступностьПодачиЗаявкиНаСертификатДляРПН = 
		ЗначениеЗаполнено(Объект.Организация) 
		И ПризнакПоддержкиРПН 
		И (Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Подготовлено"));
	
	Элементы.ПодатьЗаявкуНаПодключениеРПН.Доступность = ДоступностьПодачиЗаявкиНаСертификатДляРПН;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭлементыСтраницыОтчетностьВФТС(Форма)
	
	Элементы 	= Форма.Элементы;
	Объект 		= Форма.Объект;
	
	ПризнакПоддержкиФТС = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ПолучитьПараметрСпецоператора(Объект.СпецоператорСвязи, "ФТСПризнак");
	ПризнакПоддержкиФТС = (ПризнакПоддержкиФТС = Истина ИЛИ ПризнакПоддержкиФТС = "Истина");
	
	ДоступностьПодачиЗаявкиНаСертификатДляФТС = 
		ЗначениеЗаполнено(Объект.Организация) 
		И ПризнакПоддержкиФТС 
		И (Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Подготовлено"));
	
	Элементы.ПодатьЗаявкуНаПодключениеФТС.Доступность = ДоступностьПодачиЗаявкиНаСертификатДляФТС;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НаименованиеСубъектаРФ(КодРегиона)
	
	Результат = "";
	
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	МакетКодыРегионов = КонтекстЭДОСервер.ПолучитьМакет("ФСРАРПорталыРегионов");
	
	НомерКолонкиКодРегиона = МакетКодыРегионов.Область("КодРегиона").Лево;
	НомерКолонкиНаименованиеРегиона = МакетКодыРегионов.Область("НаименованиеРегиона").Лево;
	ОбластьПоискаКодаРегиона = МакетКодыРегионов.Область(1, НомерКолонкиКодРегиона, МакетКодыРегионов.ВысотаТаблицы, НомерКолонкиКодРегиона);
	
	ОбластьСКодомРегиона = МакетКодыРегионов.НайтиТекст(Формат(Число(КодРегиона), "ЧН=0; ЧГ=; ЧЦ=2; ЧВН=;"), , ОбластьПоискаКодаРегиона, , Истина);
	
	Если ОбластьСКодомРегиона <> Неопределено Тогда
		Результат = МакетКодыРегионов.Область(ОбластьСКодомРегиона.Верх, НомерКолонкиНаименованиеРегиона, ОбластьСКодомРегиона.Верх, НомерКолонкиНаименованиеРегиона).Текст;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораРегионовРФ()
	
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	МакетРегионов = КонтекстЭДОСервер.ПолучитьМакет("ФСРАРПорталыРегионов");
	
	Для НомСтр = 1 По МакетРегионов.ВысотаТаблицы Цикл
		
		КодРегиона = СокрЛП(МакетРегионов.Область(НомСтр, 1, НомСтр, 1).Текст);
		НазваниеРегиона = СокрЛП(МакетРегионов.Область(НомСтр, 2, НомСтр, 2).Текст);
		
		Если ЗначениеЗаполнено(КодРегиона) Тогда
			Элементы.КодРегионаФСРАР.СписокВыбора.Добавить(КодРегиона, КодРегиона + " - " + НазваниеРегиона);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеОбъекта()
	Объект.Статус 				= Объект.Ссылка.Статус;
	Объект.СтатусКомментарий 	= Объект.Ссылка.СтатусКомментарий;
	Объект.УчетнаяЗапись 		= Объект.Ссылка.УчетнаяЗапись;
	Объект.ДатаПолученияОтвета 	= Объект.Ссылка.ДатаПолученияОтвета;
КонецПроцедуры	

&НаСервере
Процедура ДобавитьЖелтыеСтроки()
	
	ПорядковыйНомерСтроки = 0;
	
	КоличествоСтрок = ТаблицаДанныхЗаявленияНаПодключение.Количество();
	КоличествоИзмененныхСтрок = ТаблицаДанныхЗаявленияНаПодключение.НайтиСтроки(Новый Структура("ЭтотПараметрИзменился", Истина)).Количество();
	
	ДобавитьВТаблицу("Изменяемые настройки подключения",,,,,0); // заголовок
	
	Для сч = 0 По КоличествоСтрок - 1 Цикл
		СтрокаТаблицаДанных = ТаблицаДанныхЗаявленияНаПодключение[сч];
		Если СтрокаТаблицаДанных.ЭтотПараметрИзменился Тогда
			ДобавитьВТаблицу(СтрокаТаблицаДанных.НазваниеРеквизита, СтрокаТаблицаДанных.ЗначениеРеквизита, СтрокаТаблицаДанных.ЭтотПараметрИзменился, Ложь, Истина);
		КонецЕсли;
		СтрокаТаблицаДанных.РазрешеноРедактирование = (НЕ СтрокаТаблицаДанных.ВыделятьСтрокуЖирным И НЕ СтрокаТаблицаДанных.НазваниеРеквизита = "");
		СтрокаТаблицаДанных.ПорядковыйНомерСтроки = СтрокаТаблицаДанных.ПорядковыйНомерСтроки + КоличествоИзмененныхСтрок + 1;
	КонецЦикла;
	
	ДобавитьВТаблицу("",,,,,КоличествоИзмененныхСтрок + 1); // заголовок
	
	ТаблицаДанныхЗаявленияНаПодключение.Сортировать("ПорядковыйНомерСтроки");

КонецПроцедуры

&НаСервере
Процедура ДобавитьВТаблицу(
		ИзмененныйРеквизит,  
		ЗначениеРеквизита = "",
		ЭтотПараметрИзменился = Неопределено,
		ВыделятьЖирным = Ложь, 
		ВыделятьСтрокуЖелтым = Ложь,
		НомерСтроки = Неопределено)
	
	НоваяСтрока = ТаблицаДанныхЗаявленияНаПодключение.Добавить();
	
	Если ТипЗнч(ИзмененныйРеквизит) = Тип("Строка") Тогда
		НоваяСтрока.НазваниеРеквизита = ИзмененныйРеквизит;
	Иначе
		НоваяСтрока.ИзмененныйРеквизит		= ИзмененныйРеквизит;
		НоваяСтрока.НазваниеРеквизита 		= Строка(ИзмененныйРеквизит);
	КонецЕсли;
	
	НоваяСтрока.ЗначениеРеквизита		= ЗначениеРеквизита;
	НоваяСтрока.ВыделятьСтрокуЖирным 	= ВыделятьЖирным;
	НоваяСтрока.ВыделятьСтрокуЖелтым 	= ВыделятьСтрокуЖелтым;
	
	Если ЭтотПараметрИзменился = Неопределено Тогда
		Если ЭтотПараметрИзменился(ИзмененныйРеквизит) Тогда
			НоваяСтрока.ЭтотПараметрИзменился 	= Истина;
		КонецЕсли;
	Иначе
		НоваяСтрока.ЭтотПараметрИзменился = ЭтотПараметрИзменился;
	КонецЕсли;
	
	НоваяСтрока.РазрешеноРедактирование = Ложь;
	
	Если НомерСтроки = Неопределено Тогда 
		ПорядковыйНомерСтроки = ПорядковыйНомерСтроки + 1;
		НоваяСтрока.ПорядковыйНомерСтроки	= ПорядковыйНомерСтроки;
	Иначе
		НоваяСтрока.ПорядковыйНомерСтроки	= НомерСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКодыФНСПрописью(Знач ТаблицаКодовФНС)

	Результат = "";
	КоличествоКодовФНС = ТаблицаКодовФНС.Количество();
	Если КоличествоКодовФНС = 1 Тогда
		Результат = ТаблицаКодовФНС[0].КодПолучателя + ?(ТаблицаКодовФНС[0].КПП = "","" ,"-") + ТаблицаКодовФНС[0].КПП;
	ИначеЕсли КоличествоКодовФНС > 1 Тогда
		Результат = НСтр("ka='Коды ФНС (%1)';ru='Коды ФНС (%1)';en='FTS codes (1%)'");
		Результат = СтрЗаменить(Результат, "%1", Строка(КоличествоКодовФНС));
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКодыРосстатПрописью(Знач Получатели)
	
	Результат = "";
	КоличествоКодовФСГС = Получатели.Количество();
	Если КоличествоКодовФСГС = 1 Тогда
		Результат = Получатели[0].КодПолучателя;
	ИначеЕсли КоличествоКодовФСГС > 1 Тогда
		Результат = НСтр("ka='Коды Росстата (%1)';ru='Коды Росстата (%1)';en='Rosstata codes (1%)'");
		Результат = СтрЗаменить(Результат, "%1", Строка(КоличествоКодовФСГС));
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура СформироватьТаблицуИзмененныхДанных()
	
	ПорядковыйНомерСтроки = 0;
	
	ТаблицаДанныхЗаявленияНаПодключение.Очистить();
	
	// Общие сведения
	ДобавитьВТаблицу("Общие сведения", , , Истина); // заголовок 
	
	// Криптопровайдер
	Криптопровайдер = ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПолучитьПараметрыКриптопровайдера(Объект.ТипКриптопровайдера);
	ОтображаемоеНазваниеКриптопровайдера = "";
	Если ЗначениеЗаполнено(Криптопровайдер) Тогда
		ОтображаемоеНазваниеКриптопровайдера = Криптопровайдер.ОтображаемоеНазвание;
	КонецЕсли;
	
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.Криптопровайдер, ОтображаемоеНазваниеКриптопровайдера);
	
	// Регистрационный номер программы
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.НомерОсновнойПоставки1С, Объект.НомерОсновнойПоставки1с);
	
	ПереизданиеСертификата = ЭтотПараметрИзменился(Перечисления.ПараметрыПодключенияК1СОтчетности.ПереизданиеСертификата);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ПереизданиеСертификата, ПереизданиеСертификата);
	
	ПродлитьАбонентскийСертификат = ЭтотПараметрИзменился(Перечисления.ПараметрыПодключенияК1СОтчетности.ПродлениеАбонентскогоСертификата);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ПродлениеАбонентскогоСертификата, ПродлитьАбонентскийСертификат, ПродлитьАбонентскийСертификат);
	
	ПродлитьЛицензию = ЭтотПараметрИзменился(Перечисления.ПараметрыПодключенияК1СОтчетности.ПродлениеЛицензии);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ПродлениеЛицензии, ПродлитьЛицензию, ПродлитьЛицензию);
	
	// Сведения об организации
	ДобавитьВТаблицу("Сведения об организации", , , Истина); // заголовок 
	
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.КраткоеНаименование, Объект.КраткоеНаименование);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ПолноеНаименование, Объект.ПолноеНаименование);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ИНН, Объект.ИНН, Ложь); // ИНН запрещено менять
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.КПП, Объект.КПП);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ОГРН, Объект.ОГРН);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.РегНомерПФР, Объект.РегНомерПФР);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.РегНомерФСС, Объект.РегНомерФСС);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.АдресЮридический, 
		РегламентированнаяОтчетностьКлиентСервер.ПредставлениеАдресаВФормате9Запятых(Объект.АдресЮридический, Истина));
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.КодРегионаФСРАР, Объект.КодРегионаФСРАР);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ТелефонОсновной, Объект.ТелефонОсновной);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ТелефонДополнительный, Объект.ТелефонДополнительный);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ЭлектроннаяПочта, Объект.ЭлектроннаяПочта); 
	
	// Сведения о сотруднике - владельце электронной подписи
	ДобавитьВТаблицу("Сведения о сотруднике - владельце электронной подписи", , , Истина); // заголовок
	
	ФИОВладельцаЭЦП = Объект.ВладелецЭЦПФамилия + " " + Объект.ВладелецЭЦПИмя + " " + Объект.ВладелецЭЦПОтчество;
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦП, ФИОВладельцаЭЦП);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦПДолжность, Объект.ВладелецЭЦПДолжность);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦППодразделение, Объект.ВладелецЭЦППодразделение);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦПСНИЛС, Объект.ВладелецЭЦПСНИЛС);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦПДатаРождения, Формат(Объект.ВладелецЭЦПДатаРождения, "ДЛФ=D"));
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦППол, Объект.ВладелецЭЦППол);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦПГражданство, Объект.ВладелецЭЦПГражданство, Ложь);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦПВидДокумента, Объект.ВладелецЭЦПВидДокумента, Ложь);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦПСерияДокумента, Строка(Объект.ВладелецЭЦПСерияДокумента), Ложь);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦПНомерДокумента, Строка(Объект.ВладелецЭЦПНомерДокумента), Ложь);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦПКемВыданДокумент, Объект.ВладелецЭЦПКемВыданДокумент, Ложь);
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦПДатаВыдачиДокумента, Объект.ВладелецЭЦПДатаВыдачиДокумента, Ложь);
	
	ПаспортРФ = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
		"Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ");
		
	Если Объект.ВладелецЭЦПВидДокумента = ПаспортРФ Тогда
		ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦПКодПодразделения, Объект.ВладелецЭЦПКодПодразделения);
	КонецЕсли;
		
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦПМестоРождения, Объект.ВладелецЭЦПМестоРождения);
		
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ВладелецЭЦПКемВыданДокумент, Объект.ВладелецЭЦПКемВыданДокумент, Ложь);
	
	ОператорПоддерживаетСМСУведомление = (ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ПолучитьПараметрСпецоператора(СпецоператорИУЦ, "ПризнакПоддержкиСМС") = "Истина");
	Если ОператорПоддерживаетСМСУведомление Тогда
		ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.ТелефонМобильный, Объект.ТелефонМобильный);
	КонецЕсли;
	
	// Сведения о контролирующих органах
	ДобавитьВТаблицу("Сведения о контролирующих органах", , , Истина); // заголовок
	
	// ФНС
	СтрокиСФНС = Объект.Получатели.НайтиСтроки(Новый Структура("ТипПолучателя", Перечисления.ТипыКонтролирующихОрганов.ФНС));
	СдаватьВФНС = СтрокиСФНС.Количество() > 0;
	
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.СдаватьВФНС, СдаватьВФНС);
	Если СдаватьВФНС Тогда
		КодыФНСПрописью = ПолучитьКодыФНСПрописью(СтрокиСФНС);
		ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.КодыФНС, КодыФНСПрописью);
	Иначе
		ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.КодыФНС, "", Ложь);
	КонецЕсли;
	
	// ПФР
	СтрокиСПФР = Объект.Получатели.НайтиСтроки(Новый Структура("ТипПолучателя", Перечисления.ТипыКонтролирующихОрганов.ПФР));
	СдаватьВПФР = СтрокиСПФР.Количество() > 0;
	
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.СдаватьВПФР, СдаватьВПФР);
	Если СдаватьВПФР Тогда
		ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.КодПФР, СтрокиСПФР[0].КодПолучателя);
	Иначе
		ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.КодПФР, "", Ложь);
	КонецЕсли;
		
	// ФСС
	СтрокиСФСС = Объект.Получатели.НайтиСтроки(Новый Структура("ТипПолучателя", Перечисления.ТипыКонтролирующихОрганов.ФСС));
	СдаватьВФСС = СтрокиСФСС.Количество() > 0;
	
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.СдаватьВФСС, СдаватьВФСС);
	
	// Росстат
	СтрокиСРосстат = Объект.Получатели.НайтиСтроки(Новый Структура("ТипПолучателя", Перечисления.ТипыКонтролирующихОрганов.ФСГС));
	СдаватьВРосстат = СтрокиСРосстат.Количество() > 0;
	
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.СдаватьВРосстат, СдаватьВРосстат);
	Если СдаватьВРосстат Тогда
		КодыРосстатПрописью = ПолучитьКодыРосстатПрописью(СтрокиСРосстат);
		ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.КодРосстата, КодыРосстатПрописью);
	Иначе
		ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.КодРосстата, "");
	КонецЕсли;
	
	// Росалкогольрегулирование
	СдаватьВФСРАР = Объект.ПодатьЗаявкуНаСертификатДляФСРАР;
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.СдаватьВФСРАР, СдаватьВФСРАР);
	
	// Росприроднадзор
	СдаватьВРПН = Объект.ПодатьЗаявкуНаПодключениеРПН;
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.СдаватьВРПН, СдаватьВРПН);
	
	// ФТС
	СдаватьВФТС = Объект.ПодатьЗаявкуНаПодключениеФТС;
	ДобавитьВТаблицу(Перечисления.ПараметрыПодключенияК1СОтчетности.СдаватьВФТС, СдаватьВФТС);
	
	Если Объект.ПодключитьЭДО Тогда
		// Отображение данных по подключению ЭДО
		ДобавитьВТаблицу("Подключение к сервису 1С-ЭДО", , , Истина); // заголовок
		ДобавитьВТаблицу("Подключиться к сервису", Истина);
		Если Объект.ПодключитьЭДО Тогда
			ДобавитьВТаблицу("Оператор ЭДО", Объект.ОператорЭДО);
			ДобавитьВТаблицу("Код ФНС", Объект.КодНалоговогоОрганаЭДО);
			ДобавитьВТаблицу("Юридический адрес", ЮрАдрес);
		КонецЕсли;
	КонецЕсли;
	
	// Выделяем желтым измененные строки
	ДобавитьЖелтыеСтроки();
	
КонецПроцедуры

&НаСервере
Функция ЭтоЗаявлениеНаИзменениеРеквизитовПодключения(Заявление)
	
	Возврат Заявление.ТипЗаявления = ПредопределенноеЗначение("Перечисление.ТипыЗаявленияАбонентаСпецоператораСвязи.Изменение");
	
КонецФункции

&НаСервере
Функция ЭтотПараметрИзменился(ИзмененныйРеквизит)
	
	СтруктураПоиска = Новый Структура("ИзмененныйРеквизит", ИзмененныйРеквизит);
	Возврат Объект.ИзменившиесяРеквизитыВторичногоЗаявления.НайтиСтроки(СтруктураПоиска).Количество() > 0;
	
КонецФункции

&НаКлиенте
Процедура ПодсказкаСервисЭДООбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(СсылкаОписаниеСервисаЭДО) Тогда
		ПерейтиПоНавигационнойСсылке(СсылкаОписаниеСервисаЭДО);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти