#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ОшибкаЗаполнения Экспорт;

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ПометкаУдаления ИЛИ Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = "Доверенность" + ?(ЗначениеЗаполнено(НомерДовер), " №" + НомерДовер, "") + " от " + Формат(ДатаВыдачи, "ДФ='dd.MM.yyyy ""г.""'");
	
	Заголовок = "Запись доверенности налогоплательщика (" + Владелец + ") " + Наименование + ", код " + Код;
	
	// Проверка заполнения обязательных реквизитов
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Не выбрана организация налогоплательщика';ru='Не выбрана организация налогоплательщика';en='Organization of the taxpayer is not selected'"), ЭтотОбъект, "Владелец", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаВыдачи) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='მინდობილობის გაცემის თარიღი არ არის მითითებული';ru='Не указана дата выдачи доверенности';en='Not the date of issuance of power of attorney'"), ЭтотОбъект, "ДатаВыдачи", , Отказ);
	КонецЕсли;
	
	Если ПолномочияПредставителя.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='წარმომადგენლის უფლებამოსილების შესახებ ინფორმაცია არ არის შევსებული';ru='Не заполнены сведения о полномочиях представителя';en=""information about the representative's powers are not filled"""), ЭтотОбъект, "ПолномочияПредставителя", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// проверяем юрлицо-представителя
	Если ПредставительЯвляетсяЮЛ Тогда
		
		// проверка ИНН юрлица-представителя
		Если ЗначениеЗаполнено(ПредставительЮЛ_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(ПредставительЮЛ_ИНН, Ложь) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='წარმომადგენელი ორგანზიაციის გსნ არაკორექტულად არის მიცემული';ru='Некорректно задан ИНН организации-представителя';en='Incorrectly set TIN organization representative'"), ЭтотОбъект, "ПредставительЮЛ_ИНН", , Отказ);
		КонецЕсли;
		
		// проверка КПП юрлица-представителя
		Если ЗначениеЗаполнено(ПредставительЮЛ_КПП) И НЕ РегламентированнаяОтчетностьКлиентСервер.КППСоответствуетТребованиям(ПредставительЮЛ_КПП) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Некорректно задан КПП организации-представителя';ru='Некорректно задан КПП организации-представителя';en='Incorrectly set PPC organization representative'"), ЭтотОбъект, "ПредставительЮЛ_КПП", , Отказ);
		КонецЕсли;
		
		// проверка ОГРН юрлица-представителя
		Если ЗначениеЗаполнено(ПредставительЮЛ_ОГРН) И СтрДлина(СокрЛП(ПредставительЮЛ_ОГРН)) <> 13 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Некорректно задан ОГРН организации-представителя';ru='Некорректно задан ОГРН организации-представителя';en='Incorrectly specified BIN organization representative'"), ЭтотОбъект, "ПредставительЮЛ_ОГРН", , Отказ);
		КонецЕсли;
		
	Иначе
		
		//представитель является физлицом
		Если НЕ ПредставительЯвляетсяСотрудником Тогда
			//должен быть заполнен ИНН физлица-представителя
			Если НЕ ЗначениеЗаполнено(ПредставительФЛ_ИНН) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='У представителя, являющегося физлицом и не являющегося сотрудником организации должен быть задан ИНН';ru='У представителя, являющегося физлицом и не являющегося сотрудником организации должен быть задан ИНН';en='In representative being natural persons, and not an employee of the organization must be defined INN'"), ЭтотОбъект, "ПредставительФЛ_ИНН", , Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// проверяем физлицо-представителя
	
	// проверка ИНН физлица-представителя
	Если ЗначениеЗаполнено(ПредставительФЛ_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(ПредставительФЛ_ИНН, Истина) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='ფიზპირის-წარმომადგენლის გსნ არაკორექტულად არის მიცემული';ru='Некорректно задан ИНН физлица-представителя';en='Incorrectly set TIN physical persons representative'"), ЭтотОбъект, "ПредставительФЛ_ИНН", , Отказ);
	КонецЕсли;
	
	// проверка ОГРН физлица-представителя
	Если ЗначениеЗаполнено(ПредставительФЛ_ОГРН) И СтрДлина(СокрЛП(ПредставительФЛ_ОГРН)) <> 15 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='ფიზპირის-წარმომადგენლის ძსსნ არაკორექტულად არის მიცემული';ru='Некорректно задан ОГРН физлица-представителя';en='Incorrectly specified BIN physical persons representative'"), ЭтотОбъект, "ПредставительФЛ_ОГРН", , Отказ);
	КонецЕсли;
	
	Если ПризнакДоверителя = 2 ИЛИ ПризнакДоверителя = 3 Тогда
		
		// проверяем юрлицо-доверителя
		Если ПризнакДоверителя = 3 И ДоверительЯвляетсяЮЛ Тогда // доверитель - уполномоченный представитель
			
			// проверка ИНН юрлица-доверителя
			Если ЗначениеЗаполнено(ДоверительЮЛ_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(ДоверительЮЛ_ИНН, Ложь) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Некорректно задан ИНН доверителя-юрлица';ru='Некорректно задан ИНН доверителя-юрлица';en='Incorrectly set TIN-principal legal entity'"), ЭтотОбъект, "ДоверительЮЛ_ИНН", , Отказ);
			КонецЕсли;
			
			// проверка КПП юрлица-доверителя
			Если ЗначениеЗаполнено(ДоверительЮЛ_КПП) И НЕ РегламентированнаяОтчетностьКлиентСервер.КППСоответствуетТребованиям(ДоверительЮЛ_КПП) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='მრწმუნებელი იურიდ.პირის აამკ არაკორექტულად არის მიცემული';ru='Некорректно задан КПП доверителя-юрлица';en='Incorrectly set-PPC principal legal entity'"), ЭтотОбъект, "ДоверительЮЛ_КПП", , Отказ);
			КонецЕсли;
			
			// проверка ОГРН юрлица-доверителя
			Если ЗначениеЗаполнено(ДоверительЮЛ_ОГРН) И СтрДлина(СокрЛП(ДоверительЮЛ_ОГРН)) <> 13 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='რწმუნებული-იურიდპირის ძსსნ არაკორექტულად არის მიცემული';ru='Некорректно задан ОГРН доверителя-юрлица';en='Incorrectly set-BIN principal legal entity'"), ЭтотОбъект, "ДоверительЮЛ_ОГРН", , Отказ);
			КонецЕсли;
			
			// проверка ИНН руководителя юрлица-доверителя
			Если ЗначениеЗаполнено(ДоверительРук_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(ДоверительРук_ИНН, Истина) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='რწმუნებული ორგანიზაციის ხელმძღვანელის გსნ არაკორექტულად არის მიცემული';ru='Некорректно задан ИНН руководителя организации-доверителя';en='Incorrectly set TIN head of the organization, the principal'"), ЭтотОбъект, "ДоверительРук_ИНН", , Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		// проверяем физлицо-доверителя
		Если ПризнакДоверителя = 2 ИЛИ (ПризнакДоверителя = 3 И ДоверительИмеетУЛ) Тогда
			
			// проверка ИНН физлица-доверителя
			Если ЗначениеЗаполнено(ДоверительФЛ_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(ДоверительФЛ_ИНН, Истина) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Некорректно задан ИНН физлица-доверителя';ru='Некорректно задан ИНН физлица-доверителя';en='Incorrectly set TIN physical persons-principal'"), ЭтотОбъект, "ДоверительФЛ_ИНН", , Отказ);
			КонецЕсли;
			
			// проверка ОГРН физлица-доверителя
			Если ЗначениеЗаполнено(ДоверительФЛ_ОГРН) И СтрДлина(СокрЛП(ДоверительФЛ_ОГРН)) <> 15 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='ფიზპირის-მრწმუნებელის იმძსსნ არაკორექტულად არის მიცემული';ru='Некорректно задан ОГРНИП физлица-доверителя';en='Incorrectly set OGRN physical persons-principal'"), ЭтотОбъект, "ДоверительФЛ_ОГРН", , Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// проверяем нотариуса
	Если ЗаверенаНотариально Тогда
		
		// проверяем юрлицо-нотариус
		Если НотариусЯвляетсяЮЛ Тогда
			
			// проверка ИНН юрлица-нотариуса
			Если ЗначениеЗаполнено(НотариусЮЛ_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(НотариусЮЛ_ИНН, Ложь) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Некорректно задан ИНН юрлица нотариуса';ru='Некорректно задан ИНН юрлица нотариуса';en='Incorrectly set TIN legal entity notary'"), ЭтотОбъект, "НотариусЮЛ_ИНН", , Отказ);
			КонецЕсли;
			
			// проверка КПП юрлица-нотариуса
			Если ЗначениеЗаполнено(НотариусЮЛ_КПП) И НЕ РегламентированнаяОтчетностьКлиентСервер.КППСоответствуетТребованиям(НотариусЮЛ_КПП) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='ნოტარიუსის იურიდპირის გსნ არაკორექტულად არის მიცემული';ru='Некорректно задан КПП юрлица нотариуса';en='Incorrectly set PPC legal entity notary'"), ЭтотОбъект, "НотариусЮЛ_КПП", , Отказ);
			КонецЕсли;
			
			// проверка ОГРН юрлица-нотариуса
			Если ЗначениеЗаполнено(НотариусЮЛ_ОГРН) И СтрДлина(СокрЛП(НотариусЮЛ_ОГРН)) <> 13 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='იურიდპირის ნოტარიუსის ძსსნ არაკორექტულად არის მიცემული';ru='Некорректно задан ОГРН юрлица нотариуса';en='Incorrectly specified BIN legal entity notary'"), ЭтотОбъект, "НотариусЮЛ_ОГРН", , Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		// проверка ИНН юрлица-нотариуса
		Если ЗначениеЗаполнено(НотариусФЛ_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(НотариусФЛ_ИНН, Истина) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='ნოტარიუსის-ფიზპირის პ.ნ არაკორექტულად არის მიცემული';ru='Некорректно задан ИНН нотариуса-физлица';en='Incorrectly set TIN-physical persons notary'"), ЭтотОбъект, "НотариусФЛ_ИНН", , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("Справочники.Организации");
        Владелец = Модуль.ОрганизацияПоУмолчанию();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли