#Область ПеременныеМодуля

&НаКлиенте
Перем AzRyСтараяОрганизацияПоУмолчанию;

#КонецОбласти

#Область СобытияФормы

&НаСервере
Процедура РасшAzRy_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ЭтотОбъект.AzRyОрганизацияAzRyPay = ПолучитьОрганизациюAzRyPay();
		ЭтотОбъект.AzRyОрганизацияПользователяПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_ПриОткрытииПосле(Отказ)

	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_ПослеЗаписиПосле(ПараметрыЗаписи)

	// При первой записи нового контрагента AzRyОрганизацияПоУмолчанию ещё не установлена —
	// устанавливаем найденную запись и выполняем повторную запись
	Если Не ЗначениеЗаполнено(Объект.AzRyОрганизацияПоУмолчанию) Тогда
		НоваяОргПУ = НайтиОрганизациюПоУмолчаниюКонтрагента();
		Если ЗначениеЗаполнено(НоваяОргПУ) Тогда
			Объект.AzRyОрганизацияПоУмолчанию = НоваяОргПУ;
			Записать();
			Возврат;
		КонецЕсли;
	КонецЕсли;

	// После записи скрываем группы, которые нужны только при создании нового контрагента
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)

	Если НужноОткрыватьФормуДополнительныхДанныхКонтрагента() И Объект.Ссылка.Пустая() Тогда

		НаименованиеНеЗаполнено = Не ЗначениеЗаполнено(Объект.Наименование) Или Не ЗначениеЗаполнено(Объект.НаименованиеПолное);
		ИНННеЗаполнен = Не ЗначениеЗаполнено(Объект.ИНН);
		ДокументНеЗаполнен = ЭтоФизическоеЛицо() И Не ЗначениеЗаполнено(Объект.ДокументУдостоверяющийЛичность);

		Если НаименованиеНеЗаполнено Тогда
			Отказ = Истина; // отменяем текущую запись
			Сообщить(НСТР("ka = 'კონტრაგენტის დასახელების შევსება სავალდებულოა!'; ru = 'Заполнение наименования контрагента обязательно!'; en = 'Contractor name is required!'"), СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;

		Если ИНННеЗаполнен Тогда
			Отказ = Истина; // отменяем текущую запись
			Сообщить(НСТР("ka = 'გსნ-ს შევსება სავალდებულოა!'; ru = 'Заполнение ИНН обязательно!'; en = 'Tax ID is required!'"), СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;

		Если ДокументНеЗаполнен Тогда
			Отказ = Истина; // отменяем текущую запись
			Сообщить(НСТР("ka = 'პირადობის ნომრის შევსება სავალდებულოა!'; ru = 'Заполнение документа удостоверяющего личность обязательно!'; en = 'Identity document number is required!'"), СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;

		Если Не ПроверитьЗаполнениеАдресаПоставки() Тогда
			Отказ = Истина; // отменяем текущую запись
			Возврат;
		КонецЕсли;

		Если Не ПроверитьКонтакты() Тогда
			Отказ = Истина; // отменяем текущую запись
			Возврат;
		КонецЕсли;

		Если Не ПроверитьБанковскиеСчета() Тогда
			Отказ = Истина; // отменяем текущую запись
			Возврат;
		КонецЕсли;

	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеОтветовKYC() Тогда
		Отказ = Истина; // отменяем текущую запись
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура РасшAzRy_ПриЗаписиНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая() Тогда	
		Попытка
			ЗаписатьДанныеОсновнойОрганизации(ТекущийОбъект, ЭтотОбъект.AzRyОрганизацияПользователяПоУмолчанию);
			ЗаписатьДанныеБанковскогоСчета(ТекущийОбъект, ЭтотОбъект.AzRyНомерСчета, ЭтотОбъект.AzRyБанкСчета, ЭтотОбъект.AzRyВалютаСчета);
		Исключение
			Отказ = Истина;
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_ОбработкаОповещенияПеред(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "УстановкаОсновнойОрганизации" И Параметр.Контрагент = Объект.Ссылка Тогда

		НоваяОрганизация = Параметр.НоваяОсновнаяОрганизация;
																														   
		ЕстьДанные = Объект.AzRyKYCАнкетаКлиента.Количество() > 0
			Или Объект.AzRyОценкаРискаКлиента.Количество() > 0
			Или Объект.AzRyРискМатрицаКлиента.Количество() > 0;
								
		ТекОрганизация = ОрганизацияКонтрагентаПоУмолчанию();
		НужноПодтверждение = ЗначениеЗаполнено(ТекОрганизация) И НоваяОрганизация <> ТекОрганизация И ТекОрганизация = ПолучитьОрганизациюAzRyPay() И ЕстьДанные;

		Если НужноПодтверждение Тогда
			
			ДопПараметры = Новый Структура("НоваяОрганизация", НоваяОрганизация);
			ПоказатьВопрос(
				Новый ОписаниеОповещения("УстановкаОрганизацииЗавершение", ЭтотОбъект, ДопПараметры),
				НСТР("ka = 'გაგრძელების შემთხვევაში შევსებული KYC ცხრილები გასუფთავდება. გსურთ გაგრძელება?'; ru = 'При продолжении заполненные таблицы KYC будут очищены. Продолжить?'; en = 'Continuing will clear the filled KYC tables. Continue?'"),
				РежимДиалогаВопрос.ДаНет);
		Иначе

			Объект.AzRyОрганизацияПоУмолчанию = НоваяОрганизация;

			Если НЕ Модифицированность Тогда
				Записать();
			КонецЕсли;

			ОбновитьЭлементыФормы();

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_AzRyОрганизацияПользователяПоУмолчаниюПриИзмененииВместо(Элемент)

	ОбновитьЭлементыФормы(AzRyСтараяОрганизацияПоУмолчанию);

КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_AzRyОрганизацияПользователяПоУмолчаниюНачалоВыбораВместо(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	AzRyСтараяОрганизацияПоУмолчанию = AzRyОрганизацияПользователяПоУмолчанию;
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДоступныеОрганизации();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы(СтараяОрганизация = Неопределено)

	ЭтоНовый = Объект.Ссылка.Пустая();
	ТекОрганизация = ОрганизацияКонтрагентаПоУмолчанию();

	Если ЭтоНовый Тогда
		ПоказыватьKYCБлоки = (ТекОрганизация = AzRyОрганизацияAzRyPay Или AzRyОрганизацияПользователяПоУмолчанию = AzRyОрганизацияAzRyPay);
	Иначе
		ПоказыватьKYCБлоки = ТекОрганизация = ПолучитьОрганизациюAzRyPay();
	КонецЕсли;

	Если ПоказыватьKYCБлоки Тогда

		ЗаполнитьВсеТаблицыВопросов();

		Элементы.AzRyKYCАнкетаКлиента.Видимость   = Истина;
		Элементы.AzRyОценкаРискаКлиента.Видимость = Истина;
		Элементы.AzRyРискМатрицаКлиента.Видимость = Истина;
		// Группы отображаются только при создании нового контрагента
		Элементы.AzRyГруппаБанковскиеСчета.Видимость                    = ЭтоНовый;
		Элементы.AzRyГруппаОрганизацияКонтрагентаПоУмолчанию.Видимость = ЭтоНовый;

	Иначе

		ЕстьДанные = Объект.AzRyKYCАнкетаКлиента.Количество() > 0
			Или Объект.AzRyОценкаРискаКлиента.Количество() > 0
			Или Объект.AzRyРискМатрицаКлиента.Количество() > 0;

		Если ЕстьДанные И СтараяОрганизация <> Неопределено Тогда

			ДопПараметры = Новый Структура("ЭтоНовый, СтараяОрганизация", ЭтоНовый, СтараяОрганизация);
			ПоказатьВопрос(
				Новый ОписаниеОповещения("ОбновитьЭлементыФормыЗавершение", ЭтотОбъект, ДопПараметры),
				НСТР("ka = 'გაგრძელების შემთხვევაში შევსებული KYC ცხრილები გასუფთავდება. გსურთ გაგრძელება?'; ru = 'При продолжении заполненные таблицы KYC будут очищены. Продолжить?'; en = 'Continuing will clear the filled KYC tables. Continue?'"),
				РежимДиалогаВопрос.ДаНет);

		Иначе

			ОчиститьВсеТаблицыВопросов();

			Элементы.AzRyKYCАнкетаКлиента.Видимость   = Ложь;
			Элементы.AzRyОценкаРискаКлиента.Видимость = Ложь;
			Элементы.AzRyРискМатрицаКлиента.Видимость = Ложь;
			// Группы отображаются только при создании нового контрагента
			Элементы.AzRyГруппаБанковскиеСчета.Видимость                    = ЭтоНовый;
			Элементы.AzRyГруппаОрганизацияКонтрагентаПоУмолчанию.Видимость = ЭтоНовый;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормыЗавершение(РезультатВопроса, ДопПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда

		ОчиститьВсеТаблицыВопросов();

		Элементы.AzRyKYCАнкетаКлиента.Видимость   = Ложь;
		Элементы.AzRyОценкаРискаКлиента.Видимость = Ложь;
		Элементы.AzRyРискМатрицаКлиента.Видимость = Ложь;
 
		// Группы отображаются только при создании нового контрагента
		Элементы.AzRyГруппаБанковскиеСчета.Видимость                    = ДопПараметры.ЭтоНовый;
		Элементы.AzRyГруппаОрганизацияКонтрагентаПоУмолчанию.Видимость = ДопПараметры.ЭтоНовый;

	Иначе

		AzRyОрганизацияПользователяПоУмолчанию = ДопПараметры.СтараяОрганизация;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановкаОрганизацииЗавершение(РезультатВопроса, ДопПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда

		Объект.AzRyОрганизацияПоУмолчанию = ДопПараметры.НоваяОрганизация;

		Если НЕ Модифицированность Тогда
			Записать();
		КонецЕсли;

		ОбновитьЭлементыФормы();

	КонецЕсли;

	// Если Нет - значение Объект.AzRyОрганизацияПоУмолчанию остается прежним

КонецПроцедуры

&НаКлиенте
Функция ЭтоФизическоеЛицо()

	Возврат Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ФизическоеЛицо");

КонецФункции

&НаКлиенте
Функция ЗначениеПеречисления(Имя)

	Возврат ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации."+Имя);

КонецФункции

&НаСервере
Функция ПолучитьОрганизациюAzRyPay()

	Возврат Константы.AzRyОрганизацияAzRyPay.Получить();

КонецФункции

&НаСервере
Функция НужноОткрыватьФормуДополнительныхДанныхКонтрагента()

	Возврат Константы.AzRyОткрыватьФормуДополнительныхДанныхКонтрагента.Получить();

КонецФункции

&НаСервере
Функция ПолучитьДоступныеОрганизации()

	Ответ = Новый СписокЗначений;

	ТекстЗапроса =
		"ВЫБРАТЬ
		|	AzRyНастройкаРЛСОрганизации.Организация КАК Организация
		|ИЗ
		|	Справочник.AzRyНастройкаРЛС.Организации КАК AzRyНастройкаРЛСОрганизации
		|ГДЕ
		|	НЕ AzRyНастройкаРЛСОрганизации.Ссылка.ПометкаУдаления
		|	И AzRyНастройкаРЛСОрганизации.Ссылка.Пользователь = &Пользователь";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());

	Ответ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация"));

	Возврат Ответ;

КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуВопросов(ИмяТабличнойЧасти, ПеречислениеВопросовТекст, Колонка, КолонкаОтвет = Неопределено, Ответ = Неопределено)

	Если Ответ = Неопределено Тогда
		Ответ = ПолучитьСоответствиеВопросовKYC();
	КонецЕсли;

	ПеречислениеВопросов = Перечисления[ПеречислениеВопросовТекст];

	ТаблицаВопросов = Объект[ИмяТабличнойЧасти];

	Для Каждого Вопрос Из ПеречислениеВопросов Цикл

		Если Не ВопросУжеЕсть(ТаблицаВопросов, Вопрос, Колонка) Тогда
			НоваяСтрока = ТаблицаВопросов.Добавить();
			НоваяСтрока[Колонка] = Вопрос;
			Если КолонкаОтвет = Неопределено Тогда
				Для каждого ТекСтрока Из Ответ[ПеречислениеВопросовТекст][Вопрос] Цикл

					НоваяСтрока[ТекСтрока.Ключ] = ТекСтрока.Значение;

				КонецЦикла;
			Иначе
				НоваяСтрока[КолонкаОтвет] = Ответ[ПеречислениеВопросовТекст][Вопрос];
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОчиститьТаблицуВопросов(ИмяТабличнойЧасти)

	ТаблицаВопросов = Объект[ИмяТабличнойЧасти];
	ТаблицаВопросов.Очистить();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеТаблицыВопросов()
											
	СоответствиеKYC = ПолучитьСоответствиеВопросовKYC();
											 
	ЗаполнитьТаблицуВопросов("AzRyKYCАнкетаКлиента", "AzRyВопросыKYCАнкетыКлиента", "Вопрос", "Ответ", СоответствиеKYC);
	ЗаполнитьТаблицуВопросов("AzRyОценкаРискаКлиента", "AzRyKYCВопросыКлиента", "Вопрос", "Ответ", СоответствиеKYC);
	ЗаполнитьТаблицуВопросов("AzRyРискМатрицаКлиента", "AzRyФакторыРискаКлиента", "ФакторРиска", , СоответствиеKYC);

КонецПроцедуры

&НаСервере
Процедура ОчиститьВсеТаблицыВопросов()

	ОчиститьТаблицуВопросов("AzRyKYCАнкетаКлиента");
	ОчиститьТаблицуВопросов("AzRyОценкаРискаКлиента");
	ОчиститьТаблицуВопросов("AzRyРискМатрицаКлиента");

КонецПроцедуры

&НаСервере
Функция ВопросУжеЕсть(Таблица, Вопрос, Колонка)

	Для Каждого Стр Из Таблица Цикл
		Если Стр[Колонка] = Вопрос Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

&НаСервере
Функция ПолучитьСоответствиеВопросовKYC()

	СоотвВопросыKYCАнкетыКлиента = Новый Соответствие;
	СоотвKYCВопросыКлиента       = Новый Соответствие;
	СоотвФакторыРискаКлиента     = Новый Соответствие;

	Ответ = Новый Структура("AzRyВопросыKYCАнкетыКлиента, AzRyKYCВопросыКлиента, AzRyФакторыРискаКлиента", СоотвВопросыKYCАнкетыКлиента, СоотвKYCВопросыКлиента, СоотвФакторыРискаКлиента);

	// Вопросы анкеты KYC клиента
    П = Перечисления.AzRyВопросыKYCАнкетыКлиента;

	СоотвВопросыKYCАнкетыКлиента.Вставить(П.ВидДеятельностиКлиента,                       "");
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.ЦельУстановленияДеловыхОтношений,             "");
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.СтраныОсуществленияДеятельности,              "");
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.ИсточникПроисхожденияСредств,                 "");
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.ПредполагаемыйГодовойОборот,                  "");
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.ДействуетЛиВИнтересахБенефициарногоВладельца, Перечисления.AzRyДаНет.ПустаяСсылка());
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.СведенияОТретьемЛицеИБенефициаре,             "");
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.ПризнакPEP,             					  Перечисления.AzRyДаНет.ПустаяСсылка());
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.СведенияОPEP,             					  "");

	// Вопросы KYC анкеты клиента 2
    П = Перечисления.AzRyKYCВопросыКлиента;
	
	СоотвKYCВопросыКлиента.Вставить(П.ДатаЗаполнения,             					                    Дата(1,1,1));
    СоотвKYCВопросыКлиента.Вставить(П.ОписаниеДоговораОбслуживания,                                              "");
    СоотвKYCВопросыКлиента.Вставить(П.ОжидаемаяСтоимостьОперацийБолее3000,    Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ПризнакКомплексныхОпераций,             Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ПризнакНеобычногоПоведенияКлиента,      Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ПризнакPEP,                             Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.СложнаяСтруктураСобственности,          Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ПризнакВысокогоДоходаКлиента,           Перечисления.AzRyДаНет.ПустаяСсылка());

	СоотвKYCВопросыКлиента.Вставить(П.ДеятельностьСвязанаСОружиемИлиБоеприпасами,          Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ТорговляПроизведениямиИскусстваИлиПредметамиРоскоши, Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ОперацииСДрагоценнымиМеталлами,                      Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ОперацииСНефтьюИГазом,                               Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.СтроительствоИЛиНедвижимость,                        Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ВалютныеОперацииИФорекс,                             Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.КриптовалютнаяДеятельность,                          Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ФинансовоеПосредничество,                            Перечисления.AzRyДаНет.ПустаяСсылка());
	СоотвKYCВопросыКлиента.Вставить(П.ИгровойБизнес,                                       Перечисления.AzRyДаНет.ПустаяСсылка());

    СоотвKYCВопросыКлиента.Вставить(П.СвязьСВысокорисковойСтраной,      Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ОффшорнаяРегистрация,             Перечисления.AzRyДаНет.ПустаяСсылка());

    СоотвKYCВопросыКлиента.Вставить(П.АудитНедвижимостьСделки,          Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.АудитБизнесСделки,                Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.СозданиеИУправлениеЮрЛицами,      Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ДистанционноеОбслуживаниеКлиента, Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ИныеФакторыРискаКлиента,          "");
    СоотвKYCВопросыКлиента.Вставить(П.УровеньРискаКлиента,              Перечисления.AzRyУровеньРискаКлиента.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ОписаниеФакторовРискаКлиента,     "");

	// Факторы риска клиента
    П = Перечисления.AzRyФакторыРискаКлиента;

    СоотвФакторыРискаКлиента.Вставить(П.СтабильныйИЛиЗнакомыйКлиент,
	Новый Структура("ВероятностьРиска, УровеньРиска, МитигирующиеМеры",
					Перечисления.AzRyДаНет.ПустаяСсылка(),
					Перечисления.AzRyУровеньРискаКлиента.ПустаяСсылка(),
					Перечисления.AzRyМитигирующиеМерыРиска.ПустаяСсылка()));

	СоотвФакторыРискаКлиента.Вставить(П.БезналичныеРасчетыЧерезВендинг,
	Новый Структура("ВероятностьРиска, УровеньРиска, МитигирующиеМеры",
					Перечисления.AzRyДаНет.ПустаяСсылка(),
					Перечисления.AzRyУровеньРискаКлиента.ПустаяСсылка(),
					Перечисления.AzRyМитигирующиеМерыРиска.ПустаяСсылка()));

	СоотвФакторыРискаКлиента.Вставить(П.ЛимитСуммыОпераций,
	Новый Структура("ВероятностьРиска, УровеньРиска, МитигирующиеМеры",
					Перечисления.AzRyУровеньРискаКлиента.ПустаяСсылка(),
					Перечисления.AzRyУровеньРискаКлиента.ПустаяСсылка(),
					Перечисления.AzRyМитигирующиеМерыРиска.ПустаяСсылка()));

	СоотвФакторыРискаКлиента.Вставить(П.НаличиеИностранногоЭлемента,
	Новый Структура("ВероятностьРиска, УровеньРиска, МитигирующиеМеры",
					Перечисления.AzRyДаНет.ПустаяСсылка(),
					Перечисления.AzRyУровеньРискаКлиента.ПустаяСсылка(),
					Перечисления.AzRyМитигирующиеМерыРиска.ПустаяСсылка()));

	СоотвФакторыРискаКлиента.Вставить(П.ОтсутствиеСвязиСВысокорисковымиЮрисдикциями,
	Новый Структура("ВероятностьРиска, УровеньРиска, МитигирующиеМеры",
					Перечисления.AzRyДаНет.ПустаяСсылка(),
					Перечисления.AzRyУровеньРискаКлиента.ПустаяСсылка(),
					Перечисления.AzRyМитигирующиеМерыРиска.ПустаяСсылка()));

    Возврат Ответ;

КонецФункции

&НаСервере
Функция ОрганизацияКонтрагентаПоУмолчанию()

	Возврат	Объект.AzRyОрганизацияПоУмолчанию.Организация;

КонецФункции
 
&НаСервере
Функция НайтиОрганизациюПоУмолчаниюКонтрагента()

	// Получаем ссылку на запись основной организации, созданную при первой записи контрагента
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	AzRyКонтрагентОрганизации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.AzRyКонтрагентОрганизации КАК AzRyКонтрагентОрганизации
		|ГДЕ
		|	AzRyКонтрагентОрганизации.Владелец = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);

	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0]["Ссылка"];
	КонецЕсли;

	Возврат Справочники.AzRyКонтрагентОрганизации.ПустаяСсылка();

КонецФункции

#КонецОбласти

#Область ПроверкиЗаполнения

&НаКлиенте
Функция ПроверитьЗаполнениеАдресаПоставки()

	Для каждого ТекСтрока Из ЭтотОбъект.КонтактнаяИнформация Цикл

		Если ТекСтрока.Тип = ЗначениеПеречисления("Адрес") Тогда
			Если Не ЗначениеЗаполнено(ТекСтрока.Представление) Тогда
				Сообщить(НСТР("ka = 'საქონლის მიწოდების ველის შევსება აუცილებელია.'; ru = 'Заполнение адреса доставки товара обязательно.'; en = 'Delivery address field is required.'"), СтатусСообщения.Важное);
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Возврат Истина;

КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеОтветовKYC()

	Для каждого ТекСтрока Из Объект.AzRyKYCАнкетаКлиента Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.Ответ) Тогда
			Сообщить(НСТР("ka = 'KYC პასუხების შევსება აუცილებელია.'; ru = 'Заполнение ответов KYC обязательно.'; en = 'KYC answers are required.'"), СтатусСообщения.Важное);
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Для каждого ТекСтрока Из Объект.AzRyОценкаРискаКлиента Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.Ответ) Тогда
			Сообщить(НСТР("ka = 'KYC პასუხების შევსება აუცილებელია.'; ru = 'Заполнение ответов KYC обязательно.'; en = 'KYC answers are required.'"), СтатусСообщения.Важное);
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Для каждого ТекСтрока Из Объект.AzRyРискМатрицаКлиента Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.ВероятностьРиска) Или Не ЗначениеЗаполнено(ТекСтрока.УровеньРиска) Или Не ЗначениеЗаполнено(ТекСтрока.МитигирующиеМеры) Тогда
			Сообщить(НСТР("ka = 'KYC პასუხების შევსება აუცილებელია.'; ru = 'Заполнение ответов KYC обязательно.'; en = 'KYC answers are required.'"), СтатусСообщения.Важное);
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

&НаКлиенте
Функция ПроверитьБанковскиеСчета()

	Если Не ЗначениеЗаполнено(AzRyНомерСчета) Или Не ЗначениеЗаполнено(AzRyБанкСчета) Или Не ЗначениеЗаполнено(AzRyВалютаСчета)  Тогда

		Сообщить(НСТР("ka = 'საბანკო ანგარიშის მონაცემების შევსება აუცილებელია.'; ru = 'Заполнение банковских реквизитов обязательно.'; en = 'Bank account details are required.'"), СтатусСообщения.Важное);
		Возврат Ложь;

	КонецЕсли;

	Возврат Истина;

КонецФункции

&НаКлиенте
Функция ПроверитьКонтакты()

	Если ЭтотОбъект.ДанныеКонтактныхЛиц.Количество() = 0 Тогда
		Сообщить(НСТР("ka = 'საჭიროა სულ მცირე ერთი საკონტაქტო პირი.'; ru = 'Необходимо указать хотя бы одно контактное лицо.'; en = 'At least one contact person is required.'"), СтатусСообщения.Важное);
		Возврат Ложь;
	КонецЕсли;

	Для каждого ТекСтрока Из ЭтотОбъект.ДанныеКонтактныхЛиц Цикл

		Если Не ЗначениеЗаполнено(ТекСтрока.Наименование) Тогда

			Сообщить(НСТР("ka = 'საკონტაქტო პირის სახელის და გვარის ველის შევსება აუცილებელია.'; ru = 'Заполнение имени и фамилии контактного лица обязательно.'; en = 'Contact person name field is required.'"), СтатусСообщения.Важное);
			Возврат Ложь;

		КонецЕсли;

		Для каждого ТекЭл Из ТекСтрока.КонтактнаяИнформация Цикл

			Если ТекЭл.Тип = ЗначениеПеречисления("АдресЭлектроннойПочты") Тогда
				Если Не ЗначениеЗаполнено(ТекЭл.Представление) Тогда
					Сообщить(НСТР("ka = 'საკონტაქტო პირის ელ. მისამართის ველის შევსება აუცილებელია.'; ru = 'Заполнение электронного адреса контактного лица обязательно.'; en = 'Contact person email address field is required.'"), СтатусСообщения.Важное);
					Возврат Ложь;
				КонецЕсли;
			КонецЕсли;

			Если ТекЭл.Тип = ЗначениеПеречисления("Телефон") Тогда
				Если Не ЗначениеЗаполнено(ТекЭл.Представление) Тогда
					Сообщить(НСТР("ka = 'საკონტაქტო პირის ტელეფონის ველის შევსება აუცილებელია.'; ru = 'Заполнение телефона контактного лица обязательно.'; en = 'Contact person phone number field is required.'"), СтатусСообщения.Важное);
					Возврат Ложь;
				КонецЕсли;
			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	Возврат Истина;

КонецФункции

#КонецОбласти

#Область ЗаписьДанных

&НаСервере
Процедура ЗаписатьДанныеБанковскогоСчета(ТекущийОбъект, НомерСчета, БанкСчета, ВалютаСчета)

	УстановитьПривилегированныйРежим(Истина);

	НовыйСчет = Справочники.БанковскиеСчета.СоздатьЭлемент();
	НовыйСчет.НомерСчета   = НомерСчета;
	НовыйСчет.Наименование = НомерСчета;
	НовыйСчет.Владелец   = ТекущийОбъект.Ссылка;
	НовыйСчет.Банк = БанкСчета;
	НовыйСчет.ВариантУказанияКПП = Перечисления.ВариантыУказанияКПП.ВоВсехПлатежныхПоручениях;
	НовыйСчет.ВидСчета = "Расчетный";
	НовыйСчет.ВалютаДенежныхСредств = ВалютаСчета;
	НовыйСчет.Записать();

	ТекущийОбъект.БанковскийСчетПоУмолчанию = НовыйСчет.Ссылка;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеОсновнойОрганизации(ТекущийОбъект, ОрганизацияПоУмолчанию)

	УстановитьПривилегированныйРежим(Истина);

	НоваяОрганизацияПУ = Справочники.AzRyКонтрагентОрганизации.СоздатьЭлемент();
	НоваяОрганизацияПУ.Организация = ОрганизацияПоУмолчанию;
	НоваяОрганизацияПУ.Владелец = ТекущийОбъект.Ссылка;
	НоваяОрганизацияПУ.Наименование = ОрганизацияПоУмолчанию.Наименование;
	НоваяОрганизацияПУ.Записать();

	// Присвоение ТекущийОбъект.AzRyОрганизацияПоУмолчанию здесь не сохраняется,
	// т.к. основной объект ещё не записан. Присвоение выполняется после записи в ПослеЗаписиПосле.

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти
