
Процедура ЗаполнитьСчетаБезвозмезднойПродажи(Объект) Экспорт
	
	СтруктураСчетовКурсРазниц = РегистрыСведений.УчетнаяПолитикаРегл.СоздатьМенеджерЗаписи();
	СтруктураСчетовКурсРазниц.Организация = ?(НЕ ЗначениеЗаполнено(Объект.Организация), УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация"), Объект.Организация);
	СтруктураСчетовКурсРазниц.Период = ?(НЕ ЗначениеЗаполнено(Объект.Дата), ТекущаяДата(),ОБъект.Дата);
	СтруктураСчетовКурсРазниц.Прочитать();
	
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	
		Объект.СчетЗатратБезвозмезднойПродажи 			 = СтруктураСчетовКурсРазниц.СчетЗатратБезвозмезднойПродажи;
		Объект.СчетЗатратНДСБезвозмезднойПродажи   		 = СтруктураСчетовКурсРазниц.СчетЗатратНДСБезвозмезднойПродажи;
		Объект.СчетУчетаНалогаНаПрибыль     			 = СтруктураСчетовКурсРазниц.СчетУчетаНалогаНаПрибыль;
		Объект.СчетУчетаНалогаНаПрибыльПодлежащийОплате  = СтруктураСчетовКурсРазниц.СчетУчетаНалогаНаПрибыльПодлежащийОплате;
		Объект.СчетУчетаСвободнаяпродажа                 = СтруктураСчетовКурсРазниц.СчетУчетаСвободнаяпродажа;
		
		Объект.СчетЗатратБезвозмезднойПродажиСотрудник 	 = СтруктураСчетовКурсРазниц.СчетЗатратБезвозмезднойПродажиСотрудник;
		Объект.СчетЗатратНДСБезвозмезднойПродажиСотрудник= СтруктураСчетовКурсРазниц.СчетЗатратНДСБезвозмезднойПродажиСотрудник;
		Объект.СчетЗатратНДФЛСотрудник     				 = СтруктураСчетовКурсРазниц.СчетЗатратНДФЛСотрудник;
		Объект.СчетЗатратПФСотрудник					 = СтруктураСчетовКурсРазниц.СчетЗатратПФСотрудник;
		Объект.СчетУчетаСвободнаяпродажаСотрудник        = СтруктураСчетовКурсРазниц.СчетУчетаСвободнаяпродажаСотрудник;
		
	Иначе
		
		ПустойСчет = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка");
		Объект.СчетЗатратБезвозмезднойПродажи 			= ПустойСчет;
		Объект.СчетЗатратНДСБезвозмезднойПродажи 		= ПустойСчет;
		Объект.СчетУчетаНалогаНаПрибыль 				= ПустойСчет;
		Объект.СчетУчетаНалогаНаПрибыльПодлежащийОплате = ПустойСчет;
		Объект.СчетУчетаСвободнаяпродажа                = ПустойСчет;
		
		Объект.СчетЗатратБезвозмезднойПродажиСотрудник 	 = ПустойСчет;
		Объект.СчетЗатратНДСБезвозмезднойПродажиСотрудник= ПустойСчет;
		Объект.СчетЗатратНДФЛСотрудник     				 = ПустойСчет;
		Объект.СчетЗатратПФСотрудник					 = ПустойСчет;
		
	КонецЕсли;
	
КонецПроцедуры
