
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПозицияИмениЭлем = Константы.ПозицияИмениВФИО.Получить();
	ПозицияФамилииЭлем = Константы.ПозицияФамилииФИО.Получить();
	СформироватьПример();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПример()
	
	ФамилияНеНужна  = ПозицияФамилииЭлем = 0;
	ИмяНеНужно		= ПозицияИмениЭлем = 0;
	
	Если ФамилияНеНужна И ИмяНеНужно Тогда 
		Элементы.ПримерНаписания.Заголовок = НСтр("ru = 'Пример:'; ka = 'მაგალითი:'");                                     
	ИначеЕсли НЕ ФамилияНеНужна И ИмяНеНужно Тогда 
		Элементы.ПримерНаписания.Заголовок = НСтр("ru = 'Пример: "" გვარი""'; ka = 'მაგალითი: "" გვარი""'");
	ИначеЕсли ФамилияНеНужна И НЕ ИмяНеНужно Тогда 
		Элементы.ПримерНаписания.Заголовок = НСтр("ru = 'Пример: ""სახელი""'; ka = 'მაგალითი: ""სახელი""'");
	ИначеЕсли ПозицияФамилииЭлем > ПозицияИмениЭлем Тогда 
		Элементы.ПримерНаписания.Заголовок = НСтр("ru = 'Пример: "" გვარი სახელი""'; ka = 'მაგალითი: "" გვარი სახელი""'");
	ИначеЕсли ПозицияФамилииЭлем < ПозицияИмениЭлем Тогда 
		Элементы.ПримерНаписания.Заголовок = НСтр("ru = 'Пример: ""სახელი  გვარი""'; ka = 'მაგალითი: ""სახელი  გვარი""'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицияФамилииФИОПриИзменении(Элемент)
	
	ПозицияФамилииЭлем = элемент.ТекстРедактирования;
	СформироватьПример();
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицияИменивФИОПриИзменении(Элемент)
	
	ПозицияИмениЭлем = элемент.ТекстРедактирования;
	СформироватьПример();
	
КонецПроцедуры
