
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Запись.Договор = РС_ОбщегоНазначения.ПолучитьЗначениеРеквизита(Запись.Контрагент, "ДоговорПоУмолчанию");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.Договор) И Не ЗначениеЗаполнено(Запись.Контрагент) Тогда
		Запись.Контрагент = Запись.Договор.Владелец;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Актуальность_ПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура АктуальностьПриИзменении(Элемент)
	Актуальность_ПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура Актуальность_ПриИзменении()
	Если Запись.Актуальность Тогда
		Элементы.ВидУдержания.ТолькоПросмотр						= Ложь;
	Иначе
		Запись.ВидУдержания				= Неопределено;
		
		Элементы.ВидУдержания.ТолькоПросмотр			= Истина;
	КонецЕсли;		
	
	Элементы.ВидУдержания.АвтоОтметкаНезаполненного				= Запись.Актуальность И НЕ ЗначениеЗаполнено(Запись.ВидУдержания);
	Элементы.ВидУдержания.ОтметкаНезаполненного					= Запись.Актуальность И НЕ ЗначениеЗаполнено(Запись.ВидУдержания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Запись.Актуальность Тогда
		Если НЕ ЗначениеЗаполнено(Запись.ВидУдержания) Тогда
			Сообщить(НСтр("ka='არ არის შევსებული ველი ""დაკავების სახეობა""';ru='Не заполнена поле ""Вид удержания""';en='Do not fill in the ""View hold""'"));
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры


