
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период.ДатаНачала = Объект.ДатаНачало;
	Период.ДатаОкончания = Объект.ДатаОкончания;
	
	Если ПустаяСтрока(Объект.Ссылка) Тогда 
		Объект.ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
		
	Объект.ДатаНачало = Период.ДатаНачала;
	Объект.ДатаОкончания  = Период.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
		
	ДоговорПоУмолчанию = ПолучитьДоговорПоУмолчанию(Объект.Контрагент);
	Объект.ДоговорКонтрагента = ДоговорПоУмолчанию;

КонецПроцедуры

&НаСервере
Функция ПолучитьДоговорПоУмолчанию(КонтрагентСсылка)
	
	КонтрагентОб = КонтрагентСсылка.ПолучитьОбъект();		
	ДоговорПоУмолчанию = КонтрагентОб.ДоговорПоУмолчанию;		
	Возврат ДоговорПоУмолчанию;
	
КонецФункции


&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	установитьНалогообложениеНДС(ВыбранноеЗначение);
	
КонецПроцедуры


&НаСервере
Процедура установитьНалогообложениеНДС(НоменклатураСсылка)
	
	НоменклатураОб = НоменклатураСсылка.ПолучитьОбъект();
	
	Если НоменклатураОб.СтавкаНДС = Справочники.СтавкиНДС.НДС18 Тогда 
		Объект.НалогообложениеНДС = НСТР("ru = ' НДС 18% '; ka = 'დასაბეგრი'");
	ИначеЕсли  НоменклатураОб.СтавкаНДС = Справочники.СтавкиНДС.ОсвобожденОтНДС Тогда 
		Объект.НалогообложениеНДС = НСТР("ru = 'Освобожден от НДС'; ka = 'დაუბეგრავი'");		
	ИначеЕсли  НоменклатураОб.СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда 
		Объект.НалогообложениеНДС = НСТР("ru = '(-)'; ka = '(-)'");
	иначе
		Объект.НалогообложениеНДС = НСТР("ru = '(-)'; ka = '(-)'");
	КонецЕсли;

	
КонецПроцедуры




