
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.IT                 = Справочники.Сотрудники.НайтиПоКоду("0000000025");
	Объект.HumanResources     = Справочники.Сотрудники.НайтиПоКоду("0000000514");
	Объект.ЗаведующийПоСкладу = Справочники.Сотрудники.НайтиПоКоду("0000000168");
	
КонецПроцедуры

&НаСервере
Процедура Печать1НаСервере(ТабДок)
	
	Документы.AzRyПередачаИмуществаСотруднику.Печать1(ТабДок, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать1(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	Печать1НаСервере(ТабДок);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.Показать();	
	
КонецПроцедуры

&НаКлиенте
Процедура Печать2(Команда)
		
	ТабДок = Новый ТабличныйДокумент;
	Печать2НаСервере(ТабДок);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура Печать2НаСервере(ТабДок)
	
	Документы.AzRyПередачаИмуществаСотруднику.Печать2(ТабДок, Объект.Ссылка);	
	
КонецПроцедуры

&НаСервере
Процедура Печать3НаСервере(ТабДок)
	
	Документы.AzRyПередачаИмуществаСотруднику.Печать3(ТабДок, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать3(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	Печать3НаСервере(ТабДок);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура Печать4НаСервере(ТабДок)
	
Документы.AzRyПередачаИмуществаСотруднику.Печать4(ТабДок, Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура Печать4(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	Печать4НаСервере(ТабДок);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнеоборотныеАктивы_.Ссылка КАК Ссылка,
		|	ВнеоборотныеАктивы_.AzRyОтветственный КАК AzRyОтветственный,
		|	ВнеоборотныеАктивы_.НачальнаяСтоимостьДляУменьшенногоОстатка КАК НачальнаяСтоимостьДляУменьшенногоОстатка,
		|	AzRyШтрихкодыВнеоборотныеАктивы.Штрихкод КАК Штрихкод
		|ИЗ
		|	Справочник.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы_
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AzRyШтрихкодыВнеоборотныеАктивы КАК AzRyШтрихкодыВнеоборотныеАктивы
		|		ПО ВнеоборотныеАктивы_.Ссылка = AzRyШтрихкодыВнеоборотныеАктивы.ВнеоборотныеАктивы
		|ГДЕ
		|	ВнеоборотныеАктивы_.AzRyОтветственный = &AzRyОтветственный";
		
		Запрос.УстановитьПараметр("AzRyОтветственный", Объект.Сотрудник.Физлицо);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Объект.ВнеоборотныеАктивы.Очистить();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = Объект.ВнеоборотныеАктивы.Добавить();
			НоваяСтрока.ВнеоборотныйАктив = ВыборкаДетальныеЗаписи.Ссылка;
			НоваяСтрока.СтоимостьЗакупкиСНДС = ВыборкаДетальныеЗаписи.НачальнаяСтоимостьДляУменьшенногоОстатка;
			НоваяСтрока.Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;
		КонецЦикла;
	
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ВнеоборотныеАктивыВнеоборотныйАктивПриИзмененииНаСервере(ВнеоборотныйАктив)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	AzRyШтрихкодыВнеоборотныеАктивы.Штрихкод КАК Штрихкод
		|ПОМЕСТИТЬ Ш
		|ИЗ
		|	РегистрСведений.AzRyШтрихкодыВнеоборотныеАктивы КАК AzRyШтрихкодыВнеоборотныеАктивы
		|ГДЕ
		|	AzRyШтрихкодыВнеоборотныеАктивы.ВнеоборотныеАктивы = &ВнеоборотныйАктив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнеоборотныеАктивы.НачальнаяСтоимостьДляУменьшенногоОстатка КАК НачальнаяСтоимостьДляУменьшенногоОстатка,
		|	ВнеоборотныеАктивы.Ссылка КАК Ссылка,
		|	Ш.Штрихкод КАК Штрихкод
		|ИЗ
		|	Справочник.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы,
		|	Ш КАК Ш
		|ГДЕ
		|	ВнеоборотныеАктивы.Ссылка = &ВнеоборотныйАктив";
	
	Запрос.УстановитьПараметр("ВнеоборотныйАктив", ВнеоборотныйАктив);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Стр = Новый Структура("НачальнаяСтоимостьДляУменьшенногоОстатка, Штрихкод");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Стр.НачальнаяСтоимостьДляУменьшенногоОстатка = ВыборкаДетальныеЗаписи.НачальнаяСтоимостьДляУменьшенногоОстатка;	
		Стр.Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;
		
	КонецЦикла;
	
	Возврат Стр;
	
КонецФункции

&НаКлиенте
Процедура ВнеоборотныеАктивыВнеоборотныйАктивПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ВнеоборотныеАктивы.ТекущиеДанные; 
	
	Ответ = ВнеоборотныеАктивыВнеоборотныйАктивПриИзмененииНаСервере(СтрокаТабличнойЧасти.ВнеоборотныйАктив);
	
	СтрокаТабличнойЧасти.Штрихкод = Ответ.Штрихкод;
	СтрокаТабличнойЧасти.СтоимостьЗакупкиСНДС = Ответ.НачальнаяСтоимостьДляУменьшенногоОстатка;
	
КонецПроцедуры
