#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыЗаполненияДокумента

// Обработчик заполнения документа на основании структуры
//
// Параметры:
//  ДанныеЗаполнения - Структура.
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения.Свойство("ДокументЗаполнения") Тогда
	
		Если ТипЗнч(ДанныеЗаполнения.ДокументЗаполнения) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ДанныеЗаполнения.СнятьРезерв Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьПоЗаказПокупателяИсходноеМесто(ДанныеЗаполнения.ДокументЗаполнения);
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик заполнения на основании документа ЗаказПокупателя.
//
// Параметры:
//	ДокументСсылкаЗаказПокупателя = ДокументСсылка.ЗаказПокупателя.
//	
Процедура ЗаполнитьПоЗаказПокупателяНовоеМесто(ДокументСсылкаЗаказПокупателя) Экспорт
	
	// Заполнение шапки.
	ЗаказПокупателя = ДокументСсылкаЗаказПокупателя;
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	//Было---
	//ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылкаЗаказПокупателя, Новый Структура("Организация, ВидОперации, СостояниеЗаказа, Проведен, ОжидаетсяВыборВариантаКП"));
	//Стало+++ Добавлен реквизит Проект
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылкаЗаказПокупателя, Новый Структура("Организация, ВидОперации, СостояниеЗаказа, Проведен, ОжидаетсяВыборВариантаКП, Проект"));
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(ДокументСсылкаЗаказПокупателя, ЗначенияРеквизитов);
	Организация = ЗначенияРеквизитов.Организация;
	
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	Проект = ЗначенияРеквизитов.Проект;
	//ПодольскийАИ #УчетПроектов 30.09.2021 }

	// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
	Если Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() Тогда
		ЗаполнитьПоЗаказПокупателяНовоеМесто_new(ДокументСсылкаЗаказПокупателя);
		Возврат;
	КонецЕсли;
	// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
	
	// Заполнение табличной части.
	Запрос = Новый Запрос;
	//--------------------------------------------------------------------------
	// © Шишка В.В. [6 октября 2021]  НАЧАЛО
	УчетСебестоимостиВРазрезеОрганизации = РегистрыСведений.УчетнаяПолитикаРегл.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация)).УчетСебестоимостиВРазрезеОрганизации;
	Запрос.УстановитьПараметр("УчетСебестоимостиВРазрезеОрганизации", УчетСебестоимостиВРазрезеОрганизации = Истина);
	// © Шишка В.В. [6 октября 2021]  КОНЕЦ
	//--------------------------------------------------------------------------
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.Характеристика КАК Характеристика,
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыОстатки.Характеристика КАК Характеристика,
	|		ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗаказыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗапасыОстатки.Номенклатура,
	|		ЗапасыОстатки.Характеристика,
	|		-ЗапасыОстатки.КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗапасыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РазмещениеОстатки.Номенклатура,
	|		РазмещениеОстатки.Характеристика,
	|		-РазмещениеОстатки.КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказов.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК РазмещениеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗапасы.Номенклатура,
	|		ДвиженияДокументаЗапасы.Характеристика,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|	ГДЕ
	|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|		И ДвиженияДокументаЗапасы.ЗаказПокупателя = &ДокументОснование
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаРазмещениеЗаказов.Номенклатура,
	|		ДвиженияДокументаРазмещениеЗаказов.Характеристика,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРазмещениеЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказов КАК ДвиженияДокументаРазмещениеЗаказов
	|	ГДЕ
	|		ДвиженияДокументаРазмещениеЗаказов.Регистратор = &Ссылка
	|		И ДвиженияДокументаРазмещениеЗаказов.ЗаказПокупателя = &ДокументОснование) КАК ЗаказыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыОстатки.Номенклатура,
	|	ЗаказыОстатки.Характеристика
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0";
	
	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		
		Запрос.Текст = Запрос.Текст + "; " +
		"ВЫБРАТЬ
		|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказыОстатки.Характеристика КАК Характеристика,
		|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
		|		ЗаказыОстатки.Характеристика КАК Характеристика,
		|		ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.ПотребностьВЗапасах.Остатки(
		|				,
		|				ЗаказПокупателя = &ДокументОснование
		|					И ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженийЗапасов.Отгрузка)) КАК ЗаказыОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗапасыОстатки.Номенклатура,
		|		ЗапасыОстатки.Характеристика,
		|		-ЗапасыОстатки.КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.Запасы.Остатки(
		|				,
		|				ЗаказПокупателя = &ДокументОснование
		|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗапасыОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РазмещениеОстатки.Номенклатура,
		|		РазмещениеОстатки.Характеристика,
		|		-РазмещениеОстатки.КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.РазмещениеЗаказов.Остатки(
		|				,
		|				ЗаказПокупателя = &ДокументОснование
		|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК РазмещениеОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокументаЗапасы.Номенклатура,
		|		ДвиженияДокументаЗапасы.Характеристика,
		|		ВЫБОР
		|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
		|	ГДЕ
		|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
		|		И ДвиженияДокументаЗапасы.ЗаказПокупателя = &ДокументОснование
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокументаРазмещениеЗаказов.Номенклатура,
		|		ДвиженияДокументаРазмещениеЗаказов.Характеристика,
		|		ВЫБОР
		|			КОГДА ДвиженияДокументаРазмещениеЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РазмещениеЗаказов КАК ДвиженияДокументаРазмещениеЗаказов
		|	ГДЕ
		|		ДвиженияДокументаРазмещениеЗаказов.Регистратор = &Ссылка
		|		И ДвиженияДокументаРазмещениеЗаказов.ЗаказПокупателя = &ДокументОснование) КАК ЗаказыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыОстатки.Номенклатура,
		|	ЗаказыОстатки.Характеристика
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "; " +
	"ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Номенклатура,
	|	ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ЗаказПокупателяЗапасы.Характеристика,
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	|	&Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	|	ЗаказПокупателяЗапасы.Партия,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ЗаказПокупателяЗапасы.Количество,
	//--------------------------------------------------------------------------
	// © Шишка В.В. [6 октября 2021]  НАЧАЛО
	//|	ЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв КАК НовоеМестоРезерва
	|	ВЫБОР КОГДА &УчетСебестоимостиВРазрезеОрганизации = ИСТИНА ТОГДА ЗаказПокупателяЗапасы.Ссылка ИНАЧЕ ЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв КОНЕЦ КАК НовоеМестоРезерва
	// © Шишка В.В. [6 октября 2021]  КОНЕЦ
	//--------------------------------------------------------------------------
	|ИЗ
	|	ВТЗаказПокупателяЗапасы КАК ЗаказПокупателяЗапасы";
	
	Запрос.Текст = Запрос.Текст + "; " +
	"ВЫБРАТЬ
	|	ЗаказПокупателяМатериалы.Номенклатура,
	|	ЗаказПокупателяМатериалы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ЗаказПокупателяМатериалы.Характеристика,
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	|	&Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	|	ЗаказПокупателяМатериалы.Партия,
	|	ЗаказПокупателяМатериалы.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяМатериалы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ЗаказПокупателяМатериалы.Количество,
	//--------------------------------------------------------------------------
	// © Шишка В.В. [6 октября 2021]  НАЧАЛО
	//|	ЗаказПокупателяМатериалы.Ссылка.СтруктурнаяЕдиницаРезерв КАК НовоеМестоРезерва
	|	ВЫБОР КОГДА &УчетСебестоимостиВРазрезеОрганизации = ИСТИНА ТОГДА ЗаказПокупателяМатериалы.Ссылка ИНАЧЕ ЗаказПокупателяМатериалы.Ссылка.СтруктурнаяЕдиницаРезерв КОНЕЦ КАК НовоеМестоРезерва
	// © Шишка В.В. [6 октября 2021]  КОНЕЦ
	//--------------------------------------------------------------------------
	|ИЗ
	|	Документ.ЗаказПокупателя.Материалы КАК ЗаказПокупателяМатериалы
	|ГДЕ
	|	ЗаказПокупателяМатериалы.Ссылка = &ДокументОснование";
	
	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(ДокументСсылкаЗаказПокупателя, Запрос.МенеджерВременныхТаблиц, Ложь);
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылкаЗаказПокупателя);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	Запрос.УстановитьПараметр("Проект", Проект);
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
	ТаблицаОстатков.Индексы.Добавить("Номенклатура,Характеристика");
	
	Запасы.Очистить();
	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		
		Если ТаблицаОстатков.Количество() > 0 Тогда
			ТаблицаЗапасы = МассивРезультатов[2].Выгрузить();
			ЗаполнитьЗапасыПоЗаказПокупателяНовоеМесто(ТаблицаЗапасы, ТаблицаОстатков);
		КонецЕсли;
		
		ТаблицаОстатков = МассивРезультатов[1].Выгрузить();
		ТаблицаОстатков.Индексы.Добавить("Номенклатура,Характеристика");
		Если ТаблицаОстатков.Количество() > 0 Тогда
			ТаблицаМатериалы = МассивРезультатов[3].Выгрузить();
			ЗаполнитьЗапасыПоЗаказПокупателяНовоеМесто(ТаблицаМатериалы, ТаблицаОстатков);
		КонецЕсли;
		
	Иначе
		
		Если ТаблицаОстатков.Количество() > 0 Тогда
			ТаблицаЗапасы = МассивРезультатов[1].Выгрузить();
			ЗаполнитьЗапасыПоЗаказПокупателяНовоеМесто(ТаблицаЗапасы, ТаблицаОстатков);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоЗаказПокупателяНовоеМесто()

// Процедура заполнения документа на основании заказа покупателя.
//
// Параметры:
//	ДокументОснование - ДокументСсылка.ПриходнаяНакладная - приходная накладная
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоЗаказПокупателяИсходноеМесто(ДанныеЗаполнения)
	
	// Заполнение шапки.
	ЗаказПокупателя = ДанныеЗаполнения;
	
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	//Было---
	//ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, Новый Структура("Организация, ВидОперации, СостояниеЗаказа, Проведен, ОжидаетсяВыборВариантаКП"));
	//Стало+++ Добавлен реквизит Проект
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, Новый Структура("Организация, ВидОперации, СостояниеЗаказа, Проведен, ОжидаетсяВыборВариантаКП, Проект"));
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(ДанныеЗаполнения, ЗначенияРеквизитов);
	Организация = ЗначенияРеквизитов.Организация;
	
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	Проект = ЗначенияРеквизитов.Проект;
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	
	// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
	Если Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() Тогда
		ЗаполнитьПоЗаказПокупателяИсходноеМесто_new(ДанныеЗаполнения);
		Возврат;
	КонецЕсли;
	// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
	
	// Заполнение табличной части.
	Запрос = Новый Запрос;
	//--------------------------------------------------------------------------
	// © Шишка В.В. [6 октября 2021]  НАЧАЛО
	УчетСебестоимостиВРазрезеОрганизации = РегистрыСведений.УчетнаяПолитикаРегл.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация)).УчетСебестоимостиВРазрезеОрганизации;
	Запрос.УстановитьПараметр("УчетСебестоимостиВРазрезеОрганизации", УчетСебестоимостиВРазрезеОрганизации = Истина);
	// © Шишка В.В. [6 октября 2021]  КОНЕЦ
	//--------------------------------------------------------------------------
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыОстатки.ИсходноеМесто КАК ИсходноеМестоРезерва,
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.Характеристика КАК Характеристика,
	|	ЗаказыОстатки.Партия КАК Партия,
	|	ЗаказыОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	//--------------------------------------------------------------------------
	// © Шишка В.В. [6 октября 2021]  НАЧАЛО
	//|		ЗапасыОстатки.СтруктурнаяЕдиница КАК ИсходноеМесто,
	|		ВЫБОР КОГДА &УчетСебестоимостиВРазрезеОрганизации = ИСТИНА ТОГДА &ДокументОснование ИНАЧЕ ЗапасыОстатки.СтруктурнаяЕдиница КОНЕЦ КАК ИсходноеМесто,
	// © Шишка В.В. [6 октября 2021]  КОНЕЦ
	//--------------------------------------------------------------------------
	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|		ЗапасыОстатки.Характеристика КАК Характеристика,
	|		ЗапасыОстатки.Партия КАК Партия,
	|		ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗапасыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РазмещениеОстатки.ИсточникОбеспечения,
	|		РазмещениеОстатки.Номенклатура,
	|		РазмещениеОстатки.Характеристика,
	|		ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка),
	|		РазмещениеОстатки.Номенклатура.ЕдиницаИзмерения,
	|		РазмещениеОстатки.КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказов.Остатки(
	|				,
	//--------------------------------------------------------------------------
	// © Шишка В.В. [15 октября 2021 г.]  НАЧАЛО
	|	            &УчетСебестоимостиВРазрезеОрганизации = ЛОЖЬ И
	// © Шишка В.В. [15 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК РазмещениеОстатки) КАК ЗаказыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыОстатки.ИсходноеМесто,
	|	ЗаказыОстатки.Номенклатура,
	|	ЗаказыОстатки.Характеристика,
	|	ЗаказыОстатки.Партия,
	|	ЗаказыОстатки.ЕдиницаИзмерения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Номенклатура,
	|	ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ЗаказПокупателяЗапасы.Характеристика,
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	|	&Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	|	ЗаказПокупателяЗапасы.Партия,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент
	|ИЗ
	|	ВТЗаказПокупателяЗапасы КАК ЗаказПокупателяЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяМатериалы.Номенклатура,
	|	ЗаказПокупателяМатериалы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ЗаказПокупателяМатериалы.Характеристика,
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	|	&Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	|	ЗаказПокупателяМатериалы.Партия,
	|	ЗаказПокупателяМатериалы.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяМатериалы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент
	|ИЗ
	|	Документ.ЗаказПокупателя.Материалы КАК ЗаказПокупателяМатериалы
	|ГДЕ
	|	ЗаказПокупателяМатериалы.Ссылка = &ДокументОснование";
	
	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(ДанныеЗаполнения, Запрос.МенеджерВременныхТаблиц, Ложь);
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	Запрос.УстановитьПараметр("Проект", Проект);
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
	ТаблицаОстатков.Индексы.Добавить("Номенклатура,Характеристика");
	
	Запасы.Очистить();
	Выборка = МассивРезультатов[1].Выбрать();
	Выборка.Следующий();
	Если ТаблицаОстатков.Количество() > 0 Тогда
		ТаблицаЗапасы = МассивРезультатов[1].Выгрузить();
		ЗаполнитьЗапасыПоЗаказПокупателяИсходноеМесто(ТаблицаЗапасы, ТаблицаОстатков);
		
		Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
			ТаблицаМатериалы = МассивРезультатов[2].Выгрузить();
			ЗаполнитьЗапасыПоЗаказПокупателяИсходноеМесто(ТаблицаМатериалы, ТаблицаОстатков);
		КонецЕсли;
		
		Для каждого СтрокаОстатков Из ТаблицаОстатков Цикл
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОстатков);
			НоваяСтрока.ЕдиницаИзмерения = СтрокаОстатков.ЕдиницаИзмерения;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоЗаказПокупателяИсходноеМесто()

// Процедура заполнения строку табличной части Запасы на основании заказа покупателя.
//
Процедура ЗаполнитьЗапасыПоЗаказПокупателяНовоеМесто(ТаблицаНоменклатуры, ТаблицаОстатков)
	
	Для каждого СтрокаТЧ Из ТаблицаНоменклатуры Цикл
		
		Если СтрокаТЧ.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураДляПоиска = Новый Структура;
		СтруктураДляПоиска.Вставить("Номенклатура", СтрокаТЧ.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", СтрокаТЧ.Характеристика);
		
		МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
		Если МассивСтрокОстатков.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		
		КоличествоКСписанию = СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент;
		МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоКСписанию;
		Если МассивСтрокОстатков[0].КоличествоОстаток < 0 Тогда
			
			НоваяСтрока.Количество = (КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / СтрокаТЧ.Коэффициент;
			
		КонецЕсли;
		
		Если МассивСтрокОстатков[0].КоличествоОстаток <= 0 Тогда
			ТаблицаОстатков.Удалить(МассивСтрокОстатков[0]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьЗапасыПоЗаказПокупателяНовоеМесто()

// Процедура заполнения строку табличной части Запасы на основании заказа покупателя.
//
Процедура ЗаполнитьЗапасыПоЗаказПокупателяИсходноеМесто(ТаблицаНоменклатуры, ТаблицаОстатков)
	
	Для каждого СтрокаТЧ Из ТаблицаНоменклатуры Цикл
		
		Если СтрокаТЧ.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураДляПоиска = Новый Структура;
		СтруктураДляПоиска.Вставить("Номенклатура", СтрокаТЧ.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", СтрокаТЧ.Характеристика);
		
		МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
		Для каждого СтрокаОстатков Из МассивСтрокОстатков Цикл
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОстатков);
			
			//ПодольскийАИ #УчетПроектов 30.09.2021 {
			НоваяСтрока.Проект = СтрокаТЧ.Проект;
			//ПодольскийАИ #УчетПроектов 30.09.2021 }
			
			НоваяСтрока.Количество = СтрокаОстатков.Количество / СтрокаТЧ.Коэффициент;
			НоваяСтрока.ЕдиницаИзмерения = СтрокаТЧ.ЕдиницаИзмерения;
			ТаблицаОстатков.Удалить(СтрокаОстатков);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьЗапасыПоЗаказПокупателяИсходноеМесто()

//+++ Lazare_27.07.2021
Процедура ЗаполнитьПоПриходнаяНакладная(ДокументСсылкаПриходнаяНакладная) Экспорт	
	Если ДокументСсылкаПриходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика Тогда
		ЗаполнитьПоПриходнаяНакладнаяНов(ДокументСсылкаПриходнаяНакладная);	
	КонецЕсли; 
КонецПроцедуры

Процедура ЗаполнитьПоПриходнаяНакладнаяНов(ДокументСсылкаПриходнаяНакладная)
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылкаПриходнаяНакладная,
			"Организация, ВидОперации,Проведен ");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходнаяНакладнаяЗапасы.Номенклатура,
	|	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения,
	|	ПриходнаяНакладнаяЗапасы.Характеристика,
	//ПодольскийАИ 30.09.2021 {
	|	ПриходнаяНакладнаяЗапасы.Проект,
	//ПодольскийАИ 30.09.2021 }
	|	ПриходнаяНакладнаяЗапасы.Партия,
	|	ПриходнаяНакладнаяЗапасы.Количество,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница КАК НовоеМестоРезерва
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|ГДЕ
	|	ПриходнаяНакладнаяЗапасы.Ссылка = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылкаПриходнаяНакладная);	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаИзРезультатаЗапроса);
	ДокументОснование = ДокументСсылкаПриходнаяНакладная; 	
	
	
	ВыборкаИзРезультатаЗапроса.Сбросить();
	Запасы.Очистить();
	Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаИзРезультатаЗапроса);
	КонецЦикла;
		
КонецПроцедуры
//--- Lazare_27.07.2021

// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
Процедура ЗаполнитьПоЗаказПокупателяНовоеМесто_new(ДокументСсылкаЗаказПокупателя)
	
	Запасы.Очистить();
		
	ТЗОборотыРезервов = РезервированиеЗапасов_new.ПолучитьОборотыРезервовПоДокументу(ДокументСсылкаЗаказПокупателя);

	Запрос = Новый Запрос;
	
	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(ДокументСсылкаЗаказПокупателя, Запрос.МенеджерВременныхТаблиц, Ложь);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЗОборотыРезервов.Организация КАК Организация,
		|	ТЗОборотыРезервов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТЗОборотыРезервов.Документ КАК Документ,
		|	ТЗОборотыРезервов.Номенклатура КАК Номенклатура,
		|	ТЗОборотыРезервов.Характеристика КАК Характеристика,
		|	ТЗОборотыРезервов.Партия КАК Партия,
		|	ТЗОборотыРезервов.Проект КАК Проект,
		|	ТЗОборотыРезервов.КоличествоОборот КАК КоличествоОборот
		|ПОМЕСТИТЬ ТЗОборотыРезервов
		|ИЗ
		|	&ТЗОборотыРезервов КАК ТЗОборотыРезервов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
		|	ВТЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
		|	ВТЗаказПокупателяЗапасы.Партия КАК Партия,
		|	ВТЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТЗаказПокупателяЗапасы.Проект КАК Проект,
		|	ВЫБОР
		|		КОГДА &УчетСебестоимостиВРазрезеОрганизации = ИСТИНА
		|			ТОГДА ВТЗаказПокупателяЗапасы.Ссылка
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв ЕСТЬ NULL
		|						ИЛИ ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв = НЕОПРЕДЕЛЕНО
		|						ИЛИ ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|					ТОГДА ВТЗаказПокупателяЗапасы.СтруктурнаяЕдиницаЗапасы
		|				ИНАЧЕ ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв
		|			КОНЕЦ
		|	КОНЕЦ КАК НовоеМестоРезерва,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|			ТОГДА 1
		|		ИНАЧЕ ВТЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ * ВТЗаказПокупателяЗапасы.Количество - ЕСТЬNULL(ТЗОборотыРезервов.КоличествоОборот, 0) КАК Количество
		|ИЗ
		|	ВТЗаказПокупателяЗапасы КАК ВТЗаказПокупателяЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗОборотыРезервов КАК ТЗОборотыРезервов
		|		ПО ВТЗаказПокупателяЗапасы.Ссылка = ТЗОборотыРезервов.Документ
		|			И ВТЗаказПокупателяЗапасы.Ссылка.Организация = ТЗОборотыРезервов.Организация
		|			И (ВЫБОР
		|				КОГДА &УчетСебестоимостиВРазрезеОрганизации = ИСТИНА
		|					ТОГДА ВТЗаказПокупателяЗапасы.Ссылка
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв ЕСТЬ NULL
		|								ИЛИ ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв = НЕОПРЕДЕЛЕНО
		|								ИЛИ ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|							ТОГДА ВТЗаказПокупателяЗапасы.СтруктурнаяЕдиницаЗапасы
		|						ИНАЧЕ ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв
		|					КОНЕЦ
		|			КОНЕЦ = ТЗОборотыРезервов.СтруктурнаяЕдиница)
		|			И ВТЗаказПокупателяЗапасы.Номенклатура = ТЗОборотыРезервов.Номенклатура
		|			И ВТЗаказПокупателяЗапасы.Характеристика = ТЗОборотыРезервов.Характеристика
		|			И ВТЗаказПокупателяЗапасы.Партия = ТЗОборотыРезервов.Партия
		|			И (ВЫБОР
		|				КОГДА &УчетПоПроектам
		|					ТОГДА ВЫБОР
		|							КОГДА ВТЗаказПокупателяЗапасы.Проект ЕСТЬ NULL
		|									ИЛИ ВТЗаказПокупателяЗапасы.Проект = НЕОПРЕДЕЛЕНО
		|									ИЛИ ВТЗаказПокупателяЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|								ТОГДА ТЗОборотыРезервов.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|							ИНАЧЕ ВТЗаказПокупателяЗапасы.Проект = ТЗОборотыРезервов.Проект
		|						КОНЕЦ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ВТЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|				ТОГДА 1
		|			ИНАЧЕ ВТЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
		|		КОНЕЦ * ВТЗаказПокупателяЗапасы.Количество - ЕСТЬNULL(ТЗОборотыРезервов.КоличествоОборот, 0) > 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗаказПокупателяМатериалы.Номенклатура,
		|	ЗаказПокупателяМатериалы.Характеристика,
		|	ЗаказПокупателяМатериалы.Партия,
		|	ЗаказПокупателяМатериалы.ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА &УчетПоПроектам
		|			ТОГДА ВЫБОР
		|					КОГДА ЗаказПокупателяМатериалы.Проект ЕСТЬ NULL
		|							ИЛИ ЗаказПокупателяМатериалы.Проект = НЕОПРЕДЕЛЕНО
		|							ИЛИ ЗаказПокупателяМатериалы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|						ТОГДА ВЫБОР
		|								КОГДА ЗаказПокупателяМатериалы.Ссылка.Проект ЕСТЬ NULL
		|										ИЛИ ЗаказПокупателяМатериалы.Ссылка.Проект = НЕОПРЕДЕЛЕНО
		|										ИЛИ ЗаказПокупателяМатериалы.Ссылка.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|									ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|								ИНАЧЕ ЗаказПокупателяМатериалы.Ссылка.Проект
		|							КОНЕЦ
		|					ИНАЧЕ ЗаказПокупателяМатериалы.Проект
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &УчетСебестоимостиВРазрезеОрганизации = ИСТИНА
		|			ТОГДА ЗаказПокупателяМатериалы.Ссылка
		|		ИНАЧЕ ЗаказПокупателяМатериалы.Ссылка.СтруктурнаяЕдиницаРезерв
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|			ТОГДА 1
		|		ИНАЧЕ ЗаказПокупателяМатериалы.ЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ * ЗаказПокупателяМатериалы.Количество - ЕСТЬNULL(ТЗОборотыРезервов.КоличествоОборот, 0)
		|ИЗ
		|	Документ.ЗаказПокупателя.Материалы КАК ЗаказПокупателяМатериалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗОборотыРезервов КАК ТЗОборотыРезервов
		|		ПО ЗаказПокупателяМатериалы.Ссылка = ТЗОборотыРезервов.Документ
		|			И ЗаказПокупателяМатериалы.Ссылка.Организация = ТЗОборотыРезервов.Организация
		|			И (ВЫБОР
		|				КОГДА &УчетСебестоимостиВРазрезеОрганизации = ИСТИНА
		|					ТОГДА ЗаказПокупателяМатериалы.Ссылка
		|				ИНАЧЕ ЗаказПокупателяМатериалы.Ссылка.СтруктурнаяЕдиницаРезерв
		|			КОНЕЦ = ТЗОборотыРезервов.СтруктурнаяЕдиница)
		|			И ЗаказПокупателяМатериалы.Номенклатура = ТЗОборотыРезервов.Номенклатура
		|			И ЗаказПокупателяМатериалы.Характеристика = ТЗОборотыРезервов.Характеристика
		|			И ЗаказПокупателяМатериалы.Партия = ТЗОборотыРезервов.Партия
		|			И (ВЫБОР
		|				КОГДА &УчетПоПроектам
		|					ТОГДА ВЫБОР
		|							КОГДА ЗаказПокупателяМатериалы.Проект ЕСТЬ NULL
		|									ИЛИ ЗаказПокупателяМатериалы.Проект = НЕОПРЕДЕЛЕНО
		|									ИЛИ ЗаказПокупателяМатериалы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|								ТОГДА ВЫБОР
		|										КОГДА ЗаказПокупателяМатериалы.Ссылка.Проект ЕСТЬ NULL
		|												ИЛИ ЗаказПокупателяМатериалы.Ссылка.Проект = НЕОПРЕДЕЛЕНО
		|												ИЛИ ЗаказПокупателяМатериалы.Ссылка.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|											ТОГДА ТЗОборотыРезервов.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|										ИНАЧЕ ЗаказПокупателяМатериалы.Ссылка.Проект = ТЗОборотыРезервов.Проект
		|									КОНЕЦ
		|							ИНАЧЕ ЗаказПокупателяМатериалы.Проект = ТЗОборотыРезервов.Проект
		|						КОНЕЦ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|ГДЕ
		|	ЗаказПокупателяМатериалы.Ссылка = &ЗаказПокупателя
		|	И ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|				ТОГДА 1
		|			ИНАЧЕ ЗаказПокупателяМатериалы.ЕдиницаИзмерения.Коэффициент
		|		КОНЕЦ * ЗаказПокупателяМатериалы.Количество - ЕСТЬNULL(ТЗОборотыРезервов.КоличествоОборот, 0) > 0";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ДокументСсылкаЗаказПокупателя);
    Запрос.УстановитьПараметр("ТЗОборотыРезервов", ТЗОборотыРезервов);
	Запрос.УстановитьПараметр("УчетПоПроектам", ПолучитьФункциональнуюОпцию("УчетПоПроектам"));
	
	УчетСебестоимостиВРазрезеОрганизации = РегистрыСведений.УчетнаяПолитикаРегл.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация)).УчетСебестоимостиВРазрезеОрганизации;
	Запрос.УстановитьПараметр("УчетСебестоимостиВРазрезеОрганизации", УчетСебестоимостиВРазрезеОрганизации = Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Запасы.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказПокупателяИсходноеМесто_new(ДокументСсылкаЗаказПокупателя)
	
	Запасы.Очистить();
	
	ДатаПроверки = ?(ЗначениеЗаполнено(ЭтотОбъект.Дата),ЭтотОбъект.Дата,ТекущаяДата());
	ТЗОстаткиРезервов = РезервированиеЗапасов_new.ПолучитьОстаткиРезервовПоДокументу(ДокументСсылкаЗаказПокупателя,ДатаПроверки);

	Запрос = Новый Запрос;
	
	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(ДокументСсылкаЗаказПокупателя, Запрос.МенеджерВременныхТаблиц, Ложь);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЗОстаткиРезервов.Организация КАК Организация,
		|	ТЗОстаткиРезервов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТЗОстаткиРезервов.Документ КАК Документ,
		|	ТЗОстаткиРезервов.Номенклатура КАК Номенклатура,
		|	ТЗОстаткиРезервов.Характеристика КАК Характеристика,
		|	ТЗОстаткиРезервов.Партия КАК Партия,
		|	ТЗОстаткиРезервов.Проект КАК Проект,
		|	ТЗОстаткиРезервов.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ТЗОстаткиРезервов
		|ИЗ
		|	&ТЗОстаткиРезервов КАК ТЗОстаткиРезервов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
		|	ВТЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
		|	ВТЗаказПокупателяЗапасы.Партия КАК Партия,
		|	ВТЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТЗаказПокупателяЗапасы.Проект КАК Проект,
		|	ВЫБОР
		|		КОГДА &УчетСебестоимостиВРазрезеОрганизации = ИСТИНА
		|			ТОГДА ВТЗаказПокупателяЗапасы.Ссылка
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв ЕСТЬ NULL
		|						ИЛИ ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв = НЕОПРЕДЕЛЕНО
		|						ИЛИ ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|					ТОГДА ВТЗаказПокупателяЗапасы.СтруктурнаяЕдиницаЗапасы
		|				ИНАЧЕ ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв
		|			КОНЕЦ
		|	КОНЕЦ КАК ИсходноеМестоРезерва,
		|	ЕСТЬNULL(ТЗОстаткиРезервов.КоличествоОстаток, 0) КАК Количество
		|ИЗ
		|	ВТЗаказПокупателяЗапасы КАК ВТЗаказПокупателяЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗОстаткиРезервов КАК ТЗОстаткиРезервов
		|		ПО ВТЗаказПокупателяЗапасы.Ссылка = ТЗОстаткиРезервов.Документ
		|			И ВТЗаказПокупателяЗапасы.Ссылка.Организация = ТЗОстаткиРезервов.Организация
		|			И (ВЫБОР
		|				КОГДА &УчетСебестоимостиВРазрезеОрганизации = ИСТИНА
		|					ТОГДА ВТЗаказПокупателяЗапасы.Ссылка
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв ЕСТЬ NULL
		|								ИЛИ ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв = НЕОПРЕДЕЛЕНО
		|								ИЛИ ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|							ТОГДА ВТЗаказПокупателяЗапасы.СтруктурнаяЕдиницаЗапасы
		|						ИНАЧЕ ВТЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв
		|					КОНЕЦ
		|			КОНЕЦ = ТЗОстаткиРезервов.СтруктурнаяЕдиница)
		|			И ВТЗаказПокупателяЗапасы.Номенклатура = ТЗОстаткиРезервов.Номенклатура
		|			И ВТЗаказПокупателяЗапасы.Характеристика = ТЗОстаткиРезервов.Характеристика
		|			И ВТЗаказПокупателяЗапасы.Партия = ТЗОстаткиРезервов.Партия
		|			И (ВЫБОР
		|				КОГДА &УчетПоПроектам
		|					ТОГДА ВЫБОР
		|							КОГДА ВТЗаказПокупателяЗапасы.Проект ЕСТЬ NULL
		|									ИЛИ ВТЗаказПокупателяЗапасы.Проект = НЕОПРЕДЕЛЕНО
		|									ИЛИ ВТЗаказПокупателяЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|								ТОГДА ТЗОстаткиРезервов.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|							ИНАЧЕ ВТЗаказПокупателяЗапасы.Проект = ТЗОстаткиРезервов.Проект
		|						КОНЕЦ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|ГДЕ
		|	ЕСТЬNULL(ТЗОстаткиРезервов.КоличествоОстаток, 0) > 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗаказПокупателяМатериалы.Номенклатура,
		|	ЗаказПокупателяМатериалы.Характеристика,
		|	ЗаказПокупателяМатериалы.Партия,
		|	ЗаказПокупателяМатериалы.ЕдиницаИзмерения,
		|	ЗаказПокупателяМатериалы.Проект,
		|	ВЫБОР
		|		КОГДА &УчетСебестоимостиВРазрезеОрганизации = ИСТИНА
		|			ТОГДА ЗаказПокупателяМатериалы.Ссылка
		|		ИНАЧЕ ЗаказПокупателяМатериалы.Ссылка.СтруктурнаяЕдиницаРезерв
		|	КОНЕЦ,
		|	ЕСТЬNULL(ТЗОстаткиРезервов.КоличествоОстаток, 0)
		|ИЗ
		|	Документ.ЗаказПокупателя.Материалы КАК ЗаказПокупателяМатериалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗОстаткиРезервов КАК ТЗОстаткиРезервов
		|		ПО ЗаказПокупателяМатериалы.Ссылка = ТЗОстаткиРезервов.Документ
		|			И ЗаказПокупателяМатериалы.Ссылка.Организация = ТЗОстаткиРезервов.Организация
		|			И (ВЫБОР
		|				КОГДА &УчетСебестоимостиВРазрезеОрганизации = ИСТИНА
		|					ТОГДА ЗаказПокупателяМатериалы.Ссылка
		|				ИНАЧЕ ЗаказПокупателяМатериалы.Ссылка.СтруктурнаяЕдиницаРезерв
		|			КОНЕЦ = ТЗОстаткиРезервов.СтруктурнаяЕдиница)
		|			И ЗаказПокупателяМатериалы.Номенклатура = ТЗОстаткиРезервов.Номенклатура
		|			И ЗаказПокупателяМатериалы.Характеристика = ТЗОстаткиРезервов.Характеристика
		|			И ЗаказПокупателяМатериалы.Партия = ТЗОстаткиРезервов.Партия
		|			И (ВЫБОР
		|				КОГДА &УчетПоПроектам
		|					ТОГДА ВЫБОР
		|							КОГДА ЗаказПокупателяМатериалы.Проект ЕСТЬ NULL
		|									ИЛИ ЗаказПокупателяМатериалы.Проект = НЕОПРЕДЕЛЕНО
		|									ИЛИ ЗаказПокупателяМатериалы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|								ТОГДА ВЫБОР
		|										КОГДА ЗаказПокупателяМатериалы.Ссылка.Проект ЕСТЬ NULL
		|												ИЛИ ЗаказПокупателяМатериалы.Ссылка.Проект = НЕОПРЕДЕЛЕНО
		|												ИЛИ ЗаказПокупателяМатериалы.Ссылка.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|											ТОГДА ТЗОстаткиРезервов.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|										ИНАЧЕ ЗаказПокупателяМатериалы.Ссылка.Проект = ТЗОстаткиРезервов.Проект
		|									КОНЕЦ
		|							ИНАЧЕ ЗаказПокупателяМатериалы.Проект = ТЗОстаткиРезервов.Проект
		|						КОНЕЦ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|ГДЕ
		|	ЕСТЬNULL(ТЗОстаткиРезервов.КоличествоОстаток, 0) > 0";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ДокументСсылкаЗаказПокупателя);
    Запрос.УстановитьПараметр("ТЗОстаткиРезервов", ТЗОстаткиРезервов);
	Запрос.УстановитьПараметр("УчетПоПроектам", ПолучитьФункциональнуюОпцию("УчетПоПроектам"));
	
	УчетСебестоимостиВРазрезеОрганизации = РегистрыСведений.УчетнаяПолитикаРегл.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация)).УчетСебестоимостиВРазрезеОрганизации;
	Запрос.УстановитьПараметр("УчетСебестоимостиВРазрезеОрганизации", УчетСебестоимостиВРазрезеОрганизации = Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Запасы.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказПокупателяНовоеМесто";
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПриходнаяНакладная"; //++Lazare 27.07.2021

	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры

// В обработчике события ОбработкаПроверкиЗаполнения документа выполняется
// копирование и обнуление проверяемых реквизитов для исключения стандартной
// проверки заполнения платформой и последующей проверки средствами встроенного языка.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Для каждого СтрокаТаблицыЗапасов Из Запасы Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыЗапасов.ИсходноеМестоРезерва)
		   И НЕ ЗначениеЗаполнено(СтрокаТаблицыЗапасов.НовоеМестоРезерва) Тогда
		   
		   УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, 
		   "Не указано исходное место резерва.",
		   "Запасы",
		   СтрокаТаблицыЗапасов.НомерСтроки,
		   "ИсходноеМестоРезерва",
		   Отказ);
		   
		   УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, 
		   "Не указано новое место резерва.",
		   "Запасы",
		   СтрокаТаблицыЗапасов.НомерСтроки,
		   "НовоеМестоРезерва",
		   Отказ);
		   
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// В обработчике события ОбработкаПроведения документа выполняется
// - осуществляется удаление движений документа,
// - формируется структура шапки необходимых реквизитов документа,
// - формируется временная таблица по табличной части Товары,
// - приход товаров в места хранения,
// - приход свободных остатков товаров в местах хранения,
// - приход по стоимости товаров в местах хранения,
// - формирование проводок документа.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.РезервированиеЗапасов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	//// Отражение в разделах учета
	//УправлениеНебольшойФирмойСервер.ОтразитьРазмещениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
	//УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	
	// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
	Если ПереходНаНовыйФункционал Тогда
		УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
		РезервированиеЗапасов_new.ОтразитьРезервированиеЗапасов(ДополнительныеСвойства, Движения, Отказ);
	ИначеЕсли Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() Тогда
		РезервированиеЗапасов_new.ОтразитьРезервированиеЗапасов(ДополнительныеСвойства, Движения, Отказ);
	Иначе
		УправлениеНебольшойФирмойСервер.ОтразитьРазмещениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
		УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления

	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	// Контроль
	Документы.РезервированиеЗапасов.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);

	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.РезервированиеЗапасов.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);

КонецПроцедуры


#КонецОбласти


#КонецЕсли