
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция КлючПараметровПечати() Экспорт
	
	Возврат "ПАРАМЕТРЫ_ПЕЧАТИ_Универсальные_БланкТоварногоНаполнения";
	
КонецФункции

Функция ПолныйПутьКМакету() Экспорт
	
	Возврат "Обработка.ПечатьБланкТоварногоНаполнения.ПФ_MXL_БланкТоварногоНаполнения";
	
КонецФункции

Функция ПредставлениеПФ() Экспорт
	
	Возврат НСтр("ka='სასაქონლო შევსების ბლანკი';ru='Бланк товарного наполнения'");
	
КонецФункции

Функция СформироватьПФ(ОписаниеПечатнойФормы, ДанныеОбъектовПечати, ОбъектыПечати) Экспорт
	Перем ПервыйДокумент, НомерСтрокиНачало, Ошибки;
	
	Макет				= УправлениеПечатью.МакетПечатнойФормы(ОписаниеПечатнойФормы.ПолныйПутьКМакету);
	ТабличныйДокумент	= ОписаниеПечатнойФормы.ТабличныйДокумент;
	ДанныеПечати		= Новый Структура;
	ЕстьТЧЗапасы		= (ДанныеОбъектовПечати.Колонки.Найти("ТаблицаЗапасы") <> Неопределено);
	ЕстьТЧМатериалы		= (ДанныеОбъектовПечати.Колонки.Найти("ТаблицаМатериалы") <> Неопределено);
	
	Для каждого ДанныеОбъекта Из ДанныеОбъектовПечати Цикл
		
		ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало, ДанныеПечати);
		
		МассивОбластейМакета = Новый Массив;
		МассивОбластейМакета.Добавить("Заголовок");
		МассивОбластейМакета.Добавить("Склад");
		МассивОбластейМакета.Добавить("ВремяПечати");
		
		
		НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ДанныеОбъекта.ДатаДокумента, ДанныеОбъекта.Номер, ДанныеОбъекта.Префикс);
		ДанныеОбъекта.ПредставлениеРегистратора = НСтр("ka='მარაგების ჩამოწერა';ru='Списание запасов'");
		Текст = НСтр("ka=' ';ru=' от '");
		ТекстЗаголовка = ДанныеОбъекта.ПредставлениеРегистратора + "  № " + НомерДокумента + Текст + Формат(ДанныеОбъекта.ДатаДокумента, "Л=ka_GE; ДФ=dd/MM/yy");
		ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		ДанныеПечати.Вставить("ПредставлениеСклада", ДанныеОбъекта.ПредставлениеСклада);
		ДанныеПечати.Вставить("Организация", ДанныеОбъекта.Организация);
		ДанныеПечати.Вставить("Подразделение", ДанныеОбъекта.Подразделение);
		
		Если ПолучитьФункциональнуюОпцию("УчетПоЯчейкам") Тогда
			
			МассивОбластейМакета.Вставить(2, "Ячейка");
			ДанныеПечати.Вставить("ПредставлениеЯчейки", ДанныеОбъекта.ПредставлениеЯчейки);
			
		КонецЕсли;
		
		ВремяПечати = НСтр("ru='Дата и время печати: ';ka='ამობეჭდვის თარიღი: '") + ТекущаяДатаСеанса() + НСтр("ru='. Пользователь: ';ka='. მოხმარებელი: '") + Пользователи.АвторизованныйПользователь();
		ДанныеПечати.Вставить("ВремяПечати", ВремяПечати);
		
		Для каждого ИмяОбласти Из МассивОбластейМакета Цикл
			
			ОбластьМакета = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, ИмяОбласти, "", Ошибки);
			Если ОбластьМакета <> Неопределено Тогда
				
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЕсли;
			
		КонецЦикла;
		
		
		ОбластьМакета = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "Строка", "", Ошибки);
		ОбластьМакетаШапка = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "ШапкаТаблицы", "", Ошибки);
		ОбластьМакетаОтветственый = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "Ответственый", "", Ошибки);
		Если ОбластьМакета <> Неопределено
			И ОбластьМакетаШапка <> Неопределено Тогда
			
			ОбластьМакетаИтого = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "Итого", "", Ошибки);
			ТаблицаСерийныеНомера = ДанныеОбъекта.ТаблицаСерийныеНомера;
			ПараметрыНоменклатуры = Новый Структура;
			
			Если ЕстьТЧЗапасы Тогда
				
				ДанныеПечати.Вставить("ТипНоменклатурыТаблицы", Нстр("ka='მარაგები';ru='Запасы'"));
				ОбластьМакетаШапка.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
				
				Для каждого СтрокаТаблицыЗапасы Из ДанныеОбъекта.ТаблицаЗапасы Цикл
					
					Если НЕ СтрокаТаблицыЗапасы.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
						
						Продолжить;
						
					КонецЕсли;
					
					ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТаблицыЗапасы, ДанныеПечати, ПараметрыНоменклатуры, ТаблицаСерийныеНомера);
					
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
				КонецЦикла;
				
				Если ОбластьМакетаИтого <> Неопределено Тогда
					
					ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЕстьТЧМатериалы Тогда
				
				ДанныеПечати.Вставить("ТипНоменклатурыТаблицы", Нстр("ka='მასალები';ru='Материалы'"));
				ОбластьМакетаШапка.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
				
				Для каждого СтрокаТаблицыМатериалов Из ДанныеОбъекта.ТаблицаМатериалы Цикл
					
					Если НЕ СтрокаТаблицыМатериалов.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
						
						Продолжить;
						
					КонецЕсли;
					
					ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТаблицыМатериалов, ДанныеПечати, ПараметрыНоменклатуры, ТаблицаСерийныеНомера);
					
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакета);
										
				КонецЦикла;
				
				Если ОбластьМакетаИтого <> Неопределено Тогда
					
					ТабличныйДокумент.Вывести(ОбластьМакетаИтого);

				КонецЕсли;
				
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьМакетаОтветственый );
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеОбъекта.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ДанныеПечати, ПараметрыНоменклатуры, ТаблицаСерийныеНомера)
	
	ДанныеПечати.Очистить();
	
	ДанныеПечати.Вставить("НомерСтроки", СтрокаТабличнойЧасти.НомерСтроки);
	
	СтрокаСерийныеНомера = ПечатьДокументовУНФ.ПредставлениеСерийногоНомера(ТаблицаСерийныеНомера, СтрокаТабличнойЧасти.КлючСвязи);
	
	ПараметрыНоменклатуры.Очистить();
	ПараметрыНоменклатуры.Вставить("Содержание", СтрокаТабличнойЧасти.Содержание);
	ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры", СтрокаТабличнойЧасти.ПредставлениеНоменклатуры);
	ПараметрыНоменклатуры.Вставить("ПредставлениеХарактеристики", СтрокаТабличнойЧасти.Характеристика);
	ПараметрыНоменклатуры.Вставить("ПредставлениеАртикула", СтрокаТабличнойЧасти.Артикул);
	ПараметрыНоменклатуры.Вставить("СтрокаСерийныеНомера", СтрокаСерийныеНомера);
	ДанныеПечати.Вставить("ПредставлениеНоменклатуры", ПечатьДокументовУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры));
	
	ДанныеПечати.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
	ДанныеПечати.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	ДанныеПечати.Вставить("Склад", СтрокаТабличнойЧасти.Склад);
	ДанныеПечати.Вставить("Ячейка", СтрокаТабличнойЧасти.Ячейка);
	
КонецПроцедуры

#КонецЕсли