
&Вместо("СформироватьТаблицаОплатаСчетовИЗаказов")
Процедура РасшAzRy_СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаЗаказПоставщику, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗаказПоставщику);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	//Паганини
	Запрос.УстановитьПараметр("ВидимостьПодсистемыВнутренниеЗаказы", УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВидимостьПодсистемыВнутренниеЗаказы"));
	//_Паганини
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Ссылка КАК СчетНаОплату,
	|	ТаблицаДокумента.СуммаДокумента КАК Сумма
	// +++ { AzRy - [19.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:
	|  ,ТаблицаДокумента.AzRyПроекты КАК Проект
	// +++ } AzRy - [19.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:		
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Контрагент.ВестиУчетОплатыПоСчетам
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	//Паганини_
	//|	И НЕ ТаблицаДокумента.Ссылка.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)";
	|	И ВЫБОР
	|			КОГДА &ВидимостьПодсистемыВнутренниеЗаказы
	|				ТОГДА НЕ ТаблицаДокумента.Ссылка.СостояниеЗаказа.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказов.Открыт)
	|						И НЕ(ТаблицаДокумента.Ссылка.СостояниеЗаказа.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказов.ВРаботе)
	|								И ТаблицаДокумента.Ссылка.Закрыт)
	|			ИНАЧЕ НЕ ТаблицаДокумента.Ссылка.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
	|		КОНЕЦ";
	//_Паганини
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОплатаСчетовИЗаказов", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры
