
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выборка";
	Проводник.Фильтр = "Текстовый документ (*.xlsx)|*.xlsx";
	
	Оповишение = Новый ОписаниеОповещения("ПослеВыбораФайла",ЭтотОбъект);
	Проводник.Показать(Оповишение);
	
КонецПроцедуры


Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительниеПараметры)Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Объект.ПутьКФайлу = ВыбранныеФайлы[0];
	ПрочитатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	Объект.Список.Очистить();
	
	Попытка	
		ТабДок.Прочитать(Объект.ПутьКФайлу, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст("ვერ მოხერხდა ფაილის გახსნა" + ОписаниеОшибки());
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	
	Для НомерСтроки = 2 По КоличествоСтрок Цикл
		НоменклатураИзЭкселя = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки,"ЧГ=0") + "C" + 1).ТекущаяОбласть.Текст; 
		Номенклатура = ПолучитьНоменклатуру(НоменклатураИзЭкселя);
		Если Не (Номенклатура=Неопределено) Тогда 
			СтрокаДанных = Объект.Список.Добавить(); 
			СтрокаДанных.Номенклатура =Номенклатура ;
			СтрокаДанных.ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерения;
			СтрокаДанных.Количество = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки,"ЧГ=0") + "C" + 3).ТекущаяОбласть.Текст;
			
		КонецЕсли;
	КонецЦикла;
	
КонтрагентСсылка = ПолучитьКонтрагент(ТабДок.ПолучитьОбласть("R1C5").ТекущаяОбласть.Текст);
Если Не (КонтрагентСсылка=Неопределено) Тогда
	Объект.Контрагент = КонтрагентСсылка;
КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНоменклатуру (Наименование)
	 	
	  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	 //ДокументОбъект = РеквизитФормыВЗначение("Объект");
	 //Документы.РасходнаяНакладная.ПровестиЗапасыУКлиентаРасход(Объект);


	
КонецФункции

Функция ПолучитьКонтрагент (Наименование)
	 	
	  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	 //ДокументОбъект = РеквизитФормыВЗначение("Объект");
	 //Документы.РасходнаяНакладная.ПровестиЗапасыУКлиентаРасход(Объект);


	
КонецФункции
