
&Вместо("ЗаполнитьДанныеДляОбмена")
Процедура РасшAzRy_ЗаполнитьДанныеДляОбмена(СсылкаНаДокумент)
	
	Дата = ТекущаяДата();
	ИспользоватьАдресИзДоговораДляТТН = Константы.ОПТИМУС_ИспользоватьАдресИзДоговораДляТТН.Получить();
	Организация						  = СсылкаНаДокумент.Организация;
		
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		МобильныйСклад = СсылкаНаДокумент.СтруктурнаяЕдиница.МобильныйСклад;//Перем
		Договор = СсылкаНаДокумент.Договор;//Перем
		АдресПоДоговору = СсылкаНаДокумент.Договор.Адрес;
		АдресКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);

		
		ТипТН 					= ?((СсылкаНаДокумент.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения Или
									СсылкаНаДокумент.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение ИЛИ СсылкаНаДокумент.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)  
									,Перечисления.РС_ТипыТН.ВнутреннееПеремещение, ?(МобильныйСклад, Перечисления.РС_ТипыТН.ПодчиненнаяТН, Перечисления.РС_ТипыТН.РеализацияСТранспортировкой));
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель   		= СсылкаНаДокумент.Организация;
		АдресОтправки 			= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
		ГрузоПолучатель         = СсылкаНаДокумент.Контрагент;
		АдресДоставки 			= ?(ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);
		Если НЕ МобильныйСклад Тогда
			ТранспортноеСредство 	= Договор.ТранспортноеСредство;
			ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;
			Водитель			 	= Договор.Водитель;
			НомерУдостоверения   	= Водитель.ИНН;
		КонецЕсли;
		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		МобильныйСклад = СсылкаНаДокумент.СтруктурнаяЕдиницаРезерв.МобильныйСклад;//Перем
		Договор = СсылкаНаДокумент.Договор;//Перем
		АдресПоДоговору = СсылкаНаДокумент.Договор.Адрес;
		АдресКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
		
		
		ТипТН 					= Перечисления.РС_ТипыТН.РеализацияСТранспортировкой;
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель   		= СсылкаНаДокумент.Организация;
		АдресОтправки 			= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиницаРезерв, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
		ГрузоПолучатель         = СсылкаНаДокумент.Контрагент;
		АдресДоставки 			= ?(ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);
		Если НЕ МобильныйСклад Тогда
			ТранспортноеСредство 	= Договор.ТранспортноеСредство;
			ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;
			Водитель			 	= Договор.Водитель;
			НомерУдостоверения   	= Водитель.ИНН;
		КонецЕсли;
		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;			
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		Договор = СсылкаНаДокумент.Договор;//перем
		
		АдресПоДоговору = СсылкаНаДокумент.Договор.Адрес;
		АдресКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);

		
		ТипТН 					= Перечисления.РС_ТипыТН.ВозвратОтПокупателя;
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель 		= СсылкаНаДокумент.Контрагент;
		АдресОтправки	 		= ?(ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);		
		ГрузоПолучатель 		= СсылкаНаДокумент.Организация;
		АдресДоставки   		= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
		ТранспортноеСредство 	= Договор.ТранспортноеСредство;
		ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;		
		Водитель			 	= Договор.Водитель;
		НомерУдостоверения   	= Водитель.ИНН;
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;

	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		ФактАдрес = Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы;		
		
		Если СсылкаНаДокумент.СтруктурнаяЕдиницаПолучатель.МобильныйСклад Тогда
			ТипТН 					= Перечисления.РС_ТипыТН.Дистрибуция;
			ТранспортноеСредство 	= СсылкаНаДокумент.СтруктурнаяЕдиницаПолучатель.ТранспортноеСредство;
			ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;
			Водитель			 	= ТранспортноеСредство.ОсновнойВодитель;
			НомерУдостоверения   	= Водитель.ИНН;
		Иначе
			ТипТН 					= Перечисления.РС_ТипыТН.ВнутреннееПеремещение;
		КонецЕсли;
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель 		= Организация;
		АдресОтправки	 		= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиница,				ФактАдрес);
		ГрузоПолучатель 		= Организация;
		АдресДоставки 			= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиницаПолучатель,	ФактАдрес);		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;
		//ВидЦены				= УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ВидыЦен", "Оптовая");
		
		//ТранспортноеСредство = СсылкаНаДокумент.Договор.ТранспортноеСредство;
		//Водитель			 = СсылкаНаДокумент.Договор.Водитель;
		//НомерУдостоверения   = Водитель.ИНН;
		//ГосНомерАвтомобиля	 = ТранспортноеСредство.Код;
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПеремещениеВА") Тогда
		
		ТипТН 					= Перечисления.РС_ТипыТН.ВнутреннееПеремещение;
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель 		= Организация;
		АдресОтправки	 		= ?(СсылкаНаДокумент.ВнеоборотныеАктивы.Количество() = 0, "", СсылкаНаДокумент.ВнеоборотныеАктивы[0].Адрес);
		ГрузоПолучатель 		= Организация;
		АдресДоставки 			= ?(СсылкаНаДокумент.ВнеоборотныеАктивы.Количество() = 0, "", СсылкаНаДокумент.ВнеоборотныеАктивы[0].АдресПолучатель);		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЧекККМ") Тогда
		
		ПлательщикТранспортировкиТН = Перечисления.ПлательщикТранспортировкиТН.Покупатель;
		МобильныйСклад   = СсылкаНаДокумент.СтруктурнаяЕдиница.МобильныйСклад;//Перем
		Договор          = СсылкаНаДокумент.Контрагент.ДоговорПоУмолчанию;//Перем
		АдресПоДоговору  = СсылкаНаДокумент.Контрагент.ДоговорПоУмолчанию.Адрес;
		АдресКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);	
		
		ТипТН 					= Перечисления.РС_ТипыТН.РеализацияСТранспортировкой;	
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель   		= СсылкаНаДокумент.Организация;
		АдресОтправки 			= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
		ГрузоПолучатель         = СсылкаНаДокумент.Контрагент;
		АдресДоставки 			= ?(ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);
		
		Если НЕ МобильныйСклад Тогда
			ТранспортноеСредство 	= Договор.ТранспортноеСредство;
			ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;
			Водитель			 	= Договор.Водитель;
			НомерУдостоверения   	= Водитель.ИНН;
		КонецЕсли;
		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;
				
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	КонецЕсли;	

КонецПроцедуры

&После("ПередЗаписью")
Процедура РасшAzRy_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
КонецПроцедуры
