
//&Вместо("ТекстЗапросаИнициализироватьДанныеДокумента_Deprecated")
//Функция РасшAzRy_ТекстЗапросаИнициализироватьДанныеДокумента()
//	
//	Возврат	
//	"ВЫБРАТЬ
//	|	ЕСТЬNULL(ВидыКартЛояльностиПорогиНакопительныхСкидок.СкидкаЛояльность, 0) КАК СкидкаЛояльность,
//	|	ЕСТЬNULL(ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка.КоэфициентПересчета, 1) КАК КоэфициентПересчета
//	|ПОМЕСТИТЬ ВТ_ПарогиЛояльности
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		РасходнаяНакладная.СуммаДокумента КАК СуммаДокумента,
//	|		МАКСИМУМ(ВидыКартЛояльностиПорогиНакопительныхСкидок.НижняяГраницаЛояльность) КАК НижняяГраницаЛояльность,
//	|		ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка КАК Ссылка
//	|	ИЗ
//	|		Документ.РасходнаяНакладная КАК РасходнаяНакладная
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыКартЛояльности.ПорогиНакопительныхСкидок КАК ВидыКартЛояльностиПорогиНакопительныхСкидок
//	|			ПО РасходнаяНакладная.СуммаДокумента >= ВидыКартЛояльностиПорогиНакопительныхСкидок.НижняяГраницаЛояльность
//	|				И РасходнаяНакладная.КартаЛояльности.Владелец = ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка
//	|	ГДЕ
//	|		РасходнаяНакладная.Ссылка = &Ссылка
//	|		И РасходнаяНакладная.Ссылка.КартаЛояльности <> ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка)
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		РасходнаяНакладная.СуммаДокумента,
//	|		ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка) КАК ВложенныйЗапрос
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыКартЛояльности.ПорогиНакопительныхСкидок КАК ВидыКартЛояльностиПорогиНакопительныхСкидок
//	|		ПО ВложенныйЗапрос.Ссылка = ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка
//	|			И ВложенныйЗапрос.НижняяГраницаЛояльность = ВидыКартЛояльностиПорогиНакопительныхСкидок.НижняяГраницаЛояльность
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РасходнаяНакладнаяЗапасы.Ссылка КАК Ссылка,
//	|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
//	|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
//	|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
//	|	РасходнаяНакладнаяЗапасы.СерийныеНомера КАК СерийныеНомера,
//	|	РасходнаяНакладнаяЗапасы.Цена КАК Цена,
//	|	РасходнаяНакладнаяЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
//	|	РасходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
//	|	РасходнаяНакладнаяЗапасы.Заказ КАК Заказ,
//	|	РасходнаяНакладнаяЗапасы.Всего КАК Всего,
//	|	РасходнаяНакладнаяЗапасы.ТипНоменклатурыЗапас КАК ТипНоменклатурыЗапас,
//	|	РасходнаяНакладнаяЗапасы.Резерв КАК Резерв,
//	|	РасходнаяНакладнаяЗапасы.Содержание КАК Содержание,
//	|	РасходнаяНакладнаяЗапасы.КлючСвязи КАК КлючСвязи,
//	|	РасходнаяНакладнаяЗапасы.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
//	|	РасходнаяНакладнаяЗапасы.СправкаБ КАК СправкаБ,
//	|	РасходнаяНакладнаяЗапасы.Партия КАК Партия,
//	|	РасходнаяНакладнаяЗапасы.Количество КАК Количество,
//	|	РасходнаяНакладнаяЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
//	|	РасходнаяНакладнаяЗапасы.НомерГТД КАК НомерГТД,
//	|	РасходнаяНакладнаяЗапасы.ТоварыДляПроизводства КАК ТоварыДляПроизводства,
//	|	РасходнаяНакладнаяЗапасы.Вес КАК Вес,
//	|	ВЫБОР 
//	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику) 
//	|			ТОГДА ИСТИНА 
//	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.ЭтоПодарок 
//	|	КОНЕЦ КАК ЭтоПодарок,
//	|	РасходнаяНакладнаяЗапасы.Сотрудник КАК Сотрудник,
//	|	РасходнаяНакладнаяЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	РасходнаяНакладнаяЗапасы.СуммаНДФЛ КАК СуммаНДФЛ,
//	|	РасходнаяНакладнаяЗапасы.УдержаниеПенсии КАК УдержаниеПенсии,
//	|	РасходнаяНакладнаяЗапасы.УдерживатьПенсию КАК УдерживатьПенсию,
//	|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДСБезвозмездно,
//	|	РасходнаяНакладнаяЗапасы.Объем КАК Объем,
//	//+++ Дмгг
//	|	РасходнаяНакладнаяЗапасы.Всего - РасходнаяНакладнаяЗапасы.Всего * (ЕСТЬNULL(ВТ_ПарогиЛояльности.СкидкаЛояльность, 0) / 100) * ЕСТЬNULL(ВТ_ПарогиЛояльности.КоэфициентПересчета, 0) - (РасходнаяНакладнаяЗапасы.Всего - РасходнаяНакладнаяЗапасы.Сумма * (ЕСТЬNULL(ВТ_ПарогиЛояльности.СкидкаЛояльность, 0) / 100) * ЕСТЬNULL(ВТ_ПарогиЛояльности.КоэфициентПересчета, 0)) / (1 + РасходнаяНакладнаяЗапасы.СтавкаНДС.Ставка / 100) КАК СуммаНДС,
//	|	ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Всего - РасходнаяНакладнаяЗапасы.Всего * (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) * ВТ_ПарогиЛояльности.КоэфициентПересчета - ВЫБОР
//	|			КОГДА РасходнаяНакладнаяЗапасы.СтавкаНДС.Ставка = 0
//	|				ТОГДА 0
//	|			ИНАЧЕ РасходнаяНакладнаяЗапасы.Всего - РасходнаяНакладнаяЗапасы.Всего * (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) * ВТ_ПарогиЛояльности.КоэфициентПересчета - (РасходнаяНакладнаяЗапасы.Всего - РасходнаяНакладнаяЗапасы.Сумма * (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) * ВТ_ПарогиЛояльности.КоэфициентПересчета) / (1 + РасходнаяНакладнаяЗапасы.СтавкаНДС.Ставка / 100)
//	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК Сумма,
//	|	РасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ КАК ВидНачисленияУдержания,
//	|	РасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ КАК ВидНалогаНДФЛ,
//	|	РасходнаяНакладнаяЗапасы.СчетДоходовБП КАК СчетДоходовБП,
//	|	РасходнаяНакладнаяЗапасы.ВидУдержанияПФ КАК ВидУдержанияПФ,
//	|	РасходнаяНакладнаяЗапасы.НаправлениеДеятельности,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 {
//	|	ВЫБОР
//	|		КОГДА &УчетПоПроектам
//	|			ТОГДА ВЫБОР
//	|					КОГДА РасходнаяНакладнаяЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
//	|						ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
//	|					ИНАЧЕ РасходнаяНакладнаяЗапасы.Проект
//	|				КОНЕЦ
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
//	|	КОНЕЦ КАК Проект,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 }
//	|	РасходнаяНакладнаяЗапасы.Ссылка.ПровестиНалогПрибили КАК ПровестиНалогПрибили,
//	// Kuzmich, 21.05.2019, Счет выручки в табличной части
//	|	РасходнаяНакладнаяЗапасы.СчетУчетаВыручкиОтПродажРегл КАК СчетУчетаВыручкиОтПродажРегл,
//	// Kuzmich, 21.05.2019, Счет выручки в табличной части
//	//Lazare_
//	|	РасходнаяНакладнаяЗапасы.СтруктурнаяЕдиницаЗапасы КАК СтруктурнаяЕдиницаЗапасы
//	//_Lazare
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|	,РасходнаяНакладнаяЗапасы.Усушка_КоличествоСобрПотери КАК КоличествоСобрПотери
//	|	,РасходнаяНакладнаяЗапасы.Усушка_СписаниеНаПотери.СчетУчетаПотерь КАК СчетУчетаПотерь
//	|	,РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения.Коэффициент КАК ЕдиницаИзмеренияКоэффициент
//	|	,РасходнаяНакладнаяЗапасы.Усушкa_КоличествоСтарое КАК КоличествоСтарое
//	|	,РасходнаяНакладнаяЗапасы.Усушка_СписаниеНаПотери КАК СписаниеНаПотери
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыПерерасчетПред
//	|ИЗ
//	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы,
//	|	ВТ_ПарогиЛояльности КАК ВТ_ПарогиЛояльности
//	|ГДЕ
//	|	РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВЫРАЗИТЬ(СУММА(ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.СуммаНДС КАК ЧИСЛО(15, 6))) КАК ЧИСЛО(15, 6)) КАК СуммаНДС,
//	|	СУММА(1) КАК КоличествоСтрок,
//	|	ВЫРАЗИТЬ(СУММА(ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.Сумма КАК ЧИСЛО(15, 6))) КАК ЧИСЛО(15, 6)) КАК Сумма
//	|ПОМЕСТИТЬ вт_ЗапасыГрупп
//	|ИЗ
//	|	ВременнаяТаблицаЗапасыПерерасчетПред КАК ВременнаяТаблицаЗапасыПерерасчет
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка,
//	|	ВременнаяТаблицаЗапасыПерерасчет.НомерСтроки,
//	|	ВременнаяТаблицаЗапасыПерерасчет.Номенклатура,
//	|	ВременнаяТаблицаЗапасыПерерасчет.ЕдиницаИзмерения,
//	|	ВременнаяТаблицаЗапасыПерерасчет.Характеристика,
//	|	ВременнаяТаблицаЗапасыПерерасчет.СерийныеНомера,
//	|	ВременнаяТаблицаЗапасыПерерасчет.Цена,
//	|	ВременнаяТаблицаЗапасыПерерасчет.ПроцентСкидкиНаценки,
//	|	ВременнаяТаблицаЗапасыПерерасчет.СтавкаНДС,
//	|	ВременнаяТаблицаЗапасыПерерасчет.Заказ,
//	|	ВременнаяТаблицаЗапасыПерерасчет.Всего,
//	|	ВременнаяТаблицаЗапасыПерерасчет.ТипНоменклатурыЗапас,
//	//|	ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.Сумма / вт_ЗапасыГрупп.Сумма * вт_РасходыГрупп.СуммаБезНалогов КАК ЧИСЛО(15, 8)) КАК СуммаРасходов,
//	|	ВременнаяТаблицаЗапасыПерерасчет.Содержание,
//	|	ВременнаяТаблицаЗапасыПерерасчет.КлючСвязи,
//	|	ВременнаяТаблицаЗапасыПерерасчет.Резерв,
//	|	ВременнаяТаблицаЗапасыПерерасчет.СправкаБ,
//	|	ВременнаяТаблицаЗапасыПерерасчет.Партия,
//	|	ВременнаяТаблицаЗапасыПерерасчет.Количество,
//	|	ВременнаяТаблицаЗапасыПерерасчет.СтранаПроисхождения,
//	|	ВременнаяТаблицаЗапасыПерерасчет.НомерГТД,
//	|	ВременнаяТаблицаЗапасыПерерасчет.ТоварыДляПроизводства,
//	|	ВременнаяТаблицаЗапасыПерерасчет.Вес,
//	|	ВременнаяТаблицаЗапасыПерерасчет.Объем,
//	|	ВременнаяТаблицаЗапасыПерерасчет.ЭтоПодарок,
//	|	ВременнаяТаблицаЗапасыПерерасчет.Сотрудник КАК Сотрудник,
//	|	ВременнаяТаблицаЗапасыПерерасчет.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	ВременнаяТаблицаЗапасыПерерасчет.СуммаНДФЛ КАК СуммаНДФЛ,
//	|	ВременнаяТаблицаЗапасыПерерасчет.УдержаниеПенсии КАК УдержаниеПенсии,
//	|	ВременнаяТаблицаЗапасыПерерасчет.УдерживатьПенсию КАК УдерживатьПенсию,
//	|	ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.СуммаНДС КАК ЧИСЛО(15, 6)) КАК СуммаНДС,
//	|	ВременнаяТаблицаЗапасыПерерасчет.СуммаНДСБезвозмездно КАК СуммаНДСБезвозмездно,
//	|	ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.Сумма КАК ЧИСЛО(15, 6)) КАК Сумма,
//	|	ВременнаяТаблицаЗапасыПерерасчет.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
//	|	ВременнаяТаблицаЗапасыПерерасчет.ВидНалогаНДФЛ КАК ВидНалогаНДФЛ,
//	|	ВременнаяТаблицаЗапасыПерерасчет.СчетДоходовБП КАК СчетДоходовБП,
//	|	ВременнаяТаблицаЗапасыПерерасчет.ВидУдержанияПФ КАК ВидУдержанияПФ,
//	|	ВременнаяТаблицаЗапасыПерерасчет.НаправлениеДеятельности,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 {
//	|	ВЫБОР 
//	|		КОГДА &УчетПоПроектам 
//	|			ТОГДА ВременнаяТаблицаЗапасыПерерасчет.Проект
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
//	|	КОНЕЦ КАК Проект,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 }
//	|	ВременнаяТаблицаЗапасыПерерасчет.ПровестиНалогПрибили КАК ПровестиНалогПрибили
//	// Kuzmich, 21.05.2019, Счет выручки в табличной части
//	|	,ВременнаяТаблицаЗапасыПерерасчет.СчетУчетаВыручкиОтПродажРегл,
//	// Kuzmich, 21.05.2019, Счет выручки в табличной части
//	//Lazare_
//	|	ВременнаяТаблицаЗапасыПерерасчет.СтруктурнаяЕдиницаЗапасы  КАК СтруктурнаяЕдиницаЗапасы
//	//_Lazare
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|	,ВременнаяТаблицаЗапасыПерерасчет.КоличествоСобрПотери КАК КоличествоСобрПотери
//	|	,ВременнаяТаблицаЗапасыПерерасчет.СчетУчетаПотерь КАК СчетУчетаПотерь
//	|	,ВременнаяТаблицаЗапасыПерерасчет.ЕдиницаИзмеренияКоэффициент КАК ЕдиницаИзмеренияКоэффициент
//	|	,ВременнаяТаблицаЗапасыПерерасчет.КоличествоСтарое КАК КоличествоСтарое
//	|	,ВременнаяТаблицаЗапасыПерерасчет.СписаниеНаПотери КАК СписаниеНаПотери
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыПерерасчет
//	|ИЗ
//	|	ВременнаяТаблицаЗапасыПерерасчетПред КАК ВременнаяТаблицаЗапасыПерерасчет,
//	//|	вт_РасходыГрупп КАК вт_РасходыГрупп,
//	|	вт_ЗапасыГрупп КАК вт_ЗапасыГрупп
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	//+++ Дмгг, Переписан алгоритм получения среднего курса документа
//	//|ВЫБРАТЬ
//	//|	РасходнаяНакладная.Ссылка КАК Ссылка,
//	//|	ВЫБОР
//	//|		КОГДА РасходнаяНакладнаяПредоплата.Ссылка.СуммаДокумента = СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.СуммаРасчетов, 0))
//	//|			ТОГДА СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.Курс, 0)) / МАКСИМУМ(РасходнаяНакладнаяПредоплата.НомерСтроки)
//	//|		ИНАЧЕ (СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.Курс, 0)) + РасходнаяНакладнаяПредоплата.Ссылка.Курс) / (МАКСИМУМ(РасходнаяНакладнаяПредоплата.НомерСтроки) + 1)
//	//|	КОНЕЦ КАК Курс,
//	//|	ВЫБОР
//	//|		КОГДА РасходнаяНакладнаяПредоплата.Ссылка.СуммаДокумента = СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.СуммаРасчетов, 0))
//	//|			ТОГДА СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.Кратность, 0)) / МАКСИМУМ(РасходнаяНакладнаяПредоплата.НомерСтроки)
//	//|		ИНАЧЕ (СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.Кратность, 0)) + РасходнаяНакладнаяПредоплата.Ссылка.Кратность) / (МАКСИМУМ(РасходнаяНакладнаяПредоплата.НомерСтроки) + 1)
//	//|	КОНЕЦ КАК Кратность,
//	//|	СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.СуммаРасчетов, 0)) КАК СуммаРасчетов,
//	//|	МАКСИМУМ(РасходнаяНакладнаяПредоплата.НомерСтроки) КАК КолвоСтрок,
//	//|	СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.СуммаРасчетов * РасходнаяНакладнаяПредоплата.Курс / РасходнаяНакладнаяПредоплата.Кратность, 0)) КАК СуммаРасчетовНац
//	//|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПредоплаты
//	//|ИЗ
//	//|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
//	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Предоплата КАК РасходнаяНакладнаяПредоплата
//	//|		ПО РасходнаяНакладная.Ссылка = РасходнаяНакладнаяПредоплата.Ссылка
//	//|ГДЕ
//	//|	РасходнаяНакладная.Ссылка = &Ссылка
//	//|
//	//|СГРУППИРОВАТЬ ПО
//	//|	РасходнаяНакладная.Ссылка,
//	//|	РасходнаяНакладнаяПредоплата.Ссылка.СуммаДокумента,
//	//|	РасходнаяНакладнаяПредоплата.Ссылка.Курс,
//	//|	РасходнаяНакладнаяПредоплата.Ссылка.Кратность
//	//|;
//	//|
//	//|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ
//	//|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка,
//	////+++ Дмгг Все условия перенесены в предыдущей таблице
//	////|	ВЫБОР
//	////|		КОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов = ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента
//	//////|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетовНац / ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента
//	////|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.Курс
//	////|		КОГДА ЕСТЬNULL(ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов, 0) = 0
//	////|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Курс
//	////|		ИНАЧЕ ((ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента - ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов) * ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Курс / ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Кратность + ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетовНац) / ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента * ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Кратность
//	////|	КОНЕЦ КАК Курс,
//	//|	ЕСТЬNULL(ВременнаяТаблицаСреднегоКурсаПредоплаты.Курс, ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Курс) КАК Курс,
//	////|	ВЫБОР
//	////|		КОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов = ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента
//	//////|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность / ВременнаяТаблицаСреднегоКурсаПредоплаты.КолвоСтрок
//	////|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность
//	////|		КОГДА ЕСТЬNULL(ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов, 0) = 0
//	////|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Кратность
//	////|		ИНАЧЕ (ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность + ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Кратность) / 2 //(ВременнаяТаблицаСреднегоКурсаПредоплаты.КолвоСтрок + 1)
//	////|	КОНЕЦ КАК Кратность
//	//|	ЕСТЬNULL(ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность, ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Кратность) КАК Кратность
//	//|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПоДокументу
//	//|ИЗ
//	//|	ВременнаяТаблицаСреднегоКурсаПредоплаты КАК ВременнаяТаблицаСреднегоКурсаПредоплаты
//	//|;
//	//|
//	//|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РасходнаяНакладнаяПредоплата.Ссылка,
//	|	СУММА(РасходнаяНакладнаяПредоплата.СуммаРасчетов) КАК СуммаРасчетов,
//	// +++ { AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:
//	//|	СУММА(РасходнаяНакладнаяПредоплата.СуммаРасчетов * РасходнаяНакладнаяПредоплата.Курс / РасходнаяНакладнаяПредоплата.Кратность) КАК СуммаРасчетовРеглПоКурсуПредоплаты
//	|	СУММА(ВЫБОР
//	|			КОГДА РасходнаяНакладнаяПредоплата.Ссылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено
//	|				ТОГДА РасходнаяНакладнаяПредоплата.СуммаРасчетов * РасходнаяНакладнаяПредоплата.Ссылка.Курс / РасходнаяНакладнаяПредоплата.Ссылка.Кратность
//	|			ИНАЧЕ РасходнаяНакладнаяПредоплата.СуммаРасчетов * РасходнаяНакладнаяПредоплата.Курс / РасходнаяНакладнаяПредоплата.Кратность
//	|		КОНЕЦ) КАК СуммаРасчетовРеглПоКурсуПредоплаты
//	// +++ } AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:	
//	|ПОМЕСТИТЬ ВременнаяТаблицаСуммаПредоплатыГрупп
//	|ИЗ
//	|	Документ.РасходнаяНакладная.Предоплата КАК РасходнаяНакладнаяПредоплата
//	|ГДЕ
//	|	РасходнаяНакладнаяПредоплата.Ссылка = &Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РасходнаяНакладнаяПредоплата.Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РасходнаяНакладная.Ссылка КАК Ссылка,
//	|	РасходнаяНакладная.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) КАК СуммаНеОплаченаВал,
//	|	(РасходнаяНакладная.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * РасходнаяНакладная.Курс / РасходнаяНакладная.Кратность КАК СуммаНеОплаченаРегл,
//	|	ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) КАК СуммаРасчетовВал,
//	|	ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты КАК СуммаРасчетовРегл,
//	|	(РасходнаяНакладная.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * РасходнаяНакладная.Курс / РасходнаяНакладная.Кратность + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты, 0) КАК СуммаДокументаРеглПоВсемКурсам,
//	|	ВЫБОР
//	|		КОГДА РасходнаяНакладная.СуммаДокумента = 0
//	|			ТОГДА 1
//	|		ИНАЧЕ ((РасходнаяНакладная.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * РасходнаяНакладная.Курс / РасходнаяНакладная.Кратность + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты, 0)) / РасходнаяНакладная.СуммаДокумента
//	|	КОНЕЦ КАК СреднийКурсДокумента,
//	|	1 КАК Кратность
//	|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПредоплаты
//	|ИЗ
//	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСуммаПредоплатыГрупп КАК ВременнаяТаблицаСуммаПредоплатыГрупп
//	|		ПО РасходнаяНакладная.Ссылка = ВременнаяТаблицаСуммаПредоплатыГрупп.Ссылка
//	|ГДЕ
//	|	РасходнаяНакладная.Ссылка = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка,
//	|	ВременнаяТаблицаСреднегоКурсаПредоплаты.СреднийКурсДокумента КАК Курс,
//	|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность
//	|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПоДокументу
//	|ИЗ
//	|	ВременнаяТаблицаСреднегоКурсаПредоплаты КАК ВременнаяТаблицаСреднегоКурсаПредоплаты
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	//--- Дмгг
//	|ВЫБРАТЬ
//	|	РасходнаяНакладная.Договор.ЭтоДоговорОбслуживания КАК ЭтоДоговорОбслуживания,
//	|	ВЫБОР
//	|		КОГДА РасходнаяНакладная.Договор.ЭтоДоговорОбслуживания
//	|				И РасходнаяНакладная.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ВестиУчетРасходовПоДоговорамОбслуживания,
//	|	РасходнаяНакладная.Договор.ДоговорОбслуживанияНаправлениеДеятельности КАК НаправлениеДеятельности,
//	|	РасходнаяНакладная.СуммаВключаетНДС,
//	|	РасходнаяНакладная.ВидНалогаНДС,
//	|	РасходнаяНакладная.Договор.ВалютаРасчетов КАК ДоговорВалютаРасчетов,
//	|	РасходнаяНакладная.Договор.РасчетыВУсловныхЕдиницах КАК ДоговорРасчетыВУсловныхЕдиницах,
//	|	РасходнаяНакладная.Контрагент,
//	|	РасходнаяНакладная.ВалютаДокумента,
//	|	РасходнаяНакладная.Кратность,
//	|	РасходнаяНакладная.Курс,
//	|	РасходнаяНакладная.Договор,
//	|	РасходнаяНакладная.СчетЗатратБезвозмезднойПродажи,
//	|	РасходнаяНакладная.СчетЗатратНДСБезвозмезднойПродажи,
//	|	РасходнаяНакладная.СчетУчетаНалогаНаПрибыль,
//	|	РасходнаяНакладная.СчетУчетаНалогаНаПрибыльПодлежащийОплате,
//	|	РасходнаяНакладная.СчетЗатратБезвозмезднойПродажиСотрудник,
//	|	РасходнаяНакладная.СчетЗатратНДСБезвозмезднойПродажиСотрудник,
//	|	РасходнаяНакладная.СчетЗатратНДФЛСотрудник,
//	|	РасходнаяНакладная.СчетЗатратПФСотрудник,
//	|	РасходнаяНакладная.СчетУчетаСвободнаяпродажаСотрудник,
//	|	РасходнаяНакладная.СчетУчетаСвободнаяпродажа,
//	|	NULL КАК ВидНачисленияУдержания,
//	|	РасходнаяНакладная.Дата,
//	|	РасходнаяНакладная.ВидИспользоыванияБалов КАК ВидИспользоыванияБалов, //+++ Дмгг
//	//Lazare_
//	|	РасходнаяНакладная.ПоложениеСклада КАК ПоложениеСклада
//	//_Lazare
//	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
//	|ИЗ
//	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
//	|ГДЕ
//	|	РасходнаяНакладная.Ссылка = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
//	|	КурсыВалютСрезПоследних.Курс КАК Курс,
//	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
//	|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
//	|ИЗ
//	|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаНациональная, &ВалютаНакладной)) КАК КурсыВалютСрезПоследних
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	МАКСИМУМ(РасходнаяНакладнаяЗапасы.НомерСтроки) КАК НомерСтроки
//	|ПОМЕСТИТЬ МаксНомерСтрокиЗапасы
//	|ИЗ
//	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
//	|ГДЕ
//	|	РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РасходнаяНакладнаяЗапасы.Ссылка,
//	|	РасходнаяНакладнаяЗапасы.НомерСтроки,
//	|	РасходнаяНакладнаяЗапасы.Номенклатура,
//	|	РасходнаяНакладнаяЗапасы.Партия,
//	|	РасходнаяНакладнаяЗапасы.СтранаПроисхождения,
//	|	РасходнаяНакладнаяЗапасы.НомерГТД,
//	|	РасходнаяНакладнаяЗапасы.Характеристика,
//	|	РасходнаяНакладнаяЗапасы.Заказ,
//	|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения,
//	|	РасходнаяНакладнаяЗапасы.Количество,
//	|	РасходнаяНакладнаяЗапасы.Резерв,
//	|	РасходнаяНакладнаяЗапасы.СтавкаНДС,
//	|	РасходнаяНакладнаяЗапасы.СуммаНДС,
//	|	РасходнаяНакладнаяЗапасы.Всего,
//	|	РасходнаяНакладнаяЗапасы.Сумма,
//	|	РасходнаяНакладнаяЗапасы.КлючСвязи,
//	|	РасходнаяНакладнаяЗапасы.ЭтоПодарок,
//	|	РасходнаяНакладнаяЗапасы.Сотрудник КАК Сотрудник,
//	|	РасходнаяНакладнаяЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	РасходнаяНакладнаяЗапасы.СуммаНДФЛ КАК СуммаНДФЛ,
//	|	РасходнаяНакладнаяЗапасы.УдержаниеПенсии КАК УдержаниеПенсии,
//	|	РасходнаяНакладнаяЗапасы.УдержаниеПенсии КАК СуммаПФ,
//	|	РасходнаяНакладнаяЗапасы.УдерживатьПенсию КАК УдерживатьПенсию,
//	|	РасходнаяНакладнаяЗапасы.СуммаНДСБезвозмездно КАК СуммаНДСБезвозмездно,
//	|	РасходнаяНакладнаяЗапасы.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
//	|	РасходнаяНакладнаяЗапасы.ВидНачисленияУдержания КАК ВидУдержанияНДФЛ,
//	|	РасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ КАК ВидНалогаНДФЛ,
//	|	РасходнаяНакладнаяЗапасы.СчетДоходовБП КАК СчетДоходовБП,
//	|	РасходнаяНакладнаяЗапасы.ВидУдержанияПФ КАК ВидУдержанияПФ,
//	|	РасходнаяНакладнаяЗапасы.ПровестиНалогПрибили КАК ПровестиНалогПрибили,
//	|	РасходнаяНакладнаяЗапасы.НаправлениеДеятельности,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 {
//	|	ВЫБОР 
//	|		КОГДА &УчетПоПроектам 
//	|			ТОГДА РасходнаяНакладнаяЗапасы.Проект
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
//	|	КОНЕЦ КАК Проект,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 }
//	//|	РасходнаяНакладнаяЗапасы.СуммаРегл КАК СуммаРегл,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|			ТОГДА РасходнаяНакладнаяЗапасы.Всего
//	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Всего  * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность) 
//	|	КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаРегл,
//	//|	РасходнаяНакладнаяЗапасы.СуммаНДСРегл КАК СуммаНДСРегл
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|			ТОГДА РасходнаяНакладнаяЗапасы.СуммаНДС
//	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность) 
//	|	КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаНДСРегл
//	// Kuzmich, 21.05.2019, Счет выручки в табличной части
//	|	,РасходнаяНакладнаяЗапасы.СчетУчетаВыручкиОтПродажРегл,
//	// Kuzmich, 21.05.2019, Счет выручки в табличной части
//	//Lazare_
//	|	РасходнаяНакладнаяЗапасы.СтруктурнаяЕдиницаЗапасы как СтруктурнаяЕдиницаЗапасы ,
//	|  ВЫРАЗИТЬ (РасходнаяНакладнаяЗапасы.Количество * РасходнаяНакладнаяЗапасы.Цена   КАК ЧИСЛО(15, 2))    КАК СуммаБезСкидки
//	//_Lazare
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|	,РасходнаяНакладнаяЗапасы.КоличествоСобрПотери КАК КоличествоСобрПотери
//	|	,РасходнаяНакладнаяЗапасы.СчетУчетаПотерь КАК СчетУчетаПотерь
//	|	,РасходнаяНакладнаяЗапасы.КоличествоСтарое КАК КоличествоСтарое
//	|	,РасходнаяНакладнаяЗапасы.СписаниеНаПотери КАК СписаниеНаПотери
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|ПОМЕСТИТЬ ВТРасходнаяНакладнаяЗапасы
//	|ИЗ
//	//|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
//	|	ВременнаяТаблицаЗапасыПерерасчет КАК РасходнаяНакладнаяЗапасы
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
//	|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУчета)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
//	|		ПО (КурсыРегВалюты.Валюта = &ВалютаНациональная)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокумента
//	|		ПО (СреднийКурсДокумента.Ссылка.ВалютаДокумента = РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента)
//	|ГДЕ
//	|	РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	РасходнаяНакладная.Ссылка,
//	|	ЕСТЬNULL(МаксНомерСтрокиЗапасы.НомерСтроки, 0) + 1,
//	|	РасходнаяНакладная.НоменклатураДоставки,
//	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
//	|	РасходнаяНакладная.Заказ,
//	|	РасходнаяНакладная.НоменклатураДоставки.ЕдиницаИзмерения,
//	|	1,
//	|	0,
//	|	РасходнаяНакладная.СтавкаНДСДоставки,
//	|	РасходнаяНакладная.СуммаНДСДоставки,
//	|	РасходнаяНакладная.СтоимостьДоставки,
//	|	РасходнаяНакладная.СтоимостьДоставки - РасходнаяНакладная.СуммаНДСДоставки,
//	|	0,
//	|	ЛОЖЬ,
//	|	Значение(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
//	|	Значение(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК СтруктурнаяЕдиница,
//	|	0 КАК СуммаНДФЛ,
//	|	0 КАК УдержаниеПенсии,
//	|	0 КАК СуммаПФ,
//	|	ЛОЖЬ КАК УдерживатьПенсию,
//	|	0 КАК СуммаНДСБезвозмездно,
//	|	NULL КАК ВидНачисленияУдержания,
//	|	NULL,
//	|	NULL КАК ВидНалогаНДФЛ,
//	|	NULL КАК СчетДоходовБП,
//	|	NULL КАК ВидУдержанияПФ,
//	|	NULL КАК ПровестиНалогПрибили,
//	|	NULL,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 {
//	|	NULL КАК Проект,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 }
//	//Lazare, 10.06.2021
//	//|	0,
//	//|	0	
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА РасходнаяНакладная.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|				ТОГДА РасходнаяНакладная.СтоимостьДоставки - РасходнаяНакладная.СуммаНДСДоставки
//	|			ИНАЧЕ РасходнаяНакладная.СтоимостьДоставки * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
//	|		КОНЕЦ КАК ЧИСЛО(15, 6)),
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА РасходнаяНакладная.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|				ТОГДА РасходнаяНакладная.СуммаНДСДоставки
//	|			ИНАЧЕ РасходнаяНакладная.СуммаНДСДоставки * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
//	|		КОНЕЦ КАК ЧИСЛО(15, 6)),
//	//Lazare, 10.06.2021
//	// Kuzmich, 21.05.2019, Счет выручки в табличной части
//	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка),
//	// Kuzmich, 21.05.2019, Счет выручки в табличной части
//	//_Lazare
//	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК СтруктурнаяЕдиницаЗапасы,
//	|	NULL
//	//Lazare_
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|	,0
//	|	,NULL
//	|	,0 КАК КоличествоСтарое
//	|	,NULL КАК СписаниеНаПотери
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|ИЗ
//	|	МаксНомерСтрокиЗапасы КАК МаксНомерСтрокиЗапасы,
//	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
//	//Lazare, 10.06.2021
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
//	|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУчета)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
//	|		ПО (КурсыРегВалюты.Валюта = &ВалютаНациональная)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокумента
//	|		ПО (СреднийКурсДокумента.Ссылка.ВалютаДокумента = РасходнаяНакладная.Ссылка.ВалютаДокумента)
//	//Lazare, 10.06.2021
//	|ГДЕ
//	|	РасходнаяНакладная.Ссылка = &Ссылка
//	|	И РасходнаяНакладная.НоменклатураДоставки <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТРасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации КАК ВидОперации,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка КАК Документ,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Ответственный КАК Ответственный,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.ДокументОснование КАК ДокументОснование,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент КАК Контрагент,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Дата КАК Период,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидНачисленияУдержания КАК ВидНачисленияУдержанияШапка, //+++ Дмгг
//	|	&Организация КАК Организация,
//	|	ВЫБОР
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
//	|			ТОГДА &Организация
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК КоррОрганизация,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Подразделение КАК ПодразделениеПродажи,
//	|	ВЫБОР
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
//	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.НаправлениеДеятельности
//	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
//	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности
//	|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности
//	|	КОНЕЦ КАК НаправлениеДеятельностиПродажи,
//	|	ВЫБОР
//	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
//	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
//	|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
//	|	КОНЕЦ КАК СчетУчетаПродажи,
//	//|	ВЫБОР
//	//|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
//	//|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
//	//|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
//	//|	КОНЕЦ КАК СчетУчетаПродажиРегл,
//	// Kuzmich, 21.05.2019, Счет выручки в табличной части
//	|	ВЫБОР 
//	|		КОГДА КонстантаСчетВыручкиВТабличнойЧасти.Значение ТОГДА
//	|			ВЫБОР
//	|				КОГДА ВТРасходнаяНакладнаяЗапасы.СчетУчетаВыручкиОтПродажРегл = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА // выбираем по-старому
//	|					ВЫБОР
//	|						КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
//	|							ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
//	|						ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
//	|					КОНЕЦ
//	|				ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СчетУчетаВыручкиОтПродажРегл
//	|			КОНЕЦ 
//	|	ИНАЧЕ  // выбираем по-старому
//	|		ВЫБОР
//	|			КОГДА ВТРасходнаяНакладнаяЗапасы.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
//	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
//	|			КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
//	|				ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
//	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
//	|		КОНЕЦ
//	|	КОНЕЦ КАК СчетУчетаПродажиРегл,
//	// Kuzmich, 21.05.2019, Счет выручки в табличной части
//	|	ВЫБОР
//	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
//	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
//	|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
//	|	КОНЕЦ КАК СчетУчетаСебестоимость,
//	|	ВЫБОР
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.НаправлениеДеятельности <> Значение(Справочник.НаправленияДеятельности.ПустаяСсылка)
//	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
//	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
//	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
//	|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
//	|	КОНЕЦ КАК СчетУчетаСебестоимостьРегл,
//	|	ВТРасходнаяНакладнаяЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	ВЫБОР
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
//	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК КоррСтруктурнаяЕдиница,
//	|	ВЫБОР
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ОрдерныйСклад,
//	|	ВЫБОР
//	|		КОГДА &УчетПоЯчейкам
//	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.Ячейка
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК Ячейка,
//	|	ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
//	|	ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
//	|	ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасов КАК СчетУчета,
//	|	ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаПереработчикуРегл КАК СчетУчетаПереработчикуРегл,
//	|	ВЫБОР
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
//	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасов
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК КоррСчетУчета,
//	|	ВЫБОР
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
//	|				И ФункциональнаяОпцияПередачаСырьяВПереработку.Значение
//	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаПереработчикуРегл
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
//	|				И НЕ ФункциональнаяОпцияПередачаСырьяВПереработку.Значение
//	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
//	//|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
//	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК КоррСчетУчетаРегл,
//	|	ВЫБОР
//	|		КОГДА &ИспользоватьПартии
//	|				И ВТРасходнаяНакладнаяЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
//	|				И ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ТоварыНаКомиссии,
//	|	ВТРасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
//	|	ВТРасходнаяНакладнаяЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
//	|	ВТРасходнаяНакладнаяЗапасы.НомерГТД КАК НомерГТД,
//	|	ВЫБОР
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
//	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Номенклатура
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК КоррНоменклатура,
//	|	ВЫБОР
//	|		КОГДА &ИспользоватьХарактеристики
//	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Характеристика
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
//	|	КОНЕЦ КАК Характеристика,
//	|	ВЫБОР
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
//	|			ТОГДА ВЫБОР
//	|					КОГДА &ИспользоватьХарактеристики
//	|						ТОГДА ВТРасходнаяНакладнаяЗапасы.Характеристика
//	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
//	|				КОНЕЦ
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК КоррХарактеристика,
//	|	ВЫБОР
//	|		КОГДА &ИспользоватьПартии
//	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Партия
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
//	|	КОНЕЦ КАК Партия,
//	|	ВЫБОР
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
//	|			ТОГДА ВЫБОР
//	|					КОГДА &ИспользоватьПартии
//	|						ТОГДА ВТРасходнаяНакладнаяЗапасы.Партия
//	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
//	|				КОНЕЦ
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК КоррПартия,
//	|	ВЫБОР
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
//	|				И ВТРасходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Заказ
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
//	|				И ВТРасходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Заказ
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК Заказ,
//	|	ВЫБОР
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
//	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
//	|			ТОГДА ВЫБОР
//	|					КОГДА ВТРасходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
//	|							И ВТРасходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|						ТОГДА ВТРасходнаяНакладнаяЗапасы.Заказ
//	|					КОГДА ВТРасходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
//	|							И ВТРасходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|						ТОГДА ВТРасходнаяНакладнаяЗапасы.Заказ
//	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|				КОНЕЦ
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК КоррЗаказ,
//	|	ВЫБОР
//	|		КОГДА ТИПЗНАЧЕНИЯ(ВТРасходнаяНакладнаяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
//	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Количество
//	|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Количество * ВТРасходнаяНакладнаяЗапасы.ЕдиницаИзмерения.Коэффициент
//	|	КОНЕЦ КАК Количество,
//	|	ВЫБОР
//	|		КОГДА ТИПЗНАЧЕНИЯ(ВТРасходнаяНакладнаяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
//	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Резерв
//	|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Резерв * ВТРасходнаяНакладнаяЗапасы.ЕдиницаИзмерения.Коэффициент
//	|	КОНЕЦ КАК Резерв,
//	|	ВТРасходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
//	//|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаНДС * ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность)
//	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаНДСРегл
//	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаНДС,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.СуммаПФ * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
//	//|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаНДС * ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность)
//	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаПФ
//	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаПФ,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.СуммаПФ * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
//	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаПФ
//	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаПФВал,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
//	//|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаНДС * ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность)
//	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
//	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаНДСЗакупкиПродажи,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
//	//|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Всего * ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность)
//	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаРегл
//	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК Сумма,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
//	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаНДС
//	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаНДСВал,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.Всего * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
//	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Всего
//	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаВал,
//	|	ВТРасходнаяНакладнаяЗапасы.Всего КАК СуммаРасчетовПринятыеПереданные,
//	|	ВТРасходнаяНакладнаяЗапасы.Всего КАК ВсегоВалютаДокумента,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
//	|	ВТРасходнаяНакладнаяЗапасы.КлючСвязи,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|				ТОГДА (ВТРасходнаяНакладнаяЗапасы.Всего - ВТРасходнаяНакладнаяЗапасы.СуммаНДС) * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
//	//|			ИНАЧЕ (ВТРасходнаяНакладнаяЗапасы.Всего - ВТРасходнаяНакладнаяЗапасы.СуммаНДС) * ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность)
//	//|			ИНАЧЕ (ВТРасходнаяНакладнаяЗапасы.СуммаРегл - ВТРасходнаяНакладнаяЗапасы.СуммаНДСРегл)
//	|			ИНАЧЕ (ВТРасходнаяНакладнаяЗапасы.Всего - ВТРасходнаяНакладнаяЗапасы.СуммаНДС) * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
//	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаБезНДС,
//	|	ВЫБОР
//	|		КОГДА ВременнаяТаблицаШапка.СуммаВключаетНДС
//	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
//	|						КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|							ТОГДА (ВТРасходнаяНакладнаяЗапасы.Всего - ВТРасходнаяНакладнаяЗапасы.СуммаНДС) * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
//	|						ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Всего - ВТРасходнаяНакладнаяЗапасы.СуммаНДС
//	|					КОНЕЦ КАК ЧИСЛО(15, 6))
//	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
//	|					КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|						ТОГДА ВТРасходнаяНакладнаяЗапасы.Сумма * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
//	|					ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Сумма
//	|				КОНЕЦ КАК ЧИСЛО(15, 6))
//	|	КОНЕЦ КАК СуммаБезНДСВал,
//	|	ВременнаяТаблицаШапка.ВидНалогаНДС,
//	|	ВременнаяТаблицаШапка.СчетЗатратБезвозмезднойПродажи КАК СчетЗатратБезвозмезднойПродажи,
//	|	ВременнаяТаблицаШапка.СчетЗатратНДСБезвозмезднойПродажи КАК СчетЗатратНДСБезвозмезднойПродажи,
//	|	ВременнаяТаблицаШапка.СчетУчетаНалогаНаПрибыль КАК СчетУчетаНалогаНаПрибыль,
//	|	ВременнаяТаблицаШапка.СчетУчетаНалогаНаПрибыльПодлежащийОплате КАК СчетУчетаНалогаНаПрибыльПодлежащийОплате,
//	|	ВременнаяТаблицаШапка.СчетУчетаСвободнаяпродажа КАК СчетУчетаСвободнаяпродажа,
//	|   ВременнаяТаблицаШапка.СчетУчетаСвободнаяпродажаСотрудник КАК СчетУчетаСвободнаяпродажаСотрудник,
//	|	ВТРасходнаяНакладнаяЗапасы.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
//	|	ВТРасходнаяНакладнаяЗапасы.СчетДоходовБП КАК СчетДоходовБП,
//	|	ВТРасходнаяНакладнаяЗапасы.ЭтоПодарок,
//	|	ВТРасходнаяНакладнаяЗапасы.Сотрудник КАК Сотрудник,
//	|	ВТРасходнаяНакладнаяЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаБезвозмезднойПродажи,
//	|	ВТРасходнаяНакладнаяЗапасы.СуммаНДФЛ КАК СуммаНДФЛ,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.СуммаНДФЛ * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
//	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Всего
//	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаНДФЛВал,
//	|	ВТРасходнаяНакладнаяЗапасы.УдержаниеПенсии КАК УдержаниеПенсии,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
//	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.УдержаниеПенсии * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
//	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.УдержаниеПенсии
//	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК УдержаниеПенсииВал,
//	|	ВТРасходнаяНакладнаяЗапасы.УдерживатьПенсию КАК УдерживатьПенсию,
//	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента КАК ВалютаБезвозмезднойПродажи,
//	|	ВТРасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ.ВидНалога КАК ВидНалогаНДФЛ,
//	|	ВТРасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ КАК ВидУдержанияНДФЛ,
//	|	ВТРасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ.СтавкаНДФЛ КАК СтавкаНДФЛ,
//	|	ВТРасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ.ВидНалога.СчетУчетаРегл КАК СчетУчетаРеглВидНалогаНДФЛ,
//	|	ВТРасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ.ВидНалога.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРеглВидНалогаНДФЛ,
//	|	ВТРасходнаяНакладнаяЗапасы.СуммаНДСБезвозмездно КАК СуммаНДСБезвозмездно,
//	|	ВременнаяТаблицаШапка.СчетЗатратБезвозмезднойПродажиСотрудник КАК СчетЗатратБезвозмезднойПродажиСотрудник,
//	|	ВременнаяТаблицаШапка.СчетЗатратНДСБезвозмезднойПродажиСотрудник КАК СчетЗатратНДСБезвозмезднойПродажиСотрудник,
//	|	ВременнаяТаблицаШапка.СчетЗатратНДФЛСотрудник КАК СчетЗатратНДФЛСотрудник,
//	|	ВременнаяТаблицаШапка.СчетЗатратПФСотрудник КАК СчетЗатратПФСотрудник,
//	|	ВТРасходнаяНакладнаяЗапасы.Сотрудник.СчетРасчетовСПерсоналомРегл КАК СчетРасчетовСПерсоналомРегл,
//	|	ВТРасходнаяНакладнаяЗапасы.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетУчетаРеглВидНалогаПФСотрудника,
//	|	ВТРасходнаяНакладнаяЗапасы.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРеглВидНалогаПФСотрудника,
//	|	ВТРасходнаяНакладнаяЗапасы.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетУчетаРеглВидНалогаПФОрганизации,
//	|	ВТРасходнаяНакладнаяЗапасы.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРеглВидНалогаПФОрганизации,
//	|	ВТРасходнаяНакладнаяЗапасы.ВидУдержанияПФ.СчетЗатратРегл КАК СчетЗатратРеглПФ,
//	|	ВТРасходнаяНакладнаяЗапасы.ВидУдержанияПФ КАК ВидУдержанияПФ,
//	|	ВТРасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДСВалютаДокумента,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 {
//	|	ВТРасходнаяНакладнаяЗапасы.Проект КАК Проект,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 }
//	|	ВТРасходнаяНакладнаяЗапасы.ПровестиНалогПрибили,
//	//Lazare_
//	|	ВТРасходнаяНакладнаяЗапасы.СтруктурнаяЕдиницаЗапасы КАК  СтруктурнаяЕдиницаЗапасы,
//	|	ВременнаяТаблицаШапка.ПоложениеСклада КАК ПоложениеСклада,
//	|   ВТРасходнаяНакладнаяЗапасы.СуммаБезСкидки как СуммаБезСкидки
//	//_Lazare
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|	,ВТРасходнаяНакладнаяЗапасы.КоличествоСобрПотери КАК КоличествоСобрПотери
//	|	,ВТРасходнаяНакладнаяЗапасы.СчетУчетаПотерь КАК СчетУчетаПотерь
//	|	,ВТРасходнаяНакладнаяЗапасы.КоличествоСтарое КАК КоличествоСтарое
//	|	,ВременнаяТаблицаШапка.ВидИспользоыванияБалов КАК ВидИспользоыванияБалов //+++ Дмгг
//	|	,ВТРасходнаяНакладнаяЗапасы.СписаниеНаПотери КАК СписаниеНаПотери
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
//	|ИЗ
//	|	ВТРасходнаяНакладнаяЗапасы КАК ВТРасходнаяНакладнаяЗапасы
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
//	|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУчета)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
//	|		ПО (КурсыРегВалюты.Валюта = &ВалютаНациональная),
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокумента
//	|		ПО (СреднийКурсДокумента.Ссылка.ВалютаДокумента = ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента),
//	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
//	// Kuzmich, 21.05.2019, Счет выручки в табличной части
//	|	,Константа.СчетВыручкиВТабличнойЧасти КАК КонстантаСчетВыручкиВТабличнойЧасти
//	// Kuzmich, 21.05.2019, Счет выручки в табличной части
//	//+++ Дмгг
//	|	,Константа.ФункциональнаяОпцияПередачаСырьяВПереработку КАК ФункциональнаяОпцияПередачаСырьяВПереработку
//	//--- Дмгг
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
//	|	ТаблицаДокумента.Ссылка.ВидОперации КАК ВидОперации,
//	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
//	|	&Организация КАК Организация,
//	|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
//	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
//	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
//	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл КАК СчетУчетаАвансовПокупателяРегл,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл КАК СчетУчетаАвансовПоставщикуРегл,
//	|	ТаблицаДокумента.Ссылка.Организация КАК ОрганизацияВНУ,
//	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС КАК НалогообложениеНДС,
//	|	ТаблицаДокумента.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	ТаблицаДокумента.Ссылка.Договор КАК Договор,
//	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
//	|	ТаблицаДокумента.Заказ КАК Заказ,
//	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельностиПродажи,
//	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс) КАК ТипРасчетов,
//	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетовКуда,
//	|	&Ссылка КАК ДокументКуда,
//	|	ТаблицаДокумента.Ссылка.ДокументОснование КАК ДокументОснование,
//	|	ТаблицаДокумента.Документ КАК Документ,
//	|	ВЫБОР
//	|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
//	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
//	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Статья
//	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
//	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Статья
//	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
//	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Статья
//	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
//	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Статья
//	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
//	|			КОНЕЦ
//	|	КОНЕЦ КАК Статья,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
//	|			ТОГДА ВЫБОР
//	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
//	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Дата
//	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
//	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Дата
//	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
//	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Дата
//	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
//	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Дата
//	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
//	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.Взаимозачет).Дата
//	|				КОНЕЦ
//	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
//	|	КОНЕЦ КАК ДокументДата,
//	//|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаАванса,
//	//|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютДокументаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютДокументаСрезПоследних.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
//	// +++ { AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:	
//	//|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 6))) КАК СуммаАванса,
//	|		СУММА(ВЫБОР
//	|			КОГДА ТаблицаДокумента.Ссылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено
//	|				ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Ссылка.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Ссылка.Кратность) КАК ЧИСЛО(15, 6))
//	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 6))
//	|		КОНЕЦ) КАК СуммаАванса,
//	// +++ } AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:	
//	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютДокументаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютДокументаСрезПоследних.Кратность) КАК ЧИСЛО(15, 6))) КАК Сумма,
//	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал,
//	|	ВЫБОР
//	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.ОперацияПоПлатежнымКартам)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ЭтоЭквайринговаяОперация,
//	|	ТаблицаДокумента.Документ.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
//	|	НАЧАЛОПЕРИОДА(ТаблицаДокумента.Документ.Дата, ДЕНЬ) КАК ДатаПлатежа,
//	// +++ { AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:	
//	//|	ТаблицаДокумента.Курс,
//	//|	ТаблицаДокумента.Кратность,	
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Ссылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено
//	|			ТОГДА ТаблицаДокумента.Ссылка.Курс
//	|		ИНАЧЕ ТаблицаДокумента.Курс
//	|	КОНЕЦ КАК Курс,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Ссылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено
//	|			ТОГДА ТаблицаДокумента.Ссылка.Кратность
//	|		ИНАЧЕ ТаблицаДокумента.Кратность
//	|	КОНЕЦ КАК Кратность,	
//	// +++ } AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:		
//	|	ТаблицаДокумента.Ссылка.Договор.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
//	// +++ { AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:
//	//|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс / ТаблицаДокумента.Кратность КАК ЧИСЛО(15, 6))) КАК СуммаРубПоКурсуАванса
//	|	СУММА(ВЫБОР
//	|			КОГДА ТаблицаДокумента.Ссылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено
//	|				ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Ссылка.Курс / ТаблицаДокумента.Ссылка.Кратность КАК ЧИСЛО(15, 6))
//	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс / ТаблицаДокумента.Кратность КАК ЧИСЛО(15, 6))
//	|		КОНЕЦ) КАК СуммаРубПоКурсуАванса
//	// +++ } AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:	
//	|ПОМЕСТИТЬ ВременнаяТаблицаПредоплата
//	|ИЗ
//	|	Документ.РасходнаяНакладная.Предоплата КАК ТаблицаДокумента
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
//	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютДокументаСрезПоследних
//	|		ПО (КурсыВалютДокументаСрезПоследних.Валюта = &ВалютаНакладной)
//	|ГДЕ
//	|	ТаблицаДокумента.Ссылка = &Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаДокумента.Ссылка,
//	|	ТаблицаДокумента.Документ,
//	|	ТаблицаДокумента.Ссылка.Дата,
//	|	ТаблицаДокумента.Ссылка.Контрагент,
//	|	ТаблицаДокумента.Ссылка.Договор,
//	|	ТаблицаДокумента.Заказ,
//	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
//	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
//	|	ТаблицаДокумента.Ссылка.ВидОперации,
//	|	ВЫБОР
//	|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
//	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
//	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Статья
//	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
//	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Статья
//	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
//	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Статья
//	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
//	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Статья
//	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
//	|			КОНЕЦ
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
//	|			ТОГДА ВЫБОР
//	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
//	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Дата
//	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
//	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Дата
//	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
//	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Дата
//	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
//	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Дата
//	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
//	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.Взаимозачет).Дата
//	|				КОНЕЦ
//	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
//	|	КОНЕЦ,
//	|	ТаблицаДокумента.Ссылка.ДокументОснование,
//	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
//	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
//	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
//	|	ТаблицаДокумента.Документ.ЭквайринговыйТерминал,
//	|	НАЧАЛОПЕРИОДА(ТаблицаДокумента.Документ.Дата, ДЕНЬ),
//	|	ВЫБОР
//	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.ОперацияПоПлатежнымКартам)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ,
//	// +++ { AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:	
//	//|	ТаблицаДокумента.Курс,
//	//|	ТаблицаДокумента.Кратность,	
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Ссылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено
//	|			ТОГДА ТаблицаДокумента.Ссылка.Курс
//	|		ИНАЧЕ ТаблицаДокумента.Курс
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Ссылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено
//	|			ТОГДА ТаблицаДокумента.Ссылка.Кратность
//	|		ИНАЧЕ ТаблицаДокумента.Кратность
//	|	КОНЕЦ,	
//	// +++ } AzRy - [09.09.2021] - Jira:ERPM-859 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:	
//	|	ТаблицаДокумента.Ссылка.Договор.РасчетыВУсловныхЕдиницах,
//	|	ТаблицаДокумента.Ссылка.Организация,
//	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС,
//	|	ТаблицаДокумента.Ссылка.СтруктурнаяЕдиница
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РасходнаяНакладнаяСкидкиНаценки.КлючСвязи,
//	|	РасходнаяНакладнаяСкидкиНаценки.СкидкаНаценка,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА РасходнаяНакладнаяСкидкиНаценки.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
//	|				ТОГДА РасходнаяНакладнаяСкидкиНаценки.Сумма * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
//	|			ИНАЧЕ РасходнаяНакладнаяСкидкиНаценки.Сумма * РасходнаяНакладнаяСкидкиНаценки.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * РасходнаяНакладнаяСкидкиНаценки.Ссылка.Кратность)
//	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
//	|	РасходнаяНакладнаяСкидкиНаценки.Ссылка.Дата КАК Период,
//	|	РасходнаяНакладнаяСкидкиНаценки.Ссылка.СтруктурнаяЕдиница
//	|ПОМЕСТИТЬ ВременнаяТаблицаАвтоСкидкиНаценки
//	|ИЗ
//	|	Документ.РасходнаяНакладная.СкидкиНаценки КАК РасходнаяНакладнаяСкидкиНаценки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
//	|				&МоментВремени,
//	|				Валюта В
//	|					(ВЫБРАТЬ
//	|						КонстантаВалютаУчета.Значение
//	|					ИЗ
//	|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты
//	|		ПО (ИСТИНА)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
//	|				&МоментВремени,
//	|				Валюта В
//	|					(ВЫБРАТЬ
//	|						КонстантаНациональнаяВалюта.Значение
//	|					ИЗ
//	|						Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты
//	|		ПО (ИСТИНА),
//	|	Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта
//	|ГДЕ
//	|	РасходнаяНакладнаяСкидкиНаценки.Ссылка = &Ссылка
//	|	И РасходнаяНакладнаяСкидкиНаценки.Сумма <> 0
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РасходнаяНакладнаяСерийныеНомера.КлючСвязи,
//	|	РасходнаяНакладнаяСерийныеНомера.СерийныйНомер
//	|ПОМЕСТИТЬ ВременнаяТаблицаСерийныеНомера
//	|ИЗ
//	|	Документ.РасходнаяНакладная.СерийныеНомера КАК РасходнаяНакладнаяСерийныеНомера
//	|ГДЕ
//	|	РасходнаяНакладнаяСерийныеНомера.Ссылка = &Ссылка
//	|	И &ИспользоватьСерийныеНомера
//	|	И НЕ РасходнаяНакладнаяСерийныеНомера.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
//	|	ВЫБОР
//	|		КОГДА &УчетПоПроектам
//	|			ТОГДА РасходнаяНакладнаяЗапасы.Проект
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
//	|	КОНЕЦ КАК Проект,
//	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация КАК Организация,
//	|	РасходнаяНакладнаяЗапасы.Ссылка.СчетУчетаСвободнаяпродажа КАК СчетУчетаСвободнаяпродажа,
//	|	РасходнаяНакладнаяЗапасы.Ссылка КАК Регистратор,
//	|	РасходнаяНакладнаяЗапасы.Ссылка.Дата КАК Период,
//	|	РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности КАК КартаЛояльности,
//	|	РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности.Владелец.СчетУчетаРегл КАК КартаЛояльностиСчетУчетаРегл,
//	|	РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности.Владелец.КоэфициентПересчета КАК КоэфициентПересчета,
//	|	РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
//	|	РасходнаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
//	|	РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
//	|	РасходнаяНакладнаяЗапасы.Ссылка.ВидНалогаНДС КАК ВидНалогаНДС,
//	|	РасходнаяНакладнаяЗапасы.Ссылка.Контрагент КАК Контрагент,
//	|	РасходнаяНакладнаяЗапасы.Сумма КАК Сумма,
//	|	ВЫРАЗИТЬ((РасходнаяНакладнаяЗапасы.Сумма - (РасходнаяНакладнаяЗапасы.Сумма - РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) * (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) - РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) / 1.18 КАК ЧИСЛО(15, 2)) КАК СуммаРегл,
//	|	РасходнаяНакладнаяЗапасы.Сумма - (РасходнаяНакладнаяЗапасы.Сумма - РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) * (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) - РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета - (ВЫРАЗИТЬ((РасходнаяНакладнаяЗапасы.Сумма - (РасходнаяНакладнаяЗапасы.Сумма - РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) * (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) - РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) / 1.18 КАК ЧИСЛО(15, 2))) КАК СуммаНДСРегл,
//	|	РасходнаяНакладнаяЗапасы.Ссылка.ВидИспользоыванияБалов КАК ВидИспользоыванияБалов,
//	|	(РасходнаяНакладнаяЗапасы.Сумма - РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) * (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) КАК КоличествоПриход,
//	|	(РасходнаяНакладнаяЗапасы.Сумма - РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) * (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) * ВТ_ПарогиЛояльности.КоэфициентПересчета КАК КоличествоПриходРегл,
//	|	-РасходнаяНакладнаяЗапасы.БалыРасход КАК КоличествоРасход,
//	|	ВТ_ПарогиЛояльности.СкидкаЛояльность КАК СкидкаЛояльность,
//	|	ВЫБОР
//	|		КОГДА КонстантаСчетВыручкиВТабличнойЧасти.Значение
//	|			ТОГДА ВЫБОР
//	|					КОГДА РасходнаяНакладнаяЗапасы.СчетУчетаВыручкиОтПродажРегл = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
//	|						ТОГДА ВЫБОР
//	|								КОГДА ВЫБОР
//	|										КОГДА РасходнаяНакладнаяЗапасы.Ссылка.Договор.ЭтоДоговорОбслуживания
//	|												И РасходнаяНакладнаяЗапасы.Ссылка.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
//	|											ТОГДА ИСТИНА
//	|										ИНАЧЕ ЛОЖЬ
//	|									КОНЕЦ
//	|									ТОГДА РасходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
//	|								ИНАЧЕ РасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
//	|							КОНЕЦ
//	|					ИНАЧЕ РасходнаяНакладнаяЗапасы.СчетУчетаВыручкиОтПродажРегл
//	|				КОНЕЦ
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА РасходнаяНакладнаяЗапасы.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
//	|					ТОГДА РасходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
//	|				КОГДА ВЫБОР
//	|						КОГДА РасходнаяНакладнаяЗапасы.Ссылка.Договор.ЭтоДоговорОбслуживания
//	|								И РасходнаяНакладнаяЗапасы.Ссылка.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
//	|							ТОГДА ИСТИНА
//	|						ИНАЧЕ ЛОЖЬ
//	|					КОНЕЦ
//	|					ТОГДА РасходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
//	|				ИНАЧЕ РасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
//	|			КОНЕЦ
//	|	КОНЕЦ КАК СчетУчетаПродажиРегл
//	|ПОМЕСТИТЬ ВременнаяТаблицаБалыЛояльности
//	|ИЗ
//	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы,
//	|	ВТ_ПарогиЛояльности КАК ВТ_ПарогиЛояльности,
//	|	Константа.СчетВыручкиВТабличнойЧасти КАК КонстантаСчетВыручкиВТабличнойЧасти
//	|ГДЕ
//	|	РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка";
//	//|	И РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности <> ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка)";

// КонецФункции

//&Вместо("СформироватьТаблицаРасчетыСПокупателями_Deprecated")
//Процедура РасшAzRy_СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)

//	Если Не ДокументСсылкаРасходнаяНакладная.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
//		ПродолжитьВызов(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
//		Возврат;
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
//	
//	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходнаяНакладная);
//	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
//	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
//	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
//	Запрос.УстановитьПараметр("ВозникновениеОбязательствПокупателя", НСтр("ka='მყიდველის ვალდებულებების წარმოშობა';ru='Возникновение обязательств покупателя';en='The emergence of the obligations of the buyer'"));
//	Запрос.УстановитьПараметр("ВозникновениеОбязательствПокупателяПоДоставке", НСтр("ka='Возникновение обязательств покупателя по доставке';ru='Возникновение обязательств покупателя по доставке';en=""The emergence of the buyer's delivery obligation"""));
//	Запрос.УстановитьПараметр("ЗачетАванса", НСтр("ka='წინასწარ გადახდილი თანხის ჩათვლა';ru='Зачет предоплаты';en='Зачет предоплаты'"));
//	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
//	Запрос.УстановитьПараметр("БезвозмезднаяПродажа", НСтр("ka='Безвозмездная продажа';ru='Безвозмездная продажа';en='Безвозмездная продажа'"));
//	
//	// +++ { AzRy - [24.07.2013] - Jira:ERPM-223 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:კურსი დოკ. კურსზე დავსვით
//	Запрос.УстановитьПараметр("КурсыВалютРасчетовСрезПоследних_Курс", ДокументСсылкаРасходнаяНакладная.Курс);
//	Запрос.УстановитьПараметр("КурсыВалютРасчетовСрезПоследних_Кратность", ДокументСсылкаРасходнаяНакладная.Кратность);
//	// +++ } AzRy - [24.07.2013] - Jira:ERPM-223 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:კურსი დოკ. კურსზე დავსვით	
//	
//	//ПодольскийАИ #УчетПроектов 10.10.2020 {
//	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
//	//ПодольскийАИ #УчетПроектов 10.10.2020 }
//	
//	// Формирование временной таблицы по расчетам с покупателями.
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
//	|	ТаблицаДокумента.Период КАК Дата,
//	|	ТаблицаДокумента.Организация КАК Организация,
//	|	ТаблицаДокумента.Контрагент КАК Контрагент,
//	|	ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем КАК СчетУчета,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРегл,
//	|	ТаблицаДокумента.Договор КАК Договор,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//	|			ТОГДА ТаблицаДокумента.Документ
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК Документ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
//	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
//	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|		ИНАЧЕ ТаблицаДокумента.Заказ
//	|	КОНЕЦ КАК Заказ,
//	////ПодольскийАИ #УчетПроектов 10.10.2020 {
//	//|	ТаблицаДокумента.Проект КАК Проект,
//	////ПодольскийАИ #УчетПроектов 10.10.2020 }
//	//_Lazare
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
//	|		ИНАЧЕ ТаблицаДокумента.Проект
//	|	КОНЕЦ КАК Проект,
//	//Lazare_
//	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
//	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,
//	|	СУММА(ТаблицаДокумента.Сумма) КАК Сумма,
//	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
//	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаДляОстатка,
//	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВалДляОстатка,
//	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПокупателя КАК СТРОКА(100)) КАК СодержаниеПроводки
//	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателями
//	|ИЗ
//	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
//	|ГДЕ
//	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
//	|	И ТаблицаДокумента.Сумма <> 0
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаДокумента.Период,
//	|	ТаблицаДокумента.Организация,
//	|	ТаблицаДокумента.Контрагент,
//	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.Договор,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//	|			ТОГДА ТаблицаДокумента.Документ
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
//	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
//	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|		ИНАЧЕ ТаблицаДокумента.Заказ
//	|	КОНЕЦ,
//	////ПодольскийАИ #УчетПроектов 10.10.2020 {
//	//|	ТаблицаДокумента.Проект,
//	////ПодольскийАИ #УчетПроектов 10.10.2020 }
//	//_Lazare
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
//	|		ИНАЧЕ ТаблицаДокумента.Проект
//	|	КОНЕЦ,
//	//Lazare_
//	|	ТаблицаДокумента.ВалютаРасчетов,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//	|	ТаблицаДокумента.Период КАК Дата,
//	|	ТаблицаДокумента.Организация КАК Организация,
//	|	ТаблицаДокумента.Контрагент КАК Контрагент,
//	|	ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем КАК СчетУчета,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРегл,
//	|	ТаблицаДокумента.Договор КАК Договор,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//	|			ТОГДА ТаблицаДокумента.Документ
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК Документ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
//	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
//	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|		ИНАЧЕ ТаблицаДокумента.Заказ
//	|	КОНЕЦ КАК Заказ,
//	////ПодольскийАИ #УчетПроектов 10.10.2020 {
//	//|	ТаблицаДокумента.Проект,
//	////ПодольскийАИ #УчетПроектов 10.10.2020 }
//	//_Lazare
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
//	|		ИНАЧЕ ТаблицаДокумента.Проект
//	|	КОНЕЦ,
//	//Lazare_
//	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
//	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,
//	|	СУММА(ТаблицаДокумента.Сумма) КАК Сумма,
//	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
//	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаДляОстатка,
//	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВалДляОстатка,
//	|	ВЫРАЗИТЬ(&БезвозмезднаяПродажа КАК СТРОКА(100)) КАК СодержаниеПроводки
//	|ИЗ
//	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
//	|ГДЕ
//	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
//	|	И ТаблицаДокумента.ЭтоПодарок
//	|	И ТаблицаДокумента.Сумма <> 0
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаДокумента.Период,
//	|	ТаблицаДокумента.Организация,
//	|	ТаблицаДокумента.Контрагент,
//	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.Договор,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//	|			ТОГДА ТаблицаДокумента.Документ
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
//	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
//	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|		ИНАЧЕ ТаблицаДокумента.Заказ
//	|	КОНЕЦ,
//	////ПодольскийАИ #УчетПроектов 10.10.2020 {
//	//|	ТаблицаДокумента.Проект,
//	////ПодольскийАИ #УчетПроектов 10.10.2020 }
//	//_Lazare
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
//	|		ИНАЧЕ ТаблицаДокумента.Проект
//	|	КОНЕЦ,
//	//Lazare_
//	|	ТаблицаДокумента.ВалютаРасчетов,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
//	|	ТаблицаДокумента.Период,
//	|	ТаблицаДокумента.Организация,
//	|	ТаблицаДокумента.Контрагент,
//	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.СчетУчетаАвансовПокупателя,
//	|	ТаблицаДокумента.СчетУчетаАвансовПокупателяРегл,
//	|	ТаблицаДокумента.Договор,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//	|			ТОГДА ТаблицаДокумента.Документ
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
//	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
//	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|		ИНАЧЕ ТаблицаДокумента.Заказ
//	|	КОНЕЦ,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 {
//	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) КАК Проект,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 }
//	|	ТаблицаДокумента.ВалютаРасчетов,
//	|	ТаблицаДокумента.ТипРасчетов,
//	|	СУММА(ТаблицаДокумента.СуммаАванса), //+++ Дмгг СУММА(ТаблицаДокумента.Сумма),
//	|	СУММА(ТаблицаДокумента.СуммаВал),
//	|	СУММА(ТаблицаДокумента.СуммаАванса), //+++ Дмгг СУММА(ТаблицаДокумента.Сумма),
//	|	СУММА(ТаблицаДокумента.СуммаВал),
//	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
//	|ИЗ
//	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
//	|ГДЕ
//	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаДокумента.Период,
//	|	ТаблицаДокумента.Организация,
//	|	ТаблицаДокумента.Контрагент,
//	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.Договор,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//	|			ТОГДА ТаблицаДокумента.Документ
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
//	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
//	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|		ИНАЧЕ ТаблицаДокумента.Заказ
//	|	КОНЕЦ,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 {
//	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
//	//ПодольскийАИ #УчетПроектов 10.10.2020 }
//	|	ТаблицаДокумента.ТипРасчетов,
//	|	ТаблицаДокумента.ВалютаРасчетов,
//	|	ТаблицаДокумента.СчетУчетаАвансовПокупателяРегл,
//	|	ТаблицаДокумента.СчетУчетаАвансовПокупателя
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
//	|	ТаблицаДокумента.Период,
//	|	ТаблицаДокумента.Организация,
//	|	ТаблицаДокумента.Контрагент,
//	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл,
//	|	ТаблицаДокумента.Договор,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//	|			ТОГДА ТаблицаДокумента.ДокументКуда
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
//	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
//	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|		ИНАЧЕ ТаблицаДокумента.Заказ
//	|	КОНЕЦ,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 {
//	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
//	//ПодольскийАИ #УчетПроектов 10.10.2020 }
//	|	ТаблицаДокумента.ВалютаРасчетов,
//	|	ТаблицаДокумента.ТипРасчетовКуда,
//	|	СУММА(ТаблицаДокумента.СуммаАванса), //+++ Дмгг СУММА(ТаблицаДокумента.Сумма),
//	|	СУММА(ТаблицаДокумента.СуммаВал),
//	|	-СУММА(ТаблицаДокумента.СуммаАванса), //+++ Дмгг -СУММА(ТаблицаДокумента.Сумма),
//	|	-СУММА(ТаблицаДокумента.СуммаВал),
//	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
//	|ИЗ
//	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
//	|ГДЕ
//	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаДокумента.Период,
//	|	ТаблицаДокумента.Организация,
//	|	ТаблицаДокумента.Контрагент,
//	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.Договор,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//	|			ТОГДА ТаблицаДокумента.ДокументКуда
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
//	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
//	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|		ИНАЧЕ ТаблицаДокумента.Заказ
//	|	КОНЕЦ,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 {
//	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
//	//ПодольскийАИ #УчетПроектов 10.10.2020 }
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл,
//	|	ТаблицаДокумента.ВалютаРасчетов,
//	|	ТаблицаДокумента.ТипРасчетовКуда
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Организация,
//	|	Контрагент,
//	|	Договор,
//	|	Валюта,
//	|	Документ,
//	|	Заказ,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 {
//	|	Проект,
//	//ПодольскийАИ #УчетПроектов 10.10.2020 }
//	|	ТипРасчетов,
//	|	СчетУчета";
//	
//	// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment: 
//	AzRyУправлениеНебольшойФирмойСервер_Deprecated.ПриходнаяНакладная_ИнициализироватьДанныеДокумента_ДопТекстЗапроса("РасходнаяНакладная", Запрос, ДокументСсылкаРасходнаяНакладная.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено);	
//	// +++ } AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment:	
//	
//	Запрос.Выполнить();
//	
//	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ВременнаяТаблицаРасчетыСПокупателями.Организация КАК Организация,
//	|	ВременнаяТаблицаРасчетыСПокупателями.Контрагент КАК Контрагент,
//	|	ВременнаяТаблицаРасчетыСПокупателями.Договор КАК Договор,
//	|	ВременнаяТаблицаРасчетыСПокупателями.Документ КАК Документ,
//	|	ВременнаяТаблицаРасчетыСПокупателями.Заказ КАК Заказ,
//	|	ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов КАК ТипРасчетов
//	|ИЗ
//	|	ВременнаяТаблицаРасчетыСПокупателями";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Блокировка = Новый БлокировкаДанных;
//	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПокупателями");
//	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
//	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
//	
//	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
//		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
//	КонецЦикла;
//	Блокировка.Заблокировать();
//	
//	// +++ { AzRy - [27.12.2021] - Developer:გიორგი მამულაშვილი - Comment:
//	AzRyУправлениеНебольшойФирмойСервер_Deprecated.Сформировать_ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная(Запрос);
//	// +++ } AzRy - [27.12.2021] - Developer:გიორგი მამულაშვილი - Comment:	
//	
//	НомерЗапроса = 0;
//	Запрос.Текст = AzRyУправлениеНебольшойФирмойСервер_Deprecated.AzRy_ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса, ДокументСсылкаРасходнаяНакладная);
//	Запрос.Текст = Запрос.Текст + ";" + AzRyУправлениеНебольшойФирмойСервер_Deprecated.AzRy_ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателямиРегл(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса, ДокументСсылкаРасходнаяНакладная);
//	МассивРезультатов = Запрос.ВыполнитьПакет();
//	
//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", МассивРезультатов[НомерЗапроса].Выгрузить());	
//	
//КонецПроцедуры

&Вместо("НапечататьInvoice")
Функция РасшAzRy_НапечататьInvoice(МассивОбъектов, ОбъектыПечати)

	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Invoice";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплату_Invoice";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяЗапасы.Ссылка КАК Документ,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Дата КАК Дата,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Номер КАК Номер,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Организация.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.Наименование
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Организация.НаименованиеПолное
		|	КОНЕЦ КАК Продавец,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.Наименование
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.НаименованиеПолное
		|	КОНЕЦ КАК Покупатель,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
		|	РасходнаяНакладнаяЗапасы.Ссылка.СуммаДокумента КАК Сумма,
		|	РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
		|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Номенклатура.Наименование
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное
		|	КОНЕЦ КАК Номенклатура,
		|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
		|	РасходнаяНакладнаяЗапасы.Количество КАК Количество,
		|	РасходнаяНакладнаяЗапасы.Цена КАК Цена,
		|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС,
		|	РасходнаяНакладнаяЗапасы.Всего КАК Всего,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.НомерСчета КАК БанковскийСчет,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Код КАК БанкКод,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Наименование КАК Банк,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ИНН КАК ПокупательИНН,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ИНН КАК ПродавецИНН,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Ответственный.Физлицо КАК Ответственный,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлЛоготип КАК ФайлЛоготип,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлФаксимильнаяПечать КАК ФайлФаксимильнаяПечать,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлПечати КАК ФайлПечати,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо КАК Руководитель
		|ИЗ
		|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
		|ГДЕ
		|	РасходнаяНакладнаяЗапасы.Ссылка В(&МассивОбъектов)
		|ИТОГИ
		|	МАКСИМУМ(Продавец),
		|	МАКСИМУМ(Покупатель),
		|	КОЛИЧЕСТВО(НомерСтроки),
		|	СУММА(СуммаНДС),
		|	СУММА(Всего),
		|	МАКСИМУМ(БанковскийСчет)
		|ПО
		|	Документ";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		// +++ { AzRy - [29.04.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
		МакетПечатнойФормы	= УправлениеПечатью.МакетПечатнойФормы("Общиймакет.AzRy_ПФ_MXL_Invoice"); //УправлениеПечатью.МакетПечатнойФормы("Общиймакет.ПФ_MXL_Invoice");//ПолучитьМакет("ПФ_MXL_Invoice");
		
		// Вывод шапки для документа
		ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка");             
		ОбластьШапки = ?(ВыборкаДокумент.Документ.Организация = Справочники.Организации.НайтиПоКоду("00-000004"),МакетПечатнойФормы.ПолучитьОбласть("Шапка_GEME"),МакетПечатнойФормы.ПолучитьОбласть("Шапка"));
		// +++ } AzRy - [29.04.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
		ОбластьШапки.Параметры.Заполнить(ВыборкаДокумент);
		Попытка
			ОбластьШапки.Параметры.Дата	= Формат(ВыборкаДокумент.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлЛоготип) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлЛоготип);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьШапки.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапки);
				
		// Вывод таблицной части
		ВыборкаДанныхДокумента = ВыборкаДокумент.Выбрать();
		ОбластьСтрока = МакетПечатнойФормы.ПолучитьОбласть("ТабличаяЧасть");
		Пока ВыборкаДанныхДокумента.Следующий() Цикл 
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДанныхДокумента);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		// Вывод подвала для документа
		ОбластьПодвал = МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(ВыборкаДокумент);
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлФаксимильнаяПечать) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлФаксимильнаяПечать);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Факсимилия.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлПечати) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлПечати);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.Руководитель) Тогда
			Попытка
				ОбластьПодвал.Параметры.Руководитель = РС_ОбщегоНазначения.ПолучитьФИОФизЛиц(ВыборкаДокумент.Руководитель, ВыборкаДокумент.Дата);
			Исключение
			КонецПопытки;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокумент.Документ);   
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&Вместо("НапечататьInvoiceEng")
Функция РасшAzRy_НапечататьInvoiceEng(МассивОбъектов, ОбъектыПечати)
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_InvoiceEng";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплату_InvoiceEng";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.Ссылка КАК Документ,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Дата КАК Дата,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Организация.НаименованиеАнглийское КАК СТРОКА(100))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.Наименование
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Организация.НаименованиеАнглийское
	|	КОНЕЦ КАК Продавец,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(100))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.Наименование
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.НаименованиеПолное
	|	КОНЕЦ КАК Покупатель,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
	|	РасходнаяНакладнаяЗапасы.Ссылка.СуммаДокумента КАК Сумма,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
	|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Номенклатура.Наименование
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
	|	РасходнаяНакладнаяЗапасы.Количество КАК Количество,
	|	РасходнаяНакладнаяЗапасы.Цена КАК Цена,
	|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС,
	|	РасходнаяНакладнаяЗапасы.Всего КАК Всего,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.НомерСчета КАК БанковскийСчет,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Код КАК БанкКод,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.НаименованиеАнглиское КАК СТРОКА(100))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Наименование
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.НаименованиеАнглиское
	|	КОНЕЦ КАК Банк,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ИНН КАК ПокупательИНН,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ИНН КАК ПродавецИНН,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Ответственный.Физлицо КАК Ответственный,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлЛоготип КАК ФайлЛоготип,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлФаксимильнаяПечать КАК ФайлФаксимильнаяПечать,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлПечати КАК ФайлПечати,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо.НаименованиеАнглиское КАК СТРОКА(100))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо.НаименованиеАнглиское
	|	КОНЕЦ КАК Руководитель
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка В(&МассивОбъектов)
	|ИТОГИ
	|	МАКСИМУМ(Продавец),
	|	МАКСИМУМ(Покупатель),
	|	КОЛИЧЕСТВО(НомерСтроки),
	|	СУММА(СуммаНДС),
	|	СУММА(Всего),
	|	МАКСИМУМ(БанковскийСчет)
	|ПО
	|	Документ";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		// +++ { AzRy - [26.04.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
		МакетПечатнойФормы	= УправлениеПечатью.МакетПечатнойФормы("Документ.РасходнаяНакладная.AzRy_ПФ_MXL_InvoiceEng");//УправлениеПечатью.МакетПечатнойФормы("Документ.РасходнаяНакладная.ПФ_MXL_InvoiceEng");//ПолучитьМакет("ПФ_MXL_Invoice");
		
		// Вывод шапки для документа
		ОбластьШапки = ?(ВыборкаДокумент.Документ.Организация = Справочники.Организации.НайтиПоКоду("00-000004"),МакетПечатнойФормы.ПолучитьОбласть("Шапка_GEME"),МакетПечатнойФормы.ПолучитьОбласть("Шапка"));
		// +++ } AzRy - [26.04.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
		ОбластьШапки.Параметры.Заполнить(ВыборкаДокумент);
		Попытка
			ОбластьШапки.Параметры.Дата	= Формат(ВыборкаДокумент.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлЛоготип) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлЛоготип);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьШапки.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		// Вывод таблицной части
		ВыборкаДанныхДокумента = ВыборкаДокумент.Выбрать();
		ОбластьСтрока = МакетПечатнойФормы.ПолучитьОбласть("ТабличаяЧасть");
		Пока ВыборкаДанныхДокумента.Следующий() Цикл 
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДанныхДокумента);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		// Вывод подвала для документа
		ОбластьПодвал = МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(ВыборкаДокумент);
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлФаксимильнаяПечать) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлФаксимильнаяПечать);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Факсимилия.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлПечати) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлПечати);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.Руководитель) Тогда
			Попытка
				ОбластьПодвал.Параметры.Руководитель = ВыборкаДокумент.Руководитель;
			Исключение
			КонецПопытки;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокумент.Документ);   
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
