&После("ПередЗаписью")
Процедура РасшAzRy_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// თუ დოკუმენტი გატარებულია და შემოწმების მექანიზმი გათიშულია მაშინ ქვედა შემოქმებას აზრი აღარ აქვს
	Если Проведен Или AzRyПроверкаЗаполнениеТаблицыФактурыАвансовОтключена_1 Или AzRyDEV.ЯвляетсяНеРезидентом(Контрагент) Или AzRyDEV.НалогообложениеНДСНеОблагаетсяНДС(НалогообложениеНДС) Тогда
		Возврат;	
	КонецЕсли; 
	
	//Если Не Проведен И Предоплата.Итог("СуммаПлатежа") > 0 И ФактурыАвансов.Количество() = 0 Тогда
	Если AzRyDEV.ДатаПредоплатыМеньшеТекущегоМесяца(Предоплата, Дата) И (Предоплата.Итог("СуммаПлатежа") > 0 И ФактурыАвансов.Количество() = 0) Тогда
	
		ТекстСообщения = НСтр("ru = 'Итог колонки ""сумма платежа"" в табл. части ""Предоплата"" болше нуля, Заполнение таблицы ""Фактуры авансов"" обязательна'; ka = 'ცხრილი ""წინასწარი გადახდა"" - ის ჯამი მეტია 0 - ზე, სავალდებულოა ავანსის ფაქტურების ცხრილის შევსება.'; en = 'ცხრილი ""წინასწარი გადახდა"" - ის ჯამი მეტია 0 - ზე, სავალდებულოა ავანსის ფაქტურების ცხრილის შევსება.'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			ЭтотОбъект,
			ТекстСообщения,
			,
			,
			,
			Отказ
		);
			
	КонецЕсли;	
	
КонецПроцедуры

//&Вместо("ЗаполнитьПоЗаказуПокупателя_Deprecated")
//Процедура РасшAzRy_ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения)
//		
//	Если ЭтоВводНаОснованииЗаказНаряда(ДанныеЗаполнения) Тогда
//		ВызватьИсключение НСтр("ka='გასავლის ზედნადების შეყვანა შეუძლებელია სერვისის დოკუმენტის საფუძველზე!';ru='Нельзя ввести Расходную накладную на основании заказ-наряда!';en='You can not enter outgoing invoices based on purchase order!'");
//	КонецЕсли;
//	
//	// Основание и настройка документа.
//	МассивЗаказов = Новый Массив;
//	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("МассивЗаказовПокупателей") Тогда
//		МассивЗаказов = ДанныеЗаполнения.МассивЗаказовПокупателей;
//		ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
//	Иначе
//		МассивЗаказов.Добавить(ДанныеЗаполнения.Ссылка);
//		ПоложениеЗаказаПокупателя = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ПоложениеЗаказаПокупателяВДокументахОтгрузки");
//		Если НЕ ЗначениеЗаполнено(ПоложениеЗаказаПокупателя) Тогда
//			ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
//		КонецЕсли;
//		Если ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
//			Заказ = ДанныеЗаполнения;
//		КонецЕсли;
//	КонецЕсли;
//	
//	//ДД Заполнить Доп Реквизиты
//	//+++ Дмгг
//	//ЗаполнитьДопРеквизиты(ДанныеЗаполнения);
//	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ДополнительныеРеквизиты") Тогда 
//		ЗаполнитьДопРеквизиты(ДанныеЗаполнения);
//	ИначеЕсли ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда 
//		ЗаполнитьДопРеквизиты(ДанныеЗаполнения);
//	КонецЕсли;
//	//--- Дмгг
//	
//	
//	// Заполнение шапки.
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ЗаказПокупателя.Ссылка КАК ОснованиеСсылка,
//	|	ЗаказПокупателя.Проведен КАК ОснованиеПроведен,
//	|	ЗаказПокупателя.СостояниеЗаказа КАК СостояниеЗаказа,
//	|	ЗаказПокупателя.Организация КАК Организация,
//	|	ВЫБОР
//	|		КОГДА ЗаказПокупателя.БанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
//	|			ТОГДА ЗаказПокупателя.Организация.БанковскийСчетПоУмолчанию
//	|		ИНАЧЕ ЗаказПокупателя.БанковскийСчет
//	|	КОНЕЦ КАК БанковскийСчет,
//	|	ВЫБОР
//	|		КОГДА РезервированиеЗапасов.Значение
//	|			ТОГДА ЗаказПокупателя.СтруктурнаяЕдиницаРезерв
//	|	КОНЕЦ КАК СтруктурнаяЕдиница,
//	|	ЗаказПокупателя.СтруктурнаяЕдиницаПродажи КАК Подразделение,
//	|	ЗаказПокупателя.Контрагент КАК Контрагент,
//	|	ЗаказПокупателя.Договор КАК Договор,
//	|	ЗаказПокупателя.Договор КАК ОснованиеПечатиСсылка,
//	|	ЗаказПокупателя.ВидЦен КАК ВидЦен,
//	|	ЗаказПокупателя.ВидСкидкиНаценки КАК ВидСкидкиНаценки,
//	|	ЗаказПокупателя.ДисконтнаяКарта КАК ДисконтнаяКарта,
//	|	ЗаказПокупателя.ПроцентСкидкиПоДисконтнойКарте КАК ПроцентСкидкиПоДисконтнойКарте,
//	|	ЗаказПокупателя.ВалютаДокумента КАК ВалютаДокумента,
//	|	ЗаказПокупателя.НалогообложениеНДС КАК НалогообложениеНДС,
//	|	ЗаказПокупателя.СуммаВключаетНДС КАК СуммаВключаетНДС,
//	|	ЗаказПокупателя.НДСВключатьВСтоимость КАК НДСВключатьВСтоимость,
//	|	ЗаказПокупателя.ОжидаетсяВыборВариантаКП,
//	|	ВЫБОР
//	|		КОГДА ЗаказПокупателя.ВалютаДокумента = НациональнаяВалюта.Значение
//	|			ТОГДА ЗаказПокупателя.Курс
//	|		ИНАЧЕ КурсыВалютСрезПоследних.Курс
//	|	КОНЕЦ КАК Курс,
//	|	ВЫБОР
//	|		КОГДА ЗаказПокупателя.ВалютаДокумента = НациональнаяВалюта.Значение
//	|			ТОГДА ЗаказПокупателя.Кратность
//	|		ИНАЧЕ КурсыВалютСрезПоследних.Кратность
//	|	КОНЕЦ КАК Кратность,
//	|	ЗаказПокупателя.Вес КАК Вес,
//	|	ЗаказПокупателя.Объем КАК Объем,
//	|	ВЫБОР
//	|		КОГДА ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПустаяСсылка)
//	|				ИЛИ ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
//	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
//	|		ИНАЧЕ ЗаказПокупателя.НоменклатураДоставки
//	|	КОНЕЦ КАК НоменклатураДоставки,
//	|	ЗаказПокупателя.СтоимостьДоставки КАК СтоимостьДоставки,
//	|	ЗаказПокупателя.СтавкаНДСДоставки КАК СтавкаНДСДоставки,
//	|	ЗаказПокупателя.СуммаНДСДоставки КАК СуммаНДСДоставки
//	// +++ { AzRy - [21.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:
//	|	,ЗаказПокупателя.Проект КАК Проект
//	// +++ } AzRy - [21.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:		
//	|ИЗ
//	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
//	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютСрезПоследних
//	|		ПО ЗаказПокупателя.Договор.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта},
//	|	Константа.НациональнаяВалюта КАК НациональнаяВалюта,
//	|	Константа.ФункциональнаяОпцияРезервированиеЗапасов КАК РезервированиеЗапасов
//	|ГДЕ
//	|	ЗаказПокупателя.Ссылка В(&МассивЗаказов)";
//	
//	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
//	Запрос.УстановитьПараметр("ДатаДокумента", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	Пока Выборка.Следующий() Цикл
//		ЗначенияПроверяемыхРеквизитов = Новый Структура(
//			"СостояниеЗаказа, Проведен, ОжидаетсяВыборВариантаКП",
//			Выборка.СостояниеЗаказа, Выборка.ОснованиеПроведен, Выборка.ОжидаетсяВыборВариантаКП
//		);
//		Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(Выборка.ОснованиеСсылка, ЗначенияПроверяемыхРеквизитов);
//	КонецЦикла;
//	
//	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
//	
//	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
//		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ОсновнойСклад");
//		Если НЕ ЗначениеЗаполнено(ЗначениеНастройки) Тогда
//			СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
//		КонецЕсли;
//	КонецЕсли;
//	
//	// Заполнение табличной части.
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ЗаказыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
//	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
//	|	ЗаказыОстатки.Характеристика КАК Характеристика,
//	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		ЗаказыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
//	|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
//	|		ЗаказыОстатки.Характеристика КАК Характеристика,
//	|		ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
//	|	ИЗ
//	|		РегистрНакопления.ЗаказыПокупателей.Остатки(
//	|				,
//	|				ЗаказПокупателя В (&МассивЗаказов)
//	|					И (Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
//	|						ИЛИ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))) КАК ЗаказыОстатки
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ДвиженияДокументаЗаказыПокупателей.ЗаказПокупателя,
//	|		ДвиженияДокументаЗаказыПокупателей.Номенклатура,
//	|		ДвиженияДокументаЗаказыПокупателей.Характеристика,
//	|		ВЫБОР
//	|			КОГДА ДвиженияДокументаЗаказыПокупателей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗаказыПокупателей.Количество, 0)
//	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗаказыПокупателей.Количество, 0)
//	|		КОНЕЦ
//	|	ИЗ
//	|		РегистрНакопления.ЗаказыПокупателей КАК ДвиженияДокументаЗаказыПокупателей
//	|	ГДЕ
//	|		ДвиженияДокументаЗаказыПокупателей.Регистратор = &Ссылка) КАК ЗаказыОстатки
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ЗаказыОстатки.ЗаказПокупателя,
//	|	ЗаказыОстатки.Номенклатура,
//	|	ЗаказыОстатки.Характеристика
//	|
//	|ИМЕЮЩИЕ
//	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЗаказПокупателяЗапасы.НомерСтроки КАК НомерСтроки,
//	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
//	|	ЗаказПокупателяЗапасы.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
//	|	ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
//	|	ВЫБОР
//	|		КОГДА ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ТипНоменклатурыЗапас,
//	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
//	|	ВЫБОР
//	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
//	|			ТОГДА 1
//	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
//	|	КОНЕЦ КАК Коэффициент,
//	|	ВЫБОР
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение
//	|			ТОГДА ВЫБОР
//	|					КОГДА ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET = 0
//	|						ТОГДА ЗаказПокупателяЗапасы.Количество
//	|					ИНАЧЕ ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET
//	|				КОНЕЦ
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение
//	|			ТОГДА ВЫБОР
//	|					КОГДА ЗаказПокупателяЗапасы.КоличествоСобр = 0
//	|							ИЛИ ЗаказПокупателяЗапасы.КоличествоСобр = ЗаказПокупателяЗапасы.Количество
//	|						ТОГДА ЗаказПокупателяЗапасы.Количество
//	|					ИНАЧЕ ЗаказПокупателяЗапасы.КоличествоСобр
//	|				КОНЕЦ
//	|		ИНАЧЕ ЗаказПокупателяЗапасы.Количество
//	|	КОНЕЦ КАК Количество,
//	|	ЗаказПокупателяЗапасы.Партия КАК Партия,
//	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	|	ЗаказПокупателяЗапасы.Цена КАК Цена,
//	|	ЗаказПокупателяЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
//	|	ВЫБОР
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение
//	|			ТОГДА ЗаказПокупателяЗапасы.Сумма
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение
//	|			ТОГДА ВЫБОР
//	|					КОГДА ЗаказПокупателяЗапасы.КоличествоСобр = 0
//	|						ТОГДА ЗаказПокупателяЗапасы.Сумма
//	|					ИНАЧЕ ЗаказПокупателяЗапасы.КоличествоСобр * ЗаказПокупателяЗапасы.Цена
//	|				КОНЕЦ
//	|		ИНАЧЕ ЗаказПокупателяЗапасы.Сумма
//	|	КОНЕЦ КАК Сумма,
//	|	ЗаказПокупателяЗапасы.СтавкаНДС КАК СтавкаНДС,
//	|	ВЫБОР
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение
//	|				И ЗаказПокупателяЗапасы.СуммаНДС > 0
//	|				И ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET > 0
//	|			ТОГДА ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET * ЗаказПокупателяЗапасы.Цена КАК ЧИСЛО(15, 2)) / 1.18 * 0.18 
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение
//	|				И ЗаказПокупателяЗапасы.СуммаНДС > 0
//	|				И ЗаказПокупателяЗапасы.КоличествоСобр > 0
//	|			ТОГДА ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.КоличествоСобр * ЗаказПокупателяЗапасы.Цена / 1.18 * 0.18 КАК ЧИСЛО(15, 2))
//	|		ИНАЧЕ ЗаказПокупателяЗапасы.СуммаНДС
//	|	КОНЕЦ КАК СуммаНДС,
//	|	ВЫБОР
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение
//	|			ТОГДА ВЫБОР
//	|					КОГДА ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET = 0
//	|						ТОГДА ЗаказПокупателяЗапасы.Всего
//	|					ИНАЧЕ ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET * ЗаказПокупателяЗапасы.Цена
//	|				КОНЕЦ
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение
//	|			ТОГДА ВЫБОР
//	|					КОГДА ЗаказПокупателяЗапасы.КоличествоСобр = 0
//	|						ТОГДА ЗаказПокупателяЗапасы.Всего
//	|					ИНАЧЕ ЗаказПокупателяЗапасы.КоличествоСобр * ЗаказПокупателяЗапасы.Цена
//	|				КОНЕЦ
//	|		ИНАЧЕ ЗаказПокупателяЗапасы.Всего
//	|	КОНЕЦ КАК Всего,
//	|	ЗаказПокупателяЗапасы.Ссылка КАК Заказ,
//	|	ЗаказПокупателяЗапасы.Содержание КАК Содержание,
//	|	ЗаказПокупателяЗапасы.ПроцентАвтоматическойСкидки,
//	|	ЗаказПокупателяЗапасы.СуммаАвтоматическойСкидки,
//	|	ЗаказПокупателяЗапасы.КлючСвязи,
//	|	ЗаказПокупателяЗапасы.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки1,
//	|	ЗаказПокупателяЗапасы.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки1,
//	|	ЗаказПокупателяЗапасы.Вес КАК Вес,
//	|	ЗаказПокупателяЗапасы.Объем КАК Объем,
//	|	ЗаказПокупателяЗапасы.НаименованиеДляРС КАК НаименованиеДляРС,
//	|	ЗаказПокупателяЗапасы.ЭтоПодарок КАК ЭтоПодарок,
//	|	ЗаказПокупателяЗапасы.СтруктурнаяЕдиницаЗапасы,
//	|	ЗаказПокупателяЗапасы.КоличествоСобр
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|	,ВЫБОР
//	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение ТОГДА 
//	|			ЗаказПокупателяЗапасы.Усушка_СписаниеНаПотери
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК Усушка_СписаниеНаПотери
//	|	,ВЫБОР
//	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение ТОГДА 
//	|			ЗаказПокупателяЗапасы.Усушка_КоличествоСобрПотери
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК Усушка_КоличествоСобрПотери
//	|	,ЗаказПокупателяЗапасы.Количество КАК КоличествоСтарое
//	|	,ВЫБОР
//	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение ТОГДА
//	|			ЕСТЬNULL(ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET,0)
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК КоличествоСобрNET
//	|	,ЗаказПокупателяЗапасы.Усушка_Потери КАК Усушка_Потери
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|	,ЗаказПокупателяЗапасы.Исполнитель КАК Исполнитель //++Lazare 27.10.2021	
//	// +++ { AzRy - [19.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:
//	|	,ЗаказПокупателяЗапасы.Проект КАК Проект
//	// +++ } AzRy - [19.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:	
//	|ИЗ
//	|	ВТЗаказПокупателяЗапасы КАК ЗаказПокупателяЗапасы,
//	|	Константа.ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной КАК ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|	,Константа.German_Butcher КАК German_Butcher
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|ГДЕ
//	|	(ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
//	|			ИЛИ ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	НомерСтроки
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СкидкиНаценки.Ссылка КАК Заказ,
//	|	СкидкиНаценки.КлючСвязи КАК КлючСвязи,
//	|	СкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
//	|	СкидкиНаценки.Сумма КАК Сумма
//	|ИЗ
//	|	Документ.ЗаказПокупателя.СкидкиНаценки КАК СкидкиНаценки
//	|ГДЕ
//	|	СкидкиНаценки.Ссылка В(&МассивЗаказов)
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|;
//	|
//	|//////////////////////////////////////////////////////////////////////////////// 3
//	|ВЫБРАТЬ
//	|	Усушкa_СобранныеPаказыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
//	|	Усушкa_СобранныеPаказыОстатки.Номенклатура КАК Номенклатура,
//	|	Усушкa_СобранныеPаказыОстатки.Характеристика КАК Характеристика,
//	|	СУММА(Усушкa_СобранныеPаказыОстатки.КоличествоСобрОстаток) КАК КоличествоСобрОстаток,
//	|	СУММА(Усушкa_СобранныеPаказыОстатки.КоличествоСобрNETОстаток) КАК КоличествоСобрNETОстаток
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		Усушкa_СобранныеPаказыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
//	|		Усушкa_СобранныеPаказыОстатки.Номенклатура КАК Номенклатура,
//	|		Усушкa_СобранныеPаказыОстатки.Характеристика КАК Характеристика,
//	|		Усушкa_СобранныеPаказыОстатки.КоличествоСобрОстаток КАК КоличествоСобрОстаток,
//	|		Усушкa_СобранныеPаказыОстатки.КоличествоСобрNETОстаток КАК КоличествоСобрNETОстаток
//	|	ИЗ
//	|		РегистрНакопления.Усушкa_СобранныеPаказы.Остатки
//	|		(
//	|				,
//	|				ЗаказПокупателя В (&МассивЗаказов)
//	|					И 
//	|					(
//	|						Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
//	|						ИЛИ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
//	|					)
//	|		) КАК Усушкa_СобранныеPаказыОстатки
//	|	) КАК Усушкa_СобранныеPаказыОстатки
//	|СГРУППИРОВАТЬ ПО
//	|	Усушкa_СобранныеPаказыОстатки.ЗаказПокупателя,
//	|	Усушкa_СобранныеPаказыОстатки.Номенклатура,
//	|	Усушкa_СобранныеPаказыОстатки.Характеристика
//	|ИМЕЮЩИЕ СУММА(Усушкa_СобранныеPаказыОстатки.КоличествоСобрNETОстаток) > 0 
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	|";
//	
//	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(МассивЗаказов, Запрос.МенеджерВременныхТаблиц, Ложь);
//	
//	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	
//	МассивРезультатов = Запрос.ВыполнитьПакет();
//	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
//	ТаблицаОстатков.Индексы.Добавить("ЗаказПокупателя,Номенклатура,Характеристика");
//	
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	ТаблицаОстатковСобр = МассивРезультатов[3].Выгрузить();
//	ТаблицаОстатковСобр.Индексы.Добавить("ЗаказПокупателя,Номенклатура,Характеристика");
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	
//	// АвтоматическиеСкидки.
//	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки");
//	Если ИспользоватьАвтоматическиеСкидки Тогда
//		СкидкиНаценкиЗаказа = МассивРезультатов[2].Выгрузить();
//		СкидкиНаценки.Очистить();
//	КонецЕсли;
//	// Конец АвтоматическиеСкидки.
//	
//	Запасы.Очистить();
//	СерийныеНомера.Очистить();
//	//Если ТаблицаОстатков.Количество() > 0 Тогда
//	//	
//	//	Выборка = МассивРезультатов[1].Выбрать();
//	//	Пока Выборка.Следующий() Цикл
//	//		
//	//		СтруктураДляПоиска = Новый Структура;
//	//		СтруктураДляПоиска.Вставить("ЗаказПокупателя", Выборка.Заказ);
//	//		СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
//	//		СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
//	//		
//	//		МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
//	//		Если МассивСтрокОстатков.Количество() = 0 Тогда
//	//			Продолжить;
//	//		КонецЕсли;
//	//		
//	//		НоваяСтрока = Запасы.Добавить();
//	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
//	//		
//	//		КоличествоКСписанию = Окр(Выборка.Количество * Выборка.Коэффициент, 3);
//	//		МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоКСписанию;
//	//		Если МассивСтрокОстатков[0].КоличествоОстаток < 0 Тогда
//	//			
//	//			КоличествоКСписанию = Окр((КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент, 3);
//	//			
//	//			СтруктураДанных = УправлениеНебольшойФирмойСервер.ПолучитьСуммуСтрокиТабличнойЧасти(
//	//				Новый Структура("Количество, Цена, Сумма, ПроцентСкидкиНаценки, СтавкаНДС, СуммаНДС, СуммаВключаетНДС, Всего",
//	//					КоличествоКСписанию, Выборка.Цена, 0, Выборка.ПроцентСкидкиНаценки, Выборка.СтавкаНДС, 0, СуммаВключаетНДС, 0));
//	//			
//	//			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных);
//	//			
//	//		КонецЕсли;
//	//		
//	//		// АвтоматическиеСкидки
//	//		Если ИспользоватьАвтоматическиеСкидки Тогда
//	//			КоличествоВДокументе = Выборка.Количество * Выборка.Коэффициент;
//	//			ПересчитатьСуммы = КоличествоВДокументе <> КоличествоКСписанию;
//	//			КоэффициентПересчетаСкидки = ?(ПересчитатьСуммы, КоличествоКСписанию / КоличествоВДокументе, 1);
//	//			Если КоэффициентПересчетаСкидки <> 1 Тогда
//	//				НоваяСтрока.СуммаАвтоматическойСкидки = ОКР(Выборка.СуммаАвтоматическойСкидки * КоэффициентПересчетаСкидки,2);
//	//			КонецЕсли;
//	//			
//	//			// Формирование табличной части скидок
//	//			СуммаКРаспределению = НоваяСтрока.СуммаАвтоматическойСкидки;
//	//			
//	//			ЕстьСтрокаСкидки = Ложь;
//	//			Если Выборка.КлючСвязи <> 0 Тогда
//	//				Для Каждого СтрокаСкидкиЗаказа ИЗ СкидкиНаценкиЗаказа.НайтиСтроки(Новый Структура("Заказ,КлючСвязи", Выборка.Заказ, Выборка.КлючСвязи)) Цикл
//	//					
//	//					СтрокаСкидки = СкидкиНаценки.Добавить();
//	//					ЗаполнитьЗначенияСвойств(СтрокаСкидки, СтрокаСкидкиЗаказа);
//	//					СтрокаСкидки.Сумма = КоэффициентПересчетаСкидки * СтрокаСкидки.Сумма;
//	//					СуммаКРаспределению = СуммаКРаспределению - СтрокаСкидки.Сумма;
//	//					ЕстьСтрокаСкидки = Истина;
//	//					
//	//				КонецЦикла;
//	//			КонецЕсли;
//	//			
//	//			Если ЕстьСтрокаСкидки И СуммаКРаспределению <> 0 Тогда
//	//				СтрокаСкидки.Сумма = СтрокаСкидки.Сумма + СуммаКРаспределению;
//	//			КонецЕсли;
//	//		КонецЕсли;
//	//		// Конец АвтоматическиеСкидки
//	//		
//	//		Если МассивСтрокОстатков[0].КоличествоОстаток <= 0 Тогда
//	//			ТаблицаОстатков.Удалить(МассивСтрокОстатков[0]);
//	//		КонецЕсли;
//	//		
//	//	КонецЦикла;
//	//	
//	//КонецЕсли;
//	
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	Выборка = МассивРезультатов[1].Выбрать();
//	Пока Выборка.Следующий() Цикл
//		
//		Если Константы.German_Butcher.Получить() И Константы.ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Получить() Тогда
//		
//			Если Выборка.КоличествоСобрNET > 0 Тогда
//			
//				СтруктураДляПоиска = Новый Структура;
//				СтруктураДляПоиска.Вставить("ЗаказПокупателя", Выборка.Заказ);
//				СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
//				СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
//				
//				МассивСтрокОстатков = ТаблицаОстатковСобр.НайтиСтроки(СтруктураДляПоиска);
//				Если МассивСтрокОстатков.Количество() = 0 Тогда
//					Продолжить;
//				КонецЕсли;
//				
//				НоваяСтрока = Запасы.Добавить();
//				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
//				НоваяСтрока.Количество = Выборка.КоличествоСобрNET;
//				
//				//КоличествоКСписанию = Окр(Выборка.КоличествоСобрNETОстаток * Выборка.Коэффициент, 3);
//				КоличествоКСписанию = Выборка.КоличествоСобрNET;
//				МассивСтрокОстатков[0].КоличествоСобрNETОстаток = МассивСтрокОстатков[0].КоличествоСобрNETОстаток - КоличествоКСписанию;
//				Если МассивСтрокОстатков[0].КоличествоСобрNETОстаток < 0 Тогда
//					
//					//КоличествоКСписанию = Окр((КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент, 3);
//					КоличествоКСписанию = КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоСобрNETОстаток;
//					
//					СтруктураДанных = УправлениеНебольшойФирмойСервер.ПолучитьСуммуСтрокиТабличнойЧасти(
//					Новый Структура("Количество, Цена, Сумма, ПроцентСкидкиНаценки, СтавкаНДС, СуммаНДС, СуммаВключаетНДС, Всего",
//					КоличествоКСписанию, Выборка.Цена, 0, Выборка.ПроцентСкидкиНаценки, Выборка.СтавкаНДС, 0, СуммаВключаетНДС, 0));
//					
//					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных);
//					
//				КонецЕсли;
//				
//				НоваяСтрока.Усушка_КоличествоСобрПотери = НоваяСтрока.Усушка_КоличествоСобрПотери * КоличествоКСписанию / Выборка.Количество;
//				
//				НоваяСтрока.Усушкa_КоличествоСтарое = Выборка.КоличествоСтарое *  КоличествоКСписанию / Выборка.Количество;
//				
//				Если МассивСтрокОстатков[0].КоличествоСобрNETОстаток <= 0 Тогда
//					ТаблицаОстатковСобр.Удалить(МассивСтрокОстатков[0]);
//				КонецЕсли;
//				
//			Иначе
//				
//				Продолжить;

//			КонецЕсли;
//			
//		Иначе
//			
//			СтруктураДляПоиска = Новый Структура;
//			СтруктураДляПоиска.Вставить("ЗаказПокупателя", Выборка.Заказ);
//			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
//			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
//			
//			МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
//			Если МассивСтрокОстатков.Количество() = 0 Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			НоваяСтрока = Запасы.Добавить();
//			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);				
//			
//			КоличествоКСписанию = Окр(Выборка.Количество * Выборка.Коэффициент, 3);
//			МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоКСписанию;
//			Если МассивСтрокОстатков[0].КоличествоОстаток < 0 Тогда
//				
//				КоличествоКСписанию = Окр((КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент, 3);
//				
//				СтруктураДанных = УправлениеНебольшойФирмойСервер.ПолучитьСуммуСтрокиТабличнойЧасти(
//					Новый Структура("Количество, Цена, Сумма, ПроцентСкидкиНаценки, СтавкаНДС, СуммаНДС, СуммаВключаетНДС, Всего",
//						КоличествоКСписанию, Выборка.Цена, 0, Выборка.ПроцентСкидкиНаценки, Выборка.СтавкаНДС, 0, СуммаВключаетНДС, 0));
//				
//				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных);
//				
//			КонецЕсли;
//			
//			НоваяСтрока.Усушкa_КоличествоСтарое = НоваяСтрока.Количество;
//			
//			Если МассивСтрокОстатков[0].КоличествоОстаток <= 0 Тогда
//				ТаблицаОстатков.Удалить(МассивСтрокОстатков[0]);
//			КонецЕсли;
//		
//		КонецЕсли;
//		
//		// АвтоматическиеСкидки
//		Если ИспользоватьАвтоматическиеСкидки Тогда
//			КоличествоВДокументе = Выборка.Количество * Выборка.Коэффициент;
//			ПересчитатьСуммы = КоличествоВДокументе <> КоличествоКСписанию;
//			КоэффициентПересчетаСкидки = ?(ПересчитатьСуммы, КоличествоКСписанию / КоличествоВДокументе, 1);
//			Если КоэффициентПересчетаСкидки <> 1 Тогда
//				НоваяСтрока.СуммаАвтоматическойСкидки = ОКР(Выборка.СуммаАвтоматическойСкидки * КоэффициентПересчетаСкидки,2);
//			КонецЕсли;
//			
//			// Формирование табличной части скидок
//			СуммаКРаспределению = НоваяСтрока.СуммаАвтоматическойСкидки;
//			
//			ЕстьСтрокаСкидки = Ложь;
//			Если Выборка.КлючСвязи <> 0 Тогда
//				Для Каждого СтрокаСкидкиЗаказа ИЗ СкидкиНаценкиЗаказа.НайтиСтроки(Новый Структура("Заказ,КлючСвязи", Выборка.Заказ, Выборка.КлючСвязи)) Цикл
//					
//					СтрокаСкидки = СкидкиНаценки.Добавить();
//					ЗаполнитьЗначенияСвойств(СтрокаСкидки, СтрокаСкидкиЗаказа);
//					СтрокаСкидки.Сумма = КоэффициентПересчетаСкидки * СтрокаСкидки.Сумма;
//					СуммаКРаспределению = СуммаКРаспределению - СтрокаСкидки.Сумма;
//					ЕстьСтрокаСкидки = Истина;
//					
//				КонецЦикла;
//			КонецЕсли;
//			
//			Если ЕстьСтрокаСкидки И СуммаКРаспределению <> 0 Тогда
//				СтрокаСкидки.Сумма = СтрокаСкидки.Сумма + СуммаКРаспределению;
//			КонецЕсли;
//		КонецЕсли;
//		// Конец АвтоматическиеСкидки
//		
//	КонецЦикла;
//	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
//	
//	// Заполнение резервов.
//	Если Запасы.Количество() > 0
//		И Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить()
//		И ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
//		ЗаполнитьКолонкуРезервПоРезервам();
//	КонецЕсли;
//	
//	// АвтоматическиеСкидки.
//	Если ИспользоватьАвтоматическиеСкидки Тогда
//		РезультатРасчетаСкидокНаценок = СкидкиНаценки.Выгрузить();
//		СкидкиНаценкиСервер.ПрименитьРезультатРасчетаСкидокКОбъекту(ЭтотОбъект, "Запасы", РезультатРасчетаСкидокНаценок);
//	КонецЕсли;
//	
//	Если Константы.ФункционалСбораТоваров.Получить() Тогда
//		Для Каждого Док Из МассивЗаказов Цикл 
//			ДокОб = Док.ПолучитьОбъект();
//			Если ДокОб.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Собран Или ДокОб.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.ВыгруженНаБорт Тогда
//				ДокОб.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Доставлен;
//				ДокОб.Записать();
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;	
//	
//КонецПроцедуры

