
&НаКлиенте
Процедура РасшAzRy_ДокументыОснованияДокументОснованиеПриИзмененииВместо(Элемент)
			
	ТекущиеДанные = Элементы.ДокументыОснования.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументОснование) Тогда
		// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
		Если ТипЗнч(ТекущиеДанные.ДокументОснование) = Тип("ДокументСсылка.ЧекККМ") Тогда
			ЗаполнитьЗначенияСвойств(ТекущиеДанные, AzRyРаботаСДокументамыКлиентСервер.ПолучитьИтоги(ТекущиеДанные.ДокументОснование));
		Иначе 	
			ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПолучитьИтоги(ТекущиеДанные.ДокументОснование));
		КонецЕсли; 
		// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_ДокументыОснованияДокументОснованиеНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = Новый СписокЗначений; 
//Паганини#OneSoft_
Если Объект.Корректировочная Тогда
	СписокВыбора.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	СписокВыбора.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
Иначе
//_Паганини#OneSoft
	СписокВыбора.Добавить(Тип("ДокументСсылка.РасходнаяНакладная")); 
	//СписокВыбора.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная")); //Паганини#OneSoft
	СписокВыбора.Добавить(Тип("ДокументСсылка.АктВыполненныхРабот")); 
	СписокВыбора.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	СписокВыбора.Добавить(Тип("ДокументСсылка.Взаимозачет"));	
//Паганини#OneSoft_
КонецЕсли;
//_Паганини#OneSoft

	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	СписокВыбора.Добавить(Тип("ДокументСсылка.ЧекККМ"));
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	
	ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора);
	
	Если ВыбранноеЗначение <> Неопределено Тогда 
		Если ВыбранноеЗначение.Значение = Тип("ДокументСсылка.РасходнаяНакладная") Тогда 
			
			ЗначениеОтбора  = Новый Структура("ВидОперации", ПолучитьДанныеПеречисления("ВидыОперацийРасходнаяНакладная","ПродажаПокупателю"));
			ЗначениеОтбора.Вставить("Контрагент",Объект.Контрагент);
			пПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);   
			Форма = ОткрытьФорму("Документ.РасходнаяНакладная.ФормаВыбора",пПараметрыВыбора,Элемент);
			
		ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда 
			
			ЗначениеОтбора  = Новый Структура("ВидОперации", ПолучитьДанныеПеречисления("ВидыОперацийПриходнаяНакладная","ВозвратОтПокупателя"));
			ЗначениеОтбора.Вставить("Контрагент",Объект.Контрагент);
			пПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);   
			Форма = ОткрытьФорму("Документ.ПриходнаяНакладная.ФормаВыбора",пПараметрыВыбора,Элемент);
			
		ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда 
			//
			//ЗначениеОтбора  = Новый Структура("ВидОперации", ПолучитьДанныеПеречисления("ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию"));
			//ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора); 
			ЗначениеОтбора  = Новый Структура();
			ЗначениеОтбора.Вставить("Контрагент",Объект.Контрагент);
			пПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
			Форма = ОткрытьФорму("Документ.АктВыполненныхРабот.ФормаВыбора",пПараметрыВыбора,Элемент);  
			
		ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.Взаимозачет") Тогда 
			//
			//ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора); 
			ЗначениеОтбора  = Новый Структура();
			ЗначениеОтбора.Вставить("Контрагент",Объект.Контрагент);
			ЗначениеОтбора.Вставить("ВидОперации",	ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя"));
			пПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
			Форма = ОткрытьФорму("Документ.Взаимозачет.ФормаВыбора",пПараметрыВыбора,Элемент);	
			
		ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
			
			ЗначениеОтбора  = Новый Структура("ВидОперации", ПолучитьДанныеПеречисления("ВидыОперацийЗаказПокупателя","ЗаказНаряд"));
			ЗначениеОтбора.Вставить("Контрагент",Объект.Контрагент);
			пПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);   
			Форма = ОткрытьФорму("Документ.ЗаказПокупателя.ФормаВыбора",пПараметрыВыбора,Элемент);
		//Паганини#OneSoft_
		ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.КорректировкаРеализации") Тогда 
			
			ЗначениеОтбора  = Новый Структура;
			ЗначениеОтбора.Вставить("Контрагент",Объект.Контрагент);
			пПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);   
			Форма = ОткрытьФорму("Документ.КорректировкаРеализации.ФормаВыбора",пПараметрыВыбора,Элемент);
		//_Паганини#OneSoft
			
		// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
		ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.ЧекККМ") Тогда			
			Форма = ОткрытьФорму("Документ.ЧекККМ.ФормаВыбора",, Элемент);
		// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
		
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры
