
&НаКлиенте
Процедура ОткрытьШаблоныЗаполнения(Команда)
	
	ОткрытьФорму("Справочник.ШаблоныЗаполнения.ФормаВыбора",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьСнятьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьСнятьФлажки(Истина); 
КонецПроцедуры

//&НаСервере
&НаКлиенте
Процедура УстановитьСнятьФлажки(знч_Загружать)
	
	//Малышев 2024-09-19 ONESOFT-3464 (--
	//AccountMovement = Объект.ТаблицаВыписки;
	//Для Каждого Стр Из AccountMovement Цикл
	//	Если знч_Загружать И ЗначениеЗаполнено(Стр._ШаблонЗаполнения) Тогда 
	//		Стр._Загружать = знч_Загружать;
	//	Иначе 
	//		Стр._Загружать = знч_Загружать;
	//	КонецЕсли;
	//КонецЦикла;  
	
	Для каждого стрВыписки из Объект.ТаблицаВыписки Цикл
		Если Элементы.ТаблицаВыписки.ПроверитьСтроку(стрВыписки.ПолучитьИдентификатор()) ТОгда
			Если знч_Загружать И ЗначениеЗаполнено(стрВыписки._ШаблонЗаполнения) Тогда 
				стрВыписки._Загружать = знч_Загружать;
			Иначе 
				стрВыписки._Загружать = знч_Загружать;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	//Малышев 2024-09-19 ONESOFT-3464 --)
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Оповещение	= Новый ОписаниеОповещения("ВариантЗагрузкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ПомощникЗагрузкиБанковскойВыписки.Форма.ФормаВариантаЗагрузки", ,ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ВариантЗагрузкиЗавершение(СтруктураВыбора, Параметры) Экспорт
	
	Если СтруктураВыбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если СтруктураВыбора.Отмена Тогда 
		Возврат;
	КонецЕсли;
	
	ДатаНачала 		= СтруктураВыбора.ДатаНачала;
	ДатаОкончания 	= СтруктураВыбора.ДатаОкончания;     
	
	Если СтруктураВыбора.ВариантЗагрузки = 0 Тогда
		
		ЗагрузитьЧерезПодключениеКБанку();	
		
	Иначе 
		 Объект.ПутьКФайлу = СтруктураВыбора.ПутьКФайлу;
		 ЗагрузитьИзФайлаXLSНаКлиенте(Объект.ПутьКФайлу, 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЧерезПодключениеКБанку()
	
	Если BOG Тогда
		
		Если НЕ ЗначениеЗаполнено(НомерСчета) Тогда 
			ТекстСообщения = НСтр("ru = 'Заполните банковский счет!'; ka = 'შეავსეთ თქვენი საბანკო ანგარიში!'; en = 'Fill out your bank account!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);    
			Возврат;
		КонецЕсли;
		
		Токен = ИнтеграцияСБанком_НаСервере.ПолучитьТокенИзБазы("BAGAGE22"); 
		
		Если ЗначениеЗаполнено(Токен) Тогда     
			
			ИмяМетода = "api/statement/";   
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("currency", Валюта);
			ПараметрыЗапроса.Вставить("accountNumber", Сред(НомерСчета, 1, 22));
			ПараметрыЗапроса.Вставить("startDate", Строка(Формат(НачалоДня(ДатаНачала),"ДФ='yyyy-MM-dd'")));
			ПараметрыЗапроса.Вставить("endDate", Строка(Формат(КонецДня(ДатаОкончания),"ДФ='yyyy-MM-dd'")));
			
			IDИКоличествоСтрок = ВыполнитьМетодСервисаНаСервере(ИмяМетода, ПараметрыЗапроса, Токен);
			
			IDВыпискиПолучен = ЛОЖЬ;
			Если Не IDИКоличествоСтрок = Неопределено Тогда 
				IDВыписки = СтрЗаменить(IDИКоличествоСтрок.ID, ",", "");
				КоличествоСтрок  = СтрЗаменить(IDИКоличествоСтрок.Count, ",", "");
				IDВыпискиПолучен = Истина;
				НомерСтраницы = ?(Цел(КоличествоСтрок / 1000) < КоличествоСтрок / 1000, Цел(КоличествоСтрок / 1000) + 1, Цел(КоличествоСтрок / 1000));
				ПоследняяСтраница = НомерСтраницы;
			КонецЕсли;
			
			Если НомерСтраницы <> 0 И НомерСтраницы <> Неопределено ИЛИ IDВыпискиПолучен И IDИКоличествоСтрок <> Неопределено Тогда 
				ЗаполнитьТЧВыписки(Токен);		
			КонецЕсли;
			
		Иначе
			Оповещение	= Новый ОписаниеОповещения("ЗагрузкаВыпискиПослеАвторизации", ЭтотОбъект);
			ОткрытьФорму("Обработка.ИнтеграцияСБанком.Форма.ФормаАвторазации2", Новый Структура("ИзДокумента", Истина),	ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	ИначеЕсли TBC Тогда
		
		БанковскийСчетПриИзмененииНаСервере();
		
		ТекущийПользователь	= ИнтеграцияСБанком_НаСервере.АвторизованныйПользователь();
		
		ПараметрыСоединенияТБС = ИнтеграцияСБанкомTBC_КлиентСервер.ПолучитьПараметрыСоединенияТБС(ТекущийПользователь);
		
		СтруктураФильтра = Новый Структура;
		
		СтруктураФильтра.Вставить("accountNumber", Сред(НомерСчета, 1, 22));
		СтруктураФильтра.Вставить("accountCurrencyCode",Валюта);
		СтруктураФильтра.Вставить("periodFrom", НачалоДня(ДатаНачала));
		СтруктураФильтра.Вставить("periodTo", КонецДня(ДатаОкончания));
		
		СтруктураПарметровЗапросаВБанк = Новый Структура();
		СтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода","GetAccountMovements");
		СтруктураПарметровЗапросаВБанк.Вставить("ФильтраЗапроса", СтруктураФильтра);
		
		Если ПараметрыСоединенияТБС.TBC_ИспользоватьСертификат Тогда
			
			ПараметрыСоединенияТБС.Nonce = "1111";
			ПолучитьБанковскуюВыпискуИзTBC(ПараметрыСоединенияТБС,СтруктураПарметровЗапросаВБанк);
			
		Иначе
			
			ДополнительныеПараметрыОповещения = Новый Структура();
			ДополнительныеПараметрыОповещения.Вставить("ПараметрыСоединенияТБС",ПараметрыСоединенияТБС);
			ДополнительныеПараметрыОповещения.Вставить("СтруктураПарметровЗапросаВБанк",СтруктураПарметровЗапросаВБанк);
			
			Подсказка = НСтр("ru = 'Интеграция с TBC: Введите пароль DigiPass'; ka = 'TBC ინტეგრაცია: შეიყვანეთ DigiPass –ის პაროლი'; en = 'TBC Integration: Enter your DigiPass password'");
			ОповещениеВводаСтроки = Новый ОписаниеОповещения("ЗавершениеВводаПароляDigiPass", ЭтотОбъект, ДополнительныеПараметрыОповещения);
			ПоказатьВводСтроки(ОповещениеВводаСтроки,,Подсказка,,ИСТИНА);
			
		КонецЕсли;
		
	ИначеЕсли ProCredit Тогда 
		БанковскийСчетПриИзмененииНаСервере();
		ТекущийПользователь	= ИнтеграцияСБанком_НаСервере.АвторизованныйПользователь();
		ПараметрыСоединенияProCredit = ИнтеграцияСБанкомProCredit_КлиентСервер.ПолучитьПараметрыСоединенияProCredit(ТекущийПользователь);     
		Токен = ИнтеграцияСБанком_НаСервере.ПолучитьТокенИзБазы("MIBGGE22");
		Если НЕ ЗначениеЗаполнено(Токен) Тогда
			СтруктураAuthToken = ИнтеграцияСБанкомProCredit_КлиентСервер.ПолучитьAuthToken(ПараметрыСоединенияProCredit);   
			Если НЕ СтруктураAuthToken.Успешно Тогда 
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Ошибка авторизации AuthToken'; ka = 'AuthToken ავტორიზაციის შეცდომა'; en = 'AuthToken authorization error'"+СтруктураAuthToken.Описание+"ru = 'Ошибка авторизации AuthToken'; ka = 'AuthToken ავტორიზაციის შეცდომა'; en = 'AuthToken authorization error'"+СтруктураAuthToken.Описание+"'");
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли;
			ПараметрыСоединенияProCredit.Вставить("AuthToken", СтруктураAuthToken.ВозвращаемоеЗначение);
		Иначе
			ПараметрыСоединенияProCredit.Вставить("AccessToken", Токен);
		КонецЕсли;
		СтруктураФильтра = Новый Структура;
		СтруктураФильтра.Вставить("accountNumber", Сред(НомерСчета, 1, 22));
		СтруктураФильтра.Вставить("accountCurrencyCode",Валюта);
		СтруктураФильтра.Вставить("periodFrom", НачалоДня(ДатаНачала));
		СтруктураФильтра.Вставить("periodTo", КонецДня(ДатаОкончания));
		СтруктураПарметровЗапросаВБанк = Новый Структура();
		СтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода","GetAccountStatment"); 
		СтруктураПарметровЗапросаВБанк.Вставить("ИмяСервиса","/api/Statement/GetStatement");
		СтруктураПарметровЗапросаВБанк.Вставить("ФильтраЗапроса", СтруктураФильтра);
		ДополнительныеПараметрыОповещения = Новый Структура();
		ДополнительныеПараметрыОповещения.Вставить("ПараметрыСоединенияProCredit",ПараметрыСоединенияProCredit);
		ДополнительныеПараметрыОповещения.Вставить("СтруктураПарметровЗапросаВБанк",СтруктураПарметровЗапросаВБанк);
		Если ЗначениеЗаполнено(Токен) Тогда  
			ИнтеграцияСБанкомProCredit_КлиентСервер.ВыполнитьЗапросВБанк(ПараметрыСоединенияProCredit, СтруктураПарметровЗапросаВБанк);
			ОбработатьРезультатыПолученияБанковскойВыпискиИзProCredit(СтруктураПарметровЗапросаВБанк);
		Иначе     
			Подсказка = НСтр("ru = 'Интеграция с ProCredit: Введите пароль OTP'; ka = 'ProCredit ინტეგრაცია: შეიყვანეთ OTP –ის პაროლი'; en = 'Integration with ProCredit: Enter OTP password'");
			ОповещениеВводаСтроки = Новый ОписаниеОповещения("ЗавершениеВводаПароляOTP", ЭтотОбъект, ДополнительныеПараметрыОповещения);
			ПоказатьВводСтроки(ОповещениеВводаСтроки,,Подсказка,,ИСТИНА);
		КонецЕсли;    
		
	КонецЕсли;
	
	
КонецПроцедуры // ЗагрузитьИзТаблицы()


&НаСервере
Функция ВыполнитьМетодСервисаНаСервере(ИмяМетода, ПараметрыЗапроса, Токен)
	
	ТестовыйРежим = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(),"ИспользоватьТестовыйРежимBOG");
	
	МенеджерИнтеграцииСБанком = Обработки.ИнтеграцияСБанком;
	
	Возврат МенеджерИнтеграцииСБанком.ВыполнитьМетодСервиса(ИмяМетода, ПараметрыЗапроса, , Токен, НЕ ТестовыйРежим); 
	
КонецФункции

&НаКлиенте
Процедура ЗагрузкаВыпискиПослеАвторизации(Токен, Параметры) Экспорт
	
	Если Токен = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Токен) Тогда

		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("currency", Валюта);
		ПараметрыЗапроса.Вставить("accountNumber", Сред(НомерСчета, 1, 22));
		ПараметрыЗапроса.Вставить("startDate", Строка(Формат(НачалоДня(ДатаНачала),"ДФ='yyyy-MM-dd'")));
		ПараметрыЗапроса.Вставить("endDate", Строка(Формат(КонецДня(ДатаОкончания),"ДФ='yyyy-MM-dd'")));
		
		IDИКоличествоСтрок = Неопределено;
		ОтправитьНаСервере(ПараметрыЗапроса, Токен, IDИКоличествоСтрок);
		
		IDВыпискиПолучен = ЛОЖЬ;
		Если Не IDИКоличествоСтрок = Неопределено Тогда 
			IDВыписки = СтрЗаменить(IDИКоличествоСтрок.ID, ",", "");
			КоличествоСтрок  = СтрЗаменить(IDИКоличествоСтрок.Count, ",", "");
			IDВыпискиПолучен = Истина;
			НомерСтраницы = ?(Цел(КоличествоСтрок / 1000) < КоличествоСтрок / 1000, Цел(КоличествоСтрок / 1000) + 1, Цел(КоличествоСтрок / 1000));
			ПоследняяСтраница = НомерСтраницы;
		КонецЕсли;
		
		Если НомерСтраницы <> 0 И НомерСтраницы <> Неопределено ИЛИ IDВыпискиПолучен И IDИКоличествоСтрок <> Неопределено Тогда 
			ЗаполнитьТЧВыписки(Токен);		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТЧВыписки(Токен)	
	
	МенеджерОбработки = Обработки.ИнтеграцияСБанком;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("currency", Валюта);
	ПараметрыЗапроса.Вставить("accountNumber", Сред(НомерСчета, 1, 22));
	ПараметрыЗапроса.Вставить("id", IDВыписки);
	ПараметрыЗапроса.Вставить("page", НомерСтраницы);
	
	МассивЗаписей = МенеджерОбработки.ВыполнитьМетодСервиса("api/statement////", ПараметрыЗапроса, 0, Токен, Истина);
	
	Объект.ТаблицаВыписки.Очистить();
	
	Объект.ТаблицаВыписки.Очистить();
	врТаблицаВыписки = Объект.ТаблицаВыписки.Выгрузить();
	врТаблицаВыпискиШ =  врТаблицаВыписки.Скопировать();
    МассивУдаления = Новый Массив;
	
	Если Не МассивЗаписей = Неопределено Тогда 
		Если МассивЗаписей.Количество() > 0 Тогда 
			
			Для Каждого ЭлементМассива ИЗ МассивЗаписей Цикл
				
				НоваяСтрокаТЧ = Объект.ТаблицаВыписки.Добавить();
				
				Если НЕ ЭлементМассива.Получить("EntryAmountDebit") = 0 Тогда  
					НоваяСтрокаТЧ.Наименование                    	= ЭлементМассива.Получить("BeneficiaryDetails").Получить("Name");
					НоваяСтрокаТЧ.СчетБанк           				= ЭлементМассива.Получить("BeneficiaryDetails").Получить("AccountNumber");
					НоваяСтрокаТЧ.ИНН                     			= ЭлементМассива.Получить("BeneficiaryDetails").Получить("Inn");       
				ИначеЕсли НЕ ЭлементМассива.Получить("EntryAmountCredit") = 0 Тогда
					НоваяСтрокаТЧ.Наименование                    	= ЭлементМассива.Получить("SenderDetails").Получить("Name");
					НоваяСтрокаТЧ.СчетБанк           				= ЭлементМассива.Получить("SenderDetails").Получить("AccountNumber");
					НоваяСтрокаТЧ.ИНН                     			= ЭлементМассива.Получить("SenderDetails").Получить("Inn"); 
				КонецЕсли;
				
				НоваяСтрокаТЧ.Комментарий                		= ЭлементМассива.Получить("DocumentInformation");
				НоваяСтрокаТЧ.НазначениеПлатежа                 = ЭлементМассива.Получить("DocumentNomination"); 
				НоваяСтрокаТЧ.ТипТранзакцийБВ               	= ЭлементМассива.Получить("DocumentProductGroup");
				НоваяСтрокаТЧ.ТипОперации               		= ЭлементМассива.Получить("DocumentProductGroup");
				НоваяСтрокаТЧ.КодКазначейство               	= ЭлементМассива.Получить("DocumentTreasuryCode");
				НоваяСтрокаТЧ.СуммаКт                  			= ЭлементМассива.Получить("EntryAmountCredit");
				НоваяСтрокаТЧ.СуммаДт				     		= ЭлементМассива.Получить("EntryAmountDebit");
				НоваяСтрокаТЧ.Дата                         		= ПереводВДату(ЭлементМассива.Получить("EntryDate"));
				НоваяСтрокаТЧ.НомерДокумента                	= ЭлементМассива.Получить("EntryDocumentNumber");
				НоваяСтрокаТЧ.ID			                 	= ЭлементМассива.Получить("EntryId"); 
				НоваяСтрокаТЧ.ДополнительноеЗначение           	= ЭлементМассива.Получить("EntryComment");
				НоваяСтрокаТЧ.Валюта           					= ЭлементМассива.Получить("DocumentSourceCurrency"); //+++ Дмгг, 11.04.2025, ONESOFT-3973
				
				Если ЗначениеЗаполнено(НоваяСтрокаТЧ.СуммаДт) Тогда 
					НоваяСтрокаТЧ.НаименованиеДт = НоваяСтрокаТЧ.Наименование;
					НоваяСтрокаТЧ.ИННДт = НоваяСтрокаТЧ.ИНН;
					НоваяСтрокаТЧ.СчетБанкДт = НоваяСтрокаТЧ.СчетБанк;
				ИначеЕсли ЗначениеЗаполнено(НоваяСтрокаТЧ.СуммаКт) Тогда 
					НоваяСтрокаТЧ.НаименованиеКт = НоваяСтрокаТЧ.Наименование;
					НоваяСтрокаТЧ.ИННКт = НоваяСтрокаТЧ.ИНН;
					НоваяСтрокаТЧ.СчетБанкКт = НоваяСтрокаТЧ.СчетБанк;
				КонецЕсли; 
				
				Если НоваяСтрокаТЧ.Дата = "" 
					Или Не ЗначениеЗаполнено(НоваяСтрокаТЧ.Дата) 
					Или НоваяСтрокаТЧ.Дата = "ამონაწერი" 
					Или НоваяСтрокаТЧ.Дата = "თარიღი"	Тогда 
					МассивУдаления.Добавить(НоваяСтрокаТЧ);
					Продолжить;
				ИначеЕсли ЗначениеЗаполнено(НоваяСтрокаТЧ.СуммаДт) Тогда 
					НоваяСтрокаТЧ.Наименование = НоваяСтрокаТЧ.НаименованиеДт;
					НоваяСтрокаТЧ.ИНН = НоваяСтрокаТЧ.ИННДт;
					НоваяСтрокаТЧ.СчетБанк = НоваяСтрокаТЧ.СчетБанкДт;
				ИначеЕсли ЗначениеЗаполнено(НоваяСтрокаТЧ.СуммаКт) Тогда 
					НоваяСтрокаТЧ.Наименование = НоваяСтрокаТЧ.НаименованиеКт;
					НоваяСтрокаТЧ.ИНН = НоваяСтрокаТЧ.ИННКт;
					НоваяСтрокаТЧ.СчетБанк = НоваяСтрокаТЧ.СчетБанкКт;
				КонецЕсли;
				врТаблицаВыпискиШ.Очистить();
				СтрокаВыпискиШ = врТаблицаВыпискиШ.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаВыпискиШ,НоваяСтрокаТЧ);
				НоваяСтрокаТЧ._ШаблонЗаполнения = СоответствоватьШаблонЗаполнения(врТаблицаВыпискиШ);
				//+++ Дмгг, 11.04.2025, ONESOFT-3973
				//ИскатьКонтрагента = Истина;
				//ИскатьСотрудника = Ложь; 
				//
				//Если ЗначениеЗаполнено(НоваяСтрокаТЧ._ШаблонЗаполнения) 
				//	И (НоваяСтрокаТЧ._ШаблонЗаполнения.СсылкаИсточника = "ВыплатаЗарплаты"
				//	И (НоваяСтрокаТЧ._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.ВыплатаАванса  
				//	ИЛИ НоваяСтрокаТЧ._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.ВыплатаЗарплаты
				//	ИЛИ НоваяСтрокаТЧ._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.НачислениеИВыплатаЗарплаты))
				//	ИЛИ НоваяСтрокаТЧ._ШаблонЗаполнения.СсылкаИсточника = "ПеремещениеДенежныхСредств" Тогда 
				//	
				//	ИскатьКонтрагента = Ложь;
				//	ИскатьСотрудника = Истина;
				//	
				//КонецЕсли;
				
				ИскатьКонтрагента = Истина;
				ИскатьСотрудника = Ложь; 
				ИскатьОрганизацию = Ложь;
				Если ЗначениеЗаполнено(НоваяСтрокаТЧ._ШаблонЗаполнения) 
					И (НоваяСтрокаТЧ._ШаблонЗаполнения.СсылкаИсточника = "ВыплатаЗарплаты"
					И (НоваяСтрокаТЧ._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.ВыплатаАванса  
					ИЛИ НоваяСтрокаТЧ._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.ВыплатаЗарплаты
					ИЛИ НоваяСтрокаТЧ._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.НачислениеИВыплатаЗарплаты))    
					//+++ Дмгг, 16.06.2025, ONESOFT-4128
					//ИЛИ НоваяСтрокаТЧ._ШаблонЗаполнения.СсылкаИсточника = "ПеремещениеДенежныхСредств" Тогда   
					ИЛИ (НоваяСтрокаТЧ._ШаблонЗаполнения.СсылкаИсточника = "РасходСоСчета" 
						И НоваяСтрокаТЧ._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику)
					ИЛИ (НоваяСтрокаТЧ._ШаблонЗаполнения.СсылкаИсточника = "ПостуалениеНаСчет"                            
						 И НоваяСтрокаТЧ._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника) 
					Тогда    
					//--- Дмгг, 16.06.2025, ONESOFT-4128
					ИскатьКонтрагента = Ложь;
					ИскатьСотрудника = Истина;
					ИскатьОрганизацию = Ложь;
				ИначеЕсли ЗначениеЗаполнено(НоваяСтрокаТЧ._ШаблонЗаполнения) 
					И (НоваяСтрокаТЧ._ШаблонЗаполнения.СсылкаИсточника = "Конвертация"
					ИЛИ (НоваяСтрокаТЧ.Курс <> 1 И НоваяСтрокаТЧ.Курс <> 0)) Тогда
					
					ИскатьКонтрагента = Ложь;
					ИскатьСотрудника = Ложь;
					ИскатьОрганизацию = Истина;
					
				ИначеЕсли ЗначениеЗаполнено(НоваяСтрокаТЧ._ШаблонЗаполнения) 
					И ((НоваяСтрокаТЧ._ШаблонЗаполнения.СсылкаИсточника = "РасходСоСчета"
					И НоваяСтрокаТЧ._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
					ИЛИ (НоваяСтрокаТЧ._ШаблонЗаполнения.СсылкаИсточника = "ПоступлениеНаСчет"
					И НоваяСтрокаТЧ._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПереводСДругогоСчета)) Тогда
					
					ИскатьКонтрагента = Ложь;
					ИскатьСотрудника = Ложь;
					ИскатьОрганизацию = Истина;
					
				КонецЕсли;
				//+++ Дмгг, 11.04.2025, ONESOFT-3973
				//+++ Дмгг, 10.04.2025, ONESOFT-3973
				ДопТекстПеремещения = "";
				Если ЗначениеЗаполнено(Объект.ДатаНачалаИспользованияНовыхIDПеремещений) И НоваяСтрокаТЧ.Дата >= Объект.ДатаНачалаИспользованияНовыхIDПеремещений Тогда
					Если НоваяСтрокаТЧ._ШаблонЗаполнения.СсылкаИсточника = "РасходСоСчета" И НоваяСтрокаТЧ._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет
						И НЕ НоваяСтрокаТЧ._ШаблонЗаполнения.Перемещение Тогда 
						
						ДопТекстПеремещения = "Expense";
						
					ИначеЕсли НоваяСтрокаТЧ._ШаблонЗаполнения.СсылкаИсточника = "ПоступлениеНаСчет" И НоваяСтрокаТЧ._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПереводСДругогоСчета
						И НЕ НоваяСтрокаТЧ._ШаблонЗаполнения.Перемещение Тогда
						
						ДопТекстПеремещения = "Receipt";
						
					КонецЕсли;
				КонецЕсли;
				//--- Дмгг, 10.04.2025, ONESOFT-3973
				
				пИНН = СтрЗаменить(НоваяСтрокаТЧ.ИНН, " ", "");//Паганини
				НоваяСтрокаТЧ.ID = 
				НоваяСтрокаТЧ.Ключ 
				+ "_" + Лев(НоваяСтрокаТЧ.Дата, 10) 
				+ "_" + пИНН//СтрокаВыписки.ИНН 
				+ "_" + НоваяСтрокаТЧ.НомерДокумента 
				+ ?(ЗначениеЗаполнено(НоваяСтрокаТЧ.СуммаДт), "_" + Строка(НоваяСтрокаТЧ.СуммаДт), "")
				+ ?(ЗначениеЗаполнено(НоваяСтрокаТЧ.СуммаКт), "_-" + Строка(НоваяСтрокаТЧ.СуммаКт), "") 
				//+ "_" + НоваяСтрокаТЧ.НазначениеПлатежа; 
				+ "_" + НоваяСтрокаТЧ.НазначениеПлатежа + ДопТекстПеремещения; //+++ Дмгг, 10.04.2025, ONESOFT-3973               
				
				НоваяСтрокаТЧ.НомерДокумента = СокрЛП(СтрЗаменить(СтрЗаменить(НоваяСтрокаТЧ.НомерДокумента, " ", ""), Символы.НПП, ""));
				
				НоваяСтрокаТЧ.ID_Новый = Лев(НоваяСтрокаТЧ.Дата, 10) 
				+ "_" + НоваяСтрокаТЧ.НомерДокумента 
				//+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаДт), "_" + Строка(СтрокаВыписки.СуммаДт), "")
				+ ?(НоваяСтрокаТЧ.ТипОперации = "CCO", "_", ?(НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ.СуммаДт),?(ЗначениеЗаполнено(НоваяСтрокаТЧ.СуммаКт), "_" + Строка(НоваяСтрокаТЧ.СуммаКт), ""), "_" + НоваяСтрокаТЧ.СуммаДт))
				//+ "_" + НоваяСтрокаТЧ.НазначениеПлатежа;
				+ "_" + НоваяСтрокаТЧ.НазначениеПлатежа + ДопТекстПеремещения; //+++ Дмгг, 10.04.2025, ONESOFT-3973
				
				// Поиск ранее обработанного документа
				Если СтрДлина(НоваяСтрокаТЧ.Комментарий)>0 Тогда
					
					ПозицияПервогоРазлелителя = СтрНайти(НоваяСтрокаТЧ.Комментарий,"##",НаправлениеПоиска.СНачала,,1);
					ПозицияВторогоРазлелителя = СтрНайти(НоваяСтрокаТЧ.Комментарий,"##",НаправлениеПоиска.СНачала,,2);
					Если ПозицияПервогоРазлелителя>0 И ПозицияВторогоРазлелителя>0 Тогда
						
						СтрокаУникальныйИдентификатор = СРЕД(НоваяСтрокаТЧ.Комментарий,ПозицияПервогоРазлелителя+2,36);
						
						НоваяСтрокаТЧ._СсылкаНаДокумент  = ПолучитьСсылкуНаДокументПоУникальномуИдентификатору(СтрокаУникальныйИдентификатор);
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ._СсылкаНаДокумент) Тогда
					
					НоваяСтрокаТЧ._СсылкаНаДокумент  				= Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиДокументПоИД(НоваяСтрокаТЧ.ID);
					
					Если НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ._СсылкаНаДокумент) 
						И (
						//ЗначениеЗаполнено(НоваяСтрокаТЧ._ШаблонЗаполнения)
						//И 
						ЗначениеЗаполнено(НоваяСтрокаТЧ.Дата)
						И ЗначениеЗаполнено(НоваяСтрокаТЧ.НомерДокумента))
						Тогда
						
						НоваяСтрокаТЧ._СсылкаНаДокумент  			= Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиДокументПоШаблонуДатеИНомеру(НоваяСтрокаТЧ._ШаблонЗаполнения,НоваяСтрокаТЧ.Дата,НоваяСтрокаТЧ.НомерДокумента,НоваяСтрокаТЧ.СуммаКт,НоваяСтрокаТЧ.СуммаДт);	
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ._СсылкаНаДокумент) Тогда
					НоваяСтрокаТЧ._СсылкаНаДокумент  = Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиВРегистреКлючДокументаИнтернетБанка(НоваяСтрокаТЧ.ID_Новый);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(НоваяСтрокаТЧ._СсылкаНаДокумент) Тогда 
					НоваяСтрокаТЧ.ДокументПроведен  = НоваяСтрокаТЧ._СсылкаНаДокумент.Проведен; 
				КонецЕсли;
				
				
				Если ЗначениеЗаполнено(НоваяСтрокаТЧ.КодКазначейство) Тогда    
					
					НоваяСтрокаТЧ.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(НоваяСтрокаТЧ.КодКазначейство);
					
					Если ЗначениеЗаполнено(НоваяСтрокаТЧ.СчетКонтрагента1С) Тогда 
						 НоваяСтрокаТЧ.Контрагент1С = НоваяСтрокаТЧ.СчетКонтрагента1С.Владелец;
					 КонецЕсли;
					 
				 Иначе
					 
					 Если ИскатьКонтрагента Тогда     
						 Если ЗначениеЗаполнено(СокрЛП(НоваяСтрокаТЧ.ИНН)) Тогда 
							 НоваяСтрокаТЧ.Контрагент1С	= НайтиКонтрагента(НоваяСтрокаТЧ.ИНН, НоваяСтрокаТЧ.Наименование);    
							 НоваяСтрокаТЧ.Подотчетник1С	= Справочники.Сотрудники.ПустаяСсылка();      
						 Иначе              
							 НоваяСтрокаТЧ.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(НоваяСтрокаТЧ.СчетБанк, "Контрагенты");
							 Если ЗначениеЗаполнено(НоваяСтрокаТЧ.СчетКонтрагента1С) Тогда       
								 НоваяСтрокаТЧ.Контрагент1С	= НоваяСтрокаТЧ.СчетКонтрагента1С.Владелец;    
								 НоваяСтрокаТЧ.Подотчетник1С	= Справочники.Сотрудники.ПустаяСсылка();  
							 КонецЕсли;
						 КонецЕсли;
					 ИначеЕсли ИскатьСотрудника Тогда  
						 Если ЗначениеЗаполнено(СокрЛП(НоваяСтрокаТЧ.ИНН)) Тогда 
							 НоваяСтрокаТЧ.Контрагент1С	=  Справочники.Контрагенты.ПустаяСсылка();
							 НоваяСтрокаТЧ.Подотчетник1С  = НайтиПодотчетника(НоваяСтрокаТЧ.ИНН);      
						 Иначе              
							 НоваяСтрокаТЧ.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(НоваяСтрокаТЧ.СчетБанк, "Сотрудники");
							 Если ЗначениеЗаполнено(НоваяСтрокаТЧ.СчетКонтрагента1С) Тогда       
								 НоваяСтрокаТЧ.Контрагент1С	= Справочники.Контрагенты.ПустаяСсылка();    
								 НоваяСтрокаТЧ.Подотчетник1С	= НоваяСтрокаТЧ.СчетКонтрагента1С.Владелец;  
							 КонецЕсли;
						 КонецЕсли;
					 //+++ Дмгг, 11.04.2025, ONESOFT-3973
					 ИначеЕсли ИскатьОрганизацию Тогда	 
						 НоваяСтрокаТЧ.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(НоваяСтрокаТЧ.СчетБанк, "", НоваяСтрокаТЧ.Валюта);
					 //--- Дмгг, 11.04.2025, ONESOFT-3973
					 КонецЕсли; 

					 Если НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ.СчетКонтрагента1С) Тогда 
						 ВладелецСчета = Неопределено;
						 Если ЗначениеЗаполнено(НоваяСтрокаТЧ.Контрагент1С) Тогда     
							 ВладелецСчета = НоваяСтрокаТЧ.Контрагент1С;
						 ИначеЕсли ЗначениеЗаполнено(НоваяСтрокаТЧ.Подотчетник1С) Тогда       
							 ВладелецСчета = НоваяСтрокаТЧ.Подотчетник1С;
						 Иначе    
							 ВладелецСчета = объект.Организация;
						 КонецЕсли;   
						 
						 НоваяСтрокаТЧ.СчетКонтрагента1С = НайтиСчет(ВладелецСчета,НоваяСтрокаТЧ.СчетБанк);
					 КонецЕсли;
				 КонецЕсли;
				 
			 КонецЦикла;			
		Иначе 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Для страницы №" + НомерСтраницы + " не найдено записей.'; ka = 'გვერდისთვის № " + НомерСтраницы + " ჩანაწერები ვერ მოიძებნა.'");
			Сообщение.Сообщить();	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаXLSНаКлиенте(АдресФайла, ВариантЗагрузки = 0)
	
	
	Если не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;

	Попытка
		Excel = Новый COMОбъект("Excel.Application");
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Похоже, Excel на компьютере не установлен. Необходимо выполнить установку/переустановку Excel.");
		Возврат;
	КонецПопытки;     
	
	Excel.Workbooks.Open(АдресФайла);
	Книга = Excel.ActiveWorkbook; 

	//ФормаЗаставка =	ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация", Новый Структура("ИдентификаторЗадания, ТекстСообщения", Неопределено, ""), Неопределено);


	
    МассивРеквизитовФайла = Новый СписокЗначений;
	ВысотаШапкиСДанными = 1;
	
	Если BOG Тогда
		Лист = Книга.Worksheets(1);
		ВысотаШапкиСДанными = 10;
	ИначеЕсли TBC Тогда 
		Лист = Книга.Worksheets(2);
		МассивРеквизитовФайла.Добавить(Книга.Worksheets(1).UsedRange.Value.Выгрузить());
	ИначеЕсли CARTU Тогда 
		Лист = Книга.Worksheets(2);
		МассивРеквизитовФайла.Добавить(Книга.Worksheets(1).UsedRange.Value.Выгрузить());
	ИначеЕсли VTB Тогда 
		Лист = Книга.Worksheets(1); 
		ВысотаШапкиСДанными = 10;
	ИначеЕсли ProCredit Тогда 
		Лист = Книга.Worksheets(1);
		ВысотаШапкиСДанными = 10;
	КонецЕсли;
	
	ArrExcel = Лист.UsedRange.Value.Выгрузить();
    Excel.quit();
	Excel.Application.Quit();
	
	//Malyshev 2024-05-23 ONESOFT-3149
	Отказ = Ложь;
	Если не НайтиНомерБанковскогоСчета(Объект.БанковскийСчет, МассивРеквизитовФайла, ArrExcel, ВысотаШапкиСДанными) Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Выписка не относится к счету '; ka = 'არჩეული საბანკო ანგარიში არ შეესაბამება ფაილში არსებულს! გთხოვთ გადაირჩიოთ ანგარიში ან ფაილი'; en = 'This document not for bank '") + Объект.БанковскийСчет;
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;	
	
	Если не Отказ Тогда	
		ЗагрузитьНаСервере(ArrExcel, ВариантЗагрузки);
	КонецЕсли;	
	
	//ФормаЗаставка.Закрыть();

КонецПроцедуры 

&НаСервереБезКонтекста
Функция НайтиНомерБанковскогоСчета(БанковскийСчет, МассивРеквизитовФайла, МассивДляВыписки, ВысотаШапкиСДанными = 1)
	
	НомерСчетаНайден = Ложь;
	НомерСчетаСтрокой = СокрЛП(БанковскийСчет.НомерСчета); 
	
	//Ищем на странце с реквизитами
	Если МассивРеквизитовФайла.Количество()>0 тогда
		
		НомерСчетаНайден = Ложь;		
		Для каждого СтрокаРеквизитов из МассивРеквизитовФайла Цикл
			Для каждого МассивКолонки из СтрокаРеквизитов.Значение Цикл
				Для каждого ЭлементШапки из МассивКолонки Цикл
					Если СтрНайти(СокрЛП(""+ЭлементШапки), НомерСчетаСтрокой)>0 Тогда
						НомерСчетаНайден = Истина;
						//Сообщить("Нашли в шапке на отдельной закладке");
						Возврат НомерСчетаНайден;
					КонецЕсли;	
				КонецЦикла;	
			КонецЦикла;	
		КонецЦикла;	                              
		
	КонецЕсли;
	
	//Ищем на той же странице, где данные
	Если не НомерСчетаНайден Тогда   
		
		Для каждого МассивКолонки из МассивДляВыписки Цикл
			НПП = 0;
			Для каждого ЭлементШапки из МассивКолонки Цикл
				НПП = НПП + 1;
				Если СтрНайти(СокрЛП(""+ЭлементШапки), НомерСчетаСтрокой)>0 Тогда
					НомерСчетаНайден = Истина;
					//Сообщить("Нашли в данных");
					Возврат НомерСчетаНайден;
				КонецЕсли;	  
				Если НПП>ВысотаШапкиСДанными Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
		КонецЦикла;			
	КонецЕсли;	
	

	Возврат НомерСчетаНайден;		

КонецФункции // НайтиНомерБанковскогоСчета()



&НаСервере
Процедура ЗагрузитьНаСервере(ArrExcel, ВариантЗагрузки)
	
	Если BOG Тогда
		BOG_ЗагрузитьНаСервере(ArrExcel,Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia, ВариантЗагрузки);
	КонецЕсли;
	
	Если TBC Тогда
		TBC_ЗагрузитьНаСервере(ArrExcel,Перечисления.ТипыОбменаСИнтернетБанком.TBC);
	КонецЕсли;
	
	Если CARTU Тогда
		CARTU_ЗагрузитьНаСервере(ArrExcel,Перечисления.ТипыОбменаСИнтернетБанком.Cartu);
	КонецЕсли;
	
	Если VTB Тогда
		VTB_ЗагрузитьНаСервере(ArrExcel,Перечисления.ТипыОбменаСИнтернетБанком.VTB);
	КонецЕсли;  
	
	Если ProCredit Тогда  //ПроКредит
		ProCredit_ЗагрузитьНаСервере(ArrExcel,Перечисления.ТипыОбменаСИнтернетБанком.ProCredit, Истина);
	КонецЕсли;
	
	ТаблицаВыписки.Загрузить(Объект.ТаблицаВыписки.Выгрузить());
	//Таб.Параметры.УстановитьЗначениеПараметра("Таб", ТаблицаВыписки.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура BOG_ЗагрузитьНаСервере(ArrExcel, ТипОбмена, ВариантЗагрузки)
	
	Если ВариантЗагрузки = 0 Тогда 
		СтруктураКолонок = ПолучитьСтруктуруСоответствииКолонок(ТипОбмена, 0, 0);
	Иначе
		СтруктураКолонок = ПолучитьСтруктуруСоответствииКолонок(ТипОбмена, ArrExcel.Количество(), 1);
	КонецЕсли;
	
	Объект.ТаблицаВыписки.Очистить();
	врТаблицаВыписки = Объект.ТаблицаВыписки.Выгрузить();
	врТаблицаВыпискиШ =  врТаблицаВыписки.Скопировать();
	Для Каждого стр Из ArrExcel[0] Цикл 
		врТаблицаВыписки.Добавить();
	КонецЦикла;
	
	Для каждого стрСтруктури Из СтруктураКолонок Цикл
		стЗначение = стрСтруктури.Значение;
		стКлюч	   = стрСтруктури.Ключ;
		
		Если стКлюч = "НаименованиеКт" Или стКлюч = "НаименованиеДт" Тогда
			//стКлюч = "Наименование";
		ИначеЕсли стКлюч = "ИННКт" Или стКлюч = "ИННДт" Тогда
			//стКлюч = "ИНН";
		ИначеЕсли стКлюч = "СчетБанкКт" Или стКлюч = "СчетБанкДт" Тогда
			//стКлюч = "СчетБанк";
		КонецЕсли;
		Попытка
			врТаблицаВыписки.ЗагрузитьКолонку(ArrExcel[стЗначение-1], стКлюч);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки() +  " колонка " + стЗначение + " с именем " + стКлюч);
		КонецПопытки;
	КонецЦикла;
	
	МассивУдаления = Новый Массив;
	Для каждого СтрокаВыписки Из врТаблицаВыписки Цикл
		Если СтрокаВыписки.Дата = "" 
			Или Не ЗначениеЗаполнено(СтрокаВыписки.Дата) 
			Или СтрокаВыписки.Дата = "ამონაწერი" 
			Или СтрокаВыписки.Дата = "თარიღი"	Тогда 
			МассивУдаления.Добавить(СтрокаВыписки);
			Продолжить;
		ИначеЕсли ЗначениеЗаполнено(СтрокаВыписки.СуммаДт) Тогда 
			СтрокаВыписки.Наименование = СтрокаВыписки.НаименованиеДт;
			СтрокаВыписки.ИНН = СтрокаВыписки.ИННДт;
			СтрокаВыписки.СчетБанк = СтрокаВыписки.СчетБанкДт;
		ИначеЕсли ЗначениеЗаполнено(СтрокаВыписки.СуммаКт) Тогда 
			СтрокаВыписки.Наименование = СтрокаВыписки.НаименованиеКт;
			СтрокаВыписки.ИНН = СтрокаВыписки.ИННКт;
			СтрокаВыписки.СчетБанк = СтрокаВыписки.СчетБанкКт;
		КонецЕсли;
		врТаблицаВыпискиШ.Очистить();
		СтрокаВыпискиШ = врТаблицаВыпискиШ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВыпискиШ,СтрокаВыписки);
		СтрокаВыписки._ШаблонЗаполнения = СоответствоватьШаблонЗаполнения(врТаблицаВыпискиШ);
		//+++ Дмгг, 11.04.2025, ONESOFT-3973
		//ИскатьКонтрагента = Истина;
		//ИскатьСотрудника = Ложь; 
		//
		//Если ЗначениеЗаполнено(СтрокаВыписки._ШаблонЗаполнения) 
		//	И (СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "ВыплатаЗарплаты"
		//	И (
		//		СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.ВыплатаАванса  
		//		ИЛИ СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.ВыплатаЗарплаты
		//		ИЛИ СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.НачислениеИВыплатаЗарплаты
		//	   )
		//	  )
		//	ИЛИ СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "ПеремещениеДенежныхСредств" Тогда 
		//	ИскатьКонтрагента = Ложь;
		//	ИскатьСотрудника = Истина;
		//КонецЕсли;
		
		ИскатьКонтрагента = Истина;
		ИскатьСотрудника = Ложь; 
		ИскатьОрганизацию = Ложь;
		Если ЗначениеЗаполнено(СтрокаВыписки._ШаблонЗаполнения) 
			И (СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "ВыплатаЗарплаты"
			И (СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.ВыплатаАванса  
			ИЛИ СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.ВыплатаЗарплаты
			ИЛИ СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.НачислениеИВыплатаЗарплаты))  
			//+++ Дмгг, 16.06.2025, ONESOFT-4128
			//ИЛИ СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "ПеремещениеДенежныхСредств" Тогда  
			ИЛИ СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "ПеремещениеДенежныхСредств"
			ИЛИ (СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "РасходСоСчета" 
				И СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику)
			ИЛИ (СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "ПостуалениеНаСчет"                            
				И СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника) 
			Тогда    
			//--- Дмгг, 16.06.2025, ONESOFT-4128
			ИскатьКонтрагента = Ложь;
			ИскатьСотрудника = Истина;
			ИскатьОрганизацию = Ложь;
		ИначеЕсли ЗначениеЗаполнено(СтрокаВыписки._ШаблонЗаполнения) 
			И (СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "Конвертация"
			ИЛИ (СтрокаВыписки.Курс <> 1 И СтрокаВыписки.Курс <> 0)) Тогда
			
			ИскатьКонтрагента = Ложь;
			ИскатьСотрудника = Ложь;
			ИскатьОрганизацию = Истина;
			
		ИначеЕсли ЗначениеЗаполнено(СтрокаВыписки._ШаблонЗаполнения) 
			И ((СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "РасходСоСчета"
			И СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
			ИЛИ (СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "ПоступлениеНаСчет"
					И СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПереводСДругогоСчета)) Тогда
			
			ИскатьКонтрагента = Ложь;
			ИскатьСотрудника = Ложь;
			ИскатьОрганизацию = Истина;
			
		КонецЕсли;
		//--- Дмгг, 11.04.2025, ONESOFT-3973
		
		пИНН = СтрЗаменить(СтрокаВыписки.ИНН, " ", "");//Паганини
		
		//+++ Дмгг, 10.04.2025, ONESOFT-3973
		ДопТекстПеремещения = "";
		Если ЗначениеЗаполнено(Объект.ДатаНачалаИспользованияНовыхIDПеремещений) И СтрокаВыписки.Дата >= Объект.ДатаНачалаИспользованияНовыхIDПеремещений Тогда 
			Если СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "РасходСоСчета" И СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет
				И НЕ СтрокаВыписки._ШаблонЗаполнения.Перемещение Тогда 
				
				ДопТекстПеремещения = "Expense";
				
			ИначеЕсли СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "ПоступлениеНаСчет" И СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПереводСДругогоСчета
				И НЕ СтрокаВыписки._ШаблонЗаполнения.Перемещение Тогда
				
				ДопТекстПеремещения = "Receipt";
				
			КонецЕсли;
		КонецЕсли;
		//--- Дмгг, 10.04.2025, ONESOFT-3973
		
		СтрокаВыписки.ID = 	
			СтрокаВыписки.Ключ 
			+ "_" + Лев(СтрокаВыписки.Дата, 10) 
			+ "_" + пИНН//СтрокаВыписки.ИНН 
			+ "_" + СтрокаВыписки.НомерДокумента 
			+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаДт), "_" + Строка(СтрокаВыписки.СуммаДт), "")
			+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаКт), "_-" + Строка(СтрокаВыписки.СуммаКт), "") 
			//+ "_" + СтрокаВыписки.НазначениеПлатежа;
			+ "_" + СтрокаВыписки.НазначениеПлатежа + ДопТекстПеремещения; //+++ Дмгг, 10.04.2025, ONESOFT-3973

		СтрокаВыписки.НомерДокумента = СокрЛП(СтрЗаменить(СтрЗаменить(СтрокаВыписки.НомерДокумента, " ", ""), Символы.НПП, ""));
		
		СтрокаВыписки.ID_Новый = 
			Лев(СтрокаВыписки.Дата, 10) 
			+ "_" + СтрокаВыписки.НомерДокумента 
			//+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаДт), "_" + Строка(СтрокаВыписки.СуммаДт), "")
			+ ?(СтрокаВыписки.ТипОперации = "CCO", "_", ?(НЕ ЗначениеЗаполнено(СтрокаВыписки.СуммаДт),?(ЗначениеЗаполнено(СтрокаВыписки.СуммаКт), "_" + Строка(СтрокаВыписки.СуммаКт), ""), "_" + СтрокаВыписки.СуммаДт))
			//+ "_" + СтрокаВыписки.НазначениеПлатежа;
			+ "_" + СтрокаВыписки.НазначениеПлатежа + ДопТекстПеремещения; //+++ Дмгг, 10.04.2025, ONESOFT-3973
		
		// Поиск ранее обработанного документа
		Если СтрДлина(СтрокаВыписки.Комментарий)>0 Тогда
			ПозицияПервогоРазлелителя = СтрНайти(СтрокаВыписки.Комментарий,"##",НаправлениеПоиска.СНачала,,1);
			ПозицияВторогоРазлелителя = СтрНайти(СтрокаВыписки.Комментарий,"##",НаправлениеПоиска.СНачала,,2);
			Если ПозицияПервогоРазлелителя>0 И ПозицияВторогоРазлелителя>0 Тогда
				СтрокаУникальныйИдентификатор = СРЕД(СтрокаВыписки.Комментарий,ПозицияПервогоРазлелителя+2,36);
				СтрокаВыписки._СсылкаНаДокумент  = ПолучитьСсылкуНаДокументПоУникальномуИдентификатору(СтрокаУникальныйИдентификатор);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) Тогда
			СтрокаВыписки._СсылкаНаДокумент  = Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиДокументПоИД(СтрокаВыписки.ID);
			Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) 
				И (
				ЗначениеЗаполнено(СтрокаВыписки.Дата)
				И 
				ЗначениеЗаполнено(СтрокаВыписки.НомерДокумента)
				)
				Тогда
				СтрокаВыписки._СсылкаНаДокумент = Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиДокументПоШаблонуДатеИНомеру(СтрокаВыписки._ШаблонЗаполнения,СтрокаВыписки.Дата,СтрокаВыписки.НомерДокумента,СтрокаВыписки.СуммаКт,СтрокаВыписки.СуммаДт);	
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) Тогда 
			СтрокаВыписки.ДокументПроведен  = СтрокаВыписки._СсылкаНаДокумент.Проведен; 
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) Тогда
			СтрокаВыписки._СсылкаНаДокумент  = Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиВРегистреКлючДокументаИнтернетБанка(СтрокаВыписки.ID_Новый);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаВыписки.КодКазначейство) Тогда    
			СтрокаВыписки.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(СтрокаВыписки.КодКазначейство);
			Если ЗначениеЗаполнено(СтрокаВыписки.СчетКонтрагента1С) Тогда 
				СтрокаВыписки.Контрагент1С = СтрокаВыписки.СчетКонтрагента1С.Владелец;
			КонецЕсли;
		Иначе
			Если ИскатьКонтрагента Тогда     
				Если ЗначениеЗаполнено(СокрЛП(СтрокаВыписки.ИНН)) Тогда 
					СтрокаВыписки.Контрагент1С	= НайтиКонтрагента(СтрокаВыписки.ИНН, СтрокаВыписки.Наименование);    
					СтрокаВыписки.Подотчетник1С	= Справочники.Сотрудники.ПустаяСсылка(); 
					
				Иначе              
					СтрокаВыписки.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(СтрокаВыписки.СчетБанк, "Контрагенты");
					Если ЗначениеЗаполнено(СтрокаВыписки.СчетКонтрагента1С) Тогда       
						СтрокаВыписки.Контрагент1С	= СтрокаВыписки.СчетКонтрагента1С.Владелец;    
						СтрокаВыписки.Подотчетник1С	= Справочники.Сотрудники.ПустаяСсылка();  
					КонецЕсли;
				КонецЕсли;
				
				
				
				
				
			ИначеЕсли ИскатьСотрудника Тогда  
				Если ЗначениеЗаполнено(СокрЛП(СтрокаВыписки.ИНН)) Тогда 
					СтрокаВыписки.Контрагент1С	=  Справочники.Контрагенты.ПустаяСсылка();
					СтрокаВыписки.Подотчетник1С  = НайтиПодотчетника(СтрокаВыписки.ИНН);      
				Иначе              
					СтрокаВыписки.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(СтрокаВыписки.СчетБанк, "Сотрудники");
					Если ЗначениеЗаполнено(СтрокаВыписки.СчетКонтрагента1С) Тогда       
						СтрокаВыписки.Контрагент1С	= Справочники.Контрагенты.ПустаяСсылка();    
						СтрокаВыписки.Подотчетник1С	= СтрокаВыписки.СчетКонтрагента1С.Владелец;  
					КонецЕсли;
				КонецЕсли;
			//+++ Дмгг, 11.04.2025, ONESOFT-3973	
			ИначеЕсли ИскатьОрганизацию Тогда  
				
				СтрокаВыписки.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(СтрокаВыписки.СчетБанк, "", СтрокаВыписки.Валюта);
			//--- Дмгг, 11.04.2025, ONESOFT-3973	
			КонецЕсли; 
			
			//Заполним счет контрагента	
			Если НЕ ЗначениеЗаполнено(СтрокаВыписки.СчетКонтрагента1С) и ЗначениеЗаполнено(СтрокаВыписки.СчетБанк) Тогда 
				ВладелецСчета = Неопределено; 
				Если СтрокаВыписки.ИННДт = СтрокаВыписки.ИННКт Тогда
					//Малышев 2024-05-30 ONESOFT-3187  
					ВладелецСчета = объект.Организация;                                                  
				ИначеЕсли ЗначениеЗаполнено(СтрокаВыписки.Контрагент1С) Тогда     
					ВладелецСчета = СтрокаВыписки.Контрагент1С;
				ИначеЕсли ЗначениеЗаполнено(СтрокаВыписки.Подотчетник1С) Тогда       
					ВладелецСчета = СтрокаВыписки.Подотчетник1С;
				Иначе    
					ВладелецСчета = объект.Организация;
				КонецЕсли;
				
				СтрокаВыписки.СчетКонтрагента1С = НайтиСчет(ВладелецСчета, СтрокаВыписки.СчетБанк);
				
			КонецЕсли;
			
			//Малышев 2024-05-30 ONESOFT-3187 
			Если НЕ ЗначениеЗаполнено(СтрокаВыписки.СчетКонтрагента1С) Тогда
				СтрокаВыписки.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(СтрокаВыписки.СчетБанк);

				Если НЕ ЗначениеЗаполнено(СтрокаВыписки.СчетКонтрагента1С) Тогда
					//Если у счета нет признака валюты на конце, тогда дописываем туда валюту и уже по нему ищем
					РазницаДлинСчетов = СтрДлина(Объект.БанковскийСчет.НомерСчета) - СтрДлина(СтрокаВыписки.СчетБанк);
					Если РазницаДлинСчетов > 0 Тогда
						//допишем признак валюты к счету
						НовыйСчетБанк = СтрокаВыписки.СчетБанк + Прав(Объект.БанковскийСчет.НомерСчета, РазницаДлинСчетов); 
						СтрокаВыписки.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(НовыйСчетБанк,, Объект.БанковскийСчет.ВалютаДенежныхСредств.Наименование);						
					КонецЕсли;	
					
				КонецЕсли;	
						
			КонецЕсли;
			
			//Малышев 2024-05-29 ONESOFT-3186 - попробуем найти сотрудника по ИНН контрагента
			Если ИскатьКонтрагента и ЗначениеЗаполнено(СтрокаВыписки.ИНН) Тогда
				СтрокаВыписки.Подотчетник1С = НайтиПодотчетника(СтрокаВыписки.ИНН);  
			КонецЕсли;	
			
			
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого стрМУд Из МассивУдаления Цикл
		врТаблицаВыписки.Удалить(стрМУд);
	КонецЦикла;
	Объект.ТаблицаВыписки.Загрузить(врТаблицаВыписки);
	

КонецПроцедуры 

&НаСервере
Процедура TBC_ЗагрузитьНаСервере(ArrExcel,ТипОбмена,ЕстьСсылкаНаДокумент=ЛОЖЬ)

    СтруктураКолонок = ПолучитьСтруктуруСоответствииКолонок(ТипОбмена);

	Объект.ТаблицаВыписки.Очистить();
	врТаблицаВыписки = Объект.ТаблицаВыписки.Выгрузить();
	врТаблицаВыпискиШ =  врТаблицаВыписки.Скопировать();
	Для Каждого стр Из ArrExcel[0] Цикл 
		врТаблицаВыписки.Добавить();
	КонецЦикла;
	
	ТребуетьсяПреобразованиеДаты = ЛОЖЬ;
	Если ArrExcel[0].Количество() > 2 И СтрНайти(ArrExcel[0][2],"/") <> 0 Тогда 
		ТребуетьсяПреобразованиеДаты = Истина;
	КонецЕсли;
	МассивКолонкиДат = Новый Массив;
	Для Каждого ЭлемДат Из ArrExcel[0] Цикл 
		ДатаСтрокой = Формат(ЭлемДат,"ДФ=dd.MM.yyyy");
		День 	= Лев(ДатаСтрокой, 2);
		Месяц 	= Сред(ДатаСтрокой, 4,2);
		Год 	= Сред(ДатаСтрокой, 7,4);
		Попытка
			ДатаСтроки = Дата(Год,Месяц,День);
		Исключение
			ДатаСтроки = Дата(1,1,1);
		КонецПопытки;
		МассивКолонкиДат.Добавить(ДатаСтроки);
	КонецЦикла;
	
	Для каждого стрСтруктури Из СтруктураКолонок Цикл
		стЗначение = стрСтруктури.Значение;
		стКлюч	   = стрСтруктури.Ключ;
		//+++ Дмгг, проверка, на то что мы читаем ексель, в екселе на 2 колонки меньше;
		Если ArrExcel.Количество() < стЗначение Тогда 
			//Скоре всего это ексель
			Продолжить;
		КонецЕсли;
		//--- ДМгг
		Если ТребуетьсяПреобразованиеДаты И стКлюч = "Дата" Тогда 
			Попытка
				врТаблицаВыписки.ЗагрузитьКолонку(МассивКолонкиДат,стКлюч);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки() +  " колонка " + " стЗначение ");
			КонецПопытки;
		Иначе
			Если ArrExcel.Количество() = стЗначение-1   
				И стКлюч = "Курс" Тогда 
				Продолжить;
			КонецЕсли;
			Попытка
				врТаблицаВыписки.ЗагрузитьКолонку(ArrExcel[стЗначение-1],стКлюч);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки() +  " колонка " + " стЗначение ");
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьСсылкаНаДокумент Тогда
		//врТаблицаВыписки.ЗагрузитьКолонку(ArrExcel[22],"_СсылкаНаДокумент");
		врТаблицаВыписки.ЗагрузитьКолонку(ArrExcel[25],"_СсылкаНаДокумент");
	КонецЕсли;
	МассивУдаления = Новый Массив;
	Для каждого СтрокаВыписки Из врТаблицаВыписки Цикл
		Если  НЕ ЗначениеЗаполнено(СтрокаВыписки.Дата)
			Или СтрокаВыписки.Дата = "" 
			Или СтрокаВыписки.Дата = "ამონაწერი" 
			Или СтрокаВыписки.Дата = "თარიღი"	 
			Или СтрокаВыписки.Дата = "Date"	Тогда 
			МассивУдаления.Добавить(СтрокаВыписки);
			Продолжить;
		КонецЕсли;
		
		врТаблицаВыпискиШ.Очистить();
		СтрокаВыпискиШ = врТаблицаВыпискиШ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВыпискиШ,СтрокаВыписки);
		СтрокаВыписки._ШаблонЗаполнения = СоответствоватьШаблонЗаполнения(врТаблицаВыпискиШ);
		
		ИскатьКонтрагента = Истина;
		ИскатьСотрудника = Ложь; 
		ИскатьОрганизацию = Ложь;
		Если ЗначениеЗаполнено(СтрокаВыписки._ШаблонЗаполнения) 
			И (СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "ВыплатаЗарплаты"
			И (СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.ВыплатаАванса  
			ИЛИ СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.ВыплатаЗарплаты
			ИЛИ СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.НачислениеИВыплатаЗарплаты))
			//+++ Дмгг, 08.05.2025, ONESOFT-4047
			//ИЛИ СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "ПеремещениеДенежныхСредств" Тогда 
			ИЛИ СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "ПеремещениеДенежныхСредств" 
			ИЛИ (СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "РасходСоСчета" 
				И СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику)
			ИЛИ (СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "ПостуалениеНаСчет"                            
				 И СтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника) Тогда 
			//--- Дмгг, 08.05.2025, ONESOFT-4047
			ИскатьКонтрагента = Ложь;
			ИскатьСотрудника = Истина;
			ИскатьОрганизацию = Ложь;
		ИначеЕсли ЗначениеЗаполнено(СтрокаВыписки._ШаблонЗаполнения) 
			И (СтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "Конвертация"
			ИЛИ (СтрокаВыписки.Курс <> 1 И СтрокаВыписки.Курс <> 0)) Тогда
			
			ИскатьКонтрагента = Ложь;
			ИскатьСотрудника = Ложь;
			ИскатьОрганизацию = Истина;
			
		КонецЕсли;
		пИНН = СтрЗаменить(СтрокаВыписки.ИНН, " ", "");
		СтрокаВыписки.ID = 
		СтрокаВыписки.Ключ 
		+ "_" + Строка(СтрокаВыписки.Дата) 
		+ "_" + пИНН//СтрокаВыписки.ИНН 
		+ "_" + СтрокаВыписки.НомерДокумента 
		+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаДт), "_" + Строка(СтрокаВыписки.СуммаДт), "")
		+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаКт), "_-" + Строка(СтрокаВыписки.СуммаКт), "") 
		+ "_" + СтрокаВыписки.НазначениеПлатежа;  
		
		//СтрокаВыписки.ID_Новый = Лев(СтрокаВыписки.Дата, 10) 
		//+ "_" + СтрокаВыписки.НомерДокумента 
		//+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаДт), "_" + Строка(СтрокаВыписки.СуммаДт), "")
		//+ ?(НЕ ЗначениеЗаполнено(СтрокаВыписки.СуммаДт),?(ЗначениеЗаполнено(СтрокаВыписки.СуммаКт), "_" + Строка(СтрокаВыписки.СуммаКт), ""), "")
		//+ "_" + СтрокаВыписки.НазначениеПлатежа;
		
		СтрокаВыписки.TransactionID = СокрЛП(СтрЗаменить(СтрЗаменить(СтрокаВыписки.TransactionID, " ", ""), Символы.НПП, ""));
		СтрокаВыписки.НомерДокумента = СокрЛП(СтрЗаменить(СтрЗаменить(СтрокаВыписки.НомерДокумента, " ", ""), Символы.НПП, ""));
		
		СтрокаВыписки.ID_Новый = Лев(Строка(СтрокаВыписки.Дата), 10) 
		+ "_" + СтрокаВыписки.НомерДокумента
		//+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаДт), "_" + Строка(СтрокаВыписки.СуммаДт), "")
		+ ?(СтрокаВыписки.ТипТранзакцийБВ = "კონვერტაცია", "_", ?(НЕ ЗначениеЗаполнено(СтрокаВыписки.СуммаДт),?(ЗначениеЗаполнено(СтрокаВыписки.СуммаКт), "_" + Строка(СтрокаВыписки.СуммаКт), ""), ""))
		+ "_" + СтрокаВыписки.НазначениеПлатежа;
		
		// Поиск ранее обработанного документа
		Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) И СтрДлина(СтрокаВыписки.Комментарий)>0 Тогда
			ПозицияПервогоРазлелителя = СтрНайти(СтрокаВыписки.Комментарий,"##",НаправлениеПоиска.СНачала,,1);
			ПозицияВторогоРазлелителя = СтрНайти(СтрокаВыписки.Комментарий,"##",НаправлениеПоиска.СНачала,,2);
			Если ПозицияПервогоРазлелителя>0 И ПозицияВторогоРазлелителя>0 Тогда
				СтрокаУникальныйИдентификатор = СРЕД(СтрокаВыписки.Комментарий,ПозицияПервогоРазлелителя+2,36);
				СтрокаВыписки._СсылкаНаДокумент  = ПолучитьСсылкуНаДокументПоУникальномуИдентификатору(СтрокаУникальныйИдентификатор);
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) Тогда
			СтрокаВыписки._СсылкаНаДокумент  = Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиДокументПоИД(СтрокаВыписки.ID);
			Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) 
				И ( 
				ЗначениеЗаполнено(СтрокаВыписки.Дата)
				И 
				ЗначениеЗаполнено(СтрокаВыписки.НомерДокумента)
				)
				Тогда
				СтрокаВыписки._СсылкаНаДокумент = Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиДокументПоШаблонуДатеИНомеру(СтрокаВыписки._ШаблонЗаполнения,СтрокаВыписки.Дата,СтрокаВыписки.НомерДокумента,СтрокаВыписки.СуммаКт,СтрокаВыписки.СуммаДт);	
			КонецЕсли;
		КонецЕсли;  
		Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) Тогда
			СтрокаВыписки._СсылкаНаДокумент  = Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиВРегистреКлючДокументаИнтернетБанка(СтрокаВыписки.ID_Новый);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) Тогда 
			СтрокаВыписки.ДокументПроведен  = СтрокаВыписки._СсылкаНаДокумент.Проведен; 
		КонецЕсли;  
		Если ЗначениеЗаполнено(СтрокаВыписки.КодКазначейство) Тогда    
			СтрокаВыписки.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(СтрокаВыписки.КодКазначейство);
			Если ЗначениеЗаполнено(СтрокаВыписки.СчетКонтрагента1С) Тогда 
				СтрокаВыписки.Контрагент1С = СтрокаВыписки.СчетКонтрагента1С.Владелец;
			КонецЕсли;  
		Иначе			
			Если ИскатьКонтрагента Тогда     
				Если ЗначениеЗаполнено(СокрЛП(СтрокаВыписки.ИНН)) Тогда 
					СтрокаВыписки.Контрагент1С	= НайтиКонтрагента(СтрокаВыписки.ИНН, СтрокаВыписки.Наименование);    
					СтрокаВыписки.Подотчетник1С	= Справочники.Сотрудники.ПустаяСсылка();      
				Иначе              
					СтрокаВыписки.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(СтрокаВыписки.СчетБанк, "Контрагенты");
					Если ЗначениеЗаполнено(СтрокаВыписки.СчетКонтрагента1С) Тогда       
						СтрокаВыписки.Контрагент1С	= СтрокаВыписки.СчетКонтрагента1С.Владелец;    
						СтрокаВыписки.Подотчетник1С	= Справочники.Сотрудники.ПустаяСсылка();  
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ИскатьСотрудника Тогда  
				Если ЗначениеЗаполнено(СокрЛП(СтрокаВыписки.ИНН)) Тогда 
					СтрокаВыписки.Контрагент1С	=  Справочники.Контрагенты.ПустаяСсылка();
					СтрокаВыписки.Подотчетник1С  = НайтиПодотчетника(СтрокаВыписки.ИНН);      
				Иначе              
					СтрокаВыписки.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(СтрокаВыписки.СчетБанк, "Сотрудники");
					Если ЗначениеЗаполнено(СтрокаВыписки.СчетКонтрагента1С) Тогда       
						СтрокаВыписки.Контрагент1С	= Справочники.Контрагенты.ПустаяСсылка();    
						СтрокаВыписки.Подотчетник1С	= СтрокаВыписки.СчетКонтрагента1С.Владелец;  
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ИскатьОрганизацию Тогда  
				СтрокаВыписки.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(СтрокаВыписки.СчетБанк, "", СтрокаВыписки.Валюта);
				//Если ЗначениеЗаполнено(СтрокаВыписки.СчетКонтрагента1С) Тогда       
				//	СтрокаВыписки.Контрагент1С	= Справочники.Контрагенты.ПустаяСсылка();    
				//	СтрокаВыписки.Подотчетник1С	= СтрокаВыписки.СчетКонтрагента1С.Владелец;  
				//КонецЕсли;
			КонецЕсли;   
			Если НЕ ЗначениеЗаполнено(СтрокаВыписки.СчетКонтрагента1С) Тогда 
				ВладелецСчета = Неопределено;
				Если ЗначениеЗаполнено(СтрокаВыписки.Контрагент1С) Тогда     
					ВладелецСчета = СтрокаВыписки.Контрагент1С;
				ИначеЕсли ЗначениеЗаполнено(СтрокаВыписки.Подотчетник1С) Тогда //.Физлицо) Тогда       
					ВладелецСчета = СтрокаВыписки.Подотчетник1С; //.Физлицо;
				Иначе    
					ВладелецСчета = объект.Организация;
				КонецЕсли;   
				СтрокаВыписки.СчетКонтрагента1С = НайтиСчет(ВладелецСчета,СтрокаВыписки.СчетБанк);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого стрМУд Из МассивУдаления Цикл
		врТаблицаВыписки.Удалить(стрМУд);
	КонецЦикла;
	Объект.ТаблицаВыписки.Загрузить(врТаблицаВыписки);


КонецПроцедуры // ()

&НаСервере
Функция НайтиСчетКазначенийстваПоНомеруСчета(НомерСчетаКонтрагента, ТипВладелец = "", ИмяВалюты = "")
	
	СчетВозврата = Неопределено;
	
	Если НомерСчетаКонтрагента = "" ТОгда
		Возврат СчетВозврата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	БанковскиеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	ВЫРАЗИТЬ(БанковскиеСчета.НомерСчета КАК Строка(%ЧислоСимволовСчет%)) = &НомерСчета
		|	%УсловияСотрудника%
		|	%УсловияКонтрагента%
		|	%УсловияОрганизации%";
	
	Если ТипВладелец = "Сотрудники" Тогда 
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "%УсловияСотрудника%", "И ТИПЗНАЧЕНИЯ(БанковскиеСчета.Владелец) = ТИП(Справочник.Сотрудники)"); 
	ИначеЕсли ТипВладелец = "Контрагенты" Тогда
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "%УсловияКонтрагента%", "И ТИПЗНАЧЕНИЯ(БанковскиеСчета.Владелец) = ТИП(Справочник.Контрагенты)"); 
	Иначе
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "%УсловияОрганизации%", "И ТИПЗНАЧЕНИЯ(БанковскиеСчета.Владелец) = ТИП(Справочник.Организации) И БанковскиеСчета.ВалютаДенежныхСредств.Наименование = &ИмяВалюты");
		//ЗапросТекст = СтрЗаменить(ЗапросТекст, "%УсловияКонтрагента%", "");  
	КонецЕсли;
	
	ЗапросТекст = СтрЗаменить(ЗапросТекст, "%УсловияСотрудника%", "");
	ЗапросТекст = СтрЗаменить(ЗапросТекст, "%УсловияКонтрагента%", ""); 
	ЗапросТекст = СтрЗаменить(ЗапросТекст, "%УсловияОрганизации%", "");
	ЗапросТекст = СтрЗаменить(ЗапросТекст, "%ЧислоСимволовСчет%", СтрДлина(НомерСчетаКонтрагента));
	
	Запрос.Текст = ЗапросТекст;
	
	Запрос.УстановитьПараметр("НомерСчета", НомерСчетаКонтрагента);
	Запрос.УстановитьПараметр("ИмяВалюты", ИмяВалюты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СчетВозврата = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат СчетВозврата; 
	

КонецФункции

&НаСервере
Процедура CARTU_ЗагрузитьНаСервере(ArrExcel,ТипОбмена)

    СтруктураКолонок = ПолучитьСтруктуруСоответствииКолонок(ТипОбмена);

	Объект.ТаблицаВыписки.Очистить();
	врТаблицаВыписки = Объект.ТаблицаВыписки.Выгрузить();
	врТаблицаВыпискиШ =  врТаблицаВыписки.Скопировать();
	Для Каждого стр Из ArrExcel[0] Цикл 
		врТаблицаВыписки.Добавить();
	КонецЦикла;
	
	Для каждого стрСтруктури Из СтруктураКолонок Цикл
		стЗначение = стрСтруктури.Значение;
		стКлюч	   = стрСтруктури.Ключ;
		Попытка
			врТаблицаВыписки.ЗагрузитьКолонку(ArrExcel[стЗначение-1],стКлюч);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки() +  " колонка " + " стЗначение ");
		КонецПопытки;
	КонецЦикла;
	
	МассивУдаления = Новый Массив;
	Для каждого СтрокаВыписки Из врТаблицаВыписки Цикл
		Если  НЕ ЗначениеЗаполнено(СтрокаВыписки.Дата)
			Или СтрокаВыписки.Дата = "" 
			Или СтрокаВыписки.Дата = "ამონაწერი" 
			Или СтрокаВыписки.Дата = "თარიღი"	 
			Или СтрокаВыписки.Дата = "Date"	Тогда 
			МассивУдаления.Добавить(СтрокаВыписки);
			Продолжить;
		КонецЕсли;
		
		врТаблицаВыпискиШ.Очистить();
		СтрокаВыпискиШ = врТаблицаВыпискиШ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВыпискиШ,СтрокаВыписки);
		СтрокаВыписки._ШаблонЗаполнения = СоответствоватьШаблонЗаполнения(врТаблицаВыпискиШ);
		
		пИНН = СтрЗаменить(СтрокаВыписки.ИНН, " ", "");//Паганини
		СтрокаВыписки.ID = 
		СтрокаВыписки.Ключ 
		+ "_" + Строка(СтрокаВыписки.Дата) 
		+ "_" + пИНН//СтрокаВыписки.ИНН 
		+ "_" + СтрокаВыписки.НомерДокумента 
		+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаДт), "_" + Строка(СтрокаВыписки.СуммаДт), "")
		+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаКт), "_-" + Строка(СтрокаВыписки.СуммаКт), "") 
		+ "_" + СтрокаВыписки.НазначениеПлатежа
		+ "_" + СтрокаВыписки.Баланс;
		// Поиск ранее обработанного документа
		Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) И СтрДлина(СтрокаВыписки.Комментарий)>0 Тогда
		
			ПозицияПервогоРазлелителя = СтрНайти(СтрокаВыписки.Комментарий,"##",НаправлениеПоиска.СНачала,,1);
			ПозицияВторогоРазлелителя = СтрНайти(СтрокаВыписки.Комментарий,"##",НаправлениеПоиска.СНачала,,2);
			Если ПозицияПервогоРазлелителя>0 И ПозицияВторогоРазлелителя>0 Тогда
				СтрокаУникальныйИдентификатор = СРЕД(СтрокаВыписки.Комментарий,ПозицияПервогоРазлелителя+2,36);
				СтрокаВыписки._СсылкаНаДокумент  = ПолучитьСсылкуНаДокументПоУникальномуИдентификатору(СтрокаУникальныйИдентификатор);
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) Тогда
			СтрокаВыписки._СсылкаНаДокумент  = Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиДокументПоИД(СтрокаВыписки.ID);
			Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) 
				И (
				ЗначениеЗаполнено(СтрокаВыписки.Дата)
				И 
				ЗначениеЗаполнено(СтрокаВыписки.НомерДокумента)
				)
				Тогда
				СтрокаВыписки._СсылкаНаДокумент = Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиДокументПоШаблонуДатеИНомеру(СтрокаВыписки._ШаблонЗаполнения,СтрокаВыписки.Дата,СтрокаВыписки.НомерДокумента,СтрокаВыписки.СуммаКт,СтрокаВыписки.СуммаДт);	
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) Тогда 
			СтрокаВыписки.ДокументПроведен  = СтрокаВыписки._СсылкаНаДокумент.Проведен; 
		КонецЕсли;
		
		СтрокаВыписки.Контрагент1С      = НайтиКонтрагента(пИНН,СтрокаВыписки.Наименование);//СтрокаВыписки.ИНН
		СтрокаВыписки.Подотчетник1С     = НайтиПодотчетника(пИНН);							//СтрокаВыписки.ИНН
		СтрокаВыписки.СчетКонтрагента1С = НайтиСчет(СтрокаВыписки.Контрагент1С,СтрокаВыписки.СчетБанк);
		
	КонецЦикла;
	
	Для каждого стрМУд Из МассивУдаления Цикл
		врТаблицаВыписки.Удалить(стрМУд);
	КонецЦикла;
	Объект.ТаблицаВыписки.Загрузить(врТаблицаВыписки);


КонецПроцедуры // ()

&НаСервере
Процедура VTB_ЗагрузитьНаСервере(ArrExcel,ТипОбмена)

    СтруктураКолонок = ПолучитьСтруктуруСоответствииКолонок(ТипОбмена);

	СсылкаПустогоШаблона = Справочники.ШаблоныЗаполнения.ПустаяСсылка();
	
	Объект.ТаблицаВыписки.Очистить();
	врТаблицаВыписки = Объект.ТаблицаВыписки.Выгрузить();
	врТаблицаВыпискиШ =  врТаблицаВыписки.Скопировать();
	Для Каждого стр Из ArrExcel[0] Цикл 
		врТаблицаВыписки.Добавить();
	КонецЦикла;
	
	Для каждого стрСтруктури Из СтруктураКолонок Цикл
		стЗначение = стрСтруктури.Значение;
		стКлюч	   = стрСтруктури.Ключ;
		Попытка
			Если VTB И стКлюч = "Дата" Тогда 
				врТаблицаВыписки.ЗагрузитьКолонку(ArrExcel[стЗначение-1],"ДатаСтрока");
			Иначе 
				врТаблицаВыписки.ЗагрузитьКолонку(ArrExcel[стЗначение-1],стКлюч);
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки() +  " колонка " + " стЗначение ");
		КонецПопытки;
	КонецЦикла;
	
	СтрокаУжеУдалялась = ЛОЖЬ;
	
	МассивУдаления = Новый Массив;
	Для каждого СтрокаВыписки Из врТаблицаВыписки Цикл
		Если  НЕ VTB Тогда 
			Если НЕ ЗначениеЗаполнено(СтрокаВыписки.Дата) 
				Или  СтрокаВыписки.Дата = "" 
				Или СтрокаВыписки.Дата = "ამონაწერი" 
				Или СтрокаВыписки.Дата = "თარიღი"	 
				Или СтрокаВыписки.Дата = "დანიშნულება"	 
				Или СтрокаВыписки.Дата = "Date"	Тогда 
				МассивУдаления.Добавить(СтрокаВыписки);
				СтрокаУжеУдалялась = Истина;
				Продолжить;
			КонецЕсли;
		ИначеЕсли VTB Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаВыписки.ДатаСтрока) 
				Или  СтрокаВыписки.ДатаСтрока = "" 
				Или СтрокаВыписки.ДатаСтрока = "ამონაწერი" 
				Или СтрокаВыписки.ДатаСтрока = "თარიღი"	 
				Или СтрокаВыписки.ДатаСтрока = "დანიშნულება"	 
				Или СтрокаВыписки.ДатаСтрока = "Date"	Тогда 
				МассивУдаления.Добавить(СтрокаВыписки);
				СтрокаУжеУдалялась = Истина;
			Иначе 
				СтрокаВыписки.Дата = ПреобразоватьВДату(СтрокаВыписки.ДатаСтрока);
				Если НЕ ЗначениеЗаполнено(СтрокаВыписки.Дата) Тогда 
					МассивУдаления.Добавить(СтрокаВыписки);
					СтрокаУжеУдалялась = Истина;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		врТаблицаВыпискиШ.Очистить();
		СтрокаВыпискиШ = врТаблицаВыпискиШ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВыпискиШ,СтрокаВыписки);
		СтрокаВыписки._ШаблонЗаполнения = СоответствоватьШаблонЗаполнения(врТаблицаВыпискиШ);
		
		пИНН = СтрЗаменить(СтрокаВыписки.ИНН, " ", "");//Паганини
		СтрокаВыписки.ID = 
		СтрокаВыписки.Ключ 
		+ "_" + Строка(СтрокаВыписки.Дата) 
		+ "_" + пИНН//СтрокаВыписки.ИНН 
		+ "_" + СтрокаВыписки.НомерДокумента 
		+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаДт), "_" + Строка(СтрокаВыписки.СуммаДт), "")
		+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаКт), "_-" + Строка(СтрокаВыписки.СуммаКт), "") 
		+ "_" + СтрокаВыписки.НазначениеПлатежа
		+ "_" + СтрокаВыписки.Баланс;
		// Поиск ранее обработанного документа
		Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) И СтрДлина(СтрокаВыписки.Комментарий)>0 Тогда
			
			ПозицияПервогоРазлелителя = СтрНайти(СтрокаВыписки.Комментарий,"##",НаправлениеПоиска.СНачала,,1);
			ПозицияВторогоРазлелителя = СтрНайти(СтрокаВыписки.Комментарий,"##",НаправлениеПоиска.СНачала,,2);
			Если ПозицияПервогоРазлелителя>0 И ПозицияВторогоРазлелителя>0 Тогда
				СтрокаУникальныйИдентификатор = СРЕД(СтрокаВыписки.Комментарий,ПозицияПервогоРазлелителя+2,36);
				СтрокаВыписки._СсылкаНаДокумент  = ПолучитьСсылкуНаДокументПоУникальномуИдентификатору(СтрокаУникальныйИдентификатор);
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) Тогда
			СтрокаВыписки._СсылкаНаДокумент  = Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиДокументПоИД(СтрокаВыписки.ID);
			Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) 
				И (
				ЗначениеЗаполнено(СтрокаВыписки.Дата)
				И 
				ЗначениеЗаполнено(СтрокаВыписки.НомерДокумента)
				)
				Тогда
				СтрокаВыписки._СсылкаНаДокумент = Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиДокументПоШаблонуДатеИНомеру(СтрокаВыписки._ШаблонЗаполнения,СтрокаВыписки.Дата,СтрокаВыписки.НомерДокумента,СтрокаВыписки.СуммаКт,СтрокаВыписки.СуммаДт);	
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) Тогда 
			СтрокаВыписки.ДокументПроведен  = СтрокаВыписки._СсылкаНаДокумент.Проведен; 
		КонецЕсли;
		
		СтрокаВыписки.Контрагент1С      = НайтиКонтрагента(пИНН,СтрокаВыписки.Наименование);//СтрокаВыписки.ИНН
		СтрокаВыписки.Подотчетник1С     = НайтиПодотчетника(пИНН);							//СтрокаВыписки.ИНН
		СтрокаВыписки.СчетКонтрагента1С = НайтиСчет(СтрокаВыписки.Контрагент1С,СтрокаВыписки.СчетБанк);
		                     
		Если СтрокаВыписки._ШаблонЗаполнения = СсылкаПустогоШаблона И НЕ СтрокаУжеУдалялась Тогда 					 
			//МассивУдаления.Добавить(СтрокаВыписки);
		КонецЕсли;
		
		СтрокаУжеУдалялась = ЛОЖЬ;
		
	КонецЦикла;
	
	Для каждого стрМУд Из МассивУдаления Цикл
		врТаблицаВыписки.Удалить(стрМУд);
	КонецЦикла;
	
	Объект.ТаблицаВыписки.Загрузить(врТаблицаВыписки);


КонецПроцедуры // ()

&НаСервере
Процедура ProCredit_ЗагрузитьНаСервере(ArrExcel,ТипОбмена,ЧтениеExcel = ЛОЖЬ)
	
	//Проверка Номера Счета. Исходим из того что номер счета всегда в третей строке первой колонке
	Если ЧтениеExcel И ArrExcel[0][2] <> НомерСчета Тогда  
		ТекстСообщения = НСтр("ru = 'В указанном файле нет записей по выбранному счету'; ka = 'ამონაწერი არ ეკუთვნის არჩეულ ანგარიშის ნომერს'; en = 'There are no records for the selected account in the specified file'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,);
		Возврат;
	КонецЕсли;
	
	Если ЧтениеExcel Тогда 
   		СтруктураКолонок = ПолучитьСтруктуруСоответствииКолонок(ТипОбмена, ArrExcel.Количество(), 1);
	Иначе
		СтруктураКолонок = ПолучитьСтруктуруСоответствииКолонок(ТипОбмена, 0, 0);
	КонецЕсли;
	
    СсылкаПустогоШаблона = Справочники.ШаблоныЗаполнения.ПустаяСсылка();
	
	Объект.ТаблицаВыписки.Очистить();
	врТаблицаВыписки = Объект.ТаблицаВыписки.Выгрузить();
	врТаблицаВыпискиШ =  врТаблицаВыписки.Скопировать();
	Для Каждого стр Из ArrExcel[0] Цикл 
		врТаблицаВыписки.Добавить();
	КонецЦикла;
	
	Для каждого стрСтруктури Из СтруктураКолонок Цикл
		стЗначение = стрСтруктури.Значение;
		стКлюч	   = стрСтруктури.Ключ;
		Попытка
			Если VTB И стКлюч = "Дата" Тогда 
				врТаблицаВыписки.ЗагрузитьКолонку(ArrExcel[стЗначение-1],"ДатаСтрока");
			Иначе 
				врТаблицаВыписки.ЗагрузитьКолонку(ArrExcel[стЗначение-1],стКлюч);
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки() +  " колонка " + " стЗначение ");
		КонецПопытки;
	КонецЦикла;
	
	СтрокаУжеУдалялась = ЛОЖЬ;
	
	МассивУдаления = Новый Массив;
	Для каждого СтрокаВыписки Из врТаблицаВыписки Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаВыписки.Дата) 
			Или  СтрокаВыписки.Дата = "" 
			Или СтрокаВыписки.Дата = "ამონაწერი" 
			Или СтрокаВыписки.Дата = "თარიღი"	 
			Или СтрокаВыписки.Дата = "დანიშნულება"	 
			Или СтрокаВыписки.Дата = "Date"	Тогда 
			МассивУдаления.Добавить(СтрокаВыписки);
			СтрокаУжеУдалялась = Истина;
			Продолжить;
		ИначеЕсли ЗначениеЗаполнено(СтрокаВыписки.СуммаДт) Тогда 
			СтрокаВыписки.Наименование = СтрокаВыписки.НаименованиеДт;
			СтрокаВыписки.ИНН = СтрокаВыписки.ИННДт;
			СтрокаВыписки.СчетБанк = СтрокаВыписки.СчетБанкДт;
		ИначеЕсли ЗначениеЗаполнено(СтрокаВыписки.СуммаКт) Тогда 
			СтрокаВыписки.Наименование = СтрокаВыписки.НаименованиеКт;
			СтрокаВыписки.ИНН = СтрокаВыписки.ИННКт;
			СтрокаВыписки.СчетБанк = СтрокаВыписки.СчетБанкКт;
		КонецЕсли;
		
		// Kuzmich, 09.07.2024, (ONESOFT-3256) Помошник загрузки банковской выписки - Procredit Bank - Тип Операции - соответствие
		ТекущийТипОперации = СокрЛП(СтрокаВыписки.ТипОперации);
		Если ТекущийТипОперации = "DomesticPayment" Тогда
			СтрокаВыписки.ТипОперации = "გადარიცხვა საქართველოში";
		ИначеЕсли ТекущийТипОперации = "CurrencyConversion" Тогда
			СтрокаВыписки.ТипОперации = "ვალუტის კონვერტაცია";
		ИначеЕсли ТекущийТипОперации = "CardTransaction" Тогда
			СтрокаВыписки.ТипОперации = "საბარათე ტრანზაქცია";
		ИначеЕсли ТекущийТипОперации = "PaymentInsideProCredit" Тогда
			СтрокаВыписки.ТипОперации = "გადარიცხვა პროკრედიტ ბანკში";
		ИначеЕсли ТекущийТипОперации = "Commission" Тогда
			СтрокаВыписки.ТипОперации = "საკომისიო";
		ИначеЕсли ТекущийТипОперации = "OnlinePayments" Тогда
			СтрокаВыписки.ТипОперации = "ონლაინ გადახდები";
		ИначеЕсли ТекущийТипОперации = "Other" Тогда
			СтрокаВыписки.ТипОперации = "სხვა";
		КонецЕсли;
		// Kuzmich, 09.07.2024, (ONESOFT-3256) Помошник загрузки банковской выписки - Procredit Bank - Тип Операции - соответствие
		
		врТаблицаВыпискиШ.Очистить();
		СтрокаВыпискиШ = врТаблицаВыпискиШ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВыпискиШ,СтрокаВыписки);
		СтрокаВыписки._ШаблонЗаполнения = СоответствоватьШаблонЗаполнения(врТаблицаВыпискиШ);
		
		пИНН = СтрЗаменить(СтрокаВыписки.ИНН, " ", "");//Паганини
		СтрокаВыписки.ID = СокрЛП(СтрЗаменить(СтрЗаменить(СтрокаВыписки.ID, " ", ""), Символы.НПП, ""));		
		//СтрокаВыписки.Ключ 
		//+ "_" + Строка(СтрокаВыписки.Дата) 
		//+ "_" + пИНН//СтрокаВыписки.ИНН 
		//+ "_" + СтрокаВыписки.НомерДокумента 
		//+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаДт), "_" + Строка(СтрокаВыписки.СуммаДт), "")
		//+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаКт), "_-" + Строка(СтрокаВыписки.СуммаКт), "") 
		//+ "_" + СтрокаВыписки.НазначениеПлатежа
		//+ "_" + СтрокаВыписки.Баланс;
		
		// Поиск ранее обработанного документа
		Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) И СтрДлина(СтрокаВыписки.Комментарий)>0 Тогда
		
			ПозицияПервогоРазлелителя = СтрНайти(СтрокаВыписки.Комментарий,"##",НаправлениеПоиска.СНачала,,1);
			ПозицияВторогоРазлелителя = СтрНайти(СтрокаВыписки.Комментарий,"##",НаправлениеПоиска.СНачала,,2);
			Если ПозицияПервогоРазлелителя>0 И ПозицияВторогоРазлелителя>0 Тогда
			
				СтрокаУникальныйИдентификатор = СРЕД(СтрокаВыписки.Комментарий,ПозицияПервогоРазлелителя+2,36);
				
				СтрокаВыписки._СсылкаНаДокумент  = ПолучитьСсылкуНаДокументПоУникальномуИдентификатору(СтрокаУникальныйИдентификатор);
			
			КонецЕсли;
		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) Тогда
			
			СтрокаВыписки._СсылкаНаДокумент  = Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиДокументПоИД(СтрокаВыписки.ID);
			
			Если НЕ ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) 
				И (
				ЗначениеЗаполнено(СтрокаВыписки.Дата)
				И 
				ЗначениеЗаполнено(СтрокаВыписки.НомерДокумента)
				)
				Тогда
				
				СтрокаВыписки._СсылкаНаДокумент = Обработки.ПомощникЗагрузкиБанковскойВыписки.НайтиДокументПоШаблонуДатеИНомеру(СтрокаВыписки._ШаблонЗаполнения,СтрокаВыписки.Дата,СтрокаВыписки.НомерДокумента,СтрокаВыписки.СуммаКт,СтрокаВыписки.СуммаДт);	
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаВыписки._СсылкаНаДокумент) Тогда 
			СтрокаВыписки.ДокументПроведен  = СтрокаВыписки._СсылкаНаДокумент.Проведен; 
		КонецЕсли;
		
		СтрокаВыписки.Контрагент1С      = НайтиКонтрагента(пИНН,СтрокаВыписки.Наименование,СтрокаВыписки.СчетБанк);//СтрокаВыписки.ИНН
		СтрокаВыписки.Подотчетник1С     = НайтиПодотчетника(пИНН, СтрокаВыписки.СчетБанк);							//СтрокаВыписки.ИНН  
		//ВладелецСчета = ?(ЗначениеЗаполнено(СтрокаВыписки.Контрагент1С), СтрокаВыписки.Контрагент1С, СтрокаВыписки.Подотчетник1С.Физлицо);
		ВладелецСчета = ?(ЗначениеЗаполнено(СтрокаВыписки.Контрагент1С), СтрокаВыписки.Контрагент1С, СтрокаВыписки.Подотчетник1С);//++Lazare 05.04.2024
		СтрокаВыписки.СчетКонтрагента1С = НайтиСчет(ВладелецСчета,СтрокаВыписки.СчетБанк);
		                     
		Если СтрокаВыписки._ШаблонЗаполнения = СсылкаПустогоШаблона И НЕ СтрокаУжеУдалялась Тогда 					 
			//МассивУдаления.Добавить(СтрокаВыписки);
		КонецЕсли;
		
		СтрокаУжеУдалялась = ЛОЖЬ;
		
	КонецЦикла;
	
	Для каждого стрМУд Из МассивУдаления Цикл
		врТаблицаВыписки.Удалить(стрМУд);
	КонецЦикла;
	
	Объект.ТаблицаВыписки.Загрузить(врТаблицаВыписки);


КонецПроцедуры // ()

&НаСервере
Функция ПреобразоватьВДату(ДатаСтрока)
	
	ТекДата = "";	
	Попытка
		врДенъ  = Лев(ДатаСтрока,2);
		врМесяц = Сред(ДатаСтрока,4,2);
		врГод   = Прав(ДатаСтрока,4);
		
		ТекДата = Дата(врГод+врМесяц+врДенъ);
	Исключение
	КонецПопытки;
	
	Возврат ТекДата;
	
КонецФункции

&НаСервере
//Функция НайтиКонтрагента(ИНН,Наименование)
//	
//	наидКонтрагент = Неопределено;
//	Если Не (ЗначениеЗаполнено(ИНН) ИЛИ ЗначениеЗаполнено(Наименование)) Тогда
//		Возврат наидКонтрагент;
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(ИНН) Тогда
//		
//		наидКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",ИНН);
//		Если Не ЗначениеЗаполнено(наидКонтрагент) Тогда 
//			наидКонтрагент = Справочники.Контрагенты.НайтиПоНаименованию(Наименование);
//		КонецЕсли;
//		
//	ИначеЕсли ЗначениеЗаполнено(Наименование) Тогда 
//		наидКонтрагент = Справочники.Контрагенты.НайтиПоНаименованию(Наименование);
//	КонецЕсли;
	

Функция НайтиКонтрагента(ИНН, Наименование, СчетБанк = Неопределено)
	
	наидКонтрагент = Неопределено;
	//Если Не (ЗначениеЗаполнено(ИНН) ИЛИ ЗначениеЗаполнено(Наименование)) Тогда 
	Если Не (ЗначениеЗаполнено(ИНН) ИЛИ ЗначениеЗаполнено(СчетБанк)) Тогда
		Возврат наидКонтрагент;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		
		наидКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",ИНН);
		Если Не ЗначениеЗаполнено(наидКонтрагент) Тогда 
			//наидКонтрагент = Справочники.Контрагенты.НайтиПоНаименованию(Наименование);           
			ПоискСчет = Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", СчетБанк);   
			Если ЗначениеЗаполнено(ПоискСчет) Тогда 
				наидКонтрагент = ПоискСчет.Владелец;
			КонецЕсли;
		КонецЕсли;
		
	//ИначеЕсли ЗначениеЗаполнено(Наименование) Тогда  
	ИначеЕсли ЗначениеЗаполнено(СчетБанк) Тогда
		//наидКонтрагент = Справочники.Контрагенты.НайтиПоНаименованию(Наименование);  
		ПоискСчет = Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", СчетБанк);   
		Если ЗначениеЗаполнено(ПоискСчет) Тогда  
			Если ТипЗнч(ПоискСчет.Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда 
				наидКонтрагент = ПоискСчет.Владелец;      
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат наидКонтрагент;
	
КонецФункции //   

&НаСервере
//Функция НайтиПодотчетника(ЛичныйНомер)
//	
//	ЗнчВозврата = Справочники.Сотрудники.ПустаяСсылка();
//	Если Не ЗначениеЗаполнено(ЛичныйНомер) Тогда 
//		Возврат ЗнчВозврата;
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Сотрудники.Ссылка
//	|ИЗ
//	|	Справочник.Сотрудники КАК Сотрудники
//	|ГДЕ
//	|	НЕ Сотрудники.ПометкаУдаления
//	|	И Сотрудники.Физлицо.ИНН = &ПерсональныйНомер
//	|	И НЕ Сотрудники.Физлицо.ПометкаУдаления";
//	
//	Запрос.УстановитьПараметр("ПерсональныйНомер", ЛичныйНомер);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
//		
//		ЗнчВозврата = ВыборкаДетальныеЗаписи.Ссылка;
//		
//	КонецЕсли;  

Функция НайтиПодотчетника(ЛичныйНомер, СчетБанк = Неопределено)
	
	ЗнчВозврата = Справочники.Сотрудники.ПустаяСсылка();
	Если ЗначениеЗаполнено(ЛичныйНомер) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.ПометкаУдаления
		|	И Сотрудники.Физлицо.ИНН = &ПерсональныйНомер
		|	И НЕ Сотрудники.Физлицо.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ПерсональныйНомер", ЛичныйНомер);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			ЗнчВозврата = ВыборкаДетальныеЗаписи.Ссылка;
			
		КонецЕсли; 
		
	ИначеЕсли ЗначениеЗаполнено(СчетБанк) Тогда     
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ПО Сотрудники.Физлицо = БанковскиеСчета.Владелец
		|ГДЕ
		|	НЕ Сотрудники.ПометкаУдаления
		|	И НЕ Сотрудники.Физлицо.ПометкаУдаления
		|	И БанковскиеСчета.НомерСчета = &НомерСчета";
		
		Запрос.УстановитьПараметр("НомерСчета", СчетБанк);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда

			ЗнчВозврата = ВыборкаДетальныеЗаписи.Ссылка;  
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗнчВозврата;
	
КонецФункции //

&НаСервере
Функция НайтиСчет(Контрагент1С,СчетБанк)
	
	ЗнчВозврата = Справочники.БанковскиеСчета.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Контрагент1С) Тогда 
		наидСчет = Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", СчетБанк,,Контрагент1С); 
	Иначе
		наидСчет = Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", СчетБанк);
	КонецЕсли;
	
	Если наидСчет.Владелец = Контрагент1С Тогда
		ЗнчВозврата =  наидСчет;
	КонецЕсли;
	
	Возврат ЗнчВозврата;
	
КонецФункции //

&НаСервере
Функция СоответствоватьШаблонЗаполнения(СтрокаВыписки) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШаблоныЗаполнения.Ссылка КАК ШаблонЗаполнения
	               |ИЗ
	               |	Справочник.ШаблоныЗаполнения КАК ШаблоныЗаполнения
	               |ГДЕ
	               |	НЕ ШаблоныЗаполнения.ПометкаУдаления
	               |	И ШаблоныЗаполнения.ТипОбменаСИнтернетБанком = &ТипОбменаСИнтернетБанком
	               |	И ШаблоныЗаполнения.Действующий";
	
	Запрос.УстановитьПараметр("ТипОбменаСИнтернетБанком", Объект.ТипОбменаСИнтернетБанком);			   
	Результат = Запрос.Выполнить();
	стрШаблонЗаполнения = Результат.Выбрать();
	
	
	
	//Для Каждого стрШаблонЗаполнения Из ШаблоныЗаполнения Цикл 
	Пока стрШаблонЗаполнения.Следующий() Цикл 
		
		//стрШаблонЗаполнения = Выборка.Ссылка; 
		НастройкиШаблонЗаполнения =  стрШаблонЗаполнения.ШаблонЗаполнения.ХранилищеНастроекКомпоновкиДанных.получить();
		ВнешниеНаборыДанных=Новый Структура;
		ВнешниеНаборыДанных.Вставить("ВнешниеДанные",СтрокаВыписки);

		Если BOG Тогда
			СхемаКомпоновкиДанных = Справочники.ШаблоныЗаполнения.ПолучитьМакет("МакетЗагрузкиВыписокСФайла_BOG");
		ИначеЕсли TBC Тогда
			СхемаКомпоновкиДанных = Справочники.ШаблоныЗаполнения.ПолучитьМакет("МакетЗагрузкиВыписокСФайла_TBC");
		ИначеЕсли CARTU Тогда
			СхемаКомпоновкиДанных = Справочники.ШаблоныЗаполнения.ПолучитьМакет("МакетЗагрузкиВыписокСФайла_CARTU");
		ИначеЕсли VTB Тогда
			СхемаКомпоновкиДанных = Справочники.ШаблоныЗаполнения.ПолучитьМакет("МакетЗагрузкиВыписокСФайла_VTB");   
		ИначеЕсли ProCredit Тогда
			СхемаКомпоновкиДанных = Справочники.ШаблоныЗаполнения.ПолучитьМакет("МакетЗагрузкиВыписокСФайла_ProCredit");
		КонецЕсли;
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиШаблонЗаполнения,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		//МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиШаблонЗаполнения);
		
		// Построение таблицы значений.
		Процессор = Новый ПроцессорКомпоновкиДанных;
		Процессор.Инициализировать(МакетКомпоновкиДанных,ВнешниеНаборыДанных);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
		ИсходныеДанные  = Новый ТаблицаЗначений;
		ПроцессорВывода.УстановитьОбъект(ИсходныеДанные);
		ПроцессорВывода.Вывести(Процессор);
		Если ИсходныеДанные.Количество() Тогда 
			Возврат  стрШаблонЗаполнения.ШаблонЗаполнения;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат  Справочники.ШаблоныЗаполнения.ПустаяСсылка();

КонецФункции


&НаСервере
Функция ПолучитьСтруктуруСоответствииКолонок(ТипОбмена, КоличествоКолонок = 0, ВариантЗагрузки = 0)
	
	СтруктураКолонок = Новый Структура;
	
	//Макет = Обработки.ОбменСБанкомСФайлом.ПолучитьМакет("СоответствиеКолонокЗагрузкиВыписокСФайла");
	Макет =  Справочники.ШаблоныЗаполнения.ПолучитьМакет("СоответствиеКолонокЗагрузкиВыписокСФайла");
	Если ТипОбмена = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia Тогда 
		
		Если ВариантЗагрузки = 0 Тогда 
			Если Объект.БанковскийСчет.ВалютаДенежныхСредств = Константы.ВалютаУчета.Получить() Тогда 
				ОбластьКолонок = Макет.ПолучитьОбласть("BOG_Excel");
			Иначе
				Если КоличествоКолонок = 34 Тогда
					ОбластьКолонок = Макет.ПолучитьОбласть("РасширеннаяBOG_Excel");//BOG_Вал_Excel");
				Иначе
					ОбластьКолонок = Макет.ПолучитьОбласть("BOG_Вал_Excel");
				КонецЕсли;
			КонецЕсли;
		Иначе 
			Если КоличествоКолонок = 34 Тогда 
		        ОбластьКолонок = Макет.ПолучитьОбласть("РасширеннаяBOG_Excel");
			ИначеЕсли Объект.БанковскийСчет.ВалютаДенежныхСредств = Константы.ВалютаУчета.Получить() Тогда 
				ОбластьКолонок = Макет.ПолучитьОбласть("BOG_Excel");
			Иначе
				ОбластьКолонок = Макет.ПолучитьОбласть("BOG_Вал_Excel");
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипОбмена = Перечисления.ТипыОбменаСИнтернетБанком.TBC Тогда 
		
		ОбластьКолонок = Макет.ПолучитьОбласть("TBC_Excel");
			
	ИначеЕсли ТипОбмена = Перечисления.ТипыОбменаСИнтернетБанком.Cartu Тогда 
		
		ОбластьКолонок = Макет.ПолучитьОбласть("CARTU_Excel");
		
	ИначеЕсли ТипОбмена = Перечисления.ТипыОбменаСИнтернетБанком.VTB Тогда 
		
		ОбластьКолонок = Макет.ПолучитьОбласть("VTB_Excel");
		
	ИначеЕсли ТипОбмена = Перечисления.ТипыОбменаСИнтернетБанком.ProCredit Тогда 
		
		Если КоличествоКолонок = 22 ИЛИ КоличествоКолонок = 0 Тогда
			ОбластьКолонок = Макет.ПолучитьОбласть("ProCredit_Excel");
		Иначе
			ОбластьКолонок = Макет.ПолучитьОбласть("РасширеннаяProCredit_Excel");
		КонецЕсли;
		
	КонецЕсли;                                   
	
	Если ОбластьКолонок <> Неопределено Тогда 
		Колонка1с = "";
		Для Сч = 1 По ОбластьКолонок.ВысотаТаблицы   Цикл 
			//Колонка1с = ОбластьКолонок.Область(Сч, 5, Сч,5).Текст;
			Колонка1с = ОбластьКолонок.Область(Сч, 5).Текст;
			Если ЗначениеЗаполнено(Колонка1с) Тогда 
				ЗначениеЯчейки = ОбластьКолонок.Область(Сч, 1).Текст;
				ЧислоЗначенияЯчейки = Число(ЗначениеЯчейки);
				СтруктураКолонок.Вставить(Колонка1с, ЧислоЗначенияЯчейки);
				//СтруктураКолонок.Вставить(Колонка1с,Число(ОбластьКолонок.Область(Сч, 1, Сч, 1).Текст));
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураКолонок;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗапольнитьФормуПоУмолчанию();
	
	BOG = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia;
	TBC = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC;
	CARTU = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.Cartu;
	VTB = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.VTB;
	ProCredit = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.ProCredit;
	
	ОграничитьДоступныеБанки();
	
	Если ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда 
		БанковскийСчетПриИзмененииНаСервере();
	КонецЕсли;

	УстановитьВидимость();
	
	//Таб.Параметры.УстановитьЗначениеПараметра("Таб", ТаблицаВыписки.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()

	Элементы.ТаблицаВыпискиТипТранзакцийБВ.Видимость 	= TBC;
	Элементы.ТаблицаВыпискиTransactionID.Видимость 		= TBC;
	//Элементы.ДополнитьДокументКонвертации.Видимость		= TBC;

КонецПроцедуры

&НаСервере
Процедура ОграничитьДоступныеБанки()

	//Элементы.ТипОбменаСИнтернетБанком.СписокВыбора.Удалить(1);

КонецПроцедуры

&НаСервере
Процедура ЗапольнитьФормуПоУмолчанию()

	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Объект.Автор = ТекПользователь ;
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяОрганизация");
	Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
		Если Объект.Организация <> ЗначениеНастройки Тогда
			Объект.Организация = ЗначениеНастройки;
		КонецЕсли;
	Иначе
		Объект.Организация = Справочники.Организации.ОсновнаяОрганизация;
	КонецЕсли;
	
	Объект.БанковскийСчет = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнойБанковскийСчет");
	
	Если ЗначениеЗаполнено(Объект.БанковскийСчет.Банк) Тогда
	
		Если Объект.БанковскийСчет.Банк.СВИФТБИК = "BAGAGE22" Тогда
		
			Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia;
			
		ИначеЕсли Объект.БанковскийСчет.Банк.СВИФТБИК = "TBCBGE22" Тогда
		
			Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC;
			
		ИначеЕсли Объект.БанковскийСчет.Банк.СВИФТБИК = "MIBGGE22" Тогда  //ПроКредит
			
			Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.ProCredit;
			
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры // ()

&НаКлиенте
Процедура ТипОбменаСИнтернетБанкомПриИзменении(Элемент)
	ТипОбменаСИнтернетБанкомПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТипОбменаСИнтернетБанкомПриИзмененииНаСервере()
	
	BOG = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia;
	TBC = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC;
	CARTU = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.Cartu;
	VTB = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.VTB; 
	ProCredit = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.ProCredit; 
	
	Если ЗначениеЗаполнено(Объект.БанковскийСчет) И ЗначениеЗаполнено(Объект.БанковскийСчет.Банк) Тогда
	
		Если BOG И НЕ(Объект.БанковскийСчет.Банк.СВИФТБИК = "BAGAGE22") Тогда
		
			Объект.БанковскийСчет = НЕОПРЕДЕЛЕНО;
			
		ИначеЕсли TBC И НЕ(Объект.БанковскийСчет.Банк.СВИФТБИК = "TBCBGE22") Тогда
		
			Объект.БанковскийСчет = НЕОПРЕДЕЛЕНО;
			
		ИначеЕсли CARTU И НЕ(Объект.БанковскийСчет.Банк.СВИФТБИК = "CRTUGE22") Тогда
		
			Объект.БанковскийСчет = НЕОПРЕДЕЛЕНО;  
			
		ИначеЕсли ProCredit И НЕ(Объект.БанковскийСчет.Банк.СВИФТБИК = "MIBGGE22") Тогда //ПроКредит
		
			Объект.БанковскийСчет = НЕОПРЕДЕЛЕНО;
		
		КонецЕсли;
	
	КонецЕсли;
	
	УстановитьВидимость();	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере(СтруктураБанков)
	
	воОбъект =  РеквизитФормыВЗначение("Объект");
	воОбъект.СоздатьДокументы(СтруктураБанков);
	ЗначениеВРеквизитФормы(воОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда) 
	
	СтруктураБанков = Новый Структура;
	СтруктураБанков.Вставить("ЭтоBOG", BOG);  
	СтруктураБанков.Вставить("ЭтоTBC", TBC);
	СтруктураБанков.Вставить("ЭтоVTB", VTB);
	СтруктураБанков.Вставить("ЭтоCARTU", CARTU);
	СтруктураБанков.Вставить("ЭтоProCredit", ProCredit);
	
	СоздатьДокументыНаСервере(СтруктураБанков);
КонецПроцедуры

&НаСервере
Функция ПереводВДату(ДатаСтрока) Экспорт
	
	День = Сред(ДатаСтрока, 9, 2);
	Месяц = Сред(ДатаСтрока, 6, 2);
	Год = Сред(ДатаСтрока, 1, 4);

	Если ДатаСтрока = Неопределено или СтрДлина(ДатаСтрока) > 10 Тогда
		Час = Сред(ДатаСтрока, 12, 2);
		Минута = Сред(ДатаСтрока, 15, 2);
		Секунда = Сред(ДатаСтрока, 18, 2);
		Возврат Дата(Год, Месяц, День, Час, Минута, Секунда);
	ИначеЕсли Год <> "" и Месяц <> "" и День <> "" Тогда
		Возврат Дата(Год, Месяц, День);
	Иначе
		Возврат Дата('00010101');
	КонецЕсли;
	
КонецФункции

&НаСервере 
Процедура ОтправитьНаСервере(ПараметрыЗапроса, Токен, IDИКоличествоСтрок)
	
	МенеджерОбработки = Обработки.ИнтеграцияСБанком;
	
	IDИКоличествоСтрок = МенеджерОбработки.ВыполнитьМетодСервиса("api/statement/", ПараметрыЗапроса, 1, Токен, Истина);

КонецПроцедуры

&НаСервере
Процедура БанковскийСчетПриИзмененииНаСервере()
	НомерСчета = Объект.БанковскийСчет.НомерСчета; 
	Валюта = Объект.БанковскийСчет.ВалютаДенежныхСредств;
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетПриИзменении(Элемент)
	БанковскийСчетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТаблицаВыписки_СсылкаНаДокументПриИзмененииНаСервере(IDСтроки)    
	
	ТекущаяСтрока = Объект.ТаблицаВыписки.НайтиПоИдентификатору(IDСтроки); 
	Если ЗначениеЗаполнено(ТекущаяСтрока._СсылкаНаДокумент) Тогда 
		ТекущаяСтрока.ДокументПроведен = ТекущаяСтрока._СсылкаНаДокумент.Проведен;
	Иначе
		ТекущаяСтрока.ДокументПроведен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыписки_СсылкаНаДокументПриИзменении(Элемент)     
	
	ТекущаяСтрока = Элементы.ТаблицаВыписки.ТекущиеДанные;     
	IDСтроки = ТекущаяСтрока.ПолучитьИдентификатор(); 
	
	ТаблицаВыписки_СсылкаНаДокументПриИзмененииНаСервере(IDСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БанковскийСчетУстановитьПараметрыВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	БанковскийСчетУстановитьПараметрыВыбора();
	
КонецПроцедуры

&НаСервере
Процедура БанковскийСчетУстановитьПараметрыВыбора()

	МассивПараметров = Новый Массив();
	
	Если ЗначениеЗаполнено(Объект.ТипОбменаСИнтернетБанком) Тогда
	
		СВИФТ = НЕОПРЕДЕЛЕНО;
		
		Если BOG Тогда
		
			СВИФТ = "BAGAGE22";
			
		ИначеЕсли TBC Тогда
		
			СВИФТ = "TBCBGE22";
			
		ИначеЕсли CARTU Тогда
		
			СВИФТ = "CRTUGE22";
			
		ИначеЕсли ProCredit Тогда  //ПроКредит
		
			СВИФТ = "MIBGGE22";

		КонецЕсли;
		
		Если НЕ СВИФТ = НЕОПРЕДЕЛЕНО Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Банки.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Банки КАК Банки
			|ГДЕ
			|	НЕ Банки.ПометкаУдаления
			|	И Банки.СВИФТБИК = &СВИФТ";
			
			Запрос.УстановитьПараметр("СВИФТ", СВИФТ);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			МассивБанков = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
			
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Банк", Новый ФиксированныйМассив(МассивБанков));
			МассивПараметров.Добавить(НовыйПараметр);
		
		КонецЕсли;
	
	КонецЕсли;
	
	Элементы.БанковскийСчет.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);

КонецПроцедуры

#Область ПолучениеБанковскойВыпискиИзTBC

&НаКлиенте
Процедура ЗавершениеВводаПароляDigiPass(Результат, ДополнительныеПараметры) ЭКСПОРТ
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ПараметрыСоединенияТБС = ДополнительныеПараметры.ПараметрыСоединенияТБС;
		СтруктураПарметровЗапросаВБанк = ДополнительныеПараметры.СтруктураПарметровЗапросаВБанк;
		
		ПараметрыСоединенияТБС.Nonce = Результат;
		ПолучитьБанковскуюВыпискуИзTBC(ПараметрыСоединенияТБС,СтруктураПарметровЗапросаВБанк);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьБанковскуюВыпискуИзTBC(ПараметрыСоединенияТБС, СтруктураПарметровЗапросаВБанк) ЭКСПОРТ

	ИнтеграцияСБанкомTBC_КлиентСервер.ВыполнитьЗапросВБанк(ПараметрыСоединенияТБС, СтруктураПарметровЗапросаВБанк);
	
	ОбработатьРезультатыПолученияБанковскойВыпискиИзTBC(СтруктураПарметровЗапросаВБанк);

КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатыПолученияБанковскойВыпискиИзTBC(СтруктураПарметровЗапросаВБанк)
	
	ТаблицаБанковскойВыписки = Новый ТаблицаЗначений();
	ТаблицаБанковскойВыписки.Колонки.Добавить("Date",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаБанковскойВыписки.Колонки.Добавить("description", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("additionalInformation", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("PaidOut",Новый ОписаниеТипов("Число"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("PaidIn",Новый ОписаниеТипов("Число"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("Balance",Новый ОписаниеТипов("Число"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("Type", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("DocumentDate",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаБанковскойВыписки.Колонки.Добавить("documentNumber", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("partnerAccountNumber", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("partnerName", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("partnerTaxCode", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("partnerBankCode", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("partnerBank", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("intermediaryBankCode", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("intermediaryBank", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("chargeDetail", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("taxpayerCode", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("taxpayerName", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("treasuryCode", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("operationCode", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("additionalDescription", Новый ОписаниеТипов("Строка"));
	//ТаблицаБанковскойВыписки.Колонки.Добавить("СсылкаНаДокумент", ОбщегоНазначения.ОписаниеТипаВсеСсылки());
	ТаблицаБанковскойВыписки.Колонки.Добавить("TransactionID", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("currency", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("exchangeRate", Новый ОписаниеТипов("Число"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("СсылкаНаДокумент", ОбщегоНазначения.ОписаниеТипаВсеСсылки());
	
	ТаблицаДвиженийПоСчету = ПолучитьИзВременногоХранилища(СтруктураПарметровЗапросаВБанк.ТаблицаДвиженийПоСчету);
	Если ТаблицаДвиженийПоСчету.Количество()>0 Тогда
	
		Для каждого СтрокаТаблицаДвиженийПоСчету Из ТаблицаДвиженийПоСчету Цикл
		
			СтрокаТаблицаБанковскойВыписки = ТаблицаБанковскойВыписки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицаБанковскойВыписки,СтрокаТаблицаДвиженийПоСчету,,"DocumentDate");
			
			Если СтрокаТаблицаДвиженийПоСчету.debitCredit = "1" Тогда //+++ Дмгг поменял местами "0" и "1", ребята писали что не верно
				СтрокаТаблицаБанковскойВыписки.PaidOut = 0;
				СтрокаТаблицаБанковскойВыписки.PaidIn = Число(СтрокаТаблицаДвиженийПоСчету.amount);
			ИначеЕсли СтрокаТаблицаДвиженийПоСчету.debitCredit = "0" Тогда
				СтрокаТаблицаБанковскойВыписки.PaidOut = Число(СтрокаТаблицаДвиженийПоСчету.amount);
				СтрокаТаблицаБанковскойВыписки.PaidIn = 0;
			КонецЕсли;
			
			СтрокаТаблицаБанковскойВыписки.Date = ПрочитатьДатуJSON(ЛЕВ(СтрокаТаблицаДвиженийПоСчету.valueDate,19),ФорматДатыJSON.ISO);
			СтрокаТаблицаБанковскойВыписки.DocumentDate = ПрочитатьДатуJSON(ЛЕВ(СтрокаТаблицаДвиженийПоСчету.documentDate,19),ФорматДатыJSON.ISO);
			
			Если СтрокаТаблицаДвиженийПоСчету.transactionType = "1" Тогда
				СтрокаТаблицаБанковскойВыписки.Type = "საკუთარ ანგარიშებს შორის გადარიცხვა";
			ИначеЕсли СтрокаТаблицаДвиженийПоСчету.transactionType = "5" Тогда
				СтрокаТаблицаБанковскойВыписки.Type = "კონვერტაცია";	
			ИначеЕсли СтрокаТаблицаДвиженийПоСчету.transactionType = "20" Тогда
				СтрокаТаблицаБанковскойВыписки.Type = "შემოსავლები";
			ИначеЕсли СтрокаТаблицаДвиженийПоСчету.transactionType = "30" Тогда
				СтрокаТаблицаБанковскойВыписки.Type = "გადარიცხვა და თანხის გატანა";
			ИначеЕсли СтрокаТаблицаДвиженийПоСчету.transactionType = "31" Тогда
				СтрокаТаблицаБанковскойВыписки.Type = "კომუნალური, მობილური, ჯარიმები";
			ИначеЕсли СтрокаТаблицаДвиженийПоСчету.transactionType = "32" Тогда
				СтрокаТаблицаБанковскойВыписки.Type = "საბიუჯეტო გადარიცხვები";
			ИначеЕсли СтрокаТаблицаДвиженийПоСчету.transactionType = "33" Тогда
				СтрокаТаблицаБанковскойВыписки.Type = "სხვა ხარჯები";
			КонецЕсли;
			
			Если НЕ ТипЗНЧ(СтрокаТаблицаДвиженийПоСчету.partnerTaxCode)=Тип("Строка") Тогда
				СтрокаТаблицаБанковскойВыписки.partnerTaxCode = "";
			КонецЕсли;       
			
			Если СтрокаТаблицаДвиженийПоСчету.exchangeRate = NULL ИЛИ СтрокаТаблицаДвиженийПоСчету.exchangeRate = Неопределено
					ИЛИ СтрокаТаблицаДвиженийПоСчету.exchangeRate = "" Тогда 
				СтрокаТаблицаБанковскойВыписки.exchangeRate = 1
			Иначе        
				Если ТипЗнч(СтрокаТаблицаДвиженийПоСчету.exchangeRate) <> Тип("Структура") Тогда 
					//+++ Дмгг, 14.03.24, ONESOFT-3041
					ЗначениеКурса = Сред(СтрокаТаблицаДвиженийПоСчету.exchangeRate,9);
					СтрокаТаблицаБанковскойВыписки.exchangeRate = Число(Лев(ЗначениеКурса,СтрНайти(ЗначениеКурса," ")-1));					
					//+++ Дмгг, 14.03.24, ONESOFT-3041
					Курс1 = Сред(СтрокаТаблицаДвиженийПоСчету.exchangeRate,3,3);
					Курс2 = Прав(СтрокаТаблицаДвиженийПоСчету.exchangeRate,3);
					Если СтрокаТаблицаБанковскойВыписки.currency = Курс1 Тогда 
						СтрокаТаблицаБанковскойВыписки.currency = Курс2;
					Иначе
						СтрокаТаблицаБанковскойВыписки.currency = Курс1;
					КонецЕсли;       
				КонецЕсли;
				//СтрокаТаблицаБанковскойВыписки.currency = Сред(СтрокаТаблицаДвиженийПоСчету.exchangeRate,3,3);
			КонецЕсли;
			СтрокаТаблицаБанковскойВыписки.TransactionID = СокрЛП(СтрокаТаблицаДвиженийПоСчету.externalPaymentId);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	УИДДокументовВИнтернетБанке.ДокументСсылка КАК ДокументСсылка
			|ИЗ
			|	РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
			|ГДЕ
			|	УИДДокументовВИнтернетБанке.УИДДокументаВБанке = &УИДДокументаВБанке";
			
			Запрос.УстановитьПараметр("УИДДокументаВБанке", СтрокаТаблицаДвиженийПоСчету.paymentId);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				СтрокаТаблицаБанковскойВыписки.СсылкаНаДокумент = ВыборкаДетальныеЗаписи.ДокументСсылка;
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
	//+++ Дмгг
	ТаблицаБанковскойВыписки.Сортировать("Date Возр");
	//--- Дмгг
	
	МассивМассивов = Новый Массив();
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("Date"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("description"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("additionalInformation"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("PaidOut"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("PaidIn"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("Balance"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("Type"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("DocumentDate"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("documentNumber"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("partnerAccountNumber"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("partnerName"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("partnerTaxCode"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("partnerBankCode"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("partnerBank"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("intermediaryBankCode"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("intermediaryBank"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("chargeDetail"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("taxpayerCode"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("taxpayerName"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("treasuryCode"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("operationCode"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("additionalDescription"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("TransactionID")); 
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("currency"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("exchangeRate"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("СсылкаНаДокумент"));
	
	TBC_ЗагрузитьНаСервере(МассивМассивов,Перечисления.ТипыОбменаСИнтернетБанком.TBC,ИСТИНА);

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПолучитьБанковскуюВыпискуИзProcredit(ПараметрыСоединенияProCredit, СтруктураПарметровЗапросаВБанк) ЭКСПОРТ

	ИнтеграцияСБанкомProCredit_КлиентСервер.ВыполнитьЗапросВБанк(ПараметрыСоединенияProCredit, СтруктураПарметровЗапросаВБанк);
	
	ОбработатьРезультатыПолученияБанковскойВыпискиИзProCredit(СтруктураПарметровЗапросаВБанк);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВводаПароляOTP(Результат, ДополнительныеПараметры) ЭКСПОРТ
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ПараметрыСоединенияProCredit = ДополнительныеПараметры.ПараметрыСоединенияProCredit;
		СтруктураПарметровЗапросаВБанк = ДополнительныеПараметры.СтруктураПарметровЗапросаВБанк;
		
		ПараметрыСоединенияProCredit.OTP = СокрЛП(Результат);
		ПолучитьБанковскуюВыпискуИзProcredit(ПараметрыСоединенияProCredit,СтруктураПарметровЗапросаВБанк);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатыПолученияБанковскойВыпискиИзProCredit(СтруктураПарметровЗапросаВБанк)
	
	ТаблицаБанковскойВыписки = Новый ТаблицаЗначений();
	ТаблицаБанковскойВыписки.Колонки.Добавить("DOC_DATE",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаБанковскойВыписки.Колонки.Добавить("DOC_NUM", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("PMTTYPE", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("DEBIT",Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("DEBIT_NAME",Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("SENDER_BANK_CODE",Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("SENDER_BANK_NAME", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("CREDIT",	Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("CREDIT_NAME", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("RECEIVER_BANK_CODE", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("RECEIVER_ACC_NAME", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("DESCRIP", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("ADDITIONAL_INFORMATION", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("AMOUNT_DEBIT", Новый ОписаниеТипов("Число"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("AMOUNT_CREDIT", Новый ОписаниеТипов("Число"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("BALANCE", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("ADDED", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("EDITED", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("SENT", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("SENDER_TAX_CODE", Новый ОписаниеТипов("Строка")); 
	ТаблицаБанковскойВыписки.Колонки.Добавить("RECEIVER_TAX_CODE", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("OP_NUM", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("OP_CODE", Новый ОписаниеТипов("Строка"));
	ТаблицаБанковскойВыписки.Колонки.Добавить("OP_TYPE", Новый ОписаниеТипов("Строка")); // Kuzmich, 20.06.2024, (ONESOFT-3249) Помошник загрузки банковской выписки - ProCredit - тип операции
	ТаблицаБанковскойВыписки.Колонки.Добавить("СсылкаНаДокумент", ОбщегоНазначения.ОписаниеТипаВсеСсылки());
	
	ТаблицаДвиженийПоСчету = ПолучитьИзВременногоХранилища(СтруктураПарметровЗапросаВБанк.ТаблицаДвиженийПоСчету);
	Если ТаблицаДвиженийПоСчету.Количество()>0 Тогда
	
		Для каждого СтрокаТаблицаДвиженийПоСчету Из ТаблицаДвиженийПоСчету Цикл
		
			СтрокаТаблицаБанковскойВыписки = ТаблицаБанковскойВыписки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицаБанковскойВыписки,СтрокаТаблицаДвиженийПоСчету);
			
			Если СтрокаТаблицаДвиженийПоСчету.AMOUNT < 0 Тогда
				СтрокаТаблицаБанковскойВыписки.AMOUNT_CREDIT = 0;
				СтрокаТаблицаБанковскойВыписки.AMOUNT_DEBIT = Число(СтрокаТаблицаДвиженийПоСчету.AMOUNT) * (-1);
			ИначеЕсли СтрокаТаблицаДвиженийПоСчету.AMOUNT > 0 Тогда
				СтрокаТаблицаБанковскойВыписки.AMOUNT_CREDIT = Число(СтрокаТаблицаДвиженийПоСчету.AMOUNT);
				СтрокаТаблицаБанковскойВыписки.AMOUNT_DEBIT = 0;
			КонецЕсли;
			
			СтрокаТаблицаБанковскойВыписки.DOC_DATE = ПрочитатьДатуJSON(ЛЕВ(СтрокаТаблицаДвиженийПоСчету.DOC_DATE,19),ФорматДатыJSON.ISO);
			
			Если НЕ ТипЗНЧ(СтрокаТаблицаДвиженийПоСчету.RECEIVER_TAX_CODE)=Тип("Строка") Тогда
				СтрокаТаблицаБанковскойВыписки.RECEIVER_TAX_CODE = "";
			КонецЕсли;       
			
			Если НЕ ТипЗНЧ(СтрокаТаблицаДвиженийПоСчету.SENDER_TAX_CODE)=Тип("Строка") Тогда
				СтрокаТаблицаБанковскойВыписки.SENDER_TAX_CODE = "";
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	УИДДокументовВИнтернетБанке.ДокументСсылка КАК ДокументСсылка
			|ИЗ
			|	РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
			|ГДЕ
			|	УИДДокументовВИнтернетБанке.УИДДокументаВБанке = &УИДДокументаВБанке";
			
			Запрос.УстановитьПараметр("УИДДокументаВБанке", СтрокаТаблицаДвиженийПоСчету.OP_NUM);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				СтрокаТаблицаБанковскойВыписки.СсылкаНаДокумент = ВыборкаДетальныеЗаписи.ДокументСсылка;
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
	МассивМассивов = Новый Массив();            
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("DOC_DATE"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("DOC_NUM"));
	//МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("PMTTYPE"));
	//МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("OP_CODE"));// Kuzmich, 20.06.2024, (ONESOFT-3249) Помошник загрузки банковской выписки - ProCredit - тип операции, закомментировал
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("OP_TYPE"));// Kuzmich, 20.06.2024, (ONESOFT-3249) Помошник загрузки банковской выписки - ProCredit - тип операции
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("DEBIT"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("DEBIT_NAME"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("SENDER_BANK_CODE"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("SENDER_BANK_NAME"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("CREDIT"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("CREDIT_NAME"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("RECEIVER_BANK_CODE"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("RECEIVER_ACC_NAME"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("DESCRIP"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("ADDITIONAL_INFORMATION"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("AMOUNT_DEBIT"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("AMOUNT_CREDIT"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("BALANCE"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("ADDED"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("EDITED"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("SENT"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("SENDER_TAX_CODE")); 
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("RECEIVER_TAX_CODE"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("OP_NUM"));
	МассивМассивов.Добавить(ТаблицаБанковскойВыписки.ВыгрузитьКолонку("СсылкаНаДокумент"));
	
	ProCredit_ЗагрузитьНаСервере(МассивМассивов,Перечисления.ТипыОбменаСИнтернетБанком.ProCredit);

КонецПроцедуры

&НаСервере
Процедура ТаблицаВыписки_ШаблонЗаполненияПриИзмененииНаСервере(УИДСтроки)  
	
	ТекущаяСтрокаВыписки = Объект.ТаблицаВыписки.НайтиПоИдентификатору(УИДСтроки);
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрокаВыписки._ШаблонЗаполнения) Тогда 
		Возврат;
	КонецЕсли;
	
	ИскатьКонтрагента = Истина;
	ИскатьСотрудника = Ложь; 
	
	Если ЗначениеЗаполнено(ТекущаяСтрокаВыписки._ШаблонЗаполнения) 
		И (ТекущаяСтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "ВыплатаЗарплаты"
		И (ТекущаяСтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.ВыплатаАванса  
		ИЛИ ТекущаяСтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.ВыплатаЗарплаты
		ИЛИ ТекущаяСтрокаВыписки._ШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийВыплатыЗарплаты.НачислениеИВыплатаЗарплаты))
		ИЛИ ТекущаяСтрокаВыписки._ШаблонЗаполнения.СсылкаИсточника = "ПеремещениеДенежныхСредств" Тогда 
		
		ИскатьКонтрагента = Ложь;
		ИскатьСотрудника = Истина;
		
	КонецЕсли;     
	
	Если ИскатьКонтрагента Тогда     
		Если ЗначениеЗаполнено(СокрЛП(ТекущаяСтрокаВыписки.ИНН)) Тогда 
			ТекущаяСтрокаВыписки.Контрагент1С	= НайтиКонтрагента(ТекущаяСтрокаВыписки.ИНН, ТекущаяСтрокаВыписки.Наименование);    
			ТекущаяСтрокаВыписки.Подотчетник1С	= Справочники.Сотрудники.ПустаяСсылка();      
		Иначе              
			ТекущаяСтрокаВыписки.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(ТекущаяСтрокаВыписки.СчетБанк, "Контрагенты");
			Если ЗначениеЗаполнено(ТекущаяСтрокаВыписки.СчетКонтрагента1С) Тогда       
				ТекущаяСтрокаВыписки.Контрагент1С	= ТекущаяСтрокаВыписки.СчетКонтрагента1С.Владелец;    
				ТекущаяСтрокаВыписки.Подотчетник1С	= Справочники.Сотрудники.ПустаяСсылка();  
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ИскатьСотрудника Тогда  
		Если ЗначениеЗаполнено(СокрЛП(ТекущаяСтрокаВыписки.ИНН)) Тогда 
			ТекущаяСтрокаВыписки.Контрагент1С	=  Справочники.Контрагенты.ПустаяСсылка();
		ТекущаяСтрокаВыписки.Подотчетник1С  = НайтиПодотчетника(ТекущаяСтрокаВыписки.ИНН);      
		Иначе              
			ТекущаяСтрокаВыписки.СчетКонтрагента1С = НайтиСчетКазначенийстваПоНомеруСчета(ТекущаяСтрокаВыписки.СчетБанк, "Сотрудники");
			Если ЗначениеЗаполнено(ТекущаяСтрокаВыписки.СчетКонтрагента1С) Тогда       
				ТекущаяСтрокаВыписки.Контрагент1С	= Справочники.Контрагенты.ПустаяСсылка();    
				ТекущаяСтрокаВыписки.Подотчетник1С	= ТекущаяСтрокаВыписки.СчетКонтрагента1С.Владелец;  
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыписки_ШаблонЗаполненияПриИзменении(Элемент)  
	
	ТекущаяСтрокаВыписки = Элементы.ТаблицаВыписки.ТекущиеДанные;
	УИДСтроки = ТекущаяСтрокаВыписки.ПолучитьИдентификатор();
	ТаблицаВыписки_ШаблонЗаполненияПриИзмененииНаСервере(УИДСтроки);    
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаДокументПоУникальномуИдентификатору(СтрокаУникальныйИдентификатор)
	ПЕРЕМ РЕЗ;
	
	Если СтрДлина(СтрокаУникальныйИдентификатор)>0 Тогда
	
		Для Каждого МенеджерДокумента Из Документы Цикл 
			
			РЕЗ = МенеджерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаУникальныйИдентификатор));
			Если СтрНайти(Строка(РЕЗ),"Объект не найден")=0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

&НаКлиенте
Процедура ТаблицаВыпискиСчетКонтрагента1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекущаяСтрока = Элементы.ТаблицаВыписки.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Подотчетник1С) Тогда 
		
		ФизЛицо = ПолучитьФизЛицоИзСотрудникаНаСервере(ТекущаяСтрока.Подотчетник1С);   
		
		МассивПараметров = Новый Массив;
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ФизЛицо); 
		
		МассивПараметров.Добавить(НовыйПараметр);
		
		МассивПараметров.Добавить(НовыйПараметр);
		Элементы.ТаблицаВыпискиСчетКонтрагента1С.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров); 
		
	Иначе                  
		
		МассивПараметров = Новый Массив;
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ТекущаяСтрока.Контрагент1С);
		
		МассивПараметров.Добавить(НовыйПараметр);
		
		МассивПараметров.Добавить(НовыйПараметр);
		Элементы.ТаблицаВыпискиСчетКонтрагента1С.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);  
		
	КонецЕсли;     
	
КонецПроцедуры

Функция ПолучитьФизЛицоИзСотрудникаНаСервере(Сотрудник)
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Сотрудник.Физлицо;
	
КонецФункции

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр                      = НСтр("ka='ფაილი Excel 2007 (*.xlsx)|*.xlsx';ru='Книга Excel 2007 (*.xlsx)|*.xlsx';en='Book Excel 2007 (* .xlsx) | * .xlsx'");
	ДиалогВыбораФайла.Заголовок                   = Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "xlsx";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	//ДиалогВыбораФайла.ПолноеИмяФайла              = ИмяФайла;
	//ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Объект.ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПреобразоватьДату(СтркаПреобразования)
	
	СтрокаДаты = "";
	
	Год 	= Лев(СтркаПреобразования, 4);
	Месяц   = Сред(СтркаПреобразования, 6, 2);
	День    = Сред(СтркаПреобразования, 9, 2);
	Часы    = Сред(СтркаПреобразования, 12, 2);
	Минуты  = Сред(СтркаПреобразования, 15, 2);
	Секунды = Сред(СтркаПреобразования, 18, 2);
	
	СтрокаДаты = СтрокаДаты + День + "." + Месяц + "." + Год; // + " " + Часы + ":" + Минуты + ":" + Секунды;
	
	Возврат СтрокаДаты;
	
КонецФункции

&НаКлиенте
Функция ДатаВСтроку(Дата) 
	
	Если не ЗначениеЗаполнено(Дата) Тогда
		Возврат "";
	Иначе
		ДатаСтрока = Строка(Формат(Дата, "ДФ='yyyy-MM-dd'"));
		Возврат ДатаСтрока;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗапольнитьОрганизациюИАвтор()

	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Объект.Автор = ТекПользователь ;
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяОрганизация");
	Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
		Если Объект.Организация <> ЗначениеНастройки Тогда
			Объект.Организация = ЗначениеНастройки;
		КонецЕсли;
	Иначе
		Объект.Организация = УправлениеНебольшойФирмойСервер.ПолучитьПредопределеннуюОрганизацию();
	КонецЕсли;

КонецПроцедуры // ()

Функция НайтиДокументПоИД(ID)
	
	НаиденныйДок = Документы.РасходСоСчета.НайтиПоРеквизиту("ID",ID);
	
	Если НЕ ЗначениеЗаполнено(НаиденныйДок) Тогда 
		
		НаиденныйДок = Документы.ПоступлениеНаСчет.НайтиПоРеквизиту("ID",ID);
		
	//ИначеЕсли НЕ ЗначениеЗаполнено(НаиденныйДок) Тогда 
		Если НЕ ЗначениеЗаполнено(НаиденныйДок) Тогда 
			
			НаиденныйДок = Документы.ПеремещениеДС.НайтиПоРеквизиту("ID",ID);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НаиденныйДок;
	
КонецФункции

&НаСервере
Процедура ДополнитьДокументКонвертацииНаСервере()
	
	воОбъект =  РеквизитФормыВЗначение("Объект");
	воОбъект.ДополнитьДокументыКонвертации();
	ЗначениеВРеквизитФормы(воОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьДокументКонвертации(Команда)
	ДополнитьДокументКонвертацииНаСервере();
КонецПроцедуры
