Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетРабочегоВремениСотрудниковПериодыВремени.Ссылка.Организация КАК Организация,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.Сотрудник КАК Сотрудник,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.ГрафикРаботы КАК ГрафикРаботы,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.ТипУчета КАК ТипУчета,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.КоличествоЧасов КАК КоличествоЧасов,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.Возмещаемый КАК Возмещаемый,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.Ссылка.Дата КАК Период,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.ПричинаНевыхода КАК ПричинаНевыхода,
	//Паганини_
	|	УчетРабочегоВремениСотрудниковПериодыВремени.Приход КАК Приход,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.Уход КАК Уход,
	//_Паганини
	|	УчетРабочегоВремениСотрудниковПериодыВремени.ВремяНачала КАК ВремяНачала,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.ВремяОкончания КАК ВремяОкончания
	|ИЗ
	|	Документ.УчетРабочегоВремениСотрудников.ПериодыВремени КАК УчетРабочегоВремениСотрудниковПериодыВремени
	|ГДЕ
	|	УчетРабочегоВремениСотрудниковПериодыВремени.Ссылка = &Ссылка";
	
	ТаблицаУчетРабочегоВремениСотрудников = Запрос.Выполнить().Выгрузить();
	

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетРабочегоВремениСотрудников", ТаблицаУчетРабочегоВремениСотрудников);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()
