
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	// Инициализация данных документа.
	Документы.УчетРабочегоВремениСотрудников.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ОтразитьТаблицаУчетРабочегоВремениСотрудников(ДополнительныеСвойства, Движения, Отказ);
	
КонецПроцедуры

Процедура ОтразитьТаблицаУчетРабочегоВремениСотрудников(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаУчетРабочегоВремениСотрудников = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУчетРабочегоВремениСотрудников;
	
	Если Отказ
	 ИЛИ ТаблицаУчетРабочегоВремениСотрудников.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияУчетРабочегоВремени = Движения.УчетРабочегоВремениСотрудников;
	ДвиженияУчетРабочегоВремени.Записывать = Истина;
	ДвиженияУчетРабочегоВремени.Загрузить(ТаблицаУчетРабочегоВремениСотрудников);
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымУчета() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НевыходыНаРаботуСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	НевыходыНаРаботуСотрудниковСрезПоследних.ПричинаНевыхода КАК ПричинаНевыхода,
	|	НевыходыНаРаботуСотрудниковСрезПоследних.Возмещаемый КАК Возмещаемый
	|ПОМЕСТИТЬ ВТ_Невыходы
	|ИЗ
	|	РегистрСведений.НевыходыНаРаботуСотрудников.СрезПоследних КАК НевыходыНаРаботуСотрудниковСрезПоследних
	|ГДЕ
	|	НевыходыНаРаботуСотрудниковСрезПоследних.ДатаНачала <= &РабочийДень
	|	И НевыходыНаРаботуСотрудниковСрезПоследних.ДатаОкончания >= &РабочийДень
	|	И НевыходыНаРаботуСотрудниковСрезПоследних.Организация = &Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходыУходыСотрудников.Сотрудник КАК Сотрудник,
	|	ПриходыУходыСотрудников.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ_ПроходыСотрудников
	|ИЗ
	|	РегистрСведений.ПриходыУходыСотрудников КАК ПриходыУходыСотрудников
	|ГДЕ
	|	НЕ ПриходыУходыСотрудников.Сотрудник В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_Невыходы.Сотрудник КАК Сотрудник
	|				ИЗ
	|					ВТ_Невыходы КАК ВТ_Невыходы)
	|	И ПриходыУходыСотрудников.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&РабочийДень, ДЕНЬ) И КОНЕЦПЕРИОДА(&РабочийДень, ДЕНЬ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиРаботы.ГрафикРаботы КАК ГрафикРаботы,
	|	ГрафикиРаботы.ВремяНачала КАК ВремяНачала,
	|	ГрафикиРаботы.ВремяОкончания КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_ГрафикиРаботыДень
	|ИЗ
	|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
	|ГДЕ
	|	ГрафикиРаботы.ВремяНачала >= НАЧАЛОПЕРИОДА(&РабочийДень, ДЕНЬ)
	|	И ГрафикиРаботы.ВремяОкончания <= КОНЕЦПЕРИОДА(&РабочийДень, ДЕНЬ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПроходыСотрудников01.Сотрудник КАК Сотрудник,
	|	ВТ_ПроходыСотрудников01.Дата КАК Дата,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_ПроходыСотрудников02.Дата, ВТ_ПроходыСотрудников01.Дата)) КАК ПредыдущийПроход,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПроходыСотрудников02.Дата ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) + 1 КАК НомерПрохода,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ((СУММА(ВЫБОР
	|						КОГДА ВТ_ПроходыСотрудников02.Дата ЕСТЬ NULL
	|							ТОГДА 0
	|						ИНАЧЕ 1
	|					КОНЕЦ) + 1) / 2 КАК ЧИСЛО(5, 0))) = (СУММА(ВЫБОР
	|					КОГДА ВТ_ПроходыСотрудников02.Дата ЕСТЬ NULL
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ) + 1) / 2
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВыход
	|ПОМЕСТИТЬ ВТ_ВходыВыходыСотрудников
	|ИЗ
	|	ВТ_ПроходыСотрудников КАК ВТ_ПроходыСотрудников01
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроходыСотрудников КАК ВТ_ПроходыСотрудников02
	|		ПО ВТ_ПроходыСотрудников01.Сотрудник = ВТ_ПроходыСотрудников02.Сотрудник
	|			И ВТ_ПроходыСотрудников01.Дата > ВТ_ПроходыСотрудников02.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПроходыСотрудников01.Сотрудник,
	|	ВТ_ПроходыСотрудников01.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВходыВыходыСотрудников.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ВходыВыходыСотрудников.ЭтоВыход
	|				ТОГДА РАЗНОСТЬДАТ(ВТ_ВходыВыходыСотрудников.ПредыдущийПроход, ВТ_ВходыВыходыСотрудников.Дата, МИНУТА) / 60
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РабочихЧасов,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВТ_ВходыВыходыСотрудников.ЭтоВыход
	|				ТОГДА РАЗНОСТЬДАТ(ВТ_ВходыВыходыСотрудников.ПредыдущийПроход, ВТ_ВходыВыходыСотрудников.Дата, МИНУТА) / 60
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЧасовОтсутствие
	|ПОМЕСТИТЬ ВТ_ПрисутствиеНаРабочемМесте
	|ИЗ
	|	ВТ_ВходыВыходыСотрудников КАК ВТ_ВходыВыходыСотрудников
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВходыВыходыСотрудников.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВходыВыходыСотрудников.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ВТ_ВходыВыходыСотрудников.Дата > ВТ_ГрафикиРаботыДень.ВремяОкончания
	|			ТОГДА ВТ_ГрафикиРаботыДень.ВремяОкончания
	|		ИНАЧЕ ВТ_ВходыВыходыСотрудников.Дата
	|	КОНЕЦ КАК ВремяВыхода,
	|	ВЫБОР
	|		КОГДА ВТ_ВходыВыходыСотрудников.ПредыдущийПроход < ВТ_ГрафикиРаботыДень.ВремяНачала
	|			ТОГДА ВТ_ГрафикиРаботыДень.ВремяНачала
	|		ИНАЧЕ ВТ_ВходыВыходыСотрудников.ПредыдущийПроход
	|	КОНЕЦ КАК ВремяВхода,
	|	СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_ГрафикиРаботыДень.ВремяНачала КАК ВремяНачала,
	|	ВТ_ГрафикиРаботыДень.ВремяОкончания КАК ВремяОкончания,
	|	ВТ_ВходыВыходыСотрудников.Дата КАК ВыходТурникет,
	|	ВТ_ВходыВыходыСотрудников.ПредыдущийПроход КАК ВходТурникет
	|ПОМЕСТИТЬ ВТ_ВходыВыходыСотрудниковКорректировкаПоГрафику
	|ИЗ
	|	ВТ_ВходыВыходыСотрудников КАК ВТ_ВходыВыходыСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(
	|				&РабочийДень,
	|				Организация = &Организация
	|					И Сотрудник В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ВТ_ПроходыСотрудников.Сотрудник КАК Сотрудник
	|						ИЗ
	|							ВТ_ПроходыСотрудников КАК ВТ_ПроходыСотрудников)) КАК СотрудникиСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГрафикиРаботыДень КАК ВТ_ГрафикиРаботыДень
	|			ПО СотрудникиСрезПоследних.ГрафикРаботы = ВТ_ГрафикиРаботыДень.ГрафикРаботы
	|		ПО ВТ_ВходыВыходыСотрудников.Сотрудник = СотрудникиСрезПоследних.Сотрудник
	|ГДЕ
	|	ВТ_ВходыВыходыСотрудников.ЭтоВыход
	|	И ВТ_ВходыВыходыСотрудников.Дата > ВТ_ГрафикиРаботыДень.ВремяНачала
	|	И ВЫБОР
	|			КОГДА ВТ_ВходыВыходыСотрудников.Дата > ВТ_ГрафикиРаботыДень.ВремяОкончания
	|				ТОГДА ВТ_ГрафикиРаботыДень.ВремяОкончания
	|			ИНАЧЕ ВТ_ВходыВыходыСотрудников.Дата
	|		КОНЕЦ > ВЫБОР
	|			КОГДА ВТ_ВходыВыходыСотрудников.ПредыдущийПроход < ВТ_ГрафикиРаботыДень.ВремяНачала
	|				ТОГДА ВТ_ГрафикиРаботыДень.ВремяНачала
	|			ИНАЧЕ ВТ_ВходыВыходыСотрудников.ПредыдущийПроход
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВходыВыходыСотрудниковКорректировкаПоГрафику.Сотрудник КАК Сотрудник,
	|	ВТ_ВходыВыходыСотрудниковКорректировкаПоГрафику.ГрафикРаботы КАК ГрафикРаботы,
	|	СУММА(РАЗНОСТЬДАТ(ВТ_ВходыВыходыСотрудниковКорректировкаПоГрафику.ВремяВхода, ВТ_ВходыВыходыСотрудниковКорректировкаПоГрафику.ВремяВыхода, МИНУТА) / 60) КАК РабочихЧасов
	|ПОМЕСТИТЬ ВТ_ПрисутствиеНаРабочемМестеСКорректировкойГрафика
	|ИЗ
	|	ВТ_ВходыВыходыСотрудниковКорректировкаПоГрафику КАК ВТ_ВходыВыходыСотрудниковКорректировкаПоГрафику
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВходыВыходыСотрудниковКорректировкаПоГрафику.Сотрудник,
	|	ВТ_ВходыВыходыСотрудниковКорректировкаПоГрафику.ГрафикРаботы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВТ_ДанныеСотрудников
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(&РабочийДень, Организация = &Организация) КАК СотрудникиСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиРаботы.ГрафикРаботы КАК ГрафикРаботы,
	|	СУММА(ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ГрафикиРаботы.ВремяНачала, ГрафикиРаботы.ВремяОкончания, МИНУТА) / 60 КАК ЧИСЛО(5, 0))) КАК КоличествоЧасовПоГрафику,
	|	МИНИМУМ(ГрафикиРаботы.ВремяНачала) КАК ВремяНачала,
	|	МАКСИМУМ(ГрафикиРаботы.ВремяОкончания) КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_РабочиеЧасыПоГрафику
	|ИЗ
	|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
	|ГДЕ
	|	ГрафикиРаботы.ГрафикРаботы В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_ДанныеСотрудников.ГрафикРаботы КАК ГрафикРаботы
	|			ИЗ
	|				ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников)
	|	И НАЧАЛОПЕРИОДА(ГрафикиРаботы.ВремяНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&РабочийДень, ДЕНЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиРаботы.ГрафикРаботы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РабочиеЧасыПоГрафику.ГрафикРаботы КАК ГрафикРаботы,
	|	МИНИМУМ(ВТ_РабочиеЧасыПоГрафику.ВремяНачала) КАК ВремяНачала,
	|	МАКСИМУМ(ВТ_РабочиеЧасыПоГрафику.ВремяОкончания) КАК ВремяОкончания,
	|	ВТ_ДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВТ_РабочееВремяПоГрафику
	|ИЗ
	//+++ Дмгг
	//|	ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников,
	//|	ВТ_РабочиеЧасыПоГрафику КАК ВТ_РабочиеЧасыПоГрафику
	|	ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РабочиеЧасыПоГрафику КАК ВТ_РабочиеЧасыПоГрафику
	|		ПО ВТ_ДанныеСотрудников.ГрафикРаботы = ВТ_РабочиеЧасыПоГрафику.ГрафикРаботы
	//--- Дмгг
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеСотрудников.Сотрудник,
	|	ВТ_ДанныеСотрудников.СтруктурнаяЕдиница,
	|	ВТ_РабочиеЧасыПоГрафику.ГрафикРаботы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Работа) КАК ТипУчета,
	|	ВТ_РабочееВремяПоГрафику.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочееВремяПоГрафику.Сотрудник КАК Сотрудник,
	|	МИНИМУМ(ЕСТЬNULL(ВТ_ПроходыСотрудников.Дата, ДАТАВРЕМЯ(1, 1, 1))) КАК Приход,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ВТ_ПроходыСотрудников.Дата) = МИНИМУМ(ЕСТЬNULL(ВТ_ПроходыСотрудников.Дата, ДАТАВРЕМЯ(1, 1, 1)))
	|			ТОГДА МАКСИМУМ(ВТ_РабочееВремяПоГрафику.ВремяОкончания)
	|		ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(ВТ_ПроходыСотрудников.Дата, ДАТАВРЕМЯ(1, 1, 1)))
	|	КОНЕЦ КАК Уход,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_ПрисутствиеНаРабочемМесте.РабочихЧасов, 0)) КАК ОтработаноЧасов,
	|	ВТ_РабочееВремяПоГрафику.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПроходыСотрудников.Дата) КАК КоличествоПроходов,
	|	МИНИМУМ(ВТ_РабочееВремяПоГрафику.ВремяНачала) КАК ВремяНачала,
	|	МАКСИМУМ(ВТ_РабочееВремяПоГрафику.ВремяОкончания) КАК ВремяОкончания,
	|	МАКСИМУМ(ВТ_РабочиеЧасыПоГрафику.КоличествоЧасовПоГрафику) КАК ЧасовПоГрафику
	|ПОМЕСТИТЬ ВТ_РабочееВремя
	|ИЗ
	|	ВТ_РабочееВремяПоГрафику КАК ВТ_РабочееВремяПоГрафику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РабочиеЧасыПоГрафику КАК ВТ_РабочиеЧасыПоГрафику
	|		ПО ВТ_РабочееВремяПоГрафику.ГрафикРаботы = ВТ_РабочиеЧасыПоГрафику.ГрафикРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроходыСотрудников КАК ВТ_ПроходыСотрудников
	|		ПО (ВТ_ПроходыСотрудников.Сотрудник = ВТ_РабочееВремяПоГрафику.Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПрисутствиеНаРабочемМесте КАК ВТ_ПрисутствиеНаРабочемМесте
	|		ПО ВТ_РабочееВремяПоГрафику.Сотрудник = ВТ_ПрисутствиеНаРабочемМесте.Сотрудник
	|ГДЕ
	|	НЕ ВТ_РабочееВремяПоГрафику.Сотрудник В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_Невыходы.Сотрудник КАК Сотрудник
	|				ИЗ
	|					ВТ_Невыходы КАК ВТ_Невыходы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РабочееВремяПоГрафику.СтруктурнаяЕдиница,
	|	ВТ_РабочееВремяПоГрафику.ГрафикРаботы,
	|	ВТ_РабочееВремяПоГрафику.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_Невыходы.ПричинаНевыхода = ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.Отпуск)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Отпуск)
	|		КОГДА ВТ_Невыходы.ПричинаНевыхода = ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.Болезнь)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Больничный)
	|		КОГДА ВТ_Невыходы.ПричинаНевыхода = ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.Отгул)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Работа)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.ПустаяСсылка)
	|	КОНЕЦ КАК ТипУчета,
	|	ВТ_Невыходы.Сотрудник КАК Сотрудник,
	|	ВТ_Невыходы.Возмещаемый КАК Возмещаемый,
	|	ВТ_ДанныеСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_ДанныеСотрудников.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочиеЧасыПоГрафику.КоличествоЧасовПоГрафику КАК КоличествоЧасов,
	|	ВТ_Невыходы.ПричинаНевыхода КАК ПричинаНевыхода,
	|	ВТ_РабочиеЧасыПоГрафику.ВремяНачала КАК ВремяНачала,
	|	ВТ_РабочиеЧасыПоГрафику.ВремяОкончания КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_ПлановыеНевыходы
	|ИЗ
	|	ВТ_Невыходы КАК ВТ_Невыходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РабочиеЧасыПоГрафику КАК ВТ_РабочиеЧасыПоГрафику
	|			ПО ВТ_ДанныеСотрудников.ГрафикРаботы = ВТ_РабочиеЧасыПоГрафику.ГрафикРаботы
	|		ПО ВТ_Невыходы.Сотрудник = ВТ_ДанныеСотрудников.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РабочееВремя.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочееВремя.Сотрудник КАК Сотрудник,
	|	ВТ_РабочееВремя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫРАЗИТЬ(ВТ_РабочееВремя.ЧасовПоГрафику - ВТ_РабочееВремя.ОтработаноЧасов - ЕСТЬNULL(ВТ_ПлановыеНевыходы.КоличествоЧасов, 0) КАК ЧИСЛО(5, 2)) КАК ЧасовПрогула,
	|	ВТ_РабочееВремя.ВремяНачала КАК ВремяНачала,
	|	ВТ_РабочееВремя.ВремяОкончания КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_Прогулы
	|ИЗ
	|	ВТ_РабочееВремя КАК ВТ_РабочееВремя
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлановыеНевыходы КАК ВТ_ПлановыеНевыходы
	|		ПО ВТ_РабочееВремя.Сотрудник = ВТ_ПлановыеНевыходы.Сотрудник
	|ГДЕ
	|	ВТ_РабочееВремя.ЧасовПоГрафику - ВТ_РабочееВремя.ОтработаноЧасов - ЕСТЬNULL(ВТ_ПлановыеНевыходы.КоличествоЧасов, 0) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РабочееВремя.Сотрудник КАК Сотрудник,
	|	ВТ_РабочееВремя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_РабочееВремя.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочееВремя.ТипУчета КАК ТипУчета,
	|	ВТ_РабочееВремя.Приход КАК Приход,
	|	ВТ_РабочееВремя.Уход КАК Уход,
	//+++ Дмгг
	//|	ЕСТЬNULL(ВТ_ПрисутствиеНаРабочемМестеСКорректировкойГрафика.РабочихЧасов, 0) КАК КоличествоЧасов,
	|	ВТ_РабочееВремя.ОтработаноЧасов КАК КоличествоЧасов,
	//--- Дмгг
	|	ИСТИНА КАК Возмещаемый,
	|	NULL КАК ПричинаНевыхода,
	|	ВТ_РабочееВремя.ВремяНачала КАК ВремяНачала,
	|	ВТ_РабочееВремя.ВремяОкончания КАК ВремяОкончания
	|ИЗ
	|	ВТ_РабочееВремя КАК ВТ_РабочееВремя
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПрисутствиеНаРабочемМестеСКорректировкойГрафика КАК ВТ_ПрисутствиеНаРабочемМестеСКорректировкойГрафика
	|		ПО ВТ_РабочееВремя.Сотрудник = ВТ_ПрисутствиеНаРабочемМестеСКорректировкойГрафика.Сотрудник
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ПрисутствиеНаРабочемМестеСКорректировкойГрафика.РабочихЧасов, 0) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПлановыеНевыходы.Сотрудник,
	|	ВТ_ПлановыеНевыходы.СтруктурнаяЕдиница,
	|	ВТ_ПлановыеНевыходы.ГрафикРаботы,
	|	ВТ_ПлановыеНевыходы.ТипУчета,
	|	NULL,
	|	NULL,
	|	ВТ_ПлановыеНевыходы.КоличествоЧасов,
	|	ВТ_ПлановыеНевыходы.Возмещаемый,
	|	ВТ_ПлановыеНевыходы.ПричинаНевыхода,
	|	ВТ_ПлановыеНевыходы.ВремяНачала,
	|	ВТ_ПлановыеНевыходы.ВремяОкончания
	|ИЗ
	|	ВТ_ПлановыеНевыходы КАК ВТ_ПлановыеНевыходы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Прогулы.Сотрудник,
	|	ВТ_Прогулы.СтруктурнаяЕдиница,
	|	ВТ_Прогулы.ГрафикРаботы,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_Прогулы.ЧасовПрогула,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.БезПричины),
	|	ВТ_Прогулы.ВремяНачала,
	|	ВТ_Прогулы.ВремяОкончания
	|ИЗ
	|	ВТ_Прогулы КАК ВТ_Прогулы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	СтруктурнаяЕдиница,
	|	ТипУчета,
	|	Приход";
	Т3 =
	"ВЫБРАТЬ
	|	НевыходыНаРаботуСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	НевыходыНаРаботуСотрудниковСрезПоследних.ПричинаНевыхода КАК ПричинаНевыхода,
	|	НевыходыНаРаботуСотрудниковСрезПоследних.Возмещаемый КАК Возмещаемый
	|ПОМЕСТИТЬ ВТ_Невыходы
	|ИЗ
	|	РегистрСведений.НевыходыНаРаботуСотрудников.СрезПоследних КАК НевыходыНаРаботуСотрудниковСрезПоследних
	|ГДЕ
	|	НевыходыНаРаботуСотрудниковСрезПоследних.ДатаНачала <= &РабочийДень
	|	И НевыходыНаРаботуСотрудниковСрезПоследних.ДатаОкончания >= &РабочийДень
	|	И НевыходыНаРаботуСотрудниковСрезПоследних.Организация = &Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходыУходыСотрудников.Сотрудник КАК Сотрудник,
	|	ПриходыУходыСотрудников.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ_ПроходыСотрудников
	|ИЗ
	|	РегистрСведений.ПриходыУходыСотрудников КАК ПриходыУходыСотрудников
	|ГДЕ
	|	НЕ ПриходыУходыСотрудников.Сотрудник В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_Невыходы.Сотрудник КАК Сотрудник
	|				ИЗ
	|					ВТ_Невыходы КАК ВТ_Невыходы)
	|	И ПриходыУходыСотрудников.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&РабочийДень, ДЕНЬ) И КОНЕЦПЕРИОДА(&РабочийДень, ДЕНЬ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПроходыСотрудников01.Сотрудник КАК Сотрудник,
	|	ВТ_ПроходыСотрудников01.Дата КАК Дата,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_ПроходыСотрудников02.Дата, ВТ_ПроходыСотрудников01.Дата)) КАК ПредыдущийПроход,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПроходыСотрудников02.Дата ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) + 1 КАК НомерПрохода,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ((СУММА(ВЫБОР
	|						КОГДА ВТ_ПроходыСотрудников02.Дата ЕСТЬ NULL
	|							ТОГДА 0
	|						ИНАЧЕ 1
	|					КОНЕЦ) + 1) / 2 КАК ЧИСЛО(5, 0))) = (СУММА(ВЫБОР
	|					КОГДА ВТ_ПроходыСотрудников02.Дата ЕСТЬ NULL
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ) + 1) / 2
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВыход
	|ПОМЕСТИТЬ ВТ_ВходыВыходыСотрудников
	|ИЗ
	|	ВТ_ПроходыСотрудников КАК ВТ_ПроходыСотрудников01
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроходыСотрудников КАК ВТ_ПроходыСотрудников02
	|		ПО ВТ_ПроходыСотрудников01.Сотрудник = ВТ_ПроходыСотрудников02.Сотрудник
	|			И ВТ_ПроходыСотрудников01.Дата > ВТ_ПроходыСотрудников02.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПроходыСотрудников01.Сотрудник,
	|	ВТ_ПроходыСотрудников01.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВходыВыходыСотрудников.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ВходыВыходыСотрудников.ЭтоВыход
	|				ТОГДА РАЗНОСТЬДАТ(ВТ_ВходыВыходыСотрудников.ПредыдущийПроход, ВТ_ВходыВыходыСотрудников.Дата, МИНУТА) / 60
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РабочихЧасов,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВТ_ВходыВыходыСотрудников.ЭтоВыход
	|				ТОГДА РАЗНОСТЬДАТ(ВТ_ВходыВыходыСотрудников.ПредыдущийПроход, ВТ_ВходыВыходыСотрудников.Дата, МИНУТА) / 60
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЧасовОтсутствие
	|ПОМЕСТИТЬ ВТ_ПрисутствиеНаРабочемМесте
	|ИЗ
	|	ВТ_ВходыВыходыСотрудников КАК ВТ_ВходыВыходыСотрудников
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВходыВыходыСотрудников.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВТ_ДанныеСотрудников
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(&РабочийДень, Организация = &Организация) КАК СотрудникиСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиРаботыПериоды.Ссылка КАК ГрафикРаботы,
	|	СУММА(ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ГрафикиРаботыПериоды.ВремяНачала, ГрафикиРаботыПериоды.ВремяОкончания, МИНУТА) / 60 КАК ЧИСЛО(5, 0))) КАК КоличествоЧасовПоГрафику,
	|	МИНИМУМ(ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяНачала) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяНачала) * 60)) КАК ВремяНачала,
	|	МАКСИМУМ(ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяОкончания) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяОкончания) * 60)) КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_РабочиеЧасыПоГрафику
	|ИЗ
	|	Справочник.ГрафикиРаботы.Периоды КАК ГрафикиРаботыПериоды
	|ГДЕ
	|	ГрафикиРаботыПериоды.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_ДанныеСотрудников.ГрафикРаботы КАК ГрафикРаботы
	|			ИЗ
	|				ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников)
	|	И ГрафикиРаботыПериоды.НомерДня = ДЕНЬНЕДЕЛИ(&РабочийДень)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиРаботыПериоды.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиРаботыПериоды.Ссылка КАК ГрафикРаботы,
	|	МИНИМУМ(ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяНачала) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяНачала) * 60)) КАК ВремяНачала,
	|	МАКСИМУМ(ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяОкончания) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяОкончания) * 60)) КАК ВремяОкончания,
	|	ВТ_ДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВТ_РабочееВремяПоГрафику
	|ИЗ
	|	ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГрафикиРаботы.Периоды КАК ГрафикиРаботыПериоды
	|		ПО ВТ_ДанныеСотрудников.ГрафикРаботы = ГрафикиРаботыПериоды.Ссылка
	|ГДЕ
	|	ГрафикиРаботыПериоды.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_ДанныеСотрудников.ГрафикРаботы КАК ГрафикРаботы
	|			ИЗ
	|				ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников)
	|	И ГрафикиРаботыПериоды.НомерДня = ДЕНЬНЕДЕЛИ(&РабочийДень)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиРаботыПериоды.Ссылка,
	|	ВТ_ДанныеСотрудников.Сотрудник,
	|	ВТ_ДанныеСотрудников.СтруктурнаяЕдиница
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Работа) КАК ТипУчета,
	|	ВТ_РабочееВремяПоГрафику.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочееВремяПоГрафику.Сотрудник КАК Сотрудник,
	|	МИНИМУМ(ЕСТЬNULL(ВТ_ПроходыСотрудников.Дата, ДАТАВРЕМЯ(1, 1, 1))) КАК Приход,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ВТ_ПроходыСотрудников.Дата) = МИНИМУМ(ЕСТЬNULL(ВТ_ПроходыСотрудников.Дата, ДАТАВРЕМЯ(1, 1, 1)))
	|			ТОГДА МАКСИМУМ(ВТ_РабочееВремяПоГрафику.ВремяОкончания)
	|		ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(ВТ_ПроходыСотрудников.Дата, ДАТАВРЕМЯ(1, 1, 1)))
	|	КОНЕЦ КАК Уход,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_ПрисутствиеНаРабочемМесте.РабочихЧасов, 0)) КАК ОтработаноЧасов,
	|	ВТ_РабочееВремяПоГрафику.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПроходыСотрудников.Дата) КАК КоличествоПроходов,
	|	МИНИМУМ(ВТ_РабочееВремяПоГрафику.ВремяНачала) КАК ВремяНачала,
	|	МАКСИМУМ(ВТ_РабочееВремяПоГрафику.ВремяОкончания) КАК ВремяОкончания,
	|	МАКСИМУМ(ВТ_РабочиеЧасыПоГрафику.КоличествоЧасовПоГрафику) КАК ЧасовПоГрафику
	|ПОМЕСТИТЬ ВТ_РабочееВремя
	|ИЗ
	|	ВТ_РабочееВремяПоГрафику КАК ВТ_РабочееВремяПоГрафику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РабочиеЧасыПоГрафику КАК ВТ_РабочиеЧасыПоГрафику
	|		ПО ВТ_РабочееВремяПоГрафику.ГрафикРаботы = ВТ_РабочиеЧасыПоГрафику.ГрафикРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроходыСотрудников КАК ВТ_ПроходыСотрудников
	|		ПО (ВТ_ПроходыСотрудников.Сотрудник = ВТ_РабочееВремяПоГрафику.Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПрисутствиеНаРабочемМесте КАК ВТ_ПрисутствиеНаРабочемМесте
	|		ПО ВТ_РабочееВремяПоГрафику.Сотрудник = ВТ_ПрисутствиеНаРабочемМесте.Сотрудник
	|ГДЕ
	|	НЕ ВТ_РабочееВремяПоГрафику.Сотрудник В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_Невыходы.Сотрудник КАК Сотрудник
	|				ИЗ
	|					ВТ_Невыходы КАК ВТ_Невыходы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РабочееВремяПоГрафику.СтруктурнаяЕдиница,
	|	ВТ_РабочееВремяПоГрафику.ГрафикРаботы,
	|	ВТ_РабочееВремяПоГрафику.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_Невыходы.ПричинаНевыхода = ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.Отпуск)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Отпуск)
	|		КОГДА ВТ_Невыходы.ПричинаНевыхода = ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.Болезнь)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Больничный)
	|		КОГДА ВТ_Невыходы.ПричинаНевыхода = ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.Отгул)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Работа)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.ПустаяСсылка)
	|	КОНЕЦ КАК ТипУчета,
	|	ВТ_Невыходы.Сотрудник КАК Сотрудник,
	|	ВТ_Невыходы.Возмещаемый КАК Возмещаемый,
	|	ВТ_ДанныеСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_ДанныеСотрудников.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочиеЧасыПоГрафику.КоличествоЧасовПоГрафику КАК КоличествоЧасов,
	|	ВТ_Невыходы.ПричинаНевыхода КАК ПричинаНевыхода,
	|	ВТ_РабочиеЧасыПоГрафику.ВремяНачала КАК ВремяНачала,
	|	ВТ_РабочиеЧасыПоГрафику.ВремяОкончания КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_ПлановыеНевыходы
	|ИЗ
	|	ВТ_Невыходы КАК ВТ_Невыходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РабочиеЧасыПоГрафику КАК ВТ_РабочиеЧасыПоГрафику
	|			ПО ВТ_ДанныеСотрудников.ГрафикРаботы = ВТ_РабочиеЧасыПоГрафику.ГрафикРаботы
	|		ПО ВТ_Невыходы.Сотрудник = ВТ_ДанныеСотрудников.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РабочееВремя.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочееВремя.Сотрудник КАК Сотрудник,
	|	ВТ_РабочееВремя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫРАЗИТЬ(ВТ_РабочееВремя.ЧасовПоГрафику - ВТ_РабочееВремя.ОтработаноЧасов - ЕСТЬNULL(ВТ_ПлановыеНевыходы.КоличествоЧасов, 0) КАК ЧИСЛО(5, 2)) КАК ЧасовПрогула,
	|	ВТ_РабочееВремя.ВремяНачала КАК ВремяНачала,
	|	ВТ_РабочееВремя.ВремяОкончания КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_Прогулы
	|ИЗ
	|	ВТ_РабочееВремя КАК ВТ_РабочееВремя
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлановыеНевыходы КАК ВТ_ПлановыеНевыходы
	|		ПО ВТ_РабочееВремя.Сотрудник = ВТ_ПлановыеНевыходы.Сотрудник
	|ГДЕ
	|	ВТ_РабочееВремя.ЧасовПоГрафику - ВТ_РабочееВремя.ОтработаноЧасов - ЕСТЬNULL(ВТ_ПлановыеНевыходы.КоличествоЧасов, 0) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РабочееВремя.Сотрудник КАК Сотрудник,
	|	ВТ_РабочееВремя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_РабочееВремя.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочееВремя.ТипУчета КАК ТипУчета,
	|	ВТ_РабочееВремя.Приход КАК Приход,
	|	ВТ_РабочееВремя.Уход КАК Уход,
	//+++ Дмгг
	//|	ЕСТЬNULL(ВТ_ПрисутствиеНаРабочемМесте.РабочихЧасов, 0) КАК КоличествоЧасов,
	|	ВТ_РабочееВремя.ОтработаноЧасов КАК КоличествоЧасов,
	//--- Дмгг
	|	ИСТИНА КАК Возмещаемый,
	|	NULL КАК ПричинаНевыхода,
	|	ВТ_РабочееВремя.ВремяНачала КАК ВремяНачала,
	|	ВТ_РабочееВремя.ВремяОкончания КАК ВремяОкончания
	|ИЗ
	|	ВТ_РабочееВремя КАК ВТ_РабочееВремя
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПрисутствиеНаРабочемМесте КАК ВТ_ПрисутствиеНаРабочемМесте
	|		ПО ВТ_РабочееВремя.Сотрудник = ВТ_ПрисутствиеНаРабочемМесте.Сотрудник
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ПрисутствиеНаРабочемМесте.РабочихЧасов, 0) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПлановыеНевыходы.Сотрудник,
	|	ВТ_ПлановыеНевыходы.СтруктурнаяЕдиница,
	|	ВТ_ПлановыеНевыходы.ГрафикРаботы,
	|	ВТ_ПлановыеНевыходы.ТипУчета,
	|	NULL,
	|	NULL,
	|	ВТ_ПлановыеНевыходы.КоличествоЧасов,
	|	ВТ_ПлановыеНевыходы.Возмещаемый,
	|	ВТ_ПлановыеНевыходы.ПричинаНевыхода,
	|	ВТ_ПлановыеНевыходы.ВремяНачала,
	|	ВТ_ПлановыеНевыходы.ВремяОкончания
	|ИЗ
	|	ВТ_ПлановыеНевыходы КАК ВТ_ПлановыеНевыходы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Прогулы.Сотрудник,
	|	ВТ_Прогулы.СтруктурнаяЕдиница,
	|	ВТ_Прогулы.ГрафикРаботы,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_Прогулы.ЧасовПрогула,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.БезПричины),
	|	ВТ_Прогулы.ВремяНачала,
	|	ВТ_Прогулы.ВремяОкончания
	|ИЗ
	|	ВТ_Прогулы КАК ВТ_Прогулы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	СтруктурнаяЕдиница,
	|	ТипУчета,
	|	Приход";
	
	Т2 = 
	"ВЫБРАТЬ
	|	НевыходыНаРаботуСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	НевыходыНаРаботуСотрудниковСрезПоследних.ПричинаНевыхода КАК ПричинаНевыхода,
	|	НевыходыНаРаботуСотрудниковСрезПоследних.Возмещаемый КАК Возмещаемый
	|ПОМЕСТИТЬ ВТ_Невыходы
	|ИЗ
	|	РегистрСведений.НевыходыНаРаботуСотрудников.СрезПоследних КАК НевыходыНаРаботуСотрудниковСрезПоследних
	|ГДЕ
	|	НевыходыНаРаботуСотрудниковСрезПоследних.ДатаНачала <= &РабочийДень
	|	И НевыходыНаРаботуСотрудниковСрезПоследних.ДатаОкончания >= &РабочийДень
	|	И НевыходыНаРаботуСотрудниковСрезПоследних.Организация = &Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходыУходыСотрудников.Сотрудник КАК Сотрудник,
	|	ПриходыУходыСотрудников.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ_ПроходыСотрудников
	|ИЗ
	|	РегистрСведений.ПриходыУходыСотрудников КАК ПриходыУходыСотрудников
	|ГДЕ
	|	НЕ ПриходыУходыСотрудников.Сотрудник В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_Невыходы.Сотрудник КАК Сотрудник
	|				ИЗ
	|					ВТ_Невыходы КАК ВТ_Невыходы)
	|	И ПриходыУходыСотрудников.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&РабочийДень, ДЕНЬ) И КОНЕЦПЕРИОДА(&РабочийДень, ДЕНЬ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВТ_ДанныеСотрудников
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(&РабочийДень, Организация = &Организация) КАК СотрудникиСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиРаботыПериоды.Ссылка КАК ГрафикРаботы,
	|	СУММА(ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ГрафикиРаботыПериоды.ВремяНачала, ГрафикиРаботыПериоды.ВремяОкончания, МИНУТА) / 60 КАК ЧИСЛО(5, 0))) КАК КоличествоЧасовПоГрафику,
	|	ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяНачала) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяНачала) * 60) КАК ВремяНачала,
	|	ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяОкончания) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяОкончания) * 60) КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_РабочиеЧасыПоГрафику
	|ИЗ
	|	Справочник.ГрафикиРаботы.Периоды КАК ГрафикиРаботыПериоды
	|ГДЕ
	|	ГрафикиРаботыПериоды.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_ДанныеСотрудников.ГрафикРаботы КАК ГрафикРаботы
	|			ИЗ
	|				ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников)
	|	И ГрафикиРаботыПериоды.НомерДня = ДЕНЬНЕДЕЛИ(&РабочийДень)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиРаботыПериоды.Ссылка,
	|	ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяНачала) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяНачала) * 60),
	|	ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяОкончания) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяОкончания) * 60)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиРаботыПериоды.Ссылка КАК ГрафикРаботы,
	|	ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяНачала) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяНачала) * 60) КАК ВремяНачала,
	|	ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяОкончания) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяОкончания) * 60) КАК ВремяОкончания,
	|	ВТ_ДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВТ_РабочееВремяПоГрафику
	|ИЗ
	|	ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГрафикиРаботы.Периоды КАК ГрафикиРаботыПериоды
	|		ПО ВТ_ДанныеСотрудников.ГрафикРаботы = ГрафикиРаботыПериоды.Ссылка
	|ГДЕ
	|	ГрафикиРаботыПериоды.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_ДанныеСотрудников.ГрафикРаботы КАК ГрафикРаботы
	|			ИЗ
	|				ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников)
	|	И ГрафикиРаботыПериоды.НомерДня = ДЕНЬНЕДЕЛИ(&РабочийДень)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Работа) КАК ТипУчета,
	|	ВТ_РабочееВремяПоГрафику.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочееВремяПоГрафику.Сотрудник КАК Сотрудник,
	|	МИНИМУМ(ЕСТЬNULL(ВТ_ПроходыСотрудников.Дата, ДАТАВРЕМЯ(1, 1, 1))) КАК Приход,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ВТ_ПроходыСотрудников.Дата) = МИНИМУМ(ЕСТЬNULL(ВТ_ПроходыСотрудников.Дата, ДАТАВРЕМЯ(1, 1, 1)))
	|			ТОГДА МАКСИМУМ(ВТ_РабочееВремяПоГрафику.ВремяОкончания)
	|		ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(ВТ_ПроходыСотрудников.Дата, ДАТАВРЕМЯ(1, 1, 1)))
	|	КОНЕЦ КАК Уход,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ВТ_ПроходыСотрудников.Дата) ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(МИНИМУМ(ВТ_ПроходыСотрудников.Дата), ВЫБОР
	|					КОГДА МАКСИМУМ(ВТ_ПроходыСотрудников.Дата) = МИНИМУМ(ЕСТЬNULL(ВТ_ПроходыСотрудников.Дата, ДАТАВРЕМЯ(1, 1, 1)))
	|						ТОГДА МАКСИМУМ(ВТ_РабочееВремяПоГрафику.ВремяОкончания)
	|					ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(ВТ_ПроходыСотрудников.Дата, ДАТАВРЕМЯ(1, 1, 1)))
	|				КОНЕЦ, МИНУТА) / 60
	|	КОНЕЦ КАК ОтработаноЧасов,
	|	ВТ_РабочееВремяПоГрафику.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПроходыСотрудников.Дата) КАК КоличествоПроходов,
	|	МИНИМУМ(ВТ_РабочееВремяПоГрафику.ВремяНачала) КАК ВремяНачала,
	|	МАКСИМУМ(ВТ_РабочееВремяПоГрафику.ВремяОкончания) КАК ВремяОкончания,
	|	МАКСИМУМ(ВТ_РабочиеЧасыПоГрафику.КоличествоЧасовПоГрафику) КАК ЧасовПоГрафику
	|ПОМЕСТИТЬ ВТ_РабочееВремя
	|ИЗ
	|	ВТ_РабочееВремяПоГрафику КАК ВТ_РабочееВремяПоГрафику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РабочиеЧасыПоГрафику КАК ВТ_РабочиеЧасыПоГрафику
	|		ПО ВТ_РабочееВремяПоГрафику.ГрафикРаботы = ВТ_РабочиеЧасыПоГрафику.ГрафикРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроходыСотрудников КАК ВТ_ПроходыСотрудников
	|		ПО (ВТ_ПроходыСотрудников.Сотрудник = ВТ_РабочееВремяПоГрафику.Сотрудник)
	|ГДЕ
	|	НЕ ВТ_РабочееВремяПоГрафику.Сотрудник В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_Невыходы.Сотрудник КАК Сотрудник
	|				ИЗ
	|					ВТ_Невыходы КАК ВТ_Невыходы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РабочееВремяПоГрафику.СтруктурнаяЕдиница,
	|	ВТ_РабочееВремяПоГрафику.ГрафикРаботы,
	|	ВТ_РабочееВремяПоГрафику.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_Невыходы.ПричинаНевыхода = ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.Отпуск)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Отпуск)
	|		КОГДА ВТ_Невыходы.ПричинаНевыхода = ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.Болезнь)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Больничный)
	|		КОГДА ВТ_Невыходы.ПричинаНевыхода = ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.Отгул)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Работа)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.ПустаяСсылка)
	|	КОНЕЦ КАК ТипУчета,
	|	ВТ_Невыходы.Сотрудник КАК Сотрудник,
	|	ВТ_Невыходы.Возмещаемый КАК Возмещаемый,
	|	ВТ_ДанныеСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_ДанныеСотрудников.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочиеЧасыПоГрафику.КоличествоЧасовПоГрафику КАК КоличествоЧасов,
	|	ВТ_Невыходы.ПричинаНевыхода КАК ПричинаНевыхода,
	|	ВТ_РабочиеЧасыПоГрафику.ВремяНачала КАК ВремяНачала,
	|	ВТ_РабочиеЧасыПоГрафику.ВремяОкончания КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_ПлановыеНевыходы
	|ИЗ
	|	ВТ_Невыходы КАК ВТ_Невыходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РабочиеЧасыПоГрафику КАК ВТ_РабочиеЧасыПоГрафику
	|			ПО ВТ_ДанныеСотрудников.ГрафикРаботы = ВТ_РабочиеЧасыПоГрафику.ГрафикРаботы
	|		ПО ВТ_Невыходы.Сотрудник = ВТ_ДанныеСотрудников.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РабочееВремя.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочееВремя.Сотрудник КАК Сотрудник,
	|	ВТ_РабочееВремя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫРАЗИТЬ(ВТ_РабочееВремя.ЧасовПоГрафику - ВТ_РабочееВремя.ОтработаноЧасов - ЕСТЬNULL(ВТ_ПлановыеНевыходы.КоличествоЧасов, 0) КАК ЧИСЛО(5, 2)) КАК ЧасовПрогула,
	|	ВТ_РабочееВремя.ВремяНачала КАК ВремяНачала,
	|	ВТ_РабочееВремя.ВремяОкончания КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_Прогулы
	|ИЗ
	|	ВТ_РабочееВремя КАК ВТ_РабочееВремя
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлановыеНевыходы КАК ВТ_ПлановыеНевыходы
	|		ПО ВТ_РабочееВремя.Сотрудник = ВТ_ПлановыеНевыходы.Сотрудник
	|ГДЕ
	|	ВТ_РабочееВремя.ЧасовПоГрафику - ВТ_РабочееВремя.ОтработаноЧасов - ЕСТЬNULL(ВТ_ПлановыеНевыходы.КоличествоЧасов, 0) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РабочееВремя.Сотрудник КАК Сотрудник,
	|	ВТ_РабочееВремя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_РабочееВремя.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочееВремя.ТипУчета КАК ТипУчета,
	|	ВТ_РабочееВремя.Приход КАК Приход,
	|	ВТ_РабочееВремя.Уход КАК Уход,
	|	ВТ_РабочееВремя.ОтработаноЧасов КАК КоличествоЧасов,
	|	ИСТИНА КАК Возмещаемый,
	|	NULL КАК ПричинаНевыхода,
	|	ВТ_РабочееВремя.ВремяНачала КАК ВремяНачала,
	|	ВТ_РабочееВремя.ВремяОкончания КАК ВремяОкончания
	|ИЗ
	|	ВТ_РабочееВремя КАК ВТ_РабочееВремя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПлановыеНевыходы.Сотрудник,
	|	ВТ_ПлановыеНевыходы.СтруктурнаяЕдиница,
	|	ВТ_ПлановыеНевыходы.ГрафикРаботы,
	|	ВТ_ПлановыеНевыходы.ТипУчета,
	|	NULL,
	|	NULL,
	|	ВТ_ПлановыеНевыходы.КоличествоЧасов,
	|	ВТ_ПлановыеНевыходы.Возмещаемый,
	|	ВТ_ПлановыеНевыходы.ПричинаНевыхода,
	|	ВТ_ПлановыеНевыходы.ВремяНачала,
	|	ВТ_ПлановыеНевыходы.ВремяОкончания
	|ИЗ
	|	ВТ_ПлановыеНевыходы КАК ВТ_ПлановыеНевыходы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Прогулы.Сотрудник,
	|	ВТ_Прогулы.СтруктурнаяЕдиница,
	|	ВТ_Прогулы.ГрафикРаботы,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_Прогулы.ЧасовПрогула,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.БезПричины),
	|	ВТ_Прогулы.ВремяНачала,
	|	ВТ_Прогулы.ВремяОкончания
	|ИЗ
	|	ВТ_Прогулы КАК ВТ_Прогулы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	СтруктурнаяЕдиница,
	|	ТипУчета,
	|	Приход
	|";
	
	
	Т =
	"ВЫБРАТЬ
	|	НевыходыНаРаботуСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	НевыходыНаРаботуСотрудниковСрезПоследних.ПричинаНевыхода КАК ПричинаНевыхода,
	|	НевыходыНаРаботуСотрудниковСрезПоследних.Возмещаемый КАК Возмещаемый
	|ПОМЕСТИТЬ ВТ_Невыходы
	|ИЗ
	|	РегистрСведений.НевыходыНаРаботуСотрудников.СрезПоследних КАК НевыходыНаРаботуСотрудниковСрезПоследних
	|ГДЕ
	|	НевыходыНаРаботуСотрудниковСрезПоследних.ДатаНачала <= &РабочийДень
	|	И НевыходыНаРаботуСотрудниковСрезПоследних.ДатаОкончания >= &РабочийДень
	|	И НевыходыНаРаботуСотрудниковСрезПоследних.Организация = &Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходыУходыСотрудников.Сотрудник КАК Сотрудник,
	|	ПриходыУходыСотрудников.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ_ПроходыСотрудников
	|ИЗ
	|	РегистрСведений.ПриходыУходыСотрудников КАК ПриходыУходыСотрудников
	|ГДЕ
	|	НЕ ПриходыУходыСотрудников.Сотрудник В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_Невыходы.Сотрудник КАК Сотрудник
	|				ИЗ
	|					ВТ_Невыходы КАК ВТ_Невыходы)
	|	И ПриходыУходыСотрудников.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&РабочийДень, ДЕНЬ) И КОНЕЦПЕРИОДА(&РабочийДень, ДЕНЬ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВТ_ДанныеСотрудников
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			&РабочийДень,
	|			Организация = &Организация
	|				И Сотрудник В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ_ПроходыСотрудников.Сотрудник КАК Сотрудник
	|					ИЗ
	|						ВТ_ПроходыСотрудников КАК ВТ_ПроходыСотрудников
	|			
	|					ОБЪЕДИНИТЬ
	|			
	|					ВЫБРАТЬ
	|						ВТ_Невыходы.Сотрудник
	|					ИЗ
	|						ВТ_Невыходы КАК ВТ_Невыходы)) КАК СотрудникиСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиРаботыПериоды.Ссылка КАК ГрафикРаботы,
	|	СУММА(ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ГрафикиРаботыПериоды.ВремяНачала, ГрафикиРаботыПериоды.ВремяОкончания, МИНУТА) / 60 КАК ЧИСЛО(5, 0))) КАК КоличествоЧасовПоГрафику,
	|	ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяНачала) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяНачала) * 60) КАК ВремяНачала,
	|	ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяОкончания) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяОкончания) * 60) КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_РабочиеЧасыПоГрафику
	|ИЗ
	|	Справочник.ГрафикиРаботы.Периоды КАК ГрафикиРаботыПериоды
	|ГДЕ
	|	ГрафикиРаботыПериоды.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_ДанныеСотрудников.ГрафикРаботы КАК ГрафикРаботы
	|			ИЗ
	|				ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников)
	|	И ГрафикиРаботыПериоды.НомерДня = ДЕНЬНЕДЕЛИ(&РабочийДень)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиРаботыПериоды.Ссылка,
	|	ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяНачала) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяНачала) * 60),
	|	ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяОкончания) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяОкончания) * 60)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиРаботыПериоды.Ссылка КАК ГрафикРаботы,
	|	ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяНачала) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяНачала) * 60) КАК ВремяНачала,
	|	ДОБАВИТЬКДАТЕ(&РабочийДень, СЕКУНДА, ЧАС(ГрафикиРаботыПериоды.ВремяОкончания) * 3600 + МИНУТА(ГрафикиРаботыПериоды.ВремяОкончания) * 60) КАК ВремяОкончания,
	|	ВТ_ДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВТ_РабочееВремяПоГрафику
	|ИЗ
	|	ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГрафикиРаботы.Периоды КАК ГрафикиРаботыПериоды
	|		ПО ВТ_ДанныеСотрудников.ГрафикРаботы = ГрафикиРаботыПериоды.Ссылка
	|ГДЕ
	|	ГрафикиРаботыПериоды.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_ДанныеСотрудников.ГрафикРаботы КАК ГрафикРаботы
	|			ИЗ
	|				ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников)
	|	И ГрафикиРаботыПериоды.НомерДня = ДЕНЬНЕДЕЛИ(&РабочийДень)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Работа) КАК ТипУчета,
	|	ВТ_РабочееВремяПоГрафику.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_ПроходыСотрудников.Сотрудник КАК Сотрудник,
	|	МИНИМУМ(ВТ_ПроходыСотрудников.Дата) КАК Приход,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ВТ_ПроходыСотрудников.Дата) = МИНИМУМ(ВТ_ПроходыСотрудников.Дата)
	|			ТОГДА МАКСИМУМ(ВТ_РабочееВремяПоГрафику.ВремяОкончания)
	|		ИНАЧЕ МАКСИМУМ(ВТ_ПроходыСотрудников.Дата)
	|	КОНЕЦ КАК Уход,
	|	РАЗНОСТЬДАТ(МИНИМУМ(ВТ_ПроходыСотрудников.Дата), ВЫБОР
	|			КОГДА МАКСИМУМ(ВТ_ПроходыСотрудников.Дата) = МИНИМУМ(ВТ_ПроходыСотрудников.Дата)
	|				ТОГДА МАКСИМУМ(ВТ_РабочееВремяПоГрафику.ВремяОкончания)
	|			ИНАЧЕ МАКСИМУМ(ВТ_ПроходыСотрудников.Дата)
	|		КОНЕЦ, МИНУТА) / 60 КАК ОтработаноЧасов,
	|	ВТ_РабочееВремяПоГрафику.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПроходыСотрудников.Дата) КАК КоличествоПроходов,
	|	МИНИМУМ(ВТ_РабочееВремяПоГрафику.ВремяНачала) КАК ВремяНачала,
	|	МАКСИМУМ(ВТ_РабочееВремяПоГрафику.ВремяОкончания) КАК ВремяОкончания,
	|	МАКСИМУМ(ВТ_РабочиеЧасыПоГрафику.КоличествоЧасовПоГрафику) КАК ЧасовПоГрафику
	|ПОМЕСТИТЬ ВТ_РабочееВремя
	|ИЗ
	|	ВТ_ПроходыСотрудников КАК ВТ_ПроходыСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РабочееВремяПоГрафику КАК ВТ_РабочееВремяПоГрафику
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РабочиеЧасыПоГрафику КАК ВТ_РабочиеЧасыПоГрафику
	|			ПО ВТ_РабочееВремяПоГрафику.ГрафикРаботы = ВТ_РабочиеЧасыПоГрафику.ГрафикРаботы
	|		ПО ВТ_ПроходыСотрудников.Сотрудник = ВТ_РабочееВремяПоГрафику.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПроходыСотрудников.Сотрудник,
	|	ВТ_РабочееВремяПоГрафику.СтруктурнаяЕдиница,
	|	ВТ_РабочееВремяПоГрафику.ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_Невыходы.ПричинаНевыхода = ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.Отпуск)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Отпуск)
	|		КОГДА ВТ_Невыходы.ПричинаНевыхода = ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.Болезнь)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Больничный)
	|		КОГДА ВТ_Невыходы.ПричинаНевыхода = ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.Отгул)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.Работа)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыУчетаРабочегоВремени.ПустаяСсылка)
	|	КОНЕЦ КАК ТипУчета,
	|	ВТ_Невыходы.Сотрудник КАК Сотрудник,
	|	ВТ_Невыходы.Возмещаемый КАК Возмещаемый,
	|	ВТ_ДанныеСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_ДанныеСотрудников.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочиеЧасыПоГрафику.КоличествоЧасовПоГрафику КАК КоличествоЧасов,
	|	ВТ_Невыходы.ПричинаНевыхода КАК ПричинаНевыхода,
	|	ВТ_РабочиеЧасыПоГрафику.ВремяНачала КАК ВремяНачала,
	|	ВТ_РабочиеЧасыПоГрафику.ВремяОкончания КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_ПлановыеНевыходы
	|ИЗ
	|	ВТ_Невыходы КАК ВТ_Невыходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеСотрудников КАК ВТ_ДанныеСотрудников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РабочиеЧасыПоГрафику КАК ВТ_РабочиеЧасыПоГрафику
	|			ПО ВТ_ДанныеСотрудников.ГрафикРаботы = ВТ_РабочиеЧасыПоГрафику.ГрафикРаботы
	|		ПО ВТ_Невыходы.Сотрудник = ВТ_ДанныеСотрудников.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РабочееВремя.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочееВремя.Сотрудник КАК Сотрудник,
	|	ВТ_РабочееВремя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫРАЗИТЬ(ВТ_РабочееВремя.ЧасовПоГрафику - ВТ_РабочееВремя.ОтработаноЧасов - ЕСТЬNULL(ВТ_ПлановыеНевыходы.КоличествоЧасов, 0) КАК ЧИСЛО(5, 2)) КАК ЧасовПрогула,
	|	ВТ_РабочееВремя.ВремяНачала КАК ВремяНачала,
	|	ВТ_РабочееВремя.ВремяОкончания КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_Прогулы
	|ИЗ
	|	ВТ_РабочееВремя КАК ВТ_РабочееВремя
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлановыеНевыходы КАК ВТ_ПлановыеНевыходы
	|		ПО ВТ_РабочееВремя.Сотрудник = ВТ_ПлановыеНевыходы.Сотрудник
	|ГДЕ
	|	ВТ_РабочееВремя.ЧасовПоГрафику - ВТ_РабочееВремя.ОтработаноЧасов - ЕСТЬNULL(ВТ_ПлановыеНевыходы.КоличествоЧасов, 0) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РабочееВремя.Сотрудник КАК Сотрудник,
	|	ВТ_РабочееВремя.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_РабочееВремя.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_РабочееВремя.ТипУчета КАК ТипУчета,
	|	ВТ_РабочееВремя.Приход КАК Приход,
	|	ВТ_РабочееВремя.Уход КАК Уход,
	|	ВТ_РабочееВремя.ОтработаноЧасов КАК КоличествоЧасов,
	|	ИСТИНА КАК Возмещаемый,
	|	NULL КАК ПричинаНевыхода,
	|	ВТ_РабочееВремя.ВремяНачала КАК ВремяНачала,
	|	ВТ_РабочееВремя.ВремяОкончания КАК ВремяОкончания
	|ИЗ
	|	ВТ_РабочееВремя КАК ВТ_РабочееВремя
	|ГДЕ
	|	ВТ_РабочееВремя.ОтработаноЧасов > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПлановыеНевыходы.Сотрудник,
	|	ВТ_ПлановыеНевыходы.СтруктурнаяЕдиница,
	|	ВТ_ПлановыеНевыходы.ГрафикРаботы,
	|	ВТ_ПлановыеНевыходы.ТипУчета,
	|	NULL,
	|	NULL,
	|	ВТ_ПлановыеНевыходы.КоличествоЧасов,
	|	ВТ_ПлановыеНевыходы.Возмещаемый,
	|	ВТ_ПлановыеНевыходы.ПричинаНевыхода,
	|	ВТ_ПлановыеНевыходы.ВремяНачала,
	|	ВТ_ПлановыеНевыходы.ВремяОкончания
	|ИЗ
	|	ВТ_ПлановыеНевыходы КАК ВТ_ПлановыеНевыходы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Прогулы.Сотрудник,
	|	ВТ_Прогулы.СтруктурнаяЕдиница,
	|	ВТ_Прогулы.ГрафикРаботы,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_Прогулы.ЧасовПрогула,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Перечисление.ПричиныНевыходовНаРаботу.БезПричины),
	|	ВТ_Прогулы.ВремяНачала,
	|	ВТ_Прогулы.ВремяОкончания
	|ИЗ
	|	ВТ_Прогулы КАК ВТ_Прогулы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	СтруктурнаяЕдиница,
	|	ТипУчета,
	|	Приход";
	Запрос.Параметры.Вставить("Организация", Организация);
	Запрос.Параметры.Вставить("РабочийДень", НачалоДня(Дата)); 
	
	ПериодыВремени.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
 
 
