// +++ { AzRy - [30.09.2021] - Jira: - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment: დროებით შემოწმება გაითიშა, ძველი ბაზიდან იმპორტირებული მონაცემების კორექტული გადატარებისთვის
&НаКлиенте
Процедура РасшAzRy_ВнеоборотныеАктивыПриИзмененииВместо(Элемент)
	Если Не Объект.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
		УстановитьНачальнуюСтоймость();
	КонецЕсли;	
КонецПроцедуры
// +++ } AzRy - [30.09.2021] - Jira: - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment: დროებით შემოწმება გაითიშა, ძველი ბაზიდან იმპორტირებული მონაცემების კორექტული გადატარებისთვის