Функция ПолучитьСуммуВУчетнойВВалюте(ВалютаОпераций, Период, Сумма, ДокументСсылка = Неопределено, Курс = Неопределено, Кратность = Неопределено) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Курс,
	               |	КурсыВалютСрезПоследних.Кратность
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
	               |ГДЕ
	               |	КурсыВалютСрезПоследних.Валюта = &ВалютаУчета";
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("Период", Период);
	Резултат = Запрос.Выполнить();
	Выборка = Резултат.Выбрать();
	КурсУчета = 0;
	КратностьУчета = 0;
	Если Выборка.Следующий() Тогда
		КурсУчета = Выборка.Курс;
		КратностьУчета = Выборка.Кратность;
	КонецЕсли;

	Если ДокументСсылка = Неопределено Тогда
		Если Курс = Неопределено И Кратность = Неопределено Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	КурсыВалютСрезПоследних.Курс,
			|	КурсыВалютСрезПоследних.Кратность
			|ИЗ
			|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
			|ГДЕ
			|	КурсыВалютСрезПоследних.Валюта = &ВалютаОп";
			Запрос.УстановитьПараметр("ВалютаОп", ВалютаОпераций);
			Запрос.УстановитьПараметр("Период", Период);
			Резултат = Запрос.Выполнить();
			Выборка = Резултат.Выбрать();
			КурсНац = 1;
			КратностьНац = 1;
			Если Выборка.Следующий() Тогда
				КурсО      = Выборка.Курс;
				КратностьО = Выборка.Кратность;
			КонецЕсли;
		Иначе 	
			КурсО      = Курс;
			КратностьО = Кратность;			
		КонецЕсли; 
	Иначе		
		Если Курс = Неопределено И Кратность = Неопределено Тогда
			КурсО      = ДокументСсылка.Курс;
			КратностьО = ДокументСсылка.Кратность;	
		Иначе 	
			КурсО      = Курс;
			КратностьО = Кратность;			
		КонецЕсли;
	КонецЕсли;

	Возврат Сумма * КурсО / КратностьО * КратностьУчета / КурсУчета;
КонецФункции

Функция ДатаПредоплатыМеньшеТекущегоМесяца(Предоплата, Дата) Экспорт

	Если Предоплата.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе 	
		ТЗ = Новый ТаблицаЗначений; ТЗ.Колонки.Добавить("Дата");
		Для каждого ТекСтрока Из Предоплата Цикл
			
			НоваяСтрока = ТЗ.Добавить();
			НоваяСтрока.Дата = ТекСтрока.Документ.Дата;
			
		КонецЦикла;
		ТЗ.Сортировать("Дата Возр");
		
		Возврат НачалоМесяца(ТЗ[0].Дата) < НачалоМесяца(Дата);
	КонецЕсли; 

КонецФункции

Функция ЯвляетсяНеРезидентом(Контрагент) Экспорт
	
	Возврат Контрагент.ЯвляетсяНеРезидентом; 

КонецФункции
 