




#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//ПараметрыОтчета=Структура("ВариантОтчета,ДатаНачала,ДатаОкончания,Договор")
Функция ПолучитьРезультат(ПараметрыОтчета, АдресНастроекВоВременномХранилище="") Экспорт
	УстановитьПривилегированныйРежим(Истина);
	СКД=ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СКД,Новый УникальныйИдентификатор);
	
	Если ПустаяСтрока(АдресНастроекВоВременномХранилище) Тогда
		Если ПараметрыОтчета.Свойство("ВариантОтчета") И Не ПустаяСтрока(ПараметрыОтчета.ВариантОтчета) Тогда
			Вариант=СКД.ВариантыНастроек.Найти(ПараметрыОтчета.ВариантОтчета);
			Если Вариант=Неопределено Тогда
			  ВызватьИсключение "Вариант отчета "+ПараметрыОтчета.ВариантОтчета+" не найден";
			КонецЕсли; 
		  Настройка=Вариант.Настройки;
		Иначе	
		  Настройка=КомпоновщикНастроек.ПолучитьНастройки();
		КонецЕсли; 		
	Иначе
		Настройка=ПолучитьИзВременногоХранилища(АдресНастроекВоВременномХранилище);
	КонецЕсли;
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременномХранилище);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройка);
	
	
	НастройкиКомпоновки=ОПТИМУС_ОбменДистрибуция.УстановитьПараметрыОтчета(КомпоновщикНастроек, ПараметрыОтчета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД,НастройкиКомпоновки,,,Тип("ГенераторМакетаКомпоновкиДанных"),Ложь);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ДокументРезультат=Новый ТабличныйДокумент;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);    
	ПроцессорВывода.Вывести(ПроцессорКомпоновки); 
	
  Возврат ДокументРезультат;
КонецФункции // ПолучитьРезультат(ПараметрыОтчета)()

	
#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиОтчета.ИспользоватьСравнение = Истина;
	НастройкиОтчета.ИспользоватьПериодичность = Истина;
	
	//НастройкиВариантов["Остатки"].Вставить("ТолькоРесурсыОстатков", Истина);
	
	НастройкиВариантов["Ведомость"].Рекомендуемый = Истина;
	//НастройкиВариантов["Остатки"].Рекомендуемый = Истина;
	
	ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов);
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыУНФ.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов)
	
	МассивПолейКоличеств = Новый Массив;
	МассивПолейСумм = Новый Массив;
	Для каждого ДоступноеПоле Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		Если НЕ ДоступноеПоле.Ресурс Тогда
			Продолжить;
		КонецЕсли;
		ИмяПоля = Строка(ДоступноеПоле.Поле);
		Если Найти(ИмяПоля, "Сумма")>0 Тогда
			МассивПолейСумм.Добавить(ИмяПоля);
		ИначеЕсли Найти(ИмяПоля, "Количество")>0 Тогда
			МассивПолейКоличеств.Добавить(ИмяПоля);
		КонецЕсли; 
	КонецЦикла;
	МассивПолейСумм.Добавить("СтоимостьЕд");
	
	Для каждого НастройкиТекВарианта Из НастройкиВариантов Цикл
		
		ВариантыОформления = НастройкиТекВарианта.Значение.ВариантыОформления;
		ОтчетыУНФ.ДобавитьВариантыОформленияКоличества(ВариантыОформления, МассивПолейКоличеств);
		ОтчетыУНФ.ДобавитьВариантыОформленияСумм(ВариантыОформления, МассивПолейСумм);
			
	КонецЦикла; 
	
КонецПроцедуры

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["Ведомость"].Теги = НСтр("ka='Запасы,Продажи,Закупки,Товары,Номенклатура,Себестоимость';ru='Запасы,Продажи,Закупки,Товары,Номенклатура,Себестоимость';en='Inventories, Sales, Purchases, Products, Inventory, Cost of'");
	//НастройкиВариантов["Остатки"].Теги = НСтр("ka='Запасы,Закупки,Товары,Номенклатура,Себестоимость';ru='Запасы,Закупки,Товары,Номенклатура,Себестоимость';en='Inventories, Purchases, Products, Inventory, Cost of'");
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
	//ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ОплатыПокупателей"].СвязанныеПоля, "СтруктурнаяЕдиница", "Справочник.СтруктурныеЕдиницы");
	//ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ОплатыПокупателей"].СвязанныеПоля, "ЗаказПокупателя", "Документ.ЗаказПокупателя");
	
КонецПроцедуры
 
#КонецОбласти 

ЭтоОтчетУНФ = Истина;

#КонецЕсли






