
Функция НайтиДокументПоИД(ID) ЭКСПОРТ
	
	НаиденныйДок = Документы.РасходСоСчета.НайтиПоРеквизиту("ID",ID);
	
	Если НЕ ЗначениеЗаполнено(НаиденныйДок) Тогда 
		
		НаиденныйДок = Документы.ПоступлениеНаСчет.НайтиПоРеквизиту("ID",ID);
		
		//ИначеЕсли НЕ ЗначениеЗаполнено(НаиденныйДок) Тогда 
		Если НЕ ЗначениеЗаполнено(НаиденныйДок) Тогда 
			
			НаиденныйДок = Документы.ПеремещениеДС.НайтиПоРеквизиту("ID",ID);
			
			Если НЕ ЗначениеЗаполнено(НаиденныйДок) Тогда 
				
				НаиденныйДок = Документы.Конвертация.НайтиПоРеквизиту("ID",ID);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НаиденныйДок;
	
КонецФункции

Функция НайтиДокументПоШаблонуДатеИНомеру(ШаблонЗаполнения=НЕОПРЕДЕЛЕНО,ДатаДокумента,НомерДокумента,СуммаКт=0,СуммаДт=0) ЭКСПОРТ
	
	НайденныйДокумент = НЕОПРЕДЕЛЕНО;
	
	Если НЕ (ЗначениеЗаполнено(ДатаДокумента) И ЗначениеЗаполнено(НомерДокумента))
		Тогда
	
		Возврат НЕОПРЕДЕЛЕНО;
	
	КонецЕсли;

	НомерДокументаДляПоиска = СокрЛП(НомерДокумента);
	
	Пока СтрДлина(НомерДокументаДляПоиска)<11 Цикл
	
		НомерДокументаДляПоиска = "0"+НомерДокументаДляПоиска;
	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ШаблонЗаполнения) и СтрДлина(ШаблонЗаполнения.СсылкаИсточника)>0 Тогда //Малышев 2025-06-19
		
		Запрос = Новый Запрос;
		ЗапросТекст = 
		"ВЫБРАТЬ
		|	ТекущийДокумент.Ссылка КАК Ссылка
		|ИЗ
		|	Документ."+ШаблонЗаполнения.СсылкаИсточника+" КАК ТекущийДокумент
		|ГДЕ
		|	НЕ ТекущийДокумент.ПометкаУдаления
		|	И ТекущийДокумент.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И &НомерДокумента ПОДОБНО ТекущийДокумент.Номер + ""%""";
		
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаДокумента));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаДокумента));
		Запрос.УстановитьПараметр("НомерДокумента", НомерДокументаДляПоиска);
		
		Запрос.Текст = ЗапросТекст;
		
		тзРезультат = Запрос.Выполнить().Выгрузить();
		
		Если тзРезультат.Количество() > 0 Тогда 
			НайденныйДокумент = тзРезультат[0].Ссылка  
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НайденныйДокумент) Тогда
	
		Если СуммаКт>0 Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	УИДДокументовВИнтернетБанке.ДокументСсылка КАК ДокументСсылка
			|ИЗ
			|	РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
			|ГДЕ
			|	НЕ УИДДокументовВИнтернетБанке.ДокументСсылка.ПометкаУдаления
			|	И УИДДокументовВИнтернетБанке.ДокументСсылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И УИДДокументовВИнтернетБанке.ДокументСсылка.Номер = &Номер
			|	И УИДДокументовВИнтернетБанке.ДокументСсылка.СуммаДокумента = &СуммаДокумента";
			
			Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаДокумента));
			Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаДокумента));
			Запрос.УстановитьПараметр("Номер", НомерДокументаДляПоиска);
			Запрос.УстановитьПараметр("СуммаДокумента", СуммаКт);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				НайденныйДокумент = ВыборкаДетальныеЗаписи.ДокументСсылка;
			КонецЕсли;
		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НайденныйДокумент) Тогда
			
			Если СуммаДт>0 Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	УИДДокументовВИнтернетБанке.ДокументСсылка КАК ДокументСсылка
				|ИЗ
				|	РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
				|ГДЕ
				|	НЕ УИДДокументовВИнтернетБанке.ДокументСсылка.ПометкаУдаления
				|	И УИДДокументовВИнтернетБанке.ДокументСсылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
				|	И УИДДокументовВИнтернетБанке.ДокументСсылка.Номер = &Номер
				|	И УИДДокументовВИнтернетБанке.ДокументСсылка.СуммаДокумента = &СуммаДокумента";
				
				Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаДокумента));
				Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаДокумента));
				Запрос.УстановитьПараметр("Номер", НомерДокументаДляПоиска);
				Запрос.УстановитьПараметр("СуммаДокумента", СуммаДт);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					НайденныйДокумент = ВыборкаДетальныеЗаписи.ДокументСсылка;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат НайденныйДокумент;
	
КонецФункции

Функция НайтиВРегистреКлючДокументаИнтернетБанка(КлючУникальности) ЭКСПОРТ
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючДокументаИнтернетБанка.Документ КАК Документ,
		|	КлючДокументаИнтернетБанка.Ключ КАК Ключ
		|ИЗ
		|	РегистрСведений.КлючДокументаИнтернетБанка КАК КлючДокументаИнтернетБанка
		|ГДЕ
		|	КлючДокументаИнтернетБанка.Ключ = &КлючУникальности";
	
	Запрос.УстановитьПараметр("КлючУникальности", КлючУникальности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Документ;   
		Прервать;
	КонецЦикла;   
	
	Возврат Неопределено;

КонецФункции // НайтиВРегистреКлючДокументаИнтернетБанка(СтрокаВыписки.ID_Новый)()
