#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает значение поля учетной политики с переданным именем.
//
// Параметры:
//  ИмяПоля     - Строка - Имя получаемого ресурса или реквизита учетной политики.
//  Организация - СправочникСсылка.Организации - организация, для которой требуются сведения.
//  Период      - Дата - дата, на которую требуются сведения;
//              - Неопределено - если дата не передана, будет получено значение на текущий год.
//
// Возвращаемое значение:
//   ЛюбаяСсылка, Дата, Булево - значение ресурса или реквизита учетной политики с заданным именем;
//   Неопределено - поля с данным именем не существует или учетная политика отсутствует.
//
Функция ЗначениеПоляУчетнойПолитики(ИмяПоля, Организация, Период = Неопределено) Экспорт
	
	ЗначенияПолей = ЗначенияПолейУчетнойПолитики(ИмяПоля, Организация, Период);
	
	Возврат ЗначенияПолей[ИмяПоля];
	
КонецФункции

// Получает значения полей учетной политики с переданными именами.
//
// Параметры:
//  ИменаПолей  - Строка - Имена получаемых ресурсов или реквизитов учетной политики, разделенные запятой;
//              - Массив из Строка - массив строковых имен получаемых ресурсов или реквизитов учетной политики.
//  Организация - СправочникСсылка.Организации - организация, для которой требуются сведения.
//  Период      - Дата - дата, на которую требуются сведения;
//              - Неопределено - если дата не передана, будет получено значение на текущий год.
//
// Возвращаемое значение:
//   Структура - в качестве ключа возвращается имя ресурса или реквизита учетной политики,
//               в качестве значения - либо значение ресурса / реквизита, либо Неопределено, если поля с данным именем
//               не существует или учетная политика отсутствует.
//
Функция ЗначенияПолейУчетнойПолитики(Знач ИменаПолей, Организация, Период = Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		ПериодСведений = НачалоГода(ОбщегоНазначения.ТекущаяДатаПользователя());
	Иначе
		ПериодСведений = НачалоГода(Период);
	КонецЕсли;
	
	УчетнаяПолитика = УправлениеНебольшойФирмойПовтИсп.УчетнаяПолитикаОрганизации(Организация, ПериодСведений);
	
	Если ТипЗнч(ИменаПолей) = Тип("Массив") Тогда
		ИменаПолей = СтрСоединить(ИменаПолей, ",");
	КонецЕсли;
	
	Результат = Новый Структура(ИменаПолей);
	ЗаполнитьЗначенияСвойств(Результат, УчетнаяПолитика);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли