
&Вместо("ПередЗаписью")
Процедура РасшAzRy_ПередЗаписью(Отказ)
	
	// 1. Действия, выполняемые всегда, в том числе и при обмене данными
	
	ДополнительныеСвойства.Вставить("НужноЗаписыватьВРегистрПриЗаписи", Ложь);
	
	// Не выполнять дальнейшие действия при обмене данными
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// 2. Дальнейшие действия не выполняются в случае, когда запись инициирована механизмом обмена данными
	
	// Проверим согласованность внесенных изменений с другими объектами базы
	Если Не ЭтоНовый() Тогда
		ПроверитьВозможностьИзменений(Отказ);
	КонецЕсли;
	
	// Не выполнять дальнейшие действия при отказе в записи
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// 3. Дальнейшие действия не выполняются при отказе в записи объекта
	
	// Проверим корректность ИНН, КПП и зарегистрируем дубли контрагентов,
	// кроме случая загрузки/выгрузки из локальной версии в модель сервиса.
	Если Не (ДополнительныеСвойства.Свойство("РегистрироватьДублиКонтрагентов") И ДополнительныеСвойства.РегистрироватьДублиКонтрагентов = Ложь) Тогда
		ЗарегистрироватьДублиКонтрагентов();
	КонецЕсли;
	
	// Дозаполним реквизиты
	Если Не ЭтоГруппа И ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	Если Не ЭтоГруппа Тогда
		СформироватьОсновныеСведения();
		// +++ { AzRy - [10.02.2021] - // -- // - Developer:გიორგი მამულაშვილი - Comment: მონაცემების იმპორტის დროს საჭირო გახდა გათიშვა

		////Паганини_
		//Если НЕ ПометкаУдаления И НЕ РС_ОбщегоНазначения.РеквизитУникален(Ссылка, "ИНН", ИНН, "Контрагенты") Тогда
		//	ТекстСообщения = НСтр("ka='ს/კ არ არის უნიკალური.';ru='ИНН не уникален!';en='VAT is not unique!'");
		//	УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, , , "ИНН", Отказ);
		//КонецЕсли;//_Паганини
		
		// +++ } AzRy - [10.02.2021] - // -- // - Developer:გიორგი მამულაშვილი - Comment: მონაცემების იმპორტის დროს საჭირო გახდა გათიშვა		
	КонецЕсли;
	
	// Заполним договор по умолчанию: подставляем любой существующий или создаем новый
	Если Не ЭтоГруппа И Не ЗначениеЗаполнено(ДоговорПоУмолчанию) Тогда
		
		НадоСоздатьДоговор = Истина;
		
		Если Не ЭтоНовый() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ДоговорыКонтрагентов.Ссылка КАК Договор
				|ИЗ
				|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
				|ГДЕ
				|	ДоговорыКонтрагентов.Владелец = &Владелец
				|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
				|
				|УПОРЯДОЧИТЬ ПО
				|	ДоговорыКонтрагентов.НомерДоговора УБЫВ";
			
			Запрос.УстановитьПараметр("Владелец", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				ДоговорПоУмолчанию = Выборка.Договор;
				
				НадоСоздатьДоговор = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НадоСоздатьДоговор Тогда
			ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку();
			ДополнительныеСвойства.Вставить("НовыйОсновнойДоговор", ДоговорПоУмолчанию);
		КонецЕсли;
		
	КонецЕсли;
	
	// Настройка данных реквизитов в зависимости от других реквизитов
	ПривестиДанныеКСогласованномуСостоянию();
	
КонецПроцедуры
