#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура РасшAzRy_ПередЗаписью(Отказ)
	
	Если Не ЭтоОрганизацияAzRyPay() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеKYCТаблиц() Тогда
		Сообщить("KYC პასუხების შევსება აუცილებელია.", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаKYC

Функция ПроверитьЗаполнениеKYCТаблиц()
	
	Если Не ПроверитьОтветыВТаблице(AzRyKYCАнкетаКлиента, "Ответ") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПроверитьОтветыВТаблице(AzRyОценкаРискаКлиента, "Ответ") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПроверитьРискМатрицу() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьОтветыВТаблице(Таблица, ИмяРеквизита)
	
	Для Каждого ТекСтрока Из Таблица Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока[ИмяРеквизита]) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьРискМатрицу()
	
	Для Каждого ТекСтрока Из AzRyРискМатрицаКлиента Цикл
		
		Если Не ЗначениеЗаполнено(ТекСтрока.ВероятностьРиска)
			Или Не ЗначениеЗаполнено(ТекСтрока.УровеньРиска)
			Или Не ЗначениеЗаполнено(ТекСтрока.МитигирующиеМеры) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеФункции

Функция ЭтоОрганизацияAzRyPay()
	
	Возврат AzRyОрганизацияПоУмолчанию.Организация = Константы.AzRyОрганизацияAzRyPay.Получить();
	
КонецФункции

#КонецОбласти
