#Область ИнициализацияДаных


// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства) Экспорт
	
	
	Запрос = Новый Запрос(ТекстЗапросаИнициализироватьДанныеДокумента());
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	// Олег Литвиненко 15.09.22 --->
	Запрос.УстановитьПараметр("СмещениеДляОкругления", 0.0005);
	// Олег Литвиненко <---
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПродажаЛицензии);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	Запрос.УстановитьПараметр("УчетПоЯчейкам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоЯчейкам);
	
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	
	Запрос.УстановитьПараметр("ИспользоватьСерийныеНомера", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьСерийныеНомера);
	
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаНациональная", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("ВалютаНакладной", ДокументСсылкаПродажаЛицензии.ВалютаДокумента);
	Запрос.УстановитьПараметр("ДатаПродажи", ДокументСсылкаПродажаЛицензии.Дата);
	
	
	Запрос.ВыполнитьПакет();
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПодготовитьСтруктурыСубконтоСчетовДоходаПродажи(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства); //+++ Дмгг
	
	// Формирование проводок документа.
	УправлениеНебольшойФирмойСервер.СформироватьТаблицуПроводок(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства);
	СформитоватьТаблицаЛицензии(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства);	
	СформироватьТаблицаПродажи(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства);

	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ПродажаЛицензии(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства);


	
	// Рублевые суммы документов
	Если  ДокументСсылкаПродажаЛицензии.Договор.ВалютаРасчетов <> Константы.НациональнаяВалюта.Получить() Тогда
		
		ТаблицаВзаиморасчеты = РублевыеСуммыДокументов.ПодготовитьТаблицуДокументаРасчетыВВалюте(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства);
		Если СтруктураДополнительныеСвойства.ДляПроведения.ВалютаДокумента <> СтруктураДополнительныеСвойства.ДляПроведения.НациональнаяВалюта Тогда
			РублевыеСуммыДокументов.РаспределитьАвансыПоТаблицеРеализации(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства, ТаблицаВзаиморасчеты);
		КонецЕсли;
		РублевыеСуммыДокументов.СформироватьТаблицаРублевыеСуммыДокументовВВалюте(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства);
		РублевыеСуммыДокументов.ДобавитьДвиженияВТаблицуРасчетов(
			ТаблицаВзаиморасчеты,
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПокупателями,
			ДокументСсылкаПродажаЛицензии,
			СтруктураДополнительныеСвойства,
			Ложь);
			
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРублевыеСуммыДокументовВВалюте", Новый ТаблицаЗначений);
	КонецЕсли;

	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Функция ТекстЗапросаИнициализироватьДанныеДокумента()
	
	Возврат	
	"ВЫБРАТЬ
	|	ПродажаЛицензии.Ссылка КАК Ссылка,
	|	ПродажаЛицензии.НомерСтроки КАК НомерСтроки,
	|	ПродажаЛицензии.Номенклатура КАК Номенклатура,
	|	ПродажаЛицензии.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК СерийныеНомера,
	|	ПродажаЛицензии.Цена КАК Цена,
	|	НЕОПРЕДЕЛЕНО КАК ПроцентСкидкиНаценки,
	|	ПродажаЛицензии.СтавкаНДС КАК СтавкаНДС,
	|	НЕОПРЕДЕЛЕНО КАК Заказ,
	|	ПродажаЛицензии.Всего КАК Себестоимость,
	|	НЕОПРЕДЕЛЕНО КАК ТипНоменклатурыЗапас,
	|	НЕОПРЕДЕЛЕНО КАК Резерв,
	|	НЕОПРЕДЕЛЕНО КАК Содержание,
	|	НЕОПРЕДЕЛЕНО КАК КлючСвязи,
	|	НЕОПРЕДЕЛЕНО КАК СуммаАвтоматическойСкидки,
	|	НЕОПРЕДЕЛЕНО КАК СправкаБ,
	|	НЕОПРЕДЕЛЕНО КАК Партия,
	|	1 КАК Количество,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО КАК ТоварыДляПроизводства,
	|	НЕОПРЕДЕЛЕНО КАК Вес,
	|	НЕОПРЕДЕЛЕНО КАК ЭтоПодарок,
	|	НЕОПРЕДЕЛЕНО КАК Сотрудник,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	НЕОПРЕДЕЛЕНО КАК СуммаНДФЛ,
	|	НЕОПРЕДЕЛЕНО КАК УдержаниеПенсии,
	|	НЕОПРЕДЕЛЕНО КАК УдерживатьПенсию,
	|	НЕОПРЕДЕЛЕНО КАК СуммаНДСБезвозмездно,
	|	НЕОПРЕДЕЛЕНО КАК Объем,
	|	ПродажаЛицензии.Всего - ПродажаЛицензии.Всего / (1 + ПродажаЛицензии.СтавкаНДС.Ставка / 100) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ПродажаЛицензии.Всего - ВЫБОР
	|			КОГДА ПродажаЛицензии.СтавкаНДС.Ставка = 0
	|				ТОГДА 0
	|			ИНАЧЕ ПродажаЛицензии.Всего - ПродажаЛицензии.Всего / (1 + ПродажаЛицензии.СтавкаНДС.Ставка / 100)
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК Сумма,
	|	НЕОПРЕДЕЛЕНО КАК ВидНачисленияУдержания,
	|	НЕОПРЕДЕЛЕНО КАК ВидНалогаНДФЛ,
	|	НЕОПРЕДЕЛЕНО КАК СчетДоходовБП,
	|	НЕОПРЕДЕЛЕНО КАК ВидУдержанияПФ,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) КАК Проект,
	|	НЕОПРЕДЕЛЕНО КАК ПровестиНалогПрибили,
	|	НЕОПРЕДЕЛЕНО КАК СчетУчетаВыручкиОтПродажРегл,
	|	ПродажаЛицензии.ЕдиницаИзмерения.Коэффициент КАК ЕдиницаИзмеренияКоэффициент,
	|	ПродажаЛицензии.Всего КАК Всего,
	|	ПродажаЛицензии.СтавкаЛицензии.Ставка КАК СтавкаЛицензии
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыПерерасчетПред
	|ИЗ
	|	Документ.ПродажаЛицензии.Запасы КАК ПродажаЛицензии
	|ГДЕ
	|	ПродажаЛицензии.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.СуммаНДС КАК ЧИСЛО(15, 6))) КАК ЧИСЛО(15, 6)) КАК СуммаНДС,
	|	СУММА(1) КАК КоличествоСтрок,
	|	ВЫРАЗИТЬ(СУММА(ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.Сумма КАК ЧИСЛО(15, 6))) КАК ЧИСЛО(15, 6)) КАК Сумма
	|ПОМЕСТИТЬ вт_ЗапасыГрупп
	|ИЗ
	|	ВременнаяТаблицаЗапасыПерерасчетПред КАК ВременнаяТаблицаЗапасыПерерасчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка КАК Ссылка,
	|	ВременнаяТаблицаЗапасыПерерасчет.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаЗапасыПерерасчет.Номенклатура КАК Номенклатура,
	|	ВременнаяТаблицаЗапасыПерерасчет.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВременнаяТаблицаЗапасыПерерасчет.Характеристика КАК Характеристика,
	|	ВременнаяТаблицаЗапасыПерерасчет.СерийныеНомера КАК СерийныеНомера,
	|	ВременнаяТаблицаЗапасыПерерасчет.Цена КАК Цена,
	|	ВременнаяТаблицаЗапасыПерерасчет.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ВременнаяТаблицаЗапасыПерерасчет.СтавкаНДС КАК СтавкаНДС,
	|	ВременнаяТаблицаЗапасыПерерасчет.Заказ КАК Заказ,
	|	ВременнаяТаблицаЗапасыПерерасчет.ТипНоменклатурыЗапас КАК ТипНоменклатурыЗапас,
	|	ВременнаяТаблицаЗапасыПерерасчет.Содержание КАК Содержание,
	|	ВременнаяТаблицаЗапасыПерерасчет.КлючСвязи КАК КлючСвязи,
	|	ВременнаяТаблицаЗапасыПерерасчет.Резерв КАК Резерв,
	|	ВременнаяТаблицаЗапасыПерерасчет.СправкаБ КАК СправкаБ,
	|	ВременнаяТаблицаЗапасыПерерасчет.Партия КАК Партия,
	|	ВременнаяТаблицаЗапасыПерерасчет.Количество КАК Количество,
	|	ВременнаяТаблицаЗапасыПерерасчет.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВременнаяТаблицаЗапасыПерерасчет.НомерГТД КАК НомерГТД,
	|	ВременнаяТаблицаЗапасыПерерасчет.ТоварыДляПроизводства КАК ТоварыДляПроизводства,
	|	ВременнаяТаблицаЗапасыПерерасчет.Вес КАК Вес,
	|	ВременнаяТаблицаЗапасыПерерасчет.Объем КАК Объем,
	|	ВременнаяТаблицаЗапасыПерерасчет.ЭтоПодарок КАК ЭтоПодарок,
	|	ВременнаяТаблицаЗапасыПерерасчет.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблицаЗапасыПерерасчет.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗапасыПерерасчет.СуммаНДФЛ КАК СуммаНДФЛ,
	|	ВременнаяТаблицаЗапасыПерерасчет.УдержаниеПенсии КАК УдержаниеПенсии,
	|	ВременнаяТаблицаЗапасыПерерасчет.УдерживатьПенсию КАК УдерживатьПенсию,
	|	ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.СуммаНДС КАК ЧИСЛО(15, 6)) КАК СуммаНДС,
	|	ВременнаяТаблицаЗапасыПерерасчет.СуммаНДСБезвозмездно КАК СуммаНДСБезвозмездно,
	|	ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.Сумма КАК ЧИСЛО(15, 6)) КАК Сумма,
	|	ВременнаяТаблицаЗапасыПерерасчет.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ВременнаяТаблицаЗапасыПерерасчет.ВидНалогаНДФЛ КАК ВидНалогаНДФЛ,
	|	ВременнаяТаблицаЗапасыПерерасчет.СчетДоходовБП КАК СчетДоходовБП,
	|	ВременнаяТаблицаЗапасыПерерасчет.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ВременнаяТаблицаЗапасыПерерасчет.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам
	|			ТОГДА ВременнаяТаблицаЗапасыПерерасчет.Проект
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОНЕЦ КАК Проект,
	|	ВременнаяТаблицаЗапасыПерерасчет.ПровестиНалогПрибили КАК ПровестиНалогПрибили,
	|	ВременнаяТаблицаЗапасыПерерасчет.СчетУчетаВыручкиОтПродажРегл КАК СчетУчетаВыручкиОтПродажРегл,
	|	ВременнаяТаблицаЗапасыПерерасчет.ЕдиницаИзмеренияКоэффициент КАК ЕдиницаИзмеренияКоэффициент,
	|	ВременнаяТаблицаЗапасыПерерасчет.Себестоимость КАК Себестоимость,
	|	ВременнаяТаблицаЗапасыПерерасчет.Всего КАК Всего,
	|	ВременнаяТаблицаЗапасыПерерасчет.СтавкаЛицензии КАК СтавкаЛицензии
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыПерерасчет
	|ИЗ
	|	ВременнаяТаблицаЗапасыПерерасчетПред КАК ВременнаяТаблицаЗапасыПерерасчет,
	|	вт_ЗапасыГрупп КАК вт_ЗапасыГрупп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажаЛицензииПредоплата.Ссылка КАК Ссылка,
	|	СУММА(ПродажаЛицензииПредоплата.СуммаРасчетов) КАК СуммаРасчетов,
	|	СУММА(ПродажаЛицензииПредоплата.СуммаРасчетов * ПродажаЛицензииПредоплата.Курс / ПродажаЛицензииПредоплата.Кратность) КАК СуммаРасчетовРеглПоКурсуПредоплаты
	|ПОМЕСТИТЬ ВременнаяТаблицаСуммаПредоплатыГрупп
	|ИЗ
	|	Документ.ПродажаЛицензии.Предоплата КАК ПродажаЛицензииПредоплата
	|ГДЕ
	|	ПродажаЛицензииПредоплата.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажаЛицензииПредоплата.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажаЛицензии.Ссылка КАК Ссылка,
	|	ПродажаЛицензии.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) КАК СуммаНеОплаченаВал,
	|	(ПродажаЛицензии.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * ПродажаЛицензии.Курс / ПродажаЛицензии.Кратность КАК СуммаНеОплаченаРегл,
	|	ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) КАК СуммаРасчетовВал,
	|	ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты КАК СуммаРасчетовРегл,
	|	(ПродажаЛицензии.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * ПродажаЛицензии.Курс / ПродажаЛицензии.Кратность + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты, 0) КАК СуммаДокументаРеглПоВсемКурсам,
	|	ВЫБОР
	|		КОГДА ПродажаЛицензии.СуммаДокумента = 0
	|			ТОГДА 1
	|		ИНАЧЕ ((ПродажаЛицензии.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * ПродажаЛицензии.Курс / ПродажаЛицензии.Кратность + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты, 0)) / ПродажаЛицензии.СуммаДокумента
	|	КОНЕЦ КАК СреднийКурсДокумента,
	|	1 КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПредоплаты
	|ИЗ
	|	Документ.ПродажаЛицензии КАК ПродажаЛицензии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСуммаПредоплатыГрупп КАК ВременнаяТаблицаСуммаПредоплатыГрупп
	|		ПО ПродажаЛицензии.Ссылка = ВременнаяТаблицаСуммаПредоплатыГрупп.Ссылка
	|ГДЕ
	|	ПродажаЛицензии.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность КАК Кратность,
	|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка КАК Ссылка,
	|	ВременнаяТаблицаСреднегоКурсаПредоплаты.СреднийКурсДокумента КАК Курс
	|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПоДокументу
	|ИЗ
	|	ВременнаяТаблицаСреднегоКурсаПредоплаты КАК ВременнаяТаблицаСреднегоКурсаПредоплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажаЛицензии.Договор.ЭтоДоговорОбслуживания КАК ЭтоДоговорОбслуживания,
	|	ВЫБОР
	|		КОГДА ПродажаЛицензии.Договор.ЭтоДоговорОбслуживания
	|				И ПродажаЛицензии.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВестиУчетРасходовПоДоговорамОбслуживания,
	|	ПродажаЛицензии.Договор.ДоговорОбслуживанияНаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПродажаЛицензии.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПродажаЛицензии.ВидНалогаНДС КАК ВидНалогаНДС,
	|	ПродажаЛицензии.Договор.ВалютаРасчетов КАК ДоговорВалютаРасчетов,
	|	ПродажаЛицензии.Договор.РасчетыВУсловныхЕдиницах КАК ДоговорРасчетыВУсловныхЕдиницах,
	|	ПродажаЛицензии.Контрагент КАК Контрагент,
	|	ПродажаЛицензии.ВалютаДокумента КАК ВалютаДокумента,
	|	ПродажаЛицензии.Кратность КАК Кратность,
	|	ПродажаЛицензии.Курс КАК Курс,
	|	ПродажаЛицензии.Договор КАК Договор,
	|	NULL КАК СчетЗатратБезвозмезднойПродажи,
	|	NULL КАК СчетЗатратНДСБезвозмезднойПродажи,
	|	NULL КАК СчетУчетаНалогаНаПрибыль,
	|	NULL КАК СчетУчетаНалогаНаПрибыльПодлежащийОплате,
	|	NULL КАК СчетЗатратБезвозмезднойПродажиСотрудник,
	|	NULL КАК СчетЗатратНДСБезвозмезднойПродажиСотрудник,
	|	NULL КАК СчетЗатратНДФЛСотрудник,
	|	NULL КАК СчетЗатратПФСотрудник,
	|	NULL КАК СчетУчетаСвободнаяпродажаСотрудник,
	|	NULL КАК СчетУчетаСвободнаяпродажа,
	|	NULL КАК ВидНачисленияУдержания,
	|	ПродажаЛицензии.Дата КАК Дата,
	|	NULL КАК ВидИспользоыванияБалов,
	|	NULL КАК ПоложениеСклада
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.ПродажаЛицензии КАК ПродажаЛицензии
	|ГДЕ
	|	ПродажаЛицензии.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаНациональная, &ВалютаНакладной)) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПродажаЛицензииЛицензии.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ МаксНомерСтрокиЗапасы
	|ИЗ
	|	Документ.ПродажаЛицензии.Запасы КАК ПродажаЛицензииЛицензии
	|ГДЕ
	|	ПродажаЛицензииЛицензии.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.Ссылка КАК Ссылка,
	|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяЗапасы.Партия КАК Партия,
	|	РасходнаяНакладнаяЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	РасходнаяНакладнаяЗапасы.НомерГТД КАК НомерГТД,
	|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
	|	РасходнаяНакладнаяЗапасы.Заказ КАК Заказ,
	|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РасходнаяНакладнаяЗапасы.Количество КАК Количество,
	|	РасходнаяНакладнаяЗапасы.Резерв КАК Резерв,
	|	РасходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС,
	|	РасходнаяНакладнаяЗапасы.Сумма КАК Сумма,
	|	РасходнаяНакладнаяЗапасы.КлючСвязи КАК КлючСвязи,
	|	РасходнаяНакладнаяЗапасы.ЭтоПодарок КАК ЭтоПодарок,
	|	РасходнаяНакладнаяЗапасы.Сотрудник КАК Сотрудник,
	|	РасходнаяНакладнаяЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	РасходнаяНакладнаяЗапасы.СуммаНДФЛ КАК СуммаНДФЛ,
	|	РасходнаяНакладнаяЗапасы.УдержаниеПенсии КАК УдержаниеПенсии,
	|	РасходнаяНакладнаяЗапасы.УдержаниеПенсии КАК СуммаПФ,
	|	РасходнаяНакладнаяЗапасы.УдерживатьПенсию КАК УдерживатьПенсию,
	|	РасходнаяНакладнаяЗапасы.СуммаНДСБезвозмездно КАК СуммаНДСБезвозмездно,
	|	РасходнаяНакладнаяЗапасы.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	РасходнаяНакладнаяЗапасы.ВидНачисленияУдержания КАК ВидУдержанияНДФЛ,
	|	РасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ КАК ВидНалогаНДФЛ,
	|	РасходнаяНакладнаяЗапасы.СчетДоходовБП КАК СчетДоходовБП,
	|	РасходнаяНакладнаяЗапасы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	РасходнаяНакладнаяЗапасы.ПровестиНалогПрибили КАК ПровестиНалогПрибили,
	|	РасходнаяНакладнаяЗапасы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам
	|			ТОГДА РасходнаяНакладнаяЗапасы.Проект
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОНЕЦ КАК Проект,
	|	РасходнаяНакладнаяЗапасы.СчетУчетаВыручкиОтПродажРегл КАК СчетУчетаВыручкиОтПродажРегл,
	|	ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Количество * РасходнаяНакладнаяЗапасы.Цена КАК ЧИСЛО(15, 2)) КАК СуммаБезСкидки,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Подразделение КАК ПодразделениеПродажи,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА РасходнаяНакладнаяЗапасы.СуммаНДС
	|			ИНАЧЕ РасходнаяНакладнаяЗапасы.СуммаНДС * СреднийКурсДокументаа.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокументаа.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаНДСРегл,
	|	РасходнаяНакладнаяЗапасы.Себестоимость КАК Себестоимость,
	|	РасходнаяНакладнаяЗапасы.Всего КАК Всего,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА РасходнаяНакладнаяЗапасы.Всего
	|			ИНАЧЕ РасходнаяНакладнаяЗапасы.Всего * СреднийКурсДокументаа.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокументаа.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаРегл,
	|	РасходнаяНакладнаяЗапасы.СтавкаЛицензии КАК СтавкаЛицензии
	|ПОМЕСТИТЬ ВТРасходнаяНакладнаяЗапасы
	|ИЗ
	|	ВременнаяТаблицаЗапасыПерерасчет КАК РасходнаяНакладнаяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
	|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
	|		ПО (КурсыРегВалюты.Валюта = &ВалютаНациональная)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокументаа
	|		ПО (СреднийКурсДокументаа.Ссылка.ВалютаДокумента = РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента)
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасходнаяНакладнаяЗапасы1.НомерСтроки КАК НомерСтроки,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка КАК Документ,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка.Контрагент КАК Контрагент,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка.Договор КАК Договор,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ВТРасходнаяНакладнаяЗапасы1.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельностиПродажи,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
	|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы1.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
	|	КОНЕЦ КАК СчетУчетаПродажи,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
	|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы1.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
	|	КОНЕЦ КАК СчетУчетаСебестоимость,
	|	ВТРасходнаяНакладнаяЗапасы1.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВТРасходнаяНакладнаяЗапасы1.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|	ВТРасходнаяНакладнаяЗапасы1.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ВТРасходнаяНакладнаяЗапасы1.Номенклатура.СчетУчетаЗапасов КАК СчетУчета,
	|	ВТРасходнаяНакладнаяЗапасы1.Номенклатура.СчетУчетаПереработчикуРегл КАК СчетУчетаПереработчикуРегл,
	|	ВТРасходнаяНакладнаяЗапасы1.Номенклатура КАК Номенклатура,
	|	ВТРасходнаяНакладнаяЗапасы1.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВТРасходнаяНакладнаяЗапасы1.НомерГТД КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы1.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы1.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТРасходнаяНакладнаяЗапасы1.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы1.Количество
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТРасходнаяНакладнаяЗапасы1.Количество * ВТРасходнаяНакладнаяЗапасы1.ЕдиницаИзмерения.Коэффициент - &СмещениеДляОкругления КАК ЧИСЛО(15, 3))
	|	КОНЕЦ КАК Количество,
	|	ВТРасходнаяНакладнаяЗапасы1.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы1.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы1.СуммаНДС * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы1.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы1.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы1.СуммаНДС
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаНДСВал,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ВТРасходнаяНакладнаяЗапасы1.КлючСвязи КАК КлючСвязи,
	|	ВременнаяТаблицаШапка.ВидНалогаНДС КАК ВидНалогаНДС,
	|	ВременнаяТаблицаШапка.СчетЗатратБезвозмезднойПродажи КАК СчетЗатратБезвозмезднойПродажи,
	|	ВременнаяТаблицаШапка.СчетЗатратНДСБезвозмезднойПродажи КАК СчетЗатратНДСБезвозмезднойПродажи,
	|	ВременнаяТаблицаШапка.СчетУчетаНалогаНаПрибыль КАК СчетУчетаНалогаНаПрибыль,
	|	ВременнаяТаблицаШапка.СчетУчетаНалогаНаПрибыльПодлежащийОплате КАК СчетУчетаНалогаНаПрибыльПодлежащийОплате,
	|	ВременнаяТаблицаШапка.СчетУчетаСвободнаяпродажа КАК СчетУчетаСвободнаяпродажа,
	|	ВременнаяТаблицаШапка.СчетУчетаСвободнаяпродажаСотрудник КАК СчетУчетаСвободнаяпродажаСотрудник,
	|	ВТРасходнаяНакладнаяЗапасы1.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ВТРасходнаяНакладнаяЗапасы1.СчетДоходовБП КАК СчетДоходовБП,
	|	ВТРасходнаяНакладнаяЗапасы1.ЭтоПодарок КАК ЭтоПодарок,
	|	ВТРасходнаяНакладнаяЗапасы1.Сотрудник КАК Сотрудник,
	|	ВТРасходнаяНакладнаяЗапасы1.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ВТРасходнаяНакладнаяЗапасы1.СуммаНДФЛ КАК СуммаНДФЛ,
	|	ВТРасходнаяНакладнаяЗапасы1.УдержаниеПенсии КАК УдержаниеПенсии,
	|	ВТРасходнаяНакладнаяЗапасы1.УдерживатьПенсию КАК УдерживатьПенсию,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка.ВалютаДокумента КАК ВалютаБезвозмезднойПродажи,
	|	ВТРасходнаяНакладнаяЗапасы1.ВидНалогаНДФЛ КАК ВидУдержанияНДФЛ,
	|	ВТРасходнаяНакладнаяЗапасы1.СуммаНДСБезвозмездно КАК СуммаНДСБезвозмездно,
	|	ВременнаяТаблицаШапка.СчетЗатратБезвозмезднойПродажиСотрудник КАК СчетЗатратБезвозмезднойПродажиСотрудник,
	|	ВременнаяТаблицаШапка.СчетЗатратНДСБезвозмезднойПродажиСотрудник КАК СчетЗатратНДСБезвозмезднойПродажиСотрудник,
	|	ВременнаяТаблицаШапка.СчетЗатратНДФЛСотрудник КАК СчетЗатратНДФЛСотрудник,
	|	ВременнаяТаблицаШапка.СчетЗатратПФСотрудник КАК СчетЗатратПФСотрудник,
	|	ВТРасходнаяНакладнаяЗапасы1.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ВТРасходнаяНакладнаяЗапасы1.СуммаНДС КАК СуммаНДСВалютаДокумента,
	|	ВТРасходнаяНакладнаяЗапасы1.Проект КАК Проект,
	|	ВТРасходнаяНакладнаяЗапасы1.ПровестиНалогПрибили КАК ПровестиНалогПрибили,
	|	ВременнаяТаблицаШапка.ПоложениеСклада КАК ПоложениеСклада,
	|	ВТРасходнаяНакладнаяЗапасы1.СуммаБезСкидки КАК СуммаБезСкидки,
	|	ВременнаяТаблицаШапка.ВидИспользоыванияБалов КАК ВидИспользоыванияБалов,
	|	ВТРасходнаяНакладнаяЗапасы1.ПодразделениеПродажи КАК ПодразделениеПродажи,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы1.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы1.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы1.СуммаНДС * СреднийКурсДокументаа.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокументаа.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаНДСЗакупкиПродажи,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы1.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы1.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы1.СуммаНДСРегл
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы1.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы1.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы1.СуммаРегл
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК Сумма,
	|	ВТРасходнаяНакладнаяЗапасы1.Себестоимость КАК Себестоимость,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы1.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы1.Всего * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы1.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы1.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы1.Всего
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаВал,
	//|	ЕСТЬNULL(ЛизензииОстатки.СебестоимостьОстаток, 0) * ВТРасходнаяНакладнаяЗапасы1.СтавкаЛицензии / 100 КАК СебестоимостьПродажи,
	|  ВЫБОР 
	|  КОГДА (ЕСТЬNULL(ЛизензииОстатки.СебестоимостьОстаток, 0) * ВТРасходнаяНакладнаяЗапасы1.СтавкаЛицензии / 100) = 0 ТОГДА 0.01
	|	ИНАЧЕ ЕСТЬNULL(ЛизензииОстатки.СебестоимостьОстаток, 0) * ВТРасходнаяНакладнаяЗапасы1.СтавкаЛицензии / 100		
	|	КОНЕЦ  КАК СебестоимостьПродажи,	
	
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы1.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА (ВТРасходнаяНакладнаяЗапасы1.Всего - ВТРасходнаяНакладнаяЗапасы1.СуммаНДС) * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ (ВТРасходнаяНакладнаяЗапасы1.Всего - ВТРасходнаяНакладнаяЗапасы1.СуммаНДС) * СреднийКурсДокументаа.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокументаа.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.СуммаВключаетНДС
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА ВТРасходнаяНакладнаяЗапасы1.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|							ТОГДА (ВТРасходнаяНакладнаяЗапасы1.Всего - ВТРасходнаяНакладнаяЗапасы1.СуммаНДС) * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы1.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы1.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|						ИНАЧЕ ВТРасходнаяНакладнаяЗапасы1.Всего - ВТРасходнаяНакладнаяЗапасы1.СуммаНДС
	|					КОНЕЦ КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ВТРасходнаяНакладнаяЗапасы1.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|						ТОГДА ВТРасходнаяНакладнаяЗапасы1.Сумма * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы1.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы1.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|					ИНАЧЕ ВТРасходнаяНакладнаяЗапасы1.Сумма
	|				КОНЕЦ КАК ЧИСЛО(15, 6))
	|	КОНЕЦ КАК СуммаБезНДСВал,
	|	ВТРасходнаяНакладнаяЗапасы1.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл КАК СчетУчетаПродажиРегл,
	|	ВТРасходнаяНакладнаяЗапасы1.Ссылка.Подразделение КАК СтруктурнаяЕдиница,
	|	ВТРасходнаяНакладнаяЗапасы1.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК СчетУчетаСебестоимостиПродажРегл,
	|	ВТРасходнаяНакладнаяЗапасы1.Всего КАК ВсегоВалютаДокумента,
	|	ВТРасходнаяНакладнаяЗапасы1.Номенклатура.СтавкаЛицензии КАК СтавкаЛицензии
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	ВТРасходнаяНакладнаяЗапасы КАК ВТРасходнаяНакладнаяЗапасы1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
	|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
	|		ПО (КурсыРегВалюты.Валюта = &ВалютаНациональная)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокументаа
	|		ПО (СреднийКурсДокументаа.Ссылка.ВалютаДокумента = ВТРасходнаяНакладнаяЗапасы1.Ссылка.ВалютаДокумента)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лицензии.Остатки(&ДатаПродажи, Организация = &Организация) КАК ЛизензииОстатки
	|		ПО ВТРасходнаяНакладнаяЗапасы1.Ссылка.Организация = ЛизензииОстатки.Организация
	|			И ВТРасходнаяНакладнаяЗапасы1.Номенклатура = ЛизензииОстатки.Номенклатура,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка,
	|	Константа.СчетВыручкиВТабличнойЧасти КАК КонстантаСчетВыручкиВТабличнойЧасти,
	|	Константа.ФункциональнаяОпцияПередачаСырьяВПереработку КАК ФункциональнаяОпцияПередачаСырьяВПереработку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл КАК СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл КАК СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Ссылка.Организация КАК ОрганизацияВНУ,
	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ТаблицаДокумента.Ссылка.Договор КАК Договор,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельностиПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс) КАК ТипРасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетовКуда,
	|	&Ссылка КАК ДокументКуда,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Статья
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|			КОНЕЦ
	|	КОНЕЦ КАК Статья,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.Взаимозачет).Дата
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
	|	КОНЕЦ КАК ДокументДата,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 6))) КАК СуммаАванса,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютДокументаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютДокументаСрезПоследних.Кратность) КАК ЧИСЛО(15, 6))) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.ОперацияПоПлатежнымКартам)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЭквайринговаяОперация,
	|	ТаблицаДокумента.Документ.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	НАЧАЛОПЕРИОДА(ТаблицаДокумента.Документ.Дата, ДЕНЬ) КАК ДатаПлатежа,
	|	ТаблицаДокумента.Курс КАК Курс,
	|	ТаблицаДокумента.Кратность КАК Кратность,
	|	ТаблицаДокумента.Ссылка.Договор.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс / ТаблицаДокумента.Кратность КАК ЧИСЛО(15, 6))) КАК СуммаРубПоКурсуАванса,
	|	NULL КАК ДокументОснование
	|ПОМЕСТИТЬ ВременнаяТаблицаПредоплата
	|ИЗ
	|	Документ.ПродажаЛицензии.Предоплата КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютДокументаСрезПоследних
	|		ПО (КурсыВалютДокументаСрезПоследних.Валюта = &ВалютаНакладной)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Ссылка.Договор,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Статья
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.Взаимозачет).Дата
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Документ.ЭквайринговыйТерминал,
	|	НАЧАЛОПЕРИОДА(ТаблицаДокумента.Документ.Дата, ДЕНЬ),
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.ОперацияПоПлатежнымКартам)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Курс,
	|	ТаблицаДокумента.Кратность,
	|	ТаблицаДокумента.Ссылка.Договор.РасчетыВУсловныхЕдиницах,
	|	ТаблицаДокумента.Ссылка.Организация,
	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл";
	//|	И РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности <> ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка)";
	
КонецФункции

#КонецОбласти

#Область Проведение


Процедура СформитоватьТаблицаЛицензии(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	
	 "ВЫБРАТЬ
	 |	1 КАК Порялок,
	 |	ТаблицаПродажи.Период КАК Период,
	 |	ТаблицаПродажи.Организация КАК Организация,
	 |	ТаблицаПродажи.Номенклатура КАК Номенклатура,
	 |	СУММА(ТаблицаПродажи.СебестоимостьПродажи) КАК Себестоимость,
	 |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	 |ИЗ
	 |	ВременнаяТаблицаЗапасы КАК ТаблицаПродажи
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ТаблицаПродажи.Период,
	 |	ТаблицаПродажи.Организация,
	 |	ТаблицаПродажи.Номенклатура";
	
	
	 РезультатЗапроса = Запрос.Выполнить();
	 СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЛицензии", РезультатЗапроса.Выгрузить());

КонецПроцедуры

Процедура СформироватьТаблицаПродажи(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порялок,
	|	ТаблицаПродажи.Период КАК Период,
	|	ТаблицаПродажи.Организация КАК Организация,
	|	ТаблицаПродажи.Номенклатура КАК Номенклатура,
	|	ТаблицаПродажи.Характеристика КАК Характеристика,
	|	ТаблицаПродажи.Партия КАК Партия,
	|	ТаблицаПродажи.Контрагент КАК Контрагент,
	|	ТаблицаПродажи.Документ КАК Документ,
	|	ТаблицаПродажи.СтавкаНДС КАК СтавкаНДС,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) КАК Проект,
	|	ТаблицаПродажи.ПодразделениеПродажи КАК Подразделение,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	|	СУММА(ТаблицаПродажи.СуммаНДСЗакупкиПродажи) КАК СуммаНДС,
	|	СУММА(ТаблицаПродажи.Сумма) КАК Сумма,
	|	ТаблицаПродажи.СебестоимостьПродажи КАК Себестоимость
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаПродажи
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.Организация,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Характеристика,
	|	ТаблицаПродажи.Партия,
	|	ТаблицаПродажи.Документ,
	|	ТаблицаПродажи.СтавкаНДС,
	|	ТаблицаПродажи.ПодразделениеПродажи,
	|	ТаблицаПродажи.Контрагент,
	|	ТаблицаПродажи.СебестоимостьПродажи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажи", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПродажи()

Процедура СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства)
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.ВидНалогаНДС КАК ВидНалога,
	|	СУММА(ТаблицаЗапасы.СуммаНДС) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС)
	|					И ТаблицаЗапасы.СтавкаНДС.Ставка <> 0
	|				ТОГДА ИСТИНА
	|			КОГДА &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|					И ТаблицаЗапасы.СтавкаНДС.Ставка <> 0
	|				ТОГДА ИСТИНА
	|			КОГДА &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НаЭкспорт)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ТаблицаЗапасы.СуммаНДС <> 0
	|		КОНЕЦ
	|	И ТаблицаЗапасы.СуммаНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНалогаНДС";
	
	Запрос.УстановитьПараметр("НалогообложениеНДС", ДокументСсылкаПродажаЛицензии.НалогообложениеНДС);
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры 

Процедура СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПродажаЛицензии);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВозникновениеОбязательствПокупателя", НСтр("ka='მყიდველის ვალდებულებების წარმოშობა';ru='Возникновение обязательств покупателя';en='The emergence of the obligations of the buyer'"));
	Запрос.УстановитьПараметр("ВозникновениеОбязательствПокупателяПоДоставке", НСтр("ka='Возникновение обязательств покупателя по доставке';ru='Возникновение обязательств покупателя по доставке';en=""The emergence of the buyer's delivery obligation"""));
	Запрос.УстановитьПараметр("ЗачетАванса", НСтр("ka='წინასწარ გადახდილი თანხის ჩათვლა';ru='Зачет предоплаты';en='Зачет предоплаты'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("БезвозмезднаяПродажа", НСтр("ka='Безвозмездная продажа';ru='Безвозмездная продажа';en='Безвозмездная продажа'"));
	
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	
	// Формирование временной таблицы по расчетам с покупателями.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Период КАК Дата,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем КАК СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект,
	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,
	|	СУММА(ТаблицаДокумента.Сумма) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаДляОстатка,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВалДляОстатка,
	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПокупателя КАК СТРОКА(100)) КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.пустаяссылка) КАК Заказ
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателями
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Сумма <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетов,
	|	СУММА(ТаблицаДокумента.СуммаАванса),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	СУММА(ТаблицаДокумента.СуммаАванса),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100)),
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.пустаяссылка)
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.ТипРасчетов,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.ДокументКуда
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетовКуда,
	|	СУММА(ТаблицаДокумента.СуммаАванса),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	-СУММА(ТаблицаДокумента.СуммаАванса),
	|	-СУММА(ТаблицаДокумента.СуммаВал),
	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100)),
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.пустаяссылка)
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.ДокументКуда
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетовКуда
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Проект,
	|	ТипРасчетов,
	|	СчетУчета";
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПокупателями.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПокупателями.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПокупателями.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПокупателями.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПокупателями.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПокупателями КАК ВременнаяТаблицаРасчетыСПокупателями";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПокупателями");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса);
	Запрос.Текст = Запрос.Текст + ";" + УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателямиРегл(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры

Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаПродажаЛицензии, СтруктураДополнительныеСвойства)
	
	СтруктураСчетовКурсРазниц = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(СтруктураДополнительныеСвойства.ДляПроведения.Организация, СтруктураДополнительныеСвойства.ДляПроведения.Дата);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаДоходыИРасходы.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период КАК Период,
	|	ТаблицаДоходыИРасходы.Организация КАК Организация,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) КАК Проект,
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажиРегл КАК СчетУчетаРегл,
	|	НЕОПРЕДЕЛЕНО КАК Аналитика,
	|	ВЫРАЗИТЬ(&Выручка КАК СТРОКА(100)) КАК СодержаниеПроводки,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаБезНДС) КАК СуммаДоходов,
	|	0 КАК СуммаРасходов,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаБезНДС) КАК Сумма,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.ПродажаПокупателю) КАК ХозяйственнаяОперация
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	ТаблицаДоходыИРасходы.СуммаБезНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажиРегл,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
	|	ТаблицаДоходыИРасходы.СчетУчетаСебестоимостиПродажРегл,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫРАЗИТЬ(&Расходи КАК СТРОКА(100)),
	|	СУММА(0),
	|	ТаблицаДоходыИРасходы.СебестоимостьПродажи,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаБезНДС),
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.ПродажаПокупателю)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	ТаблицаДоходыИРасходы.СебестоимостьПродажи <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиница,
	|	ТаблицаДоходыИРасходы.СебестоимостьПродажи,
	|	ТаблицаДоходыИРасходы.СчетУчетаСебестоимостиПродажРегл
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	//Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеДоходы);
	//Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеРасходы);
	Запрос.УстановитьПараметр("Выручка", НСтр("en='Sales proceeds';ka='შემოსავალი გაყიდვიდან';ru='Выручка от продажи'"));
	Запрос.УстановитьПараметр("Расходи", НСтр("ru = 'Отражение расходов'; ka = 'ხარჯების ასახვა'; en = 'reflection expenditure'"));	
	
	//Запрос.УстановитьПараметр("Доставка", НСтр("en='Revenue from delivery';ka='Выручка от доставки';ru='Выручка от доставки'"));
	//Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("en='Exchange difference';ka='სხვაობა კურსებს შორის';ru='Курсовая разница'"));
	//Запрос.УстановитьПараметр("БезвозмезднаяПродажа", НСтр("en='Free sale';ka='Безвозмезная продажа';ru='Безвозмезная продажа'"));
	Запрос.УстановитьПараметр("СписаниеСебестоимости", НСтр("en='Write-off of cost';ka='Списание себестоимости';ru='Списание себестоимости'"));
	//Запрос.УстановитьПараметр("НДС", НСтр("en='VAT';ka='НДС';ru='НДС'"));
	//Запрос.УстановитьПараметр("НДФЛ", НСтр("en='PIT';ka='НДФЛ';ru='НДФЛ'"));
	//Запрос.УстановитьПараметр("ПФ", НСтр("en='PF';ka='ПФ';ru='ПФ'"));
	//Запрос.УстановитьПараметр("СписаниеСуммыБезНалогов", НСтр("en='Write-off amounts without taxes';ka='Списание суммы без налогов';ru='Списание суммы без налогов'"));
	
	//Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	//
	//	Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность);
	//	Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность);
	//	
	//Иначе
	//
	//	Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);
	//	Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);

	//КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

#КонецОбласти

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаЗакупкаЛицензии, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь, ПроверятьИтогиРегистров = ЛОЖЬ) Экспорт
	
	Если НЕ УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;
	
	// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
		Возврат;
	КонецЕсли;
	// Конец МобильноеПриложение
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияЗапасыИзменение", "ДвиженияЗапасыНаСкладахИзменение", 
	// "ДвиженияЗапасыКПоступлениюНаСкладыИзменение", "ДвиженияЗапасыПереданныеИзменение",
	// "ДвиженияЗапасыПринятыеИзменение", "ДвиженияРазмещениеЗаказовИзменение",
	// "ДвиженияПотребностьВЗапасахИзменение" содержат записи, необходимо выполнить контроль 
	// реализации товаров.
	Если СтруктураВременныеТаблицы.ДвиженияЛизензииИзменение или  СтруктураВременныеТаблицы.ДвиженияРасчетыСПокупателямиИзменение
		Тогда
		         
		Запрос = Новый Запрос(
		//"ВЫБРАТЬ
		//|	ДвиженияЛизензииИзменение.НомерСтроки КАК НомерСтроки,
		//|	ДвиженияЛизензииИзменение.Организация КАК ОрганизацияПредставление,
		//|	ДвиженияЛизензииИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		//|	ДвиженияЛизензииИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		//|	ДвиженияЛизензииИзменение.СуммаИзменение КАК СуммаИзменение,
		//|	ЕСТЬNULL(ЛизензииОстатки.СебестоимостьОстаток, 0) КАК СуммаНепогашеннойЗадолженности,
		//|	ЕСТЬNULL(ЛизензииОстатки.СебестоимостьОстаток, 0) КАК СуммаОстаток,
		//|	ДвиженияЛизензииИзменение.Номенклатура КАК Номенклатура
		//|ИЗ
		//|	ДвиженияЛизензииИзменение КАК ДвиженияЛизензииИзменение
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лизензии.Остатки(&МоментКонтроля, ) КАК ЛизензииОстатки
		//|		ПО ДвиженияЛизензииИзменение.Номенклатура = ЛизензииОстатки.Номенклатура
		//|			И ДвиженияЛизензииИзменение.Организация = ЛизензииОстатки.Организация
		////|ГДЕ
		////|	ЕСТЬNULL(ЛизензииОстатки.СебестоимостьОстаток, 0) < 0
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	НомерСтроки
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ДвиженияРасчетыСПокупателямиИзменение.НомерСтроки КАК НомерСтроки,
		//|	ДвиженияРасчетыСПокупателямиИзменение.Организация КАК ОрганизацияПредставление,
		//|	ДвиженияРасчетыСПокупателямиИзменение.Контрагент КАК КонтрагентПредставление,
		//|	ДвиженияРасчетыСПокупателямиИзменение.Договор КАК ДоговорПредставление,
		//|	ДвиженияРасчетыСПокупателямиИзменение.Договор.ВалютаРасчетов КАК ВалютаПредставление,
		//|	ДвиженияРасчетыСПокупателямиИзменение.Документ КАК ДокументПредставление,
		//|	ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов КАК ТипРасчетовПредставление,
		//|	ДвиженияРасчетыСПокупателямиИзменение.Заказ КАК ЗаказПредставление,
		//|	ЛОЖЬ КАК ДвиженияДенежныхДокументов,
		//|	ДвиженияРасчетыСПокупателямиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		//|	ДвиженияРасчетыСПокупателямиИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		//|	ДвиженияРасчетыСПокупателямиИзменение.СуммаИзменение КАК СуммаИзменение,
		//|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		//|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		//|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
		//|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПриЗаписи - ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаПолученныхАвансов,
		//|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаНепогашеннойЗадолженности,
		//|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		//|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		//|	ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов КАК ТипРасчетов
		//|ИЗ
		//|	ДвиженияРасчетыСПокупателямиИзменение КАК ДвиженияРасчетыСПокупателямиИзменение
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПокупателями.Остатки(&МоментКонтроля, ) КАК РасчетыСПокупателямиОстатки
		//|		ПО ДвиженияРасчетыСПокупателямиИзменение.Организация = РасчетыСПокупателямиОстатки.Организация
		//|			И ДвиженияРасчетыСПокупателямиИзменение.Контрагент = РасчетыСПокупателямиОстатки.Контрагент
		//|			И ДвиженияРасчетыСПокупателямиИзменение.Договор = РасчетыСПокупателямиОстатки.Договор
		//|			И ДвиженияРасчетыСПокупателямиИзменение.Документ = РасчетыСПокупателямиОстатки.Документ
		//|			И ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов = РасчетыСПокупателямиОстатки.ТипРасчетов
		//|			И (ВЫБОР
		//|				КОГДА ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		//|					ТОГДА ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) > 0
		//|				ИНАЧЕ ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) < 0
		//|			КОНЕЦ)
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	НомерСтроки");    
		
		"ВЫБРАТЬ
		|	ДвиженияЛизензииИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияЛизензииИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияЛизензииИзменение.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ДвиженияЛизензииИзменение.СуммаИзменение, 0) + ЕСТЬNULL(ЛизензииОстатки.СебестоимостьОстаток, 0) КАК ОстатокЛицензии,
		|	ЕСТЬNULL(ЛизензииОстатки.СебестоимостьОстаток, 0) КАК СебестоимостьОстатокЛицензии
		|ИЗ
		|	ДвиженияЛизензииИзменение КАК ДвиженияЛизензииИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лицензии.Остатки(&МоментКонтроля, ) КАК ЛизензииОстатки
		|		ПО ДвиженияЛизензииИзменение.Организация = ЛизензииОстатки.Организация
		|			И ДвиженияЛизензииИзменение.Номенклатура = ЛизензииОстатки.Номенклатура
		|			И (ЕСТЬNULL(ЛизензииОстатки.СебестоимостьОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияРасчетыСПокупателямиИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияРасчетыСПокупателямиИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияРасчетыСПокупателямиИзменение.Контрагент КАК КонтрагентПредставление,
		|	ДвиженияРасчетыСПокупателямиИзменение.Договор КАК ДоговорПредставление,
		|	ДвиженияРасчетыСПокупателямиИзменение.Договор.ВалютаРасчетов КАК ВалютаПредставление,
		|	ДвиженияРасчетыСПокупателямиИзменение.Документ КАК ДокументПредставление,
		|	ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов КАК ТипРасчетовПредставление,
		|	ДвиженияРасчетыСПокупателямиИзменение.Заказ КАК ЗаказПредставление,
		|	ЛОЖЬ КАК ДвиженияДенежныхДокументов,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПриЗаписи - ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаПолученныхАвансов,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаНепогашеннойЗадолженности,
		|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов КАК ТипРасчетов
		|ИЗ
		|	ДвиженияРасчетыСПокупателямиИзменение КАК ДвиженияРасчетыСПокупателямиИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПокупателями.Остатки(&МоментКонтроля, ) КАК РасчетыСПокупателямиОстатки
		|		ПО ДвиженияРасчетыСПокупателямиИзменение.Организация = РасчетыСПокупателямиОстатки.Организация
		|			И ДвиженияРасчетыСПокупателямиИзменение.Контрагент = РасчетыСПокупателямиОстатки.Контрагент
		|			И ДвиженияРасчетыСПокупателямиИзменение.Договор = РасчетыСПокупателямиОстатки.Договор
		|			И ДвиженияРасчетыСПокупателямиИзменение.Документ = РасчетыСПокупателямиОстатки.Документ
		|			И ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов = РасчетыСПокупателямиОстатки.ТипРасчетов
		|			И (ВЫБОР
		|				КОГДА ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|					ТОГДА ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) > 0
		|				ИНАЧЕ ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) < 0
		|			КОНЕЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Если НЕ ПроверятьИтогиРегистров Тогда 
			Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		Иначе 
			Запрос.УстановитьПараметр("МоментКонтроля", Дата(2999,12,31));
		КонецЕсли;
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
				
		Если НЕ МассивРезультатов[0].Пустой()
			Тогда		
			ДокументОбъектЗакупкаЛицензии = ДокументСсылкаЗакупкаЛицензии.ПолучитьОбъект()
			
		КонецЕсли;
					
		// Отрицательный остаток по расчетам с Лизензии.
		Если НЕ МассивРезультатов[0].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[0].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЛизензии(ДокументОбъектЗакупкаЛицензии, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЛизензии(ДокументОбъектЗакупкаЛицензии, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;	
		
		// Отрицательный остаток по расчетам с покупателями.
		Если НЕ МассивРезультатов[1].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[1].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПокупателями(ДокументОбъектЗакупкаЛицензии, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПокупателями(ДокументОбъектЗакупкаЛицензии, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры 

