

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	
	// Инициализация данных документа.
	Документы.ПродажаЛицензии.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	УправлениеНебольшойФирмойСервер.ОтразитьПродажаЛицензий(ДополнительныеСвойства, Движения, Отказ);

	УправлениеНебольшойФирмойСервер.ОтразитьПродажи(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоНалогам(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ); 	
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Документы.ПродажаЛицензии.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);   // Контроль отклучен по желанию клиента 28.06.2023. lazare. 
	
	Если НЕ Отказ Тогда 
		Документы.ПродажаЛицензии.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ,,Истина);
	КонецЕсли

	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		//ПроверитьОтрицательныеОстатки(Отказ);        
	КонецЕсли;
	СуммаДокумента = Запасы.Итог("Всего");
	
КонецПроцедуры 
  
Процедура ПроверитьОтрицательныеОстатки(Отказ)
	
	Для Каждого Ст из Запасы Цикл 
		
		ТекстСообщения = Строка(Ст.Номенклатура) + НСтр("ru = '- Недостаточно остатка лицензии'; ka = '- არაა ლიცენზიის საკმარისი ნაშთი'");
		СебестоимостьОстаток = РегистрыНакопления.Лицензии.Остатки(Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Включая),Новый Структура("Номенклатура,Организация",Ст.Номенклатура,Организация));
		Если СебестоимостьОстаток.Количество() = 0 Тогда 	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);	
			Отказ = Истина;		
		КонецЕсли;	 
		
		Если Не Отказ Тогда  
			СебестоимостьОстаток = РегистрыНакопления.Лицензии.Остатки(Дата(2999,12,31),Новый Структура("Номенклатура,Организация",Ст.Номенклатура,Организация));
			Если СебестоимостьОстаток.Количество() = 0 Тогда 	
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);	
				Отказ = Истина;		
			КонецЕсли;   
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры  

#КонецОбласти
