
#Область ПрограммныйИнтерфейс

// მოწყობილობასთან დაკავშირება
// Функция представляет реализацию операции "Подключить".
//
// Параметры
//  Модель   - <СправочникСсылка.ТорговоеОборудование>
//           - Модель подключаемого торгового оборудования.
//
//  НомерЛУ  - <Число>
//           - Номер логического устройства.
//
//  Объект   - <НеизвестныйОбъект>
//           - Выходной параметр; созданный объект драйвера.
//
// Возвращаемое значение:
//  <Строка> – Описание произошедшей ошибки или пустая строка в случае успеха.
//
Функция ПодключитьУстройство(Объект, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	//КассаККМ = ПараметрыПодключения.КассаККМ;
	
	COMПорт = "";
	//COMПорт	= ?(Параметры.Порт = 0, "", "COM" + Параметры.Порт);
	TerminalID	= Параметры.TerminalID;
	TerminalAlias	= Параметры.TerminalAlias;
	ИспользоватьTranslinkДляТерминала	= Параметры.ИспользоватьTranslinkДляТерминала;
	
	мRequest = ВозвратмRequest();
	мМассив = ВозвратмМассив();

	Результат = ТестУстройства(Объект, TerminalID, COMПорт, мRequest, мМассив, TerminalAlias, ИспользоватьTranslinkДляТерминала);
	
	ВыходныеПараметры = Новый Массив;                                           
	млЭС = Новый Структура;    
	
	млЭС.Вставить("Объект", 	Объект);
	млЭС.Вставить("Модель", 	""); 
	млЭС.Вставить("НомерЛУ", 	1);
	//млЭС.Вставить("порт", 		Параметры.Порт);
	млЭС.Вставить("Скорость", 	Параметры.Скорость);
	//млЭС.Вставить("КассаККМ", 	КассаККМ);
	млЭС.Вставить("TerminalID", TerminalID);
	млЭС.Вставить("TerminalAlias", TerminalAlias);
	млЭС.Вставить("ИспользоватьTranslinkДляТерминала", ИспользоватьTranslinkДляТерминала);
	
	ВыходныеПараметры.Добавить("");
	ВыходныеПараметры.Добавить(Результат);
	ВыходныеПараметры.Добавить(мRequest);
	ВыходныеПараметры.Добавить(мМассив);
	ВыходныеПараметры.Добавить(млЭС);
	
	Если Результат = "" Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ОперацияПодключить()

Функция ТестУстройства(Объект,TerminalID, COMПортФР, мRequest, мМассив, TerminalAlias, ИспользоватьTranslinkДляТерминала)
	
	Ответ = "";
	мRequest.TerminalID = TerminalID;
	
	Если ИспользоватьTranslinkДляТерминала Тогда 
		мRequest.TerminalAlias = TerminalAlias;
	КонецЕсли;

	Если ЗначениеЗаполнено(COMПортФР) И ТипЗнч(COMПортФР) = Тип("Строка") Тогда 
		впCOMПортФР = Число(Прав(COMПортФР, СтрДлина(COMПортФР) - 3));
	ИначеЕсли ЗначениеЗаполнено(COMПортФР) И ТипЗнч(COMПортФР) = Тип("Число") Тогда 
		впCOMПортФР = COMПортФР;
	Иначе 
		впCOMПортФР = 0;
	КонецЕсли;
	
	мRequest.ComPort = впCOMПортФР;

	Результат = Объект.TestConnect(СтрокаДляТерминала(мRequest), Ответ);

	Если Не Результат Тогда          			
		мТипТранзакции = "Отказ";
		Возврат Ответ; 
	КонецЕсли;
		
	Возврат "";
	
	  
КонецФункции

// საერთო დანიშნულების პროცედურები და ფუნქციები
Функция Кодировка(Строка)
	
	СоответствиеКодировки = Новый Соответствие;
	
	СоответствиеКодировки.Вставить(Строка(Число("1084")),"ა");
	СоответствиеКодировки.Вставить(Строка(Число("1101")),"ბ");
	СоответствиеКодировки.Вставить(Строка(Число("1089")),"გ");
	СоответствиеКодировки.Вставить(Строка(Число("1087")),"დ");
	СоответствиеКодировки.Вставить(Строка(Число("1074")),"ე");
	СоответствиеКодировки.Вставить(Строка(Число("1100")),"ვ");
	СоответствиеКодировки.Вставить(Строка(Число("1095")),"ზ");
	СоответствиеКодировки.Вставить(Строка(Число("1078")),"თ");
	СоответствиеКодировки.Вставить(Строка(Число("1081")),"ი");
	СоответствиеКодировки.Вставить(Строка(Число("1093")),"კ");
	СоответствиеКодировки.Вставить(Строка(Число("1094")),"ლ");
	СоответствиеКодировки.Вставить(Строка(Число("1103")),"მ");
	СоответствиеКодировки.Вставить(Строка(Число("1102")),"ნ");
	СоответствиеКодировки.Вставить(Строка(Число("1082")),"ო");
	СоответствиеКодировки.Вставить(Строка(Число("1083")),"პ");
	//СоответствиеКодировки.Вставить(""","ჟ");
	СоответствиеКодировки.Вставить(Строка(Число("1076")),"რ");
	СоответствиеКодировки.Вставить(Строка(Число("1086")),"ს");
	СоответствиеКодировки.Вставить(Строка(Число("1077")),"ტ");
	СоответствиеКодировки.Вставить(Строка(Число("1080")),"უ");
	СоответствиеКодировки.Вставить(Строка(Число("1088")),"ფ");
	СоответствиеКодировки.Вставить(Строка(Число("1071")),"ქ");
	СоответствиеКодировки.Вставить(Строка(Число("1075")),"ღ");
	СоответствиеКодировки.Вставить(Строка(Число("1079")),"ყ");
	СоответствиеКодировки.Вставить(Строка(Число("1085")),"შ");
	СоответствиеКодировки.Вставить(Строка(Число("1098")),"ჩ");
	СоответствиеКодировки.Вставить(Строка(Число("1099")),"ც");
	//СоответствиеКодировки.Вставить("ძ""," ");
	СоответствиеКодировки.Вставить(Строка(Число("1073")),"წ");
	СоответствиеКодировки.Вставить(Строка(Число("1072")),"ჭ");
	СоответствиеКодировки.Вставить(Строка(Число("1097")),"ხ");
	СоответствиеКодировки.Вставить(Строка(Число("1092")),"ჯ");
	//СоответствиеКодировки.Вставить(""","ჰ");
	
	
	НаименованиеДляДисплПок = "";	
	
	Строка = СтрЗаменить( Строка,"\r\n",Символы.ПС);
	
	Для Счт = 1 По СтрДлина(Строка) Цикл
		РусСимвол = Сред(Строка, Счт, 1);
		
		Если КодСимвола(РусСимвол)>= 1040 И КодСимвола(РусСимвол) <= 1103  Тогда 
			Символ = СоответствиеКодировки[Строка(КодСимвола(РусСимвол))];
			Если Символ = "" Тогда 
				Символ = РусСимвол;
			КонецЕсли;
		Иначе                                            
			Символ = РусСимвол;
		КонецЕсли;
		
		НаименованиеДляДисплПок = НаименованиеДляДисплПок + Символ; 
		
	КонецЦикла;
	
	
	Возврат  НаименованиеДляДисплПок;
	
КонецФункции

Процедура СтрокаОтТерминала(СтрокаОтТерминала, мRequest, мМассив)
	
	П = 0;	
	
	СохрСтрока = СтрокаОтТерминала;
	
	Пока Найти(СтрокаОтТерминала,";") И П < мМассив.Количество() Цикл 
		Инд = Найти(СтрокаОтТерминала,";");
		мRequest[мМассив[П]] = Лев(СтрокаОтТерминала,Инд-1);
		СтрокаОтТерминала = Сред(СтрокаОтТерминала,Инд+1);
		П = П +1;
	КонецЦикла;
	
	Попытка      		
		
		МассивСтрок = СтрРазделить(СохрСтрока,Символы.ПС,Истина);
		
		Для Каждого СтрокаТекста Из МассивСтрок Цикл    				
			
			СтрФрагмент = ("ბარათი:  ");	
			ИндексФрагмента = Найти(СтрокаТекста,"ბარათი: ");	
			
			Если ИндексФрагмента > 0 Тогда  					
				
				МассивСтрокаТекста = СтрРазделить(СтрокаТекста," ");
				
				Если Не ЗначениеЗаполнено(мRequest.PAN)  Тогда  
					мRequest.PAN = МассивСтрокаТекста[МассивСтрокаТекста.Количество()-1];
				КонецЕсли;
			КонецЕсли;
			
			СтрФрагмент = ("ქვითარი:  ");	
			ИндексФрагмента = Найти(СтрокаТекста,"ქვითარი: ");	
			Если ИндексФрагмента > 0 Тогда  					
				
				МассивСтрокаТекста = СтрРазделить(СтрокаТекста," ");
				
				Если Не ЗначениеЗаполнено(мRequest.CheckNumber)  Тогда  
					мRequest.CheckNumber = МассивСтрокаТекста[МассивСтрокаТекста.Количество()-1];
				КонецЕсли;
			КонецЕсли;
			
			
		КонецЦикла;    		
		
		
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

Функция СтрокаДляТерминала(мRequest)
	
	впСтрокаДлаТерминала = "";
	
	Для Каждого Эл Из мRequest Цикл 
		впСтрокаДлаТерминала = впСтрокаДлаТерминала + Эл.Значение +";";
	КонецЦикла;
	
	//впСтрокаДлаТерминала = Лев(впСтрокаДлаТерминала,СтрДлина(впСтрокаДлаТерминала)-1);
	
	Возврат впСтрокаДлаТерминала;
		
КонецФункции

Функция ВозвратмRequest()
	
	// ძველი სქემა
	мRequest = Новый Структура();
	мRequest.Вставить("Amount","");
	мRequest.Вставить("AdditionalAmount","");
	мRequest.Вставить("CurrencyCode","");
	мRequest.Вставить("DateTimeHost","");
	мRequest.Вставить("CardEntryMode","");
	мRequest.Вставить("PINCodingMode","");
	мRequest.Вставить("PAN","");    
	мRequest.Вставить("CardExpiryDate","");
	мRequest.Вставить("TRACK2","");
	мRequest.Вставить("AuthorizationCode","");
	мRequest.Вставить("ReferenceNumber","");
	мRequest.Вставить("ResponseCodeHost","");
	мRequest.Вставить("PinBlock","");
	мRequest.Вставить("PinKey","");
	мRequest.Вставить("WorkKey","");
	мRequest.Вставить("TextResponse","");
	мRequest.Вставить("TerminalDateTime","");
	мRequest.Вставить("TrxID","");
	мRequest.Вставить("OperationCode","");
	мRequest.Вставить("TerminalTrxID","");
	мRequest.Вставить("TerminalID","");
	мRequest.Вставить("MerchantID","");
	мRequest.Вставить("DebitAmount","");
	мRequest.Вставить("DebitCount","");
	мRequest.Вставить("CreditAmount","");
	мRequest.Вставить("CreditCount","");
	мRequest.Вставить("OrigOperation","");
	мRequest.Вставить("MAC","");
	мRequest.Вставить("Status","");
	мRequest.Вставить("AdminTrack2","");
	мRequest.Вставить("AdminPinBlock","");
	мRequest.Вставить("AdminPAN","");
	мRequest.Вставить("AdminCardExpiryDate","");
	мRequest.Вставить("AdminCardEntryMode","");
	мRequest.Вставить("VoidDebitAmount","");
	мRequest.Вставить("VoidDebitCount","");
	мRequest.Вставить("VoidCreditAmount","");
	мRequest.Вставить("VoidCreditCount","");
	мRequest.Вставить("ProcessingFlag","");
	мRequest.Вставить("HostTrxID","");
	мRequest.Вставить("RecipientAddress","");
	мRequest.Вставить("DeviceSerNumber","");
	мRequest.Вставить("CommandMode","");
	мRequest.Вставить("CommandMode2","");
	мRequest.Вставить("CommandResult","");
	мRequest.Вставить("FileData","");
	мRequest.Вставить("CashierRequest","");
	мRequest.Вставить("CashierResponse","");
	мRequest.Вставить("AccountType","");
	мRequest.Вставить("CommodityCode","");
	мRequest.Вставить("PaymentDetails","");
	мRequest.Вставить("ProviderCode","");
	мRequest.Вставить("Acquirer","");
	мRequest.Вставить("AdditionalData","");
	мRequest.Вставить("ReceiptData","");
	мRequest.Вставить("ComPort","");
	мRequest.Вставить("OperatorID","");
	мRequest.Вставить("OperatorName","");
	мRequest.Вставить("InstallmentPayments","");
	мRequest.Вставить("InstallmentType","");
	мRequest.Вставить("Selected","");
	мRequest.Вставить("OperationID","");
	мRequest.Вставить("TerminalAlias","");
	мRequest.Вставить("CashbackAmount","");
	
	мRequest.Вставить("CheckNumber","");

	// ახალი სქემა
	
	//мRequest = Новый Структура();
	//мRequest.Вставить("Amount","");
	//мRequest.Вставить("AdditionalAmount","");
	//мRequest.Вставить("CurrencyCode","");
	//мRequest.Вставить("PAN","");
	//мRequest.Вставить("AuthorizationCode","");
	//мRequest.Вставить("ReferenceNumber","");
	//мRequest.Вставить("ResponseCodeHost","");
	//мRequest.Вставить("TextResponse","");
	//мRequest.Вставить("TerminalDateTime","");
	//мRequest.Вставить("OperationCode","");
	//мRequest.Вставить("TerminalID","");
	//мRequest.Вставить("ReceiptData","");
	//мRequest.Вставить("ComPort","");
	//мRequest.Вставить("OperatorID","");
	//мRequest.Вставить("OperatorName","");
	//мRequest.Вставить("InstallmentPayments","");
	//мRequest.Вставить("InstallmentType","");
	//мRequest.Вставить("Selected","");
	//мRequest.Вставить("OperationID","");
	//мRequest.Вставить("TerminalAlias","");
	//мRequest.Вставить("CashbackAmount","");
	////мRequest.Вставить("DateTimeHost","");
	////мRequest.Вставить("CardEntryMode","");
	////мRequest.Вставить("PINCodingMode","");
	////мRequest.Вставить("CardExpiryDate","");
	////мRequest.Вставить("TRACK2","");
	////мRequest.Вставить("PinBlock","");
	////мRequest.Вставить("PinKey","");
	////мRequest.Вставить("WorkKey","");
	////мRequest.Вставить("TrxID","");
	////мRequest.Вставить("TerminalTrxID","");
	////мRequest.Вставить("MerchantID","");
	////мRequest.Вставить("DebitAmount","");
	////мRequest.Вставить("DebitCount","");
	////мRequest.Вставить("CreditAmount","");
	////мRequest.Вставить("CreditCount","");
	////мRequest.Вставить("OrigOperation","");
	////мRequest.Вставить("MAC","");
	////мRequest.Вставить("Status","");
	////мRequest.Вставить("AdminTrack2","");
	////мRequest.Вставить("AdminPinBlock","");
	////мRequest.Вставить("AdminPAN","");
	////мRequest.Вставить("AdminCardExpiryDate","");
	////мRequest.Вставить("AdminCardEntryMode","");
	////мRequest.Вставить("VoidDebitAmount","");
	////мRequest.Вставить("VoidDebitCount","");
	////мRequest.Вставить("VoidCreditAmount","");
	////мRequest.Вставить("VoidCreditCount","");
	////мRequest.Вставить("ProcessingFlag","");
	////мRequest.Вставить("HostTrxID","");
	////мRequest.Вставить("RecipientAddress","");
	////мRequest.Вставить("DeviceSerNumber","");
	////мRequest.Вставить("CommandMode","");
	////мRequest.Вставить("CommandMode2","");
	////мRequest.Вставить("CommandResult","");
	////мRequest.Вставить("FileData","");
	////мRequest.Вставить("CashierRequest","");
	////мRequest.Вставить("CashierResponse","");
	////мRequest.Вставить("AccountType","");
	////мRequest.Вставить("CommodityCode","");
	////мRequest.Вставить("PaymentDetails","");
	////мRequest.Вставить("ProviderCode","");
	////мRequest.Вставить("Acquirer","");
	////мRequest.Вставить("AdditionalData","");
	
	Возврат мRequest;
	
КонецФункции

Функция ВозвратмМассив()
	
	// ძველი სქემა
	мМассив = Новый Массив;
	
	мМассив.Добавить("Amount");
	мМассив.Добавить("AdditionalAmount");
	мМассив.Добавить("CurrencyCode");
	мМассив.Добавить("DateTimeHost");
	мМассив.Добавить("CardEntryMode");
	мМассив.Добавить("PINCodingMode");
	мМассив.Добавить("PAN");
	
	мМассив.Добавить("CardExpiryDate");
	мМассив.Добавить("TRACK2");
	мМассив.Добавить("AuthorizationCode");
	мМассив.Добавить("ReferenceNumber");
	мМассив.Добавить("ResponseCodeHost");
	мМассив.Добавить("PinBlock");
	мМассив.Добавить("PinKey");
	мМассив.Добавить("WorkKey");
	мМассив.Добавить("TextResponse");
	мМассив.Добавить("TerminalDateTime");
	мМассив.Добавить("TrxID");
	мМассив.Добавить("OperationCode");
	мМассив.Добавить("TerminalTrxID");
	мМассив.Добавить("TerminalID");
	мМассив.Добавить("MerchantID");
	мМассив.Добавить("DebitAmount");
	мМассив.Добавить("DebitCount");
	мМассив.Добавить("CreditAmount");
	мМассив.Добавить("CreditCount");
	мМассив.Добавить("OrigOperation");
	мМассив.Добавить("MAC");
	мМассив.Добавить("Status");
	мМассив.Добавить("AdminTrack2");
	мМассив.Добавить("AdminPinBlock");
	мМассив.Добавить("AdminPAN");
	мМассив.Добавить("AdminCardExpiryDate");
	мМассив.Добавить("AdminCardEntryMode");
	мМассив.Добавить("VoidDebitAmount");
	мМассив.Добавить("VoidDebitCount");
	мМассив.Добавить("VoidCreditAmount");
	мМассив.Добавить("VoidCreditCount");
	мМассив.Добавить("ProcessingFlag");
	мМассив.Добавить("HostTrxID");
	мМассив.Добавить("RecipientAddress");
	мМассив.Добавить("DeviceSerNumber");
	мМассив.Добавить("CommandMode");
	мМассив.Добавить("CommandMode2");
	мМассив.Добавить("CommandResult");
	мМассив.Добавить("FileData");
	мМассив.Добавить("CashierRequest");
	мМассив.Добавить("CashierResponse");
	мМассив.Добавить("AccountType");
	мМассив.Добавить("CommodityCode");
	мМассив.Добавить("PaymentDetails");
	мМассив.Добавить("ProviderCode");
	мМассив.Добавить("Acquirer");
	мМассив.Добавить("AdditionalData");
	мМассив.Добавить("ReceiptData");
	мМассив.Добавить("ComPort");
	мМассив.Добавить("OperatorID");
	мМассив.Добавить("OperatorName");
	мМассив.Добавить("InstallmentPayments");
	мМассив.Добавить("InstallmentType");
	мМассив.Добавить("Selected");
	мМассив.Добавить("OperationID");
	мМассив.Добавить("TerminalAlias");
	мМассив.Добавить("CashbackAmount");
	
	мМассив.Добавить("CheckNumber");

	// ახალი სქემა
	//мМассив = Новый Массив;
	//
	//мМассив.Добавить("Amount");
	//мМассив.Добавить("AdditionalAmount");
	//мМассив.Добавить("CurrencyCode");
	//мМассив.Добавить("PAN");
	//мМассив.Добавить("AuthorizationCode");
	//мМассив.Добавить("ReferenceNumber");
	//мМассив.Добавить("ResponseCodeHost");
	//мМассив.Добавить("TextResponse");
	//мМассив.Добавить("TerminalDateTime");
	//мМассив.Добавить("OperationCode");
	//мМассив.Добавить("TerminalID");
	//мМассив.Добавить("ReceiptData");
	//мМассив.Добавить("ComPort");
	//мМассив.Добавить("OperatorID");
	//мМассив.Добавить("OperatorName");
	//мМассив.Добавить("InstallmentPayments");
	//мМассив.Добавить("InstallmentType");
	//мМассив.Добавить("Selected");
	//мМассив.Добавить("OperationID");
	//мМассив.Добавить("TerminalAlias");
	//мМассив.Добавить("CashbackAmount");
	////мМассив.Добавить("DateTimeHost");
	////мМассив.Добавить("CardEntryMode");
	////мМассив.Добавить("PINCodingMode");
	////мМассив.Добавить("CardExpiryDate");
	////мМассив.Добавить("TRACK2");
	////мМассив.Добавить("PinBlock");
	////мМассив.Добавить("PinKey");
	////мМассив.Добавить("WorkKey");
	////мМассив.Добавить("TrxID");
	////мМассив.Добавить("TerminalTrxID");
	////мМассив.Добавить("MerchantID");
	////мМассив.Добавить("DebitAmount");
	////мМассив.Добавить("DebitCount");
	////мМассив.Добавить("CreditAmount");
	////мМассив.Добавить("CreditCount");
	////мМассив.Добавить("OrigOperation");
	////мМассив.Добавить("MAC");
	////мМассив.Добавить("Status");
	////мМассив.Добавить("AdminTrack2");
	////мМассив.Добавить("AdminPinBlock");
	////мМассив.Добавить("AdminPAN");
	////мМассив.Добавить("AdminCardExpiryDate");
	////мМассив.Добавить("AdminCardEntryMode");
	////мМассив.Добавить("VoidDebitAmount");
	////мМассив.Добавить("VoidDebitCount");
	////мМассив.Добавить("VoidCreditAmount");
	////мМассив.Добавить("VoidCreditCount");
	////мМассив.Добавить("ProcessingFlag");
	////мМассив.Добавить("HostTrxID");
	////мМассив.Добавить("RecipientAddress");
	////мМассив.Добавить("DeviceSerNumber");
	////мМассив.Добавить("CommandMode");
	////мМассив.Добавить("CommandMode2");
	////мМассив.Добавить("CommandResult");
	////мМассив.Добавить("FileData");
	////мМассив.Добавить("CashierRequest");
	////мМассив.Добавить("CashierResponse");
	////мМассив.Добавить("AccountType");
	////мМассив.Добавить("CommodityCode");
	////мМассив.Добавить("PaymentDetails");
	////мМассив.Добавить("ProviderCode");
	////мМассив.Добавить("Acquirer");
	////мМассив.Добавить("AdditionalData");

	Возврат мМассив;
	
КонецФункции

Функция ПечатьКвитанцийНаТерминале(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	ВыходныеПараметры.Очистить();  
	ВыходныеПараметры.Добавить(Ложь);
	Возврат Результат;
	
КонецФункции


// ფუნქცია ბრძანების დასახელების მიხედვით გადასცემს მოწყობილობას შესაბამის ბრძანებას
// Функция получает, обрабатывает и перенаправляет на исполнение команду к драйверу
//
Функция ВыполнитьКоманду(Команда, ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено, ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт
	
	Результат = Истина;
	ВыходныеПараметры = Новый Массив;
	Попытка
		Идентификатор = Параметры.Идентификатор;	
	Исключение
		Идентификатор = Неопределено;
	КонецПопытки;
	
	Если Команда = "КопияЧека" Тогда 
		ПоследныйЧек = ВходныеПараметры.ПоследныйЧек;
	ИначеЕсли ВходныеПараметры <> Неопределено И ВходныеПараметры.Количество() > 0 Тогда 
		впСумма = ВходныеПараметры[0];
	Иначе 
		впСумма = 0;
	КонецЕсли;
	
	Если ВходныеПараметры <> Неопределено И ВходныеПараметры.Количество() > 1 Тогда 
		МетодОплаты = ВходныеПараметры[1];
	Иначе 
		//МетодОплаты = ПредопределенноеЗначение("Перечисление.МетодыОплаты.Банк");
	КонецЕсли;
	
	Если ВходныеПараметры <> Неопределено И ВходныеПараметры.Количество() > 2 Тогда 
		ПериодРасрочки = ВходныеПараметры[2];
	Иначе 
		ПериодРасрочки = 0;
	КонецЕсли;
	
	Если ВходныеПараметры <> Неопределено И ВходныеПараметры.Количество() > 3 Тогда 
		СуммаДляВозврата = ВходныеПараметры[3];
	Иначе 
		СуммаДляВозврата = 0;
	КонецЕсли;
	
	Если ВходныеПараметры <> Неопределено И ВходныеПараметры.Количество() > 4 Тогда 
		НомерСсылкы = ВходныеПараметры[4];
	Иначе 
		НомерСсылкы = "";
	КонецЕсли;
	
	Если ВходныеПараметры <> Неопределено И ВходныеПараметры.Количество() > 5 Тогда 
		КодАвторизации 			= ВходныеПараметры[5];
	Иначе 
		КодАвторизации = "";
	КонецЕсли;
	
	Если ВходныеПараметры <> Неопределено И ВходныеПараметры.Количество() > 6 Тогда 
		ВидОплатыДляВозврата 	= ВходныеПараметры[6];
	Иначе 
		ВидОплатыДляВозврата 	= "";
	КонецЕсли;
	
	Если ВходныеПараметры <> Неопределено И ВходныеПараметры.Количество() > 7 Тогда 
		КодОперацииЭС 	= ВходныеПараметры[7];
	Иначе 
		КодОперацииЭС 	= "";
	КонецЕсли;
	
	Если ВходныеПараметры <> Неопределено И ВходныеПараметры.Количество() > 8 Тогда 
		 CashbackAmount	= ВходныеПараметры[8];
	Иначе 
		 CashbackAmount	= 0;
	КонецЕсли;

	ВходныеПараметры = ВозвратВходныеПараметры(Идентификатор, впСумма, МетодОплаты, ПериодРасрочки, СуммаДляВозврата, НомерСсылкы, КодАвторизации, ВидОплатыДляВозврата, КодОперацииЭС, CashbackAmount);
	
	Если Команда = "PrintSlipOnTerminal" Тогда
		Результат = ПечатьКвитанцийНаТерминале(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
		
	ИначеЕсли Команда = "ПолучитьВерсиюДрайвера" Тогда
		
		Результат = ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "AuthorizeSales" Тогда
		
		Результат = AuthorizeSales(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "AuthorizeRefund" Тогда
		
		Результат = AuthorizeRefund(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "AuthorizeVoid" Тогда
		
		Результат = AuthorizeVoid(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "КраткийОтчет"  Тогда
		
		Результат = КраткийОтчет(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "ПолныйОтчет" Тогда
		
		Результат = ПолныйОтчет(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "КопияЧека" Тогда
		
		Результат = КопияЧека(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры, ПоследныйЧек);
		
	ИначеЕсли Команда = "ПроверкаСоеденений" Тогда
		
		Результат = ПроверкаСоеденений(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "ИтогиДняПоКартам" Или Команда = "Settlement" Тогда
		
		Результат = ИтогиДняПоКартам(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// ფუნქცია აბრუნებს მოწყობილობის დრიავერის ვერსიას
// Функция возвращает версию установленного драйвера
//
Функция ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;

	ВыходныеПараметры.Добавить(НСтр("ka='დაყენებულია';ru='Установлен'"));
	ВыходныеПараметры.Добавить(НСтр("ka='არ არის განსაზღვრული';ru='Не определена'"));

	Попытка
		Версия = ОбъектДрайвера.ПолучитьНомерВерсии();
		ВыходныеПараметры[1] = Версия;
		// Дополнительные параметры
		ВыходныеПараметры.Добавить(ПолучитьВерсиюВнешнейКомпоненты());
		ВыходныеПараметры.Добавить(ВерсияСтрокаВЧисло(Версия));
		ВыходныеПараметры.Добавить(ВерсияСтрокаВЧисло(ПолучитьВерсиюВнешнейКомпоненты()));
	Исключение
		ВыходныеПараметры[1] = ПолучитьВерсиюВнешнейКомпоненты();
		
	КонецПопытки;

	Возврат Результат;

КонецФункции

// მოწყობილობასთან კავშირის გაწყვეტა
// Функция осуществляет отключение устройства.
//
// Параметры:
//  ОбъектДрайвера - <*>
//         - ОбъектДрайвера драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт

	Результат = Ложь;

	// Обязательные выходные
	ВыходныеПараметры = Новый Массив();

	Попытка
		ОтключитьсяОтФР(ОбъектДрайвера, 0);
		Результат = Истина;
	Исключение
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		Результат = Ложь;
	КонецПопытки;	

	Возврат Результат;

КонецФункции

// ფისკალურთან კავშირის შეწყვეტა
//
// პარამეტრები:
//  Объект       - объект подключенного торгового оборудования
//  НомерЛУ      - номер логического устройства с которым связан объект
//
//
Процедура ОтключитьсяОтФР(Объект, НомерЛУ = 0)

	// Принудительное закрытие сеанса обмена, если он был открыт
	Объект.Disconnect();
	
КонецПроцедуры

Функция AuthorizeSales(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	мТипТранзакции = "Оплата";
	
    TerminalID = Параметры.TerminalID;
    TerminalAlias = Параметры.TerminalAlias;
    ИспользоватьTranslinkДляТерминала = Параметры.ИспользоватьTranslinkДляТерминала;
	Сумма = ВходныеПараметры.Сумма;
	КодОперации = Неопределено;
	КодRRN = Неопределено;
	КодАвторизации = ВходныеПараметры.КодАвторизации;
	//COMПортФР = Параметры.Порт;
	COMПортФР = "";
	СписокСтрокСлипЧека = Новый Структура;
	МетодОплаты = ВходныеПараметры.МетодОплаты;
	мRequest = ВходныеПараметры.мRequest;
	мRequest.TerminalID = TerminalID;  
	
	Если ИспользоватьTranslinkДляТерминала Тогда 
		мRequest.TerminalAlias = TerminalAlias;  
	КонецЕсли;

	мМассив = ВходныеПараметры.мМассив;
	ПериодРасрочки = ВходныеПараметры.ПериодРасрочки;
	CashbackAmount = ВходныеПараметры.CashbackAmount;
	
	СуммаВременная = Неопределено;
	
	КодКарты       = Неопределено;
	СсылочныйНомер = Неопределено;
	НомерЧека      = Неопределено;
	СлипЧек = Неопределено;
	
	Ответ = "";
	Результат = ОплатитьПлатежнойКартой(ОбъектДрайвера, TerminalID, СтрЗаменить(Формат(Сумма + CashbackAmount,"ЧДЦ=2; ЧРД=,; ЧГ="),",",""), КодRRN, КодАвторизации,  СписокСтрокСлипЧека, КодОперации, COMПортФР, МетодОплаты, мRequest, мМассив, ПериодРасрочки, TerminalAlias, СтрЗаменить(Формат(CashbackAmount,"ЧДЦ=2; ЧРД=,; ЧН=0; ЧГ="),",",""), ИспользоватьTranslinkДляТерминала,Ответ);
	
	Если Результат Тогда
		
		СсылочныйНомер = СписокСтрокСлипЧека.НомерСсылкы;
		КодАвторизации = СписокСтрокСлипЧека.КодАвторизации;
		
		//ВыходныеПараметры.Добавить("****************");
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.НомерКарты);
		ВыходныеПараметры.Добавить(СсылочныйНомер);
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.ИдентификаторОперацииНаТерминале);
		ВыходныеПараметры.Добавить(Новый Массив());
		ВыходныеПараметры[3].Добавить("СлипЧек");
		ВыходныеПараметры[3].Добавить(СписокСтрокСлипЧека.СлипОтХоста);
		ВыходныеПараметры.Добавить(КодАвторизации);
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
	Иначе
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.НомерКарты);
		ВыходныеПараметры.Добавить(Ответ);
		
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.ИдентификаторОперацииНаТерминале);
		ВыходныеПараметры.Добавить(Новый Массив());
		ВыходныеПараметры[3].Добавить("СлипЧек");
		ВыходныеПараметры[3].Добавить(СписокСтрокСлипЧека.СлипОтХоста);
		ВыходныеПараметры.Добавить(КодАвторизации);
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
		
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция AuthorizeRefund(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	мТипТранзакции = "Оплата";
	
    TerminalID = Параметры.TerminalID;
	TerminalAlias = Параметры.TerminalAlias;
	ИспользоватьTranslinkДляТерминала = Параметры.ИспользоватьTranslinkДляТерминала;
	
	Сумма = ВходныеПараметры.Сумма;
	СуммаДляВозврата = ВходныеПараметры.СуммаДляВозврата;  
	НомерСсылкы = ВходныеПараметры.НомерСсылкы;  
	ВидОплатыДляВозврата = ВходныеПараметры.ВидОплатыДляВозврата;  
	КодОперации = Неопределено;
	КодRRN = Неопределено;
	КодАвторизации = ВходныеПараметры.КодАвторизации;
	//COMПортФР = Параметры.Порт;
	COMПортФР = "";
	СписокСтрокСлипЧека = Новый Структура;
	МетодОплаты = ВходныеПараметры.МетодОплаты;
	мRequest = ВходныеПараметры.мRequest;
	мМассив = ВходныеПараметры.мМассив;
	
	СуммаВременная = Неопределено;
	
	КодКарты       = Неопределено;
	СсылочныйНомер = Неопределено;
	НомерЧека      = Неопределено;
	СлипЧек = Неопределено;
		
	Результат = ОтменитьПлатежаПоПлатежнойКарте(ОбъектДрайвера, TerminalID, СтрЗаменить(Формат(Сумма,"ЧДЦ=2; ЧРД=,; ЧГ="),",",""), СтрЗаменить(Формат(СуммаДляВозврата,"ЧДЦ=2; ЧРД=,; ЧГ="),",",""), КодRRN, КодАвторизации,  СписокСтрокСлипЧека, КодОперации, COMПортФР, МетодОплаты, мRequest, мМассив, НомерСсылкы, ВидОплатыДляВозврата, TerminalAlias, ИспользоватьTranslinkДляТерминала);
			
	Если Результат Тогда
		
		СсылочныйНомер = СписокСтрокСлипЧека.НомерСсылкы;
		КодАвторизации = СписокСтрокСлипЧека.КодАвторизации;
		
		ВыходныеПараметры.Добавить("****************");
		ВыходныеПараметры.Добавить(СсылочныйНомер);
		ВыходныеПараметры.Добавить(НомерЧека);
		ВыходныеПараметры.Добавить(Новый Массив());
		ВыходныеПараметры[3].Добавить("СлипЧек");
		ВыходныеПараметры[3].Добавить(СлипЧек);
		ВыходныеПараметры.Добавить(КодАвторизации);
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
		
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция AuthorizeVoid(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)

    TerminalID = Параметры.TerminalID;
    TerminalAlias = Параметры.TerminalAlias;
    ИспользоватьTranslinkДляТерминала = Параметры.ИспользоватьTranslinkДляТерминала;
	
	КодОперацииЭС = ВходныеПараметры.КодОперацииЭС;  
	КодОперации = Неопределено;
	КодRRN = Неопределено;
	КодАвторизации = ВходныеПараметры.КодАвторизации;
	СписокСтрокСлипЧека = Новый Структура;
	мRequest = ВходныеПараметры.мRequest;
	мМассив = ВходныеПараметры.мМассив;
	
	КодКарты       = Неопределено;
	СсылочныйНомер = Неопределено;
	НомерЧека      = Неопределено;
	СлипЧек        = Неопределено;
		
	Результат = УдалитьПлатежаПоПлатежнойКарте(ОбъектДрайвера, СписокСтрокСлипЧека, TerminalID, КодОперацииЭС, мRequest, мМассив, TerminalAlias, ИспользоватьTranslinkДляТерминала);
			
	Если Результат Тогда
		
		СсылочныйНомер = СписокСтрокСлипЧека.НомерСсылкы;
		КодАвторизации = СписокСтрокСлипЧека.КодАвторизации;
		
		ВыходныеПараметры.Добавить("****************");
		ВыходныеПараметры.Добавить(СсылочныйНомер);
		ВыходныеПараметры.Добавить(НомерЧека);
		ВыходныеПараметры.Добавить(Новый Массив());
		ВыходныеПараметры[3].Добавить("СлипЧек");
		ВыходныеПараметры[3].Добавить(СлипЧек);
		ВыходныеПараметры.Добавить(КодАвторизации);
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
		
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция КраткийОтчет(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Ответ = "";
	СписокСтрокСлипЧека = Новый Структура;
	
	//COMПортФР = Параметры.Порт;
	COMПортФР = "";
	
	мRequest = ВходныеПараметры.мRequest;
	мМассив = ВходныеПараметры.мМассив;
		
	впCOMПортФР = ?(ЗначениеЗаполнено(COMПортФР), COMПортФР, 0);
	
	мRequest.ComPort = впCOMПортФР;
		
	Ответ = "";
	мRequest.OperatorID = "";
	мRequest.OperatorName = ""; 
	
	Если Параметры.ИспользоватьTranslinkДляТерминала Тогда 
		мRequest.TerminalAlias = Параметры.TerminalAlias; 
	КонецЕсли;
	
	Результат = ОбъектДрайвера.PrintTotals(СтрокаДляТерминала(мRequest), Ответ);
	
	
	Если НЕ Результат Тогда          			
		
		мТипТранзакции = "Отказ";
		
		Попытка
			СтрокаОтТерминала(Ответ, мRequest, мМассив);
			ПолучитьСтрокиСлипЧека(ОбъектДрайвера, СписокСтрокСлипЧека, "გადახდა", мRequest);
			Ответ = Кодировка(мRequest.TextResponse);
		Исключение
		КонецПопытки;
		
		//Возврат "შეცდომა ("+ Ответ +").";		
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
		ВыходныеПараметры.Добавить(Ответ);

		
		Возврат Ложь;
	Иначе 
		СтрокаОтТерминала(Ответ, мRequest, мМассив);
		ПолучитьСтрокиСлипЧека(ОбъектДрайвера, СписокСтрокСлипЧека, "დაბრუნება", мRequest);
	КонецЕсли;
		
	ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);

	Возврат Истина;

КонецФункции

Функция ПолныйОтчет(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)
		
	Возврат Истина;  

КонецФункции

Функция КопияЧека(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры, ПоследныйЧек)
		
	Возврат Истина; 

КонецФункции

Функция ПроверкаСоеденений(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Ответ = "";
	СписокСтрокСлипЧека = Новый Структура;
	
	//COMПортФР = Параметры.Порт;
	COMПортФР = "";
	
	мRequest = ВходныеПараметры.мRequest;
	мМассив = ВходныеПараметры.мМассив;
	
	впCOMПортФР = ?(ЗначениеЗаполнено(COMПортФР), COMПортФР, 0);
	
	мRequest.ComPort = впCOMПортФР;
	
	TerminalID	= Параметры.TerminalID;
	TerminalAlias	= Параметры.TerminalAlias;
	ИспользоватьTranslinkДляТерминала	= Параметры.ИспользоватьTranslinkДляТерминала;

	Результат = ТестУстройства(ОбъектДрайвера, TerminalID, впCOMПортФР, мRequest, мМассив, TerminalAlias, ИспользоватьTranslinkДляТерминала);
	
	ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
	
	Возврат Истина;

КонецФункции

Функция ИтогиДняПоКартам(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Ответ = "";
	СписокСтрокСлипЧека = Новый Структура;
	
	//COMПортФР = Параметры.Порт;
	
	//мRequest = ВходныеПараметры.мRequest;
	//мМассив = ВходныеПараметры.мМассив;
	мRequest = ВозвратмRequest();
	мМассив = ВозвратмМассив();
	
	//мRequest.TerminalID = Параметры.TerminalID;
	//впCOMПортФР = ?(ЗначениеЗаполнено(COMПортФР), COMПортФР, 0);
	//мRequest.ComPort = впCOMПортФР;
	
	Ответ = "";
	мRequest.OperatorID = "";
	мRequest.OperatorName = ""; 
	
	Если Параметры.ИспользоватьTranslinkДляТерминала Тогда 
		мRequest.TerminalAlias = Параметры.TerminalAlias;
	КонецЕсли;
	
	Результат = ОбъектДрайвера.CloseDay(СтрокаДляТерминала(мRequest), Ответ);
	
	Если НЕ Результат Тогда          			
		
		мТипТранзакции = "Отказ";
		
		Попытка
			СтрокаОтТерминала(Ответ, мRequest, мМассив);
			ПолучитьСтрокиСлипЧека(ОбъектДрайвера, СписокСтрокСлипЧека, "გადახდა", мRequest);
			Ответ = Кодировка(мRequest.TextResponse);
		Исключение
		КонецПопытки;
		
		//Возврат "შეცდომა ("+ Ответ +").";		
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
		ВыходныеПараметры.Добавить(Ответ);
		
		//Возврат "შეცდომა ("+ Ответ +").";		
		Возврат Ложь;
	Иначе 
		СтрокаОтТерминала(Ответ, мRequest, мМассив);
		ПолучитьСтрокиСлипЧека(ОбъектДрайвера, СписокСтрокСлипЧека, "დაბრუნება", мRequest);
	КонецЕсли;
	
	ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
	
	Возврат Истина;

КонецФункции

// ფუნქცია აბრუნებს მოწყობილობის დრაივერის ვერსიის მნიშვნელობას მინიშნების გარეშე
// Возвращает версию компоненты расположенной в макете.
//
Функция ПолучитьВерсиюВнешнейКомпоненты() 
	
	Возврат "1.0.0.1";
	
КонецФункции

// ფუნქცია გარდაქმნის ვერსიის სტრიქონულ მნიშვნელობას რიცხვით მნიშვნელობად
// Функция преобразует строковое представление версии (с тремя точками) к числовому (пригодному для сравнения)
Функция ВерсияСтрокаВЧисло(ВерсияСтрока) 
	
	Попытка
		Версия = ВерсияСтрока;
		Результат = Число(Лев(Версия, Найти(Версия, ".")-1));
		Версия = Сред(Версия, Найти(Версия, ".") + 1);
		Результат = Результат*100 + Число(Лев(Версия, Найти(Версия, ".")-1));
		Версия = Сред(Версия, Найти(Версия, ".") + 1);
		Результат = Результат*100 + Число(Лев(Версия, Найти(Версия, ".")-1));
		Версия = Сред(Версия, Найти(Версия, ".") + 1);
		Результат = Результат*100 + Число(Версия);
	Исключение
		Возврат 0;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ОплатитьПлатежнойКартой(Объект, TerminalID, Сумма, КодRRN, КодАвторизации,  СписокСтрокСлипЧека,КодОперации, COMПортФР, МетодОплаты = Неопределено, мRequest, мМассив, ПериодРасрочки = Неопределено, TerminalAlias, CashbackAmount, ИспользоватьTranslinkДляТерминала,Ответ) 
 
	Ответ = "";
	мRequest.OperatorID = "";
	//мRequest.ComPort = COMПортФР; 
	мRequest.OperatorName = ""; 
	мRequest.Amount = СтрЗаменить(Формат(Сумма,"ЧГ=0"),",","");
	мRequest.CurrencyCode = "981"; 
	мRequest.InstallmentPayments = ПериодРасрочки; 
	мRequest.InstallmentType = ""; 	
	впSelected = Неопределено;
	//мRequest.TerminalID = "";               	       	

	Результат = Объект.NewBonusTender(СтрокаДляТерминала(мRequest), Ответ);  	
	
	Если Результат И Сред(Ответ, 1, Найти(Ответ,";")-1) = "Select currency" Тогда 
		впМассив = ПолучитьВалютыДляВыбор(Ответ);
		впФорма = ПолучитьФорму("ОбщаяФорма.ФормаСписокОплат_AXConnect");
		
		Для Каждого Строка Из впМассив Цикл 
			НовСтрока = впФорма.ЭквайринговыхТерминалов.Добавить();	
			НовСтрока.ВидОплаты = Строка; 	
		КонецЦикла;
		
		Если МетодОплаты = ПредопределенноеЗначение("Перечисление.МетодыОплаты.РасрочкаТерминала") Тогда 
			впSelected = впМассив[0];
		Иначе 
			впSelected = впФорма.ОткрытьМодально();
		КонецЕсли;
	
		мRequest.Selected = впSelected;
		Результат = Объект.Selected(СтрокаДляТерминала(мRequest), Ответ);
		
		Если впSelected = Неопределено Тогда 
			//Возврат "გადახდა შეწყვეტილია.";
			Возврат Ложь;
		КонецЕсли;

	КонецЕсли;	
	
	Если НЕ Результат Тогда          			
		
		мТипТранзакции = "Отказ";
		
		Попытка
			СтрокаОтТерминала(Ответ, мRequest, мМассив);
			ПолучитьСтрокиСлипЧека(Объект, СписокСтрокСлипЧека, "გადახდა", мRequest, впSelected);
			Ответ = Кодировка(мRequest.TextResponse);
		Исключение
		КонецПопытки;
	
		//Возврат "შეცდომა ("+ Ответ +").";		
		Возврат Ложь;
	Иначе 
		СтрокаОтТерминала(Ответ, мRequest, мМассив);
		ПолучитьСтрокиСлипЧека(Объект, СписокСтрокСлипЧека, "გადახდა", мRequest, впSelected);
	КонецЕсли;
	
	

	Возврат Истина;

КонецФункции

Функция ОтменитьПлатежаПоПлатежнойКарте(Объект, TerminalID, Сумма, СуммаДляВозврата, КодRRN, КодАвторизации,  СписокСтрокСлипЧека,КодОперации, COMПортФР, МетодОплаты = Неопределено, мRequest, мМассив, НомерСсылкы = "", ВидОплатыДляВозврата, TerminalAlias, ИспользоватьTranslinkДляТерминала) 
 
	Ответ = "";
	
	мRequest.OperatorID = "";
	мRequest.OperatorName = ""; 
	мRequest.Amount = СтрЗаменить(Формат(Сумма,"ЧГ=0"),",","");
	мRequest.CurrencyCode = "981";
	мRequest.AdditionalAmount = СтрЗаменить(Формат(СуммаДляВозврата,"ЧГ=0"),",","");
	мRequest.ReferenceNumber = НомерСсылкы;
	впCOMПортФР = ?(ЗначениеЗаполнено(COMПортФР), COMПортФР, 0);
	мRequest.ComPort = впCOMПортФР;	
	мRequest.InstallmentPayments = 0; 
	мRequest.InstallmentType = "CREDIT"; 
	
	Если ИспользоватьTranslinkДляТерминала Тогда 
		мRequest.TerminalAlias = TerminalAlias;	
	КонецЕсли;

	впSelected = Неопределено;	
	
	//мRequest.OperationCode = "4";	
	
	Если МетодОплаты = ПредопределенноеЗначение("Перечисление.МетодыОплаты.ОплатаБаламиТерминалаMR") Тогда 
		мRequest.CurrencyCode = "102"; 
		Результат = Объект.NewCreditTenderWithCurrency(СтрокаДляТерминала(мRequest), Ответ);
	ИначеЕсли МетодОплаты = ПредопределенноеЗначение("Перечисление.МетодыОплаты.ОплатаБаламиТерминалаExpress") Тогда 
		мRequest.CurrencyCode = "EXP"; 
		Результат = Объект.NewCreditTenderWithCurrency(СтрокаДляТерминала(мRequest), Ответ);
	ИначеЕсли МетодОплаты = ПредопределенноеЗначение("Перечисление.МетодыОплаты.ОплатаБаламиТерминалаPlus") Тогда 
		мRequest.CurrencyCode = "PLS"; 
		Результат = Объект.NewCreditTenderWithCurrency(СтрокаДляТерминала(мRequest), Ответ);
	ИначеЕсли МетодОплаты = ПредопределенноеЗначение("Перечисление.МетодыОплаты.ОплатаБаламиТерминалаScool") Тогда 
		мRequest.CurrencyCode = "SCL"; 
		Результат = Объект.NewCreditTenderWithCurrency(СтрокаДляТерминала(мRequest), Ответ);
	Иначе
		Результат = Объект.NewCreditTenderWithCurrency(СтрокаДляТерминала(мRequest), Ответ);
	КонецЕсли;
	
	Если Результат И Сред(Ответ, 1, Найти(Ответ,";")-1) = "Select currency" Тогда 
		впМассив = ПолучитьВалютыДляВыбор(Ответ);		
		впВидОплатыПродажи = Сред(ВидОплатыДляВозврата, 1, Найти(ВидОплатыДляВозврата,"-")-2);
		
		Для Каждого Строка Из впМассив Цикл 
			
			Если Найти(Строка,впВидОплатыПродажи) <> Неопределено И Найти(Строка,впВидОплатыПродажи) > 0 Тогда  
				впSelected = Строка;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
				
		мRequest.Selected = впSelected;
		Результат = Объект.Selected(СтрокаДляТерминала(мRequest), Ответ);
		
		Если впSelected = Неопределено Тогда 
			//Возврат "დაბრუნება შეწყვეტილია.";
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;		
	
	
	
	Если НЕ Результат Тогда          			
		
		мТипТранзакции = "Отказ";
		
		Попытка
			СтрокаОтТерминала(Ответ, мRequest, мМассив);
			ПолучитьСтрокиСлипЧека(Объект, СписокСтрокСлипЧека, "დაბრუნება", мRequest, впSelected);
			Ответ = Кодировка(мRequest.TextResponse);
		Исключение
		КонецПопытки;
	
		//Возврат "შეცდომა ("+ Ответ +").";		
		Возврат Ложь;
	Иначе 
		СтрокаОтТерминала(Ответ, мRequest, мМассив);
		ПолучитьСтрокиСлипЧека(Объект, СписокСтрокСлипЧека, "დაბრუნება", мRequest, впSelected);
	КонецЕсли;
			
	Возврат Истина;

КонецФункции

Функция УдалитьПлатежаПоПлатежнойКарте(Объект, СписокСтрокСлипЧека, TerminalID, OperationID, мRequest, мМассив, TerminalAlias, ИспользоватьTranslinkДляТерминала)
	
	Ответ = "";
	мRequest.OperatorID = "";
	мRequest.OperatorName = ""; 
	мRequest.OperationID = OperationID; 
	
	Если ИспользоватьTranslinkДляТерминала Тогда 
		мRequest.TerminalAlias = TerminalAlias; 
	КонецЕсли;

	Результат = Объект.NewVoid(СтрокаДляТерминала(мRequest), Ответ);
	
	Если НЕ Результат Тогда          			
		мТипТранзакции = "Отказ";
		
		Попытка
			СтрокаОтТерминала(Ответ, мRequest, мМассив);
			ПолучитьСтрокиСлипЧека(Объект, СписокСтрокСлипЧека, "გადახდა", мRequest);
			Ответ = Кодировка(мRequest.TextResponse);
		Исключение
		КонецПопытки;
	
		//Возврат "შეცდომა ("+ Ответ +").";	
		Возврат Ложь;
		
	иначе
		СтрокаОтТерминала(Ответ, мRequest, мМассив);
		ПолучитьСтрокиСлипЧека(Объект, СписокСтрокСлипЧека, "დაბრუნება", мRequest);
		
		Если Не ЗначениеЗаполнено(мRequest.ReceiptData) Тогда 
			//Возврат "შეცდომა ("+"ვერ მოხერხდა ტრანზაქციის გაუქმება. Wrong card!"+").";	
			Сообщить("შეცდომა ("+"ვერ მოხერხდა ტრანზაქციის გაუქმება. Wrong card!"+").");
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
	
КонецФункции

Процедура ПолучитьСтрокиСлипЧека(Объект, СписокСтрокСлипЧека, Операция, мRequest, ВидОплатыДляВозврата = "") 
	
	СписокСтрокСлипЧека.Вставить("Сумма",								мRequest.Amount);
	СписокСтрокСлипЧека.Вставить("ИдентификаторОперацииНаТерминале",	мRequest.CheckNumber);
	СписокСтрокСлипЧека.Вставить("ВремяОперацииНаТерминале",			мRequest.TerminalDateTime);	
	СписокСтрокСлипЧека.Вставить("ИдентификаторТерминала",				мRequest.TerminalID);
	СписокСтрокСлипЧека.Вставить("КодАвторизации",						мRequest.AuthorizationCode);
	СписокСтрокСлипЧека.Вставить("КодОтветаХоста",						мRequest.ResponseCodeHost);
	СписокСтрокСлипЧека.Вставить("НомерСсылкы",							мRequest.ReferenceNumber);
	СписокСтрокСлипЧека.Вставить("НомерКарты",							мRequest.PAN);
	СписокСтрокСлипЧека.Вставить("ОписаниеОтветаХоста",					Кодировка(мRequest.TextResponse));
	СписокСтрокСлипЧека.Вставить("Операция",							Операция);
	СписокСтрокСлипЧека.Вставить("СлипОтХоста",							Кодировка(мRequest.ReceiptData));
	СписокСтрокСлипЧека.Вставить("ВидОплатыДляВозврата",				ВидОплатыДляВозврата);
	СписокСтрокСлипЧека.Вставить("КодОперацииЭС",				        мRequest.OperationID);
	
КонецПроцедуры

Функция ВозвратВходныеПараметры(Идентификатор, впСуммаЭС, МетодОплаты, ПериодРасрочки = 0, СуммаДляВозврата, НомерСсылкы, КодАвторизации, ВидОплатыДляВозврата, КодОперацииЭС, CashbackAmount)
	
	Параметры = Новый Структура;

	Параметры.Вставить("Сумма" , 			впСуммаЭС);	
	//Параметры.Вставить("ДокументОбъект", 	ЭтотОбъект);
	//Параметры.Вставить("Объект", 			впСтрокаЭС.млЭС.Объект);
	//Параметры.Вставить("КассаККМ"     , 	КассаККМ);     //     впСтрокаЭС.КассаККМ
	//Параметры.Вставить("COMПорт"      , 	впСтрокаЭС.млЭС.порт);	//впСтрокаЭС.Порт
	//Параметры.Вставить("Скорость"      ,    впСтрокаЭС.млЭС.Скорость);
	//Параметры.Вставить("TerminalID"      , 	впСтрокаЭС.млЭС.TerminalID);
	////დაბრუნების შემთხვევაში
	////Параметры.Вставить("СуммаДляВозврата"   ,ЧекККМ.СуммаЭС);
	////Параметры.Вставить("НомерСсылкы"        ,ЧекККМ.НомерСсылкыЭС);
	////Параметры.Вставить("КодАвторизации"     ,ЧекККМ.КодАвторизацииЭС);
	//Параметры.Вставить("СуммаДляВозврата"   ,0);   
	Параметры.Вставить("НомерСсылкы"      	,НомерСсылкы);  
	Параметры.Вставить("КодАвторизации"     ,КодАвторизации);  
	Параметры.Вставить("МетодОплаты"        ,МетодОплаты); 
	Параметры.Вставить("ПериодРасрочки"     ,ПериодРасрочки); 
	Параметры.Вставить("СуммаДляВозврата"   ,СуммаДляВозврата); 
	Параметры.Вставить("ВидОплатыДляВозврата"   ,ВидОплатыДляВозврата); 
	Параметры.Вставить("КодОперацииЭС"   ,КодОперацииЭС); 
	Параметры.Вставить("CashbackAmount"   ,CashbackAmount); 
	
	Для Каждого впСтрокаЭС Из глПодключаемоеОборудование.ПараметрыПодключенияПО Цикл 
		Если впСтрокаЭС.Ссылка = Идентификатор Тогда 
			Параметры.Вставить("мRequest", впСтрокаЭС.мRequest);  
			Параметры.Вставить("мМассив" , впСтрокаЭС.мМассив); 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьВалютыДляВыбор(СтрокаОтвета)
	
	впМассивВалют = Новый Массив;
	СтрокаОтвета = Сред(СтрокаОтвета,Найти(СтрокаОтвета,";")+1);
	впСтрока = СтрокаОтвета;
	
	Пока СтрокаОтвета <> "" Цикл 
		
		Если Найти(СтрокаОтвета,";") > 0 Тогда 
			впСтрока = Лев(СтрокаОтвета,Найти(СтрокаОтвета,";")-1);
			СтрокаОтвета = Сред(СтрокаОтвета,Найти(СтрокаОтвета,";")+1);
		Иначе
			впСтрока = СтрокаОтвета;
			СтрокаОтвета = "";
		КонецЕсли;
		
		Если впСтрока <> "" Тогда 
			впМассивВалют.Добавить(впСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат впМассивВалют;	
	
КонецФункции

// Функция возвращает возможность работы модуля в асинхронном режиме.
// Стандартные команды модуля:
// - ПодключитьУстройство
// - ОтключитьУстройство
// - ВыполнитьКоманду
// Команды модуля для работы асинхронном режиме (должны быть определены):
// - НачатьПодключениеУстройства
// - НачатьОтключениеУстройства
// - НачатьВыполнениеКоманды.
//
Функция ПоддержкаАсинхронногоРежима() Экспорт
	
	Возврат Ложь;
	
КонецФункции


#КонецОбласти