
&НаСервере
Процедура ЗаполнитьПодрозделенияНаСервере()
	
	Объект.Подразделения.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтруктурныеЕдиницы.Ссылка КАК Подразделение,
				   |    &ПроцентПодоходного КАК ПроцентПодоходного
	               |ИЗ
	               |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	               |ГДЕ
	               |	СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ
	               |	И СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы = &ТипСтруктурнойЕдиницы";
	
	Запрос.УстановитьПараметр("ТипСтруктурнойЕдиницы",Перечисления.ТипыСтруктурныхЕдиниц.Подразделение);
	Запрос.УстановитьПараметр("ПроцентПодоходного",Процент);	
	
    Объект.Подразделения.Загрузить(Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодрозделения(Команда)
	ЗаполнитьПодрозделенияНаСервере();
КонецПроцедуры
