////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция GET(Парам) Экспорт
	
	Соединение = Новый HTTPСоединение(Парам.Соединение.Сервер, Парам.Соединение.Порт, Парам.Соединение.Пользователь, 
									  Парам.Соединение.Пароль, Парам.Соединение.Прокси, Парам.Соединение.Таймаут, Парам.Соединение.ЗащищенноеСоединение);
		
	Возврат Соединение.Получить(Новый HTTPЗапрос(Парам.Resource, Парам.Headers), Парам.ИмяФайлаЗапроса);
	
КонецФункции

Функция POST(Парам) Экспорт
	
	Соединение = Новый HTTPСоединение(Парам.Соединение.Сервер, Парам.Соединение.Порт, Парам.Соединение.Пользователь, 
									  Парам.Соединение.Пароль, Парам.Соединение.Прокси, Парам.Соединение.Таймаут, Парам.Соединение.ЗащищенноеСоединение);
									  
	Запрос = Новый HTTPЗапрос(Парам.Resource, Парам.Headers);
	Запрос.УстановитьТелоИзСтроки(Парам.Parameters, "CESU-8");
	
	Возврат Соединение.ОтправитьДляОбработки(Запрос);
	
КонецФункции

Функция PUT(Парам) Экспорт
	

	Возврат "";
	
КонецФункции

Функция DELETE(Парам) Экспорт
	

	Возврат "";
	
КонецФункции

Функция ПарамертыHTTPЗапрос() Экспорт
		
	Парам = Новый Структура;
	Парам.Вставить("Headers", ПарамертыHeaders());
	Парам.Вставить("Parameters", "");	
	Парам.Вставить("Соединение", ПарамертыСоединение());
	Парам.Вставить("Resource", Неопределено);
	Парам.Вставить("ИмяФайлаЗапроса", Неопределено);

	Возврат Парам; 
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПарамертыСоединение()

	Соединение = Новый Структура;
	Соединение.Вставить("Сервер", Неопределено);
	Соединение.Вставить("Порт", Неопределено);
	Соединение.Вставить("Пользователь", Неопределено);
	Соединение.Вставить("Пароль", Неопределено);
	Соединение.Вставить("Прокси", Неопределено);
	Соединение.Вставить("Таймаут", Неопределено);
	Соединение.Вставить("ЗащищенноеСоединение", Неопределено);

	Возврат Соединение; 
	
КонецФункции

Функция ПарамертыHeaders()

	// Samples
	// Headers.Вставить("Content-Type", "application/x-www-form-urlencoded");
	// Headers.Вставить("Content-Type", "application/json");
	// Headers.Вставить("authorization", "Bearer Lqjcf5cjGa0ZuuKpKEqEqk4u3Qa9N8");
	
	Возврат Новый Соответствие; 
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОГО ПОЛЯ <Наименование>

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

