
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗагрузкаНоменклатури") Тогда
		ЗагрузкаНоменклатури = Параметры.ЗагрузкаНоменклатури;
	Иначе
		ЗагрузкаНоменклатури = Истина;
	КонецЕсли;
	
	ИнициализироватьТабличныйДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТабличныйДокумент()
	
	МакетЗаполненияПоВнешнемуИсточнику = Обработки.ЗагрузкаДанныхИзВнешнихФайлов.ПолучитьМакет("МакетЗагрузкиДанных");
	ТабличныйДокумент.Очистить();
	
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Артикул");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	ОбластьКоличествоЦенаСумма = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("КоличествоЦенаСумма");
	ТабличныйДокумент.Присоединить(ОбластьКоличествоЦенаСумма);
	ТабличныйДокумент.ФиксацияСверху = 1;
	
	
КонецПроцедуры


&НаКлиенте
Процедура Далее(Команда)
	ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C1").Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C2").Текст);
	
	Если Не ЗаполненыНоменклатураКодАртикулШтрихкод Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла.'"));
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Состояние(НСтр("ru = 'Осуществляется сопоставление введенных данных с данными информационной базы. Пожалуйста подождите...'"),,,БиблиотекаКартинок.Информация32);
	Резултат = СопоставитьДанныеТабличногоДокументаСДаннымиИБ();
	
	Если ТипЗнч(Резултат) = Тип("Массив") И ЗагрузкаНоменклатури Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("НесущестующиеНоменклатури", Резултат);            
		ОткрытьФорму(
		"Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.ФормаЗагрузкиНоменклатури",
		ПараметрыФормы,
		ЭтаФорма,
		УникальныйИдентификатор);
	Иначе 
		Закрыть();
		СтруктураВыбора = Новый Структура();
		СтруктураВыбора.Вставить("АдресТоваровВХранилище", ПоместитьТоварыВХранилище());
		ОповеститьОВыборе(СтруктураВыбора);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьКоллекцию()
	Возврат Объект.Запасы.Выгрузить()
КонецФункции

&НаСервере
Функция ПоместитьТоварыВХранилище()
	Возврат ПоместитьВоВременноеХранилище(Объект.Запасы.Выгрузить());
КонецФункции

&НаСервере
Функция СопоставитьДанныеТабличногоДокументаСДаннымиИБ()
	//Объект.Запасы.Очистить();
	
	НомераКолонок = Новый Соответствие;
	НомерКолонки = 1;
	НомераКолонок.Вставить("КолонкаАртикул", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаКоличество", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаЦена", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	
	НомерСтроки = 2;
	СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
	ТабДанных = ПолучитьТабДанных(НомераКолонок);
	
	Резултат = ПоискЗагрузкаДанных(ТабДанных);
	
	Возврат Резултат;
	
КонецФункции

&НаСервере
Функция ПолучитьТабДанных(НомераКолонок)
	
	КолонкаАртикул	  =  НомераКолонок.Получить("КолонкаАртикул");	
	КолонкаКоличество =  НомераКолонок.Получить("КолонкаКоличество");	
	КолонкаЦена		  =  НомераКолонок.Получить("КолонкаЦена");	
	
	ТабДанных = Новый ТаблицаЗначений();
	
	ТабДанных.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));
	ТабДанных.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТабДанных.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	
	Для НомерСтроки =2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		врАртикул = СокрЛП(ТабличныйДокумент.Область("R" + СтроковыйНомер + КолонкаАртикул).Текст) ;
		Если  ЗначениеЗаполнено(врАртикул) Тогда
			нСтрока = ТабДанных.Добавить();
			нСтрока.Артикул = врАртикул;
			
			врКоличество = СокрЛП(ТабличныйДокумент.Область("R" + СтроковыйНомер + КолонкаКоличество).Текст) ;
			врКоличество = СтрЗаменить(врКоличество," ","");
			нСтрока.Количество = ?(врКоличество = "", 0, Число(врКоличество));
			
			врЦена = СокрЛП(ТабличныйДокумент.Область("R" + СтроковыйНомер + КолонкаЦена).Текст) ;
			врЦена = СтрЗаменить(врЦена," ","");
			нСтрока.Цена = ?(врЦена = "", 0, Число(врЦена));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДанных;
	
КонецФункции

&НаСервере
Функция  ПоискЗагрузкаДанных(ТабДанных)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	врТаблица.Артикул,
	               |	врТаблица.Количество,
	               |	врТаблица.Цена
	               |ПОМЕСТИТЬ врДанныеФайла
	               |ИЗ
	               |	&врТаблица КАК врТаблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	врДанныеФайла.Артикул,
	               |	врДанныеФайла.Количество,
	               |	врДанныеФайла.Цена,
	               |	ЕСТЬNULL(Номенклатури.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура
	               |ИЗ
	               |	врДанныеФайла КАК врДанныеФайла
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатури
	               |		ПО врДанныеФайла.Артикул = Номенклатури.Артикул";
	
	Запрос.УстановитьПараметр("врТаблица", ТабДанных);
	
	Результат = Запрос.Выполнить();
	НайденниеДанные = Результат.Выгрузить();
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());

	НесущестующиеНоменклатури = НайденниеДанные.НайтиСтроки(ПараметрыОтбора);
	Если НесущестующиеНоменклатури.Количество() Тогда
		
		МассивАртикулов = Новый Массив;
		Для каждого стр Из НесущестующиеНоменклатури Цикл
			   МассивАртикулов.Добавить(стр.Артикул);
		КонецЦикла;
		
		Возврат МассивАртикулов;	
	Иначе 
		Объект.Запасы.Загрузить(НайденниеДанные);
	КонецЕсли;
		
	Возврат  "";
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИзФайла(Команда)
	
	ФайлЭкселПолноеИмя = Файл;
	
	Попытка
		ExcelApp 	= New COMОбъект("excel.application");
		workbook 	= ExcelApp.Workbooks.open(ФайлЭкселПолноеИмя);
	Исключение 
		Сообщить("Внимание! Файл для загрузки "+ФайлЭкселПолноеИмя+" не открыт!");
	КонецПопытки;
	
	worksheet		= workbook.worksheets(1);
	
	Сч = 2;
	СтроковыйНомер = 2;
	КолонкаАртикул = 1;
	ИнициализироватьТабличныйДокумент();

	Пока ЗначениеЗаполнено(worksheet.Cells(Сч,КолонкаАртикул).Text) Цикл
		врАртикул = СокрЛП(worksheet.Cells(Сч,КолонкаАртикул).Text);
		ткстСтроковыйНомер =  Формат(СтроковыйНомер, "ЧН=0; ЧГ=0");
		Для кол = 1 По 3 Цикл 
			текКол = Формат(кол, "ЧН=0; ЧГ=0");
			ТабличныйДокумент.Область("R" + ткстСтроковыйНомер +"C" +  текКол).Текст = worksheet.Cells(Сч,кол).Text;
		КонецЦикла;
		СтроковыйНомер = СтроковыйНомер + 1;
		
		Сч = Сч + 1;    
		
	КонецЦикла;
	ExcelApp.Quit();

КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогВыбораФайла.ПолноеИмяФайла = Элемент.ТекстРедактирования;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок = "Выберите файл заявки";
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Файл = ДиалогВыбораФайла.ВыбранныеФайлы[0];
	Иначе
		Предупреждение("Файл не выбран!");
		ТекущийЭлемент = Элементы.Файл;
	КонецЕсли;


КонецПроцедуры



