#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если ПустаяСтрока(Запись.Поле) И НЕ Запись.СложныйАлгоритм И НЕ ТипЗнч(Запись.Вариант)=Тип("СправочникСсылка.ВариантыДополнительныхОтчетов") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='მიბმის ველი არ არის შევსებული';ru='Не заполнено поле привязки';en='Field filled not binding'"),,,, Отказ);
			Возврат;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли