
&Вместо("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	ЯвляетсяНеРезидентом = AzRyОбщегоНазначения.ВДокументеКонтрагентЯвляетсяНеРезидентом(ДокументСсылкаРасходСоСчета);
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ОрганизацияДляРегОтчетности", ДокументСсылкаРасходСоСчета.Организация);
	
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаДС", ДокументСсылкаРасходСоСчета.ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("ВалютаДоговораКредитаЗайма", ДокументСсылкаРасходСоСчета.ДоговорКредитаЗайма.ВалютаРасчетов);
	Если НЕ ЗначениеЗаполнено(ДокументСсылкаРасходСоСчета.НаправлениеДеятельности)
		ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьБиллинг")
		ИЛИ НЕ Константы.БиллингВестиУчетРасходовПоДоговорамОбслуживания.Получить() Тогда
		Запрос.УстановитьПараметр("ВалютаДоговораОбслуживания", Справочники.Валюты.ПустаяСсылка());
	Иначе
		ДоговорОбслуживания = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("ДоговорОбслуживанияНаправлениеДеятельности", ДокументСсылкаРасходСоСчета.НаправлениеДеятельности);
		Запрос.УстановитьПараметр("ВалютаДоговораОбслуживания", ?(ЗначениеЗаполнено(ДоговорОбслуживания), ДоговорОбслуживания.ВалютаРасчетов, Справочники.Валюты.ПустаяСсылка()));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОбъединятьНакопительнуюИСтраховуюЧасть", ?(ЗначениеЗаполнено(ДокументСсылкаРасходСоСчета.ДокументОснование), ДокументСсылкаРасходСоСчета.ДокументОснование.Дата >= УчетСтраховыхВзносов.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР(), Истина));
	Запрос.УстановитьПараметр("ПериодРегистрацииНДФЛ", НачалоМесяца(ДобавитьМесяц(ДокументСсылкаРасходСоСчета.СрокУплаты, -1)));
	
	СтраховыеВидыВзаиморасчетов = Новый Массив();
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ПФРНакопительнаяСотрудники);
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ПФРСтраховаяСотрудники);
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ФОМССотрудники);
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ФСССотрудники);
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ФССТравматизмСотрудники);
	
	Запрос.УстановитьПараметр("СтраховыеВидыВзаиморасчетов",СтраховыеВидыВзаиморасчетов);
	
	Запрос.УстановитьПараметр("ИспользоватьСтатьиДДС", ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиДвиженияДенежныхСредств"));
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	Если СтруктураДополнительныеСвойства.ДляПроведения.Свойство("ПроектДокумента") Тогда
		СтруктураДополнительныеСвойства.ДляПроведения.ПроектДокумента = ДокументСсылкаРасходСоСчета.ПроектДляЗачетаАвансаСПомощником;
	Иначе
		СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ПроектДокумента", ?(Не ЗначениеЗаполнено(ДокументСсылкаРасходСоСчета.ПроектДляЗачетаАвансаСПомощником),ПредопределенноеЗначение("Справочник.Проекты.БезПроекта"),ДокументСсылкаРасходСоСчета.ПроектДляЗачетаАвансаСПомощником));
		//+++ Lazare_26.04.2021
		  //СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ПроектДокумента", ПредопределенноеЗначение("Справочник.Проекты.БезПроекта"));
		//--- Lazare_26.04.2021
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	Запрос.УстановитьПараметр("ЯвляетсяНеРезидентом", ЯвляетсяНеРезидентом);
	Запрос.УстановитьПараметр("ВалютаДС", ДокументСсылкаРасходСоСчета.ВалютаДенежныхСредств);
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	
	//Паганини_В запроце "ВременнаяТаблицаРасшифровкаПлатежа" добавленн поле ТипНДФЛ_Паганини
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаДС, &ВалютаДоговораКредитаЗайма, &ВалютаДоговораОбслуживания)) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.Ссылка.ВидОперации КАК ВидОперации,
	|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.УчитыватьВНУ КАК УчитыватьВНУ,
	|	ТаблицаДокумента.Ссылка.Организация КАК ОрганизацияВНУ,
	|	ТаблицаДокумента.СтавкаНДС,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.ЭтоДоговорОбслуживания
	|				И ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВестиУчетРасходовПоДоговорамОбслуживания,
	|	ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности КАК ДоговорОбслуживанияНаправлениеДеятельности,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет КАК БанковскийСчет,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьСтатьиДДС
	|				ИЛИ ТаблицаДокумента.СтатьяДДС = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Ссылка.Статья
	|		ИНАЧЕ ТаблицаДокумента.СтатьяДДС
	|	КОНЕЦ КАК Статья,
	|	ТаблицаДокумента.Ссылка.Корреспонденция КАК Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл КАК КорреспонденцияРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|				И ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|				И ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ КАК Заказ,
	|	ТаблицаДокумента.ПризнакАванса КАК ПризнакАванса,
	|	ТаблицаДокумента.Ссылка.Дата КАК Дата,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаУчета,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаРасчетов,
	|	СУММА(ТаблицаДокумента.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов + ТаблицаДокумента.СуммаРасчетовКомиссии) КАК СуммаРасчетовДляЭквайринга,
	|	СУММА(ТаблицаДокумента.СуммаПлатежа + ТаблицаДокумента.СуммаПлатежаКомиссии) КАК СуммаПлатежаДляЭквайринга,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаДокумента.СуммаПлатежа + ТаблицаДокумента.СуммаПлатежаКомиссии) * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаУчетаДляЭквайринга,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежаКомиссии * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаУчетаКомиссии,
	|	СУММА(ТаблицаДокумента.СуммаПлатежаКомиссии) КАК СуммаПлатежаКомиссии,
	|	СУММА(ТаблицаДокумента.СуммаРасчетовКомиссии) КАК СуммаРасчетовКомиссии,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументПланирования) = ТИП(Документ.РасходДСПлан)
	|				И ТаблицаДокумента.ДокументПланирования <> ЗНАЧЕНИЕ(Документ.РасходДСПлан.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.ДокументПланирования
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументПланирования) = ТИП(Документ.ПеремещениеДСПлан)
	|				И ТаблицаДокумента.ДокументПланирования <> ЗНАЧЕНИЕ(Документ.ПеремещениеДСПлан.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.ДокументПланирования
	|		КОГДА ТаблицаДокумента.СчетНаОплату.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.СчетНаОплату
	|		КОГДА ТаблицаДокумента.Заказ.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетНаОплатуДляПлатежногоКалендаря,
	|	ТаблицаДокумента.СчетНаОплату КАК СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет.СчетУчета КАК БанковскийСчетКассаСчетУчета,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетУчета КАК СчетУчетаЭквайринг,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетЗатрат КАК СчетЗатратЭквайринг,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет.СчетУчетаРегл КАК БанковскийСчетКассаСчетУчетаРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл КАК СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл КАК СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетУчетаРегл КАК СчетУчетаЭквайрингРегл,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетЗатратРегл КАК СчетЗатратЭквайрингРегл,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал,
	|	ТаблицаДокумента.ТипСуммы,
	|	ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма,
	|	ТаблицаДокумента.Ссылка.Подотчетник КАК Сотрудник,
	|	ТаблицаДокумента.Ссылка.СчетКонтрагента КАК СчетКонтрагента,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчета
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаПроцентов
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаКомиссии
	|	КОНЕЦ КАК СчетУчетаПоТипуСуммы,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаКомиссииРегл
	|	КОНЕЦ КАК СчетУчетаПоТипуСуммыРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ""Оплата основного долга по кредиту""
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ""Оплата процентов по кредиту""
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ""Оплата комиссии по кредиту""
	|	КОНЕЦ КАК СодержаниеПоТипуСуммы,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ТОГДА ТаблицаДокумента.Ссылка.ВидНалога
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ТОГДА ТаблицаДокумента.Ссылка.Корреспонденция
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ТОГДА ТаблицаДокумента.Ссылка.СчетКонтрагента
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА ТаблицаДокумента.Ссылка.Касса
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент
	|	КОНЕЦ КАК АналитикаДДС,
	|	ТаблицаДокумента.Ссылка.НаправлениеДеятельности,
	|	ТаблицаДокумента.Ссылка.Перемещение КАК ЭтоПеремещение,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчета КАК НДФЛсНачисленийСчетУчета,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК НДФЛсНачисленийСчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета КАК НДФЛсВыплатСчетУчета,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК НДФЛсВыплатСчетУчетаРегл,
	|	ЕСТЬNULL(ТаблицаДокумента.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0) КАК СтавкаНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат КАК ВидНалогаНДФЛКОплате,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога КАК ВидНалогаНДФЛНачислении,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛ * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаНДФЛ,
	|	СУММА(ТаблицаДокумента.СуммаНДФЛ) КАК СуммаНДФЛВал,
	|	ТаблицаДокумента.ВидУдержанияПФ,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПФ * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаПФ,
	|	СУММА(ТаблицаДокумента.СуммаПФ) КАК СуммаПФВал,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФСотрудника,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФОрганизации,
	|	ТаблицаДокумента.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	ТаблицаДокумента.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДС * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаНДС,
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект КАК Проект,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|				Выбор
	|					КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|							ИЛИ ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|						ТОГДА 
	|							ВЫБОР 
	|								КОГДА ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|								ИНАЧЕ ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником
	|							КОНЕЦ
	|						ИНАЧЕ ТаблицаДокумента.Проект
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОНЕЦ КАК Проект
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА 
	////|       		ВЫбор
	////|					КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	////|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	////|                    ИНАЧЕ ТаблицаДокумента.Проект 
	////|				КОНЕЦ КАК Проект,
	//|		ИНАЧЕ ТаблицаДокумента.Проект
	//|	 КОНЕЦ КАК Проект, 
	 //Lazare_ 26.02.2021
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	| ,&ЯвляетсяНеРезидентом КАК ЯвляетсяНеРезидентом,	
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПриходнаяНакладная).Курс
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ДополнительныеРасходы).Курс
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КурсПоступления,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПриходнаяНакладная).Кратность
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ДополнительныеРасходы).Кратность
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КратностьПоступления,	
	|	СУММА(ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаНДФЛ = 0 ТОГДА
	|	    	0	
	|		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛ / ТаблицаДокумента.Курс / КурсыВалютУчета.Кратность * (КурсыВалютУчета.Курс / ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 2))
	//|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаПоступленияНДФЛВал
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:		
	|ПОМЕСТИТЬ ВременнаяТаблицаРасшифровкаПлатежа
	|ИЗ
	|	Документ.РасходСоСчета.РасшифровкаПлатежа КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|				Выбор
	|					КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|							ИЛИ ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|						ТОГДА 
	|							ВЫБОР 
	|								КОГДА ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|								ИНАЧЕ ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником
	|							КОНЕЦ
	|						ИНАЧЕ ТаблицаДокумента.Проект
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА 
	////|       		ВЫбор
	////|					КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	////|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	////|                    ИНАЧЕ ТаблицаДокумента.Проект 
	////|				КОНЕЦ,
	//|		ИНАЧЕ ТаблицаДокумента.Проект 
	//|	 КОНЕЦ, 
	 //Lazare_ 26.02.2021
	|	ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет,
	|	ТаблицаДокумента.Ссылка.СчетКонтрагента,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю)
	|				И ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|				И ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументПланирования) = ТИП(Документ.РасходДСПлан)
	|				И ТаблицаДокумента.ДокументПланирования <> ЗНАЧЕНИЕ(Документ.РасходДСПлан.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.ДокументПланирования
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументПланирования) = ТИП(Документ.ПеремещениеДСПлан)
	|				И ТаблицаДокумента.ДокументПланирования <> ЗНАЧЕНИЕ(Документ.ПеремещениеДСПлан.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.ДокументПланирования
	|		КОГДА ТаблицаДокумента.СчетНаОплату.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.СчетНаОплату
	|		КОГДА ТаблицаДокумента.Заказ.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет.СчетУчета,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет.СчетУчетаРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетУчета,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетЗатрат,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетУчетаРегл,
	|	ТаблицаДокумента.Ссылка.ЭквайринговыйТерминал.СчетЗатратРегл,
	|	ТаблицаДокумента.ТипСуммы,
	|	ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма,
	|	ТаблицаДокумента.Ссылка.Подотчетник,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчета
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаПроцентов
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаКомиссии
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаКомиссииРегл
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ""Оплата основного долга по кредиту""
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ""Оплата процентов по кредиту""
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ""Оплата комиссии по кредиту""
	|	КОНЕЦ,
	|	ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.ЭтоДоговорОбслуживания
	|				И ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ТОГДА ТаблицаДокумента.Ссылка.ВидНалога
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ТОГДА ТаблицаДокумента.Ссылка.Корреспонденция
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ТОГДА ТаблицаДокумента.Ссылка.СчетКонтрагента
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА ТаблицаДокумента.Ссылка.Касса
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьСтатьиДДС
	|				ИЛИ ТаблицаДокумента.СтатьяДДС = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Ссылка.Статья
	|		ИНАЧЕ ТаблицаДокумента.СтатьяДДС
	|	КОНЕЦ,
	|	ТаблицаДокумента.СтавкаНДС,
	|	ТаблицаДокумента.Ссылка.УчитыватьВНУ,
	|	ТаблицаДокумента.Ссылка.Организация,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчета
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета
	|	КОНЕЦ,
	|	ЕСТЬNULL(ТаблицаДокумента.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0),
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога,
	|	ТаблицаДокумента.ВидУдержанияПФ,
	|	ТаблицаДокумента.Ссылка.Перемещение,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.Договор,
	|	ТаблицаДокумента.ВидУдержанияПФ.Контрагент,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчета,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	| ,ТаблицаДокумента.СуммаНДФЛ
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	ТаблицаДокумента.ВидОперации КАК ВидОперации,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	ТаблицаДокумента.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ТаблицаДокумента.СуммаДокумента КАК СуммаВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА &ВалютаДоговораОбслуживания <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|					И &ВалютаДоговораОбслуживания = ТаблицаДокумента.ВалютаДенежныхСредств
	|				ТОГДА ТаблицаДокумента.СуммаДокумента
	|			КОГДА &ВалютаДоговораОбслуживания <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|					И &ВалютаДоговораОбслуживания <> ТаблицаДокумента.ВалютаДенежныхСредств
	|				ТОГДА ТаблицаДокумента.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность * КурсыВалютДоговорОбслуживания.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность * КурсыВалютДоговорОбслуживания.Курс)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаПоДоговоруОбслуживания,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет.СчетУчета КАК БанковскийСчетКассаСчетУчета,
	|	ТаблицаДокумента.Ссылка.БанковскийСчет.СчетУчетаРегл КАК БанковскийСчетКассаСчетУчетаРегл,
	|	ТаблицаДокумента.ВидНалога КАК ВидНалога,
	|	ТаблицаДокумента.ВидНалога.СчетУчета КАК ВидНалогаСчетУчета,
	|	ТаблицаДокумента.Подразделение КАК Подразделение,
	|	ТаблицаДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж КАК НаправлениеДеятельностиСчетУчетаВыручкиОтПродаж,
	|	ТаблицаДокумента.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиСчетУчетаСебестоимостиПродаж,
	|	ТаблицаДокумента.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл КАК НаправлениеДеятельностиСчетУчетаВыручкиОтПродажРегл,
	|	ТаблицаДокумента.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиСчетУчетаСебестоимостиПродажРегл,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ТаблицаДокумента.Корреспонденция КАК Корреспонденция,
	|	ТаблицаДокумента.КорреспонденцияРегл КАК КорреспонденцияРегл,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ТаблицаДокумента.КорреспонденцияРегл.ТипСчета
	|		ИНАЧЕ ТаблицаДокумента.Корреспонденция.ТипСчета
	|	КОНЕЦ КАК КорреспонденцияТипСчета,
	|	ТаблицаДокумента.Подотчетник КАК Подотчетник,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПерсоналом КАК ПодотчетникСчетРасчетовСперсоналом,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетниками КАК ПодотчетникСчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПерсоналомРегл КАК ПодотчетникСчетРасчетовСперсоналомРегл,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетникамиРегл КАК ПодотчетникСчетРасчетовСПодотчетникамиРегл,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.ДокументОснование КАК ДокументОснование,
	|	ТаблицаДокумента.АналитикаПрочихДоходовИРасходов КАК АналитикаДоходовИРасходов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчетПрочихРасчетов,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ТОГДА ТаблицаДокумента.Подотчетник
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ТОГДА ТаблицаДокумента.ВидНалога
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|				ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ТОГДА ТаблицаДокумента.КорреспонденцияРегл
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ТОГДА ТаблицаДокумента.Контрагент
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ТОГДА ТаблицаДокумента.Контрагент
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ТОГДА ТаблицаДокумента.Подотчетник
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ТОГДА ТаблицаДокумента.СчетКонтрагента
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА ТаблицаДокумента.Касса
	|		ИНАЧЕ ТаблицаДокумента.Контрагент
	|	КОНЕЦ КАК АналитикаДДС,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВидУдержания КАК ВидУдержанияПФ,
	|	ТаблицаДокумента.ВидУдержания.ПенсионныйНалогСотрудника КАК ПенсионныйНалогСотрудника,
	|	ТаблицаДокумента.ВидУдержания.ПенсионныйНалогОрганизации КАК ПенсионныйНалогОрганизации,
	|	ТаблицаДокумента.ВидУдержания.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетСотрудникаКВозмещению,
	|	ТаблицаДокумента.ВидУдержания.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетОрганизацииКВозмещению,
	|	ТаблицаДокумента.ВидУдержания.Контрагент КАК КонтрагентПФ,
	|	ТаблицаДокумента.ВидУдержания.Договор КАК ДоговорПФ,
	|	ТаблицаДокумента.Перемещение КАК ЭтоПеремещение,
	|	ТаблицаДокумента.СчетКонтрагента,
	//+++ Дмгг
	//|	ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником КАК Проект,
	//--- Дмгг
	////ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ КАК Проект,
	////ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект 
	 //Lazare_ 26.02.2021
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.РасходСоСчета КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютДоговорОбслуживания
	|		ПО (КурсыВалютДоговорОбслуживания.Валюта = &ВалютаДоговораОбслуживания)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходСоСчета.Дата КАК Период,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА РасходСоСчета.ДокументОснование.Дата ЕСТЬ NULL
	|			ТОГДА &ПериодРегистрацииНДФЛ
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(РасходСоСчета.ДокументОснование.Дата, МЕСЯЦ)
	|	КОНЕЦ КАК ПериодРегистрации,
	|	РасходСоСчета.Сумма КАК Сумма,
	//+++ Дмгг
	//|	РасходСоСчета.Проект КАК Проект
	//--- Дмгг
	////ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА РасходСоСчета.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ КАК Проект
	////ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА РасходСоСчета.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ РасходСоСчета.Проект
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект 
	 //Lazare_ 26.02.2021
	|ПОМЕСТИТЬ ВТРасчетыСНДФЛ
	|ИЗ
	|	ВременнаяТаблицаШапка КАК РасходСоСчета
	|ГДЕ
	|	РасходСоСчета.Сумма <> 0
	|	И РасходСоСчета.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.НДФЛСотрудники)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходСоСчета.Дата КАК Период,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ИСТИНА КАК ЭтоСтраховыеВзносы,
	|	ВЫБОР
	|		КОГДА РасходСоСчета.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ПФРНакопительнаяСотрудники)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРНакопительная)
	|		КОГДА РасходСоСчета.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ПФРСтраховаяСотрудники)
	|			ТОГДА ВЫБОР
	|					КОГДА &ОбъединятьНакопительнуюИСтраховуюЧасть
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРПоСуммарномуТарифу)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРСтраховая)
	|				КОНЕЦ
	|		КОГДА РасходСоСчета.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ФОМССотрудники)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФФОМС)
	|		КОГДА РасходСоСчета.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ФСССотрудники)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФСС)
	|		КОГДА РасходСоСчета.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ФССТравматизмСотрудники)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)
	|	КОНЕЦ КАК ВидОбязательногоСтрахованияСотрудников,
	|	РасходСоСчета.Сумма КАК Сумма,
	//+++ Дмгг
	//|	РасходСоСчета.Проект КАК Проект
	//--- Дмгг
	////ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА РасходСоСчета.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ КАК Проект
	////ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА РасходСоСчета.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ РасходСоСчета.Проект
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект 
	 //Lazare_ 26.02.2021
	|ПОМЕСТИТЬ ВТРасчетыСФондамиПоСтраховымВзносам
	|ИЗ
	|	ВременнаяТаблицаШапка КАК РасходСоСчета
	|ГДЕ
	|	РасходСоСчета.Сумма <> 0
	|	И РасходСоСчета.ВидНалога В(&СтраховыеВидыВзаиморасчетов)";
	
	Запрос.Выполнить();
	
	// Формирование таблиц движений по разделам учета.
	СформироватьТаблицаДенежныеСредства(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	// Прочие расчеты
	СформироватьТаблицаРасчетыСПрочимиКонтрагентами(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоКредитамИЗаймам(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	// Конец Прочие расчеты
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПлатежныйКалендарь(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	// Эквайринг
	СформироватьТаблицаРасчетыПоЭквайрингу(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыКассовыйМетодЭквайринг(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыЭквайринг(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	// Конец Эквайринг
	Если Не ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата //Тогда 
		И НЕ (ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников) Тогда // Kuzmich, 26.02.2019,Зарплата по ведомости в разрезе сотрудников
		
		// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
		Если ЯвляетсяНеРезидентом Тогда
			СформироватьТаблицаУправленческий(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
			СформироватьТаблицаОтчетПоКурсовымРазницам(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
		Иначе 	
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_РасходСоСчета(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);	
		КонецЕсли; 
		// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:

		//Паганини ПФ_
		Если ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПенсионномуФонду Тогда
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыСПенсионнымФондом_РасходСоСчета_ПенсионномуФонду(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
		Иначе
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыСПенсионнымФондом_РасходСоСчета_РасходИзКассы(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);//Паганини ПФ
		КонецЕсли;
		//_Паганини ПФ	
	Иначе 
		СформироватьТаблицаУправленческий_РС(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_РасходСоСчета_Зарплата(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыСПенсионнымФондом_РасходСоСчета_РасходИзКассы_Зарплата(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);//Паганини ПФ
	КонецЕсли;
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	Если ЯвляетсяНеРезидентом Тогда
		СформироватьТаблицаДекларация_РасходСоСчета(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	Иначе 	
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаДекларация_РасходСоСчета(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);//ПаганиниПФ
	КонецЕсли; 
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:	
	
	//Паганини#Удержания_
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыПоУдержаниям_РасходСоСчета(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	//_Паганини#Удержания
	СформироватьНДФЛРасчетыНалоговыхАгентовСБюджетом(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьРасчетыСФондамиПоСтраховымВзносам(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	// Биллинг
	СформироватьТаблицаВыполнениеДоговораОбслуживания(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗакупкиПоставщиковДляКУДиР(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаНалоговыеЛготы(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОстаткиНалоговыхЛьгот(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
																																																		  
КонецПроцедуры // ИнициализироватьДанныеДокумента()

&Вместо("СформироватьТаблицаРасчетыСПоставщиками")
Процедура РасшAzRy_СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	ЯвляетсяНеРезидентом = AzRyОбщегоНазначения.ВДокументеКонтрагентЯвляетсяНеРезидентом(ДокументСсылкаРасходСоСчета);
	
	Если ЯвляетсяНеРезидентом Тогда
		AzRy_СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	Иначе 	
	    NX_СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства);
	КонецЕсли; 
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	
КонецПроцедуры

Процедура NX_СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВозникновениеАвансаПоставщику", "Возникновение аванса поставщику");
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	//Паганини#Удержания_
	Запрос.УстановитьПараметр("ВалютаУчета",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета"));
	Запрос.УстановитьПараметр("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении"));
	Запрос.УстановитьПараметр("ПогашениеОбязательствПередПоставщиком", НСтр("ka='მომწოდებლის წინაშე ვალდებულებების დაფარვა';ru='Погашение обязательств перед поставщиком';en='Repayment of liabilities to the supplier'"));
	Запрос.УстановитьПараметр("ПогашениеОбязательствПередПерсоналом", НСтр("ka='პერსონალის წინაშე ვალდებულებების დაფარვა';ru='Погашение обязательств перед персоналом';en='Repayment of liabilities to employees'"));
	//_Паганини#Удержания
	
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	
	//Паганини_Добавлена 5 поля: "ТипНДФЛ","СуммаНДФЛ","СуммаНДФЛВал", "КурсПоступления", "КратностьПоступления"_Паганини
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет КАК БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ КАК ТипРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Дата,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК Сумма,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВал,
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК СуммаДляОстатка,
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВалДляОстатка,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ КАК СчетУчета,
	//+++
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья КАК Статья,
	//---
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов КАК Валюта,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ КАК СодержаниеПроводки,
	//Паганини ПФ_
	//|	ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ = ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|				ТОГДА 0
	//|			ИНАЧЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета / (1 - ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ КАК Справочник.ТипыНДФЛ).Ставка / 100) КАК ЧИСЛО(15, 2))) - ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета
	//|		КОНЕЦ) КАК СуммаНДФЛ,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ = ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|				ТОГДА 0
	//|			ИНАЧЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов / (1 - ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ КАК Справочник.ТипыНДФЛ).Ставка / 100) КАК ЧИСЛО(15, 2))) - ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов
	//|		КОНЕЦ) КАК СуммаНДФЛВал,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияНДФЛ,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДФЛ),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДФЛВал),
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛКОплате,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛНачислении,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияПФ,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПФВал),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПФ),
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ДоговорПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.КонтрагентПФ,
	//_Паганини ПФ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Курс
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Курс
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КурсПоступления,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Кратность
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Кратность
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КратностьПоступления,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	//--- Дмгг
	////ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ КАК Проект
	////ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект 
	 //Lazare_ 26.02.2021	
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	|   , ЛОЖЬ КАК ЯвляетсяНеРезидентом
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:	
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщиками
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ,
	 //Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	//+++
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	//---
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ,
	//Паганини ПФ_
	//|	ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияНДФЛ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛКОплате,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛНачислении,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ДоговорПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.КонтрагентПФ,
	//_Паганини ПФ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Курс
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Курс
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Кратность
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Кратность
	|		ИНАЧЕ 0
	|	КОНЕЦ
	//Паганини#Удержания_
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВыплатаЗаработнойПлаты.НомерСтроки),
	|	НЕОПРЕДЕЛЕНО,
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Договор,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаРасчетов),
	|	-СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(ПлатежнаяВедомостьСотрудники.СуммаРасчетов),
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником КАК Проект
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВыплатаЗаработнойПлаты.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ КАК Проект
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВыплатаЗаработнойПлаты.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект 
	 //Lazare_ 26.02.2021
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	|   , ЛОЖЬ КАК ЯвляетсяНеРезидентом
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:	
	|ИЗ
	|	Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|			ПО ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|		ПО ПлатежнаяВедомостьСотрудники.Ссылка = ВыплатаЗаработнойПлаты.Ведомость
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВыплатаЗаработнойПлаты.Ссылка = &Ссылка
	|	И ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Зарплата)
	|	И ВЫБОР
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВыплатаЗаработнойПлаты.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВыплатаЗаработнойПлаты.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ, 
	 //Lazare_ 26.02.2021
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Договор,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ
	//_Паганини#Удержания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов,
	|	СчетУчета,
	|	СчетУчетаРегл,
	|	Проект"; //+++ Дмгг
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПоставщиками.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблицаРасчетыСПоставщиками";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщиками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПоставщиками()

Процедура AzRy_СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВозникновениеАвансаПоставщику", "Возникновение аванса поставщику");
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	//Паганини#Удержания_
	Запрос.УстановитьПараметр("ВалютаУчета",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета"));
	Запрос.УстановитьПараметр("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении"));
	Запрос.УстановитьПараметр("ПогашениеОбязательствПередПоставщиком", НСтр("ka='მომწოდებლის წინაშე ვალდებულებების დაფარვა';ru='Погашение обязательств перед поставщиком';en='Repayment of liabilities to the supplier'"));
	Запрос.УстановитьПараметр("ПогашениеОбязательствПередПерсоналом", НСтр("ka='პერსონალის წინაშე ვალდებულებების დაფარვა';ru='Погашение обязательств перед персоналом';en='Repayment of liabilities to employees'"));
	//_Паганини#Удержания
	
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	
	//Паганини_Добавлена 5 поля: "ТипНДФЛ","СуммаНДФЛ","СуммаНДФЛВал", "КурсПоступления", "КратностьПоступления"_Паганини
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет КАК БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ КАК ТипРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Дата,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК Сумма,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВал,
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК СуммаДляОстатка,
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВалДляОстатка,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ КАК СчетУчета,
	//+++
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья КАК Статья,
	//---
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов КАК Валюта,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ КАК СодержаниеПроводки,
	//Паганини ПФ_
	//|	ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ = ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|				ТОГДА 0
	//|			ИНАЧЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета / (1 - ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ КАК Справочник.ТипыНДФЛ).Ставка / 100) КАК ЧИСЛО(15, 2))) - ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета
	//|		КОНЕЦ) КАК СуммаНДФЛ,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ = ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|				ТОГДА 0
	//|			ИНАЧЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов / (1 - ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ КАК Справочник.ТипыНДФЛ).Ставка / 100) КАК ЧИСЛО(15, 2))) - ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов
	//|		КОНЕЦ) КАК СуммаНДФЛВал,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияНДФЛ,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДФЛ),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДФЛВал),
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛКОплате,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛНачислении,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияПФ,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПФВал),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПФ),
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ДоговорПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.КонтрагентПФ,
	//_Паганини ПФ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Курс
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Курс
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КурсПоступления,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Кратность
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Кратность
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КратностьПоступления,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	//--- Дмгг
	////ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ КАК Проект
	////ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект 
	 //Lazare_ 26.02.2021	
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	|	,ВременнаяТаблицаРасшифровкаПлатежа.ЯвляетсяНеРезидентом КАК ЯвляетсяНеРезидентом
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:	
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщиками
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ,
	 //Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	//+++
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	//---
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ,
	//Паганини ПФ_
	//|	ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияНДФЛ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛКОплате,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛНачислении,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ДоговорПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.КонтрагентПФ,
	//_Паганини ПФ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Курс
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Курс
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Кратность
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Кратность
	|		ИНАЧЕ 0
	|	КОНЕЦ
	//Паганини#Удержания_
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	|	,ВременнаяТаблицаРасшифровкаПлатежа.ЯвляетсяНеРезидентом
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:	
	|
	
	// +++ AzRy
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет КАК БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ КАК ТипРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Дата,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета - ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов * ВременнаяТаблицаРасшифровкаПлатежа.КурсПоступления / ВременнаяТаблицаРасшифровкаПлатежа.КратностьПоступления) КАК Сумма,
	|	0 КАК СуммаВал,
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК СуммаДляОстатка,
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВалДляОстатка,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ КАК СчетУчета,
	  
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья КАК Статья,
	  
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов КАК Валюта,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &КурсоваяРазница
	|	КОНЕЦ КАК СодержаниеПроводки,
	//Паганини ПФ_
	//|	ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ = ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|				ТОГДА 0
	//|			ИНАЧЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета / (1 - ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ КАК Справочник.ТипыНДФЛ).Ставка / 100) КАК ЧИСЛО(15, 2))) - ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета
	//|		КОНЕЦ) КАК СуммаНДФЛ,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ = ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|				ТОГДА 0
	//|			ИНАЧЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов / (1 - ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ КАК Справочник.ТипыНДФЛ).Ставка / 100) КАК ЧИСЛО(15, 2))) - ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов
	//|		КОНЕЦ) КАК СуммаНДФЛВал,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияНДФЛ,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДФЛ),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДФЛВал),
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛКОплате,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛНачислении,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияПФ,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПФВал),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПФ),
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ДоговорПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.КонтрагентПФ,
	//_Паганини ПФ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Курс
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Курс
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КурсПоступления,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Кратность
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Кратность
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КратностьПоступления,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	//--- Дмгг
	////ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ КАК Проект
	////ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект 
	 //Lazare_ 26.02.2021	
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	|	,ВременнаяТаблицаРасшифровкаПлатежа.ЯвляетсяНеРезидентом
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:	
																							 
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	|	И ВременнаяТаблицаРасшифровкаПлатежа.ЯвляетсяНеРезидентом
	|	И НЕ ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ,
	 //Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	  
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	  
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &КурсоваяРазница
	|	КОНЕЦ,
	//Паганини ПФ_
	//|	ВременнаяТаблицаРасшифровкаПлатежа.ТипНДФЛ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияНДФЛ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛКОплате,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛНачислении,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ДоговорПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.КонтрагентПФ,
	//_Паганини ПФ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Курс
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Курс
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Кратность
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Кратность
	|		ИНАЧЕ 0
	|	КОНЕЦ
	//Паганини#Удержания_
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	|	,ВременнаяТаблицаРасшифровкаПлатежа.ЯвляетсяНеРезидентом
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:	
	|	
	// ++ AzRy
	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ	
	|	МАКСИМУМ(ВыплатаЗаработнойПлаты.НомерСтроки),
	|	НЕОПРЕДЕЛЕНО,
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Договор,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаРасчетов),
	|	-СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(ПлатежнаяВедомостьСотрудники.СуммаРасчетов),
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником КАК Проект
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВыплатаЗаработнойПлаты.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ КАК Проект
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВыплатаЗаработнойПлаты.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект 
	 //Lazare_ 26.02.2021
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	|	,NULL
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:	
	|ИЗ
	|	Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|			ПО ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|		ПО ПлатежнаяВедомостьСотрудники.Ссылка = ВыплатаЗаработнойПлаты.Ведомость
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВыплатаЗаработнойПлаты.Ссылка = &Ссылка
	|	И ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Зарплата)
	|	И ВЫБОР
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВыплатаЗаработнойПлаты.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ ВыплатаЗаработнойПлаты.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ, 
	 //Lazare_ 26.02.2021
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Договор,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ
	//_Паганини#Удержания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов,
	|	СчетУчета,
	|	СчетУчетаРегл,
	|	Проект"; //+++ Дмгг
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПоставщиками.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблицаРасчетыСПоставщиками";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщиками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОтчетПоКурсовымРазницам(ДокументСсылкаКонвертация, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("Аналитика", Строка(СтруктураДополнительныеСвойства.ДляПроведения.Ссылка));
	
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Порядок,
		|	1 КАК НомерСтроки,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ОрганизацияВНУ КАК Организация,
		|	ТаблицаДокумента.Статья КАК Статья,
		|	&Аналитика КАК Аналитика,
		|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
		|	""Расчеты с поставщиками"" КАК Раздел,
		|	ТаблицаДокумента.СуммаУчета - ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.КурсПоступления / ТаблицаДокумента.КратностьПоступления КАК Сумма,
		|	0 КАК СуммаДоходов,
		|	ТаблицаДокумента.СуммаУчета - ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.КурсПоступления / ТаблицаДокумента.КратностьПоступления КАК СуммаРасходов,
		|	-(ТаблицаДокумента.СуммаУчета - ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.КурсПоступления / ТаблицаДокумента.КратностьПоступления) КАК СуммаОстаток,
		|	0 КАК СуммаВалОстаток
		|	,ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА 
		|       		ВЫбор
		|					КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|                    ИНАЧЕ ТаблицаДокумента.Проект 
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	 КОНЕЦ КАК Проект		
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.ЯвляетсяНеРезидентом
		|	И Не ТаблицаДокумента.ПризнакАванса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	1,
		|	ТаблицаДокумента.Дата,
		|	ТаблицаДокумента.ОрганизацияВНУ,
		|	ТаблицаДокумента.Статья,
		|	&Аналитика,
		|	ТаблицаДокумента.ВалютаРасчетов,
		|	""Расчеты НДФЛ"",
		|	ТаблицаДокумента.СуммаНДФЛ - (ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления / ТаблицаДокумента.КратностьПоступления),
		|	0,
		|	ТаблицаДокумента.СуммаНДФЛ - (ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления / ТаблицаДокумента.КратностьПоступления),
		|	-(ТаблицаДокумента.СуммаНДФЛ - (ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления / ТаблицаДокумента.КратностьПоступления)),
		|	0
		|	,ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА 
		|       		ВЫбор
		|					КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|                    ИНАЧЕ ТаблицаДокумента.Проект 
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	 КОНЕЦ КАК Проект		
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.ЯвляетсяНеРезидентом
		|	И Не ТаблицаДокумента.ПризнакАванса";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтчетКурсовыхРазниц", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&Вместо("СформироватьТаблицаРасчетыПоНалогам")
Процедура РасшAzRy_СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", 		ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	//Запрос.УстановитьПараметр("ВалютаДокумента",ДокументСсылкаРасходСоСчета.ВалютаДенежныхСредств);
	Если ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам И ЗначениеЗаполнено(ДокументСсылкаРасходСоСчета.ДоговорКредитаЗайма) Тогда 
		Запрос.УстановитьПараметр("ВалютаДокумента",	ДокументСсылкаРасходСоСчета.ДоговорКредитаЗайма.ВалютаРасчетов);
	Иначе 
		Запрос.УстановитьПараметр("ВалютаДокумента",	ДокументСсылкаРасходСоСчета.ВалютаДенежныхСредств);
	КонецЕсли;
			  
  
	Запрос.УстановитьПараметр("Организация",	СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени",	Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОплатаНалога",	НСтр("ka='გადასახადის გადახდა';ru='Оплата налога';en='Payment of tax'"));
	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	
	//Паганини_
	//Если не ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата тогда
	Если ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги Тогда	
	//_Паганини
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ПОМЕСТИТЬ КурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаДокумента)) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НачислениеНалоговНалоги.СрокУплаты,
		////ПодольскийАИ #УчетПроектов 10.02.2021 {
		////Исправление ошибок. Было---
		//////+++ Дмгг
		////|	РасходСоСчета.Проект КАК Проект
		//////--- Дмгг
		////Стало+++
		//|	РасходСоСчета.ПроектДляЗачетаАвансаСПомощником КАК Проект
		////ПодольскийАИ #УчетПроектов 10.02.2021 }
		
		//_Lazare 09.03.2021
		|   ВЫБОР
		|		КОГДА 	РасходСоСчета.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|		ИНАЧЕ РасходСоСчета.ПроектДляЗачетаАвансаСПомощником
		|	КОНЕЦ КАК Проект
		//Lazare 09.03.2021
		|ПОМЕСТИТЬ ВременнаяТаблицаСрокУплаты
		|ИЗ
		|	Документ.РасходСоСчета КАК РасходСоСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеНалогов.Налоги КАК НачислениеНалоговНалоги
		|		ПО (РасходСоСчета.Ссылка = &Ссылка)
		|			И (НачислениеНалоговНалоги.Ссылка = РасходСоСчета.ДокументОснование
		|				ИЛИ НачислениеНалоговНалоги.Ссылка = РасходСоСчета.ДокументОснование.ДокументОснование)
		|			И РасходСоСчета.ВидНалога = НачислениеНалоговНалоги.ВидНалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Организация КАК Организация,
		|	ТаблицаДокумента.ВидНалога КАК ВидНалога,
		|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫБОР
		|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
		|			ТОГДА ТаблицаДокумента.ВидНалога.СчетУчетаРегл  //+++ Дмгг
		|		ИНАЧЕ ТаблицаДокумента.ВидНалога.СчетУчета
		|	КОНЕЦ КАК СчетУчета,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СрокУплаты = &ПустаяДата
		|			ТОГДА ТаблицаСрокУплаты.СрокУплаты
		|		ИНАЧЕ ТаблицаДокумента.СрокУплаты
		|	КОНЕЦ КАК СрокУплаты,
		|	&ОплатаНалога КАК СодержаниеПроводки,
		|	ТаблицаДокумента.Подотчетник КАК Сотрудник,
		////ПодольскийАИ #УчетПроектов 10.02.2021 {
		////Исправление ошибок. Было---
		//////+++ Дмгг
		////|	ТаблицаДокумента.Проект КАК Проект
		//////--- Дмгг
		////Стало+++
		//|	ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником КАК Проект
		////ПодольскийАИ #УчетПроектов 10.02.2021 }
		
		//_Lazare 09.03.2021
		|   ВЫБОР
		|		КОГДА ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|		ИНАЧЕ ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником
		|	КОНЕЦ КАК Проект
		//Lazare 09.03.2021
		|ИЗ
		|	Документ.РасходСоСчета КАК ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыДокумента
		|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыУчета
		|		ПО (КурсВалютыУчета.Валюта = &ВалютаУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСрокУплаты КАК ТаблицаСрокУплаты
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		//Паганини_
		//|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
		//_Паганини
		|";
		
		//Паганини_
		РезультатЗапроса = Запрос.Выполнить();
		врТаблицаРасчетыНДФЛ = РезультатЗапроса.Выгрузить();  
		врТаблицаРасчетыПоНалогам = врТаблицаРасчетыНДФЛ.Скопировать();	
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", Новый ТаблицаЗначений);		
		
		врТаблицаРасчетыПоНалогам.Свернуть("Период,ВидДвижения,Организация,ВидНалога,СчетУчета,СрокУплаты,СодержаниеПроводки","Сумма");
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", врТаблицаРасчетыПоНалогам);
		//_Паганини
		
	ИначеЕсли ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата Или ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам Тогда
		
		Запрос.УстановитьПараметр("НачислениеНалога",	НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога';en='tax accrual'"));
		Запрос.УстановитьПараметр("ПогашениеНалога",	НСтр("ka='გადასახადის დაფარვა';ru='Погашение налога';en='repayment of the tax'"));
	 	//Паганини#Удержания_
		Запрос.УстановитьПараметр("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении"));
	 	//_Паганини#Удержания
		Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ПОМЕСТИТЬ КурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаДокумента)) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НачислениеНалоговНалоги.СрокУплаты
		|ПОМЕСТИТЬ ВременнаяТаблицаСрокУплаты
		|ИЗ
		|	Документ.РасходСоСчета КАК РасходСоСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеНалогов.Налоги КАК НачислениеНалоговНалоги
		|		ПО (РасходСоСчета.Ссылка = &Ссылка)
		|			И (НачислениеНалоговНалоги.Ссылка = РасходСоСчета.ДокументОснование
		|				ИЛИ НачислениеНалоговНалоги.Ссылка = РасходСоСчета.ДокументОснование.ДокументОснование)
		|			И РасходСоСчета.ВидНалога = НачислениеНалоговНалоги.ВидНалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалога КАК НДФЛсНачислений,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалогаВыплат КАК НДФЛсВыплат,
		|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета КАК НДФЛсВыплатСчетУчета,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалога.СчетУчета КАК НДФЛсНачисленийСчетУчета,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК НДФЛсВыплатСчетУчетаРегл,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК НДФЛсНачисленийСчетУчетаРегл,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРегл,
		|	ПлатежнаяВедомостьСотрудники.НДФЛПлатежа,
		|	ПлатежнаяВедомостьСотрудники.НДФЛРасчетов,
		|	ПлатежнаяВедомостьСотрудники.Сотрудник,
		|	ПлатежнаяВедомостьСотрудники.Ссылка.ПериодРегистрации,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.Статья,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчетаРегл,
		|	0 КАК СуммаРасчетов,
		|	0 КАК СуммаПлатежа, //+++ Дмгг
		//+++ Дмгг
		//|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.Проект КАК Проект
		//--- Дмгг
		////ПодольскийАИ #УчетПроектов 25.11.2020 {
		//|	ВЫБОР 
		//|		КОГДА &УчетПоПроектам 
		//|			ТОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Проект
		//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		//|	КОНЕЦ КАК Проект
		////ПодольскийАИ #УчетПроектов 25.11.2020 }
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА 
		|       		ВЫбор
		|					КОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|                    ИНАЧЕ РасходСоСчетаВыплатаЗаработнойПлаты.Проект 
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	 КОНЕЦ КАК Проект 
		//Lazare_ 09.03.2021
		|ПОМЕСТИТЬ ВТ_НДФЛ
		|ИЗ
		|	Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК РасходСоСчетаВыплатаЗаработнойПлаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
		|		ПО РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость = ПлатежнаяВедомостьСотрудники.Ссылка
		|			И (РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка = &Ссылка)
		|			И (НЕ ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка))
		|			И (ЕСТЬNULL(ПлатежнаяВедомостьСотрудники.НДФЛПлатежа, 0) > 0)
		//ПодольскийАИ #УчетПроектов 25.11.2020 {
		|			И ВЫБОР 
		|				КОГДА &УчетПоПроектам 
		|					ТОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Проект = ПлатежнаяВедомостьСотрудники.Проект
		|				ИНАЧЕ Истина
		|			КОНЕЦ
		//ПодольскийАИ #УчетПроектов 25.11.2020 }
		//Паганини#Удержания_
		|	И ВЫБОР
		|			КОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
		|				ТОГДА НЕ &СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		//_Паганини#Удержания
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат,
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога.СчетУчета,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаРегл,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл,
		|	РасходИзКассыВыплатаЗаработнойПлаты.СуммаНДФЛ,
		//+++ Дмгг Неправильно заполнен набор полей тут должна быть какая-то сумма а Истина не на своем месте
		|	0, 
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.Контрагент,
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.Дата,
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.Статья,
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
		//|	ИСТИНА, 
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчетаРегл,
		|	РасходИзКассыВыплатаЗаработнойПлаты.СуммаРасчетов,
		|	РасходИзКассыВыплатаЗаработнойПлаты.СуммаПлатежа,
		//+++ Дмгг
		//|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.Проект КАК Проект
		//--- Дмгг
		////ПодольскийАИ #УчетПроектов 25.11.2020 {
		//|	ВЫБОР 
		//|		КОГДА &УчетПоПроектам 
		//|			ТОГДА РасходИзКассыВыплатаЗаработнойПлаты.Проект
		//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		//|	КОНЕЦ КАК Проект
		////ПодольскийАИ #УчетПроектов 25.11.2020 }
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА 
		|       		ВЫбор
		|					КОГДА РасходИзКассыВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|                    ИНАЧЕ РасходИзКассыВыплатаЗаработнойПлаты.Проект 
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	 КОНЕЦ КАК Проект 
		//Lazare_ 09.03.2021
		|ИЗ
		|	Документ.РасходСоСчета.РасшифровкаПлатежа КАК РасходИзКассыВыплатаЗаработнойПлаты
		|ГДЕ
		|	ЕСТЬNULL(РасходИзКассыВыплатаЗаработнойПлаты.СуммаНДФЛ, 0) > 0
		|	И РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Организация КАК Организация,
		|	ВТ_НДФЛ.ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
		|	ВТ_НДФЛ.НДФЛсНачислений КАК ВидНалога,
		//|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа КАК ЧИСЛО(15, 2)) КАК Сумма,
		//|	ВЫРАЗИТЬ(ВТ_НДФЛ.СуммаРасчетов * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаРасчетовРегл,
		|	ВЫРАЗИТЬ(ВЫБОР 
		|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам) 
		|			И ТаблицаДокумента.ВалютаДенежныхСредств = &ВалютаУчета
		|			ТОГДА ВТ_НДФЛ.СуммаПлатежа
		|		ИНАЧЕ ВТ_НДФЛ.СуммаРасчетов * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность)
		|	КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаРасчетовРегл,
		|	ВЫРАЗИТЬ(ВТ_НДФЛ.СуммаПлатежа * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаПлатежаРегл,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета КАК СчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл КАК СчетУчетаРегл,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СрокУплаты = &ПустаяДата
		|			ТОГДА ТаблицаСрокУплаты.СрокУплаты
		|		ИНАЧЕ ТаблицаДокумента.СрокУплаты
		|	КОНЕЦ КАК СрокУплаты,
		|	&НачислениеНалога КАК СодержаниеПроводки,
		|	ВТ_НДФЛ.Сотрудник,
		|	ВТ_НДФЛ.НДФЛПлатежа КАК СуммаВал,
		|	ВТ_НДФЛ.ПериодРегистрации,
		|	ТаблицаДокумента.ВалютаДенежныхСредств КАК Валюта,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		|	ВТ_НДФЛ.Статья,
		|	ВТ_НДФЛ.БанковскийСчет,
		|	ВТ_НДФЛ.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРегл,
		|	ВТ_НДФЛ.БанковскийСчетСчетУчетаРегл,
		|	ВТ_НДФЛ.СуммаРасчетов,
		|	ВТ_НДФЛ.СуммаПлатежа,
		//+++ Дмгг
		//|	ТаблицаДокумента.Проект КАК Проект
		//--- Дмгг
		////ПодольскийАИ #УчетПроектов 25.11.2020 {
		//|	ВТ_НДФЛ.Проект КАК Проект
		////ПодольскийАИ #УчетПроектов 25.11.2020 }
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВТ_НДФЛ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВТ_НДФЛ.Проект 
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ПОМЕСТИТЬ ВТ_ДанныеНДФЛ
		|ИЗ
		|	ВТ_НДФЛ КАК ВТ_НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходСоСчета КАК ТаблицаДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыДокумента
		//|			ПО РасходИзКассы.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			ПО ВЫБОР 
		|				КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам) 
		|					ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.ВалютаРасчетов  = КурсВалютыДокумента.Валюта
		|				ИНАЧЕ ТаблицаДокумента.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			КОНЕЦ
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыУчета
		|			ПО (КурсВалютыУчета.Валюта = &ВалютаУчета)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСрокУплаты КАК ТаблицаСрокУплаты
		|			ПО (ИСТИНА)
		|		ПО ВТ_НДФЛ.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Организация,
		|	ВТ_НДФЛ.ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате),
		|	ВТ_НДФЛ.НДФЛсВыплат,
		//|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа КАК ЧИСЛО(15, 2)) КАК Сумма,
		//|	ВЫРАЗИТЬ(ВТ_НДФЛ.СуммаРасчетов * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаРасчетовРегл,
		|	ВЫРАЗИТЬ(ВЫБОР 
		|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам) 
		|			И ТаблицаДокумента.ВалютаДенежныхСредств = &ВалютаУчета
		|			ТОГДА ВТ_НДФЛ.СуммаПлатежа
		|		ИНАЧЕ ВТ_НДФЛ.СуммаРасчетов * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность)
		|	КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаРасчетовРегл,
		|	ВЫРАЗИТЬ(ВТ_НДФЛ.СуммаПлатежа * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)),
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СрокУплаты = &ПустаяДата
		|			ТОГДА ТаблицаСрокУплаты.СрокУплаты
		|		ИНАЧЕ ТаблицаДокумента.СрокУплаты
		|	КОНЕЦ,
		|	&ПогашениеНалога,
		|	ВТ_НДФЛ.Сотрудник,
		|	ВТ_НДФЛ.НДФЛПлатежа,
		|	ВТ_НДФЛ.ПериодРегистрации,
		|	ТаблицаДокумента.ВалютаДенежныхСредств,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		|	ВТ_НДФЛ.Статья,
		|	ВТ_НДФЛ.БанковскийСчет,
		|	ВТ_НДФЛ.СчетУчетаКВозмещениюРегл,
		|	ВТ_НДФЛ.БанковскийСчетСчетУчетаРегл,
		|	ВТ_НДФЛ.СуммаРасчетов,
		|	ВТ_НДФЛ.СуммаПлатежа,
		//+++ Дмгг
		//|	ТаблицаДокумента.Проект КАК Проект
		//--- Дмгг
		////ПодольскийАИ #УчетПроектов 25.11.2020 {
		//|	ВТ_НДФЛ.Проект
		////ПодольскийАИ #УчетПроектов 25.11.2020 }
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВТ_НДФЛ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВТ_НДФЛ.Проект 
		|	КОНЕЦ
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВТ_НДФЛ КАК ВТ_НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходСоСчета КАК ТаблицаДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыДокумента
		//|			ПО РасходИзКассы.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			ПО ВЫБОР 
		|				КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам) 
		|					ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.ВалютаРасчетов  = КурсВалютыДокумента.Валюта
		|				ИНАЧЕ ТаблицаДокумента.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			КОНЕЦ
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыУчета
		|			ПО (КурсВалютыУчета.Валюта = &ВалютаУчета)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСрокУплаты КАК ТаблицаСрокУплаты
		|			ПО (ИСТИНА)
		|		ПО ВТ_НДФЛ.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеНДФЛ.Период,
		|	ВТ_ДанныеНДФЛ.ВидДвижения,
		|	ВТ_ДанныеНДФЛ.Организация,
		|	ВТ_ДанныеНДФЛ.ВидНачисленияУдержания,
		|	ВТ_ДанныеНДФЛ.Операция,
		|	ВТ_ДанныеНДФЛ.ВидНалога,
		|	ВТ_ДанныеНДФЛ.Сумма,
		|	ВТ_ДанныеНДФЛ.СчетУчета,
		|	ВТ_ДанныеНДФЛ.СчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.СрокУплаты,
		|	ВТ_ДанныеНДФЛ.СодержаниеПроводки,
		|	ВТ_ДанныеНДФЛ.Сотрудник,
		|	ВТ_ДанныеНДФЛ.СуммаВал,
		|	ВТ_ДанныеНДФЛ.ПериодРегистрации,
		|	ВТ_ДанныеНДФЛ.Валюта,
		|	ВТ_ДанныеНДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_ДанныеНДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_ДанныеНДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.Статья,
		|	ВТ_ДанныеНДФЛ.БанковскийСчет,
		////+++ Дмгг
		//|	ВТ_ДанныеНДФЛ.Проект КАК Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВТ_ДанныеНДФЛ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВТ_ДанныеНДФЛ.Проект
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВТ_ДанныеНДФЛ КАК ВТ_ДанныеНДФЛ";

		РезультатЗапроса = Запрос.Выполнить();
		
		врТаблицаРасчетыНДФЛ = РезультатЗапроса.Выгрузить();  
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", врТаблицаРасчетыНДФЛ);
		
		врТаблицаРасчетыПоНалогам = врТаблицаРасчетыНДФЛ.Скопировать();
		врТаблицаРасчетыПоНалогам.Свернуть("Период,ВидДвижения,Организация,ВидНалога,СчетУчета,СчетУчетаРегл,СрокУплаты,СодержаниеПроводки","Сумма");
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", врТаблицаРасчетыПоНалогам);
	
	// Kuzmich, 26.02.2019,Зарплата по ведомости в разрезе сотрудников
	ИначеЕсли ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников Тогда
		
		Запрос.УстановитьПараметр("НачислениеНалога",	НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога';en='tax accrual'"));
		Запрос.УстановитьПараметр("ПогашениеНалога",	НСтр("ka='გადასახადის დაფარვა';ru='Погашение налога';en='repayment of the tax'"));
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ПОМЕСТИТЬ КурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаДокумента)) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НачислениеНалоговНалоги.СрокУплаты
		|ПОМЕСТИТЬ ВременнаяТаблицаСрокУплаты
		|ИЗ
		|	Документ.РасходСоСчета КАК РасходСоСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеНалогов.Налоги КАК НачислениеНалоговНалоги
		|		ПО (РасходСоСчета.Ссылка = &Ссылка)
		|			И (НачислениеНалоговНалоги.Ссылка = РасходСоСчета.ДокументОснование
		|				ИЛИ НачислениеНалоговНалоги.Ссылка = РасходСоСчета.ДокументОснование.ДокументОснование)
		|			И РасходСоСчета.ВидНалога = НачислениеНалоговНалоги.ВидНалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога КАК НДФЛсНачислений,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат КАК НДФЛсВыплат,
		|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета КАК НДФЛсВыплатСчетУчета,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога.СчетУчета КАК НДФЛсНачисленийСчетУчета,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК НДФЛсВыплатСчетУчетаРегл,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК НДФЛсНачисленийСчетУчетаРегл,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРегл,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.НДФЛПлатежа,
		//|	РасходСоСчетаВыплатаЗаработнойПлаты.НДФЛПлатежа КАК НДФЛРасчетов,
		|	ПлатежнаяВедомостьСотрудники.Сотрудник,
		|	ПлатежнаяВедомостьСотрудники.Ссылка.ПериодРегистрации,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.Статья,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
		|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчетаРегл,
		//+++ Дмгг
		//|	РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка.Проект КАК Проект
		//--- Дмгг
		////ПодольскийАИ #УчетПроектов 25.11.2020 {
		//|	ВЫБОР 
		//|		КОГДА &УчетПоПроектам 
		//|			ТОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Проект
		//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		//|	КОНЕЦ КАК Проект
		////ПодольскийАИ #УчетПроектов 25.11.2020 }
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА 
		|       		ВЫбор
		|					КОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|                    ИНАЧЕ РасходСоСчетаВыплатаЗаработнойПлаты.Проект 
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	 КОНЕЦ КАК Проект 
		//Lazare_ 09.03.2021
		|ПОМЕСТИТЬ ВТ_НДФЛ
		|ИЗ
		|	Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК РасходСоСчетаВыплатаЗаработнойПлаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
		|		ПО РасходСоСчетаВыплатаЗаработнойПлаты.Ведомость = ПлатежнаяВедомостьСотрудники.Ссылка
		|			И РасходСоСчетаВыплатаЗаработнойПлаты.Сотрудник = ПлатежнаяВедомостьСотрудники.Сотрудник
		|			И (РасходСоСчетаВыплатаЗаработнойПлаты.Ссылка = &Ссылка)
		|			И (НЕ РасходСоСчетаВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка))
		|			И (ЕСТЬNULL(РасходСоСчетаВыплатаЗаработнойПлаты.НДФЛПлатежа, 0) > 0)
		//ПодольскийАИ #УчетПроектов 25.11.2020 {
		|			И ВЫБОР 
		|				КОГДА &УчетПоПроектам 
		|					ТОГДА РасходСоСчетаВыплатаЗаработнойПлаты.Проект = ПлатежнаяВедомостьСотрудники.Проект
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		//ПодольскийАИ #УчетПроектов 25.11.2020 }
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Организация КАК Организация,
		|	ВТ_НДФЛ.ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
		|	ВТ_НДФЛ.НДФЛсНачислений КАК ВидНалога,
		|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета КАК СчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл КАК СчетУчетаРегл,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СрокУплаты = &ПустаяДата
		|			ТОГДА ТаблицаСрокУплаты.СрокУплаты
		|		ИНАЧЕ ТаблицаДокумента.СрокУплаты
		|	КОНЕЦ КАК СрокУплаты,
		|	&НачислениеНалога КАК СодержаниеПроводки,
		|	ВТ_НДФЛ.Сотрудник,
		|	ВТ_НДФЛ.НДФЛПлатежа КАК СуммаВал,
		|	ВТ_НДФЛ.ПериодРегистрации,
		|	ТаблицаДокумента.ВалютаДенежныхСредств КАК Валюта,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		|	ВТ_НДФЛ.Статья,
		|	ВТ_НДФЛ.БанковскийСчет,
		|	ВТ_НДФЛ.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРегл,
		|	ВТ_НДФЛ.БанковскийСчетСчетУчетаРегл,
		////+++ Дмгг
		//|	ВТ_НДФЛ.Проект КАК Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВТ_НДФЛ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВТ_НДФЛ.Проект
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ПОМЕСТИТЬ ВТ_ДанныеНДФЛ
		|ИЗ
		|	ВТ_НДФЛ КАК ВТ_НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходСоСчета КАК ТаблицаДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыДокумента
		|			ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыУчета
		|			ПО (КурсВалютыУчета.Валюта = &ВалютаУчета)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСрокУплаты КАК ТаблицаСрокУплаты
		|			ПО (ИСТИНА)
		|		ПО ВТ_НДФЛ.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Организация,
		|	ВТ_НДФЛ.ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате) КАК Операция, //Начисленный) КАК Операция,
		|	ВТ_НДФЛ.НДФЛсВыплат,
		|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)),
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СрокУплаты = &ПустаяДата
		|			ТОГДА ТаблицаСрокУплаты.СрокУплаты
		|		ИНАЧЕ ТаблицаДокумента.СрокУплаты
		|	КОНЕЦ,
		|	&ПогашениеНалога,
		|	ВТ_НДФЛ.Сотрудник,
		|	ВТ_НДФЛ.НДФЛПлатежа,
		|	ВТ_НДФЛ.ПериодРегистрации,
		|	ТаблицаДокумента.ВалютаДенежныхСредств,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		|	ВТ_НДФЛ.Статья,
		|	ВТ_НДФЛ.БанковскийСчет,
		|	ВТ_НДФЛ.СчетУчетаКВозмещениюРегл,
		|	ВТ_НДФЛ.БанковскийСчетСчетУчетаРегл,
		//+++ Дмгг
		//|	ТаблицаДокумента.Проект КАК Проект
		//--- Дмгг
		////ПодольскийАИ #УчетПроектов 25.11.2020 {
		//|	ВТ_НДФЛ.Проект
		////ПодольскийАИ #УчетПроектов 25.11.2020 }
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВТ_НДФЛ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВТ_НДФЛ.Проект
		|	КОНЕЦ
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВТ_НДФЛ КАК ВТ_НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходСоСчета КАК ТаблицаДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыДокумента
		|			ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыУчета
		|			ПО (КурсВалютыУчета.Валюта = &ВалютаУчета)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСрокУплаты КАК ТаблицаСрокУплаты
		|			ПО (ИСТИНА)
		|		ПО ВТ_НДФЛ.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеНДФЛ.Период,
		|	ВТ_ДанныеНДФЛ.ВидДвижения,
		|	ВТ_ДанныеНДФЛ.Организация,
		|	ВТ_ДанныеНДФЛ.ВидНачисленияУдержания,
		|	ВТ_ДанныеНДФЛ.Операция,
		|	ВТ_ДанныеНДФЛ.ВидНалога,
		|	ВТ_ДанныеНДФЛ.Сумма,
		|	ВТ_ДанныеНДФЛ.СчетУчета,
		|	ВТ_ДанныеНДФЛ.СчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.СрокУплаты,
		|	ВТ_ДанныеНДФЛ.СодержаниеПроводки,
		|	ВТ_ДанныеНДФЛ.Сотрудник,
		|	ВТ_ДанныеНДФЛ.СуммаВал,
		|	ВТ_ДанныеНДФЛ.ПериодРегистрации,
		|	ВТ_ДанныеНДФЛ.Валюта,
		|	ВТ_ДанныеНДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_ДанныеНДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_ДанныеНДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.Статья,
		|	ВТ_ДанныеНДФЛ.БанковскийСчет,
		////+++ Дмгг
		//|	ВТ_ДанныеНДФЛ.Проект КАК Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ВТ_ДанныеНДФЛ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ВТ_ДанныеНДФЛ.Проект
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВТ_ДанныеНДФЛ КАК ВТ_ДанныеНДФЛ";

		//Паганини_
		РезультатЗапроса = Запрос.Выполнить();
		врТаблицаРасчетыНДФЛ = РезультатЗапроса.Выгрузить();  
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", врТаблицаРасчетыНДФЛ);		
		
		врТаблицаРасчетыПоНалогам = врТаблицаРасчетыНДФЛ.Скопировать();	
		врТаблицаРасчетыПоНалогам.Свернуть("Период,ВидДвижения,Организация,ВидНалога,СчетУчета,СчетУчетаРегл,СрокУплаты,СодержаниеПроводки","Сумма");
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", врТаблицаРасчетыПоНалогам);
		//_Паганини
	
	// Kuzmich, 26.02.2019,Зарплата по ведомости в разрезе сотрудников
	
	ИначеЕсли ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Поставщику Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(ДокументСсылкаРасходСоСчета.Дата),ДокументСсылкаРасходСоСчета.Дата,ТекущаяДата())));
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ТаблицаРасчетыПоНалогам.Дата КАК Период,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
		//_Паганини ПФ
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛНачислении КАК ВидНалога,
		|	ТаблицаРасчетыПоНалогам.Контрагент КАК Сотрудник,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ) КАК ПериодРегистрации,
		|	ТаблицаРасчетыПоНалогам.Валюта КАК Валюта,
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛ) КАК Сумма,
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛВал) КАК СуммаВал,
		|	&ПогашениеНалога КАК СодержаниеПроводки,
		////+++ Дмгг
		//|	ТаблицаРасчетыПоНалогам.Проект КАК Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ТаблицаРасчетыПоНалогам.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ТаблицаРасчетыПоНалогам.Проект
		|	КОНЕЦ КАК Проект
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчетыПоНалогам
		|ГДЕ
		|	НЕ ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
		// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
		|   И Не ТаблицаРасчетыПоНалогам.ЯвляетсяНеРезидентом
		// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
		|
		|СГРУППИРОВАТЬ ПО
		////+++ Дмгг
		//|	ТаблицаРасчетыПоНалогам.Проект,
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ТаблицаРасчетыПоНалогам.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ТаблицаРасчетыПоНалогам.Проект
		|	КОНЕЦ,
		//Lazare_ 09.03.2021
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ,
		//_Паганини ПФ
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛНачислении,
		|	ТаблицаРасчетыПоНалогам.Контрагент,
		|	ТаблицаРасчетыПоНалогам.Валюта,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ)
		|
		//Паганини ПФ_
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛ) = 0
		|
		//_Паганини ПФ
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате) КАК Операция,
		//_Паганини ПФ
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛКОплате,
		|	ТаблицаРасчетыПоНалогам.Контрагент,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ),
		|	ТаблицаРасчетыПоНалогам.Валюта,
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛ),
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛВал),
		|	&НачислениеНалога,
		////+++ Дмгг
		//|	ТаблицаРасчетыПоНалогам.Проект
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ТаблицаРасчетыПоНалогам.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ТаблицаРасчетыПоНалогам.Проект
		|	КОНЕЦ
		//Lazare_ 09.03.2021
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчетыПоНалогам
		|ГДЕ
		|	НЕ ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
		// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
		|   И Не ТаблицаРасчетыПоНалогам.ЯвляетсяНеРезидентом
		// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
		|
		|СГРУППИРОВАТЬ ПО
		////+++ Дмгг
		//|	ТаблицаРасчетыПоНалогам.Проект,
		////--- Дмгг
		//_Lazare 09.03.2021
		|	ВЫБОР 
		|		 КОГДА ТаблицаРасчетыПоНалогам.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ТаблицаРасчетыПоНалогам.Проект
		|	КОНЕЦ,
		//Lazare_ 09.03.2021
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ,
		//_Паганини ПФ
		|	ТаблицаРасчетыПоНалогам.Контрагент,
		|	ТаблицаРасчетыПоНалогам.Валюта,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ),
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛКОплате
		//Паганини ПФ_
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛ) = 0
		|
		//_Паганини ПФ
		|
		// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.ОрганизацияВНУ,
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛНачислении,
		|	ТаблицаРасчетыПоНалогам.Контрагент,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ),
		|	ТаблицаРасчетыПоНалогам.ВалютаРасчетов,
		|	ТаблицаРасчетыПоНалогам.СуммаНДФЛ,
		|	ТаблицаРасчетыПоНалогам.СуммаНДФЛВал,
		|	&ПогашениеНалога
		//_Lazare 09.03.2021
		|	,ВЫБОР 
		|		 КОГДА ТаблицаРасчетыПоНалогам.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ТаблицаРасчетыПоНалогам.Проект
		|	КОНЕЦ
		//Lazare_ 09.03.2021		
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаРасчетыПоНалогам
		|ГДЕ
		|	НЕ ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
		|	И ТаблицаРасчетыПоНалогам.ЯвляетсяНеРезидентом
		|	И Не ТаблицаРасчетыПоНалогам.ПризнакАванса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.ОрганизацияВНУ,
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛКОплате,
		|	ТаблицаРасчетыПоНалогам.Контрагент,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ),
		|	ТаблицаРасчетыПоНалогам.ВалютаРасчетов,
		|	ТаблицаРасчетыПоНалогам.СуммаНДФЛ,
		|	ТаблицаРасчетыПоНалогам.СуммаНДФЛВал,
		|	&НачислениеНалога
		//_Lazare 09.03.2021
		|	,ВЫБОР 
		|		 КОГДА ТаблицаРасчетыПоНалогам.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ТаблицаРасчетыПоНалогам.Проект
		|	КОНЕЦ
		//Lazare_ 09.03.2021		
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаРасчетыПоНалогам
		|ГДЕ
		|	НЕ ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
		|	И ТаблицаРасчетыПоНалогам.ЯвляетсяНеРезидентом
		|	И Не ТаблицаРасчетыПоНалогам.ПризнакАванса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.ОрганизацияВНУ,
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛНачислении,
		|	ТаблицаРасчетыПоНалогам.Контрагент,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ),
		|	ТаблицаРасчетыПоНалогам.ВалютаРасчетов,
		|	ТаблицаРасчетыПоНалогам.СуммаНДФЛ - (ТаблицаРасчетыПоНалогам.СуммаНДФЛВал * ТаблицаРасчетыПоНалогам.КурсПоступления / ТаблицаРасчетыПоНалогам.КратностьПоступления),
		|	0,
		|	&НачислениеНалога
		//_Lazare 09.03.2021
		|	,ВЫБОР 
		|		 КОГДА ТаблицаРасчетыПоНалогам.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|             ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|        ИНАЧЕ ТаблицаРасчетыПоНалогам.Проект
		|	КОНЕЦ
		//Lazare_ 09.03.2021		
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаРасчетыПоНалогам
		|ГДЕ
		|	НЕ ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
		|	И ТаблицаРасчетыПоНалогам.ЯвляетсяНеРезидентом
		|	И Не ТаблицаРасчетыПоНалогам.ПризнакАванса";
		// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
		
		Запрос.УстановитьПараметр("НачислениеНалога",	НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога';en='tax accrual'"));
		Запрос.УстановитьПараметр("ПогашениеНалога",	НСтр("ka='გადასახადის დაფარვა';ru='Погашение налога';en='repayment of the tax'"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		//Паганини_		
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", РезультатЗапроса.Выгрузить());
		ТаблицаНДФЛ = РезультатЗапроса.Выгрузить();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", 		ТаблицаНДФЛ);
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам",	ТаблицаНДФЛ);
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", 		Новый ТаблицаЗначений);		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам",	Новый ТаблицаЗначений);
		//_Паганини
	КонецЕсли;	
	
КонецПроцедуры

&Вместо("СформироватьТаблицаУправленческий")
Процедура РасшAzRy_СформироватьТаблицаУправленческий(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", Новый ТаблицаЗначений);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("Содержание", НСтр("ka='ფულადი სახსრების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание денежных средств на произвольный счет';en='Debiting an arbitrary score'"));
	Запрос.УстановитьПараметр("СодержаниеСнятиеНаличных", НСтр("ka='Оприходование денежных средств в кассу';ru='Оприходование денежных средств в кассу';en='Posting of cash on hand'"));
	Запрос.УстановитьПараметр("ОплатаНалога", НСтр("ka='გადასახადის გადახდა';ru='Оплата налога';en='Payment of tax'"));
	Запрос.УстановитьПараметр("СодержаниеОплатаОтБанкаЭквайрера", НСтр("ka='გადახდა ეკვაირერი ბანკისგან';ru='Оплата от банка-эквайрера';en='Payment by the acquirer'"));
	Запрос.УстановитьПараметр("СодержаниеКомиссияБанкаЭквайрера", НСтр("ka='ბანკი-ექვაირერის კომისია';ru='Комиссия банка-эквайрера';en='the acquirer Commission'"));
	
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ИспользуютсяПереводыВПути",РегистрыСведений.ПрименениеПереводовВПути.ИспользуютсяПереводыВПути(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата,СтруктураДополнительныеСвойства.ДляПроведения.Организация));
	//Паганини
	//Добавлена таблица 18;
	Запрос.УстановитьПараметр("НДФЛ", НСтр("ka='საშემოსავლო';ru='НДФЛ';en='НДФЛ'"));
	Запрос.УстановитьПараметр("КурсоваяРазницаНДФЛ", НСтр("ka='Курсовая разница НДФЛ';ru='Курсовая разница НДФЛ';en='The exchange rate difference of personal income tax'"));
	//_Паганини
	
	Запрос.УстановитьПараметр("ВозникновениеАвансаПоставщику", "Возникновение аванса поставщику");
	Запрос.УстановитьПараметр("ПогашениеОбязательствПередПоставщиком", НСтр("ka='მომწოდებლის წინაშე ვალდებულებების დაფარვა';ru='Погашение обязательств перед поставщиком';en='Repayment of liabilities to the supplier'"));
	Запрос.УстановитьПараметр("ДатаСреза", СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.ОрганизацияВНУ КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл КАК СчетДт,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл.Валютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалДт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалКт,
	|	ТаблицаДокумента.СуммаУчета КАК Сумма,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ КАК Содержание,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ТаблицаДокумента.БанковскийСчет КАК БанковскийСчет,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт3,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт3
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	НЕ ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.ОрганизацияВНУ,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаДокумента.СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаАвансовПоставщикуРегл.Валютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаАвансовПоставщикуРегл.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.БанковскийСчет,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.ОрганизацияВНУ,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаДокумента.НДФЛсНачисленийСчетУчетаРегл,
	|	ТаблицаДокумента.НДФЛсВыплатСчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НДФЛсНачисленийСчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НДФЛсВыплатСчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НДФЛсНачисленийСчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаНДФЛВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НДФЛсВыплатСчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаНДФЛВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаНДФЛ,
	|	&НДФЛ,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.БанковскийСчет,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.ОрганизацияВНУ,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	УчетнаяПолитикаРегл.СчетОтрицательнаяКурсоваяРазницаКонвертация,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаРегл.СчетОтрицательнаяКурсоваяРазницаКонвертация.Валютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл.Валютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаРегл.СчетОтрицательнаяКурсоваяРазницаКонвертация.Валютный
	|			ТОГДА 0
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл.Валютный
	|			ТОГДА 0
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета - ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.КурсПоступления / ТаблицаДокумента.КратностьПоступления,
	|	&КурсоваяРазница,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.БанковскийСчет,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&ДатаСреза, ) КАК УчетнаяПолитикаРегл
	|		ПО ТаблицаДокумента.ОрганизацияВНУ = УчетнаяПолитикаРегл.Организация
	|ГДЕ
	|	НЕ ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.ОрганизацияВНУ,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	УчетнаяПолитикаРегл.СчетОтрицательнаяКурсоваяРазницаКонвертация,
	|	ТаблицаДокумента.НДФЛсНачисленийСчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаРегл.СчетОтрицательнаяКурсоваяРазницаКонвертация.Валютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НДФЛсНачисленийСчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ТаблицаДокумента.СуммаНДФЛ - ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления / ТаблицаДокумента.КратностьПоступления,
	|	&КурсоваяРазница,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.БанковскийСчет,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&ДатаСреза, ) КАК УчетнаяПолитикаРегл
	|		ПО ТаблицаДокумента.ОрганизацияВНУ = УчетнаяПолитикаРегл.Организация
	|ГДЕ
	|	НЕ ТаблицаДокумента.ПризнакАванса";
	
	

	РезультатЗапроса = Запрос.Выполнить();
	
	// +++ { AzRy - [05.05.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment: სუბკონტოების შევსება
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", РезультатЗапроса.Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", РезультатЗапроса.Выгрузить().СкопироватьКолонки());
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл  
		НоваяПроводка = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();		
		ЗаполнитьЗначенияСвойств(НоваяПроводка, Выборка);
		
		ЗначенияСубконто = Новый Структура("Контрагенты, Договоры, КонтрагентыСотрудники, БанковскийСчет, Статья, ВалютаДт, ВалютаКт", Выборка.Контрагент, Выборка.Договор, Выборка.Контрагент, Выборка.БанковскийСчет, Выборка.Статья, Выборка.ВалютаДт, Выборка.ВалютаКт);	
		AzRyБухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, ЗначенияСубконто, НоваяПроводка, Выборка, "Дт");
		AzRyБухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, ЗначенияСубконто, НоваяПроводка, Выборка, "Кт");
	КонецЦикла;
	// +++ } AzRy - [05.05.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment: სუბკონტოების შევსება	
	
КонецПроцедуры

// 
Процедура СформироватьТаблицаДекларация_РасходСоСчета(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт

	Если ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата ИЛИ
		 ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении"));
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВременнаяТаблицаРасчетыСПерсоналом.Дата КАК Период,
			|	ВременнаяТаблицаРасчетыСПерсоналом.Организация,
			|	ВременнаяТаблицаРасчетыСПерсоналом.Сотрудник КАК Получатель,
			|	ВЫРАЗИТЬ(ВременнаяТаблицаРасчетыСПерсоналом.ВидУдержанияНДФЛ КАК Справочник.ВидыНачисленийИУдержаний).СтавкаНДФЛ КАК СтавкаНДФЛ,
			|	СУММА(ВременнаяТаблицаРасчетыСПерсоналом.Сумма + ВременнаяТаблицаРасчетыСПерсоналом.СуммаНДФЛ + ВременнаяТаблицаРасчетыСПерсоналом.СуммаПФ) КАК СуммаВыдачи,
			|	СУММА(ВременнаяТаблицаРасчетыСПерсоналом.СуммаНДФЛ) КАК СуммаНДФЛ,
			|	СУММА(ВременнаяТаблицаРасчетыСПерсоналом.СуммаПФ) КАК СуммаПФСотрудника,
			|	СУММА(ВременнаяТаблицаРасчетыСПерсоналом.СуммаПФ) КАК СуммаПФОрганизации,
			|	СУММА(ВЫБОР
			|			КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ВременнаяТаблицаРасчетыСПерсоналом.ВидУдержанияНДФЛ КАК Справочник.ВидыНачисленийИУдержаний).СтавкаНДФЛ, 0) = 0
			|				ТОГДА ВременнаяТаблицаРасчетыСПерсоналом.Сумма + ВременнаяТаблицаРасчетыСПерсоналом.СуммаНДФЛ + ВременнаяТаблицаРасчетыСПерсоналом.СуммаПФ
			|			ИНАЧЕ ВременнаяТаблицаРасчетыСПерсоналом.СуммаПФ + ВременнаяТаблицаРасчетыСПерсоналом.СуммаЛгот
			|		КОНЕЦ) КАК СуммаЛьготы,
			|   ВременнаяТаблицаРасчетыСПерсоналом.Проект
			|ИЗ
			|	ВременнаяТаблицаРасчетыСПерсоналом КАК ВременнаяТаблицаРасчетыСПерсоналом
			|ГДЕ
			|	ВЫБОР
			|			КОГДА ВременнаяТаблицаРасчетыСПерсоналом.ВедомостьВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
			|				ТОГДА НЕ &СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВременнаяТаблицаРасчетыСПерсоналом.Организация,
			|	ВременнаяТаблицаРасчетыСПерсоналом.Сотрудник,
			|	ВременнаяТаблицаРасчетыСПерсоналом.Дата,
			|	ВременнаяТаблицаРасчетыСПерсоналом.Проект,
			|	ВЫРАЗИТЬ(ВременнаяТаблицаРасчетыСПерсоналом.ВидУдержанияНДФЛ КАК Справочник.ВидыНачисленийИУдержаний).СтавкаНДФЛ";
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДекларация", Запрос.Выполнить().Выгрузить());
	ИначеЕсли ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Поставщику Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВременнаяТаблицаРасчетыСПоставщиками.Дата КАК Период,
			|	ВременнаяТаблицаРасчетыСПоставщиками.Организация,
			|	ВременнаяТаблицаРасчетыСПоставщиками.Контрагент КАК Получатель,
			|	ВременнаяТаблицаРасчетыСПоставщиками.Договор,
			// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
			//|	СУММА(ВременнаяТаблицаРасчетыСПоставщиками.Сумма - ВременнаяТаблицаРасчетыСПоставщиками.СуммаНДС + ВременнаяТаблицаРасчетыСПоставщиками.СуммаНДФЛ + ВременнаяТаблицаРасчетыСПоставщиками.СуммаПФ) КАК СуммаВыдачи,
			|	СУММА(ВременнаяТаблицаРасчетыСПоставщиками.Сумма + ВременнаяТаблицаРасчетыСПоставщиками.СуммаНДФЛ) КАК СуммаВыдачи,
			// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:			
			|	СУММА(ВременнаяТаблицаРасчетыСПоставщиками.СуммаНДФЛ) КАК СуммаНДФЛ,
			|	СУММА(ВременнаяТаблицаРасчетыСПоставщиками.СуммаПФ) КАК СуммаПФСотрудника,
			|	СУММА(ВременнаяТаблицаРасчетыСПоставщиками.СуммаПФ) КАК СуммаПФОрганизации,
			|	СУММА(ВЫБОР
			|			КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ВременнаяТаблицаРасчетыСПоставщиками.ВидУдержанияНДФЛ КАК Справочник.ВидыНачисленийИУдержаний).СтавкаНДФЛ, 0) = 0
			|				ТОГДА ВременнаяТаблицаРасчетыСПоставщиками.Сумма - ВременнаяТаблицаРасчетыСПоставщиками.СуммаНДС + ВременнаяТаблицаРасчетыСПоставщиками.СуммаНДФЛ + ВременнаяТаблицаРасчетыСПоставщиками.СуммаПФ
			|			ИНАЧЕ ВременнаяТаблицаРасчетыСПоставщиками.СуммаПФ
			|		КОНЕЦ) КАК СуммаЛьготы,
			|	ВЫРАЗИТЬ(ВременнаяТаблицаРасчетыСПоставщиками.ВидУдержанияНДФЛ КАК Справочник.ВидыНачисленийИУдержаний).СтавкаНДФЛ КАК СтавкаНДФЛ,
			|   ВременнаяТаблицаРасчетыСПоставщиками.Проект
			|ИЗ
			|	ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблицаРасчетыСПоставщиками
			|ГДЕ
			|	ВременнаяТаблицаРасчетыСПоставщиками.Договор.УчитыватьНДФЛ
			|	И НЕ ВременнаяТаблицаРасчетыСПоставщиками.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
			|   И ВременнаяТаблицаРасчетыСПоставщиками.ВидДвижения <> ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВременнаяТаблицаРасчетыСПоставщиками.Организация,
			|	ВременнаяТаблицаРасчетыСПоставщиками.Контрагент,
			|	ВременнаяТаблицаРасчетыСПоставщиками.Договор,
			|	ВременнаяТаблицаРасчетыСПоставщиками.Дата,
			|	ВременнаяТаблицаРасчетыСПоставщиками.Проект,
			|	ВЫРАЗИТЬ(ВременнаяТаблицаРасчетыСПоставщиками.ВидУдержанияНДФЛ КАК Справочник.ВидыНачисленийИУдержаний).СтавкаНДФЛ";
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДекларация", Запрос.Выполнить().Выгрузить());		
	ИначеЕсли ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВременнаяТаблицаРасчетыСПоставщиками.Период КАК Период,
			|	ВременнаяТаблицаРасчетыСПоставщиками.Организация,
			|	ВременнаяТаблицаРасчетыСПоставщиками.Сотрудник КАК Получатель,
			|	NULL КАК Договор,
			//|	Сумма(ВременнаяТаблицаРасчетыСПоставщиками.СуммаРасчетов + ВременнаяТаблицаРасчетыСПоставщиками.Сумма) КАК СуммаВыдачи,  //+++ Дмгг
			//|	Сумма(ВременнаяТаблицаРасчетыСПоставщиками.СуммаРасчетовРегл + ВременнаяТаблицаРасчетыСПоставщиками.Сумма) КАК СуммаВыдачи,  //+++ Дмгг
			//|	Сумма(ВременнаяТаблицаРасчетыСПоставщиками.СуммаРасчетов + ВременнаяТаблицаРасчетыСПоставщиками.Сумма) КАК СуммаВыдачи, //+++ Дмгг
			|	Сумма(ВременнаяТаблицаРасчетыСПоставщиками.СуммаРасчетовРегл + ВременнаяТаблицаРасчетыСПоставщиками.Сумма) КАК СуммаВыдачи,  //+++ Дмгг
			|	Сумма(ВременнаяТаблицаРасчетыСПоставщиками.Сумма) КАК СуммаНДФЛ,
			|	0 КАК СуммаПФСотрудника,
			|	0 КАК СуммаПФОрганизации,
			|	0 КАК СуммаЛьготы,
			|	ВЫРАЗИТЬ(ВременнаяТаблицаРасчетыСПоставщиками.ВидНачисленияУдержания КАК Справочник.ВидыНачисленийИУдержаний).СтавкаНДФЛ КАК СтавкаНДФЛ,
			|   ВременнаяТаблицаРасчетыСПоставщиками.Проект
			|ИЗ
			|	ВТ_ДанныеНДФЛ КАК ВременнаяТаблицаРасчетыСПоставщиками,
			|	Константа.НациональнаяВалюта КАК НациональнаяВалюта
			|ГДЕ
			|	ВременнаяТаблицаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВременнаяТаблицаРасчетыСПоставщиками.Организация,
			|	ВременнаяТаблицаРасчетыСПоставщиками.Сотрудник,
			|	ВременнаяТаблицаРасчетыСПоставщиками.Период,
			|	ВременнаяТаблицаРасчетыСПоставщиками.Проект,
			|	ВЫРАЗИТЬ(ВременнаяТаблицаРасчетыСПоставщиками.ВидНачисленияУдержания КАК Справочник.ВидыНачисленийИУдержаний).СтавкаНДФЛ";
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДекларация", Запрос.Выполнить().Выгрузить());	
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДекларация", Новый ТаблицаЗначений);
	КонецЕсли;
	
КонецПроцедуры

&После("СформироватьТаблицаРасчетыСПодотчетниками")
Процедура РасшAzRy_СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Если ДокументСсылкаРасходСоСчета.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.AzRyПоставщикуПодотчетнику Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		ТекстЗапроса = "       
		| УНИЧТОЖИТЬ ВременнаяТаблицаРасчетыСПодотчетниками 
		|"; 
		
		Запрос.Текст = ТекстЗапроса; 
		Запрос.Выполнить();
		
		ТекстЗапроса = "       
		| УНИЧТОЖИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками 
		|"; 
		
		Запрос.Текст = ТекстЗапроса; 
		Запрос.Выполнить();
		
		ТекстЗапроса = "       
		| УНИЧТОЖИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетникамиРегл 
		|"; 
		
		Запрос.Текст = ТекстЗапроса; 
		Запрос.Выполнить();			
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
		Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
		Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
		Запрос.УстановитьПараметр("ВозникновениеДолгаПодотчетника", НСтр("ka='საქვეანგარიშო პირის ვალის წარმოშობა';ru='Возникновение долга подотчетника';en='The emergence of debt podotchetnika'"));
		Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
		Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
		Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
		
		//ПодольскийАИ #УчетПроектов 09.02.2021 {
		Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
		//ПодольскийАИ #УчетПроектов 09.02.2021 }
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	1 КАК НомерСтроки,
		|	&ВозникновениеДолгаПодотчетника КАК СодержаниеПроводки,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ТаблицаДокумента.Ссылка.БанковскийСчет КАК БанковскийСчет,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.Ссылка.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
		|			ТОГДА &Ссылка
		|		ИНАЧЕ ТаблицаДокумента.Ссылка.Документ
		|	КОНЕЦ КАК Документ,
		|	ТаблицаДокумента.Ссылка.Подотчетник КАК Сотрудник,
		|	ТаблицаДокумента.Ссылка.Дата КАК Дата,
		|	&Организация КАК Организация,
		// +++ { AzRy - [25.08.2021] - Jira:ERPM-259 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:		
		|	ТаблицаДокумента.AzRyВалюта КАК Валюта,
		|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,		
		|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал,
		//|	ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств КАК Валюта,		
		//|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.СуммаДокумента * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,		
		//|	СУММА(ТаблицаДокумента.Ссылка.СуммаДокумента) КАК СуммаВал,
		// +++ } AzRy - [25.08.2021] - Jira:ERPM-259 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:
		|	0 КАК СуммаДляОстатка,
		|	0 КАК СуммаВалДляОстатка,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
		|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник.СчетРасчетовСПодотчетниками
		|		ИНАЧЕ ТаблицаДокумента.Ссылка.Подотчетник.СчетРасчетовПоПерерасходу
		|	КОНЕЦ СчетУчета,
		|	ТаблицаДокумента.Ссылка.Статья КАК Статья,
		//+++ Дмгг
		//|	ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником КАК Проект,
		//--- Дмгг
		//_Lazare 26.02.2021
		|   ВЫБОР
		|		КОГДА ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|		ИНАЧЕ ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником
		|	КОНЕЦ КАК Проект,
		//_Lazare 26.02.2021
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
		|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник.СчетРасчетовСПодотчетникамиРегл
		|		ИНАЧЕ ТаблицаДокумента.Ссылка.Подотчетник.СчетРасчетовПоПерерасходуРегл
		|	КОНЕЦ КАК СчетУчетаРегл
		|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПодотчетниками
		|ИЗ
		|	Документ.РасходСоСчета.РасшифровкаПлатежа КАК ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
		|		ПО ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств = КурсыВалютРасчетов.Валюта
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.AzRyПоставщикуПодотчетнику)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Ссылка.БанковскийСчет,
		|	ТаблицаДокумента.Ссылка.Подотчетник,
		|	ТаблицаДокумента.Ссылка.Дата,		
		// +++ { AzRy - [25.08.2021] - Jira:ERPM-259 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:		
		|	ТаблицаДокумента.AzRyВалюта,
		//|	ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств,
		// +++ } AzRy - [25.08.2021] - Jira:ERPM-259 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:				
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.Ссылка.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
		|			ТОГДА &Ссылка
		|		ИНАЧЕ ТаблицаДокумента.Ссылка.Документ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
		|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник.СчетРасчетовСПодотчетниками
		|		ИНАЧЕ ТаблицаДокумента.Ссылка.Подотчетник.СчетРасчетовПоПерерасходу
		|	КОНЕЦ,
		|	ТаблицаДокумента.Ссылка.Статья,
		//+++ Дмгг
		//|	ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником,
		//--- Дмгг
		//_Lazare 26.02.2021
		|   ВЫБОР
		|		КОГДА ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|		ИНАЧЕ ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником
		|	КОНЕЦ,
		//_Lazare 26.02.2021
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
		|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник.СчетРасчетовСПодотчетникамиРегл
		|		ИНАЧЕ ТаблицаДокумента.Ссылка.Подотчетник.СчетРасчетовПоПерерасходуРегл
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Сотрудник,
		|	Валюта,
		|	Документ,
		|	СчетУчета,
		|	СчетУчетаРегл,
		|	Проект";//+++
		
		Запрос.Выполнить();
		
		// Установка исключительной блокировки контролируемых остатков расчетов с подотчетными лицами.
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВременнаяТаблицаРасчетыСПодотчетниками.Организация КАК Организация,
		|	ВременнаяТаблицаРасчетыСПодотчетниками.Сотрудник КАК Сотрудник,
		|	ВременнаяТаблицаРасчетыСПодотчетниками.Валюта КАК Валюта,
		|	ВременнаяТаблицаРасчетыСПодотчетниками.Документ КАК Документ
		//+++ Дмгг
		//|	ВременнаяТаблицаРасчетыСПодотчетниками.Проект КАК Проект
		//--- Дмгг
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПодотчетниками КАК ВременнаяТаблицаРасчетыСПодотчетниками";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПодотчетниками");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		
		Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
		КонецЦикла;
		Блокировка.Заблокировать();
		
		НомерЗапроса = 0;
		Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПодотчетниками(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		НомерЗапроса = 0;
		Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПодотчетникамиРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПодотчетниками", МассивРезультатов[НомерЗапроса].Выгрузить());	
		
	КонецЕсли; 	 
	
КонецПроцедуры

&Вместо("СформироватьТаблицаДенежныеСредства")
Процедура РасшAzRy_СформироватьТаблицаДенежныеСредства(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("РасходДенежныхСредств", НСтр("ka='ფულადი სახსრების დანახარჯი';ru='Расход денежных средств';en='Flow of funds'"));
	Запрос.УстановитьПараметр("ПеремещениеДенежныхСредств", НСтр("ka='ფულადი სახსრების გადაადგილება';ru='Перемещение денежных средств';en='Moving funds'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ИспользуютсяПереводыВПути",РегистрыСведений.ПрименениеПереводовВПути.ИспользуютсяПереводыВПути(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата,СтруктураДополнительныеСвойства.ДляПроведения.Организация));
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаДС", ДокументСсылкаРасходСоСчета.ВалютаДенежныхСредств);
	
	
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	Если ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь") Тогда
		Итог = ДокументСсылкаРасходСоСчета.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	Иначе
		Итог = 0;
	КонецЕсли;
	ОстатокСуммы = ДокументСсылкаРасходСоСчета.СуммаДокумента - Итог;
	Запрос.УстановитьПараметр("ПлатежныйКалендарь", ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"));
	Запрос.УстановитьПараметр("ОстатокСуммы", ОстатокСуммы);
	Запрос.УстановитьПараметр("УчетВалютныхОпераций", ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	1 КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|				ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|		ИНАЧЕ &РасходДенежныхСредств
	|	КОНЕЦ КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные) КАК ТипДенежныхСредств,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	ТаблицаДокумента.БанковскийСчет КАК БанковскийСчетКасса,
	|	ТаблицаДокумента.АналитикаДДС КАК Аналитика,
	|	ТаблицаДокумента.ВалютаДенежныхСредств КАК Валюта,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(&ОстатокСуммы) КАК СуммаВал,
	|	-СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаДляОстатка,
	|	-СУММА(&ОстатокСуммы) КАК СуммаВалДляОстатка,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчета КАК СчетУчета,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл КАК СчетУчетаРегл,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект КАК Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare_ 26.02.2021	
	|	ТаблицаДокумента.ЭтоПеремещение КАК ЭтоПеремещение
	|ПОМЕСТИТЬ ВременнаяТаблицаДенежныеСредства
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	// +++ { AzRy - [25.08.2021] - Jira:ERPM-259 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:	
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.AzRyПоставщикуПодотчетнику)
	// +++ } AzRy - [25.08.2021] - Jira:ERPM-259 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПенсионномуФонду)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|				И &ИспользуютсяПереводыВПути)
	|	И &ОстатокСуммы > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|				ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|		ИНАЧЕ &РасходДенежныхСредств
	|	КОНЕЦ,
	|	ТаблицаДокумента.АналитикаДДС,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&РасходДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	////+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	(ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|				И &ИспользуютсяПереводыВПути)
	|	И &ПлатежныйКалендарь
	|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС,
	////+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&РасходДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	////+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ЛОЖЬ
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	(ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Поставщику)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Покупателю))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	////+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	МАКСИМУМ(ВыплатаЗаработнойПлаты.НомерСтроки),
	|	&РасходДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ВЫБОР
	|		КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.Сотрудник
	|	КОНЕЦ,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаПлатежа),
	|	-СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(ПлатежнаяВедомостьСотрудники.СуммаПлатежа),
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчета,	
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчетаРегл,
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВыплатаЗаработнойПлаты.Проект,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|			ПО ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|		ПО ПлатежнаяВедомостьСотрудники.Ссылка = ВыплатаЗаработнойПлаты.Ведомость
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	|		И ПлатежнаяВедомостьСотрудники.Проект = ВыплатаЗаработнойПлаты.Проект
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	////_Lazare 26.02.2021
	//|   ВЫБОР
	//|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	//|	КОНЕЦ,
	////Lazare_ 26.02.2021
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВыплатаЗаработнойПлаты.Ссылка = &Ссылка
	|	И ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Зарплата)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчета,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчетаРегл,
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВыплатаЗаработнойПлаты.Проект,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВЫБОР
	|		КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.Сотрудник
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	2,
	|	&ПеремещениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.СчетКонтрагента,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(&ОстатокСуммы),
	|	-СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(&ОстатокСуммы),
	|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	////--- Дмгг
    //_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|	И НЕ &ИспользуютсяПереводыВПути
	|	И &ОстатокСуммы > 0
	|	И НЕ ТаблицаДокумента.ЭтоПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл,
	|	ТаблицаДокумента.СчетКонтрагента,
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&ПеремещениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|	И НЕ &ИспользуютсяПереводыВПути
	|	И &ПлатежныйКалендарь
	|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	1,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.СчетКонтрагента,
	|	ТаблицаДокумента.АналитикаДДС,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(&ОстатокСуммы),
	|	-СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(&ОстатокСуммы),
	|	ТаблицаДокумента.СчетКонтрагента.СчетУчета,
	|	ТаблицаДокумента.СчетКонтрагента.СчетУчетаРегл,
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|				И &ИспользуютсяПереводыВПути)
	|	И &ОстатокСуммы > 0
	|	И ТаблицаДокумента.ЭтоПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.СчетКонтрагента,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.СчетКонтрагента.СчетУчета,
	|	ТаблицаДокумента.СчетКонтрагента.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|	КОНЕЦ,
	|	ТаблицаДокумента.АналитикаДДС,
	////+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&РасходДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	//|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента
	|	ВЫБОР 
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС 
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента.СчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента.СчетУчетаРегл,
	////+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	(ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|				И &ИспользуютсяПереводыВПути
	|				И ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение)
	|	И &ПлатежныйКалендарь
	|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа > 0
	|	И ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	//|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента,
	|	ВЫБОР 
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС 
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента.СчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента.СчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	9,
	|	2,
	|	&ПеремещениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.СчетКонтрагента,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(&ОстатокСуммы),
	|	-СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(&ОстатокСуммы),
	|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл,
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|	И НЕ &ИспользуютсяПереводыВПути
	|	И &ОстатокСуммы > 0
	|	И ТаблицаДокумента.ЭтоПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчета,
	|	ТаблицаДокумента.БанковскийСчет.СчетУчетаРегл,
	|	ТаблицаДокумента.СчетКонтрагента,
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	10,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&ПеремещениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|	И НЕ &ИспользуютсяПереводыВПути
	|	И &ПлатежныйКалендарь
	|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа > 0
	|	И ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКонтрагента,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ВременнаяТаблицаРасшифровкаПлатежа.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	11,
	|	1,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|				ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|		ИНАЧЕ &РасходДенежныхСредств
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные),
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.АналитикаДДС,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(&ОстатокСуммы),
	|	-СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(&ОстатокСуммы),
	|	ТаблицаДокумента.АналитикаДДС.СчетУчета,
	|	ТаблицаДокумента.АналитикаДДС.СчетУчетаРегл,
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.ЭтоПеремещение
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Подотчетнику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Прочее)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.НаРасходы)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.Налоги)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|				И &ИспользуютсяПереводыВПути)
	|	И &ОстатокСуммы > 0
	|	И ТаблицаДокумента.ЭтоПеремещение
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.АналитикаДДС.СчетУчета,
	|	ТаблицаДокумента.АналитикаДДС.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет)
	|				ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|		ИНАЧЕ &РасходДенежныхСредств
	|	КОНЕЦ,
	|	ТаблицаДокумента.АналитикаДДС,
	|	ТаблицаДокумента.ЭтоПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	12,
	|	ВыплатаЗаработнойПлаты.НомерСтроки,
	|	&РасходДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ВыплатаЗаработнойПлаты.Сотрудник,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(ВыплатаЗаработнойПлаты.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(ВыплатаЗаработнойПлаты.СуммаПлатежа),
	|	-СУММА(ВЫРАЗИТЬ(ВыплатаЗаработнойПлаты.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(ВыплатаЗаработнойПлаты.СуммаПлатежа),
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчета,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчетаРегл,
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВыплатаЗаработнойПлаты.Проект,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	|	КОНЕЦ,
	//Lazare_ 26.02.2021
	|	ЛОЖЬ
	|ИЗ
	|	Документ.РасходСоСчета.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВыплатаЗаработнойПлаты.Ссылка = &Ссылка
	|	И ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчета,
	|	ВыплатаЗаработнойПлаты.Ссылка.БанковскийСчет.СчетУчетаРегл,
	|	ВыплатаЗаработнойПлаты.НомерСтроки,
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	//|	ВыплатаЗаработнойПлаты.Проект,
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	|	КОНЕЦ,
	|	ВыплатаЗаработнойПлаты.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ТипДенежныхСредств,
	|	БанковскийСчетКасса,
	|	Валюта,
	|	СчетУчета,
	//+++ Дмгг
	//|	Проект,
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ Проект
	|	КОНЕЦ,
	//_Lazare 26.02.2021
	|	СчетУчетаРегл"; //+++ Дмгг
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков денежных средств.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВременнаяТаблицаДенежныеСредства.Организация КАК Организация,
	|	ВременнаяТаблицаДенежныеСредства.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ВременнаяТаблицаДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ВременнаяТаблицаДенежныеСредства.Валюта КАК Валюта,
	//+++ Дмгг
	//|	ВременнаяТаблицаДенежныеСредства.Проект
	//--- Дмгг
	//_Lazare 26.02.2021
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаДенежныеСредства.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаДенежныеСредства.Проект
	|	КОНЕЦ КАК Проект
	//_Lazare 26.02.2021
	|ИЗ
	|	ВременнаяТаблицаДенежныеСредства КАК ВременнаяТаблицаДенежныеСредства";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДенежныеСредства");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредства(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредстваРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", МассивРезультатов[НомерЗапроса].Выгрузить());
		
КонецПроцедуры

//Процедура ОтразитьДекларация(ДополнительныеСвойства, Движения, Отказ) Экспорт//Паганини
//	
//	Если НЕ ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаДекларация") Тогда 
//		Возврат;
//	КонецЕсли;
//	
//	ТаблицаДекларация = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДекларация;
//	
//	Если Отказ ИЛИ ТаблицаДекларация.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ДвиженияДекларация = Движения.Декларация;
//	ДвиженияДекларация.Записывать = Истина;
//	ДвиженияДекларация.Загрузить(ТаблицаДекларация);
//	
//КонецПроцедуры
 