
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьВнутреннийЗаказ(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.РазмерСтраницы = "A4";
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьВнутреннийЗаказ(ТабДок, ПараметрКоманды)
	Документы.ВнутреннийЗаказ.ПечатьВнутреннийЗаказ(ТабДок, ПараметрКоманды);
КонецПроцедуры
