
Функция ПолучитьТокенИзURL(ТекущийURL) Экспорт
	
	НачалоТокена = Найти(ТекущийURL, "access_token=") + 13;
	КонецТокена = Найти(Сред(ТекущийURL, НачалоТокена), "&") - 1;
	Если КонецТокена > -1 Тогда 
		Возврат Сред(ТекущийURL, НачалоТокена, КонецТокена);
	Иначе
		Возврат Сред(ТекущийURL, НачалоТокена);	
	КонецЕсли;	
	
КонецФункции

//Процедура ВыгрузитьДокументВБанк(Ссылки) Экспорт 
//	
//	ОчиститьСообщения();
//	ТекстСообщения = "";
//	Отказ = Ложь;

//	ТекПользователь 	= ИнтеграцияСБанком_НаСервере.АвторизованныйПользователь();
//	Организация 		= СлужебныйМодульСерверПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяОрганизация");
//	УчетнаяПолитика 	= СлужебныйМодульЗаполнениеОбъектов.УчетнаяПолитика(Организация,	ТекущаяДата());
//	ВалютаУчета			= УчетнаяПолитика.ВалютаУчета;
//	
//	ПолученныеТаблицы = ИнтеграцияСБанком_НаСервере.ТаблицаДокументов(Ссылки);
//	
//	//Некорректные документы_
//	МассивНекорректныхДокументов 	= ПолученныеТаблицы.МассивНекорректныхДокументов;
//	Для Каждого Некорректный_Документ Из МассивНекорректныхДокументов Цикл 
//		ТекстСообщения = НСтр("ru = 'Выгрузка в банк для документа: """+Некорректный_Документ+""" невозможна'; ka = 'დოკუმენტის """+Некорректный_Документ+""" ბანკში გადატვირთვა არ არის შესაძლებელი'");
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
//	КонецЦикла;
//	//_Некорректные документы
//	
//	МассивДокументов_BAGAGE22 		= ПолученныеТаблицы.МассивДокументов_BAGAGE22;
//	МассивДокументов_TBCBGE22 		= ПолученныеТаблицы.МассивДокументов_TBCBGE22;
//	МассивДокументов_TBCBGE22_Batch = ПолученныеТаблицы.МассивДокументов_TBCBGE22_Batch;
//	Если (МассивДокументов_BAGAGE22.Количество() = 0) И (МассивДокументов_TBCBGE22.Количество() = 0) И (МассивДокументов_TBCBGE22_Batch.Количество() = 0) Тогда
//		ТекстСообщения = НСтр("ru = 'Не найдены документы для выгрузки в банк!'; ka = 'ასატვირთი დოკუმენტები ვერ მოიძებნა!'");
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
//		Возврат;
//	КонецЕсли;
//	
//	Если МассивДокументов_BAGAGE22.Количество() > 0 Тогда
//		
//		СтруктураВсехПараметров = ПолучитьСтруктуруВсехПараметров();
//		Токен					= ИнтеграцияСБанком_НаСервере.ПолучитьТокенИзБазы();
//		
//		Если ЗначениеЗаполнено(Токен) Тогда
//			Параметры = Новый Структура("МассивДокументов_BAGAGE22", МассивДокументов_BAGAGE22);
//			ПройтиАвторизацию(Токен, Параметры)
//		Иначе
//			Оповещение	= Новый ОписаниеОповещения("ПройтиАвторизацию", ИнтеграцияСБанком_НаКлиенте, Новый Структура("МассивДокументов_BAGAGE22", МассивДокументов_BAGAGE22));
//			ОткрытьФорму("Обработка.ИнтеграцияСБанком.Форма.Форма", Новый Структура("ИзДокумента", Истина),	ИнтеграцияСБанком_НаКлиенте, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//		КонецЕсли;		
//		
//	КонецЕсли;
//	
//	Если МассивДокументов_TBCBGE22.Количество() > 0 Тогда
//	
//		ВыгрузитьДокументВБанкTBC(ТекПользователь,ВалютаУчета,МассивДокументов_TBCBGE22);
//	
//	КонецЕсли;
//	
//	Если МассивДокументов_TBCBGE22_Batch.Количество() > 0 Тогда
//	
//		ВыгрузитьДокументВБанкПакетомTBC(ТекПользователь,ВалютаУчета,МассивДокументов_TBCBGE22_Batch);
//	
//	КонецЕсли;
//	
//КонецПроцедуры

Функция ПолучитьСтруктуруВсехПараметров() Экспорт
	
	СтруктураВозврата = Новый Структура;
	
	МассивЗначений = Новый Массив;
	
	МассивЗначений.Добавить("Документ");
	МассивЗначений.Добавить("Charges");
	МассивЗначений.Добавить("ComissionAccountNumber");
	МассивЗначений.Добавить("BeneficiaryBankCode");
	МассивЗначений.Добавить("BeneficiaryBankName");
	МассивЗначений.Добавить("BeneficiaryInn");
	МассивЗначений.Добавить("BeneficiaryName");
	МассивЗначений.Добавить("IntermediaryBankCode");
	МассивЗначений.Добавить("IntermediaryBankName");
	МассивЗначений.Добавить("AdditionalInformation");
	МассивЗначений.Добавить("PaymentDetail");
	МассивЗначений.Добавить("ValueDate");
	МассивЗначений.Добавить("UniqueId");
	МассивЗначений.Добавить("Amount");
	МассивЗначений.Добавить("Currency");
	МассивЗначений.Добавить("DocumentNo");
	МассивЗначений.Добавить("SourceAccountNumber");
	МассивЗначений.Добавить("BeneficiaryAccountNumber");
	МассивЗначений.Добавить("Nomination");
	МассивЗначений.Добавить("DispatchType");
	МассивЗначений.Добавить("PayerInn");
	МассивЗначений.Добавить("PayerName");
	
	СтруктураВозврата.Вставить("РасходСоСчета", МассивЗначений);
	
	МассивЗначений = Новый Массив;
	
	МассивЗначений.Добавить("SourceCurrency");
	МассивЗначений.Добавить("DestinationAccountNumber");
	МассивЗначений.Добавить("DestinationCurrency");
	МассивЗначений.Добавить("Rate");
	МассивЗначений.Добавить("AdditionalInfo");
	
	СтруктураВозврата.Вставить("Конвертация", МассивЗначений);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура ПройтиАвторизацию(Токен, Параметры) Экспорт
	
	Если Токен = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Токен) Тогда
		//Параметры
		ТекстСообщения 		= "";
		Отказ 				= Ложь;
		ТекПользователь 	= ИнтеграцияСБанком_НаСервере.АвторизованныйПользователь();                   
		Организация 		= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяОрганизация");
		ВалютаУчета			= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета");
		СтруктураВсехПараметров = ПолучитьСтруктуруВсехПараметров();
		
		ИнтеграцияСБанком_НаСервере.ВыполнитьПроверкуДанныхНаСервере(Параметры.МассивДокументов_BAGAGE22, ВалютаУчета, Отказ, СтруктураВсехПараметров, ТекстСообщения, Токен);
		
		СтруктураОповещения = Новый Структура("ВыгруженныеСсылки", Параметры.МассивДокументов_BAGAGE22);
		Оповестить("ИнтеграцияСБанком_ВыгрузкаЗавершена", СтруктураОповещения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСтатусыДокументов(Ссылки) Экспорт 
	
	ОчиститьСообщения();
	ТекстСообщения = "";
	Отказ = Ложь;

	ТекПользователь 	= ИнтеграцияСБанком_НаСервере.АвторизованныйПользователь();
	Организация 		= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяОрганизация");
	ВалютаУчета			= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета");
	
	ПолученныеТаблицы = ИнтеграцияСБанком_НаСервере.ТаблицаДокументов(Ссылки);
	
	//Некорректные документы_
	МассивНекорректныхДокументов 	= ПолученныеТаблицы.МассивНекорректныхДокументов;
	Для Каждого Некорректный_Документ Из МассивНекорректныхДокументов Цикл 
		ТекстСообщения = НСтр("ru = 'Выгрузка в банк для документа: """+Некорректный_Документ+""" невозможна'; ka = 'დოკუმენტის """+Некорректный_Документ+""" ბანკში გადატვირთვა არ არის შესაძლებელი'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	//_Некорректные документы
	
	МассивДокументов_BAGAGE22 		= ПолученныеТаблицы.МассивДокументов_BAGAGE22;
	МассивДокументов_TBCBGE22 		= ПолученныеТаблицы.МассивДокументов_TBCBGE22;
	МассивДокументов_TBCBGE22_Batch = ПолученныеТаблицы.МассивДокументов_TBCBGE22_Batch; 
	МассивДокументов_MIBGGE22 		= ПолученныеТаблицы.МассивДокументов_MIBGGE22;
	МассивДокументов_MIBGGE22_Batch	= ПолученныеТаблицы.МассивДокументов_MIBGGE22_Batch;
	Если (МассивДокументов_BAGAGE22.Количество() = 0) 
		И (МассивДокументов_TBCBGE22.Количество() = 0) 
		И (МассивДокументов_TBCBGE22_Batch.Количество() = 0) 
		И (МассивДокументов_MIBGGE22.Количество() = 0)
		И (МассивДокументов_MIBGGE22_Batch.Количество() = 0) Тогда
		ТекстСообщения = НСтр("ru = 'Не найдены документы для BOG!'; ka = 'არ მოიძებნა დოკუმენტები BOG-სთვის!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	Если МассивДокументов_BAGAGE22.Количество() > 0 Тогда
		
		СтруктураВсехПараметров = ПолучитьСтруктуруВсехПараметров();
		Токен					= ИнтеграцияСБанком_НаСервере.ПолучитьТокенИзБазы("BAGAGE22");
		
		Если ЗначениеЗаполнено(Токен) Тогда
			Параметры = Новый Структура("МассивДокументов_BAGAGE22", МассивДокументов_BAGAGE22);
			ОбновитьСтатусBOG(Токен, Параметры)
		Иначе
			Оповещение	= Новый ОписаниеОповещения("ОбновитьСтатусBOG", ИнтеграцияСБанком_НаКлиенте, Новый Структура("МассивДокументов_BAGAGE22", МассивДокументов_BAGAGE22));
			ОткрытьФорму("Обработка.ИнтеграцияСБанком.Форма.Форма", Новый Структура("ИзДокумента", Истина),	ИнтеграцияСБанком_НаКлиенте, , , , Оповещение, РежимОткрытияОкнаФормы.Независимый);
		КонецЕсли;
		
	КонецЕсли;
	
	Если МассивДокументов_TBCBGE22.Количество() > 0 Тогда
	
		ОбновитьСтатусTBC(ТекПользователь,МассивДокументов_TBCBGE22);
	
	КонецЕсли;
	
	Если МассивДокументов_TBCBGE22_Batch.Количество() > 0 Тогда
	
		ОбновитьСтатусTBCПакетаTBC(ТекПользователь,МассивДокументов_TBCBGE22_Batch);
	
	КонецЕсли;     
	
	Если МассивДокументов_MIBGGE22.Количество() > 0 Тогда
		
		Токен = ИнтеграцияСБанком_НаСервере.ПолучитьТокенИзБазы("MIBGGE22");
		
		//Если ЗначениеЗаполнено(Токен) Тогда
			ОбновитьСтатусProCredit(ТекПользователь,МассивДокументов_MIBGGE22,Токен);
		//КонецЕсли;
		
	КонецЕсли;  
	
	Если МассивДокументов_MIBGGE22_Batch.Количество() > 0 Тогда
		
		Токен = ИнтеграцияСБанком_НаСервере.ПолучитьТокенИзБазы("MIBGGE22"); 
		
		//Если ЗначениеЗаполнено(Токен) Тогда
			ОбновитьСтатусProCredit(ТекПользователь,МассивДокументов_MIBGGE22_Batch,Токен); 
		//КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСтатусBOG(Токен, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Токен) Тогда
		//Параметры
		ТекстСообщения 		= "";
		Отказ 				= Ложь;
		ТекПользователь 	= ИнтеграцияСБанком_НаСервере.АвторизованныйПользователь();
		Организация 		= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяОрганизация");
		ВалютаУчета			= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета");
		СтруктураВсехПараметров = ПолучитьСтруктуруВсехПараметров();
		
		ИнтеграцияСБанком_НаСервере.ВыполнитьОбновлениеСтатусовНаСервере(Параметры.МассивДокументов_BAGAGE22, Токен);
		
		СтруктураОповещения = Новый Структура("ВыгруженныеСсылки", Параметры.МассивДокументов_BAGAGE22);
		Оповестить("ИнтеграцияСБанком_ВыгрузкаЗавершена", СтруктураОповещения);
	КонецЕсли;
	
КонецПроцедуры

#Область ИнтеграцияСБанкомTBC

Процедура ВыгрузитьДокументВБанкTBC(ТекПользователь,ВалютаУчета,МассивДокументов_TBCBGE22) ЭКСПОРТ
		
	Если МассивДокументов_TBCBGE22.Количество() > 0 Тогда
		
		СтруктурыТэгов = ИнтеграцияСБанкомTBC_КлиентСервер.ЗаполнитьСтрукутуруТеговВыгрузкиРасходаСоСчета();
				
		ПараметрыСоединенияТБС = ИнтеграцияСБанкомTBC_КлиентСервер.ПолучитьПараметрыСоединенияТБС(ТекПользователь);
				
		СтруктураПарметровЗапросаВБанк = Новый Структура();
		СтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода","ImportSinglePaymentOrders");
		СтруктураПарметровЗапросаВБанк.Вставить("МассивДокументов",МассивДокументов_TBCBGE22);
		СтруктураПарметровЗапросаВБанк.Вставить("ВалютаУчета",ВалютаУчета);
		СтруктураПарметровЗапросаВБанк.Вставить("СтруктурыТэгов",СтруктурыТэгов);
		
		Если ПараметрыСоединенияТБС.TBC_ИспользоватьСертификат Тогда
			
			ПараметрыСоединенияТБС.Nonce = "1111";
			ВыполнитьЗапросВБанкTBC(ПараметрыСоединенияТБС,СтруктураПарметровЗапросаВБанк);
			
		Иначе
			
			ДополнительныеПараметрыОповещения = Новый Структура();
			ДополнительныеПараметрыОповещения.Вставить("ПараметрыСоединенияТБС",ПараметрыСоединенияТБС);
			ДополнительныеПараметрыОповещения.Вставить("СтруктураПарметровЗапросаВБанк",СтруктураПарметровЗапросаВБанк);
			
			Подсказка = НСтр("ka='TBC ინტეგრაცია: შეიყვანეთ DigiPass –ის პაროლი';ru='Интеграция с TBC: Введите пароль DigiPass'");
			ОповещениеВводаСтроки = Новый ОписаниеОповещения("ЗавершениеВводаПароляDigiPass", ИнтеграцияСБанком_НаКлиенте, ДополнительныеПараметрыОповещения);
			ПоказатьВводСтроки(ОповещениеВводаСтроки,,Подсказка,,ИСТИНА);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьДокументВБанкПакетомTBC(ТекПользователь,ВалютаУчета,МассивДокументов_TBCBGE22_Batch) ЭКСПОРТ
		
	Если МассивДокументов_TBCBGE22_Batch.Количество() > 0 Тогда
		
		СтруктурыТэгов = ИнтеграцияСБанкомTBC_КлиентСервер.ЗаполнитьСтрукутуруТеговВыгрузкиРасходаСоСчета();
				
		ПараметрыСоединенияТБС = ИнтеграцияСБанкомTBC_КлиентСервер.ПолучитьПараметрыСоединенияТБС(ТекПользователь);
				
		СтруктураПарметровЗапросаВБанк = Новый Структура();
		СтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода","ImportBatchPaymentOrder");
		СтруктураПарметровЗапросаВБанк.Вставить("МассивДокументов",МассивДокументов_TBCBGE22_Batch);
		СтруктураПарметровЗапросаВБанк.Вставить("ВалютаУчета",ВалютаУчета);
		СтруктураПарметровЗапросаВБанк.Вставить("СтруктурыТэгов",СтруктурыТэгов);
		
		Если ПараметрыСоединенияТБС.TBC_ИспользоватьСертификат Тогда
			
			ПараметрыСоединенияТБС.Nonce = "1111";
			ВыполнитьЗапросВБанкTBC(ПараметрыСоединенияТБС,СтруктураПарметровЗапросаВБанк);
			
		Иначе
			
			ДополнительныеПараметрыОповещения = Новый Структура();
			ДополнительныеПараметрыОповещения.Вставить("ПараметрыСоединенияТБС",ПараметрыСоединенияТБС);
			ДополнительныеПараметрыОповещения.Вставить("СтруктураПарметровЗапросаВБанк",СтруктураПарметровЗапросаВБанк);
			
			Подсказка = НСтр("ka='TBC ინტეგრაცია: შეიყვანეთ DigiPass –ის პაროლი';ru='Интеграция с TBC: Введите пароль DigiPass'");
			ОповещениеВводаСтроки = Новый ОписаниеОповещения("ЗавершениеВводаПароляDigiPass", ИнтеграцияСБанком_НаКлиенте, ДополнительныеПараметрыОповещения);
			ПоказатьВводСтроки(ОповещениеВводаСтроки,,Подсказка,,ИСТИНА);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСтатусTBC(ТекПользователь,МассивДокументов_TBCBGE22) ЭКСПОРТ

	Если МассивДокументов_TBCBGE22.Количество() > 0 Тогда
		
		ПараметрыСоединенияТБС = ИнтеграцияСБанкомTBC_КлиентСервер.ПолучитьПараметрыСоединенияТБС(ТекПользователь);
				
		СтруктураПарметровЗапросаВБанк = Новый Структура();
		СтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода","GetPaymentOrderStatus");
		СтруктураПарметровЗапросаВБанк.Вставить("МассивДокументов",МассивДокументов_TBCBGE22);
		СтруктураПарметровЗапросаВБанк.Вставить("ЭтоПакет", ЛОЖЬ);
		
		Если ПараметрыСоединенияТБС.TBC_ИспользоватьСертификат Тогда
			
			ПараметрыСоединенияТБС.Nonce = "1111";
			ВыполнитьЗапросВБанкTBC(ПараметрыСоединенияТБС,СтруктураПарметровЗапросаВБанк);
			
		Иначе
			
			ДополнительныеПараметрыОповещения = Новый Структура();
			ДополнительныеПараметрыОповещения.Вставить("ПараметрыСоединенияТБС",ПараметрыСоединенияТБС);
			ДополнительныеПараметрыОповещения.Вставить("СтруктураПарметровЗапросаВБанк",СтруктураПарметровЗапросаВБанк);
			
			Подсказка = НСтр("ka='TBC ინტეგრაცია: შეიყვანეთ DigiPass –ის პაროლი';ru='Интеграция с TBC: Введите пароль DigiPass'");
			ОповещениеВводаСтроки = Новый ОписаниеОповещения("ЗавершениеВводаПароляDigiPass", ИнтеграцияСБанком_НаКлиенте, ДополнительныеПараметрыОповещения);
			ПоказатьВводСтроки(ОповещениеВводаСтроки,,Подсказка,,ИСТИНА);
			
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьСтатусTBCПакетаTBC(ТекПользователь,МассивДокументов_TBCBGE22) ЭКСПОРТ

	Если МассивДокументов_TBCBGE22.Количество() > 0 Тогда
		
		ПараметрыСоединенияТБС = ИнтеграцияСБанкомTBC_КлиентСервер.ПолучитьПараметрыСоединенияТБС(ТекПользователь);
				
		СтруктураПарметровЗапросаВБанк = Новый Структура();
		СтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода","GetPaymentOrderStatus");
		СтруктураПарметровЗапросаВБанк.Вставить("МассивДокументов",МассивДокументов_TBCBGE22);
		СтруктураПарметровЗапросаВБанк.Вставить("ЭтоПакет", ИСТИНА);
		
		Если ПараметрыСоединенияТБС.TBC_ИспользоватьСертификат Тогда
			
			ПараметрыСоединенияТБС.Nonce = "1111";
			ВыполнитьЗапросВБанкTBC(ПараметрыСоединенияТБС,СтруктураПарметровЗапросаВБанк);
			
		Иначе
			
			ДополнительныеПараметрыОповещения = Новый Структура();
			ДополнительныеПараметрыОповещения.Вставить("ПараметрыСоединенияТБС",ПараметрыСоединенияТБС);
			ДополнительныеПараметрыОповещения.Вставить("СтруктураПарметровЗапросаВБанк",СтруктураПарметровЗапросаВБанк);
			
			Подсказка = НСтр("ka='TBC ინტეგრაცია: შეიყვანეთ DigiPass –ის პაროლი';ru='Интеграция с TBC: Введите пароль DigiPass'");
			ОповещениеВводаСтроки = Новый ОписаниеОповещения("ЗавершениеВводаПароляDigiPass", ИнтеграцияСБанком_НаКлиенте, ДополнительныеПараметрыОповещения);
			ПоказатьВводСтроки(ОповещениеВводаСтроки,,Подсказка,,ИСТИНА);
			
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

Процедура ЗавершениеВводаПароляDigiPass(Результат, ДополнительныеПараметры) ЭКСПОРТ
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ПараметрыСоединенияТБС = ДополнительныеПараметры.ПараметрыСоединенияТБС;
		СтруктураПарметровЗапросаВБанк = ДополнительныеПараметры.СтруктураПарметровЗапросаВБанк;
		
		ПараметрыСоединенияТБС.Nonce = Результат;
		ВыполнитьЗапросВБанкTBC(ПараметрыСоединенияТБС,СтруктураПарметровЗапросаВБанк);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьЗапросВБанкTBC(ПараметрыСоединенияТБС, СтруктураПарметровЗапросаВБанк) ЭКСПОРТ

	ИнтеграцияСБанкомTBC_КлиентСервер.ВыполнитьЗапросВБанк(ПараметрыСоединенияТБС, СтруктураПарметровЗапросаВБанк);
	
	СтруктураОповещения = Новый Структура("ВыгруженныеСсылки", СтруктураПарметровЗапросаВБанк.МассивДокументов);
	Оповестить("ИнтеграцияСБанком_ВыгрузкаЗавершена", СтруктураОповещения);

КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияСБанкомProCredit

Процедура ВыгрузитьДокументВБанкProCredit(ТекПользователь,ВалютаУчета,МассивДокументов_MIBGGE22,Токен) ЭКСПОРТ
	
	Если МассивДокументов_MIBGGE22.Количество() > 0 Тогда     
		
		ПараметрыСоединенияProCredit = ИнтеграцияСБанкомProCredit_КлиентСервер.ПолучитьПараметрыСоединенияProCredit(ТекПользователь);     
		
		Если НЕ ЗначениеЗаполнено(Токен) Тогда     
			
			СтруктураAuthToken = ИнтеграцияСБанкомProCredit_КлиентСервер.ПолучитьAuthToken(ПараметрыСоединенияProCredit);   
			
			Если НЕ СтруктураAuthToken.Успешно Тогда 
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Ошибка авторизации AuthToken: "+СтруктураAuthToken.Описание+"'; ka = 'Ошибка авторизации AuthToken: "+СтруктураAuthToken.Описание+"'");
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли;
			
			ПараметрыСоединенияProCredit.Вставить("AuthToken", СтруктураAuthToken.ВозвращаемоеЗначение);   
			
		Иначе
			
			ПараметрыСоединенияProCredit.Вставить("AccessToken", Токен);
			
		КонецЕсли;
		
		СтруктураПарметровЗапросаВБанк = Новый Структура();
		СтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода","SendTransfers"); 
		СтруктураПарметровЗапросаВБанк.Вставить("ИмяСервиса","api/Transfer/SendTransfers"); 
		СтруктураПарметровЗапросаВБанк.Вставить("МассивДокументов",МассивДокументов_MIBGGE22);
		СтруктураПарметровЗапросаВБанк.Вставить("ВалютаУчета",ВалютаУчета);
		
		ДополнительныеПараметрыОповещения = Новый Структура();
		ДополнительныеПараметрыОповещения.Вставить("ПараметрыСоединенияProCredit",ПараметрыСоединенияProCredit);
		ДополнительныеПараметрыОповещения.Вставить("СтруктураПарметровЗапросаВБанк",СтруктураПарметровЗапросаВБанк);
		
		Если ЗначениеЗаполнено(Токен) Тогда  
			
			ИнтеграцияСБанкомProCredit_КлиентСервер.ВыполнитьЗапросВБанк(ПараметрыСоединенияProCredit, СтруктураПарметровЗапросаВБанк);
			
			Оповестить("ИнтеграцияСБанком_ВыгрузкаЗавершена", Новый Структура("ВыгруженныеСсылки", СтруктураПарметровЗапросаВБанк.МассивДокументов));
			
		Иначе
			Подсказка = НСтр("ka='ProCredit ინტეგრაცია: შეიყვანეთ OTP –ის პაროლი';ru='Интеграция с ProCredit: Введите пароль OTP'");
			ОповещениеВводаСтроки = Новый ОписаниеОповещения("ЗавершениеВводаПароляOTP", ЭтотОбъект, ДополнительныеПараметрыОповещения);
			ПоказатьВводСтроки(ОповещениеВводаСтроки,,Подсказка,,ИСТИНА);   
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры   

Процедура ВыгрузитьДокументВБанкПакетомProCredit(ТекПользователь,ВалютаУчета,МассивДокументов_MIBGGE22_Batch,Токен) ЭКСПОРТ
		
	Если МассивДокументов_MIBGGE22_Batch.Количество() > 0 Тогда
		
		ПараметрыСоединенияProCredit = ИнтеграцияСБанкомProCredit_КлиентСервер.ПолучитьПараметрыСоединенияProCredit(ТекПользователь);     
		
		Если НЕ ЗначениеЗаполнено(Токен) Тогда
			
			СтруктураAuthToken = ИнтеграцияСБанкомProCredit_КлиентСервер.ПолучитьAuthToken(ПараметрыСоединенияProCredit);   
			
			Если НЕ СтруктураAuthToken.Успешно Тогда 
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Ошибка авторизации AuthToken: "+СтруктураAuthToken.Описание+"'; ka = 'Ошибка авторизации AuthToken: "+СтруктураAuthToken.Описание+"'");
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли;
			
			ПараметрыСоединенияProCredit.Вставить("AuthToken", СтруктураAuthToken.ВозвращаемоеЗначение);   
			
		Иначе
			
			ПараметрыСоединенияProCredit.Вставить("AccessToken", Токен);
			
		КонецЕсли;
				
		СтруктураПарметровЗапросаВБанк = Новый Структура();
		СтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода","SendBatchTransfers");
		СтруктураПарметровЗапросаВБанк.Вставить("ИмяСервиса","api/Transfer/SendTransfers");
		СтруктураПарметровЗапросаВБанк.Вставить("МассивДокументов",МассивДокументов_MIBGGE22_Batch);
		СтруктураПарметровЗапросаВБанк.Вставить("ВалютаУчета",ВалютаУчета);
		
		ДополнительныеПараметрыОповещения = Новый Структура();
		ДополнительныеПараметрыОповещения.Вставить("ПараметрыСоединенияProCredit",ПараметрыСоединенияProCredit);
		ДополнительныеПараметрыОповещения.Вставить("СтруктураПарметровЗапросаВБанк",СтруктураПарметровЗапросаВБанк);
		
		Если ЗначениеЗаполнено(Токен) Тогда  
			
			ИнтеграцияСБанкомProCredit_КлиентСервер.ВыполнитьЗапросВБанк(ПараметрыСоединенияProCredit, СтруктураПарметровЗапросаВБанк);
			
			Оповестить("ИнтеграцияСБанком_ВыгрузкаЗавершена",  Новый Структура("ВыгруженныеСсылки", СтруктураПарметровЗапросаВБанк.МассивДокументов));
			
		Иначе
			
			Подсказка = НСтр("ka='ProCredit ინტეგრაცია: შეიყვანეთ OTP –ის პაროლი';ru='Интеграция с ProCredit: Введите пароль OTP'");
			ОповещениеВводаСтроки = Новый ОписаниеОповещения("ЗавершениеВводаПароляOTP", ЭтотОбъект, ДополнительныеПараметрыОповещения);
			ПоказатьВводСтроки(ОповещениеВводаСтроки,,Подсказка,,ИСТИНА);       
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗавершениеВводаПароляOTP(Результат, ДополнительныеПараметры) ЭКСПОРТ
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ПараметрыСоединенияProCredit = ДополнительныеПараметры.ПараметрыСоединенияProCredit;
		СтруктураПарметровЗапросаВБанк = ДополнительныеПараметры.СтруктураПарметровЗапросаВБанк;
		
		ПараметрыСоединенияProCredit.OTP = СокрЛП(Результат);
		ИнтеграцияСБанкомProCredit_КлиентСервер.ВыполнитьЗапросВБанк(ПараметрыСоединенияProCredit, СтруктураПарметровЗапросаВБанк);
		
		Оповестить("ИнтеграцияСБанком_ВыгрузкаЗавершена",  Новый Структура("ВыгруженныеСсылки", СтруктураПарметровЗапросаВБанк.МассивДокументов));
		
	ИначеЕсли СокрЛП(Результат) = "" Тогда   
		
		ТекстСообщения = НСтр("ru = 'Операция отменена. не указан OTP код'; ka = ოპერაცია გაუქმებულია. არ არის მითითებული OTP კოდი'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСтатусProCredit(ТекПользователь,МассивДокументов_MIBGGE22,Токен) ЭКСПОРТ
	
	Если МассивДокументов_MIBGGE22.Количество() > 0 Тогда
		
		ПараметрыСоединенияProCredit = ИнтеграцияСБанкомProCredit_КлиентСервер.ПолучитьПараметрыСоединенияProCredit(ТекПользователь);
		
		Если НЕ ЗначениеЗаполнено(Токен) Тогда
			
			СтруктураAuthToken = ИнтеграцияСБанкомProCredit_КлиентСервер.ПолучитьAuthToken(ПараметрыСоединенияProCredit);   
			
			Если НЕ СтруктураAuthToken.Успешно Тогда 
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Ошибка авторизации AuthToken: "+СтруктураAuthToken.Описание+"'; ka = 'Ошибка авторизации AuthToken: "+СтруктураAuthToken.Описание+"'");
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли;
			
			ПараметрыСоединенияProCredit.Вставить("AuthToken", СтруктураAuthToken.ВозвращаемоеЗначение);   
			
		Иначе
			
			ПараметрыСоединенияProCredit.Вставить("AccessToken", Токен);
			
		КонецЕсли;
		
		СтруктураПарметровЗапросаВБанк = Новый Структура();
		СтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода","GetTransferStatus");
		СтруктураПарметровЗапросаВБанк.Вставить("МассивДокументов",МассивДокументов_MIBGGE22);
		
		ДополнительныеПараметрыОповещения = Новый Структура();
		ДополнительныеПараметрыОповещения.Вставить("ПараметрыСоединенияProCredit",ПараметрыСоединенияProCredit);
		ДополнительныеПараметрыОповещения.Вставить("СтруктураПарметровЗапросаВБанк",СтруктураПарметровЗапросаВБанк);
		
		Если ЗначениеЗаполнено(Токен) Тогда  
			
			ИнтеграцияСБанкомProCredit_КлиентСервер.ВыполнитьЗапросВБанк(ПараметрыСоединенияProCredit, СтруктураПарметровЗапросаВБанк);
			
			Оповестить("ИнтеграцияСБанком_ВыгрузкаЗавершена");
			
		Иначе
			
			Подсказка = НСтр("ka='ProCredit ინტეგრაცია: შეიყვანეთ OTP –ის პაროლი';ru='Интеграция с ProCredit: Введите пароль OTP'");
			ОповещениеВводаСтроки = Новый ОписаниеОповещения("ЗавершениеВводаПароляOTP", ЭтотОбъект, ДополнительныеПараметрыОповещения);
			ПоказатьВводСтроки(ОповещениеВводаСтроки,,Подсказка,,ИСТИНА);
			
		КонецЕсли;   
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти