////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(Параметры.УзелОбмена) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	УзелОбмена	= Параметры.УзелОбмена;
	СписокИменМетаданных	= Параметры.СписокИменМетаданных;
	//Фильтруем список имен метаданных
	Всего	= СписокИменМетаданных.Количество();
	Для Сч = 1 По Всего Цикл
		Если Найти(СписокИменМетаданных[Всего-Сч].Значение,"Константа.") <> 0 Тогда
			СписокИменМетаданных.Удалить(Всего-Сч);
		КонецЕсли;
	КонецЦикла;
	РегистрацияОбъектов	= Параметры.РегистрацияОбъектов;

	Если РегистрацияОбъектов Тогда
		Заголовок	= "Регистрация объектов";
		Элементы.ТаблицаСсылокВыполнить.Заголовок	= "Выполнить регистрацию";
		Элементы.ПроверятьДвиженияДокументов.Заголовок	= "При регистрации документов регистрировать соответствующие им наборы записей регистров";
	Иначе
		Заголовок	= "Удаление регистрации объектов";
		Элементы.ТаблицаСсылокВыполнить.Заголовок	= "Отменить регистрацию";
		Элементы.ПроверятьДвиженияДокументов.Заголовок	= "При отмене регистрации документов отменять регистрацию соответствующих наборов записей регистров";
	КонецЕсли;

	Если Параметры.СписокИменМетаданных.Количество() = 0 Тогда
		//Режим произвольного запроса
		Заголовок	= Заголовок + " (произвольный запрос)";
		Элементы.ОтборПоЗначениямРеквизитов.Видимость	= Ложь;
		Элементы.ТаблицаСсылокДобавить.Видимость	= Ложь;
		Элементы.ТаблицаСсылокПодбор.Видимость	= Ложь;
	Иначе
		//Режим отбора

		Если Параметры.СписокИменМетаданных.Количество() = 1 Тогда
			//Режим подбора
			Заголовок	= Заголовок + " ("+Параметры.СписокИменМетаданных[0].Значение+")";
		КонецЕсли;

		СформироватьСКД();

	КонецЕсли;

	СоответствиеИндексовКартинок	= Новый Соответствие();
	СоответствиеИндексовКартинок["Справочник"]				= 4;
	СоответствиеИндексовКартинок["Последовательность"]		= 6;
	СоответствиеИндексовКартинок["Документ"]				= 8;
	СоответствиеИндексовКартинок["ПланВидовХарактеристик"]	= 10;
	СоответствиеИндексовКартинок["ПланСчетов"]				= 12;
	СоответствиеИндексовКартинок["ПланВидовРасчета"]		= 14;
	СоответствиеИндексовКартинок["РегистрСведений"]			= 16;
	СоответствиеИндексовКартинок["РегистрНакопления"]		= 18;
	СоответствиеИндексовКартинок["РегистрБухгалтерии"]		= 20;
	СоответствиеИндексовКартинок["РегистрРасчета"]			= 22;
	СоответствиеИндексовКартинок["БизнесПроцесс"]			= 24;
	СоответствиеИндексовКартинок["Задача"]					= 26;

	СоответствиеКартинокОбъектов	= Новый ФиксированноеСоответствие(СоответствиеИндексовКартинок);

#Если ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
	Элементы.КонтекстноеМенюТекстЗапросаКонструкторЗапроса.Видимость	= Истина;
#КонецЕсли

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ТаблицаСсылокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаНаОбъект) Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(ТекущиеДанные.СсылкаНаОбъект);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.КлючНабораЗаписей) Тогда
		ПараметрыФормы	= Новый Структура("Ключ", ПолучитьКлючФормыНаСервере(ТекущиеДанные.КлючНабораЗаписей, ТекущиеДанные.ИмяМетаданных));
		ОткрытьФорму(ТекущиеДанные.ИмяМетаданных + ".ФормаЗаписи", ПараметрыФормы);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
#Если ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		ИмяФормыИсточника	= ВыбранноеЗначение[0].Метаданные().ПолноеИмя()+".Форма";
	Иначе
		ИмяФормыИсточника	= ВыбранноеЗначение.Метаданные().ПолноеИмя()+".Форма";
	КонецЕсли;
#Иначе
	ИмяФормыИсточника	= ИсточникВыбора.ИмяФормы;
#КонецЕсли

	ИндексКартинки	= 0;
	Если Найти(ИмяФормыИсточника,"Справочник.") > 0 Тогда
		ИндексКартинки	= 4;
	ИначеЕсли Найти(ИмяФормыИсточника,"Документ.") > 0 Тогда
		ИндексКартинки	= 8;
	ИначеЕсли Найти(ИмяФормыИсточника,"ПланВидовХарактеристик.") > 0 Тогда
		ИндексКартинки	= 10;
	ИначеЕсли Найти(ИмяФормыИсточника,"ПланСчетов.") > 0 Тогда
		ИндексКартинки	= 12;
	ИначеЕсли Найти(ИмяФормыИсточника,"ПланВидовРасчета.") > 0 Тогда
		ИндексКартинки	= 14;
	ИначеЕсли Найти(ИмяФормыИсточника,"БизнесПроцесс.") > 0 Тогда
		ИндексКартинки	= 22;
	ИначеЕсли Найти(ИмяФормыИсточника,"Задача.") > 0 Тогда
		ИндексКартинки	= 26;
	Иначе
		Возврат;
	КонецЕсли;
	
	Позиция	= Найти(ИмяФормыИсточника,".Форма");
	Если Позиция = 0 Тогда
		Возврат;
	КонецЕсли; 
	ИмяМетаданных	= Лев(ИмяФормыИсточника, Позиция - 1);
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для каждого ВыбЗначение Из ВыбранноеЗначение Цикл
			ДобавитьСтрокуВТаблицуВыбора(ИндексКартинки, ВыбЗначение, ИмяМетаданных);
		КонецЦикла; 
	Иначе
		ДобавитьСтрокуВТаблицуВыбора(ИндексКартинки, ВыбранноеЗначение, ИмяМетаданных);
	КонецЕсли; 

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьДанныеПоСКД(Команда)
	ПолучитьРезультатПоСКДНаСервере();
	Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаДанные;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСсылокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

	Отказ = Истина;
	ВыбратьВДанные(Истина, Истина);

КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ВыбратьВДанные(Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КонструкторЗапроса(Команда)
#Если ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
	КонструкторЗапроса = Новый КонструкторЗапроса;
	
	Если НЕ ПустаяСтрока(ТекстПроизвольногоЗапроса) Тогда 
		КонструкторЗапроса.Текст = ТекстПроизвольногоЗапроса;
	КонецЕсли;
	
	Если КонструкторЗапроса.ОткрытьМодально() Тогда 
		ТекстПроизвольногоЗапроса = КонструкторЗапроса.Текст;
	КонецЕсли;
#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметры(Команда)
	ЗаполнитьПараметрыЗапросаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоЗапросу(Команда)
	ПолучитьРезультатПоЗапросуНаСервере();
	Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаДанные;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыбор(Команда)

	СтруктураВозврата = Новый Структура("Регистрация, ВключаяДвиженияДокументов, Таблица",
							РегистрацияОбъектов,
							ВключаяДвиженияДокументов,
							ТаблицаСсылок);

	Закрыть(СтруктураВозврата);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ДобавитьСтрокуВТаблицуВыбора(ИндексКартинки, СсылкаНаОбъект, ИмяМетаданных)
	СтруктураПоиска	= Новый Структура("СсылкаНаОбъект", СсылкаНаОбъект);
	Если ТаблицаСсылок.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
		НоваяСтрока	= ТаблицаСсылок.Добавить();
		НоваяСтрока.Картинка	= ИндексКартинки;
		НоваяСтрока.СсылкаНаОбъект	= СсылкаНаОбъект;
		НоваяСтрока.ИмяМетаданных	= ИмяМетаданных;
		НоваяСтрока.Представление	= Строка(СсылкаНаОбъект);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВДанные(ЗакрыватьПриВыборе, МножественныйВыбор)

	СписокВыбора	= СписокИменМетаданных.Скопировать();
	Всего	= СписокВыбора.Количество();
	Для Сч = 1 По Всего Цикл
		Значение	= СписокВыбора[Всего-Сч].Значение;
		Если Найти(Значение,"Справочник.") = 0 И
			 Найти(Значение,"Документ.") = 0 И
			 Найти(Значение,"ПланВидовХарактеристик.") = 0 И
			 Найти(Значение,"ПланСчетов.") = 0 И
			 Найти(Значение,"ПланВидовРасчета.") = 0 И
			 Найти(Значение,"БизнесПроцесс.") = 0 И
			 Найти(Значение,"Задача.") = 0 Тогда
			СписокВыбора.Удалить(Всего-Сч);
		Иначе
			Поз	= Найти(Значение,".");
			Если Поз > 0 Тогда
				Имя	= Лев(Значение, Поз - 1);
				СписокВыбора[Всего-Сч].Картинка	= БиблиотекаКартинок[Имя+"Объект"]
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если СписокВыбора.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли СписокВыбора.Количество() > 1 Тогда
		ВыбранныйЭлемент	= ВыбратьИзМеню(СписокВыбора, Элементы.ТаблицаСсылок.КоманднаяПанель);
		Если ВыбранныйЭлемент = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ИмяМетаданных	= ВыбранныйЭлемент.Значение;
	Иначе
		ИмяМетаданных	= СписокВыбора[0].Значение;
	КонецЕсли;

	ПараметрыФормы	= Новый Структура("ЗакрыватьПриВыборе,МножественныйВыбор", ЗакрыватьПриВыборе, МножественныйВыбор);

	ОткрытьФорму(ИмяМетаданных+".ФормаВыбора", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура СформироватьСКД()

	ТипХранилище = Тип("ХранилищеЗначения");

	СхемаКомпоновки = Новый СхемаКомпоновкиДанных();

	Источник = СхемаКомпоновки.ИсточникиДанных.Добавить();
	Источник.Имя = "ИсточникДанных";
	Источник.СтрокаСоединения="";
	Источник.ТипИсточникаДанных = "local";

	Объединение = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных"));
	Объединение.Имя	= "НаборДанных";

	СоответствиеИменПолейРезультата	= Новый Соответствие();

	Для каждого ЭлементСписка Из СписокИменМетаданных Цикл

		МетаданныеОбъекта	= Метаданные.НайтиПоПолномуИмени(ЭлементСписка.Значение);

		Если Метаданные.РегистрыСведений.Содержит(МетаданныеОбъекта) И МетаданныеОбъекта.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый Тогда
			//Независимые регистры сведений

			МассивПолейСвязей	= Новый Массив();

			ТекстЗапроса	= "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|"""+ЭлементСписка.Значение+""" КАК __ПолноеИмяМетаданных";
			Если МетаданныеОбъекта.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
				ТекстЗапроса	= ТекстЗапроса + ",
				|__Таблица.Период КАК Период";
				
				СоответствиеИменПолейРезультата["Период"]	= Истина;
				МассивПолейСвязей.Добавить("Период");
				
			КонецЕсли;
			Для каждого Реквизит Из МетаданныеОбъекта.Измерения Цикл
				ТекстЗапроса	= ТекстЗапроса + ",
				|__Таблица." + Реквизит.Имя + " КАК " + Реквизит.Имя;
				
				СоответствиеИменПолейРезультата[Реквизит.Имя]	= Истина;
				МассивПолейСвязей.Добавить(Реквизит.Имя);

			КонецЦикла;
			Для каждого Реквизит Из МетаданныеОбъекта.Ресурсы Цикл
				Если НЕ Реквизит.Тип.СодержитТип(ТипХранилище) Тогда
					ТекстЗапроса	= ТекстЗапроса + ",
					|__Таблица." + Реквизит.Имя + " КАК " + Реквизит.Имя;
				КонецЕсли;
			КонецЦикла;
			Для каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
				Если НЕ Реквизит.Тип.СодержитТип(ТипХранилище) Тогда
					ТекстЗапроса	= ТекстЗапроса + ",
					|__Таблица." + Реквизит.Имя + " КАК " + Реквизит.Имя;
				КонецЕсли;
			КонецЦикла;
			
			Если РегистрацияОбъектов Тогда
				ТекстЗапроса	= ТекстЗапроса + "
				|ИЗ " + ЭлементСписка.Значение + " КАК __Таблица";
			Иначе
				ТекстЗапроса	= ТекстЗапроса + "
				|ИЗ " + ЭлементСписка.Значение + ".Изменения КАК __Таблица_
				|ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ЭлементСписка.Значение + " КАК __Таблица
				|ПО ИСТИНА";

				Для каждого ПолеСвязи Из МассивПолейСвязей Цикл
					ТекстЗапроса	= ТекстЗапроса + " И
					|__Таблица_." + ПолеСвязи + " = __Таблица." + ПолеСвязи;
				КонецЦикла;

				ТекстЗапроса	= ТекстЗапроса + "
				|ГДЕ __Таблица_.Узел = &УзелОбмена";

			КонецЕсли;

		ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(МетаданныеОбъекта) ИЛИ
				  Метаданные.РегистрыНакопления.Содержит(МетаданныеОбъекта) ИЛИ
				  Метаданные.РегистрыРасчета.Содержит(МетаданныеОбъекта) ИЛИ
				  Метаданные.РегистрыСведений.Содержит(МетаданныеОбъекта) ИЛИ
				  Метаданные.Последовательности.Содержит(МетаданныеОбъекта) Тогда
			//Регистры и последовательности с подчинением регитратору
			ТекстЗапроса	= "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|"""+ЭлементСписка.Значение+""" КАК __ПолноеИмяМетаданных,
			|__Таблица.Регистратор КАК Регистратор";
			Для каждого Реквизит Из МетаданныеОбъекта.Измерения Цикл
				ТекстЗапроса	= ТекстЗапроса + ",
				|__Таблица." + Реквизит.Имя + " КАК " + Реквизит.Имя;
			КонецЦикла;
			
			Если НЕ Метаданные.Последовательности.Содержит(МетаданныеОбъекта) Тогда
				Для каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
					Если НЕ Реквизит.Тип.СодержитТип(ТипХранилище) Тогда
						ТекстЗапроса	= ТекстЗапроса + ",
						|__Таблица." + Реквизит.Имя + " КАК " + Реквизит.Имя;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли; 
			
			Если РегистрацияОбъектов Тогда
				ТекстЗапроса	= ТекстЗапроса + "
				|ИЗ " + ЭлементСписка.Значение + " КАК __Таблица";
			Иначе
				ТекстЗапроса	= ТекстЗапроса + "
				|ИЗ " + ЭлементСписка.Значение + ".Изменения КАК __Таблица_
				|ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ЭлементСписка.Значение + " КАК __Таблица
				|ПО __Таблица_.Регистратор = __Таблица.Регистратор
				|ГДЕ __Таблица_.Узел = &УзелОбмена";
			КонецЕсли;

			СоответствиеИменПолейРезультата["Регистратор"]	= Истина;

		Иначе
			//Ссылочный тип данных
			ТекстЗапроса	= "ВЫБРАТЬ
			|"""+ЭлементСписка.Значение+""" КАК __ПолноеИмяМетаданных";
			Для каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
				ТекстЗапроса	= ТекстЗапроса + ",
				|__Таблица."+?(РегистрацияОбъектов,"","Ссылка.") + Реквизит.Имя + " КАК " + Реквизит.Имя;
			КонецЦикла;
			Для каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
				Если НЕ Реквизит.Тип.СодержитТип(ТипХранилище) Тогда
					ТекстЗапроса	= ТекстЗапроса + ",
					|__Таблица."+?(РегистрацияОбъектов,"","Ссылка.") + Реквизит.Имя + " КАК " + Реквизит.Имя;
				КонецЕсли;
			КонецЦикла;
			ТекстЗапроса	= ТекстЗапроса + "
			|	ИЗ " + ЭлементСписка.Значение + ?(РегистрацияОбъектов, "", ".Изменения") + " КАК __Таблица"+
			?(РегистрацияОбъектов,"","
			|	ГДЕ __Таблица.Узел = &УзелОбмена");
			
			СоответствиеИменПолейРезультата["Ссылка"]	= Истина;
			
		КонецЕсли; 

		НаборДанных	= Объединение.Элементы.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		НаборДанных.Имя		= ЭлементСписка.Значение;
		НаборДанных.ИсточникДанных	= Источник.Имя;
		НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
		НаборДанных.Запрос	= ТекстЗапроса;

	КонецЦикла;

	ГруппировкаСКД = СхемаКомпоновки.НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаСКД.Использование = Истина;
	
	ВыбранноеПоле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("__ПолноеИмяМетаданных");

	Для каждого КлючИЗначение Из СоответствиеИменПолейРезультата Цикл
		ВыбранноеПоле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(КлючИЗначение.Ключ);
	КонецЦикла;

	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);

КонецПроцедуры

&НаСервере
Процедура ПолучитьРезультатПоСКДНаСервере()

	НастройкиСКД = КомпоновщикНастроек.ПолучитьНастройки();
	Если НастройкиСКД.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных("УзелОбмена")) <> Неопределено Тогда
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("УзелОбмена", УзелОбмена);
	КонецЕсли;

	СхемаКомпоновки = ПолучитьИзВременногоХранилища(АдресСхемы);
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиСКД,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	ТаблицаРезультата = Новый ТаблицаЗначений();
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	ТаблицаСсылок.Очистить();
	СчетчикНаборовЗаписей	= 1;

	ЕстьСсылка		= (ТаблицаРезультата.Колонки.Найти("Ссылка") <> Неопределено);
	ЕстьРегистратор	= (ТаблицаРезультата.Колонки.Найти("Регистратор") <> Неопределено);
	СоответствиеИсключенныхМетаданных	= Новый Соответствие();

	Для каждого СтрокаРезультата Из ТаблицаРезультата Цикл

		ЗаполнитьСтрокуТаблицыСсылок(СтрокаРезультата.__ПолноеИмяМетаданных, СтрокаРезультата, ЕстьСсылка, ЕстьРегистратор, СоответствиеИсключенныхМетаданных, СчетчикНаборовЗаписей);

	КонецЦикла; 

КонецПроцедуры

&НаСервере
Функция ЗаполнитьСтрокуТаблицыСсылок(ИмяМетаданных, СтрокаРезультата, ЕстьСсылка, ЕстьРегистратор, СоответствиеИсключенныхМетаданных, СчетчикНаборовЗаписей)
	
	Если СоответствиеИсключенныхМетаданных[ИмяМетаданных] <> Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Позиция	= Найти(ИмяМетаданных,".");
	Если Позиция = 0 Тогда
		СоответствиеИсключенныхМетаданных[ИмяМетаданных]	= Истина;
		Возврат "Ошибка: Имя метаданных <"+ИмяМетаданных+"> должно соответствовать полному имени метаданных объектов конфигурации";
	КонецЕсли;
	ТипДанных	= Лев(ИмяМетаданных, Позиция - 1);
	Картинка	= СоответствиеКартинокОбъектов[ТипДанных];
	Если Картинка = Неопределено Тогда
		СоответствиеИсключенныхМетаданных[ИмяМетаданных]	= Истина;
		Возврат "Ошибка: Имя метаданных <"+ИмяМетаданных+"> не соответствует ожидаемому";
	КонецЕсли;

	Ссылка	= Неопределено;
	КлючНабораЗаписей	= "";

	Если ЕстьСсылка И
		 (ТипДанных = "Справочник" ИЛИ
		 ТипДанных = "Документ" ИЛИ
		 ТипДанных = "ПланВидовХарактеристик" ИЛИ
		 ТипДанных = "ПланСчетов" ИЛИ
		 ТипДанных = "ПланВидовРасчета" ИЛИ
		 ТипДанных = "БизнесПроцесс" ИЛИ
		 ТипДанных = "Задача") Тогда
		Ссылка	= СтрокаРезультата.Ссылка;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Ссылка) И
		 ЕстьРегистратор И 
		 (ТипДанных = "РегистрСведений" ИЛИ
		  ТипДанных = "РегистрНакопления" ИЛИ
		  ТипДанных = "РегистрБухгалтерии" ИЛИ
		  ТипДанных = "РегистрРасчета" ИЛИ
		  ТипДанных = "Последовательность") Тогда
		Ссылка	= СтрокаРезультата.Регистратор;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Ссылка) И
		 ТипДанных = "РегистрСведений" Тогда
		//Попытка получения отбора для независимого регистра сведений
		ИмяРегистра	= Сред(ИмяМетаданных, Позиция + 1);
		Отбор	= РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей().Отбор;
		Для каждого ЭлементОтбора Из Отбор Цикл
			Попытка
				ЭлементОтбора.Значение	= СтрокаРезультата[ЭлементОтбора.ПутьКДанным];
			Исключение
				СоответствиеИсключенныхМетаданных[ИмяМетаданных]	= Истина;
				Возврат "Ошибка: <"+ИмяМетаданных+">, по реквизитам выборки не удалось получить ключ записи регистра (отсутствует реквизит """+ЭлементОтбора.Значение+""")";
			КонецПопытки;
		КонецЦикла;
		КлючНабораЗаписей	= ЗначениеВСтрокуВнутр(Отбор);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Ссылка) И
		 НЕ ЗначениеЗаполнено(КлючНабораЗаписей) Тогда
		СоответствиеИсключенныхМетаданных[ИмяМетаданных]	= Истина;
		Возврат "Ошибка: <"+ИмяМетаданных+">, не удалось определить данные по реквизитам выборки";
	КонецЕсли;

	НоваяСтрока	= ТаблицаСсылок.Добавить();
	НоваяСтрока.Картинка		= Картинка;
	НоваяСтрока.СсылкаНаОбъект	= Ссылка;
	НоваяСтрока.КлючНабораЗаписей	= КлючНабораЗаписей;
	НоваяСтрока.ИмяМетаданных	= ИмяМетаданных;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		НоваяСтрока.Представление	= Строка(Ссылка);
	Иначе
		НоваяСтрока.Представление	= "Набор записей " + Строка(СчетчикНаборовЗаписей);
		СчетчикНаборовЗаписей		= СчетчикНаборовЗаписей + 1;
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКлючФормыНаСервере(КлючЗаписиСтрокой, ИмяРегистра)
	КлючЗаписи	= ЗначениеИзСтрокиВнутр(КлючЗаписиСтрокой);
	СтруктураОтбора	= Новый Структура();
	Для каждого ЭлементОтбора Из КлючЗаписи Цикл
		СтруктураОтбора.Вставить(ЭлементОтбора.ПутьКДанным, ЭлементОтбора.Значение);
	КонецЦикла; 

	МетаданныеОбъекта	= Метаданные.НайтиПоПолномуИмени(ИмяРегистра);
	
	КлючЗаписи	= РегистрыСведений[МетаданныеОбъекта.Имя].СоздатьКлючЗаписи(СтруктураОтбора);
	
	Возврат КлючЗаписи;

КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыЗапросаНаСервере()

	Если ПустаяСтрока(ТекстПроизвольногоЗапроса) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос(ТекстПроизвольногоЗапроса);

	Попытка
		ПараметрыПроизвольногоЗапроса = Запрос.НайтиПараметры();
	Исключение
		Возврат;
	КонецПопытки;
	
	Для каждого ПараметрЗапроса Из ПараметрыПроизвольногоЗапроса Цикл
		ИмяПараметра =  ПараметрЗапроса.Имя;
		НайденныеСтроки = ПараметрыЗапроса.НайтиСтроки(Новый Структура("ИмяПараметра", ИмяПараметра));
		Если  НайденныеСтроки.Количество() = 0 Тогда
			СтрокаПараметров = ПараметрыЗапроса.Добавить();
			СтрокаПараметров.ИмяПараметра = ИмяПараметра;
		Иначе 
			СтрокаПараметров = НайденныеСтроки[0];
		КонецЕсли; 

		СтрокаПараметров.ЗначениеПараметра = ПараметрЗапроса.ТипЗначения.ПривестиЗначение(СтрокаПараметров.ЗначениеПараметра);
                       
	КонецЦикла;

	Элементы.ПараметрыЗапросаЗначениеПараметра.ВыбиратьТип	= Ложь;

КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатПоЗапросуНаСервере()

	Запрос = Новый Запрос();
	
	Запрос.Текст = ТекстПроизвольногоЗапроса;
	
	Если НЕ РегистрацияОбъектов Тогда
		Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	КонецЕсли; 

	Для Каждого СтрокаПараметров Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(СтрокаПараметров.ИмяПараметра, СтрокаПараметров.ЗначениеПараметра);
	КонецЦикла;

	Выборка = Запрос.Выполнить().Выбрать();

	ТаблицаСсылок.Очистить();
	СчетчикНаборовЗаписей	= 1;

	ЕстьИмяМетаданных	= Истина;
	ЕстьСсылка	= Истина;
	ЕстьРегистратор	= Истина;
    Если Выборка.Следующий() Тогда
		Попытка
			ИмяМетаданных	= Выборка.ИмяМетаданных;
		Исключение
			ЕстьИмяМетаданных	= Ложь;
		КонецПопытки;
		Попытка
			Ссылка	= Выборка.Ссылка;
		Исключение
			ЕстьСсылка	= Ложь;
		КонецПопытки;
		Попытка
			Ссылка	= Выборка.Регистратор;
		Исключение
			ЕстьРегистратор	= Ложь;
		КонецПопытки;
	Иначе
		Возврат("Выборка из запроса пустая...");
	КонецЕсли; 
	
	Выборка.Сбросить();
	СчетчикНаборовЗаписей	= 1;
	СоответствиеИсключенныхМетаданных	= Новый Соответствие();

	Пока Выборка.Следующий() Цикл
		Если ЕстьСсылка И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			//Получаем метаданные из ссылки
			Попытка
				МетаданныеОбъекта	= Выборка.Ссылка.Метаданные();
				ИмяМетаданных		= МетаданныеОбъекта.ПолноеИмя();
			Исключение
				//Ссылка, да не та...
				Возврат("Ошибка: <" + Строка(Выборка.Ссылка) + "> не является значением ссылочного типа");
			КонецПопытки;
		ИначеЕсли ЕстьИмяМетаданных И ЗначениеЗаполнено(Выборка.ИмяМетаданных) Тогда
			//Получаем метаданные из строки
			ИмяМетаданных	= Выборка.ИмяМетаданных;
		Иначе
			Возврат("Ошибка: В выборке нессылочных типов отсутствует реквизит ""ИмяМетаданных"", в которой должно быть указано полное имя метаданных");
		КонецЕсли;

		Результат	= ЗаполнитьСтрокуТаблицыСсылок(ИмяМетаданных, Выборка, ЕстьСсылка, ЕстьРегистратор, СоответствиеИсключенныхМетаданных, СчетчикНаборовЗаписей);
		Если Результат <> Неопределено Тогда
			Сообщить(Результат);
			Прервать;
		КонецЕсли;

	КонецЦикла;

КонецФункции

&НаКлиенте
Процедура ПараметрыЗапросаЗначениеПараметраОчистка(Элемент, СтандартнаяОбработка)
	Элементы.ПараметрыЗапроса.ТекущиеДанные.ЗначениеПараметра = Неопределено;
	Элемент.ВыбиратьТип  = Истина;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////












