Функция ЗаполнитьСтрукутуруТеговВыгрузкиРасходаСоСчета() ЭКСПОРТ
	
	СтруктураВозврата = Новый Структура;
	
	// общие Тэги 
	СтруктураCreditСВалютой = Новый Структура; // Credit При заполнении текста запроса будет очищен
	СтруктураCreditСВалютой.Вставить("CreditАccountNumber", Неопределено);	
	СтруктураCreditСВалютой.Вставить("CreditАccountCurrencyCode", Неопределено);
	
	СтруктураCreditБезВалюты = Новый Структура; // Credit При заполнении текста запроса будет очищен
	СтруктураCreditБезВалюты.Вставить("CreditАccountNumber", Неопределено);	
	
	СтруктураDebit = Новый Структура; // Debit При заполнении текста запроса будет очищен
	СтруктураDebit.Вставить("DebitАccountNumber", Неопределено);	
	СтруктураDebit.Вставить("DebitАccountCurrencyCode", Неопределено);
	
	Структураamount = Новый Структура;
	Структураamount.Вставить("amount", Неопределено);
	Структураamount.Вставить("currency", Неопределено);
	
	
	//TransferToOwnAccountPaymentOrderIo
	СтруктураМеждуСчетами = Новый Структура;
	
	СтруктураМеждуСчетами.Вставить("singlePaymentRequestId",Неопределено);
	СтруктураМеждуСчетами.Вставить("creditAccount",СтруктураCreditСВалютой);
	СтруктураМеждуСчетами.Вставить("debitAccount",СтруктураDebit);
	СтруктураМеждуСчетами.Вставить("documentNumber",Неопределено);
	СтруктураМеждуСчетами.Вставить("amount",Структураamount);
	СтруктураМеждуСчетами.Вставить("position",Неопределено);
	СтруктураМеждуСчетами.Вставить("description",Неопределено);
	
	СтруктураВозврата.Вставить("TransferToOwnAccountPaymentOrderIo", СтруктураМеждуСчетами);
	
	
	//TransferWithinBankPaymentOrderIo
	СтруктураПереводВнутриБанка = Новый Структура;
	СтруктураПереводВнутриБанка.Вставить("singlePaymentRequestId",Неопределено);
	СтруктураПереводВнутриБанка.Вставить("creditAccount",СтруктураCreditБезВалюты);
	СтруктураПереводВнутриБанка.Вставить("debitAccount",СтруктураDebit);
	СтруктураПереводВнутриБанка.Вставить("documentNumber",Неопределено);
	СтруктураПереводВнутриБанка.Вставить("amount",Структураamount);
	СтруктураПереводВнутриБанка.Вставить("position",Неопределено);
	СтруктураПереводВнутриБанка.Вставить("additionalDescription",Неопределено);
	СтруктураПереводВнутриБанка.Вставить("description",Неопределено);
	СтруктураПереводВнутриБанка.Вставить("beneficiaryName",Неопределено);
	
	СтруктураВозврата.Вставить("TransferWithinBankPaymentOrderIo", СтруктураПереводВнутриБанка);
	
	
	//TransferToOtherBankNationalCurrencyPaymentOrderIo
	СтруктураДругойБанкНацВалюта = Новый Структура;
	СтруктураДругойБанкНацВалюта.Вставить("singlePaymentRequestId",Неопределено);
	СтруктураДругойБанкНацВалюта.Вставить("creditAccount",СтруктураCreditБезВалюты);
	СтруктураДругойБанкНацВалюта.Вставить("debitAccount",СтруктураDebit);
	СтруктураДругойБанкНацВалюта.Вставить("documentNumber",Неопределено);
	СтруктураДругойБанкНацВалюта.Вставить("amount",Структураamount);
	СтруктураДругойБанкНацВалюта.Вставить("position",Неопределено);
	СтруктураДругойБанкНацВалюта.Вставить("additionalDescription",Неопределено);
	СтруктураДругойБанкНацВалюта.Вставить("description",Неопределено);
	СтруктураДругойБанкНацВалюта.Вставить("beneficiaryName",Неопределено);
	СтруктураДругойБанкНацВалюта.Вставить("beneficiaryTaxCode",Неопределено);
	
	СтруктураВозврата.Вставить("TransferToOtherBankNationalCurrencyPaymentOrderIo", СтруктураДругойБанкНацВалюта);
	
	
	//TransferToOtherBankForeignCurrencyPaymentOrderIo
	СтруктураДругойБанкИностраннаяВалюта = Новый Структура;
	СтруктураДругойБанкИностраннаяВалюта.Вставить("singlePaymentRequestId",Неопределено);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("creditAccount",СтруктураCreditБезВалюты);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("debitAccount",СтруктураDebit);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("documentNumber",Неопределено);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("amount",Структураamount);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("position",Неопределено);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("additionalDescription",Неопределено);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("description",Неопределено);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("beneficiaryName",Неопределено);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("beneficiaryAddress",Неопределено);
    СтруктураДругойБанкИностраннаяВалюта.Вставить("beneficiaryBankCode",Неопределено);
    СтруктураДругойБанкИностраннаяВалюта.Вставить("beneficiaryBankName",Неопределено);
    СтруктураДругойБанкИностраннаяВалюта.Вставить("intermediaryBankCode",Неопределено);
    СтруктураДругойБанкИностраннаяВалюта.Вставить("intermediaryBankName",Неопределено);
    СтруктураДругойБанкИностраннаяВалюта.Вставить("chargeDetails",Неопределено);
	
	СтруктураВозврата.Вставить("TransferToOtherBankForeignCurrencyPaymentOrderIo", СтруктураДругойБанкИностраннаяВалюта);
	
	
	//TreasuryTransferPaymentOrderIo
	СтруктураКазначейчтво = Новый Структура;
	
	СтруктураКазначейчтво.Вставить("singlePaymentRequestId",Неопределено);
	СтруктураКазначейчтво.Вставить("debitAccount",СтруктураDebit);
	СтруктураКазначейчтво.Вставить("documentNumber",Неопределено);
	СтруктураКазначейчтво.Вставить("amount",Структураamount);
	СтруктураКазначейчтво.Вставить("position",Неопределено);
	СтруктураКазначейчтво.Вставить("additionalDescription", Неопределено);
	СтруктураКазначейчтво.Вставить("taxpayerCode", Неопределено);   //Если Платим за когото
	СтруктураКазначейчтво.Вставить("taxpayerName", Неопределено);
    СтруктураКазначейчтво.Вставить("treasuryCode", Неопределено);
	
	СтруктураВозврата.Вставить("TreasuryTransferPaymentOrderIo", СтруктураКазначейчтво);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ЗаполнитьСтрукутуруТеговПакетнойВыгрузкиРасходаСоСчета() ЭКСПОРТ
	
	СтруктураВозврата = Новый Структура;
	
	// общие Тэги 
	СтруктураCreditСВалютой = Новый Структура; // Credit При заполнении текста запроса будет очищен
	СтруктураCreditСВалютой.Вставить("CreditАccountNumber", Неопределено);	
	СтруктураCreditСВалютой.Вставить("CreditАccountCurrencyCode", Неопределено);
	
	СтруктураCreditБезВалюты = Новый Структура; // Credit При заполнении текста запроса будет очищен
	СтруктураCreditБезВалюты.Вставить("CreditАccountNumber", Неопределено);	
	
	СтруктураDebit = Новый Структура; // Debit При заполнении текста запроса будет очищен
	СтруктураDebit.Вставить("DebitАccountNumber", Неопределено);	
	СтруктураDebit.Вставить("DebitАccountCurrencyCode", Неопределено);
	
	Структураamount = Новый Структура;
	Структураamount.Вставить("amount", Неопределено);
	Структураamount.Вставить("currency", Неопределено);
	
	СтруктураСчетаДебита = Новый Структура;
	СтруктураВозврата.Вставить("СтруктураСчетаДебита", СтруктураDebit);
	
	//TransferToOwnAccountPaymentOrderIo
	СтруктураМеждуСчетами = Новый Структура;
	
	//СтруктураМеждуСчетами.Вставить("singlePaymentRequestId",Неопределено);
	СтруктураМеждуСчетами.Вставить("creditAccount",СтруктураCreditСВалютой);
	//СтруктураМеждуСчетами.Вставить("debitAccount",СтруктураDebit);
	СтруктураМеждуСчетами.Вставить("documentNumber",Неопределено);
	СтруктураМеждуСчетами.Вставить("amount",Структураamount);
	СтруктураМеждуСчетами.Вставить("position",Неопределено);
	СтруктураМеждуСчетами.Вставить("description",Неопределено);
	
	СтруктураВозврата.Вставить("TransferToOwnAccountPaymentOrderIo", СтруктураМеждуСчетами);
	
	
	//TransferWithinBankPaymentOrderIo
	СтруктураПереводВнутриБанка = Новый Структура;
	//СтруктураПереводВнутриБанка.Вставить("singlePaymentRequestId",Неопределено);
	СтруктураПереводВнутриБанка.Вставить("creditAccount",СтруктураCreditБезВалюты);
	//СтруктураПереводВнутриБанка.Вставить("debitAccount",СтруктураDebit);
	СтруктураПереводВнутриБанка.Вставить("documentNumber",Неопределено);
	СтруктураПереводВнутриБанка.Вставить("amount",Структураamount);
	СтруктураПереводВнутриБанка.Вставить("position",Неопределено);
	СтруктураПереводВнутриБанка.Вставить("additionalDescription",Неопределено);
	СтруктураПереводВнутриБанка.Вставить("description",Неопределено);
	СтруктураПереводВнутриБанка.Вставить("beneficiaryName",Неопределено);
	
	СтруктураВозврата.Вставить("TransferWithinBankPaymentOrderIo", СтруктураПереводВнутриБанка);
	
	
	//TransferToOtherBankNationalCurrencyPaymentOrderIo
	СтруктураДругойБанкНацВалюта = Новый Структура;
	//СтруктураДругойБанкНацВалюта.Вставить("singlePaymentRequestId",Неопределено);
	СтруктураДругойБанкНацВалюта.Вставить("creditAccount",СтруктураCreditБезВалюты);
	//СтруктураДругойБанкНацВалюта.Вставить("debitAccount",СтруктураDebit);
	СтруктураДругойБанкНацВалюта.Вставить("documentNumber",Неопределено);
	СтруктураДругойБанкНацВалюта.Вставить("amount",Структураamount);
	СтруктураДругойБанкНацВалюта.Вставить("position",Неопределено);
	СтруктураДругойБанкНацВалюта.Вставить("additionalDescription",Неопределено);
	СтруктураДругойБанкНацВалюта.Вставить("description",Неопределено);
	СтруктураДругойБанкНацВалюта.Вставить("beneficiaryName",Неопределено);
	СтруктураДругойБанкНацВалюта.Вставить("beneficiaryTaxCode",Неопределено);
	
	СтруктураВозврата.Вставить("TransferToOtherBankNationalCurrencyPaymentOrderIo", СтруктураДругойБанкНацВалюта);
	
	
	//TransferToOtherBankForeignCurrencyPaymentOrderIo
	СтруктураДругойБанкИностраннаяВалюта = Новый Структура;
	//СтруктураДругойБанкИностраннаяВалюта.Вставить("singlePaymentRequestId",Неопределено);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("creditAccount",СтруктураCreditБезВалюты);
	//СтруктураДругойБанкИностраннаяВалюта.Вставить("debitAccount",СтруктураDebit);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("documentNumber",Неопределено);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("amount",Структураamount);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("position",Неопределено);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("additionalDescription",Неопределено);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("description",Неопределено);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("beneficiaryName",Неопределено);
	СтруктураДругойБанкИностраннаяВалюта.Вставить("beneficiaryAddress",Неопределено);
    СтруктураДругойБанкИностраннаяВалюта.Вставить("beneficiaryBankCode",Неопределено);
    СтруктураДругойБанкИностраннаяВалюта.Вставить("beneficiaryBankName",Неопределено);
    СтруктураДругойБанкИностраннаяВалюта.Вставить("intermediaryBankCode",Неопределено);
    СтруктураДругойБанкИностраннаяВалюта.Вставить("intermediaryBankName",Неопределено);
    СтруктураДругойБанкИностраннаяВалюта.Вставить("chargeDetails",Неопределено);
	
	СтруктураВозврата.Вставить("TransferToOtherBankForeignCurrencyPaymentOrderIo", СтруктураДругойБанкИностраннаяВалюта);
	
	
	//TreasuryTransferPaymentOrderIo
	СтруктураКазначейчтво = Новый Структура;
	
	//СтруктураКазначейчтво.Вставить("singlePaymentRequestId",Неопределено);
	СтруктураКазначейчтво.Вставить("debitAccount",СтруктураDebit);
	СтруктураКазначейчтво.Вставить("documentNumber",Неопределено);
	СтруктураКазначейчтво.Вставить("amount",Структураamount);
	СтруктураКазначейчтво.Вставить("position",Неопределено);
	СтруктураКазначейчтво.Вставить("additionalDescription", Неопределено);
	//СтруктураКазначейчтво.Вставить("taxpayerCode", Неопределено);   Если Платим за когото
	//СтруктураКазначейчтво.Вставить("taxpayerName", Неопределено);
    СтруктураКазначейчтво.Вставить("treasuryCode", Неопределено);
	
	СтруктураВозврата.Вставить("TreasuryTransferPaymentOrderIo", СтруктураКазначейчтво);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция - Создает и возвращает структуру параметров соединения для интеграции с банком ТБС
// 
// Возвращаемое значение - Структура
// 	Поля структуры:
//      TBC_Login					 - Строка - логин пользователя
//      TBC_Password				 - Строка - пароль пользователя
//      TBC_ТестовыйРежим			 - Булево - работаем в тестовом режиме
//      TBC_Сертификат				 - СправочникСсылка.Файлы - ссылка на справочник с хранилищем двоичных данных сертификата
//      TBC_ПарольСертификата		 - Строка - пароль сертификата
//      TBC_РаботаЧерезСервер		 - Булево - предполагается, что соединение с сайтом TBC будет происходить с сервера 1С
//      TBC_ИспользоватьСертификат	 - Булево - ИСТИНА: соединение с банком с использованием сертификата подлинности; ЛОЖЬ - соединение с банком без сертификата подлинности
//      Nonce						 - Строка - Nonce
//      ДвоичныеДанныеСертификата	 - ДвоичныеДанные,АдресВоВременномХранилище - двоичные данные сертификата
//
Функция СтруктураПараметровСоединенияТБС() ЭКСПОРТ
	ПЕРЕМ РЕЗ;

	РЕЗ = ИнтеграцияСБанкомTBC_Сервер.СтруктураПараметровСоединенияТБС();
					
    Возврат РЕЗ;
КонецФункции // ()

// Функция - Получить параметры соединения с банком ТБС для пользователя
//
// Параметры:
//  ТекущийПользователь	 - СправочникСсылка.Пользователи - пользователь, для которого нужно получить настройки
// 
// Возвращаемое значение:
// 	Поля структуры:
//      TBC_Login					 - Строка - логин пользователя
//      TBC_Password				 - Строка - пароль пользователя
//      TBC_ТестовыйРежим			 - Булево - работаем в тестовом режиме
//      TBC_Сертификат				 - СправочникСсылка.Файлы - ссылка на справочник с хранилищем двоичных данных сертификата
//      TBC_ПарольСертификата		 - Строка - пароль сертификата
//      TBC_РаботаЧерезСервер		 - Булево - предполагается, что соединение с сайтом TBC будет происходить с сервера 1С
//      TBC_ИспользоватьСертификат	 - Булево - ИСТИНА: соединение с банком с использованием сертификата подлинности; ЛОЖЬ - соединение с банком без сертификата подлинности
//      Nonce						 - Строка - Nonce
//      ДвоичныеДанныеСертификата	 - ДвоичныеДанные,АдресВоВременномХранилище - двоичные данные сертификата
//
Функция ПолучитьПараметрыСоединенияТБС(ТекущийПользователь = НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ИнтеграцияСБанкомTBC_Сервер.ПолучитьПараметрыСоединенияТБС(ТекущийПользователь);
	
	Возврат РЕЗ;
КонецФункции // ()

Процедура ЗаполнитьСтруктуруОтветаРекурсиеей(ОбъектXDTO, СтруктураЗаполнения, КлючПредыдущейСтруктуры = "")
	
	Для Каждого Строк Из ОбъектXDTO.Свойства() Цикл 
		
		Если ТипЗнч(ОбъектXDTO[Строк.Имя]) = Тип("ОбъектXDTO") Тогда 
			СледующаяСтруктура = Новый Структура;
			СтруктураЗаполнения.Вставить(Строк.Имя, СледующаяСтруктура);
			ЗаполнитьСтруктуруОтветаРекурсиеей(ОбъектXDTO[Строк.Имя], СледующаяСтруктура, Строк.Имя);
		ИначеЕсли ТипЗнч(ОбъектXDTO[Строк.Имя]) = Тип("СписокXDTO") Тогда
			
			МассивСтрокСписка = Новый Массив;
						
			Для Каждого СтрокаСписка Из (ОбъектXDTO[Строк.Имя]) Цикл 
				
				СледующаяСтруктура = Новый Структура;
				СтруктураЗаполнения.Вставить(Строк.Имя, СледующаяСтруктура);
				ЗаполнитьСтруктуруОтветаРекурсиеей(СтрокаСписка, СледующаяСтруктура, Строк.Имя);
				МассивСтрокСписка.Добавить(СледующаяСтруктура)
					
			КонецЦикла;
			
			СтруктураЗаполнения.Вставить(Строк.Имя, МассивСтрокСписка)
			
		ИначеЕсли ТипЗнч(ОбъектXDTO[Строк.Имя]) = Тип("Строка") Тогда 
			СтруктураЗаполнения.Вставить(Строк.Имя, ОбъектXDTO[Строк.Имя]);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Функция ПрочитатьФайлОтвета(ПутьКФайлу)
	
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	
	СтрокаXML = ЧтениеТекста.Прочитать();
		
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	//РезультатРазборки = Новый Массив;
	
	//ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://schemas.xmlsoap.org/soap/envelope/", "Разборка");
	//
	//БлокXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	БлокXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	СтруктураОтвета = Новый Структура;
	
	ЗаполнитьСтруктуруОтветаРекурсиеей(БлокXDTO, СтруктураОтвета);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//+++ Дмгг, 15.02.24, ONESOFT-2913
Функция ПрочитатьФайлОтветаИзСтрокиРезультата(СтрокаJSONРезультат)

	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.УстановитьСтроку(СтрокаJSONРезультат);
	Фабрика = Новый ФабрикаXDTO();
	ОбъектXDTO =  Фабрика.ПрочитатьXML(ЧтениеXML); 
	
	СтруктураОтвета = Новый Структура;
	
	ЗаполнитьСтруктуруОтветаРекурсиеей(ОбъектXDTO, СтруктураОтвета);   
	
	//СтруктураОтветаФинал = СтруктураОтвета.Body.GetAccountMovementsResponseIo; 
	// Kuzmich, 25.06.2024, (ONESOFT-3207) ხარვეზი თიბისი ბანკთან ინტეგრაციის დამუშავებაში / Ошибка при обработке интеграции с TBC Bank
	СтруктураОтветаФинал = Новый Структура("ТекстОшибки", НСтр("ka='შეცდომა მოთხოვნაზე პასუხის მიღებისას';ru='Ошибка получения ответа на запрос';en='Error receiving response to request'"));
	Если СтруктураОтвета.Body.Свойство("GetAccountMovementsResponseIo",СтруктураОтветаФинал) Тогда
		Возврат СтруктураОтветаФинал;
	ИначеЕсли СтруктураОтвета.Body.Свойство("ImportSinglePaymentOrdersResponseIo",СтруктураОтветаФинал) Тогда
		Возврат СтруктураОтветаФинал;
	ИначеЕсли СтруктураОтвета.Body.Свойство("GetPaymentOrderStatusResponseIo",СтруктураОтветаФинал) Тогда
		Возврат СтруктураОтветаФинал;
	КонецЕсли;
	// Kuzmich, 25.06.2024, (ONESOFT-3207) ხარვეზი თიბისი ბანკთან ინტეგრაციის დამუშავებაში / Ошибка при обработке интеграции с TBC Bank
	
	Возврат СтруктураОтветаФинал;

КонецФункции // ПрочитатьФайлОтветаИзСтрокиРезультата(СтрокаJSONРезультат, СтруктураПараметров)
//--- Дмгг, 15.02.24, ONESOFT-2913

// Функция - Создать HTTPСоединение
//
// Параметры:
//  ПараметрыСоединенияТБС	 - Структура:
//      TBC_Login					 - Строка - логин пользователя
//      TBC_Password				 - Строка - пароль пользователя
//      TBC_ТестовыйРежим			 - Булево - работаем в тестовом режиме
//      TBC_Сертификат				 - СправочникСсылка.Файлы - ссылка на справочник с хранилищем двоичных данных сертификата
//      ДвоичныеДанныеСертификата	 - ДвоичныеДанные,АдресВоВременномХранилище - двоичные данные сертификата
//      TBC_ПарольСертификата		 - Строка - пароль сертификата
//      TBC_РаботаЧерезСервер		 - Булево - предполагается, что соединение с сайтом TBC будет происходить с сервера 1С
//      TBC_ИспользоватьСертификат	 - Булево - ИСТИНА: соединение с банком с использованием сертификата подлинности; ЛОЖЬ - соединение с банком без сертификата подлинности
//      Nonce						 - Строка - Nonce
//      NewPassword					 - Строка - новый пароль
// 
// Возвращаемое значение: HTTPСоединение
//
Функция СоздатьHTTPСоединение(ПараметрыСоединенияТБС) ЭКСПОРТ
	ПЕРЕМ mhttp;
	
	Если ПараметрыСоединенияТБС.TBC_ИспользоватьСертификат Тогда
		ПутьКВременномуФайлуСертификата = ПолучитьИмяВременногоФайла("pfx");
		
		Если ЭтоАдресВременногоХранилища(ПараметрыСоединенияТБС.ДвоичныеДанныеСертификата) Тогда
			ДвоичныеДанныеСертификата = ПолучитьИзВременногоХранилища(ПараметрыСоединенияТБС.ДвоичныеДанныеСертификата);
		Иначе
			ДвоичныеДанныеСертификата = ПараметрыСоединенияТБС.ДвоичныеДанныеСертификата;
		КонецЕсли;
		ДвоичныеДанныеСертификата.Записать(ПутьКВременномуФайлуСертификата);
		
		Если ПараметрыСоединенияТБС.TBC_ТестовыйРежим Тогда
			Сервер = "secdbitst.tbconline.ge/dbi/dbiService";
		Иначе	
			Сервер = "secdbi.tbconline.ge/dbi/dbiService";
		КонецЕсли;
		
		mhttp = Новый HTTPСоединение(Сервер,,,,,,Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаФайл(СокрЛП(ПутьКВременномуФайлуСертификата), СокрЛП(ПараметрыСоединенияТБС.TBC_ПарольСертификата))));
	Иначе
		
		Если ПараметрыСоединенияТБС.TBC_ТестовыйРежим Тогда
			Сервер = "test.tbconline.ge/dbi/dbiService";
		Иначе	
			Сервер = "tbconline.ge/dbi/dbiService";
		КонецЕсли;
		
		mhttp = Новый HTTPСоединение(Сервер,,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	КонецЕсли;
	
	Возврат mhttp;

КонецФункции // ()

// Функция - Изменить пароль
//
// Параметры:
//  ПараметрыСоединенияТБС	 - Структура:
//      TBC_Login					 - Строка - логин пользователя
//      TBC_Password				 - Строка - пароль пользователя
//      TBC_ТестовыйРежим			 - Булево - работаем в тестовом режиме
//      TBC_Сертификат				 - СправочникСсылка.Файлы - ссылка на справочник с хранилищем двоичных данных сертификата
//      ДвоичныеДанныеСертификата	 - ДвоичныеДанные,АдресВоВременномХранилище - двоичные данные сертификата
//      TBC_ПарольСертификата		 - Строка - пароль сертификата
//      TBC_РаботаЧерезСервер		 - Булево - предполагается, что соединение с сайтом TBC будет происходить с сервера 1С
//      TBC_ИспользоватьСертификат	 - Булево - ИСТИНА: соединение с банком с использованием сертификата подлинности; ЛОЖЬ - соединение с банком без сертификата подлинности
//      Nonce						 - Строка - Nonce
//      NewPassword					 - Строка - новый пароль
// 
// Возвращаемое значение: 
//   Структура:
//      Успешно				 - Булево - результат выполнения операции
//      ВозвращаемоеЗначение - Произвольный - значение результата операции
//      Описание			 - Строка - текстовое описание результата операции
//
Функция ИзменитьПароль(ПараметрыСоединенияТБС) ЭКСПОРТ
	ПЕРЕМ mhttp, РЕЗ;
	
	Если ПараметрыСоединенияТБС.TBC_ИспользоватьСертификат Тогда
		Nonce = "1111";
	Иначе
		Nonce = ПараметрыСоединенияТБС.Nonce;
	КонецЕсли;
	
	РЕЗ = Новый Структура("Успешно,ВозвращаемоеЗначение,Описание",ЛОЖЬ,"","");
	
	mhttp = СоздатьHTTPСоединение(ПараметрыСоединенияТБС);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept-Encoding", "gzip,deflate");
	Заголовки.Вставить("Content-Type"	, "text/xml; charset=utf-8");
	Заголовки.Вставить("SoapAction"		, "http://www.mygemini.com/schemas/mygemini/ChangePassword");
	Заголовки.Вставить("Connection"		, "Keep-Alive");
	Заголовки.Вставить("User-Agent"		, "Apache-HttpClient/4.1.1 (java 1.5)");
	
	Запрос = Новый HTTPЗапрос("/", Заголовки);
	
	xml = 
	"<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:myg=""http://www.mygemini.com/schemas/mygemini"" xmlns:wsse=""http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"">"
	+"<soapenv:Header>"
	+"<wsse:Security>"
	+"<wsse:UsernameToken>"
	+"<wsse:Username>"+СокрЛП(ПараметрыСоединенияТБС.TBC_Login)+"</wsse:Username>"
	+"<wsse:Password>"+СокрЛП(ПараметрыСоединенияТБС.TBC_Password)+"</wsse:Password>"
	+"<wsse:Nonce>"+СокрЛП(Nonce)+"</wsse:Nonce>"
	+"</wsse:UsernameToken>"
	+"</wsse:Security>"
	+"</soapenv:Header>"
	+"<soapenv:Body>"
	+"<myg:ChangePasswordRequestIo>"
	+"<myg:newPassword>"+СокрЛП(ПараметрыСоединенияТБС.NewPassword)+"</myg:newPassword>"
	+"</myg:ChangePasswordRequestIo>"
	+"</soapenv:Body>"
	+"</soapenv:Envelope>";
	
	Запрос.УстановитьТелоИзСтроки(xml, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.Использовать);
	Результат = mhttp.ОтправитьДляОбработки(Запрос);
	res = Результат.КодСостояния;
	
	СтрокаРезультат = Результат.ПолучитьТелоКакСтроку();
	
	Если (СтрНайти(СтрокаРезультат, "Error 500") > 0) ИЛИ (res = 500) Тогда
		РЕЗ.Успешно = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = СтрокаРезультат;
		РЕЗ.Описание = НСтр("ka='შეცდომა მოთხოვნის გაგზავნისას';ru='Ошибка отправки запроса'") + Символы.НПП + СтрокаРезультат;
	КонецЕсли;
	
	ТэгМетода = "ns2:" + "ChangePassword" + "ResponseIo";
	ПозицНачТега = СтрНайти(СтрокаРезультат, "<"+ТэгМетода);
	ПозицНачОшибки = СтрНайти(СтрокаРезультат, "<faultstring");
	Если ПозицНачТега <> 0 Тогда 
		ДлинаКон = СтрДлина("</"+ТэгМетода+">");
		ПозцКон = СтрНайти(СтрокаРезультат, "</"+ТэгМетода+">");
		СтрокаРезультат = Сред(СтрокаРезультат,ПозицНачТега, ПозцКон + ДлинаКон - ПозицНачТега);
	ИначеЕсли ПозицНачОшибки <> 0 Тогда
		//Вытянем текст Ошибки
		ДлинаКон = СтрДлина("</faultstring>");
		ПозцКон = СтрНайти(СтрокаРезультат, "</faultstring>");
		ДлиннаНачТега = 27;
		ТекстОшибки = Сред(СтрокаРезультат, ПозицНачОшибки + ДлиннаНачТега, ПозцКон - (ПозицНачОшибки+ДлиннаНачТега));
		
		РЕЗ.Успешно = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = СтрокаРезультат;
		РЕЗ.Описание = ТекстОшибки + "
		|" + РЕЗ.Описание;
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ПутьКВременномуФайлуОтвета = ПолучитьИмяВременногоФайла("xml"); 
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.ОткрытьФайл(ПутьКВременномуФайлуОтвета);
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();    
	
	ЗаписьXML.ЗаписатьБезОбработки(СтрокаРезультат);
	
	ЗаписьXML.Закрыть();
	
	///////////////////////////////////
	//Прочитаем
	
	СтруктураОтвета = ПрочитатьФайлОтвета(ПутьКВременномуФайлуОтвета);
	
	Если СтруктураОтвета.Свойство("message") Тогда 
		РЕЗ.Успешно = ИСТИНА;
		РЕЗ.ВозвращаемоеЗначение = СтруктураОтвета;
		РЕЗ.Описание = СтруктураОтвета.message;
	КонецЕсли;
	
	Возврат РЕЗ;
	
КонецФункции

// Процедура - Выполнить запрос к сервису банка TBC
//
// Параметры:
//  ПараметрыСоединенияТБС				 - Структура:
//      TBC_Login					 - Строка - логин пользователя
//      TBC_Password				 - Строка - пароль пользователя
//      TBC_ТестовыйРежим			 - Булево - работаем в тестовом режиме
//      TBC_Сертификат				 - СправочникСсылка.Файлы - ссылка на справочник с хранилищем двоичных данных сертификата
//      ДвоичныеДанныеСертификата	 - ДвоичныеДанные,АдресВоВременномХранилище - двоичные данные сертификата
//      TBC_ПарольСертификата		 - Строка - пароль сертификата
//      TBC_РаботаЧерезСервер		 - Булево - предполагается, что соединение с сайтом TBC будет происходить с сервера 1С
//      TBC_ИспользоватьСертификат	 - Булево - ИСТИНА: соединение с банком с использованием сертификата подлинности; ЛОЖЬ - соединение с банком без сертификата подлинности
//      Nonce						 - Строка - Nonce
//      NewPassword					 - Строка - новый пароль (не используется
//  СтруктураПарметровЗапросаВБанк	 - Структура:
//		ИмяМетода					 - Строка - имя метода, вызываемого в запросе в банк
//		МассивДокументов			 - Массив - массив ссылок на документы, для которых выполняется запрос в банке
//		Другие поля					 - различные другие поля, необходимые для составления запроса в банке
//
Процедура ВыполнитьЗапросВБанк(ПараметрыСоединенияТБС, СтруктураПарметровЗапросаВБанк) ЭКСПОРТ
	
	ИмяМетода = СтруктураПарметровЗапросаВБанк.ИмяМетода;
	
	Если ИмяМетода = "GetPaymentOrderStatus" Тогда
		
		МассивДокументов = СтруктураПарметровЗапросаВБанк.МассивДокументов;
		
		Для каждого ДокументСсылка Из МассивДокументов Цикл
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для документа: """+ ДокументСсылка + """'; ka = 'Для документа: """+ ДокументСсылка + """'"));
			
			НовыйДокументов = Новый Массив();
			НовыйДокументов.Добавить(ДокументСсылка);
		
			Массив_УИД_Документа = ИнтеграцияСБанкомTBC_Сервер.ПолучитьМассив_УИД_Документа(ДокументСсылка);
			
			Если Массив_УИД_Документа.Количество()=0 Тогда
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ: """+ДокументСсылка+""" ранее не выгружался в банк TBC'; ka = 'Документ: """+ДокументСсылка+""" ранее не выгружался в банк TBC'"));
				
				Продолжить;
			
			КонецЕсли;
			
			Для каждого ТекущаяУИД Из Массив_УИД_Документа Цикл
				
				НоваяСтруктураПарметровЗапросаВБанк = Новый Структура;
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода",ИмяМетода);
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("МассивДокументов",НовыйДокументов);
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("ЭтоПакет", СтруктураПарметровЗапросаВБанк.ЭтоПакет);
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("УИД", ТекущаяУИД);
				
				РезультатОперации = ВыполнитьМетодСервиса(ПараметрыСоединенияТБС, НоваяСтруктураПарметровЗапросаВБанк);
				
				Если РезультатОперации.Успешно Тогда
					
					СтруктураОтвета = РезультатОперации.ВозвращаемоеЗначение;
					
					ИнтеграцияСБанкомTBC_Сервер.ОбновитьСтатусДокумента(ДокументСсылка,СтруктураОтвета,НоваяСтруктураПарметровЗапросаВБанк);
					
				Иначе
					
					Если ТипЗНЧ(РезультатОперации.ВозвращаемоеЗначение) = Тип("Структура") И РезультатОперации.ВозвращаемоеЗначение.Свойство("ТекстОшибки") Тогда
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ВозвращаемоеЗначение.ТекстОшибки);
						
					Иначе
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.Описание);
						
					КонецЕсли;
					
				КонецЕсли;				
				
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли ИмяМетода = "ImportBatchPaymentOrder" Тогда
		
		МассивДокументов = СтруктураПарметровЗапросаВБанк.МассивДокументов;
		
		Для каждого ДокументСсылка Из МассивДокументов Цикл
			
			ТаблицаПозицийАдресВременногоХранилища = ИнтеграцияСБанкомTBC_Сервер.ПолучитьТаблицуПозицийВременноеХранилище();
			
			НовыйДокументов = Новый Массив();
			НовыйДокументов.Добавить(ДокументСсылка);
			
			НоваяСтруктураПарметровЗапросаВБанк = Новый Структура();
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода",ИмяМетода);
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("МассивДокументов",НовыйДокументов);
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("ВалютаУчета",СтруктураПарметровЗапросаВБанк.ВалютаУчета);
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("СтруктурыТэгов",СтруктураПарметровЗапросаВБанк.СтруктурыТэгов);
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("ТаблицаПозиций",ТаблицаПозицийАдресВременногоХранилища);
			
			РезультатОперации = ВыполнитьМетодСервиса(ПараметрыСоединенияТБС,НоваяСтруктураПарметровЗапросаВБанк);
			
			Если РезультатОперации.Успешно Тогда
				
				ИнтеграцияСБанкомTBC_Сервер.ОбработатьВыгрузкуДокументовВБанкНаСервере(РезультатОперации.ВозвращаемоеЗначение,ТаблицаПозицийАдресВременногоХранилища);
				
			Иначе
				
				Если ТипЗНЧ(РезультатОперации.ВозвращаемоеЗначение) = Тип("Структура") И РезультатОперации.ВозвращаемоеЗначение.Свойство("ТекстОшибки") Тогда
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ВозвращаемоеЗначение.ТекстОшибки);
					
				Иначе
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.Описание);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	
	ИначеЕсли ИмяМетода = "ImportSinglePaymentOrders" Тогда
		
		ТаблицаПозицийАдресВременногоХранилища = ИнтеграцияСБанкомTBC_Сервер.ПолучитьТаблицуПозицийВременноеХранилище();
		
		СтруктураПарметровЗапросаВБанк.Вставить("ТаблицаПозиций",ТаблицаПозицийАдресВременногоХранилища);
		
		РезультатОперации = ВыполнитьМетодСервиса(ПараметрыСоединенияТБС,СтруктураПарметровЗапросаВБанк);
		
		Если РезультатОперации.Успешно Тогда
			
			ИнтеграцияСБанкомTBC_Сервер.ОбработатьВыгрузкуДокументовВБанкНаСервере(РезультатОперации.ВозвращаемоеЗначение,ТаблицаПозицийАдресВременногоХранилища);
			
		Иначе
			
			Если ТипЗНЧ(РезультатОперации.ВозвращаемоеЗначение) = Тип("Структура") И РезультатОперации.ВозвращаемоеЗначение.Свойство("ТекстОшибки") Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ВозвращаемоеЗначение.ТекстОшибки);
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.Описание);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяМетода = "GetAccountMovements" Тогда
		
		ТаблицаДвиженийПоСчетуАдресВременногоХранилища = ИнтеграцияСБанкомTBC_Сервер.ПолучитьТаблицуДвиженийПоСчетуВременноеХранилище();
		
		СтруктураПарметровЗапросаВБанк.Вставить("ТаблицаДвиженийПоСчету",ТаблицаДвиженийПоСчетуАдресВременногоХранилища);
		
		ФильтраЗапроса = СтруктураПарметровЗапросаВБанк.ФильтраЗапроса;
		
		РезультатОперации = ВыполнитьМетодСервиса(ПараметрыСоединенияТБС,СтруктураПарметровЗапросаВБанк);
		
		Если РезультатОперации.Успешно Тогда
			
			result = РезультатОперации.ВозвращаемоеЗначение.result;
			totalCount = Число(result.totalCount);
			pager = result.pager;
			pageIndex = Число(pager.pageIndex);
			pageSize = Число(pager.pageSize);
			
			Если pageSize < totalCount Тогда
				
				pageIndex = pageIndex + 1;
				Пока (pageIndex*pageSize) <= totalCount Цикл
					
					pagerФильтр = Новый Структура("pageIndex,pageSize", pageIndex,pageSize);
					
					ФильтраЗапросаКопия = Новый Структура;
					Для Каждого ЭлементСтруктуры Из ФильтраЗапроса Цикл
						ФильтраЗапросаКопия.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
					КонецЦикла;
					ФильтраЗапросаКопия.Вставить("pager",pagerФильтр);
					
					СтруктураПарметровЗапросаВБанк.Вставить("ФильтраЗапроса", ФильтраЗапросаКопия);
					
					РезультатОперации_NextPage = ВыполнитьМетодСервиса(ПараметрыСоединенияТБС,СтруктураПарметровЗапросаВБанк);
					
					Если РезультатОперации_NextPage.Успешно Тогда
						
						ИнтеграцияСБанкомTBC_Сервер.ОбработатьДанныеДвиженийПоСчетуНаСервере(РезультатОперации_NextPage.ВозвращаемоеЗначение,ТаблицаДвиженийПоСчетуАдресВременногоХранилища);
						
					Иначе
						
						Если ТипЗНЧ(РезультатОперации_NextPage.ВозвращаемоеЗначение) = Тип("Структура") И РезультатОперации_NextPage.ВозвращаемоеЗначение.Свойство("ТекстОшибки") Тогда
							
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации_NextPage.ВозвращаемоеЗначение.ТекстОшибки);
							
						Иначе
							
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации_NextPage.Описание);
							
						КонецЕсли;
						
					КонецЕсли;
					
					pageIndex = pageIndex + 1;
					
				КонецЦикла;
				
			Иначе
				
				ИнтеграцияСБанкомTBC_Сервер.ОбработатьДанныеДвиженийПоСчетуНаСервере(РезультатОперации.ВозвращаемоеЗначение,ТаблицаДвиженийПоСчетуАдресВременногоХранилища);
				
			КонецЕсли;
			
		Иначе
			
			Если ТипЗНЧ(РезультатОперации.ВозвращаемоеЗначение) = Тип("Структура") И РезультатОперации.ВозвращаемоеЗначение.Свойство("ТекстОшибки") Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ВозвращаемоеЗначение.ТекстОшибки);
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.Описание);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - Выгрузить документы в банк
//
// Параметры:
//  ПараметрыСоединенияТБС	 - Структура:
//      TBC_Login					 - Строка - логин пользователя
//      TBC_Password				 - Строка - пароль пользователя
//      TBC_ТестовыйРежим			 - Булево - работаем в тестовом режиме
//      TBC_Сертификат				 - СправочникСсылка.Файлы - ссылка на справочник с хранилищем двоичных данных сертификата
//      ДвоичныеДанныеСертификата	 - ДвоичныеДанные,АдресВоВременномХранилище - двоичные данные сертификата
//      TBC_ПарольСертификата		 - Строка - пароль сертификата
//      TBC_РаботаЧерезСервер		 - Булево - предполагается, что соединение с сайтом TBC будет происходить с сервера 1С
//      TBC_ИспользоватьСертификат	 - Булево - ИСТИНА: соединение с банком с использованием сертификата подлинности; ЛОЖЬ - соединение с банком без сертификата подлинности
//      Nonce						 - Строка - Nonce
//      NewPassword					 - Строка - новый пароль (не используется)
//  СтруктураПарметровЗапросаВБанк	 - Структура:
//		ИмяМетода					 - Строка - имя метода, вызываемого в запросе в банк
//		МассивДокументов			 - Массив - массив ссылок на документы, для которых выполняется запрос в банке
//		Другие поля					 - различные другие поля, необходимые для составления запроса в банке
//				
// Возвращаемое значение: 
//   Структура:
//      Успешно				 - Булево - результат выполнения операции
//      ВозвращаемоеЗначение - Структура - содержит различные данные результата операции
//      Описание			 - Строка - текстовое описание результата операции
//
Функция ВыполнитьМетодСервиса(ПараметрыСоединенияТБС, СтруктураПарметровЗапросаВБанк) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = Новый Структура("Успешно,ВозвращаемоеЗначение,Описание",ЛОЖЬ,"","");
	
	ИмяМетода = СтруктураПарметровЗапросаВБанк.ИмяМетода;
	
	ПрефиксОтвета = "ns2:";
	СуфиксОтвета = "ResponseIo";
	ПрефиксЗапроса = "myg:";
	СуфиксЗапроса = "RequestIo";
	
	mhttp = СоздатьHTTPСоединение(ПараметрыСоединенияТБС);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept-Encoding", "gzip,deflate");
	Заголовки.Вставить("Content-Type"	, "text/xml; charset=utf-8");
	Заголовки.Вставить("SoapAction"		, "http://www.mygemini.com/schemas/mygemini/"+ИмяМетода+"");
	Заголовки.Вставить("Connection"		, "Keep-Alive");
	Заголовки.Вставить("User-Agent"		, "Apache-HttpClient/4.1.1 (java 1.5)");
	
	Запрос = Новый HTTPЗапрос("/", Заголовки);
	
	xml = "";
	xml = xml + ПолучитьТекстШапки(ПараметрыСоединенияТБС.TBC_Login,ПараметрыСоединенияТБС.TBC_Password,ПараметрыСоединенияТБС.Nonce,ИмяМетода,СуфиксЗапроса);
	
	МассивСсылокДокументовПакетов = НЕОПРЕДЕЛЕНО;
	
	xml = xml + ИнтеграцияСБанкомTBC_Сервер.СоздатьXMLСтруктуруЗапросаМетодаСервиса(СтруктураПарметровЗапросаВБанк,МассивСсылокДокументовПакетов,ПрефиксОтвета,СуфиксОтвета,ПрефиксЗапроса,СуфиксЗапроса);
	
	xml = xml + ПолучитьТекстОкончания(ИмяМетода, СуфиксЗапроса);
	
	Запрос.УстановитьТелоИзСтроки(xml, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.Использовать);
	
	Результат = mhttp.ОтправитьДляОбработки(Запрос);
	res = Результат.КодСостояния;
	
	СтрокаРезультат = Результат.ПолучитьТелоКакСтроку(); 
	СтрокаJSONРезультатОригенал = СтрокаРезультат; //+++ Дмгг, 15.02.24, ONESOFT-2913
	
	Если (СтрНайти(СтрокаРезультат, "Error 500") > 0) ИЛИ (res = 500) Тогда
		
		РЕЗ.Успешно = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = СтрокаРезультат;
		РЕЗ.Описание = НСтр("ka='შეცდომა მოთხოვნის გაგზავნისას';ru='Ошибка отправки запроса'");
		
	КонецЕсли;
	
	ТэгМетода = ПрефиксОтвета + ИмяМетода + СуфиксОтвета;
	ПозицНачТега = СтрНайти(СтрокаРезультат, "<"+ТэгМетода);
	ПозицНачОшибки = СтрНайти(СтрокаРезультат, "<faultstring");
	Если ПозицНачТега <> 0 Тогда 
		ДлинаКон = СтрДлина("</"+ТэгМетода+">");
		ПозцКон = СтрНайти(СтрокаРезультат, "</"+ТэгМетода+">");
		СтрокаРезультат = Сред(СтрокаРезультат,ПозицНачТега, ПозцКон + ДлинаКон - ПозицНачТега);
	ИначеЕсли ПозицНачОшибки <> 0 Тогда
		//Вытянем текст Ошибки
		ДлинаКон = СтрДлина("</faultstring>");
		ПозцКон = СтрНайти(СтрокаРезультат, "</faultstring>");
		ДлиннаНачТега = 27;
		СтрокаОшибки = Сред(СтрокаРезультат, ПозицНачОшибки + ДлиннаНачТега, ПозцКон - (ПозицНачОшибки+ДлиннаНачТега));
		Если СтрокаОшибки = "Field(s) validation exception" Тогда
			
			ТекстОшибки = СтрокаОшибки + ":
			|" + НСтр("ka='გადახდის დანიშნულება და კომენატრსი უნდა შეიცავდეს მხოლოდ ლათინურ სიმბოლოებს';ru='Назначение платежа и комментарии должны содержать только латинские символы'");
		
		Иначе	
			
			ТекстОшибки = НСтр("ka='შეცდომა მოთხოვნის გაგზავნისას:';ru='Ошибка отправки запроса:'") + "
			|" + СтрокаОшибки;
			
		КонецЕсли;
		
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("ТекстОшибки", ТекстОшибки);
		
		РЕЗ.Успешно = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = СтруктураОтвета;
		РЕЗ.Описание = РЕЗ.Описание + "
		|" + ТекстОшибки;
		
		Возврат РЕЗ;
	КонецЕсли;

	ПутьКВременномуФайлуОтвета = ПолучитьИмяВременногоФайла("xml"); 
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.ОткрытьФайл(ПутьКВременномуФайлуОтвета);
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();    
	
	ЗаписьXML.ЗаписатьБезОбработки(СтрокаРезультат);
	
	ЗаписьXML.Закрыть();
	
	///////////////////////////////////
	//Прочитаем
	
	//+++ Дмгг, 15.02.24, ONESOFT-2913
	//СтруктураОтвета = ПрочитатьФайлОтвета(ПутьКВременномуФайлуОтвета); 
	СтруктураОтвета = ПрочитатьФайлОтветаИзСтрокиРезультата(СтрокаJSONРезультатОригенал); 
	//--- Дмгг, 15.02.24, ONESOFT-2913
	
	УдалитьФайлы(ПутьКВременномуФайлуОтвета);
	
	РЕЗ.Успешно = ИСТИНА;
	РЕЗ.ВозвращаемоеЗначение = СтруктураОтвета;
	РЕЗ.Описание = "Successful";
	
	Возврат РЕЗ;
КонецФункции

Функция ПолучитьТекстШапки(TBC_Login,TBC_Password,Nonce,ИмяМетода,Суффикс)
	ПЕРЕМ РЕЗ;
	
	РЕЗ = "<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:myg=""http://www.mygemini.com/schemas/mygemini"" xmlns:wsse=""http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"">"
	+"<soapenv:Header>"
	+"<wsse:Security>"
	+"<wsse:UsernameToken>"
	+"<wsse:Username>"+СокрЛП(TBC_Login)+"</wsse:Username>"
	+"<wsse:Password>"+СокрЛП(TBC_Password)+"</wsse:Password>"
	+"<wsse:Nonce>"+ СокрЛП(Nonce) +"</wsse:Nonce>"
	+"</wsse:UsernameToken>"
	+"</wsse:Security>"
	+"</soapenv:Header>"
	+"<soapenv:Body>";
	Если ИмяМетода <> "ImportBatchPaymentOrder" Тогда 
		РЕЗ = РЕЗ +"<myg:"+ИмяМетода+Суффикс+">";
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ПолучитьТекстОкончания(ИмяМетода, Суффикс);
	
	ТекстВозврата = "";
	
	Если ИмяМетода <> "ImportBatchPaymentOrder" Тогда 
		ТекстВозврата = ТекстВозврата +"</myg:"+ИмяМетода+Суффикс+">";
	КонецЕсли;
	 
	ТекстВозврата = ТекстВозврата +"</soapenv:Body>"
	+"</soapenv:Envelope>";
	
	Возврат ТекстВозврата;
	
КонецФункции


