

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	//УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьОтображениеКолонкиПериодОтсутствия();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "Проведение"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьОтображениеКолонкиПериодОтсутствия()

	Для каждого ТекСтрока Из Объект.Невыходы Цикл
	
		ТекСтрока.ПериодОтсутствия.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		ТекСтрока.ПериодОтсутствия.ДатаНачала = ТекСтрока.ДатаНачала;
		ТекСтрока.ПериодОтсутствия.ДатаОкончания = ТекСтрока.ДатаОкончания;
	
	КонецЦикла; 	

КонецПроцедуры // УстановитьОтображениеКолонкиПериодОтсутствия()


&НаКлиенте
Процедура НевыходыПериодОтсутствияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Невыходы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
	
		ТекущиеДанные.ДатаНачала = ТекущиеДанные.ПериодОтсутствия.ДатаНачала;		
		ТекущиеДанные.ДатаОкончания = ТекущиеДанные.ПериодОтсутствия.ДатаОкончания;		
	
	КонецЕсли; 
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьОтображениеКолонкиПериодОтсутствия();
КонецПроцедуры


&НаСервере
Функция  НевыходыСотрудникПриИзмененииНаСервере(Сотрудник)
	
	Запррос = Новый Запрос;
	Запррос.Текст =
	"ВЫБРАТЬ
	|	СотрудникиСрезПоследних.Период КАК Период,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК Подразделение
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(, Сотрудник = &Сотрудник) КАК СотрудникиСрезПоследних";
	
	Запррос.УстановитьПараметр("Сотрудник",Сотрудник);
	
	ЗапрросРез = Запррос.Выполнить().Выгрузить();
	
	Если ЗапрросРез.Количество()>0 Тогда 
		Возврат ЗапрросРез[0].Подразделение;
	КонецЕсли;
	 
	 
КонецФункции

&НаКлиенте
Процедура НевыходыСотрудникПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Невыходы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Подразделение = НевыходыСотрудникПриИзмененииНаСервере(СтрокаТабличнойЧасти.Сотрудник);
	
	
	
	
КонецПроцедуры
 
