

Процедура ЗаполнитьНастройкиОтбор(врУзельОбмена) Экспорт 
	
	Если Не ЗначениеЗаполнено(врУзельОбмена) Тогда 
		Возврат;
	КонецЕсли; 	
	
	СтруктураОтбораСхемыОбмена = врУзельОбмена.ХранилищеОтбораСхемыОбмена.Получить();
	НастройкиСКД = ЭтотОбъект.КомпоновщикНастроек.Настройки;
	ЭлементыОтбораСКД = НастройкиСКД.Отбор.Элементы;
	ЭлементыОтбораСКД.Очистить();
	
	ПараметрСКД = НастройкиСКД.ПараметрыДанных.Элементы.Найти("Узел");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение = врУзельОбмена;
	
	Для Каждого стр Из СтруктураОтбораСхемыОбмена Цикл 
		ПараметрСКД = НастройкиСКД.ПараметрыДанных.Элементы.Найти(стр.Ключ);
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение = стр.Значение.ПравоеЗначение;
	КонецЦикла;
	
	ЭтотОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиСКД);
КонецПроцедуры
