
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасспределениеЗатратНаТовары.Ссылка,
		|	РасспределениеЗатратНаТовары.Номер,
		|	РасспределениеЗатратНаТовары.Дата,
		|	РасспределениеЗатратНаТовары.ДатаНачала,
		|	РасспределениеЗатратНаТовары.ДатаОкончания,
		|	РасспределениеЗатратНаТовары.Организация
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.РасспределениеЗатратНаТовары КАК РасспределениеЗатратНаТовары
		|ГДЕ
		|	РасспределениеЗатратНаТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.Ссылка,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.СчетУчета,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.ВидСубконто1,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.ВидСубконто2,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.ВидСубконто3,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.Ссылка.Дата КАК Период,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница_Подразделение,
		//ПодольскийАИ #УчетПроектов 16.12.2020 {
		|	Выбор 
		|		Когда &УчетПоПроектам 
		|			Тогда РасспределениеЗатратНаТоварыОстаткиПоСчетам.Проект
		|		Иначе Значение(Справочник.Проекты.ПустаяСсылка)
		|	Конец КАК Проект,
		//ПодольскийАИ #УчетПроектов 16.12.2020 }
		//+++ Дмгг
		|	Выбор 
		|		Когда &ИспользоватьПартии 
		|			Тогда РасспределениеЗатратНаТоварыОстаткиПоСчетам.Партия
		|		Иначе Значение(Справочник.ПартииНоменклатуры.ПустаяСсылка)
		|	Конец КАК Партия,
		//--- Дмгг
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.Номенклатура КАК НоменклатураРаспределения,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.Характеристика КАК ХарактеристикаРаспределения,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.Сумма
		|ПОМЕСТИТЬ ВременнаяТаблицаОборотыПоСчетам
		|ИЗ
		|	Документ.РасспределениеЗатратНаТовары.ОстаткиПоСчетам КАК РасспределениеЗатратНаТоварыОстаткиПоСчетам
		|ГДЕ
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.НомерСтроки,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Ссылка,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Ссылка.Организация КАК Организация,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Ссылка.Дата КАК Период,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Отметка,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Партия, //+++ Дмгг
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница_Склад,
		//ПодольскийАИ #УчетПроектов 24.12.2020 {
		|	Выбор
		|		Когда &УчетПоПроектам
		|			Тогда РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Проект
		|		Иначе Значение(Справочник.Проекты.ПустаяСсылка)
		|	Конец КАК Проект,
		//ПодольскийАИ #УчетПроектов 24.12.2020 }
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Номенклатура,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаЗапасовРегл,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Характеристика,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Количество,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Себистоимость,
		|	&ВалютаУчета КАК Валюта,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.СуммаРасходов КАК СуммаРасходов
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиТоваров
		|ИЗ
		|	Документ.РасспределениеЗатратНаТовары.ОстаткиТоваровНаСкладе КАК РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе
		|ГДЕ
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Отметка
		|	И РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Ссылка = &Ссылка
		//ПодольскийАИ #УчетПроектов 16.12.2020 {
		//Было---
		//|	И РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары)
		//Стало+++
		|	И (&УчетПоПроектам И РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам)
		|		ИЛИ РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары))
		//ПодольскийАИ #УчетПроектов 16.12.2020 }
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасспределениеЗатратНаТовары.ОбъемПродукцииРаботДляВычисленияАмортизацииНов КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
		|	РасспределениеЗатратНаТовары.СрокИспользованияДляВычисленияАмортизацииНов КАК СрокИспользованияДляВычисленияАмортизации,
		|	РасспределениеЗатратНаТовары.СчетЗатратНов КАК СчетЗатрат,
		|	РасспределениеЗатратНаТовары.СтруктурнаяЕдиницаНов КАК СтруктурнаяЕдиница,
		|	РасспределениеЗатратНаТовары.НаправлениеДеятельностиТек КАК НаправлениеДеятельности,
		|	РасспределениеЗатратНаТовары.СчетЗатратРеглНов КАК СчетЗатратРегл,
		|	РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизацииНов КАК СтоимостьДляВычисленияАмортизации,
		|	РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизацииНов - РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизацииТек КАК РазницаСтоимости,
		|	РасспределениеЗатратНаТовары.НачислятьАмортизациюВТекущемМесяцеНов КАК ПрименитьВТекущемМесяце,
		|	РасспределениеЗатратНаТовары.Организация,
		|	РасспределениеЗатратНаТовары.ВнеоборотныйАктив,
		|	РасспределениеЗатратНаТовары.Ссылка КАК Ссылка,
		|	&ВалютаУчета КАК Валюта,
		|	РасспределениеЗатратНаТовары.Дата КАК Период,
		|	РасспределениеЗатратНаТовары.АдресНовый КАК Адрес,
		|	РасспределениеЗатратНаТовары.ГодовойПроцентАмортизацииДляУменьшенногоОстаткаНов КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
		|	РасспределениеЗатратНаТовары.ЛиквидационнаяСтоимостьДляУменьшенногоОстаткаНов КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка
		|ПОМЕСТИТЬ ВременнаяТаблицаИмущество
		|ИЗ
		|	Документ.РасспределениеЗатратНаТовары КАК РасспределениеЗатратНаТовары
		|ГДЕ
		|	РасспределениеЗатратНаТовары.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.НаИмущество)
		|	И РасспределениеЗатратНаТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасспределениеЗатратНаТовары.ОбъемПродукцииРаботДляВычисленияАмортизацииНов КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
		|	РасспределениеЗатратНаТовары.СрокИспользованияДляВычисленияАмортизацииНов КАК СрокИспользованияДляВычисленияАмортизации,
		|	РасспределениеЗатратНаТовары.СчетЗатратНов КАК СчетЗатрат,
		|	РасспределениеЗатратНаТовары.СтруктурнаяЕдиницаНов КАК СтруктурнаяЕдиница,
		|	РасспределениеЗатратНаТовары.НаправлениеДеятельностиТек КАК НаправлениеДеятельности,
		|	РасспределениеЗатратНаТовары.СчетЗатратРеглНов КАК СчетДт,
		|	РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизацииНов КАК СтоимостьДляВычисленияАмортизации,
		|	РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизацииНов - РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизацииТек КАК РазницаСтоимости,
		//|	РасспределениеЗатратНаТовары.СчетПереоценкиНов КАК СчетПереоценки,
		//|	РасспределениеЗатратНаТовары.СчетПереоценкиРеглНов КАК СчетПереоценкиРегл,
		|	РасспределениеЗатратНаТовары.НачислятьАмортизациюВТекущемМесяцеНов КАК ПрименитьВТекущемМесяце,
		|	РасспределениеЗатратНаТовары.Организация,
		|	РасспределениеЗатратНаТовары.ВнеоборотныйАктив,
		|	РасспределениеЗатратНаТовары.Дата КАК Период,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.СчетУчета КАК СчетКт,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.Сумма,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница_Подразделение,
		|	&ВалютаУчета КАК Валюта
		|ПОМЕСТИТЬ ВременнаяТаблицаИмуществоДляХозрасчетного
		|ИЗ
		|	Документ.РасспределениеЗатратНаТовары.ОстаткиПоСчетам КАК РасспределениеЗатратНаТоварыОстаткиПоСчетам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасспределениеЗатратНаТовары КАК РасспределениеЗатратНаТовары
		|		ПО РасспределениеЗатратНаТоварыОстаткиПоСчетам.Ссылка = РасспределениеЗатратНаТовары.Ссылка
		|ГДЕ
		|	РасспределениеЗатратНаТовары.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.НаИмущество)
		|	И РасспределениеЗатратНаТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", 		ДокументСсылкаРасспределениеЗатратНаТовары);
	Запрос.УстановитьПараметр("ВалютаУчета", 		УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета());
	
	//ПодольскийАИ #УчетПроектов 19.12.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 19.12.2020 }
	//+++ Дмгг
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	//--- Дмгг
	
	Запрос.Выполнить();
	// Kuzmuch, 26.07.2024,(ONESOFT-3263) Расспределение затрат на товары - операция: на товары, закомментировал
	//ПодольскийАИ #УчетПроектов 16.12.2020 {
	//Если СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам Тогда
	//	ЗаполнитьРаспределитьСуммыПоИзмерениямПодразделениеПроект(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	//КонецЕсли;
	//ПодольскийАИ #УчетПроектов 16.12.2020 }
	// Kuzmuch, 26.07.2024,(ONESOFT-3263) Расспределение затрат на товары - операция: на товары
	
	СформироватьВременнаяТаблицаВычислениеДолиСуммРаспределения(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	СформироватьВременнаяТаблицаОпределенияСубконто(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьВременнаяТаблицаДанныхСубконто(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_РасспределениеЗатратНаТовары(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗапасы(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	//СформироватьТаблицаДоходыИРасходы(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВнеоборотныеАктивы(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасы(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СодержаниеПроводки", НСТР("ka='Расспределение затрат';ru='Расспределение затрат';en='ALLOTMENT costs'"));
	Запрос.УстановитьПараметр("Период", ДокументСсылкаРасспределениеЗатратНаТовары.Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	2 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Период КАК Период,
	//|	&Период КАК Период,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Склад КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Подразделение КАК КоррСтруктурнаяЕдиница,
	
	//ПодольскийАИ #УчетПроектов 19.12.2020 {
	|	Выбор
	|		Когда ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам)
	|			ТОГДА ТаблицаДокумента.Номенклатура.Проект
	//Малышев 2024-08-23 (--
	//|		ИНАЧЕ ТаблицаДокумента.Проект
	|       ИНАЧЕ ТаблицаДокумента.КоррПроект 
	//Малышев 2024-08-23 --)
	|	Конец КАК Проект,
	
	//ПодольскийАИ #УчетПроектов 19.12.2020 }
	//+++ Дмгг
	|	ТаблицаДокумента.Партия,
	//--- Дмгг
	
	//|	ТаблицаДокумента.Проект КАК КоррПроект,
	|	ТаблицаДокумента.КоррПроект КАК КоррПроект,  //Малышев 2024-08-23
	
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары)
	//ПодольскийАИ #УчетПроектов 24.12.2020 {
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам)
	//|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаЗапасовРегл.СчетАналогУУ
	|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаЗапасов
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.НаИмущество)
	//|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаРегл.СчетАналогУУ
	|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаЗапасов
	//ПодольскийАИ #УчетПроектов 24.12.2020 }
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары)
	//ПодольскийАИ #УчетПроектов 24.12.2020 {
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам)
	|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаЗапасовРегл
	//ПодольскийАИ #УчетПроектов 24.12.2020 }
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.НаИмущество)
	//ПодольскийАИ #Баги 09.06.2021 {
	//|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаРегл
	|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаЗапасовРегл
	//ПодольскийАИ #Баги 09.06.2021 }
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Номенклатура.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
	|	ТаблицаДокумента.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ТаблицаДокумента.СчетУчета КАК КоррСчетУчетаРегл,
	//ПодольскийАИ #УчетПроектов 24.12.2020 {
	//|	ТаблицаДокумента.СчетУчета.СчетАналогУУ КАК КоррСчетУчета,
	|	ТаблицаДокумента.СчетУчета КАК КоррСчетУчета,
	//ПодольскийАИ #УчетПроектов 24.12.2020 }
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.НоменклатураРаспределения КАК КоррНоменклатура,
	|	ТаблицаДокумента.ХарактеристикаРаспределения КАК КоррХарактеристика,
	|	0 КАК Количество,
	|	&СодержаниеПроводки КАК СодержаниеПроводки,
	|	ТаблицаДокумента.ДокументПоступления КАК ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|   ИСТИНА КАК ФиксированнаяСтоимость
	|ИЗ
	|	ВременнаяТаблицаРаспределениеСумм КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары)
	//ПодольскийАИ #УчетПроектов 19.12.2020 {
	|	ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам)
	//ПодольскийАИ #УчетПроектов 19.12.2020 }
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Период,
	//|	&Период КАК Период,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Подразделение,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Склад,
	
	//ПодольскийАИ #УчетПроектов 29.12.2020 {
	//|	Значение(Справочник.Номенклатура.ПустаяСсылка),//ТаблицаДокумента.Номенклатура,
	//|	ТаблицаДокумента.СчетУчета.СчетАналогУУ,
	|	ТаблицаДокумента.Проект,
	////+++ Дмгг
	//|	ТаблицаДокумента.Партия,
	////--- Дмгг
	// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
	|	ТаблицаДокумента.ПартияРаспределения,
	// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
	
	|	Выбор
	|		Когда ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам)
	|			ТОГДА ТаблицаДокумента.Номенклатура.Проект
	//|		ИНАЧЕ ТаблицаДокумента.Проект
	|	    ИНАЧЕ ТаблицаДокумента.КоррПроект  //Малышев 2024-08-23
	|	Конец,
	
	|	ТаблицаДокумента.НоменклатураРаспределения,
	|	ТаблицаДокумента.СчетУчета,
	//ПодольскийАИ #УчетПроектов 29.12.2020 }
	|	ТаблицаДокумента.СчетУчета,
	|	NULL,
	|	NULL,
	|	ТаблицаДокумента.Номенклатура.СчетУчетаЗапасовРегл,
	|	ТаблицаДокумента.Номенклатура.СчетУчетаЗапасов,
	|	ТаблицаДокумента.ХарактеристикаРаспределения,
	|	ТаблицаДокумента.Номенклатура,
	|	ТаблицаДокумента.Характеристика,
	|	0,
	|	&СодержаниеПроводки,
	|	неопределено, //Малышев 2024-11-29 ONESOFT-3641
	|	ТаблицаДокумента.Сумма,
	|   ИСТИНА
	|ИЗ
	|	ВременнаяТаблицаРаспределениеСумм КАК ТаблицаДокумента";
	//ПодольскийАИ #УчетПроектов 24.12.2020 {
	//|ГДЕ
	//|	(ТаблицаДокумента.СчетУчета.СчетАналогУУ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	//|			ИЛИ ТаблицаДокумента.СчетУчета.СчетАналогУУ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))";
	//ПодольскийАИ #УчетПроектов 24.12.2020 }
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаДвижений = РезультатЗапроса.Выгрузить(); 
	ТаблицаДвижений.Сортировать("НомерСтроки");
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", ТаблицаДвижений);
	
КонецПроцедуры // СформироватьТаблицаЗапасы()

// Подготовка таблицы для определения Субконто
// в колонках временной таблицы на выходе должны быть СчетДт, СчетКт и колонки с именами всех сумконто
Процедура СформироватьВременнаяТаблицаОпределенияСубконто(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары)
	//ПодольскийАИ #УчетПроектов 19.12.2020 {
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам)
	//ПодольскийАИ #УчетПроектов 19.12.2020 }
	|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаЗапасовРегл
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.НаИмущество)
	//ПодольскийАИ #Баги 09.06.2021 {
	//|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаРегл
	//--------------------------------------------------------------------------
	// © Шишка В.В. [22 сентября 2021]  НАЧАЛО
	//|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаЗапасовРегл
	|	        ТОГДА ВЫБОР КОГДА ТаблицаДокумента.Номенклатура Ссылка Справочник.ВнеоборотныеАктивы ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаРегл
	|					ИНАЧЕ ТаблицаДокумента.Номенклатура.СчетУчетаЗапасовРегл КОНЕЦ
	// © Шишка В.В. [22 сентября 2021]  КОНЕЦ
	//--------------------------------------------------------------------------
	//ПодольскийАИ #Баги 09.06.2021 }
	|	КОНЕЦ КАК СчетДт,
	|	ТаблицаДокумента.СчетУчета КАК СчетКт,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Валюта КАК Валюта,
	|	НЕОПРЕДЕЛЕНО КАК ПродавцыДт,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Склад КАК ПодразделенияДт,
	
	//Малышев 2024-08-23 (--
	////ПодольскийАИ #УчетПроектов 19.12.2020 {
	//|	ТаблицаДокумента.Проект КАК ПроектыДт,
	////ПодольскийАИ #УчетПроектов 19.12.2020 }
	|	ТаблицаДокумента.КоррПроект КАК ПроектыДт,
	//Малышев 2024-08-23 --)
	
	|	НЕОПРЕДЕЛЕНО КАК СчетФактураПокупателяДт,
	|	ТаблицаДокумента.Валюта КАК ВалютыДт,
	|	НЕОПРЕДЕЛЕНО КАК СотрудникиДт,
	|	ТаблицаДокумента.Номенклатура КАК СотрудникНоменклатураДт,
	|	НЕОПРЕДЕЛЕНО КАК КонтрагентыСотрудникиДт,
	|	НЕОПРЕДЕЛЕНО КАК КонтрагентыДт,
	|	НЕОПРЕДЕЛЕНО КАК СчетФактураПоставщикаДт,
	|	ТаблицаДокумента.Номенклатура КАК НоменклатураДт,
	|	ТаблицаДокумента.Характеристика КАК ХарактеристикиНоменклатурыДт,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Подразделение КАК ОбособленныеПодразделенияДт,
	|	ТаблицаДокумента.Номенклатура КАК ПродукцияДт,
	|	НЕОПРЕДЕЛЕНО КАК БанковскиеСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК КассаДт,
	|	НЕОПРЕДЕЛЕНО КАК СтавкиНДФЛДт,
	|	ТаблицаДокумента.Ссылка КАК ДокументДт,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Склад КАК СкладыДт,
	|	НЕОПРЕДЕЛЕНО КАК ТипыСуммГрафикаКредитовИЗаймовДт,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорыКредитовИЗаймовДт,
	|	НЕОПРЕДЕЛЕНО КАК НомераГТДДт,
	|	НЕОПРЕДЕЛЕНО КАК РаботникиОрганизацийДт,
	|	НЕОПРЕДЕЛЕНО КАК СтатьиДвиженияДенежныхСредствДт,
	|	ТаблицаДокумента.Номенклатура КАК ИмуществоДт,
	|	НЕОПРЕДЕЛЕНО КАК ДокументыРасчетовСКонтрагентамиДт,
	|	НЕОПРЕДЕЛЕНО КАК ПартииДт,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорыДт,
	|	ТаблицаДокумента.Номенклатура КАК ОСТСДт,
	|	НЕОПРЕДЕЛЕНО КАК ПродавцыКт,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Подразделение КАК ПодразделенияКт,
	//ПодольскийАИ #УчетПроектов 19.12.2020 {
	|	ТаблицаДокумента.Проект КАК ПроектыКт,
	//ПодольскийАИ #УчетПроектов 19.12.2020 }
	|	НЕОПРЕДЕЛЕНО КАК СчетФактураПокупателяКт,
	|	ТаблицаДокумента.Валюта КАК ВалютыКт,
	|	НЕОПРЕДЕЛЕНО КАК СотрудникиКт,
	|	ТаблицаДокумента.Номенклатура КАК СотрудникНоменклатураКт,
	|	НЕОПРЕДЕЛЕНО КАК КонтрагентыСотрудникиКт,
	|	НЕОПРЕДЕЛЕНО КАК КонтрагентыКт,
	|	НЕОПРЕДЕЛЕНО КАК СчетФактураПоставщикаКт,
	//|	ТаблицаДокумента.Номенклатура КАК НоменклатураКт,
	//|	ТаблицаДокумента.Характеристика КАК ХарактеристикиНоменклатурыКт,
	|	ТаблицаДокумента.НоменклатураРаспределения КАК НоменклатураКт,
	|	ТаблицаДокумента.ХарактеристикаРаспределения КАК ХарактеристикиНоменклатурыКт,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Подразделение КАК ОбособленныеПодразделенияКт,
	|	ТаблицаДокумента.Номенклатура КАК ПродукцияКт,
	|	НЕОПРЕДЕЛЕНО КАК БанковскиеСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК КассаКт,
	|	НЕОПРЕДЕЛЕНО КАК СтавкиНДФЛКт,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Склад КАК СкладыКт,
	|	НЕОПРЕДЕЛЕНО КАК ТипыСуммГрафикаКредитовИЗаймовКт,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорыКредитовИЗаймовКт,
	|	НЕОПРЕДЕЛЕНО КАК НомераГТДКт,
	|	НЕОПРЕДЕЛЕНО КАК РаботникиОрганизацийКт,
	|	НЕОПРЕДЕЛЕНО КАК СтатьиДвиженияДенежныхСредствКт,
	|	ТаблицаДокумента.Номенклатура КАК ИмуществоКт,
	|	НЕОПРЕДЕЛЕНО КАК ДокументыРасчетовСКонтрагентамиКт,
	|	ТаблицаДокумента.Ссылка КАК ДокументКт,
	|	НЕОПРЕДЕЛЕНО КАК ПартииКт,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорыКт,
	|	ТаблицаДокумента.Номенклатура КАК ОСТСКт
	|ПОМЕСТИТЬ ВременнаяТаблицаОпределенияСубконто
	|ИЗ
	|	ВременнаяТаблицаРаспределениеСумм КАК ТаблицаДокумента";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура СформироватьВременнаяТаблицаВычислениеДолиСуммРаспределения(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	
	//ПодольскийАИ #УчетПроектов 24.12.2020 {
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВременнаяТаблицаОстаткиТоваров.Номенклатура КАК Номенклатура,
			|	ВременнаяТаблицаОстаткиТоваров.Характеристика КАК Характеристика,
			|	ВременнаяТаблицаОстаткиТоваров.СтруктурнаяЕдиница_Склад КАК СтруктурнаяЕдиница_Склад,
			|	ВременнаяТаблицаОстаткиТоваров.Проект КАК Проект,
			|	ВременнаяТаблицаОстаткиТоваров.Партия КАК Партия,
			|	ВременнаяТаблицаОстаткиТоваров.Количество КАК Количество,
			|	ВременнаяТаблицаОстаткиТоваров.Себистоимость КАК Себистоимость,
			|	ВременнаяТаблицаОстаткиТоваров.Ссылка КАК Ссылка,
			|	ВременнаяТаблицаОстаткиТоваров.Организация КАК Организация,
			|	ВременнаяТаблицаОстаткиТоваров.Период КАК Период,
			|	ВременнаяТаблицаОстаткиТоваров.Валюта КАК Валюта,
			|	ВременнаяТаблицаОстаткиТоваров.ДокументПоступления как ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
			|	ВременнаяТаблицаОстаткиТоваров.СуммаРасходов КАК СуммаРасходов
			|ПОМЕСТИТЬ ВТ_ОстаткиТоваров
			|ИЗ
			|	ВременнаяТаблицаОстаткиТоваров КАК ВременнаяТаблицаОстаткиТоваров
			|ГДЕ
			|	ВременнаяТаблицаОстаткиТоваров.Отметка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РасспределениеЗатратНаТовары.ВнеоборотныйАктив,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
			|	РасспределениеЗатратНаТовары.СтруктурнаяЕдиница,
			|	ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка),
			|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка),
			|	1,
			|	РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизации - РасспределениеЗатратНаТовары.РазницаСтоимости,
			|	РасспределениеЗатратНаТовары.Ссылка,
			|	РасспределениеЗатратНаТовары.Организация,
			|	РасспределениеЗатратНаТовары.Период,
			|	РасспределениеЗатратНаТовары.Валюта,
			|	Неопределено,
			|	РасспределениеЗатратНаТовары.РазницаСтоимости
			|ИЗ
			|	ВременнаяТаблицаИмущество КАК РасспределениеЗатратНаТовары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблицаОборотыПоСчетам.СчетУчета КАК СчетУчета,
			|	ВременнаяТаблицаОборотыПоСчетам.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница_Подразделение,
			|	ВременнаяТаблицаОборотыПоСчетам.Проект КАК Проект,
			|	ВременнаяТаблицаОборотыПоСчетам.НоменклатураРаспределения КАК НоменклатураРаспределения,
			|	ВременнаяТаблицаОборотыПоСчетам.ХарактеристикаРаспределения КАК ХарактеристикаРаспределения,
			|	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто1 КАК ВидСубконто1,
			|	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто2 КАК ВидСубконто2,
			|	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто3 КАК ВидСубконто3,
			|	ВЫРАЗИТЬ(ВременнаяТаблицаОборотыПоСчетам.Сумма КАК ЧИСЛО(15, 2)) КАК Сумма
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|	,ВременнаяТаблицаОборотыПоСчетам.Партия КАК Партия
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|ПОМЕСТИТЬ ВТ_Обороты
			|ИЗ
			|	ВременнаяТаблицаОборотыПоСчетам КАК ВременнаяТаблицаОборотыПоСчетам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			// Kuzmuch, 26.07.2024,(ONESOFT-3263) Расспределение затрат на товары - операция: на товары, закомментировал
			//|	ВТ_Обороты.Проект КАК Проект,
			// Kuzmuch, 26.07.2024,(ONESOFT-3263) Расспределение затрат на товары - операция: на товары
			|	СУММА(ВТ_Обороты.Сумма) КАК Сумма
			|ПОМЕСТИТЬ ВТ_ОборотыГрупп
			|ИЗ
			|	ВТ_Обороты КАК ВТ_Обороты
			// Kuzmuch, 26.07.2024,(ONESOFT-3263) Расспределение затрат на товары - операция: на товары, закомментировал
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	ВТ_Обороты.Проект
			// Kuzmuch, 26.07.2024,(ONESOFT-3263) Расспределение затрат на товары - операция: на товары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ОстаткиТоваров.Номенклатура КАК Номенклатура,
			|	ВТ_ОстаткиТоваров.Характеристика КАК Характеристика,
			|	ВТ_ОстаткиТоваров.ДокументПоступления КАК ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
			|	ВТ_ОстаткиТоваров.СуммаРасходов КАК СуммаРасходов,
			|	ВТ_Обороты.СчетУчета КАК СчетУчета,
			|	ВТ_Обороты.Сумма КАК СуммаПоСчету,
			|	ЕСТЬNULL(ВТ_ОборотыГрупп.Сумма, 0) КАК СуммаГрупп,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_ОстаткиТоваров.СуммаРасходов, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВТ_ОборотыГрупп.Сумма / ВТ_ОстаткиТоваров.СуммаРасходов
			|	КОНЕЦ КАК Коэф,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_ОборотыГрупп.Сумма, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Обороты.Сумма / (ВТ_ОборотыГрупп.Сумма / ВТ_ОстаткиТоваров.СуммаРасходов) КАК ЧИСЛО(15, 2))
			|	КОНЕЦ КАК ЧастьСуммы,
			|	ВТ_Обороты.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница_Подразделение,
			|	ВТ_Обороты.Проект КАК Проект,
			|	ВТ_ОстаткиТоваров.Проект как КоррПроект, //Малышев 2024-08-23
			|	ВТ_ОстаткиТоваров.Партия КАК Партия,
			|	ВТ_Обороты.НоменклатураРаспределения КАК НоменклатураРаспределения,
			|	ВТ_Обороты.ХарактеристикаРаспределения КАК ХарактеристикаРаспределения,
			|	ВТ_Обороты.ВидСубконто1 КАК ВидСубконто1,
			|	ВТ_Обороты.ВидСубконто2 КАК ВидСубконто2,
			|	ВТ_Обороты.ВидСубконто3 КАК ВидСубконто3,
			|	ВТ_ОстаткиТоваров.СтруктурнаяЕдиница_Склад КАК СтруктурнаяЕдиница_Склад,
			|	ЕСТЬNULL(ВТ_ОстаткиТоваров.Количество, 0) КАК Количество,
			|	ЕСТЬNULL(ВТ_ОстаткиТоваров.Себистоимость, 0) КАК Себистоимость,
			|	ВТ_ОстаткиТоваров.Валюта КАК Валюта,
			|	ВТ_ОстаткиТоваров.Организация КАК Организация,
			|	ВТ_ОстаткиТоваров.Период КАК Период,
			|	ВТ_ОстаткиТоваров.Ссылка КАК Ссылка
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|	,ВТ_Обороты.Партия КАК ПартияРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|ПОМЕСТИТЬ ВТРаспред
			|ИЗ
			|	ВТ_Обороты КАК ВТ_Обороты,
			|	ВТ_ОборотыГрупп КАК ВТ_ОборотыГрупп,
			|	ВТ_ОстаткиТоваров КАК ВТ_ОстаткиТоваров
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(ВТРаспред.ЧастьСуммы) КАК МаксЧасть,
			|	ВТРаспред.СуммаПоСчету КАК СуммаПоСчету,
			|	СУММА(ВТРаспред.ЧастьСуммы) КАК ЧастьСуммы,
			|	ВТРаспред.СуммаПоСчету - СУММА(ВТРаспред.ЧастьСуммы) КАК Разница,
			|	ВТРаспред.СчетУчета КАК СчетУчета,
			|	ВТРаспред.Проект КАК Проект,
			|	ВЫБОР
			|		КОГДА &ИспользоватьПартии
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
			|		ИНАЧЕ ВТРаспред.СтруктурнаяЕдиница_Подразделение
			|	КОНЕЦ КАК СтруктурнаяЕдиница_Подразделение,
			|	ВЫБОР
			|		КОГДА &ИспользоватьПартии
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|		ИНАЧЕ ВТРаспред.НоменклатураРаспределения
			|	КОНЕЦ КАК НоменклатураРаспределения,
			|	ВЫБОР
			|		КОГДА &ИспользоватьПартии
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|		ИНАЧЕ ВТРаспред.ХарактеристикаРаспределения
			|	КОНЕЦ КАК ХарактеристикаРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|	,ВТРаспред.ПартияРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|ПОМЕСТИТЬ ВТ_РаспредГруппПроверка
			|ИЗ
			|	ВТРаспред КАК ВТРаспред
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТРаспред.СуммаПоСчету,
			|	ВТРаспред.СчетУчета,
			|	ВТРаспред.Проект,
			|	ВЫБОР
			|		КОГДА &ИспользоватьПартии
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
			|		ИНАЧЕ ВТРаспред.СтруктурнаяЕдиница_Подразделение
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА &ИспользоватьПартии
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|		ИНАЧЕ ВТРаспред.НоменклатураРаспределения
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА &ИспользоватьПартии
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|		ИНАЧЕ ВТРаспред.ХарактеристикаРаспределения
			|	КОНЕЦ
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|	,ВТРаспред.ПартияРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_РаспредГруппПроверка.МаксЧасть КАК МаксЧасть,
			|	ВТ_РаспредГруппПроверка.СуммаПоСчету КАК СуммаПоСчету,
			|	ВТ_РаспредГруппПроверка.ЧастьСуммы КАК ЧастьСуммы,
			|	ВТ_РаспредГруппПроверка.Разница КАК Разница,
			|	ВТ_РаспредГруппПроверка.СчетУчета КАК СчетУчета,
			|	ВТ_РаспредГруппПроверка.Проект КАК Проект,
			|	ВТРаспред.Номенклатура КАК Номенклатура,
			|	ВТРаспред.Характеристика КАК Характеристика,
			|	ВТРаспред.КоррПроект КАК КоррПроект, //Малышев 2024-08-23
			|	ВТРаспред.ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
			|	МАКСИМУМ(ВТРаспред.Себистоимость) КАК Себистоимость,
			|	ВЫБОР
			|		КОГДА &ИспользоватьПартии
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
			|		ИНАЧЕ ВТРаспред.СтруктурнаяЕдиница_Подразделение
			|	КОНЕЦ КАК СтруктурнаяЕдиница_Подразделение,
			|	ВЫБОР
			|		КОГДА &ИспользоватьПартии
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|		ИНАЧЕ ВТРаспред.НоменклатураРаспределения
			|	КОНЕЦ КАК НоменклатураРаспределения,
			|	ВЫБОР
			|		КОГДА &ИспользоватьПартии
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|		ИНАЧЕ ВТРаспред.ХарактеристикаРаспределения
			|	КОНЕЦ КАК ХарактеристикаРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|	,ВТРаспред.ПартияРаспределения КАК ПартияРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|ПОМЕСТИТЬ ВТ_РаспредГруппПроверка2
			|ИЗ
			|	ВТ_РаспредГруппПроверка КАК ВТ_РаспредГруппПроверка
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспред КАК ВТРаспред
			|		ПО ВТ_РаспредГруппПроверка.СуммаПоСчету = ВТРаспред.СуммаПоСчету
			|			И ВТ_РаспредГруппПроверка.МаксЧасть = ВТРаспред.ЧастьСуммы
			|			И ВТ_РаспредГруппПроверка.СчетУчета = ВТРаспред.СчетУчета
			|			И ВТ_РаспредГруппПроверка.Проект = ВТРаспред.Проект
			|			И (ВЫБОР
			|				КОГДА &ИспользоватьПартии
			|					ТОГДА ИСТИНА
			|				ИНАЧЕ ВТ_РаспредГруппПроверка.СтруктурнаяЕдиница_Подразделение = ВТРаспред.СтруктурнаяЕдиница_Подразделение
			|			КОНЕЦ)
			|			И (ВЫБОР
			|				КОГДА &ИспользоватьПартии
			|					ТОГДА ИСТИНА
			|				ИНАЧЕ ВТ_РаспредГруппПроверка.НоменклатураРаспределения = ВТРаспред.НоменклатураРаспределения
			|			КОНЕЦ)
			|			И (ВЫБОР
			|				КОГДА &ИспользоватьПартии
			|					ТОГДА ИСТИНА
			|				ИНАЧЕ ВТ_РаспредГруппПроверка.ХарактеристикаРаспределения = ВТРаспред.ХарактеристикаРаспределения
			|			КОНЕЦ)
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|			И ВТ_РаспредГруппПроверка.ПартияРаспределения = ВТРаспред.ПартияРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_РаспредГруппПроверка.МаксЧасть,
			|	ВТ_РаспредГруппПроверка.СуммаПоСчету,
			|	ВТ_РаспредГруппПроверка.ЧастьСуммы,
			|	ВТ_РаспредГруппПроверка.Разница,
			|	ВТ_РаспредГруппПроверка.СчетУчета,
			|	ВТ_РаспредГруппПроверка.Проект,
			|	ВТРаспред.КоррПроект, //Малышев 2024-08-23
			|	ВТРаспред.ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
			|	ВТРаспред.Номенклатура,
			|	ВТРаспред.Характеристика,
			|	ВЫБОР
			|		КОГДА &ИспользоватьПартии
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
			|		ИНАЧЕ ВТРаспред.СтруктурнаяЕдиница_Подразделение
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА &ИспользоватьПартии
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|		ИНАЧЕ ВТРаспред.НоменклатураРаспределения
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА &ИспользоватьПартии
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|		ИНАЧЕ ВТРаспред.ХарактеристикаРаспределения
			|	КОНЕЦ
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|	,ВТРаспред.ПартияРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТРаспред.Номенклатура КАК Номенклатура,
			|	ВТРаспред.Характеристика КАК Характеристика,
			|	МИНИМУМ(ВТРаспред.ЧастьСуммы) КАК МинимальнаяЧасть,
			|	СУММА(ВТРаспред.ЧастьСуммы) КАК ЧастьСуммы,
			|	ВТРаспред.СчетУчета КАК СчетУчета,
			|	ВТРаспред.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница_Подразделение,
			|	ВТРаспред.Проект КАК Проект,
			|	ВТРаспред.КоррПроект КАК КоррПроект, //Малышев 2024-08-23
			|	ВТРаспред.Партия КАК Партия,
			|	ВТРаспред.НоменклатураРаспределения КАК НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения КАК ХарактеристикаРаспределения,
			|	ВТРаспред.ВидСубконто1 КАК ВидСубконто1,
			|	ВТРаспред.ВидСубконто2 КАК ВидСубконто2,
			|	ВТРаспред.ВидСубконто3 КАК ВидСубконто3,
			|	ВТРаспред.СтруктурнаяЕдиница_Склад КАК СтруктурнаяЕдиница_Склад,
			|	ВТРаспред.Количество КАК Количество,
			|	ВТРаспред.Себистоимость КАК Себистоимость,
			|	ВТРаспред.Валюта КАК Валюта
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|	,ВТРаспред.ПартияРаспределения КАК ПартияРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|ПОМЕСТИТЬ ВТ_РаспредГрупп
			|ИЗ
			|	ВТРаспред КАК ВТРаспред
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТРаспред.Номенклатура,
			|	ВТРаспред.Характеристика,
			|	ВТРаспред.СчетУчета,
			|	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
			|	ВТРаспред.Проект,
			|	ВТРаспред.КоррПроект, //Малышев 2024-08-23
			|	ВТРаспред.Партия,
			|	ВТРаспред.НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения,
			|	ВТРаспред.ВидСубконто3,
			|	ВТРаспред.СтруктурнаяЕдиница_Склад,
			|	ВТРаспред.ВидСубконто1,
			|	ВТРаспред.ВидСубконто2,
			|	ВТРаспред.Количество,
			|	ВТРаспред.Себистоимость,
			|	ВТРаспред.Валюта
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|	,ВТРаспред.ПартияРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТРаспред.Номенклатура КАК Номенклатура,
			|	ВТРаспред.Характеристика КАК Характеристика,
			|	ВТРаспред.СуммаРасходов КАК СуммаРасходов,
			|	ВТРаспред.СчетУчета КАК СчетУчета,
			|	ВТРаспред.СуммаПоСчету КАК СуммаПоСчету,
			|	ВТРаспред.СуммаГрупп КАК СуммаГрупп,
			|	ВТРаспред.Коэф КАК Коэф,
			|	ВТРаспред.ЧастьСуммы КАК ЧастьСуммы,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
			|	КОНЕЦ КАК СуммаПоСчетуРаспределение,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.МинимальнаяЧасть, 0) = 0
			|			ТОГДА ВТРаспред.ЧастьСуммы
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ВТРаспред.СуммаПоСчету - ВЫБОР
			|						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
			|							ТОГДА ВТРаспред.СуммаПоСчету
			|						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
			|					КОНЕЦ = 0
			|					ТОГДА ВТ_РаспредГрупп.МинимальнаяЧасть
			|				ИНАЧЕ ВТ_РаспредГрупп.МинимальнаяЧасть + (ВТРаспред.СуммаПоСчету - ВЫБОР
			|						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
			|							ТОГДА ВТРаспред.СуммаПоСчету
			|						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
			|					КОНЕЦ)
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаПропрорция,
			|	ВТРаспред.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница_Подразделение,
			|	ВТРаспред.Проект КАК Проект,
			|	ВТРаспред.КоррПроект КАК КоррПроект, //малышев 2024-08-23
			|	ВТРаспред.ДокументПоступления КАК ДокументПоступления, //малышев 2024-11-29 ONESOFT-3641
			|	ВТРаспред.Партия КАК Партия,
			|	ВТРаспред.НоменклатураРаспределения КАК НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения КАК ХарактеристикаРаспределения,
			|	ВТРаспред.ВидСубконто1 КАК ВидСубконто1,
			|	ВТРаспред.ВидСубконто2 КАК ВидСубконто2,
			|	ВТРаспред.ВидСубконто3 КАК ВидСубконто3,
			|	ВТРаспред.СтруктурнаяЕдиница_Склад КАК СтруктурнаяЕдиница_Склад,
			|	ВТРаспред.Количество КАК Количество,
			|	ВТРаспред.Себистоимость КАК Себистоимость,
			|	ВТРаспред.Валюта КАК Валюта,
			|	ВТРаспред.Организация КАК Организация,
			|	ВТРаспред.Период КАК Период,
			|	ВТРаспред.Ссылка КАК Ссылка
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|	,ВТРаспред.ПартияРаспределения КАК ПартияРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|ПОМЕСТИТЬ ВТ_РасчетФинал
			|ИЗ
			|	ВТРаспред КАК ВТРаспред
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспредГрупп КАК ВТ_РаспредГрупп
			|		ПО ВТРаспред.Номенклатура = ВТ_РаспредГрупп.Номенклатура
			|			И ВТРаспред.Характеристика = ВТ_РаспредГрупп.Характеристика
			|			И ВТРаспред.ЧастьСуммы = ВТ_РаспредГрупп.МинимальнаяЧасть
			|			И ВТРаспред.СтруктурнаяЕдиница_Подразделение = ВТ_РаспредГрупп.СтруктурнаяЕдиница_Подразделение
			|			И ВТРаспред.Проект = ВТ_РаспредГрупп.Проект
			|			И ВТРаспред.НоменклатураРаспределения = ВТ_РаспредГрупп.НоменклатураРаспределения
			|			И ВТРаспред.ХарактеристикаРаспределения = ВТ_РаспредГрупп.ХарактеристикаРаспределения
			|			И ВТРаспред.ВидСубконто1 = ВТ_РаспредГрупп.ВидСубконто1
			|			И ВТРаспред.ВидСубконто2 = ВТ_РаспредГрупп.ВидСубконто2
			|			И ВТРаспред.ВидСубконто3 = ВТ_РаспредГрупп.ВидСубконто3
			|			И ВТРаспред.СтруктурнаяЕдиница_Склад = ВТ_РаспредГрупп.СтруктурнаяЕдиница_Склад
			|			И ВТРаспред.Количество = ВТ_РаспредГрупп.Количество
			|			И ВТРаспред.Себистоимость = ВТ_РаспредГрупп.Себистоимость
			|			И ВТРаспред.Валюта = ВТ_РаспредГрупп.Валюта
			|			И ВТРаспред.Партия = ВТ_РаспредГрупп.Партия
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|			И ВТРаспред.ПартияРаспределения = ВТ_РаспредГрупп.ПартияРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
			|	ВТРаспред.Проект,
			|	ВТРаспред.КоррПроект, //малышев 2024-08-23
			|	ВТРаспред.ДокументПоступления, //малышев 2024-11-29 ONESOFT-3641
			|	ВТРаспред.Партия,
			|	ВТРаспред.НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения,
			|	ВТРаспред.Характеристика,
			|	ВТРаспред.Ссылка,
			|	ВТРаспред.СуммаРасходов,
			|	ВТРаспред.Номенклатура,
			|	ВТРаспред.Организация,
			|	ВТРаспред.Период,
			|	ВТРаспред.ВидСубконто1,
			|	ВТРаспред.Валюта,
			|	ВТРаспред.СчетУчета,
			|	ВТРаспред.ВидСубконто3,
			|	ВТРаспред.Себистоимость,
			|	ВТРаспред.СтруктурнаяЕдиница_Склад,
			|	ВТРаспред.ВидСубконто2,
			|	ВТРаспред.Количество,
			|	ВТРаспред.СуммаПоСчету,
			|	ВТРаспред.СуммаГрупп,
			|	ВТРаспред.Коэф,
			|	ВТРаспред.ЧастьСуммы,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.МинимальнаяЧасть, 0) = 0
			|			ТОГДА ВТРаспред.ЧастьСуммы
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ВТРаспред.СуммаПоСчету - ВЫБОР
			|						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
			|							ТОГДА ВТРаспред.СуммаПоСчету
			|						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
			|					КОНЕЦ = 0
			|					ТОГДА ВТ_РаспредГрупп.МинимальнаяЧасть
			|				ИНАЧЕ ВТ_РаспредГрупп.МинимальнаяЧасть + (ВТРаспред.СуммаПоСчету - ВЫБОР
			|						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
			|							ТОГДА ВТРаспред.СуммаПоСчету
			|						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
			|					КОНЕЦ)
			|			КОНЕЦ
			|	КОНЕЦ
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|	,ВТРаспред.ПартияРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_РасчетФинал.Номенклатура КАК Номенклатура,
			|	ВТ_РасчетФинал.Характеристика КАК Характеристика,
			|	ВТ_РасчетФинал.СчетУчета КАК СчетУчета,
			|	ВТ_РасчетФинал.СуммаПоСчетуРаспределение КАК СуммаПоСчетуРаспределение,
			//|	ВТ_РасчетФинал.СуммаПоСчетуРаспределение + ЕСТЬNULL(ВТ_РаспредГруппПроверка2.Разница, 0) КАК Сумма,
			//|	ВТ_РаспредГруппПроверка2.Разница КАК Поле,
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
			|	ВТ_РасчетФинал.СуммаПоСчетуРаспределение КАК Сумма,
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
			|	ВТ_РасчетФинал.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница_Подразделение,
			|	ВТ_РасчетФинал.Проект КАК Проект,
			|	ВТ_РасчетФинал.КоррПроект КАК КоррПроект, //Малышев 2024-08-23
			|	ВТ_РасчетФинал.ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
			|	ВТ_РасчетФинал.Партия КАК Партия,
			|	ВТ_РасчетФинал.НоменклатураРаспределения КАК НоменклатураРаспределения,
			|	ВТ_РасчетФинал.ХарактеристикаРаспределения КАК ХарактеристикаРаспределения,
			|	ВТ_РасчетФинал.ВидСубконто1 КАК ВидСубконто1,
			|	ВТ_РасчетФинал.ВидСубконто2 КАК ВидСубконто2,
			|	ВТ_РасчетФинал.ВидСубконто3 КАК ВидСубконто3,
			|	ВТ_РасчетФинал.СтруктурнаяЕдиница_Склад КАК СтруктурнаяЕдиница_Склад,
			|	ВТ_РасчетФинал.Количество КАК Количество,
			|	ВТ_РасчетФинал.Себистоимость КАК Себистоимость,
			|	ВТ_РаспредГруппПроверка2.Себистоимость КАК СБ,
			|	ВТ_РасчетФинал.Валюта КАК Валюта,
			|	ВТ_РасчетФинал.Организация КАК Организация,
			|	ВТ_РасчетФинал.Период КАК Период,
			|	ВТ_РасчетФинал.Ссылка КАК Ссылка
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|	,ВТ_РасчетФинал.ПартияРаспределения КАК ПартияРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|ПОМЕСТИТЬ ВременнаяТаблицаРаспределениеСумм
			|ИЗ
			|	ВТ_РасчетФинал КАК ВТ_РасчетФинал
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспредГруппПроверка2 КАК ВТ_РаспредГруппПроверка2
			|		ПО ВТ_РасчетФинал.СуммаПоСчетуРаспределение = ВТ_РаспредГруппПроверка2.МаксЧасть
			|			И ВТ_РасчетФинал.СчетУчета = ВТ_РаспредГруппПроверка2.СчетУчета
			|			И ВТ_РасчетФинал.Проект = ВТ_РаспредГруппПроверка2.Проект
			|			И ВТ_РасчетФинал.Номенклатура = ВТ_РаспредГруппПроверка2.Номенклатура
			|			И ВТ_РасчетФинал.Характеристика = ВТ_РаспредГруппПроверка2.Характеристика
			|			И ВТ_РасчетФинал.Себистоимость = ВТ_РаспредГруппПроверка2.Себистоимость
			|			И (ВЫБОР
			|				КОГДА &ИспользоватьПартии
			|					ТОГДА ИСТИНА
			|				ИНАЧЕ ВТ_РасчетФинал.СтруктурнаяЕдиница_Подразделение = ВТ_РаспредГруппПроверка2.СтруктурнаяЕдиница_Подразделение
			|			КОНЕЦ)
			|			И (ВЫБОР
			|				КОГДА &ИспользоватьПартии
			|					ТОГДА ИСТИНА
			|				ИНАЧЕ ВТ_РасчетФинал.НоменклатураРаспределения = ВТ_РаспредГруппПроверка2.НоменклатураРаспределения
			|			КОНЕЦ)
			|			И (ВЫБОР
			|				КОГДА &ИспользоватьПартии
			|					ТОГДА ИСТИНА
			|				ИНАЧЕ ВТ_РасчетФинал.ХарактеристикаРаспределения = ВТ_РаспредГруппПроверка2.ХарактеристикаРаспределения
			|			КОНЕЦ)
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|			И ВТ_РасчетФинал.ПартияРаспределения = ВТ_РаспредГруппПроверка2.ПартияРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_РасчетФинал.Организация,
			|	ВТ_РасчетФинал.Ссылка,
			|	ВТ_РасчетФинал.СчетУчета,
			|	ВТ_РасчетФинал.Характеристика,
			|	ВТ_РасчетФинал.ВидСубконто1,
			|	ВТ_РасчетФинал.ВидСубконто3,
			|	ВТ_РасчетФинал.ХарактеристикаРаспределения,
			|	ВТ_РасчетФинал.СтруктурнаяЕдиница_Склад,
			|	ВТ_РасчетФинал.Валюта,
			|	ВТ_РасчетФинал.Период,
			|	ВТ_РасчетФинал.ВидСубконто2,
			|	ВТ_РасчетФинал.НоменклатураРаспределения,
			|	ВТ_РасчетФинал.СтруктурнаяЕдиница_Подразделение,
			|	ВТ_РасчетФинал.Проект,
			|	ВТ_РасчетФинал.КоррПроект, //Малышев 2024-08-23
			|	ВТ_РасчетФинал.ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
			|	ВТ_РасчетФинал.Партия,
			|	ВТ_РасчетФинал.Номенклатура,
			|	ВТ_РасчетФинал.Себистоимость,
			|	ВТ_РаспредГруппПроверка2.Себистоимость,
			|	ВТ_РасчетФинал.СуммаПоСчетуРаспределение,
			|	ВТ_РасчетФинал.СуммаПоСчетуРаспределение + ЕСТЬNULL(ВТ_РаспредГруппПроверка2.Разница, 0),
			|	ВТ_РаспредГруппПроверка2.Разница,
			|	ВТ_РасчетФинал.Количество
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|	,ВТ_РасчетФинал.ПартияРаспределения
			// Kuzmich, 11.07.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
			|";
	//КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ОтражениеДоходов", НСтр("ka='შემოსავლების ასახვა';ru='Отражение доходов';en='income'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	1 КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница,
	|	НЕОПРЕДЕЛЕНО КАК Заказ,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.СчетУчета.СчетАналогУУ КАК СчетУчета,
	|	ТаблицаДокумента.СчетУчета КАК СчетУчетаРегл,
	|	НЕОПРЕДЕЛЕНО КАК Аналитика,
	|	&ОтражениеДоходов КАК СодержаниеПроводки,
	|	0 КАК СуммаДоходов,
	|	-ТаблицаДокумента.Сумма КАК СуммаРасходов,
	|	-ТаблицаДокумента.Сумма КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаРаспределениеСумм КАК ТаблицаДокумента
	|ГДЕ
	|	НЕ ТаблицаДокумента.СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|	И НЕ ТаблицаДокумента.СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	1,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаДокумента.НаправлениеДеятельности,
	|	ТаблицаДокумента.СчетПереоценки,
	|	ТаблицаДокумента.СчетПереоценкиРегл,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	&ОтражениеДоходов,
	|	ВЫБОР КОГДА ТаблицаДокумента.РазницаСтоимости < 0 ТОГДА 0 Иначе ТаблицаДокумента.РазницаСтоимости КОНЕЦ,
	|	ВЫБОР КОГДА ТаблицаДокумента.РазницаСтоимости < 0 ТОГДА -ТаблицаДокумента.РазницаСтоимости Иначе 0 КОНЕЦ,
	|	ВЫБОР КОГДА ТаблицаДокумента.РазницаСтоимости < 0 ТОГДА -ТаблицаДокумента.РазницаСтоимости Иначе ТаблицаДокумента.РазницаСтоимости КОНЕЦ
	|ИЗ
	|	ВременнаяТаблицаИмущество КАК ТаблицаДокумента";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", ТаблицаДоходыИРасходы);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Активность = Истина;
	КонецЦикла; 
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВнеоборотныеАктивы(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СодержаниеПроводки", НСтр("ka='Модернизация имущества';ru='Модернизация имущества';en='modernization of the property'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	1 КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатратРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.РазницаСтоимости КАК Стоимость,
	|	0 КАК Амортизация,
	|	&СодержаниеПроводки
	|ИЗ
	|	ВременнаяТаблицаИмущество КАК ТаблицаДокумента";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВнеоборотныеАктивы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	1 КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ТаблицаДокумента.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ТаблицаДокумента.ПрименитьВТекущемМесяце КАК ПрименитьВТекущемМесяце,
	|	ТаблицаДокумента.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаДокумента.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ТаблицаДокумента.Адрес КАК Адрес,
	|	ТаблицаДокумента.ГодовойПроцентАмортизацииДляУменьшенногоОстатка КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ТаблицаДокумента.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка
	|ИЗ
	|	ВременнаяТаблицаИмущество КАК ТаблицаДокумента";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыВнеоборотныхАктивов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

//ПодольскийАИ #УчетПроектов 16.12.2020 {
Процедура ЗаполнитьРаспределитьСуммыПоИзмерениямПодразделениеПроект(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	
	Если ДокументСсылкаРасспределениеЗатратНаТовары.ВидОперации <> Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары
		И ДокументСсылкаРасспределениеЗатратНаТовары.ВидОперации <> Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам 
	Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПроект = ДокументСсылкаРасспределениеЗатратНаТовары.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасспределениеЗатратНаТовары);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ?(ЗначениеЗаполнено(ДокументСсылкаРасспределениеЗатратНаТовары.ДатаНачала), ДокументСсылкаРасспределениеЗатратНаТовары.ДатаНачала, Дата('00010101')));
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ЗначениеЗаполнено(ДокументСсылкаРасспределениеЗатратНаТовары.ДатаОкончания), ДокументСсылкаРасспределениеЗатратНаТовары.ДатаОкончания, Дата('39990101')));
	Запрос.УстановитьПараметр("ЗаполнитьПроект", ЗаполнитьПроект);
	
	Если ДокументСсылкаРасспределениеЗатратНаТовары.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары Тогда
		Запрос.Текст = ПолучитьТекстЗапросаРаспределенияСуммПоТоварам();
	ИначеЕсли ДокументСсылкаРасспределениеЗатратНаТовары.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам Тогда
		Запрос.Текст = ПолучитьТекстЗапросаРаспределенияСуммПоПроектам();
		// Kuzmich, 18.07.2027, (ONESOFT-3263) Расспределение затрат на товары - операция: на товары
		СписокПроектов = ДокументСсылкаРасспределениеЗатратНаТовары.СписокПроектов.Получить();
		Если СписокПроектов.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("СписокПроектов", СписокПроектов);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Проект В (&СписокПроектов)", "");
		КонецЕсли;
		// Kuzmich, 18.07.2027, (ONESOFT-3263) Расспределение затрат на товары - операция: на товары
		//Paganini_ONESOFT-2674_
		СписокПодразделений = ДокументСсылкаРасспределениеЗатратНаТовары.СписокПодразделений.Получить();
		Если СписокПодразделений.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СтруктурнаяЕдиница В (&СписокПодразделений)", "");
		КонецЕсли;
		//_Paganini_ONESOFT-2674
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаРаспределенияСуммПоПроектам()
	
	Возврат "ВЫБРАТЬ
	        |	ВременнаяТаблицаОборотыПоСчетам.СчетУчета КАК СчетУчета,
	        |	ВременнаяТаблицаОборотыПоСчетам.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница_Подразделение,
	        |	ВременнаяТаблицаОборотыПоСчетам.Проект КАК Проект,
	        |	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто1 КАК ВидСубконто1,
	        |	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто2 КАК ВидСубконто2,
	        |	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто3 КАК ВидСубконто3,
	        |	ВЫРАЗИТЬ(ВременнаяТаблицаОборотыПоСчетам.Сумма КАК ЧИСЛО(15, 2)) КАК Сумма,
			|	ВременнаяТаблицаОборотыПоСчетам.НоменклатураРаспределения КАК НоменклатураРаспределения,
			|	ВременнаяТаблицаОборотыПоСчетам.ХарактеристикаРаспределения КАК ХарактеристикаРаспределения
	        |ПОМЕСТИТЬ ВТ_Обороты_ПоСчетам
	        |ИЗ
	        |	ВременнаяТаблицаОборотыПоСчетам КАК ВременнаяТаблицаОборотыПоСчетам
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ВременнаяТаблицаОборотыПоСчетам
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗапасыОбороты.СтруктурнаяЕдиница КАК Подразделение,
	        |	ЗапасыОбороты.СчетУчетаРегл КАК СчетУчета,
	        |	ЗапасыОбороты.Номенклатура КАК НоменклатураРаспределения,
			|	ЗапасыОбороты.Характеристика КАК ХарактеристикаРаспределения,
	        |	ЗапасыОбороты.Проект,
	        |	СУММА(ЗапасыОбороты.СуммаОборот) КАК Сумма
	        |ПОМЕСТИТЬ ВТ_Обороты_Регистр
	        |ИЗ
	        |	РегистрНакопления.Запасы.Обороты(
	        |			&ДатаНачала,
	        |			&ДатаОкончания,
	        |			Регистратор,
	        |			СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
			//Paganini_ONESOFT-2674_
	        |				И СтруктурнаяЕдиница В (&СписокПодразделений)
			//_Paganini_ONESOFT-2674
	        |				И Организация = &Организация
	        |				И (СчетУчетаРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	        |					ИЛИ СчетУчетаРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))
			//|				И Проект <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
			// Kuzmich, 18.07.2027, (ONESOFT-3263) Расспределение затрат на товары - операция: на товары
			|				И Проект В (&СписокПроектов)
			// Kuzmich, 18.07.2027, (ONESOFT-3263) Расспределение затрат на товары - операция: на товары
			|			) КАК ЗапасыОбороты
	        |ГДЕ
	        |	ЗапасыОбороты.Регистратор <> &Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗапасыОбороты.СтруктурнаяЕдиница,
	        |	ЗапасыОбороты.СчетУчетаРегл,
	        |	ЗапасыОбороты.Номенклатура,
			|	ЗапасыОбороты.Характеристика,
	        |	ЗапасыОбороты.Проект
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Обороты.Проект КАК Проект,
	        |	ВТ_Обороты.СчетУчета,
	        |	СУММА(ВТ_Обороты.Сумма) КАК Сумма
	        |ПОМЕСТИТЬ ВТ_ОборотыГрупп_ПоСчетам
	        |ИЗ
	        |	ВТ_Обороты_ПоСчетам КАК ВТ_Обороты
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_Обороты.Проект,
	        |	ВТ_Обороты.СчетУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Обороты.Проект КАК Проект,
	        |	ВТ_Обороты.СчетУчета,
	        |	СУММА(ВТ_Обороты.Сумма) КАК Сумма
	        |ПОМЕСТИТЬ ВТ_ОборотыГрупп_Регистр
	        |ИЗ
	        |	ВТ_Обороты_Регистр КАК ВТ_Обороты
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_Обороты.Проект,
	        |	ВТ_Обороты.СчетУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Обороты.СчетУчета КАК СчетУчета,
	        |	ВТ_Обороты.Сумма КАК СуммаПоСчету,
	        |	ВТ_ОборотыГрупп.Сумма КАК СуммаГрупп,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_ОборотыРегистрГрупп.Сумма, 0) = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ЕСТЬNULL(ВТ_ОборотыРегистр.Сумма, 0) / ВТ_ОборотыРегистрГрупп.Сумма
	        |	КОНЕЦ КАК Коэф,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_ОборотыРегистрГрупп.Сумма, 0) = 0
	        |				ИЛИ ЕСТЬNULL(ВТ_ОборотыРегистр.Сумма, 0) = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Обороты.Сумма / (ВТ_ОборотыРегистрГрупп.Сумма / ВТ_ОборотыРегистр.Сумма) КАК ЧИСЛО(15, 2))
	        |	КОНЕЦ КАК ЧастьСуммы,
	        |	ВЫБОР
	        |		КОГДА &ЗаполнитьПроект
	        |			ТОГДА ВТ_Обороты.СтруктурнаяЕдиница_Подразделение
	        |		ИНАЧЕ ВТ_ОборотыРегистр.Подразделение
	        |	КОНЕЦ КАК СтруктурнаяЕдиница_Подразделение,
	        |	ВЫБОР
	        |		КОГДА &ЗаполнитьПроект
	        |			ТОГДА ВТ_ОборотыРегистр.Проект
	        |		ИНАЧЕ ВТ_Обороты.Проект
	        |	КОНЕЦ КАК Проект,
			|	ВЫБОР
	        |		КОГДА &ЗаполнитьПроект
	        |			ТОГДА ВТ_Обороты.НоменклатураРаспределения
	        |		ИНАЧЕ ВТ_ОборотыРегистр.НоменклатураРаспределения
	        |	КОНЕЦ КАК НоменклатураРаспределения,
			|	ВЫБОР
	        |		КОГДА &ЗаполнитьПроект
	        |			ТОГДА ВТ_Обороты.ХарактеристикаРаспределения
	        |		ИНАЧЕ ВТ_ОборотыРегистр.ХарактеристикаРаспределения
	        |	КОНЕЦ КАК ХарактеристикаРаспределения,
	        |	ВТ_Обороты.ВидСубконто1,
	        |	ВТ_Обороты.ВидСубконто2,
	        |	ВТ_Обороты.ВидСубконто3
	        |ПОМЕСТИТЬ ВТРаспред_ПоСчетам
	        |ИЗ
	        |	ВТ_Обороты_ПоСчетам КАК ВТ_Обороты
	        |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Обороты_Регистр КАК ВТ_ОборотыРегистр
	        |		ПО ВТ_Обороты.СчетУчета = ВТ_ОборотыРегистр.СчетУчета
	        |			И ВТ_Обороты.Проект = ВТ_ОборотыРегистр.Проект
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
			|			И ВТ_Обороты.НоменклатураРаспределения = ВТ_ОборотыРегистр.НоменклатураРаспределения
			|			И ВТ_Обороты.ХарактеристикаРаспределения = ВТ_ОборотыРегистр.ХарактеристикаРаспределения
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
	        |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ОборотыГрупп_Регистр КАК ВТ_ОборотыРегистрГрупп
	        |		ПО ВТ_Обороты.СчетУчета = ВТ_ОборотыРегистрГрупп.СчетУчета
	        |			И ВТ_Обороты.Проект = ВТ_ОборотыРегистрГрупп.Проект
	        |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ОборотыГрупп_ПоСчетам КАК ВТ_ОборотыГрупп
	        |		ПО ВТ_Обороты.СчетУчета = ВТ_ОборотыГрупп.СчетУчета
	        |			И ВТ_Обороты.Проект = ВТ_ОборотыГрупп.Проект
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	МАКСИМУМ(ВТРаспред.ЧастьСуммы) КАК МаксЧасть,
	        |	ВТРаспред.СуммаПоСчету,
			|	ВТРаспред.Проект,
	        |	СУММА(ВТРаспред.ЧастьСуммы) КАК ЧастьСуммы,
	        |	ВТРаспред.СуммаПоСчету - СУММА(ВТРаспред.ЧастьСуммы) КАК Разница,
	        |	ВТРаспред.СчетУчета
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
			|	,ВТРаспред.НоменклатураРаспределения
			|	,ВТРаспред.ХарактеристикаРаспределения
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
	        |ПОМЕСТИТЬ ВТ_РаспредГруппПроверка_ПоСчетам
	        |ИЗ
	        |	ВТРаспред_ПоСчетам КАК ВТРаспред
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТРаспред.СуммаПоСчету,
	        |	ВТРаспред.СчетУчета,
			|	ВТРаспред.Проект
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
			|	,ВТРаспред.НоменклатураРаспределения
			|	,ВТРаспред.ХарактеристикаРаспределения
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_РаспредГруппПроверка.МаксЧасть КАК МаксЧасть,
	        |	ВТ_РаспредГруппПроверка.СуммаПоСчету КАК СуммаПоСчету,
	        |	ВТ_РаспредГруппПроверка.ЧастьСуммы КАК ЧастьСуммы,
	        |	ВТ_РаспредГруппПроверка.Разница КАК Разница,
	        |	ВТ_РаспредГруппПроверка.СчетУчета КАК СчетУчета,
			|	ВТ_РаспредГруппПроверка.Проект КАК Проект,
	        |	ВЫБОР
	        |		КОГДА &ЗаполнитьПроект
	        |			ТОГДА ВТРаспред.Проект
	        |		ИНАЧЕ ВТРаспред.СтруктурнаяЕдиница_Подразделение
	        |	КОНЕЦ КАК ДопАналитика
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
			|	,ВТ_РаспредГруппПроверка.НоменклатураРаспределения
			|	,ВТ_РаспредГруппПроверка.ХарактеристикаРаспределения
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
	        |ПОМЕСТИТЬ ВТ_РаспредГруппПроверка2_ПоСчетам
	        |ИЗ
	        |	ВТ_РаспредГруппПроверка_ПоСчетам КАК ВТ_РаспредГруппПроверка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспред_ПоСчетам КАК ВТРаспред
	        |		ПО ВТ_РаспредГруппПроверка.СуммаПоСчету = ВТРаспред.СуммаПоСчету
			|			И ВТ_РаспредГруппПроверка.Проект = ВТРаспред.Проект
	        |			И ВТ_РаспредГруппПроверка.МаксЧасть = ВТРаспред.ЧастьСуммы
	        |			И ВТ_РаспредГруппПроверка.СчетУчета = ВТРаспред.СчетУчета
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_РаспредГруппПроверка.МаксЧасть,
	        |	ВТ_РаспредГруппПроверка.СуммаПоСчету,
	        |	ВТ_РаспредГруппПроверка.ЧастьСуммы,
	        |	ВТ_РаспредГруппПроверка.Разница,
	        |	ВТ_РаспредГруппПроверка.СчетУчета,
			|	ВТ_РаспредГруппПроверка.Проект,
	        |	ВЫБОР
	        |		КОГДА &ЗаполнитьПроект
	        |			ТОГДА ВТРаспред.Проект
	        |		ИНАЧЕ ВТРаспред.СтруктурнаяЕдиница_Подразделение
	        |	КОНЕЦ
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
			|	,ВТ_РаспредГруппПроверка.НоменклатураРаспределения
			|	,ВТ_РаспредГруппПроверка.ХарактеристикаРаспределения
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	МИНИМУМ(ВТРаспред.ЧастьСуммы) КАК МинимальнаяЧасть,
	        |	СУММА(ВТРаспред.ЧастьСуммы) КАК ЧастьСуммы,
	        |	ВТРаспред.СчетУчета,
	        |	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
	        |	ВТРаспред.Проект,
	        |	ВТРаспред.НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения,
	        |	ВТРаспред.ВидСубконто1,
	        |	ВТРаспред.ВидСубконто2,
	        |	ВТРаспред.ВидСубконто3
	        |ПОМЕСТИТЬ ВТ_РаспредГрупп_ПоСчетам
	        |ИЗ
	        |	ВТРаспред_ПоСчетам КАК ВТРаспред
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТРаспред.СчетУчета,
	        |	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
	        |	ВТРаспред.Проект,
	        |	ВТРаспред.НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения,
	        |	ВТРаспред.ВидСубконто3,
	        |	ВТРаспред.ВидСубконто1,
	        |	ВТРаспред.ВидСубконто2
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТРаспред.СчетУчета КАК СчетУчета,
	        |	ВТРаспред.СуммаПоСчету КАК СуммаПоСчету,
	        |	ВТРаспред.СуммаГрупп КАК СуммаГрупп,
	        |	ВТРаспред.Коэф КАК Коэф,
	        |	ВТРаспред.ЧастьСуммы КАК ЧастьСуммы,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
	        |	КОНЕЦ КАК СуммаПоСчетуРаспределение,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.МинимальнаяЧасть, 0) = 0
	        |			ТОГДА ВТРаспред.ЧастьСуммы
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ВТРаспред.СуммаПоСчету - ВЫБОР
	        |						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
	        |							ТОГДА ВТРаспред.СуммаПоСчету
	        |						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
	        |					КОНЕЦ = 0
	        |					ТОГДА ВТ_РаспредГрупп.МинимальнаяЧасть
	        |				ИНАЧЕ ВТ_РаспредГрупп.МинимальнаяЧасть + (ВТРаспред.СуммаПоСчету - ВЫБОР
	        |						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
	        |							ТОГДА ВТРаспред.СуммаПоСчету
	        |						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
	        |					КОНЕЦ)
	        |			КОНЕЦ
	        |	КОНЕЦ КАК СуммаПропрорция,
	        |	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
	        |	ВТРаспред.Проект,
	        |	ВТРаспред.НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения,
	        |	ВТРаспред.ВидСубконто1,
	        |	ВТРаспред.ВидСубконто2,
	        |	ВТРаспред.ВидСубконто3
	        |ПОМЕСТИТЬ ВТ_РасчетПоСчетамФинал
	        |ИЗ
	        |	ВТРаспред_ПоСчетам КАК ВТРаспред
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспредГрупп_ПоСчетам КАК ВТ_РаспредГрупп
	        |		ПО ВТРаспред.ЧастьСуммы = ВТ_РаспредГрупп.МинимальнаяЧасть
	        |			И ВТРаспред.СтруктурнаяЕдиница_Подразделение = ВТ_РаспредГрупп.СтруктурнаяЕдиница_Подразделение
	        |			И ВТРаспред.Проект = ВТ_РаспредГрупп.Проект
	        |			И ВТРаспред.НоменклатураРаспределения = ВТ_РаспредГрупп.НоменклатураРаспределения
			|			И ВТРаспред.ХарактеристикаРаспределения = ВТ_РаспредГрупп.ХарактеристикаРаспределения
	        |			И ВТРаспред.ВидСубконто1 = ВТ_РаспредГрупп.ВидСубконто1
	        |			И ВТРаспред.ВидСубконто2 = ВТ_РаспредГрупп.ВидСубконто2
	        |			И ВТРаспред.ВидСубконто3 = ВТ_РаспредГрупп.ВидСубконто3
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
	        |	ВТРаспред.Проект,
	        |	ВТРаспред.НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения,
	        |	ВТРаспред.ВидСубконто1,
	        |	ВТРаспред.СчетУчета,
	        |	ВТРаспред.ВидСубконто3,
	        |	ВТРаспред.ВидСубконто2,
	        |	ВТРаспред.СуммаПоСчету,
	        |	ВТРаспред.СуммаГрупп,
	        |	ВТРаспред.Коэф,
	        |	ВТРаспред.ЧастьСуммы,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.МинимальнаяЧасть, 0) = 0
	        |			ТОГДА ВТРаспред.ЧастьСуммы
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ВТРаспред.СуммаПоСчету - ВЫБОР
	        |						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
	        |							ТОГДА ВТРаспред.СуммаПоСчету
	        |						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
	        |					КОНЕЦ = 0
	        |					ТОГДА ВТ_РаспредГрупп.МинимальнаяЧасть
	        |				ИНАЧЕ ВТ_РаспредГрупп.МинимальнаяЧасть + (ВТРаспред.СуммаПоСчету - ВЫБОР
	        |						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
	        |							ТОГДА ВТРаспред.СуммаПоСчету
	        |						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
	        |					КОНЕЦ)
	        |			КОНЕЦ
	        |	КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_РасчетФинал.СчетУчета КАК СчетУчета,
	        |	ВТ_РасчетФинал.СуммаПоСчетуРаспределение,
	        |	ВТ_РасчетФинал.СуммаПоСчетуРаспределение + ЕСТЬNULL(ВТ_РаспредГруппПроверка2.Разница, 0) КАК Сумма,
	        |	ВТ_РаспредГруппПроверка2.Разница КАК Поле,
	        |	ВТ_РасчетФинал.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница_Подразделение,
	        |	ВТ_РасчетФинал.Проект,
	        |	ВТ_РасчетФинал.НоменклатураРаспределения,
			|	ВТ_РасчетФинал.ХарактеристикаРаспределения,
	        |	ВТ_РасчетФинал.ВидСубконто1 КАК ВидСубконто1,
	        |	ВТ_РасчетФинал.ВидСубконто2 КАК ВидСубконто2,
	        |	ВТ_РасчетФинал.ВидСубконто3 КАК ВидСубконто3
	        |ПОМЕСТИТЬ ВременнаяТаблицаОборотыПоСчетам
	        |ИЗ
	        |	ВТ_РасчетПоСчетамФинал КАК ВТ_РасчетФинал
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспредГруппПроверка2_ПоСчетам КАК ВТ_РаспредГруппПроверка2
	        |		ПО ВТ_РасчетФинал.СуммаПоСчетуРаспределение = ВТ_РаспредГруппПроверка2.МаксЧасть
	        |			И ВТ_РасчетФинал.СчетУчета = ВТ_РаспредГруппПроверка2.СчетУчета
			|			И ВТ_РасчетФинал.Проект = ВТ_РаспредГруппПроверка2.Проект
	        |			И (ВЫБОР
	        |				КОГДА &ЗаполнитьПроект
	        |					ТОГДА ВТ_РасчетФинал.Проект
	        |				ИНАЧЕ ВТ_РасчетФинал.СтруктурнаяЕдиница_Подразделение
	        |			КОНЕЦ = ВТ_РаспредГруппПроверка2.ДопАналитика)
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
			|			И ВТ_РасчетФинал.НоменклатураРаспределения = ВТ_РаспредГруппПроверка2.НоменклатураРаспределения
			|			И ВТ_РасчетФинал.ХарактеристикаРаспределения = ВТ_РаспредГруппПроверка2.ХарактеристикаРаспределения
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
	        |ГДЕ
	        |	ВТ_РасчетФинал.СуммаПоСчетуРаспределение + ЕСТЬNULL(ВТ_РаспредГруппПроверка2.Разница, 0) <> 0";
	        //|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|УНИЧТОЖИТЬ ВТ_Обороты_ПоСчетам
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|УНИЧТОЖИТЬ ВТ_Обороты_Регистр
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|УНИЧТОЖИТЬ ВТ_ОборотыГрупп_ПоСчетам
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|УНИЧТОЖИТЬ ВТ_ОборотыГрупп_Регистр
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|УНИЧТОЖИТЬ ВТРаспред_ПоСчетам
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|УНИЧТОЖИТЬ ВТ_РаспредГруппПроверка_ПоСчетам
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|УНИЧТОЖИТЬ ВТ_РаспредГруппПроверка2_ПоСчетам
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|УНИЧТОЖИТЬ ВТ_РаспредГрупп_ПоСчетам
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|УНИЧТОЖИТЬ ВТ_РасчетПоСчетамФинал";
	
КонецФункции

Функция ПолучитьТекстЗапросаРаспределенияСуммПоТоварам()
	
	Возврат "ВЫБРАТЬ
	        |	ВременнаяТаблицаОборотыПоСчетам.СчетУчета КАК СчетУчета,
	        |	ВременнаяТаблицаОборотыПоСчетам.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница_Подразделение,
	        |	ВременнаяТаблицаОборотыПоСчетам.Проект КАК Проект,
			|	ВременнаяТаблицаОборотыПоСчетам.Партия КАК Партия,
	        |	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто1 КАК ВидСубконто1,
	        |	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто2 КАК ВидСубконто2,
	        |	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто3 КАК ВидСубконто3,
	        |	ВЫРАЗИТЬ(ВременнаяТаблицаОборотыПоСчетам.Сумма КАК ЧИСЛО(15, 2)) КАК Сумма,
			|	ВременнаяТаблицаОборотыПоСчетам.НоменклатураРаспределения КАК НоменклатураРаспределения,
			|	ВременнаяТаблицаОборотыПоСчетам.ХарактеристикаРаспределения КАК ХарактеристикаРаспределения
	        |ПОМЕСТИТЬ ВТ_Обороты_ПоСчетам
	        |ИЗ
	        |	ВременнаяТаблицаОборотыПоСчетам КАК ВременнаяТаблицаОборотыПоСчетам
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ВременнаяТаблицаОборотыПоСчетам
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗапасыОбороты.СтруктурнаяЕдиница КАК Подразделение,
	        |	ЗапасыОбороты.СчетУчетаРегл КАК СчетУчета,
	        |	ЗапасыОбороты.Номенклатура КАК НоменклатураРаспределения,
			|	ЗапасыОбороты.Характеристика КАК ХарактеристикаРаспределения,
	        |	ЗапасыОбороты.Проект,
			|	ЗапасыОбороты.Партия КАК Партия,
	        |	СУММА(ЗапасыОбороты.СуммаОборот) КАК Сумма
	        |ПОМЕСТИТЬ ВТ_Обороты_Регистр
	        |ИЗ
	        |	РегистрНакопления.Запасы.Обороты(
	        |			&ДатаНачала,
	        |			&ДатаОкончания,
	        |			Регистратор,
	        |			СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	        |				И Организация = &Организация
	        |				И (СчетУчетаРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	        |					ИЛИ СчетУчетаРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))) КАК ЗапасыОбороты
	        |ГДЕ
	        |	ЗапасыОбороты.Регистратор <> &Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗапасыОбороты.СтруктурнаяЕдиница,
	        |	ЗапасыОбороты.Номенклатура,
			|	ЗапасыОбороты.Характеристика,
	        |	ЗапасыОбороты.СчетУчетаРегл,
	        |	ЗапасыОбороты.Проект,
			|	ЗапасыОбороты.Партия
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Обороты.СтруктурнаяЕдиница_Подразделение,
	        |	ВТ_Обороты.СчетУчета,
	        |	СУММА(ВТ_Обороты.Сумма) КАК Сумма
	        |ПОМЕСТИТЬ ВТ_ОборотыГрупп_ПоСчетам
	        |ИЗ
	        |	ВТ_Обороты_ПоСчетам КАК ВТ_Обороты
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_Обороты.СчетУчета,
	        |	ВТ_Обороты.СтруктурнаяЕдиница_Подразделение
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Обороты.Подразделение,
	        |	ВТ_Обороты.СчетУчета,
	        |	СУММА(ВТ_Обороты.Сумма) КАК Сумма
	        |ПОМЕСТИТЬ ВТ_ОборотыГрупп_Регистр
	        |ИЗ
	        |	ВТ_Обороты_Регистр КАК ВТ_Обороты
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_Обороты.СчетУчета,
	        |	ВТ_Обороты.Подразделение
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Обороты.СчетУчета КАК СчетУчета,
	        |	ВТ_Обороты.Сумма КАК СуммаПоСчету,
	        |	ВТ_ОборотыГрупп.Сумма КАК СуммаГрупп,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_ОборотыРегистрГрупп.Сумма, 0) = 0
	        |			ТОГДА 0
			|		ИНАЧЕ ВТ_ОборотыРегистр.Сумма / ВТ_ОборотыРегистрГрупп.Сумма
	        |	КОНЕЦ КАК Коэф,
	        //--------------------------------------------------------------------------
			// © Шишка В.В. [12 августа 2022]  НАЧАЛО
			//|	ВЫРАЗИТЬ(ВТ_Обороты.Сумма / (ВТ_ОборотыРегистрГрупп.Сумма / ВТ_ОборотыРегистр.Сумма) КАК ЧИСЛО(15, 2)) КАК ЧастьСуммы,
			|   ВЫБОР КОГДА ЕСТЬNULL(ВТ_ОборотыРегистр.Сумма, 0) = 0 ИЛИ ЕСТЬNULL(ВТ_ОборотыРегистрГрупп.Сумма, 0) = 0 ТОГДА 0
			|         ИНАЧЕ ВЫРАЗИТЬ(ВТ_Обороты.Сумма / (ВТ_ОборотыРегистрГрупп.Сумма / ВТ_ОборотыРегистр.Сумма) КАК ЧИСЛО(15, 2))
			|   КОНЕЦ  КАК ЧастьСуммы,
			// © Шишка В.В. [12 августа 2022]  КОНЕЦ
			//--------------------------------------------------------------------------
	        |	ВЫБОР
	        |		КОГДА &ЗаполнитьПроект
	        |			ТОГДА ВТ_Обороты.СтруктурнаяЕдиница_Подразделение
	        |		ИНАЧЕ ВТ_ОборотыРегистр.Подразделение
	        |	КОНЕЦ КАК СтруктурнаяЕдиница_Подразделение,
	        |	ВЫБОР
	        |		КОГДА &ЗаполнитьПроект
	        |			ТОГДА ВТ_ОборотыРегистр.Проект
	        |		ИНАЧЕ ВТ_Обороты.Проект
	        |	КОНЕЦ КАК Проект,
			|	ВТ_Обороты.Партия КАК Партия,
			|	ВЫБОР
	        |		КОГДА &ЗаполнитьПроект
	        |			ТОГДА ВТ_ОборотыРегистр.НоменклатураРаспределения
	        |		ИНАЧЕ ВТ_Обороты.НоменклатураРаспределения
	        |	КОНЕЦ КАК НоменклатураРаспределения,
			|	ВЫБОР
	        |		КОГДА &ЗаполнитьПроект
	        |			ТОГДА ВТ_ОборотыРегистр.ХарактеристикаРаспределения
	        |		ИНАЧЕ ВТ_Обороты.ХарактеристикаРаспределения
	        |	КОНЕЦ КАК ХарактеристикаРаспределения,
	        |	ВТ_Обороты.ВидСубконто1,
	        |	ВТ_Обороты.ВидСубконто2,
	        |	ВТ_Обороты.ВидСубконто3
	        |ПОМЕСТИТЬ ВТРаспред_ПоСчетам
	        |ИЗ
	        |	ВТ_Обороты_ПоСчетам КАК ВТ_Обороты
	        |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Обороты_Регистр КАК ВТ_ОборотыРегистр
	        |		ПО ВТ_Обороты.СтруктурнаяЕдиница_Подразделение = ВТ_ОборотыРегистр.Подразделение
	        |			И ВТ_Обороты.СчетУчета = ВТ_ОборотыРегистр.СчетУчета
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
			|			И ВТ_Обороты.НоменклатураРаспределения = ВТ_ОборотыРегистр.НоменклатураРаспределения
			|			И ВТ_Обороты.ХарактеристикаРаспределения = ВТ_ОборотыРегистр.ХарактеристикаРаспределения
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
	        |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ОборотыГрупп_Регистр КАК ВТ_ОборотыРегистрГрупп
	        |		ПО ВТ_Обороты.СтруктурнаяЕдиница_Подразделение = ВТ_ОборотыРегистрГрупп.Подразделение
	        |			И ВТ_Обороты.СчетУчета = ВТ_ОборотыРегистрГрупп.СчетУчета
	        |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ОборотыГрупп_ПоСчетам КАК ВТ_ОборотыГрупп
	        |		ПО ВТ_Обороты.СтруктурнаяЕдиница_Подразделение = ВТ_ОборотыГрупп.СтруктурнаяЕдиница_Подразделение
	        |			И ВТ_Обороты.СчетУчета = ВТ_ОборотыГрупп.СчетУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	МАКСИМУМ(ВТРаспред.ЧастьСуммы) КАК МаксЧасть,
	        |	ВТРаспред.СуммаПоСчету,
	        |	СУММА(ВТРаспред.ЧастьСуммы) КАК ЧастьСуммы,
	        |	ВТРаспред.СуммаПоСчету - СУММА(ВТРаспред.ЧастьСуммы) КАК Разница,
	        |	ВТРаспред.СчетУчета,
			|	ВТРаспред.СтруктурнаяЕдиница_Подразделение
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
			|	,ВТРаспред.НоменклатураРаспределения
			|	,ВТРаспред.ХарактеристикаРаспределения
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
	        |ПОМЕСТИТЬ ВТ_РаспредГруппПроверка_ПоСчетам
	        |ИЗ
	        |	ВТРаспред_ПоСчетам КАК ВТРаспред
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТРаспред.СуммаПоСчету,
	        |	ВТРаспред.СчетУчета,
			|	ВТРаспред.СтруктурнаяЕдиница_Подразделение
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
			|	,ВТРаспред.НоменклатураРаспределения
			|	,ВТРаспред.ХарактеристикаРаспределения
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_РаспредГруппПроверка.МаксЧасть КАК МаксЧасть,
	        |	ВТ_РаспредГруппПроверка.СуммаПоСчету КАК СуммаПоСчету,
	        |	ВТ_РаспредГруппПроверка.ЧастьСуммы КАК ЧастьСуммы,
	        |	ВТ_РаспредГруппПроверка.Разница КАК Разница,
	        |	ВТ_РаспредГруппПроверка.СчетУчета КАК СчетУчета,
			|	ВТ_РаспредГруппПроверка.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница_Подразделение,
	        |	ВЫБОР
	        |		КОГДА &ЗаполнитьПроект
	        |			ТОГДА ВТРаспред.Проект
	        |		ИНАЧЕ ВТРаспред.СтруктурнаяЕдиница_Подразделение
	        |	КОНЕЦ КАК ДопАналитика
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
			|	,ВТ_РаспредГруппПроверка.НоменклатураРаспределения
			|	,ВТ_РаспредГруппПроверка.ХарактеристикаРаспределения
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
	        |ПОМЕСТИТЬ ВТ_РаспредГруппПроверка2_ПоСчетам
	        |ИЗ
	        |	ВТ_РаспредГруппПроверка_ПоСчетам КАК ВТ_РаспредГруппПроверка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспред_ПоСчетам КАК ВТРаспред
	        |		ПО ВТ_РаспредГруппПроверка.СуммаПоСчету = ВТРаспред.СуммаПоСчету
			|			И ВТ_РаспредГруппПроверка.СтруктурнаяЕдиница_Подразделение = ВТРаспред.СтруктурнаяЕдиница_Подразделение
	        |			И ВТ_РаспредГруппПроверка.МаксЧасть = ВТРаспред.ЧастьСуммы
	        |			И ВТ_РаспредГруппПроверка.СчетУчета = ВТРаспред.СчетУчета
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_РаспредГруппПроверка.МаксЧасть,
	        |	ВТ_РаспредГруппПроверка.СуммаПоСчету,
	        |	ВТ_РаспредГруппПроверка.ЧастьСуммы,
	        |	ВТ_РаспредГруппПроверка.Разница,
	        |	ВТ_РаспредГруппПроверка.СчетУчета,
			|	ВТ_РаспредГруппПроверка.СтруктурнаяЕдиница_Подразделение,
	        |	ВЫБОР
	        |		КОГДА &ЗаполнитьПроект
	        |			ТОГДА ВТРаспред.Проект
	        |		ИНАЧЕ ВТРаспред.СтруктурнаяЕдиница_Подразделение
	        |	КОНЕЦ
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
			|	,ВТ_РаспредГруппПроверка.НоменклатураРаспределения
			|	,ВТ_РаспредГруппПроверка.ХарактеристикаРаспределения
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	МИНИМУМ(ВТРаспред.ЧастьСуммы) КАК МинимальнаяЧасть,
	        |	СУММА(ВТРаспред.ЧастьСуммы) КАК ЧастьСуммы,
	        |	ВТРаспред.СчетУчета,
	        |	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
	        |	ВТРаспред.Проект,
			|	ВТРаспред.Партия,
	        |	ВТРаспред.НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения,
	        |	ВТРаспред.ВидСубконто1,
	        |	ВТРаспред.ВидСубконто2,
	        |	ВТРаспред.ВидСубконто3
	        |ПОМЕСТИТЬ ВТ_РаспредГрупп_ПоСчетам
	        |ИЗ
	        |	ВТРаспред_ПоСчетам КАК ВТРаспред
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТРаспред.СчетУчета,
	        |	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
	        |	ВТРаспред.Проект,
			|	ВТРаспред.Партия,
	        |	ВТРаспред.НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения,
	        |	ВТРаспред.ВидСубконто3,
	        |	ВТРаспред.ВидСубконто1,
	        |	ВТРаспред.ВидСубконто2
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТРаспред.СчетУчета КАК СчетУчета,
	        |	ВТРаспред.СуммаПоСчету КАК СуммаПоСчету,
	        |	ВТРаспред.СуммаГрупп КАК СуммаГрупп,
	        |	ВТРаспред.Коэф КАК Коэф,
	        |	ВТРаспред.ЧастьСуммы КАК ЧастьСуммы,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
	        |	КОНЕЦ КАК СуммаПоСчетуРаспределение,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.МинимальнаяЧасть, 0) = 0
	        |			ТОГДА ВТРаспред.ЧастьСуммы
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ВТРаспред.СуммаПоСчету - ВЫБОР
	        |						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
	        |							ТОГДА ВТРаспред.СуммаПоСчету
	        |						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
	        |					КОНЕЦ = 0
	        |					ТОГДА ВТ_РаспредГрупп.МинимальнаяЧасть
	        |				ИНАЧЕ ВТ_РаспредГрупп.МинимальнаяЧасть + (ВТРаспред.СуммаПоСчету - ВЫБОР
	        |						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
	        |							ТОГДА ВТРаспред.СуммаПоСчету
	        |						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
	        |					КОНЕЦ)
	        |			КОНЕЦ
	        |	КОНЕЦ КАК СуммаПропрорция,
	        |	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
	        |	ВТРаспред.Проект,
			|	ВТРаспред.Партия,
	        |	ВТРаспред.НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения,
	        |	ВТРаспред.ВидСубконто1,
	        |	ВТРаспред.ВидСубконто2,
	        |	ВТРаспред.ВидСубконто3
	        |ПОМЕСТИТЬ ВТ_РасчетПоСчетамФинал
	        |ИЗ
	        |	ВТРаспред_ПоСчетам КАК ВТРаспред
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспредГрупп_ПоСчетам КАК ВТ_РаспредГрупп
	        |		ПО ВТРаспред.ЧастьСуммы = ВТ_РаспредГрупп.МинимальнаяЧасть
	        |			И ВТРаспред.СтруктурнаяЕдиница_Подразделение = ВТ_РаспредГрупп.СтруктурнаяЕдиница_Подразделение
	        |			И ВТРаспред.Проект = ВТ_РаспредГрупп.Проект
			|			И ВТРаспред.НоменклатураРаспределения = ВТ_РаспредГрупп.НоменклатураРаспределения
			|			И ВТРаспред.ХарактеристикаРаспределения = ВТ_РаспредГрупп.ХарактеристикаРаспределения
	        |			И ВТРаспред.ВидСубконто1 = ВТ_РаспредГрупп.ВидСубконто1
	        |			И ВТРаспред.ВидСубконто2 = ВТ_РаспредГрупп.ВидСубконто2
	        |			И ВТРаспред.ВидСубконто3 = ВТ_РаспредГрупп.ВидСубконто3
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
	        |	ВТРаспред.Проект,
			|	ВТРаспред.Партия,
	        |	ВТРаспред.НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения,
	        |	ВТРаспред.ВидСубконто1,
	        |	ВТРаспред.СчетУчета,
	        |	ВТРаспред.ВидСубконто3,
	        |	ВТРаспред.ВидСубконто2,
	        |	ВТРаспред.СуммаПоСчету,
	        |	ВТРаспред.СуммаГрупп,
	        |	ВТРаспред.Коэф,
	        |	ВТРаспред.ЧастьСуммы,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.МинимальнаяЧасть, 0) = 0
	        |			ТОГДА ВТРаспред.ЧастьСуммы
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ВТРаспред.СуммаПоСчету - ВЫБОР
	        |						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
	        |							ТОГДА ВТРаспред.СуммаПоСчету
	        |						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
	        |					КОНЕЦ = 0
	        |					ТОГДА ВТ_РаспредГрупп.МинимальнаяЧасть
	        |				ИНАЧЕ ВТ_РаспредГрупп.МинимальнаяЧасть + (ВТРаспред.СуммаПоСчету - ВЫБОР
	        |						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
	        |							ТОГДА ВТРаспред.СуммаПоСчету
	        |						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
	        |					КОНЕЦ)
	        |			КОНЕЦ
	        |	КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_РасчетФинал.СчетУчета КАК СчетУчета,
	        |	ВТ_РасчетФинал.СуммаПоСчетуРаспределение,
	        |	ВТ_РасчетФинал.СуммаПоСчетуРаспределение + ЕСТЬNULL(ВТ_РаспредГруппПроверка2.Разница, 0) КАК Сумма,
	        |	ВТ_РаспредГруппПроверка2.Разница КАК Поле,
	        |	ВТ_РасчетФинал.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница_Подразделение,
	        |	ВТ_РасчетФинал.Проект,
			|	ВТ_РасчетФинал.Партия,
	        |	ВТ_РасчетФинал.НоменклатураРаспределения,
			|	ВТ_РасчетФинал.ХарактеристикаРаспределения,
	        |	ВТ_РасчетФинал.ВидСубконто1 КАК ВидСубконто1,
	        |	ВТ_РасчетФинал.ВидСубконто2 КАК ВидСубконто2,
	        |	ВТ_РасчетФинал.ВидСубконто3 КАК ВидСубконто3
	        |ПОМЕСТИТЬ ВременнаяТаблицаОборотыПоСчетам
	        |ИЗ
	        |	ВТ_РасчетПоСчетамФинал КАК ВТ_РасчетФинал
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспредГруппПроверка2_ПоСчетам КАК ВТ_РаспредГруппПроверка2
	        |		ПО ВТ_РасчетФинал.СуммаПоСчетуРаспределение = ВТ_РаспредГруппПроверка2.МаксЧасть
	        |			И ВТ_РасчетФинал.СчетУчета = ВТ_РаспредГруппПроверка2.СчетУчета
			|			И ВТ_РасчетФинал.СтруктурнаяЕдиница_Подразделение = ВТ_РаспредГруппПроверка2.СтруктурнаяЕдиница_Подразделение
	        |			И (ВЫБОР
	        |				КОГДА &ЗаполнитьПроект
	        |					ТОГДА ВТ_РасчетФинал.Проект
	        |				ИНАЧЕ ВТ_РасчетФинал.СтруктурнаяЕдиница_Подразделение
	        |			КОНЕЦ = ВТ_РаспредГруппПроверка2.ДопАналитика)
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
			|			И ВТ_РасчетФинал.НоменклатураРаспределения = ВТ_РаспредГруппПроверка2.НоменклатураРаспределения
			|			И ВТ_РасчетФинал.ХарактеристикаРаспределения = ВТ_РаспредГруппПроверка2.ХарактеристикаРаспределения
			// Kuzmich, 14.12.2023, (ONESOFT-2674) Расспределение затраты на товары
	        |ГДЕ
	        |	ВТ_РасчетФинал.СуммаПоСчетуРаспределение + ЕСТЬNULL(ВТ_РаспредГруппПроверка2.Разница, 0) <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ВТ_Обороты_ПоСчетам
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ВТ_Обороты_Регистр
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ВТ_ОборотыГрупп_ПоСчетам
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ВТ_ОборотыГрупп_Регистр
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ВТРаспред_ПоСчетам
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ВТ_РаспредГруппПроверка_ПоСчетам
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ВТ_РаспредГруппПроверка2_ПоСчетам
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ВТ_РаспредГрупп_ПоСчетам
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ВТ_РасчетПоСчетамФинал";
	
КонецФункции

Функция ПолучитьТекстЗапросаДляРаспределенияПоПроектам()
	
	Возврат "ВЫБРАТЬ
			|	ВременнаяТаблицаОстаткиТоваров.Номенклатура КАК Номенклатура,
			|	ВременнаяТаблицаОстаткиТоваров.Характеристика КАК Характеристика,
			|	ВременнаяТаблицаОстаткиТоваров.СтруктурнаяЕдиница_Склад КАК СтруктурнаяЕдиница_Склад,
			//ПодольскийАИ #УчетПроектов 24.12.2020 {
			|	ВременнаяТаблицаОстаткиТоваров.Проект КАК Проект,
			//ПодольскийАИ #УчетПроектов 24.12.2020 }
			|	ВременнаяТаблицаОстаткиТоваров.Количество КАК Количество,
			|	ВременнаяТаблицаОстаткиТоваров.Себистоимость КАК Себистоимость,
			|	ВременнаяТаблицаОстаткиТоваров.Ссылка КАК Ссылка,
			|	ВременнаяТаблицаОстаткиТоваров.Организация КАК Организация,
			|	ВременнаяТаблицаОстаткиТоваров.Период КАК Период,
			|	ВременнаяТаблицаОстаткиТоваров.Валюта КАК Валюта,
			|	ВременнаяТаблицаОстаткиТоваров.ДокументПоступления КАК ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
			|	ВременнаяТаблицаОстаткиТоваров.СуммаРасходов КАК СуммаРасходов
			|ПОМЕСТИТЬ ВТ_ОстаткиТоваров
			|ИЗ
			|	ВременнаяТаблицаОстаткиТоваров КАК ВременнаяТаблицаОстаткиТоваров
			|ГДЕ
			|	ВременнаяТаблицаОстаткиТоваров.Отметка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РасспределениеЗатратНаТовары.ВнеоборотныйАктив,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
			|	РасспределениеЗатратНаТовары.СтруктурнаяЕдиница,
			//ПодольскийАИ #УчетПроектов 24.12.2020 {
			|	Значение(Справочник.Проекты.ПустаяСсылка),
			//ПодольскийАИ #УчетПроектов 24.12.2020 }
			|	1,
			|	РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизации - РасспределениеЗатратНаТовары.РазницаСтоимости,
			|	РасспределениеЗатратНаТовары.Ссылка,
			|	РасспределениеЗатратНаТовары.Организация,
			|	РасспределениеЗатратНаТовары.Период,
			|	РасспределениеЗатратНаТовары.Валюта,
			|	Неопределено, //Малышев 2024-11-29 ONESOFT-3641
			|	РасспределениеЗатратНаТовары.РазницаСтоимости
			|ИЗ
			|	ВременнаяТаблицаИмущество КАК РасспределениеЗатратНаТовары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблицаОборотыПоСчетам.СчетУчета КАК СчетУчета,
			|	ВременнаяТаблицаОборотыПоСчетам.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница_Подразделение,
			//ПодольскийАИ #УчетПроектов 16.12.2020 {
			|	ВременнаяТаблицаОборотыПоСчетам.Проект КАК Проект,
			|	ВременнаяТаблицаОборотыПоСчетам.НоменклатураРаспределения КАК НоменклатураРаспределения,
			|	ВременнаяТаблицаОборотыПоСчетам.ХарактеристикаРаспределения КАК ХарактеристикаРаспределения,
			//ПодольскийАИ #УчетПроектов 16.12.2020 }
			|	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто1 КАК ВидСубконто1,
			|	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто2 КАК ВидСубконто2,
			|	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто3 КАК ВидСубконто3,
			|	ВЫРАЗИТЬ(ВременнаяТаблицаОборотыПоСчетам.Сумма КАК ЧИСЛО(15, 2)) КАК Сумма
			|ПОМЕСТИТЬ ВТ_Обороты
			|ИЗ
			|	ВременнаяТаблицаОборотыПоСчетам КАК ВременнаяТаблицаОборотыПоСчетам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Обороты.Проект КАК Проект,
			|	СУММА(ВТ_Обороты.Сумма) КАК Сумма
			|ПОМЕСТИТЬ ВТ_ОборотыГрупп
			|ИЗ
			|	ВТ_Обороты КАК ВТ_Обороты
			|СГРУППИРОВАТЬ ПО
			|	Проект
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ОстаткиТоваров.Номенклатура КАК Номенклатура,
			|	ВТ_ОстаткиТоваров.Характеристика КАК Характеристика,
			|	ВТ_ОстаткиТоваров.СуммаРасходов КАК СуммаРасходов,
			|	ВТ_Обороты.СчетУчета КАК СчетУчета,
			|	ВТ_Обороты.Сумма КАК СуммаПоСчету,
			|	isnull(ВТ_ОборотыГрупп.Сумма, 0) КАК СуммаГрупп,
			|	Выбор Когда isnull(ВТ_ОстаткиТоваров.СуммаРасходов, 0) = 0 Тогда 0 Иначе ВТ_ОборотыГрупп.Сумма / ВТ_ОстаткиТоваров.СуммаРасходов Конец КАК Коэф,
			|	ВЫБОР
			|		КОГДА isnull(ВТ_ОборотыГрупп.Сумма, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Обороты.Сумма / (ВТ_ОборотыГрупп.Сумма / ВТ_ОстаткиТоваров.СуммаРасходов) КАК ЧИСЛО(15, 2)) 
			|	КОНЕЦ КАК ЧастьСуммы,
			|	ВТ_Обороты.СтруктурнаяЕдиница_Подразделение,
			//ПодольскийАИ #УчетПроектов 29.12.2020 {
			|	ВТ_Обороты.Проект,
			|	ВТ_Обороты.НоменклатураРаспределения,
			|	ВТ_Обороты.ХарактеристикаРаспределения,
			//ПодольскийАИ #УчетПроектов 29.12.2020 }
			|	ВТ_Обороты.ВидСубконто1,
			|	ВТ_Обороты.ВидСубконто2,
			|	ВТ_Обороты.ВидСубконто3,
			|	ВТ_ОстаткиТоваров.СтруктурнаяЕдиница_Склад,
			|	isnull(ВТ_ОстаткиТоваров.Количество, 0) КАК Количество,
			|	isnull(ВТ_ОстаткиТоваров.Себистоимость, 0) КАК Себистоимость,
			|	ВТ_ОстаткиТоваров.Валюта,
			|	ВТ_ОстаткиТоваров.ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
			|	ВТ_ОстаткиТоваров.Организация,
			|	ВТ_ОстаткиТоваров.Период,
			|	ВТ_ОстаткиТоваров.Ссылка
			|ПОМЕСТИТЬ ВТРаспред
			|ИЗ
			//ПодольскийАИ #УчетПроектов 16.12.2020 {
			//Было---
			//|	ВТ_ОстаткиТоваров КАК ВТ_ОстаткиТоваров,
			//|	ВТ_Обороты КАК ВТ_Обороты,
			//|	ВТ_ОборотыГрупп КАК ВТ_ОборотыГрупп
			//Стало++
			|	ВТ_Обороты КАК ВТ_Обороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОборотыГрупп КАК ВТ_ОборотыГрупп
			|		ПО ВТ_Обороты.Проект = ВТ_ОборотыГрупп.Проект
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиТоваров КАК ВТ_ОстаткиТоваров
			|		ПО ВТ_Обороты.Проект = ВТ_ОстаткиТоваров.Проект
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(ВТРаспред.ЧастьСуммы) КАК МаксЧасть,
			|	ВТРаспред.СуммаПоСчету,
			|	СУММА(ВТРаспред.ЧастьСуммы) КАК ЧастьСуммы,
			|	ВТРаспред.СуммаПоСчету - СУММА(ВТРаспред.ЧастьСуммы) КАК Разница,
			|	ВТРаспред.СчетУчета,
			|	ВТРаспред.Проект
			|ПОМЕСТИТЬ ВТ_РаспредГруппПроверка
			|ИЗ
			|	ВТРаспред КАК ВТРаспред
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТРаспред.СуммаПоСчету,
			|	ВТРаспред.СчетУчета,
			|	ВТРаспред.Проект
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_РаспредГруппПроверка.МаксЧасть КАК МаксЧасть,
			|	ВТ_РаспредГруппПроверка.СуммаПоСчету КАК СуммаПоСчету,
			|	ВТ_РаспредГруппПроверка.ЧастьСуммы КАК ЧастьСуммы,
			|	ВТ_РаспредГруппПроверка.Разница КАК Разница,
			|	ВТ_РаспредГруппПроверка.СчетУчета КАК СчетУчета,
			|	ВТ_РаспредГруппПроверка.Проект КАК Проект,
			|	ВТРаспред.Номенклатура КАК Номенклатура,
			|	ВТРаспред.Характеристика КАК Характеристика,
			|	ВТРаспред.ДокументПоступления КАК ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
			|	МАКСИМУМ(ВТРаспред.Себистоимость) КАК Себистоимость
			|ПОМЕСТИТЬ ВТ_РаспредГруппПроверка2
			|ИЗ
			|	ВТ_РаспредГруппПроверка КАК ВТ_РаспредГруппПроверка
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспред КАК ВТРаспред
			|		ПО ВТ_РаспредГруппПроверка.СуммаПоСчету = ВТРаспред.СуммаПоСчету
			|			И ВТ_РаспредГруппПроверка.МаксЧасть = ВТРаспред.ЧастьСуммы
			|			И ВТ_РаспредГруппПроверка.СчетУчета = ВТРаспред.СчетУчета
			|			И ВТ_РаспредГруппПроверка.Проект = ВТРаспред.Проект
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_РаспредГруппПроверка.МаксЧасть,
			|	ВТ_РаспредГруппПроверка.СуммаПоСчету,
			|	ВТ_РаспредГруппПроверка.ЧастьСуммы,
			|	ВТ_РаспредГруппПроверка.Разница,
			|	ВТ_РаспредГруппПроверка.СчетУчета,
			|	ВТ_РаспредГруппПроверка.Проект,
			|	ВТРаспред.ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
			|	ВТРаспред.Номенклатура,
			|	ВТРаспред.Характеристика
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТРаспред.Номенклатура КАК Номенклатура,
			|	ВТРаспред.Характеристика КАК Характеристика,
			|	МИНИМУМ(ВТРаспред.ЧастьСуммы) КАК МинимальнаяЧасть,
			|	СУММА(ВТРаспред.ЧастьСуммы) КАК ЧастьСуммы,
			|	ВТРаспред.СчетУчета,
			|	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
			//ПодольскийАИ #УчетПроектов 29.12.2020 {
			|	ВТРаспред.Проект,
			|	ВТРаспред.НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения,
			//ПодольскийАИ #УчетПроектов 29.12.2020 }
			|	ВТРаспред.ВидСубконто1,
			|	ВТРаспред.ВидСубконто2,
			|	ВТРаспред.ВидСубконто3,
			|	ВТРаспред.СтруктурнаяЕдиница_Склад,
			|	ВТРаспред.Количество,
			|	ВТРаспред.Себистоимость,
			|	ВТРаспред.Валюта
			|ПОМЕСТИТЬ ВТ_РаспредГрупп
			|ИЗ
			|	ВТРаспред КАК ВТРаспред
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТРаспред.Номенклатура,
			|	ВТРаспред.Характеристика,
			|	ВТРаспред.СчетУчета,
			|	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
			//ПодольскийАИ #УчетПроектов 29.12.2020 {
			|	ВТРаспред.Проект,
			|	ВТРаспред.НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения,
			//ПодольскийАИ #УчетПроектов 29.12.2020 }
			|	ВТРаспред.ВидСубконто3,
			|	ВТРаспред.СтруктурнаяЕдиница_Склад,
			|	ВТРаспред.ВидСубконто1,
			|	ВТРаспред.ВидСубконто2,
			|	ВТРаспред.Количество,
			|	ВТРаспред.Себистоимость,
			|	ВТРаспред.Валюта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТРаспред.Номенклатура КАК Номенклатура,
			|	ВТРаспред.Характеристика КАК Характеристика,
			|	ВТРаспред.СуммаРасходов КАК СуммаРасходов,
			|	ВТРаспред.СчетУчета КАК СчетУчета,
			|	ВТРаспред.СуммаПоСчету КАК СуммаПоСчету,
			|	ВТРаспред.СуммаГрупп КАК СуммаГрупп,
			|	ВТРаспред.Коэф КАК Коэф,
			|	ВТРаспред.ЧастьСуммы КАК ЧастьСуммы,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
			|	КОНЕЦ КАК СуммаПоСчетуРаспределение,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.МинимальнаяЧасть, 0) = 0
			|			ТОГДА ВТРаспред.ЧастьСуммы
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ВТРаспред.СуммаПоСчету - ВЫБОР
			|						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
			|							ТОГДА ВТРаспред.СуммаПоСчету
			|						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
			|					КОНЕЦ = 0
			|					ТОГДА ВТ_РаспредГрупп.МинимальнаяЧасть
			|				ИНАЧЕ ВТ_РаспредГрупп.МинимальнаяЧасть + (ВТРаспред.СуммаПоСчету - ВЫБОР
			|						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
			|							ТОГДА ВТРаспред.СуммаПоСчету
			|						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
			|					КОНЕЦ)
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаПропрорция,
			|	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
			//ПодольскийАИ #УчетПроектов 16.12.2020 {
			|	ВТРаспред.Проект,
			|	ВТРаспред.НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения,
			//ПодольскийАИ #УчетПроектов 16.12.2020 }
			|	ВТРаспред.ВидСубконто1,
			|	ВТРаспред.ВидСубконто2,
			|	ВТРаспред.ВидСубконто3,
			|	ВТРаспред.СтруктурнаяЕдиница_Склад,
			|	ВТРаспред.Количество,
			|	ВТРаспред.Себистоимость,
			|	ВТРаспред.Валюта,
			|	ВТРаспред.Организация,
			|	ВТРаспред.Период,
			|	ВТРаспред.ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
			|	ВТРаспред.Ссылка
			|ПОМЕСТИТЬ ВТ_РасчетФинал
			|ИЗ
			|	ВТРаспред КАК ВТРаспред
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспредГрупп КАК ВТ_РаспредГрупп
			|		ПО ВТРаспред.Номенклатура = ВТ_РаспредГрупп.Номенклатура
			|			И ВТРаспред.Характеристика = ВТ_РаспредГрупп.Характеристика
			|			И ВТРаспред.ЧастьСуммы = ВТ_РаспредГрупп.МинимальнаяЧасть
			|			И ВТРаспред.СтруктурнаяЕдиница_Подразделение = ВТ_РаспредГрупп.СтруктурнаяЕдиница_Подразделение
			//ПодольскийАИ #УчетПроектов 16.12.2020 {
			|			И ВТРаспред.Проект = ВТ_РаспредГрупп.Проект
			|			И ВТРаспред.НоменклатураРаспределения = ВТ_РаспредГрупп.НоменклатураРаспределения
			|			И ВТРаспред.ХарактеристикаРаспределения = ВТ_РаспредГрупп.ХарактеристикаРаспределения
			//ПодольскийАИ #УчетПроектов 16.12.2020 }
			|			И ВТРаспред.ВидСубконто1 = ВТ_РаспредГрупп.ВидСубконто1
			|			И ВТРаспред.ВидСубконто2 = ВТ_РаспредГрупп.ВидСубконто2
			|			И ВТРаспред.ВидСубконто3 = ВТ_РаспредГрупп.ВидСубконто3
			|			И ВТРаспред.СтруктурнаяЕдиница_Склад = ВТ_РаспредГрупп.СтруктурнаяЕдиница_Склад
			|			И ВТРаспред.Количество = ВТ_РаспредГрупп.Количество
			|			И ВТРаспред.Себистоимость = ВТ_РаспредГрупп.Себистоимость
			|			И ВТРаспред.Валюта = ВТ_РаспредГрупп.Валюта
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
			//ПодольскийАИ #УчетПроектов 16.12.2020 {
			|	ВТРаспред.Проект,
			|	ВТРаспред.НоменклатураРаспределения,
			|	ВТРаспред.ХарактеристикаРаспределения,
			//ПодольскийАИ #УчетПроектов 16.12.2020 }
			|	ВТРаспред.Характеристика,
			|	ВТРаспред.Ссылка,
			|	ВТРаспред.СуммаРасходов,
			|	ВТРаспред.Номенклатура,
			|	ВТРаспред.Организация,
			|	ВТРаспред.ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
			|	ВТРаспред.Период,
			|	ВТРаспред.ВидСубконто1,
			|	ВТРаспред.Валюта,
			|	ВТРаспред.СчетУчета,
			|	ВТРаспред.ВидСубконто3,
			|	ВТРаспред.Себистоимость,
			|	ВТРаспред.СтруктурнаяЕдиница_Склад,
			|	ВТРаспред.ВидСубконто2,
			|	ВТРаспред.Количество,
			|	ВТРаспред.СуммаПоСчету,
			|	ВТРаспред.СуммаГрупп,
			|	ВТРаспред.Коэф,
			|	ВТРаспред.ЧастьСуммы,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.МинимальнаяЧасть, 0) = 0
			|			ТОГДА ВТРаспред.ЧастьСуммы
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ВТРаспред.СуммаПоСчету - ВЫБОР
			|						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
			|							ТОГДА ВТРаспред.СуммаПоСчету
			|						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
			|					КОНЕЦ = 0
			|					ТОГДА ВТ_РаспредГрупп.МинимальнаяЧасть
			|				ИНАЧЕ ВТ_РаспредГрупп.МинимальнаяЧасть + (ВТРаспред.СуммаПоСчету - ВЫБОР
			|						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
			|							ТОГДА ВТРаспред.СуммаПоСчету
			|						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
			|					КОНЕЦ)
			|			КОНЕЦ
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_РасчетФинал.Номенклатура КАК Номенклатура,
			|	ВТ_РасчетФинал.Характеристика КАК Характеристика,
			|	ВТ_РасчетФинал.СчетУчета КАК СчетУчета,
			|	ВТ_РасчетФинал.СуммаПоСчетуРаспределение,
			|	ВТ_РасчетФинал.СуммаПоСчетуРаспределение + ЕСТЬNULL(ВТ_РаспредГруппПроверка2.Разница, 0) КАК Сумма,
			|	ВТ_РаспредГруппПроверка2.Разница КАК Поле,
			|	ВТ_РасчетФинал.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница_Подразделение,
			//ПодольскийАИ #УчетПроектов 16.12.2020 {
			|	ВТ_РасчетФинал.Проект,
			|	ВТ_РасчетФинал.ДокументПоступления, //Малышев 2024-11-29 ONESOFT-3641
			|	ВТ_РасчетФинал.НоменклатураРаспределения,
			|	ВТ_РасчетФинал.ХарактеристикаРаспределения,
			//ПодольскийАИ #УчетПроектов 16.12.2020 }
			|	ВТ_РасчетФинал.ВидСубконто1 КАК ВидСубконто1,
			|	ВТ_РасчетФинал.ВидСубконто2 КАК ВидСубконто2,
			|	ВТ_РасчетФинал.ВидСубконто3 КАК ВидСубконто3,
			|	ВТ_РасчетФинал.СтруктурнаяЕдиница_Склад КАК СтруктурнаяЕдиница_Склад,
			|	ВТ_РасчетФинал.Количество КАК Количество,
			|	ВТ_РасчетФинал.Себистоимость КАК Себистоимость,
			|	ВТ_РаспредГруппПроверка2.Себистоимость КАК СБ,
			|	ВТ_РасчетФинал.Валюта КАК Валюта,
			|	ВТ_РасчетФинал.Организация КАК Организация,
			|	ВТ_РасчетФинал.Период КАК Период,
			|	ВТ_РасчетФинал.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВременнаяТаблицаРаспределениеСумм
			|ИЗ
			|	ВТ_РасчетФинал КАК ВТ_РасчетФинал
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспредГруппПроверка2 КАК ВТ_РаспредГруппПроверка2
			|		ПО ВТ_РасчетФинал.СуммаПоСчетуРаспределение = ВТ_РаспредГруппПроверка2.МаксЧасть
			|			И ВТ_РасчетФинал.СчетУчета = ВТ_РаспредГруппПроверка2.СчетУчета
			|			И ВТ_РасчетФинал.Проект = ВТ_РаспредГруппПроверка2.Проект
			|			И ВТ_РасчетФинал.Номенклатура = ВТ_РаспредГруппПроверка2.Номенклатура
			|			И ВТ_РасчетФинал.Характеристика = ВТ_РаспредГруппПроверка2.Характеристика
			|			И ВТ_РасчетФинал.ДокументПоступления = ВТ_РаспредГруппПроверка2.ДокументПоступления //Малышев 2024-11-29 ONESOFT-3641
			|			И ВТ_РасчетФинал.Себистоимость = ВТ_РаспредГруппПроверка2.Себистоимость";
	
КонецФункции

//ПодольскийАИ #УчетПроектов 16.12.2020 }



