
Процедура ПередЗаписью(Отказ, Замещение)

	Если ЭтотОбъект.Количество() = 1 И Не Замещение Тогда
		Организация = ЭтотОбъект[0].Организация;
		Если НЕ Организация.МногопользовательскийРежимОбменаRS Тогда
			ТекстСообщения = НСтр("ru = ' У текущей организации не включен многопользовательский режим обмена RS!'; ka = 'მოცემულ ორგანიზაციას არა აქვს ჩართული RS-ის მრავალმომხმარებლიანი რეჟიმის გამოყენება!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке( ,ТекстСообщения, , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
