#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем ИспользоватьТолькоРегламентированныйПланСчетов Экспорт; //+++ Дмгг
#Область ПроцедурыЗаполненияДокумента

// Обработчик заполнения на основании документа ПриходныйОрдер.
//
// Параметры:
//	ДокументСсылкаПриходныйОрдер - ДокументСсылка.ПриходныйОрдер - Плановый платеж
//	
Процедура ЗаполнитьПоПриходномуОрдеру(ДокументСсылкаПриходныйОрдер) Экспорт
	
	Организация = ДокументСсылкаПриходныйОрдер.Организация;
	ДокументОснование = ДокументСсылкаПриходныйОрдер.Ссылка;
	Запасы.Очистить();
	
	Для каждого ТекСтрокаЗапасы Из ДокументСсылкаПриходныйОрдер.Запасы Цикл
		
		НоваяСтрока = Запасы.Добавить();
		НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаЗапасы.ЕдиницаИзмерения;
		НоваяСтрока.Количество = ТекСтрокаЗапасы.Количество;
		НоваяСтрока.Номенклатура = ТекСтрокаЗапасы.Номенклатура;
		НоваяСтрока.Партия = ТекСтрокаЗапасы.Партия;
		НоваяСтрока.Характеристика = ТекСтрокаЗапасы.Характеристика;
		НоваяСтрока.СтруктурнаяЕдиница = ДокументСсылкаПриходныйОрдер.СтруктурнаяЕдиница;
		НоваяСтрока.Ячейка = ДокументСсылкаПриходныйОрдер.Ячейка;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоПриходномуОрдеру()

// Обработчик ввода на основании документа РасходИзКассы.
//
// Параметры:
//	ДокументСсылкаРасходИзКассы - ДокументСсылка.РасходИзКассы.
//	
Процедура ЗаполнитьПоРасходуИзКассы(ДокументСсылкаРасходИзКассы) Экспорт
	
	Если ДокументСсылкаРасходИзКассы.ВидОперации <> Перечисления.ВидыОперацийРасходИзКассы.Подотчетнику Тогда
		ВызватьИсключение НСтр("ka='საავანსო ანგარიშგების შეყვანა შეუძლებელია სალაროდან გასავლის საფუძველზე ოპერაციის ამ ტიპით!';ru='Нельзя ввести Авансовый отчет на основании расхода из кассы с этим видом операции!';en='You can not enter expense reports on the basis of cash flow with this type of operation!'");
	КонецЕсли;
	
	Организация = ДокументСсылкаРасходИзКассы.Организация;
	ДокументОснование = ДокументСсылкаРасходИзКассы.Ссылка;
	Сотрудник = ДокументСсылкаРасходИзКассы.Подотчетник;
	ВалютаДокумента = ДокументСсылкаРасходИзКассы.ВалютаДенежныхСредств;
	
	Если НЕ ЗначениеЗаполнено(ПодписьБухгалтера) Тогда
		
		ПодписьБухгалтера = ДокументСсылкаРасходИзКассы.Касса.ПодписьКассира;
		
	КонецЕсли;
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаДокумента));
	Курс = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	Кратность = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
	ВыданныеАвансы.Очистить();
	НоваяСтрока = ВыданныеАвансы.Добавить();
	НоваяСтрока.Документ = ДокументСсылкаРасходИзКассы.Ссылка;
	НоваяСтрока.Сумма = ДокументСсылкаРасходИзКассы.СуммаДокумента;
	
КонецПроцедуры // ЗаполнитьПоРасходуИзКассы()

// Обработчик заполнения на основании документа РасходСоСчета.
//
// Параметры:
//	ДокументСсылкаРасходСоСчета - ДокументСсылка.РасходСоСчета.
//	
Процедура ЗаполнитьПоРасходуСоСчета(ДокументСсылкаРасходСоСчета) Экспорт
	
	Если ДокументСсылкаРасходСоСчета.ВидОперации <> Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику Тогда
		ВызватьИсключение НСтр("ka='საავანსო ანგარიშგების შეყვანა შეუძლებელია სალაროდან გასავლის საფუძველზე ოპერაციის ამ ტიპით!';ru='Нельзя ввести Авансовый отчет на основании расхода со счета с этим видом операции!';en='You can not enter expense reports on the basis of the flow from the account with this kind of operation!'");
	КонецЕсли;
	
	Организация = ДокументСсылкаРасходСоСчета.Организация;
	ДокументОснование = ДокументСсылкаРасходСоСчета.Ссылка;
	Сотрудник = ДокументСсылкаРасходСоСчета.Подотчетник;
	ВалютаДокумента = ДокументСсылкаРасходСоСчета.ВалютаДенежныхСредств;
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаДокумента));
	Курс = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	Кратность = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
	ВыданныеАвансы.Очистить();
	НоваяСтрока = ВыданныеАвансы.Добавить();
	НоваяСтрока.Документ = ДокументСсылкаРасходСоСчета.Ссылка;
	НоваяСтрока.Сумма = ДокументСсылкаРасходСоСчета.СуммаДокумента;
	
КонецПроцедуры // ЗаполнитьПоРасходуСоСчета()

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходныйОрдер")] = "ЗаполнитьПоПриходномуОрдеру";
	СтратегияЗаполнения[Тип("ДокументСсылка.РасходИзКассы")] = "ЗаполнитьПоРасходуИзКассы";
	СтратегияЗаполнения[Тип("ДокументСсылка.РасходСоСчета")] = "ЗаполнитьПоРасходуСоСчета";
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//+++ Дмгг
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
	//--- Дмгг
	
	ИзрасходованоИтог = ВыданныеАвансы.Итог("Сумма");
	//Паганини_
	//ЗапасыИтог = Запасы.Итог("Всего");
	//РасходыИтог = Расходы.Итог("Всего");
	ЗапасыИтог = Запасы.Итог("Всего") - Запасы.Итог("СуммаРасходовНДФЛ") - Запасы.Итог("СуммаПФ");
	РасходыИтог = Расходы.Итог("СуммаБезНалогов") + Расходы.Итог("СуммаНДС");
	//_Паганини
	ОплатыИтог = Оплаты.Итог("СуммаПлатежа");
	ЗПИтог = ПлатежныеВедомости.Итог("Сумма"); //+++ Дмгг
	
	Если ИзрасходованоИтог > ЗапасыИтог + РасходыИтог + ОплатыИтог + ЗПИтог Тогда
		ТекстСообщения = НСтр("ka='ავანსების გახარჯული თანხა აღემატება თანხას დოკუმენტის მიხედვით!';ru='Израсходованная сумма авансов превышает сумму по документу!';en='Amount spent exceeds the amount of advances on the document!'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			ЭтотОбъект,
			ТекстСообщения,
			"ВыданныеАвансы",
			1,
			"Сумма",
			Отказ
		);
	КонецЕсли;
	
	Для каждого СтрокаОплаты Из Оплаты Цикл
		Если СтрокаОплаты.Контрагент.ВестиРасчетыПоДокументам
		   И НЕ СтрокаОплаты.ПризнакАванса
		   И НЕ ЗначениеЗаполнено(СтрокаОплаты.Документ) Тогда
			ТекстСообщения = НСтр("ka='სია ""გადახდების"" სტრიქონ %НомерСтроки% სვეტი ""ანგარიშსწორებათა დოკუმენტი"" შეუვსებელია.';ru='Не заполнена колонка ""Документ расчетов"" в строке %НомерСтроки% списка ""Оплаты"".';en='Not filled column ""payment document"" on line% NomerStroki% list ""Payment"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Строка(СтрокаОплаты.НомерСтроки));
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстСообщения,
				"Оплаты",
				СтрокаОплаты.НомерСтроки,
				"Документ",
				Отказ
			);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаРасходы Из Расходы Цикл
		
		Если НЕ ИспользоватьТолькоРегламентированныйПланСчетов Тогда //+++ Дмгг
			Если ПолучитьФункциональнуюОпцию("УчетПоНесколькимПодразделениям")
				И (СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство
				ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
				ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.Доходы
				ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы)
				И НЕ ЗначениеЗаполнено(СтрокаРасходы.СтруктурнаяЕдиница) Тогда
				ТекстСообщения = НСтр("ka='სია ""ხარჯების""  სტრიქონ  %НомерСтроки% მითითებული ნომენკლატურისთვის ""%Номенклатура%"" უნდა შეივსოს რეკვიზიტი ""ქვეგანყოფილება"".';ru='Для номенклатуры ""%Номенклатура%"" указанной в строке %НомерСтроки% списка ""Расходы"", должен быть заполнен реквизит ""Подразделение"".';en='For nomenclature ""% Range%"" referred to in line% NomerStroki% list ""costs"" must be filled with props ""Division"".'"
				);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номенклатура%", СокрЛП(Строка(СтрокаРасходы.Номенклатура))); 
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%",Строка(СтрокаРасходы.НомерСтроки));
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстСообщения,
				"Расходы",
				СтрокаРасходы.НомерСтроки,
				"СтруктурнаяЕдиница",
				Отказ
				);
			КонецЕсли;
			//+++ Дмгг
		Иначе
			
			Если ПолучитьФункциональнуюОпцию("УчетПоНесколькимПодразделениям")
				И (СтрокаРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство
				ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
				ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.Доходы
				ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы)
				И НЕ ЗначениеЗаполнено(СтрокаРасходы.СтруктурнаяЕдиница) Тогда
				ТекстСообщения = НСтр("ka='სია ""ხარჯების""  სტრიქონ  %НомерСтроки% მითითებული ნომენკლატურისთვის ""%Номенклатура%"" უნდა შეივსოს რეკვიზიტი ""ქვეგანყოფილება"".';ru='Для номенклатуры ""%Номенклатура%"" указанной в строке %НомерСтроки% списка ""Расходы"", должен быть заполнен реквизит ""Подразделение"".';en='For nomenclature ""% Range%"" referred to in line% NomerStroki% list ""costs"" must be filled with props ""Division"".'"
				);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номенклатура%", СокрЛП(Строка(СтрокаРасходы.Номенклатура))); 
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%",Строка(СтрокаРасходы.НомерСтроки));
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстСообщения,
				"Расходы",
				СтрокаРасходы.НомерСтроки,
				"СтруктурнаяЕдиница",
				Отказ
				);
			КонецЕсли;
			
		КонецЕсли;
		//--- Дмгг
	КонецЦикла;
	
	Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		ПроверяемыеРеквизиты.Добавить("Запасы.ВидНалогаНДС");
		ПроверяемыеРеквизиты.Добавить("Расходы.ВидНалогаНДС");
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//+++ Дмгг
	//СуммаДокумента = Запасы.Итог("Всего") + Расходы.Итог("Всего") + Оплаты.Итог("СуммаПлатежа");
	СуммаДокумента = Запасы.Итог("Всего") + Расходы.Итог("Всего") + Оплаты.Итог("СуммаПлатежа") + ПлатежныеВедомости.Итог("Сумма");
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
		
		Для каждого СтрокаРасходы из Расходы Цикл
			
			Если НЕ ИспользоватьТолькоРегламентированныйПланСчетов Тогда //+++ Дмгг
				Если СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					
					СтрокаРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
					
				Иначе
					
					СтрокаРасходы.НаправлениеДеятельности = Неопределено;
					
				КонецЕсли;
				//+++ Дмгг
			ИНаче
				
				Если СтрокаРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					
					СтрокаРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
					
				Иначе
					
					СтрокаРасходы.НаправлениеДеятельности = Неопределено;
					
				КонецЕсли;
				
			КонецЕсли;
			//--- Дмгг
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Оплаты Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Контрагент)
		И НЕ СтрокаТЧ.Контрагент.ВестиРасчетыПоДоговорам
		И НЕ ЗначениеЗаполнено(СтрокаТЧ.Договор) Тогда
			СтрокаТЧ.Договор = СтрокаТЧ.Контрагент.ДоговорПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.АвансовыйОтчет.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыКПоступлениюНаСклады(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПодотчетниками(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПоставщиками(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыКассовыйМетод(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыНераспределенные(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыОтложенные(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗакупки(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьОплатаСчетовИЗаказов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьПлатежныйКалендарь(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыНДФЛ(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоНалогам(ДополнительныеСвойства, Движения, Отказ);//Паганини
	//Паганини ПФ_
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьРасчетыСПенсионнымФондом(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьДекларация(ДополнительныеСвойства, Движения, Отказ);
	//_Паганини ПФ
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПерсоналом(ДополнительныеСвойства, Движения, Отказ); //+++ Дмгг
	
	//ДД
	УправлениеНебольшойФирмойСервер.ОтразитьНалоговыеЛготы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьОстаткиНалоговыхЛьгот(ДополнительныеСвойства, Движения, Отказ);
	
	УправлениеНебольшойФирмойСервер.ОтразитьЗакупкиДляКУДиР(ДополнительныеСвойства, Движения, Отказ);
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.АвансовыйОтчет.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	Если НЕ Отказ Тогда 
		Документы.АвансовыйОтчет.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ,,Истина);
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для удаления проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.АвансовыйОтчет.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
	// Подчиненная счет-фактура (полученная)
	Если НЕ Отказ Тогда
		
		КонтрольПодчиненнойСчетФактуры();
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура отмены проведения у подченненой счет фактуры (полученной)
//
Процедура КонтрольПодчиненнойСчетФактуры()
	
	СтруктураСчетаФактуры = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйСчетФактуру(Ссылка, Истина);
	Если СтруктураСчетаФактуры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СчетФактура	 = СтруктураСчетаФактуры.Ссылка;
	Если Не СчетФактура.Проведен Тогда
		Возврат;
	КонецЕсли;
		
	ТекстСообщения = НСтр("ka='მოძრაობების არარსებობის გამო დოკუმენტ %ПредставлениеТекущегоДокумента%-ს გაუტარდება %ПредставлениеСчетФактуры%.';ru='В связи с отсутствием движений у документа %ПредставлениеТекущегоДокумента% распроводится %ПредставлениеСчетФактуры%.';en='Due to the lack of movement in the document PredstavlenieTekuschegoDokumenta%%% rasprovoditsya PredstavlenieSchetFaktury%.'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеТекущегоДокумента%", """Авансовый отчет № " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy") + """");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеСчетФактуры%", """Счет фактура (полученная) № " + СтруктураСчетаФактуры.Номер + " от " + СтруктураСчетаФактуры.Дата + """");
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
	СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
	СчетФактураОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры //КонтрольПодчиненнойСчетФактуры()

#КонецОбласти
ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())); //+++ Дмгг
#КонецЕсли