
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЦветФонаСтатьи = Объект.Ссылка.ЦветФонаСтатьи.Получить();
		ЦветТекстаСтатьи = Объект.Ссылка.ЦветТекстаСтатьи.Получить();
		ШрифтСтатьи = Объект.Ссылка.ШрифтСтатьи.Получить();
	Иначе
		ЦветФонаСтатьи = Новый Цвет(255, 255, 255);
		ЦветТекстаСтатьи = Новый Цвет(0, 0, 0);
		ШрифтСтатьи = Новый Шрифт("Arial", 8);
	КонецЕсли;
	//--------------------------------------------------------------------------
	// © Шишка В.В. [18 января 2022]  НАЧАЛО
	ПолучитьТекстОтборовJSON();	
	// © Шишка В.В. [18 января 2022]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЦветФонаСтатьи = Новый ХранилищеЗначения(ЦветФонаСтатьи);
	ТекущийОбъект.ЦветТекстаСтатьи = Новый ХранилищеЗначения(ЦветТекстаСтатьи);
	ТекущийОбъект.ШрифтСтатьи = Новый ХранилищеЗначения(ШрифтСтатьи);
	//--------------------------------------------------------------------------
	// © Шишка В.В. [18 января 2022]  НАЧАЛО
	Для Сч = 0 По Объект.Источники.Количество() - 1 Цикл
	
		СтрокаДанныхФормы = Объект.Источники[Сч];
		Если Не ПустаяСтрока(СтрокаДанныхФормы.ТекстОтбора_JSON) Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(СтрокаДанныхФормы.ТекстОтбора_JSON);
			Результат = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON, Тип("ТаблицаЗначений"));
			Если ТипЗнч(Результат) = Тип("ТаблицаЗначений") Тогда
				
				ДанныеОтбораСтроки = Новый ХранилищеЗначения(Результат, Новый СжатиеДанных(9));
				ТекущийОбъект.Источники[Сч].ОтборыПоСубконто = ДанныеОтбораСтроки;
				
			Иначе
				
				ТекущийОбъект.Источники[Сч].ОтборыПоСубконто = Неопределено;
				
			КонецЕсли; 
			
		Иначе
			
			ТекущийОбъект.Источники[Сч].ОтборыПоСубконто = Неопределено;
			
		КонецЕсли; 	
	
	КонецЦикла; 	
	// © Шишка В.В. [18 января 2022]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулыФормулаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Объект.Формулы.НайтиПоИдентификатору(Элементы.Формулы.ТекущаяСтрока);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец", Объект.Владелец);
	ПараметрыФормы.Вставить("Формула", ТекущиеДанные.Формула);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьРедактированиеФормулы", ЭтаФорма);
	
	ОткрытьФорму("Справочник.ДЛ_СтатьиУниверсальногоОтчета.Форма.ФормаРедакторФормулы", ПараметрыФормы, Элемент,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеФормулы(Результат, ДопПараметры) Экспорт

	Если Результат <> Неопределено Тогда
	
		Если Элементы.Формулы.ТекущаяСтрока <> Неопределено Тогда
		
			ТекущиеДанные = Объект.Формулы.НайтиПоИдентификатору(Элементы.Формулы.ТекущаяСтрока);
			ТекущиеДанные.Формула = Результат;
		
		КонецЕсли; 
	
	КонецЕсли; 

КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

//--------------------------------------------------------------------------
// © Шишка В.В. [18 января 2022]  НАЧАЛО
#Область ОтборыПоСубконто

&НаСервере
Процедура ПолучитьТекстОтборовJSON()

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		СтатьяОтчетаОбъект = РеквизитФормыВЗначение("Объект");
		Для Сч = 0 По СтатьяОтчетаОбъект.Источники.Количество() - 1 Цикл
		
			СтрокаОбъекта = СтатьяОтчетаОбъект.Источники[Сч];
			ДанныеОтборов = СтрокаОбъекта.ОтборыПоСубконто.Получить();
			Если ТипЗнч(ДанныеОтборов) = Тип("ТаблицаЗначений") Тогда
				
				ЗаписьJSON = Новый ЗаписьJSON;
				ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
				ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
				СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ДанныеОтборов);
				Объект.Источники[Сч].ТекстОтбора_JSON = ЗаписьJSON.Закрыть();
				
			КонецЕсли; 
		
		КонецЦикла; 
	
	КонецЕсли; 	

КонецПроцедуры // ПолучитьТекстОтборовJSON()

&НаКлиенте
Процедура ИсточникиТекстОтбора_JSONОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Источники.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
	
		ПараметрыФормыОтборов = Новый Структура("СчетУчета, ИдентификаторСтроки, ТекстJSON", ТекущиеДанные.СчетУчета, ТекущиеДанные.ПолучитьИдентификатор(), ТекущиеДанные.ТекстОтбора_JSON);
		ОткрытьФорму("Справочник.ДЛ_СтатьиУниверсальногоОтчета.Форма.ФормаОтборовСубконто", ПараметрыФормыОтборов, ЭтотОбъект, УникальныйИдентификатор,,, Новый ОписаниеОповещения("ИсточникиТекстОтбора_JSONОткрытиеЗавершение", ЭтотОбъект), );
		
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиТекстОтбора_JSONОткрытиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
	
		СтрокаТЧ = Объект.Источники.НайтиПоИдентификатору(Результат.ИдентификаторСтроки);
		СтрокаТЧ.ТекстОтбора_JSON = Результат.ТекстJSON;
	
	КонецЕсли; 	

КонецПроцедуры
 


#КонецОбласти 	
// © Шишка В.В. [18 января 2022]  КОНЕЦ
//--------------------------------------------------------------------------
