
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверкаПароля();
	
КонецПроцедуры


&НаКлиенте
Процедура ПроверкаПароля()
	
	ТекПароль = КонстантыПарольДляУстановкиКоличестваАктивныхПользователейПолучить();
	Если СтрДлина(ТекПароль)>0 Тогда
		Если (ОткрытьФормуМодально("ОбщаяФорма.ФормаПароля")=ТекПароль) Тогда
			Элементы.КоличествоАктивныхПользователей.ТолькоПросмотр = ЛОЖЬ;
			Элементы.ПарольДляУстановкиКоличестваАктивныхПользователей.ТолькоПросмотр = ЛОЖЬ;
		Иначе
			Элементы.КоличествоАктивныхПользователей.ТолькоПросмотр = ИСТИНА;
			Элементы.ПарольДляУстановкиКоличестваАктивныхПользователей.ТолькоПросмотр = ИСТИНА;
		КонецЕсли;
	Иначе
		Элементы.КоличествоАктивныхПользователей.ТолькоПросмотр = ЛОЖЬ;
		Элементы.ПарольДляУстановкиКоличестваАктивныхПользователей.ТолькоПросмотр = ЛОЖЬ;
	КонецЕсли;
	
КонецПроцедуры // ()


&НаСервере
Функция КонстантыПарольДляУстановкиКоличестваАктивныхПользователейПолучить()

	Возврат Константы.ПарольДляУстановкиКоличестваАктивныхПользователей.Получить();

КонецФункции // ()


&НаКлиенте
Процедура ВвестиПароль(Команда)
	
	ПроверкаПароля();
	
КонецПроцедуры




