#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	// УНФ
	Если Не УправлениеНебольшойФирмойУправлениеДоступомПовтИсп.ЭтоПолноправныйПользователь() Тогда
		
		ТекстИсключения = НСтр("ka='მოცემული გამართვა ხელმისაწვდომია მხოლოდ პროგრამის ადმინისტრატორისთვის!';ru='Данная настройка доступна только для администратора программы!'");
		ВызватьИсключение ТекстИсключения;
		Возврат;
		
	КонецЕсли;
	// Конец УНФ
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента();
	
	Если ПараметрыРаботыКлиента.УпрощенныйИнтерфейсНастройкиПравДоступа Тогда
		ИмяФормы = "ОбщаяФорма.ПраваДоступаУпрощенно";
	Иначе
		ИмяФормы = "ОбщаяФорма.ПраваДоступа";
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Пользователь", ПараметрКоманды);
	
	ОткрытьФорму(
		ИмяФормы,
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
