
&НаКлиенте
Процедура Команда1(Команда)
	
АктивироватьХарактеристики() ;

КонецПроцедуры

&НаСервере
Процедура АктивироватьХарактеристики()	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
		|	ХарактеристикиНоменклатуры.ИспользуетсяВдокументах КАК ИспользуетсяВдокументах
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		СпОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СпОбъект.ИспользуетсяВдокументах = Истина ;
		СпОбъект.записать() ;
	КонецЦикла;
	
КонецПроцедуры