&НаСервере
Процедура ПроцентУсушкиПриИзмененииНаСервере()
	
	ТекущийПроцентУсушки = Объект.ПроцентУсушки;
	
	Если Справочники.Потери.ПроцентУсушкиУжеСуществует(ТекущийПроцентУсушки) ИЛИ ТекущийПроцентУсушки = 0 Тогда
	
		ТекстСообщения = НСтр("ka='შრობის პროცენტი არ არის არჩეული. აირჩიეთ შრობის პროცენტი.';ru='Неправильно выбран процент усушки. Возможно значение процента усушки повторяется.';en='შრობის პროცენტი არ არის არჩეული. აირჩიეთ შრობის პროცენტი.'");
		
		РеквизитПроверки = "ПроцентУсушки";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,Объект.Ссылка,РеквизитПроверки,"Объект",ИСТИНА);
		
		Объект.ПроцентУсушки = 0;
		Возврат;
	
	КонецЕсли;
	
	Объект.Наименование = "" + ТекущийПроцентУсушки + " %";
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентУсушкиПриИзменении(Элемент)
	ПроцентУсушкиПриИзмененииНаСервере();
КонецПроцедуры
