#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаАмортизацияВА, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Период",		   СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",   СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("НачалоГода",	   НачалоГода(СтруктураДополнительныеСвойства.ДляПроведения.Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(СтруктураДополнительныеСвойства.ДляПроведения.Дата));
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(СтруктураДополнительныеСвойства.ДляПроведения.Дата));
	Запрос.УстановитьПараметр("Сообщение1",	   НСтр("ka='ამორტიზაცია ამ თვეს უკვე დაირიცხა!';ru='амортизация в этом месяце уже начислялась!';en='amortization of this month already accrued!'"));
	Запрос.УстановитьПараметр("Сообщение2",	   НСтр("ka='ამორტიზაციის დარიცხვის მეთოდი არ არის მითითებული!';ru='не указан способ начисления амортизации!';en='Unknown method of calculating depreciation!'"));
	Запрос.УстановитьПараметр("Сообщение3",	   НСтр("ka='ღირებულება არის 0-ის ტოლი!';ru='стоимость равна 0!';en='value is equal to 0!'"));
	Запрос.УстановитьПараметр("Сообщение4",	   НСтр("ka='გამოყენების ვადა ტოლია 0-ის!';ru='срок использования равен 0!';en='term use is 0!'"));
	Запрос.УстановитьПараметр("Сообщение5",	   НСтр("ka='სამუშაოების პროდუქციის მოცულობა ამორტიზაციის გამოსათვლელად შეუვსებელია!';ru='объем продукции работ для вычисления амортизации не заполнен!';en='volume production work for calculating depreciation is not filled!'"));
	Запрос.УстановитьПараметр("Сообщение6",	   НСтр("ka='თავდაპირველი ღირებულება ტოლია 0!';ru='первоначальная стоимость равна 0!';en='the initial value is equal to 0!'"));
	
	//ПодольскийАИ #УчетПроектов 10.12.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 10.12.2020 }
	
	// Установка исключительной блокировки контролируемых остатков денежных средств.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВнеоборотныеАктивы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Организация");
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВыработкаВнеоборотныхАктивов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Организация");
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПараметрыВнеоборотныхАктивов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Организация");
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияВнеоборотныхАктивов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Организация");
	

	//ПодольскийАИ #УчетПроектов 10.12.2020 {
	Если СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам Тогда
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УчетПоПроектамВнеоборотныхАктивов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Организация");
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 10.12.2020 }
	
	Блокировка.Заблокировать();
	
	//Паганини#NexiaGeoLatex_
	НачислятьАмортизациюОтНачальнойСтоимости = РегистрыСведений.УчетнаяПолитикаРегл.ПолучитьПоследнее(ДокументСсылкаАмортизацияВА.Дата, Новый Структура("Организация", ДокументСсылкаАмортизацияВА.Организация)).НачислятьАмортизациюОтНачальнойСтоимости;
	Если НЕ НачислятьАмортизациюОтНачальнойСтоимости Тогда
	//_Паганини#NexiaGeoLatex	
	Запрос.Текст =
	//+++ Дмгг
	//"ВЫБРАТЬ
	//|	СписокАмортизируемыхВА.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	//|	ПРЕДСТАВЛЕНИЕ(СписокАмортизируемыхВА.ВнеоборотныйАктив) КАК ВнеоборотныйАктивПредставление,
	//|	СписокАмортизируемыхВА.ВнеоборотныйАктив.Код КАК Код,
	//|	СписокАмортизируемыхВА.НачалоНачислятьАмортизацию КАК НачалоНачислятьАмортизацию,
	//|	СписокАмортизируемыхВА.КонецНачислятьАмортизацию КАК КонецНачислятьАмортизацию,
	//|	СписокАмортизируемыхВА.КонецНачислятьВТекущемМесяце КАК КонецНачислятьВТекущемМесяце,
	//|	ЕСТЬNULL(СтоимостьВА.АмортизацияКонечныйОстаток, 0) КАК АмортизацияКонечныйОстаток,
	//|	ЕСТЬNULL(СтоимостьВА.АмортизацияОборот, 0) КАК АмортизацияОборот,
	//|	ЕСТЬNULL(СтоимостьВА.СтоимостьКонечныйОстаток, 0) КАК БалансоваяСтоимость,
	//|	ЕСТЬNULL(СтоимостьВА.СтоимостьНачальныйОстаток, 0) КАК СтоимостьНачальныйОстаток,
	//|	ЕСТЬNULL(АмортизацияОстаткиИОбороты.СтоимостьНачальныйОстаток, 0) - ЕСТЬNULL(АмортизацияОстаткиИОбороты.АмортизацияНачальныйОстаток, 0) КАК СтоимостьНаНачалоГода,
	//|	ЕСТЬNULL(СписокАмортизируемыхВА.ВнеоборотныйАктив.СпособАмортизации, 0) КАК СпособНачисленияАмортизации,
	//|	ЕСТЬNULL(СписокАмортизируемыхВА.ВнеоборотныйАктив.НачальнаяСтоимость, 0) КАК ПервоначальнаяСтоимость,
	//|	ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце, 0) КАК ПрименитьВТекущемМесяце,
	//|	ПараметрыАмортизацииСрезПоследних.Период КАК Период,
	////+++ Дмгг
	////|	ВЫБОР
	////|		КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	////|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.СрокИспользованияДляВычисленияАмортизации, 0)
	////|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.СрокИспользованияДляВычисленияАмортизации, 0)
	////|	КОНЕЦ КАК СрокИспользованияДляВычисленияАмортизации,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(РАЗНОСТЬДАТ(СписокАмортизируемыхВА.ДатаВзятиНаБаланс, &КонецПериода, МЕСЯЦ), 0) = 0
	//|			ТОГДА ВЫБОР
	//|					КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	//|						ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.СрокИспользованияДляВычисленияАмортизации, 0)
	//|					ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.СрокИспользованияДляВычисленияАмортизации, 0)
	//|				КОНЕЦ
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	//|					ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.СрокИспользованияДляВычисленияАмортизации, 0) - РАЗНОСТЬДАТ(СписокАмортизируемыхВА.ДатаВзятиНаБаланс, &КонецПериода, МЕСЯЦ)
	//|				ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.СрокИспользованияДляВычисленияАмортизации, 0) - РАЗНОСТЬДАТ(СписокАмортизируемыхВА.ДатаВзятиНаБаланс, &КонецПериода, МЕСЯЦ)
	//|			КОНЕЦ
	//|	КОНЕЦ КАК СрокИспользованияДляВычисленияАмортизации,
	////--- Дмгг
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(СписокАмортизируемыхВА.ВнеоборотныйАктив.СпособАмортизации, 0) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка)
	//|				И ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	//|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации, 0) - ЕСТЬNULL(СтоимостьВА.АмортизацияКонечныйОстаток, 0)
	//|		КОГДА ЕСТЬNULL(СписокАмортизируемыхВА.ВнеоборотныйАктив.СпособАмортизации, 0) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка)
	//|				И НЕ ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	//|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.СтоимостьДляВычисленияАмортизации, 0) - ЕСТЬNULL(СтоимостьВА.АмортизацияКонечныйОстаток, 0)
	//|		КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	//|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации, 0)
	//|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.СтоимостьДляВычисленияАмортизации, 0)
	//|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	//|	ЕСТЬNULL(ИзменениеПризнакаАмортизации.ИзменениеНачислАморт, ЛОЖЬ) КАК ИзменениеНачислАморт,
	//|	ЕСТЬNULL(ИзменениеПризнакаАмортизации.НачислятьВТекМесяце, ЛОЖЬ) КАК НачислятьВТекМесяце,
	//|	ЕСТЬNULL(ВыработкаВнеоборотногоАктиваОбороты.КоличествоОборот, 0) КАК ОбъемВыработки,
	//|	ВЫБОР
	//|		КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	//|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации, 0)
	//|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.ОбъемПродукцииРаботДляВычисленияАмортизации, 0)
	//|	КОНЕЦ КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	//|	ВЫБОР
	//|		КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	//|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.ГодовойПроцентАмортизацииДляУменьшенногоОстатка, 0)
	//|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.ГодовойПроцентАмортизацииДляУменьшенногоОстатка, 0)
	//|	КОНЕЦ КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	//|	ВЫБОР
	//|		КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	//|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка, 0)
	//|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка, 0)
	//|	КОНЕЦ КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка
	//|ПОМЕСТИТЬ ВременнаяТаблицаДляРасчетаАмортизации
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		СрезПервых.НачислятьАмортизацию КАК НачалоНачислятьАмортизацию,
	//|		СрезПоследних.НачислятьАмортизацию КАК КонецНачислятьАмортизацию,
	//|		СрезПоследних.НачислятьАмортизациюВТекущемМесяце КАК КонецНачислятьВТекущемМесяце,
	//|		СрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктив
	//|		,СрезПервых.Период КАК ДатаВзятиНаБаланс //+++ Дмгг
	//|	ИЗ
	//|		(ВЫБРАТЬ
	//|			СостояниеВнеоборотногоАктиваСрезПервых.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	//|			СостояниеВнеоборотногоАктиваСрезПервых.НачислятьАмортизацию КАК НачислятьАмортизацию,
	//|			СостояниеВнеоборотногоАктиваСрезПервых.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяце,
	//|			СостояниеВнеоборотногоАктиваСрезПервых.Период КАК Период
	//|		ИЗ
	//|			РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК СостояниеВнеоборотногоАктиваСрезПервых) КАК СрезПервых
	//|			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|				СостояниеВнеоборотногоАктиваСрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	//|				СостояниеВнеоборотногоАктиваСрезПоследних.НачислятьАмортизацию КАК НачислятьАмортизацию,
	//|				СостояниеВнеоборотногоАктиваСрезПоследних.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяце,
	//|				СостояниеВнеоборотногоАктиваСрезПоследних.Период КАК Период
	//|			ИЗ
	//|				РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СостояниеВнеоборотногоАктиваСрезПоследних) КАК СрезПоследних
	//|			ПО СрезПервых.ВнеоборотныйАктив = СрезПоследних.ВнеоборотныйАктив) КАК СписокАмортизируемыхВА
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВнеоборотныеАктивы.ОстаткиИОбороты(&НачалоГода, , , , Организация = &Организация) КАК АмортизацияОстаткиИОбороты
	//|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = АмортизацияОстаткиИОбороты.ВнеоборотныйАктив
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВнеоборотныеАктивы.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация = &Организация) КАК СтоимостьВА
	//|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = СтоимостьВА.ВнеоборотныйАктив
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&КонецПериода, Организация = &Организация) КАК ПараметрыАмортизацииСрезПоследних
	//|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК ПараметрыАмортизацииСрезПоследнихНачалоМесяца
	//|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = ПараметрыАмортизацииСрезПоследнихНачалоМесяца.ВнеоборотныйАктив
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИСТИНА) КАК ИзменениеНачислАморт,
	//|			СостояниеВнеоборотногоАктива.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	//|			СостояниеВнеоборотногоАктиваСрезПоследних.НачислятьАмортизациюВТекущемМесяце КАК НачислятьВТекМесяце
	//|		ИЗ
	//|			РегистрСведений.СостоянияВнеоборотныхАктивов КАК СостояниеВнеоборотногоАктива
	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СостояниеВнеоборотногоАктиваСрезПоследних
	//|				ПО СостояниеВнеоборотногоАктива.ВнеоборотныйАктив = СостояниеВнеоборотногоАктиваСрезПоследних.ВнеоборотныйАктив
	//|		ГДЕ
	//|			СостояниеВнеоборотногоАктива.Период МЕЖДУ &НачалоПериода И &КонецПериода
	//|			И СостояниеВнеоборотногоАктива.Организация = &Организация
	//|		
	//|		СГРУППИРОВАТЬ ПО
	//|			СостояниеВнеоборотногоАктива.ВнеоборотныйАктив,
	//|			СостояниеВнеоборотногоАктиваСрезПоследних.НачислятьАмортизациюВТекущемМесяце) КАК ИзменениеПризнакаАмортизации
	//|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = ИзменениеПризнакаАмортизации.ВнеоборотныйАктив
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыработкаВнеоборотныхАктивов.Обороты(&НачалоПериода, &КонецПериода, , Организация = &Организация) КАК ВыработкаВнеоборотногоАктиваОбороты
	//|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = ВыработкаВнеоборотногоАктиваОбороты.ВнеоборотныйАктив
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	&Организация КАК Организация,
	//|	&Период КАК Период,
	//|	Таблица.Продолжить КАК Продолжить,
	//|	Таблица.СообщениеОбОшибкеНачисленияАмортизации КАК СообщениеОбОшибкеНачисленияАмортизации,
	//|	Таблица.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	//|	Таблица.ВнеоборотныйАктивПредставление КАК ВнеоборотныйАктивПредставление,
	//|	Таблица.Код КАК Код,
	//|	Таблица.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	//|	Таблица.БалансоваяСтоимость КАК БалансоваяСтоимость,
	//|	Таблица.ВсегоОсталосьСписать КАК ВсегоОсталосьСписать,
	//|	0 КАК Стоимость,
	//|	ВЫБОР
	//|		КОГДА ВЫБОР
	//|				КОГДА Таблица.СуммаАмортизации < Таблица.ВсегоОсталосьСписать
	//|					ТОГДА Таблица.СуммаАмортизации
	//|				ИНАЧЕ Таблица.ВсегоОсталосьСписать
	//|			КОНЕЦ > 0
	//|			ТОГДА ВЫБОР
	//|					КОГДА Таблица.СуммаАмортизации < Таблица.ВсегоОсталосьСписать
	//|						ТОГДА Таблица.СуммаАмортизации
	//|					ИНАЧЕ Таблица.ВсегоОсталосьСписать
	//|				КОНЕЦ
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК Амортизация
	//|ПОМЕСТИТЬ ТаблицаРасчетаАмортизации
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ВЫБОР
	//|			КОГДА Таблица.ИзменениеНачислАморт <> ЛОЖЬ
	//|						И Таблица.НачислятьВТекМесяце = ЛОЖЬ
	//|					ИЛИ Таблица.КонецНачислятьАмортизацию = ЛОЖЬ
	//|					ИЛИ Таблица.КонецНачислятьВТекущемМесяце = ЛОЖЬ
	//|						И Таблица.НачалоНачислятьАмортизацию = ЛОЖЬ
	//|				ТОГДА ЛОЖЬ
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ КАК Продолжить,
	//|		ВЫБОР
	//|			КОГДА Таблица.АмортизацияОборот <> 0
	//|				ТОГДА &Сообщение1
	//|			КОГДА Таблица.СпособНачисленияАмортизации = 0
	//|				ТОГДА &Сообщение2
	//|			КОГДА Таблица.СтоимостьДляВычисленияАмортизации = 0
	//|				ТОГДА &Сообщение3
	//|			КОГДА Таблица.СрокИспользованияДляВычисленияАмортизации = 0
	//|					И Таблица.СпособНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.ПропорциональноОбъемуПродукции)
	//|					И Таблица.СпособНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка)
	//|				ТОГДА &Сообщение4
	//|			КОГДА Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.ПропорциональноОбъемуПродукции)
	//|					И Таблица.ОбъемПродукцииРаботДляВычисленияАмортизации = 0
	//|				ТОГДА &Сообщение5
	//|			КОГДА Таблица.ПервоначальнаяСтоимость = 0
	//|				ТОГДА &Сообщение6
	//|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|		КОНЕЦ КАК СообщениеОбОшибкеНачисленияАмортизации,
	//|		ВЫБОР
	//|			КОГДА Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.Линейный)
	////+++ Дмгг
	////|				ТОГДА Таблица.СтоимостьДляВычисленияАмортизации / ВЫБОР
	//|				ТОГДА (Таблица.СтоимостьДляВычисленияАмортизации - Таблица.АмортизацияКонечныйОстаток) / ВЫБОР
	////--- Дмгг
	//|						КОГДА Таблица.СрокИспользованияДляВычисленияАмортизации = 0
	//|							ТОГДА 1
	//|						ИНАЧЕ Таблица.СрокИспользованияДляВычисленияАмортизации
	//|					КОНЕЦ
	//|			КОГДА Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.ПропорциональноОбъемуПродукции)
	//|				ТОГДА Таблица.СтоимостьДляВычисленияАмортизации * Таблица.ОбъемВыработки / ВЫБОР
	//|						КОГДА Таблица.ОбъемПродукцииРаботДляВычисленияАмортизации = 0
	//|							ТОГДА 1
	//|						ИНАЧЕ Таблица.ОбъемПродукцииРаботДляВычисленияАмортизации
	//|					КОНЕЦ
	//|			КОГДА Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка)
	//|				ТОГДА ВЫБОР
	//|						КОГДА Таблица.СтоимостьДляВычисленияАмортизации - Таблица.СтоимостьДляВычисленияАмортизации * (Таблица.ГодовойПроцентАмортизацииДляУменьшенногоОстатка / 12 / 100) > Таблица.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка
	//|							ТОГДА Таблица.СтоимостьДляВычисленияАмортизации * (Таблица.ГодовойПроцентАмортизацииДляУменьшенногоОстатка / 12 / 100)
	//|						ИНАЧЕ Таблица.СтоимостьДляВычисленияАмортизации - Таблица.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка
	//|					КОНЕЦ
	//|			ИНАЧЕ 0
	//|		КОНЕЦ КАК СуммаАмортизации,
	//|		Таблица.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	//|		Таблица.ВнеоборотныйАктивПредставление КАК ВнеоборотныйАктивПредставление,
	//|		Таблица.Код КАК Код,
	//|		Таблица.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	//|		Таблица.БалансоваяСтоимость КАК БалансоваяСтоимость,
	//|		Таблица.БалансоваяСтоимость - Таблица.АмортизацияКонечныйОстаток КАК ВсегоОсталосьСписать
	//|	ИЗ
	//|		ВременнаяТаблицаДляРасчетаАмортизации КАК Таблица) КАК Таблица
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|УНИЧТОЖИТЬ ВременнаяТаблицаДляРасчетаАмортизации";
	"ВЫБРАТЬ
	|	СписокАмортизируемыхВА.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ПРЕДСТАВЛЕНИЕ(СписокАмортизируемыхВА.ВнеоборотныйАктив) КАК ВнеоборотныйАктивПредставление,
	|	СписокАмортизируемыхВА.ВнеоборотныйАктив.Код КАК Код,
	|	СписокАмортизируемыхВА.НачалоНачислятьАмортизацию КАК НачалоНачислятьАмортизацию,
	|	СписокАмортизируемыхВА.КонецНачислятьАмортизацию КАК КонецНачислятьАмортизацию,
	|	СписокАмортизируемыхВА.КонецНачислятьВТекущемМесяце КАК КонецНачислятьВТекущемМесяце,
	|	ЕСТЬNULL(СтоимостьВА.АмортизацияКонечныйОстаток, 0) КАК АмортизацияКонечныйОстаток,
	|	ЕСТЬNULL(СтоимостьВА.АмортизацияОборот, 0) КАК АмортизацияОборот,
	|	ЕСТЬNULL(СтоимостьВА.СтоимостьКонечныйОстаток, 0) КАК БалансоваяСтоимость,
	|	ЕСТЬNULL(СтоимостьВА.СтоимостьНачальныйОстаток, 0) КАК СтоимостьНачальныйОстаток,
	|	ЕСТЬNULL(АмортизацияОстаткиИОбороты.СтоимостьНачальныйОстаток, 0) - ЕСТЬNULL(АмортизацияОстаткиИОбороты.АмортизацияНачальныйОстаток, 0) КАК СтоимостьНаНачалоГода,
	|	ЕСТЬNULL(СписокАмортизируемыхВА.ВнеоборотныйАктив.СпособАмортизации, 0) КАК СпособНачисленияАмортизации,
	|	ЕСТЬNULL(СписокАмортизируемыхВА.ВнеоборотныйАктив.НачальнаяСтоимость, 0) КАК ПервоначальнаяСтоимость,
	|	ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце, 0) КАК ПрименитьВТекущемМесяце,
	|	ПараметрыАмортизацииСрезПоследних.Период КАК Период,
	|	ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.СрокИспользованияДляВычисленияАмортизации, 0) - ЕСТЬNULL(СтоимостьВА.КоличествоМесяцеВЭксплуатацииКонечныйОстаток, 0) КАК СрокИспользованияДляВычисленияАмортизации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СписокАмортизируемыхВА.ВнеоборотныйАктив.СпособАмортизации, 0) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка)
	|				И ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации, 0) - ЕСТЬNULL(СтоимостьВА.АмортизацияКонечныйОстаток, 0)
	|		КОГДА ЕСТЬNULL(СписокАмортизируемыхВА.ВнеоборотныйАктив.СпособАмортизации, 0) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка)
	|				И НЕ ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.СтоимостьДляВычисленияАмортизации, 0) - ЕСТЬNULL(СтоимостьВА.АмортизацияКонечныйОстаток, 0)
	|		КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.СтоимостьДляВычисленияАмортизации, 0)
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|	ЕСТЬNULL(ИзменениеПризнакаАмортизации.ИзменениеНачислАморт, ЛОЖЬ) КАК ИзменениеНачислАморт,
	|	ЕСТЬNULL(ИзменениеПризнакаАмортизации.НачислятьВТекМесяце, ЛОЖЬ) КАК НачислятьВТекМесяце,
	|	ЕСТЬNULL(ВыработкаВнеоборотногоАктиваОбороты.КоличествоОборот, 0) КАК ОбъемВыработки,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.ОбъемПродукцииРаботДляВычисленияАмортизации, 0)
	|	КОНЕЦ КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.ГодовойПроцентАмортизацииДляУменьшенногоОстатка, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.ГодовойПроцентАмортизацииДляУменьшенногоОстатка, 0)
	|	КОНЕЦ КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка, 0)
	|	КОНЕЦ КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка,
	|	СписокАмортизируемыхВА.Регистратор КАК РегистраторВвобаВЭксплуатацию
	|ПОМЕСТИТЬ ВременнаяТаблицаДляРасчетаАмортизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		СрезПервых.НачислятьАмортизацию КАК НачалоНачислятьАмортизацию,
	|		СрезПоследних.НачислятьАмортизацию КАК КонецНачислятьАмортизацию,
	|		СрезПоследних.НачислятьАмортизациюВТекущемМесяце КАК КонецНачислятьВТекущемМесяце,
	|		СрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|		СрезПервых.Период КАК ДатаВзятиНаБаланс,
	|		СрезПервых.ВнеоборотныйАктив КАК ВнеоборотныйАктив1,
	|		СрезПервых.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|		СрезПервых.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяце,
	|		СрезПервых.Период КАК Период,
	|		ЕСТЬNULL(СрезПервых.Регистратор, СрезПоследних.Регистратор) КАК Регистратор
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СостояниеВнеоборотногоАктиваСрезПервых.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|			СостояниеВнеоборотногоАктиваСрезПервых.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|			СостояниеВнеоборотногоАктиваСрезПервых.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяце,
	|			СостояниеВнеоборотногоАктиваСрезПервых.Период КАК Период,
	|			СостояниеВнеоборотногоАктиваСрезПервых.Регистратор КАК Регистратор
	|		ИЗ
	|			РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК СостояниеВнеоборотногоАктиваСрезПервых) КАК СрезПервых
	|			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				СостояниеВнеоборотногоАктиваСрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|				СостояниеВнеоборотногоАктиваСрезПоследних.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|				СостояниеВнеоборотногоАктиваСрезПоследних.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяце,
	|				СостояниеВнеоборотногоАктиваСрезПоследних.Период КАК Период,
	|				СостояниеВнеоборотногоАктиваСрезПоследних.Регистратор КАК Регистратор
	|			ИЗ
	|				РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СостояниеВнеоборотногоАктиваСрезПоследних) КАК СрезПоследних
	|			ПО СрезПервых.ВнеоборотныйАктив = СрезПоследних.ВнеоборотныйАктив) КАК СписокАмортизируемыхВА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВнеоборотныеАктивы.ОстаткиИОбороты(&НачалоГода, , , , Организация = &Организация) КАК АмортизацияОстаткиИОбороты
	|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = АмортизацияОстаткиИОбороты.ВнеоборотныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВнеоборотныеАктивы.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация = &Организация) КАК СтоимостьВА
	|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = СтоимостьВА.ВнеоборотныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&КонецПериода, Организация = &Организация) КАК ПараметрыАмортизацииСрезПоследних
	|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК ПараметрыАмортизацииСрезПоследнихНачалоМесяца
	|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = ПараметрыАмортизацииСрезПоследнихНачалоМесяца.ВнеоборотныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИСТИНА) КАК ИзменениеНачислАморт,
	|			СостояниеВнеоборотногоАктива.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|			СостояниеВнеоборотногоАктиваСрезПоследних.НачислятьАмортизациюВТекущемМесяце КАК НачислятьВТекМесяце
	|		ИЗ
	|			РегистрСведений.СостоянияВнеоборотныхАктивов КАК СостояниеВнеоборотногоАктива
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СостояниеВнеоборотногоАктиваСрезПоследних
	|				ПО СостояниеВнеоборотногоАктива.ВнеоборотныйАктив = СостояниеВнеоборотногоАктиваСрезПоследних.ВнеоборотныйАктив
	|		ГДЕ
	|			СостояниеВнеоборотногоАктива.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|			И СостояниеВнеоборотногоАктива.Организация = &Организация
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СостояниеВнеоборотногоАктива.ВнеоборотныйАктив,
	|			СостояниеВнеоборотногоАктиваСрезПоследних.НачислятьАмортизациюВТекущемМесяце) КАК ИзменениеПризнакаАмортизации
	|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = ИзменениеПризнакаАмортизации.ВнеоборотныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыработкаВнеоборотныхАктивов.Обороты(&НачалоПериода, &КонецПериода, , Организация = &Организация) КАК ВыработкаВнеоборотногоАктиваОбороты
	|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = ВыработкаВнеоборотногоАктиваОбороты.ВнеоборотныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Период КАК Период,
	|	Таблица.Продолжить КАК Продолжить,
	|	Таблица.СообщениеОбОшибкеНачисленияАмортизации КАК СообщениеОбОшибкеНачисленияАмортизации,
	|	Таблица.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	Таблица.ВнеоборотныйАктивПредставление КАК ВнеоборотныйАктивПредставление,
	|	Таблица.Код КАК Код,
	|	Таблица.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|	Таблица.БалансоваяСтоимость КАК БалансоваяСтоимость,
	|	Таблица.ВсегоОсталосьСписать КАК ВсегоОсталосьСписать,
	|	0 КАК Стоимость,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА Таблица.СуммаАмортизации < Таблица.ВсегоОсталосьСписать
	|					ТОГДА Таблица.СуммаАмортизации
	|				ИНАЧЕ Таблица.ВсегоОсталосьСписать
	|			КОНЕЦ > 0
	|			ТОГДА ВЫБОР
	|					КОГДА Таблица.СуммаАмортизации < Таблица.ВсегоОсталосьСписать
	|						ТОГДА Таблица.СуммаАмортизации
	|					ИНАЧЕ Таблица.ВсегоОсталосьСписать
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Амортизация,
	//ПодольскийАИ #УчетПроектов 10.12.2020 {
	|	Значение(Справочник.Проекты.БезПроекта) КАК Проект
	//ПодольскийАИ #УчетПроектов 10.12.2020 }
	|ПОМЕСТИТЬ ТаблицаРасчетаАмортизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА Таблица.ИзменениеНачислАморт <> ЛОЖЬ
	|						И Таблица.НачислятьВТекМесяце = ЛОЖЬ
	|					ИЛИ Таблица.КонецНачислятьАмортизацию = ЛОЖЬ
	|					ИЛИ Таблица.КонецНачислятьВТекущемМесяце = ЛОЖЬ
	|						И Таблица.НачалоНачислятьАмортизацию = ЛОЖЬ
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК Продолжить,
	|		ВЫБОР
	|			КОГДА Таблица.АмортизацияОборот <> 0
	|				ТОГДА &Сообщение1
	|			КОГДА Таблица.СпособНачисленияАмортизации = 0
	|				ТОГДА &Сообщение2
	|			КОГДА Таблица.СтоимостьДляВычисленияАмортизации = 0
	|				ТОГДА &Сообщение3
	|			КОГДА Таблица.СрокИспользованияДляВычисленияАмортизации = 0
	|					И Таблица.СпособНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.ПропорциональноОбъемуПродукции)
	|					И Таблица.СпособНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка)
	|					И Таблица.СпособНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.Линейный)
	|				ТОГДА &Сообщение4
	|			КОГДА Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.ПропорциональноОбъемуПродукции)
	|					И Таблица.ОбъемПродукцииРаботДляВычисленияАмортизации = 0
	|				ТОГДА &Сообщение5
	|			КОГДА Таблица.ПервоначальнаяСтоимость = 0
	|				ТОГДА &Сообщение6
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК СообщениеОбОшибкеНачисленияАмортизации,
	|		ВЫБОР
	|			КОГДА Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.Линейный)
	|					И НЕ Таблица.РегистраторВвобаВЭксплуатацию ССЫЛКА Документ.ВводНачальныхОстатков
	|				ТОГДА (Таблица.СтоимостьДляВычисленияАмортизации - Таблица.АмортизацияКонечныйОстаток) / ВЫБОР
	|						КОГДА Таблица.СрокИспользованияДляВычисленияАмортизации = 0
	|							ТОГДА 1
	|						ИНАЧЕ Таблица.СрокИспользованияДляВычисленияАмортизации
	|					КОНЕЦ
	|			КОГДА Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.Линейный)
	|					И Таблица.РегистраторВвобаВЭксплуатацию ССЫЛКА Документ.ВводНачальныхОстатков
	|				ТОГДА (Таблица.СтоимостьДляВычисленияАмортизации - Таблица.АмортизацияКонечныйОстаток) / ВЫБОР
	|						КОГДА Таблица.СрокИспользованияДляВычисленияАмортизации = 0
	|							ТОГДА 1
	|						ИНАЧЕ Таблица.СрокИспользованияДляВычисленияАмортизации
	|					КОНЕЦ
	|			КОГДА Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.ПропорциональноОбъемуПродукции)
	|				ТОГДА Таблица.СтоимостьДляВычисленияАмортизации * Таблица.ОбъемВыработки / ВЫБОР
	|						КОГДА Таблица.ОбъемПродукцииРаботДляВычисленияАмортизации = 0
	|							ТОГДА 1
	|						ИНАЧЕ Таблица.ОбъемПродукцииРаботДляВычисленияАмортизации
	|					КОНЕЦ
	|			КОГДА Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка)
	|				ТОГДА ВЫБОР
	|						КОГДА Таблица.СтоимостьДляВычисленияАмортизации - Таблица.СтоимостьДляВычисленияАмортизации * (Таблица.ГодовойПроцентАмортизацииДляУменьшенногоОстатка / 12 / 100) > Таблица.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка
	|							ТОГДА Таблица.СтоимостьДляВычисленияАмортизации * (Таблица.ГодовойПроцентАмортизацииДляУменьшенногоОстатка / 12 / 100)
	|						ИНАЧЕ Таблица.СтоимостьДляВычисленияАмортизации - Таблица.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаАмортизации,
	|		Таблица.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|		Таблица.ВнеоборотныйАктивПредставление КАК ВнеоборотныйАктивПредставление,
	|		Таблица.Код КАК Код,
	|		Таблица.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|		Таблица.БалансоваяСтоимость КАК БалансоваяСтоимость,
	|		Таблица.БалансоваяСтоимость - Таблица.АмортизацияКонечныйОстаток КАК ВсегоОсталосьСписать
	|	ИЗ
	|		ВременнаяТаблицаДляРасчетаАмортизации КАК Таблица) КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВременнаяТаблицаДляРасчетаАмортизации";
	//--- Дмгг
//Паганини#NexiaGeoLatex_
Иначе
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокАмортизируемыхВА.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ПРЕДСТАВЛЕНИЕ(СписокАмортизируемыхВА.ВнеоборотныйАктив) КАК ВнеоборотныйАктивПредставление,
	|	СписокАмортизируемыхВА.ВнеоборотныйАктив.Код КАК Код,
	|	СписокАмортизируемыхВА.НачалоНачислятьАмортизацию КАК НачалоНачислятьАмортизацию,
	|	СписокАмортизируемыхВА.КонецНачислятьАмортизацию КАК КонецНачислятьАмортизацию,
	|	СписокАмортизируемыхВА.КонецНачислятьВТекущемМесяце КАК КонецНачислятьВТекущемМесяце,
	|	ЕСТЬNULL(СтоимостьВА.АмортизацияКонечныйОстаток, 0) КАК АмортизацияКонечныйОстаток,
	|	ЕСТЬNULL(СтоимостьВА.АмортизацияОборот, 0) КАК АмортизацияОборот,
	|	ЕСТЬNULL(СтоимостьВА.СтоимостьКонечныйОстаток, 0) КАК БалансоваяСтоимость,
	|	ЕСТЬNULL(СтоимостьВА.СтоимостьНачальныйОстаток, 0) КАК СтоимостьНачальныйОстаток,
	|	ЕСТЬNULL(АмортизацияОстаткиИОбороты.СтоимостьНачальныйОстаток, 0) - ЕСТЬNULL(АмортизацияОстаткиИОбороты.АмортизацияНачальныйОстаток, 0) КАК СтоимостьНаНачалоГода,
	|	ЕСТЬNULL(СписокАмортизируемыхВА.ВнеоборотныйАктив.СпособАмортизации, 0) КАК СпособНачисленияАмортизации,
	|	ЕСТЬNULL(СписокАмортизируемыхВА.ВнеоборотныйАктив.НачальнаяСтоимость, 0) КАК ПервоначальнаяСтоимость,
	|	ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце, 0) КАК ПрименитьВТекущемМесяце,
	|	ПараметрыАмортизацииСрезПоследних.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.СрокИспользованияДляВычисленияАмортизации, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.СрокИспользованияДляВычисленияАмортизации, 0)
	|	КОНЕЦ КАК СрокИспользованияДляВычисленияАмортизации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СписокАмортизируемыхВА.ВнеоборотныйАктив.СпособАмортизации, 0) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка)
	|				И ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации, 0) - ЕСТЬNULL(СтоимостьВА.АмортизацияКонечныйОстаток, 0)
	|		КОГДА ЕСТЬNULL(СписокАмортизируемыхВА.ВнеоборотныйАктив.СпособАмортизации, 0) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка)
	|				И НЕ ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.СтоимостьДляВычисленияАмортизации, 0) - ЕСТЬNULL(СтоимостьВА.АмортизацияКонечныйОстаток, 0)
	|		КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.СтоимостьДляВычисленияАмортизации, 0)
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|	ЕСТЬNULL(ИзменениеПризнакаАмортизации.ИзменениеНачислАморт, ЛОЖЬ) КАК ИзменениеНачислАморт,
	|	ЕСТЬNULL(ИзменениеПризнакаАмортизации.НачислятьВТекМесяце, ЛОЖЬ) КАК НачислятьВТекМесяце,
	|	ЕСТЬNULL(ВыработкаВнеоборотногоАктиваОбороты.КоличествоОборот, 0) КАК ОбъемВыработки,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.ОбъемПродукцииРаботДляВычисленияАмортизации, 0)
	|	КОНЕЦ КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.ГодовойПроцентАмортизацииДляУменьшенногоОстатка, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.ГодовойПроцентАмортизацииДляУменьшенногоОстатка, 0)
	|	КОНЕЦ КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииСрезПоследних.ПрименитьВТекущемМесяце
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииСрезПоследних.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииСрезПоследнихНачалоМесяца.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка, 0)
	|	КОНЕЦ КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка
	|ПОМЕСТИТЬ ВременнаяТаблицаДляРасчетаАмортизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		СрезПервых.НачислятьАмортизацию КАК НачалоНачислятьАмортизацию,
	|		СрезПоследних.НачислятьАмортизацию КАК КонецНачислятьАмортизацию,
	|		СрезПоследних.НачислятьАмортизациюВТекущемМесяце КАК КонецНачислятьВТекущемМесяце,
	|		СрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктив
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СостояниеВнеоборотногоАктиваСрезПервых.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|			СостояниеВнеоборотногоАктиваСрезПервых.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|			СостояниеВнеоборотногоАктиваСрезПервых.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяце,
	|			СостояниеВнеоборотногоАктиваСрезПервых.Период КАК Период
	|		ИЗ
	|			РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК СостояниеВнеоборотногоАктиваСрезПервых) КАК СрезПервых
	|			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				СостояниеВнеоборотногоАктиваСрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|				СостояниеВнеоборотногоАктиваСрезПоследних.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|				СостояниеВнеоборотногоАктиваСрезПоследних.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяце,
	|				СостояниеВнеоборотногоАктиваСрезПоследних.Период КАК Период
	|			ИЗ
	|				РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СостояниеВнеоборотногоАктиваСрезПоследних) КАК СрезПоследних
	|			ПО СрезПервых.ВнеоборотныйАктив = СрезПоследних.ВнеоборотныйАктив) КАК СписокАмортизируемыхВА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВнеоборотныеАктивы.ОстаткиИОбороты(&НачалоГода, , , , Организация = &Организация) КАК АмортизацияОстаткиИОбороты
	|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = АмортизацияОстаткиИОбороты.ВнеоборотныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВнеоборотныеАктивы.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация = &Организация) КАК СтоимостьВА
	|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = СтоимостьВА.ВнеоборотныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&КонецПериода, Организация = &Организация) КАК ПараметрыАмортизацииСрезПоследних
	|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК ПараметрыАмортизацииСрезПоследнихНачалоМесяца
	|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = ПараметрыАмортизацииСрезПоследнихНачалоМесяца.ВнеоборотныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИСТИНА) КАК ИзменениеНачислАморт,
	|			СостояниеВнеоборотногоАктива.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|			СостояниеВнеоборотногоАктиваСрезПоследних.НачислятьАмортизациюВТекущемМесяце КАК НачислятьВТекМесяце
	|		ИЗ
	|			РегистрСведений.СостоянияВнеоборотныхАктивов КАК СостояниеВнеоборотногоАктива
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СостояниеВнеоборотногоАктиваСрезПоследних
	|				ПО СостояниеВнеоборотногоАктива.ВнеоборотныйАктив = СостояниеВнеоборотногоАктиваСрезПоследних.ВнеоборотныйАктив
	|		ГДЕ
	|			СостояниеВнеоборотногоАктива.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|			И СостояниеВнеоборотногоАктива.Организация = &Организация
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СостояниеВнеоборотногоАктива.ВнеоборотныйАктив,
	|			СостояниеВнеоборотногоАктиваСрезПоследних.НачислятьАмортизациюВТекущемМесяце) КАК ИзменениеПризнакаАмортизации
	|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = ИзменениеПризнакаАмортизации.ВнеоборотныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыработкаВнеоборотныхАктивов.Обороты(&НачалоПериода, &КонецПериода, , Организация = &Организация) КАК ВыработкаВнеоборотногоАктиваОбороты
	|		ПО СписокАмортизируемыхВА.ВнеоборотныйАктив = ВыработкаВнеоборотногоАктиваОбороты.ВнеоборотныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Период КАК Период,
	|	Таблица.Продолжить КАК Продолжить,
	|	Таблица.СообщениеОбОшибкеНачисленияАмортизации КАК СообщениеОбОшибкеНачисленияАмортизации,
	|	Таблица.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	Таблица.ВнеоборотныйАктивПредставление КАК ВнеоборотныйАктивПредставление,
	|	Таблица.Код КАК Код,
	|	Таблица.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|	Таблица.БалансоваяСтоимость КАК БалансоваяСтоимость,
	|	Таблица.ВсегоОсталосьСписать КАК ВсегоОсталосьСписать,
	|	0 КАК Стоимость,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА Таблица.СуммаАмортизации < Таблица.ВсегоОсталосьСписать
	|					ТОГДА Таблица.СуммаАмортизации
	|				ИНАЧЕ Таблица.ВсегоОсталосьСписать
	|			КОНЕЦ > 0
	|			ТОГДА ВЫБОР
	|					КОГДА Таблица.СуммаАмортизации < Таблица.ВсегоОсталосьСписать
	|						ТОГДА Таблица.СуммаАмортизации
	|					ИНАЧЕ Таблица.ВсегоОсталосьСписать
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Амортизация,
	//ПодольскийАИ #УчетПроектов 10.12.2020 {
	|	Значение(Справочник.Проекты.БезПроекта) КАК Проект
	//ПодольскийАИ #УчетПроектов 10.12.2020 }
	|ПОМЕСТИТЬ ТаблицаРасчетаАмортизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА Таблица.ИзменениеНачислАморт <> ЛОЖЬ
	|						И Таблица.НачислятьВТекМесяце = ЛОЖЬ
	|					ИЛИ Таблица.КонецНачислятьАмортизацию = ЛОЖЬ
	|					ИЛИ Таблица.КонецНачислятьВТекущемМесяце = ЛОЖЬ
	|						И Таблица.НачалоНачислятьАмортизацию = ЛОЖЬ
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК Продолжить,
	|		ВЫБОР
	|			КОГДА Таблица.АмортизацияОборот <> 0
	|				ТОГДА &Сообщение1
	|			КОГДА Таблица.СпособНачисленияАмортизации = 0
	|				ТОГДА &Сообщение2
	|			КОГДА Таблица.СтоимостьДляВычисленияАмортизации = 0
	|				ТОГДА &Сообщение3
	|			КОГДА Таблица.СрокИспользованияДляВычисленияАмортизации = 0
	|					И Таблица.СпособНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.ПропорциональноОбъемуПродукции)
	|					И Таблица.СпособНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка)
	|				ТОГДА &Сообщение4
	|			КОГДА Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.ПропорциональноОбъемуПродукции)
	|					И Таблица.ОбъемПродукцииРаботДляВычисленияАмортизации = 0
	|				ТОГДА &Сообщение5
	|			КОГДА Таблица.ПервоначальнаяСтоимость = 0
	|				ТОГДА &Сообщение6
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК СообщениеОбОшибкеНачисленияАмортизации,
	|		ВЫБОР
	|			КОГДА Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.Линейный)
	|				ТОГДА Таблица.СтоимостьДляВычисленияАмортизации / ВЫБОР
	|						КОГДА Таблица.СрокИспользованияДляВычисленияАмортизации = 0
	|							ТОГДА 1
	|						ИНАЧЕ Таблица.СрокИспользованияДляВычисленияАмортизации
	|					КОНЕЦ
	|			КОГДА Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.ПропорциональноОбъемуПродукции)
	|				ТОГДА Таблица.СтоимостьДляВычисленияАмортизации * Таблица.ОбъемВыработки / ВЫБОР
	|						КОГДА Таблица.ОбъемПродукцииРаботДляВычисленияАмортизации = 0
	|							ТОГДА 1
	|						ИНАЧЕ Таблица.ОбъемПродукцииРаботДляВычисленияАмортизации
	|					КОНЕЦ
	|			КОГДА Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка)
	|				ТОГДА ВЫБОР
	|						КОГДА Таблица.СтоимостьДляВычисленияАмортизации - Таблица.СтоимостьДляВычисленияАмортизации * (Таблица.ГодовойПроцентАмортизацииДляУменьшенногоОстатка / 12 / 100) > Таблица.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка
	|							ТОГДА Таблица.СтоимостьДляВычисленияАмортизации * (Таблица.ГодовойПроцентАмортизацииДляУменьшенногоОстатка / 12 / 100)
	|						ИНАЧЕ Таблица.СтоимостьДляВычисленияАмортизации - Таблица.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаАмортизации,
	|		Таблица.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|		Таблица.ВнеоборотныйАктивПредставление КАК ВнеоборотныйАктивПредставление,
	|		Таблица.Код КАК Код,
	|		Таблица.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|		Таблица.БалансоваяСтоимость КАК БалансоваяСтоимость,
	|		Таблица.БалансоваяСтоимость - Таблица.АмортизацияКонечныйОстаток КАК ВсегоОсталосьСписать
	|	ИЗ
	|		ВременнаяТаблицаДляРасчетаАмортизации КАК Таблица) КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВременнаяТаблицаДляРасчетаАмортизации";
КонецЕсли;
//_Паганини#NexiaGeoLatex
	
	Запрос.ВыполнитьПакет();
	
	//ПодольскийАИ #УчетПроектов 10.12.2020 {
	Если СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам Тогда
		ИнициализироватьТаблицуПоПроектам(ДокументСсылкаАмортизацияВА, СтруктураДополнительныеСвойства);
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 10.12.2020 }
	
	СформироватьТаблицаВнеоборотныеАктивы(ДокументСсылкаАмортизацияВА, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасы(ДокументСсылкаАмортизацияВА, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаАмортизацияВА, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОшибкиЗакрытияМесяца(ДокументСсылкаАмортизацияВА, СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(ДокументСсылкаАмортизацияВА, СтруктураДополнительныеСвойства);
	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_АмортизацияВА(ДокументСсылкаАмортизацияВА, СтруктураДополнительныеСвойства);
	// Щербакво ---
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ИнициализироватьТаблицуПоПроектам(ДокументСсылкаАмортизацияВА, СтруктураДополнительныеСвойства)
	
	ДнейВпериоде = (КонецДня(КонецМесяца(СтруктураДополнительныеСвойства.ДляПроведения.Дата)) + 1 - НачалоМесяца(СтруктураДополнительныеСвойства.ДляПроведения.Дата)) / 86400;
	Если ДнейВпериоде = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(СтруктураДополнительныеСвойства.ДляПроведения.Дата));
	Запрос.УстановитьПараметр("НачалоПериода", КонецДня(НачалоМесяца(СтруктураДополнительныеСвойства.ДляПроведения.Дата)) + 1);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(КонецМесяца(СтруктураДополнительныеСвойства.ДляПроведения.Дата)) + 1);
	Запрос.УстановитьПараметр("ДнейВпериоде", ДнейВпериоде);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДокумента.Период КАК Период,
	               |	ТаблицаДокумента.Организация КАК Организация,
	               |	ТаблицаДокумента.Продолжить КАК Продолжить,
	               |	ТаблицаДокумента.СообщениеОбОшибкеНачисленияАмортизации КАК СообщениеОбОшибкеНачисленияАмортизации,
	               |	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	               |	ТаблицаДокумента.ВнеоборотныйАктивПредставление КАК ВнеоборотныйАктивПредставление,
	               |	ТаблицаДокумента.Код КАК Код,
	               |	ТаблицаДокумента.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	               |	ТаблицаДокумента.БалансоваяСтоимость КАК БалансоваяСтоимость,
	               |	ТаблицаДокумента.ВсегоОсталосьСписать КАК ВсегоОсталосьСписать,
	               |	ТаблицаДокумента.Стоимость КАК Стоимость,
	               |	ТаблицаДокумента.Амортизация КАК Амортизация,
	               |	ТаблицаДокумента.Проект КАК Проект
	               |ИЗ
	               |	ТаблицаРасчетаАмортизации КАК ТаблицаДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	УчетПоПроектамВнеоборотныхАктивовСрезПоследних.Организация,
	               |	УчетПоПроектамВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив,
	               |	&НачалоМесяца КАК Период,
	               |	УчетПоПроектамВнеоборотныхАктивовСрезПоследних.Проект
	               |ПОМЕСТИТЬ втИзмененияПроектов
	               |ИЗ
	               |	РегистрСведений.УчетПоПроектамВнеоборотныхАктивов.СрезПоследних(
	               |			&НачалоПериода,
	               |			(Организация, ВнеоборотныйАктив) В
	               |				(ВЫБРАТЬ
	               |					Т.Организация,
	               |					Т.ВнеоборотныйАктив
	               |				ИЗ
	               |					ТаблицаРасчетаАмортизации КАК Т)) КАК УчетПоПроектамВнеоборотныхАктивовСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	УчетПоПроектамВнеоборотныхАктивов.Организация,
	               |	УчетПоПроектамВнеоборотныхАктивов.ВнеоборотныйАктив,
	               |	НАЧАЛОПЕРИОДА(УчетПоПроектамВнеоборотныхАктивов.Период, ДЕНЬ),
	               |	УчетПоПроектамВнеоборотныхАктивов.Проект
	               |ИЗ
	               |	РегистрСведений.УчетПоПроектамВнеоборотныхАктивов КАК УчетПоПроектамВнеоборотныхАктивов
	               |ГДЕ
	               |	(УчетПоПроектамВнеоборотныхАктивов.Организация, УчетПоПроектамВнеоборотныхАктивов.ВнеоборотныйАктив) В
	               |			(ВЫБРАТЬ
	               |				Т.Организация,
	               |				Т.ВнеоборотныйАктив
	               |			ИЗ
	               |				ТаблицаРасчетаАмортизации КАК Т)
	               |	И УчетПоПроектамВнеоборотныхАктивов.Период >= &НачалоПериода
	               |	И УчетПоПроектамВнеоборотныхАктивов.Период < &КонецПериода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	УчетПоПроектамВнеоборотныхАктивовСрезПоследних.Организация,
	               |	УчетПоПроектамВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив,
	               |	НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ),
	               |	УчетПоПроектамВнеоборотныхАктивовСрезПоследних.Проект
	               |ИЗ
	               |	РегистрСведений.УчетПоПроектамВнеоборотныхАктивов.СрезПоследних(
	               |			&КонецПериода,
	               |			(Организация, ВнеоборотныйАктив) В
	               |				(ВЫБРАТЬ
	               |					Т.Организация,
	               |					Т.ВнеоборотныйАктив
	               |				ИЗ
	               |					ТаблицаРасчетаАмортизации КАК Т)) КАК УчетПоПроектамВнеоборотныхАктивовСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИзмененияПроектовНачалоДействия.Организация,
	               |	втИзмененияПроектовНачалоДействия.ВнеоборотныйАктив,
	               |	втИзмененияПроектовНачалоДействия.Период КАК Период,
	               |	втИзмененияПроектовНачалоДействия.Проект,
	               |	МИНИМУМ(ЕСТЬNULL(втИзмененияПроектовОкончаниеДействия.Период, &КонецПериода)) КАК ПериодОкончания,
	               |	МИНИМУМ(РАЗНОСТЬДАТ(втИзмененияПроектовНачалоДействия.Период, ЕСТЬNULL(втИзмененияПроектовОкончаниеДействия.Период, &КонецПериода), ДЕНЬ)) КАК КоличествоДней
	               |ПОМЕСТИТЬ втТаблицаПоПроектам
	               |ИЗ
	               |	втИзмененияПроектов КАК втИзмененияПроектовНачалоДействия
	               |		Левое СОЕДИНЕНИЕ втИзмененияПроектов КАК втИзмененияПроектовОкончаниеДействия
	               |		ПО втИзмененияПроектовНачалоДействия.Организация = втИзмененияПроектовОкончаниеДействия.Организация
	               |			И втИзмененияПроектовНачалоДействия.ВнеоборотныйАктив = втИзмененияПроектовОкончаниеДействия.ВнеоборотныйАктив
	               |			И втИзмененияПроектовНачалоДействия.Период < втИзмененияПроектовОкончаниеДействия.Период
	               |ГДЕ
	               |	втИзмененияПроектовНачалоДействия.Период <> ЕСТЬNULL(втИзмененияПроектовОкончаниеДействия.Период, &КонецПериода)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втИзмененияПроектовНачалоДействия.Организация,
	               |	втИзмененияПроектовНачалоДействия.ВнеоборотныйАктив,
	               |	втИзмененияПроектовНачалоДействия.Период,
	               |	втИзмененияПроектовНачалоДействия.Проект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТаблицаАмортизации.Период,
	               |	втТаблицаАмортизации.Организация КАК Организация,
	               |	втТаблицаАмортизации.Продолжить КАК Продолжить,
	               |	втТаблицаАмортизации.СообщениеОбОшибкеНачисленияАмортизации КАК СообщениеОбОшибкеНачисленияАмортизации,
	               |	втТаблицаАмортизации.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	               |	втТаблицаАмортизации.ВнеоборотныйАктивПредставление,
	               |	втТаблицаАмортизации.Код,
	               |	втТаблицаАмортизации.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	               |	втТаблицаАмортизации.БалансоваяСтоимость КАК БалансоваяСтоимость,
	               |	втТаблицаАмортизации.ВсегоОсталосьСписать КАК ВсегоОсталосьСписать,
	               |	втТаблицаАмортизации.Стоимость КАК Стоимость,
	               |	втТаблицаАмортизации.Амортизация КАК Амортизация,
	               |	ЕСТЬNULL(втТаблицаПоПроектам.Проект, ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)) КАК Проект,
	               |	ЕСТЬNULL(втТаблицаПоПроектам.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ПериодНачала,
	               |	ЕСТЬNULL(втТаблицаПоПроектам.ПериодОкончания, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ПериодОкончания,
	               |	ЕСТЬNULL(втТаблицаПоПроектам.КоличествоДней, &ДнейВпериоде) КАК КоличествоДней
	               |ИЗ
	               |	ТаблицаРасчетаАмортизации КАК втТаблицаАмортизации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаПоПроектам КАК втТаблицаПоПроектам
	               |		ПО втТаблицаАмортизации.Организация = втТаблицаПоПроектам.Организация
	               |			И втТаблицаАмортизации.ВнеоборотныйАктив = втТаблицаПоПроектам.ВнеоборотныйАктив
	               |ИТОГИ
	               |	МАКСИМУМ(АмортизацияКонечныйОстаток),
	               |	МАКСИМУМ(БалансоваяСтоимость),
	               |	МАКСИМУМ(ВсегоОсталосьСписать),
	               |	МАКСИМУМ(Стоимость),
	               |	МАКСИМУМ(Амортизация),
	               |	СУММА(КоличествоДней)
	               |ПО
	               |	Организация,
	               |	ВнеоборотныйАктив";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если РезультатЗапроса[3].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаАмортизации = РезультатЗапроса[0].Выгрузить();
	ТаблицаАмортизации.Очистить();
	
	ВыборкаОрганизация = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизация.Следующий() Цикл
		ВыборкаОС = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОС.Следующий() Цикл
			
			СтрокаАмортизации = Неопределено;
			АмортизацияКонечныйОстатокОсталось	= ВыборкаОС.АмортизацияКонечныйОстаток;
			БалансоваяСтоимостьОсталось			= ВыборкаОС.БалансоваяСтоимость;
			ВсегоОсталосьСписатьОсталось		= ВыборкаОС.ВсегоОсталосьСписать;
			СтоимостьОсталось					= ВыборкаОС.Стоимость;
			АмортизацияОсталось					= ВыборкаОС.Амортизация;
			КоличествоДнейОсталось				= ВыборкаОС.КоличествоДней;
			ДнейВПериодеОсталось				= ДнейВпериоде;
			
			ВыборкаДет = ВыборкаОС.Выбрать();
			Пока ВыборкаДет.Следующий() И КоличествоДнейОсталось > 0 Цикл
				
				КоэффПроекта = Окр(ВыборкаДет.КоличествоДней / ДнейВпериоде, 4);
				
				СтрокаАмортизации = ТаблицаАмортизации.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаАмортизации, ВыборкаДет);
				
				Если ВыборкаДет.КоличествоДней = ДнейВПериодеОсталось Тогда
					СтрокаАмортизации.АмортизацияКонечныйОстаток	= АмортизацияКонечныйОстатокОсталось;
					СтрокаАмортизации.БалансоваяСтоимость	= БалансоваяСтоимостьОсталось;
					СтрокаАмортизации.ВсегоОсталосьСписать	= ВсегоОсталосьСписатьОсталось;
					СтрокаАмортизации.Стоимость				= СтоимостьОсталось;
					СтрокаАмортизации.Амортизация			= АмортизацияОсталось;
				Иначе
					СтрокаАмортизации.АмортизацияКонечныйОстаток	= Окр(ВыборкаОС.АмортизацияКонечныйОстаток * КоэффПроекта, 2);
					СтрокаАмортизации.БалансоваяСтоимость	= Окр(ВыборкаОС.БалансоваяСтоимость * КоэффПроекта, 2);
					СтрокаАмортизации.ВсегоОсталосьСписать	= Окр(ВыборкаОС.ВсегоОсталосьСписать * КоэффПроекта, 2);
					СтрокаАмортизации.Стоимость				= Окр(ВыборкаОС.Стоимость * КоэффПроекта, 2);
					СтрокаАмортизации.Амортизация			= Окр(ВыборкаОС.Амортизация * КоэффПроекта, 2);
				КонецЕсли;
				
				АмортизацияКонечныйОстатокОсталось	= АмортизацияКонечныйОстатокОсталось - СтрокаАмортизации.АмортизацияКонечныйОстаток;
				БалансоваяСтоимостьОсталось		= БалансоваяСтоимостьОсталось - СтрокаАмортизации.БалансоваяСтоимость;
				ВсегоОсталосьСписатьОсталось	= ВсегоОсталосьСписатьОсталось - СтрокаАмортизации.ВсегоОсталосьСписать;
				СтоимостьОсталось				= СтоимостьОсталось - СтрокаАмортизации.Стоимость;
				АмортизацияОсталось				= АмортизацияОсталось - СтрокаАмортизации.Амортизация;
				КоличествоДнейОсталось			= КоличествоДнейОсталось - ВыборкаДет.КоличествоДней;
				ДнейВПериодеОсталось			= ДнейВПериодеОсталось - ВыборкаДет.КоличествоДней;
				
			КонецЦикла;
			
			Если ДнейВПериодеОсталось > 0 Тогда
				СтрокаАмортизацииОстаток = ТаблицаАмортизации.Добавить();
				Если СтрокаАмортизации = Неопределено Тогда
					ЗаполнитьЗначенияСвойств(СтрокаАмортизацииОстаток, ВыборкаОС);
				Иначе
					ЗаполнитьЗначенияСвойств(СтрокаАмортизацииОстаток, СтрокаАмортизации);
				КонецЕсли;
				
				СтрокаАмортизацииОстаток.Проект = Справочники.Проекты.ПустаяСсылка();
				
				СтрокаАмортизацииОстаток.АмортизацияКонечныйОстаток	= АмортизацияКонечныйОстатокОсталось;
				СтрокаАмортизацииОстаток.БалансоваяСтоимость	= БалансоваяСтоимостьОсталось;
				СтрокаАмортизацииОстаток.ВсегоОсталосьСписать	= ВсегоОсталосьСписатьОсталось;
				СтрокаАмортизацииОстаток.Стоимость				= СтоимостьОсталось;
				СтрокаАмортизацииОстаток.Амортизация			= АмортизацияОсталось;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
	Если ТаблицаАмортизации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДокумента.Период КАК Период,
	               |	ТаблицаДокумента.Организация КАК Организация,
				   |	ТаблицаДокумента.Продолжить КАК Продолжить,
				   |	ТаблицаДокумента.СообщениеОбОшибкеНачисленияАмортизации КАК СообщениеОбОшибкеНачисленияАмортизации,
	               |	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	               |	ТаблицаДокумента.ВнеоборотныйАктивПредставление КАК ВнеоборотныйАктивПредставление,
	               |	ТаблицаДокумента.Код КАК Код,
	               |	ТаблицаДокумента.Проект КАК Проект,
	               |	ТаблицаДокумента.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	               |	ТаблицаДокумента.БалансоваяСтоимость КАК БалансоваяСтоимость,
	               |	ТаблицаДокумента.ВсегоОсталосьСписать КАК ВсегоОсталосьСписать,
	               |	ТаблицаДокумента.Стоимость КАК Стоимость,
	               |	ТаблицаДокумента.Амортизация КАК Амортизация
	               |ПОМЕСТИТЬ втТаблицаАмортизации
	               |ИЗ
	               |	&ТаблицаАмортизации КАК ТаблицаДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ТаблицаРасчетаАмортизации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТаблицаАмортизации.Период,
	               |	втТаблицаАмортизации.Организация,
				   |	втТаблицаАмортизации.Продолжить КАК Продолжить,
				   |	втТаблицаАмортизации.СообщениеОбОшибкеНачисленияАмортизации КАК СообщениеОбОшибкеНачисленияАмортизации,
	               |	втТаблицаАмортизации.ВнеоборотныйАктив,
	               |	втТаблицаАмортизации.ВнеоборотныйАктивПредставление,
	               |	втТаблицаАмортизации.Код,
	               |	втТаблицаАмортизации.Проект,
	               |	втТаблицаАмортизации.АмортизацияКонечныйОстаток,
	               |	втТаблицаАмортизации.БалансоваяСтоимость,
	               |	втТаблицаАмортизации.ВсегоОсталосьСписать,
	               |	втТаблицаАмортизации.Стоимость,
	               |	втТаблицаАмортизации.Амортизация
	               |ПОМЕСТИТЬ ТаблицаРасчетаАмортизации
	               |ИЗ
	               |	втТаблицаАмортизации КАК втТаблицаАмортизации";
	
	Запрос.УстановитьПараметр("ТаблицаАмортизации", ТаблицаАмортизации);
	Запрос.ВыполнитьПакет();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасы(ДокументСсылкаАмортизацияВА, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачислениеАмортизации", НСтр("ka='ამორტიზაციის დარიცხვა';ru='Начисление амортизации';en='depreciation is calculated'"));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаДокумента", ДокументСсылкаАмортизацияВА.Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.СчетУчетаАмортизации КАК СчетУчета,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.Партия КАК Партия,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ТаблицаДокумента.Амортизация КАК Сумма,
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет) КАК ВидДвиженияУправленческий,
	|	&НачислениеАмортизации КАК СодержаниеПроводки,
	|	ТаблицаДокумента.СчетУчетаАмортизацииРегл КАК СчетУчетаРегл,
	//ПодольскийАИ #УчетПроектов 10.12.2020 {
	|	ТаблицаДокумента.Проект КАК Проект
	//ПодольскийАИ #УчетПроектов 10.12.2020 }
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаДокумента.Период КАК Период,
	|		&Организация КАК Организация,
	|		ПараметрыВнеоборотныхАктивовСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат КАК СчетУчетаАмортизации,
	|		ПараметрыВнеоборотныхАктивовСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|		ТаблицаДокумента.ВнеоборотныйАктив.СчетУчета КАК СчетУчета,
	|		ТаблицаДокумента.ВнеоборотныйАктив.СчетАмортизации КАК СчетАмортизации,
	//ПодольскийАИ #УчетПроектов 10.12.2020 {
	|		ТаблицаДокумента.Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 10.12.2020 }
	|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|		ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|		НЕОПРЕДЕЛЕНО КАК Заказ,
	|		ТаблицаДокумента.Стоимость КАК Стоимость,
	|		ТаблицаДокумента.Амортизация КАК Амортизация,
	|		ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл КАК СчетУчетаАмортизацииРегл
	|	ИЗ
	|		ТаблицаРасчетаАмортизации КАК ТаблицаДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&МоментВремени, ) КАК ПараметрыВнеоборотныхАктивовСрезПоследних
	|			ПО (&Организация = ПараметрыВнеоборотныхАктивовСрезПоследних.Организация)
	|				И ТаблицаДокумента.ВнеоборотныйАктив = ПараметрыВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив,
	//+++ Дмгг
	|		Константа.ИспользоватьРегламентированныйПланСчетов КАК ИспользоватьРегламентированныйПланСчетов,
	|		Константа.ДатаНачалаИспользованияРеглПланаСчетов КАК ДатаНачалаИспользованияРеглПланаСчетов
	//---- Дмгг
	|	ГДЕ
	|		ТаблицаДокумента.Продолжить
	|		И ТаблицаДокумента.Амортизация <> 0
	|		И ТаблицаДокумента.СообщениеОбОшибкеНачисленияАмортизации = НЕОПРЕДЕЛЕНО
	//+++ Дмгг
	//|		И (ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	//|				ИЛИ ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))) КАК ТаблицаДокумента";
	|		И ВЫБОР
	|			КОГДА ИспользоватьРегламентированныйПланСчетов.Значение
	|					И ДатаНачалаИспользованияРеглПланаСчетов.Значение < &ДатаДокумента
	|				ТОГДА ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|						ИЛИ ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|			ИНАЧЕ ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|					ИЛИ ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|		КОНЕЦ) КАК ТаблицаДокумента";
	//--- Дмгг
			
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());
			
КонецПроцедуры // СформироватьТаблицаЗапасы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаАмортизацияВА, СтруктураДополнительныеСвойства)
	
	МассивСчетовФинРезРасходы = РегламентированныйУчетСервер.ПолучитьСчетаФинРезРасход();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачислениеАмортизации", НСтр("ka='ამორტიზაციის დარიცხვა';ru='Начисление амортизации';en='depreciation is calculated'"));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетаФинРезРасходы", МассивСчетовФинРезРасходы);
	Запрос.УстановитьПараметр("ДатаДокумента", ДокументСсылкаАмортизацияВА.Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат КАК СчетУчета,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК Аналитика,
	|	НЕОПРЕДЕЛЕНО КАК Заказ,
	|	ТаблицаДокумента.Амортизация КАК СуммаРасходов,
	|	ТаблицаДокумента.Амортизация КАК Сумма,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет) КАК ВидДвиженияУправленческий,
	|	&НачислениеАмортизации КАК СодержаниеПроводки,
	//ПодольскийАИ #УчетПроектов 10.12.2020 {
	|	ТаблицаДокумента.Проект КАК Проект
	//ПодольскийАИ #УчетПроектов 10.12.2020 }
	|ИЗ
	|	ТаблицаРасчетаАмортизации КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&МоментВремени, ) КАК ПараметрыВнеоборотныхАктивовСрезПоследних
	|		ПО (&Организация = ПараметрыВнеоборотныхАктивовСрезПоследних.Организация)
	|			И ТаблицаДокумента.ВнеоборотныйАктив = ПараметрыВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив,
	//+++ Дмгг
	|		Константа.ИспользоватьРегламентированныйПланСчетов КАК ИспользоватьРегламентированныйПланСчетов,
	|		Константа.ДатаНачалаИспользованияРеглПланаСчетов КАК ДатаНачалаИспользованияРеглПланаСчетов
	//---- Дмгг
	|ГДЕ
	|	ТаблицаДокумента.Продолжить
	|	И ТаблицаДокумента.Амортизация <> 0
	|	И ТаблицаДокумента.СообщениеОбОшибкеНачисленияАмортизации = НЕОПРЕДЕЛЕНО
	//+++ Дмгг
	//|	И ((ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	//|			ИЛИ ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|	И (ВЫБОР
	|		КОГДА ИспользоватьРегламентированныйПланСчетов.Значение
	|				И ДатаНачалаИспользованияРеглПланаСчетов.Значение < &ДатаДокумента
	|			ТОГДА (ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|		ИНАЧЕ (ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|				ИЛИ ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|	КОНЕЦ
	//--- Дмгг
	|	ИЛИ ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл В (&СчетаФинРезРасходы))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВнеоборотныеАктивы(ДокументСсылкаАмортизацияВА, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачислениеАмортизации", НСтр("ka='ამორტიზაციის დარიცხვა';ru='Начисление амортизации';en='depreciation is calculated'"));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.Стоимость КАК Стоимость,
	|	ТаблицаДокумента.Амортизация КАК Амортизация,
	|	ТаблицаДокумента.Амортизация КАК Сумма,
	|	ТаблицаДокумента.ВнеоборотныйАктив.СчетАмортизации КАК СчетУчета,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит) КАК ВидДвиженияУправленческий,
	|	&НачислениеАмортизации КАК СодержаниеПроводки,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл КАК СчетУчетаРегл
	|,	1 КАК КоличествоМесяцеВЭксплуатации //+++ Дмгг
	|ИЗ
	|	ТаблицаРасчетаАмортизации КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&МоментВремени, ) КАК ПараметрыВнеоборотныхАктивовСрезПоследних
	|		ПО (&Организация = ПараметрыВнеоборотныхАктивовСрезПоследних.Организация)
	|		И ТаблицаДокумента.ВнеоборотныйАктив = ПараметрыВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив
	|ГДЕ
	|	ТаблицаДокумента.Продолжить
	|	И ТаблицаДокумента.СообщениеОбОшибкеНачисленияАмортизации = НЕОПРЕДЕЛЕНО
	|	И ТаблицаДокумента.Амортизация > 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВнеоборотныеАктивы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВнеоборотныеАктивы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОшибкиЗакрытияМесяца(ДокументСсылкаАмортизацияВА, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачислениеАмортизации", НСтр("ka='ამორტიზაციის დარიცხვა';ru='Начисление амортизации';en='depreciation is calculated'"));
	Запрос.УстановитьПараметр("АмортизацияРавнаНулю", НСтр("ka='გაანგარიშებული ამორტიზაცია არის 0-ის ტოლი!';ru='расчитанная амортизация равна 0!';en='Calculated depreciation is equal to 0!'"));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Период КАК Период,
	|	ТаблицаСообщенийНачисленияАмортизации.ВнеоборотныйАктивПредставление КАК ВнеоборотныйАктивПредставление,
	|	ТаблицаСообщенийНачисленияАмортизации.Код КАК Код,
	|	ТаблицаСообщенийНачисленияАмортизации.СообщениеОбОшибкеНачисленияАмортизации КАК СообщениеОбОшибкеНачисленияАмортизации,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(255)) КАК ОписаниеОшибки,
	|	""НачислениеАмортизации"" КАК ВидОперации
	|ИЗ
	|	ТаблицаРасчетаАмортизации КАК ТаблицаСообщенийНачисленияАмортизации
	|ГДЕ
	|	ТаблицаСообщенийНачисленияАмортизации.Продолжить
	|	И ТаблицаСообщенийНачисленияАмортизации.СообщениеОбОшибкеНачисленияАмортизации <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	&Период,
	|	ТаблицаСообщенийНачисленияАмортизации.ВнеоборотныйАктивПредставление,
	|	ТаблицаСообщенийНачисленияАмортизации.Код,
	|	&АмортизацияРавнаНулю,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(255)),
	|	""НачислениеАмортизации""
	|ИЗ
	|	ТаблицаРасчетаАмортизации КАК ТаблицаСообщенийНачисленияАмортизации
	|ГДЕ
	|	ТаблицаСообщенийНачисленияАмортизации.Продолжить
	|	И ТаблицаСообщенийНачисленияАмортизации.СообщениеОбОшибкеНачисленияАмортизации = НЕОПРЕДЕЛЕНО
	|	И ТаблицаСообщенийНачисленияАмортизации.Амортизация = 0
	|	И ТаблицаСообщенийНачисленияАмортизации.ВсегоОсталосьСписать <> 0";
	
	Запрос.УстановитьПараметр("Период", СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Для каждого ТекСтрока Из ТаблицаРезультата Цикл
		ТекстОшибки = НСтр("ka='ქონება %ВнеоборотныйАктивПредставление% -ისთვის (%Код%) %СообщениеОбОшибкеНачисленияАмортизации%.';ru='Для имущества %ВнеоборотныйАктивПредставление% (%Код%) %СообщениеОбОшибкеНачисленияАмортизации%.';en='For property VneoborotnyyAktivPredstavlenie%% (% code%)%% SoobschenieObOshibkeNachisleniyaAmortizatsii.'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ВнеоборотныйАктивПредставление%", СокрЛП(ТекСтрока.ВнеоборотныйАктивПредставление));
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Код%", СокрЛП(ТекСтрока.Код));
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%СообщениеОбОшибкеНачисленияАмортизации%", СокрЛП(ТекСтрока.СообщениеОбОшибкеНачисленияАмортизации));
		ТекСтрока.ОписаниеОшибки = ТекстОшибки;
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОшибкиЗакрытияМесяца", ТаблицаРезультата);
	
КонецПроцедуры // СформироватьТаблицаСообщенийНачисленияАмортизации()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(ДокументСсылкаАмортизацияВА, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачислениеАмортизации", НСтр("ka='ამორტიზაციის დარიცხვა';ru='Начисление амортизации';en='depreciation is calculated'"));
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Период КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	0 КАК СуммаВалДт,
	|	ТаблицаДокумента.ВнеоборотныйАктив.СчетАмортизации КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	0 КАК СуммаВалКт,
	|	ТаблицаДокумента.Амортизация КАК Сумма,
	|	ВЫРАЗИТЬ(&НачислениеАмортизации КАК СТРОКА(100)) КАК Содержание
	|ИЗ
	|	ТаблицаРасчетаАмортизации КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&МоментВремени, ) КАК ПараметрыВнеоборотныхАктивовСрезПоследних
	|		ПО (&Организация = ПараметрыВнеоборотныхАктивовСрезПоследних.Организация)
	|			И ТаблицаДокумента.ВнеоборотныйАктив = ПараметрыВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив
	|ГДЕ
	|	ТаблицаДокумента.Продолжить
	|	И ТаблицаДокумента.СообщениеОбОшибкеНачисленияАмортизации = НЕОПРЕДЕЛЕНО
	|	И ТаблицаДокумента.Амортизация > 0";

	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаУправленческий()

#КонецОбласти

#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли