#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Серийные номера
	Если РаботаССерийнымиНомерами.ИспользоватьСерийныеНомераОстатки() = Истина Тогда
	
		Для каждого СтрокаЗапасы Из Запасы Цикл
			Если СтрокаЗапасы.Номенклатура.ИспользоватьСерийныеНомера Тогда
				ОтборСерийныеНомера = Новый Структура("КлючСвязи", СтрокаЗапасы.КлючСвязи);
				ОтборСерийныеНомера = СерийныеНомера.НайтиСтроки(ОтборСерийныеНомера);
				
				Если ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения)=Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
				    Коэффициент = СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент;
				Иначе
					Коэффициент = 1;
				КонецЕсли;
				
				СтрокаЗапасыКоличество = СтрокаЗапасы.Количество * Коэффициент;
				
				Если ОтборСерийныеНомера.Количество() <> СтрокаЗапасыКоличество Тогда
					ТекстСообщения = НСтр("ka='სერიული ნომრების რიცხოვნება სტრიქონ %Номер%.-ში არსებული ერთეულების რაოდენობისგან განსხვავდება.';ru='Число серийных номеров отличается от количества единиц в строке %Номер%.'");
					ТекстСообщения = ТекстСообщения + НСтр("ka=' სერიული ნომერი - %ЧислоНомеров%, საჭიროა %КоличествоВСтроке%';ru=' Серийных номеров - %ЧислоНомеров%, нужно %КоличествоВСтроке%'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номер%", СтрокаЗапасы.НомерСтроки);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЧислоНомеров%", ОтборСерийныеНомера.Количество());
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоВСтроке%", СтрокаЗапасыКоличество);
					
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = ТекстСообщения;
					Сообщение.Сообщить();
					
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла;
	
	КонецЕсли; 
		
КонецПроцедуры

//+++ Дмгг
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ИтогКоличество 		= Запасы.Итог("Количество");
	ИтогКоличествоУчет 	= Запасы.Итог("КоличествоУчет");
	ИтогОтклонение 		= Запасы.Итог("Отклонение");
	ИтогСумма 			= Запасы.Итог("Сумма");
	ИтогСуммаУчет	 	= Запасы.Итог("СуммаУчет");
	ИтогСуммаОтклонение = ИтогСумма - ИтогСуммаУчет;
	 
КонецПроцедуры
//--- Дмгг

#КонецОбласти

#КонецЕсли