
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//	УправлениеНебольшойФирмойСервер.ЗаполнитьШапкуДокумента(
	//	Объект,
	//	Параметры.ЗначениеКопирования,
	//	Параметры.Основание,
	//	СостояниеДокумента,
	//	РазрешеноПроведение,
	//	Параметры.ЗначенияЗаполнения
	//);
КонецПроцедуры

&НаКлиенте
Процедура ГруппыНоменклатурПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		Элементы.ГруппыНоменклатур.ТекущиеДанные.СпособОкругления	= ПредопределенноеЗначение("Перечисление.СпособыОкругления.Вверх");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		Элементы.Запасы.ТекущиеДанные.СпособОкругления 				= ПредопределенноеЗначение("Перечисление.СпособыОкругления.Вверх");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыФиксированнаяЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	Если ТекущиеДанные.ФиксированнаяЦена Тогда
		ТекущиеДанные.ПроцентСкидки		= 0;
		ТекущиеДанные.СпособОкругления	= Неопределено;
	Иначе
		ТекущиеДанные.Цена = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппыНоменклатурФиксированнаяЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ГруппыНоменклатур.ТекущиеДанные;
	Если ТекущиеДанные.ФиксированнаяЦена Тогда
		ТекущиеДанные.ПроцентСкидки		= 0;
		ТекущиеДанные.СпособОкругления	= Неопределено;
	Иначе
		ТекущиеДанные.Цена = 0;
	КонецЕсли;
КонецПроцедуры


