
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УзелОбмена = ПараметрКоманды;
	
	Если УзелОбмена = ОбменССайтомПовтИсп.ПолучитьЭтотУзелПланаОбмена("ОбменУправлениеНебольшойФирмойСайт") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ka='კვანძი შეესაბამება ამ საინფორმაციო ბაზას და არ შეიძლება გამოყენებული იქნას საიტთან გაცვლაში. გამოიყენეთ გაცვლის სხვა კვანძი ან შექმენით ახალი.';ru='Узел соответствует этой информационной базе и не может использоваться в обмене с сайтом. Используйте другой узел обмена или создайте новый.';en='This corresponds to a node information database and can not be used in an exchange with the site. Use a different sharing site or create a new one.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УзелОбмена", УзелОбмена);
	ПараметрыФормы.Вставить("ВыгружатьТолькоИзменения", Истина);
	
	ОткрытьФорму("ПланОбмена.ОбменУправлениеНебольшойФирмойСайт.Форма.ФормаВыполнениеОбмена", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, УзелОбмена);
	
КонецПроцедуры
