
&НаСервере
Процедура РасшAzRy_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	// Установим формат для текущей даты: ДФ=Ч:мм
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(Список);
	
	// Для создания расхода из кассы с видом операции "Подотчетнтику" из авансового отчета.
	Если Параметры.Свойство("ВидОперацииБанк") Тогда
		Параметры.Отбор.Вставить("ВидОперации", Параметры.ВидОперацииБанк);
	КонецЕсли;
	
	Если Параметры.Свойство("ОрганизацияДляОтбора") И НЕ Константы.УчетПоКомпании.Получить() Тогда
		Параметры.Отбор.Вставить("Организация", Параметры.ОрганизацияДляОтбора);
	КонецЕсли;
	
	//+++ Дмгг, 11.06.2025, ONESOFT-4145
	//УстановитьВидимостьДостуаностьКомандОтправкиДокументаВБанк();
	//--- Дмгг, 11.06.2025, ONESOFT-4145
	
	// +++ { AzRy - [26.04.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
	Если Параметры.Свойство("ВидОперацииБанк") И Параметры.ВидОперацииБанк = Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику Тогда
		Параметры.Отбор.Удалить("ВалютаДенежныхСредств");
	КонецЕсли; 
	// +++ } AzRy - [26.04.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
	
КонецПроцедуры
