
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОК(Команда)
	
	ТестированиеДанных = Ложь;

	Если ПустаяСтрока(Фамилия) И ((НЕ ПустаяСтрока(Имя)) Или (НЕ ПустаяСтрока(Отчество))) Тогда
		
		Сообщение = Новый СообщениеПользователю;

		Сообщение.Текст = НСтр("ka='Реквизит ""Фамилия"" не заполнен.';ru='Реквизит ""Фамилия"" не заполнен.';en='Props ""Last Name"" is empty.'");

		Сообщение.Сообщить();

		ТестированиеДанных = Истина;
		
	КонецЕсли;

	Если НЕ ПустаяСтрока(Фамилия) И ((ПустаяСтрока(Имя)) И (НЕ ПустаяСтрока(Отчество))) Тогда
		
		Сообщение = Новый СообщениеПользователю;

		Сообщение.Текст = НСтр("ka='Реквизит ""Имя"" не заполнен.';ru='Реквизит ""Имя"" не заполнен.';en='Props ""name"" is not filled.'");

		Сообщение.Сообщить();

		ТестированиеДанных = Истина;
		
	КонецЕсли;
    
	Если СтрНайти(Фамилия, ",") > 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;

		Сообщение.Текст = НСтр("ka='В реквизите ""Фамилия"" найден недопустимый символ "","".';ru='В реквизите ""Фамилия"" найден недопустимый символ "","".';en='The requisite ""Name"" is found invalid character "".""'");

		Сообщение.Сообщить();

		ТестированиеДанных = Истина;
		
	КонецЕсли;

	Если СтрНайти(Имя, ",") > 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;

		Сообщение.Текст = НСтр("ka='В реквизите ""Имя"" найден недопустимый символ "","".';ru='В реквизите ""Имя"" найден недопустимый символ "","".';en='The requisite ""Name"" is found invalid character "".""'");

		Сообщение.Сообщить();

		ТестированиеДанных = Истина;
		
	КонецЕсли;

	Если СтрНайти(Отчество, ",") > 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;

		Сообщение.Текст = НСтр("ka='В реквизите ""Отчество"" найден недопустимый символ "","".';ru='В реквизите ""Отчество"" найден недопустимый символ "","".';en='The requisite ""Middle"" is found invalid character "".""'");

		Сообщение.Сообщить();

		ТестированиеДанных = Истина;
		
	КонецЕсли;

	Если ТестированиеДанных Тогда
		Возврат;
	КонецЕсли;

	ФИО = Новый Структура;
	ФИО.Вставить("Фамилия", Фамилия);
	ФИО.Вставить("Имя", Имя);
	ФИО.Вставить("Отчество", Отчество);
	
	Закрыть(ФИО);
	
КонецПроцедуры // ОК()

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры // Отмена()

#КонецОбласти