#Область СлужебныеПроцедурыИФункции
Процедура СформироватьДеревоJSON(ЧтениеJSON, Дерево) ЭКСПОРТ
    
    ИмяСвойства = НЕОПРЕДЕЛЕНО;
	
    Пока ЧтениеJSON.Прочитать() Цикл
        TипJSON = ЧтениеJSON.ТипТекущегоЗначения;
        
        Если TипJSON = ТипЗначенияJSON.НачалоОбъекта ИЛИ TипJSON = ТипЗначенияJSON.НачалоМассива Тогда
			
			НовыйОбъект = ?(TипJSON = ТипЗначенияJSON.НачалоОбъекта, Новый Соответствие, Новый Массив);
			
			Если Дерево = НЕОПРЕДЕЛЕНО Тогда
                Дерево = НовыйОбъект;
				СформироватьДеревоJSON(ЧтениеJSON, Дерево);
			Иначе
				Если ТипЗнч(Дерево) = Тип("Массив") Тогда
	                Дерево.Добавить(НовыйОбъект);
					СформироватьДеревоJSON(ЧтениеJSON, НовыйОбъект);
				Иначе
					Если ТипЗнч(Дерево) = Тип("Соответствие") И ЗначениеЗаполнено(ИмяСвойства) Тогда
						Дерево.Вставить(ИмяСвойства, НовыйОбъект);
						СформироватьДеревоJSON(ЧтениеJSON, НовыйОбъект);
					Иначе
						Дерево = НовыйОбъект;
						СформироватьДеревоJSON(ЧтениеJSON, Дерево);
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли TипJSON = ТипЗначенияJSON.ИмяСвойства Тогда
			
            ИмяСвойства = ЧтениеJSON.ТекущееЗначение;
			
			Если Дерево = НЕОПРЕДЕЛЕНО Тогда
				Дерево = Новый Соответствие;
			КонецЕсли;
			
		ИначеЕсли TипJSON = ТипЗначенияJSON.Число ИЛИ TипJSON = ТипЗначенияJSON.Строка ИЛИ TипJSON = ТипЗначенияJSON.Булево ИЛИ TипJSON = ТипЗначенияJSON.Null Тогда
			
            Если ТипЗнч(Дерево) = Тип("Массив") Тогда
                Дерево.Добавить(ЧтениеJSON.ТекущееЗначение);
            ИначеЕсли ТипЗнч(Дерево) = Тип("Соответствие") Тогда
                Дерево.Вставить(ИмяСвойства, ЧтениеJSON.ТекущееЗначение);
			КонецЕсли;
			
		Иначе
			
            Возврат;
			
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

Функция ДатаJSON(Date) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = НЕОПРЕДЕЛЕНО;
	
	Попытка
		РЕЗ = ПрочитатьДатуJSON(Date, ФорматДатыJSON.ISO);
	Исключение
		Попытка
			РЕЗ = ПрочитатьДатуJSON(Date, ФорматДатыJSON.JavaScript);
		Исключение
			Попытка
				РЕЗ = ПрочитатьДатуJSON(Date, ФорматДатыJSON.Microsoft);
			Исключение
				РЕЗ = НЕОПРЕДЕЛЕНО;
			КонецПопытки;
		КонецПопытки;
	КонецПопытки;

	Возврат РЕЗ;
КонецФункции // ()

Функция НайтиИлиСоздатьДополнительныйРеквизит(Заголовок,НаборыДополнительныхРеквизитовИСведений,ТекОписаниеТипа) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	РЕЗ=НЕОПРЕДЕЛЕНО;
	
	Если НЕ ЗначениеЗаполнено(НаборыДополнительныхРеквизитовИСведений) Тогда
		Возврат РЕЗ;
	КонецЕсли;
	
	Если НЕ НаборыДополнительныхРеквизитовИСведений.Используется Тогда
		Попытка
			НаборыДополнительныхРеквизитовИСведенийОбъект = НаборыДополнительныхРеквизитовИСведений.ПолучитьОбъект();
			НаборыДополнительныхРеквизитовИСведенийОбъект.Используется = ИСТИНА;
			НаборыДополнительныхРеквизитовИСведенийОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДополнительныеРеквизитыИСведения.Ссылка КАК ТекДопРеквизит
	               |ИЗ
	               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	               |ГДЕ
	               |	ДополнительныеРеквизитыИСведения.Заголовок = &Заголовок
	               |	И ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств";
	
	Запрос.УстановитьПараметр("Заголовок", Заголовок);
	Запрос.УстановитьПараметр("НаборСвойств", НаборыДополнительныхРеквизитовИСведений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.ТекДопРеквизит;
	КонецЦикла;
	
	Если РЕЗ=НЕОПРЕДЕЛЕНО Тогда	
		РЕЗ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		РЕЗ.Наименование = Заголовок;
		РЕЗ.ТипЗначения = ТекОписаниеТипа;
		РЕЗ.Виден = ИСТИНА;
		РЕЗ.Доступен = ИСТИНА;
		РЕЗ.Заголовок = Заголовок;
		РЕЗ.НаборСвойств = НаборыДополнительныхРеквизитовИСведений;
		РЕЗ.Комментарий = Заголовок;
		РЕЗ.Записать();
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Свойство", РЕЗ.Ссылка);
	МассивСтрок = НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрок.Количество()=0 Тогда
		НаборыДополнительныхРеквизитовИСведений_Объект=НаборыДополнительныхРеквизитовИСведений.ПолучитьОбъект();
		стрТаб_ДополнительныеРеквизиты=НаборыДополнительныхРеквизитовИСведений_Объект.ДополнительныеРеквизиты.Добавить();
		стрТаб_ДополнительныеРеквизиты.Свойство=РЕЗ.Ссылка;
		НаборыДополнительныхРеквизитовИСведений_Объект.Записать();
	КонецЕсли;			
	
	Возврат РЕЗ.Ссылка;
КонецФункции

Процедура УстановитьДополнительныйРеквизит(ТекОбъект, СвойствоДополнительногоРеквизита, ЗначениеДополнительногоРеквизита) ЭКСПОРТ

	СтрукутраПоиска = Новый Структура("Свойство", СвойствоДополнительногоРеквизита);
	МассивСтрок = ТекОбъект.ДополнительныеРеквизиты.НайтиСтроки(СтрукутраПоиска);
	Если МассивСтрок.Количество()=0 Тогда
		СтрДополнительныеРеквизиты = ТекОбъект.ДополнительныеРеквизиты.Добавить();
		СтрДополнительныеРеквизиты.Свойство = СвойствоДополнительногоРеквизита;
	Иначе
		СтрДополнительныеРеквизиты = МассивСтрок[0];
	КонецЕсли;
	СтрДополнительныеРеквизиты.Значение = ЗначениеДополнительногоРеквизита;

КонецПроцедуры

Функция НайтиЗначениеДополнительногоРеквизита(ТекОбъект, СвойствоДополнительногоРеквизита) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	Если НЕ ТекОбъект.Метаданные().ТабличныеЧасти.Найти("ДополнительныеРеквизиты")=НЕОПРЕДЕЛЕНО Тогда
		Для каждого СтрДополнительныеРеквизиты Из ТекОбъект["ДополнительныеРеквизиты"] Цикл
			Если СтрДополнительныеРеквизиты.Свойство = СвойствоДополнительногоРеквизита Тогда
				РЕЗ = СтрДополнительныеРеквизиты.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция СтруктураДополнительныхРеквизитов(НаборыДополнительныхРеквизитовИСведений) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	Если НаборыДополнительныхРеквизитовИСведений = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы Тогда
	    РЕЗ = Новый Структура("SurplusSubdivision, SurplusInventorySubdivision, WriteОffSubdivision, WriteОffUniformSubdivision, WriteОffUtilizationSubdivision, WriteОffInventorySubdivision, SaleSubdivision");
		
		РЕЗ.SurplusSubdivision  = НайтиИлиСоздатьДополнительныйРеквизит("Surplus subdivision",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
		
		РЕЗ.SurplusInventorySubdivision  = НайтиИлиСоздатьДополнительныйРеквизит("Surplus (Inventory) subdivision",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
		
		РЕЗ.WriteОffSubdivision  = НайтиИлиСоздатьДополнительныйРеквизит("Write-off subdivision",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
		
		РЕЗ.WriteОffUniformSubdivision  = НайтиИлиСоздатьДополнительныйРеквизит("Write-off (Uniform) subdivision",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
		
		РЕЗ.WriteОffUtilizationSubdivision  = НайтиИлиСоздатьДополнительныйРеквизит("Write-off (Utilization) subdivision",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
		
		РЕЗ.WriteОffInventorySubdivision  = НайтиИлиСоздатьДополнительныйРеквизит("Write-off (Inventory) subdivision",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
		
		РЕЗ.SaleSubdivision  = НайтиИлиСоздатьДополнительныйРеквизит("Sale subdivision",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
		
	Иначе	
		РЕЗ = Новый Структура("DocRef, DocNumber, DocDate");
		
		РЕЗ.DocRef = НайтиИлиСоздатьДополнительныйРеквизит("DocRef",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка"));
		
		РЕЗ.DocNumber = НайтиИлиСоздатьДополнительныйРеквизит("DocNumber",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка"));
		
		РЕЗ.DocDate = НайтиИлиСоздатьДополнительныйРеквизит("DocDate",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка"));
		
		Если НаборыДополнительныхРеквизитовИСведений = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходныйОрдер
			ИЛИ НаборыДополнительныхРеквизитовИСведений = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходныйОрдер
			Тогда
			
			TransferNumber = НайтиИлиСоздатьДополнительныйРеквизит("TransferNumber",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка"));
			РЕЗ.Вставить("TransferNumber",TransferNumber);
			
		КонецЕсли;
		
		Если (НаборыДополнительныхРеквизитовИСведений = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная)
			ИЛИ (НаборыДополнительныхРеквизитовИСведений = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеВКассу)
			ИЛИ (НаборыДополнительныхРеквизитовИСведений = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеНаСчет)
			ИЛИ (НаборыДополнительныхРеквизитовИСведений = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходИзКассы)
			ИЛИ (НаборыДополнительныхРеквизитовИСведений = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеЗапасов)
			Тогда
			
			BaseRef = НайтиИлиСоздатьДополнительныйРеквизит("BaseRef",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка"));
			РЕЗ.Вставить("BaseRef",BaseRef);
			
			BaseNumber = НайтиИлиСоздатьДополнительныйРеквизит("BaseNumber",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка"));
			РЕЗ.Вставить("BaseNumber",BaseNumber);
			
		КонецЕсли;
		
		Если (НаборыДополнительныхРеквизитовИСведений = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная) Тогда
			
			BaseDoc = НайтиИлиСоздатьДополнительныйРеквизит("BaseDoc",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная"));
			РЕЗ.Вставить("BaseDoc",BaseDoc);
			
		КонецЕсли;
		
		Если (НаборыДополнительныхРеквизитовИСведений = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеЗапасов) Тогда
		
			Type = НайтиИлиСоздатьДополнительныйРеквизит("Type",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов"));
			Оrdinary1 = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Оrdinary1",ИСТИНА,,Type);
			Если НЕ ЗначениеЗаполнено(Оrdinary1) Тогда
				Оrdinary1 = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
				Оrdinary1.Наименование = "Оrdinary1";
				Оrdinary1.Владелец = Type.Ссылка;
				Оrdinary1.Записать();
			КонецЕсли;
			Оrdinary2 = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Оrdinary2",ИСТИНА,,Type);
			Если НЕ ЗначениеЗаполнено(Оrdinary2) Тогда
				Оrdinary2 = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
				Оrdinary2.Наименование = "Оrdinary2";
				Оrdinary2.Владелец = Type.Ссылка;
				Оrdinary2.Записать();
			КонецЕсли;
			AdjustmentMinus = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Adjustment""-""",ИСТИНА,,Type);
			Если НЕ ЗначениеЗаполнено(AdjustmentMinus) Тогда
				AdjustmentMinus = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
				AdjustmentMinus.Наименование = "Adjustment""-""";
				AdjustmentMinus.Владелец = Type.Ссылка;
				AdjustmentMinus.Записать();
			КонецЕсли;
			AdjustmentPlus = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Adjustment""+""",ИСТИНА,,Type);
			Если НЕ ЗначениеЗаполнено(AdjustmentPlus) Тогда
				AdjustmentPlus = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
				AdjustmentPlus.Наименование = "Adjustment""+""";
				AdjustmentPlus.Владелец = Type.Ссылка;
				AdjustmentPlus.Записать();
			КонецЕсли;
			
			
		    РЕЗ.Вставить("Type",Type);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ПолучитьНастройкиПоУмолчанию() ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	ПоУмолчанию = Справочники.ПараметрыДляОбменаДаннымиРозницаHTTP.ПоУмолчанию;
	
	РЕЗ = Новый Структура("ВсеПравильно",ИСТИНА);
	РЕЗ.Вставить("Автор",ПоУмолчанию.Автор);
	РЕЗ.Вставить("Организация",ПоУмолчанию.Организация);
	РЕЗ.Вставить("ВалютаРасчетов",ПоУмолчанию.ВалютаРасчетов);
	//РЕЗ.Вставить("СчетУчетаАвансовПокупателя",ПоУмолчанию.СчетУчетаАвансовПокупателя);
	//РЕЗ.Вставить("СчетУчетаАвансовПоставщику",ПоУмолчанию.СчетУчетаАвансовПоставщику);
	//РЕЗ.Вставить("СчетУчетаРасчетовСПокупателем",ПоУмолчанию.СчетУчетаРасчетовСПокупателем);
	//РЕЗ.Вставить("СчетУчетаРасчетовСПоставщиком",ПоУмолчанию.СчетУчетаРасчетовСПоставщиком);
	РЕЗ.Вставить("СчетУчетаАвансовПокупателяРегл",ПоУмолчанию.СчетУчетаАвансовПокупателяРегл);
	РЕЗ.Вставить("СчетУчетаАвансовПоставщикуРегл",ПоУмолчанию.СчетУчетаАвансовПоставщикуРегл);
	РЕЗ.Вставить("СчетУчетаРасчетовСПокупателемРегл",ПоУмолчанию.СчетУчетаРасчетовСПокупателемРегл);
	РЕЗ.Вставить("СчетУчетаРасчетовСПоставщикомРегл",ПоУмолчанию.СчетУчетаРасчетовСПоставщикомРегл);
	РЕЗ.Вставить("КорреспонденцияРеглОприходованиеЗапасов",ПоУмолчанию.КорреспонденцияРеглОприходованиеЗапасов);
	РЕЗ.Вставить("КорреспонденцияРеглОприходованиеЗапасовИнвентаризация",ПоУмолчанию.КорреспонденцияРеглОприходованиеЗапасовИнвентаризация);
	РЕЗ.Вставить("КорреспонденцияРеглСписаниеЗапасов",ПоУмолчанию.КорреспонденцияРеглСписаниеЗапасов);
	РЕЗ.Вставить("КорреспонденцияРеглСписаниеЗапасовУниформа",ПоУмолчанию.КорреспонденцияРеглСписаниеЗапасовУниформа);
	РЕЗ.Вставить("ПодразделениеСписаниеЗапасовУниформа",ПоУмолчанию.ПодразделениеСписаниеЗапасовУниформа);
	РЕЗ.Вставить("КорреспонденцияРеглСписаниеЗапасовУтилизация",ПоУмолчанию.КорреспонденцияРеглСписаниеЗапасовУтилизация);
	РЕЗ.Вставить("ПодразделениеСписаниеЗапасовУтилизация",ПоУмолчанию.ПодразделениеСписаниеЗапасовУтилизация);
	РЕЗ.Вставить("КорреспонденцияРеглСписаниеЗапасовИнвентаризация",ПоУмолчанию.КорреспонденцияРеглСписаниеЗапасовИнвентаризация);
	РЕЗ.Вставить("ПодразделениеСписаниеЗапасовИнвентаризация",ПоУмолчанию.ПодразделениеСписаниеЗапасовИнвентаризация);
	//РЕЗ.Вставить("СчетУчетаКасса",ПоУмолчанию.СчетУчетаКасса);
	РЕЗ.Вставить("СчетУчетаРеглКасса",ПоУмолчанию.СчетУчетаРеглКасса);
	//РЕЗ.Вставить("СчетУчетаБанковскийСчет",ПоУмолчанию.СчетУчетаБанковскийСчет);
	РЕЗ.Вставить("СчетУчетаРеглБанковскийСчет",ПоУмолчанию.СчетУчетаРеглБанковскийСчет);
	//РЕЗ.Вставить("КассаККМ",ПоУмолчанию.УдалитьКассаККМ);
	//РЕЗ.Вставить("ПодразделениеКассаККМ",ПоУмолчанию.УдалитьПодразделениеКассаККМ);
	//РЕЗ.Вставить("СтатьяКассаККМ",ПоУмолчанию.УдалитьСтатьяКассаККМ);
	РЕЗ.Вставить("СтатьиДвиженияДенежныхСредств_ПеремещениеДС",ПоУмолчанию.СтатьиДвиженияДенежныхСредств_ПеремещениеДС);
	
	Если НЕ ЗначениеЗаполнено(РЕЗ.Автор)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.Организация)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.ВалютаРасчетов)
		//ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.СчетУчетаАвансовПокупателя)
		//ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.СчетУчетаАвансовПоставщику)
		//ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.СчетУчетаРасчетовСПокупателем)
		//ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.СчетУчетаРасчетовСПоставщиком)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.СчетУчетаАвансовПокупателяРегл)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.СчетУчетаАвансовПоставщикуРегл)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.СчетУчетаРасчетовСПокупателемРегл)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.СчетУчетаРасчетовСПоставщикомРегл)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.КорреспонденцияРеглОприходованиеЗапасов)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.КорреспонденцияРеглОприходованиеЗапасовИнвентаризация)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.КорреспонденцияРеглСписаниеЗапасов)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.КорреспонденцияРеглСписаниеЗапасовУниформа)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.ПодразделениеСписаниеЗапасовУниформа)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.КорреспонденцияРеглСписаниеЗапасовУтилизация)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.ПодразделениеСписаниеЗапасовУтилизация)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.КорреспонденцияРеглСписаниеЗапасовИнвентаризация)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.ПодразделениеСписаниеЗапасовИнвентаризация)
		//ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.СчетУчетаКасса)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.СчетУчетаРеглКасса)
		//ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.СчетУчетаБанковскийСчет)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.СчетУчетаРеглБанковскийСчет)
		//ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.КассаККМ)
		//ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.ПодразделениеКассаККМ)
		//ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.СтатьяКассаККМ)
		ИЛИ НЕ ЗначениеЗаполнено(РЕЗ.СтатьиДвиженияДенежныхСредств_ПеремещениеДС)
		Тогда
		РЕЗ.ВсеПравильно = ЛОЖЬ;
	КонецЕсли;	
	
	Возврат РЕЗ;
КонецФункции // ()

Функция НайтиВалюту(Currency,СтруктураДляВозврата)
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	РЕЗ.Результат = ЛОЖЬ;
	РЕЗ.Описание = "Currency not found";
	
	Если ТипЗНЧ(Currency)=Тип("Соответствие") Тогда
		
		Code = Currency.Получить("Code");
		Description = Currency.Получить("Description");
		
		Если ЗначениеЗаполнено(Description) Тогда
			
			РЕЗ.ВозвращаемоеЗначение = Description;
			
			ОписаниеВалютыСтрока = СокрЛП(Description);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Валюты.Ссылка
			|ИЗ
			|	Справочник.Валюты КАК Валюты
			|ГДЕ
			|	(Валюты.Наименование = &ОписаниеВалютыСтрока
			|			ИЛИ Валюты.СимвольноеПредставление = &ОписаниеВалютыСтрока)";
			
			Запрос.УстановитьПараметр("ОписаниеВалютыСтрока", ОписаниеВалютыСтрока);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				РЕЗ.Результат = ИСТИНА;
				РЕЗ.ВозвращаемоеЗначение = ВыборкаДетальныеЗаписи.Ссылка;
				РЕЗ.Описание = "";
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ РЕЗ.Результат Тогда
		
			Если ЗначениеЗаполнено(Code) Тогда
				
				РЕЗ.ВозвращаемоеЗначение = Code;
				
				КодВалютыЧисло = 0;
				Попытка
					КодВалютыЧисло = ЧИСЛО(Code);
				Исключение
				КонецПопытки;
				
				Если КодВалютыЧисло>0 Тогда
					КодВалютыСтрока = СокрЛП(Строка(КодВалютыЧисло));
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	Валюты.Ссылка
					|ИЗ
					|	Справочник.Валюты КАК Валюты
					|ГДЕ
					|	Валюты.Код = &КодВалютыСтрока";
					
					Запрос.УстановитьПараметр("КодВалютыСтрока", КодВалютыСтрока);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						РЕЗ.Результат = ИСТИНА;
						РЕЗ.ВозвращаемоеЗначение = ВыборкаДетальныеЗаписи.Ссылка;
						РЕЗ.Описание = "";
					КонецЦикла;
				КонецЕсли;
			
			КонецЕсли;
		
		КонецЕсли;
		
	ИначеЕсли ТипЗНЧ(Currency)=Тип("Строка") Тогда
		
		РЕЗ.ВозвращаемоеЗначение = Currency;
		
		ОписаниеВалютыСтрока = СокрЛП(Currency);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Валюты.Ссылка
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	(Валюты.Наименование = &ОписаниеВалютыСтрока
		|			ИЛИ Валюты.СимвольноеПредставление = &ОписаниеВалютыСтрока)";
		
		Запрос.УстановитьПараметр("ОписаниеВалютыСтрока", ОписаниеВалютыСтрока);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			РЕЗ.Результат = ИСТИНА;
			РЕЗ.ВозвращаемоеЗначение = ВыборкаДетальныеЗаписи.Ссылка;
			РЕЗ.Описание = "";
		КонецЦикла;
		
		Если НЕ РЕЗ.Результат Тогда
			
			КодВалютыЧисло = 0;
			Попытка
				КодВалютыЧисло = ЧИСЛО(Currency);
			Исключение
			КонецПопытки;
			
			Если КодВалютыЧисло>0 Тогда
				КодВалютыСтрока = СокрЛП(Строка(КодВалютыЧисло));
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	Валюты.Ссылка
				|ИЗ
				|	Справочник.Валюты КАК Валюты
				|ГДЕ
				|	Валюты.Код = &КодВалютыСтрока";
				
				Запрос.УстановитьПараметр("КодВалютыСтрока", КодВалютыСтрока);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					РЕЗ.Результат = ИСТИНА;
					РЕЗ.ВозвращаемоеЗначение = ВыборкаДетальныеЗаписи.Ссылка;
					РЕЗ.Описание = "";
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗНЧ(Currency)=Тип("Число") Тогда
		
		РЕЗ.ВозвращаемоеЗначение = Currency;
		
		КодВалютыЧисло = 0;
		Попытка
			КодВалютыЧисло = ЧИСЛО(Currency);
		Исключение
		КонецПопытки;
		
		Если КодВалютыЧисло>0 Тогда
			КодВалютыСтрока = СокрЛП(Строка(КодВалютыЧисло));
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Валюты.Ссылка
			|ИЗ
			|	Справочник.Валюты КАК Валюты
			|ГДЕ
			|	Валюты.Код = &КодВалютыСтрока";
			
			Запрос.УстановитьПараметр("КодВалютыСтрока", КодВалютыСтрока);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				РЕЗ.Результат = ИСТИНА;
				РЕЗ.ВозвращаемоеЗначение = ВыборкаДетальныеЗаписи.Ссылка;
				РЕЗ.Описание = "";
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;

	Возврат РЕЗ;
КонецФункции // ()

Функция НайтиКонтрагентаПоИНН(ТекИНН) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = НЕОПРЕДЕЛЕНО;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	НЕ Контрагенты.ЭтоГруппа
	               |	И Контрагенты.ИНН = &ТекПараметр";
	
	Запрос.УстановитьПараметр("ТекПараметр", ТекИНН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;	
		
	Возврат РЕЗ;
КонецФункции // ()

Функция СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,ЭтоПокупатель=ЛОЖЬ,ЭтоПоставщик=ЛОЖЬ) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = НЕОПРЕДЕЛЕНО;
	
	Попытка
		Если НЕ ТипЗНЧ(ТекКонтрагент.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
			Возврат РЕЗ;
		КонецЕсли;
	Исключение
		Возврат РЕЗ;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ТекВалюта) Тогда
	    ВалютаРасчетов = ТекВалюта;
	Иначе
		ВалютаРасчетов = НастройкиПоУмолчанию.ВалютаРасчетов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ЗапросТекст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.ВалютаРасчетов = &ВалютаРасчетов
		|	И НЕ ДоговорыКонтрагентов.Неактивен
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	Если Константы.ИспользоватьВидыДоговоров.Получить() Тогда
		Если ЭтоПокупатель Тогда
			ЗапросТекст = ЗапросТекст + "	И ДоговорыКонтрагентов.Покупатель";
		КонецЕсли;
		Если ЭтоПоставщик Тогда
			ЗапросТекст = ЗапросТекст + "	И ДоговорыКонтрагентов.Поставщик";
		КонецЕсли;		
	КонецЕсли;	

	
	Запрос.Текст = ЗапросТекст;
	
	Запрос.УстановитьПараметр("Владелец", ТекКонтрагент.Ссылка);
	Запрос.УстановитьПараметр("ВалютаРасчетов", ВалютаРасчетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если НЕ РЕЗ = НЕОПРЕДЕЛЕНО Тогда
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	ТекДоговор.ОбменДанными.Загрузка = ИСТИНА;
	
	ТекДоговор.УстановитьНовыйКод();
	
	ЗаполнитьЗначенияСвойств(ТекДоговор,НастройкиПоУмолчанию);
	
	ТекДоговор.Владелец = ТекКонтрагент.Ссылка;
	ТекДоговор.Наименование = "Default_"+СокрЛП(ВалютаРасчетов.Наименование);
	ТекДоговор.Покупатель = ИСТИНА;
	ТекДоговор.Поставщик = ИСТИНА;
	ТекДоговор.ВалютаРасчетов = ВалютаРасчетов;
	
	Попытка
		ТекДоговор.Записать();
		РЕЗ = ТекДоговор.Ссылка;
	Исключение
		РЕЗ = НЕОПРЕДЕЛЕНО;
	КонецПопытки;
		
	Возврат РЕЗ;
КонецФункции // ()

Функция НайтиСклад(КодСклада) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = НЕОПРЕДЕЛЕНО;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтруктурныеЕдиницы.Ссылка
	               |ИЗ
	               |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	               |ГДЕ
	               |	СтруктурныеЕдиницы.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", КодСклада);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат РЕЗ;
КонецФункции

Функция НайтиНомекклатуруПоАртикулу(ТекАртикул) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = НЕОПРЕДЕЛЕНО;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Номенклатура.Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Артикул = &ТекПараметр
	               |	И НЕ Номенклатура.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("ТекПараметр", ТекАртикул);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;	
		
	Возврат РЕЗ;
КонецФункции // ()

Функция НайтиСтавкуНДС(VatValue)
	ПЕРЕМ РЕЗ;
	
	РЕЗ = НЕОПРЕДЕЛЕНО;

	Если НЕ VatValue = НЕОПРЕДЕЛЕНО Тогда
		Если VatValue = "18" ИЛИ VatValue = 18 Тогда
			РЕЗ = Справочники.СтавкиНДС.НДС18;
		ИначеЕсли VatValue = "0" ИЛИ VatValue = "00" ИЛИ VatValue = 0 Тогда
			РЕЗ = Справочники.СтавкиНДС.НДС0;
		Иначе
			VatValue = СокрЛП(Строка(VatValue));
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	СтавкиНДС.Ссылка
			|ИЗ
			|	Справочник.СтавкиНДС КАК СтавкиНДС
			|ГДЕ
			|	СтавкиНДС.Наименование ПОДОБНО &Наименование";
			
			Запрос.УстановитьПараметр("Наименование", VatValue+"%");
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				
				Запрос.УстановитьПараметр("Наименование", VatValue);
				
				Запрос.Выполнить();
				
				Если РезультатЗапроса.Пустой() Тогда
					
					РЕЗ = Справочники.СтавкиНДС.ПустаяСсылка();
					
				Иначе
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						РЕЗ = ВыборкаДетальныеЗаписи.Ссылка;
					КонецЦикла;
					
				КонецЕсли;
			
			Иначе	
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					РЕЗ = ВыборкаДетальныеЗаписи.Ссылка;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

	Возврат РЕЗ;
КонецФункции // ()

Функция ПолучитьСтруктураДляВозврата(СтруктураДляВозврата=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;

	Если НЕ ТипЗНЧ(СтруктураДляВозврата)=Тип("Структура") Тогда
		РЕЗ = Новый Структура("Результат,ВозвращаемоеЗначение,Описание",ИСТИНА,"","");
	Иначе
		РЕЗ = СтруктураДляВозврата;
		РЕЗ.Вставить("Результат",ИСТИНА);
		РЕЗ.Вставить("ВозвращаемоеЗначение",НЕОПРЕДЕЛЕНО);
		РЕЗ.Вставить("Описание","");
	КонецЕсли;

	Возврат РЕЗ;
КонецФункции // ()

Функция ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден,ДопПараметр=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	// Ищем существующие
	Запрос = Новый Запрос;
	Запрос.Текст = СтрокаТекстаЗапроса;
	
	Запрос.УстановитьПараметр("ТекПараметр", ЗначениеПараметра);
	Если НЕ ДопПараметр=НЕОПРЕДЕЛЕНО Тогда
		Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
		РЕЗ.Описание = СтрокаОтветаОбъектНеНайден;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КонецЦикла;
		//ТекОбъект.ОбменДанными.Загрузка = ИСТИНА;
		
		НачатьТранзакцию();
		Попытка
			//ТекОбъект.Записать();
			ТекОбъект.УстановитьПометкуУдаления(ИСТИНА);
			
			ЗафиксироватьТранзакцию();
			
			РЕЗ.Результат = ИСТИНА;
			РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
			РЕЗ.Описание = СтрокаОтветаДляУдачногоРезультата;
		Исключение
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
			РЕЗ.Описание = "Internal processing error";		
		КонецПопытки;		
		
	КонецЕсли;	
	
	Возврат РЕЗ;
КонецФункции

Функция ПолучитьСтруктуруОшибки()
	Возврат Новый Структура("IsSuccess,Message,ProductOptionCode,Value",ЛОЖЬ,"","","");
КонецФункции // ()

Функция ПопыткаПровестиДокумент(ТекДок,Ref,СтруктураДляВозврата,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции=ЛОЖЬ,ЗаписыватьПриОшибках=ЛОЖЬ,ОписаниеДляМассиваОшибок="", НеПроводить=ЛОЖЬ)
	//Если НЕ ЗначениеЗаполнено(СтруктураДляВозврата) Тогда
	//	РЕЗ = ПолучитьСтруктураДляВозврата(НЕОПРЕДЕЛЕНО);	
	//КонецЕсли;
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Если НеПроводить Тогда
		
		Попытка
			Если МассивОшибок.Количество()>0 Тогда
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = МассивОшибок;
				Если СтрДлина(СокрЛП(ОписаниеДляМассиваОшибок))>0 Тогда
					РЕЗ.Описание = ОписаниеДляМассиваОшибок;
				Иначе	
					РЕЗ.Описание = "Internal processing error";
				КонецЕсли;
				
				Если ЗаписыватьПриОшибках Тогда
					ТекДок.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
			Иначе
				ТекДок.Записать(РежимЗаписиДокумента.Запись);
				
				РЕЗ.Результат = ИСТИНА;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = ОписаниеУспешногоПроведения;
			КонецЕсли;
			
			Если ФиксироватьТранзакции Тогда
				ЗафиксироватьТранзакцию();
			КонецЕсли;
		Исключение
			РЕЗ.Результат = ЛОЖЬ;
			Если МассивОшибок.Количество()>0 Тогда
				РЕЗ.ВозвращаемоеЗначение = МассивОшибок;
			Иначе
				РЕЗ.ВозвращаемоеЗначение = Ref;
			КонецЕсли;
			РЕЗ.Описание = "Internal processing error";
			
			Если ФиксироватьТранзакции Тогда
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
			КонецЕсли;
		КонецПопытки;
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	Попытка
		Если МассивОшибок.Количество()>0 Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = МассивОшибок;
			Если СтрДлина(СокрЛП(ОписаниеДляМассиваОшибок))>0 Тогда
				РЕЗ.Описание = ОписаниеДляМассиваОшибок;
			Иначе	
				РЕЗ.Описание = "Internal processing error";
			КонецЕсли;
			
			Если ЗаписыватьПриОшибках Тогда
				ТекДок.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		Иначе
			ТекДок.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			
			РЕЗ.Результат = ИСТИНА;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = ОписаниеУспешногоПроведения;
		КонецЕсли;
		
		Если ФиксироватьТранзакции Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	Исключение
		РЕЗ.Результат = ЛОЖЬ;
		Если МассивОшибок.Количество()>0 Тогда
			РЕЗ.ВозвращаемоеЗначение = МассивОшибок;
		Иначе
			РЕЗ.ВозвращаемоеЗначение = Ref;
		КонецЕсли;
		РЕЗ.Описание = "Internal processing error";
		
		Если ФиксироватьТранзакции Тогда
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
		КонецЕсли;
	КонецПопытки;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция ПолучитьМассивОшибокПоОстаткам(ТекДок,ТекСтруктурнаяЕдиница,РЕЗ,МассивОшибок)
	Если НЕ ЗначениеЗаполнено(РЕЗ) Тогда
		РЕЗ = ПолучитьСтруктураДляВозврата(НЕОПРЕДЕЛЕНО);
		РЕЗ.Результат = ИСТИНА;
	КонецЕсли;
		
	Если НЕ (ТипЗНЧ(МассивОшибок)=Тип("Массив")) Тогда		
		МассивОшибок = Новый Массив();
	КонецЕсли;
	
	Если ТекСтруктурнаяЕдиница.КонтролироватьОстатки Тогда
		РЕЗ.Результат = ИСТИНА;
		Возврат РЕЗ;
	КонецЕсли;
	
	ТабЗапасы = ТекДок.Запасы.Выгрузить();
	ТабЗапасы.Свернуть("Номенклатура,ЕдиницаИзмерения","Количество");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабЗапасы.Номенклатура КАК Номенклатура,
	|	ТабЗапасы.Количество КАК Количество
	|ПОМЕСТИТЬ ТАБ_Запасы
	|ИЗ
	|	&ТабЗапасы КАК ТабЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапасыНаСкладахОстатки.Номенклатура,
	|	ЗапасыНаСкладахОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ ТАБ_Остатки
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|			&ТекДата,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ТАБ_Запасы.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ТАБ_Запасы)) КАК ЗапасыНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБ_Запасы.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТАБ_Остатки.КоличествоОстаток, 0) - ТАБ_Запасы.Количество КАК Остаток
	|ИЗ
	|	ТАБ_Запасы КАК ТАБ_Запасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБ_Остатки КАК ТАБ_Остатки
	|		ПО ТАБ_Запасы.Номенклатура = ТАБ_Остатки.Номенклатура";
	
	Запрос.УстановитьПараметр("Организация", ТекДок.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ТекСтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТабЗапасы", ТабЗапасы);
	Запрос.УстановитьПараметр("ТекДата", ТекДок.МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Остаток<0 Тогда
			СтруктураОшибки = ПолучитьСтруктуруОшибки();
			
			СтруктураОшибки.Message = "Not enough balances in the departure warehouse";
			СтруктураОшибки.Вставить("ProductOptionCode",ВыборкаДетальныеЗаписи.Номенклатура.Артикул);
			СтруктураОшибки.Вставить("Value",ВыборкаДетальныеЗаписи.Номенклатура.Артикул);
			
			МассивОшибок.Добавить(СтруктураОшибки);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = МассивОшибок;
		РЕЗ.Описание = "Not enough balances in the departure warehouse";
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция НайтиИлиСоздатьКассу(СтруктураДляВозврата,ТекНаименование,ТекВалюта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ТекНаименование;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	ТекКассаСсылка = НЕОПРЕДЕЛЕНО;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Кассы.Ссылка
		|ИЗ
		|	Справочник.Кассы КАК Кассы
		|ГДЕ
		|	Кассы.Наименование = &Наименование
		|	И Кассы.ВалютаПоУмолчанию = &ВалютаПоУмолчанию";
	
	Запрос.УстановитьПараметр("ВалютаПоУмолчанию", ТекВалюта);
	Запрос.УстановитьПараметр("Наименование", ТекНаименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекКассаСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекКассаСсылка) Тогда
		ТекКасса = ТекКассаСсылка.ПолучитьОбъект();
		ТекКасса.ОбменДанными.Загрузка = ИСТИНА;
		Если ТекКасса.ПометкаУдаления Тогда
			ТекКасса.Записать(РежимЗаписиДокумента.Запись);
			ТекКасса.УстановитьПометкуУдаления(ЛОЖЬ);	
		КонецЕсли;		
	Иначе
		ТекКасса = Справочники.Кассы.СоздатьЭлемент();
		ТекКасса.ОбменДанными.Загрузка = ИСТИНА;
		
		ТекКасса.Наименование = ТекНаименование;
		ТекКасса.ВалютаПоУмолчанию = ТекВалюта;
		//ТекКасса.СчетУчета = НастройкиПоУмолчанию.СчетУчетаКасса;
		ТекКасса.СчетУчетаРегл = НастройкиПоУмолчанию.СчетУчетаРеглКасса;
		
		ТекКасса.Записать();
		
		ТекКассаСсылка = ТекКасса.Ссылка;
	КонецЕсли;
	
	РЕЗ.Результат = ИСТИНА;
	РЕЗ.ВозвращаемоеЗначение = ТекКассаСсылка;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция НайтиИлиСоздатьБанковскийСчет(СтруктураДляВозврата,ТекНомер,ТекБанкКод,ТекВалюта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ТекНомер+", "+ТекБанкКод;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	ТекБанк = НЕОПРЕДЕЛЕНО;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Банки.Ссылка
		|ИЗ
		|	Справочник.Банки КАК Банки
		|ГДЕ
		|	Банки.Код = &Код
		|	И НЕ Банки.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Код", ТекБанкКод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекБанк = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	Если ТекБанк = НЕОПРЕДЕЛЕНО Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ТекБанкКод;
		РЕЗ.Описание = "Bank not found";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ТекБанковскийСчетСсылка = НЕОПРЕДЕЛЕНО;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БанковскиеСчета.Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.НомерСчета = &НомерСчета
		|	И БанковскиеСчета.ВалютаДенежныхСредств = &ВалютаДенежныхСредств
		|	И БанковскиеСчета.Банк = &Банк";
	
	Запрос.УстановитьПараметр("ВалютаДенежныхСредств", ТекВалюта);
	Запрос.УстановитьПараметр("НомерСчета", ТекНомер);
	Запрос.УстановитьПараметр("Банк", ТекБанк);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекБанковскийСчетСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекБанковскийСчетСсылка) Тогда
		ТекБанковскийСчет = ТекБанковскийСчетСсылка.ПолучитьОбъект();
		ТекБанковскийСчет.ОбменДанными.Загрузка = ИСТИНА;
		Если ТекБанковскийСчет.ПометкаУдаления Тогда
			ТекБанковскийСчет.Записать(РежимЗаписиДокумента.Запись);
			ТекБанковскийСчет.УстановитьПометкуУдаления(ЛОЖЬ);	
		КонецЕсли;		
	Иначе
		ТекБанковскийСчет = Справочники.БанковскиеСчета.СоздатьЭлемент();
		ТекБанковскийСчет.ОбменДанными.Загрузка = ИСТИНА;
		
		ТекБанковскийСчет.НомерСчета = ТекНомер;
		ТекБанковскийСчет.Банк = ТекБанк.Ссылка;
		ТекБанковскийСчет.ВалютаДенежныхСредств = ТекВалюта;
		//ТекБанковскийСчет.СчетУчета = НастройкиПоУмолчанию.СчетУчетаБанковскийСчет;
		ТекБанковскийСчет.СчетУчетаРегл = НастройкиПоУмолчанию.СчетУчетаРеглБанковскийСчет;
		ТекБанковскийСчет.ВидСчета = "Расчетный";
		
		ТекБанковскийСчет.Владелец = НастройкиПоУмолчанию.Организация;
		
		НаименованиеБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекБанковскийСчет.Банк, "Наименование");
		ТекБанковскийСчет.Наименование = Лев(СокрЛп(ТекБанковскийСчет.НомерСчета) + ?(ЗначениеЗаполнено(НаименованиеБанка), ", в " + НаименованиеБанка, ""), 100);
		
		ТекБанковскийСчет.Записать();
		
		ТекБанковскийСчетСсылка = ТекБанковскийСчет.Ссылка;
	КонецЕсли;
	
	РЕЗ.Результат = ИСТИНА;
	РЕЗ.ВозвращаемоеЗначение = ТекБанковскийСчетСсылка;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция ПолучитьОстаткиТовараПоБухСчетам(ТекТовар,ТекСклад,ТекДата=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	Перем РЕЗ;
	
	РЕЗ = Новый Структура("Сумма,Количество,Цена",0,0,0);
	
	Если НЕ ТипЗНЧ(ТекТовар)=Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат РЕЗ;
	КонецЕсли;
	
	Если НЕ ТипЗНЧ(ТекДата)=Тип("Дата") Тогда
		ТекДата = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекТовар.СчетУчетаЗапасовРегл) Тогда
		Возврат РЕЗ;
	КонецЕсли;
	
	Если ТипЗНЧ(ТекСклад)=Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда
	    // Ищем по остаткам
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма,
			|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
			|	ВЫБОР
			|		КОГДА ХозрасчетныйОстатки.КоличествоОстаток <> 0
			|			ТОГДА ХозрасчетныйОстатки.СуммаОстаток / ХозрасчетныйОстатки.КоличествоОстаток
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Цена
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(
			|			&Дата1,
			|			Счет = &Счет,
			|			,
			|			Субконто1 = &Субконто1
			|				И Субконто2 = &Субконто2) КАК ХозрасчетныйОстатки";
		
		Запрос.УстановитьПараметр("Дата1", ТекДата);
		Запрос.УстановитьПараметр("Субконто1", ТекСклад);
		Запрос.УстановитьПараметр("Субконто2", ТекТовар);
		Запрос.УстановитьПараметр("Счет", ТекТовар.СчетУчетаЗапасовРегл);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(РЕЗ,ВыборкаДетальныеЗаписи);
			КонецЦикла;
			
		КонецЕсли;
		
		Если РЕЗ.Цена<=0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма,
			|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
			|	ВЫБОР
			|		КОГДА ХозрасчетныйОстатки.КоличествоОстаток <> 0
			|			ТОГДА ХозрасчетныйОстатки.СуммаОстаток / ХозрасчетныйОстатки.КоличествоОстаток
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Цена
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата1, Счет = &Счет, , Субконто2 = &Субконто2) КАК ХозрасчетныйОстатки";
			
			Запрос.УстановитьПараметр("Дата1", ТекДата);
			Запрос.УстановитьПараметр("Субконто2", ТекТовар);
			Запрос.УстановитьПараметр("Счет", ТекТовар.СчетУчетаЗапасовРегл);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(РЕЗ,ВыборкаДетальныеЗаписи);
			КонецЦикла;
			
		КонецЕсли;
		
		// Ищем по оборотам
		Если РЕЗ.Цена<=0 Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
			|	ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт,
			|	ВЫБОР
			|		КОГДА ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт > 0
			|				И ХозрасчетныйОстаткиИОбороты.СуммаОборотДт > 0
			|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаОборотДт / ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Цена
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
			|			,
			|			&Дата1,
			|			,
			|			,
			|			Счет = &Счет,
			|			,
			|			Субконто1 = &Субконто1
			|				И Субконто2 = &Субконто2) КАК ХозрасчетныйОстаткиИОбороты";
			
			Запрос.УстановитьПараметр("Дата1", ТекДата);
			Запрос.УстановитьПараметр("Субконто1", ТекСклад);
			Запрос.УстановитьПараметр("Субконто2", ТекТовар);
			Запрос.УстановитьПараметр("Счет", ТекТовар.СчетУчетаЗапасовРегл);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(РЕЗ,ВыборкаДетальныеЗаписи);
				КонецЦикла;
				
			КонецЕсли;
		
		КонецЕсли;
		
		Если РЕЗ.Цена<=0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
			|	ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт,
			|	ВЫБОР
			|		КОГДА ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт > 0
			|				И ХозрасчетныйОстаткиИОбороты.СуммаОборотДт > 0
			|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаОборотДт / ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Цена
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(, &Дата1, , , Счет = &Счет, , Субконто2 = &Субконто2) КАК ХозрасчетныйОстаткиИОбороты";
			
			Запрос.УстановитьПараметр("Дата1", ТекДата);
			Запрос.УстановитьПараметр("Субконто2", ТекТовар);
			Запрос.УстановитьПараметр("Счет", ТекТовар.СчетУчетаЗапасовРегл);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(РЕЗ,ВыборкаДетальныеЗаписи);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;

		// Ищем по остаткам в группе
		Если РЕЗ.Цена<=0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма,
			|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
			|	ВЫБОР
			|		КОГДА ХозрасчетныйОстатки.КоличествоОстаток <> 0
			|			ТОГДА ХозрасчетныйОстатки.СуммаОстаток / ХозрасчетныйОстатки.КоличествоОстаток
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Цена
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(
			|			&Дата1,
			|			Счет = &Счет,
			|			,
			|			Субконто1 = &Субконто1
			|				И Субконто2.Родитель = ВЫРАЗИТЬ(&Субконто2 КАК Справочник.Номенклатура).Родитель) КАК ХозрасчетныйОстатки";
			
			Запрос.УстановитьПараметр("Дата1", ТекДата);
			Запрос.УстановитьПараметр("Субконто1", ТекСклад);
			Запрос.УстановитьПараметр("Субконто2", ТекТовар);
			Запрос.УстановитьПараметр("Счет", ТекТовар.СчетУчетаЗапасовРегл);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(РЕЗ,ВыборкаДетальныеЗаписи);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если РЕЗ.Цена<=0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма,
			|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
			|	ВЫБОР
			|		КОГДА ХозрасчетныйОстатки.КоличествоОстаток <> 0
			|			ТОГДА ХозрасчетныйОстатки.СуммаОстаток / ХозрасчетныйОстатки.КоличествоОстаток
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Цена
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(
			|			&Дата1,
			|			Счет = &Счет,
			|			,
			|			Субконто2.Родитель = ВЫРАЗИТЬ(&Субконто2 КАК Справочник.Номенклатура).Родитель) КАК ХозрасчетныйОстатки";
			
			Запрос.УстановитьПараметр("Дата1", ТекДата);
			Запрос.УстановитьПараметр("Субконто2", ТекТовар);
			Запрос.УстановитьПараметр("Счет", ТекТовар.СчетУчетаЗапасовРегл);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(РЕЗ,ВыборкаДетальныеЗаписи);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Ищем по оборотам в группе
		Если РЕЗ.Цена<=0 Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
			|	ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт,
			|	ВЫБОР
			|		КОГДА ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт > 0
			|				И ХозрасчетныйОстаткиИОбороты.СуммаОборотДт > 0
			|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаОборотДт / ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Цена
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
			|			,
			|			&Дата1,
			|			,
			|			,
			|			Счет = &Счет,
			|			,
			|			Субконто1 = &Субконто1
			|				И Субконто2.Родитель = ВЫРАЗИТЬ(&Субконто2 КАК Справочник.Номенклатура).Родитель) КАК ХозрасчетныйОстаткиИОбороты";
			
			Запрос.УстановитьПараметр("Дата1", ТекДата);
			Запрос.УстановитьПараметр("Субконто1", ТекСклад);
			Запрос.УстановитьПараметр("Субконто2", ТекТовар);
			Запрос.УстановитьПараметр("Счет", ТекТовар.СчетУчетаЗапасовРегл);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(РЕЗ,ВыборкаДетальныеЗаписи);
				КонецЦикла;
				
			КонецЕсли;
		
		КонецЕсли;
		
		Если РЕЗ.Цена<=0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
			|	ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт,
			|	ВЫБОР
			|		КОГДА ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт > 0
			|				И ХозрасчетныйОстаткиИОбороты.СуммаОборотДт > 0
			|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаОборотДт / ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Цена
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(, &Дата1, , , Счет = &Счет, , Субконто2.Родитель = ВЫРАЗИТЬ(&Субконто2 КАК Справочник.Номенклатура).Родитель) КАК ХозрасчетныйОстаткиИОбороты";
			
			Запрос.УстановитьПараметр("Дата1", ТекДата);
			Запрос.УстановитьПараметр("Субконто2", ТекТовар);
			Запрос.УстановитьПараметр("Счет", ТекТовар.СчетУчетаЗапасовРегл);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(РЕЗ,ВыборкаДетальныеЗаписи);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		// Ищем по остаткам
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма,
			|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
			|	ВЫБОР
			|		КОГДА ХозрасчетныйОстатки.КоличествоОстаток <> 0
			|			ТОГДА ХозрасчетныйОстатки.СуммаОстаток / ХозрасчетныйОстатки.КоличествоОстаток
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Цена
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата1, Счет = &Счет, , Субконто2 = &Субконто2) КАК ХозрасчетныйОстатки";
		
		Запрос.УстановитьПараметр("Дата1", ТекДата);
		Запрос.УстановитьПараметр("Субконто2", ТекТовар);
		Запрос.УстановитьПараметр("Счет", ТекТовар.СчетУчетаЗапасовРегл);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(РЕЗ,ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
		// Ищем по оборотам
		Если РЕЗ.Цена<=0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
			|	ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт,
			|	ВЫБОР
			|		КОГДА ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт > 0
			|				И ХозрасчетныйОстаткиИОбороты.СуммаОборотДт > 0
			|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаОборотДт / ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Цена
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(, &Дата1, , , Счет = &Счет, , Субконто2 = &Субконто2) КАК ХозрасчетныйОстаткиИОбороты";
			
			Запрос.УстановитьПараметр("Дата1", ТекДата);
			Запрос.УстановитьПараметр("Субконто2", ТекТовар);
			Запрос.УстановитьПараметр("Счет", ТекТовар.СчетУчетаЗапасовРегл);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(РЕЗ,ВыборкаДетальныеЗаписи);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Ищем по остаткам в группе
		Если РЕЗ.Цена<=0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма,
			|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
			|	ВЫБОР
			|		КОГДА ХозрасчетныйОстатки.КоличествоОстаток <> 0
			|			ТОГДА ХозрасчетныйОстатки.СуммаОстаток / ХозрасчетныйОстатки.КоличествоОстаток
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Цена
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(
			|			&Дата1,
			|			Счет = &Счет,
			|			,
			|			Субконто2.Родитель = ВЫРАЗИТЬ(&Субконто2 КАК Справочник.Номенклатура).Родитель) КАК ХозрасчетныйОстатки";
			
			Запрос.УстановитьПараметр("Дата1", ТекДата);
			Запрос.УстановитьПараметр("Субконто2", ТекТовар);
			Запрос.УстановитьПараметр("Счет", ТекТовар.СчетУчетаЗапасовРегл);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(РЕЗ,ВыборкаДетальныеЗаписи);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Ищем по оборотам в группе
		Если РЕЗ.Цена<=0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
			|	ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт,
			|	ВЫБОР
			|		КОГДА ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт > 0
			|				И ХозрасчетныйОстаткиИОбороты.СуммаОборотДт > 0
			|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаОборотДт / ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Цена
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(, &Дата1, , , Счет = &Счет, , Субконто2.Родитель = ВЫРАЗИТЬ(&Субконто2 КАК Справочник.Номенклатура).Родитель) КАК ХозрасчетныйОстаткиИОбороты";
			
			Запрос.УстановитьПараметр("Дата1", ТекДата);
			Запрос.УстановитьПараметр("Субконто2", ТекТовар);
			Запрос.УстановитьПараметр("Счет", ТекТовар.СчетУчетаЗапасовРегл);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(РЕЗ,ВыборкаДетальныеЗаписи);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция ПолучитьНаправлениеДеятельности(PartnerType,СтруктураДляВозврата) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	НаправлениеДеятельности = НЕОПРЕДЕЛЕНО;
	
	ПоУмолчанию = Справочники.ПараметрыДляОбменаДаннымиРозницаHTTP.ПоУмолчанию;
	
	Если ТипЗНЧ(PartnerType) = Тип("Число") Тогда
		
		Для каждого СтрНаправленияДеятельности Из ПоУмолчанию.НаправленияДеятельности Цикл
		
			Если СтрНаправленияДеятельности.НомерСтроки = PartnerType Тогда
			
				НаправлениеДеятельности = СтрНаправленияДеятельности.НаправлениеДеятельности;
				Прервать;
			
			КонецЕсли;
		
		КонецЦикла; 
		
	ИначеЕсли ТипЗНЧ(PartnerType) = Тип("Строка") Тогда
		
		Для каждого СтрНаправленияДеятельности Из ПоУмолчанию.НаправленияДеятельности Цикл
		
			Если СокрЛП(СтрНаправленияДеятельности.Наименование) = СокрЛП(PartnerType) Тогда
			
				НаправлениеДеятельности = СтрНаправленияДеятельности.НаправлениеДеятельности;
				Прервать;
			
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаправлениеДеятельности) Тогда
	
		РЕЗ.Результат = ИСТИНА;
		РЕЗ.ВозвращаемоеЗначение = НаправлениеДеятельности;
		РЕЗ.Описание = НаправлениеДеятельности.Наименование;
		
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = PartnerType;
		РЕЗ.Описание = "Incorrect partner type";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	Возврат РЕЗ;

КонецФункции // ()
#КонецОбласти

#Область ОбработатьСтандартнуюОперацию
Функция ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,Действие,СтрокаПараметра) ЭКСПОРТ
	ПЕРЕМ РЕЗ, МассивРЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	МассивРЕЗ = Новый Массив();
	
	Если ТипЗНЧ(ДеревоОбъектов) = Тип("Массив") Тогда
		
		Для каждого СтрДеревоОбъектов Из ДеревоОбъектов Цикл
		
			РЕЗ1 = ОбработатьСтандартнуюОперацию(НЕОПРЕДЕЛЕНО,СтрДеревоОбъектов,Действие,СтрокаПараметра);
			//Если НЕ РЕЗ1.Результат Тогда
			//	Возврат РЕЗ1;
			//КонецЕсли;
			МассивРЕЗ.Добавить(РЕЗ1);
		
		КонецЦикла;
		
		Возврат МассивРЕЗ;
		
	ИначеЕсли ТипЗНЧ(ДеревоОбъектов) = Тип("Соответствие") Тогда
		
		ЗначениеПараметра = ДеревоОбъектов.Получить(СтрокаПараметра);
		
		Если ЗначениеПараметра = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
			РЕЗ.Описание = "String data would be truncated (Description)";
			
		Иначе	
			
			Если Действие="СоздатьНоменклатуру" Тогда
				РЕЗ = СоздатьНоменклатуру(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьНоменклатуру" Тогда
				РЕЗ = ОбновитьНоменклатуру(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="УдалитьНоменклатуру" Тогда
				РЕЗ = УдалитьНоменклатуру(СтруктураДляВозврата,ДеревоОбъектов);
				
			ИначеЕсли Действие="СоздатьКонтрагента" Тогда
				РЕЗ = СоздатьКонтрагента(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьКонтрагента" Тогда
				РЕЗ = ОбновитьКонтрагента(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="УдалитьКонтрагента" Тогда
				РЕЗ = УдалитьКонтрагента(СтруктураДляВозврата,ДеревоОбъектов);
				
			ИначеЕсли Действие="СоздатьПриходнуюНакладную" Тогда
				РЕЗ = СоздатьПриходнуюНакладную(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьПриходнуюНакладную" Тогда
				РЕЗ = ОбновитьПриходнуюНакладную(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="УдалитьПриходнуюНакладную" Тогда
				РЕЗ = УдалитьПриходнуюНакладную(СтруктураДляВозврата,ДеревоОбъектов);
				
			ИначеЕсли Действие="СоздатьВозвратТоваровОтПокупателя" Тогда
				РЕЗ = СоздатьВозвратТоваровОтПокупателя(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьВозвратТоваровОтПокупателя" Тогда
				РЕЗ = ОбновитьВозвратТоваровОтПокупателя(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="УдалитьВозвратТоваровОтПокупателя" Тогда
				РЕЗ = УдалитьВозвратТоваровОтПокупателя(СтруктураДляВозврата,ДеревоОбъектов);
				
			ИначеЕсли Действие="СоздатьПеремещениеЗапасов" Тогда
				РЕЗ = СоздатьПеремещениеЗапасов(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьПеремещениеЗапасов" Тогда
				РЕЗ = ОбновитьПеремещениеЗапасов(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="УдалитьПеремещениеЗапасов" Тогда
				РЕЗ = УдалитьПеремещениеЗапасов(СтруктураДляВозврата,ДеревоОбъектов);
				
			ИначеЕсли Действие="СоздатьПриходныйОрдер" Тогда
				РЕЗ = СоздатьПриходныйОрдер(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьПриходныйОрдер" Тогда
				РЕЗ = ОбновитьПриходныйОрдер(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="УдалитьПриходныйОрдер" Тогда
				РЕЗ = УдалитьПриходныйОрдер(СтруктураДляВозврата,ДеревоОбъектов);
				
			ИначеЕсли Действие="СоздатьРасходныйОрдер" Тогда
				РЕЗ = СоздатьРасходныйОрдер(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьРасходныйОрдер" Тогда
				РЕЗ = ОбновитьРасходныйОрдер(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="УдалитьРасходныйОрдер" Тогда
				РЕЗ = УдалитьРасходныйОрдер(СтруктураДляВозврата,ДеревоОбъектов);
				
			ИначеЕсли Действие="СоздатьОприходованиеЗапасовИзлишки" Тогда
				РЕЗ = СоздатьОприходованиеЗапасовИзлишки(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьОприходованиеЗапасовИзлишки" Тогда
				РЕЗ = ОбновитьОприходованиеЗапасовИзлишки(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="СоздатьОприходованиеЗапасовИнвентаризация" Тогда
				РЕЗ = СоздатьОприходованиеЗапасовИнвентаризация(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьОприходованиеЗапасовИнвентаризация" Тогда
				РЕЗ = ОбновитьОприходованиеЗапасовИнвентаризация(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="УдалитьОприходованиеЗапасов" Тогда
				РЕЗ = УдалитьОприходованиеЗапасов(СтруктураДляВозврата,ДеревоОбъектов);
				
			ИначеЕсли Действие="СоздатьСписаниеЗапасовНедостача" Тогда
				РЕЗ = СоздатьСписаниеЗапасовНедостача(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьСписаниеЗапасовНедостача" Тогда
				РЕЗ = ОбновитьСписаниеЗапасовНедостача(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="СоздатьСписаниеЗапасовУниформа" Тогда
				РЕЗ = СоздатьСписаниеЗапасовУниформа(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьСписаниеЗапасовУниформа" Тогда
				РЕЗ = ОбновитьСписаниеЗапасовУниформа(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="СоздатьСписаниеЗапасовУтилизация" Тогда
				РЕЗ = СоздатьСписаниеЗапасовУтилизация(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьСписаниеЗапасовУтилизация" Тогда
				РЕЗ = ОбновитьСписаниеЗапасовУтилизация(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="СоздатьСписаниеЗапасовИнвентаризация" Тогда
				РЕЗ = СоздатьСписаниеЗапасовИнвентаризация(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьСписаниеЗапасовИнвентаризация" Тогда
				РЕЗ = ОбновитьСписаниеЗапасовИнвентаризация(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="УдалитьСписаниеЗапасов" Тогда
				РЕЗ = УдалитьСписаниеЗапасов(СтруктураДляВозврата,ДеревоОбъектов);
				
			ИначеЕсли Действие="СоздатьРасходнуюНакладную" Тогда
				РЕЗ = СоздатьРасходнуюНакладную(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьРасходнуюНакладную" Тогда
				РЕЗ = ОбновитьРасходнуюНакладную(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="УдалитьРасходнуюНакладную" Тогда
				РЕЗ = УдалитьРасходнуюНакладную(СтруктураДляВозврата,ДеревоОбъектов);
				
			ИначеЕсли Действие="СоздатьОтчетОРозничныхПродажах" Тогда
				//РЕЗ = СоздатьОтчетОРозничныхПродажах(СтруктураДляВозврата,ДеревоОбъектов);
				РЕЗ = СоздатьРасходнуюНакладную(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьОтчетОРозничныхПродажах" Тогда
				//РЕЗ = ОбновитьОтчетОРозничныхПродажах(СтруктураДляВозврата,ДеревоОбъектов);
				РЕЗ = ОбновитьРасходнуюНакладную(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="УдалитьОтчетОРозничныхПродажах" Тогда
				//РЕЗ = УдалитьОтчетОРозничныхПродажах(СтруктураДляВозврата,ДеревоОбъектов);
				РЕЗ = УдалитьРасходнуюНакладную(СтруктураДляВозврата,ДеревоОбъектов);
				
			ИначеЕсли Действие="СоздатьПеремещениеДС" Тогда
				РЕЗ = СоздатьПеремещениеДС(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="ОбновитьПеремещениеДС" Тогда
				РЕЗ = ОбновитьПеремещениеДС(СтруктураДляВозврата,ДеревоОбъектов);
			ИначеЕсли Действие="УдалитьПеремещениеДС" Тогда
				РЕЗ = УдалитьПеремещениеДС(СтруктураДляВозврата,ДеревоОбъектов);
				
			Иначе
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = "";
				РЕЗ.Описание = "Internal processing error";
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат РЕЗ;
		
	Иначе // такого быть не может
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = "";
		РЕЗ.Описание = "Internal processing error";
	
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции
#КонецОбласти

#Область Номенклатура
Функция СоздатьНоменклатуру(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	OptionCode = СоответствиеОбъекта.Получить("OptionCode");
	Description = СоответствиеОбъекта.Получить("Description");
	OriginCode = СоответствиеОбъекта.Получить("OriginCode");
	OriginDescription = СоответствиеОбъекта.Получить("OriginDescription");
	ProductType = СоответствиеОбъекта.Получить("ProductType");
	ProductTypeDescription = СоответствиеОбъекта.Получить("ProductTypeDescription");
	GenderCode = СоответствиеОбъекта.Получить("GenderCode");
	GenderDescription = СоответствиеОбъекта.Получить("GenderDescription");
	SeasonCode = СоответствиеОбъекта.Получить("SeasonCode");
	ContentCode = СоответствиеОбъекта.Получить("ContentCode");
	ContentDescription = СоответствиеОбъекта.Получить("ContentDescription");
	VatValue = СоответствиеОбъекта.Получить("VatValue");
	Category = СоответствиеОбъекта.Получить("Category");
	
	Если НЕ ЗначениеЗаполнено(OptionCode) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = OptionCode;
		РЕЗ.Описание = "Incorrect option code";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	OptionCode = СокрЛП(OptionCode);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Номенклатура.Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Артикул = &ТекПараметр
	               |	И НЕ Номенклатура.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("ТекПараметр", OptionCode);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		ГруппаТоваров = НЕОПРЕДЕЛЕНО; // Ищем группу товаров по наименованию
		Если НЕ ProductTypeDescription = НЕОПРЕДЕЛЕНО Тогда
			
			ProductTypeDescription = СокрЛП(Строка(ProductTypeDescription));
		
			Если СтрДлина(ProductTypeDescription)>0 Тогда
			
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				               |	Номенклатура.Ссылка
				               |ИЗ
				               |	Справочник.Номенклатура КАК Номенклатура
				               |ГДЕ
				               |	Номенклатура.Наименование = &ProductTypeDescription
				               |	И Номенклатура.ЭтоГруппа";
				
				Запрос.УстановитьПараметр("ProductTypeDescription", ProductTypeDescription);
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ГруппаТоваров = ВыборкаДетальныеЗаписи.Ссылка;
				КонецЦикла;
				
				Если НЕ ЗначениеЗаполнено(ГруппаТоваров) Тогда
				
					ГруппаТоваров = Справочники.Номенклатура.СоздатьГруппу();
					//ГруппаТоваров.ОбменДанными.Загрузка = ИСТИНА;
					ГруппаТоваров.Наименование = СокрЛП(ProductTypeDescription);
					Попытка
						ГруппаТоваров.Записать();
					Исключение
					КонецПопытки;
				
				КонецЕсли;
			
			КонецЕсли;
		
		КонецЕсли;
		
		//Если VatValue = НЕОПРЕДЕЛЕНО Тогда
		//	СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
		//ИначеЕсли VatValue = "18" ИЛИ VatValue = 18 Тогда
		//	СтавкаНДС = Справочники.СтавкиНДС.НДС18;
		//ИначеЕсли VatValue = "0" ИЛИ VatValue = "00" ИЛИ VatValue = 0 Тогда
		//	СтавкаНДС = Справочники.СтавкиНДС.НДС0;
		//Иначе
		//	VatValue = СокрЛП(Строка(VatValue));
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		//	               |	СтавкиНДС.Ссылка
		//	               |ИЗ
		//	               |	Справочник.СтавкиНДС КАК СтавкиНДС
		//	               |ГДЕ
		//	               |	СтавкиНДС.Наименование ПОДОБНО &Наименование";
		//	
		//	Запрос.УстановитьПараметр("Наименование", VatValue+"%");
		//	
		//	РезультатЗапроса = Запрос.Выполнить();
		//	
		//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		//	
		//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//		СтавкаНДС = ВыборкаДетальныеЗаписи.Ссылка;
		//	КонецЦикла;
		//КонецЕсли;
		
		СтавкаНДС = НайтиСтавкуНДС(VatValue);
		
		СтранаПроисхождения = Справочники.СтраныМира.ПустаяСсылка();
		Если НЕ OriginCode = НЕОПРЕДЕЛЕНО Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	СтраныМира.Ссылка
			               |ИЗ
			               |	Справочник.СтраныМира КАК СтраныМира
			               |ГДЕ
			               |	СтраныМира.КодАльфа3 = &OriginCode";
			
			Запрос.УстановитьПараметр("OriginCode", OriginCode);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СтранаПроисхождения = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЦикла;
			
		КонецЕсли;
		
		// Создаем элемент справочника Номенклатура;
		ТекНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
		ТекНоменклатура.ОбменДанными.Загрузка = ИСТИНА;
		
		ТекНоменклатура.УстановитьНовыйКод();
		ТекНоменклатура.Наименование = СокрЛП(Description);
		ТекНоменклатура.НаименованиеПолное = СокрЛП(Description);
		ТекНоменклатура.Родитель = ГруппаТоваров.Ссылка;
		ТекНоменклатура.Артикул = OptionCode;
		ТекНоменклатура.СтавкаНДС = СтавкаНДС;
		ТекНоменклатура.СтранаПроисхождения = СтранаПроисхождения;
		ТекНоменклатура.Комментарий = "Content description: " + СокрЛП(ContentDescription) + "; Content code: " + СокрЛП(ContentCode) + "; Gender description: "+СокрЛП(GenderDescription) + "; Gender code: "+СокрЛП(GenderCode) + "; Season code: "+СокрЛП(SeasonCode);
		ТекНоменклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас");
		ТекНоменклатура.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
		ТекНоменклатура.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
		ТекНоменклатура.МетодОценки = ПредопределенноеЗначение("Перечисление.МетодОценкиЗапасов.ПоСредней");
		ТекНоменклатура.СчетУчетаЗапасов = ПланыСчетов.Управленческий.СырьеИМатериалы;
		ТекНоменклатура.СчетУчетаЗатрат = ПланыСчетов.Управленческий.НезавершенноеПроизводство;
		ТекНоменклатура.СчетУчетаЗапасовРегл = ПланыСчетов.Хозрасчетный.НайтиПоКоду("1610");
		ТекНоменклатура.СчетУчетаЗатратРегл = ПланыСчетов.Хозрасчетный.НайтиПоКоду("1630");
		ТекНоменклатура.СпособПополнения = ПредопределенноеЗначение("Перечисление.СпособыПополненияЗапасов.Закупка");
		
		Если ТипЗНЧ(Category)=Тип("Строка") Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	КатегорииНоменклатуры.Ссылка
			|ИЗ
			|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
			|ГДЕ
			|	КатегорииНоменклатуры.Наименование = &Наименование";
			
			Запрос.УстановитьПараметр("Наименование", Category);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТекНоменклатура.КатегорияНоменклатуры = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЦикла;
			
			Если НЕ ЗначениеЗаполнено(ТекНоменклатура.КатегорияНоменклатуры) Тогда
			
				ТекКатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.СоздатьЭлемент();
				ТекКатегорияНоменклатуры.Наименование = Category;
				ТекКатегорияНоменклатуры.Записать();
				
				ТекНоменклатура.КатегорияНоменклатуры = ТекКатегорияНоменклатуры.Ссылка;
				
			
			КонецЕсли;
			
		Иначе
			
			ТекНоменклатура.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.БезКатегории;
			
		КонецЕсли;
		
		Попытка
			ТекНоменклатура.Записать();
			
			РЕЗ.Результат = ИСТИНА;
			РЕЗ.ВозвращаемоеЗначение = OptionCode;
			РЕЗ.Описание = "Product created successfully";
		Исключение			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = OptionCode;
			РЕЗ.Описание = "Internal processing error";			
		КонецПопытки;
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = OptionCode;
		РЕЗ.Описание = "Product already exist";		
		
	КонецЕсли;	
	
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьНоменклатуру(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	OptionCode = СоответствиеОбъекта.Получить("OptionCode");
	Description = СоответствиеОбъекта.Получить("Description");
	OriginCode = СоответствиеОбъекта.Получить("OriginCode");
	OriginDescription = СоответствиеОбъекта.Получить("OriginDescription");
	ProductType = СоответствиеОбъекта.Получить("ProductType");
	ProductTypeDescription = СоответствиеОбъекта.Получить("ProductTypeDescription");
	GenderCode = СоответствиеОбъекта.Получить("GenderCode");
	GenderDescription = СоответствиеОбъекта.Получить("GenderDescription");
	SeasonCode = СоответствиеОбъекта.Получить("SeasonCode");
	ContentCode = СоответствиеОбъекта.Получить("ContentCode");
	ContentDescription = СоответствиеОбъекта.Получить("ContentDescription");
	VatValue = СоответствиеОбъекта.Получить("VatValue");
	Category = СоответствиеОбъекта.Получить("Category");
	
	Если НЕ ЗначениеЗаполнено(OptionCode) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = OptionCode;
		РЕЗ.Описание = "Incorrect option code";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	OptionCode = СокрЛП(OptionCode);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Номенклатура.Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Артикул = &OptionCode
	               |	И НЕ Номенклатура.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("OptionCode", OptionCode);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекНоменклатура = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КонецЦикла;
		ТекНоменклатура.ОбменДанными.Загрузка = ИСТИНА;
		ТекНоменклатура.Наименование = СокрЛП(Description);
		ТекНоменклатура.НаименованиеПолное = СокрЛП(Description);
		
		ГруппаТоваров = НЕОПРЕДЕЛЕНО; // Ищем группу товаров по наименованию
		Если НЕ ProductTypeDescription = НЕОПРЕДЕЛЕНО Тогда
			
			ProductTypeDescription = СокрЛП(Строка(ProductTypeDescription));
		
			Если СтрДлина(ProductTypeDescription)>0 Тогда
			
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				               |	Номенклатура.Ссылка
				               |ИЗ
				               |	Справочник.Номенклатура КАК Номенклатура
				               |ГДЕ
				               |	Номенклатура.Наименование = &ProductTypeDescription
				               |	И Номенклатура.ЭтоГруппа";
				
				Запрос.УстановитьПараметр("ProductTypeDescription", ProductTypeDescription);
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ГруппаТоваров = ВыборкаДетальныеЗаписи.Ссылка;
				КонецЦикла;
				
				Если НЕ ЗначениеЗаполнено(ГруппаТоваров) Тогда
				
					ГруппаТоваров = Справочники.Номенклатура.СоздатьГруппу();
					//ГруппаТоваров.ОбменДанными.Загрузка = ИСТИНА;
					ГруппаТоваров.Наименование = СокрЛП(ProductTypeDescription);
					Попытка
						ГруппаТоваров.Записать();
					Исключение
					КонецПопытки;
				
				КонецЕсли;
				
				ТекНоменклатура.Родитель = ГруппаТоваров.Ссылка;
				
			КонецЕсли;
		
		КонецЕсли;
		
		Если НЕ VatValue = НЕОПРЕДЕЛЕНО Тогда
			//Если VatValue = "18" ИЛИ VatValue = 18 Тогда
			//	СтавкаНДС = Справочники.СтавкиНДС.НДС18;
			//ИначеЕсли VatValue = "0" ИЛИ VatValue = "00" ИЛИ VatValue = 0 Тогда
			//	СтавкаНДС = Справочники.СтавкиНДС.НДС0;
			//Иначе
			//	VatValue = СокрЛП(Строка(VatValue));
			//	Запрос = Новый Запрос;
			//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			//	               |	СтавкиНДС.Ссылка
			//	               |ИЗ
			//	               |	Справочник.СтавкиНДС КАК СтавкиНДС
			//	               |ГДЕ
			//	               |	СтавкиНДС.Наименование ПОДОБНО &Наименование";
			//	
			//	Запрос.УстановитьПараметр("Наименование", VatValue+"%");
			//	
			//	РезультатЗапроса = Запрос.Выполнить();
			//	
			//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			//	
			//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//		СтавкаНДС = ВыборкаДетальныеЗаписи.Ссылка;
			//	КонецЦикла;
			//КонецЕсли;
			ТекНоменклатура.СтавкаНДС = НайтиСтавкуНДС(VatValue);
		КонецЕсли;
		
		СтранаПроисхождения = Справочники.СтраныМира.ПустаяСсылка();
		Если НЕ OriginCode = НЕОПРЕДЕЛЕНО Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	СтраныМира.Ссылка
			               |ИЗ
			               |	Справочник.СтраныМира КАК СтраныМира
			               |ГДЕ
			               |	СтраныМира.КодАльфа3 = &OriginCode";
			
			Запрос.УстановитьПараметр("OriginCode", OriginCode);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СтранаПроисхождения = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЦикла;
			
			ТекНоменклатура.СтранаПроисхождения = СтранаПроисхождения;
		КонецЕсли;
		
		Если ТипЗНЧ(Category)=Тип("Строка") Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	КатегорииНоменклатуры.Ссылка
			|ИЗ
			|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
			|ГДЕ
			|	КатегорииНоменклатуры.Наименование = &Наименование";
			
			Запрос.УстановитьПараметр("Наименование", Category);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТекНоменклатура.КатегорияНоменклатуры = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЦикла;
			
			Если НЕ ЗначениеЗаполнено(ТекНоменклатура.КатегорияНоменклатуры) Тогда
			
				ТекКатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.СоздатьЭлемент();
				ТекКатегорияНоменклатуры.Наименование = Category;
				ТекКатегорияНоменклатуры.Записать();
				
				ТекНоменклатура.КатегорияНоменклатуры = ТекКатегорияНоменклатуры.Ссылка;
				
			
			КонецЕсли;
			
		КонецЕсли;
		
		ТекНоменклатура.Комментарий = "Content description: " + СокрЛП(ContentDescription) + "; Content code: " + СокрЛП(ContentCode) + "; Gender description: "+СокрЛП(GenderDescription) + "; Gender code: "+СокрЛП(GenderCode) + "; Season code: "+СокрЛП(SeasonCode);
		
		НачатьТранзакцию();
		Попытка
			
			ТекНоменклатура.Записать();
			Если ТекНоменклатура.ПометкаУдаления Тогда
				ТекНоменклатура.УстановитьПометкуУдаления(ЛОЖЬ);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
			РЕЗ.Результат = ИСТИНА;
			РЕЗ.ВозвращаемоеЗначение = OptionCode;
			РЕЗ.Описание = "Product updated successfully";
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = OptionCode;
			РЕЗ.Описание = "Internal processing error";
		КонецПопытки;
		
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = OptionCode;
		РЕЗ.Описание = "Product not found";		
		
	КонецЕсли;	
	
	Возврат РЕЗ;
КонецФункции

Функция УдалитьНоменклатуру(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	ЗначениеПараметра = СоответствиеОбъекта.Получить("OptionCode");
	ЗначениеПараметра = СокрЛП(ЗначениеПараметра);
	
	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
		РЕЗ.Описание = "Incorrect option code";
		
		Возврат РЕЗ;
	
	КонецЕсли;
		
	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Номенклатура.Ссылка
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.Артикул = &ТекПараметр
	                      |	И НЕ Номенклатура.ЭтоГруппа";
	
	СтрокаОтветаДляУдачногоРезультата = "Product deleted successfully";
	СтрокаОтветаОбъектНеНайден = "Product not found";
	
	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден);
	
	Возврат РЕЗ;
КонецФункции
#КонецОбласти

#Область Контрагенты
Функция СоздатьКонтрагента(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	CIN = СоответствиеОбъекта.Получить("CIN");
	Name = СоответствиеОбъекта.Получить("Name");
	FullName = СоответствиеОбъекта.Получить("FullName");
	PartnerGroup = СоответствиеОбъекта.Получить("PartnerGroup");
	PartnerGroupCode = СоответствиеОбъекта.Получить("PartnerGroupCode");
	Description = СоответствиеОбъекта.Получить("Description");
	PartnerType = СоответствиеОбъекта.Получить("PartnerType");
	Currency = СоответствиеОбъекта.Получить("Currency");
	
	Если НЕ ЗначениеЗаполнено(CIN) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = CIN;
		РЕЗ.Описание = "Incorrect CIN";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = CIN;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	НЕ Контрагенты.ЭтоГруппа
	               |	И Контрагенты.ИНН = &ТекПараметр";
	
	Запрос.УстановитьПараметр("ТекПараметр", CIN);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		НачатьТранзакцию();
		
		ГруппаКонтрагентов = НЕОПРЕДЕЛЕНО; // Ищем группу товаров по наименованию
		Если НЕ PartnerGroup = НЕОПРЕДЕЛЕНО Тогда
			
			PartnerGroup = СокрЛП(Строка(PartnerGroup));
		
			Если СтрДлина(PartnerGroup)>0 Тогда
			
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				               |	Контрагенты.Ссылка
				               |ИЗ
				               |	Справочник.Контрагенты КАК Контрагенты
				               |ГДЕ
				               |	Контрагенты.Наименование = &PartnerGroup
				               |	И Контрагенты.ЭтоГруппа";
				
				Запрос.УстановитьПараметр("PartnerGroup", PartnerGroup);
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ГруппаКонтрагентов = ВыборкаДетальныеЗаписи.Ссылка;
				КонецЦикла;
				
				Если НЕ ЗначениеЗаполнено(ГруппаКонтрагентов) Тогда
				
					ГруппаКонтрагентов = Справочники.Контрагенты.СоздатьГруппу();
					//ГруппаКонтрагентов.ОбменДанными.Загрузка = ИСТИНА;
					ГруппаКонтрагентов.Наименование = СокрЛП(PartnerGroup);
					Попытка
						ГруппаКонтрагентов.Записать();
					Исключение
					КонецПопытки;
				
				КонецЕсли;
			
			КонецЕсли;
		
		КонецЕсли;
		
		// Создаем элемент справочника Контрагенты;
		ТекКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		ТекКонтрагент.ОбменДанными.Загрузка = ИСТИНА;
		
		ТекКонтрагент.УстановитьНовыйКод();
		ТекКонтрагент.Наименование = СокрЛП(Name);
		ТекКонтрагент.НаименованиеПолное = СокрЛП(FullName);
		ТекКонтрагент.Родитель = ГруппаКонтрагентов;
		ТекКонтрагент.ИНН = CIN;
		ТекКонтрагент.Комментарий = Description+"; PartnerType="+СокрЛП(Строка(PartnerType));
		ТекКонтрагент.Покупатель = ИСТИНА;
		ТекКонтрагент.Поставщик = ИСТИНА;
		ТекКонтрагент.ВестиРасчетыПоДоговорам = ИСТИНА;
		ТекКонтрагент.ВестиРасчетыПоДокументам = ИСТИНА;
		ТекКонтрагент.ВестиРасчетыПоЗаказам = ИСТИНА;
		ТекКонтрагент.ВестиУчетОплатыПоСчетам = ИСТИНА;
		
		ТекКонтрагент.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС");
		Если ЗначениеЗаполнено(PartnerType) Тогда // Пожалуй эта проверка лишняя
			Если PartnerType=2 Тогда
				ТекКонтрагент.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС");
			Иначе//Если PartnerType=3 Тогда
				ТекКонтрагент.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо");
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ТекКонтрагент,НастройкиПоУмолчанию);
		
		Попытка
			ТекКонтрагент.Записать();
			
			//ЗафиксироватьТранзакцию();
			
			РЕЗ.Результат = ИСТИНА;
			РЕЗ.ВозвращаемоеЗначение = CIN;
			РЕЗ.Описание = "Partner created successfully";
		Исключение
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = CIN;
			РЕЗ.Описание = "Internal processing error";
			
			Возврат РЕЗ;
		КонецПопытки;
		
		// Создаем договор по умолчанию
		Если РЕЗ.Результат Тогда
		
			ТекДоговор = СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,ИСТИНА,ИСТИНА);
			Если ТекДоговор = НЕОПРЕДЕЛЕНО Тогда
			
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = CIN;
				РЕЗ.Описание = "Internal processing error";
				
			Иначе
				
				Попытка
					
					ТекКонтрагент.ДоговорПоУмолчанию = ТекДоговор.ссылка;
					ТекКонтрагент.Записать();
					
					ЗафиксироватьТранзакцию();
					
					РЕЗ.Результат = ИСТИНА;
					РЕЗ.ВозвращаемоеЗначение = CIN;
					РЕЗ.Описание = "Partner created successfully";
				Исключение
					
					Если ТранзакцияАктивна() Тогда
						ОтменитьТранзакцию();
					КонецЕсли;
					
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = CIN;
					РЕЗ.Описание = "Internal processing error";			
				КонецПопытки;
			КонецЕсли;
		
		КонецЕсли;
		
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = CIN;
		РЕЗ.Описание = "Partner already exist";		
		
	КонецЕсли;	
	
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьКонтрагента(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	CIN = СоответствиеОбъекта.Получить("CIN");
	Name = СоответствиеОбъекта.Получить("Name");
	FullName = СоответствиеОбъекта.Получить("FullName");
	PartnerGroup = СоответствиеОбъекта.Получить("PartnerGroup");
	PartnerGroupCode = СоответствиеОбъекта.Получить("PartnerGroupCode");
	Description = СоответствиеОбъекта.Получить("Description");
	PartnerType = СоответствиеОбъекта.Получить("PartnerType");
	Currency = СоответствиеОбъекта.Получить("Currency");
	
	Если НЕ ЗначениеЗаполнено(CIN) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = CIN;
		РЕЗ.Описание = "Incorrect CIN";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = CIN;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	НЕ Контрагенты.ЭтоГруппа
	               |	И Контрагенты.ИНН = &ТекПараметр";
	
	Запрос.УстановитьПараметр("ТекПараметр", CIN);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		НачатьТранзакцию();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекКонтрагент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КонецЦикла;
		
		ТекКонтрагент.ОбменДанными.Загрузка = ИСТИНА;
		
		ТекКонтрагент.Наименование = СокрЛП(Name);
		ТекКонтрагент.НаименованиеПолное = СокрЛП(FullName);
		//ТекКонтрагент.ИНН = CIN;
		ТекКонтрагент.Комментарий = Description+"; PartnerType="+СокрЛП(Строка(PartnerType));
		ТекКонтрагент.Покупатель = ИСТИНА;
		ТекКонтрагент.Поставщик = ИСТИНА;
		ТекКонтрагент.ВестиРасчетыПоДоговорам = ИСТИНА;
		ТекКонтрагент.ВестиРасчетыПоДокументам = ИСТИНА;
		ТекКонтрагент.ВестиРасчетыПоЗаказам = ИСТИНА;
		ТекКонтрагент.ВестиУчетОплатыПоСчетам = ИСТИНА;
		
		ТекКонтрагент.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС");
		Если ЗначениеЗаполнено(PartnerType) Тогда // Пожалуй эта проверка лишняя
			Если PartnerType=2 Тогда
				ТекКонтрагент.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС");
			Иначе//Если PartnerType=3 Тогда
				ТекКонтрагент.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо");
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ТекКонтрагент,НастройкиПоУмолчанию);
		
		ГруппаКонтрагентов = НЕОПРЕДЕЛЕНО; // Ищем группу товаров по наименованию
		Если НЕ PartnerGroup = НЕОПРЕДЕЛЕНО Тогда
			
			PartnerGroup = СокрЛП(Строка(PartnerGroup));
		
			Если СтрДлина(PartnerGroup)>0 Тогда
			
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				               |	Контрагенты.Ссылка
				               |ИЗ
				               |	Справочник.Контрагенты КАК Контрагенты
				               |ГДЕ
				               |	Контрагенты.Наименование = &PartnerGroup
				               |	И Контрагенты.ЭтоГруппа";
				
				Запрос.УстановитьПараметр("PartnerGroup", PartnerGroup);
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ГруппаКонтрагентов = ВыборкаДетальныеЗаписи.Ссылка;
				КонецЦикла;
				
				Если НЕ ЗначениеЗаполнено(ГруппаКонтрагентов) Тогда
				
					ГруппаКонтрагентов = Справочники.Контрагенты.СоздатьГруппу();
					//ГруппаКонтрагентов.ОбменДанными.Загрузка = ИСТИНА;
					ГруппаКонтрагентов.Наименование = СокрЛП(PartnerGroup);
					Попытка
						ГруппаКонтрагентов.Записать();
					Исключение
					КонецПопытки;
				
				КонецЕсли;
				
				ТекКонтрагент.Родитель = ГруппаКонтрагентов;
				
			КонецЕсли;
		
		КонецЕсли;
		
		Попытка
			ТекКонтрагент.Записать();
			Если ТекКонтрагент.ПометкаУдаления Тогда
				ТекКонтрагент.УстановитьПометкуУдаления(ЛОЖЬ);
			КонецЕсли;
			
			//ЗафиксироватьТранзакцию();
			
			РЕЗ.Результат = ИСТИНА;
			РЕЗ.ВозвращаемоеЗначение = CIN;
			РЕЗ.Описание = "Partner updated successfully";
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = CIN;
			РЕЗ.Описание = "Internal processing error";
			
			Возврат РЕЗ;
		КонецПопытки;
		
		// Создаем договор по умолчанию
		Если РЕЗ.Результат Тогда
			Если ЗначениеЗаполнено(ТекКонтрагент.ДоговорПоУмолчанию) Тогда
				
				ЗафиксироватьТранзакцию();
		
				ТекДоговор = ТекКонтрагент.ДоговорПоУмолчанию.ПолучитьОбъект();
				ТекДоговор.ОбменДанными.Загрузка = ИСТИНА;
				Если ТекДоговор.ПометкаУдаления Тогда
					Попытка
						ТекДоговор.Записать();
						ТекДоговор.УстановитьПометкуУдаления(ЛОЖЬ);
					Исключение
					КонецПопытки;
				КонецЕсли;
				
				РЕЗ.Результат = ИСТИНА;
				РЕЗ.ВозвращаемоеЗначение = CIN;
				РЕЗ.Описание = "Partner updated successfully";
			Иначе
				ТекДоговор = СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,ИСТИНА,ИСТИНА);
				Если ТекДоговор = НЕОПРЕДЕЛЕНО Тогда
					
					Если ТранзакцияАктивна() Тогда
						ОтменитьТранзакцию();
					КонецЕсли;
					
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = CIN;
					РЕЗ.Описание = "Internal processing error";
					
				Иначе
					
					Попытка
						
						ТекКонтрагент.ДоговорПоУмолчанию = ТекДоговор.ссылка;
						ТекКонтрагент.Записать();
						
						ЗафиксироватьТранзакцию();
						
						РЕЗ.Результат = ИСТИНА;
						РЕЗ.ВозвращаемоеЗначение = CIN;
						РЕЗ.Описание = "Partner updated successfully";
					Исключение
						
						Если ТранзакцияАктивна() Тогда
							ОтменитьТранзакцию();
						КонецЕсли;
						
						РЕЗ.Результат = ЛОЖЬ;
						РЕЗ.ВозвращаемоеЗначение = CIN;
						РЕЗ.Описание = "Internal processing error";			
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = CIN;
		РЕЗ.Описание = "Partner not found";		
		
	КонецЕсли;	
	
	Возврат РЕЗ;
КонецФункции

Функция УдалитьКонтрагента(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	ЗначениеПараметра = СоответствиеОбъекта.Получить("CIN");
	ЗначениеПараметра = СокрЛП(ЗначениеПараметра);
	
	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
		РЕЗ.Описание = "Incorrect CIN";
		
		Возврат РЕЗ;
	
	КонецЕсли;
		
	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Контрагенты.Ссылка
	                      |ИЗ
	                      |	Справочник.Контрагенты КАК Контрагенты
	                      |ГДЕ
	                      |	НЕ Контрагенты.ЭтоГруппа
	                      |	И Контрагенты.ИНН = &ТекПараметр";
	
	СтрокаОтветаДляУдачногоРезультата = "Partner deleted successfully";
	СтрокаОтветаОбъектНеНайден = "Partner not found";
	
	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден);
	
	Возврат РЕЗ;
КонецФункции

Функция ПолучитьРозничногоПокупателя() ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(НЕОПРЕДЕЛЕНО);
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		//РЕЗ.ВозвращаемоеЗначение = "";
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
		
	Иначе
		
		ТекРозничныйКонтрагент = НЕОПРЕДЕЛЕНО;
		
		ТекОрганизация = НастройкиПоУмолчанию.Организация;
		УчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаРегл.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Организация", ТекОрганизация));
		Если УчетнаяПолитика.Свойство("РозничныйКонтрагент",ТекРозничныйКонтрагент) Тогда
			Если ЗначениеЗаполнено(ТекРозничныйКонтрагент) Тогда
				Если СтрДлина(СокрЛП(ТекРозничныйКонтрагент.ИНН))=0 Тогда
					РЕЗ.Результат = ЛОЖЬ;
					//РЕЗ.ВозвращаемоеЗначение = "";
					РЕЗ.Описание = "Retail customer CIN not found";
				Иначе
					РозничныйКонтрагентСоответствие = Новый Соответствие();
					РозничныйКонтрагентСоответствие.Вставить("CIN",ТекРозничныйКонтрагент.ИНН);
					РозничныйКонтрагентСоответствие.Вставить("Name",ТекРозничныйКонтрагент.Наименование);
					РозничныйКонтрагентСоответствие.Вставить("FullName",ТекРозничныйКонтрагент.НаименованиеПолное);
					РозничныйКонтрагентСоответствие.Вставить("PartnerGroup",ТекРозничныйКонтрагент.Родитель.Наименование);
					РозничныйКонтрагентСоответствие.Вставить("PartnerGroupCode",ТекРозничныйКонтрагент.Родитель.Код);
					РозничныйКонтрагентСоответствие.Вставить("Description",ТекРозничныйКонтрагент.Комментарий);
					РозничныйКонтрагентСоответствие.Вставить("PartnerType",1);
					
					РЕЗ.Результат = ИСТИНА;
					РЕЗ.ВозвращаемоеЗначение = РозничныйКонтрагентСоответствие;
					РЕЗ.Описание = "Retail customer found successfully";	
				КонецЕсли;				
			КонецЕсли;
			
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			//РЕЗ.ВозвращаемоеЗначение = "";
			РЕЗ.Описание = "Retail customer not found";
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции // ()
#КонецОбласти

#Область ПриходнаяНакладная
Функция СоздатьПриходнуюНакладную(СтруктураДляВозврата,СоответствиеОбъекта,РасходнаяНакладнаяRef=НЕОПРЕДЕЛЕНО, ТекОперация=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	PartnerCIN = СоответствиеОбъекта.Получить("PartnerCIN");
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Currency = СоответствиеОбъекта.Получить("Currency");
	Import = СоответствиеОбъекта.Получить("Import");
	Description = СоответствиеОбъекта.Получить("Description");
	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
	CashExpenseOrder = СоответствиеОбъекта.Получить("CashExpenseOrder");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	НаправлениеДеятельности=НЕОПРЕДЕЛЕНО;
	PartnerType = СоответствиеОбъекта.Получить("PartnerType");
	Если ЗначениеЗаполнено(PartnerType) Тогда
		РЕЗ = ПолучитьНаправлениеДеятельности(PartnerType,РЕЗ);
		Если РЕЗ.Результат Тогда
			НаправлениеДеятельности = РЕЗ.ВозвращаемоеЗначение;
		Иначе	
			Возврат РЕЗ;
		КонецЕсли;
	КонецЕсли;
	
	InvoiceNumber = СоответствиеОбъекта.Получить("InvoiceNumber");
	InvoiceDate = СоответствиеОбъекта.Получить("InvoiceDate");	
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect tabular section";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПриходнаяНакладнаяДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.ПриходнаяНакладная.ДополнительныеРеквизиты КАК ПриходнаяНакладнаяДополнительныеРеквизиты
	               |ГДЕ
	               |	ПриходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И ПриходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		// Ищем контрагента				
		ТекКонтрагент = НайтиКонтрагентаПоИНН(СокрЛП(PartnerCIN));
		
		Если ТекКонтрагент = НЕОПРЕДЕЛЕНО Тогда
		
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = PartnerCIN;
			РЕЗ.Описание = "Partner not found";
			
		Иначе
			
			Если ЗначениеЗаполнено(ТекКонтрагент.ДоговорПоУмолчанию) Тогда
				ТекДоговор = ТекКонтрагент.ДоговорПоУмолчанию;
				Если ((НЕ ТекДоговор.Поставщик) И (Константы.ИспользоватьВидыДоговоров.Получить())) ИЛИ (НЕ ТекДоговор.ВалютаРасчетов = ТекВалюта.Ссылка) Тогда
					ТекДоговор = СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,,ИСТИНА);
				КонецЕсли;
			Иначе
				ТекДоговор = СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,,ИСТИНА);
			КонецЕсли;
						
		КонецЕсли;
		
		//Ищем Склад
		Если РЕЗ.Результат Тогда
			ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
			Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
				РЕЗ.Описание = "Warehouse not found";
			
			КонецЕсли;
		КонецЕсли;
		
		Если РЕЗ.Результат Тогда
			
			РасходнаяНакладнаяNumber = НЕОПРЕДЕЛЕНО;
			ДанныеЗаполнения = НЕОПРЕДЕЛЕНО;
			Если НЕ РасходнаяНакладнаяRef=НЕОПРЕДЕЛЕНО Тогда
				
				СтруктураДополнительныхРеквизитовДанныеЗаполнения = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
				ДопПараметрДанныеЗаполнения = СтруктураДополнительныхРеквизитовДанныеЗаполнения.DocRef;
				
				ЗапросДанныеЗаполнения = Новый Запрос();
				ЗапросДанныеЗаполнения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	РасходнаяНакладнаяДополнительныеРеквизиты.Ссылка
				|ИЗ
				|	Документ.РасходнаяНакладная.ДополнительныеРеквизиты КАК РасходнаяНакладнаяДополнительныеРеквизиты
				|ГДЕ
				|	РасходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
				|	И РасходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
				
				ЗапросДанныеЗаполнения.УстановитьПараметр("ТекПараметр", РасходнаяНакладнаяRef);
				ЗапросДанныеЗаполнения.УстановитьПараметр("ДопПараметр", ДопПараметрДанныеЗаполнения);
				
				ЗапросДанныеЗаполнения.Выполнить();
				РезультатЗапросаДанныеЗаполнения = ЗапросДанныеЗаполнения.Выполнить();
				ВыборкаДанныеЗаполнения = РезультатЗапросаДанныеЗаполнения.Выбрать();
				Пока ВыборкаДанныеЗаполнения.Следующий() Цикл
					ДанныеЗаполнения = ВыборкаДанныеЗаполнения.Ссылка;
					
					РасходнаяНакладнаяNumber = ДанныеЗаполнения.Номер;
				КонецЦикла;	
				
			КонецЕсли;			
			
			НачатьТранзакцию();
			
			ТекДок = Документы.ПриходнаяНакладная.СоздатьДокумент();
			
			ТекДок.Дата = ДатаДокумента;
			ТекДок.УстановитьНовыйНомер();
			
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.РасходнаяНакладная")] = "ЗаполнитьПоРасходнойНакладной";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПоставщику")] = "ЗаполнитьПоЗаказуПоставщику";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриходныйОрдер")] = "ЗаполнитьПоПриходномуОрдеру";
			СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплатуПоставщика")] = "ЗаполнитьПоСчетуНаОплатуПоставщика";
			СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплату")] = "ЗаполнитьПоСчетуНаОплатуВозврат";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЧекККМ")] = "ЗаполнитьПоЧекуККМ";
			СтратегияЗаполнения[Тип("ДокументСсылка.ТТНВходящаяЕГАИС")] = "ЗаполнитьПоНакладнойЕГАИС";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриемИПередачаВРемонт")] = "ЗаполнитьПоПриемуВРемонт";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, ДанныеЗаполнения, СтратегияЗаполнения);
			
			Если НЕ ЗначениеЗаполнено(ТекДок.ВидОперации) Тогда
				Если РасходнаяНакладнаяRef=НЕОПРЕДЕЛЕНО Тогда
					ТекДок.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
				Иначе
					ТекДок.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
				КонецЕсли;
			КонецЕсли;
			
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseRef,РасходнаяНакладнаяRef);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseNumber,РасходнаяНакладнаяNumber);
			
			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
			ТекДок.Комментарий = Description;
			
			//ТекДок.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика");
			Если ЗначениеЗаполнено(ТекОперация) Тогда
				Если ТипЗНЧ(ТекОперация) = Тип("ПеречислениеСсылка.ВидыОперацийПриходнаяНакладная") Тогда
					ТекДок.ВидОперации = ТекОперация;
				КонецЕсли;
			КонецЕсли;
			
			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
			ТекДок.Контрагент = ТекКонтрагент;
			ТекДок.Договор = ТекДоговор;
			ТекДок.СтруктурнаяЕдиница = ТекСклад;
			
			Если НЕ Import = НЕОПРЕДЕЛЕНО Тогда
				Если Import Тогда
					ТекДок.Импорт = ИСТИНА;
				КонецЕсли;
			КонецЕсли;
			
			// Дозаполняем данные			
			ТекДок.Предоплата.Очистить();
			ТекДок.ФактурыАвансов.Очистить();
			//ТекДок.ДокументОснование = Неопределено;
			
			//ТекДок.ВалютаДокумента = ТекДоговор.ВалютаРасчетов;
			ТекДок.ВалютаДокумента = ТекВалюта;
						
			//Данные по договору
			ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДок.Дата, Новый Структура("Валюта", ТекДок.ВалютаДокумента));
			ТекДок.Курс      = ВалютаРасчетовКурсКратность.Курс;
			ТекДок.Кратность = ВалютаРасчетовКурсКратность.Кратность;
			
			СуммаВключаетНДС = ?(ЗначениеЗаполнено(ТекДоговор.ВидЦенКонтрагента), ТекДоговор.ВидЦенКонтрагента.ЦенаВключаетНДС, Неопределено);
			Если НЕ СуммаВключаетНДС = Неопределено Тогда
				ТекДок.СуммаВключаетНДС = СуммаВключаетНДС;
			КонецЕсли;
			
			ТекДок.ВидЦенКонтрагента = ТекДоговор.ВидЦенКонтрагента;
			Если ЗначениеЗаполнено(ТекДок.ВидЦенКонтрагента) Тогда
				ТекДок.РегистрироватьЦеныПоставщика = Истина;
			КонецЕсли;
			
			// Данные по организации
			Если ПолучитьФункциональнуюОпцию("ФункциональнаяОпцияИспользоватьИсториюНалогообложенияКонтрагентов") Тогда
				НалогообложениеСтавка = РегистрыСведений.НалогообложениеКонтрагентов.ПолучитьПоследнее(ТекДок.Дата, Новый Структура("Контрагент,Договор", ТекДок.Контрагент, ТекДок.Договор));
			Иначе
				НалогообложениеСтавка = Новый Структура("НалогообложениеНДС",ТекДок.Контрагент.НалогообложениеНДС);
			КонецЕсли;
			ТекДок.НалогообложениеНДС = НалогообложениеСтавка.НалогообложениеНДС;
			Если ТекДок.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
				ТекДок.ВидНалогаНДС = ТекДок.Организация.ВидНалогаНДС;
			КонецЕсли;
			
			// Заполняем табличную часть
			МассивОшибок = Новый Массив();
			ТекДок.Запасы.Очистить();
			Для каждого СоответствиеОбъекта Из TabularSection Цикл
			
				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
				
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Прервать;
				
				КонецЕсли;				
				
				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
				Price = СоответствиеОбъекта.Получить("Price");
				Quantity = СоответствиеОбъекта.Получить("Quantity");
				Sum = СоответствиеОбъекта.Получить("Sum");
				VatValue = СоответствиеОбъекта.Получить("VatValue");
				VatSum = СоответствиеОбъекта.Получить("VatSum");
				Discount = СоответствиеОбъекта.Получить("Discount");
				
				ТекКоличество = 0;
				ТекЦена = 0;
				ТекСумма = 0;
				ТекСуммаНДС = 0;
				ТекСтавкаНДС = НЕОПРЕДЕЛЕНО;
				ТекСуммаСкидки = 0;
				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
				
				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Product not found";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
						ТекКоличество = Число(Quantity);
					Иначе
						ТекКоличество = 0;
					КонецЕсли
				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
					ТекКоличество = Quantity;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid quantity";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Quantity);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Price)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Price),"null")=0 Тогда
						ТекЦена = Число(Price);
					Иначе
						ТекЦена = 0;
					КонецЕсли;
				ИначеЕсли ТипЗНЧ(Price)=Тип("Число") Тогда
					ТекЦена = Price;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid price";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Price);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Sum)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Sum),"null")=0 Тогда
						ТекСумма = Число(Sum);
					Иначе
						ТекСумма = 0;
					КонецЕсли;
				ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
					ТекСумма = Sum;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid sum";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Sum);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если НЕ VatSum = НЕОПРЕДЕЛЕНО Тогда
					
					Если ТипЗНЧ(VatSum)=Тип("Строка") Тогда
						Если СтрНайти(НРЕГ(VatSum),"null")=0 Тогда
							ТекСуммаНДС = Число(VatSum);
						Иначе
							ТекСуммаНДС = 0;
						КонецЕсли;
					ИначеЕсли ТипЗНЧ(VatSum)=Тип("Число") Тогда
						ТекСуммаНДС = VatSum;
					Иначе
						СтруктураОшибки = ПолучитьСтруктуруОшибки();
						
						СтруктураОшибки.Message = "Invalid VatSum";
						СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
						СтруктураОшибки.Вставить("Value",VatSum);
						
						МассивОшибок.Добавить(СтруктураОшибки);
					КонецЕсли;
					
					ТекСтавкаНДС = НайтиСтавкуНДС(VatValue);	
					
				КонецЕсли;
				
				Если НЕ Discount = НЕОПРЕДЕЛЕНО Тогда
					Если ТипЗНЧ(Discount)=Тип("Строка") Тогда
						Если СтрНайти(НРЕГ(Discount),"null")=0 Тогда
							ТекСуммаСкидки = Число(Discount);
						Иначе
							ТекСуммаСкидки = 0;
						КонецЕсли;
					ИначеЕсли ТипЗНЧ(Discount)=Тип("Число") Тогда
						ТекСуммаСкидки = Discount;
					Иначе
						СтруктураОшибки = ПолучитьСтруктуруОшибки();
						
						СтруктураОшибки.Message = "Invalid discount";
						СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
						СтруктураОшибки.Вставить("Value",Discount);
						
						МассивОшибок.Добавить(СтруктураОшибки);
					КонецЕсли;	
				КонецЕсли;
				
				
			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.СтранаПроисхождения = СтрокаТабличнойЧасти.Номенклатура.СтранаПроисхождения;
				СтрокаТабличнойЧасти.Количество = ТекКоличество;
				СтрокаТабличнойЧасти.Цена = ТекЦена;

				ТекСуммаВычисленная = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
				Если НЕ ТекСуммаВычисленная = ТекСумма Тогда
					ТекСуммаСкидки = ТекСуммаВычисленная - ТекСумма;
					ТекСумма = ТекСуммаВычисленная;
				КонецЕсли;
				
				Если ТекСумма>0 Тогда
					Если ТекСумма>ТекСуммаСкидки Тогда
						СтрокаТабличнойЧасти.Сумма = ТекСумма - ТекСуммаСкидки;
						СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = (ТекСуммаСкидки*100)/ТекСумма;
					Иначе
						СтрокаТабличнойЧасти.Сумма = 0;
						СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100;
					КонецЕсли;
				КонецЕсли;
				СтрокаТабличнойЧасти.СтавкаНДС = ТекСтавкаНДС;
				СтрокаТабличнойЧасти.СуммаНДС = ТекСуммаНДС;
				
				// Дозаполняем данные в строке
				СтрокаТабличнойЧасти.НомерГТД = Неопределено;
				СтрокаТабличнойЧасти.Содержание = "";
				СтрокаТабличнойЧасти.НеобходимостьВводаАкцизнойМарки = СтрокаТабличнойЧасти.Номенклатура.ВидАлкогольнойПродукции.Маркируемый;
				
				СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(ТекДок.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
				
				Если НЕ НаправлениеДеятельности=НЕОПРЕДЕЛЕНО Тогда
					СтрокаТабличнойЧасти.НаправлениеДеятельности = НаправлениеДеятельности;
				КонецЕсли;
				
				// Обработка возврата товаров
				Если ТекДок.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя И ЗначениеЗаполнено(ТекДок.ДокументОснование) Тогда
						
	 				ЗапросДляСебестоимостиПоВозврату = Новый Запрос;
					ЗапросДляСебестоимостиПоВозврату.Текст = 
						"ВЫБРАТЬ
						|	Запасы.Номенклатура,
						|	СУММА(Запасы.Количество) КАК Количество,
						|	СУММА(Запасы.Сумма) КАК Сумма
						|ИЗ
						|	РегистрНакопления.Запасы КАК Запасы
						|ГДЕ
						|	Запасы.Регистратор = &ДокументОснование
						|	И Запасы.Номенклатура = &Номенклатура
						|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
						|
						|СГРУППИРОВАТЬ ПО
						|	Запасы.Номенклатура";
					
					ЗапросДляСебестоимостиПоВозврату.УстановитьПараметр("ДокументОснование", ТекДок.ДокументОснование);
					ЗапросДляСебестоимостиПоВозврату.УстановитьПараметр("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
					
					РезультатЗапросаДляСебестоимостиПоВозврату = ЗапросДляСебестоимостиПоВозврату.Выполнить();
					
					ВыборкаДетальныеЗаписиДляСебестоимостиПоВозврату = РезультатЗапросаДляСебестоимостиПоВозврату.Выбрать();
					
					Пока ВыборкаДетальныеЗаписиДляСебестоимостиПоВозврату.Следующий() Цикл
						Если СтрокаТабличнойЧасти.Количество >= ВыборкаДетальныеЗаписиДляСебестоимостиПоВозврату.Количество Тогда
							СтрокаТабличнойЧасти.Себестоимость = ВыборкаДетальныеЗаписиДляСебестоимостиПоВозврату.Сумма;
						Иначе
							СтрокаТабличнойЧасти.Себестоимость = (ВыборкаДетальныеЗаписиДляСебестоимостиПоВозврату.Сумма * СтрокаТабличнойЧасти.Количество) / ВыборкаДетальныеЗаписиДляСебестоимостиПоВозврату.Количество;
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Обработка возврата товаров
			Если ТекДок.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя И ЗначениеЗаполнено(ТекДок.ДокументОснование) Тогда
				УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseDoc,ТекДок.ДокументОснование);
				ТекДок.ДокументОснование = НЕОПРЕДЕЛЕНО;
				
				СтруктураДополнительныхРеквизитов_СтруктурныеЕдиницы = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
				ПодразделениеПродажи = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов_СтруктурныеЕдиницы.SaleSubdivision);
				Если ЗначениеЗаполнено(ПодразделениеПродажи) Тогда
					ТекДок.Подразделение = ПодразделениеПродажи;
				КонецЕсли;
			КонецЕсли;
			
			ТекДок.НомерВходящегоДокумента = InvoiceNumber;
			ТекДок.ДатаВходящегоДокумента = ДатаJSON(InvoiceDate);
			
			ТекДок.КоличествоТоваров = ТекДок.Запасы.Итог("Количество");
			
			// Проводим
			ОписаниеУспешногоПроведения = "Doc purchase created successfully";
			ЗаписыватьПриОшибках=ЛОЖЬ;
			ОписаниеДляМассиваОшибок="";
			ФиксироватьТранзакции=ЛОЖЬ;
			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
			
			СтрокаОшибок = РЕЗ.Описание;
			// Получаем возврат наличных из кассы
			Если РЕЗ.Результат Тогда
				Если НЕ CashExpenseOrder = НЕОПРЕДЕЛЕНО Тогда
					
					Если ТипЗНЧ(CashExpenseOrder) = Тип("Массив") Тогда
						
						Для Каждого ТекCashExpenseOrder из CashExpenseOrder Цикл
							
							Если ТекCashExpenseOrder.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashExpenseOrder.Вставить("Ref",Ref);
							КонецЕсли;
							
							Если ТекCashExpenseOrder.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashExpenseOrder.Вставить("Number",Number);
							КонецЕсли;
							
							Если ТекCashExpenseOrder.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashExpenseOrder.Вставить("Date",Date+1);
							КонецЕсли;
							
							Если ТекCashExpenseOrder.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashExpenseOrder.Вставить("PartnerCIN",PartnerCIN);
							КонецЕсли;
							
							Если ТекCashExpenseOrder.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashExpenseOrder.Вставить("WarehouseCode",WarehouseCode);
							КонецЕсли;
							
							Если ТекCashExpenseOrder.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashExpenseOrder.Вставить("Currency",Currency);
							КонецЕсли;
							
							Если ТекCashExpenseOrder.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashExpenseOrder.Вставить("Description",Description);
							КонецЕсли;
							
							РЕЗ = СоздатьИлиОбновитьРасходИзКассыИзПриходнойНакладной(РЕЗ,ТекCashExpenseOrder,Ref);
							
							Если НЕ РЕЗ.Результат Тогда
								РЕЗ.Описание = СтрокаОшибок + "; Cash expense order: " + РЕЗ.Описание;
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
					Иначе	

						Если CashExpenseOrder.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
							CashExpenseOrder.Вставить("Ref",Ref);
						КонецЕсли;
						
						Если CashExpenseOrder.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
							CashExpenseOrder.Вставить("Number",Number);
						КонецЕсли;
						
						Если CashExpenseOrder.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
							CashExpenseOrder.Вставить("Date",Date+1);
						КонецЕсли;
						
						Если CashExpenseOrder.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
							CashExpenseOrder.Вставить("PartnerCIN",PartnerCIN);
						КонецЕсли;
						
						Если CashExpenseOrder.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
							CashExpenseOrder.Вставить("WarehouseCode",WarehouseCode);
						КонецЕсли;
						
						Если CashExpenseOrder.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
							CashExpenseOrder.Вставить("Currency",Currency);
						КонецЕсли;
						
						Если CashExpenseOrder.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
							CashExpenseOrder.Вставить("Description",Description);
						КонецЕсли;
						
						РЕЗ = СоздатьИлиОбновитьРасходИзКассыИзПриходнойНакладной(РЕЗ,CashExpenseOrder,Ref);
						
						Если НЕ РЕЗ.Результат Тогда
							РЕЗ.Описание = СтрокаОшибок + "; Cash expense order: " + РЕЗ.Описание;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			Если РЕЗ.Результат Тогда
				РЕЗ.Описание = "Doc purchase created successfully";
				ЗафиксироватьТранзакцию()
			Иначе
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				РЕЗ.Описание = СтрЗаменить(РЕЗ.Описание,"Doc purchase created successfully","Creating purchases doc: error");
			КонецЕсли;
		
		КонецЕсли;
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc purchase already exist";		
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьПриходнуюНакладную(СтруктураДляВозврата,СоответствиеОбъекта,РасходнаяНакладнаяRef=НЕОПРЕДЕЛЕНО, ТекОперация=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	PartnerCIN = СоответствиеОбъекта.Получить("PartnerCIN");
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Currency = СоответствиеОбъекта.Получить("Currency");
	Import = СоответствиеОбъекта.Получить("Import");
	Description = СоответствиеОбъекта.Получить("Description");
	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
	CashExpenseOrder = СоответствиеОбъекта.Получить("CashExpenseOrder");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	НаправлениеДеятельности=НЕОПРЕДЕЛЕНО;
	PartnerType = СоответствиеОбъекта.Получить("PartnerType");
	Если ЗначениеЗаполнено(PartnerType) Тогда
		РЕЗ = ПолучитьНаправлениеДеятельности(PartnerType,РЕЗ);
		Если РЕЗ.Результат Тогда
			НаправлениеДеятельности = РЕЗ.ВозвращаемоеЗначение;
		Иначе	
			Возврат РЕЗ;
		КонецЕсли;
	КонецЕсли;
	
	InvoiceNumber = СоответствиеОбъекта.Получить("InvoiceNumber");
	InvoiceDate = СоответствиеОбъекта.Получить("InvoiceDate");
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect tabular section";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПриходнаяНакладнаяДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.ПриходнаяНакладная.ДополнительныеРеквизиты КАК ПриходнаяНакладнаяДополнительныеРеквизиты
	               |ГДЕ
	               |	ПриходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И ПриходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
						
		// Ищем контрагента				
		ТекКонтрагент = НайтиКонтрагентаПоИНН(СокрЛП(PartnerCIN));
		
		Если ТекКонтрагент = НЕОПРЕДЕЛЕНО Тогда
		
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = PartnerCIN;
			РЕЗ.Описание = "Partner not found";
			
		Иначе
			
			Если ЗначениеЗаполнено(ТекКонтрагент.ДоговорПоУмолчанию) Тогда
				ТекДоговор = ТекКонтрагент.ДоговорПоУмолчанию;
				Если ((НЕ ТекДоговор.Поставщик) И (Константы.ИспользоватьВидыДоговоров.Получить())) ИЛИ (НЕ ТекДоговор.ВалютаРасчетов = ТекВалюта.Ссылка) Тогда
					ТекДоговор = СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,,ИСТИНА);
				КонецЕсли;
			Иначе
				ТекДоговор = СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,,ИСТИНА);
			КонецЕсли;
						
		КонецЕсли;
		
		//Ищем Склад
		Если РЕЗ.Результат Тогда
			ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
			Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
				РЕЗ.Описание = "Warehouse not found";
			
			КонецЕсли;
		КонецЕсли;
		
		Если РЕЗ.Результат Тогда
			НачатьТранзакцию();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТекДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			КонецЦикла;
			
			// Убираем пометку удаления
			Попытка
				Если ТекДок.ПометкаУдаления Тогда
					ТекДок.Записать(РежимЗаписиДокумента.Запись);
					ТекДок.УстановитьПометкуУдаления(ЛОЖЬ);
				КонецЕсли;
			Исключение
				
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Internal processing error";
				
				Возврат РЕЗ;
			КонецПопытки;
			
			ТекДок.Дата = ДатаДокумента;
			
			РасходнаяНакладнаяNumber = НЕОПРЕДЕЛЕНО;
			ДанныеЗаполнения = НЕОПРЕДЕЛЕНО;
			Если НЕ РасходнаяНакладнаяRef=НЕОПРЕДЕЛЕНО Тогда
				
				ТекДок.Запасы.Очистить(); // Очистим табличную часть, ибо придётся заполнять её заново.
				
				СтруктураДополнительныхРеквизитовДанныеЗаполнения = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
				ДопПараметрДанныеЗаполнения = СтруктураДополнительныхРеквизитовДанныеЗаполнения.DocRef;
				
				ЗапросДанныеЗаполнения = Новый Запрос();
				ЗапросДанныеЗаполнения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	РасходнаяНакладнаяДополнительныеРеквизиты.Ссылка
				|ИЗ
				|	Документ.РасходнаяНакладная.ДополнительныеРеквизиты КАК РасходнаяНакладнаяДополнительныеРеквизиты
				|ГДЕ
				|	РасходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
				|	И РасходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
				
				ЗапросДанныеЗаполнения.УстановитьПараметр("ТекПараметр", РасходнаяНакладнаяRef);
				ЗапросДанныеЗаполнения.УстановитьПараметр("ДопПараметр", ДопПараметрДанныеЗаполнения);
				
				ЗапросДанныеЗаполнения.Выполнить();
				РезультатЗапросаДанныеЗаполнения = ЗапросДанныеЗаполнения.Выполнить();
				ВыборкаДанныеЗаполнения = РезультатЗапросаДанныеЗаполнения.Выбрать();
				Пока ВыборкаДанныеЗаполнения.Следующий() Цикл
					ДанныеЗаполнения = ВыборкаДанныеЗаполнения.Ссылка;
					
					РасходнаяНакладнаяNumber = ДанныеЗаполнения.Номер;
				КонецЦикла;
				
				СтратегияЗаполнения = Новый Соответствие;
				СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
				СтратегияЗаполнения[Тип("ДокументСсылка.РасходнаяНакладная")] = "ЗаполнитьПоРасходнойНакладной";
				СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
				СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПоставщику")] = "ЗаполнитьПоЗаказуПоставщику";
				СтратегияЗаполнения[Тип("ДокументСсылка.ПриходныйОрдер")] = "ЗаполнитьПоПриходномуОрдеру";
				СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплатуПоставщика")] = "ЗаполнитьПоСчетуНаОплатуПоставщика";
				СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплату")] = "ЗаполнитьПоСчетуНаОплатуВозврат";
				СтратегияЗаполнения[Тип("ДокументСсылка.ЧекККМ")] = "ЗаполнитьПоЧекуККМ";
				СтратегияЗаполнения[Тип("ДокументСсылка.ТТНВходящаяЕГАИС")] = "ЗаполнитьПоНакладнойЕГАИС";
				СтратегияЗаполнения[Тип("ДокументСсылка.ПриемИПередачаВРемонт")] = "ЗаполнитьПоПриемуВРемонт";
				
				ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, ДанныеЗаполнения, СтратегияЗаполнения);
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекДок.ВидОперации) Тогда
				Если РасходнаяНакладнаяRef=НЕОПРЕДЕЛЕНО Тогда
					ТекДок.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
				Иначе
					ТекДок.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
				КонецЕсли;
			КонецЕсли;
			
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseRef,РасходнаяНакладнаяRef);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseNumber,РасходнаяНакладнаяNumber);
			
			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
			ТекДок.Комментарий = Description;
			
			//ТекДок.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика");
			Если ЗначениеЗаполнено(ТекОперация) Тогда
				Если ТипЗНЧ(ТекОперация) = Тип("ПеречислениеСсылка.ВидыОперацийПриходнаяНакладная") Тогда
					ТекДок.ВидОперации = ТекОперация;
				КонецЕсли;
			КонецЕсли;
			
			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
			ТекДок.Контрагент = ТекКонтрагент;
			ТекДок.Договор = ТекДоговор;
			ТекДок.СтруктурнаяЕдиница = ТекСклад;
			
			Если НЕ Import = НЕОПРЕДЕЛЕНО Тогда
				Если Import Тогда
					ТекДок.Импорт = ИСТИНА;
				КонецЕсли;
			КонецЕсли;
			
			// Дозаполняем данные			
			ТекДок.Предоплата.Очистить();
			ТекДок.ФактурыАвансов.Очистить();
			//ТекДок.ДокументОснование = Неопределено;
			
			//ТекДок.ВалютаДокумента = ТекДоговор.ВалютаРасчетов;
			ТекДок.ВалютаДокумента = ТекВалюта;
						
			//Данные по договору
			ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДок.Дата, Новый Структура("Валюта", ТекДок.ВалютаДокумента));
			ТекДок.Курс      = ВалютаРасчетовКурсКратность.Курс;
			ТекДок.Кратность = ВалютаРасчетовКурсКратность.Кратность;
			
			СуммаВключаетНДС = ?(ЗначениеЗаполнено(ТекДоговор.ВидЦенКонтрагента), ТекДоговор.ВидЦенКонтрагента.ЦенаВключаетНДС, Неопределено);
			Если НЕ СуммаВключаетНДС = Неопределено Тогда
				ТекДок.СуммаВключаетНДС = СуммаВключаетНДС;
			КонецЕсли;
			
			ТекДок.ВидЦенКонтрагента = ТекДоговор.ВидЦенКонтрагента;
			Если ЗначениеЗаполнено(ТекДок.ВидЦенКонтрагента) Тогда
				ТекДок.РегистрироватьЦеныПоставщика = Истина;
			КонецЕсли;
			
			// Данные по организации
			Если ПолучитьФункциональнуюОпцию("ФункциональнаяОпцияИспользоватьИсториюНалогообложенияКонтрагентов") Тогда
				НалогообложениеСтавка = РегистрыСведений.НалогообложениеКонтрагентов.ПолучитьПоследнее(ТекДок.Дата, Новый Структура("Контрагент,Договор", ТекДок.Контрагент, ТекДок.Договор));
			Иначе
				НалогообложениеСтавка = Новый Структура("НалогообложениеНДС",ТекДок.Контрагент.НалогообложениеНДС);
			КонецЕсли;
			ТекДок.НалогообложениеНДС = НалогообложениеСтавка.НалогообложениеНДС;
			Если ТекДок.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
				ТекДок.ВидНалогаНДС = ТекДок.Организация.ВидНалогаНДС;
			КонецЕсли;
			
			// Заполняем табличную часть
			МассивОшибок = Новый Массив();
			ТекДок.Запасы.Очистить();
			Для каждого СоответствиеОбъекта Из TabularSection Цикл
			
				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
				
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Прервать;
				
				КонецЕсли;				
				
				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
				Price = СоответствиеОбъекта.Получить("Price");
				Quantity = СоответствиеОбъекта.Получить("Quantity");
				Sum = СоответствиеОбъекта.Получить("Sum");
				VatValue = СоответствиеОбъекта.Получить("VatValue");
				VatSum = СоответствиеОбъекта.Получить("VatSum");
				Discount = СоответствиеОбъекта.Получить("Discount");
				
				ТекКоличество = 0;
				ТекЦена = 0;
				ТекСумма = 0;
				ТекСуммаНДС = 0;
				ТекСтавкаНДС = НЕОПРЕДЕЛЕНО;
				ТекСуммаСкидки = 0;
				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
				
				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Product not found";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
						ТекКоличество = Число(Quantity);
					Иначе
						ТекКоличество = 0;
					КонецЕсли
				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
					ТекКоличество = Quantity;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid quantity";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Quantity);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Price)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Price),"null")=0 Тогда
						ТекЦена = Число(Price);
					Иначе
						ТекЦена = 0;
					КонецЕсли;
				ИначеЕсли ТипЗНЧ(Price)=Тип("Число") Тогда
					ТекЦена = Price;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid price";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Price);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Sum)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Sum),"null")=0 Тогда
						ТекСумма = Число(Sum);
					Иначе
						ТекСумма = 0;
					КонецЕсли;
				ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
					ТекСумма = Sum;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid sum";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Sum);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если НЕ VatSum = НЕОПРЕДЕЛЕНО Тогда
					
					Если ТипЗНЧ(VatSum)=Тип("Строка") Тогда
						Если СтрНайти(НРЕГ(VatSum),"null")=0 Тогда
							ТекСуммаНДС = Число(VatSum);
						Иначе
							ТекСуммаНДС = 0;
						КонецЕсли;
					ИначеЕсли ТипЗНЧ(VatSum)=Тип("Число") Тогда
						ТекСуммаНДС = VatSum;
					Иначе
						СтруктураОшибки = ПолучитьСтруктуруОшибки();
						
						СтруктураОшибки.Message = "Invalid VatSum";
						СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
						СтруктураОшибки.Вставить("Value",VatSum);
						
						МассивОшибок.Добавить(СтруктураОшибки);
					КонецЕсли;
					
					ТекСтавкаНДС = НайтиСтавкуНДС(VatValue);	
					
				КонецЕсли;
				
				Если НЕ Discount = НЕОПРЕДЕЛЕНО Тогда
					Если ТипЗНЧ(Discount)=Тип("Строка") Тогда
						Если СтрНайти(НРЕГ(Discount),"null")=0 Тогда
							ТекСуммаСкидки = Число(Discount);
						Иначе
							ТекСуммаСкидки = 0;
						КонецЕсли;
					ИначеЕсли ТипЗНЧ(Discount)=Тип("Число") Тогда
						ТекСуммаСкидки = Discount;
					Иначе
						СтруктураОшибки = ПолучитьСтруктуруОшибки();
						
						СтруктураОшибки.Message = "Invalid discount";
						СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
						СтруктураОшибки.Вставить("Value",Discount);
						
						МассивОшибок.Добавить(СтруктураОшибки);
					КонецЕсли;	
				КонецЕсли;
				
			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.СтранаПроисхождения = СтрокаТабличнойЧасти.Номенклатура.СтранаПроисхождения;
				СтрокаТабличнойЧасти.Количество = ТекКоличество;
				СтрокаТабличнойЧасти.Цена = ТекЦена;
				
				ТекСуммаВычисленная = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
				Если НЕ ТекСуммаВычисленная = ТекСумма Тогда
					ТекСуммаСкидки = ТекСуммаВычисленная - ТекСумма;
					ТекСумма = ТекСуммаВычисленная;
				КонецЕсли;
				
				Если ТекСумма>0 Тогда
					Если ТекСумма>ТекСуммаСкидки Тогда
						СтрокаТабличнойЧасти.Сумма = ТекСумма - ТекСуммаСкидки;
						СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = (ТекСуммаСкидки*100)/ТекСумма;
					Иначе
						СтрокаТабличнойЧасти.Сумма = 0;
						СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100;
					КонецЕсли;
				КонецЕсли;
				СтрокаТабличнойЧасти.СтавкаНДС = ТекСтавкаНДС;
				СтрокаТабличнойЧасти.СуммаНДС = ТекСуммаНДС;
				
				// Дозаполняем данные в строке
				СтрокаТабличнойЧасти.НомерГТД = Неопределено;
				СтрокаТабличнойЧасти.Содержание = "";
				СтрокаТабличнойЧасти.НеобходимостьВводаАкцизнойМарки = СтрокаТабличнойЧасти.Номенклатура.ВидАлкогольнойПродукции.Маркируемый;
				
				СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(ТекДок.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
				
				Если НЕ НаправлениеДеятельности=НЕОПРЕДЕЛЕНО Тогда
					СтрокаТабличнойЧасти.НаправлениеДеятельности = НаправлениеДеятельности;
				КонецЕсли;
				
				// Обработка возврата товаров
				Если ТекДок.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя И ЗначениеЗаполнено(ТекДок.ДокументОснование) Тогда
						
	 				ЗапросДляСебестоимостиПоВозврату = Новый Запрос;
					ЗапросДляСебестоимостиПоВозврату.Текст = 
						"ВЫБРАТЬ
						|	Запасы.Номенклатура,
						|	СУММА(Запасы.Количество) КАК Количество,
						|	СУММА(Запасы.Сумма) КАК Сумма
						|ИЗ
						|	РегистрНакопления.Запасы КАК Запасы
						|ГДЕ
						|	Запасы.Регистратор = &ДокументОснование
						|	И Запасы.Номенклатура = &Номенклатура
						|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
						|
						|СГРУППИРОВАТЬ ПО
						|	Запасы.Номенклатура";
					
					ЗапросДляСебестоимостиПоВозврату.УстановитьПараметр("ДокументОснование", ТекДок.ДокументОснование);
					ЗапросДляСебестоимостиПоВозврату.УстановитьПараметр("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
					
					РезультатЗапросаДляСебестоимостиПоВозврату = ЗапросДляСебестоимостиПоВозврату.Выполнить();
					
					ВыборкаДетальныеЗаписиДляСебестоимостиПоВозврату = РезультатЗапросаДляСебестоимостиПоВозврату.Выбрать();
					
					Пока ВыборкаДетальныеЗаписиДляСебестоимостиПоВозврату.Следующий() Цикл
						Если СтрокаТабличнойЧасти.Количество >= ВыборкаДетальныеЗаписиДляСебестоимостиПоВозврату.Количество Тогда
							СтрокаТабличнойЧасти.Себестоимость = ВыборкаДетальныеЗаписиДляСебестоимостиПоВозврату.Сумма;
						Иначе
							СтрокаТабличнойЧасти.Себестоимость = (ВыборкаДетальныеЗаписиДляСебестоимостиПоВозврату.Сумма * СтрокаТабличнойЧасти.Количество) / ВыборкаДетальныеЗаписиДляСебестоимостиПоВозврату.Количество;
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Обработка возврата товаров
			Если ТекДок.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя И ЗначениеЗаполнено(ТекДок.ДокументОснование) Тогда
				УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseDoc,ТекДок.ДокументОснование);
				ТекДок.ДокументОснование = НЕОПРЕДЕЛЕНО;
				
				СтруктураДополнительныхРеквизитов_СтруктурныеЕдиницы = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
				ПодразделениеПродажи = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов_СтруктурныеЕдиницы.SaleSubdivision);
				Если ЗначениеЗаполнено(ПодразделениеПродажи) Тогда
					ТекДок.Подразделение = ПодразделениеПродажи;
				КонецЕсли;
			КонецЕсли;
			
			ТекДок.НомерВходящегоДокумента = InvoiceNumber;
			ТекДок.ДатаВходящегоДокумента = ДатаJSON(InvoiceDate);
			
			ТекДок.КоличествоТоваров = ТекДок.Запасы.Итог("Количество");
						
			// Проводим
			ОписаниеУспешногоПроведения = "Doc purchase updated successfully";
			ЗаписыватьПриОшибках=ЛОЖЬ;
			ОписаниеДляМассиваОшибок="";
			ФиксироватьТранзакции=ЛОЖЬ;
			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
			
			СтрокаОшибок = РЕЗ.Описание;
			// Получаем возврат наличных из кассы
			Если РЕЗ.Результат Тогда
				Если НЕ CashExpenseOrder = НЕОПРЕДЕЛЕНО Тогда
					
					Если ТипЗНЧ(CashExpenseOrder) = Тип("Массив") Тогда
						
						Для Каждого ТекCashExpenseOrder из CashExpenseOrder Цикл
							
							Если ТекCashExpenseOrder.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashExpenseOrder.Вставить("Ref",Ref);
							КонецЕсли;
							
							Если ТекCashExpenseOrder.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashExpenseOrder.Вставить("Number",Number);
							КонецЕсли;
							
							Если ТекCashExpenseOrder.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashExpenseOrder.Вставить("Date",Date+1);
							КонецЕсли;
							
							Если ТекCashExpenseOrder.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashExpenseOrder.Вставить("PartnerCIN",PartnerCIN);
							КонецЕсли;
							
							Если ТекCashExpenseOrder.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashExpenseOrder.Вставить("WarehouseCode",WarehouseCode);
							КонецЕсли;
							
							Если ТекCashExpenseOrder.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashExpenseOrder.Вставить("Currency",Currency);
							КонецЕсли;
							
							Если ТекCashExpenseOrder.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashExpenseOrder.Вставить("Description",Description);
							КонецЕсли;
							
							РЕЗ = СоздатьИлиОбновитьРасходИзКассыИзПриходнойНакладной(РЕЗ,ТекCashExpenseOrder,Ref);
							
							Если НЕ РЕЗ.Результат Тогда
								РЕЗ.Описание = СтрокаОшибок + "; Cash expense order: " + РЕЗ.Описание;
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
					Иначе	

						Если CashExpenseOrder.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
							CashExpenseOrder.Вставить("Ref",Ref);
						КонецЕсли;
						
						Если CashExpenseOrder.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
							CashExpenseOrder.Вставить("Number",Number);
						КонецЕсли;
						
						Если CashExpenseOrder.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
							CashExpenseOrder.Вставить("Date",Date+1);
						КонецЕсли;
						
						Если CashExpenseOrder.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
							CashExpenseOrder.Вставить("PartnerCIN",PartnerCIN);
						КонецЕсли;
						
						Если CashExpenseOrder.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
							CashExpenseOrder.Вставить("WarehouseCode",WarehouseCode);
						КонецЕсли;
						
						Если CashExpenseOrder.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
							CashExpenseOrder.Вставить("Currency",Currency);
						КонецЕсли;
						
						Если CashExpenseOrder.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
							CashExpenseOrder.Вставить("Description",Description);
						КонецЕсли;
						
						РЕЗ = СоздатьИлиОбновитьРасходИзКассыИзПриходнойНакладной(РЕЗ,CashExpenseOrder,Ref);
						
						Если НЕ РЕЗ.Результат Тогда
							РЕЗ.Описание = СтрокаОшибок + "; Cash expense order: " + РЕЗ.Описание;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			Если РЕЗ.Результат Тогда
				РЕЗ.Описание = "Doc purchase updated successfully";
				ЗафиксироватьТранзакцию()
			Иначе
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				РЕЗ.Описание = СтрЗаменить(РЕЗ.Описание,"Doc purchase updated successfully","Update purchases doc: error");
			КонецЕсли;
		
		КонецЕсли;
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc purchase not found";
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция УдалитьПриходнуюНакладную(СтруктураДляВозврата,СоответствиеОбъекта,РасходнаяНакладнаяRef=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	ЗначениеПараметра = СоответствиеОбъекта.Получить("Ref");
	
	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Удаляем расходы и кассы
	СтруктураДополнительныхРеквизитовРасходИзКассы = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходИзКассы);
	ДопПараметрРасходИзКассы = СтруктураДополнительныхРеквизитовРасходИзКассы.BaseRef;
	
	ЗапросРасходИзКассы = Новый Запрос;
	ЗапросРасходИзКассы.Текст = "ВЫБРАТЬ
	                                |	РасходИзКассыДополнительныеРеквизиты.Ссылка
	                                |ИЗ
	                                |	Документ.РасходИзКассы.ДополнительныеРеквизиты КАК РасходИзКассыДополнительныеРеквизиты
	                                |ГДЕ
	                                |	РасходИзКассыДополнительныеРеквизиты.Значение = &ТекПараметр
	                                |	И РасходИзКассыДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ЗапросРасходИзКассы.УстановитьПараметр("ТекПараметр", ЗначениеПараметра);
	ЗапросРасходИзКассы.УстановитьПараметр("ДопПараметр", ДопПараметрРасходИзКассы);
	РезультатЗапросаРасходИзКассы = ЗапросРасходИзКассы.Выполнить();
	ВыборкаРасходИзКассы = РезультатЗапросаРасходИзКассы.Выбрать();
	Пока ВыборкаРасходИзКассы.Следующий() Цикл
		
		ТекОбъект = ВыборкаРасходИзКассы.Ссылка.ПолучитьОбъект();
		
		ТекОбъект.УстановитьПометкуУдаления(ИСТИНА);
		
	КонецЦикла;
	
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
		
	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПриходнаяНакладнаяДополнительныеРеквизиты.Ссылка
	                      |ИЗ
	                      |	Документ.ПриходнаяНакладная.ДополнительныеРеквизиты КАК ПриходнаяНакладнаяДополнительныеРеквизиты
	                      |ГДЕ
	                      |	ПриходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
	                      |	И ПриходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	СтрокаОтветаДляУдачногоРезультата = "Doc purchase deleted successfully";
	СтрокаОтветаОбъектНеНайден = "Doc purchase not found";
	
	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден,ДопПараметр);
	
	Возврат РЕЗ;
КонецФункции
#КонецОбласти

#Область ВозвратТоваровОтПокупателя
Функция СоздатьВозвратТоваровОтПокупателя(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
		
	ТекВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя");
	Ref = СоответствиеОбъекта.Получить("Ref");
	BaseRef = СоответствиеОбъекта.Получить("BaseRef");
	
	Если НЕ BaseRef=НЕОПРЕДЕЛЕНО Тогда
		
		СтруктураДополнительныхРеквизитовДанныеЗаполнения = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
		ДопПараметрДанныеЗаполнения = СтруктураДополнительныхРеквизитовДанныеЗаполнения.DocRef;
		
		ЗапросДанныеЗаполнения = Новый Запрос();
		ЗапросДанныеЗаполнения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	РасходнаяНакладнаяДополнительныеРеквизиты.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная.ДополнительныеРеквизиты КАК РасходнаяНакладнаяДополнительныеРеквизиты
		|ГДЕ
		|	РасходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
		|	И РасходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
		ЗапросДанныеЗаполнения.УстановитьПараметр("ТекПараметр", BaseRef);
		ЗапросДанныеЗаполнения.УстановитьПараметр("ДопПараметр", ДопПараметрДанныеЗаполнения);
				
		РезультатЗапросаДанныеЗаполнения = ЗапросДанныеЗаполнения.Выполнить();
		Если РезультатЗапросаДанныеЗаполнения.Пустой() Тогда
		
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "A base-document not found";
			
		Иначе
			
			РЕЗ = СоздатьПриходнуюНакладную(СтруктураДляВозврата,СоответствиеОбъекта,BaseRef,ТекВидОперации);
			Если РЕЗ.Описание = "Doc purchase created successfully" Тогда
				РЕЗ.Описание = "Doc return of goods created successfully";
			ИначеЕсли РЕЗ.Описание = "Doc purchase already exist" Тогда
				РЕЗ.Описание = "Doc return of goods already exist";
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "A base-document ref incorrect";
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьВозвратТоваровОтПокупателя(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
		
	ТекВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя");
	Ref = СоответствиеОбъекта.Получить("Ref");
	BaseRef = СоответствиеОбъекта.Получить("BaseRef");
	
	Если НЕ BaseRef=НЕОПРЕДЕЛЕНО Тогда
		
		СтруктураДополнительныхРеквизитовДанныеЗаполнения = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
		ДопПараметрДанныеЗаполнения = СтруктураДополнительныхРеквизитовДанныеЗаполнения.DocRef;
		
		ЗапросДанныеЗаполнения = Новый Запрос();
		ЗапросДанныеЗаполнения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	РасходнаяНакладнаяДополнительныеРеквизиты.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная.ДополнительныеРеквизиты КАК РасходнаяНакладнаяДополнительныеРеквизиты
		|ГДЕ
		|	РасходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
		|	И РасходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
		ЗапросДанныеЗаполнения.УстановитьПараметр("ТекПараметр", BaseRef);
		ЗапросДанныеЗаполнения.УстановитьПараметр("ДопПараметр", ДопПараметрДанныеЗаполнения);
				
		РезультатЗапросаДанныеЗаполнения = ЗапросДанныеЗаполнения.Выполнить();
		Если РезультатЗапросаДанныеЗаполнения.Пустой() Тогда
		
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "A base-document not found";
			
		Иначе
			
			РЕЗ = ОбновитьПриходнуюНакладную(СтруктураДляВозврата,СоответствиеОбъекта,BaseRef,ТекВидОперации);
			Если РЕЗ.Описание = "Doc purchase updated successfully" Тогда
				РЕЗ.Описание = "Doc return of goods updated successfully";
			ИначеЕсли РЕЗ.Описание = "Doc purchase not found" Тогда
				РЕЗ.Описание = "Doc return of goods not found";
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "A base-document ref incorrect";
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция УдалитьВозвратТоваровОтПокупателя(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	ЗначениеПараметра = СоответствиеОбъекта.Получить("Ref");
	
	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Удаляем расходы и кассы
	СтруктураДополнительныхРеквизитовРасходИзКассы = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходИзКассы);
	ДопПараметрРасходИзКассы = СтруктураДополнительныхРеквизитовРасходИзКассы.BaseRef;
	
	ЗапросРасходИзКассы = Новый Запрос;
	ЗапросРасходИзКассы.Текст = "ВЫБРАТЬ
	                                |	РасходИзКассыДополнительныеРеквизиты.Ссылка
	                                |ИЗ
	                                |	Документ.РасходИзКассы.ДополнительныеРеквизиты КАК РасходИзКассыДополнительныеРеквизиты
	                                |ГДЕ
	                                |	РасходИзКассыДополнительныеРеквизиты.Значение = &ТекПараметр
	                                |	И РасходИзКассыДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ЗапросРасходИзКассы.УстановитьПараметр("ТекПараметр", ЗначениеПараметра);
	ЗапросРасходИзКассы.УстановитьПараметр("ДопПараметр", ДопПараметрРасходИзКассы);
	РезультатЗапросаРасходИзКассы = ЗапросРасходИзКассы.Выполнить();
	ВыборкаРасходИзКассы = РезультатЗапросаРасходИзКассы.Выбрать();
	Пока ВыборкаРасходИзКассы.Следующий() Цикл
		
		ТекОбъект = ВыборкаРасходИзКассы.Ссылка.ПолучитьОбъект();
		
		ТекОбъект.УстановитьПометкуУдаления(ИСТИНА);
		
	КонецЦикла;
	
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
		
	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПриходнаяНакладнаяДополнительныеРеквизиты.Ссылка
	                      |ИЗ
	                      |	Документ.ПриходнаяНакладная.ДополнительныеРеквизиты КАК ПриходнаяНакладнаяДополнительныеРеквизиты
	                      |ГДЕ
	                      |	ПриходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
	                      |	И ПриходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	СтрокаОтветаДляУдачногоРезультата = "Doc return of goods deleted successfully";
	СтрокаОтветаОбъектНеНайден = "Doc return of goods not found";
	
	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден,ДопПараметр);
	
	Возврат РЕЗ;
КонецФункции

Функция СоздатьИлиОбновитьВозвратТоваровОтПокупателяИзРасходнойНакладной(СтруктураДляВозврата,СоответствиеОбъекта,Ref) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);

	РеквизитовПриходнаяНакладнаяRef = СоответствиеОбъекта.Получить("Ref");
	
	СтруктураДополнительныхРеквизитовПриходнаяНакладная = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная);
	ДопПараметрПоступлениеНаСчет = СтруктураДополнительныхРеквизитовПриходнаяНакладная.DocRef;
	
	ЗапросПоступлениеНаСчет = Новый Запрос;
	ЗапросПоступлениеНаСчет.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПриходнаяНакладнаяДополнительныеРеквизиты.Ссылка
	|ИЗ
	|	Документ.ПриходнаяНакладная.ДополнительныеРеквизиты КАК ПриходнаяНакладнаяДополнительныеРеквизиты
	|ГДЕ
	|	ПриходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
	|	И ПриходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ЗапросПоступлениеНаСчет.УстановитьПараметр("ТекПараметр", РеквизитовПриходнаяНакладнаяRef);
	ЗапросПоступлениеНаСчет.УстановитьПараметр("ДопПараметр", ДопПараметрПоступлениеНаСчет);
	РезультатЗапросаПоступлениеНаСчет = ЗапросПоступлениеНаСчет.Выполнить();
	Если РезультатЗапросаПоступлениеНаСчет.Пустой() Тогда
		РЕЗ = СоздатьПриходнуюНакладную(РЕЗ,СоответствиеОбъекта,Ref);
	Иначе
		РЕЗ = ОбновитьПриходнуюНакладную(РЕЗ,СоответствиеОбъекта,Ref);
	КонецЕсли;	

	Возврат РЕЗ;
КонецФункции // ()
#КонецОбласти

#Область ПеремещениеЗапасов
Функция СоздатьПеремещениеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	DepartureWarehouseCode = СоответствиеОбъекта.Получить("DepartureWarehouseCode");
	DepartureWarehouseAutoOrder = СоответствиеОбъекта.Получить("DepartureWarehouseAutoOrder");
	ReceiverWarehouseCode = СоответствиеОбъекта.Получить("ReceiverWarehouseCode");
	ReceiverWarehouseAutoOrder = СоответствиеОбъекта.Получить("ReceiverWarehouseAutoOrder");
	Description = СоответствиеОбъекта.Получить("Description");
	Type = СоответствиеОбъекта.Получить("Type");
	BaseRef = СоответствиеОбъекта.Получить("BaseRef");
	BaseNumber = СоответствиеОбъекта.Получить("BaseNumber");
	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ДокументОснование = НЕОПРЕДЕЛЕНО;
	Если ЗначениеЗаполнено(BaseRef) Тогда
		РЕЗ = ПолучитьДокументПоСсылке(СтруктураДляВозврата,СокрЛП(Строка(BaseRef)));
		Если РЕЗ.Результат Тогда
			ДокументОснование = РЕЗ.ВозвращаемоеЗначение;
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = BaseRef;
			РЕЗ.Описание = "Base document not found";
			
			Возврат РЕЗ;
		КонецЕсли;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect tabular section";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеЗапасов);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПеремещениеЗапасовДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.ПеремещениеЗапасов.ДополнительныеРеквизиты КАК ПеремещениеЗапасовДополнительныеРеквизиты
	               |ГДЕ
	               |	ПеремещениеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И ПеремещениеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		//Ищем Склад-отправитель
		Если РЕЗ.Результат Тогда
			ТекСкладОтправитель = НайтиСклад(СокрЛП(DepartureWarehouseCode));
			Если ТекСкладОтправитель = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = DepartureWarehouseCode;
				РЕЗ.Описание = "Departure warehouse not found";
			
			КонецЕсли;
		КонецЕсли;
		
		//Ищем Склад-получатель
		Если РЕЗ.Результат Тогда
			ТекСкладПолучатель = НайтиСклад(СокрЛП(ReceiverWarehouseCode));
			Если ТекСкладОтправитель = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = ReceiverWarehouseCode;
				РЕЗ.Описание = "Receiver warehouse not found";
			
			КонецЕсли;
		КонецЕсли;
		
		Если РЕЗ.Результат Тогда
			
			НачатьТранзакцию();
		
			ТекДок = Документы.ПеремещениеЗапасов.СоздатьДокумент();
			
			ТекДок.Дата = ДатаДокумента;
			ТекДок.УстановитьНовыйНомер();
			
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеПоЯчейкам")] = "ЗаполнитьПоПеремещениюПоЯчейкам";
			СтратегияЗаполнения[Тип("ДокументСсылка.СборкаЗапасов")] = "ЗаполнитьПоСборкеЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказНаПроизводство")] = "ЗаполнитьПоЗаказуНаПроизводство";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриходныйОрдер")] = "ЗаполнитьПоПриходномуОрдеру";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПриходнойНакладной";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
			СтратегияЗаполнения[Тип("ДокументСсылка.ВнутреннийЗаказ")] = "ЗаполнитьПоВнутреннийЗаказ";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеЗапасов")] = "ЗаполнитьПоПеремещениеЗапасов";
			
			ИсключаяСвойства = "ЗаказПокупателя";
			Если ТипЗНЧ(ДокументОснование)=Тип("ДокументСсылка.ПеремещениеЗапасов")
				ИЛИ ТипЗНЧ(ДокументОснование)=Тип("ДокументОбъект.ПеремещениеЗапасов")
				Тогда
				
				ТекМетаданные = ДокументОснование.Метаданные();
				Для каждого ТекРеквизит Из ТекМетаданные.Реквизиты Цикл
					ИсключаяСвойства = ИсключаяСвойства + "," + ТекРеквизит.Имя;
				КонецЦикла;
				
			КонецЕсли;
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, ДокументОснование, СтратегияЗаполнения, ИсключаяСвойства);
			
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseRef,BaseRef);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseNumber,BaseNumber);
			
			Если ЗначениеЗаполнено(Type) Тогда
				
				ТекType = НЕОПРЕДЕЛЕНО;
				
				Если ТипЗНЧ(Type)=Тип("Число") Тогда
					Если Type=1 Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Оrdinary1",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					ИначеЕсли Type=2 Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Оrdinary2",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					ИначеЕсли Type=3 Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Adjustment""-""",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					ИначеЕсли Type=4 Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Adjustment""+""",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					КонецЕсли;
				ИначеЕсли ТипЗНЧ(Type)=Тип("Строка") Тогда
					Если (Type="Оrdinary1")ИЛИ(Type="Обычный1") Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Оrdinary1",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					ИначеЕсли (Type="Оrdinary2")ИЛИ(Type="Обычный2") Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Оrdinary2",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					ИначеЕсли (Type="Adjustment-")ИЛИ(Type="Корректировка-") Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Adjustment""-""",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					ИначеЕсли (Type="Adjustment+")ИЛИ(Type="Корректировка+") Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Adjustment""+""",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					КонецЕсли;
				КонецЕсли;
				
				Если ТекType = НЕОПРЕДЕЛЕНО Тогда
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Type;
					РЕЗ.Описание = "Incorrect transfer type";
				Иначе
					УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.Type,ТекType);				
				КонецЕсли;
				
			КонецЕсли;
			
			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
			ТекДок.Комментарий = Description;
			
			ТекДок.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение");
			
			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
			ТекДок.СтруктурнаяЕдиница = ТекСкладОтправитель;
			ТекДок.СтруктурнаяЕдиницаПолучатель = ТекСкладПолучатель;
			
			ТекДок.ПодписьКладовщикаОтправил = ТекДок.СтруктурнаяЕдиница.ПодписьМОЛ;
			ТекДок.ПодписьКладовщикаПолучил = ТекДок.СтруктурнаяЕдиницаПолучатель.ПодписьМОЛ;
			
			//Если ТекДок.СтруктурнаяЕдиницаПолучатель.ОрдерныйСклад И УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") Тогда
			//	ТекДок.ЧерезТранзитныйСклад = ИСТИНА;
			//	ТекДок.СтруктурнаяЕдиницаКонечныйПолучатель = ТекДок.СтруктурнаяЕдиницаПолучатель;
			//	ТекДок.СтруктурнаяЕдиницаПолучатель 		= УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("СтруктурныеЕдиницы", "ТранзитныйСклад");
			//КонецЕсли;
			
			// Заполняем табличную часть
			МассивОшибок = Новый Массив();
			ТекДок.Запасы.Очистить();
			Для каждого СоответствиеОбъекта Из TabularSection Цикл
			
				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
				
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Прервать;
				
				КонецЕсли;				
				
				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
				Quantity = СоответствиеОбъекта.Получить("Quantity");
				
				ТекКоличество = 0;
				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
				
				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Product not found";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
						ТекКоличество = Число(Quantity);
					Иначе
						ТекКоличество = 0;
					КонецЕсли
				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
					ТекКоличество = Quantity;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid quantity";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Quantity);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.СтранаПроисхождения = СтрокаТабличнойЧасти.Номенклатура.СтранаПроисхождения;
				СтрокаТабличнойЧасти.Количество = ТекКоличество;
				СтрокаТабличнойЧасти.ВнеоборотныйАктив = ЛОЖЬ;
				
			КонецЦикла;
			
			// Проверка остатков
			РЕЗ = ПолучитьМассивОшибокПоОстаткам(ТекДок,ТекДок.СтруктурнаяЕдиница,РЕЗ,МассивОшибок);
			
			ТекДок.КоличествоТоваров = ТекДок.Запасы.Итог("Количество");
						
			// Проводим
			ОписаниеУспешногоПроведения = "Doc transfer created successfully";
			ЗаписыватьПриОшибках=ЛОЖЬ;
			ОписаниеДляМассиваОшибок="Not enough balances in the departure warehouse";
			ФиксироватьТранзакции=ЛОЖЬ;
			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
			
			СтрокаОшибок = РЕЗ.Описание;
			// Проверяем автоматическое создание расходного ордера
			Если РЕЗ.Результат Тогда
				Если ТекДок.СтруктурнаяЕдиница.ОрдерныйСклад Тогда
					Если НЕ DepartureWarehouseAutoOrder=НЕОПРЕДЕЛЕНО Тогда
						Если DepartureWarehouseAutoOrder Тогда
							
							СоответствиеОбъектаРасходныйОрдер = Новый Соответствие();
							СоответствиеОбъектаРасходныйОрдер.Вставить("Ref",Ref);
							СоответствиеОбъектаРасходныйОрдер.Вставить("Number",Number);
							СоответствиеОбъектаРасходныйОрдер.Вставить("Date",Date+1);
							СоответствиеОбъектаРасходныйОрдер.Вставить("TransferNumber",Number);
							СоответствиеОбъектаРасходныйОрдер.Вставить("OdrerWarehouseCode",DepartureWarehouseCode);
							СоответствиеОбъектаРасходныйОрдер.Вставить("Description",Description);
							СоответствиеОбъектаРасходныйОрдер.Вставить("TabularSection",Новый Массив());
							
							
							// Ищем существующий расходный ордер
							СтруктураДополнительныхРеквизитовРасходныйОрдер = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходныйОрдер);
							ДопПараметрРасходныйОрдер = СтруктураДополнительныхРеквизитовРасходныйОрдер.DocRef;
							
							ЗапросРасходныйОрдер = Новый Запрос;
							ЗапросРасходныйОрдер.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
							|	РасходныйОрдерДополнительныеРеквизиты.Ссылка
							|ИЗ
							|	Документ.РасходныйОрдер.ДополнительныеРеквизиты КАК РасходныйОрдерДополнительныеРеквизиты
							|ГДЕ
							|	РасходныйОрдерДополнительныеРеквизиты.Значение = &ТекПараметр
							|	И РасходныйОрдерДополнительныеРеквизиты.Свойство = &ДопПараметр";
							
							ЗапросРасходныйОрдер.УстановитьПараметр("ТекПараметр", Ref);
							ЗапросРасходныйОрдер.УстановитьПараметр("ДопПараметр", ДопПараметрРасходныйОрдер);
							РезультатЗапросаРасходныйОрдер = ЗапросРасходныйОрдер.Выполнить();
							Если РезультатЗапросаРасходныйОрдер.Пустой() Тогда
								ОчищатьТЧЗапасы=ЛОЖЬ;
								РЕЗ = СоздатьРасходныйОрдер(СтруктураДляВозврата,СоответствиеОбъектаРасходныйОрдер,ТекДок.Ссылка,ОчищатьТЧЗапасы);
							Иначе
								ОчищатьТЧЗапасы=ЛОЖЬ;
								РЕЗ = ОбновитьРасходныйОрдер(СтруктураДляВозврата,СоответствиеОбъектаРасходныйОрдер,ТекДок.Ссылка,ОчищатьТЧЗапасы);
							КонецЕсли;
							
							Если НЕ РЕЗ.Результат Тогда
								РЕЗ.Описание = СтрокаОшибок + "; Income order: " + РЕЗ.Описание;
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// Проверяем автоматическое создание приходного ордера
			Если РЕЗ.Результат Тогда
				Если ТекДок.СтруктурнаяЕдиницаПолучатель.ОрдерныйСклад Тогда
					Если НЕ ReceiverWarehouseAutoOrder=НЕОПРЕДЕЛЕНО Тогда
						Если ReceiverWarehouseAutoOrder Тогда
							
							СоответствиеОбъектаПриходныйОрдер = Новый Соответствие();
							СоответствиеОбъектаПриходныйОрдер.Вставить("Ref",Ref);
							СоответствиеОбъектаПриходныйОрдер.Вставить("Number",Number);
							СоответствиеОбъектаПриходныйОрдер.Вставить("Date",Date+1);
							СоответствиеОбъектаПриходныйОрдер.Вставить("TransferNumber",Number);
							СоответствиеОбъектаПриходныйОрдер.Вставить("OdrerWarehouseCode",ReceiverWarehouseCode);
							СоответствиеОбъектаПриходныйОрдер.Вставить("Description",Description);
							СоответствиеОбъектаПриходныйОрдер.Вставить("TabularSection",Новый Массив());
							
							
							// Ищем существующий приходный ордер
							СтруктураДополнительныхРеквизитовПриходныйОрдер = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходныйОрдер);
							ДопПараметрПриходныйОрдер = СтруктураДополнительныхРеквизитовПриходныйОрдер.DocRef;
							
							ЗапросПриходныйОрдер = Новый Запрос;
							ЗапросПриходныйОрдер.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
							|	ПриходныйОрдерДополнительныеРеквизиты.Ссылка
							|ИЗ
							|	Документ.ПриходныйОрдер.ДополнительныеРеквизиты КАК ПриходныйОрдерДополнительныеРеквизиты
							|ГДЕ
							|	ПриходныйОрдерДополнительныеРеквизиты.Значение = &ТекПараметр
							|	И ПриходныйОрдерДополнительныеРеквизиты.Свойство = &ДопПараметр";
							
							ЗапросПриходныйОрдер.УстановитьПараметр("ТекПараметр", Ref);
							ЗапросПриходныйОрдер.УстановитьПараметр("ДопПараметр", ДопПараметрПриходныйОрдер);
							РезультатЗапросаПриходныйОрдер = ЗапросПриходныйОрдер.Выполнить();
							Если РезультатЗапросаПриходныйОрдер.Пустой() Тогда
								ОчищатьТЧЗапасы=ЛОЖЬ;
								РЕЗ = СоздатьПриходныйОрдер(СтруктураДляВозврата,СоответствиеОбъектаПриходныйОрдер,ТекДок.Ссылка,ОчищатьТЧЗапасы);
							Иначе
								ОчищатьТЧЗапасы=ЛОЖЬ;
								РЕЗ = ОбновитьПриходныйОрдер(СтруктураДляВозврата,СоответствиеОбъектаРасходныйОрдер,ТекДок.Ссылка,ОчищатьТЧЗапасы);
							КонецЕсли;
							
							Если НЕ РЕЗ.Результат Тогда
								РЕЗ.Описание = СтрокаОшибок + "; Expense order: " + РЕЗ.Описание;
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
						
			Если РЕЗ.Результат Тогда
				РЕЗ.Описание = "Doc transfer created successfully";
				ЗафиксироватьТранзакцию()
			Иначе
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				РЕЗ.Описание = СтрЗаменить(РЕЗ.Описание,"Doc transfer created successfully","Creating transfer doc: error");
			КонецЕсли;
		
		КонецЕсли;
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc transfer already exist";		
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьПеремещениеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	DepartureWarehouseCode = СоответствиеОбъекта.Получить("DepartureWarehouseCode");
	DepartureWarehouseAutoOrder = СоответствиеОбъекта.Получить("DepartureWarehouseAutoOrder");
	ReceiverWarehouseCode = СоответствиеОбъекта.Получить("ReceiverWarehouseCode");
	ReceiverWarehouseAutoOrder = СоответствиеОбъекта.Получить("ReceiverWarehouseAutoOrder");
	Description = СоответствиеОбъекта.Получить("Description");
	Type = СоответствиеОбъекта.Получить("Type");
	BaseRef = СоответствиеОбъекта.Получить("BaseRef");
	BaseNumber = СоответствиеОбъекта.Получить("BaseNumber");
	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ДокументОснование = НЕОПРЕДЕЛЕНО;
	Если ЗначениеЗаполнено(BaseRef) Тогда
		РЕЗ = ПолучитьДокументПоСсылке(СтруктураДляВозврата,СокрЛП(Строка(BaseRef)));
		Если РЕЗ.Результат Тогда
			ДокументОснование = РЕЗ.ВозвращаемоеЗначение;
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = BaseRef;
			РЕЗ.Описание = "Base document not found";
			
			Возврат РЕЗ;
		КонецЕсли;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect tabular section";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеЗапасов);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПеремещениеЗапасовДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.ПеремещениеЗапасов.ДополнительныеРеквизиты КАК ПеремещениеЗапасовДополнительныеРеквизиты
	               |ГДЕ
	               |	ПеремещениеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И ПеремещениеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		//Ищем Склад-отправитель
		Если РЕЗ.Результат Тогда
			ТекСкладОтправитель = НайтиСклад(СокрЛП(DepartureWarehouseCode));
			Если ТекСкладОтправитель = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = DepartureWarehouseCode;
				РЕЗ.Описание = "Departure warehouse not found";
			
			КонецЕсли;
		КонецЕсли;
		
		//Ищем Склад-получатель
		Если РЕЗ.Результат Тогда
			ТекСкладПолучатель = НайтиСклад(СокрЛП(ReceiverWarehouseCode));
			Если ТекСкладОтправитель = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = ReceiverWarehouseCode;
				РЕЗ.Описание = "Receiver warehouse not found";
			
			КонецЕсли;
		КонецЕсли;
		
		Если РЕЗ.Результат Тогда
		
			НачатьТранзакцию();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТекДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			КонецЦикла;
			
			// Убираем пометку удаления
			Попытка
				Если ТекДок.ПометкаУдаления Тогда
					ТекДок.Записать(РежимЗаписиДокумента.Запись);
					ТекДок.УстановитьПометкуУдаления(ЛОЖЬ);
				КонецЕсли;
			Исключение
				
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Internal processing error";
				
				Возврат РЕЗ;
			КонецПопытки;
			
			ТекДок.Дата = ДатаДокумента;
			
			Если НЕ ДокументОснование = НЕОПРЕДЕЛЕНО Тогда
				
				СтратегияЗаполнения = Новый Соответствие;
				СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеПоЯчейкам")] = "ЗаполнитьПоПеремещениюПоЯчейкам";
				СтратегияЗаполнения[Тип("ДокументСсылка.СборкаЗапасов")] = "ЗаполнитьПоСборкеЗапасов";
				СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказНаПроизводство")] = "ЗаполнитьПоЗаказуНаПроизводство";
				СтратегияЗаполнения[Тип("ДокументСсылка.ПриходныйОрдер")] = "ЗаполнитьПоПриходномуОрдеру";
				СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПриходнойНакладной";
				СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
				СтратегияЗаполнения[Тип("ДокументСсылка.ВнутреннийЗаказ")] = "ЗаполнитьПоВнутреннийЗаказ";
				СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеЗапасов")] = "ЗаполнитьПоПеремещениеЗапасов";
				
				ИсключаяСвойства = "ЗаказПокупателя";
				Если ТипЗНЧ(ДокументОснование)=Тип("ДокументСсылка.ПеремещениеЗапасов")
					ИЛИ ТипЗНЧ(ДокументОснование)=Тип("ДокументОбъект.ПеремещениеЗапасов")
					Тогда
					
					ТекМетаданные = ДокументОснование.Метаданные();
					Для каждого ТекРеквизит Из ТекМетаданные.Реквизиты Цикл
						ИсключаяСвойства = ИсключаяСвойства + "," + ТекРеквизит.Имя;
					КонецЦикла;
					
				КонецЕсли;
				
				ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, ДокументОснование, СтратегияЗаполнения, ИсключаяСвойства);	
				
			КонецЕсли;			
			
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseRef,BaseRef);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseNumber,BaseNumber);
			
			Если ЗначениеЗаполнено(Type) Тогда
				
				ТекType = НЕОПРЕДЕЛЕНО;
				
				Если ТипЗНЧ(Type)=Тип("Число") Тогда
					Если Type=1 Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Оrdinary1",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					ИначеЕсли Type=2 Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Оrdinary2",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					ИначеЕсли Type=3 Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Adjustment""-""",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					ИначеЕсли Type=4 Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Adjustment""+""",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					КонецЕсли;
				ИначеЕсли ТипЗНЧ(Type)=Тип("Строка") Тогда
					Если (Type="Оrdinary1")ИЛИ(Type="Обычный1") Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Оrdinary1",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					ИначеЕсли (Type="Оrdinary2")ИЛИ(Type="Обычный2") Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Оrdinary2",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					ИначеЕсли (Type="Adjustment-")ИЛИ(Type="Корректировка-") Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Adjustment""-""",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					ИначеЕсли (Type="Adjustment+")ИЛИ(Type="Корректировка+") Тогда
						ТекType = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Adjustment""+""",ИСТИНА,,СтруктураДополнительныхРеквизитов.Type);
					КонецЕсли;
				КонецЕсли;
				
				Если ТекType = НЕОПРЕДЕЛЕНО Тогда
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Type;
					РЕЗ.Описание = "Incorrect transfer type";
				Иначе
					УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.Type,ТекType);				
				КонецЕсли;
				
			КонецЕсли;
			
			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
			ТекДок.Комментарий = Description;
			
			ТекДок.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение");
			
			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
			ТекДок.СтруктурнаяЕдиница = ТекСкладОтправитель;
			ТекДок.СтруктурнаяЕдиницаПолучатель = ТекСкладПолучатель;
			
			ТекДок.ПодписьКладовщикаОтправил = ТекДок.СтруктурнаяЕдиница.ПодписьМОЛ;
			ТекДок.ПодписьКладовщикаПолучил = ТекДок.СтруктурнаяЕдиницаПолучатель.ПодписьМОЛ;
			
			//Если ТекДок.СтруктурнаяЕдиницаПолучатель.ОрдерныйСклад И УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") Тогда
			//	ТекДок.ЧерезТранзитныйСклад = ИСТИНА;
			//	ТекДок.СтруктурнаяЕдиницаКонечныйПолучатель = ТекДок.СтруктурнаяЕдиницаПолучатель;
			//	ТекДок.СтруктурнаяЕдиницаПолучатель 		= УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("СтруктурныеЕдиницы", "ТранзитныйСклад");
			//КонецЕсли;
			
			// Заполняем табличную часть
			МассивОшибок = Новый Массив();
			ТекДок.Запасы.Очистить();
			Для каждого СоответствиеОбъекта Из TabularSection Цикл
			
				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
				
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Прервать;
				
				КонецЕсли;				
				
				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
				Quantity = СоответствиеОбъекта.Получить("Quantity");
				
				ТекКоличество = 0;
				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
				
				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Product not found";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
						ТекКоличество = Число(Quantity);
					Иначе
						ТекКоличество = 0;
					КонецЕсли
				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
					ТекКоличество = Quantity;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid quantity";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Quantity);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.СтранаПроисхождения = СтрокаТабличнойЧасти.Номенклатура.СтранаПроисхождения;
				СтрокаТабличнойЧасти.Количество = ТекКоличество;
				СтрокаТабличнойЧасти.ВнеоборотныйАктив = ЛОЖЬ;
				
			КонецЦикла;
			
			// Проверка остатков
			РЕЗ = ПолучитьМассивОшибокПоОстаткам(ТекДок,ТекДок.СтруктурнаяЕдиница,РЕЗ,МассивОшибок);
			
			ТекДок.КоличествоТоваров = ТекДок.Запасы.Итог("Количество");
			
			// Проводим
			ОписаниеУспешногоПроведения = "Doc transfer updated successfully";
			ЗаписыватьПриОшибках=ЛОЖЬ;
			ОписаниеДляМассиваОшибок="Not enough balances in the departure warehouse";
			ФиксироватьТранзакции=ЛОЖЬ;
			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
			
			СтрокаОшибок = РЕЗ.Описание;
			// Проверяем автоматическое создание расходного ордера
			Если РЕЗ.Результат Тогда
				Если ТекДок.СтруктурнаяЕдиница.ОрдерныйСклад Тогда
					Если НЕ DepartureWarehouseAutoOrder=НЕОПРЕДЕЛЕНО Тогда
						Если DepartureWarehouseAutoOrder Тогда
							
							СоответствиеОбъектаРасходныйОрдер = Новый Соответствие();
							СоответствиеОбъектаРасходныйОрдер.Вставить("Ref",Ref);
							СоответствиеОбъектаРасходныйОрдер.Вставить("Number",Number);
							СоответствиеОбъектаРасходныйОрдер.Вставить("Date",Date+1);
							СоответствиеОбъектаРасходныйОрдер.Вставить("TransferNumber",Number);
							СоответствиеОбъектаРасходныйОрдер.Вставить("OdrerWarehouseCode",DepartureWarehouseCode);
							СоответствиеОбъектаРасходныйОрдер.Вставить("Description",Description);
							СоответствиеОбъектаРасходныйОрдер.Вставить("TabularSection",Новый Массив());
							
							
							// Ищем существующий расходный ордер
							СтруктураДополнительныхРеквизитовРасходныйОрдер = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходныйОрдер);
							ДопПараметрРасходныйОрдер = СтруктураДополнительныхРеквизитовРасходныйОрдер.DocRef;
							
							ЗапросРасходныйОрдер = Новый Запрос;
							ЗапросРасходныйОрдер.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
							|	РасходныйОрдерДополнительныеРеквизиты.Ссылка
							|ИЗ
							|	Документ.РасходныйОрдер.ДополнительныеРеквизиты КАК РасходныйОрдерДополнительныеРеквизиты
							|ГДЕ
							|	РасходныйОрдерДополнительныеРеквизиты.Значение = &ТекПараметр
							|	И РасходныйОрдерДополнительныеРеквизиты.Свойство = &ДопПараметр";
							
							ЗапросРасходныйОрдер.УстановитьПараметр("ТекПараметр", Ref);
							ЗапросРасходныйОрдер.УстановитьПараметр("ДопПараметр", ДопПараметрРасходныйОрдер);
							РезультатЗапросаРасходныйОрдер = ЗапросРасходныйОрдер.Выполнить();
							Если РезультатЗапросаРасходныйОрдер.Пустой() Тогда
								ОчищатьТЧЗапасы=ЛОЖЬ;
								РЕЗ = СоздатьРасходныйОрдер(СтруктураДляВозврата,СоответствиеОбъектаРасходныйОрдер,ТекДок.Ссылка,ОчищатьТЧЗапасы);
							Иначе
								ОчищатьТЧЗапасы=ЛОЖЬ;
								РЕЗ = ОбновитьРасходныйОрдер(СтруктураДляВозврата,СоответствиеОбъектаРасходныйОрдер,ТекДок.Ссылка,ОчищатьТЧЗапасы);
							КонецЕсли;
							
							Если НЕ РЕЗ.Результат Тогда
								РЕЗ.Описание = СтрокаОшибок + "; Income order: " + РЕЗ.Описание;
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// Проверяем автоматическое создание приходного ордера
			Если РЕЗ.Результат Тогда
				Если ТекДок.СтруктурнаяЕдиницаПолучатель.ОрдерныйСклад Тогда
					Если НЕ ReceiverWarehouseAutoOrder=НЕОПРЕДЕЛЕНО Тогда
						Если ReceiverWarehouseAutoOrder Тогда
							
							СоответствиеОбъектаПриходныйОрдер = Новый Соответствие();
							СоответствиеОбъектаПриходныйОрдер.Вставить("Ref",Ref);
							СоответствиеОбъектаПриходныйОрдер.Вставить("Number",Number);
							СоответствиеОбъектаПриходныйОрдер.Вставить("Date",Date+1);
							СоответствиеОбъектаПриходныйОрдер.Вставить("TransferNumber",Number);
							СоответствиеОбъектаПриходныйОрдер.Вставить("OdrerWarehouseCode",ReceiverWarehouseCode);
							СоответствиеОбъектаПриходныйОрдер.Вставить("Description",Description);
							СоответствиеОбъектаПриходныйОрдер.Вставить("TabularSection",Новый Массив());
							
							
							// Ищем существующий приходный ордер
							СтруктураДополнительныхРеквизитовПриходныйОрдер = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходныйОрдер);
							ДопПараметрПриходныйОрдер = СтруктураДополнительныхРеквизитовПриходныйОрдер.DocRef;
							
							ЗапросПриходныйОрдер = Новый Запрос;
							ЗапросПриходныйОрдер.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
							|	ПриходныйОрдерДополнительныеРеквизиты.Ссылка
							|ИЗ
							|	Документ.ПриходныйОрдер.ДополнительныеРеквизиты КАК ПриходныйОрдерДополнительныеРеквизиты
							|ГДЕ
							|	ПриходныйОрдерДополнительныеРеквизиты.Значение = &ТекПараметр
							|	И ПриходныйОрдерДополнительныеРеквизиты.Свойство = &ДопПараметр";
							
							ЗапросПриходныйОрдер.УстановитьПараметр("ТекПараметр", Ref);
							ЗапросПриходныйОрдер.УстановитьПараметр("ДопПараметр", ДопПараметрПриходныйОрдер);
							РезультатЗапросаПриходныйОрдер = ЗапросПриходныйОрдер.Выполнить();
							Если РезультатЗапросаПриходныйОрдер.Пустой() Тогда
								ОчищатьТЧЗапасы=ЛОЖЬ;
								РЕЗ = СоздатьПриходныйОрдер(СтруктураДляВозврата,СоответствиеОбъектаПриходныйОрдер,ТекДок.Ссылка,ОчищатьТЧЗапасы);
							Иначе
								ОчищатьТЧЗапасы=ЛОЖЬ;
								РЕЗ = ОбновитьПриходныйОрдер(СтруктураДляВозврата,СоответствиеОбъектаРасходныйОрдер,ТекДок.Ссылка,ОчищатьТЧЗапасы);
							КонецЕсли;
							
							Если НЕ РЕЗ.Результат Тогда
								РЕЗ.Описание = СтрокаОшибок + "; Expense order: " + РЕЗ.Описание;
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если РЕЗ.Результат Тогда
				РЕЗ.Описание = "Doc transfer updated successfully";
				ЗафиксироватьТранзакцию()
			Иначе
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				РЕЗ.Описание = СтрЗаменить(РЕЗ.Описание,"Doc transfer updated successfully","Update transfer doc: error");
			КонецЕсли;
			
		КонецЕсли;
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc transfer not found";
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция УдалитьПеремещениеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	ЗначениеПараметра = СоответствиеОбъекта.Получить("Ref");
	
	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеЗапасов);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
		
	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПеремещениеЗапасовДополнительныеРеквизиты.Ссылка
	                      |ИЗ
	                      |	Документ.ПеремещениеЗапасов.ДополнительныеРеквизиты КАК ПеремещениеЗапасовДополнительныеРеквизиты
	                      |ГДЕ
	                      |	ПеремещениеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
	                      |	И ПеремещениеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	СтрокаОтветаДляУдачногоРезультата = "Doc transfer deleted successfully";
	СтрокаОтветаОбъектНеНайден = "Doc transfer not found";
	
	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден,ДопПараметр);
	
	Возврат РЕЗ;
КонецФункции
#КонецОбласти

#Область ПриходныйОрдер
Функция СоздатьПриходныйОрдер(СтруктураДляВозврата,СоответствиеОбъекта,ПеремещениеОснование=НЕОПРЕДЕЛЕНО,ОчищатьТЧЗапасы=ИСТИНА) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	TransferNumber = СоответствиеОбъекта.Получить("TransferNumber");
	OdrerWarehouseCode = СоответствиеОбъекта.Получить("OdrerWarehouseCode");
	Description = СоответствиеОбъекта.Получить("Description");
	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect tabular section";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходныйОрдер);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПриходныйОрдерДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.ПриходныйОрдер.ДополнительныеРеквизиты КАК ПриходныйОрдерДополнительныеРеквизиты
	               |ГДЕ
	               |	ПриходныйОрдерДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И ПриходныйОрдерДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		//Ищем ордерный склад
		Если РЕЗ.Результат Тогда
			ТекОрдерныйСклад = НайтиСклад(СокрЛП(OdrerWarehouseCode));
			Если ТекОрдерныйСклад = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = OdrerWarehouseCode;
				РЕЗ.Описание = "Odrer warehouse not found";
				
			ИначеЕсли НЕ ТекОрдерныйСклад.ОрдерныйСклад Тогда
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = OdrerWarehouseCode;
				РЕЗ.Описание = "Odrer warehouse not found";
			
			КонецЕсли;
		КонецЕсли;
		
		Если РЕЗ.Результат Тогда
			
			// Создаём документ
			ТекДок = Документы.ПриходныйОрдер.СоздатьДокумент();
			
			ТекДок.Дата = ДатаДокумента;
			ТекДок.УстановитьНовыйНомер();
			
			// Ищем перемещение запасов как документ-основание
			ПеремещениеЗапасовДокументОснование = НЕОПРЕДЕЛЕНО;
			Если ТипЗНЧ(ПеремещениеОснование)=Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
				Если ПеремещениеОснование.Проведен Тогда
					ПеремещениеЗапасовДокументОснование = ПеремещениеОснование;
				КонецЕсли;
			КонецЕсли;
			
			Если (ПеремещениеЗапасовДокументОснование = НЕОПРЕДЕЛЕНО) И (ЗначениеЗаполнено(TransferNumber)) Тогда
				
				СтруктураДополнительныхРеквизитов_ПеремещениеЗапасовДокументОснование = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеЗапасов);
				ДопПараметр_ПеремещениеЗапасовДокументОснование = СтруктураДополнительныхРеквизитов_ПеремещениеЗапасовДокументОснование.DocNumber;
				
				Запрос_ПеремещениеЗапасовДокументОснование = Новый Запрос;
				Запрос_ПеремещениеЗапасовДокументОснование.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				                                                   |	ПеремещениеЗапасовДополнительныеРеквизиты.Ссылка
				                                                   |ИЗ
				                                                   |	Документ.ПеремещениеЗапасов.ДополнительныеРеквизиты КАК ПеремещениеЗапасовДополнительныеРеквизиты
				                                                   |ГДЕ
				                                                   |	ПеремещениеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
				                                                   |	И ПеремещениеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
				
				Запрос_ПеремещениеЗапасовДокументОснование.УстановитьПараметр("ТекПараметр", TransferNumber);
				Запрос_ПеремещениеЗапасовДокументОснование.УстановитьПараметр("ДопПараметр", ДопПараметр_ПеремещениеЗапасовДокументОснование);
				РезультатЗапроса_ПеремещениеЗапасовДокументОснование = Запрос_ПеремещениеЗапасовДокументОснование.Выполнить().Выбрать();
				Пока РезультатЗапроса_ПеремещениеЗапасовДокументОснование.Следующий() Цикл
					ПеремещениеЗапасовДокументОснование = РезультатЗапроса_ПеремещениеЗапасовДокументОснование.Ссылка;
				КонецЦикла;
				
			КонецЕсли;
			
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("ДокументСсылка.РасходныйОрдер")] = "ЗаполнитьПоРасходныйОрдер";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПриходнаяНакладная";
			СтратегияЗаполнения[Тип("ДокументСсылка.ОприходованиеЗапасов")] = "ЗаполнитьПоОприходованиеЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПересортицаЗапасов")] = "ЗаполнитьПоПересортицаЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеЗапасов")] = "ЗаполнитьПоПеремещениеЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ОтчетПереработчика")] = "ЗаполнитьПоОтчетПереработчика";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПоставщику")] = "ЗаполнитьПоЗаказПоставщику";
			СтратегияЗаполнения[Тип("ДокументСсылка.СборкаЗапасов")] = "ЗаполнитьПоСборкаЗапасов";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, ПеремещениеЗапасовДокументОснование, СтратегияЗаполнения);
			
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.TransferNumber,TransferNumber);
			
			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
			ТекДок.Комментарий = Description;

			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
			ТекДок.ПодписьРуководителя = ТекДок.Организация.ПодписьРуководителя;
			
			ТекДок.СтруктурнаяЕдиница = ТекОрдерныйСклад;
			ТекДок.ПодписьКладовщика = ТекДок.СтруктурнаяЕдиница.ПодписьМОЛ;
			
			// Заполняем табличную часть
			МассивОшибок = Новый Массив();
			Если ОчищатьТЧЗапасы Тогда
				ТекДок.Запасы.Очистить();
			КонецЕсли;
			Для каждого СоответствиеОбъекта Из TabularSection Цикл
			
				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
				
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Прервать;
				
				КонецЕсли;				
				
				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
				Quantity = СоответствиеОбъекта.Получить("Quantity");
				
				ТекКоличество = 0;
				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
				
				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Product not found";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
						ТекКоличество = Число(Quantity);
					Иначе
						ТекКоличество = 0;
					КонецЕсли
				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
					ТекКоличество = Quantity;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid quantity";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Quantity);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.Количество = ТекКоличество;
				
			КонецЦикла;

			// Проводим
			ОписаниеУспешногоПроведения = "Doc income order created successfully";
			ЗаписыватьПриОшибках=ЛОЖЬ;
			ОписаниеДляМассиваОшибок="";
			ФиксироватьТранзакции=ЛОЖЬ;
			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
		
		КонецЕсли;
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc income order already exist";		
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьПриходныйОрдер(СтруктураДляВозврата,СоответствиеОбъекта,ПеремещениеОснование=НЕОПРЕДЕЛЕНО,ОчищатьТЧЗапасы=ИСТИНА) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	TransferNumber = СоответствиеОбъекта.Получить("TransferNumber");
	OdrerWarehouseCode = СоответствиеОбъекта.Получить("OdrerWarehouseCode");
	Description = СоответствиеОбъекта.Получить("Description");
	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect tabular section";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходныйОрдер);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПриходныйОрдерДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.ПриходныйОрдер.ДополнительныеРеквизиты КАК ПриходныйОрдерДополнительныеРеквизиты
	               |ГДЕ
	               |	ПриходныйОрдерДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И ПриходныйОрдерДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		//Ищем ордерный склад
		Если РЕЗ.Результат Тогда
			ТекОрдерныйСклад = НайтиСклад(СокрЛП(OdrerWarehouseCode));
			Если ТекОрдерныйСклад = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = OdrerWarehouseCode;
				РЕЗ.Описание = "Odrer warehouse not found";
				
			ИначеЕсли НЕ ТекОрдерныйСклад.ОрдерныйСклад Тогда
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = OdrerWarehouseCode;
				РЕЗ.Описание = "Odrer warehouse not found";
			
			КонецЕсли;
		КонецЕсли;
		
		Если РЕЗ.Результат Тогда
		
			НачатьТранзакцию();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТекДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			КонецЦикла;
			
			// Убираем пометку удаления
			Попытка
				Если ТекДок.ПометкаУдаления Тогда
					ТекДок.Записать(РежимЗаписиДокумента.Запись);
					ТекДок.УстановитьПометкуУдаления(ЛОЖЬ);
				КонецЕсли;
			Исключение
				
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Internal processing error";
				
				Возврат РЕЗ;
			КонецПопытки;
						
			ТекДок.Дата = ДатаДокумента;
			
			// Ищем перемещение запасов как документ-основание
			ПеремещениеЗапасовДокументОснование = НЕОПРЕДЕЛЕНО;
			Если ТипЗНЧ(ПеремещениеОснование)=Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
				Если ПеремещениеОснование.Проведен Тогда
					ПеремещениеЗапасовДокументОснование = ПеремещениеОснование;
				КонецЕсли;
			КонецЕсли;
			
			Если (ПеремещениеЗапасовДокументОснование = НЕОПРЕДЕЛЕНО) И (ЗначениеЗаполнено(TransferNumber)) Тогда
				
				СтруктураДополнительныхРеквизитов_ПеремещениеЗапасовДокументОснование = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеЗапасов);
				ДопПараметр_ПеремещениеЗапасовДокументОснование = СтруктураДополнительныхРеквизитов_ПеремещениеЗапасовДокументОснование.DocNumber;
				
				Запрос_ПеремещениеЗапасовДокументОснование = Новый Запрос;
				Запрос_ПеремещениеЗапасовДокументОснование.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				                                                   |	ПеремещениеЗапасовДополнительныеРеквизиты.Ссылка
				                                                   |ИЗ
				                                                   |	Документ.ПеремещениеЗапасов.ДополнительныеРеквизиты КАК ПеремещениеЗапасовДополнительныеРеквизиты
				                                                   |ГДЕ
				                                                   |	ПеремещениеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
				                                                   |	И ПеремещениеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
				
				Запрос_ПеремещениеЗапасовДокументОснование.УстановитьПараметр("ТекПараметр", TransferNumber);
				Запрос_ПеремещениеЗапасовДокументОснование.УстановитьПараметр("ДопПараметр", ДопПараметр_ПеремещениеЗапасовДокументОснование);
				РезультатЗапроса_ПеремещениеЗапасовДокументОснование = Запрос_ПеремещениеЗапасовДокументОснование.Выполнить().Выбрать();
				Пока РезультатЗапроса_ПеремещениеЗапасовДокументОснование.Следующий() Цикл
					ПеремещениеЗапасовДокументОснование = РезультатЗапроса_ПеремещениеЗапасовДокументОснование.Ссылка;
				КонецЦикла;
				
			КонецЕсли;
			
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("ДокументСсылка.РасходныйОрдер")] = "ЗаполнитьПоРасходныйОрдер";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПриходнаяНакладная";
			СтратегияЗаполнения[Тип("ДокументСсылка.ОприходованиеЗапасов")] = "ЗаполнитьПоОприходованиеЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПересортицаЗапасов")] = "ЗаполнитьПоПересортицаЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеЗапасов")] = "ЗаполнитьПоПеремещениеЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ОтчетПереработчика")] = "ЗаполнитьПоОтчетПереработчика";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПоставщику")] = "ЗаполнитьПоЗаказПоставщику";
			СтратегияЗаполнения[Тип("ДокументСсылка.СборкаЗапасов")] = "ЗаполнитьПоСборкаЗапасов";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, ПеремещениеЗапасовДокументОснование, СтратегияЗаполнения);
			
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.TransferNumber,TransferNumber);
			
			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
			ТекДок.Комментарий = Description;

			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
			ТекДок.ПодписьРуководителя = ТекДок.Организация.ПодписьРуководителя;
			
			ТекДок.СтруктурнаяЕдиница = ТекОрдерныйСклад;
			ТекДок.ПодписьКладовщика = ТекДок.СтруктурнаяЕдиница.ПодписьМОЛ;
			
			// Заполняем табличную часть
			МассивОшибок = Новый Массив();
			Если ОчищатьТЧЗапасы Тогда
				ТекДок.Запасы.Очистить();
			КонецЕсли;
			Для каждого СоответствиеОбъекта Из TabularSection Цикл
			
				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
				
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Прервать;
				
				КонецЕсли;				
				
				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
				Quantity = СоответствиеОбъекта.Получить("Quantity");
				
				ТекКоличество = 0;
				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
				
				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Product not found";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
						ТекКоличество = Число(Quantity);
					Иначе
						ТекКоличество = 0;
					КонецЕсли
				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
					ТекКоличество = Quantity;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid quantity";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Quantity);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.Количество = ТекКоличество;
				
			КонецЦикла;			
						
			// Проводим
			ОписаниеУспешногоПроведения = "Doc income order updated successfully";
			ЗаписыватьПриОшибках=ЛОЖЬ;
			ОписаниеДляМассиваОшибок="";
			ФиксироватьТранзакции=ИСТИНА;
			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
		
		КонецЕсли;
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc income order not found";
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция УдалитьПриходныйОрдер(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	ЗначениеПараметра = СоответствиеОбъекта.Получить("Ref");
	
	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходныйОрдер);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
		
	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПриходныйОрдерДополнительныеРеквизиты.Ссылка
	                      |ИЗ
	                      |	Документ.ПриходныйОрдер.ДополнительныеРеквизиты КАК ПриходныйОрдерДополнительныеРеквизиты
	                      |ГДЕ
	                      |	ПриходныйОрдерДополнительныеРеквизиты.Значение = &ТекПараметр
	                      |	И ПриходныйОрдерДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	СтрокаОтветаДляУдачногоРезультата = "Doc income order deleted successfully";
	СтрокаОтветаОбъектНеНайден = "Doc income order not found";
	
	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден,ДопПараметр);
	
	Возврат РЕЗ;
КонецФункции
#КонецОбласти

#Область РасходныйОрдер
Функция СоздатьРасходныйОрдер(СтруктураДляВозврата,СоответствиеОбъекта,ПеремещениеОснование=НЕОПРЕДЕЛЕНО,ОчищатьТЧЗапасы=ИСТИНА) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	TransferNumber = СоответствиеОбъекта.Получить("TransferNumber");
	OdrerWarehouseCode = СоответствиеОбъекта.Получить("OdrerWarehouseCode");
	Description = СоответствиеОбъекта.Получить("Description");
	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect tabular section";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходныйОрдер);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РасходныйОрдерДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.РасходныйОрдер.ДополнительныеРеквизиты КАК РасходныйОрдерДополнительныеРеквизиты
	               |ГДЕ
	               |	РасходныйОрдерДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И РасходныйОрдерДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		//Ищем ордерный склад
		Если РЕЗ.Результат Тогда
			ТекОрдерныйСклад = НайтиСклад(СокрЛП(OdrerWarehouseCode));
			Если ТекОрдерныйСклад = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = OdrerWarehouseCode;
				РЕЗ.Описание = "Odrer warehouse not found";
				
			ИначеЕсли НЕ ТекОрдерныйСклад.ОрдерныйСклад Тогда
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = OdrerWarehouseCode;
				РЕЗ.Описание = "Odrer warehouse not found";
			
			КонецЕсли;
		КонецЕсли;
		
		Если РЕЗ.Результат Тогда
			
			// Создаём документ
			ТекДок = Документы.РасходныйОрдер.СоздатьДокумент();
			
			ТекДок.Дата = ДатаДокумента;
			ТекДок.УстановитьНовыйНомер();
			
			// Ищем перемещение запасов как документ-основание
			ПеремещениеЗапасовДокументОснование = НЕОПРЕДЕЛЕНО;
			Если ТипЗНЧ(ПеремещениеОснование)=Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
				Если ПеремещениеОснование.Проведен Тогда
					ПеремещениеЗапасовДокументОснование = ПеремещениеОснование;
				КонецЕсли;
			КонецЕсли;
			
			Если (ПеремещениеЗапасовДокументОснование = НЕОПРЕДЕЛЕНО) И (ЗначениеЗаполнено(TransferNumber)) Тогда
				
				СтруктураДополнительныхРеквизитов_ПеремещениеЗапасовДокументОснование = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеЗапасов);
				ДопПараметр_ПеремещениеЗапасовДокументОснование = СтруктураДополнительныхРеквизитов_ПеремещениеЗапасовДокументОснование.DocNumber;
				
				Запрос_ПеремещениеЗапасовДокументОснование = Новый Запрос;
				Запрос_ПеремещениеЗапасовДокументОснование.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				                                                   |	ПеремещениеЗапасовДополнительныеРеквизиты.Ссылка
				                                                   |ИЗ
				                                                   |	Документ.ПеремещениеЗапасов.ДополнительныеРеквизиты КАК ПеремещениеЗапасовДополнительныеРеквизиты
				                                                   |ГДЕ
				                                                   |	ПеремещениеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
				                                                   |	И ПеремещениеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
				
				Запрос_ПеремещениеЗапасовДокументОснование.УстановитьПараметр("ТекПараметр", TransferNumber);
				Запрос_ПеремещениеЗапасовДокументОснование.УстановитьПараметр("ДопПараметр", ДопПараметр_ПеремещениеЗапасовДокументОснование);
				РезультатЗапроса_ПеремещениеЗапасовДокументОснование = Запрос_ПеремещениеЗапасовДокументОснование.Выполнить().Выбрать();
				Пока РезультатЗапроса_ПеремещениеЗапасовДокументОснование.Следующий() Цикл
					ПеремещениеЗапасовДокументОснование = РезультатЗапроса_ПеремещениеЗапасовДокументОснование.Ссылка;
				КонецЦикла;
				
			КонецЕсли;
			
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("ДокументСсылка.ОтчетОПереработке")] = "ЗаполнитьПоОтчетОПереработке";
			СтратегияЗаполнения[Тип("ДокументСсылка.РасходнаяНакладная")] = "ЗаполнитьПоРасходнаяНакладная";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказПокупателя";
			СтратегияЗаполнения[Тип("ДокументСсылка.СписаниеЗапасов")] = "ЗаполнитьПоСписаниеЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПересортицаЗапасов")] = "ЗаполнитьПоПересортицаЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеЗапасов")] = "ЗаполнитьПоПеремещениеЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриходныйОрдер")] = "ЗаполнитьПоПриходныйОрдер";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПринятиеКУчетуВА")] = "ЗаполнитьПоПринятиеКУчетуВА";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, ПеремещениеЗапасовДокументОснование, СтратегияЗаполнения);
			
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.TransferNumber,TransferNumber);
			
			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
			ТекДок.Комментарий = Description;

			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
			
			ТекДок.СтруктурнаяЕдиница = ТекОрдерныйСклад;
			ТекДок.ПодписьКладовщика = ТекДок.СтруктурнаяЕдиница.ПодписьМОЛ;
			
			// Заполняем табличную часть
			МассивОшибок = Новый Массив();
			Если ОчищатьТЧЗапасы Тогда
				ТекДок.Запасы.Очистить();
			КонецЕсли;
			Для каждого СоответствиеОбъекта Из TabularSection Цикл
			
				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
				
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Прервать;
				
				КонецЕсли;				
				
				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
				Quantity = СоответствиеОбъекта.Получить("Quantity");
				
				ТекКоличество = 0;
				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
				
				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Product not found";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
						ТекКоличество = Число(Quantity);
					Иначе
						ТекКоличество = 0;
					КонецЕсли
				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
					ТекКоличество = Quantity;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid quantity";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Quantity);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.Количество = ТекКоличество;
				
			КонецЦикла;

			// Проводим
			ОписаниеУспешногоПроведения = "Doc expense order created successfully";
			ЗаписыватьПриОшибках=ЛОЖЬ;
			ОписаниеДляМассиваОшибок="";
			ФиксироватьТранзакции=ЛОЖЬ;
			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
		
		КонецЕсли;
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc expense order already exist";		
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьРасходныйОрдер(СтруктураДляВозврата,СоответствиеОбъекта,ПеремещениеОснование=НЕОПРЕДЕЛЕНО,ОчищатьТЧЗапасы=ИСТИНА) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	TransferNumber = СоответствиеОбъекта.Получить("TransferNumber");
	OdrerWarehouseCode = СоответствиеОбъекта.Получить("OdrerWarehouseCode");
	Description = СоответствиеОбъекта.Получить("Description");
	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect tabular section";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходныйОрдер);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РасходныйОрдерДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.РасходныйОрдер.ДополнительныеРеквизиты КАК РасходныйОрдерДополнительныеРеквизиты
	               |ГДЕ
	               |	РасходныйОрдерДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И РасходныйОрдерДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		//Ищем ордерный склад
		Если РЕЗ.Результат Тогда
			ТекОрдерныйСклад = НайтиСклад(СокрЛП(OdrerWarehouseCode));
			Если ТекОрдерныйСклад = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = OdrerWarehouseCode;
				РЕЗ.Описание = "Odrer warehouse not found";
				
			ИначеЕсли НЕ ТекОрдерныйСклад.ОрдерныйСклад Тогда
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = OdrerWarehouseCode;
				РЕЗ.Описание = "Odrer warehouse not found";
			
			КонецЕсли;
		КонецЕсли;
		
		Если РЕЗ.Результат Тогда
		
			НачатьТранзакцию();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТекДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			КонецЦикла;
			
			// Убираем пометку удаления
			Попытка
				Если ТекДок.ПометкаУдаления Тогда
					ТекДок.Записать(РежимЗаписиДокумента.Запись);
					ТекДок.УстановитьПометкуУдаления(ЛОЖЬ);
				КонецЕсли;
			Исключение
				
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Internal processing error";
				
				Возврат РЕЗ;
			КонецПопытки;
						
			ТекДок.Дата = ДатаДокумента;
			
			// Ищем перемещение запасов как документ-основание
			ПеремещениеЗапасовДокументОснование = НЕОПРЕДЕЛЕНО;
			Если ТипЗНЧ(ПеремещениеОснование)=Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
				Если ПеремещениеОснование.Проведен Тогда
					ПеремещениеЗапасовДокументОснование = ПеремещениеОснование;
				КонецЕсли;
			КонецЕсли;
			
			Если (ПеремещениеЗапасовДокументОснование = НЕОПРЕДЕЛЕНО) И (ЗначениеЗаполнено(TransferNumber)) Тогда
				
				СтруктураДополнительныхРеквизитов_ПеремещениеЗапасовДокументОснование = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеЗапасов);
				ДопПараметр_ПеремещениеЗапасовДокументОснование = СтруктураДополнительныхРеквизитов_ПеремещениеЗапасовДокументОснование.DocNumber;
				
				Запрос_ПеремещениеЗапасовДокументОснование = Новый Запрос;
				Запрос_ПеремещениеЗапасовДокументОснование.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				                                                   |	ПеремещениеЗапасовДополнительныеРеквизиты.Ссылка
				                                                   |ИЗ
				                                                   |	Документ.ПеремещениеЗапасов.ДополнительныеРеквизиты КАК ПеремещениеЗапасовДополнительныеРеквизиты
				                                                   |ГДЕ
				                                                   |	ПеремещениеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
				                                                   |	И ПеремещениеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
				
				Запрос_ПеремещениеЗапасовДокументОснование.УстановитьПараметр("ТекПараметр", TransferNumber);
				Запрос_ПеремещениеЗапасовДокументОснование.УстановитьПараметр("ДопПараметр", ДопПараметр_ПеремещениеЗапасовДокументОснование);
				РезультатЗапроса_ПеремещениеЗапасовДокументОснование = Запрос_ПеремещениеЗапасовДокументОснование.Выполнить().Выбрать();
				Пока РезультатЗапроса_ПеремещениеЗапасовДокументОснование.Следующий() Цикл
					ПеремещениеЗапасовДокументОснование = РезультатЗапроса_ПеремещениеЗапасовДокументОснование.Ссылка;
				КонецЦикла;
				
			КонецЕсли;
			
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("ДокументСсылка.ОтчетОПереработке")] = "ЗаполнитьПоОтчетОПереработке";
			СтратегияЗаполнения[Тип("ДокументСсылка.РасходнаяНакладная")] = "ЗаполнитьПоРасходнаяНакладная";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказПокупателя";
			СтратегияЗаполнения[Тип("ДокументСсылка.СписаниеЗапасов")] = "ЗаполнитьПоСписаниеЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПересортицаЗапасов")] = "ЗаполнитьПоПересортицаЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеЗапасов")] = "ЗаполнитьПоПеремещениеЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриходныйОрдер")] = "ЗаполнитьПоПриходныйОрдер";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПринятиеКУчетуВА")] = "ЗаполнитьПоПринятиеКУчетуВА";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, ПеремещениеЗапасовДокументОснование, СтратегияЗаполнения);
			
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.TransferNumber,TransferNumber);
			
			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
			ТекДок.Комментарий = Description;

			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
			
			ТекДок.СтруктурнаяЕдиница = ТекОрдерныйСклад;
			ТекДок.ПодписьКладовщика = ТекДок.СтруктурнаяЕдиница.ПодписьМОЛ;
			
			// Заполняем табличную часть
			МассивОшибок = Новый Массив();
			Если ОчищатьТЧЗапасы Тогда
				ТекДок.Запасы.Очистить();
			КонецЕсли;
			Для каждого СоответствиеОбъекта Из TabularSection Цикл
			
				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
				
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Прервать;
				
				КонецЕсли;				
				
				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
				Quantity = СоответствиеОбъекта.Получить("Quantity");
				
				ТекКоличество = 0;
				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
				
				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Product not found";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
						ТекКоличество = Число(Quantity);
					Иначе
						ТекКоличество = 0;
					КонецЕсли
				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
					ТекКоличество = Quantity;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid quantity";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Quantity);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.Количество = ТекКоличество;
				
			КонецЦикла;			
						
			// Проводим
			ОписаниеУспешногоПроведения = "Doc expense order updated successfully";
			ЗаписыватьПриОшибках=ЛОЖЬ;
			ОписаниеДляМассиваОшибок="";
			ФиксироватьТранзакции=ИСТИНА;
			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
		
		КонецЕсли;
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc expense order not found";
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция УдалитьРасходныйОрдер(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	ЗначениеПараметра = СоответствиеОбъекта.Получить("Ref");
	
	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходныйОрдер);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
		
	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	РасходныйОрдерДополнительныеРеквизиты.Ссылка
	                      |ИЗ
	                      |	Документ.РасходныйОрдер.ДополнительныеРеквизиты КАК РасходныйОрдерДополнительныеРеквизиты
	                      |ГДЕ
	                      |	РасходныйОрдерДополнительныеРеквизиты.Значение = &ТекПараметр
	                      |	И РасходныйОрдерДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	СтрокаОтветаДляУдачногоРезультата = "Doc expense order deleted successfully";
	СтрокаОтветаОбъектНеНайден = "Doc expense order not found";
	
	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден,ДопПараметр);
	
	Возврат РЕЗ;
КонецФункции
#КонецОбласти

#Область ОприходованиеЗапасов
Функция СоздатьОприходованиеЗапасовИзлишки(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
			
	КонецЕсли;
	
	//Ищем склад
	ТекСклад = НЕОПРЕДЕЛЕНО;
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Если РЕЗ.Результат Тогда
		ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
		Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
			РЕЗ.Описание = "Warehouse not found";
		КонецЕсли;
	КонецЕсли;
	
	Если РЕЗ.Результат Тогда
		СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
		Подразделение = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов.SurplusSubdivision);
		
		РЕЗ = СоздатьОприходованиеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта,НастройкиПоУмолчанию,НастройкиПоУмолчанию.КорреспонденцияРеглОприходованиеЗапасов,Подразделение);
	КонецЕсли;
		
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьОприходованиеЗапасовИзлишки(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
			
	КонецЕсли;
	
	//Ищем склад
	ТекСклад = НЕОПРЕДЕЛЕНО;
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Если РЕЗ.Результат Тогда
		ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
		Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
			РЕЗ.Описание = "Warehouse not found";
		КонецЕсли;
	КонецЕсли;
	
	Если РЕЗ.Результат Тогда
		СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
		Подразделение = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов.SurplusSubdivision);
		
		РЕЗ = ОбновитьОприходованиеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта,НастройкиПоУмолчанию,НастройкиПоУмолчанию.КорреспонденцияРеглОприходованиеЗапасов,Подразделение);
	КонецЕсли;
		
	Возврат РЕЗ;
КонецФункции

Функция СоздатьОприходованиеЗапасовИнвентаризация(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
			
	КонецЕсли;
	
	//Ищем склад
	ТекСклад = НЕОПРЕДЕЛЕНО;
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Если РЕЗ.Результат Тогда
		ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
		Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
			РЕЗ.Описание = "Warehouse not found";
		КонецЕсли;
	КонецЕсли;
	
	Если РЕЗ.Результат Тогда
		СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
		Подразделение = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов.SurplusInventorySubdivision);
		
		РЕЗ = СоздатьОприходованиеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта,НастройкиПоУмолчанию,НастройкиПоУмолчанию.КорреспонденцияРеглОприходованиеЗапасовИнвентаризация,Подразделение);
	КонецЕсли;
		
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьОприходованиеЗапасовИнвентаризация(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
			
	КонецЕсли;
	
	//Ищем склад
	ТекСклад = НЕОПРЕДЕЛЕНО;
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Если РЕЗ.Результат Тогда
		ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
		Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
			РЕЗ.Описание = "Warehouse not found";
		КонецЕсли;
	КонецЕсли;
	
	Если РЕЗ.Результат Тогда
		СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
		Подразделение = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов.SurplusInventorySubdivision);
		
		РЕЗ = ОбновитьОприходованиеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта,НастройкиПоУмолчанию,НастройкиПоУмолчанию.КорреспонденцияРеглОприходованиеЗапасовИнвентаризация,Подразделение);
	КонецЕсли;
		
	Возврат РЕЗ;
КонецФункции

Функция СоздатьОприходованиеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта, НастройкиПоУмолчанию, СчетКоррекспорденцииРегл, Подразделение=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Description = СоответствиеОбъекта.Получить("Description");
	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	//НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	//Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	//
	//	РЕЗ.Результат = ЛОЖЬ;
	//	РЕЗ.ВозвращаемоеЗначение = Ref;
	//	РЕЗ.Описание = "Incorrect default settings";
	//	
	//	Возврат РЕЗ;
	//
	//КонецЕсли;
	
	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect tabular section";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОприходованиеЗапасов);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ОприходованиеЗапасовДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.ОприходованиеЗапасов.ДополнительныеРеквизиты КАК ОприходованиеЗапасовДополнительныеРеквизиты
	               |ГДЕ
	               |	ОприходованиеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И ОприходованиеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		//Ищем склад
		Если РЕЗ.Результат Тогда
			ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
			Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
				РЕЗ.Описание = "Warehouse not found";
			КонецЕсли;
		КонецЕсли;
		
		Если РЕЗ.Результат Тогда
		
			ТекДок = Документы.ОприходованиеЗапасов.СоздатьДокумент();
			
			ТекДок.Дата = ДатаДокумента;
			ТекДок.УстановитьНовыйНомер();
			
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("ДокументСсылка.ИнвентаризацияЗапасов")] = "ЗаполнитьПоИнвентаризацииЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриходныйОрдер")] = "ЗаполнитьПоПриходномуОрдеру";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриемИПередачаВРемонт")] = "ЗаполнитьПоПриемИПередачаВРемонт";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, НЕОПРЕДЕЛЕНО, СтратегияЗаполнения);
			
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
					
			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
			ТекДок.Комментарий = Description;
			
			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
			
			ТекДок.СтруктурнаяЕдиница = ТекСклад;
			ТекДок.ПодписьКладовщика = ТекДок.СтруктурнаяЕдиница.ПодписьМОЛ;
			
			ТекДок.Корреспонденция = ПланыСчетов.Управленческий.ПрочиеДоходы;
			ТекДок.КорреспонденцияРегл = СчетКоррекспорденцииРегл;
			РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(ТекДок.КорреспонденцияРегл, ТекДок.Корреспонденция);
			
			Если ЗначениеЗаполнено(Подразделение) Тогда
				ТекДок.Подразделение = Подразделение;
			КонецЕсли;
			
			// Заполняем табличную часть
			МассивОшибок = Новый Массив();
			ТекДок.Запасы.Очистить();
			Для каждого СоответствиеОбъекта Из TabularSection Цикл
			
				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
				
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Прервать;
				
				КонецЕсли;				
				
				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
				Quantity = СоответствиеОбъекта.Получить("Quantity");
				
				ТекКоличество = 0;
				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
				
				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Product not found";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
						ТекКоличество = Число(Quantity);
					Иначе
						ТекКоличество = 0;
					КонецЕсли
				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
					ТекКоличество = Quantity;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid quantity";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Quantity);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.СтранаПроисхождения = СтрокаТабличнойЧасти.Номенклатура.СтранаПроисхождения;
				СтрокаТабличнойЧасти.Количество = ТекКоличество;
				
				БухОстатки = ПолучитьОстаткиТовараПоБухСчетам(СтрокаТабличнойЧасти.Номенклатура,ТекСклад,ТекДок.Дата);
				Если БухОстатки.Цена>0 Тогда
					СтрокаТабличнойЧасти.Цена = БухОстатки.Цена;
				КонецЕсли;
				
				//Если ЗначениеЗаполнено(ТекДок.ВидЦен) И СтрокаТабличнойЧасти.Цена=0 Тогда
				//	
				//	СтруктураДанные = Новый Структура();
				//	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
				//	СтруктураДанные.Вставить("ДатаОбработки", ТекДок.Дата);
				//	СтруктураДанные.Вставить("Организация", ТекДок.Организация);
				//	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
				//	СтруктураДанные.Вставить("ВидЦен", ТекДок.ВидЦен);
				//	СтруктураДанные.Вставить("Коэффициент", 1);
				//	
				//	СтруктураДанные.Вставить("ВалютаДокумента", Константы.ВалютаУчета.Получить());
				//	Цена = УправлениеНебольшойФирмойСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
				//	СтруктураДанные.Вставить("Цена", Цена);
				//	
				//	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
				//	
				//КонецЕсли;
				
				Если СтрокаТабличнойЧасти.Цена=0 Тогда
					
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Cost of goods is not determined";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
					
				Иначе
					
					СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ТекДок.КоличествоТоваров = ТекДок.Запасы.Итог("Количество");
			
			// Проводим
			ОписаниеУспешногоПроведения = "Doc surplus created successfully";
			ЗаписыватьПриОшибках=ИСТИНА;
			ОписаниеДляМассиваОшибок="Doc surplus has been created successfully but not posted";
			ФиксироватьТранзакции=ЛОЖЬ;
			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
		
		КонецЕсли;
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc surplus already exist";		
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьОприходованиеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта, НастройкиПоУмолчанию, СчетКоррекспорденцииРегл=НЕОПРЕДЕЛЕНО, Подразделение=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Description = СоответствиеОбъекта.Получить("Description");
	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	//НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	//Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	//
	//	РЕЗ.Результат = ЛОЖЬ;
	//	РЕЗ.ВозвращаемоеЗначение = Ref;
	//	РЕЗ.Описание = "Incorrect default settings";
	//	
	//	Возврат РЕЗ;
	//
	//КонецЕсли;
	
	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect tabular section";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОприходованиеЗапасов);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ОприходованиеЗапасовДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.ОприходованиеЗапасов.ДополнительныеРеквизиты КАК ОприходованиеЗапасовДополнительныеРеквизиты
	               |ГДЕ
	               |	ОприходованиеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И ОприходованиеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		//Ищем склад
		Если РЕЗ.Результат Тогда
			ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
			Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
				РЕЗ.Описание = "Warehouse not found";
			КонецЕсли;
		КонецЕсли;
		
		Если РЕЗ.Результат Тогда
		
			НачатьТранзакцию();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТекДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			КонецЦикла;
			
			// Убираем пометку удаления
			Попытка
				Если ТекДок.ПометкаУдаления Тогда
					ТекДок.Записать(РежимЗаписиДокумента.Запись);
					ТекДок.УстановитьПометкуУдаления(ЛОЖЬ);
				КонецЕсли;
			Исключение
				
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Internal processing error";
				
				Возврат РЕЗ;
			КонецПопытки;
			
			ТекДок.Дата = ДатаДокумента;
			
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
						
			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
			ТекДок.Комментарий = Description;

			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
			
			ТекДок.СтруктурнаяЕдиница = ТекСклад;
			ТекДок.ПодписьКладовщика = ТекДок.СтруктурнаяЕдиница.ПодписьМОЛ;
			
			Если ЗначениеЗаполнено(СчетКоррекспорденцииРегл) Тогда
				ТекДок.Корреспонденция = ПланыСчетов.Управленческий.ПрочиеДоходы;
				ТекДок.КорреспонденцияРегл = СчетКоррекспорденцииРегл;
				РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(ТекДок.КорреспонденцияРегл, ТекДок.Корреспонденция);	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Подразделение) Тогда
				ТекДок.Подразделение = Подразделение;
			КонецЕсли;
		
			// Заполняем табличную часть
			МассивОшибок = Новый Массив();
			ТекДок.Запасы.Очистить();
			Для каждого СоответствиеОбъекта Из TabularSection Цикл
			
				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
					
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Прервать;
				
				КонецЕсли;				
				
				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
				Quantity = СоответствиеОбъекта.Получить("Quantity");
				
				ТекКоличество = 0;
				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
				
				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Product not found";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
						ТекКоличество = Число(Quantity);
					Иначе
						ТекКоличество = 0;
					КонецЕсли
				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
					ТекКоличество = Quantity;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid quantity";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Quantity);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.СтранаПроисхождения = СтрокаТабличнойЧасти.Номенклатура.СтранаПроисхождения;
				СтрокаТабличнойЧасти.Количество = ТекКоличество;
				
				БухОстатки = ПолучитьОстаткиТовараПоБухСчетам(СтрокаТабличнойЧасти.Номенклатура,ТекСклад,ТекДок.Дата);
				Если БухОстатки.Цена>0 Тогда
					СтрокаТабличнойЧасти.Цена = БухОстатки.Цена;
				КонецЕсли;
				
				//Если ЗначениеЗаполнено(ТекДок.ВидЦен) И СтрокаТабличнойЧасти.Цена=0 Тогда
				//	
				//	СтруктураДанные = Новый Структура();
				//	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
				//	СтруктураДанные.Вставить("ДатаОбработки", ТекДок.Дата);
				//	СтруктураДанные.Вставить("Организация", ТекДок.Организация);
				//	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
				//	СтруктураДанные.Вставить("ВидЦен", ТекДок.ВидЦен);
				//	СтруктураДанные.Вставить("Коэффициент", 1);
				//	
				//	СтруктураДанные.Вставить("ВалютаДокумента", Константы.ВалютаУчета.Получить());
				//	Цена = УправлениеНебольшойФирмойСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
				//	СтруктураДанные.Вставить("Цена", Цена);
				//	
				//	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
				//	
				//КонецЕсли;
				
				Если СтрокаТабличнойЧасти.Цена=0 Тогда
					
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Cost of goods is not determined";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
					
				Иначе
					
					СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ТекДок.КоличествоТоваров = ТекДок.Запасы.Итог("Количество");
			
			// Проводим
			ОписаниеУспешногоПроведения = "Doc surplus updated successfully";
			ЗаписыватьПриОшибках=ИСТИНА;
			ОписаниеДляМассиваОшибок="Doc surplus has been updated successfully but not posted";
			ФиксироватьТранзакции=ИСТИНА;
			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
		
		КонецЕсли;
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc surplus not found";
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция УдалитьОприходованиеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	ЗначениеПараметра = СоответствиеОбъекта.Получить("Ref");
	
	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОприходованиеЗапасов);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
		
	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ОприходованиеЗапасовДополнительныеРеквизиты.Ссылка
	                      |ИЗ
	                      |	Документ.ОприходованиеЗапасов.ДополнительныеРеквизиты КАК ОприходованиеЗапасовДополнительныеРеквизиты
	                      |ГДЕ
	                      |	ОприходованиеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
	                      |	И ОприходованиеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	СтрокаОтветаДляУдачногоРезультата = "Doc surplus deleted successfully";
	СтрокаОтветаОбъектНеНайден = "Doc surplus not found";
	
	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден,ДопПараметр);
	
	Возврат РЕЗ;
КонецФункции
#КонецОбласти

#Область СписаниеЗапасов
Функция СоздатьСписаниеЗапасовНедостача(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
			
	КонецЕсли;
	
	//Ищем склад
	ТекСклад = НЕОПРЕДЕЛЕНО;
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Если РЕЗ.Результат Тогда
		ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
		Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
			РЕЗ.Описание = "Warehouse not found";
		КонецЕсли;
	КонецЕсли;
	
	Если РЕЗ.Результат Тогда
		СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
		Подразделение = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов.WriteОffSubdivision);
		
		РЕЗ = СоздатьСписаниеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта,НастройкиПоУмолчанию,НастройкиПоУмолчанию.КорреспонденцияРеглСписаниеЗапасов,Подразделение);
	КонецЕсли;
		
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьСписаниеЗапасовНедостача(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
			
	КонецЕсли;
	
	//Ищем склад
	ТекСклад = НЕОПРЕДЕЛЕНО;
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Если РЕЗ.Результат Тогда
		ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
		Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
			РЕЗ.Описание = "Warehouse not found";
		КонецЕсли;
	КонецЕсли;
	
	Если РЕЗ.Результат Тогда
		СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
		Подразделение = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов.WriteОffSubdivision);
		
		РЕЗ = ОбновитьСписаниеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта,НастройкиПоУмолчанию,НастройкиПоУмолчанию.КорреспонденцияРеглСписаниеЗапасов,Подразделение);
	КонецЕсли;
		
	Возврат РЕЗ;
КонецФункции

Функция СоздатьСписаниеЗапасовУниформа(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
			
	КонецЕсли;
	
	//Ищем склад
	ТекСклад = НЕОПРЕДЕЛЕНО;
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Если РЕЗ.Результат Тогда
		ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
		Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
			РЕЗ.Описание = "Warehouse not found";
		КонецЕсли;
	КонецЕсли;
	
	Если РЕЗ.Результат Тогда
		СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
		Подразделение = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов.WriteОffUniformSubdivision);
		Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
			Подразделение = НастройкиПоУмолчанию.ПодразделениеСписаниеЗапасовУниформа;
		КонецЕсли;
		
		РЕЗ = СоздатьСписаниеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта,НастройкиПоУмолчанию,НастройкиПоУмолчанию.КорреспонденцияРеглСписаниеЗапасовУниформа,Подразделение);
	КонецЕсли;
		
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьСписаниеЗапасовУниформа(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
			
	КонецЕсли;
	
	//Ищем склад
	ТекСклад = НЕОПРЕДЕЛЕНО;
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Если РЕЗ.Результат Тогда
		ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
		Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
			РЕЗ.Описание = "Warehouse not found";
		КонецЕсли;
	КонецЕсли;
	
	Если РЕЗ.Результат Тогда
		СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
		Подразделение = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов.WriteОffUniformSubdivision);
		Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
			Подразделение = НастройкиПоУмолчанию.ПодразделениеСписаниеЗапасовУниформа;
		КонецЕсли;
		
		РЕЗ = ОбновитьСписаниеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта,НастройкиПоУмолчанию,НастройкиПоУмолчанию.КорреспонденцияРеглСписаниеЗапасовУниформа,Подразделение);
	КонецЕсли;
		
	Возврат РЕЗ;
КонецФункции

Функция СоздатьСписаниеЗапасовУтилизация(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
			
	КонецЕсли;
	
	//Ищем склад
	ТекСклад = НЕОПРЕДЕЛЕНО;
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Если РЕЗ.Результат Тогда
		ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
		Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
			РЕЗ.Описание = "Warehouse not found";
		КонецЕсли;
	КонецЕсли;
	
	Если РЕЗ.Результат Тогда
		СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
		Подразделение = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов.WriteОffUtilizationSubdivision);
		Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
			Подразделение = НастройкиПоУмолчанию.ПодразделениеСписаниеЗапасовУтилизация;
		КонецЕсли;
		
		РЕЗ = СоздатьСписаниеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта,НастройкиПоУмолчанию,НастройкиПоУмолчанию.КорреспонденцияРеглСписаниеЗапасовУтилизация,Подразделение);
	КонецЕсли;
		
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьСписаниеЗапасовУтилизация(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
			
	КонецЕсли;
	
	//Ищем склад
	ТекСклад = НЕОПРЕДЕЛЕНО;
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Если РЕЗ.Результат Тогда
		ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
		Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
			РЕЗ.Описание = "Warehouse not found";
		КонецЕсли;
	КонецЕсли;
	
	Если РЕЗ.Результат Тогда
		СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
		Подразделение = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов.WriteОffUtilizationSubdivision);
		Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
			Подразделение = НастройкиПоУмолчанию.ПодразделениеСписаниеЗапасовУтилизация;
		КонецЕсли;
		
		РЕЗ = ОбновитьСписаниеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта,НастройкиПоУмолчанию,НастройкиПоУмолчанию.КорреспонденцияРеглСписаниеЗапасовУтилизация,Подразделение);
	КонецЕсли;
		
	Возврат РЕЗ;
КонецФункции

Функция СоздатьСписаниеЗапасовИнвентаризация(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
			
	КонецЕсли;
	
	//Ищем склад
	ТекСклад = НЕОПРЕДЕЛЕНО;
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Если РЕЗ.Результат Тогда
		ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
		Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
			РЕЗ.Описание = "Warehouse not found";
		КонецЕсли;
	КонецЕсли;
	
	Если РЕЗ.Результат Тогда
		СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
		Подразделение = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов.WriteОffInventorySubdivision);
		Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
			Подразделение = НастройкиПоУмолчанию.ПодразделениеСписаниеЗапасовИнвентаризация;
		КонецЕсли;
		
		РЕЗ = СоздатьСписаниеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта,НастройкиПоУмолчанию,НастройкиПоУмолчанию.КорреспонденцияРеглСписаниеЗапасовИнвентаризация,Подразделение);
	КонецЕсли;
		
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьСписаниеЗапасовИнвентаризация(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
			
	КонецЕсли;
	
	//Ищем склад
	ТекСклад = НЕОПРЕДЕЛЕНО;
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Если РЕЗ.Результат Тогда
		ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
		Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
			РЕЗ.Описание = "Warehouse not found";
		КонецЕсли;
	КонецЕсли;
	
	Если РЕЗ.Результат Тогда
		СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
		Подразделение = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов.WriteОffInventorySubdivision);
		Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
			Подразделение = НастройкиПоУмолчанию.ПодразделениеСписаниеЗапасовИнвентаризация;
		КонецЕсли;
		
		РЕЗ = ОбновитьСписаниеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта,НастройкиПоУмолчанию,НастройкиПоУмолчанию.КорреспонденцияРеглСписаниеЗапасовИнвентаризация,Подразделение);
	КонецЕсли;
		
	Возврат РЕЗ;
КонецФункции

Функция СоздатьСписаниеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта, НастройкиПоУмолчанию, СчетКоррекспорденцииРегл, Подразделение=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Description = СоответствиеОбъекта.Получить("Description");
	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	//НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	//Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	//
	//	РЕЗ.Результат = ЛОЖЬ;
	//	РЕЗ.ВозвращаемоеЗначение = Ref;
	//	РЕЗ.Описание = "Incorrect default settings";
	//	
	//	Возврат РЕЗ;
	//
	//КонецЕсли;
	
	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect tabular section";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СписаниеЗапасов);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СписаниеЗапасовДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.СписаниеЗапасов.ДополнительныеРеквизиты КАК СписаниеЗапасовДополнительныеРеквизиты
	               |ГДЕ
	               |	СписаниеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И СписаниеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		//Ищем склад
		Если РЕЗ.Результат Тогда
			ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
			Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
				РЕЗ.Описание = "Warehouse not found";
			КонецЕсли;
		КонецЕсли;
		
		Если РЕЗ.Результат Тогда
		
			ТекДок = Документы.СписаниеЗапасов.СоздатьДокумент();
			
			ТекДок.Дата = ДатаДокумента;
			ТекДок.УстановитьНовыйНомер();
			
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("ДокументСсылка.ИнвентаризацияЗапасов")] = "ЗаполнитьПоИнвентаризацииЗапасов";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, НЕОПРЕДЕЛЕНО, СтратегияЗаполнения);
			
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
					
			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
			ТекДок.Комментарий = Description;
			
			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
			
			ТекДок.СтруктурнаяЕдиница = ТекСклад;
			
			ТекДок.Корреспонденция = ПланыСчетов.Управленческий.НедостачиИПотериОтПорчиЦенностей;
			ТекДок.КорреспонденцияРегл = СчетКоррекспорденцииРегл;
			РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(ТекДок.КорреспонденцияРегл, ТекДок.Корреспонденция);
			
			Если ЗначениеЗаполнено(Подразделение) Тогда
				ТекДок.Подразделение = Подразделение;
			КонецЕсли;
			
			// Заполняем табличную часть
			МассивОшибок = Новый Массив();
			ТекДок.Запасы.Очистить();
			Для каждого СоответствиеОбъекта Из TabularSection Цикл
			
				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
				
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Прервать;
				
				КонецЕсли;				
				
				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
				Quantity = СоответствиеОбъекта.Получить("Quantity");
				
				ТекКоличество = 0;
				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
				
				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Product not found";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
						ТекКоличество = Число(Quantity);
					Иначе
						ТекКоличество = 0;
					КонецЕсли
				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
					ТекКоличество = Quantity;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid quantity";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Quantity);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.СтранаПроисхождения = СтрокаТабличнойЧасти.Номенклатура.СтранаПроисхождения;
				СтрокаТабличнойЧасти.Количество = ТекКоличество;
				
			КонецЦикла;
			
			// Проверка остатков
			РЕЗ = ПолучитьМассивОшибокПоОстаткам(ТекДок,ТекДок.СтруктурнаяЕдиница,РЕЗ,МассивОшибок);
			
			ТекДок.КоличествоТоваров = ТекДок.Запасы.Итог("Количество");
			
			// Проводим
			ОписаниеУспешногоПроведения = "Doc write-off created successfully";
			ЗаписыватьПриОшибках=ЛОЖЬ;
			ОписаниеДляМассиваОшибок=РЕЗ.Описание;
			ФиксироватьТранзакции=ЛОЖЬ;
			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
		
		КонецЕсли;
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc write-off already exist";		
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьСписаниеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта, НастройкиПоУмолчанию, СчетКоррекспорденцииРегл=НЕОПРЕДЕЛЕНО, Подразделение=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Description = СоответствиеОбъекта.Получить("Description");
	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	//НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	//Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	//
	//	РЕЗ.Результат = ЛОЖЬ;
	//	РЕЗ.ВозвращаемоеЗначение = Ref;
	//	РЕЗ.Описание = "Incorrect default settings";
	//	
	//	Возврат РЕЗ;
	//
	//КонецЕсли;
	
	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect tabular section";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СписаниеЗапасов);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СписаниеЗапасовДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.СписаниеЗапасов.ДополнительныеРеквизиты КАК СписаниеЗапасовДополнительныеРеквизиты
	               |ГДЕ
	               |	СписаниеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И СписаниеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		//Ищем склад
		Если РЕЗ.Результат Тогда
			ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
			Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
				РЕЗ.Описание = "Warehouse not found";
			КонецЕсли;
		КонецЕсли;
		
		Если РЕЗ.Результат Тогда
		
			НачатьТранзакцию();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТекДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			КонецЦикла;
			
			// Убираем пометку удаления
			Попытка
				Если ТекДок.ПометкаУдаления Тогда
					ТекДок.Записать(РежимЗаписиДокумента.Запись);
					ТекДок.УстановитьПометкуУдаления(ЛОЖЬ);
				КонецЕсли;
			Исключение
				
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Internal processing error";
				
				Возврат РЕЗ;
			КонецПопытки;
			
			ТекДок.Дата = ДатаДокумента;
			
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
						
			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
			ТекДок.Комментарий = Description;

			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
			
			ТекДок.СтруктурнаяЕдиница = ТекСклад;
			
			Если ЗначениеЗаполнено(СчетКоррекспорденцииРегл) Тогда
				ТекДок.Корреспонденция = ПланыСчетов.Управленческий.НедостачиИПотериОтПорчиЦенностей;
				ТекДок.КорреспонденцияРегл = СчетКоррекспорденцииРегл;
				РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(ТекДок.КорреспонденцияРегл, ТекДок.Корреспонденция);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Подразделение) Тогда
				ТекДок.Подразделение = Подразделение;
			КонецЕсли;
			
			// Заполняем табличную часть
			МассивОшибок = Новый Массив();
			ТекДок.Запасы.Очистить();
			Для каждого СоответствиеОбъекта Из TabularSection Цикл
			
				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
					
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Прервать;
				
				КонецЕсли;				
				
				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
				Quantity = СоответствиеОбъекта.Получить("Quantity");
				
				ТекКоличество = 0;
				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
				
				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Product not found";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
						ТекКоличество = Число(Quantity);
					Иначе
						ТекКоличество = 0;
					КонецЕсли
				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
					ТекКоличество = Quantity;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid quantity";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Quantity);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.СтранаПроисхождения = СтрокаТабличнойЧасти.Номенклатура.СтранаПроисхождения;
				СтрокаТабличнойЧасти.Количество = ТекКоличество;
				
			КонецЦикла;
			
			// Проверка остатков
			РЕЗ = ПолучитьМассивОшибокПоОстаткам(ТекДок,ТекДок.СтруктурнаяЕдиница,РЕЗ,МассивОшибок);
			
			ТекДок.КоличествоТоваров = ТекДок.Запасы.Итог("Количество");
			
			// Проводим
			ОписаниеУспешногоПроведения = "Doc write-off updated successfully";
			ЗаписыватьПриОшибках=ЛОЖЬ;
			ОписаниеДляМассиваОшибок=РЕЗ.Описание;
			ФиксироватьТранзакции=ИСТИНА;
			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
		
		КонецЕсли;
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc write-off not found";
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция УдалитьСписаниеЗапасов(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	ЗначениеПараметра = СоответствиеОбъекта.Получить("Ref");
	
	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СписаниеЗапасов);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
		
	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	СписаниеЗапасовДополнительныеРеквизиты.Ссылка
	                      |ИЗ
	                      |	Документ.СписаниеЗапасов.ДополнительныеРеквизиты КАК СписаниеЗапасовДополнительныеРеквизиты
	                      |ГДЕ
	                      |	СписаниеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
	                      |	И СписаниеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	СтрокаОтветаДляУдачногоРезультата = "Doc write-off deleted successfully";
	СтрокаОтветаОбъектНеНайден = "Doc write-off not found";
	
	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден,ДопПараметр);
	
	Возврат РЕЗ;
КонецФункции
#КонецОбласти

#Область РасходнаяНакладная
Функция СоздатьРасходнуюНакладную(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	PartnerCIN = СоответствиеОбъекта.Получить("PartnerCIN");
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Currency = СоответствиеОбъекта.Получить("Currency");
	Description = СоответствиеОбъекта.Получить("Description");
	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
	CashIncomeOrder = СоответствиеОбъекта.Получить("CashIncomeOrder");
	ReceivingMoneyOnAccount = СоответствиеОбъекта.Получить("ReceivingMoneyOnAccount");
	Return_ = СоответствиеОбъекта.Получить("Return");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	НаправлениеДеятельности=НЕОПРЕДЕЛЕНО;
	PartnerType = СоответствиеОбъекта.Получить("PartnerType");
	Если ЗначениеЗаполнено(PartnerType) Тогда
		РЕЗ = ПолучитьНаправлениеДеятельности(PartnerType,РЕЗ);
		Если РЕЗ.Результат Тогда
			НаправлениеДеятельности = РЕЗ.ВозвращаемоеЗначение;
		Иначе	
			Возврат РЕЗ;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПредоплату = ЛОЖЬ;
	AdvancePayment = СоответствиеОбъекта.Получить("AdvancePayment");
	Если ТипЗНЧ(AdvancePayment)=Тип("Булево") Тогда
		ЗаполнитьПредоплату = AccountingEntry;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect tabular section";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РасходнаяНакладнаяДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.РасходнаяНакладная.ДополнительныеРеквизиты КАК РасходнаяНакладнаяДополнительныеРеквизиты
	               |ГДЕ
	               |	РасходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И РасходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		// Ищем контрагента				
		ТекКонтрагент = НайтиКонтрагентаПоИНН(СокрЛП(PartnerCIN));
		
		Если ТекКонтрагент = НЕОПРЕДЕЛЕНО Тогда
		
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = PartnerCIN;
			РЕЗ.Описание = "Partner not found";
			
		Иначе
			
			Если ЗначениеЗаполнено(ТекКонтрагент.ДоговорПоУмолчанию) Тогда
				ТекДоговор = ТекКонтрагент.ДоговорПоУмолчанию;
				Если ((НЕ ТекДоговор.Покупатель) И (Константы.ИспользоватьВидыДоговоров.Получить())) ИЛИ (НЕ ТекДоговор.ВалютаРасчетов = ТекВалюта.Ссылка) Тогда
					ТекДоговор = СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,ИСТИНА);
				КонецЕсли;
			Иначе
				ТекДоговор = СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,ИСТИНА);
			КонецЕсли;
						
		КонецЕсли;
		
		//Ищем Склад
		Если РЕЗ.Результат Тогда
			ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
			Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
				РЕЗ.Описание = "Warehouse not found";
			
			КонецЕсли;
		КонецЕсли;
		
		Если РЕЗ.Результат Тогда
			
			НачатьТранзакцию();
		
			ТекДок = Документы.РасходнаяНакладная.СоздатьДокумент();
			
			ТекДок.Дата = ДатаДокумента;
			ТекДок.УстановитьНовыйНомер();
			
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПриходнойНакладной";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПоставщику")] = "ЗаполнитьПоЗаказуПоставщику";
			СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплату")] = "ЗаполнитьПоСчетуНаОплату";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеЗапасов")] = "ЗаполнитьПоПеремещениюЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.СборкаЗапасов")] = "ЗаполнитьПоСборкеЗапасов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриемИПередачаВРемонт")] = "ЗаполнитьПоПриемуВРемонт";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, НЕОПРЕДЕЛЕНО, СтратегияЗаполнения);
			
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
			
			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
			ТекДок.Комментарий = Description;
			
			ТекДок.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю");
			
			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
			ТекДок.Контрагент = ТекКонтрагент;
			ТекДок.Договор = ТекДоговор;
			ТекДок.СтруктурнаяЕдиница = ТекСклад;
			
			// Дозаполняем данные			
			ТекДок.Предоплата.Очистить();
			ТекДок.ФактурыАвансов.Очистить();
			ТекДок.ТранспортныеСредства.Очистить();
			ТекДок.ДокументОснование = Неопределено;
			
			СтруктураДополнительныхРеквизитов_СтруктурныеЕдиницы = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
			ПодразделениеПродажи = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов_СтруктурныеЕдиницы.SaleSubdivision);
			Если ЗначениеЗаполнено(ПодразделениеПродажи) Тогда
				ТекДок.Подразделение = ПодразделениеПродажи;
			КонецЕсли;
			
			//ТекДок.ВалютаДокумента = ТекДоговор.ВалютаРасчетов;
			ТекДок.ВалютаДокумента = ТекВалюта;
						
			//Данные по договору
			ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДок.Дата, Новый Структура("Валюта", ТекДок.ВалютаДокумента));
			ТекДок.Курс      = ВалютаРасчетовКурсКратность.Курс;
			ТекДок.Кратность = ВалютаРасчетовКурсКратность.Кратность;
			
			ТекДок.ПодписьРуководителя = ТекДок.Организация.ПодписьРуководителя;
			ТекДок.ПодписьГлавногоБухгалтера = ТекДок.Организация.ПодписьГлавногоБухгалтера;
			ТекДок.ИспользоватьФаксимиле = ПодписьДокументовУНФ.НадоВключитьФаксимиле(ТекДок.Организация, "РасходнаяНакладная");
			ТекДок.ПодписьКладовщика = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДок.СтруктурнаяЕдиница, "ПодписьМол");
			
			ТекДок.ОснованиеПечати = Нстр("ka='Договор: ';ru='Договор: '") + Строка(ТекДок.Договор);
			
			ТекДок.НалогообложениеНДС = ТекДок.Контрагент.НалогообложениеНДС;
			Если ТекДок.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда 
				ТекДок.ОсновнаяСтавкаНДС = Справочники.СтавкиНДС.БезНДС;
			ИначеЕсли ТекДок.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
				ТекДок.ОсновнаяСтавкаНДС = Справочники.СтавкиНДС.НДС18;
			Иначе 
				ТекДок.ОсновнаяСтавкаНДС = Справочники.СтавкиНДС.НДС0;
			КонецЕсли;
			ТекДок.НДСВключатьВСтоимость = ИСТИНА;
			//ТекДок.СуммаВключаетНДС = ?(ЗначениеЗаполнено(ТекДок.Договор.ВидЦен), ТекДок.Договор.ВидЦен.ЦенаВключаетНДС, Неопределено);
			ТекДок.СуммаВключаетНДС = ИСТИНА;
			ТекДок.ДисконтнаяКарта = ПредопределенноеЗначение("Справочник.ДисконтныеКарты.ПустаяСсылка");
			ТекДок.ПроцентСкидкиПоДисконтнойКарте = 0;
			ТекДок.ВидЦен = ТекДок.Договор.ВидЦен;
			ТекДок.ВидСкидкиНаценки = ТекДок.Договор.ВидСкидкиНаценки;
				
			// Заполнение предоплаты
			ТекДок.Предоплата.Очистить();
			Если ЗаполнитьПредоплату Тогда
				ТекДок.ЗаполнитьПредоплату();
			КонецЕсли;
			
			// Заполняем табличную часть
			МассивОшибок = Новый Массив();
			ТекДок.Запасы.Очистить();
			Для каждого СоответствиеОбъекта Из TabularSection Цикл
			
				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
				
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Прервать;
				
				КонецЕсли;
								
				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
				Price = СоответствиеОбъекта.Получить("Price");
				Quantity = СоответствиеОбъекта.Получить("Quantity");
				Sum = СоответствиеОбъекта.Получить("Sum");
				VatValue = СоответствиеОбъекта.Получить("VatValue");
				VatSum = СоответствиеОбъекта.Получить("VatSum");
				Discount = СоответствиеОбъекта.Получить("Discount");
				
				ТекКоличество = 0;
				ТекЦена = 0;
				ТекСумма = 0;
				ТекСуммаНДС = 0;
				ТекСтавкаНДС = НЕОПРЕДЕЛЕНО;
				ТекСуммаСкидки = 0;
				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
				
				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Product not found";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
						ТекКоличество = Число(Quantity);
					Иначе
						ТекКоличество = 0;
					КонецЕсли
				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
					ТекКоличество = Quantity;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid quantity";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Quantity);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Price)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Price),"null")=0 Тогда
						ТекЦена = Число(Price);
					Иначе
						ТекЦена = 0;
					КонецЕсли;
				ИначеЕсли ТипЗНЧ(Price)=Тип("Число") Тогда
					ТекЦена = Price;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid price";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Price);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Sum)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Sum),"null")=0 Тогда
						ТекСумма = Число(Sum);
					Иначе
						ТекСумма = 0;
					КонецЕсли;
				ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
					ТекСумма = Sum;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid sum";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Sum);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если НЕ VatSum = НЕОПРЕДЕЛЕНО Тогда
					
					Если ТипЗНЧ(VatSum)=Тип("Строка") Тогда
						Если СтрНайти(НРЕГ(VatSum),"null")=0 Тогда
							ТекСуммаНДС = Число(VatSum);
						Иначе
							ТекСуммаНДС = 0;
						КонецЕсли;
					ИначеЕсли ТипЗНЧ(VatSum)=Тип("Число") Тогда
						ТекСуммаНДС = VatSum;
					Иначе
						СтруктураОшибки = ПолучитьСтруктуруОшибки();
						
						СтруктураОшибки.Message = "Invalid VatSum";
						СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
						СтруктураОшибки.Вставить("Value",VatSum);
						
						МассивОшибок.Добавить(СтруктураОшибки);
					КонецЕсли;
					
					ТекСтавкаНДС = НайтиСтавкуНДС(VatValue);	
					
				КонецЕсли;
								
				Если ТипЗНЧ(Discount)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Discount),"null")=0 Тогда
						ТекСуммаСкидки = Число(Discount);
					Иначе
						ТекСуммаСкидки = 0;
					КонецЕсли;
				ИначеЕсли ТипЗНЧ(Discount)=Тип("Число") Тогда
					ТекСуммаСкидки = Discount;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid discount";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Discount);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.СтранаПроисхождения = СтрокаТабличнойЧасти.Номенклатура.СтранаПроисхождения;
				СтрокаТабличнойЧасти.Количество = ТекКоличество;
				СтрокаТабличнойЧасти.Цена = ТекЦена;
				
				ТекСуммаВычисленная = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
				Если НЕ ТекСуммаВычисленная = ТекСумма Тогда
					ТекСуммаСкидки = ТекСуммаВычисленная - ТекСумма;
					ТекСумма = ТекСуммаВычисленная;
				КонецЕсли;
				
				Если ТекСумма>0 Тогда
					Если ТекСумма>ТекСуммаСкидки Тогда
						СтрокаТабличнойЧасти.Сумма = ТекСумма - ТекСуммаСкидки;
						СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = (ТекСуммаСкидки*100)/ТекСумма;
					Иначе
						СтрокаТабличнойЧасти.Сумма = 0;
						СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100;
					КонецЕсли;
				КонецЕсли;
				
				СтрокаТабличнойЧасти.СтавкаНДС = ТекСтавкаНДС;
				СтрокаТабличнойЧасти.СуммаНДС = ТекСуммаНДС;
				
				// Дозаполняем данные в строке
				СтрокаТабличнойЧасти.ТипНоменклатурыЗапас = СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас");
				СтрокаТабличнойЧасти.Вес = СтрокаТабличнойЧасти.Номенклатура.Вес * СтрокаТабличнойЧасти.Количество;
				СтрокаТабличнойЧасти.Объем = СтрокаТабличнойЧасти.Номенклатура.Объем * СтрокаТабличнойЧасти.Количество;
				
				СчетУчетаВыручкиОтПродажРегл = СтрокаТабличнойЧасти.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл;
				Если НЕ ЗначениеЗаполнено(СчетУчетаВыручкиОтПродажРегл) Тогда
					СчетУчетаВыручкиОтПродажРегл = Справочники.НаправленияДеятельности.ОсновноеНаправление.СчетУчетаВыручкиОтПродажРегл;
				КонецЕсли;
				СтрокаТабличнойЧасти.СчетУчетаВыручкиОтПродажРегл = СчетУчетаВыручкиОтПродажРегл;
				
				Если СтрокаТабличнойЧасти.Сумма>0 Тогда
					СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(ТекДок.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
				КонецЕсли;
				
				Если НЕ НаправлениеДеятельности=НЕОПРЕДЕЛЕНО Тогда
					СтрокаТабличнойЧасти.НаправлениеДеятельности = НаправлениеДеятельности;
					
					СчетУчетаВыручкиОтПродажРегл = СтрокаТабличнойЧасти.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл;
					Если НЕ ЗначениеЗаполнено(СчетУчетаВыручкиОтПродажРегл) Тогда
						СчетУчетаВыручкиОтПродажРегл = Справочники.НаправленияДеятельности.ОсновноеНаправление.СчетУчетаВыручкиОтПродажРегл;
					КонецЕсли;	
					СтрокаТабличнойЧасти.СчетУчетаВыручкиОтПродажРегл = СчетУчетаВыручкиОтПродажРегл;
				КонецЕсли;
			КонецЦикла;
			
			// Проверка остатков
			РЕЗ = ПолучитьМассивОшибокПоОстаткам(ТекДок,ТекДок.СтруктурнаяЕдиница,РЕЗ,МассивОшибок);
			
			ТекДок.КоличествоТоваров = ТекДок.Запасы.Итог("Количество");
						
			// Проводим
			ОписаниеУспешногоПроведения = "Doc sale created successfully";
			ЗаписыватьПриОшибках=ЛОЖЬ;
			ОписаниеДляМассиваОшибок="";
			ФиксироватьТранзакции=ЛОЖЬ;
			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
			
			СтрокаОшибок = РЕЗ.Описание;
			// Получаем оплату наличными
			Если РЕЗ.Результат Тогда
				Если НЕ CashIncomeOrder = НЕОПРЕДЕЛЕНО Тогда
					
					Если ТипЗНЧ(CashIncomeOrder) = Тип("Массив") Тогда
						
						Для Каждого ТекCashIncomeOrder из CashIncomeOrder Цикл
							
							Если ТекCashIncomeOrder.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashIncomeOrder.Вставить("Ref",Ref);
							КонецЕсли;
							
							Если ТекCashIncomeOrder.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashIncomeOrder.Вставить("Number",Number);
							КонецЕсли;
							
							Если ТекCashIncomeOrder.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashIncomeOrder.Вставить("Date",Date+1);
							КонецЕсли;
							
							Если ТекCashIncomeOrder.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashIncomeOrder.Вставить("PartnerCIN",PartnerCIN);
							КонецЕсли;
							
							Если ТекCashIncomeOrder.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashIncomeOrder.Вставить("WarehouseCode",WarehouseCode);
							КонецЕсли;
							
							Если ТекCashIncomeOrder.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashIncomeOrder.Вставить("Currency",Currency);
							КонецЕсли;
							
							Если ТекCashIncomeOrder.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashIncomeOrder.Вставить("Description",Description);
							КонецЕсли;
							
							РЕЗ = СоздатьИлиОбновитьПоступлениеВКассуИзРасходнойНакладной(РЕЗ,ТекCashIncomeOrder,Ref);
							
							Если НЕ РЕЗ.Результат Тогда
								РЕЗ.Описание = СтрокаОшибок + "; Cash income order: " + РЕЗ.Описание;
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
					Иначе	

						Если CashIncomeOrder.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
							CashIncomeOrder.Вставить("Ref",Ref);
						КонецЕсли;
						
						Если CashIncomeOrder.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
							CashIncomeOrder.Вставить("Number",Number);
						КонецЕсли;
						
						Если CashIncomeOrder.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
							CashIncomeOrder.Вставить("Date",Date+1);
						КонецЕсли;
						
						Если CashIncomeOrder.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
							CashIncomeOrder.Вставить("PartnerCIN",PartnerCIN);
						КонецЕсли;
						
						Если CashIncomeOrder.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
							CashIncomeOrder.Вставить("WarehouseCode",WarehouseCode);
						КонецЕсли;
						
						Если CashIncomeOrder.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
							CashIncomeOrder.Вставить("Currency",Currency);
						КонецЕсли;
						
						Если CashIncomeOrder.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
							CashIncomeOrder.Вставить("Description",Description);
						КонецЕсли;
						
						РЕЗ = СоздатьИлиОбновитьПоступлениеВКассуИзРасходнойНакладной(РЕЗ,CashIncomeOrder,Ref);
						
						Если НЕ РЕЗ.Результат Тогда
							РЕЗ.Описание = СтрокаОшибок + "; Cash income order: " + РЕЗ.Описание;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			// Получаем оплату безналом
			Если РЕЗ.Результат Тогда
				Если НЕ ReceivingMoneyOnAccount = НЕОПРЕДЕЛЕНО Тогда
					
					Если ТипЗНЧ(ReceivingMoneyOnAccount) = Тип("Массив") Тогда
						
						Для Каждого ТекReceivingMoneyOnAccount из ReceivingMoneyOnAccount Цикл
							
							Если ТекReceivingMoneyOnAccount.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
								ТекReceivingMoneyOnAccount.Вставить("Ref",Ref);
							КонецЕсли;
							
							Если ТекReceivingMoneyOnAccount.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
								ТекReceivingMoneyOnAccount.Вставить("Number",Number);
							КонецЕсли;
							
							Если ТекReceivingMoneyOnAccount.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
								ТекReceivingMoneyOnAccount.Вставить("Date",Date+1);
							КонецЕсли;
							
							Если ТекReceivingMoneyOnAccount.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
								ТекReceivingMoneyOnAccount.Вставить("PartnerCIN",PartnerCIN);
							КонецЕсли;
							
							Если ТекReceivingMoneyOnAccount.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
								ТекReceivingMoneyOnAccount.Вставить("WarehouseCode",WarehouseCode);
							КонецЕсли;
							
							Если ТекReceivingMoneyOnAccount.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
								ТекReceivingMoneyOnAccount.Вставить("Currency",Currency);
							КонецЕсли;
							
							Если ТекReceivingMoneyOnAccount.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
								ТекReceivingMoneyOnAccount.Вставить("Description",Description);
							КонецЕсли;
							
							РЕЗ = СоздатьИлиОбновитьПоступлениеНаСчетИзРасходнойНакладной(РЕЗ,ТекReceivingMoneyOnAccount,Ref);
							
							Если НЕ РЕЗ.Результат Тогда
								РЕЗ.Описание = СтрокаОшибок + "; Receiving мoney оn account: " + РЕЗ.Описание;
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
					Иначе	

						Если ReceivingMoneyOnAccount.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
							ReceivingMoneyOnAccount.Вставить("Ref",Ref);
						КонецЕсли;
						
						Если ReceivingMoneyOnAccount.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
							ReceivingMoneyOnAccount.Вставить("Number",Number);
						КонецЕсли;
						
						Если ReceivingMoneyOnAccount.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
							ReceivingMoneyOnAccount.Вставить("Date",Date+1);
						КонецЕсли;
						
						Если ReceivingMoneyOnAccount.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
							ReceivingMoneyOnAccount.Вставить("PartnerCIN",PartnerCIN);
						КонецЕсли;
						
						Если ReceivingMoneyOnAccount.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
							ReceivingMoneyOnAccount.Вставить("WarehouseCode",WarehouseCode);
						КонецЕсли;
						
						Если ReceivingMoneyOnAccount.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
							ReceivingMoneyOnAccount.Вставить("Currency",Currency);
						КонецЕсли;
						
						Если ReceivingMoneyOnAccount.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
							ReceivingMoneyOnAccount.Вставить("Description",Description);
						КонецЕсли;
						
						РЕЗ = СоздатьИлиОбновитьПоступлениеНаСчетИзРасходнойНакладной(РЕЗ,ReceivingMoneyOnAccount,Ref);
						
						Если НЕ РЕЗ.Результат Тогда
							РЕЗ.Описание = СтрокаОшибок + "; Receiving мoney оn account: " + РЕЗ.Описание;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			// Возврат товаров
			Если РЕЗ.Результат Тогда
				Если НЕ Return_ = НЕОПРЕДЕЛЕНО Тогда
				
					Если ТипЗНЧ(Return_) = Тип("Массив") Тогда
						
						Для Каждого ТекReturn_ из Return_ Цикл
							
							Если Return_.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
								Return_.Вставить("Ref",Ref);
							КонецЕсли;
							
							Если Return_.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
								Return_.Вставить("Number",Number);
							КонецЕсли;
							
							Если Return_.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
								Return_.Вставить("Date",Date+1);
							КонецЕсли;
							
							Если Return_.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
								Return_.Вставить("PartnerCIN",PartnerCIN);
							КонецЕсли;
							
							Если Return_.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
								Return_.Вставить("WarehouseCode",WarehouseCode);
							КонецЕсли;
							
							Если Return_.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
								Return_.Вставить("Currency",Currency);
							КонецЕсли;
							
							Если Return_.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
								Return_.Вставить("Description",Description);
							КонецЕсли;
							
							Если Return_.Получить("PartnerType")=НЕОПРЕДЕЛЕНО Тогда
								Если ЗначениеЗаполнено(PartnerType) Тогда
									Return_.Вставить("PartnerType",PartnerType);
								КонецЕсли;
							КонецЕсли;
							
							РЕЗ = СоздатьИлиОбновитьВозвратТоваровОтПокупателяИзРасходнойНакладной(РЕЗ,ТекReturn_,Ref);
							
							Если НЕ РЕЗ.Результат Тогда
								РЕЗ.Описание = СтрокаОшибок + "; Return of goods: " + РЕЗ.Описание;
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
					Иначе	

						Если Return_.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
							Return_.Вставить("Ref",Ref);
						КонецЕсли;
						
						Если Return_.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
							Return_.Вставить("Number",Number);
						КонецЕсли;
						
						Если Return_.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
							Return_.Вставить("Date",Date+1);
						КонецЕсли;
						
						Если Return_.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
							Return_.Вставить("PartnerCIN",PartnerCIN);
						КонецЕсли;
						
						Если Return_.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
							Return_.Вставить("WarehouseCode",WarehouseCode);
						КонецЕсли;
						
						Если Return_.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
							Return_.Вставить("Currency",Currency);
						КонецЕсли;
						
						Если Return_.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
							Return_.Вставить("Description",Description);
						КонецЕсли;
						
						Если Return_.Получить("PartnerType")=НЕОПРЕДЕЛЕНО Тогда
							Если ЗначениеЗаполнено(PartnerType) Тогда
								Return_.Вставить("PartnerType",PartnerType);
							КонецЕсли;
						КонецЕсли;
						
						РЕЗ = СоздатьИлиОбновитьВозвратТоваровОтПокупателяИзРасходнойНакладной(РЕЗ,Return_,Ref);
						
						Если НЕ РЕЗ.Результат Тогда
							РЕЗ.Описание = СтрокаОшибок + "; Return of goods: " + РЕЗ.Описание;
						КонецЕсли;
						
					КонецЕсли;
				
				КонецЕсли;
			КонецЕсли;
			
			Если РЕЗ.Результат Тогда
				РЕЗ.Описание = "Doc sale created successfully";
				ЗафиксироватьТранзакцию()
			Иначе
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				РЕЗ.Описание = СтрЗаменить(РЕЗ.Описание,"Doc sale created successfully","Creating sales doc: error");
			КонецЕсли;
		
		КонецЕсли;
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc sale already exist";		
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьРасходнуюНакладную(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	PartnerCIN = СоответствиеОбъекта.Получить("PartnerCIN");
	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
	Currency = СоответствиеОбъекта.Получить("Currency");
	Description = СоответствиеОбъекта.Получить("Description");
	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
	CashIncomeOrder = СоответствиеОбъекта.Получить("CashIncomeOrder");
	ReceivingMoneyOnAccount = СоответствиеОбъекта.Получить("ReceivingMoneyOnAccount");
	Return_ = СоответствиеОбъекта.Получить("Return");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	НаправлениеДеятельности=НЕОПРЕДЕЛЕНО;
	PartnerType = СоответствиеОбъекта.Получить("PartnerType");
	Если ЗначениеЗаполнено(PartnerType) Тогда
		РЕЗ = ПолучитьНаправлениеДеятельности(PartnerType,РЕЗ);
		Если РЕЗ.Результат Тогда
			НаправлениеДеятельности = РЕЗ.ВозвращаемоеЗначение;
		Иначе	
			Возврат РЕЗ;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПредоплату = ЛОЖЬ;
	AdvancePayment = СоответствиеОбъекта.Получить("AdvancePayment");
	Если ТипЗНЧ(AdvancePayment)=Тип("Булево") Тогда
		ЗаполнитьПредоплату = AccountingEntry;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect tabular section";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РасходнаяНакладнаяДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.РасходнаяНакладная.ДополнительныеРеквизиты КАК РасходнаяНакладнаяДополнительныеРеквизиты
	               |ГДЕ
	               |	РасходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И РасходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
						
		// Ищем контрагента				
		ТекКонтрагент = НайтиКонтрагентаПоИНН(СокрЛП(PartnerCIN));
		
		Если ТекКонтрагент = НЕОПРЕДЕЛЕНО Тогда
		
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = PartnerCIN;
			РЕЗ.Описание = "Partner not found";
			
		Иначе
			
			Если ЗначениеЗаполнено(ТекКонтрагент.ДоговорПоУмолчанию) Тогда
				ТекДоговор = ТекКонтрагент.ДоговорПоУмолчанию;
				Если ((НЕ ТекДоговор.Покупатель) И (Константы.ИспользоватьВидыДоговоров.Получить())) ИЛИ (НЕ ТекДоговор.ВалютаРасчетов = ТекВалюта.Ссылка) Тогда
					ТекДоговор = СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,ИСТИНА);
				КонецЕсли;
			Иначе
				ТекДоговор = СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,ИСТИНА);
			КонецЕсли;
						
		КонецЕсли;
		
		//Ищем Склад
		Если РЕЗ.Результат Тогда
			ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
			Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
			
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
				РЕЗ.Описание = "Warehouse not found";
			
			КонецЕсли;
		КонецЕсли;
		
		Если РЕЗ.Результат Тогда
			НачатьТранзакцию();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТекДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			КонецЦикла;
			
			// Убираем пометку удаления
			Попытка
				Если ТекДок.ПометкаУдаления Тогда
					ТекДок.Записать(РежимЗаписиДокумента.Запись);
					ТекДок.УстановитьПометкуУдаления(ЛОЖЬ);
				КонецЕсли;
			Исключение
				
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Internal processing error";
				
				Возврат РЕЗ;
			КонецПопытки;
			
			ТекДок.Дата = ДатаДокумента;
			
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
			
			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
			ТекДок.Комментарий = Description;
			
			ТекДок.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю");
			
			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
			ТекДок.Контрагент = ТекКонтрагент;
			ТекДок.Договор = ТекДоговор;
			ТекДок.СтруктурнаяЕдиница = ТекСклад;
			
			// Дозаполняем данные			
			ТекДок.Предоплата.Очистить();
			ТекДок.ФактурыАвансов.Очистить();
			ТекДок.ТранспортныеСредства.Очистить();
			ТекДок.ДокументОснование = Неопределено;
			
			СтруктураДополнительныхРеквизитов_СтруктурныеЕдиницы = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
			ПодразделениеПродажи = НайтиЗначениеДополнительногоРеквизита(ТекСклад, СтруктураДополнительныхРеквизитов_СтруктурныеЕдиницы.SaleSubdivision);
			Если ЗначениеЗаполнено(ПодразделениеПродажи) Тогда
				ТекДок.Подразделение = ПодразделениеПродажи;
			КонецЕсли;
			
			//ТекДок.ВалютаДокумента = ТекДоговор.ВалютаРасчетов;
			ТекДок.ВалютаДокумента = ТекВалюта;
						
			//Данные по договору
			ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДок.Дата, Новый Структура("Валюта", ТекДок.ВалютаДокумента));
			ТекДок.Курс      = ВалютаРасчетовКурсКратность.Курс;
			ТекДок.Кратность = ВалютаРасчетовКурсКратность.Кратность;
			
			ТекДок.ПодписьРуководителя = ТекДок.Организация.ПодписьРуководителя;
			ТекДок.ПодписьГлавногоБухгалтера = ТекДок.Организация.ПодписьГлавногоБухгалтера;
			ТекДок.ИспользоватьФаксимиле = ПодписьДокументовУНФ.НадоВключитьФаксимиле(ТекДок.Организация, "РасходнаяНакладная");
			ТекДок.ПодписьКладовщика = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДок.СтруктурнаяЕдиница, "ПодписьМол");
			
			ТекДок.ОснованиеПечати = Нстр("ka='Договор: ';ru='Договор: '") + Строка(ТекДок.Договор);
			
			ТекДок.НалогообложениеНДС = ТекДок.Контрагент.НалогообложениеНДС;
			Если ТекДок.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда 
				ТекДок.ОсновнаяСтавкаНДС = Справочники.СтавкиНДС.БезНДС;
			ИначеЕсли ТекДок.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
				ТекДок.ОсновнаяСтавкаНДС = Справочники.СтавкиНДС.НДС18;
			Иначе 
				ТекДок.ОсновнаяСтавкаНДС = Справочники.СтавкиНДС.НДС0;
			КонецЕсли;
			ТекДок.НДСВключатьВСтоимость = ИСТИНА;
			//ТекДок.СуммаВключаетНДС = ?(ЗначениеЗаполнено(ТекДок.Договор.ВидЦен), ТекДок.Договор.ВидЦен.ЦенаВключаетНДС, Неопределено);
			ТекДок.СуммаВключаетНДС = ИСТИНА;
			ТекДок.ДисконтнаяКарта = ПредопределенноеЗначение("Справочник.ДисконтныеКарты.ПустаяСсылка");
			ТекДок.ПроцентСкидкиПоДисконтнойКарте = 0;
			ТекДок.ВидЦен = ТекДок.Договор.ВидЦен;
			ТекДок.ВидСкидкиНаценки = ТекДок.Договор.ВидСкидкиНаценки;
			
			// Заполнение предоплаты
			ТекДок.Предоплата.Очистить();
			Если ЗаполнитьПредоплату Тогда
				ТекДок.ЗаполнитьПредоплату();
			КонецЕсли;
			
			// Заполняем табличную часть
			МассивОшибок = Новый Массив();
			ТекДок.Запасы.Очистить();
			Для каждого СоответствиеОбъекта Из TabularSection Цикл
			
				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
				
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Прервать;
				
				КонецЕсли;				
				
				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
				Price = СоответствиеОбъекта.Получить("Price");
				Quantity = СоответствиеОбъекта.Получить("Quantity");
				Sum = СоответствиеОбъекта.Получить("Sum");
				VatValue = СоответствиеОбъекта.Получить("VatValue");
				VatSum = СоответствиеОбъекта.Получить("VatSum");
				Discount = СоответствиеОбъекта.Получить("Discount");
				
				ТекКоличество = 0;
				ТекЦена = 0;
				ТекСумма = 0;
				ТекСуммаНДС = 0;
				ТекСтавкаНДС = НЕОПРЕДЕЛЕНО;
				ТекСуммаСкидки = 0;
				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
				
				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Product not found";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",ProductOptionCode);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
						ТекКоличество = Число(Quantity);
					Иначе
						ТекКоличество = 0;
					КонецЕсли
				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
					ТекКоличество = Quantity;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid quantity";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Quantity);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Price)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Price),"null")=0 Тогда
						ТекЦена = Число(Price);
					Иначе
						ТекЦена = 0;
					КонецЕсли;
				ИначеЕсли ТипЗНЧ(Price)=Тип("Число") Тогда
					ТекЦена = Price;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid price";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Price);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если ТипЗНЧ(Sum)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Sum),"null")=0 Тогда
						ТекСумма = Число(Sum);
					Иначе
						ТекСумма = 0;
					КонецЕсли;
				ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
					ТекСумма = Sum;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid sum";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Sum);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
				Если НЕ VatSum = НЕОПРЕДЕЛЕНО Тогда
					
					Если ТипЗНЧ(VatSum)=Тип("Строка") Тогда
						Если СтрНайти(НРЕГ(VatSum),"null")=0 Тогда
							ТекСуммаНДС = Число(VatSum);
						Иначе
							ТекСуммаНДС = 0;
						КонецЕсли;
					ИначеЕсли ТипЗНЧ(VatSum)=Тип("Число") Тогда
						ТекСуммаНДС = VatSum;
					Иначе
						СтруктураОшибки = ПолучитьСтруктуруОшибки();
						
						СтруктураОшибки.Message = "Invalid VatSum";
						СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
						СтруктураОшибки.Вставить("Value",VatSum);
						
						МассивОшибок.Добавить(СтруктураОшибки);
					КонецЕсли;
					
					ТекСтавкаНДС = НайтиСтавкуНДС(VatValue);
					
				КонецЕсли;
				
				Если ТипЗНЧ(Discount)=Тип("Строка") Тогда
					Если СтрНайти(НРЕГ(Discount),"null")=0 Тогда
						ТекСуммаСкидки = Число(Discount);
					Иначе
						ТекСуммаСкидки = 0;
					КонецЕсли;
				ИначеЕсли ТипЗНЧ(Discount)=Тип("Число") Тогда
					ТекСуммаСкидки = Discount;
				Иначе
					СтруктураОшибки = ПолучитьСтруктуруОшибки();
					
					СтруктураОшибки.Message = "Invalid discount";
					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
					СтруктураОшибки.Вставить("Value",Discount);
					
					МассивОшибок.Добавить(СтруктураОшибки);
				КонецЕсли;
				
			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.СтранаПроисхождения = СтрокаТабличнойЧасти.Номенклатура.СтранаПроисхождения;
				СтрокаТабличнойЧасти.Количество = ТекКоличество;
				СтрокаТабличнойЧасти.Цена = ТекЦена;
				
				ТекСуммаВычисленная = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
				Если НЕ ТекСуммаВычисленная = ТекСумма Тогда
					ТекСуммаСкидки = ТекСуммаВычисленная - ТекСумма;
					ТекСумма = ТекСуммаВычисленная;
				КонецЕсли;
				
				Если ТекСумма>0 Тогда
					Если ТекСумма>ТекСуммаСкидки Тогда
						СтрокаТабличнойЧасти.Сумма = ТекСумма - ТекСуммаСкидки;
						СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = (ТекСуммаСкидки*100)/ТекСумма;
					Иначе
						СтрокаТабличнойЧасти.Сумма = 0;
						СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100;
					КонецЕсли;
				КонецЕсли;
				
				СтрокаТабличнойЧасти.СтавкаНДС = ТекСтавкаНДС;
				СтрокаТабличнойЧасти.СуммаНДС = ТекСуммаНДС;
				
				// Дозаполняем данные в строке
				СтрокаТабличнойЧасти.ТипНоменклатурыЗапас = СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас");
				СтрокаТабличнойЧасти.Вес = СтрокаТабличнойЧасти.Номенклатура.Вес * СтрокаТабличнойЧасти.Количество;
				СтрокаТабличнойЧасти.Объем = СтрокаТабличнойЧасти.Номенклатура.Объем * СтрокаТабличнойЧасти.Количество;
				
				СчетУчетаВыручкиОтПродажРегл = СтрокаТабличнойЧасти.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл;
				Если НЕ ЗначениеЗаполнено(СчетУчетаВыручкиОтПродажРегл) Тогда
					СчетУчетаВыручкиОтПродажРегл = Справочники.НаправленияДеятельности.ОсновноеНаправление.СчетУчетаВыручкиОтПродажРегл;
				КонецЕсли;
				СтрокаТабличнойЧасти.СчетУчетаВыручкиОтПродажРегл = СчетУчетаВыручкиОтПродажРегл;
				
				Если СтрокаТабличнойЧасти.Сумма>0 Тогда
					СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(ТекДок.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
				КонецЕсли;
				
				Если НЕ НаправлениеДеятельности=НЕОПРЕДЕЛЕНО Тогда
					СтрокаТабличнойЧасти.НаправлениеДеятельности = НаправлениеДеятельности;
					
					СчетУчетаВыручкиОтПродажРегл = СтрокаТабличнойЧасти.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл;
					Если НЕ ЗначениеЗаполнено(СчетУчетаВыручкиОтПродажРегл) Тогда
						СчетУчетаВыручкиОтПродажРегл = Справочники.НаправленияДеятельности.ОсновноеНаправление.СчетУчетаВыручкиОтПродажРегл;
					КонецЕсли;	
					СтрокаТабличнойЧасти.СчетУчетаВыручкиОтПродажРегл = СчетУчетаВыручкиОтПродажРегл;
				КонецЕсли;
			КонецЦикла;
			
			// Проверка остатков
			РЕЗ = ПолучитьМассивОшибокПоОстаткам(ТекДок,ТекДок.СтруктурнаяЕдиница,РЕЗ,МассивОшибок);
			
			ТекДок.КоличествоТоваров = ТекДок.Запасы.Итог("Количество");
									
			// Проводим
			ОписаниеУспешногоПроведения = "Doc sale updated successfully";
			ЗаписыватьПриОшибках=ЛОЖЬ;
			ОписаниеДляМассиваОшибок="";
			ФиксироватьТранзакции=ЛОЖЬ;
			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
			
			СтрокаОшибок = РЕЗ.Описание;
			// Получаем оплату наличными
			Если РЕЗ.Результат Тогда
				Если НЕ CashIncomeOrder = НЕОПРЕДЕЛЕНО Тогда
					
					Если ТипЗНЧ(CashIncomeOrder) = Тип("Массив") Тогда
						
						Для Каждого ТекCashIncomeOrder из CashIncomeOrder Цикл
							
							Если ТекCashIncomeOrder.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashIncomeOrder.Вставить("Ref",Ref);
							КонецЕсли;
							
							Если ТекCashIncomeOrder.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashIncomeOrder.Вставить("Number",Number);
							КонецЕсли;
							
							Если ТекCashIncomeOrder.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashIncomeOrder.Вставить("Date",Date+1);
							КонецЕсли;
							
							Если ТекCashIncomeOrder.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashIncomeOrder.Вставить("PartnerCIN",PartnerCIN);
							КонецЕсли;
							
							Если ТекCashIncomeOrder.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashIncomeOrder.Вставить("WarehouseCode",WarehouseCode);
							КонецЕсли;
							
							Если ТекCashIncomeOrder.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashIncomeOrder.Вставить("Currency",Currency);
							КонецЕсли;
							
							Если ТекCashIncomeOrder.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
								ТекCashIncomeOrder.Вставить("Description",Description);
							КонецЕсли;
							
							РЕЗ = СоздатьИлиОбновитьПоступлениеВКассуИзРасходнойНакладной(РЕЗ,ТекCashIncomeOrder,Ref);
							
							Если НЕ РЕЗ.Результат Тогда
								РЕЗ.Описание = СтрокаОшибок + "; Cash income order: " + РЕЗ.Описание;
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
					Иначе	

						Если CashIncomeOrder.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
							CashIncomeOrder.Вставить("Ref",Ref);
						КонецЕсли;
						
						Если CashIncomeOrder.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
							CashIncomeOrder.Вставить("Number",Number);
						КонецЕсли;
						
						Если CashIncomeOrder.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
							CashIncomeOrder.Вставить("Date",Date+1);
						КонецЕсли;
						
						Если CashIncomeOrder.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
							CashIncomeOrder.Вставить("PartnerCIN",PartnerCIN);
						КонецЕсли;
						
						Если CashIncomeOrder.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
							CashIncomeOrder.Вставить("WarehouseCode",WarehouseCode);
						КонецЕсли;
						
						Если CashIncomeOrder.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
							CashIncomeOrder.Вставить("Currency",Currency);
						КонецЕсли;
						
						Если CashIncomeOrder.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
							CashIncomeOrder.Вставить("Description",Description);
						КонецЕсли;
						
						РЕЗ = СоздатьИлиОбновитьПоступлениеВКассуИзРасходнойНакладной(РЕЗ,CashIncomeOrder,Ref);
						
						Если НЕ РЕЗ.Результат Тогда
							РЕЗ.Описание = СтрокаОшибок + "; Cash income order: " + РЕЗ.Описание;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			// Получаем оплату безналом
			Если РЕЗ.Результат Тогда
				Если НЕ ReceivingMoneyOnAccount = НЕОПРЕДЕЛЕНО Тогда
					
					Если ТипЗНЧ(ReceivingMoneyOnAccount) = Тип("Массив") Тогда
						
						Для Каждого ТекReceivingMoneyOnAccount из ReceivingMoneyOnAccount Цикл
							
							Если ТекReceivingMoneyOnAccount.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
								ТекReceivingMoneyOnAccount.Вставить("Ref",Ref);
							КонецЕсли;
							
							Если ТекReceivingMoneyOnAccount.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
								ТекReceivingMoneyOnAccount.Вставить("Number",Number);
							КонецЕсли;
							
							Если ТекReceivingMoneyOnAccount.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
								ТекReceivingMoneyOnAccount.Вставить("Date",Date+1);
							КонецЕсли;
							
							Если ТекReceivingMoneyOnAccount.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
								ТекReceivingMoneyOnAccount.Вставить("PartnerCIN",PartnerCIN);
							КонецЕсли;
							
							Если ТекReceivingMoneyOnAccount.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
								ТекReceivingMoneyOnAccount.Вставить("WarehouseCode",WarehouseCode);
							КонецЕсли;
							
							Если ТекReceivingMoneyOnAccount.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
								ТекReceivingMoneyOnAccount.Вставить("Currency",Currency);
							КонецЕсли;
							
							Если ТекReceivingMoneyOnAccount.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
								ТекReceivingMoneyOnAccount.Вставить("Description",Description);
							КонецЕсли;
							
							РЕЗ = СоздатьИлиОбновитьПоступлениеНаСчетИзРасходнойНакладной(РЕЗ,ТекReceivingMoneyOnAccount,Ref);
							
							Если НЕ РЕЗ.Результат Тогда
								РЕЗ.Описание = СтрокаОшибок + "; Receiving money on account: " + РЕЗ.Описание;
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
					Иначе	

						Если ReceivingMoneyOnAccount.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
							ReceivingMoneyOnAccount.Вставить("Ref",Ref);
						КонецЕсли;
						
						Если ReceivingMoneyOnAccount.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
							ReceivingMoneyOnAccount.Вставить("Number",Number);
						КонецЕсли;
						
						Если ReceivingMoneyOnAccount.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
							ReceivingMoneyOnAccount.Вставить("Date",Date+1);
						КонецЕсли;
						
						Если ReceivingMoneyOnAccount.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
							ReceivingMoneyOnAccount.Вставить("PartnerCIN",PartnerCIN);
						КонецЕсли;
						
						Если ReceivingMoneyOnAccount.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
							ReceivingMoneyOnAccount.Вставить("WarehouseCode",WarehouseCode);
						КонецЕсли;
						
						Если ReceivingMoneyOnAccount.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
							ReceivingMoneyOnAccount.Вставить("Currency",Currency);
						КонецЕсли;
						
						Если ReceivingMoneyOnAccount.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
							ReceivingMoneyOnAccount.Вставить("Description",Description);
						КонецЕсли;
						
						РЕЗ = СоздатьИлиОбновитьПоступлениеНаСчетИзРасходнойНакладной(РЕЗ,ReceivingMoneyOnAccount,Ref);
						
						Если НЕ РЕЗ.Результат Тогда
							РЕЗ.Описание = СтрокаОшибок + "; Receiving money on account: " + РЕЗ.Описание;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			// Возврат товаров
			Если РЕЗ.Результат Тогда
				Если НЕ Return_ = НЕОПРЕДЕЛЕНО Тогда
				
					Если ТипЗНЧ(Return_) = Тип("Массив") Тогда
						
						Для Каждого ТекReturn_ из Return_ Цикл
							
							Если Return_.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
								Return_.Вставить("Ref",Ref);
							КонецЕсли;
							
							Если Return_.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
								Return_.Вставить("Number",Number);
							КонецЕсли;
							
							Если Return_.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
								Return_.Вставить("Date",Date+1);
							КонецЕсли;
							
							Если Return_.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
								Return_.Вставить("PartnerCIN",PartnerCIN);
							КонецЕсли;
							
							Если Return_.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
								Return_.Вставить("WarehouseCode",WarehouseCode);
							КонецЕсли;
							
							Если Return_.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
								Return_.Вставить("Currency",Currency);
							КонецЕсли;
							
							Если Return_.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
								Return_.Вставить("Description",Description);
							КонецЕсли;
							
							Если Return_.Получить("PartnerType")=НЕОПРЕДЕЛЕНО Тогда
								Если ЗначениеЗаполнено(PartnerType) Тогда
									Return_.Вставить("PartnerType",PartnerType);
								КонецЕсли;
							КонецЕсли;
							
							РЕЗ = СоздатьИлиОбновитьВозвратТоваровОтПокупателяИзРасходнойНакладной(РЕЗ,ТекReturn_,Ref);
							
							Если НЕ РЕЗ.Результат Тогда
								РЕЗ.Описание = СтрокаОшибок + "; Return of goods: " + РЕЗ.Описание;
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
					Иначе	

						Если Return_.Получить("Ref")=НЕОПРЕДЕЛЕНО Тогда
							Return_.Вставить("Ref",Ref);
						КонецЕсли;
						
						Если Return_.Получить("Number")=НЕОПРЕДЕЛЕНО Тогда
							Return_.Вставить("Number",Number);
						КонецЕсли;
						
						Если Return_.Получить("Date")=НЕОПРЕДЕЛЕНО Тогда
							Return_.Вставить("Date",Date+1);
						КонецЕсли;
						
						Если Return_.Получить("PartnerCIN")=НЕОПРЕДЕЛЕНО Тогда
							Return_.Вставить("PartnerCIN",PartnerCIN);
						КонецЕсли;
						
						Если Return_.Получить("WarehouseCode")=НЕОПРЕДЕЛЕНО Тогда
							Return_.Вставить("WarehouseCode",WarehouseCode);
						КонецЕсли;
						
						Если Return_.Получить("Currency")=НЕОПРЕДЕЛЕНО Тогда
							Return_.Вставить("Currency",Currency);
						КонецЕсли;
						
						Если Return_.Получить("Description")=НЕОПРЕДЕЛЕНО Тогда
							Return_.Вставить("Description",Description);
						КонецЕсли;
						
						Если Return_.Получить("PartnerType")=НЕОПРЕДЕЛЕНО Тогда
							Если ЗначениеЗаполнено(PartnerType) Тогда
								Return_.Вставить("PartnerType",PartnerType);
							КонецЕсли;
						КонецЕсли;
						
						РЕЗ = СоздатьИлиОбновитьВозвратТоваровОтПокупателяИзРасходнойНакладной(РЕЗ,Return_,Ref);
						
						Если НЕ РЕЗ.Результат Тогда
							РЕЗ.Описание = СтрокаОшибок + "; Return of goods: " + РЕЗ.Описание;
						КонецЕсли;
						
					КонецЕсли;
				
				КонецЕсли;
			КонецЕсли;
			
			Если РЕЗ.Результат Тогда
				РЕЗ.Описание = "Doc sale updated successfully";
				ЗафиксироватьТранзакцию()
			Иначе
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				РЕЗ.Описание = СтрЗаменить(РЕЗ.Описание,"Doc sale updated successfully","Update sales doc: error");
			КонецЕсли;
		
		КонецЕсли;
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc sale not found";
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция УдалитьРасходнуюНакладную(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	ЗначениеПараметра = СоответствиеОбъекта.Получить("Ref");
	
	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Удаляем поступления в кассу
	СтруктураДополнительныхРеквизитовПоступлениеВКассу = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеВКассу);
	ДопПараметрПоступлениеВКассу = СтруктураДополнительныхРеквизитовПоступлениеВКассу.BaseRef;
	
	ЗапросПоступлениеВКассу = Новый Запрос;
	ЗапросПоступлениеВКассу.Текст = "ВЫБРАТЬ
	                                |	ПоступлениеВКассуДополнительныеРеквизиты.Ссылка
	                                |ИЗ
	                                |	Документ.ПоступлениеВКассу.ДополнительныеРеквизиты КАК ПоступлениеВКассуДополнительныеРеквизиты
	                                |ГДЕ
	                                |	ПоступлениеВКассуДополнительныеРеквизиты.Значение = &ТекПараметр
	                                |	И ПоступлениеВКассуДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ЗапросПоступлениеВКассу.УстановитьПараметр("ТекПараметр", ЗначениеПараметра);
	ЗапросПоступлениеВКассу.УстановитьПараметр("ДопПараметр", ДопПараметрПоступлениеВКассу);
	РезультатЗапросаПоступлениеВКассу = ЗапросПоступлениеВКассу.Выполнить();
	ВыборкаПоступлениеВКассу = РезультатЗапросаПоступлениеВКассу.Выбрать();
	Пока ВыборкаПоступлениеВКассу.Следующий() Цикл
		
		ТекОбъект = ВыборкаПоступлениеВКассу.Ссылка.ПолучитьОбъект();
		
		ТекОбъект.УстановитьПометкуУдаления(ИСТИНА);
		
	КонецЦикла;
	
	// Удаляем поступления на счет
	СтруктураДополнительныхРеквизитовПоступлениеНаСчет = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеНаСчет);
	ДопПараметрПоступлениеНаСчет = СтруктураДополнительныхРеквизитовПоступлениеНаСчет.BaseRef;
	
	ЗапросПоступлениеНаСчет = Новый Запрос;
	ЗапросПоступлениеНаСчет.Текст = "ВЫБРАТЬ
	                                |	ПоступлениеНаСчетДополнительныеРеквизиты.Ссылка
	                                |ИЗ
	                                |	Документ.ПоступлениеНаСчет.ДополнительныеРеквизиты КАК ПоступлениеНаСчетДополнительныеРеквизиты
	                                |ГДЕ
	                                |	ПоступлениеНаСчетДополнительныеРеквизиты.Значение = &ТекПараметр
	                                |	И ПоступлениеНаСчетДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ЗапросПоступлениеНаСчет.УстановитьПараметр("ТекПараметр", ЗначениеПараметра);
	ЗапросПоступлениеНаСчет.УстановитьПараметр("ДопПараметр", ДопПараметрПоступлениеНаСчет);
	РезультатЗапросаПоступлениеНаСчет = ЗапросПоступлениеНаСчет.Выполнить();
	ВыборкаПоступлениеНаСчет = РезультатЗапросаПоступлениеНаСчет.Выбрать();
	Пока ВыборкаПоступлениеНаСчет.Следующий() Цикл
		
		ТекОбъект = ВыборкаПоступлениеНаСчет.Ссылка.ПолучитьОбъект();
		
		ТекОбъект.УстановитьПометкуУдаления(ИСТИНА);
		
	КонецЦикла;
	
	// Удаляем приходные накладные как возвраты
	СтруктураДополнительныхРеквизитовПриходнаяНакладная = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная);
	ДопПараметрПриходнаяНакладная = СтруктураДополнительныхРеквизитовПриходнаяНакладная.BaseRef;
	
	ЗапросПриходнаяНакладная = Новый Запрос;
	ЗапросПриходнаяНакладная.Текст = "ВЫБРАТЬ
	                                |	ПриходнаяНакладнаяДополнительныеРеквизиты.Ссылка
	                                |ИЗ
	                                |	Документ.ПриходнаяНакладная.ДополнительныеРеквизиты КАК ПриходнаяНакладнаяДополнительныеРеквизиты
	                                |ГДЕ
	                                |	ПриходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
	                                |	И ПриходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ЗапросПриходнаяНакладная.УстановитьПараметр("ТекПараметр", ЗначениеПараметра);
	ЗапросПриходнаяНакладная.УстановитьПараметр("ДопПараметр", ДопПараметрПриходнаяНакладная);
	РезультатЗапросаПриходнаяНакладная = ЗапросПриходнаяНакладная.Выполнить();
	ВыборкаПриходнаяНакладная = РезультатЗапросаПриходнаяНакладная.Выбрать();
	Пока ВыборкаПриходнаяНакладная.Следующий() Цикл
		
		ТекОбъект = ВыборкаПриходнаяНакладная.Ссылка.ПолучитьОбъект();
		
		ТекОбъект.УстановитьПометкуУдаления(ИСТИНА);
		
	КонецЦикла;
	
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
		
	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	РасходнаяНакладнаяДополнительныеРеквизиты.Ссылка
	                      |ИЗ
	                      |	Документ.РасходнаяНакладная.ДополнительныеРеквизиты КАК РасходнаяНакладнаяДополнительныеРеквизиты
	                      |ГДЕ
	                      |	РасходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
	                      |	И РасходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	СтрокаОтветаДляУдачногоРезультата = "Doc sale deleted successfully";
	СтрокаОтветаОбъектНеНайден = "Doc sale not found";
	
	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден,ДопПараметр);
	
	Возврат РЕЗ;
КонецФункции
#КонецОбласти

#Область ОтчетОРозничныхПродажах
//Функция СоздатьОтчетОРозничныхПродажах(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
//	ПЕРЕМ РЕЗ;
//		
//	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
//	
//	Ref = СоответствиеОбъекта.Получить("Ref");
//	Number = СоответствиеОбъекта.Получить("Number");
//	Date = СоответствиеОбъекта.Получить("Date");
//	PartnerCIN = СоответствиеОбъекта.Получить("PartnerCIN");
//	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
//	Currency = СоответствиеОбъекта.Получить("Currency");
//	Description = СоответствиеОбъекта.Получить("Description");
//	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
//	CashIncomeOrder = СоответствиеОбъекта.Получить("CashIncomeOrder");
//	ReceivingMoneyOnAccount = СоответствиеОбъекта.Получить("ReceivingMoneyOnAccount");
//
//	НеПроводить=ЛОЖЬ;
//	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
//	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
//		НеПроводить = НЕ (AccountingEntry);
//	КонецЕсли;
//	
//	Если НЕ ЗначениеЗаполнено(Ref) Тогда
//	
//		РЕЗ.Результат = ЛОЖЬ;
//		РЕЗ.ВозвращаемоеЗначение = Ref;
//		РЕЗ.Описание = "Incorrect ref";
//		
//		Возврат РЕЗ;
//	
//	КонецЕсли;
//	
//	ДатаДокумента = ДатаJSON(Date);
//	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
//		
//		РЕЗ.Результат = ЛОЖЬ;
//		РЕЗ.ВозвращаемоеЗначение = Date;
//		РЕЗ.Описание = "Error reading date";
//		
//		Возврат РЕЗ;
//	КонецЕсли;
//	
//	ТекВалюта = НЕОПРЕДЕЛЕНО;
//	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
//	Если НЕ РЕЗ.Результат Тогда
//		Возврат РЕЗ;
//	Иначе
//		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
//	КонецЕсли;
//	
//	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
//	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
//	
//		РЕЗ.Результат = ЛОЖЬ;
//		РЕЗ.ВозвращаемоеЗначение = Ref;
//		РЕЗ.Описание = "Incorrect default settings";
//		
//		Возврат РЕЗ;
//	
//	КонецЕсли;
//	
//	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
//	
//		РЕЗ.Результат = ЛОЖЬ;
//		РЕЗ.ВозвращаемоеЗначение = Ref;
//		РЕЗ.Описание = "Incorrect tabular section";
//		
//		Возврат РЕЗ;
//	
//	КонецЕсли;
//	
//	// Ищем существующие
//	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОтчетОРозничныхПродажах);
//	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//	               |	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Ссылка
//	               |ИЗ
//	               |	Документ.ОтчетОРозничныхПродажах.ДополнительныеРеквизиты КАК ОтчетОРозничныхПродажахДополнительныеРеквизиты
//	               |ГДЕ
//	               |	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Значение = &ТекПараметр
//	               |	И ОтчетОРозничныхПродажахДополнительныеРеквизиты.Свойство = &ДопПараметр";
//		
//	Запрос.УстановитьПараметр("ТекПараметр", Ref);
//	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
//	РезультатЗапроса = Запрос.Выполнить();
//	Если РезультатЗапроса.Пустой() Тогда
//		
//		// Ищем контрагента				
//		ТекКонтрагент = НайтиКонтрагентаПоИНН(СокрЛП(PartnerCIN));
//		
//		Если ТекКонтрагент = НЕОПРЕДЕЛЕНО Тогда
//		
//			РЕЗ.Результат = ЛОЖЬ;
//			РЕЗ.ВозвращаемоеЗначение = PartnerCIN;
//			РЕЗ.Описание = "Partner not found";
//			
//		Иначе
//			
//			Если ЗначениеЗаполнено(ТекКонтрагент.ДоговорПоУмолчанию) Тогда
//				ТекДоговор = ТекКонтрагент.ДоговорПоУмолчанию;
//				Если ((НЕ ТекДоговор.Покупатель) И (Константы.ИспользоватьВидыДоговоров.Получить())) ИЛИ (НЕ ТекДоговор.ВалютаРасчетов = ТекВалюта.Ссылка) Тогда
//					ТекДоговор = СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,ИСТИНА);
//				КонецЕсли;
//			Иначе
//				ТекДоговор = СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,ИСТИНА);
//			КонецЕсли;
//						
//		КонецЕсли;
//		
//		//Ищем Склад
//		Если РЕЗ.Результат Тогда
//			ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
//			Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
//			
//				РЕЗ.Результат = ЛОЖЬ;
//				РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
//				РЕЗ.Описание = "Warehouse not found";
//			
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если РЕЗ.Результат Тогда
//			
//			НачатьТранзакцию();
//		
//			ТекДок = Документы.ОтчетОРозничныхПродажах.СоздатьДокумент();
//			
//			ТекДок.Дата = ДатаДокумента;
//			ТекДок.УстановитьНовыйНомер();
//			
//			СтратегияЗаполнения = Новый Соответствие;
//			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьДокументПоОтбору";
//			СтратегияЗаполнения[Тип("ДокументСсылка.ИнвентаризацияЗапасов")] = "ЗаполнитьПоИнвентаризацииЗапасовНаСкладе";
//			
//			ТекДок.НачалоКассовойСмены    = НачалоДня(ТекДок.Дата);
//			ТекДок.ОкончаниеКассовойСмены = КонецДня(ТекДок.Дата);			
//			ТекДок.КассаККМ = НастройкиПоУмолчанию.КассаККМ;
//			ТекДок.Подразделение = НастройкиПоУмолчанию.ПодразделениеКассаККМ;
//			ТекДок.СтруктурнаяЕдиница = ТекСклад;
//			Если ЗначениеЗаполнено(ТекДок.КассаККМ) Тогда
//				// Приводим ДанныеЗаполнения для вызова обработчика ЗаполнитьДокументПоОтбору
//				ДанныеЗаполнения = Новый Структура("КассаККМ, ПодписьЗаведущегоОтделом, ПодписьКассира", ТекДок.КассаККМ, ТекДок.Подразделение.ПодписьМОЛ, ТекДок.СтруктурнаяЕдиница.ПодписьМОЛ);
//			КонецЕсли;
//			
//			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, НЕОПРЕДЕЛЕНО, СтратегияЗаполнения);
//			
//			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
//			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
//			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
//			
//			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
//			ТекДок.Комментарий = Description;
//			
//			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
//			//ТекДок.Контрагент = ТекКонтрагент;
//			//ТекДок.Договор = ТекДоговор;
//			
//			// Дозаполняем данные
//			ТекДок.Статья = НастройкиПоУмолчанию.СтатьяКассаККМ;
//			
//			//ТекДок.ВалютаДокумента = ТекДоговор.ВалютаРасчетов;
//			ТекДок.ВалютаДокумента = ТекВалюта;
//						
//			//Данные по договору
//			//ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДок.Дата, Новый Структура("Валюта", ТекДок.ВалютаДокумента));
//			//ТекДок.Курс      = ВалютаРасчетовКурсКратность.Курс;
//			//ТекДок.Кратность = ВалютаРасчетовКурсКратность.Кратность;
//						
//			ТекДок.НалогообложениеНДС = ТекКонтрагент.НалогообложениеНДС;
//			ТекДок.НДСВключатьВСтоимость = ИСТИНА;
//			
//			Если ЗначениеЗаполнено(ТекДок.СтруктурнаяЕдиница.РозничныйВидЦен) Тогда
//				ТекДок.ВидЦен = ТекДок.СтруктурнаяЕдиница.РозничныйВидЦен;
//			Иначе	
//				ТекДок.ВидЦен = ТекДоговор.ВидЦен;
//			КонецЕсли;
//			
//			ТекДок.СуммаВключаетНДС = ?(ЗначениеЗаполнено(ТекДок.ВидЦен), ТекДок.ВидЦен.ЦенаВключаетНДС, Неопределено);
//			ТекДок.ВидСкидкиНаценки = ТекДоговор.ВидСкидкиНаценки;
//				
//			// Заполняем табличную часть
//			МассивОшибок = Новый Массив();
//			ТекДок.Запасы.Очистить();
//			Для каждого СоответствиеОбъекта Из TabularSection Цикл
//			
//				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
//				
//					РЕЗ.Результат = ЛОЖЬ;
//					РЕЗ.ВозвращаемоеЗначение = Ref;
//					РЕЗ.Описание = "Incorrect tabular section";
//					
//					Прервать;
//				
//				КонецЕсли;
//								
//				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
//				Price = СоответствиеОбъекта.Получить("Price");
//				Quantity = СоответствиеОбъекта.Получить("Quantity");
//				Sum = СоответствиеОбъекта.Получить("Sum");
//				VatValue = СоответствиеОбъекта.Получить("VatValue");
//				VatSum = СоответствиеОбъекта.Получить("VatSum");
//				Discount = СоответствиеОбъекта.Получить("Discount");
//				
//				ТекКоличество = 0;
//				ТекЦена = 0;
//				ТекСумма = 0;
//				ТекСуммаНДС = 0;
//				ТекСтавкаНДС = НЕОПРЕДЕЛЕНО;
//				ТекСуммаСкидки = 0;
//				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
//				
//				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
//					СтруктураОшибки = ПолучитьСтруктуруОшибки();
//					
//					СтруктураОшибки.Message = "Product not found";
//					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
//					СтруктураОшибки.Вставить("Value",ProductOptionCode);
//					
//					МассивОшибок.Добавить(СтруктураОшибки);
//				КонецЕсли;
//				
//				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
//					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
//						ТекКоличество = Число(Quantity);
//					Иначе
//						ТекКоличество = 0;
//					КонецЕсли
//				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
//					ТекКоличество = Quantity;
//				Иначе
//					СтруктураОшибки = ПолучитьСтруктуруОшибки();
//					
//					СтруктураОшибки.Message = "Invalid quantity";
//					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
//					СтруктураОшибки.Вставить("Value",Quantity);
//					
//					МассивОшибок.Добавить(СтруктураОшибки);
//				КонецЕсли;
//				
//				Если ТипЗНЧ(Price)=Тип("Строка") Тогда
//					Если СтрНайти(НРЕГ(Price),"null")=0 Тогда
//						ТекЦена = Число(Price);
//					Иначе
//						ТекЦена = 0;
//					КонецЕсли;
//				ИначеЕсли ТипЗНЧ(Price)=Тип("Число") Тогда
//					ТекЦена = Price;
//				Иначе
//					СтруктураОшибки = ПолучитьСтруктуруОшибки();
//					
//					СтруктураОшибки.Message = "Invalid price";
//					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
//					СтруктураОшибки.Вставить("Value",Price);
//					
//					МассивОшибок.Добавить(СтруктураОшибки);
//				КонецЕсли;
//				
//				Если ТипЗНЧ(Sum)=Тип("Строка") Тогда
//					Если СтрНайти(НРЕГ(Sum),"null")=0 Тогда
//						ТекСумма = Число(Sum);
//					Иначе
//						ТекСумма = 0;
//					КонецЕсли;
//				ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
//					ТекСумма = Sum;
//				Иначе
//					СтруктураОшибки = ПолучитьСтруктуруОшибки();
//					
//					СтруктураОшибки.Message = "Invalid sum";
//					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
//					СтруктураОшибки.Вставить("Value",Sum);
//					
//					МассивОшибок.Добавить(СтруктураОшибки);
//				КонецЕсли;
//				
//				Если НЕ VatSum = НЕОПРЕДЕЛЕНО Тогда
//					
//					Если ТипЗНЧ(VatSum)=Тип("Строка") Тогда
//						Если СтрНайти(НРЕГ(VatSum),"null")=0 Тогда
//							ТекСуммаНДС = Число(VatSum);
//						Иначе
//							ТекСуммаНДС = 0;
//						КонецЕсли;
//					ИначеЕсли ТипЗНЧ(VatSum)=Тип("Число") Тогда
//						ТекСуммаНДС = VatSum;
//					Иначе
//						СтруктураОшибки = ПолучитьСтруктуруОшибки();
//						
//						СтруктураОшибки.Message = "Invalid VatSum";
//						СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
//						СтруктураОшибки.Вставить("Value",VatSum);
//						
//						МассивОшибок.Добавить(СтруктураОшибки);
//					КонецЕсли;
//					
//					ТекСтавкаНДС = НайтиСтавкуНДС(VatValue);	
//					
//				КонецЕсли;
//								
//				Если ТипЗНЧ(Discount)=Тип("Строка") Тогда
//					Если СтрНайти(НРЕГ(Discount),"null")=0 Тогда
//						ТекСуммаСкидки = Число(Discount);
//					Иначе
//						ТекСуммаСкидки = 0;
//					КонецЕсли;
//				ИначеЕсли ТипЗНЧ(Discount)=Тип("Число") Тогда
//					ТекСуммаСкидки = Discount;
//				Иначе
//					СтруктураОшибки = ПолучитьСтруктуруОшибки();
//					
//					СтруктураОшибки.Message = "Invalid discount";
//					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
//					СтруктураОшибки.Вставить("Value",Discount);
//					
//					МассивОшибок.Добавить(СтруктураОшибки);
//				КонецЕсли;
//				
//			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
//				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
//				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
//				СтрокаТабличнойЧасти.Количество = ТекКоличество;
//				СтрокаТабличнойЧасти.Цена = ТекЦена;
//
//				ТекСуммаВычисленная = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
//				Если НЕ ТекСуммаВычисленная = ТекСумма Тогда
//					ТекСуммаСкидки = ТекСуммаВычисленная - ТекСумма;
//					ТекСумма = ТекСуммаВычисленная;
//				КонецЕсли;
//
//				Если ТекСумма>0 Тогда
//					Если ТекСумма>ТекСуммаСкидки Тогда
//						СтрокаТабличнойЧасти.Сумма = ТекСумма - ТекСуммаСкидки;
//						СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = (ТекСуммаСкидки*100)/ТекСумма;
//					Иначе
//						СтрокаТабличнойЧасти.Сумма = 0;
//						СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100;
//					КонецЕсли;
//				КонецЕсли;
//				
//				СтрокаТабличнойЧасти.СтавкаНДС = ТекСтавкаНДС;
//				СтрокаТабличнойЧасти.СуммаНДС = ТекСуммаНДС;
//								
//				Если СтрокаТабличнойЧасти.Сумма>0 Тогда
//					СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(ТекДок.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
//				КонецЕсли;
//				
//			КонецЦикла;
//			
//			// Проверка остатков
//			РЕЗ = ПолучитьМассивОшибокПоОстаткам(ТекДок,ТекДок.СтруктурнаяЕдиница,РЕЗ,МассивОшибок);
//			
//			// Проводим
//			ОписаниеУспешногоПроведения = "Doc retail created successfully";
//			ЗаписыватьПриОшибках=ЛОЖЬ;
//			ОписаниеДляМассиваОшибок="";
//			ФиксироватьТранзакции=ЛОЖЬ;
//			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
//			
//			СтрокаОшибок = РЕЗ.Описание;
//			// Получаем оплату наличными
//			Если РЕЗ.Результат Тогда
//				Если НЕ CashIncomeOrder = НЕОПРЕДЕЛЕНО Тогда
//					
//					РеквизитовПоступлениеВКассуRef = CashIncomeOrder.Получить("Ref");
//					
//					СтруктураДополнительныхРеквизитовПоступлениеВКассу = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеВКассу);
//					ДопПараметрПоступлениеВКассу = СтруктураДополнительныхРеквизитовПоступлениеВКассу.DocRef;
//					
//					ЗапросПоступлениеВКассу = Новый Запрос;
//					ЗапросПоступлениеВКассу.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//					|	ПоступлениеВКассуДополнительныеРеквизиты.Ссылка
//					|ИЗ
//					|	Документ.ПоступлениеВКассу.ДополнительныеРеквизиты КАК ПоступлениеВКассуДополнительныеРеквизиты
//					|ГДЕ
//					|	ПоступлениеВКассуДополнительныеРеквизиты.Значение = &ТекПараметр
//					|	И ПоступлениеВКассуДополнительныеРеквизиты.Свойство = &ДопПараметр";
//					
//					ЗапросПоступлениеВКассу.УстановитьПараметр("ТекПараметр", РеквизитовПоступлениеВКассуRef);
//					ЗапросПоступлениеВКассу.УстановитьПараметр("ДопПараметр", ДопПараметрПоступлениеВКассу);
//					РезультатЗапросаПоступлениеВКассу = ЗапросПоступлениеВКассу.Выполнить();
//					Если РезультатЗапросаПоступлениеВКассу.Пустой() Тогда
//						РЕЗ = СоздатьПоступлениеВКассу(РЕЗ,CashIncomeOrder,НЕОПРЕДЕЛЕНО,Ref,ТекДок.НалогообложениеНДС);
//					Иначе
//						РЕЗ = ОбновитьПоступлениеВКассу(РЕЗ,CashIncomeOrder,НЕОПРЕДЕЛЕНО,Ref,ТекДок.НалогообложениеНДС);
//					КонецЕсли;
//					
//					Если НЕ РЕЗ.Результат Тогда
//						РЕЗ.Описание = СтрокаОшибок + "; " + РЕЗ.Описание;
//					КонецЕсли;
//					
//				КонецЕсли;
//			КонецЕсли;
//			
//			// Получаем оплату безналом
//			Если РЕЗ.Результат Тогда
//				Если НЕ ReceivingMoneyOnAccount = НЕОПРЕДЕЛЕНО Тогда
//					
//					РеквизитовПоступлениеНаСчетRef = ReceivingMoneyOnAccount.Получить("Ref");
//					
//					СтруктураДополнительныхРеквизитовПоступлениеНаСчет = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеНаСчет);
//					ДопПараметрПоступлениеНаСчет = СтруктураДополнительныхРеквизитовПоступлениеНаСчет.DocRef;
//					
//					ЗапросПоступлениеНаСчет = Новый Запрос;
//					ЗапросПоступлениеНаСчет.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//					|	ПоступлениеНаСчетДополнительныеРеквизиты.Ссылка
//					|ИЗ
//					|	Документ.ПоступлениеНаСчет.ДополнительныеРеквизиты КАК ПоступлениеНаСчетДополнительныеРеквизиты
//					|ГДЕ
//					|	ПоступлениеНаСчетДополнительныеРеквизиты.Значение = &ТекПараметр
//					|	И ПоступлениеНаСчетДополнительныеРеквизиты.Свойство = &ДопПараметр";
//					
//					ЗапросПоступлениеНаСчет.УстановитьПараметр("ТекПараметр", РеквизитовПоступлениеНаСчетRef);
//					ЗапросПоступлениеНаСчет.УстановитьПараметр("ДопПараметр", ДопПараметрПоступлениеНаСчет);
//					РезультатЗапросаПоступлениеНаСчет = ЗапросПоступлениеНаСчет.Выполнить();
//					Если РезультатЗапросаПоступлениеНаСчет.Пустой() Тогда
//						РЕЗ = СоздатьПоступлениеНаСчет(РЕЗ,ReceivingMoneyOnAccount,НЕОПРЕДЕЛЕНО,Ref,ТекДок.НалогообложениеНДС,ТекКонтрагент,ТекДоговор);
//					Иначе
//						РЕЗ = ОбновитьПоступлениеНаСчет(РЕЗ,ReceivingMoneyOnAccount,НЕОПРЕДЕЛЕНО,Ref,ТекДок.НалогообложениеНДС,ТекКонтрагент,ТекДоговор);
//					КонецЕсли;
//					
//					Если НЕ РЕЗ.Результат Тогда
//						РЕЗ.Описание = СтрокаОшибок + "; " + РЕЗ.Описание;
//					КонецЕсли;
//					
//				КонецЕсли;
//			КонецЕсли;
//			
//			Если РЕЗ.Результат Тогда
//				РЕЗ.Описание = "Doc retail created successfully";
//				ЗафиксироватьТранзакцию()
//			Иначе
//				Если ТранзакцияАктивна() Тогда
//					ОтменитьТранзакцию();
//				КонецЕсли;
//			КонецЕсли;
//		
//		КонецЕсли;
//			
//	Иначе
//		
//		РЕЗ.Результат = ЛОЖЬ;
//		РЕЗ.ВозвращаемоеЗначение = Ref;
//		РЕЗ.Описание = "Doc retail already exist";		
//		
//	КонецЕсли;
//	
//	Возврат РЕЗ;
//КонецФункции

//Функция ОбновитьОтчетОРозничныхПродажах(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
//	ПЕРЕМ РЕЗ;
//		
//	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
//	
//	Ref = СоответствиеОбъекта.Получить("Ref");
//	Number = СоответствиеОбъекта.Получить("Number");
//	Date = СоответствиеОбъекта.Получить("Date");
//	PartnerCIN = СоответствиеОбъекта.Получить("PartnerCIN");
//	WarehouseCode = СоответствиеОбъекта.Получить("WarehouseCode");
//	Currency = СоответствиеОбъекта.Получить("Currency");
//	Description = СоответствиеОбъекта.Получить("Description");
//	TabularSection = СоответствиеОбъекта.Получить("TabularSection");
//	CashIncomeOrder = СоответствиеОбъекта.Получить("CashIncomeOrder");
//	ReceivingMoneyOnAccount = СоответствиеОбъекта.Получить("ReceivingMoneyOnAccount");
//
//	НеПроводить=ЛОЖЬ;
//	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
//	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
//		НеПроводить = НЕ (AccountingEntry);
//	КонецЕсли;
//	
//	Если НЕ ЗначениеЗаполнено(Ref) Тогда
//	
//		РЕЗ.Результат = ЛОЖЬ;
//		РЕЗ.ВозвращаемоеЗначение = Ref;
//		РЕЗ.Описание = "Incorrect ref";
//		
//		Возврат РЕЗ;
//	
//	КонецЕсли;
//	
//	ДатаДокумента = ДатаJSON(Date);
//	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
//		
//		РЕЗ.Результат = ЛОЖЬ;
//		РЕЗ.ВозвращаемоеЗначение = Date;
//		РЕЗ.Описание = "Error reading date";
//		
//		Возврат РЕЗ;
//	КонецЕсли;
//	
//	ТекВалюта = НЕОПРЕДЕЛЕНО;
//	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
//	Если НЕ РЕЗ.Результат Тогда
//		Возврат РЕЗ;
//	Иначе
//		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
//	КонецЕсли;
//	
//	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
//	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
//	
//		РЕЗ.Результат = ЛОЖЬ;
//		РЕЗ.ВозвращаемоеЗначение = Ref;
//		РЕЗ.Описание = "Incorrect default settings";
//		
//		Возврат РЕЗ;
//	
//	КонецЕсли;
//	
//	Если НЕ ТипЗНЧ(TabularSection)=Тип("Массив") Тогда
//	
//		РЕЗ.Результат = ЛОЖЬ;
//		РЕЗ.ВозвращаемоеЗначение = Ref;
//		РЕЗ.Описание = "Incorrect tabular section";
//		
//		Возврат РЕЗ;
//	
//	КонецЕсли;
//	
//	// Ищем существующие
//	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОтчетОРозничныхПродажах);
//	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//	               |	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Ссылка
//	               |ИЗ
//	               |	Документ.ОтчетОРозничныхПродажах.ДополнительныеРеквизиты КАК ОтчетОРозничныхПродажахДополнительныеРеквизиты
//	               |ГДЕ
//	               |	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Значение = &ТекПараметр
//	               |	И ОтчетОРозничныхПродажахДополнительныеРеквизиты.Свойство = &ДопПараметр";
//		
//	Запрос.УстановитьПараметр("ТекПараметр", Ref);
//	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
//	РезультатЗапроса = Запрос.Выполнить();
//	Если НЕ РезультатЗапроса.Пустой() Тогда
//						
//		// Ищем контрагента				
//		ТекКонтрагент = НайтиКонтрагентаПоИНН(СокрЛП(PartnerCIN));
//		
//		Если ТекКонтрагент = НЕОПРЕДЕЛЕНО Тогда
//		
//			РЕЗ.Результат = ЛОЖЬ;
//			РЕЗ.ВозвращаемоеЗначение = PartnerCIN;
//			РЕЗ.Описание = "Partner not found";
//			
//		Иначе
//			
//			Если ЗначениеЗаполнено(ТекКонтрагент.ДоговорПоУмолчанию) Тогда
//				ТекДоговор = ТекКонтрагент.ДоговорПоУмолчанию;
//				Если ((НЕ ТекДоговор.Покупатель) И (Константы.ИспользоватьВидыДоговоров.Получить())) ИЛИ (НЕ ТекДоговор.ВалютаРасчетов = ТекВалюта.Ссылка) Тогда
//					ТекДоговор = СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,ИСТИНА);
//				КонецЕсли;
//			Иначе
//				ТекДоговор = СоздатьДоговор(ТекКонтрагент,НастройкиПоУмолчанию,ТекВалюта,ИСТИНА);
//			КонецЕсли;
//						
//		КонецЕсли;
//		
//		//Ищем Склад
//		Если РЕЗ.Результат Тогда
//			ТекСклад = НайтиСклад(СокрЛП(WarehouseCode));
//			Если ТекСклад = НЕОПРЕДЕЛЕНО Тогда
//			
//				РЕЗ.Результат = ЛОЖЬ;
//				РЕЗ.ВозвращаемоеЗначение = WarehouseCode;
//				РЕЗ.Описание = "Warehouse not found";
//			
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если РЕЗ.Результат Тогда
//			НачатьТранзакцию();
//			
//			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//			
//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//				ТекДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
//			КонецЦикла;
//			
//			// Убираем пометку удаления
//			Попытка
//				Если ТекДок.ПометкаУдаления Тогда
//					ТекДок.Записать(РежимЗаписиДокумента.Запись);
//					ТекДок.УстановитьПометкуУдаления(ЛОЖЬ);
//				КонецЕсли;
//			Исключение
//				
//				Если ТранзакцияАктивна() Тогда
//					ОтменитьТранзакцию();
//				КонецЕсли;
//				
//				РЕЗ.Результат = ЛОЖЬ;
//				РЕЗ.ВозвращаемоеЗначение = Ref;
//				РЕЗ.Описание = "Internal processing error";
//				
//				Возврат РЕЗ;
//			КонецПопытки;
//			
//			ТекДок.Дата = ДатаДокумента;
//			
//			СтратегияЗаполнения = Новый Соответствие;
//			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьДокументПоОтбору";
//			СтратегияЗаполнения[Тип("ДокументСсылка.ИнвентаризацияЗапасов")] = "ЗаполнитьПоИнвентаризацииЗапасовНаСкладе";
//			
//			ТекДок.НачалоКассовойСмены    = НачалоДня(ТекДок.Дата);
//			ТекДок.ОкончаниеКассовойСмены = КонецДня(ТекДок.Дата);			
//			ТекДок.КассаККМ = НастройкиПоУмолчанию.КассаККМ;
//			ТекДок.Подразделение = НастройкиПоУмолчанию.ПодразделениеКассаККМ;
//			ТекДок.СтруктурнаяЕдиница = ТекСклад;
//			Если ЗначениеЗаполнено(ТекДок.КассаККМ) Тогда
//				// Приводим ДанныеЗаполнения для вызова обработчика ЗаполнитьДокументПоОтбору
//				ДанныеЗаполнения = Новый Структура("КассаККМ, ПодписьЗаведущегоОтделом, ПодписьКассира", ТекДок.КассаККМ, ТекДок.Подразделение.ПодписьМОЛ, ТекДок.СтруктурнаяЕдиница.ПодписьМОЛ);
//			КонецЕсли;
//			
//			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, НЕОПРЕДЕЛЕНО, СтратегияЗаполнения);
//			
//			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
//			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
//			УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
//			
//			ТекДок.Автор = НастройкиПоУмолчанию.Автор;
//			ТекДок.Комментарий = Description;
//			
//			ТекДок.Организация = НастройкиПоУмолчанию.Организация;
//			//ТекДок.Контрагент = ТекКонтрагент;
//			//ТекДок.Договор = ТекДоговор;
//			
//			// Дозаполняем данные
//			ТекДок.Статья = НастройкиПоУмолчанию.СтатьяКассаККМ;
//			
//			//ТекДок.ВалютаДокумента = ТекДоговор.ВалютаРасчетов;
//			ТекДок.ВалютаДокумента = ТекВалюта;
//						
//			//Данные по договору
//			//ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДок.Дата, Новый Структура("Валюта", ТекДок.ВалютаДокумента));
//			//ТекДок.Курс      = ВалютаРасчетовКурсКратность.Курс;
//			//ТекДок.Кратность = ВалютаРасчетовКурсКратность.Кратность;
//						
//			ТекДок.НалогообложениеНДС = ТекКонтрагент.НалогообложениеНДС;
//			ТекДок.НДСВключатьВСтоимость = ИСТИНА;
//			
//			Если ЗначениеЗаполнено(ТекДок.СтруктурнаяЕдиница.РозничныйВидЦен) Тогда
//				ТекДок.ВидЦен = ТекДок.СтруктурнаяЕдиница.РозничныйВидЦен;
//			Иначе	
//				ТекДок.ВидЦен = ТекДоговор.ВидЦен;
//			КонецЕсли;
//			
//			ТекДок.СуммаВключаетНДС = ?(ЗначениеЗаполнено(ТекДок.ВидЦен), ТекДок.ВидЦен.ЦенаВключаетНДС, Неопределено);
//			ТекДок.ВидСкидкиНаценки = ТекДоговор.ВидСкидкиНаценки;
//				
//			// Заполняем табличную часть
//			МассивОшибок = Новый Массив();
//			ТекДок.Запасы.Очистить();
//			Для каждого СоответствиеОбъекта Из TabularSection Цикл
//			
//				Если НЕ ТипЗНЧ(СоответствиеОбъекта)=Тип("Соответствие") Тогда
//				
//					РЕЗ.Результат = ЛОЖЬ;
//					РЕЗ.ВозвращаемоеЗначение = Ref;
//					РЕЗ.Описание = "Incorrect tabular section";
//					
//					Прервать;
//				
//				КонецЕсли;				
//				
//				ProductOptionCode = СоответствиеОбъекта.Получить("ProductOptionCode");
//				Price = СоответствиеОбъекта.Получить("Price");
//				Quantity = СоответствиеОбъекта.Получить("Quantity");
//				Sum = СоответствиеОбъекта.Получить("Sum");
//				VatValue = СоответствиеОбъекта.Получить("VatValue");
//				VatSum = СоответствиеОбъекта.Получить("VatSum");
//				Discount = СоответствиеОбъекта.Получить("Discount");
//				
//				ТекКоличество = 0;
//				ТекЦена = 0;
//				ТекСумма = 0;
//				ТекСуммаНДС = 0;
//				ТекСтавкаНДС = НЕОПРЕДЕЛЕНО;
//				ТекСуммаСкидки = 0;
//				ТекНоменклатура = НайтиНомекклатуруПоАртикулу(СокрЛП(ProductOptionCode));
//				
//				Если ТекНоменклатура = НЕОПРЕДЕЛЕНО Тогда
//					СтруктураОшибки = ПолучитьСтруктуруОшибки();
//					
//					СтруктураОшибки.Message = "Product not found";
//					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
//					СтруктураОшибки.Вставить("Value",ProductOptionCode);
//					
//					МассивОшибок.Добавить(СтруктураОшибки);
//				КонецЕсли;
//				
//				Если ТипЗНЧ(Quantity)=Тип("Строка") Тогда
//					Если СтрНайти(НРЕГ(Quantity),"null")=0 Тогда
//						ТекКоличество = Число(Quantity);
//					Иначе
//						ТекКоличество = 0;
//					КонецЕсли
//				ИначеЕсли ТипЗНЧ(Quantity)=Тип("Число") Тогда
//					ТекКоличество = Quantity;
//				Иначе
//					СтруктураОшибки = ПолучитьСтруктуруОшибки();
//					
//					СтруктураОшибки.Message = "Invalid quantity";
//					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
//					СтруктураОшибки.Вставить("Value",Quantity);
//					
//					МассивОшибок.Добавить(СтруктураОшибки);
//				КонецЕсли;
//				
//				Если ТипЗНЧ(Price)=Тип("Строка") Тогда
//					Если СтрНайти(НРЕГ(Price),"null")=0 Тогда
//						ТекЦена = Число(Price);
//					Иначе
//						ТекЦена = 0;
//					КонецЕсли;
//				ИначеЕсли ТипЗНЧ(Price)=Тип("Число") Тогда
//					ТекЦена = Price;
//				Иначе
//					СтруктураОшибки = ПолучитьСтруктуруОшибки();
//					
//					СтруктураОшибки.Message = "Invalid price";
//					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
//					СтруктураОшибки.Вставить("Value",Price);
//					
//					МассивОшибок.Добавить(СтруктураОшибки);
//				КонецЕсли;
//				
//				Если ТипЗНЧ(Sum)=Тип("Строка") Тогда
//					Если СтрНайти(НРЕГ(Sum),"null")=0 Тогда
//						ТекСумма = Число(Sum);
//					Иначе
//						ТекСумма = 0;
//					КонецЕсли;
//				ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
//					ТекСумма = Sum;
//				Иначе
//					СтруктураОшибки = ПолучитьСтруктуруОшибки();
//					
//					СтруктураОшибки.Message = "Invalid sum";
//					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
//					СтруктураОшибки.Вставить("Value",Sum);
//					
//					МассивОшибок.Добавить(СтруктураОшибки);
//				КонецЕсли;
//				
//				Если НЕ VatSum = НЕОПРЕДЕЛЕНО Тогда
//					
//					Если ТипЗНЧ(VatSum)=Тип("Строка") Тогда
//						Если СтрНайти(НРЕГ(VatSum),"null")=0 Тогда
//							ТекСуммаНДС = Число(VatSum);
//						Иначе
//							ТекСуммаНДС = 0;
//						КонецЕсли;
//					ИначеЕсли ТипЗНЧ(VatSum)=Тип("Число") Тогда
//						ТекСуммаНДС = VatSum;
//					Иначе
//						СтруктураОшибки = ПолучитьСтруктуруОшибки();
//						
//						СтруктураОшибки.Message = "Invalid VatSum";
//						СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
//						СтруктураОшибки.Вставить("Value",VatSum);
//						
//						МассивОшибок.Добавить(СтруктураОшибки);
//					КонецЕсли;
//					
//					ТекСтавкаНДС = НайтиСтавкуНДС(VatValue);
//					
//				КонецЕсли;
//				
//				Если ТипЗНЧ(Discount)=Тип("Строка") Тогда
//					Если СтрНайти(НРЕГ(Discount),"null")=0 Тогда
//						ТекСуммаСкидки = Число(Discount);
//					Иначе
//						ТекСуммаСкидки = 0;
//					КонецЕсли;
//				ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
//					ТекСуммаСкидки = Discount;
//				Иначе
//					СтруктураОшибки = ПолучитьСтруктуруОшибки();
//					
//					СтруктураОшибки.Message = "Invalid discount";
//					СтруктураОшибки.Вставить("ProductOptionCode",ProductOptionCode);
//					СтруктураОшибки.Вставить("Value",Discount);
//					
//					МассивОшибок.Добавить(СтруктураОшибки);
//				КонецЕсли;
//				
//			    СтрокаТабличнойЧасти = ТекДок.Запасы.Добавить();
//				СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
//				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
//				СтрокаТабличнойЧасти.Количество = ТекКоличество;
//				СтрокаТабличнойЧасти.Цена = ТекЦена;
//
//				ТекСуммаВычисленная = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
//				Если НЕ ТекСуммаВычисленная = ТекСумма Тогда
//					ТекСуммаСкидки = ТекСуммаВычисленная - ТекСумма;
//					ТекСумма = ТекСуммаВычисленная;
//				КонецЕсли;
//
//				Если ТекСумма>0 Тогда
//					Если ТекСумма>ТекСуммаСкидки Тогда
//						СтрокаТабличнойЧасти.Сумма = ТекСумма - ТекСуммаСкидки;
//						СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = (ТекСуммаСкидки*100)/ТекСумма;
//					Иначе
//						СтрокаТабличнойЧасти.Сумма = 0;
//						СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100;
//					КонецЕсли;
//				КонецЕсли;
//				
//				СтрокаТабличнойЧасти.СтавкаНДС = ТекСтавкаНДС;
//				СтрокаТабличнойЧасти.СуммаНДС = ТекСуммаНДС;
//								
//				Если СтрокаТабличнойЧасти.Сумма>0 Тогда
//					СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(ТекДок.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
//				КонецЕсли;
//				
//			КонецЦикла;
//			
//			// Проверка остатков
//			РЕЗ = ПолучитьМассивОшибокПоОстаткам(ТекДок,ТекДок.СтруктурнаяЕдиница,РЕЗ,МассивОшибок);
//									
//			// Проводим
//			ОписаниеУспешногоПроведения = "Doc retail updated successfully";
//			ЗаписыватьПриОшибках=ЛОЖЬ;
//			ОписаниеДляМассиваОшибок="";
//			ФиксироватьТранзакции=ЛОЖЬ;
//			РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
//			
//			СтрокаОшибок = РЕЗ.Описание;
//			// Получаем оплату наличными
//			Если РЕЗ.Результат Тогда
//				Если НЕ CashIncomeOrder = НЕОПРЕДЕЛЕНО Тогда
//					
//					РеквизитовПоступлениеВКассуRef = CashIncomeOrder.Получить("Ref");
//					
//					СтруктураДополнительныхРеквизитовПоступлениеВКассу = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеВКассу);
//					ДопПараметрПоступлениеВКассу = СтруктураДополнительныхРеквизитовПоступлениеВКассу.DocRef;
//					
//					ЗапросПоступлениеВКассу = Новый Запрос;
//					ЗапросПоступлениеВКассу.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//					|	ПоступлениеВКассуДополнительныеРеквизиты.Ссылка
//					|ИЗ
//					|	Документ.ПоступлениеВКассу.ДополнительныеРеквизиты КАК ПоступлениеВКассуДополнительныеРеквизиты
//					|ГДЕ
//					|	ПоступлениеВКассуДополнительныеРеквизиты.Значение = &ТекПараметр
//					|	И ПоступлениеВКассуДополнительныеРеквизиты.Свойство = &ДопПараметр";
//					
//					ЗапросПоступлениеВКассу.УстановитьПараметр("ТекПараметр", РеквизитовПоступлениеВКассуRef);
//					ЗапросПоступлениеВКассу.УстановитьПараметр("ДопПараметр", ДопПараметрПоступлениеВКассу);
//					РезультатЗапросаПоступлениеВКассу = ЗапросПоступлениеВКассу.Выполнить();
//					Если РезультатЗапросаПоступлениеВКассу.Пустой() Тогда
//						РЕЗ = СоздатьПоступлениеВКассу(РЕЗ,CashIncomeOrder,НЕОПРЕДЕЛЕНО,Ref,ТекДок.НалогообложениеНДС);
//					Иначе
//						РЕЗ = ОбновитьПоступлениеВКассу(РЕЗ,CashIncomeOrder,НЕОПРЕДЕЛЕНО,Ref,ТекДок.НалогообложениеНДС);
//					КонецЕсли;
//					
//					Если НЕ РЕЗ.Результат Тогда
//						РЕЗ.Описание = СтрокаОшибок + "; " + РЕЗ.Описание;
//					КонецЕсли;
//					
//				КонецЕсли;
//			КонецЕсли;
//			
//			// Получаем оплату безналом
//			Если РЕЗ.Результат Тогда
//				Если НЕ ReceivingMoneyOnAccount = НЕОПРЕДЕЛЕНО Тогда
//					
//					РеквизитовПоступлениеНаСчетRef = ReceivingMoneyOnAccount.Получить("Ref");
//					
//					СтруктураДополнительныхРеквизитовПоступлениеНаСчет = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеНаСчет);
//					ДопПараметрПоступлениеНаСчет = СтруктураДополнительныхРеквизитовПоступлениеНаСчет.DocRef;
//					
//					ЗапросПоступлениеНаСчет = Новый Запрос;
//					ЗапросПоступлениеНаСчет.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//					|	ПоступлениеНаСчетДополнительныеРеквизиты.Ссылка
//					|ИЗ
//					|	Документ.ПоступлениеНаСчет.ДополнительныеРеквизиты КАК ПоступлениеНаСчетДополнительныеРеквизиты
//					|ГДЕ
//					|	ПоступлениеНаСчетДополнительныеРеквизиты.Значение = &ТекПараметр
//					|	И ПоступлениеНаСчетДополнительныеРеквизиты.Свойство = &ДопПараметр";
//					
//					ЗапросПоступлениеНаСчет.УстановитьПараметр("ТекПараметр", РеквизитовПоступлениеНаСчетRef);
//					ЗапросПоступлениеНаСчет.УстановитьПараметр("ДопПараметр", ДопПараметрПоступлениеНаСчет);
//					РезультатЗапросаПоступлениеНаСчет = ЗапросПоступлениеНаСчет.Выполнить();
//					Если РезультатЗапросаПоступлениеНаСчет.Пустой() Тогда
//						РЕЗ = СоздатьПоступлениеНаСчет(РЕЗ,ReceivingMoneyOnAccount,НЕОПРЕДЕЛЕНО,Ref,ТекДок.НалогообложениеНДС,ТекКонтрагент,ТекДоговор);
//					Иначе
//						РЕЗ = ОбновитьПоступлениеНаСчет(РЕЗ,ReceivingMoneyOnAccount,НЕОПРЕДЕЛЕНО,Ref,ТекДок.НалогообложениеНДС,ТекКонтрагент,ТекДоговор);
//					КонецЕсли;
//					
//					Если НЕ РЕЗ.Результат Тогда
//						РЕЗ.Описание = СтрокаОшибок + "; " + РЕЗ.Описание;
//					КонецЕсли;
//					
//				КонецЕсли;
//			КонецЕсли;
//			
//			Если РЕЗ.Результат Тогда
//				РЕЗ.Описание = "Doc retail updated successfully";
//				ЗафиксироватьТранзакцию()
//			Иначе
//				Если ТранзакцияАктивна() Тогда
//					ОтменитьТранзакцию();
//				КонецЕсли;
//			КонецЕсли;
//		
//		КонецЕсли;
//			
//	Иначе
//		
//		РЕЗ.Результат = ЛОЖЬ;
//		РЕЗ.ВозвращаемоеЗначение = Ref;
//		РЕЗ.Описание = "Doc retail not found";
//		
//	КонецЕсли;
//	
//	Возврат РЕЗ;
//КонецФункции

//Функция УдалитьОтчетОРозничныхПродажах(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
//	ПЕРЕМ РЕЗ;
//	
//	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
//	
//	ЗначениеПараметра = СоответствиеОбъекта.Получить("Ref");
//	
//	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
//	
//		РЕЗ.Результат = ЛОЖЬ;
//		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
//		РЕЗ.Описание = "Incorrect ref";
//		
//		Возврат РЕЗ;
//	
//	КонецЕсли;
//	
//	// Удаляем поступления в кассу
//	СтруктураДополнительныхРеквизитовПоступлениеВКассу = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеВКассу);
//	ДопПараметрПоступлениеВКассу = СтруктураДополнительныхРеквизитовПоступлениеВКассу.BaseRef;
//	
//	ЗапросПоступлениеВКассу = Новый Запрос;
//	ЗапросПоступлениеВКассу.Текст = "ВЫБРАТЬ
//	                                |	ПоступлениеВКассуДополнительныеРеквизиты.Ссылка
//	                                |ИЗ
//	                                |	Документ.ПоступлениеВКассу.ДополнительныеРеквизиты КАК ПоступлениеВКассуДополнительныеРеквизиты
//	                                |ГДЕ
//	                                |	ПоступлениеВКассуДополнительныеРеквизиты.Значение = &ТекПараметр
//	                                |	И ПоступлениеВКассуДополнительныеРеквизиты.Свойство = &ДопПараметр";
//	
//	ЗапросПоступлениеВКассу.УстановитьПараметр("ТекПараметр", ЗначениеПараметра);
//	ЗапросПоступлениеВКассу.УстановитьПараметр("ДопПараметр", ДопПараметрПоступлениеВКассу);
//	РезультатЗапросаПоступлениеВКассу = ЗапросПоступлениеВКассу.Выполнить();
//	ВыборкаПоступлениеВКассу = РезультатЗапросаПоступлениеВКассу.Выбрать();
//	Пока ВыборкаПоступлениеВКассу.Следующий() Цикл
//		
//		ТекОбъект = ВыборкаПоступлениеВКассу.Ссылка.ПолучитьОбъект();
//		
//		ТекОбъект.УстановитьПометкуУдаления(ИСТИНА);
//		
//	КонецЦикла;
//	
//	// Удаляем поступления на счет
//	СтруктураДополнительныхРеквизитовПоступлениеНаСчет = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеНаСчет);
//	ДопПараметрПоступлениеНаСчет = СтруктураДополнительныхРеквизитовПоступлениеНаСчет.BaseRef;
//	
//	ЗапросПоступлениеНаСчет = Новый Запрос;
//	ЗапросПоступлениеНаСчет.Текст = "ВЫБРАТЬ
//	                                |	ПоступлениеНаСчетДополнительныеРеквизиты.Ссылка
//	                                |ИЗ
//	                                |	Документ.ПоступлениеНаСчет.ДополнительныеРеквизиты КАК ПоступлениеНаСчетДополнительныеРеквизиты
//	                                |ГДЕ
//	                                |	ПоступлениеНаСчетДополнительныеРеквизиты.Значение = &ТекПараметр
//	                                |	И ПоступлениеНаСчетДополнительныеРеквизиты.Свойство = &ДопПараметр";
//	
//	ЗапросПоступлениеНаСчет.УстановитьПараметр("ТекПараметр", ЗначениеПараметра);
//	ЗапросПоступлениеНаСчет.УстановитьПараметр("ДопПараметр", ДопПараметрПоступлениеНаСчет);
//	РезультатЗапросаПоступлениеНаСчет = ЗапросПоступлениеНаСчет.Выполнить();
//	ВыборкаПоступлениеНаСчет = РезультатЗапросаПоступлениеНаСчет.Выбрать();
//	Пока ВыборкаПоступлениеНаСчет.Следующий() Цикл
//		
//		ТекОбъект = ВыборкаПоступлениеНаСчет.Ссылка.ПолучитьОбъект();
//		
//		ТекОбъект.УстановитьПометкуУдаления(ИСТИНА);
//		
//	КонецЦикла;
//	
//	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОтчетОРозничныхПродажах);
//	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
//		
//	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
//	                      |	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Ссылка
//	                      |ИЗ
//	                      |	Документ.ОтчетОРозничныхПродажах.ДополнительныеРеквизиты КАК ОтчетОРозничныхПродажахДополнительныеРеквизиты
//	                      |ГДЕ
//	                      |	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Значение = &ТекПараметр
//	                      |	И ОтчетОРозничныхПродажахДополнительныеРеквизиты.Свойство = &ДопПараметр";
//	
//	СтрокаОтветаДляУдачногоРезультата = "Doc retail deleted successfully";
//	СтрокаОтветаОбъектНеНайден = "Doc retail not found";
//	
//	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден,ДопПараметр);
//	
//	Возврат РЕЗ;
//КонецФункции
#КонецОбласти

#Область ПоступлениеВКассу
Функция СоздатьПоступлениеВКассу(СтруктураДляВозврата,СоответствиеОбъекта,РасходнаяНакладнаяRef,ОтчетОРозничныхПродажахRef,ТекНалогообложениеНДС=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	CashDeskCode = СоответствиеОбъекта.Получить("CashDeskCode");
	CashDesk = СоответствиеОбъекта.Получить("CashDesk");
	Currency = СоответствиеОбъекта.Получить("Currency");
	Sum = СоответствиеОбъекта.Получить("Sum");
	VatValue = СоответствиеОбъекта.Получить("VatValue");
	VatSum = СоответствиеОбъекта.Получить("VatSum");
	Description = СоответствиеОбъекта.Получить("Description");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref of cash income order";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	// Ищем Кассу
	ТекКасса = НЕОПРЕДЕЛЕНО;
	Если НЕ CashDeskCode = НЕОПРЕДЕЛЕНО Тогда
		Если ТипЗНЧ(CashDeskCode)=Тип("Строка") Тогда
			ЗапросКасса = Новый Запрос;
			ЗапросКасса.Текст = 
			"ВЫБРАТЬ
			|	Кассы.Ссылка
			|ИЗ
			|	Справочник.Кассы КАК Кассы
			|ГДЕ
			|	Кассы.Код = &Код";
			
			ЗапросКасса.УстановитьПараметр("Код", СокрЛП(CashDeskCode));
			РезультатЗапросаКасса = ЗапросКасса.Выполнить();
			ВыборкаДетальныеЗаписиКасса = РезультатЗапросаКасса.Выбрать();
			Пока ВыборкаДетальныеЗаписиКасса.Следующий() Цикл
				ТекКасса = ВыборкаДетальныеЗаписиКасса.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ТекКасса = НЕОПРЕДЕЛЕНО Тогда
		Если НЕ CashDesk = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ = НайтиИлиСоздатьКассу(РЕЗ,CashDesk,ТекВалюта);
			Если НЕ РЕЗ.Результат Тогда
				Возврат РЕЗ;
			Иначе
				ТекКасса = РЕЗ.ВозвращаемоеЗначение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ТекКасса = НЕОПРЕДЕЛЕНО Тогда
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ?(CashDeskCode = НЕОПРЕДЕЛЕНО,Ref,CashDeskCode);
		РЕЗ.Описание = "CashDesk not found";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	Если ТипЗНЧ(Sum)=Тип("Строка") Тогда
		Если СтрНайти(НРЕГ(Sum),"null")=0 Тогда
			ТекСумма = Число(Sum);
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of cash income order";
		
			Возврат РЕЗ;
		КонецЕсли;
	ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
		ТекСумма = Sum;
		Если ТекСумма = 0 Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of cash income order";
			
			Возврат РЕЗ;
		КонецЕсли;
	Иначе
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect sum of cash income order";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекСуммаНДС = НЕОПРЕДЕЛЕНО;
	ТекСтавкаНДС = НЕОПРЕДЕЛЕНО;
	Если НЕ VatSum = НЕОПРЕДЕЛЕНО Тогда
		
		Если ТипЗНЧ(VatSum)=Тип("Строка") Тогда
			Если СтрНайти(НРЕГ(VatSum),"null")=0 Тогда
				ТекСуммаНДС = Число(VatSum);
			Иначе
				ТекСуммаНДС = 0;
			КонецЕсли;
		//ИначеЕсли ТипЗНЧ(VatSum)=Тип("Число") Тогда
		//	ТекСуммаНДС = VatSum;
		Иначе
			ТекСуммаНДС = VatSum;
		КонецЕсли;
		Если НЕ ТипЗНЧ(ТекСуммаНДС)=Тип("Число") Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Invalid VatSum of cash income order";
			
			Возврат РЕЗ;
		КонецЕсли;
		
		ТекСтавкаНДС = НайтиСтавкуНДС(VatValue);
		Если ТекСтавкаНДС = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Invalid VatValue of cash income order";
			
			Возврат РЕЗ;
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеВКассу);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПоступлениеВКассуДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеВКассу.ДополнительныеРеквизиты КАК ПоступлениеВКассуДополнительныеРеквизиты
	               |ГДЕ
	               |	ПоступлениеВКассуДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И ПоступлениеВКассуДополнительныеРеквизиты.Свойство = &ДопПараметр
	               |	И ПоступлениеВКассуДополнительныеРеквизиты.Ссылка.Касса = &Касса";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	Запрос.УстановитьПараметр("Касса", ТекКасса);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		// Создаём документ
		ТекДок = Документы.ПоступлениеВКассу.СоздатьДокумент();
		
		ТекДок.Дата = ДатаДокумента;
		ТекДок.УстановитьНовыйНомер();
		
		ТекДок.РасшифровкаПлатежа.Очистить();
		
		//Ищем документ-основание
		ДанныеЗаполнения = НЕОПРЕДЕЛЕНО;
		
		ЗапросДанныеЗаполнения = Новый Запрос;
		Если ЗначениеЗаполнено(РасходнаяНакладнаяRef) Тогда
			СтруктураДополнительныхРеквизитовДанныеЗаполнения = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
			ДопПараметрДанныеЗаполнения = СтруктураДополнительныхРеквизитовДанныеЗаполнения.DocRef;
			
			ЗапросДанныеЗаполнения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	РасходнаяНакладнаяДополнительныеРеквизиты.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная.ДополнительныеРеквизиты КАК РасходнаяНакладнаяДополнительныеРеквизиты
			|ГДЕ
			|	РасходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
			|	И РасходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
			
			ЗапросДанныеЗаполнения.УстановитьПараметр("ТекПараметр", РасходнаяНакладнаяRef);
			ЗапросДанныеЗаполнения.УстановитьПараметр("ДопПараметр", ДопПараметрДанныеЗаполнения);
			
			ДокОснованияRef = РасходнаяНакладнаяRef;
		ИначеЕсли ЗначениеЗаполнено(ОтчетОРозничныхПродажахRef) Тогда
			СтруктураДополнительныхРеквизитовДанныеЗаполнения = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОтчетОРозничныхПродажах);
			ДопПараметрДанныеЗаполнения = СтруктураДополнительныхРеквизитовДанныеЗаполнения.DocRef;
			
			ЗапросДанныеЗаполнения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Ссылка
			|ИЗ
			|	Документ.ОтчетОРозничныхПродажах.ДополнительныеРеквизиты КАК ОтчетОРозничныхПродажахДополнительныеРеквизиты
			|ГДЕ
			|	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Значение = &ТекПараметр
			|	И ОтчетОРозничныхПродажахДополнительныеРеквизиты.Свойство = &ДопПараметр";
			
			ЗапросДанныеЗаполнения.УстановитьПараметр("ТекПараметр", ОтчетОРозничныхПродажахRef);
			ЗапросДанныеЗаполнения.УстановитьПараметр("ДопПараметр", ДопПараметрДанныеЗаполнения);
			
			ДокОснованияRef = ОтчетОРозничныхПродажахRef;
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "A document base of cash income order not found";
			
			Возврат РЕЗ;
		КонецЕсли;
		
		ЗапросДанныеЗаполнения.Выполнить();
		РезультатЗапросаДанныеЗаполнения = ЗапросДанныеЗаполнения.Выполнить();
		ВыборкаДанныеЗаполнения = РезультатЗапросаДанныеЗаполнения.Выбрать();
		Пока ВыборкаДанныеЗаполнения.Следующий() Цикл
			ДанныеЗаполнения = ВыборкаДанныеЗаполнения.Ссылка;
			
			РасходнаяНакладнаяNumber = ДанныеЗаполнения.Номер;
		КонецЦикла;
		
		Если ДанныеЗаполнения = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "A document base of cash income order not found";
			
			Возврат РЕЗ;
		Иначе
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплату")] = "ЗаполнитьПоСчетуНаОплату";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПоступлениеДСПлан")] = "ЗаполнитьПоПоступлениюДСПлан";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеДСПлан")] = "ЗаполнитьПоПеремещениюДСПлан";
			СтратегияЗаполнения[Тип("ДокументСсылка.РасходнаяНакладная")] = "ЗаполнитьПоРасходнойНакладной";
			СтратегияЗаполнения[Тип("ДокументСсылка.ОтчетОРозничныхПродажах")] = "ЗаполнитьПоОтчетуОРозничныхПродажах";
			СтратегияЗаполнения[Тип("ДокументСсылка.АктВыполненныхРабот")] = "ЗаполнитьПоАктуВыполненныхРабот";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПередачаВА")] = "ЗаполнитьПоПередачеВА";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
			СтратегияЗаполнения[Тип("ДокументСсылка.ДоговорКредитаИЗайма")] = "ЗаполнитьПоДоговоруКредитаЗайма";
			СтратегияЗаполнения[Тип("ДокументСсылка.НачисленияПоКредитамИЗаймам")] = "ЗаполнитьПоНачисленияПоКредитамИЗаймам";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриемИПередачаВРемонт")] = "ЗаполнитьПоПриемуВРемонт";
			
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеДСПлан") Тогда
				ИсключаяСвойства = "Касса, АналитикаПрочихДоходовИРасходов";
			Иначе
				ИсключаяСвойства = "АналитикаПрочихДоходовИРасходов";
			КонецЕсли;
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, ДанныеЗаполнения, СтратегияЗаполнения, ИсключаяСвойства);
			
			Если ЗначениеЗаполнено(ТекДок.Контрагент.НаименованиеПолное) Тогда
				ТекДок.ПринятоОт = ТекДок.Контрагент.НаименованиеПолное;
			Иначе
				ТекДок.ПринятоОт = ТекДок.Контрагент.Наименование;
			КонецЕсли;
			
			ТекДок.НалогообложениеНДС = НЕОПРЕДЕЛЕНО;
			Если ЗначениеЗаполнено(ТекДок.Контрагент) Тогда
				ТекДок.НалогообложениеНДС = ТекДок.Контрагент.НалогообложениеНДС;
			ИначеЕсли ЗначениеЗаполнено(ТекНалогообложениеНДС) Тогда
				ТекДок.НалогообложениеНДС = ТекНалогообложениеНДС;
			Иначе
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Internal processing error";
				
				Возврат РЕЗ;
			КонецЕсли;
			
			ТекДок.ВалютаДенежныхСредств = ТекВалюта;
			ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДок.Дата, Новый Структура("Валюта", ТекДок.ВалютаДенежныхСредств));
			ТекДок.Курс      = ВалютаРасчетовКурсКратность.Курс;
			ТекДок.Кратность = ВалютаРасчетовКурсКратность.Кратность;
			
			ТекДок.Касса = ТекКасса;
			ТекДок.ПодписьКассира = ТекДок.Касса.ПодписьКассира;
			
			// Изменяем табличную часть
			МассивОшибок = Новый Массив();
			Если ТекДок.РасшифровкаПлатежа.Количество()>0 Тогда
				
				СтрокаТабличнойЧасти = ТекДок.РасшифровкаПлатежа[0];
				СтрокаТабличнойЧасти.Курс = ТекДок.Курс;
				СтрокаТабличнойЧасти.Кратность = ТекДок.Кратность;
				
				СтрокаТабличнойЧасти.СуммаПлатежа = Sum;
				СтрокаТабличнойЧасти.СуммаРасчетов = Sum;
				
				Если ТекСтавкаНДС = НЕОПРЕДЕЛЕНО Тогда
					ТекСтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
					СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаПлатежа - (СтрокаТабличнойЧасти.СуммаПлатежа) / ((ТекСтавкаНДС + 100) / 100);
				Иначе
					СтрокаТабличнойЧасти.СтавкаНДС = ТекСтавкаНДС;
					СтрокаТабличнойЧасти.СуммаНДС = ТекСуммаНДС;
				КонецЕсли;
				
				СписокДляУдаления = Новый СписокЗначений();
				Для каждого СтрРасшифровкаПлатежа Из ТекДок.РасшифровкаПлатежа Цикл
					Если НЕ СтрРасшифровкаПлатежа = СтрокаТабличнойЧасти Тогда
						СписокДляУдаления.Добавить(СтрРасшифровкаПлатежа);
					КонецЕсли; 
				КонецЦикла;
				
				Для каждого СтрСписокДляУдаления Из СписокДляУдаления Цикл
					ТекДок.РасшифровкаПлатежа.Удалить(СтрСписокДляУдаления.Значение);
				КонецЦикла;
				
			Иначе
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Incorrect tabular section";
				
				Возврат РЕЗ;
				
			КонецЕсли;
		КонецЕсли;
		
		ТекДок.СуммаДокумента = ТекДок.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
		ТекДок.Автор = НастройкиПоУмолчанию.Автор;
		ТекДок.Комментарий = Description;
		
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseRef,ДокОснованияRef);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseNumber,РасходнаяНакладнаяNumber);
		
		// Проводим
		ОписаниеУспешногоПроведения = "Doc cash income order created successfully";
		ЗаписыватьПриОшибках=ЛОЖЬ;
		ОписаниеДляМассиваОшибок="";
		ФиксироватьТранзакции=ЛОЖЬ;
		РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc cash income order already exist";		
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьПоступлениеВКассу(СтруктураДляВозврата,СоответствиеОбъекта,РасходнаяНакладнаяRef,ОтчетОРозничныхПродажахRef,ТекНалогообложениеНДС=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	CashDeskCode = СоответствиеОбъекта.Получить("CashDeskCode");
	CashDesk = СоответствиеОбъекта.Получить("CashDesk");
	Currency = СоответствиеОбъекта.Получить("Currency");
	Sum = СоответствиеОбъекта.Получить("Sum");
	VatValue = СоответствиеОбъекта.Получить("VatValue");
	VatSum = СоответствиеОбъекта.Получить("VatSum");
	Description = СоответствиеОбъекта.Получить("Description");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref of cash income order";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	// Ищем Кассу
	ТекКасса = НЕОПРЕДЕЛЕНО;
	Если НЕ CashDeskCode = НЕОПРЕДЕЛЕНО Тогда
		Если ТипЗНЧ(CashDeskCode)=Тип("Строка") Тогда
			ЗапросКасса = Новый Запрос;
			ЗапросКасса.Текст = 
			"ВЫБРАТЬ
			|	Кассы.Ссылка
			|ИЗ
			|	Справочник.Кассы КАК Кассы
			|ГДЕ
			|	Кассы.Код = &Код";
			
			ЗапросКасса.УстановитьПараметр("Код", СокрЛП(CashDeskCode));
			РезультатЗапросаКасса = ЗапросКасса.Выполнить();
			ВыборкаДетальныеЗаписиКасса = РезультатЗапросаКасса.Выбрать();
			Пока ВыборкаДетальныеЗаписиКасса.Следующий() Цикл
				ТекКасса = ВыборкаДетальныеЗаписиКасса.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ТекКасса = НЕОПРЕДЕЛЕНО Тогда
		Если НЕ CashDesk = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ = НайтиИлиСоздатьКассу(РЕЗ,CashDesk,ТекВалюта);
			Если НЕ РЕЗ.Результат Тогда
				Возврат РЕЗ;
			Иначе
				ТекКасса = РЕЗ.ВозвращаемоеЗначение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ТекКасса = НЕОПРЕДЕЛЕНО Тогда
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ?(CashDeskCode = НЕОПРЕДЕЛЕНО,Ref,CashDeskCode);
		РЕЗ.Описание = "CashDesk not found";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	Если ТипЗНЧ(Sum)=Тип("Строка") Тогда
		Если СтрНайти(НРЕГ(Sum),"null")=0 Тогда
			ТекСумма = Число(Sum);
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of cash income order";
		
			Возврат РЕЗ;
		КонецЕсли;
	ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
		ТекСумма = Sum;
		Если ТекСумма = 0 Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of cash income order";
			
			Возврат РЕЗ;
		КонецЕсли;
	Иначе
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect sum of cash income order";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекСуммаНДС = НЕОПРЕДЕЛЕНО;
	ТекСтавкаНДС = НЕОПРЕДЕЛЕНО;
	Если НЕ VatSum = НЕОПРЕДЕЛЕНО Тогда
		
		Если ТипЗНЧ(VatSum)=Тип("Строка") Тогда
			Если СтрНайти(НРЕГ(VatSum),"null")=0 Тогда
				ТекСуммаНДС = Число(VatSum);
			Иначе
				ТекСуммаНДС = 0;
			КонецЕсли;
		//ИначеЕсли ТипЗНЧ(VatSum)=Тип("Число") Тогда
		//	ТекСуммаНДС = VatSum;
		Иначе
			ТекСуммаНДС = VatSum;
		КонецЕсли;
		Если НЕ ТипЗНЧ(ТекСуммаНДС)=Тип("Число") Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Invalid VatSum of cash income order";
			
			Возврат РЕЗ;
		КонецЕсли;
		
		ТекСтавкаНДС = НайтиСтавкуНДС(VatValue);
		Если ТекСтавкаНДС = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Invalid VatValue of cash income order";
			
			Возврат РЕЗ;
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеВКассу);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПоступлениеВКассуДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеВКассу.ДополнительныеРеквизиты КАК ПоступлениеВКассуДополнительныеРеквизиты
	               |ГДЕ
	               |	ПоступлениеВКассуДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И ПоступлениеВКассуДополнительныеРеквизиты.Свойство = &ДопПараметр
	               |	И ПоступлениеВКассуДополнительныеРеквизиты.Ссылка.Касса = &Касса";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	Запрос.УстановитьПараметр("Касса", ТекКасса);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		НачатьТранзакцию();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КонецЦикла;
		
		// Убираем пометку удаления
		Попытка
			Если ТекДок.ПометкаУдаления Тогда
				ТекДок.Записать(РежимЗаписиДокумента.Запись);
				ТекДок.УстановитьПометкуУдаления(ЛОЖЬ);
			КонецЕсли;
		Исключение
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Internal processing error";
			
			Возврат РЕЗ;
		КонецПопытки;
		
		ТекДок.Дата = ДатаДокумента;
		
		ТекДок.РасшифровкаПлатежа.Очистить();
		
		//Ищем документ-основание
		ДанныеЗаполнения = НЕОПРЕДЕЛЕНО;
		
		ЗапросДанныеЗаполнения = Новый Запрос;
		Если ЗначениеЗаполнено(РасходнаяНакладнаяRef) Тогда
			СтруктураДополнительныхРеквизитовДанныеЗаполнения = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
			ДопПараметрДанныеЗаполнения = СтруктураДополнительныхРеквизитовДанныеЗаполнения.DocRef;
			
			ЗапросДанныеЗаполнения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	РасходнаяНакладнаяДополнительныеРеквизиты.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная.ДополнительныеРеквизиты КАК РасходнаяНакладнаяДополнительныеРеквизиты
			|ГДЕ
			|	РасходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
			|	И РасходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
			
			ЗапросДанныеЗаполнения.УстановитьПараметр("ТекПараметр", РасходнаяНакладнаяRef);
			ЗапросДанныеЗаполнения.УстановитьПараметр("ДопПараметр", ДопПараметрДанныеЗаполнения);
			
			ДокОснованияRef = РасходнаяНакладнаяRef;
		ИначеЕсли ЗначениеЗаполнено(ОтчетОРозничныхПродажахRef) Тогда
			СтруктураДополнительныхРеквизитовДанныеЗаполнения = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОтчетОРозничныхПродажах);
			ДопПараметрДанныеЗаполнения = СтруктураДополнительныхРеквизитовДанныеЗаполнения.DocRef;
			
			ЗапросДанныеЗаполнения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Ссылка
			|ИЗ
			|	Документ.ОтчетОРозничныхПродажах.ДополнительныеРеквизиты КАК ОтчетОРозничныхПродажахДополнительныеРеквизиты
			|ГДЕ
			|	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Значение = &ТекПараметр
			|	И ОтчетОРозничныхПродажахДополнительныеРеквизиты.Свойство = &ДопПараметр";
			
			ЗапросДанныеЗаполнения.УстановитьПараметр("ТекПараметр", ОтчетОРозничныхПродажахRef);
			ЗапросДанныеЗаполнения.УстановитьПараметр("ДопПараметр", ДопПараметрДанныеЗаполнения);
			
			ДокОснованияRef = ОтчетОРозничныхПродажахRef;
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "A document base of cash income order not found";
			
			Возврат РЕЗ;
		КонецЕсли;
		
		ЗапросДанныеЗаполнения.Выполнить();
		РезультатЗапросаДанныеЗаполнения = ЗапросДанныеЗаполнения.Выполнить();
		ВыборкаДанныеЗаполнения = РезультатЗапросаДанныеЗаполнения.Выбрать();
		Пока ВыборкаДанныеЗаполнения.Следующий() Цикл
			ДанныеЗаполнения = ВыборкаДанныеЗаполнения.Ссылка;
			
			РасходнаяНакладнаяNumber = ДанныеЗаполнения.Номер;
		КонецЦикла;
		
		Если ДанныеЗаполнения = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "A document base of cash income order not found";
			
			Возврат РЕЗ;
		Иначе
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплату")] = "ЗаполнитьПоСчетуНаОплату";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПоступлениеДСПлан")] = "ЗаполнитьПоПоступлениюДСПлан";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеДСПлан")] = "ЗаполнитьПоПеремещениюДСПлан";
			СтратегияЗаполнения[Тип("ДокументСсылка.РасходнаяНакладная")] = "ЗаполнитьПоРасходнойНакладной";
			СтратегияЗаполнения[Тип("ДокументСсылка.ОтчетОРозничныхПродажах")] = "ЗаполнитьПоОтчетуОРозничныхПродажах";
			СтратегияЗаполнения[Тип("ДокументСсылка.АктВыполненныхРабот")] = "ЗаполнитьПоАктуВыполненныхРабот";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПередачаВА")] = "ЗаполнитьПоПередачеВА";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
			СтратегияЗаполнения[Тип("ДокументСсылка.ДоговорКредитаИЗайма")] = "ЗаполнитьПоДоговоруКредитаЗайма";
			СтратегияЗаполнения[Тип("ДокументСсылка.НачисленияПоКредитамИЗаймам")] = "ЗаполнитьПоНачисленияПоКредитамИЗаймам";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриемИПередачаВРемонт")] = "ЗаполнитьПоПриемуВРемонт";
			
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеДСПлан") Тогда
				ИсключаяСвойства = "Касса, АналитикаПрочихДоходовИРасходов";
			Иначе
				ИсключаяСвойства = "АналитикаПрочихДоходовИРасходов";
			КонецЕсли;
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, ДанныеЗаполнения, СтратегияЗаполнения, ИсключаяСвойства);
			
			Если ЗначениеЗаполнено(ТекДок.Контрагент.НаименованиеПолное) Тогда
				ТекДок.ПринятоОт = ТекДок.Контрагент.НаименованиеПолное;
			Иначе
				ТекДок.ПринятоОт = ТекДок.Контрагент.Наименование;
			КонецЕсли;
			
			ТекДок.НалогообложениеНДС = НЕОПРЕДЕЛЕНО;
			Если ЗначениеЗаполнено(ТекДок.Контрагент) Тогда
				ТекДок.НалогообложениеНДС = ТекДок.Контрагент.НалогообложениеНДС;
			ИначеЕсли ЗначениеЗаполнено(ТекНалогообложениеНДС) Тогда
				ТекДок.НалогообложениеНДС = ТекНалогообложениеНДС;
			Иначе
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Internal processing error";
				
				Возврат РЕЗ;
			КонецЕсли;
			
			ТекДок.ВалютаДенежныхСредств = ТекВалюта;
			ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДок.Дата, Новый Структура("Валюта", ТекДок.ВалютаДенежныхСредств));
			ТекДок.Курс      = ВалютаРасчетовКурсКратность.Курс;
			ТекДок.Кратность = ВалютаРасчетовКурсКратность.Кратность;
			
			ТекДок.Касса = ТекКасса;
			ТекДок.ПодписьКассира = ТекДок.Касса.ПодписьКассира;
			
			// Изменяем табличную часть
			МассивОшибок = Новый Массив();
			Если ТекДок.РасшифровкаПлатежа.Количество()>0 Тогда
				
				СтрокаТабличнойЧасти = ТекДок.РасшифровкаПлатежа[0];
				СтрокаТабличнойЧасти.Курс = ТекДок.Курс;
				СтрокаТабличнойЧасти.Кратность = ТекДок.Кратность;
				
				СтрокаТабличнойЧасти.СуммаПлатежа = Sum;
				СтрокаТабличнойЧасти.СуммаРасчетов = Sum;
				
				Если ТекСтавкаНДС = НЕОПРЕДЕЛЕНО Тогда
					ТекСтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
					СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаПлатежа - (СтрокаТабличнойЧасти.СуммаПлатежа) / ((ТекСтавкаНДС + 100) / 100);
				Иначе
					СтрокаТабличнойЧасти.СтавкаНДС = ТекСтавкаНДС;
					СтрокаТабличнойЧасти.СуммаНДС = ТекСуммаНДС;
				КонецЕсли;
				
				СписокДляУдаления = Новый СписокЗначений();
				Для каждого СтрРасшифровкаПлатежа Из ТекДок.РасшифровкаПлатежа Цикл
					Если НЕ СтрРасшифровкаПлатежа = СтрокаТабличнойЧасти Тогда
						СписокДляУдаления.Добавить(СтрРасшифровкаПлатежа);
					КонецЕсли; 
				КонецЦикла;
				
				Для каждого СтрСписокДляУдаления Из СписокДляУдаления Цикл
					ТекДок.РасшифровкаПлатежа.Удалить(СтрСписокДляУдаления.Значение);
				КонецЦикла;
				
			Иначе
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Incorrect tabular section";
				
				Возврат РЕЗ;
				
			КонецЕсли;
		КонецЕсли;
		
		ТекДок.СуммаДокумента = ТекДок.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
		ТекДок.Автор = НастройкиПоУмолчанию.Автор;
		ТекДок.Комментарий = Description;
		
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseRef,ДокОснованияRef);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseNumber,РасходнаяНакладнаяNumber);
		
		// Проводим
		ОписаниеУспешногоПроведения = "Doc cash income order updated successfully";
		ЗаписыватьПриОшибках=ЛОЖЬ;
		ОписаниеДляМассиваОшибок="";
		ФиксироватьТранзакции=ИСТИНА;
		РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
		
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc cash income order not found";
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

//Функция УдалитьПоступлениеВКассу(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
//	ПЕРЕМ РЕЗ;
//	
//	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
//	
//	ЗначениеПараметра = СоответствиеОбъекта.Получить("Ref");
//	
//	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
//	
//		РЕЗ.Результат = ЛОЖЬ;
//		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
//		РЕЗ.Описание = "Incorrect ref cash income order";
//		
//		Возврат РЕЗ;
//	
//	КонецЕсли;
//	
//	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеВКассу);
//	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
//		
//	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
//	                      |	ПоступлениеВКассуДополнительныеРеквизиты.Ссылка
//	                      |ИЗ
//	                      |	Документ.ПоступлениеВКассу.ДополнительныеРеквизиты КАК ПоступлениеВКассуДополнительныеРеквизиты
//	                      |ГДЕ
//	                      |	ПоступлениеВКассуДополнительныеРеквизиты.Значение = &ТекПараметр
//	                      |	И ПоступлениеВКассуДополнительныеРеквизиты.Свойство = &ДопПараметр";
//	
//	СтрокаОтветаДляУдачногоРезультата = "Doc cash income order deleted successfully";
//	СтрокаОтветаОбъектНеНайден = "Doc cash income order not found";
//	
//	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден,ДопПараметр);
//	
//	Возврат РЕЗ;
//КонецФункции

Функция СоздатьИлиОбновитьПоступлениеВКассуИзРасходнойНакладной(СтруктураДляВозврата,СоответствиеОбъекта,Ref) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);

	РеквизитовПоступлениеВКассуRef = СоответствиеОбъекта.Получить("Ref");
	CashDeskCode = СоответствиеОбъекта.Получить("CashDeskCode");
	CashDesk = СоответствиеОбъекта.Получить("CashDesk");
	Currency = СоответствиеОбъекта.Получить("Currency");
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	// Ищем Кассу
	ТекКасса = НЕОПРЕДЕЛЕНО;
	Если НЕ CashDeskCode = НЕОПРЕДЕЛЕНО Тогда
		Если ТипЗНЧ(CashDeskCode)=Тип("Строка") Тогда
			ЗапросКасса = Новый Запрос;
			ЗапросКасса.Текст = 
			"ВЫБРАТЬ
			|	Кассы.Ссылка
			|ИЗ
			|	Справочник.Кассы КАК Кассы
			|ГДЕ
			|	Кассы.Код = &Код";
			
			ЗапросКасса.УстановитьПараметр("Код", СокрЛП(CashDeskCode));
			РезультатЗапросаКасса = ЗапросКасса.Выполнить();
			ВыборкаДетальныеЗаписиКасса = РезультатЗапросаКасса.Выбрать();
			Пока ВыборкаДетальныеЗаписиКасса.Следующий() Цикл
				ТекКасса = ВыборкаДетальныеЗаписиКасса.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ТекКасса = НЕОПРЕДЕЛЕНО Тогда
		Если НЕ CashDesk = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ = НайтиИлиСоздатьКассу(РЕЗ,CashDesk,ТекВалюта);
			Если НЕ РЕЗ.Результат Тогда
				Возврат РЕЗ;
			Иначе
				ТекКасса = РЕЗ.ВозвращаемоеЗначение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ТекКасса = НЕОПРЕДЕЛЕНО Тогда
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ?(CashDeskCode = НЕОПРЕДЕЛЕНО,Ref,CashDeskCode);
		РЕЗ.Описание = "CashDesk not found";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	СтруктураДополнительныхРеквизитовПоступлениеВКассу = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеВКассу);
	ДопПараметрПоступлениеВКассу = СтруктураДополнительныхРеквизитовПоступлениеВКассу.DocRef;
	
	ЗапросПоступлениеВКассу = Новый Запрос;
	ЗапросПоступлениеВКассу.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                                |	ПоступлениеВКассуДополнительныеРеквизиты.Ссылка
	                                |ИЗ
	                                |	Документ.ПоступлениеВКассу.ДополнительныеРеквизиты КАК ПоступлениеВКассуДополнительныеРеквизиты
	                                |ГДЕ
	                                |	ПоступлениеВКассуДополнительныеРеквизиты.Значение = &ТекПараметр
	                                |	И ПоступлениеВКассуДополнительныеРеквизиты.Свойство = &ДопПараметр
	                                |	И ПоступлениеВКассуДополнительныеРеквизиты.Ссылка.Касса = &Касса";
	
	ЗапросПоступлениеВКассу.УстановитьПараметр("ТекПараметр", РеквизитовПоступлениеВКассуRef);
	ЗапросПоступлениеВКассу.УстановитьПараметр("ДопПараметр", ДопПараметрПоступлениеВКассу);
	ЗапросПоступлениеВКассу.УстановитьПараметр("Касса", ТекКасса);
	РезультатЗапросаПоступлениеВКассу = ЗапросПоступлениеВКассу.Выполнить();
	Если РезультатЗапросаПоступлениеВКассу.Пустой() Тогда
		РЕЗ = СоздатьПоступлениеВКассу(РЕЗ,СоответствиеОбъекта,Ref,НЕОПРЕДЕЛЕНО);
	Иначе
		РЕЗ = ОбновитьПоступлениеВКассу(РЕЗ,СоответствиеОбъекта,Ref,НЕОПРЕДЕЛЕНО);
	КонецЕсли;	

	Возврат РЕЗ;
КонецФункции // ()
#КонецОбласти

#Область РасходИзКассы
Функция СоздатьРасходИзКассы(СтруктураДляВозврата,СоответствиеОбъекта,ПриходнаяНакладнаяRef,ТекНалогообложениеНДС=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	CashDeskCode = СоответствиеОбъекта.Получить("CashDeskCode");
	CashDesk = СоответствиеОбъекта.Получить("CashDesk");
	Currency = СоответствиеОбъекта.Получить("Currency");
	Sum = СоответствиеОбъекта.Получить("Sum");
	Description = СоответствиеОбъекта.Получить("Description");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref of cash expense order";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	// Ищем Кассу
	ТекКасса = НЕОПРЕДЕЛЕНО;
	Если НЕ CashDeskCode = НЕОПРЕДЕЛЕНО Тогда
		Если ТипЗНЧ(CashDeskCode)=Тип("Строка") Тогда
			ЗапросКасса = Новый Запрос;
			ЗапросКасса.Текст = 
			"ВЫБРАТЬ
			|	Кассы.Ссылка
			|ИЗ
			|	Справочник.Кассы КАК Кассы
			|ГДЕ
			|	Кассы.Код = &Код";
			
			ЗапросКасса.УстановитьПараметр("Код", СокрЛП(CashDeskCode));
			РезультатЗапросаКасса = ЗапросКасса.Выполнить();
			ВыборкаДетальныеЗаписиКасса = РезультатЗапросаКасса.Выбрать();
			Пока ВыборкаДетальныеЗаписиКасса.Следующий() Цикл
				ТекКасса = ВыборкаДетальныеЗаписиКасса.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ТекКасса = НЕОПРЕДЕЛЕНО Тогда
		Если НЕ CashDesk = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ = НайтиИлиСоздатьКассу(РЕЗ,CashDesk,ТекВалюта);
			Если НЕ РЕЗ.Результат Тогда
				Возврат РЕЗ;
			Иначе
				ТекКасса = РЕЗ.ВозвращаемоеЗначение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ТекКасса = НЕОПРЕДЕЛЕНО Тогда
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ?(CashDeskCode = НЕОПРЕДЕЛЕНО,Ref,CashDeskCode);
		РЕЗ.Описание = "CashDesk not found";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	Если ТипЗНЧ(Sum)=Тип("Строка") Тогда
		Если СтрНайти(НРЕГ(Sum),"null")=0 Тогда
			ТекСумма = Число(Sum);
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of cash expense order";
		
			Возврат РЕЗ;
		КонецЕсли;
	ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
		ТекСумма = Sum;
		Если ТекСумма = 0 Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of cash expense order";
			
			Возврат РЕЗ;
		КонецЕсли;
	Иначе
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect sum of cash expense order";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходИзКассы);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РасходИзКассыДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.РасходИзКассы.ДополнительныеРеквизиты КАК РасходИзКассыДополнительныеРеквизиты
	               |ГДЕ
	               |	РасходИзКассыДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И РасходИзКассыДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		// Создаём документ
		ТекДок = Документы.РасходИзКассы.СоздатьДокумент();
		
		ТекДок.Дата = ДатаДокумента;
		ТекДок.УстановитьНовыйНомер();
		
		ТекДок.РасшифровкаПлатежа.Очистить();
		
		//Ищем документ-основание
		ДанныеЗаполнения = НЕОПРЕДЕЛЕНО;
		
		ЗапросДанныеЗаполнения = Новый Запрос;
		Если ЗначениеЗаполнено(ПриходнаяНакладнаяRef) Тогда
			СтруктураДополнительныхРеквизитовДанныеЗаполнения = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная);
			ДопПараметрДанныеЗаполнения = СтруктураДополнительныхРеквизитовДанныеЗаполнения.DocRef;
			
			ЗапросДанныеЗаполнения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПриходнаяНакладнаяДополнительныеРеквизиты.Ссылка
			|ИЗ
			|	Документ.ПриходнаяНакладная.ДополнительныеРеквизиты КАК ПриходнаяНакладнаяДополнительныеРеквизиты
			|ГДЕ
			|	ПриходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
			|	И ПриходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
			
			ЗапросДанныеЗаполнения.УстановитьПараметр("ТекПараметр", ПриходнаяНакладнаяRef);
			ЗапросДанныеЗаполнения.УстановитьПараметр("ДопПараметр", ДопПараметрДанныеЗаполнения);
			
			ДокОснованияRef = ПриходнаяНакладнаяRef;
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "A document base of cash expense order not found";
			
			Возврат РЕЗ;
		КонецЕсли;
		
		ЗапросДанныеЗаполнения.Выполнить();
		РезультатЗапросаДанныеЗаполнения = ЗапросДанныеЗаполнения.Выполнить();
		ВыборкаДанныеЗаполнения = РезультатЗапросаДанныеЗаполнения.Выбрать();
		Пока ВыборкаДанныеЗаполнения.Следующий() Цикл
			ДанныеЗаполнения = ВыборкаДанныеЗаполнения.Ссылка;
			
			ПриходнаяНакладнаяNumber = ДанныеЗаполнения.Номер;
		КонецЦикла;
		
		Если ДанныеЗаполнения = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "A document base of cash expense order not found";
			
			Возврат РЕЗ;
		Иначе
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.РасходДСПлан")] = "ЗаполнитьПоРасходДСПлан";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеДСПлан")] = "ЗаполнитьПоПеремещениеДСПлан";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПриходнаяНакладная";
			СтратегияЗаполнения[Тип("ДокументСсылка.ДополнительныеРасходы")] = "ЗаполнитьПоДополнительныеРасходы";
			СтратегияЗаполнения[Тип("ДокументСсылка.ОтчетКомиссионера")] = "ЗаполнитьПоОтчетКомиссионера";
			СтратегияЗаполнения[Тип("ДокументСсылка.ОтчетКомитенту")] = "ЗаполнитьПоОтчетКомитенту";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПоставщику")] = "ЗаполнитьПоЗаказПоставщику";
			СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплатуПоставщика")] = "ЗаполнитьПоСчетНаОплатуПоставщика";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПлатежнаяВедомость")] = "ЗаполнитьПоПлатежнаяВедомость";
			СтратегияЗаполнения[Тип("ДокументСсылка.НачислениеНалогов")] = "ЗаполнитьПоНачислениеНалогов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ДоговорКредитаИЗайма")] = "ЗаполнитьПоДоговоруКредитаЗайма";
			СтратегияЗаполнения[Тип("ДокументСсылка.НачисленияПоКредитамИЗаймам")] = "ЗаполнитьПоНачисленияПоКредитамИЗаймам";
			СтратегияЗаполнения[Тип("ДокументСсылка.АвансовыйОтчет")] = "ЗаполнитьПоАвансовыйОтчет";
			
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеДСПлан") Тогда
				ИсключаяСвойства = "Касса, АналитикаПрочихДоходовИРасходов";
			Иначе
				ИсключаяСвойства = "АналитикаПрочихДоходовИРасходов";
			КонецЕсли;
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, ДанныеЗаполнения, СтратегияЗаполнения, ИсключаяСвойства);			
			
			Если ЗначениеЗаполнено(ТекДок.Контрагент.НаименованиеПолное) Тогда
				ТекДок.Выдать = ТекДок.Контрагент.НаименованиеПолное;
			Иначе
				ТекДок.Выдать = ТекДок.Контрагент.Наименование;
			КонецЕсли;
			
			ТекДок.НалогообложениеНДС = НЕОПРЕДЕЛЕНО;
			Если ЗначениеЗаполнено(ТекДок.Контрагент) Тогда
				ТекДок.НалогообложениеНДС = ТекДок.Контрагент.НалогообложениеНДС;
			ИначеЕсли ЗначениеЗаполнено(ТекНалогообложениеНДС) Тогда
				ТекДок.НалогообложениеНДС = ТекНалогообложениеНДС;
			Иначе
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Internal processing error";
				
				Возврат РЕЗ;
			КонецЕсли;
			
			ТекДок.ВалютаДенежныхСредств = ТекВалюта;
			ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДок.Дата, Новый Структура("Валюта", ТекДок.ВалютаДенежныхСредств));
			ТекКурс      = ВалютаРасчетовКурсКратность.Курс;
			ТекКратность = ВалютаРасчетовКурсКратность.Кратность;
			
			ТекДок.Касса = ТекКасса;
			
			// Изменяем табличную часть
			МассивОшибок = Новый Массив();
			Если ТекДок.РасшифровкаПлатежа.Количество()>0 Тогда
				
				СтрокаТабличнойЧасти = ТекДок.РасшифровкаПлатежа[0];
				СтрокаТабличнойЧасти.Курс = ТекКурс;
				СтрокаТабличнойЧасти.Кратность = ТекКратность;
				
				СтрокаТабличнойЧасти.СуммаПлатежа = Sum;
				СтрокаТабличнойЧасти.СуммаРасчетов = Sum;
				
				ТекСтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
				СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаПлатежа - (СтрокаТабличнойЧасти.СуммаПлатежа) / ((ТекСтавкаНДС + 100) / 100);
				
			Иначе
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Incorrect tabular section";
				
				Возврат РЕЗ;
				
			КонецЕсли;
		КонецЕсли;
		
		ТекДок.СуммаДокумента = ТекДок.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
		ТекДок.Автор = НастройкиПоУмолчанию.Автор;
		ТекДок.Комментарий = Description;
		
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseRef,ДокОснованияRef);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseNumber,ПриходнаяНакладнаяNumber);
		
		// Проводим
		ОписаниеУспешногоПроведения = "Doc cash expense order created successfully";
		ЗаписыватьПриОшибках=ЛОЖЬ;
		ОписаниеДляМассиваОшибок="";
		ФиксироватьТранзакции=ЛОЖЬ;
		РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc cash expense order already exist";		
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьРасходИзКассы(СтруктураДляВозврата,СоответствиеОбъекта,ПриходнаяНакладнаяRef,ТекНалогообложениеНДС=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	CashDeskCode = СоответствиеОбъекта.Получить("CashDeskCode");
	CashDesk = СоответствиеОбъекта.Получить("CashDesk");
	Currency = СоответствиеОбъекта.Получить("Currency");
	Sum = СоответствиеОбъекта.Получить("Sum");
	Description = СоответствиеОбъекта.Получить("Description");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref of cash expense order";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	// Ищем Кассу
	ТекКасса = НЕОПРЕДЕЛЕНО;
	Если НЕ CashDeskCode = НЕОПРЕДЕЛЕНО Тогда
		Если ТипЗНЧ(CashDeskCode)=Тип("Строка") Тогда
			ЗапросКасса = Новый Запрос;
			ЗапросКасса.Текст = 
			"ВЫБРАТЬ
			|	Кассы.Ссылка
			|ИЗ
			|	Справочник.Кассы КАК Кассы
			|ГДЕ
			|	Кассы.Код = &Код";
			
			ЗапросКасса.УстановитьПараметр("Код", СокрЛП(CashDeskCode));
			РезультатЗапросаКасса = ЗапросКасса.Выполнить();
			ВыборкаДетальныеЗаписиКасса = РезультатЗапросаКасса.Выбрать();
			Пока ВыборкаДетальныеЗаписиКасса.Следующий() Цикл
				ТекКасса = ВыборкаДетальныеЗаписиКасса.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ТекКасса = НЕОПРЕДЕЛЕНО Тогда
		Если НЕ CashDesk = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ = НайтиИлиСоздатьКассу(РЕЗ,CashDesk,ТекВалюта);
			Если НЕ РЕЗ.Результат Тогда
				Возврат РЕЗ;
			Иначе
				ТекКасса = РЕЗ.ВозвращаемоеЗначение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ТекКасса = НЕОПРЕДЕЛЕНО Тогда
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ?(CashDeskCode = НЕОПРЕДЕЛЕНО,Ref,CashDeskCode);
		РЕЗ.Описание = "CashDesk not found";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	Если ТипЗНЧ(Sum)=Тип("Строка") Тогда
		Если СтрНайти(НРЕГ(Sum),"null")=0 Тогда
			ТекСумма = Число(Sum);
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of cash expense order";
		
			Возврат РЕЗ;
		КонецЕсли;
	ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
		ТекСумма = Sum;
		Если ТекСумма = 0 Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of cash expense order";
			
			Возврат РЕЗ;
		КонецЕсли;
	Иначе
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect sum of cash expense order";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходИзКассы);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РасходИзКассыДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.РасходИзКассы.ДополнительныеРеквизиты КАК РасходИзКассыДополнительныеРеквизиты
	               |ГДЕ
	               |	РасходИзКассыДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И РасходИзКассыДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		НачатьТранзакцию();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КонецЦикла;
		
		// Убираем пометку удаления
		Попытка
			Если ТекДок.ПометкаУдаления Тогда
				ТекДок.Записать(РежимЗаписиДокумента.Запись);
				ТекДок.УстановитьПометкуУдаления(ЛОЖЬ);
			КонецЕсли;
		Исключение
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Internal processing error";
			
			Возврат РЕЗ;
		КонецПопытки;
		
		ТекДок.Дата = ДатаДокумента;
		
		ТекДок.РасшифровкаПлатежа.Очистить();
		
		//Ищем документ-основание
		ДанныеЗаполнения = НЕОПРЕДЕЛЕНО;
		
		ЗапросДанныеЗаполнения = Новый Запрос;
		Если ЗначениеЗаполнено(ПриходнаяНакладнаяRef) Тогда
			СтруктураДополнительныхРеквизитовДанныеЗаполнения = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная);
			ДопПараметрДанныеЗаполнения = СтруктураДополнительныхРеквизитовДанныеЗаполнения.DocRef;
			
			ЗапросДанныеЗаполнения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПриходнаяНакладнаяДополнительныеРеквизиты.Ссылка
			|ИЗ
			|	Документ.ПриходнаяНакладная.ДополнительныеРеквизиты КАК ПриходнаяНакладнаяДополнительныеРеквизиты
			|ГДЕ
			|	ПриходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
			|	И ПриходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
			
			ЗапросДанныеЗаполнения.УстановитьПараметр("ТекПараметр", ПриходнаяНакладнаяRef);
			ЗапросДанныеЗаполнения.УстановитьПараметр("ДопПараметр", ДопПараметрДанныеЗаполнения);
			
			ДокОснованияRef = ПриходнаяНакладнаяRef;
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "A document base of cash expense order not found";
			
			Возврат РЕЗ;
		КонецЕсли;
		
		ЗапросДанныеЗаполнения.Выполнить();
		РезультатЗапросаДанныеЗаполнения = ЗапросДанныеЗаполнения.Выполнить();
		ВыборкаДанныеЗаполнения = РезультатЗапросаДанныеЗаполнения.Выбрать();
		Пока ВыборкаДанныеЗаполнения.Следующий() Цикл
			ДанныеЗаполнения = ВыборкаДанныеЗаполнения.Ссылка;
			
			ПриходнаяНакладнаяNumber = ДанныеЗаполнения.Номер;
		КонецЦикла;
		
		Если ДанныеЗаполнения = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "A document base of cash expense order not found";
			
			Возврат РЕЗ;
		Иначе
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.РасходДСПлан")] = "ЗаполнитьПоРасходДСПлан";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеДСПлан")] = "ЗаполнитьПоПеремещениеДСПлан";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПриходнаяНакладная";
			СтратегияЗаполнения[Тип("ДокументСсылка.ДополнительныеРасходы")] = "ЗаполнитьПоДополнительныеРасходы";
			СтратегияЗаполнения[Тип("ДокументСсылка.ОтчетКомиссионера")] = "ЗаполнитьПоОтчетКомиссионера";
			СтратегияЗаполнения[Тип("ДокументСсылка.ОтчетКомитенту")] = "ЗаполнитьПоОтчетКомитенту";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПоставщику")] = "ЗаполнитьПоЗаказПоставщику";
			СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплатуПоставщика")] = "ЗаполнитьПоСчетНаОплатуПоставщика";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПлатежнаяВедомость")] = "ЗаполнитьПоПлатежнаяВедомость";
			СтратегияЗаполнения[Тип("ДокументСсылка.НачислениеНалогов")] = "ЗаполнитьПоНачислениеНалогов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ДоговорКредитаИЗайма")] = "ЗаполнитьПоДоговоруКредитаЗайма";
			СтратегияЗаполнения[Тип("ДокументСсылка.НачисленияПоКредитамИЗаймам")] = "ЗаполнитьПоНачисленияПоКредитамИЗаймам";
			СтратегияЗаполнения[Тип("ДокументСсылка.АвансовыйОтчет")] = "ЗаполнитьПоАвансовыйОтчет";
			
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеДСПлан") Тогда
				ИсключаяСвойства = "Касса, АналитикаПрочихДоходовИРасходов";
			Иначе
				ИсключаяСвойства = "АналитикаПрочихДоходовИРасходов";
			КонецЕсли;
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, ДанныеЗаполнения, СтратегияЗаполнения, ИсключаяСвойства);
			
			Если ЗначениеЗаполнено(ТекДок.Контрагент.НаименованиеПолное) Тогда
				ТекДок.Выдать = ТекДок.Контрагент.НаименованиеПолное;
			Иначе
				ТекДок.Выдать = ТекДок.Контрагент.Наименование;
			КонецЕсли;
			
			ТекДок.НалогообложениеНДС = НЕОПРЕДЕЛЕНО;
			Если ЗначениеЗаполнено(ТекДок.Контрагент) Тогда
				ТекДок.НалогообложениеНДС = ТекДок.Контрагент.НалогообложениеНДС;
			ИначеЕсли ЗначениеЗаполнено(ТекНалогообложениеНДС) Тогда
				ТекДок.НалогообложениеНДС = ТекНалогообложениеНДС;
			Иначе
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Internal processing error";
				
				Возврат РЕЗ;
			КонецЕсли;
			
			ТекДок.ВалютаДенежныхСредств = ТекВалюта;
			ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДок.Дата, Новый Структура("Валюта", ТекДок.ВалютаДенежныхСредств));
			ТекКурс      = ВалютаРасчетовКурсКратность.Курс;
			ТекКратность = ВалютаРасчетовКурсКратность.Кратность;
			
			ТекДок.Касса = ТекКасса;
			
			// Изменяем табличную часть
			МассивОшибок = Новый Массив();
			Если ТекДок.РасшифровкаПлатежа.Количество()>0 Тогда
				
				СтрокаТабличнойЧасти = ТекДок.РасшифровкаПлатежа[0];
				СтрокаТабличнойЧасти.Курс = ТекКурс;
				СтрокаТабличнойЧасти.Кратность = ТекКратность;
				
				СтрокаТабличнойЧасти.СуммаПлатежа = Sum;
				СтрокаТабличнойЧасти.СуммаРасчетов = Sum;
				
				ТекСтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
				СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаПлатежа - (СтрокаТабличнойЧасти.СуммаПлатежа) / ((ТекСтавкаНДС + 100) / 100);
				
			Иначе
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Incorrect tabular section";
				
				Возврат РЕЗ;
				
			КонецЕсли;
		КонецЕсли;
		
		ТекДок.СуммаДокумента = ТекДок.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
		ТекДок.Автор = НастройкиПоУмолчанию.Автор;
		ТекДок.Комментарий = Description;
		
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseRef,ДокОснованияRef);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseNumber,ПриходнаяНакладнаяNumber);
		
		// Проводим
		ОписаниеУспешногоПроведения = "Doc cash expense order updated successfully";
		ЗаписыватьПриОшибках=ЛОЖЬ;
		ОписаниеДляМассиваОшибок="";
		ФиксироватьТранзакции=ИСТИНА;
		РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
		
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc cash expense order not found";
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

//Функция УдалитьРасходИзКассы(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
//	ПЕРЕМ РЕЗ;
//	
//	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
//	
//	ЗначениеПараметра = СоответствиеОбъекта.Получить("Ref");
//	
//	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
//	
//		РЕЗ.Результат = ЛОЖЬ;
//		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
//		РЕЗ.Описание = "Incorrect ref cash expense order";
//		
//		Возврат РЕЗ;
//	
//	КонецЕсли;
//	
//	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходИзКассы);
//	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
//		
//	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
//	                      |	РасходИзКассыДополнительныеРеквизиты.Ссылка
//	                      |ИЗ
//	                      |	Документ.РасходИзКассы.ДополнительныеРеквизиты КАК РасходИзКассыДополнительныеРеквизиты
//	                      |ГДЕ
//	                      |	РасходИзКассыДополнительныеРеквизиты.Значение = &ТекПараметр
//	                      |	И РасходИзКассыДополнительныеРеквизиты.Свойство = &ДопПараметр";
//	
//	СтрокаОтветаДляУдачногоРезультата = "Doc cash expense order deleted successfully";
//	СтрокаОтветаОбъектНеНайден = "Doc cash expense order not found";
//	
//	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден,ДопПараметр);
//	
//	Возврат РЕЗ;
//КонецФункции

Функция СоздатьИлиОбновитьРасходИзКассыИзПриходнойНакладной(СтруктураДляВозврата,СоответствиеОбъекта,Ref) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);

	РеквизитовРасходИзКассыRef = СоответствиеОбъекта.Получить("Ref");
	
	СтруктураДополнительныхРеквизитовПоступлениеВКассу = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходИзКассы);
	ДопПараметрПоступлениеВКассу = СтруктураДополнительныхРеквизитовПоступлениеВКассу.DocRef;
	
	ЗапросПоступлениеВКассу = Новый Запрос;
	ЗапросПоступлениеВКассу.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                                |	РасходИзКассыДополнительныеРеквизиты.Ссылка
	                                |ИЗ
	                                |	Документ.РасходИзКассы.ДополнительныеРеквизиты КАК РасходИзКассыДополнительныеРеквизиты
	                                |ГДЕ
	                                |	РасходИзКассыДополнительныеРеквизиты.Значение = &ТекПараметр
	                                |	И РасходИзКассыДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ЗапросПоступлениеВКассу.УстановитьПараметр("ТекПараметр", РеквизитовРасходИзКассыRef);
	ЗапросПоступлениеВКассу.УстановитьПараметр("ДопПараметр", ДопПараметрПоступлениеВКассу);
	РезультатЗапросаПоступлениеВКассу = ЗапросПоступлениеВКассу.Выполнить();
	Если РезультатЗапросаПоступлениеВКассу.Пустой() Тогда
		РЕЗ = СоздатьРасходИзКассы(РЕЗ,СоответствиеОбъекта,Ref,НЕОПРЕДЕЛЕНО);
	Иначе
		РЕЗ = ОбновитьРасходИзКассы(РЕЗ,СоответствиеОбъекта,Ref,НЕОПРЕДЕЛЕНО);
	КонецЕсли;	

	Возврат РЕЗ;
КонецФункции // ()
#КонецОбласти

#Область ПоступлениеНаСчет
Функция СоздатьПоступлениеНаСчет(СтруктураДляВозврата,СоответствиеОбъекта,РасходнаяНакладнаяRef,ОтчетОРозничныхПродажахRef,ТекНалогообложениеНДС=НЕОПРЕДЕЛЕНО,ТекКонтрагент=НЕОПРЕДЕЛЕНО,ТекДоговор=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	Account = СоответствиеОбъекта.Получить("Account");
	Bank = СоответствиеОбъекта.Получить("Bank");
	Currency = СоответствиеОбъекта.Получить("Currency");
	Sum = СоответствиеОбъекта.Получить("Sum");
	VatValue = СоответствиеОбъекта.Получить("VatValue");
	VatSum = СоответствиеОбъекта.Получить("VatSum");
	Description = СоответствиеОбъекта.Получить("Description");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref of receiving money on account";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	ТекБанковскийСчет = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиИлиСоздатьБанковскийСчет(РЕЗ,Account,Bank,ТекВалюта);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекБанковскийСчет = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	Если ТипЗНЧ(Sum)=Тип("Строка") Тогда
		Если СтрНайти(НРЕГ(Sum),"null")=0 Тогда
			ТекСумма = Число(Sum);
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of receiving money on account";
		
			Возврат РЕЗ;
		КонецЕсли;
	ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
		ТекСумма = Sum;
		Если ТекСумма = 0 Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of receiving money on account";
			
			Возврат РЕЗ;
		КонецЕсли;
	Иначе
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect sum of receiving money on account";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекСуммаНДС = НЕОПРЕДЕЛЕНО;
	ТекСтавкаНДС = НЕОПРЕДЕЛЕНО;
	Если НЕ VatSum = НЕОПРЕДЕЛЕНО Тогда
		
		Если ТипЗНЧ(VatSum)=Тип("Строка") Тогда
			Если СтрНайти(НРЕГ(VatSum),"null")=0 Тогда
				ТекСуммаНДС = Число(VatSum);
			Иначе
				ТекСуммаНДС = 0;
			КонецЕсли;
		//ИначеЕсли ТипЗНЧ(VatSum)=Тип("Число") Тогда
		//	ТекСуммаНДС = VatSum;
		Иначе
			ТекСуммаНДС = VatSum;
		КонецЕсли;
		Если НЕ ТипЗНЧ(ТекСуммаНДС)=Тип("Число") Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Invalid VatSum of receiving money on account";
			
			Возврат РЕЗ;
		КонецЕсли;
		
		ТекСтавкаНДС = НайтиСтавкуНДС(VatValue);
		Если ТекСтавкаНДС = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Invalid VatValue of receiving money on account";
			
			Возврат РЕЗ;
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеНаСчет);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПоступлениеНаСчетДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеНаСчет.ДополнительныеРеквизиты КАК ПоступлениеНаСчетДополнительныеРеквизиты
	               |ГДЕ
	               |	ПоступлениеНаСчетДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И ПоступлениеНаСчетДополнительныеРеквизиты.Свойство = &ДопПараметр
	               |	И ПоступлениеНаСчетДополнительныеРеквизиты.Ссылка.БанковскийСчет = &БанковскийСчет";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	Запрос.УстановитьПараметр("БанковскийСчет", ТекБанковскийСчет);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		// Создаём документ
		ТекДок = Документы.ПоступлениеНаСчет.СоздатьДокумент();
		
		ТекДок.Дата = ДатаДокумента;
		ТекДок.УстановитьНовыйНомер();
		
		ТекДок.РасшифровкаПлатежа.Очистить();
		
		//Ищем документ-основание
		ДанныеЗаполнения = НЕОПРЕДЕЛЕНО;
		
		ЗапросДанныеЗаполнения = Новый Запрос;
		Если ЗначениеЗаполнено(РасходнаяНакладнаяRef) Тогда
			СтруктураДополнительныхРеквизитовДанныеЗаполнения = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
			ДопПараметрДанныеЗаполнения = СтруктураДополнительныхРеквизитовДанныеЗаполнения.DocRef;
			
			ЗапросДанныеЗаполнения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	РасходнаяНакладнаяДополнительныеРеквизиты.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная.ДополнительныеРеквизиты КАК РасходнаяНакладнаяДополнительныеРеквизиты
			|ГДЕ
			|	РасходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
			|	И РасходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
			
			ЗапросДанныеЗаполнения.УстановитьПараметр("ТекПараметр", РасходнаяНакладнаяRef);
			ЗапросДанныеЗаполнения.УстановитьПараметр("ДопПараметр", ДопПараметрДанныеЗаполнения);
			
			РасходнаяНакладнаяRef = РасходнаяНакладнаяRef;
		ИначеЕсли ЗначениеЗаполнено(ОтчетОРозничныхПродажахRef) Тогда
			СтруктураДополнительныхРеквизитовДанныеЗаполнения = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОтчетОРозничныхПродажах);
			ДопПараметрДанныеЗаполнения = СтруктураДополнительныхРеквизитовДанныеЗаполнения.DocRef;
			
			ЗапросДанныеЗаполнения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Ссылка
			|ИЗ
			|	Документ.ОтчетОРозничныхПродажах.ДополнительныеРеквизиты КАК ОтчетОРозничныхПродажахДополнительныеРеквизиты
			|ГДЕ
			|	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Значение = &ТекПараметр
			|	И ОтчетОРозничныхПродажахДополнительныеРеквизиты.Свойство = &ДопПараметр";
			
			ЗапросДанныеЗаполнения.УстановитьПараметр("ТекПараметр", ОтчетОРозничныхПродажахRef);
			ЗапросДанныеЗаполнения.УстановитьПараметр("ДопПараметр", ДопПараметрДанныеЗаполнения);
			
			РасходнаяНакладнаяRef = ОтчетОРозничныхПродажахRef;
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "A document base of receiving money on account not found";
			
			Возврат РЕЗ;
		КонецЕсли;
		
		ЗапросДанныеЗаполнения.Выполнить();
		РезультатЗапросаДанныеЗаполнения = ЗапросДанныеЗаполнения.Выполнить();
		ВыборкаДанныеЗаполнения = РезультатЗапросаДанныеЗаполнения.Выбрать();
		Пока ВыборкаДанныеЗаполнения.Следующий() Цикл
			ДанныеЗаполнения = ВыборкаДанныеЗаполнения.Ссылка;
			
			РасходнаяНакладнаяNumber = ДанныеЗаполнения.Номер;
		КонецЦикла;
		
		Если ДанныеЗаполнения = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "A document base of receiving money on account not found";
			
			Возврат РЕЗ;
		Иначе
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплату")] = "ЗаполнитьПоСчетуНаОплату";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПоступлениеДСПлан")] = "ЗаполнитьПоПоступлениюДСПлан";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеДСПлан")] = "ЗаполнитьПоПеремещениюДСПлан";
			СтратегияЗаполнения[Тип("ДокументСсылка.РасходнаяНакладная")] = "ЗаполнитьПоРасходнойНакладной";
			СтратегияЗаполнения[Тип("ДокументСсылка.АктВыполненныхРабот")] = "ЗаполнитьПоАктуВыполненныхРабот";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
			СтратегияЗаполнения[Тип("ДокументСсылка.НачислениеНалогов")] = "ЗаполнитьПоНачислениюНалогов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ДоговорКредитаИЗайма")] = "ЗаполнитьПоДоговоруКредитаИЗайма";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПередачаВА")] = "ЗаполнитьПоПередачеВА";
			СтратегияЗаполнения[Тип("ДокументСсылка.НачисленияПоКредитамИЗаймам")] = "ЗаполнитьПоНачисленияПоКредитамИЗаймам";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриемИПередачаВРемонт")] = "ЗаполнитьПоПриемуВРемонт";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, ДанныеЗаполнения, СтратегияЗаполнения, "АналитикаПрочихДоходовИРасходов");
			
			НалогообложениеНДС = НЕОПРЕДЕЛЕНО;
			Если ЗначениеЗаполнено(ТекДок.Контрагент) Тогда
				ТекДок.НалогообложениеНДС = ТекДок.Контрагент.НалогообложениеНДС;
			ИначеЕсли ЗначениеЗаполнено(ТекНалогообложениеНДС) Тогда
				ТекДок.НалогообложениеНДС = ТекНалогообложениеНДС;
			Иначе
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Internal processing error";
				
				Возврат РЕЗ;
			КонецЕсли;
			
			ТекДок.ВалютаДенежныхСредств = ТекВалюта;
			ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДок.Дата, Новый Структура("Валюта", ТекДок.ВалютаДенежныхСредств));
			ТекДок.Курс      = ВалютаРасчетовКурсКратность.Курс;
			ТекДок.Кратность = ВалютаРасчетовКурсКратность.Кратность;
			
			ТекДок.БанковскийСчет = ТекБанковскийСчет;
			
			// Изменяем табличную часть
			МассивОшибок = Новый Массив();
			Если ТекДок.РасшифровкаПлатежа.Количество()>0 Тогда
				
				СтрокаТабличнойЧасти = ТекДок.РасшифровкаПлатежа[0];
				СтрокаТабличнойЧасти.Курс = ТекДок.Курс;
				СтрокаТабличнойЧасти.Кратность = ТекДок.Кратность;
				
				СтрокаТабличнойЧасти.СуммаПлатежа = Sum;
				СтрокаТабличнойЧасти.СуммаРасчетов = Sum;
				
				Если ТекСтавкаНДС = НЕОПРЕДЕЛЕНО Тогда
					ТекСтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
					СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаПлатежа - (СтрокаТабличнойЧасти.СуммаПлатежа) / ((ТекСтавкаНДС + 100) / 100);
				Иначе
					СтрокаТабличнойЧасти.СтавкаНДС = ТекСтавкаНДС;
					СтрокаТабличнойЧасти.СуммаНДС = ТекСуммаНДС;
				КонецЕсли;
				
				СписокДляУдаления = Новый СписокЗначений();
				Для каждого СтрРасшифровкаПлатежа Из ТекДок.РасшифровкаПлатежа Цикл
					Если НЕ СтрРасшифровкаПлатежа = СтрокаТабличнойЧасти Тогда
						СписокДляУдаления.Добавить(СтрРасшифровкаПлатежа);
					КонецЕсли; 
				КонецЦикла;
				
				Для каждого СтрСписокДляУдаления Из СписокДляУдаления Цикл
					ТекДок.РасшифровкаПлатежа.Удалить(СтрСписокДляУдаления.Значение);
				КонецЦикла;
				
			Иначе
				
				//РЕЗ.Результат = ЛОЖЬ;
				//РЕЗ.ВозвращаемоеЗначение = Ref;
				//РЕЗ.Описание = "Incorrect tabular section";
				//
				//Возврат РЕЗ;
				
				Если ЗначениеЗаполнено(ТекКонтрагент) И ЗначениеЗаполнено(ТекДоговор) Тогда
					ТекДок.Контрагент = ТекКонтрагент;
					ТекДок.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя;
					
					СтрокаТабличнойЧасти = ТекДок.РасшифровкаПлатежа.Добавить();
					СтрокаТабличнойЧасти.Договор = ТекДоговор;
					
					СтрокаТабличнойЧасти.СтатьяДДС = ?(ТипЗнч(ТекДоговор) = Тип("СправочникСсылка.ДоговорыКонтрагентов"),ТекДоговор.СтатьяДДСПоУмолчанию,Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
					
					СтрокаТабличнойЧасти.Курс = ТекДок.Курс;
					СтрокаТабличнойЧасти.Кратность = ТекДок.Кратность;
					
					СтрокаТабличнойЧасти.СуммаПлатежа = Sum;
					СтрокаТабличнойЧасти.СуммаРасчетов = Sum;
					
					Если ТекСтавкаНДС = НЕОПРЕДЕЛЕНО Тогда
						Если ТекДок.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда 
							СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
						ИначеЕсли ТекДок.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
							СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.НДС18;
						Иначе 
							СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.НДС0;
						КонецЕсли;
						
						ТекСтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
						СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаПлатежа - (СтрокаТабличнойЧасти.СуммаПлатежа) / ((ТекСтавкаНДС + 100) / 100);
					Иначе
						СтрокаТабличнойЧасти.СтавкаНДС = ТекСтавкаНДС;
						СтрокаТабличнойЧасти.СуммаНДС = ТекСуммаНДС;
					КонецЕсли;
				Иначе
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Возврат РЕЗ;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		ТекДок.СуммаДокумента = ТекДок.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
		ТекДок.Автор = НастройкиПоУмолчанию.Автор;
		ТекДок.Комментарий = Description;
		
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseRef,РасходнаяНакладнаяRef);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseNumber,РасходнаяНакладнаяNumber);
		
		// Проводим
		ОписаниеУспешногоПроведения = "Doc receiving money on account created successfully";
		ЗаписыватьПриОшибках=ЛОЖЬ;
		ОписаниеДляМассиваОшибок="";
		ФиксироватьТранзакции=ЛОЖЬ;
		РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
			
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc receiving money on account already exist";		
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьПоступлениеНаСчет(СтруктураДляВозврата,СоответствиеОбъекта,РасходнаяНакладнаяRef,ОтчетОРозничныхПродажахRef,ТекНалогообложениеНДС=НЕОПРЕДЕЛЕНО,ТекКонтрагент=НЕОПРЕДЕЛЕНО,ТекДоговор=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	Account = СоответствиеОбъекта.Получить("Account");
	Bank = СоответствиеОбъекта.Получить("Bank");
	Currency = СоответствиеОбъекта.Получить("Currency");
	Sum = СоответствиеОбъекта.Получить("Sum");
	VatValue = СоответствиеОбъекта.Получить("VatValue");
	VatSum = СоответствиеОбъекта.Получить("VatSum");
	Description = СоответствиеОбъекта.Получить("Description");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref of receiving money on account";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	ТекБанковскийСчет = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиИлиСоздатьБанковскийСчет(РЕЗ,Account,Bank,ТекВалюта);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекБанковскийСчет = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	Если ТипЗНЧ(Sum)=Тип("Строка") Тогда
		Если СтрНайти(НРЕГ(Sum),"null")=0 Тогда
			ТекСумма = Число(Sum);
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of receiving money on account";
		
			Возврат РЕЗ;
		КонецЕсли;
	ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
		ТекСумма = Sum;
		Если ТекСумма = 0 Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of receiving money on account";
			
			Возврат РЕЗ;
		КонецЕсли;
	Иначе
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect sum of receiving money on account";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекСуммаНДС = НЕОПРЕДЕЛЕНО;
	ТекСтавкаНДС = НЕОПРЕДЕЛЕНО;
	Если НЕ VatSum = НЕОПРЕДЕЛЕНО Тогда
		
		Если ТипЗНЧ(VatSum)=Тип("Строка") Тогда
			Если СтрНайти(НРЕГ(VatSum),"null")=0 Тогда
				ТекСуммаНДС = Число(VatSum);
			Иначе
				ТекСуммаНДС = 0;
			КонецЕсли;
		//ИначеЕсли ТипЗНЧ(VatSum)=Тип("Число") Тогда
		//	ТекСуммаНДС = VatSum;
		Иначе
			ТекСуммаНДС = VatSum;
		КонецЕсли;
		Если НЕ ТипЗНЧ(ТекСуммаНДС)=Тип("Число") Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Invalid VatSum of receiving money on account";
			
			Возврат РЕЗ;
		КонецЕсли;
		
		ТекСтавкаНДС = НайтиСтавкуНДС(VatValue);
		Если ТекСтавкаНДС = НЕОПРЕДЕЛЕНО Тогда
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Invalid VatValue of receiving money on account";
			
			Возврат РЕЗ;
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеНаСчет);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПоступлениеНаСчетДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеНаСчет.ДополнительныеРеквизиты КАК ПоступлениеНаСчетДополнительныеРеквизиты
	               |ГДЕ
	               |	ПоступлениеНаСчетДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И ПоступлениеНаСчетДополнительныеРеквизиты.Свойство = &ДопПараметр
	               |	И ПоступлениеНаСчетДополнительныеРеквизиты.Ссылка.БанковскийСчет = &БанковскийСчет";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	Запрос.УстановитьПараметр("БанковскийСчет", ТекБанковскийСчет);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		НачатьТранзакцию();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КонецЦикла;
		
		// Убираем пометку удаления
		Попытка
			Если ТекДок.ПометкаУдаления Тогда
				ТекДок.Записать(РежимЗаписиДокумента.Запись);
				ТекДок.УстановитьПометкуУдаления(ЛОЖЬ);
			КонецЕсли;
		Исключение
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Internal processing error";
			
			Возврат РЕЗ;
		КонецПопытки;
		
		ТекДок.Дата = ДатаДокумента;
		
		ТекДок.РасшифровкаПлатежа.Очистить();
		
		//Ищем документ-основание
		ДанныеЗаполнения = НЕОПРЕДЕЛЕНО;
		
		ЗапросДанныеЗаполнения = Новый Запрос;
		Если ЗначениеЗаполнено(РасходнаяНакладнаяRef) Тогда
			СтруктураДополнительныхРеквизитовДанныеЗаполнения = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
			ДопПараметрДанныеЗаполнения = СтруктураДополнительныхРеквизитовДанныеЗаполнения.DocRef;
			
			ЗапросДанныеЗаполнения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	РасходнаяНакладнаяДополнительныеРеквизиты.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная.ДополнительныеРеквизиты КАК РасходнаяНакладнаяДополнительныеРеквизиты
			|ГДЕ
			|	РасходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
			|	И РасходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
			
			ЗапросДанныеЗаполнения.УстановитьПараметр("ТекПараметр", РасходнаяНакладнаяRef);
			ЗапросДанныеЗаполнения.УстановитьПараметр("ДопПараметр", ДопПараметрДанныеЗаполнения);
			
			РасходнаяНакладнаяRef = РасходнаяНакладнаяRef;
		ИначеЕсли ЗначениеЗаполнено(ОтчетОРозничныхПродажахRef) Тогда
			СтруктураДополнительныхРеквизитовДанныеЗаполнения = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОтчетОРозничныхПродажах);
			ДопПараметрДанныеЗаполнения = СтруктураДополнительныхРеквизитовДанныеЗаполнения.DocRef;
			
			ЗапросДанныеЗаполнения.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Ссылка
			|ИЗ
			|	Документ.ОтчетОРозничныхПродажах.ДополнительныеРеквизиты КАК ОтчетОРозничныхПродажахДополнительныеРеквизиты
			|ГДЕ
			|	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Значение = &ТекПараметр
			|	И ОтчетОРозничныхПродажахДополнительныеРеквизиты.Свойство = &ДопПараметр";
			
			ЗапросДанныеЗаполнения.УстановитьПараметр("ТекПараметр", ОтчетОРозничныхПродажахRef);
			ЗапросДанныеЗаполнения.УстановитьПараметр("ДопПараметр", ДопПараметрДанныеЗаполнения);
			
			РасходнаяНакладнаяRef = ОтчетОРозничныхПродажахRef;
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "A document base of receiving money on account not found";
			
			Возврат РЕЗ;
		КонецЕсли;
		
		ЗапросДанныеЗаполнения.Выполнить();
		РезультатЗапросаДанныеЗаполнения = ЗапросДанныеЗаполнения.Выполнить();
		ВыборкаДанныеЗаполнения = РезультатЗапросаДанныеЗаполнения.Выбрать();
		Пока ВыборкаДанныеЗаполнения.Следующий() Цикл
			ДанныеЗаполнения = ВыборкаДанныеЗаполнения.Ссылка;
			
			РасходнаяНакладнаяNumber = ДанныеЗаполнения.Номер;
		КонецЦикла;
		
		Если ДанныеЗаполнения = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "A document base of receiving money on account not found";
			
			Возврат РЕЗ;
		Иначе
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплату")] = "ЗаполнитьПоСчетуНаОплату";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПоступлениеДСПлан")] = "ЗаполнитьПоПоступлениюДСПлан";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеДСПлан")] = "ЗаполнитьПоПеремещениюДСПлан";
			СтратегияЗаполнения[Тип("ДокументСсылка.РасходнаяНакладная")] = "ЗаполнитьПоРасходнойНакладной";
			СтратегияЗаполнения[Тип("ДокументСсылка.АктВыполненныхРабот")] = "ЗаполнитьПоАктуВыполненныхРабот";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
			СтратегияЗаполнения[Тип("ДокументСсылка.НачислениеНалогов")] = "ЗаполнитьПоНачислениюНалогов";
			СтратегияЗаполнения[Тип("ДокументСсылка.ДоговорКредитаИЗайма")] = "ЗаполнитьПоДоговоруКредитаИЗайма";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПередачаВА")] = "ЗаполнитьПоПередачеВА";
			СтратегияЗаполнения[Тип("ДокументСсылка.НачисленияПоКредитамИЗаймам")] = "ЗаполнитьПоНачисленияПоКредитамИЗаймам";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриемИПередачаВРемонт")] = "ЗаполнитьПоПриемуВРемонт";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, ДанныеЗаполнения, СтратегияЗаполнения, "АналитикаПрочихДоходовИРасходов");
			
			НалогообложениеНДС = НЕОПРЕДЕЛЕНО;
			Если ЗначениеЗаполнено(ТекДок.Контрагент) Тогда
				ТекДок.НалогообложениеНДС = ТекДок.Контрагент.НалогообложениеНДС;
			ИначеЕсли ЗначениеЗаполнено(ТекНалогообложениеНДС) Тогда
				ТекДок.НалогообложениеНДС = ТекНалогообложениеНДС;
			Иначе
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = Ref;
				РЕЗ.Описание = "Internal processing error";
				
				Возврат РЕЗ;
			КонецЕсли;
			
			ТекДок.ВалютаДенежныхСредств = ТекВалюта;
			ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДок.Дата, Новый Структура("Валюта", ТекДок.ВалютаДенежныхСредств));
			ТекДок.Курс      = ВалютаРасчетовКурсКратность.Курс;
			ТекДок.Кратность = ВалютаРасчетовКурсКратность.Кратность;
			
			ТекДок.БанковскийСчет = ТекБанковскийСчет;
			
			// Изменяем табличную часть
			МассивОшибок = Новый Массив();
			Если ТекДок.РасшифровкаПлатежа.Количество()>0 Тогда
				
				СтрокаТабличнойЧасти = ТекДок.РасшифровкаПлатежа[0];
				СтрокаТабличнойЧасти.Курс = ТекДок.Курс;
				СтрокаТабличнойЧасти.Кратность = ТекДок.Кратность;
				
				СтрокаТабличнойЧасти.СуммаПлатежа = Sum;
				СтрокаТабличнойЧасти.СуммаРасчетов = Sum;
				
				Если ТекСтавкаНДС = НЕОПРЕДЕЛЕНО Тогда
					ТекСтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
					СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаПлатежа - (СтрокаТабличнойЧасти.СуммаПлатежа) / ((ТекСтавкаНДС + 100) / 100);
				Иначе
					СтрокаТабличнойЧасти.СтавкаНДС = ТекСтавкаНДС;
					СтрокаТабличнойЧасти.СуммаНДС = ТекСуммаНДС;
				КонецЕсли;
				
				СписокДляУдаления = Новый СписокЗначений();
				Для каждого СтрРасшифровкаПлатежа Из ТекДок.РасшифровкаПлатежа Цикл
					Если НЕ СтрРасшифровкаПлатежа = СтрокаТабличнойЧасти Тогда
						СписокДляУдаления.Добавить(СтрРасшифровкаПлатежа);
					КонецЕсли; 
				КонецЦикла;
				
				Для каждого СтрСписокДляУдаления Из СписокДляУдаления Цикл
					ТекДок.РасшифровкаПлатежа.Удалить(СтрСписокДляУдаления.Значение);
				КонецЦикла;
				
			Иначе
				
				//РЕЗ.Результат = ЛОЖЬ;
				//РЕЗ.ВозвращаемоеЗначение = Ref;
				//РЕЗ.Описание = "Incorrect tabular section";
				//
				//Возврат РЕЗ;
				
				Если ЗначениеЗаполнено(ТекКонтрагент) И ЗначениеЗаполнено(ТекДоговор) Тогда
					ТекДок.Контрагент = ТекКонтрагент;
					ТекДок.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя;
					
					ТекДок.Статья = НастройкиПоУмолчанию.СтатьяКассаККМ;
					
					СтрокаТабличнойЧасти = ТекДок.РасшифровкаПлатежа.Добавить();
					СтрокаТабличнойЧасти.Договор = ТекДоговор;
					
					СтрокаТабличнойЧасти.СтатьяДДС = ?(ТипЗнч(ТекДоговор) = Тип("СправочникСсылка.ДоговорыКонтрагентов"),ТекДоговор.СтатьяДДСПоУмолчанию,Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
					
					СтрокаТабличнойЧасти.Курс = ТекДок.Курс;
					СтрокаТабличнойЧасти.Кратность = ТекДок.Кратность;
					
					СтрокаТабличнойЧасти.СуммаПлатежа = Sum;
					СтрокаТабличнойЧасти.СуммаРасчетов = Sum;
					
					Если ТекСтавкаНДС = НЕОПРЕДЕЛЕНО Тогда
						Если ТекДок.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда 
							СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
						ИначеЕсли ТекДок.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
							СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.НДС18;
						Иначе 
							СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.НДС0;
						КонецЕсли;
						
						ТекСтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
						СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаПлатежа - (СтрокаТабличнойЧасти.СуммаПлатежа) / ((ТекСтавкаНДС + 100) / 100);
					Иначе
						СтрокаТабличнойЧасти.СтавкаНДС = ТекСтавкаНДС;
						СтрокаТабличнойЧасти.СуммаНДС = ТекСуммаНДС;
					КонецЕсли;
				Иначе
					РЕЗ.Результат = ЛОЖЬ;
					РЕЗ.ВозвращаемоеЗначение = Ref;
					РЕЗ.Описание = "Incorrect tabular section";
					
					Возврат РЕЗ;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		ТекДок.СуммаДокумента = ТекДок.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
		ТекДок.Автор = НастройкиПоУмолчанию.Автор;
		ТекДок.Комментарий = Description;
		
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseRef,РасходнаяНакладнаяRef);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.BaseNumber,РасходнаяНакладнаяNumber);
		
		// Проводим
		ОписаниеУспешногоПроведения = "Doc receiving money on account updated successfully";
		ЗаписыватьПриОшибках=ЛОЖЬ;
		ОписаниеДляМассиваОшибок="";
		ФиксироватьТранзакции=ИСТИНА;
		РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
		
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc receiving money on account not found";
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

//Функция УдалитьПоступлениеНаСчет(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
//	ПЕРЕМ РЕЗ;
//	
//	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
//	
//	ЗначениеПараметра = СоответствиеОбъекта.Получить("Ref");
//	
//	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
//	
//		РЕЗ.Результат = ЛОЖЬ;
//		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
//		РЕЗ.Описание = "Incorrect ref receiving money on account";
//		
//		Возврат РЕЗ;
//	
//	КонецЕсли;
//	
//	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеНаСчет);
//	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
//		
//	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
//	                      |	ПоступлениеНаСчетДополнительныеРеквизиты.Ссылка
//	                      |ИЗ
//	                      |	Документ.ПоступлениеНаСчет.ДополнительныеРеквизиты КАК ПоступлениеНаСчетДополнительныеРеквизиты
//	                      |ГДЕ
//	                      |	ПоступлениеНаСчетДополнительныеРеквизиты.Значение = &ТекПараметр
//	                      |	И ПоступлениеНаСчетДополнительныеРеквизиты.Свойство = &ДопПараметр";
//	
//	СтрокаОтветаДляУдачногоРезультата = "Doc receiving money on account deleted successfully";
//	СтрокаОтветаОбъектНеНайден = "Doc receiving money on account not found";
//	
//	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден,ДопПараметр);
//	
//	Возврат РЕЗ;
//КонецФункции

Функция СоздатьИлиОбновитьПоступлениеНаСчетИзРасходнойНакладной(СтруктураДляВозврата,СоответствиеОбъекта,Ref) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);

	РеквизитовПоступлениеНаСчетRef = СоответствиеОбъекта.Получить("Ref");
	Currency = СоответствиеОбъекта.Получить("Currency");
	Account = СоответствиеОбъекта.Получить("Account");
	Bank = СоответствиеОбъекта.Получить("Bank");
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	ТекБанковскийСчет = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиИлиСоздатьБанковскийСчет(РЕЗ,Account,Bank,ТекВалюта);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекБанковскийСчет = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	СтруктураДополнительныхРеквизитовПоступлениеНаСчет = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеНаСчет);
	ДопПараметрПоступлениеНаСчет = СтруктураДополнительныхРеквизитовПоступлениеНаСчет.DocRef;
	
	ЗапросПоступлениеНаСчет = Новый Запрос;
	ЗапросПоступлениеНаСчет.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                                |	ПоступлениеНаСчетДополнительныеРеквизиты.Ссылка
	                                |ИЗ
	                                |	Документ.ПоступлениеНаСчет.ДополнительныеРеквизиты КАК ПоступлениеНаСчетДополнительныеРеквизиты
	                                |ГДЕ
	                                |	ПоступлениеНаСчетДополнительныеРеквизиты.Значение = &ТекПараметр
	                                |	И ПоступлениеНаСчетДополнительныеРеквизиты.Свойство = &ДопПараметр
	                                |	И ПоступлениеНаСчетДополнительныеРеквизиты.Ссылка.БанковскийСчет = &БанковскийСчет";
	
	ЗапросПоступлениеНаСчет.УстановитьПараметр("ТекПараметр", РеквизитовПоступлениеНаСчетRef);
	ЗапросПоступлениеНаСчет.УстановитьПараметр("ДопПараметр", ДопПараметрПоступлениеНаСчет);
	ЗапросПоступлениеНаСчет.УстановитьПараметр("БанковскийСчет", ТекБанковскийСчет);
	РезультатЗапросаПоступлениеНаСчет = ЗапросПоступлениеНаСчет.Выполнить();
	Если РезультатЗапросаПоступлениеНаСчет.Пустой() Тогда
		РЕЗ = СоздатьПоступлениеНаСчет(РЕЗ,СоответствиеОбъекта,Ref,НЕОПРЕДЕЛЕНО);
	Иначе
		РЕЗ = ОбновитьПоступлениеНаСчет(РЕЗ,СоответствиеОбъекта,Ref,НЕОПРЕДЕЛЕНО);
	КонецЕсли;	

	Возврат РЕЗ;
КонецФункции // ()
#КонецОбласти

#Область Сотрудники
Функция ПолучитьМассивСотрудников() ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиСрезПоследних.Регистратор,
		|	СотрудникиСрезПоследних.Сотрудник.Код КАК КодСотрудника,
		|	СотрудникиСрезПоследних.Сотрудник.Наименование КАК ИмяСотрудника,
		|	СотрудникиСрезПоследних.СтруктурнаяЕдиница.Код КАК КодПодразделения,
		|	СотрудникиСрезПоследних.СтруктурнаяЕдиница.Наименование КАК НаименованиеПодразделения,
		|	СотрудникиСрезПоследних.Должность.Наименование КАК Должность,
		|	СотрудникиСрезПоследних.Сотрудник.НаименованиеНаИностранскомЯзыке КАК НаименованиеНаИностранскомЯзыке,
		|	СотрудникиСрезПоследних.Сотрудник.Физлицо.ИНН КАК ИНН,
		|	ВладелецКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	СотрудникиСрезПервых.Период КАК ДатаПриемаНаРаботу
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних КАК СотрудникиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ВладелецКонтактнаяИнформация
		|		ПО (ВладелецКонтактнаяИнформация.Ссылка = СотрудникиСрезПоследних.Сотрудник.Физлицо)
		|			И (ВладелецКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛица))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПервых КАК СотрудникиСрезПервых
		|		ПО СотрудникиСрезПоследних.Сотрудник = СотрудникиСрезПервых.Сотрудник
		|			И (СотрудникиСрезПервых.Регистратор ССЫЛКА Документ.ПриемНаРаботу)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураДанных = Новый Структура("Active,DateWorkBegin,Position,Phone",ИСТИНА,Формат(ВыборкаДетальныеЗаписи.ДатаПриемаНаРаботу,"ДФ=dd.MM.yyyy"),СокрЛП(Строка(ВыборкаДетальныеЗаписи.Должность)),СокрЛП(Строка(ВыборкаДетальныеЗаписи.НомерТелефона)));
		
		Если ТипЗНЧ(ВыборкаДетальныеЗаписи.Регистратор)=Тип("ДокументСсылка.Увольнение") Тогда
			СтруктураДанных.Active = ЛОЖЬ;
		КонецЕсли;
		
		СтрукутраСотрудника = Новый Структура("Code,TIN,Name,NameEN",СокрЛП(Строка(ВыборкаДетальныеЗаписи.КодСотрудника)),СокрЛП(Строка(ВыборкаДетальныеЗаписи.ИНН)),СокрЛП(Строка(ВыборкаДетальныеЗаписи.ИмяСотрудника)),СокрЛП(Строка(ВыборкаДетальныеЗаписи.НаименованиеНаИностранскомЯзыке)));
		СтруктураДанных.Вставить("Employee",СтрукутраСотрудника);
		
		СтруктураПодразделения = Новый Структура("Code,Description",СокрЛП(Строка(ВыборкаДетальныеЗаписи.КодПодразделения)),СокрЛП(Строка(ВыборкаДетальныеЗаписи.НаименованиеПодразделения)));
		СтруктураДанных.Вставить("Subdivision",СтруктураПодразделения);
		
		РЕЗ.Добавить(СтруктураДанных);
	КонецЦикла;
	
	Возврат РЕЗ;
КонецФункции // ()
#КонецОбласти

#Область СтруктураПодчиненности
Процедура ВывестиРодительскиеДокументы(ДокументСсылка,мДерево,мУжеВСписке,мКэшРеквизитовДокумента)
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	СписокРеквизитов = Новый СписокЗначений;
	
	Для Каждого Реквизит ИЗ МетаданныеДокумента.Реквизиты Цикл
		ТипыРеквизита = Реквизит.Тип.Типы();
		Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
			МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
			
			Если МетаданныеРеквизита<>Неопределено И Метаданные.Документы.Содержит(МетаданныеРеквизита) 
				 И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
				Попытка
					ЗначениеРеквизита = ДокументСсылка[Реквизит.Имя];
				Исключение
					Прервать;
				КонецПопытки;
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая() И ТипЗнч(ЗначениеРеквизита) = ТекущийТип 
					 И мУжеВСписке[ЗначениеРеквизита] = Неопределено И СписокРеквизитов.НайтиПоЗначению(ДокументСсылка[Реквизит.Имя]) = Неопределено Тогда
					Попытка
						СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
					Исключение
						 ОтладкаТекстОшибки = ОписаниеОшибки();
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		
		Если МетаданныеДокумента = Метаданные.Документы.СверкаВзаиморасчетов Тогда
			
			Прервать;
			
		КонецЕсли;
		
		СтрРеквизитов = "";
		
		Попытка
			СодержимоеТЧ = ДокументСсылка[ТЧ.Имя].Выгрузить();
		Исключение
			Прервать;
		КонецПопытки;
		
		Для Каждого Реквизит ИЗ ТЧ.Реквизиты Цикл
			ТипыРеквизита = Реквизит.Тип.Типы();
			Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
				Если МетаданныеРеквизита<>Неопределено И Метаданные.Документы.Содержит(МетаданныеРеквизита) 
					И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
					СтрРеквизитов = СтрРеквизитов + ?(СтрРеквизитов = "", "", ", ") + Реквизит.Имя;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		СодержимоеТЧ.Свернуть(СтрРеквизитов);
		Для Каждого КолонкаТЧ ИЗ СодержимоеТЧ.Колонки Цикл
			Для Каждого СтрокаТЧ ИЗ СодержимоеТЧ Цикл
				Попытка
					ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
				Исключение
					Продолжить;
				КонецПопытки;
				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения = Неопределено Тогда
					// базовый тип
					Продолжить;
				КонецЕсли;
				
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая()
					 И Метаданные.Документы.Содержит(МетаданныеЗначения)
					 И мУжеВСписке[ЗначениеРеквизита] = Неопределено Тогда
					Если СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда
						Попытка
							СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
						Исключение
							ОтладкаТекстОшибки = ОписаниеОшибки();
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	СписокРеквизитов.СортироватьПоПредставлению();
	мУжеВСписке.Вставить(ДокументСсылка, Истина);
	
	Если СписокРеквизитов.Количество() = 1 Тогда
		ВывестиРодительскиеДокументы(СписокРеквизитов[0].Значение,мДерево,мУжеВСписке,мКэшРеквизитовДокумента);
	ИначеЕсли СписокРеквизитов.Количество() > 1 Тогда
		ВывестиБезРодителей(СписокРеквизитов,мДерево,мУжеВСписке);
	КонецЕсли;
	
	СтрокаДерева = мДерево.Строки.Добавить();
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, Проведен, ПометкаУдаления, Представление, #Валюта, #Сумма, #Комментарий, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
						   | ИЗ Документ."+МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
						   
	Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДокумента КАК ВалютаДокумента");
	ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("ВалютаДенежныхСредств") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДенежныхСредств КАК ВалютаДокумента");
	// Эквайринг
	ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("ВалютаРасчетов") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаРасчетов КАК ВалютаДокумента");
	// Конец Эквайринг
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "NULL КАК ВалютаДокумента");
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "0 КАК СуммаДокумента");
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("Комментарий") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Комментарий", "Комментарий КАК Комментарий");
	ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("Тема") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Комментарий", 
			"ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Тема) = ТИП(Справочник.ТемыСобытий) ТОГДА ВЫРАЗИТЬ(Тема КАК Справочник.ТемыСобытий).Наименование ИНАЧЕ ВЫРАЗИТЬ(Тема КАК СТРОКА) КОНЕЦ КАК Комментарий");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Комментарий", """"" КАК Комментарий");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Выборка  = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтрокаДерева.Ссылка = Выборка.Ссылка;
		//СтрокаДерева.ДокументПредставление = Выборка.Представление;
		//СтрокаДерева.ВидДокумента = Выборка.Метаданные;
		//СтрокаДерева.ВалютаДокумента = Выборка.ВалютаДокумента;
		//СтрокаДерева.СуммаДокумента = Выборка.СуммаДокумента;
		//СтрокаДерева.Комментарий = ПреобразоватьМногострочнуюСтроку(Выборка.Комментарий);
		//СтрокаДерева.Проведен = Выборка.Проведен;
		//СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
		//СтрокаДерева.Картинка = НомерКартинки(СтрокаДерева);
		//СтрокаДерева.ПроведениеРазрешено = Выборка.Ссылка.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить;
	Иначе
		СтрокаДерева.Ссылка = ДокументСсылка;
		//СтрокаДерева.ДокументПредставление = Строка(ДокументСсылка);
		//СтрокаДерева.ВалютаДокумента = Выборка.ВалютаДокумента;
		//СтрокаДерева.СуммаДокумента = Выборка.СуммаДокумента;
		//СтрокаДерева.Комментарий = ПреобразоватьМногострочнуюСтроку(Выборка.Комментарий);
		//СтрокаДерева.Проведен = Выборка.Проведен;
		//СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
		//СтрокаДерева.Картинка = НомерКартинки(СтрокаДерева);
		//СтрокаДерева.ПроведениеРазрешено = ДокументСсылка.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить;
	КонецЕсли;
	
	мДерево = СтрокаДерева;
	
КонецПроцедуры

Процедура ВывестиБезРодителей(СписокДокументов,мДерево,мУжеВСписке)
	
	Для Каждого ЭлементСписка Из СписокДокументов Цикл
		
		МетаданныеДокумента = ЭлементСписка.Значение.Метаданные();
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, Проведен, ПометкаУдаления, Представление, #Валюта, #Сумма, #Комментарий, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
		| ИЗ Документ."+МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
		
		Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДокумента КАК ВалютаДокумента");
		ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("ВалютаДенежныхСредств") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДенежныхСредств КАК ВалютаДокумента");
		// Эквайринг
		ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("ВалютаРасчетов") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаРасчетов КАК ВалютаДокумента");
		// Конец Эквайринг
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "NULL КАК ВалютаДокумента");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "0 КАК СуммаДокумента");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Комментарий") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Комментарий", "Комментарий КАК Комментарий");
		ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("Тема") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Комментарий", 
				"ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Тема) = ТИП(Справочник.ТемыСобытий) ТОГДА ВЫРАЗИТЬ(Тема КАК Справочник.ТемыСобытий).Наименование ИНАЧЕ ВЫРАЗИТЬ(Тема КАК СТРОКА) КОНЕЦ КАК Комментарий");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Комментарий", """"" КАК Комментарий");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементСписка.Значение);
		
		Выборка  = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если мУжеВСписке[Выборка.Ссылка] = Неопределено Тогда
				СтрокаДерева = мДерево.Строки.Добавить();
				СтрокаДерева.Ссылка= Выборка.Ссылка;
				//СтрокаДерева.ВалютаДокумента= Выборка.ВалютаДокумента;
				//СтрокаДерева.СуммаДокумента= Выборка.СуммаДокумента;
				//СтрокаДерева.Комментарий = ПреобразоватьМногострочнуюСтроку(Выборка.Комментарий);
				//СтрокаДерева.ДокументПредставление = Выборка.Представление;
				//СтрокаДерева.ВидДокумента = Выборка.Метаданные;
				//СтрокаДерева.Проведен = Выборка.Проведен;
				//СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
				//СтрокаДерева.ОграничениеПоРодителям = Истина;
				//СтрокаДерева.Картинка = НомерКартинки(СтрокаДерева);
				мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	мДерево = СтрокаДерева;
	
КонецПроцедуры

Процедура ВывестиПодчиненныеДокументы(СтрокаДерева,мУжеВСписке,мКэшРеквизитовДокумента)
	
	ТекущийДокумент = СтрокаДерева.Ссылка;
	Таблица = ПолучитьСписокПодчиненныхДокументов(ТекущийДокумент);
	КэшПоТипамДокументов = Новый Соответствие;
	
	Для Каждого СтрокаТаблицы ИЗ Таблица Цикл
		МетаданныеДокумента = СтрокаТаблицы.Ссылка.Метаданные();
		Если НЕ ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
			Продолжить;
		КонецЕсли;
		ИмяДокумента = МетаданныеДокумента.Имя;
		СинонимДокумента = МетаданныеДокумента.Синоним;
		
		ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента, мКэшРеквизитовДокумента);
		
		СтруктураТипа = КэшПоТипамДокументов[ИмяДокумента];
		Если СтруктураТипа = Неопределено Тогда
			СтруктураТипа = Новый Структура("Синоним, МассивСсылок", СинонимДокумента, Новый Массив);
			КэшПоТипамДокументов.Вставить(ИмяДокумента, СтруктураТипа);
		КонецЕсли;
		СтруктураТипа.МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);
	КонецЦикла;
	
	Если КэшПоТипамДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаНачало = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ (";
	ТекстЗапросаКонец = ") КАК ПодчиненныеДокументы УПОРЯДОЧИТЬ ПО ПодчиненныеДокументы.Дата";
	Запрос = Новый Запрос;
	Для Каждого КлючИЗначение ИЗ КэшПоТипамДокументов Цикл
		Запрос.Текст = Запрос.Текст + ?(Запрос.Текст = "", "
					|ВЫБРАТЬ ", "
					|ОБЪЕДИНИТЬ ВСЕ
					|ВЫБРАТЬ") + "
					|Дата, Ссылка, Проведен, ПометкаУдаления, Представление,  """ + КлючИЗначение.Ключ + """ КАК Метаданные, #Валюта, #Сумма, #Комментарий 
					|ИЗ Документ." + КлючИЗначение.Ключ + "
					|ГДЕ Ссылка В (&" + КлючИЗначение.Ключ + ")";
					
		Если мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["ВалютаДокумента"] Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДокумента КАК ВалютаДокумента");
		ИначеЕсли мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["ВалютаДенежныхСредств"] Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДенежныхСредств КАК ВалютаДокумента");
		// Эквайринг
		ИначеЕсли мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["ВалютаРасчетов"] Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаРасчетов КАК ВалютаДокумента");
		// Конец Эквайринг
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "NULL КАК ВалютаДокумента");
		КонецЕсли;
		
		Если мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["СуммаДокумента"] Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "0 КАК СуммаДокумента");
		КонецЕсли;
		
		Если мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["Комментарий"] Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Комментарий", "Комментарий КАК Комментарий");
		ИначеЕсли мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["Тема"] Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Комментарий", 
				"ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Тема) = ТИП(Справочник.ТемыСобытий) ТОГДА ВЫРАЗИТЬ(Тема КАК Справочник.ТемыСобытий).Наименование ИНАЧЕ ВЫРАЗИТЬ(Тема КАК СТРОКА) КОНЕЦ КАК Комментарий");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Комментарий", """"" КАК Комментарий");
		КонецЕсли;
		
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение.МассивСсылок);
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапросаНачало + Запрос.Текст + ТекстЗапросаКонец;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если мУжеВСписке[Выборка.Ссылка] = Неопределено Тогда
			НоваяСтрока = СтрокаДерева.Строки.Добавить();
			НоваяСтрока.Ссылка = Выборка.Ссылка;
			//НоваяСтрока.СуммаДокумента = Выборка.СуммаДокумента;
			//НоваяСтрока.ВалютаДокумента = Выборка.ВалютаДокумента;
			//НоваяСтрока.Комментарий = ПреобразоватьМногострочнуюСтроку(Выборка.Комментарий);
			//НоваяСтрока.ДокументПредставление = Выборка.Представление;
			//НоваяСтрока.Проведен = Выборка.Проведен;
			//НоваяСтрока.ПометкаУдаления = Выборка.ПометкаУдаления;
			//НоваяСтрока.Картинка = НомерКартинки(НоваяСтрока);
			мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
			//ВывестиПодчиненныеДокументы(НоваяСтрока);
			//НоваяСтрока.ВидДокумента = Выборка.Метаданные;
			//НоваяСтрока.ПроведениеРазрешено = Выборка.Ссылка.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьСписокПодчиненныхДокументов(ДокументОснование) Экспорт
		
	Запрос = Новый Запрос;
	ТекстЗапроса = "";
	
	Для Каждого ЭлементСостава ИЗ Метаданные.КритерииОтбора.СтруктураПодчиненности.Состав Цикл
		
		Если НЕ ЭлементСостава.Тип.СодержитТип(ТипЗнч(ДокументОснование)) Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДанным = ЭлементСостава.ПолноеИмя();
		СтруктураПутьКДанным = РазобратьПутьКОбъектуМетаданных(ПутьКДанным);
		
		ЕСли НЕ ПравоДоступа("Чтение", СтруктураПутьКДанным.Метаданные) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОбъекта = СтруктураПутьКДанным.ТипОбъекта + "." + СтруктураПутьКДанным.ВидОбъекта;
		
		ТекущаяСтрокаГДЕ = "ГДЕ " + СтруктураПутьКДанным.ВидОбъекта + "." +СтруктураПутьКДанным.ИмяРеквизита + " = &ЗначениеКритерияОтбора";
			
		ИмяТЧ = Лев(СтруктураПутьКДанным.ИмяРеквизита, СтрНайти(СтруктураПутьКДанным.ИмяРеквизита, ".")-1);
		ИмяРеквизита = Лев(СтруктураПутьКДанным.ИмяРеквизита, СтрНайти(СтруктураПутьКДанным.ИмяРеквизита, ".")-1);
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ОБЪЕДИНИТЬ
		|ВЫБРАТЬ") + "
		|" + СтруктураПутьКДанным.ВидОбъекта +".Ссылка ИЗ " + ИмяОбъекта + "." + СтруктураПутьКДанным.ИмяТаблЧасти + " КАК " + СтруктураПутьКДанным.ВидОбъекта + "
		|" + СтрЗаменить(ТекущаяСтрокаГДЕ, "..", ".") + "
		|";
		
	КонецЦикла;
	
	Если ТекстЗапроса<>"" Тогда
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ДокументОснование);
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе	
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
КонецФункции

Функция РазобратьПутьКОбъектуМетаданных(ПутьКДанным) Экспорт
	
	Структура = Новый Структура;
	
	СоответствиеИмен = Новый Массив();
	СоответствиеИмен.Добавить("ТипОбъекта");
	СоответствиеИмен.Добавить("ВидОбъекта");
	СоответствиеИмен.Добавить("ПутьКДанным");
	СоответствиеИмен.Добавить("ИмяТаблЧасти");
	СоответствиеИмен.Добавить("ИмяРеквизита");
	
	Для индекс = 1 по 3 Цикл
		
		Точка = СтрНайти(ПутьКДанным, ".");
		ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
		Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
		ПутьКДанным = Сред(ПутьКДанным, Точка+1);
		
	КонецЦикла;
	
	ПутьКДанным = СтрЗаменить(ПутьКДанным, "Реквизит.", "");
	
	Если Структура.ПутьКДанным = "ТабличнаяЧасть" Тогда
		
		Для индекс = 4 по 5  Цикл 
			
			Точка = СтрНайти(ПутьКДанным, ".");
			Если Точка = 0 Тогда
				ТекущееЗначение = ПутьКДанным;
			Иначе
				ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
			КонецЕсли;
			
			Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
			ПутьКДанным = Сред(ПутьКДанным,  Точка+1);
			
		КонецЦикла;
		
	Иначе
		
		Структура.Вставить(СоответствиеИмен[3], "");
		Структура.Вставить(СоответствиеИмен[4], ПутьКДанным);
		
	КонецЕсли;
	
	Если Структура.ТипОбъекта = "Документ" Тогда
		Структура.Вставить("Метаданные", Метаданные.Документы[Структура.ВидОбъекта]);
	Иначе
		Структура.Вставить("Метаданные", Метаданные.Справочники[Структура.ВидОбъекта]);
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции // РазобратьПутьКОбъектуМетаданных()

Процедура ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента, мКэшРеквизитовДокумента)
	
	РеквизитыДокумента = мКэшРеквизитовДокумента[ИмяДокумента];
	Если РеквизитыДокумента = Неопределено Тогда
		РеквизитыДокумента = Новый Соответствие;
		РеквизитыДокумента.Вставить("ВалютаДокумента", МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено);
		РеквизитыДокумента.Вставить("ВалютаДенежныхСредств", МетаданныеДокумента.Реквизиты.Найти("ВалютаДенежныхСредств") <> Неопределено);
		РеквизитыДокумента.Вставить("ВалютаРасчетов", МетаданныеДокумента.Реквизиты.Найти("ВалютаРасчетов") <> Неопределено); // Эквайринг
		РеквизитыДокумента.Вставить("СуммаДокумента", МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено);
		РеквизитыДокумента.Вставить("Комментарий", МетаданныеДокумента.Реквизиты.Найти("Комментарий") <> Неопределено);
		РеквизитыДокумента.Вставить("Тема", МетаданныеДокумента.Реквизиты.Найти("Тема") <> Неопределено);
		мКэшРеквизитовДокумента.Вставить(ИмяДокумента, РеквизитыДокумента);
	КонецЕсли;
	
КонецПроцедуры

Функция ОбработатьДанныеДляСтруктурыПодчиненности(ТекСтрока,ТекСсылка)

	СтруктураДанных = Новый Структура("This,AccountingRef,AccountingNumber,AccountingDate,AccountingBaseRef,RetailRef,RetailNumber,RetailDate,TypeOfDocument,AccountingEntry");
	
	Если ТекСсылка = ТекСтрока.Ссылка Тогда
		СтруктураДанных.This = ИСТИНА;
	Иначе
		СтруктураДанных.This = ЛОЖЬ;
	КонецЕсли;
	
	СтруктураДанных.AccountingRef = ""+ТекСтрока.Ссылка.УникальныйИдентификатор();
	СтруктураДанных.AccountingNumber = ТекСтрока.Ссылка.Номер;
	СтруктураДанных.AccountingDate = ТекСтрока.Ссылка.Дата;
	Если ЗначениеЗаполнено(ТекСтрока.Родитель) Тогда
		СтруктураДанных.AccountingBaseRef = ""+ТекСтрока.Родитель.Ссылка.УникальныйИдентификатор();
	КонецЕсли;
	
	СтруктураДанных.TypeOfDocument = ТекСтрока.Ссылка.Метаданные().Имя;
	СтруктураДанных.AccountingEntry = ТекСтрока.Ссылка.Проведен;
	
	Если ТипЗНЧ(ТекСтрока.Ссылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
	    СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная);
		
		СтруктураДанных.RetailRef = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocRef);
		СтруктураДанных.RetailNumber = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocNumber);
		СтруктураДанных.RetailDate = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocDate);
	ИначеЕсли ТипЗНЧ(ТекСтрока.Ссылка) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
	    СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеЗапасов);
		
		СтруктураДанных.RetailRef = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocRef);
		СтруктураДанных.RetailNumber = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocNumber);
		СтруктураДанных.RetailDate = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocDate);
	ИначеЕсли ТипЗНЧ(ТекСтрока.Ссылка) = Тип("ДокументСсылка.ПриходныйОрдер") Тогда
	    СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходныйОрдер);
		
		СтруктураДанных.RetailRef = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocRef);
		СтруктураДанных.RetailNumber = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocNumber);
		СтруктураДанных.RetailDate = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocDate);
	ИначеЕсли ТипЗНЧ(ТекСтрока.Ссылка) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
	    СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходныйОрдер);
		
		СтруктураДанных.RetailRef = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocRef);
		СтруктураДанных.RetailNumber = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocNumber);
		СтруктураДанных.RetailDate = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocDate);
	ИначеЕсли ТипЗНЧ(ТекСтрока.Ссылка) = Тип("ДокументСсылка.ОприходованиеЗапасов") Тогда
	    СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОприходованиеЗапасов);
		
		СтруктураДанных.RetailRef = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocRef);
		СтруктураДанных.RetailNumber = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocNumber);
		СтруктураДанных.RetailDate = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocDate);
	ИначеЕсли ТипЗНЧ(ТекСтрока.Ссылка) = Тип("ДокументСсылка.СписаниеЗапасов") Тогда
	    СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СписаниеЗапасов);
		
		СтруктураДанных.RetailRef = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocRef);
		СтруктураДанных.RetailNumber = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocNumber);
		СтруктураДанных.RetailDate = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocDate);
	ИначеЕсли ТипЗНЧ(ТекСтрока.Ссылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
	    СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
		
		СтруктураДанных.RetailRef = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocRef);
		СтруктураДанных.RetailNumber = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocNumber);
		СтруктураДанных.RetailDate = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocDate);
	ИначеЕсли ТипЗНЧ(ТекСтрока.Ссылка) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
	    СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОтчетОРозничныхПродажах);
		
		СтруктураДанных.RetailRef = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocRef);
		СтруктураДанных.RetailNumber = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocNumber);
		СтруктураДанных.RetailDate = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocDate);
	ИначеЕсли ТипЗНЧ(ТекСтрока.Ссылка) = Тип("ДокументСсылка.ПоступлениеВКассу") Тогда
	    СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеВКассу);
		
		СтруктураДанных.RetailRef = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocRef);
		СтруктураДанных.RetailNumber = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocNumber);
		СтруктураДанных.RetailDate = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocDate);
	ИначеЕсли ТипЗНЧ(ТекСтрока.Ссылка) = Тип("ДокументСсылка.РасходИзКассы") Тогда
	    СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходИзКассы);
		
		СтруктураДанных.RetailRef = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocRef);
		СтруктураДанных.RetailNumber = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocNumber);
		СтруктураДанных.RetailDate = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocDate);
	ИначеЕсли ТипЗНЧ(ТекСтрока.Ссылка) = Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
	    СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеНаСчет);
		
		СтруктураДанных.RetailRef = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocRef);
		СтруктураДанных.RetailNumber = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocNumber);
		СтруктураДанных.RetailDate = НайтиЗначениеДополнительногоРеквизита(ТекСтрока.Ссылка, СтруктураДополнительныхРеквизитов.DocDate);
	Иначе	
		СтруктураДанных.RetailRef = "";
		СтруктураДанных.RetailNumber = "";
		СтруктураДанных.RetailDate = "";
	КонецЕсли;
	
	Возврат СтруктураДанных;

КонецФункции // ()

Процедура ОбработатьДеревоСтруктурыПодчиненности(ТекСтрока,МассивРезультатов,ТекСсылка,мУжеВСписке)

	СтруктураДанных = ОбработатьДанныеДляСтруктурыПодчиненности(ТекСтрока,ТекСсылка);
	
	Если мУжеВСписке[ТекСтрока.Ссылка] = Неопределено Тогда
		МассивРезультатов.Добавить(СтруктураДанных);
		мУжеВСписке.Вставить(ТекСтрока.Ссылка, Истина);
	КонецЕсли;
	
	Для каждого СтрокаДерева Из ТекСтрока.Строки Цикл
	
		ОбработатьДеревоСтруктурыПодчиненности(СтрокаДерева,МассивРезультатов,ТекСсылка,мУжеВСписке);
		
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьДокументПоСсылке(СтруктураДляВозврата,ТекСсылка) ЭКСПОРТ

	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	// Ищем исходный документ
	Попытка
	
		ТекУникальныйИдентификатор = Новый УникальныйИдентификатор(ТекСсылка);
	
	Исключение
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ТекСсылка;
		РЕЗ.Описание = "Invalid reference";
		
		Возврат РЕЗ;
	
	КонецПопытки;
	
	СсылкаНаДокумент = НЕОПРЕДЕЛЕНО;
	ДокументОбъект = НЕОПРЕДЕЛЕНО;
	
	Для каждого ТекМенеджерДокументов Из Документы Цикл
	
		СсылкаНаДокумент = ТекМенеджерДокументов.ПолучитьСсылку(ТекУникальныйИдентификатор);
		ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
		Если НЕ ДокументОбъект = НЕОПРЕДЕЛЕНО Тогда
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Если ДокументОбъект = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ТекСсылка;
		РЕЗ.Описание = "Reference not found";
		
		// Ищем по дополнительному реквизиту
		СтруктураДополнительныхРеквизитовПриходнаяНакладная = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная);
		ДопПараметрПриходнаяНакладная = СтруктураДополнительныхРеквизитовПриходнаяНакладная.DocRef;
		
		СтруктураДополнительныхРеквизитовПеремещениеЗапасов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеЗапасов);
		ДопПараметрПеремещениеЗапасов = СтруктураДополнительныхРеквизитовПеремещениеЗапасов.DocRef;
		
		СтруктураДополнительныхРеквизитовПриходныйОрдер = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходныйОрдер);
		ДопПараметрПриходныйОрдер = СтруктураДополнительныхРеквизитовПриходныйОрдер.DocRef;
		
		СтруктураДополнительныхРеквизитовРасходныйОрдер = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходныйОрдер);
		ДопПараметрРасходныйОрдер = СтруктураДополнительныхРеквизитовРасходныйОрдер.DocRef;
		
		СтруктураДополнительныхРеквизитовОприходованиеЗапасов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОприходованиеЗапасов);
		ДопПараметрОприходованиеЗапасов = СтруктураДополнительныхРеквизитовОприходованиеЗапасов.DocRef;
		
		СтруктураДополнительныхРеквизитовСписаниеЗапасов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СписаниеЗапасов);
		ДопПараметрСписаниеЗапасов = СтруктураДополнительныхРеквизитовСписаниеЗапасов.DocRef;
		
		СтруктураДополнительныхРеквизитовРасходнаяНакладная = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
		ДопПараметрРасходнаяНакладная = СтруктураДополнительныхРеквизитовРасходнаяНакладная.DocRef;
		
		СтруктураДополнительныхРеквизитовОтчетОРозничныхПродажах = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОтчетОРозничныхПродажах);
		ДопПараметрОтчетОРозничныхПродажах = СтруктураДополнительныхРеквизитовОтчетОРозничныхПродажах.DocRef;
		
		СтруктураДополнительныхРеквизитовПоступлениеВКассу = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеВКассу);
		ДопПараметрПоступлениеВКассу = СтруктураДополнительныхРеквизитовПоступлениеВКассу.DocRef;
		
		СтруктураДополнительныхРеквизитовРасходИзКассы = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходИзКассы);
		ДопПараметрРасходИзКассы = СтруктураДополнительныхРеквизитовРасходИзКассы.DocRef;
		
		СтруктураДополнительныхРеквизитовПоступлениеНаСчет = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеНаСчет);
		ДопПараметрПоступлениеНаСчет = СтруктураДополнительныхРеквизитовПоступлениеНаСчет.DocRef;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПриходнаяНакладнаяДополнительныеРеквизиты.Ссылка
		               |ИЗ
		               |	Документ.ПриходнаяНакладная.ДополнительныеРеквизиты КАК ПриходнаяНакладнаяДополнительныеРеквизиты
		               |ГДЕ
		               |	ПриходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
		               |	И ПриходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметрПриходнаяНакладная
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	ПеремещениеЗапасовДополнительныеРеквизиты.Ссылка
		               |ИЗ
		               |	Документ.ПеремещениеЗапасов.ДополнительныеРеквизиты КАК ПеремещениеЗапасовДополнительныеРеквизиты
		               |ГДЕ
		               |	ПеремещениеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
		               |	И ПеремещениеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметрПеремещениеЗапасов
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	ПриходныйОрдерДополнительныеРеквизиты.Ссылка
		               |ИЗ
		               |	Документ.ПриходныйОрдер.ДополнительныеРеквизиты КАК ПриходныйОрдерДополнительныеРеквизиты
		               |ГДЕ
		               |	ПриходныйОрдерДополнительныеРеквизиты.Значение = &ТекПараметр
		               |	И ПриходныйОрдерДополнительныеРеквизиты.Свойство = &ДопПараметрПриходныйОрдер
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	РасходныйОрдерДополнительныеРеквизиты.Ссылка
		               |ИЗ
		               |	Документ.РасходныйОрдер.ДополнительныеРеквизиты КАК РасходныйОрдерДополнительныеРеквизиты
		               |ГДЕ
		               |	РасходныйОрдерДополнительныеРеквизиты.Значение = &ТекПараметр
		               |	И РасходныйОрдерДополнительныеРеквизиты.Свойство = &ДопПараметрРасходныйОрдер
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	ОприходованиеЗапасовДополнительныеРеквизиты.Ссылка
		               |ИЗ
		               |	Документ.ОприходованиеЗапасов.ДополнительныеРеквизиты КАК ОприходованиеЗапасовДополнительныеРеквизиты
		               |ГДЕ
		               |	ОприходованиеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
		               |	И ОприходованиеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметрОприходованиеЗапасов
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	СписаниеЗапасовДополнительныеРеквизиты.Ссылка
		               |ИЗ
		               |	Документ.СписаниеЗапасов.ДополнительныеРеквизиты КАК СписаниеЗапасовДополнительныеРеквизиты
		               |ГДЕ
		               |	СписаниеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
		               |	И СписаниеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметрСписаниеЗапасов
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	РасходнаяНакладнаяДополнительныеРеквизиты.Ссылка
		               |ИЗ
		               |	Документ.РасходнаяНакладная.ДополнительныеРеквизиты КАК РасходнаяНакладнаяДополнительныеРеквизиты
		               |ГДЕ
		               |	РасходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
		               |	И РасходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметрРасходнаяНакладная
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Ссылка
		               |ИЗ
		               |	Документ.ОтчетОРозничныхПродажах.ДополнительныеРеквизиты КАК ОтчетОРозничныхПродажахДополнительныеРеквизиты
		               |ГДЕ
		               |	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Значение = &ТекПараметр
		               |	И ОтчетОРозничныхПродажахДополнительныеРеквизиты.Свойство = &ДопПараметрОтчетОРозничныхПродажах
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	ПоступлениеВКассуДополнительныеРеквизиты.Ссылка
		               |ИЗ
		               |	Документ.ПоступлениеВКассу.ДополнительныеРеквизиты КАК ПоступлениеВКассуДополнительныеРеквизиты
		               |ГДЕ
		               |	ПоступлениеВКассуДополнительныеРеквизиты.Значение = &ТекПараметр
		               |	И ПоступлениеВКассуДополнительныеРеквизиты.Свойство = &ДопПараметрПоступлениеВКассу
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	РасходИзКассыДополнительныеРеквизиты.Ссылка
		               |ИЗ
		               |	Документ.РасходИзКассы.ДополнительныеРеквизиты КАК РасходИзКассыДополнительныеРеквизиты
		               |ГДЕ
		               |	РасходИзКассыДополнительныеРеквизиты.Значение = &ТекПараметр
		               |	И РасходИзКассыДополнительныеРеквизиты.Свойство = &ДопПараметрРасходИзКассы
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	ПоступлениеНаСчетДополнительныеРеквизиты.Ссылка
		               |ИЗ
		               |	Документ.ПоступлениеНаСчет.ДополнительныеРеквизиты КАК ПоступлениеНаСчетДополнительныеРеквизиты
		               |ГДЕ
		               |	ПоступлениеНаСчетДополнительныеРеквизиты.Значение = &ТекПараметр
		               |	И ПоступлениеНаСчетДополнительныеРеквизиты.Свойство = &ДопПараметрПоступлениеНаСчет";
		
		Запрос.УстановитьПараметр("ТекПараметр", ТекСсылка);
		Запрос.УстановитьПараметр("ДопПараметрПриходнаяНакладная", ДопПараметрПриходнаяНакладная);
		Запрос.УстановитьПараметр("ДопПараметрПеремещениеЗапасов", ДопПараметрПеремещениеЗапасов);
		Запрос.УстановитьПараметр("ДопПараметрПриходныйОрдер", ДопПараметрПриходныйОрдер);
		Запрос.УстановитьПараметр("ДопПараметрРасходныйОрдер", ДопПараметрРасходныйОрдер);
		Запрос.УстановитьПараметр("ДопПараметрОприходованиеЗапасов", ДопПараметрОприходованиеЗапасов);
		Запрос.УстановитьПараметр("ДопПараметрСписаниеЗапасов", ДопПараметрСписаниеЗапасов);
		Запрос.УстановитьПараметр("ДопПараметрРасходнаяНакладная", ДопПараметрРасходнаяНакладная);
		Запрос.УстановитьПараметр("ДопПараметрОтчетОРозничныхПродажах", ДопПараметрОтчетОРозничныхПродажах);
		Запрос.УстановитьПараметр("ДопПараметрПоступлениеВКассу", ДопПараметрПоступлениеВКассу);
		Запрос.УстановитьПараметр("ДопПараметрРасходИзКассы", ДопПараметрРасходИзКассы);
		Запрос.УстановитьПараметр("ДопПараметрПоступлениеНаСчет", ДопПараметрПоступлениеНаСчет);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			СсылкаНаДокумент = РезультатЗапроса.Ссылка;
			ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
		КонецЦикла;
		
		Если НЕ ДокументОбъект = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ.Результат = ИСТИНА;
			РЕЗ.ВозвращаемоеЗначение = СсылкаНаДокумент;
			РЕЗ.Описание = "Successfully";
		КонецЕсли;
		
	Иначе
		РЕЗ.Результат = ИСТИНА;
		РЕЗ.ВозвращаемоеЗначение = СсылкаНаДокумент;
		РЕЗ.Описание = "Successfully";
	КонецЕсли;

	Возврат РЕЗ;
КонецФункции // ()

Функция ПолучитьСвязанныеОбъекты(СтруктураДляВозврата,ТекСсылка) ЭКСПОРТ

	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	мДерево = Новый ДеревоЗначений();
	мДерево.Колонки.Добавить("Ссылка");
	
	мУжеВСписке = Новый Соответствие;
	мКэшРеквизитовДокумента = Новый Соответствие;
	
	РЕЗ = ПолучитьДокументПоСсылке(СтруктураДляВозврата,ТекСсылка);
	Если РЕЗ.Результат Тогда
		
		Попытка
			
			ВывестиРодительскиеДокументы(РЕЗ.ВозвращаемоеЗначение,мДерево,мУжеВСписке,мКэшРеквизитовДокумента);
			
			ВывестиПодчиненныеДокументы(мДерево,мУжеВСписке,мКэшРеквизитовДокумента);
		
		Исключение
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = ТекСсылка;
			РЕЗ.Описание = "Internal processing error";
			
			Возврат РЕЗ;
			
		КонецПопытки;
		
	КонецЕсли;
	
	// Пробуем найти подчиненные подчиненных
	Если ТипЗНЧ(мДерево)=Тип("ДеревоЗначений") ИЛИ ТипЗНЧ(мДерево)=Тип("СтрокаДереваЗначений") Тогда
		
		Для каждого СтрокаДерева Из мДерево.Строки Цикл
		
			Попытка
				
				ВывестиРодительскиеДокументы(СтрокаДерева.Ссылка,СтрокаДерева,мУжеВСписке,мКэшРеквизитовДокумента);
				
				ВывестиПодчиненныеДокументы(СтрокаДерева,мУжеВСписке,мКэшРеквизитовДокумента);	
								
			Исключение
				
				РЕЗ.Результат = ЛОЖЬ;
				РЕЗ.ВозвращаемоеЗначение = ТекСсылка;
				РЕЗ.Описание = "Internal processing error";
				
				Возврат РЕЗ;
				
			КонецПопытки;
		
		КонецЦикла; 
		
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ТекСсылка;
		РЕЗ.Описание = "Internal processing error";
		
		Возврат РЕЗ;
		
	КонецЕсли;	
	
	мУжеВСписке = Новый Соответствие;
	МассивРезультатов = Новый Массив();
	
	Если ТипЗНЧ(мДерево)=Тип("СтрокаДереваЗначений") Тогда
		
		СтруктураДанных = ОбработатьДанныеДляСтруктурыПодчиненности(мДерево,РЕЗ.ВозвращаемоеЗначение);
						
		МассивРезультатов.Добавить(СтруктураДанных);
		мУжеВСписке.Вставить(мДерево.Ссылка, Истина);
		
		Для каждого СтрокаДерева Из мДерево.Строки Цикл
		
			ОбработатьДеревоСтруктурыПодчиненности(СтрокаДерева,МассивРезультатов,РЕЗ.ВозвращаемоеЗначение,мУжеВСписке);
		
		КонецЦикла;
	
	ИначеЕсли ТипЗНЧ(мДерево)=Тип("ДеревоЗначений") Тогда
		
		Для каждого СтрокаДерева Из мДерево.Строки Цикл
		
			ОбработатьДеревоСтруктурыПодчиненности(СтрокаДерева,МассивРезультатов,РЕЗ.ВозвращаемоеЗначение,мУжеВСписке);
		
		КонецЦикла; 
		
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ТекСсылка;
		РЕЗ.Описание = "Internal processing error";
		
		Возврат РЕЗ;
		
	КонецЕсли;
	
	РЕЗ.Результат = ИСТИНА;
	РЕЗ.ВозвращаемоеЗначение = МассивРезультатов;
	РЕЗ.Описание = "Successfully";	
	
	Возврат РЕЗ;
	
КонецФункции // ()
#КонецОбласти

#Область ПеремещениеДС
Функция СоздатьПеремещениеДС(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	DepartureCashDeskCode = СоответствиеОбъекта.Получить("DepartureCashDeskCode");
	DepartureCashDesk = СоответствиеОбъекта.Получить("DepartureCashDesk");
	ReceiverCashDeskCode = СоответствиеОбъекта.Получить("ReceiverCashDeskCode");
	ReceiverCashDesk = СоответствиеОбъекта.Получить("ReceiverCashDesk");
	Currency = СоответствиеОбъекта.Получить("Currency");
	ID = СоответствиеОбъекта.Получить("ID");
	PurposeOfPayment = СоответствиеОбъекта.Получить("PurposeOfPayment");
	Sum = СоответствиеОбъекта.Получить("Sum");
	Description = СоответствиеОбъекта.Получить("Description");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	// Ищем Кассу
	ТекКасса = НЕОПРЕДЕЛЕНО;
	Если НЕ DepartureCashDeskCode = НЕОПРЕДЕЛЕНО Тогда
		Если ТипЗНЧ(DepartureCashDeskCode)=Тип("Строка") Тогда
			ЗапросКасса = Новый Запрос;
			ЗапросКасса.Текст = 
			"ВЫБРАТЬ
			|	Кассы.Ссылка
			|ИЗ
			|	Справочник.Кассы КАК Кассы
			|ГДЕ
			|	Кассы.Код = &Код";
			
			ЗапросКасса.УстановитьПараметр("Код", СокрЛП(DepartureCashDeskCode));
			РезультатЗапросаКасса = ЗапросКасса.Выполнить();
			ВыборкаДетальныеЗаписиКасса = РезультатЗапросаКасса.Выбрать();
			Пока ВыборкаДетальныеЗаписиКасса.Следующий() Цикл
				ТекКасса = ВыборкаДетальныеЗаписиКасса.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ТекКасса = НЕОПРЕДЕЛЕНО Тогда
		Если НЕ DepartureCashDesk = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ = НайтиИлиСоздатьКассу(РЕЗ,DepartureCashDesk,ТекВалюта);
			Если НЕ РЕЗ.Результат Тогда
				Возврат РЕЗ;
			Иначе
				ТекКасса = РЕЗ.ВозвращаемоеЗначение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ТекКасса = НЕОПРЕДЕЛЕНО Тогда
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ?(DepartureCashDeskCode = НЕОПРЕДЕЛЕНО,Ref,DepartureCashDeskCode);
		РЕЗ.Описание = "Departure CashDesk not found";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	// Ищем Кассу-получатель
	ТекКассаПолучатель = НЕОПРЕДЕЛЕНО;
	Если НЕ ReceiverCashDeskCode = НЕОПРЕДЕЛЕНО Тогда
		Если ТипЗНЧ(ReceiverCashDeskCode)=Тип("Строка") Тогда
			ЗапросКасса = Новый Запрос;
			ЗапросКасса.Текст = 
			"ВЫБРАТЬ
			|	Кассы.Ссылка
			|ИЗ
			|	Справочник.Кассы КАК Кассы
			|ГДЕ
			|	Кассы.Код = &Код";
			
			ЗапросКасса.УстановитьПараметр("Код", СокрЛП(ReceiverCashDeskCode));
			РезультатЗапросаКасса = ЗапросКасса.Выполнить();
			ВыборкаДетальныеЗаписиКасса = РезультатЗапросаКасса.Выбрать();
			Пока ВыборкаДетальныеЗаписиКасса.Следующий() Цикл
				ТекКассаПолучатель = ВыборкаДетальныеЗаписиКасса.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ТекКассаПолучатель = НЕОПРЕДЕЛЕНО Тогда
		Если НЕ ReceiverCashDesk = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ = НайтиИлиСоздатьКассу(РЕЗ,ReceiverCashDesk,ТекВалюта);
			Если НЕ РЕЗ.Результат Тогда
				Возврат РЕЗ;
			Иначе
				ТекКассаПолучатель = РЕЗ.ВозвращаемоеЗначение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ТекКассаПолучатель = НЕОПРЕДЕЛЕНО Тогда
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ?(ReceiverCashDeskCode = НЕОПРЕДЕЛЕНО,Ref,ReceiverCashDeskCode);
		РЕЗ.Описание = "Receiver CashDesk not found";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	Если ТипЗНЧ(Sum)=Тип("Строка") Тогда
		Если СтрНайти(НРЕГ(Sum),"null")=0 Тогда
			ТекСумма = Число(Sum);
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of money transfer";
		
			Возврат РЕЗ;
		КонецЕсли;
	ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
		ТекСумма = Sum;
		Если ТекСумма = 0 Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of money transfer";
			
			Возврат РЕЗ;
		КонецЕсли;
	Иначе
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect sum of money transfer";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеДС);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПеремещениеДСДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.ПеремещениеДС.ДополнительныеРеквизиты КАК ПеремещениеДСДополнительныеРеквизиты
	               |ГДЕ
	               |	ПеремещениеДСДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И ПеремещениеДСДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		// Создаём документ
		ТекДок = Документы.ПеремещениеДС.СоздатьДокумент();
		
		ТекДок.Дата = ДатаДокумента;
		ТекДок.УстановитьНовыйНомер();
		
		СтратегияЗаполнения = Новый Соответствие;
		СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеДСПлан")] = "ЗаполнитьПоПеремещениеДСПлан";
		
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, НЕОПРЕДЕЛЕНО, СтратегияЗаполнения);
		
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
		
		ТекДок.Автор = НастройкиПоУмолчанию.Автор;
		ТекДок.Комментарий = Description;
		ТекДок.ID = СокрЛП(ID);
		ТекДок.НазначениеПлатежа = СокрЛП(PurposeOfPayment);
				
		ТекДок.Организация = НастройкиПоУмолчанию.Организация;		
		ТекДок.Статья = НастройкиПоУмолчанию.СтатьиДвиженияДенежныхСредств_ПеремещениеДС;
		ТекДок.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		ТекДок.ТипДенежныхСредствПолучатель = Перечисления.ТипыДенежныхСредств.Наличные;
		ТекДок.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ПеремещениеДС;
		
		ТекДок.ВалютаДенежныхСредств = ТекВалюта;
		ТекДок.Касса = ТекКасса;
		ТекДок.КассаПолучатель = ТекКассаПолучатель;
		ТекДок.СуммаДокумента = Sum;
		
		МассивОшибок = Новый Массив();
		
		// Проводим
		ОписаниеУспешногоПроведения = "Doc of money transfer created successfully";
		ЗаписыватьПриОшибках=ЛОЖЬ;
		ОписаниеДляМассиваОшибок="";
		ФиксироватьТранзакции=ЛОЖЬ;
		РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
		
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc of money transfer already exist";		
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ОбновитьПеремещениеДС(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	Ref = СоответствиеОбъекта.Получить("Ref");
	Number = СоответствиеОбъекта.Получить("Number");
	Date = СоответствиеОбъекта.Получить("Date");
	DepartureCashDeskCode = СоответствиеОбъекта.Получить("DepartureCashDeskCode");
	DepartureCashDesk = СоответствиеОбъекта.Получить("DepartureCashDesk");
	ReceiverCashDeskCode = СоответствиеОбъекта.Получить("ReceiverCashDeskCode");
	ReceiverCashDesk = СоответствиеОбъекта.Получить("ReceiverCashDesk");
	Currency = СоответствиеОбъекта.Получить("Currency");
	ID = СоответствиеОбъекта.Получить("ID");
	PurposeOfPayment = СоответствиеОбъекта.Получить("PurposeOfPayment");
	Sum = СоответствиеОбъекта.Получить("Sum");
	Description = СоответствиеОбъекта.Получить("Description");
	
	НеПроводить=ЛОЖЬ;
	AccountingEntry = СоответствиеОбъекта.Получить("AccountingEntry");
	Если ТипЗНЧ(AccountingEntry)=Тип("Булево") Тогда
		НеПроводить = НЕ (AccountingEntry);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ref) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	ДатаДокумента = ДатаJSON(Date);
	Если ДатаДокумента = НЕОПРЕДЕЛЕНО Тогда
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Date;
		РЕЗ.Описание = "Error reading date";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	ТекВалюта = НЕОПРЕДЕЛЕНО;
	РЕЗ = НайтиВалюту(Currency,СтруктураДляВозврата);
	Если НЕ РЕЗ.Результат Тогда
		Возврат РЕЗ;
	Иначе
		ТекВалюта = РЕЗ.ВозвращаемоеЗначение;
	КонецЕсли;
	
	// Ищем Кассу
	ТекКасса = НЕОПРЕДЕЛЕНО;
	Если НЕ DepartureCashDeskCode = НЕОПРЕДЕЛЕНО Тогда
		Если ТипЗНЧ(DepartureCashDeskCode)=Тип("Строка") Тогда
			ЗапросКасса = Новый Запрос;
			ЗапросКасса.Текст = 
			"ВЫБРАТЬ
			|	Кассы.Ссылка
			|ИЗ
			|	Справочник.Кассы КАК Кассы
			|ГДЕ
			|	Кассы.Код = &Код";
			
			ЗапросКасса.УстановитьПараметр("Код", СокрЛП(DepartureCashDeskCode));
			РезультатЗапросаКасса = ЗапросКасса.Выполнить();
			ВыборкаДетальныеЗаписиКасса = РезультатЗапросаКасса.Выбрать();
			Пока ВыборкаДетальныеЗаписиКасса.Следующий() Цикл
				ТекКасса = ВыборкаДетальныеЗаписиКасса.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ТекКасса = НЕОПРЕДЕЛЕНО Тогда
		Если НЕ DepartureCashDesk = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ = НайтиИлиСоздатьКассу(РЕЗ,DepartureCashDesk,ТекВалюта);
			Если НЕ РЕЗ.Результат Тогда
				Возврат РЕЗ;
			Иначе
				ТекКасса = РЕЗ.ВозвращаемоеЗначение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ТекКасса = НЕОПРЕДЕЛЕНО Тогда
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ?(DepartureCashDeskCode = НЕОПРЕДЕЛЕНО,Ref,DepartureCashDeskCode);
		РЕЗ.Описание = "Departure CashDesk not found";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	// Ищем Кассу-получатель
	ТекКассаПолучатель = НЕОПРЕДЕЛЕНО;
	Если НЕ ReceiverCashDeskCode = НЕОПРЕДЕЛЕНО Тогда
		Если ТипЗНЧ(ReceiverCashDeskCode)=Тип("Строка") Тогда
			ЗапросКасса = Новый Запрос;
			ЗапросКасса.Текст = 
			"ВЫБРАТЬ
			|	Кассы.Ссылка
			|ИЗ
			|	Справочник.Кассы КАК Кассы
			|ГДЕ
			|	Кассы.Код = &Код";
			
			ЗапросКасса.УстановитьПараметр("Код", СокрЛП(ReceiverCashDeskCode));
			РезультатЗапросаКасса = ЗапросКасса.Выполнить();
			ВыборкаДетальныеЗаписиКасса = РезультатЗапросаКасса.Выбрать();
			Пока ВыборкаДетальныеЗаписиКасса.Следующий() Цикл
				ТекКассаПолучатель = ВыборкаДетальныеЗаписиКасса.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ТекКассаПолучатель = НЕОПРЕДЕЛЕНО Тогда
		Если НЕ ReceiverCashDesk = НЕОПРЕДЕЛЕНО Тогда
			РЕЗ = НайтиИлиСоздатьКассу(РЕЗ,ReceiverCashDesk,ТекВалюта);
			Если НЕ РЕЗ.Результат Тогда
				Возврат РЕЗ;
			Иначе
				ТекКассаПолучатель = РЕЗ.ВозвращаемоеЗначение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ТекКассаПолучатель = НЕОПРЕДЕЛЕНО Тогда
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ?(ReceiverCashDeskCode = НЕОПРЕДЕЛЕНО,Ref,ReceiverCashDeskCode);
		РЕЗ.Описание = "Receiver CashDesk not found";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	Если ТипЗНЧ(Sum)=Тип("Строка") Тогда
		Если СтрНайти(НРЕГ(Sum),"null")=0 Тогда
			ТекСумма = Число(Sum);
		Иначе
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of money transfer";
		
			Возврат РЕЗ;
		КонецЕсли;
	ИначеЕсли ТипЗНЧ(Sum)=Тип("Число") Тогда
		ТекСумма = Sum;
		Если ТекСумма = 0 Тогда
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Incorrect sum of money transfer";
			
			Возврат РЕЗ;
		КонецЕсли;
	Иначе
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect sum of money transfer";
		
		Возврат РЕЗ;
	КонецЕсли;
	
	НастройкиПоУмолчанию = ПолучитьНастройкиПоУмолчанию();
	Если НЕ НастройкиПоУмолчанию.ВсеПравильно Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Incorrect default settings";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	// Ищем существующие
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеДС);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПеремещениеДСДополнительныеРеквизиты.Ссылка
	               |ИЗ
	               |	Документ.ПеремещениеДС.ДополнительныеРеквизиты КАК ПеремещениеДСДополнительныеРеквизиты
	               |ГДЕ
	               |	ПеремещениеДСДополнительныеРеквизиты.Значение = &ТекПараметр
	               |	И ПеремещениеДСДополнительныеРеквизиты.Свойство = &ДопПараметр";
		
	Запрос.УстановитьПараметр("ТекПараметр", Ref);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		НачатьТранзакцию();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КонецЦикла;
		
		// Убираем пометку удаления
		Попытка
			Если ТекДок.ПометкаУдаления Тогда
				ТекДок.Записать(РежимЗаписиДокумента.Запись);
				ТекДок.УстановитьПометкуУдаления(ЛОЖЬ);
			КонецЕсли;
		Исключение
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			
			РЕЗ.Результат = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Ref;
			РЕЗ.Описание = "Internal processing error";
			
			Возврат РЕЗ;
		КонецПопытки;
				
		ТекДок.Дата = ДатаДокумента;
		ТекДок.УстановитьНовыйНомер();
		
		СтратегияЗаполнения = Новый Соответствие;
		СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеДСПлан")] = "ЗаполнитьПоПеремещениеДСПлан";
		
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ТекДок, НЕОПРЕДЕЛЕНО, СтратегияЗаполнения);
		
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocRef,Ref);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocNumber,Number);
		УстановитьДополнительныйРеквизит(ТекДок, СтруктураДополнительныхРеквизитов.DocDate,Date);
		
		ТекДок.Автор = НастройкиПоУмолчанию.Автор;
		ТекДок.Комментарий = Description;
		ТекДок.ID = СокрЛП(ID);
		ТекДок.НазначениеПлатежа = СокрЛП(PurposeOfPayment);
				
		ТекДок.Организация = НастройкиПоУмолчанию.Организация;		
		ТекДок.Статья = НастройкиПоУмолчанию.СтатьиДвиженияДенежныхСредств_ПеремещениеДС;
		ТекДок.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		ТекДок.ТипДенежныхСредствПолучатель = Перечисления.ТипыДенежныхСредств.Наличные;
		ТекДок.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ПеремещениеДС;
		
		ТекДок.ВалютаДенежныхСредств = ТекВалюта;
		ТекДок.Касса = ТекКасса;
		ТекДок.КассаПолучатель = ТекКассаПолучатель;
		ТекДок.СуммаДокумента = Sum;
		
		МассивОшибок = Новый Массив();
		
		// Проводим
		ОписаниеУспешногоПроведения = "Doc of money transfer updated successfully";
		ЗаписыватьПриОшибках=ЛОЖЬ;
		ОписаниеДляМассиваОшибок="";
		ФиксироватьТранзакции=ИСТИНА;
		РЕЗ = ПопыткаПровестиДокумент(ТекДок,Ref,РЕЗ,ОписаниеУспешногоПроведения,МассивОшибок,ФиксироватьТранзакции,ЗаписыватьПриОшибках,ОписаниеДляМассиваОшибок,НеПроводить);
		
	Иначе
		
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = Ref;
		РЕЗ.Описание = "Doc of money transfer not found";
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция УдалитьПеремещениеДС(СтруктураДляВозврата,СоответствиеОбъекта) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ПолучитьСтруктураДляВозврата(СтруктураДляВозврата);
	
	ЗначениеПараметра = СоответствиеОбъекта.Получить("Ref");
	
	Если НЕ ЗначениеЗаполнено(ЗначениеПараметра) Тогда
	
		РЕЗ.Результат = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = ЗначениеПараметра;
		РЕЗ.Описание = "Incorrect ref";
		
		Возврат РЕЗ;
	
	КонецЕсли;
	
	СтруктураДополнительныхРеквизитов = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеДС);
	ДопПараметр = СтруктураДополнительныхРеквизитов.DocRef;
		
	СтрокаТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПеремещениеДСДополнительныеРеквизиты.Ссылка
	                      |ИЗ
	                      |	Документ.ПеремещениеДС.ДополнительныеРеквизиты КАК ПеремещениеДСДополнительныеРеквизиты
	                      |ГДЕ
	                      |	ПеремещениеДСДополнительныеРеквизиты.Значение = &ТекПараметр
	                      |	И ПеремещениеДСДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	СтрокаОтветаДляУдачногоРезультата = "Doc of money transfer deleted successfully";
	СтрокаОтветаОбъектНеНайден = "Doc of money transfer not found";
	
	РЕЗ = ПометитьНаУдалениеОбъектПоОдномуПараметру(СтруктураДляВозврата,СтрокаТекстаЗапроса,ЗначениеПараметра,СтрокаОтветаДляУдачногоРезультата,СтрокаОтветаОбъектНеНайден,ДопПараметр);
	
	Возврат РЕЗ;
КонецФункции // ()
#КонецОбласти