
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр                      = НСтр("ka='ფაილი Excel 2007 (*.xlsx)|*.xlsx';ru='Книга Excel 2007 (*.xlsx)|*.xlsx';en='Book Excel 2007 (* .xlsx) | * .xlsx'");
	ДиалогВыбораФайла.Заголовок                   = Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "xlsx";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура OK(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПутьКФайлу", СокрЛП(ПутьКФайлу));
	
	ЭтаФорма.Закрыть(СтруктураПараметров);
	
КонецПроцедуры
