
Процедура ДвиженияЗапасыВВалютеПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	СсылкаНаДокумент = Источник.Отбор.Регистратор.Значение;
	ТаблицаЗапасы = Источник.Выгрузить();
	
	Если Не Отказ И Замещение 
			И (ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПересортицаЗапасов") 
			//ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.РасходнаяНакладная") 
			//ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПеремещениеЗапасов") 
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПриходнаяНакладная")  
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.СписаниеЗапасов")    
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.Импорт")
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ВводНачальныхОстатков")
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ДополнительныеРасходы")
			//ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗакрытиеМесяца")
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.КорректировкаПоступления")
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.КорректировкаРеализации")
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.КорректировкаРегистров")
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ОприходованиеЗапасов")) Тогда
			
				
				
		ПараметрыПроцедуры = Новый Структура("СсылкаНаДокумент,ТаблицаЗапасы", СсылкаНаДокумент, ТаблицаЗапасы);
		
		Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Или Истина Тогда // Отключено фоновое выполнение, чтобы не было блокировок
			
			СформироватьДвиженияЗапасыВВалюте(СсылкаНаДокумент, ТаблицаЗапасы);
			
		Иначе
			
			ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
			ПараметрыВыполнения.КлючФоновогоЗадания = "ФормированиеДвиженийЗапасыВВалюте";
			ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ka='მოძრაობის ფორმირება რეზერვები ვალუტაში';ru='Формирование движений Запасы в валюте';en='Formation of movements Reserves in currency'");
			
			ДлительныеОперации.ВыполнитьВФоне(
				"ВалютныйУчетЗапасов.СформироватьДвиженияЗапасыВВалютеВФоне",
				ПараметрыПроцедуры, 
				ПараметрыВыполнения);
		
		КонецЕсли;
		 
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияЗапасыВВалютеВФоне(ПараметрыПроцедуры, АдресХранилища) Экспорт
	
	СформироватьДвиженияЗапасыВВалюте(ПараметрыПроцедуры.СсылкаНаДокумент, ПараметрыПроцедуры.ТаблицаЗапасы);
	
КонецПроцедуры

Процедура СформироватьДвиженияЗапасыВВалюте(СсылкаНаДокумент, ТаблицаЗапасы) Экспорт
	
	ИмяСобытия = "Формирование движений по регистру ЗапасыВВалюте";
		
	НаборЗаписей = СсылкаНаДокумент.ПолучитьОбъект().Движения.ЗапасыВВалюте;
	
	Если ТаблицаЗапасы.Количество()>0 Тогда
	
		РезультатМассив = ПолучитьМассивРезультатов(ТаблицаЗапасы);
		
		ОстановитьФормирование = Ложь;                 
		
		ВыборкаУпрВалюта = РезультатМассив[1].Выбрать();
		Если ВыборкаУпрВалюта.Следующий() Тогда       
			Если Не ЗначениеЗаполнено(ВыборкаУпрВалюта.ВалютаУправленческая) Тогда      
				ОстановитьФормирование = Истина;
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, СсылкаНаДокумент.Метаданные(), СсылкаНаДокумент,
					"Не задана ""Валюта управленческая"" в регистре сведений ""Учетная политика (бух. учет)""");
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ВыборкаУпрВалюта.ДатаНачалаУчетаПоУпрВалюте) Тогда  
				ОстановитьФормирование = Истина;
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, СсылкаНаДокумент.Метаданные(), СсылкаНаДокумент,
					"Не задана ""Дата начала учета по управленческой валюте"" в регистре сведений ""Учетная политика (бух. учет)""");				
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;    
		
		ВыборкаКурс = РезультатМассив[2].Выбрать();
		Если Не ВыборкаКурс.Следующий() Тогда
			ОстановитьФормирование = Истина;
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, СсылкаНаДокумент.Метаданные(), СсылкаНаДокумент,
				"Не задан курс валюты %1"+ВыборкаУпрВалюта.ВалютаУправленческая);
		КонецЕсли;
		
		Если ОстановитьФормирование Тогда
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПриходнаяНакладная") И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "ВалютаДокумента") = ВыборкаУпрВалюта.ВалютаУправленческая Тогда
			НаборЗаписей.Загрузить(ПолучитьДанныеИзТЧПриходнойНакладной(СсылкаНаДокумент, ТаблицаЗапасы));
		Иначе
			Для Каждого ТекСтр Из ТаблицаЗапасы Цикл
				НовСтр = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
				НовСтр.СуммаВал = ТекСтр.Сумма * ВыборкаКурс.Кратность / ВыборкаКурс.Курс; 				
			КонецЦикла;
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
		
	Иначе
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();   
			
	КонецЕсли; 
		
КонецПроцедуры

Функция ПолучитьМассивРезультатов(ТаблицаЗапасы)
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетнаяПолитикаРеглСрезПоследних.ВалютаУправленческая КАК ВалютаУправленческая,
	               |	УчетнаяПолитикаРеглСрезПоследних.ДатаНачалаУчетаПоУпрВалюте КАК ДатаНачалаУчетаПоУпрВалюте
	               |ПОМЕСТИТЬ втУчетнаяПолитика
	               |ИЗ
	               |	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&НаДату, Организация = &Организация) КАК УчетнаяПолитикаРеглСрезПоследних
	               |ГДЕ
	               |	УчетнаяПолитикаРеглСрезПоследних.ВестиУчетВУпрВалюте
	               |	И УчетнаяПолитикаРеглСрезПоследних.ДатаНачалаУчетаПоУпрВалюте <= &НаДату
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втУчетнаяПолитика.ВалютаУправленческая КАК ВалютаУправленческая,
	               |	втУчетнаяПолитика.ДатаНачалаУчетаПоУпрВалюте КАК ДатаНачалаУчетаПоУпрВалюте
	               |ИЗ
	               |	втУчетнаяПолитика КАК втУчетнаяПолитика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Курс КАК Курс,
	               |	КурсыВалютСрезПоследних.Кратность КАК Кратность
	               |ИЗ
	               |	втУчетнаяПолитика КАК втУчетнаяПолитика
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, ) КАК КурсыВалютСрезПоследних
	               |		ПО втУчетнаяПолитика.ВалютаУправленческая = КурсыВалютСрезПоследних.Валюта
	               |ГДЕ
	               |	НЕ КурсыВалютСрезПоследних.Курс = 0
	               |	И НЕ КурсыВалютСрезПоследних.Кратность = 0"; 
	//+++ Дмгг, 25.07.24, ONESOFT-3353
	//Запрос.УстановитьПараметр("НаДату", ТаблицаЗапасы[0].Период);   
	Если ТипЗнч(ТаблицаЗапасы[0].Регистратор) = Тип("ДокументСсылка.КорректировкаПоступления") И ЗначениеЗаполнено(ТаблицаЗапасы[0].Регистратор.ДокументОснование) Тогда 
		Запрос.УстановитьПараметр("НаДату", ТаблицаЗапасы[0].Регистратор.ДокументОснование.Дата);  
	Иначе
		Запрос.УстановитьПараметр("НаДату", ТаблицаЗапасы[0].Период);
	КонецЕсли; 
	//--- Дмгг, 25.07.24, ONESOFT-3353
	Запрос.УстановитьПараметр("Организация", ТаблицаЗапасы[0].Организация);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("ПустаяВалюта", Справочники.Валюты.ПустаяСсылка());    
	Возврат Запрос.ВыполнитьПакет();
			
КонецФункции

Функция ПолучитьДанныеИзТЧПриходнойНакладной(СсылкаНаДокумент, ТаблицаЗапасы)
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗапасыВВалюте.Период КАК Период,
		|	ЗапасыВВалюте.Регистратор КАК Регистратор,
		|	ЗапасыВВалюте.НомерСтроки КАК НомерСтроки,
		|	ЗапасыВВалюте.Активность КАК Активность,
		|	ЗапасыВВалюте.ВидДвижения КАК ВидДвижения,
		|	ЗапасыВВалюте.Организация КАК Организация,
		|	ЗапасыВВалюте.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ЗапасыВВалюте.СчетУчета КАК СчетУчета,
		|	ЗапасыВВалюте.Номенклатура КАК Номенклатура,
		|	ЗапасыВВалюте.Характеристика КАК Характеристика,
		|	ЗапасыВВалюте.Партия КАК Партия,
		|	ЗапасыВВалюте.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЗапасыВВалюте.СчетУчетаРегл КАК СчетУчетаРегл,
		|	ЗапасыВВалюте.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	ЗапасыВВалюте.Проект КАК Проект,
		|	ЗапасыВВалюте.Количество КАК Количество,
		|	ЗапасыВВалюте.Сумма КАК Сумма,
		|	ЗапасыВВалюте.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
		|	ЗапасыВВалюте.КоррСчетУчета КАК КоррСчетУчета,
		|	ЗапасыВВалюте.КоррНоменклатура КАК КоррНоменклатура,
		|	ЗапасыВВалюте.КоррХарактеристика КАК КоррХарактеристика,
		|	ЗапасыВВалюте.КоррПартия КАК КоррПартия,
		|	ЗапасыВВалюте.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
		|	ЗапасыВВалюте.Спецификация КАК Спецификация,
		|	ЗапасыВВалюте.КоррСпецификация КАК КоррСпецификация,
		|	ЗапасыВВалюте.ЗаказПродажи КАК ЗаказПродажи,
		|	ЗапасыВВалюте.ДокументПродажи КАК ДокументПродажи,
		|	ЗапасыВВалюте.Подразделение КАК Подразделение,
		|	ЗапасыВВалюте.Ответственный КАК Ответственный,
		|	ЗапасыВВалюте.СтавкаНДС КАК СтавкаНДС,
		|	ЗапасыВВалюте.ФиксированнаяСтоимость КАК ФиксированнаяСтоимость,
		|	ЗапасыВВалюте.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
		|	ЗапасыВВалюте.Возврат КАК Возврат,
		|	ЗапасыВВалюте.СодержаниеПроводки КАК СодержаниеПроводки,
		|	ЗапасыВВалюте.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
		|	ЗапасыВВалюте.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ЗапасыВВалюте.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
		|	ЗапасыВВалюте.Резервирование КАК Резервирование,
		|	ЗапасыВВалюте.КоррПроект КАК КоррПроект
		|ПОМЕСТИТЬ втЗапасы
		|ИЗ
		|	&ТаблицаЗапасы КАК ЗапасыВВалюте
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
		|	ПриходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
		|	ПриходнаяНакладнаяЗапасы.Партия КАК Партия,
		|	СУММА(ПриходнаяНакладнаяЗапасы.Всего) КАК Всего,
		|	СУММА(ПриходнаяНакладнаяЗапасы.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ втЗапасыДокумента
		|ИЗ
		|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		|ГДЕ
		|	ПриходнаяНакладнаяЗапасы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриходнаяНакладнаяЗапасы.Номенклатура,
		|	ПриходнаяНакладнаяЗапасы.Партия,
		|	ПриходнаяНакладнаяЗапасы.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗапасы.Период КАК Период,
		|	втЗапасы.Регистратор КАК Регистратор,
		|	втЗапасы.НомерСтроки КАК НомерСтроки,
		|	втЗапасы.Активность КАК Активность,
		|	втЗапасы.ВидДвижения КАК ВидДвижения,
		|	втЗапасы.Организация КАК Организация,
		|	втЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	втЗапасы.СчетУчета КАК СчетУчета,
		|	втЗапасы.Номенклатура КАК Номенклатура,
		|	втЗапасы.Характеристика КАК Характеристика,
		|	втЗапасы.Партия КАК Партия,
		|	втЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	втЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
		|	втЗапасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	втЗапасы.Проект КАК Проект,
		|	втЗапасы.Количество КАК Количество,
		|	ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаВал,
		|	втЗапасы.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
		|	втЗапасы.КоррСчетУчета КАК КоррСчетУчета,
		|	втЗапасы.КоррНоменклатура КАК КоррНоменклатура,
		|	втЗапасы.КоррХарактеристика КАК КоррХарактеристика,
		|	втЗапасы.КоррПартия КАК КоррПартия,
		|	втЗапасы.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
		|	втЗапасы.Спецификация КАК Спецификация,
		|	втЗапасы.КоррСпецификация КАК КоррСпецификация,
		|	втЗапасы.ЗаказПродажи КАК ЗаказПродажи,
		|	втЗапасы.ДокументПродажи КАК ДокументПродажи,
		|	втЗапасы.Подразделение КАК Подразделение,
		|	втЗапасы.Ответственный КАК Ответственный,
		|	втЗапасы.СтавкаНДС КАК СтавкаНДС,
		|	втЗапасы.ФиксированнаяСтоимость КАК ФиксированнаяСтоимость,
		|	втЗапасы.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
		|	втЗапасы.Возврат КАК Возврат,
		|	втЗапасы.СодержаниеПроводки КАК СодержаниеПроводки,
		|	втЗапасы.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
		|	втЗапасы.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	втЗапасы.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
		|	втЗапасы.Резервирование КАК Резервирование,
		|	втЗапасы.КоррПроект КАК КоррПроект
		|ИЗ
		|	втЗапасыДокумента КАК ПриходнаяНакладнаяЗапасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗапасы КАК втЗапасы
		|		ПО ПриходнаяНакладнаяЗапасы.Номенклатура = втЗапасы.Номенклатура
		|			И ПриходнаяНакладнаяЗапасы.Характеристика = втЗапасы.Характеристика
		|			И ПриходнаяНакладнаяЗапасы.Партия = втЗапасы.Партия");
	Запрос.УстановитьПараметр("ТаблицаЗапасы", ТаблицаЗапасы);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
	
