
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыВызова = Новый Структура("Источник,  Окно");
	ЗаполнитьЗначенияСвойств(ПараметрыВызова, ПараметрыВыполненияКоманды);
	
	ПараметрыВызова.Вставить("Уникальность", "Панель_ОПТИМУС_Дистрибуция");
	
	//--------------------------------------------------------------------------
	// © Шишка В.В. [5 мая 2022]  НАЧАЛО
	//ВариантыОтчетовКлиент.ОткрытьПанельОтчетов("ОПТИМУС_Дистрибуция", НСТР("ka='დისტრიბუცია';ru='Мобильная торговля';en='Mobile trading'"), ПараметрыВызова);
	ПараметрыВызова.Вставить("НавигационнаяСсылка", ПолучитьСсылкуИдентификаторПодсистемы());
	ПараметрыВызова.Вставить("ТекущийРазделСсылка", ПараметрыВызова.НавигационнаяСсылка);
	ВариантыОтчетовКлиент.ПоказатьПанельОтчетов("ТекущийРазделСсылка", ПараметрыВызова, НСТР("ka='დისტრიბუცია';ru='Мобильная торговля';en='Mobile trading'"));
	// © Шишка В.В. [5 мая 2022]  КОНЕЦ
	//--------------------------------------------------------------------------
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуИдентификаторПодсистемы()

	Возврат Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("Имя", "Дистрибуция");	

КонецФункции // ПолучитьСсылкуИдентификаторПодсистемы()
 
