
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	РазблокироватьРаботуСВнешнимиРесурсамиСервер();
	
	ПоказатьОповещениеПользователя(
		НСтр("ka='ბლოკის მოხსნა';ru='Разблокировка';en='unlocking'"),
		,
		НСтр("ka='გარე რესურსებთან მუშაობა განბლოკილია';ru='Работа с внешними ресурсами разблокирована';en='Working with external resources unlocked'"),
		БиблиотекаКартинок.Информация32
	);
	
КонецПроцедуры

&НаСервере
Процедура РазблокироватьРаботуСВнешнимиРесурсамиСервер()
	
	РегламентныеЗаданияСлужебный.РазрешитьРаботуСВнешнимиРесурсами();
	
КонецПроцедуры
