                         
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Идентификатор", Идентификатор);
	Параметры.Свойство("ДрайверОборудования", ДрайверОборудования);
	
	Заголовок = НСтр("ka='აღჭურვილობა:';ru='Оборудование:';en='Equipment:'") + Символы.НПП  + Строка(Идентификатор);
	
	ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	ЦветОшибки = ЦветаСтиля.ЦветОтрицательногоЧисла;
	
	СписокТипВесов = Элементы.ТипВесов.СписокВыбора;
	СписокТипВесов.Добавить("3",  НСтр("ka='შტრიქი АС';ru='Штрих АС';en='bar speaker'"));
	СписокТипВесов.Добавить("5",  НСтр("ka='შტრიხი АС POS';ru='Штрих АС POS';en='Bar AC POS'"));
	СписокТипВесов.Добавить("11", НСтр("ka='შტრიხი POS2';ru='Штрих POS2';en='Barcode POS2'"));
	
	СписокПорт = Элементы.Порт.СписокВыбора;
	Для Номер = 1 По 64 Цикл
		СписокПорт.Добавить(Номер, "COM" + Формат(Номер, "ЧЦ=2; ЧДЦ=0; ЧН=0; ЧГ=0"));
	КонецЦикла;
	
	СписокСкорость = Элементы.Скорость.СписокВыбора;
	СписокСкорость.Добавить(3,  "1200");
	СписокСкорость.Добавить(4,  "2400");
	СписокСкорость.Добавить(5,  "4800");
	СписокСкорость.Добавить(7,  "9600");
	
	СписокЧетность = Элементы.Четность.СписокВыбора;
	СписокЧетность.Добавить(0, НСтр("ka='არა';ru='Нет';en='Not'"));
	СписокЧетность.Добавить(1, НСтр("ka='კენტობა';ru='Нечетность';en='oddness'"));
	СписокЧетность.Добавить(2, НСтр("ka='ლუწობა';ru='Четность';en='Parity'"));
	
	времПорт         = Неопределено;
	времСкорость     = Неопределено;
	времЧетность     = Неопределено;
	времТипВесов     = Неопределено;
	времНаименование = Неопределено;
	
	Параметры.ПараметрыОборудования.Свойство("Порт"        , времПорт);
	Параметры.ПараметрыОборудования.Свойство("Скорость"    , времСкорость);
	Параметры.ПараметрыОборудования.Свойство("Четность"    , времЧетность);
	Параметры.ПараметрыОборудования.Свойство("ТипВесов"    , времТипВесов);
	Параметры.ПараметрыОборудования.Свойство("Наименование", времНаименование);
	
	Порт         = ?(времПорт         = Неопределено, 1, времПорт);
	Скорость     = ?(времСкорость     = Неопределено, 7, времСкорость);
	Четность     = ?(времЧетность     = Неопределено, 0, времЧетность);
	ТипВесов     = ?(времТипВесов     = Неопределено, Элементы.ТипВесов.СписокВыбора[0].Значение, времТипВесов);
	Наименование = ?(времНаименование = Неопределено, Элементы.ТипВесов.СписокВыбора[0].Представление, времНаименование);
	
	Элементы.ТестУстройства.Видимость    = (ПараметрыСеанса.РабочееМестоКлиента = Идентификатор.РабочееМесто);
	Элементы.УстановитьДрайвер.Видимость = (ПараметрыСеанса.РабочееМестоКлиента = Идентификатор.РабочееМесто);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьИнформациюОДрайвере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МодельОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Наименование = Элементы.ТипВесов.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение).Представление;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()

	НовыеЗначениеПараметров = Новый Структура;
	НовыеЗначениеПараметров.Вставить("Порт"         , Порт);
	НовыеЗначениеПараметров.Вставить("Скорость"     , Скорость);
	НовыеЗначениеПараметров.Вставить("Четность"     , Четность);
	НовыеЗначениеПараметров.Вставить("ТипВесов"     , ТипВесов);
	НовыеЗначениеПараметров.Вставить("Наименование" , Наименование);
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("ПараметрыОборудования", НовыеЗначениеПараметров);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДрайверИзАрхиваПриЗавершении(Результат) Экспорт 
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Установка драйвера завершена.';ru='Установка драйвера завершена.';en='Installation is complete driver.'")); 
	ОбновитьИнформациюОДрайвере();
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьДрайверИзДистрибутиваПриЗавершении(Результат, Параметры) Экспорт 
	
	Если Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Установка драйвера завершена.';ru='Установка драйвера завершена.';en='Installation is complete driver.'")); 
		ОбновитьИнформациюОДрайвере();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='При установке драйвера из дистрибутива произошла ошибка.';ru='При установке драйвера из дистрибутива произошла ошибка.';en='An error occurred while installing the driver from the distribution.'")); 
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура УстановитьДрайвер(Команда)

	ОчиститьСообщения();
	ОповещенияДрайверИзДистрибутиваПриЗавершении = Новый ОписаниеОповещения("УстановитьДрайверИзДистрибутиваПриЗавершении", ЭтотОбъект);
	ОповещенияДрайверИзАрхиваПриЗавершении = Новый ОписаниеОповещения("УстановитьДрайверИзАрхиваПриЗавершении", ЭтотОбъект);
	МенеджерОборудованияКлиент.УстановитьДрайвер(ДрайверОборудования, ОповещенияДрайверИзДистрибутиваПриЗавершении, ОповещенияДрайверИзАрхиваПриЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестУстройства(Команда)

	ОчиститьСообщения();
	
	РезультатТеста = Неопределено;

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Порт"         , Порт);
	времПараметрыУстройства.Вставить("Скорость"     , Скорость);
	времПараметрыУстройства.Вставить("Четность"     , Четность);
	времПараметрыУстройства.Вставить("ТипВесов"     , ТипВесов);
	времПараметрыУстройства.Вставить("Наименование" , Наименование);

	Результат = МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("CheckHealth",
	                                                                      ВходныеПараметры,
	                                                                      ВыходныеПараметры,
	                                                                      Идентификатор,
	                                                                      времПараметрыУстройства);

	ДополнительноеОписание = ?(ТипЗнч(ВыходныеПараметры) = Тип("Массив")
	                           И ВыходныеПараметры.Количество(),
	                           НСтр("ka='დამატებითი აღწერილობა:';ru='Дополнительное описание:';en='Additional description:'") + " " + ВыходныеПараметры[1],
	                           "");
	Если Результат Тогда
		ТекстСообщения = НСтр("ka='ტესტი წარმატებით შესრულდა.%ПереводСтроки%%ДополнительноеОписание%';ru='Тест успешно выполнен.%ПереводСтроки%%ДополнительноеОписание%';en='The test was completed successfully. %%% PerevodStroki DopolnitelnoeOpisanie%'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПереводСтроки%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                  "",
		                                                                  Символы.ПС));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                           "",
		                                                                           ДополнительноеОписание));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ka='ტესტი არ არის გავლილი.%ПереводСтроки%%ДополнительноеОписание%';ru='Тест не пройден.%ПереводСтроки%%ДополнительноеОписание%';en='Fail. %%% PerevodStroki DopolnitelnoeOpisanie%'");
	
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПереводСтроки%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                  "",
		                                                                  Символы.ПС));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                           "",
		                                                                           ДополнительноеОписание));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьИнформациюОДрайвере()

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Порт"        , Порт);
	времПараметрыУстройства.Вставить("Скорость"    , Скорость);
	времПараметрыУстройства.Вставить("Четность"    , Четность);
	времПараметрыУстройства.Вставить("ТипВесов"    , ТипВесов);
	времПараметрыУстройства.Вставить("Наименование", Наименование);

	Если МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("ПолучитьВерсиюДрайвера",
	                                                               ВходныеПараметры,
	                                                               ВыходныеПараметры,
	                                                               Идентификатор,
	                                                               времПараметрыУстройства) Тогда
		Драйвер = ВыходныеПараметры[0];
		Версия  = ВыходныеПараметры[1];
	Иначе
		Драйвер = ВыходныеПараметры[2];
		Версия  = НСтр("ka='გაურკვეველია';ru='Не определена';en='Not determined'");
	КонецЕсли;

	Элементы.Драйвер.ЦветТекста = ?(Драйвер = НСтр("ka='არ არის დაყენებული';ru='Не установлен';en='Not installed'"), ЦветОшибки, ЦветТекста);
	Элементы.Версия.ЦветТекста  = ?(Версия  = НСтр("ka='გაურკვეველია';ru='Не определена';en='Not determined'"), ЦветОшибки, ЦветТекста);

	Элементы.УстановитьДрайвер.Доступность = Не (Драйвер = НСтр("ka='დაყენებულია';ru='Установлен';en='Set'"));

КонецПроцедуры

#КонецОбласти