
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ИзменитьПарольНаСервере(Nonce)
	
	Перем mhttp;
	
	Сервер = "https://tbconline.ge/dbi/dbiService";
	
	Если mhttp = Неопределено Тогда
		mhttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1"); 
	Конецесли;
	
	mhttp.SetTimeouts(6000000, 6000000, 6000000, 6000000);
	
	mhttp.open("POST", Сервер, False);
	
	mhttp.setRequestHeader("Accept-Encoding", "gzip,deflate");
	mhttp.setRequestHeader("Content-Type"	, "text/xml; charset=utf-8");
	mhttp.setRequestHeader("SoapAction"		, "http://www.mygemini.com/schemas/mygemini/ChangePassword");
	mhttp.setRequestHeader("Connection"		, "Keep-Alive");
	mhttp.setRequestHeader("User-Agent"		, "Apache-HttpClient/4.1.1 (java 1.5)");
	
	
	xml = 
	"<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:myg=""http://www.mygemini.com/schemas/mygemini"" xmlns:wsse=""http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"">"
	+"<soapenv:Header>"
	+"<wsse:Security>"
	+"<wsse:UsernameToken>"
	+"<wsse:Username>"+СокрЛП(User)+"</wsse:Username>"
	+"<wsse:Password>"+СокрЛП(Password)+"</wsse:Password>"
	+"<wsse:Nonce>"+СокрЛП(Nonce)+"</wsse:Nonce>"
	+"</wsse:UsernameToken>"
	+"</wsse:Security>"
	+"</soapenv:Header>"
	+"<soapenv:Body>"
	+"<myg:ChangePasswordRequestIo>"
	+"<myg:newPassword>"+СокрЛП(NewPassword)+"</myg:newPassword>"
	+"</myg:ChangePasswordRequestIo>"
	+"</soapenv:Body>"
	+"</soapenv:Envelope>";
	
	mhttp.send(xml);
	res = mhttp.WaitForResponse();
	
	СтрокаJSONРезультат = mhttp.responseText;
	
	Если СтрНайти(СтрокаJSONРезультат, "Error 500") > 0 Тогда
		Сообщить(НСтр("ka='შეცდომა მოთხოვნის გაგზავნისას';ru='Ошибка отправки запроса'") + Символы.НПП + СтрокаJSONРезультат);
	КонецЕсли;
	
	ТэгМетода = "ns2:" + "ChangePassword" + "ResponseIo";
	ПозицНачТега = СтрНайти(СтрокаJSONРезультат, "<"+ТэгМетода);
	ПозицНачОшибки = СтрНайти(СтрокаJSONРезультат, "<faultstring");
	Если ПозицНачТега <> 0 Тогда 
		ДлинаКон = СтрДлина("</"+ТэгМетода+">");
		ПозцКон = СтрНайти(СтрокаJSONРезультат, "</"+ТэгМетода+">");
		СтрокаJSONРезультат = Сред(СтрокаJSONРезультат,ПозицНачТега, ПозцКон + ДлинаКон - ПозицНачТега);
	ИначеЕсли ПозицНачОшибки <> 0 Тогда
		//Вытянем текст Ошибки
		ДлинаКон = СтрДлина("</faultstring>");
		ПозцКон = СтрНайти(СтрокаJSONРезультат, "</faultstring>");
		ДлиннаНачТега = 27;
		ТекстОшибки = Сред(СтрокаJSONРезультат, ПозицНачОшибки + ДлиннаНачТега, ПозцКон - (ПозицНачОшибки+ДлиннаНачТега));
		
		Сообщить(ТекстОшибки);	
		Возврат;
	КонецЕсли;
	
	ПутьКВременномуФайлуОтвета = ПолучитьИмяВременногоФайла("xml"); 
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.ОткрытьФайл(ПутьКВременномуФайлуОтвета);
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();    
	
	ЗаписьXML.ЗаписатьБезОбработки(СтрокаJSONРезультат);
	
	ЗаписьXML.Закрыть();
	
	///////////////////////////////////
	//Прочитаем
	
	СтруктураОтвета = ПрочитатьФайлОтвета(ПутьКВременномуФайлуОтвета);
	
	//УдалитьФайлы(ПутьКВременномуФайлуОтвета);
	//      СтруктураОтвета = Новый Структура;
	//Для Каждого Элем Из СтруктураОтвета Цикл 
	//	
	//	Сообщить(Элем.Ключ + " ,,,,, " + Элем.Значение);
	//	
	//	Если ТипЗнч(Элем.Значение) = Тип("Массив") Тогда 
	Если СтруктураОтвета.Свойство("message") Тогда 
		Сообщить(СтруктураОтвета.message+Символы.ПС+"Внесите новый пароль в настройки пользователя и перезайдите в обработку");
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Функция ПрочитатьФайлОтвета(ПутьКФайлу)
	
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	
	СтрокаXML = ЧтениеТекста.Прочитать();
	
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	РезультатРазборки = Новый Массив;
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://schemas.xmlsoap.org/soap/envelope/", "Разборка");
	
	БлокXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	
	СтруктураОтвета = Новый Структура;
	
	ЗаполнитьСтруктуруОтветаРекурсиеей(БлокXDTO, СтруктураОтвета);
	
	Возврат СтруктураОтвета;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтруктуруОтветаРекурсиеей(ОбъектXDTO, СтруктураЗаполнения, КлючПредыдущейСтруктуры = "")
	
	Для Каждого Строк Из ОбъектXDTO.Свойства() Цикл 
		
		Если ТипЗнч(ОбъектXDTO[Строк.Имя]) = Тип("ОбъектXDTO") Тогда 
			СледующаяСтруктура = Новый Структура;
			СтруктураЗаполнения.Вставить(Строк.Имя, СледующаяСтруктура);
			ЗаполнитьСтруктуруОтветаРекурсиеей(ОбъектXDTO[Строк.Имя], СледующаяСтруктура, Строк.Имя);
		ИначеЕсли ТипЗнч(ОбъектXDTO[Строк.Имя]) = Тип("СписокXDTO") Тогда
			
			МассивСтрокСписка = Новый Массив;
			
			
			Для Каждого СтрокаСписка Из (ОбъектXDTO[Строк.Имя]) Цикл 
				
				СледующаяСтруктура = Новый Структура;
				СтруктураЗаполнения.Вставить(Строк.Имя, СледующаяСтруктура);
				ЗаполнитьСтруктуруОтветаРекурсиеей(СтрокаСписка, СледующаяСтруктура, Строк.Имя);
				МассивСтрокСписка.Добавить(СледующаяСтруктура)
					
			КонецЦикла;
			
			СтруктураЗаполнения.Вставить(Строк.Имя, МассивСтрокСписка)
			
		ИначеЕсли ТипЗнч(ОбъектXDTO[Строк.Имя]) = Тип("Строка") Тогда 
			//Если КлючПредыдущейСтруктуры <> "" Тогда 
				СтруктураЗаполнения.Вставить(Строк.Имя, ОбъектXDTO[Строк.Имя]);
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры



&НаКлиенте
Процедура ИзменитьПароль(Команда)
	
	Nonce = "";
	Подсказка = НСтр("ka='შეიყვანეთ DigiPass –ის პაროლი';ru='Введите пароль DigiPass!'");
	Если НЕ ВвестиСтроку(Nonce, Подсказка, 0, Истина) Тогда
		// запомнить текст напоминания
		Возврат;
	КонецЕсли;
	
	ИзменитьПарольНаСервере(Nonce);
КонецПроцедуры

&НаКлиенте
Процедура NewPasswordConfirmationПриИзменении(Элемент)
	Элементы.ФормаИзменитьПароль.Доступность = NewPassword = NewPasswordConfirmation;
КонецПроцедуры
