
Функция ПроцентУсушкиУжеСуществует(ТекущийПроцентУсушки) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ИСТИНА;

	Если ТипЗНЧ(ТекущийПроцентУсушки) = Тип ("Число") Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Потери.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Потери КАК Потери
		|ГДЕ
		|	Потери.ПроцентУсушки = &ПроцентУсушки";
		
		Запрос.УстановитьПараметр("ПроцентУсушки", ТекущийПроцентУсушки);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		РЕЗ = НЕ РезультатЗапроса.Пустой();

	КонецЕсли;

	Возврат РЕЗ;
КонецФункции