
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ТолькоПросмотр = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	
	ТолькоПросмотр = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеРегистра(Команда)
	
	ЕстьИзменения = Ложь;
	
	ОбновитьДанныеРегистраНаСервере(ЕстьИзменения);
	
	Если ЕстьИзменения Тогда
		Текст = НСтр("ka='განახლება წარმატებით შესრულდა.';ru='Обновление выполнено успешно.';en='The update was successful.'");
	Иначе
		Текст = НСтр("ka='განახლება არ არის საჭირო.';ru='Обновление не требуется.';en='The update is not required.'");
	КонецЕсли;
	
	ПоказатьПредупреждение(, Текст);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ОформитьГруппуДанных(0, НСтр("ka='წვდომის სტანდარტული მნიშვნელობები';ru='Стандартные значения доступа';en='Typical values ​​of access'"));
	ОформитьГруппуДанных(1, НСтр("ka='ჩვეულებრივი/გარე მომხმარებლები';ru='Обычные/внешние пользователи';en='Conventional / external users'"));
	ОформитьГруппуДанных(2, НСтр("ka='მომხმარებლების ჩვეულებრივი/გარე ჯგუფები';ru='Обычные/внешние группы пользователей';en='Conventional / external user groups'"));
	ОформитьГруппуДанных(3, НСтр("ka='შემსრულებლების ჯგუფი';ru='Группы исполнителей';en='artists group'"));
	ОформитьГруппуДанных(4, НСтр("ka='ავტორიზაციის ობიექტები';ru='Объекты авторизации';en='authorization Objects'"));
	
КонецПроцедуры

&НаСервере
Процедура ОформитьГруппуДанных(ГруппаДанных, Текст)
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокГруппаДанных.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ГруппаДанных");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ГруппаДанных;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Текст);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеРегистраНаСервере(ЕстьИзменения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегистрыСведений.ГруппыЗначенийДоступа.ОбновитьДанныеРегистра(ЕстьИзменения);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
