//////////////////////////////////////////////////////////////////////////////////////////////////////
//TransLink.iQ ECR Версия: <v1.0.7> 
//Техническое описание  Дата: <27.06.2023> 
//USHBURN International 
//Group Penki Continentai
///////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс   

#Область Коды_TypeResult  //2.5.2 Коды ошибок, передаваемых в объекте ТypeResult

//Операция завершена успешно. Любое другое значение (в том числе null или 
//пустая строка) означает, что операция завершилась неудачно. 
Функция TypeResult_OK() Экспорт
	Возврат "OK";
КонецФункции	

//Один из аргументов недействителен. (Например, DocumentNr равен null или пуст).
Функция TypeResult_INVALID_ARG() Экспорт
	Возврат "INVALID_ARG";
КонецФункции	

//Отсутствие соединения с устройством Ashburn POS или другие проблемы с подключением. 
Функция TypeResult_CONNECTION_ERROR() Экспорт
	Возврат "CONNECTION_ERROR";
КонецФункции	

//Таймаут ожидания завершения операции. 
Функция TypeResult_TIMEOUT() Экспорт
	Возврат "TIMEOUT";
КонецФункции	

//Пример: В версиях v101-103 метод OpenPos вызывается, даже если 
//предыдущая сессия еще не была закрыта. С началом версии v104, по 
//умолчанию OpenPos будет возвращать текущий токен. Однако это 
//поведение можно изменить, включив опцию OnlyOneActiveSession в 
//настройках установки. 
Функция TypeResult_ANOTHER_OPERATION_IN_PROGRESS() Экспорт
	Возврат "ANOTHER_OPERATION_IN_PROGRESS";
КонецФункции	

//Операция была отклонена. 
Функция TypeResult_DECLINED() Экспорт
	Возврат "DECLINED";
КонецФункции	

//openpos метод не был вызван. 
Функция TypeResult_NOT_INITILIAZED() Экспорт
	Возврат "NOT_INITILIAZED";
КонецФункции	

#КонецОбласти //Коды_TypeResult

Функция posOperation_NOOPERATION() Экспорт
	Возврат "NOOPERATION";
КонецФункции	

#Область ВидыОпераций
Функция posOperation_AUTHORIZE() Экспорт
	Возврат "AUTHORIZE";
КонецФункции	

Функция posOperation_PREAUTHORIZE() Экспорт
	Возврат "PREAUTHORIZE";
КонецФункции	

Функция posOperation_CREDIT() Экспорт
	Возврат "CREDIT";
КонецФункции	

Функция posOperation_INQUIRY() Экспорт
	Возврат "INQUIRY";
КонецФункции	

Функция posOperation_CARDREAD() Экспорт
	Возврат "CARDREAD";
КонецФункции	

Функция posOperation_MANUALENTRY() Экспорт
	Возврат "MANUALENTRY";
КонецФункции	

Функция transactionState_Approved() Экспорт
	Возврат "Approved";
КонецФункции	

Функция transactionState_Declined() Экспорт
	Возврат "Declined";
КонецФункции	

Функция transactionStatus_Approved() Экспорт
	Возврат "Approved";
КонецФункции	

Функция transactionStatus_Declined() Экспорт
	Возврат "Declined";
КонецФункции	


Функция transactionStatus_Voiding() Экспорт
	Возврат "Voiding";
КонецФункции	

Функция transactionStatus_Notfound() Экспорт
	Возврат "Notfound";
КонецФункции	

Функция transactionStatus_Authorizing() Экспорт
	Возврат "Authorizing";
КонецФункции	


Функция transactionStatus_Timeout() Экспорт
	Возврат "Timeout";
КонецФункции	

Функция transactionStatus_Reversing() Экспорт
	Возврат "Reversing";
КонецФункции	

Функция transactionStatus_Reversed() Экспорт
	Возврат "Reversed";
КонецФункции	




#КонецОбласти   //ВидыОпераций

//Языки
Функция ПолучитьСписокПоддерживаемыхЯзыков() Экспорт

	СписокВыбора = Новый Соответствие;
	СписокВыбора.Вставить("EN","English");
	СписокВыбора.Вставить("LT","Lithuanian");
	СписокВыбора.Вставить("RU","Russian");
	СписокВыбора.Вставить("LV","Latvian");
	СписокВыбора.Вставить("EE","Estonian");
	СписокВыбора.Вставить("TM","Turkmen");
	СписокВыбора.Вставить("TJ","Tajik");
	СписокВыбора.Вставить("GE","Georgian");
	СписокВыбора.Вставить("KZ","Kazakh");
	СписокВыбора.Вставить("AZ","Azerbaijani");
	СписокВыбора.Вставить("UZ","Uzbek");
	Возврат СписокВыбора;
    
КонецФункции	

Функция ПолучитьСписокПоддерживаемыхВалют() Экспорт
	
	СписокВыбора = Новый Соответствие;
	СписокВыбора.Вставить("981", "GEL");
	//СписокВыбора.Вставить("840", "USD");
	//СписокВыбора.Вставить("978", "EUR");
	//СписокВыбора.Вставить("934", "TMT");
	//СписокВыбора.Вставить("972", "TJS");
	//СписокВыбора.Вставить("398", "KZT");
	//СписокВыбора.Вставить("944", "AZN");
	//СписокВыбора.Вставить("860", "UZS");
	СписокВыбора.Вставить("205", "PLUS");
		
	Возврат СписокВыбора;
	
КонецФункции	




Функция КомандаТерминалу_CLOSEPOS(Параметры) Экспорт

//4.1.1 TypeResult 	
//{ 
//"resultCode": "NotFound",      
//"resultMessage": "Transaction is not found, does not exists", 
//"resultTime": "20191224152644"
//} 
	
	ПараметрыКоманды = ПараметрыКомандыREST();
	ПараметрыКоманды.Метод = "POST"; 
	ПараметрыКоманды.ИмяФункции = "/closepos";  //4.4 Метод closepos 
	
	СтруктураОтвета = ПослатьЗапросНаТерминал_Rest(ПараметрыКоманды, Параметры);
		
	Возврат Ложь;
	
КонецФункции

Функция КомандаТерминалу_GETSOFTWAREVERSION(Параметры) Экспорт
	
	Результат = Ложь;
	
	ПараметрыКоманды = TransLinkRESTAPI.ПараметрыКомандыREST();
	ПараметрыКоманды.Метод = "GET"; 
	ПараметрыКоманды.ИмяФункции = "/getsoftwareversions"; //4.2 Метод getsoftwareversions 
		
	СтруктураОтвета = ПослатьЗапросНаТерминал_Rest(ПараметрыКоманды, Параметры);
		
	Возврат СтруктураОтвета;
   
КонецФункции

//Открытие терминала и получение ключа авторизации
Функция КомандаТерминалу_OPENPOS(Параметры) Экспорт

	РезультатПодключения = Ложь;

	ПараметрыКоманды = ПараметрыКомандыREST();
	ПараметрыКоманды.Метод = "POST"; 
	ПараметрыКоманды.ИмяФункции = "/openpos";
	
	СтруктураОтвета = ПослатьЗапросНаТерминал_Rest(ПараметрыКоманды, Параметры);
	
	Если СтруктураОтвета.ОТВЕТ.Выполнен и Параметры.Свойство("accessToken") и ЗначениеЗаполнено(Параметры.accessToken) ТОгда
		РезультатПодключения = Истина;
	КонецЕсли;	
	
 	Возврат РезультатПодключения;
	
КонецФункции



//Команда выполняет разблокировку POS, для выполнения последующих операций. 
//Данная команда должна выполняться перед началом любой операцией расчёта, инициированной с ECR.  
//4.5.1 UNLOCKDEVICE 
Функция КомандаТерминалу_UNLOCKDEVICE(ДанныеДокумента, Параметры) Экспорт
	
	ИмяКоменды = "UNLOCKDEVICE";                       
	
	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные
	ПараметрыКоманды.Вставить("posOperation", ДанныеДокумента.posOperation);  //AUTHORIZE, NOOPERATION , AUTHORIZE , PREAUTHORIZE , CREDIT , INQUIRY , CARDREAD , MANUALENTRY 
	ПараметрыКоманды.Вставить("amount", Цел(ДанныеДокумента.Сумма * 100)); 				//сумма в центах
	
	ПараметрыКоманды.Вставить("idleText", Параметры.idleText_UnlockDevice);
	
	ПараметрыКоманды.Вставить("language", Параметры.language);
	ПараметрыКоманды.Вставить("ecrVersion", ecrVersion(Параметры));
	
	//Не Обязательные
	ПараметрыКоманды.Вставить("currencyCode",Параметры.currencyCode); 
	Если ДанныеДокумента.Свойство("СуммаВозврата") Тогда	
		ПараметрыКоманды.Вставить("cashBackAmount", Цел(ДанныеДокумента.СуммаВозврата * 100)); //Сумма Cashback. 
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Параметры.operatorId) Тогда
		ПараметрыКоманды.Вставить("operatorId", Параметры.operatorId);
	КонецЕсли;	
	Если ЗначениеЗаполнено(Параметры.operatorName) Тогда
		ПараметрыКоманды.Вставить("operatorName", Параметры.operatorName);
	КонецЕсли;
	Если Параметры.cardTechs.Количество()>0 Тогда
		ПараметрыКоманды.Вставить("cardTechs", Параметры.cardTechs);
	КонецЕсли;	
	Если Параметры.enabledTranSourceMedias.Количество()>0 Тогда
		ПараметрыКоманды.Вставить("enabledTranSourceMedias", Параметры.enabledTranSourceMedias);
	КонецЕсли;
	
	ПараметрыКоманды.Вставить("silentCardRead", Параметры.silentCardRead);  //Звуковой сигнал
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции	

//Команда выполняет блокировку POS, с возможностью отображения на экране сообщения, переданного в параметре idleText. 
//4.5.2 LOCKDEVICE
Функция КомандаТерминалу_LOCKDEVICE(Параметры) Экспорт 
	
	ИмяКоменды = "LOCKDEVICE";                       
	
	ПараметрыКоманды = Новый Структура; 
	ПараметрыКоманды.Вставить("idleText", Параметры.idleText_LockDevice);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;

КонецФункции

//Отправляем команду терминалу начать взаимодействовать с пользователем
//в зависимости от вида операции
функция КомандаТерминалуНачатьДействие(ДанныеДокумента, ВходныеПараметры, Параметры) Экспорт 
	
	Результат = Ложь;
	
	Если ДанныеДокумента.posOperation = TransLinkRESTAPI.posOperation_AUTHORIZE() Тогда         
		//Обычная продажа
		Результат = КомандаТерминалу_AUTHORIZE(ДанныеДокумента, ВходныеПараметры, Параметры);
	ИначеЕсли ДанныеДокумента.posOperation = TransLinkRESTAPI.posOperation_CREDIT() Тогда
		//Возврат денег на карту
		Результат = КомандаТерминалу_CREDIT(ДанныеДокумента, ВходныеПараметры, Параметры);		
		
	ИначеЕсли ДанныеДокумента.posOperation = TransLinkRESTAPI.posOperation_PREAUTHORIZE() Тогда
		//предавторизация
		Результат = КомандаТерминалу_PREAUTHORIZE(ДанныеДокумента, ВходныеПараметры, Параметры);		
		
	ИначеЕсли ДанныеДокумента.posOperation = TransLinkRESTAPI.posOperation_INQUIRY() Тогда
		//предавторизация
		Результат = КомандаТерминалу_INQUIRYBALANCE(ВходныеПараметры, Параметры);		
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

//Команда инициирует процедуру авторизации (оплата покупок) на POS. 
//4.5.3 AUTHORIZE
Функция КомандаТерминалу_AUTHORIZE(ДанныеДокумента, ВходныеПараметры, Параметры)
	
	ИмяКоменды = "AUTHORIZE";                       
	
	ПараметрыКоманды = Новый Структура; 
	//Обязательные
	ПараметрыКоманды.Вставить("amount", Цел(ДанныеДокумента.Сумма * 100)); 	//сумма в центах
	ПараметрыКоманды.Вставить("currencyCode", Параметры.currencyCode);
	ПараметрыКоманды.Вставить("documentNr", ДанныеДокумента.documentNr);  //Номер платежного документа (уникальный номер в течение банковского дня).
	
	//Не Обязательные
	//ПараметрыКоманды.Вставить("cashBackAmount", Цел(ВходныеПараметры.CashbackAmount * 100)); //Сумма Cashback. 
    //ПараметрыКоманды.Вставить("panL4Digit",); 
	//ПараметрыКоманды.Вставить("ecrData",);
	
	//Комментарий:
	//panL4Digit - 4 последние цифры PAN , которые введены  на устройстве ECR, оператором кассы. 
	//Данное требование может быть инициировано POS, при передаче события ONCARD. 
	
	//ecrData - Дополнительные данные, передаваемые в авторотационном сообщении для эквайера. До 1000 байт в формате UTF-8. 
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции


//Команда инициирует запрос прeавторизации на POS.  Метод может быть вызван после получения события ONCARD и в случае 
//когда установлен  allowPreAuthorize – флаг разрешения операции прeавторизации. 
//4.5.4 PREAUTHORIZE 
Функция КомандаТерминалу_PREAUTHORIZE(ДанныеДокумента, ВходныеПараметры, Параметры)
	
	ИмяКоменды = "PREAUTHORIZE";                       

	ПараметрыКоманды = Новый Структура; 
	//Обязательные
	ПараметрыКоманды.Вставить("amount", Цел(ДанныеДокумента.Сумма * 100)); 	//сумма в центах
	ПараметрыКоманды.Вставить("currencyCode", Параметры.currencyCode);
	ПараметрыКоманды.Вставить("documentNr", ДанныеДокумента.documentNr);  //Номер платежного документа (уникальный номер в течение банковского дня).
	
	//Не Обязательные
	//ПараметрыКоманды.Вставить("panL4Digit",); 
	//ПараметрыКоманды.Вставить("ecrData",);
	
	//Комментарий:
	//panL4Digit - 4 последние цифры PAN , которые введены  на устройстве ECR, оператором кассы. 
	//Данное требование может быть инициировано POS, при передаче события ONCARD. 
	
	//ecrData - Дополнительные данные, передаваемые в авторотационном сообщении для эквайера. До 1000 байт в формате UTF-8. 
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции


//Команда инициирует запрос на POS для увеличения суммы ранее подтвержденной прeавторизации.  
//4.5.5 INCREMENT 
Функция КомандаТерминалу_INCREMENT(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "INCREMENT";                       

	ПараметрыКоманды = Новый Структура; 
	//Обязательные
	ПараметрыКоманды.Вставить("amount", Цел(ВходныеПараметры.Сумма * 100)); 	//сумма в центах
	ПараметрыКоманды.Вставить("operationId", Параметры.operationId); //Идентификатор операции, полученный в ответе команды PREAUTHORIZE. 
	ПараметрыКоманды.Вставить("cryptogram", "2273827837287вавававав");  //Криптограмма транзакции
	
		
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Команда инициирует запрос подтверждения на POS ранее выполненной операции прeавторизации.   
//4.5.6 COMPLETE 
//После завершения преавторизации командой Complete, повторный вызов команд Increment или Complete недопустим. 
//Для проверки состояния преавторизации можно использовать GetTrnStatus. В случае завершённой преавторизации в 
//атрибуте state будет значение Settled. Для аннулирования завершённой преавторизации нужно использовать метод 
//Void. Для отмены (аннулирования) незавершённой преавторизации нужно использовать Complete с нулевой суммой. 
Функция КомандаТерминалу_COMPLETE(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "COMPLETE";                       

	ПараметрыКоманды = Новый Структура; 
	//Обязательные
	ПараметрыКоманды.Вставить("amount", Цел(ВходныеПараметры.Сумма * 100)); 	//сумма в центах
	ПараметрыКоманды.Вставить("operationId", Параметры.operationId); //Идентификатор операции, полученный в ответе команды PREAUTHORIZE. 
	ПараметрыКоманды.Вставить("cryptogram", "2273827837287вавававав");  //Криптограмма транзакции
	ПараметрыКоманды.Вставить("noShow", Ложь);  //Указывает на то, оплата взымается с держателя карты за непредставленные услуги.
	
		
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Команда запускает процедуру потребительского кредита по текущей платежной операции. Чтобы подготовить терминал к этой 
//операции, необходимо послать UNLOCKDEVICE с кодом операции 0 (NOOPERATION) с суммой 0.    
//4.5.7 INSTALLMENT 
Функция КомандаТерминалу_INSTALLMENT(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "INSTALLMENT";                       

	ПараметрыКоманды = Новый Структура; 
	//Обязательные параметры
	ПараметрыКоманды.Вставить("amount", Цел(ВходныеПараметры.Сумма * 100)); 	//сумма в центах
	ПараметрыКоманды.Вставить("installmentPaymentCount", 1); //Количество платежей по кредиту.  
	ПараметрыКоманды.Вставить("documentNr", "2273827837287вавававав");  //Номер платежного документа (уникальный номер в течение банковского дня, не более 30 буквенно-цифровых символов). 

	//Не обязательные параметры
	ПараметрыКоманды.Вставить("currencyCode", "981");
	//ПараметрыКоманды.Вставить("installmenProvider",); //Кредитор по умолчанию (эмитент карты). Другие значения:  M Kоммерсант; A Эквайер. 
	//ПараметрыКоманды.Вставить("panL4Digit",); 
	//ПараметрыКоманды.Вставить("ecrData",);
		
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции



//Команда инициирует на POS процедуру возврата средств на счета карты.     
//4.5.8 CREDIT                (REFUND)
Функция КомандаТерминалу_CREDIT(ПараметрыДокумента, Параметры, ПараметрыПодключения) 
	
	ИмяКоменды = "CREDIT";                       
	

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("amount", Цел(ПараметрыДокумента.Сумма * 100)); 	//сумма в центах
	ПараметрыКоманды.Вставить("currencyCode", Параметры.currencyCode);
	ПараметрыКоманды.Вставить("documentNr", ПараметрыДокумента.documentNr);  //Номер кассового чека. 
	ПараметрыКоманды.Вставить("installmentPaymentCount", 1); //Количество платежей по кредиту.  
	
	//Не обязательные параметры
	//ПараметрыКоманды.Вставить("panL4Digit",); 
	//ПараметрыКоманды.Вставить("time",);  // Время операции, для которой выполняется Refund формат yyyyMMddHHmmss. 
	//ПараметрыКоманды.Вставить("STAN",); // STAN Для которой выполняется CREDIT формат NNNNNN. 
	//ПараметрыКоманды.Вставить("RRN",);  //RRN  Для которой выполняется CREDIT UUUUUUUUUUUU. 
	//ПараметрыКоманды.Вставить("ecrData",);
	
	//Комментарий:
	//Параметры (time, STAN) запроса необходимо инициализировать в случае, когда событие OnCard   устанавливает 
	//reqOrignData.Параметр RRN запроса необходимо инициализировать в случае, когда событие OnCard   
	//устанавливает reqOrignRRN. 
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Отмена/аннулирование ранее авторизованной карточной транзакции.  Данная операция возможна в  течение текущего банковского дня.     
//4.5.9 VOID 
Функция КомандаТерминалу_VOID(ДанныеДокумента,ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	//ИмяКоменды = "VOID";                       
    ИмяКоменды = "Void";                       


	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("operationId", ДанныеДокумента.operationId); 	//Идентификатор операции, полученный в ответе команды AUTHORIZE. 	

	//ПараметрыКоманды.Вставить("VoidAmount", 0); 	//Идентификатор операции, полученный в ответе команды AUTHORIZE. 	
	//ПараметрыКоманды.Вставить("AmountAuthorised", Цел(ДанныеДокумента.Сумма * 100));
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Частичная отмена ранее авторизованной карточной операции.      
//4.5.10 VOIDPARTIAL 
Функция КомандаТерминалу_VOIDPARTIAL(ДанныеДокумента, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "VOIDPARTIAL";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("operationId", ДанныеДокумента.operationId); 	//Идентификатор операции, полученный в ответе команды AUTHORIZE. 	
	ПараметрыКоманды.Вставить("voidAmount", Цел(ДанныеДокумента.Сумма * 100)); 	//сумма в центах - Сумма void транзакции в валюте транзакции. 
	ПараметрыКоманды.Вставить("originalAmount", Цел(ДанныеДокумента.СуммаПервоначальная * 100)); 	//сумма в центах - Сумма авторизированной транзакции в валюте транзакции.
		
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Команда выполнения фискализации платежей.     
//4.5.11 FISCALIZE  
Функция КомандаТерминалу_FISCALIZE(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "FISCALIZE";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("documentNr", "2273827837287вавававав");  //Номер платежного документа (уникальный номер в течение банковского дня, не более 30 буквенноцифровых символов).  
	ПараметрыКоманды.Вставить("type", Цел(ВходныеПараметры.Сумма * 100)); 	//Вид фискальной операции.  
	
	//Не обязательные параметры
	//ПараметрыКоманды.Вставить("items",); //Товары покупки/возврата, включенные в фискальный чек.
	//ПараметрыКоманды.Вставить("exciseId",);  // Идентификатор акциза. 
	
	//Комментарий:\
	//type - Вид фискальной операции. Может иметь следующие значения
	//• CashDebit – Покупка за наличные 
	//• CashCredit – Возврат денежных средств 
	//• CardDebit – Покупка по карте 
	//• CardCredit – Возврат средств по карте. 	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Возвращает статус фискальной операции, если не был получен ответ на запрос FISCALIZE.     
//4.5.12 GETFISCALIZESTATE  
Функция КомандаТерминалу_GETFISCALIZESTATE(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "GETFISCALIZESTATE";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("documentNr", "2273827837287вавававав");  //Номер платежного документа (уникальный номер в течение банковского дня, не более 30 буквенноцифровых символов).  
	
	//Не обязательные параметры
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Команда выполняет печать чека на интегрированном принтере POS.      
//4.5.13 PRINT   
Функция КомандаТерминалу_PRINT(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "PRINT";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("receiptText", "TEST PRINTING");  //Текст. Если пусто-то вывдит текст из чека
	
	//Не обязательные параметры
	//ПараметрыКоманды.Вставить("documentNr", "2273827837287");  //Номер кассового чека. 
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции


//Команда выполняет отображение сообщения либо изображения на экране POS терминала.       
//4.5.14 DISPLAYMEDIA    
Функция КомандаТерминалу_DISPLAYMEDIA(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "DISPLAYMEDIA";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("displayText", "");  //Текст. Может быть пустым
	
	//Не обязательные параметры
	//ПараметрыКоманды.Вставить("imageId", "");  //Имя файла изображения без расширения. 
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции


//Команда выполняет вывод на экран POS терминала сообщение для ввода запрашиваемой информации. Результат ввода 
//информации передается в событие  ONDISPLAYPROMPTRESULT.       
//4.5.15 DISPLAYPROMPT    
Функция КомандаТерминалу_DISPLAYPROMPT(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "DISPLAYPROMPT";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("displayText", "");  //Текст. Может быть пустым
	ПараметрыКоманды.Вставить("inputMask", "");  //
	
	//Не обязательные параметры                    
	
	//Комментарий
	//Маска ввода запрашиваемой информации 
	//N – Числовой символ 
	//A – Только алфавитный символ ASCII 
	//U – Алфавитный или числовой символ Unicode. 
	//{ 
	//	"displayText": "Enter your year of birth",  
	//	"inputMask": "NNNN"   
	//}
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Команда отображает на экране POS терминала сообщение которое требует действие со стороны картодержателя. Например, 
//необходимо (нажать кнопку). Результат возвращается в событие ONDISPLAYMSGBOXRESULT.        
//4.5.16 DISPLAYMSGBOX    
Функция КомандаТерминалу_DISPLAYMSGBOX(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "DISPLAYMSGBOX";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("displayText", "Did you like the service?");  //Текст. Может быть пустым
	ПараметрыКоманды.Вставить("boxButtons", "YesNo");  //
	
	//Не обязательные параметры                    
	
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции


//Команда выполняет на экране POS терминала вывод сообщения со списком опций. Результат возвращается в событие ONDISPLAYSELECTRESULT.         
//4.5.17 DISPLAYSELECT     
Функция КомандаТерминалу_DISPLAYSELECT(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "DISPLAYSELECT";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("displayText", "Please select a complimentary gift");  //Текст. Может быть пустым
	ПараметрыКоманды.Вставить("options", новый Массив);  //массив вариантов
	
	//Не обязательные параметры                    
	
	
	ЗаполнитьЗначенияСвойств(ПараметрыКоманды, ВходныеПараметры.ПараметрыКоманды);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Команда предназначена для передачи введенной информации по событию ONPROMPT.          
//4.5.18 SETPROMPTINPUT      
Функция КомандаТерминалу_SETPROMPTINPUT(inputValue, Параметры)
	
	ИмяКоменды = "SETPROMPTINPUT";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("inputValue", "");  //Текст. Введенное значение. Может быть пустым
	
	//Не обязательные параметры                    
	
	
	//ЗаполнитьЗначенияСвойств(ПараметрыКоманды, ВходныеПараметры.ПараметрыКоманды);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции


//Команда предназначена для передачи введенной информации по событию ONMSGBOX.          
//4.5.19 SETMSGBOXKEY       
Функция КомандаТерминалу_SETMSGBOXKEY(keyValue, Параметры) 
	
	ИмяКоменды = "SETMSGBOXKEY";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("keyValue", keyValue);  //Значение, выбранное кассиром Поддерживаемые значения: ▪ ОК; ▪ YES; ▪ CANCEL; ▪ NO. 
	
	//Не обязательные параметры                    
	
	
	//ЗаполнитьЗначенияСвойств(ПараметрыКоманды, ВходныеПараметры.ПараметрыКоманды);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Команда предназначена для передачи введенной информации по событию ONSELECT.          
//4.5.20 SETSELECTEDVALUE      
Функция КомандаТерминалу_SETSELECTEDVALUE(selectedValue, Параметры) 
	
	ИмяКоменды = "SETSELECTEDVALUE";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("selectedValue", selectedValue);  //
	
	//Не обязательные параметры                    
	
	
	//ЗаполнитьЗначенияСвойств(ПараметрыКоманды, ВходныеПараметры.ПараметрыКоманды);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции


//Команда инициирует процедуру закрытия финансового дня на POS.           
//4.5.21 CLOSEDAY       
Функция КомандаТерминалу_CLOSEDAY(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "CLOSEDAY";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
		
	//Не обязательные параметры                    
	
	ПараметрыКоманды.Вставить("operatorId", Параметры.operatorId);  //
	ПараметрыКоманды.Вставить("operatorName", Параметры.operatorName);  //

	//Примечание: 
	//Для корректного выполнения процедуры закрытия дня необходимо всегда закрывать все выполняемые 
	//транзакции командой closeDoc. 


//	ЗаполнитьЗначенияСвойств(ПараметрыКоманды, ВходныеПараметры.ПараметрыКоманды);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Команда инициирует создание отчета транзакций на POS. Если в терминале присутствует интегрированный принтер, печать 
//отчета будет выполняться на принтере POS, в противном случае будет инициировано событие ONPRINT, в котором будет 
//передан текст отчёта.            
//4.5.22 PRINTTOTALS       
Функция КомандаТерминалу_PRINTTOTALS(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	//ИмяКоменды = "PRINTTOTALS";                       
    ИмяКоменды = "printtotals";                       
    
	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
		
	//Не обязательные параметры                    
	Если ЗначениеЗаполнено(Параметры.operatorId) ТОгда
		ПараметрыКоманды.Вставить("operatorId", Параметры.operatorId);  //
	КонецЕсли;	
	Если ЗначениеЗаполнено(Параметры.operatorName) ТОгда
		ПараметрыКоманды.Вставить("operatorName", Параметры.operatorName);  //
	КонецЕсли;	
	

	//ЗаполнитьЗначенияСвойств(ПараметрыКоманды, ВходныеПараметры.ПараметрыКоманды);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции


//Команда осуществляет запрос статуса текущей карточной транзакции. Рекомендуется использовать operationId и cryptogram  
//для корректного выполнения операций преавторизации, совершенных на различных терминалах. В случае недоступности 
//одного из параметров, можно использовать documentNr.          
//4.5.23 GETTRNSTATUS       
Функция КомандаТерминалу_GETTRNSTATUS(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "GETTRNSTATUS";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("operationId", "");  //
	ПараметрыКоманды.Вставить("cryptogram", "");  //
	//ИЛИ
	ПараметрыКоманды.Вставить("documentNr", "");  //Номер кассового чека
	
	
	
	//Не обязательные параметры                    
	
	ЗаполнитьЗначенияСвойств(ПараметрыКоманды, ВходныеПараметры.ПараметрыКоманды);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Команда выполняет запрос остатка баланса платёжной карты, информация о балансе отображается на экране POS.          
//4.5.24 INQUIRYBALANCE        
Функция КомандаТерминалу_INQUIRYBALANCE(ВходныеПараметры, Параметры)
	
	ИмяКоменды = "INQUIRYBALANCE";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	
	//Не обязательные параметры                    
	
	//ЗаполнитьЗначенияСвойств(ПараметрыКоманды, ВходныеПараметры.ПараметрыКоманды);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции


//Команда инициирует запрос на оплату Е-Продукта передавая в качестве параметра идентификатор плательщика, либо QRCode. 
//Интерпретируя полученный ответ от третьей стороны, POS может запросить дополнительные данные у оператора ECR, отправив 
//различные запросы ввода и выбора параметров е-продукта.          
//4.5.25 EPRODUCTQUERY        
Функция КомандаТерминалу_EPRODUCTQUERY(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры )  Экспорт
	
	ИмяКоменды = "EPRODUCTQUERY";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("barcodeData", "");  //Идентификатор плательщика/документа.
	ПараметрыКоманды.Вставить("documentNr", "");   //Номер кассового чека
	
	//Не обязательные параметры                    
	
	ЗаполнитьЗначенияСвойств(ПараметрыКоманды, ВходныеПараметры.ПараметрыКоманды);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции


//Команда инициирует  запись данных на карту  посредством  POS терминала.          
//4.5.26 WRITECARD         
Функция КомандаТерминалу_WRITECARD(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "WRITECARD";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("UID", "");  //Идентификатор плательщика/документа.
	ПараметрыКоманды.Вставить("dataBlocks", "");   //Номер кассового чека
	
	//Не обязательные параметры                    
	ПараметрыКоманды.Вставить("silent", Параметры.silent);   //звук операции есть/нет
	
	ЗаполнитьЗначенияСвойств(ПараметрыКоманды, ВходныеПараметры.ПараметрыКоманды);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Команда используется для информирования через устройство POS держателя карты, о том, что данная карта не обслуживается. 
//Команда инициирует отображение информационного сообщения для держателя карты, в котором указывается причина, из-за 
//которой данная карта не обслуживается.          
//Команда может быть применена в случае, когда ECR получает событие ONCARD и свойствах  не установлен флаг разрешения авторизации. 
//4.5.27 REMOVECARD          
Функция КомандаТерминалу_REMOVECARD(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "REMOVECARD";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("text", "Данная карта не обслуживается");  //Сообщение
	
	//Не обязательные параметры                    
	
	
	ЗаполнитьЗначенияСвойств(ПараметрыКоманды, ВходныеПараметры.ПараметрыКоманды);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Команда указывает POS-терминалу воспроизвести звуковую последовательность с использованием встроенного динамика .  
//4.5.28 BEEP          
Функция КомандаТерминалу_BEEP(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры )   Экспорт
	
	ИмяКоменды = "BEEP";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("notes", новый Массив);  //Список нот для воспроизведения
	//"notes":[  
	//{"tone": "G5", 
	//"duration": 50} 
	//{"tone": "None", 
	//"duration": 100 }
	//{"tone": "D6", 
	//"duration": 100} 
	//} 
	
	
	//Не обязательные параметры                    
	
	
	ЗаполнитьЗначенияСвойств(ПараметрыКоманды, ВходныеПараметры.ПараметрыКоманды);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Команда возвращает состояние POS.  
//4.5.29 GETPOSSTATUS           
Функция КомандаТерминалу_GETPOSSTATUS(Параметры) Экспорт 
	
	ИмяКоменды = "GETPOSSTATUS";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	СтруктураОткрытия = КомандаТерминалу_OPENPOS(Параметры);
	
	//Не обязательные параметры                    
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

//Каждая транзакция, начатая с ECR, требует подтверждения через вызов данного метода. При его выполнении кассовый аппарат 
//может запустить создание дополнительных чеков. Это приведет к генерации события ONPRINT. Когда ECR  подтверждает 
//транзакцию, она должна вызывать отправку команды CLOSEDOC до получения ответа от POS терминала. Если передать номер 
//документа (documentNr) без списка операций, то все связанные операции с этим документом будут отменены, если они ранее 
//не были подтверждены.
//
//Примечание: 
//Данный метод должен быть выполнен и для неподтвержденных транзакций (результат неуспешной авторизации). 
//
//Примечание: 
//Для отмены транзакции, связанной с документом, который уже был закрыт, следует использовать VOID или REFUND. 
//
//Примечание: 
//Операции под одним и тем же номером документа, не переданные команде closedoc, будут отменены.. 
//
//Примечание: 
//Очень важно, что вызовы CLOSEDOC будут повторяться ECR до получения положительного результата, чтобы 
//избежать ситуации, когда POS получил CLOSEDOC и считает документ закрытым, а операцию(и) подтвержденной, но из-за 
//непредвиденных технических проблем подтверждение не было получено ECR.. 
//4.5.30 CLOSEDOC          
Функция КомандаТерминалу_CLOSEDOC(ПараметрыКоманды, Параметры) Экспорт 
	
	ИмяКоменды = "CLOSEDOC";                       

	//ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("documentNr", ПараметрыКоманды.documentNr);  //Register receipt number 	
	
	//Не обязательные параметры                    
	ПараметрыКоманды.Вставить("operations", ПараметрыКоманды.operations);  //Идентификатор транзакции, полученный в ответе на команду AUTHORIZE.  	
	//ПараметрыКоманды.Вставить("eProducts", новый Массив);  //E идентификатор транзакции продукта, полученный в ответе на команду AUTHORIZE.  	
	//ПараметрыКоманды.Вставить("fiscalOperations", новый Массив);  //Фискальная операция, которая должна быть подтверждена/завершена. .  	
	
	//Комментарий к fiscalOperations:
	//Если фискальная система позволяет сторнировать фискальные операции, то успешные фискальные операции, не 
	//включенные в событие DOCCLOSED, будут автоматически сторнированы. 
	//Если фискальная система не разрешает сторнировать фискальные операции, то включение или невключение фискальной 
	//операции в событие DOCCLOSED не будет иметь никакого эффекта. 
	//В любом случае, CLOSEDOC должен быть  тправлен для любого уникального документа, созданного операцией 
	//FISCALIZE, независимо от ответа ONFISCALIZERESULT. 
	
	
	//ЗаполнитьЗначенияСвойств(ПараметрыКоманды, ВходныеПараметры.ПараметрыКоманды);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции


//Каждая операция Е-Продукта инициированная из ECR должна подтверждаться вызовом данного метода. При вызове данного 
//метода POS может инициировать создание дополнительных квитанций, для получения которых будет сгенерировано событие ONPRINT.
//
//Примечание:
//  данный метод должен выполняться и для не подтверждённых транзакций (неуспешный результат авторизации) 
//4.5.31 CLOSEEPRODUCT          
Функция КомандаТерминалу_CLOSEEPRODUCT(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры ) Экспорт 
	
	ИмяКоменды = "CLOSEEPRODUCT";                       

	ПараметрыКоманды = Новый Структура; 
	
	//Обязательные параметры
	ПараметрыКоманды.Вставить("operations", новый Массив);  //Идентификатор операции, полученный в ответе команды AUTHORIZE.   	
	
	//Не обязательные параметры                    
	
	
	ЗаполнитьЗначенияСвойств(ПараметрыКоманды, ВходныеПараметры.ПараметрыКоманды);
	
	СтруктураОтвета = КомандаТерминалу_RestX(ИмяКоменды, ПараметрыКоманды, Параметры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция eventType()
	Возврат Новый Структура("eventName,properties", NULL, NULL)
КонецФункции	

//Метод проверяет очередь доступных событий, инициированныx POS терминалом, если в очереди доступны ожидающие 
//события, метод в качестве результата вернет название события и свойства необходимые для обработки события.  
//4.6.1 getEvent          
Функция ПолучитьСобытиеОтТерминала_RestX(Параметры) Экспорт 
	
	event = eventType();
	
	ПараметрыКоманды = ПараметрыКомандыREST();
	ПараметрыКоманды.Метод = "GET";
	ПараметрыКоманды.ИмяФункции = "/getEvent";
	
	СтруктураОтвета = ПослатьЗапросНаТерминал_Rest(ПараметрыКоманды, Параметры);
	
	Если СтруктураОтвета.ОТВЕТ.Выполнен 
		и ТипЗнч(СтруктураОтвета.ОТВЕТ.ТелоОтветаДанные) = Тип("Структура") 
		Тогда
			event = СтруктураОтвета.ОТВЕТ.ТелоОтветаДанные;
			СтруктураОтвета.Вставить("eventType", event)	
	ИначеЕсли ТипЗнч(СтруктураОтвета) = тип("Структура") и не СтруктураОтвета.Свойство("eventType")	Тогда
		СтруктураОтвета.Вставить("eventType", event)	
	КонецЕсли;	
	
	//ПоказатьОповещениеПользователя(,,,,,);
	Если event = Неопределено Тогда 
		//связь не работает совсем
		
	ИначеЕсли event.eventName = NULL или event.eventName = Неопределено ТОгда 
		                          
		//Список событий пуст
	
	ИначеЕсли event.eventName = "ONPROMPT" ТОгда //4.6.2 Событие ONPROMPT
		//При получении данного сообщения программное обеспечение ECR должно отобразить сообщение с возможностью ввода 
		//информации кассиром. 
		//Запросить данные у кассира и отправить в POS	
		//Запомнить введенные данные
		//КомандаТерминалу_RestX_SETPROMPTINPUT(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
		inputValue = "";
		Если ВвестиСтроку(inputValue, "" + Параметры.TerminalAlias + ":" + event.properties.text, ,Ложь) Тогда
			РезультатОтправки = КомандаТерминалу_SETPROMPTINPUT(inputValue, Параметры);	
		КонецЕсли;
		//Сообщить("Возникло событие " + event.eventName + " - ");
		
	ИначеЕсли event.eventName = "ONSELECT" ТОгда //4.6.3 Событие ONSELECT 
		//При получении данного события программное обеспечение ECR  должно отобразить полученное текстовое сообщение на 
		//экране ECR с возможностью выбора кассиром переданных опций. 
		//Запросить данные у кассира и отправить в POS	
		//Запомнить введенные данные
		//КомандаТерминалу_RestX_SETSELECTEDVALUE(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры )
		
		СписокВыбора = Новый СписокЗначений;
		Для каждого СтрокаЗначений из event.properties.options Цикл
			СписокВыбора.Добавить(СтрокаЗначений);	
		КонецЦикла;	
		ВыбранныйЭлемент = СписокВыбора.ВыбратьЭлемент("" + Параметры.TerminalAlias + ":" +event.properties.displayText);
		Если ВыбранныйЭлемент<>Неопределено Тогда
			РезультатОтправки = КомандаТерминалу_SETSELECTEDVALUE(ВыбранныйЭлемент.Значение, Параметры);	
		КонецЕсли;	
		
		//Сообщить("Возникло событие " + event.eventName + " - ");
		
	ИначеЕсли event.eventName = "ONMSGBOX" ТОгда //4.6.4 Событие ONMSGBOX
		//При получении данного события программное обеспечение ECR должно отобразить полученное текстовое сообщение   в 
		//экране ECR в отдельном окне с возможностью выбора переданных указаний кассирy. 
		Сообщить("Возникло событие " + event.eventName + " - ");
		
		ВариантКнопок = event.properties.boxButtons; 
		
		КнопкиДиалога = РежимДиалогаВопрос.ОК;
		Если ВРЕГ(ВариантКнопок) = ВРЕГ("Ok") Тогда
			КнопкиДиалога = РежимДиалогаВопрос.ОК;
		ИначеЕсли ВРЕГ(ВариантКнопок) = ВРЕГ("OkCancel") Тогда
			КнопкиДиалога = РежимДиалогаВопрос.ОКОтмена;
		ИначеЕсли ВРЕГ(ВариантКнопок) = ВРЕГ("YesNo") Тогда
			КнопкиДиалога = РежимДиалогаВопрос.ДаНет;
		ИначеЕсли ВРЕГ(ВариантКнопок) = ВРЕГ("YesNoCancel") Тогда
			КнопкиДиалога = РежимДиалогаВопрос.ДаНетОтмена;
		КонецЕсли;	
			
		ОтветНаВопрос = Вопрос(event.properties.displayText, КнопкиДиалога,,,"" + Параметры.TerminalAlias + ":reasonType :" + event.properties.reasonType);
		
		ТекстОтвета = "Ok";
		Если ОтветНаВопрос = КодВозвратаДиалога.ОК Тогда
			ТекстОтвета = "Ok";
		ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Отмена Тогда
			ТекстОтвета = "Cancel";
		ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
			ТекстОтвета = "Yes";
		ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
			ТекстОтвета = "No";
		КонецЕсли;
		
		РезультатОтправки = КомандаТерминалу_SETMSGBOXKEY(ТекстОтвета, Параметры);
		
	ИначеЕсли event.eventName = "ONDISPLAYPROMPTRESULT" ТОгда //4.6.5 Событие ONDISPLAYPROMPTRESULT
		//Событие информирует ECR о том, что на ранее отправленный запрос DISPLAYPROMPT были введены данные. 
		//Сообщить("Возникло событие " + event.eventName + " - ");
		
	ИначеЕсли event.eventName = "ONDISPLAYMSGBOXRESULT" ТОгда //4.6.6 Событие ONDISPLAYMSGBOXRESULT 
		//Событие информирует ECR о том, какая кнопка была нажата на терминале в ответ на ранее отправленный запрос DISPLAYMSGBOX.  
		//Сообщить("Возникло событие " + event.eventName + " - ");
		
	ИначеЕсли event.eventName = "ONDISPLAYSELECTRESULT" ТОгда //4.6.7 Событие ONDISPLAYSELECTRESULT 
		//Событие информирует ECR о том, какая опция была выбрана на терминале в ответ на ранее отправленный запрос DISPLAYSELECT.   
		//Сообщить("Возникло событие " + event.eventName + " - ");
		
	ИначеЕсли event.eventName = "ONTRNSTATUS" ТОгда //4.6.8 Событие ONTRNSTATUS 
		//Событие информирует ECR o изменении статуса выполняемой транзакции.    
		//Сообщить("Возникло событие " + event.eventName + " - ");
		
	ИначеЕсли event.eventName = "ONFISCALIZERESULT" ТОгда //4.6.9 Событие ONFISCALIZERESULT 
		//Событие информирует ECR о результате операции фискализации.     
		//Сообщить("Возникло событие " + event.eventName + " - ");
		
	ИначеЕсли event.eventName = "ONCARD" ТОгда //4.6.10 Событие ONCARD 
		//Событие информирует ECR, о выполнении POS считывания информации о предоставленной карте.     
		//В случае, когда не установлен флаг AllowAuthorize означает, что карта является дисконтной картой, либо картой лояльности. 
		//ообщить("Возникло событие " + event.eventName + " - ");
		
	ИначеЕсли event.eventName = "ONCARDREMOVE" ТОгда //4.6.11 Событие ONCARDREMOVE 
		//Событие предназначено для информирования ECR о том, что данные карты больше не доступны.     
		//Сообщить("Возникло событие " + event.eventName + " - ");
		
	ИначеЕсли event.eventName = "ONWRITECARDRESULT" ТОгда //4.6.12 Событие ONWRITECARDRESULT  
		//Событие информирует ECR об успешном выполнении команды WRITECARD.      
		//Сообщить("Возникло событие " + event.eventName + " - ");
		
	ИначеЕсли event.eventName = "ONDISPLAYTEXT" ТОгда //4.6.13 Событие ONDISPLAYTEXT  
		//При получении этого события программа ECR должна вывести полученное текстовое сообщение на экран приложения ECR.      
		//Сообщить("Возникло событие " + event.eventName + " - ");
	
	ИначеЕсли event.eventName = "ONPRINT" ТОгда //4.6.14 Событие ONPRINT  
		//Событие информирует ECR, что POS  подготовил данные чека для печати. Если принтер ECR во время получения чека не 
		//доступен либо занят, полученную информацию чека надо сохранить в приложении ECR.       
		//Сообщить("Возникло событие " + event.eventName + " - ");
		
	ИначеЕсли event.eventName = "ONKBD" ТОгда //4.6.15 Событие ONKBD   
		//Событие информирует ECR,  о том что произошло нажатие клавиши на клавиатуре POS. Это событие генерируется только в том 
		//случае, если устройство находится в состоянии ожидания. Под состоянием ожидания подразумевается, что  POS не выполняет 
		//активной авторизации и не запрашивает у пользователя какие-либо данные для ввода или выбора.       
		//Сообщить("Возникло событие " + event.eventName + " - ");
	
	ИначеЕсли event.eventName = "ONDISPLAYTEXT" ТОгда //4.6.16 Событие ONEPRODUCTRESULT  
		//Событие информирует ECR  о результате выполнения команды EPRODUCTQUERY.  Для завершения операции оплаты Е-Продукта 
		//необходимо выполнить команду CLOSEDOC передав в качестве параметра operationId. В зависимости от конфигурации Е
		//Продукта POS может инициировать печать дополнительного чека сгенерировав событие ONPRINT.       
		//Сообщить("Возникло событие " + event.eventName + " - ");
		
	ИначеЕсли ЗначениеЗаполнено(event.eventName) ТОгда
		
		//Сообщить("Возникло не известное событие " + event.eventName + " - ");
		
	КонецЕсли;
	
	Если Параметры.Отладка Тогда
		Сообщить("" + Параметры.TerminalAlias + ": Возникло событие " + event.eventName + " - ");
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции
	

#КонецОбласти //ПрограммныйИнтерфейс  

#Область ВспомогательныеФункции

Функция ПараметрыКомандыREST() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Метод","POST");
	Результат.Вставить("ИмяФункции","");
	Результат.Вставить("ТелоСообщения","");
	Результат.Вставить("Таймаут", 10);
	
	Возврат Результат;
КонецФункции

Функция СтруктураОтвета_TypeResult() 
	Результат = Новый Структура;
	
	Результат.Вставить("resultCode","");      
	Результат.Вставить("resultMessage","");      
	Результат.Вставить("resultTime","");      

	Возврат Результат;
	
КонецФункции

Функция ecrVersion(Параметры)
	Возврат "ONESOFT-" + Параметры.TerminalAlias + "-001";
КонецФункции	

Функция ПослатьЗапросНаТерминал_Rest(ПараметрыКоманды, Параметры)
	
	Результат = Новый Структура;
	
	//executeposcmd
	АдресФункции = "/" + СокрЛП(Параметры.ApiVersion) + ПараметрыКоманды.ИмяФункции ; 
	
	ЗаписьЛога = Новый Структура;
	ЗаписьЛога.Вставить("StartDate", ТекущаяДата());
	ЗаписьЛога.Вставить("Method", ПараметрыКоманды.Метод);
	ЗаписьЛога.Вставить("URL",Параметры.АдресСервера + АдресФункции);
	ЗаписьЛога.Вставить("function", АдресФункции);
	ЗаписьЛога.Вставить("BodyRequest","");
	ЗаписьЛога.Вставить("BodyResponce","");
	ЗаписьЛога.Вставить("Code","");
	
	
	ПолучаемТокенДоступа = Ложь;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Выполнен", Ложь);
	СтруктураОтвета.Вставить("Ошибка", Ложь);
	СтруктураОтвета.Вставить("КодСостояния", 0);
	СтруктураОтвета.Вставить("ТелоОтвета", Неопределено);
	СтруктураОтвета.Вставить("ТелоОтветаДанные", Неопределено);
	
	
	ЗащищенноеСоединение = Неопределено;
	Если Параметры.ЗащищенноеСоединение ТОгда
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	КонецЕсли;	

	Заголовки = Новый Соответствие;
	
	Если не ЗначениеЗаполнено(ПараметрыКоманды.ТелоСообщения) и 
		ПараметрыКоманды.ИмяФункции = "/openpos" 
		Тогда
		ТелоСообщения = Новый Структура;
		ТелоСообщения.Вставить("licenseToken", Параметры.licenseToken);
		ТелоСообщения.Вставить("alias", Параметры.TerminalAlias);
		ТелоСообщения.Вставить("username","");
		ТелоСообщения.Вставить("password","");
		ПараметрыКоманды.ТелоСообщения = ТелоСообщения;
		ПолучаемТокенДоступа = Истина;
	КонецЕсли;  
	
	Если Параметры.Свойство("accessToken") И ЗначениеЗаполнено(Параметры.accessToken) 
		//И (ПараметрыКоманды.ИмяФункции = "/getsoftwareversions" или ПараметрыКоманды.ИмяФункции = "/closepos")
		Тогда
		Заголовки.Вставить("Authorization","Bearer " + Параметры.accessToken);		
	КонецЕсли;	
	
	HTTPСоединение = Новый HTTPСоединение(Параметры.АдресСервера, , , , , ПараметрыКоманды.Таймаут, ЗащищенноеСоединение);
		
	HTTPЗапрос = новый HTTPЗапрос(АдресФункции, Заголовки); 
	
	Если ЗначениеЗаполнено(ПараметрыКоманды.ТелоСообщения) Тогда
		Если ТипЗнч(ПараметрыКоманды.ТелоСообщения) = Тип("Строка") Тогда
			HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыКоманды.ТелоСообщения); 
			ЗаписьЛога.BodyRequest = ПараметрыКоманды.ТелоСообщения;
		Иначе
			BodyRequest = ИзДанных1с_в_JSON(ПараметрыКоманды.ТелоСообщения);
			HTTPЗапрос.УстановитьТелоИзСтроки(BodyRequest);
			ЗаписьЛога.BodyRequest = BodyRequest;			
		КонецЕсли;	
		Заголовки.Вставить("Content-Type","application/json");		
	КонецЕсли;	
	
	Попытка
		HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод(ПараметрыКоманды.Метод , HTTPЗапрос);	
		
		СтруктураОтвета.Вставить("Выполнен", Истина);
	    СтруктураОтвета.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
	    СтруктураОтвета.Вставить("Заголовки", HTTPОтвет.Заголовки);
		
		ЗаписьЛога.Code = HTTPОтвет.КодСостояния;
		
	Исключение
		СтруктураОтвета.Вставить("Ошибка", Истина);
		СтруктураОтвета.Вставить("ТекстОшибки", ОписаниеОшибки());
	Конецпопытки;
	
	
	Если СтруктураОтвета.КодСостояния > 100 Тогда	
		СтруктураОтвета.ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		Если ЗначениеЗаполнено(СтруктураОтвета.ТелоОтвета) Тогда  
			
			ЗаписьЛога.BodyResponce = СтруктураОтвета.ТелоОтвета;
			
			Попытка	
				СтруктураОтвета.ТелоОтветаДанные = ИзJSON_в_Данные1с(СтруктураОтвета.ТелоОтвета);

				Если ТипЗнч(СтруктураОтвета.ТелоОтвета)=Тип("Структура") Тогда
					ЗаполнитьЗначенияСвойств(Результат, СтруктураОтвета.ТелоОтвета);
				КонецЕсли;	
				
				BodyResponce = ИзДанных1с_в_JSON(СтруктураОтвета.ТелоОтветаДанные);
				ЗаписьЛога.BodyResponce = BodyResponce;
			Исключение
				
			КонецПопытки;	
		КонецЕсли;
		
		Если ТипЗнч(СтруктураОтвета.ТелоОтветаДанные)=Тип("Структура") Тогда
			
			resultCode = "";
			Если СтруктураОтвета.ТелоОтветаДанные.Свойство("resultCode", resultCode) Тогда
				Если resultCode<>"OK" Тогда
					//Сообщить("ERR:" + СтруктураОтвета.ТелоОтветаДанные.resultCode + " : " + СтруктураОтвета.ТелоОтветаДанные.resultMessage + "; time " + СтруктураОтвета.ТелоОтветаДанные.resultTime + " " + АдресФункции);
				КонецЕсли;	
			КонецЕсли;	
			
			Если ПолучаемТокенДоступа Тогда
				ТокенСессии = "";
				РезультатПодключения = СтруктураОтвета.ТелоОтветаДанные.Свойство("accessToken", ТокенСессии);
				Если ЗначениеЗаполнено(ТокенСессии) ТОгда	
					Параметры.Вставить("accessToken", ТокенСессии);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли
	КонецЕсли;
	
	Результат.Вставить("ОТВЕТ", СтруктураОтвета);
	
	Логировать = Ложь;
	Если Параметры.Свойство("Логировать") и  Параметры.Логировать = Истина ТОгда
		
		ЗаписьЛога.Вставить("EndDate", ТекущаяДата());
		
		ТекстСообщения = 
		"=========================================================
		|" + ЗаписьЛога.StartDate + " - " + ЗаписьЛога.EndDate + " " + ЗаписьЛога.URL   + "
		| REQUEST: " + ЗаписьЛога.method + " " + ЗаписьЛога.URL  + "
		| " + ЗаписьЛога.function + "
		| BODY: 
		|"  + ЗаписьЛога.BodyRequest + " 
		| RESPONCE: " + ЗаписьЛога.Code + " 
		|" + ЗаписьЛога.BodyResponce + "
		|"; 
		
		ИмяФайла = "" + Параметры.TerminalAlias + "_" + Формат(ТекущаяДата(),"ДФ=yyyyMMdd_hh")+ ".log";
		ПолныйПуть = Параметры.ПутьЛогирования + "\" + ИмяФайла;
		Попытка
			ЗаписьТекста = Новый ТекстовыйДокумент;
			ФС = Новый Файл(ПолныйПуть);
			Если ФС.Существует() Тогда
				ЗаписьТекста.Прочитать(ПолныйПуть);
			КонецЕсли;	
			ЗаписьТекста.ДобавитьСтроку(ТекстСообщения);
			ЗаписьТекста.Записать(ПолныйПуть);
		Исключение       
			Сообщить("Ошибка логирования: " + ОписаниеОшибки());
		КонецПопытки;
		
		
	КонецЕсли;
	
	Возврат Результат;

	
КонецФункции

Функция КомандаТерминалу_RestX(commandName, params, Параметры)  
//4.5 Метод exceuteposcmd 
//{ 
//"header": 
//	{ 
//	"command": "string" #Название команды 
//	}, 
//"params": {  
//	# Параметры команды 
//	} 
//} 

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("header", Новый Структура("command",commandName));
	Если ТипЗнч(params) = Тип("Структура") и params.Количество()>0 Тогда
    	СтруктураПараметров.Вставить("params", params);
	КонецЕсли;	
	
	ПараметрыКоманды = ПараметрыКомандыREST();
	ПараметрыКоманды.Метод = "POST"; 
	
	//ПараметрыКоманды.ИмяФункции = "/excecuteposcmd"; //executeposcmd  //exceuteposcmd
    //ПараметрыКоманды.ИмяФункции = "/exceuteposcmd"; //executeposcmd  //exceuteposcmd
	ПараметрыКоманды.ИмяФункции = "/executeposcmd"; //правильне написание
	
    ПараметрыКоманды.ТелоСообщения = ИзДанных1с_в_JSON(СтруктураПараметров);
	
	СтруктураОтвета = ПослатьЗапросНаТерминал_Rest(ПараметрыКоманды, Параметры);
	
	СтруктураОтвета.Вставить("TypeResult", СтруктураОтвета_TypeResult());
	Если СтруктураОтвета.ОТВЕТ.Выполнен Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОтвета.TypeResult, СтруктураОтвета.ОТВЕТ.ТелоОтветаДанные); 
		Если Параметры.Отладка и СтруктураОтвета.TypeResult.ResultCode<>"OK" Тогда
			ПоказатьОповещениеПользователя(commandName,,СтруктураОтвета.TypeResult.ResultMessage,БиблиотекаКартинок.ДиалогСтоп,СтатусОповещенияПользователя.Информация);
		КонецЕсли;
	КонецЕсли;	
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПолученТокен(Параметры) Экспорт
	
	Результат = Ложь; 
	Если Параметры.Свойство("accessToken") ТОгда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	


Функция ИзJSON_в_Данные1с(СтрокаJSON) Экспорт
	
	Json = Новый ЧтениеJSON;
	Json.УстановитьСтроку(СтрокаJSON);
		
	Рез = ПрочитатьJSON(Json);
		
	Возврат Рез;
		
КонецФункции	

Функция ИзДанных1с_в_JSON(Данные, ИспользоватьФорматДатыJSON = Неопределено) Экспорт
	
	Json = Новый ЗаписьJSON;
	Json.УстановитьСтроку();
	
	Если ИспользоватьФорматДатыJSON <> Неопределено Тогда
		тНастройкиСериализации = Новый НастройкиСериализацииJSON;
		тНастройкиСериализации.ФорматСериализацииДаты = ИспользоватьФорматДатыJSON;
		
		ЗаписатьJSON(Json, Данные, тНастройкиСериализации); 
	Иначе	
		ЗаписатьJSON(Json, Данные);
	КонецЕсли;
	
	Рез = Json.Закрыть();
	
	Возврат Рез;

КонецФункции

Функция ПолучитьПроизвольныйНомерДокументаСтрокой() Экспорт

	Генератор = Новый ГенераторСлучайныхЧисел();
	НомерДокумента = Генератор.СлучайноеЧисло(100000,429496);
    НомерДокументаСтрокой = Формат(НомерДокумента,"ЧГ=");
  	
    Возврат НомерДокументаСтрокой;
	
КонецФункции

Функция МассивВСтроку(МойМассив) Экспорт
	Результат = "";
	Для каждого СтрокаМассива из МойМассив Цикл
		Результат = Результат + СтрокаМассива + "; ";
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьСтрокиСлипЧека() Экспорт 
	СписокСтрокСлипЧека = Новый Структура;
	
	СписокСтрокСлипЧека.Вставить("Сумма",								0);
	СписокСтрокСлипЧека.Вставить("СсылочныйНомер",						"000-000");
	СписокСтрокСлипЧека.Вставить("НомерЧекаЭТ",							"");
	СписокСтрокСлипЧека.Вставить("ПричинаОтмены",				    	"");
    СписокСтрокСлипЧека.Вставить("КодАвторизации",						"");
	
    СписокСтрокСлипЧека.Вставить("ИдентификаторОперацииНаТерминале",	"000-000");
	СписокСтрокСлипЧека.Вставить("ВремяОперацииНаТерминале",			"");	
	СписокСтрокСлипЧека.Вставить("ИдентификаторТерминала",				"");
	СписокСтрокСлипЧека.Вставить("КодОтветаХоста",						"");
	СписокСтрокСлипЧека.Вставить("НомерСсылкы",							"");
	СписокСтрокСлипЧека.Вставить("НомерКарты",							"000");
	СписокСтрокСлипЧека.Вставить("ОписаниеОтветаХоста",					"");
	СписокСтрокСлипЧека.Вставить("Операция",							"");
	СписокСтрокСлипЧека.Вставить("СлипОтХоста",							"");  //тут текст чека для печати 
	СписокСтрокСлипЧека.Вставить("ВидОплатыДляВозврата",				"");
	СписокСтрокСлипЧека.Вставить("КодОперацииЭС",				        "");
	
	СписокСтрокСлипЧека.Вставить("КартаПредоставлена",				    Ложь);
	СписокСтрокСлипЧека.Вставить("КартаДействительна",				    Ложь);
		СписокСтрокСлипЧека.Вставить("Результат",				    	Ложь);
    СписокСтрокСлипЧека.Вставить("state",				    		"");
	
	Возврат СписокСтрокСлипЧека;
	
КонецФункции

Процедура ЗаполнитьСписокСтрокСлипЧекаПоСтатусуТерминала(СписокСтрокСлипЧека, eventType, Параметры) Экспорт
	//заполним по статусу терминала для печати
	СписокСтрокСлипЧека.Вставить("Сумма",								Окр(eventType.properties.amountAuthorized/100,2));
	СписокСтрокСлипЧека.Вставить("СсылочныйНомер",						eventType.properties.operationId); //AID
	СписокСтрокСлипЧека.Вставить("ИдентификаторОперацииНаТерминале",	eventType.properties.operationId); //AID
	СписокСтрокСлипЧека.Вставить("ВремяОперацииНаТерминале",			eventType.result.resultTime);	
	СписокСтрокСлипЧека.Вставить("ИдентификаторТерминала",				Параметры.TerminalAlias);
	СписокСтрокСлипЧека.Вставить("КодАвторизации",						eventType.properties.authCode);
	СписокСтрокСлипЧека.Вставить("КодОтветаХоста",						eventType.properties.state);
	СписокСтрокСлипЧека.Вставить("НомерСсылкы",							eventType.properties.operationId);
	СписокСтрокСлипЧека.Вставить("НомерКарты",							eventType.properties.PAN);
	СписокСтрокСлипЧека.Вставить("ОписаниеОтветаХоста",					Кодировка(eventType.properties.Text));
	//СписокСтрокСлипЧека.Вставить("Операция",							СписокСтрокСлипЧека.ДанныеДокумента.posOperation);
	//СписокСтрокСлипЧека.Вставить("СлипОтХоста",							Кодировка(eventType.result.resultTime));
	СписокСтрокСлипЧека.Вставить("ВидОплатыДляВозврата",				eventType.properties.APN);
	СписокСтрокСлипЧека.Вставить("КодОперацииЭС",				        eventType.properties.OperationID);

КонецПроцедуры  

// საერთო დანიშნულების პროცედურები და ფუნქციები
Функция Кодировка(Строка) Экспорт
	
	СоответствиеКодировки = Новый Соответствие;
	
	СоответствиеКодировки.Вставить(Строка(Число("1084")),"ა");
	СоответствиеКодировки.Вставить(Строка(Число("1101")),"ბ");
	СоответствиеКодировки.Вставить(Строка(Число("1089")),"გ");
	СоответствиеКодировки.Вставить(Строка(Число("1087")),"დ");
	СоответствиеКодировки.Вставить(Строка(Число("1074")),"ე");
	СоответствиеКодировки.Вставить(Строка(Число("1100")),"ვ");
	СоответствиеКодировки.Вставить(Строка(Число("1095")),"ზ");
	СоответствиеКодировки.Вставить(Строка(Число("1078")),"თ");
	СоответствиеКодировки.Вставить(Строка(Число("1081")),"ი");
	СоответствиеКодировки.Вставить(Строка(Число("1093")),"კ");
	СоответствиеКодировки.Вставить(Строка(Число("1094")),"ლ");
	СоответствиеКодировки.Вставить(Строка(Число("1103")),"მ");
	СоответствиеКодировки.Вставить(Строка(Число("1102")),"ნ");
	СоответствиеКодировки.Вставить(Строка(Число("1082")),"ო");
	СоответствиеКодировки.Вставить(Строка(Число("1083")),"პ");
	//СоответствиеКодировки.Вставить(""","ჟ");
	СоответствиеКодировки.Вставить(Строка(Число("1076")),"რ");
	СоответствиеКодировки.Вставить(Строка(Число("1086")),"ს");
	СоответствиеКодировки.Вставить(Строка(Число("1077")),"ტ");
	СоответствиеКодировки.Вставить(Строка(Число("1080")),"უ");
	СоответствиеКодировки.Вставить(Строка(Число("1088")),"ფ");
	СоответствиеКодировки.Вставить(Строка(Число("1071")),"ქ");
	СоответствиеКодировки.Вставить(Строка(Число("1075")),"ღ");
	СоответствиеКодировки.Вставить(Строка(Число("1079")),"ყ");
	СоответствиеКодировки.Вставить(Строка(Число("1085")),"შ");
	СоответствиеКодировки.Вставить(Строка(Число("1098")),"ჩ");
	СоответствиеКодировки.Вставить(Строка(Число("1099")),"ც");
	//СоответствиеКодировки.Вставить("ძ""," ");
	СоответствиеКодировки.Вставить(Строка(Число("1073")),"წ");
	СоответствиеКодировки.Вставить(Строка(Число("1072")),"ჭ");
	СоответствиеКодировки.Вставить(Строка(Число("1097")),"ხ");
	СоответствиеКодировки.Вставить(Строка(Число("1092")),"ჯ");
	//СоответствиеКодировки.Вставить(""","ჰ");
	
	
	НаименованиеДляДисплПок = "";	
	
	Строка = СтрЗаменить( Строка,"\r\n",Символы.ПС);
	
	Для Счт = 1 По СтрДлина(Строка) Цикл
		РусСимвол = Сред(Строка, Счт, 1);
		
		Если КодСимвола(РусСимвол)>= 1040 И КодСимвола(РусСимвол) <= 1103  Тогда 
			Символ = СоответствиеКодировки[Строка(КодСимвола(РусСимвол))];
			Если Символ = "" Тогда 
				Символ = РусСимвол;
			КонецЕсли;
		Иначе                                            
			Символ = РусСимвол;
		КонецЕсли;
		
		НаименованиеДляДисплПок = НаименованиеДляДисплПок + Символ; 
		
	КонецЦикла;
	
	
	Возврат  НаименованиеДляДисплПок;
	
КонецФункции

Процедура СтрокаОтТерминала(СтрокаОтТерминала, мRequest, мМассив) Экспорт
	
	П = 0;	
	
	СохрСтрока = СтрокаОтТерминала;
	
	Пока Найти(СтрокаОтТерминала,";") И П < мМассив.Количество() Цикл 
		Инд = Найти(СтрокаОтТерминала,";");
		мRequest[мМассив[П]] = Лев(СтрокаОтТерминала,Инд-1);
		СтрокаОтТерминала = Сред(СтрокаОтТерминала,Инд+1);
		П = П +1;
	КонецЦикла;
	
	Попытка      		
		
		МассивСтрок = СтрРазделить(СохрСтрока,Символы.ПС,Истина);
		
		Для Каждого СтрокаТекста Из МассивСтрок Цикл    				
			
			СтрФрагмент = ("ბარათი:  ");	
			ИндексФрагмента = Найти(СтрокаТекста,"ბარათი: ");	
			
			Если ИндексФрагмента > 0 Тогда  					
				
				МассивСтрокаТекста = СтрРазделить(СтрокаТекста," ");
				
				Если Не ЗначениеЗаполнено(мRequest.PAN)  Тогда  
					мRequest.PAN = МассивСтрокаТекста[МассивСтрокаТекста.Количество()-1];
				КонецЕсли;
			КонецЕсли;
			
			СтрФрагмент = ("ქვითარი:  ");	
			ИндексФрагмента = Найти(СтрокаТекста,"ქვითარი: ");	
			Если ИндексФрагмента > 0 Тогда  					
				
				МассивСтрокаТекста = СтрРазделить(СтрокаТекста," ");
				
				Если Не ЗначениеЗаполнено(мRequest.CheckNumber)  Тогда  
					мRequest.CheckNumber = МассивСтрокаТекста[МассивСтрокаТекста.Количество()-1];
				КонецЕсли;
			КонецЕсли;
			
			
		КонецЦикла;    		
		
		
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

Функция СтрокаДляТерминала(мRequest) Экспорт
	
	впСтрокаДлаТерминала = "";
	
	Для Каждого Эл Из мRequest Цикл 
		впСтрокаДлаТерминала = впСтрокаДлаТерминала + Эл.Значение +";";
	КонецЦикла;
	
	//впСтрокаДлаТерминала = Лев(впСтрокаДлаТерминала,СтрДлина(впСтрокаДлаТерминала)-1);
	
	Возврат впСтрокаДлаТерминала;
		
КонецФункции

Процедура ПроизнестиФразу(ТекстФразы) Экспорт 
	попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak(ТекстФразы);
	Исключение   
		Сообщить("Ошибка воспроизведения: " + ОписаниеОшибки());
	Конецпопытки;	
КонецПроцедуры

Процедура ВоспроизвестиФайл(Путь) Экспорт
	
	мФайл = Путь;
	
	spVoice = Новый COMОбъект("SAPI.SpVoice");
	spfStream = Новый COMОбъект("SAPI.SpFileStream");
	
	spfStream.Open(мФайл);
	
	spVoice.Speak(spfStream);
	
	spfStream.Close(); 
	
КонецПроцедуры                        

#КонецОбласти //ПрограммныйИнтерфейс  