
Процедура СформироватьТаблицаЗапасы(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Ссылка,
	|	ТаблицаЗапасы.НомерСтроки,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.Количество,
	|	ТаблицаЗапасы.ЕдиницаИзмерения,
	|	ТаблицаЗапасы.ШтрихкодыНоменклатуры,
	|	ТаблицаЗапасы.Контрагент,
	|	ТаблицаЗапасы.ВидОперации,
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Автор,
	|	ТаблицаЗапасы.ВидДвижения
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы";
    		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыНаСкладах()

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	AzRyВременноеПередачаЗапасовЗапасы.Ссылка,
	|	AzRyВременноеПередачаЗапасовЗапасы.НомерСтроки,
	|	AzRyВременноеПередачаЗапасовЗапасы.Номенклатура,
	|	AzRyВременноеПередачаЗапасовЗапасы.Характеристика,
	|	AzRyВременноеПередачаЗапасовЗапасы.Партия,
	|	AzRyВременноеПередачаЗапасовЗапасы.Количество,
	|	AzRyВременноеПередачаЗапасовЗапасы.ЕдиницаИзмерения,
	|	AzRyВременноеПередачаЗапасовЗапасы.AzRyШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры,
	|	AzRyВременноеПередачаЗапасовЗапасы.Ссылка.Контрагент,
	|	AzRyВременноеПередачаЗапасовЗапасы.Ссылка.ВидОперации,
	|	AzRyВременноеПередачаЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	AzRyВременноеПередачаЗапасовЗапасы.Ссылка.Организация,
	|	AzRyВременноеПередачаЗапасовЗапасы.Ссылка.Автор,
	|   &ВидДвижения КАК ВидДвижения
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.AzRyВременноеПередачаЗапасов.Запасы КАК AzRyВременноеПередачаЗапасовЗапасы
	|ГДЕ
	|	AzRyВременноеПередачаЗапасовЗапасы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
	Запрос.УстановитьПараметр("ВидДвижения", ?(ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.AzRyВидыОперацийВременноеПередачаЗапасов.Передача, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход));
			
	МассивРезультатов = Запрос.Выполнить();
		
	// Формирование проводок документа.
	СформироватьТаблицаЗапасы(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ФОРМЫ

// Функция проверяет, проведен документ или нет, и вызывает процедуру печати
// документа.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПеремещениеЗапасов";

	ПервыйДокумент = Истина;
	
	Для каждого ТекущийДокумент Из МассивОбъектов Цикл
	
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		
		Если ИмяМакета = "ПеремещениеЗапасов" Тогда
		
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ШапкаДокумента.Дата КАК ДатаДокумента,
			|	ШапкаДокумента.Организация КАК Организация,
			|	ШапкаДокумента.СтруктурнаяЕдиница КАК Отправитель,
			|	ШапкаДокумента.СтруктурнаяЕдиницаПолучатель КАК Получатель,
			|	ШапкаДокумента.Номер,
			|	ШапкаДокумента.Организация.Префикс КАК Префикс,
			|	ШапкаДокумента.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы КАК СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы
			|ИЗ
			|	Документ.ПеремещениеЗапасов КАК ШапкаДокумента
			|ГДЕ
			|	ШапкаДокумента.Ссылка = &ТекущийДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПеремещениеЗапасов.НомерСтроки КАК НомерСтроки,
			|	ПеремещениеЗапасов.Номенклатура.НаименованиеПолное КАК Запас,
			|	ПеремещениеЗапасов.Номенклатура.Код КАК Код,
			|	ПеремещениеЗапасов.Номенклатура.Артикул КАК Артикул,
			|	ПеремещениеЗапасов.ЕдиницаИзмерения КАК ЕдиницаХранения,
			|	ПеремещениеЗапасов.Количество КАК Количество,
			|	ПеремещениеЗапасов.Резерв КАК Резерв,
			|	ПеремещениеЗапасов.ЗаказПокупателя КАК ЗаказПокупателя,
			|	ПеремещениеЗапасов.Характеристика КАК Характеристика,
			|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
			|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена * ПеремещениеЗапасов.Количество, 0) КАК Сумма
			|ИЗ
			|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|				&ДатаДокумента,
			|				Номенклатура В (&СписокНоменклатура)
			|					И Характеристика В (&СписокХарактеристика)
			|					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
			|		ПО ПеремещениеЗапасов.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|			И ПеремещениеЗапасов.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
			|			И ПеремещениеЗапасов.Ссылка.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен = ЦеныНоменклатурыСрезПоследних.ВидЦен
			|ГДЕ
			|	ПеремещениеЗапасов.Ссылка = &ТекущийДокумент
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Запрос.УстановитьПараметр("ВидЦен", ТекущийДокумент.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен);
			Запрос.УстановитьПараметр("ДатаДокумента", ТекущийДокумент.Дата);
			Запрос.УстановитьПараметр("СписокНоменклатура", ТекущийДокумент.Запасы.ВыгрузитьКолонку("Номенклатура"));
			Запрос.УстановитьПараметр("СписокХарактеристика", ТекущийДокумент.Запасы.ВыгрузитьКолонку("Характеристика"));
			
			МассивРезультатов = Запрос.ВыполнитьПакет();
			
			Шапка = МассивРезультатов[0].Выбрать();
			Шапка.Следующий();
			
			ВыборкаСтрокЗапасы = МассивРезультатов[1].Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеЗапасов_ПеремещениеЗапасов";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.ПеремещениеЗапасов.ПФ_MXL_ПеремещениеЗапасов");
			
			Если Шапка.ДатаДокумента < Дата('20110101') Тогда
				НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
			Иначе
				НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.ТекстЗаголовка =
				"Перемещение запасов № "
			  + НомерДокумента
			  + " от "
			  + Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			 ИЛИ Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыСЦенами");
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			 ИЛИ Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаСЦенами");
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			КонецЕсли;
			
			Количество = 0;
			Всего = 0;
			
			Пока ВыборкаСтрокЗапасы.Следующий() Цикл
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
				ОбластьМакета.Параметры.Запас = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(
					ВыборкаСтрокЗапасы.Запас,
					ВыборкаСтрокЗапасы.Характеристика,
					ВыборкаСтрокЗапасы.Артикул
				);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Количество = Количество + 1;
				Всего = Всего + ВыборкаСтрокЗапасы.Сумма;
				
			КонецЦикла;
			
			Если Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			 ИЛИ Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогоСЦенами");
				ОбластьМакета.Параметры.Всего = Всего;
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		ИначеЕсли ИмяМакета = "М11" Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПеремещениеЗапасов.Дата КАК ДатаДокумента,
			|	ПеремещениеЗапасов.Организация КАК Организация,
			|	ПеремещениеЗапасов.СтруктурнаяЕдиница КАК Отправитель,
			|	ПеремещениеЗапасов.СтруктурнаяЕдиницаПолучатель КАК Получатель,
			|	ПеремещениеЗапасов.СчетЗатрат.Код КАК КоррСчет,
			|	ПеремещениеЗапасов.Номер,
			|	ПеремещениеЗапасов.Организация.Префикс КАК Префикс,
			|	ПеремещениеЗапасов.Запасы.(
			|		НомерСтроки КАК НомерСтроки,
			|		Номенклатура.НаименованиеПолное КАК Запас,
			|		Номенклатура.Артикул КАК Артикул,
			|		Количество КАК Количество,
			|		Резерв КАК Резерв,
			|		ЗаказПокупателя КАК ЗаказПокупателя,
			|		Характеристика,
			|		ЕдиницаИзмерения.Наименование,
			|		ЕдиницаИзмерения.Код,
			|		Номенклатура.СчетУчетаЗапасов.Код КАК Счет,
			|		Номенклатура.Код КАК НоменклатурныйНомер
			|	)
			|ИЗ
			|	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
			|ГДЕ
			|	ПеремещениеЗапасов.Ссылка = &ТекущийДокумент
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Шапка = Запрос.Выполнить().Выбрать();
			Шапка.Следующий();
			
			ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеЗапасов_ПеремещениеЗапасов_М11";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.ПеремещениеЗапасов.ПФ_MXL_М11");
			
			СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
			
			Если Шапка.ДатаДокумента < Дата('20110101') Тогда
				НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
			Иначе
				НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заголовок =
				"ТРЕБОВАНИЕ-НАКЛАДНАЯ № "
			  + НомерДокумента
			  + " от "
			  + Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.КодОКПО                  = СведенияОбОрганизации.КодПоОКПО;
			ОбластьМакета.Параметры.ПредставлениеОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации);
			ОбластьМакета.Параметры.ДатаСоставления          = Формат(Шапка.ДатаДокумента, "ДФ=dd.MM.yy");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			
			Пока ВыборкаСтрокЗапасы.Следующий() Цикл
			
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
				ОбластьМакета.Параметры.Запас = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаСтрокЗапасы.Запас, ВыборкаСтрокЗапасы.Характеристика, ВыборкаСтрокЗапасы.Артикул);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		ИначеЕсли ИмяМакета = "ТОРГ13" Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ШапкаДокумента.Дата КАК ДатаДокумента,
			|	ШапкаДокумента.Организация КАК Организация,
			|	ШапкаДокумента.СтруктурнаяЕдиница КАК Отправитель,
			|	ШапкаДокумента.СтруктурнаяЕдиницаПолучатель КАК Получатель,
			|	ШапкаДокумента.СчетЗатрат.Код КАК СубСчет,
			|	ШапкаДокумента.Номер КАК Номер,
			|	ШапкаДокумента.Организация.Префикс КАК Префикс
			|ИЗ
			|	Документ.ПеремещениеЗапасов КАК ШапкаДокумента
			|ГДЕ
			|	ШапкаДокумента.Ссылка = &ТекущийДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПеремещениеЗапасов.НомерСтроки КАК НомерСтроки,
			|	ПеремещениеЗапасов.Номенклатура.НаименованиеПолное КАК Запас,
			|	ПеремещениеЗапасов.Номенклатура.Артикул КАК Артикул,
			|	ПеремещениеЗапасов.Количество КАК КоличествоМест,
			|	ПеремещениеЗапасов.Резерв КАК Резерв,
			|	ПеремещениеЗапасов.ЗаказПокупателя КАК ЗаказПокупателя,
			|	ПеремещениеЗапасов.Характеристика КАК Характеристика,
			|	ПеремещениеЗапасов.Номенклатура.СчетУчетаЗапасов.Код КАК Счет,
			|	ПеремещениеЗапасов.Номенклатура.Код КАК ТоварКод,
			|	ПеремещениеЗапасов.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияНаименование,
			|	ПеремещениеЗапасов.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
			|	ВЫБОР
			|		КОГДА ПеремещениеЗапасов.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
			|			ТОГДА ПеремещениеЗапасов.ЕдиницаИзмерения.Коэффициент
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК КоличествоВОдномМесте,
			|	ВЫБОР
			|		КОГДА &ВалютаВидЦен = НациональнаяВалюта.Значение
			|			ТОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
			|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
			|	КОНЕЦ КАК Цена,
			|	ВЫБОР
			|		КОГДА &ВалютаВидЦен = НациональнаяВалюта.Значение
			|			ТОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена * ПеремещениеЗапасов.Количество, 0)
			|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена * ПеремещениеЗапасов.Количество, 0) * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
			|	КОНЕЦ КАК Сумма
			|ИЗ
			|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|				&ДатаДокумента,
			|				Номенклатура В (&СписокНоменклатура)
			|					И Характеристика В (&СписокХарактеристика)
			|					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
			|		ПО ПеремещениеЗапасов.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|			И ПеремещениеЗапасов.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
			|			И ПеремещениеЗапасов.Ссылка.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен = ЦеныНоменклатурыСрезПоследних.ВидЦен,
			|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, Валюта = &ВалютаВидЦен) КАК КурсыВалютСрезПоследних,
			|	Константа.НациональнаяВалюта КАК НациональнаяВалюта
			|ГДЕ
			|	ПеремещениеЗапасов.Ссылка = &ТекущийДокумент
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			РозничныйВидДокумента = ТекущийДокумент.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен;
			
			Если НЕ ЗначениеЗаполнено(РозничныйВидДокумента) Тогда
				
				РозничныйВидДокумента = Справочники.ВидыЦен.Учетная;
				
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ВидЦен", 			РозничныйВидДокумента);
			Запрос.УстановитьПараметр("ВалютаВидЦен", 		РозничныйВидДокумента.ВалютаЦены);
			Запрос.УстановитьПараметр("ДатаДокумента", 		ТекущийДокумент.Дата);
			Запрос.УстановитьПараметр("СписокНоменклатура", ТекущийДокумент.Запасы.ВыгрузитьКолонку("Номенклатура"));
			Запрос.УстановитьПараметр("СписокХарактеристика", ТекущийДокумент.Запасы.ВыгрузитьКолонку("Характеристика"));
			
			МассивРезультатов = Запрос.ВыполнитьПакет();
			
			Шапка = МассивРезультатов[0].Выбрать();
			Шапка.Следующий();
			
			ВыборкаСтрокЗапасы = МассивРезультатов[1].Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеЗапасов_ТОРГ13";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.ПеремещениеЗапасов.ПФ_MXL_ТОРГ13");
			
			// Выводим общие реквизиты шапки
			Если Шапка.ДатаДокумента < Дата('20110101') Тогда
				НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
			Иначе
				НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			КонецЕсли;
			
			СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
			ОбластьМакета         = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.ПредставлениеОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации);
			ОбластьМакета.Параметры.НомерДокумента           = НомерДокумента;
			ОбластьМакета.Параметры.ДатаДокумента            = Шапка.ДатаДокумента;
			ОбластьМакета.Параметры.ОрганизацияПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			СтрокНаСтранице = 23;
			СтрокШапки      = 10;
			СтрокПодвала    = 9;
			НомерСтраницы   = 1;
			
			// Выводим заголовок таблицы
			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
			ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
			
			КоличествоСтрок = ВыборкаСтрокЗапасы.Количество();
			
			Если КоличествоСтрок = 1 Тогда
				ПереноситьПоследнююСтроку = 0;
			Иначе
				ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
				ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
				ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
			КонецЕсли;
			
			// инициализация итогов по странице
			ИтогКоличествоМестПоСтранице = 0;
			ИтогСуммыПоСтранице = 0;
			
			// инициализация итогов по документу
			ИтогоКоличество  = 0;
			ИтогоСумма = 0;
			
			Ном = 0;
			
			// Выводим многострочную часть докмента
			ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Пока ВыборкаСтрокЗапасы.Следующий() Цикл
				
				Ном = Ном + 1;
				
				//Начинаем новую страницу, если предыдущая строка была последней на странице
				//или пора переносить последнюю строку на последнюю страницу с подвалом.
				ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
				
				Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				 ИЛИ ((ПереноситьПоследнююСтроку = 1) И (Ном = КоличествоСтрок)) Тогда
					
					ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
					ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице = ИтогСуммыПоСтранице;
					
					ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
					
					// инициализация итогов по странице
					ИтогКоличествоМестПоСтранице = 0;
					ИтогСуммыПоСтранице = 0;
					
					НомерСтраницы = НомерСтраницы + 1;
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
					ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
					
				КонецЕсли;
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
				КоличествоМест = ВыборкаСтрокЗапасы.КоличествоМест;
				ОбластьМакета.Параметры.ТоварНаименование = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(
					ВыборкаСтрокЗапасы.Запас,
					ВыборкаСтрокЗапасы.Характеристика,
					ВыборкаСтрокЗапасы.Артикул);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				// Обновим итоги по странице
				ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + КоличествоМест;
				ИтогСуммыПоСтранице = ИтогСуммыПоСтранице + ВыборкаСтрокЗапасы.Сумма;
				
				// Обновим итогов по документу
				ИтогоКоличество  = ИтогоКоличество + КоличествоМест;
				ИтогоСумма = ИтогоСумма + ВыборкаСтрокЗапасы.Сумма;
				
			КонецЦикла;
			
			ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице = ИтогСуммыПоСтранице;
			
			ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
			
			// Выводим итоги по документу в целом
			ОбластьМакета = Макет.ПолучитьОбласть("Всего");
			ОбластьМакета.Параметры.ИтогоКоличествоМест = ИтогоКоличество;
			ОбластьМакета.Параметры.ИтогоСумма = ИтогоСумма;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим подвал документа
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Зададим параметры макета
			ТабличныйДокумент.ПолеСверху = 0;
			ТабличныйДокумент.ПолеСлева  = 0;
			ТабличныйДокумент.ПолеСнизу  = 0;
			ТабличныйДокумент.ПолеСправа = 0;
			ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
			
		ИначеЕсли ИмяМакета = "МХ18" Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПеремещениеЗапасов.Дата КАК ДатаДокумента,
			|	ПеремещениеЗапасов.Организация КАК Организация,
			|	ПеремещениеЗапасов.СтруктурнаяЕдиница КАК Отправитель,
			|	ПеремещениеЗапасов.СтруктурнаяЕдиницаПолучатель КАК Получатель,
			|	ПеремещениеЗапасов.СчетЗатрат.Код КАК СубСчет,
			|	ПеремещениеЗапасов.Номер,
			|	ПеремещениеЗапасов.Организация.Префикс КАК Префикс,
			|	ПеремещениеЗапасов.Запасы.(
			|		НомерСтроки,
			|		Номенклатура.НаименованиеПолное КАК Запас,
			|		Номенклатура.Артикул КАК Артикул,
			|		Количество КАК КоличествоМест,
			|		Резерв КАК Резерв,
			|		ЗаказПокупателя КАК ЗаказПокупателя,
			|		Характеристика,
			|		ЕдиницаИзмерения.Наименование КАК ВидУпаковки,
			|		Номенклатура.СчетУчетаЗапасов.Код КАК Счет,
			|		Номенклатура.Код КАК ТоварКод,
			|		Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияНаименование,
			|		Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
			|		ВЫБОР
			|			КОГДА ПеремещениеЗапасов.Запасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
			|				ТОГДА ПеремещениеЗапасов.Запасы.ЕдиницаИзмерения.Коэффициент
			|			ИНАЧЕ 1
			|		КОНЕЦ КАК КоличествоВОдномМесте
			|	)
			|ИЗ
			|	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
			|ГДЕ
			|	ПеремещениеЗапасов.Ссылка = &ТекущийДокумент";
			
			Шапка = Запрос.Выполнить().Выбрать();
			Шапка.Следующий();
			
			ВыборкаСтрокЗапасы = Шапка.Запасы.Выгрузить();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеЗапасов_МХ18";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.ПеремещениеЗапасов.ПФ_MXL_МХ18");
			
			// Выводим общие реквизиты шапки
			Если Шапка.ДатаДокумента < Дата('20110101') Тогда
				НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
			Иначе
				НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			КонецЕсли;
			
			СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
			ОбластьМакета         = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.ПредставлениеОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации);
			ОбластьМакета.Параметры.НомерДокумента           = НомерДокумента;
			ОбластьМакета.Параметры.ДатаДокумента            = Шапка.ДатаДокумента;
			ОбластьМакета.Параметры.ОрганизацияПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			СтрокНаСтранице = 23;
			СтрокШапки      = 10;
			СтрокПодвала    = 9;
			НомерСтраницы   = 1;
			
			// Выводим заголовок таблицы
			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
			ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
			
			КоличествоСтрок = ВыборкаСтрокЗапасы.Количество();
			
			Если КоличествоСтрок = 1 Тогда
				ПереноситьПоследнююСтроку = 0;
			Иначе
				ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
				ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
				ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
			КонецЕсли;
			
			// инициализация итогов по странице
			ИтогКоличествоМестПоСтранице = 0;
			
			// инициализация итогов по документу
			ИтогоКоличество  = 0;
			
			Ном = 0;
			
			// Выводим многострочную часть докмента
			ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			
			Для каждого СтрокаЗапасы Из ВыборкаСтрокЗапасы Цикл
				
				Ном = Ном + 1;
				
				//Начинаем новую страницу, если предыдущая строка была последней на странице
				//или пора переносить последнюю строку на последнюю страницу с подвалом.
				ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
				
				Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				 ИЛИ ((ПереноситьПоследнююСтроку = 1) И (Ном = КоличествоСтрок)) Тогда
					
					ОбластьИтоговПоСтранице.Параметры.ИтогМестНаСтранице = ИтогКоличествоМестПоСтранице;
					
					ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
					
					// инициализация итогов по странице
					ИтогКоличествоМестПоСтранице = 0;
					
					НомерСтраницы = НомерСтраницы + 1;
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
					ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
					
				КонецЕсли;
				
				ОбластьМакета.Параметры.Заполнить(СтрокаЗапасы);
				КоличествоМест = СтрокаЗапасы.КоличествоМест;
				ОбластьМакета.Параметры.ТоварНаименование = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(СтрокаЗапасы.Запас, СтрокаЗапасы.Характеристика, СтрокаЗапасы.Артикул);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				// Обновим итоги по странице
				ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + КоличествоМест;
				
				// Обновим итогов по документу
				ИтогоКоличество  = ИтогоКоличество  + КоличествоМест;
				
			КонецЦикла;
			
			ОбластьИтоговПоСтранице.Параметры.ИтогМестНаСтранице = ИтогКоличествоМестПоСтранице;
			
			ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
			
			// Выводим итоги по документу в целом
			ОбластьМакета = Макет.ПолучитьОбласть("Всего");
			ОбластьМакета.Параметры.ИтогМест = ИтогоКоличество;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим подвал документа
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Зададим параметры макета
			ТабличныйДокумент.ПолеСверху = 0;
			ТабличныйДокумент.ПолеСлева  = 0;
			ТабличныйДокумент.ПолеСнизу  = 0;
			ТабличныйДокумент.ПолеСправа = 0;
			ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
			
		ИначеЕсли ИмяМакета = "БланкТоварногоНаполненияОтправитель" Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПеремещениеЗапасов.Дата КАК ДатаДокумента,
			|	ПеремещениеЗапасов.СтруктурнаяЕдиница КАК ПредставлениеСклада,
			|	ПеремещениеЗапасов.Ячейка КАК ПредставлениеЯчейки,
			|	ПеремещениеЗапасов.Номер,
			|	ПеремещениеЗапасов.Организация.Префикс КАК Префикс,
			|	ПеремещениеЗапасов.Запасы.(
			|		НомерСтроки КАК НомерСтроки,
			|		Номенклатура.Склад КАК Склад,
			|		Номенклатура.Ячейка КАК Ячейка,
			|		ВЫБОР
			|			КОГДА (ВЫРАЗИТЬ(ПеремещениеЗапасов.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
			|				ТОГДА ПеремещениеЗапасов.Запасы.Номенклатура.Наименование
			|			ИНАЧЕ ПеремещениеЗапасов.Запасы.Номенклатура.НаименованиеПолное
			|		КОНЕЦ КАК Запас,
			|		Номенклатура.Артикул КАК Артикул,
			|		Номенклатура.Код КАК Код,
			|		ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
			|		Количество КАК Количество,
			|		Характеристика,
			|		Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
			|	)
			|ИЗ
			|	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
			|ГДЕ
			|	ПеремещениеЗапасов.Ссылка = &ТекущийДокумент
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Шапка = Запрос.Выполнить().Выбрать();
			Шапка.Следующий();
			
			ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеЗапасов_БланкТоварногоНаполнения";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.ПеремещениеЗапасов.ПФ_MXL_БланкТоварногоНаполнения");
			
			Если Шапка.ДатаДокумента < Дата('20110101') Тогда
				НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
			Иначе
				НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.ТекстЗаголовка =
				"Перемещение запасов № "
			  + НомерДокумента
			  + " от "
			  + Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Склад");
			ОбластьМакета.Параметры.ПредставлениеСклада = Шапка.ПредставлениеСклада;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если Константы.ФункциональнаяОпцияУчетПоЯчейкам.Получить() Тогда
				
				ОбластьМакета = Макет.ПолучитьОбласть("Ячейка");
				ОбластьМакета.Параметры.ПредставлениеЯчейки = Шапка.ПредставлениеЯчейки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ВремяПечати");
			ОбластьМакета.Параметры.ВремяПечати =
				"Дата и время печати: "
			  + ТекущаяДата()
			  + ". Пользователь: "
			  + Пользователи.ТекущийПользователь();
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			
			Пока ВыборкаСтрокЗапасы.Следующий() Цикл
				
				Если НЕ ВыборкаСтрокЗапасы.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
				ОбластьМакета.Параметры.Запас = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(
					ВыборкаСтрокЗапасы.Запас,
					ВыборкаСтрокЗапасы.Характеристика,
					ВыборкаСтрокЗапасы.Артикул
				);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		ИначеЕсли ИмяМакета = "БланкТоварногоНаполненияПолучатель" Тогда
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПеремещениеЗапасов.Дата КАК ДатаДокумента,
			|	ПеремещениеЗапасов.СтруктурнаяЕдиницаПолучатель КАК ПредставлениеСклада,
			|	ПеремещениеЗапасов.ЯчейкаПолучатель КАК ПредставлениеЯчейки,
			|	ПеремещениеЗапасов.Номер,
			|	ПеремещениеЗапасов.Организация.Префикс КАК Префикс,
			|	ПеремещениеЗапасов.Запасы.(
			|		НомерСтроки КАК НомерСтроки,
			|		Номенклатура.Склад КАК Склад,
			|		Номенклатура.Ячейка КАК Ячейка,
			|		ВЫБОР
			|			КОГДА (ВЫРАЗИТЬ(ПеремещениеЗапасов.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
			|				ТОГДА ПеремещениеЗапасов.Запасы.Номенклатура.Наименование
			|			ИНАЧЕ ПеремещениеЗапасов.Запасы.Номенклатура.НаименованиеПолное
			|		КОНЕЦ КАК Запас,
			|		Номенклатура.Артикул КАК Артикул,
			|		Номенклатура.Код КАК Код,
			|		ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
			|		Количество КАК Количество,
			|		Характеристика,
			|		Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
			|	)
			|ИЗ
			|	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
			|ГДЕ
			|	ПеремещениеЗапасов.Ссылка = &ТекущийДокумент
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Шапка = Запрос.Выполнить().Выбрать();
			Шапка.Следующий();
			
			ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеЗапасов_БланкТоварногоНаполнения";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.ПеремещениеЗапасов.ПФ_MXL_БланкТоварногоНаполнения");
			
			Если Шапка.ДатаДокумента < Дата('20110101') Тогда
				НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
			Иначе
				НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.ТекстЗаголовка =
				"Перемещение запасов № "
			  + НомерДокумента
			  + " от "
			  + Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Склад");
			ОбластьМакета.Параметры.ПредставлениеСклада = Шапка.ПредставлениеСклада;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если Константы.ФункциональнаяОпцияУчетПоЯчейкам.Получить() Тогда
				
				ОбластьМакета = Макет.ПолучитьОбласть("Ячейка");
				ОбластьМакета.Параметры.ПредставлениеЯчейки = Шапка.ПредставлениеЯчейки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ВремяПечати");
			ОбластьМакета.Параметры.ВремяПечати =
				"Дата и время печати: "
			  + ТекущаяДата()
			  + ". Пользователь: "
			  + Пользователи.ТекущийПользователь();
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			
			Пока ВыборкаСтрокЗапасы.Следующий() Цикл
				
				Если НЕ ВыборкаСтрокЗапасы.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
				ОбластьМакета.Параметры.Запас = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(
					ВыборкаСтрокЗапасы.Запас,
					ВыборкаСтрокЗапасы.Характеристика,
					ВыборкаСтрокЗапасы.Артикул
				);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов,
				 ПараметрыПечати,
				 КоллекцияПечатныхФорм,
				 ОбъектыПечати,
				 ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М11") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "М11", "М-11", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "М11"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТОРГ13") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТОРГ13", "ТОРГ-13", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ТОРГ13"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МХ18") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МХ18", "МХ-18", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МХ18"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПеремещениеЗапасов") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПеремещениеЗапасов", "Перемещение запасов", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПеремещениеЗапасов"));
	КонецЕсли;	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "БланкТоварногоНаполненияОтправитель") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "БланкТоварногоНаполненияОтправитель", "Бланк товарного наполнения", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "БланкТоварногоНаполненияОтправитель"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "БланкТоварногоНаполненияПолучатель") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "БланкТоварногоНаполненияПолучатель", "Бланк товарного наполнения", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "БланкТоварногоНаполненияПолучатель"));
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции
