
&НаКлиенте
Процедура ЛицензииЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();

КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти()
	
	СтрокаТабличнойЧасти = Элементы.Лицензии.ТекущиеДанные;
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Цена + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	ОбновитьПодвалФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуНДС(СтрокаТабличнойЧасти)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);	
	СтрокаТабличнойЧасти.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
									  СтрокаТабличнойЧасти.Цена - (СтрокаТабличнойЧасти.Цена) / ((СтавкаНДС + 100) / 100),
									  СтрокаТабличнойЧасти.Цена * СтавкаНДС / 100);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ВалютаРасчетов = Объект.Договор.ВалютаРасчетов;
	НациональнаяВалюта = Константы.НациональнаяВалюта.Получить();
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", НациональнаяВалюта));
	КурсНациональнаяВалюта = СтруктураПоВалюте.Курс;
	КратностьНациональнаяВалюта = СтруктураПоВалюте.Кратность;

	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);

	Объект.НДСВключатьВСтоимость = Истина;

	//// Сформируем надпись цены и валюты.
	//УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	//СтруктураНадписи = Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, УчетВалютныхОпераций, НалогообложениеНДС,ВидЦен", Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, КурсНациональнаяВалюта, УчетВалютныхОпераций, Объект.НалогообложениеНДС,Объект.ВидЦен);
	//ЦеныИВалюта = СформироватьНадписьЦеныИВалюта();
	ПодготовитьДанныеДляСформированияНадписи();
	
	// Обновим подвал формы.
	ИтогВсего = Объект.Лицензии.Итог("Всего");
	ИтогСуммаНДС = Объект.Лицензии.Итог("СуммаНДС");   
	
	УстановитьВидимостьИДоступность();
	УстановитьВидимостьПоНДС(); 
	
КонецПроцедуры      

&НаСервере                 
Процедура УстановитьВидимостьИДоступность()   
	
	Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда		
		Элементы.ЛицензииСтавкаНДС.Видимость = Истина;
		Элементы.ЛицензииСуммаНДС.Видимость = Истина;
		//Элементы.ЗапасыВсего.Видимость = Истина;		
	Иначе	
		Элементы.ЛицензииСтавкаНДС.Видимость = Ложь;
		Элементы.ЛицензииСуммаНДС.Видимость = Ложь;
		//Элементы.ЗапасыВсего.Видимость = Ложь;		
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПодготовитьДанныеДляСформированияНадписи()
	
	// Сформируем надпись цены и валюты.
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	СтруктураНадписи = Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, УчетВалютныхОпераций, НалогообложениеНДС,ВидЦен", Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, КурсНациональнаяВалюта, УчетВалютныхОпераций, Объект.НалогообложениеНДС,Объект.ВидЦен);
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвалФормы()
	
	ИтогВсего = Объект.Лицензии.Итог("Всего");
	ИтогСуммаНДС = Объект.Лицензии.Итог("СуммаНДС");
		
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьНадписьЦеныИВалюта(СтруктураНадписи)
	
	ТекстНадписи = "";
	
	// Валюта.
	Если СтруктураНадписи.УчетВалютныхОпераций Тогда
		Если ЗначениеЗаполнено(СтруктураНадписи.ВалютаДокумента) Тогда
			ТекстНадписи = НСтр("ka='%Валюта%';ru='%Валюта%';en='%Валюта%'");
			ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Валюта%", СокрЛП(Строка(СтруктураНадписи.ВалютаДокумента)));
		КонецЕсли;
	КонецЕсли;
			
	// Налогообложение НДС.
	Если ЗначениеЗаполнено(СтруктураНадписи.НалогообложениеНДС) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%НалогообложениеНДС%';ru='%НалогообложениеНДС%';en='% НалогообложениеНДС%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ka=' • %НалогообложениеНДС%';ru=' • %НалогообложениеНДС%'");
		КонецЕсли;	
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%НалогообложениеНДС%", РаботаСФормойДокументаКлиентСервер.КраткоеПредставлениеТипаНалогообложенияНДС(СтруктураНадписи.НалогообложениеНДС));
	КонецЕсли;
	
	//// Флаг сумма включает НДС.
	//Если ПустаяСтрока(ТекстНадписи) Тогда	
	//	Если СтруктураНадписи.СуммаВключаетНДС Тогда	
	//		ТекстНадписи = НСтр("en='Amount with VAT';ka='თანხა შეიცავს დღგ-ს';ru='Сумма включает НДС'");
	//	Иначе		
	//		ТекстНадписи = НСтр("ka='თანხა არ შეიცავს დღგ-ს';ru='Сумма не включает НДС';en='The sum does not include VAT'");
	//	КонецЕсли;	
	//КонецЕсли;	
	
	// Вид цен
	Если ЗначениеЗаполнено(СтруктураНадписи.ВидЦен) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%ВидЦен%';ru='%ВидЦен%';en='% ВидЦен%'");
		Иначе	
			ТекстНадписи = ТекстНадписи + НСтр("ka=' • %ВидЦен%';ru=' • %ВидЦен%'");
		КонецЕсли;
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ВидЦен%", СокрЛП(Строка(СтруктураНадписи.ВидЦен)));
	КонецЕсли;
	
 
	Возврат ТекстНадписи;
	
КонецФункции // СформироватьНадписьЦеныИВалюта()

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПередИзменением = Контрагент;
	//КонтрагентВестиРасчетыПоЗаказамПередИзменением = КонтрагентВестиРасчетыПоЗаказам;
	Контрагент = Объект.Контрагент;
	
	Если КонтрагентПередИзменением <> Объект.Контрагент Тогда
				
		//ОчиститьОснованиеПриИзменениеКонтрагентаДоговора();
	
		ВидимостьДоговораПередИзменением = Элементы.Договор.Видимость;		
		СтруктураДанные = ПолучитьДанныеКонтрагентПриИзменении(Объект.Дата, Объект.ВалютаДокумента, Объект.Контрагент, Объект.Организация);	
		Объект.Договор = СтруктураДанные.Договор;
		Объект.ВалютаДокумента = СтруктураДанные.ВалютаРасчетов;

		//Объект.КонтактноеЛицоПодписант = СтруктураДанные.КонтактноеЛицоПодписант;
		
		ДоговорПередИзменением = Договор;
		Договор = Объект.Договор;
		
		
		////+++ Lazare_13.04.2021
		Объект.ВидЦен = СтруктураДанные.ВидЦен;
		//ВидыЦенПередИзменением  = ВидЦен ;
		////ВидЦен = Объект.ВидЦен ;
		////--- Lazare_13.04.2021
		
				
		////УстановитьВидимостьПоНДФЛ();
		НалогообложениеПередИзменением = Объект.НалогообложениеНДС;
		ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
		Если НалогообложениеПередИзменением = Объект.НалогообложениеНДС Тогда
			ПересчитатьСуммыТЧ(Объект.НалогообложениеНДС, Объект.СуммаВключаетНДС);
		КонецЕсли;
	
			
		КонтрагентПриИзмененииФрагмент(ДоговорПередИзменением, СтруктураДанные);
			
	Иначе	
		Объект.Договор = Договор; // Восстанавливаем автоматически очищеный договор.
		
		//УстановитьВидимостьПоНДФЛ();//Паганини
		ПересчитатьСуммыТЧ(Объект.НалогообложениеНДС, Объект.СуммаВключаетНДС);//_Паганини
		
	КонецЕсли;
	
	ПодготовитьДанныеДляСформированияНадписи();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеКонтрагентПриИзменении(Дата, ВалютаДокумента, Контрагент, Организация)
	
	ДоговорПоУмолчанию = ПолучитьДоговорПоУмолчанию(Объект.Ссылка, Контрагент, Организация);
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"КонтактноеЛицоПодписант",
		Контрагент.КонтактноеЛицоПодписант
	);
	
	СтруктураДанные.Вставить(
		"Договор",
		ДоговорПоУмолчанию
	);
		
	СтруктураДанные.Вставить(
		"ВалютаРасчетов",
		ДоговорПоУмолчанию.ВалютаРасчетов
	);
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетовКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ДоговорПоУмолчанию.ВалютаРасчетов))
	);
	
	СтруктураДанные.Вставить(
		"ВидЦенКонтрагента",
		ДоговорПоУмолчанию.ВидЦенКонтрагента
	);
	
	СтруктураДанные.Вставить(
		"РасчетыВУсловныхЕдиницах",
		ДоговорПоУмолчанию.РасчетыВУсловныхЕдиницах
	);
	
	СтруктураДанные.Вставить(
		"СуммаВключаетНДС",
		?(ЗначениеЗаполнено(ДоговорПоУмолчанию.ВидЦенКонтрагента), ДоговорПоУмолчанию.ВидЦенКонтрагента.ЦенаВключаетНДС, Неопределено)
	);
	
	СтруктураДанные.Вставить(
		"УчетЦенКонтрагентов",
		ПолучитьФункциональнуюОпцию("УчетЦенКонтрагентов")
	);
	
	СтруктураДанные.Вставить(
		"ВидЦен",
		ДоговорПоУмолчанию.ВидЦен);

		
	//УстановитьВидимостьДоговора();
	
		
	//ОбновитьВидимостьИОстаткиВзаиморасчетов();
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеКонтрагентПриИзменении()


&НаСервереБезКонтекста
Функция ПолучитьДоговорПоУмолчанию(Документ, Контрагент, Организация)
	
	Если Не Контрагент.ВестиРасчетыПоДоговорам Тогда
		Возврат Контрагент.ДоговорПоУмолчанию;
	КонецЕсли;
	
	МенеджерСправочника = Справочники.ДоговорыКонтрагентов;
	
	СписокВидовДоговоров = МенеджерСправочника.ПолучитьСписокВидовДоговораДляДокумента(Документ);
	ДоговорПоУмолчанию = МенеджерСправочника.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(Контрагент, Организация, СписокВидовДоговоров);
	// Kuzmich, 19.08.2019, Использовать виды договоров, Доработка
	Если ЗначениеЗаполнено(ДоговорПоУмолчанию) И Константы.ИспользоватьВидыДоговоров.Получить() Тогда
		Если НЕ ДоговорПоУмолчанию.Поставщик Тогда
			ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	// Kuzmich, 19.08.2019, Использовать виды договоров, Доработка
	
	Возврат ДоговорПоУмолчанию;
	
КонецФункции

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ОбработатьИзменениеДоговора();
	//Объект.ВалютаДокумента = 
	ПодготовитьДанныеДляСформированияНадписи();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеДоговора()
	
	ДоговорПередИзменением = Договор;
	Договор = Объект.Договор;
	
	Если ДоговорПередИзменением <> Объект.Договор Тогда
		
		//ОчиститьОснованиеПриИзменениеКонтрагентаДоговора();	
			
		ОбработатьИзменениеДоговораФрагмент(ДоговорПередИзменением);
				
	Иначе	
		Объект.Договор = Договор; // Восстанавливаем автоматически очищеный договор.		
	КонецЕсли; 
	
	
	//	
	//Если ДоговорПередИзменением <> Объект.Договор Тогда
	//	
	//	ОчиститьОснованиеПриИзменениеКонтрагентаДоговора();
	//	
	//	Если Объект.Предоплата.Количество() > 0
	//	   И Объект.Договор <> ДоговорПередИзменением Тогда
	//		
	//		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьИзменениеДоговораЗавершение", ЭтотОбъект, Новый Структура("ДоговорПередИзменением", ДоговорПередИзменением)),
	//			НСтр("ka='წინასწარი გადახდის ჩათვლა გაიწმინდება, გავაგრძელოთ?';ru='Зачет предоплаты будет очищен, продолжить?';en='Passed prepayment will be cleared to continue?'"),
	//			РежимДиалогаВопрос.ДаНет
	//		);
	//		Возврат;
	//		
	//	КонецЕсли;	
	//	ОбработатьИзменениеДоговораФрагмент(ДоговорПередИзменением);
	//	УстановитьВидимостьПоНДФЛ();//Паганини	
	//Иначе		
	//	Объект.Договор = Договор; // Восстанавливаем автоматически очищеный договор.
	//	Заказ = Объект.Заказ;
	//	УстановитьВидимостьПоНДФЛ();//Паганини	
	//КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеДоговораФрагмент(ДоговорПередИзменением)
	
	СтруктураДанные = ПолучитьДанныеДоговорПриИзменении(Объект.Дата, Объект.ВалютаДокумента, Объект.Договор);
	
	
	Объект.ВидЦен = СтруктураДанные.ВидЦен;
	ВидыЦенПередИзменением  = ВидЦен ;
	//ВидЦен = Объект.ВидЦен ; 
	////--- Lazare_13.04.2021
	
	//+++ Дмгг
	НалогообложениеПередИзменением = Объект.НалогообложениеНДС;
	Объект.НалогообложениеНДС = СтруктураДанные.НалогообложениеСтавка.НалогообложениеНДС;
	//--- Дмгг
	
	ВалютаРасчетовПередИзменением = ВалютаРасчетов;
	ВалютаРасчетов = СтруктураДанные.ВалютаРасчетов;
	
	//Если НЕ СтруктураДанные.СуммаВключаетНДС = Неопределено Тогда
	//	Объект.СуммаВключаетНДС = СтруктураДанные.СуммаВключаетНДС;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда 
		Объект.Курс      = ?(СтруктураДанные.ВалютаРасчетовКурсКратность.Курс = 0, 1, СтруктураДанные.ВалютаРасчетовКурсКратность.Курс);
		Объект.Кратность = ?(СтруктураДанные.ВалютаРасчетовКурсКратность.Кратность = 0, 1, СтруктураДанные.ВалютаРасчетовКурсКратность.Кратность);
	КонецЕсли;
	//
	//ИзменилсяВидЦен = Объект.ВидЦенКонтрагента <> СтруктураДанные.ВидЦенКонтрагента 
	//И ЗначениеЗаполнено(СтруктураДанные.ВидЦенКонтрагента) И СтруктураДанные.УчетЦенКонтрагентов;
	НовыйДоговорИВалютаРасчетов = ЗначениеЗаполнено(Объект.Договор) И ЗначениеЗаполнено(ВалютаРасчетов); 
	//И Объект.Договор <> ДоговорПередИзменением И ВалютаРасчетовПередИзменением <> СтруктураДанные.ВалютаРасчетов;
	ОткрытьФормуЦеныИВалюты = НовыйДоговорИВалютаРасчетов И Объект.ВалютаДокумента <> СтруктураДанные.ВалютаРасчетов;
	//И (Объект.Запасы.Количество() > 0 ИЛИ Объект.Расходы.Количество() > 0);
	//
	//СтруктураДанные.Вставить("ИзменилсяВидЦен", ИзменилсяВидЦен);
	//
	//Заказ = Объект.Заказ;
	
	//Если ИзменилсяВидЦен Тогда
	//	
	//	Объект.ВидЦенКонтрагента = СтруктураДанные.ВидЦенКонтрагента;
	//	Если ЗначениеЗаполнено(Объект.ВидЦенКонтрагента) Тогда
	//		
	//		Объект.РегистрироватьЦеныПоставщика = Истина;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	Объект.ВалютаДокумента = СтруктураДанные.ВалютаРасчетов;
	
	//
	//Если ОткрытьФормуЦеныИВалюты Тогда
	//	
	//	ТекстПредупреждения = "";
	//	
	//	//Если ИзменилсяВидЦен Тогда
	//	//	ТекстПредупреждения = НСтр("ka='კონტრაგენტთან ხელშეკრულება ითვალისწინებს ფასების და ფასდაკლებების პირობებს, რომლებიც დოკუმენტში დაყენებული პირობებისგან განსხვავდება! "
	//	//	"შეიძლება, საჭიროა ფასების გადავსება.';ru='Договор с контрагентом предусматривает условия цен и скидок, "
	//	//	"отличные от установленных в документе! "
	//	//	"Возможно, необходимо перезаполнить цены.'") + Символы.ПС + Символы.ПС;
	//	//КонецЕсли;
	//	
	//	ТекстПредупреждения = ТекстПредупреждения + НСтр("ka='შეიცვალა კონტრაგენტთან ხელშეკრულებით გათვალისწინებული ანგარიშსწორების ვალუტა! აუცილებელია დოკუმენტის ვალუტის შემოწმება!';ru='Изменилась валюта расчетов по договору с контрагентом!"
	//	"Необходимо проверить валюту документа!'");
	//	//ОбработатьИзмененияПоКнопкеЦеныИВалюты(ВалютаРасчетовПередИзменением, Истина, ИзменилсяВидЦен, ТекстПредупреждения);
	//	
	//ИначеЕсли ЗначениеЗаполнено(Объект.Договор) 
	//	И ИзменилсяВидЦен Тогда
	//	
	//	ПересчетНеобходим = (Объект.Запасы.Количество() > 0);
	//	
	//	Объект.ВидЦенКонтрагента	= СтруктураДанные.ВидЦенКонтрагента;
	//	СтруктураНадписи 			= 
	//	Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦенКонтрагента, НалогообложениеНДС,ВидЦен", 
	//	Объект.ВалютаДокумента, 
	//	ВалютаРасчетов, 
	//	Объект.Курс, 
	//	КурсНациональнаяВалюта, 
	//	Объект.СуммаВключаетНДС, 
	//	УчетВалютныхОпераций, 
	//	Объект.ВидЦенКонтрагента, 
	//	Объект.НалогообложениеНДС,
	//	Объект.ВидЦен);
	//	
	//	ЦеныИВалюта 				= СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	//	
	//	Если ПересчетНеобходим Тогда
	//		
	//		Сообщение = НСтр("ka='კონტრაგენტთან ხელშეკრულება ითვალისწინებს დოკუმენტში დადგენილისგან განსხვავებულ ფასების ტიპს! გადავთვალოთ დოკუმენტი ხელშეკრულების შესაბამისად?';ru='Договор с контрагентом предусматривает вид цен, отличный от установленного в документе! "
	//		"Пересчитать документ в соответствии с договором?'");
	//		
	//		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьИзменениеДоговораФрагментЗавершение", ЭтотОбъект, Новый Структура("ДоговорПередИзменением, ВалютаРасчетовПередИзменением, СтруктураДанные", ДоговорПередИзменением, ВалютаРасчетовПередИзменением, СтруктураДанные)), 
	//		Сообщение,
	//		РежимДиалогаВопрос.ДаНет
	//		);
	//		Возврат;
	//		
	//	КонецЕсли;
	//	
	//Иначе
	//	
	//	СтруктураНадписи 			= 
	//	Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦенКонтрагента, НалогообложениеНДС,ВидЦен", 
	//	Объект.ВалютаДокумента, 
	//	ВалютаРасчетов, 
	//	Объект.Курс, 
	//	КурсНациональнаяВалюта, 
	//	Объект.СуммаВключаетНДС, 
	//	УчетВалютныхОпераций, 
	//	Объект.ВидЦенКонтрагента, 
	//						Объект.НалогообложениеНДС,
	//						Объект.ВидЦен);
	//	
	//	ЦеныИВалюта 				= СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	//	
	//КонецЕсли;
	
	//+++ Дмгг
	Если НалогообложениеПередИзменением = Объект.НалогообложениеНДС Тогда
		//ПересчитатьСуммыТЧ(Объект.НалогообложениеНДС, Объект.СуммаВключаетНДС);
	КонецЕсли;
	//--- Дмгг
	
	
	//ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеДоговорПриИзменении(Дата, ВалютаДокумента, Договор)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетов",
		Договор.ВалютаРасчетов
	);
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетовКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Договор.ВалютаРасчетов))
	);
	
	СтруктураДанные.Вставить(
		"РасчетыВУсловныхЕдиницах",
		Договор.РасчетыВУсловныхЕдиницах
	);
	
	СтруктураДанные.Вставить(
		"ВидЦенКонтрагента",
		Договор.ВидЦенКонтрагента
	);
	
	СтруктураДанные.Вставить(
		"СуммаВключаетНДС",
		?(ЗначениеЗаполнено(Договор.ВидЦенКонтрагента), Договор.ВидЦенКонтрагента.ЦенаВключаетНДС, Неопределено)
	);
	
	СтруктураДанные.Вставить(
		"УчетЦенКонтрагентов",
		ПолучитьФункциональнуюОпцию("УчетЦенКонтрагентов")
	);
	
	//+++ Двгг
	Если ПолучитьФункциональнуюОпцию("ФункциональнаяОпцияИспользоватьИсториюНалогообложенияКонтрагентов") Тогда
		СтруктураДанные.Вставить(
			"НалогообложениеСтавка",
			РегистрыСведений.НалогообложениеКонтрагентов.ПолучитьПоследнее(Дата, Новый Структура("Контрагент,Договор", Договор.Владелец, Договор))
			);
	Иначе
		СтруктураДанные.Вставить(
			"НалогообложениеСтавка", Новый Структура("НалогообложениеНДС",Договор.Владелец.НалогообложениеНДС));
	КонецЕсли;
	//--- Дмгг
	
		
	//+++ Lazare_13.04.2021
	СтруктураДанные.Вставить(
		"ВидЦен",
		Договор.ВидЦен);
	//--- Lazare_13.04.2021
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДоговорПриИзменении()

&НаКлиенте
Процедура ЛицензииНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Лицензии.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);	
	СтруктураДанные.Вставить("ДатаОбработки",	 Объект.Дата);
	СтруктураДанные.Вставить("ВалютаДокумента",  Объект.ВалютаДокумента);
	//СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	СтруктураДанные.Вставить("Характеристика", Неопределено);
	СтруктураДанные.Вставить("ВидЦен",Объект.ВидЦен);
	СтруктураДанные.Вставить("Коэффициент", 1);  
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);

	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.СтавкаЛицензии = СтруктураДанные.СтавкаЛицензии;
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.ЦенаПоВидЦен ;
	СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
		

	
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("СтавкаЛицензии", СтруктураДанные.Номенклатура.СтавкаЛицензии);

	Если СтруктураДанные.Свойство("НалогообложениеНДС") 
		И НЕ СтруктураДанные.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		
		Если СтруктураДанные.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
			СтруктураДанные.Вставить("СтавкаНДС", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС());
		Иначе
			СтруктураДанные.Вставить("СтавкаНДС", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль());
		КонецЕсли;
	
	ИначеЕсли ЗначениеЗаполнено(СтруктураДанные.Номенклатура.СтавкаНДС) Тогда
		СтруктураДанные.Вставить("СтавкаНДС", СтруктураДанные.Номенклатура.СтавкаНДС);
	Иначе
		СтруктураДанные.Вставить("СтавкаНДС", СтруктураДанные.Организация.СтавкаНДСПоУмолчанию);
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("ВидЦен") Тогда
		Цена = УправлениеНебольшойФирмойСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
		СтруктураДанные.Вставить("ЦенаПоВидЦен", Цена);
	Иначе
		СтруктураДанные.Вставить("ЦенаПоВидЦен", 0);
	КонецЕсли;
			
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицензииСтавкаНДСПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьЗачетПредоплаты(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПоказатьПредупреждение(, НСтр("ka='დასაწყისში მიუთითეთ კონტრაგენტი!';ru='Укажите вначале контрагента!';en='Specify the first contractor!'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
		ПоказатьПредупреждение(, НСтр("ka='დასაწყისში მიუთითეთ კონტრაგენტის ხელშეკრულება!';ru='Укажите вначале договор контрагента!';en='Specify the first contract counterparty!'"));
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	//Для каждого ТекЭлемент Из Объект.Лицензии Цикл
	//	СтруктураЗаказа = Новый Структура("Заказ, Всего");
	//	СтруктураЗаказа.Заказ = ?(ТекЭлемент.Заказ = Неопределено, ПредопределенноеЗначение("Документ.ЗаказПоставщику.ПустаяСсылка"), ТекЭлемент.Заказ);
	//	СтруктураЗаказа.Всего = ТекЭлемент.Всего;
	//	МассивЗаказов.Добавить(СтруктураЗаказа);
	//КонецЦикла;
	//Для каждого ТекЭлемент Из Объект.Лицензии Цикл
	//	СтруктураЗаказа = Новый Структура("Заказ, Всего");
	//	СтруктураЗаказа.Заказ = ТекЭлемент.ЗаказПоставщику;
	//	СтруктураЗаказа.Всего = ТекЭлемент.Всего;
	//	МассивЗаказов.Добавить(СтруктураЗаказа);
	//КонецЦикла;
	////+++ Дмгг
	//Для каждого ТекЭлемент Из Объект.ЗатратыНаИмущество Цикл
	//	СтруктураЗаказа = Новый Структура("Заказ, Всего");
	//	СтруктураЗаказа.Заказ = ТекЭлемент.ЗаказПоставщику;
	//	СтруктураЗаказа.Всего = ТекЭлемент.Всего;
	//	МассивЗаказов.Добавить(СтруктураЗаказа);
	//КонецЦикла;
	////--- Дмгг
	
	//ЗначениеПодбор = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика")
	//					ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ЗакупкаКапитальныхЗатрат")); //+++ Дмгг
	АдресПредоплатаВХранилище = ПоместитьПредоплатаВХранилище();
	ПараметрыПодбора = Новый Структура(
		"АдресПредоплатаВХранилище,
		|Подбор,
		|ЕстьЗаказ,
		|ЗаказВШапке,
		|Компания,
		|Заказ,
		|Дата,
		|Ссылка,
		|Контрагент,
		|Договор,
		|Курс,
		|Кратность,
		|ВалютаДокумента,
		|СуммаДокумента",
		АдресПредоплатаВХранилище, // АдресПредоплатаВХранилище
		( Истина), // Подбор
		Ложь,//ЕстьЗаказ
		истина,
		Компания, // Компания
		Неопределено,
		Объект.Дата, // Дата
		Объект.Ссылка, // Ссылка
		Объект.Контрагент, // Контрагент
		Объект.Договор, // Договор
		Объект.Курс, // Курс
		Объект.Кратность, // Кратность
		Объект.ВалютаДокумента, // ВалютаДокумента
		Объект.Лицензии.Итог("Всего")
		//--------------------------------------------------------------------------
		//// © Шишка В.В. [15 ноября 2021 г.]  НАЧАЛО
		//- Объект.Расходы.Итог("СуммаНДФЛ") - Объект.Расходы.Итог("СуммаПФ") 	
		//// © Шишка В.В. [15 ноября 2021 г.]  КОНЕЦ
		////--------------------------------------------------------------------------
	);
	
	//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика")
	//	ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ЗакупкаКапитальныхЗатрат") Тогда
	КодВозврата = Неопределено;
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораАвансовПоставщикам", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("РедактироватьЗачетПредоплатыЗавершение1", ЭтотОбъект, Новый Структура("АдресПредоплатаВХранилище, ПараметрыПодбора", АдресПредоплатаВХранилище, ПараметрыПодбора)));
	Возврат;
	//ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя") Тогда
	//	ОткрытьФорму("ОбщаяФорма.ФормаПодбораАвансовПокупателей", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("РедактироватьЗачетПредоплатыЗавершение", ЭтотОбъект, Новый Структура("АдресПредоплатаВХранилище", АдресПредоплатаВХранилище)));
	//    Возврат;
	//КонецЕсли;
	
	РедактироватьЗачетПредоплатыФрагмент1(АдресПредоплатаВХранилище, КодВозврата);
	
	
КонецПроцедуры

&НаСервере
Функция ПоместитьПредоплатаВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.Предоплата.Выгрузить(,
			"Документ,
			|Заказ,
			|СуммаРасчетов,
			|Курс,
			|Кратность,
			|СуммаПлатежа"),
		УникальныйИдентификатор
	);
	
КонецФункции // ПоместитьПредоплатаВХранилище()

&НаКлиенте
Процедура РедактироватьЗачетПредоплатыЗавершение1(Результат, ДополнительныеПараметры) Экспорт
    
    АдресПредоплатаВХранилище = ДополнительныеПараметры.АдресПредоплатаВХранилище;
    ПараметрыПодбора = ДополнительныеПараметры.ПараметрыПодбора;
   
    КодВозврата = Результат;
    
    РедактироватьЗачетПредоплатыФрагмент1(АдресПредоплатаВХранилище, КодВозврата);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗачетПредоплатыФрагмент1(Знач АдресПредоплатаВХранилище, Знач КодВозврата)
    
    РедактироватьЗачетПредоплатыФрагмент(АдресПредоплатаВХранилище, КодВозврата);

КонецПроцедуры


&НаКлиенте
Процедура РедактироватьЗачетПредоплатыФрагмент(Знач АдресПредоплатаВХранилище, Знач КодВозврата)
    
	//Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика")
	//    ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя")
	//	ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ЗакупкаКапитальныхЗатрат")) //+++ Дмгг
	//    И (КодВозврата = КодВозвратаДиалога.OK) Тогда
        ПолучитьПредоплатаИзХранилища(АдресПредоплатаВХранилище);
	//КонецЕсли;

КонецПроцедуры // РедактироватьЗачетПредоплаты()

&НаСервере
Процедура ПолучитьПредоплатаИзХранилища(АдресПредоплатаВХранилище)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресПредоплатаВХранилище);
	Объект.Предоплата.Загрузить(ТаблицаДляЗагрузки);
	
	////+++ Дмгг
	//// Прошу прощения за жтот костыль
	//Для Каждого Строк из Объект.Предоплата Цикл 
	//	
	//	СтуктураЗаполнения = ПолучитьСтавкиНаСервере(Строк.СуммаРасчетов);
	//	Строк.СуммаНДФЛ = СтуктураЗаполнения.СуммаНДФЛ;
	//	Строк.СуммаПФ = СтуктураЗаполнения.СуммаПФ;
	//	
	//КонецЦикла;
	////--- Дмгг
	
	Элементы.ГруппаПредоплата.Заголовок = РаботаСФормойДокументаКлиентСервер.ПолучитьЗаголовокПредоплаты(Объект.Предоплата, Объект.ВалютаДокумента);
	
КонецПроцедуры // ПолучитьПредоплатаИзХранилища()

&НаКлиенте
Процедура РедактироватьЦеныИВалюту(Элемент, СтандартнаяОбработка)
	Если ЭтаФорма.ТолькоПросмотр = Истина Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ОбработатьИзмененияПоКнопкеЦеныИВалюты(Объект.ВалютаДокумента);
	Модифицированность = Истина;
	
КонецПроцедуры // РедактироватьЦеныИВалюту()

&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалюты(Знач ВалютаРасчетовПередИзменением, ПересчитатьЦены = Ложь, ПерезаполнитьЦены = Ложь, ТекстПредупреждения = "")
	
	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВалютаДокумента",		  Объект.ВалютаДокумента);
	СтруктураПараметров.Вставить("Курс",				  Объект.Курс);
	СтруктураПараметров.Вставить("Кратность",			  Объект.Кратность);
	СтруктураПараметров.Вставить("НалогообложениеНДС",	  Объект.НалогообложениеНДС);
	СтруктураПараметров.Вставить("СуммаВключаетНДС",	  Объект.СуммаВключаетНДС);
	СтруктураПараметров.Вставить("НДСВключатьВСтоимость", Объект.НДСВключатьВСтоимость);
	СтруктураПараметров.Вставить("Контрагент",			  Объект.Контрагент);
	СтруктураПараметров.Вставить("Договор",				  Объект.Договор);
	СтруктураПараметров.Вставить("Организация",			  Компания);
	СтруктураПараметров.Вставить("ДатаДокумента",		  Объект.Дата);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	  ПерезаполнитьЦены);
	СтруктураПараметров.Вставить("ПересчитатьЦены",		  ПересчитатьЦены);
	СтруктураПараметров.Вставить("БылиВнесеныИзменения",  Ложь);
	СтруктураПараметров.Вставить("ВидЦенКонтрагента", 	  Объект.ВидЦенКонтрагента);
	СтруктураПараметров.Вставить("РегистрироватьЦеныПоставщика", Объект.РегистрироватьЦеныПоставщика);
	СтруктураПараметров.Вставить("ТекстПредупреждения",	  ТекстПредупреждения);
	//// ДисконтныеКарты
	//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя") Тогда
	//	СтруктураПараметров.Вставить("ДисконтнаяКарта",	  Объект.ДисконтнаяКарта);
	//КонецЕсли;
	//// Конец ДисконтныеКарты
	////+++ Lazare_13.04.2021
	//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя") Тогда
	//	СтруктураПараметров.Вставить("ВидЦен",	  Объект.ВидЦен);
	//	СтруктураПараметров.Удалить("ВидЦенКонтрагента")  ;
	//КонецЕсли;
	////--- Lazare_13.04.2021
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияПоКнопкеЦеныИВалютыЗавершение", ЭтотОбъект, Новый Структура("ВалютаРасчетовПередИзменением", ВалютаРасчетовПередИзменением));
	ОткрытьФорму("ОбщаяФорма.ФормаЦеныИВалюта", СтруктураПараметров, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 


&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалютыЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	// 3. Перезаполняем табличную часть "Запасы" если были внесены изменения в форме "Цены и Валюта".
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура")
		И РезультатЗакрытия.БылиВнесеныИзменения Тогда
		
		Объект.ВалютаДокумента = РезультатЗакрытия.ВалютаДокумента;
		Объект.Курс = РезультатЗакрытия.КурсРасчетов;
		Объект.Кратность = РезультатЗакрытия.КратностьРасчетов;
		Объект.НалогообложениеНДС = РезультатЗакрытия.НалогообложениеНДС;
		Объект.СуммаВключаетНДС = РезультатЗакрытия.СуммаВключаетНДС;
		Объект.НДСВключатьВСтоимость = РезультатЗакрытия.НДСВключатьВСтоимость;
		Объект.ВидЦенКонтрагента = РезультатЗакрытия.ВидЦенКонтрагента;
		Объект.РегистрироватьЦеныПоставщика = РезультатЗакрытия.РегистрироватьЦеныПоставщика;
		//// ДисконтныеКарты
		//Если ЗначениеЗаполнено(РезультатЗакрытия.ДисконтнаяКарта) И ЗначениеЗаполнено(РезультатЗакрытия.Контрагент) И Не Объект.Контрагент.Пустая() Тогда
		//	Если РезультатЗакрытия.Контрагент = Объект.Контрагент Тогда
		//		Объект.ДисконтнаяКарта = РезультатЗакрытия.ДисконтнаяКарта;
		//	Иначе // Выдадим сообщение и не будем менять данные о дисконтной карте.
		//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		//		НСтр("ka='დისკონტური ბარათი არ არის წაკითხული. დისკონტური ბარათის მფლობელი დოკუმენტში არსებულ კონტრაგენტს არ ემთხვევა.';ru='Дисконтная карта не считана. Владелец дисконтной карты не совпадает с контрагентом в документе.';en='The discount card is not read. The owner of a discount card does not coincide with the counterpart in the document.'"),
		//		,
		//		"Контрагент",
		//		"Объект");
		//	КонецЕсли;
		//Иначе
		//	Объект.ДисконтнаяКарта = РезультатЗакрытия.ДисконтнаяКарта;
		//КонецЕсли;
		// Конец ДисконтныеКарты
		
		// Пересчитываем цены по виду цен.
		Если РезультатЗакрытия.ПерезаполнитьЦены Тогда
			УправлениеНебольшойФирмойКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦенКонтрагента(ЭтотОбъект, "Запасы");
		КонецЕсли;

		// Пересчитываем цены по валюте.
		Если НЕ РезультатЗакрытия.ПерезаполнитьЦены
			И РезультатЗакрытия.ПересчитатьЦены Тогда
			УправлениеНебольшойФирмойКлиент.ПересчитатьЦеныТабличнойЧастиПоВалюте(ЭтотОбъект, ДополнительныеПараметры.ВалютаРасчетовПередИзменением, "Запасы");
		КонецЕсли;
		
		Если РезультатЗакрытия.ПересчитатьЦены Тогда
			УправлениеНебольшойФирмойКлиент.ПересчитатьЦеныТабличнойЧастиПоВалюте(ЭтотОбъект, ДополнительныеПараметры.ВалютаРасчетовПередИзменением, "Расходы");
		КонецЕсли;
		
		//Паганини_		
		//// Пересчитываем сумму если изменился признак Налогообложение НДС.
		//Если РезультатЗакрытия.НалогообложениеНДС <> РезультатЗакрытия.ПредНалогообложениеНДС Тогда
		//	ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
		//КонецЕсли;
		//
		//// Пересчитываем сумму если изменился признак "Сумма включает НДС".
		//Если НЕ РезультатЗакрытия.ПерезаполнитьЦены
		//	И РезультатЗакрытия.СуммаВключаетНДС <> РезультатЗакрытия.ПредСуммаВключаетНДС Тогда
		//	УправлениеНебольшойФирмойКлиент.ПересчитаемСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(ЭтотОбъект, "Запасы");
		//КонецЕсли;
		//
		//Если РезультатЗакрытия.СуммаВключаетНДС <> РезультатЗакрытия.ПредСуммаВключаетНДС Тогда
		//	УправлениеНебольшойФирмойКлиент.ПересчитаемСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(ЭтотОбъект, "Расходы");
		//КонецЕсли;
		Если РезультатЗакрытия.НалогообложениеНДС <> РезультатЗакрытия.ПредНалогообложениеНДС ИЛИ РезультатЗакрытия.СуммаВключаетНДС <> РезультатЗакрытия.ПредСуммаВключаетНДС Тогда 
			ЗаполнитьСтавкуНДСПоНалогообложениеНДС(РезультатЗакрытия.ПредНалогообложениеНДС, РезультатЗакрытия.ПредСуммаВключаетНДС);
		КонецЕсли;	
		//_Паганини
			
		Для каждого СтрокаТабличнойЧасти Из Объект.Предоплата Цикл
			СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
				СтрокаТабличнойЧасти.СуммаРасчетов,
				СтрокаТабличнойЧасти.Курс,
				?(Объект.ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Объект.Курс),
				СтрокаТабличнойЧасти.Кратность,
				?(Объект.ВалютаДокумента = НациональнаяВалюта, КратностьНациональнаяВалюта, Объект.Кратность));
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураНадписи = Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦенКонтрагента, НалогообложениеНДС,ВидЦен", Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, КурсНациональнаяВалюта, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.ВидЦенКонтрагента, Объект.НалогообложениеНДС,Объект.ВидЦен);
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры // ОбработатьИзмененияПоКнопкеЦеныИВалютыЗавершение()

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоНалогообложениеНДС(ПредНалогообложениеНДС, ПредСуммаВключаетНДС)//Паганини "Добавленны параметры"
	
	Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		
		Элементы.ЛицензииСтавкаНДС.Видимость = Истина;
		Элементы.ЛицензииСуммаНДС.Видимость = Истина;
		Элементы.ЛицензииВсего.Видимость = Истина;
					
		
		//Для каждого СтрокаТабличнойЧасти Из Объект.ТоварыПоДаннымПоставщика Цикл
		//	
		//	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС) Тогда
		//		СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
		//	Иначе
		//		СтрокаТабличнойЧасти.СтавкаНДС = Объект.Организация.СтавкаНДСПоУмолчанию;
		//	КонецЕсли;	
		//	
		//	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
		//	СтрокаТабличнойЧасти.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
		//							  		СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
		//							  		СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
		//	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
		//	
		//КонецЦикла;
		
		ПересчитатьСуммыТЧ(ПредНалогообложениеНДС, ПредСуммаВключаетНДС, Объект.Организация.СтавкаНДСПоУмолчанию);//_Паганини
		
	Иначе
		
		Элементы.ЛицензииСтавкаНДС.Видимость = Ложь;
		Элементы.ЛицензииСуммаНДС.Видимость = Ложь;
		Элементы.ЛицензииВсего.Видимость = Ложь;
			
		Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда	
		    СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
		Иначе
			СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
		КонецЕсли;	
		
		//Паганини_
		//Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		//
		//	СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
		//	СтрокаТабличнойЧасти.СуммаНДС = 0;
		//	
		//	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма;
		//	
		//КонецЦикла;
				
		//Паганини_
		//Для каждого СтрокаТабличнойЧасти Из Объект.Расходы Цикл
		//
		//	СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
		//	СтрокаТабличнойЧасти.СуммаНДС = 0;
		//	
		//	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма;
		//	
		//КонецЦикла;
		//_Паганини
		
		//Для каждого СтрокаТабличнойЧасти Из Объект.Лицензии Цикл
		//	
		//	СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
		//	СтрокаТабличнойЧасти.СуммаНДС = 0;
		//	
		//	//СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма;
		//	
		//КонецЦикла;
		
		ПересчитатьСуммыТЧ(ПредНалогообложениеНДС, ПредСуммаВключаетНДС, СтавкаНДСПоУмолчанию);//_Паганини
		
	КонецЕсли;	
	
	// Обновим подвал формы.
	ИтогВсего = Объект.Лицензии.Итог("Всего") ;
	ИтогСуммаНДС = Объект.Лицензии.Итог("СуммаНДС");
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоНалогообложениеНДС()	


&НаСервере
Процедура ПересчитатьСуммыТЧ(ПредНалогообложениеНДС, ПредСуммаВключаетНДС, пСтавкаНДСПоУмолчанию = Неопределено)
	
	ОблагаетсяНДС					= (Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
	ИзмениласьСуммаВключаетНДС		= НЕ ПредСуммаВключаетНДС = Объект.СуммаВключаетНДС;
	ИзмениласьНалогообложениеНДС	= (   ПредНалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС И НЕ ОблагаетсяНДС) ИЛИ 
									(НЕ ПредНалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС И    ОблагаетсяНДС);
		
	//Запасы
	Для Каждого СтрокаЗапасы  ИЗ Объект.Лицензии Цикл
		Если ИзмениласьНалогообложениеНДС Тогда
			Если ОблагаетсяНДС Тогда
				Номенклатура			= СтрокаЗапасы.Номенклатура;
				СтрокаЗапасы.СтавкаНДС	= ?(ЗначениеЗаполнено(Номенклатура.СтавкаНДС), Номенклатура.СтавкаНДС, пСтавкаНДСПоУмолчанию);
				ТекСтавка_НДС 			= СтрокаЗапасы.СтавкаНДС.Ставка;
			Иначе
				СтрокаЗапасы.СтавкаНДС	= Неопределено;
				ТекСтавка_НДС 			= 0;
			КонецЕсли;
		Иначе
			ТекСтавка_НДС 			= СтрокаЗапасы.СтавкаНДС.Ставка;
		КонецЕсли;
		Если ИзмениласьСуммаВключаетНДС Тогда
			Если Объект.СуммаВключаетНДС Тогда
				Если ОблагаетсяНДС Тогда
					СтрокаЗапасы.СуммаНДС	= Окр(СтрокаЗапасы.Цена * ТекСтавка_НДС/100, 2);
					СтрокаЗапасы.Цена		= СтрокаЗапасы.Цена + СтрокаЗапасы.СуммаНДС;
					СтрокаЗапасы.Всего		= СтрокаЗапасы.Цена;
				Иначе
					СтрокаЗапасы.СуммаНДС	= 0;
					СтрокаЗапасы.Цена		= СтрокаЗапасы.Цена;
					СтрокаЗапасы.Всего		= СтрокаЗапасы.Цена;
				КонецЕсли;
			Иначе
				Если ОблагаетсяНДС Тогда
					СтрокаЗапасы.Цена		= СтрокаЗапасы.Цена - СтрокаЗапасы.СуммаНДС;
					СтрокаЗапасы.СуммаНДС	= Окр(СтрокаЗапасы.Цена * ТекСтавка_НДС/100, 2);
					СтрокаЗапасы.Всего		= СтрокаЗапасы.Цена + СтрокаЗапасы.СуммаНДС;
				Иначе
					СтрокаЗапасы.Цена		= СтрокаЗапасы.Цена - СтрокаЗапасы.СуммаНДС;
					СтрокаЗапасы.СуммаНДС	= 0;
					СтрокаЗапасы.Всего		= СтрокаЗапасы.Цена;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если Объект.СуммаВключаетНДС Тогда
				СуммаБезНДС = (СтрокаЗапасы.Всего - СтрокаЗапасы.СуммаНДС);
				СтрокаЗапасы.СуммаНДС	= Окр(СуммаБезНДС * ТекСтавка_НДС/100, 2);
				СтрокаЗапасы.Цена 		= СуммаБезНДС + СтрокаЗапасы.СуммаНДС;
				СтрокаЗапасы.Всего		= СтрокаЗапасы.Цена;
			Иначе
				СуммаБезНДС = СтрокаЗапасы.Цена;
				СтрокаЗапасы.СуммаНДС	= Окр(СуммаБезНДС * ТекСтавка_НДС/100, 2);
				СтрокаЗапасы.Цена 		= СуммаБезНДС;
				СтрокаЗапасы.Всего		= СтрокаЗапасы.Цена + СтрокаЗапасы.СуммаНДС;
			КонецЕсли;
		КонецЕсли;
		//СтрокаЗапасы.Цена = ?(СтрокаЗапасы.Количество = 0, 0, СтрокаЗапасы.Сумма/СтрокаЗапасы.Количество);
	КонецЦикла;     
	
	//ИтогВсего    = ИтогВсего.Итог("Всего");
	//ИтогСуммаНДС = ИтогСуммаНДС.Итог("СуммаНДС");
	
 УстановитьВидимостьПоНДС();   
 

КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьПоНДС()
	
	Элементы.ВидНалогаНДС.Видимость		= Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзмененииФрагмент(ДоговорПередИзменением, СтруктураДанные)
	
	ВалютаРасчетовПередИзменением = ВалютаРасчетов;
	ВалютаРасчетов = СтруктураДанные.ВалютаРасчетов;
	
	Если НЕ СтруктураДанные.СуммаВключаетНДС = Неопределено Тогда
		Объект.СуммаВключаетНДС = СтруктураДанные.СуммаВключаетНДС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда 
		Объект.Курс      = ?(СтруктураДанные.ВалютаРасчетовКурсКратность.Курс = 0, 1, СтруктураДанные.ВалютаРасчетовКурсКратность.Курс);
		Объект.Кратность = ?(СтруктураДанные.ВалютаРасчетовКурсКратность.Кратность = 0, 1, СтруктураДанные.ВалютаРасчетовКурсКратность.Кратность);
	КонецЕсли;
	
	ИзменилсяВидЦен = Объект.ВидЦенКонтрагента <> СтруктураДанные.ВидЦенКонтрагента 
		И ЗначениеЗаполнено(СтруктураДанные.ВидЦенКонтрагента) И СтруктураДанные.УчетЦенКонтрагентов;
	НовыйДоговорИВалютаРасчетов = ЗначениеЗаполнено(Объект.Договор) И ЗначениеЗаполнено(ВалютаРасчетов) 
		И Объект.Договор <> ДоговорПередИзменением И ВалютаРасчетовПередИзменением <> СтруктураДанные.ВалютаРасчетов;
	ОткрытьФормуЦеныИВалюты = НовыйДоговорИВалютаРасчетов И Объект.ВалютаДокумента <> СтруктураДанные.ВалютаРасчетов
		;
	
	СтруктураДанные.Вставить("ИзменилсяВидЦен", ИзменилсяВидЦен);
	
	//Заказ = Объект.Заказ;
	
	Если ИзменилсяВидЦен Тогда
		
		Объект.ВидЦенКонтрагента = СтруктураДанные.ВидЦенКонтрагента;
		Если ЗначениеЗаполнено(Объект.ВидЦенКонтрагента) Тогда
			
			Объект.РегистрироватьЦеныПоставщика = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.ВалютаДокумента = СтруктураДанные.ВалютаРасчетов;
	
	Если ОткрытьФормуЦеныИВалюты Тогда
		
		ТекстПредупреждения = "";
		
		Если ИзменилсяВидЦен Тогда
			ТекстПредупреждения = НСтр("ka='კონტრაგენტთან ხელშეკრულება ითვალისწინებს ფასების და ფასდაკლებების პირობებს, რომლებიც დოკუმენტში დაყენებული პირობებისგან განსხვავდება! "
"შეიძლება, საჭიროა ფასების გადავსება.';ru='Договор с контрагентом предусматривает условия цен и скидок, "
"отличные от установленных в документе! "
"Возможно, необходимо перезаполнить цены.'") + Символы.ПС + Символы.ПС;
		КонецЕсли;
		
		ТекстПредупреждения = ТекстПредупреждения + НСтр("ka='შეიცვალა კონტრაგენტთან ხელშეკრულებით გათვალისწინებული ანგარიშსწორების ვალუტა! აუცილებელია დოკუმენტის ვალუტის შემოწმება!';ru='Изменилась валюта расчетов по договору с контрагентом!"
"Необходимо проверить валюту документа!'"
		);
		ОбработатьИзмененияПоКнопкеЦеныИВалюты(ВалютаРасчетовПередИзменением, Истина, ИзменилсяВидЦен, ТекстПредупреждения);
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Договор) 
		И ИзменилсяВидЦен Тогда
		
		//ПересчетНеобходим = (Объект.Запасы.Количество() > 0);
		
		Объект.ВидЦенКонтрагента	= СтруктураДанные.ВидЦенКонтрагента;
		СтруктураНадписи 			= 
			Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦенКонтрагента, НалогообложениеНДС,ВидЦен", 
							Объект.ВалютаДокумента, 
							ВалютаРасчетов, 
							Объект.Курс, 
							КурсНациональнаяВалюта, 
							Объект.СуммаВключаетНДС, 
							УчетВалютныхОпераций, 
							Объект.ВидЦенКонтрагента, 
							Объект.НалогообложениеНДС,
							Объект.ВидЦен);
							
		ЦеныИВалюта 				= СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
		
//		Если ПересчетНеобходим Тогда
//			
//			Сообщение = НСтр("ka='კონტრაგენტთან ხელშეკრულება ითვალისწინებს დოკუმენტში დადგენილისგან განსხვავებულ ფასების ტიპს! გადავთვალოთ დოკუმენტი ხელშეკრულების შესაბამისად?';ru='Договор с контрагентом предусматривает вид цен, отличный от установленного в документе! "
//"Пересчитать документ в соответствии с договором?'");
//			ПоказатьВопрос(Новый ОписаниеОповещения("КонтрагентПриИзмененииФрагментЗавершение", ЭтотОбъект, Новый Структура("ДоговорПередИзменением, ВалютаРасчетовПередИзменением, СтруктураДанные", ДоговорПередИзменением, ВалютаРасчетовПередИзменением, СтруктураДанные)), 
//				Сообщение,
//				РежимДиалогаВопрос.ДаНет
//			);
//			Возврат;
//			
//		КонецЕсли;
		
	Иначе
		
		СтруктураНадписи 			= 
			Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦенКонтрагента, НалогообложениеНДС,ВидЦен", 
							Объект.ВалютаДокумента, 
							ВалютаРасчетов, 
							Объект.Курс, 
							КурсНациональнаяВалюта, 
							Объект.СуммаВключаетНДС, 
							УчетВалютныхОпераций, 
							Объект.ВидЦенКонтрагента, 
							Объект.НалогообложениеНДС,
							Объект.ВидЦен);
							
		ЦеныИВалюта 				= СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
		
	КонецЕсли;
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС(ЭтоОткрытие = Ложь)
	
	НалогообложениеПередИзменением = Объект.НалогообложениеНДС;
	
	//Если Объект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя
	//	ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера
	//	ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика
	//	ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратСОтветхранения Тогда
	//	
	//	Объект.НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Объект.Организация,, Объект.Дата);
	//	
	//ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика 
	//	ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемВПереработку
	//	ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию
	//	ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаОтветхранение 
	//	ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ЗакупкаКапитальныхЗатрат Тогда

	
	Объект.НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Объект.Организация,, Объект.Дата, Объект.Контрагент, Объект.Договор);
		
	Если НЕ ЗначениеЗаполнено(Объект.НалогообложениеНДС) Тогда
		
		Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		
	КонецЕсли;
	
	Если НЕ НалогообложениеПередИзменением = Объект.НалогообложениеНДС ИЛИ ЭтоОткрытие Тогда
		ЗаполнитьСтавкуНДСПоНалогообложениеНДС(НалогообложениеПередИзменением, Объект.СуммаВключаетНДС);//Паганини "Добавленны параметры"
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоНалогообложениеНДС()

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	
	
КонецПроцедуры


