
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	Для Каждого Док Из ПараметрКоманды Цикл
		ЗначенияРеквизитов = РС_ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Док, "Статус,Аванс");
		ТекСтатус 	= ЗначенияРеквизитов.Статус;
		Аванс 		= ЗначенияРеквизитов.Аванс;
		Если ТекСтатус = ПредопределенноеЗначение("Перечисление.СтатусыСФ.Отправленная") Тогда
			Сообщить("შეუძლებელია შენახვა. "+Док+" უკვე გადაგზავნილია!");
			Продолжить;
		КонецЕсли;
		ИдентификаторСФ = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтправитьШапкуДокументаНаПортале(Док);
		Если ИдентификаторСФ = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		Если Аванс Тогда
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтправитьСписокДокументовАвансаНаПортале(Док, ИдентификаторСФ);
		Иначе
			Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтправитьСписокНакладныхНаПортале(Док, ИдентификаторСФ) = Неопределено Тогда
				ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтправитьСписокНоменклатуриНаПортале(Док, ИдентификаторСФ);	
			КонецЕсли;
		КонецЕсли;
		
	    ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбновитьИдентификаторИСтатусДокументаСФ(Док, ИдентификаторСФ, 0);
		ОповеститьОбИзменении(Док);
	КонецЦикла;
	
	Оповестить("ПерепрочитатьФорму");
	Состояние(НСтр("ka='RS.GE-ს სერვერთან მუშაობა დასრულებულია';ru='Работа с сервером RS.GE завершена'"));	
	
КонецПроцедуры

