Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбновитьОтчет(ДокументРезультат, ДанныеРасшифровки);
	
КонецПроцедуры

Процедура ОбновитьОтчет(ДокументРезультат, ДанныеРасшифровкиКомпоновки) 
	
	ДокументРезультат.Очистить();
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	ДанныеРасшифровкиКомпоновки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, НастройкиКомпоновкиДанных, ДанныеРасшифровкиКомпоновки);
	//МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос,"Проект = &П","ВЫБОР КОГДА Проект.ТипПроекта = ЗНАЧЕНИЕ(Перечисление.ТипПроекта.Проект) ТОГДА Проект ИНАЧЕ Проект.Проект КОНЕЦ = &П");

	
	НачалоПериода	= МакетКомпоновки.ЗначенияПараметров.Найти("НачалоПериода").Значение;
	КонецПериода	= МакетКомпоновки.ЗначенияПараметров.Найти("КонецПериода").Значение;
	Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		Сообщение 			= Новый СообщениеПользователю;
		Если НЕ ЗначениеЗаполнено(НачалоПериода) И НЕ ЗначениеЗаполнено(КонецПериода) Тогда
			Сообщение.Текст	 	= НСтр("ka='პერიოდის დაწყების და დასრული არ არის შევსებული!';ru='Дата начала и дату окончания не заполнена!';en='Start date and the end date is not filled!'");
		ИначеЕсли НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
			Сообщение.Текст	 	= НСтр("ka='პერიოდის დასაწყისი არ არის შევსებული!';ru='Дата начала не заполнена!';en='Start date is not filled!'");
		Иначе
			Сообщение.Текст	 	= НСтр("ka='პერიოდის დასასრული არ არის შევსებული!';ru='Начало периода не заполнена!';en='Beginning of the period is not full!'");
		КонецЕсли;
		Сообщение.Сообщить();
		Возврат;
	ИначеЕсли НачалоПериода > КонецПериода Тогда
		Сообщение 			= Новый СообщениеПользователю;
		Сообщение.Текст	 	= НСтр("ka='პერიოდის დაწყების თარიღი არ უნდა აღემატებოდეს დასრულების თარიღს!';ru='Дата начала периода не должна превышать дату окончания!';en='Date of commencement of the period must not exceed the expiry date!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Период.ДатаНачала		= НачалоПериода;
	Период.ДатаОкончания	= КонецПериода;
		
	//ცხრილის გენერაცია_
	СписокНоменклатур.Очистить();
	Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьНесколькоОрганизаций") Тогда
		Организация = МакетКомпоновки.ЗначенияПараметров.Найти("Организация").Значение;
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			Сообщение 			= Новый СообщениеПользователю;
			Сообщение.Текст	 	= НСтр("ru = 'Не указана организация!'; ka = 'არ არის მითითებული ორგანიზაცია!'; en = 'Не указана организация!'");
			Сообщение.Сообщить();
			Сообщить(НСтр("ru = 'Не указана организация!'; ka = 'არ არის მითითებული ორგანიზაცია!'; en = 'Не указана организация!'"));
			Возврат;
		КонецЕсли;
	Иначе
		Организация = Справочники.Организации.ОсновнаяОрганизация;
	КонецЕсли;
	ТоварыRS	= СписокНоменклатур.Выгрузить();
	ВсеОК		= ПолучитьВыданныеНакладные(ТоварыRS, "get_waybill_goods_list", Организация, Период);
	Если Не ВсеОК Тогда
		Возврат;
	КонецЕсли;
	ТоварыRS.Сортировать("WAYBILL_NUMBER, W_NAME");
	
	КлючВыгрузкиНоменклатурыВНалоговую = Организация.СоответствиеНоменклатур;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Если КлючВыгрузкиНоменклатурыВНалоговую = Перечисления.СоответствияНоменклатуры.ПоШтрихкоду Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасходнаяНакладнаяЗапасы.Ссылка КАК Документ,
			|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
			|	РасходнаяНакладнаяЗапасы.Номенклатура.Наименование КАК Наименование,
			//--------------------------------------------------------------------------
			// © Шишка В.В. [30 сентября 2022 г.]  НАЧАЛО
			|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
			// © Шишка В.В. [30 сентября 2022 г.]  КОНЕЦ
			//--------------------------------------------------------------------------
			|	СУММА(РасходнаяНакладнаяЗапасы.Количество) КАК Количество,
			|	СУММА(РасходнаяНакладнаяЗапасы.Всего) КАК Сумма,
			|	СУММА(РасходнаяНакладнаяЗапасы.СуммаНДС) КАК СуммаНДС,
			|	РасходнаяНакладнаяЗапасы.Ссылка.НомерТТН КАК НомерТТН
			|ПОМЕСТИТЬ Запасы
			|ИЗ
			|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
			|ГДЕ
			|	РасходнаяНакладнаяЗапасы.Ссылка.Проведен
			|	И РасходнаяНакладнаяЗапасы.Ссылка.Организация = &Организация
			|	И РасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
			|	И РасходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И РасходнаяНакладнаяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(перечисление.ТипыНоменклатуры.Запас)
			|
			|СГРУППИРОВАТЬ ПО
			|	РасходнаяНакладнаяЗапасы.Номенклатура,
			//--------------------------------------------------------------------------
			// © Шишка В.В. [30 сентября 2022 г.]  НАЧАЛО
			|	РасходнаяНакладнаяЗапасы.Характеристика,	
			// © Шишка В.В. [30 сентября 2022 г.]  КОНЕЦ
			//--------------------------------------------------------------------------
			|	РасходнаяНакладнаяЗапасы.Ссылка,
			|	РасходнаяНакладнаяЗапасы.Ссылка.НомерТТН,
			|	РасходнаяНакладнаяЗапасы.Номенклатура.Наименование
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПриходнаяНакладнаяЗапасы.Ссылка,
			|	ПриходнаяНакладнаяЗапасы.Номенклатура,
			//--------------------------------------------------------------------------
			// © Шишка В.В. [30 сентября 2022 г.]  НАЧАЛО
			|	ПриходнаяНакладнаяЗапасы.Характеристика,
			// © Шишка В.В. [30 сентября 2022 г.]  КОНЕЦ
			//--------------------------------------------------------------------------
			|	ПриходнаяНакладнаяЗапасы.Номенклатура.Наименование,
			|	СУММА(ПриходнаяНакладнаяЗапасы.Количество),
			|	СУММА(ПриходнаяНакладнаяЗапасы.Всего),
			|	СУММА(ПриходнаяНакладнаяЗапасы.СуммаНДС),
			|	ПриходнаяНакладнаяЗапасы.Ссылка.НомерТТН
			|ИЗ
			|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
			|ГДЕ
			|	ПриходнаяНакладнаяЗапасы.Ссылка.Проведен
			|	И ПриходнаяНакладнаяЗапасы.Ссылка.Организация = &Организация
			|	И ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
			|	И ПриходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|
			|СГРУППИРОВАТЬ ПО
			|	ПриходнаяНакладнаяЗапасы.Номенклатура,
			//--------------------------------------------------------------------------
			// © Шишка В.В. [30 сентября 2022 г.]  НАЧАЛО
			|	ПриходнаяНакладнаяЗапасы.Характеристика,
			// © Шишка В.В. [30 сентября 2022 г.]  КОНЕЦ
			//--------------------------------------------------------------------------
			|	ПриходнаяНакладнаяЗапасы.Ссылка,
			|	ПриходнаяНакладнаяЗапасы.Ссылка.НомерТТН,
			|	ПриходнаяНакладнаяЗапасы.Номенклатура.Наименование
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
			|	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод
			|ПОМЕСТИТЬ Штрихкоды
			|ИЗ
			|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			|ГДЕ
			|	ШтрихкодыНоменклатуры.Номенклатура В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				Запасы.Номенклатура
			|			ИЗ
			|				Запасы КАК Запасы)
			|
			|СГРУППИРОВАТЬ ПО
			|	ШтрихкодыНоменклатуры.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Запасы.Документ КАК Документ,
			|	Запасы.НомерТТН КАК WAYBILL_NUMBER,
			|	Запасы.Номенклатура КАК Номенклатура_1С,
			//--------------------------------------------------------------------------
			// © Шишка В.В. [30 сентября 2022 г.]  НАЧАЛО
			|Запасы.Номенклатура.Наименование КАК НоменклатураНаименование,
			|Запасы.Характеристика КАК Характеристика,
			|ЕСТЬNULL(Запасы.Характеристика.Наименование, """") КАК ХарактеристикаНаименование,
			// © Шишка В.В. [30 сентября 2022 г.]  КОНЕЦ
			//--------------------------------------------------------------------------
			|	Запасы.Количество КАК Количество_1С,
			|	Запасы.Сумма КАК Сумма_1С,
			|	Запасы.СуммаНДС КАК СуммаНДС_1С,
			|	ЕСТЬNULL(Штрихкоды.Штрихкод, """") КАК Код_1С
			|ИЗ
			|	Запасы КАК Запасы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Штрихкоды КАК Штрихкоды
			|		ПО Запасы.Номенклатура = Штрихкоды.Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	Запасы.Номенклатура.Наименование
			|ИТОГИ ПО
			|	WAYBILL_NUMBER";
	Иначе
		Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	РасходнаяНакладнаяЗапасы.Ссылка КАК Документ,
			//|	РасходнаяНакладнаяЗапасы.Ссылка.НомерТТН КАК WAYBILL_NUMBER,
			//|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура_1С,
			//|	РасходнаяНакладнаяЗапасы.Номенклатура.Код КАК Код_1С,
			//|	СУММА(РасходнаяНакладнаяЗапасы.Количество) КАК Количество_1С,
			//|	СУММА(РасходнаяНакладнаяЗапасы.Всего) КАК Сумма_1С,
			//|	СУММА(РасходнаяНакладнаяЗапасы.СуммаНДС) КАК СуммаНДС_1С
			//|ИЗ
			//|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
			//|ГДЕ
			//|	РасходнаяНакладнаяЗапасы.Ссылка.Проведен
			//|	И РасходнаяНакладнаяЗапасы.Ссылка.Организация = &Организация
			//|	И РасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
			//|	И РасходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			//|	И РасходнаяНакладнаяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(перечисление.ТипыНоменклатуры.Запас)
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	РасходнаяНакладнаяЗапасы.Номенклатура,
			//|	РасходнаяНакладнаяЗапасы.Ссылка,
			//|	РасходнаяНакладнаяЗапасы.Ссылка.НомерТТН,
			//|	РасходнаяНакладнаяЗапасы.Номенклатура.Код
			//|
			//|ОБЪЕДИНИТЬ ВСЕ
			//|
			//|ВЫБРАТЬ
			//|	ПриходнаяНакладнаяЗапасы.Ссылка,
			//|	ПриходнаяНакладнаяЗапасы.Ссылка.НомерТТН,
			//|	ПриходнаяНакладнаяЗапасы.Номенклатура,
			//|	ПриходнаяНакладнаяЗапасы.Номенклатура.Код,
			//|	СУММА(ПриходнаяНакладнаяЗапасы.Количество),
			//|	СУММА(ПриходнаяНакладнаяЗапасы.Всего),
			//|	СУММА(ПриходнаяНакладнаяЗапасы.СуммаНДС)
			//|ИЗ
			//|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
			//|ГДЕ
			//|	ПриходнаяНакладнаяЗапасы.Ссылка.Проведен
			//|	И ПриходнаяНакладнаяЗапасы.Ссылка.Организация = &Организация
			//|	И ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
			//|	И ПриходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	ПриходнаяНакладнаяЗапасы.Номенклатура,
			//|	ПриходнаяНакладнаяЗапасы.Ссылка,
			//|	ПриходнаяНакладнаяЗапасы.Ссылка.НомерТТН,
			//|	ПриходнаяНакладнаяЗапасы.Номенклатура.Код
			//|ИТОГИ ПО
			//|	WAYBILL_NUMBER";
			"ВЫБРАТЬ
			|	РасходнаяНакладнаяЗапасы.Ссылка КАК Документ,
			|	РасходнаяНакладнаяЗапасы.Ссылка.НомерТТН КАК WAYBILL_NUMBER,
			|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура_1С,
			|	РасходнаяНакладнаяЗапасы.Номенклатура.Код КАК Код_1С,
			|	СУММА(РасходнаяНакладнаяЗапасы.Количество) КАК Количество_1С,
			|	СУММА(РасходнаяНакладнаяЗапасы.Всего) КАК Сумма_1С,
			|	СУММА(РасходнаяНакладнаяЗапасы.СуммаНДС) КАК СуммаНДС_1С,
			|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
			|	РасходнаяНакладнаяЗапасы.Характеристика.Наименование КАК ХарактеристикаНаименование,
			|	РасходнаяНакладнаяЗапасы.Номенклатура.Наименование КАК НоменклатураНаименование
			|ИЗ
			|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
			|ГДЕ
			|	РасходнаяНакладнаяЗапасы.Ссылка.Проведен
			|	И РасходнаяНакладнаяЗапасы.Ссылка.Организация = &Организация
			|	И РасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
			|	И РасходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И РасходнаяНакладнаяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(перечисление.ТипыНоменклатуры.Запас)
			|
			|СГРУППИРОВАТЬ ПО
			|	РасходнаяНакладнаяЗапасы.Номенклатура,
			|	РасходнаяНакладнаяЗапасы.Ссылка,
			|	РасходнаяНакладнаяЗапасы.Ссылка.НомерТТН,
			|	РасходнаяНакладнаяЗапасы.Номенклатура.Код,
			|	РасходнаяНакладнаяЗапасы.Характеристика,
			|	РасходнаяНакладнаяЗапасы.Характеристика.Наименование
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПриходнаяНакладнаяЗапасы.Ссылка,
			|	ПриходнаяНакладнаяЗапасы.Ссылка.НомерТТН,
			|	ПриходнаяНакладнаяЗапасы.Номенклатура,
			|	ПриходнаяНакладнаяЗапасы.Номенклатура.Код,
			|	СУММА(ПриходнаяНакладнаяЗапасы.Количество),
			|	СУММА(ПриходнаяНакладнаяЗапасы.Всего),
			|	СУММА(ПриходнаяНакладнаяЗапасы.СуммаНДС),
			|	ПриходнаяНакладнаяЗапасы.Характеристика,
			|	ПриходнаяНакладнаяЗапасы.Характеристика.Наименование,
			|	ПриходнаяНакладнаяЗапасы.Номенклатура.Наименование
			|ИЗ
			|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
			|ГДЕ
			|	ПриходнаяНакладнаяЗапасы.Ссылка.Проведен
			|	И ПриходнаяНакладнаяЗапасы.Ссылка.Организация = &Организация
			|	И ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
			|	И ПриходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|
			|СГРУППИРОВАТЬ ПО
			|	ПриходнаяНакладнаяЗапасы.Номенклатура,
			|	ПриходнаяНакладнаяЗапасы.Ссылка,
			|	ПриходнаяНакладнаяЗапасы.Ссылка.НомерТТН,
			|	ПриходнаяНакладнаяЗапасы.Номенклатура.Код,
			|	ПриходнаяНакладнаяЗапасы.Характеристика,
			|	ПриходнаяНакладнаяЗапасы.Характеристика.Наименование
			|ИТОГИ ПО
			|	WAYBILL_NUMBER";
		Если КлючВыгрузкиНоменклатурыВНалоговую = Перечисления.СоответствияНоменклатуры.ПоАртикулу Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РасходнаяНакладнаяЗапасы.Номенклатура.Код", "РасходнаяНакладнаяЗапасы.Номенклатура.Артикул");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПриходнаяНакладнаяЗапасы.Номенклатура.Код", "ПриходнаяНакладнаяЗапасы.Номенклатура.Артикул");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаНачала", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(Период.ДатаОкончания));
	
	РезультатЗапасов = Запрос.Выполнить();
	ВыборкаНомерТТН = РезультатЗапасов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНомерТТН.Следующий() Цикл
		НС_RS = ТоварыRS.НайтиСтроки(Новый Структура("WAYBILL_NUMBER", ВыборкаНомерТТН.WAYBILL_NUMBER));	
		//+++Дмгг
		//Доп поиск на наименование номенклатуры и наименование характеристики
		//НС_RS = ВыполнитьПроверекуНаНаименованиеНоменклатурыХарактеристики(НС_RS, ВыборкаНомерТТН);
		//--- Дмгг
		Выборка = ВыборкаНомерТТН.Выбрать();
		ПревязанноеКоличество	= 0;
		КоличествоНаиденныхСтрок_RS 		= НС_RS.Количество();		
		Пока Выборка.Следующий() Цикл
			Если КоличествоНаиденныхСтрок_RS = 0 ИЛИ ПревязанноеКоличество = КоличествоНаиденныхСтрок_RS Тогда
				НоваяСтрокаНС_RS = ТоварыRS.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаНС_RS, Выборка);
				//--------------------------------------------------------------------------
				// © Шишка В.В. [2 октября 2023 г.]  НАЧАЛО
			ИначеЕсли КлючВыгрузкиНоменклатурыВНалоговую = Перечисления.СоответствияНоменклатуры.ПоАртикулу Тогда
				НС_RS_Доп = ВыполнитьПроверекуАртикулу(НС_RS, Выборка);
				Для Каждого СтрокаНС_RS ИЗ НС_RS_Доп Цикл
					Если СтрокаНС_RS.Превязан Тогда
						Продолжить;
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(СтрокаНС_RS, Выборка);
					СтрокаНС_RS.Превязан = Истина;
					ПревязанноеКоличество = ПревязанноеКоличество + 1;
					Прервать;
				КонецЦикла;
				// © Шишка В.В. [2 октября 2023 г.]  КОНЕЦ
				//--------------------------------------------------------------------------
			Иначе
				
				//+++Дмгг
				//Доп поиск на наименование номенклатуры и наименование характеристики
				НС_RS_Доп = ВыполнитьПроверекуНаНаименованиеНоменклатурыХарактеристики(НС_RS, Выборка);
				//--- Дмгг
				Для Каждого СтрокаНС_RS ИЗ НС_RS_Доп Цикл
					Если СтрокаНС_RS.Превязан Тогда
						Продолжить;
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(СтрокаНС_RS, Выборка);
					СтрокаНС_RS.Превязан = Истина;
					ПревязанноеКоличество = ПревязанноеКоличество + 1;
					Прервать;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Если ПревязанноеКоличество < КоличествоНаиденныхСтрок_RS Тогда
			Для Инд = ПревязанноеКоличество По КоличествоНаиденныхСтрок_RS-1 Цикл
				НС_RS[Инд].Документ = НС_RS[0].Документ;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	КонечнаяТаблица = ТоварыRS.Скопировать();
	КонечнаяТаблица.Колонки.WAYBILL_NUMBER.Имя	= "НомерТТН";
	КонечнаяТаблица.Колонки.W_NAME.Имя			= "Номенклатура_RS";
	КонечнаяТаблица.Колонки.BAR_CODE.Имя		= "Код_RS";
	КонечнаяТаблица.Колонки.QUANTITY.Имя		= "Количество_RS";
	КонечнаяТаблица.Колонки.AMOUNT.Имя			= "Сумма_RS";
	КонечнаяТаблица.Колонки.AMOUNTVat.Имя		= "СуммаНДС_RS";
	КонечнаяТаблица.Колонки.NAME.Имя		    = "Контрагент_RS";
	//_ცხრილის გენერაცია
	
	
	//Создадим и инициализируем процессор компоновки
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, Новый Структура("КонечнаяТаблица", КонечнаяТаблица), ДанныеРасшифровкиКомпоновки, Истина);//პარამეტრი 2 
	
	//Создадим и инициализируем процессор вывода результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	
	//Обозначим начало вывода
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
КонецПроцедуры

&НаСервере
Функция ВыполнитьПроверекуНаНаименованиеНоменклатурыХарактеристики(НС_RS, Выборка)

	МассивСтрокВозврата = Новый Массив;
	
	Для Каждого Строк Из НС_RS Цикл  
		
		ПоискНаименованианияНоменклатуры = СтрНайти(СокрЛП(Строк.W_NAME),СокрЛП(Выборка.НоменклатураНаименование));
		
		Если ПоискНаименованианияНоменклатуры = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		ПоискНаименованияХарактеристики = СтрНайти(СокрЛП(Строк.W_NAME), СокрЛП(Выборка.ХарактеристикаНаименование));
			
		Если ПоискНаименованияХарактеристики = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		МассивСтрокВозврата.Добавить(Строк);
		
	КонецЦикла;
	
	Возврат МассивСтрокВозврата;

КонецФункции // ВыполнитьПроверекуНаНаименованиеНоменклатурыХарактеристики(НС_RS)()

//--------------------------------------------------------------------------
// © Шишка В.В. [2 октября 2023 г.]  НАЧАЛО
&НаСервере
Функция ВыполнитьПроверекуАртикулу(НС_RS, Выборка)

	МассивСтрокВозврата = Новый Массив;
	
	Для Каждого Строк Из НС_RS Цикл  
		
		ПоискНаименованианияНоменклатуры = СтрНайти(СокрЛП(Строк.BAR_CODE),СокрЛП(Выборка.Код_1С));
		
		Если ПоискНаименованианияНоменклатуры = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		МассивСтрокВозврата.Добавить(Строк);
		
	КонецЦикла;
	
	Возврат МассивСтрокВозврата;

КонецФункции // ВыполнитьПроверекуНаНаименованиеНоменклатурыХарактеристики(НС_RS)()
// © Шишка В.В. [2 октября 2023 г.]  КОНЕЦ
//--------------------------------------------------------------------------


&НаСервере
Функция ПолучитьВыданныеНакладные(ТабЗагрузки, SoapAction, Организация, Период) 
		
	ПараметрыРС = РС_ИнтеграцияСНалоговойСлужбойГрузииПовтИсп.ПолучитьСтруктуруПараметровWS(Организация);
	su 							= ПараметрыРС.ПользовательПодключения;
	sp 							= ПараметрыРС.ПарольПодключения;
	РежимовПротоколаДляОбменаRS = ПараметрыРС.РежимовПротоколаДляОбменаRS;
	
	SLLСоединение = РС_ИнтеграцияСНалоговойСлужбойГрузииПовтИсп.ПолучитьSLLСоединение();
	WSСоеденение  = Новый WSПрокси(РС_ИнтеграцияСНалоговойСлужбойГрузииПовтИсп.ПолучитьWSОпределение(РежимовПротоколаДляОбменаRS), "http://tempuri.org/", "WayBills", "WayBillsSoap", , , SLLСоединение);
	ТипXDTO		  = WSСоеденение.ФабрикаXDTO.Тип("http://tempuri.org/", SoapAction);
	
	парамXDTO	  = WSСоеденение.ФабрикаXDTO.Создать(ТипXDTO);
	парамXDTO.su 			= su;
	парамXDTO.sp 			= sp;
	парамXDTO.statuses		= ",1,2,";
	парамXDTO.itypes		= "2,3,5,6"; //1-გადაადგილება,4-დისტრიბუცია
	парамXDTO.begin_date_s	= Период.ДатаНачала;
	парамXDTO.begin_date_e	= Период.ДатаОкончания;
	
	Попытка 
		ДанныеРасходныхНакладных = WSСоеденение.get_waybill_goods_list(парамXDTO);
		WAYBILL_LIST = Новый ТаблицаЗначений;
		Если ТипЗнч(ДанныеРасходныхНакладных) = Тип("ОбъектXDTO") Тогда 
			WAYBILL_LIST = ДанныеРасходныхНакладных.get_waybill_goods_listResult.WAYBILL_LIST.WAYBILL;
			
			Если ТипЗнч(WAYBILL_LIST) = Тип("ОбъектXDTO") Тогда
				Колво = 1;
			ИначеЕсли ТипЗнч(WAYBILL_LIST) = Тип("СписокXDTO") Тогда
				Колво = WAYBILL_LIST.Количество();
			КонецЕсли;
		КонецЕсли;
		
		ТабЗагрузки.Очистить();
		Для инд = 0 По Колво - 1 Цикл
			нСтрока = ТабЗагрузки.Добавить();
			СТР_RS = WAYBILL_LIST[инд];
			ЗаполнитьЗначенияСвойств(нСтрока, СТР_RS);
			Если СТР_RS.VAT_TYPE = "0" Тогда
				нСтрока.AMOUNTVat = СТР_RS.AMOUNT * 18/118;
			КонецЕсли;
		КонецЦикла;
	Исключение
		Сообщить(НСтр("ka='საგადასახადო სამსახურის სერვერთან წვდომის შეცდომა';ru='Ошибка доступа к серверу налоговой службы';en='Error accessing the server Tax Service'"));
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьSLLСоединение() Экспорт 
	
	SLL = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(),Новый СертификатыУдостоверяющихЦентровWindows());
	Возврат SLL;
	
КонецФункции
&НаСервере
Функция ПолучитьWSОпределение(РежимПротокола = Неопределено) Экспорт 
	
	#Если Сервер Тогда
		Возврат Новый WSОпределения("http://services.rs.ge/WayBillService/WayBillService.asmx?wsdl", "");
	#Иначе
		Если глОпределение = Неопределено Тогда
			глОпределение = Новый WSОпределения("http://services.rs.ge/WayBillService/WayBillService.asmx?wsdl", "");
		КонецЕсли;
		Возврат	глОпределение;
	#КонецЕсли
	
КонецФункции


