
#Область ПрограммныйИнтерфейс

Функция ОписанияВсехСекций() Экспорт
	
	Результат = Новый Структура;
	ДобавитьОписаниеСекции(Результат, "ЧистыеАктивы", НСтр("ka='სუფთა აქტივები';ru='Чистые активы';en='net assets'"), ПоляФильтровЧистыеАктивы());
	ДобавитьОписаниеСекции(Результат, "Деньги", НСтр("ka='ფული';ru='Деньги';en='Money'"), ПоляФильтровДеньги());
	ДобавитьОписаниеСекции(Результат, "Товары", НСтр("ka='საქონელი';ru='Товары';en='Products'"), ПоляФильтровТовары());
	ДобавитьОписаниеСекции(Результат, "ТоварыНаСобственныхСкладах", НСтр("ka='მარაგები საკუთარ საწყობებზე';ru='Товары на собственных складах';en='Goods at their own warehouses'"), ПоляФильтровТоварыНаСобственныхСкладах());
	ДобавитьОписаниеСекции(Результат, "ТоварыУРеализаторов", НСтр("ka='მარაგები რეალიზატორებთან';ru='Товары у реализаторов';en='Goods from distributors'"), ПоляФильтровТоварыУРеализаторов());
	ДобавитьОписаниеСекции(Результат, "ДебиторкаДолгиПокупателей", НСтр("ka='მყიდველების დავალიანებები';ru='Долги покупателей';en='customer debts'"), ПоляФильтровДебиторкаДолгиПокупателей());
	ДобавитьОписаниеСекции(Результат, "ДебиторкаАвансыПоставщикам", НСтр("ka='ავანსები მომწოდებლებისთვის';ru='Авансы поставщикам';en='advances to suppliers'"), ПоляФильтровДебиторкаАвансыПоставщикам());
	ДобавитьОписаниеСекции(Результат, "КредиторкаДолгиПоставщикам", НСтр("ka='დავალიანებები მომწოდებლწბისთვის';ru='Долги поставщикам';en='debts to suppliers'"), ПоляФильтровКредиторкаДолгиПоставщикам());
	ДобавитьОписаниеСекции(Результат, "КредиторкаАвансыОтПокупателей", НСтр("ka='ავანსები მყიდველებისგან';ru='Авансы от покупателей';en='Advances from customers'"), ПоляФильтровКредиторкаАвансыОтПокупателей());
	ДобавитьОписаниеСекции(Результат, "ПродажиВыручка", НСтр("ka='გაყიდვები (ამონაგები)';ru='Продажи (выручка)';en='Sales (Revenue)'"), ПоляФильтровПродажиВыручка());
	ДобавитьОписаниеСекции(Результат, "ПродажиКоличество", НСтр("ka='გაყიდვები (რაოდენოაბა)';ru='Продажи (количество)';en='Sales (quantity)'"), ПоляФильтровПродажиКоличество());
	ДобавитьОписаниеСекции(Результат, "ПродажиДинамика", НСтр("ka='გაყიდვები (დინამიკა)';ru='Продажи (динамика)';en='Sales (dynamics)'"), ПоляФильтровПродажиДинамика());
	ДобавитьОписаниеСекции(Результат, "ПродажиПокупатели", НСтр("ka='მყიდველები,რომლებმაც გასული 365 დღის განმავლობაში დააგენერირებს ამონაგების 80%';ru='Покупатели, давшие 80% выручки за последние 365 дней';en='Buyers who gave 80% of its revenue in the last 365 days'"), ПоляФильтровПродажиПокупатели());
	ДобавитьОписаниеСекции(Результат, "ПродажиСамыеПродаваемыеТовары", НСтр("ka='ტოპ-10 ყველაზე გაყიდვადი პროდუქცია გასული 365 დღის განმავლობაში';ru='ТОП-10 самых продаваемых товаров за последние 365 дней';en='Top 10 best-selling products over the last 365 days'"), ПоляФильтровПродажиСамыеПродаваемыеТовары());
	
	Возврат Результат;
	
КонецФункции

Функция ВариантыПредварительногоПросмотра() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НаЭкране", "СостояниеКомпании.ИнтерактивноПодготовитьОтчетДляПросмотраНаЭкране");
	Результат.Вставить("ПоЭлектроннойПочте", "СостояниеКомпании.ИнтерактивноОтправитьОтчетПоЭлектроннойПочте");
	
	Возврат Результат;
	
КонецФункции

Функция ВидСравненияСтрока(ВидСравненияКД) Экспорт
	
	ВариантыВидовСравнения = Новый Соответствие;
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.Больше] = "Больше";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.БольшеИлиРавно] = "БольшеИлиРавно";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.ВИерархии] = "ВИерархии";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.ВСписке] = "ВСписке";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии] = "ВСпискеПоИерархии";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.Заполнено] = "Заполнено";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.Меньше] = "Меньше";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.МеньшеИлиРавно] = "МеньшеИлиРавно";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.НачинаетсяС] = "НачинаетсяС";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.НеВИерархии] = "НеВИерархии";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.НеВСписке] = "НеВСписке";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.НеЗаполнено] = "НеЗаполнено";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.НеНачинаетсяС] = "НеНачинаетсяС";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.НеПодобно] = "НеПодобно";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.НеРавно] = "НеРавно";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.НеСодержит] = "НеСодержит";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.Подобно] = "Подобно";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.Равно] = "Равно";
	ВариантыВидовСравнения[ВидСравненияКомпоновкиДанных.Содержит] = "Содержит";
	
	Возврат ВариантыВидовСравнения[ВидСравненияКД];
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьОписаниеСекции(Знач ОписанияВсехСекций, Знач ТипСекции, Знач ЗаголовокСекции, Знач ПоляФильтров)
	
	ОписаниеСекции = Новый Структура;
	ОписаниеСекции.Вставить("ЗаголовокСекции", ЗаголовокСекции);
	ОписаниеСекции.Вставить("ПоляФильтров", ПоляФильтров);
	
	ОписанияВсехСекций.Вставить(ТипСекции, ОписаниеСекции);
	
КонецПроцедуры

Процедура ДобавитьПолеФильтра(ПоляФильтров, ИмяОбласти, ИмяПоля, Путь, ПредставлениеПоля, ТипПоля)
	
	ОписаниеПоляФильтра = Новый Структура;
	ОписаниеПоляФильтра.Вставить("ИмяОбласти", ИмяОбласти);
	ОписаниеПоляФильтра.Вставить("Путь", Путь);
	ОписаниеПоляФильтра.Вставить("ПредставлениеПоля", ПредставлениеПоля);
	ОписаниеПоляФильтра.Вставить("ТипПоля", ТипПоля);
	
	ПоляФильтров.Вставить(ИмяПоля, ОписаниеПоляФильтра);
	
КонецПроцедуры

Функция ПоляФильтровЧистыеАктивы()
	
	Результат = Новый Структура;
	
	ДобавитьПолеФильтра(Результат, "Фильтры", "Счет", "Счет", НСтр("ka='ანგარიში';ru='Счет';en='Score'"), Новый ОписаниеТипов("ПланСчетовСсылка.Управленческий"));
	ДобавитьПолеФильтра(Результат, "Фильтры", "ТипСчета", "Счет.ТипСчета", НСтр("ka='ანგარიშის ტიპი';ru='Тип счета';en='account type'"), Новый ОписаниеТипов("ПеречислениеСсылка.ТипыСчетов"));
	
	Возврат Результат;
	
КонецФункции

Функция ПоляФильтровДеньги()
	
	Результат = Новый Структура;
	
	ДобавитьПолеФильтра(Результат, "ФильтрыБанковскиеСчета", "БанковскийСчет", "БанковскийСчетКасса", НСтр("ka='საბანკო ანგარიში';ru='Банковский счет';en='Bank account'"), Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета"));
	ДобавитьПолеФильтра(Результат, "ФильтрыКассы", "Касса", "БанковскийСчетКасса", НСтр("ka='სალარო';ru='Касса';en='Cashbox'"), Новый ОписаниеТипов("СправочникСсылка.Кассы"));
	ДобавитьПолеФильтра(Результат, "ФильтрыСотрудники", "Сотрудник", "Сотрудник", НСтр("ka='თანამშრომელი';ru='Сотрудник';en='Employee'"), Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	
	Возврат Результат;
	
КонецФункции

Функция ПоляФильтровТовары()
	
	Результат = Новый Структура;
	
	ДобавитьПолеФильтра(Результат, "Фильтры", "Номенклатура", "Номенклатура", НСтр("ka='ნომენკლატურა';ru='Номенклатура';en='Nomenclature'"), Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДобавитьПолеФильтра(Результат, "Фильтры", "КатегорияТовара", "Номенклатура.КатегорияНоменклатуры", НСтр("ka='კატეგორია';ru='Категория';en='Category'"), Новый ОписаниеТипов("СправочникСсылка.КатегорииНоменклатуры"));
	
	Возврат Результат;
	
КонецФункции

Функция ПоляФильтровТоварыНаСобственныхСкладах()
	
	Результат = Новый Структура;
	
	ДобавитьПолеФильтра(Результат, "Фильтры", "Номенклатура", "Номенклатура", НСтр("ka='ნომენკლატურა';ru='Номенклатура';en='Nomenclature'"), Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДобавитьПолеФильтра(Результат, "Фильтры", "КатегорияТовара", "Номенклатура.КатегорияНоменклатуры", НСтр("ka='კატეგორია';ru='Категория';en='Category'"), Новый ОписаниеТипов("СправочникСсылка.КатегорииНоменклатуры"));
	ДобавитьПолеФильтра(Результат, "Фильтры", "СтруктурнаяЕдиница", "СтруктурнаяЕдиница", НСтр("ka='საწყობი';ru='Склад';en='Warehouse'"), Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
	
	Возврат Результат;
	
КонецФункции

Функция ПоляФильтровТоварыУРеализаторов()
	
	Результат = Новый Структура;
	
	ДобавитьПолеФильтра(Результат, "Фильтры", "Номенклатура", "Номенклатура", НСтр("ka='ნომენკლატურა';ru='Номенклатура';en='Nomenclature'"), Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДобавитьПолеФильтра(Результат, "Фильтры", "КатегорияТовара", "Номенклатура.КатегорияНоменклатуры", НСтр("ka='კატეგორია';ru='Категория';en='Category'"), Новый ОписаниеТипов("СправочникСсылка.КатегорииНоменклатуры"));
	ДобавитьПолеФильтра(Результат, "Фильтры", "Контрагент", "Контрагент", НСтр("ka='კონტრაგენტი';ru='Контрагент';en='Counterparty'"), Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	Возврат Результат;
	
КонецФункции

Функция ПоляФильтровДебиторкаДолгиПокупателей()
	
	Результат = Новый Структура;
	
	ДобавитьПолеФильтра(Результат, "Фильтры", "Контрагент", "Контрагент", НСтр("ka='კონტრაგენტი';ru='Контрагент';en='Counterparty'"), Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	Возврат Результат;
	
КонецФункции

Функция ПоляФильтровДебиторкаАвансыПоставщикам()
	
	Результат = Новый Структура;
	
	ДобавитьПолеФильтра(Результат, "Фильтры", "Контрагент", "Контрагент", НСтр("ka='კონტრაგენტი';ru='Контрагент';en='Counterparty'"), Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	Возврат Результат;
	
КонецФункции

Функция ПоляФильтровКредиторкаДолгиПоставщикам()
	
	Результат = Новый Структура;
	
	ДобавитьПолеФильтра(Результат, "Фильтры", "Контрагент", "Контрагент", НСтр("ka='კონტრაგენტი';ru='Контрагент';en='Counterparty'"), Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	Возврат Результат;
	
КонецФункции

Функция ПоляФильтровКредиторкаАвансыОтПокупателей()
	
	Результат = Новый Структура;
	
	ДобавитьПолеФильтра(Результат, "Фильтры", "Контрагент", "Контрагент", НСтр("ka='კონტრაგენტი';ru='Контрагент';en='Counterparty'"), Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	Возврат Результат;
	
КонецФункции

Функция ПоляФильтровПродажиВыручка()
	
	Результат = Новый Структура;
	
	ДобавитьПолеФильтра(Результат, "Фильтры", "Контрагент", "Контрагент", НСтр("ka='კონტრაგენტი';ru='Контрагент';en='Counterparty'"), Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ДобавитьПолеФильтра(Результат, "Фильтры", "Номенклатура", "Номенклатура", НСтр("ka='ნომენკლატურა';ru='Номенклатура';en='Nomenclature'"), Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДобавитьПолеФильтра(Результат, "Фильтры", "КатегорияТовара", "Номенклатура.КатегорияНоменклатуры", НСтр("ka='კატეგორია';ru='Категория';en='Category'"), Новый ОписаниеТипов("СправочникСсылка.КатегорииНоменклатуры"));
	
	Возврат Результат;
	
КонецФункции

Функция ПоляФильтровПродажиКоличество()
	
	Результат = Новый Структура;
	
	ДобавитьПолеФильтра(Результат, "Фильтры", "Контрагент", "Контрагент", НСтр("ka='კონტრაგენტი';ru='Контрагент';en='Counterparty'"), Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ДобавитьПолеФильтра(Результат, "Фильтры", "Номенклатура", "Номенклатура", НСтр("ka='ნომენკლატურა';ru='Номенклатура';en='Nomenclature'"), Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДобавитьПолеФильтра(Результат, "Фильтры", "КатегорияТовара", "Номенклатура.КатегорияНоменклатуры", НСтр("ka='კატეგორია';ru='Категория';en='Category'"), Новый ОписаниеТипов("СправочникСсылка.КатегорииНоменклатуры"));
	
	Возврат Результат;
	
КонецФункции

Функция ПоляФильтровПродажиДинамика()
	
	Результат = Новый Структура;
	
	ДобавитьПолеФильтра(Результат, "Фильтры", "Контрагент", "Контрагент", НСтр("ka='კონტრაგენტი';ru='Контрагент';en='Counterparty'"), Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ДобавитьПолеФильтра(Результат, "Фильтры", "Номенклатура", "Номенклатура", НСтр("ka='ნომენკლატურა';ru='Номенклатура';en='Nomenclature'"), Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДобавитьПолеФильтра(Результат, "Фильтры", "КатегорияТовара", "Номенклатура.КатегорияНоменклатуры", НСтр("ka='კატეგორია';ru='Категория';en='Category'"), Новый ОписаниеТипов("СправочникСсылка.КатегорииНоменклатуры"));
	
	Возврат Результат;
	
КонецФункции

Функция ПоляФильтровПродажиПокупатели()
	
	Результат = Новый Структура;
	
	ДобавитьПолеФильтра(Результат, "Фильтры", "Контрагент", "Контрагент", НСтр("ka='კონტრაგენტი';ru='Контрагент';en='Counterparty'"), Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	Возврат Результат;
	
КонецФункции

Функция ПоляФильтровПродажиСамыеПродаваемыеТовары()
	
	Результат = Новый Структура;
	
	ДобавитьПолеФильтра(Результат, "Фильтры", "Номенклатура", "Номенклатура", НСтр("ka='ნომენკლატურა';ru='Номенклатура';en='Nomenclature'"), Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДобавитьПолеФильтра(Результат, "Фильтры", "КатегорияТовара", "Номенклатура.КатегорияНоменклатуры", НСтр("ka='კატეგორია';ru='Категория';en='Category'"), Новый ОписаниеТипов("СправочникСсылка.КатегорииНоменклатуры"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти