#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДеревоJSON(ЧтениеJSON, Дерево) ЭКСПОРТ
    
    ИмяСвойства = НЕОПРЕДЕЛЕНО;
	
    Пока ЧтениеJSON.Прочитать() Цикл
        TипJSON = ЧтениеJSON.ТипТекущегоЗначения;
        
        Если TипJSON = ТипЗначенияJSON.НачалоОбъекта ИЛИ TипJSON = ТипЗначенияJSON.НачалоМассива Тогда
			
			НовыйОбъект = ?(TипJSON = ТипЗначенияJSON.НачалоОбъекта, Новый Соответствие, Новый Массив);
			
			Если Дерево = НЕОПРЕДЕЛЕНО Тогда
                Дерево = НовыйОбъект;
				СформироватьДеревоJSON(ЧтениеJSON, Дерево);
			Иначе
				Если ТипЗнч(Дерево) = Тип("Массив") Тогда
	                Дерево.Добавить(НовыйОбъект);
					СформироватьДеревоJSON(ЧтениеJSON, НовыйОбъект);
				Иначе
					Если ТипЗнч(Дерево) = Тип("Соответствие") И ЗначениеЗаполнено(ИмяСвойства) Тогда
						Дерево.Вставить(ИмяСвойства, НовыйОбъект);
						СформироватьДеревоJSON(ЧтениеJSON, НовыйОбъект);
					Иначе
						Дерево = НовыйОбъект;
						СформироватьДеревоJSON(ЧтениеJSON, Дерево);
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли TипJSON = ТипЗначенияJSON.ИмяСвойства Тогда
			
            ИмяСвойства = ЧтениеJSON.ТекущееЗначение;
			
			Если Дерево = НЕОПРЕДЕЛЕНО Тогда
				Дерево = Новый Соответствие;
			КонецЕсли;
			
		ИначеЕсли TипJSON = ТипЗначенияJSON.Число ИЛИ TипJSON = ТипЗначенияJSON.Строка ИЛИ TипJSON = ТипЗначенияJSON.Булево ИЛИ TипJSON = ТипЗначенияJSON.Null Тогда
			
            Если ТипЗнч(Дерево) = Тип("Массив") Тогда
                Дерево.Добавить(ЧтениеJSON.ТекущееЗначение);
            ИначеЕсли ТипЗнч(Дерево) = Тип("Соответствие") Тогда
                Дерево.Вставить(ИмяСвойства, ЧтениеJSON.ТекущееЗначение);
			КонецЕсли;
			
		Иначе
			
            Возврат;
			
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

Функция ДатаJSON(Date) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = НЕОПРЕДЕЛЕНО;
	
	Попытка
		РЕЗ = ПрочитатьДатуJSON(Date, ФорматДатыJSON.ISO);
	Исключение
		Попытка
			РЕЗ = ПрочитатьДатуJSON(Date, ФорматДатыJSON.JavaScript);
		Исключение
			Попытка
				РЕЗ = ПрочитатьДатуJSON(Date, ФорматДатыJSON.Microsoft);
			Исключение
				РЕЗ = НЕОПРЕДЕЛЕНО;
			КонецПопытки;
		КонецПопытки;
	КонецПопытки;

	Возврат РЕЗ;
КонецФункции // ()

Функция НайтиИлиСоздатьДополнительныйРеквизит(Заголовок,НаборыДополнительныхРеквизитовИСведений,ТекОписаниеТипа) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	РЕЗ=НЕОПРЕДЕЛЕНО;
	
	Если НЕ ЗначениеЗаполнено(НаборыДополнительныхРеквизитовИСведений) Тогда
		Возврат РЕЗ;
	КонецЕсли;
	
	//Если НЕ НаборыДополнительныхРеквизитовИСведений.Используется Тогда
	//	Попытка
	//		НаборыДополнительныхРеквизитовИСведенийОбъект = НаборыДополнительныхРеквизитовИСведений.ПолучитьОбъект();
	//		НаборыДополнительныхРеквизитовИСведенийОбъект.Используется = ИСТИНА;
	//		НаборыДополнительныхРеквизитовИСведенийОбъект.Записать();
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;	
	
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//               |	ДополнительныеРеквизитыИСведения.Ссылка КАК ТекДопРеквизит
	//               |ИЗ
	//               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	//               |ГДЕ
	//               |	ДополнительныеРеквизитыИСведения.Наименование = &Заголовок
	//               |	И ДополнительныеРеквизитыИСведения.ТипЗначения = &НаборСвойств";
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК ТекДопРеквизит
	               |ИЗ
	               |	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	               |ГДЕ
	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = &НаборСвойств
	               |	И НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.Наименование = &Заголовок";

	
	Запрос.УстановитьПараметр("Заголовок", Заголовок);
	Запрос.УстановитьПараметр("НаборСвойств", НаборыДополнительныхРеквизитовИСведений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.ТекДопРеквизит;
	КонецЦикла;
	
	Если РЕЗ=НЕОПРЕДЕЛЕНО Тогда	
		РЕЗ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		РЕЗ.Наименование = Заголовок;
		РЕЗ.ТипЗначения = ТекОписаниеТипа;
		//РЕЗ.Виден = ИСТИНА;
		//РЕЗ.Доступен = ИСТИНА;
		//РЕЗ.Заголовок = Заголовок;
		//РЕЗ.НаборСвойств = НаборыДополнительныхРеквизитовИСведений;
		//РЕЗ.Комментарий = Заголовок;
		РЕЗ.Записать();
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Свойство", РЕЗ.Ссылка);
	МассивСтрок = НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрок.Количество()=0 Тогда
		НаборыДополнительныхРеквизитовИСведений_Объект=НаборыДополнительныхРеквизитовИСведений.ПолучитьОбъект();
		стрТаб_ДополнительныеРеквизиты=НаборыДополнительныхРеквизитовИСведений_Объект.ДополнительныеРеквизиты.Добавить();
		стрТаб_ДополнительныеРеквизиты.Свойство=РЕЗ.Ссылка;
		НаборыДополнительныхРеквизитовИСведений_Объект.Записать();
	КонецЕсли;			
	
	Возврат РЕЗ.Ссылка;
КонецФункции

Процедура УстановитьДополнительныйРеквизит(ТекОбъект, СвойствоДополнительногоРеквизита, ЗначениеДополнительногоРеквизита) ЭКСПОРТ

	СтрукутраПоиска = Новый Структура("Свойство", СвойствоДополнительногоРеквизита);
	МассивСтрок = ТекОбъект.ДополнительныеРеквизиты.НайтиСтроки(СтрукутраПоиска);
	Если МассивСтрок.Количество()=0 Тогда
		СтрДополнительныеРеквизиты = ТекОбъект.ДополнительныеРеквизиты.Добавить();
		СтрДополнительныеРеквизиты.Свойство = СвойствоДополнительногоРеквизита;
	Иначе
		СтрДополнительныеРеквизиты = МассивСтрок[0];
	КонецЕсли;
	СтрДополнительныеРеквизиты.Значение = ЗначениеДополнительногоРеквизита;

КонецПроцедуры

Функция НайтиЗначениеДополнительногоРеквизита(ТекОбъект, СвойствоДополнительногоРеквизита) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	Если НЕ ТекОбъект.Метаданные().ТабличныеЧасти.Найти("ДополнительныеРеквизиты")=НЕОПРЕДЕЛЕНО Тогда
		Для каждого СтрДополнительныеРеквизиты Из ТекОбъект["ДополнительныеРеквизиты"] Цикл
			Если СтрДополнительныеРеквизиты.Свойство = СвойствоДополнительногоРеквизита Тогда
				РЕЗ = СтрДополнительныеРеквизиты.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция СтруктураДополнительныхРеквизитов(НаборыДополнительныхРеквизитовИСведений) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	Если НаборыДополнительныхРеквизитовИСведений = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ЗаказПокупателя Тогда
		//РЕЗ = Новый Структура("id, order_key, number, customer_id, first_name, last_name, company, personal_number, email, phone");  //+++ Дмгг
		РЕЗ = Новый Структура("id, order_key, number, customer_id, first_name, last_name, company, personal_number, email, phone, payment_method_title"); //+++ Дмгг
		
		РЕЗ.id  = НайтиИлиСоздатьДополнительныйРеквизит("id",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
		РЕЗ.order_key  = НайтиИлиСоздатьДополнительныйРеквизит("order_key",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка"));
		РЕЗ.number  = НайтиИлиСоздатьДополнительныйРеквизит("number",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка"));
		РЕЗ.customer_id  = НайтиИлиСоздатьДополнительныйРеквизит("customer_id",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
		РЕЗ.first_name  = НайтиИлиСоздатьДополнительныйРеквизит("first_name",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка"));
		РЕЗ.last_name  = НайтиИлиСоздатьДополнительныйРеквизит("last_name",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка"));
		РЕЗ.company  = НайтиИлиСоздатьДополнительныйРеквизит("company",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка"));
		РЕЗ.personal_number  = НайтиИлиСоздатьДополнительныйРеквизит("personal_number",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка"));
		РЕЗ.email  = НайтиИлиСоздатьДополнительныйРеквизит("email",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка"));
		РЕЗ.phone  = НайтиИлиСоздатьДополнительныйРеквизит("phone",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка"));
		РЕЗ.payment_method_title  = НайтиИлиСоздатьДополнительныйРеквизит("payment_method_title",НаборыДополнительныхРеквизитовИСведений,Новый ОписаниеТипов("Строка")); //+++ Дмгг
				
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ПолучитьМассивОбъектов(Соединение,Заголовки,ИмяФайлаОтвета,АдресРесурса,НомерСтраницы=НЕОПРЕДЕЛЕНО,МетодЗапроса="GET") ЭКСПОРТ
	ПЕРЕМ РЕЗ,Данные;
	
	РЕЗ = Новый Структура("КодСостояния,КоличествоСтраниц,Данные");
	
	Запрос = Новый HTTPЗапрос();
	Запрос.АдресРесурса = АдресРесурса;
	Запрос.АдресРесурса = Запрос.АдресРесурса+"&page="+НомерСтраницы;
	Запрос.Заголовки = Заголовки;
	
	//Результат = Соединение.Получить(Запрос);
	Результат = Соединение.ВызватьHTTPМетод(МетодЗапроса, Запрос);
	
	РЕЗ.КодСостояния = Результат.КодСостояния;
	
	Если Результат.КодСостояния = 200 Тогда
		
		Если ЗначениеЗаполнено(НомерСтраницы) Тогда
			//РЕЗ.КоличествоСтраниц = Число(Результат.Заголовки.Получить("X-WP-TotalPages"));
			Для каждого ТекЗаголовок Из Результат.Заголовки Цикл
				Если НРЕГ(ТекЗаголовок.Ключ)="x-wp-totalpages" Тогда
					РЕЗ.КоличествоСтраниц = Число(ТекЗаголовок.Значение);
					Прервать;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		
		ТелоЗапроса = Результат.ПолучитьТелоКакСтроку();
		
		ТекстОтвета = Новый ЧтениеJSON();
		ТекстОтвета.УстановитьСтроку(ТелоЗапроса);
		
		СформироватьДеревоJSON(ТекстОтвета, Данные);
		
		РЕЗ.Данные = Данные;
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция ПолучитьСтруктуруСоединения() ЭКСПОРТ
	ПЕРЕМ РЕЗ;

	WordPress_Host = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройкиЭлементовДляРасширений("WordPress_Host");//СокрЛП(Константы.WordPress_Host.Получить());
	WordPress_Consumer_key = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройкиЭлементовДляРасширений("WordPress_Consumer_key");//СокрЛП(Константы.WordPress_Consumer_key.Получить());
	WordPress_Consumer_secret = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройкиЭлементовДляРасширений("WordPress_Consumer_secret");//СокрЛП(Константы.WordPress_Consumer_secret.Получить());
	ПараметрыАутентификации = "?consumer_key="+WordPress_Consumer_key+"&consumer_secret="+WordPress_Consumer_secret;
	
	SSL = ИнтеграцияСНалоговойСлужбыПовтИсп.ПолучитьЗащищенноеСоединение();
	Соединение = Новый HTTPСоединение(WordPress_Host,,,,,,SSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Host", WordPress_Host);
	Заголовки.Вставить("Content-type", "application/json");
	Заголовки.Вставить("charset", "utf-8");
	
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	
	РЕЗ = Новый Структура("Соединение,ПараметрыАутентификации,Заголовки,ИмяФайлаОтвета", Соединение,ПараметрыАутентификации,Заголовки,ИмяФайлаОтвета);

	Возврат РЕЗ;
КонецФункции // ()

Функция НайтиКонтрагентаВРегистре_СопоставлениеКонтрагентовWordPress(id) ЭКСПОРТ
	ПЕРЕМ РЕЗ;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СопоставлениеКонтрагентовWordPress.Контрагент
		|ИЗ
		|	РегистрСведений.СопоставлениеКонтрагентовWordPress КАК СопоставлениеКонтрагентовWordPress
		|ГДЕ
		|	СопоставлениеКонтрагентовWordPress.id = &id";
	
	Запрос.УстановитьПараметр("id", id);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.Контрагент
	КонецЦикла;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция НайтиКонтрагентаВБазеПоИНН(ТекИНН) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	Если НЕ ЗначениеЗаполнено(ТекИНН) Тогда
		Возврат РЕЗ;
	КонецЕсли;
	
	ИНН = СокрЛП(ТекИНН);
	Если СтрДлина(СокрЛП(ТекИНН))=0 Тогда
		Возврат РЕЗ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция НайтиКонтрагентаВБазеПоТелефону(Текphone) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	Если НЕ ЗначениеЗаполнено(Текphone) Тогда
		Возврат РЕЗ;
	КонецЕсли;
	
	phone = СокрЛП(Текphone);
	Если СтрДлина(СокрЛП(phone))=0 Тогда
		Возврат РЕЗ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтрагентыКонтактнаяИнформация.Ссылка
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.НомерТелефона = &НомерТелефона
		|	ИЛИ КонтрагентыКонтактнаяИнформация.НомерТелефонаБезКодов = &НомерТелефона";
	
	Запрос.УстановитьПараметр("НомерТелефона", phone);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция НайтиКонтрагентаВБазеПоEMAIL(Текemail) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	Если НЕ ЗначениеЗаполнено(Текemail) Тогда
		Возврат РЕЗ;
	КонецЕсли;
	
	email = СокрЛП(Текemail);
	Если СтрДлина(СокрЛП(email))=0 Тогда
		Возврат РЕЗ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтрагентыКонтактнаяИнформация.Ссылка
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.АдресЭП = &email";
	
	Запрос.УстановитьПараметр("email", email);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция ПоискКонтрагента(id, personal_number, email,phone) ЭКСПОРТ
	ПЕРЕМ РЕЗ;

	РЕЗ = НайтиКонтрагентаВРегистре_СопоставлениеКонтрагентовWordPress(id);
	Если НЕ ЗначениеЗаполнено(РЕЗ) Тогда
		
		РЕЗ = НайтиКонтрагентаВБазеПоИНН(personal_number);
		Если НЕ ЗначениеЗаполнено(РЕЗ) Тогда
			
			РЕЗ = НайтиКонтрагентаВБазеПоТелефону(phone);
			Если НЕ ЗначениеЗаполнено(РЕЗ) Тогда
				
				РЕЗ = НайтиКонтрагентаВБазеПоТелефону(phone);
				Если НЕ ЗначениеЗаполнено(РЕЗ) Тогда
					
					РЕЗ = НайтиКонтрагентаВБазеПоEMAIL(phone);					
					
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат РЕЗ;
КонецФункции // ()

//+++ Дмгг
Функция ПоискСкладаПоАдресу(АдресСклада) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|ГДЕ
		|	СтруктурныеЕдиницы.Адрес = &АдресСклада";
	
	Запрос.УстановитьПараметр("АдресСклада", АдресСклада);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.Ссылка
	КонецЦикла;
	
	Возврат Рез	

КонецФункции // ПоискСкладаПоАдресу(АдресСклада)()
//--- Дмгг

Функция СоздатьИлиНайтиКонтрагента(id, company, name, personal_number, email, phone, СтрокаАдрес, ТипНалогообложенияНДС, Валюта, ЗаказПокупателя) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = WordPress.ПоискКонтрагента(id,personal_number,email,phone);
	Если НЕ ЗначениеЗаполнено(РЕЗ) Тогда
	
		НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		
		ГруппаДляНовыхКонтрагентов = Константы.WordPress_ГруппаДляНовыхКонтрагентов.Получить();
		Если ЗначениеЗаполнено(ГруппаДляНовыхКонтрагентов) Тогда
			НовыйКонтрагент.Родитель = ГруппаДляНовыхКонтрагентов;
		КонецЕсли;
		
		Если СтрДлина(СокрЛП(company))>0 Тогда
			НовыйКонтрагент.Наименование = СокрЛП(company);
			НовыйКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
		Иначе
			НовыйКонтрагент.Наименование = СокрЛП(name);
			НовыйКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
		КонецЕсли;
		
		НовыйКонтрагент.НаименованиеПолное = НовыйКонтрагент.Наименование;
		
		Если СтрДлина(СокрЛП(personal_number))>=11 Тогда
			НовыйКонтрагент.ИНН = СокрЛП(personal_number);
		КонецЕсли;
		
		НовыйКонтрагент.ТипНалогообложенияНДС = ТипНалогообложенияНДС;
		Если НЕ ЗначениеЗаполнено(НовыйКонтрагент.ТипНалогообложенияНДС) Тогда
			НовыйКонтрагент.ТипНалогообложенияНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		КонецЕсли;
		
		НовыйКонтрагент.ВестиРасчетыПоДоговорам = Истина;
		НовыйКонтрагент.ВестиРасчетыПоДокументам = Истина;
		НовыйКонтрагент.ВестиРасчетыПоЗаказам = Истина;
		НовыйКонтрагент.ВестиУчетОплатыПоСчетам = Истина;
		
		НовыйКонтрагент.СчетУчетаРасчетовСПокупателем = ПланыСчетов.Управленческий.РасчетыСПокупателями;
		НовыйКонтрагент.СчетУчетаАвансовПокупателя = ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным;
		НовыйКонтрагент.СчетУчетаРасчетовСПоставщиком = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
		НовыйКонтрагент.СчетУчетаАвансовПоставщику = ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным;
		
		НовыйКонтрагент.АдресЭП = email;
		
		Если СтрДлина(СокрЛП(personal_number))<11 Тогда
			
			СтрКонтактнаяИнформация = НовыйКонтрагент.КонтактнаяИнформация.Добавить();
			СтрКонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			СтрКонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
			СтрКонтактнаяИнформация.ЗначенияПолей = "НомерТелефона="+СокрЛП(personal_number);
			СтрКонтактнаяИнформация.Представление = СокрЛП(personal_number);
			СтрКонтактнаяИнформация.НомерТелефона = СокрЛП(personal_number);		
			
		КонецЕсли;
		
		Если СтрДлина(СокрЛП(phone))>0 Тогда
			
			СтрКонтактнаяИнформация = НовыйКонтрагент.КонтактнаяИнформация.Добавить();
			СтрКонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			СтрКонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
			СтрКонтактнаяИнформация.ЗначенияПолей = "НомерТелефона="+СокрЛП(phone);
			СтрКонтактнаяИнформация.Представление = СокрЛП(phone);
			СтрКонтактнаяИнформация.НомерТелефона = СокрЛП(phone);		
			
		КонецЕсли;
		
		Если СтрДлина(СокрЛП(email))>0 Тогда
		
			СтрКонтактнаяИнформация = НовыйКонтрагент.КонтактнаяИнформация.Добавить();
			СтрКонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			СтрКонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
			СтрКонтактнаяИнформация.Представление = СокрЛП(email);
			СтрКонтактнаяИнформация.АдресЭП = СокрЛП(email);
			Поз = Найти(СтрКонтактнаяИнформация.АдресЭП, "@");
			Если Поз <> 0 Тогда
				СтрКонтактнаяИнформация.ДоменноеИмяСервера = Сред(СтрКонтактнаяИнформация.АдресЭП, Поз+1);
				
				Если НЕ ЗначениеЗаполнено(НовыйКонтрагент.Наименование) Тогда
					НовыйКонтрагент.Наименование = ЛЕВ(СтрКонтактнаяИнформация.АдресЭП, Поз-1);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрДлина(СокрЛП(СтрокаАдрес))>0 Тогда
			
			СтрКонтактнаяИнформация = НовыйКонтрагент.КонтактнаяИнформация.Добавить();
			СтрКонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			СтрКонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
			СтрКонтактнаяИнформация.Представление = СокрЛП(СтрокаАдрес);
			
		КонецЕсли;
		
		Попытка
		
			НовыйКонтрагент.Записать();
			РЕЗ = НовыйКонтрагент.Ссылка;
		
		Исключение
		
		КонецПопытки;
		
		Если ЗначениеЗаполнено(НовыйКонтрагент.Ссылка) И ЗначениеЗаполнено(id) Тогда
			НаборЗаписей = РегистрыСведений.СопоставлениеКонтрагентовWordPress.СоздатьНаборЗаписей(); 
			
			НаборЗаписей.Отбор.id.Установить(id); 
			
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.Контрагент = НовыйКонтрагент.Ссылка; 
			НоваяЗапись.id = id; 
			
			НаборЗаписей.Записать(ИСТИНА);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовыйКонтрагент.Ссылка) Тогда
		
			НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			НовыйДоговор.Владелец = НовыйКонтрагент.Ссылка;
			НовыйДоговор.Наименование = "ნაგულისხმევი";
			НовыйДоговор.Организация = Справочники.Организации.ОсновнаяОрганизация;
			НовыйДоговор.ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем;
			НовыйДоговор.ВалютаРасчетов = Валюта;
			Если НЕ ЗначениеЗаполнено(НовыйДоговор.ВалютаРасчетов) Тогда
				НовыйДоговор.ВалютаРасчетов = Константы.ВалютаУчета.Получить();
			КонецЕсли;
			НовыйДоговор.ТипНалогообложенияНДС = НовыйКонтрагент.ТипНалогообложенияНДС;
			НовыйДоговор.Адрес = СокрЛП(СтрокаАдрес);
			
			Попытка
			
				НовыйДоговор.Записать();
				НовыйКонтрагент.ДоговорПоУмолчанию = НовыйДоговор.Ссылка;
				НовыйКонтрагент.Записать();
			
			Исключение
			
			КонецПопытки;
		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
			
			ЗаказПокупателяОбъект = ЗаказПокупателя.ПолучитьОбъект();
			
			ЗаказПокупателяОбъект.Контрагент = НовыйКонтрагент.Ссылка;
			ЗаказПокупателяОбъект.Договор = НовыйДоговор.Ссылка;
			
			ЗаказПокупателяОбъект.ОбменДанными.Загрузка = ИСТИНА;
			ЗаказПокупателяОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция ПолучитьОстатокТовара(Номенклатура) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЗапасыОстаткиИОбороты.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток
		|ИЗ
		|	РегистрНакопления.Запасы.ОстаткиИОбороты(
		|			,
		|			,
		|			,
		|			,
		|			Номенклатура = &Номенклатура
		|				И СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Запасы)
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЗапасыОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",Константы.WordPress_Склад.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.КоличествоКонечныйОстаток;
	КонецЦикла;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция ПоискТовара(id,sku) ЭКСПОРТ
	ПЕРЕМ РЕЗ;

	РЕЗ = НайтиТоварВРегистре_СопоставлениеНоменклатурыWordPress(id);
	Если НЕ ЗначениеЗаполнено(РЕЗ) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул = &sku";
		
		Запрос.УстановитьПараметр("sku", sku);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
		КонецЦикла;
		
	КонецЕсли;

	Возврат РЕЗ;
КонецФункции // ()

Функция НайтиТоварВРегистре_СопоставлениеНоменклатурыWordPress(id) ЭКСПОРТ
	ПЕРЕМ РЕЗ;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СопоставлениеНоменклатурыWordPress.Номенклатура
		|ИЗ
		|	РегистрСведений.СопоставлениеНоменклатурыWordPress КАК СопоставлениеНоменклатурыWordPress
		|ГДЕ
		|	СопоставлениеНоменклатурыWordPress.id = &id";
	
	Запрос.УстановитьПараметр("id", id);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.Номенклатура
	КонецЦикла;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция НайтиЗаказПокупателяВРегистре_СопоставлениеЗаказПокупателяWordPress(id, ИскатьНеудачные=ЛОЖЬ) ЭКСПОРТ
	ПЕРЕМ РЕЗ;

	// Ищем среди удачных заказов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СопоставлениеЗаказПокупателяWordPress.ЗаказПокупателя
		|ИЗ
		|	РегистрСведений.СопоставлениеЗаказПокупателяWordPress КАК СопоставлениеЗаказПокупателяWordPress
		|ГДЕ
		|	СопоставлениеЗаказПокупателяWordPress.id = &id";
	
	Запрос.УстановитьПараметр("id", id);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РЕЗ = ВыборкаДетальныеЗаписи.ЗаказПокупателя
	КонецЦикла;
	
	Если (ИскатьНеудачные) И (НЕ ЗначениеЗаполнено(РЕЗ)) Тогда
	
		// Ищем среди НЕудачных заказов
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СопоставлениеНеудачнаяЗагрузкаЗаказПокупателяWordPress.ЗаказПокупателя
		|ИЗ
		|	РегистрСведений.СопоставлениеНеудачнаяЗагрузкаЗаказПокупателяWordPress КАК СопоставлениеНеудачнаяЗагрузкаЗаказПокупателяWordPress
		|ГДЕ
		|	СопоставлениеНеудачнаяЗагрузкаЗаказПокупателяWordPress.id = &id";
		
		Запрос.УстановитьПараметр("id", id);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			РЕЗ = ВыборкаДетальныеЗаписи.ЗаказПокупателя
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции // ()

Функция СоздатьЗаказПокупателя(СтруктураШапки,ЗаказПокупателя=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	ЗаказПокупателя = НЕОПРЕДЕЛЕНО;
	СтруктураДополнительныхРеквизитовЗаказыПокупателей = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ЗаказПокупателя);
	
	Если (НЕ ТипЗНЧ(ЗаказПокупателя)=Тип("ДокументСсылка.ЗаказПокупателя")) ИЛИ (ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка()) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказПокупателяДополнительныеРеквизиты.Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя.ДополнительныеРеквизиты КАК ЗаказПокупателяДополнительныеРеквизиты
		|ГДЕ
		|	ЗаказПокупателяДополнительныеРеквизиты.Свойство = &Свойство
		|	И ЗаказПокупателяДополнительныеРеквизиты.Значение = &Значение";
		
		Запрос.УстановитьПараметр("Свойство", СтруктураДополнительныхРеквизитовЗаказыПокупателей.order_key);
		Запрос.УстановитьПараметр("Значение", СтруктураШапки.order_key);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаказПокупателя = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
	Иначе
		
		ЗаказПокупателяОбъект = ЗаказПокупателя.ПолучитьОбъект();
		ЗаказПокупателяОбъект.Запасы.Очистить();
		ЗаказПокупателяОбъект.ОбменДанными.Загрузка = ИСТИНА;
		ЗаказПокупателяОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		ЗаказПокупателяОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();		
	Иначе
		ЗаказПокупателяОбъект = ЗаказПокупателя.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаказПокупателяОбъект.ПоложениеДатыОтгрузки = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти");
	
	Для каждого СтрСтруктураДополнительныхРеквизитовЗаказыПокупателей Из СтруктураДополнительныхРеквизитовЗаказыПокупателей Цикл
	
		ТекЗначение = НЕОПРЕДЕЛЕНО;
		СтруктураШапки.Свойство(СтрСтруктураДополнительныхРеквизитовЗаказыПокупателей.Ключ,ТекЗначение);
		УстановитьДополнительныйРеквизит(ЗаказПокупателяОбъект, СтрСтруктураДополнительныхРеквизитовЗаказыПокупателей.Значение, ТекЗначение);
	
	КонецЦикла;
	
	ЗаказПокупателяОбъект.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Утвержден;
	
	ЗаказПокупателяОбъект.Номер = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СтруктураШапки.number, 11, "0", "Слева");
	ЗаказПокупателяОбъект.Дата = СтруктураШапки.date_created;
	Если ЗначениеЗаполнено(ЗаказПокупателяОбъект.Дата) Тогда
		ТекДата = ЗаказПокупателяОбъект.Дата;
	Иначе
		ТекДата = ТекущаяДата();
	КонецЕсли;
	
	ЗаказПокупателяОбъект.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу;
	
	ЗаказПокупателяОбъект.Организация = Справочники.Организации.ОсновнаяОрганизация;
	//ЗаказПокупателяОбъект.СтруктурнаяЕдиницаПродажи = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	Если НЕ ЗначениеЗаполнено(ЗаказПокупателяОбъект.СтруктурнаяЕдиницаПродажи) Тогда
	
		ПодразделениеДляНовыхЗаказов = Константы.WordPress_ПодразделениеДляЗаказовИРасходных.Получить();
		Если ЗначениеЗаполнено(ПодразделениеДляНовыхЗаказов) Тогда
			ЗаказПокупателяОбъект.СтруктурнаяЕдиницаПродажи = ПодразделениеДляНовыхЗаказов;
		Иначе
			ЗаказПокупателяОбъект.СтруктурнаяЕдиницаПродажи = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
		КонецЕсли;
	
	КонецЕсли;
	//+++ Дмгг
	//ЗаказПокупателяОбъект.СтруктурнаяЕдиницаРезерв = Константы.WordPress_Склад.Получить();
	Если СтруктураШапки.ЭтоСамовывоз Тогда 
		ЗаказПокупателяОбъект.СтруктурнаяЕдиницаРезерв = СтруктураШапки.СкладРезерв;
		ЗаказПокупателяОбъект.Самвывоз = Истина;
	Иначе
		ЗаказПокупателяОбъект.СтруктурнаяЕдиницаРезерв = Константы.WordPress_Склад.Получить();
		ЗаказПокупателяОбъект.Самвывоз = ЛОЖЬ;
	КонецЕсли;
	//--- Дмгг
	
	Если СтруктураШапки.total_tax>0 Тогда
		ЗаказПокупателяОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	Иначе
		ЗаказПокупателяОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураШапки.Контрагент) Тогда
		ЗаказПокупателяОбъект.Контрагент = СтруктураШапки.Контрагент;
	Иначе
		ЗаказПокупателяОбъект.Контрагент = Константы.WordPress_КонтрагентПоУмолчанию.Получить();
	КонецЕсли;
	
	Если ЗаказПокупателяОбъект.Контрагент.ВестиРасчетыПоДоговорам Тогда
		МенеджерСправочника = Справочники.ДоговорыКонтрагентов;
		СписокВидовДоговоров = МенеджерСправочника.ПолучитьСписокВидовДоговораДляДокумента(ЗаказПокупателяОбъект.Ссылка, ЗаказПокупателяОбъект.ВидОперации);
		ЗаказПокупателяОбъект.Договор = МенеджерСправочника.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(ЗаказПокупателяОбъект.Контрагент, ЗаказПокупателяОбъект.Организация, СписокВидовДоговоров);	
	Иначе
		ЗаказПокупателяОбъект.Договор = ЗаказПокупателяОбъект.Контрагент.ДоговорПоУмолчанию;
	КонецЕсли;
	
	ЗаказПокупателяОбъект.ВалютаДокумента = Справочники.Валюты.НайтиПоНаименованию(СОКРЛП(СтруктураШапки.currency));
	Если НЕ ЗначениеЗаполнено(ЗаказПокупателяОбъект.ВалютаДокумента) И ЗначениеЗаполнено(ЗаказПокупателяОбъект.Договор) Тогда
		ЗаказПокупателяОбъект.ВалютаДокумента = ЗаказПокупателяОбъект.Договор.ВалютаРасчетов;
	КонецЕсли;
	
	ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекДата, Новый Структура("Валюта", ЗаказПокупателяОбъект.ВалютаДокумента));
	ЗаказПокупателяОбъект.Курс      = ?(ВалютаРасчетовКурсКратность.Курс = 0, 1, ВалютаРасчетовКурсКратность.Курс);
	ЗаказПокупателяОбъект.Кратность = ?(ВалютаРасчетовКурсКратность.Кратность = 0, 1, ВалютаРасчетовКурсКратность.Кратность);
	
	Если ЗначениеЗаполнено(ЗаказПокупателяОбъект.Договор) Тогда
		ЗаказПокупателяОбъект.ВидЦен = ЗаказПокупателяОбъект.Договор.ВидЦен;
		ЗаказПокупателяОбъект.ВидСкидкиНаценки = ЗаказПокупателяОбъект.Договор.ВидСкидкиНаценки;
	КонецЕсли;
	ЗаказПокупателяОбъект.НДСВключатьВСтоимость = СтруктураШапки.prices_include_tax;
	//ЗаказПокупателяОбъект.СуммаВключаетНДС = СтруктураШапки.prices_include_tax;
		
	ЗаказПокупателяОбъект.Комментарий = СтруктураШапки.customer_note;
	ЗаказПокупателяОбъект.СуммаДокумента = СтруктураШапки.total;
	ЗаказПокупателяОбъект.Автор = Константы.WordPress_Автор.Получить();
	
	ЗаказПокупателяОбъект.Запасы.Очистить();
	
	//ЗаказПокупателяОбъект.УстановитьНовыйНомер();
	ЗаказПокупателяОбъект.ОбменДанными.Загрузка = ИСТИНА;
	ЗаказПокупателяОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	ЗаказПокупателя = ЗаказПокупателяОбъект.Ссылка;
	
	РЕЗ = ЗаказПокупателя;
	Возврат РЕЗ;
КонецФункции // ()

Процедура ДобавитьСтрокуВТЧЗапасыЗаказаПокупателя(ЗаказПокупателя,СтруктураСтроки,ТипНоменклатуры) ЭКСПОРТ

	Если НЕ ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказПокупателяОбъект = ЗаказПокупателя.ПолучитьОбъект();
	
	СтрокаТабличнойЧасти = ЗаказПокупателяОбъект.Запасы.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктураСтроки);
	
	СтрокаТабличнойЧасти.ДатаОтгрузки = ЗаказПокупателяОбъект.Дата;
	
	СтрокаТабличнойЧасти.ТипНоменклатурыЗапас = ТипНоменклатуры;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
	
	Если СтрокаТабличнойЧасти.СуммаНДС>0 Тогда
		СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.НДС18;
	Иначе
		СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(ЗаказПокупателяОбъект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	
	ЗаказПокупателяОбъект.ОбменДанными.Загрузка = ИСТИНА;	
	ЗаказПокупателяОбъект.Записать(РежимЗаписиДокумента.Запись);

КонецПроцедуры

Функция ЗавершитьРаботуСЗаказом(ЗаказПокупателя, id=НЕОПРЕДЕЛЕНО,Рассрочка) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ЛОЖЬ;

	ЗаказПокупателяОбъект = ЗаказПокупателя.ПолучитьОбъект();
	
	СуммаВсего = ЗаказПокупателяОбъект.Запасы.Итог("Всего");
	СуммаСкидки = ЗаказПокупателяОбъект.СуммаДокумента - СуммаВсего;
	Если СуммаСкидки>0 Тогда
	
		Для каждого СтрокаТабличнойЧасти Из ЗаказПокупателяОбъект.Запасы Цикл
			
			СуммаПередРасчетом = СтрокаТабличнойЧасти.Сумма;
			
			СуммаСкидкиВСтроке = СуммаСкидки * СтрокаТабличнойЧасти.Всего / СуммаВсего;
			
			СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = СуммаСкидкиВСтроке * 100 / СтрокаТабличнойЧасти.Всего;
			Если СтрокаТабличнойЧасти.ПроцентСкидкиНаценки > 100 Тогда
				СтрокаТабличнойЧасти.Сумма = 0;
			ИначеЕсли СтрокаТабличнойЧасти.ПроцентСкидкиНаценки <> 0 И СтрокаТабличнойЧасти.Количество <> 0 Тогда
				СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма * (1 - СтрокаТабличнойЧасти.ПроцентСкидкиНаценки / 100);
			КонецЕсли;
			
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
			
			СтрокаТабличнойЧасти.СуммаНДС = ?(ЗаказПокупателяОбъект.СуммаВключаетНДС, 
												СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
												СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
			
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(ЗаказПокупателяОбъект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
			
			СтрокаТабличнойЧасти.СуммаСкидки = СуммаПередРасчетом - СтрокаТабличнойЧасти.Сумма;
			
		
		КонецЦикла; 
	
	КонецЕсли;
	
	// Заполнить партии
	СкладЕДИ = ЗаказПокупателяОбъект.СтруктурнаяЕдиницаРезерв;
	МА_ОбщегоНазначения.ЗаполнениеПоПартиям(ЗаказПокупателяОбъект,СкладЕДИ,Истина,Истина,,Рассрочка);
	
	//+++ Дмгг
	// Да госпада, это костыль!!!
	Если ЗаказПокупателяОбъект.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ПустаяСсылка() Тогда 
		ЗаказПокупателяОбъект.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
	КонецЕсли;
	//--- Дмгг
	
	ЗаказПокупателяОбъект.ОбменДанными.Загрузка = ИСТИНА;
	ЗаказПокупателяОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Попытка
		ЗаказПокупателяОбъект.ОбменДанными.Загрузка = ЛОЖЬ;
		ЗаказПокупателяОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		РЕЗ = ИСТИНА;
	Исключение
		ТекстСообщения = "Не удалось провести заказ покупателя " + ЗаказПокупателяОбъект.Ссылка;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		РЕЗ = ЛОЖЬ;
	КонецПопытки;
	
	// Записываем в регистры
	СтруктураДополнительныхРеквизитовЗаказыПокупателей = СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ЗаказПокупателя);
	Текid = НайтиЗначениеДополнительногоРеквизита(ЗаказПокупателяОбъект, СтруктураДополнительныхРеквизитовЗаказыПокупателей.id);
	Если НЕ ЗначениеЗаполнено(Текid) Тогда
		Текid = id;
	КонецЕсли;
	
	Если РЕЗ И ЗначениеЗаполнено(Текid) Тогда		
		// Заносим в регистр удачных загрузок
		НаборЗаписей = РегистрыСведений.СопоставлениеЗаказПокупателяWordPress.СоздатьНаборЗаписей(); 
		
		НаборЗаписей.Отбор.id.Установить(Текid); 
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ЗаказПокупателя = ЗаказПокупателяОбъект.Ссылка; 
		НоваяЗапись.id = Текid; 
		
		НаборЗаписей.Записать(ИСТИНА);
		
		// Удаляем из регистра неудачных загрузок
		
		НаборЗаписей1 = РегистрыСведений.СопоставлениеНеудачнаяЗагрузкаЗаказПокупателяWordPress.СоздатьНаборЗаписей(); 
		
		НаборЗаписей1.Отбор.id.Установить(Текid); 
		НаборЗаписей1.Записать(ИСТИНА);
		
		РЕЗ = ИСТИНА;
	Иначе
	    // Удаляем из регистра удачных загрузок
		НаборЗаписей = РегистрыСведений.СопоставлениеЗаказПокупателяWordPress.СоздатьНаборЗаписей(); 
		
		НаборЗаписей.Отбор.id.Установить(Текid); 
		НаборЗаписей.Записать(ИСТИНА);
		
		// Заносим в регистр неудачных загрузок
		
		НаборЗаписей1 = РегистрыСведений.СопоставлениеНеудачнаяЗагрузкаЗаказПокупателяWordPress.СоздатьНаборЗаписей(); 
		
		НаборЗаписей1.Отбор.id.Установить(Текid); 
		
		НоваяЗапись1 = НаборЗаписей1.Добавить(); 
		НоваяЗапись1.ЗаказПокупателя = ЗаказПокупателяОбъект.Ссылка; 
		НоваяЗапись1.id = Текid;
		
		НаборЗаписей1.Записать(ИСТИНА);
		
		РЕЗ = ЛОЖЬ;
	КонецЕсли;

	
	Возврат РЕЗ;
КонецФункции

Функция СоздатьРасходнуюНакладнуюНаОснованииЗаказаПокупателя(ЗаказПокупателя) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РасходнаяНакладная = Документы.РасходнаяНакладная.СоздатьДокумент();
	РасходнаяНакладная.Заполнить(ЗаказПокупателя.Ссылка);
	РасходнаяНакладная.Дата = ЗаказПокупателя.Дата+1;
	РасходнаяНакладная.СуммаВключаетНДС = ЗаказПокупателя.СуммаВключаетНДС;
	//РасходнаяНакладная.СтруктурнаяЕдиница = Константы.WordPress_Склад.Получить();
	//РасходнаяНакладная.Подразделение = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	ПодразделениеДляНовыхЗаказов = Константы.WordPress_ПодразделениеДляЗаказовИРасходных.Получить();
	Если ЗначениеЗаполнено(ПодразделениеДляНовыхЗаказов) Тогда
		РасходнаяНакладная.Подразделение = ПодразделениеДляНовыхЗаказов;
	Иначе
		РасходнаяНакладная.Подразделение = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РасходнаяНакладная.Контрагент) Тогда
		РасходнаяНакладная.Контрагент = Константы.WordPress_КонтрагентПоУмолчанию.Получить();
	КонецЕсли;
	
	РасходнаяНакладная.ОбменДанными.Загрузка = ИСТИНА;
	РасходнаяНакладная.Записать(РежимЗаписиДокумента.Запись);
	
	РЕЗ = РасходнаяНакладная.Ссылка;
	
	Попытка
		РасходнаяНакладная.ОбменДанными.Загрузка = ЛОЖЬ;
		РасходнаяНакладная.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстСообщения = "Не удалось провести расходную накладную " + РасходнаяНакладная.Ссылка;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Возврат РЕЗ;
КонецФункции // ()

Процедура УстановитьАдресДоставкиВЗаказПокупателя(ЗаказПокупателя, СтрокаАдресДоставки)ЭКСПОРТ

	ЗаказПокупателяОбъект = ЗаказПокупателя.ПолучитьОбъект();
	
	СвойствоАдресДоставки = Константы.WordPress_ДополнительныйРеквизитАдресДоставкиДляЗаказовПокупателей.Получить();
	Если ТипЗНЧ(СвойствоАдресДоставки.ТипЗначения)=Тип("Строка") Тогда
		ЗначениеДополнительногоРеквизита = СтрокаАдресДоставки;
	Иначе
		ЗначенияСвойствОбъектов = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаАдресДоставки,ИСТИНА,,СвойствоАдресДоставки);
		Если (ЗначенияСвойствОбъектов = НЕОПРЕДЕЛЕНО) ИЛИ (ЗначенияСвойствОбъектов = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка()) Тогда
			ЗначенияСвойствОбъектовОбъект = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
			ЗначенияСвойствОбъектовОбъект.Наименование = СтрокаАдресДоставки;
			ЗначенияСвойствОбъектовОбъект.Владелец = СвойствоАдресДоставки;
			ЗначенияСвойствОбъектовОбъект.Записать();
			ЗначенияСвойствОбъектов = ЗначенияСвойствОбъектовОбъект.Ссылка;
		КонецЕсли;
		ЗначениеДополнительногоРеквизита = ЗначенияСвойствОбъектов;
	КонецЕсли;
	WordPress.УстановитьДополнительныйРеквизит(ЗаказПокупателяОбъект, СвойствоАдресДоставки, ЗначениеДополнительногоРеквизита);
	
	ЗаказПокупателяОбъект.ОбменДанными.Загрузка = ИСТИНА;
	ЗаказПокупателяОбъект.Записать(РежимЗаписиДокумента.Запись);

КонецПроцедуры

// Функция - Загрузить заказы
// Возвращает сформированную таблицу заказов. Передавать данные может только на сервере.
// Возвращаемое значение:
// ТЗ_Заказы - таблица значений - таблица закаказов товаров.
//
Функция ЗагрузитьЗаказы(Дата1,Дата2) ЭКСПОРТ
	ПЕРЕМ ДеревоОбъектов;
	
	ТЗ_Заказы = Новый ТаблицаЗначений();
	ТЗ_Заказы.Колонки.Добавить("id");
	ТЗ_Заказы.Колонки.Добавить("order_key");
	ТЗ_Заказы.Колонки.Добавить("date_created");
	ТЗ_Заказы.Колонки.Добавить("discount_total");
	ТЗ_Заказы.Колонки.Добавить("discount_tax");
	ТЗ_Заказы.Колонки.Добавить("shipping_total");
	ТЗ_Заказы.Колонки.Добавить("shipping_tax");
	ТЗ_Заказы.Колонки.Добавить("total");
	ТЗ_Заказы.Колонки.Добавить("total_tax");
	ТЗ_Заказы.Колонки.Добавить("prices_include_tax");
	ТЗ_Заказы.Колонки.Добавить("customer_id");
	ТЗ_Заказы.Колонки.Добавить("customer_note");
	ТЗ_Заказы.Колонки.Добавить("currency");
	ТЗ_Заказы.Колонки.Добавить("status");
	ТЗ_Заказы.Колонки.Добавить("personal_number");
	ТЗ_Заказы.Колонки.Добавить("Контрагент");
	ТЗ_Заказы.Колонки.Добавить("email");
	ТЗ_Заказы.Колонки.Добавить("phone");
	ТЗ_Заказы.Колонки.Добавить("first_name");
	ТЗ_Заказы.Колонки.Добавить("last_name");
	ТЗ_Заказы.Колонки.Добавить("company");
	ТЗ_Заказы.Колонки.Добавить("payment_method");
	ТЗ_Заказы.Колонки.Добавить("number");
	ТЗ_Заказы.Колонки.Добавить("ЗаказПокупателя");
	ТЗ_Заказы.Колонки.Добавить("РасходнаяНакладная");
	ТЗ_Заказы.Колонки.Добавить("Результат");
	ТЗ_Заказы.Колонки.Добавить("payment_method_title"); //+++ Дмгг
	ТЗ_Заказы.Колонки.Добавить("ЭтоСамовывоз"); //+++ Дмгг	
	ТЗ_Заказы.Колонки.Добавить("СкладРезерв"); //+++ Дмгг
	
	СтруктураСоединения = WordPress.ПолучитьСтруктуруСоединения();
	ПустойСкладРезерва = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();//+++ Дмгг
	
	АдресРесурса = "/wp-json/wc/v3/orders"+СтруктураСоединения.ПараметрыАутентификации;
	АдресРесурса = АдресРесурса+"&after="+ЗаписатьДатуJSON(Дата1-1, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДата);
	АдресРесурса = АдресРесурса+"&before="+ЗаписатьДатуJSON(Дата2+1, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДата);
	
	Результат = WordPress.ПолучитьМассивОбъектов(СтруктураСоединения.Соединение,СтруктураСоединения.Заголовки,СтруктураСоединения.ИмяФайлаОтвета,АдресРесурса,1);
	Если Результат.КодСостояния = 200 Тогда
		
		Данные = Результат.Данные;
		Для каждого СтрДанные Из Данные Цикл
			
			АдресСклада = "";//+++ Дмгг

			ТекСтатус = СтрДанные.Получить("status");
			Если НЕ ((ТекСтатус = "on-hold") ИЛИ (ТекСтатус = "processing") ИЛИ (ТекСтатус = "pending") ИЛИ (ТекСтатус = "space-bank")) Тогда
				Продолжить;
			КонецЕсли;
			
			Тек_id = СтрДанные.Получить("id");
			Тек_order_key = СтрДанные.Получить("order_key");
			
			ИскатьНеудачные = ИСТИНА;
			ЗаказПокупателя = WordPress.НайтиЗаказПокупателяВРегистре_СопоставлениеЗаказПокупателяWordPress(Тек_id,ИскатьНеудачные);
			Если НЕ ЗначениеЗаполнено(ЗаказПокупателя) Тогда
				
				Стр_ТЗ_Заказы = ТЗ_Заказы.Добавить();
				Стр_ТЗ_Заказы.Результат = "Неудачно"; // На всякий случай
				Стр_ТЗ_Заказы.ЭтоСамовывоз = ЛОЖЬ;//+++ Дмгг
				
				// Шапка
				Стр_ТЗ_Заказы.id = СтрДанные.Получить("id");
				Стр_ТЗ_Заказы.order_key = СтрДанные.Получить("order_key");
				Стр_ТЗ_Заказы.number = СтрДанные.Получить("number");
				Стр_ТЗ_Заказы.date_created = WordPress.ДатаJSON(СтрДанные.Получить("date_created"));
				Стр_ТЗ_Заказы.discount_total = Число(СтрДанные.Получить("discount_total"));
				Стр_ТЗ_Заказы.discount_tax = Число(СтрДанные.Получить("discount_tax"));
				Стр_ТЗ_Заказы.shipping_total = Число(СтрДанные.Получить("shipping_total"));
				Стр_ТЗ_Заказы.shipping_tax = Число(СтрДанные.Получить("shipping_tax"));
				Стр_ТЗ_Заказы.total = Число(СтрДанные.Получить("total"));
				Стр_ТЗ_Заказы.total_tax = Число(СтрДанные.Получить("total_tax"));
				Стр_ТЗ_Заказы.prices_include_tax = СтрДанные.Получить("prices_include_tax");
				Стр_ТЗ_Заказы.customer_id = СтрДанные.Получить("customer_id");
				Стр_ТЗ_Заказы.customer_note = СтрДанные.Получить("customer_note");
				Стр_ТЗ_Заказы.currency = СтрДанные.Получить("currency");
				Стр_ТЗ_Заказы.status = СтрДанные.Получить("status");
				Стр_ТЗ_Заказы.payment_method = СтрДанные.Получить("payment_method");
				Стр_ТЗ_Заказы.payment_method_title = СтрДанные.Получить("payment_method_title"); //+++ Дмгг
				
				meta_data = СтрДанные.Получить("meta_data");
				Для каждого Стр_meta_data Из meta_data Цикл
					Если Стр_meta_data.Получить("key")="_personal_number" Тогда
						Стр_ТЗ_Заказы.personal_number = Стр_meta_data.Получить("value");
					КонецЕсли;
					//+++ Дмгг
					Если Стр_meta_data.Получить("key")="mx_shipping_option" Тогда
						АдресСклада = Стр_meta_data.Получить("value");
					КонецЕсли;
					//--- Дмгг
				КонецЦикла;
				
				//+++ Дмгг
				Стр_ТЗ_Заказы.ЭтоСамовывоз = Ложь;
				shipping_lines = СтрДанные.Получить("shipping_lines");
				Для Каждого Стр_shipping_lines Из shipping_lines Цикл
					Если Стр_shipping_lines.Получить("method_id")="mx_local_shipping" Тогда
						Стр_ТЗ_Заказы.ЭтоСамовывоз = Истина;
					КонецЕсли;
				КонецЦикла;
				//--- Дмгг
				
				billing = СтрДанные.Получить("billing");
				Стр_ТЗ_Заказы.phone = billing.Получить("phone");
				Стр_ТЗ_Заказы.email = billing.Получить("email");
				Стр_ТЗ_Заказы.first_name = billing.Получить("first_name");
				Стр_ТЗ_Заказы.last_name = billing.Получить("last_name");
				Стр_ТЗ_Заказы.company =  billing.Получить("company");
				
				Стр_ТЗ_Заказы.Контрагент = WordPress.ПоискКонтрагента(Стр_ТЗ_Заказы.customer_id,Стр_ТЗ_Заказы.personal_number,Стр_ТЗ_Заказы.email,Стр_ТЗ_Заказы.phone);
				
				//+++ Дмгг
				Стр_ТЗ_Заказы.СкладРезерв = ПустойСкладРезерва;
				Если Стр_ТЗ_Заказы.ЭтоСамовывоз И ЗначениеЗаполнено(АдресСклада) Тогда 
					Стр_ТЗ_Заказы.СкладРезерв = WordPress.ПоискСкладаПоАдресу(АдресСклада);
				КонецЕсли;
				//--- Дмгг
				
				// создаём заказ покупателя                                                                                                                                                                                      //+++ Дмгг        //+++ Дмгг  //+++ Дмгг
				СтруктураШапки = Новый Структура("id,order_key,number,date_created,total,total_tax,prices_include_tax,customer_id,customer_note,currency,personal_number,phone,email,first_name,last_name,company,Контрагент,payment_method_title,ЭтоСамовывоз,СкладРезерв");
				ЗаполнитьЗначенияСвойств(СтруктураШапки,Стр_ТЗ_Заказы);
				ЗаказПокупателя = WordPress.СоздатьЗаказПокупателя(СтруктураШапки);
				Стр_ТЗ_Заказы.ЗаказПокупателя = ЗаказПокупателя;
				
				// Адрес доставки
				СтрокаАдресДоставки = "";
				
				shipping = СтрДанные.Получить("shipping");
				
				address_1 = СокрЛП(shipping.Получить("address_1"));
				Если СтрДлина(address_1)>0 Тогда
					СтрокаАдресДоставки = СтрокаАдресДоставки + address_1; 
				КонецЕсли;
				
				address_2 = СокрЛП(shipping.Получить("address_2"));
				Если СтрДлина(address_2)>0 Тогда
					Если СтрДлина(СтрокаАдресДоставки)>0 Тогда
						СтрокаАдресДоставки = СтрокаАдресДоставки + ", ";
					КонецЕсли;
					СтрокаАдресДоставки = СтрокаАдресДоставки + address_2; 
				КонецЕсли;
				
				city = СокрЛП(shipping.Получить("city"));
				Если СтрДлина(city)>0 Тогда
					Если СтрДлина(СтрокаАдресДоставки)>0 Тогда
						СтрокаАдресДоставки = СтрокаАдресДоставки + ", ";
					КонецЕсли;
					СтрокаАдресДоставки = СтрокаАдресДоставки + city; 
				КонецЕсли;
				
				first_name = СокрЛП(shipping.Получить("first_name"));
				Если СтрДлина(first_name)>0 Тогда
					Если СтрДлина(СтрокаАдресДоставки)>0 Тогда
						СтрокаАдресДоставки = СтрокаАдресДоставки + ", ";
					КонецЕсли;
					СтрокаАдресДоставки = СтрокаАдресДоставки + first_name; 
				КонецЕсли;
				
				last_name = СокрЛП(shipping.Получить("last_name"));
				Если СтрДлина(last_name)>0 Тогда
					Если СтрДлина(first_name)>0 Тогда
						СтрокаАдресДоставки = СтрокаАдресДоставки + " ";
					КонецЕсли;
					СтрокаАдресДоставки = СтрокаАдресДоставки + last_name; 
				КонецЕсли;
				
				Если СтрДлина(СтрокаАдресДоставки)>0 Тогда
					WordPress.УстановитьАдресДоставкиВЗаказПокупателя(ЗаказПокупателя, СтрокаАдресДоставки);
				КонецЕсли;
				
				// Проверка или создание контрагента
				Если НЕ ЗначениеЗаполнено(Стр_ТЗ_Заказы.Контрагент) Тогда
					company = СокрЛП(Стр_ТЗ_Заказы.company);
					Если СтрДлина(company)=0 Тогда
						company = СокрЛП(shipping.Получить("company"));
					КонецЕсли;
					
					name = СокрЛП(Стр_ТЗ_Заказы.first_name) + ?(СтрДлина(СокрЛП(Стр_ТЗ_Заказы.first_name))>0," ","") + СокрЛП(Стр_ТЗ_Заказы.last_name);
					Если СтрДлина(name)=0 Тогда
						name = first_name + ?(СтрДлина(first_name)>0," ","") + last_name;
					КонецЕсли;
					
					Стр_ТЗ_Заказы.Контрагент = WordPress.СоздатьИлиНайтиКонтрагента(Стр_ТЗ_Заказы.customer_id,company,name,Стр_ТЗ_Заказы.personal_number,Стр_ТЗ_Заказы.email,Стр_ТЗ_Заказы.phone,СтрокаАдресДоставки,ЗаказПокупателя.НалогообложениеНДС,ЗаказПокупателя.ВалютаДокумента,ЗаказПокупателя);
				КонецЕсли;
				
				// Табличная часть
				ТЧ_Запасы = Новый ТаблицаЗначений();
				ТЧ_Запасы.Колонки.Добавить("стр_id");
				ТЧ_Запасы.Колонки.Добавить("product_id");
				ТЧ_Запасы.Колонки.Добавить("name");
				ТЧ_Запасы.Колонки.Добавить("sku");
				ТЧ_Запасы.Колонки.Добавить("quantity");
				ТЧ_Запасы.Колонки.Добавить("price");
				ТЧ_Запасы.Колонки.Добавить("subtotal");
				ТЧ_Запасы.Колонки.Добавить("стр_total_tax");
				ТЧ_Запасы.Колонки.Добавить("стр_total");
				ТЧ_Запасы.Колонки.Добавить("Номенклатура");
				
				line_items = СтрДанные.Получить("line_items");
				Для каждого Стр_line_items Из line_items Цикл
					
					Стр_ТЧ_Запасы = ТЧ_Запасы.Добавить();
					
					Стр_ТЧ_Запасы.стр_id = Стр_line_items.Получить("id");
					Стр_ТЧ_Запасы.product_id = Стр_line_items.Получить("product_id");
					Стр_ТЧ_Запасы.name = Стр_line_items.Получить("name");
					Стр_ТЧ_Запасы.sku = Стр_line_items.Получить("sku");
					Стр_ТЧ_Запасы.quantity = Стр_line_items.Получить("quantity");
					Стр_ТЧ_Запасы.price = Стр_line_items.Получить("price");
					Стр_ТЧ_Запасы.subtotal = Стр_line_items.Получить("subtotal");
					Стр_ТЧ_Запасы.стр_total_tax = Стр_line_items.Получить("total_tax");
					Стр_ТЧ_Запасы.стр_total = Стр_line_items.Получить("total");
					Стр_ТЧ_Запасы.Номенклатура = WordPress.ПоискТовара(Стр_ТЧ_Запасы.product_id,Стр_ТЧ_Запасы.sku);
					Если НЕ ЗначениеЗаполнено(Стр_ТЧ_Запасы.Номенклатура) Тогда
						Стр_ТЧ_Запасы.Номенклатура = WordPress.ЗагрузитьТоварПо_id(Стр_ТЧ_Запасы.product_id);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Стр_ТЗ_Заказы.ЗаказПокупателя) Тогда
						
						СтруктураСтроки = Новый Структура("Номенклатура,Количество,Цена,Сумма,СуммаНДС,Всего,ДатаОтгрузки",
						Стр_ТЧ_Запасы.Номенклатура,Стр_ТЧ_Запасы.quantity,Стр_ТЧ_Запасы.price,Стр_ТЧ_Запасы.subtotal,Стр_ТЧ_Запасы.стр_total_tax,Стр_ТЧ_Запасы.стр_total,Стр_ТЗ_Заказы.date_created);
						
						ТипНоменклатурыЗапас = НЕОПРЕДЕЛЕНО;
						Если ЗначениеЗаполнено(Стр_ТЧ_Запасы.Номенклатура) Тогда
							ТипНоменклатурыЗапас = (Стр_ТЧ_Запасы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
						КонецЕсли;
						
						WordPress.ДобавитьСтрокуВТЧЗапасыЗаказаПокупателя(ЗаказПокупателя,СтруктураСтроки,ТипНоменклатурыЗапас);
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ЗначениеЗаполнено(Стр_ТЗ_Заказы.ЗаказПокупателя) Тогда
					Если Стр_ТЗ_Заказы.shipping_total>0 Тогда
						
						Если Стр_ТЗ_Заказы.prices_include_tax Тогда
							СуммаДоставкиБезНДС = Стр_ТЗ_Заказы.shipping_total;
						Иначе	
							СуммаДоставкиБезНДС = Стр_ТЗ_Заказы.shipping_total - Стр_ТЗ_Заказы.shipping_tax;
						КонецЕсли;
						
						УслугаДоставки = Константы.WordPress_УслугаДоставки.Получить();
						СтруктураСтроки = Новый Структура("Номенклатура,Количество,Цена,Сумма,СуммаНДС,Всего,ДатаОтгрузки",
						УслугаДоставки,1,СуммаДоставкиБезНДС,СуммаДоставкиБезНДС,Стр_ТЗ_Заказы.shipping_tax,Стр_ТЗ_Заказы.shipping_total,Стр_ТЗ_Заказы.date_created);
						
						ТипНоменклатурыЗапас = НЕОПРЕДЕЛЕНО;
						Если ЗначениеЗаполнено(Стр_ТЧ_Запасы.Номенклатура) Тогда
							ТипНоменклатурыЗапас = (УслугаДоставки.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
						КонецЕсли;
						
						WordPress.ДобавитьСтрокуВТЧЗапасыЗаказаПокупателя(ЗаказПокупателя,СтруктураСтроки,ТипНоменклатурыЗапас);
						
					КонецЕсли;
					
					//Lazare_				
					Рассрочка =Ложь ;				
					Если  Стр_ТЗ_Заказы.payment_method = "tbc_installments_gateway"   Тогда					
						Рассрочка =Истина ;					 
					КонецЕсли;   					
					//_Lazare	
					
					Если WordPress.ЗавершитьРаботуСЗаказом(Стр_ТЗ_Заказы.ЗаказПокупателя,Стр_ТЗ_Заказы.id, Рассрочка) Тогда
						Стр_ТЗ_Заказы.Результат = "Удачно";
						
						Если (Стр_ТЗ_Заказы.payment_method = "cod") ИЛИ (Стр_ТЗ_Заказы.payment_method = "tbc_credit_card_gateway") Тогда
							Стр_ТЗ_Заказы.РасходнаяНакладная = WordPress.СоздатьРасходнуюНакладнуюНаОснованииЗаказаПокупателя(ЗаказПокупателя);
						КонецЕсли;
					Иначе
						Стр_ТЗ_Заказы.Результат = "Неудачно";
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		КоличествоСтраниц = Число(Результат.КоличествоСтраниц);
		//Сообщить(КоличествоСтраниц);
		Если КоличествоСтраниц>1 Тогда
			
			и1=1;
			Пока и1<=КоличествоСтраниц Цикл
				и1 = и1+1;
				
				Результат = WordPress.ПолучитьМассивОбъектов(СтруктураСоединения.Соединение,СтруктураСоединения.Заголовки,СтруктураСоединения.ИмяФайлаОтвета,АдресРесурса,и1);
				Если Результат.КодСостояния = 200 Тогда
					
					Данные = Результат.Данные;
					
					Если Данные.Количество()=0 Тогда
						Прервать;
					КонецЕсли;
					
					Для каждого СтрДанные Из Данные Цикл
						
						АдресСклада = "";//+++ Дмгг
						
						ТекСтатус = СтрДанные.Получить("status");
						Если НЕ ((ТекСтатус = "on-hold") ИЛИ (ТекСтатус = "processing") ИЛИ (ТекСтатус = "pending") ИЛИ (ТекСтатус = "space-bank")) Тогда
							Продолжить;
						КонецЕсли;
						
						Тек_id = СтрДанные.Получить("id");
						Тек_order_key = СтрДанные.Получить("order_key");
						
						ИскатьНеудачные = ИСТИНА;
						ЗаказПокупателя = WordPress.НайтиЗаказПокупателяВРегистре_СопоставлениеЗаказПокупателяWordPress(Тек_id,ИскатьНеудачные);
						Если НЕ ЗначениеЗаполнено(ЗаказПокупателя) Тогда
							
							Стр_ТЗ_Заказы = ТЗ_Заказы.Добавить();
							Стр_ТЗ_Заказы.Результат = "Неудачно"; // На всякий случай
							Стр_ТЗ_Заказы.ЭтоСамовывоз = ЛОЖЬ;//+++ Дмгг
							
							// Шапка
							Стр_ТЗ_Заказы.id = СтрДанные.Получить("id");
							Стр_ТЗ_Заказы.order_key = СтрДанные.Получить("order_key");
							Стр_ТЗ_Заказы.number = СтрДанные.Получить("number");
							Стр_ТЗ_Заказы.date_created = WordPress.ДатаJSON(СтрДанные.Получить("date_created"));
							Стр_ТЗ_Заказы.discount_total = Число(СтрДанные.Получить("discount_total"));
							Стр_ТЗ_Заказы.discount_tax = Число(СтрДанные.Получить("discount_tax"));
							Стр_ТЗ_Заказы.shipping_total = Число(СтрДанные.Получить("shipping_total"));
							Стр_ТЗ_Заказы.shipping_tax = Число(СтрДанные.Получить("shipping_tax"));
							Стр_ТЗ_Заказы.total = Число(СтрДанные.Получить("total"));
							Стр_ТЗ_Заказы.total_tax = Число(СтрДанные.Получить("total_tax"));
							Стр_ТЗ_Заказы.prices_include_tax = СтрДанные.Получить("prices_include_tax");
							Стр_ТЗ_Заказы.customer_id = СтрДанные.Получить("customer_id");
							Стр_ТЗ_Заказы.customer_note = СтрДанные.Получить("customer_note");
							Стр_ТЗ_Заказы.currency = СтрДанные.Получить("currency");
							Стр_ТЗ_Заказы.status = СтрДанные.Получить("status");
							Стр_ТЗ_Заказы.payment_method = СтрДанные.Получить("payment_method");
							Стр_ТЗ_Заказы.payment_method_title = СтрДанные.Получить("payment_method_title"); //+++ Дмгг
							
							meta_data = СтрДанные.Получить("meta_data");
							Для каждого Стр_meta_data Из meta_data Цикл
								Если Стр_meta_data.Получить("key")="_personal_number" Тогда
									Стр_ТЗ_Заказы.personal_number = Стр_meta_data.Получить("value");
								КонецЕсли;
								//+++ Дмгг
								Если Стр_meta_data.Получить("key")="mx_shipping_option" Тогда
									АдресСклада = Стр_meta_data.Получить("value");
								КонецЕсли;
								//--- Дмгг
							КонецЦикла;
							
							//+++ Дмгг
							Стр_ТЗ_Заказы.ЭтоСамовывоз = Ложь;
							shipping_lines = СтрДанные.Получить("shipping_lines");
							Для Каждого Стр_shipping_lines Из shipping_lines Цикл
								Если Стр_shipping_lines.Получить("method_id")="mx_local_shipping" Тогда
									Стр_ТЗ_Заказы.ЭтоСамовывоз = Истина;
								КонецЕсли;
							КонецЦикла;
							//--- Дмгг
							
							billing = СтрДанные.Получить("billing");
							Стр_ТЗ_Заказы.phone = billing.Получить("phone");
							Стр_ТЗ_Заказы.email = billing.Получить("email");
							Стр_ТЗ_Заказы.first_name = billing.Получить("first_name");
							Стр_ТЗ_Заказы.last_name = billing.Получить("last_name");
							Стр_ТЗ_Заказы.company =  billing.Получить("company");
							
							Стр_ТЗ_Заказы.Контрагент = WordPress.ПоискКонтрагента(Стр_ТЗ_Заказы.customer_id,Стр_ТЗ_Заказы.personal_number,Стр_ТЗ_Заказы.email,Стр_ТЗ_Заказы.phone);
							
							//+++ Дмгг
							Стр_ТЗ_Заказы.СкладРезерв = ПустойСкладРезерва;
							Если Стр_ТЗ_Заказы.ЭтоСамовывоз И ЗначениеЗаполнено(АдресСклада) Тогда 
								Стр_ТЗ_Заказы.СкладРезерв = WordPress.ПоискСкладаПоАдресу(АдресСклада);
							КонецЕсли;
							//--- Дмгг
							
							// создаём заказ покупателя                                                                                                                                                                                     //+++ Дмгг         //+++ Дмгг   //+++ Дмгг
							СтруктураШапки = Новый Структура("id,order_key,number,date_created,total,total_tax,prices_include_tax,customer_id,customer_note,currency,personal_number,phone,email,first_name,last_name,company,Контрагент,payment_method_title,ЭтоСамовывоз,СкладРезерв");
							ЗаполнитьЗначенияСвойств(СтруктураШапки,Стр_ТЗ_Заказы);
							ЗаказПокупателя = WordPress.СоздатьЗаказПокупателя(СтруктураШапки);
							Стр_ТЗ_Заказы.ЗаказПокупателя = ЗаказПокупателя;
							
							// Адрес доставки
							СтрокаАдресДоставки = "";
							
							shipping = СтрДанные.Получить("shipping");
							
							address_1 = СокрЛП(shipping.Получить("address_1"));
							Если СтрДлина(address_1)>0 Тогда
								СтрокаАдресДоставки = СтрокаАдресДоставки + address_1; 
							КонецЕсли;
							
							address_2 = СокрЛП(shipping.Получить("address_2"));
							Если СтрДлина(address_2)>0 Тогда
								Если СтрДлина(СтрокаАдресДоставки)>0 Тогда
									СтрокаАдресДоставки = СтрокаАдресДоставки + ", ";
								КонецЕсли;
								СтрокаАдресДоставки = СтрокаАдресДоставки + address_2; 
							КонецЕсли;
							
							city = СокрЛП(shipping.Получить("city"));
							Если СтрДлина(city)>0 Тогда
								Если СтрДлина(СтрокаАдресДоставки)>0 Тогда
									СтрокаАдресДоставки = СтрокаАдресДоставки + ", ";
								КонецЕсли;
								СтрокаАдресДоставки = СтрокаАдресДоставки + city; 
							КонецЕсли;
							
							first_name = СокрЛП(shipping.Получить("first_name"));
							Если СтрДлина(first_name)>0 Тогда
								Если СтрДлина(СтрокаАдресДоставки)>0 Тогда
									СтрокаАдресДоставки = СтрокаАдресДоставки + ", ";
								КонецЕсли;
								СтрокаАдресДоставки = СтрокаАдресДоставки + first_name; 
							КонецЕсли;
							
							last_name = СокрЛП(shipping.Получить("last_name"));
							Если СтрДлина(last_name)>0 Тогда
								Если СтрДлина(first_name)>0 Тогда
									СтрокаАдресДоставки = СтрокаАдресДоставки + " ";
								КонецЕсли;
								СтрокаАдресДоставки = СтрокаАдресДоставки + last_name; 
							КонецЕсли;
							
							Если СтрДлина(СтрокаАдресДоставки)>0 Тогда
								WordPress.УстановитьАдресДоставкиВЗаказПокупателя(ЗаказПокупателя, СтрокаАдресДоставки);
							КонецЕсли;
							
							// Проверка или создание контрагента
							Если НЕ ЗначениеЗаполнено(Стр_ТЗ_Заказы.Контрагент) Тогда
								company = СокрЛП(Стр_ТЗ_Заказы.company);
								Если СтрДлина(company)=0 Тогда
									company = СокрЛП(shipping.Получить("company"));
								КонецЕсли;
								
								name = СокрЛП(Стр_ТЗ_Заказы.first_name) + ?(СтрДлина(СокрЛП(Стр_ТЗ_Заказы.first_name))>0," ","") + СокрЛП(Стр_ТЗ_Заказы.last_name);
								Если СтрДлина(name)=0 Тогда
									name = first_name + ?(СтрДлина(first_name)>0," ","") + last_name;
								КонецЕсли;
								
								Стр_ТЗ_Заказы.Контрагент = WordPress.СоздатьИлиНайтиКонтрагента(Стр_ТЗ_Заказы.customer_id,company,name,Стр_ТЗ_Заказы.personal_number,Стр_ТЗ_Заказы.email,Стр_ТЗ_Заказы.phone,СтрокаАдресДоставки,ЗаказПокупателя.НалогообложениеНДС,ЗаказПокупателя.ВалютаДокумента,ЗаказПокупателя);
							КонецЕсли;
							
							// Табличная часть
							ТЧ_Запасы = Новый ТаблицаЗначений();
							ТЧ_Запасы.Колонки.Добавить("стр_id");
							ТЧ_Запасы.Колонки.Добавить("product_id");
							ТЧ_Запасы.Колонки.Добавить("name");
							ТЧ_Запасы.Колонки.Добавить("sku");
							ТЧ_Запасы.Колонки.Добавить("quantity");
							ТЧ_Запасы.Колонки.Добавить("price");
							ТЧ_Запасы.Колонки.Добавить("subtotal");
							ТЧ_Запасы.Колонки.Добавить("стр_total_tax");
							ТЧ_Запасы.Колонки.Добавить("стр_total");
							ТЧ_Запасы.Колонки.Добавить("Номенклатура");
							
							line_items = СтрДанные.Получить("line_items");
							Для каждого Стр_line_items Из line_items Цикл
								
								Стр_ТЧ_Запасы = ТЧ_Запасы.Добавить();
								
								Стр_ТЧ_Запасы.стр_id = Стр_line_items.Получить("id");
								Стр_ТЧ_Запасы.product_id = Стр_line_items.Получить("product_id");
								Стр_ТЧ_Запасы.name = Стр_line_items.Получить("name");
								Стр_ТЧ_Запасы.sku = Стр_line_items.Получить("sku");
								Стр_ТЧ_Запасы.quantity = Стр_line_items.Получить("quantity");
								Стр_ТЧ_Запасы.price = Стр_line_items.Получить("price");
								Стр_ТЧ_Запасы.subtotal = Стр_line_items.Получить("subtotal");
								Стр_ТЧ_Запасы.стр_total_tax = Стр_line_items.Получить("total_tax");
								Стр_ТЧ_Запасы.стр_total = Стр_line_items.Получить("total");
								Стр_ТЧ_Запасы.Номенклатура = WordPress.ПоискТовара(Стр_ТЧ_Запасы.product_id,Стр_ТЧ_Запасы.sku);
								Если НЕ ЗначениеЗаполнено(Стр_ТЧ_Запасы.Номенклатура) Тогда
									Стр_ТЧ_Запасы.Номенклатура = WordPress.ЗагрузитьТоварПо_id(Стр_ТЧ_Запасы.product_id);
								КонецЕсли;
								
								Если ЗначениеЗаполнено(Стр_ТЗ_Заказы.ЗаказПокупателя) Тогда
									
									СтруктураСтроки = Новый Структура("Номенклатура,Количество,Цена,Сумма,СуммаНДС,Всего,ДатаОтгрузки",
									Стр_ТЧ_Запасы.Номенклатура,Стр_ТЧ_Запасы.quantity,Стр_ТЧ_Запасы.price,Стр_ТЧ_Запасы.subtotal,Стр_ТЧ_Запасы.стр_total_tax,Стр_ТЧ_Запасы.стр_total,Стр_ТЗ_Заказы.date_created);
									
									ТипНоменклатурыЗапас = НЕОПРЕДЕЛЕНО;
									Если ЗначениеЗаполнено(Стр_ТЧ_Запасы.Номенклатура) Тогда
										ТипНоменклатурыЗапас = (Стр_ТЧ_Запасы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
									КонецЕсли;
									
									WordPress.ДобавитьСтрокуВТЧЗапасыЗаказаПокупателя(ЗаказПокупателя,СтруктураСтроки,ТипНоменклатурыЗапас);
									
								КонецЕсли;
								
							КонецЦикла;
							
							Если ЗначениеЗаполнено(Стр_ТЗ_Заказы.ЗаказПокупателя) Тогда
								Если Стр_ТЗ_Заказы.shipping_total>0 Тогда
									
									Если Стр_ТЗ_Заказы.prices_include_tax Тогда
										СуммаДоставкиБезНДС = Стр_ТЗ_Заказы.shipping_total;
									Иначе	
										СуммаДоставкиБезНДС = Стр_ТЗ_Заказы.shipping_total - Стр_ТЗ_Заказы.shipping_tax;
									КонецЕсли;
									
									УслугаДоставки = Константы.WordPress_УслугаДоставки.Получить();
									СтруктураСтроки = Новый Структура("Номенклатура,Количество,Цена,Сумма,СуммаНДС,Всего,ДатаОтгрузки",
									УслугаДоставки,1,СуммаДоставкиБезНДС,СуммаДоставкиБезНДС,Стр_ТЗ_Заказы.shipping_tax,Стр_ТЗ_Заказы.shipping_total,Стр_ТЗ_Заказы.date_created);
									
									ТипНоменклатурыЗапас = НЕОПРЕДЕЛЕНО;
									Если ЗначениеЗаполнено(Стр_ТЧ_Запасы.Номенклатура) Тогда
										ТипНоменклатурыЗапас = (УслугаДоставки.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
									КонецЕсли;
									
									WordPress.ДобавитьСтрокуВТЧЗапасыЗаказаПокупателя(ЗаказПокупателя,СтруктураСтроки,ТипНоменклатурыЗапас);
									
								КонецЕсли;																
								//Lazare_				
								Рассрочка =Ложь ;				
								Если  Стр_ТЗ_Заказы.payment_method = "tbc_installments_gateway"   Тогда					
									Рассрочка =Истина ;					 
								КонецЕсли;   					
								//_Lazare																			
								Если WordPress.ЗавершитьРаботуСЗаказом(Стр_ТЗ_Заказы.ЗаказПокупателя,Стр_ТЗ_Заказы.id,Рассрочка) Тогда
									Стр_ТЗ_Заказы.Результат = "Удачно";
									
									Если (Стр_ТЗ_Заказы.payment_method = "cod") ИЛИ (Стр_ТЗ_Заказы.payment_method = "tbc_credit_card_gateway") Тогда
										Стр_ТЗ_Заказы.РасходнаяНакладная = WordPress.СоздатьРасходнуюНакладнуюНаОснованииЗаказаПокупателя(ЗаказПокупателя);
									КонецЕсли;
								Иначе
									Стр_ТЗ_Заказы.Результат = "Неудачно";
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТЗ_Заказы;
КонецФункции

// Функция - ЗагрузитьЗаказПо_id
// Возвращает структуру результата загрузки одного заказа по его id
// id - целое число
// ЗаказПокупателя - Ссылка на документ ЗаказПокупателя, куда будут загружаться данные.
// Возвращаемое значение:
// ТЗ_Заказы - фиксированнная структура - таблица закаказов товаров.
//
Функция ЗагрузитьЗаказПо_id(id,ЗаказПокупателяСсылка) ЭКСПОРТ
	ПЕРЕМ ДеревоОбъектов;
	
	Стр_ТЗ_Заказы = Новый Структура();
	Стр_ТЗ_Заказы.Вставить("id");
	Стр_ТЗ_Заказы.Вставить("order_key");
	Стр_ТЗ_Заказы.Вставить("date_created");
	Стр_ТЗ_Заказы.Вставить("discount_total");
	Стр_ТЗ_Заказы.Вставить("discount_tax");
	Стр_ТЗ_Заказы.Вставить("shipping_total");
	Стр_ТЗ_Заказы.Вставить("shipping_tax");
	Стр_ТЗ_Заказы.Вставить("total");
	Стр_ТЗ_Заказы.Вставить("total_tax");
	Стр_ТЗ_Заказы.Вставить("prices_include_tax");
	Стр_ТЗ_Заказы.Вставить("customer_id");
	Стр_ТЗ_Заказы.Вставить("customer_note");
	Стр_ТЗ_Заказы.Вставить("currency");
	Стр_ТЗ_Заказы.Вставить("status");
	Стр_ТЗ_Заказы.Вставить("personal_number");
	Стр_ТЗ_Заказы.Вставить("Контрагент");
	Стр_ТЗ_Заказы.Вставить("email");
	Стр_ТЗ_Заказы.Вставить("phone");
	Стр_ТЗ_Заказы.Вставить("first_name");
	Стр_ТЗ_Заказы.Вставить("last_name");
	Стр_ТЗ_Заказы.Вставить("company");
	Стр_ТЗ_Заказы.Вставить("payment_method");
	Стр_ТЗ_Заказы.Вставить("number");
	Стр_ТЗ_Заказы.Вставить("ЗаказПокупателя");
	Стр_ТЗ_Заказы.Вставить("РасходнаяНакладная");
	Стр_ТЗ_Заказы.Вставить("Результат");
	
	Если ЗначениеЗаполнено(id) И ЗначениеЗаполнено(ЗаказПокупателяСсылка) Тогда
			
		Стр_ТЗ_Заказы.id = id;
		Стр_ТЗ_Заказы.ЗаказПокупателя = ЗаказПокупателяСсылка;
		Стр_ТЗ_Заказы.Результат = "Неудачно";
		
		СтруктураСоединения = WordPress.ПолучитьСтруктуруСоединения();
	
		АдресРесурса = "/wp-json/wc/v3/orders/"+Формат(id, "ЧДЦ=0; ЧГ=")+СтруктураСоединения.ПараметрыАутентификации;
		
		Результат = WordPress.ПолучитьМассивОбъектов(СтруктураСоединения.Соединение,СтруктураСоединения.Заголовки,СтруктураСоединения.ИмяФайлаОтвета,АдресРесурса,НЕОПРЕДЕЛЕНО,"POST");
		Если Результат.КодСостояния = 200 Тогда
			
			СтрДанные = Результат.Данные;
			ТекСтатус = СтрДанные.Получить("status");
			Если (ТекСтатус = "on-hold") ИЛИ (ТекСтатус = "processing") ИЛИ (ТекСтатус = "pending") ИЛИ (ТекСтатус = "space-bank") Тогда
				
				// Шапка
				Стр_ТЗ_Заказы.id = СтрДанные.Получить("id");
				Стр_ТЗ_Заказы.order_key = СтрДанные.Получить("order_key");
				Стр_ТЗ_Заказы.number = СтрДанные.Получить("number");
				Стр_ТЗ_Заказы.date_created = WordPress.ДатаJSON(СтрДанные.Получить("date_created"));
				Стр_ТЗ_Заказы.discount_total = Число(СтрДанные.Получить("discount_total"));
				Стр_ТЗ_Заказы.discount_tax = Число(СтрДанные.Получить("discount_tax"));
				Стр_ТЗ_Заказы.shipping_total = Число(СтрДанные.Получить("shipping_total"));
				Стр_ТЗ_Заказы.shipping_tax = Число(СтрДанные.Получить("shipping_tax"));
				Стр_ТЗ_Заказы.total = Число(СтрДанные.Получить("total"));
				Стр_ТЗ_Заказы.total_tax = Число(СтрДанные.Получить("total_tax"));
				Стр_ТЗ_Заказы.prices_include_tax = СтрДанные.Получить("prices_include_tax");
				Стр_ТЗ_Заказы.customer_id = СтрДанные.Получить("customer_id");
				Стр_ТЗ_Заказы.customer_note = СтрДанные.Получить("customer_note");
				Стр_ТЗ_Заказы.currency = СтрДанные.Получить("currency");
				Стр_ТЗ_Заказы.status = СтрДанные.Получить("status");
				Стр_ТЗ_Заказы.payment_method = СтрДанные.Получить("payment_method");
				
				meta_data = СтрДанные.Получить("meta_data");
				Для каждого Стр_meta_data Из meta_data Цикл
					Если Стр_meta_data.Получить("key")="_personal_number" Тогда
						Стр_ТЗ_Заказы.personal_number = Стр_meta_data.Получить("value");
					КонецЕсли;
				КонецЦикла;
				
				billing = СтрДанные.Получить("billing");
				Стр_ТЗ_Заказы.phone = billing.Получить("phone");
				Стр_ТЗ_Заказы.email = billing.Получить("email");
				Стр_ТЗ_Заказы.first_name = billing.Получить("first_name");
				Стр_ТЗ_Заказы.last_name = billing.Получить("last_name");
				Стр_ТЗ_Заказы.company =  billing.Получить("company");
				
				Стр_ТЗ_Заказы.Контрагент = WordPress.ПоискКонтрагента(Стр_ТЗ_Заказы.customer_id,Стр_ТЗ_Заказы.personal_number,Стр_ТЗ_Заказы.email,Стр_ТЗ_Заказы.phone);
				
				// создаём заказ покупателя
				СтруктураШапки = Новый Структура("id,order_key,number,date_created,total,total_tax,prices_include_tax,customer_id,customer_note,currency,personal_number,phone,email,first_name,last_name,company,Контрагент");
				ЗаполнитьЗначенияСвойств(СтруктураШапки,Стр_ТЗ_Заказы);
				ЗаказПокупателя = WordPress.СоздатьЗаказПокупателя(СтруктураШапки,ЗаказПокупателяСсылка);
				Стр_ТЗ_Заказы.ЗаказПокупателя = ЗаказПокупателя;
				
				// Адрес доставки
				СтрокаАдресДоставки = "";
				
				shipping = СтрДанные.Получить("shipping");
				
				address_1 = СокрЛП(shipping.Получить("address_1"));
				Если СтрДлина(address_1)>0 Тогда
					СтрокаАдресДоставки = СтрокаАдресДоставки + address_1; 
				КонецЕсли;
				
				address_2 = СокрЛП(shipping.Получить("address_2"));
				Если СтрДлина(address_2)>0 Тогда
					Если СтрДлина(СтрокаАдресДоставки)>0 Тогда
						СтрокаАдресДоставки = СтрокаАдресДоставки + ", ";
					КонецЕсли;
					СтрокаАдресДоставки = СтрокаАдресДоставки + address_2; 
				КонецЕсли;
				
				city = СокрЛП(shipping.Получить("city"));
				Если СтрДлина(city)>0 Тогда
					Если СтрДлина(СтрокаАдресДоставки)>0 Тогда
						СтрокаАдресДоставки = СтрокаАдресДоставки + ", ";
					КонецЕсли;
					СтрокаАдресДоставки = СтрокаАдресДоставки + city; 
				КонецЕсли;
				
				first_name = СокрЛП(shipping.Получить("first_name"));
				Если СтрДлина(first_name)>0 Тогда
					Если СтрДлина(СтрокаАдресДоставки)>0 Тогда
						СтрокаАдресДоставки = СтрокаАдресДоставки + ", ";
					КонецЕсли;
					СтрокаАдресДоставки = СтрокаАдресДоставки + first_name; 
				КонецЕсли;
				
				last_name = СокрЛП(shipping.Получить("last_name"));
				Если СтрДлина(last_name)>0 Тогда
					Если СтрДлина(first_name)>0 Тогда
						СтрокаАдресДоставки = СтрокаАдресДоставки + " ";
					КонецЕсли;
					СтрокаАдресДоставки = СтрокаАдресДоставки + last_name; 
				КонецЕсли;
				
				Если СтрДлина(СтрокаАдресДоставки)>0 Тогда
					WordPress.УстановитьАдресДоставкиВЗаказПокупателя(ЗаказПокупателя, СтрокаАдресДоставки);
				КонецЕсли;
				
				// Проверка или создание контрагента
				Если НЕ ЗначениеЗаполнено(Стр_ТЗ_Заказы.Контрагент) Тогда
					company = СокрЛП(Стр_ТЗ_Заказы.company);
					Если СтрДлина(company)=0 Тогда
						company = СокрЛП(shipping.Получить("company"));
					КонецЕсли;
					
					name = СокрЛП(Стр_ТЗ_Заказы.first_name) + ?(СтрДлина(СокрЛП(Стр_ТЗ_Заказы.first_name))>0," ","") + СокрЛП(Стр_ТЗ_Заказы.last_name);
					Если СтрДлина(name)=0 Тогда
						name = first_name + ?(СтрДлина(first_name)>0," ","") + last_name;
					КонецЕсли;
					
					Стр_ТЗ_Заказы.Контрагент = WordPress.СоздатьИлиНайтиКонтрагента(Стр_ТЗ_Заказы.customer_id,company,name,Стр_ТЗ_Заказы.personal_number,Стр_ТЗ_Заказы.email,Стр_ТЗ_Заказы.phone,СтрокаАдресДоставки,ЗаказПокупателя.НалогообложениеНДС,ЗаказПокупателя.ВалютаДокумента,ЗаказПокупателя);
				КонецЕсли;
				
				// Табличная часть
				ТЧ_Запасы = Новый ТаблицаЗначений();
				ТЧ_Запасы.Колонки.Добавить("стр_id");
				ТЧ_Запасы.Колонки.Добавить("product_id");
				ТЧ_Запасы.Колонки.Добавить("name");
				ТЧ_Запасы.Колонки.Добавить("sku");
				ТЧ_Запасы.Колонки.Добавить("quantity");
				ТЧ_Запасы.Колонки.Добавить("price");
				ТЧ_Запасы.Колонки.Добавить("subtotal");
				ТЧ_Запасы.Колонки.Добавить("стр_total_tax");
				ТЧ_Запасы.Колонки.Добавить("стр_total");
				ТЧ_Запасы.Колонки.Добавить("Номенклатура");
				
				line_items = СтрДанные.Получить("line_items");
				Для каждого Стр_line_items Из line_items Цикл
					
					Стр_ТЧ_Запасы = ТЧ_Запасы.Добавить();
					
					Стр_ТЧ_Запасы.стр_id = Стр_line_items.Получить("id");
					Стр_ТЧ_Запасы.product_id = Стр_line_items.Получить("product_id");
					Стр_ТЧ_Запасы.name = Стр_line_items.Получить("name");
					Стр_ТЧ_Запасы.sku = Стр_line_items.Получить("sku");
					Стр_ТЧ_Запасы.quantity = Стр_line_items.Получить("quantity");
					Стр_ТЧ_Запасы.price = Стр_line_items.Получить("price");
					Стр_ТЧ_Запасы.subtotal = Стр_line_items.Получить("subtotal");
					Стр_ТЧ_Запасы.стр_total_tax = Стр_line_items.Получить("total_tax");
					Стр_ТЧ_Запасы.стр_total = Стр_line_items.Получить("total");
					Стр_ТЧ_Запасы.Номенклатура = WordPress.ПоискТовара(Стр_ТЧ_Запасы.product_id,Стр_ТЧ_Запасы.sku);
					Если НЕ ЗначениеЗаполнено(Стр_ТЧ_Запасы.Номенклатура) Тогда
						Стр_ТЧ_Запасы.Номенклатура = WordPress.ЗагрузитьТоварПо_id(Стр_ТЧ_Запасы.product_id);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Стр_ТЗ_Заказы.ЗаказПокупателя) Тогда
						
						СтруктураСтроки = Новый Структура("Номенклатура,Количество,Цена,Сумма,СуммаНДС,Всего,ДатаОтгрузки",
						Стр_ТЧ_Запасы.Номенклатура,Стр_ТЧ_Запасы.quantity,Стр_ТЧ_Запасы.price,Стр_ТЧ_Запасы.subtotal,Стр_ТЧ_Запасы.стр_total_tax,Стр_ТЧ_Запасы.стр_total,Стр_ТЗ_Заказы.date_created);
						
						ТипНоменклатурыЗапас = НЕОПРЕДЕЛЕНО;
						Если ЗначениеЗаполнено(Стр_ТЧ_Запасы.Номенклатура) Тогда
							ТипНоменклатурыЗапас = (Стр_ТЧ_Запасы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
						КонецЕсли;
						
						WordPress.ДобавитьСтрокуВТЧЗапасыЗаказаПокупателя(ЗаказПокупателя,СтруктураСтроки,ТипНоменклатурыЗапас);
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ЗначениеЗаполнено(Стр_ТЗ_Заказы.ЗаказПокупателя) Тогда
					Если Стр_ТЗ_Заказы.shipping_total>0 Тогда
						
						Если Стр_ТЗ_Заказы.prices_include_tax Тогда
							СуммаДоставкиБезНДС = Стр_ТЗ_Заказы.shipping_total;
						Иначе	
							СуммаДоставкиБезНДС = Стр_ТЗ_Заказы.shipping_total - Стр_ТЗ_Заказы.shipping_tax;
						КонецЕсли;
						
						УслугаДоставки = Константы.WordPress_УслугаДоставки.Получить();
						СтруктураСтроки = Новый Структура("Номенклатура,Количество,Цена,Сумма,СуммаНДС,Всего,ДатаОтгрузки",
						УслугаДоставки,1,СуммаДоставкиБезНДС,СуммаДоставкиБезНДС,Стр_ТЗ_Заказы.shipping_tax,Стр_ТЗ_Заказы.shipping_total,Стр_ТЗ_Заказы.date_created);
						
						ТипНоменклатурыЗапас = НЕОПРЕДЕЛЕНО;
						Если ЗначениеЗаполнено(Стр_ТЧ_Запасы.Номенклатура) Тогда
							ТипНоменклатурыЗапас = (УслугаДоставки.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
						КонецЕсли;
						
						WordPress.ДобавитьСтрокуВТЧЗапасыЗаказаПокупателя(ЗаказПокупателя,СтруктураСтроки,ТипНоменклатурыЗапас);
						
					КонецЕсли;
					
					Если WordPress.ЗавершитьРаботуСЗаказом(Стр_ТЗ_Заказы.ЗаказПокупателя,Стр_ТЗ_Заказы.id) Тогда
						Стр_ТЗ_Заказы.Результат = "Удачно";
						
						Если (Стр_ТЗ_Заказы.payment_method = "cod") ИЛИ (Стр_ТЗ_Заказы.payment_method = "tbc_credit_card_gateway") Тогда
							Стр_ТЗ_Заказы.РасходнаяНакладная = WordPress.СоздатьРасходнуюНакладнуюНаОснованииЗаказаПокупателя(ЗаказПокупателя);
						КонецЕсли;
					Иначе
						Стр_ТЗ_Заказы.Результат = "Неудачно";
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(Стр_ТЗ_Заказы);
КонецФункции

// Функция - Загрузить контрагентов
// Возвращает сформированную таблицу контрагентов. Передавать данные может только на сервере.
// Возвращаемое значение:
// ТЗ_Контрагенты - таблица значений - таблица контрагентов.
//
Функция ЗагрузитьКонтрагентов() ЭКСПОРТ
	ПЕРЕМ ДеревоОбъектов;
	
	ТЗ_Контрагенты = Новый ТаблицаЗначений();
	ТЗ_Контрагенты.Колонки.Добавить("id");
	ТЗ_Контрагенты.Колонки.Добавить("first_name");
	ТЗ_Контрагенты.Колонки.Добавить("last_name");
	ТЗ_Контрагенты.Колонки.Добавить("Контрагент");
	ТЗ_Контрагенты.Колонки.Добавить("personal_number");
	ТЗ_Контрагенты.Колонки.Добавить("email");
	ТЗ_Контрагенты.Колонки.Добавить("phone");
	
	СтруктураСоединения = WordPress.ПолучитьСтруктуруСоединения();
	
	АдресРесурса = "/wp-json/wc/v3/customers"+СтруктураСоединения.ПараметрыАутентификации;
	
	Результат = WordPress.ПолучитьМассивОбъектов(СтруктураСоединения.Соединение,СтруктураСоединения.Заголовки,СтруктураСоединения.ИмяФайлаОтвета,АдресРесурса,1);
	Если Результат.КодСостояния = 200 Тогда
		
		Данные = Результат.Данные;
		Для каждого СтрДанные Из Данные Цикл
			
			Стр_ТЗ_Контрагенты = ТЗ_Контрагенты.Добавить();
			
			Стр_ТЗ_Контрагенты.id = СтрДанные.Получить("id");
			Стр_ТЗ_Контрагенты.first_name = СтрДанные.Получить("first_name");
			Стр_ТЗ_Контрагенты.last_name = СтрДанные.Получить("last_name");
			Стр_ТЗ_Контрагенты.email = СтрДанные.Получить("email");
			
			meta_data = СтрДанные.Получить("meta_data");
			Для каждого Стр_meta_data Из meta_data Цикл
				Если Стр_meta_data.Получить("key")="_personal_number" Тогда
					Стр_ТЗ_Контрагенты.personal_number = Стр_meta_data.Получить("value");					
				КонецЕсли;
			КонецЦикла;
			
			billing = СтрДанные.Получить("billing");
			Стр_ТЗ_Контрагенты.phone = billing.Получить("phone");
			Если НЕ ЗначениеЗаполнено(Стр_ТЗ_Контрагенты.email) Тогда
				Стр_ТЗ_Контрагенты.email = billing.Получить("email");
			КонецЕсли; 
			
			Стр_ТЗ_Контрагенты.Контрагент = WordPress.ПоискКонтрагента(Стр_ТЗ_Контрагенты.id,Стр_ТЗ_Контрагенты.personal_number,Стр_ТЗ_Контрагенты.email,Стр_ТЗ_Контрагенты.phone);
			
		КонецЦикла;
		
		КоличествоСтраниц = Число(Результат.КоличествоСтраниц);
		Если КоличествоСтраниц>1 Тогда
			
			и1=1;
			Пока и1<=КоличествоСтраниц Цикл
				и1 = и1+1;
				
				Результат = WordPress.ПолучитьМассивОбъектов(СтруктураСоединения.Соединение,СтруктураСоединения.Заголовки,СтруктураСоединения.ИмяФайлаОтвета,АдресРесурса,и1);
				Если Результат.КодСостояния = 200 Тогда
					
					Данные = Результат.Данные;
					
					Если Данные.Количество()=0 Тогда
						Прервать;
					КонецЕсли;
					
					Для каждого СтрДанные Из Данные Цикл
						
						Стр_ТЗ_Контрагенты = ТЗ_Контрагенты.Добавить();
						
						Стр_ТЗ_Контрагенты.id = СтрДанные.Получить("id");
						Стр_ТЗ_Контрагенты.first_name = СтрДанные.Получить("first_name");
						Стр_ТЗ_Контрагенты.last_name = СтрДанные.Получить("last_name");
						Стр_ТЗ_Контрагенты.email = СтрДанные.Получить("email");
						
						meta_data = СтрДанные.Получить("meta_data");
						Для каждого Стр_meta_data Из meta_data Цикл
							Если Стр_meta_data.Получить("key")="_personal_number" Тогда
								Стр_ТЗ_Контрагенты.personal_number = Стр_meta_data.Получить("value");					
							КонецЕсли;
						КонецЦикла;
						
						billing = СтрДанные.Получить("billing");
						Стр_ТЗ_Контрагенты.phone = billing.Получить("phone");
						Если НЕ ЗначениеЗаполнено(Стр_ТЗ_Контрагенты.email) Тогда
							Стр_ТЗ_Контрагенты.email = billing.Получить("email");
						КонецЕсли; 
						
						Стр_ТЗ_Контрагенты.Контрагент = WordPress.ПоискКонтрагента(Стр_ТЗ_Контрагенты.id,Стр_ТЗ_Контрагенты.personal_number,Стр_ТЗ_Контрагенты.email,Стр_ТЗ_Контрагенты.phone);
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТЗ_Контрагенты;
КонецФункции

Функция ЗагрузитьТовары() ЭКСПОРТ
	ПЕРЕМ ДеревоОбъектов;
	
	ТЗ_Товары = Новый ТаблицаЗНачений();
	ТЗ_Товары.Колонки.Добавить("id");
	ТЗ_Товары.Колонки.Добавить("name");
	ТЗ_Товары.Колонки.Добавить("slug");
	ТЗ_Товары.Колонки.Добавить("type");
	ТЗ_Товары.Колонки.Добавить("status");
	ТЗ_Товары.Колонки.Добавить("catalog_visibility");
	ТЗ_Товары.Колонки.Добавить("description");
	ТЗ_Товары.Колонки.Добавить("sku");
	ТЗ_Товары.Колонки.Добавить("price");
	ТЗ_Товары.Колонки.Добавить("tax_status");
	ТЗ_Товары.Колонки.Добавить("stock_quantity");
	ТЗ_Товары.Колонки.Добавить("stock_status");
	ТЗ_Товары.Колонки.Добавить("lang");
	ТЗ_Товары.Колонки.Добавить("Номенклатура");
	
	СтруктураСоединения = WordPress.ПолучитьСтруктуруСоединения();
	
	АдресРесурса = "/wp-json/wc/v3/products"+СтруктураСоединения.ПараметрыАутентификации+"&lang=all";
	
	Результат = WordPress.ПолучитьМассивОбъектов(СтруктураСоединения.Соединение,СтруктураСоединения.Заголовки,СтруктураСоединения.ИмяФайлаОтвета,АдресРесурса,1);
	Если Результат.КодСостояния = 200 Тогда
		
		Данные = Результат.Данные;
		Для каждого СтрДанные Из Данные Цикл
			
			Стр_ТЗ_Товары = ТЗ_Товары.Добавить();
			
			Стр_ТЗ_Товары.id = СтрДанные.Получить("id");
			Стр_ТЗ_Товары.name = СтрДанные.Получить("name");
			Стр_ТЗ_Товары.slug = СтрДанные.Получить("slug");
			Стр_ТЗ_Товары.type = СтрДанные.Получить("type");
			Стр_ТЗ_Товары.status = СтрДанные.Получить("status");
			Стр_ТЗ_Товары.catalog_visibility = СтрДанные.Получить("catalog_visibility");
			Стр_ТЗ_Товары.description = СтрДанные.Получить("description");
			Стр_ТЗ_Товары.sku = СтрДанные.Получить("sku");
			Стр_ТЗ_Товары.price = СтрДанные.Получить("price");
			Стр_ТЗ_Товары.tax_status = СтрДанные.Получить("tax_status");
			Стр_ТЗ_Товары.stock_quantity = СтрДанные.Получить("stock_quantity");
			Стр_ТЗ_Товары.stock_status = СтрДанные.Получить("stock_status");
			Стр_ТЗ_Товары.lang = СтрДанные.Получить("lang");
			Стр_ТЗ_Товары.Номенклатура = WordPress.НайтиТоварВРегистре_СопоставлениеНоменклатурыWordPress(Стр_ТЗ_Товары.id);
		КонецЦикла;
		
		КоличествоСтраниц = Число(Результат.КоличествоСтраниц);
		Если КоличествоСтраниц>1 Тогда
			
			и1=1;
			Пока и1<=КоличествоСтраниц Цикл
				и1 = и1+1;
				
				Результат = WordPress.ПолучитьМассивОбъектов(СтруктураСоединения.Соединение,СтруктураСоединения.Заголовки,СтруктураСоединения.ИмяФайлаОтвета,АдресРесурса,и1);
				Если Результат.КодСостояния = 200 Тогда
					
					Данные = Результат.Данные;
					
					Если Данные.Количество()=0 Тогда
						Прервать;
					КонецЕсли;
					
					Для каждого СтрДанные Из Данные Цикл
						
						Стр_ТЗ_Товары = ТЗ_Товары.Добавить();
						
						Стр_ТЗ_Товары.id = СтрДанные.Получить("id");
						Стр_ТЗ_Товары.name = СтрДанные.Получить("name");
						Стр_ТЗ_Товары.slug = СтрДанные.Получить("slug");
						Стр_ТЗ_Товары.type = СтрДанные.Получить("type");
						Стр_ТЗ_Товары.status = СтрДанные.Получить("status");
						Стр_ТЗ_Товары.catalog_visibility = СтрДанные.Получить("catalog_visibility");
						Стр_ТЗ_Товары.description = СтрДанные.Получить("description");
						Стр_ТЗ_Товары.sku = СтрДанные.Получить("sku");
						Стр_ТЗ_Товары.price = СтрДанные.Получить("price");
						Стр_ТЗ_Товары.tax_status = СтрДанные.Получить("tax_status");
						Стр_ТЗ_Товары.stock_quantity = СтрДанные.Получить("stock_quantity");
						Стр_ТЗ_Товары.stock_status = СтрДанные.Получить("stock_status");
						Стр_ТЗ_Товары.lang = СтрДанные.Получить("lang");
						Стр_ТЗ_Товары.Номенклатура = WordPress.НайтиТоварВРегистре_СопоставлениеНоменклатурыWordPress(Стр_ТЗ_Товары.id);
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТЗ_Товары;
КонецФункции

Функция ЗагрузитьТоварПо_id(id) ЭКСПОРТ
	ПЕРЕМ РЕЗ, ДеревоОбъектов;
	
	// Попытаемся получить данные товара по id
	Стр_ТЗ_Товары = Новый Структура();
	Стр_ТЗ_Товары.Вставить("id");
	Стр_ТЗ_Товары.Вставить("name");
	Стр_ТЗ_Товары.Вставить("slug");
	Стр_ТЗ_Товары.Вставить("type");
	Стр_ТЗ_Товары.Вставить("status");
	Стр_ТЗ_Товары.Вставить("catalog_visibility");
	Стр_ТЗ_Товары.Вставить("description");
	Стр_ТЗ_Товары.Вставить("sku");
	Стр_ТЗ_Товары.Вставить("price");
	Стр_ТЗ_Товары.Вставить("tax_status");
	Стр_ТЗ_Товары.Вставить("stock_quantity");
	Стр_ТЗ_Товары.Вставить("stock_status");
	Стр_ТЗ_Товары.Вставить("lang");
	Стр_ТЗ_Товары.Вставить("Номенклатура");
	
	СтруктураСоединения = WordPress.ПолучитьСтруктуруСоединения();
	
	АдресРесурса = "/wp-json/wc/v3/products/"+Формат(id, "ЧДЦ=0; ЧГ=")+СтруктураСоединения.ПараметрыАутентификации;
	
	Результат = WordPress.ПолучитьМассивОбъектов(СтруктураСоединения.Соединение,СтруктураСоединения.Заголовки,СтруктураСоединения.ИмяФайлаОтвета,АдресРесурса,НЕОПРЕДЕЛЕНО,"POST");
	Если Результат.КодСостояния = 200 Тогда
		
		СтрДанные = Результат.Данные;
		
		Стр_ТЗ_Товары.id = СтрДанные.Получить("id");
		Стр_ТЗ_Товары.name = СтрДанные.Получить("name");
		Стр_ТЗ_Товары.slug = СтрДанные.Получить("slug");
		Стр_ТЗ_Товары.type = СтрДанные.Получить("type");
		Стр_ТЗ_Товары.status = СтрДанные.Получить("status");
		Стр_ТЗ_Товары.catalog_visibility = СтрДанные.Получить("catalog_visibility");
		Стр_ТЗ_Товары.description = СтрДанные.Получить("description");
		Стр_ТЗ_Товары.sku = СтрДанные.Получить("sku");
		Стр_ТЗ_Товары.price = СтрДанные.Получить("price");
		Стр_ТЗ_Товары.tax_status = СтрДанные.Получить("tax_status");
		Стр_ТЗ_Товары.stock_quantity = СтрДанные.Получить("stock_quantity");
		Стр_ТЗ_Товары.stock_status = СтрДанные.Получить("stock_status");
		Стр_ТЗ_Товары.lang = СтрДанные.Получить("lang");
		
		Если СтрДлина(СокрЛП(Стр_ТЗ_Товары.sku))>0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Номенклатура.Ссылка КАК Номенклатура
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			//|	(ВЫРАЗИТЬ(Номенклатура.Артикул КАК СТРОКА(25))) = (ВЫРАЗИТЬ(&sku КАК СТРОКА(25)))";
			|	Номенклатура.Артикул = &sku";
			
			Запрос.УстановитьПараметр("sku", СокрЛП(Стр_ТЗ_Товары.sku));
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Стр_ТЗ_Товары.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			КонецЦикла;	
			
			Если ЗначениеЗаполнено(Стр_ТЗ_Товары.Номенклатура) Тогда
				// Запишем в регистр соответствия
				НаборЗаписей = РегистрыСведений.СопоставлениеНоменклатурыWordPress.СоздатьНаборЗаписей(); 
				
				НаборЗаписей.Отбор.id.Установить(Стр_ТЗ_Товары.id); 
				
				НоваяЗапись = НаборЗаписей.Добавить(); 
				НоваяЗапись.Номенклатура = Стр_ТЗ_Товары.Номенклатура; 
				НоваяЗапись.id = Стр_ТЗ_Товары.id; 
				
				НаборЗаписей.Записать(ИСТИНА);
							
			КонецЕсли;
			
		КонецЕсли;
						
	КонецЕсли;
	
	РЕЗ = Стр_ТЗ_Товары.Номенклатура;
	
	Возврат РЕЗ;
КонецФункции

Процедура РегламентноеЗадание_WordPress_Загрузка_Заказов() Экспорт
	ЗагрузитьЗаказы(НачалоДня(ТекущаяДатаСеанса()),КонецДня(ТекущаяДатаСеанса()));
КонецПроцедуры

Процедура РегламентноеЗадание_WordPress_Выгрузка_Остатков() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаРезервы
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя
		|				И НЕ ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЗапасыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.КоличествоОстаток КАК Остаток,
		|	0 КАК Резерв
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиИРезервы
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЗапасыОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Резервы.Номенклатура,
		|	0,
		|	Резервы.КоличествоОстаток
		|ИЗ
		|	ВременнаяТаблицаРезервы КАК Резервы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.Номенклатура,
		|	ЕСТЬNULL(СУММА(Остатки.Остаток), 0) - ЕСТЬNULL(СУММА(Остатки.Резерв), 0) КАК СвободныйОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиРезервы
		|ИЗ
		|	ВременнаяТаблицаОстаткиИРезервы КАК Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	ЕСТЬNULL(СУММА(Остатки.Остаток), 0) - ЕСТЬNULL(СУММА(Остатки.Резерв), 0) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СопоставлениеНоменклатурыWordPress.id,
		|	СопоставлениеНоменклатурыWordPress.Номенклатура,
		|	ЕСТЬNULL(Остатки.СвободныйОстаток, 0) КАК СвободныйОстаток
		|ИЗ
		|	РегистрСведений.СопоставлениеНоменклатурыWordPress КАК СопоставлениеНоменклатурыWordPress
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиРезервы КАК Остатки
		|		ПО СопоставлениеНоменклатурыWordPress.Номенклатура = Остатки.Номенклатура";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",Константы.WordPress_Склад.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураСоединения = WordPress.ПолучитьСтруктуруСоединения();
		
		АдресРесурса = "/wp-json/wc/v3/products/"+Формат(ВыборкаДетальныеЗаписи.id, "ЧДЦ=0; ЧГ=")+СтруктураСоединения.ПараметрыАутентификации;
		
		Запрос = Новый HTTPЗапрос();
		Запрос.АдресРесурса = АдресРесурса;
		Запрос.Заголовки = СтруктураСоединения.Заголовки;
		
		СтруктураЗапроса = Новый Структура("stock_quantity,stock_status,manage_stock");
		СтруктураЗапроса.stock_quantity = ВыборкаДетальныеЗаписи.СвободныйОстаток;
		СтруктураЗапроса.manage_stock = ИСТИНА;
		Если ВыборкаДетальныеЗаписи.СвободныйОстаток>0 Тогда
			СтруктураЗапроса.stock_status="instock";
		Иначе
			СтруктураЗапроса.stock_status="outofstock";
		КонецЕсли;
		
		ТелоЗапроса = Новый ЗаписьJSON();
		ТелоЗапроса.УстановитьСтроку();
		ЗаписатьJSON(ТелоЗапроса, СтруктураЗапроса);
		ТелоЗапроса = ТелоЗапроса.Закрыть();
		
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса,КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
		Результат = СтруктураСоединения.Соединение.ВызватьHTTPМетод("POST", Запрос);
		
		Если НЕ Результат.КодСостояния = 200 Тогда
			Сообщить("Не удалось выгрузить на сайт остаток для товара " + ВыборкаДетальныеЗаписи.Номенклатура + " с id=" + ВыборкаДетальныеЗаписи.id);			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
