
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ТелоСообщения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ТелоСообщения").Получить();
	
	Если ТипЗнч(ТелоСообщения) = Тип("Строка") Тогда
		
		ТелоСообщенияПредставление = ТелоСообщения;
		
	Иначе
		
		Попытка
			ТелоСообщенияПредставление = ОбщегоНазначения.ЗначениеВСтрокуXML(ТелоСообщения);
		Исключение
			ТелоСообщенияПредставление = НСтр("ka='შეტყობინების გარსი არ შეიძLება წარმოდგენილი იყოს სტრიქონით.';ru='Тело сообщения не может быть представлено строкой.';en='The message body can not be represented by the string.'");
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

#КонецОбласти
