#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем ИспользоватьТолькоРегламентированногоПланаСчетов Экспорт; //+++ Дмгг
#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Расходы.Итог("Сумма");
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
		
		Для каждого СтрокаРасходы из Расходы Цикл
			
			//+++ Дмгг
			Если (СтрокаРасходы.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы И НЕ ИспользоватьТолькоРегламентированногоПланаСчетов) //+++ Дмгг
				ИЛИ (СтрокаРасходы.СчетЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы И ИспользоватьТолькоРегламентированногоПланаСчетов) Тогда
				
				СтрокаРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения,, "АналитикаПрочихДоходовИРасходов");
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.ПрочиеРасходы.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	// Щербаков ---
	// Прочие расчеты
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПрочимиКонтрагентами(ДополнительныеСвойства, Движения, Отказ);

	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата); //+++ Дмгг
	
	Если УчетПрочихРасчетов Тогда
		
		//+++ Дмгг
		Если ИспользоватьТолькоРегламентированногоПланаСчетов Тогда 
			Если КорреспонденцияРегл.ТипСчета <> Перечисления.ТипыСчетов.Дебиторы 
				И КорреспонденцияРегл.ТипСчета <> Перечисления.ТипыСчетов.Кредиторы Тогда
				
				УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Контрагент");
				УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");	
				
			КонецЕсли;
		Иначе
			Если Корреспонденция.ТипСчета <> Перечисления.ТипыСчетов.Дебиторы 
				И Корреспонденция.ТипСчета <> Перечисления.ТипыСчетов.Кредиторы Тогда
				
				УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Контрагент");
				УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");	
				
			КонецЕсли;
		КонецЕсли;
		//--- Дмгг
		
		Для Каждого ТекущаяСтрокаРасходы Из Расходы Цикл
			//+++ Дмгг
			//Если ТекущаяСтрокаРасходы.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Дебиторы 
			//	ИЛИ ТекущаяСтрокаРасходы.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Кредиторы Тогда
			Если ((ТекущаяСтрокаРасходы.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Дебиторы 
				ИЛИ ТекущаяСтрокаРасходы.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Кредиторы) И НЕ ИспользоватьТолькоРегламентированногоПланаСчетов)
				ИЛИ 
				((ТекущаяСтрокаРасходы.СчетЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.Дебиторы 
				ИЛИ ТекущаяСтрокаРасходы.СчетЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.Кредиторы) И ИспользоватьТолькоРегламентированногоПланаСчетов) Тогда

				
				Если ТекущаяСтрокаРасходы.Контрагент.Пустая() Тогда
					ТекстСообщения = НСтр("ka='სია ""ხარჯები""-ს სტრიქონ %НомерСтроки%-ში მიუთითეთ კონტრაგენტი.';ru='Укажите контрагента в строке %НомерСтроки% списка ""Расходы"".';en='Specify the counterparty on line% NomerStroki% list ""Expenses"".'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", ТекущаяСтрокаРасходы.НомерСтроки);
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
						ЭтотОбъект,
						ТекстСообщения,
						"Расходы",
						ТекущаяСтрокаРасходы.НомерСтроки,
						"Контрагент",
						Отказ
					);
				ИначеЕсли ТекущаяСтрокаРасходы.Контрагент.ВестиРасчетыПоДоговорам И ТекущаяСтрокаРасходы.Договор.Пустая() Тогда
					ТекстСообщения = НСтр("ka='სია ""ხარჯები""-ს სტრიქონ %НомерСтроки%-ში მიუთითეთ ხელშეკრულება.';ru='Укажите договор в строке %НомерСтроки% списка ""Расходы"".';en='Specify in the contract line% NomerStroki% list ""Expenses"".'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", ТекущаяСтрокаРасходы.НомерСтроки);
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
						ЭтотОбъект,
						ТекстСообщения,
						"Расходы",
						ТекущаяСтрокаРасходы.НомерСтроки,
						"Договор",
						Отказ
					);
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Контрагент");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");
	КонецЕсли;
	
	//+++ Дмгг
	Если ИспользоватьТолькоРегламентированногоПланаСчетов Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Корреспонденция");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Расходы.СчетЗатрат");
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры

#КонецОбласти
ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата())); //+++ Дмгг
#КонецЕсли