
// Реализация стандартного интерфейса для подключаемых обработок и отчетов

// Инициализация при загрузке в ИБ
Функция СведенияОВнешнейОбработке() Экспорт

	НаименованиеОбработки = НСтр("ru='Загрузка курсов валют (Грузия)';ka='ვალუტის კურსების ჩატვირთვა (საქართველო)'");
	НаименованиеОбработкиФорма = НСтр("ru='Загрузка курсов валют (Открытие формы)';ka='ვალუტის კურსების ჩატვირთვა (ფორმის გახსნა)'");
	НаименованиеОбработкиЗадание = НСтр("ru='Загрузка курсов валют (загрузка на сервере)';ka='ვალუტის კურსების ჩატვირთვა (სერვერზე ჩატვირთვა)'");

	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", НаименованиеОбработки);
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Версия", "1.0.6");
	РегистрационныеДанные.Вставить("ВерсияБСП", "1.2.1.4");
	//ДополнительнаяОбработка
	//ДополнительныйОтчет
	//ЗаполнениеОбъекта
	//Отчет
	//ПечатанаяФорма
	//СозданиеСвязанныхОбъектов
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	
	РегистрационныеДанные.Вставить("Информация", "Загрузка курсов валют 8.2.* (Грузия) LLC Optimus ©");
	
	///////////// команды /////////////////////////
	тзКоманд = Новый ТаблицаЗначений;
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");
	
	строкаКоманды = тзКоманд.Добавить();
	строкаКоманды.Идентификатор = "1";
	строкаКоманды.Представление = НаименованиеОбработкиФорма;
	строкаКоманды.ПоказыватьОповещение = Истина;
	строкаКоманды.Использование = "ОткрытиеФормы";
	
	строкаКоманды = тзКоманд.Добавить();
	строкаКоманды.Идентификатор = "2";
	строкаКоманды.Представление = НаименованиеОбработкиЗадание;
	строкаКоманды.ПоказыватьОповещение = Истина;
	строкаКоманды.Использование = "ВызовСерверногоМетода";

	
	РегистрационныеДанные.Вставить("Команды", тзКоманд);
		
	Возврат РегистрационныеДанные;
КонецФункции

// Обработка команд экспортированных обработкой
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	// Реализация логики команды
	Если ИдентификаторКоманды = "2" Тогда
		ЗагрузитьКурсыВалют();
	КонецЕсли;
КонецПроцедуры

// Серверные методы для загрузки курсов

//Загрузка данных о курсах с сайта
//Функция ЗагрузитьКурсыВалют(ПутьКRSS = "http://www.nbg.gov.ge/rss.php", РежимВыводаСообщений = Ложь) Экспорт 

Функция ФункцияВосстановления(Свойство, Значение, ДополнительныеПараметры) Экспорт
	Если Свойство = "ДатаJSON"Тогда
		Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
	КонецЕсли;
	Если Свойство = "СтрокаJSON" Тогда
		Возврат СокрЛП(Значение);
	КонецЕсли;
	Если Свойство = "uidJSON" Тогда
		Возврат Новый УникальныйИдентификатор(Значение);
	КонецЕсли;
КонецФункции

Функция ЗагрузитьКурсыВалют(ПутьКRSS = "https://nbg.gov.ge/gw/api/ct/monetarypolicy/currencies/ka/json", РежимВыводаСообщений = Ложь) Экспорт
	
	тЧтение = Новый ЧтениеJSON;
	тЧтение.ОткрытьФайл(ПутьКRSS);
 	тДанные = ПрочитатьJSON(тЧтение, Ложь, , , "ФункцияВосстановления", ЭтотОбъект);
 	тЧтение.Закрыть();
	
	ТекущаяДата = ТекущаяДата();
	ДатаИзДанных = Неопределено;
	Для Каждого ЭлемМасс Из тДанные Цикл 
		
		Если ЭлемМасс.Свойство("date") Тогда
			ДатаИзДанных = Дата(СтрЗаменить(Лев(ЭлемМасс.date, 10), "-", ""));
		КонецЕсли;
		
		Если ЭлемМасс.Свойство("currencies") Тогда
			Для Каждого ЭлемКурсы Из ЭлемМасс.currencies Цикл
				КодВалюты = ЭлемКурсы.code;
				КурсВалюты = ЭлемКурсы.rate;
				КратностьВалюты = ЭлемКурсы.quantity;
				Результат = ДобавитьКурсДляВалюты(ТекущаяДата, КодВалюты, КурсВалюты, КратностьВалюты);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДатаИзДанных; 
	
КонецФункции

Функция ЗагрузитьКурсыВалют2(ПутьКRSS = "https://nbg.gov.ge/monetary-policy/currency", РежимВыводаСообщений = Ложь) Экспорт
	
	//Паганини_
	Р_Д_Ч = Сред(Строка(1/2), 2, 1);
	//_Паганини
	ДатаИзДанных = Неопределено;
	ТекущаяДата = ТекущаяДата();
	XML_Документ = Новый ЧтениеXML();
	XML_Документ.ОткрытьФайл(ПутьКRSS);
	Пока XML_Документ.Прочитать() Цикл
		Если XML_Документ.Имя = "item" И XML_Документ.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Пока XML_Документ.Прочитать() Цикл
				Если XML_Документ.Имя = "title" И XML_Документ.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					XML_Документ.Прочитать(); // Проситаем содержимое
					ДатаИзДанных = Дата(СтрЗаменить(Прав(XML_Документ.Значение, 10), "-", "")); // с правой стороны 10 символов это дата 
				ИначеЕсли XML_Документ.Имя = "link" И XML_Документ.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
					XML_Документ.Прочитать(); // Прочитаем содержимое 
				ИначеЕсли XML_Документ.Имя = "description" И XML_Документ.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
					XML_Документ.Прочитать(); // Прочитаем содержимое
					// Добавим запись в журнал регистрации
					ЗаписьЖурналаРегистрации("Optimus.ЗагрузкаКурсов"
											, УровеньЖурналаРегистрации.Информация, , ,"Данные с сайта " + ПутьКRSS + " полученны успешно.");
					
					ТекстКурсов = XML_Документ.Значение;
					Пока Найти(ТекстКурсов, "<tr>") > 0 Цикл // Пройдёмся по строкам полученной таблицы
						
						ТекстКурсов = Сред(ТекстКурсов, Найти(ТекстКурсов, "<tr>") + 4);
						ТекстКурсов = Сред(ТекстКурсов, Найти(ТекстКурсов, "<td>") + 4);
						
						КодВалюты = Лев(ТекстКурсов, 3);
						
						ТекстКурсов = Сред(ТекстКурсов, Найти(ТекстКурсов, "<td>") + 4);
						КратностьВалюты = Число(Лев(ТекстКурсов, Найти(ТекстКурсов," ") - 1));
						
						ТекстКурсов = Сред(ТекстКурсов, Найти(ТекстКурсов, "<td>") + 4);
						//Паганини_
					    ТекстКурсов = СтрЗаменить(ТекстКурсов, ".", Р_Д_Ч);
						//_Паганини
						КурсВалюты = Число(Лев(ТекстКурсов, 6));
						
						// Вызовим обновление / создание курса для валюты на сервере
						Результат = ДобавитьКурсДляВалюты(ТекущаяДата, КодВалюты, КурсВалюты, КратностьВалюты);						
					КонецЦикла;
					Прервать; // Прекращаем работу так как курсы уже загрузили, а дальще если что-то есть нас не интересует
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; // XML_Документ.Имя = "item" И XML_Документ.ТипУзла = ТипУзлаXML.НачалоЭлемента
	КонецЦикла;
Возврат ДатаИзДанных; 
КонецФункции

// Запись курса на конкретную дату если валюта в ИБ присутствует
Функция ДобавитьКурсДляВалюты(ДатаКурса, КодВалюты, КурсВалюты, КратностьВалюты) Экспорт 
	
	ВалютаКурса = Справочники.Валюты.НайтиПоНаименованию(КодВалюты);
	
	Если не ВалютаКурса.Пустая() и ВалютаКурса.СпособУстановкиКурса=Перечисления.СпособыУстановкиКурсаВалюты.ЗагрузкаИзИнтернета Тогда
		
		Курс = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		Курс.Период = ДатаКурса;
		Курс.Валюта = ВалютаКурса;
		Курс.Курс = КурсВалюты;
		Курс.Кратность = КратностьВалюты;
		Курс.Записать();
		
		Возврат Истина;	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

//++Lazare 25.08.2022
Функция ЗагрузитьКурсыВалютSSl (ПутьКRSS = "https://nbg.gov.ge/gw/api/ct/monetarypolicy/currencies/ka/json", РежимВыводаСообщений = Ложь) Экспорт
	
	Возврат	ПолучитьКурсы(ПутьКRSS);
	
КонецФункции

Функция ПолучитьКурсы(ПутьКRSS)

	ТекстОтвета = "";

	ДатаКурса = НачалоДня(ТекущаяДата());
	
	Сервер = Сред(ПутьКRSS,9,10); //  "nbg.gov.ge";	
	Ресурс = Сред(ПутьКRSS,19,36); //  "/gw/api/ct/monetarypolicy/currencies"; 	
	
	ТекстЗапроса = СтрШаблон("%1/?date=%2", Ресурс, ЗаписатьДатуJSON(НачалоДня(ТекущаяДата()),ФорматДатыJSON.ISO)); 
	HTTPЗапрос = Новый HTTPЗапрос(ТекстЗапроса);	
	
	HTTPСоединение =  Новый HTTPСоединение(Сервер, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());	
	
	HTTPОтвет  = HTTPСоединение.Получить(HTTPЗапрос);	
	ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);	
	
   	Data = ИзJSON_в_Данные1с(ТекстОтвета);
	
	Если РежимОтладки Тогда
		ТекстОтвета	 = ТекстОтвета + "
		|=======================  " + ДатаКурса + "
		|" + ТекстОтвета; 
	КонецЕсли;	
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Data", Data);
	СтруктураОтвета.Вставить("GetBodyAsString", ТекстОтвета);
	СтруктураОтвета.Вставить("StatusCode", HTTPОтвет.StatusCode);
	СтруктураОтвета.Вставить("Headers", HTTPОтвет.Headers);
	
	Если СтруктураОтвета.StatusCode <> 200 Тогда		
		ТекстСообщения = СтрШаблон( "Ошибка при получении курсов валют на дату %1. StatusCode %2!", Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"), СтруктураОтвета.StatusCode  );
		ЗаписьЖурналаРегистрации("Загрузка курсов валют", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);		
	Иначе
		ПроизвестиОбработкуJSONФайла(Data, ДатаКурса);
	КонецЕсли;
	
	//ЗаписатьФайлJSON(СтруктураОтвета.Data,ДатаИзДанных);

	Возврат ДатаКурса; 
	
КонецФункции 

//Записать JSON файл в Temp каталоге.
//Процедура ЗаписатьФайлJSON(Data,ДатаИзДанных)
//							
//	ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("json");	
//	Запись = Новый ЗаписьJSON;
//	Запись.ОткрытьФайл(ИмяПромежуточногоФайла);		
//	ЗаписатьJSON(Запись,Data);
//	Запись.Закрыть();
//	
//	ПроизвестиОбработкуJSONФайла(ИмяПромежуточногоФайла,ДатаИзДанных);
//	
//	Попытка
//		УдалитьФайлы(ИмяПромежуточногоФайла);	
//	Исключение
//	
//	КонецПопытки; 
//	
//КонецПроцедуры

// Создать объект чтения и открыть файл, из которого будет выполняться чтение и запис курсов валют.
Процедура ПроизвестиОбработкуJSONФайла(Данные, ДатаКурса2)
	
	ДатаКурса = ДатаКурса2;
	КодВалютыЛари = "GEL";
	
	СписокВалют = ПолучитьСписокВалют().Выгрузить().ВыгрузитьКолонку("Валюта");
	
	ВалютаЛари = Справочники.Валюты.НайтиПоНаименованию(КодВалютыЛари);
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	КодВалютыУчета = ВалютаУчета.Наименование;
	КурсВалютыУчета = 1;
	КратностьВалютыУчета = 1; 
	
	КурсПересчета = 1;
	КратностьПересчета = 1;
	
	Если КодВалютыУчета <> КодВалютыЛари Тогда
		Если ЗначениеЗаполнено(ВалютаЛари) и СписокВалют.Найти(ВалютаЛари)=Неопределено  ТОгда
			СписокВалют.Добавить(ВалютаЛари);	
		КонецЕсли;	
		Если ЗначениеЗаполнено(ВалютаУчета) и СписокВалют.Найти(ВалютаУчета)=Неопределено  ТОгда
			СписокВалют.Добавить(ВалютаУчета);	
		КонецЕсли;	
	КонецЕсли;	
	
	
	Для Каждого ЭлемМассиваНаДату Из Данные Цикл 
		
		Если ЭлемМассиваНаДату.Свойство("date") Тогда
			ДатаКурса = Дата(СтрЗаменить(Лев(ЭлемМассиваНаДату.date, 10), "-", ""));
		КонецЕсли;
		
		ТаблицаКурсов = Новый ТаблицаЗначений;
		ТаблицаКурсов.Колонки.Добавить("code");
		ТаблицаКурсов.Колонки.Добавить("date");
		ТаблицаКурсов.Колонки.Добавить("diff");
		ТаблицаКурсов.Колонки.Добавить("diffFormated");
		ТаблицаКурсов.Колонки.Добавить("name");
		ТаблицаКурсов.Колонки.Добавить("quantity");
		ТаблицаКурсов.Колонки.Добавить("rate");
		ТаблицаКурсов.Колонки.Добавить("rateFormated");
		ТаблицаКурсов.Колонки.Добавить("validFromDate");
		
		
		Если ЭлемМассиваНаДату.Свойство("currencies") Тогда 
			Для Каждого ЭлемКурсы Из ЭлемМассиваНаДату.currencies Цикл  
				НовСтрока = ТаблицаКурсов.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока,ЭлемКурсы);
			КонецЦикла;  
		КонецЕсли;
		
		
		КурсВалютыУчетаВТаблице = ТаблицаКурсов.Найти(КодВалютыУчета, "code");
		КурсЛариВТаблице = ТаблицаКурсов.Найти(КодВалютыЛари, "code");
		
		Если КурсВалютыУчетаВТаблице <> Неопределено Тогда
			КурсПересчета = КурсВалютыУчетаВТаблице.rate;
			КратностьПересчета = КурсВалютыУчетаВТаблице.quantity;
		Иначе
			КодВалюты = ВалютаУчета.Наименование;
			Результат = ДобавитьКурсДляВалюты(ДатаКурса, КодВалюты, КурсВалютыУчета, КратностьВалютыУчета);	
		КонецЕсли;	
		
		Для каждого СтрВалюты из СписокВалют Цикл
			
			НайденКурсДляВалюты = Ложь;
			
			КодВалюты = СтрВалюты.Наименование;
			СтрокаКурса = ТаблицаКурсов.Найти(КодВалюты, "code");
			
			Если КодВалюты = КодВалютыУчета Тогда //Валюту учеа не грузим - она всегда 1
				Если КурсЛариВТаблице = Неопределено Тогда
					КодВалюты = КодВалютыЛари;
					КурсВалюты = 1/КурсПересчета;
					КратностьВалюты = 1/КратностьПересчета;  
					
					Результат = ДобавитьКурсДляВалюты(ДатаКурса, КодВалюты, КурсВалюты, КратностьВалюты);
				КонецЕсли;
				
			ИначеЕсли СтрокаКурса<>Неопределено Тогда
				
				КурсВалюты = СтрокаКурса.rate/КурсПересчета;
				КратностьВалюты = СтрокаКурса.quantity/КратностьПересчета;
				
				
				Результат = ДобавитьКурсДляВалюты(ДатаКурса, КодВалюты, КурсВалюты, КратностьВалюты);
				
			ИначеЕсли КодВалюты = КодВалютыЛари	 Тогда
				
				
			Иначе	
				СтрСообщения = НСтр("ru='Отсутствует курс для валюты с кодом <%1> на дату <%2>';ka='თარიღისთვის <%2> კოდით <%1> ვალუტისთვის კურსი არ არის'");
				Сообщить(СтрШаблон(СтрСообщения, СтрВалюты, ДатаКурса));
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЦикла;	
	
КонецПроцедуры 
//--Lazare 25.08.2022


Процедура ЗагрузитьИсториюКурсов(НачалоПериода, ОкончаниеПериода) Экспорт  
	
	ТекстОтвета = "";
	
	//++Lazare 26.08.2022	
	СерверИсточник = "nbg.gov.ge";
	Ресурс		= "/gw/api/ct/monetarypolicy/currencies";
			
	ТекДата = НачалоДня(НачалоПериода);			
	//Пока Не ТекДата = НачалоДня(ОкончаниеПериода+86400) Цикл 
	Пока ТекДата <= ОкончаниеПериода Цикл 
		
		ТекстЗапроса = СтрШаблон("%1/?date=%2", Ресурс, ЗаписатьДатуJSON(ТекДата,ФорматДатыJSON.ISO)); 	
		HTTPЗапрос = Новый HTTPЗапрос(ТекстЗапроса);	
	
		HTTPСоединение =  Новый HTTPСоединение(СерверИсточник, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());	
		//ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("json");
		
		Попытка
			HTTPОтвет  = HTTPСоединение.Получить(HTTPЗапрос);	
			
			ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);	
			Data = ИзJSON_в_Данные1с(ТекстОтвета);

			Если РежимОтладки Тогда
				ТекстОтвета	 = ТекстОтвета + "
				|=======================  " + ТекДата + "
				|" + ТекстОтвета; 
			КонецЕсли;	
			
			ПроизвестиОбработкуJSONФайла(Data, ТекДата);
			//ТекДата = ТекДата +86400;				
			
			//УдалитьФайлы(ИмяПромежуточногоФайла);			
		Исключение
			СтрОшибки = ОписаниеОшибки();
			Сообщить("Неудачная попытка соединения." + СтрОшибки);
		КонецПопытки;
		
		ТекДата = НачалоДня(КонецДня(ТекДата)+1);
	КонецЦикла;
	//--Lazare 26.08.2022		
		
КонецПроцедуры	 

Функция ПолучитьСписокВалют()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Валюты.Наименование как Наименование,
	|	Валюты.Ссылка как Валюта
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.НациональнаяВалюта КАК НациональнаяВалюта
	|		ПО Валюты.Ссылка <> НациональнаяВалюта.Значение
	|ГДЕ
	|	НЕ Валюты.ПометкаУдаления
	|	И НЕ Валюты.Наименование = """"
	//Lazare_	 		
	|	И Валюты.СпособУстановкиКурса = ЗНАЧЕНИЕ(Перечисление.СпособыУстановкиКурсаВалюты.ЗагрузкаИзИнтернета)";
	//_Lazare
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;	
	
КонецФункции

Функция ПолучитьСписокВалютСтрокой()
	
	списокВалют = "";
	
	РезультатЗапроса = ПолучитьСписокВалют();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если списокВалют = "" Тогда
			списокВалют = списокВалют + ВыборкаДетальныеЗаписи.Наименование;
		Иначе 
			списокВалют = списокВалют + "," + ВыборкаДетальныеЗаписи.Наименование;
		КонецЕсли;
	КонецЦикла;
	
	Возврат списокВалют;	
	
КонецФункции


Процедура ЧтениеИзJSON(ИмяВременногоФайла, ТаблиаВалюты)
	
	тЧтениеJSON = Новый ЧтениеJSON;
	тЧтениеJSON.ОткрытьФайл(ИмяВременногоФайла);
	
	//объектJSON = СериализаторXDTO.ПрочитатьJSON(тЧтениеJSON);
	
	тДанные = ПрочитатьJSON(тЧтениеJSON, Ложь);
	
	Попытка
		
		Если ТипЗнч(тДанные) = Тип("Структура") И тДанные.valid = Истина Тогда
			массивВалют = тДанные.result;
			ТаблиаВалюты.Очистить();
			
			Для каждого стрВалюта Из массивВалют Цикл
				Для каждого тКурс Из стрВалюта.rates Цикл
					текСтрДата = СтрЗаменить(Строка(Формат(тКурс[0], "ЧГ=0"))," " ,"");
					текСтрДата = Лев(текСтрДата,10);
					текДата	   =  СконвертироватьВремяUnixTS(текСтрДата);
					
					//Если текДата  >= НачалоПериода И текДата <= ОкончаниеПериода Тогда
						новаяСтрокаВалюти = ТаблиаВалюты.Добавить();
						ЗаполнитьЗначенияСвойств(новаяСтрокаВалюти,стрВалюта);
						
						новаяСтрокаВалюти.dateCurrency = текСтрДата;
						новаяСтрокаВалюти.Rate = тКурс[1];
						новаяСтрокаВалюти.Date = текДата; 		
					//КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			ЗапольнитКурсовВалют(ТаблиаВалюты);
			
		Иначе
			Сообщить("Неудачная попытка соединения.");
		КонецЕсли;
		
	Исключение
		Сообщить("Неудачная попытка соединения.");
	КонецПопытки;
	
	тЧтениеJSON.Закрыть();
	
КонецПроцедуры
   
Функция ИзJSON_в_Данные1с(СтрокаJSON) Экспорт
	
	Json = Новый ЧтениеJSON;
	Json.УстановитьСтроку(СтрокаJSON);
		
	Рез = ПрочитатьJSON(Json);
		
	Возврат Рез;
		
КонецФункции  

Функция СконвертироватьВремяUnixTS(UnixTime) 
	Возврат МестноеВремя('19700101' + UnixTime); 
КонецФункции  

Функция ПолучитьUnixTS(ПараметрДата) 
	Возврат Формат(УниверсальноеВремя(ПараметрДата) - '19700101', "ЧГ=0"); 
КонецФункции  

Процедура ЗапольнитКурсовВалют(ТаблицаВалюты)
	
	Для Каждого Стр Из ТаблицаВалюты Цикл 
		
		ВалютаСсылка = Справочники.Валюты.НайтиПоНаименованию(Стр.code);
		
		Если Не ЗначениеЗаполнено(ВалютаСсылка) Тогда 
			Продолжить;
		КонецЕсли;
			
		НЗ = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
		НЗ.Отбор.Валюта.Установить(ВалютаСсылка);
		НЗ.Отбор.Период.Установить(Стр.Date);
		НЗ.Прочитать();
		НЗ.Очистить();
		Запись = НЗ.Добавить();
		Запись.Валюта = ВалютаСсылка;
		Запись.Период = Стр.Date;
		Запись.Курс   = Стр.Rate;
		Запись.Кратность = Стр.ratio;
		Попытка
			НЗ.Записать();
			Сообщить("შევსებულია " + ВалютаСсылка.Наименование + "-ის კურსი თარიღისთვის: " + Стр.Date);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;           


КонецПроцедуры