
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрыВыполненияКоманды.Окно = Неопределено Тогда
		Источник = Неопределено;
		Уникальность = "ЗаказНаряд";
	Иначе
		Источник = ПараметрыВыполненияКоманды.Источник;
		Уникальность = ПараметрыВыполненияКоманды.Уникальность;
	КонецЕсли;
	
	ОткрытьФорму("Документ.СписаниеТопливаЗапасов.ФормаСписка",
			Новый Структура("ВидОперации", "СписаниеТоплива"),
			Источник,
			Уникальность,
			ПараметрыВыполненияКоманды.Окно,
			ПараметрыВыполненияКоманды.НавигационнаяСсылка
		);	
	
КонецПроцедуры
