#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["ВВалюте"].Рекомендуемый = Истина;
	
	//ПодольскийАИ #УчетПроектов 01.12.2020 {
	НастройкиВариантов["ВВалютеПоПроекту"].Рекомендуемый = Истина;
	//ПодольскийАИ #УчетПроектов 01.12.2020 }
	
	ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов);
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыУНФ.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов)
	
	МассивПолейСумм = Новый Массив;
	Для каждого ДоступноеПоле Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		Если НЕ ДоступноеПоле.Ресурс Тогда
			Продолжить;
		КонецЕсли;
		ИмяПоля = Строка(ДоступноеПоле.Поле);
		МассивПолейСумм.Добавить(ИмяПоля);
	КонецЦикла; 
	
	Для каждого НастройкиТекВарианта Из НастройкиВариантов Цикл
		
		ВариантыОформления = НастройкиТекВарианта.Значение.ВариантыОформления;
		ОтчетыУНФ.ДобавитьВариантыОформленияСумм(ВариантыОформления, МассивПолейСумм);
			
	КонецЦикла; 
	
КонецПроцедуры

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["Основной"].Теги = НСТР("ka='Зарплата,Сотрудники,Начисления,Удержания';ru='Зарплата,Сотрудники,Начисления,Удержания';en='Salary, Employees, Accruals, Deductions'");
	НастройкиВариантов["ВВалюте"].Теги = НСТР("ka='Зарплата,Сотрудники,Начисления,Удержания,Валюты';ru='Зарплата,Сотрудники,Начисления,Удержания,Валюты';en='Salary, Employees, Accruals, Deductions, Currency'");
	
	//ПодольскийАИ #УчетПроектов 01.12.2020 {
	НастройкиВариантов["ОсновнойПоПроекту"].Теги = НСТР("ka='Зарплата,Сотрудники,Начисления,Удержания,Проекты';ru='Зарплата,Сотрудники,Начисления,Удержания,Проекты'");
	НастройкиВариантов["ВВалютеПоПроекту"].Теги = НСТР("ka='Зарплата,Сотрудники,Начисления,Удержания,Валюты,Проекты';ru='Зарплата,Сотрудники,Начисления,Удержания,Валюты,Проекты'");
	//ПодольскийАИ #УчетПроектов 01.12.2020 }
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "Сотрудник", "Справочник.Сотрудники");
	
	//ПодольскийАИ #УчетПроектов 01.12.2020 {
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ОсновнойПоПроекту"].СвязанныеПоля, "Сотрудник", "Справочник.Сотрудники");
	//ПодольскийАИ #УчетПроектов 01.12.2020 }
	
КонецПроцедуры
 
#КонецОбласти 

ЭтоОтчетУНФ = Истина;

#КонецЕсли
