

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	//ЭтотОбъект.ОснованиеСоздания = Параметры.Основание;
	
	////+++ Дмгг
	//Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 
	//	ПересчитатьКурсКратностьПриКопированииДокумента();
	//КонецЕсли;
	////--- Дмгг
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	Контрагент = Объект.Контрагент;
	Договор = Объект.Договор;
	Если ЗначениеЗаполнено(Договор) Тогда
		ВалютаРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВалютаРасчетов");
	КонецЕсли;
	//Заказ = Объект.Заказ;
	НациональнаяВалюта = УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту();
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", НациональнаяВалюта));
	КурсНациональнаяВалюта = СтруктураПоВалюте.Курс;
	КратностьНациональнаяВалюта = СтруктураПоВалюте.Кратность;
	
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//УчетПоПроектам = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункциональнаяОпцияУчетПоПроектам");
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ ЗначениеЗаполнено(Параметры.Основание) И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			//ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС(Истина);
		КонецЕсли;
		КонецЕсли;
	//ПолучитьСтруктуруВидовОпераций();
	
	// Сформируем надпись цены и валюты.
	УчетВалютныхОпераций = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	СтруктураНадписи = Новый Структура("ВидЦен, ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС", Объект.ВидЦен, Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, КурсНациональнаяВалюта, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.НалогообложениеНДС);
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	
	//ИменаТЧ = Новый Массив;
	//ИменаТЧ.Добавить(Новый Структура("ИмяПоляПроверки, ИмяПоляОформления", "Объект.Запасы.СтранаПроисхождения", "ЗапасыНомерГТД"));
	//
	//ГрузовыеТаможенныеДекларацииСервер.ПриСозданииНаСервере(ЭтаФорма, ИменаТЧ, КэшЗначений);
	
	//УстановитьВидимостьИДоступность();
	
	// Установка видимости реквизитов от пользовательских настроек
	//УстановитьВидимостьОтПользовательскихНастроек(); 
	
	//Элементы.Ячейка.Видимость = НЕ Объект.СтруктурнаяЕдиница.ОрдерныйСклад;
	//
	////Установить надписи счет-фактура и основание
	//НайденныйСчетФактура = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйСчетФактуру(Объект.Ссылка, Ложь);
	//Элементы.СчетФактураНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(НайденныйСчетФактура,,СчетФактураТекст);
	//Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Объект.ДокументОснование);
	//ЗаполнитьСписокДокументОснование();
	
	////-------------------------- // Россофт // --->
	//НайденныйЭлНакладная = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйЭлНакладная(Объект.Ссылка);
	//Элементы.ЭлектроннаяНакладнаяНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьЭлНакладная(НайденныйЭлНакладная);
	//////-------------------------- //Россофт  // <---
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	//ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойСклад");
	//ОсновнойСклад = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
	//
	// Установка видимости договора.
	УстановитьВидимостьДоговора();
	
	//// Настройка подразделения
	//Если НЕ ПолучитьФункциональнуюОпцию("УчетПоНесколькимПодразделениям") Тогда
	//	Элементы.ДополнительноПраваяКолонка.Объединенная = Истина;
	//КонецЕсли;
	
	//// ЕГАИС
	//ИнтеграцияЕГАИСУНФ.УстановитьУсловноеОформлениеСправокЕГАИС(ЭтотОбъект);
	//ИнтеграцияЕГАИСУНФ.ЗаполнитьНеобходимостьВводаСправкиНаАлкоголь(Объект.Запасы);
	//// Конец ЕГАИС
	//
	//// ЭДО
	//УстановитьВидЭД();
	//
	//ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	//ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	//ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	//ПараметрыЭДОПриСоздании.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	//ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	//ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(Отказ, СтандартнаяОбработка, ПараметрыЭДОПриСоздании);
	//// Конец ЭДО
	
	//// ПодборНоменклатурыВДокументах
	//ПодборНоменклатурыВДокументах.НазначитьФормуПодбора(ПараметрыОткрытияПодбора, Объект.Ссылка.Метаданные().Имя, "Запасы");
	//// Конец ПодборНоменклатурыВДокументах
	
	//// КопированиеСтрокТабличныхЧастей
	//КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Запасы");
	
	//// ГрупповоеИзменениеСтрок
	//ЗаполнитьСписокДействий();
	//ГрупповоеИзменениеСтрокСервер.ПриСозданииНаСервере(НаборЭлементовГрупповогоИзмененияСтрокСервер(), ЭтотОбъект.ЗапасыИзменениеСтрокДействие);
	//ЗапасыИзменениеСтрокДействиеПриОткрытии = ЗапасыИзменениеСтрокДействие;
	//УстановитьПометку(Истина);
	//// Конец ГрупповоеИзменениеСтрок
	
	//ОбменСGoogle.ПодключитьОбработчикиСобытияАвтоподбор(ЭтотОбъект);
	//
	//ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	//
	//// АвтоматическиеСкидки.
	//АвтоматическиеСкидкиПриСозданииНаСервере();
	//ВидОперацииПродажаПокупателю = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю");
	
	//// СтандартныеПодсистемы.ВерсионированиеОбъектов
	//ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	//// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	//// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	//ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	//// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	//
	//// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	//ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.РасходнаяНакладная.ТабличныеЧасти.Запасы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	//// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	//
	//// СтандартныеПодсистемы.Печать
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	//// Конец СтандартныеПодсистемы.Печать
	//УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	//
	//// СтандартныеПодсистемы.Свойства
	//ДополнительныеПараметры = УправлениеСвойствамиПереопределяемый.ЗаполнитьДополнительныеПараметры(Объект, "ГруппаДополнительныеРеквизиты");
	//УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	//// Конец СтандартныеПодсистемы.Свойства
	//
	//// ПодключаемоеОборудование
	//ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	//СписокЭлектронныхВесов = МенеджерОборудованияВызовСервера.ПолучитьСписокОборудования("ЭлектронныеВесы", , МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
	//Если СписокЭлектронныхВесов.Количество() = 0 Тогда
	//	// Нет подключенных весов.
	//	Элементы.ЗапасыПолучитьВес.Видимость = Ложь;
	//КонецЕсли;
	//Элементы.ЗапасыЗагрузитьДанныеИзТСД.Видимость = ИспользоватьПодключаемоеОборудование;
	//// Конец ПодключаемоеОборудование
	
	////Ручные скидки
	//СкидкиНаценкиКлиентСервер.РассчитатьСуммуИПроцентСкидки(ЭтотОбъект);
	////Конец Ручные скидки
	//
	//ОбновитьВидимостьИОстаткиВзаиморасчетов();	
	//Элементы.ГруппаПредоплата.Заголовок = РаботаСФормойДокументаКлиентСервер.ПолучитьЗаголовокПредоплаты(Объект.Предоплата, Объект.ВалютаДокумента);
	//
	//// Серийные номера
	//ИспользоватьСерийныеНомераОстатки = РаботаССерийнымиНомерами.ИспользоватьСерийныеНомераОстатки();
	//
	//	// МобильноеПриложение
	//Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
	//	Элементы.ВидОперации.Видимость = Ложь;
	//	Элементы.ФормаОбщаяКомандаНапомнить.Видимость = Ложь;
	//	Элементы.ГруппаГлобальныеКоманды.Видимость = Ложь;
	//	Элементы.ФормаНастройкаДокумента.Видимость = Ложь;
	//	Элементы.ПоказатьВЖурналеКонтрагентов.Видимость = Ложь;
	//	Элементы.ФормаОбработкаНастройкаПрограммыБольшеВозможностейКонтекст.Видимость = Ложь;
	//	Элементы.ГруппаПредоплата.Видимость = Ложь;
	//	Элементы.ГруппаДополнительно.Видимость = Ложь;
	//	Элементы.ИтогСуммаНДС.Видимость = Ложь;
	//	Элементы.ГруппаСсылки.Видимость = Ложь;
	//	Элементы.ГруппаЦеныИВалюта.Видимость = Ложь;
	//	Элементы.ЗапасыГруппаКопированиеСтрок.Видимость = Ложь;
	//	Элементы.ЗапасыПодбор.Видимость = Ложь;
	//	Элементы.ЗагрузкаДанныхИзВнешнегоИсточника.Видимость = Ложь;
	//	Элементы.ЗапасыИзменитьСтроки.Видимость = Ложь;
	//	Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
	//	Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
	//	
	//	Элементы.ФормаЗаписать.Видимость = Ложь;
	//	Элементы.ФормаПровести.Видимость = Ложь;
	//	Элементы.ФормаОтменаПроведения.Видимость = Ложь;
	//	Элементы.ФормаПоказатьВСписке.Видимость = Ложь;
	//	Элементы.ФормаКоманднаяПанельКомандыЭДО.Видимость = Ложь;
	//	Элементы.ФормаПровестиИЗакрыть.Заголовок = "Готово";
	//КонецЕсли;
	//// Конец МобильноеПриложение
	
	//// ИнтеграцияГИСМ
	//СформироватьТекстУведомлениеОбОтгрузкеМаркированнойПродукцииСервер();
	//// Конец ИнтеграцияГИСМ
	
	//ОпределитьВидимостьНастроекУчетаВНалогообложении();
	
	////++Lazare 13.12.2021
	//ЗапретРедактирования = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ЗапретРедактированияПроведенныхДокументовРеализация");	
	////--Lazare 13.12.2021
	
	////Паганини#ЛимитиПокупателей_
	//ПравоРедактированияЛимитов = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(, "ПравоРедактированияЛимитовПокупателей");
	//Элементы.ОтключитьКонтрольЛимитаЗадолжностиПокупателя.ТолькоПросмотр = НЕ ПравоРедактированияЛимитов;
	//_Паганини#ЛимитиПокупателей
	//Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ПрочитатьВесИОбъемЕдиницыТовара();
	//	//Паганини_
	//	Объект.НомерТТН 					= "";
	//	Объект.IDTТН						= "";
	//	Объект.ФактурыАвансов.Очистить();
	//	//Объект.СтатусТТН					= Неопределено;
	//	//Объект.ДатаНачалаТранспортировки	= Дата(1,1,1);//_Паганини
	//	//ПаганиниDMS_
	//	Объект.TL_DMSNo  = "";
	//	//_ПаганиниDMS
	//	//Паганини#ЛимитиПокупателей_
	//	Если НЕ ПравоРедактированияЛимитов Тогда
	//		Объект.ОтключитьКонтрольЛимитаЗадолжностиПокупателя = Ложь;
	//	КонецЕсли;
	//	//_Паганини#ЛимитиПокупателей
	//	
	//Иначе 
	//	//++Lazare 13.12.2021
	//	Если Объект.Проведен Тогда
	//		ТолькоПросмотр = ЗапретРедактирования;
	//		//КоманднаяПанель.Доступность =Не ЗапретРедактирования;
	//		//ЭтаФорма.Доступность = Не ЗапретРедактирования;
	//	КонецЕсли;
	//	//--Lazare 13.12.2021
	//	
	//КонецЕсли;
	////
	//Если Параметры.Свойство("Страница")
	//	И НЕ ПустаяСтрока(Параметры.Страница)
	//	И НЕ Элементы.Найти(Параметры.Страница) = Неопределено Тогда
	//	Элементы.Страницы.ТекущаяСтраница = Элементы[Параметры.Страница];
	//КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ЗаполнитьСчетаБезвозмезднойПродажи(); //+++ Истмин
	//КонецЕсли;
	
	//ОбновитьВидимостьТраспортныхСредств();
	//УстановкаФорматовЦен();// Kuzmich, 05.06.2019, Количество знаков после запятой в цене
	//ОбщегоНазначенияПереопределяемый.УстановитьДополнительноеПоведениеСтандартныхКнопокТЧЗапасы(ЭтаФорма);// Kuzmich, 07.08.2019, Дополнительные инструменты в табличных частях документов движения товаров
	//УстановитьВидимостьСотрудниковвТабЧастиЗапасы(); //+++ Дмгг БезвозмезднаяПродажаНаСотрудников
	
	ИспользоватьИсториюНалогообложенияКонтрагента = ПолучитьФункциональнуюОпцию("ФункциональнаяОпцияИспользоватьИсториюНалогообложенияКонтрагентов"); //+++ Дмгг
	
	//Если Не (РольДоступна("ПолныеПрава") Или Не Константы.ФункционалПраваРедактированияНоменклатуры.Получить()) Тогда	
	//	ПравоИзмененияЦеныНоменклатурыВРасходнойНакладной = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(,"ПравоИзмененияЦеныНоменклатурыВРасходнойНакладной");//Паганини	
	//	Элементы.ЗапасыЦена.ТолькоПросмотр  = Не ПравоИзмененияЦеныНоменклатурыВРасходнойНакладной;
	//	Элементы.ЗапасыСумма.ТолькоПросмотр = Не ПравоИзмененияЦеныНоменклатурыВРасходнойНакладной;
	//КонецЕсли;
	
	////Lazare_
	//Если Не РольДоступна("ПолныеПрава") Тогда				
	//	МассивГрупп = ОбщегоНазначения.ПолучитьГруппыНоменклатурыИзНастроекПользователя("ЗапретРедактированияЦенВДокументахРазрезеГруппНоменклатуры");
	//	ГруппыПользователя.ЗагрузитьЗначения(МассивГрупп);		
	//КонецЕсли;
	////_Lazare
	//
	//НайденныйНалоговыйДокумент = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйНалоговыйДокумент(Объект.Ссылка);
	//Элементы.НалоговыйДокументНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьНалоговыйДокумент(НайденныйНалоговыйДокумент);
	//
	//
	//УстановитьВидимостьИсполнительовВТабЧастиЗапасы();//Lazare 26.10.2021
	////+++ Дмгг
	//КолвоБалов = 0;
	//КоэффициентЛояльности = 0;
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	КоэффициентЛояльности = Объект.КартаЛояльности.Владелец.КоэфициентПересчета;
	//	Если ЗначениеЗаполнено(Объект.КартаЛояльности) Тогда 
	//		Элементы.ДоступноБалов.Заголовок = НСтр("ru = 'Достуно балов: '; ka = 'Достуно балов: '; en = 'Достуно балов: '") + Объект.ДоступноБалов;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//ИспользоватьКартыЛояльности = ПолучитьФункциональнуюОпцию("ИспользоватьКартыЛояльности");
	//
	//УстановитьВидимостьДокументАвтоматическогоПроизводства();
	////--- Дмгг
	//
	//// Олег Литвиненко 20.09.22 --->
	//УстановитьВидимостьЭтоПодарок();
	//// Олег Литвиненко <---
	
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ПодготовитьДанныеДляСформированияНадписи()
	
	// Сформируем надпись цены и валюты.
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	СтруктураНадписи = Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, УчетВалютныхОпераций, НалогообложениеНДС,ВидЦен", Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, КурсНациональнаяВалюта, УчетВалютныхОпераций, Объект.НалогообложениеНДС,Объект.ВидЦен);
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеКонтрагентПриИзменении(Дата, ВалютаДокумента, Контрагент, Организация)
	
	ДоговорПоУмолчанию = ПолучитьДоговорПоУмолчанию(Объект.Ссылка, Контрагент, Организация, Неопределено );
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить(
		"КонтактноеЛицоПодписант",
		Контрагент.КонтактноеЛицоПодписант
	);
	
	СтруктураДанные.Вставить(
		"Договор",
		ДоговорПоУмолчанию
	);
	
	СтруктураДанные.Вставить(
		"НаименованиеДоговора",
		ДоговорПоУмолчанию.Наименование
	);
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетов",
		ДоговорПоУмолчанию.ВалютаРасчетов
	);
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетовКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ДоговорПоУмолчанию.ВалютаРасчетов))
	);
	
	СтруктураДанные.Вставить(
		"РасчетыВУсловныхЕдиницах",
		ДоговорПоУмолчанию.РасчетыВУсловныхЕдиницах
	);
	
	//СтруктураДанные.Вставить(
	//	"ВидСкидкиНаценки",
	//	ДоговорПоУмолчанию.ВидСкидкиНаценки
	//);
	
	СтруктураДанные.Вставить(
		"ВидЦен",
		ДоговорПоУмолчанию.ВидЦен
	);
	
	СтруктураДанные.Вставить(
		"СуммаВключаетНДС",
		?(ЗначениеЗаполнено(ДоговорПоУмолчанию.ВидЦен), ДоговорПоУмолчанию.ВидЦен.ЦенаВключаетНДС, Неопределено)
	);
	
	УстановитьВидимостьДоговора();
	
	//ОбновитьВидимостьИОстаткиВзаиморасчетов();
	
	Возврат СтруктураДанные;
	
КонецФункции 

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПередИзменением = Контрагент;
	//КонтрагентВестиРасчетыПоЗаказамПередИзменением = КонтрагентВестиРасчетыПоЗаказам;
	Контрагент = Объект.Контрагент;
	
	Если КонтрагентПередИзменением <> Объект.Контрагент Тогда
		
		//ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
		
		//Объект.БанковскийСчетКонтрагента = Неопределено;
		//Объект.АдресДоставки = "";
		
		ВидимостьДоговораПередИзменением = Элементы.Договор.Видимость;
		
		СтруктураДанные = ПолучитьДанныеКонтрагентПриИзменении(Объект.Дата, Объект.ВалютаДокумента, Объект.Контрагент, Объект.Организация);
		
		// Дисконтные карты
		СтруктураДанные.Вставить("ВызовИзПроцедурыПриИзмененииКонтрагента", Истина);
		// Конец Дисконтные карты.
		
		Объект.Договор = СтруктураДанные.Договор;
		//Объект.КонтактноеЛицоПодписант = СтруктураДанные.КонтактноеЛицоПодписант;
		ДоговорПередИзменением = Договор;
		Договор = Объект.Договор;
		
		//ПечатьДокументовУНФКлиент.ПриИзмененииДоговораКонтрагента(Объект.Договор, Объект.ОснованиеПечатиСсылка, Объект.ОснованиеПечати);
		
		Если Объект.Предоплата.Количество() > 0
			И Объект.Договор <> ДоговорПередИзменением Тогда
			
			ПараметрыДокумента = Новый Структура;
			ПараметрыДокумента.Вставить("ИзменениеКонтрагента", Истина);
			ПараметрыДокумента.Вставить("ДанныеДоговора", СтруктураДанные);
			ПараметрыДокумента.Вставить("КонтрагентПередИзменением", КонтрагентПередИзменением);
			//ПараметрыДокумента.Вставить("КонтрагентВестиРасчетыПоЗаказамПередИзменением", КонтрагентВестиРасчетыПоЗаказамПередИзменением);
			ПараметрыДокумента.Вставить("ВидимостьДоговораПередИзменением", ВидимостьДоговораПередИзменением);
			ПараметрыДокумента.Вставить("ДоговорПередИзменением", ДоговорПередИзменением);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОбОчисткеПредоплатыЗавершение", ЭтотОбъект, ПараметрыДокумента);
			ТекстВопроса = НСтр("ka='წინასწარი გადახდის ჩათვლა გაიწმინდება, გავაგრძელოთ?';ru='Зачет предоплаты будет очищен, продолжить?';en='Passed prepayment will be cleared to continue?'");
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		
		ОбработатьИзменениеУсловийДоговора(СтруктураДанные, ДоговорПередИзменением);
		
	Иначе
		
		Объект.Договор = Договор; // Восстанавливаем автоматически очищеный договор.
		//Объект.Заказ = Элементы.Заказ.ОграничениеТипа.ПривестиЗначение(Заказ);;
		
	КонецЕсли;
	
	//Заказ = Объект.Заказ;
	
	//// АвтоматическиеСкидки
	//СброситьФлагСкидкиРассчитаныКлиент("КонтрагентПриИзменении");
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
	//ЗаполнитьТС();
	//
	////+++ Lazare 26.10.2021	
	//ЗаполнитьОтветственногоИзКонтрагента = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ЗаполнитьОтветственногоИзКонтрагента");	
	//Если  ЗаполнитьОтветственногоИзКонтрагента Тогда 	
	//	Объект.Ответственный = РС_ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Контрагент,"Ответственный");	
	//КонецЕсли;
	////--- Lazare_26.10.2021

	
КонецПроцедуры

&НаКлиенте
Процедура ЛицензииНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Лицензии.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);	
	СтруктураДанные.Вставить("ДатаОбработки",	 Объект.Дата);
	СтруктураДанные.Вставить("ВалютаДокумента",  Объект.ВалютаДокумента);
	//СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	СтруктураДанные.Вставить("Характеристика", Неопределено);
	СтруктураДанные.Вставить("ВидЦен",Объект.ВидЦен);
	СтруктураДанные.Вставить("Коэффициент", 1);  
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);

	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.СтавкаЛицензии = СтруктураДанные.СтавкаЛицензии;
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.ЦенаПоВидЦен ;
	СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
		

	
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицензииЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();

КонецПроцедуры

&НаКлиенте
Процедура ЛицензииСтавкаНДСПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ОбработатьИзменениеДоговора();
	//Объект.ВалютаДокумента = 
	ПодготовитьДанныеДляСформированияНадписи();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблиц

&НаКлиенте
Процедура РедактироватьЦеныИВалюту(Элемент, СтандартнаяОбработка)
	
	Если ЭтаФорма.ТолькоПросмотр = Истина Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ОбработатьИзмененияПоКнопкеЦеныИВалюты(Объект.ВалютаДокумента);
	Модифицированность = Истина;
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "Нажатие");
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыПредоплата

&НаКлиенте
Процедура ПредоплатаСуммаРасчетовПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Предоплата.ТекущиеДанные;
		
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
			?(Объект.Курс = 0,
			1,
			Объект.Курс),
		СтрокаТабличнойЧасти.Курс
	);
	
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
			?(Объект.Кратность = 0,
			1,
			Объект.Кратность),
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаРасчетов,
		СтрокаТабличнойЧасти.Курс,
		?(Объект.ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Объект.Курс),
		СтрокаТабличнойЧасти.Кратность,
		?(Объект.ВалютаДокумента = НациональнаяВалюта,КратностьНациональнаяВалюта, Объект.Кратность)
	);

КонецПроцедуры

&НаКлиенте
Процедура ПредоплатаСуммаПлатежаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Предоплата.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	
	СтрокаТабличнойЧасти.Кратность = 1;
	
	СтрокаТабличнойЧасти.Курс =
		?(СтрокаТабличнойЧасти.СуммаРасчетов = 0,
			1,
			СтрокаТабличнойЧасти.СуммаПлатежа
		  / СтрокаТабличнойЧасти.СуммаРасчетов
		  * Объект.Курс
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредоплатаДокументПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Предоплата.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Документ) Тогда
		
		СтруктураДанные = ПолучитьДанныеДокументПриИзменении(СтрокаТабличнойЧасти.Документ, Объект.Договор);
		
		СтрокаТабличнойЧасти.СуммаРасчетов = СтруктураДанные.СуммаРасчетов;
				
		СтрокаТабличнойЧасти.Курс = 
			?(СтрокаТабличнойЧасти.Курс = 0,
				?(СтруктураДанные.ДокументКурс = 0,
				?(Объект.Курс = 0,
				1,
				Объект.Курс),
				СтруктураДанные.ДокументКурс),
			СтрокаТабличнойЧасти.Курс
		);
		
		СтрокаТабличнойЧасти.Кратность =
			?(СтрокаТабличнойЧасти.Кратность = 0,
				?(СтруктураДанные.ДокументКратность = 0,
				?(Объект.Курс = 0,
				1,
				Объект.Курс),
				СтруктураДанные.ДокументКратность),
			СтрокаТабличнойЧасти.Кратность
		);
		
		СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
			СтрокаТабличнойЧасти.СуммаРасчетов,
			СтрокаТабличнойЧасти.Курс,
			?(Объект.ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Объект.Курс),
			СтрокаТабличнойЧасти.Кратность,
			?(Объект.ВалютаДокумента = НациональнаяВалюта,КратностьНациональнаяВалюта, Объект.Кратность)
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеДокументПриИзменении(Документ, Договор)
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить("СуммаРасчетов", Документ.РасшифровкаПлатежа.Итог("СуммаРасчетов"));
	
	МассивСтрокВДокументе = Документ.РасшифровкаПлатежа.НайтиСтроки(Новый Структура("ПризнакАванса, Договор, Документ", ИСТИНА, Договор, НЕОПРЕДЕЛЕНО));
	
	Если МассивСтрокВДокументе.Количество() > 0 Тогда 
		СтруктураДанные.Вставить("ДокументКурс", МассивСтрокВДокументе[0].Курс);
		СтруктураДанные.Вставить("ДокументКратность", МассивСтрокВДокументе[0].Кратность);
	Иначе
		СтруктураДанные.Вставить("ДокументКурс", 0);
		СтруктураДанные.Вставить("ДокументКратность", 0);
	КонецЕсли;

	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДокументПриИзменении()

&НаКлиенте
Процедура ПредоплатаКурсПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Предоплата.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаРасчетов,
		СтрокаТабличнойЧасти.Курс,
		?(Объект.ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Объект.Курс),
		СтрокаТабличнойЧасти.Кратность,
		?(Объект.ВалютаДокумента = НациональнаяВалюта,КратностьНациональнаяВалюта, Объект.Кратность)
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредоплатаКратностьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Предоплата.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаРасчетов,
		СтрокаТабличнойЧасти.Курс,
		?(Объект.ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Объект.Курс),
		СтрокаТабличнойЧасти.Кратность,
		?(Объект.ВалютаДокумента = НациональнаяВалюта,КратностьНациональнаяВалюта, Объект.Кратность)
	);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоговора()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ПараметрыРасчетовСКонтрагентом = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Контрагент, "ВестиРасчетыПоЗаказам, ВестиРасчетыПоДоговорам");
		
		КонтрагентВестиРасчетыПоЗаказам = ПараметрыРасчетовСКонтрагентом.ВестиРасчетыПоЗаказам;
		Элементы.Договор.Видимость = ПараметрыРасчетовСКонтрагентом.ВестиРасчетыПоДоговорам;
		
	Иначе
		
		КонтрагентВестиРасчетыПоЗаказам = Ложь;
		Элементы.Договор.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьДоговора()

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьНадписьЦеныИВалюта(СтруктураНадписи)
	
	ТекстНадписи = "";
	
	// Валюта
	Если СтруктураНадписи.УчетВалютныхОпераций Тогда
		Если ЗначениеЗаполнено(СтруктураНадписи.ВалютаДокумента) Тогда
			ТекстНадписи = НСтр("ka='%Валюта%';ru='%Валюта%';en='%Currency%'");
			ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Валюта%", СокрЛП(Строка(СтруктураНадписи.ВалютаДокумента)));
		КонецЕсли;
	КонецЕсли;
	
	// Вид цен
	Если ЗначениеЗаполнено(СтруктураНадписи.ВидЦен) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%ВидЦен%';ru='%ВидЦен%';en='% VidTsen%'");
		Иначе	
			ТекстНадписи = ТекстНадписи + НСтр("ka=' • %ВидЦен%';ru=' • %ВидЦен%'");
		КонецЕсли;
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ВидЦен%", СокрЛП(Строка(СтруктураНадписи.ВидЦен)));
	КонецЕсли;
	
	//// Вид скидки наценки
	//Если ЗначениеЗаполнено(СтруктураНадписи.ВидСкидки) Тогда
	//	Если ПустаяСтрока(ТекстНадписи) Тогда
	//		ТекстНадписи = ТекстНадписи + НСтр("ka='%ВидСкидкиНаценки%';ru='%ВидСкидкиНаценки%';en='% VidSkidkiNatsenki%'");
	//	Иначе
	//		ТекстНадписи = ТекстНадписи + НСтр("ka=' • %ВидСкидкиНаценки%';ru=' • %ВидСкидкиНаценки%'");
	//	КонецЕсли;
	//	ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ВидСкидкиНаценки%", СокрЛП(Строка(СтруктураНадписи.ВидСкидки)));
	//КонецЕсли;
	//
	//// Дисконтная карта.
	//Если ЗначениеЗаполнено(СтруктураНадписи.ДисконтнаяКарта) Тогда
	//	Если ПустаяСтрока(ТекстНадписи) Тогда
	//		ТекстНадписи = ТекстНадписи + НСтр("ka='%ДисконтнаяКарта%';ru='%ДисконтнаяКарта%';en='%Discount card%'");
	//	Иначе
	//		ТекстНадписи = ТекстНадписи + НСтр("ka='.%დიცკონტური რუკა%';ru=' • %ДисконтнаяКарта%'");
	//	КонецЕсли;
	//	ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ДисконтнаяКарта%", Строка(СтруктураНадписи.ПроцентСкидкиПоДисконтнойКарте)+"% по карте"); //СокрЛП(Строка(СтруктураНадписи.ДисконтнаяКарта)));
	//КонецЕсли;	
	
	// Налогообложение НДС
	Если ЗначениеЗаполнено(СтруктураНадписи.НалогообложениеНДС) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%НалогообложениеНДС%';ru='%НалогообложениеНДС%';en='% NalogooblozhenieNDS%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ka=' • %НалогообложениеНДС%';ru=' • %НалогообложениеНДС%'");
		КонецЕсли;
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%НалогообложениеНДС%", РаботаСФормойДокументаКлиентСервер.КраткоеПредставлениеТипаНалогообложенияНДС(СтруктураНадписи.НалогообложениеНДС));
	КонецЕсли;
	
	// Флаг сумма включает НДС
	Если ПустаяСтрока(ТекстНадписи) Тогда	
		Если СтруктураНадписи.СуммаВключаетНДС Тогда
			ТекстНадписи = НСтр("en='Include VAT';ka='თანხა შეიცავს დღგ-ს';ru='Сумма включает НДС'");
		Иначе
			ТекстНадписи = НСтр("ka='თანხა არ შეიცავს დღგ-ს';ru='Сумма не включает НДС';en='The sum does not include VAT'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстНадписи;
	
КонецФункции // СформироватьНадписьЦеныИВалюта()

&НаСервереБезКонтекста
Функция ПолучитьДоговорПоУмолчанию(Документ, Контрагент, Организация, ВидОперации)
	
	Если Контрагент.ВестиРасчетыПоДоговорам = Ложь Тогда
		Возврат Контрагент.ДоговорПоУмолчанию;
	КонецЕсли;
	
	МенеджерСправочника = Справочники.ДоговорыКонтрагентов;
	
	СписокВидовДоговоров = МенеджерСправочника.ПолучитьСписокВидовДоговораДляДокумента(Документ, ВидОперации);
	ДоговорПоУмолчанию = МенеджерСправочника.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(Контрагент, Организация, СписокВидовДоговоров);
	// Kuzmich, 19.08.2019, Использовать виды договоров, Доработка
	Если ЗначениеЗаполнено(ДоговорПоУмолчанию) И Константы.ИспользоватьВидыДоговоров.Получить() Тогда
		Если НЕ ДоговорПоУмолчанию.Покупатель Тогда
			ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	// Kuzmich, 19.08.2019, Использовать виды договоров, Доработка
	
	Возврат ДоговорПоУмолчанию;
	
КонецФункции
	
&НаКлиенте
Процедура ОбработатьИзменениеУсловийДоговора(ДанныеДоговора, ДоговорПередИзменением)
	
	//Объект.ОснованиеПечати = Нстр("ka='Договор: ';ru='Договор: '") + Строка(Объект.Договор);
	
	ВалютаРасчетовПередИзменением = ВалютаРасчетов;
	ВалютаРасчетов = ДанныеДоговора.ВалютаРасчетов;
	
	Если Не ДанныеДоговора.СуммаВключаетНДС = Неопределено Тогда
		Объект.СуммаВключаетНДС = ДанныеДоговора.СуммаВключаетНДС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда 
		Объект.Курс      = ?(ДанныеДоговора.ВалютаРасчетовКурсКратность.Курс = 0, 1, ДанныеДоговора.ВалютаРасчетовКурсКратность.Курс);
		Объект.Кратность = ?(ДанныеДоговора.ВалютаРасчетовКурсКратность.Кратность = 0, 1, ДанныеДоговора.ВалютаРасчетовКурсКратность.Кратность);
	КонецЕсли;
	
	ИзменилсяВидЦен = Объект.ВидЦен <> ДанныеДоговора.ВидЦен 	И ЗначениеЗаполнено(ДанныеДоговора.ВидЦен); 
	//
	//ИзменилсяВидСкидки = Объект.ВидСкидкиНаценки <> ДанныеДоговора.ВидСкидкиНаценки 
	//И ЗначениеЗаполнено(ДанныеДоговора.ВидСкидкиНаценки);
	
	//Если ДанныеДоговора.Свойство("ВызовИзПроцедурыПриИзмененииКонтрагента") Тогда
	//	ОчиститьДисконтнуюКарту = ЗначениеЗаполнено(Объект.ДисконтнаяКарта); // В дальнейшем реквизит ДисконтнаяКрата будет очищен.
	//Иначе
	//	ОчиститьДисконтнуюКарту = Ложь;
	//КонецЕсли;
	//
	//Если ОчиститьДисконтнуюКарту Тогда
	//	Объект.ДисконтнаяКарта = ПредопределенноеЗначение("Справочник.ДисконтныеКарты.ПустаяСсылка");
	//	Объект.ПроцентСкидкиПоДисконтнойКарте = 0;
	//КонецЕсли;
	//ПечатьДокументовУНФКлиент.ПриИзмененииДоговораКонтрагента(Объект.Договор, Объект.ОснованиеПечатиСсылка, Объект.ОснованиеПечати);
	
	ВопросВидЦен = ЗначениеЗаполнено(Объект.Договор) И (ИзменилсяВидЦен);
	Если ВопросВидЦен Тогда
		Если ИзменилсяВидЦен Тогда
			Объект.ВидЦен = ДанныеДоговора.ВидЦен;
		КонецЕсли; 
		//Если ИзменилсяВидСкидки Тогда
		//	Объект.ВидСкидкиНаценки = ДанныеДоговора.ВидСкидкиНаценки;
		//КонецЕсли; 
	КонецЕсли;
	
	ОткрытьФормуЦеныИВалюты = (ЗначениеЗаполнено(Объект.Договор) И ЗначениеЗаполнено(ВалютаРасчетов)
	И Объект.Договор <> ДоговорПередИзменением И ВалютаРасчетовПередИзменением <> ДанныеДоговора.ВалютаРасчетов)
	И Объект.ВалютаДокумента <> ДанныеДоговора.ВалютаРасчетов
	И Объект.Запасы.Количество() > 0;
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("ДоговорПередИзменением", ДоговорПередИзменением);
	ПараметрыДокумента.Вставить("ВалютаРасчетовПередИзменением", ВалютаРасчетовПередИзменением);
	ПараметрыДокумента.Вставить("ДанныеДоговора", ДанныеДоговора);
	
	Объект.ВалютаДокумента = ВалютаРасчетов;
	Если ОткрытьФормуЦеныИВалюты Тогда
		
		ТекстПредупреждения = "";
		Если ВопросВидЦен Тогда
			ТекстПредупреждения = НСтр("ka='კონტრაგენტთან ხელშეკრულება ითვალისწინებს ფასების და ფასდაკლებების პირობებს, რომლებიც დოკუმენტში დაყენებული პირობებისგან განსხვავდება! "
			"შეიძლება, საჭიროა ფასების გადავსება.';ru='Договор с контрагентом предусматривает условия цен и скидок, "
			"отличные от установленных в документе! "
			"Возможно, необходимо перезаполнить цены.'") + Символы.ПС + Символы.ПС;
		КонецЕсли;
		
		ТекстПредупреждения = ТекстПредупреждения + НСтр("ka='შეიცვალა კონტრაგენტთან ხელშეკრულებით გათვალისწინებული ანგარიშსწორების ვალუტა! აუცილებელია დოკუმენტის ვალუტის შემოწმება!';ru='Изменилась валюта расчетов по договору с контрагентом! "
		"Необходимо проверить валюту документа!'");
		
		ОбработатьИзмененияПоКнопкеЦеныИВалюты(ВалютаРасчетовПередИзменением, ИзменилсяВидЦен, Истина, ТекстПредупреждения);
		
	ИначеЕсли ВопросВидЦен Тогда
		
		//ПересчетНеобходим = (Объект.Запасы.Количество() > 0);
		ПересчетНеобходим = Истина ;
		
		СтруктураНадписи = 
		Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦен, НалогообложениеНДС, ", 
		Объект.ВалютаДокумента, 
		ВалютаРасчетов, 
		Объект.Курс, 
		КурсНациональнаяВалюта, 
		Объект.СуммаВключаетНДС, 
		УчетВалютныхОпераций, 
		Объект.ВидЦен, 
		//Объект.ВидСкидкиНаценки, 
		Объект.НалогообложениеНДС);
		
		ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
		
		Если ПересчетНеобходим Тогда
			
			ТекстВопроса = НСтр("ka='კონტრაგენტთან ხელშეკრულება ითვალისწინებს დოკუმენტში დადგენილისგან განსხვავებულ ფასების ! გადავთვალოთ დოკუმენტი ხელშეკრულების შესაბამისად?';ru='Договор с контрагентом предусматривает условия цен и скидок, отличные от установленных в документе! "
			"Пересчитать документ в соответствии с договором?'");
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПересчетаПоВидуЦенЗавершение", ЭтотОбъект, ПараметрыДокумента);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
		
	Иначе
		
		СтруктураНадписи = 
		Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦен, НалогообложениеНДС", 
		Объект.ВалютаДокумента, 
		ВалютаРасчетов, 
		Объект.Курс, 
		КурсНациональнаяВалюта, 
		Объект.СуммаВключаетНДС, 
		УчетВалютныхОпераций, 
		Объект.ВидЦен, 
		//Объект.ВидСкидкиНаценки, 
		Объект.НалогообложениеНДС);
		
		ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
		
		
	КонецЕсли;
			
		
		
КонецПроцедуры // ОбработатьИзменениеУсловийДоговора()

&НаКлиенте
Процедура ВопросПересчетаПоВидуЦенЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		УправлениеНебольшойФирмойКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтотОбъект, "Запасы", Истина);
		
	КонецЕсли;
	
КонецПроцедуры //

&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалюты(Знач ВалютаРасчетовПередИзменением, ПерезаполнитьЦены = Ложь, ПересчитатьЦены = Ложь, ТекстПредупреждения = "")
	
	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВалютаДокумента",		  Объект.ВалютаДокумента);
	СтруктураПараметров.Вставить("Курс",				  Объект.Курс);
	СтруктураПараметров.Вставить("Кратность",			  Объект.Кратность);
	СтруктураПараметров.Вставить("НалогообложениеНДС",	  Объект.НалогообложениеНДС);
	СтруктураПараметров.Вставить("СуммаВключаетНДС",	  Объект.СуммаВключаетНДС);
	СтруктураПараметров.Вставить("НДСВключатьВСтоимость", Объект.НДСВключатьВСтоимость);
	СтруктураПараметров.Вставить("Контрагент",			  Объект.Контрагент);
	СтруктураПараметров.Вставить("Договор",				  Объект.Договор);
	СтруктураПараметров.Вставить("Организация",			  Компания);
	СтруктураПараметров.Вставить("ДатаДокумента",		  Объект.Дата);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	  ПерезаполнитьЦены);
	СтруктураПараметров.Вставить("ПересчитатьЦены",		  ПересчитатьЦены);
	СтруктураПараметров.Вставить("БылиВнесеныИзменения",  Ложь);
	СтруктураПараметров.Вставить("ТекстПредупреждения",   ТекстПредупреждения);
	
	СтруктураПараметров.Вставить("ВидЦен", Объект.ВидЦен);
	СтруктураПараметров.Вставить("ОсновнаяСтавкаНДС",   Объект.ОсновнаяСтавкаНДС);   

	//
	//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю") Тогда
		СтруктураПараметров.Вставить("ВидСкидки", Неопределено);
		СтруктураПараметров.Вставить("ДисконтнаяКарта", Неопределено);
	//	//--------------------------------------------------------------------------
	//	// © Шишка В.В. [10 января 2022]  НАЧАЛО
	//	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	  ЗначениеЗаполнено(Объект.ДисконтнаяКарта));	
	//	// © Шишка В.В. [10 января 2022]  КОНЕЦ
	//	//--------------------------------------------------------------------------
	//КонецЕсли;
	
	//Открываем форму "Цены и Валюта".
	//Перезаполняем табличную часть "Затраты" если были внесены изменения в форме "Цены и Валюта".
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуЦеныИВалютаЗавершение", ЭтотОбъект, Новый Структура("ВалютаРасчетовПередИзменением", ВалютаРасчетовПередИзменением));
	ОткрытьФорму("ОбщаяФорма.ФормаЦеныИВалюта", СтруктураПараметров, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОбработатьИзмененияПоКнопкеЦеныИВалюты()

&НаКлиенте
Процедура ОткрытьФормуЦеныИВалютаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	СтруктураЦеныИВалюта = РезультатЗакрытия;
	ВалютаРасчетовПередИзменением = ДополнительныеПараметры.ВалютаРасчетовПередИзменением;
	
	Если ТипЗнч(СтруктураЦеныИВалюта) = Тип("Структура") И СтруктураЦеныИВалюта.БылиВнесеныИзменения Тогда
		
		Объект.ВидЦен = СтруктураЦеныИВалюта.ВидЦен;

		Объект.ВалютаДокумента = СтруктураЦеныИВалюта.ВалютаДокумента;
		Объект.Курс = СтруктураЦеныИВалюта.КурсРасчетов;
		Объект.Кратность = СтруктураЦеныИВалюта.КратностьРасчетов;
		Объект.НалогообложениеНДС = СтруктураЦеныИВалюта.НалогообложениеНДС;
		Объект.СуммаВключаетНДС = СтруктураЦеныИВалюта.СуммаВключаетНДС;
		Объект.НДСВключатьВСтоимость = СтруктураЦеныИВалюта.НДСВключатьВСтоимость;
		Объект.ОсновнаяСтавкаНДС = СтруктураЦеныИВалюта.ОсновнаяСтавкаНДС; //+++ Дмгг
		
		// Пересчитываем цены по виду цен.
		Если СтруктураЦеныИВалюта.ПерезаполнитьЦены Тогда
			УправлениеНебольшойФирмойКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтотОбъект, "Запасы", Истина);
		КонецЕсли;
		
		// Пересчитываем цены по валюте.
		Если НЕ СтруктураЦеныИВалюта.ПерезаполнитьЦены
			  И СтруктураЦеныИВалюта.ПересчитатьЦены Тогда	
			УправлениеНебольшойФирмойКлиент.ПересчитатьЦеныТабличнойЧастиПоВалюте(ЭтотОбъект, ВалютаРасчетовПередИзменением, "Запасы");
		КонецЕсли;
		
		// Пересчитываем сумму если изменился признак Налогообложение НДС.
		Если СтруктураЦеныИВалюта.НалогообложениеНДС <> СтруктураЦеныИВалюта.ПредНалогообложениеНДС Тогда
			ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
		КонецЕсли;
		
		// Пересчитываем сумму если изменился признак Налогообложение НДС. Дмгг
		Если СтруктураЦеныИВалюта.ОсновнаяСтавкаНДС <> СтруктураЦеныИВалюта.ПредОсновнаяСтавкаНДС Тогда
			ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
		КонецЕсли;
		
		// Пересчитываем сумму если изменился признак "Сумма включает НДС".
		Если НЕ СтруктураЦеныИВалюта.ПерезаполнитьЦены
			И НЕ СтруктураЦеныИВалюта.СуммаВключаетНДС = СтруктураЦеныИВалюта.ПредСуммаВключаетНДС Тогда
			ПересчитаемСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(ЭтотОбъект, "Запасы");
			//Если СтоимостьДоставкиСНДС<>0 Тогда
			//	ОбновитьСуммуНДСДоставкиПриРасчете();
			//КонецЕсли; 
		КонецЕсли;
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Предоплата Цикл
			СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
				СтрокаТабличнойЧасти.СуммаРасчетов,
				СтрокаТабличнойЧасти.Курс,
				?(Объект.ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Объект.Курс),
				СтрокаТабличнойЧасти.Кратность,
				?(Объект.ВалютаДокумента = НациональнаяВалюта, КратностьНациональнаяВалюта, Объект.Кратность));  
		КонецЦикла;	
	КонецЕсли;
	
	// Сформируем надпись цены и валюты.
	СтруктураНадписи = Новый Структура("ВидЦен, ВидСкидки, ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС, ОсновнаяСтавкаНДС", 
		Объект.ВидЦен, 
		Объект.ВидСкидкиНаценки, 
		Объект.ВалютаДокумента, 
		ВалютаРасчетов, 
		Объект.Курс, 
		КурсНациональнаяВалюта, 
		Объект.СуммаВключаетНДС, 
		УчетВалютныхОпераций, 
		Объект.НалогообложениеНДС,
		Объект.ОсновнаяСтавкаНДС);
		
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	
КонецПроцедуры // ОткрытьФормуЦеныИВалютаЗавершение()    

&НаКлиенте
Процедура РассчитатьСуммуСтрокиТабличнойЧасти(ФормаДокумента, СтрокаТабЧасти, ОбнулятьАвтоСкидки = Истина)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабЧасти.СтавкаНДС);
			
	Если ФормаДокумента.Объект.Свойство("СуммаВключаетНДС") Тогда
		
		Если СтрокаТабЧасти.Свойство("Цена") Тогда
			
			СтрокаТабЧасти.СуммаНДС = ?(
				ФормаДокумента.Объект.СуммаВключаетНДС, 
				СтрокаТабЧасти.Цена - (СтрокаТабЧасти.Цена) / ((СтавкаНДС + 100) / 100),
				СтрокаТабЧасти.Цена * СтавкаНДС / 100
			);
			СтрокаТабЧасти.Всего = СтрокаТабЧасти.Цена + ?(ФормаДокумента.Объект.СуммаВключаетНДС, 0, СтрокаТабЧасти.СуммаНДС);
			
		Иначе
			
			БазаРасчетаНДС = СтрокаТабЧасти.ТаможеннаяСтоимость + СтрокаТабЧасти.СуммаПошлины;
			
			СтрокаТабЧасти.СуммаНДС = ?(
				ФормаДокумента.Объект.СуммаВключаетНДС, 
				БазаРасчетаНДС - (БазаРасчетаНДС) / ((СтавкаНДС + 100) / 100),
				БазаРасчетаНДС * СтавкаНДС / 100
			);
			
		КонецЕсли;
		
	Иначе
		
		СтрокаТабЧасти.СуммаНДС = СтрокаТабЧасти.Цена * СтавкаНДС / 100;
		СтрокаТабЧасти.Всего = СтрокаТабЧасти.Цена + СтрокаТабЧасти.СуммаНДС;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПересчитаемСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(ФормаДокумента, ИмяТабличнойЧасти) Экспорт
	
	Для каждого СтрокаТабличнойЧасти Из ФормаДокумента.Объект[ИмяТабличнойЧасти] Цикл
		
		СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
		Если СтрокаТабличнойЧасти.Свойство("Цена") Тогда
			
			Если ФормаДокумента.Объект.СуммаВключаетНДС Тогда
				
				СтрокаТабличнойЧасти.Цена = (СтрокаТабличнойЧасти.Цена * (100 + СтавкаНДС)) / 100;
				
			Иначе
				
				СтрокаТабличнойЧасти.Цена = (СтрокаТабличнойЧасти.Цена * 100) / (100 + СтавкаНДС);
				
			КонецЕсли;
			
		КонецЕсли;
		
		РассчитатьСуммуСтрокиТабличнойЧасти(ФормаДокумента, СтрокаТабличнойЧасти);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоНалогообложениеНДС()
	
	СтавкаНДСПоУмолчанию = ?(ИспользоватьИсториюНалогообложенияКонтрагента, Объект.ОсновнаяСтавкаНДС, СтавкаНДСПоУмолчанию); //+++ Дмгг
	
	Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") Тогда
		
		Элементы.ЗапасыСтавкаНДС.Видимость = Истина;
		Элементы.ЗапасыСуммаНДС.Видимость = Истина;
		Элементы.ЗапасыВсего.Видимость = Истина;
			
		Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
			
			//Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС) Тогда
			//	СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
			//Иначе
			//	СтрокаТабличнойЧасти.СтавкаНДС = Объект.Организация.СтавкаНДСПоУмолчанию;
			//КонецЕсли;	
			
			Если ИспользоватьИсториюНалогообложенияКонтрагента Тогда
				СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
			ИначеЕсли ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС) Тогда
				СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
			Иначе
				СтрокаТабличнойЧасти.СтавкаНДС = Объект.Организация.СтавкаНДСПоУмолчанию;
			КонецЕсли;	

			
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
			СтрокаТабличнойЧасти.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
									  		СтрокаТабличнойЧасти.Цена - (СтрокаТабличнойЧасти.Цена) / ((СтавкаНДС + 100) / 100),
									  		СтрокаТабличнойЧасти.Цена * СтавкаНДС / 100);
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Цена + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
			
		КонецЦикла;	
		
	Иначе
		
		Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
		Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
		Элементы.ЗапасыВсего.Видимость = Ложь;
		
		Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС") Тогда
			СтавкаНДСПоУмолчанию = ?(ИспользоватьИсториюНалогообложенияКонтрагента, СтавкаНДСПоУмолчанию, УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС());
		Иначе
			СтавкаНДСПоУмолчанию = ?(ИспользоватьИсториюНалогообложенияКонтрагента, СтавкаНДСПоУмолчанию, УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС());
		КонецЕсли;	
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл	
			СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
			СтрокаТабличнойЧасти.СуммаНДС = 0;		
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Цена;		
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоНалогообложениеНДС()	

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("СтавкаЛицензии", СтруктураДанные.Номенклатура.СтавкаЛицензии);

	Если СтруктураДанные.Свойство("НалогообложениеНДС") 
		И НЕ СтруктураДанные.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		
		Если СтруктураДанные.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
			СтруктураДанные.Вставить("СтавкаНДС", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС());
		Иначе
			СтруктураДанные.Вставить("СтавкаНДС", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль());
		КонецЕсли;
	
	ИначеЕсли ЗначениеЗаполнено(СтруктураДанные.Номенклатура.СтавкаНДС) Тогда
		СтруктураДанные.Вставить("СтавкаНДС", СтруктураДанные.Номенклатура.СтавкаНДС);
	Иначе
		СтруктураДанные.Вставить("СтавкаНДС", СтруктураДанные.Организация.СтавкаНДСПоУмолчанию);
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("ВидЦен") Тогда
		Цена = УправлениеНебольшойФирмойСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
		СтруктураДанные.Вставить("ЦенаПоВидЦен", Цена);
	Иначе
		СтруктураДанные.Вставить("ЦенаПоВидЦен", 0);
	КонецЕсли;
			
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти()
	
	СтрокаТабличнойЧасти = Элементы.Лицензии.ТекущиеДанные;
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Цена + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуНДС(СтрокаТабличнойЧасти)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);	
	СтрокаТабличнойЧасти.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
	СтрокаТабличнойЧасти.Цена - (СтрокаТабличнойЧасти.Цена) / ((СтавкаНДС + 100) / 100),
	СтрокаТабличнойЧасти.Цена * СтавкаНДС / 100);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвалФормы()
	
	ИтогВсего = Объект.Запасы.Итог("Всего");
	ИтогСуммаНДС = Объект.Запасы.Итог("СуммаНДС");
		
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьИзменениеДоговора()
	
	ДоговорПередИзменением = Договор;
	Договор = Объект.Договор;
	
	Если ДоговорПередИзменением <> Объект.Договор Тогда
		
		//ОчиститьОснованиеПриИзменениеКонтрагентаДоговора();	
		
		ОбработатьИзменениеДоговораФрагмент(ДоговорПередИзменением);
		
		//УстановитьВидимостьПоНДФЛ();//Паганини
		
	Иначе
		
		Объект.Договор = Договор; // Восстанавливаем автоматически очищеный договор.
		//УстановитьВидимостьПоНДФЛ();//Паганини
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеДоговораФрагмент(ДоговорПередИзменением)
	
	СтруктураДанные = ПолучитьДанныеДоговорПриИзменении(Объект.Дата, Объект.ВалютаДокумента, Объект.Договор);
	
	
	Объект.ВидЦен = СтруктураДанные.ВидЦен;
	ВидыЦенПередИзменением  = ВидЦен ;
	//ВидЦен = Объект.ВидЦен ; 
	////--- Lazare_13.04.2021
	
	//+++ Дмгг
	НалогообложениеПередИзменением = Объект.НалогообложениеНДС;
	Объект.НалогообложениеНДС = СтруктураДанные.НалогообложениеСтавка.НалогообложениеНДС;
	//--- Дмгг
	
	ВалютаРасчетовПередИзменением = ВалютаРасчетов;
	ВалютаРасчетов = СтруктураДанные.ВалютаРасчетов;
	
	//Если НЕ СтруктураДанные.СуммаВключаетНДС = Неопределено Тогда
	//	Объект.СуммаВключаетНДС = СтруктураДанные.СуммаВключаетНДС;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда 
		Объект.Курс      = ?(СтруктураДанные.ВалютаРасчетовКурсКратность.Курс = 0, 1, СтруктураДанные.ВалютаРасчетовКурсКратность.Курс);
		Объект.Кратность = ?(СтруктураДанные.ВалютаРасчетовКурсКратность.Кратность = 0, 1, СтруктураДанные.ВалютаРасчетовКурсКратность.Кратность);
	КонецЕсли;
	//
	//ИзменилсяВидЦен = Объект.ВидЦенКонтрагента <> СтруктураДанные.ВидЦенКонтрагента 
	//И ЗначениеЗаполнено(СтруктураДанные.ВидЦенКонтрагента) И СтруктураДанные.УчетЦенКонтрагентов;
	НовыйДоговорИВалютаРасчетов = ЗначениеЗаполнено(Объект.Договор) И ЗначениеЗаполнено(ВалютаРасчетов); 
	//И Объект.Договор <> ДоговорПередИзменением И ВалютаРасчетовПередИзменением <> СтруктураДанные.ВалютаРасчетов;
	ОткрытьФормуЦеныИВалюты = НовыйДоговорИВалютаРасчетов И Объект.ВалютаДокумента <> СтруктураДанные.ВалютаРасчетов;
	//И (Объект.Запасы.Количество() > 0 ИЛИ Объект.Расходы.Количество() > 0);
	//
	//СтруктураДанные.Вставить("ИзменилсяВидЦен", ИзменилсяВидЦен);
	//
	//Заказ = Объект.Заказ;
	
	//Если ИзменилсяВидЦен Тогда
	//	
	//	Объект.ВидЦенКонтрагента = СтруктураДанные.ВидЦенКонтрагента;
	//	Если ЗначениеЗаполнено(Объект.ВидЦенКонтрагента) Тогда
	//		
	//		Объект.РегистрироватьЦеныПоставщика = Истина;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	Объект.ВалютаДокумента = СтруктураДанные.ВалютаРасчетов;
	
	//
	//Если ОткрытьФормуЦеныИВалюты Тогда
	//	
	//	ТекстПредупреждения = "";
	//	
	//	//Если ИзменилсяВидЦен Тогда
	//	//	ТекстПредупреждения = НСтр("ka='კონტრაგენტთან ხელშეკრულება ითვალისწინებს ფასების და ფასდაკლებების პირობებს, რომლებიც დოკუმენტში დაყენებული პირობებისგან განსხვავდება! "
	//	//	"შეიძლება, საჭიროა ფასების გადავსება.';ru='Договор с контрагентом предусматривает условия цен и скидок, "
	//	//	"отличные от установленных в документе! "
	//	//	"Возможно, необходимо перезаполнить цены.'") + Символы.ПС + Символы.ПС;
	//	//КонецЕсли;
	//	
	//	ТекстПредупреждения = ТекстПредупреждения + НСтр("ka='შეიცვალა კონტრაგენტთან ხელშეკრულებით გათვალისწინებული ანგარიშსწორების ვალუტა! აუცილებელია დოკუმენტის ვალუტის შემოწმება!';ru='Изменилась валюта расчетов по договору с контрагентом!"
	//	"Необходимо проверить валюту документа!'");
	//	//ОбработатьИзмененияПоКнопкеЦеныИВалюты(ВалютаРасчетовПередИзменением, Истина, ИзменилсяВидЦен, ТекстПредупреждения);
	//	
	//ИначеЕсли ЗначениеЗаполнено(Объект.Договор) 
	//	И ИзменилсяВидЦен Тогда
	//	
	//	ПересчетНеобходим = (Объект.Запасы.Количество() > 0);
	//	
	//	Объект.ВидЦенКонтрагента	= СтруктураДанные.ВидЦенКонтрагента;
	//	СтруктураНадписи 			= 
	//	Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦенКонтрагента, НалогообложениеНДС,ВидЦен", 
	//	Объект.ВалютаДокумента, 
	//	ВалютаРасчетов, 
	//	Объект.Курс, 
	//	КурсНациональнаяВалюта, 
	//	Объект.СуммаВключаетНДС, 
	//	УчетВалютныхОпераций, 
	//	Объект.ВидЦенКонтрагента, 
	//	Объект.НалогообложениеНДС,
	//	Объект.ВидЦен);
	//	
	//	ЦеныИВалюта 				= СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	//	
	//	Если ПересчетНеобходим Тогда
	//		
	//		Сообщение = НСтр("ka='კონტრაგენტთან ხელშეკრულება ითვალისწინებს დოკუმენტში დადგენილისგან განსხვავებულ ფასების ტიპს! გადავთვალოთ დოკუმენტი ხელშეკრულების შესაბამისად?';ru='Договор с контрагентом предусматривает вид цен, отличный от установленного в документе! "
	//		"Пересчитать документ в соответствии с договором?'");
	//		
	//		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьИзменениеДоговораФрагментЗавершение", ЭтотОбъект, Новый Структура("ДоговорПередИзменением, ВалютаРасчетовПередИзменением, СтруктураДанные", ДоговорПередИзменением, ВалютаРасчетовПередИзменением, СтруктураДанные)), 
	//		Сообщение,
	//		РежимДиалогаВопрос.ДаНет
	//		);
	//		Возврат;
	//		
	//	КонецЕсли;
	//	
	//Иначе
	//	
	//	СтруктураНадписи 			= 
	//	Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦенКонтрагента, НалогообложениеНДС,ВидЦен", 
	//	Объект.ВалютаДокумента, 
	//	ВалютаРасчетов, 
	//	Объект.Курс, 
	//	КурсНациональнаяВалюта, 
	//	Объект.СуммаВключаетНДС, 
	//	УчетВалютныхОпераций, 
	//	Объект.ВидЦенКонтрагента, 
	//						Объект.НалогообложениеНДС,
	//						Объект.ВидЦен);
	//	
	//	ЦеныИВалюта 				= СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	//	
	//КонецЕсли;
	
	//+++ Дмгг
	Если НалогообложениеПередИзменением = Объект.НалогообложениеНДС Тогда
		//ПересчитатьСуммыТЧ(Объект.НалогообложениеНДС, Объект.СуммаВключаетНДС);
	КонецЕсли;
	//--- Дмгг
	
	
	//ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеДоговорПриИзменении(Дата, ВалютаДокумента, Договор)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетов",
		Договор.ВалютаРасчетов
	);
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетовКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Договор.ВалютаРасчетов))
	);
	
	СтруктураДанные.Вставить(
		"РасчетыВУсловныхЕдиницах",
		Договор.РасчетыВУсловныхЕдиницах
	);
	
	СтруктураДанные.Вставить(
		"ВидЦенКонтрагента",
		Договор.ВидЦенКонтрагента
	);
	
	СтруктураДанные.Вставить(
		"СуммаВключаетНДС",
		?(ЗначениеЗаполнено(Договор.ВидЦенКонтрагента), Договор.ВидЦенКонтрагента.ЦенаВключаетНДС, Неопределено)
	);
	
	СтруктураДанные.Вставить(
		"УчетЦенКонтрагентов",
		ПолучитьФункциональнуюОпцию("УчетЦенКонтрагентов")
	);
	
	//+++ Двгг
	Если ПолучитьФункциональнуюОпцию("ФункциональнаяОпцияИспользоватьИсториюНалогообложенияКонтрагентов") Тогда
		СтруктураДанные.Вставить(
			"НалогообложениеСтавка",
			РегистрыСведений.НалогообложениеКонтрагентов.ПолучитьПоследнее(Дата, Новый Структура("Контрагент,Договор", Договор.Владелец, Договор))
			);
	Иначе
		СтруктураДанные.Вставить(
			"НалогообложениеСтавка", Новый Структура("НалогообложениеНДС",Договор.Владелец.НалогообложениеНДС));
	КонецЕсли;
	//--- Дмгг
	
		
	//+++ Lazare_13.04.2021
	СтруктураДанные.Вставить(
		"ВидЦен",
		Договор.ВидЦен);
	//--- Lazare_13.04.2021
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДоговорПриИзменении()


#КонецОбласти

&НаКлиенте
Процедура РедактироватьЗачетПредоплаты(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПоказатьПредупреждение(, НСтр("ka='დასაწყისში მიუთითეთ კონტრაგენტი!';ru='Укажите вначале контрагента!';en='Specify the first contractor!'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
		ПоказатьПредупреждение(, НСтр("ka='დასაწყისში მიუთითეთ კონტრაგენტის ხელშეკრულება!';ru='Укажите вначале договор контрагента!';en='Specify the first contract counterparty!'"));
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	
	АдресПредоплатаВХранилище = ПоместитьПредоплатаВХранилище();
	ПараметрыПодбора = Новый Структура(
		"АдресПредоплатаВХранилище,
		|Подбор,
		|ЕстьЗаказ,
		|ЗаказВШапке,
		|Компания,
		|Заказ,
		|Дата,
		|Ссылка,
		|Контрагент,
		|Договор,
		|Курс,
		|Кратность,
		|ВалютаДокумента,
		|СуммаДокумента",
		АдресПредоплатаВХранилище, // АдресПредоплатаВХранилище
		( Истина), // Подбор
		Ложь,//ЕстьЗаказ
		истина,
		Компания, // Компания
		Неопределено,
		Объект.Дата, // Дата
		Объект.Ссылка, // Ссылка
		Объект.Контрагент, // Контрагент
		Объект.Договор, // Договор
		Объект.Курс, // Курс
		Объект.Кратность, // Кратность
		Объект.ВалютаДокумента, // ВалютаДокумента
		Объект.Запасы.Итог("Всего")
		//--------------------------------------------------------------------------
		);
	
	//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика")
	//	ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ЗакупкаКапитальныхЗатрат") Тогда
	КодВозврата = Неопределено;
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораАвансовПокупателей", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("РедактироватьЗачетПредоплатыЗавершение1", ЭтотОбъект, Новый Структура("АдресПредоплатаВХранилище, ПараметрыПодбора", АдресПредоплатаВХранилище, ПараметрыПодбора)));

	Возврат;
	//ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя") Тогда
	//	ОткрытьФорму("ОбщаяФорма.ФормаПодбораАвансовПокупателей", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("РедактироватьЗачетПредоплатыЗавершение", ЭтотОбъект, Новый Структура("АдресПредоплатаВХранилище", АдресПредоплатаВХранилище)));
	//    Возврат;
	//КонецЕсли;
	
	РедактироватьЗачетПредоплатыФрагмент1(АдресПредоплатаВХранилище, КодВозврата);
		
КонецПроцедуры

&НаСервере
Функция ПоместитьПредоплатаВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.Предоплата.Выгрузить(,
			"Документ,
			|Заказ,
			|СуммаРасчетов,
			|Курс,
			|Кратность,
			|СуммаПлатежа"),
		УникальныйИдентификатор
	);
	
КонецФункции // ПоместитьПредоплатаВХранилище()

&НаКлиенте
Процедура РедактироватьЗачетПредоплатыЗавершение1(Результат, ДополнительныеПараметры) Экспорт
    
    АдресПредоплатаВХранилище = ДополнительныеПараметры.АдресПредоплатаВХранилище;
    ПараметрыПодбора = ДополнительныеПараметры.ПараметрыПодбора;
   
    КодВозврата = Результат;
    
    РедактироватьЗачетПредоплатыФрагмент1(АдресПредоплатаВХранилище, КодВозврата);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗачетПредоплатыФрагмент1(Знач АдресПредоплатаВХранилище, Знач КодВозврата)
    
    РедактироватьЗачетПредоплатыФрагмент(АдресПредоплатаВХранилище, КодВозврата);

КонецПроцедуры


&НаКлиенте
Процедура РедактироватьЗачетПредоплатыФрагмент(Знач АдресПредоплатаВХранилище, Знач КодВозврата)
    
	//Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика")
	//    ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя")
	//	ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ЗакупкаКапитальныхЗатрат")) //+++ Дмгг
	//    И (КодВозврата = КодВозвратаДиалога.OK) Тогда
        ПолучитьПредоплатаИзХранилища(АдресПредоплатаВХранилище);
	//КонецЕсли;

КонецПроцедуры // РедактироватьЗачетПредоплаты()

&НаСервере
Процедура ПолучитьПредоплатаИзХранилища(АдресПредоплатаВХранилище)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресПредоплатаВХранилище);
	Объект.Предоплата.Загрузить(ТаблицаДляЗагрузки);
	
	////+++ Дмгг
	//// Прошу прощения за жтот костыль
	//Для Каждого Строк из Объект.Предоплата Цикл 
	//	
	//	СтуктураЗаполнения = ПолучитьСтавкиНаСервере(Строк.СуммаРасчетов);
	//	Строк.СуммаНДФЛ = СтуктураЗаполнения.СуммаНДФЛ;
	//	Строк.СуммаПФ = СтуктураЗаполнения.СуммаПФ;
	//	
	//КонецЦикла;
	////--- Дмгг
	
	Элементы.ГруппаПредоплата.Заголовок = РаботаСФормойДокументаКлиентСервер.ПолучитьЗаголовокПредоплаты(Объект.Предоплата, Объект.ВалютаДокумента);
	
КонецПроцедуры // ПолучитьПредоплатаИзХранилища()

&НаКлиенте
Процедура РассчитатьОстаточнаяСтоимость(Команда)  
	РассчитатьОстаточнаяСтоимостьНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьОстаточнаяСтоимостьНаСервере()
	
	Для Каждого Ст из Объект.Запасы Цикл 	
		
		//ДокументМоментВремени = Новый Граница(Объект.Ссылка, ВидГраницы.Включая); 
		
		//СебестоимостьОстаток = РегистрыНакопления.Лизензии.Остатки(Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Включая),Новый Структура("Номенклатура,Организация",Ст.Номенклатура,Объект.Организация));
		
		СебестоимостьОстаток = РегистрыНакопления.Лицензии.Остатки(Объект.Дата,Новый Структура("Номенклатура,Организация",Ст.Номенклатура,Объект.Организация));

		Если СебестоимостьОстаток.Количество()>0 Тогда 
			Ст.ОстаточнаяСтоимость =  СебестоимостьОстаток[0].Себестоимость;  
			Ст.СписываетсяСебестоимость = Ст.ОстаточнаяСтоимость *  Ст.СтавкаЛицензии.Ставка /100; 
		Иначе 
			Ст.ОстаточнаяСтоимость = 0; 
			Ст.СписываетсяСебестоимость = 0;
		КонецЕсли;  
	КонецЦикла;     
	
КонецПроцедуры  

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если не Объект.Проведен Тогда     //и не ЗначениеЗаполнено(Объект.Ссылка)
		НомерСтроки = "";	
		Для Каждого Ст из Объект.Запасы Цикл 
			Если ПолучитьСтавкуЛицензии(Ст.СтавкаЛицензии) = 100 Тогда  
				НомерСтроки = НомерСтроки + Ст.НомерСтроки + ",";
			КонецЕсли;		
		КонецЦикла;        
		
		Если ЗначениеЗаполнено(НомерСтроки) Тогда 
			Режим = РежимДиалогаВопрос.ДаНет;  
			Ответ = Вопрос(НСтр("ru = ' სტრიქონში არსებული ლიცენზიის თვითღირებულება განულდება, გსურთ დოკუმენტის გატარება?'; ka = ' სტრიქონში არსებული ლიცენზიის თვითღირებულება განულდება, გსურთ დოკუმენტის გატარება?'" ), Режим, 0); 
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Отказ = Истина;  
			КонецЕсли		
		КонецЕсли		
	КонецЕсли;  
		
КонецПроцедуры
   

Функция ПолучитьСтавкуЛицензии(Лицензия)
	Возврат Лицензия.Ставка;	
КонецФункции

&НаКлиенте
Процедура ЗапасыСтавкаЛицензииПриИзменении(Элемент)
	РассчитатьОстаточнаяСтоимостьНаСервере();
КонецПроцедуры
