
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.ПредопределенныеЭлементыДляРасширений.WordPress_ГруппаДляНовыхКонтрагентов") 
		ИЛИ Запись.Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.ПредопределенныеЭлементыДляРасширений.Shopif_ГруппаНовыхКонтрагентов") Тогда 
		
		Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
		
	ИначеЕсли Запись.Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.ПредопределенныеЭлементыДляРасширений.WordPress_Consumer_secret") 
		ИЛИ Запись.Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.ПредопределенныеЭлементыДляРасширений.WordPress_Consumer_key") 
		ИЛИ Запись.Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.ПредопределенныеЭлементыДляРасширений.Shopify_Token") Тогда
		
		Элементы.Значение.РежимПароля = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
