
&Вместо("ПолучитьСписокВидовОперацийРасходДСБанк")
Функция РасшAzRy_ПолучитьСписокВидовОперацийРасходДСБанк()
	// Вставить содержимое метода.
	Результат = ПродолжитьВызов();
	Результат.Добавить(Перечисления.ВидыОперацийРасходСоСчета.AzRyПоставщикуПодотчетнику, НСтр("ru = '(AzRy) Поставщику подотчетнику'; ka = '(AzRy) მომწოდებელს (ანგარიშვალდებული პირი)'"));
	Возврат Результат;
КонецФункции

&Вместо("ПолучитьСписокВидовОперацийПоступленияДСБанк")
Функция РасшAzRy_ПолучитьСписокВидовОперацийПоступленияДСБанк()
	// Вставить содержимое метода.
	Результат = ПродолжитьВызов();
	Результат.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.AzRyОтПоставщикаОтПодотчетника, НСтр("ru = '(AzRy) От поставщика от подотчетника'; ka = '(AzRy) მომწოდებლისგან (საქვეანგარიშო პირისგან)'"));
	Возврат Результат;
КонецФункции