
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ДатаНач = ?(СхемаКомпоновкиДанных.Параметры.СтПериод.Значение.ДатаНачала = Дата(1,1,1), Дата(1980,1,1), СхемаКомпоновкиДанных.Параметры.СтПериод.Значение.ДатаНачала);
	ДатаКон = ?(СхемаКомпоновкиДанных.Параметры.СтПериод.Значение.ДатаОкончания = Дата(1,1,1), Дата(2999,1,1), СхемаКомпоновкиДанных.Параметры.СтПериод.Значение.ДатаОкончания);
	СхемаКомпоновкиДанных.Параметры.КонецПериода.Значение = ДатаКон;
	СхемаКомпоновкиДанных.Параметры.НачалоПериода.Значение = ДатаНач;
	СхемаКомпоновкиДанных.Параметры.Период.Значение = ДатаНач;
	
	ОтчетыУНФ.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры
