
&Вместо("ДобавитьОтчетВИсторию")
Процедура РасшAzRy_ДобавитьОтчетВИсторию(Вариант)
	
	История = ХранилищеСистемныхНастроек.Загрузить("СписокОтчетов", "История");
	Если НЕ ТипЗнч(История)=Тип("Массив") Тогда
		//Очищаем пустые строки и восстанавливаем историю
		История = Новый Массив;
	КонецЕсли;
	
	Индекс = История.Найти(Вариант);
	Если НЕ Индекс=Неопределено Тогда
		История.Удалить(Индекс);
	КонецЕсли; 
	История.Вставить(0, Вариант);
	
	// დროებით დაკომენტირდა - გასარკვევია გიგას როლი შეცდომას აგდებს
	//ХранилищеСистемныхНастроек.Сохранить("СписокОтчетов", "История", История);	
	
КонецПроцедуры
