// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаДругиеВидыОтсутствия, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =   
		"ВЫБРАТЬ
		|	КурсыВалютРасчетов.Валюта,
		|	КурсыВалютРасчетов.Курс,
		|	КурсыВалютРасчетов.Кратность
		|ПОМЕСТИТЬ КурсыВалютРасчетов
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаДокумента) КАК КурсыВалютРасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КурсыВалютУчета.Валюта,
		|	КурсыВалютУчета.Курс,
		|	КурсыВалютУчета.Кратность
		|ПОМЕСТИТЬ КурсыВалютУчета
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДругиеВидыОтсутствияСотрудники.Ссылка.Ссылка КАК Регистратор,
		|	ДругиеВидыОтсутствияСотрудники.Ссылка.Номер КАК Номер,
		|	ДругиеВидыОтсутствияСотрудники.Ссылка.Дата КАК Период,
		|	ДругиеВидыОтсутствияСотрудники.Ссылка.Автор КАК Автор,
		|	ДругиеВидыОтсутствияСотрудники.Ссылка.Организация КАК Организация,
		|	ДругиеВидыОтсутствияСотрудники.НомерСтроки КАК НомерСтроки,
		|	ДругиеВидыОтсутствияСотрудники.Сотрудник КАК Сотрудник,
		|	ДругиеВидыОтсутствияСотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ДругиеВидыОтсутствияСотрудники.ВидДругогоОтсутствия КАК ВидДругогоОтсутствия,
		|	ДругиеВидыОтсутствияСотрудники.ДатаНачала КАК ДатаНачала,
		|	ДругиеВидыОтсутствияСотрудники.ДатаОкончания КАК ДатаОкончания,
		|	ДругиеВидыОтсутствияСотрудники.КоличествоДней КАК КоличествоДней,
		|	ДругиеВидыОтсутствияСотрудники.Ссылка.ВалютаДокумента КАК ВалютаДокумента
		|ПОМЕСТИТЬ ВременнаяТаблицаСотрудники
		|ИЗ
		|	Документ.ДругиеВидыОтсутствия.Сотрудники КАК ДругиеВидыОтсутствияСотрудники
		|ГДЕ
		|	ДругиеВидыОтсутствияСотрудники.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаСотрудники.Регистратор КАК Регистратор,
		|	ВременнаяТаблицаСотрудники.Номер КАК Номер,
		|	ВременнаяТаблицаСотрудники.Период КАК Период,
		|	ВременнаяТаблицаСотрудники.Автор КАК Автор,
		|	ВременнаяТаблицаСотрудники.Организация КАК Организация,
		|	ВременнаяТаблицаСотрудники.НомерСтроки КАК НомерСтроки,
		|	ВременнаяТаблицаСотрудники.Сотрудник КАК Сотрудник,
		|	ВременнаяТаблицаСотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ДругиеВидыОтсутствияНачисления.ВидНачисленияУдержания КАК ВидНачисленияУдержания,               
		|	ВЫРАЗИТЬ(СУММА(ДругиеВидыОтсутствияНачисления.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность)) КАК ЧИСЛО(15,2)) КАК Сумма,
		|	СУММА(ДругиеВидыОтсутствияНачисления.Сумма) КАК СуммаВал,
		|	ВременнаяТаблицаСотрудники.ВалютаДокумента КАК Валюта
		|ПОМЕСТИТЬ ВременнаяТаблицаНачисления
		|ИЗ
		|	ВременнаяТаблицаСотрудники КАК ВременнаяТаблицаСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДругиеВидыОтсутствия.Начисления КАК ДругиеВидыОтсутствияНачисления
		|		ПО ВременнаяТаблицаСотрудники.Сотрудник = ДругиеВидыОтсутствияНачисления.Сотрудник 
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютУчета КАК КурсыВалютУчета
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютРасчетов КАК КурсыВалютРасчетов
		|		ПО ДругиеВидыОтсутствияНачисления.Ссылка.ВалютаДокумента = КурсыВалютРасчетов.Валюта
		|ГДЕ
		|	ДругиеВидыОтсутствияНачисления.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДругиеВидыОтсутствияНачисления.ВидНачисленияУдержания,
		|	ВременнаяТаблицаСотрудники.Регистратор,
		|	ВременнаяТаблицаСотрудники.Номер,
		|	ВременнаяТаблицаСотрудники.Период,
		|	ВременнаяТаблицаСотрудники.Автор,
		|	ВременнаяТаблицаСотрудники.Организация,
		|	ВременнаяТаблицаСотрудники.НомерСтроки,
		|	ВременнаяТаблицаСотрудники.Сотрудник,
		|	ВременнаяТаблицаСотрудники.СтруктурнаяЕдиница,
		|	ВременнаяТаблицаСотрудники.ВалютаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаСотрудники.Регистратор КАК Регистратор,
		|	ВременнаяТаблицаСотрудники.Номер КАК Номер,
		|	ВременнаяТаблицаСотрудники.Период КАК Период,
		|	ВременнаяТаблицаСотрудники.Автор КАК Автор,
		|	ВременнаяТаблицаСотрудники.Организация КАК Организация,
		|	ВременнаяТаблицаСотрудники.НомерСтроки КАК НомерСтроки,
		|	ВременнаяТаблицаСотрудники.Сотрудник КАК Сотрудник,
		|	ВременнаяТаблицаСотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ДругиеВидыОтсутствияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
		|	ВЫРАЗИТЬ(СУММА(ДругиеВидыОтсутствияУдержания.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность)) КАК ЧИСЛО(15,2)) КАК Сумма,
		|	СУММА(ДругиеВидыОтсутствияУдержания.Сумма) КАК СуммаВал,
		|	ВременнаяТаблицаСотрудники.ВалютаДокумента КАК Валюта
		|ПОМЕСТИТЬ ВременнаяТаблицаУдержание
		|ИЗ
		|	ВременнаяТаблицаСотрудники КАК ВременнаяТаблицаСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДругиеВидыОтсутствия.Удержания КАК ДругиеВидыОтсутствияУдержания
		|		ПО ВременнаяТаблицаСотрудники.Сотрудник = ДругиеВидыОтсутствияУдержания.Сотрудник 
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютУчета КАК КурсыВалютУчета
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютРасчетов КАК КурсыВалютРасчетов
		|		ПО ДругиеВидыОтсутствияУдержания.Ссылка.ВалютаДокумента = КурсыВалютРасчетов.Валюта
		|ГДЕ
		|	ДругиеВидыОтсутствияУдержания.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДругиеВидыОтсутствияУдержания.ВидНачисленияУдержания,
		|	ВременнаяТаблицаСотрудники.Регистратор,
		|	ВременнаяТаблицаСотрудники.Номер,
		|	ВременнаяТаблицаСотрудники.Период,
		|	ВременнаяТаблицаСотрудники.Организация,
		|	ВременнаяТаблицаСотрудники.Автор,
		|	ВременнаяТаблицаСотрудники.НомерСтроки,
		|	ВременнаяТаблицаСотрудники.Сотрудник,
		|	ВременнаяТаблицаСотрудники.СтруктурнаяЕдиница,
		|	ВременнаяТаблицаСотрудники.ВалютаДокумента";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаДругиеВидыОтсутствия);   
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВалютаДокумента", ДокументСсылкаДругиеВидыОтсутствия.ВалютаДокумента);
	Запрос.УстановитьПараметр("ВалютаУчета", УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета"));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();     
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаОдноразовыеНачисленияУдержанияОтпуска(ДокументСсылкаДругиеВидыОтсутствия, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаДругиеВидыОтсутствия(ДокументСсылкаДругиеВидыОтсутствия, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИнтерфейсПечати

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Приказ_Т5");
	//Если ПечатнаяФорма <> Неопределено Тогда
	//	
	//	ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
	//	ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КадровоеПеремещение_Т5";
	//	ПечатнаяФорма.ПолныйПутьКМакету = "Документ.КадровоеПеремещение.ПФ_MXL_Т5";
	//	ПечатнаяФорма.СинонимМакета = НСтр("ka='Т-5 (Приказ о переводе)';ru='Т-5 (Приказ о переводе)';en='T-5 (transfer order)'");
	//	
	//	СформироватьКадровыйПриказ(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
	//	
	//КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли