
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	Для Каждого Док Из ПараметрКоманды Цикл
		//Паганини#OneSoft_
		//ЗначенияРеквизитов = РС_ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Док, "Статус,Аванс");
		ЗначенияРеквизитов = ПроверкаДляКорректировачнойСчетФактуры(Док);
		Если ЗначенияРеквизитов = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		//_Паганини#OneSoft
		ТекСтатус 	= ЗначенияРеквизитов.Статус;
		Аванс 		= ЗначенияРеквизитов.Аванс;
		Если ТекСтатус = ПредопределенноеЗначение("Перечисление.СтатусыСФ.Отправленная") Тогда
			Сообщить("შეუძლებელია შენახვა. "+Док+" უკვე გადაგზავნილია!");
			Продолжить;
		КонецЕсли;
		ИдентификаторСФ = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтправитьШапкуДокументаНаПортале(Док);
		Если ИдентификаторСФ = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		//Паганини#OneSoft_
		Если ЗначенияРеквизитов.Корректировочная Тогда
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбновитьСтатусСФ(ЗначенияРеквизитов.ОснованиеКорректировки);
		КонецЕсли;
		//_Паганини#OneSoft
		
		Если Аванс Тогда
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтправитьСписокДокументовАвансаНаПортале(Док, ИдентификаторСФ);
		Иначе
			Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтправитьСписокНакладныхНаПортале(Док, ИдентификаторСФ) = Неопределено Тогда
				ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтправитьСписокНоменклатуриНаПортале(Док, ИдентификаторСФ);	
			КонецЕсли;
		КонецЕсли;
		
	    ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбновитьИдентификаторИСтатусДокументаСФ(Док, ИдентификаторСФ, 0);
		ОповеститьОбИзменении(Док);
	КонецЦикла;
	
	Оповестить("ПерепрочитатьФорму");
	Состояние(НСтр("ka='RS.GE-ს სერვერთან მუშაობა დასრულებულია';ru='Работа с сервером RS.GE завершена';en='Working with server RS.GE completed'"));	
	
КонецПроцедуры

&НаСервере
Функция ПроверкаДляКорректировачнойСчетФактуры(Док)
	
	ЗначенияРеквизитов = Новый Структура;
	ЗначенияРеквизитов.Вставить("Статус",	Док.Статус);
	ЗначенияРеквизитов.Вставить("Аванс",	Док.Аванс);
	ЗначенияРеквизитов.Вставить("Корректировочная",	Док.Корректировочная);
	
	Если Док.Корректировочная Тогда
		ОснованиеКорректировки = Док.ОснованиеКорректировки;
		ЗначенияРеквизитов.Вставить("ОснованиеКорректировки", ОснованиеКорректировки);
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбновитьСтатусСФ(ОснованиеКорректировки);
		ОснованиеКорректировки_Статус 	= ОснованиеКорректировки.Статус;
		Если ОснованиеКорректировки_Статус = Перечисления.СтатусыСФ.Подтвержденная ИЛИ
			 ОснованиеКорректировки_Статус = Перечисления.СтатусыСФ.ПодтвержденнаяКорректировочная ИЛИ
			 ОснованиеКорректировки_Статус = Перечисления.СтатусыСФ.Первичная Тогда
			Возврат ЗначенияРеквизитов;
		КонецЕсли;
	Иначе
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	Сообщить("განაახლეთ დასაკორექტირებელი ფაქტურის სტატუსი. დასაკორექტირებელ დოკუმენტს """ + ОснованиеКорректировки + """ არ უნდა ჰქონდეს სტატუსი """
			 +ОснованиеКорректировки_Статус+ """.");
	Возврат Неопределено;
	
КонецФункции
