
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура OK(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("КодВозврата", КодВозвратаДиалога.OK);
	СтруктураВозврата.Вставить("Подразделение", Подразделение1.ВыгрузитьЗначения());
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("КодВозврата", КодВозвратаДиалога.Отмена);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры
