#Область ПрограммныйИнтерфейс

// Проверяет принадлежность сеанса информационной базы конкретной области данных.
//
// Параметры:
//  НомерОбластиДанных - Число(7,0,+) - номер области данных,
//  КлючОбластиДанных - Строка - ключ области данных,
//  НомерСеанса - Число - номер сеанса информационной базы, принадлежность которого к области
//    данных проверяется.
//  ИнформацияОбОшибке - ОбъектXDTO {http://www.1c.ru/SaaS/ServiceCommon}ErrorDescription -
//   описание ошибки для передачи через web-сервис.
//
Функция ПроверитьПринадлежностьСеансаОбластиДанных(НомерОбластиДанных, КлючОбластиДанных, НомерСеанса, ИнформацияОбОшибке)
	
	Попытка
		
		Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
			
			Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
				
				ВызватьИсключение НСтр("ka='ოპერაციის მოხმობა არ შეიძლება გამყოფების მითითებით გაშვებულ სეანსში. შეამოწმეთ ვებ-სერვისის პუბლიკაციის სისწორე!';ru='Операция не может быть вызвана в сеансе, который запущен с указанием разделителей. Проверьте правильность публикации веб-сервиса!';en='The operation can not be called in a session, which is run by specifying the delimiters. Verify that the publishing Web service!'");
				
			Иначе
				
				ОбщегоНазначения.УстановитьРазделениеСеанса(Истина, НомерОбластиДанных);
				
				Если КлючОбластиДанных <> Константы.КлючОбластиДанных.Получить() Тогда
					ВызватьИсключение НСтр("ka='მონაცემთა არეალის არაკორექტული გასაღები!';ru='Некорректный ключ области данных!';en='Invalid key data area!'");
				КонецЕсли;
				
				УстановитьБезопасныйРежимРазделенияДанных(Метаданные.ОбщиеРеквизиты.ОбластьДанныхОсновныеДанные.Имя, Истина);
				
				Возврат УдаленноеАдминистрированиеБТССлужебный.ПроверитьПринадлежностьСеансаТекущейОбластиДанных(НомерСеанса);
				
			КонецЕсли;
			
		Иначе
			ВызватьИсключение НСтр("ka='ოპერაცია არ შეიძლება შესრულდეს იმ საინფორმაციო ბაზისთვის, რომელშიც გამორთულია მონაცემთა არეალებით დაყოფა!';ru='Операция не может быть выполнена для информационной базы, в которой отключено разделение по областям данных!';en='The operation can not be performed for the information base, which is off the division data fields!'");
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ТехнологияСервиса.ПолучитьОписаниеОшибкиWebСервиса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецФункции

// Возвращает требуемые для корректной работы ИБ разрешения на использование
//  внешних ресурсов. Вызывается при первоначальном включении профилей безопасности
//  из менеджера сервиса.
//
// Параметры:
//  ИнформацияОбОшибке - ОбъектXDTO {http://www.1c.ru/SaaS/ServiceCommon}ErrorDescription -
//   описание ошибки для передачи через web-сервис.
//
// Возвращаемое значение - ОбъектXDTO {http://www.1c.ru/1cFresh/Application/Permissions/Management/a.b.c.d}PermissionsRequestsList -
//  сериализация запросов разрешений на использование внешних ресурсов.
//
Функция ПолучитьТребуемыеРазрешенияНаИспользованиеВнешнихРесурсов(ИнформацияОбОшибке)
	
	Попытка
		
		
		
	Исключение
		
		ИнформацияОбОшибке = ТехнологияСервиса.ПолучитьОписаниеОшибкиWebСервиса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецФункции

// Возвращает запросы разрешений на использование внешних ресурсов.
//
// Параметры:
//  НаборЗапросов - УникальныйИдентификатор - набор запросов на использование внешних ресурсов.
//  ИнформацияОбОшибке - ОбъектXDTO {http://www.1c.ru/SaaS/ServiceCommon}ErrorDescription -
//   описание ошибки для передачи через web-сервис.
//
// Возвращаемое значение - ОбъектXDTO {http://www.1c.ru/1cFresh/Application/Permissions/Management/a.b.c.d}PermissionsRequestsList -
//  сериализация запросов разрешений на использование внешних ресурсов.
//
Функция ПолучитьЗапросыРазрешений(ИдентификаторПакета, ИнформацияОбОшибке)
	
	Попытка
		
		
		
	Исключение
		
		ИнформацияОбОшибке = ТехнологияСервиса.ПолучитьОписаниеОшибкиWebСервиса(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти
