
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = НСтр("ka='Шаблоны коммерческих предложений';ru='Шаблоны коммерческих предложений'");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСнятьПометкуИспользуется(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Шаблоны = Элементы.Список.ВыделенныеСтроки;
	ШаблонУстановитьСнятьПометкуИспользуется(Шаблоны);
	
	ОповеститьОбИзменении(Элементы.Список.ВыделенныеСтроки[0]);
	Оповестить("Запись_ШаблоныПечатиОфисныхДокументов", Новый Структура("ЭтоНовый", Истина));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ШаблонУстановитьСнятьПометкуИспользуется(Шаблоны)
	
	Для каждого ШаблонСсылка Из Шаблоны Цикл
		ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
		ШаблонОбъект.Используется = НЕ ШаблонОбъект.Используется;
		ШаблонОбъект.Записать();
	КонецЦикла;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти