
&НаКлиентеНаСервереБезКонтекста
&Вместо("СформироватьНадписьЦеныИВалюта")
Функция РасшAzRy_СформироватьНадписьЦеныИВалюта(СтруктураНадписи)
	
	ТекстНадписи = "";
	
	// Валюта.
	Если СтруктураНадписи.УчетВалютныхОпераций Тогда
		Если ЗначениеЗаполнено(СтруктураНадписи.ВалютаДокумента) Тогда
			ТекстНадписи = НСтр("ka='%Валюта%';ru='%Валюта%';en='%Currency%'");
			ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Валюта%", СокрЛП(Строка(СтруктураНадписи.ВалютаДокумента)));
		КонецЕсли;
	КонецЕсли;
		
	// Вид цен контрагента.
	Если ЗначениеЗаполнено(СтруктураНадписи.ВидЦенКонтрагента) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%ВидЦенКонтрагента%';ru='%ВидЦенКонтрагента%';en='% VidTsenKontragenta%'");
		Иначе	
			ТекстНадписи = ТекстНадписи + НСтр("ka='.%სახეობა კონტრაგენტის ფასები%';ru=' • %ВидЦенКонтрагента%'");
		КонецЕсли;	
		// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
		ТекстНадписи = СтрЗаменить(ТекстНадписи, НСтр("ka='%სახეობა კონტრაგენტის ფასები%';ru='%ВидЦенКонтрагента%'"), СокрЛП(Строка(СтруктураНадписи.ВидЦенКонтрагента)));
		// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:		
	КонецЕсли;
	
	// Налогообложение НДС.
	Если ЗначениеЗаполнено(СтруктураНадписи.НалогообложениеНДС) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%НалогообложениеНДС%';ru='%НалогообложениеНДС%';en='% NalogooblozhenieNDS%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ka=' • %НалогообложениеНДС%';ru=' • %НалогообложениеНДС%'");
		КонецЕсли;	
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%НалогообложениеНДС%", РаботаСФормойДокументаКлиентСервер.КраткоеПредставлениеТипаНалогообложенияНДС(СтруктураНадписи.НалогообложениеНДС));
	КонецЕсли;
	
	// Флаг сумма включает НДС.
	Если ПустаяСтрока(ТекстНадписи) Тогда	
		Если СтруктураНадписи.СуммаВключаетНДС Тогда	
			ТекстНадписи = НСтр("en='Amount with VAT';ka='თანხა შეიცავს დღგ-ს';ru='Сумма включает НДС'");
		Иначе		
			ТекстНадписи = НСтр("ka='თანხა არ შეიცავს დღგ-ს';ru='Сумма не включает НДС';en='The sum does not include VAT'");
		КонецЕсли;	
	КонецЕсли;	
 
	Возврат ТекстНадписи;

КонецФункции

&НаСервере
&Вместо("ПересчитатьСуммыСтрокиРасхода")
Процедура РасшAzRy_ПересчитатьСуммыСтрокиРасхода(Идентификатор, ИмяПоля)	
	// +++ { AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:	
	ЯвляетсяНеРезидентом = Объект.Контрагент.ЯвляетсяНеРезидентом И Объект.Контрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС И Объект.Договор.УчитыватьНДФЛ;
	// +++ } AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	
	Если Идентификатор = Неопределено Тогда
		Для Каждого СтрокаТЧ ИЗ Объект.Расходы Цикл
			Идентификатор = СтрокаТЧ.ПолучитьИдентификатор();
			ТекДанные = Объект.Расходы.НайтиПоИдентификатору(Идентификатор);
			
			// +++ { AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
			Если ЯвляетсяНеРезидентом Тогда
				AzRyОбщегоНазначения.ПересчитатьСуммыСтрокиРасхода_ПриходнаяНакладная(ИмяПоля, ТекДанные, Объект.СуммаВключаетНДС);
			Иначе 
				РС_ОбщегоНазначения.ПересчитатьСуммыСтрокиРасхода_ПриходнаяНакладная(ИмяПоля, ТекДанные, Объект.СуммаВключаетНДС);
			КонецЕсли; 
			// +++ } AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:			
		КонецЦикла;
	Иначе
		ТекДанные = Объект.Расходы.НайтиПоИдентификатору(Идентификатор);
		
		// +++ { AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
		Если ЯвляетсяНеРезидентом Тогда
			AzRyОбщегоНазначения.ПересчитатьСуммыСтрокиРасхода_ПриходнаяНакладная(ИмяПоля, ТекДанные, Объект.СуммаВключаетНДС);
		Иначе 
			РС_ОбщегоНазначения.ПересчитатьСуммыСтрокиРасхода_ПриходнаяНакладная(ИмяПоля, ТекДанные, Объект.СуммаВключаетНДС);
		КонецЕсли; 
		// +++ } AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_РасходыСуммаНДФЛПриИзмененииПосле(Элемент)
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	// +++ { AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	//СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС) + СтрокаТабличнойЧасти.СуммаНДФЛ + СтрокаТабличнойЧасти.СуммаПФ;
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма;
	// +++ } AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_РасходыСуммаНДСПриИзмененииПосле(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	//Паганини ПФ_
	//СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	// +++ { AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	//СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС) + СтрокаТабличнойЧасти.СуммаНДФЛ + СтрокаТабличнойЧасти.СуммаПФ;
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма;
	// +++ } AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	//_Паганини ПФ
	
КонецПроцедуры
