
&НаКлиентеНаСервереБезКонтекста
&Вместо("СформироватьНадписьЦеныИВалюта")
Функция РасшAzRy_СформироватьНадписьЦеныИВалюта(СтруктураНадписи)
	
	ТекстНадписи = "";
	
	// Валюта.
	Если СтруктураНадписи.УчетВалютныхОпераций Тогда
		Если ЗначениеЗаполнено(СтруктураНадписи.ВалютаДокумента) Тогда
			ТекстНадписи = НСтр("ka='%Валюта%';ru='%Валюта%';en='%Currency%'");
			ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Валюта%", СокрЛП(Строка(СтруктураНадписи.ВалютаДокумента)));
		КонецЕсли;
	КонецЕсли;
		
	// Вид цен контрагента.
	Если ЗначениеЗаполнено(СтруктураНадписи.ВидЦенКонтрагента) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%ВидЦенКонтрагента%';ru='%ВидЦенКонтрагента%';en='% VidTsenKontragenta%'");
		Иначе	
			ТекстНадписи = ТекстНадписи + НСтр("ka='.%სახეობა კონტრაგენტის ფასები%';ru=' • %ВидЦенКонтрагента%'");
		КонецЕсли;	
		// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
		ТекстНадписи = СтрЗаменить(ТекстНадписи, НСтр("ka='%სახეობა კონტრაგენტის ფასები%';ru='%ВидЦенКонтрагента%'"), СокрЛП(Строка(СтруктураНадписи.ВидЦенКонтрагента)));
		// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:		
	КонецЕсли;
	
	// Налогообложение НДС.
	Если ЗначениеЗаполнено(СтруктураНадписи.НалогообложениеНДС) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%НалогообложениеНДС%';ru='%НалогообложениеНДС%';en='% NalogooblozhenieNDS%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ka=' • %НалогообложениеНДС%';ru=' • %НалогообложениеНДС%'");
		КонецЕсли;	
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%НалогообложениеНДС%", РаботаСФормойДокументаКлиентСервер.КраткоеПредставлениеТипаНалогообложенияНДС(СтруктураНадписи.НалогообложениеНДС));
	КонецЕсли;
	
	// Флаг сумма включает НДС.
	Если ПустаяСтрока(ТекстНадписи) Тогда	
		Если СтруктураНадписи.СуммаВключаетНДС Тогда	
			ТекстНадписи = НСтр("en='Amount with VAT';ka='თანხა შეიცავს დღგ-ს';ru='Сумма включает НДС'");
		Иначе		
			ТекстНадписи = НСтр("ka='თანხა არ შეიცავს დღგ-ს';ru='Сумма не включает НДС';en='The sum does not include VAT'");
		КонецЕсли;	
	КонецЕсли;	
 
	Возврат ТекстНадписи;

КонецФункции
