
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПараметрыПрописиНаРусском = ТекущийОбъект.РусПолеПрописиЦел1 +", "
	+ ТекущийОбъект.РусПолеПрописиЦел2 +", " 
	+ ТекущийОбъект.РусПолеПрописиЦел3 +", "
	+" ,"
	+ ТекущийОбъект.РусПолеПрописиДроб1 +", "
	+ ТекущийОбъект.РусПолеПрописиДроб2 +", "
	+ ТекущийОбъект.РусПолеПрописиДроб3 +", "
	+" ,";
	//+ ТекущийОбъект.ДлинаДробнойЧасти;
	
	ПараметрыПрописиНаГрузинском = ТекущийОбъект.ГрузПолеПрописиЦел1 +", "
	+ ТекущийОбъект.ГрузПолеПрописиДроб1 +", ";
	
	//+ ТекущийОбъект.ДлинаДробнойЧасти;
	
	ПараметрыПрописиНаАнглиском = ТекущийОбъект.АнглПолеПрописиЦел1 +", "
	+ ТекущийОбъект.АнглПолеПрописиЦел2 +", " 
	+ ТекущийОбъект.АнглПолеПрописиДроб1 +", "
	+ ТекущийОбъект.АнглПолеПрописиДроб2 +", ";
	
	ОбВалюта = ТекущийОбъект.Валюта.ПолучитьОбъект(); 	
	ОбВалюта.ПараметрыПрописиНаРусском = ПараметрыПрописиНаРусском;
	ОбВалюта.ПараметрыПрописиНаГрузинском = ПараметрыПрописиНаГрузинском;
	ОбВалюта.ПараметрыПрописиНаАнглиском = ПараметрыПрописиНаАнглиском;
	ОбВалюта.Записать();
	
	
КонецПроцедуры
