#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьПредставленияНастроек();
	
	Элементы.УчетЗатрат.Видимость = НЕ ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	
	Элементы.УчетРасходов.Видимость = УчетнаяПолитика.ПоддерживаетсяУчетПоЭлементамЗатрат();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеНастройкиПланаСчетов" Тогда
		ОбновитьПредставленияНастроек();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УчетДвиженияДенежныхСредствНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ПланСчетов.Хозрасчетный.Форма.УчетДвиженияДенежныхСредств",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетСуммНДСПоПриобретеннымЦенностямНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ПланСчетов.Хозрасчетный.Форма.УчетСуммНДСПоПриобретеннымЦенностям",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетЗапасовНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ПланСчетов.Хозрасчетный.Форма.УчетЗапасов",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетТоваровВРозницеНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ПланСчетов.Хозрасчетный.Форма.УчетТоваровВРознице",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетРасчетовСПерсоналомНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ПланСчетов.Хозрасчетный.Форма.УчетРасчетовСПерсоналом",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетЗатратНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ПланСчетов.Хозрасчетный.Форма.УчетЗатрат",, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура УчетРасходовНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ПланСчетов.Хозрасчетный.Форма.УчетРасходов",, ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПредставленияНастроек()
	
	ПараметрыУчета = ОбщегоНазначенияБП.ОпределитьПараметрыУчета();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыУчета);
	
	// Учет движения денежных средств.
	МассивПредставленийНастроек = Новый Массив;
	МассивПредставленийНастроек.Добавить(НСтр("ru='По расчетным счетам';en='According to the settlement accounts'"));
	Если Константы.ИспользоватьСтатьиДвиженияДенежныхСредств.Получить() Тогда
		МассивПредставленийНастроек.Добавить(НСтр("ru='статьям движения денежных средств';en='Articles cash flow'"));
	КонецЕсли;
	УчетДвиженияДенежныхСредств = ПолучитьЛитературноеОписаниеМассиваНастроек(МассивПредставленийНастроек);
	
	// Учет сумм НДС по приобретенным ценностям.
	МассивПредставленийНастроек = Новый Массив;
	МассивПредставленийНастроек.Добавить(НСтр("ru='По контрагентам';en='counterparty'"));
	МассивПредставленийНастроек.Добавить(НСтр("ru='счетам-фактурам полученным';en='invoices received'"));
	Если ВестиУчетНДСПоСпособам Тогда
		МассивПредставленийНастроек.Добавить(НСтр("ru='способам учета';en='method of accounting'"));
	КонецЕсли;
	УчетСуммНДСПоПриобретеннымЦенностям = ПолучитьЛитературноеОписаниеМассиваНастроек(МассивПредставленийНастроек);
		
	// Учет запасов.
	МассивПредставленийНастроек = Новый Массив;
	МассивПредставленийНастроек.Добавить(НСтр("ru='По номенклатуре';en='according to the nomenclature'"));
	Если ВестиПартионныйУчет Тогда
		МассивПредставленийНастроек.Добавить(НСтр("ru='партиям';en='parties'"));
	КонецЕсли;
	Если СкладскойУчет = 1 Тогда
		МассивПредставленийНастроек.Добавить(НСтр("ru='складам (по количеству)';en='Warehouses (by number)'"));
	ИначеЕсли СкладскойУчет = 2 Тогда
		МассивПредставленийНастроек.Добавить(НСтр("ru='складам (по количеству и сумме)';en='Warehouses (by number and amount)'"));
	КонецЕсли;
	УчетЗапасов = ПолучитьЛитературноеОписаниеМассиваНастроек(МассивПредставленийНастроек);
	
	// Учет товаров в рознице.
	МассивПредставленийНастроек = Новый Массив;
	МассивПредставленийНастроек.Добавить(НСтр("ru='По складам';en='to spell'"));
	Если ИспользоватьОборотнуюНоменклатуру Тогда
		МассивПредставленийНастроек.Добавить(НСтр("ru='номенклатуре (обороты)';en='nomenclature (RPM)'"));
	КонецЕсли;
	Если РазделятьПоСтавкамНДС Тогда
		МассивПредставленийНастроек.Добавить(НСтр("ru='ставкам НДС';en='VAT rates'"));
	КонецЕсли;
	УчетТоваровВРознице = ПолучитьЛитературноеОписаниеМассиваНастроек(МассивПредставленийНастроек);
	
	// Учет расчетов с персоналом.
	УчетРасчетовСПерсоналом = ?(ВестиУчетПоРаботникам,
		НСтр("ru='По каждому работнику';en='For each employee'"),
		НСтр("ru='Сводно по всем работникам';en='Summary of all employees'"));
	
	// Учет затрат.
	УчетЗатрат = ?(Константы.ВестиУчетЗатратПоПодразделениям.Получить(),
		НСтр("ru='По каждому подразделению';en='For each subdivision'"),
		НСтр("ru='Сводно, по организации в целом';en='Consolidated, for the organization as a whole'"));
		
	// Учет расходов.
	МассивПредставленийНастроек = Новый Массив;
	МассивПредставленийНастроек.Добавить(НСтр("ru='По номенклатурным группам';en='According to the nomenclature groups'"));
	Если УчитыватьРасходыПоЭлементамЗатрат Тогда
		МассивПредставленийНастроек.Добавить(НСтр("ru='элементам затрат';en='cost elements'"));
	КонецЕсли;
	Если УчитыватьРасходыПоСтатьямЗатрат Тогда
		МассивПредставленийНастроек.Добавить(НСтр("ru='статьям затрат';en='cost items'"));
	КонецЕсли;
	УчетРасходов = ПолучитьЛитературноеОписаниеМассиваНастроек(МассивПредставленийНастроек);	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЛитературноеОписаниеМассиваНастроек(МассивПредставленийНастроек)
	
	Результат = "";
	
	Для каждого Элемент Из МассивПредставленийНастроек Цикл
		
		Если НЕ ПустаяСтрока(Результат) Тогда
		
			Если МассивПредставленийНастроек.Найти(Элемент) = МассивПредставленийНастроек.ВГраница() Тогда
				Результат = Результат + НСтр("ru=' и '");
			Иначе
				Результат = Результат + НСтр("ru=', '");
			КонецЕсли;
			
		КонецЕсли;
		
		Результат = Результат + Элемент;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти



