
&Вместо("ЗакрытьОтчетОРозничныхПродажах")
Функция РасшAzRy_ЗакрытьОтчетОРозничныхПродажах(ОтчетОРозничныхПродажахОбъект)
	
	СтруктураВозвращаемоеЗначение = Новый Структура;
	СтруктураВозвращаемоеЗначение.Вставить("ОтчетОРозничныхПродажах");
	СтруктураВозвращаемоеЗначение.Вставить("ОписаниеОшибки");
	
	ВыполняетсяОбработкаЧеков = Истина;
	УдалитьДвиженияПоРегиструЗапасыВПробитыхЧекахККМ(ОтчетОРозничныхПродажахОбъект);
	ВыполняетсяОбработкаЧеков = Ложь;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Подготовка данных.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекККМЗапасы.Номенклатура КАК Номенклатура,
	|	ЧекККМЗапасы.Характеристика КАК Характеристика,
	|	ЧекККМЗапасы.Партия КАК Партия,
	|	ЧекККМЗапасы.Контрагент КАК Контрагент,  //Малышев 2024-10-23 ONESOFT-3538
	|	СУММА(ЧекККМЗапасы.Количество) КАК Количество,
	|	ЧекККМЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЧекККМЗапасы.Цена КАК Цена,
	|	ЧекККМЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ЧекККМЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ЧекККМЗапасы.Сумма) КАК Сумма,
	|	СУММА(ЧекККМЗапасы.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ЧекККМЗапасы.Всего) КАК Всего,
	|	ЧекККМЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЧекККМЗапасы.ВалютаДокумента КАК ВалютаДокумента,
	|	ЧекККМЗапасы.ВидЦен КАК ВидЦен,
	|	ЧекККМЗапасы.КассаККМ КАК КассаККМ,
	|	ЧекККМЗапасы.Подразделение КАК Подразделение,
	|	ЧекККМЗапасы.Ответственный КАК Ответственный,
	|	ЧекККМЗапасы.Организация КАК Организация,
	|	ЧекККМЗапасы.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	СУММА(ЧекККМЗапасы.СуммаАвтоматическойСкидки) КАК СуммаАвтоматическойСкидки,
	|	ЧекККМЗапасы.Заказ,
	|	СУММА(ЧекККМЗапасы.Резерв) КАК Резерв,
	|	СУММА(ЧекККМЗапасы.Возврат) КАК Возврат
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ЧекККМЗапасы.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	|	ЧекККМЗапасы.AzRyПроект КАК AzRyПроект,
	|	ЧекККМЗапасы.AzRyКонтрагент КАК AzRyКонтрагент,
	|	ЧекККМЗапасы.AzRyФормаОплаты КАК AzRyФормаОплаты
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЧекККМЗапасы.Номенклатура КАК Номенклатура,
	|		ЧекККМЗапасы.Характеристика КАК Характеристика,
	|		ЧекККМЗапасы.Партия КАК Партия,
	|		ЧекККМЗапасы.Количество КАК Количество,
	|		ЧекККМЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ЧекККМЗапасы.Цена КАК Цена,
	|		ЧекККМЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|		ЧекККМЗапасы.СтавкаНДС КАК СтавкаНДС,
	|		ЧекККМЗапасы.Сумма КАК Сумма,
	|		ЧекККМЗапасы.СуммаНДС КАК СуммаНДС,
	|		ЧекККМЗапасы.Всего КАК Всего,
	|		ЧекККМЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЧекККМЗапасы.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|		ЧекККМЗапасы.Ссылка.ВидЦен КАК ВидЦен,
	|		ЧекККМЗапасы.Ссылка.КассаККМ КАК КассаККМ,
	|		ЧекККМЗапасы.Ссылка.Подразделение КАК Подразделение,
	|		ЧекККМЗапасы.Ссылка.Ответственный КАК Ответственный,
	|		ЧекККМЗапасы.Ссылка.Организация КАК Организация,
	|		ЧекККМЗапасы.Ссылка.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|		ЧекККМЗапасы.Ссылка.Контрагент КАК Контрагент,  //Малышев 2024-10-23 ONESOFT-3538
	|		ЧекККМЗапасы.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|		ЧекККМЗапасы.Заказ КАК Заказ,
	|		ВЫБОР
	|			КОГДА &ЕстьЗаказыИРезерв
	|					И ЧекККМЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				ТОГДА ЧекККМЗапасы.Резерв
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Резерв,
	|		0 КАК Возврат
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|		,ЧекККМЗапасы.Ссылка.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	|		ЧекККМЗапасы.Ссылка.КассаККМ.AzRyПроект КАК AzRyПроект,
	|		ЧекККМЗапасы.Ссылка.Контрагент КАК AzRyКонтрагент,
	|		ЧекККМЗапасы.Ссылка.ФормаОплаты КАК AzRyФормаОплаты
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|	ИЗ
	|		Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
	|	ГДЕ
	|		ЧекККМЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМЗапасы.Ссылка.Проведен
	|		И ЧекККМЗапасы.Ссылка.НомерЧекаККМ > 0
	|		И НЕ ЧекККМЗапасы.Ссылка.Архивный
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЧекККМЗапасы.Номенклатура,
	|		ЧекККМЗапасы.Характеристика,
	|		ЧекККМЗапасы.Партия,
	|		-ЧекККМЗапасы.Количество,
	|		ЧекККМЗапасы.ЕдиницаИзмерения,
	|		ЧекККМЗапасы.Цена,
	|		ЧекККМЗапасы.ПроцентСкидкиНаценки,
	|		ЧекККМЗапасы.СтавкаНДС,
	|		-ЧекККМЗапасы.Сумма,
	|		-ЧекККМЗапасы.СуммаНДС,
	|		-ЧекККМЗапасы.Всего,
	|		ЧекККМЗапасы.Ссылка.СтруктурнаяЕдиница,
	|		ЧекККМЗапасы.Ссылка.ВалютаДокумента,
	|		ЧекККМЗапасы.Ссылка.ВидЦен,
	|		ЧекККМЗапасы.Ссылка.КассаККМ,
	|		ЧекККМЗапасы.Ссылка.Подразделение,
	|		ЧекККМЗапасы.Ссылка.Ответственный,
	|		ЧекККМЗапасы.Ссылка.Организация,
	|		ЧекККМЗапасы.Ссылка.ДисконтнаяКарта,
	|		ЧекККМЗапасы.Ссылка.Контрагент КАК Контрагент,  //Малышев 2024-10-23 ONESOFT-3538
	|		-ЧекККМЗапасы.СуммаАвтоматическойСкидки,
	|		ЧекККМЗапасы.Заказ,
	|		0,
	|		ЧекККМЗапасы.Количество
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|		,Null,
	|		Null,
	|		Null,
	|		Null
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|	ИЗ
	|		Документ.ЧекККМВозврат.Запасы КАК ЧекККМЗапасы
	|	ГДЕ
	|		ЧекККМЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМЗапасы.Ссылка.Проведен
	|		И ЧекККМЗапасы.Ссылка.НомерЧекаККМ > 0
	|		И НЕ ЧекККМЗапасы.Ссылка.Архивный) КАК ЧекККМЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМЗапасы.Номенклатура,
	|	ЧекККМЗапасы.Характеристика,
	|	ЧекККМЗапасы.Партия,
	|	ЧекККМЗапасы.ЕдиницаИзмерения,
	|	ЧекККМЗапасы.Цена,
	|	ЧекККМЗапасы.ПроцентСкидкиНаценки,
	|	ЧекККМЗапасы.СтруктурнаяЕдиница,
	|	ЧекККМЗапасы.ВалютаДокумента,
	|	ЧекККМЗапасы.ВидЦен,
	|	ЧекККМЗапасы.КассаККМ,
	|	ЧекККМЗапасы.Организация,
	|	ЧекККМЗапасы.Подразделение,
	|	ЧекККМЗапасы.Ответственный,
	|	ЧекККМЗапасы.СтавкаНДС,
	|	ЧекККМЗапасы.ДисконтнаяКарта,
	|	ЧекККМЗапасы.Контрагент,  //Малышев 2024-10-23 ONESOFT-3538
	|	ЧекККМЗапасы.Заказ
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ЧекККМЗапасы.AzRyАналитикаКонтрагент,
	|	ЧекККМЗапасы.AzRyПроект,
	|	ЧекККМЗапасы.AzRyКонтрагент,
	|	ЧекККМЗапасы.AzRyФормаОплаты
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОплатаПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	ОплатаПлатежнымиКартами.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
	|	ОплатаПлатежнымиКартами.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
	|	СУММА(ОплатаПлатежнымиКартами.Сумма) КАК Сумма,
	|	ОплатаПлатежнымиКартами.Дата КАК ДатаПлатежа
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|		ЧекККМОплатаПлатежнымиКартами.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
	|		ЧекККМОплатаПлатежнымиКартами.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
	|		ЧекККМОплатаПлатежнымиКартами.Сумма КАК Сумма,
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.КассаККМ КАК КассаККМ,
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.Организация КАК Организация,
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.СтруктурнаяЕдиница КАК Склад,
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.ВалютаДокумента КАК Валюта,
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.ВидЦен КАК ВидЦен,
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.Дата КАК Дата
	|	ИЗ
	|		Документ.ЧекККМ.ОплатаПлатежнымиКартами КАК ЧекККМОплатаПлатежнымиКартами
	|	ГДЕ
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМОплатаПлатежнымиКартами.Ссылка.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.ЭквайринговыйТерминал,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.ВидПлатежнойКарты,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.НомерПлатежнойКарты,
	|		-ЧекККМВозвратОплатаПлатежнымиКартами.Сумма,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.КассаККМ,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.Организация,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.СтруктурнаяЕдиница,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.ВалютаДокумента,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.ВидЦен,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.Дата
	|	ИЗ
	|		Документ.ЧекККМВозврат.ОплатаПлатежнымиКартами КАК ЧекККМВозвратОплатаПлатежнымиКартами
	|	ГДЕ
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.Проведен) КАК ОплатаПлатежнымиКартами
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатаПлатежнымиКартами.ЭквайринговыйТерминал,
	|	ОплатаПлатежнымиКартами.ВидПлатежнойКарты,
	|	ОплатаПлатежнымиКартами.НомерПлатежнойКарты,
	|	ОплатаПлатежнымиКартами.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧекККМЗапасы.Ответственный) КАК КоличествоОтветственный
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЧекККМЗапасы.Ссылка.Ответственный КАК Ответственный
	|	ИЗ
	|		Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
	|	ГДЕ
	|		ЧекККМЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМЗапасы.Ссылка.Проведен
	|		И ЧекККМЗапасы.Ссылка.НомерЧекаККМ > 0
	|		И НЕ ЧекККМЗапасы.Ссылка.Архивный
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЧекККМЗапасы.Ссылка.Ответственный
	|	ИЗ
	|		Документ.ЧекККМВозврат.Запасы КАК ЧекККМЗапасы
	|	ГДЕ
	|		ЧекККМЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМЗапасы.Ссылка.Проведен
	|		И ЧекККМЗапасы.Ссылка.НомерЧекаККМ > 0
	|		И НЕ ЧекККМЗапасы.Ссылка.Архивный) КАК ЧекККМЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМЗапасы.Номенклатура,
	|	ЧекККМЗапасы.Характеристика,
	|	ЧекККМСкидкиНаценки.СкидкаНаценка,
	|	ЧекККМСкидкиНаценки.Сумма
	|ПОМЕСТИТЬ ВТ_АвтоСкидкиНаценкиОбъединение
	|ИЗ
	|	Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.СкидкиНаценки КАК ЧекККМСкидкиНаценки
	|		ПО ЧекККМЗапасы.КлючСвязи = ЧекККМСкидкиНаценки.КлючСвязи
	|			И (ЧекККМЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена)
	|			И (ЧекККМЗапасы.Ссылка.Проведен)
	|			И (ЧекККМЗапасы.Ссылка.НомерЧекаККМ > 0)
	|			И (НЕ ЧекККМЗапасы.Ссылка.Архивный)
	|			И ЧекККМЗапасы.Ссылка = ЧекККМСкидкиНаценки.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозвратЗапасы.Номенклатура,
	|	ЧекККМВозвратЗапасы.Характеристика,
	|	ЧекККМВозвратСкидкиНаценки.СкидкаНаценка,
	|	-ЧекККМВозвратСкидкиНаценки.Сумма
	|ИЗ
	|	Документ.ЧекККМВозврат.Запасы КАК ЧекККМВозвратЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.СкидкиНаценки КАК ЧекККМВозвратСкидкиНаценки
	|		ПО ЧекККМВозвратЗапасы.КлючСвязи = ЧекККМВозвратСкидкиНаценки.КлючСвязи
	|			И (ЧекККМВозвратЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена)
	|			И (ЧекККМВозвратЗапасы.Ссылка.Проведен)
	|			И (ЧекККМВозвратЗапасы.Ссылка.НомерЧекаККМ > 0)
	|			И (НЕ ЧекККМВозвратЗапасы.Ссылка.Архивный)
	|			И ЧекККМВозвратЗапасы.Ссылка = ЧекККМВозвратСкидкиНаценки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АвтоСкидкиНаценкиОбъединение.Номенклатура,
	|	ВТ_АвтоСкидкиНаценкиОбъединение.Характеристика,
	|	ВТ_АвтоСкидкиНаценкиОбъединение.СкидкаНаценка,
	|	СУММА(ВТ_АвтоСкидкиНаценкиОбъединение.Сумма) КАК Сумма
	|ИЗ
	|	ВТ_АвтоСкидкиНаценкиОбъединение КАК ВТ_АвтоСкидкиНаценкиОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_АвтоСкидкиНаценкиОбъединение.Номенклатура,
	|	ВТ_АвтоСкидкиНаценкиОбъединение.Характеристика,
	|	ВТ_АвтоСкидкиНаценкиОбъединение.СкидкаНаценка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМПродажиВозвраты.Номенклатура КАК Номенклатура,
	|	ЧекККМПродажиВозвраты.Характеристика КАК Характеристика,
	|	ЧекККМПродажиВозвраты.Партия КАК Партия,
	|	ЧекККМПродажиВозвраты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЧекККМПродажиВозвраты.Цена КАК Цена,
	|	ЧекККМПродажиВозвраты.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ЧекККМПродажиВозвраты.СтавкаНДС КАК СтавкаНДС,
	|	ЧекККМПродажиВозвраты.Заказ КАК Заказ,
	|	ЧекККМПродажиВозвраты.СерийныйНомер,
	|	ЧекККМПродажиВозвраты.Ответственный,
	|	ЧекККМПродажиВозвраты.ДисконтнаяКарта,
	|	СУММА(ЧекККМПродажиВозвраты.ПризнакПродаж) КАК ПризнакПродаж
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЧекККМЗапасы.Номенклатура КАК Номенклатура,
	|		ЧекККМЗапасы.Характеристика КАК Характеристика,
	|		ЧекККМЗапасы.Партия КАК Партия,
	|		ЧекККМЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ЧекККМЗапасы.Цена КАК Цена,
	|		ЧекККМЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|		ЧекККМЗапасы.СтавкаНДС КАК СтавкаНДС,
	|		ЧекККМЗапасы.Заказ КАК Заказ,
	|		ЧекККМСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|		ЧекККМЗапасы.Ссылка.Ответственный КАК Ответственный,
	|		ЧекККМЗапасы.Ссылка.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|		1 КАК ПризнакПродаж
	|	ИЗ
	|		Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.СерийныеНомера КАК ЧекККМСерийныеНомера
	|			ПО ЧекККМЗапасы.КлючСвязи = ЧекККМСерийныеНомера.КлючСвязи
	|				И ЧекККМЗапасы.Ссылка = ЧекККМСерийныеНомера.Ссылка
	|	ГДЕ
	|		ЧекККМЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМЗапасы.Ссылка.Проведен
	|		И ЧекККМЗапасы.Ссылка.НомерЧекаККМ > 0
	|		И НЕ ЧекККМЗапасы.Ссылка.Архивный
	|		И ЧекККМСерийныеНомера.Ссылка.КассоваяСмена = &КассоваяСмена
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЧекККМВозвратЗапасы.Номенклатура,
	|		ЧекККМВозвратЗапасы.Характеристика,
	|		ЧекККМВозвратЗапасы.Партия,
	|		ЧекККМВозвратЗапасы.ЕдиницаИзмерения,
	|		ЧекККМВозвратЗапасы.Цена,
	|		ЧекККМВозвратЗапасы.ПроцентСкидкиНаценки,
	|		ЧекККМВозвратЗапасы.СтавкаНДС,
	|		ЧекККМВозвратЗапасы.Заказ,
	|		ЧекККМВозвратСерийныеНомера.СерийныйНомер,
	|		ЧекККМВозвратЗапасы.Ссылка.Ответственный,
	|		ЧекККМВозвратЗапасы.Ссылка.ДисконтнаяКарта,
	|		-1
	|	ИЗ
	|		Документ.ЧекККМВозврат.Запасы КАК ЧекККМВозвратЗапасы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.СерийныеНомера КАК ЧекККМВозвратСерийныеНомера
	|			ПО ЧекККМВозвратЗапасы.КлючСвязи = ЧекККМВозвратСерийныеНомера.КлючСвязи
	|				И ЧекККМВозвратЗапасы.Ссылка = ЧекККМВозвратСерийныеНомера.Ссылка
	|	ГДЕ
	|		ЧекККМВозвратЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМВозвратЗапасы.Ссылка.Проведен
	|		И ЧекККМВозвратЗапасы.Ссылка.НомерЧекаККМ > 0
	|		И НЕ ЧекККМВозвратЗапасы.Ссылка.Архивный
	|		И ЧекККМВозвратСерийныеНомера.Ссылка.КассоваяСмена = &КассоваяСмена) КАК ЧекККМПродажиВозвраты
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМПродажиВозвраты.Номенклатура,
	|	ЧекККМПродажиВозвраты.Характеристика,
	|	ЧекККМПродажиВозвраты.Партия,
	|	ЧекККМПродажиВозвраты.ЕдиницаИзмерения,
	|	ЧекККМПродажиВозвраты.СтавкаНДС,
	|	ЧекККМПродажиВозвраты.Заказ,
	|	ЧекККМПродажиВозвраты.СерийныйНомер,
	|	ЧекККМПродажиВозвраты.Цена,
	|	ЧекККМПродажиВозвраты.ПроцентСкидкиНаценки,
	|	ЧекККМПродажиВозвраты.Ответственный,
	|	ЧекККМПродажиВозвраты.ДисконтнаяКарта
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЧекККМПродажиВозвраты.ПризнакПродаж) > 0";
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КассоваяСмена", ОтчетОРозничныхПродажахОбъект.Ссылка);
	// АвтоматическиеСкидки
	Запрос.УстановитьПараметр("ИспользоватьАвтоматическиеСкидки", ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки"));
	// Конец АвтоматическиеСкидки
	// Заказы покупателей в розничной торговле
	Запрос.УстановитьПараметр("ЕстьЗаказыИРезерв", ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыВРозничнойТорговле") И
		ПолучитьФункциональнуюОпцию("РезервированиеЗапасов"));
	// Конец Заказы покупателей в розничной торговле
	
	Результат = Запрос.ВыполнитьПакет();
	
	Запасы = Результат[0].Выгрузить();
	Запасы.Колонки.Добавить("ПроцентАвтоматическойСкидки", Новый ОписаниеТипов("Число"));
	ОплатаПлатежнымиКартами = Результат[1].Выгрузить();
	
	ОтчетОРозничныхПродажахОбъект.Запасы.Очистить();
	ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.Очистить();
	
	Если Запасы.Количество() > 0 Тогда
		ОтчетОРозничныхПродажахОбъект.ПоложениеОтветственный = ?(
			Результат[2].Выгрузить()[0].КоличествоОтветственный > 1,
			Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти,
			Перечисления.ПоложениеРеквизитаНаФорме.ВШапке
		);
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Запасы Цикл
		
		// Заполним процент автоматической скидки
		Если СтрокаТЧ.СуммаАвтоматическойСкидки <> 0 Тогда
			
			// Применение автоматической скидки.
			СуммаБезСкидки = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
			СтрокаТЧ.ПроцентАвтоматическойСкидки = ?(СуммаБезСкидки = 0, 0 , 100 * СтрокаТЧ.СуммаАвтоматическойСкидки / СуммаБезСкидки);
			СтрокаТЧ.ПроцентСкидкиНаценки = СтрокаТЧ.ПроцентСкидкиНаценки + СтрокаТЧ.ПроцентАвтоматическойСкидки;
			
		КонецЕсли;
		
		Если СтрокаТЧ.Всего <> 0 ИЛИ СтрокаТЧ.ПроцентСкидкиНаценки >= 100 
			// Заказы в Рознице.
			ИЛИ СтрокаТЧ.Резерв > 0
			Тогда
			СтрокаТабличнойЧастиЗапасы = ОтчетОРозничныхПродажахОбъект.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧастиЗапасы, СтрокаТЧ);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из ОплатаПлатежнымиКартами Цикл
		
		Если СтрокаТЧ.Сумма <> 0 Тогда
			СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
		КонецЕсли;
		
	КонецЦикла;
	
	// АвтоматическиеСкидки
	ОтчетОРозничныхПродажахОбъект.СкидкиНаценки.Очистить();
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки") Тогда
		
		АвтоматическиеСкидки = Результат[4].Выгрузить();
		Для каждого СтрокаТЧ Из АвтоматическиеСкидки Цикл
			
			Если СтрокаТЧ.Сумма <> 0 Тогда
				СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.СкидкиНаценки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	// Конец АвтоматическиеСкидки
	
	// Серийные номера
	ОтчетОРозничныхПродажахОбъект.СерийныеНомера.Очистить();
	РаботаССерийнымиНомерамиКлиентСервер.ЗаполнитьКлючиСвязиВТабличнойЧастиТовары(ОтчетОРозничныхПродажахОбъект, "Запасы");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСерийныеНомера") Тогда
		
		СерийныеНомера = Результат[5].Выгрузить();
		Для каждого СтрокаТЧ Из ОтчетОРозничныхПродажахОбъект.Запасы Цикл
			
			СтруктураОтбора = Новый Структура("Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, Цена, СтавкаНДС, Заказ
			|, ПроцентСкидкиНаценки,Ответственный,ДисконтнаяКарта");
			
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТЧ);
			
			СерийныеНомераПоОтбору = СерийныеНомера.НайтиСтроки(СтруктураОтбора);
			Если СерийныеНомераПоОтбору.Количество()>0 Тогда
				
				КлючСвязи = СтрокаТЧ.КлючСвязи;
				
				Для каждого стр Из СерийныеНомераПоОтбору Цикл
					НовСтр = ОтчетОРозничныхПродажахОбъект.СерийныеНомера.Добавить();
					НовСтр.КлючСвязи = КлючСвязи;
					НовСтр.СерийныйНомер = стр.СерийныйНомер;
				КонецЦикла;
			КонецЕсли;
			
			РаботаССерийнымиНомерамиКлиентСервер.ОбновитьСтроковоеПредставлениеСерийныхНомеровСтроки(СтрокаТЧ, ОтчетОРозничныхПродажахОбъект, "КлючСвязи");
			
		КонецЦикла;
		
	КонецЕсли;
	// Серийные номера
	
	
	ОтчетОРозничныхПродажахОбъект.СтатусКассовойСмены    = Перечисления.СтатусыОтчетаОРозничныхПродажах.Закрыта;
	Если ОтчетОРозничныхПродажахОбъект.ДополнительныеСвойства.Свойство("ЗагрузкаИзВнешнегоИсточника") <> Истина Тогда
		ДатаЗакрытияКассовойСмены = ТекущаяДатаСеанса();
		ОтчетОРозничныхПродажахОбъект.Дата                   = ДатаЗакрытияКассовойСмены;
		ОтчетОРозничныхПродажахОбъект.ОкончаниеКассовойСмены = ДатаЗакрытияКассовойСмены;
	КонецЕсли;
	ОтчетОРозничныхПродажахОбъект.СуммаДокумента         = ОтчетОРозничныхПродажахОбъект.Запасы.Итог("Всего");
	
	
	Если Запасы.Количество() > 0 Тогда
		ОтчетОРозничныхПродажахОбъект.Ответственный = Запасы[0].Ответственный;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Ответственный) Тогда
		ОтчетОРозничныхПродажахОбъект.Ответственный = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнойОтветственный");
	КонецЕсли;
	
	ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Запись);
	СтруктураВозвращаемоеЗначение.ОписаниеОшибки = "";
	СтруктураВозвращаемоеЗначение.ОтчетОРозничныхПродажах = ОтчетОРозничныхПродажахОбъект.Ссылка;
	
	Попытка
		ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение		
		СтруктураВозвращаемоеЗначение.ОписаниеОшибки = НСтр("ka='При формировании отчета о розничных продажах произошла ошибка.';ru='При формировании отчета о розничных продажах произошла ошибка.';en='When forming an error occurred report on retail sales.'")
			+?(ВыполняетсяОбработкаЧеков, НСтр("ka=' Ошибка произошла при обработке чеков ККМ.';ru=' Ошибка произошла при обработке чеков ККМ.'"), "");			
	КонецПопытки;
		
	Возврат СтруктураВозвращаемоеЗначение;
	
КонецФункции

&Вместо("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетОРозничныхПродажахЗапасы.НомерСтроки КАК НомерСтроки,
	|	ОтчетОРозничныхПродажахЗапасы.КлючСвязи КАК КлючСвязи,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка КАК Документ,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.ИнвентаризацияЗапасов КАК ДокументОснование,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.Статья КАК Статья,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.Дата КАК Дата,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.Дата КАК Период,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.КассаККМ КАК КассаККМ,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.КассаККМ.Владелец КАК КассаККМВладелец,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.КассаККМ.СчетУчета КАК КассаККМСчетУчета,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.КассаККМ.СчетУчетаРегл КАК КассаККМСчетУчетаРегл,
	|	&Организация КАК Организация,
	|	ОтчетОРозничныхПродажахЗапасы.Заказ КАК ЗаказПокупателя,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.Подразделение КАК Подразделение,
	|	ОтчетОРозничныхПродажахЗапасы.Ответственный КАК Ответственный,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж КАК СчетУчетаВыручкиОтПродаж,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК СчетУчетаСебестоимостиПродаж,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл КАК СчетУчетаВыручкиОтПродажРегл,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК СчетУчетаСебестоимостиПродажРегл,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НЕОПРЕДЕЛЕНО КАК КоррСтруктурнаяЕдиница,
	|	НЕОПРЕДЕЛЕНО КАК Ячейка,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.СчетУчетаЗапасов КАК СчетУчетаЗапасов,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаЗапасовРегл,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаРегл, //Малышев 2024-12-06 ONESOFT-3670
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	НЕОПРЕДЕЛЕНО КАК КоррСчетУчетаЗапасов,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|				И ОтчетОРозничныхПродажахЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТоварыНаКомиссии,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК КоррНоменклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ОтчетОРозничныхПродажахЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ОтчетОРозничныхПродажахЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК КоррХарактеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ОтчетОРозничныхПродажахЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ОтчетОРозничныхПродажахЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК КоррПартия,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОтчетОРозничныхПродажахЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ОтчетОРозничныхПродажахЗапасы.Количество
	|		ИНАЧЕ ОтчетОРозничныхПродажахЗапасы.Количество * ОтчетОРозничныхПродажахЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ОтчетОРозничныхПродажахЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.СуммаНДС * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.СуммаНДС * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДСЗакупкиПродажи,
	|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.Всего * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.СуммаНДС КАК ЧИСЛО(15, 2)) КАК СуммаНДСВал,
	|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.Всего КАК ЧИСЛО(15, 2)) КАК СуммаВал,
	|	ОтчетОРозничныхПродажахЗапасы.Всего КАК СуммаРасчетовПринятыеПереданные,
	|	ОтчетОРозничныхПродажахЗапасы.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ОтчетОРозничныхПродажахЗапасы.ДисконтнаяКарта.ВладелецКарты КАК ВладелецКарты,
	//Малышев 2024-10-23 ONESOFT-3537 (--
	//|	ВЫБОР 
	//|		КОГДА ОтчетОРозничныхПродажахЗапасы.Контрагент <> Значение(Справочник.Контрагенты.ПустаяСсылка)
	//|			ТОГДА ОтчетОРозничныхПродажахЗапасы.Контрагент 
	//|		ИНАЧЕ ISNULL(УчетнаяПолитикаРегл.РозничныйКонтрагент, Значение(Справочник.Контрагенты.ПустаяСсылка))
	//|   КОНЕЦ КАК Контрагент,
	//Малышев 2024-10-23 ONESOFT-3537 --)
	|	ОтчетОРозничныхПродажахЗапасы.AzRyКонтрагент КАК Контрагент, // AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	
	//Малышев 2024-12-06 ONESOFT-3670  (--
	//|	ВЫБОР
	//|		КОГДА не &УчетПоПроектам ТОГДА Значение(Справочник.Проекты.ПустаяСсылка) 
	//|		КОГДА &УчетПоПроектам
	//|			ТОГДА ВЫБОР
	////|					КОГДА ОтчетОРозничныхПродажахЗапасы.Заказ = Значение(Документ.ЗаказПокупателя.ПустаяССылка)  
	//|					КОГДА ОтчетОРозничныхПродажахЗапасы.Заказ = Значение(Документ.ЗаказПокупателя.ПустаяССылка) и УчетнаяПолитикаРегл.РозничныйПроект<>Значение(Справочник.Проекты.ПустаяСсылка) //Малышев 2025-06-11 ONESOFT-3828 
	//|						ТОГДА УчетнаяПолитикаРегл.РозничныйПроект                                
	//|					КОГДА ОтчетОРозничныхПродажахЗапасы.Заказ.Проект ЕСТЬ NULL
	//|							ИЛИ ОтчетОРозничныхПродажахЗапасы.Заказ.Проект = НЕОПРЕДЕЛЕНО
	//|							ИЛИ ОтчетОРозничныхПродажахЗапасы.Заказ.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|						ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|					ИНАЧЕ ОтчетОРозничныхПродажахЗапасы.Заказ.Проект
	//|				КОНЕЦ
	//|	КОНЕЦ КАК Проект,
    //Малышев 2024-12-06 ONESOFT-3670  --)
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.КассаККМ.AzRyПроект КАК Проект, // AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:

	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОтчетОРозничныхПродажахЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ОтчетОРозничныхПродажахЗапасы.Резерв
	|		ИНАЧЕ ОтчетОРозничныхПродажахЗапасы.Резерв * ОтчетОРозничныхПродажахЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Резерв,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.Организация.ВидНалогаНДС КАК ВидНалогаНДС,
	|	ВЫБОР
	|		КОГДА ОтчетОРозничныхПродажахЗапасы.Ссылка.СуммаВключаетНДС
	|			ТОГДА ВЫРАЗИТЬ((ОтчетОРозничныхПродажахЗапасы.Всего - ОтчетОРозничныхПродажахЗапасы.СуммаНДС) * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.Сумма * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ОтчетОРозничныхПродажахЗапасы.Ссылка.СуммаВключаетНДС
	|			ТОГДА ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.Всего - ОтчетОРозничныхПродажахЗапасы.СуммаНДС КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.Сумма КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаБезНДСВал,
	|	НЕОПРЕДЕЛЕНО КАК КоррСчетУчетаЗапасовРегл,
	|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.Количество * ОтчетОРозничныхПродажахЗапасы.Цена КАК ЧИСЛО(15, 2)) КАК СуммаБезСкидки
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ОтчетОРозничныхПродажахЗапасы.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	//|	ОтчетОРозничныхПродажахЗапасы.Ссылка.КассаККМ.AzRyПроект КАК AzRyПроект,
	//|	ОтчетОРозничныхПродажахЗапасы.AzRyКонтрагент КАК AzRyКонтрагент,
	|	ОтчетОРозничныхПродажахЗапасы.AzRyФормаОплаты КАК AzRyФормаОплаты
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Запасы КАК ОтчетОРозничныхПродажахЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыУпрВалюты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыДокВалюты
	|		ПО ОтчетОРозничныхПродажахЗапасы.Ссылка.ВалютаДокумента = КурсыДокВалюты.Валюта
	//Малышев 2024-10-23 ONESOFT-3537
	|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&МоментВремени,Организация = &Организация) как УчетнаяПолитикаРегл 
	|		ПО (ИСТИНА)              
	//Малышев 2024-10-23 ONESOFT-3537
	
	|ГДЕ
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.НомерСтроки КАК НомерСтроки,
	|	ТабличнаяЧасть.Ссылка.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА &РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям
	|			ТОГДА ВЫБОР
	|					КОГДА ТабличнаяЧасть.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА НАЧАЛОПЕРИОДА(ТабличнаяЧасть.Ссылка.Дата, ДЕНЬ)
	|					ИНАЧЕ НАЧАЛОПЕРИОДА(ТабличнаяЧасть.ДатаПлатежа, ДЕНЬ)
	|				КОНЕЦ
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаПлатежа,
	|	&Ссылка КАК Документ,
	|	&Организация КАК Организация,
	|	ТабличнаяЧасть.Ссылка.КассаККМ КАК КассаККМ,
	|	ТабличнаяЧасть.Ссылка.КассаККМ.СчетУчета КАК КассаККМСчетУчета,
	|	ТабличнаяЧасть.Ссылка.КассаККМ.СчетУчетаРегл КАК КассаККМСчетУчетаРегл,
	|	ТабличнаяЧасть.ЭквайринговыйТерминал.СчетУчетаРегл КАК ЭквайринговыйТерминалСчетУчетаРегл,
	|	ТабличнаяЧасть.ЭквайринговыйТерминал.Эквайрер КАК Контрагент,
	|	ТабличнаяЧасть.ЭквайринговыйТерминал.Договор КАК Договор,
	|	ТабличнаяЧасть.ЭквайринговыйТерминал.СчетУчета КАК ЭквайринговыйТерминалСчетУчета,
	|	ТабличнаяЧасть.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫРАЗИТЬ(ТабличнаяЧасть.Сумма * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ТабличнаяЧасть.Сумма КАК СуммаВал,
	|	ТабличнаяЧасть.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТабличнаяЧасть.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	ТабличнаяЧасть.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
	|	ТабличнаяЧасть.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
	|	ТабличнаяЧасть.Ссылка.Статья КАК Статья
	|ПОМЕСТИТЬ ВременнаяТаблицаОплатаПлатежнымиКартами
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.ОплатаПлатежнымиКартами КАК ТабличнаяЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТабличнаяЧасть.Ссылка.ВалютаДокумента = КурсыВалютКассы.Валюта
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетОРозничныхПродажахСкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ОтчетОРозничныхПродажахСкидкиНаценки.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА ОтчетОРозничныхПродажахСкидкиНаценки.Сумма * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ОтчетОРозничныхПродажахСкидкиНаценки.Сумма * КурсыУпрВалюты.Кратность / КурсыУпрВалюты.Курс
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ОтчетОРозничныхПродажахСкидкиНаценки.Ссылка.Дата КАК Период,
	|	ОтчетОРозничныхПродажахСкидкиНаценки.Номенклатура КАК Номенклатура,
	|	ОтчетОРозничныхПродажахСкидкиНаценки.Характеристика КАК Характеристика,
	|	ОтчетОРозничныхПродажахСкидкиНаценки.Ссылка КАК Документ,
	|	ОтчетОРозничныхПродажахСкидкиНаценки.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗапасы.СуммаБезСкидки КАК СуммаБезСкидки
	|ПОМЕСТИТЬ ВременнаяТаблицаАвтоСкидкиНаценки
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.СкидкиНаценки КАК ОтчетОРозничныхПродажахСкидкиНаценки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаВалютаУчета.Значение
	|					ИЗ
	|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаНациональнаяВалюта.Значение
	|					ИЗ
	|						Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы
	|		ПО ОтчетОРозничныхПродажахСкидкиНаценки.Номенклатура = ВременнаяТаблицаЗапасы.Номенклатура
	|			И ОтчетОРозничныхПродажахСкидкиНаценки.Характеристика = ВременнаяТаблицаЗапасы.Характеристика,
	|	Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта
	|ГДЕ
	|	ОтчетОРозничныхПродажахСкидкиНаценки.Ссылка = &Ссылка
	|	И ОтчетОРозничныхПродажахСкидкиНаценки.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
	|	МАКСИМУМ(ЭквайринговыеТерминалыВидыПлатежныхКарт.ПроцентКомиссии) КАК ПроцентКомиссии,
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка КАК ЭквайринговыйТерминал
	|ПОМЕСТИТЬ ВременнаяТаблицаПроцентыКомиссии
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы.ВидыПлатежныхКарт КАК ЭквайринговыеТерминалыВидыПлатежныхКарт
	|ГДЕ
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВременнаяТаблицаОплатаПлатежнымиКартами.ЭквайринговыйТерминал
	|			ИЗ
	|				ВременнаяТаблицаОплатаПлатежнымиКартами КАК ВременнаяТаблицаОплатаПлатежнымиКартами)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.ВидПлатежнойКарты,
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(РезервированиеЗапасовЗапасы.НомерСтроки) КАК НомерСтроки,
	|	РезервированиеЗапасовЗапасы.Ссылка КАК Ссылка,
	|	РезервированиеЗапасовЗапасы.Партия КАК Партия,
	|	РезервированиеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	РезервированиеЗапасовЗапасы.Характеристика КАК Характеристика,
	|	РезервированиеЗапасовЗапасы.Заказ КАК Заказ,
	|	РезервированиеЗапасовЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(РезервированиеЗапасовЗапасы.Количество) КАК Количество,
	|	СУММА(РезервированиеЗапасовЗапасы.Резерв) КАК Резерв
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыСгруппированная
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Запасы КАК РезервированиеЗапасовЗапасы
	|ГДЕ
	|	РезервированиеЗапасовЗапасы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РезервированиеЗапасовЗапасы.Ссылка,
	|	РезервированиеЗапасовЗапасы.Партия,
	|	РезервированиеЗапасовЗапасы.Номенклатура,
	|	РезервированиеЗапасовЗапасы.Характеристика,
	|	РезервированиеЗапасовЗапасы.Заказ,
	|	РезервированиеЗапасовЗапасы.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервированиеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	РезервированиеЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	РезервированиеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА РезервированиеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ РезервированиеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ РезервированиеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(РезервированиеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|					ТОГДА ВЫБОР
	|							КОГДА РезервированиеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ТОГДА РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|							ИНАЧЕ РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|						КОНЕЦ
	|				ИНАЧЕ РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА РезервированиеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ РезервированиеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ РезервированиеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(РезервированиеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|					ТОГДА ВЫБОР
	|							КОГДА РезервированиеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ТОГДА РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|							ИНАЧЕ РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|						КОНЕЦ
	|				ИНАЧЕ РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	РезервированиеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА РезервированиеЗапасовЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА РезервированиеЗапасовЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	РезервированиеЗапасовЗапасы.Заказ КАК ЗаказПокупателя,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК КоррЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РезервированиеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|				И РезервированиеЗапасовЗапасы.Количество > 0
	|			ТОГДА РезервированиеЗапасовЗапасы.Резерв - РезервированиеЗапасовЗапасы.Количество
	|		КОГДА ТИПЗНАЧЕНИЯ(РезервированиеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|				И РезервированиеЗапасовЗапасы.Количество <= 0
	|			ТОГДА РезервированиеЗапасовЗапасы.Резерв
	|		ИНАЧЕ (РезервированиеЗапасовЗапасы.Резерв - РезервированиеЗапасовЗапасы.Количество) * РезервированиеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	0 КАК Сумма,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит) КАК ВидДвиженияУправленческий,
	|	&РезервированиеЗапасов КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыИсточник
	|ИЗ
	|	ВременнаяТаблицаЗапасыСгруппированная КАК РезервированиеЗапасовЗапасы
	|ГДЕ
	|	РезервированиеЗапасовЗапасы.Резерв > РезервированиеЗапасовЗапасы.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.СчетУчета КАК КоррСчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК КоррСчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Номенклатура КАК КоррНоменклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Характеристика КАК КоррХарактеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.Партия КАК КоррПартия,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаЗапасы.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	ТаблицаЗапасы.ВидДвиженияУправленческий КАК ВидДвиженияУправленческий,
	|	ТаблицаЗапасы.СодержаниеПроводки КАК СодержаниеПроводки,
	|	СУММА(ТаблицаЗапасы.Количество) КАК Количество,
	|	СУММА(ТаблицаЗапасы.Сумма) КАК Сумма,
	|	ЛОЖЬ КАК ФиксированнаяСтоимость
	|ИЗ
	|	ВременнаяТаблицаЗапасыИсточник КАК ТаблицаЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.КоррЗаказПокупателя,
	|	ТаблицаЗапасы.СодержаниеПроводки,
	|	ТаблицаЗапасы.ВидДвиженияУправленческий,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетОРозничныхПродажахСерийныеНомера.КлючСвязи КАК КлючСвязи,
	|	ОтчетОРозничныхПродажахСерийныеНомера.СерийныйНомер КАК СерийныйНомер
	|ПОМЕСТИТЬ ВременнаяТаблицаСерийныеНомера
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.СерийныеНомера КАК ОтчетОРозничныхПродажахСерийныеНомера
	|ГДЕ
	|	ОтчетОРозничныхПродажахСерийныеНомера.Ссылка = &Ссылка
	|	И &ИспользоватьСерийныеНомера";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОтчетОРозничныхПродажах);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	Запрос.УстановитьПараметр("РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям", ПолучитьФункциональнуюОпцию("РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям"));
	Запрос.УстановитьПараметр("РезервированиеЗапасов", НСтр("ka='მარაგების რეზერვირება';ru='Резервирование запасов';en='inventory reservations'"));
	
	Запрос.УстановитьПараметр("ИспользоватьСерийныеНомера", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьСерийныеНомера);
    Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам); //Малышев 2024-12-06 ONESOFT-3670
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// Формирование проводок документа.
	УправлениеНебольшойФирмойСервер.СформироватьТаблицуПроводок(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДенежныеСредстваВКассахККМ(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПродажи(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗапасы(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыПринятые(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗапасыВРазрезеГТД(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаУправленческий(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ОтчетОРозничныхПродажах(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	// Щербакво ---
	
	// ДисконтныеКарты
	СформироватьТаблицаПродажиПоДисконтнойКарте(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	// АвтоматическиеСкидки
	СформироватьТаблицаПродажиПоПредоставленнымАвтоматическимСкидкам(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	// Эквайринг
	СформироватьТаблицаРасчетыПоЭквайрингу(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаПлатежнымиКартами(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	// Конец Эквайринг
	
	// Серийные номера
	СформироватьТаблицаСерийныеНомера(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);	
	
	СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	
	// Заказы покупателя в Рознице
	// Отмена резерва по заказу
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыИсточник", МассивРезультатов[6].Выгрузить());
	СформироватьТаблицаЗапасыИсточник(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗаказыПокупателей(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаКонтрольСроковГодностиТовара(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);//++Lazare 08.11.2022

	
КонецПроцедуры

&Вместо("СформироватьТаблицаДоходыИРасходы")
Процедура РасшAzRy_СформироватьТаблицаДоходыИРасходы(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства)
	
	СтруктураСчетовКурсРазниц = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(СтруктураДополнительныеСвойства.ДляПроведения.Организация, СтруктураДополнительныеСвойства.ДляПроведения.Дата);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаДоходыИРасходы.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДоходыИРасходы.Дата КАК Период,
	|	ТаблицаДоходыИРасходы.Организация КАК Организация,
	|	ТаблицаДоходыИРасходы.Подразделение КАК СтруктурнаяЕдиница,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДоходыИРасходы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаДоходыИРасходы.СчетУчетаВыручкиОтПродаж КАК СчетУчета,
	|	ТаблицаДоходыИРасходы.СчетУчетаВыручкиОтПродажРегл КАК СчетУчетаРегл,
	//Малышев 2024-10-23 ONESOFT-3537
	//|	НЕОПРЕДЕЛЕНО КАК Аналитика,
	|	ТаблицаДоходыИРасходы.Контрагент КАК Аналитика,
	//Малышев 2024-10-23 ONESOFT-3537
	|	ТаблицаДоходыИРасходы.Проект как Проект,  //Малышев 2024-12-06 ONESOFT-3670
	|	ВЫРАЗИТЬ(&ОтражениеДоходов КАК СТРОКА(100)) КАК СодержаниеПроводки,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаБезНДС) КАК СуммаДоходов,
	|	0 КАК СуммаРасходов,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаБезНДС) КАК Сумма
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаДоходыИРасходы.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент
	//|	,ТаблицаДоходыИРасходы.AzRyПроект КАК Проект
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И &ПолноеПроведение
	|	И ТаблицаДоходыИРасходы.СуммаБезНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Дата,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.Подразделение,
	|	ТаблицаДоходыИРасходы.Контрагент, //Малышев 2024-10-23 ONESOFT-3537
	|	ТаблицаДоходыИРасходы.Проект,  //Малышев 2024-12-06 ONESOFT-3670
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельности,
	|	ТаблицаДоходыИРасходы.ЗаказПокупателя,
	|	ТаблицаДоходыИРасходы.СчетУчетаВыручкиОтПродаж,
	|	ТаблицаДоходыИРасходы.СчетУчетаВыручкиОтПродажРегл
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаДоходыИРасходы.AzRyАналитикаКонтрагент
	//|	,ТаблицаДоходыИРасходы.AzRyПроект
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчета
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	НЕОПРЕДЕЛЕНО,  //Малышев 2024-12-06 ONESOFT-3670
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,NULL
	//|	,NULL
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницДенежныеСредстваВКассахККМ КАК ТаблицаДокумента
	|ГДЕ
	|	&ПолноеПроведение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеДоходы);
	Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеРасходы);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ОтражениеДоходов", НСтр("ka='შემოსავლების ასახვა';ru='Отражение доходов';en='income'"));
	Запрос.УстановитьПараметр("ПолноеПроведение", СтруктураДополнительныеСвойства.ДляПроведения.ПолноеПроведение);
	
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность);
		
	Иначе
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);

	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&Вместо("СформироватьТаблицаЗапасы")
Процедура РасшAzRy_СформироватьТаблицаЗапасы(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаЗапасы.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.Документ КАК Документ,
	|	ТаблицаЗапасы.Документ КАК ДокументПродажи,
	|	ТаблицаЗапасы.Подразделение КАК Подразделение,
	|	ТаблицаЗапасы.Ответственный КАК Ответственный,
	|	ТаблицаЗапасы.ТоварыНаКомиссии КАК ТоварыНаКомиссии,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПродажи,
	|	ТаблицаЗапасы.Контрагент КАК Контрагент,       //Малышев 2024-10-23 ONESOFT-3537
	|	ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК СтруктурнаяЕдиница,
	|	ЕСТЬNULL(ТаблицаЗапасы.КоррСтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчетаЗапасов КАК СчетУчета,
	|	ТаблицаЗапасы.КоррСчетУчетаЗапасов КАК КоррСчетУчета,
	//+++ Дмгг
	|	ТаблицаЗапасы.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.КоррСчетУчетаЗапасовРегл КАК КоррСчетУчетаРегл,
	//--- Дмгг
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТаблицаЗапасы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаЗапасы.КоррНоменклатура КАК КоррНоменклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.КоррХарактеристика КАК КоррХарактеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.Проект КАК Проект,  //Малышев 2024-12-06 ONESOFT-3670
	|	ТаблицаЗапасы.КоррПартия КАК КоррПартия,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	НЕОПРЕДЕЛЕНО КАК КоррЗаказПокупателя,
	|	ТаблицаЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ТаблицаЗапасы.Количество) КАК Количество,
	|	СУММА(ТаблицаЗапасы.Резерв) КАК Резерв,
	|	СУММА(ТаблицаЗапасы.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ТаблицаЗапасы.Сумма) КАК Сумма,
	|	0 КАК Себестоимость,
	|	ЛОЖЬ КАК ФиксированнаяСтоимость,
	|	ТаблицаЗапасы.СчетУчетаСебестоимостиПродаж КАК СчетДт,
	|	ТаблицаЗапасы.СчетУчетаЗапасов КАК СчетКт,
	//+++ Дмгг
	|	ТаблицаЗапасы.СчетУчетаСебестоимостиПродажРегл КАК СчетДтРегл,
	|	ТаблицаЗапасы.СчетУчетаЗапасовРегл КАК СчетКтРегл,
	|	ЛОЖЬ КАК Резервирование,//+++ Дмгг
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация, //+++ Дмгг
	//--- Дмгг
	|	ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100)) КАК Содержание,
	|	ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100)) КАК СодержаниеПроводки,
	|	ТаблицаЗапасы.СчетУчетаЗапасовРегл,
	|	ТаблицаЗапасы.КоррСчетУчетаЗапасовРегл
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаЗапасы.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	//|	ТаблицаЗапасы.AzRyПроект КАК Проект,
	//|	ТаблицаЗапасы.AzRyКонтрагент КАК Контрагент,
	|	ТаблицаЗапасы.AzRyФормаОплаты КАК AzRyФормаОплаты
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыПодготовленная
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Дата,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Документ,
	|	ТаблицаЗапасы.Подразделение,
	|	ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)),
	|	ЕСТЬNULL(ТаблицаЗапасы.КоррСтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)),
	|	ТаблицаЗапасы.СчетУчетаЗапасов,
	|	ТаблицаЗапасы.КоррСчетУчетаЗапасов,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.ТипНоменклатуры,
	|	ТаблицаЗапасы.НаправлениеДеятельности,
	|	ТаблицаЗапасы.КоррНоменклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.КоррХарактеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.Проект,  //Малышев 2024-12-06 ONESOFT-3670
	|	ТаблицаЗапасы.КоррПартия,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.Контрагент, //Малышев 2024-10-23 ONESOFT-3537
	|	ТаблицаЗапасы.СтавкаНДС,
	|	ТаблицаЗапасы.СчетУчетаСебестоимостиПродаж,
	|	ТаблицаЗапасы.ТоварыНаКомиссии,
	|	ТаблицаЗапасы.Ответственный,
	|	ТаблицаЗапасы.СчетУчетаЗапасовРегл,
	|	ТаблицаЗапасы.КоррСчетУчетаЗапасовРегл,
	|	ТаблицаЗапасы.Документ,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.СчетУчетаЗапасов,
	//+++ Дмгг
	|	ТаблицаЗапасы.СчетУчетаСебестоимостиПродажРегл,
	|	ТаблицаЗапасы.СчетУчетаЗапасовРегл
	//--- Дмгг
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаЗапасы.AzRyАналитикаКонтрагент,
	//|	ТаблицаЗапасы.AzRyПроект,
	//|	ТаблицаЗапасы.AzRyКонтрагент,
	|	ТаблицаЗапасы.AzRyФормаОплаты
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаЗапасы.НомерСтроки,
	|	ВременнаяТаблицаЗапасы.Период,
	|	ВременнаяТаблицаЗапасы.ВидДвижения,
	|	ВременнаяТаблицаЗапасы.Организация,
	|	ВременнаяТаблицаЗапасы.Документ,
	|	ВременнаяТаблицаЗапасы.ДокументПродажи,
	|	ВременнаяТаблицаЗапасы.Подразделение,
	|	ВременнаяТаблицаЗапасы.Ответственный,
	|	ВременнаяТаблицаЗапасы.ТоварыНаКомиссии,
	|	ВременнаяТаблицаЗапасы.ЗаказПродажи,
	|	ВременнаяТаблицаЗапасы.Контрагент, //Малышев 2024-10-23 ONESOFT-3537
	|	ВременнаяТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗапасы.КоррСтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗапасы.СчетУчета,
	|	ВременнаяТаблицаЗапасы.КоррСчетУчета,
	//+++ Дмгг
	|	ВременнаяТаблицаЗапасы.СчетУчетаРегл,
	|	ВременнаяТаблицаЗапасы.КоррСчетУчетаРегл,
	//--- Дмгг
	|	ВременнаяТаблицаЗапасы.Номенклатура,
	|	ВременнаяТаблицаЗапасы.ТипНоменклатуры,
	|	ВременнаяТаблицаЗапасы.НаправлениеДеятельности,
	|	ВременнаяТаблицаЗапасы.КоррНоменклатура,
	|	ВременнаяТаблицаЗапасы.Характеристика,
	|	ВременнаяТаблицаЗапасы.КоррХарактеристика,
	|	ВременнаяТаблицаЗапасы.Партия,
	|	ВременнаяТаблицаЗапасы.Проект,  //Малышев 2024-12-06 ONESOFT-3670
	|	ВременнаяТаблицаЗапасы.КоррПартия,
	|	ВременнаяТаблицаЗапасы.ЗаказПокупателя,
	|	ВременнаяТаблицаЗапасы.КоррЗаказПокупателя,
	|	ВременнаяТаблицаЗапасы.СтавкаНДС,
	|	ВременнаяТаблицаЗапасы.Количество,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаЗапасы.Резерв > ВременнаяТаблицаЗапасы.Количество
	|				И ВременнаяТаблицаЗапасы.Количество > 0
	|			ТОГДА ВременнаяТаблицаЗапасы.Количество
	|		КОГДА ВременнаяТаблицаЗапасы.Количество <= 0
	|			ТОГДА 0
	|		ИНАЧЕ ВременнаяТаблицаЗапасы.Резерв
	|	КОНЕЦ КАК Резерв,
	|	ВременнаяТаблицаЗапасы.СуммаНДС,
	|	ВременнаяТаблицаЗапасы.Сумма,
	|	ВременнаяТаблицаЗапасы.Себестоимость,
	|	ВременнаяТаблицаЗапасы.ФиксированнаяСтоимость,
	|	ВременнаяТаблицаЗапасы.СчетДт,
	|	ВременнаяТаблицаЗапасы.СчетКт,
	//+++ Дмгг
	|	ВременнаяТаблицаЗапасы.СчетДтРегл,
	|	ВременнаяТаблицаЗапасы.СчетКтРегл,
	|	ВременнаяТаблицаЗапасы.Резервирование КАК Резервирование,//+++ Дмгг
	|	ВременнаяТаблицаЗапасы.ХозяйственнаяОперация КАК ХозяйственнаяОперация, //+++ Дмгг
	//--- Дмгг
	|	ВременнаяТаблицаЗапасы.Содержание,
	|	ВременнаяТаблицаЗапасы.СодержаниеПроводки,
	|	ВременнаяТаблицаЗапасы.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|	ВременнаяТаблицаЗапасы.КоррСчетУчетаЗапасовРегл КАК КоррСчетУчетаРегл
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ВременнаяТаблицаЗапасы.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	|	ВременнаяТаблицаЗапасы.Проект КАК Проект,
	|	ВременнаяТаблицаЗапасы.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаЗапасы.AzRyФормаОплаты КАК AzRyФормаОплаты
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|ИЗ
	|	ВременнаяТаблицаЗапасыПодготовленная КАК ВременнаяТаблицаЗапасы";
	
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='მარაგების შემოსავალში აყვანა';ru='Оприходование запасов';en='Posting of Goods'"));
	Запрос.УстановитьПараметр("СписаниеЗапасов", НСтр("ka='მარაგების ჩამოწერა';ru='Списание запасов';en='Write-off stocks'"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());
	
	СформироватьТаблицаЗапасыПродажа(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

&Вместо("СформироватьТаблицаПродажи")
Процедура РасшAzRy_СформироватьТаблицаПродажи(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПродажи.Дата КАК Период,
	|	ТаблицаПродажи.Организация КАК Организация,
	|	ТаблицаПродажи.Номенклатура КАК Номенклатура,
	|	ТаблицаПродажи.Характеристика КАК Характеристика,
	|	ТаблицаПродажи.Партия КАК Партия,
	|	ТаблицаПродажи.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаПродажи.Документ КАК Документ,
	|	ТаблицаПродажи.Проект КАК Прект,  //Малышев 2024-12-06 ONESOFT-3670
	|	ТаблицаПродажи.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаПродажи.Подразделение КАК Подразделение,
	|	ТаблицаПродажи.Ответственный КАК Ответственный,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	|	СУММА(ТаблицаПродажи.СуммаНДСЗакупкиПродажи) КАК СуммаНДС,
	|	СУММА(ТаблицаПродажи.Сумма) КАК Сумма,
	|	0 КАК Себестоимость,
	// +++ { AzRy - [08.09.2022] - Jira: - Developer:გიორგი მამულაშვილი - Comment: ჩვენი დამატებულ კონტრაგენტის ველს ვიყენებთ
	//|	УчетнаяПолитикаРеглСрезПоследних.РозничныйКонтрагент КАК Контрагент
	// +++ } AzRy - [08.09.2022] - Jira: - Developer:გიორგი მამულაშვილი - Comment: ჩვენი დამატებულ კონტრაგენტის ველს ვიყენებთ
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	ТаблицаПродажи.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	//|	ТаблицаПродажи.Проект КАК Проект,
	//|	ТаблицаПродажи.Контрагент КАК Контрагент 
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	ТаблицаПродажи.Контрагент КАК Контрагент
											 
 
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних КАК УчетнаяПолитикаРеглСрезПоследних
	|		ПО ТаблицаПродажи.Организация = УчетнаяПолитикаРеглСрезПоследних.Организация
	|ГДЕ
	|	&ПолноеПроведение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Дата,
	|	ТаблицаПродажи.Организация,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Характеристика,
	|	ТаблицаПродажи.Партия,
	|	ТаблицаПродажи.ЗаказПокупателя,
	|	ТаблицаПродажи.Документ,
	|	ТаблицаПродажи.Проект,  //Малышев 2024-12-06 ONESOFT-3670
	|	ТаблицаПродажи.СтавкаНДС,
	|	ТаблицаПродажи.Подразделение,
	|	ТаблицаПродажи.Ответственный,
	// +++ { AzRy - [08.09.2022] - Jira: - Developer:გიორგი მამულაშვილი - Comment: ჩვენი დამატებულ კონტრაგენტის ველს ვიყენებთ
	//|	УчетнаяПолитикаРеглСрезПоследних.РозничныйКонтрагент
	// +++ } AzRy - [08.09.2022] - Jira: - Developer:გიორგი მამულაშვილი - Comment: ჩვენი დამატებულ კონტრაგენტის ველს ვიყენებთ
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	ТаблицаПродажи.AzRyАналитикаКонтрагент,
	//|	ТаблицаПродажи.Проект,
	//|	ТаблицаПродажи.Контрагент
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|	ТаблицаПродажи.Контрагент
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ТаблицаПродажи.Количество) <> 0
	|		ИЛИ СУММА(ТаблицаПродажи.СуммаНДСЗакупкиПродажи) <> 0
	|		ИЛИ СУММА(ТаблицаПродажи.Сумма) <> 0)";
	
	Запрос.УстановитьПараметр("ПолноеПроведение", СтруктураДополнительныеСвойства.ДляПроведения.ПолноеПроведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажи", РезультатЗапроса.Выгрузить());
 
КонецПроцедуры

//&Вместо("СформироватьТаблицаЗапасыНаСкладах")
//Процедура РасшAzRy_СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства)
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//	|	ТаблицаЗапасыНаСкладах.Дата КАК Период,
//	|	ТаблицаЗапасыНаСкладах.Организация КАК Организация,
//	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
//	|	ТаблицаЗапасыНаСкладах.Характеристика КАК Характеристика,
//	|	ТаблицаЗапасыНаСкладах.Партия КАК Партия,
//	|	ТаблицаЗапасыНаСкладах.Проект КАК Проект,  //Малышев 2024-12-06 ONESOFT-3670
//	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	ТаблицаЗапасыНаСкладах.Ячейка КАК Ячейка,
//	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
//	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
//	|	,ТаблицаЗапасыНаСкладах.AzRyПроект КАК Проект 
//	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
//	|ИЗ
//	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
//	|ГДЕ
//	|	ТаблицаЗапасыНаСкладах.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
//	|	И &ПолноеПроведение
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаЗапасыНаСкладах.Дата,
//	|	ТаблицаЗапасыНаСкладах.Организация,
//	|	ТаблицаЗапасыНаСкладах.Номенклатура,
//	|	ТаблицаЗапасыНаСкладах.Характеристика,
//	|	ТаблицаЗапасыНаСкладах.Партия,
//	|	ТаблицаЗапасыНаСкладах.Проект,  //Малышев 2024-12-06 ONESOFT-3670
//	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница,
//	|	ТаблицаЗапасыНаСкладах.Ячейка
//	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
//	|	,ТаблицаЗапасыНаСкладах.AzRyПроект
//	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
//	|
//	|ИМЕЮЩИЕ
//	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) <> 0";
//	
//	Запрос.УстановитьПараметр("ПолноеПроведение", СтруктураДополнительныеСвойства.ДляПроведения.ПолноеПроведение);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
//	
//КонецПроцедуры

//&Вместо("СформироватьТаблицаЗапасыПродажа_Deprecated")
//Процедура РасшAzRy_СформироватьТаблицаЗапасыПродажа(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства)
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
//	
//	// Установка исключительной блокировки контролируемых остатков запасов.
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ТаблицаЗапасы.Организация КАК Организация,
//	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
//	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
//	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
//	|	ТаблицаЗапасы.Партия КАК Партия,
//	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
//	|	ТаблицаЗапасы.СчетУчетаРегл
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		ТаблицаЗапасы.Организация КАК Организация,
//	|		ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|		ТаблицаЗапасы.СчетУчетаЗапасов КАК СчетУчета,
//	|		ТаблицаЗапасы.Номенклатура КАК Номенклатура,
//	|		ТаблицаЗапасы.Характеристика КАК Характеристика,
//	|		ТаблицаЗапасы.Партия КАК Партия,
//	|		ВЫБОР
//	|			КОГДА ТаблицаЗапасы.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя
//	|				ТОГДА ТаблицаЗапасы.ЗаказПокупателя
//	|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|		КОНЕЦ КАК ЗаказПокупателя,
//	|		ТаблицаЗапасы.СчетУчетаЗапасовРегл КАК СчетУчетаРегл
//	|	ИЗ
//	|		ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
//	|	ГДЕ
//	|		ТаблицаЗапасы.ЗаказПокупателя <> НЕОПРЕДЕЛЕНО
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ТаблицаЗапасы.Организация,
//	|		ТаблицаЗапасы.СтруктурнаяЕдиница,
//	|		ТаблицаЗапасы.СчетУчетаЗапасов,
//	|		ТаблицаЗапасы.Номенклатура,
//	|		ТаблицаЗапасы.Характеристика,
//	|		ТаблицаЗапасы.Партия,
//	|		ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
//	|		ТаблицаЗапасы.СчетУчетаЗапасовРегл
//	|	ИЗ
//	|		ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы) КАК ТаблицаЗапасы
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаЗапасы.Организация,
//	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
//	|	ТаблицаЗапасы.СчетУчета,
//	|	ТаблицаЗапасы.Номенклатура,
//	|	ТаблицаЗапасы.Характеристика,
//	|	ТаблицаЗапасы.Партия,
//	|	ТаблицаЗапасы.ЗаказПокупателя,
//	|	ТаблицаЗапасы.СчетУчетаРегл";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Блокировка = Новый БлокировкаДанных;
//	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Запасы");
//	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
//	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
//	
//	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
//		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
//	КонецЦикла;
//	Блокировка.Заблокировать();
//	
//	// Получение остатков запасов по стоимости.
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ЗапасыОстатки.Организация КАК Организация,
//	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
//	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
//	|	ЗапасыОстатки.Характеристика КАК Характеристика,
//	|	ЗапасыОстатки.Партия КАК Партия,
//	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
//	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
//	|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток,
//	|	ЗапасыОстатки.СчетУчетаРегл
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		ЗапасыОстатки.Организация КАК Организация,
//	|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
//	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
//	|		ЗапасыОстатки.Характеристика КАК Характеристика,
//	|		ЗапасыОстатки.Партия КАК Партия,
//	|		ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
//	|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток,
//	|		ЗапасыОстатки.СуммаОстаток КАК СуммаОстаток,
//	|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл
//	|	ИЗ
//	|		РегистрНакопления.Запасы.Остатки(
//	|				&МоментКонтроля,
//	//|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
//	// +++ { AzRy - [18.01.2022] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment: თვითღირებულების სწორედ წამოღების მიზნით შეტანილი ცვლილება (ძველ გადმოტანილ დოკუმენტებზე, თუმცა ახალ დოკუმენტებზეც იგივე პრობლემა იქნება)
//	//|				(Организация, СтруктурнаяЕдиница, СчетУчета, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
//	|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
//	// +++ } AzRy - [18.01.2022] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment: თვითღირებულების სწორედ წამოღების მიზნით შეტანილი ცვლილება (ძველ გადმოტანილ დოკუმენტებზე, თუმცა ახალ დოკუმენტებზეც იგივე პრობლემა იქნება)	
//	|					(ВЫБРАТЬ
//	|						ТаблицаЗапасы.Организация КАК Организация,
//	|						ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	// +++ { AzRy - [18.01.2022] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment: თვითღირებულების სწორედ წამოღების მიზნით შეტანილი ცვლილება (ძველ გადმოტანილ დოკუმენტებზე, თუმცა ახალ დოკუმენტებზეც იგივე პრობლემა იქნება)	
//	//|						ТаблицаЗапасы.СчетУчетаЗапасов КАК СчетУчета,
//	// +++ } AzRy - [18.01.2022] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment: თვითღირებულების სწორედ წამოღების მიზნით შეტანილი ცვლილება (ძველ გადმოტანილ დოკუმენტებზე, თუმცა ახალ დოკუმენტებზეც იგივე პრობლემა იქნება)
//	|						ТаблицаЗапасы.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,//+++ Дмгг
//	|						ТаблицаЗапасы.Номенклатура КАК Номенклатура,
//	|						ТаблицаЗапасы.Характеристика КАК Характеристика,
//	|						ТаблицаЗапасы.Партия КАК Партия,
//	|						ВЫБОР
//	|							КОГДА ТаблицаЗапасы.ЗаказПокупателя <> НЕОПРЕДЕЛЕНО
//	|								ТОГДА ВЫБОР
//	|										КОГДА ТаблицаЗапасы.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя
//	|											ТОГДА ТаблицаЗапасы.ЗаказПокупателя
//	|										ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|									КОНЕЦ
//	|							ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|						КОНЕЦ КАК ЗаказПокупателя
//	|					ИЗ
//	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
//	|					ГДЕ
//	|						ВЫБОР
//	|							КОГДА ТаблицаЗапасы.ЗаказПокупателя <> НЕОПРЕДЕЛЕНО
//	|								ТОГДА ВЫБОР
//	|										КОГДА ТаблицаЗапасы.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя
//	|											ТОГДА ТаблицаЗапасы.ЗаказПокупателя
//	|										ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|									КОНЕЦ
//	|							ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|						КОНЕЦ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|				
//	|					ОБЪЕДИНИТЬ ВСЕ
//	|				
//	|					ВЫБРАТЬ
//	|						ТаблицаЗапасы.Организация,
//	|						ТаблицаЗапасы.СтруктурнаяЕдиница,
//	// +++ { AzRy - [18.01.2022] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment: თვითღირებულების სწორედ წამოღების მიზნით შეტანილი ცვლილება (ძველ გადმოტანილ დოკუმენტებზე, თუმცა ახალ დოკუმენტებზეც იგივე პრობლემა იქნება)	
//	//|						ТаблицаЗапасы.СчетУчетаЗапасов,
//	// +++ } AzRy - [18.01.2022] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment: თვითღირებულების სწორედ წამოღების მიზნით შეტანილი ცვლილება (ძველ გადმოტანილ დოკუმენტებზე, თუმცა ახალ დოკუმენტებზეც იგივე პრობლემა იქნება)
//	|						ТаблицаЗапасы.СчетУчетаЗапасовРегл, //+++ Дмгг
//	|						ТаблицаЗапасы.Номенклатура,
//	|						ТаблицаЗапасы.Характеристика,
//	|						ТаблицаЗапасы.Партия,
//	|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
//	|					ИЗ
//	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ДвиженияДокументаЗапасы.Организация,
//	|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
//	|		ДвиженияДокументаЗапасы.СчетУчета,
//	|		ДвиженияДокументаЗапасы.Номенклатура,
//	|		ДвиженияДокументаЗапасы.Характеристика,
//	|		ДвиженияДокументаЗапасы.Партия,
//	|		ДвиженияДокументаЗапасы.ЗаказПокупателя,
//	|		ВЫБОР
//	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|				ТОГДА ДвиженияДокументаЗапасы.Количество
//	|			ИНАЧЕ -ДвиженияДокументаЗапасы.Количество
//	|		КОНЕЦ,
//	|		ВЫБОР
//	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|				ТОГДА ДвиженияДокументаЗапасы.Сумма
//	|			ИНАЧЕ -ДвиженияДокументаЗапасы.Сумма
//	|		КОНЕЦ,
//	|		ДвиженияДокументаЗапасы.СчетУчетаРегл
//	|	ИЗ
//	|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
//	|	ГДЕ
//	|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
//	|		И ДвиженияДокументаЗапасы.Период <= &ПериодКонтроля) КАК ЗапасыОстатки
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ЗапасыОстатки.Организация,
//	|	ЗапасыОстатки.СтруктурнаяЕдиница,
//	|	ЗапасыОстатки.СчетУчета,
//	|	ЗапасыОстатки.Номенклатура,
//	|	ЗапасыОстатки.Характеристика,
//	|	ЗапасыОстатки.Партия,
//	|	ЗапасыОстатки.ЗаказПокупателя,
//	|	ЗапасыОстатки.СчетУчетаРегл";
//	
//	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЧекККМ);
//	Запрос.УстановитьПараметр("МоментКонтроля", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
//	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ТаблицаЗапасыОстатки = РезультатЗапроса.Выгрузить();
//	ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,Номенклатура,Характеристика,Партия,ЗаказПокупателя");
//	
//	ТаблицаЗапасыОстаткиПодРезерв = ТаблицаЗапасыОстатки.Скопировать();
//	Если СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда 
//		
//		ТекстЗапроса = ПолучитьТекстЗапросаБезФильтрЗаказов();
//		
//		Запрос.Текст = ТекстЗапроса;
//		ТаблицаЗапасыОстаткиПодРезерв = Запрос.Выполнить().Выгрузить();
//		
//		//ТаблицаЗапасыОстаткиПодРезерв.Свернуть("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,Номенклатура,Характеристика,Партия","КоличествоОстаток,СуммаОстаток");
//		ТаблицаЗапасыОстаткиПодРезерв.Свернуть("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия","КоличествоОстаток,СуммаОстаток");
//		
//	КонецЕсли;
//	
//	ВременнаяТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.СкопироватьКолонки();
//	
//	ФункционалСбораТоваров = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалСбораТоваров");
//	
//	Для н = 0 По СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Количество() - 1 Цикл
//		
//		СтрокаТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы[н];
//		
//		СтруктураДляПоиска = Новый Структура;
//		СтруктураДляПоиска.Вставить("Организация", СтрокаТаблицаЗапасы.Организация);
//		СтруктураДляПоиска.Вставить("СтруктурнаяЕдиница", СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
//		//СтруктураДляПоиска.Вставить("СчетУчета", СтрокаТаблицаЗапасы.СчетУчета);
//		СтруктураДляПоиска.Вставить("СчетУчетаРегл", СтрокаТаблицаЗапасы.СчетУчетаРегл);
//		СтруктураДляПоиска.Вставить("Номенклатура", СтрокаТаблицаЗапасы.Номенклатура);
//		СтруктураДляПоиска.Вставить("Характеристика", СтрокаТаблицаЗапасы.Характеристика);
//		СтруктураДляПоиска.Вставить("Партия", СтрокаТаблицаЗапасы.Партия);
//		
//		КоличествоТребуетсяРезерв = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.Резерв), СтрокаТаблицаЗапасы.Резерв, 0);
//		КоличествоТребуетсяСвободныйОстаток = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.Количество), СтрокаТаблицаЗапасы.Количество, 0);
//		КоличествоТребуетсяВсего = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.Количество), СтрокаТаблицаЗапасы.Количество, 0);
//		
//		СебестоимостьЕдиницы = 0; //+++ Дмгг
//		
//		Если КоличествоТребуетсяРезерв > 0 Тогда
//			
//			КоличествоТребуетсяСвободныйОстаток = КоличествоТребуетсяСвободныйОстаток - КоличествоТребуетсяРезерв;
//			
//			//СтруктураДляПоиска.Вставить("ЗаказПокупателя", СтрокаТаблицаЗапасы.ЗаказПокупателя);  //+++ Дмгг
//			Если НЕ СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда 
//				
//				СтруктураДляПоиска.Вставить("ЗаказПокупателя", СтрокаТаблицаЗапасы.ЗаказПокупателя);
//				
//			КонецЕсли;
//			//--- Дмгг
//			
//			МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
//			
//			КоличествоОстаток = 0;
//			СуммаОстаток = 0;
//			
//			Если МассивСтрокОстатков.Количество() > 0 Тогда
//				КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
//				СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток;
//			КонецЕсли;
//			
//			Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуетсяРезерв Тогда
//				
//				СуммаКСписанию = Окр(СуммаОстаток * КоличествоТребуетсяРезерв / КоличествоОстаток , 2, 1);
//				
//				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуетсяРезерв;
//				МассивСтрокОстатков[0].СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток - СуммаКСписанию;
//				
//			ИначеЕсли КоличествоОстаток = КоличествоТребуетсяРезерв Тогда
//				
//				СуммаКСписанию = СуммаОстаток;
//				
//				МассивСтрокОстатков[0].КоличествоОстаток = 0;
//				МассивСтрокОстатков[0].СуммаОстаток = 0;
//				
//			Иначе
//				СуммаКСписанию = 0;
//			КонецЕсли;
//			
//			//+++ Дмгг
//			// добавим себестоимость что бы обнулялся заказ
//			Если СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда
//				
//				СтруктураДляПоиска.Удалить("ЗаказПокупателя");
//				
//				МассивСтрокОстатковКорректировкиСебестоимости = ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
//				
//				КоличествоОстатокКорр = 0;
//				СуммаОстатокКорр = 0;
//				
//				Если МассивСтрокОстатковКорректировкиСебестоимости.Количество() > 0 Тогда
//					КоличествоОстатокКорр = МассивСтрокОстатковКорректировкиСебестоимости[0].КоличествоОстаток;
//					СуммаОстатокКорр = МассивСтрокОстатковКорректировкиСебестоимости[0].СуммаОстаток;
//				КонецЕсли;
//				//+++ Дмгг
//				Если СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда
//					СебестоимостьЕдиницы = Окр(Окр(СуммаОстатокКорр * КоличествоТребуетсяВсего / КоличествоОстатокКорр , 2, 1) / КоличествоТребуетсяВсего, 3, 1);
//				КонецЕсли;
//				//+++ Дмгг
//				Если КоличествоОстатокКорр > 0 И КоличествоОстатокКорр > КоличествоТребуетсяРезерв Тогда
//					                                //+++ Дмгг Себ
//					СуммаКСписаниюКорр = ?(СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости И СебестоимостьЕдиницы <> 0, Окр(СебестоимостьЕдиницы * КоличествоТребуетсяРезерв, 2, 1)
//											,Окр(СуммаОстатокКорр * КоличествоТребуетсяРезерв / КоличествоОстатокКорр , 2, 1));//Окр(СуммаОстатокКорр * КоличествоТребуетсяРезерв / КоличествоОстатокКорр , 2, 1);
//					
//					МассивСтрокОстатковКорректировкиСебестоимости[0].КоличествоОстаток = МассивСтрокОстатковКорректировкиСебестоимости[0].КоличествоОстаток - КоличествоТребуетсяРезерв;
//					МассивСтрокОстатковКорректировкиСебестоимости[0].СуммаОстаток = МассивСтрокОстатковКорректировкиСебестоимости[0].СуммаОстаток - СуммаКСписаниюКорр;
//					
//				ИначеЕсли КоличествоОстатокКорр = КоличествоТребуетсяРезерв Тогда
//					
//					СуммаКСписаниюКорр = СуммаОстатокКорр;
//					
//					МассивСтрокОстатковКорректировкиСебестоимости[0].КоличествоОстаток = 0;
//					МассивСтрокОстатковКорректировкиСебестоимости[0].СуммаОстаток = 0;
//					
//				Иначе
//					СуммаКСписаниюКорр = 0;
//				КонецЕсли;
//				//	
//				СуммаПровдки =  СуммаКСписаниюКорр - СуммаКСписанию;
//				
//				СтрокаТаблицыРасходДляСебестоимости = ВременнаяТаблицаЗапасы.Добавить();
//				ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасходДляСебестоимости, СтрокаТаблицаЗапасы);
//				//	
//				
//				ПериодПроводкиКорректировки = СтрокаТаблицыРасходДляСебестоимости.Период;
//				Если ЗначениеЗаполнено(СтрокаТаблицаЗапасы.ЗаказПокупателя) Тогда 
//					Если ФункционалСбораТоваров И ЗначениеЗаполнено(СтрокаТаблицаЗапасы.ЗаказПокупателя.ДатаКонцаСобран) Тогда 
//						ПериодПроводкиКорректировки = СтрокаТаблицаЗапасы.ЗаказПокупателя.ДатаКонцаСобран;
//					ИначеЕсли ФункционалСбораТоваров Тогда 
//						ПериодПроводкиКорректировки = СтрокаТаблицаЗапасы.ЗаказПокупателя.Дата;
//					КонецЕсли;
//				КонецЕсли;
//				
//				СтрокаТаблицыРасходДляСебестоимости.ВидДвижения = ВидДвиженияНакопления.Расход;
//				СтрокаТаблицыРасходДляСебестоимости.Сумма = СуммаКСписаниюКорр;
//				СтрокаТаблицыРасходДляСебестоимости.Количество = 0; // количество уже было сделанов заказе
//				СтрокаТаблицыРасходДляСебестоимости.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
//				СтрокаТаблицыРасходДляСебестоимости.Период = ПериодПроводкиКорректировки;//?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.ЗаказПокупателя), СтрокаТаблицаЗапасы.ЗаказПокупателя.Дата, СтрокаТаблицыРасходДляСебестоимости.Период);
//				СтрокаТаблицыРасходДляСебестоимости.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ЗаказПокупателя.СтруктурнаяЕдиницаРезерв;
//				СтрокаТаблицыРасходДляСебестоимости.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ЗаказПокупателя.СтруктурнаяЕдиницаРезерв;//СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
//				СтрокаТаблицыРасходДляСебестоимости.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
//				СтрокаТаблицыРасходДляСебестоимости.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
//				СтрокаТаблицыРасходДляСебестоимости.КоррЗаказПокупателя = СтрокаТаблицаЗапасы.ЗаказПокупателя;
//				СтрокаТаблицыРасходДляСебестоимости.ЗаказПродажи = Документы.ЗаказПокупателя.ПустаяСсылка();
//				СтрокаТаблицыРасходДляСебестоимости.ДокументПродажи  = Неопределено;
//				СтрокаТаблицыРасходДляСебестоимости.Подразделение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
//				СтрокаТаблицыРасходДляСебестоимости.Ответственный = Справочники.Сотрудники.ПустаяСсылка();
//				СтрокаТаблицыРасходДляСебестоимости.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
//				СтрокаТаблицыРасходДляСебестоимости.СодержаниеПроводки = НСтр("ka='მარაგების რეზერვირება';ru='Резервирование запасов';en='inventory reservations'");
//				СтрокаТаблицыРасходДляСебестоимости.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗаказНаПродажу;
//				СтрокаТаблицыРасходДляСебестоимости.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
//				СтрокаТаблицыРасходДляСебестоимости.Резервирование = Истина;
//			////	
//				СтрокаТаблицыПриход = ВременнаяТаблицаЗапасы.Добавить();
//				ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриход, СтрокаТаблицаЗапасы);
//				
//				СтрокаТаблицыПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
//				СтрокаТаблицыПриход.Сумма = СуммаКСписаниюКорр;
//				СтрокаТаблицыПриход.Количество = 0; // количество уже было сделанов заказе
//				СтрокаТаблицыПриход.Период = ПериодПроводкиКорректировки;//?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.ЗаказПокупателя), СтрокаТаблицаЗапасы.ЗаказПокупателя.Дата, СтрокаТаблицыПриход.Период);
//				СтрокаТаблицыПриход.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ЗаказПокупателя.СтруктурнаяЕдиницаРезерв;
//				СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ЗаказПокупателя.СтруктурнаяЕдиницаРезерв;//СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
//				СтрокаТаблицыПриход.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
//				СтрокаТаблицыПриход.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
//				СтрокаТаблицыПриход.КоррЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
//				СтрокаТаблицыПриход.ЗаказПродажи = Документы.ЗаказПокупателя.ПустаяСсылка();
//				СтрокаТаблицыПриход.ДокументПродажи  = Неопределено;
//				СтрокаТаблицыПриход.Подразделение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
//				СтрокаТаблицыПриход.Ответственный = Справочники.Сотрудники.ПустаяСсылка();
//				СтрокаТаблицыПриход.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
//				СтрокаТаблицыПриход.СодержаниеПроводки = НСтр("ka='მარაგების რეზერვირება';ru='Резервирование запасов';en='inventory reservations'");
//				СтрокаТаблицыПриход.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗаказНаПродажу;
//				СтрокаТаблицыПриход.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
//				СтрокаТаблицыПриход.Резервирование = Истина;
//			//	
//			КонецЕсли;
//			//--- Дмгг
//			
//			// Расход. Запасы.
//			СтрокаТаблицыРасход = ВременнаяТаблицаЗапасы.Добавить();
//			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
//			
//			СтрокаТаблицыРасход.Сумма = ?(СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости, СуммаКСписаниюКорр, СуммаКСписанию);//СуммаКСписанию;
//			СтрокаТаблицыРасход.Количество = КоличествоТребуетсяРезерв;
//			
//			Если СтрокаТаблицаЗапасы.ТоварыНаКомиссии Тогда
//				
//				СтрокаТаблицыРасход.СодержаниеПроводки = Неопределено;
//				
//			// Сформируем проводки.
//			//+++ Дмгг
//			//ИначеЕсли Окр(СуммаКСписанию, 2, 1) <> 0 Тогда
//			ИначеЕсли (Окр(СуммаКСписанию, 2, 1) <> 0 И НЕ СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости) 
//				ИЛИ (Окр(СуммаКСписаниюКорр, 2, 1) <> 0 И СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости)Тогда
//				
//				// Сформируем проводки.
//				СтрокаТаблицаУправленческий = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
//				ЗаполнитьЗначенияСвойств(СтрокаТаблицаУправленческий, СтрокаТаблицаЗапасы);
//				СтрокаТаблицаУправленческий.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
//				СтрокаТаблицаУправленческий.Сумма = ?(СуммаКСписанию = 0, СуммаКСписаниюКорр, СуммаКСписанию);;
//				
//				// Щербаков +++
//				СтрокаТаблицаХозрасчетный = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
//				ЗаполнитьЗначенияСвойств(СтрокаТаблицаХозрасчетный, СтрокаТаблицаЗапасы);
//				СтрокаТаблицаХозрасчетный.Сумма = ?(СуммаКСписанию = 0, СуммаКСписаниюКорр, СуммаКСписанию);
//				СтрокаТаблицаХозрасчетный.СчетДт = СтрокаТаблицаЗапасы.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл;
//				Если СтрокаТаблицаХозрасчетный.СчетДт.Количественный Тогда
//					СтрокаТаблицаХозрасчетный.КоличествоДт = СтрокаТаблицаЗапасы.Количество;
//				Иначе
//					СтрокаТаблицаХозрасчетный.КоличествоДт = 0;
//				КонецЕсли;
//				СтрокаТаблицаХозрасчетный.СубконтоДт1 = СтрокаТаблицаЗапасы.Подразделение;
//				СтрокаТаблицаХозрасчетный.СубконтоДт2 = СтрокаТаблицаЗапасы.Номенклатура;
//				СтрокаТаблицаХозрасчетный.СубконтоДт3 = СтрокаТаблицаЗапасы.Характеристика;
//				СтрокаТаблицаХозрасчетный.ВидСубконтоДт1 = "Подразделения";
//				СтрокаТаблицаХозрасчетный.ВидСубконтоДт2 = "Номенклатура";
//				СтрокаТаблицаХозрасчетный.ВидСубконтоДт3 = "ХарактеристикиНоменклатуры";
//				
//				СтрокаТаблицаХозрасчетный.СчетКт = СтрокаТаблицаЗапасы.Номенклатура.СчетУчетаЗапасовРегл;
//				Если СтрокаТаблицаХозрасчетный.СчетКт.Количественный Тогда
//					СтрокаТаблицаХозрасчетный.КоличествоКт = СтрокаТаблицаЗапасы.Количество;
//				Иначе
//					СтрокаТаблицаХозрасчетный.КоличествоКт = 0;
//				КонецЕсли;
//				
//				СтрокаТаблицаХозрасчетный.СубконтоКт1 = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
//				СтрокаТаблицаХозрасчетный.СубконтоКт2 = СтрокаТаблицаЗапасы.Номенклатура;
//				СтрокаТаблицаХозрасчетный.СубконтоКт3 = СтрокаТаблицаЗапасы.Характеристика;
//				СтрокаТаблицаХозрасчетный.ВидСубконтоКт1 = "Склады";
//				СтрокаТаблицаХозрасчетный.ВидСубконтоКт2 = "Номенклатура";
//				СтрокаТаблицаХозрасчетный.ВидСубконтоКт3 = "ХарактеристикиНоменклатуры";
//				// Щербаков ---
//				
//				СтрокаДоходыИРасходы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
//				
//				ЗаполнитьЗначенияСвойств(СтрокаДоходыИРасходы, СтрокаТаблицаЗапасы);
//				
//				СтрокаДоходыИРасходы.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.Подразделение;
//				СтрокаДоходыИРасходы.СчетУчета = СтрокаТаблицаЗапасы.СчетДт;
//				СтрокаДоходыИРасходы.СчетУчетаРегл = СтрокаТаблицаЗапасы.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл;
//				
//				СтрокаДоходыИРасходы.СуммаДоходов = 0;
//				СтрокаДоходыИРасходы.СуммаРасходов = ?(СуммаКСписанию = 0, СуммаКСписаниюКорр, СуммаКСписанию);;
//				СтрокаДоходыИРасходы.Сумма = ?(СуммаКСписанию = 0, СуммаКСписаниюКорр, СуммаКСписанию);;
//				
//				СтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
//				
//			КонецЕсли;
//			
//			Если (Окр(СуммаКСписанию, 2, 1) <> 0 И НЕ СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости) 
//				ИЛИ (Окр(СуммаКСписаниюКорр, 2, 1) <> 0 И СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости) Тогда
//				
//				// Продажи.
//				СтрокаПродажи = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажи.Добавить();
//				ЗаполнитьЗначенияСвойств(СтрокаПродажи, СтрокаТаблицаЗапасы);
//				СтрокаПродажи.Количество = 0;
//				СтрокаПродажи.Сумма = 0;
//				СтрокаПродажи.СуммаНДС = 0;
//				СтрокаПродажи.Себестоимость = ?(СуммаКСписанию = 0, СуммаКСписаниюКорр, СуммаКСписанию);;
//				
//			КонецЕсли;
//			
//		КонецЕсли;
//		
//		Если КоличествоТребуетсяСвободныйОстаток > 0 Тогда
//			
//			//СтруктураДляПоиска.Вставить("ЗаказПокупателя", Документы.ЗаказПокупателя.ПустаяСсылка());
//			//
//			//МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
//			Если НЕ СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда 
//				
//				СтруктураДляПоиска.Вставить("ЗаказПокупателя", Документы.ЗаказПокупателя.ПустаяСсылка());
//				МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
//				
//			Иначе
//				МассивСтрокОстатков = ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
//			КонецЕсли;
//			
//			КоличествоОстаток = 0;
//			СуммаОстаток = 0;
//			
//			Если МассивСтрокОстатков.Количество() > 0 Тогда
//				КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
//				СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток;
//			КонецЕсли;
//			
//			Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуетсяСвободныйОстаток Тогда
//				
//				СуммаКСписанию = ?(СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости И СебестоимостьЕдиницы <> 0, Окр(СебестоимостьЕдиницы * КоличествоТребуетсяСвободныйОстаток, 2, 1)
//									,Окр(СуммаОстаток * КоличествоТребуетсяСвободныйОстаток / КоличествоОстаток , 2, 1));//Окр(СуммаОстаток * КоличествоТребуетсяСвободныйОстаток / КоличествоОстаток , 2, 1);
//				
//				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуетсяСвободныйОстаток;
//				МассивСтрокОстатков[0].СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток - СуммаКСписанию;
//				
//			ИначеЕсли КоличествоОстаток = КоличествоТребуетсяСвободныйОстаток Тогда
//				
//				СуммаКСписанию = СуммаОстаток;
//				
//				МассивСтрокОстатков[0].КоличествоОстаток = 0;
//				МассивСтрокОстатков[0].СуммаОстаток = 0;
//				
//			Иначе
//				СуммаКСписанию = 0;
//			КонецЕсли;
//			
//			// Расход. Запасы.
//			СтрокаТаблицыРасход = ВременнаяТаблицаЗапасы.Добавить();
//			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
//			
//			СтрокаТаблицыРасход.Сумма = СуммаКСписанию;
//			СтрокаТаблицыРасход.Количество = КоличествоТребуетсяСвободныйОстаток;
//			СтрокаТаблицыРасход.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
//			
//			Если СтрокаТаблицаЗапасы.ТоварыНаКомиссии Тогда
//				
//				СтрокаТаблицыРасход.СодержаниеПроводки = Неопределено;
//				
//			ИначеЕсли Окр(СуммаКСписанию, 2, 1) <> 0 Тогда
//				
//				// Сформируем проводки.
//				СтрокаТаблицаУправленческий = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
//				ЗаполнитьЗначенияСвойств(СтрокаТаблицаУправленческий, СтрокаТаблицаЗапасы);
//				СтрокаТаблицаУправленческий.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
//				СтрокаТаблицаУправленческий.Сумма = СуммаКСписанию;
//				
//				// Щербаков +++
//				СтрокаТаблицаХозрасчетный = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
//				ЗаполнитьЗначенияСвойств(СтрокаТаблицаХозрасчетный, СтрокаТаблицаЗапасы);
//				СтрокаТаблицаХозрасчетный.Сумма = СуммаКСписанию;
//				СтрокаТаблицаХозрасчетный.СчетДт = СтрокаТаблицаЗапасы.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл;
//				Если СтрокаТаблицаХозрасчетный.СчетДт.Количественный Тогда
//					СтрокаТаблицаХозрасчетный.КоличествоДт = СтрокаТаблицаЗапасы.Количество;
//				Иначе
//					СтрокаТаблицаХозрасчетный.КоличествоДт = 0;
//				КонецЕсли;
//				СтрокаТаблицаХозрасчетный.СубконтоДт1 = СтрокаТаблицаЗапасы.Подразделение;
//				СтрокаТаблицаХозрасчетный.СубконтоДт2 = СтрокаТаблицаЗапасы.Номенклатура;
//				СтрокаТаблицаХозрасчетный.СубконтоДт3 = СтрокаТаблицаЗапасы.Характеристика;
//				СтрокаТаблицаХозрасчетный.ВидСубконтоДт1 = "Подразделения";
//				СтрокаТаблицаХозрасчетный.ВидСубконтоДт2 = "Номенклатура";
//				СтрокаТаблицаХозрасчетный.ВидСубконтоДт3 = "ХарактеристикиНоменклатуры";
//				
//				СтрокаТаблицаХозрасчетный.СчетКт = СтрокаТаблицаЗапасы.Номенклатура.СчетУчетаЗапасовРегл;
//				Если СтрокаТаблицаХозрасчетный.СчетКт.Количественный Тогда
//					СтрокаТаблицаХозрасчетный.КоличествоКт = СтрокаТаблицаЗапасы.Количество;
//				Иначе
//					СтрокаТаблицаХозрасчетный.КоличествоКт = 0;
//				КонецЕсли;
//				
//				СтрокаТаблицаХозрасчетный.СубконтоКт1 = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
//				СтрокаТаблицаХозрасчетный.СубконтоКт2 = СтрокаТаблицаЗапасы.Номенклатура;
//				СтрокаТаблицаХозрасчетный.СубконтоКт3 = СтрокаТаблицаЗапасы.Характеристика;
//				СтрокаТаблицаХозрасчетный.ВидСубконтоКт1 = "Склады";
//				СтрокаТаблицаХозрасчетный.ВидСубконтоКт2 = "Номенклатура";
//				СтрокаТаблицаХозрасчетный.ВидСубконтоКт3 = "ХарактеристикиНоменклатуры";
//				// Щербаков ---
//				
//				СтрокаДоходыИРасходы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
//				
//				ЗаполнитьЗначенияСвойств(СтрокаДоходыИРасходы, СтрокаТаблицаЗапасы);
//				
//				СтрокаДоходыИРасходы.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.Подразделение;
//				СтрокаДоходыИРасходы.СчетУчета = СтрокаТаблицаЗапасы.СчетДт;
//				СтрокаДоходыИРасходы.СчетУчетаРегл = СтрокаТаблицаЗапасы.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл;
//				
//				СтрокаДоходыИРасходы.СуммаДоходов = 0;
//				СтрокаДоходыИРасходы.СуммаРасходов = СуммаКСписанию;
//				СтрокаДоходыИРасходы.Сумма = СуммаКСписанию;
//				
//				СтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
//				
//			КонецЕсли;
//			
//			Если Окр(СуммаКСписанию, 2, 1) <> 0 Тогда
//				
//				// Продажи.
//				СтрокаПродажи = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажи.Добавить();
//				ЗаполнитьЗначенияСвойств(СтрокаПродажи, СтрокаТаблицаЗапасы);
//				СтрокаПродажи.Количество = 0;
//				СтрокаПродажи.Сумма = 0;
//				СтрокаПродажи.СуммаНДС = 0;
//				СтрокаПродажи.Себестоимость = СуммаКСписанию;
//				
//			КонецЕсли;
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы = ВременнаяТаблицаЗапасы;
//	
//КонецПроцедуры
