
&Вместо("ЗакрытьОтчетОРозничныхПродажах")
Функция РасшAzRy_ЗакрытьОтчетОРозничныхПродажах(ОтчетОРозничныхПродажахОбъект)
	
	СтруктураВозвращаемоеЗначение = Новый Структура;
	СтруктураВозвращаемоеЗначение.Вставить("ОтчетОРозничныхПродажах");
	СтруктураВозвращаемоеЗначение.Вставить("ОписаниеОшибки");
	
	ВыполняетсяОбработкаЧеков = Истина;
	УдалитьДвиженияПоРегиструЗапасыВПробитыхЧекахККМ(ОтчетОРозничныхПродажахОбъект);
	ВыполняетсяОбработкаЧеков = Ложь;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Подготовка данных.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекККМЗапасы.Номенклатура КАК Номенклатура,
	|	ЧекККМЗапасы.Характеристика КАК Характеристика,
	|	ЧекККМЗапасы.Партия КАК Партия,
	|	СУММА(ЧекККМЗапасы.Количество) КАК Количество,
	|	ЧекККМЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЧекККМЗапасы.Цена КАК Цена,
	|	ЧекККМЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ЧекККМЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ЧекККМЗапасы.Сумма) КАК Сумма,
	|	СУММА(ЧекККМЗапасы.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ЧекККМЗапасы.Всего) КАК Всего,
	|	ЧекККМЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЧекККМЗапасы.ВалютаДокумента КАК ВалютаДокумента,
	|	ЧекККМЗапасы.ВидЦен КАК ВидЦен,
	|	ЧекККМЗапасы.КассаККМ КАК КассаККМ,
	|	ЧекККМЗапасы.Подразделение КАК Подразделение,
	|	ЧекККМЗапасы.Ответственный КАК Ответственный,
	|	ЧекККМЗапасы.Организация КАК Организация,
	|	ЧекККМЗапасы.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	СУММА(ЧекККМЗапасы.СуммаАвтоматическойСкидки) КАК СуммаАвтоматическойСкидки,
	|	ЧекККМЗапасы.Заказ,
	|	СУММА(ЧекККМЗапасы.Резерв) КАК Резерв,
	|	СУММА(ЧекККМЗапасы.Возврат) КАК Возврат
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ЧекККМЗапасы.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	|	ЧекККМЗапасы.AzRyПроект КАК AzRyПроект,
	|	ЧекККМЗапасы.AzRyКонтрагент КАК AzRyКонтрагент,
	|	ЧекККМЗапасы.AzRyФормаОплаты КАК AzRyФормаОплаты
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЧекККМЗапасы.Номенклатура КАК Номенклатура,
	|		ЧекККМЗапасы.Характеристика КАК Характеристика,
	|		ЧекККМЗапасы.Партия КАК Партия,
	|		ЧекККМЗапасы.Количество КАК Количество,
	|		ЧекККМЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ЧекККМЗапасы.Цена КАК Цена,
	|		ЧекККМЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|		ЧекККМЗапасы.СтавкаНДС КАК СтавкаНДС,
	|		ЧекККМЗапасы.Сумма КАК Сумма,
	|		ЧекККМЗапасы.СуммаНДС КАК СуммаНДС,
	|		ЧекККМЗапасы.Всего КАК Всего,
	|		ЧекККМЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЧекККМЗапасы.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|		ЧекККМЗапасы.Ссылка.ВидЦен КАК ВидЦен,
	|		ЧекККМЗапасы.Ссылка.КассаККМ КАК КассаККМ,
	|		ЧекККМЗапасы.Ссылка.Подразделение КАК Подразделение,
	|		ЧекККМЗапасы.Ссылка.Ответственный КАК Ответственный,
	|		ЧекККМЗапасы.Ссылка.Организация КАК Организация,
	|		ЧекККМЗапасы.Ссылка.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|		ЧекККМЗапасы.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|		ЧекККМЗапасы.Заказ КАК Заказ,
	|		ВЫБОР
	|			КОГДА &ЕстьЗаказыИРезерв
	|					И ЧекККМЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				ТОГДА ЧекККМЗапасы.Резерв
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Резерв,
	|		0 КАК Возврат
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|		,ЧекККМЗапасы.Ссылка.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	|		ЧекККМЗапасы.Ссылка.КассаККМ.AzRyПроект КАК AzRyПроект,
	|		ЧекККМЗапасы.Ссылка.Контрагент КАК AzRyКонтрагент,
	|		ЧекККМЗапасы.Ссылка.ФормаОплаты КАК AzRyФормаОплаты
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|	ИЗ
	|		Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
	|	ГДЕ
	|		ЧекККМЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМЗапасы.Ссылка.Проведен
	|		И ЧекККМЗапасы.Ссылка.НомерЧекаККМ > 0
	|		И НЕ ЧекККМЗапасы.Ссылка.Архивный
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЧекККМЗапасы.Номенклатура,
	|		ЧекККМЗапасы.Характеристика,
	|		ЧекККМЗапасы.Партия,
	|		-ЧекККМЗапасы.Количество,
	|		ЧекККМЗапасы.ЕдиницаИзмерения,
	|		ЧекККМЗапасы.Цена,
	|		ЧекККМЗапасы.ПроцентСкидкиНаценки,
	|		ЧекККМЗапасы.СтавкаНДС,
	|		-ЧекККМЗапасы.Сумма,
	|		-ЧекККМЗапасы.СуммаНДС,
	|		-ЧекККМЗапасы.Всего,
	|		ЧекККМЗапасы.Ссылка.СтруктурнаяЕдиница,
	|		ЧекККМЗапасы.Ссылка.ВалютаДокумента,
	|		ЧекККМЗапасы.Ссылка.ВидЦен,
	|		ЧекККМЗапасы.Ссылка.КассаККМ,
	|		ЧекККМЗапасы.Ссылка.Подразделение,
	|		ЧекККМЗапасы.Ссылка.Ответственный,
	|		ЧекККМЗапасы.Ссылка.Организация,
	|		ЧекККМЗапасы.Ссылка.ДисконтнаяКарта,
	|		-ЧекККМЗапасы.СуммаАвтоматическойСкидки,
	|		ЧекККМЗапасы.Заказ,
	|		0,
	|		ЧекККМЗапасы.Количество
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|		,Null,
	|		Null,
	|		Null,
	|		Null
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|	ИЗ
	|		Документ.ЧекККМВозврат.Запасы КАК ЧекККМЗапасы
	|	ГДЕ
	|		ЧекККМЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМЗапасы.Ссылка.Проведен
	|		И ЧекККМЗапасы.Ссылка.НомерЧекаККМ > 0
	|		И НЕ ЧекККМЗапасы.Ссылка.Архивный) КАК ЧекККМЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМЗапасы.Номенклатура,
	|	ЧекККМЗапасы.Характеристика,
	|	ЧекККМЗапасы.Партия,
	|	ЧекККМЗапасы.ЕдиницаИзмерения,
	|	ЧекККМЗапасы.Цена,
	|	ЧекККМЗапасы.ПроцентСкидкиНаценки,
	|	ЧекККМЗапасы.СтруктурнаяЕдиница,
	|	ЧекККМЗапасы.ВалютаДокумента,
	|	ЧекККМЗапасы.ВидЦен,
	|	ЧекККМЗапасы.КассаККМ,
	|	ЧекККМЗапасы.Организация,
	|	ЧекККМЗапасы.Подразделение,
	|	ЧекККМЗапасы.Ответственный,
	|	ЧекККМЗапасы.СтавкаНДС,
	|	ЧекККМЗапасы.ДисконтнаяКарта,
	|	ЧекККМЗапасы.Заказ
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ЧекККМЗапасы.AzRyАналитикаКонтрагент,
	|	ЧекККМЗапасы.AzRyПроект,
	|	ЧекККМЗапасы.AzRyКонтрагент,
	|	ЧекККМЗапасы.AzRyФормаОплаты
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОплатаПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	ОплатаПлатежнымиКартами.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
	|	ОплатаПлатежнымиКартами.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
	|	СУММА(ОплатаПлатежнымиКартами.Сумма) КАК Сумма,
	|	ОплатаПлатежнымиКартами.Дата КАК ДатаПлатежа
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|		ЧекККМОплатаПлатежнымиКартами.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
	|		ЧекККМОплатаПлатежнымиКартами.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
	|		ЧекККМОплатаПлатежнымиКартами.Сумма КАК Сумма,
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.КассаККМ КАК КассаККМ,
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.Организация КАК Организация,
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.СтруктурнаяЕдиница КАК Склад,
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.ВалютаДокумента КАК Валюта,
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.ВидЦен КАК ВидЦен,
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.Дата КАК Дата
	|	ИЗ
	|		Документ.ЧекККМ.ОплатаПлатежнымиКартами КАК ЧекККМОплатаПлатежнымиКартами
	|	ГДЕ
	|		ЧекККМОплатаПлатежнымиКартами.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМОплатаПлатежнымиКартами.Ссылка.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.ЭквайринговыйТерминал,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.ВидПлатежнойКарты,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.НомерПлатежнойКарты,
	|		-ЧекККМВозвратОплатаПлатежнымиКартами.Сумма,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.КассаККМ,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.Организация,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.СтруктурнаяЕдиница,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.ВалютаДокумента,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.ВидЦен,
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.Дата
	|	ИЗ
	|		Документ.ЧекККМВозврат.ОплатаПлатежнымиКартами КАК ЧекККМВозвратОплатаПлатежнымиКартами
	|	ГДЕ
	|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.Проведен) КАК ОплатаПлатежнымиКартами
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатаПлатежнымиКартами.ЭквайринговыйТерминал,
	|	ОплатаПлатежнымиКартами.ВидПлатежнойКарты,
	|	ОплатаПлатежнымиКартами.НомерПлатежнойКарты,
	|	ОплатаПлатежнымиКартами.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧекККМЗапасы.Ответственный) КАК КоличествоОтветственный
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЧекККМЗапасы.Ссылка.Ответственный КАК Ответственный
	|	ИЗ
	|		Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
	|	ГДЕ
	|		ЧекККМЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМЗапасы.Ссылка.Проведен
	|		И ЧекККМЗапасы.Ссылка.НомерЧекаККМ > 0
	|		И НЕ ЧекККМЗапасы.Ссылка.Архивный
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЧекККМЗапасы.Ссылка.Ответственный
	|	ИЗ
	|		Документ.ЧекККМВозврат.Запасы КАК ЧекККМЗапасы
	|	ГДЕ
	|		ЧекККМЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМЗапасы.Ссылка.Проведен
	|		И ЧекККМЗапасы.Ссылка.НомерЧекаККМ > 0
	|		И НЕ ЧекККМЗапасы.Ссылка.Архивный) КАК ЧекККМЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМЗапасы.Номенклатура,
	|	ЧекККМЗапасы.Характеристика,
	|	ЧекККМСкидкиНаценки.СкидкаНаценка,
	|	ЧекККМСкидкиНаценки.Сумма
	|ПОМЕСТИТЬ ВТ_АвтоСкидкиНаценкиОбъединение
	|ИЗ
	|	Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.СкидкиНаценки КАК ЧекККМСкидкиНаценки
	|		ПО ЧекККМЗапасы.КлючСвязи = ЧекККМСкидкиНаценки.КлючСвязи
	|			И (ЧекККМЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена)
	|			И (ЧекККМЗапасы.Ссылка.Проведен)
	|			И (ЧекККМЗапасы.Ссылка.НомерЧекаККМ > 0)
	|			И (НЕ ЧекККМЗапасы.Ссылка.Архивный)
	|			И ЧекККМЗапасы.Ссылка = ЧекККМСкидкиНаценки.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозвратЗапасы.Номенклатура,
	|	ЧекККМВозвратЗапасы.Характеристика,
	|	ЧекККМВозвратСкидкиНаценки.СкидкаНаценка,
	|	-ЧекККМВозвратСкидкиНаценки.Сумма
	|ИЗ
	|	Документ.ЧекККМВозврат.Запасы КАК ЧекККМВозвратЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.СкидкиНаценки КАК ЧекККМВозвратСкидкиНаценки
	|		ПО ЧекККМВозвратЗапасы.КлючСвязи = ЧекККМВозвратСкидкиНаценки.КлючСвязи
	|			И (ЧекККМВозвратЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена)
	|			И (ЧекККМВозвратЗапасы.Ссылка.Проведен)
	|			И (ЧекККМВозвратЗапасы.Ссылка.НомерЧекаККМ > 0)
	|			И (НЕ ЧекККМВозвратЗапасы.Ссылка.Архивный)
	|			И ЧекККМВозвратЗапасы.Ссылка = ЧекККМВозвратСкидкиНаценки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АвтоСкидкиНаценкиОбъединение.Номенклатура,
	|	ВТ_АвтоСкидкиНаценкиОбъединение.Характеристика,
	|	ВТ_АвтоСкидкиНаценкиОбъединение.СкидкаНаценка,
	|	СУММА(ВТ_АвтоСкидкиНаценкиОбъединение.Сумма) КАК Сумма
	|ИЗ
	|	ВТ_АвтоСкидкиНаценкиОбъединение КАК ВТ_АвтоСкидкиНаценкиОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_АвтоСкидкиНаценкиОбъединение.Номенклатура,
	|	ВТ_АвтоСкидкиНаценкиОбъединение.Характеристика,
	|	ВТ_АвтоСкидкиНаценкиОбъединение.СкидкаНаценка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМПродажиВозвраты.Номенклатура КАК Номенклатура,
	|	ЧекККМПродажиВозвраты.Характеристика КАК Характеристика,
	|	ЧекККМПродажиВозвраты.Партия КАК Партия,
	|	ЧекККМПродажиВозвраты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЧекККМПродажиВозвраты.Цена КАК Цена,
	|	ЧекККМПродажиВозвраты.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ЧекККМПродажиВозвраты.СтавкаНДС КАК СтавкаНДС,
	|	ЧекККМПродажиВозвраты.Заказ КАК Заказ,
	|	ЧекККМПродажиВозвраты.СерийныйНомер,
	|	ЧекККМПродажиВозвраты.Ответственный,
	|	ЧекККМПродажиВозвраты.ДисконтнаяКарта,
	|	СУММА(ЧекККМПродажиВозвраты.ПризнакПродаж) КАК ПризнакПродаж
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЧекККМЗапасы.Номенклатура КАК Номенклатура,
	|		ЧекККМЗапасы.Характеристика КАК Характеристика,
	|		ЧекККМЗапасы.Партия КАК Партия,
	|		ЧекККМЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ЧекККМЗапасы.Цена КАК Цена,
	|		ЧекККМЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|		ЧекККМЗапасы.СтавкаНДС КАК СтавкаНДС,
	|		ЧекККМЗапасы.Заказ КАК Заказ,
	|		ЧекККМСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|		ЧекККМЗапасы.Ссылка.Ответственный КАК Ответственный,
	|		ЧекККМЗапасы.Ссылка.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|		1 КАК ПризнакПродаж
	|	ИЗ
	|		Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.СерийныеНомера КАК ЧекККМСерийныеНомера
	|			ПО ЧекККМЗапасы.КлючСвязи = ЧекККМСерийныеНомера.КлючСвязи
	|				И ЧекККМЗапасы.Ссылка = ЧекККМСерийныеНомера.Ссылка
	|	ГДЕ
	|		ЧекККМЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМЗапасы.Ссылка.Проведен
	|		И ЧекККМЗапасы.Ссылка.НомерЧекаККМ > 0
	|		И НЕ ЧекККМЗапасы.Ссылка.Архивный
	|		И ЧекККМСерийныеНомера.Ссылка.КассоваяСмена = &КассоваяСмена
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЧекККМВозвратЗапасы.Номенклатура,
	|		ЧекККМВозвратЗапасы.Характеристика,
	|		ЧекККМВозвратЗапасы.Партия,
	|		ЧекККМВозвратЗапасы.ЕдиницаИзмерения,
	|		ЧекККМВозвратЗапасы.Цена,
	|		ЧекККМВозвратЗапасы.ПроцентСкидкиНаценки,
	|		ЧекККМВозвратЗапасы.СтавкаНДС,
	|		ЧекККМВозвратЗапасы.Заказ,
	|		ЧекККМВозвратСерийныеНомера.СерийныйНомер,
	|		ЧекККМВозвратЗапасы.Ссылка.Ответственный,
	|		ЧекККМВозвратЗапасы.Ссылка.ДисконтнаяКарта,
	|		-1
	|	ИЗ
	|		Документ.ЧекККМВозврат.Запасы КАК ЧекККМВозвратЗапасы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.СерийныеНомера КАК ЧекККМВозвратСерийныеНомера
	|			ПО ЧекККМВозвратЗапасы.КлючСвязи = ЧекККМВозвратСерийныеНомера.КлючСвязи
	|				И ЧекККМВозвратЗапасы.Ссылка = ЧекККМВозвратСерийныеНомера.Ссылка
	|	ГДЕ
	|		ЧекККМВозвратЗапасы.Ссылка.КассоваяСмена = &КассоваяСмена
	|		И ЧекККМВозвратЗапасы.Ссылка.Проведен
	|		И ЧекККМВозвратЗапасы.Ссылка.НомерЧекаККМ > 0
	|		И НЕ ЧекККМВозвратЗапасы.Ссылка.Архивный
	|		И ЧекККМВозвратСерийныеНомера.Ссылка.КассоваяСмена = &КассоваяСмена) КАК ЧекККМПродажиВозвраты
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМПродажиВозвраты.Номенклатура,
	|	ЧекККМПродажиВозвраты.Характеристика,
	|	ЧекККМПродажиВозвраты.Партия,
	|	ЧекККМПродажиВозвраты.ЕдиницаИзмерения,
	|	ЧекККМПродажиВозвраты.СтавкаНДС,
	|	ЧекККМПродажиВозвраты.Заказ,
	|	ЧекККМПродажиВозвраты.СерийныйНомер,
	|	ЧекККМПродажиВозвраты.Цена,
	|	ЧекККМПродажиВозвраты.ПроцентСкидкиНаценки,
	|	ЧекККМПродажиВозвраты.Ответственный,
	|	ЧекККМПродажиВозвраты.ДисконтнаяКарта
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЧекККМПродажиВозвраты.ПризнакПродаж) > 0";
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КассоваяСмена", ОтчетОРозничныхПродажахОбъект.Ссылка);
	// АвтоматическиеСкидки
	Запрос.УстановитьПараметр("ИспользоватьАвтоматическиеСкидки", ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки"));
	// Конец АвтоматическиеСкидки
	// Заказы покупателей в розничной торговле
	Запрос.УстановитьПараметр("ЕстьЗаказыИРезерв", ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыВРозничнойТорговле") И
		ПолучитьФункциональнуюОпцию("РезервированиеЗапасов"));
	// Конец Заказы покупателей в розничной торговле
	
	Результат = Запрос.ВыполнитьПакет();
	
	Запасы = Результат[0].Выгрузить();
	Запасы.Колонки.Добавить("ПроцентАвтоматическойСкидки", Новый ОписаниеТипов("Число"));
	ОплатаПлатежнымиКартами = Результат[1].Выгрузить();
	
	ОтчетОРозничныхПродажахОбъект.Запасы.Очистить();
	ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.Очистить();
	
	Если Запасы.Количество() > 0 Тогда
		ОтчетОРозничныхПродажахОбъект.ПоложениеОтветственный = ?(
			Результат[2].Выгрузить()[0].КоличествоОтветственный > 1,
			Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти,
			Перечисления.ПоложениеРеквизитаНаФорме.ВШапке
		);
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Запасы Цикл
		
		// Заполним процент автоматической скидки
		Если СтрокаТЧ.СуммаАвтоматическойСкидки <> 0 Тогда
			
			// Применение автоматической скидки.
			СуммаБезСкидки = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
			СтрокаТЧ.ПроцентАвтоматическойСкидки = ?(СуммаБезСкидки = 0, 0 , 100 * СтрокаТЧ.СуммаАвтоматическойСкидки / СуммаБезСкидки);
			СтрокаТЧ.ПроцентСкидкиНаценки = СтрокаТЧ.ПроцентСкидкиНаценки + СтрокаТЧ.ПроцентАвтоматическойСкидки;
			
		КонецЕсли;
		
		Если СтрокаТЧ.Всего <> 0 ИЛИ СтрокаТЧ.ПроцентСкидкиНаценки >= 100 
			// Заказы в Рознице.
			ИЛИ СтрокаТЧ.Резерв > 0
			Тогда
			СтрокаТабличнойЧастиЗапасы = ОтчетОРозничныхПродажахОбъект.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧастиЗапасы, СтрокаТЧ);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из ОплатаПлатежнымиКартами Цикл
		
		Если СтрокаТЧ.Сумма <> 0 Тогда
			СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
		КонецЕсли;
		
	КонецЦикла;
	
	// АвтоматическиеСкидки
	ОтчетОРозничныхПродажахОбъект.СкидкиНаценки.Очистить();
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки") Тогда
		
		АвтоматическиеСкидки = Результат[4].Выгрузить();
		Для каждого СтрокаТЧ Из АвтоматическиеСкидки Цикл
			
			Если СтрокаТЧ.Сумма <> 0 Тогда
				СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.СкидкиНаценки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	// Конец АвтоматическиеСкидки
	
	// Серийные номера
	ОтчетОРозничныхПродажахОбъект.СерийныеНомера.Очистить();
	РаботаССерийнымиНомерамиКлиентСервер.ЗаполнитьКлючиСвязиВТабличнойЧастиТовары(ОтчетОРозничныхПродажахОбъект, "Запасы");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСерийныеНомера") Тогда
		
		СерийныеНомера = Результат[5].Выгрузить();
		Для каждого СтрокаТЧ Из ОтчетОРозничныхПродажахОбъект.Запасы Цикл
			
			СтруктураОтбора = Новый Структура("Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, Цена, СтавкаНДС, Заказ
			|, ПроцентСкидкиНаценки,Ответственный,ДисконтнаяКарта");
			
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТЧ);
			
			СерийныеНомераПоОтбору = СерийныеНомера.НайтиСтроки(СтруктураОтбора);
			Если СерийныеНомераПоОтбору.Количество()>0 Тогда
				
				КлючСвязи = СтрокаТЧ.КлючСвязи;
				
				Для каждого стр Из СерийныеНомераПоОтбору Цикл
					НовСтр = ОтчетОРозничныхПродажахОбъект.СерийныеНомера.Добавить();
					НовСтр.КлючСвязи = КлючСвязи;
					НовСтр.СерийныйНомер = стр.СерийныйНомер;
				КонецЦикла;
			КонецЕсли;
			
			РаботаССерийнымиНомерамиКлиентСервер.ОбновитьСтроковоеПредставлениеСерийныхНомеровСтроки(СтрокаТЧ, ОтчетОРозничныхПродажахОбъект, "КлючСвязи");
			
		КонецЦикла;
		
	КонецЕсли;
	// Серийные номера
	
	
	ОтчетОРозничныхПродажахОбъект.СтатусКассовойСмены    = Перечисления.СтатусыОтчетаОРозничныхПродажах.Закрыта;
	Если ОтчетОРозничныхПродажахОбъект.ДополнительныеСвойства.Свойство("ЗагрузкаИзВнешнегоИсточника") <> Истина Тогда
		ДатаЗакрытияКассовойСмены = ТекущаяДатаСеанса();
		ОтчетОРозничныхПродажахОбъект.Дата                   = ДатаЗакрытияКассовойСмены;
		ОтчетОРозничныхПродажахОбъект.ОкончаниеКассовойСмены = ДатаЗакрытияКассовойСмены;
	КонецЕсли;
	ОтчетОРозничныхПродажахОбъект.СуммаДокумента         = ОтчетОРозничныхПродажахОбъект.Запасы.Итог("Всего");
	
	
	Если Запасы.Количество() > 0 Тогда
		ОтчетОРозничныхПродажахОбъект.Ответственный = Запасы[0].Ответственный;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Ответственный) Тогда
		ОтчетОРозничныхПродажахОбъект.Ответственный = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнойОтветственный");
	КонецЕсли;
	
	ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Запись);
	СтруктураВозвращаемоеЗначение.ОписаниеОшибки = "";
	СтруктураВозвращаемоеЗначение.ОтчетОРозничныхПродажах = ОтчетОРозничныхПродажахОбъект.Ссылка;
	
	Попытка
		ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение		
		СтруктураВозвращаемоеЗначение.ОписаниеОшибки = НСтр("ka='При формировании отчета о розничных продажах произошла ошибка.';ru='При формировании отчета о розничных продажах произошла ошибка.'")
			+?(ВыполняетсяОбработкаЧеков, НСтр("ka=' Ошибка произошла при обработке чеков ККМ.';ru=' Ошибка произошла при обработке чеков ККМ.'"), "");			
	КонецПопытки;
		
	Возврат СтруктураВозвращаемоеЗначение;

КонецФункции

&Вместо("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетОРозничныхПродажахЗапасы.НомерСтроки КАК НомерСтроки,
	|	ОтчетОРозничныхПродажахЗапасы.КлючСвязи КАК КлючСвязи,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка КАК Документ,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.ИнвентаризацияЗапасов КАК ДокументОснование,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.Статья КАК Статья,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.Дата КАК Дата,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.Дата КАК Период,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.КассаККМ КАК КассаККМ,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.КассаККМ.Владелец КАК КассаККМВладелец,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.КассаККМ.СчетУчета КАК КассаККМСчетУчета,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.КассаККМ.СчетУчетаРегл КАК КассаККМСчетУчетаРегл,
	|	&Организация КАК Организация,
	|	ОтчетОРозничныхПродажахЗапасы.Заказ КАК ЗаказПокупателя,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.Подразделение КАК Подразделение,
	|	ОтчетОРозничныхПродажахЗапасы.Ответственный КАК Ответственный,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж КАК СчетУчетаВыручкиОтПродаж,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК СчетУчетаСебестоимостиПродаж,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл КАК СчетУчетаВыручкиОтПродажРегл,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК СчетУчетаСебестоимостиПродажРегл,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НЕОПРЕДЕЛЕНО КАК КоррСтруктурнаяЕдиница,
	|	НЕОПРЕДЕЛЕНО КАК Ячейка,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.СчетУчетаЗапасов КАК СчетУчетаЗапасов,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаЗапасовРегл,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	НЕОПРЕДЕЛЕНО КАК КоррСчетУчетаЗапасов,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|				И ОтчетОРозничныхПродажахЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТоварыНаКомиссии,
	|	ОтчетОРозничныхПродажахЗапасы.Номенклатура КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК КоррНоменклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ОтчетОРозничныхПродажахЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ОтчетОРозничныхПродажахЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК КоррХарактеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ОтчетОРозничныхПродажахЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ОтчетОРозничныхПродажахЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК КоррПартия,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОтчетОРозничныхПродажахЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ОтчетОРозничныхПродажахЗапасы.Количество
	|		ИНАЧЕ ОтчетОРозничныхПродажахЗапасы.Количество * ОтчетОРозничныхПродажахЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ОтчетОРозничныхПродажахЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.СуммаНДС * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.СуммаНДС * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДСЗакупкиПродажи,
	|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.Всего * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.СуммаНДС КАК ЧИСЛО(15, 2)) КАК СуммаНДСВал,
	|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.Всего КАК ЧИСЛО(15, 2)) КАК СуммаВал,
	|	ОтчетОРозничныхПродажахЗапасы.Всего КАК СуммаРасчетовПринятыеПереданные,
	|	ОтчетОРозничныхПродажахЗапасы.ДисконтнаяКарта,
	|	ОтчетОРозничныхПродажахЗапасы.ДисконтнаяКарта.ВладелецКарты КАК ВладелецКарты,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОтчетОРозничныхПродажахЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ОтчетОРозничныхПродажахЗапасы.Резерв
	|		ИНАЧЕ ОтчетОРозничныхПродажахЗапасы.Резерв * ОтчетОРозничныхПродажахЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Резерв,
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.Организация.ВидНалогаНДС КАК ВидНалогаНДС,
	|	ВЫБОР
	|		КОГДА ОтчетОРозничныхПродажахЗапасы.Ссылка.СуммаВключаетНДС
	|			ТОГДА ВЫРАЗИТЬ((ОтчетОРозничныхПродажахЗапасы.Всего - ОтчетОРозничныхПродажахЗапасы.СуммаНДС) * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.Сумма * КурсыДокВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыДокВалюты.Кратность) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ОтчетОРозничныхПродажахЗапасы.Ссылка.СуммаВключаетНДС
	|			ТОГДА ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.Всего - ОтчетОРозничныхПродажахЗапасы.СуммаНДС КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(ОтчетОРозничныхПродажахЗапасы.Сумма КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаБезНДСВал,
	|	НЕОПРЕДЕЛЕНО КАК КоррСчетУчетаЗапасовРегл
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ОтчетОРозничныхПродажахЗапасы.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	|	ОтчетОРозничныхПродажахЗапасы.AzRyПроект КАК AzRyПроект,
	|	ОтчетОРозничныхПродажахЗапасы.AzRyКонтрагент КАК AzRyКонтрагент,
	|	ОтчетОРозничныхПродажахЗапасы.AzRyФормаОплаты КАК AzRyФормаОплаты
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Запасы КАК ОтчетОРозничныхПродажахЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыУпрВалюты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыДокВалюты
	|		ПО ОтчетОРозничныхПродажахЗапасы.Ссылка.ВалютаДокумента = КурсыДокВалюты.Валюта
	|ГДЕ
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.НомерСтроки КАК НомерСтроки,
	|	ТабличнаяЧасть.Ссылка.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА &РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям
	|			ТОГДА ВЫБОР
	|					КОГДА ТабличнаяЧасть.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА НАЧАЛОПЕРИОДА(ТабличнаяЧасть.Ссылка.Дата, ДЕНЬ)
	|					ИНАЧЕ НАЧАЛОПЕРИОДА(ТабличнаяЧасть.ДатаПлатежа, ДЕНЬ)
	|				КОНЕЦ
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаПлатежа,
	|	&Ссылка КАК Документ,
	|	&Организация КАК Организация,
	|	ТабличнаяЧасть.Ссылка.КассаККМ КАК КассаККМ,
	|	ТабличнаяЧасть.Ссылка.КассаККМ.СчетУчета КАК КассаККМСчетУчета,
	|	ТабличнаяЧасть.Ссылка.КассаККМ.СчетУчетаРегл КАК КассаККМСчетУчетаРегл,
	|	ТабличнаяЧасть.ЭквайринговыйТерминал.СчетУчетаРегл КАК ЭквайринговыйТерминалСчетУчетаРегл,
	|	ТабличнаяЧасть.ЭквайринговыйТерминал.Эквайрер КАК Контрагент,
	|	ТабличнаяЧасть.ЭквайринговыйТерминал.Договор КАК Договор,
	|	ТабличнаяЧасть.ЭквайринговыйТерминал.СчетУчета КАК ЭквайринговыйТерминалСчетУчета,
	|	ТабличнаяЧасть.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫРАЗИТЬ(ТабличнаяЧасть.Сумма * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ТабличнаяЧасть.Сумма КАК СуммаВал,
	|	ТабличнаяЧасть.Ссылка.СтруктурнаяЕдиница,
	|	ТабличнаяЧасть.ЭквайринговыйТерминал,
	|	ТабличнаяЧасть.ВидПлатежнойКарты,
	|	ТабличнаяЧасть.НомерПлатежнойКарты,
	|	ТабличнаяЧасть.Ссылка.Статья
	|ПОМЕСТИТЬ ВременнаяТаблицаОплатаПлатежнымиКартами
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.ОплатаПлатежнымиКартами КАК ТабличнаяЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТабличнаяЧасть.Ссылка.ВалютаДокумента = КурсыВалютКассы.Валюта
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетОРозничныхПродажахСкидкиНаценки.СкидкаНаценка,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ОтчетОРозничныхПродажахСкидкиНаценки.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА ОтчетОРозничныхПродажахСкидкиНаценки.Сумма * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ОтчетОРозничныхПродажахСкидкиНаценки.Сумма * КурсыУпрВалюты.Кратность / КурсыУпрВалюты.Курс
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ОтчетОРозничныхПродажахСкидкиНаценки.Ссылка.Дата КАК Период,
	|	ОтчетОРозничныхПродажахСкидкиНаценки.Номенклатура,
	|	ОтчетОРозничныхПродажахСкидкиНаценки.Характеристика,
	|	ОтчетОРозничныхПродажахСкидкиНаценки.Ссылка КАК Документ,
	|	ОтчетОРозничныхПродажахСкидкиНаценки.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВременнаяТаблицаАвтоСкидкиНаценки
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.СкидкиНаценки КАК ОтчетОРозничныхПродажахСкидкиНаценки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаВалютаУчета.Значение
	|					ИЗ
	|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаНациональнаяВалюта.Значение
	|					ИЗ
	|						Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты
	|		ПО (ИСТИНА),
	|	Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта
	|ГДЕ
	|	ОтчетОРозничныхПродажахСкидкиНаценки.Ссылка = &Ссылка
	|	И ОтчетОРозничныхПродажахСкидкиНаценки.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.ВидПлатежнойКарты,
	|	МАКСИМУМ(ЭквайринговыеТерминалыВидыПлатежныхКарт.ПроцентКомиссии) КАК ПроцентКомиссии,
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка КАК ЭквайринговыйТерминал
	|ПОМЕСТИТЬ ВременнаяТаблицаПроцентыКомиссии
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы.ВидыПлатежныхКарт КАК ЭквайринговыеТерминалыВидыПлатежныхКарт
	|ГДЕ
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВременнаяТаблицаОплатаПлатежнымиКартами.ЭквайринговыйТерминал
	|			ИЗ
	|				ВременнаяТаблицаОплатаПлатежнымиКартами КАК ВременнаяТаблицаОплатаПлатежнымиКартами)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.ВидПлатежнойКарты,
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(РезервированиеЗапасовЗапасы.НомерСтроки) КАК НомерСтроки,
	|	РезервированиеЗапасовЗапасы.Ссылка КАК Ссылка,
	|	РезервированиеЗапасовЗапасы.Партия КАК Партия,
	|	РезервированиеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	РезервированиеЗапасовЗапасы.Характеристика КАК Характеристика,
	|	РезервированиеЗапасовЗапасы.Заказ КАК Заказ,
	|	РезервированиеЗапасовЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(РезервированиеЗапасовЗапасы.Количество) КАК Количество,
	|	СУММА(РезервированиеЗапасовЗапасы.Резерв) КАК Резерв
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыСгруппированная
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Запасы КАК РезервированиеЗапасовЗапасы
	|ГДЕ
	|	РезервированиеЗапасовЗапасы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РезервированиеЗапасовЗапасы.Ссылка,
	|	РезервированиеЗапасовЗапасы.Партия,
	|	РезервированиеЗапасовЗапасы.Номенклатура,
	|	РезервированиеЗапасовЗапасы.Характеристика,
	|	РезервированиеЗапасовЗапасы.Заказ,
	|	РезервированиеЗапасовЗапасы.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервированиеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	РезервированиеЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	РезервированиеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА РезервированиеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ РезервированиеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ РезервированиеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(РезервированиеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|					ТОГДА ВЫБОР
	|							КОГДА РезервированиеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ТОГДА РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|							ИНАЧЕ РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|						КОНЕЦ
	|				ИНАЧЕ РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетУчета,
	//+++ Дмгг
	|	ВЫБОР
	|		КОГДА РезервированиеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ РезервированиеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ РезервированиеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(РезервированиеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|					ТОГДА ВЫБОР
	|							КОГДА РезервированиеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ТОГДА РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|							ИНАЧЕ РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|						КОНЕЦ
	|				ИНАЧЕ РезервированиеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетУчетаРегл,
	//--- Дмгг
	|	РезервированиеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА РезервированиеЗапасовЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА РезервированиеЗапасовЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	РезервированиеЗапасовЗапасы.Заказ КАК ЗаказПокупателя,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК КоррЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РезервированиеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|				И РезервированиеЗапасовЗапасы.Количество > 0
	|			ТОГДА РезервированиеЗапасовЗапасы.Резерв - РезервированиеЗапасовЗапасы.Количество
	|		КОГДА ТИПЗНАЧЕНИЯ(РезервированиеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|				И РезервированиеЗапасовЗапасы.Количество <= 0
	|			ТОГДА РезервированиеЗапасовЗапасы.Резерв
	|		ИНАЧЕ (РезервированиеЗапасовЗапасы.Резерв - РезервированиеЗапасовЗапасы.Количество) * РезервированиеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	0 КАК Сумма,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит) КАК ВидДвиженияУправленческий,
	|	&РезервированиеЗапасов КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыИсточник
	|ИЗ
	|	ВременнаяТаблицаЗапасыСгруппированная КАК РезервированиеЗапасовЗапасы
	|ГДЕ
	|	РезервированиеЗапасовЗапасы.Резерв > РезервированиеЗапасовЗапасы.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.СчетУчета КАК КоррСчетУчета,
	//+++ Дмгг
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК КоррСчетУчетаРегл,
	//--- Дмгг
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Номенклатура КАК КоррНоменклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Характеристика КАК КоррХарактеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.Партия КАК КоррПартия,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаЗапасы.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	ТаблицаЗапасы.ВидДвиженияУправленческий КАК ВидДвиженияУправленческий,
	|	ТаблицаЗапасы.СодержаниеПроводки КАК СодержаниеПроводки,
	|	СУММА(ТаблицаЗапасы.Количество) КАК Количество,
	|	СУММА(ТаблицаЗапасы.Сумма) КАК Сумма,
	|	ЛОЖЬ КАК ФиксированнаяСтоимость
	|ИЗ
	|	ВременнаяТаблицаЗапасыИсточник КАК ТаблицаЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл, //+++ Дмгг
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.КоррЗаказПокупателя,
	|	ТаблицаЗапасы.СодержаниеПроводки,
	|	ТаблицаЗапасы.ВидДвиженияУправленческий,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетОРозничныхПродажахСерийныеНомера.КлючСвязи,
	|	ОтчетОРозничныхПродажахСерийныеНомера.СерийныйНомер
	|ПОМЕСТИТЬ ВременнаяТаблицаСерийныеНомера
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.СерийныеНомера КАК ОтчетОРозничныхПродажахСерийныеНомера
	|ГДЕ
	|	ОтчетОРозничныхПродажахСерийныеНомера.Ссылка = &Ссылка
	|	И &ИспользоватьСерийныеНомера";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОтчетОРозничныхПродажах);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	Запрос.УстановитьПараметр("РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям", ПолучитьФункциональнуюОпцию("РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям"));
	Запрос.УстановитьПараметр("РезервированиеЗапасов", НСтр("ka='მარაგების რეზერვირება';ru='Резервирование запасов';en='inventory reservations'"));
	
	Запрос.УстановитьПараметр("ИспользоватьСерийныеНомера", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьСерийныеНомера);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// Формирование проводок документа.
	УправлениеНебольшойФирмойСервер.СформироватьТаблицуПроводок(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДенежныеСредстваВКассахККМ(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПродажи(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗапасы(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыПринятые(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗапасыВРазрезеГТД(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаУправленческий(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ОтчетОРозничныхПродажах(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	// Щербакво ---
	
	// ДисконтныеКарты
	СформироватьТаблицаПродажиПоДисконтнойКарте(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	// АвтоматическиеСкидки
	СформироватьТаблицаПродажиПоПредоставленнымАвтоматическимСкидкам(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	// Эквайринг
	СформироватьТаблицаРасчетыПоЭквайрингу(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаПлатежнымиКартами(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	// Конец Эквайринг
	
	// Серийные номера
	СформироватьТаблицаСерийныеНомера(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);	
	
	СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	
	// Заказы покупателя в Рознице
	// Отмена резерва по заказу
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыИсточник", МассивРезультатов[6].Выгрузить());
	СформироватьТаблицаЗапасыИсточник(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗаказыПокупателей(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);

КонецПроцедуры

&Вместо("СформироватьТаблицаДенежныеСредстваВКассахККМ")
Процедура РасшAzRy_СформироватьТаблицаДенежныеСредстваВКассахККМ(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.КассаККМ КАК КассаККМ,
	|	ДанныеДокумента.КассаККМСчетУчета КАК СчетУчета,
	// Щербаков +++ 
	|	ДанныеДокумента.КассаККМСчетУчетаРегл КАК СчетУчетаРегл,
	// Щербаков ---
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	СУММА(ДанныеДокумента.Сумма) КАК Сумма,
	|	СУММА(ДанныеДокумента.СуммаВал) КАК СуммаВал,
	|	СУММА(ДанныеДокумента.Сумма) КАК СуммаДляОстатка,
	|	СУММА(ДанныеДокумента.СуммаВал) КАК СуммаВалДляОстатка,
	|	ВЫРАЗИТЬ(&ПоступлениеДенежныхСредств КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаДенежныеСредстваВКассахККМ
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ДанныеДокумента
	|ГДЕ
	|	&ПолноеПроведение
	|	И ДанныеДокумента.Сумма <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.КассаККМ,
	|	ДанныеДокумента.КассаККМСчетУчета,
	// Щербаков +++ 
	|	ДанныеДокумента.КассаККМСчетУчетаРегл,
	// Щербаков ---
	|	ДанныеДокумента.ВалютаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ДанныеДокумента.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.КассаККМ,
	|	ДанныеДокумента.КассаККМСчетУчета,
	// Щербаков +++
	|	ДанныеДокумента.КассаККМСчетУчетаРегл,
	// Щербаков ---
	|	ДанныеДокумента.ВалютаДокумента,
	|	СУММА(ДанныеДокумента.Сумма),
	|	СУММА(ДанныеДокумента.СуммаВал),
	|	-СУММА(ДанныеДокумента.Сумма),
	|	-СУММА(ДанныеДокумента.СуммаВал),
	|	ВЫРАЗИТЬ(&ОплатаПлатежнымиКартами КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаОплатаПлатежнымиКартами КАК ДанныеДокумента
	|ГДЕ
	|	&ПолноеПроведение
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.КассаККМ,
	|	ДанныеДокумента.КассаККМСчетУчета,
	// Щербаков +++
	|	ДанныеДокумента.КассаККМСчетУчетаРегл,
	// Щербаков ---
	|	ДанныеДокумента.ВалютаДокумента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	КассаККМ,
	|	Валюта,
	|	СчетУчета";
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОтчетОРозничныхПродажах);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("ПолноеПроведение", СтруктураДополнительныеСвойства.ДляПроведения.ПолноеПроведение);
	Запрос.УстановитьПараметр("ПоступлениеДенежныхСредств", НСтр("ka='ფულადი სახსრების შემოსვლა სსა-ის სალაროში';ru='Поступление денежных средств в кассу ККМ';en='Receipt of cash in hand CMC'"));
	Запрос.УстановитьПараметр("ОплатаПлатежнымиКартами", НСтр("ka='გადახდის ბარათებით გადახდა';ru='Оплата платежными картами';en='Payment payment cards'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков денежных средств.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаДенежныеСредстваВКассахККМ.Организация КАК Организация,
	|	ВременнаяТаблицаДенежныеСредстваВКассахККМ.КассаККМ КАК КассаККМ
	|ИЗ
	|	ВременнаяТаблицаДенежныеСредстваВКассахККМ КАК ВременнаяТаблицаДенежныеСредстваВКассахККМ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДенежныеСредстваВКассахККМ");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредстваВКассахККМ(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	// Щербаков +++
	Запрос.Текст = Запрос.Текст + ";" + УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредстваВКассахККМРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	// Щербаков ---
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваВКассахККМ", МассивРезультатов[НомерЗапроса].Выгрузить());

КонецПроцедуры

&Вместо("СформироватьТаблицаДоходыИРасходы")
Процедура РасшAzRy_СформироватьТаблицаДоходыИРасходы(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства)
	
	СтруктураСчетовКурсРазниц = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(СтруктураДополнительныеСвойства.ДляПроведения.Организация, СтруктураДополнительныеСвойства.ДляПроведения.Дата);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаДоходыИРасходы.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДоходыИРасходы.Дата КАК Период,
	|	ТаблицаДоходыИРасходы.Организация КАК Организация,
	|	ТаблицаДоходыИРасходы.Подразделение КАК СтруктурнаяЕдиница,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДоходыИРасходы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаДоходыИРасходы.СчетУчетаВыручкиОтПродаж КАК СчетУчета,
	|	ТаблицаДоходыИРасходы.СчетУчетаВыручкиОтПродажРегл КАК СчетУчетаРегл,
	|	НЕОПРЕДЕЛЕНО КАК Аналитика,
	|	ВЫРАЗИТЬ(&ОтражениеДоходов КАК СТРОКА(100)) КАК СодержаниеПроводки,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаБезНДС) КАК СуммаДоходов,
	|	0 КАК СуммаРасходов,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаБезНДС) КАК Сумма
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаДоходыИРасходы.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	|	ТаблицаДоходыИРасходы.AzRyПроект КАК AzRyПроект
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И &ПолноеПроведение
	|	И ТаблицаДоходыИРасходы.СуммаБезНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Дата,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.Подразделение,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельности,
	|	ТаблицаДоходыИРасходы.ЗаказПокупателя,
	|	ТаблицаДоходыИРасходы.СчетУчетаВыручкиОтПродаж,
	|	ТаблицаДоходыИРасходы.СчетУчетаВыручкиОтПродажРегл
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаДоходыИРасходы.AzRyАналитикаКонтрагент,
	|	ТаблицаДоходыИРасходы.AzRyПроект
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчета
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,NULL,
	|	NULL
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницДенежныеСредстваВКассахККМ КАК ТаблицаДокумента
	|ГДЕ
	|	&ПолноеПроведение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеДоходы);
	Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеРасходы);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ОтражениеДоходов", НСтр("ka='შემოსავლების ასახვა';ru='Отражение доходов';en='income'"));
	Запрос.УстановитьПараметр("ПолноеПроведение", СтруктураДополнительныеСвойства.ДляПроведения.ПолноеПроведение);
	
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность);
		
	Иначе
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);

	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());

КонецПроцедуры

&Вместо("СформироватьТаблицаЗапасы")
Процедура РасшAzRy_СформироватьТаблицаЗапасы(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаЗапасы.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.Документ КАК Документ,
	|	ТаблицаЗапасы.Документ КАК ДокументПродажи,
	|	ТаблицаЗапасы.Подразделение КАК Подразделение,
	|	ТаблицаЗапасы.Ответственный КАК Ответственный,
	|	ТаблицаЗапасы.ТоварыНаКомиссии КАК ТоварыНаКомиссии,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПродажи,
	|	ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК СтруктурнаяЕдиница,
	|	ЕСТЬNULL(ТаблицаЗапасы.КоррСтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчетаЗапасов КАК СчетУчета,
	|	ТаблицаЗапасы.КоррСчетУчетаЗапасов КАК КоррСчетУчета,
	//+++ Дмгг
	|	ТаблицаЗапасы.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.КоррСчетУчетаЗапасовРегл КАК КоррСчетУчетаРегл,
	//--- Дмгг
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТаблицаЗапасы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаЗапасы.КоррНоменклатура КАК КоррНоменклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.КоррХарактеристика КАК КоррХарактеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.КоррПартия КАК КоррПартия,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	НЕОПРЕДЕЛЕНО КАК КоррЗаказПокупателя,
	|	ТаблицаЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ТаблицаЗапасы.Количество) КАК Количество,
	|	СУММА(ТаблицаЗапасы.Резерв) КАК Резерв,
	|	СУММА(ТаблицаЗапасы.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ТаблицаЗапасы.Сумма) КАК Сумма,
	|	0 КАК Себестоимость,
	|	ЛОЖЬ КАК ФиксированнаяСтоимость,
	|	ТаблицаЗапасы.СчетУчетаСебестоимостиПродаж КАК СчетДт,
	|	ТаблицаЗапасы.СчетУчетаЗапасов КАК СчетКт,
	//+++ Дмгг
	|	ТаблицаЗапасы.СчетУчетаСебестоимостиПродажРегл КАК СчетДтРегл,
	|	ТаблицаЗапасы.СчетУчетаЗапасовРегл КАК СчетКтРегл,
	|	ЛОЖЬ КАК Резервирование,//+++ Дмгг
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация, //+++ Дмгг
	//--- Дмгг
	|	ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100)) КАК Содержание,
	|	ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100)) КАК СодержаниеПроводки,
	|	ТаблицаЗапасы.СчетУчетаЗапасовРегл,
	|	ТаблицаЗапасы.КоррСчетУчетаЗапасовРегл
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаЗапасы.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	|	ТаблицаЗапасы.AzRyПроект КАК AzRyПроект,
	|	ТаблицаЗапасы.AzRyКонтрагент КАК Контрагент,
	|	ТаблицаЗапасы.AzRyФормаОплаты КАК AzRyФормаОплаты
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыПодготовленная
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Дата,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Документ,
	|	ТаблицаЗапасы.Подразделение,
	|	ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)),
	|	ЕСТЬNULL(ТаблицаЗапасы.КоррСтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)),
	|	ТаблицаЗапасы.СчетУчетаЗапасов,
	|	ТаблицаЗапасы.КоррСчетУчетаЗапасов,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.ТипНоменклатуры,
	|	ТаблицаЗапасы.НаправлениеДеятельности,
	|	ТаблицаЗапасы.КоррНоменклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.КоррХарактеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.КоррПартия,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.СтавкаНДС,
	|	ТаблицаЗапасы.СчетУчетаСебестоимостиПродаж,
	|	ТаблицаЗапасы.ТоварыНаКомиссии,
	|	ТаблицаЗапасы.Ответственный,
	|	ТаблицаЗапасы.СчетУчетаЗапасовРегл,
	|	ТаблицаЗапасы.КоррСчетУчетаЗапасовРегл,
	|	ТаблицаЗапасы.Документ,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.СчетУчетаЗапасов,
	//+++ Дмгг
	|	ТаблицаЗапасы.СчетУчетаСебестоимостиПродажРегл,
	|	ТаблицаЗапасы.СчетУчетаЗапасовРегл
	//--- Дмгг
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаЗапасы.AzRyАналитикаКонтрагент,
	|	ТаблицаЗапасы.AzRyПроект,
	|	ТаблицаЗапасы.AzRyКонтрагент,
	|	ТаблицаЗапасы.AzRyФормаОплаты
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаЗапасы.НомерСтроки,
	|	ВременнаяТаблицаЗапасы.Период,
	|	ВременнаяТаблицаЗапасы.ВидДвижения,
	|	ВременнаяТаблицаЗапасы.Организация,
	|	ВременнаяТаблицаЗапасы.Документ,
	|	ВременнаяТаблицаЗапасы.ДокументПродажи,
	|	ВременнаяТаблицаЗапасы.Подразделение,
	|	ВременнаяТаблицаЗапасы.Ответственный,
	|	ВременнаяТаблицаЗапасы.ТоварыНаКомиссии,
	|	ВременнаяТаблицаЗапасы.ЗаказПродажи,
	|	ВременнаяТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗапасы.КоррСтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗапасы.СчетУчета,
	|	ВременнаяТаблицаЗапасы.КоррСчетУчета,
	//+++ Дмгг
	|	ВременнаяТаблицаЗапасы.СчетУчетаРегл,
	|	ВременнаяТаблицаЗапасы.КоррСчетУчетаРегл,
	//--- Дмгг
	|	ВременнаяТаблицаЗапасы.Номенклатура,
	|	ВременнаяТаблицаЗапасы.ТипНоменклатуры,
	|	ВременнаяТаблицаЗапасы.НаправлениеДеятельности,
	|	ВременнаяТаблицаЗапасы.КоррНоменклатура,
	|	ВременнаяТаблицаЗапасы.Характеристика,
	|	ВременнаяТаблицаЗапасы.КоррХарактеристика,
	|	ВременнаяТаблицаЗапасы.Партия,
	|	ВременнаяТаблицаЗапасы.КоррПартия,
	|	ВременнаяТаблицаЗапасы.ЗаказПокупателя,
	|	ВременнаяТаблицаЗапасы.КоррЗаказПокупателя,
	|	ВременнаяТаблицаЗапасы.СтавкаНДС,
	|	ВременнаяТаблицаЗапасы.Количество,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаЗапасы.Резерв > ВременнаяТаблицаЗапасы.Количество
	|				И ВременнаяТаблицаЗапасы.Количество > 0
	|			ТОГДА ВременнаяТаблицаЗапасы.Количество
	|		КОГДА ВременнаяТаблицаЗапасы.Количество <= 0
	|			ТОГДА 0
	|		ИНАЧЕ ВременнаяТаблицаЗапасы.Резерв
	|	КОНЕЦ КАК Резерв,
	|	ВременнаяТаблицаЗапасы.СуммаНДС,
	|	ВременнаяТаблицаЗапасы.Сумма,
	|	ВременнаяТаблицаЗапасы.Себестоимость,
	|	ВременнаяТаблицаЗапасы.ФиксированнаяСтоимость,
	|	ВременнаяТаблицаЗапасы.СчетДт,
	|	ВременнаяТаблицаЗапасы.СчетКт,
	//+++ Дмгг
	|	ВременнаяТаблицаЗапасы.СчетДтРегл,
	|	ВременнаяТаблицаЗапасы.СчетКтРегл,
	|	ВременнаяТаблицаЗапасы.Резервирование КАК Резервирование,//+++ Дмгг
	|	ВременнаяТаблицаЗапасы.ХозяйственнаяОперация КАК ХозяйственнаяОперация, //+++ Дмгг
	//--- Дмгг
	|	ВременнаяТаблицаЗапасы.Содержание,
	|	ВременнаяТаблицаЗапасы.СодержаниеПроводки,
	|	ВременнаяТаблицаЗапасы.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|	ВременнаяТаблицаЗапасы.КоррСчетУчетаЗапасовРегл КАК КоррСчетУчетаРегл
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ВременнаяТаблицаЗапасы.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	|	ВременнаяТаблицаЗапасы.AzRyПроект КАК AzRyПроект,
	|	ВременнаяТаблицаЗапасы.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаЗапасы.AzRyФормаОплаты КАК AzRyФормаОплаты
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|ИЗ
	|	ВременнаяТаблицаЗапасыПодготовленная КАК ВременнаяТаблицаЗапасы";
	
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='მარაგების შემოსავალში აყვანა';ru='Оприходование запасов';en='Posting of Goods'"));
	Запрос.УстановитьПараметр("СписаниеЗапасов", НСтр("ka='მარაგების ჩამოწერა';ru='Списание запасов';en='Write-off stocks'"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());
	
	СформироватьТаблицаЗапасыПродажа(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства);

КонецПроцедуры

&Вместо("СформироватьТаблицаЗапасыНаСкладах")
Процедура РасшAzRy_СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Дата КАК Период,
	|	ТаблицаЗапасыНаСкладах.Организация КАК Организация,
	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Характеристика КАК Характеристика,
	|	ТаблицаЗапасыНаСкладах.Партия КАК Партия,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Ячейка КАК Ячейка,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаЗапасыНаСкладах.AzRyПроект КАК AzRyПроект 
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|ГДЕ
	|	ТаблицаЗапасыНаСкладах.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	И &ПолноеПроведение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Дата,
	|	ТаблицаЗапасыНаСкладах.Организация,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Характеристика,
	|	ТаблицаЗапасыНаСкладах.Партия,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Ячейка
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаЗапасыНаСкладах.AzRyПроект
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) <> 0";
	
	Запрос.УстановитьПараметр("ПолноеПроведение", СтруктураДополнительныеСвойства.ДляПроведения.ПолноеПроведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());

КонецПроцедуры

&Вместо("СформироватьТаблицаПродажи")
Процедура РасшAzRy_СформироватьТаблицаПродажи(ДокументСсылкаОтчетОРозничныхПродажах, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПродажи.Дата КАК Период,
	|	ТаблицаПродажи.Организация КАК Организация,
	|	ТаблицаПродажи.Номенклатура КАК Номенклатура,
	|	ТаблицаПродажи.Характеристика КАК Характеристика,
	|	ТаблицаПродажи.Партия КАК Партия,
	|	ТаблицаПродажи.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаПродажи.Документ КАК Документ,
	|	ТаблицаПродажи.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаПродажи.Подразделение КАК Подразделение,
	|	ТаблицаПродажи.Ответственный КАК Ответственный,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	|	СУММА(ТаблицаПродажи.СуммаНДСЗакупкиПродажи) КАК СуммаНДС,
	|	СУММА(ТаблицаПродажи.Сумма) КАК Сумма,
	|	0 КАК Себестоимость
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаПродажи.AzRyАналитикаКонтрагент КАК AzRyАналитикаКонтрагент,
	|	ТаблицаПродажи.AzRyПроект КАК AzRyПроект,
	|	ТаблицаПродажи.AzRyКонтрагент КАК Контрагент 
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаПродажи
	|ГДЕ
	|	&ПолноеПроведение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Дата,
	|	ТаблицаПродажи.Организация,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Характеристика,
	|	ТаблицаПродажи.Партия,
	|	ТаблицаПродажи.ЗаказПокупателя,
	|	ТаблицаПродажи.Документ,
	|	ТаблицаПродажи.СтавкаНДС,
	|	ТаблицаПродажи.Подразделение,
	|	ТаблицаПродажи.Ответственный
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	|	,ТаблицаПродажи.AzRyАналитикаКонтрагент,
	|	ТаблицаПродажи.AzRyПроект,
	|	ТаблицаПродажи.AzRyКонтрагент
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ТаблицаПродажи.Количество) <> 0
	|		ИЛИ СУММА(ТаблицаПродажи.СуммаНДСЗакупкиПродажи) <> 0
	|		ИЛИ СУММА(ТаблицаПродажи.Сумма) <> 0)";
	
	Запрос.УстановитьПараметр("ПолноеПроведение", СтруктураДополнительныеСвойства.ДляПроведения.ПолноеПроведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажи", РезультатЗапроса.Выгрузить());

КонецПроцедуры
