Процедура ПриНачалеРаботыСистемы() Экспорт
	
	Если НЕ РаботаВМоделиСервиса.ИспользованиеРазделителяСеанса() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурналаРегистрации(), 
		УровеньЖурналаРегистрации.Информация, , 
		ПолучитьНавигационнуюСсылкуИнформационнойБазы());
	
КонецПроцедуры

Функция ИмяСобытияЖурналаРегистрации()
	
	Возврат НСтр("ka='Технология 1cFresh.Начало сеанса области данных';ru='Технология 1cFresh.Начало сеанса области данных';en='Technology 1cFresh.Nachalo session data field'", 
		ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());	
	
КонецФункции
