
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выборка";
	Проводник.Фильтр = "Текстовый документ (*.xlsx)|*.xlsx";
	
	Оповишение = Новый ОписаниеОповещения("ПослеВыбораФайла",ЭтотОбъект);
	Проводник.Показать(Оповишение);
	
КонецПроцедуры


Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительниеПараметры)Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Объект.ПутьКФайлу = ВыбранныеФайлы[0];
	
КонецПроцедуры

&НаКлиенте
Процедура Прочитать(Команда)
	ПрочитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	
	Попытка	
		ТабДок.Прочитать(Объект.ПутьКФайлу, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст("ვერ მოხერხდა ფაილის გახსნა" + ОписаниеОшибки());
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	
	Для НомерСтроки = 2 По КоличествоСтрок Цикл 
		
		СтрокаДанных = Объект.Список.Добавить();
		СтрокаДанных.Номенклатура = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки,"ЧГ=0") + "C" + 1).ТекущаяОбласть.Текст;
		СтрокаДанных.ЕдиницаИзмерения = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки,"ЧГ=0") + "C" + 2).ТекущаяОбласть.Текст;
		СтрокаДанных.Количество = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки,"ЧГ=0") + "C" + 3).ТекущаяОбласть.Текст;
		
	КонецЦикла;
	
КонецПроцедуры
