Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Узел = ОбменСКассовымСерверомШтрихМПовтИсп.УзелОбменаШтрих();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если НЕ ЗначениеЗаполнено(Запись.ИдентификаторОбластиНаСервереШтрихМ) Тогда
			Запись.ИдентификаторОбластиНаСервереШтрихМ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Узел, "ИдентификаторОбластиНаСервереШтрихМ");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.РегистрационныйНомер) Тогда
			Сообщение = НСтр("ka='Введите регистрационный номер.';ru='Введите регистрационный номер.';en='Enter the registration number.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение, ЭтотОбъект, "РегистрационныйНомер",, Отказ);
			Возврат;
		КонецЕсли;
		
		
		ПроверитьРегистрационныйНомер(Запись.РегистрационныйНомер, Запись.КассаККМ, Отказ);
		
		Если Отказ Тогда
			КлючДанных = РегистрыСведений.НастройкиКассыШтрихМ.СоздатьКлючЗаписи(Новый Структура("КассаККМ", Запись.КассаККМ));
			Сообщение = СтрШаблон(НСтр("ka='Регистрационный номер: %1 уже используется.';ru='Регистрационный номер: %1 уже используется.';en='Registration number:% 1 is already in use.'"), Запись.РегистрационныйНомер);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение, КлючДанных, "РегистрационныйНомер",, Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьРегистрационныйНомер(НовыйРегистрационныйНомер, СсылкаНаОбъект, Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КассовыеАппараты.КассаККМ
	|ИЗ
	|	РегистрСведений.НастройкиКассыШтрихМ КАК КассовыеАппараты
	|ГДЕ
	|	НЕ КассовыеАппараты.КассаККМ = &СсылкаНаОбъект
	|	И КассовыеАппараты.РегистрационныйНомер = &РегистрационныйНомер");
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("РегистрационныйНомер", НовыйРегистрационныйНомер);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
