
&Вместо("ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц")
Процедура РасшAzRy_ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(Знач Заказы, МенеджерВременныхТаблиц, ВключитьНоменклатуруДоставки)
	
	Если ТипЗнч(Заказы) <> Тип("Массив") Тогда
		Заказы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Заказы);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.ОсновнойВариантКП КАК ОсновнойВариантКП
	|ПОМЕСТИТЬ ВТЗаказы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&Ссылки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ЗаказПокупателяЗапасы.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТМаксНомерСтрокиЗапасы
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Ссылка В(&Ссылки)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяЗапасы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Ссылка,
	|	ЗаказПокупателяЗапасы.НомерСтроки,
	|	ЗаказПокупателяЗапасы.НомерВариантаКП,
	|	ЗаказПокупателяЗапасы.Номенклатура,
	|	ЗаказПокупателяЗапасы.ТипНоменклатурыЗапас,
	|	ЗаказПокупателяЗапасы.Характеристика,
	|	ЗаказПокупателяЗапасы.Партия,
	|	ЗаказПокупателяЗапасы.СерийныеНомера,
	|	ЗаказПокупателяЗапасы.Резерв,
	|	ЗаказПокупателяЗапасы.РезервОтгрузка,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	|	ЗаказПокупателяЗапасы.Цена,
	|	ЗаказПокупателяЗапасы.ПроцентСкидкиНаценки,
	|	ЗаказПокупателяЗапасы.Сумма,
	|	ЗаказПокупателяЗапасы.СтавкаНДС,
	|	ЗаказПокупателяЗапасы.СуммаНДС,
	|	ЗаказПокупателяЗапасы.Всего,
	|	ЗаказПокупателяЗапасы.ДатаОтгрузки,
	|	ЗаказПокупателяЗапасы.Спецификация,
	|	ЗаказПокупателяЗапасы.Содержание,
	|	ЗаказПокупателяЗапасы.ПроцентАвтоматическойСкидки,
	|	ЗаказПокупателяЗапасы.СуммаАвтоматическойСкидки,
	|	ЗаказПокупателяЗапасы.Количество,
	|	ЗаказПокупателяЗапасы.КлючСвязи,
	|	ЗаказПокупателяЗапасы.СтранаПроисхождения,
	|	ЗаказПокупателяЗапасы.НомерГТД,
	|	ЗаказПокупателяЗапасы.Вес,
	|	ЗаказПокупателяЗапасы.Объем,
	|	ЗаказПокупателяЗапасы.ЭтоПодарок,
	//_Lazare
	|   ЗаказПокупателяЗапасы.СтруктурнаяЕдиницаЗапасы КАК СтруктурнаяЕдиницаЗапасы,
	|	ЕСТЬNULL(ЗаказПокупателяЗапасы.КоличествоСобр, 0) КАК КоличествоСобр,
	//Lazare_
	|	ЗаказПокупателяЗапасы.НаименованиеДляРС
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,ЗаказПокупателяЗапасы.Усушка_Потери
	|	,ЗаказПокупателяЗапасы.Усушка_СписаниеНаПотери
	|	,ЕСТЬNULL(ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET, 0) КАК Усушка_КоличествоСобрNET
	|	,ЗаказПокупателяЗапасы.Усушка_КоличествоСобрПотери
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	// +++ { AzRy - [19.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:
	|	,ЗаказПокупателяЗапасы.Ссылка.Проект КАК Проект
	// +++ } AzRy - [19.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:	
	|ПОМЕСТИТЬ ВТЗаказПокупателяЗапасы
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказы КАК Заказы
	|		ПО (Заказы.Ссылка = ЗаказПокупателяЗапасы.Ссылка)
	|			И (Заказы.ОсновнойВариантКП = ЗаказПокупателяЗапасы.НомерВариантаКП)
	|ГДЕ
	|	НЕ ЗаказПокупателяЗапасы.ЭтоРазделитель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ЕСТЬNULL(ВТМаксНомерСтрокиЗапасы.НомерСтроки, 0) + 1,
	|	Заказы.ОсновнойВариантКП,
	|	ЗаказПокупателя.НоменклатураДоставки,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка),
	|	"""",
	|	0,
	|	0,
	|	ЗаказПокупателя.НоменклатураДоставки.ЕдиницаИзмерения,
	|	ЗаказПокупателя.СтоимостьДоставки,
	|	0,
	|	ЗаказПокупателя.СтоимостьДоставки,
	|	ЗаказПокупателя.СтавкаНДСДоставки,
	|	ЗаказПокупателя.СуммаНДСДоставки,
	|	ЗаказПокупателя.СтоимостьДоставки,
	|	ЗаказПокупателя.ДатаОтгрузки,
	|	ЗНАЧЕНИЕ(Справочник.Спецификации.ПустаяСсылка),
	|	"""",
	|	0,
	|	0,
	|	1,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка),
	|	0,
	|	0,
	|	ЛОЖЬ,
	//_Lazare
	|   ЗаказПокупателя.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
	|   0,
	//Lazare_
	|	""""
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,NULL
	|	,NULL
	|	,0
	|	,NULL
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	// +++ { AzRy - [19.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:
	|	,NULL
	// +++ } AzRy - [19.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:	
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказы КАК Заказы
	|		ПО (Заказы.Ссылка = ЗаказПокупателя.Ссылка)
	|			И (ЗаказПокупателя.НоменклатураДоставки <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|			И (&ВключитьНоменклатуруДоставки)
	|			И (ЗаказПокупателя.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПустаяСсылка))
	|			И (ЗаказПокупателя.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМаксНомерСтрокиЗапасы КАК ВТМаксНомерСтрокиЗапасы
	|		ПО (ВТМаксНомерСтрокиЗапасы.Ссылка = ЗаказПокупателя.Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылки", Заказы);
	Запрос.УстановитьПараметр("ВключитьНоменклатуруДоставки", ВключитьНоменклатуруДоставки);
	РезультатЗапроса = Запрос.Выполнить();
			
КонецПроцедуры
