
&Вместо("ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц")
Процедура РасшAzRy_ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(Знач Заказы, МенеджерВременныхТаблиц, ВключитьНоменклатуруДоставки)
	
	Если ТипЗнч(Заказы) <> Тип("Массив") Тогда
		Заказы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Заказы);
	КонецЕсли;
	
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	УстановитьПривилегированныйРежим(Истина);
	УчетПоПроектам = ПолучитьФункциональнуюОпцию("УчетПоПроектам");
	УстановитьПривилегированныйРежим(Ложь);
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	
	Запрос = Новый Запрос;
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.ОсновнойВариантКП КАК ОсновнойВариантКП
	|ПОМЕСТИТЬ ВТЗаказы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&Ссылки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ЗаказПокупателяЗапасы.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТМаксНомерСтрокиЗапасы
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Ссылка В(&Ссылки)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяЗапасы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Ссылка,
	|	ЗаказПокупателяЗапасы.НомерСтроки,
	|	ЗаказПокупателяЗапасы.НомерВариантаКП,
	|	ЗаказПокупателяЗапасы.Номенклатура,
	|	ЗаказПокупателяЗапасы.ТипНоменклатурыЗапас,
	|	ЗаказПокупателяЗапасы.Характеристика,
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	|	Выбор
	|		Когда Не &УчетПоПроектам
	|			Тогда Значение(Справочник.Проекты.ПустаяСсылка)
	|		Когда ЗаказПокупателяЗапасы.Ссылка.Проект = Значение(Справочник.Проекты.ПустаяСсылка)
	|			Тогда Значение(Справочник.Проекты.БезПроекта)
	|		Иначе ЗаказПокупателяЗапасы.Ссылка.Проект
	|	Конец КАК Проект,
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	|	ЗаказПокупателяЗапасы.Партия,
	|	ЗаказПокупателяЗапасы.СерийныеНомера,
	|	ЗаказПокупателяЗапасы.Резерв,
	|	ЗаказПокупателяЗапасы.РезервОтгрузка,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	|	ЗаказПокупателяЗапасы.Цена,
	|	ЗаказПокупателяЗапасы.ПроцентСкидкиНаценки,
	|	ЗаказПокупателяЗапасы.Сумма,
	|	ЗаказПокупателяЗапасы.СтавкаНДС,
	|	ЗаказПокупателяЗапасы.СуммаНДС,
	|	ЗаказПокупателяЗапасы.Всего,
	|	ЗаказПокупателяЗапасы.ДатаОтгрузки,
	|	ЗаказПокупателяЗапасы.Спецификация,
	|	ЗаказПокупателяЗапасы.Содержание,
	|	ЗаказПокупателяЗапасы.ПроцентАвтоматическойСкидки,
	|	ЗаказПокупателяЗапасы.СуммаАвтоматическойСкидки,
	|	ЗаказПокупателяЗапасы.Количество,
	|	ЗаказПокупателяЗапасы.КлючСвязи,
	|	ЗаказПокупателяЗапасы.СтранаПроисхождения,
	|	ЗаказПокупателяЗапасы.НомерГТД,
	|	ЗаказПокупателяЗапасы.Вес,
	|	ЗаказПокупателяЗапасы.Объем,
	|	ЗаказПокупателяЗапасы.ЭтоПодарок,
	//_Lazare
	|   ЗаказПокупателяЗапасы.СтруктурнаяЕдиницаЗапасы КАК СтруктурнаяЕдиницаЗапасы,
	|	ЕСТЬNULL(ЗаказПокупателяЗапасы.КоличествоСобр, 0) КАК КоличествоСобр,
	//Lazare_
	|	ЗаказПокупателяЗапасы.НаименованиеДляРС
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,ЗаказПокупателяЗапасы.Усушка_Потери
	|	,ЗаказПокупателяЗапасы.Усушка_СписаниеНаПотери
	|	,ЕСТЬNULL(ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET, 0) КАК Усушка_КоличествоСобрNET
	|	,ЗаказПокупателяЗапасы.Усушка_КоличествоСобрПотери
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,ЗаказПокупателяЗапасы.Исполнитель КАК Исполнитель //++Lazare 27.10.2021
	// +++ { AzRy - [19.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:
	//|	,ЗаказПокупателяЗапасы.Ссылка.Проект КАК Проект
	// +++ } AzRy - [19.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:	
	|ПОМЕСТИТЬ ВТЗаказПокупателяЗапасы
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказы КАК Заказы
	|		ПО (Заказы.Ссылка = ЗаказПокупателяЗапасы.Ссылка)
	|			И (Заказы.ОсновнойВариантКП = ЗаказПокупателяЗапасы.НомерВариантаКП)
	|ГДЕ
	|	НЕ ЗаказПокупателяЗапасы.ЭтоРазделитель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ЕСТЬNULL(ВТМаксНомерСтрокиЗапасы.НомерСтроки, 0) + 1,
	|	Заказы.ОсновнойВариантКП,
	|	ЗаказПокупателя.НоменклатураДоставки,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	|	Выбор
	|		Когда &УчетПоПроектам
	|			Тогда Значение(Справочник.Проекты.БезПроекта)
	|		Иначе Значение(Справочник.Проекты.ПустаяСсылка)
	|	Конец,
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка),
	|	"""",
	|	0,
	|	0,
	|	ЗаказПокупателя.НоменклатураДоставки.ЕдиницаИзмерения,
	|	ЗаказПокупателя.СтоимостьДоставки,
	|	0,
	|	ЗаказПокупателя.СтоимостьДоставки,
	|	ЗаказПокупателя.СтавкаНДСДоставки,
	|	ЗаказПокупателя.СуммаНДСДоставки,
	|	ЗаказПокупателя.СтоимостьДоставки,
	|	ЗаказПокупателя.ДатаОтгрузки,
	|	ЗНАЧЕНИЕ(Справочник.Спецификации.ПустаяСсылка),
	|	"""",
	|	0,
	|	0,
	|	1,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка),
	|	0,
	|	0,
	|	ЛОЖЬ,
	//_Lazare
	|   ЗаказПокупателя.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
	|   0,
	//Lazare_
	|	""""
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,NULL
	|	,NULL
	|	,0
	|	,NULL
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,NULL //++Lazare	
	// +++ { AzRy - [19.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:
	//|	,NULL
	// +++ } AzRy - [19.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:	
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказы КАК Заказы
	|		ПО (Заказы.Ссылка = ЗаказПокупателя.Ссылка)
	|			И (ЗаказПокупателя.НоменклатураДоставки <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|			И (&ВключитьНоменклатуруДоставки)
	|			И (ЗаказПокупателя.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПустаяСсылка))
	|			И (ЗаказПокупателя.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМаксНомерСтрокиЗапасы КАК ВТМаксНомерСтрокиЗапасы
	|		ПО (ВТМаксНомерСтрокиЗапасы.Ссылка = ЗаказПокупателя.Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылки", Заказы);
	Запрос.УстановитьПараметр("ВключитьНоменклатуруДоставки", ВключитьНоменклатуруДоставки);
	
	//ПодольскийАИ #УчетПроектов 30.09.2021 {
	Запрос.УстановитьПараметр("УчетПоПроектам", УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 30.09.2021 }
	
	РезультатЗапроса = Запрос.Выполнить();
 
КонецПроцедуры

&Вместо("ИнициализироватьДанныеДокументаЗаказНаряд")
Процедура РасшAzRy_ИнициализироватьДанныеДокументаЗаказНаряд(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаряд.Договор.ЭтоДоговорОбслуживания КАК ЭтоДоговорОбслуживания,
		|	ВЫБОР
		|		КОГДА ЗаказНаряд.Договор.ЭтоДоговорОбслуживания
		|				И ЗаказНаряд.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВестиУчетРасходовПоДоговорамОбслуживания,
		|	ЗаказНаряд.Договор.ДоговорОбслуживанияНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ВидыЗаказНарядовПорядокСостояний.НомерСтроки >= ВЫРАЗИТЬ(ЗаказНаряд.ВидЗаказа КАК Справочник.ВидыЗаказНарядов).НомерСостоянияВыполнения КАК ЭтоСостояниеВыполненияЗаказНаряда,
		|	ЗаказНаряд.ВариантЗавершения КАК ВариантЗавершения
		//+++ Дмгг
		|,	ЗаказНаряд.Пробег КАК Пробег,
		|	ЗаказНаряд.ТранпсортноеСедство КАК ТранспортноеСредство,
		|	ЗаказНаряд.Дата КАК Период
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказНаряд
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗаказНарядов.ПорядокСостояний КАК ВидыЗаказНарядовПорядокСостояний
		|		ПО ЗаказНаряд.ВидЗаказа = ВидыЗаказНарядовПорядокСостояний.Ссылка
		|			И ЗаказНаряд.СостояниеЗаказа = ВидыЗаказНарядовПорядокСостояний.Состояние
		|ГДЕ
		|	ЗаказНаряд.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаНациональная)) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//+++ Дмгг, Переписан алгоритм получения среднего курса документа
		|ВЫБРАТЬ
		|	ЗаказПокупателяПредоплата.Ссылка,
		|	СУММА(ЗаказПокупателяПредоплата.СуммаРасчетов) КАК СуммаРасчетов,
		|	СУММА(ЗаказПокупателяПредоплата.СуммаРасчетов * ЗаказПокупателяПредоплата.Курс / ЗаказПокупателяПредоплата.Кратность) КАК СуммаРасчетовРеглПоКурсуПредоплаты
		|ПОМЕСТИТЬ ВременнаяТаблицаСуммаПредоплатыГрупп
		|ИЗ
		|	Документ.ЗаказПокупателя.Предоплата КАК ЗаказПокупателяПредоплата
		|ГДЕ
		|	ЗаказПокупателяПредоплата.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяПредоплата.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка,
		|	ЗаказПокупателя.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) КАК СуммаНеОплаченаВал,
		|	(ЗаказПокупателя.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * ЗаказПокупателя.Курс / ЗаказПокупателя.Кратность КАК СуммаНеОплаченаРегл,
		|	ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) КАК СуммаРасчетовВал,
		|	ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты КАК СуммаРасчетовРегл,
		|	(ЗаказПокупателя.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * ЗаказПокупателя.Курс / ЗаказПокупателя.Кратность + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты, 0) КАК СуммаДокументаРеглПоВсемКурсам,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателя.СуммаДокумента = 0
		|			ТОГДА 1
		|		ИНАЧЕ ((ЗаказПокупателя.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * ЗаказПокупателя.Курс / ЗаказПокупателя.Кратность + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты, 0)) / ЗаказПокупателя.СуммаДокумента
		|	КОНЕЦ КАК СреднийКурсДокумента,
		|	1 КАК Кратность
		|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПредоплаты
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСуммаПредоплатыГрупп КАК ВременнаяТаблицаСуммаПредоплатыГрупп
		|		ПО ЗаказПокупателя.Ссылка = ВременнаяТаблицаСуммаПредоплатыГрупп.Ссылка
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка,
		|	ВременнаяТаблицаСреднегоКурсаПредоплаты.СреднийКурсДокумента КАК Курс,
		|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность
		|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПоДокументу
		|ИЗ
		|	ВременнаяТаблицаСреднегоКурсаПредоплаты КАК ВременнаяТаблицаСреднегоКурсаПредоплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//--- Дмгг
		|ВЫБРАТЬ
		|	ЗаказНарядРаботы.НомерСтроки КАК НомерСтроки,
		|	ЗаказНарядРаботы.Ссылка.Дата КАК Период,
		|	ЗаказНарядРаботы.Ссылка.Финиш,
		|	&Организация КАК Организация,
		|	ЗаказНарядРаботы.Ссылка.СтруктурнаяЕдиницаПродажи КАК СтруктурнаяЕдиница,
		|	ЗаказНарядРаботы.Ссылка.Ответственный КАК Ответственный,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
		|	ЗаказНарядРаботы.Номенклатура.СчетУчетаЗатрат КАК СчетУчета,
		|	ЗаказНарядРаботы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаРегл, //+++
		|	ЗаказНарядРаботы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл, //+++
		|	ЗаказНарядРаботы.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА &ИспользоватьХарактеристики
		|			ТОГДА ЗаказНарядРаботы.Характеристика
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ КАК Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
		////ПодольскийАИ #УчетПроектов 10.10.2020 {
		//|	ВЫБОР 
		//|		КОГДА &УчетПоПроектам 
		//|			ТОГДА ЗаказНарядРаботы.Проект
		//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		//|	КОНЕЦ КАК Проект,
		////ПодольскийАИ #УчетПроектов 10.10.2020 }
		//_Lazare
		|ВЫБОР
		|КОГДА &УчетПоПроектам
		|	ТОГДА ВЫБОР
		|			КОГДА ЗаказНарядРаботы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|			ИНАЧЕ ЗаказНарядРаботы.Проект
		|		КОНЕЦ
		|ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ КАК Проект,
		//Lazare_
		|	ЗаказНарядРаботы.Ссылка КАК ЗаказПокупателя,
		|	ЗаказНарядРаботы.Ссылка КАК Документ,
		|	ЗаказНарядРаботы.Ссылка.Контрагент КАК Контрагент,
		|	ЗаказНарядРаботы.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
		|	ЗаказНарядРаботы.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ЗаказНарядРаботы.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
		|	ЗаказНарядРаботы.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
		|	ЗаказНарядРаботы.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
		|	ЗаказНарядРаботы.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл, //+++
		|	ЗаказНарядРаботы.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	ЗаказНарядРаботы.Ссылка.Договор КАК Договор,
		|	ЗаказНарядРаботы.Ссылка.СтруктурнаяЕдиницаПродажи КАК ПодразделениеПродажи,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
		|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности
		|		ИНАЧЕ ЗаказНарядРаботы.Номенклатура.НаправлениеДеятельности
		|	КОНЕЦ КАК НаправлениеДеятельностиПродажи,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
		|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
		|		ИНАЧЕ ЗаказНарядРаботы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
		|	КОНЕЦ КАК СчетУчетаПродажи,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
		|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
		|		ИНАЧЕ ЗаказНарядРаботы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
		|	КОНЕЦ КАК СчетУчетаСебестоимость,
		//+++
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
		|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
		|		ИНАЧЕ ЗаказНарядРаботы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
		|	КОНЕЦ КАК СчетУчетаПродажиРегл,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
		|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
		|		ИНАЧЕ ЗаказНарядРаботы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
		|	КОНЕЦ КАК СчетУчетаСебестоимостьРегл,
		//---
		|	ЗаказНарядРаботы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент * ЗаказНарядРаботы.Кратность КАК Количество,
		|	ЗаказНарядРаботы.СтавкаНДС КАК СтавкаНДС,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЗаказНарядРаботы.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|				ТОГДА ЗаказНарядРаботы.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		//|			ИНАЧЕ ЗаказНарядРаботы.Всего * ЗаказНарядРаботы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказНарядРаботы.Ссылка.Кратность)
		|			ИНАЧЕ ЗаказНарядРаботы.Всего * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЗаказНарядРаботы.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|				ТОГДА ЗаказНарядРаботы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		//|			ИНАЧЕ ЗаказНарядРаботы.СуммаНДС * ЗаказНарядРаботы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказНарядРаботы.Ссылка.Кратность)
		|			ИНАЧЕ ЗаказНарядРаботы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЗаказНарядРаботы.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|				ТОГДА ЗаказНарядРаботы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		//|			ИНАЧЕ ЗаказНарядРаботы.СуммаНДС * ЗаказНарядРаботы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказНарядРаботы.Ссылка.Кратность)
		|			ИНАЧЕ ЗаказНарядРаботы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСПродажи,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЗаказНарядРаботы.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|				ТОГДА ЗаказНарядРаботы.СуммаНДС * КурсыРегВалюты.Курс * ЗаказНарядРаботы.Ссылка.Кратность / (ЗаказНарядРаботы.Ссылка.Курс * КурсыРегВалюты.Кратность)
		|			ИНАЧЕ ЗаказНарядРаботы.СуммаНДС
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСВал,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЗаказНарядРаботы.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|				ТОГДА ЗаказНарядРаботы.Всего * КурсыРегВалюты.Курс * ЗаказНарядРаботы.Ссылка.Кратность / (ЗаказНарядРаботы.Ссылка.Курс * КурсыРегВалюты.Кратность)
		|			ИНАЧЕ ЗаказНарядРаботы.Всего
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаВал,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент * ЗаказНарядРаботы.Кратность КАК КоличествоПлан,
		|	ЗаказНарядРаботы.Ссылка.СостояниеЗаказа КАК СостояниеЗаказа,
		|	ЗаказНарядРаботы.Ссылка.ВариантЗавершения КАК ВариантЗавершения,
		|	ЗаказНарядРаботы.Спецификация,
		|	ЗаказНарядРаботы.КлючСвязиДляСкидокНаценок,
		|	ЗаказНарядРаботы.Ссылка.ВидНалогаНДС,
		//--------------------------------------------------------------------------
		// © Шишка В.В. [13 августа 2020 г.]  НАЧАЛО
		|	ВЫБОР КОГДА &ЭтоЗаказНаряд = ИСТИНА И &ИспользоватьГарантииВНарядЗаказах = ИСТИНА ТОГДА ЗаказНарядРаботы.Гарантия
		|	ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Гарантия,
		// © Шишка В.В. [13 августа 2020 г.]  КОНЕЦ
		//--------------------------------------------------------------------------
		|	ВЫБОР
		|		КОГДА ЗаказНарядРаботы.Ссылка.СуммаВключаетНДС
		|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
		|						КОГДА ЗаказНарядРаботы.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|							ТОГДА (ЗаказНарядРаботы.Всего - ЗаказНарядРаботы.СуммаНДС) * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		//|						ИНАЧЕ (ЗаказНарядРаботы.Всего - ЗаказНарядРаботы.СуммаНДС) * ЗаказНарядРаботы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказНарядРаботы.Ссылка.Кратность)
		|						ИНАЧЕ (ЗаказНарядРаботы.Всего - ЗаказНарядРаботы.СуммаНДС) * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
		|					КОНЕЦ КАК ЧИСЛО(15, 2))
		|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА ЗаказНарядРаботы.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|						ТОГДА ЗаказНарядРаботы.Сумма * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		//|					ИНАЧЕ ЗаказНарядРаботы.Сумма * ЗаказНарядРаботы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказНарядРаботы.Ссылка.Кратность)
		|					ИНАЧЕ ЗаказНарядРаботы.Сумма * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
		|				КОНЕЦ КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК СуммаБезНДС,
		|	ВЫБОР
		|		КОГДА ЗаказНарядРаботы.Ссылка.СуммаВключаетНДС
		|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
		|						КОГДА ЗаказНарядРаботы.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|							ТОГДА (ЗаказНарядРаботы.Всего - ЗаказНарядРаботы.СуммаНДС) * КурсыРегВалюты.Курс * ЗаказНарядРаботы.Ссылка.Кратность / (ЗаказНарядРаботы.Ссылка.Курс * КурсыРегВалюты.Кратность)
		|						ИНАЧЕ ЗаказНарядРаботы.Всего - ЗаказНарядРаботы.СуммаНДС
		|					КОНЕЦ КАК ЧИСЛО(15, 2))
		|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА ЗаказНарядРаботы.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|						ТОГДА ЗаказНарядРаботы.Сумма * КурсыРегВалюты.Курс * ЗаказНарядРаботы.Ссылка.Кратность / (ЗаказНарядРаботы.Ссылка.Курс * КурсыРегВалюты.Кратность)
		|					ИНАЧЕ ЗаказНарядРаботы.Сумма
		|				КОНЕЦ КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК СуммаБезНДСВал
		// +++ { AzRy - [15.08.2014] - Jira:ERPM-306 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:myidvelis shekveta unda gamochndes
		|	,
		|	ЗаказНарядРаботы.AzRyНоменклатура,
		|	ЗаказНарядРаботы.AzRyПартииНоменклатуры
		// +++ } AzRy - [15.08.2014] - Jira:ERPM-306 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:myidvelis shekveta unda gamochndes		
		|ПОМЕСТИТЬ ВременнаяТаблицаРаботы
		|ИЗ
		|	Документ.ЗаказПокупателя.Работы КАК ЗаказНарядРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
		|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
		|		ПО (КурсыРегВалюты.Валюта = &ВалютаНациональная)
		//+++ Дмгг
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокумента
		|		ПО (СреднийКурсДокумента.Ссылка.ВалютаДокумента = ЗаказНарядРаботы.Ссылка.ВалютаДокумента),
		//--- Дмгг
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка = &Ссылка
		|	И ЗаказНарядРаботы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
		|	И ЗаказНарядРаботы.Ссылка.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНарядТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказНарядТовары.Ссылка КАК Документ,
		|	ЗаказНарядТовары.Ссылка.Контрагент КАК Контрагент,
		|	ЗаказНарядТовары.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
		|	ЗаказНарядТовары.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ЗаказНарядТовары.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
		|	ЗаказНарядТовары.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
		|	ЗаказНарядТовары.Ссылка.Договор КАК Договор,
		|	ЗаказНарядТовары.Ссылка.Дата КАК Период,
		|	ЗаказНарядТовары.Ссылка.Финиш,
		|	ЗаказНарядТовары.Ссылка.Старт,
		|	&Организация КАК Организация,
		|	НЕОПРЕДЕЛЕНО КАК КоррОрганизация,
		|	ЗаказНарядТовары.Ссылка.СтруктурнаяЕдиницаПродажи КАК ПодразделениеПродажи,
		|	ЗаказНарядТовары.Ссылка.Ответственный КАК Ответственный,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
		|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.НаправлениеДеятельности
		|	КОНЕЦ КАК НаправлениеДеятельностиПродажи,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
		|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
		|	КОНЕЦ КАК СчетУчетаПродажи,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
		|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
		|	КОНЕЦ КАК СчетУчетаСебестоимость,
		//+++
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
		|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
		|	КОНЕЦ КАК СчетУчетаПродажиРегл,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
		|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
		|	КОНЕЦ КАК СчетУчетаСебестоимостьРегл,
		//---
		|	ЗаказНарядТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	ЗаказНарядТовары.Ссылка.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиница,
		|	НЕОПРЕДЕЛЕНО КАК КоррСтруктурнаяЕдиница,
		|	ВЫБОР
		|		КОГДА ЗаказНарядТовары.Ссылка.СтруктурнаяЕдиницаРезерв.ОрдерныйСклад
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОрдерныйСклад,
		|	ВЫБОР
		|		КОГДА &УчетПоЯчейкам
		|			ТОГДА ЗаказНарядТовары.Ссылка.Ячейка
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
		|	КОНЕЦ КАК Ячейка,
		|	ЗаказНарядТовары.Номенклатура.СчетУчетаЗапасов КАК СчетУчета,
		|	ЗаказНарядТовары.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаРегл, //+++
		|	ЗаказНарядТовары.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл, //+++
		|	НЕОПРЕДЕЛЕНО КАК КоррСчетУчета,
		|	НЕОПРЕДЕЛЕНО КАК КоррСчетУчетаРегл, //+++
		|	ВЫБОР
		|		КОГДА &ИспользоватьПартии
		|				И ЗаказНарядТовары.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТоварыНаКомиссии,
		|	ЗаказНарядТовары.Номенклатура КАК Номенклатура,
		|	ЗаказНарядТовары.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ЗаказНарядТовары.НомерГТД КАК НомерГТД,
		////ПодольскийАИ #УчетПроектов 10.10.2020 {
		//|	ВЫБОР 
		//|		КОГДА &УчетПоПроектам 
		//|			ТОГДА ЗаказНарядТовары.Проект
		//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		//|	КОНЕЦ КАК Проект,
		////ПодольскийАИ #УчетПроектов 10.10.2020 }
		//_Lazare
		|ВЫБОР
		|КОГДА &УчетПоПроектам
		|	ТОГДА ВЫБОР
		|			КОГДА ЗаказНарядТовары.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|			ИНАЧЕ ЗаказНарядТовары.Проект
		|		КОНЕЦ
		|ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ КАК Проект,
		//Lazare_
		|	НЕОПРЕДЕЛЕНО КАК КоррНоменклатура,
		|	ВЫБОР
		|		КОГДА &ИспользоватьХарактеристики
		|			ТОГДА ЗаказНарядТовары.Характеристика
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ КАК Характеристика,
		|	НЕОПРЕДЕЛЕНО КАК КоррХарактеристика,
		|	ВЫБОР
		|		КОГДА &ИспользоватьПартии
		|			ТОГДА ЗаказНарядТовары.Партия
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ КАК Партия,
		|	НЕОПРЕДЕЛЕНО КАК КоррПартия,
		|	ЗаказНарядТовары.Ссылка КАК Заказ,
		|	ЗаказНарядТовары.Ссылка КАК ЗаказПокупателя,
		|	НЕОПРЕДЕЛЕНО КАК КоррЗаказ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказНарядТовары.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|			ТОГДА ЗаказНарядТовары.Количество
		|		ИНАЧЕ ЗаказНарядТовары.Количество * ЗаказНарядТовары.ЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказНарядТовары.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|			ТОГДА ЗаказНарядТовары.Резерв
		|		ИНАЧЕ ЗаказНарядТовары.Резерв * ЗаказНарядТовары.ЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ КАК Резерв,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказНарядТовары.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|			ТОГДА ЗаказНарядТовары.РезервОтгрузка
		|		ИНАЧЕ ЗаказНарядТовары.РезервОтгрузка * ЗаказНарядТовары.ЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ КАК РезервОтгрузка,
		|	ЗаказНарядТовары.СтавкаНДС КАК СтавкаНДС,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЗаказНарядТовары.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|				ТОГДА ЗаказНарядТовары.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		//|			ИНАЧЕ ЗаказНарядТовары.СуммаНДС * ЗаказНарядТовары.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказНарядТовары.Ссылка.Кратность)
		|			ИНАЧЕ ЗаказНарядТовары.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЗаказНарядТовары.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|				ТОГДА ЗаказНарядТовары.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		//|			ИНАЧЕ ЗаказНарядТовары.СуммаНДС * ЗаказНарядТовары.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказНарядТовары.Ссылка.Кратность)
		|			ИНАЧЕ ЗаказНарядТовары.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСЗакупкиПродажи,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЗаказНарядТовары.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|				ТОГДА ЗаказНарядТовары.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		//|			ИНАЧЕ ЗаказНарядТовары.Всего * ЗаказНарядТовары.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказНарядТовары.Ссылка.Кратность)
		|			ИНАЧЕ ЗаказНарядТовары.Всего * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЗаказНарядТовары.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|				ТОГДА ЗаказНарядТовары.СуммаНДС * КурсыРегВалюты.Курс * ЗаказНарядТовары.Ссылка.Кратность / (ЗаказНарядТовары.Ссылка.Курс * КурсыРегВалюты.Кратность)
		|			ИНАЧЕ ЗаказНарядТовары.СуммаНДС
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСВал,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЗаказНарядТовары.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|				ТОГДА ЗаказНарядТовары.Всего * КурсыРегВалюты.Курс * ЗаказНарядТовары.Ссылка.Кратность / (ЗаказНарядТовары.Ссылка.Курс * КурсыРегВалюты.Кратность)
		|			ИНАЧЕ ЗаказНарядТовары.Всего
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаВал,
		|	ЗаказНарядТовары.Всего КАК СуммаРасчетовПринятыеПереданные,
		|	ЗаказНарядТовары.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
		|	ЗаказНарядТовары.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
		//+++
		|	ЗаказНарядТовары.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
		|	ЗаказНарядТовары.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
		//---
		|	ЗаказНарядТовары.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	ЗаказНарядТовары.Ссылка.СостояниеЗаказа КАК СостояниеЗаказа,
		|	ЗаказНарядТовары.Ссылка.ВариантЗавершения КАК ВариантЗавершения,
		|	ЗаказНарядТовары.КлючСвязи,
		|	ЗаказНарядТовары.Ссылка.ВидНалогаНДС,
		//--------------------------------------------------------------------------
		// © Шишка В.В. [13 августа 2020 г.]  НАЧАЛО
		|	ВЫБОР КОГДА &ЭтоЗаказНаряд = ИСТИНА И &ИспользоватьГарантииВНарядЗаказах = ИСТИНА ТОГДА ЗаказНарядТовары.Гарантия
		|	ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Гарантия,
		|	ЗаказНарядТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЗаказНарядТовары.Количество КАК КоличествоЕд,
		// © Шишка В.В. [13 августа 2020 г.]  КОНЕЦ
		//--------------------------------------------------------------------------
		|	ВЫБОР
		|		КОГДА ЗаказНарядТовары.Ссылка.СуммаВключаетНДС
		|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
		|						КОГДА ЗаказНарядТовары.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|							ТОГДА (ЗаказНарядТовары.Всего - ЗаказНарядТовары.СуммаНДС) * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		//|						ИНАЧЕ (ЗаказНарядТовары.Всего - ЗаказНарядТовары.СуммаНДС) * ЗаказНарядТовары.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказНарядТовары.Ссылка.Кратность)
		|						ИНАЧЕ (ЗаказНарядТовары.Всего - ЗаказНарядТовары.СуммаНДС) * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
		|					КОНЕЦ КАК ЧИСЛО(15, 2))
		|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА ЗаказНарядТовары.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|						ТОГДА ЗаказНарядТовары.Сумма * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		//|					ИНАЧЕ ЗаказНарядТовары.Сумма * ЗаказНарядТовары.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказНарядТовары.Ссылка.Кратность)
		|					ИНАЧЕ ЗаказНарядТовары.Сумма * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
		|				КОНЕЦ КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК СуммаБезНДС,
		|	ВЫБОР
		|		КОГДА ЗаказНарядТовары.Ссылка.СуммаВключаетНДС
		|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
		|						КОГДА ЗаказНарядТовары.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|							ТОГДА (ЗаказНарядТовары.Всего - ЗаказНарядТовары.СуммаНДС) * КурсыРегВалюты.Курс * ЗаказНарядТовары.Ссылка.Кратность / (ЗаказНарядТовары.Ссылка.Курс * КурсыРегВалюты.Кратность)
		|						ИНАЧЕ ЗаказНарядТовары.Всего - ЗаказНарядТовары.СуммаНДС
		|					КОНЕЦ КАК ЧИСЛО(15, 2))
		|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА ЗаказНарядТовары.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|						ТОГДА ЗаказНарядТовары.Сумма * КурсыРегВалюты.Курс * ЗаказНарядТовары.Ссылка.Кратность / (ЗаказНарядТовары.Ссылка.Курс * КурсыРегВалюты.Кратность)
		|					ИНАЧЕ ЗаказНарядТовары.Сумма
		|				КОНЕЦ КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК СуммаБезНДСВал
		|ПОМЕСТИТЬ ВременнаяТаблицаТовары
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ЗаказНарядТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
		|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
		|		ПО (КурсыРегВалюты.Валюта = &ВалютаНациональная)
		//+++ Дмгг
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокумента
		|		ПО (СреднийКурсДокумента.Ссылка.ВалютаДокумента = ЗаказНарядТовары.Ссылка.ВалютаДокумента),
		//--- Дмгг
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка = &Ссылка
		|	И ЗаказНарядТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
		|	И ЗаказНарядТовары.Ссылка.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНарядМатериалы.НомерСтроки КАК НомерСтроки,
		|	ЗаказНарядМатериалы.Ссылка.Дата КАК Период,
		|	ЗаказНарядМатериалы.Ссылка.Финиш,
		|	ЗаказНарядМатериалы.Ссылка.Старт,
		|	&Организация КАК Организация,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
		|	ЗаказНарядМатериалы.Ссылка КАК Заказ,
		|	ЗаказНарядМатериалы.Ссылка.СтруктурнаяЕдиницаПродажи КАК СтруктурнаяЕдиница,
		|	ВЫБОР
		|		КОГДА &УчетПоЯчейкам
		|			ТОГДА ЗаказНарядМатериалы.Ссылка.Ячейка
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
		|	КОНЕЦ КАК Ячейка,
		|	ЗаказНарядМатериалы.Ссылка.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаЗапасов,
		|	ВЫБОР
		|		КОГДА &УчетПоЯчейкам
		|			ТОГДА ЗаказНарядМатериалы.Ссылка.Ячейка
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
		|	КОНЕЦ КАК ЯчейкаЗапасов,
		|	ВЫБОР
		|		КОГДА ЗаказНарядМатериалы.Ссылка.СтруктурнаяЕдиницаРезерв.ОрдерныйСклад
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОрдерныйСклад,
		|	ВЫБОР
		|		КОГДА ЗаказНарядМатериалы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
		|				ИЛИ ЗаказНарядМатериалы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
		|			ТОГДА ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗапасов
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗаказНарядМатериалы.Ссылка.СтруктурнаяЕдиницаПродажи.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|					ТОГДА ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗапасов
		|				ИНАЧЕ ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗатрат
		|			КОНЕЦ
		|	КОНЕЦ КАК СчетУчета,
		|	ВЫБОР
		|		КОГДА ЗаказНарядМатериалы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
		|				ИЛИ ЗаказНарядМатериалы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
		|			ТОГДА ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗапасов
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗаказНарядМатериалы.Ссылка.СтруктурнаяЕдиницаРезерв.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|					ТОГДА ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗапасов
		|				ИНАЧЕ ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗатрат
		|			КОНЕЦ
		|	КОНЕЦ КАК СчетУчетаЗапасов,
		|	ВЫБОР
		|		КОГДА ЗаказНарядМатериалы.Ссылка.СтруктурнаяЕдиницаПродажи.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|			ТОГДА ЗаказНарядРаботы.Номенклатура.СчетУчетаЗапасов
		|		ИНАЧЕ ЗаказНарядРаботы.Номенклатура.СчетУчетаЗатрат
		|	КОНЕЦ КАК КоррСчетУчета,
		//+++
		|	ВЫБОР
		|		КОГДА ЗаказНарядМатериалы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
		|				ИЛИ ЗаказНарядМатериалы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
		|			ТОГДА ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗапасовРегл
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗаказНарядМатериалы.Ссылка.СтруктурнаяЕдиницаПродажи.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|					ТОГДА ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗапасовРегл
		|				ИНАЧЕ ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗатратРегл
		|			КОНЕЦ
		|	КОНЕЦ КАК СчетУчетаРегл,
		|	ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	ВЫБОР
		|		КОГДА ЗаказНарядМатериалы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
		|				ИЛИ ЗаказНарядМатериалы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
		|			ТОГДА ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗапасовРегл
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗаказНарядМатериалы.Ссылка.СтруктурнаяЕдиницаРезерв.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|					ТОГДА ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗапасовРегл
		|				ИНАЧЕ ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗатратРегл
		|			КОНЕЦ
		|	КОНЕЦ КАК СчетУчетаЗапасовРегл,
		|	ВЫБОР
		|		КОГДА ЗаказНарядМатериалы.Ссылка.СтруктурнаяЕдиницаПродажи.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|			ТОГДА ЗаказНарядРаботы.Номенклатура.СчетУчетаЗапасовРегл
		|		ИНАЧЕ ЗаказНарядРаботы.Номенклатура.СчетУчетаЗатратРегл
		|	КОНЕЦ КАК КоррСчетУчетаРегл,
		//---
		|	ЗаказНарядМатериалы.Номенклатура КАК Номенклатура,
		|	ЗаказНарядМатериалы.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ЗаказНарядМатериалы.НомерГТД КАК НомерГТД,
		|	ЗаказНарядРаботы.Номенклатура КАК КоррНоменклатура,
		////ПодольскийАИ #УчетПроектов 10.10.2020 {
		//|	ВЫБОР 
		//|		КОГДА &УчетПоПроектам 
		//|			ТОГДА ЗаказНарядМатериалы.Проект
		//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		//|	КОНЕЦ КАК Проект,
		//|	ВЫБОР 
		//|		КОГДА &УчетПоПроектам 
		//|			ТОГДА ЗаказНарядМатериалы.Проект
		//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		//|	КОНЕЦ КАК КоррПроект,
		////ПодольскийАИ #УчетПроектов 10.10.2020 }
		//_Lazare
		|ВЫБОР
		|КОГДА &УчетПоПроектам
		|	ТОГДА ВЫБОР
		|			КОГДА ЗаказНарядМатериалы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|			ИНАЧЕ ЗаказНарядМатериалы.Проект
		|		КОНЕЦ
		|ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ КАК Проект,	
		|ВЫБОР
		|КОГДА &УчетПоПроектам
		|	ТОГДА ВЫБОР
		|			КОГДА ЗаказНарядМатериалы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|			ИНАЧЕ ЗаказНарядМатериалы.Проект
		|		КОНЕЦ
		|ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ КАК КоррПроект,
		//Lazare_
		|	ВЫБОР
		|		КОГДА &ИспользоватьХарактеристики
		|			ТОГДА ЗаказНарядМатериалы.Характеристика
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ КАК Характеристика,
		|	ВЫБОР
		|		КОГДА &ИспользоватьХарактеристики
		|			ТОГДА ЗаказНарядРаботы.Характеристика
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ КАК КоррХарактеристика,
		|	ВЫБОР
		|		КОГДА &ИспользоватьПартии
		|			ТОГДА ЗаказНарядМатериалы.Партия
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ КАК Партия,
		|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК КоррПартия,
		|	ЗаказНарядРаботы.Спецификация КАК КоррСпецификация,
		|	ЗНАЧЕНИЕ(Справочник.Спецификации.ПустаяСсылка) КАК Спецификация,
		|	ЗаказНарядМатериалы.Ссылка КАК ЗаказПокупателя,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказНарядМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|			ТОГДА ЗаказНарядМатериалы.Количество
		|		ИНАЧЕ ЗаказНарядМатериалы.Количество * ЗаказНарядМатериалы.ЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказНарядМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|			ТОГДА ЗаказНарядМатериалы.Резерв
		|		ИНАЧЕ ЗаказНарядМатериалы.Резерв * ЗаказНарядМатериалы.ЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ КАК Резерв,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказНарядМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|			ТОГДА ЗаказНарядМатериалы.РезервОтгрузка
		|		ИНАЧЕ ЗаказНарядМатериалы.РезервОтгрузка * ЗаказНарядМатериалы.ЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ КАК РезервОтгрузка,
		|	0 КАК Сумма,
		|	ЗаказНарядРаботы.Номенклатура.СчетУчетаЗатрат КАК СчетДт,
		|	ВЫБОР
		|		КОГДА ЗаказНарядМатериалы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
		|				ИЛИ ЗаказНарядМатериалы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
		|			ТОГДА ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗапасов
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗаказНарядМатериалы.Ссылка.СтруктурнаяЕдиницаПродажи.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|					ТОГДА ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗапасов
		|				ИНАЧЕ ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗатрат
		|			КОНЕЦ
		|	КОНЕЦ КАК СчетКт,
		//+++
		|	ЗаказНарядРаботы.Номенклатура.СчетУчетаЗатратРегл КАК СчетДтРегл,
		|	ВЫБОР
		|		КОГДА ЗаказНарядМатериалы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
		|				ИЛИ ЗаказНарядМатериалы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
		|			ТОГДА ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗапасовРегл
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗаказНарядМатериалы.Ссылка.СтруктурнаяЕдиницаПродажи.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|					ТОГДА ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗапасовРегл
		|				ИНАЧЕ ЗаказНарядМатериалы.Номенклатура.СчетУчетаЗатратРегл
		|			КОНЕЦ
		|	КОНЕЦ КАК СчетКтРегл,
		//---
		|	ВЫРАЗИТЬ(&РаспределениеЗапасов КАК СТРОКА(100)) КАК СодержаниеПроводки,
		|	ВЫРАЗИТЬ(&РаспределениеЗапасов КАК СТРОКА(100)) КАК Содержание,
		|	ЗаказНарядМатериалы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	ЗаказНарядМатериалы.Ссылка.Старт КАК Старт1,
		|	ЗаказНарядМатериалы.Ссылка.СостояниеЗаказа КАК СостояниеЗаказа,
		|	ЗаказНарядМатериалы.Ссылка.ВариантЗавершения КАК ВариантЗавершения,
		|	ЗаказНарядМатериалы.КлючСвязиСерийныеНомера
		|ПОМЕСТИТЬ ВременнаяТаблицаМатериалы
		|ИЗ
		|	Документ.ЗаказПокупателя.Материалы КАК ЗаказНарядМатериалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Работы КАК ЗаказНарядРаботы
		|		ПО ЗаказНарядМатериалы.КлючСвязи = ЗаказНарядРаботы.КлючСвязи
		|ГДЕ
		|	ЗаказНарядМатериалы.Ссылка = &Ссылка
		|	И ЗаказНарядРаботы.Ссылка = &Ссылка
		|	И ЗаказНарядМатериалы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
		|	И ЗаказНарядМатериалы.Ссылка.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНарядИсполнители.НомерСтроки КАК НомерСтроки,
		|	ЗаказНарядИсполнители.Ссылка.Финиш КАК Период,
		|	&Организация КАК Организация,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
		|	НАЧАЛОПЕРИОДА(ЗаказНарядИсполнители.Ссылка.Финиш, МЕСЯЦ) КАК ПериодРегистрации,
		|	ЗаказНарядИсполнители.Ссылка.ВалютаДокумента КАК Валюта,
		|	ЗаказНарядИсполнители.Ссылка.СтруктурнаяЕдиницаПродажи КАК СтруктурнаяЕдиница,
		|	ЗаказНарядИсполнители.Сотрудник,
		|	ЗаказНарядИсполнители.Ссылка.Старт КАК ДатаНачала,
		|	ЗаказНарядИсполнители.Ссылка.Финиш КАК ДатаОкончания,
		|	0 КАК ОтработаноДней,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент * ЗаказНарядРаботы.Кратность КАК ОтработаноЧасов,
		|	ЗаказНарядИсполнители.СуммаНачисления КАК СуммаВал,
		|	ЗаказНарядИсполнители.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
		|	ЗаказНарядИсполнители.Сотрудник.СчетРасчетовСПерсоналом КАК СчетУчета,
		|	ЗаказНарядИсполнители.ВидНачисленияУдержания.СчетЗатрат КАК СчетУчетаЗапасов,
		|	ЗаказНарядРаботы.Номенклатура.СчетУчетаЗатрат КАК КоррСчетУчетаЗапасов,
		//+++
		|	ЗаказНарядИсполнители.Сотрудник.СчетРасчетовСПерсоналомРегл КАК СчетУчетаРегл,
		|	ЗаказНарядИсполнители.ВидНачисленияУдержания.СчетЗатратРегл КАК СчетУчетаЗапасовРегл,
		|	ЗаказНарядРаботы.Номенклатура.СчетУчетаЗатратРегл КАК КоррСчетУчетаЗапасовРегл,
		//---
		|	ЗаказНарядРаботы.Номенклатура КАК КоррНоменклатура,
		|	ЗаказНарядРаботы.Характеристика КАК КоррХарактеристика,
		|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК КоррПартия,
		|	ЗаказНарядРаботы.Спецификация КАК КоррСпецификация,
		|	ЗаказНарядИсполнители.Ссылка КАК ЗаказПокупателя,
		|	ЗаказНарядИсполнители.РазмерНачисленияУдержания КАК Размер,
		|	ВЫРАЗИТЬ(ЗаказНарядИсполнители.СуммаНачисления * ВЫБОР
		|			КОГДА ЗаказНарядИсполнители.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|				ТОГДА КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		|			ИНАЧЕ ЗаказНарядИсполнители.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказНарядИсполнители.Ссылка.Кратность)
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ЗаказНарядИсполнители.Ссылка КАК КоррЗаказ,
		|	ЗаказНарядИсполнители.Ссылка.СостояниеЗаказа КАК СостояниеЗаказа,
		|	ЗаказНарядИсполнители.Ссылка.ВариантЗавершения КАК ВариантЗавершения,
		//Паганини_
		|	ЗаказНарядИсполнители.СуммаНДФЛ КАК СуммаНДФЛВал,
		//Паганини ПФ_
		//|	ЗаказНарядИсполнители.ТипНДФЛ.ВидНалога КАК ВидНалога,
		|	ЗаказНарядИсполнители.ВидУдержанияНДФЛ.ВидНалога КАК ВидНалога,
		//_Паганини ПФ	
		//_Паганини
		//+++
		//Для НДФЛ
		//Паганини ПФ_
		//|	ЗаказНарядИсполнители.ТипНДФЛ.ВидНалога.СчетУчетаРегл КАК СчетУчетаНДФЛ,
		|	ЗаказНарядИсполнители.ВидУдержанияНДФЛ,
		|	ЗаказНарядИсполнители.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК СчетУчетаНДФЛ,
		|	ЗаказНарядИсполнители.ВидУдержанияПФ,
		|	ЗаказНарядИсполнители.СуммаПФ КАК СуммаПФВал,
		|	ВЫРАЗИТЬ(ЗаказНарядИсполнители.СуммаПФ * ВЫБОР
		|			КОГДА ЗаказНарядИсполнители.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|				ТОГДА КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		|			ИНАЧЕ ЗаказНарядИсполнители.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказНарядИсполнители.Ссылка.Кратность)
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаПФ,
		|	ЗаказНарядИсполнители.ВидУдержанияПФ.ПенсионныйНалогСотрудника КАК ПенсионныйНалогСотрудника,
		|	ЗаказНарядИсполнители.ВидУдержанияПФ.ПенсионныйНалогОрганизации КАК ПенсионныйНалогОрганизации,
		|	ЗаказНарядИсполнители.ВидУдержанияПФ.СчетЗатрат КАК СчетЗатратПФ,
		|	ЗаказНарядИсполнители.ВидУдержанияПФ.СчетЗатратРегл КАК СчетЗатратРеглПФ,
		|	ЗаказНарядИсполнители.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
		|	ЗаказНарядИсполнители.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
		|	ЗаказНарядИсполнители.ВидУдержанияПФ.Контрагент КАК Контрагент,
		|	ЗаказНарядИсполнители.ВидУдержанияПФ.Договор КАК Договор,
		//--------------------------------------------------------------------------
		// © Шишка В.В. [13 августа 2020 г.]  НАЧАЛО
		|	ЗаказНарядРаботы.Гарантия КАК Гарантия,	
		// © Шишка В.В. [13 августа 2020 г.]  КОНЕЦ
		//--------------------------------------------------------------------------
		//_Паганини ПФ	
		|	ВЫРАЗИТЬ(ЗаказНарядИсполнители.СуммаНДФЛ * ВЫБОР
		|			КОГДА ЗаказНарядИсполнители.Ссылка.ВалютаДокумента = &ВалютаНациональная
		|				ТОГДА КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		|			ИНАЧЕ ЗаказНарядИсполнители.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказНарядИсполнители.Ссылка.Кратность)
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДФЛ
		//---
		|ПОМЕСТИТЬ ВременнаяТаблицаИсполнители
		|ИЗ
		|	Документ.ЗаказПокупателя.Исполнители КАК ЗаказНарядИсполнители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Работы КАК ЗаказНарядРаботы
		|		ПО ЗаказНарядИсполнители.КлючСвязи = ЗаказНарядРаботы.КлючСвязи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
		|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
		|		ПО (КурсыРегВалюты.Валюта = &ВалютаНациональная),
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ЗаказНарядИсполнители.Ссылка = &Ссылка
		|	И ЗаказНарядРаботы.Ссылка = &Ссылка
		|	И ЗаказНарядРаботы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|	И ЗаказНарядИсполнители.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
		|	И ЗаказНарядИсполнители.Ссылка.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
		|	И ВременнаяТаблицаШапка.ЭтоСостояниеВыполненияЗаказНаряда = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
		|	ТаблицаДокумента.Ссылка.Финиш КАК Период,
		|	&Организация КАК Организация,
		|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
		|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
		|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
		//+++
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл КАК СчетУчетаАвансовПокупателяРегл,
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл КАК СчетУчетаАвансовПоставщикуРегл,
		//---
		|	ТаблицаДокумента.Ссылка.Договор КАК Договор,
		|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	ТаблицаДокумента.Ссылка КАК Заказ,
		|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельностиПродажи,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс) КАК ТипРасчетов,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетовКуда,
		|	&Ссылка КАК ДокументКуда,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ВЫБОР
		|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
		|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
		|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Статья
		|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
		|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Статья
		|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
		|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Статья
		|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
		|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Статья
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
		|			КОНЕЦ
		|	КОНЕЦ КАК Статья,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
		|			ТОГДА ВЫБОР
		|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
		|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Дата
		|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
		|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Дата
		|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
		|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Дата
		|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
		|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Дата
		|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
		|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.Взаимозачет).Дата
		|				КОНЕЦ
		|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
		|	КОНЕЦ КАК ДокументДата,
		//|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Ссылка.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Ссылка.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
		|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
		|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал,
		|	ТаблицаДокумента.Ссылка.Финиш,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.ОперацияПоПлатежнымКартам)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоЭквайринговаяОперация,
		|	ТаблицаДокумента.Документ.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
		|	НАЧАЛОПЕРИОДА(ТаблицаДокумента.Документ.Дата, ДЕНЬ) КАК ДатаПлатежа
		|ПОМЕСТИТЬ ВременнаяТаблицаПредоплата
		|ИЗ
		|	Документ.ЗаказПокупателя.Предоплата КАК ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
		|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
		|	И ТаблицаДокумента.Ссылка.СостояниеЗаказа = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказНарядов.Завершен)
		|	И ТаблицаДокумента.Ссылка.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Успешно)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Ссылка,
		|	ТаблицаДокумента.Документ,
		|	ТаблицаДокумента.Ссылка.Контрагент,
		|	ТаблицаДокумента.Ссылка.Договор,
		|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов,
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем,
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя,
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком,
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику,
		//+++
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл,
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл,
		|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл,
		//---
		|	ВЫБОР
		|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
		|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
		|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Статья
		|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
		|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Статья
		|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
		|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Статья
		|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
		|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Статья
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
		|			ТОГДА ВЫБОР
		|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
		|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Дата
		|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
		|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Дата
		|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
		|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Дата
		|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
		|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Дата
		|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
		|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.Взаимозачет).Дата
		|				КОНЕЦ
		|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
		|	КОНЕЦ,
		|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
		|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
		|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
		|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
		|	ТаблицаДокумента.Ссылка.Финиш,
		|	ТаблицаДокумента.Документ.ЭквайринговыйТерминал,
		|	НАЧАЛОПЕРИОДА(ТаблицаДокумента.Документ.Дата, ДЕНЬ),
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.ОперацияПоПлатежнымКартам)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ТаблицаДокумента.Ссылка.Финиш
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяСкидкиНаценки.КлючСвязи,
		|	ЗаказПокупателяСкидкиНаценки.СкидкаНаценка,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЗаказПокупателяСкидкиНаценки.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
		|				ТОГДА ЗаказПокупателяСкидкиНаценки.Сумма * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		|			ИНАЧЕ ЗаказПокупателяСкидкиНаценки.Сумма * ЗаказПокупателяСкидкиНаценки.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказПокупателяСкидкиНаценки.Ссылка.Кратность)
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ЗаказПокупателяСкидкиНаценки.Ссылка.Дата КАК Период,
		|	ЗаказПокупателяСкидкиНаценки.Ссылка.Контрагент КАК СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ВременнаяТаблицаАвтоСкидкиНаценки
		|ИЗ
		|	Документ.ЗаказПокупателя.СкидкиНаценки КАК ЗаказПокупателяСкидкиНаценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаНациональнаяВалюта.Значение
		|					ИЗ
		|						Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты
		|		ПО (ИСТИНА),
		|	Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта
		|ГДЕ
		|	ЗаказПокупателяСкидкиНаценки.Ссылка = &Ссылка
		|	И ЗаказПокупателяСкидкиНаценки.Сумма <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяСерийныеНомера.КлючСвязи,
		|	ЗаказПокупателяСерийныеНомера.СерийныйНомер
		|ПОМЕСТИТЬ ВременнаяТаблицаСерийныеНомера
		|ИЗ
		|	Документ.ЗаказПокупателя.СерийныеНомера КАК ЗаказПокупателяСерийныеНомера
		|ГДЕ
		|	ЗаказПокупателяСерийныеНомера.Ссылка = &Ссылка
		|	И &ИспользоватьСерийныеНомера
		|	И НЕ ЗаказПокупателяСерийныеНомера.Ссылка.СтруктурнаяЕдиницаРезерв.ОрдерныйСклад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяСерийныеНомера.КлючСвязи,
		|	ЗаказПокупателяСерийныеНомера.СерийныйНомер
		|ПОМЕСТИТЬ ВременнаяТаблицаСерийныеНомераМатериалы
		|ИЗ
		|	Документ.ЗаказПокупателя.СерийныеНомераМатериалы КАК ЗаказПокупателяСерийныеНомера
		|ГДЕ
		|	ЗаказПокупателяСерийныеНомера.Ссылка = &Ссылка
		|	И &ИспользоватьСерийныеНомера
		|	И НЕ ЗаказПокупателяСерийныеНомера.Ссылка.СтруктурнаяЕдиницаРезерв.ОрдерныйСклад";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗаказПокупателя);
		Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
		Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
		Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
		Запрос.УстановитьПараметр("УчетПоЯчейкам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоЯчейкам);
		Запрос.УстановитьПараметр("РаспределениеЗапасов", НСтр("ka='მარაგების გადანაწილება';ru='Распределение запасов';en='distribution of reserves'"));
		
		Запрос.УстановитьПараметр("ИспользоватьСерийныеНомера", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьСерийныеНомера);
		
		Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
		Запрос.УстановитьПараметр("ВалютаНациональная", Константы.НациональнаяВалюта.Получить());
		//--------------------------------------------------------------------------
		// © Шишка В.В. [13 августа 2020 г.]  НАЧАЛО
		ЭтоЗаказНаряд = ДокументСсылкаЗаказПокупателя.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд;
		Запрос.УстановитьПараметр("ЭтоЗаказНаряд", ЭтоЗаказНаряд);
		Запрос.УстановитьПараметр("ИспользоватьГарантииВНарядЗаказах", СтруктураДополнительныеСвойства.ИспользоватьГарантииВНарядЗаказах);
		// © Шишка В.В. [13 августа 2020 г.]  КОНЕЦ
		//--------------------------------------------------------------------------
		
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
	
		Запрос.ВыполнитьПакет();
		
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПодготовитьСтруктурыСубконтоСчетовДоходаПродажи(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства); //+++ Дмгг
		
		// Формирование проводок документа.
		УправлениеНебольшойФирмойСервер.СформироватьТаблицуПроводок(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		
		СформироватьТаблицаВыпускПродукции(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаГрафикДвиженияЗапасов(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаДоходыИРасходы(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаЗаказыПокупателей(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаЗапасыВРазрезеГТД(СтруктураДополнительныеСвойства);
		СформироватьТаблицаЗапасыКРасходуСоСкладов(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаНачисленияИУдержания(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаПродажи(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаПотребностьВЗапасах(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаЗапасыРаботы(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаЗапасыМатериалы(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаЗапасыИсполнители(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаЗапасыТовары(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаЗапасыПринятые(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		ОтнестиЗатратыНаРаботы(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаПлатежныйКалендарь(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		
		// ДисконтныеКарты
		СформироватьТаблицаПродажиПоДисконтнойКарте(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		// АвтоматическиеСкидки
		СформироватьТаблицаПродажиПоПредоставленнымАвтоматическимСкидкам(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		// Эквайринг
		ЭквайринговыеОперацииСервер.СформироватьТаблицаДоходыИРасходыКассовыйМетодЭквайринг(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		// Серийные номера
		СформироватьТаблицаСерийныеНомера(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);	
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРазмещениеЗаказов", Новый ТаблицаЗначений);
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыПоЗаказамПрогноз", Новый ТаблицаЗначений);
		
		СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаРасчетыНДФЛ(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);//Паганини
		
		СформироватьТаблицаУправленческий(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		
		//ПаганиниRS_
		СформироватьТаблицаАвансыОтправленныхФактур(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		//_ПаганиниRS
		//--------------------------------------------------------------------------
		// © Шишка В.В. [13 августа 2020 г.]  НАЧАЛО
		СформироватьТаблицаГарантийноеОбслуживание(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);	
		// © Шишка В.В. [13 августа 2020 г.]  КОНЕЦ
		//--------------------------------------------------------------------------
		
		////+++
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ЗаказПокупателя(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		//---
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыСПенсионнымФондом_ЗаказПокупателя(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);//Паганини
		//ПМ Для отладки	
		// Биллинг
		СформироватьТаблицаВыполнениеДоговораОбслуживания(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
		СформироватьТаблицаПробег(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства);
			
КонецПроцедуры

&Вместо("СформироватьТаблицаВыпускПродукции")
Процедура РасшAzRy_СформироватьТаблицаВыпускПродукции(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МИНИМУМ(ТаблицаВыпускПродукции.НомерСтроки) КАК НомерСтроки,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ТаблицаВыпускПродукции.Финиш КАК Период,
		|	ТаблицаВыпускПродукции.Организация КАК Организация,
		|	ТаблицаВыпускПродукции.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаВыпускПродукции.Номенклатура КАК Номенклатура,
		|	ТаблицаВыпускПродукции.Характеристика КАК Характеристика,
		|	ТаблицаВыпускПродукции.Партия КАК Партия,
		|	ВЫБОР
		|		КОГДА Константы.ФункциональнаяОпцияРезервированиеЗапасов
		|			ТОГДА ТаблицаВыпускПродукции.ЗаказПокупателя
		|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|	КОНЕЦ КАК ЗаказПокупателя,
		|	ТаблицаВыпускПродукции.Спецификация КАК Спецификация,
		|	СУММА(ТаблицаВыпускПродукции.Количество) КАК Количество,
		|	0 КАК КоличествоПлан
		// +++ { AzRy - [15.08.2014] - Jira:ERPM-306 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:myidvelis shekveta unda gamochndes
		|   ,ТаблицаВыпускПродукции.AzRyНоменклатура КАК AzRyНоменклатура,
		|   ТаблицаВыпускПродукции.AzRyПартииНоменклатуры КАК AzRyПартииНоменклатуры
		// +++ } AzRy - [15.08.2014] - Jira:ERPM-306 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:myidvelis shekveta unda gamochndes		
		|ИЗ
		|	ВременнаяТаблицаРаботы КАК ТаблицаВыпускПродукции,
		|	Константы КАК Константы,
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ТаблицаВыпускПродукции.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|	И ВременнаяТаблицаШапка.ЭтоСостояниеВыполненияЗаказНаряда = ИСТИНА
		|	И ТаблицаВыпускПродукции.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаВыпускПродукции.Финиш,
		|	ТаблицаВыпускПродукции.Организация,
		|	ТаблицаВыпускПродукции.СтруктурнаяЕдиница,
		|	ТаблицаВыпускПродукции.Номенклатура,
		|	ТаблицаВыпускПродукции.Характеристика,
		|	ТаблицаВыпускПродукции.Партия,
		|	ТаблицаВыпускПродукции.ЗаказПокупателя,
		|	ТаблицаВыпускПродукции.Спецификация,
		|	Константы.ФункциональнаяОпцияРезервированиеЗапасов
		// +++ { AzRy - [15.08.2014] - Jira:ERPM-306 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:myidvelis shekveta unda gamochndes
		|   ,ТаблицаВыпускПродукции.AzRyНоменклатура,
		|   ТаблицаВыпускПродукции.AzRyПартииНоменклатуры
		// +++ } AzRy - [15.08.2014] - Jira:ERPM-306 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:myidvelis shekveta unda gamochndes		
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МИНИМУМ(ТаблицаВыпускПродукции.НомерСтроки),
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ТаблицаВыпускПродукции.Финиш,
		|	ТаблицаВыпускПродукции.Организация,
		|	ТаблицаВыпускПродукции.СтруктурнаяЕдиница,
		|	ТаблицаВыпускПродукции.Номенклатура,
		|	ТаблицаВыпускПродукции.Характеристика,
		|	ТаблицаВыпускПродукции.Партия,
		|	ВЫБОР
		|		КОГДА Константы.ФункциональнаяОпцияРезервированиеЗапасов
		|			ТОГДА ТаблицаВыпускПродукции.ЗаказПокупателя
		|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|	КОНЕЦ,
		|	ТаблицаВыпускПродукции.Спецификация,
		|	0,
		|	СУММА(ТаблицаВыпускПродукции.Количество)
		// +++ { AzRy - [15.08.2014] - Jira:ERPM-306 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:myidvelis shekveta unda gamochndes
		|   ,ТаблицаВыпускПродукции.AzRyНоменклатура,
		|   ТаблицаВыпускПродукции.AzRyПартииНоменклатуры
		// +++ } AzRy - [15.08.2014] - Jira:ERPM-306 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:myidvelis shekveta unda gamochndes		
		|ИЗ
		|	ВременнаяТаблицаРаботы КАК ТаблицаВыпускПродукции,
		|	Константы КАК Константы,
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ТаблицаВыпускПродукции.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|	И ВременнаяТаблицаШапка.ЭтоСостояниеВыполненияЗаказНаряда = ИСТИНА
		|	И ТаблицаВыпускПродукции.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаВыпускПродукции.Финиш,
		|	ТаблицаВыпускПродукции.Организация,
		|	ТаблицаВыпускПродукции.СтруктурнаяЕдиница,
		|	ТаблицаВыпускПродукции.Номенклатура,
		|	ТаблицаВыпускПродукции.Характеристика,
		|	ТаблицаВыпускПродукции.Партия,
		|	ТаблицаВыпускПродукции.ЗаказПокупателя,
		|	ТаблицаВыпускПродукции.Спецификация,
		// +++ { AzRy - [15.08.2014] - Jira:ERPM-306 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:myidvelis shekveta unda gamochndes
		|   ТаблицаВыпускПродукции.AzRyНоменклатура,
		|   ТаблицаВыпускПродукции.AzRyПартииНоменклатуры,
		// +++ } AzRy - [15.08.2014] - Jira:ERPM-306 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:myidvelis shekveta unda gamochndes		
		|	Константы.ФункциональнаяОпцияРезервированиеЗапасов";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыпускПродукции", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры

&Вместо("СформироватьТаблицаОплатаСчетовИЗаказов")
Процедура РасшAzRy_СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства)
	
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗаказПокупателя);
		Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
		
		//ПМ Глухов 03.12.19 Для Счетов и заказов не учитываем сумму по подаркам
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ЗаказПокупателяЗапасы.Всего) КАК СуммаПодарка,
		|	ЗаказПокупателяЗапасы.Ссылка
		|ПОМЕСТИТЬ БезУчетаПодарков
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		|ГДЕ
		|	ЗаказПокупателяЗапасы.Ссылка = &Ссылка
		|	И ЗаказПокупателяЗапасы.ЭтоПодарок
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяЗапасы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	&Организация КАК Организация,
		|	ТаблицаДокумента.Ссылка КАК СчетНаОплату,
		|	ТаблицаДокумента.СуммаДокумента - ЕСТЬNULL(БезУчетаПодарков.СуммаПодарка, 0) КАК Сумма
		// +++ { AzRy - [19.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:
		|	,ТаблицаДокумента.Проект КАК Проект
		// +++ } AzRy - [19.04.2022] - Jira:ERPM-883 - Developer:გიორგი მამულაშვილი - Comment:		
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ БезУчетаПодарков КАК БезУчетаПодарков
		|		ПО БезУчетаПодарков.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Контрагент.ВестиУчетОплатыПоСчетам
		|	И ТаблицаДокумента.Ссылка = &Ссылка
		|	И ТаблицаДокумента.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
		|	И ТаблицаДокумента.СуммаДокумента <> 0";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОплатаСчетовИЗаказов", РезультатЗапроса.Выгрузить());

КонецПроцедуры

&Вместо("НапечататьInvoice")
Функция РасшAzRy_НапечататьInvoice(МассивОбъектов, ОбъектыПечати)
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Invoice";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплату_Invoice";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Ссылка КАК Документ,
	|	ЗаказПокупателяЗапасы.Ссылка.Дата КАК Дата,
	|	ЗаказПокупателяЗапасы.Ссылка.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Ссылка.Организация.НаименованиеПолное КАК СТРОКА(100))) = """"
	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Организация.Наименование
	|		ИНАЧЕ ЗаказПокупателяЗапасы.Ссылка.Организация.НаименованиеПолное
	|	КОНЕЦ КАК Продавец,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(100))) = """"
	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Контрагент.Наименование
	|		ИНАЧЕ ЗаказПокупателяЗапасы.Ссылка.Контрагент.НаименованиеПолное
	|	КОНЕЦ КАК Покупатель,
	|	ЗаказПокупателяЗапасы.Ссылка.Договор КАК Договор,
	|	ЗаказПокупателяЗапасы.Ссылка.СуммаДокумента КАК Сумма,
	|	ЗаказПокупателяЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
	|	ЗаказПокупателяЗапасы.НомерСтроки КАК НомерСтроки,
	// +++ { AzRy - [17.10.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
	//|	ВЫБОР
	//|		КОГДА (ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
	//|			ТОГДА ЗаказПокупателяЗапасы.Номенклатура.Наименование
	//|		ИНАЧЕ ЗаказПокупателяЗапасы.Номенклатура.НаименованиеПолное
	//|	КОНЕЦ КАК Номенклатура,
	|	ЗаказПокупателяЗапасы.Номенклатура.Наименование КАК Номенклатура,
	// +++ } AzRy - [17.10.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
	|	ЗаказПокупателяЗапасы.Количество КАК Количество,
	|	ЗаказПокупателяЗапасы.Цена КАК Цена,
	|	ЗаказПокупателяЗапасы.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателяЗапасы.Всего КАК Всего,
	|	ЗаказПокупателяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.НомерСчета КАК БанковскийСчет,
	|	ЗаказПокупателяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Код КАК БанкКод,
	|	ЗаказПокупателяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Наименование КАК Банк,
	|	ЗаказПокупателяЗапасы.Ссылка.Контрагент.ИНН КАК ПокупательИНН,
	|	ЗаказПокупателяЗапасы.Ссылка.Организация.ИНН КАК ПродавецИНН,
	|	ЗаказПокупателяЗапасы.Ссылка.Ответственный.Физлицо КАК Ответственный,
	|	ЗаказПокупателяЗапасы.Ссылка.Организация.ФайлЛоготип КАК ФайлЛоготип,
	|	ЗаказПокупателяЗапасы.Ссылка.Организация.ФайлФаксимильнаяПечать КАК ФайлФаксимильнаяПечать,
	|	ЗаказПокупателяЗапасы.Ссылка.Организация.ФайлПечати КАК ФайлПечати,
	|	ЗаказПокупателяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо КАК Руководитель
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Ссылка В(&МассивОбъектов)
	|ИТОГИ
	|	МАКСИМУМ(Продавец),
	|	МАКСИМУМ(Покупатель),
	|	КОЛИЧЕСТВО(НомерСтроки),
	|	МАКСИМУМ(Характеристика),
	|	СУММА(СуммаНДС),
	|	СУММА(Всего),
	|	МАКСИМУМ(БанковскийСчет)
	|ПО
	|	Документ";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		// +++ { AzRy - [26.04.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
		//БанковскийСчет = ВыборкаДокумент.БанковскийСчет;
		//Если Сред(ВыборкаДокумент.БанковскийСчет, 1, 2) = "GE" Тогда
		//	БанковскийСчет = Сред(ВыборкаДокумент.БанковскийСчет, СтрДлина(ВыборкаДокумент.БанковскийСчет) - (СтрДлина(ВыборкаДокумент.БанковскийСчет) - 3), (СтрДлина(ВыборкаДокумент.БанковскийСчет) - 2));
		//КонецЕсли;
		МакетПечатнойФормы	= УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.AzRy_ПФ_MXL_Invoice");//ПолучитьМакет("ПФ_MXL_Invoice");
		// +++ } AzRy - [26.04.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment:		
		
		// Вывод шапки для документа
		
		ВыводитьХарактеристики = ЗначениеЗаполнено(ВыборкаДокумент.Характеристика);
		
		Если ВыводитьХарактеристики Тогда
			ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("ШапкаХарактеристики");
		Иначе	
			// +++ { AzRy - [26.04.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment: 
			ОбластьШапки = ?(ВыборкаДокумент.Документ.Организация = Справочники.Организации.НайтиПоКоду("00-000004"),МакетПечатнойФормы.ПолучитьОбласть("Шапка_GEME"),МакетПечатнойФормы.ПолучитьОбласть("Шапка"));
			// +++ } AzRy - [26.04.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
		КонецЕсли;
		ОбластьШапки.Параметры.Заполнить(ВыборкаДокумент);
		Попытка
			ОбластьШапки.Параметры.Дата	= Формат(ВыборкаДокумент.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлЛоготип) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлЛоготип);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьШапки.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		// Вывод таблицной части
		ВыборкаДанныхДокумента = ВыборкаДокумент.Выбрать();
		
		Если ВыводитьХарактеристики Тогда
			ОбластьСтрока = МакетПечатнойФормы.ПолучитьОбласть("ТабличаяЧастьХарактеристики");
		Иначе	
			ОбластьСтрока = МакетПечатнойФормы.ПолучитьОбласть("ТабличаяЧасть");
		КонецЕсли;
		
		Пока ВыборкаДанныхДокумента.Следующий() Цикл 
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДанныхДокумента);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		// Вывод подвала для документа
		ОбластьПодвал = МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(ВыборкаДокумент);
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлФаксимильнаяПечать) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлФаксимильнаяПечать);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Факсимилия.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлПечати) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлПечати);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.Руководитель) Тогда
			Попытка
				ОбластьПодвал.Параметры.Руководитель = РС_ОбщегоНазначения.ПолучитьФИОФизЛиц(ВыборкаДокумент.Руководитель, ВыборкаДокумент.Дата);
			Исключение
			КонецПопытки;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокумент.Документ);   
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

&Вместо("НапечататьInvoiceEng")
Функция РасшAzRy_НапечататьInvoiceEng(МассивОбъектов, ОбъектыПечати)
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_InvoiceEng";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплату_InvoiceEng";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Ссылка КАК Документ,
	|	ЗаказПокупателяЗапасы.Ссылка.Дата КАК Дата,
	|	ЗаказПокупателяЗапасы.Ссылка.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Ссылка.Организация.НаименованиеАнглийское КАК СТРОКА(100))) = """"
	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Организация.Наименование
	|		ИНАЧЕ ЗаказПокупателяЗапасы.Ссылка.Организация.НаименованиеАнглийское
	|	КОНЕЦ КАК Продавец,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(100))) = """"
	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Контрагент.Наименование
	|		ИНАЧЕ ЗаказПокупателяЗапасы.Ссылка.Контрагент.НаименованиеПолное
	|	КОНЕЦ КАК Покупатель,
	|	ЗаказПокупателяЗапасы.Ссылка.Договор КАК Договор,
	|	ЗаказПокупателяЗапасы.Ссылка.СуммаДокумента КАК Сумма,
	|	ЗаказПокупателяЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
	|	ЗаказПокупателяЗапасы.НомерСтроки КАК НомерСтроки,
	// +++ { AzRy - [17.10.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
	//|	ВЫБОР
	//|		КОГДА (ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
	//|			ТОГДА ЗаказПокупателяЗапасы.Номенклатура.Наименование
	//|		ИНАЧЕ ЗаказПокупателяЗапасы.Номенклатура.НаименованиеПолное
	//|	КОНЕЦ КАК Номенклатура,
	|	ЗаказПокупателяЗапасы.Номенклатура.Наименование КАК Номенклатура,
	// +++ } AzRy - [17.10.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
	|	ЗаказПокупателяЗапасы.Количество КАК Количество,
	|	ЗаказПокупателяЗапасы.Цена КАК Цена,
	|	ЗаказПокупателяЗапасы.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателяЗапасы.Всего КАК Всего,
	|	ЗаказПокупателяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.НомерСчета КАК БанковскийСчет,
	|	ЗаказПокупателяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Код КАК БанкКод,
	|	ЗаказПокупателяЗапасы.Ссылка.Контрагент.ИНН КАК ПокупательИНН,
	|	ЗаказПокупателяЗапасы.Ссылка.Организация.ИНН КАК ПродавецИНН,
	|	ЗаказПокупателяЗапасы.Ссылка.Ответственный.Физлицо КАК Ответственный,
	|	ЗаказПокупателяЗапасы.Ссылка.Организация.ФайлЛоготип КАК ФайлЛоготип,
	|	ЗаказПокупателяЗапасы.Ссылка.Организация.ФайлФаксимильнаяПечать КАК ФайлФаксимильнаяПечать,
	|	ЗаказПокупателяЗапасы.Ссылка.Организация.ФайлПечати КАК ФайлПечати,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.НаименованиеАнглиское КАК СТРОКА(100))) = """"
	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Наименование
	|		ИНАЧЕ ЗаказПокупателяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.НаименованиеАнглиское
	|	КОНЕЦ КАК Банк,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо.НаименованиеАнглиское КАК СТРОКА(100))) = """"
	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо
	|		ИНАЧЕ ЗаказПокупателяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо.НаименованиеАнглиское
	|	КОНЕЦ КАК Руководитель
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Ссылка В(&МассивОбъектов)
	|ИТОГИ
	|	МАКСИМУМ(Продавец),
	|	МАКСИМУМ(Покупатель),
	|	КОЛИЧЕСТВО(НомерСтроки),
	|	СУММА(СуммаНДС),
	|	СУММА(Всего),
	|	МАКСИМУМ(БанковскийСчет)
	|ПО
	|	Документ";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		// +++ { AzRy - [26.04.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
		//БанковскийСчет = ВыборкаДокумент.БанковскийСчет;
		//Если Сред(ВыборкаДокумент.БанковскийСчет, 1, 2) = "GE" Тогда
		//	БанковскийСчет = Сред(ВыборкаДокумент.БанковскийСчет, СтрДлина(ВыборкаДокумент.БанковскийСчет) - (СтрДлина(ВыборкаДокумент.БанковскийСчет) - 3), (СтрДлина(ВыборкаДокумент.БанковскийСчет) - 2));
		//КонецЕсли;
		МакетПечатнойФормы	= УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.AzRy_ПФ_MXL_InvoiceEng");//ПолучитьМакет("ПФ_MXL_Invoice");
		
		// Вывод шапки для документа 
		ОбластьШапки = ?(ВыборкаДокумент.Документ.Организация = Справочники.Организации.НайтиПоКоду("00-000004"),МакетПечатнойФормы.ПолучитьОбласть("Шапка_GEME"),МакетПечатнойФормы.ПолучитьОбласть("Шапка"));
		ОбластьШапки.Параметры.Заполнить(ВыборкаДокумент);
		// +++ } AzRy - [26.04.2024] - Jira: - Developer:გიორგი მამულაშვილი - Comment: 
		Попытка
			ОбластьШапки.Параметры.Дата	= Формат(ВыборкаДокумент.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлЛоготип) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлЛоготип);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьШапки.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		// Вывод таблицной части
		ВыборкаДанныхДокумента = ВыборкаДокумент.Выбрать();
		ОбластьСтрока = МакетПечатнойФормы.ПолучитьОбласть("ТабличаяЧасть");
		Пока ВыборкаДанныхДокумента.Следующий() Цикл 
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДанныхДокумента);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		// Вывод подвала для документа
		ОбластьПодвал = МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(ВыборкаДокумент);
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлФаксимильнаяПечать) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлФаксимильнаяПечать);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Факсимилия.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлПечати) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлПечати);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.Руководитель) Тогда
			Попытка
				ОбластьПодвал.Параметры.Руководитель = ВыборкаДокумент.Руководитель;
			Исключение
			КонецПопытки;
		КонецЕсли;		
		ТабличныйДокумент.Вывести(ОбластьПодвал);		
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокумент.Документ);   
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции
