
Функция ВидимостьКонтрагента() Экспорт
	
	Результат = 
	ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя 
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам//Паганини
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам//Malyshev 2024-05-24 ONESOFT-3063
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратКредитаКонтрагентом//Malyshev 2024-05-24 ONESOFT-3063
	
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Покупателю	
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Поставщику
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам //Malyshev 2024-05-24 ONESOFT-3063
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыдачаКредитаКонтрагенту //Malyshev 2024-05-24 ONESOFT-3063
	
	;
	
	Возврат Результат;	  
КонецФункции	

Функция ВидимостьВидаУдержания() Экспорт
	Результат = 
	(ЭтотОбъект.СсылкаИсточника = "РасходСоСчета" и
		(
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПенсионномуФонду 
		)                                        
	)	
	;
	Возврат Результат;	  
КонецФункции	                
	  
Функция ВидимостьСотрудника() Экспорт
	Результат = 
	(ЭтотОбъект.СсылкаИсточника = "РасходСоСчета" и
			(
			ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику
			)
	)
	ИЛИ
	(ЭтотОбъект.СсылкаИсточника = "ПоступлениеНаСчет" и 
		(
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником
		)
	)
	;
	Возврат Результат;
	
КонецФункции	

Функция ВидимостьДоговораКредитаЗайма() Экспорт
	Результат = 
	(ЭтотОбъект.СсылкаИсточника = "РасходСоСчета" и 
		(
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику
		ИЛИ 
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыдачаКредитаКонтрагенту
		ИЛИ 
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам //это ВозвратКредита
		)
	)
	ИЛИ 
	(ЭтотОбъект.СсылкаИсточника = "ПоступлениеНаСчет" и 
		(
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником
		ИЛИ
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам //это ПолучениеКредита		
		ИЛИ
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратКредитаКонтрагентом
		
		)
	)
	; 
	Возврат Результат;
КонецФункции	

Функция ВидимостьТипаСуммы() Экспорт
	Результат = 
	(ЭтотОбъект.СсылкаИсточника = "РасходСоСчета" и
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам //это ВозвратКредита 
	)	
	ИЛИ
	(ЭтотОбъект.СсылкаИсточника = "ПоступлениеНаСчет" и 
		(
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником
		ИЛИ
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратКредитаКонтрагентом
		)
	)
	;
	Возврат Результат;

КонецФункции	
//+++ Дмгг, 11.04.2025, ONESOFT-3973 
Функция ЭтоРасходдСосчетаПереводСПометкойПеремещения() Экспорт

	Результат = 
	(ЭтотОбъект.СсылкаИсточника = "РасходСоСчета" и
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет  
		И ЭтотОбъект.Перемещение)
	;
	Возврат Результат;	

КонецФункции // ЭтоРасходдСосчетаСпометкойПеремещения()
//--- Дмгг, 11.04.2025, ONESOFT-3973 



