Перем AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца;					  
					  
					  
&Вместо("СформироватьДвиженияПоРегиструУзлыКорректировкиСтоимостиСписания")
Функция AzRyFix_СформироватьДвиженияПоРегиструУзлыКорректировкиСтоимостиСписания(Отказ)
	
	Если Не Константы.AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца.Получить() Тогда		
		Результат = ПродолжитьВызов(Отказ);
		Возврат Результат;				
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНач", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ПустойСчет", ДополнительныеСвойства.ДляПроведения.ПустойСчет);
	Запрос.УстановитьПараметр("ПустойСчетРегл", ДополнительныеСвойства.ДляПроведения.ПустойСчетРегл); //+++ Дмгг
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	// Получим таблицу новых узлов, каждый узел определяется комбинацией всех
	// измерений учета. В колонку Сумма помещается средняя цена по соответствующему
	// ресурсу регистра УчетЗапасовИЗатрат по внешнему поступлению для каждого узла.
	// Эти колонки являются правыми частями в системе линейных уравнений. В колонки
	// Количество помещается общее количество поступления в каждый узел. Если по
	// данному узлу движений по количеству не было, а были только движения по
	// стоимости, значит вместо количества используется стоимость (узел
	// соответствует не материальным расходам). Если из узла было списание по
	// фиксированной стоимости то уменьшаем количество и стоимость поступления в
	// данный узел на количество и стоимость по фиксированной операции.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетЗатратДляРасчетов.Организация КАК Организация,
	|	УчетЗатратДляРасчетов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратДляРасчетов.СчетУчета КАК СчетУчета,
	|	УчетЗатратДляРасчетов.СчетУчетаРегл КАК СчетУчетаРегл,
	|	УчетЗатратДляРасчетов.Номенклатура КАК Номенклатура,
	|	УчетЗатратДляРасчетов.Характеристика КАК Характеристика,
	|	УчетЗатратДляРасчетов.Партия КАК Партия,
	|	УчетЗатратДляРасчетов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|			ТОГДА СУММА(ВложенныйЗапрос.СуммаДляКоличества)
	|		ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|				И СУММА(ВложенныйЗапрос.СуммаДляКоличества) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.Сумма) / ВЫБОР
	|					КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|						ТОГДА СУММА(ВложенныйЗапрос.СуммаДляКоличества)
	|					ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	|				КОНЕЦ КАК ЧИСЛО(23, 10))
	|	КОНЕЦ КАК Сумма,
	|	УчетЗатратДляРасчетов.СчетУчетаРегл
	|ПОМЕСТИТЬ ТаблицаУзлыКорректировкиСтоимостиСписания
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		УчетЗатрат.Организация КАК Организация,
	|		УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		УчетЗатрат.СчетУчета КАК СчетУчета,
	|		УчетЗатрат.Номенклатура КАК Номенклатура,
	|		УчетЗатрат.Характеристика КАК Характеристика,
	|		УчетЗатрат.Партия КАК Партия,
	|		УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|		УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл
	|	ИЗ
	|		РегистрНакопления.Запасы КАК УчетЗатрат
	|	ГДЕ
	|		УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|		И УчетЗатрат.Организация = &Организация
	|		И (УчетЗатрат.Количество <> 0
	|				ИЛИ УчетЗатрат.Сумма <> 0)) КАК УчетЗатратДляРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УчетЗатрат.Организация КАК Организация,
	|			УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			УчетЗатрат.СчетУчета КАК СчетУчета,
	|			УчетЗатрат.Номенклатура КАК Номенклатура,
	|			УчетЗатрат.Характеристика КАК Характеристика,
	|			УчетЗатрат.Партия КАК Партия,
	|			УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Количество
	|				ИНАЧЕ -УчетЗатрат.Количество
	|			КОНЕЦ КАК Количество,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Сумма
	|				ИНАЧЕ -УчетЗатрат.Сумма
	|			КОНЕЦ КАК СуммаДляКоличества,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И УчетЗатрат.ФиксированнаяСтоимость
	|					ТОГДА УчетЗатрат.Сумма
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И УчетЗатрат.ФиксированнаяСтоимость
	|					ТОГДА -УчетЗатрат.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК Сумма,
	|			УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл
	|		ИЗ
	|			РегистрНакопления.Запасы КАК УчетЗатрат
	|		ГДЕ
	|			УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|			И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И НЕ УчетЗатрат.Возврат
	|					ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И УчетЗатрат.Возврат)
	|			И УчетЗатрат.Организация = &Организация
	//++++ Дмгг
	|		
	|		СГРУППИРОВАТЬ ПО
	|			УчетЗатрат.Организация,
	|			УчетЗатрат.СтруктурнаяЕдиница,
	|			УчетЗатрат.СчетУчета,
	|			УчетЗатрат.Номенклатура,
	|			УчетЗатрат.Характеристика,
	|			УчетЗатрат.Партия,
	|			УчетЗатрат.ЗаказПокупателя,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Количество
	|				ИНАЧЕ -УчетЗатрат.Количество
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Сумма
	|				ИНАЧЕ -УчетЗатрат.Сумма
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И УчетЗатрат.ФиксированнаяСтоимость
	|					ТОГДА УчетЗатрат.Сумма
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И УчетЗатрат.ФиксированнаяСтоимость
	|					ТОГДА -УчетЗатрат.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ,
	|			УчетЗатрат.СчетУчетаРегл
	//--- Дмгг
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			УчетЗатрат.Организация,
	|			УчетЗатрат.СтруктурнаяЕдиница,
	|			УчетЗатрат.СчетУчета,
	|			УчетЗатрат.Номенклатура,
	|			УчетЗатрат.Характеристика,
	|			УчетЗатрат.Партия,
	|			УчетЗатрат.ЗаказПокупателя,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Количество
	|				ИНАЧЕ 0 - УчетЗатрат.Количество
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Сумма
	|				ИНАЧЕ 0 - УчетЗатрат.Сумма
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Сумма
	|				ИНАЧЕ 0 - УчетЗатрат.Сумма
	|			КОНЕЦ,
	|			УчетЗатрат.СчетУчетаРегл
	|		ИЗ
	|			РегистрНакопления.Запасы КАК УчетЗатрат
	|		ГДЕ
	|			УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|			И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ УчетЗатрат.Возврат
	|					ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И УчетЗатрат.Возврат)
	|			И УчетЗатрат.ФиксированнаяСтоимость
	|			И УчетЗатрат.Организация = &Организация
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			УчетЗатратОстатки.Организация,
	|			УчетЗатратОстатки.СтруктурнаяЕдиница,
	|			УчетЗатратОстатки.СчетУчета,
	|			УчетЗатратОстатки.Номенклатура,
	|			УчетЗатратОстатки.Характеристика,
	|			УчетЗатратОстатки.Партия,
	|			УчетЗатратОстатки.ЗаказПокупателя,
	|			УчетЗатратОстатки.КоличествоОстаток,
	|			УчетЗатратОстатки.СуммаОстаток,
	|			УчетЗатратОстатки.СуммаОстаток,
	|			УчетЗатратОстатки.СчетУчетаРегл
	|		ИЗ
	|			РегистрНакопления.Запасы.Остатки(&ДатаНач, Организация = &Организация) КАК УчетЗатратОстатки) КАК ВложенныйЗапрос
	|		ПО УчетЗатратДляРасчетов.Организация = ВложенныйЗапрос.Организация
	|			И УчетЗатратДляРасчетов.СтруктурнаяЕдиница = ВложенныйЗапрос.СтруктурнаяЕдиница
	//+++ Дмгг
	//|			И УчетЗатратДляРасчетов.СчетУчета = ВложенныйЗапрос.СчетУчета
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА УчетЗатратДляРасчетов.СчетУчетаРегл = ВложенныйЗапрос.СчетУчетаРегл
	|				ИНАЧЕ УчетЗатратДляРасчетов.СчетУчета = ВложенныйЗапрос.СчетУчета
	|			КОНЕЦ)
	//--- Дмгг
	|			И УчетЗатратДляРасчетов.Номенклатура = ВложенныйЗапрос.Номенклатура
	|			И УчетЗатратДляРасчетов.Характеристика = ВложенныйЗапрос.Характеристика
	|			И УчетЗатратДляРасчетов.Партия = ВложенныйЗапрос.Партия
	|			И УчетЗатратДляРасчетов.ЗаказПокупателя = ВложенныйЗапрос.ЗаказПокупателя
	|ГДЕ
	|	УчетЗатратДляРасчетов.Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.FIFO)
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатратДляРасчетов.Организация,
	|	УчетЗатратДляРасчетов.СтруктурнаяЕдиница,
	|	УчетЗатратДляРасчетов.СчетУчета,
	|	УчетЗатратДляРасчетов.Номенклатура,
	|	УчетЗатратДляРасчетов.Характеристика,
	|	УчетЗатратДляРасчетов.Партия,
	|	УчетЗатратДляРасчетов.ЗаказПокупателя,
	|	УчетЗатратДляРасчетов.СчетУчетаРегл";
	Запрос.Выполнить();
	
	// Формируем остатки на конец периода, которые будем закрывать по ФИФО.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетЗатратОстатки.Организация КАК Организация,
	|	УчетЗатратОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратОстатки.СчетУчета КАК СчетУчета,
	|	УчетЗатратОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	|	УчетЗатратОстатки.Номенклатура КАК Номенклатура,
	|	УчетЗатратОстатки.Характеристика КАК Характеристика,
	|	УчетЗатратОстатки.Партия КАК Партия,
	|	УчетЗатратОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА УчетЗатратОстатки.КоличествоОстаток > 0
	|			ТОГДА УчетЗатратОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА УчетЗатратОстатки.КоличествоОстаток > 0
	|			ТОГДА УчетЗатратОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОстатокНаКонецПериода,
	|	ДОБАВИТЬКДАТЕ(&ДатаКон, СЕКУНДА, 1) КАК Период,
	|	0 КАК СуммаОстаток
	|ПОМЕСТИТЬ ТаблицаОстатковПартий
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			&ДатаКон,
	|			Организация = &Организация
	|				И Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.FIFO)) КАК УчетЗатратОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Поле1
	|ПОМЕСТИТЬ ПериодыПартий";
	Запрос.Выполнить();
	
	Запрос.Текст =      
	"УНИЧТОЖИТЬ ПериодыПартий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,
	|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(УчетЗатрат.Период, ДЕНЬ)) КАК Период
	|ПОМЕСТИТЬ ПериодыПартий
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗатрат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковПартий КАК ТаблицаОстатковПартий
	|		ПО (ТаблицаОстатковПартий.Организация = УчетЗатрат.Организация)
	|			И (ТаблицаОстатковПартий.СтруктурнаяЕдиница = УчетЗатрат.СтруктурнаяЕдиница)
	//+++ Дмгг
	//|			И (ТаблицаОстатковПартий.СчетУчета = УчетЗатрат.СчетУчета)
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА ТаблицаОстатковПартий.СчетУчетаРегл = УчетЗатрат.СчетУчетаРегл
	|				ИНАЧЕ ТаблицаОстатковПартий.СчетУчета = УчетЗатрат.СчетУчета
	|			КОНЕЦ)
	//--- Дмгг
	|			И (ТаблицаОстатковПартий.Номенклатура = УчетЗатрат.Номенклатура)
	|			И (ТаблицаОстатковПартий.Характеристика = УчетЗатрат.Характеристика)
	|			И (ТаблицаОстатковПартий.Партия = УчетЗатрат.Партия)
	|			И (ТаблицаОстатковПартий.ЗаказПокупателя = УчетЗатрат.ЗаказПокупателя)
	|			И (ТаблицаОстатковПартий.КоличествоОстаток <> 0)
	|ГДЕ
	|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	//+++ Дмгг
	//|	И УчетЗатрат.КоррСчетУчета = &ПустойСчет
	|	И ВЫБОР 
	|		КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|			ТОГДА УчетЗатрат.КоррСчетУчетаРегл = &ПустойСчетРегл
	|		ИНАЧЕ УчетЗатрат.КоррСчетУчета = &ПустойСчет
	|	КОНЕЦ
	//--- Дмгг
	|	И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НЕ УчетЗатрат.Возврат
	|			ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И УчетЗатрат.Возврат)
	|	И УчетЗатрат.Период < ТаблицаОстатковПартий.Период
	|	И УчетЗатрат.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатрат.Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета,
	|	УчетЗатрат.СчетУчетаРегл,
	|	УчетЗатрат.Номенклатура,
	|	УчетЗатрат.Характеристика,
	|	УчетЗатрат.Партия,
	|	УчетЗатрат.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыПартий.Организация КАК Организация,
	|	ПериодыПартий.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПериодыПартий.СчетУчета КАК СчетУчета,
	|	ПериодыПартий.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ПериодыПартий.Номенклатура КАК Номенклатура,
	|	ПериодыПартий.Характеристика КАК Характеристика,
	|	ПериодыПартий.Партия КАК Партия,
	|	ПериодыПартий.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА УчетЗатрат.Количество
	|			ИНАЧЕ -УчетЗатрат.Количество
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА УчетЗатрат.Сумма
	|			ИНАЧЕ -УчетЗатрат.Сумма
	|		КОНЕЦ) КАК Сумма,
	|	ПериодыПартий.Период
	|ПОМЕСТИТЬ ВнешниеПоступленияЗаПериод
	|ИЗ
	|	ПериодыПартий КАК ПериодыПартий
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК УчетЗатрат
	|		ПО ПериодыПартий.Организация = УчетЗатрат.Организация
	|			И ПериодыПартий.СтруктурнаяЕдиница = УчетЗатрат.СтруктурнаяЕдиница
	//+++ Дмгг
	//|			И ПериодыПартий.СчетУчета = УчетЗатрат.СчетУчета
	|			И ВЫБОР 
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА ПериодыПартий.СчетУчетаРегл = УчетЗатрат.СчетУчетаРегл
	|				ИНАЧЕ ПериодыПартий.СчетУчета = УчетЗатрат.СчетУчета
	|			КОНЕЦ
	//--- Дмгг
	|			И ПериодыПартий.Номенклатура = УчетЗатрат.Номенклатура
	|			И ПериодыПартий.Характеристика = УчетЗатрат.Характеристика
	|			И ПериодыПартий.Партия = УчетЗатрат.Партия
	|			И ПериодыПартий.ЗаказПокупателя = УчетЗатрат.ЗаказПокупателя
	|			И (УчетЗатрат.Период МЕЖДУ ПериодыПартий.Период И КОНЕЦПЕРИОДА(ПериодыПартий.Период, ДЕНЬ))
	//--- Дмгг
	//|			И (УчетЗатрат.КоррСчетУчета = &ПустойСчет)
	|			И (ВЫБОР 
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА УчетЗатрат.КоррСчетУчетаРегл = &ПустойСчетРегл
	|				ИНАЧЕ УчетЗатрат.КоррСчетУчета = &ПустойСчет
	|			КОНЕЦ)
	//--- Дмгг
	|			И (УчетЗатрат.ФиксированнаяСтоимость)
	|			И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					И НЕ УчетЗатрат.Возврат
	|				ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					И УчетЗатрат.Возврат)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыПартий.Организация,
	|	ПериодыПартий.СтруктурнаяЕдиница,
	|	ПериодыПартий.СчетУчета,
	|	ПериодыПартий.СчетУчетаРегл,
	|	ПериодыПартий.Номенклатура,
	|	ПериодыПартий.Характеристика,
	|	ПериодыПартий.Партия,
	|	ПериодыПартий.ЗаказПокупателя,
	|	ПериодыПартий.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОстатковПартий.Организация КАК Организация,
	|	ТаблицаОстатковПартий.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаОстатковПартий.СчетУчета КАК СчетУчета,
	|	ТаблицаОстатковПартий.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаОстатковПартий.Номенклатура КАК Номенклатура,
	|	ТаблицаОстатковПартий.Характеристика КАК Характеристика,
	|	ТаблицаОстатковПартий.Партия КАК Партия,
	|	ТаблицаОстатковПартий.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаОстатковПартий.КоличествоОстаток > ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Количество, 0)
	|			ТОГДА ТаблицаОстатковПартий.КоличествоОстаток - ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Количество, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА ТаблицаОстатковПартий.КоличествоОстаток >= ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Количество, 0)
	|			ТОГДА ТаблицаОстатковПартий.СуммаОстаток + ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Сумма, 0)
	|		ИНАЧЕ ТаблицаОстатковПартий.СуммаОстаток + (ВЫРАЗИТЬ(ВнешниеПоступленияЗаПериод.Сумма * ТаблицаОстатковПартий.КоличествоОстаток / ВнешниеПоступленияЗаПериод.Количество КАК ЧИСЛО(23, 10)))
	|	КОНЕЦ КАК СуммаОстаток,
	|	ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода,
	|	ВнешниеПоступленияЗаПериод.Период
	|ПОМЕСТИТЬ ТаблицаТекущихОстатковПартий
	|ИЗ
	|	ТаблицаОстатковПартий КАК ТаблицаОстатковПартий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВнешниеПоступленияЗаПериод КАК ВнешниеПоступленияЗаПериод
	|		ПО ТаблицаОстатковПартий.Организация = ВнешниеПоступленияЗаПериод.Организация
	|			И ТаблицаОстатковПартий.СтруктурнаяЕдиница = ВнешниеПоступленияЗаПериод.СтруктурнаяЕдиница
	//+++ Дмгг
	//|			И ТаблицаОстатковПартий.СчетУчета = ВнешниеПоступленияЗаПериод.СчетУчета
	|			И ВЫБОР 
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА ТаблицаОстатковПартий.СчетУчетаРегл = ВнешниеПоступленияЗаПериод.СчетУчетаРегл
	|				ИНАЧЕ ТаблицаОстатковПартий.СчетУчета = ВнешниеПоступленияЗаПериод.СчетУчета
	|			КОНЕЦ
	//--- Дмгг
	|			И ТаблицаОстатковПартий.Номенклатура = ВнешниеПоступленияЗаПериод.Номенклатура
	|			И ТаблицаОстатковПартий.Характеристика = ВнешниеПоступленияЗаПериод.Характеристика
	|			И ТаблицаОстатковПартий.Партия = ВнешниеПоступленияЗаПериод.Партия
	|			И ТаблицаОстатковПартий.ЗаказПокупателя = ВнешниеПоступленияЗаПериод.ЗаказПокупателя
	|			И (ТаблицаОстатковПартий.КоличествоОстаток <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаОстатковПартий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВнешниеПоступленияЗаПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТекущихОстатковПартий.Организация КАК Организация,
	|	ТаблицаТекущихОстатковПартий.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаТекущихОстатковПартий.СчетУчета КАК СчетУчета,
	|	ТаблицаТекущихОстатковПартий.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаТекущихОстатковПартий.Номенклатура КАК Номенклатура,
	|	ТаблицаТекущихОстатковПартий.Характеристика КАК Характеристика,
	|	ТаблицаТекущихОстатковПартий.Партия КАК Партия,
	|	ТаблицаТекущихОстатковПартий.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаТекущихОстатковПартий.КоличествоОстаток КАК КоличествоОстаток,
	|	ТаблицаТекущихОстатковПартий.КоличествоОстатокНаКонецПериода КАК КоличествоОстатокНаКонецПериода,
	|	ТаблицаТекущихОстатковПартий.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаТекущихОстатковПартий.Период КАК Период
	|ПОМЕСТИТЬ ТаблицаОстатковПартий
	|ИЗ
	|	ТаблицаТекущихОстатковПартий КАК ТаблицаТекущихОстатковПартий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаТекущихОстатковПартий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	ПериодыПартий КАК ПериодыПартий";
	
	// Выполняем поиск партий.
	КоличествоИтераций = 0;
	Результат = Запрос.Выполнить();
	Пока НЕ Результат.Пустой() Цикл
		КоличествоИтераций = КоличествоИтераций + 1;
		Результат = Запрос.Выполнить();
	КонецЦикла;
	
	// Уменьшаем количество и сумму прихода в узлах, на количество и сумму
	// "зафиксированного" конечного остатка.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.Организация КАК Организация,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.СчетУчета КАК СчетУчета,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.Номенклатура КАК Номенклатура,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.Характеристика КАК Характеристика,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.Партия КАК Партия,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) + ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) + ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировкиСтоимостиСписания.Сумма * ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.СуммаОстаток, 0)) / (ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) + ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0))
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	ТаблицаУзлыКорректировкиСтоимостиСписания КАК ТаблицаУзлыКорректировкиСтоимостиСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатковПартий КАК ТаблицаОстатковПартий
	|		ПО ТаблицаУзлыКорректировкиСтоимостиСписания.Организация = ТаблицаОстатковПартий.Организация
	|			И ТаблицаУзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница = ТаблицаОстатковПартий.СтруктурнаяЕдиница
	//+++ ДМгг
	//|			И ТаблицаУзлыКорректировкиСтоимостиСписания.СчетУчета = ТаблицаОстатковПартий.СчетУчета
	|			И ВЫБОР 
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА ТаблицаУзлыКорректировкиСтоимостиСписания.СчетУчетаРегл = ТаблицаОстатковПартий.СчетУчетаРегл
	|				ИНАЧЕ ТаблицаУзлыКорректировкиСтоимостиСписания.СчетУчета = ТаблицаОстатковПартий.СчетУчета
	|			КОНЕЦ
	//--- Дмгг
	|			И ТаблицаУзлыКорректировкиСтоимостиСписания.Номенклатура = ТаблицаОстатковПартий.Номенклатура
	|			И ТаблицаУзлыКорректировкиСтоимостиСписания.Характеристика = ТаблицаОстатковПартий.Характеристика
	|			И ТаблицаУзлыКорректировкиСтоимостиСписания.Партия = ТаблицаОстатковПартий.Партия
	|			И ТаблицаУзлыКорректировкиСтоимостиСписания.ЗаказПокупателя = ТаблицаОстатковПартий.ЗаказПокупателя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетЗатратДляРасчетов.Организация,
	|	УчетЗатратДляРасчетов.СтруктурнаяЕдиница,
	|	УчетЗатратДляРасчетов.СчетУчета,
	|	УчетЗатратДляРасчетов.СчетУчетаРегл,
	|	УчетЗатратДляРасчетов.Номенклатура,
	|	УчетЗатратДляРасчетов.Характеристика,
	|	УчетЗатратДляРасчетов.Партия,
	|	УчетЗатратДляРасчетов.ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|			ТОГДА СУММА(ВложенныйЗапрос.СуммаДляКоличества)
	|		ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|				И СУММА(ВложенныйЗапрос.СуммаДляКоличества) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.Сумма) / ВЫБОР
	|					КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|						ТОГДА СУММА(ВложенныйЗапрос.СуммаДляКоличества)
	|					ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	|				КОНЕЦ КАК ЧИСЛО(23, 10))
	|	КОНЕЦ
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		УчетЗатрат.Организация КАК Организация,
	|		УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		УчетЗатрат.СчетУчета КАК СчетУчета,
	|		УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
	|		УчетЗатрат.Номенклатура КАК Номенклатура,
	|		УчетЗатрат.Характеристика КАК Характеристика,
	|		УчетЗатрат.Партия КАК Партия,
	|		УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя
	|	ИЗ
	|		РегистрНакопления.Запасы КАК УчетЗатрат
	|	ГДЕ
	|		УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|		И УчетЗатрат.Организация = &Организация
	|		И (УчетЗатрат.Количество <> 0
	|				ИЛИ УчетЗатрат.Сумма <> 0)) КАК УчетЗатратДляРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УчетЗатрат.Организация КАК Организация,
	|			УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			УчетЗатрат.СчетУчета КАК СчетУчета,
	|			УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
	|			УчетЗатрат.Номенклатура КАК Номенклатура,
	|			УчетЗатрат.Характеристика КАК Характеристика,
	|			УчетЗатрат.Партия КАК Партия,
	|			УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	//|			УчетЗатрат.Резервирование КАК Резервирование, //+++ Дмгг
	//+++ Дмгг
	//|			ВЫБОР
	//|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|					ТОГДА УчетЗатрат.Количество
	//|				ИНАЧЕ -УчетЗатрат.Количество
	//|			КОНЕЦ КАК Количество,
	//|			ВЫБОР
	//|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|					ТОГДА УчетЗатрат.Сумма
	//|				ИНАЧЕ -УчетЗатрат.Сумма
	//|			КОНЕЦ КАК СуммаДляКоличества,
	//|			ВЫБОР
	//|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|						И УчетЗатрат.ФиксированнаяСтоимость
	//|					ТОГДА УчетЗатрат.Сумма
	//|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|						И УчетЗатрат.ФиксированнаяСтоимость
	//|					ТОГДА -УчетЗатрат.Сумма
	//|				ИНАЧЕ 0
	//|			КОНЕЦ КАК Сумма
	|			СУММА(ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Количество
	|				ИНАЧЕ -УчетЗатрат.Количество
	|			КОНЕЦ) КАК Количество,
	|			СУММА(ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Сумма
	|				ИНАЧЕ -УчетЗатрат.Сумма
	|			КОНЕЦ) КАК СуммаДляКоличества,
	|			СУММА(ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И УчетЗатрат.ФиксированнаяСтоимость
	|					ТОГДА УчетЗатрат.Сумма
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И УчетЗатрат.ФиксированнаяСтоимость
	|					ТОГДА -УчетЗатрат.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Сумма
	//--- Дмгг
	|		ИЗ
	|			РегистрНакопления.Запасы КАК УчетЗатрат
	|		ГДЕ
	|			УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|			И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И НЕ УчетЗатрат.Возврат
	|					ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И УчетЗатрат.Возврат)
	|			И УчетЗатрат.Организация = &Организация
	//+++ Дмгг
	|		
	|		СГРУППИРОВАТЬ ПО
	|			УчетЗатрат.Резервирование,
	|			УчетЗатрат.Организация,
	|			УчетЗатрат.СтруктурнаяЕдиница,
	|			УчетЗатрат.СчетУчета,
	|			УчетЗатрат.СчетУчетаРегл,
	|			УчетЗатрат.Номенклатура,
	|			УчетЗатрат.Характеристика,
	|			УчетЗатрат.Партия,
	|			УчетЗатрат.ЗаказПокупателя
	//--- Дмгг		
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			УчетЗатрат.Организация,
	|			УчетЗатрат.СтруктурнаяЕдиница,
	|			УчетЗатрат.СчетУчета,
	|			УчетЗатрат.СчетУчетаРегл,
	|			УчетЗатрат.Номенклатура,
	|			УчетЗатрат.Характеристика,
	|			УчетЗатрат.Партия,
	|			УчетЗатрат.ЗаказПокупателя,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Количество
	|				ИНАЧЕ 0 - УчетЗатрат.Количество
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Сумма
	|				ИНАЧЕ 0 - УчетЗатрат.Сумма
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Сумма
	|				ИНАЧЕ 0 - УчетЗатрат.Сумма
	|			КОНЕЦ
	|		ИЗ
	|			РегистрНакопления.Запасы КАК УчетЗатрат
	|		ГДЕ
	|			УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|			И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ УчетЗатрат.Возврат
	|					ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И УчетЗатрат.Возврат)
	|			И УчетЗатрат.ФиксированнаяСтоимость
	|			И УчетЗатрат.Организация = &Организация
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			УчетЗатратОстатки.Организация,
	|			УчетЗатратОстатки.СтруктурнаяЕдиница,
	|			УчетЗатратОстатки.СчетУчета,
	|			УчетЗатратОстатки.СчетУчетаРегл,
	|			УчетЗатратОстатки.Номенклатура,
	|			УчетЗатратОстатки.Характеристика,
	|			УчетЗатратОстатки.Партия,
	|			УчетЗатратОстатки.ЗаказПокупателя,
	|			УчетЗатратОстатки.КоличествоОстаток,
	|			УчетЗатратОстатки.СуммаОстаток,
	|			УчетЗатратОстатки.СуммаОстаток
	|		ИЗ
	|			РегистрНакопления.Запасы.Остатки(&ДатаНач, Организация = &Организация) КАК УчетЗатратОстатки) КАК ВложенныйЗапрос
	|		ПО УчетЗатратДляРасчетов.Организация = ВложенныйЗапрос.Организация
	|			И УчетЗатратДляРасчетов.СтруктурнаяЕдиница = ВложенныйЗапрос.СтруктурнаяЕдиница
	//+++ Дмгг
	//|			И УчетЗатратДляРасчетов.СчетУчета = ВложенныйЗапрос.СчетУчета
	|			И ВЫБОР 
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА УчетЗатратДляРасчетов.СчетУчетаРегл = ВложенныйЗапрос.СчетУчетаРегл
	|				ИНАЧЕ УчетЗатратДляРасчетов.СчетУчета = ВложенныйЗапрос.СчетУчета
	|			КОНЕЦ
	//--- Дмгг
	|			И УчетЗатратДляРасчетов.Номенклатура = ВложенныйЗапрос.Номенклатура
	|			И УчетЗатратДляРасчетов.Характеристика = ВложенныйЗапрос.Характеристика
	|			И УчетЗатратДляРасчетов.Партия = ВложенныйЗапрос.Партия
	|			И УчетЗатратДляРасчетов.ЗаказПокупателя = ВложенныйЗапрос.ЗаказПокупателя
	|ГДЕ
	|	(УчетЗатратДляРасчетов.Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.ПоСредней)
	|			ИЛИ УчетЗатратДляРасчетов.Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.ПустаяСсылка)
	|			ИЛИ УчетЗатратДляРасчетов.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатратДляРасчетов.Организация,
	|	УчетЗатратДляРасчетов.СтруктурнаяЕдиница,
	|	УчетЗатратДляРасчетов.СчетУчета,
	|	УчетЗатратДляРасчетов.СчетУчетаРегл,
	|	УчетЗатратДляРасчетов.Номенклатура,
	|	УчетЗатратДляРасчетов.Характеристика,
	|	УчетЗатратДляРасчетов.Партия,
	|	УчетЗатратДляРасчетов.ЗаказПокупателя";
	
	НомерУзла = 0;
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		НаборЗаписей = РегистрыСведений.УзлыКорректировкиСтоимостиСписания.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать(Истина);
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НомерУзла = НомерУзла + 1;
			НовыйУзел = НаборЗаписей.Добавить();
			НовыйУзел.НомерУзла = НомерУзла;
			НовыйУзел.Регистратор = Ссылка;
			НовыйУзел.Период = Дата;
			ЗаполнитьЗначенияСвойств(НовыйУзел, Выборка);
		КонецЦикла;
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;
	
	// Первое приближение (решение на первой итерации).
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла,
	|	УзлыКорректировкиСтоимостиСписания.Сумма
	|ПОМЕСТИТЬ ТаблицаРешений
	|ИЗ
	|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|ГДЕ
	|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|";
	Запрос.Выполнить();
	
	Возврат НомерУзла;
		
КонецФункции

&Вместо("РешитьСЛУ")
Функция AzRyFix_РешитьСЛУ()
	
	Если Не AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца Тогда		
		Результат = ПродолжитьВызов();
		Возврат Результат;				
	КонецЕсли;
	
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНач", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ПустойСчет", ДополнительныеСвойства.ДляПроведения.ПустойСчет);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	ТекущееОтклонение = 1;
	ТребуемаяТочность = 0.00001;
	КоличествоИтераций = 0;
	
	// Подготовим таблицу перемещений и списаний за отчетный период. Возвраты
	// текущего периода отрабатываются как обычные перемещения.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетЗапасовИЗатрат.Организация КАК Организация,
	|	УчетЗапасовИЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗапасовИЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
	|	УчетЗапасовИЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗапасовИЗатрат.Характеристика КАК Характеристика,
	|	УчетЗапасовИЗатрат.Партия КАК Партия,
	|	УчетЗапасовИЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗапасовИЗатрат.ЗаказПродажи КАК ЗаказПродажи,
	|	УчетЗапасовИЗатрат.ДокументПродажи КАК ДокументПродажи,
	|	-СУММА(УчетЗапасовИЗатрат.Количество) КАК Количество,
	|	-СУММА(УчетЗапасовИЗатрат.Сумма) КАК Сумма
	|ПОМЕСТИТЬ УчетЗатратВозвратыТекПериода
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗапасовИЗатрат
	|ГДЕ
	|	УчетЗапасовИЗатрат.Организация = &Организация
	|	И УчетЗапасовИЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И УчетЗапасовИЗатрат.Возврат
	|	И НЕ УчетЗапасовИЗатрат.ФиксированнаяСтоимость
	|	И УчетЗапасовИЗатрат.ДокументПродажи <> НЕОПРЕДЕЛЕНО
	|	И КОНЕЦПЕРИОДА(УчетЗапасовИЗатрат.ДокументПродажи.Дата, МЕСЯЦ) = КОНЕЦПЕРИОДА(УчетЗапасовИЗатрат.Период, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗапасовИЗатрат.Организация,
	|	УчетЗапасовИЗатрат.СтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.СчетУчета,
	|	УчетЗапасовИЗатрат.СчетУчетаРегл,
	|	УчетЗапасовИЗатрат.Номенклатура,
	|	УчетЗапасовИЗатрат.Характеристика,
	|	УчетЗапасовИЗатрат.Партия,
	|	УчетЗапасовИЗатрат.ЗаказПокупателя,
	|	УчетЗапасовИЗатрат.ЗаказПродажи,
	|	УчетЗапасовИЗатрат.ДокументПродажи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПродажи,
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	СчетУчетаРегл, //+++ Дмгг
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	ЗаказПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатратВозвратыТекПериода.Организация КАК Организация,
	|	УчетЗатратВозвратыТекПериода.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратВозвратыТекПериода.СчетУчета КАК СчетУчета,
	|	УчетЗатратВозвратыТекПериода.Номенклатура КАК Номенклатура,
	|	УчетЗатратВозвратыТекПериода.Характеристика КАК Характеристика,
	|	УчетЗатратВозвратыТекПериода.Партия КАК Партия,
	|	УчетЗатратВозвратыТекПериода.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	СУММА(ЕСТЬNULL(УчетЗапасовИЗатрат.Количество, 0)) КАК КоличествоПродано,
	|	СУММА(ЕСТЬNULL(УчетЗапасовИЗатрат.Сумма, 0)) КАК СуммаПродано,
	|	УчетЗатратВозвратыТекПериода.Количество КАК КоличествоВозврат,
	|	УчетЗатратВозвратыТекПериода.Сумма КАК СуммаВозврат,
	|	УчетЗатратВозвратыТекПериода.ДокументПродажи КАК ДокументПродажи,
	|	УчетЗатратВозвратыТекПериода.СчетУчетаРегл
	|ПОМЕСТИТЬ УчетЗатратВозвратыПоРезервам
	|ИЗ
	|	УчетЗатратВозвратыТекПериода КАК УчетЗатратВозвратыТекПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК УчетЗапасовИЗатрат
	|		ПО УчетЗатратВозвратыТекПериода.ДокументПродажи = УчетЗапасовИЗатрат.ДокументПродажи
	|			И УчетЗатратВозвратыТекПериода.Организация = УчетЗапасовИЗатрат.Организация
	|			И УчетЗатратВозвратыТекПериода.Номенклатура = УчетЗапасовИЗатрат.Номенклатура
	|			И УчетЗатратВозвратыТекПериода.Характеристика = УчетЗапасовИЗатрат.Характеристика
	|			И УчетЗатратВозвратыТекПериода.Партия = УчетЗапасовИЗатрат.Партия
	|			И УчетЗатратВозвратыТекПериода.ЗаказПродажи = УчетЗапасовИЗатрат.ЗаказПродажи
	|			И УчетЗатратВозвратыТекПериода.ЗаказПродажи = УчетЗапасовИЗатрат.ЗаказПокупателя
	|			И (УчетЗапасовИЗатрат.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
	|			И (НЕ УчетЗапасовИЗатрат.Возврат)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|		ПО (УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор)
	|			И (УчетЗапасовИЗатрат.Организация = УзлыКорректировкиСтоимостиСписания.Организация)
	|			И (УчетЗапасовИЗатрат.СтруктурнаяЕдиница = УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница)
	//+++ Дмгг
	//|			И (УчетЗапасовИЗатрат.СчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета)
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА УчетЗапасовИЗатрат.СчетУчетаРегл = УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл
	|				ИНАЧЕ УчетЗапасовИЗатрат.СчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета
	|			КОНЕЦ)
	//--- Дмгг
	|			И (УчетЗапасовИЗатрат.Номенклатура = УзлыКорректировкиСтоимостиСписания.Номенклатура)
	|			И (УчетЗапасовИЗатрат.Характеристика = УзлыКорректировкиСтоимостиСписания.Характеристика)
	|			И (УчетЗапасовИЗатрат.Партия = УзлыКорректировкиСтоимостиСписания.Партия)
	|			И (УчетЗапасовИЗатрат.ЗаказПокупателя = УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя)
	|			И (УчетЗапасовИЗатрат.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
	|ГДЕ
	|	УчетЗапасовИЗатрат.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатратВозвратыТекПериода.Организация,
	|	УчетЗатратВозвратыТекПериода.СтруктурнаяЕдиница,
	|	УчетЗатратВозвратыТекПериода.СчетУчета,
	|	УчетЗатратВозвратыТекПериода.Номенклатура,
	|	УчетЗатратВозвратыТекПериода.Характеристика,
	|	УчетЗатратВозвратыТекПериода.Партия,
	|	УчетЗатратВозвратыТекПериода.ЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла,
	|	УчетЗатратВозвратыТекПериода.Количество,
	|	УчетЗатратВозвратыТекПериода.Сумма,
	|	УчетЗатратВозвратыТекПериода.ДокументПродажи,
	|	УчетЗатратВозвратыТекПериода.СчетУчетаРегл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатратВозвратыТекПериода.Организация КАК Организация,
	|	УчетЗатратВозвратыТекПериода.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратВозвратыТекПериода.СчетУчета КАК СчетУчета,
	|	УчетЗатратВозвратыТекПериода.Номенклатура КАК Номенклатура,
	|	УчетЗатратВозвратыТекПериода.Характеристика КАК Характеристика,
	|	УчетЗатратВозвратыТекПериода.Партия КАК Партия,
	|	УчетЗатратВозвратыТекПериода.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	СУММА(ЕСТЬNULL(УчетЗапасовИЗатрат.Количество, 0)) КАК КоличествоПродано,
	|	СУММА(ЕСТЬNULL(УчетЗапасовИЗатрат.Сумма, 0)) КАК СуммаПродано,
	|	УчетЗатратВозвратыТекПериода.Количество КАК КоличествоВозврат,
	|	УчетЗатратВозвратыТекПериода.Сумма КАК СуммаВозврат,
	|	УчетЗатратВозвратыТекПериода.ДокументПродажи КАК ДокументПродажи,
	|	УчетЗатратВозвратыТекПериода.СчетУчетаРегл
	|ПОМЕСТИТЬ УчетЗатратВозвратыСвободные
	|ИЗ
	|	УчетЗатратВозвратыТекПериода КАК УчетЗатратВозвратыТекПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК УчетЗапасовИЗатрат
	|		ПО УчетЗатратВозвратыТекПериода.ДокументПродажи = УчетЗапасовИЗатрат.ДокументПродажи
	|			И УчетЗатратВозвратыТекПериода.Организация = УчетЗапасовИЗатрат.Организация
	|			И УчетЗатратВозвратыТекПериода.Номенклатура = УчетЗапасовИЗатрат.Номенклатура
	|			И УчетЗатратВозвратыТекПериода.Характеристика = УчетЗапасовИЗатрат.Характеристика
	|			И УчетЗатратВозвратыТекПериода.Партия = УчетЗапасовИЗатрат.Партия
	|			И УчетЗатратВозвратыТекПериода.ЗаказПродажи = УчетЗапасовИЗатрат.ЗаказПродажи
	|			И (УчетЗапасовИЗатрат.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
	|			И (НЕ УчетЗапасовИЗатрат.Возврат)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|		ПО (УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор)
	|			И (УчетЗапасовИЗатрат.Организация = УзлыКорректировкиСтоимостиСписания.Организация)
	|			И (УчетЗапасовИЗатрат.СтруктурнаяЕдиница = УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница)
	//+++ Дмгг
	//|			И (УчетЗапасовИЗатрат.СчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета)
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА УчетЗапасовИЗатрат.СчетУчетаРегл = УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл
	|				ИНАЧЕ УчетЗапасовИЗатрат.СчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета
	|			КОНЕЦ)
	//--- Дмгг
	|			И (УчетЗапасовИЗатрат.Номенклатура = УзлыКорректировкиСтоимостиСписания.Номенклатура)
	|			И (УчетЗапасовИЗатрат.Характеристика = УзлыКорректировкиСтоимостиСписания.Характеристика)
	|			И (УчетЗапасовИЗатрат.Партия = УзлыКорректировкиСтоимостиСписания.Партия)
	|			И (УчетЗапасовИЗатрат.ЗаказПокупателя = УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя)
	|			И (УчетЗапасовИЗатрат.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
	|ГДЕ
	|	УчетЗапасовИЗатрат.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатратВозвратыТекПериода.Организация,
	|	УчетЗатратВозвратыТекПериода.СтруктурнаяЕдиница,
	|	УчетЗатратВозвратыТекПериода.СчетУчета,
	|	УчетЗатратВозвратыТекПериода.Номенклатура,
	|	УчетЗатратВозвратыТекПериода.Характеристика,
	|	УчетЗатратВозвратыТекПериода.Партия,
	|	УчетЗатратВозвратыТекПериода.ЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла,
	|	УчетЗатратВозвратыТекПериода.Количество,
	|	УчетЗатратВозвратыТекПериода.Сумма,
	|	УчетЗатратВозвратыТекПериода.ДокументПродажи,
	|	УчетЗатратВозвратыТекПериода.СчетУчетаРегл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатратВозвраты.Организация КАК Организация,
	|	УчетЗатратВозвраты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратВозвраты.СчетУчета КАК СчетУчета,
	|	УчетЗатратВозвраты.Номенклатура КАК Номенклатура,
	|	УчетЗатратВозвраты.Характеристика КАК Характеристика,
	|	УчетЗатратВозвраты.Партия КАК Партия,
	|	УчетЗатратВозвраты.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатратВозвраты.НомерУзла КАК НомерУзла,
	|	УчетЗатратВозвраты.КоличествоПродано КАК КоличествоПродано,
	|	УчетЗатратВозвраты.СуммаПродано КАК СуммаПродано,
	|	УчетЗатратВозвраты.КоличествоВозврат КАК КоличествоВозврат,
	|	УчетЗатратВозвраты.СуммаВозврат КАК СуммаВозврат,
	|	0 КАК КоличествоРаспределено,
	|	0 КАК СуммаРаспределено,
	|	УчетЗатратВозвраты.ДокументПродажи КАК ДокументПродажи,
	|	УчетЗатратВозвраты.СчетУчетаРегл
	|ИЗ
	|	(ВЫБРАТЬ
	|		УчетЗатратВозвраты.Организация КАК Организация,
	|		УчетЗатратВозвраты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		УчетЗатратВозвраты.СчетУчета КАК СчетУчета,
	|		УчетЗатратВозвраты.Номенклатура КАК Номенклатура,
	|		УчетЗатратВозвраты.Характеристика КАК Характеристика,
	|		УчетЗатратВозвраты.Партия КАК Партия,
	|		УчетЗатратВозвраты.ЗаказПокупателя КАК ЗаказПокупателя,
	|		УчетЗатратВозвраты.НомерУзла КАК НомерУзла,
	|		УчетЗатратВозвраты.КоличествоПродано КАК КоличествоПродано,
	|		УчетЗатратВозвраты.СуммаПродано КАК СуммаПродано,
	|		УчетЗатратВозвраты.КоличествоВозврат КАК КоличествоВозврат,
	|		УчетЗатратВозвраты.СуммаВозврат КАК СуммаВозврат,
	|		УчетЗатратВозвраты.ДокументПродажи КАК ДокументПродажи,
	|		УчетЗатратВозвраты.СчетУчетаРегл КАК СчетУчетаРегл
	|	ИЗ
	|		УчетЗатратВозвратыСвободные КАК УчетЗатратВозвраты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УчетЗатратВозвраты.Организация,
	|		УчетЗатратВозвраты.СтруктурнаяЕдиница,
	|		УчетЗатратВозвраты.СчетУчета,
	|		УчетЗатратВозвраты.Номенклатура,
	|		УчетЗатратВозвраты.Характеристика,
	|		УчетЗатратВозвраты.Партия,
	|		УчетЗатратВозвраты.ЗаказПокупателя,
	|		УчетЗатратВозвраты.НомерУзла,
	|		УчетЗатратВозвраты.КоличествоПродано,
	|		УчетЗатратВозвраты.СуммаПродано,
	|		УчетЗатратВозвраты.КоличествоВозврат,
	|		УчетЗатратВозвраты.СуммаВозврат,
	|		УчетЗатратВозвраты.ДокументПродажи,
	|		УчетЗатратВозвраты.СчетУчетаРегл
	|	ИЗ
	|		УчетЗатратВозвратыПоРезервам КАК УчетЗатратВозвраты) КАК УчетЗатратВозвраты
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерУзла
	|ИТОГИ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ДокументПродажи,
	|	СуммаВозврат,
	|	КоличествоВозврат";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаВозвратов = РезультатЗапроса[3].Выгрузить();
	ТаблицаВозвратов.Очистить();
	
	ОбходПоОрганизация = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ОбходПоОрганизация.Следующий() Цикл
		ОбходПоСтруктурнаяЕдиница = ОбходПоОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ОбходПоСтруктурнаяЕдиница.Следующий() Цикл
			ОбходПоСчетУчета = ОбходПоСтруктурнаяЕдиница.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ОбходПоСчетУчета.Следующий() Цикл
				ОбходПоНоменклатура = ОбходПоСчетУчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ОбходПоНоменклатура.Следующий() Цикл
					ОбходПоХарактеристика = ОбходПоНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ОбходПоХарактеристика.Следующий() Цикл
						ОбходПоПартия = ОбходПоХарактеристика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ОбходПоПартия.Следующий() Цикл
							ОбходПоДокументПродажи = ОбходПоПартия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ОбходПоДокументПродажи.Следующий() Цикл
								ОбходПоСуммаВозврат = ОбходПоДокументПродажи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Пока ОбходПоСуммаВозврат.Следующий() Цикл
									ОбходПоКоличествоВозврат = ОбходПоСуммаВозврат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									Пока ОбходПоКоличествоВозврат.Следующий() Цикл
										КоличествоОсталосьРаспределить = ОбходПоКоличествоВозврат.КоличествоВозврат;
										СуммаОсталосьРаспределить = ОбходПоКоличествоВозврат.СуммаВозврат;
										ВыборкаДетальныеЗаписи = ОбходПоКоличествоВозврат.Выбрать();
										Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
											Если КоличествоОсталосьРаспределить > 0 Тогда
												НоваяСтрока = ТаблицаВозвратов.Добавить();
												ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
												Если КоличествоОсталосьРаспределить <= ВыборкаДетальныеЗаписи.КоличествоПродано Тогда
													НоваяСтрока.КоличествоРаспределено = КоличествоОсталосьРаспределить;
													КоличествоОсталосьРаспределить = 0;
													НоваяСтрока.СуммаРаспределено = СуммаОсталосьРаспределить;
													СуммаОсталосьРаспределить = 0;
												Иначе
													НоваяСтрока.КоличествоРаспределено = ВыборкаДетальныеЗаписи.КоличествоПродано;
													КоличествоОсталосьРаспределить = КоличествоОсталосьРаспределить - ВыборкаДетальныеЗаписи.КоличествоПродано;
													НоваяСтрока.СуммаРаспределено = ВыборкаДетальныеЗаписи.СуммаПродано;
													СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - ВыборкаДетальныеЗаписи.СуммаПродано;
												КонецЕсли;
											КонецЕсли;
										КонецЦикла;
									КонецЦикла;
								КонецЦикла;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаВозвратов", ТаблицаВозвратов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаВозвратов.Организация КАК Организация,
	|	ТаблицаВозвратов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВозвратов.СчетУчета КАК СчетУчета,
	|	ТаблицаВозвратов.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаВозвратов.Номенклатура КАК Номенклатура,
	|	ТаблицаВозвратов.Характеристика КАК Характеристика,
	|	ТаблицаВозвратов.Партия КАК Партия,
	|	ТаблицаВозвратов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаВозвратов.НомерУзла КАК НомерУзла,
	|	ТаблицаВозвратов.КоличествоРаспределено КАК Количество,
	|	ТаблицаВозвратов.СуммаРаспределено КАК Сумма,
	|	ТаблицаВозвратов.ДокументПродажи КАК ДокументПродажи
	|ПОМЕСТИТЬ УчетЗатратВозвраты
	|ИЗ
	|	&ТаблицаВозвратов КАК ТаблицаВозвратов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗапасовИЗатрат.Организация КАК Организация,
	|	УчетЗапасовИЗатрат.КоррСтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.КоррСчетУчета КАК СчетУчета,
	|	УчетЗапасовИЗатрат.КоррНоменклатура КАК Номенклатура,
	|	УчетЗапасовИЗатрат.КоррХарактеристика КАК Характеристика,
	|	УчетЗапасовИЗатрат.КоррПартия КАК Партия,
	|	УчетЗапасовИЗатрат.КоррЗаказПокупателя КАК ЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					И НЕ УчетЗапасовИЗатрат.Возврат
	|				ТОГДА УчетЗапасовИЗатрат.Количество
	|			КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					И УчетЗапасовИЗатрат.Возврат
	|				ТОГДА -УчетЗапасовИЗатрат.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ УчетЗапасовИЗатрат.Возврат
	|					ТОГДА УчетЗапасовИЗатрат.Сумма
	|				КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И УчетЗапасовИЗатрат.Возврат
	|					ТОГДА -УчетЗапасовИЗатрат.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(23, 10))) КАК Сумма,
	|	УчетЗапасовИЗатрат.КоррСчетУчетаРегл КАК СчетУчетаРегл
	|ПОМЕСТИТЬ УчетЗатратБезУчетаВозвратов
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗапасовИЗатрат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|		ПО (УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор)
	|			И УчетЗапасовИЗатрат.Организация = УзлыКорректировкиСтоимостиСписания.Организация
	|			И УчетЗапасовИЗатрат.СтруктурнаяЕдиница = УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница
	//+++ Дмгг
	//|			И УчетЗапасовИЗатрат.СчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА УчетЗапасовИЗатрат.СчетУчетаРегл = УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл
	|				ИНАЧЕ УчетЗапасовИЗатрат.СчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета
	|			КОНЕЦ)
	//--- Дмгг
	|			И УчетЗапасовИЗатрат.Номенклатура = УзлыКорректировкиСтоимостиСписания.Номенклатура
	|			И УчетЗапасовИЗатрат.Характеристика = УзлыКорректировкиСтоимостиСписания.Характеристика
	|			И УчетЗапасовИЗатрат.Партия = УзлыКорректировкиСтоимостиСписания.Партия
	|			И УчетЗапасовИЗатрат.ЗаказПокупателя = УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя
	|ГДЕ
	|	УчетЗапасовИЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И УчетЗапасовИЗатрат.Организация = &Организация
	|	И НЕ УчетЗапасовИЗатрат.ФиксированнаяСтоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗапасовИЗатрат.Организация,
	|	УчетЗапасовИЗатрат.КоррСтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.КоррСчетУчета,
	|	УчетЗапасовИЗатрат.КоррНоменклатура,
	|	УчетЗапасовИЗатрат.КоррХарактеристика,
	|	УчетЗапасовИЗатрат.КоррПартия,
	|	УчетЗапасовИЗатрат.КоррЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла,
	|	УчетЗапасовИЗатрат.КоррСчетУчетаРегл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,
	|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатрат.НомерУзла КАК НомерУзла,
	|	СУММА(УчетЗатрат.Количество) КАК Количество,
	|	СУММА(УчетЗатрат.Сумма) КАК Сумма,
	|	УчетЗатрат.СчетУчетаРегл
	|ПОМЕСТИТЬ УчетЗатрат
	|ИЗ
	|	(ВЫБРАТЬ
	|		УчетЗатратЗаВычетомВозвратов.Организация КАК Организация,
	|		УчетЗатратЗаВычетомВозвратов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		УчетЗатратЗаВычетомВозвратов.СчетУчета КАК СчетУчета,
	|		УчетЗатратЗаВычетомВозвратов.Номенклатура КАК Номенклатура,
	|		УчетЗатратЗаВычетомВозвратов.Характеристика КАК Характеристика,
	|		УчетЗатратЗаВычетомВозвратов.Партия КАК Партия,
	|		УчетЗатратЗаВычетомВозвратов.ЗаказПокупателя КАК ЗаказПокупателя,
	|		УчетЗатратЗаВычетомВозвратов.НомерУзла КАК НомерУзла,
	|		УчетЗатратЗаВычетомВозвратов.Количество КАК Количество,
	|		УчетЗатратЗаВычетомВозвратов.Сумма КАК Сумма,
	|		УчетЗатратЗаВычетомВозвратов.СчетУчетаРегл КАК СчетУчетаРегл
	|	ИЗ
	|		УчетЗатратБезУчетаВозвратов КАК УчетЗатратЗаВычетомВозвратов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УчетЗатратВозвраты.Организация,
	|		УчетЗатратВозвраты.СтруктурнаяЕдиница,
	|		УчетЗатратВозвраты.СчетУчета,
	|		УчетЗатратВозвраты.Номенклатура,
	|		УчетЗатратВозвраты.Характеристика,
	|		УчетЗатратВозвраты.Партия,
	|		УчетЗатратВозвраты.ЗаказПокупателя,
	|		УчетЗатратВозвраты.НомерУзла,
	|		УчетЗатратВозвраты.Количество,
	|		УчетЗатратВозвраты.Сумма,
	|		УчетЗатратВозвраты.СчетУчетаРегл
	|	ИЗ
	|		УчетЗатратВозвраты КАК УчетЗатратВозвраты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УчетЗатратВозвраты.Организация,
	|		НЕОПРЕДЕЛЕНО,
	|		ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка),
	|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|		ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка),
	|		ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
	|		УчетЗатратВозвраты.НомерУзла,
	|		-УчетЗатратВозвраты.Количество,
	|		-УчетЗатратВозвраты.Сумма,
	|		УчетЗатратВозвраты.СчетУчетаРегл
	|	ИЗ
	|		УчетЗатратВозвраты КАК УчетЗатратВозвраты) КАК УчетЗатрат
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатрат.Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета,
	|	УчетЗатрат.Номенклатура,
	|	УчетЗатрат.Характеристика,
	|	УчетЗатрат.Партия,
	|	УчетЗатрат.ЗаказПокупателя,
	|	УчетЗатрат.НомерУзла,
	|	УчетЗатрат.СчетУчетаРегл
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	СчетУчетаРегл,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	НомерУзла";
	
	
	Запрос.ВыполнитьПакет();
	
	// Итерационно ищем решение системы линейных уравнений, пока отклонение не
	// будет меньше требуемого или не будет выполнено 100 итераций расчета.
	Сумма = 0;
	Пока (ТекущееОтклонение > ТребуемаяТочность * ТребуемаяТочность) И (КоличествоИтераций < 100) Цикл
		
		КоличествоИтераций = КоличествоИтераций + 1;
		
		// Следующая итерация расчета.
		//+++ Истомин
		// Все множетели, делители и сумма первого аакета приведины к максимальному числу, которое поддерживает 1С
		// Проблемную строку расчета определить не удалось (результат определненный через цикл дал значение которе походит для ЧИСЛО(23,10))
		// Во втором пакете значения первого приводится к родному 23,10
		// старый вариант: только СЦММА(ВЫРАЗИТЬ(... ; все остальное было без выразить
		//--- Истомин
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
		|	СУММА(ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА УзлыКорректировкиСтоимостиСписания.Количество <> 0
		|					ТОГДА (ВЫРАЗИТЬ(ТаблицаРешений.Сумма КАК ЧИСЛО(38, 28))) * (ВЫРАЗИТЬ(ВЫБОР
		|								КОГДА УчетЗатрат.Количество = 0
		|									ТОГДА ВЫРАЗИТЬ(УчетЗатрат.Сумма КАК ЧИСЛО(38, 28))
		|								ИНАЧЕ ВЫРАЗИТЬ(УчетЗатрат.Количество КАК ЧИСЛО(38, 28))
		|							КОНЕЦ КАК ЧИСЛО(38, 28))) / (ВЫРАЗИТЬ(УзлыКорректировкиСтоимостиСписания.Количество КАК ЧИСЛО(38, 28)))
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ЧИСЛО(38, 28))) КАК Сумма
		|ПОМЕСТИТЬ ВременнаяТаблицаРешений
		|ИЗ
		|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ УчетЗатрат КАК УчетЗатрат
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
		|			ПО УчетЗатрат.НомерУзла = ТаблицаРешений.НомерУзла
		|		ПО УзлыКорректировкиСтоимостиСписания.Организация = УчетЗатрат.Организация
		|			И УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница = УчетЗатрат.СтруктурнаяЕдиница
		//+++ Дмгг
		//|			И УзлыКорректировкиСтоимостиСписания.СчетУчета = УчетЗатрат.СчетУчета
		|			И (ВЫБОР
		|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
		|					ТОГДА УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл = УчетЗатрат.СчетУчетаРегл
		|				ИНАЧЕ УзлыКорректировкиСтоимостиСписания.СчетУчета = УчетЗатрат.СчетУчета
		|			КОНЕЦ)
		//--- Дмгг
		|			И УзлыКорректировкиСтоимостиСписания.Номенклатура = УчетЗатрат.Номенклатура
		|			И УзлыКорректировкиСтоимостиСписания.Характеристика = УчетЗатрат.Характеристика
		|			И УзлыКорректировкиСтоимостиСписания.Партия = УчетЗатрат.Партия
		|			И УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя = УчетЗатрат.ЗаказПокупателя
		|ГДЕ
		|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	УзлыКорректировкиСтоимостиСписания.НомерУзла
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерУзла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА((ЕСТЬNULL(ТаблицаРешений.Сумма, 0) - (УзлыКорректировкиСтоимостиСписания.Сумма + (ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаРешений.Сумма, 0) КАК ЧИСЛО(23, 10))))) * (ЕСТЬNULL(ТаблицаРешений.Сумма, 0) - (УзлыКорректировкиСтоимостиСписания.Сумма + (ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаРешений.Сумма, 0) КАК ЧИСЛО(23, 10)))))) КАК СуммаКвадратовОтклонений
		|ИЗ
		|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаРешений КАК ВременнаяТаблицаРешений
		|		ПО (ВременнаяТаблицаРешений.НомерУзла = УзлыКорректировкиСтоимостиСписания.НомерУзла)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
		|		ПО (ТаблицаРешений.НомерУзла = УзлыКорректировкиСтоимостиСписания.НомерУзла)
		|ГДЕ
		|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		Результат = МассивРезультатов[1];
		
		СтароеОтклонение = ТекущееОтклонение;
		Если Результат.Пустой() Тогда
			ТекущееОтклонение = 0; // отклонений нет
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			// Определим текущее отклонение от решения.
			ТекущееОтклонение = ?(Выборка.СуммаКвадратовОтклонений = NULL, 0, Выборка.СуммаКвадратовОтклонений);
		КонецЕсли;
		
		Запрос.Текст =
		"УНИЧТОЖИТЬ ТаблицаРешений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
		|	УзлыКорректировкиСтоимостиСписания.Сумма + ЕСТЬNULL(ВременнаяТаблицаРешений.Сумма, 0) КАК Сумма
		|ПОМЕСТИТЬ ТаблицаРешений
		|ИЗ
		|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаРешений КАК ВременнаяТаблицаРешений
		|		ПО (ВременнаяТаблицаРешений.НомерУзла = УзлыКорректировкиСтоимостиСписания.НомерУзла)
		|ГДЕ
		|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерУзла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаРешений";
		
		Запрос.ВыполнитьПакет();
		
	КонецЦикла;

	Возврат Истина;	
	
КонецФункции

&Вместо("СформироватьДвиженияПоРегиструУчетаЗатрат")
Процедура AzRyFix_СформироватьДвиженияПоРегиструУчетаЗатрат(НаборЗаписей, НаборЗаписейУправленческий, НаборЗаписейХозрасчетный, СтрокаДвижения, Сумма, ФиксированнаяСтоимость, СодержаниеПроводки)
	
	Если Не AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца Тогда		
		ПродолжитьВызов(НаборЗаписей, НаборЗаписейУправленческий, НаборЗаписейХозрасчетный, СтрокаДвижения, Сумма, ФиксированнаяСтоимость, СодержаниеПроводки);
		Возврат;
	КонецЕсли;	
		
	Если СодержаниеПроводки = Неопределено Тогда
		Если СтрокаДвижения.СчетУчетаТипСчета = Перечисления.ТипыСчетов.Запасы Тогда
			СодержаниеПроводки = НСтр("ka='მარაგების ჩამოწერა საწყობიდან';ru='Списание запасов со склада';en='Write-off of inventories from the warehouse'");
		Иначе
			Если ЗначениеЗаполнено(СтрокаДвижения.Номенклатура) Тогда
				СодержаниеПроводки = НСтр("ka='ხარჯების ჩამოწერა';ru='Списание расходов';en='Write-off costs'");
			Иначе
				СодержаниеПроводки = НСтр("ka='საწარმოდან მარაგების ჩამოწერა';ru='Списание запасов из производства';en='The write-downs of production'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Расход по регистру Учет запасов и затрат.
	НоваяСтрока = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДвижения);
	НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
	Если НоваяСтрока.Номенклатура.МетодОценки = Перечисления.МетодОценкиЗапасов.FIFO Тогда 
		НоваяСтрока.Период = ?(ЗначениеЗаполнено(НоваяСтрока.Период), НоваяСтрока.Период, Дата); // для возвратов период будет заполнен, это нужно для FIFO
	Иначе
		НоваяСтрока.Период = Дата; 
	КонецЕсли;
	НоваяСтрока.Регистратор = Ссылка;
	НоваяСтрока.ФиксированнаяСтоимость = ФиксированнаяСтоимость;
	НоваяСтрока.Количество = 0;
	НоваяСтрока.Сумма = Сумма;
	НоваяСтрока.СодержаниеПроводки = СодержаниеПроводки;
		
	Если (СтрокаДвижения.КоррСчетУчета = ДополнительныеСвойства.ДляПроведения.ПустойСчет И НЕ ИспользоватьТолькоРегламентированныйПланСчетов)
		ИЛИ (СтрокаДвижения.КоррСчетУчетаРегл = ДополнительныеСвойства.ДляПроведения.ПустойСчетРегл И ИспользоватьТолькоРегламентированныйПланСчетов) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаДвижения.КоррСчетУчетаТипСчета = Перечисления.ТипыСчетов.Запасы Тогда
		СодержаниеПроводки = НСтр("ka='საწყობში მარაგების შემოსავალში გატარება';ru='Оприходование запасов на склад';en='Posting inventory at the warehouse'");
	Иначе
		Если ЗначениеЗаполнено(СтрокаДвижения.Номенклатура) Тогда
			СодержаниеПроводки = НСтр("ka='ხარჯების შემოსვლა';ru='Поступление расходов';en='Admission costs'");
		Иначе
			СодержаниеПроводки = НСтр("ka='წარმოებაში მარაგების შემოსავალში აყვანა';ru='Оприходование запасов в производство';en='Posting inventory to production'");
		КонецЕсли;
	КонецЕсли;
	
	// Приход по регистру Учет запасов и затрат.
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
	НоваяСтрока.Период = Дата;
	НоваяСтрока.Регистратор = Ссылка;
	НоваяСтрока.Организация = СтрокаДвижения.Организация;
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 октября 2021 г.]  НАЧАЛО
	//УчетСебестоимостиВРазрезеОрганизации
	//НоваяСтрока.СтруктурнаяЕдиница = СтрокаДвижения.КоррСтруктурнаяЕдиница;
	НоваяСтрока.СтруктурнаяЕдиница = ?(СтрокаДвижения.КоррСтруктурнаяЕдиница = Неопределено ИЛИ (СтрокаДвижения.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад")
									И СтрокаДвижения.УчетСебестоимостиВРазрезеОрганизации), Неопределено, СтрокаДвижения.КоррСтруктурнаяЕдиница);
	// © Шишка В.В. [1 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	НоваяСтрока.СчетУчета = СтрокаДвижения.КоррСчетУчета;
	НоваяСтрока.СчетУчетаРегл = СтрокаДвижения.КоррСчетУчетаРегл;
	НоваяСтрока.Номенклатура = СтрокаДвижения.КоррНоменклатура;
	НоваяСтрока.Характеристика = СтрокаДвижения.КоррХарактеристика;
	НоваяСтрока.Партия = СтрокаДвижения.КоррПартия;
	НоваяСтрока.ЗаказПокупателя = СтрокаДвижения.КоррЗаказПокупателя;	
	НоваяСтрока.Спецификация = СтрокаДвижения.КоррСпецификация;
	НоваяСтрока.КоррСпецификация = СтрокаДвижения.Спецификация;
	НоваяСтрока.КоррСтруктурнаяЕдиница = СтрокаДвижения.СтруктурнаяЕдиница;
	НоваяСтрока.КоррСчетУчета = СтрокаДвижения.СчетУчета;
	НоваяСтрока.КоррСчетУчетаРегл = СтрокаДвижения.СчетУчетаРегл;
	НоваяСтрока.КоррНоменклатура = СтрокаДвижения.Номенклатура;
	НоваяСтрока.КоррХарактеристика = СтрокаДвижения.Характеристика;
	НоваяСтрока.КоррПартия = СтрокаДвижения.Партия;
	НоваяСтрока.КоррЗаказПокупателя = СтрокаДвижения.ЗаказПокупателя;
	НоваяСтрока.ФиксированнаяСтоимость = ФиксированнаяСтоимость;
	НоваяСтрока.Сумма = Сумма;
	НоваяСтрока.СодержаниеПроводки = СодержаниеПроводки;
	
	// Движения по регистру Управленческий.
	НоваяСтрока = НаборЗаписейУправленческий.Добавить();
	НоваяСтрока.Период = Дата;
	НоваяСтрока.Регистратор = Ссылка;
	НоваяСтрока.Организация = СтрокаДвижения.Организация;
	НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
	НоваяСтрока.СчетДт = СтрокаДвижения.КоррСчетУчета;
	НоваяСтрока.СчетКт = СтрокаДвижения.СчетУчета;
	НоваяСтрока.Сумма = Сумма; 
	НоваяСтрока.Содержание = СодержаниеПроводки;
	
	// Движения по регистру Хозрасчетный.
	НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
	НоваяСтрока.Период = Дата;
	НоваяСтрока.Регистратор = Ссылка;
	НоваяСтрока.Организация = СтрокаДвижения.Организация;
	НоваяСтрока.СчетДт = СтрокаДвижения.КоррСчетУчетаРегл;
	НоваяСтрока.СчетКт = СтрокаДвижения.СчетУчетаРегл;
	НоваяСтрока.Содержание = СодержаниеПроводки;
	НоваяСтрока.Сумма = Сумма;                                                                           
	
	//+++ ДМГГ
	Если СодержаниеПроводки = НСтр("ka='წარმოებაში მარაგების შემოსავალში აყვანა';ru='Оприходование запасов в производство';en='Posting inventory to production'") 
		И СтрокаДвижения.Свойство("ДопСвойства") Тогда 
		
		// Дт
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", СтрокаДвижения.НоменклатураДт);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", СтрокаДвижения.ПодразделениеДт);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ХарактеристикиНоменклатуры", СтрокаДвижения.ХарактеристикаДт);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", СтрокаДвижения.СтруктурнаяЕдиницаДт);
		
		// Кт
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", СтрокаДвижения.НоменклатураКт);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", СтрокаДвижения.ПодразделениеКт);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ХарактеристикиНоменклатуры", СтрокаДвижения.ХарактеристикаКт);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", СтрокаДвижения.СтруктурнаяЕдиницаКт);
		
	Иначе
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ?(ЗначениеЗаполнено(СтрокаДвижения.КоррНоменклатура),СтрокаДвижения.КоррНоменклатура,СтрокаДвижения.Номенклатура));//Номенклатура);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ?(ЗначениеЗаполнено(СтрокаДвижения.Подразделение), СтрокаДвижения.Подразделение, 
																										//--------------------------------------------------------------------------
																										// © Шишка В.В. [21 октября 2021]  НАЧАЛО
																										//?(ТипЗнч(СтрокаДвижения.СтруктурнаяЕдиница) = Тип("СправочникСсылка.СтруктурныеЕдиницы")
																										//И СтрокаДвижения.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																										//	СтрокаДвижения.СтруктурнаяЕдиница,
																										//	?(СтрокаДвижения.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																										//	СтрокаДвижения.КоррСтруктурнаяЕдиница, СтрокаДвижения.Подразделение))));
																										?(СтрокаДвижения.СтруктурнаяЕдиница <> Неопределено И ТипЗнч(СтрокаДвижения.СтруктурнаяЕдиница) = Тип("СправочникСсылка.СтруктурныеЕдиницы")
																										И СтрокаДвижения.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																											СтрокаДвижения.СтруктурнаяЕдиница,
																											?(СтрокаДвижения.КоррСтруктурнаяЕдиница <> Неопределено И СтрокаДвижения.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																											СтрокаДвижения.КоррСтруктурнаяЕдиница, СтрокаДвижения.Подразделение))));
																											
																										// © Шишка В.В. [21 октября 2021]  КОНЕЦ
																										//--------------------------------------------------------------------------
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", СтрокаДвижения.КоррСтруктурнаяЕдиница);
	
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", СтрокаДвижения.Номенклатура);//Номенклатура);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ?(ЗначениеЗаполнено(СтрокаДвижения.Подразделение), СтрокаДвижения.Подразделение, 
																										//--------------------------------------------------------------------------
																										// © Шишка В.В. [21 октября 2021]  НАЧАЛО
																										//?(ТипЗнч(СтрокаДвижения.СтруктурнаяЕдиница) = Тип("СправочникСсылка.СтруктурныеЕдиницы"),
																										//?(СтрокаДвижения.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																										//	СтрокаДвижения.СтруктурнаяЕдиница, СтрокаДвижения.Подразделение),
																										//	?(СтрокаДвижения.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																										//	СтрокаДвижения.КоррСтруктурнаяЕдиница, СтрокаДвижения.Подразделение))));
																										?(СтрокаДвижения.СтруктурнаяЕдиница <> Неопределено И ТипЗнч(СтрокаДвижения.СтруктурнаяЕдиница) = Тип("СправочникСсылка.СтруктурныеЕдиницы"),
																										?(СтрокаДвижения.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																											СтрокаДвижения.СтруктурнаяЕдиница, СтрокаДвижения.Подразделение),
																											?(СтрокаДвижения.КоррСтруктурнаяЕдиница <> Неопределено И СтрокаДвижения.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																											СтрокаДвижения.КоррСтруктурнаяЕдиница, СтрокаДвижения.Подразделение))));
																											
																										// © Шишка В.В. [21 октября 2021]  КОНЕЦ
																										//--------------------------------------------------------------------------
																										//?(ЗначениеЗаполнено(СтрокаДвижения.Подразделение), СтрокаДвижения.Подразделение, 
																										//?(СтрокаДвижения.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																										//	СтрокаДвижения.СтруктурнаяЕдиница, СтрокаДвижения.Подразделение)));
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", СтрокаДвижения.СтруктурнаяЕдиница);//КоррСтруктурнаяЕдиница);
	
	КонецЕсли;	
	
КонецПроцедуры

&Вместо("СформироватьКорректирующиеДвиженияПоРегиструУчетаЗатрат")
Процедура AzRyFix_СформироватьКорректирующиеДвиженияПоРегиструУчетаЗатрат()
	
	Если Не AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца Тогда		
		ПродолжитьВызов();
		Возврат;
	КонецЕсли;
		
	ДатаНач = ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода;
	ДатаКон = ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод;
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 октября 2021 г.]  НАЧАЛО
	УчетСебестоимостиВРазрезеОрганизации = ДополнительныеСвойства.УчетнаяПолитика.УчетСебестоимостиВРазрезеОрганизации;
	// © Шишка В.В. [1 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	
	Запрос = Новый Запрос();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписанияРегл,
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ПеремещениеВРозницуСуммовойУчет
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК РозничнаяСтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	//+++ Дмгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|			ТОГДА ВЫБОР 
	|				КОГДА &ЗакрыватьПоРеглПлануСчетов
	|					ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл.ТипСчета
	|				ИНАЧЕ УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|			КОНЕЦ	
	//--- Дмгг
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	//+++ Дмгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|			ТОГДА ВЫБОР 
	|				КОГДА &ЗакрыватьПоРеглПлануСчетов
	|					ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл.ТипСчета
	|				ИНАЧЕ УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|			КОНЕЦ
	//--- Дмгг
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписанияТипСчета,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.НаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НаправлениеДеятельностиСписания,
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|		ИНАЧЕ УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиницаПолучатель,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,
	|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатрат.Спецификация КАК Спецификация,
	|	УчетЗатрат.КоррСпецификация КАК КоррСпецификация,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета КАК КоррСчетУчета,
	|	УчетЗатрат.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
	|	УчетЗатрат.КоррНоменклатура КАК КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика КАК КоррХарактеристика,
	|	УчетЗатрат.КоррПартия КАК КоррПартия,
	|	УчетЗатрат.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА УчетЗатрат.Количество
	|			ИНАЧЕ -УчетЗатрат.Количество
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА УчетЗатрат.Сумма
	|			ИНАЧЕ -УчетЗатрат.Сумма
	|		КОНЕЦ) КАК Сумма,
	|	УчетЗатрат.Номенклатура.КатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельностиПродажи,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
	//+++ Дмгг
	//|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	|	ВЫБОР 
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета
	|	КОНЕЦ КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	//--- Дмгг
	|	УчетЗатрат.ДокументПродажи КАК ДокументПродажи,
	|	УчетЗатрат.ЗаказПродажи КАК ЗаказПродажи,
	|	УчетЗатрат.Подразделение КАК Подразделение,
	|	УчетЗатрат.Ответственный КАК Ответственный,
	|	УчетЗатрат.СтавкаНДС КАК СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет
	|ПОМЕСТИТЬ УчетЗатратСписания
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗатрат
	|ГДЕ
	|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НЕ УчетЗатрат.Возврат
	|			ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И УчетЗатрат.Возврат)
	|	И УчетЗатрат.Организация = &Организация
	|	И НЕ УчетЗатрат.ФиксированнаяСтоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ПеремещениеВРозницуСуммовойУчет
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	//+++ ДМгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|			ТОГДА ВЫБОР 
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл.ТипСчета
	|					ИНАЧЕ УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|				КОНЕЦ
	//--- Дмгг
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	//+++ Дмгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|			ТОГДА ВЫБОР 
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл.ТипСчета
	|					ИНАЧЕ УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|				КОНЕЦ
	//--- Дмгг
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.НаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	УчетЗатрат.Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|		ИНАЧЕ УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|	КОНЕЦ,
	|	УчетЗатрат.СчетУчета,
	|	УчетЗатрат.СчетУчетаРегл,
	|	УчетЗатрат.Номенклатура,
	|	УчетЗатрат.Характеристика,
	|	УчетЗатрат.Партия,
	|	УчетЗатрат.ЗаказПокупателя,
	|	УчетЗатрат.Спецификация,
	|	УчетЗатрат.КоррСпецификация,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета,
	|	УчетЗатрат.КоррСчетУчетаРегл,
	|	УчетЗатрат.КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика,
	|	УчетЗатрат.КоррПартия,
	|	УчетЗатрат.КоррЗаказПокупателя,
	|	УчетЗатрат.Номенклатура.КатегорияНоменклатуры,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл,
	//+++ Дмгг
	//|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета,
	|	ВЫБОР 
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета
	|	КОНЕЦ,
	//--- Дмгг
	|	УчетЗатрат.ДокументПродажи,
	|	УчетЗатрат.ЗаказПродажи,
	|	УчетЗатрат.Подразделение,
	|	УчетЗатрат.Ответственный,
	|	УчетЗатрат.СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	СчетУчетаРегл,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УзлыКорректировкиСтоимостиСписания.Организация КАК Организация,
	|	УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
	|	УзлыКорректировкиСтоимостиСписания.СчетУчета КАК СчетУчета,
	//+++ Дмгг
	|	УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	УзлыКорректировкиСтоимостиСписания.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
	|	ВЫБОР 
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл.ТипСчета
	|		ИНАЧЕ УзлыКорректировкиСтоимостиСписания.СчетУчета.ТипСчета
	|	КОНЕЦ КАК СчетУчетаТипСчета,
	//--- Дмгг
	|	УзлыКорректировкиСтоимостиСписания.Номенклатура КАК Номенклатура,
	|	УзлыКорректировкиСтоимостиСписания.Характеристика КАК Характеристика,
	|	УзлыКорректировкиСтоимостиСписания.Партия КАК Партия,
	|	УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	УчетЗатрат.Спецификация КАК Спецификация,
	|	УчетЗатрат.КоррСпецификация КАК КоррСпецификация,
	|	УчетЗатрат.СчетУчетаСписания КАК СчетУчетаСписания,
	|	УчетЗатрат.СчетУчетаСписанияРегл КАК СчетУчетаСписанияРегл,
	|	УчетЗатрат.СчетУчетаСписанияТипСчета КАК СчетУчетаСписанияТипСчета,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета КАК КоррСчетУчета,
	|	УчетЗатрат.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
	//+++ Дмгг
	//|	УчетЗатрат.КоррСчетУчета.ТипСчета КАК КоррСчетУчетаТипСчета,
	|	ВЫБОР 
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.КоррСчетУчетаРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.КоррСчетУчета.ТипСчета
	|	КОНЕЦ КАК КоррСчетУчетаТипСчета,
	//--- Дмгг
	|	УчетЗатрат.КоррНоменклатура КАК КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика КАК КоррХарактеристика,
	|	УчетЗатрат.КоррПартия КАК КоррПартия,
	|	УчетЗатрат.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчетЗатрат.Количество, 0) = 0
	|			ТОГДА ЕСТЬNULL(УчетЗатрат.Сумма, 0)
	|		ИНАЧЕ ЕСТЬNULL(УчетЗатрат.Количество, 0)
	|	КОНЕЦ КАК Количество,
	|	ЕСТЬNULL(УчетЗатрат.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(ТаблицаРешений.Сумма, 0) КАК Цена,
	|	УчетЗатрат.НоменклатураКатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
	|	УчетЗатрат.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельностиПродажи,
	|	УчетЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	//+++ Дмгг
	|	УчетЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
	|	УчетЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	//|	ВЫБОР
	//|		КОГДА УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	//|			ТОГДА УчетЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл
	//|		ИНАЧЕ УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат
	//|	КОНЕЦ КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
	//|	ВЫБОР
	//|		КОГДА УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	//|			ТОГДА УчетЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета
	//|		ИНАЧЕ УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат.ТипСчета
	//|	КОНЕЦ КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	|	УчетЗатрат.ДокументПродажи КАК ДокументПродажи,
	|	УчетЗатрат.ЗаказПродажи КАК ЗаказПродажи,
	|	УчетЗатрат.Подразделение КАК Подразделение,
	|	УчетЗатрат.Ответственный КАК Ответственный,
	|	УчетЗатрат.СтавкаНДС КАК СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	УчетЗатрат.НаправлениеДеятельностиСписания КАК НаправлениеДеятельностиСписания,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	|	УчетЗатрат.РозничнаяСтруктурнаяЕдиница КАК РозничнаяСтруктурнаяЕдиница,
	|	УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 октября 2021 г.]  НАЧАЛО
	|	, &УчетСебестоимостиВРазрезеОрганизации КАК УчетСебестоимостиВРазрезеОрганизации
	// © Шишка В.В. [1 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	|ИЗ
	|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетЗатратСписания КАК УчетЗатрат
	|		ПО УзлыКорректировкиСтоимостиСписания.Организация = УчетЗатрат.Организация
	|			И УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница = УчетЗатрат.СтруктурнаяЕдиница
	//+++ Дмгг
	//|			И УзлыКорректировкиСтоимостиСписания.СчетУчета = УчетЗатрат.СчетУчета
	|			И ВЫБОР 
	|				КОГДА &ЗакрыватьПоРеглПлануСчетов
	|					ТОГДА УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл = УчетЗатрат.СчетУчетаРегл
	|				ИНАЧЕ УзлыКорректировкиСтоимостиСписания.СчетУчета = УчетЗатрат.СчетУчета
	|			КОНЕЦ
	//--- Дмгг 
	|			И УзлыКорректировкиСтоимостиСписания.Номенклатура = УчетЗатрат.Номенклатура
	|			И УзлыКорректировкиСтоимостиСписания.Характеристика = УчетЗатрат.Характеристика
	|			И УзлыКорректировкиСтоимостиСписания.Партия = УчетЗатрат.Партия
	|			И УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя = УчетЗатрат.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
	|		ПО (ТаблицаРешений.НомерУзла = УзлыКорректировкиСтоимостиСписания.НомерУзла)
	//|	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&ДатаКон, Организация = &Организация) КАК УчетнаяПолитикаРеглСрезПоследних
	|ГДЕ
	|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерУзла УБЫВ";
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ЗакрыватьПоРеглПлануСчетов", ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 октября 2021 г.]  НАЧАЛО
	Запрос.УстановитьПараметр("УчетСебестоимостиВРазрезеОрганизации", УчетСебестоимостиВРазрезеОрганизации);
	// © Шишка В.В. [1 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если Результат[1].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Создадим набор записей регистра накопления Учет запасов и затрат.
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Продажи.
	НаборЗаписейПродажи = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НаборЗаписейПродажи.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления СуммовойУчетВРознице.
	НаборЗаписейСуммовойУчетВРознице = РегистрыНакопления.СуммовойУчетВРознице.СоздатьНаборЗаписей();
	НаборЗаписейСуммовойУчетВРознице.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Управленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Хозрасчетный.
	НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
	
	ВыборкаДетальныеЗаписи = Результат[1].Выбрать();
	
	СтруктураПараметровРегл = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(ДополнительныеСвойства.ДляПроведения.Организация, ДополнительныеСвойства.ДляПроведения.Дата);
	Если СтруктураПараметровРегл.Выбран() Тогда
		СчетПрочиеДоходыРегл = СтруктураПараметровРегл.СчетПрочихДоходов;
		СчетПрочиеРасходыРегл = СтруктураПараметровРегл.СчетПрочихРасходов;
	Иначе
		СчетПрочиеДоходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		СчетПрочиеРасходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		// Сделаем проверку, на случай, если есть не закрытые кассовые смены.
		Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЧекККМ")
			ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
			Продолжить;
		КонецЕсли;
		
		// Посчитаем суммы перемещения и корректировки.
		СуммаПеремещения = ВыборкаДетальныеЗаписи.Цена * ВыборкаДетальныеЗаписи.Количество;
		СуммаКорректировки = СуммаПеремещения - ВыборкаДетальныеЗаписи.Сумма;
		
		Если Окр(СуммаКорректировки, 2) <> 0 Тогда
			
			// Движения по регистру Учет запасов и затрат.
			СформироватьДвиженияПоРегиструУчетаЗатрат(
				НаборЗаписейЗапасы,
				НаборЗаписейУправленческий,
				НаборЗаписейХозрасчетный,
				ВыборкаДетальныеЗаписи,
				СуммаКорректировки,
				Ложь
			);
			
			Если ВыборкаДетальныеЗаписи.КоррСчетУчета = ДополнительныеСвойства.ДляПроведения.ПустойСчет
				ИЛИ ВыборкаДетальныеЗаписи.КоррСчетУчетаРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка() Тогда
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи)
				   И ((ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.РасходнаяНакладная")
					 И ВыборкаДетальныеЗаписи.ДокументПродажи.ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.АктВыполненныхРабот")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетКомиссионера")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЗаказПокупателя")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетОПереработке")) Тогда
					
					// Движения по регистру Продажи.
					НоваяСтрока = НаборЗаписейПродажи.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
					НоваяСтрока.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
					НоваяСтрока.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
					НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
					НоваяСтрока.Партия = ВыборкаДетальныеЗаписи.Партия;
					НоваяСтрока.Документ = ВыборкаДетальныеЗаписи.ДокументПродажи;
					НоваяСтрока.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
					НоваяСтрока.Себестоимость = СуммаКорректировки;
					
					// Движения по регистру ДоходыИРасходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.Подразделение;
					НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
					НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажи;
					НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
					НоваяСтрока.СчетУчетаРегл = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
					НоваяСтрока.СуммаРасходов = СуммаКорректировки;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
					НоваяСтрока.Сумма = СуммаКорректировки;
										
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);

					
				ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи)
						И ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.РасходнаяНакладная")
						И ВыборкаДетальныеЗаписи.ДокументПродажи.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда
						
					// Движения по регистру Доходы и расходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = ДополнительныеСвойства.ДляПроведения.Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = Неопределено;
					НоваяСтрока.ЗаказПокупателя = Неопределено;
					НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрока.СчетУчетаРегл = СчетПрочиеРасходыРегл;
						НоваяСтрока.СуммаРасходов = СуммаКорректировки;
						НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					Иначе
						НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрока.СчетУчетаРегл = СчетПрочиеДоходыРегл;
						НоваяСтрока.СуммаДоходов = СуммаКорректировки;
						НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა შემოსავლები';ru='Прочие доходы';en='Other income'");
					Конецесли;
					НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Номенклатура;
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетДт = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.Сумма = - СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					Иначе
						НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.СчетКт = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрока.Сумма = СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა შემოსავლები';ru='Прочие доходы';en='Other income'");
					КонецЕсли;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
										
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетДт = СчетПрочиеРасходыРегл;
						НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
						НоваяСтрока.Сумма = - СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					Иначе
						НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
						НоваяСтрока.СчетКт = СчетПрочиеДоходыРегл;
						НоваяСтрока.Сумма = СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა შემოსავლები';ru='Прочие доходы';en='Other income'");
					КонецЕсли;
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					
				ИначеЕсли ВыборкаДетальныеЗаписи.ПеремещениеВРозницуСуммовойУчет Тогда
					
					// Движения по регистру СуммовойУчетВРознице.
					НоваяСтрока = НаборЗаписейСуммовойУчетВРознице.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница;
					НоваяСтрока.Валюта = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Себестоимость = СуммаКорректировки;
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.СчетУчетаВРознице;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.СчетУчетаВРозницеРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Сумма = СуммаКорректировки;
										
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					
				ИначеЕсли ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы
					  ИЛИ ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.Расходы
					  ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяРасходным(ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл) Тогда
					
					// Движения по регистру Доходы и расходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = ДополнительныеСвойства.ДляПроведения.Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.СтруктурнаяЕдиницаПолучатель;
					
					Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ПеремещениеЗапасов")
					   И ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
						НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиСписания;
						НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПокупателя;
					Иначе
						НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					КонецЕсли;
					
					НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.СчетУчетаРегл = ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл;
					НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.СуммаРасходов = СуммаКорректировки;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					НоваяСтрока.Сумма = СуммаКорректировки;
										
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Подразделение),ВыборкаДетальныеЗаписи.Подразделение,ВыборкаДетальныеЗаписи.СтруктурнаяЕдиницаПолучатель));
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Подразделение),ВыборкаДетальныеЗаписи.Подразделение,ВыборкаДетальныеЗаписи.СтруктурнаяЕдиницаПолучатель));//ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					
				Иначе
					
					//+++ Дмгг
					//// Движения по регистру Управленческий.
					//НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					//НоваяСтрока.Период = Дата;
					//НоваяСтрока.Регистратор = Ссылка;
					//НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					//НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					//НоваяСтрока.СчетДт = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчетаСписания),ВыборкаДетальныеЗаписи.СчетУчетаСписания,ВыборкаДетальныеЗаписи.СчетУчета);
					//НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					//НоваяСтрока.Содержание = НСтр("ka='მარაგების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание запасов на произвольный счет';en='The write-downs on an arbitrary score'");
					//НоваяСтрока.Сумма = СуммаКорректировки;
					//
					//// Движения по регистру Хозрасчетный.
					//НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					//НоваяСтрока.Период = Дата;
					//НоваяСтрока.Регистратор = Ссылка;
					//НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					//НоваяСтрока.СчетДт = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл),ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл,ВыборкаДетальныеЗаписи.СчетУчетаРегл);;
					//НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					//НоваяСтрока.Содержание = НСтр("ka='მარაგების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание запасов на произвольный счет';en='The write-downs on an arbitrary score'");
					//НоваяСтрока.Сумма = СуммаКорректировки;
					//
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					//
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					//--- Дмгг
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Пишем оставшиеся записи Учет запасов и затрат.
	НаборЗаписейЗапасы.Записать(Ложь);
	
	// Пишем оставшиеся записи Продажи.
	НаборЗаписейПродажи.Записать(Ложь);
	
	// Пишем оставшиеся записи Учет доходов и расходов.
	НаборЗаписейДоходыИРасходы.Записать(Ложь);
	
	// Пишем оставшиеся записи Суммовой учет в рознице.
	НаборЗаписейСуммовойУчетВРознице.Записать(Ложь);
	
	// Пишем оставшиеся записи Управленческий.
	Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда  //+++ Дмгг
		НаборЗаписейУправленческий.Записать(Ложь);
	КонецЕсли;  //--- Дмгг
	
	// Пишем оставшиеся записи Хозрасчетный.
	НаборЗаписейХозрасчетный.Записать(Ложь);
	
КонецПроцедуры

&Вместо("РаспределитьСуммыБезКоличества")
Процедура AzRyFix_РаспределитьСуммыБезКоличества(ВидОперации, ТаблицаОшибок)

	Если Не AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца Тогда		
		ПродолжитьВызов(ВидОперации, ТаблицаОшибок);
		Возврат;
	КонецЕсли;	
	
	СписокОбработанныхУзлов = Новый Массив();
	СписокОбработанныхУзлов.Добавить("");
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 октября 2021 г.]  НАЧАЛО
	УчетСебестоимостиВРазрезеОрганизации = ДополнительныеСвойства.УчетнаяПолитика.УчетСебестоимостиВРазрезеОрганизации;
	// © Шишка В.В. [1 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	ДатаНач = ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода;
	ДатаКон = ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ЗакрыватьПоРеглПлануСчетов", ИспользоватьТолькоРегламентированныйПланСчетов);
	
	// Готовится таблица перемещений.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	//+++ Дмгг
	//|	УчетЗатрат.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.СчетУчетаРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.СчетУчета.ТипСчета
	|	КОНЕЦ КАК СчетУчетаТипСчета,
	//--- Дмгг	
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,  
	
	//Малышев 2024-07-22   ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА УчетЗатрат.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ КАК Проект,      
	//Малышев 2024-07-22   ONESOFT-3227  --)
	
	|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета КАК КоррСчетУчета,
	//+++ Дмгг
	//|	УчетЗатрат.КоррСчетУчета.ТипСчета КАК КоррСчетУчетаТипСчета,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.КоррСчетУчетаРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.КоррСчетУчета.ТипСчета
	|	КОНЕЦ КАК КоррСчетУчетаТипСчета,
	//--- Дмгг
	|	УчетЗатрат.КоррНоменклатура КАК КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика КАК КоррХарактеристика,
	|	УчетЗатрат.КоррПартия КАК КоррПартия,
	//Малышев 2024-07-22   ONESOFT-3227  (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатрат.КоррПроект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА УчетЗатрат.КоррПроект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ КАК КоррПроект,      
	//Малышев 2024-07-22   ONESOFT-3227  --)
	|	УчетЗатрат.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	УчетЗатрат.ДокументПродажи КАК ДокументПродажи,
	|	УчетЗатрат.ЗаказПродажи КАК ЗаказПродажи,
	|	УчетЗатрат.Подразделение КАК Подразделение,
	|	УчетЗатрат.Ответственный КАК Ответственный,
	|	УчетЗатрат.СтавкаНДС КАК СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписанияРегл,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	//+++ Дмгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|			ТОГДА ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл.ТипСчета
	|					ИНАЧЕ УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|			КОНЕЦ
	//--- Дмгг
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	//+++ Дмгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|			ТОГДА ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл.ТипСчета
	|					ИНАЧЕ УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|			КОНЕЦ
	//--- Дмгг
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписанияТипСчета,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.НаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НаправлениеДеятельностиСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|		ИНАЧЕ УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиницаПолучатель,
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ПеремещениеВРозницуСуммовойУчет
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК РозничнаяСтруктурнаяЕдиница,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	|	УчетЗатрат.Номенклатура.КатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельностиПродажи,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
	//+++ Дмгг
	//|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета
	|	КОНЕЦ КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	//--- Дмгг
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ УчетЗатрат.Возврат
	|					ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И УчетЗатрат.Возврат
	|				ТОГДА УчетЗатрат.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	УчетЗатрат.СчетУчетаРегл,
	|	УчетЗатрат.КоррСчетУчетаРегл     
	//+++ Дмгг, 10.04.2025, ONESOFT-3970
	|,	УчетЗатрат.Спецификация,
	|	УчетЗатрат.КоррСпецификация 
	//--- Дмгг, 10.04.2025, ONESOFT-3970
	|ПОМЕСТИТЬ УчетЗатратДвиженияРасход 
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗатрат
	|ГДЕ
	|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И УчетЗатрат.Организация = &Организация
	|	И НЕ УчетЗатрат.ФиксированнаяСтоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатрат.Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета,
	|	УчетЗатрат.Номенклатура,
	|	УчетЗатрат.Характеристика,
	|	УчетЗатрат.Партия,
	//Малышев 2024-07-22   ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА УчетЗатрат.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ,      
	//Малышев 2024-07-22   ONESOFT-3227 --)
	|	УчетЗатрат.ЗаказПокупателя,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета,
	|	УчетЗатрат.КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика,
	|	УчетЗатрат.КоррПартия,
	//Малышев 2024-07-22   ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатрат.КоррПроект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА УчетЗатрат.КоррПроект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ,      
	//Малышев 2024-07-22   ONESOFT-3227 --)
	|	УчетЗатрат.КоррЗаказПокупателя,
	|	УчетЗатрат.ДокументПродажи,
	|	УчетЗатрат.ЗаказПродажи,
	|	УчетЗатрат.Подразделение,
	|	УчетЗатрат.Ответственный,
	|	УчетЗатрат.СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	//+++ Дмгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|			ТОГДА ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл.ТипСчета
	|					ИНАЧЕ УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|				КОНЕЦ
	//--- Дмгг
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	//+++ Дмгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|			ТОГДА ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл.ТипСчета
	|					ИНАЧЕ УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|				КОНЕЦ
	//--- Дмгг
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.НаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|		ИНАЧЕ УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ПеремещениеВРозницуСуммовойУчет
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет,
	|	УчетЗатрат.Номенклатура.КатегорияНоменклатуры,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл,
	//+++
	//|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета,
	//|	УчетЗатрат.СчетУчета.ТипСчета,
	//|	УчетЗатрат.КоррСчетУчета.ТипСчета,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.СчетУчетаРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.СчетУчета.ТипСчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.КоррСчетУчетаРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.КоррСчетУчета.ТипСчета
	|	КОНЕЦ,
	//--- Дмгг
	|	УчетЗатрат.СчетУчетаРегл,
	|	УчетЗатрат.КоррСчетУчетаРегл
	//+++ Дмгг, 10.04.2025, ONESOFT-3970
	|,	УчетЗатрат.Спецификация,
	|	УчетЗатрат.КоррСпецификация 
	//--- Дмгг, 10.04.2025, ONESOFT-3970
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	Проект,  //
	|	ЗаказПокупателя,
	|	КоррСтруктурнаяЕдиница,
	|	КоррСчетУчета,
	|	КоррНоменклатура,
	|	КоррХарактеристика,
	|	КоррПартия,
	|	КоррПроект, //
	|	КоррЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("УчетПоПроектам", ДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//Малышев 2024-07-30 (-
	Запрос.УстановитьПараметр("СебестоимостьЗапасовПоПроектам", ПолучитьПризнак_СебестоимостьЗапасовПоПроектам(ДополнительныеСвойства));
	//Малышев 2024-07-30 -)
		
	Запрос.Выполнить();
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 октября 2021 г.]  НАЧАЛО
	Запрос.УстановитьПараметр("УчетСебестоимостиВРазрезеОрганизации", УчетСебестоимостиВРазрезеОрганизации);	
	// © Шишка В.В. [1 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	//+++ Мирошниченко Р.К. 19-08-2024
	Запрос.УстановитьПараметр("ГраницаДатаКон", Новый Граница(ДатаКон, ВидГраницы.Включая));

    Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	ЗапасыОстатки.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл, //Малышев 2024-08-27 ONESOFT-3441 - закоментировал
	//|	ЗапасыОстатки.Проект КАК Проект,
	//Малышев 2024-08-27   ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА ЗапасыОстатки.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА ЗапасыОстатки.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ как Проект,      
	//Малышев 2024-08-27   ONESOFT-3227 --)
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ УчетЗатратОстатки
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(&ГраницаДатаКон, Организация = &Организация) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	СчетУчетаРегл,
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА ЗапасыОстатки.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА ЗапасыОстатки.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ 
	|
	|ИМЕЮЩИЕ СУММА(ЗапасыОстатки.КоличествоОстаток) >0 или СУММА(ЗапасыОстатки.СуммаОстаток)>0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	СчетУчетаРегл,
	//|	СчетУчетаЗатратРегл, //Малышев 2024-09-05 ONESOFT-3441 - закоментировал
	|	Проект 
	|;
	|ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	ЗапасыОстатки.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,  //Малышев 2024-09-05 ONESOFT-3441 - закоментировал
	//|	ЗапасыОстатки.Проект КАК Проект,
	//Малышев 2024-08-27   ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА ЗапасыОстатки.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА ЗапасыОстатки.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ как Проект,      
	//Малышев 2024-08-27   ONESOFT-3227 --)
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ УчетЗатратОстаткиКор
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(&ГраницаДатаКон, ) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	Проект,  //Малышев 2024-09-05 ONESOFT-3227
	|	ЗаказПокупателя,
	|	СчетУчетаРегл,
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА ЗапасыОстатки.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА ЗапасыОстатки.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ  
	|
	|ИМЕЮЩИЕ СУММА(ЗапасыОстатки.КоличествоОстаток) >0 или СУММА(ЗапасыОстатки.СуммаОстаток)>0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	Проект,  //Малышев 2024-09-05 ONESOFT-3227
	|	ЗаказПокупателя,
	|	СчетУчетаРегл,
	//|	СчетУчетаЗатратРегл, //Малышев 2024-09-05 ONESOFT-3441 - закоментировал
	|	Проект
	|;";
	
	//Запрос.Выполнить();
	
	//---

	
	
	// Определяются направления списания всех сумм меньше рубля, для узлов по которым
	// есть остатки по суммам и без количества.
	Запрос.Текст = Запрос.Текст + 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""РаспределитьСуммыБезКоличества"" КАК Поле1,
	|	УчетЗатратОстатки.Организация КАК Организация,
	|	УчетЗатратОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратОстатки.СчетУчета КАК СчетУчета,
	|	УчетЗатратОстатки.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
	|	УчетЗатратОстатки.Номенклатура КАК Номенклатура,
	|	УчетЗатратОстатки.Характеристика КАК Характеристика,
	|	УчетЗатратОстатки.Партия КАК Партия, 
	//Малышев 2024-07-22   ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатратОстатки.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА УчетЗатратОстатки.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ как Проект,      
	//Малышев 2024-07-22   ONESOFT-3227 --)
	|	УчетЗатратОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА УчетЗатратОстатки.КоличествоОстаток = 0
	|				И ВложенныйЗапрос.Сумма <> 0
	|				И (УчетЗатратОстатки.СуммаОстаток МЕЖДУ -1 И 1
	|					ИЛИ УчетЗатратОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|			ТОГДА УчетЗатратОстатки.СуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	ВложенныйЗапрос.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,    
	//+++ Дмгг, 10.04.2025, ONESOFT-3970
	//|	НЕОПРЕДЕЛЕНО КАК Спецификация,
	//|	НЕОПРЕДЕЛЕНО КАК КоррСпецификация,
	|	ВложенныйЗапрос.Спецификация КАК Спецификация, 
	|	ВложенныйЗапрос.КоррСпецификация КАК КоррСпецификация,
	//--- Дмгг, 10.04.2025, ONESOFT-3970
	|	ВложенныйЗапрос.КоррСчетУчета КАК КоррСчетУчета,
	|	ВложенныйЗапрос.КоррСчетУчетаТипСчета КАК КоррСчетУчетаТипСчета,
	|	ВложенныйЗапрос.КоррНоменклатура КАК КоррНоменклатура,
	|	ВложенныйЗапрос.КоррХарактеристика КАК КоррХарактеристика,
	|	ВложенныйЗапрос.КоррПартия КАК КоррПартия,
	
	//Малышев 2024-07-22   ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА ВложенныйЗапрос.КоррПроект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА ВложенныйЗапрос.КоррПроект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ как КоррПроект,      
	//Малышев 2024-07-22   ONESOFT-3227 --)
		
	|	ВложенныйЗапрос.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	ВложенныйЗапрос.ДокументПродажи КАК ДокументПродажи,
	|	ВложенныйЗапрос.ЗаказПродажи КАК ЗаказПродажи,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.Ответственный КАК Ответственный,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	|	ВложенныйЗапрос.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	ВложенныйЗапрос.НоменклатураКатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
	|	ВложенныйЗапрос.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельностиПродажи,
	|	ВложенныйЗапрос.НаправлениеДеятельностиСписания КАК НаправлениеДеятельностиСписания,
	|	ВложенныйЗапрос.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|	ВложенныйЗапрос.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	УзлыКорректировкиСтоимостиСписанияИсточник.НомерУзла КАК НомерУзлаИсточник,
	|	ВложенныйЗапрос.СчетУчетаСписания КАК СчетУчетаСписания,
	|	ВложенныйЗапрос.СчетУчетаСписанияРегл КАК СчетУчетаСписанияРегл,
	|	ВложенныйЗапрос.СчетУчетаСписанияТипСчета КАК СчетУчетаСписанияТипСчета,
	|	ВложенныйЗапрос.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
	|	ВложенныйЗапрос.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	|	ВложенныйЗапрос.РозничнаяСтруктурнаяЕдиница КАК РозничнаяСтруктурнаяЕдиница,
	|	УчетЗатратОстаткиКор.КоличествоОстаток КАК КоличествоОстаток,
	|	УчетЗатратОстатки.СчетУчетаРегл,
	|	ВложенныйЗапрос.КоррСчетУчетаРегл,
	|	ВложенныйЗапрос.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 октября 2021 г.]  НАЧАЛО
	|	, &УчетСебестоимостиВРазрезеОрганизации КАК УчетСебестоимостиВРазрезеОрганизации	
	// © Шишка В.В. [1 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	|ИЗ
	//+++ Мирошниченко
	//|	РегистрНакопления.Запасы.Остатки(&ГраницаДатаКон, Организация = &Организация) КАК УчетЗатратОстатки
	|	УчетЗатратОстатки КАК УчетЗатратОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетЗатратДвиженияРасход КАК ВложенныйЗапрос
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(&ГраницаДатаКон, ) КАК УчетЗатратОстаткиКор
	|			ЛЕВОЕ СОЕДИНЕНИЕ УчетЗатратОстаткиКор КАК УчетЗатратОстаткиКор
	//--- Мирошниченко
	|			ПО ВложенныйЗапрос.Организация = УчетЗатратОстаткиКор.Организация
	|				И ВложенныйЗапрос.КоррСтруктурнаяЕдиница = УчетЗатратОстаткиКор.СтруктурнаяЕдиница
	//|				И ВложенныйЗапрос.КоррСчетУчета = УчетЗатратОстаткиКор.СчетУчета //+++ ДМгг
	|				И ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА ВложенныйЗапрос.КоррСчетУчетаРегл = УчетЗатратОстаткиКор.СчетУчетаРегл
	|					ИНАЧЕ ВложенныйЗапрос.КоррСчетУчета = УчетЗатратОстаткиКор.СчетУчета
	|				КОНЕЦ
	//--- Дмгг
	|				И ВложенныйЗапрос.КоррНоменклатура = УчетЗатратОстаткиКор.Номенклатура
	|				И ВложенныйЗапрос.КоррХарактеристика = УчетЗатратОстаткиКор.Характеристика
	|				И ВложенныйЗапрос.КоррПартия = УчетЗатратОстаткиКор.Партия
	|				И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ или ВложенныйЗапрос.КоррПроект = УчетЗатратОстаткиКор.Проект)        //Малышев 2024-06-19   ONESOFT-3227
	|				И ВложенныйЗапрос.КоррЗаказПокупателя = УчетЗатратОстаткиКор.ЗаказПокупателя 
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|			ПО ВложенныйЗапрос.Организация = УзлыКорректировкиСтоимостиСписания.Организация
	|				И ВложенныйЗапрос.КоррСтруктурнаяЕдиница = УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница
	//|				И ВложенныйЗапрос.КоррСчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета //--- Дмгг
	|				И ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА ВложенныйЗапрос.КоррСчетУчетаРегл = УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл
	|					ИНАЧЕ ВложенныйЗапрос.КоррСчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета
	|				КОНЕЦ
	//--- Дмгг
	|				И ВложенныйЗапрос.КоррНоменклатура = УзлыКорректировкиСтоимостиСписания.Номенклатура
	|				И ВложенныйЗапрос.КоррХарактеристика = УзлыКорректировкиСтоимостиСписания.Характеристика
	|				И ВложенныйЗапрос.КоррПартия = УзлыКорректировкиСтоимостиСписания.Партия
	|				И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ или ВложенныйЗапрос.КоррПроект = УзлыКорректировкиСтоимостиСписания.Проект)     //Малышев 2024-06-19   ONESOFT-3227
	|				И ВложенныйЗапрос.КоррЗаказПокупателя = УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя
	|				И (УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор)
	|		ПО УчетЗатратОстатки.Организация = ВложенныйЗапрос.Организация
	|			И УчетЗатратОстатки.СтруктурнаяЕдиница = ВложенныйЗапрос.СтруктурнаяЕдиница
	//|			И УчетЗатратОстатки.СчетУчета = ВложенныйЗапрос.СчетУчета //+++ Дмгг
	|			И ВЫБОР
	|				КОГДА &ЗакрыватьПоРеглПлануСчетов
	|					ТОГДА УчетЗатратОстатки.СчетУчетаРегл = ВложенныйЗапрос.СчетУчетаРегл
	|				ИНАЧЕ  УчетЗатратОстатки.СчетУчета = ВложенныйЗапрос.СчетУчета
	|			КОНЕЦ
	//--- Дмгг
	|			И УчетЗатратОстатки.Номенклатура = ВложенныйЗапрос.Номенклатура
	|			И УчетЗатратОстатки.Характеристика = ВложенныйЗапрос.Характеристика
	|			И УчетЗатратОстатки.Партия = ВложенныйЗапрос.Партия
	|			И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ или УчетЗатратОстатки.Проект = ВложенныйЗапрос.Проект)     //Малышев 2024-06-19   ONESOFT-3227
	|			И УчетЗатратОстатки.ЗаказПокупателя = ВложенныйЗапрос.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписанияИсточник
	|		ПО (УзлыКорректировкиСтоимостиСписанияИсточник.Регистратор = &Регистратор)
	|			И УчетЗатратОстатки.Организация = УзлыКорректировкиСтоимостиСписанияИсточник.Организация
	|			И УчетЗатратОстатки.СтруктурнаяЕдиница = УзлыКорректировкиСтоимостиСписанияИсточник.СтруктурнаяЕдиница
	//|			И УчетЗатратОстатки.СчетУчета = УзлыКорректировкиСтоимостиСписанияИсточник.СчетУчета //+++ Дмгг
	|			И ВЫБОР
	|				КОГДА &ЗакрыватьПоРеглПлануСчетов
	|					ТОГДА УчетЗатратОстатки.СчетУчетаРегл = УзлыКорректировкиСтоимостиСписанияИсточник.СчетУчетаРегл
	|				ИНАЧЕ УчетЗатратОстатки.СчетУчета = УзлыКорректировкиСтоимостиСписанияИсточник.СчетУчета
	|			КОНЕЦ
	//--- Дмгг
	|			И УчетЗатратОстатки.Номенклатура = УзлыКорректировкиСтоимостиСписанияИсточник.Номенклатура
	|			И УчетЗатратОстатки.Характеристика = УзлыКорректировкиСтоимостиСписанияИсточник.Характеристика
	|			И УчетЗатратОстатки.Партия = УзлыКорректировкиСтоимостиСписанияИсточник.Партия
	|			И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ или УчетЗатратОстатки.Проект = УзлыКорректировкиСтоимостиСписанияИсточник.Проект)    //Малышев 2024-06-19   ONESOFT-3227
	|			И УчетЗатратОстатки.ЗаказПокупателя = УзлыКорректировкиСтоимостиСписанияИсточник.ЗаказПокупателя
	|ГДЕ
	|	УчетЗатратОстатки.СуммаОстаток <> 0
	|	И УчетЗатратОстатки.КоличествоОстаток = 0
	|	И ВложенныйЗапрос.Сумма <> 0
	|	И (УчетЗатратОстатки.СуммаОстаток МЕЖДУ -1 И 1
	|			ИЛИ УчетЗатратОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|	И УчетЗатратОстатки.СуммаОстаток <> 0
	//|	И НЕ ВложенныйЗапрос.СчетУчета ЕСТЬ NULL //+++ Дмгг
	|	И ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА НЕ ВложенныйЗапрос.СчетУчетаРегл ЕСТЬ NULL
	|		ИНАЧЕ НЕ ВложенныйЗапрос.СчетУчета ЕСТЬ NULL
	|	КОНЕЦ
	//--- Дмгг
	|	И НЕ ЕСТЬNULL(УзлыКорректировкиСтоимостиСписанияИсточник.НомерУзла, 0) = ЕСТЬNULL(УзлыКорректировкиСтоимостиСписания.НомерУзла, 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоОстаток УБЫВ,
	|	ВЫБОР
	|		КОГДА УзлыКорректировкиСтоимостиСписания.НомерУзла В (&СписокОбработанныхУзлов)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ УБЫВ";
	
	Запрос.УстановитьПараметр("ГраницаДатаКон", Новый Граница(ДатаКон, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("СписокОбработанныхУзлов", СписокОбработанныхУзлов);
	Запрос.УстановитьПараметр("ЗакрыватьПоРеглПлануСчетов", ИспользоватьТолькоРегламентированныйПланСчетов);
	
	// Создадим набор записей регистра накопления Учет запасов и затрат.
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Продажи.
	НаборЗаписейПродажи = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НаборЗаписейПродажи.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления СуммовойУчетВРознице.
	НаборЗаписейСуммовойУчетВРознице = РегистрыНакопления.СуммовойУчетВРознице.СоздатьНаборЗаписей();
	НаборЗаписейСуммовойУчетВРознице.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра бухгалтерии НаборЗаписейУправленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Хозрасчетный.
	НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);	
	
	КоличествоИтераций = 0;
	Количество4 = 0;
	
	Результат = Запрос.Выполнить();
	
	СтруктураПараметровРегл = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(ДополнительныеСвойства.ДляПроведения.Организация, ДополнительныеСвойства.ДляПроведения.Дата);
	Если СтруктураПараметровРегл.Выбран() Тогда
		СчетПрочиеДоходыРегл = СтруктураПараметровРегл.СчетПрочихДоходов;
		СчетПрочиеРасходыРегл = СтруктураПараметровРегл.СчетПрочихРасходов;
	Иначе
		СчетПрочиеДоходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		СчетПрочиеРасходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли; 
	
	Пока НЕ Результат.Пустой() Цикл
		
		КоличествоИтераций = КоличествоИтераций + 1;
		Если КоличествоИтераций > 60 Тогда
			ОписаниеОшибки = НСтр("ka='ხარჯების მიხედვით თანხობრივი ნაშთები კორექტირება ვერ მოხერხდა.';ru='Не удалось скорректировать суммовые остатки по затратам.';en='Could not adjust the accrual balances costs.'");
			ДобавитьОшибкуВТаблицу(ОписаниеОшибки, ВидОперации, ТаблицаОшибок);
			Прервать;
		КонецЕсли;
		
		//Малышев 2024-09-27 - заглушка на зацикливание
		Если Результат.Выгрузить().Количество()<=4 Тогда
			Количество4 = Количество4 + 1;
			Если Количество4>4 Тогда
				Прервать;
			КонецЕсли;	
		КонецЕсли;	

		
		НаборЗаписейЗапасы.Очистить();
		НаборЗаписейПродажи.Очистить();
		НаборЗаписейДоходыИРасходы.Очистить();
		НаборЗаписейСуммовойУчетВРознице.Очистить();
		НаборЗаписейУправленческий.Очистить();
		НаборЗаписейХозрасчетный.Очистить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		СписокОбработанныхУзловИсточников = Новый Массив();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			// Сделаем проверку, на случай, если есть не закрытые кассовые смены.
			Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЧекККМ")
				ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
				Продолжить;
			КонецЕсли;
			
			Если СписокОбработанныхУзловИсточников.Найти(ВыборкаДетальныеЗаписи.НомерУзлаИсточник) = Неопределено Тогда
				СписокОбработанныхУзловИсточников.Добавить(ВыборкаДетальныеЗаписи.НомерУзлаИсточник);
			Иначе
				Продолжить; // Этот источник уже скорректировали.
			КонецЕсли;
			
			Если СписокОбработанныхУзлов.Найти(ВыборкаДетальныеЗаписи.НомерУзла) = Неопределено Тогда
				СписокОбработанныхУзлов.Добавить(ВыборкаДетальныеЗаписи.НомерУзла);
			КонецЕсли;
			
			СуммаКорректировки = ВыборкаДетальныеЗаписи.Сумма;
			
			СформироватьДвиженияПоРегиструУчетаЗатрат(
				НаборЗаписейЗапасы,
				НаборЗаписейУправленческий,
				НаборЗаписейХозрасчетный,
				ВыборкаДетальныеЗаписи,
				СуммаКорректировки,
				Ложь,
			);
			
			Если ВыборкаДетальныеЗаписи.КоррСчетУчета = ДополнительныеСвойства.ДляПроведения.ПустойСчет
				ИЛИ ВыборкаДетальныеЗаписи.КоррСчетУчетаРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка() Тогда
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи)
				   И ((ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.РасходнаяНакладная")
					 И ВыборкаДетальныеЗаписи.ДокументПродажи.ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.АктВыполненныхРабот")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетКомиссионера")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЗаказПокупателя")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетОПереработке")) Тогда
					
					// Движения по регистру Продажи.
					НоваяСтрока = НаборЗаписейПродажи.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
					НоваяСтрока.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
					НоваяСтрока.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
					НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
					НоваяСтрока.Партия = ВыборкаДетальныеЗаписи.Партия;
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;   //Малышев 2024-06-19   ONESOFT-3227
					НоваяСтрока.Документ = ВыборкаДетальныеЗаписи.ДокументПродажи;
					НоваяСтрока.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
					НоваяСтрока.Себестоимость = СуммаКорректировки;
					
					// Движения по регистру ДоходыИРасходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.Подразделение;
					НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
					НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажи;
					НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
					НоваяСтрока.СчетУчетаРегл = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
					НоваяСтрока.СуммаРасходов = СуммаКорректировки;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='რეალიზაციისას ხარჯების ასახვა';ru='Отражение расходов по продаже';en='Reflection selling expenses'");
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;   //Малышев 2024-06-19   ONESOFT-3227
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='რეალიზაციისას ხარჯების ასახვა';ru='Отражение расходов по продаже';en='Reflection selling expenses'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					
				ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи)
						И ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.РасходнаяНакладная")
						И ВыборкаДетальныеЗаписи.ДокументПродажи.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда
						
					// Движения по регистру Доходы и расходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = ДополнительныеСвойства.ДляПроведения.Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = Неопределено;
					НоваяСтрока.ЗаказПокупателя = Неопределено;
					НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрока.СчетУчетаРегл = СчетПрочиеРасходыРегл;
						НоваяСтрока.СуммаРасходов = СуммаКорректировки;
						НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა ხარჯები მომწოდებლისთვის დაბრუნებისას';ru='Прочие расходы по возврату поставщику';en='Other expenses for return to the supplier'");
					Иначе
						НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрока.СчетУчетаРегл = СчетПрочиеДоходыРегл;
						НоваяСтрока.СуммаДоходов = СуммаКорректировки;
						НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა შემოსავლები მომწოდებლისთვის დაბრუნებისას';ru='Прочие доходы по возврату поставщику';en='Other income for return to the supplier'");
					Конецесли;
					НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;    //Малышев 2024-06-19   ONESOFT-3227
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетДт = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.Сумма = - СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები მომწოდებლისთვის დაბრუნებისას';ru='Прочие расходы по возврату поставщику';en='Other expenses for return to the supplier'");
					Иначе
						НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.СчетКт = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрока.Сумма = СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა შემოსავლები მომწოდებლისთვის დაბრუნებისას';ru='Прочие доходы по возврату поставщику';en='Other income for return to the supplier'");
					КонецЕсли;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
										
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетДт = СчетПрочиеРасходыРегл;
						НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
						НоваяСтрока.Сумма = - СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები მომწოდებლისთვის დაბრუნებისას';ru='Прочие расходы по возврату поставщику';en='Other expenses for return to the supplier'");
					Иначе
						НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
						НоваяСтрока.СчетКт = СчетПрочиеДоходыРегл;
						НоваяСтрока.Сумма = СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა შემოსავლები მომწოდებლისთვის დაბრუნებისას';ru='Прочие доходы по возврату поставщику';en='Other income for return to the supplier'");
					КонецЕсли;
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
					
				ИначеЕсли ВыборкаДетальныеЗаписи.ПеремещениеВРозницуСуммовойУчет Тогда
					
					// Движения по регистру СуммовойУчетВРознице.
					НоваяСтрока = НаборЗаписейСуммовойУчетВРознице.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница;
					НоваяСтрока.Валюта = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Себестоимость = СуммаКорректировки;
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.СчетУчетаВРознице;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.СчетУчетаВРозницеРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
				
				ИначеЕсли ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы
					  ИЛИ ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.Расходы
					  ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяРасходным(ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл) Тогда
					
					// Движения по регистру Доходы и расходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = ДополнительныеСвойства.ДляПроведения.Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.СтруктурнаяЕдиницаПолучатель;
					
					Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ПеремещениеЗапасов")
					   И ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
						НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиСписания;
						НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПокупателя;
					Иначе
						НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					КонецЕсли;
					
					НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.СчетУчетаРегл = ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл;
					НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;       //Малышев 2024-06-19   ONESOFT-3227
					НоваяСтрока.СуммаРасходов = СуммаКорректировки;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
				
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
				
				Иначе
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='მარაგების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание запасов на произвольный счет';en='The write-downs on an arbitrary score'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					//+++ Пока что костыль
					Если ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл = ДополнительныеСвойства.ДляПроведения.ПустойСчетРегл 
						ИЛИ ВыборкаДетальныеЗаписи.СчетУчетаРегл = ДополнительныеСвойства.ДляПроведения.ПустойСчетРегл Тогда 
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='მარაგების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание запасов на произвольный счет';en='The write-downs on an arbitrary score'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
				
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
				
					КонецЕсли; //+++ Дмгг
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НаборЗаписейЗапасы.Записать(Ложь);
		НаборЗаписейПродажи.Записать(Ложь);
		НаборЗаписейДоходыИРасходы.Записать(Ложь);
		НаборЗаписейСуммовойУчетВРознице.Записать(Ложь);
		Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда  //+++ Дмгг
			НаборЗаписейУправленческий.Записать(Ложь);
		КонецЕсли;  //--- Дмгг
		НаборЗаписейХозрасчетный.Записать(Ложь);
		
		Если КоличествоИтераций = 15 ИЛИ КоличествоИтераций = 30 ИЛИ КоличествоИтераций = 45 Тогда
			// Сброс списка отработанных узлов.
			СписокОбработанныхУзлов.Очистить();
			СписокОбработанныхУзлов.Добавить("");
		КонецЕсли;
		
		УдалимВременнуюТаблицу(Запрос.МенеджерВременныхТаблиц,"УчетЗатратОстатки");
		УдалимВременнуюТаблицу(Запрос.МенеджерВременныхТаблиц,"УчетЗатратОстаткиКор");
		
		Запрос.УстановитьПараметр("СписокОбработанныхУзлов", СписокОбработанныхУзлов);
		Результат = Запрос.Выполнить();
		
	КонецЦикла;
	
	//+++ Мирошниченко Р.К. 19-08-2024
	//Запрос.Текст = "УНИЧТОЖИТЬ УчетЗатратДвиженияРасход";
	//Запрос.Текст = "УНИЧТОЖИТЬ УчетЗатратДвиженияРасход;УНИЧТОЖИТЬ УчетЗатратОстатки;УНИЧТОЖИТЬ УчетЗатратОстаткиКор";
	//Запрос.Выполнить();
	УдалимВременнуюТаблицу(Запрос.МенеджерВременныхТаблиц,"УчетЗатратДвиженияРасход");
	УдалимВременнуюТаблицу(Запрос.МенеджерВременныхТаблиц,"УчетЗатратОстатки");
	УдалимВременнуюТаблицу(Запрос.МенеджерВременныхТаблиц,"УчетЗатратОстаткиКор");
	//---	
	
КонецПроцедуры

&Вместо("РассчитатьСтоимостьВозвратов")
Процедура AzRyFix_РассчитатьСтоимостьВозвратов()

	Если Не AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца Тогда		
		ПродолжитьВызов();
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Запасы.Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.FIFO)
	|			ТОГДА Запасы.Период
	|		ИНАЧЕ КОНЕЦПЕРИОДА(Запасы.Период, МЕСЯЦ)
	|	КОНЕЦ КАК Период,
	|	Запасы.Организация КАК Организация,
	|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Запасы.СчетУчета КАК СчетУчета,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия,
	|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	Запасы.ЗаказПродажи КАК ЗаказПродажи,
	|	Запасы.СтавкаНДС КАК СтавкаНДС,
	|	Запасы.ДокументПродажи КАК ДокументПродажи,
	|	Запасы.Подразделение КАК Подразделение,
	|	Запасы.КоррСчетУчета КАК КоррСчетУчета,
	|	Запасы.Ответственный КАК Ответственный,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(Запасы.ДокументПродажи.Дата, МЕСЯЦ) < КОНЕЦПЕРИОДА(Запасы.Период, МЕСЯЦ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратПрошлогоПериода,
	|	-СУММА(Запасы.Количество) КАК Количество,
	|	-СУММА(Запасы.Сумма) КАК Сумма,
	|	Запасы.СчетУчетаРегл,
	|	Запасы.КоррСчетУчетаРегл
	|ПОМЕСТИТЬ ВтВозвраты
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Возврат
	|	И Запасы.Организация = &Организация
	|	И ВЫБОР
	|			КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|				ТОГДА Запасы.КоррСчетУчетаРегл = &ПустойСчетРегл
	|			ИНАЧЕ Запасы.КоррСчетУчета = &ПустойСчет
	|		КОНЕЦ
	|	И Запасы.ДокументПродажи <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА Запасы.Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.FIFO)
	|			ТОГДА Запасы.Период
	|		ИНАЧЕ КОНЕЦПЕРИОДА(Запасы.Период, МЕСЯЦ)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(Запасы.ДокументПродажи.Дата, МЕСЯЦ) < КОНЕЦПЕРИОДА(Запасы.Период, МЕСЯЦ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Запасы.Организация,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.СчетУчета,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия,
	|	Запасы.ЗаказПокупателя,
	|	Запасы.ЗаказПродажи,
	|	Запасы.СтавкаНДС,
	|	Запасы.ДокументПродажи,
	|	Запасы.Подразделение,
	|	Запасы.КоррСчетУчета,
	|	Запасы.Ответственный,
	|	Запасы.СчетУчетаРегл,
	|	Запасы.КоррСчетУчетаРегл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВозвратов.Период КАК Период,
	|	ИСТИНА КАК Возврат,
	|	&Организация КАК Организация,
	|	ТаблицаВозвратов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВозвратов.СчетУчета КАК СчетУчета,
	|	ТаблицаВозвратов.Номенклатура КАК Номенклатура,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельностиПродажи,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
	|		ИНАЧЕ УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат
	|	КОНЕЦ КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
	|	ТаблицаВозвратов.Характеристика КАК Характеристика,
	|	ТаблицаВозвратов.Партия КАК Партия,
	|	ТаблицаВозвратов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаВозвратов.ЗаказПродажи КАК ЗаказПродажи,
	|	ТаблицаВозвратов.Количество КАК КоличествоВозвратов,
	|	ТаблицаВозвратов.Сумма КАК СуммаВозвратов,
	|	ТаблицаВозвратов.ДокументПродажи КАК ДокументПродажи,
	|	ТаблицаВозвратов.Подразделение КАК Подразделение,
	|	ТаблицаВозвратов.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаВозвратов.Ответственный КАК Ответственный,
	|	ТаблицаВозвратов.ЭтоВозвратПрошлогоПериода КАК ЭтоВозвратПрошлогоПериода,
	|	&ПустойСчет КАК КоррСчетУчета,
	|	&ПустойСчетРегл КАК КоррСчетУчетаРегл,
	|	СУММА(ТаблицаПродажи.Количество) КАК КоличествоПродаж,
	|	СУММА(ТаблицаПродажи.Сумма) КАК СуммаПродаж,
	|	ТаблицаВозвратов.СчетУчетаРегл КАК СчетУчетаРегл
	|ИЗ
	|	ВтВозвраты КАК ТаблицаВозвратов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК ТаблицаПродажи
	|		ПО ТаблицаВозвратов.Номенклатура = ТаблицаПродажи.Номенклатура
	|			И ТаблицаВозвратов.Характеристика = ТаблицаПродажи.Характеристика
	|			И ТаблицаВозвратов.Партия = ТаблицаПродажи.Партия
	|			И ТаблицаВозвратов.ЗаказПродажи = ТаблицаПродажи.ЗаказПродажи
	|			И (ТаблицаПродажи.Организация = &Организация)
	|			И ТаблицаВозвратов.ДокументПродажи = ТаблицаПродажи.ДокументПродажи
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА ТаблицаВозвратов.СчетУчетаРегл = ТаблицаПродажи.СчетУчетаРегл
	|				ИНАЧЕ ТаблицаВозвратов.СчетУчета = ТаблицаПродажи.СчетУчета
	|			КОНЕЦ)
	|			И ТаблицаВозвратов.СтавкаНДС = ТаблицаПродажи.СтавкаНДС
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА ТаблицаПродажи.КоррСчетУчетаРегл = &ПустойСчетРегл
	|				ИНАЧЕ ТаблицаПродажи.КоррСчетУчета = &ПустойСчет
	|			КОНЕЦ)
	|			И (ТаблицаПродажи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И (НЕ ТаблицаПродажи.Возврат),
	|	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УчетнаяПолитикаРеглСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВозвратов.Период,
	|	ТаблицаВозвратов.СтруктурнаяЕдиница,
	|	ТаблицаВозвратов.СчетУчета,
	|	ТаблицаВозвратов.Номенклатура,
	|	ТаблицаВозвратов.Характеристика,
	|	ТаблицаВозвратов.Партия,
	|	ТаблицаВозвратов.ЗаказПокупателя,
	|	ТаблицаВозвратов.ЗаказПродажи,
	|	ТаблицаВозвратов.Количество,
	|	ТаблицаВозвратов.Сумма,
	|	ТаблицаВозвратов.ДокументПродажи,
	|	ТаблицаВозвратов.Подразделение,
	|	ТаблицаВозвратов.СтавкаНДС,
	|	ТаблицаВозвратов.Ответственный,
	|	ТаблицаВозвратов.ЭтоВозвратПрошлогоПериода,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж,
	|	ТаблицаВозвратов.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
	|		ИНАЧЕ УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	(ВЫРАЗИТЬ(СУММА(ТаблицаПродажи.Сумма) - ТаблицаВозвратов.Сумма КАК ЧИСЛО(15, 2))) <> 0");
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПустойСчет", ДополнительныеСвойства.ДляПроведения.ПустойСчет);
	Запрос.УстановитьПараметр("ПустойСчетРегл", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("КонецПериода", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Корректировка стоимости.
	
	// Создадим набор записей регистра накопления Учет запасов и затрат.
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Продажи.
	НаборЗаписейПродажи = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НаборЗаписейПродажи.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Управленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Хозрасчетный.
	НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);

	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.КоличествоПродаж = 0 Тогда
			СуммаКорректировки = 0;
		Иначе
			ЦенаПродажи = ВыборкаДетальныеЗаписи.СуммаПродаж / ВыборкаДетальныеЗаписи.КоличествоПродаж;
			СуммаВозвратов = ЦенаПродажи * ВыборкаДетальныеЗаписи.КоличествоВозвратов;
			СуммаКорректировки = ВыборкаДетальныеЗаписи.СуммаВозвратов - ЦенаПродажи * ВыборкаДетальныеЗаписи.КоличествоВозвратов;
		КонецЕсли;
		
		Если (НЕ Окр(СуммаКорректировки, 2) = 0) Тогда
			
			// Движения по регистру Учет запасов и затрат.
			СформироватьДвиженияПоРегиструУчетаЗатрат(
				НаборЗаписейЗапасы,
				НаборЗаписейУправленческий,
				НаборЗаписейХозрасчетный,
				ВыборкаДетальныеЗаписи,
				СуммаКорректировки,
				ВыборкаДетальныеЗаписи.ЭтоВозвратПрошлогопериода, // возвраты прошлого периода по фиксированной стоимости
				НСтр("ka='მყიდველისგან დაბრუნების თვითღირებულება';ru='Себестоимость возврата от покупателя';en='The cost price of the return from the buyer'")
			);
			
			// Движения по регистру Продажи.
			НоваяСтрока = НаборЗаписейПродажи.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.Регистратор = Ссылка;
			НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
			НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
			НоваяСтрока.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
			НоваяСтрока.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
			НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			НоваяСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
			НоваяСтрока.Партия = ВыборкаДетальныеЗаписи.Партия;
			НоваяСтрока.Документ = ВыборкаДетальныеЗаписи.ДокументПродажи;
			НоваяСтрока.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
			НоваяСтрока.Себестоимость = СуммаКорректировки;
			
			// Движения по регистру ДоходыИРасходы.
			НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.Регистратор = Ссылка;
			НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
			НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.Подразделение;
			НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
			НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажи;
			НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
			НоваяСтрока.СчетУчетаРегл = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
			НоваяСтрока.СуммаРасходов = СуммаКорректировки;
			НоваяСтрока.СодержаниеПроводки = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
			
			// Движения по регистру Управленческий.
			НоваяСтрока = НаборЗаписейУправленческий.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.Регистратор = Ссылка;
			НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
			НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
			НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
			НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
			НоваяСтрока.Содержание = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
			НоваяСтрока.Сумма = СуммаКорректировки;
			
			// Движения по регистру Хозрасчетный.
			НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.Регистратор = Ссылка;
			НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
			//НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
			//НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
			НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
			НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
			НоваяСтрока.Содержание = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
			//НоваяСтрока.Сумма = СуммаКорректировки;
			НоваяСтрока.Сумма = -СуммаКорректировки;
						
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
			
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Пишем оставшиеся записи Учет запасов и затрат.
	НаборЗаписейЗапасы.Записать(Ложь);
	
	// Пишем оставшиеся записи Продажи.
	НаборЗаписейПродажи.Записать(Ложь);
	
	// Пишем оставшиеся записи Учет доходов и расходов.
	НаборЗаписейДоходыИРасходы.Записать(Ложь);
	
	// Пишем оставшиеся записи Управленческий.
	Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда  //+++ Дмгг
		НаборЗаписейУправленческий.Записать(Ложь);
	КонецЕсли;  //--- Дмгг
	
	// Пишем оставшиеся записи Хозрасчетный.
	НаборЗаписейХозрасчетный.Записать(Ложь);	
	
КонецПроцедуры

&Вместо("СформироватьТаблицуБазыРаспределения")
Функция AzRyFix_СформироватьТаблицуБазыРаспределения(БазаРаспределения, МассивСчетовУчета, ФильтрПоСтруктурнаяЕдиница, ФильтрПоЗаказ, СчетНезавершенноеПроизводство)
		
	Если Не AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца Тогда		
		Результат = ПродолжитьВызов(БазаРаспределения, МассивСчетовУчета, ФильтрПоСтруктурнаяЕдиница, ФильтрПоЗаказ, СчетНезавершенноеПроизводство);
		Возврат Результат;
	КонецЕсли;
		
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Если БазаРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемВыпуска Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВыпускПродукцииОбороты.Организация КАК Организация,
		|	ВыпускПродукцииОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВыпускПродукцииОбороты.Номенклатура КАК Номенклатура,
		|	ВыпускПродукцииОбороты.Характеристика КАК Характеристика,
		|	ВыпускПродукцииОбороты.Партия КАК Партия,
		|	ВыпускПродукцииОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ВыпускПродукцииОбороты.Спецификация КАК Спецификация,
		|	ВыпускПродукцииОбороты.Номенклатура.СчетУчетаЗатрат КАК СчетУчета,
		|	ВыпускПродукцииОбороты.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаРегл,
		|	ВыпускПродукцииОбороты.Номенклатура.СчетУчетаЗатрат.ТипСчета КАК СчетУчетаТипСчета,
		|	ВыпускПродукцииОбороты.КоличествоОборот КАК База
		|ИЗ
		|	РегистрНакопления.ВыпускПродукции.Обороты(
		|			&НачДата,
		|			&КонДата,
		|			,
		|			Организация = &Организация
		|			// ФильтрПоЗаказ
		|			// ФильтрПоСтруктурнаяЕдиница
		|	) КАК ВыпускПродукцииОбороты
		|ГДЕ
		|	ВыпускПродукцииОбороты.Организация = &Организация
		|	И ВыпускПродукцииОбороты.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
		|	И ВыпускПродукцииОбороты.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоЗаказ", ?(ЗначениеЗаполнено(ФильтрПоЗаказ), "И ЗаказПокупателя В (&МассивЗаказов)", ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоСтруктурнаяЕдиница", ?(ЗначениеЗаполнено(ФильтрПоСтруктурнаяЕдиница), "И СтруктурнаяЕдиница В (&МассивСтруктурныхЕдиниц)", ""));
		
	ИначеЕсли БазаРаспределения = Перечисления.БазыРаспределенияРасходов.ПрямыеЗатраты Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	УчетЗатрат.Организация КАК Организация,
		|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	НЕОПРЕДЕЛЕНО КАК Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК Характеристика,
		|	НЕОПРЕДЕЛЕНО КАК Партия,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказПокупателя,
		|	НЕОПРЕДЕЛЕНО КАК Спецификация,
		|	УчетЗатрат.СчетУчета КАК СчетУчета,
		|	УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
		|	УчетЗатрат.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
		|	УчетЗатрат.СуммаКонечныйОстаток КАК База
		|ИЗ
		|	РегистрНакопления.Запасы.ОстаткиИОбороты(
		|			&НачДата,
		|			&КонДата,
		|			,
		|			,
		|			Организация = &Организация
		//|				И СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
		//|				И СчетУчета В (&МассивСчетовУчета)
		|				И СчетУчетаРегл = &СчетНезавершенноеПроизводство
		|			// ФильтрПоСтруктурнаяЕдиницаОбороты
		|			// ФильтрПоЗаказОбороты
		|	) КАК УчетЗатрат
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УчетЗатрат.Организация,
		|	УчетЗатрат.КоррСтруктурнаяЕдиница,
		|	УчетЗатрат.КоррНоменклатура,
		|	УчетЗатрат.КоррХарактеристика,
		|	УчетЗатрат.КоррПартия,
		|	УчетЗатрат.КоррЗаказПокупателя,
		|	УчетЗатрат.КоррСпецификация,
		|	УчетЗатрат.КоррСчетУчета,
		|	УчетЗатрат.КоррСчетУчетаРегл,
		|	УчетЗатрат.КоррСчетУчета.ТипСчета,
		|	СУММА(УчетЗатрат.Сумма)
		|ИЗ
		|	РегистрНакопления.Запасы КАК УчетЗатрат
		|ГДЕ
		|	УчетЗатрат.Период МЕЖДУ &НачДата И &КонДата
		|	И УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И УчетЗатрат.Организация = &Организация
		//|	И УчетЗатрат.СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
		//|	И УчетЗатрат.СчетУчета В(&МассивСчетовУчета)
		|	И УчетЗатрат.СчетУчетаРегл = &СчетНезавершенноеПроизводство
		|	И УчетЗатрат.ЗатратыНаВыпуск
		|	// ФильтрПоСтруктурнаяЕдиница
		|	// ФильтрПоЗаказ
		|
		|СГРУППИРОВАТЬ ПО
		|	УчетЗатрат.Организация,
		|	УчетЗатрат.КоррСтруктурнаяЕдиница,
		|	УчетЗатрат.КоррНоменклатура,
		|	УчетЗатрат.КоррХарактеристика,
		|	УчетЗатрат.КоррПартия,
		|	УчетЗатрат.КоррЗаказПокупателя,
		|	УчетЗатрат.КоррСпецификация,
		|	УчетЗатрат.КоррСчетУчета,
		|	УчетЗатрат.КоррСчетУчетаРегл,
		|	УчетЗатрат.КоррСчетУчета.ТипСчета";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоСтруктурнаяЕдиницаОбороты", ?(ЗначениеЗаполнено(ФильтрПоСтруктурнаяЕдиница), "И СтруктурнаяЕдиница В (&МассивСтруктурныхЕдиниц)", ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоЗаказОбороты", ?(ЗначениеЗаполнено(ФильтрПоЗаказ), "И ЗаказПокупателя В (&МассивЗаказов)", ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоСтруктурнаяЕдиница", ?(ЗначениеЗаполнено(ФильтрПоСтруктурнаяЕдиница), "И УчетЗатрат.КоррСтруктурнаяЕдиница В (&МассивСтруктурныхЕдиниц)", ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоЗаказ", ?(ЗначениеЗаполнено(ФильтрПоЗаказ), "И УчетЗатрат.КоррЗаказПокупателя В (&МассивЗаказов)", ""));
		
		Запрос.УстановитьПараметр("МассивСчетовУчета"			 , МассивСчетовУчета);
		Запрос.УстановитьПараметр("СчетНезавершенноеПроизводство", СчетНезавершенноеПроизводство);
		
	Иначе
		Возврат ТаблицаРезультата;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("НачДата"    , ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("КонДата"    , ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	
	Если ЗначениеЗаполнено(ФильтрПоЗаказ) Тогда
		Если ТипЗнч(ФильтрПоЗаказ) = Тип("Массив") Тогда
			Запрос.УстановитьПараметр("МассивЗаказов", ФильтрПоЗаказ);
		Иначе
			МассивДляОтбора = Новый Массив;
			МассивДляОтбора.Добавить(ФильтрПоЗаказ);
			Запрос.УстановитьПараметр("МассивЗаказов", МассивДляОтбора);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФильтрПоСтруктурнаяЕдиница) Тогда
		Если ТипЗнч(ФильтрПоСтруктурнаяЕдиница) = Тип("Массив") Тогда
			Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", ФильтрПоСтруктурнаяЕдиница);
		Иначе
			МассивДляОтбора = Новый Массив;
			МассивДляОтбора.Добавить(ФильтрПоСтруктурнаяЕдиница);
			Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", МассивДляОтбора);
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата;	
	
КонецФункции

&Вместо("РаспределитьЗатраты")
Процедура AzRyFix_РаспределитьЗатраты(Отказ, ТаблицаОшибок)
	
	Если Не AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца Тогда		
		ПродолжитьВызов(Отказ, ТаблицаОшибок);
		Возврат;
	КонецЕсли;	                              
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетЗапасовИЗатрат.Организация КАК Организация,
	|	УчетЗапасовИЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.СчетУчета КАК СчетУчета,
	//+++ Дмгг
	//|	УчетЗапасовИЗатрат.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
	//|	УчетЗапасовИЗатрат.СчетУчета.СпособРаспределения КАК СчетУчетаСпособРаспределения,
	//|	УчетЗапасовИЗатрат.СчетУчета.СчетЗакрытия КАК СчетУчетаСчетЗакрытия,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗапасовИЗатрат.СчетУчетаРегл.ТипСчета
	|		ИНАЧЕ УчетЗапасовИЗатрат.СчетУчета.ТипСчета
	|	КОНЕЦ КАК СчетУчетаТипСчета,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗапасовИЗатрат.СчетУчетаРегл.СпособРаспределения
	|		ИНАЧЕ УчетЗапасовИЗатрат.СчетУчета.СпособРаспределения
	|	КОНЕЦ КАК СчетУчетаСпособРаспределения,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗапасовИЗатрат.СчетУчетаРегл.СчетЗакрытия
	|		ИНАЧЕ УчетЗапасовИЗатрат.СчетУчета.СчетЗакрытия
	|	КОНЕЦ КАК СчетУчетаСчетЗакрытия,		
	//--- Дмгг
	|	УчетЗапасовИЗатрат.СчетУчета.СчетЗакрытия.ТипСчета КАК СчетУчетаСчетЗакрытияТипСчета,
	|	УчетЗапасовИЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗапасовИЗатрат.Характеристика КАК Характеристика,
	|	УчетЗапасовИЗатрат.Партия КАК Партия,
	|	УчетЗапасовИЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗапасовИЗатрат.СуммаОстаток КАК Сумма,
	|	УчетЗапасовИЗатрат.СчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			&КонДата,
	|			Организация = &Организация
	//+++ Дмгг
	//|				И СчетУчета.СпособРаспределения <> ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияРасходов.НеРаспределять)
	|				И ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА СчетУчетаРегл.СпособРаспределения
	|					ИНАЧЕ СчетУчета.СпособРаспределения
	|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияРасходов.НеРаспределять)
	//--- Дмгг
	//|				И (СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	//|					ИЛИ СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|				И (СчетУчетаРегл В (&СчетаКоственныхЗатрат)
	|					ИЛИ СчетУчетаРегл = &СчетНезаверПроизводство
	|						И Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК УчетЗапасовИЗатрат
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетУчетаСпособРаспределения,
	|	СтруктурнаяЕдиница,
	|	ЗаказПокупателя
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	СчетУчетаСпособРаспределения,
	|	СтруктурнаяЕдиница,
	|	ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("Организация"			 , ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("НачДата"    			 , ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("КонДата"    			 , ДополнительныеСвойства.ДляПроведения.КонечнаяГраницаПериода);
	Запрос.УстановитьПараметр("СчетаКоственныхЗатрат", РегламентированныйУчетСервер.ПолучитьСчетаКосвенныхПроизводственныхЗатрат());
	Запрос.УстановитьПараметр("ЗакрыватьПоРеглПлануСчетов", ИспользоватьТолькоРегламентированныйПланСчетов); //+++ Дмгг
	
	СтруктураПараметровРегл = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(ДополнительныеСвойства.ДляПроведения.Организация, ДополнительныеСвойства.ДляПроведения.Дата);
	Если СтруктураПараметровРегл.Выбран() Тогда
		СчетНезавершенноеПроизводство = СтруктураПараметровРегл.СчетНезавершенноеПроизводство;
	Иначе
		СчетНезавершенноеПроизводство = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СчетНезаверПроизводство", СчетНезавершенноеПроизводство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Создадим набор записей регистра накопления Учет запасов и затрат.
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(ДополнительныеСвойства.ДляПроведения.Ссылка);
	
	// Создадим набор записей регистра накопления Управленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Хозрасчетный.
	НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
	
	ОбходПоСпособРаспределения = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ОбходПоСпособРаспределения.Следующий() Цикл
		
		ОбходПоСтруктурнаяЕдиница = ОбходПоСпособРаспределения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// Обход по подразделениям.
		Пока ОбходПоСтруктурнаяЕдиница.Следующий() Цикл
			
			ФильтрПоСтруктурнаяЕдиница = ОбходПоСтруктурнаяЕдиница.СтруктурнаяЕдиница;
			ОбходПоЗаказ = ОбходПоСтруктурнаяЕдиница.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			// Обход по заказам.
			Пока ОбходПоЗаказ.Следующий() Цикл
				
				ФильтрПоЗаказ = ОбходПоЗаказ.ЗаказПокупателя;
				
				Если ОбходПоЗаказ.СчетУчетаСпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять Тогда
					Продолжить;
				КонецЕСли;
				
				ОбходПоСчетамУчета = ОбходПоЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				// Обход по счетам затрат.
				Пока ОбходПоСчетамУчета.Следующий() Цикл
					
					// Сформируем таблицу базы распределения.
					ТаблицаБазы = СформироватьТаблицуБазыРаспределения(
						ОбходПоСчетамУчета.СчетУчетаСпособРаспределения,
						ОбходПоСчетамУчета.СчетУчета.СчетаУчета.ВыгрузитьКолонку("СчетУчета"),
						ФильтрПоСтруктурнаяЕдиница,
						ФильтрПоЗаказ,
						СчетНезавершенноеПроизводство
					);
					
					Если ТаблицаБазы.Количество() = 0 Тогда
						ТаблицаБазы = СформироватьТаблицуБазыРаспределения(
							ОбходПоСчетамУчета.СчетУчетаСпособРаспределения,
							ОбходПоСчетамУчета.СчетУчета.СчетаУчета.ВыгрузитьКолонку("СчетУчета"),
							Неопределено,
							ФильтрПоЗаказ,
							СчетНезавершенноеПроизводство
						);
					КонецЕсли;
				
					// Проверим таблицу базы распределения.
					Если ТаблицаБазы.Количество() = 0 Тогда
						ОписаниеОшибки = СформироватьОписаниеОшибкиРаспределенияЗатрат(
							ОбходПоСчетамУчета.СчетУчета,
							ОбходПоСчетамУчета.СчетУчетаСпособРаспределения,
							ФильтрПоЗаказ,
							ОбходПоСчетамУчета.Сумма
						);
						ДобавитьОшибкуВТаблицу(ОписаниеОшибки, "РаспределениеЗатрат", ТаблицаОшибок, ФильтрПоЗаказ);
						Продолжить;
					КонецЕсли;
					
					ВсегоБазаРаспределения = ТаблицаБазы.Итог("База");
					КоличествоНаправлений  = ТаблицаБазы.Количество() - 1;
					
					// Распределяем сумму.
					Если ОбходПоСчетамУчета.Сумма <> 0 Тогда
						
						СуммаКРаспределению = ОбходПоСчетамУчета.Сумма;
						СуммаРаспределили = 0;
					
						Для каждого НаправлениеРаспределения Из ТаблицаБазы Цикл
							
							СуммаЗатрат = ?(СуммаКРаспределению = 0, 0, Окр(НаправлениеРаспределения.База / ВсегоБазаРаспределения * СуммаКРаспределению, 2, 1));
							СуммаРаспределили = СуммаРаспределили + СуммаЗатрат;
							
							// Если это последняя строка - скорректируем сумму в ней на ошибку округления.
							Если ТаблицаБазы.Индекс(НаправлениеРаспределения) = КоличествоНаправлений Тогда
								СуммаЗатрат = СуммаЗатрат + СуммаКРаспределению - СуммаРаспределили;
								СуммаРаспределили = СуммаРаспределили + СуммаЗатрат;
							КонецЕсли;
							
							Если СуммаЗатрат <> 0 Тогда
								
								Если ОбходПоСчетамУчета.СчетУчетаТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
									ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(ОбходПоСчетамУчета.СчетУчетаРегл) Тогда // косвенные распределяются через счет закрытия
								
									СтрокаДвижения = Новый Структура;
									СтрокаДвижения.Вставить("Организация"           , ОбходПоСчетамУчета.Организация);
									СтрокаДвижения.Вставить("СтруктурнаяЕдиница"    , ОбходПоСчетамУчета.СтруктурнаяЕдиница);
									СтрокаДвижения.Вставить("СчетУчета"             , ОбходПоСчетамУчета.СчетУчета);
									СтрокаДвижения.Вставить("СчетУчетаРегл"         , ОбходПоСчетамУчета.СчетУчетаРегл);
									СтрокаДвижения.Вставить("СчетУчетаТипСчета"     , ОбходПоСчетамУчета.СчетУчетаТипСчета);
									СтрокаДвижения.Вставить("Номенклатура"          , ОбходПоСчетамУчета.Номенклатура);
									СтрокаДвижения.Вставить("Характеристика"        , ОбходПоСчетамУчета.Характеристика);
									СтрокаДвижения.Вставить("Партия"                , ОбходПоСчетамУчета.Партия);
									СтрокаДвижения.Вставить("ЗаказПокупателя"       , ОбходПоСчетамУчета.ЗаказПокупателя);
									СтрокаДвижения.Вставить("КоррСтруктурнаяЕдиница", НаправлениеРаспределения.СтруктурнаяЕдиница);
									СтрокаДвижения.Вставить("КоррСчетУчета"         , ОбходПоСчетамУчета.СчетУчетаСчетЗакрытия);
									СтрокаДвижения.Вставить("КоррСчетУчетаРегл"     , СчетНезавершенноеПроизводство);
									СтрокаДвижения.Вставить("КоррСчетУчетаТипСчета" , ОбходПоСчетамУчета.СчетУчетаСчетЗакрытияТипСчета);
									СтрокаДвижения.Вставить("КоррНоменклатура"      , Справочники.Номенклатура.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррХарактеристика"    , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррПартия"            , Справочники.ПартииНоменклатуры.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррЗаказПокупателя"   , Документы.ЗаказПокупателя.ПустаяСсылка());
									СтрокаДвижения.Вставить("ДокументПродажи"       , Неопределено);
									СтрокаДвижения.Вставить("ЗатратыНаВыпуск"       , Ложь);
									СтрокаДвижения.Вставить("Спецификация"          , Справочники.Спецификации.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррСпецификация"      , Справочники.Спецификации.ПустаяСсылка());
									СтрокаДвижения.Вставить("СтавкаНДС"             , Справочники.СтавкиНДС.ПустаяСсылка());
									СтрокаДвижения.Вставить("Подразделение"         , ОбходПоСчетамУчета.СтруктурнаяЕдиница);
									
									// Движения по регистру Учет запасов и затрат.
									СформироватьДвиженияПоРегиструУчетаЗатрат(
										НаборЗаписейЗапасы,
										НаборЗаписейУправленческий,
										НаборЗаписейХозрасчетный,
										СтрокаДвижения,
										СуммаЗатрат,
										Истина
									);
									
									Если ЗначениеЗаполнено(НаправлениеРаспределения.Номенклатура) Тогда
										
										СтрокаДвижения = Новый Структура;
										СтрокаДвижения.Вставить("Организация"           , ОбходПоСчетамУчета.Организация);
										СтрокаДвижения.Вставить("СтруктурнаяЕдиница"    , НаправлениеРаспределения.СтруктурнаяЕдиница);
										СтрокаДвижения.Вставить("СчетУчета"             , ОбходПоСчетамУчета.СчетУчетаСчетЗакрытия);
										СтрокаДвижения.Вставить("СчетУчетаРегл"         , СчетНезавершенноеПроизводство);
										СтрокаДвижения.Вставить("СчетУчетаТипСчета"     , ОбходПоСчетамУчета.СчетУчетаСчетЗакрытияТипСчета);
										СтрокаДвижения.Вставить("Номенклатура"          , Справочники.Номенклатура.ПустаяСсылка());
										СтрокаДвижения.Вставить("Характеристика"        , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
										СтрокаДвижения.Вставить("Партия"                , Справочники.ПартииНоменклатуры.ПустаяСсылка());
										СтрокаДвижения.Вставить("ЗаказПокупателя"       , Документы.ЗаказПокупателя.ПустаяСсылка());
										СтрокаДвижения.Вставить("КоррСтруктурнаяЕдиница", НаправлениеРаспределения.СтруктурнаяЕдиница);
										СтрокаДвижения.Вставить("КоррСчетУчета"         , НаправлениеРаспределения.СчетУчета);
										СтрокаДвижения.Вставить("КоррСчетУчетаРегл"     , НаправлениеРаспределения.СчетУчетаРегл);
										СтрокаДвижения.Вставить("КоррСчетУчетаТипСчета" , НаправлениеРаспределения.СчетУчетаТипСчета);
										СтрокаДвижения.Вставить("КоррНоменклатура"      , НаправлениеРаспределения.Номенклатура);
										СтрокаДвижения.Вставить("КоррХарактеристика"    , НаправлениеРаспределения.Характеристика);
										СтрокаДвижения.Вставить("КоррПартия"            , НаправлениеРаспределения.Партия);
										СтрокаДвижения.Вставить("КоррЗаказПокупателя"   , НаправлениеРаспределения.ЗаказПокупателя);
										СтрокаДвижения.Вставить("ДокументПродажи"       , Неопределено);
										СтрокаДвижения.Вставить("ЗатратыНаВыпуск"       , Истина);
										СтрокаДвижения.Вставить("Спецификация"          , Справочники.Спецификации.ПустаяСсылка());
										СтрокаДвижения.Вставить("КоррСпецификация"      , НаправлениеРаспределения.Спецификация);
										СтрокаДвижения.Вставить("СтавкаНДС"             , Справочники.СтавкиНДС.ПустаяСсылка());
										СтрокаДвижения.Вставить("Подразделение"         , НаправлениеРаспределения.СтруктурнаяЕдиница);
										
										//+++ Дмгг
										СтрокаДвижения.Вставить("ДопСвойства"         	, Истина);
										СтрокаДвижения.Вставить("ПодразделениеДт"       , НаправлениеРаспределения.СтруктурнаяЕдиница);
										СтрокаДвижения.Вставить("ПодразделениеКт"       , ОбходПоСчетамУчета.СтруктурнаяЕдиница);
										СтрокаДвижения.Вставить("СтруктурнаяЕдиницаДт"  , НаправлениеРаспределения.СтруктурнаяЕдиница);
										СтрокаДвижения.Вставить("СтруктурнаяЕдиницаКт"  , НаправлениеРаспределения.СтруктурнаяЕдиница);
										СтрокаДвижения.Вставить("НоменклатураДт"        , НаправлениеРаспределения.Номенклатура);
										СтрокаДвижения.Вставить("НоменклатураКт"        , ОбходПоСчетамУчета.Номенклатура);
										СтрокаДвижения.Вставить("ХарактеристикаДт"      , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
										СтрокаДвижения.Вставить("ХарактеристикаКт"      , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
										//--- Дмгг
									
										// Движения по регистру Учет запасов и затрат.
										СформироватьДвиженияПоРегиструУчетаЗатрат(
											НаборЗаписейЗапасы,
											НаборЗаписейУправленческий,
											НаборЗаписейХозрасчетный,
											СтрокаДвижения,
											СуммаЗатрат,
											Истина
										);
										
									КонецЕсли;
									
								ИначеЕсли ЗначениеЗаполнено(НаправлениеРаспределения.Номенклатура) Тогда // распределение прямых
									
									СтрокаДвижения = Новый Структура;
									СтрокаДвижения.Вставить("Организация"           , ОбходПоСчетамУчета.Организация);
									СтрокаДвижения.Вставить("СтруктурнаяЕдиница"    , ОбходПоСчетамУчета.СтруктурнаяЕдиница);
									СтрокаДвижения.Вставить("СчетУчета"             , ОбходПоСчетамУчета.СчетУчета);
									СтрокаДвижения.Вставить("СчетУчетаРегл"         , ОбходПоСчетамУчета.СчетУчетаРегл);
									СтрокаДвижения.Вставить("СчетУчетаТипСчета"     , ОбходПоСчетамУчета.СчетУчетаТипСчета);
									СтрокаДвижения.Вставить("Номенклатура"          , ОбходПоСчетамУчета.Номенклатура);
									СтрокаДвижения.Вставить("Характеристика"        , ОбходПоСчетамУчета.Характеристика);
									СтрокаДвижения.Вставить("Партия"                , ОбходПоСчетамУчета.Партия);
									СтрокаДвижения.Вставить("ЗаказПокупателя"       , ОбходПоСчетамУчета.ЗаказПокупателя);
									СтрокаДвижения.Вставить("КоррСтруктурнаяЕдиница", НаправлениеРаспределения.СтруктурнаяЕдиница);
									СтрокаДвижения.Вставить("КоррСчетУчета"         , НаправлениеРаспределения.СчетУчета);
									СтрокаДвижения.Вставить("КоррСчетУчетаРегл"     , НаправлениеРаспределения.СчетУчетаРегл);
									СтрокаДвижения.Вставить("КоррСчетУчетаТипСчета" , НаправлениеРаспределения.СчетУчетаТипСчета);
									СтрокаДвижения.Вставить("КоррНоменклатура"      , НаправлениеРаспределения.Номенклатура);
									СтрокаДвижения.Вставить("КоррХарактеристика"    , НаправлениеРаспределения.Характеристика);
									СтрокаДвижения.Вставить("КоррПартия"            , НаправлениеРаспределения.Партия);
									СтрокаДвижения.Вставить("КоррЗаказПокупателя"   , НаправлениеРаспределения.ЗаказПокупателя);
									СтрокаДвижения.Вставить("ДокументПродажи"       , Неопределено);
									СтрокаДвижения.Вставить("ЗатратыНаВыпуск"       , Истина);
									СтрокаДвижения.Вставить("Спецификация"          , Справочники.Спецификации.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррСпецификация"      , НаправлениеРаспределения.Спецификация);
									СтрокаДвижения.Вставить("СтавкаНДС"             , Справочники.СтавкиНДС.ПустаяСсылка());
									СтрокаДвижения.Вставить("Подразделение"         , ОбходПоСчетамУчета.СтруктурнаяЕдиница);
									
									// Движения по регистру Учет запасов и затрат.
									СформироватьДвиженияПоРегиструУчетаЗатрат(
										НаборЗаписейЗапасы,
										НаборЗаписейУправленческий,
										НаборЗаписейХозрасчетный,
										СтрокаДвижения,
										СуммаЗатрат,
										Истина
									);
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЦикла;
						
						Если СуммаРаспределили = 0 Тогда
							ОписаниеОшибки = СформироватьОписаниеОшибкиРаспределенияЗатрат(
								ОбходПоСчетамУчета.СчетУчета,
								ОбходПоСчетамУчета.СчетУчетаСпособРаспределения,
								ФильтрПоЗаказ,
								ОбходПоСчетамУчета.Сумма
							);
							ДобавитьОшибкуВТаблицу(ОписаниеОшибки, "РаспределениеЗатрат", ТаблицаОшибок, ФильтрПоЗаказ);
							Продолжить;
						КонецЕсли;
						
					КонецЕсли
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Пишем оставшиеся записи Учет запасов и затрат.
	НаборЗаписейЗапасы.Записать(Ложь);
	
	// Пишем оставшиеся записи Управленческий.
	Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда  //+++ Дмгг
		НаборЗаписейУправленческий.Записать(Ложь);
	КонецЕсли;  //--- Дмгг
	
	// Пишем оставшиеся записи Хозрасчетный.
	НаборЗаписейХозрасчетный.Записать(Ложь);	
	
КонецПроцедуры

&Вместо("РассчитатьФинансовыйРезультатРегл")
Процедура AzRyFix_РассчитатьФинансовыйРезультатРегл(Отказ)
	
	Если Не AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца Тогда		
		ПродолжитьВызов(Отказ);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетнаяПолитикаРеглСрезПоследних.СчетПрибыльУбытки КАК СчетПрибыльУбытки
		|ПОМЕСТИТЬ Вт_УчетнаяПолитикаОрганизации
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УчетнаяПолитикаРеглСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаФинансовогоРезультатаДоходы.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ Вт_ФинРезСчетаДоходов
		|ИЗ
		|	РегистрСведений.СчетаФинансовогоРезультатаДоходы КАК СчетаФинансовогоРезультатаДоходы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаФинансовогоРезультатаРасходы.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ Вт_ФинРезСчетаРасходов
		|ИЗ
		|	РегистрСведений.СчетаФинансовогоРезультатаРасходы КАК СчетаФинансовогоРезультатаРасходы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХозрасчетныйОбороты.Организация,
		|	ХозрасчетныйОбороты.Счет КАК СчетДт,
		|	ХозрасчетныйОбороты.Субконто1 КАК СубконтоДт1,
		|	ХозрасчетныйОбороты.Субконто2 КАК СубконтоДт2,
		|	ХозрасчетныйОбороты.Субконто3 КАК СубконтоДт3,
		|	СУММА(ХозрасчетныйОбороты.КоличествоОборотКт) КАК КоличествоОборотДт,
		|	Вт_УчетнаяПолитикаОрганизации.СчетПрибыльУбытки КАК СчетКт,
		|	&ВалютаУчета КАК СубконтоКт1,
		|	NULL КАК СубконтоКт2,
		|	NULL КАК СубконтоКт3,
		|	0 КАК КоличествоОборотКт,
		|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборот
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В
		|				(ВЫБРАТЬ
		|					Вт_ФинРезСчетаДоходов.СчетУчета
		|				ИЗ
		|					Вт_ФинРезСчетаДоходов КАК Вт_ФинРезСчетаДоходов),
		|			,
		|			Организация = &Организация,
		|			,
		|			) КАК ХозрасчетныйОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_УчетнаяПолитикаОрганизации КАК Вт_УчетнаяПолитикаОрганизации
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ХозрасчетныйОбороты.Регистратор <> &ИсключаемыйРегистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОбороты.Организация,
		|	ХозрасчетныйОбороты.Счет,
		|	ХозрасчетныйОбороты.Субконто1,
		|	ХозрасчетныйОбороты.Субконто2,
		|	ХозрасчетныйОбороты.Субконто3,
		|	Вт_УчетнаяПолитикаОрганизации.СчетПрибыльУбытки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Организация,
		|	Вт_УчетнаяПолитикаОрганизации.СчетПрибыльУбытки,
		|	&ВалютаУчета,
		|	NULL,
		|	NULL,
		|	0,
		|	ХозрасчетныйОбороты.Счет,
		|	ХозрасчетныйОбороты.Субконто1,
		|	ХозрасчетныйОбороты.Субконто2,
		|	ХозрасчетныйОбороты.Субконто3,
		|	СУММА(ХозрасчетныйОбороты.КоличествоОборотДт),
		|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт)
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В
		|				(ВЫБРАТЬ
		|					Вт_ФинРезСчетаРасходов.СчетУчета
		|				ИЗ
		|					Вт_ФинРезСчетаРасходов КАК Вт_ФинРезСчетаРасходов),
		|			,
		|			Организация = &Организация,
		|			,
		|			) КАК ХозрасчетныйОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_УчетнаяПолитикаОрганизации КАК Вт_УчетнаяПолитикаОрганизации
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ХозрасчетныйОбороты.Регистратор <> &ИсключаемыйРегистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОбороты.Организация,
		|	Вт_УчетнаяПолитикаОрганизации.СчетПрибыльУбытки,
		|	ХозрасчетныйОбороты.Счет,
		|	ХозрасчетныйОбороты.Субконто1,
		|	ХозрасчетныйОбороты.Субконто2,
		|	ХозрасчетныйОбороты.Субконто3";
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Запрос.УстановитьПараметр("НачалоПериода"			, ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("КонецПериода"			, ДополнительныеСвойства.ДляПроведения.КонечнаяГраницаПериода);
	Запрос.УстановитьПараметр("Организация"				, ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета"				, Справочники.Валюты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор"	, Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
				
		// Создадим набор записей регистра бухгалтерии "Хозрасчетный".
		НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
		НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ВыборкаРезультатЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаРезультатЗапроса.Следующий() Цикл
		
		// Движения по регистру Хозрасчетный.
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		НоваяСтрока.Период 		= Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаРезультатЗапроса.Организация;
		НоваяСтрока.СчетДт 		= ВыборкаРезультатЗапроса.СчетДт;
		НоваяСтрока.СчетКт 		= ВыборкаРезультатЗапроса.СчетКт;
		НоваяСтрока.Сумма 		= ВыборкаРезультатЗапроса.СуммаОборот;
		НоваяСтрока.Содержание 	= "Финансовый результат";
		
		//Если НоваяСтрока.СчетДт.Валютный Тогда
		//	НоваяСтрока.ВалютаДт = ВалютаУчета;	
		//КонецЕсли;
		
		Если НоваяСтрока.СчетДт.Количественный Тогда
			НоваяСтрока.КоличествоДт = ВыборкаРезультатЗапроса.КоличествоОборотДт;
		КонецЕсли;
		
		//Если НоваяСтрока.СчетКт.Валютный Тогда
		//	НоваяСтрока.ВалютаКт = ВалютаУчета;	
		//КонецЕсли;
		
		Если НоваяСтрока.СчетКт.Количественный Тогда
			НоваяСтрока.КоличествоКт = ВыборкаРезультатЗапроса.КоличествоОборотКт;
		КонецЕсли;
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, 1, ВыборкаРезультатЗапроса.СубконтоДт1);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, 2, ВыборкаРезультатЗапроса.СубконтоДт2);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, 3, ВыборкаРезультатЗапроса.СубконтоДт3);
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, 1, ВыборкаРезультатЗапроса.СубконтоКт1);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, 2, ВыборкаРезультатЗапроса.СубконтоКт2);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, 3, ВыборкаРезультатЗапроса.СубконтоКт3);	
		
	КонецЦикла;
	
	// Пишем Хозрасчетный.
	НаборЗаписейХозрасчетный.Записать(Ложь);
	НаборЗаписейХозрасчетный.Очистить();
		
КонецПроцедуры

&Вместо("РассчитатьКурсовыеРазницы")
Процедура AzRyFix_РассчитатьКурсовыеРазницы(Отказ, ТаблицаОшибок)
	
	Если Не AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца Тогда		
		ПродолжитьВызов(Отказ, ТаблицаОшибок);
		Возврат;
	КонецЕсли;
	
	// Создадим набор записей регистра накопления ДенежныеСредства.
	НаборЗаписейДенежныеСредства = РегистрыНакопления.ДенежныеСредства.СоздатьНаборЗаписей();
	НаборЗаписейДенежныеСредства.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления ДенежныеСредстваВКассахККМ.
	НаборЗаписейДенежныеСредстваВКассахККМ = РегистрыНакопления.ДенежныеСредстваВКассахККМ.СоздатьНаборЗаписей();
	НаборЗаписейДенежныеСредстваВКассахККМ.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления РасчетыСПерсоналом.
	НаборЗаписейРасчетыСПерсоналом = РегистрыНакопления.РасчетыСПерсоналом.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыСПерсоналом.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления РасчетыСПодотчетниками.
	НаборЗаписейРасчетыСПодотчетниками = РегистрыНакопления.РасчетыСПодотчетниками.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыСПодотчетниками.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления РасчетыСПокупателями.
	НаборЗаписейРасчетыСПокупателями = РегистрыНакопления.РасчетыСПокупателями.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыСПокупателями.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления РасчетыСПоставщиками.
	НаборЗаписейРасчетыСПоставщиками = РегистрыНакопления.РасчетыСПоставщиками.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыСПоставщиками.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления РасчетыПоКредитамИЗаймам.
	НаборЗаписейРасчетыПоКредитамИЗаймам = РегистрыНакопления.РасчетыПоКредитамИЗаймам.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыПоКредитамИЗаймам.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра сведений ОтчетПоКурсовымРазницам.
	НаборЗаписейОтчетПоКурсовымРазницам = РегистрыСведений.ОтчетПоКурсовымРазницам.СоздатьНаборЗаписей();
	НаборЗаписейОтчетПоКурсовымРазницам.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра бухгалтерии Управленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра бухгалтерии Хозрасчетный.
	НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
	
	СтруктураОтраженияКурсовыхРазницРегл = РегламентированныйУчетСервер.ПолучитьСтруктуруОтраженияКурсовыхРазниц2(Дата, Организация);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	Запрос.УстановитьПараметр("СчетДеньгиОтрицательная", СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаДеньги);
	Запрос.УстановитьПараметр("СчетДеньгиПоложительная", СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаДеньги);
	Запрос.УстановитьПараметр("СчетЗадолженностьОтрицательная", СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность);
	Запрос.УстановитьПараметр("СчетЗадолженностьПоложительная", СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность);
	
	Запрос.УстановитьПараметр("НеПереоцениватьСчета", СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета);
	
	// Денежные средства.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ТаблицаОстатки.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК Аналитика,
	|	ТаблицаОстатки.Валюта КАК Валюта,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница)
	|	КОНЕЦ КАК Статья,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.БанковскийСчетКасса.СчетУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.БанковскийСчетКасса.СчетУчетаРегл
	|		ИНАЧЕ &СчетДеньгиОтрицательная
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ТаблицаОстатки.БанковскийСчетКасса.СчетУчета
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетДеньгиПоложительная
	|		ИНАЧЕ ТаблицаОстатки.БанковскийСчетКасса.СчетУчетаРегл
	|	КОНЕЦ КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ТаблицаОстатки.БанковскийСчетКасса.СчетУчета.Валютный
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ТаблицаОстатки.БанковскийСчетКасса.СчетУчета.Валютный
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетДеньгиПоложительная
	|		ИНАЧЕ &СчетДеньгиОтрицательная
	|	КОНЕЦ КАК СчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Валюта = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДтРегл) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКтРегл) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейДенежныеСредства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ХозяйственнаяОперация = ХозяйственнаяОперация; // Хозяйственная операция
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика = "" + ВыборкаДетальныеЗаписи.БанковскийСчетКасса;
		НоваяСтрока.Раздел = "Денежные средства";
		
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетДтРегл;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетКтРегл;
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
			НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
			НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "БанковскиеСчета", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Касса", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "СтатьиДвиженияДенежныхСредств", ВыборкаДетальныеЗаписи.Статья);
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "БанковскиеСчета", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Касса", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "СтатьиДвиженияДенежныхСредств", ВыборкаДетальныеЗаписи.Статья);
		
	КонецЦикла;
	
	// Денежные средства в кассах ККМ.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.КассаККМ КАК КассаККМ,
	|	ТаблицаОстатки.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.КассаККМ.СчетУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.КассаККМ.СчетУчетаРегл
	|		ИНАЧЕ &СчетДеньгиОтрицательная
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ТаблицаОстатки.КассаККМ.СчетУчета
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетДеньгиПоложительная
	|		ИНАЧЕ ТаблицаОстатки.КассаККМ.СчетУчетаРегл
	|	КОНЕЦ КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ТаблицаОстатки.КассаККМ.СчетУчета.Валютный
	|			ТОГДА ТаблицаОстатки.КассаККМ.ВалютаДенежныхСредств
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ТаблицаОстатки.КассаККМ.СчетУчета.Валютный
	|			ТОГДА ТаблицаОстатки.КассаККМ.ВалютаДенежныхСредств
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетДеньгиПоложительная
	|		ИНАЧЕ &СчетДеньгиОтрицательная
	|	КОНЕЦ КАК СчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.КассаККМ.ВалютаДенежныхСредств = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДтРегл) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКтРегл) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейДенежныеСредстваВКассахККМ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика = "" + ВыборкаДетальныеЗаписи.КассаККМ;
		НоваяСтрока.Раздел = "Денежные средства в кассах ККМ";
		
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетДтРегл;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетКтРегл;
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
			НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
			НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "БанковскиеСчета", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Касса", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "СтатьиДвиженияДенежныхСредств", ВыборкаДетальныеЗаписи.Статья);
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "БанковскиеСчета", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Касса", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "СтатьиДвиженияДенежныхСредств", ВыборкаДетальныеЗаписи.Статья);
		
	КонецЦикла;
	
	// Расчеты с персоналом.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаОстатки.Сотрудник КАК Сотрудник,
	|	ТаблицаОстатки.Сотрудник.Код КАК СотрудникКод,
	|	ТаблицаОстатки.Валюта КАК Валюта,
	|	ТаблицаОстатки.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналом
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьОтрицательная
	|		ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналомРегл
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналом
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналомРегл
	|		ИНАЧЕ &СчетЗадолженностьПоложительная
	|	КОНЕЦ КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналом.Валютный
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналом.Валютный
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьОтрицательная
	|		ИНАЧЕ &СчетЗадолженностьПоложительная
	|	КОНЕЦ КАК СчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.РасчетыСПерсоналом.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Валюта = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДтРегл) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКтРегл) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейРасчетыСПерсоналом.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока.СтруктурнаяЕдиница = Неопределено;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика = 
			""
		  + ВыборкаДетальныеЗаписи.Сотрудник + " (" + ВыборкаДетальныеЗаписи.СотрудникКод + ")"
		  + " / "
		  + ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница
		  + " / "
		  + Формат(ВыборкаДетальныеЗаписи.ПериодРегистрации, "ДФ='ММММ гггг'")+ " г.";
		НоваяСтрока.Раздел = "Расчеты с персоналом";
		
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетДтРегл;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетКтРегл;
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
			НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
			НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "РаботникиОрганизаций", ВыборкаДетальныеЗаписи.Сотрудник);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Сотрудники", ВыборкаДетальныеЗаписи.Сотрудник);
	
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "РаботникиОрганизаций", ВыборкаДетальныеЗаписи.Сотрудник); 
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Сотрудники", ВыборкаДетальныеЗаписи.Сотрудник);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
		
	КонецЦикла;
	
	// Расчеты с подотчетниками.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.Сотрудник КАК Сотрудник,
	|	ТаблицаОстатки.Документ КАК Документ,
	|	ТаблицаОстатки.Валюта КАК Валюта,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница)
	|	КОНЕЦ КАК Статья,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками
	|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|							И ТаблицаОстатки.Валюта = ВалютаУчета.Значение
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходуРегл
	//+++ Дмгг
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) < 0
	|							И ТаблицаОстатки.Документ ССЫЛКА Документ.Конвертация
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
	//--- Дмгг
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) < 0
	|							И ТаблицаОстатки.Валюта <> ВалютаУчета.Значение
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходуРегл
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|							И ТаблицаОстатки.Валюта <> ВалютаУчета.Значение
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
	//+++ Дмгг
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) = 0
	|							И ТаблицаОстатки.Документ ССЫЛКА Документ.АвансовыйОтчет
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходуРегл
	//--- Дмгг
	|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
	|				КОНЕЦ
	|		ИНАЧЕ &СчетЗадолженностьОтрицательная
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|					ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками
	|				ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьПоложительная
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|					ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
	//+++ Дмгг
	|				КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) = 0
	|					И (ТаблицаОстатки.Документ ССЫЛКА Документ.РасходСоСчета
	|						ИЛИ ТаблицаОстатки.Документ ССЫЛКА Документ.РасходИзКассы)
	|					ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
	|				ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходуРегл
	//|				ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ВЫБОР
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ВЫБОР
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьПоложительная
	|		ИНАЧЕ &СчетЗадолженностьОтрицательная
	|	КОНЕЦ КАК СчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.РасчетыСПодотчетниками.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Валюта = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	//+++ Дмгг
	|,
	|		Константа.ВалютаУчета КАК ВалютаУчета
	//--- Дмгг
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДтРегл) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКтРегл) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейРасчетыСПодотчетниками.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика =
			""
		  + ВыборкаДетальныеЗаписи.Сотрудник
		  + " / "
		  + ВыборкаДетальныеЗаписи.Документ;
		НоваяСтрока.Раздел = "Расчеты с подотчетниками";
		
		//НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		//НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетДтРегл;
		//НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетКтРегл;
		
		//Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
		//	НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		//Иначе
		//	НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		//КонецЕсли; 
		//
		//Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
		//	НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		//Иначе
		//	НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		//КонецЕсли; 
		
	//	БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
	//	БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Сотрудники", ВыборкаДетальныеЗаписи.Сотрудник);
	//
	//	БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
	//	БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Сотрудники", ВыборкаДетальныеЗаписи.Сотрудник);
		
		
	КонецЦикла;

	//+++ Дмгг
	// для проводок по хоз расчетному
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОстатки.Организация КАК Организация,
		|	&Дата КАК Период,
		|	&Ссылка КАК Регистратор,
		|	ТаблицаОстатки.Сотрудник КАК Сотрудник,
		|	ТаблицаОстатки.Валюта КАК Валюта,
		|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
		|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
		|	КОНЕЦ КАК Сумма,
		|	&КурсоваяРазница КАК СодержаниеПроводки,
		|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
		|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаДоходов,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		|			ТОГДА 0
		|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
		|	КОНЕЦ КАК СуммаРасходов,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
		//|	&СчетЗадолженностьОтрицательная КАК СчетДт,
		|	ВЫБОР
		//--------------------------------------------------------------------------
		// © Шишка В.В. [23 сентября 2021]  НАЧАЛО
		//|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0 
		//|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		//|			ТОГДА &СчетЗадолженностьОтрицательная
		//|		ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
		|			ТОГДА &СчетЗадолженностьОтрицательная
		|		ИНАЧЕ ВЫБОР КОГДА  ТаблицаОстатки.Документ Ссылка Документ.АвансовыйОтчет
		|			ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходуРегл
		|			ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
		|	        КОНЕЦ
		// © Шишка В.В. [23 сентября 2021]  КОНЕЦ
		//--------------------------------------------------------------------------
		|	КОНЕЦ КАК СчетДт,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0 
		////+++ Дмгг
		//|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		////--- Дмгг
		//|			ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
		//|		ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходуРегл
		//|	КОНЕЦ КАК СчетКт,
		|	ВЫБОР
		//--------------------------------------------------------------------------
		// © Шишка В.В. [23 сентября 2021]  НАЧАЛО
		//|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0 
		//|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		//|			ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
		//|		ИНАЧЕ &СчетЗадолженностьПоложительная
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
		|			ТОГДА ВЫБОР КОГДА  ТаблицаОстатки.Документ Ссылка Документ.АвансовыйОтчет
		|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходуРегл
		|						ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
		|	                    КОНЕЦ
		|		ИНАЧЕ &СчетЗадолженностьПоложительная
		// © Шишка В.В. [23 сентября 2021]  КОНЕЦ
		//--------------------------------------------------------------------------
		|	КОНЕЦ КАК СчетКт,
		//--------------------------------------------------------------------------
		// © Шишка В.В. [23 сентября 2021]  НАЧАЛО
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКР,
		// © Шишка В.В. [23 сентября 2021]  КОНЕЦ
		//--------------------------------------------------------------------------
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		|				И ВЫБОР
		|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
		|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками.Валютный
		|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу.Валютный
		|				КОНЕЦ
		|			ТОГДА ТаблицаОстатки.Валюта
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ВалютаДт,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
		|				И ВЫБОР
		|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
		|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками.Валютный
		|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу.Валютный
		|				КОНЕЦ
		|			ТОГДА ТаблицаОстатки.Валюта
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ВалютаКт,
		|	&КурсоваяРазница КАК Содержание,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		|			ТОГДА &СчетЗадолженностьПоложительная
		|		ИНАЧЕ &СчетЗадолженностьОтрицательная
		|	КОНЕЦ КАК СчетУчетаРегл
		|ИЗ
		|	РегистрНакопления.РасчетыСПодотчетниками.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&ДатаКон,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						Константы.ВалютаУчета
		|					ИЗ
		|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
		|		ПО ТаблицаОстатки.Валюта = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта,
		|	Константа.ВалютаУчета КАК ВалютаУчета
		|ГДЕ
		|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
		|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
		|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДт) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКт) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
			НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
			НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Сотрудники", ВыборкаДетальныеЗаписи.Сотрудник);
	
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Сотрудники", ВыборкаДетальныеЗаписи.Сотрудник);
	
	КонецЦикла;
	//--- Дмгг
	
	// Расчеты с покупателями.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.ТипРасчетов КАК ТипРасчетов,
	|	ТаблицаОстатки.Контрагент КАК Контрагент,
	|	ТаблицаОстатки.Договор КАК Договор,
	|	ТаблицаОстатки.Документ КАК Документ,
	|	ТаблицаОстатки.Заказ КАК Заказ,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ТаблицаОстатки.Договор.ВалютаРасчетов КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница)
	|	КОНЕЦ КАК Статья,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателя
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателемРегл
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателяРегл
	|				КОНЕЦ
	|		ИНАЧЕ &СчетЗадолженностьОтрицательная
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|					ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
	|				ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателя
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьПоложительная
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|					ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателемРегл
	|				ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателяРегл
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателем.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателя.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателем.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателя.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьПоложительная
	|		ИНАЧЕ &СчетЗадолженностьОтрицательная
	|	КОНЕЦ КАК СчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.РасчетыСПокупателями.Остатки(
	|			&ДатаКон,
	|			Организация = &Организация
	|				И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Договор.ВалютаРасчетов = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДтРегл) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКтРегл) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейРасчетыСПокупателями.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика =
			""
		  + ВыборкаДетальныеЗаписи.Контрагент
		  + " / "
		  + ВыборкаДетальныеЗаписи.Договор
		  + " / "
		  + ВыборкаДетальныеЗаписи.Документ
		  + " / "
		  + ВыборкаДетальныеЗаписи.Заказ;
		НоваяСтрока.Раздел = "Расчеты с покупателями";
		
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетДтРегл;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетКтРегл;
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
			НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
			НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", ВыборкаДетальныеЗаписи.Контрагент); //+++ Дмгг
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Договоры", ВыборкаДетальныеЗаписи.Договор);
	
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", ВыборкаДетальныеЗаписи.Контрагент); //+++ Дмгг
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Договоры", ВыборкаДетальныеЗаписи.Договор);
		
	КонецЦикла;
	
	// Расчеты с поставщиками.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.ТипРасчетов КАК ТипРасчетов,
	|	ТаблицаОстатки.Контрагент КАК Контрагент,
	|	ТаблицаОстатки.Договор КАК Договор,
	|	ТаблицаОстатки.Документ КАК Документ,
	|	ТаблицаОстатки.Заказ КАК Заказ,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ТаблицаОстатки.Договор.ВалютаРасчетов КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|					ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
	|				ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщику
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьОтрицательная
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|					ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|				ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщику
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|				КОНЕЦ
	|		ИНАЧЕ &СчетЗадолженностьПоложительная
	|	КОНЕЦ КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщику.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщику.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьОтрицательная
	|		ИНАЧЕ &СчетЗадолженностьПоложительная
	|	КОНЕЦ КАК СчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|			&ДатаКон,
	|			Организация = &Организация
	|				И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Договор.ВалютаРасчетов = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДтРегл) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКтРегл) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейРасчетыСПоставщиками.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика =
			""
		  + ВыборкаДетальныеЗаписи.Контрагент
		  + " / "
		  + ВыборкаДетальныеЗаписи.Договор
		  + " / "
		  + ВыборкаДетальныеЗаписи.Документ
		  + " / "
		  + ВыборкаДетальныеЗаписи.Заказ;
		НоваяСтрока.Раздел = "Расчеты с поставщиками";
		
		
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетДтРегл;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетКтРегл;
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
			НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
			НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", ВыборкаДетальныеЗаписи.Контрагент); //+++ Дмгг
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Договоры", ВыборкаДетальныеЗаписи.Договор);
	
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", ВыборкаДетальныеЗаписи.Контрагент); //+++ Дмгг
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Договоры", ВыборкаДетальныеЗаписи.Договор);
		
		
	КонецЦикла;
	
	_РасчетКурсовыхРазницКредиты = Истина;
	Если _РасчетКурсовыхРазницКредиты Тогда
		
		// Расчеты по кредитам и займам
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("КонецМесяцаГраница", Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация); //Lazare 14.07.2022

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|	РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгОстаток КАК ОсновнойДолгОстаток,
		|	РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгВалОстаток КАК ОсновнойДолгВалОстаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(&КонецМесяцаГраница, ) КАК РасчетыПоКредитамИЗаймамОстатки
		|ГДЕ
		|	РасчетыПоКредитамИЗаймамОстатки.Организация = &Организация   //Lazare 14.07.2022
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|	РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгОстаток КАК ОсновнойДолгОстаток,
		|	РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгВалОстаток КАК ОсновнойДолгВалОстаток
		|ПОМЕСТИТЬ ВТ_ОстаткиПрошлогоМесяца
		|ИЗ
		|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецМесяца, МЕСЯЦ, -1), МЕСЯЦ), ) КАК РасчетыПоКредитамИЗаймамОстатки
		|ГДЕ
		|	РасчетыПоКредитамИЗаймамОстатки.Организация = &Организация   //Lazare 14.07.2022
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|	РасчетыПоКредитамИЗаймамОбороты.Период КАК Период,
		|	РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгРасход КАК ОсновнойДолгРасход,
		|	РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалРасход КАК ОсновнойДолгВалРасход,
		|	ВЫБОР
		|		КОГДА ВТ_ОстаткиПрошлогоМесяца.ОсновнойДолгОстаток <> 0
		|			ТОГДА КурсыВалютСрезПоследних.Курс
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалРасход = 0
		|					ТОГДА 0
		|				ИНАЧЕ РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгРасход / РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалРасход
		|			КОНЕЦ
		|	КОНЕЦ КАК Курс,
		|	ВТ_ОстаткиТекущегоМесяца.ОсновнойДолгОстаток КАК ОсновнойДолгОстаток,
		|	ВТ_ОстаткиТекущегоМесяца.ОсновнойДолгВалОстаток КАК ОсновнойДолгВалОстаток,
		|	КурсыВалютСрезПоследних.Курс КАК КурсПрошлогоМесяца
		|ИЗ
		|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Обороты(
		|			,
		|			&КонецМесяца,
		|			День,
		|			ДоговорКредитаЗайма В
		|				(ВЫБРАТЬ
		|					Остатки.ДоговорКредитаЗайма
		|				ИЗ
		|					ВТ_Остатки КАК Остатки)) КАК РасчетыПоКредитамИЗаймамОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецМесяца, МЕСЯЦ, -1), МЕСЯЦ), ) КАК КурсыВалютСрезПоследних
		|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПрошлогоМесяца КАК ВТ_ОстаткиПрошлогоМесяца
		|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма = ВТ_ОстаткиПрошлогоМесяца.ДоговорКредитаЗайма
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_ОстаткиТекущегоМесяца
		|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма = ВТ_ОстаткиТекущегоМесяца.ДоговорКредитаЗайма
		|ГДЕ
		|	РасчетыПоКредитамИЗаймамОбороты.Организация = &Организация  //Lazare 14.07.2022
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДоговорКредитаЗайма,
		|	Период";
		
		
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаВзятияКредитов = РезультатЗапроса.Выгрузить();
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|	РасчетыПоКредитамИЗаймамОбороты.Период КАК Период,
		|	РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгПриход,
		|	РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалПриход,
		|	ВЫБОР
		|		КОГДА РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалПриход = 0
		|			ТОГДА 0
		|		ИНАЧЕ РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгПриход / РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалПриход
		|	КОНЕЦ КАК Курс,
		|	КурсыВалютСрезПоследних.Курс КАК КурсНаКонецМесяца,
		|	РасчетыПоКредитамИЗаймамОбороты.Контрагент,
		|	РасчетыПоКредитамИЗаймамОбороты.Организация,
		|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов КАК Валюта,
		|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.СчетУчетаРегл КАК СчетУчетаРегл
		|ИЗ
		|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Обороты(
		|			&НачалоМесяца,
		|			&КонецМесяца,
		|			День,
		|			ДоговорКредитаЗайма В
		|				(ВЫБРАТЬ
		|					Остатки.ДоговорКредитаЗайма
		|				ИЗ
		|					ВТ_Остатки КАК Остатки)) КАК РасчетыПоКредитамИЗаймамОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецМесяца, ) КАК КурсыВалютСрезПоследних
		|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДоговорКредитаЗайма,
		|	Период
		|ИТОГИ ПО
		|	ДоговорКредитаЗайма";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		СтруктураОтраженияКурсовыхРазницРегл = РегламентированныйУчетСервер.ПолучитьСтруктуруОтраженияКурсовыхРазниц2(Дата, Организация);
		
		Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
		Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
		Запрос.УстановитьПараметр("КурсоваяРазница", );
		
		ВыборкаПоДоговорамКредитов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоДоговорамКредитов.Следующий() Цикл
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ДоговорКредитаЗайма", ВыборкаПоДоговорамКредитов.ДоговорКредитаЗайма);
			СтрокиПоступления = ТаблицаВзятияКредитов.НайтиСтроки(ПараметрыОтбора);
			
			Если СтрокиПоступления.Количество() > 0 Тогда
				ВыборкаЗакрытиеКредита = ВыборкаПоДоговорамКредитов.Выбрать();
				КоличествоИтераций = ВыборкаЗакрытиеКредита.Количество();
				Итератор = 0;
				Пока ВыборкаЗакрытиеКредита.Следующий() Цикл
					
					Итератор = Итератор + 1;
					
					Если СтрокиПоступления[0].ОсновнойДолгВалОстаток = 0 Тогда 
						Сумма = ВыборкаЗакрытиеКредита.ОсновнойДолгВалПриход * ВыборкаЗакрытиеКредита.Курс;//СтрокиПоступления[0].Курс;
					Иначе
						Сумма = ВыборкаЗакрытиеКредита.ОсновнойДолгВалПриход * СтрокиПоступления[0].Курс;
					КонецЕсли;
					
					Если Сумма = 0 И СтрокиПоступления[0].ОсновнойДолгВалОстаток <> 0 Тогда
						
						Продолжить;
						
					КонецЕсли; 
					
					Если СтрокиПоступления[0].ОсновнойДолгВалОстаток = 0 Тогда
						КурсоваяРазница = СтрокиПоступления[0].ОсновнойДолгОстаток;
						
					Иначе
						КурсоваяРазница = ВыборкаЗакрытиеКредита.ОсновнойДолгПриход - Сумма;
					КонецЕсли;
					
					Если Итератор = 1 И СтрокиПоступления[0].ОсновнойДолгВалОстаток = 0 Тогда 
						НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
						
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗакрытиеКредита);
						НоваяСтрока.Период = КонецМесяца(Дата);
						
						НоваяСтрока.Сумма = ?(КурсоваяРазница < 0, -КурсоваяРазница, КурсоваяРазница);
						НоваяСтрока.Содержание = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты';en='The exchange rate difference Loans'");
						
						Если КурсоваяРазница < 0 Тогда
							
							
								НоваяСтрока.СчетДт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
								НоваяСтрока.СчетКт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
							
							
						Иначе
							
							НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
							НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
							
						КонецЕсли;
						
						Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
							НоваяСтрока.ВалютаДт = ВыборкаЗакрытиеКредита.Валюта;
						Иначе
							НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
						КонецЕсли; 
						
						Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
							НоваяСтрока.ВалютаКт = ВыборкаЗакрытиеКредита.Валюта;
						Иначе
							НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
						КонецЕсли; 
						
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); //+++ Дмгг
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
						
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); //+++ Дмгг
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
						
						
						НоваяСтрокаРасчетыПоКредитамИЗаймам = НаборЗаписейРасчетыПоКредитамИЗаймам.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаРасчетыПоКредитамИЗаймам, ВыборкаЗакрытиеКредита);
						НоваяСтрокаРасчетыПоКредитамИЗаймам.ВидДвижения = ВидДвиженияНакопления.Расход;
						НоваяСтрокаРасчетыПоКредитамИЗаймам.ОсновнойДолг = КурсоваяРазница;
						НоваяСтрокаРасчетыПоКредитамИЗаймам.ОсновнойДолгВал = 0;
						НоваяСтрокаРасчетыПоКредитамИЗаймам.Период = КонецМесяца(Дата);
						НоваяСтрокаРасчетыПоКредитамИЗаймам.СодержаниеПроводки = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты остаток';en='The exchange rate difference balance of the loan'");
						НоваяСтрокаРасчетыПоКредитамИЗаймам.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗакрытиеМесяца;
					
					КонецЕсли;
					
										
					//НоваяСтрокаОтчетПоКурсовымРазницам = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
					//НоваяСтрокаДоходыИРасходы = НаборЗаписейДоходыИРасходы.Добавить();
					//
					//
					//
					//Если КурсоваяРазница < 0 Тогда
					//	
					//	
					//	
					//	НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = -КурсоваяРазница;
					//	НоваяСтрокаОтчетПоКурсовымРазницам.СуммаДоходов = -КурсоваяРазница;
					//	
					//	НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
					//	НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
					//	НоваяСтрокаДоходыИРасходы.СуммаДоходов = -КурсоваяРазница;
					//	
					//Иначе
					//	
					//	
					//	
					//	НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = КурсоваяРазница;
					//	НоваяСтрокаОтчетПоКурсовымРазницам.СуммаРасходов = КурсоваяРазница;
					//	
					//	НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
					//	НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
					//	НоваяСтрокаДоходыИРасходы.СуммаРасходов = КурсоваяРазница;
					//	
					//КонецЕсли; 
					//
					//НоваяСтрокаДоходыИРасходы.Период = КонецМесяца(Дата);
					//НоваяСтрокаДоходыИРасходы.Организация = Организация;
					//НоваяСтрокаДоходыИРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					//НоваяСтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты';en='The exchange rate difference Loans'");
					//
					//
					//НоваяСтрокаОтчетПоКурсовымРазницам.Период = КонецМесяца(Дата);
					//НоваяСтрокаОтчетПоКурсовымРазницам.Организация = Организация;
					//НоваяСтрокаОтчетПоКурсовымРазницам.Валюта = ВыборкаЗакрытиеКредита.Валюта;
					//
					//
					//НоваяСтрокаОтчетПоКурсовымРазницам.Аналитика =
					//""
					//+ ВыборкаЗакрытиеКредита.Контрагент
					//+ " / "
					//+ ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма;
					//
					//НоваяСтрокаОтчетПоКурсовымРазницам.Раздел = "Расчеты по кредитам и займам";
					
					
				
				КонецЦикла; 
			КонецЕсли; 
			
		КонецЦикла;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоКредитамИЗаймамОстатки.Организация,
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма,
		|	РасчетыПоКредитамИЗаймамОстатки.Контрагент,
		|	-РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгОстаток КАК ОсновнойДолгОстаток,
		|	-РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгВалОстаток КАК ОсновнойДолгВалОстаток,
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.СчетУчетаРегл КАК СчетУчетаРегл,
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.ВалютаРасчетов КАК Валюта,
		|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность,1) КАК КурсВалюты
		|	
		|ИЗ
		|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(&ДатаКон, ) КАК РасчетыПоКредитамИЗаймамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютСрезПоследних
		|		ПО РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта
		|ГДЕ
		|	РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгОстаток < 0
		|	И РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгВалОстаток < 0";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ДоговорКредитаЗайма", Выборка.ДоговорКредитаЗайма);
			СтрокиПоступления = ТаблицаВзятияКредитов.НайтиСтроки(ПараметрыОтбора);
			
			Если СтрокиПоступления.Количество() > 0 Тогда
				
				Сумма = Выборка.ОсновнойДолгОстаток;//Выборка.ОсновнойДолгВалОстаток * СтрокиПоступления[0].Курс;
				
				Если Сумма = 0 Тогда
					
					Продолжить;
					
				КонецЕсли; 
				
				КурсоваяРазница = (Выборка.ОсновнойДолгВалОстаток * Выборка.КурсВалюты) - Сумма;
				
				НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
				НоваяСтрока.Период = КонецМесяца(Дата);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
				НоваяСтрока.Содержание = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты остаток';en='The exchange rate difference balance of the loan'");
				
				НоваяСтрокаОтчетПоКурсовымРазницам = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
				НоваяСтрокаДоходыИРасходы = НаборЗаписейДоходыИРасходы.Добавить();
				НоваяСтрокаРасчетыПоКредитамИЗаймам = НаборЗаписейРасчетыПоКредитамИЗаймам.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРасчетыПоКредитамИЗаймам, Выборка);
				НоваяСтрокаРасчетыПоКредитамИЗаймам.ВидДвижения = ВидДвиженияНакопления.Расход;
				НоваяСтрокаРасчетыПоКредитамИЗаймам.ОсновнойДолг = КурсоваяРазница;
				НоваяСтрокаРасчетыПоКредитамИЗаймам.ОсновнойДолгВал = 0;
				НоваяСтрокаРасчетыПоКредитамИЗаймам.Период = КонецМесяца(Дата);
				НоваяСтрокаРасчетыПоКредитамИЗаймам.СодержаниеПроводки = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты остаток';en='The exchange rate difference balance of the loan'");
				НоваяСтрокаРасчетыПоКредитамИЗаймам.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗакрытиеМесяца;
				
				Если КурсоваяРазница < 0 Тогда
					
					НоваяСтрока.Сумма = -КурсоваяРазница;
					
					НоваяСтрока.СчетДт = Выборка.СчетУчетаРегл;
					НоваяСтрока.СчетКт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
					
					НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = -КурсоваяРазница;
					НоваяСтрокаОтчетПоКурсовымРазницам.СуммаДоходов = -КурсоваяРазница;
					
					НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
					НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
					НоваяСтрокаДоходыИРасходы.СуммаДоходов = -КурсоваяРазница;
					
				Иначе
					
					НоваяСтрока.Сумма = КурсоваяРазница;
					
					НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
					НоваяСтрока.СчетКт = Выборка.СчетУчетаРегл;
					
					НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = КурсоваяРазница;
					НоваяСтрокаОтчетПоКурсовымРазницам.СуммаРасходов = КурсоваяРазница;
					
					НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
					НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
					НоваяСтрокаДоходыИРасходы.СуммаРасходов = КурсоваяРазница;
					
				КонецЕсли; 
				
				НоваяСтрокаДоходыИРасходы.Период = КонецМесяца(Дата);
				НоваяСтрокаДоходыИРасходы.Организация = Организация;
				НоваяСтрокаДоходыИРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
				НоваяСтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты';en='The exchange rate difference Loans'");
				
				
				НоваяСтрокаОтчетПоКурсовымРазницам.Период = КонецМесяца(Дата);
				НоваяСтрокаОтчетПоКурсовымРазницам.Организация = Организация;
				НоваяСтрокаОтчетПоКурсовымРазницам.Валюта = Выборка.Валюта;
				//ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
				
				НоваяСтрокаОтчетПоКурсовымРазницам.Аналитика =
				""
				+ Выборка.Контрагент
				+ " / "
				+ Выборка.ДоговорКредитаЗайма;
				//+ " / "
				//+ ВыборкаДетальныеЗаписи.Документ
				//+ " / "
				//+ ВыборкаДетальныеЗаписи.Заказ;
				НоваяСтрокаОтчетПоКурсовымРазницам.Раздел = "Расчеты по кредитам и займам";
				
				
				Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
					НоваяСтрока.ВалютаДт = Выборка.Валюта;
				Иначе
					НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
					НоваяСтрока.ВалютаКт = Выборка.Валюта;
				Иначе
					НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
				КонецЕсли; 
				
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", Выборка.Валюта);
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", Выборка.Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", Выборка.Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ДоговорыКредитовИЗаймов", Выборка.ДоговорКредитаЗайма);
				
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", Выборка.Валюта);
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", Выборка.Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", Выборка.Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ДоговорыКредитовИЗаймов", Выборка.ДоговорКредитаЗайма);
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	_РасчетКурсовыхРазницПроценты = Истина;
	Если _РасчетКурсовыхРазницПроценты Тогда
		
		// Расчеты по кредитам и займам
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("КонецМесяцаГраница", Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация); //Lazare 27.07.2022

		
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|	РасчетыПоКредитамИЗаймамОстатки.ПроцентыОстаток КАК ПроцентыОстаток,
		|	РасчетыПоКредитамИЗаймамОстатки.ПроцентыВалОстаток КАК ПроцентыВалОстаток
		|ПОМЕСТИТЬ ВТ_ОстаткиПроценты
		|ИЗ
		|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(&КонецМесяцаГраница, Организация = &Организация) КАК РасчетыПоКредитамИЗаймамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|	РасчетыПоКредитамИЗаймамОстатки.ПроцентыОстаток КАК ПроцентыОстаток,
		|	РасчетыПоКредитамИЗаймамОстатки.ПроцентыВалОстаток КАК ПроцентыВалОстаток
		|ПОМЕСТИТЬ ВТ_ОстаткиПроцентыПрошлогоМесяца
		|ИЗ
		|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецМесяца, МЕСЯЦ, -1), МЕСЯЦ), Организация = &Организация) КАК РасчетыПоКредитамИЗаймамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|	РасчетыПоКредитамИЗаймамОбороты.Период КАК Период,
		|	РасчетыПоКредитамИЗаймамОбороты.ПроцентыРасход КАК ПроцентыРасход,
		|	РасчетыПоКредитамИЗаймамОбороты.ПроцентыВалРасход КАК ПроцентыВалРасход,
		|	ВЫБОР
		|		КОГДА ВТ_ОстаткиПроцентыПрошлогоМесяца.ПроцентыОстаток <> 0
		|			ТОГДА КурсыВалютСрезПоследних.Курс
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РасчетыПоКредитамИЗаймамОбороты.ПроцентыВалРасход = 0
		|					ТОГДА 0
		|				ИНАЧЕ РасчетыПоКредитамИЗаймамОбороты.ПроцентыРасход / РасчетыПоКредитамИЗаймамОбороты.ПроцентыВалРасход
		|			КОНЕЦ
		|	КОНЕЦ КАК Курс,
		|	ВТ_ОстаткиПроцентыТекущегоМесяца.ПроцентыОстаток КАК ПроцентыОстаток,
		|	ВТ_ОстаткиПроцентыТекущегоМесяца.ПроцентыВалОстаток КАК ПроцентыВалОстаток,
		|	КурсыВалютСрезПоследних.Курс КАК КурсПрошлогоМесяца
		|ИЗ
		|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Обороты(
		|			,
		|			&КонецМесяца,
		|			День,
		|			ДоговорКредитаЗайма В
		|				(ВЫБРАТЬ
		|					Остатки.ДоговорКредитаЗайма
		|				ИЗ
		|					ВТ_ОстаткиПроценты КАК Остатки)) КАК РасчетыПоКредитамИЗаймамОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецМесяца, МЕСЯЦ, -1), МЕСЯЦ), ) КАК КурсыВалютСрезПоследних
		|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПроцентыПрошлогоМесяца КАК ВТ_ОстаткиПроцентыПрошлогоМесяца
		|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма = ВТ_ОстаткиПроцентыПрошлогоМесяца.ДоговорКредитаЗайма
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПроценты КАК ВТ_ОстаткиПроцентыТекущегоМесяца
		|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма = ВТ_ОстаткиПроцентыТекущегоМесяца.ДоговорКредитаЗайма
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДоговорКредитаЗайма,
		|	Период";
		
		
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаВзятияКредитов = РезультатЗапроса.Выгрузить();
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|	РасчетыПоКредитамИЗаймамОбороты.Период КАК Период,
		|	РасчетыПоКредитамИЗаймамОбороты.ПроцентыПриход,
		|	РасчетыПоКредитамИЗаймамОбороты.ПроцентыВалПриход,
		|	ВЫБОР
		|		КОГДА РасчетыПоКредитамИЗаймамОбороты.ПроцентыВалПриход = 0
		|			ТОГДА 0
		|		ИНАЧЕ РасчетыПоКредитамИЗаймамОбороты.ПроцентыПриход / РасчетыПоКредитамИЗаймамОбороты.ПроцентыВалПриход
		|	КОНЕЦ КАК Курс,
		|	КурсыВалютСрезПоследних.Курс КАК КурсНаКонецМесяца,
		|	РасчетыПоКредитамИЗаймамОбороты.Контрагент,
		|	РасчетыПоКредитамИЗаймамОбороты.Организация,
		|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов КАК Валюта,
		|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл КАК СчетУчетаРегл
		|ИЗ
		|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Обороты(
		|			&НачалоМесяца,
		|			&КонецМесяца,
		|			День,
		|			ДоговорКредитаЗайма В
		|				(ВЫБРАТЬ
		|					Остатки.ДоговорКредитаЗайма
		|				ИЗ
		|					ВТ_ОстаткиПроценты КАК Остатки)) КАК РасчетыПоКредитамИЗаймамОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецМесяца, ) КАК КурсыВалютСрезПоследних
		|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДоговорКредитаЗайма,
		|	Период
		|ИТОГИ ПО
		|	ДоговорКредитаЗайма";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		СтруктураОтраженияКурсовыхРазницРегл = РегламентированныйУчетСервер.ПолучитьСтруктуруОтраженияКурсовыхРазниц2(Дата, Организация);
		
		Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
		Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
		Запрос.УстановитьПараметр("КурсоваяРазница", );
		
		ВыборкаПоДоговорамКредитов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоДоговорамКредитов.Следующий() Цикл
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ДоговорКредитаЗайма", ВыборкаПоДоговорамКредитов.ДоговорКредитаЗайма);
			СтрокиПоступления = ТаблицаВзятияКредитов.НайтиСтроки(ПараметрыОтбора);
			
			Если СтрокиПоступления.Количество() > 0 Тогда
				
				ВыборкаЗакрытиеКредита = ВыборкаПоДоговорамКредитов.Выбрать();
				КоличествоИтераций = ВыборкаЗакрытиеКредита.Количество();
				Итератор = 0;
				Пока ВыборкаЗакрытиеКредита.Следующий() Цикл
					
					Итератор = Итератор + 1;
					
					Если СтрокиПоступления[0].ПроцентыВалОстаток = 0 Тогда 
						Сумма = ВыборкаЗакрытиеКредита.ПроцентыВалПриход * ВыборкаЗакрытиеКредита.Курс;//СтрокиПоступления[0].Курс;
					Иначе
						Сумма = ВыборкаЗакрытиеКредита.ПроцентыВалПриход * СтрокиПоступления[0].Курс;
					КонецЕсли;
					
					Если Сумма = 0 И СтрокиПоступления[0].ПроцентыВалОстаток <> 0 Тогда
						
						Продолжить;
						
					КонецЕсли; 
					
					Если СтрокиПоступления[0].ПроцентыВалОстаток = 0 Тогда
						КурсоваяРазница = СтрокиПоступления[0].ПроцентыОстаток;
					Иначе
						КурсоваяРазница = ВыборкаЗакрытиеКредита.ПроцентыПриход - Сумма;
					КонецЕсли;
					
					Если Итератор = 1 И СтрокиПоступления[0].ПроцентыВалОстаток = 0 Тогда 
						НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
						
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗакрытиеКредита);
						НоваяСтрока.Период = КонецМесяца(Дата);
						НоваяСтрока.Сумма = КурсоваяРазница;
						НоваяСтрока.Содержание = НСтр("ka='დარიცხული პროცენტების საკურსო სხვაობა';ru='Курсовая разница проценты кредиты';en='Exchange difference-interest loans'");
						
						Если КурсоваяРазница < 0 Тогда
							
							Если СтрокиПоступления[0].ПроцентыВалОстаток = 0 Тогда 
								НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
								НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
							ИНАЧЕ
								НоваяСтрока.СчетДт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
								НоваяСтрока.СчетКт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
							КонецЕсли;
							
						Иначе
							
							НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
							НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
							
						КонецЕсли;
						
						Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
							НоваяСтрока.ВалютаДт = ВыборкаЗакрытиеКредита.Валюта;
						Иначе
							НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
						КонецЕсли; 
						
						Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
							НоваяСтрока.ВалютаКт = ВыборкаЗакрытиеКредита.Валюта;
						Иначе
							НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
						КонецЕсли; 
						
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); //+++ Дмгг
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
						
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); //+++ Дмгг
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
						
						
						НоваяСтрокаРасчетыПоКредитамИЗаймам = НаборЗаписейРасчетыПоКредитамИЗаймам.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаРасчетыПоКредитамИЗаймам, ВыборкаЗакрытиеКредита);
						НоваяСтрокаРасчетыПоКредитамИЗаймам.ВидДвижения = ВидДвиженияНакопления.Расход;
						НоваяСтрокаРасчетыПоКредитамИЗаймам.Проценты = КурсоваяРазница;
						НоваяСтрокаРасчетыПоКредитамИЗаймам.ПроцентыВал = 0;
						НоваяСтрокаРасчетыПоКредитамИЗаймам.Период = КонецМесяца(Дата);
						НоваяСтрокаРасчетыПоКредитамИЗаймам.СодержаниеПроводки = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница проценты кредиты';en='Exchange difference-interest loans'");
						НоваяСтрокаРасчетыПоКредитамИЗаймам.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗакрытиеМесяца;
					ИначеЕсли  Итератор <> 1 И СтрокиПоступления[0].ПроцентыВалОстаток <> 0 Тогда//И СтрокиПоступления[0].ОсновнойДолгВалОстаток <> 0 Тогда //+++ Дмгг
						НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
						
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗакрытиеКредита);
						НоваяСтрока.Период = КонецМесяца(Дата);
						НоваяСтрока.Сумма = КурсоваяРазница;
						НоваяСтрока.Содержание = НСтр("ka='დარიცხული პროცენტების საკურსო სხვაობა';ru='Курсовая разница проценты кредиты';en='Exchange difference-interest loans'");
						
						Если КурсоваяРазница < 0 Тогда
							
							Если СтрокиПоступления[0].ПроцентыВалОстаток <> 0 Тогда//СтрокиПоступления[0].ОсновнойДолгВалОстаток = 0 Тогда 
								НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
								НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
							ИНАЧЕ
								НоваяСтрока.СчетДт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
								НоваяСтрока.СчетКт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
							КонецЕсли;
							
						Иначе
							
							НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
							НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
							
						КонецЕсли;
						
						Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
							НоваяСтрока.ВалютаДт = ВыборкаЗакрытиеКредита.Валюта;
						Иначе
							НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
						КонецЕсли; 
						
						Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
							НоваяСтрока.ВалютаКт = ВыборкаЗакрытиеКредита.Валюта;
						Иначе
							НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
						КонецЕсли; 
						
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); //+++ Дмгг
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
						
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); //+++ Дмггк
						БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
						
						НоваяСтрокаРасчетыПоКредитамИЗаймам = НаборЗаписейРасчетыПоКредитамИЗаймам.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаРасчетыПоКредитамИЗаймам, ВыборкаЗакрытиеКредита);
						НоваяСтрокаРасчетыПоКредитамИЗаймам.ВидДвижения = ВидДвиженияНакопления.Расход;
						НоваяСтрокаРасчетыПоКредитамИЗаймам.Проценты = КурсоваяРазница;
						НоваяСтрокаРасчетыПоКредитамИЗаймам.ПроцентыВал = 0;
						НоваяСтрокаРасчетыПоКредитамИЗаймам.Период = КонецМесяца(Дата);
						НоваяСтрокаРасчетыПоКредитамИЗаймам.СодержаниеПроводки = НСтр("ka='დარიცხული პროცენტების საკურსო სხვაობა';ru='Курсовая разница проценты кредиты остаток';en='The exchange rate difference interest loan balance'");
						НоваяСтрокаРасчетыПоКредитамИЗаймам.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗакрытиеМесяца;
					КонецЕсли;
					
					//НоваяСтрокаОтчетПоКурсовымРазницам = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
					//НоваяСтрокаДоходыИРасходы = НаборЗаписейДоходыИРасходы.Добавить();
					//
					//Если КурсоваяРазница < 0 Тогда
					//	
					//	НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = -КурсоваяРазница;
					//	НоваяСтрокаОтчетПоКурсовымРазницам.СуммаДоходов = -КурсоваяРазница;
					//	
					//	НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
					//	НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
					//	НоваяСтрокаДоходыИРасходы.СуммаДоходов = -КурсоваяРазница;
					//	
					//Иначе
					//	
					//	НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = КурсоваяРазница;
					//	НоваяСтрокаОтчетПоКурсовымРазницам.СуммаРасходов = КурсоваяРазница;
					//	
					//	НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
					//	НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
					//	НоваяСтрокаДоходыИРасходы.СуммаРасходов = КурсоваяРазница;
					//	
					//КонецЕсли; 
					//
					//НоваяСтрокаДоходыИРасходы.Период = КонецМесяца(Дата);
					//НоваяСтрокаДоходыИРасходы.Организация = Организация;
					//НоваяСтрокаДоходыИРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					//НоваяСтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='დარიცხული პროცენტების საკურსო სხვაობა';ru='Курсовая разница проценты кредиты';en='Exchange difference-interest loans'");
					//
					//
					//НоваяСтрокаОтчетПоКурсовымРазницам.Период = КонецМесяца(Дата);
					//НоваяСтрокаОтчетПоКурсовымРазницам.Организация = Организация;
					//НоваяСтрокаОтчетПоКурсовымРазницам.Валюта = ВыборкаЗакрытиеКредита.Валюта;
					//
					//НоваяСтрокаОтчетПоКурсовымРазницам.Аналитика =
					//""
					//+ ВыборкаЗакрытиеКредита.Контрагент
					//+ " / "
					//+ ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма;
					//НоваяСтрокаОтчетПоКурсовымРазницам.Раздел = "Расчеты по кредитам и займам";
					
				КонецЦикла;	
			КонецЕсли; 
			
		КонецЦикла;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоКредитамИЗаймамОстатки.Организация,
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма,
		|	РасчетыПоКредитамИЗаймамОстатки.Контрагент,
		|	-РасчетыПоКредитамИЗаймамОстатки.ПроцентыОстаток КАК ПроцентыОстаток,
		|	-РасчетыПоКредитамИЗаймамОстатки.ПроцентыВалОстаток КАК ПроцентыВалОстаток,
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл КАК СчетУчетаПроцентовРегл,
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.ВалютаРасчетов КАК Валюта,
		|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность,1) КАК КурсВалюты
		|	
		|ИЗ
		|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(&ДатаКон, ) КАК РасчетыПоКредитамИЗаймамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютСрезПоследних
		|		ПО РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта
		|ГДЕ
		|	РасчетыПоКредитамИЗаймамОстатки.ПроцентыОстаток < 0
		|	И РасчетыПоКредитамИЗаймамОстатки.ПроцентыВалОстаток < 0";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ДоговорКредитаЗайма", Выборка.ДоговорКредитаЗайма);
			СтрокиПоступления = ТаблицаВзятияКредитов.НайтиСтроки(ПараметрыОтбора);
			
			Если СтрокиПоступления.Количество() > 0 Тогда
				
				Сумма = Выборка.ПроцентыОстаток;//Выборка.ОсновнойДолгВалОстаток * СтрокиПоступления[0].Курс;
				
				Если Сумма = 0 Тогда
					
					Продолжить;
					
				КонецЕсли; 
				
				КурсоваяРазница = (Выборка.ПроцентыВалОстаток * Выборка.КурсВалюты) - Сумма;
				
				НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
				НоваяСтрока.Период = КонецМесяца(Дата);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
				НоваяСтрока.Содержание = НСтр("ka='დარიცხული პროცენტების საკურსო სხვაობა';ru='Курсовая разница кредиты остаток';en='The exchange rate difference balance of the loan'");
				
				НоваяСтрокаОтчетПоКурсовымРазницам = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
				НоваяСтрокаДоходыИРасходы = НаборЗаписейДоходыИРасходы.Добавить();
				НоваяСтрокаРасчетыПоКредитамИЗаймам = НаборЗаписейРасчетыПоКредитамИЗаймам.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРасчетыПоКредитамИЗаймам, Выборка);
				НоваяСтрокаРасчетыПоКредитамИЗаймам.ВидДвижения = ВидДвиженияНакопления.Расход;
				НоваяСтрокаРасчетыПоКредитамИЗаймам.Проценты = КурсоваяРазница;
				НоваяСтрокаРасчетыПоКредитамИЗаймам.ПроцентыВал = 0;
				НоваяСтрокаРасчетыПоКредитамИЗаймам.Период = КонецМесяца(Дата);
				НоваяСтрокаРасчетыПоКредитамИЗаймам.СодержаниеПроводки = НСтр("ka='დარიცხული პროცენტების საკურსო სხვაობა';ru='Курсовая разница проценты кредиты остаток';en='The exchange rate difference interest loan balance'");
				НоваяСтрокаРасчетыПоКредитамИЗаймам.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗакрытиеМесяца;
				
				Если КурсоваяРазница < 0 Тогда
					
					НоваяСтрока.Сумма = -КурсоваяРазница;
					
					НоваяСтрока.СчетДт = Выборка.СчетУчетаПроцентовРегл;
					НоваяСтрока.СчетКт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
					
					НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = -КурсоваяРазница;
					НоваяСтрокаОтчетПоКурсовымРазницам.СуммаДоходов = -КурсоваяРазница;
					
					НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
					НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
					НоваяСтрокаДоходыИРасходы.СуммаДоходов = -КурсоваяРазница;
					
				Иначе
					
					НоваяСтрока.Сумма = КурсоваяРазница;
					
					НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
					НоваяСтрока.СчетКт = Выборка.СчетУчетаПроцентовРегл;
					
					НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = КурсоваяРазница;
					НоваяСтрокаОтчетПоКурсовымРазницам.СуммаРасходов = КурсоваяРазница;
					
					НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
					НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
					НоваяСтрокаДоходыИРасходы.СуммаРасходов = КурсоваяРазница;
					
				КонецЕсли; 
				
				НоваяСтрокаДоходыИРасходы.Период = КонецМесяца(Дата);
				НоваяСтрокаДоходыИРасходы.Организация = Организация;
				НоваяСтрокаДоходыИРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
				НоваяСтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='დარიცხული პროცენტების საკურსო სხვაობა';ru='Курсовая разница проценты кредиты';en='Exchange difference-interest loans'");
				
				
				НоваяСтрокаОтчетПоКурсовымРазницам.Период = КонецМесяца(Дата);
				НоваяСтрокаОтчетПоКурсовымРазницам.Организация = Организация;
				НоваяСтрокаОтчетПоКурсовымРазницам.Валюта = Выборка.Валюта;
				
				НоваяСтрокаОтчетПоКурсовымРазницам.Аналитика =
				""
				+ Выборка.Контрагент
				+ " / "
				+ Выборка.ДоговорКредитаЗайма;
				НоваяСтрокаОтчетПоКурсовымРазницам.Раздел = "Расчеты по кредитам и займам";
				
				
				Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
					НоваяСтрока.ВалютаДт = Выборка.Валюта;
				Иначе
					НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
					НоваяСтрока.ВалютаКт = Выборка.Валюта;
				Иначе
					НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
				КонецЕсли; 
				
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", Выборка.Валюта);
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", Выборка.Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", Выборка.Контрагент); //+++ Дмгг
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ДоговорыКредитовИЗаймов", Выборка.ДоговорКредитаЗайма);
				
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", Выборка.Валюта);
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", Выборка.Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", Выборка.Контрагент); //+++ Дмгг
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ДоговорыКредитовИЗаймов", Выборка.ДоговорКредитаЗайма);
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	//--------------------------------------------------------------------------
	// © Шишка В.В. [4 августа 2022 г.]  НАЧАЛО
	// Расчеты с прочими контрагентами.
	// Создадим набор записей регистра накопления РасчетыСПрочимиКонтрагентами.
	НаборЗаписейРасчетыСПрочимиКонтрагентами = РегистрыНакопления.РасчетыСПрочимиКонтрагентами.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыСПрочимиКонтрагентами.Отбор.Регистратор.Установить(Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	Запрос.УстановитьПараметр("СчетДеньгиОтрицательная", СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаДеньги);
	Запрос.УстановитьПараметр("СчетДеньгиПоложительная", СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаДеньги);
	Запрос.УстановитьПараметр("СчетЗадолженностьОтрицательная", СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность);
	Запрос.УстановитьПараметр("СчетЗадолженностьПоложительная", СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность);
	
	Запрос.УстановитьПараметр("НеПереоцениватьСчета", СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.Контрагент КАК Контрагент,
	|	ТаблицаОстатки.Договор КАК Договор,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ТаблицаОстатки.Договор.ВалютаРасчетов КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница)
	|	КОНЕЦ КАК Статья,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.СчетУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.СчетУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.СчетУчетаРегл
	|		ИНАЧЕ &СчетЗадолженностьОтрицательная
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ТаблицаОстатки.СчетУчета
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьПоложительная
	|		ИНАЧЕ ТаблицаОстатки.СчетУчетаРегл
	|	КОНЕЦ КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ТаблицаОстатки.СчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаОстатки.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ТаблицаОстатки.СчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаОстатки.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьПоложительная
	|		ИНАЧЕ &СчетЗадолженностьОтрицательная
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ТаблицаОстатки.СчетУчета КАК СчетУчетаОстатки,
	|	ТаблицаОстатки.СчетУчетаРегл КАК СчетУчетаРеглОстатки
	|ИЗ
	|	РегистрНакопления.РасчетыСПрочимиКонтрагентами.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Договор.ВалютаРасчетов = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДтРегл) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКтРегл) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейРасчетыСПрочимиКонтрагентами.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.СчетУчетаОстатки;
		НоваяСтрока.СчетУчетаРегл = ВыборкаДетальныеЗаписи.СчетУчетаРеглОстатки;
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		//НоваяСтрока = НаборЗаписейРасчетыСПрочимиКонтрагентами.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		//НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика =
			""
		  + ВыборкаДетальныеЗаписи.Контрагент
		  + " / "
		  + ВыборкаДетальныеЗаписи.Договор;
		НоваяСтрока.Раздел = "Расчеты с прочими контрагентами";
		
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетДтРегл;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетКтРегл;
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
			НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
			НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", ВыборкаДетальныеЗаписи.Контрагент); //+++ Дмгг
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Договоры", ВыборкаДетальныеЗаписи.Договор);
	
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", ВыборкаДетальныеЗаписи.Контрагент); //+++ Дмгг
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Договоры", ВыборкаДетальныеЗаписи.Договор);
		
	КонецЦикла;
	НаборЗаписейРасчетыСПрочимиКонтрагентами.Записать(Ложь);
	// © Шишка В.В. [4 августа 2022 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	// Пишем оставшиеся записи.
	НаборЗаписейДенежныеСредства.Записать(Ложь);
	НаборЗаписейДенежныеСредстваВКассахККМ.Записать(Ложь);
	НаборЗаписейРасчетыСПерсоналом.Записать(Ложь);
	НаборЗаписейРасчетыСПодотчетниками.Записать(Ложь);
	НаборЗаписейРасчетыСПокупателями.Записать(Ложь);
	НаборЗаписейРасчетыСПоставщиками.Записать(Ложь);
	НаборЗаписейДоходыИРасходы.Записать(Ложь);
	ТаблицаЗаписей = НаборЗаписейОтчетПоКурсовымРазницам.Выгрузить();
	ТаблицаЗаписей.Свернуть("Период, Активность, Организация, Аналитика, Валюта, Раздел", "Сумма, СуммаДоходов, СуммаРасходов, СуммаОстаток, СуммаВалОстаток");
	НаборЗаписейОтчетПоКурсовымРазницам.Загрузить(ТаблицаЗаписей);
	НаборЗаписейОтчетПоКурсовымРазницам.Записать(Ложь);
	Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда  //+++ Дмгг
		НаборЗаписейУправленческий.Записать(Ложь);
	КонецЕсли;  //--- Дмгг
	НаборЗаписейХозрасчетный.Записать(Ложь);
	НаборЗаписейРасчетыПоКредитамИЗаймам.Записать(Ложь);
	
КонецПроцедуры

&Вместо("СвернутьНаборЗаписейДоходыИРасходы")
Процедура AzRyFix_СвернутьНаборЗаписейДоходыИРасходы(НаборЗаписейРегистра)
		
	Если Не AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца Тогда		
		ПродолжитьВызов(НаборЗаписейРегистра);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоходыИРасходы.Период,
	|	ДоходыИРасходы.Активность,
	|	ДоходыИРасходы.Организация,
	|	ДоходыИРасходы.СтруктурнаяЕдиница,
	|	ДоходыИРасходы.НаправлениеДеятельности,
	|	ДоходыИРасходы.ЗаказПокупателя,
	|	ДоходыИРасходы.СчетУчета,
	|	ДоходыИРасходы.Аналитика,
	|	СУММА(ДоходыИРасходы.СуммаДоходов) КАК СуммаДоходов,
	|	СУММА(ДоходыИРасходы.СуммаРасходов) КАК СуммаРасходов,
	|	ДоходыИРасходы.СодержаниеПроводки,
	|	ДоходыИРасходы.СчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.ДоходыИРасходы КАК ДоходыИРасходы
	|ГДЕ
	|	ДоходыИРасходы.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыИРасходы.Период,
	|	ДоходыИРасходы.Активность,
	|	ДоходыИРасходы.Организация,
	|	ДоходыИРасходы.СтруктурнаяЕдиница,
	|	ДоходыИРасходы.НаправлениеДеятельности,
	|	ДоходыИРасходы.ЗаказПокупателя,
	|	ДоходыИРасходы.СчетУчета,
	|	ДоходыИРасходы.Аналитика,
	|	ДоходыИРасходы.СодержаниеПроводки,
	|	ДоходыИРасходы.СчетУчетаРегл
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДоходыИРасходы.СуммаДоходов) <> 0
	|		ИЛИ СУММА(ДоходыИРасходы.СуммаРасходов) <> 0)";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра);	
	
КонецПроцедуры

&Вместо("СвернутьНаборЗаписейЗапасы")
Процедура AzRyFix_СвернутьНаборЗаписейЗапасы(НаборЗаписейРегистра)
	
	Если Не AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца Тогда		
		ПродолжитьВызов(НаборЗаписейРегистра);
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Запасы.Период,
	|	Запасы.Активность,
	|	Запасы.ВидДвижения,
	|	Запасы.Организация,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.СчетУчета,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия,
	|	Запасы.ЗаказПокупателя,
	|	СУММА(Запасы.Количество) КАК Количество,
	|	СУММА(Запасы.Сумма) КАК Сумма,
	|	Запасы.КоррСтруктурнаяЕдиница,
	|	Запасы.КоррСчетУчета,
	|	Запасы.КоррНоменклатура,
	|	Запасы.КоррХарактеристика,
	|	Запасы.КоррПартия,
	|	Запасы.КоррЗаказПокупателя,
	|	Запасы.Спецификация,
	|	Запасы.КоррСпецификация,
	|	Запасы.ЗаказПродажи,
	|	Запасы.Подразделение,
	|	Запасы.Ответственный,
	|	Запасы.ДокументПродажи,
	|	Запасы.СтавкаНДС,
	|	Запасы.ФиксированнаяСтоимость,
	|	Запасы.ЗатратыНаВыпуск,
	|	Запасы.Возврат,
	|	Запасы.СодержаниеПроводки,
	|	Запасы.ПеремещениеВРозницуСуммовойУчет,
	|	Запасы.СчетУчетаРегл,
	|	Запасы.КоррСчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Период,
	|	Запасы.Активность,
	|	Запасы.ВидДвижения,
	|	Запасы.Организация,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.СчетУчета,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия,
	|	Запасы.ЗаказПокупателя,
	|	Запасы.КоррСтруктурнаяЕдиница,
	|	Запасы.КоррСчетУчета,
	|	Запасы.КоррНоменклатура,
	|	Запасы.КоррХарактеристика,
	|	Запасы.КоррПартия,
	|	Запасы.КоррЗаказПокупателя,
	|	Запасы.Спецификация,
	|	Запасы.КоррСпецификация,
	|	Запасы.ЗаказПродажи,
	|	Запасы.Подразделение,
	|	Запасы.Ответственный,
	|	Запасы.ДокументПродажи,
	|	Запасы.СтавкаНДС,
	|	Запасы.ФиксированнаяСтоимость,
	|	Запасы.ЗатратыНаВыпуск,
	|	Запасы.Возврат,
	|	Запасы.СодержаниеПроводки,
	|	Запасы.ПеремещениеВРозницуСуммовойУчет,
	|	Запасы.СчетУчетаРегл,
	|	Запасы.КоррСчетУчетаРегл
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Запасы.Количество) <> 0
	|		ИЛИ СУММА(Запасы.Сумма) <> 0)";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра); 
	
КонецПроцедуры

&Вместо("СвернутьНаборЗаписейПродажи")
Процедура AzRyFix_СвернутьНаборЗаписейПродажи(НаборЗаписейРегистра)
	
	Если Не AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца Тогда		
		ПродолжитьВызов(НаборЗаписейРегистра);
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Продажи.Период,
	|	Продажи.Активность,
	|	Продажи.Номенклатура,
	|	Продажи.Характеристика,
	|	Продажи.Партия,
	|	Продажи.Документ,
	|	Продажи.СтавкаНДС,
	|	Продажи.Организация,
	|	Продажи.ЗаказПокупателя,
	|	Продажи.Подразделение,
	|	Продажи.Ответственный,
	|	СУММА(Продажи.Количество) КАК Количество,
	|	СУММА(Продажи.Сумма) КАК Сумма,
	|	СУММА(Продажи.СуммаНДС) КАК СуммаНДС,
	|	СУММА(Продажи.Себестоимость) КАК Себестоимость
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Активность,
	|	Продажи.Номенклатура,
	|	Продажи.Характеристика,
	|	Продажи.Партия,
	|	Продажи.Документ,
	|	Продажи.СтавкаНДС,
	|	Продажи.Организация,
	|	Продажи.ЗаказПокупателя,
	|	Продажи.Подразделение,
	|	Продажи.Ответственный
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Продажи.Количество) <> 0
	|		ИЛИ СУММА(Продажи.Сумма) <> 0
	|		ИЛИ СУММА(Продажи.СуммаНДС) <> 0
	|		ИЛИ СУММА(Продажи.Себестоимость) <> 0)";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра);
		
КонецПроцедуры

&Вместо("СвернутьНаборЗаписейХозрасчетный")
Процедура AzRyFix_СвернутьНаборЗаписейХозрасчетный(НаборЗаписейРегистра)

	Если Не AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца Тогда		
		ПродолжитьВызов(НаборЗаписейРегистра);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Период,
	|	Хозрасчетный.Активность,
	|	Хозрасчетный.СчетДт,
	|	Хозрасчетный.СчетКт,
	|	Хозрасчетный.Организация,
	|	Хозрасчетный.ВалютаДт,
	|	Хозрасчетный.ВалютаКт,
	|	СУММА(Хозрасчетный.Сумма) КАК Сумма,
	|	СУММА(Хозрасчетный.ВалютнаяСуммаДт) КАК ВалютнаяСуммаДт,
	|	СУММА(Хозрасчетный.ВалютнаяСуммаКт) КАК ВалютнаяСуммаКт,
	|	Хозрасчетный.Содержание,
	|	Хозрасчетный.СубконтоДт1,
	|	Хозрасчетный.СубконтоДт2,
	|	Хозрасчетный.СубконтоДт3,
	|	Хозрасчетный.СубконтоКт1,
	|	Хозрасчетный.СубконтоКт2,
	|	Хозрасчетный.СубконтоКт3,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт1, """") КАК ВидСубконтоДт1,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт2, """") КАК ВидСубконтоДт2,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт3, """") КАК ВидСубконтоДт3,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт1, """") КАК ВидСубконтоКт1,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт2, """") КАК ВидСубконтоКт2,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт3, """") КАК ВидСубконтоКт3,
	|	СУММА(Хозрасчетный.КоличествоДт) КАК КоличествоДт,
	|	СУММА(Хозрасчетный.КоличествоКт) КАК КоличествоКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(, , Регистратор = &Регистратор, , ) КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Хозрасчетный.Период,
	|	Хозрасчетный.Активность,
	|	Хозрасчетный.СчетДт,
	|	Хозрасчетный.СчетКт,
	|	Хозрасчетный.Организация,
	|	Хозрасчетный.ВалютаДт,
	|	Хозрасчетный.ВалютаКт,
	|	Хозрасчетный.Содержание,
	|	Хозрасчетный.СубконтоДт1,
	|	Хозрасчетный.СубконтоДт2,
	|	Хозрасчетный.СубконтоДт3,
	|	Хозрасчетный.СубконтоКт1,
	|	Хозрасчетный.СубконтоКт2,
	|	Хозрасчетный.СубконтоКт3,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт2, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт3, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт1, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт2, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт3, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт1, """")
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Хозрасчетный.Сумма) <> 0
	|		ИЛИ СУММА(Хозрасчетный.ВалютнаяСуммаДт) <> 0
	|		ИЛИ СУММА(Хозрасчетный.ВалютнаяСуммаКт) <> 0)"; 

	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	//НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра);
	Для Каждого Стр Из ТаблицаЗаписейРегистра Цикл
		
		НоваяСтрока = НаборЗаписейРегистра.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		
		Д = 1;
		Пока Д <= 3 Цикл
			Если Стр["ВидСубконтоДт" + Строка(Д)] <> "" Тогда 
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, Стр["ВидСубконтоДт" + Строка(Д)].ИмяПредопределенныхДанных, Стр["СубконтоДт" + Строка(Д)]);
			КонецЕсли;
			Д = Д + 1;
		КонецЦикла;
		
		К = 1;
		Пока К <= 3 Цикл
			Если Стр["ВидСубконтоКт" + Строка(К)] <> "" Тогда 
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, Стр["ВидСубконтоКт" + Строка(К)].ИмяПредопределенныхДанных, Стр["СубконтоКт" + Строка(К)]);
			КонецЕсли;
			К = К + 1;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура AzRyFix_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца Тогда		
		ПродолжитьВызов(Отказ, РежимПроведения);
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ДобавитьРеквизитыВДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	// Разрешение записи наборов записей.
	УстановитьСвойстваНаборовЗаписейДокумента(Истина);
	
	НаборЗаписейОшибкиЗакрытияМесяца = РегистрыСведений.ОшибкиЗакрытияМесяца.СоздатьНаборЗаписей();
	НаборЗаписейОшибкиЗакрытияМесяца.Отбор.Регистратор.Установить(Ссылка);
	ТаблицаОшибок = НаборЗаписейОшибкиЗакрытияМесяца.ВыгрузитьКолонки();
	
	// Расчет прямых затрат.
	Если РасчетПрямыхЗатрат Тогда
		РассчитатьСтоимостьВозвратов(); // предварительный расчет стоимости возвратов.
		РассчитатьФактическуюСебестоимостьВыпуска(Отказ, "РасчетПрямыхЗатрат", ТаблицаОшибок);
		РассчитатьСтоимостьВозвратов(); // окончательный расчет стоимости возвратов.
	КонецЕсли;
	
	// Распределение затрат.
	Если РаспределениеЗатрат Тогда
		РаспределитьЗатраты(Отказ, ТаблицаОшибок);
	КонецЕсли;
	
	// Расчет фактической себестоимости.
	Если РасчетФактическойСебестоимости Тогда
		РассчитатьСтоимостьВозвратов(); // предварительный расчет стоимости возвратов.
		РассчитатьФактическуюСебестоимостьВыпуска(Отказ, "РасчетФактическойСебестоимости", ТаблицаОшибок);
		РассчитатьСтоимостьВозвратов(); // окончательный расчет стоимости возвратов.
	КонецЕсли;
	
	// Расчет себестоимости в рознице суммовой учет.
	Если РасчетСебестоимостиВРозницеСуммовойУчет Тогда
		РассчитатьСебестоимостьВРозницеСуммовойУчет(Отказ, ТаблицаОшибок);
	КонецЕсли;
	
	// Расчет курсовых разниц.
	Если РасчетКурсовыхРазниц Тогда
		РассчитатьКурсовыеРазницы(Отказ, ТаблицаОшибок);
	КонецЕсли;
	
	// Расчет финансового результата.
	Если РасчетФинансовогоРезультата Тогда
		РассчитатьФинансовыйРезультат(Отказ, ТаблицаОшибок);
		РассчитатьФинансовыйРезультатРегл(Отказ);
	КонецЕсли;
	
	Если ТаблицаОшибок.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ka='კალენდარული თვის დახურვისას ფორმირებული იქნა გაფრთხილებები! დაწვრილებით, იხ. ანგარიშგებაში კალენდარული თვის დახურვის თაობაზე.';ru='При закрытии месяца были сформированы предупреждения! Подробнее см. в отчете о закрытии месяца.';en='At the close of the month were established warning! For details, see. In the closing months of the report.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	// Сворачивание наборов записей регистров.
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейЗапасы(НаборЗаписейЗапасы);
	НаборЗаписейЗапасы.Записать(Истина);
	
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейДоходыИРасходы(НаборЗаписейДоходыИРасходы);
	НаборЗаписейДоходыИРасходы.Записать(Истина);
	
	НаборЗаписейПродажи = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НаборЗаписейПродажи.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейПродажи(НаборЗаписейПродажи);
	НаборЗаписейПродажи.Записать(Истина);
	
	НаборЗаписейФинансовыйРезультат = РегистрыНакопления.ФинансовыйРезультат.СоздатьНаборЗаписей();
	НаборЗаписейФинансовыйРезультат.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейФинансовыйРезультат(НаборЗаписейФинансовыйРезультат);
	НаборЗаписейФинансовыйРезультат.Записать(Истина);
	
	Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата) Тогда //+++ Дмгг
		НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
		НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
		СвернутьНаборЗаписейУправленческий(НаборЗаписейУправленческий);
		НаборЗаписейУправленческий.Записать(Ложь);
	КонецЕсли; //--- Дмгг
	
	НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейХозрасчетный(НаборЗаписейХозрасчетный);
	НаборЗаписейХозрасчетный.Записать(Истина);
	
	ТаблицаОшибок.Свернуть("Период, Регистратор, Активность, Организация, ВидОперации, ОписаниеОшибки, Аналитика");
	НаборЗаписейОшибкиЗакрытияМесяца.Загрузить(ТаблицаОшибок);
	НаборЗаписейОшибкиЗакрытияМесяца.Записать(Истина);
	
	// Запрет записи наборов записей.
	УстановитьСвойстваНаборовЗаписейДокумента(Ложь);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
		
КонецПроцедуры

&После("ПередЗаписью")
Процедура AzRyFix_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца = Константы.AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца.Получить();
	
КонецПроцедуры

AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца = Константы.AzRyИспользоватьСтаруюВерсиюЗакрытияМесяца.Получить();