
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
	КонецЕсли;
	
	УстановитьПараметрыСписка();
		
	ЗаполнитьУсловноеОформлениеСписка();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	МодульГрупповоеИзменениеОбъектовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ГрупповоеИзменениеОбъектовКлиент");
	МодульГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	
	Список.Параметры.УстановитьЗначениеПараметра("КалендарьНеЗаполнен", НСтр("ka='საწარმოო კალენდარი არ არის შევსებული';ru='Производственный календарь не заполнен';en='Factory calendar is empty'"));
	Список.Параметры.УстановитьЗначениеПараметра("КалендарьНеЗаполненНаГод", НСтр("ka='მორიგი კალენდარული წლის საწარმოო კალენდარი არ არის შევსებული';ru='Производственный календарь не заполнен на очередной календарный год';en='Factory calendar is empty for the next calendar year'"));
	Список.Параметры.УстановитьЗначениеПараметра("ГрафикНеЗаполнен", НСтр("ka='მორიგი კალენდარული წლის გრაფიკი არ შევსებულა';ru='График не был заполнен на очередной календарный год';en='The schedule was not filled for the next calendar year'"));
	Список.Параметры.УстановитьЗначениеПараметра("ПериодГрафикаОграничен", НСтр("ka='გრაფიკის შევსების პერიოდი შეზღუდულია (იხ. ველი ""დასრულების თარიღი"")';ru='Период заполнения графика ограничен (см. поле «Дата окончания»)';en='Filling the restricted period schedule (see. The ""end date"")'"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ВладелецГрафика", , ВидСравненияКомпоновкиДанных.НеЗаполнено, , ,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловноеОформлениеСписка()
	
	НовыйЭлемент = Список.УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НовыйЭлемент.Отбор, "ТребуетЗаполнения", Истина);
	
	Оформление = НовыйЭлемент.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение = ЦветаСтиля.ПросроченныеДанныеЦвет;
	Оформление.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти
