#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредства(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("РасходДенежныхСредств", НСтр("ka='ფულადი სახსრების დანახარჯი';ru='Расход денежных средств';en='Flow of funds'"));
	Запрос.УстановитьПараметр("ПеремещениеДенежныхСредств", НСтр("ka='ფულადი სახსრების გადაადგილება';ru='Перемещение денежных средств';en='Moving funds'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	Запрос.УстановитьПараметр("ИспользуютсяПереводыВПути",РегистрыСведений.ПрименениеПереводовВПути.ИспользуютсяПереводыВПути(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата,СтруктураДополнительныеСвойства.ДляПроведения.Организация));
	
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаДС", ДокументСсылкаРасходИзКассы.ВалютаДенежныхСредств);
	
	//ПодольскийАИ #УчетПроектов 09.02.2021 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 09.02.2021 }
	
	//Если ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь") Тогда
	//	Итог = ДокументСсылкаРасходИзКассы.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	//Иначе
		Итог = 0;
	//КонецЕсли;
	ОстатокСуммы = ДокументСсылкаРасходИзКассы.СуммаДокумента - Итог;
	Запрос.УстановитьПараметр("ПлатежныйКалендарь", ЛОЖЬ);//ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"));
	Запрос.УстановитьПараметр("ОстатокСуммы", ОстатокСуммы);
	Запрос.УстановитьПараметр("УчетВалютныхОпераций", ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	1 КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|		ИНАЧЕ &РасходДенежныхСредств
	|	КОНЕЦ КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные) КАК ТипДенежныхСредств,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	ТаблицаДокумента.Касса КАК БанковскийСчетКасса,
	|	ТаблицаДокумента.АналитикаДДС КАК Аналитика,
	|	ТаблицаДокумента.ВалютаДенежныхСредств КАК Валюта,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(&ОстатокСуммы) КАК СуммаВал,
	|	-СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаДляОстатка,
	|	-СУММА(&ОстатокСуммы) КАК СуммаВалДляОстатка,
	|	ТаблицаДокумента.КассаСчетУчета КАК СчетУчета,
	|	ТаблицаДокумента.КассаСчетУчетаРегл КАК СчетУчетаРегл,
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ТаблицаДокумента.Проект КАК Проект
	////+++ Дмгг
	////|	ТаблицаДокумента.Проект КАК Проект
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаДокумента.Проект
	//|	КОНЕЦ КАК Проект
	////Lazare_
	
	|ПОМЕСТИТЬ ВременнаяТаблицаДенежныеСредства
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Подотчетнику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Прочее)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.НаРасходы)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаЗаймаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаКредитаКонтрагенту)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Налоги)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк))
	|	И &ОстатокСуммы > 0
	|
	|СГРУППИРОВАТЬ ПО
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ТаблицаДокумента.Проект,
	////+++ Дмгг
	////|	ТаблицаДокумента.Проект,
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаДокумента.Проект
	//|	КОНЕЦ,
	////Lazare_
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Касса,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.КассаСчетУчета,
	|	ТаблицаДокумента.КассаСчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|		ИНАЧЕ &РасходДенежныхСредств
	|	КОНЕЦ,
	|	ТаблицаДокумента.АналитикаДДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|		ИНАЧЕ &РасходДенежныхСредств
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Касса,
	|	ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	////+++ Дмгг
	////|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//|	КОНЕЦ КАК Проект
	////Lazare_
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	(ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Подотчетнику)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Прочее)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.НаРасходы)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаЗаймаСотруднику)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаКредитаКонтрагенту)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Налоги)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк))
	|	И &ПлатежныйКалендарь
	|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа > 0
	|
	|СГРУППИРОВАТЬ ПО
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////+++ Дмгг
	////|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//|	КОНЕЦ,
	////Lazare_ 
	
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|		ИНАЧЕ &РасходДенежныхСредств
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Касса,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&РасходДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Касса,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	////+++ Дмгг
	////|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//|	КОНЕЦ КАК Проект
	////Lazare_ 
	
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	(ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю))
	|
	|СГРУППИРОВАТЬ ПО
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////+++ Дмгг
	////|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//|	КОНЕЦ,
	////Lazare_
	
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Касса,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	МАКСИМУМ(ВыплатаЗаработнойПлаты.НомерСтроки),
	|	&РасходДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные),
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса,
	//Паганини#Удержания_
	//|	ПлатежнаяВедомостьСотрудники.Сотрудник,
	|	ВЫБОР
	|		КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.Сотрудник
	|	КОНЕЦ,
	//_Паганини#Удержания
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	
	//Малышев 2024-10-28 ONESOFT-3523 (-- Сумма
	//|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов = &ВалютаУчета и ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов<>ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента
	|				ТОГДА ПлатежнаяВедомостьСотрудники.СуммаРасчетов
	|			ИНАЧЕ //типовой
	|				ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) 
	|		КОНЕЦ
	|	КАК ЧИСЛО(15, 2))),
	//Малышев 2024-10-28 ONESOFT-3523 --) Сумма
	
	
	//Малышев 2024-10-28 ONESOFT-3523 (-- СуммаВал
	//|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаПлатежа),
	|	СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов = &ВалютаУчета и ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов<>ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента
	|				ТОГДА ПлатежнаяВедомостьСотрудники.СуммаРасчетов / (КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность)
	|			ИНАЧЕ //типовой
	|				ПлатежнаяВедомостьСотрудники.СуммаПлатежа 
	|		КОНЕЦ
	|	КАК ЧИСЛО(15, 2))),
	//Малышев 2024-10-28 ONESOFT-3523 --) СуммаВал
	
	
	//Малышев 2024-10-28 ONESOFT-3523 (-- СуммаДляОстатка
	//|	-СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов = &ВалютаУчета и ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов<>ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента
	|				ТОГДА ПлатежнаяВедомостьСотрудники.СуммаРасчетов
	|			ИНАЧЕ //типовой
	|				ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) 
	|		КОНЕЦ
	|	КАК ЧИСЛО(15, 2))),
	//Малышев 2024-10-28 ONESOFT-3523 --) СуммаДляОстатка
	
	//Малышев 2024-10-28 ONESOFT-3523 (-- СуммаВалДляОстатка
	//|	-СУММА(ПлатежнаяВедомостьСотрудники.СуммаПлатежа),
	|	-СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов = &ВалютаУчета и ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов<>ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента
	|				ТОГДА ПлатежнаяВедомостьСотрудники.СуммаРасчетов / (КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность)
	|			ИНАЧЕ //типовой
	|				ПлатежнаяВедомостьСотрудники.СуммаПлатежа 
	|		КОНЕЦ
	|	КАК ЧИСЛО(15, 2))),
	//Малышев 2024-10-28 ONESOFT-3523 --) СуммаВалДляОстатка
	
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса.СчетУчета,
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса.СчетУчетаРегл,
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником КАК Проект
	////+++ Дмгг
	////|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником КАК Проект
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	//|	КОНЕЦ КАК Проект
	////Lazare_ 
	
	|ИЗ
	|	Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходИзКассы.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|			ПО ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|		ПО ПлатежнаяВедомостьСотрудники.Ссылка = ВыплатаЗаработнойПлаты.Ведомость
	//ПодольскийАИ #УчетПроектов 12.02.2021 {
	|			И (ПлатежнаяВедомостьСотрудники.Проект = ВыплатаЗаработнойПлаты.Проект
	|				ИЛИ (ПлатежнаяВедомостьСотрудники.Проект = ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником
	|						И ВыплатаЗаработнойПлаты.Проект = Значение(Справочник.Проекты.ПустаяСсылка)))
	//ПодольскийАИ #УчетПроектов 12.02.2021 }
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка как ВременнаяТаблицаШапка ПО ИСТИНА //Малышев 
	|ГДЕ
	|	ВыплатаЗаработнойПлаты.Ссылка = &Ссылка
	|	И ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Зарплата)
	|
	|СГРУППИРОВАТЬ ПО
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	////+++ Дмгг
	////|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	////--- Дмгг
	////_Lazare
	//|	ВыплатаЗаработнойПлаты.Проект,
	//|   ВЫБОР
	//|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	//|	КОНЕЦ,
	////Lazare_
	
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса.СчетУчета,
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса.СчетУчетаРегл,
	//Паганини#Удержания_
	//|	ПлатежнаяВедомостьСотрудники.Сотрудник,
	|	ВЫБОР
	|		КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.Сотрудник
	|	КОНЕЦ
	//_Паганини#Удержания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	2,
	|	&ПеремещениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.СчетОрганизации,
	|	ТаблицаДокумента.Касса,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(&ОстатокСуммы),
	|	-СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(&ОстатокСуммы),
	|	ТаблицаДокумента.КассаСчетУчета,
	|	ТаблицаДокумента.КассаСчетУчетаРегл,
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ТаблицаДокумента.Проект КАК Проект
	////+++ Дмгг
	////|	ТаблицаДокумента.Проект КАК Проект
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаДокумента.Проект
	//|	КОНЕЦ КАК Проект
	////Lazare_
	
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|	И НЕ &ИспользуютсяПереводыВПути
	|	И &ОстатокСуммы > 0
	|
	|СГРУППИРОВАТЬ ПО
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ТаблицаДокумента.Проект,
	////+++ Дмгг
	////|	ТаблицаДокумента.Проект,
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаДокумента.Проект
	//|	КОНЕЦ ,
	////Lazare_ 
	
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Касса,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.КассаСчетУчета,
	|	ТаблицаДокумента.КассаСчетУчетаРегл,
	|	ТаблицаДокумента.СчетОрганизации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&ПеремещениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Касса,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	////+++ Дмгг
	////|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//|	КОНЕЦ КАК Проект
	////Lazare_
	
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|	И НЕ &ИспользуютсяПереводыВПути
	|	И &ПлатежныйКалендарь
	|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа > 0
	|
	|СГРУППИРОВАТЬ ПО
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////+++ Дмгг
	////|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//|	КОНЕЦ ,
	////Lazare_
	
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Касса,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетОрганизации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	1,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|		ИНАЧЕ &РасходДенежныхСредств
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные),
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.СчетОрганизации,
	|	ТаблицаДокумента.АналитикаДДС,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(&ОстатокСуммы),
	|	-СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(&ОстатокСуммы),
	|	ТаблицаДокумента.СчетОрганизации.СчетУчета,
	|	ТаблицаДокумента.СчетОрганизации.СчетУчетаРегл,
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ТаблицаДокумента.Проект КАК Проект
	////+++ Дмгг
	////|	ТаблицаДокумента.Проект КАК Проект
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаДокумента.Проект
	//|	КОНЕЦ КАК Проект
	////Lazare_ 
	
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Подотчетнику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Прочее)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.НаРасходы)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаЗаймаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаКредитаКонтрагенту)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Налоги)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк))
	|	И ТаблицаДокумента.ЭтоПеремещение
	|	И &ОстатокСуммы > 0
	|	И &ИспользуютсяПереводыВПути //+++ Дмгг
	|
	|СГРУППИРОВАТЬ ПО
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ТаблицаДокумента.Проект,
	////+++ Дмгг
	////|	ТаблицаДокумента.Проект,
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаДокумента.Проект
	//|	КОНЕЦ,
	////Lazare_
	
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.СчетОрганизации,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.СчетОрганизации.СчетУчета,
	|	ТаблицаДокумента.СчетОрганизации.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|			ТОГДА &ПеремещениеДенежныхСредств
	|		ИНАЧЕ &РасходДенежныхСредств
	|	КОНЕЦ,
	|	ТаблицаДокумента.АналитикаДДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	//+++ Дмгг
	|	Проект,
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ Проект
	//|	КОНЕЦ,
	////Lazare_
	|	Организация,
	|	ТипДенежныхСредств,
	|	БанковскийСчетКасса,
	|	Валюта,
	|	СчетУчета";
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков денежных средств.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаДенежныеСредства.Организация КАК Организация,
	|	ВременнаяТаблицаДенежныеСредства.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ВременнаяТаблицаДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ВременнаяТаблицаДенежныеСредства.Валюта КАК Валюта,
	
	//Малышев 2025-01-28 ONESOFT-3797 - вернул обратно, т.к. проект заполнен при инициализации
	|	ВременнаяТаблицаДенежныеСредства.Проект КАК Проект
	////+++ Дмгг
	////|	ВременнаяТаблицаДенежныеСредства.Проект КАК Проект
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА 	ВременнаяТаблицаДенежныеСредства.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ 	ВременнаяТаблицаДенежныеСредства.Проект
	//|	КОНЕЦ КАК Проект
	////Lazare
	|ИЗ
	|	ВременнаяТаблицаДенежныеСредства КАК ВременнаяТаблицаДенежныеСредства";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДенежныеСредства");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредства(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредстваРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДенежныеСредства()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредстваВКассахККМ(ДокументСсылкаПоступлениеВКассу, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.КассаККМ КАК КассаККМ,
	|	ТаблицаДокумента.ВалютаДенежныхСредств КАК Валюта,
	|	СУММА(ТаблицаДокумента.Сумма) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаДляОстатка,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВалДляОстатка,
	|	ТаблицаДокумента.КассаККМСчетУчета КАК СчетУчета,
	|	ТаблицаДокумента.КассаККМСчетУчетарегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	&ПоступлениеДенежныхСредств КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаДенежныеСредстваВКассахККМ
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.КассаККМ,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.КассаККМСчетУчетарегл,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.КассаККМСчетУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	КассаККМ,
	|	Валюта,
	|	СчетУчета,
	|	СчетУчетаРегл"; //+++ Дмгг
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПоступлениеВКассу);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("ПоступлениеДенежныхСредств", НСтр("ka='ფულადი სახსრების შემოსვლა სსა-ის სალაროში';ru='Поступление денежных средств в кассу ККМ';en='Receipt of cash in hand CMC'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков денежных средств.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаДенежныеСредстваВКассахККМ.Организация КАК Организация,
	|	ВременнаяТаблицаДенежныеСредстваВКассахККМ.КассаККМ КАК КассаККМ
	|ИЗ
	|	ВременнаяТаблицаДенежныеСредстваВКассахККМ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДенежныеСредстваВКассахККМ");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредстваВКассахККМ(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредстваВКассахККМРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваВКассахККМ", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДенежныеСредстваВКассахККМ()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВозникновениеДолгаПодотчетника", НСтр("ka='საქვეანგარიშო პირის ვალის წარმოშობა';ru='Возникновение долга подотчетника';en='The emergence of debt podotchetnika'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	//ПодольскийАИ #УчетПроектов 09.02.2021 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 09.02.2021 }
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	&ВозникновениеДолгаПодотчетника КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Касса КАК Касса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|			ТОГДА &Ссылка
	|		ИНАЧЕ ТаблицаДокумента.Документ
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.Подотчетник КАК Сотрудник,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.ВалютаДенежныхСредств КАК Валюта,
	|	СУММА(ТаблицаДокумента.Сумма) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаДляОстатка,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВалДляОстатка,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетниками
	|		ИНАЧЕ ТаблицаДокумента.Подотчетник.СчетРасчетовПоПерерасходу
	|	КОНЕЦ КАК СчетУчета,
	//+++
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетникамиРегл
	|		ИНАЧЕ ТаблицаДокумента.Подотчетник.СчетРасчетовПоПерерасходуРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	//---
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект КАК Проект
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект
	//Lazare
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПодотчетниками
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Подотчетнику)
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ, 
	//Lazare
	|	ТаблицаДокумента.Касса,
	|	ТаблицаДокумента.Подотчетник,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.Статья,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|			ТОГДА &Ссылка
	|		ИНАЧЕ ТаблицаДокумента.Документ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетниками
	|		ИНАЧЕ ТаблицаДокумента.Подотчетник.СчетРасчетовПоПерерасходу
	|	КОНЕЦ,
	//+++
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетникамиРегл
	|		ИНАЧЕ ТаблицаДокумента.Подотчетник.СчетРасчетовПоПерерасходуРегл
	|	КОНЕЦ
	//---
	|
	|ИНДЕКСИРОВАТЬ ПО
	//+++ Дмгг
	//|	Проект,
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ Проект
	|	КОНЕЦ,
	//Lazare
	|	Организация,
	|	Сотрудник,
	|	Валюта,
	|	Документ,
	|	СчетУчета,
	|	СчетУчетаРегл";
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с подотчетными лицами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПодотчетниками.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПодотчетниками.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблицаРасчетыСПодотчетниками.Валюта КАК Валюта,
	|	ВременнаяТаблицаРасчетыСПодотчетниками.Документ КАК Документ
	//ПодольскийАИ #УчетПроектов 11.02.2021 {
	//Исправление ошибок. Было---
	////+++ Дмгг
	////|	ВременнаяТаблицаРасчетыСПодотчетниками.Проект КАК Проект
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ВременнаяТаблицаРасчетыСПодотчетниками.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ВременнаяТаблицаРасчетыСПодотчетниками.Проект
	//|	КОНЕЦ КАК Проект
	////Lazare
	//ПодольскийАИ #УчетПроектов 11.02.2021 }
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПодотчетниками КАК ВременнаяТаблицаРасчетыСПодотчетниками";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПодотчетниками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПодотчетниками(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПодотчетникамиРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПодотчетниками", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПодотчетниками()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВозникновениеАвансаПоставщику", "Возникновение аванса поставщику");
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	//Паганини#Удержания_
	Запрос.УстановитьПараметр("ВалютаУчета",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета"));
	Запрос.УстановитьПараметр("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении"));
	Запрос.УстановитьПараметр("ПогашениеОбязательствПередПоставщиком", НСтр("ka='მომწოდებლის წინაშე ვალდებულებების დაფარვა';ru='Погашение обязательств перед поставщиком';en='Repayment of liabilities to the supplier'"));
	Запрос.УстановитьПараметр("ПогашениеОбязательствПередПерсоналом", НСтр("ka='პერსონალის წინაშე ვალდებულებების დაფარვა';ru='Погашение обязательств перед персоналом';en='Repayment of liabilities to employees'"));
	//_Паганини#Удержания
	
	//ПодольскийАИ #УчетПроектов 09.02.2021 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 09.02.2021 }
	
	//Паганини_Добавлена 5 поля: "ТипНДФЛ","СуммаНДФЛ","СуммаНДФЛВал", "КурсПоступления", "КратностьПоступления"_Паганини
	Запрос.Текст =
	"ВЫБРАТЬ 
	|	1 как Порядок,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Касса КАК Касса,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ КАК ТипРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Дата,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК Сумма,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВал,
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК СуммаДляОстатка,
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВалДляОстатка,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ КАК СчетУчета,
	//+++
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	//---
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья КАК Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов КАК Валюта,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияНДФЛ,
	//Паганини ПФ_
	//|	ВЫБОР
	//|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	//|			ТОГДА 0
	//|		ИНАЧЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета / (1 - ВременнаяТаблицаРасшифровкаПлатежа.СтавкаНДФЛ / 100) КАК ЧИСЛО(15, 2))) - ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета
	//|	КОНЕЦ КАК СуммаНДФЛ,
	//|	ВЫБОР
	//|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	//|			ТОГДА 0
	//|		ИНАЧЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов / (1 - ВременнаяТаблицаРасшифровкаПлатежа.СтавкаНДФЛ / 100) КАК ЧИСЛО(15, 2))) - ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов
	//|	КОНЕЦ КАК СуммаНДФЛВал,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДФЛ),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаНДФЛВал),
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛКОплате,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛНачислении,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияПФ,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПФВал),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПФ),
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ДоговорПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.КонтрагентПФ,
	//_Паганини ПФ
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ КАК СодержаниеПроводки,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Курс
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Курс
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КурсПоступления,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Кратность
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Кратность
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КратностьПоступления,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ КАК Проект
	//Lazare
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщиками
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ ,
	//Lazare
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Касса,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	//+++
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	//---
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияНДФЛ,
	//Паганини ПФ_
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсНачисленийСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НДФЛсВыплатСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛКОплате,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНалогаНДФЛНачислении,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФСотрудника,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетНачисленииПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СчетКОплатеПФОрганизации,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ДоговорПФ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.КонтрагентПФ,
	//_Паганини ПФ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Курс
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Курс
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ПриходнаяНакладная)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ПриходнаяНакладная).Кратность
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаРасшифровкаПлатежа.Документ) = ТИП(Документ.ДополнительныеРасходы)
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК Документ.ДополнительныеРасходы).Кратность
	|		ИНАЧЕ 0
	|	КОНЕЦ
	//,
	//|	ВЫБОР
	//|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	//|			ТОГДА 0
	//|		ИНАЧЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов / (1 - ВременнаяТаблицаРасшифровкаПлатежа.СтавкаНДФЛ / 100) КАК ЧИСЛО(15, 2))) - ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	//|			ТОГДА 0
	//|		ИНАЧЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета / (1 - ВременнаяТаблицаРасшифровкаПлатежа.СтавкаНДФЛ / 100) КАК ЧИСЛО(15, 2))) - ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета
	//|	КОНЕЦ
	|
	//Паганини#Удержания_
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	МАКСИМУМ(ВыплатаЗаработнойПлаты.НомерСтроки),
	|	НЕОПРЕДЕЛЕНО,
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Договор,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	
	//Малышев 2024-10-28 ONESOFT-3523 --) СуммаПлатежа
	//|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов = &ВалютаУчета и ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов<>ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента
	|				ТОГДА ПлатежнаяВедомостьСотрудники.СуммаРасчетов
	|			ИНАЧЕ //типовой
	|				ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) 
	|		КОНЕЦ
	|	КАК ЧИСЛО(15, 2))),
	//Малышев 2024-10-28 ONESOFT-3523 --) СуммаПлатежа

	
	//Малышев 2024-10-28 ONESOFT-3523 --) Сумма
	//|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов = &ВалютаУчета и ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов<>ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента
	|				ТОГДА ПлатежнаяВедомостьСотрудники.СуммаРасчетов
	|			ИНАЧЕ //типовой
	|				ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) 
	|		КОНЕЦ
	|	КАК ЧИСЛО(15, 2))),
	//Малышев 2024-10-28 ONESOFT-3523 --) Сумма


	//Малышев 2024-10-28 ONESOFT-3523 --) СуммаВал
	//|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаРасчетов),
	|	СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов = &ВалютаУчета и ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов<>ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента
	|				ТОГДА ПлатежнаяВедомостьСотрудники.СуммаРасчетов / (КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность)
	|			ИНАЧЕ //типовой
	|				ПлатежнаяВедомостьСотрудники.СуммаРасчетов 
	|		КОНЕЦ
	|	КАК ЧИСЛО(15, 2))),
	//Малышев 2024-10-28 ONESOFT-3523 --) СуммаВала


	//Малышев 2024-10-28 ONESOFT-3523 --) СуммаДляОстатка
	//|	-СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))),
	|	-СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов = &ВалютаУчета и ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов<>ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента
	|				ТОГДА ПлатежнаяВедомостьСотрудники.СуммаРасчетов
	|			ИНАЧЕ //типовой
	|				ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) 
	|		КОНЕЦ
	|	КАК ЧИСЛО(15, 2))),
	//Малышев 2024-10-28 ONESOFT-3523 --) СуммаДляОстатка


	//Малышев 2024-10-28 ONESOFT-3523 --) СуммаВалДляОстатка
    //|	-СУММА(ПлатежнаяВедомостьСотрудники.СуммаРасчетов),
	|	-СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов = &ВалютаУчета и ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов<>ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента
	|				ТОГДА ПлатежнаяВедомостьСотрудники.СуммаРасчетов / (КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность)
	|			ИНАЧЕ //типовой
	|				ПлатежнаяВедомостьСотрудники.СуммаРасчетов 
	|		КОНЕЦ
	|	КАК ЧИСЛО(15, 2))),
	//Малышев 2024-10-28 ONESOFT-3523 --) СуммаВалДляОстатка

	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ,
	|	0,
	|	0,
	//+++ Дмгг
	|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником
	//--- Дмгг
	|ИЗ
	|	Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходИзКассы.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|			ПО ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|		ПО ПлатежнаяВедомостьСотрудники.Ссылка = ВыплатаЗаработнойПлаты.Ведомость
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВыплатаЗаработнойПлаты.Ссылка = &Ссылка
	|	И ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Зарплата)
	|	И ВЫБОР
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов,
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Договор,
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Ведомость.Аванс
	|			ТОГДА &ВозникновениеАвансаПоставщику
	|		ИНАЧЕ &ПогашениеОбязательствПередПоставщиком
	|	КОНЕЦ
	//_Паганини#Удержания
	|ИНДЕКСИРОВАТЬ ПО
	//+++ Дмгг
	//|	Проект,
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ Проект
	|	КОНЕЦ,
	//Lazare
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов,
	|	СчетУчета,
	|	СчетУчетаРегл";
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПоставщиками.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПоставщиками";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщиками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиРегл(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПоставщиками()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ПогашениеАвансаПокупателя", НСтр("ka='მყიდველის ავანსის დაფარვა';ru='Погашение аванса покупателя';en='Repayment of the advance of the buyer'"));
	Запрос.УстановитьПараметр("ВозникновениеОбязательствПокупателя", НСтр("ka='მყიდველის ვალდებულებების წარმოშობა';ru='Возникновение обязательств покупателя';en='The emergence of the obligations of the buyer'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	//ПодольскийАИ #УчетПроектов 09.02.2021 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 09.02.2021 }
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Касса КАК Касса,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ КАК ТипРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Дата,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК Сумма,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВал,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК СуммаДляОстатка,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВалДляОстатка,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПокупателя
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПокупателем
	|	КОНЕЦ КАК СчетУчета,
	//+++
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПокупателяРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПокупателемРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья КАК Статья,
	//---
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов КАК Валюта,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ПогашениеАвансаПокупателя
	|		ИНАЧЕ &ВозникновениеОбязательствПокупателя
	|	КОНЕЦ КАК СодержаниеПроводки,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ КАК Проект
	//Lazare
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателями
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю)
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Проект
	|	КОНЕЦ ,
	//Lazare
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Касса,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПокупателя
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПокупателем
	|	КОНЕЦ,
	//+++
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПокупателяРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПокупателемРегл
	|	КОНЕЦ,
	//---
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ПогашениеАвансаПокупателя
	|		ИНАЧЕ &ВозникновениеОбязательствПокупателя
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	//+++ Дмгг
	//|	Проект,
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ Проект
	|	КОНЕЦ,
	//Lazare
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов,
	|	СчетУчета,
	|	СчетУчетаРегл";
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПокупателями.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПокупателями.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПокупателями.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПокупателями.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПокупателями.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов КАК ТипРасчетов
	//ПодольскийАИ #УчетПроектов 11.02.2021 {
	//Исправление ошибок. Было---
	////+++ Дмгг
	////|	ВременнаяТаблицаРасчетыСПокупателями.Проект КАК Проект
	////--- Дмгг
	////_Lazare
	//|   ВЫБОР
	//|		КОГДА ВременнаяТаблицаРасчетыСПокупателями.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ВременнаяТаблицаРасчетыСПокупателями.Проект
	//|	КОНЕЦ КАК Проект
	////Lazare
	//ПодольскийАИ #УчетПроектов 11.02.2021 }
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПокупателями";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПокупателями");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
		НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателямиРегл(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПокупателями()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ПогашениеОбязательствПередПерсоналом", НСтр("ka='პერსონალის წინაშე ვალდებულებების დაფარვა';ru='Погашение обязательств перед персоналом';en='Repayment of liabilities to employees'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
 	//Паганини#Удержания_
	Запрос.УстановитьПараметр("ВалютаУчета",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета"));
	Запрос.УстановитьПараметр("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении"));
	Запрос.УстановитьПараметр("ПогашениеОбязательствПередПоставщиком", НСтр("ka='მომწოდებლის წინაშე ვალდებულებების დაფარვა';ru='Погашение обязательств перед поставщиком';en='Repayment of liabilities to the supplier'"));
	//_Паганини#Удержания
	
	//ПодольскийАИ #УчетПроектов 09.02.2021 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 09.02.2021 }
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлатежнаяВедомость.Ссылка
	|ИЗ
	|	Документ.ПлатежнаяВедомость КАК ПлатежнаяВедомость
	|ГДЕ
	|	ПлатежнаяВедомость.Ссылка В
	|			(ВЫБРАТЬ
	|				ВыплатаЗаработнойПлаты.Ведомость
	|			ИЗ
	|				Документ.РасходИзКассы.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|			ГДЕ
	|				ВыплатаЗаработнойПлаты.Ссылка = &Ссылка
	|				И ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Зарплата))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.ПлатежнаяВедомость");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	МАКСИМУМ(ВыплатаЗаработнойПлаты.НомерСтроки) КАК НомерСтроки,
	|	&Организация КАК Организация,
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата КАК Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник КАК Сотрудник,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов КАК Валюта,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	
	//Малышев 2024-10-28 ONESOFT-3523 (-- Сумма
	//|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
    |	СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов = &ВалютаУчета и ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов<>ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента
	|				ТОГДА ПлатежнаяВедомостьСотрудники.СуммаРасчетов
	|			ИНАЧЕ //типовой
	|				ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) 
	|		КОНЕЦ
	|	КАК ЧИСЛО(15, 2))) как Сумма,
	//Малышев 2024-10-28 ONESOFT-3523 --) Сумма
	

	//Малышев 2024-10-28 ONESOFT-3523 (-- СуммаВал
	//|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаРасчетов) КАК СуммаВал,
	|	СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов = &ВалютаУчета и ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов<>ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента
	|				ТОГДА ПлатежнаяВедомостьСотрудники.СуммаРасчетов / (КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность)
	|			ИНАЧЕ //типовой
	|				ПлатежнаяВедомостьСотрудники.СуммаПлатежа 
	|		КОНЕЦ
	|	КАК ЧИСЛО(15, 2))) КАК СуммаВал,
	//Малышев 2024-10-28 ONESOFT-3523 --) СуммаВал

	
	//Малышев 2024-10-28 ONESOFT-3523 (-- СуммаДляОстатка
	//|	-СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаДляОстатка,
	|	-СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов = &ВалютаУчета и ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов<>ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента
	|				ТОГДА ПлатежнаяВедомостьСотрудники.СуммаРасчетов
	|			ИНАЧЕ //типовой
	|				ПлатежнаяВедомостьСотрудники.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) 
	|		КОНЕЦ
	|	КАК ЧИСЛО(15, 2))) как СуммаДляОстатка,
	//Малышев 2024-10-28 ONESOFT-3523 --) СуммаДляОстатка
	
	//Малышев 2024-10-28 ONESOFT-3523 (-- СуммаВалДляОстатка
	//|	-СУММА(ПлатежнаяВедомостьСотрудники.СуммаРасчетов) КАК СуммаВалДляОстатка,
	|	-СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов = &ВалютаУчета и ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов<>ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента
	|				ТОГДА ПлатежнаяВедомостьСотрудники.СуммаРасчетов / (КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность)
	|			ИНАЧЕ //типовой
	|				ПлатежнаяВедомостьСотрудники.СуммаПлатежа 
	|		КОНЕЦ
	|	КАК ЧИСЛО(15, 2))) КАК СуммаВалДляОстатка,
	//Малышев 2024-10-28 ONESOFT-3523 --) СуммаВалДляОстатка


	|	ПлатежнаяВедомостьСотрудники.Сотрудник.СчетРасчетовСПерсоналом КАК СчетУчета,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник.СчетРасчетовСПерсоналомРегл КАК СчетУчетаРегл,
	//Паганини#Удержания_
	//|	&ПогашениеОбязательствПередПерсоналом КАК СодержаниеПроводки,
	|	ВЫБОР КОГДА ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента) ТОГДА &ПогашениеОбязательствПередПоставщиком ИНАЧЕ &ПогашениеОбязательствПередПерсоналом КОНЕЦ КАК СодержаниеПроводки,
	//_Паганини#Удержания
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса.СчетУчета КАК КассаСчетУчета,
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса.СчетУчетаРегл КАК КассаСчетУчетаРегл,
	//Паганини ПФ_
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ,
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаПФПлатежа) КАК СуммаПФВал,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПФПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаПФ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФСотрудника,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФОрганизации,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.НДФЛПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаНДФЛ,
	//_Паганини ПФ
	//Паганини#Удержания_
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации КАК ВедомостьВидОперации,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент КАК Контрагент,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Договор КАК Договор,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	//_Паганини#Удержания
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья КАК Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса КАК Касса,
	|	Сумма(ПлатежнаяВедомостьСотрудники.СуммаЛгот) КАК СуммаЛгот,
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником КАК Проект
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	|	КОНЕЦ КАК Проект
	//Lazare
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПерсоналом
	|ИЗ
	|	Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходИзКассы.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|			ПО ВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|		ПО ПлатежнаяВедомостьСотрудники.Ссылка = ВыплатаЗаработнойПлаты.Ведомость
	//ПодольскийАИ #УчетПроектов 12.02.2021 {
	|			И ВЫБОР 
	|				КОГДА &УчетПоПроектам 
	|					ТОГДА ПлатежнаяВедомостьСотрудники.Проект = ВыплатаЗаработнойПлаты.Проект
	|							ИЛИ (ПлатежнаяВедомостьСотрудники.Проект = ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником
	|									И ВыплатаЗаработнойПлаты.Проект = Значение(Справочник.Проекты.ПустаяСсылка))
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	//ПодольскийАИ #УчетПроектов 12.02.2021 }
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВыплатаЗаработнойПлаты.Ссылка = &Ссылка
	|	И ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Зарплата)
	//|	И ВыплатаЗаработнойПлаты.Ведомость.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента) //+++ Дмгг
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником,
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА ВыплатаЗаработнойПлаты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВыплатаЗаработнойПлаты.Проект
	|	КОНЕЦ,
	//Lazare
	|	ВыплатаЗаработнойПлаты.Ссылка.Дата,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.СтруктурнаяЕдиница,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаРасчетов,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ПериодРегистрации,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник.СчетРасчетовСПерсоналом,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник.СчетРасчетовСПерсоналомРегл,
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса,
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса.СчетУчета,
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса.СчетУчетаРегл,
	//Паганини ПФ_
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ,
	//_Паганини ПФ
	//Паганини#Удержания_
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Договор,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщикомРегл,
	|	ВЫБОР КОГДА ВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента) ТОГДА &ПогашениеОбязательствПередПоставщиком ИНАЧЕ &ПогашениеОбязательствПередПерсоналом КОНЕЦ,
	//_Паганини#Удержания
	|	ВыплатаЗаработнойПлаты.Ссылка.Статья,
	|	ВыплатаЗаработнойПлаты.Ссылка.Касса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	1,
	|	&Организация,
	|	ТаблицаДокумента.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.Подотчетник,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.ПериодРегистрации,
	|	СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	-СУММА(ТаблицаДокумента.Сумма),
	|	-СУММА(ТаблицаДокумента.СуммаВал),
	|	ТаблицаДокумента.ПодотчетникСчетРасчетовСПерсоналом,
	|	ТаблицаДокумента.ПодотчетникСчетРасчетовСПерсоналомРегл,
	|	&ПогашениеОбязательствПередПерсоналом,
	|	ТаблицаДокумента.КассаСчетУчета,
	|	ТаблицаДокумента.КассаСчетУчетаРегл,
	//Паганини ПФ_
	|	ТаблицаДокумента.ВидУдержанияНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияПФ,
	|	СУММА(ТаблицаДокумента.СуммаПФ) КАК СуммаПФ,
	|	СУММА(ТаблицаДокумента.СуммаПФВал) КАК СуммаПФВал,
	|	ТаблицаДокумента.СчетНачисленииПФСотрудника,
	|	ТаблицаДокумента.СчетКОплатеПФСотрудника,
	|	ТаблицаДокумента.СчетНачисленииПФОрганизации,
	|	ТаблицаДокумента.СчетКОплатеПФОрганизации,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Контрагент,
	|	СУММА(ТаблицаДокумента.СуммаНДФЛ),
	//_Паганини ПФ
	//Паганини#Удержания_
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	//_Паганини#Удержания
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Касса,
	|   СУММА(ТаблицаДокумента.СуммаЛьгот),
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ 
	//Lazare
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику)
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ Проект
	|	КОНЕЦ, 
	//Lazare
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.Подотчетник,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.ПериодРегистрации,
	|	ТаблицаДокумента.ПодотчетникСчетРасчетовСПерсоналом,
	|	ТаблицаДокумента.КассаСчетУчета,
	|	ТаблицаДокумента.ПодотчетникСчетРасчетовСПерсоналомРегл,
	|	ТаблицаДокумента.КассаСчетУчетаРегл,
	//Паганини ПФ_
	|	ТаблицаДокумента.ВидУдержанияНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияПФ,
	|	ТаблицаДокумента.СчетНачисленииПФСотрудника,
	|	ТаблицаДокумента.СчетКОплатеПФСотрудника,
	|	ТаблицаДокумента.СчетНачисленииПФОрганизации,
	|	ТаблицаДокумента.СчетКОплатеПФОрганизации,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Контрагент,
	//_Паганини ПФ
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Касса
	|
	|ИНДЕКСИРОВАТЬ ПО
	//+++ Дмгг
	//ПодольскийАИ ИсправлениеОшибки. Убрал комментарий
	|	Проект,
	//--- Дмгг
	//_Lazare
	//|   ВЫБОР
	//|		КОГДА Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ Проект
	//|	КОНЕЦ, 
	//Lazare
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	Сотрудник,
	|	Валюта,
	|	ПериодРегистрации,
	|	СчетУчета,
	|	СчетУчетаРегл";
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПерсоналом.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПерсоналом.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВременнаяТаблицаРасчетыСПерсоналом.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблицаРасчетыСПерсоналом.Валюта КАК Валюта,
	|	ВременнаяТаблицаРасчетыСПерсоналом.ПериодРегистрации КАК ПериодРегистрации,
	//+++ Дмгг
	//|	ВременнаяТаблицаРасчетыСПерсоналом.Проект КАК Проект
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА ВременнаяТаблицаРасчетыСПерсоналом.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ВременнаяТаблицаРасчетыСПерсоналом.Проект
	|	КОНЕЦ  КАК Проект
	//Lazare
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПерсоналом КАК ВременнаяТаблицаРасчетыСПерсоналом";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПерсоналом");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПерсоналом(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПерсоналомРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПерсоналом", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПерсоналом()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	МассивСчетовФинРезРасходы = РегламентированныйУчетСервер.ПолучитьСчетаФинРезРасход();
	СтруктураСчетовКурсРазниц = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(СтруктураДополнительныеСвойства.ДляПроведения.Организация, СтруктураДополнительныеСвойства.ДляПроведения.Дата);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОтражениеРасходов", НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("СчетаФинРезРасходы", МассивСчетовФинРезРасходы);
	Запрос.УстановитьПараметр("ИспользованиеТолькоРеглПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность);
		
	Иначе
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);

	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	2 КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.КорреспонденцияТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ТОГДА ТаблицаДокумента.Подразделение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.КорреспонденцияТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.КорреспонденцияТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ТОГДА ТаблицаДокумента.НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	//ПодольскийАИ #УчетПроектов 10.02.2021 {
	|	ВЫБОР
	|		КОГДА ФункциональнаяОпцияУчетПоПроектам.Значение И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.НаРасходы)
	|			ТОГДА ТаблицаДокумента.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ КАК Проект,
	//ПодольскийАИ #УчетПроектов 10.02.2021 }
	|	ТаблицаДокумента.Корреспонденция КАК СчетУчета,
	|	ТаблицаДокумента.КорреспонденцияРегл КАК СчетУчетаРегл,
	|	ШапкаДокумента.АналитикаДоходовИРасходов КАК Аналитика,
	|	&ОтражениеРасходов КАК СодержаниеПроводки,
	|	0 КАК СуммаДоходов,
	|	ТаблицаДокумента.Сумма КАК СуммаРасходов,
	|	ТаблицаДокумента.Сумма КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ШапкаДокумента
	|		ПО (ИСТИНА),
	//ПодольскийАИ #УчетПроектов 10.02.2021 {
	|	Константа.ФункциональнаяОпцияУчетПоПроектам КАК ФункциональнаяОпцияУчетПоПроектам
	//ПодольскийАИ #УчетПроектов 10.02.2021 }
	|ГДЕ
	//+++ Дмгг
	|	(ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|				ИЛИ ТаблицаДокумента.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|		ИНАЧЕ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|				ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|	КОНЕЦ)		
	//--- Дмгг
	|	И (ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Прочее)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.НаРасходы)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.КорреспонденцияРегл В (&СчетаФинРезРасходы))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	//ПодольскийАИ #УчетПроектов 10.02.2021 {
	|	Значение(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.02.2021 }
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ

	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницДенежныеСредства КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	//ПодольскийАИ #УчетПроектов 10.02.2021 {
	|	Значение(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.02.2021 }
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ

	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	//ПодольскийАИ #УчетПроектов 10.02.2021 {
	|	Значение(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.02.2021 }
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ

	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	//ПодольскийАИ #УчетПроектов 10.02.2021 {
	|	Значение(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.02.2021 }
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ

	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	//ПодольскийАИ #УчетПроектов 10.02.2021 {
	|	Значение(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.02.2021 }
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ

	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПерсоналом КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	//ПодольскийАИ #УчетПроектов 10.02.2021 {
	|	Значение(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.02.2021 }
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ

	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницДенежныеСредстваВКассахККМ КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	//ПодольскийАИ #УчетПроектов 10.02.2021 {
	|	Значение(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.02.2021 }
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ

	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	9,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	//ПодольскийАИ #УчетПроектов 10.02.2021 {
	|	Значение(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.02.2021 }
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ

	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницПрочиеРасчеты КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", Новый ТаблицаЗначений);
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	//
	//Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	//Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	//Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	//Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	//Запрос.УстановитьПараметр("Содержание", НСтр("ka='ფულადი სახსრების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание денежных средств на произвольный счет';en='Debiting an arbitrary score'"));
	//Запрос.УстановитьПараметр("СодержаниеВыдачаЗаймаСотруднику", НСтр("ka='თანამშრომლისთვის სესხის გაცემა';ru='Выдача займа сотруднику';en='Issuance of the loan officer'"));
	//Запрос.УстановитьПараметр("СодержаниеПеремещениеВКассуККМ", НСтр("ka='ფულის გადაადგილება სსა-ის სალაროში';ru='Перемещение денежных средств в кассу ККМ';en='Moving money to the cashier cash register'"));
	//Запрос.УстановитьПараметр("ОплатаНалога", НСтр("ka='გადასახადის გადახდა';ru='Оплата налога';en='Payment of tax'"));
	////Паганини
	////Добавлена таблица 18;
	//Запрос.УстановитьПараметр("НДФЛ", НСтр("ka='საშემოსავლო';ru='НДФЛ';en='НДФЛ'"));
	//Запрос.УстановитьПараметр("КурсоваяРазницаНДФЛ", НСтр("ka='Курсовая разница НДФЛ';ru='Курсовая разница НДФЛ';en='The exchange rate difference of personal income tax'"));
	////_Паганини
	//
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	1 КАК Порядок,
	//|	1 КАК НомерСтроки,
	//|	ТаблицаДокумента.Дата КАК Период,
	//|	&Организация КАК Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	//|	ТаблицаДокумента.Корреспонденция КАК СчетДт,
	//|	ТаблицаДокумента.КассаСчетУчета КАК СчетКт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Корреспонденция.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК ВалютаДт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК ВалютаКт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Корреспонденция.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК СуммаВалДт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК СуммаВалКт,
	//|	ТаблицаДокумента.Сумма КАК Сумма,
	//|	ВЫРАЗИТЬ(&Содержание КАК СТРОКА(100)) КАК Содержание
	//|ИЗ
	//|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	//|ГДЕ
	//|	(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Прочее)
	//|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.НаРасходы)
	//|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк))
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	2,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	&Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.КассаККМСчетУчета,
	//|	ТаблицаДокумента.КассаСчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.КассаККМСчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.КассаСчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.КассаККМСчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.КассаСчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ВЫРАЗИТЬ(&СодержаниеПеремещениеВКассуККМ КАК СТРОКА(100))
	//|ИЗ
	//|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	//|ГДЕ
	//|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	3,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	&Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.ВидНалогаСчетУчета,
	//|	ТаблицаДокумента.КассаСчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ВидНалога.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ВидНалога.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ВЫРАЗИТЬ(&ОплатаНалога КАК СТРОКА(100))
	//|ИЗ
	//|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	//|ГДЕ
	//|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Налоги)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	4,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.Касса.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПодотчетниками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	5,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	6,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.Касса.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	7,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	8,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.Касса.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	9,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	10,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницДенежныеСредства КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	11,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницДенежныеСредстваВКассахККМ КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	12,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.КассаСчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.КассаСчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.КассаСчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПерсоналом КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	13,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПерсоналом КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	14,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.Касса.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	15,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	16,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницПрочиеРасчеты КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	17,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.Касса.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаПрочиеРасчеты КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	18,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ,
	//|	ТаблицаДокумента.ТипНДФЛ.СчетОплатыНДФЛ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетОплатыНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаНДФЛВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетОплатыНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаНДФЛВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.СуммаНДФЛ,
	//|	&НДФЛ
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
	//|ГДЕ
	//|	НЕ ТаблицаДокумента.ТипНДФЛ = ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	19,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ > 0
	//|			ТОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ < 0
	//|			ТОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ > 0
	//|				И ВЫРАЗИТЬ(ТаблицаДокумента.ТипНДФЛ КАК Справочник.ТипыНДФЛ).СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ > 0
	//|				И ВЫРАЗИТЬ(ТаблицаДокумента.ТипНДФЛ КАК Справочник.ТипыНДФЛ).СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА (ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2))) > 0
	//|			ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2))
	//|		ИНАЧЕ -(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2)))
	//|	КОНЕЦ,
	//|	&КурсоваяРазницаНДФЛ
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	//|				&МоментВремени,
	//|				Валюта В
	//|					(ВЫБРАТЬ
	//|						КонстантаВалютаУчета.Значение
	//|					ИЗ
	//|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсВалютыУчета
	//|		ПО (ИСТИНА)
	//|ГДЕ
	//|	ТаблицаДокумента.ТипНДФЛ <> ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|	И (ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2))) <> 0
	//|	И ТаблицаДокумента.КурсПоступления <> 0
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Порядок,
	//|	НомерСтроки";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаУправленческий()

Процедура СформироватьТаблицаУправленческий_РС(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)//Паганини

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", Новый ТаблицаЗначений);
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	//
	//Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	//Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	//Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	//Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	//Запрос.УстановитьПараметр("Содержание", НСтр("ka='ფულადი სახსრების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание денежных средств на произвольный счет';en='Debiting an arbitrary score'"));
	//Запрос.УстановитьПараметр("СодержаниеВыдачаЗаймаСотруднику", НСтр("ka='თანამშრომლისთვის სესხის გაცემა';ru='Выдача займа сотруднику';en='Issuance of the loan officer'"));
	//Запрос.УстановитьПараметр("СодержаниеПеремещениеВКассуККМ", НСтр("ka='ფულის გადაადგილება სსა-ის სალაროში';ru='Перемещение денежных средств в кассу ККМ';en='Moving money to the cashier cash register'"));
	//Запрос.УстановитьПараметр("ОплатаНалога", НСтр("ka='გადასახადის გადახდა';ru='Оплата налога';en='Payment of tax'"));
	////Паганини
	////Добавлена таблица 18;
	//Запрос.УстановитьПараметр("НДФЛ", НСтр("ka='საშემოსავლო';ru='НДФЛ';en='НДФЛ'"));
	//Запрос.УстановитьПараметр("КурсоваяРазницаНДФЛ", НСтр("ka='Курсовая разница НДФЛ';ru='Курсовая разница НДФЛ';en='The exchange rate difference of personal income tax'"));
	////_Паганини
	//Запрос.УстановитьПараметр("СодержаниеПроводкиПоЗарплате",НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога';en='tax accrual'"));
	//
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	1 КАК Порядок,
	//|	1 КАК НомерСтроки,
	//|	ТаблицаДокумента.Дата КАК Период,
	//|	&Организация КАК Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	//|	ТаблицаДокумента.Корреспонденция КАК СчетДт,
	//|	ТаблицаДокумента.КассаСчетУчета КАК СчетКт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Корреспонденция.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК ВалютаДт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК ВалютаКт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Корреспонденция.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК СуммаВалДт,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК СуммаВалКт,
	//|	ТаблицаДокумента.Сумма КАК Сумма,
	//|	ВЫРАЗИТЬ(&Содержание КАК СТРОКА(100)) КАК Содержание
	//|ИЗ
	//|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	//|ГДЕ
	//|	(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Прочее)
	//|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.НаРасходы)
	//|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк))
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	2,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	&Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.КассаККМСчетУчета,
	//|	ТаблицаДокумента.КассаСчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.КассаККМСчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.КассаСчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.КассаККМСчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.КассаСчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ВЫРАЗИТЬ(&СодержаниеПеремещениеВКассуККМ КАК СТРОКА(100))
	//|ИЗ
	//|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	//|ГДЕ
	//|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	3,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	&Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.ВидНалогаСчетУчета,
	//|	ТаблицаДокумента.КассаСчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ВидНалога.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ВидНалога.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ВЫРАЗИТЬ(&ОплатаНалога КАК СТРОКА(100))
	//|ИЗ
	//|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	//|ГДЕ
	//|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Налоги)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	4,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.Касса.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПодотчетниками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	5,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	6,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.Касса.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	7,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	8,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.Касса.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	9,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	10,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницДенежныеСредства КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	11,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницДенежныеСредстваВКассахККМ КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	12,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.КассаСчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.КассаСчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.КассаСчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПерсоналом КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	13,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПерсоналом КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	14,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.Касса.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	15,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыПоКредитамИЗаймам КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	16,
	//|	1,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СчетУчета
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	//|				И ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	&КурсоваяРазница
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницПрочиеРасчеты КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	17,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.Касса.СчетУчета,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.ВалютаДенежныхСредств
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.Касса.СчетУчета.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаПлатежа
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.Сумма,
	//|	ТаблицаДокумента.СодержаниеПроводки
	//|ИЗ
	//|	ВременнаяТаблицаПрочиеРасчеты КАК ТаблицаДокумента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	18,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ,
	//|	ТаблицаДокумента.ТипНДФЛ.СчетОплатыНДФЛ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетОплатыНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаНДФЛВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.ТипНДФЛ.СчетОплатыНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.СуммаНДФЛВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.СуммаНДФЛ,
	//|	&НДФЛ
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
	//|ГДЕ
	//|	НЕ ТаблицаДокумента.ТипНДФЛ = ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	19,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ > 0
	//|			ТОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ < 0
	//|			ТОГДА ТаблицаДокумента.ТипНДФЛ.СчетНачисленияНДФЛ
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ > 0
	//|				И ВЫРАЗИТЬ(ТаблицаДокумента.ТипНДФЛ КАК Справочник.ТипыНДФЛ).СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ > 0
	//|				И ВЫРАЗИТЬ(ТаблицаДокумента.ТипНДФЛ КАК Справочник.ТипыНДФЛ).СчетНачисленияНДФЛ.Валютный
	//|			ТОГДА ТаблицаДокумента.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА (ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2))) > 0
	//|			ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2))
	//|		ИНАЧЕ -(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2)))
	//|	КОНЕЦ,
	//|	&КурсоваяРазницаНДФЛ
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	//|				&МоментВремени,
	//|				Валюта В
	//|					(ВЫБРАТЬ
	//|						КонстантаВалютаУчета.Значение
	//|					ИЗ
	//|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсВалютыУчета
	//|		ПО (ИСТИНА)
	//|ГДЕ
	//|	ТаблицаДокумента.ТипНДФЛ <> ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
	//|	И (ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛВал * ТаблицаДокумента.КурсПоступления * КурсВалютыУчета.Кратность / КурсВалютыУчета.Курс * ТаблицаДокумента.КратностьПоступления - ТаблицаДокумента.СуммаНДФЛ КАК ЧИСЛО(15, 2))) <> 0
	//|	И ТаблицаДокумента.КурсПоступления <> 0
	//|
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	20,
	//|	1,
	//|	ВТ_НДФЛ.Период,
	//|	ВТ_НДФЛ.Организация,
	//|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета,
	//|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
	//|	ВЫБОР
	//|		КОГДА ВТ_НДФЛ.НДФЛсВыплатСчетУчета.Валютный
	//|			ТОГДА ВТ_НДФЛ.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ВТ_НДФЛ.НДФЛсНачисленийСчетУчета.Валютный
	//|			ТОГДА ВТ_НДФЛ.Валюта
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ВТ_НДФЛ.НДФЛсВыплатСчетУчета.Валютный
	//|			ТОГДА ВТ_НДФЛ.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ВТ_НДФЛ.НДФЛсНачисленийСчетУчета.Валютный
	//|			ТОГДА ВТ_НДФЛ.СуммаВал
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВТ_НДФЛ.Сумма,
	//|	&СодержаниеПроводкиПоЗарплате
	//|ИЗ
	//|	ВТ_ДанныеНДФЛ КАК ВТ_НДФЛ
	//|ГДЕ
	//|	ВТ_НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|УПОРЯДОЧИТЬ ПО
	//|	Порядок,
	//|	НомерСтроки";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаДС", ДокументСсылкаРасходИзКассы.ВалютаДенежныхСредств);
	
	Если ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь") Тогда
		Итог = ДокументСсылкаРасходИзКассы.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	Иначе
		Итог = 0;
	КонецЕсли;
	ОстатокСуммы = ДокументСсылкаРасходИзКассы.СуммаДокумента - Итог;
	Запрос.УстановитьПараметр("ПлатежныйКалендарь", ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"));
	Запрос.УстановитьПараметр("ОстатокСуммы", ОстатокСуммы);
	Запрос.УстановитьПараметр("УчетВалютныхОпераций", ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ТаблицаДокумента.ДоговорОбслуживанияНаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	0 КАК СуммаДоходов,
	|	ТаблицаДокумента.СуммаУчета КАК СуммаРасходов
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|	И (ТаблицаДокумента.ПризнакАванса
	|			ИЛИ ТаблицаДокумента.ВестиУчетРасходовПоДоговорамОбслуживания)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.Период,
	|	Таблица.Организация,
	|	Таблица.НаправлениеДеятельности,
	|	Таблица.Статья,
	|	0,
	|	Таблица.СуммаРасходов
	|ИЗ
	|	ВременнаяТаблицаТаблицаДоходыИРасходыОтложенные КАК Таблица
	|ГДЕ
	|	Таблица.СуммаРасходов > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья,
	|	0,
	|	ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютРасчетов.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И (ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Прочее)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.НаРасходы)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаЗаймаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаКредитаКонтрагенту)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Зарплата)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Налоги))
	|	И &ОстатокСуммы > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья,
	|	0,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И (ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Прочее)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.НаРасходы)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаЗаймаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаКредитаКонтрагенту)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Зарплата)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Налоги))
	|	И ТаблицаДокумента.СуммаПлатежа > 0
	|	И &ПлатежныйКалендарь
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ТаблицаДокумента.ДоговорОбслуживанияНаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья,
	|	-ТаблицаДокумента.СуммаУчета,
	|	0
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю)
	|	И (ТаблицаДокумента.ПризнакАванса
	|			ИЛИ ТаблицаДокумента.ВестиУчетРасходовПоДоговорамОбслуживания)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.Период,
	|	Таблица.Организация,
	|	Таблица.НаправлениеДеятельности,
	|	Таблица.Статья,
	|	-Таблица.СуммаДоходов,
	|	0
	|ИЗ
	|	ВременнаяТаблицаТаблицаДоходыИРасходыОтложенные КАК Таблица
	|ГДЕ
	|	Таблица.СуммаДоходов > 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыКассовыйМетод", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыКассовыйМетод()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА &Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	0 КАК СуммаДоходов,
	|	ТаблицаДокумента.СуммаУчета КАК СуммаРасходов
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|	И НЕ ТаблицаДокумента.ВестиУчетРасходовПоДоговорамОбслуживания
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА &Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья,
	|	-ТаблицаДокумента.СуммаУчета,
	|	0
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю)
	|	И НЕ ТаблицаДокумента.ВестиУчетРасходовПоДоговорамОбслуживания
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыНераспределенные", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыНераспределенные()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	Запрос.УстановитьПараметр("Период", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	
	// Формирование таблицы с суммами к списанию.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	СУММА(ТаблицаДокумента.СуммаУчета) КАК СуммаКСписанию
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|	И НЕ ТаблицаДокумента.ВестиУчетРасходовПоДоговорамОбслуживания
	|	И НЕ ТаблицаДокумента.ПризнакАванса
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков денежных средств.
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДоходыИРасходыОтложенные");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Организация");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Документ", "Документ");
	Блокировка.Заблокировать();
	
	ТаблицаСуммыКСписанию = РезультатЗапроса.Выгрузить();
	
	// Формирование таблицы с остатками.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ДоходыИРасходыОтложенныеОстатки.Организация КАК Организация,
	|	ДоходыИРасходыОтложенныеОстатки.Документ КАК Документ,
	|	ДоходыИРасходыОтложенныеОстатки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) КАК Статья,
	|	0 КАК СуммаДоходов,
	|	0 КАК СуммаРасходов,
	|	-СУММА(ДоходыИРасходыОтложенныеОстатки.СуммаДоходовОстаток) КАК СуммаДоходовОстаток,
	|	СУММА(ДоходыИРасходыОтложенныеОстатки.СуммаРасходовОстаток) КАК СуммаРасходовОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДоходыИРасходыОтложенныеОстатки.Организация КАК Организация,
	|		ДоходыИРасходыОтложенныеОстатки.Документ КАК Документ,
	|		ДоходыИРасходыОтложенныеОстатки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ДоходыИРасходыОтложенныеОстатки.СуммаДоходовОстаток КАК СуммаДоходовОстаток,
	|		ДоходыИРасходыОтложенныеОстатки.СуммаРасходовОстаток КАК СуммаРасходовОстаток
	|	ИЗ
	|		РегистрНакопления.ДоходыИРасходыОтложенные.Остатки(
	|				,
	|				Организация = &Организация
	|					И Документ В
	|						(ВЫБРАТЬ
	|							ТаблицаДокумента.Документ
	|						ИЗ
	|							ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|						ГДЕ
	|							(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|								ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю)))) КАК ДоходыИРасходыОтложенныеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаДоходыИРасходыОтложенные.Организация,
	|		ДвиженияДокументаДоходыИРасходыОтложенные.Документ,
	|		ДвиженияДокументаДоходыИРасходыОтложенные.НаправлениеДеятельности,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаДоходыИРасходыОтложенные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаДоходыИРасходыОтложенные.СуммаДоходов, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаДоходыИРасходыОтложенные.СуммаДоходов, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаДоходыИРасходыОтложенные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаДоходыИРасходыОтложенные.СуммаРасходов, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаДоходыИРасходыОтложенные.СуммаРасходов, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ДоходыИРасходыОтложенные КАК ДвиженияДокументаДоходыИРасходыОтложенные
	|	ГДЕ
	|		ДвиженияДокументаДоходыИРасходыОтложенные.Регистратор = &Ссылка) КАК ДоходыИРасходыОтложенныеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыИРасходыОтложенныеОстатки.Организация,
	|	ДоходыИРасходыОтложенныеОстатки.Документ,
	|	ДоходыИРасходыОтложенныеОстатки.НаправлениеДеятельности
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ";
	
	ТаблицаСуммыОстатки = Запрос.Выполнить().Выгрузить();

	ТаблицаСуммыОстатки.Индексы.Добавить("Документ");
	
	// Расчет сумм списания.
	Для каждого СтрокаСуммыКСписанию Из ТаблицаСуммыКСписанию Цикл
		СуммаКСписанию = СтрокаСуммыКСписанию.СуммаКСписанию;
		Отбор = Новый Структура("Документ", СтрокаСуммыКСписанию.Документ);
		МассивСтрокСуммыОстатки = ТаблицаСуммыОстатки.НайтиСтроки(Отбор);
		Для каждого СтрокаСуммыОстатки Из МассивСтрокСуммыОстатки Цикл
			Если СуммаКСписанию = 0 Тогда
				Продолжить
			ИначеЕсли СтрокаСуммыОстатки.СуммаРасходовОстаток < СуммаКСписанию Тогда
				СтрокаСуммыОстатки.СуммаРасходов = СтрокаСуммыОстатки.СуммаРасходовОстаток;
				СтрокаСуммыОстатки.Статья = СтрокаСуммыКСписанию.Статья;
				СуммаКСписанию = СуммаКСписанию - СтрокаСуммыОстатки.СуммаРасходовОстаток;
			ИначеЕсли СтрокаСуммыОстатки.СуммаРасходовОстаток >= СуммаКСписанию Тогда
				СтрокаСуммыОстатки.СуммаРасходов = СуммаКСписанию;
				СтрокаСуммыОстатки.Статья = СтрокаСуммыКСписанию.Статья;
				СуммаКСписанию = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Формирование таблицы с суммами к списанию.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	СУММА(ТаблицаДокумента.СуммаУчета) КАК СуммаКСписанию
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю)
	|	И НЕ ТаблицаДокумента.ПризнакАванса
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья"; 
	
	ТаблицаСуммыКСписанию = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаСуммыКСписанию Из ТаблицаСуммыКСписанию Цикл
		СуммаКСписанию = СтрокаСуммыКСписанию.СуммаКСписанию;
		Отбор = Новый Структура("Документ", СтрокаСуммыКСписанию.Документ);
		МассивСтрокСуммыОстатки = ТаблицаСуммыОстатки.НайтиСтроки(Отбор);
		Для каждого СтрокаСуммыОстатки Из МассивСтрокСуммыОстатки Цикл
			Если СуммаКСписанию = 0 Тогда
				Продолжить
			ИначеЕсли СтрокаСуммыОстатки.СуммаДоходовОстаток < СуммаКСписанию Тогда
				СтрокаСуммыОстатки.СуммаДоходов = СтрокаСуммыОстатки.СуммаДоходовОстаток;
				СтрокаСуммыОстатки.Статья = СтрокаСуммыКСписанию.Статья;
				СуммаКСписанию = СуммаКСписанию - СтрокаСуммыОстатки.СуммаДоходовОстаток;
			ИначеЕсли СтрокаСуммыОстатки.СуммаДоходовОстаток >= СуммаКСписанию Тогда
				СтрокаСуммыОстатки.СуммаДоходов = СуммаКСписанию;
				СтрокаСуммыОстатки.Статья = СтрокаСуммыКСписанию.Статья;
				СуммаКСписанию = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Формирование временной таблицы с суммами, статьями и направлениями
	// деятельности. Понадобится для формирования движений по доходам и расходам
	// кассовым методом.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Период КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Документ КАК Документ,
	|	Таблица.Статья КАК Статья,
	|	Таблица.СуммаДоходов КАК СуммаДоходов,
	|	Таблица.СуммаРасходов КАК СуммаРасходов,
	|	Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВременнаяТаблицаТаблицаДоходыИРасходыОтложенные
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	(Таблица.СуммаДоходов > 0
	|			ИЛИ Таблица.СуммаРасходов > 0)";
	
	Запрос.УстановитьПараметр("Таблица", ТаблицаСуммыОстатки);
	
	Запрос.Выполнить();
	
	// Формирование таблицы для записи в регистр.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Таблица.Период КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Документ КАК Документ,
	|	Таблица.Статья КАК Статья,
	|	-Таблица.СуммаДоходов КАК СуммаДоходов,
	|	Таблица.СуммаРасходов КАК СуммаРасходов,
	|	Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	ВременнаяТаблицаТаблицаДоходыИРасходыОтложенные КАК Таблица";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыОтложенные", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыНераспределенные()  

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОплатаНалога", НСтр("ka='გადასახადის გადახდა';ru='Оплата налога';en='Payment of tax'"));
	
	//ПодольскийАИ #УчетПроектов 12.02.2021 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 12.02.2021 }
	
	//Паганини_
	Если ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Зарплата ИЛИ ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.РасчетыПоКредитам Тогда
		Запрос.УстановитьПараметр("НачислениеНалога",	НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога';en='tax accrual'"));
		Запрос.УстановитьПараметр("ПогашениеНалога",	НСтр("ka='გადასახადის დაფარვა';ru='Погашение налога';en='repayment of the tax'"));
		Если ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.РасчетыПоКредитам И ЗначениеЗаполнено(ДокументСсылкаРасходИзКассы.ДоговорКредитаЗайма) Тогда 
			Запрос.УстановитьПараметр("ВалютаДокумента",	ДокументСсылкаРасходИзКассы.ДоговорКредитаЗайма.ВалютаРасчетов);
		Иначе 
			Запрос.УстановитьПараметр("ВалютаДокумента",	ДокументСсылкаРасходИзКассы.ВалютаДенежныхСредств);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВалютаУчета",		Константы.ВалютаУчета.Получить());
		Запрос.УстановитьПараметр("ПустаяДата", 		Дата('00010101'));
	 	//Паганини#Удержания_
		Запрос.УстановитьПараметр("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении"));
	 	//_Паганини#Удержания
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Организация КАК Организация,
		|	ТаблицаДокумента.ВидНалога КАК ВидНалога,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.ВидНалогаСчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.ВидНалогаСчетУчетаРегл КАК СчетУчетаРегл,
		|	ТаблицаДокумента.СрокУплаты КАК СрокУплаты
		|ПОМЕСТИТЬ ВТ_Шапка
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ПОМЕСТИТЬ КурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаДокумента)) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалога КАК НДФЛсНачислений,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалогаВыплат КАК НДФЛсВыплат,
		|	ПлатежнаяВедомостьСотрудники.Ссылка.ВалютаДокумента,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета КАК НДФЛсВыплатСчетУчета,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалога.СчетУчета КАК НДФЛсНачисленийСчетУчета,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаРегл КАК НДФЛсВыплатСчетУчетаРегл,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК НДФЛсНачисленийСчетУчетаРегл,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРегл,
		|	ПлатежнаяВедомостьСотрудники.НДФЛПлатежа,
		|	ПлатежнаяВедомостьСотрудники.Сотрудник,
		|	ПлатежнаяВедомостьСотрудники.Ссылка.ПериодРегистрации,
		//ПодольскийАИ #УчетПроектов 12.02.2021 {
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА РасходИзКассыВыплатаЗаработнойПлаты.Проект
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ КАК Проект,
		//ПодольскийАИ #УчетПроектов 12.02.2021 }
		|	0 КАК СуммаРасчетов
		|,	0 КАК СуммаПлатежа //+++ Дмгг
		|ПОМЕСТИТЬ ВТ_НДФЛ
		|ИЗ
		|	Документ.РасходИзКассы.ВыплатаЗаработнойПлаты КАК РасходИзКассыВыплатаЗаработнойПлаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
		|		ПО РасходИзКассыВыплатаЗаработнойПлаты.Ведомость = ПлатежнаяВедомостьСотрудники.Ссылка
		|			И (РасходИзКассыВыплатаЗаработнойПлаты.Ссылка = &Ссылка)
		|			И (НЕ ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка))
		|			И (ЕСТЬNULL(ПлатежнаяВедомостьСотрудники.НДФЛПлатежа, 0) > 0)
		//ПодольскийАИ #УчетПроектов 12.02.2021 {
		|			И ВЫБОР 
		|				КОГДА &УчетПоПроектам 
		|					ТОГДА РасходИзКассыВыплатаЗаработнойПлаты.Проект = ПлатежнаяВедомостьСотрудники.Проект
		|							ИЛИ (ПлатежнаяВедомостьСотрудники.Проект = РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.ПроектДляЗачетаАвансаСПомощником
	|									И РасходИзКассыВыплатаЗаработнойПлаты.Проект = Значение(Справочник.Проекты.ПустаяСсылка))
		|				ИНАЧЕ Истина
		|			КОНЕЦ
		//ПодольскийАИ #УчетПроектов 12.02.2021 }
		|ГДЕ
		|	ЕСТЬNULL(ПлатежнаяВедомостьСотрудники.НДФЛПлатежа, 0) > 0
		|	И ВЫБОР
		|			КОГДА РасходИзКассыВыплатаЗаработнойПлаты.Ведомость.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
		|				ТОГДА НЕ &СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат,
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.ВалютаДенежныхСредств,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога.СчетУчета,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаРегл,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл,
		|	РасходИзКассыВыплатаЗаработнойПлаты.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл,
		|	РасходИзКассыВыплатаЗаработнойПлаты.СуммаНДФЛ,
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.Контрагент,
		|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.Дата,
		//ПодольскийАИ #УчетПроектов 12.02.2021 {
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА РасходИзКассыВыплатаЗаработнойПлаты.Проект
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ,
		//ПодольскийАИ #УчетПроектов 12.02.2021 }
		|	РасходИзКассыВыплатаЗаработнойПлаты.СуммаРасчетов
		|,	РасходИзКассыВыплатаЗаработнойПлаты.СуммаПлатежа //+++ Дмгг
		|ИЗ
		|	Документ.РасходИзКассы.РасшифровкаПлатежа КАК РасходИзКассыВыплатаЗаработнойПлаты
		|ГДЕ
		|	ЕСТЬNULL(РасходИзКассыВыплатаЗаработнойПлаты.СуммаНДФЛ, 0) > 0
		|	И РасходИзКассыВыплатаЗаработнойПлаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходИзКассы.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Организация КАК Организация,
		|	ВТ_НДФЛ.ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
		|	ВТ_НДФЛ.НДФЛсНачислений КАК ВидНалога,
		//|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа КАК ЧИСЛО(15, 2)) КАК Сумма,
		//|	ВЫРАЗИТЬ(ВТ_НДФЛ.СуммаРасчетов * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаРасчетовРегл,
		|	ВЫРАЗИТЬ(ВЫБОР 
		|		КОГДА РасходИзКассы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам) 
		|			И РасходИзКассы.ВалютаДенежныхСредств = &ВалютаУчета
		|			ТОГДА ВТ_НДФЛ.СуммаПлатежа
		|		ИНАЧЕ ВТ_НДФЛ.СуммаРасчетов * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность)
		|	КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаРасчетовРегл,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета КАК СчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл КАК СчетУчетаРегл,
		|	ВЫБОР
		|		КОГДА РасходИзКассы.СрокУплаты = &ПустаяДата
		|			ТОГДА ВТ_Шапка.СрокУплаты
		|		ИНАЧЕ РасходИзКассы.СрокУплаты
		|	КОНЕЦ КАК СрокУплаты,
		|	&НачислениеНалога КАК СодержаниеПроводки,
		|	ВТ_НДФЛ.Сотрудник,
		|	ВТ_НДФЛ.НДФЛПлатежа КАК СуммаВал,
		|	ВТ_НДФЛ.ПериодРегистрации,
		|	РасходИзКассы.ВалютаДенежныхСредств КАК Валюта,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_НДФЛ.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРегл,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		//ПодольскийАИ #УчетПроектов 12.02.2021 {
		|	ВТ_НДФЛ.Проект КАК Проект,
		//ПодольскийАИ #УчетПроектов 12.02.2021 }
		|	ВТ_НДФЛ.СуммаРасчетов
		|ПОМЕСТИТЬ ВТ_ДанныеНДФЛ
		|ИЗ
		|	ВТ_НДФЛ КАК ВТ_НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходИзКассы КАК РасходИзКассы
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыДокумента
		//|			ПО РасходИзКассы.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			ПО ВЫБОР 
		|				КОГДА РасходИзКассы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам) 
		|					ТОГДА РасходИзКассы.ДоговорКредитаЗайма.ВалютаРасчетов  = КурсВалютыДокумента.Валюта
		|				ИНАЧЕ РасходИзКассы.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			КОНЕЦ
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыУчета
		|			ПО (КурсВалютыУчета.Валюта = &ВалютаУчета)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Шапка КАК ВТ_Шапка
		|			ПО (ИСТИНА)
		|		ПО ВТ_НДФЛ.Ссылка = РасходИзКассы.Ссылка
		|ГДЕ
		|	РасходИзКассы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходИзКассы.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Организация,
		|	ВТ_НДФЛ.ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате),
		|	ВТ_НДФЛ.НДФЛсВыплат,
		//|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ВТ_НДФЛ.НДФЛПлатежа КАК ЧИСЛО(15, 2)),
		//|	ВЫРАЗИТЬ(ВТ_НДФЛ.СуммаРасчетов * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность) КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ВЫБОР 
		|		КОГДА РасходИзКассы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам) 
		|			И РасходИзКассы.ВалютаДенежныхСредств = &ВалютаУчета
		|			ТОГДА ВТ_НДФЛ.СуммаПлатежа
		|		ИНАЧЕ ВТ_НДФЛ.СуммаРасчетов * КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность / (КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность)
		|	КОНЕЦ КАК ЧИСЛО(15, 2)),
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВЫБОР
		|		КОГДА РасходИзКассы.СрокУплаты = &ПустаяДата
		|			ТОГДА ВТ_Шапка.СрокУплаты
		|		ИНАЧЕ РасходИзКассы.СрокУплаты
		|	КОНЕЦ,
		|	&ПогашениеНалога,
		|	ВТ_НДФЛ.Сотрудник,
		|	ВТ_НДФЛ.НДФЛПлатежа,
		|	ВТ_НДФЛ.ПериодРегистрации,
		|	РасходИзКассы.ВалютаДенежныхСредств,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_НДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_НДФЛ.СчетУчетаКВозмещениюРегл,
		|	ВТ_НДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		//ПодольскийАИ #УчетПроектов 12.02.2021 {
		|	ВТ_НДФЛ.Проект,
		//ПодольскийАИ #УчетПроектов 12.02.2021 }
		|	ВТ_НДФЛ.СуммаРасчетов
		|ИЗ
		|	ВТ_НДФЛ КАК ВТ_НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходИзКассы КАК РасходИзКассы
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыДокумента
		//|			ПО РасходИзКассы.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			ПО ВЫБОР 
		|				КОГДА РасходИзКассы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам) 
		|					ТОГДА РасходИзКассы.ДоговорКредитаЗайма.ВалютаРасчетов  = КурсВалютыДокумента.Валюта
		|				ИНАЧЕ РасходИзКассы.ВалютаДенежныхСредств = КурсВалютыДокумента.Валюта
		|			КОНЕЦ
		|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыУчета
		|			ПО (КурсВалютыУчета.Валюта = &ВалютаУчета)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Шапка КАК ВТ_Шапка
		|			ПО (ИСТИНА)
		|		ПО ВТ_НДФЛ.Ссылка = РасходИзКассы.Ссылка
		|ГДЕ
		|	РасходИзКассы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеНДФЛ.Период,
		|	ВТ_ДанныеНДФЛ.ВидДвижения,
		|	ВТ_ДанныеНДФЛ.Организация,
		|	ВТ_ДанныеНДФЛ.ВидНачисленияУдержания,
		|	ВТ_ДанныеНДФЛ.Операция,
		|	ВТ_ДанныеНДФЛ.ВидНалога,
		|	ВТ_ДанныеНДФЛ.Сумма,
		|	ВТ_ДанныеНДФЛ.СчетУчета,
		|	ВТ_ДанныеНДФЛ.СчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.СрокУплаты,
		|	ВТ_ДанныеНДФЛ.СодержаниеПроводки,
		|	ВТ_ДанныеНДФЛ.Сотрудник,
		|	ВТ_ДанныеНДФЛ.СуммаВал,
		|	ВТ_ДанныеНДФЛ.ПериодРегистрации,
		|	ВТ_ДанныеНДФЛ.Валюта,
		|	ВТ_ДанныеНДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_ДанныеНДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_ДанныеНДФЛ.НДФЛсВыплатСчетУчетаРегл,
		//ПодольскийАИ #УчетПроектов 12.02.2021 {
		|	ВТ_ДанныеНДФЛ.Проект КАК Проект,
		//ПодольскийАИ #УчетПроектов 12.02.2021 }
		|	ВТ_ДанныеНДФЛ.НДФЛсНачисленийСчетУчетаРегл
		|ИЗ
		|	ВТ_ДанныеНДФЛ КАК ВТ_ДанныеНДФЛ";
	Иначе
	//_Паганини
	
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Организация КАК Организация,
		|	ТаблицаДокумента.ВидНалога КАК ВидНалога,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.ВидНалогаСчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.ВидНалогаСчетУчетаРегл КАК СчетУчетаРегл,
		|	ТаблицаДокумента.СрокУплаты КАК СрокУплаты,
		|	&ОплатаНалога КАК СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Налоги)";
	
	КонецЕсли;//Паганини
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Паганини_
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", РезультатЗапроса.Выгрузить());
	врТаблицаРасчетыНДФЛ = РезультатЗапроса.Выгрузить();  
	врТаблицаРасчетыПоНалогам = врТаблицаРасчетыНДФЛ.Скопировать();	
	Если ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Зарплата ИЛИ ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику ИЛИ ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.РасчетыПоКредитам Тогда 
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", врТаблицаРасчетыНДФЛ);
	Иначе 
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", Новый ТаблицаЗначений);
	КонецЕсли;
	врТаблицаРасчетыПоНалогам.Свернуть("Период,ВидДвижения,Организация,ВидНалога,СчетУчета,СчетУчетаРегл,СрокУплаты,СодержаниеПроводки","Сумма");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", врТаблицаРасчетыПоНалогам);
	//_Паганини
	
	Если ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Поставщику Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ТаблицаРасчетыПоНалогам.Дата КАК Период,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
		//_Паганини ПФ	
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛНачислении КАК ВидНалога,
		|	ТаблицаРасчетыПоНалогам.Контрагент КАК Сотрудник,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ) КАК ПериодРегистрации,
		|	ТаблицаРасчетыПоНалогам.Валюта КАК Валюта,
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛ) КАК Сумма,
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛВал) КАК СуммаВал,
		|	&ПогашениеНалога КАК СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчетыПоНалогам
		|ГДЕ
		|	НЕ ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ,
		//_Паганини ПФ
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛНачислении,
		|	ТаблицаРасчетыПоНалогам.Контрагент,
		|	ТаблицаРасчетыПоНалогам.Валюта,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ)
		|
		//Паганини ПФ_
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛ) = 0
		|
		//_Паганини ПФ
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате) КАК Операция,
		//_Паганини ПФ
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛКОплате,
		|	ТаблицаРасчетыПоНалогам.Контрагент,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ),
		|	ТаблицаРасчетыПоНалогам.Валюта,
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛ),
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛВал),
		|	&НачислениеНалога
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчетыПоНалогам
		|ГДЕ
		|	НЕ ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ,
		//_Паганини ПФ
		|	ТаблицаРасчетыПоНалогам.Контрагент,
		|	ТаблицаРасчетыПоНалогам.Валюта,
		|	НАЧАЛОПЕРИОДА(ТаблицаРасчетыПоНалогам.Дата, МЕСЯЦ),
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛКОплате
		//Паганини ПФ_
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛ) = 0
		|
		//_Паганини ПФ
		|";
		
		Запрос.УстановитьПараметр("НачислениеНалога",	НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога';en='tax accrual'"));
		Запрос.УстановитьПараметр("ПогашениеНалога",	НСтр("ka='გადასახადის დაფარვა';ru='Погашение налога';en='repayment of the tax'"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		//Паганини_
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", РезультатЗапроса.Выгрузить());
		ТаблицаНДФЛ = РезультатЗапроса.Выгрузить();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ",		ТаблицаНДФЛ);
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам",	ТаблицаНДФЛ);
		//_Паганини
		
	КонецЕсли;
	
	Если ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику Тогда
			
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ТаблицаРасчетыПоНалогам.Дата КАК Период,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		//|	ТаблицаРасчетыПоНалогам.ТипНДФЛ.ВидНалога КАК ВидНалога,
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛНачислении КАК ВидНалога,
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
		|	ТаблицаРасчетыПоНалогам.НДФЛсНачисленийСчетУчета,
		|	ТаблицаРасчетыПоНалогам.НДФЛсНачисленийСчетУчетаРегл,
		|	ТаблицаРасчетыПоНалогам.НДФЛсВыплатСчетУчета,
		|	ТаблицаРасчетыПоНалогам.НДФЛсВыплатСчетУчетаРегл,
		|	ТаблицаРасчетыПоНалогам.НДФЛсНачисленийСчетУчета КАК СчетУчета,
		|	ТаблицаРасчетыПоНалогам.СчетУчетаКВозмещениюРегл,
		//_Паганини ПФ
		|	ТаблицаРасчетыПоНалогам.Подотчетник КАК Сотрудник,
		|	ТаблицаРасчетыПоНалогам.ПериодРегистрации КАК ПериодРегистрации,
		|	ТаблицаРасчетыПоНалогам.ВалютаДенежныхСредств КАК Валюта,
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛ) КАК Сумма,
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛВал) КАК СуммаВал,
		//ПодольскийАИ #УчетПроектов 12.02.2021 {
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА ТаблицаРасчетыПоНалогам.Проект
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ КАК Проект,
		//ПодольскийАИ #УчетПроектов 12.02.2021 }
		|	&ПогашениеНалога КАК СодержаниеПроводки
		//Паганини ПФ_
	    |ПОМЕСТИТЬ ВТ_ДанныеНДФЛ
		//_Паганини ПФ	
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ТаблицаРасчетыПоНалогам
		|ГДЕ
		//Паганини ПФ_
		//|	НЕ ТаблицаРасчетыПоНалогам.ТипНДФЛ = ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
		|	НЕ ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	    |	И НЕ ТаблицаРасчетыПоНалогам.СуммаНДФЛ = 0
		//_Паганини ПФ
		|	И ТаблицаРасчетыПоНалогам.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		//|	ТаблицаРасчетыПоНалогам.ТипНДФЛ.ВидНалога,
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛКОплате,
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛНачислении,
	    |	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ,
		|	ТаблицаРасчетыПоНалогам.НДФЛсНачисленийСчетУчета,
		|	ТаблицаРасчетыПоНалогам.НДФЛсНачисленийСчетУчетаРегл,
		|	ТаблицаРасчетыПоНалогам.НДФЛсВыплатСчетУчета,
		|	ТаблицаРасчетыПоНалогам.НДФЛсВыплатСчетУчетаРегл,
		|	ТаблицаРасчетыПоНалогам.НДФЛсНачисленийСчетУчета,
		|	ТаблицаРасчетыПоНалогам.СчетУчетаКВозмещениюРегл,
		//_Паганини ПФ		
		//ПодольскийАИ #УчетПроектов 12.02.2021 {
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА ТаблицаРасчетыПоНалогам.Проект
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ,
		//ПодольскийАИ #УчетПроектов 12.02.2021 }
		|	ТаблицаРасчетыПоНалогам.Подотчетник,
		|	ТаблицаРасчетыПоНалогам.ВалютаДенежныхСредств,
		|	ТаблицаРасчетыПоНалогам.ПериодРегистрации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.Организация,
		//Паганини ПФ_
		//|	ТаблицаРасчетыПоНалогам.ТипНДФЛ.ВидНалогаВыплат,
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛКОплате,
		|	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате) КАК Операция,
		|	ТаблицаРасчетыПоНалогам.НДФЛсНачисленийСчетУчета,
		|	ТаблицаРасчетыПоНалогам.НДФЛсНачисленийСчетУчетаРегл,
		|	ТаблицаРасчетыПоНалогам.НДФЛсВыплатСчетУчета,
		|	ТаблицаРасчетыПоНалогам.НДФЛсВыплатСчетУчетаРегл,
		|	ТаблицаРасчетыПоНалогам.НДФЛсНачисленийСчетУчета,
		|	ТаблицаРасчетыПоНалогам.СчетУчетаКВозмещениюРегл,
		//_Паганини ПФ
		|	ТаблицаРасчетыПоНалогам.Подотчетник,
		|	ТаблицаРасчетыПоНалогам.ПериодРегистрации,
		|	ТаблицаРасчетыПоНалогам.ВалютаДенежныхСредств,
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛ),
		|	СУММА(ТаблицаРасчетыПоНалогам.СуммаНДФЛВал),
		//ПодольскийАИ #УчетПроектов 12.02.2021 {
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА ТаблицаРасчетыПоНалогам.Проект
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ КАК Проект,
		//ПодольскийАИ #УчетПроектов 12.02.2021 }
		|	&НачислениеНалога
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ТаблицаРасчетыПоНалогам
		|ГДЕ
		//Паганини ПФ_
		//|	НЕ ТаблицаРасчетыПоНалогам.ТипНДФЛ = ЗНАЧЕНИЕ(Справочник.ТипыНДФЛ.ПустаяСсылка)
		|	НЕ ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	    |	И НЕ ТаблицаРасчетыПоНалогам.СуммаНДФЛ = 0
		//_Паганини ПФ
		|	И ТаблицаРасчетыПоНалогам.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаРасчетыПоНалогам.Дата,
		|	ТаблицаРасчетыПоНалогам.Организация,
		|	ТаблицаРасчетыПоНалогам.Подотчетник,
		|	ТаблицаРасчетыПоНалогам.ВалютаДенежныхСредств,
		|	ТаблицаРасчетыПоНалогам.ПериодРегистрации,
		//Паганини ПФ_
	    |	ТаблицаРасчетыПоНалогам.ВидУдержанияНДФЛ,
		|	ТаблицаРасчетыПоНалогам.НДФЛсНачисленийСчетУчета,
		|	ТаблицаРасчетыПоНалогам.НДФЛсНачисленийСчетУчетаРегл,
		|	ТаблицаРасчетыПоНалогам.НДФЛсВыплатСчетУчета,
		|	ТаблицаРасчетыПоНалогам.НДФЛсВыплатСчетУчетаРегл,
		|	ТаблицаРасчетыПоНалогам.НДФЛсНачисленийСчетУчета,
		|	ТаблицаРасчетыПоНалогам.СчетУчетаКВозмещениюРегл,
		//ПодольскийАИ #УчетПроектов 12.02.2021 {
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА ТаблицаРасчетыПоНалогам.Проект
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ,
		//ПодольскийАИ #УчетПроектов 12.02.2021 }
		//_Паганини ПФ
		|	ТаблицаРасчетыПоНалогам.ВидНалогаНДФЛКОплате
		//Паганини ПФ_
	    |;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеНДФЛ.ВидДвижения,
		|	ВТ_ДанныеНДФЛ.Период,
		|	ВТ_ДанныеНДФЛ.Организация,
		|	ВТ_ДанныеНДФЛ.ВидНачисленияУдержания,
		|	ВТ_ДанныеНДФЛ.Операция,
		|	ВТ_ДанныеНДФЛ.СчетУчета,
		|	ВТ_ДанныеНДФЛ.НДФЛсНачисленийСчетУчета,
		|	ВТ_ДанныеНДФЛ.НДФЛсНачисленийСчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.НДФЛсВыплатСчетУчета,
		|	ВТ_ДанныеНДФЛ.НДФЛсВыплатСчетУчетаРегл,
		|	ВТ_ДанныеНДФЛ.СчетУчетаКВозмещениюРегл,
		|	ВТ_ДанныеНДФЛ.ВидНалога,
		|	ВТ_ДанныеНДФЛ.Сотрудник,
		|	ВТ_ДанныеНДФЛ.ПериодРегистрации,
		|	ВТ_ДанныеНДФЛ.Валюта,
		|	ВТ_ДанныеНДФЛ.Сумма,
		|	ВТ_ДанныеНДФЛ.СуммаВал,
		//ПодольскийАИ #УчетПроектов 12.02.2021 {
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА ВТ_ДанныеНДФЛ.Проект
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ КАК Проект,
		//ПодольскийАИ #УчетПроектов 12.02.2021 }
		|	ВТ_ДанныеНДФЛ.СодержаниеПроводки
		|ИЗ
		|	ВТ_ДанныеНДФЛ КАК ВТ_ДанныеНДФЛ";
		//_Паганини ПФ	
		
		
		Запрос.УстановитьПараметр("НачислениеНалога",	НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога';en='tax accrual'"));
		Запрос.УстановитьПараметр("ПогашениеНалога",	НСтр("ka='გადასახადის დაფარვა';ru='Погашение налога';en='repayment of the tax'"));
		
		//ПодольскийАИ #УчетПроектов 12.02.2021 {
		Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
		//ПодольскийАИ #УчетПроектов 12.02.2021 }
		
		РезультатЗапроса = Запрос.Выполнить();
		
		//Паганини_
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", РезультатЗапроса.Выгрузить());
		ТаблицаНДФЛ = РезультатЗапроса.Выгрузить();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ",		ТаблицаНДФЛ);
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам",	ТаблицаНДФЛ);
		//_Паганини
		
	КонецЕсли;
	
КонецПроцедуры // СформироватьТаблицаРасчетыПоНалогам()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПлатежныйКалендарь(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьПлатежныйКалендарь", Константы.ФункциональнаяОпцияПлатежныйКалендарь.Получить());
	Запрос.УстановитьПараметр("ИспользуютсяПереводыВПути",РегистрыСведений.ПрименениеПереводовВПути.ИспользуютсяПереводыВПути(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата,СтруктураДополнительныеСвойства.ДляПроведения.Организация));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные) КАК ТипДенежныхСредств,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыУтвержденияПлатежей.Утвержден) КАК СтатусУтвержденияПлатежа,
	|	ТаблицаДокумента.Касса КАК БанковскийСчетКасса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.РасчетыВУсловныхЕдиницах
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ ТаблицаДокумента.ВалютаДенежныхСредств
	|	КОНЕЦ КАК Валюта,
	|	ТаблицаДокумента.СчетНаОплатуДляПлатежногоКалендаря КАК СчетНаОплату,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.Договор.РасчетыВУсловныхЕдиницах
	|				ТОГДА -ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ -ТаблицаДокумента.СуммаПлатежа
	|		КОНЕЦ) КАК СуммаОплаты
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&ИспользоватьПлатежныйКалендарь
	|	И ТаблицаДокумента.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Зарплата)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Касса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.РасчетыВУсловныхЕдиницах
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ ТаблицаДокумента.ВалютаДенежныхСредств
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетНаОплатуДляПлатежногоКалендаря
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ТаблицаДокумента.Статья,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыУтвержденияПлатежей.Утвержден),
	|	ТаблицаДокумента.СчетОрганизации,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.РасчетыВУсловныхЕдиницах
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ ТаблицаДокумента.ВалютаДенежныхСредств
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетНаОплатуДляПлатежногоКалендаря,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.Договор.РасчетыВУсловныхЕдиницах
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ТаблицаДокумента.СуммаПлатежа
	|		КОНЕЦ)
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	&ИспользоватьПлатежныйКалендарь
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|	И НЕ &ИспользуютсяПереводыВПути
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Касса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.РасчетыВУсловныхЕдиницах
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ ТаблицаДокумента.ВалютаДенежныхСредств
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетНаОплатуДляПлатежногоКалендаря,
	|	ТаблицаДокумента.СчетОрганизации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ТаблицаДокумента.Ссылка.Статья,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные),
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыУтвержденияПлатежей.Утвержден),
	|	ТаблицаДокумента.Ссылка.Касса,
	|	ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.ДокументПланирования,
	|	СУММА(-ТаблицаДокумента.СуммаПлатежа)
	|ИЗ
	|	Документ.РасходИзКассы.ВыплатаЗаработнойПлаты КАК ТаблицаДокумента
	|ГДЕ
	|	&ИспользоватьПлатежныйКалендарь
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Зарплата)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.ДокументПланирования,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Ссылка.Статья,
	|	ТаблицаДокумента.Ссылка.Касса,
	|	ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	1,
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ТаблицаДокумента.Статья,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные),
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыУтвержденияПлатежей.Утвержден),
	|	ТаблицаДокумента.Касса,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	НЕОПРЕДЕЛЕНО,
	|	-ТаблицаДокумента.СуммаДокумента
	|ИЗ
	|	Документ.РасходИзКассы КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КОЛИЧЕСТВО(ЕСТЬNULL(ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки, 0)) КАК Количество
	|		ИЗ
	|			ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа) КАК ВложенныйЗапрос
	|		ПО (ИСТИНА)
	|ГДЕ
	|	&ИспользоватьПлатежныйКалендарь
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И ВложенныйЗапрос.Количество = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлатежныйКалендарь", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПлатежныйКалендарь()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.СчетНаОплату КАК СчетНаОплату,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА ТаблицаДокумента.ВалютаДенежныхСредств = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаПлатежа
	|			КОГДА ТаблицаДокумента.ВалютаРасчетов = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СуммаАванса,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА ТаблицаДокумента.ВалютаДенежныхСредств = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаПлатежа
	|			КОГДА ТаблицаДокумента.ВалютаРасчетов = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СуммаОплаты
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютСчета
	|		ПО ТаблицаДокумента.СчетНаОплату.ВалютаДокумента = КурсыВалютСчета.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	ТаблицаДокумента.ВестиУчетОплатыПоСчетам
	|	И ТаблицаДокумента.СчетНаОплату <> ЗНАЧЕНИЕ(Документ.СчетНаОплату.ПустаяСсылка)
	|	И ТаблицаДокумента.СчетНаОплату <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПоставщика.ПустаяСсылка)
	|	И ТаблицаДокумента.СчетНаОплату <> НЕОПРЕДЕЛЕНО
	|	И (ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.ВидОперации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ТаблицаДокумента.Заказ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА ТаблицаДокумента.ВалютаДенежныхСредств = ТаблицаДокумента.Заказ.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаПлатежа
	|			КОГДА ТаблицаДокумента.ВалютаРасчетов = ТаблицаДокумента.Заказ.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА ТаблицаДокумента.ВалютаДенежныхСредств = ТаблицаДокумента.Заказ.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаПлатежа
	|			КОГДА ТаблицаДокумента.ВалютаРасчетов = ТаблицаДокумента.Заказ.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютСчета
	|		ПО ТаблицаДокумента.Заказ.ВалютаДокумента = КурсыВалютСчета.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДенежныхСредств = КурсыВалютКассы.Валюта
	|ГДЕ
	|	ТаблицаДокумента.ВестиУчетОплатыПоСчетам
	|	И (ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Заказ) = ТИП(Документ.ЗаказПокупателя)
	|				И ТаблицаДокумента.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Заказ) = ТИП(Документ.ЗаказПоставщику)
	|				И ТаблицаДокумента.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка))
	|	И (ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.ВидОперации
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОплатаСчетовИЗаказов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаОплатаСчетовИЗаказов()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьНДФЛРасчетыНалоговыхАгентовСБюджетом(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетыСНДФЛ.Период,
	|	РасчетыСНДФЛ.Организация,
	|	РасчетыСНДФЛ.ВидДвижения,
	|	РасчетыСНДФЛ.ПериодРегистрации,
	|	РасчетыСНДФЛ.Сумма
	|ИЗ
	|	ВТРасчетыСНДФЛ КАК РасчетыСНДФЛ";
	
	
	// Обрабатываем НДФЛ
	ВыборкаПоНДФЛ = Запрос.Выполнить().Выбрать();
	ТаблицаПоНДФЛ = Новый ТаблицаЗначений();
	ТаблицаПоНДФЛ.Колонки.Добавить("Период",Новый ОписаниеТипов("Дата"));
	ТаблицаПоНДФЛ.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаПоНДФЛ.Колонки.Добавить("ВидДвижения",Новый ОписаниеТипов("ВидДвиженияНакопления"));
	ТаблицаПоНДФЛ.Колонки.Добавить("ПериодРегистрации",Новый ОписаниеТипов("Дата"));
	ТаблицаПоНДФЛ.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаПоНДФЛ.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"),Новый КвалификаторыЧисла(15,2));
	
	Если ВыборкаПоНДФЛ.Следующий() Тогда
		СтрокиРаспределения = Сотрудники.РаспределитьПеречисленныйНалогПоФизическимЛицам(ДокументСсылкаРасходИзКассы, ДокументСсылкаРасходИзКассы.Организация,ВыборкаПоНДФЛ.Период , ВыборкаПоНДФЛ.Сумма, ВыборкаПоНДФЛ.ПериодРегистрации);
		Для Каждого СтрокаТЗ Из СтрокиРаспределения Цикл
			НоваяСтрока = ТаблицаПоНДФЛ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоНДФЛ, , "Сумма");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЦикла;
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНДФЛРасчетыНалоговыхАгентовСБюджетом", ТаблицаПоНДФЛ);
	
КонецПроцедуры // СформироватьНДФЛРасчетыНалоговыхАгентовСБюджетом()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьРасчетыСФондамиПоСтраховымВзносам(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетыСФондамиПоСтраховымВзносам.Период,
	|	РасчетыСФондамиПоСтраховымВзносам.Организация,
	|	РасчетыСФондамиПоСтраховымВзносам.ВидДвижения,
	|	РасчетыСФондамиПоСтраховымВзносам.ЭтоСтраховыеВзносы,
	|	РасчетыСФондамиПоСтраховымВзносам.ВидОбязательногоСтрахованияСотрудников,
	|	РасчетыСФондамиПоСтраховымВзносам.Сумма
	|ИЗ
	|	ВТРасчетыСФондамиПоСтраховымВзносам КАК РасчетыСФондамиПоСтраховымВзносам";
	
	
	// Обрабатываем НДФЛ
	ВыборкаПоВзносам = Запрос.Выполнить().Выбрать();
	ТаблицаПоВзносам = Новый ТаблицаЗначений();
	ТаблицаПоВзносам.Колонки.Добавить("Период",Новый ОписаниеТипов("Дата"));
	ТаблицаПоВзносам.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаПоВзносам.Колонки.Добавить("ВидДвижения",Новый ОписаниеТипов("ВидДвиженияНакопления"));
	ТаблицаПоВзносам.Колонки.Добавить("ЭтоСтраховыеВзносы",Новый ОписаниеТипов("Булево"));
	ТаблицаПоВзносам.Колонки.Добавить("ВидОбязательногоСтрахованияСотрудников",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОбязательногоСтрахованияСотрудников"));
	ТаблицаПоВзносам.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаПоВзносам.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"),Новый КвалификаторыЧисла(15,2));
	
	Если ВыборкаПоВзносам.Следующий() Тогда
		СтрокиРаспределения = Сотрудники.РаспределитьПеречисленныйВзносПоФизическимЛицам(ДокументСсылкаРасходИзКассы, ДокументСсылкаРасходИзКассы.Организация,ВыборкаПоВзносам.Период , ВыборкаПоВзносам.Сумма, ВыборкаПоВзносам.ВидОбязательногоСтрахованияСотрудников);
		Для Каждого СтрокаТЗ Из СтрокиРаспределения Цикл
			НоваяСтрока = ТаблицаПоВзносам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоВзносам, , "Сумма");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЦикла;
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСФондамиПоСтраховымВзносам", ТаблицаПоВзносам);
	
КонецПроцедуры // СформироватьРасчетыСФондамиПоСтраховымВзносам()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗакупкиПоставщиковДляКУДиР(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("ДатаДокумента", СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Период,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК ДатаДокумента,
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ОрганизацияВНУ КАК Организация,
	|	&Ссылка КАК ДенежныйДокумент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Документ КАК ТоварныйДокумент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.УчитыватьВНУ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СтавкаНДС.Ставка КАК СтавкаНДС,
	|	ЛОЖЬ КАК ЭтоТоварыКРеализации,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВал,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов КАК Валюта
	|ПОМЕСТИТЬ ВременнаяТаблицаЗакупкиПоставщиковДляКУДиР
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|	И ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|	И НЕ ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|	И ВременнаяТаблицаРасшифровкаПлатежа.ОрганизацияВНУ.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ОрганизацияВНУ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.УчитыватьВНУ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.СтавкаНДС.Ставка,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Документ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ТоварныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗакупкиПоставщиковДляКУДиР.ТоварныйДокумент
	|ПОМЕСТИТЬ ВТТоварныеДокументы
	|ИЗ
	|	ВременнаяТаблицаЗакупкиПоставщиковДляКУДиР КАК ВТЗакупкиПоставщиковДляКУДиР
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная КАК ДокументПриходнаяНакладная
	|		ПО (ДокументПриходнаяНакладная.Ссылка = ВТЗакупкиПоставщиковДляКУДиР.ТоварныйДокумент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПримененияЕНВД.СрезПоследних(&ДатаДокумента, ) КАК ПримененияЕНВД
	|		ПО ВТЗакупкиПоставщиковДляКУДиР.Организация = ПримененияЕНВД.Организация
	|			И (ПримененияЕНВД.СтруктурнаяЕдиница = ДокументПриходнаяНакладная.СтруктурнаяЕдиница)
	|ГДЕ
	|	(ДокументПриходнаяНакладная.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ЕСТЬNULL(ПримененияЕНВД.РозничнаяТорговляОблагаетсяЕНВД, ЛОЖЬ))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗакупкиПоставщиковДляКУДиР.ТоварныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТоварныеДокументы.ТоварныйДокумент,
	|	ЗакупкиДляКУДиР.Номенклатура,
	|	ЗакупкиДляКУДиР.ЭтоТоварыКРеализации,
	|	СУММА(ЗакупкиДляКУДиР.СуммаВал) КАК Сумма,
	|	СУММА(ЗакупкиДляКУДиР.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТУчтенныеТовары
	|ИЗ
	|	РегистрНакопления.ЗакупкиДляКУДиР КАК ЗакупкиДляКУДиР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварныеДокументы КАК ВТТоварныеДокументы
	|		ПО (ВТТоварныеДокументы.ТоварныйДокумент = ЗакупкиДляКУДиР.ТоварныйДокумент)
	|			И (ЗакупкиДляКУДиР.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТТоварныеДокументы.ТоварныйДокумент,
	|	ЗакупкиДляКУДиР.Номенклатура,
	|	ЗакупкиДляКУДиР.ЭтоТоварыКРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗакупкиПоставщиковДляКУДиР.Период,
	|	ВТЗакупкиПоставщиковДляКУДиР.ДатаДокумента,
	|	ВТЗакупкиПоставщиковДляКУДиР.НомерСтроки,
	|	ВТЗакупкиПоставщиковДляКУДиР.Организация,
	|	ВТЗакупкиПоставщиковДляКУДиР.ДенежныйДокумент,
	|	ВТЗакупкиПоставщиковДляКУДиР.ТоварныйДокумент,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	ВТЗакупкиПоставщиковДляКУДиР.УчитыватьВНУ,
	|	ВТЗакупкиПоставщиковДляКУДиР.ЭтоТоварыКРеализации,
	|	ВТЗакупкиПоставщиковДляКУДиР.СуммаВал,
	|	ВТЗакупкиПоставщиковДляКУДиР.СуммаВал КАК Сумма,
	|	ВТЗакупкиПоставщиковДляКУДиР.СтавкаНДС,
	|	0 КАК Количество,
	|	0 КАК СуммаНДС
	|ИЗ
	|	ВременнаяТаблицаЗакупкиПоставщиковДляКУДиР КАК ВТЗакупкиПоставщиковДляКУДиР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТоварныеДокументы.ТоварныйДокумент КАК ТоварныйДокумент,
	|	Закупки.Номенклатура,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Закупки.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА Закупки.Количество - ЕСТЬNULL(ВТУчтенныеТовары.Количество, 0)
	|		ИНАЧЕ Закупки.Количество * Закупки.ЕдиницаИзмерения.Коэффициент - ЕСТЬNULL(ВТУчтенныеТовары.Количество, 0)
	|	КОНЕЦ КАК Количество,
	|	Закупки.Всего - ЕСТЬNULL(ВТУчтенныеТовары.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(Закупки.СтавкаНДС.Ставка, 0) КАК СтавкаНДС,
	|	НЕ Закупки.ТоварыДляПроизводства КАК ЭтоТоварыКРеализации
	|ИЗ
	|	ВТТоварныеДокументы КАК ВТТоварныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Запасы КАК Закупки
	|		ПО (Закупки.Ссылка = ВТТоварныеДокументы.ТоварныйДокумент)
	|			И (Закупки.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУчтенныеТовары КАК ВТУчтенныеТовары
	|		ПО (ВТУчтенныеТовары.ТоварныйДокумент = ВТТоварныеДокументы.ТоварныйДокумент)
	|			И (ВТУчтенныеТовары.Номенклатура = Закупки.Номенклатура)
	|ГДЕ
	|	Закупки.Всего - ЕСТЬNULL(ВТУчтенныеТовары.Сумма, 0) <> 0
	|ИТОГИ ПО
	|	ТоварныйДокумент";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаОплаты = РезультатЗапроса[3].Выгрузить();
	ТаблицаРезультат = ТаблицаОплаты.Скопировать(Новый Массив());
	ВыборкаДокументовСТоварами = РезультатЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	УчетВалюты = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	НацВалюта = Константы.НациональнаяВалюта.Получить();
	ВалютаДокумента = ДокументСсылкаРасходИзКассы.ВалютаДенежныхСредств;
	
	Если УчетВалюты И ВалютаДокумента <> НацВалюта Тогда
		ТекущийКурс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ДокументСсылкаРасходИзКассы.Дата);
	КонецЕсли;
	
	Пока ВыборкаДокументовСТоварами.Следующий() Цикл
		СвободныеОплаты = ТаблицаОплаты.НайтиСтроки(Новый Структура("ТоварныйДокумент", ВыборкаДокументовСТоварами.ТоварныйДокумент));
		ВыборкаЗаписей = ВыборкаДокументовСТоварами.Выбрать();
		Для Каждого ДокументОплаты Из СвободныеОплаты Цикл
			Пока ДокументОплаты.Сумма <> 0 И ВыборкаЗаписей.Следующий() Цикл
				НовСтр = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаЗаписей);
				ЗаполнитьЗначенияСвойств(НовСтр, ДокументОплаты,,"ЭтоТоварыКРеализации");
				Если ДокументОплаты.Сумма >= ВыборкаЗаписей.Сумма Тогда
					НовСтр.Сумма = ВыборкаЗаписей.Сумма;
				Иначе
					НовСтр.Сумма = ДокументОплаты.Сумма;
				КонецЕсли;
				ДокументОплаты.Сумма = ДокументОплаты.Сумма - НовСтр.Сумма;
				НовСтр.СуммаВал = НовСтр.Сумма;
				
				Если УчетВалюты И ВалютаДокумента <> НацВалюта Тогда
					НовСтр.Сумма = НовСтр.Сумма * ТекущийКурс.Курс / ТекущийКурс.Кратность;
				КонецЕсли;
				НовСтр.СуммаНДС = НовСтр.Сумма - НовСтр.Сумма /((100+ ВыборкаЗаписей.СтавкаНДС)/100);
				НовСтр.Номенклатура = ВыборкаЗаписей.Номенклатура;
				НовСтр.Количество =  ВыборкаЗаписей.Количество;
				НовСтр.Сумма = НовСтр.Сумма - НовСтр.СуммаНДС;
			КонецЦикла;
			Если ДокументОплаты.Сумма <> 0 Тогда
				НовСтр = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ДокументОплаты);
				НовСтр.СуммаВал = НовСтр.Сумма;
				Если УчетВалюты И ВалютаДокумента <> НацВалюта Тогда
					НовСтр.Сумма = НовСтр.Сумма * ТекущийКурс.Курс / ТекущийКурс.Кратность;
				КонецЕсли;
				НовСтр.СуммаНДС = НовСтр.Сумма - НовСтр.Сумма /((100+ ДокументОплаты.СтавкаНДС)/100);
				НовСтр.Сумма = НовСтр.Сумма - НовСтр.СуммаНДС;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗакупкиДляКУДиР", ТаблицаРезультат);
	
КонецПроцедуры // СформироватьТаблицаЗакупкиПоставщиковДляКУДиР()

#Область Биллинг

// Формирует таблицу значений, содержащую данные для проведения по регистру ВыполнениеДоговоровОбслуживания.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВыполнениеДоговораОбслуживания(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылкаРасходИзКассы.НаправлениеДеятельности)
		ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьБиллинг")
		ИЛИ НЕ Константы.БиллингВестиУчетРасходовПоДоговорамОбслуживания.Получить() Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыполнениеДоговораОбслуживания", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаШапка.Дата КАК Период,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ВременнаяТаблицаШапка.Корреспонденция КАК ОбъектДоговораОбслуживания,
	|	ИСТИНА КАК УказанаСтоимость,
	|	1 КАК Количество,
	|	ВременнаяТаблицаШапка.СуммаПоДоговоруОбслуживания КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВременнаяТаблицаШапка.НаправлениеДеятельности = ДоговорыКонтрагентов.ДоговорОбслуживанияНаправлениеДеятельности
	|ГДЕ
	|	(ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Прочее)
	|			ИЛИ ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.НаРасходы))
	|	И ДоговорыКонтрагентов.ЭтоДоговорОбслуживания";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыполнениеДоговораОбслуживания", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ОрганизацияДляРегОтчетности", ДокументСсылкаРасходИзКассы.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаДС", ДокументСсылкаРасходИзКассы.ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("ВалютаДоговораКредитаЗайма", ДокументСсылкаРасходИзКассы.ДоговорКредитаЗайма.ВалютаРасчетов);
	Если НЕ ЗначениеЗаполнено(ДокументСсылкаРасходИзКассы.НаправлениеДеятельности)
		ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьБиллинг")
		ИЛИ НЕ Константы.БиллингВестиУчетРасходовПоДоговорамОбслуживания.Получить() Тогда
		Запрос.УстановитьПараметр("ВалютаДоговораОбслуживания", Справочники.Валюты.ПустаяСсылка());
	Иначе
		ДоговорОбслуживания = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("ДоговорОбслуживанияНаправлениеДеятельности", ДокументСсылкаРасходИзКассы.НаправлениеДеятельности);
		Запрос.УстановитьПараметр("ВалютаДоговораОбслуживания", ?(ЗначениеЗаполнено(ДоговорОбслуживания), ДоговорОбслуживания.ВалютаРасчетов, Справочники.Валюты.ПустаяСсылка()));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОбъединятьНакопительнуюИСтраховуюЧасть", ?(ЗначениеЗаполнено(ДокументСсылкаРасходИзКассы.ДокументОснование), ДокументСсылкаРасходИзКассы.ДокументОснование.Дата >= УчетСтраховыхВзносов.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР(), Истина));
	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
	Запрос.УстановитьПараметр("ПериодРегистрацииНДФЛ", НачалоМесяца(ДобавитьМесяц(ДокументСсылкаРасходИзКассы.СрокУплаты, -1)));
	Запрос.УстановитьПараметр("ИспользованиеТолькоРеглПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов); //+++ Дмгг
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам); //Малышев 2025-01-28 ONESOFT-3797
   
	СтраховыеВидыВзаиморасчетов = Новый Массив();
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ПФРНакопительнаяСотрудники);
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ПФРСтраховаяСотрудники);
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ФОМССотрудники);
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ФСССотрудники);
	СтраховыеВидыВзаиморасчетов.Добавить(Справочники.ВидыНалогов.ФССТравматизмСотрудники);
	
	Запрос.УстановитьПараметр("СтраховыеВидыВзаиморасчетов",СтраховыеВидыВзаиморасчетов);
	
	Запрос.УстановитьПараметр("ИспользоватьСтатьиДДС", ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиДвиженияДенежныхСредств"));
	
	//Паганини_В запроце "ВременнаяТаблицаРасшифровкаПлатежа" добавленн поле ТипНДФЛ_Паганини
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаДС, &ВалютаДоговораКредитаЗайма, &ВалютаДоговораОбслуживания)) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НачислениеНалоговНалоги.СрокУплаты
	|ПОМЕСТИТЬ ВременнаяТаблицаСрокУплаты
	|ИЗ
	|	Документ.НачислениеНалогов.Налоги КАК НачислениеНалоговНалоги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходИзКассы КАК РасходИзКассы
	|		ПО (РасходИзКассы.Ссылка = &Ссылка)
	|			И НачислениеНалоговНалоги.Ссылка = РасходИзКассы.ДокументОснование
	|			И (РасходИзКассы.ВидНалога = НачислениеНалоговНалоги.ВидНалога)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.Ссылка.ВидОперации КАК ВидОперации,
	|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.УчитыватьВНУ КАК УчитыватьВНУ,
	|	ТаблицаДокумента.Ссылка.Организация КАК ОрганизацияВНУ,
	|	ТаблицаДокумента.СтавкаНДС,
	|	ТаблицаДокумента.Договор КАК Договор,
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект КАК Проект,
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка) //Малышев 2025-01-28 ONESOFT-3797
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА 
	|				ВЫБОР 
	|					КОГДА ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|					ИНАЧЕ ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare_
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.ЭтоДоговорОбслуживания
	|				И ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВестиУчетРасходовПоДоговорамОбслуживания,
	|	ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности КАК ДоговорОбслуживанияНаправлениеДеятельности,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.Касса КАК Касса,
	|	ТаблицаДокумента.Ссылка.Корреспонденция КАК Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл КАК КорреспонденцияРегл,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьСтатьиДДС
	|				ИЛИ ТаблицаДокумента.СтатьяДДС = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Ссылка.Статья
	|		ИНАЧЕ ТаблицаДокумента.СтатьяДДС
	|	КОНЕЦ КАК Статья,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю)
	|				И ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|				И ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ КАК Заказ,
	|	ТаблицаДокумента.ПризнакАванса КАК ПризнакАванса,
	|	ТаблицаДокумента.Ссылка.Дата КАК Дата,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаУчета,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаРасчетов,
	|	СУММА(ТаблицаДокумента.СуммаПлатежа) КАК СуммаПлатежа,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументПланирования) = ТИП(Документ.РасходДСПлан)
	|				И ТаблицаДокумента.ДокументПланирования <> ЗНАЧЕНИЕ(Документ.РасходДСПлан.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.ДокументПланирования
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументПланирования) = ТИП(Документ.ПеремещениеДСПлан)
	|				И ТаблицаДокумента.ДокументПланирования <> ЗНАЧЕНИЕ(Документ.ПеремещениеДСПлан.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.ДокументПланирования
	|		КОГДА ТаблицаДокумента.СчетНаОплату.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.СчетНаОплату
	|		КОГДА ТаблицаДокумента.Заказ.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетНаОплатуДляПлатежногоКалендаря,
	|	ТаблицаДокумента.СчетНаОплату КАК СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.Касса.СчетУчета КАК БанковскийСчетКассаСчетУчета,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.Касса.СчетУчетаРегл КАК БанковскийСчетКассаСчетУчетаРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл КАК СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл КАК СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.ТипСуммы,
	|	ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма,
	|	ТаблицаДокумента.Ссылка.СчетОрганизации КАК СчетОрганизации,
	|	ТаблицаДокумента.Ссылка.Подотчетник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчета
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаПроцентов
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаКомиссии
	|	КОНЕЦ КАК СчетУчетаПоТипуСуммы,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаКомиссииРегл
	|	КОНЕЦ КАК СчетУчетаПоТипуСуммыРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ""Оплата основного долга по кредиту""
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ""Оплата процентов по кредиту""
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ""Оплата комиссии по кредиту""
	|	КОНЕЦ КАК СодержаниеПоТипуСуммы,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Подотчетнику)
	|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Прочее)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.НаРасходы)
	|			ТОГДА ТаблицаДокумента.Ссылка.Корреспонденция
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаЗаймаСотруднику)
	|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ)
	|			ТОГДА ТаблицаДокумента.Ссылка.КассаККМ
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Налоги)
	|			ТОГДА ТаблицаДокумента.Ссылка.ВидНалога
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику)
	|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|			ТОГДА ТаблицаДокумента.Ссылка.СчетОрганизации
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|			ТОГДА ТаблицаДокумента.Ссылка.Касса
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент
	|	КОНЕЦ КАК АналитикаДДС,
	|	ТаблицаДокумента.Ссылка.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|				И ТаблицаДокумента.Договор.УчитыватьНДФЛ
	|			ТОГДА ТаблицаДокумента.ВидУдержанияНДФЛ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|	КОНЕЦ КАК ВидУдержанияНДФЛ,
	//Паганини ПФ_
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчета     КАК НДФЛсНачисленийСчетУчета,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК НДФЛсНачисленийСчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещению КАК НДФЛсВыплатСчетУчета,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК НДФЛсВыплатСчетУчетаРегл,
	|	ЕСТЬNULL(ТаблицаДокумента.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0) КАК СтавкаНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат КАК ВидНалогаНДФЛКОплате,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога КАК ВидНалогаНДФЛНачислении,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛ * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаНДФЛ,
	|	СУММА(ТаблицаДокумента.СуммаНДФЛ) КАК СуммаНДФЛВал,
	|	ТаблицаДокумента.ВидУдержанияПФ,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПФ * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаПФ,
	|	СУММА(ТаблицаДокумента.СуммаПФ) КАК СуммаПФВал,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФСотрудника,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФОрганизации,
	|	ТаблицаДокумента.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	ТаблицаДокумента.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДС * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаНДС,
	|	СУММА(ТаблицаДокумента.СуммаНДС) КАК СуммаНДСВал,
	//_Паганини ПФ
	|	ТаблицаДокумента.Ссылка.Перемещение КАК ЭтоПеремещение
	|ПОМЕСТИТЬ ВременнаяТаблицаРасшифровкаПлатежа
	|ИЗ
	|	Документ.РасходИзКассы.РасшифровкаПлатежа КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ТаблицаДокумента.Ссылка.УчитыватьВНУ,
	|	ТаблицаДокумента.Ссылка.Организация,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Договор,
	//+++ Дмгг
	//|	ТаблицаДокумента.Проект,
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка) //Малышев 2025-01-28 ONESOFT-3797
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА 
	|				ВЫБОР 
	|					КОГДА ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|					ИНАЧЕ ТаблицаДокумента.Ссылка.ПроектДляЗачетаАвансаСПомощником
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДокумента.Ссылка.Касса,
	|	ТаблицаДокумента.Ссылка.Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.СчетОрганизации,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю)
	|				И ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|				И ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументПланирования) = ТИП(Документ.РасходДСПлан)
	|				И ТаблицаДокумента.ДокументПланирования <> ЗНАЧЕНИЕ(Документ.РасходДСПлан.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.ДокументПланирования
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументПланирования) = ТИП(Документ.ПеремещениеДСПлан)
	|				И ТаблицаДокумента.ДокументПланирования <> ЗНАЧЕНИЕ(Документ.ПеремещениеДСПлан.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.ДокументПланирования
	|		КОГДА ТаблицаДокумента.СчетНаОплату.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.СчетНаОплату
	|		КОГДА ТаблицаДокумента.Заказ.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.Касса.СчетУчета,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Ссылка.Касса.СчетУчетаРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.ТипСуммы,
	|	ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма,
	|	ТаблицаДокумента.Ссылка.Подотчетник,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчета
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаПроцентов
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаКомиссии
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.Ссылка.ДоговорКредитаЗайма.СчетУчетаКомиссииРегл
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ""Оплата основного долга по кредиту""
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ""Оплата процентов по кредиту""
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ""Оплата комиссии по кредиту""
	|	КОНЕЦ,
	|	ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.ЭтоДоговорОбслуживания
	|				И ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Подотчетнику)
	|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Прочее)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.НаРасходы)
	|			ТОГДА ТаблицаДокумента.Ссылка.Корреспонденция
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаЗаймаСотруднику)
	|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ)
	|			ТОГДА ТаблицаДокумента.Ссылка.КассаККМ
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Налоги)
	|			ТОГДА ТаблицаДокумента.Ссылка.ВидНалога
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику)
	|			ТОГДА ТаблицаДокумента.Ссылка.Подотчетник
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|			ТОГДА ТаблицаДокумента.Ссылка.СчетОрганизации
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|			ТОГДА ТаблицаДокумента.Ссылка.Касса
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьСтатьиДДС
	|				ИЛИ ТаблицаДокумента.СтатьяДДС = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Ссылка.Статья
	|		ИНАЧЕ ТаблицаДокумента.СтатьяДДС
	|	КОНЕЦ,
	|	ТаблицаДокумента.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Поставщику)
	|				И ТаблицаДокумента.Договор.УчитыватьНДФЛ
	|			ТОГДА ТаблицаДокумента.ВидУдержанияНДФЛ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|	КОНЕЦ,
	//Паганини ПФ_
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчета,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаРегл,
	|	ЕСТЬNULL(ТаблицаДокумента.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0),
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога,
	|	ТаблицаДокумента.ВидУдержанияПФ,
	//_Паганини ПФ
	|	ТаблицаДокумента.Ссылка.Перемещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	ТаблицаДокумента.ВидОперации КАК ВидОперации,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	ТаблицаДокумента.Касса КАК Касса,
	|	ТаблицаДокумента.КассаККМ КАК КассаККМ,
	|	ТаблицаДокумента.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	
	//Малышев 2024-10-28 ONESOFT-3523 ((-- Сумма
	//|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ISNULL(ТабВыплатаЗаработнойПлаты.СуммаРасчетов,0)<>0 
	|				ТОГДА ISNULL(ТабВыплатаЗаработнойПлаты.СуммаРасчетов,0)
	|			ИНАЧЕ //остальные типовые варианты
	|				ТаблицаДокумента.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)
	|       КОНЕЦ
	|    КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	 ISNULL(ТабВыплатаЗаработнойПлаты.СуммаРасчетов,0) как СуммаРасчетов,
	//Малышев 2024-10-28 ONESOFT-3523 --) Сумма
	
	|	ТаблицаДокумента.СуммаДокумента КАК СуммаВал,
	
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА &ВалютаДоговораОбслуживания <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|					И &ВалютаДоговораОбслуживания = ТаблицаДокумента.ВалютаДенежныхСредств
	|				ТОГДА ТаблицаДокумента.СуммаДокумента
	|			КОГДА &ВалютаДоговораОбслуживания <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|					И &ВалютаДоговораОбслуживания <> ТаблицаДокумента.ВалютаДенежныхСредств
	|				ТОГДА ТаблицаДокумента.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность * КурсыВалютДоговорОбслуживания.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность * КурсыВалютДоговорОбслуживания.Курс)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаПоДоговоруОбслуживания,
	|	ТаблицаДокумента.Касса.СчетУчета КАК КассаСчетУчета,
	|	ТаблицаДокумента.КассаККМ.СчетУчета КАК КассаККМСчетУчета,
	|	ТаблицаДокумента.Касса.СчетУчетаРегл КАК КассаСчетУчетаРегл,
	|	ТаблицаДокумента.КассаККМ.СчетУчетаРегл КАК КассаККМСчетУчетаРегл,
	|	ТаблицаДокумента.ВидНалога КАК ВидНалога,
	|	ТаблицаДокумента.ВидНалога.СчетУчета КАК ВидНалогаСчетУчета,
	|	ТаблицаДокумента.ВидНалога.СчетУчетаРегл КАК ВидНалогаСчетУчетаРегл,
	|	ТаблицаДокумента.ВидНалога.СчетУчетаКВозмещениюРегл КАК ВидНалогаСчетУчетаКВозмещениюРегл,
	|	ТаблицаДокумента.Подразделение КАК Подразделение,
	|	ТаблицаДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж КАК НаправлениеДеятельностиСчетУчетаВыручкиОтПродаж,
	|	ТаблицаДокумента.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиСчетУчетаСебестоимостиПродаж,
	|	ТаблицаДокумента.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл КАК НаправлениеДеятельностиСчетУчетаВыручкиОтПродажРегл,
	|	ТаблицаДокумента.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиСчетУчетаСебестоимостиПродажРегл,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ТаблицаДокумента.Корреспонденция КАК Корреспонденция,
	|	ТаблицаДокумента.КорреспонденцияРегл КАК КорреспонденцияРегл,
	//+++ Дмгг
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ТаблицаДокумента.КорреспонденцияРегл.ТипСчета
	|		ИНАЧЕ ТаблицаДокумента.Корреспонденция.ТипСчета 
	|	КОНЕЦ КАК КорреспонденцияТипСчета,
	//--- Дмгг
	|	ТаблицаДокумента.Подотчетник КАК Подотчетник,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПерсоналом КАК ПодотчетникСчетРасчетовСперсоналом,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПерсоналомРегл КАК ПодотчетникСчетРасчетовСперсоналомРегл,
	|	ТаблицаДокумента.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетниками КАК ПодотчетникСчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетникамиРегл КАК ПодотчетникСчетРасчетовСПодотчетникамиРегл,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.ДокументОснование КАК ДокументОснование,
	|	ТаблицаДокумента.АналитикаПрочихДоходовИРасходов КАК АналитикаДоходовИРасходов,
	|	ТаблицаДокумента.СчетОрганизации,
	|	ТаблицаДокумента.СчетОрганизации.СчетУчетаРегл КАК БанковскийСчетУчетаРегл,
	|	ТаблицаДокумента.Статья КАК Статья1,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчетПрочихРасчетов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СрокУплаты = &ПустаяДата
	|			ТОГДА ТаблицаСрокУплаты.СрокУплаты
	|		ИНАЧЕ ТаблицаДокумента.СрокУплаты
	|	КОНЕЦ КАК СрокУплаты,
	|	ТаблицаДокумента.Контрагент,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Подотчетнику)
	|			ТОГДА ТаблицаДокумента.Подотчетник
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Прочее)
	|				ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.НаРасходы)
	|			ТОГДА ТаблицаДокумента.Корреспонденция
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты)
	|			ТОГДА ТаблицаДокумента.Контрагент
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам)
	|			ТОГДА ТаблицаДокумента.Контрагент
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаЗаймаСотруднику)
	|			ТОГДА ТаблицаДокумента.Подотчетник
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ)
	|			ТОГДА ТаблицаДокумента.КассаККМ
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Налоги)
	|			ТОГДА ТаблицаДокумента.ВидНалога
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику)
	|			ТОГДА ТаблицаДокумента.Подотчетник
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|			ТОГДА ТаблицаДокумента.Ссылка.СчетОрганизации
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк)
	|			ТОГДА ТаблицаДокумента.Ссылка.Касса
	|		ИНАЧЕ ТаблицаДокумента.Контрагент
	|	КОНЕЦ КАК АналитикаДДС,
	//Паганини ПФ_
	//|	ТаблицаДокумента.ТипНДФЛ,
	|	ЕСТЬNULL(ТаблицаДокумента.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0) КАК СтавкаНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияПФ,
	|	ТаблицаДокумента.СуммаПФ КАК СуммаПФВал,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПФ * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаПФ,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФСотрудника,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФОрганизации,
	|	ТаблицаДокумента.ВидУдержанияПФ.Договор КАК Договор,
	//+++ Дмгг
	//|	ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником КАК Проект,
	//--- Дмгг
	//_Lazare
	|   ВЫБОР
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка) //Малышев 2025-01-28 ONESOFT-3797
	|		КОГДА ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.ПроектДляЗачетаАвансаСПомощником
	|	КОНЕЦ КАК Проект,
	//Lazare_
	|	ТаблицаДокумента.ВидУдержанияПФ.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат КАК ВидНалогаНДФЛКОплате,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога КАК ВидНалогаНДФЛНачислении,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчета КАК НДФЛсНачисленийСчетУчета,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК НДФЛсНачисленийСчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчета КАК НДФЛсВыплатСчетУчета,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаРегл КАК НДФЛсВыплатСчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРегл,
	//_Паганини ПФ	
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДФЛ * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДФЛ,
	|	ТаблицаДокумента.СуммаНДФЛ КАК СуммаНДФЛВал,
	|	ТаблицаДокумента.Перемещение КАК ЭтоПеремещение
	|,	ТаблицаДокумента.СуммаЛьгот КАК СуммаЛьгот //+++ Дмгг
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.РасходИзКассы КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСрокУплаты КАК ТаблицаСрокУплаты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютДоговорОбслуживания
	|		ПО (КурсыВалютДоговорОбслуживания.Валюта = &ВалютаДоговораОбслуживания)
	//Малышев 2024-10-24 
	|		ЛЕВОЕ СОЕДИНЕНИЕ (выбрать 
	|			СУММА(ВЫБОР 
	|					КОГДА ПодзапросЗарплата.Ведомость.ВалютаРасчетов=&ВалютаУчета 
	|						ТОГДА ПодзапросЗарплата.Ведомость.СуммаРасчетов
	|					КОГДА ПодзапросЗарплата.Ведомость.ВалютаДокумента=&ВалютаУчета 
	|						ТОГДА ПодзапросЗарплата.Ведомость.СуммаДокумента
	|                   ИНАЧЕ 0
	|	              КОНЕЦ) как СуммаРасчетов,
	|			ПодзапросЗарплата.Ссылка как Ссылка
	|			ИЗ 
	|				Документ.РасходИзКассы.ВыплатаЗаработнойПлаты как ПодзапросЗарплата
	|			ГДЕ 
	|				ПодзапросЗарплата.Ссылка = &Ссылка  
	|			СГРУППИРОВАТЬ ПО 
	|				ПодзапросЗарплата.Ссылка 
	
	|		) как ТабВыплатаЗаработнойПлаты
	|		ПО ТаблицаДокумента.Ссылка = ТабВыплатаЗаработнойПлаты.Ссылка
	//Малышев 2024-10-24 
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходИзКассы.Дата КАК Период,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА РасходИзКассы.ДокументОснование.Дата ЕСТЬ NULL
	|			ТОГДА &ПериодРегистрацииНДФЛ
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(РасходИзКассы.ДокументОснование.Дата, МЕСЯЦ)
	|	КОНЕЦ КАК ПериодРегистрации,
	|	РасходИзКассы.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТРасчетыСНДФЛ
	|ИЗ
	|	ВременнаяТаблицаШапка КАК РасходИзКассы
	|ГДЕ
	|	РасходИзКассы.Сумма <> 0
	|	И РасходИзКассы.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.НДФЛСотрудники)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходДенежныхСредствИзКассы.Дата КАК Период,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ИСТИНА КАК ЭтоСтраховыеВзносы,
	|	ВЫБОР
	|		КОГДА РасходДенежныхСредствИзКассы.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ПФРНакопительнаяСотрудники)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРНакопительная)
	|		КОГДА РасходДенежныхСредствИзКассы.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ПФРСтраховаяСотрудники)
	|			ТОГДА ВЫБОР
	|					КОГДА &ОбъединятьНакопительнуюИСтраховуюЧасть
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРПоСуммарномуТарифу)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРСтраховая)
	|				КОНЕЦ
	|		КОГДА РасходДенежныхСредствИзКассы.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ФОМССотрудники)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФФОМС)
	|		КОГДА РасходДенежныхСредствИзКассы.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ФСССотрудники)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФСС)
	|		КОГДА РасходДенежныхСредствИзКассы.ВидНалога = ЗНАЧЕНИЕ(Справочник.ВидыНалогов.ФССТравматизмСотрудники)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)
	|	КОНЕЦ КАК ВидОбязательногоСтрахованияСотрудников,
	|	РасходДенежныхСредствИзКассы.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТРасчетыСФондамиПоСтраховымВзносам
	|ИЗ
	|	ВременнаяТаблицаШапка КАК РасходДенежныхСредствИзКассы
	|ГДЕ
	|	РасходДенежныхСредствИзКассы.Сумма <> 0
	|	И РасходДенежныхСредствИзКассы.ВидНалога В(&СтраховыеВидыВзаиморасчетов)";
	
	Запрос.Выполнить();
	
	// Формирование таблиц движений по разделам учета.
	СформироватьТаблицаДенежныеСредства(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДенежныеСредстваВКассахККМ(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	// Прочие расчеты
	СформироватьТаблицаРасчетыСПрочимиКонтрагентами(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоКредитамИЗаймам(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	// Конец Прочие расчеты
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	//Паганини_
	Если ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Зарплата ИЛИ ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику Тогда 
		СформироватьТаблицаУправленческий_РС(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_РасходИзКассы_Зарплата(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыСПенсионнымФондом_РасходСоСчета_РасходИзКассы_Зарплата(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);//Паганини ПФ
	Иначе 
		//_Паганини
		СформироватьТаблицаУправленческий(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_РасходИзКассы(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыСПенсионнымФондом_РасходСоСчета_РасходИзКассы(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);//Паганини ПФ
	КонецЕсли;//Паганини
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаДекларация_РасходИзКассы(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);//ПаганиниПФ
	
	//Паганини#Удержания_
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыПоУдержаниям_РасходСоСчета(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	//_Паганини#Удержания
	СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПлатежныйКалендарь(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьНДФЛРасчетыНалоговыхАгентовСБюджетом(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьРасчетыСФондамиПоСтраховымВзносам(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	// Биллинг
	СформироватьТаблицаВыполнениеДоговораОбслуживания(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗакупкиПоставщиковДляКУДиР(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьТаблицаНалоговыеЛготы(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОстаткиНалоговыхЛьгот(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаРасходИзКассы, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если НЕ Константы.КонтролироватьОстаткиПриПроведении.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
		Возврат;
	КонецЕсли;
	// Конец МобильноеПриложение
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы содержат записи, необходимо выполнить контроль
	// отрицательных остатков.
	Если СтруктураВременныеТаблицы.ДвиженияДенежныеСредстваИзменение
	 ИЛИ СтруктураВременныеТаблицы.ДвиженияРасчетыСПодотчетникамиИзменение
	 ИЛИ СтруктураВременныеТаблицы.ДвиженияРасчетыСПоставщикамиИзменение
	 ИЛИ СтруктураВременныеТаблицы.ДвиженияДенежныеСредстваВКассахККМИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияДенежныеСредстваИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияДенежныеСредстваИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияДенежныеСредстваИзменение.БанковскийСчетКасса КАК БанковскийСчетКассаПредставление,
		|	ДвиженияДенежныеСредстваИзменение.Валюта КАК ВалютаПредставление,
		|	ДвиженияДенежныеСредстваИзменение.ТипДенежныхСредств КАК ТипДенежныхСредствПредставление,
		|	ДвиженияДенежныеСредстваИзменение.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ДвиженияДенежныеСредстваИзменение.СуммаВалИзменение + ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) КАК ОстатокДенежныхСредств,
		|	ДвиженияДенежныеСредстваИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияДенежныеСредстваИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияДенежныеСредстваИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияДенежныеСредстваИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияДенежныеСредстваИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияДенежныеСредстваИзменение.СуммаВалИзменение КАК СуммаВалИзменение
		|ИЗ
		|	ДвиженияДенежныеСредстваИзменение КАК ДвиженияДенежныеСредстваИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства.Остатки(&МоментКонтроля, ) КАК ДенежныеСредстваОстатки
		|		ПО ДвиженияДенежныеСредстваИзменение.Организация = ДенежныеСредстваОстатки.Организация
		|			И ДвиженияДенежныеСредстваИзменение.ТипДенежныхСредств = ДенежныеСредстваОстатки.ТипДенежныхСредств
		|			И ДвиженияДенежныеСредстваИзменение.БанковскийСчетКасса = ДенежныеСредстваОстатки.БанковскийСчетКасса
		|			И ДвиженияДенежныеСредстваИзменение.Валюта = ДенежныеСредстваОстатки.Валюта
		|ГДЕ
		|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияРасчетыСПодотчетникамиИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.Сотрудник КАК СотрудникПредставление,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.Валюта КАК ВалютаПредставление,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.Документ КАК ДокументПредставление,
		|	ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаВалОстаток, 0) КАК ОстатокУПодотчетногоЛица,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияРасчетыСПодотчетникамиИзменение.СуммаВалИзменение КАК СуммаВалИзменение
		|ИЗ
		|	ДвиженияРасчетыСПодотчетникамиИзменение КАК ДвиженияРасчетыСПодотчетникамиИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПодотчетниками.Остатки(&МоментКонтроля, ) КАК РасчетыСПодотчетникамиОстатки
		|		ПО ДвиженияРасчетыСПодотчетникамиИзменение.Организация = РасчетыСПодотчетникамиОстатки.Организация
		|			И ДвиженияРасчетыСПодотчетникамиИзменение.Сотрудник = РасчетыСПодотчетникамиОстатки.Сотрудник
		|			И ДвиженияРасчетыСПодотчетникамиИзменение.Валюта = РасчетыСПодотчетникамиОстатки.Валюта
		|			И ДвиженияРасчетыСПодотчетникамиИзменение.Документ = РасчетыСПодотчетникамиОстатки.Документ
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(РасчетыСПодотчетникамиОстатки.Документ) = ТИП(Документ.АвансовыйОтчет)
		|				И ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаВалОстаток, 0) > 0
		|			ИЛИ ТИПЗНАЧЕНИЯ(РасчетыСПодотчетникамиОстатки.Документ) <> ТИП(Документ.АвансовыйОтчет)
		|				И ЕСТЬNULL(РасчетыСПодотчетникамиОстатки.СуммаВалОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияРасчетыСПоставщикамиИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Контрагент КАК КонтрагентПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Договор КАК ДоговорПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Договор.ВалютаРасчетов КАК ВалютаПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Документ КАК ДокументПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Заказ КАК ЗаказПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов КАК ТипРасчетовПредставление,
		|	ИСТИНА КАК ДвиженияДенежныхДокументов,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаОстаткаЗадолженности,
		|	-(ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0)) КАК СуммаНепогашенныхАвансов,
		|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов КАК ТипРасчетов
		|ИЗ
		|	ДвиженияРасчетыСПоставщикамиИзменение КАК ДвиженияРасчетыСПоставщикамиИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Остатки(&МоментКонтроля, ) КАК РасчетыСПоставщикамиОстатки
		|		ПО ДвиженияРасчетыСПоставщикамиИзменение.Организация = РасчетыСПоставщикамиОстатки.Организация
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Контрагент = РасчетыСПоставщикамиОстатки.Контрагент
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Договор = РасчетыСПоставщикамиОстатки.Договор
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Документ = РасчетыСПоставщикамиОстатки.Документ
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Заказ = РасчетыСПоставщикамиОстатки.Заказ
		|			И ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов = РасчетыСПоставщикамиОстатки.ТипРасчетов
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|				ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) > 0
		|			ИНАЧЕ ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) < 0
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияДенежныеСредстваВКассахККМИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияДенежныеСредстваВКассахККМИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияДенежныеСредстваВКассахККМИзменение.КассаККМ КАК КассаККМПредставление,
		|	ДвиженияДенежныеСредстваВКассахККМИзменение.КассаККМ.ВалютаДенежныхСредств КАК ВалютаПредставление,
		|	ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ДвиженияДенежныеСредстваВКассахККМИзменение.СуммаВалИзменение + ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаВалОстаток, 0) КАК ОстатокДенежныхСредств,
		|	ДвиженияДенежныеСредстваВКассахККМИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияДенежныеСредстваВКассахККМИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияДенежныеСредстваВКассахККМИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияДенежныеСредстваВКассахККМИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияДенежныеСредстваВКассахККМИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияДенежныеСредстваВКассахККМИзменение.СуммаВалИзменение КАК СуммаВалИзменение
		|ИЗ
		|	ДвиженияДенежныеСредстваВКассахККМИзменение КАК ДвиженияДенежныеСредстваВКассахККМИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(&МоментКонтроля, ) КАК ДенежныеСредстваВКассахККМОстатки
		|		ПО ДвиженияДенежныеСредстваВКассахККМИзменение.Организация = ДенежныеСредстваВКассахККМОстатки.Организация
		|			И ДвиженияДенежныеСредстваВКассахККМИзменение.КассаККМ = ДенежныеСредстваВКассахККМОстатки.КассаККМ
		|ГДЕ
		|	ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаВалОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		//+++ Дмгг
		Если (ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Зарплата
			ИЛИ ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику)  
			И СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Таблицы.Найти("ДвиженияОстаткиНалоговыхЛьготИзменение") <> Неопределено Тогда 
			
			Запрос.Текст = Запрос.Текст + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДвиженияОстаткиНалоговыхЛьготИзменение.НомерСтроки КАК НомерСтроки,
			|	ДвиженияОстаткиНалоговыхЛьготИзменение.Организация КАК ОрганизацияПредставление,
			|	ДвиженияОстаткиНалоговыхЛьготИзменение.Сотрудник КАК СотрудникПредставление,
			|	ЕСТЬNULL(ОстаткиНалоговыхЛьготОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
			|	ДвиженияОстаткиНалоговыхЛьготИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
			|	ДвиженияОстаткиНалоговыхЛьготИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
			|	ДвиженияОстаткиНалоговыхЛьготИзменение.СуммаИзменение КАК СуммаИзменение
			|ИЗ
			|	ДвиженияОстаткиНалоговыхЛьготИзменение КАК ДвиженияОстаткиНалоговыхЛьготИзменение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНалоговыхЛьгот.Остатки(&МоментКонтроля, ) КАК ОстаткиНалоговыхЛьготОстатки
			|		ПО ДвиженияОстаткиНалоговыхЛьготИзменение.Организация = ОстаткиНалоговыхЛьготОстатки.Организация
			|			И ДвиженияОстаткиНалоговыхЛьготИзменение.Сотрудник = ОстаткиНалоговыхЛьготОстатки.Сотрудник
			|ГДЕ
			|	ЕСТЬNULL(ОстаткиНалоговыхЛьготОстатки.СуммаОстаток, 0) < 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
		КонецЕсли;
		
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Если НЕ МассивРезультатов[0].Пустой()
			ИЛИ НЕ МассивРезультатов[1].Пустой()
			ИЛИ НЕ МассивРезультатов[2].Пустой()
			ИЛИ НЕ МассивРезультатов[3].Пустой() 
			ИЛИ (МассивРезультатов.Количество() = 5 И НЕ МассивРезультатов[4].Пустой()) Тогда
			ДокументОбъектРасходИзКассы = ДокументСсылкаРасходИзКассы.ПолучитьОбъект()
		КонецЕсли;
		
		// Отрицательный остаток по денежным средствам.
		Если НЕ МассивРезультатов[0].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[0].Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструДенежныеСредства(ДокументОбъектРасходИзКассы, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
		// Отрицательный остаток по расчетам с подотчетными лицами.
		Если НЕ МассивРезультатов[1].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[1].Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПодотчетниками(ДокументОбъектРасходИзКассы, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
		// Отрицательный остаток по расчетам с поставщиками.
		Если НЕ МассивРезультатов[2].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[2].Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПоставщиками(ДокументОбъектРасходИзКассы, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
		// Отрицательный остаток по кассе ККМ.
		Если НЕ МассивРезультатов[3].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[3].Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструДенежныеСредстваВКассахККМ(ДокументОбъектРасходИзКассы, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
		//+++ Дмгг
		// Отрицательный остаток Остатки налоговых льгот.
		Если (ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Зарплата
			ИЛИ ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику)  
			И СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Таблицы.Найти("ДвиженияОстаткиНалоговыхЛьготИзменение") <> Неопределено Тогда
			
			Если НЕ МассивРезультатов[4].Пустой() Тогда
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[4].Выбрать();
				//Если НЕ ПроверятьИтогиРегистров Тогда 
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструОстаткиНалоговыхЛьгот(ДокументОбъектРасходИзКассы, ВыборкаИзРезультатаЗапроса, Отказ);
				//Иначе 
				//	УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструОстаткиНалоговыхЛьгот(ДокументСсылкаРасходСоСчета, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
				//КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//--- Дмгг
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтроль()

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

Процедура СформироватьРКО(ОписаниеПечатнойФормы, МассивОбъектов, ОбъектыПечати)
	Перем ПервыйДокумент, НомерСтрокиНачало, Ошибки;
	
	ТабличныйДокумент = ОписаниеПечатнойФормы.ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ОписаниеПечатнойФормы.ПолныйПутьКМакету);
	ДанныеПечати = Новый Структура;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало, ДанныеПечати);
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		
		Если ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Поставщику Тогда
			СтрокаДебетСубСчет = "РасходИзКассы.Контрагент.СчетУчетаРасчетовСПоставщикомРегл.Код КАК ДебетСубСчет,
								  |РасходИзКассы.Контрагент.СчетУчетаАвансовПоставщикуРегл.Код КАК ДебетСубСчетАвансов";
		ИначеЕсли ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Подотчетнику Тогда
			СтрокаДебетСубСчет = "РасходИзКассы.Подотчетник.СчетРасчетовСПодотчетникамиРегл.Код КАК ДебетСубСчет,
								  |НЕОПРЕДЕЛЕНО КАК ДебетСубСчетАвансовРегл";
		ИначеЕсли ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Налоги Тогда
			СтрокаДебетСубСчет = "РасходИзКассы.ВидНалога.СчетУчетаРегл.Код КАК ДебетСубСчет,
								  |НЕОПРЕДЕЛЕНО КАК ДебетСубСчетАвансов";
		ИначеЕсли ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Покупателю Тогда
			СтрокаДебетСубСчет = "РасходИзКассы.Контрагент.СчетУчетаРасчетовСПокупателемРегл.Код КАК ДебетСубСчет,
								  |РасходИзКассы.Контрагент.СчетУчетаАвансовПокупателяРегл.Код КАК ДебетСубСчетАвансов";
		ИначеЕсли ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Прочее ИЛИ
			ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.НаРасходы Тогда
			СтрокаДебетСубСчет = "РасходИзКассы.КорреспонденцияРегл.Код КАК ДебетСубСчет,
								  |НЕОПРЕДЕЛЕНО КАК ДебетСубСчетАвансов";
		ИначеЕсли ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ПрочиеРасчеты Тогда
			СтрокаДебетСубСчет = "РасходИзКассы.КорреспонденцияРегл.Код КАК ДебетСубСчет,
								  |НЕОПРЕДЕЛЕНО КАК ДебетСубСчетАвансов";
		ИначеЕсли ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.РасчетыПоКредитам Тогда
			СтрокаДебетСубСчет = "РасходИзКассы.КорреспонденцияРегл.Код КАК ДебетСубСчет,
								  |НЕОПРЕДЕЛЕНО КАК ДебетСубСчетАвансов";
		ИначеЕсли ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ВыдачаЗаймаСотруднику Тогда
			СтрокаДебетСубСчет = "РасходИзКассы.КорреспонденцияРегл.Код КАК ДебетСубСчет,
								  |НЕОПРЕДЕЛЕНО КАК ДебетСубСчетАвансов";
		ИначеЕсли ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ВыдачаКредитаКонтрагенту Тогда
			СтрокаДебетСубСчет = "РасходИзКассы.КорреспонденцияРегл.Код КАК ДебетСубСчет,
								  |НЕОПРЕДЕЛЕНО КАК ДебетСубСчетАвансов";
		ИначеЕсли ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ Тогда
			СтрокаДебетСубСчет = "РасходИзКассы.КассаККМ.СчетУчетаРегл.Код КАК ДебетСубСчет,
								  |НЕОПРЕДЕЛЕНО КАК ДебетСубСчетАвансов";
		ИначеЕсли ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику Тогда
			СтрокаДебетСубСчет = "РасходИзКассы.Подотчетник.СчетРасчетовСПерсоналомРегл.Код КАК ДебетСубСчет,
								  |НЕОПРЕДЕЛЕНО КАК ДебетСубСчетАвансов";
		//--------------------------------------------------------------------------
		// © Шишка В.В. [10 августа 2022]  НАЧАЛО
		ИначеЕсли ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк Тогда 	
			
			СтрокаДебетСубСчет = "РасходИзКассы.КорреспонденцияРегл.Код КАК ДебетСубСчет,
								  |НЕОПРЕДЕЛЕНО КАК ДебетСубСчетАвансов";
		// © Шишка В.В. [10 августа 2022]  КОНЕЦ
		//--------------------------------------------------------------------------
		ИначеЕсли ТекущийДокумент.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Зарплата Тогда
			
			ЗапросСчетСотрудника = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПлатежнаяВедомостьСотрудники.Сотрудник.СчетРасчетовСПерсоналомРегл.Код КАК ДебетСубСчет
			|ИЗ
			|	Документ.РасходИзКассы.ВыплатаЗаработнойПлаты КАК РасходИзКассыВыплатаЗаработнойПлаты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
			|		ПО РасходИзКассыВыплатаЗаработнойПлаты.Ведомость = ПлатежнаяВедомостьСотрудники.Ссылка
			|ГДЕ
			|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка = &Ссылка");
			ЗапросСчетСотрудника.УстановитьПараметр("Ссылка", ТекущийДокумент);
			РезультатЗапроса = ЗапросСчетСотрудника.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				СтрокаДебетСубСчет = "НЕОПРЕДЕЛЕНО КАК ДебетСубСчет,
									  |НЕОПРЕДЕЛЕНО КАК ДебетСубСчетАвансов";
			Иначе
				СтрокаДебетСубСчет = Лев(РезультатЗапроса.Выгрузить()[0].ДебетСубСчет, 4)
									+ " КАК ДебетСубСчет,
									  |НЕОПРЕДЕЛЕНО КАК ДебетСубСчетАвансов";
			КонецЕсли; 
			
		Иначе
			СтрокаДебетСубСчет = "НЕОПРЕДЕЛЕНО КАК ДебетСубСчет,
								 |НЕОПРЕДЕЛЕНО КАК ДебетСубСчетАвансов";
		КонецЕсли;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходИзКассы.Номер КАК Номер,
		|	РасходИзКассы.Дата КАК ДатаДокумента,
		//--------------------------------------------------------------------------
		// © Шишка В.В. [9 августа 2022]  НАЧАЛО
		|	РасходИзКассы.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		// © Шишка В.В. [9 августа 2022]  КОНЕЦ
		//--------------------------------------------------------------------------
		|	РасходИзКассы.Организация КАК Организация,
		|	РасходИзКассы.Организация.ЮридическоеФизическоеЛицо КАК ЮрФизЛицо,
		|	РасходИзКассы.Организация.Префикс КАК Префикс,
		|	РасходИзКассы.Организация.КодПоОКПО КАК ОрганизацияПоОКПО,
		|	РасходИзКассы.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
		|	РасходИзКассы.Выдать КАК Выдать1,
		|	РасходИзКассы.Основание КАК Основание,
		|	РасходИзКассы.Приложение КАК Приложение,
		|	РасходИзКассы.Контрагент КАК Выдать,
		|	РасходИзКассы.СуммаДокумента КАК СуммаДокумента,
		|	РасходИзКассы.ПоДокументу КАК РеквизитыДокументаУдостоверяющегоЛичность,
		|	РасходИзКассы.Касса.СчетУчетаРегл.Код КАК КредитСубСчет,
		|	РасходИзКассы.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
		|	РасходИзКассы.ПодписьРуководителя.Должность КАК ДолжностьРуководителя,
		|	РасходИзКассы.ПодписьРуководителя.РасшифровкаПодписи КАК РасшифровкаПодписиРуководителя,
		|	РасходИзКассы.ПодписьГлавногоБухгалтера.Должность КАК ДолжностьГлавногоБухгалтера,
		|	РасходИзКассы.ПодписьГлавногоБухгалтера.РасшифровкаПодписи КАК РасшифровкаПодписиГлавногоБухгалтера,
		|	РасходИзКассы.ПодписьКассира.Должность КАК ДолжностьКассира,
		|	РасходИзКассы.ПодписьКассира.РасшифровкаПодписи КАК РасшифровкаПодписиКассира,
		|	ПРЕДСТАВЛЕНИЕ(РасходИзКассы.ВалютаДенежныхСредств) КАК ВалютаПредставление,
		|	" + СтрокаДебетСубСчет + "
		|ИЗ
		|	Документ.РасходИзКассы КАК РасходИзКассы
		|ГДЕ
		|	РасходИзКассы.Ссылка = &ТекущийДокумент";
		
		ВыборкаДляПечати = Запрос.Выполнить().Выбрать();
		ВыборкаДляПечати.Следующий();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		ДанныеПечати.Вставить("Сумма", УправлениеНебольшойФирмойСервер.ФорматироватьСуммуПлатежногоДокумента(ВыборкаДляПечати.СуммаДокумента, Ложь));
		ДанныеПечати.Вставить("НомерДокумента", ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ВыборкаДляПечати.ДатаДокумента, ВыборкаДляПечати.Номер, ВыборкаДляПечати.Префикс));
		ДанныеПечати.Вставить("СуммаПрописью", УправлениеНебольшойФирмойСервер.ФорматироватьСуммуПрописьюПлатежногоДокумента(ВыборкаДляПечати.СуммаДокумента, ВыборкаДляПечати.ВалютаДенежныхСредств, Ложь));
		
		ОбластьМакета.Параметры.Заполнить(ВыборкаДляПечати);
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		
		Если ЗначениеЗаполнено(ТекущийДокумент.Выдать) = Истина Тогда 
			 ОбластьМакета.Параметры.Выдать = ТекущийДокумент.Выдать;
		Иначе 	 
			 ОбластьМакета.Параметры.Выдать = ТекущийДокумент.Контрагент;
		КонецЕсли;

		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьРКО_ЛОК(ОписаниеПечатнойФормы, МассивОбъектов, ОбъектыПечати)
	Перем ПервыйДокумент, НомерСтрокиНачало, Ошибки;
	
	ТабличныйДокумент = ОписаниеПечатнойФормы.ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ОписаниеПечатнойФормы.ПолныйПутьКМакету);
	ДанныеПечати = Новый Структура;
	
	ПервыйДокумент = Истина;
	
	Для Каждого ОбъектаИзМассива Из МассивОбъектов Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Поставщику Тогда
			СтрокаДебетСубСчет = ОбъектаИзМассива.Контрагент.СчетУчетаРасчетовСПоставщиком.Код;	
		ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Подотчетнику Тогда
			СтрокаДебетСубСчет = ОбъектаИзМассива.Подотчетник.СчетРасчетовСПодотчетниками.Код;
			ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику Тогда
				СтрокаДебетСубСчет = ОбъектаИзМассива.Подотчетник.СчетРасчетовСПерсоналом.Код;
			ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Налоги Тогда
				СтрокаДебетСубСчет = ОбъектаИзМассива.ВидНалога.СчетУчета.Код;
			ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Покупателю Тогда
				СтрокаДебетСубСчет = ОбъектаИзМассива.Контрагент.СчетУчетаРасчетовСПокупателем.Код;
			ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Прочее Тогда
				СтрокаДебетСубСчет = ОбъектаИзМассива.Корреспонденция.Код;
			ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ Тогда
				СтрокаДебетСубСчет = ОбъектаИзМассива.КассаККМ.СчетУчета.Код;
			ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Зарплата Тогда
				ЗапросСчетСотрудника = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ПлатежнаяВедомостьСотрудники.Сотрудник.СчетРасчетовСПерсоналом.Код КАК ДебетСубСчет
				|ИЗ
				|	Документ.РасходИзКассы.ВыплатаЗаработнойПлаты КАК РасходИзКассыВыплатаЗаработнойПлаты
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
				|		ПО РасходИзКассыВыплатаЗаработнойПлаты.Ведомость = ПлатежнаяВедомостьСотрудники.Ссылка
				|ГДЕ
				|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка = &Ссылка");
				ЗапросСчетСотрудника.УстановитьПараметр("Ссылка", ОбъектаИзМассива);
				РезультатЗапроса = ЗапросСчетСотрудника.Выполнить();
				Если РезультатЗапроса.Пустой() Тогда
					СтрокаДебетСубСчет = "";
				Иначе
					СтрокаДебетСубСчет = Лев(РезультатЗапроса.Выгрузить()[0].ДебетСубСчет, 4);
				КонецЕсли; 
			Иначе
				СтрокаДебетСубСчет = "";
		КонецЕсли;
			
		

		Макет = УправлениеПечатью.МакетПечатнойФормы(ОписаниеПечатнойФормы.ПолныйПутьКМакету);
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Организация 	= ОбъектаИзМассива.Организация;
		Область.Параметры.СтруктурнаяЕдиница= Строка(ОбъектаИзМассива.Подразделение) + " / " + Строка(ОбъектаИзМассива.Касса);
		Область.Параметры.Номер 		= ОбъектаИзМассива.Номер;
		Область.Параметры.Дата	 		= ОбъектаИзМассива.Дата;
		Область.Параметры.Кредит		= ОбъектаИзМассива.Касса.СчетУчетаРегл;
		//--------------------------------------------------------------------------
		// © Шишка В.В. [10 августа 2022]  НАЧАЛО
		//Область.Параметры.Дебет			= ОбъектаИзМассива.Контрагент.СчетУчетаРасчетовСПокупателемРегл.Код;
		Если ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Поставщику Тогда
			СтрокаДебетСубСчет = ОбъектаИзМассива.Контрагент.СчетУчетаРасчетовСПоставщикомРегл.Код;
		ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Подотчетнику Тогда
			СтрокаДебетСубСчет = ОбъектаИзМассива.Подотчетник.СчетРасчетовСПодотчетникамиРегл.Код;
		ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Налоги Тогда
			СтрокаДебетСубСчет = ОбъектаИзМассива.ВидНалога.СчетУчетаРегл.Код;
		ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Покупателю Тогда
			СтрокаДебетСубСчет = ОбъектаИзМассива.Контрагент.СчетУчетаРасчетовСПокупателемРегл.Код;
		ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Прочее ИЛИ
			ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.НаРасходы Тогда
			СтрокаДебетСубСчет = ОбъектаИзМассива.КорреспонденцияРегл.Код;
		ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ПрочиеРасчеты Тогда
			СтрокаДебетСубСчет = ОбъектаИзМассива.КорреспонденцияРегл.Код;
		ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.РасчетыПоКредитам Тогда
			СтрокаДебетСубСчет = ОбъектаИзМассива.КорреспонденцияРегл.Код;
		ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ВыдачаЗаймаСотруднику Тогда
			СтрокаДебетСубСчет = ОбъектаИзМассива.КорреспонденцияРегл.Код;
		ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ВыдачаКредитаКонтрагенту Тогда
			СтрокаДебетСубСчет = ОбъектаИзМассива.КорреспонденцияРегл.Код;
		ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ Тогда
			СтрокаДебетСубСчет = ОбъектаИзМассива.КассаККМ.СчетУчетаРегл.Код;
		ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику Тогда
			СтрокаДебетСубСчет = ОбъектаИзМассива.Подотчетник.СчетРасчетовСПерсоналомРегл.Код;
		ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк Тогда 	
			
			СтрокаДебетСубСчет = ОбъектаИзМассива.КорреспонденцияРегл.Код;
			
		ИначеЕсли ОбъектаИзМассива.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Зарплата Тогда
			
			ЗапросСчетСотрудника = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПлатежнаяВедомостьСотрудники.Сотрудник.СчетРасчетовСПерсоналомРегл.Код КАК ДебетСубСчет
			|ИЗ
			|	Документ.РасходИзКассы.ВыплатаЗаработнойПлаты КАК РасходИзКассыВыплатаЗаработнойПлаты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
			|		ПО РасходИзКассыВыплатаЗаработнойПлаты.Ведомость = ПлатежнаяВедомостьСотрудники.Ссылка
			|ГДЕ
			|	РасходИзКассыВыплатаЗаработнойПлаты.Ссылка = &Ссылка");
			ЗапросСчетСотрудника.УстановитьПараметр("Ссылка", ОбъектаИзМассива.Ссылка);
			РезультатЗапроса = ЗапросСчетСотрудника.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				СтрокаДебетСубСчет = "";
			Иначе
				СтрокаДебетСубСчет = Лев(РезультатЗапроса.Выгрузить()[0].ДебетСубСчет, 4);
			КонецЕсли; 
			
		Иначе
			СтрокаДебетСубСчет = "";
		КонецЕсли;
		
		Область.Параметры.Дебет			= СтрокаДебетСубСчет;
		// © Шишка В.В. [10 августа 2022]  КОНЕЦ
		//--------------------------------------------------------------------------
		Область.Параметры.Цена			= ОбъектаИзМассива.СуммаДокумента;	
		//Область.Параметры.Выдать		= ОбъектаИзМассива.Выдать;
		
		
		//Rajak
		//Строка(ОбъектаИзМассива.Контрагент) +  "(" + Строка(ОбъектаИзМассива.Контрагент.ИНН)  +")";
		
		Если ЗначениеЗаполнено(ОбъектаИзМассива.Выдать) Тогда 
			 Область.Параметры.Выдать = ОбъектаИзМассива.Выдать;
		Иначе 	 
			 Область.Параметры.Выдать = ОбъектаИзМассива.Контрагент;
		КонецЕсли;
			   //Rajak
		Если ЗначениеЗаполнено(ОбъектаИзМассива.Подотчетник) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ДокументыФизическихЛиц.Период,
			               |	ДокументыФизическихЛиц.Физлицо КАК Физлицо1,
			               |	ДокументыФизическихЛиц.ВидДокумента,
			               |	ДокументыФизическихЛиц.Серия,
			               |	ДокументыФизическихЛиц.Номер,
			               |	ДокументыФизическихЛиц.ДатаВыдачи,
			               |	ДокументыФизическихЛиц.СрокДействия,
			               |	ДокументыФизическихЛиц.КемВыдан,
			               |	ДокументыФизическихЛиц.КодПодразделения,
			               |	ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность,
			               |	ДокументыФизическихЛиц.Представление,
			               |	ДокументыФизическихЛиц.УдалитьВидДокумента
			               |ИЗ
			               |	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
			               |ГДЕ
			               |	ДокументыФизическихЛиц.Физлицо = &ФизЛицо";
						   
						   
						   
						  	Если ЗначениеЗаполнено(ОбъектаИзМассива.Подотчетник) Тогда
								
								Лицо = ОбъектаИзМассива.Подотчетник.Физлицо;
																
						  	КонецЕсли;		
						   
			Запрос.УстановитьПараметр("ФизЛицо",Лицо); 
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				
				Область.Параметры.НазваниеДокумента	= Выборка.ВидДокумента;
				Область.Параметры.НомерДокумента	= "" + Выборка.Номер + ", " + Выборка.ДатаВыдачи + ", " + Выборка.КемВыдан;
				
			КонецЕсли;

		КонецЕсли;
		
		Область.Параметры.Основание		= ОбъектаИзМассива.Основание;
		Область.Параметры.Лари			= Цел(ОбъектаИзМассива.СуммаДокумента);
		Область.Параметры.Тетри			= ОКР(100 * (ОбъектаИзМассива.СуммаДокумента - Цел(ОбъектаИзМассива.СуммаДокумента)), 0, 1);
		Область.Параметры.ЦенаСловами   = ЛарТетр(ОбъектаИзМассива.СуммаДокумента);
		Область.Параметры.Приложение    = ОбъектаИзМассива.Приложение;
		//--------------------------------------------------------------------------
		// © Шишка В.В. [10 августа 2022]  НАЧАЛО
		Если ТипЗнч(ОбъектаИзМассива) = Тип("ДокументСсылка.РасходИзКассы") Тогда
		
			Область.Параметры.НомерВходящегоДокумента = ОбъектаИзМассива.НомерВходящегоДокумента;	
		
		КонецЕсли;
		// © Шишка В.В. [10 августа 2022]  КОНЕЦ
		//--------------------------------------------------------------------------
		
		Область.Параметры.Должность = ОбъектаИзМассива.ПодписьРуководителя.Должность;
		
		ТабличныйДокумент.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ОбъектаИзМассива.Ссылка);
	
	КонецЦикла;
	
КонецПроцедуры

Функция ЛарТетр(Сумма)
	
	Лари 	= Цел(Сумма);
	Тетри   = ОКР(100 * (Сумма - Лари), 0, 1);
	СуммаЛарТетр = "" + Лари + " ლარი. " + Цел(Тетри/10) + (Тетри - 10 * Цел(Тетри / 10)) + " თეთრი";
	
	СуммаЛарТетр = ЧислоПрописью(Сумма,"Л = ka_GE; ДП = Истина","ლარი, თეთრი, 2");  
	Возврат СуммаЛарТетр;      
	
КонецФункции

Функция ДатаДляПечати(Дата)
	сгд = Строка(Год(Дата));
	сгд = СтрЗаменить(сгд,",","");
	сгд = СтрЗаменить(сгд," ","");
	сгд = СтрЗаменить(сгд,".","");
	смс = Строка(Месяц(Дата));
	сдн = Строка(День(Дата));
	Если СтрДлина(смс) = 1 Тогда 
		смс = "0" + смс;	
	КонецЕсли;
	Если СтрДлина(сдн) = 1 Тогда 
		сдн = "0" + сдн;	
	КонецЕсли;
	Возврат сдн+"."+смс+"."+сгд;
КонецФункции


// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ОписаниеПечатнойФормы = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "РКО");
	Если ОписаниеПечатнойФормы <> Неопределено Тогда
		
		ОписаниеПечатнойФормы.ТабличныйДокумент = Новый ТабличныйДокумент;
		ОписаниеПечатнойФормы.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасходИзКассы_РКО";
		ОписаниеПечатнойФормы.ПолныйПутьКМакету = "Документ.РасходИзКассы.ПФ_MXL_РКО";
		ОписаниеПечатнойФормы.СинонимМакета = НСтр("ka='კო-2 (გასავლის სალაროს ორდერი)';ru='КО-2 (Расходный кассовый ордер)';en='CO-2 (Consumables cash order)'");
		
		СформироватьРКО(ОписаниеПечатнойФормы, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	
	ОписаниеПечатнойФормы = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "РКО_ЛОК");
	Если ОписаниеПечатнойФормы <> Неопределено Тогда
		
		ОписаниеПечатнойФормы.ТабличныйДокумент = Новый ТабличныйДокумент;
		ОписаниеПечатнойФормы.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасходИзКассы_РКО_ЛОК";
		ОписаниеПечатнойФормы.ПолныйПутьКМакету = "Документ.РасходИзКассы.ПФ_MXL_РКО_ЛОК";
		ОписаниеПечатнойФормы.СинонимМакета = НСтр("ka='სალაროს გასავლის ორდერი';ru='Расходный кассовый ордер';en='Account cash warrant'");
		
		СформироватьРКО_ЛОК(ОписаниеПечатнойФормы, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РКО";
	КомандаПечати.Представление = НСтр("ka='კო-2 (გასავლის სალაროს ორდერი)';ru='КО-2 (Расходный кассовый ордер)';en='CO-2 (Consumables cash order)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РКО_ЛОК";
	КомандаПечати.Представление = НСтр("ka='სალაროს გასავლის ორდერი';ru='Расходный кассовый ордер';en='Account cash warrant'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 2;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеРасчеты

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПрочимиКонтрагентами(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("УчетРасчетовПоПрочимОперациям", НСтр("ka='სხვა ოპერაციების მიხედვით ანგარიშსწორების აღრიცხვა';ru='Учет расчетов по прочим операциям';en='The account of calculations on other transactions'"));
	Запрос.УстановитьПараметр("Комментарий", НСтр("ka='კონტრაგენტის ვალის გაზრდა';ru='Увеличение долга контрагента';en='The increase in the debt of the counterparty'"));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Документ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|							ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.Документ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|							ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.Документ = НЕОПРЕДЕЛЕНО
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов КАК Валюта,
	|	ВременнаяТаблицаШапка.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Дата,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК Сумма,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВал,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК СуммаДляОстатка,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВалДляОстатка,
	|	&УчетРасчетовПоПрочимОперациям КАК СодержаниеПроводки,
	|	&Комментарий КАК Комментарий,
	|	ВременнаяТаблицаШапка.Корреспонденция КАК СчетУчета,
	|	ВременнаяТаблицаШапка.КорреспонденцияРегл КАК СчетУчетаРегл,
	|	ВременнаяТаблицаШапка.Статья КАК Статья,
	|	ВременнаяТаблицаШапка.Касса КАК Касса,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Период,
	//+++ Дмгг
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	//--- Дмгг
	|ПОМЕСТИТЬ ВременнаяТаблицаПрочиеРасчеты
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ПО (ВременнаяТаблицаШапка.УчетПрочихРасчетов)
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты)
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов,
	|	ВременнаяТаблицаШапка.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Документ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|							ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.Документ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|							ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.Документ = НЕОПРЕДЕЛЕНО
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВременнаяТаблицаШапка.Корреспонденция,
	|	ВременнаяТаблицаШапка.КорреспонденцияРегл,
	|	ВременнаяТаблицаШапка.Статья,
	|	ВременнаяТаблицаШапка.Касса,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с подотчетными лицами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаПрочиеРасчеты.СчетУчета КАК СчетУчета,
	|	ВременнаяТаблицаПрочиеРасчеты.Организация КАК Организация,
	|	ВременнаяТаблицаПрочиеРасчеты.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаПрочиеРасчеты.Договор КАК Договор,
	//+++ Дмгг
	|	ВременнаяТаблицаПрочиеРасчеты.Проект КАК Проект
	//--- Дмгг
	|ИЗ
	|	ВременнаяТаблицаПрочиеРасчеты КАК ВременнаяТаблицаПрочиеРасчеты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПрочимиКонтрагентами");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоПрочимОперациям(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоПрочимОперациямРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПрочимиКонтрагентами", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПрочимиКонтрагентами()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыПоКредитамИЗаймам(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("УчетРасчетовПоЗаймамСотрудникам", НСтр("ka='თანამშრომლისთვის სესხის გაცემა';ru='Выдача займа сотруднику';en='Issuance of the loan officer'"));
	Запрос.УстановитьПараметр("УчетРасчетовПоКредитамКонтрагентам", НСтр("ka='კრედიტი მყიდველს';ru='Выдача кредита покупателю';en='Issuance of the loan to the buyer'"));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходИзКассы);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаДС", ДокументСсылкаРасходИзКассы.ВалютаДенежныхСредств);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику) КАК ВидДоговора,
	|	РасходИзКассы.Дата КАК Дата,
	|	РасходИзКассы.Дата КАК Период,
	|	&УчетРасчетовПоЗаймамСотрудникам КАК СодержаниеПроводки,
	|	РасходИзКассы.Подотчетник КАК Контрагент,
	|	РасходИзКассы.СуммаДокумента КАК СуммаПлатежа,
	|	ВЫРАЗИТЬ(РасходИзКассы.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютДоговора.Кратность / (КурсыВалютДоговора.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК ОсновнойДолгВал,
	|	ВЫРАЗИТЬ(РасходИзКассы.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК ОсновнойДолг,
	|	ВЫРАЗИТЬ(РасходИзКассы.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютДоговора.Кратность / (КурсыВалютДоговора.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК ОсновнойДолгВалДляОстатка,
	|	ВЫРАЗИТЬ(РасходИзКассы.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК ОсновнойДолгДляОстатка,
	|	0 КАК ПроцентыВал,
	|	0 КАК Проценты,
	|	0 КАК ПроцентыВалДляОстатка,
	|	0 КАК ПроцентыДляОстатка,
	|	0 КАК КомиссияВал,
	|	0 КАК Комиссия,
	|	0 КАК КомиссияВалДляОстатка,
	|	0 КАК КомиссияДляОстатка,
	|	ВЫРАЗИТЬ(РасходИзКассы.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютДоговора.Кратность / (КурсыВалютДоговора.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаВал,
	|	ВЫРАЗИТЬ(РасходИзКассы.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг) КАК ТипСуммы,
	|	РасходИзКассы.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
	|	РасходИзКассы.ДоговорКредитаЗайма.ВалютаРасчетов КАК Валюта,
	|	РасходИзКассы.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	РасходИзКассы.ДоговорКредитаЗайма.СчетУчета КАК СчетУчета,
	|	РасходИзКассы.ДоговорКредитаЗайма.СчетУчетаРегл КАК СчетУчетаРегл,
	|	РасходИзКассы.Статья КАК Статья,
	|	РасходИзКассы.Касса,
	|	ЛОЖЬ КАК УдержаноИзЗарплаты,
	//+++ Дмгг
	|	РасходИзКассы.ПроектДляЗачетаАвансаСПомощником КАК Проект
	//--- Дмгг
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыПоКредитамИЗаймам
	|ИЗ
	|	Документ.РасходИзКассы КАК РасходИзКассы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютДоговора
	|		ПО (КурсыВалютДоговора.Валюта = РасходИзКассы.ДоговорКредитаЗайма.ВалютаРасчетов)
	|ГДЕ
	|	РасходИзКассы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаЗаймаСотруднику)
	|	И РасходИзКассы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.КредитВыданный),
	|	РасходИзКассы.Дата КАК Дата,
	|	РасходИзКассы.Дата КАК Период,
	|	&УчетРасчетовПоКредитамКонтрагентам КАК СодержаниеПроводки,
	|	РасходИзКассы.Контрагент КАК Контрагент,
	|	РасходИзКассы.СуммаДокумента КАК СуммаПлатежа,
	|	ВЫРАЗИТЬ(РасходИзКассы.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютДоговора.Кратность / (КурсыВалютДоговора.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК ОсновнойДолгВал,
	|	ВЫРАЗИТЬ(РасходИзКассы.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК ОсновнойДолг,
	|	ВЫРАЗИТЬ(РасходИзКассы.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютДоговора.Кратность / (КурсыВалютДоговора.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК ОсновнойДолгВалДляОстатка,
	|	ВЫРАЗИТЬ(РасходИзКассы.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК ОсновнойДолгДляОстатка,
	|	0 КАК ПроцентыВал,
	|	0 КАК Проценты,
	|	0 КАК ПроцентыВалДляОстатка,
	|	0 КАК ПроцентыДляОстатка,
	|	0 КАК КомиссияВал,
	|	0 КАК Комиссия,
	|	0 КАК КомиссияВалДляОстатка,
	|	0 КАК КомиссияДляОстатка,
	|	ВЫРАЗИТЬ(РасходИзКассы.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютДоговора.Кратность / (КурсыВалютДоговора.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаВал,
	|	ВЫРАЗИТЬ(РасходИзКассы.СуммаДокумента * КурсыВалютКассы.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг),
	|	РасходИзКассы.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
	|	РасходИзКассы.ДоговорКредитаЗайма.ВалютаРасчетов КАК Валюта,
	|	РасходИзКассы.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	РасходИзКассы.ДоговорКредитаЗайма.СчетУчета КАК СчетУчета,
	|	РасходИзКассы.ДоговорКредитаЗайма.СчетУчетаРегл КАК СчетУчетаРегл,
	|	РасходИзКассы.Статья КАК Статья,
	|	РасходИзКассы.Касса,
	|	ЛОЖЬ КАК УдержаноИзЗарплаты,
	|	РасходИзКассы.ПроектДляЗачетаАвансаСПомощником КАК Проект
	|ИЗ
	|	Документ.РасходИзКассы КАК РасходИзКассы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютДоговора
	|		ПО (КурсыВалютДоговора.Валюта = РасходИзКассы.ДоговорКредитаЗайма.ВалютаРасчетов)
	|ГДЕ
	|	РасходИзКассы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ВыдачаКредитаКонтрагенту)
	|	И РасходИзКассы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.КредитПолученный),
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.СодержаниеПоТипуСуммы,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.СуммаПлатежа,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаРасчетов,
	|	ТаблицаДокумента.СуммаУчета,
	|	ТаблицаДокумента.ТипСуммы,
	|	ТаблицаДокумента.ДоговорКредитаЗайма,
	|	ТаблицаДокумента.ДоговорКредитаЗайма.ВалютаРасчетов,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.СчетУчета
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.СчетУчетаПроцентов
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.СчетУчетаКомиссии
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	//+++
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.ОсновнойДолг)
	|			ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.СчетУчетаРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл
	|		КОГДА ТаблицаДокумента.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ТаблицаДокумента.ДоговорКредитаЗайма.СчетУчетаКомиссииРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья,
	//---
	|	ТаблицаДокумента.Касса,
	|	ЛОЖЬ,
	//+++ Дмгг
	|	ТаблицаДокумента.Проект КАК Проект
	//--- Дмгг
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с подотчетными лицами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
	//+++ Дмгг
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам.Проект КАК Проект
	//--- Дмгг
	|ИЗ
	|	ВременнаяТаблицаРасчетыПоКредитамИЗаймам КАК ВременнаяТаблицаРасчетыПоКредитамИЗаймам";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыПоКредитамИЗаймам");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоКредитамИЗаймам(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоКредитамИЗаймамРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоКредитамИЗаймам", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры

Процедура СформироватьТаблицаНалоговыеЛготы(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	Если ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Зарплата ИЛИ
		ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаРасчетыСПерсоналом.ПериодРегистрации КАК Период,
		|	ВременнаяТаблицаРасчетыСПерсоналом.Организация КАК Организация,
		|	ВременнаяТаблицаРасчетыСПерсоналом.Сотрудник КАК Сотрудник,
		|	ВременнаяТаблицаРасчетыСПерсоналом.СтруктурнаяЕдиница КАК Подразделение,
		|	ВременнаяТаблицаРасчетыСПерсоналом.СуммаЛгот КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРасчетыСПерсоналом.ВедомостьВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипЛгот.УдержаниеДляКонтрагента)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипЛгот.Прочее)
		|	КОНЕЦ КАК ТипЛгот
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПерсоналом КАК ВременнаяТаблицаРасчетыСПерсоналом
		|ГДЕ
		|	ВременнаяТаблицаРасчетыСПерсоналом.СуммаЛгот <> 0";
		
		
				
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНалоговыеЛготы", Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьТаблицаОстаткиНалоговыхЛьгот(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	Если ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Зарплата ИЛИ
		ДокументСсылкаРасходИзКассы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаРасчетыСПерсоналом.Дата КАК Период,
		|	ВременнаяТаблицаРасчетыСПерсоналом.Организация КАК Организация,
		|	ВременнаяТаблицаРасчетыСПерсоналом.Сотрудник КАК Сотрудник,
		|	СУММА(ВременнаяТаблицаРасчетыСПерсоналом.СуммаЛгот) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРасчетыСПерсоналом.ВедомостьВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипЛгот.УдержаниеДляКонтрагента)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипЛгот.Прочее)
		|	КОНЕЦ КАК ТипЛгот
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПерсоналом КАК ВременнаяТаблицаРасчетыСПерсоналом
		|ГДЕ
		|	ВременнаяТаблицаРасчетыСПерсоналом.СуммаЛгот <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаРасчетыСПерсоналом.Дата,
		|	ВременнаяТаблицаРасчетыСПерсоналом.Организация,
		|	ВременнаяТаблицаРасчетыСПерсоналом.Сотрудник,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРасчетыСПерсоналом.ВедомостьВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипЛгот.УдержаниеДляКонтрагента)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипЛгот.Прочее)
		|	КОНЕЦ";
		
		
				
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНалоговыхЛьгот", Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли