

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивСчетов") Тогда
		Для Каждого Элем Из Параметры.МассивСчетов Цикл 
			НовСтрок = ТаблицаНастройки.Добавить();
			НовСтрок.БанковскийСчет = Элем;
		КонецЦикла;
	КонецЕсли;	
	                                       
	Если Параметры.Свойство("ИмяТаблицы") Тогда
		ИмяТаблицы = Параметры.ИмяТаблицы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Соответствиесчетов = Новый Соответствие;
	
	Для Каждого Строк Из ТаблицаНастройки Цикл 
		
		Соответствиесчетов.Вставить(Строк.БанковскийСчет, Строк.ИмяПакета);
		
	КонецЦикла;
	
	СтруктураОтвета = Новый Структура("ИмяТаблицы, СоответствиеСчетов", ИмяТаблицы, Соответствиесчетов);
	
	Оповестить("ИнтеграцияTBC_ИменаПакетов", СтруктураОтвета, ЭтаФорма);
	
	Если ЭтаФорма.Открыта() Тогда 
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
