
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	ЗагрузитьНастройкиФормы();
	ОбновитьОтборы();
	//Паганини_
	ФункционалЗапретаРедактированияДокументов = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалЗапретаРедактированияДокументов");
	//_Паганини
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриЗакрытии()

	СохранитьНастройкиФормы(Новый Структура("ОтборКонтрагент, ОтборСтатус", ОтборКонтрагент, ОтборСтатус));
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	ОбновитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	
	ОбновитьОтборы();
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура СохранитьНастройкиФормы(СтруктураНастроек)
	
	ХранилищеНастроекДанныхФорм.Сохранить("ОПТИМУС_СчетФактураПолученныйЛокФормаСписка", "СтруктураНастроек", СтруктураНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиФормы()
	
	СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить("ОПТИМУС_СчетФактураПолученныйЛокФормаСписка", "СтруктураНастроек");
		
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		ОтборКонтрагент = СтруктураНастроек.ОтборКонтрагент;
		ОтборСтатус = СтруктураНастроек.ОтборСтатус;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборы()
	
	РС_ОбщегоНазначения.ИзменитьЭлементОтбораСписка(Список, "Контрагент",	ОтборКонтрагент,	ЗначениеЗаполнено(ОтборКонтрагент));
	РС_ОбщегоНазначения.ИзменитьЭлементОтбораСписка(Список, "Статус", 		ОтборСтатус, 		ЗначениеЗаполнено(ОтборСтатус));
	
КонецПроцедуры










