Функция ПолучитьТаблицуПозицийВременноеХранилище() ЭКСПОРТ
    ПЕРЕМ РЕЗ;
	
	МассивТиповСотрудник = Новый Массив;
	МассивТиповСотрудник.Добавить(Тип("СправочникСсылка.Сотрудники"));
	МассивТиповСотрудник.Добавить(Тип("СправочникСсылка.Контрагенты"));
	
	РЕЗ = Новый ТаблицаЗначений;
	РЕЗ.Колонки.Добавить("Позиция",Новый ОписаниеТипов("Строка"));
	РЕЗ.Колонки.Добавить("ДокументСсылка",ОбщегоНазначения.ОписаниеТипаВсеСсылки());
	РЕЗ.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов(МассивТиповСотрудник));
	
	Возврат ПоместитьВоВременноеХранилище(РЕЗ, Новый УникальныйИдентификатор());
КонецФункции

Функция ПолучитьТаблицуДвиженийПоСчетуВременноеХранилище() ЭКСПОРТ
    ПЕРЕМ РЕЗ;
	
	РЕЗ = Новый ТаблицаЗначений;
	РЕЗ.Колонки.Добавить("movementId");
	РЕЗ.Колонки.Добавить("paymentId");
	РЕЗ.Колонки.Добавить("externalPaymentId");
	РЕЗ.Колонки.Добавить("debitCredit");
	РЕЗ.Колонки.Добавить("valueDate");
	РЕЗ.Колонки.Добавить("description");
	РЕЗ.Колонки.Добавить("amount");
	РЕЗ.Колонки.Добавить("currency");
	РЕЗ.Колонки.Добавить("accountNumber");
	РЕЗ.Колонки.Добавить("accountName");
	РЕЗ.Колонки.Добавить("additionalInformation");
	РЕЗ.Колонки.Добавить("documentDate");
	РЕЗ.Колонки.Добавить("documentNumber");
	РЕЗ.Колонки.Добавить("partnerAccountNumber");
	РЕЗ.Колонки.Добавить("partnerName");
	РЕЗ.Колонки.Добавить("partnerTaxCode");
	РЕЗ.Колонки.Добавить("partnerBankCode");
	РЕЗ.Колонки.Добавить("partnerBank");
	РЕЗ.Колонки.Добавить("intermediaryBankCode");
	РЕЗ.Колонки.Добавить("intermediaryBank");
	РЕЗ.Колонки.Добавить("chargeDetail");
	РЕЗ.Колонки.Добавить("taxpayerCode");
	РЕЗ.Колонки.Добавить("taxpayerName");
	РЕЗ.Колонки.Добавить("treasuryCode");
	РЕЗ.Колонки.Добавить("operationCode");
	РЕЗ.Колонки.Добавить("additionalDescription");
	РЕЗ.Колонки.Добавить("exchangeRate");
	РЕЗ.Колонки.Добавить("partnerPersonalNumber");
	РЕЗ.Колонки.Добавить("partnerDocumentType");
	РЕЗ.Колонки.Добавить("partnerDocumentNumber");
	РЕЗ.Колонки.Добавить("parentExternalPaymentId");
	РЕЗ.Колонки.Добавить("statusCode");
	РЕЗ.Колонки.Добавить("transactionType");
	
	Возврат ПоместитьВоВременноеХранилище(РЕЗ, Новый УникальныйИдентификатор());
КонецФункции

Функция ПолучитьБанкИзСсылкиНаДокумент(ДокументСсылка, БанкПоУмолчанию=НЕОПРЕДЕЛЕНО)
	ПЕРЕМ РЕЗ;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументСсылка, "БанковскийСчетКасса") Тогда
		РЕЗ = ДокументСсылка.БанковскийСчетКасса.Банк;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументСсылка, "Отправитель") Тогда
		РЕЗ = ДокументСсылка.Отправитель.Банк;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументСсылка, "БанковскийСчетКассаОтправитель") Тогда
		РЕЗ = ДокументСсылка.БанковскийСчетКассаОтправитель.Банк;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументСсылка, "БанковскийСчет") Тогда
		РЕЗ = ДокументСсылка.БанковскийСчет.Банк;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументСсылка, "Банк") Тогда
		РЕЗ = ДокументСсылка.Банк;
	Иначе
		РЕЗ = БанкПоУмолчанию;
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

// Функция - Создает и возвращает структуру параметров соединения для интеграции с банком ТБС
// 
// Возвращаемое значение - Структура
// 	Поля структуры:
//      TBC_Login					 - Строка - логин пользователя
//      TBC_Password				 - Строка - пароль пользователя
//      TBC_ТестовыйРежим			 - Булево - работаем в тестовом режиме
//      TBC_Сертификат				 - СправочникСсылка.Файлы - ссылка на справочник с хранилищем двоичных данных сертификата
//      TBC_ПарольСертификата		 - Строка - пароль сертификата
//      TBC_РаботаЧерезСервер		 - Булево - предполагается, что соединение с сайтом TBC будет происходить с сервера 1С
//      TBC_ИспользоватьСертификат	 - Булево - ИСТИНА: соединение с банком с использованием сертификата подлинности; ЛОЖЬ - соединение с банком без сертификата подлинности
//      Nonce						 - Строка - Nonce
//      ДвоичныеДанныеСертификата	 - ДвоичныеДанные,АдресВоВременномХранилище - двоичные данные сертификата
//
Функция СтруктураПараметровСоединенияТБС() ЭКСПОРТ
	ПЕРЕМ РЕЗ;

	РЕЗ = Новый Структура("TBC_Login,TBC_Password,TBC_ТестовыйРежим,TBC_Сертификат,TBC_ПарольСертификата,TBC_РаботаЧерезСервер,TBC_ИспользоватьСертификат,Nonce,ДвоичныеДанныеСертификата");
					
    Возврат РЕЗ;
КонецФункции // ()

// Функция - Получить параметры соединения с банком ТБС для пользователя
//
// Параметры:
//  ТекущийПользователь	 - СправочникСсылка.Пользователи - пользователь, для которого нужно получить настройки
// 
// Возвращаемое значение:
// 	Поля структуры:
//      TBC_Login					 - Строка - логин пользователя
//      TBC_Password				 - Строка - пароль пользователя
//      TBC_ТестовыйРежим			 - Булево - работаем в тестовом режиме
//      TBC_Сертификат				 - СправочникСсылка.Файлы - ссылка на справочник с хранилищем двоичных данных сертификата
//      TBC_ПарольСертификата		 - Строка - пароль сертификата
//      TBC_РаботаЧерезСервер		 - Булево - предполагается, что соединение с сайтом TBC будет происходить с сервера 1С
//      TBC_ИспользоватьСертификат	 - Булево - ИСТИНА: соединение с банком с использованием сертификата подлинности; ЛОЖЬ - соединение с банком без сертификата подлинности
//      Nonce						 - Строка - Nonce
//      ДвоичныеДанныеСертификата	 - ДвоичныеДанные,АдресВоВременномХранилище - двоичные данные сертификата
//
Функция ПолучитьПараметрыСоединенияТБС(ТекущийПользователь = НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = СтруктураПараметровСоединенияТБС();
	
	Если ТекущийПользователь = НЕОПРЕДЕЛЕНО Тогда
	
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		
	ИначеЕсли ТипЗНЧ(ТекущийПользователь) = Тип("ПользовательИнформационнойБазы") Тогда
		
		ТекущийПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ТекущийПользователь.УникальныйИдентификатор);
		
	ИначеЕсли НЕ(ТипЗНЧ(ТекущийПользователь) = Тип("СправочникСсылка.Пользователи")) Тогда
		
		ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	КонецЕсли;

	TBC_Login = ПланыВидовХарактеристик.НастройкиПользователей.TBC_Login;
	TBC_Password = ПланыВидовХарактеристик.НастройкиПользователей.TBC_Password; 
	TBC_ТестовыйРежим = ПланыВидовХарактеристик.НастройкиПользователей.TBC_ТестовыйРежим;
	TBC_Сертификат = ПланыВидовХарактеристик.НастройкиПользователей.TBC_Сертификат;
	TBC_ПарольСертификата = ПланыВидовХарактеристик.НастройкиПользователей.TBC_ПарольСертификата; 
	TBC_РаботаЧерезСервер = ПланыВидовХарактеристик.НастройкиПользователей.TBC_РаботаЧерезСервер;
	TBC_ИспользоватьСертификат = ПланыВидовХарактеристик.НастройкиПользователей.TBC_ИспользоватьСертификат;
	
	СписокНастроек = Новый СписокЗначений();
	СписокНастроек.Добавить(TBC_Login);	
	СписокНастроек.Добавить(TBC_Password);
	СписокНастроек.Добавить(TBC_ТестовыйРежим);
	СписокНастроек.Добавить(TBC_Сертификат);
	СписокНастроек.Добавить(TBC_ПарольСертификата);
	СписокНастроек.Добавить(TBC_РаботаЧерезСервер);
	СписокНастроек.Добавить(TBC_ИспользоватьСертификат);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Настройка КАК Настройка,
		|	НастройкиПользователей.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Настройка В(&Настройка)
		|	И НастройкиПользователей.Пользователь = &ТекущийПользователь";
	
	Запрос.УстановитьПараметр("Настройка", СписокНастроек);
	Запрос.УстановитьПараметр("ТекущийПользователь",ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Настройка = TBC_Login Тогда
			РЕЗ.TBC_Login = ВыборкаДетальныеЗаписи.Значение;
		ИначеЕсли ВыборкаДетальныеЗаписи.Настройка = TBC_Password Тогда
			РЕЗ.TBC_Password = ВыборкаДетальныеЗаписи.Значение;
		ИначеЕсли ВыборкаДетальныеЗаписи.Настройка = TBC_ТестовыйРежим Тогда
			РЕЗ.TBC_ТестовыйРежим = ВыборкаДетальныеЗаписи.Значение;
		ИначеЕсли ВыборкаДетальныеЗаписи.Настройка = TBC_Сертификат Тогда
			РЕЗ.TBC_Сертификат = ВыборкаДетальныеЗаписи.Значение;
		ИначеЕсли ВыборкаДетальныеЗаписи.Настройка = TBC_ПарольСертификата Тогда
			РЕЗ.TBC_ПарольСертификата = ВыборкаДетальныеЗаписи.Значение;
		ИначеЕсли ВыборкаДетальныеЗаписи.Настройка = TBC_РаботаЧерезСервер Тогда
			РЕЗ.TBC_РаботаЧерезСервер = ВыборкаДетальныеЗаписи.Значение;
		ИначеЕсли ВыборкаДетальныеЗаписи.Настройка = TBC_ИспользоватьСертификат Тогда
			РЕЗ.TBC_ИспользоватьСертификат = ВыборкаДетальныеЗаписи.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(РЕЗ.TBC_Сертификат) Тогда
	
		ДанныеСертификата = РаботаСФайлами.ДвоичныеДанныеФайла(РЕЗ.TBC_Сертификат, ЛОЖЬ);
		РЕЗ.ДвоичныеДанныеСертификата = ПоместитьВоВременноеХранилище(ДанныеСертификата, Новый УникальныйИдентификатор());
	
	КонецЕсли;
	
    Возврат РЕЗ;
КонецФункции // ()

// Функция - Создать XML Структуру запроса метода сервиса
//
// Параметры:
//  СтруктураПарметровЗапросаВБанк	 - Структура - параметры запроса к банку, содержание зависит от метода, вызываемого на сервисе банка
//  МассивСсылокДокументовПакетов	 - Массив - массив обработанных документов, может быть пустым в зависимости от метода
//  ПрефиксОтвета					 - Строка - используется для создания тела запроса в формате протокала SOAP
//  СуфиксОтвета					 - Строка - используется для создания тела запроса в формате протокала SOAP
//  ПрефиксЗапроса					 - Строка - используется для создания тела запроса в формате протокала SOAP
//  СуфиксЗапроса					 - Строка - используется для создания тела запроса в формате протокала SOAP
// 
// Возвращаемое значение:
//  РЕЗ - Строка - тело XML запроса к банку TBC, содержание зависит от имени метода
//
Функция СоздатьXMLСтруктуруЗапросаМетодаСервиса(СтруктураПарметровЗапросаВБанк,МассивСсылокДокументовПакетов = НЕОПРЕДЕЛЕНО,ПрефиксОтвета = "ns2:",СуфиксОтвета = "ResponseIo",ПрефиксЗапроса = "myg:",СуфиксЗапроса = "RequestIo") ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = "";
	
	ИмяМетода = СтруктураПарметровЗапросаВБанк.ИмяМетода;
	
	Если ИмяМетода = "GetAccountMovements" Тогда
		//Добавим фильтра если есть 
		Если СтруктураПарметровЗапросаВБанк.Свойство("ФильтраЗапроса") Тогда 
			РЕЗ = РЕЗ + ДобавитьФильтры(СтруктураПарметровЗапросаВБанк.ФильтраЗапроса, ПрефиксЗапроса);
		КонецЕсли;
		
	ИначеЕсли ИмяМетода = "GetPaymentOrderStatus" Тогда
		
		Если СтруктураПарметровЗапросаВБанк.ЭтоПакет Тогда 
			РЕЗ = РЕЗ + "<" + ПрефиксЗапроса + "batchPaymentId>"+ СокрЛП(СтруктураПарметровЗапросаВБанк.УИД) + "</" + ПрефиксЗапроса + "batchPaymentId>";
		Иначе
			РЕЗ = РЕЗ + "<" + ПрефиксЗапроса + "singlePaymentId>"+ СокрЛП(СтруктураПарметровЗапросаВБанк.УИД) + "</" + ПрефиксЗапроса + "singlePaymentId>";
		КонецЕсли;
		
	ИначеЕсли ИмяМетода = "ImportSinglePaymentOrders" Тогда
		
		МассивСсылокДокументовПакетов = Новый Массив;
		тзПозиций = ПолучитьИзВременногоХранилища(СтруктураПарметровЗапросаВБанк.ТаблицаПозиций);
		
		ВыборкаДляЗаполнения = ПолучитьВыборкуЗаполненияПоДокументам(СтруктураПарметровЗапросаВБанк);
		
		ТекстТэговРасходовСоСчетов = "";
		СчетчикПозиций = 1;
		КолвоДоковВЗапросе = 0;
		ПредыдущийДокумент = Неопределено;
		Пока ВыборкаДляЗаполнения.Следующий() Цикл 
			
			ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса + "singlePaymentOrder xsi:type=""" + ПрефиксЗапроса + ВыборкаДляЗаполнения["singlePaymentOrder"] + """>";
			
			Если НЕ ВыборкаДляЗаполнения.РазрешеноВыгрузить Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрЗаменить(ВыборкаДляЗаполнения.ОписатниеЗапрета, "%ПарамДокументСсылка%", ВыборкаДляЗаполнения.Ссылка));
				Продолжить;
				
			Иначе                                                                                                         
				
				Если НЕ ЗначениеЗаполнено(ВыборкаДляЗаполнения.singlePaymentOrder) И Не ЗначениеЗаполнено(ВыборкаДляЗаполнения.CreditАccountNumber) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ: """+ВыборкаДляЗаполнения.Ссылка+""", не заполнен """+ВыборкаДляЗаполнения.CreditАccountNumberИмяРеквизита+""", у "+ВыборкаДляЗаполнения.beneficiaryName +"'; ka = 'Документ: """+ВыборкаДляЗаполнения.Ссылка+""", не заполнен """+ВыборкаДляЗаполнения.CreditАccountNumberИмяРеквизита+""", у "+ВыборкаДляЗаполнения.beneficiaryName+"'"));
					Продолжить;
				КонецЕсли;
				
				Если ПредыдущийДокумент <> ВыборкаДляЗаполнения.Ссылка Тогда 
					КолвоДоковВЗапросе = КолвоДоковВЗапросе + 1;
					ПредыдущийДокумент = ВыборкаДляЗаполнения.Ссылка;
				КонецЕсли;
				
			КонецЕсли;
			
			СтруктураТэгов = СтруктураПарметровЗапросаВБанк.СтруктурыТэгов[ВыборкаДляЗаполнения.singlePaymentOrder];
			
			Для Каждого Элем Из СтруктураТэгов Цикл 
				
				Если Элем.Ключ = "singlePaymentRequestId" Тогда 
					
					Если СокрЛП(ВыборкаДляЗаполнения[Элем.Ключ]) <> "" Тогда 
						ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+Элем.Ключ+">" + СокрЛП(ВыборкаДляЗаполнения[Элем.Ключ]) + "</"+ПрефиксЗапроса+Элем.Ключ+">";
					КонецЕсли;
					
				ИначеЕсли Элем.Ключ = "documentNumber" Тогда 
					
					НомерДокумента = ВыборкаДляЗаполнения.documentNumber;
					НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерДокумента, Истина, Истина);
					
					ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+"documentNumber>" + НомерДокумента + "</"+ПрефиксЗапроса+"documentNumber>";
					
				ИначеЕсли Элем.Ключ = "position" Тогда
					
					Если ВыборкаДляЗаполнения.position>0 Тогда
						СчетчикПозиций = ВыборкаДляЗаполнения.position;
					КонецЕсли;
					
					ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+Элем.Ключ+">" + СчетчикПозиций + "</"+ПрефиксЗапроса+Элем.Ключ+">";
					
					СтрокаПоизиции = тзПозиций.Добавить();
					СтрокаПоизиции.Позиция = Строка(СчетчикПозиций);
					СтрокаПоизиции.Сотрудник = ВыборкаДляЗаполнения.Сотрудник;
					СтрокаПоизиции.ДокументСсылка = ВыборкаДляЗаполнения.Ссылка;
					
					СчетчикПозиций = СчетчикПозиций + 1;
					
				ИначеЕсли Элем.Ключ = "taxpayerCode" ИЛИ Элем.Ключ = "taxpayerName" Тогда
					
					Если ЗначениеЗаполнено(ВыборкаДляЗаполнения[Элем.Ключ]) Тогда
					
						ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+Элем.Ключ+">" + СокрЛП(ВыборкаДляЗаполнения[Элем.Ключ]) + "</"+ПрефиксЗапроса+Элем.Ключ+">";
					
					КонецЕсли;
					
				ИначеЕсли Элем.Ключ = "additionalDescription" Тогда
					
					ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+Элем.Ключ+">" + СокрЛП(ВыборкаДляЗаполнения[Элем.Ключ]) + "##"+XMLСтрока(ВыборкаДляЗаполнения.Ссылка) + "##" + "</"+ПрефиксЗапроса+Элем.Ключ+">";
					
				ИначеЕсли Элем.Значение = Неопределено Тогда 
					
					ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+Элем.Ключ+">" + СокрЛП(ВыборкаДляЗаполнения[Элем.Ключ]) + "</"+ПрефиксЗапроса+Элем.Ключ+">";
					
				ИначеЕсли ТипЗнч(Элем.Значение) = Тип("Структура") Тогда 
					
					ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+Элем.Ключ+">"; 
					Для Каждого ДопЭлемент Из Элем.Значение Цикл
						Если ДопЭлемент.Ключ = "amount" Тогда  
							ЦелаяЧасть = Цел(ВыборкаДляЗаполнения[ДопЭлемент.Ключ]);
							ДробнаяЧасть = ВыборкаДляЗаполнения[ДопЭлемент.Ключ] - ЦелаяЧасть;
							ЦелаяЧасть = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(ЦелаяЧасть), ",", ""), Символы.НПП, ""),"", "");
							Если ДробнаяЧасть = 0 Тогда 
								ЗначенияПодстановки = ЦелаяЧасть;
							Иначе
								ЗначенияПодстановки = ЦелаяЧасть + "." + Сред(Строка(ДробнаяЧасть),3);
							КонецЕсли;
						Иначе
							
							ЗначенияПодстановки = СтрЗаменить(СтрЗаменить(Строка(ВыборкаДляЗаполнения[ДопЭлемент.Ключ]), ",", "."), Символы.НПП, "");
							
						КонецЕсли;
						ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+ДопЭлемент.Ключ+">" + СокрЛп(ЗначенияПодстановки) + "</"+ПрефиксЗапроса+ДопЭлемент.Ключ+">";
					КонецЦикла;
					
					ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "</"+ПрефиксЗапроса+Элем.Ключ+">";
				КонецЕсли;
			КонецЦикла;
			
			ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "</"+ПрефиксЗапроса + "singlePaymentOrder>";
			
		КонецЦикла;
		
		Если КолвоДоковВЗапросе = 0 Тогда 
			
			СтруктураОтвета = Новый Структура;
			Если МассивСсылокДокументовПакетов <> Неопределено И МассивСсылокДокументовПакетов.Количество() > 0 Тогда 
				СтруктураОтвета.Вставить("МассивСсылокДокументовПакетов", МассивСсылокДокументовПакетов);
			КонецЕсли;
			
			Возврат СтруктураОтвета;
			
		КонецЕсли;
		
		ТекстТэговРасходовСоСчетов = СтрЗаменить(ТекстТэговРасходовСоСчетов, "CreditАccountNumber", "accountNumber");
		ТекстТэговРасходовСоСчетов = СтрЗаменить(ТекстТэговРасходовСоСчетов, "DebitАccountNumber", "accountNumber");
		ТекстТэговРасходовСоСчетов = СтрЗаменить(ТекстТэговРасходовСоСчетов, "CreditАccountCurrencyCode", "accountCurrencyCode");
		ТекстТэговРасходовСоСчетов = СтрЗаменить(ТекстТэговРасходовСоСчетов, "DebitАccountCurrencyCode", "accountCurrencyCode");
		
		РЕЗ = РЕЗ + ТекстТэговРасходовСоСчетов;
		
	ИначеЕсли ИмяМетода = "ImportBatchPaymentOrder" Тогда
		
		ВалютаУчета = СтруктураПарметровЗапросаВБанк.ВалютаУчета;
		
		тзПозиций = ПолучитьИзВременногоХранилища(СтруктураПарметровЗапросаВБанк.ТаблицаПозиций);
		
		ВыборкаГруппыИмяПакета = ПолучитьВыборкуПакетногоЗаполненияПоДокументам(СтруктураПарметровЗапросаВБанк);
		
		ТекстТэговРасходовСоСчетов = "";
		СчетчикПозиций = 1;
		
		КолвоДоковВЗапросе = 0;
		Пока ВыборкаГруппыИмяПакета.Следующий() Цикл 
			
			ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов +"<myg:"+ИмяМетода+СуфиксЗапроса+">";
			
			ВыборкаГруппаНомерСчета = ВыборкаГруппыИмяПакета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаГруппаНомерСчета.Следующий() Цикл
				ВыборкаГруппаВалютаДебита = ВыборкаГруппаНомерСчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаГруппаВалютаДебита.Следующий() Цикл
					//Дополним Текст Данными имени пакета и счата Дебита
					
					ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + ПолучитьТекстДебита(ВыборкаГруппаВалютаДебита);
										
					ВыборкаДляЗаполнения = ВыборкаГруппаВалютаДебита.Выбрать();
					
					Пока ВыборкаДляЗаполнения.Следующий() Цикл
						
						ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса + "paymentOrder xsi:type=""" + ПрефиксЗапроса + ВыборкаДляЗаполнения["paymentOrder"] + """>";
						
						Если НЕ ВыборкаДляЗаполнения.РазрешеноВыгрузить Тогда
							
							// с "" документы Зарплаты, которые выгружаются пакетом
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрЗаменить(ВыборкаДляЗаполнения.ОписатниеЗапрета, "%ПарамДокументСсылка%", ВыборкаДляЗаполнения.Ссылка));
							
							Продолжить;
							
						Иначе
							
							Если НЕ ЗначениеЗаполнено(ВыборкаДляЗаполнения.paymentOrder) И Не ЗначениеЗаполнено(ВыборкаДляЗаполнения.CreditАccountNumber) Тогда
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ: """+ВыборкаДляЗаполнения.Ссылка+""", не заполнен """+ВыборкаДляЗаполнения.CreditАccountNumberИмяРеквизита+""", у "+ВыборкаДляЗаполнения.beneficiaryName +"'; ka = 'Документ: """+ВыборкаДляЗаполнения.Ссылка+""", не заполнен """+ВыборкаДляЗаполнения.CreditАccountNumberИмяРеквизита+""", у "+ВыборкаДляЗаполнения.beneficiaryName+"'"));
								Продолжить;
							КонецЕсли;
							
							Если ПредыдущийДокумент <> ВыборкаДляЗаполнения.Ссылка Тогда 
								КолвоДоковВЗапросе = КолвоДоковВЗапросе + 1;
								ПредыдущийДокумент = ВыборкаДляЗаполнения.Ссылка;
							КонецЕсли;
							//КолвоДоковВЗапросе = КолвоДоковВЗапросе + 1;
							
						КонецЕсли;
						
						СтруктураТэгов = СтруктураПарметровЗапросаВБанк.СтруктурыТэгов[ВыборкаДляЗаполнения.paymentOrder];
						
						Для Каждого Элем Из СтруктураТэгов Цикл 
							
							Если Элем.Ключ = "singlePaymentRequestId" Тогда 
								
								//Повторная отправки выгруженного документа - не используется в конфигурации
								// создайте новый документ
								
							ИначеЕсли Элем.Ключ = "documentNumber" Тогда 
								
								НомерДокумента = ВыборкаДляЗаполнения.documentNumber;
								НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерДокумента, Истина, Истина);
								
								ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+"documentNumber>" + НомерДокумента + "</"+ПрефиксЗапроса+"documentNumber>";
								
							ИначеЕсли Элем.Ключ = "position" Тогда
								
								Если ВыборкаДляЗаполнения.position>0 Тогда
									СчетчикПозиций = ВыборкаДляЗаполнения.position;
								КонецЕсли;
								
								ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+Элем.Ключ+">" + СчетчикПозиций + "</"+ПрефиксЗапроса+Элем.Ключ+">";
								
								СтрокаПоизиции = тзПозиций.Добавить();
								СтрокаПоизиции.Позиция = Строка(СчетчикПозиций);
								СтрокаПоизиции.Сотрудник = ВыборкаДляЗаполнения.Сотрудник;
								СтрокаПоизиции.ДокументСсылка = ВыборкаДляЗаполнения.Ссылка;
								
								СчетчикПозиций = СчетчикПозиций + 1;
								
							ИначеЕсли Элем.Ключ = "taxpayerCode" ИЛИ Элем.Ключ = "taxpayerName" Тогда
					
								Если ЗначениеЗаполнено(ВыборкаДляЗаполнения[Элем.Ключ]) Тогда
									
									ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+Элем.Ключ+">" + СокрЛП(ВыборкаДляЗаполнения[Элем.Ключ]) + "</"+ПрефиксЗапроса+Элем.Ключ+">";
									
								КонецЕсли;
								
							ИначеЕсли Элем.Ключ = "debitAccount" Тогда
								
								Продолжить;
								
							ИначеЕсли Элем.Ключ = "additionalDescription" Тогда
								
								ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+Элем.Ключ+">" + СокрЛП(ВыборкаДляЗаполнения[Элем.Ключ]) + "##"+XMLСтрока(ВыборкаДляЗаполнения.Ссылка) + "##" + "</"+ПрефиксЗапроса+Элем.Ключ+">";
								
							ИначеЕсли Элем.Значение = Неопределено Тогда 
								
								ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+Элем.Ключ+">" + СокрЛП(ВыборкаДляЗаполнения[Элем.Ключ]) + "</"+ПрефиксЗапроса+Элем.Ключ+">";
								
							ИначеЕсли ТипЗнч(Элем.Значение) = Тип("Структура") Тогда 
								ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+Элем.Ключ+">"; 
								Для Каждого ДопЭлемент Из Элем.Значение Цикл
									ЗначенияПодстановки = СтрЗаменить(СтрЗаменить(Строка(ВыборкаДляЗаполнения[ДопЭлемент.Ключ]), ",", "."), Символы.НПП, "");
									ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "<"+ПрефиксЗапроса+ДопЭлемент.Ключ+">" + СокрЛП(ЗначенияПодстановки) + "</"+ПрефиксЗапроса+ДопЭлемент.Ключ+">";
								КонецЦикла;
								ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "</"+ПрефиксЗапроса+Элем.Ключ+">";
							КонецЕсли;
						КонецЦикла;
						
						ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "</"+ПрефиксЗапроса + "paymentOrder>";
						
					КонецЦикла;
				КонецЦикла;
				
			КонецЦикла;
			
			ТекстТэговРасходовСоСчетов = ТекстТэговРасходовСоСчетов + "</myg:"+ИмяМетода+СуфиксЗапроса+">"
		КонецЦикла;
		
		Если КолвоДоковВЗапросе = 0 Тогда 
			Возврат новый Структура;
		КонецЕсли;
		
		ТекстТэговРасходовСоСчетов = СтрЗаменить(ТекстТэговРасходовСоСчетов, "CreditАccountNumber", "accountNumber");
		ТекстТэговРасходовСоСчетов = СтрЗаменить(ТекстТэговРасходовСоСчетов, "CreditАccountCurrencyCode", "accountCurrencyCode");
		
		РЕЗ = РЕЗ + ТекстТэговРасходовСоСчетов;
		
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции

Функция ПолучитьТекстДебита(Выборка)
	
	ТекстВозврата = 
	"<myg:debitAccountIdentification>"
	+"<myg:accountNumber>"+Выборка.DebitАccountNumber+"</myg:accountNumber>"           
	+"<myg:accountCurrencyCode>"+Выборка.DebitАccountCurrencyCode+"</myg:accountCurrencyCode>"
	+"</myg:debitAccountIdentification>"
	+"<myg:batchName>"+Выборка.batchName+"</myg:batchName>";
	
	Возврат ТекстВозврата;
	
КонецФункции

Функция ДобавитьФильтры(СтруктураФильтров, Префикс)
	
	ТекстXML = "<myg:accountMovementFilterIo>";
	
	Для Каждого Элем Из СтруктураФильтров Цикл
		
		ТекстXML = ТекстXML + "<" + Префикс + Элем.Ключ + ">" ;
		
		Если ТипЗНЧ(Элем.Значение) = Тип("Структура") Тогда
			
			ВнутренняяСтруктураФильтров = Элем.Значение;
			
			Для каждого ВнутреннийЭлемент Из ВнутренняяСтруктураФильтров Цикл
			
				ТекстXML = ТекстXML + "<" + Префикс + ВнутреннийЭлемент.Ключ + ">";
				
				ЗначениеВнутреннеегоФильтра = ОбработатьТекстДляXML(ВнутреннийЭлемент.Значение);
				ТекстXML = ТекстXML + ЗначениеВнутреннеегоФильтра;
				
				ТекстXML = ТекстXML + "</" + Префикс + ВнутреннийЭлемент.Ключ + ">";	
			
			КонецЦикла;
			
		Иначе
			
			ЗначениеФильтра = ОбработатьТекстДляXML(Элем.Значение);
			ТекстXML = ТекстXML + ЗначениеФильтра;	
			
		КонецЕсли;
		
		ТекстXML = ТекстXML + "</" + Префикс + Элем.Ключ + ">";	
		
	КонецЦикла;
	
	ТекстXML = ТекстXML + "</myg:accountMovementFilterIo>";
	
	Возврат ТекстXML;
	
КонецФункции

Функция ОбработатьТекстДляXML(Значение)
	
	ЗначениеВозврата = Значение;
	Если ТипЗнч(Значение) = Тип("Дата") Тогда 
		ЗначениеВозврата = ДатаВремяВСтроку(ЗначениеВозврата);
	КонецЕсли;
	
	ЗначениеВозврата = ЗаменитьНедопустимыСимволы(ЗначениеВозврата);
	
	Возврат ЗначениеВозврата;	
	
КонецФункции

Функция ЗаменитьНедопустимыСимволы(Значение)
	ПЕРЕМ РЕЗ;
	
	РЕЗ=Строка(Значение);
	
	ТекДлинаСтроки = СтрДлина(Значение);
	
	РЕЗ=СтрЗаменить(РЕЗ,"&","&amp;");
	РЕЗ=СтрЗаменить(РЕЗ,"<","&lt;");
	РЕЗ=СтрЗаменить(РЕЗ,">","&gt;");
	РЕЗ=СтрЗаменить(РЕЗ,"'","&apos;");
	РЕЗ=СтрЗаменить(РЕЗ,"""","&quot;");
	
	Возврат РЕЗ;
КонецФункции

Функция ДатаВремяВСтроку(Дата) 
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат "";
	Иначе
		ДатаСтрока = Строка(Формат(Дата, "ДФ='yyyy-MM-dd'")) + "T" + Строка(Формат(Дата, "ДФ=HH:mm:ss"));
		Возврат ДатаСтрока;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВыборкуЗаполненияПоДокументам(СтруктураПарметровЗапросаВБанк)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходДенежныхСредств.Ссылка КАК Ссылка,
		|	0 КАК НомерСтроки,
		|	ЕСТЬNULL(СтатусыДокументовВИнтернетБанкеСрезПоследних.СтатусДокументаВИнтернетБанке, ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовВИНтернетБанке.ПрисутствуетТолькоВТекущейБазе)) КАК ТекущийСтатусДокумента,
		|	ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") КАК УИД,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") = """"
		|				И РасходДенежныхСредств.Проведен
		|				И НЕ РасходДенежныхСредств.ПометкаУдаления
		|				И РасходДенежныхСредств.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
		|				И НЕ РасходДенежныхСредств.СчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РазрешеноВыгрузить,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") <> """"
		|			ТОГДА ""Документ %ПарамДокументСсылка%: был ранее выгружен""
		|		КОГДА НЕ РасходДенежныхСредств.Проведен
		|			ТОГДА ""Документ %ПарамДокументСсылка%: должен быть проведенным""
		|		КОГДА РасходДенежныхСредств.ПометкаУдаления
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы помеченые на удаление""
		|		КОГДА НЕ РасходДенежныхСредств.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы расхода по кассе или сотруднику""
		|		КОГДА РасходДенежныхСредств.СчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Не определен счет контрагента""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ОписатниеЗапрета
		|ПОМЕСТИТЬ ВТ_ПредПроверка
		|ИЗ
		|	Документ.РасходДенежныхСредств КАК РасходДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
		|		ПО РасходДенежныхСредств.Ссылка = УИДДокументовВИнтернетБанке.ДокументСсылка
		|			И РасходДенежныхСредств.БанковскийСчетКасса.Банк = УИДДокументовВИнтернетБанке.Банк
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовВИнтернетБанке.СрезПоследних КАК СтатусыДокументовВИнтернетБанкеСрезПоследних
		|		ПО РасходДенежныхСредств.Ссылка = СтатусыДокументовВИнтернетБанкеСрезПоследних.ДокументСсылка
		|			И РасходДенежныхСредств.БанковскийСчетКасса.Банк = СтатусыДокументовВИнтернетБанкеСрезПоследних.Банк
		|ГДЕ
		|	РасходДенежныхСредств.Ссылка В(&МассивДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Конвертация.Ссылка,
		|	0,
		|	ЕСТЬNULL(СтатусыДокументовВИнтернетБанкеСрезПоследних.СтатусДокументаВИнтернетБанке, ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовВИНтернетБанке.ПрисутствуетТолькоВТекущейБазе)),
		|	ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """"),
		|	ВЫБОР
		|		КОГДА Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") = """"
		|							И Конвертация.Проведен
		|							И НЕ Конвертация.ПометкаУдаления
		|							И Конвертация.Отправитель ССЫЛКА Справочник.БанковскиеСчета
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") <> """"
		|						ТОГДА ""Документ %ПарамДокументСсылка%: был ранее выгружен""
		|					КОГДА НЕ Конвертация.Проведен
		|						ТОГДА ""Документ %ПарамДокументСсылка%: должен быть проведенным""
		|					КОГДА Конвертация.ПометкаУдаления
		|						ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы помеченые на удаление""
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ ""Документ %ПарамДокументСсылка%: Выгрузка вида операции %ВидОперации% не предусмотрена""
		|	КОНЕЦ
		|ИЗ
		|	Документ.Конвертация КАК Конвертация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
		|		ПО Конвертация.Ссылка = УИДДокументовВИнтернетБанке.ДокументСсылка
		|			И Конвертация.Отправитель.Банк = УИДДокументовВИнтернетБанке.Банк
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовВИнтернетБанке.СрезПоследних КАК СтатусыДокументовВИнтернетБанкеСрезПоследних
		|		ПО Конвертация.Ссылка = СтатусыДокументовВИнтернетБанкеСрезПоследних.ДокументСсылка
		|			И Конвертация.Отправитель.Банк = СтатусыДокументовВИнтернетБанкеСрезПоследних.Банк
		|ГДЕ
		|	Конвертация.Ссылка В(&МассивДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратДенежныхСредствПокупателю.Ссылка,
		|	0,
		|	ЕСТЬNULL(СтатусыДокументовВИнтернетБанкеСрезПоследних.СтатусДокументаВИнтернетБанке, ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовВИНтернетБанке.ПрисутствуетТолькоВТекущейБазе)),
		|	ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """"),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") = """"
		|				И ВозвратДенежныхСредствПокупателю.Проведен
		|				И НЕ ВозвратДенежныхСредствПокупателю.ПометкаУдаления
		|				И ВозвратДенежныхСредствПокупателю.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
		|				И НЕ ВозвратДенежныхСредствПокупателю.СчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") <> """"
		|			ТОГДА ""Документ %ПарамДокументСсылка%: был ранее выгружен""
		|		КОГДА НЕ ВозвратДенежныхСредствПокупателю.Проведен
		|			ТОГДА ""Документ %ПарамДокументСсылка%: должен быть проведенным""
		|		КОГДА ВозвратДенежныхСредствПокупателю.ПометкаУдаления
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы помеченые на удаление""
		|		КОГДА НЕ ВозвратДенежныхСредствПокупателю.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы расхода по кассе или сотруднику""
		|		КОГДА ВозвратДенежныхСредствПокупателю.СчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Не определен счет контрагента""
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|ИЗ
		|	Документ.ВозвратДенежныхСредствПокупателю КАК ВозвратДенежныхСредствПокупателю
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
		|		ПО ВозвратДенежныхСредствПокупателю.Ссылка = УИДДокументовВИнтернетБанке.ДокументСсылка
		|			И ВозвратДенежныхСредствПокупателю.БанковскийСчетКасса.Банк = УИДДокументовВИнтернетБанке.Банк
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовВИнтернетБанке.СрезПоследних КАК СтатусыДокументовВИнтернетБанкеСрезПоследних
		|		ПО ВозвратДенежныхСредствПокупателю.Ссылка = СтатусыДокументовВИнтернетБанкеСрезПоследних.ДокументСсылка
		|			И ВозвратДенежныхСредствПокупателю.БанковскийСчетКасса.Банк = СтатусыДокументовВИнтернетБанкеСрезПоследних.Банк
		|ГДЕ
		|	ВозвратДенежныхСредствПокупателю.Ссылка В(&МассивДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыплатаДенежныхСредств.Ссылка,
		|	0,
		|	ЕСТЬNULL(СтатусыДокументовВИнтернетБанкеСрезПоследних.СтатусДокументаВИнтернетБанке, ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовВИНтернетБанке.ПрисутствуетТолькоВТекущейБазе)),
		|	ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """"),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") = """"
		|				И ВыплатаДенежныхСредств.Проведен
		|				И НЕ ВыплатаДенежныхСредств.ПометкаУдаления
		|				И ВыплатаДенежныхСредств.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
		|				И НЕ ВыплатаДенежныхСредств.СчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") <> """"
		|			ТОГДА ""Документ %ПарамДокументСсылка%: был ранее выгружен""
		|		КОГДА НЕ ВыплатаДенежныхСредств.Проведен
		|			ТОГДА ""Документ %ПарамДокументСсылка%: должен быть проведенным""
		|		КОГДА ВыплатаДенежныхСредств.ПометкаУдаления
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы помеченые на удаление""
		|		КОГДА НЕ ВыплатаДенежныхСредств.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы расхода по кассе или сотруднику""
		|		КОГДА ВыплатаДенежныхСредств.СчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Не определен счет контрагента""
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|ИЗ
		|	Документ.ВыплатаДенежныхСредств КАК ВыплатаДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
		|		ПО ВыплатаДенежныхСредств.Ссылка = УИДДокументовВИнтернетБанке.ДокументСсылка
		|			И ВыплатаДенежныхСредств.БанковскийСчетКасса.Банк = УИДДокументовВИнтернетБанке.Банк
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовВИнтернетБанке.СрезПоследних КАК СтатусыДокументовВИнтернетБанкеСрезПоследних
		|		ПО ВыплатаДенежныхСредств.Ссылка = СтатусыДокументовВИнтернетБанкеСрезПоследних.ДокументСсылка
		|			И ВыплатаДенежныхСредств.БанковскийСчетКасса.Банк = СтатусыДокументовВИнтернетБанкеСрезПоследних.Банк
		|ГДЕ
		|	ВыплатаДенежныхСредств.Ссылка В(&МассивДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПеремещениеДенежныхСредств.Ссылка,
		|	0,
		|	ЕСТЬNULL(СтатусыДокументовВИнтернетБанкеСрезПоследних.СтатусДокументаВИнтернетБанке, ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовВИНтернетБанке.ПрисутствуетТолькоВТекущейБазе)),
		|	ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """"),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") = """"
		|				И ПеремещениеДенежныхСредств.Проведен
		|				И НЕ ПеремещениеДенежныхСредств.ПометкаУдаления
		|				И ПеремещениеДенежныхСредств.БанковскийСчетКассаОтправитель ССЫЛКА Справочник.БанковскиеСчета
		|				И НЕ ПеремещениеДенежныхСредств.БанковскийСчетКассаОтправитель = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|				И ВЫБОР
		|					КОГДА ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.Сотрудники
		|							И НЕ ПеремещениеДенежныхСредств.СчетСотрудника = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|						ТОГДА ИСТИНА
		|					КОГДА ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.БанковскиеСчета
		|							И НЕ ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") <> """"
		|			ТОГДА ""Документ %ПарамДокументСсылка%: был ранее выгружен""
		|		КОГДА НЕ ПеремещениеДенежныхСредств.Проведен
		|			ТОГДА ""Документ %ПарамДокументСсылка%: должен быть проведенным""
		|		КОГДА ПеремещениеДенежныхСредств.ПометкаУдаления
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы помеченые на удаление""
		|		КОГДА НЕ ПеремещениеДенежныхСредств.БанковскийСчетКассаОтправитель ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы перемещения денежных средств из кассе""
		|		КОГДА НЕ(ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.БанковскиеСчета
		|					ИЛИ ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.Сотрудники)
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы перемещения денежных средств на кассу""
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|ИЗ
		|	Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
		|		ПО ПеремещениеДенежныхСредств.Ссылка = УИДДокументовВИнтернетБанке.ДокументСсылка
		|			И ПеремещениеДенежныхСредств.БанковскийСчетКассаОтправитель.Банк = УИДДокументовВИнтернетБанке.Банк
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовВИнтернетБанке.СрезПоследних КАК СтатусыДокументовВИнтернетБанкеСрезПоследних
		|		ПО ПеремещениеДенежныхСредств.Ссылка = СтатусыДокументовВИнтернетБанкеСрезПоследних.ДокументСсылка
		|			И ПеремещениеДенежныхСредств.БанковскийСчетКассаОтправитель.Банк = СтатусыДокументовВИнтернетБанкеСрезПоследних.Банк
		|ГДЕ
		|	ПеремещениеДенежныхСредств.Ссылка В(&МассивДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОплатаНалогов.Ссылка,
		|	0,
		|	ЕСТЬNULL(СтатусыДокументовВИнтернетБанкеСрезПоследних.СтатусДокументаВИнтернетБанке, ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовВИНтернетБанке.ПрисутствуетТолькоВТекущейБазе)),
		|	ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """"),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") = """"
		|				И ОплатаНалогов.Проведен
		|				И НЕ ОплатаНалогов.ПометкаУдаления
		|				И ОплатаНалогов.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
		|				И НЕ ОплатаНалогов.СчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") <> """"
		|			ТОГДА ""Документ %ПарамДокументСсылка%: был ранее выгружен""
		|		КОГДА НЕ ОплатаНалогов.Проведен
		|			ТОГДА ""Документ %ПарамДокументСсылка%: должен быть проведенным""
		|		КОГДА ОплатаНалогов.ПометкаУдаления
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы помеченые на удаление""
		|		КОГДА НЕ ОплатаНалогов.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы расхода по кассе или сотруднику""
		|		КОГДА ОплатаНалогов.СчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Не определен счет контрагента""
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОплатаНалогов КАК ОплатаНалогов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
		|		ПО ОплатаНалогов.Ссылка = УИДДокументовВИнтернетБанке.ДокументСсылка
		|			И ОплатаНалогов.БанковскийСчетКасса.Банк = УИДДокументовВИнтернетБанке.Банк
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовВИнтернетБанке.СрезПоследних КАК СтатусыДокументовВИнтернетБанкеСрезПоследних
		|		ПО ОплатаНалогов.Ссылка = СтатусыДокументовВИнтернетБанкеСрезПоследних.ДокументСсылка
		|			И ОплатаНалогов.БанковскийСчетКасса.Банк = СтатусыДокументовВИнтернетБанкеСрезПоследних.Банк
		|ГДЕ
		|	ОплатаНалогов.Ссылка В(&МассивДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОплатаВПенсионныйФонд.Ссылка,
		|	0,
		|	ЕСТЬNULL(СтатусыДокументовВИнтернетБанкеСрезПоследних.СтатусДокументаВИнтернетБанке, ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовВИНтернетБанке.ПрисутствуетТолькоВТекущейБазе)),
		|	ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """"),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") = """"
		|				И ОплатаВПенсионныйФонд.Проведен
		|				И НЕ ОплатаВПенсионныйФонд.ПометкаУдаления
		|				И ОплатаВПенсионныйФонд.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
		|				И НЕ ОплатаВПенсионныйФонд.СчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") <> """"
		|			ТОГДА ""Документ %ПарамДокументСсылка%: был ранее выгружен""
		|		КОГДА НЕ ОплатаВПенсионныйФонд.Проведен
		|			ТОГДА ""Документ %ПарамДокументСсылка%: должен быть проведенным""
		|		КОГДА ОплатаВПенсионныйФонд.ПометкаУдаления
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы помеченые на удаление""
		|		КОГДА НЕ ОплатаВПенсионныйФонд.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы расхода по кассе или сотруднику""
		|		КОГДА ОплатаВПенсионныйФонд.СчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА ""Документ %ПарамДокументСсылка%: Не определен счет контрагента""
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОплатаВПенсионныйФонд КАК ОплатаВПенсионныйФонд
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
		|		ПО ОплатаВПенсионныйФонд.Ссылка = УИДДокументовВИнтернетБанке.ДокументСсылка
		|			И ОплатаВПенсионныйФонд.БанковскийСчетКасса.Банк = УИДДокументовВИнтернетБанке.Банк
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовВИнтернетБанке.СрезПоследних КАК СтатусыДокументовВИнтернетБанкеСрезПоследних
		|		ПО ОплатаВПенсионныйФонд.Ссылка = СтатусыДокументовВИнтернетБанкеСрезПоследних.ДокументСсылка
		|			И ОплатаВПенсионныйФонд.БанковскийСчетКасса.Банк = СтатусыДокументовВИнтернетБанкеСрезПоследних.Банк
		|ГДЕ
		|	ОплатаВПенсионныйФонд.Ссылка В(&МассивДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыплатаЗарплатыВыплаты.Ссылка,
		|	ВыплатаЗарплатыВыплаты.НомерСтроки,
		|	ЕСТЬNULL(СтатусыДокументовВИнтернетБанкеСрезПоследних.СтатусДокументаВИнтернетБанке, ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовВИНтернетБанке.ПрисутствуетТолькоВТекущейБазе)),
		|	ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """"),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") = """"
		|				И ВыплатаЗарплатыВыплаты.Ссылка.Проведен
		|				И НЕ ВыплатаЗарплатыВыплаты.Ссылка.ПометкаУдаления
		|				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
		|				И НЕ ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") <> """"
		|						ТОГДА ""Документ %ПарамДокументСсылка%: был ранее выгружен""
		|					КОГДА НЕ ВыплатаЗарплатыВыплаты.Ссылка.Проведен
		|						ТОГДА ""Документ %ПарамДокументСсылка%: должен быть проведенным""
		|					КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ПометкаУдаления
		|						ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы помеченые на удаление""
		|					КОГДА НЕ ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
		|						ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы выплаты зарплаты из кассы или от сотрудника""
		|					КОГДА ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|						ТОГДА ""Документ %ПарамДокументСсылка%: Не определен счет сотрудника""
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") <> """"
		|						ТОГДА ""Документ %ПарамДокументСсылка%: был ранее выгружен""
		|					КОГДА НЕ ВыплатаЗарплатыВыплаты.Ссылка.Проведен
		|						ТОГДА ""Документ %ПарамДокументСсылка%: должен быть проведенным""
		|					КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ПометкаУдаления
		|						ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы помеченые на удаление""
		|					КОГДА НЕ ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
		|						ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы выплаты зарплаты из кассы или от сотрудника""
		|					КОГДА ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|						ТОГДА ""Документ %ПарамДокументСсылка%: Не определен счет сотрудника""
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|	КОНЕЦ
		|ИЗ
		|	Документ.ВыплатаЗарплаты.Выплаты КАК ВыплатаЗарплатыВыплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
		|		ПО ВыплатаЗарплатыВыплаты.Ссылка = УИДДокументовВИнтернетБанке.ДокументСсылка
		|			И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк = УИДДокументовВИнтернетБанке.Банк
		|			И ВыплатаЗарплатыВыплаты.НомерСтроки = УИДДокументовВИнтернетБанке.Position
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовВИнтернетБанке.СрезПоследних КАК СтатусыДокументовВИнтернетБанкеСрезПоследних
		|		ПО ВыплатаЗарплатыВыплаты.Ссылка = СтатусыДокументовВИнтернетБанкеСрезПоследних.ДокументСсылка
		|			И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк = СтатусыДокументовВИнтернетБанкеСрезПоследних.Банк
		|			И ВыплатаЗарплатыВыплаты.НомерСтроки = СтатусыДокументовВИнтернетБанкеСрезПоследних.Position
		|ГДЕ
		|	ВыплатаЗарплатыВыплаты.Ссылка В(&МассивДокументов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходДенежныхСредств.Ссылка КАК Ссылка,
		|	0 КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА РасходДенежныхСредств.ВалютаДокумента = &НацВалюта
		|				И РасходДенежныхСредств.БанковскийСчетКасса.Банк.СВИФТБИК = РасходДенежныхСредств.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferWithinBankPaymentOrderIo""
		|		КОГДА РасходДенежныхСредств.ВалютаДокумента <> &НацВалюта
		|				И РасходДенежныхСредств.БанковскийСчетКасса.Банк.СВИФТБИК = РасходДенежныхСредств.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferWithinBankPaymentOrderIo""
		|		КОГДА РасходДенежныхСредств.ВалютаДокумента = &НацВалюта
		|				И РасходДенежныхСредств.БанковскийСчетКасса.Банк.СВИФТБИК <> РасходДенежныхСредств.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferToOtherBankNationalCurrencyPaymentOrderIo""
		|		КОГДА РасходДенежныхСредств.ВалютаДокумента <> &НацВалюта
		|				И РасходДенежныхСредств.БанковскийСчетКасса.Банк.СВИФТБИК <> РасходДенежныхСредств.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferToOtherBankForeignCurrencyPaymentOrderIo""
		|	КОНЕЦ КАК singlePaymentOrder,
		|	ПОДСТРОКА(РасходДенежныхСредств.СчетКонтрагента.НомерСчета, 0, 22) КАК creditАccountNumber,
		|	РасходДенежныхСредств.СчетКонтрагента.ВалютаДенежныхСредств.Наименование КАК creditАccountCurrencyCode,
		|	ПОДСТРОКА(РасходДенежныхСредств.БанковскийСчетКасса.НомерСчета, 0, 22) КАК debitАccountNumber,
		|	РасходДенежныхСредств.БанковскийСчетКасса.ВалютаДенежныхСредств.Наименование КАК debitАccountCurrencyCode,
		|	РасходДенежныхСредств.Номер КАК documentNumber,
		|	РасходДенежныхСредств.СуммаДокумента КАК amount,
		|	РасходДенежныхСредств.ВалютаДокумента.Наименование КАК currency,
		|	РасходДенежныхСредств.НазначениеПлатежа КАК description,
		|	РасходДенежныхСредств.Комментарий КАК additionalDescription,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходДенежныхСредств.Контрагент.НаименованиеПолное КАК СТРОКА(150))) = """"
		|			ТОГДА РасходДенежныхСредств.Контрагент.Наименование
		|		ИНАЧЕ РасходДенежныхСредств.Контрагент.НаименованиеПолное
		|	КОНЕЦ КАК beneficiaryName,
		|	РасходДенежныхСредств.Контрагент.ИНН КАК beneficiaryTaxCode,
		|	ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Представление, ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Представление, """")) КАК beneficiaryAddress,
		|	РасходДенежныхСредств.СчетКонтрагента.Банк.СВИФТБИК КАК beneficiaryBankCode,
		|	РасходДенежныхСредств.СчетКонтрагента.Банк.Представление КАК beneficiaryBankName,
		|	РасходДенежныхСредств.ПромежуточныйБанк.СВИФТБИК КАК intermediaryBankCode,
		|	РасходДенежныхСредств.ПромежуточныйБанк.Представление КАК intermediaryBankName,
		|	РасходДенежныхСредств.ТипКомиссии КАК chargeDetails,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ВидОперации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ВидОперации""
		|	КОНЕЦ КАК singlePaymentOrderИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета контрагента""
		|	КОНЕЦ КАК creditАccountNumberИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета контрагента""
		|	КОНЕЦ КАК creditАccountCurrencyCodeИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета организации""
		|	КОНЕЦ КАК debitАccountNumberИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета организации""
		|	КОНЕЦ КАК debitАccountCurrencyCodeИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""номер документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""номер документа""
		|	КОНЕЦ КАК documentNumberИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Сумма документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Сумма документа""
		|	КОНЕЦ КАК amountИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименоваине валюты документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименоваине валюты документа""
		|	КОНЕЦ КАК currencyИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ КАК descriptionИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ КАК additionalDescriptionИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование контрагента""
		|	КОНЕЦ КАК beneficiaryNameИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ИНН Контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ИНН Контрагента""
		|	КОНЕЦ КАК beneficiaryTaxCodeИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование страны регистрации контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование страны регистрации контрагента""
		|	КОНЕЦ КАК beneficiaryAddressИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT банка контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT банка контрагента""
		|	КОНЕЦ КАК beneficiaryBankCodeИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование банка контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование банка контрагента""
		|	КОНЕЦ КАК beneficiaryBankNameИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT промежуточного банка""
		|	КОНЕЦ КАК intermediaryBankCodeИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование промежуточного банка""
		|	КОНЕЦ КАК intermediaryBankNameИмяРеквизита,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Тип комиссии""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Тип комиссии""
		|	КОНЕЦ КАК chargeDetailsИмяРеквизита,
		|	NULL КАК Сотрудник,
		|	NULL КАК taxpayerCode,
		|	NULL КАК taxpayerName,
		|	NULL КАК treasuryCode,
		|	NULL КАК taxpayerCodeИмяРеквизита,
		|	NULL КАК taxpayerNameИмяРеквизита,
		|	NULL КАК treasuryCodeИмяРеквизита
		|ПОМЕСТИТЬ ВТ_ДанныеДокументов
		|ИЗ
		|	Документ.РасходДенежныхСредств КАК РасходДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента
		|		ПО РасходДенежныхСредств.Контрагент = КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Ссылка
		|			И (КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента
		|		ПО РасходДенежныхСредств.Контрагент = КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Ссылка
		|			И (КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента))
		|ГДЕ
		|	РасходДенежныхСредств.Ссылка В
		|			(ВЫБРАТЬ
		|				а.Ссылка
		|			ИЗ
		|				ВТ_ПредПроверка КАК а
		|			ГДЕ
		|				а.РазрешеноВыгрузить)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Конвертация.Ссылка,
		|	0,
		|	""TransferToOwnAccountPaymentOrderIo"",
		|	ПОДСТРОКА(Конвертация.Получатель.НомерСчета, 0, 22),
		|	Конвертация.Получатель.ВалютаДенежныхСредств.Наименование,
		|	ПОДСТРОКА(Конвертация.Отправитель.НомерСчета, 0, 22),
		|	Конвертация.Отправитель.ВалютаДенежныхСредств.Наименование,
		|	Конвертация.Номер,
		|	Конвертация.СуммаКонвертации,
		|	Конвертация.Отправитель.ВалютаДенежныхСредств.Наименование,
		|	Конвертация.НазначениеПлатежа,
		|	Конвертация.Комментарий,
		|	Конвертация.Организация.Наименование,
		|	Конвертация.Организация.ИНН,
		|	"""",
		|	Конвертация.Получатель.Банк.СВИФТБИК,
		|	Конвертация.Получатель.Банк.Представление,
		|	"""",
		|	"""",
		|	"""",
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ВидОперации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ВидОперации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета организации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета организации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""номер документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""номер документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Сумма документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Сумма документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименоваине валюты документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименоваине валюты документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ИНН Контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ИНН Контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование страны регистрации контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование страны регистрации контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT банка контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT банка контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование банка контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование банка контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Тип комиссии""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Тип комиссии""
		|	КОНЕЦ,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.Конвертация КАК Конвертация
		|ГДЕ
		|	Конвертация.Ссылка В
		|			(ВЫБРАТЬ
		|				а.Ссылка
		|			ИЗ
		|				ВТ_ПредПроверка КАК а
		|			ГДЕ
		|				а.РазрешеноВыгрузить)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратДенежныхСредствПокупателю.Ссылка,
		|	0,
		|	ВЫБОР
		|		КОГДА ВозвратДенежныхСредствПокупателю.ВалютаДокумента = &НацВалюта
		|				И ВозвратДенежныхСредствПокупателю.БанковскийСчетКасса.Банк.СВИФТБИК = ВозвратДенежныхСредствПокупателю.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferWithinBankPaymentOrderIo""
		|		КОГДА ВозвратДенежныхСредствПокупателю.ВалютаДокумента <> &НацВалюта
		|				И ВозвратДенежныхСредствПокупателю.БанковскийСчетКасса.Банк.СВИФТБИК = ВозвратДенежныхСредствПокупателю.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferWithinBankPaymentOrderIo""
		|		КОГДА ВозвратДенежныхСредствПокупателю.ВалютаДокумента = &НацВалюта
		|				И ВозвратДенежныхСредствПокупателю.БанковскийСчетКасса.Банк.СВИФТБИК <> ВозвратДенежныхСредствПокупателю.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferToOtherBankNationalCurrencyPaymentOrderIo""
		|		КОГДА ВозвратДенежныхСредствПокупателю.ВалютаДокумента <> &НацВалюта
		|				И ВозвратДенежныхСредствПокупателю.БанковскийСчетКасса.Банк.СВИФТБИК <> ВозвратДенежныхСредствПокупателю.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferToOtherBankForeignCurrencyPaymentOrderIo""
		|	КОНЕЦ,
		|	ПОДСТРОКА(ВозвратДенежныхСредствПокупателю.СчетКонтрагента.НомерСчета, 0, 22),
		|	ВозвратДенежныхСредствПокупателю.СчетКонтрагента.ВалютаДенежныхСредств.Наименование,
		|	ПОДСТРОКА(ВозвратДенежныхСредствПокупателю.БанковскийСчетКасса.НомерСчета, 0, 22),
		|	ВозвратДенежныхСредствПокупателю.БанковскийСчетКасса.ВалютаДенежныхСредств.Наименование,
		|	ВозвратДенежныхСредствПокупателю.Номер,
		|	ВозвратДенежныхСредствПокупателю.СуммаДокумента,
		|	ВозвратДенежныхСредствПокупателю.ВалютаДокумента.Наименование,
		|	ВозвратДенежныхСредствПокупателю.НазначениеПлатежа,
		|	ВозвратДенежныхСредствПокупателю.Комментарий,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВозвратДенежныхСредствПокупателю.Контрагент.НаименованиеПолное КАК СТРОКА(150))) = """"
		|			ТОГДА ВозвратДенежныхСредствПокупателю.Контрагент.Наименование
		|		ИНАЧЕ ВозвратДенежныхСредствПокупателю.Контрагент.НаименованиеПолное
		|	КОНЕЦ,
		|	ВозвратДенежныхСредствПокупателю.Контрагент.ИНН,
		|	ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Представление, ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Представление, """")),
		|	ВозвратДенежныхСредствПокупателю.СчетКонтрагента.Банк.СВИФТБИК,
		|	ВозвратДенежныхСредствПокупателю.СчетКонтрагента.Банк.Представление,
		|	ВозвратДенежныхСредствПокупателю.ПромежуточныйБанк.СВИФТБИК,
		|	ВозвратДенежныхСредствПокупателю.ПромежуточныйБанк.Представление,
		|	ВозвратДенежныхСредствПокупателю.ТипКомиссии,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ВидОперации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ВидОперации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета организации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета организации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""номер документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""номер документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Сумма документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Сумма документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименоваине валюты документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименоваине валюты документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ИНН Контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ИНН Контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование страны регистрации контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование страны регистрации контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT банка контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT банка контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование банка контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование банка контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Тип комиссии""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Тип комиссии""
		|	КОНЕЦ,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.ВозвратДенежныхСредствПокупателю КАК ВозвратДенежныхСредствПокупателю
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента
		|		ПО ВозвратДенежныхСредствПокупателю.Контрагент = КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Ссылка
		|			И (КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента
		|		ПО ВозвратДенежныхСредствПокупателю.Контрагент = КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Ссылка
		|			И (КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента))
		|ГДЕ
		|	ВозвратДенежныхСредствПокупателю.Ссылка В
		|			(ВЫБРАТЬ
		|				а.Ссылка
		|			ИЗ
		|				ВТ_ПредПроверка КАК а
		|			ГДЕ
		|				а.РазрешеноВыгрузить)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыплатаДенежныхСредств.Ссылка,
		|	0,
		|	ВЫБОР
		|		КОГДА ВыплатаДенежныхСредств.ВалютаДокумента = &НацВалюта
		|				И ВыплатаДенежныхСредств.БанковскийСчетКасса.Банк.СВИФТБИК = ВыплатаДенежныхСредств.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferWithinBankPaymentOrderIo""
		|		КОГДА ВыплатаДенежныхСредств.ВалютаДокумента <> &НацВалюта
		|				И ВыплатаДенежныхСредств.БанковскийСчетКасса.Банк.СВИФТБИК = ВыплатаДенежныхСредств.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferWithinBankPaymentOrderIo""
		|		КОГДА ВыплатаДенежныхСредств.ВалютаДокумента = &НацВалюта
		|				И ВыплатаДенежныхСредств.БанковскийСчетКасса.Банк.СВИФТБИК <> ВыплатаДенежныхСредств.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferToOtherBankNationalCurrencyPaymentOrderIo""
		|		КОГДА ВыплатаДенежныхСредств.ВалютаДокумента <> &НацВалюта
		|				И ВыплатаДенежныхСредств.БанковскийСчетКасса.Банк.СВИФТБИК <> ВыплатаДенежныхСредств.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferToOtherBankForeignCurrencyPaymentOrderIo""
		|	КОНЕЦ,
		|	ПОДСТРОКА(ВыплатаДенежныхСредств.СчетКонтрагента.НомерСчета, 0, 22),
		|	ВыплатаДенежныхСредств.СчетКонтрагента.ВалютаДенежныхСредств.Наименование,
		|	ПОДСТРОКА(ВыплатаДенежныхСредств.БанковскийСчетКасса.НомерСчета, 0, 22),
		|	ВыплатаДенежныхСредств.БанковскийСчетКасса.ВалютаДенежныхСредств.Наименование,
		|	ВыплатаДенежныхСредств.Номер,
		|	ВыплатаДенежныхСредств.СуммаДокумента,
		|	ВыплатаДенежныхСредств.ВалютаДокумента.Наименование,
		|	ВыплатаДенежныхСредств.НазначениеПлатежа,
		|	ВыплатаДенежныхСредств.Комментарий,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВыплатаДенежныхСредств.Контрагент.НаименованиеПолное КАК СТРОКА(150))) = """"
		|			ТОГДА ВыплатаДенежныхСредств.Контрагент.Наименование
		|		ИНАЧЕ ВыплатаДенежныхСредств.Контрагент.НаименованиеПолное
		|	КОНЕЦ,
		|	ВыплатаДенежныхСредств.Контрагент.ИНН,
		|	ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Представление, ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Представление, """")),
		|	ВыплатаДенежныхСредств.СчетКонтрагента.Банк.СВИФТБИК,
		|	ВыплатаДенежныхСредств.СчетКонтрагента.Банк.Представление,
		|	ВыплатаДенежныхСредств.ПромежуточныйБанк.СВИФТБИК,
		|	ВыплатаДенежныхСредств.ПромежуточныйБанк.Представление,
		|	ВыплатаДенежныхСредств.ТипКомиссии,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ВидОперации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ВидОперации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета организации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета организации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""номер документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""номер документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Сумма документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Сумма документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименоваине валюты документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименоваине валюты документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ИНН Контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ИНН Контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование страны регистрации контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование страны регистрации контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT банка контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT банка контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование банка контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование банка контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Тип комиссии""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Тип комиссии""
		|	КОНЕЦ,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.ВыплатаДенежныхСредств КАК ВыплатаДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента
		|		ПО ВыплатаДенежныхСредств.Контрагент = КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Ссылка
		|			И (КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента
		|		ПО ВыплатаДенежныхСредств.Контрагент = КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Ссылка
		|			И (КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента))
		|ГДЕ
		|	ВыплатаДенежныхСредств.Ссылка В
		|			(ВЫБРАТЬ
		|				а.Ссылка
		|			ИЗ
		|				ВТ_ПредПроверка КАК а
		|			ГДЕ
		|				а.РазрешеноВыгрузить)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПеремещениеДенежныхСредств.Ссылка,
		|	0,
		|	ВЫБОР
		|		КОГДА ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.Сотрудники
		|			ТОГДА ВЫБОР
		|					КОГДА ПеремещениеДенежныхСредств.БанковскийСчетКассаОтправитель.Банк.СВИФТБИК = ПеремещениеДенежныхСредств.СчетСотрудника.Банк.СВИФТБИК
		|						ТОГДА ""TransferToOwnAccountPaymentOrderIo""
		|					КОГДА ПеремещениеДенежныхСредств.ВалютаДокумента = &НацВалюта
		|							И ПеремещениеДенежныхСредств.БанковскийСчетКассаОтправитель.Банк.СВИФТБИК <> ПеремещениеДенежныхСредств.СчетСотрудника.Банк.СВИФТБИК
		|						ТОГДА ""TransferToOtherBankNationalCurrencyPaymentOrderIo""
		|					КОГДА ПеремещениеДенежныхСредств.ВалютаДокумента <> &НацВалюта
		|							И ПеремещениеДенежныхСредств.БанковскийСчетКассаОтправитель.Банк.СВИФТБИК <> ПеремещениеДенежныхСредств.СчетСотрудника.Банк.СВИФТБИК
		|						ТОГДА ""TransferToOtherBankForeignCurrencyPaymentOrderIo""
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ПеремещениеДенежныхСредств.БанковскийСчетКассаОтправитель.Банк.СВИФТБИК = ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель.Банк.СВИФТБИК
		|					ТОГДА ""TransferToOwnAccountPaymentOrderIo""
		|				КОГДА ПеремещениеДенежныхСредств.ВалютаДокумента = &НацВалюта
		|						И ПеремещениеДенежныхСредств.БанковскийСчетКассаОтправитель.Банк.СВИФТБИК <> ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель.Банк.СВИФТБИК
		|					ТОГДА ""TransferToOtherBankNationalCurrencyPaymentOrderIo""
		|				КОГДА ПеремещениеДенежныхСредств.ВалютаДокумента <> &НацВалюта
		|						И ПеремещениеДенежныхСредств.БанковскийСчетКассаОтправитель.Банк.СВИФТБИК <> ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель.Банк.СВИФТБИК
		|					ТОГДА ""TransferToOtherBankForeignCurrencyPaymentOrderIo""
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.Сотрудники
		|			ТОГДА ПОДСТРОКА(ПеремещениеДенежныхСредств.СчетСотрудника.НомерСчета, 0, 22)
		|		ИНАЧЕ ПОДСТРОКА(ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель.НомерСчета, 0, 22)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.Сотрудники
		|			ТОГДА ПеремещениеДенежныхСредств.СчетСотрудника.ВалютаДенежныхСредств.Наименование
		|		ИНАЧЕ ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель.ВалютаДенежныхСредств.Наименование
		|	КОНЕЦ,
		|	ПОДСТРОКА(ПеремещениеДенежныхСредств.БанковскийСчетКассаОтправитель.НомерСчета, 0, 22),
		|	ПеремещениеДенежныхСредств.БанковскийСчетКассаОтправитель.ВалютаДенежныхСредств.Наименование,
		|	ПеремещениеДенежныхСредств.Номер,
		|	ПеремещениеДенежныхСредств.СуммаДокумента,
		|	ПеремещениеДенежныхСредств.ВалютаДокумента.Наименование,
		|	ПеремещениеДенежныхСредств.НазначениеПлатежа,
		|	ПеремещениеДенежныхСредств.Комментарий,
		|	ВЫБОР
		|		КОГДА ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.Сотрудники
		|			ТОГДА ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель.Наименование
		|		ИНАЧЕ ПеремещениеДенежныхСредств.Организация.Наименование
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.Сотрудники
		|			ТОГДА ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель.ИНН
		|		ИНАЧЕ ПеремещениеДенежныхСредств.Организация.ИНН
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.Сотрудники
		|			ТОГДА ЕСТЬNULL(СотрудникиКонтактнаяИнформацияАдресМестаПроживанияСотрудники.Представление, ЕСТЬNULL(СотрудникиКонтактнаяИнформацияАдресПоПропискеСотрудники.Представление, """"))
		|		ИНАЧЕ ЕСТЬNULL(ОрганизацииКонтактнаяИнформацияФактическийАдресОрганизации.Представление, ЕСТЬNULL(ОрганизацииКонтактнаяИнформацияЮридическийАдресОрганизации.Представление, """"))
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.Сотрудники
		|			ТОГДА ПеремещениеДенежныхСредств.СчетСотрудника.Банк.СВИФТБИК
		|		ИНАЧЕ ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель.Банк.СВИФТБИК
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.Сотрудники
		|			ТОГДА ПеремещениеДенежныхСредств.СчетСотрудника.Банк.Представление
		|		ИНАЧЕ ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель.Банк.Представление
		|	КОНЕЦ,
		|	"""",
		|	"""",
		|	ПеремещениеДенежныхСредств.ТипКомиссии,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ВидОперации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ВидОперации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета получателя""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета получателя""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета получателя""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета получателя""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета отправителя""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета отправителя""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета отправителя""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета отправителя""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""номер документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""номер документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Сумма документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Сумма документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименоваине валюты документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименоваине валюты документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование получателя""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование получателя""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ИНН получателя""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ИНН получателя""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование страны регистрации получателя""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование страны регистрации получателя""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT банка получателя""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT банка получателя""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование банка получателя""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование банка получателя""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Тип комиссии""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Тип комиссии""
		|	КОНЕЦ,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформацияФактическийАдресОрганизации
		|		ПО ПеремещениеДенежныхСредств.Организация = ОрганизацииКонтактнаяИнформацияФактическийАдресОрганизации.Ссылка
		|			И (ОрганизацииКонтактнаяИнформацияФактическийАдресОрганизации.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактическийАдресОрганизации))
		|			И (ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.БанковскиеСчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформацияЮридическийАдресОрганизации
		|		ПО ПеремещениеДенежныхСредств.Организация = ОрганизацииКонтактнаяИнформацияЮридическийАдресОрганизации.Ссылка
		|			И (ОрганизацииКонтактнаяИнформацияЮридическийАдресОрганизации.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдресОрганизации))
		|			И (ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.БанковскиеСчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформацияАдресПоПропискеСотрудники
		|		ПО ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель = СотрудникиКонтактнаяИнформацияАдресПоПропискеСотрудники.Ссылка
		|			И (СотрудникиКонтактнаяИнформацияАдресПоПропискеСотрудники.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеСотрудники))
		|			И (ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.Сотрудники)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформацияАдресМестаПроживанияСотрудники
		|		ПО ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель = СотрудникиКонтактнаяИнформацияАдресМестаПроживанияСотрудники.Ссылка
		|			И (СотрудникиКонтактнаяИнформацияАдресМестаПроживанияСотрудники.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияСотрудники))
		|			И (ПеремещениеДенежныхСредств.БанковскийСчетКассаПолучатель ССЫЛКА Справочник.Сотрудники)
		|ГДЕ
		|	ПеремещениеДенежныхСредств.Ссылка В
		|			(ВЫБРАТЬ
		|				а.Ссылка
		|			ИЗ
		|				ВТ_ПредПроверка КАК а
		|			ГДЕ
		|				а.РазрешеноВыгрузить)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОплатаНалогов.Ссылка,
		|	0,
		|	""TreasuryTransferPaymentOrderIo"",
		|	NULL,
		|	NULL,
		|	ПОДСТРОКА(ОплатаНалогов.БанковскийСчетКасса.НомерСчета, 0, 22),
		|	ОплатаНалогов.БанковскийСчетКасса.ВалютаДенежныхСредств.Наименование,
		|	ОплатаНалогов.Номер,
		|	ОплатаНалогов.СуммаДокумента,
		|	ОплатаНалогов.ВалютаДокумента.Наименование,
		|	ОплатаНалогов.НазначениеПлатежа,
		|	ОплатаНалогов.НазначениеПлатежа,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ВидОперации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ВидОперации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета организации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета организации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""номер документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""номер документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Сумма документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Сумма документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименоваине валюты документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименоваине валюты документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ИНН Контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ИНН Контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование страны регистрации контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование страны регистрации контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT банка контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT банка контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование банка контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование банка контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Тип комиссии""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Тип комиссии""
		|	КОНЕЦ,
		|	NULL,
		|	ВЫБОР
		|		КОГДА ОплатаНалогов.ОплатаЗаДругуюКомпанию = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ОплатаНалогов.ОплатаЗаДругуюКомпанию.ИНН
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ОплатаНалогов.ОплатаЗаДругуюКомпанию = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ОплатаНалогов.ОплатаЗаДругуюКомпанию.Наименование
		|	КОНЕЦ,
		|	ПОДСТРОКА(ОплатаНалогов.СчетКонтрагента.НомерСчета, 0, 9),
		|	NULL,
		|	NULL,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Код казначейства""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""სახაზინო კოდი""
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОплатаНалогов КАК ОплатаНалогов
		|ГДЕ
		|	ОплатаНалогов.Ссылка В
		|			(ВЫБРАТЬ
		|				а.Ссылка
		|			ИЗ
		|				ВТ_ПредПроверка КАК а
		|			ГДЕ
		|				а.РазрешеноВыгрузить)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОплатаВПенсионныйФонд.Ссылка,
		|	0,
		|	ВЫБОР
		|		КОГДА ОплатаВПенсионныйФонд.ВалютаДокумента = &НацВалюта
		|				И ОплатаВПенсионныйФонд.БанковскийСчетКасса.Банк.СВИФТБИК = ОплатаВПенсионныйФонд.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferWithinBankPaymentOrderIo""
		|		КОГДА ОплатаВПенсионныйФонд.ВалютаДокумента <> &НацВалюта
		|				И ОплатаВПенсионныйФонд.БанковскийСчетКасса.Банк.СВИФТБИК = ОплатаВПенсионныйФонд.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferWithinBankPaymentOrderIo""
		|		КОГДА ОплатаВПенсионныйФонд.ВалютаДокумента = &НацВалюта
		|				И ОплатаВПенсионныйФонд.БанковскийСчетКасса.Банк.СВИФТБИК <> ОплатаВПенсионныйФонд.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferToOtherBankNationalCurrencyPaymentOrderIo""
		|		КОГДА ОплатаВПенсионныйФонд.ВалютаДокумента <> &НацВалюта
		|				И ОплатаВПенсионныйФонд.БанковскийСчетКасса.Банк.СВИФТБИК <> ОплатаВПенсионныйФонд.СчетКонтрагента.Банк.СВИФТБИК
		|			ТОГДА ""TransferToOtherBankForeignCurrencyPaymentOrderIo""
		|	КОНЕЦ,
		|	ПОДСТРОКА(ОплатаВПенсионныйФонд.СчетКонтрагента.НомерСчета, 0, 22),
		|	ОплатаВПенсионныйФонд.СчетКонтрагента.ВалютаДенежныхСредств.Наименование,
		|	ПОДСТРОКА(ОплатаВПенсионныйФонд.БанковскийСчетКасса.НомерСчета, 0, 22),
		|	ОплатаВПенсионныйФонд.БанковскийСчетКасса.ВалютаДенежныхСредств.Наименование,
		|	ОплатаВПенсионныйФонд.Номер,
		|	ОплатаВПенсионныйФонд.СуммаДокумента,
		|	ОплатаВПенсионныйФонд.ВалютаДокумента.Наименование,
		|	ОплатаВПенсионныйФонд.НазначениеПлатежа,
		|	ОплатаВПенсионныйФонд.Комментарий,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ОплатаВПенсионныйФонд.Контрагент.НаименованиеПолное КАК СТРОКА(150))) = """"
		|			ТОГДА ОплатаВПенсионныйФонд.Контрагент.Наименование
		|		ИНАЧЕ ОплатаВПенсионныйФонд.Контрагент.НаименованиеПолное
		|	КОНЕЦ,
		|	ОплатаВПенсионныйФонд.Контрагент.ИНН,
		|	ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Представление, ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Представление, """")),
		|	ОплатаВПенсионныйФонд.СчетКонтрагента.Банк.СВИФТБИК,
		|	ОплатаВПенсионныйФонд.СчетКонтрагента.Банк.Представление,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ВидОперации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ВидОперации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета пенсионного фонда""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета пенсионного фонда""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета пенсионного фонда""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета пенсионного фонда""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета организации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета организации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""номер документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""номер документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Сумма документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Сумма документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименоваине валюты документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименоваине валюты документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ИНН Контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ИНН Контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование страны регистрации контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование страны регистрации контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT банка контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT банка контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование банка контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование банка контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Тип комиссии""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Тип комиссии""
		|	КОНЕЦ,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.ОплатаВПенсионныйФонд КАК ОплатаВПенсионныйФонд
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента
		|		ПО ОплатаВПенсионныйФонд.Контрагент = КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Ссылка
		|			И (КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента
		|		ПО ОплатаВПенсионныйФонд.Контрагент = КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Ссылка
		|			И (КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента))
		|ГДЕ
		|	ОплатаВПенсионныйФонд.Ссылка В
		|			(ВЫБРАТЬ
		|				а.Ссылка
		|			ИЗ
		|				ВТ_ПредПроверка КАК а
		|			ГДЕ
		|				а.РазрешеноВыгрузить)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыплатаЗарплатыВыплаты.Ссылка,
		|	ВыплатаЗарплатыВыплаты.НомерСтроки,
		|	ВЫБОР
		|		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента = &НацВалюта
		|				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК = ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
		|			ТОГДА ""TransferWithinBankPaymentOrderIo""
		|		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента <> &НацВалюта
		|				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК = ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
		|			ТОГДА ""TransferWithinBankPaymentOrderIo""
		|		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента = &НацВалюта
		|				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК <> ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
		|			ТОГДА ""TransferToOtherBankNationalCurrencyPaymentOrderIo""
		|		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента <> &НацВалюта
		|				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК <> ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
		|			ТОГДА ""TransferToOtherBankForeignCurrencyPaymentOrderIo""
		|	КОНЕЦ,
		|	ПОДСТРОКА(ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.НомерСчета, 0, 22),
		|	ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.ВалютаДенежныхСредств.Наименование,
		|	ПОДСТРОКА(ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.НомерСчета, 0, 22),
		|	ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.ВалютаДенежныхСредств.Наименование,
		|	ВыплатаЗарплатыВыплаты.Ссылка.Номер,
		|	ВыплатаЗарплатыВыплаты.Сумма,
		|	ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента.Наименование,
		|	ВыплатаЗарплатыВыплаты.Ссылка.НазначениеПлатежа,
		|	ВыплатаЗарплатыВыплаты.Ссылка.Комментарий,
		|	ВыплатаЗарплатыВыплаты.Сотрудник.Наименование,
		|	ВыплатаЗарплатыВыплаты.Сотрудник.ИНН,
		|	ЕСТЬNULL(СотрудникиКонтактнаяИнформацияАдресМестаПроживанияСотрудники.Представление, ЕСТЬNULL(СотрудникиКонтактнаяИнформацияАдресПоПропискеСотрудники.Представление, """")),
		|	ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК,
		|	ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.Представление,
		|	NULL,
		|	NULL,
		|	ВыплатаЗарплатыВыплаты.Ссылка.ТипКомиссии,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ВидОперации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ВидОперации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета сотрудника""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета сотрудника""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета сотрудника""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета сотрудника""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета организации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета организации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""номер документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""номер документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Сумма к выплате""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Сумма к выплате""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименоваине валюты документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименоваине валюты документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ФИО сотрудника""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ФИО сотрудника""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ИНН сотрудника""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ИНН сотрудника""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Адрес сотрудника""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Адрес сотрудника""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT банка сотрудника""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT банка сотрудника""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование банка сотрудника""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование банка сотрудника""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Тип комиссии""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Тип комиссии""
		|	КОНЕЦ,
		|	ВыплатаЗарплатыВыплаты.Сотрудник,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.ВыплатаЗарплаты.Выплаты КАК ВыплатаЗарплатыВыплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформацияАдресПоПропискеСотрудники
		|		ПО ВыплатаЗарплатыВыплаты.Сотрудник = СотрудникиКонтактнаяИнформацияАдресПоПропискеСотрудники.Ссылка
		|			И (СотрудникиКонтактнаяИнформацияАдресПоПропискеСотрудники.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеСотрудники))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформацияАдресМестаПроживанияСотрудники
		|		ПО ВыплатаЗарплатыВыплаты.Сотрудник = СотрудникиКонтактнаяИнформацияАдресМестаПроживанияСотрудники.Ссылка
		|			И (СотрудникиКонтактнаяИнформацияАдресМестаПроживанияСотрудники.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияСотрудники))
		|ГДЕ
		|	(ВыплатаЗарплатыВыплаты.Ссылка, ВыплатаЗарплатыВыплаты.НомерСтроки) В
		|			(ВЫБРАТЬ
		|				а.Ссылка,
		|				а.НомерСтроки
		|			ИЗ
		|				ВТ_ПредПроверка КАК а
		|			ГДЕ
		|				а.РазрешеноВыгрузить)
		|	И НЕ ВыплатаЗарплатыВыплаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыплатыЗарплаты.ОплатаУдержанийДляКонтрагента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыплатаЗарплатыВыплаты.Ссылка,
		|	ВыплатаЗарплатыВыплаты.НомерСтроки,
		|	ВЫБОР
		|		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента = &НацВалюта
		|				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК = ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
		|			ТОГДА ""TransferWithinBankPaymentOrderIo""
		|		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента <> &НацВалюта
		|				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК = ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
		|			ТОГДА ""TransferWithinBankPaymentOrderIo""
		|		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента = &НацВалюта
		|				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК <> ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
		|			ТОГДА ""TransferToOtherBankNationalCurrencyPaymentOrderIo""
		|		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента <> &НацВалюта
		|				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК <> ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
		|			ТОГДА ""TransferToOtherBankForeignCurrencyPaymentOrderIo""
		|	КОНЕЦ,
		|	ПОДСТРОКА(ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.НомерСчета, 0, 22),
		|	ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.ВалютаДенежныхСредств.Наименование,
		|	ПОДСТРОКА(ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.НомерСчета, 0, 22),
		|	ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.ВалютаДенежныхСредств.Наименование,
		|	ВыплатаЗарплатыВыплаты.Ссылка.Номер,
		|	ВыплатаЗарплатыВыплаты.Сумма,
		|	ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента.Наименование,
		|	ВыплатаЗарплатыВыплаты.Ссылка.НазначениеПлатежа,
		|	ВыплатаЗарплатыВыплаты.Ссылка.Комментарий,
		|	ВыплатаЗарплатыВыплаты.Контрагент.Наименование,
		|	ВыплатаЗарплатыВыплаты.Контрагент.ИНН,
		|	ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Представление, ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Представление, """")),
		|	ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК,
		|	ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.Представление,
		|	NULL,
		|	NULL,
		|	ВыплатаЗарплатыВыплаты.Ссылка.ТипКомиссии,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ВидОперации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ВидОперации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Номер счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Номер счета организации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование валюты счета организации""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование валюты счета организации""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""номер документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""номер документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Сумма к выплате""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Сумма к выплате""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименоваине валюты документа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименоваине валюты документа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""НазначениеПлатежа""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""НазначениеПлатежа""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""ИНН контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""ИНН контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Адрес контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Адрес контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT банка контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT банка контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование банка контрагента""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование банка контрагента""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""SWIFT промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""SWIFT промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Наименование промежуточного банка""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Наименование промежуточного банка""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &КодЯзвка = ""ru""
		|			ТОГДА ""Тип комиссии""
		|		КОГДА &КодЯзвка = ""ka""
		|			ТОГДА ""Тип комиссии""
		|	КОНЕЦ,
		|	ВыплатаЗарплатыВыплаты.Контрагент,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.ВыплатаЗарплаты.Выплаты КАК ВыплатаЗарплатыВыплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента
		|		ПО ВыплатаЗарплатыВыплаты.Контрагент = КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Ссылка
		|			И (КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента
		|		ПО ВыплатаЗарплатыВыплаты.Контрагент = КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Ссылка
		|			И (КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента))
		|ГДЕ
		|	(ВыплатаЗарплатыВыплаты.Ссылка, ВыплатаЗарплатыВыплаты.НомерСтроки) В
		|			(ВЫБРАТЬ
		|				а.Ссылка,
		|				а.НомерСтроки
		|			ИЗ
		|				ВТ_ПредПроверка КАК а
		|			ГДЕ
		|				а.РазрешеноВыгрузить)
		|	И ВыплатаЗарплатыВыплаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыплатыЗарплаты.ОплатаУдержанийДляКонтрагента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПредПроверка.Ссылка КАК Ссылка,
		|	ВТ_ПредПроверка.ТекущийСтатусДокумента КАК ТекущийСтатусДокумента,
		|	ВТ_ПредПроверка.УИД КАК singlePaymentRequestId,
		|	ВТ_ПредПроверка.РазрешеноВыгрузить КАК РазрешеноВыгрузить,
		|	ВТ_ПредПроверка.ОписатниеЗапрета КАК ОписатниеЗапрета,
		|	ВТ_ДанныеДокументов.НомерСтроки КАК position,
		|	ВТ_ДанныеДокументов.singlePaymentOrder КАК singlePaymentOrder,
		|	ВТ_ДанныеДокументов.creditАccountNumber КАК CreditАccountNumber,
		|	ВТ_ДанныеДокументов.creditАccountCurrencyCode КАК CreditАccountCurrencyCode,
		|	ВТ_ДанныеДокументов.debitАccountNumber КАК DebitАccountNumber,
		|	ВТ_ДанныеДокументов.debitАccountCurrencyCode КАК DebitАccountCurrencyCode,
		|	ВТ_ДанныеДокументов.documentNumber КАК documentNumber,
		|	ВТ_ДанныеДокументов.amount КАК amount,
		|	ВТ_ДанныеДокументов.currency КАК currency,
		|	ВТ_ДанныеДокументов.description КАК description,
		|	ВТ_ДанныеДокументов.additionalDescription КАК additionalDescription,
		|	ВТ_ДанныеДокументов.beneficiaryName КАК beneficiaryName,
		|	ВТ_ДанныеДокументов.beneficiaryTaxCode КАК beneficiaryTaxCode,
		|	ВТ_ДанныеДокументов.beneficiaryAddress КАК beneficiaryAddress,
		|	ВТ_ДанныеДокументов.beneficiaryBankCode КАК beneficiaryBankCode,
		|	ВТ_ДанныеДокументов.beneficiaryBankName КАК beneficiaryBankName,
		|	ВТ_ДанныеДокументов.intermediaryBankCode КАК intermediaryBankCode,
		|	ВТ_ДанныеДокументов.intermediaryBankName КАК intermediaryBankName,
		|	ВТ_ДанныеДокументов.chargeDetails КАК chargeDetails,
		|	ВТ_ДанныеДокументов.singlePaymentOrderИмяРеквизита КАК singlePaymentOrderИмяРеквизита,
		|	ВТ_ДанныеДокументов.creditАccountNumberИмяРеквизита КАК CreditАccountNumberИмяРеквизита,
		|	ВТ_ДанныеДокументов.creditАccountCurrencyCodeИмяРеквизита КАК CreditАccountCurrencyCodeCodeИмяРеквизита,
		|	ВТ_ДанныеДокументов.debitАccountNumberИмяРеквизита КАК DebitАccountNumberИмяРеквизита,
		|	ВТ_ДанныеДокументов.debitАccountCurrencyCodeИмяРеквизита КАК DebitАccountCurrencyCodeИмяРеквизита,
		|	ВТ_ДанныеДокументов.documentNumberИмяРеквизита КАК documentNumberИмяРеквизита,
		|	ВТ_ДанныеДокументов.amountИмяРеквизита КАК amountИмяРеквизита,
		|	ВТ_ДанныеДокументов.currencyИмяРеквизита КАК currencyИмяРеквизита,
		|	ВТ_ДанныеДокументов.descriptionИмяРеквизита КАК descriptionИмяРеквизита,
		|	ВТ_ДанныеДокументов.additionalDescriptionИмяРеквизита КАК additionalDescriptionИмяРеквизита,
		|	ВТ_ДанныеДокументов.beneficiaryNameИмяРеквизита КАК beneficiaryNameИмяРеквизита,
		|	ВТ_ДанныеДокументов.beneficiaryTaxCodeИмяРеквизита КАК beneficiaryTaxCodeИмяРеквизита,
		|	ВТ_ДанныеДокументов.beneficiaryAddressИмяРеквизита КАК beneficiaryAddressИмяРеквизита,
		|	ВТ_ДанныеДокументов.beneficiaryBankCodeИмяРеквизита КАК beneficiaryBankCodeИмяРеквизита,
		|	ВТ_ДанныеДокументов.beneficiaryBankNameИмяРеквизита КАК beneficiaryBankNameИмяРеквизита,
		|	ВТ_ДанныеДокументов.intermediaryBankCodeИмяРеквизита КАК intermediaryBankCodeИмяРеквизита,
		|	ВТ_ДанныеДокументов.intermediaryBankNameИмяРеквизита КАК intermediaryBankNameИмяРеквизита,
		|	ВТ_ДанныеДокументов.chargeDetailsИмяРеквизита КАК chargeDetailsИмяРеквизита,
		|	ВТ_ДанныеДокументов.Сотрудник КАК Сотрудник,
		|	ВТ_ДанныеДокументов.taxpayerCode КАК taxpayerCode,
		|	ВТ_ДанныеДокументов.taxpayerName КАК taxpayerName,
		|	ВТ_ДанныеДокументов.treasuryCode КАК treasuryCode,
		|	ВТ_ДанныеДокументов.taxpayerCodeИмяРеквизита КАК taxpayerCodeИмяРеквизита,
		|	ВТ_ДанныеДокументов.taxpayerNameИмяРеквизита КАК taxpayerNameИмяРеквизита,
		|	ВТ_ДанныеДокументов.treasuryCodeИмяРеквизита КАК treasuryCodeИмяРеквизита
		|ИЗ
		|	ВТ_ПредПроверка КАК ВТ_ПредПроверка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокументов КАК ВТ_ДанныеДокументов
		|		ПО ВТ_ПредПроверка.Ссылка = ВТ_ДанныеДокументов.Ссылка
		|			И ВТ_ПредПроверка.НомерСтроки = ВТ_ДанныеДокументов.НомерСтроки";
	
	Запрос.УстановитьПараметр("МассивДокументов", СтруктураПарметровЗапросаВБанк.МассивДокументов);
	Запрос.УстановитьПараметр("НацВалюта", СтруктураПарметровЗапросаВБанк.ВалютаУчета);
	Запрос.УстановитьПараметр("КодЯзвка", ПользователиИнформационнойБазы.ТекущийПользователь().Язык.КодЯзыка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции

Функция ПолучитьВыборкуПакетногоЗаполненияПоДокументам(СтруктураПарметровЗапросаВБанк)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ВыплатаЗарплатыВыплаты.Ссылка КАК Ссылка,
		|	ВыплатаЗарплатыВыплаты.НомерСтроки КАК НомерСтроки,
	    |	ПРЕДСТАВЛЕНИЕ(ВыплатаЗарплатыВыплаты.Ссылка) КАК ИмяПакета,
	    |	ЕСТЬNULL(СтатусыДокументовВИнтернетБанкеСрезПоследних.СтатусДокументаВИнтернетБанке, ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовВИНтернетБанке.ПрисутствуетТолькоВТекущейБазе)) КАК ТекущийСтатусДокумента,
	    |	ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") КАК УИД,
	    |	ВЫБОР
	    |		КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") = """"
	    |				И ВыплатаЗарплатыВыплаты.Ссылка.Проведен
	    |				И НЕ ВыплатаЗарплатыВыплаты.Ссылка.ПометкаУдаления
	    |				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
	    |				И НЕ ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	    |			ТОГДА ИСТИНА
	    |		ИНАЧЕ ЛОЖЬ
	    |	КОНЕЦ КАК РазрешеноВыгрузить,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ВЫБОР
	    |					КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") <> """"
	    |						ТОГДА ""Документ %ПарамДокументСсылка%: был ранее выгружен""
	    |					КОГДА НЕ ВыплатаЗарплатыВыплаты.Ссылка.Проведен
	    |						ТОГДА ""Документ %ПарамДокументСсылка%: должен быть проведенным""
	    |					КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ПометкаУдаления
	    |						ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы помеченые на удаление""
	    |					КОГДА НЕ ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
	    |						ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы выплаты зарплаты из кассы или от сотрудника""
	    |					КОГДА ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	    |						ТОГДА ""Документ %ПарамДокументСсылка%: Не определен счет сотрудника""
	    |					ИНАЧЕ """"
	    |				КОНЕЦ
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ВЫБОР
	    |					КОГДА ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") <> """"
	    |						ТОГДА ""Документ %ПарамДокументСсылка%: был ранее выгружен""
	    |					КОГДА НЕ ВыплатаЗарплатыВыплаты.Ссылка.Проведен
	    |						ТОГДА ""Документ %ПарамДокументСсылка%: должен быть проведенным""
	    |					КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ПометкаУдаления
	    |						ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы помеченые на удаление""
	    |					КОГДА НЕ ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
	    |						ТОГДА ""Документ %ПарамДокументСсылка%: Запрещенно выгружать документы выплаты зарплаты из кассы или от сотрудника""
	    |					КОГДА ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	    |						ТОГДА ""Документ %ПарамДокументСсылка%: Не определен счет сотрудника""
	    |					ИНАЧЕ """"
	    |				КОНЕЦ
	    |	КОНЕЦ КАК ОписатниеЗапрета
	    |ПОМЕСТИТЬ ВТ_ПредПроверка
	    |ИЗ
	    |	Документ.ВыплатаЗарплаты.Выплаты КАК ВыплатаЗарплатыВыплаты
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
	    |		ПО ВыплатаЗарплатыВыплаты.Ссылка = УИДДокументовВИнтернетБанке.ДокументСсылка
	    |			И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк = УИДДокументовВИнтернетБанке.Банк
	    |			И ВыплатаЗарплатыВыплаты.НомерСтроки = УИДДокументовВИнтернетБанке.Position
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовВИнтернетБанке.СрезПоследних КАК СтатусыДокументовВИнтернетБанкеСрезПоследних
	    |		ПО ВыплатаЗарплатыВыплаты.Ссылка = СтатусыДокументовВИнтернетБанкеСрезПоследних.ДокументСсылка
	    |			И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк = СтатусыДокументовВИнтернетБанкеСрезПоследних.Банк
	    |			И ВыплатаЗарплатыВыплаты.НомерСтроки = СтатусыДокументовВИнтернетБанкеСрезПоследних.Position
	    |ГДЕ
	    |	ВыплатаЗарплатыВыплаты.Ссылка В(&МассивДокументов)
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
		|	ВыплатаЗарплатыВыплаты.Ссылка.ВидОперации КАК ВидОперации,
	    |	ВыплатаЗарплатыВыплаты.Ссылка КАК Ссылка,
	    |	ВыплатаЗарплатыВыплаты.НомерСтроки КАК НомерСтроки,
	    |	ВЫБОР
	    |		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента = &НацВалюта
	    |				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК = ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
	    |			ТОГДА ""TransferWithinBankPaymentOrderIo""
	    |		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента <> &НацВалюта
	    |				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК = ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
	    |			ТОГДА ""TransferWithinBankPaymentOrderIo""
	    |		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента = &НацВалюта
	    |				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК <> ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
	    |			ТОГДА ""TransferToOtherBankNationalCurrencyPaymentOrderIo""
	    |		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента <> &НацВалюта
	    |				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК <> ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
	    |			ТОГДА ""TransferToOtherBankForeignCurrencyPaymentOrderIo""
	    |	КОНЕЦ КАК paymentOrder,
	    |	ПОДСТРОКА(ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.НомерСчета, 0, 22) КАК creditАccountNumber,
	    |	ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.ВалютаДенежныхСредств.Наименование КАК creditАccountCurrencyCode,
	    |	ПОДСТРОКА(ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.НомерСчета, 0, 22) КАК debitАccountNumber,
	    |	ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.ВалютаДенежныхСредств.Наименование КАК debitАccountCurrencyCode,
	    |	ВыплатаЗарплатыВыплаты.Ссылка.Номер КАК documentNumber,
	    |	ВыплатаЗарплатыВыплаты.Сумма КАК amount,
	    |	ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента.Наименование КАК currency,
	    |	ВыплатаЗарплатыВыплаты.Ссылка.НазначениеПлатежа КАК description,
	    |	ПРЕДСТАВЛЕНИЕ(ВыплатаЗарплатыВыплаты.Ссылка) КАК additionalDescription,
	    |	ВыплатаЗарплатыВыплаты.Сотрудник.Наименование КАК beneficiaryName,
	    |	ВыплатаЗарплатыВыплаты.Сотрудник.ИНН КАК beneficiaryTaxCode,
	    |	ЕСТЬNULL(СотрудникиКонтактнаяИнформацияАдресМестаПроживанияСотрудники.Представление, ЕСТЬNULL(СотрудникиКонтактнаяИнформацияАдресПоПропискеСотрудники.Представление, """")) КАК beneficiaryAddress,
	    |	ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК КАК beneficiaryBankCode,
	    |	ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.Представление КАК beneficiaryBankName,
	    |	NULL КАК intermediaryBankCode,
	    |	NULL КАК intermediaryBankName,
	    |	ВыплатаЗарплатыВыплаты.Ссылка.ТипКомиссии КАК chargeDetails,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""ВидОперации""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""ВидОперации""
	    |	КОНЕЦ КАК singlePaymentOrderИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Номер счета сотрудника""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Номер счета сотрудника""
	    |	КОНЕЦ КАК creditАccountNumberИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Наименование валюты счета сотрудника""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Наименование валюты счета сотрудника""
	    |	КОНЕЦ КАК creditАccountCurrencyCodeИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Номер счета организации""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Номер счета организации""
	    |	КОНЕЦ КАК debitАccountNumberИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Наименование валюты счета организации""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Наименование валюты счета организации""
	    |	КОНЕЦ КАК debitАccountCurrencyCodeИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""номер документа""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""номер документа""
	    |	КОНЕЦ КАК documentNumberИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Сумма к выплате""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Сумма к выплате""
	    |	КОНЕЦ КАК amountИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Наименоваине валюты документа""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Наименоваине валюты документа""
	    |	КОНЕЦ КАК currencyИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""НазначениеПлатежа""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""НазначениеПлатежа""
	    |	КОНЕЦ КАК descriptionИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""НазначениеПлатежа""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""НазначениеПлатежа""
	    |	КОНЕЦ КАК additionalDescriptionИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""ФИО сотрудника""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""ФИО сотрудника""
	    |	КОНЕЦ КАК beneficiaryNameИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""ИНН сотрудника""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""ИНН сотрудника""
	    |	КОНЕЦ КАК beneficiaryTaxCodeИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Адрес сотрудника""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Адрес сотрудника""
	    |	КОНЕЦ КАК beneficiaryAddressИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""SWIFT банка сотрудника""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""SWIFT банка сотрудника""
	    |	КОНЕЦ КАК beneficiaryBankCodeИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Наименование банка сотрудника""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Наименование банка сотрудника""
	    |	КОНЕЦ КАК beneficiaryBankNameИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""SWIFT промежуточного банка""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""SWIFT промежуточного банка""
	    |	КОНЕЦ КАК intermediaryBankCodeИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Наименование промежуточного банка""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Наименование промежуточного банка""
	    |	КОНЕЦ КАК intermediaryBankNameИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Тип комиссии""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Тип комиссии""
	    |	КОНЕЦ КАК chargeDetailsИмяРеквизита,
	    |	ВыплатаЗарплатыВыплаты.Сотрудник КАК Сотрудник,
	    |	NULL КАК taxpayerCode,
	    |	NULL КАК taxpayerName,
	    |	NULL КАК treasuryCode,
	    |	NULL КАК taxpayerCodeИмяРеквизита,
	    |	NULL КАК taxpayerNameИмяРеквизита,
	    |	NULL КАК treasuryCodeИмяРеквизита
	    |ПОМЕСТИТЬ ВТ_ДанныеДокументов
	    |ИЗ
	    |	Документ.ВыплатаЗарплаты.Выплаты КАК ВыплатаЗарплатыВыплаты
	    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформацияАдресПоПропискеСотрудники
	    |		ПО ВыплатаЗарплатыВыплаты.Сотрудник = СотрудникиКонтактнаяИнформацияАдресПоПропискеСотрудники.Ссылка
	    |			И (СотрудникиКонтактнаяИнформацияАдресПоПропискеСотрудники.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеСотрудники))
	    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформацияАдресМестаПроживанияСотрудники
	    |		ПО ВыплатаЗарплатыВыплаты.Сотрудник = СотрудникиКонтактнаяИнформацияАдресМестаПроживанияСотрудники.Ссылка
	    |			И (СотрудникиКонтактнаяИнформацияАдресМестаПроживанияСотрудники.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияСотрудники))
	    |ГДЕ
	    |	(ВыплатаЗарплатыВыплаты.Ссылка, ВыплатаЗарплатыВыплаты.НомерСтроки) В
	    |			(ВЫБРАТЬ
	    |				а.Ссылка,
	    |				а.НомерСтроки
	    |			ИЗ
	    |				ВТ_ПредПроверка КАК а
	    |			ГДЕ
	    |				а.РазрешеноВыгрузить)
	    |	И НЕ ВыплатаЗарплатыВыплаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыплатыЗарплаты.ОплатаУдержанийДляКонтрагента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыплатаЗарплатыВыплаты.Ссылка.ВидОперации КАК ВидОперации,
	    |	ВыплатаЗарплатыВыплаты.Ссылка КАК Ссылка,
	    |	ВыплатаЗарплатыВыплаты.НомерСтроки КАК НомерСтроки,
	    |	ВЫБОР
	    |		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента = &НацВалюта
	    |				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК = ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
	    |			ТОГДА ""TransferWithinBankPaymentOrderIo""
	    |		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента <> &НацВалюта
	    |				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК = ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
	    |			ТОГДА ""TransferWithinBankPaymentOrderIo""
	    |		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента = &НацВалюта
	    |				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК <> ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
	    |			ТОГДА ""TransferToOtherBankNationalCurrencyPaymentOrderIo""
	    |		КОГДА ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента <> &НацВалюта
	    |				И ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.Банк.СВИФТБИК <> ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК
	    |			ТОГДА ""TransferToOtherBankForeignCurrencyPaymentOrderIo""
	    |	КОНЕЦ КАК paymentOrder,
	    |	ПОДСТРОКА(ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.НомерСчета, 0, 22) КАК creditАccountNumber,
	    |	ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.ВалютаДенежныхСредств.Наименование КАК creditАccountCurrencyCode,
	    |	ПОДСТРОКА(ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.НомерСчета, 0, 22) КАК debitАccountNumber,
	    |	ВыплатаЗарплатыВыплаты.Ссылка.БанковскийСчетКасса.ВалютаДенежныхСредств.Наименование КАК debitАccountCurrencyCode,
	    |	ВыплатаЗарплатыВыплаты.Ссылка.Номер КАК documentNumber,
	    |	ВыплатаЗарплатыВыплаты.Сумма КАК amount,
	    |	ВыплатаЗарплатыВыплаты.Ссылка.ВалютаДокумента.Наименование КАК currency,
	    |	ВыплатаЗарплатыВыплаты.Ссылка.НазначениеПлатежа КАК description,
	    |	ПРЕДСТАВЛЕНИЕ(ВыплатаЗарплатыВыплаты.Ссылка) КАК additionalDescription,
	    |	ВыплатаЗарплатыВыплаты.Контрагент.Наименование КАК beneficiaryName,
	    |	ВыплатаЗарплатыВыплаты.Контрагент.ИНН КАК beneficiaryTaxCode,
	    |	ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Представление, ЕСТЬNULL(КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Представление, """")) КАК beneficiaryAddress,
	    |	ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.СВИФТБИК КАК beneficiaryBankCode,
	    |	ВыплатаЗарплатыВыплаты.БанковскийСчетСотрудника.Банк.Представление КАК beneficiaryBankName,
	    |	NULL КАК intermediaryBankCode,
	    |	NULL КАК intermediaryBankName,
	    |	ВыплатаЗарплатыВыплаты.Ссылка.ТипКомиссии КАК chargeDetails,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""ВидОперации""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""ВидОперации""
	    |	КОНЕЦ КАК singlePaymentOrderИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Номер счета контрагента""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Номер счета контрагента""
	    |	КОНЕЦ КАК creditАccountNumberИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Наименование валюты счета контрагента""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Наименование валюты счета контрагента""
	    |	КОНЕЦ КАК creditАccountCurrencyCodeИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Номер счета организации""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Номер счета организации""
	    |	КОНЕЦ КАК debitАccountNumberИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Наименование валюты счета организации""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Наименование валюты счета организации""
	    |	КОНЕЦ КАК debitАccountCurrencyCodeИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""номер документа""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""номер документа""
	    |	КОНЕЦ КАК documentNumberИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Сумма к выплате""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Сумма к выплате""
	    |	КОНЕЦ КАК amountИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Наименоваине валюты документа""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Наименоваине валюты документа""
	    |	КОНЕЦ КАК currencyИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""НазначениеПлатежа""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""НазначениеПлатежа""
	    |	КОНЕЦ КАК descriptionИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""НазначениеПлатежа""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""НазначениеПлатежа""
	    |	КОНЕЦ КАК additionalDescriptionИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Наименование контрагента""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Наименование контрагента""
	    |	КОНЕЦ КАК beneficiaryNameИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""ИНН контрагента""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""ИНН контрагента""
	    |	КОНЕЦ КАК beneficiaryTaxCodeИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Адрес контрагента""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Адрес контрагента""
	    |	КОНЕЦ КАК beneficiaryAddressИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""SWIFT банка контрагента""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""SWIFT банка контрагента""
	    |	КОНЕЦ КАК beneficiaryBankCodeИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Наименование банка контрагента""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Наименование банка контрагента""
	    |	КОНЕЦ КАК beneficiaryBankNameИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""SWIFT промежуточного банка""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""SWIFT промежуточного банка""
	    |	КОНЕЦ КАК intermediaryBankCodeИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Наименование промежуточного банка""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Наименование промежуточного банка""
	    |	КОНЕЦ КАК intermediaryBankNameИмяРеквизита,
	    |	ВЫБОР
	    |		КОГДА &КодЯзвка = ""ru""
	    |			ТОГДА ""Тип комиссии""
	    |		КОГДА &КодЯзвка = ""ka""
	    |			ТОГДА ""Тип комиссии""
	    |	КОНЕЦ КАК chargeDetailsИмяРеквизита,
	    |	ВыплатаЗарплатыВыплаты.Контрагент КАК Сотрудник,
	    |	NULL КАК taxpayerCode,
	    |	NULL КАК taxpayerName,
	    |	NULL КАК treasuryCode,
	    |	NULL КАК taxpayerCodeИмяРеквизита,
	    |	NULL КАК taxpayerNameИмяРеквизита,
	    |	NULL КАК treasuryCodeИмяРеквизита
	    |ИЗ
	    |	Документ.ВыплатаЗарплаты.Выплаты КАК ВыплатаЗарплатыВыплаты
	    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента
		|		ПО ВыплатаЗарплатыВыплаты.Контрагент = КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Ссылка
		|			И (КонтрагентыКонтактнаяИнформацияФактическийАдресКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента
		|		ПО ВыплатаЗарплатыВыплаты.Контрагент = КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Ссылка
		|			И (КонтрагентыКонтактнаяИнформацияЮридическийАдресКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента))
	    |ГДЕ
	    |	(ВыплатаЗарплатыВыплаты.Ссылка, ВыплатаЗарплатыВыплаты.НомерСтроки) В
	    |			(ВЫБРАТЬ
	    |				а.Ссылка,
	    |				а.НомерСтроки
	    |			ИЗ
	    |				ВТ_ПредПроверка КАК а
	    |			ГДЕ
	    |				а.РазрешеноВыгрузить)
	    |	И ВыплатаЗарплатыВыплаты.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыплатыЗарплаты.ОплатаУдержанийДляКонтрагента)		
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ВТ_ПредПроверка.Ссылка КАК Ссылка,
	    |	ВТ_ПредПроверка.ИмяПакета КАК batchName,
	    |	ВТ_ПредПроверка.ТекущийСтатусДокумента КАК ТекущийСтатусДокумента,
	    |	ВТ_ПредПроверка.УИД КАК singlePaymentRequestId,
	    |	ВТ_ПредПроверка.РазрешеноВыгрузить КАК РазрешеноВыгрузить,
	    |	ВТ_ПредПроверка.ОписатниеЗапрета КАК ОписатниеЗапрета,
	    |	ВТ_ДанныеДокументов.НомерСтроки КАК position,
	    |	ВТ_ДанныеДокументов.paymentOrder КАК paymentOrder,
	    |	ВТ_ДанныеДокументов.creditАccountNumber КАК CreditАccountNumber,
	    |	ВТ_ДанныеДокументов.creditАccountCurrencyCode КАК CreditАccountCurrencyCode,
	    |	ВТ_ДанныеДокументов.debitАccountNumber КАК DebitАccountNumber,
	    |	ВТ_ДанныеДокументов.debitАccountCurrencyCode КАК DebitАccountCurrencyCode,
	    |	ВТ_ДанныеДокументов.documentNumber КАК documentNumber,
	    |	ВТ_ДанныеДокументов.amount КАК amount,
	    |	ВТ_ДанныеДокументов.currency КАК currency,
	    |	ВТ_ДанныеДокументов.description КАК description,
	    |	ВТ_ДанныеДокументов.additionalDescription КАК additionalDescription,
	    |	ВТ_ДанныеДокументов.beneficiaryName КАК beneficiaryName,
	    |	ВТ_ДанныеДокументов.beneficiaryTaxCode КАК beneficiaryTaxCode,
	    |	ВТ_ДанныеДокументов.beneficiaryAddress КАК beneficiaryAddress,
	    |	ВТ_ДанныеДокументов.beneficiaryBankCode КАК beneficiaryBankCode,
	    |	ВТ_ДанныеДокументов.beneficiaryBankName КАК beneficiaryBankName,
	    |	ВТ_ДанныеДокументов.intermediaryBankCode КАК intermediaryBankCode,
	    |	ВТ_ДанныеДокументов.intermediaryBankName КАК intermediaryBankName,
	    |	ВТ_ДанныеДокументов.chargeDetails КАК chargeDetails,
	    |	ВТ_ДанныеДокументов.singlePaymentOrderИмяРеквизита КАК singlePaymentOrderИмяРеквизита,
	    |	ВТ_ДанныеДокументов.creditАccountNumberИмяРеквизита КАК CreditАccountNumberИмяРеквизита,
	    |	ВТ_ДанныеДокументов.creditАccountCurrencyCodeИмяРеквизита КАК CreditАccountCurrencyCodeCodeИмяРеквизита,
	    |	ВТ_ДанныеДокументов.debitАccountNumberИмяРеквизита КАК DebitАccountNumberИмяРеквизита,
	    |	ВТ_ДанныеДокументов.debitАccountCurrencyCodeИмяРеквизита КАК DebitАccountCurrencyCodeИмяРеквизита,
	    |	ВТ_ДанныеДокументов.documentNumberИмяРеквизита КАК documentNumberИмяРеквизита,
	    |	ВТ_ДанныеДокументов.amountИмяРеквизита КАК amountИмяРеквизита,
	    |	ВТ_ДанныеДокументов.currencyИмяРеквизита КАК currencyИмяРеквизита,
	    |	ВТ_ДанныеДокументов.descriptionИмяРеквизита КАК descriptionИмяРеквизита,
	    |	ВТ_ДанныеДокументов.additionalDescriptionИмяРеквизита КАК additionalDescriptionИмяРеквизита,
	    |	ВТ_ДанныеДокументов.beneficiaryNameИмяРеквизита КАК beneficiaryNameИмяРеквизита,
	    |	ВТ_ДанныеДокументов.beneficiaryTaxCodeИмяРеквизита КАК beneficiaryTaxCodeИмяРеквизита,
	    |	ВТ_ДанныеДокументов.beneficiaryAddressИмяРеквизита КАК beneficiaryAddressИмяРеквизита,
	    |	ВТ_ДанныеДокументов.beneficiaryBankCodeИмяРеквизита КАК beneficiaryBankCodeИмяРеквизита,
	    |	ВТ_ДанныеДокументов.beneficiaryBankNameИмяРеквизита КАК beneficiaryBankNameИмяРеквизита,
	    |	ВТ_ДанныеДокументов.intermediaryBankCodeИмяРеквизита КАК intermediaryBankCodeИмяРеквизита,
	    |	ВТ_ДанныеДокументов.intermediaryBankNameИмяРеквизита КАК intermediaryBankNameИмяРеквизита,
	    |	ВТ_ДанныеДокументов.chargeDetailsИмяРеквизита КАК chargeDetailsИмяРеквизита,
	    |	ВТ_ДанныеДокументов.Сотрудник КАК Сотрудник,
	    |	ВТ_ДанныеДокументов.taxpayerCodeИмяРеквизита КАК taxpayerCodeИмяРеквизита,
	    |	ВТ_ДанныеДокументов.taxpayerNameИмяРеквизита КАК taxpayerNameИмяРеквизита,
	    |	ВТ_ДанныеДокументов.treasuryCodeИмяРеквизита КАК treasuryCodeИмяРеквизита,
	    |	ВТ_ДанныеДокументов.taxpayerCode КАК taxpayerCode,
	    |	ВТ_ДанныеДокументов.taxpayerName КАК taxpayerName,
	    |	ВТ_ДанныеДокументов.treasuryCode КАК treasuryCode
	    |ИЗ
	    |	ВТ_ПредПроверка КАК ВТ_ПредПроверка
	    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокументов КАК ВТ_ДанныеДокументов
	    |		ПО ВТ_ПредПроверка.Ссылка = ВТ_ДанныеДокументов.Ссылка
		|		И ВТ_ПредПроверка.НомерСтроки = ВТ_ДанныеДокументов.НомерСтроки
		|
	    |УПОРЯДОЧИТЬ ПО
	    |	batchName,
	    |	Ссылка,
	    |	position
	    |ИТОГИ ПО
	    |	batchName,
	    |	DebitАccountNumber,
	    |	DebitАccountCurrencyCode";
	
	Запрос.УстановитьПараметр("МассивДокументов", СтруктураПарметровЗапросаВБанк.МассивДокументов);
	Запрос.УстановитьПараметр("НацВалюта", СтруктураПарметровЗапросаВБанк.ВалютаУчета);
	Запрос.УстановитьПараметр("КодЯзвка", ПользователиИнформационнойБазы.ТекущийПользователь().Язык.КодЯзыка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции

Процедура ОбработатьВыгрузкуДокументовВБанкНаСервере(СтруктураОтвета,ТаблицаПозицийАдресВременногоХранилища) ЭКСПОРТ
	
	КолвоВыгруженныхДоков = 0;
	
	Если СтруктураОтвета.Свойство("ТекстОшибки") Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураОтвета.ТекстОшибки);
		
	Иначе
		
		ТаблицаПозиций = ПолучитьИзВременногоХранилища(ТаблицаПозицийАдресВременногоХранилища);
		
		МассивПакетов = Неопределено;
		Если СтруктураОтвета.Свойство("МассивСсылокДокументовПакетов") Тогда 
			МассивПакетов = СтруктураОтвета.МассивСсылокДокументовПакетов;
		КонецЕсли;
		
		Если СтруктураОтвета.Свойство("PaymentOrdersResults") Тогда 
			
			Если ТипЗнч(СтруктураОтвета.PaymentOrdersResults) = Тип("Массив") Тогда 
				
				Для Каждого ЭлементМассива Из СтруктураОтвета.PaymentOrdersResults Цикл 
					
					Позиция = ЭлементМассива.position;
					УИД_Документа = ЭлементМассива.paymentId;
					
					МассивНайденныхСтрок = ТаблицаПозиций.НайтиСтроки(Новый Структура("Позиция", Позиция));
					Если МассивНайденныхСтрок.Количество() > 0 Тогда 
						
						ДокументСсылка = МассивНайденныхСтрок[0].ДокументСсылка;
						
						Банк = ПолучитьБанкИзСсылкиНаДокумент(ДокументСсылка,ПредопределенноеЗначение("Справочник.КлассификаторБанков.ПустаяСсылка"));
						Статус = ПредопределенноеЗначение("Перечисление.СтатусыДокументовВИнтернетБанке.T");
						
						Если ТипЗНЧ(ДокументСсылка) = Тип("ДокументСсылка.ВыплатаЗарплаты") Тогда
							ИнтеграцияСБанком_НаСервере.ВнестиНовыйСтатусДокумента(ДокументСсылка,Статус,МассивНайденныхСтрок[0].Сотрудник,ЛОЖЬ,УИД_Документа,Банк,Позиция);
						Иначе	
							ИнтеграцияСБанком_НаСервере.ВнестиНовыйСтатусДокумента(ДокументСсылка,Статус,МассивНайденныхСтрок[0].Сотрудник,ЛОЖЬ,УИД_Документа,Банк,0);
						КонецЕсли;
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ: """+ДокументСсылка+""" был успешно выгружен'; ka = 'Документ: """+ДокументСсылка+""" был успешно выгружен'"));
						КолвоВыгруженныхДоков = КолвоВыгруженныхДоков + 1;
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли ТипЗнч(СтруктураОтвета.PaymentOrdersResults) = Тип("Структура") Тогда
				
				Позиция = СтруктураОтвета.PaymentOrdersResults.position;
				УИД_Документа = СтруктураОтвета.PaymentOrdersResults.paymentId;
				
				МассивНайденныхСтрок = ТаблицаПозиций.НайтиСтроки(Новый Структура("Позиция", Позиция));
				Если МассивНайденныхСтрок.Количество() > 0 Тогда 
					
					ДокументСсылка = МассивНайденныхСтрок[0].ДокументСсылка;
					
					Банк = ПолучитьБанкИзСсылкиНаДокумент(ДокументСсылка,ПредопределенноеЗначение("Справочник.КлассификаторБанков.ПустаяСсылка"));
					Статус = ПредопределенноеЗначение("Перечисление.СтатусыДокументовВИнтернетБанке.T");
					
					Если ТипЗНЧ(ДокументСсылка) = Тип("ДокументСсылка.ВыплатаЗарплаты") Тогда
						ИнтеграцияСБанком_НаСервере.ВнестиНовыйСтатусДокумента(ДокументСсылка,Статус,МассивНайденныхСтрок[0].Сотрудник,ЛОЖЬ,УИД_Документа,Банк,Позиция);
					Иначе	
						ИнтеграцияСБанком_НаСервере.ВнестиНовыйСтатусДокумента(ДокументСсылка,Статус,МассивНайденныхСтрок[0].Сотрудник,ЛОЖЬ,УИД_Документа,Банк,0);
					КонецЕсли;
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ: """+ДокументСсылка+""" был успешно выгружен'; ka = 'Документ: """+ДокументСсылка+""" был успешно выгружен'"));
					КолвоВыгруженныхДоков = КолвоВыгруженныхДоков + 1;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли СтруктураОтвета.Свойство("mygeminiBatchId") Тогда
			
			ДокументСсылка = НЕОПРЕДЕЛЕНО;
			
			ТаблицаПозиций.Сортировать("ДокументСсылка,Позиция");
			
			Статус = ПредопределенноеЗначение("Перечисление.СтатусыДокументовВИнтернетБанке.T");
			
			УИД_Пакета = Структураответа.mygeminiBatchId;
			
			Для каждого ТекущаяСтрока Из ТаблицаПозиций Цикл
				
				Если НЕ ДокументСсылка = ТекущаяСтрока.ДокументСсылка Тогда
					
					ДокументСсылка = ТекущаяСтрока.ДокументСсылка;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ: """+ДокументСсылка+""" был успешно выгружен'; ka = 'Документ: """+ДокументСсылка+""" был успешно выгружен'"));
					
				КонецЕсли;
				
				Банк = ПолучитьБанкИзСсылкиНаДокумент(ДокументСсылка,ПредопределенноеЗначение("Справочник.КлассификаторБанков.ПустаяСсылка"));
				Статус = ПредопределенноеЗначение("Перечисление.СтатусыДокументовВИнтернетБанке.T");
				
				Если ТипЗНЧ(ДокументСсылка) = Тип("ДокументСсылка.ВыплатаЗарплаты") Тогда
					ИнтеграцияСБанком_НаСервере.ВнестиНовыйСтатусДокумента(ДокументСсылка,Статус,ТекущаяСтрока.Сотрудник,ЛОЖЬ,УИД_Пакета,Банк,ТекущаяСтрока.Позиция);
				Иначе
					ИнтеграцияСБанком_НаСервере.ВнестиНовыйСтатусДокумента(ДокументСсылка,Статус,ТекущаяСтрока.Сотрудник,ЛОЖЬ,УИД_Пакета,Банк,0);
				КонецЕсли;
				
				КолвоВыгруженныхДоков = КолвоВыгруженныхДоков + 1;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСтатусДокумента(ДокументСсылка,СтруктураОтвета,СтруктураПарметровЗапросаВБанк) ЭКСПОРТ
	
	ДатаОбновления = ТекущаяДатаСеанса();
	Банк = ПолучитьБанкИзСсылкиНаДокумент(ДокументСсылка,ПредопределенноеЗначение("Справочник.КлассификаторБанков.ПустаяСсылка"));
	ПеречислениеСтатусовДокументовВИнтернетБанке = "СтатусыДокументовВИнтернетБанке";
	
	ЭтоПакет = ЛОЖЬ;
	Если СтруктураОтвета.Свойство("batchPaymentData")
		ИЛИ (СтруктураПарметровЗапросаВБанк.Свойство("ЭтоПакет") И СтруктураПарметровЗапросаВБанк.ЭтоПакет)
		Тогда
		
		ПеречислениеСтатусовДокументовВИнтернетБанке = "СтатусыПакетныхПеречисленийВИнтернетБанке";
	
		ЭтоПакет = ИСТИНА;
	
	КонецЕсли;
	
	СтатусПолучен = СтруктураОтвета.Свойство("status");
	
	Если СтатусПолучен Тогда
		
		СтатусПолучен = ЛОЖЬ;
		СтатусВИнтернетБанке = НЕОПРЕДЕЛЕНО;
		ТекстСтатуса = СокрЛП(СтруктураОтвета.status);
		
		Для Каждого СтатусЗначениеПеречисления Из Метаданные.Перечисления[ПеречислениеСтатусовДокументовВИнтернетБанке].ЗначенияПеречисления Цикл
			
			Если СтатусЗначениеПеречисления.Имя = ТекстСтатуса Или СтатусЗначениеПеречисления.Синоним = ТекстСтатуса Тогда
				
				СтатусВИнтернетБанке = Перечисления[ПеречислениеСтатусовДокументовВИнтернетБанке][СтатусЗначениеПеречисления.Имя];					
				СтатусПолучен = ИСТИНА;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтатусПолучен Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	УИДДокументовВИнтернетБанке.ДокументСсылка КАК ДокументСсылка,
			|	УИДДокументовВИнтернетБанке.Банк КАК Банк,
			|	УИДДокументовВИнтернетБанке.Position КАК Position,
			|	ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке,"""") КАК УИДДокументаВБанке,
			|	УИДДокументовВИнтернетБанке.Сотрудник КАК Сотрудник
			|ПОМЕСТИТЬ УИДДокументовВИнтернетБанке
			|ИЗ
			|	РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
			|ГДЕ
			|	УИДДокументовВИнтернетБанке.ДокументСсылка = &ДокументСсылка
			|	И УИДДокументовВИнтернетБанке.Банк = &Банк
			|	И УИДДокументовВИнтернетБанке.УИДДокументаВБанке = &УИДДокументаВБанке
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	УИДДокументовВИнтернетБанке.ДокументСсылка КАК ДокументСсылка,
			|	УИДДокументовВИнтернетБанке.Position КАК Position,
			|	СтатусыДокументовВИнтернетБанкеСрезПоследних.СтатусДокументаВИнтернетБанке КАК СтатусДокументаВИнтернетБанке,
			|	СтатусыДокументовВИнтернетБанкеСрезПоследних.СтатусПозицииДокументаВИнтернетБанке КАК СтатусПозицииДокументаВИнтернетБанке,
			|	СтатусыДокументовВИнтернетБанкеСрезПоследних.Сотрудник КАК Сотрудник
			|ИЗ
			|	УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовВИнтернетБанке.СрезПоследних КАК СтатусыДокументовВИнтернетБанкеСрезПоследних
			|		ПО УИДДокументовВИнтернетБанке.ДокументСсылка = СтатусыДокументовВИнтернетБанкеСрезПоследних.ДокументСсылка
			|			И УИДДокументовВИнтернетБанке.Банк = СтатусыДокументовВИнтернетБанкеСрезПоследних.Банк
			|			И УИДДокументовВИнтернетБанке.Position = СтатусыДокументовВИнтернетБанкеСрезПоследних.Position
			|ИТОГИ ПО
			|	ДокументСсылка
			|	,Position";
			
			Запрос.УстановитьПараметр("Банк", Банк);
			Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
			Запрос.УстановитьПараметр("УИДДокументаВБанке", СтруктураПарметровЗапросаВБанк.УИД);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл
				
				ВыборкаПозиция = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПозиция.Следующий() Цикл
					
					ВыборкаДетальныеЗаписи = ВыборкаПозиция.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
						Если ЭтоПакет Тогда
							
							Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СтатусПозицииДокументаВИнтернетБанке) Тогда
								ТекущийСтатусДокументаВИнтернетБанке = ВыборкаДетальныеЗаписи.СтатусПозицииДокументаВИнтернетБанке;
							Иначе	
								ТекущийСтатусДокументаВИнтернетБанке = ВыборкаДетальныеЗаписи.СтатусДокументаВИнтернетБанке;
							КонецЕсли;
							
							Если СтруктураОтвета.Свойство("batchPaymentData") Тогда
								
								Если ТипЗнч(СтруктураОтвета.batchPaymentData) = Тип("Массив") Тогда
									
									Для Каждого ЭлементМассива Из СтруктураОтвета.batchPaymentData Цикл 
										
										Позиция = Число(ЭлементМассива.position);
										errorDetailGE = "";
										ЭлементМассива.Свойство("errorDetailGE",errorDetailGE);
										errorDetailEN = "";
										ЭлементМассива.Свойство("errorDetailEN",errorDetailEN);
										
										СтатусПозиции = НЕОПРЕДЕЛЕНО;
										paymentStatus = НЕОПРЕДЕЛЕНО;
										Если ЭлементМассива.Свойство("paymentStatus",paymentStatus) Тогда
											
											Для Каждого СтатусЗначениеПеречисления Из Метаданные.Перечисления.СтатусыДокументовВИнтернетБанке.ЗначенияПеречисления Цикл
												
												Если СтатусЗначениеПеречисления.Имя = paymentStatus Или СтатусЗначениеПеречисления.Синоним = paymentStatus Тогда
													
													СтатусПозиции = Перечисления.СтатусыДокументовВИнтернетБанке[СтатусЗначениеПеречисления.Имя];					
													Прервать;
													
												КонецЕсли;
												
											КонецЦикла;
											
											Если СтатусПозиции = НЕОПРЕДЕЛЕНО Тогда
												
												Для Каждого СтатусЗначениеПеречисления Из Метаданные.Перечисления.СтатусыПакетныхПеречисленийВИнтернетБанке.ЗначенияПеречисления Цикл
													
													Если СтатусЗначениеПеречисления.Имя = paymentStatus Или СтатусЗначениеПеречисления.Синоним = paymentStatus Тогда
														
														СтатусПозиции = Перечисления.СтатусыПакетныхПеречисленийВИнтернетБанке[СтатусЗначениеПеречисления.Имя];					
														Прервать;
														
													КонецЕсли;
													
												КонецЦикла;
												
											КонецЕсли;
											
										КонецЕсли;
										
										Если СтатусПозиции = НЕОПРЕДЕЛЕНО Тогда
											
											СтатусПозиции = СтатусВИнтернетБанке;
											
										КонецЕсли;
										
										Если СтатусПозиции = ТекущийСтатусДокументаВИнтернетБанке Тогда
											
											ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'для "+ВыборкаДетальныеЗаписи.Сотрудник+" в строке "+ВыборкаДетальныеЗаписи.Position+" не было изменений'; ka = 'для "+ВыборкаДетальныеЗаписи.Сотрудник+" в строке "+ВыборкаДетальныеЗаписи.Position+" не было изменений'"));
											
										Иначе
											
											Если Позиция = ВыборкаДетальныеЗаписи.Position Тогда
												НеНайденаПозиция=ЛОЖЬ;
												
												ЗаписатьНовыйСтатусДокумента(ДатаОбновления,ДокументСсылка,Банк,Позиция,СтатусВИнтернетБанке,ВыборкаДетальныеЗаписи.Сотрудник,СтатусПозиции);
												
												СтрокаСообщения = НСтр("ru = 'по строке "+Позиция+" для "+ВыборкаДетальныеЗаписи.Сотрудник+" присвоен статус: """+СтатусПозиции+"""'; ka = 'по строке "+Позиция+" для "+ВыборкаДетальныеЗаписи.Сотрудник+" присвоен статус: """ + СтатусПозиции + """'");
												
												Если СтрДлина(СокрЛП(errorDetailGE))>0 Тогда
													СтрокаСообщения = СтрокаСообщения + "; "+errorDetailGE;
												ИначеЕсли СтрДлина(СокрЛП(errorDetailEN))>0 Тогда
													СтрокаСообщения = СтрокаСообщения + "; "+errorDetailEN;											
												КонецЕсли;
												
												ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
												
											КонецЕсли;
											
										КонецЕсли;
										
									КонецЦикла;
									
								ИначеЕсли ТипЗнч(СтруктураОтвета.batchPaymentData) = Тип("Структура") Тогда
									
									Позиция = Число(СтруктураОтвета.batchPaymentData.position);
									errorDetailGE = "";
									СтруктураОтвета.batchPaymentData.Свойство("errorDetailGE",errorDetailGE);
									errorDetailEN = "";
									СтруктураОтвета.batchPaymentData.Свойство("errorDetailEN",errorDetailEN);
									
									СтатусПозиции = НЕОПРЕДЕЛЕНО;
									paymentStatus = НЕОПРЕДЕЛЕНО;
									Если СтруктураОтвета.batchPaymentData.Свойство("paymentStatus",paymentStatus) Тогда
									
										Для Каждого СтатусЗначениеПеречисления Из Метаданные.Перечисления.СтатусыДокументовВИнтернетБанке.ЗначенияПеречисления Цикл
											
											Если СтатусЗначениеПеречисления.Имя = paymentStatus Или СтатусЗначениеПеречисления.Синоним = paymentStatus Тогда
												
												СтатусПозиции = Перечисления.СтатусыДокументовВИнтернетБанке[СтатусЗначениеПеречисления.Имя];					
												Прервать;
												
											КонецЕсли;
											
										КонецЦикла;
										
										Если СтатусПозиции = НЕОПРЕДЕЛЕНО Тогда
											
											Для Каждого СтатусЗначениеПеречисления Из Метаданные.Перечисления.СтатусыПакетныхПеречисленийВИнтернетБанке.ЗначенияПеречисления Цикл
												
												Если СтатусЗначениеПеречисления.Имя = paymentStatus Или СтатусЗначениеПеречисления.Синоним = paymentStatus Тогда
													
													СтатусПозиции = Перечисления.СтатусыПакетныхПеречисленийВИнтернетБанке[СтатусЗначениеПеречисления.Имя];					
													Прервать;
													
												КонецЕсли;
												
											КонецЦикла;
											
										КонецЕсли;
									
									КонецЕсли;
									
									Если СтатусПозиции = НЕОПРЕДЕЛЕНО Тогда
										
										СтатусПозиции = СтатусВИнтернетБанке;
										
									КонецЕсли;
									
									Если СтатусПозиции = ТекущийСтатусДокументаВИнтернетБанке Тогда
										
										ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'для "+ВыборкаДетальныеЗаписи.Сотрудник+" в строке "+ВыборкаДетальныеЗаписи.Position+" не было изменений'; ka = 'для "+ВыборкаДетальныеЗаписи.Сотрудник+" в строке "+ВыборкаДетальныеЗаписи.Position+" не было изменений'"));
										
									Иначе
										
										Если Позиция = ВыборкаДетальныеЗаписи.Position Тогда
											
											ЗаписатьНовыйСтатусДокумента(ДатаОбновления,ДокументСсылка,Банк,Позиция,СтатусВИнтернетБанке,ВыборкаДетальныеЗаписи.Сотрудник,СтатусПозиции);
											
											СтрокаСообщения = НСтр("ru = 'по строке "+Позиция+" для "+ВыборкаДетальныеЗаписи.Сотрудник+" присвоен статус: """+СтатусПозиции+"""'; ka = 'по строке "+Позиция+" для "+ВыборкаДетальныеЗаписи.Сотрудник+" присвоен статус: """ + СтатусПозиции + """'");
											
											Если СтрДлина(СокрЛП(errorDetailGE))>0 Тогда
												СтрокаСообщения = СтрокаСообщения + "; "+errorDetailGE;
											ИначеЕсли СтрДлина(СокрЛП(errorDetailEN))>0 Тогда
												СтрокаСообщения = СтрокаСообщения + "; "+errorDetailEN;											
											КонецЕсли;
											
											ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
											
										КонецЕсли;
										
									КонецЕсли;
									
								КонецЕсли;
								
							Иначе
								
								Если СтатусВИнтернетБанке = ТекущийСтатусДокументаВИнтернетБанке Тогда
									
									Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сотрудник) Тогда
										ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'для "+ВыборкаДетальныеЗаписи.Сотрудник+" в строке "+ВыборкаДетальныеЗаписи.Position+" не было изменений'; ka = 'для "+ВыборкаДетальныеЗаписи.Сотрудник+" в строке "+ВыборкаДетальныеЗаписи.Position+" не было изменений'"));
									Иначе
										ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'не было изменений'; ka = 'не было изменений'"));
									КонецЕсли;
									
								Иначе
									
									ЗаписатьНовыйСтатусДокумента(ДатаОбновления,ДокументСсылка,Банк,ВыборкаДетальныеЗаписи.Position,СтатусВИнтернетБанке,ВыборкаДетальныеЗаписи.Сотрудник);
									
									Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сотрудник) Тогда
										ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'для "+ВыборкаДетальныеЗаписи.Сотрудник+" в строке "+ВыборкаДетальныеЗаписи.Position+" присвоен статус: """ + СтатусВИнтернетБанке + """'; ka = 'для "+ВыборкаДетальныеЗаписи.Сотрудник+" в строке "+ВыборкаДетальныеЗаписи.Position+" присвоен статус: """ + СтатусВИнтернетБанке + """'"));
									Иначе
										ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'присвоен статус: """ + СтатусВИнтернетБанке + """'; ka = 'присвоен статус: """ + СтатусВИнтернетБанке + """'"));
									КонецЕсли
									
								КонецЕсли;
								
							КонецЕсли;
							
						Иначе
							
							Если ТипЗНЧ(ДокументСсылка)=Тип("ДокументСсылка.ВыплатаЗарплаты") Тогда
								
								ТекущийСтатусДокументаВИнтернетБанке = ВыборкаДетальныеЗаписи.СтатусПозицииДокументаВИнтернетБанке;
								
								Если СтатусВИнтернетБанке = ТекущийСтатусДокументаВИнтернетБанке Тогда
									
									Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сотрудник) Тогда
										ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'для "+ВыборкаДетальныеЗаписи.Сотрудник+" в строке "+ВыборкаДетальныеЗаписи.Position+" не было изменений'; ka = 'для "+ВыборкаДетальныеЗаписи.Сотрудник+" в строке "+ВыборкаДетальныеЗаписи.Position+" не было изменений'"));
									Иначе
										ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'не было изменений'; ka = 'не было изменений'"));
									КонецЕсли;
									
								Иначе
									
									ЗаписатьНовыйСтатусДокумента(ДатаОбновления,ДокументСсылка,Банк,ВыборкаДетальныеЗаписи.Position,ВыборкаДетальныеЗаписи.СтатусДокументаВИнтернетБанке,ВыборкаДетальныеЗаписи.Сотрудник,СтатусВИнтернетБанке);
									
									Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сотрудник) Тогда
										ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'для "+ВыборкаДетальныеЗаписи.Сотрудник+" в строке "+ВыборкаДетальныеЗаписи.Position+" присвоен статус: """ + СтатусВИнтернетБанке + """'; ka = 'для "+ВыборкаДетальныеЗаписи.Сотрудник+" в строке "+ВыборкаДетальныеЗаписи.Position+" присвоен статус: """ + СтатусВИнтернетБанке + """'"));
									Иначе
										ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'присвоен статус: """ + СтатусВИнтернетБанке + """'; ka = 'присвоен статус: """ + СтатусВИнтернетБанке + """'"));
									КонецЕсли
									
								КонецЕсли;
							
							Иначе	
								
								ТекущийСтатусДокументаВИнтернетБанке = ВыборкаДетальныеЗаписи.СтатусДокументаВИнтернетБанке;
								
								Если СтатусВИнтернетБанке = ТекущийСтатусДокументаВИнтернетБанке Тогда
									
									ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'не было изменений'; ka = 'не было изменений'"));
									
								Иначе
									
									ЗаписатьНовыйСтатусДокумента(ДатаОбновления,ДокументСсылка,Банк,ВыборкаДетальныеЗаписи.Position,СтатусВИнтернетБанке,ВыборкаДетальныеЗаписи.Сотрудник);
									
									ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'присвоен статус: """ + СтатусВИнтернетБанке + """'; ka = 'присвоен статус: """ + СтатусВИнтернетБанке + """'"));
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;					
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ СтатусПолучен Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка при получении статуса для документа """+ ДокументСсылка + """'; ka = 'Ошибка при получении статуса для документа """+ ДокументСсылка + """'"));
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьНовыйСтатусДокумента(ДатаОбновления,ДокументСсылка,Банк,position,СтатусВИнтернетБанке,Сотрудник,СтатусПозиции=НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	
	ТекPosition = ЧИСЛО(position);

	ДатаОбновления = ТекущаяДата();
	НаборЗаписейСтатусовДокумента = РегистрыСведений.СтатусыДокументовВИнтернетБанке.СоздатьНаборЗаписей();
	НаборЗаписейСтатусовДокумента.Отбор.Период.Установить(ДатаОбновления);
	НаборЗаписейСтатусовДокумента.Отбор.ДокументСсылка.Установить(ДокументСсылка);
	НаборЗаписейСтатусовДокумента.Отбор.Банк.Установить(Банк);
	НаборЗаписейСтатусовДокумента.Отбор.Position.Установить(ТекPosition);
	
	НовыйСтатус = НаборЗаписейСтатусовДокумента.Добавить();
	НовыйСтатус.Период = ДатаОбновления;
	НовыйСтатус.ДокументСсылка = ДокументСсылка;
	НовыйСтатус.Банк = Банк;
	НовыйСтатус.Position = ТекPosition;
	НовыйСтатус.СтатусДокументаВИнтернетБанке = СтатусВИнтернетБанке;
	НовыйСтатус.Сотрудник = Сотрудник;
	НовыйСтатус.СтатусПозицииДокументаВИнтернетБанке = СтатусПозиции;
	
	НаборЗаписейСтатусовДокумента.Записать();

КонецПроцедуры

Функция ПолучитьМассив_УИД_Документа(ДокументСсылка) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = Новый Массив();
	
	Банк = ПолучитьБанкИзСсылкиНаДокумент(ДокументСсылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УИДДокументовВИнтернетБанке.ДокументСсылка КАК ДокументСсылка,
		|	ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """""""") КАК УИД
		|ИЗ
		|	РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
		|ГДЕ
		|	УИДДокументовВИнтернетБанке.ДокументСсылка = &ДокументСсылка
		|	И УИДДокументовВИнтернетБанке.Банк = &Банк";
	
	Запрос.УстановитьПараметр("Банк", Банк);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		РЕЗ = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("УИД");
	КонецЕсли;
	
	Возврат РЕЗ;
	
КонецФункции

Процедура ОбработатьДанныеДвиженийПоСчетуНаСервере(СтруктураОтвета,ТаблицаДвиженийПоСчетуАдресВременногоХранилища) ЭКСПОРТ
	
	Если СтруктураОтвета.Свойство("ТекстОшибки") Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураОтвета.ТекстОшибки);
		
	Иначе
		
		ТаблицаДвиженийПоСчету = ПолучитьИзВременногоХранилища(ТаблицаДвиженийПоСчетуАдресВременногоХранилища);
		
		Если Структураответа.Свойство("accountMovement") Тогда 
			
			Если ТипЗнч(Структураответа.accountMovement) = Тип("Массив") Тогда 
				Для Каждого ЭлемМассива Из Структураответа.accountMovement Цикл 
					
					СтруктураЗаполнения = ЭлемМассива;
					
					ДобавитьСтрокуТаблицыДвиженийПоСчету(СтруктураЗаполнения, ТаблицаДвиженийПоСчету);
					
				КонецЦикла;
			ИначеЕсли ТипЗнч(Структураответа.accountMovement) = Тип("Структура") Тогда	
				
				СтруктураЗаполнения = Структураответа.accountMovement;
				
				ДобавитьСтрокуТаблицыДвиженийПоСчету(СтруктураЗаполнения, ТаблицаДвиженийПоСчету);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуТаблицыДвиженийПоСчету(СтруктураЗаполнения, ТаблицаДвиженийПоСчету)
	
	СтрокаТаблицаДвиженийПоСчету = ТаблицаДвиженийПоСчету.Добавить();
	
	ЗаполнитьЗначенияСвойств(СтрокаТаблицаДвиженийПоСчету, СтруктураЗаполнения);
	
	Если СтруктураЗаполнения.Свойство("amount") Тогда 
		ЗаполнитьЗначенияСвойств(СтрокаТаблицаДвиженийПоСчету, СтруктураЗаполнения.amount);
	КонецЕсли;
	
КонецПроцедуры

