

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АдресЗарплатыВХранилище") Тогда 
		АдресЗарплатыВХранилище = Параметры.АдресЗарплатыВХранилище;
	КонецЕсли;
	
	Элементы.РезультатРаспознания.Видимость = ЛОЖЬ;
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбразецФормата_xlsx(Команда)
	
	ОткрытьОбразец("xlsx");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспознатьДанные(Команда)
	
	ОчиститьСообщения();
	ПроверитьЗаполнение();
	РаспознатьДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ЗаписатьПодборВХранилище();
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    ДиалогВыбораФайла.ПолноеИмяФайла = "";
    Фильтр = "Табличный документ (*.xls, *.xlsx, *.mxl)|*.xls;*.xlsx;*.mxl|";
    ДиалогВыбораФайла.Фильтр = Фильтр;
    ДиалогВыбораФайла.Заголовок = "Выберите файлы";
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
  		
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
		//++Lazare 
		БинДанные = Новый ДвоичныеДанные(ДиалогВыбораФайла.ПолноеИмяФайла);		
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(БинДанные, ЭтаФорма.УникальныйИдентификатор);
		ВыполнитьЗагрузкуНаСервере(АдресВременногоХранилища);
		//--Lazare
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере(Адрес)
	
	// Получение данных из временного хранилища
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	
	// Получение имени временного файла	
	//ИмяВременногоФайла = ПолучитьИмяВременногоФайла("*.xls, *.xlsx, *.mxl)|*.xls;*.xlsx;*.mxl|");
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	
	ПутьКФайлуНаСервере = ИмяВременногоФайла;
	// Сохранение данных во временный файл
	Данные.Записать(ИмяВременногоФайла);
	
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла);

КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьДанныеФайлаОбразцаЗагрузки(ДанныеФайла, Расширение)
	
	Перем Менеджер;	
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ПолучитьМенеджерПоИмениОбъектаЗаполнения("Документ.НачислениеЗарплаты",Менеджер);
	
	Образец_xlsx = Менеджер.ПолучитьМакетЗагрузки();
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);	
	Адрес = ОбразецЗагрузкиДанных_xlsx;
	                   	
	НаименованиеФайлаБезРасширения = Нстр("ka='მონაცემების ჩატვირთვის ნიმუში';ru='ОбразецЗагрузкиДанных';en='ObrazetsZagruzkiDannyh'");
	
	ДанныеФайла.Вставить("ДатаМодификацииУниверсальная",ТекущаяДата());
	ДанныеФайла.Вставить("Зашифрован", 					Ложь);
	ДанныеФайла.Вставить("ИмяФайла",					НаименованиеФайлаБезРасширения + "." + Расширение);
	ДанныеФайла.Вставить("Наименование",				НаименованиеФайлаБезРасширения);
	ДанныеФайла.Вставить("ОтносительныйПуть",			"LD\"); //LoadData
	ДанныеФайла.Вставить("ПодписанЭП",					Ложь);
	ДанныеФайла.Вставить("Размер",						Неопределено);
	ДанныеФайла.Вставить("Расширение",					Расширение);
	ДанныеФайла.Вставить("Редактирует",					Неопределено);
	ДанныеФайла.Вставить("СсылкаНаДвоичныеДанныеФайла", Адрес);
	ДанныеФайла.Вставить("ФайлРедактируетТекущийПользователь", Ложь);
	ДанныеФайла.Вставить("ФайлРедактируется",			Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбразец(Расширение)
	
	ДанныеФайла = Новый Структура;
	ЗаполнитьДанныеФайлаОбразцаЗагрузки(ДанныеФайла, Расширение);
	
	ПрисоединенныеФайлыКлиент.ОткрытьФайл(ДанныеФайла, Ложь);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапроса(ИмяКолонки)
	
	Если ИмяКолонки = "Контрагенты" Тогда 	
		
		Возврат
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Код КАК Код,
		|	Контрагенты.ИНН КАК ИНН
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЭтоГруппа = ЛОЖЬ"		 
	Иначе		 
		Возврат
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Код КАК Код,
		|	Номенклатура.ОсновнойШтрихКод КАК ОсновнойШтрихКод,
		|	Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура"
		
	КонецЕсли;

	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуПоиску(ИмяКолонки)

	ТаблицаВозврата = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса(ИмяКолонки);
	ТаблицаВозврата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаВозврата;
	
КонецФункции // ПолучитьТаблицуПоиску(ЭлемСписка.Представление)()

&НаСервере
Функция ОпределитьСсылку(ТаблицаПоиска, ТекстЯчейки, НомерСтроки, МетодПоиска )

	
	Если МетодПоиска = 1 Тогда 		
		
		ПоискСтрокиКод = ТаблицаПоиска.НайтиСтроки(Новый Структура("Код", ТекстЯчейки));	
		
		Если ПоискСтрокиКод.Количество() = 1 Тогда 
			Возврат ПоискСтрокиКод[0].Ссылка;
		ИначеЕсли ПоискСтрокиКод.Количество() > 1 Тогда
			Сообщить("სტრიქონი №: "+НомерСтроки+", კოდის მიხედვით მოიძებნა ერთზე მეტი ელემენტი """+ТекстЯчейки+"""");
			Возврат НЕОПРЕДЕЛЕНО;
		КонецЕсли;
		
	ИначеЕсли  МетодПоиска = 2 Тогда		
		
		ПоискСтрокиИНН = ТаблицаПоиска.НайтиСтроки(Новый Структура("ИНН", ТекстЯчейки));
		
		Если ПоискСтрокиИНН.Количество() = 1 Тогда 
			Возврат ПоискСтрокиИНН[0].Ссылка;
		ИначеЕсли ПоискСтрокиИНН.Количество() > 1 Тогда
			Сообщить("სტრიქონი №: "+НомерСтроки+",საიდენტიფიკაციო კოდის მიხედვით მოიძებნა ერთზე მეტი ელემენტი """+ТекстЯчейки+"""");
			Возврат НЕОПРЕДЕЛЕНО;
		КонецЕсли;
		
	ИначеЕсли  МетодПоиска = 3 Тогда
		ПоискСтрокиАртикул = ТаблицаПоиска.НайтиСтроки(Новый Структура("Артикул", ТекстЯчейки));
		
		Возврат ПоискСтрокиАртикул[0].Ссылка;
		
	ИначеЕсли  МетодПоиска = 4 Тогда
		ПоискСтрокиШтрихкод = ТаблицаПоиска.НайтиСтроки(Новый Структура("ОсновнойШтрихКод", ТекстЯчейки));
		
		Возврат ПоискСтрокиШтрихкод[0].Ссылка;
		
	КонецЕсли;
	
	Сообщить("სტრიქონი №: "+НомерСтроки+", ძიებამ შედეგი არ გამოიღო. ძებნის მნიშვნელობა: """+ТекстЯчейки+"""");
	Возврат НЕОПРЕДЕЛЕНО;
	
КонецФункции 

&НаСервере
Процедура РаспознатьДанныеНаСервере()
	
	ТаблицаРезультат.Очистить();
	Элементы.Декорация1.Видимость = Истина;
	
	Элементы.ТабличныйДокумент.Видимость = ЛОЖЬ;
	
	тзОбрабоки = ТаблицаРезультат.Выгрузить();
	МассивНомеровКолонок = Новый Массив;
	
	СтруктураТаблицПоиска = Новый Структура;
	СтруктураТаблицПоиска.Вставить("Контрагенты", ПолучитьТаблицуПоиску("Контрагенты"));
	СтруктураТаблицПоиска.Вставить("Номенклатури", ПолучитьТаблицуПоиску("Номенклатура"));
 
	
	НомерСтроки = ?(НачальнаяСтрокаЧтения = 0, 2, НачальнаяСтрокаЧтения);
	КолСтрок = ТабличныйДокумент.ВысотаТаблицы;
	КолвоПустыхСтрокПодряд = 0;
	
	
	ВсяСтрокаПустая = Истина;
	СтруктураЗаполнения = Новый Структура;
	
	Для НомерСтроки = 2   По КолСтрок Цикл			
		
		ТаблицаПоискаКонтрагентов = СтруктураТаблицПоиска["Контрагенты"];
		ТаблицаПоискаНоменклатури = СтруктураТаблицПоиска["Номенклатури"];		
		
		//Период
		ТекстЯчейкиДатаОкончания = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C1").Текст);			
		Если НЕ СтруктураЗаполнения.Свойство("Период") Тогда 
			СтруктураЗаполнения.Вставить("Период", Дата(1,1,1));
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтруктураЗаполнения["Период"], ТекстЯчейкиДатаОкончания);

		
		//Контрагент
		ТекстЯчейкиКонтрагент = ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C2").Текст;		
		СтруктураЗаполнения.Вставить("Контрагент", ОпределитьСсылку(ТаблицаПоискаКонтрагентов, ТекстЯчейкиКонтрагент, НомерСтроки, МетодПоискаКонтрагента));	
		
		//Номенклатура
		ТекстЯчейкиНоменклатура = ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C3").Текст;		
		СтруктураЗаполнения.Вставить("Номенклатура", ОпределитьСсылку(ТаблицаПоискаНоменклатури, ТекстЯчейкиНоменклатура, НомерСтроки, МетодПоискаНоменклатур));	
		
		//Розничная/Весовая		
		ТекстЯчейкаРозничнаяВесовая = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C4").Текст);	
		Если НЕ СтруктураЗаполнения.Свойство("РозничнаяВесовая") Тогда 
			СтруктураЗаполнения.Вставить("РозничнаяВесовая", 0);
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтруктураЗаполнения["РозничнаяВесовая"], ТекстЯчейкаРозничнаяВесовая, 0);

		//ПроцентМаркетинговогоБюджета	
		ТекстЯчейкаПроцентМаркетинговогоБюджета = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C5").Текст);	
		Если НЕ СтруктураЗаполнения.Свойство("ПроцентМаркетинговогоБюджета") Тогда 
			СтруктураЗаполнения.Вставить("ПроцентМаркетинговогоБюджета", 0);
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтруктураЗаполнения["ПроцентМаркетинговогоБюджета"], ТекстЯчейкаПроцентМаркетинговогоБюджета, 0);
		
		//ПроцентРетробонуса	
		ТекстЯчейкаПроцентРетробонуса = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C6").Текст);	
		Если НЕ СтруктураЗаполнения.Свойство("ПроцентРетробонуса") Тогда 
			СтруктураЗаполнения.Вставить("ПроцентРетробонуса", 0);
		КонецЕсли;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтруктураЗаполнения["ПроцентРетробонуса"], ТекстЯчейкаПроцентРетробонуса, 0);
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураЗаполнения);
		
		
	КонецЦикла;
	
	
	Элементы.Декорация1.Видимость = ЛОЖЬ;
	
	Элементы.ТабличныйДокумент.Видимость = ИСтина;
	
	Элементы.РезультатРаспознания.Видимость = Истина;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.РезультатРаспознания;
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	ТзДанныеЗагрузки = ТаблицаРезультат.Выгрузить();
	ПоместитьВоВременноеХранилище(ТзДанныеЗагрузки, АдресЗарплатыВХранилище);
	
	УдалитьФайлы(ПутьКФайлуНаСервере);
	
КонецПроцедуры

#КонецОбласти

