
&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	Если ИспользоватьХарактеристики Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВключаяХарактеристики" , "Доступность", НЕ ЗначениеЗаполнено(Запись.Характеристика));
		Если ЗначениеЗаполнено(Запись.Характеристика) Тогда
			
			Запись.ВключаяХарактеристики = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	СтруктураДанных = ПолучитьДанныеНоменклатураПриИзменении(Запись.Номенклатура);
	ИспользоватьХарактеристики = СтруктураДанных.ИспользоватьХарактеристики;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВключаяХарактеристики" , "Доступность", ИспользоватьХарактеристики);
	Если НЕ ИспользоватьХарактеристики Тогда	
		Запись.ВключаяХарактеристики = Ложь;	
	КонецЕсли;	
	//Lazare_
	ОсновнаяСпецификация = СтруктураДанных.ОсновнаяСпецификация ;
	ХарактеристикаОсновнойСпецификации = СтруктураДанных.ХарактеристикаОсновнойСпецификации ;
	Если ЗначениеЗаполнено(ОсновнаяСпецификация) Тогда 
		Запись.Спецификация   = ОсновнаяСпецификация ;
		Запись.Характеристика = ХарактеристикаОсновнойСпецификации ;
	КонецЕсли;	
	//_Lazare
			
КонецПроцедуры


Функция ПолучитьДанныеНоменклатураПриИзменении(Номенклатура)
	
	//Возврат Новый Структура("ИспользоватьХарактеристики", Номенклатура.ИспользоватьХарактеристики);
	
	 //Lazare_
	 ДанныеНоменклатуры = Новый Структура;
	 ДанныеНоменклатуры.Вставить("ИспользоватьХарактеристики", Номенклатура.ИспользоватьХарактеристики );
	 ДанныеНоменклатуры.Вставить("ОсновнаяСпецификация", Номенклатура.Спецификация );
	 ДанныеНоменклатуры.Вставить("ХарактеристикаОсновнойСпецификации", Номенклатура.Спецификация.ХарактеристикаПродукции);
	 Возврат   ДанныеНоменклатуры ;
	 //_Lazare
	 
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользоватьХарактеристики = Запись.Номенклатура.ИспользоватьХарактеристики;

КонецПроцедуры
