#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиОтчета.ПрограммноеИзменениеФормыОтчета = Истина;
	
	ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов);
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

Процедура ОбновитьНастройкиНаФорме(НастройкиОтчета, НастройкиСКД, Форма) Экспорт
	
	Возврат; //малышев 2025-10-02 ONESOFT-4382
		
	ТекущиеНастройки = НастройкиСКД;        
	
	ДополнительныеСвойства = КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	
	ТекущийПараметрПериод  = ТекущиеНастройки.ПараметрыДанных.Элементы.Найти("Период");  
	Если НастройкиОтчета.Свойство("Период") Тогда 
		ДатаНачала = НастройкиОтчета.Период.ДатаНачала;
		ДатаОкончания = НастройкиОтчета.Период.ДатаОкончания;
	Иначе	
		ДатаНачала = ТекущийПараметрПериод.Значение.ДатаНачала;
		ДатаОкончания = ТекущийПараметрПериод.Значение.ДатаОкончания;            
	КонецЕсли;
	Если ДатаОкончания < Дата("20241201000000") И НастройкиОтчета.ТекущийВариантСКД_ПлатежнаяВыпискаУдерживанияИсточникаПлатежа <> 0 Тогда
		
		СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		
		ОсновныеНастройки = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки;
		
		Для каждого ЭлементПараметра Из ТекущиеНастройки.ПараметрыДанных.Элементы Цикл
		
			ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Найти(ЭлементПараметра.ИдентификаторПользовательскойНастройки);
			Если ПараметрОсновнойНастройки = НЕОПРЕДЕЛЕНО Тогда
			
				ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Добавить();
			
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ПараметрОсновнойНастройки,ЭлементПараметра);
		
		КонецЦикла;  
		
		ОсновныеНастройки.Отбор.Элементы.Очистить();
		Для каждого ЭлементОтбор Из ТекущиеНастройки.Отбор.Элементы Цикл                             
		
			ОтборОсновнойНастройки = ОсновныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			ЗаполнитьЗначенияСвойств(ОтборОсновнойНастройки,ЭлементОтбор);
		
		КонецЦикла;    
		
		Для каждого ЭлементГрупп Из ТекущиеНастройки.Структура[0].ПоляГруппировки.Элементы Цикл  
			
			Для Каждого ЭлементГруппОС Из ОсновныеНастройки.Структура[0].ПоляГруппировки.Элементы Цикл 
				
				Если Строка(ЭлементГруппОС.Поле) = Строка(ЭлементГрупп.Поле) Тогда 
					ЭлементГруппОС.Использование = ЭлементГрупп.Использование;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, НастройкиОтчета.АдресСхемы);
		
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроек.ЗагрузитьНастройки(ОсновныеНастройки);
		КомпоновщикНастроек.Восстановить();  
		
		НастройкиОтчета.ТекущийВариантСКД_ПлатежнаяВыпискаУдерживанияИсточникаПлатежа = 0;
	ИначеЕсли ДатаНачала >= Дата("20250501000000") И НастройкиОтчета.ТекущийВариантСКД_ПлатежнаяВыпискаУдерживанияИсточникаПлатежа <> 1 Тогда
		
		СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных2025_0105");
		
		ОсновныеНастройки = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки;
		
		Для каждого ЭлементПараметра Из ТекущиеНастройки.ПараметрыДанных.Элементы Цикл
		
			ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Найти(ЭлементПараметра.ИдентификаторПользовательскойНастройки);
			Если ПараметрОсновнойНастройки = НЕОПРЕДЕЛЕНО Тогда
			
				ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Добавить();
			
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ПараметрОсновнойНастройки,ЭлементПараметра);
		
		КонецЦикла;                                                       
		
		ОсновныеНастройки.Отбор.Элементы.Очистить();
		Для каждого ЭлементОтбор Из ТекущиеНастройки.Отбор.Элементы Цикл                             
		
			ОтборОсновнойНастройки = ОсновныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			ЗаполнитьЗначенияСвойств(ОтборОсновнойНастройки,ЭлементОтбор);
		
		КонецЦикла;    
		
		Для каждого ЭлементГрупп Из ТекущиеНастройки.Структура[0].ПоляГруппировки.Элементы Цикл  
			
			Для Каждого ЭлементГруппОС Из ОсновныеНастройки.Структура[0].ПоляГруппировки.Элементы Цикл 
				
				Если Строка(ЭлементГруппОС.Поле) = Строка(ЭлементГрупп.Поле) Тогда 
					ЭлементГруппОС.Использование = ЭлементГрупп.Использование;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, НастройкиОтчета.АдресСхемы);
		
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроек.ЗагрузитьНастройки(ОсновныеНастройки);
		КомпоновщикНастроек.Восстановить();
		//
		НастройкиОтчета.ТекущийВариантСКД_ПлатежнаяВыпискаУдерживанияИсточникаПлатежа = 1;
		
	ИначеЕсли ДатаНачала >= Дата("20241201000000") И НастройкиОтчета.ТекущийВариантСКД_ПлатежнаяВыпискаУдерживанияИсточникаПлатежа <> 1 Тогда
		
		СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных2025");
		
		ОсновныеНастройки = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки;
		
		Для каждого ЭлементПараметра Из ТекущиеНастройки.ПараметрыДанных.Элементы Цикл
		
			ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Найти(ЭлементПараметра.ИдентификаторПользовательскойНастройки);
			Если ПараметрОсновнойНастройки = НЕОПРЕДЕЛЕНО Тогда
			
				ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Добавить();
			
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ПараметрОсновнойНастройки,ЭлементПараметра);
		
		КонецЦикла;                                                       
		
		ОсновныеНастройки.Отбор.Элементы.Очистить();
		Для каждого ЭлементОтбор Из ТекущиеНастройки.Отбор.Элементы Цикл                             
		
			ОтборОсновнойНастройки = ОсновныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			ЗаполнитьЗначенияСвойств(ОтборОсновнойНастройки,ЭлементОтбор);
		
		КонецЦикла;    
		
		Для каждого ЭлементГрупп Из ТекущиеНастройки.Структура[0].ПоляГруппировки.Элементы Цикл  
			
			Для Каждого ЭлементГруппОС Из ОсновныеНастройки.Структура[0].ПоляГруппировки.Элементы Цикл 
				
				Если Строка(ЭлементГруппОС.Поле) = Строка(ЭлементГрупп.Поле) Тогда 
					ЭлементГруппОС.Использование = ЭлементГрупп.Использование;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, НастройкиОтчета.АдресСхемы);
		
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроек.ЗагрузитьНастройки(ОсновныеНастройки);
		КомпоновщикНастроек.Восстановить();
		//
		НастройкиОтчета.ТекущийВариантСКД_ПлатежнаяВыпискаУдерживанияИсточникаПлатежа = 1;
		
	Иначе      
		Если ДатаНачала <> Дата(1,1,1) И ДатаОкончания  <> Дата(1,1,1) Тогда // Обычно так себя веде открытие ФормиОтчетаУНФ
			СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(НастройкиОтчета.АдресСхемы);         
			ОсновныеНастройки = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки;           
			
			Для каждого ЭлементГрупп Из ТекущиеНастройки.Структура[0].ПоляГруппировки.Элементы Цикл  
				
				Для Каждого ЭлементГруппОС Из ОсновныеНастройки.Структура[0].ПоляГруппировки.Элементы Цикл 
					
					Если Строка(ЭлементГруппОС.Поле) = Строка(ЭлементГрупп.Поле) Тогда 
						ЭлементГруппОС.Использование = ЭлементГрупп.Использование;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
			КонецЦикла;
			ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, НастройкиОтчета.АдресСхемы);
			
			КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
			КомпоновщикНастроек.ЗагрузитьНастройки(ОсновныеНастройки);
			КомпоновщикНастроек.Восстановить();      
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//Перенесено в модуль формы общей форми отчетов
	//// Kuzmich, 14.01.2025, (ONESOFT-3767) Новая форма Декларации (Приложение "А")
	ТекущиеНастройки = КомпоновщикНастроек.Настройки;        
	//
	ДополнительныеСвойства = КомпоновщикНастроек.Настройки.ДополнительныеСвойства;    
	
	//+++ Дмгг, 02.07.25, ONESOFT-4188
	//ТекущийАдресСхемы = НЕОПРЕДЕЛЕНО;
	//ТекущийУникальныйИдентификатор = НЕОПРЕДЕЛЕНО;
	//
	//Если НЕ ДополнительныеСвойства.Свойство("ТекущийАдресСхемы",ТекущийАдресСхемы) Тогда
	//	Если НЕ ДополнительныеСвойства.Свойство("ТекущийУникальныйИдентификатор",ТекущийУникальныйИдентификатор) Тогда
	//		ТекущийУникальныйИдентификатор = Новый УникальныйИдентификатор();
	//	КонецЕсли;
	//	ТекущийАдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ТекущийУникальныйИдентификатор);
	//КонецЕсли;
    //--- Дмгг, 02.07.25, ONESOFT-4188
	ТекущийПараметрПериод  = ТекущиеНастройки.ПараметрыДанных.Элементы.Найти("Период");
	ДатаНачала = ТекущийПараметрПериод.Значение.ДатаНачала;
	ДатаОкончания = ТекущийПараметрПериод.Значение.ДатаОкончания;
	Если ДатаОкончания < Дата("20241201000000")  Тогда
		
		СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		
		ОсновныеНастройки = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки;
		
		Для каждого ЭлементПараметра Из ТекущиеНастройки.ПараметрыДанных.Элементы Цикл
		
			ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Найти(ЭлементПараметра.ИдентификаторПользовательскойНастройки);
			Если ПараметрОсновнойНастройки = НЕОПРЕДЕЛЕНО Тогда
			
				ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Добавить();
			
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ПараметрОсновнойНастройки,ЭлементПараметра);
		
		КонецЦикла;  
		
		//+++ Дмгг, 25.03.25, ONESOFT-3938
		ОсновныеНастройки.Отбор.Элементы.Очистить();
		Для каждого ЭлементОтбор Из ТекущиеНастройки.Отбор.Элементы Цикл                             
		
			ОтборОсновнойНастройки = ОсновныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			ЗаполнитьЗначенияСвойств(ОтборОсновнойНастройки,ЭлементОтбор);
		
		КонецЦикла;    
		//--- Дмгг, 25.03.25, ONESOFT-3938
    //+++ Дмгг, 02.07.25, ONESOFT-4188
	//	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ТекущийАдресСхемы);
	//	
	//	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	//	КомпоновщикНастроек.ЗагрузитьНастройки(ОсновныеНастройки);
	//	КомпоновщикНастроек.Восстановить();
	//--- Дмгг, 02.07.25, ONESOFT-4188	      
	
	ИначеЕсли ДатаНачала >= Дата("20250501000000") Тогда
		
		СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных2025_0105");
		
		ОсновныеНастройки = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки;
		
		Для каждого ЭлементПараметра Из ТекущиеНастройки.ПараметрыДанных.Элементы Цикл
		
			ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Найти(ЭлементПараметра.ИдентификаторПользовательскойНастройки);
			Если ПараметрОсновнойНастройки = НЕОПРЕДЕЛЕНО Тогда
			
				ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Добавить();
			
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ПараметрОсновнойНастройки,ЭлементПараметра);
		
		КонецЦикла;                                                       
		
		ОсновныеНастройки.Отбор.Элементы.Очистить();
		Для каждого ЭлементОтбор Из ТекущиеНастройки.Отбор.Элементы Цикл                             
		
			ОтборОсновнойНастройки = ОсновныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			ЗаполнитьЗначенияСвойств(ОтборОсновнойНастройки,ЭлементОтбор);
		
		КонецЦикла;                                      
		
		Для каждого ЭлементГрупп Из ТекущиеНастройки.Структура[0].ПоляГруппировки.Элементы Цикл  
			
			Для Каждого ЭлементГруппОС Из ОсновныеНастройки.Структура[0].ПоляГруппировки.Элементы Цикл 
				
				Если Строка(ЭлементГруппОС.Поле) = Строка(ЭлементГрупп.Поле) Тогда 
					ЭлементГруппОС.Использование = ЭлементГрупп.Использование;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		//КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		//КомпоновщикНастроек.ЗагрузитьНастройки(ОсновныеНастройки);
		//КомпоновщикНастроек.Восстановить();
		
	ИначеЕсли ДатаНачала >= Дата("20241201000000")  Тогда
		
		СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных2025");
		
		ОсновныеНастройки = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки;
		
		Для каждого ЭлементПараметра Из ТекущиеНастройки.ПараметрыДанных.Элементы Цикл
		
			ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Найти(ЭлементПараметра.ИдентификаторПользовательскойНастройки);
			Если ПараметрОсновнойНастройки = НЕОПРЕДЕЛЕНО Тогда
			
				ПараметрОсновнойНастройки = ОсновныеНастройки.ПараметрыДанных.Элементы.Добавить();
			
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ПараметрОсновнойНастройки,ЭлементПараметра);
		
		КонецЦикла;                                                       
		
		//+++ Дмгг, 25.03.25, ONESOFT-3938
		ОсновныеНастройки.Отбор.Элементы.Очистить();
		Для каждого ЭлементОтбор Из ТекущиеНастройки.Отбор.Элементы Цикл                             
		
			ОтборОсновнойНастройки = ОсновныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			ЗаполнитьЗначенияСвойств(ОтборОсновнойНастройки,ЭлементОтбор);
		
		КонецЦикла;    
		//--- Дмгг, 25.03.25, ONESOFT-3938   
    //+++ Дмгг, 02.07.25, ONESOFT-4188
	//	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ТекущийАдресСхемы);
	//	
	//	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	//	КомпоновщикНастроек.ЗагрузитьНастройки(ОсновныеНастройки);
	//	КомпоновщикНастроек.Восстановить();
	//--- Дмгг, 02.07.25, ONESOFT-4188	
	КонецЕсли;
	//// Kuzmich, 14.01.2025, (ONESOFT-3767) Новая форма Декларации (Приложение "А")  
	//+++ Дмгг, 02.07.25, ONESOFT-4188
	//СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(ДополнительныеСвойства.ТекущийАдресСхемы);   
	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ДополнительныеСвойства.ТекущийАдресСхемы);
	//--- Дмгг, 02.07.25, ONESOFT-4188
	
	ОтчетыУНФ.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов)
	
	Для Каждого НастройкиТекВарианта Из НастройкиВариантов Цикл
		НастройкиТекВарианта.Значение.Теги = НСтр("ka='Зарплата,Налоги,Льготы,';ru='Зарплата,Налоги,Льготы,'");
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	Попытка
		НастройкиВариантов["Основной"].Теги = НСтр("ka='ხელფასი';ru='Зарплата';en='Salary'");
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
КонецПроцедуры
 
#КонецОбласти 

ЭтоОтчетУНФ = Истина;

#КонецЕсли
