
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКомандуПечати(Результат.Команда);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывает обработку заполнения документа по основанию.
//
&НаСервере
Процедура ЗаполнитьПоДокументу(ДокОснование)
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.Заполнить(ДокОснование);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Истина;
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаДокумента));
	Объект.Курс = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	Объект.Кратность = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
КонецПроцедуры // ЗаполнитьПоДокументу()

// Функция помещает табличную часть ВыданныеАвансы во временное хранилище
// и возвращает адрес
//
&НаСервере
Функция ПоместитьВыданныеАвансыВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.ВыданныеАвансы.Выгрузить(,
			"Документ,
			|Сумма"
		),
		УникальныйИдентификатор
	);
	
КонецФункции // ПоместитьВыданныеАвансыВХранилище()

&НаСервереБезКонтекста
Процедура ПолучитьДанныеПоШтрихКодам(СтруктураДанные, ИспользоватьТолькоРегламентированныйПланСчетов)
	
	// Преобразование весовых штрихкодов.
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ТекШтрихкод);
		
	КонецЦикла;
	
	ДанныеПоШтрихКодам = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодам(СтруктураДанные.МассивШтрихкодов);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		ДанныеШтрихкода = ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если ДанныеШтрихкода <> Неопределено
		   И ДанныеШтрихкода.Количество() <> 0 Тогда
			
			СтруктураДанныеНоменклатуры = Новый Структура();
			СтруктураДанныеНоменклатуры.Вставить("Организация", СтруктураДанные.Организация);
			СтруктураДанныеНоменклатуры.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
			СтруктураДанныеНоменклатуры.Вставить("ТипНоменклатуры", ДанныеШтрихкода.Номенклатура.ТипНоменклатуры);
			СтруктураДанныеНоменклатуры.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
			СтруктураДанныеНоменклатуры.Вставить("НалогообложениеНДС", СтруктураДанные.НалогообложениеНДС);
			ДанныеШтрихкода.Вставить("СтруктураДанныеНоменклатуры", ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры, ИспользоватьТолькоРегламентированныйПланСчетов));
			
			Если НЕ ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения) Тогда
				ДанныеШтрихкода.ЕдиницаИзмерения  = ДанныеШтрихкода.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДанные.Вставить("ДанныеПоШтрихКодам", ДанныеПоШтрихКодам);
	
	Для каждого парам Из Метаданные.Документы.АвансовыйОтчет.ТабличныеЧасти.Запасы.Реквизиты.Номенклатура.ПараметрыВыбора Цикл
		Если парам.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(парам.Значение)=Тип("ФиксированныйМассив") Тогда
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", парам.Значение);
			Иначе
			    МассивТипов = Новый Массив;
				МассивТипов.Добавить(парам.Значение);
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", МассивТипов);
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПолучитьДанныеПоШтрихКодам()

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Функция ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрикодов)
	
	НеизвестныеШтрихкоды = Новый Массив;
	ШтрихкодыНекорректногоТипа = Новый Массив;
	
	Если ТипЗнч(ДанныеШтрикодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрикодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрикодов);
	КонецЕсли;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("МассивШтрихкодов", МассивШтрихкодов);
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Дата", Объект.Дата);
	СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	ПолучитьДанныеПоШтрихКодам(СтруктураДанные, ИспользоватьТолькоРегламентированныйПланСчетов);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		ДанныеШтрихкода = СтруктураДанные.ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если ДанныеШтрихкода <> Неопределено
		   И ДанныеШтрихкода.Количество() = 0 Тогда
			НеизвестныеШтрихкоды.Добавить(ТекШтрихкод);
		ИначеЕсли СтруктураДанные.ОтборТипНоменклатуры.Найти(ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры) = Неопределено Тогда
			ШтрихкодыНекорректногоТипа.Добавить(Новый Структура("Штрихкод,Номенклатура,ТипНоменклатуры", ТекШтрихкод.Штрихкод, ДанныеШтрихкода.Номенклатура, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры));
		Иначе
			МассивСтрокТЧ = Объект.Запасы.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,ЕдиницаИзмерения",ДанныеШтрихкода.Номенклатура,ДанныеШтрихкода.Характеристика,ДанныеШтрихкода.ЕдиницаИзмерения));
			Если МассивСтрокТЧ.Количество() = 0 Тогда
				НоваяСтрока = Объект.Запасы.Добавить();
				НоваяСтрока.Номенклатура = ДанныеШтрихкода.Номенклатура;
				НоваяСтрока.Характеристика = ДанныеШтрихкода.Характеристика;
				НоваяСтрока.Партия = ДанныеШтрихкода.Партия;
				НоваяСтрока.Количество = ТекШтрихкод.Количество;
				НоваяСтрока.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения), ДанныеШтрихкода.ЕдиницаИзмерения, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЕдиницаИзмерения);
				РассчитатьСуммуВСтрокеТабличнойЧасти(НоваяСтрока);
				Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
			Иначе
				НайденнаяСтрока = МассивСтрокТЧ[0];
				НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + ТекШтрихкод.Количество;
				РассчитатьСуммуВСтрокеТабличнойЧасти(НайденнаяСтрока);
				Элементы.Запасы.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа",НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа);
	
КонецФункции // ЗаполнитьПоДаннымШтрихкодов()

&НаКлиенте
Процедура ПолученыШтрихкоды(ДанныеШтрикодов) Экспорт
	
	Модифицированность = Истина;
	
	НедобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрикодов);
	НеизвестныеШтрихкоды		= НедобавленныеШтрихкоды.НеизвестныеШтрихкоды;
	ШтрихкодыНекорректногоТипа	= НедобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
	
	ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	
	Если НеизвестныеШтрихкоды.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПолученыШтрихкодыЗавершение", ЭтотОбъект, НеизвестныеШтрихкоды);
		
		ОткрытьФорму(
			"РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры",
			Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды), ЭтотОбъект,,,,Оповещение
		);
		
		Возврат;
		
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры // ПолученыШтрихкоды()

&НаКлиенте
Процедура ПолученыШтрихкодыЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт
	
	НеизвестныеШтрихкоды = Параметры;
	
	Если ВозвращаемыеПараметры <> Неопределено Тогда
		
		МассивШтрихкодов = Новый Массив;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ЗарегистрированныеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ПолученыНовыеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		НедобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(МассивШтрихкодов);
		НеизвестныеШтрихкоды		= НедобавленныеШтрихкоды.НеизвестныеШтрихкоды;
		ШтрихкодыНекорректногоТипа	= НедобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
		ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды) Экспорт
	
	Для каждого ТекНеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
		
		СтрокаСообщения = НСтр("ka='მონაცემები შტრიხკოდის მიხედვით ნაპოვნი არ არის: %1%; რაოდენობა: %2%';ru='Данные по штрихкоду не найдены: %1%; количество: %2%';en='Data on the barcode is not found:% 1%; amount% 2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНеизвестныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНеизвестныйШтрихкод.Количество);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа) Экспорт
	
	Для каждого ТекНекорректныйШтрихкод Из ШтрихкодыНекорректногоТипа Цикл
		
		СтрокаСообщения = НСтр("ka='შტრიხკოდ %1%-ით მოძებნილ ნომენკლატურას -%2%- აქვს ტიპი %3%, რომელიც ამ ცხრილის შესაფერი არ არის';ru='Найденная по штрихкоду %1% номенклатура -%2%- имеет тип %3%, который не подходит для этой табличной части';en='Found by barcode nomenclature% 1% -% 2% - 3% of type%, which is not suitable for this table part'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНекорректныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНекорректныйШтрихкод.Номенклатура);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", ТекНекорректныйШтрихкод.ТипНоменклатуры);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

// Функция получает табличную часть ВыданныеАвансы из временного хранилища.
//
&НаСервере
Процедура ПолучитВыданныеАвансыИзХранилища(АдресВыданныеАвансыВХранилище)
	
	ТаблицаВыданныеАвансы = ПолучитьИзВременногоХранилища(АдресВыданныеАвансыВХранилище);
	Объект.ВыданныеАвансы.Очистить();
	Для каждого СтрокаВыданныеАвансы Из ТаблицаВыданныеАвансы Цикл
		Строка = Объект.ВыданныеАвансы.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаВыданныеАвансы);
	КонецЦикла;
	
КонецПроцедуры // ПолучитВыданныеАвансыИзХранилища()

// Процедура пересчитывает курс и кратность валюты документа при изменении
// даты документа.
//
&НаКлиенте
Процедура ПересчитатьКурсКратностьВалютыДокумента(СтруктураДанные)
	
	КурсНовый = ?(СтруктураДанные.ВалютаКурсКратность.Курс = 0, 1, СтруктураДанные.ВалютаКурсКратность.Курс);
	КратностьНовый = ?(СтруктураДанные.ВалютаКурсКратность.Кратность = 0, 1, СтруктураДанные.ВалютаКурсКратность.Кратность);
	
	Если Объект.Курс <> КурсНовый
		ИЛИ Объект.Кратность <> КратностьНовый Тогда
		
		КурсВалютыСтрокой = Строка(Объект.Кратность) + " " + СокрЛП(Объект.ВалютаДокумента) + " = " + Строка(Объект.Курс) + " " + СокрЛП(НациональнаяВалюта);
		КурсНовыйВалютыСтрокой = Строка(КратностьНовый) + " " + СокрЛП(Объект.ВалютаДокумента) + " = " + Строка(КурсНовый) + " " + СокрЛП(НациональнаяВалюта);
		
		ТекстСообщения = НСтр("ru = 'На дату документа у валюты документа (" + КурсВалютыСтрокой + ") был задан курс.
									|Установить курс документа (" + КурсНовыйВалютыСтрокой + ") в соответствии с курсом валюты?'");
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ПересчитатьКурсКратностьВалютыДокументаЗавершение", ЭтотОбъект, Новый Структура("КратностьНовый, КурсНовый", КратностьНовый, КурсНовый)), ТекстСообщения, Режим, 0);
		Возврат;
		
	КонецЕсли;
	
	// Сформируем надпись цены и валюты.
	ПересчитатьКурсКратностьВалютыДокументаФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКурсКратностьВалютыДокументаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	КратностьНовый = ДополнительныеПараметры.КратностьНовый;
	КурсНовый = ДополнительныеПараметры.КурсНовый;
	
	
	Ответ = Результат;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.Курс = КурсНовый;
		Объект.Кратность = КратностьНовый;
		
	КонецЕсли;
	
	
	ПересчитатьКурсКратностьВалютыДокументаФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКурсКратностьВалютыДокументаФрагмент()
	
	Перем СтруктураНадписи;
	
	СтруктураНадписи = Новый Структура("ВалютаДокумента, Курс, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС", Объект.ВалютаДокумента, Объект.Курс, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.НалогообложениеНДС);
	ВалютаДокумента = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);

КонецПроцедуры // ПересчитатьКурсКратностьВалютыДокумента()

// Процедура выполняет пересчет в табличной части документа после изменений 
// в форме "Цены и валюта".Выполняется пересчет колонок: цена, скидка, сумма,
// сумма НДС, всего.
//
&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеРедактироватьВалюту()
	
	СтруктураПараметров = Новый Структура();
	
	СтруктураПараметров.Вставить("ДатаДокумента",			Объект.Дата);
	СтруктураПараметров.Вставить("ВалютаДокумента",			Объект.ВалютаДокумента);
	СтруктураПараметров.Вставить("НалогообложениеНДС",		Объект.НалогообложениеНДС);
	СтруктураПараметров.Вставить("СуммаВключаетНДС",		Объект.СуммаВключаетНДС);
	СтруктураПараметров.Вставить("НДСВключатьВСтоимость",	Объект.НДСВключатьВСтоимость);
	СтруктураПараметров.Вставить("ПересчитатьЦеныПоВалюте",	Ложь);
	СтруктураПараметров.Вставить("Курс",					Объект.Курс);
	СтруктураПараметров.Вставить("Кратность",				Объект.Кратность);
	
	СтруктураВозврата = Неопределено;

	
	ОткрытьФорму("ОбщаяФорма.ФормаВалюта", СтруктураПараметров,,,,, Новый ОписаниеОповещения("ОбработатьИзмененияПоКнопкеРедактироватьВалютуЗавершение", ЭтотОбъект, Новый Структура("СтруктураПараметров", СтруктураПараметров)));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеРедактироватьВалютуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтруктураПараметров = ДополнительныеПараметры.СтруктураПараметров;
	
	СтруктураВозврата = Результат;
	
	Если НЕ ЗначениеЗаполнено(СтруктураВозврата)
		ИЛИ НЕ СтруктураВозврата.БылиВнесеныИзменения
		ИЛИ СтруктураВозврата.КодВозвратаДиалога = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, СтруктураВозврата);
	
	// Очистка табличной части выданные авансы.
	Если СтруктураПараметров.ВалютаДокумента <> СтруктураВозврата.ВалютаДокумента Тогда
		Объект.ВыданныеАвансы.Очистить();
	КонецЕсли;
	
	// Пересчитываем цены по валюте.
	Если СтруктураВозврата.ПересчитатьЦеныПоВалюте Тогда
		УправлениеНебольшойФирмойКлиент.ПересчитатьЦеныТабличнойЧастиПоВалюте(ЭтотОбъект, СтруктураПараметров.ВалютаДокумента, "Запасы");
		УправлениеНебольшойФирмойКлиент.ПересчитатьЦеныТабличнойЧастиПоВалюте(ЭтотОбъект, СтруктураПараметров.ВалютаДокумента, "Расходы");
	КонецЕсли;
	
	//Паганини ПФ_
	//// Пересчитываем сумму если изменился признак Налогообложение НДС.
	//Если НЕ СтруктураВозврата.НалогообложениеНДС = СтруктураВозврата.ПредНалогообложениеНДС Тогда
	//	ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
	//КонецЕсли;
	//
	//// Пересчитываем сумму если изменился признак "Сумма включает НДС".
	//Если НЕ Объект.СуммаВключаетНДС = СтруктураПараметров.СуммаВключаетНДС Тогда
	//	УправлениеНебольшойФирмойКлиент.ПересчитаемСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(ЭтотОбъект, "Запасы");
	//	УправлениеНебольшойФирмойКлиент.ПересчитаемСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(ЭтотОбъект, "Расходы");
	//КонецЕсли;
	Если СтруктураВозврата.НалогообложениеНДС <> СтруктураВозврата.ПредНалогообложениеНДС ИЛИ СтруктураВозврата.СуммаВключаетНДС <> СтруктураВозврата.ПредСуммаВключаетНДС Тогда 
		ЗаполнитьСтавкуНДСПоНалогообложениеНДС(СтруктураВозврата.ПредНалогообложениеНДС, СтруктураВозврата.ПредСуммаВключаетНДС);
	КонецЕсли;
	//_Паганини ПФ
	
	Для каждого СтрокаОплата Из Объект.Оплаты Цикл
		РассчитатьСуммуПлатежа(СтрокаОплата);
	КонецЦикла;
	
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа"); //+++ Дмгг
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма"); //+++ Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма") + Объект.ПлатежныеВедомостиДетальный.Итог("Сумма"); //+++ Дмгг, 07.05.2025, ONESOFT-4025
	
	// Сформируем надпись цены и валюты.
	СтруктураНадписи = Новый Структура("ВалютаДокумента, Курс, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС", Объект.ВалютаДокумента, Объект.Курс, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.НалогообложениеНДС);
	ВалютаДокумента = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);

КонецПроцедуры // ОбработатьИзмененияПоКнопкеРедактироватьВалюту()

// Рассчитывается сумма НДС в строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуНДС(СтрокаТабличнойЧасти)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100);
		
КонецПроцедуры // РассчитатьСуммуНДС()

// Выполняем пересчет суммы платежа в переданной строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуПлатежа(СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаРасчетов,
		СтрокаТабличнойЧасти.Курс,
		Объект.Курс,
		СтрокаТабличнойЧасти.Кратность,
		Объект.Кратность
	);
	//Паганини ПФ_
	ПересчитатьСуммыВСтрокиОплат(Элементы.Оплаты.ТекущаяСтрока, "ВидУдержанияПФ");
	//_Паганини ПФ
	
КонецПроцедуры // РассчитатьСуммуПлатежа()

// Процедура рассчитывает сумму в строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти = Неопределено, ИмяТабличнойЧасти = "", ИмяПоля = "")//Паганини ПФ + "ИмяПоля"
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
	
	Если ИмяТабличнойЧасти = "Расходы" Тогда
		ПересчитатьСуммыВСтрокиРасходов(Элементы.Расходы.ТекущаяСтрока, ИмяПоля);
	Иначе
		//Паганини ПФ_
		//СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
		//РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
		//СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);	
		ПересчитатьСуммыВСтрокиЗапасов(Элементы.Запасы.ТекущаяСтрока, ИмяПоля);
		//_Паганини ПФ
	КонецЕсли;
	//РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	//СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа"); //+++ Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

&НаСервере
Функция ПолучитьЗначенииСтавок(СтавкаНДС, ТипНДФЛ)

	СтруктураСтавок = Новый Структура;
	СтруктураСтавок.Вставить("СтавкаНДС",		СтавкаНДС.Ставка);
	СтруктураСтавок.Вставить("СтавкаНДФЛ",		ТипНДФЛ.Ставка);
	СтруктураСтавок.Вставить("ПредСтавкаНДС",	СтавкаНДС.Ставка);//ПредСтавкаНДС.Ставка);
	Возврат СтруктураСтавок;
	
КонецФункции

// Получает набор данных с сервера для процедуры ДоговорПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением, ВалютаДокумента)
	
	РазностьДат = УправлениеНебольшойФирмойСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	ВалютаКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаНовая, Новый Структура("Валюта", ВалютаДокумента));
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить(
		"РазностьДат",
		РазностьДат
	);
	СтруктураДанные.Вставить(
		"ВалютаКурсКратность",
		ВалютаКурсКратность
	);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

// Получает набор данных с сервера для процедуры ДоговорПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеОрганизацияПриИзменении(Организация)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Компания", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	СтруктураДанные.Вставить("ПодписьРуководителя", Организация.ПодписьРуководителя);
	СтруктураДанные.Вставить("ПодписьГлавногоБухгалтера", Организация.ПодписьГлавногоБухгалтера);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеОрганизацияПриИзменении()

// Процедура заполняет Ставку НДС в табличной части по системе налогообложения.
//
&НаСервере
Процедура ЗаполнитьСтавкуНДСПоНалогообложениеНДС(ПредНалогообложениеНДС, ПредСуммаВключаетНДС)//Паганини + 2 параметра
	
	Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		
		Элементы.ЗапасыСтавкаНДС.Видимость = Истина;
		Элементы.ЗапасыСуммаНДС.Видимость = Истина;
		Элементы.ЗапасыВсего.Видимость = Истина;
		Элементы.СчетФактураНадпись.Видимость = Истина;
		
		//Паганини ПФ_
		//Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		//	
		//	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС) Тогда
		//		СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
		//	Иначе
		//		СтрокаТабличнойЧасти.СтавкаНДС = Объект.Организация.СтавкаНДСПоУмолчанию;
		//	КонецЕсли;	
		//	
		//	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
		//	СтрокаТабличнойЧасти.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
		//							  		СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
		//							  		СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
		//	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
		//	
		//КонецЦикла;	
		//_Паганини ПФ	
		
		Элементы.РасходыСтавкаНДС.Видимость = Истина;
		Элементы.РасходыСуммаНДС.Видимость = Истина;
		Элементы.РасходыВсего.Видимость = Истина;
		
		//Паганини ПФ_
		//Для каждого СтрокаТабличнойЧасти Из Объект.Расходы Цикл
		//	
		//	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС) Тогда
		//		СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
		//	Иначе
		//		СтрокаТабличнойЧасти.СтавкаНДС = Объект.Организация.СтавкаНДСПоУмолчанию;
		//	КонецЕсли;	
		//	
		//	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
		//	СтрокаТабличнойЧасти.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
		//							  		СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
		//							  		СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
		//	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
		//	
		//КонецЦикла;
		//_Паганини ПФ
		
	Иначе
		
		Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
		Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
		Элементы.ЗапасыВсего.Видимость = Ложь;
		
		Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда	
			СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
			Элементы.СчетФактураНадпись.Видимость = Ложь;
		Иначе
			СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
			Элементы.СчетФактураНадпись.Видимость = Истина;
		КонецЕсли;	
		
		//Паганини ПФ_
		//Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		//
		//	СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
		//	СтрокаТабличнойЧасти.СуммаНДС = 0;
		//	
		//	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма;
		//	
		//КонецЦикла;	
		//_Паганини ПФ
		
		Элементы.РасходыСтавкаНДС.Видимость = Ложь;
		Элементы.РасходыСуммаНДС.Видимость = Ложь;
		Элементы.РасходыВсего.Видимость = Ложь;
		
		//Паганини ПФ_
		//Для каждого СтрокаТабличнойЧасти Из Объект.Расходы Цикл
		//
		//	СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
		//	СтрокаТабличнойЧасти.СуммаНДС = 0;
		//	
		//	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма;
		//	
		//КонецЦикла;	
		//_Паганини ПФ
		
	КонецЕсли;	
	
	//Паганини ПФ_
	ПересчитатьСуммыТЧ(ПредНалогообложениеНДС, ПредСуммаВключаетНДС, Объект.Организация.СтавкаНДСПоУмолчанию);
	//_Паганини ПФ
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоНалогообложениеНДС()	

// Получает набор данных с сервера для процедуры НоменклатураПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные, ИспользоватьТолькоРегламентированныйПланСчетов)
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	
	Если СтруктураДанные.Свойство("НалогообложениеНДС") 
		И НЕ СтруктураДанные.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		
		Если СтруктураДанные.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
			СтруктураДанные.Вставить("СтавкаНДС", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС());
		Иначе
			СтруктураДанные.Вставить("СтавкаНДС", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль());
		КонецЕсли;	
																
	ИначеЕсли ЗначениеЗаполнено(СтруктураДанные.Номенклатура.СтавкаНДС) Тогда
		СтруктураДанные.Вставить("СтавкаНДС", СтруктураДанные.Номенклатура.СтавкаНДС);
	Иначе
		СтруктураДанные.Вставить("СтавкаНДС", СтруктураДанные.Организация.СтавкаНДСПоУмолчанию);
	КонецЕсли;
	
	СтруктураДанные.Вставить("ОчиститьЗаказИПодразделение", Ложь);
	СтруктураДанные.Вставить("ОчиститьНаправлениеДеятельности", Ложь);
	
	Если НЕ ИспользоватьТолькоРегламентированныйПланСчетов Тогда //+++ Дмгг
		
		Если СтруктураДанные.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
			И СтруктураДанные.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы
			И СтруктураДанные.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
			И СтруктураДанные.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
			СтруктураДанные.ОчиститьЗаказИПодразделение = Истина;
		КонецЕсли;
		
		Если СтруктураДанные.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
			И СтруктураДанные.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.СебестоимостьПродаж
			И СтруктураДанные.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы Тогда
			СтруктураДанные.ОчиститьНаправлениеДеятельности = Истина;
		КонецЕсли;
		
	//+++ Дмгг	
	Иначе
		
		Если СтруктураДанные.Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.Расходы
			И СтруктураДанные.Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.Доходы
			И СтруктураДанные.Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
			И СтруктураДанные.Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
			СтруктураДанные.ОчиститьЗаказИПодразделение = Истина;
		КонецЕсли;
		
		Если СтруктураДанные.Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.Расходы
			И СтруктураДанные.Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.СебестоимостьПродаж
			И СтруктураДанные.Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.Доходы Тогда
			СтруктураДанные.ОчиститьНаправлениеДеятельности = Истина;
		КонецЕсли;
		
	КонецЕсли;
	//--- Дмгг
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

// Получает набор данных с сервера для процедуры ЕдиницаИзмеренияПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеЕдиницаИзмеренияПриИзменении(ТекущаяЕдиницаИзмерения = Неопределено, ЕдиницаИзмерения = Неопределено)
	
	СтруктураДанные = Новый Структура();
	
	Если ТекущаяЕдиницаИзмерения = Неопределено Тогда
		СтруктураДанные.Вставить("ТекущийКоэффициент", 1);
	Иначе
		СтруктураДанные.Вставить("ТекущийКоэффициент", ТекущаяЕдиницаИзмерения.Коэффициент);
	КонецЕсли;
	
	Если ЕдиницаИзмерения = Неопределено Тогда
		СтруктураДанные.Вставить("Коэффициент", 1);
	Иначе	
		СтруктураДанные.Вставить("Коэффициент", ЕдиницаИзмерения.Коэффициент);
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеЕдиницаИзмеренияПриИзменении()

// Получает набор данных с сервера для процедуры ДоговорПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеОплатыДоговорПриИзменении(Дата, Договор)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"ДоговорВалютаКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
			Дата,
			Новый Структура("Валюта", Договор.ВалютаРасчетов)
		)
	);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеОплатыДоговорПриИзменении()

// Получает набор данных с сервера для процедуры КонтрагентПриИзменении.
//
&НаСервере
Функция ПолучитьДанныеКонтрагентПриИзменении(Дата, Контрагент, Организация)
	
	СтруктураДанные = Новый Структура;
	
	Договор = Контрагент.ДоговорПоУмолчанию;
	СтруктураДанные.Вставить("Договор", Договор);
	
	СтруктураДанные.Вставить("ВестиРасчетыПоДоговорам", Контрагент.ВестиРасчетыПоДоговорам);
	СтруктураДанные.Вставить("ВестиРасчетыПоДокументам", Контрагент.ВестиРасчетыПоДокументам);
	СтруктураДанные.Вставить("ВестиРасчетыПоЗаказам", Контрагент.ВестиРасчетыПоЗаказам);
	СтруктураДанные.Вставить("ВестиУчетОплатыПоСчетам", Контрагент.ВестиУчетОплатыПоСчетам);
	
	СтруктураДанные.Вставить(
		"ДоговорВалютаКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
			Дата,
			Новый Структура("Валюта", Договор.ВалютаРасчетов)
		)
	);
	
	УстановитьВидимостьРеквизитовРасчетов(
		Контрагент.ВестиРасчетыПоДоговорам,
		Контрагент.ВестиРасчетыПоДокументам,
		Контрагент.ВестиРасчетыПоЗаказам,
		Контрагент.ВестиУчетОплатыПоСчетам
	);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеКонтрагентПриИзменении()

// Получает набор данных с сервера для процедуры ЕдиницаИзмеренияПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеНаправлениеДеятельностиНачалоВыбора(Номенклатура, ИспользоватьТолькоРегламентированныйПланСчетов)
	
	СтруктураДанные = Новый Структура;
	
	ВозможностьУказанияНаправленияДеятельности = Истина;
	
	Если НЕ ИспользоватьТолькоРегламентированныйПланСчетов Тогда //+++ Дмгг
		
		Если Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
			И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.СебестоимостьПродаж
			И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы Тогда
			ВозможностьУказанияНаправленияДеятельности = Ложь;
		КонецЕсли;
	//+++ Дмгг
	Иначе 
		
		Если Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.Расходы
			И Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.СебестоимостьПродаж
			И Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.Доходы Тогда
			ВозможностьУказанияНаправленияДеятельности = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	//--- Дмгг
	
	СтруктураДанные.Вставить("ВозможностьУказанияНаправленияДеятельности", ВозможностьУказанияНаправленияДеятельности);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНаправлениеДеятельностиНачалоВыбора()

// Получает набор данных с сервера для процедуры ЕдиницаИзмеренияПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеСтруктурнаяЕдиницаНачалоВыбора(Номенклатура, ИспользоватьТолькоРегламентированныйПланСчетов)
	
	СтруктураДанные = Новый Структура;
	
	ВозможностьУказанияПодразделения = Истина;
	
	Если НЕ ИспользоватьТолькоРегламентированныйПланСчетов Тогда //+++ Дмгг
		
		Если Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
			И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы
			И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
			И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
			ВозможностьУказанияПодразделения = Ложь;
		КонецЕсли;
	//+++ Дмгг
	Иначе 
		
		Если Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.Расходы
			И Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.Доходы
			И Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
			И Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
			ВозможностьУказанияПодразделения = Ложь;
		КонецЕсли;	
		
	КонецЕсли;
	//--- Дмгг
	
	СтруктураДанные.Вставить("ВозможностьУказанияПодразделения", ВозможностьУказанияПодразделения);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеСтруктурнаяЕдиницаНачалоВыбора()

// Получает набор данных с сервера для процедуры ЕдиницаИзмеренияПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеЗаказНачалоВыбора(Номенклатура, ИспользоватьТолькоРегламентированныйПланСчетов)
	
	СтруктураДанные = Новый Структура;
	
	ВозможностьУказанияЗаказа = Истина;
	
	Если НЕ ИспользоватьТолькоРегламентированныйПланСчетов Тогда //+++ Дмгг
		
		Если Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
			И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы
			И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
			И Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
			ВозможностьУказанияЗаказа = Ложь;
		КонецЕсли;
	//+++ Дмгг
	Иначе 
		
		Если Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.Расходы
			И Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.Доходы
			И Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
			И Номенклатура.СчетУчетаЗатратРегл.ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
			ВозможностьУказанияЗаказа = Ложь;
		КонецЕсли;	
		
	КонецЕсли;
	//--- Дмгг
	
	СтруктураДанные.Вставить("ВозможностьУказанияЗаказа", ВозможностьУказанияЗаказа);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеСтруктурнаяЕдиницаНачалоВыбора()

// Функция возвращает текст надписи "Цены и валюта".
//
&НаКлиентеНаСервереБезКонтекста
Функция СформироватьНадписьЦеныИВалюта(СтруктураНадписи)
	
	ТекстНадписи = "";
	
	// Валюта.
	Если СтруктураНадписи.УчетВалютныхОпераций Тогда
		Если ЗначениеЗаполнено(СтруктураНадписи.ВалютаДокумента) Тогда
			ТекстНадписи = НСтр("ka='%Валюта%';ru='%Валюта%';en='%Currency%'");
			ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Валюта%", СокрЛП(Строка(СтруктураНадписи.ВалютаДокумента)));
		КонецЕсли;
	КонецЕсли;
	
	// Налогообложение НДС.
	Если ЗначениеЗаполнено(СтруктураНадписи.НалогообложениеНДС) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%НалогообложениеНДС%';ru='%НалогообложениеНДС%';en='% NalogooblozhenieNDS%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ka=' • %НалогообложениеНДС%';ru=' • %НалогообложениеНДС%'");
		КонецЕсли;
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%НалогообложениеНДС%", РаботаСФормойДокументаКлиентСервер.КраткоеПредставлениеТипаНалогообложенияНДС(СтруктураНадписи.НалогообложениеНДС));
	КонецЕсли;
	
	// Флаг сумма включает НДС.
	Если ПустаяСтрока(ТекстНадписи) Тогда
		Если СтруктураНадписи.СуммаВключаетНДС Тогда
			ТекстНадписи = НСтр("ka='თანხა შეიცავს დღგ-ს';ru='Сумма включает НДС';en='The sum includes VAT'");
		Иначе
			ТекстНадписи = НСтр("ka='თანხა არ შეიცავს დღგ-ს';ru='Сумма не включает НДС';en='The sum does not include VAT'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстНадписи;
	
КонецФункции // СформироватьНадписьЦеныИВалюта()

// Процедура заполняет служебные реквизиты.
//
&НаСервереБезКонтекста
Процедура ЗаполнитьСлужебныеРеквизитыПоКонтрагентуВКоллекции(КоллекцияДанных)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Таблица.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
	|	Таблица.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ТаблицаКонтрагента
	|ИЗ
	|	&КоллекцияДанных КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаКонтрагента.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаКонтрагента.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаКонтрагента.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаКонтрагента.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам
	|ИЗ
	|	ТаблицаКонтрагента КАК ТаблицаКонтрагента";
	
	Запрос.УстановитьПараметр("КоллекцияДанных", КоллекцияДанных.Выгрузить( ,"НомерСтроки, Контрагент"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Для Сч = 0 По КоллекцияДанных.Количество() - 1 Цикл
		Выборка.Следующий(); // Количество строк в выборке по запросу всегда равно количеству строк в коллекции
		ЗаполнитьЗначенияСвойств(КоллекцияДанных[Сч], Выборка, "ВестиРасчетыПоДоговорам, ВестиРасчетыПоДокументам, ВестиРасчетыПоЗаказам, ВестиУчетОплатыПоСчетам");
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСлужебныеРеквизитыПоКонтрагентуВКоллекции()

&НаСервере
Процедура ОпределитьВидимостьНастроекУчетаВНалогообложении()
	
	Если РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Объект.Организация) Тогда
		Элементы.ГруппаУчетВНУ.Видимость = Ложь;
		
		Возврат;
	Иначе
		Элементы.ГруппаУчетВНУ.Видимость = Истина;
	КонецЕсли;
	
	СистемаНалогообложенияСтруктура = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(Объект.Организация, Объект.Дата);
	
	Если Не СистемаНалогообложенияСтруктура.ПлательщикУСН Тогда
		Элементы.ГруппаУчетВНУ.Видимость = Ложь;
	Иначе
		Элементы.ГруппаУчетВНУ.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ЗапасыТоварыНеДляПродажи.Видимость = Элементы.ГруппаУчетВНУ.Видимость;
	
КонецПроцедуры

#Область Подбор

&НаКлиенте
Процедура ЗапасыПодбор(Команда)
	
	ИмяТабличнойЧасти = "Запасы";
	
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("Период",				   Объект.Дата); 
	ПараметрыПодбора.Вставить("Организация",		   Компания);
	ПараметрыПодбора.Вставить("НалогообложениеНДС",	   Объект.НалогообложениеНДС);
	ПараметрыПодбора.Вставить("СуммаВключаетНДС",	   Объект.СуммаВключаетНДС);
	ПараметрыПодбора.Вставить("ОрганизацияДокумента",  Объект.Организация);
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("ТипНоменклатуры", ТипНоменклатуры);
	
	СтатусПартии = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Партия"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.Статус" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					СтатусПартии.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				СтатусПартии.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПодбора.Вставить("СтатусПартии", СтатусПартии);
	
	ПараметрыПодбора.Вставить("УникальныйИдентификаторФормыВладельца", УникальныйИдентификатор);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбора", ПараметрыПодбора, ЭтотОбъект);
	
КонецПроцедуры // ЗапасыПодбор()

&НаКлиенте
Процедура РасходыПодбор(Команда)
	
	ИмяТабличнойЧасти = "Расходы";
	
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("Период",				   Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",		   Компания);
	ПараметрыПодбора.Вставить("НалогообложениеНДС",	   Объект.НалогообложениеНДС);
	ПараметрыПодбора.Вставить("СуммаВключаетНДС",	   Объект.СуммаВключаетНДС);
	ПараметрыПодбора.Вставить("ОрганизацияДокумента",  Объект.Организация);
	ПараметрыПодбора.Вставить("ИспользуютсяХарактеристики", Ложь);
	ПараметрыПодбора.Вставить("ИспользуютсяПартии", Ложь);
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла;
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПодбора.Вставить("ТипНоменклатуры", ТипНоменклатуры);
	
	ПараметрыПодбора.Вставить("УникальныйИдентификаторФормыВладельца", УникальныйИдентификатор);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбора", ПараметрыПодбора, ЭтотОбъект);
	
КонецПроцедуры // РасходыПодбор()

&НаКлиенте
Процедура АвансыПодбор(Команда)
	
	АдресВыданныеАвансыВХранилище = ПоместитьВыданныеАвансыВХранилище();
	
	ПараметрыПодбора = Новый Структура(
		"АдресВыданныеАвансыВХранилище,
		|Компания,
		|Период,
		|Сотрудник,
		|ВалютаДокумента,
		|Ссылка",
		АдресВыданныеАвансыВХранилище,
		Компания,
		Объект.Дата,
		Объект.Сотрудник,
		Объект.ВалютаДокумента,
		Объект.Ссылка
	);
	
	Результат = Неопределено;

	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораАвансовПодотчетнику", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("АвансыПодборЗавершение", ЭтотОбъект, Новый Структура("АдресВыданныеАвансыВХранилище", АдресВыданныеАвансыВХранилище)));
	
КонецПроцедуры

&НаКлиенте
Процедура АвансыПодборЗавершение(Результат1, ДополнительныеПараметры) Экспорт
	
	АдресВыданныеАвансыВХранилище = ДополнительныеПараметры.АдресВыданныеАвансыВХранилище;
	
	
	Результат = Результат1;
	Если Результат = КодВозвратаДиалога.OK Тогда
		ПолучитВыданныеАвансыИзХранилища(АдресВыданныеАвансыВХранилище);
		
	КонецЕсли;

КонецПроцедуры // АвансыПодбор()

// Функция получает список товаров из временного хранилища
//
&НаСервере
Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьХарактеристики, ЕстьПартии)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		НоваяСтрока = Объект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
		Если НоваяСтрока.Свойство("Пометка") Тогда
			НоваяСтрока.Пометка = Истина;
		КонецЕсли;
		
		Если ИмяТабличнойЧасти = "Запасы" Тогда
			
			НоваяСтрока.СтруктурнаяЕдиница = ОсновнойСклад;
			
		КонецЕсли;
		
		Если ИмяТабличнойЧасти = "Расходы" Тогда
			
			НоваяСтрока.СтруктурнаяЕдиница = ОсновноеПодразделение;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

&НаКлиенте
Процедура ЗаполнитьПоОснованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДокументу(Объект.ДокументОснование);
		
		Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
		//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа"); //+++ Дмгг
		ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
		
		СтруктураНадписи = Новый Структура("ВалютаДокумента, Курс, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС", Объект.ВалютаДокумента, Объект.Курс, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.НалогообложениеНДС);
		ВалютаДокумента = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПоОснованию()

// ПодключаемоеОборудование
// Процедура - обработчик команды командной панели табличной части.
//
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ТекШтрихкод = "";
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект, Новый Структура("ТекШтрихкод", ТекШтрихкод)), ТекШтрихкод, НСтр("ka='შეიყვანეთ შტრიხკოდი';ru='Введите штрихкод';en='enter the barcode'"));

КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Результат = Неопределено, ДополнительныеПараметры.ТекШтрихкод, Результат);
	
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
		ПолученыШтрихкоды(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1));
	КонецЕсли;

КонецПроцедуры // ПоискПоШтрихкоду()

&НаКлиенте
Процедура ПолучитьВес(Команда)
	
	ПодключаемоеОборудованиеУНФКлиент.ПолучениеВесаСЭлектронныхВесовДляТабличнойЧасти(ЭтотОбъект, "Запасы");
	
КонецПроцедуры // ПолучитьВес()

&НаКлиенте
Процедура ПолучитьВесЗавершение(Параметры) Экспорт
	
	СтрокаТабличнойЧасти = Параметры;
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры

// Процедура - обработчик команды ЗагрузитьДанныеИзТСД.
//
&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ПодключаемоеОборудованиеУНФКлиент.ПолучитьДанныеИзТСД(ЭтотОбъект);
	
КонецПроцедуры // ЗагрузитьДанныеИзТСД()
// Конец ПодключаемоеОборудование

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
		//+++ Дмгг
		ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()); //+++ Дмгг
	Иначе
		ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ДатаДокумента);
		//--- Дмгг
	КонецЕсли;
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		И НЕ ЗначениеЗаполнено(Параметры.Основание) 
		И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		//Паганини ПФ_
	    //ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
		ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС(Истина);
		//_Паганини ПФ
	ИначеЕсли Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда	
		Элементы.ЗапасыСтавкаНДС.Видимость = Истина;
		Элементы.ЗапасыСуммаНДС.Видимость = Истина;
		Элементы.ЗапасыВсего.Видимость = Истина;
		Элементы.РасходыСтавкаНДС.Видимость = Истина;
		Элементы.РасходыСуммаНДС.Видимость = Истина;
		Элементы.РасходыВсего.Видимость = Истина;
		Элементы.СчетФактураНадпись.Видимость = Истина;
	Иначе
		Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
		Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
		Элементы.ЗапасыВсего.Видимость = Ложь;
		Элементы.РасходыСтавкаНДС.Видимость = Ложь;
		Элементы.РасходыСуммаНДС.Видимость = Ложь;
		Элементы.РасходыВсего.Видимость = Ложь;
		Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда
			Элементы.СчетФактураНадпись.Видимость = Истина;
		Иначе
			Элементы.СчетФактураНадпись.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Сформируем надпись цены и валюты.
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	СтруктураНадписи = Новый Структура("ВалютаДокумента, Курс, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС", Объект.ВалютаДокумента, Объект.Курс, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.НалогообложениеНДС);
	ВалютаДокумента = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойСклад");
	ОсновнойСклад = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
	
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновноеПодразделение");
	ОсновноеПодразделение = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
	Элементы.ЗапасыЗапасыПодбор.Видимость = ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.Запасы);
	Элементы.РасходыРасходыПодбор.Видимость = ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.Запасы);
	
	УправлениеНебольшойФирмойСервер.УстановитьТекстПроСчетФактуру(ЭтотОбъект, Истина);
	
	// Заполнение дополнительных реквизитов табличной части.
	УстановитьВидимостьРеквизитовРасчетов();
	
	//Установить надписи счет-фактура и основание
	НайденныйСчетФактура = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйСчетФактуру(Объект.Ссылка, Истина);
	Элементы.СчетФактураНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(НайденныйСчетФактура, Истина, СчетФактураТекст);
	Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Объект.ДокументОснование);

	// КопированиеСтрокТабличныхЧастей
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Запасы");
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Расходы");
	
	// ГрупповоеИзменениеСтрок
	ЗаполнитьСписокДействий("Запасы");
	ГрупповоеИзменениеСтрокСервер.ПриСозданииНаСервере(НаборЭлементовГрупповогоИзмененияСтрокСервер("Запасы"), ЭтотОбъект.ЗапасыИзменениеСтрокДействие);
	ЗапасыИзменениеСтрокДействиеПриОткрытии = ЗапасыИзменениеСтрокДействие;
	УстановитьПометку("Запасы", Истина);
	
	ЗаполнитьСписокДействий("Расходы");
	ГрупповоеИзменениеСтрокСервер.ПриСозданииНаСервере(НаборЭлементовГрупповогоИзмененияСтрокСервер("Расходы"), ЭтотОбъект.РасходыИзменениеСтрокДействие);
	РасходыИзменениеСтрокДействиеПриОткрытии = РасходыИзменениеСтрокДействие;
	УстановитьПометку("Расходы", Истина);
	// Конец ГрупповоеИзменениеСтрок
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	СписокЭлектронныхВесов = МенеджерОборудованияВызовСервера.ПолучитьСписокОборудования("ЭлектронныеВесы", , МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
	Если СписокЭлектронныхВесов.Количество() = 0 Тогда
		// Нет подключенных весов.
		Элементы.ЗапасыПолучитьВес.Видимость = Ложь;
	КонецЕсли;
	Элементы.ЗапасыЗагрузитьДанныеИзТСД.Видимость = ИспользоватьПодключаемоеОборудование;
	// Конец ПодключаемоеОборудование
	
	ОпределитьВидимостьНастроекУчетаВНалогообложении();
	ОбщегоНазначенияПереопределяемый.УстановитьДополнительноеПоведениеСтандартныхКнопокТЧЗапасы(ЭтаФорма);// Kuzmich, 07.08.2019, Дополнительные инструменты в табличных частях документов движения товаров
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
	// ГрупповоеИзменениеСтрок
	ОпределитьОбъектИзменений("Запасы");
	ОпределитьОбъектИзменений("Расходы");
	// Конец ГрупповоеИзменениеСтрок
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	Если НЕ ЗавершениеРаботы Тогда
		
		// ГрупповоеИзменениеСтрок
		СохранитьТекущееДействиеИзмененияСтрок();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.СчетФактураПолученный.Форма.ФормаДокумента" Тогда
		СчетФактураТекст = ВыбранноеЗначение;
		Элементы.СчетФактураНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(ВыбранноеЗначение, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование"
	   И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			//Преобразуем предварительно к ожидаемому формату
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;
			
			ПолученыШтрихкоды(Данные);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если ИмяСобытия = "ОбновлениеТекстаПроСчетФактуруПолученный" 
		И ТипЗнч(Параметр) = Тип("Структура") 
		И Параметр.ДокументОснование = Объект.Ссылка Тогда
				
		СчетФактураТекст = Параметр.Представление;
		Элементы.СчетФактураНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(Параметр.Представление, Истина);

	ИначеЕсли ИмяСобытия = "Запись_Контрагент" 
		И ЗначениеЗаполнено(Параметр) Тогда
			
		Для каждого ТекСтрока Из Объект.Оплаты Цикл
			
			Если Параметр = ТекСтрока.Контрагент Тогда
				
				УстановитьВидимостьРеквизитовРасчетов();
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
			
	ИначеЕсли ИмяСобытия = "ПодборПроизведен" 
		И ЗначениеЗаполнено(Параметр) 
		//Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
			
		АдресЗапасовВХранилище	= Параметр;
		ТекущаяСтраницыЗапасы	= (Элементы.Страницы.ТекущаяСтраница = Элементы.Товары);
		ИмяТабличнойЧасти		= ?(ТекущаяСтраницыЗапасы, "Запасы", "Расходы");
		
		ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ТекущаяСтраницыЗапасы, ТекущаяСтраницыЗапасы);
		
	КонецЕсли;
	
	// КопированиеСтрокТабличныхЧастей
	Если ИмяСобытия = "БуферОбменаТабличнаяЧастьКопированиеСтрок" Тогда
		КопированиеТабличнойЧастиКлиент.ОбработкаОповещения(Элементы, "Запасы");
		КопированиеТабличнойЧастиКлиент.ОбработкаОповещения(Элементы, "Расходы");
	КонецЕсли;
	
	// Обсуждения
	ОбсужденияКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "Проведение"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность",Модифицированность);
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Заполнение дополнительных реквизитов табличной части.
	УстановитьВидимостьРеквизитовРасчетов();
	
	// ГрупповоеИзменениеСтрок
	Если Элементы.ГруппаЗапасыИзменениеСтрок.Видимость Тогда
		УстановитьПометку("Запасы", Истина);
	КонецЕсли;
	Если Элементы.ГруппаРасходыИзменениеСтрок.Видимость Тогда
		УстановитьПометку("Расходы", Истина);
	КонецЕсли;
	// Конец ГрупповоеИзменениеСтрок
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Оповещение об оплате.
	ОповеститьОбОплатеСчета = Ложь;
	ОповеститьОбОплатеЗаказа = Ложь;
	
	Для каждого ТекСтрока Из Объект.Оплаты Цикл
		ОповеститьОбОплатеСчета = ?(
			ОповеститьОбОплатеСчета,
			ОповеститьОбОплатеСчета,
			ЗначениеЗаполнено(ТекСтрока.СчетНаОплату)
		);
		ОповеститьОбОплатеЗаказа = ?(
			ОповеститьОбОплатеЗаказа,
			ОповеститьОбОплатеЗаказа,
			ЗначениеЗаполнено(ТекСтрока.Заказ)
		);
	КонецЦикла;
	
	Если ОповеститьОбОплатеСчета Тогда
		ОповеститьОбИзменении(Тип("ДокументСсылка.СчетНаОплатуПоставщика"));
	КонецЕсли;
	
	Если ОповеститьОбОплатеЗаказа Тогда
		Оповестить("ОповещениеОбОплатеЗаказа");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением, Объект.ВалютаДокумента);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
			ПересчитатьКурсКратностьВалютыДокумента(СтруктураДанные);
		КонецЕсли;	
		
	КонецЕсли;
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ДатаДокумента); //+++ Дмгг
	
КонецПроцедуры // ДатаПриИзменении()

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	// Обработка события изменения организации.
	Объект.Номер = "";
	СтруктураДанные = ПолучитьДанныеОрганизацияПриИзменении(Объект.Организация);
	Компания = СтруктураДанные.Компания;
	
	Объект.ПодписьРуководителя = СтруктураДанные.ПодписьРуководителя;
	Объект.ПодписьГлавногоБухгалтера = СтруктураДанные.ПодписьГлавногоБухгалтера;
	
	ОпределитьВидимостьНастроекУчетаВНалогообложении();
КонецПроцедуры // ОрганизацияПриИзменении()

&НаКлиенте
Процедура РедактироватьВалютуДокумента(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьИзмененияПоКнопкеРедактироватьВалюту();
	Модифицированность = Истина;
	
КонецПроцедуры // РедактироватьВалютуДокумента()

&НаКлиенте
Процедура ЗапасыСодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.Запасы.ТекущиеДанные;
	СтуктураРеквизита = Новый Структура("Объект,ТабЧасть,НомерСтроки,ИмяРеквизита", "Объект","Запасы",ТекСтрока.НомерСтроки-1,"Содержание");
	ОбщегоНазначенияКлиентПереопределяемый.ПоказатьФормуРедактированияРеквизита(Элемент.ТекстРедактирования, ЭтотОбъект, СтуктураРеквизита, Строка(ТекСтрока.Номенклатура)+": содержание");
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыСодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.Расходы.ТекущиеДанные;
	СтуктураРеквизита = Новый Структура("Объект,ТабЧасть,НомерСтроки,ИмяРеквизита", "Объект","Расходы",ТекСтрока.НомерСтроки-1,"Содержание");
	ОбщегоНазначенияКлиентПереопределяемый.ПоказатьФормуРедактированияРеквизита(Элемент.ТекстРедактирования, ЭтотОбъект, СтуктураРеквизита, Строка(ТекСтрока.Номенклатура)+": содержание");
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода Документ.
//
&НаКлиенте
Процедура ВыданныеАвансыДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ТекстСообщения = НСтр("ka='დასაწყისში მიუთითეთ თანამშრომელი!';ru='Укажите вначале сотрудника!';en='Specify the first employee!'");
		ПоказатьПредупреждение(Неопределено,ТекстСообщения);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ВыданныеАвансыДокументНачалоВыбора()

// Процедура - обработчик события ПриНачалеРедактирования строки списка Запасы.
//
&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда 
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ОсновнойСклад;
		//Паганини_
		Если НЕ Копирование Тогда
			СтрокаТабличнойЧасти.ВидНалогаНДС = РС_ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Организация, "ВидНалогаНДС");
		КонецЕсли;
		//_Паганини
	КонецЕсли;
	//Паганини ПФ_
	ТекСтрока = Элементы.Запасы.ТекущиеДанные;
	ТекСтрока.ПредСтавкаНДС = ТекСтрока.СтавкаНДС;
	ТекСтрока.ПредВидУдержанияПФ = ТекСтрока.ВидУдержанияПФ;
	ТекСтрока.ПредВидУдержанияНДФЛ = ТекСтрока.ВидУдержанияНДФЛ;
	//_Паганини ПФ
	
	// ГрупповоеИзменениеСтрок
	Элемент.ТекущиеДанные.Пометка = Истина;
	// Конец ГрупповоеИзменениеСтрок
	
КонецПроцедуры // ЗапасыПриНачалеРедактирования()

// Процедура - обработчик события ПриИзменении поля ввода Номенклатура.
//
&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные, ИспользоватьТолькоРегламентированныйПланСчетов);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Количество = 1;
	СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
	СтрокаТабличнойЧасти.Содержание = "";
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры // ЗапасыНоменклатураПриИзменении()

// Процедура - обработчик события АвтоПодбор поля ввода Содержание.
//
&НаКлиенте
Процедура ЗапасыСодержаниеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		ШаблонСодержания = УправлениеНебольшойФирмойСервер.ПолучитьТекстСодержания(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.Характеристика);
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ШаблонСодержания);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Количество.
//
&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	//Паганини ПФ_
	//СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	//
	//РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	РассчитатьСуммуВСтрокеТабличнойЧасти(Элементы.Расходы.ТекущаяСтрока, "Запасы", "Количество");
	//_Паганини ПФ
	
КонецПроцедуры // ЗапасыКоличествоПриИзменении()

// Процедура - обработчик события ОбработкаВыбора поля ввода ЕдиницаИзмерения.
//
&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ЕдиницаИзмерения = ВыбранноеЗначение 
	 ИЛИ СтрокаТабличнойЧасти.Цена = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКоэффициент = 0;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущийКоэффициент = 1;
	КонецЕсли;
	
	Коэффициент = 0;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Коэффициент = 1;
	КонецЕсли;
	
	Если ТекущийКоэффициент = 0 И Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения, ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	ИначеЕсли Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(,ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 1 И Коэффициент = 1 Тогда
		СтруктураДанные = Новый Структура("ТекущийКоэффициент, Коэффициент", 1, 1);
	КонецЕсли;
	
	// Цена.
	Если СтруктураДанные.ТекущийКоэффициент <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена * СтруктураДанные.Коэффициент / СтруктураДанные.ТекущийКоэффициент;
	КонецЕсли;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры // ЗапасыЕдиницаИзмеренияОбработкаВыбора()

// Процедура - обработчик события ПриИзменении поля ввода Цена.
//
&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	
	//Паганини ПФ_
	//СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	//
	//РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	РассчитатьСуммуВСтрокеТабличнойЧасти(Элементы.Расходы.ТекущаяСтрока, "Запасы", "Цена");
	//_Паганини ПФ
	
КонецПроцедуры // ЗапасыЦенаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Сумма.
//
&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.Количество <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
	//Паганини ПФ_
	//РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	//СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	РассчитатьСуммуВСтрокеТабличнойЧасти(Элементы.Расходы.ТекущаяСтрока, "Запасы", "Сумма");
	//_Паганини ПФ
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");//+++ Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры // ЗапасыСуммаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СтавкаНДС.
//
&НаКлиенте
Процедура ЗапасыСтавкаНДСПриИзменении(Элемент)
	
	//Паганини ПФ_
	//СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	//
	//РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	//СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	ПересчитатьСуммыВСтрокиЗапасов(Элементы.Запасы.ТекущаяСтрока, "СтавкаНДС");
	//_Паганини ПФ
	
КонецПроцедуры  // ЗапасыСтавкаНДСПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СтавкаНДС.
//
&НаКлиенте
Процедура ЗапасыСуммаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа"); //+++ Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры // ЗапасыСуммаНДСПриИзменении()

// Процедура - обработчик события ПослеУдаления строки списка Запасы.
//
&НаКлиенте
Процедура ЗапасыПослеУдаления(Элемент)
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры // ЗапасыПослеУдаления()

// Процедура - обработчик события ПриНачалеРедактирования строки списка Расходы.
//
&НаКлиенте
Процедура РасходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ОсновноеПодразделение;
		//Паганини_ ПФ
		Если НЕ Копирование Тогда
			ВидыУдержания = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьВидыУдержанияСотрудника(Объект.Дата, Объект.Сотрудник);
			СтрокаТабличнойЧасти.ВидУдержанияНДФЛ	= ВидыУдержания.ВидУдержанияНДФЛ;
			СтрокаТабличнойЧасти.ВидУдержанияПФ		= ВидыУдержания.ВидУдержанияПФ;
			СтрокаТабличнойЧасти.ВидНалогаНДС 		= РС_ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Организация, "ВидНалогаНДС");
		КонецЕсли;
		//_Паганини ПФ
	КонецЕсли;
	//Паганини ПФ_
	ТекСтрока = Элементы.Расходы.ТекущиеДанные;
	ТекСтрока.ПредСтавкаНДС = ТекСтрока.СтавкаНДС;
	ТекСтрока.ПредВидУдержанияПФ = ТекСтрока.ВидУдержанияПФ;
	ТекСтрока.ПредВидУдержанияНДФЛ = ТекСтрока.ВидУдержанияНДФЛ;
	//_Паганини ПФ
	
	// ГрупповоеИзменениеСтрок
	Элемент.ТекущиеДанные.Пометка = Истина;
	// Конец ГрупповоеИзменениеСтрок
	
КонецПроцедуры // РасходыПриНачалеРедактирования()

// Процедура - обработчик события ПриИзменении поля ввода Номенклатура.
//
&НаКлиенте
Процедура РасходыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные, ИспользоватьТолькоРегламентированныйПланСчетов);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Количество = 1;
	СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
	СтрокаТабличнойЧасти.Содержание = "";
	
	Если СтруктураДанные.ОчиститьЗаказИПодразделение Тогда
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = Неопределено;
		СтрокаТабличнойЧасти.ЗаказПокупателя = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтруктурнаяЕдиница) Тогда
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ОсновноеПодразделение;
	КонецЕсли;
	
	Если СтруктураДанные.ОчиститьНаправлениеДеятельности Тогда
		СтрокаТабличнойЧасти.НаправлениеДеятельности = Неопределено;
	КонецЕсли;
	
	//Паганини ПФ_
	//РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	РассчитатьСуммуВСтрокеТабличнойЧасти(Элементы.Расходы.ТекущаяСтрока, "Расходы", "Количество");
	//_Паганини ПФ
	
КонецПроцедуры // РасходыНоменклатураПриИзменении()

// Процедура - обработчик события АвтоПодбор поля ввода Содержание.
//
&НаКлиенте
Процедура РасходыСодержаниеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
		ШаблонСодержания = УправлениеНебольшойФирмойСервер.ПолучитьТекстСодержания(СтрокаТабличнойЧасти.Номенклатура);
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ШаблонСодержания);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Количество.
//
&НаКлиенте
Процедура РасходыКоличествоПриИзменении(Элемент)
	
	//Паганини ПФ_
	//СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	//
	//РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	РассчитатьСуммуВСтрокеТабличнойЧасти(Элементы.Расходы.ТекущаяСтрока, "Расходы", "Количество");
	//_Паганини ПФ
	
КонецПроцедуры // РасходыКоличествоПриИзменении()

// Процедура - обработчик события ОбработкаВыбора поля ввода ЕдиницаИзмерения.
//
&НаКлиенте
Процедура РасходыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ЕдиницаИзмерения = ВыбранноеЗначение 
		ИЛИ СтрокаТабличнойЧасти.Цена = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКоэффициент = 0;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущийКоэффициент = 1;
	КонецЕсли;
	
	Коэффициент = 0;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Коэффициент = 1;
	КонецЕсли;
	
	Если ТекущийКоэффициент = 0 И Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения, ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	ИначеЕсли Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(,ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 1 И Коэффициент = 1 Тогда
		СтруктураДанные = Новый Структура("ТекущийКоэффициент, Коэффициент", 1, 1);
	КонецЕсли;
	
	// Цена.
	Если СтруктураДанные.ТекущийКоэффициент <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена * СтруктураДанные.Коэффициент / СтруктураДанные.ТекущийКоэффициент;
	КонецЕсли;
	
	//Паганини ПФ_
	//РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	РассчитатьСуммуВСтрокеТабличнойЧасти(Элементы.Расходы.ТекущаяСтрока, "Расходы", "Цена");
	//_Паганини ПФ
	
КонецПроцедуры // РасходыЕдиницаИзмеренияОбработкаВыбора()

// Процедура - обработчик события ПриИзменении поля ввода Цена.
//
&НаКлиенте
Процедура РасходыЦенаПриИзменении(Элемент)
	
	//Паганини ПФ_
	//СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	//
	//РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, "Расходы", Истина);
	РассчитатьСуммуВСтрокеТабличнойЧасти(Элементы.Расходы.ТекущаяСтрока, "Расходы","Цена");
	//_Паганини ПФ
	
КонецПроцедуры // РасходыЦенаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Сумма.
//
&НаКлиенте
Процедура РасходыСуммаПриИзменении(Элемент)
	
	ПересчитатьСуммыВСтрокиРасходов(Элементы.Расходы.ТекущаяСтрока, "Сумма");
	
КонецПроцедуры // РасходыСуммаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СтавкаНДС.
//
&НаКлиенте
Процедура РасходыСтавкаНДСПриИзменении(Элемент)
	
	//Паганини ПФ_
	//СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	//
	//РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	//СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");
	ПересчитатьСуммыВСтрокиРасходов(Элементы.Расходы.ТекущаяСтрока, "СтавкаНДС");
	//_Паганини ПФ
	
КонецПроцедуры  // РасходыСтавкаНДСПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СтавкаНДС.
//
&НаКлиенте
Процедура РасходыСуммаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	//Паганини ПФ_
	//СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС) + СтрокаТабличнойЧасти.СуммаНДФЛ + СтрокаТабличнойЧасти.СуммаПФ;
	//_Паганини ПФ
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа"); //+++ Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры // РасходыСуммаНДСПриИзменении()

// Процедура - обработчик события НачалоВыбора поля ввода РасходыНаправлениеДеятельности.
//
&НаКлиенте
Процедура РасходыНаправлениеДеятельностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураДанные = ПолучитьДанныеНаправлениеДеятельностиНачалоВыбора(СтрокаТабличнойЧасти.Номенклатура, ИспользоватьТолькоРегламентированныйПланСчетов);
	
	Если НЕ СтруктураДанные.ВозможностьУказанияНаправленияДеятельности Тогда
		ПоказатьПредупреждение(, НСтр("ka='მოცემული ხარისთვის საქმიანობის მიმართულება არ მიეთითება!';ru='Для данного расхода направление деятельности не указывается!';en='For a given flow direction of activity is not specified!'"));
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры // РасходыНаправлениеДеятельностиНачалоВыбора()

&НаКлиенте
// Процедура - обработчик события НачалоВыбора поля ввода СтруктурнаяЕдиница.
//
Процедура РасходыСтруктурнаяЕдиницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиницаНачалоВыбора(СтрокаТабличнойЧасти.Номенклатура, ИспользоватьТолькоРегламентированныйПланСчетов);
	
	Если НЕ СтруктураДанные.ВозможностьУказанияПодразделения Тогда
		ПоказатьПредупреждение(, НСтр("ka='ამ ხარჯისთვის ქვეგანყოფილება არ მიეთითება!';ru='Для этого расхода подразделение не указывается!';en='unit is not indicated for this rate!'"));
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры // РасходыСтруктурнаяЕдиницаНачалоВыбора()

&НаКлиенте
// Процедура - обработчик события НачалоВыбора поля ввода Заказ.
//
Процедура РасходыЗаказНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураДанные = ПолучитьДанныеЗаказНачалоВыбора(СтрокаТабличнойЧасти.Номенклатура, ИспользоватьТолькоРегламентированныйПланСчетов);
	
	Если НЕ СтруктураДанные.ВозможностьУказанияЗаказа Тогда
		ПоказатьПредупреждение(, НСтр("ka='ამ ხარჯისთვის შეკვეთა არ მიეთითება!';ru='Для этого расхода заказ не указывается!';en='the order is not indicated for this rate!'"));
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры // РасходыЗаказНачалоВыбора()

// Процедура - обработчик события ПослеУдаления строки списка Расходы.
//
&НаКлиенте
Процедура РасходыПослеУдаления(Элемент)
	
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа"); //+++ Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры // РасходыПослеУдаления()

// Процедура - обработчик события ПриИзменении поля ввода ОплатыКонтрагент.
// Устанавливает курс и кратность валюты договора.
//
&НаКлиенте
Процедура ОплатыКонтрагентПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Оплаты.ТекущиеДанные;
	
	СтруктураДанные = ПолучитьДанныеКонтрагентПриИзменении(Объект.Дата, СтрокаТабличнойЧасти.Контрагент, Объект.Организация);
	
	СтрокаТабличнойЧасти.Договор = СтруктураДанные.Договор;
	//++Lazare 01.03.2023
	СтрокаТабличнойЧасти.ВидУдержанияНДФЛ = УправлениеНебольшойФирмойСервер.ЗначениеРеквизитаОбъекта(СтрокаТабличнойЧасти.Договор, "ВидУдержанияНДФЛ");
	СтрокаТабличнойЧасти.ВидУдержанияПФ = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьВидУдержанияПФ(Объект.Дата, СтрокаТабличнойЧасти.Контрагент, СтрокаТабличнойЧасти.Договор);
	//--Lazare 01.03.2023
	СтрокаТабличнойЧасти.ВестиРасчетыПоДоговорам = СтруктураДанные.ВестиРасчетыПоДоговорам;
	СтрокаТабличнойЧасти.ВестиРасчетыПоДокументам = СтруктураДанные.ВестиРасчетыПоДокументам;
	СтрокаТабличнойЧасти.ВестиРасчетыПоЗаказам = СтруктураДанные.ВестиРасчетыПоЗаказам;
	СтрокаТабличнойЧасти.ВестиУчетОплатыПоСчетам = СтруктураДанные.ВестиУчетОплатыПоСчетам;
	
	СтрокаТабличнойЧасти.Курс = ?(
			СтрокаТабличнойЧасти.Курс = 0,
			1,
			СтрокаТабличнойЧасти.Курс
		);
		СтрокаТабличнойЧасти.Кратность = ?(
			СтрокаТабличнойЧасти.Кратность = 0,
			1,
			СтрокаТабличнойЧасти.Кратность
	);
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
		СтрокаТабличнойЧасти.Курс = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс
		);
		СтрокаТабличнойЧасти.Кратность = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность
		);
	КонецЕсли;
	
	СтрокаТабличнойЧасти.СуммаРасчетов = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаПлатежа,
		Объект.Курс,
		СтрокаТабличнойЧасти.Курс,
		Объект.Кратность,
		СтрокаТабличнойЧасти.Кратность
	);
	
КонецПроцедуры // ОплатыКонтрагентПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ОплатыДоговор.
// Устанавливает курс и кратность валюты договора.
//
&НаКлиенте
Процедура ОплатыДоговорПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Оплаты.ТекущиеДанные;
	
	//++Lazare 01.03.2023
	СтрокаТабличнойЧасти.ВидУдержанияНДФЛ = УправлениеНебольшойФирмойСервер.ЗначениеРеквизитаОбъекта(СтрокаТабличнойЧасти.Договор, "ВидУдержанияНДФЛ");
	СтрокаТабличнойЧасти.ВидУдержанияПФ = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьВидУдержанияПФ(Объект.Дата, СтрокаТабличнойЧасти.Контрагент, СтрокаТабличнойЧасти.Договор);
	//--Lazare 01.03.2023

	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
		СтруктураДанные = ПолучитьДанныеОплатыДоговорПриИзменении(
			Объект.Дата,
			СтрокаТабличнойЧасти.Договор
		);
		СтрокаТабличнойЧасти.Курс = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс
		);
		СтрокаТабличнойЧасти.Кратность = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность
		);
	КонецЕсли;
	
	СтрокаТабличнойЧасти.СуммаРасчетов = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаПлатежа,
		Объект.Курс,
		СтрокаТабличнойЧасти.Курс,
		Объект.Кратность,
		СтрокаТабличнойЧасти.Кратность
	);
	
	//++Lazare gogoladze 01.03.2023
	ПересчитатьСуммыВСтрокиОплат(Элементы.Оплаты.ТекущаяСтрока, "ВидУдержанияПФ");
	//++Lazare gogoladze 01.03.2023
	
КонецПроцедуры // ОплатыДоговорПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ОплатыВидРасчетов.
// Очищает реквизит документ если тип расчетов - "Аванс".
//
&НаКлиенте
Процедура ОплатыПризнакАвансаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Оплаты.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ПризнакАванса Тогда
		СтрокаТабличнойЧасти.Документ = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ОплатыПризнакАвансаПриИзменении()

// Процедура - обработчик события НачалоВыбора поля ввода ОплатыДокумент.
// Передает в параметры текущее значение реквизита.
//
&НаКлиенте
Процедура ОплатыДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Оплаты.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ПризнакАванса Тогда
		ПоказатьПредупреждение(, НСтр("ka='ანგარიშსწორების სახისთვის ნიშნით ""ავანსი"" ანგარიშსწორების დოკუმენტი იქნება მიმდინარე!';ru='Для вида расчета с признаком ""Аванс"" документом расчетов будет текущий!';en='For the type of calculation with the sign of ""advance"" payment document is current!'"));
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ОплатыДокументНачалоВыбора()

// Процедура - обработчик события ПриИзменении поля вв ОплатыСуммаРасчетов.
// Расчитывает сумму платежа.
//
&НаКлиенте
Процедура ОплатыСуммаРасчетовПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежа(Элементы.Оплаты.ТекущиеДанные);
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");//+++ Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры // ОплатыСуммаРасчетовПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ОплатыКурс.
// Расчитывает сумму платежа.
//
&НаКлиенте
Процедура ОплатыКурсПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежа(Элементы.Оплаты.ТекущиеДанные);
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");//+++ Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры // ОплатыКурсПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ОплатыКратность.
// Расчитывает сумму платежа.
//
&НаКлиенте
Процедура ОплатыКратностьПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежа(Элементы.Оплаты.ТекущиеДанные);
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");//+++ Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры // ОплатыКратностьПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ОплатыСуммаПлатежа.
// Расчитывает курс и кратность валюты расчетов и сумму НДС.
//
&НаКлиенте
Процедура ОплатыСуммаПлатежаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Оплаты.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.СуммаРасчетов = 0,
		1,
		СтрокаТабличнойЧасти.СуммаПлатежа / СтрокаТабличнойЧасти.СуммаРасчетов * Объект.Курс
	);
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа"); //+++ Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры // ОплатыСуммаПлатежаПриИзменении()

// Процедура - обработчик события ПослеУдаления строки списка Оплаты.
//
&НаКлиенте
Процедура ОплатыПослеУдаления(Элемент)
	
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа"); //+++ Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	УстановитьВидимостьРеквизитовРасчетов();
	
КонецПроцедуры // ОплатыПослеУдаления()

// Процедура - обработчик события ПриОкончанииРедактирования строки списка Запасы.
//
&НаКлиенте
Процедура ЗапасыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа"); //+++ Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры // ЗапасыПриОкончанииРедактирования()

// Процедура - обработчик события ПриОкончанииРедактирования строки списка Расходы.
//
&НаКлиенте
Процедура РасходыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа");//+++Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры // РасходыПриОкончанииРедактирования()

// Процедура - обработчик события ПриОкончанииРедактирования строки списка Оплаты.
//
&НаКлиенте
Процедура ОплатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.Оплаты.Итог("СуммаНДФЛ"); //+++ Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.Оплаты.Итог("СуммаНДФЛ") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры // ОплатыПриОкончанииРедактирования()

// Процедура устанавливат видимость реквизитов расчетов в зависимости от установленных контрагенту параметров.
//
&НаСервере
Процедура УстановитьВидимостьРеквизитовРасчетов(Знач ВестиРасчетыПоДоговорам = Ложь, Знач ВестиРасчетыПоДокументам = Ложь, Знач ВестиРасчетыПоЗаказам = Ложь, Знач ВестиУчетОплатыПоСчетам = Ложь)
	
	ЗаполнитьСлужебныеРеквизитыПоКонтрагентуВКоллекции(Объект.Оплаты);
	
	Для каждого ТекСтрока Из Объект.Оплаты Цикл
		Если ТекСтрока.ВестиРасчетыПоДоговорам Тогда
			ВестиРасчетыПоДоговорам = Истина;
		КонецЕсли;
		Если ТекСтрока.ВестиРасчетыПоДокументам Тогда
			ВестиРасчетыПоДокументам = Истина;
		КонецЕсли;
		Если ТекСтрока.ВестиРасчетыПоЗаказам Тогда
			ВестиРасчетыПоЗаказам = Истина;
		КонецЕсли;
		Если ТекСтрока.ВестиУчетОплатыПоСчетам Тогда
			ВестиУчетОплатыПоСчетам = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ОплатыДоговор.Видимость = ВестиРасчетыПоДоговорам;
	Элементы.ОплатыДокумент.Видимость = ВестиРасчетыПоДокументам;
	Элементы.ОплатыЗаказ.Видимость = ВестиРасчетыПоЗаказам;
	Элементы.ОплатыСчетНаОплату.Видимость = ВестиУчетОплатыПоСчетам;
	
КонецПроцедуры // УстановитьВидимостьРеквизитовРасчетов()

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
		
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "удалить" Тогда
		Объект.ДокументОснование = Неопределено;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Неопределено);
		Модифицированность = Истина;
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "заполнить" Тогда
		ЗаполнитьПоОснованиюНачало();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "выбрать" Тогда
		//Выбрать основание
		СписокОснований = Новый СписокЗначений;
		СписокОснований.Добавить("Документ.РасходСоСчета.ФормаВыбора", "Расход со счета");
		СписокОснований.Добавить("Документ.РасходИзКассы.ФормаВыбора", "Расход из кассы");
		СписокОснований.Добавить("Документ.ПриходныйОрдер.ФормаВыбора", "Приходный ордер");
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборТипаОснованияЗавершение", ЭтотОбъект);
		ПоказатьВыборИзМеню(ОписаниеОповещения, СписокОснований, Элементы.ДокументОснованиеНадпись);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "открыть" Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) тогда
			возврат;
		КонецЕсли;
		
		РаботаСФормойДокументаКлиент.ОткрытьФормуДокументаПоТипу(Объект.ДокументОснование);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	УправлениеНебольшойФирмойКлиент.ОткрытьСчетФактуру(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТипаОснованияЗавершение(ВыбИмяФормы, Параметры) Экспорт
	
	Если ВыбИмяФормы<>Неопределено Тогда
		
		СтруктураПараметровОтбора = Новый Структура("Отбор", Новый Структура("Контрагент, Договор", Контрагент, Договор));
		_ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьОснованиеЗавершение", ЭтотОбъект);
		ОткрытьФорму(ВыбИмяФормы.Значение, СтруктураПараметровОтбора, ЭтотОбъект, ,,,_ОповещениеОЗакрытии);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОснованиеЗавершение(ВыбЗначение, Параметры) Экспорт

	Если ВыбЗначение<>Неопределено Тогда
		Объект.ДокументОснование = ВыбЗначение;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(ВыбЗначение);
		Модифицированность = Истина;
		
		ЗаполнитьПоОснованиюНачало();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюНачало() Экспорт

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", ЭтотОбъект);
	ПоказатьВопрос(
		ОписаниеОповещения, 
		НСтр("ka='შევავსოთ დოკუმენტი არჩეული საფუძვლით?';ru='Заполнить документ по выбранному основанию?';en='Complete the document by the selected base?'"), 
		РежимДиалогаВопрос.ДаНет, 0);		

КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ДекорацияПечатьНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияРеквизитовПечати", ЭтотОбъект);
	ОткрытьФорму("Обработка.РеквизитыПечати.Форма.РеквизитыПечатиАвансовыйОтчет", Новый Структура("КонтекстПечати", Объект), ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеОбъектов

&НаКлиенте
Процедура СохранитьДокументКакШаблон(Параметр) Экспорт
	
	ЗаполнениеОбъектовУНФКлиент.СохранитьДокументКакШаблон(Объект, ОтображаемыеРеквизиты(), Параметр);
	
КонецПроцедуры

&НаСервере
Функция ОтображаемыеРеквизиты()
	
	Результат = Новый Массив;
	
	Для Каждого ТекЭлемент Из Элементы Цикл
		
		Если ТипЗнч(ТекЭлемент) <> Тип("ПолеФормы") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не СтрНачинаетсяС(ТекЭлемент.ПутьКДанным, "Объект.") Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(СтрЗаменить(ТекЭлемент.ПутьКДанным, "Объект.", ""));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ГрупповоеИзменениеСтрок

// Процедура - обработчик нажатия кнопки Снять флажки в ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыСнятьФлажки(Команда)
	УстановитьПометку("Запасы", Ложь);
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Установить флажки в ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыУстановитьФлажки(Команда)
	УстановитьПометку("Запасы", Истина);
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Изменить в ТЧ Запасы.
// Показывает/скрывает панель редактирования таблицы.
//
&НаКлиенте
Процедура ЗапасыИзменитьСтроки(Команда)
	
	ПоказатьСкрытьПанельРедактирования("Запасы", Истина);
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Выполнить в панели редактирования ТЧ Запасы.
// Производит выбранные преобразования с таблицей
//
&НаКлиенте
Процедура ЗапасыВыполнитьДействие(Команда)
	
	ОбработатьТаблицу("Запасы");
	НастроитьОформлениеПанелиРедактирования("Запасы", 4);
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Отменить в панели редактирования ТЧ Запасы.
// Скрывает панель редактирования и восстанавливает данные таблицы до внесения изменений
//
&НаКлиенте
Процедура ЗапасыОтменитьИзменения(Команда)
	
	ПоказатьСкрытьПанельРедактирования("Запасы");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Снять флажки в ТЧ Расходы.
//
&НаКлиенте
Процедура РасходыСнятьФлажки(Команда)
	УстановитьПометку("Расходы", Ложь);
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Установить флажки в ТЧ Расходы.
//
&НаКлиенте
Процедура РасходыУстановитьФлажки(Команда)
	УстановитьПометку("Расходы", Истина);
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Изменить в ТЧ Расходы.
// Показывает/скрывает панель редактирования таблицы.
//
&НаКлиенте
Процедура РасходыИзменитьСтроки(Команда)
	
	ПоказатьСкрытьПанельРедактирования("Расходы", Истина);
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Выполнить в панели редактирования ТЧ Расходы.
// Производит выбранные преобразования с таблицей.
//
&НаКлиенте
Процедура РасходыВыполнитьДействие(Команда)
	
	ОбработатьТаблицу("Расходы");
	НастроитьОформлениеПанелиРедактирования("Расходы", 4);
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Отменить в панели редактирования ТЧ Расходы.
// Скрывает панель редактирования и восстанавливает данные таблицы до внесения изменений.
//
&НаКлиенте
Процедура РасходыОтменитьИзменения(Команда)
	
	ПоказатьСкрытьПанельРедактирования("Расходы");
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ЗапасыИзменениеСтрокДействие.
//
&НаКлиенте
Процедура ЗапасыИзменениеСтрокДействиеПриИзменении(Элемент)
	
	ОпределитьОбъектИзменений("Запасы");
	НастроитьОформлениеПанелиРедактирования("Запасы", 2);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ЗапасыИзменениеСтрокЗначение.
//
&НаКлиенте
Процедура ЗапасыИзменениеСтрокЗначениеПриИзменении(Элемент)
	
	НастроитьОформлениеПанелиРедактирования("Запасы", 3);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасходыИзменениеСтрокДействие.
//
&НаКлиенте
Процедура РасходыИзменениеСтрокДействиеПриИзменении(Элемент)
	
	ОпределитьОбъектИзменений("Расходы");
	НастроитьОформлениеПанелиРедактирования("Расходы", 2);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасходыИзменениеСтрокЗначение.
//
&НаКлиенте
Процедура РасходыИзменениеСтрокЗначениеПриИзменении(Элемент)
	
	НастроитьОформлениеПанелиРедактирования("Расходы", 3);
	
КонецПроцедуры

// Устанавливает/снимает пометку для всех строк таблицы.
//
&НаСервере
Процедура УстановитьПометку(ИмяТЧ, Пометка)
	
	НаборЭлементов = НаборЭлементовГрупповогоИзмененияСтрокСервер(ИмяТЧ);
	НаборЭлементов.КнопкаСнятьФлажки.Видимость = НЕ НаборЭлементов.КнопкаСнятьФлажки.Видимость;
	НаборЭлементов.КнопкаУстановитьФлажки.Видимость = НЕ НаборЭлементов.КнопкаУстановитьФлажки.Видимость;
	
	Для каждого Строка Из Объект[НаборЭлементов.ИмяТЧ] Цикл
		Строка.Пометка = Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Открывает/закрывает панель редактирования ТЧ.
//
Процедура ПоказатьСкрытьПанельРедактирования(ИмяТЧ, ИзменяетДанные = Неопределено)
	
	Перем СостояниеПерехода;
	ГрупповоеИзменениеСтрокСервер.ПоказатьСкрытьПанельРедактирования(
		ЭтотОбъект,
		НаборЭлементовГрупповогоИзмененияСтрокСервер(ИмяТЧ),
		СостояниеПерехода,
		ИзменяетДанные
	);
	
	УправлениеРезервнымиКопиямиТаблицы(ИмяТЧ, СостояниеПерехода, ИзменяетДанные);
	
КонецПроцедуры

&НаСервере
// Управляет сохранением/отменой изменений в ТЧ.
//
Процедура УправлениеРезервнымиКопиямиТаблицы(ИмяТЧ, СостояниеПерехода, ИзменяетДанные)
	
	Если ИмяТЧ = "Запасы" Тогда
		РеквизитРезервнаяКопияТаблицыАдрес = "ЗапасыРезервнаяКопияТаблицыАдрес";
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		РеквизитРезервнаяКопияТаблицыАдрес = "РасходыРезервнаяКопияТаблицыАдрес";
	КонецЕсли;
	
	ГрупповоеИзменениеСтрокСервер.УправлениеРезервнымиКопиями(
		ЭтотОбъект,
		Объект[ИмяТЧ],
		ЭтотОбъект[РеквизитРезервнаяКопияТаблицыАдрес],
		СостояниеПерехода,
		ИзменяетДанные
	);
	
КонецПроцедуры

// Управляет оформлением панели редактирования таблицы.
//
&НаКлиенте
Процедура НастроитьОформлениеПанелиРедактирования(ИмяТЧ, Состояние, СохранитьИзменения = Неопределено)
	
	Если ИмяТЧ = "Запасы" Тогда
		РеквизитЗначение = "ЗапасыИзменениеСтрокЗначение";
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		РеквизитЗначение = "РасходыИзменениеСтрокЗначение";
	КонецЕсли;
	
	ГрупповоеИзменениеСтрокКлиент.НастроитьОформлениеПанелиРедактирования(
		ЭтотОбъект,
		НаборЭлементовГрупповогоИзмененияСтрокКлиент(ИмяТЧ),
		Состояние,
		ЭтотОбъект[РеквизитЗначение]
	);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьТекущееДействиеИзмененияСтрок()
	
	СохраняемыеНастройки = "";
	
	Если ЗапасыИзменениеСтрокДействие <> ЗапасыИзменениеСтрокДействиеПриОткрытии Тогда
		СохраняемыеНастройки = "Запасы";
	КонецЕсли;
	
	Если РасходыИзменениеСтрокДействие <> РасходыИзменениеСтрокДействиеПриОткрытии Тогда
		Если ЗначениеЗаполнено(СохраняемыеНастройки) Тогда
			СохраняемыеНастройки = СохраняемыеНастройки + ",";
		КонецЕсли;
		СохраняемыеНастройки = СохраняемыеНастройки + "Расходы";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СохраняемыеНастройки) Тогда
		Возврат
	КонецЕсли;
	
	СохранитьТекущееДействиеИзмененияСтрокСервер(СохраняемыеНастройки);
	
КонецПроцедуры

// Записывает в пользовательские настройки последнее выбранное действие для изменения таблицы.
//
&НаСервере
Процедура СохранитьТекущееДействиеИзмененияСтрокСервер(СохраняемыеНастройки)
	
	ИменаТЧ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СохраняемыеНастройки);
	Для каждого ИмяТЧ Из ИменаТЧ Цикл
		ГрупповоеИзменениеСтрокСервер.СохранитьНастройки(НаборЭлементовГрупповогоИзмененияСтрокСервер(ИмяТЧ));
	КонецЦикла;
	
КонецПроцедуры

// Производит пересчет связанных реквизитов в строках таблицы после из группового изменения.
//
&НаКлиенте
Процедура ОбработатьТаблицу(ИмяТЧ, ИмяПоля = "")//Паганини ПФ + "ИмяПоля"
	
	ОбработатьТаблицуНаСервере(ИмяТЧ);
	
	Если ИмяТЧ = "Запасы" Тогда
		ВыполненноеДействие = ЗапасыИзменениеСтрокДействие;
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		ВыполненноеДействие = РасходыИзменениеСтрокДействие;
	КонецЕсли;
	
	ИзменяемыеСтроки = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("Пометка", Истина));
	Для каждого Строка Из ИзменяемыеСтроки Цикл
		
		Если ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент")
			ИЛИ ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены")
			ИЛИ ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
			
			РассчитатьСуммуВСтрокеТабличнойЧасти(Строка, ИмяТЧ, ИмяПоля);//Паганини ПФ: + "ИмяТЧ, ИмяПоля"
			
		ИначеЕсли ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС") Тогда
			
			РассчитатьСуммуНДС(Строка);
			Строка.Всего = Строка.Сумма + ?(Объект.СуммаВключаетНДС, 0, Строка.СуммаНДС);
			
		ИначеЕсли ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству")
			ИЛИ ВыполненноеДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
			
			Если Строка.Количество <> 0 Тогда
				Строка.Цена = Строка.Сумма / Строка.Количество;
			КонецЕсли;
			
			РассчитатьСуммуНДС(Строка);
			Строка.Всего = Строка.Сумма + ?(Объект.СуммаВключаетНДС, 0, Строка.СуммаНДС);
			//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа"); //+++ Дмгг
			ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Производит пересчет связанных реквизитов в строках таблицы после из группового изменения.
//
&НаСервере
Процедура ОбработатьТаблицуНаСервере(ИмяТЧ)
	
	Если ИмяТЧ = "Запасы" Тогда
		
		ГрупповоеИзменениеСтрокСервер.ОбработатьТаблицу(
			ЭтотОбъект,
			Объект.Запасы,
			ЗапасыИзменениеСтрокДействие,
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит,
			ЗапасыИзменениеСтрокЗначение,
			"ЗапасыНоменклатура"
		);
		
		Если ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
			
			ИзменяемыеСтроки = Объект.Запасы.НайтиСтроки(Новый Структура("Пометка", Истина));
			Для каждого Строка Из ИзменяемыеСтроки Цикл
				
				СтруктураДанные = Новый Структура;
				СтруктураДанные.Вставить("Организация", Объект.Организация);
				СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
				СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
				
				СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные, ИспользоватьТолькоРегламентированныйПланСчетов);
				
				Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
				Если НЕ ЗначениеЗаполнено(Строка.Количество) Тогда
					Строка.Количество = 1;
				КонецЕсли;
				Строка.СтавкаНДС = СтруктураДанные.СтавкаНДС;
				Строка.Содержание = "";
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		
		ГрупповоеИзменениеСтрокСервер.ОбработатьТаблицу(
			ЭтотОбъект,
			Объект.Расходы,
			РасходыИзменениеСтрокДействие,
			РасходыИзменениеСтрокОбъектИзмененийРеквизит,
			РасходыИзменениеСтрокЗначение,
			"РасходыНоменклатура"
		);
		
		Если РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
			
			ИзменяемыеСтроки = Объект.Расходы.НайтиСтроки(Новый Структура("Пометка", Истина));
			Для каждого Строка Из ИзменяемыеСтроки Цикл
				
				СтруктураДанные = Новый Структура;
				СтруктураДанные.Вставить("Организация", Объект.Организация);
				СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
				СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
				
				СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные, ИспользоватьТолькоРегламентированныйПланСчетов);
				
				Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
				Если НЕ ЗначениеЗаполнено(Строка.Количество) Тогда
					Строка.Количество = 1;
				КонецЕсли;
				Строка.СтавкаНДС = СтруктураДанные.СтавкаНДС;
				Строка.Содержание = "";
				
				Если СтруктураДанные.ОчиститьЗаказИПодразделение Тогда
					Строка.СтруктурнаяЕдиница = Неопределено;
					Строка.ЗаказПокупателя = Неопределено;
				КонецЕсли;
				
				Если СтруктураДанные.ОчиститьНаправлениеДеятельности Тогда
					Строка.НаправлениеДеятельности = Неопределено;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Определяет в зависимости от выбранного действия изменяемый реквизит и связанный с ним элемент на форме.
//
&НаКлиенте
Процедура ОпределитьОбъектИзменений(ИмяТЧ)
	
	Если ИмяТЧ = "Запасы" Тогда
		
		Если ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыЦена";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыЦена";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСумма";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСумма";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "СтавкаНДС";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСтавкаНДС";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "";
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки") Тогда
			
			ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "";
			ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "";
			
		КонецЕсли;
		
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		
		Если РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыЦена";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыЦена";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыСумма";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыСумма";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "СтавкаНДС";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "РасходыСтавкаНДС";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "";
			
		ИначеЕсли РасходыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки") Тогда
			
			РасходыИзменениеСтрокОбъектИзмененийРеквизит = "";
			РасходыИзменениеСтрокОбъектИзмененийЭлемент = "";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Создает набор необходимых реквизитов и элементов формы для управления оформлением панели редактирования.
//
&НаКлиенте
Функция НаборЭлементовГрупповогоИзмененияСтрокКлиент(ИмяТЧ)
	
	НаборЭлементов = Новый Структура();
	
	Если ИмяТЧ = "Запасы" Тогда
		
		НаборЭлементов = Новый Структура();
		НаборЭлементов.Вставить("ИмяТЧ", "Запасы");
		НаборЭлементов.Вставить("ДокументСсылка",          Объект.Ссылка);
		НаборЭлементов.Вставить("ПанельРедактирования",    Элементы.ГруппаЗапасыИзменениеСтрок);
		НаборЭлементов.Вставить("КнопкаУстановитьФлажки",  Элементы.ЗапасыУстановитьФлажки);
		НаборЭлементов.Вставить("КнопкаСнятьФлажки",       Элементы.ЗапасыСнятьФлажки);
		НаборЭлементов.Вставить("КнопкаВыполнитьДействие", Элементы.ЗапасыВыполнитьДействие);
		НаборЭлементов.Вставить("КолонкаПометка",          Элементы.ЗапасыПометка);
		НаборЭлементов.Вставить("КолонкаНомерСтроки",      Элементы.ЗапасыНомерСтроки);
		НаборЭлементов.Вставить("Действие",                ЭтотОбъект.ЗапасыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("ДействиеЭлемент",         Элементы.ЗапасыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("Значение",                ЭтотОбъект.ЗапасыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ЗначениеЭлемент",         Элементы.ЗапасыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ОбъектИзменений",         ЗапасыИзменениеСтрокОбъектИзмененийЭлемент);
		НаборЭлементов.Вставить("КолонкаОбъектИзменений",  ?(ЗначениеЗаполнено(ЗапасыИзменениеСтрокОбъектИзмененийЭлемент), 
		                                                     Элементы[ЗапасыИзменениеСтрокОбъектИзмененийЭлемент], Неопределено));
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		
		НаборЭлементов = Новый Структура();
		НаборЭлементов.Вставить("ИмяТЧ", "Расходы");
		НаборЭлементов.Вставить("ДокументСсылка",          Объект.Ссылка);
		НаборЭлементов.Вставить("ПанельРедактирования",    Элементы.ГруппаРасходыИзменениеСтрок);
		НаборЭлементов.Вставить("КнопкаУстановитьФлажки",  Элементы.РасходыУстановитьФлажки);
		НаборЭлементов.Вставить("КнопкаСнятьФлажки",       Элементы.РасходыСнятьФлажки);
		НаборЭлементов.Вставить("КнопкаВыполнитьДействие", Элементы.РасходыВыполнитьДействие);
		НаборЭлементов.Вставить("КолонкаПометка",          Элементы.РасходыПометка);
		НаборЭлементов.Вставить("КолонкаНомерСтроки",      Элементы.РасходыНомерСтроки);
		НаборЭлементов.Вставить("Действие",                ЭтотОбъект.РасходыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("ДействиеЭлемент",         Элементы.РасходыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("Значение",                ЭтотОбъект.РасходыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ЗначениеЭлемент",         Элементы.РасходыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ОбъектИзменений",         РасходыИзменениеСтрокОбъектИзмененийЭлемент);
		НаборЭлементов.Вставить("КолонкаОбъектИзменений",  ?(ЗначениеЗаполнено(РасходыИзменениеСтрокОбъектИзмененийЭлемент), 
		                                                     Элементы[РасходыИзменениеСтрокОбъектИзмененийЭлемент], Неопределено));
	КонецЕсли;
	
	Возврат НаборЭлементов;
	
КонецФункции

// Создает набор необходимых реквизитов и элементов формы для управления оформлением панели редактирования.
//
&НаСервере
Функция НаборЭлементовГрупповогоИзмененияСтрокСервер(ИмяТЧ)
	
	Если ИмяТЧ = "Запасы" Тогда
		
		НаборЭлементов = Новый Структура();
		НаборЭлементов.Вставить("ИмяТЧ", "Запасы");
		НаборЭлементов.Вставить("ДокументСсылка",          Объект.Ссылка);
		НаборЭлементов.Вставить("ПанельРедактирования",    Элементы.ГруппаЗапасыИзменениеСтрок);
		НаборЭлементов.Вставить("КнопкаУстановитьФлажки",  Элементы.ЗапасыУстановитьФлажки);
		НаборЭлементов.Вставить("КнопкаСнятьФлажки",       Элементы.ЗапасыСнятьФлажки);
		НаборЭлементов.Вставить("КнопкаВыполнитьДействие", Элементы.ЗапасыВыполнитьДействие);
		НаборЭлементов.Вставить("КолонкаПометка",          Элементы.ЗапасыПометка);
		НаборЭлементов.Вставить("КолонкаНомерСтроки",      Элементы.ЗапасыНомерСтроки);
		НаборЭлементов.Вставить("Действие",                ЭтотОбъект.ЗапасыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("ДействиеЭлемент",         Элементы.ЗапасыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("Значение",                ЭтотОбъект.ЗапасыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ЗначениеЭлемент",         Элементы.ЗапасыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ОбъектИзменений",         ЗапасыИзменениеСтрокОбъектИзмененийЭлемент);
		НаборЭлементов.Вставить("КолонкаОбъектИзменений",  ?(ЗначениеЗаполнено(ЗапасыИзменениеСтрокОбъектИзмененийЭлемент), 
		                                                     Элементы[ЗапасыИзменениеСтрокОбъектИзмененийЭлемент], Неопределено));
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		
		НаборЭлементов = Новый Структура();
		НаборЭлементов.Вставить("ИмяТЧ", "Расходы");
		НаборЭлементов.Вставить("ДокументСсылка",          Объект.Ссылка);
		НаборЭлементов.Вставить("ПанельРедактирования",    Элементы.ГруппаРасходыИзменениеСтрок);
		НаборЭлементов.Вставить("КнопкаУстановитьФлажки",  Элементы.РасходыУстановитьФлажки);
		НаборЭлементов.Вставить("КнопкаСнятьФлажки",       Элементы.РасходыСнятьФлажки);
		НаборЭлементов.Вставить("КнопкаВыполнитьДействие", Элементы.РасходыВыполнитьДействие);
		НаборЭлементов.Вставить("КолонкаПометка",          Элементы.РасходыПометка);
		НаборЭлементов.Вставить("КолонкаНомерСтроки",      Элементы.РасходыНомерСтроки);
		НаборЭлементов.Вставить("Действие",                ЭтотОбъект.РасходыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("ДействиеЭлемент",         Элементы.РасходыИзменениеСтрокДействие);
		НаборЭлементов.Вставить("Значение",                ЭтотОбъект.РасходыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ЗначениеЭлемент",         Элементы.РасходыИзменениеСтрокЗначение);
		НаборЭлементов.Вставить("ОбъектИзменений",         РасходыИзменениеСтрокОбъектИзмененийЭлемент);
		НаборЭлементов.Вставить("КолонкаОбъектИзменений",  ?(ЗначениеЗаполнено(РасходыИзменениеСтрокОбъектИзмененийЭлемент), 
		                                                     Элементы[РасходыИзменениеСтрокОбъектИзмененийЭлемент], Неопределено));
	КонецЕсли;
	
	Возврат НаборЭлементов;
КонецФункции

// Заполняет список выбора реквизита Действие в панели редактирования ТЧ
//
&НаСервере
Процедура ЗаполнитьСписокДействий(ИмяТЧ)
	
	РазрешеноРедактированиеЦенДокументов = УправлениеНебольшойФирмойУправлениеДоступомПовтИсп.РазрешеноРедактированиеЦенДокументов();
	
	Если ИмяТЧ = "Запасы" Тогда
		
		Действия = Новый Массив;
		Если РазрешеноРедактированиеЦенДокументов Тогда
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент);
		КонецЕсли;
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены);
		Если РазрешеноРедактированиеЦенДокументов Тогда
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству);
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам);
		КонецЕсли;
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС);
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента);
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки);
		
		Элементы.ЗапасыИзменениеСтрокДействие.СписокВыбора.Очистить();
		Для каждого Действие Из Действия Цикл
			ДействиеОписание = ГрупповоеИзменениеСтрокСервер.ПредставлениеДействия(Действие);
			Элементы.ЗапасыИзменениеСтрокДействие.СписокВыбора.Добавить(Действие, ДействиеОписание);
		КонецЦикла;
		
	ИначеЕсли ИмяТЧ = "Расходы" Тогда
		
		Действия = Новый Массив;
		Если РазрешеноРедактированиеЦенДокументов Тогда
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент);
		КонецЕсли;
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены);
		Если РазрешеноРедактированиеЦенДокументов Тогда
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству);
			Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам);
		КонецЕсли;
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС);
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента);
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки);
		
		Элементы.РасходыИзменениеСтрокДействие.СписокВыбора.Очистить();
		Для каждого Действие Из Действия Цикл
			ДействиеОписание = ГрупповоеИзменениеСтрокСервер.ПредставлениеДействия(Действие);
			Элементы.РасходыИзменениеСтрокДействие.СписокВыбора.Добавить(Действие, ДействиеОписание);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПометкаПриИзменении(Элемент)
	ГрупповоеИзменениеСтрокКлиент.СтрокаПометкаПриИзменении(Объект.Запасы, Элементы.ЗапасыУстановитьФлажки, Элементы.ЗапасыСнятьФлажки);
КонецПроцедуры

&НаКлиенте
Процедура РасходыПометкаПриИзменении(Элемент)
	ГрупповоеИзменениеСтрокКлиент.СтрокаПометкаПриИзменении(Объект.Расходы, Элементы.РасходыУстановитьФлажки, Элементы.РасходыСнятьФлажки);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#Область КопированиеСтрокТабличныхЧастей

// Процедура - обработчик нажатия кнопки Копировать строки в ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыКопироватьСтроки(Команда)
	
	КопироватьСтроки("Запасы");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Вставить строки в ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыВставитьСтроки(Команда)
	
	ВставитьСтроки("Запасы");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Копировать строки в ТЧ Расходы.
//
&НаКлиенте
Процедура РасходыКопироватьСтроки(Команда)
	
	КопироватьСтроки("Расходы");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Вставить строки в ТЧ Расходы.
//
&НаКлиенте
Процедура РасходыВставитьСтроки(Команда)
	
	ВставитьСтроки("Расходы");
	
КонецПроцедуры

// Вызывает процедуру копирования строк и оповещает пользователя о количестве скопированных.
//
&НаКлиенте
Процедура КопироватьСтроки(ИмяТЧ)
	
	Если КопированиеТабличнойЧастиКлиент.МожноКопироватьСтроки(Объект[ИмяТЧ], Элементы[ИмяТЧ].ТекущиеДанные) Тогда
		КоличествоСкопированных = 0;
		КопироватьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных);
		КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОКопированииСтрок(КоличествоСкопированных);
	КонецЕсли;
	
КонецПроцедуры

// Вызывает процедуру вставки строк и оповещает пользователя о количетсве вставленных.
//
&НаКлиенте
Процедура ВставитьСтроки(ИмяТЧ)
	
	КоличествоСкопированных = 0;
	КоличествоВставленных = 0;
	ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных);
	ОбработатьВставленныеСтроки(ИмяТЧ, КоличествоВставленных);
	КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоСкопированных, КоличествоВставленных);
	
КонецПроцедуры

// Выполняет копирование выделенных строк в буфер обмена.
//
&НаСервере
Процедура КопироватьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных)
	
	КопированиеТабличнойЧастиСервер.Копировать(Объект[ИмяТЧ], Элементы[ИмяТЧ].ВыделенныеСтроки, КоличествоСкопированных);
	
КонецПроцедуры

// Вставляет скопированные строки из буфера обмена в выбранную табличную часть.
//
&НаСервере
Процедура ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных)
	
	КопированиеТабличнойЧастиСервер.Вставить(Объект, ИмяТЧ, Элементы, КоличествоСкопированных, КоличествоВставленных);
	ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных);
	
КонецПроцедуры

// Обрабатывает вставленные строки.
//
&НаКлиенте
Процедура ОбработатьВставленныеСтроки(ИмяТЧ, КоличествоВставленных)
	
	Количество = Объект[ИмяТЧ].Количество();
	Для Итератор = 1 По КоличествоВставленных Цикл
		
		Строка = Объект[ИмяТЧ][Количество - Итератор];
		РассчитатьСуммуВСтрокеТабличнойЧасти(Строка);
		
	КонецЦикла;
	
	//ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа"); //+++ Дмгг
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры

// Обрабатывает вставленные строки.
//
&НаСервере
Процедура ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных)
	
	Количество = Объект[ИмяТЧ].Количество();
	
	Для Итератор = 1 По КоличествоВставленных Цикл
		
		Строка = Объект[ИмяТЧ][Количество - Итератор];
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("Организация",        Объект.Организация);
		СтруктураДанные.Вставить("Номенклатура",       Строка.Номенклатура);
		СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
		
		СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные, ИспользоватьТолькоРегламентированныйПланСчетов);
		
		Если ИмяТЧ = "Запасы" Тогда
			
			Строка.СтавкаНДС = СтруктураДанные.СтавкаНДС;
			Строка.СтруктурнаяЕдиница = ОсновнойСклад;
			Если НЕ ЗначениеЗаполнено(Строка.ЕдиницаИзмерения) Тогда
				Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
			КонецЕсли;
			
		ИначеЕсли ИмяТЧ = "Расходы" Тогда
			
			Если НЕ ЗначениеЗаполнено(Строка.ЕдиницаИзмерения) Тогда
				Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
			КонецЕсли;
			
			Если СтруктураДанные.ОчиститьЗаказИПодразделение Тогда
				Строка.СтруктурнаяЕдиница = Неопределено;
				Строка.ЗаказПокупателя = Неопределено;
			КонецЕсли;
			
			Если СтруктураДанные.ОчиститьНаправлениеДеятельности Тогда
				Строка.НаправлениеДеятельности = Неопределено;
			КонецЕсли;
			
			Строка.СтруктурнаяЕдиница = ОсновноеПодразделение;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОплатыТипНДФЛПриИзменении(Элемент)
	
	ЗаполнитьСуммуНДФЛ(Элементы.Оплаты.ТекущиеДанные);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыДокументПриИзменении(Элемент)
	
	СтрокаТекущиеДанные = Элементы.Оплаты.ТекущиеДанные;
	
	ЗаполнитьСуммуНДФЛ(СтрокаТекущиеДанные);
	
	// Олег Литвиненко 11.10.22 --->
	ЗаполнитьСуммуРасчетов(СтрокаТекущиеДанные); 
	
	СтрокаТекущиеДанные.СуммаПлатежа = СтрокаТекущиеДанные.СуммаРасчетов;
	// Олег Литвиненко <---
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуНДФЛ(СтрокаТЧ)

	Если Не ЗначениеЗаполнено(СтрокаТЧ.ТипНДФЛ) И Не ЗначениеЗаполнено(СтрокаТЧ.Документ) Тогда
		СтрокаТЧ.СуммаНДФЛ = 0;//Паганини
		Возврат;
	КонецЕсли;
	
	// заполним сумму НДФЛ по типу НДФЛ, выбранного документа
	СтрокаТЧ.СуммаНДФЛ = ЗаполнитьСуммуНДФЛПоТипуНДФЛДокументаОплаты(СтрокаТЧ.ТипНДФЛ, СтрокаТЧ.Документ);
	
КонецПроцедуры // ЗаполнитьСуммуНДФЛ()


&НаСервереБезКонтекста
Функция ЗаполнитьСуммуНДФЛПоТипуНДФЛДокументаОплаты(ТипНДФЛ, ДокументОплаты)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ДополнительныеРасходыРасходы.СуммаНДФЛ) КАК СуммаНДФЛ,
		|	ДополнительныеРасходыРасходы.ТипНДФЛ
		|ИЗ
		|	Документ.ДополнительныеРасходы.Расходы КАК ДополнительныеРасходыРасходы
		|ГДЕ
		|	ДополнительныеРасходыРасходы.ТипНДФЛ = &ТипНДФЛ
		|	И ДополнительныеРасходыРасходы.Ссылка = &ДокументОплаты
		|
		|СГРУППИРОВАТЬ ПО
		|	ДополнительныеРасходыРасходы.ТипНДФЛ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(ПриходнаяНакладнаяРасходы.СуммаНДФЛ),
		|	ПриходнаяНакладнаяРасходы.ТипНДФЛ
		|ИЗ
		|	Документ.ПриходнаяНакладная.Расходы КАК ПриходнаяНакладнаяРасходы
		|ГДЕ
		|	ПриходнаяНакладнаяРасходы.ТипНДФЛ = &ТипНДФЛ
		|	И ПриходнаяНакладнаяРасходы.Ссылка = &ДокументОплаты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриходнаяНакладнаяРасходы.ТипНДФЛ";
	
	Запрос.УстановитьПараметр("ДокументОплаты"	, ДокументОплаты);
	Запрос.УстановитьПараметр("ТипНДФЛ"			, ТипНДФЛ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СуммаНДФЛ = 0;
	
	Если Выборка.Следующий() Тогда
		СуммаНДФЛ = Выборка.СуммаНДФЛ;	
	КонецЕсли;

	Возврат СуммаНДФЛ;	

КонецФункции // ЗаполнитьСуммуНДФЛПоТипуНДФЛДокументаОплаты()

// Олег Литвиненко 11.10.22 --->
&НаКлиенте
Процедура ЗаполнитьСуммуРасчетов(СтрокаТекущиеДанные)
	
	СтрокаТекущиеДанные.СуммаРасчетов = ЗаполнитьСуммуРасчетовПоДокументу(СтрокаТекущиеДанные.Документ);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСуммуРасчетовПоДокументу(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасчетыСПоставщикамиОстатки.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.РасчетыСПоставщиками.Остатки(
	               |			&НаДату,
	               |			Организация = &Организация
	               |				И Документ = &Документ) КАК РасчетыСПоставщикамиОстатки";
	Запрос.УстановитьПараметр("НаДату", ?(ЗначениеЗаполнено(Объект.Ссылка), Новый Граница(Новый МоментВремени(Объект.Дата, Объект.Ссылка), ВидГраницы.Исключая), ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.СуммаОстаток, 0);
	
КонецФункции// Олег Литвиненко <---

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область Паганини_ПФ

&НаКлиенте
Процедура РасходыСуммаНДСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекДанные = Элементы.Расходы.ТекущиеДанные;
	ПредВидУдержанияНДФЛ	= ТекДанные.ВидУдержанияНДФЛ;
	ПредСтавкаНДС			= ТекДанные.СтавкаНДС;
	ПредВидУдержанияПФ		= ТекДанные.ВидУдержанияПФ;
КонецПроцедуры

&НаКлиенте
Процедура РасходыВидУдержанияНДФЛОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекДанные = Элементы.Расходы.ТекущиеДанные;
	ПредВидУдержанияНДФЛ	= ТекДанные.ВидУдержанияНДФЛ;
	ПредСтавкаНДС			= ТекДанные.СтавкаНДС;
	ПредВидУдержанияПФ		= ТекДанные.ВидУдержанияПФ;
КонецПроцедуры

&НаКлиенте
Процедура РасходыВидУдержанияПФОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекДанные = Элементы.Расходы.ТекущиеДанные;
	ПредВидУдержанияНДФЛ	= ТекДанные.ВидУдержанияНДФЛ;
	ПредСтавкаНДС			= ТекДанные.СтавкаНДС;
	ПредВидУдержанияПФ		= ТекДанные.ВидУдержанияПФ;
КонецПроцедуры


&НаКлиенте
Процедура РасходыВидУдержанияНДФЛПриИзменении(Элемент)
	ПересчитатьСуммыВСтрокиРасходов(Элементы.Расходы.ТекущаяСтрока, "ВидУдержанияНДФЛ");
КонецПроцедуры

&НаКлиенте
Процедура РасходыВидУдержанияПФПриИзменении(Элемент)
	ПересчитатьСуммыВСтрокиРасходов(Элементы.Расходы.ТекущаяСтрока, "ВидУдержанияПФ");
КонецПроцедуры


&НаКлиенте
Процедура РасходыВсегоПриИзменении(Элемент)
	ПересчитатьСуммыВСтрокиРасходов(Элементы.Расходы.ТекущаяСтрока, "Всего");
КонецПроцедуры

&НаКлиенте
Процедура РасходыСуммаБезНалоговПриИзменении(Элемент)
	ПересчитатьСуммыВСтрокиРасходов(Элементы.Расходы.ТекущаяСтрока, "СуммаБезНалогов");
КонецПроцедуры

&НаКлиенте
Процедура РасходыСуммаНДФЛПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС) + СтрокаТабличнойЧасти.СуммаНДФЛ + СтрокаТабличнойЧасти.СуммаПФ;
КонецПроцедуры

&НаКлиенте
Процедура РасходыСуммаПФПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС) + СтрокаТабличнойЧасти.СуммаНДФЛ + СтрокаТабличнойЧасти.СуммаПФ;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыВСтрокиРасходов(СтрокаРасход, ИмяПоля = "")
	
	ПересчитатьСуммыСтрокиРасхода(СтрокаРасход, ИмяПоля);
		
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммыСтрокиРасхода(Идентификатор, ИмяПоля)
	Если Идентификатор = Неопределено Тогда
		Для Каждого СтрокаТЧ ИЗ Объект.Расходы Цикл
			Идентификатор = СтрокаТЧ.ПолучитьИдентификатор();
			ТекДанные = Объект.Расходы.НайтиПоИдентификатору(Идентификатор);
			РС_ОбщегоНазначения.ПересчитатьСуммыСтрокиРасхода_ПриходнаяНакладная(ИмяПоля, ТекДанные, Объект.СуммаВключаетНДС);
		КонецЦикла;
	Иначе
		ТекДанные = Объект.Расходы.НайтиПоИдентификатору(Идентификатор);
		РС_ОбщегоНазначения.ПересчитатьСуммыСтрокиРасхода_ДополнительныеРасходы(ИмяПоля, ТекДанные, Объект.СуммаВключаетНДС);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьСуммыВСтрокиЗапасов(СтрокаЗапаса, ИмяПоля = "")
	
	ПересчитатьСуммыВСтрокиЗапаса(СтрокаЗапаса, ИмяПоля);
		
КонецПроцедуры
&НаСервере
Процедура ПересчитатьСуммыВСтрокиЗапаса(Идентификатор, ИмяПоля)
	Если Идентификатор = Неопределено Тогда
		Для Каждого СтрокаТЧ ИЗ Объект.РасшифровкаПлатежа Цикл
			Идентификатор = СтрокаТЧ.ПолучитьИдентификатор();
			ТекДанные = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(Идентификатор);
			РС_ОбщегоНазначения.ПересчитатьСуммыСтроки_АвансовыйОтчет_Запасы(ИмяПоля, ТекДанные, Объект.СуммаВключаетНДС);
		КонецЦикла;
	Иначе
		ТекДанные = Объект.Запасы.НайтиПоИдентификатору(Идентификатор);
		РС_ОбщегоНазначения.ПересчитатьСуммыСтроки_АвансовыйОтчет_Запасы(ИмяПоля, ТекДанные, Объект.СуммаВключаетНДС);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыВидУдержанияНДФЛПриИзменении(Элемент)
	РассчитатьСуммуВСтрокеТабличнойЧасти(Элементы.Расходы.ТекущаяСтрока, "Запасы", "ВидУдержанияНДФЛ");
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСуммаРасходовНДФЛПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС) + СтрокаТабличнойЧасти.СуммаНДФЛ + СтрокаТабличнойЧасти.СуммаПФ;
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыВидУдержанияПФПриИзменении(Элемент)
	РассчитатьСуммуВСтрокеТабличнойЧасти(Элементы.Расходы.ТекущаяСтрока, "Запасы", "ВидУдержанияПФ");
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСуммаПФПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС) + СтрокаТабличнойЧасти.СуммаНДФЛ + СтрокаТабличнойЧасти.СуммаПФ;
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммыТЧ(ПредНалогообложениеНДС, ПредСуммаВключаетНДС, пСтавкаНДСПоУмолчанию = Неопределено)
	
	ОблагаетсяНДС					= (Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
	ИзмениласьСуммаВключаетНДС		= НЕ ПредСуммаВключаетНДС = Объект.СуммаВключаетНДС;
	ИзмениласьНалогообложениеНДС	= (   ПредНалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС И НЕ ОблагаетсяНДС) ИЛИ
								      (НЕ ПредНалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС И    ОблагаетсяНДС);
	Если НЕ ИзмениласьСуммаВключаетНДС И НЕ ИзмениласьНалогообложениеНДС Тогда
		Возврат;
	КонецЕсли;
	Если пСтавкаНДСПоУмолчанию = Неопределено Тогда
		пСтавкаНДСПоУмолчанию	= Объект.Организация.СтавкаНДСПоУмолчанию
	КонецЕсли;
	
	//Запасы
	Для Каждого СтрокаЗапасы  ИЗ Объект.Запасы Цикл
		Если ИзмениласьНалогообложениеНДС Тогда
			Если ОблагаетсяНДС Тогда
				Номенклатура			= СтрокаЗапасы.Номенклатура;
				СтрокаЗапасы.СтавкаНДС	= ?(ЗначениеЗаполнено(Номенклатура.СтавкаНДС), Номенклатура.СтавкаНДС, пСтавкаНДСПоУмолчанию);
			Иначе
				Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
					СтрокаЗапасы.СтавкаНДС	= УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
				Иначе
					СтрокаЗапасы.СтавкаНДС	= УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		РС_ОбщегоНазначения.ПересчитатьСуммыСтроки_АвансовыйОтчет_Запасы("Всего", СтрокаЗапасы, Объект.СуммаВключаетНДС);
	КонецЦикла;
	//Расходы
	Для Каждого СтрокаРасходы ИЗ Объект.Расходы Цикл
		Если ИзмениласьНалогообложениеНДС Тогда
			Если ОблагаетсяНДС Тогда
				Номенклатура			= СтрокаРасходы.Номенклатура;
				СтрокаРасходы.СтавкаНДС	= ?(ЗначениеЗаполнено(Номенклатура.СтавкаНДС), Номенклатура.СтавкаНДС, пСтавкаНДСПоУмолчанию);
			Иначе
				Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
					СтрокаРасходы.СтавкаНДС	= УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
				Иначе
					СтрокаРасходы.СтавкаНДС	= УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		РС_ОбщегоНазначения.ПересчитатьСуммыСтрокиРасхода_ДополнительныеРасходы("СуммаБезНалогов", СтрокаРасходы, Объект.СуммаВключаетНДС);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС(ЭтоОткрытие = Ложь)
	
	НалогообложениеПередИзменением = Объект.НалогообложениеНДС;
	
	//Объект.НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Объект.Организация,, Объект.Дата, Объект.Контрагент, Объект.Договор);
	
	Если НЕ НалогообложениеПередИзменением = Объект.НалогообложениеНДС ИЛИ ЭтоОткрытие Тогда
		ЗаполнитьСтавкуНДСПоНалогообложениеНДС(НалогообложениеПередИзменением, Объект.СуммаВключаетНДС);//Паганини "Добавленны параметры"
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыВСтрокиОплат(СтрокаОплата, ИмяПоля = "")
	
	ПересчитатьСуммуВСтрокеОплата(СтрокаОплата, ИмяПоля);
		
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуВСтрокеОплата(Идентификатор, ИмяПоля)
	Если Идентификатор = Неопределено Тогда
		Для Каждого СтрокаТЧ ИЗ Объект.Расходы Цикл
			Идентификатор = СтрокаТЧ.ПолучитьИдентификатор();
			ТекДанные = Объект.Оплаты.НайтиПоИдентификатору(Идентификатор);
			РС_ОбщегоНазначения.ПересчитатьСуммыСтроки_АвансовыйОтчет_Оплата(ИмяПоля, ТекДанные);
		КонецЦикла;
	Иначе
		ТекДанные = Объект.Оплаты.НайтиПоИдентификатору(Идентификатор);
		РС_ОбщегоНазначения.ПересчитатьСуммыСтроки_АвансовыйОтчет_Оплата(ИмяПоля, ТекДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОплатыВидУдержанияНДФЛПриИзменении(Элемент)
	ПересчитатьСуммыВСтрокиОплат(Элементы.Оплаты.ТекущаяСтрока, "ВидУдержанияНДФЛ");
КонецПроцедуры

&НаКлиенте
Процедура ОплатыВидУдержанияПФПриИзменении(Элемент)
	ПересчитатьСуммыВСтрокиОплат(Элементы.Оплаты.ТекущаяСтрока, "ВидУдержанияПФ");
КонецПроцедуры

&НаСервере
Процедура ПлатежныеВедомостиВедомостьПриИзмененииНаСервере(УИДСтроки)
	
	СтрокаВедомостей = Объект.ПлатежныеВедомости.НайтиПоИдентификатору(УИДСтроки);
	СтрокаВедомостей.Сумма = СтрокаВедомостей.Ведомость.СуммаДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеВедомостиВедомостьПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ПлатежныеВедомости.ТекущиеДанные;
	УИДСтроки = ТекСтрока.ПолучитьИдентификатор();
	
	ПлатежныеВедомостиВедомостьПриИзмененииНаСервере(УИДСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеВедомостиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.Оплаты.Итог("СуммаНДФЛ") + Объект.ПлатежныеВедомости.Итог("Сумма");//+++ Дмгг
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Подбор(Команда)
	
	
	Если Объект.Оплаты.Количество()= 0 тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ka='დასაწყისში მიუთითეთ კონტრაგენტი!';ru='Укажите вначале контрагента!';en='Specify the first contractor!'"));
		Возврат;
	КонецЕсли;
	
	АдресРасшифровкаПлатежаВХранилище = ПоместитьОплатыВХранилище();
	
	ПараметрыПодбора = Новый Структура(
		"АдресРасшифровкаПлатежаВХранилище,
		|Компания,
		|ВалютаДенежныхСредств,
		|Дата,
		|Ссылка,
		|СуммаДокумента",
		АдресРасшифровкаПлатежаВХранилище,
		Компания,
		Объект.ВалютаДокумента,
		Объект.Дата,
		Объект.Ссылка,
		СуммаДокумента);
	
	Результат = Неопределено;
	
	ОткрытьФорму("Документ.АвансовыйОтчет.Форма.ФормаПодбораДолговПоставщикам", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект, Новый Структура("АдресРасшифровкаПлатежаВХранилище", АдресРасшифровкаПлатежаВХранилище)));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗавершение(Результат1, ДополнительныеПараметры) Экспорт
	
	АдресРасшифровкаПлатежаВХранилище = ДополнительныеПараметры.АдресРасшифровкаПлатежаВХранилище;
		
	Результат = Результат1;
	Если Результат = КодВозвратаДиалога.OK Тогда	
		ПолучитьОплатыИзХранилища(АдресРасшифровкаПлатежаВХранилище);		
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Функция ПоместитьОплатыВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.Оплаты.Выгрузить(,
			"Контрагент,
			|Договор,
			|ПризнакАванса,
			|Документ,
			|Заказ,
			|СуммаРасчетов,
			|Курс,
			|Кратность,
			|СуммаПлатежа"
		),
		УникальныйИдентификатор
	);
	
КонецФункции

&НаСервере
Процедура ПолучитьОплатыИзХранилища(АдресРасшифровкаПлатежаВХранилище, Очищать = Истина)
	
	ТаблицаРасшифровкаПлатежа = ПолучитьИзВременногоХранилища(АдресРасшифровкаПлатежаВХранилище);
	Если Очищать Тогда
		Объект.Оплаты.Очистить();
	КонецЕсли;
	Для каждого СтрокаОплаты Из ТаблицаРасшифровкаПлатежа Цикл
		Строка = Объект.Оплаты.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаОплаты);
		Строка.ВестиРасчетыПоДоговорам = СтрокаОплаты.Контрагент.ВестиРасчетыПоДоговорам;
		Строка.ВестиРасчетыПоДокументам = СтрокаОплаты.Контрагент.ВестиРасчетыПоДокументам;
		Строка.ВестиРасчетыПоЗаказам = СтрокаОплаты.Контрагент.ВестиРасчетыПоЗаказам;
		Строка.ВестиУчетОплатыПоСчетам = СтрокаОплаты.Контрагент.ВестиУчетОплатыПоСчетам;	
			
		Строка.Курс = ?(
		Строка.Курс = 0,
		1,
		Строка.Курс
		);
		Строка.Кратность = ?(
		Строка.Кратность = 0,
		1,
		Строка.Кратность
		);
		
		Строка.СуммаПлатежа = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
		Строка.СуммаРасчетов,
		Строка.Курс,
		Объект.Курс,
		Строка.Кратность,
		Объект.Кратность
		);		
	КонецЦикла;
	
	ПотраченоИтог = Объект.Запасы.Итог("Всего") + Объект.Расходы.Итог("Всего") + Объект.Оплаты.Итог("СуммаПлатежа") + Объект.ПлатежныеВедомости.Итог("Сумма");
	
КонецПроцедуры

//+++ Дмгг, 07.05.2025, ONESOFT-4025
&НаКлиенте
Процедура ПлатежныеВедомостиДетальныйПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВедомость(Команда)
	
	ПараметрыПодбора = Новый Структура();
	
	Результат = Неопределено;
	
	ОткрытьФорму("Документ.ПлатежнаяВедомость.Форма.ФормаВыбора", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("ДобавитьВедомостьЗавргение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВедомостьЗавргение(Результат1, ДополнительныеПараметры) Экспорт
	
	Результат = Результат1;
	
	Если Результат <> Неопределено Тогда 
		ЗаполнитьПлатежныеВедомостиДетальныйНаСервере(Результат);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлатежныеВедомостиДетальныйНаСервере(Ведомость)
	
	Для Каждого Строк Из Ведомость.Сотрудники Цикл 
		
		СтруктураПоиска = Новый Структура("Ведомость, Сотрудник", Ведомость, Строк.Сотрудник);
		
		МассивСтроок = Объект.ПлатежныеВедомостиДетальный.НайтиСтроки(СтруктураПоиска);
		
		Если МассивСтроок.Количество() = 0 Тогда 
			
			СтрокаЗаполнения = Объект.ПлатежныеВедомостиДетальный.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаЗаполнения, Строк);
			СтрокаЗаполнения.Ведомость = Ведомость;
			СтрокаЗаполнения.Сумма = Строк.СуммаРасчетов;
			
		Иначе 
			
			Продолжить;
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеВедомостиДетальныйСуммаПриИзменении(Элемент)
	
	ПересчитатьСуммуПоВалюте(Элементы.ПлатежныеВедомостиДетальный.ТекущиеДанные, Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
// Процедура заполняет табличную часть Сотрудники остатками по начислениям.
//
Процедура ПересчитатьСуммуПоВалюте(СтрокаТабличнойЧасти, ИзмененоНачисление, ИзмененоКВыдаче, ДополнительныеПараметры = Неопределено)
	
	РасчитатьСуммы_ПФ_НДФЛ(Элементы.ПлатежныеВедомостиДетальный.ТекущаяСтрока);//Паганини ПФ
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьСуммы_ПФ_НДФЛ(Идентификатор)
	
	СтавкаНДФЛ	= 0;
	СтавкаПФ	= 0;
	
	Если ТипЗнч(Идентификатор) = Тип("Число") Тогда
		ТекСтрока = Объект.ПлатежныеВедомостиДетальный.НайтиПоИдентификатору(Идентификатор);
	Иначе
		ТекСтрока = Идентификатор; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтрока.ВидУдержанияНДФЛ) Тогда
		СтавкаНДФЛ = ТекСтрока.ВидУдержанияНДФЛ.СтавкаНДФЛ;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекСтрока.ВидУдержанияПФ) Тогда
		СтавкаПФ = ТекСтрока.ВидУдержанияПФ.СтавкаПФ;
	КонецЕсли;
	
	СтрукОтвета = ПолучитьСуммоНалоговыхЛгот(Объект.Организация,ТекСтрока.Сотрудник,ТекСтрока.СтруктурнаяЕдиница,ТекСтрока.Ведомость.ПериодРегистрации,ТекСтрока.Ведомость);
	СуммаЛгот = СтрукОтвета.Сумма;
	ПроцентПодоходного = СтрукОтвета.ПроцентПодоходного;
	СуммаПлатежа = ТекСтрока.Сумма;
	СтавкаЛгот = СтавкаНДФЛ-ПроцентПодоходного;
	
	Если СтавкаЛгот < 0 Тогда
		СтавкаЛгот = 0
	КонецЕсли;	
	
	НДФЛЛгот = СуммаЛгот * (СтавкаЛгот/100);	
	НэтЛгот = СуммаЛгот - НДФЛЛгот;
	
	Если НэтЛгот >= СуммаПлатежа Тогда	
		
		Если СуммаПлатежа/((100-СтавкаЛгот)/100) < СуммаЛгот Тогда
			СуммаДляНалогов = 0;
			СуммаЛгот = СуммаПлатежа/((100-СтавкаЛгот)/100); 
		Иначе
			СуммаДляНалогов = Окр(СуммаПлатежа /((100-СтавкаЛгот)/100),2) - СуммаЛгот;
			СуммаЛгот = СуммаЛгот;
		КонецЕсли;	
		
		НДФЛБезЛгот = Окр((СуммаДляНалогов) /((100-СтавкаНДФЛ)/100), 2) - СуммаДляНалогов;
		НДФЛЛгот    = Окр((СуммаЛгот) - СуммаЛгот*((100-СтавкаЛгот)/100),2);
		
	Иначе		
		НДФЛБезЛгот = Окр((СуммаПлатежа - НэтЛгот)/((100-СтавкаНДФЛ)/100) - (СуммаПлатежа - НэтЛгот),2);			
	КонецЕсли;	
		
		
	ТекСтрока.НДФЛПлатежа		= НДФЛБезЛгот + НДФЛЛгот;
	ТекСтрока.СуммаЛгот = СуммаЛгот;
	ТекСтрока.СуммаПФПлатежа	= Окр((ТекСтрока.Сумма + ТекСтрока.НДФЛПлатежа) * СтавкаПФ/(100 - СтавкаПФ), 2);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммоНалоговыхЛгот(Организация,Сотрудник,Подразделение,Дата,Ведомость) 
	
	СтрукОтвета = Новый Структура;
	СтрукОтвета.Вставить("Сумма",0);
	СтрукОтвета.Вставить("ПроцентПодоходного",20);
	
	Если Ведомость.ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Аванс Тогда
		СтрукОтвета = РС_ОбщегоНазначения.ПолучитьСуммоНалоговыхЛгот(Организация,Сотрудник,Подразделение,Дата+1);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НалоговыеЛготыОстатки.Сотрудник,
	               |	НалоговыеЛготыОстатки.СуммаОстаток КАК Сумма,
	               |	НалоговыеЛготыОстатки.Организация,
	               |	НалоговыеЛготыОстатки.Подразделение,
	               |	НалоговыеЛготыИнформацияСрезПоследних.ПроцентПодоходного
	               |ИЗ
	               |	РегистрНакопления.НалоговыеЛготы.Остатки(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Подразделение = &Подразделение
	               |				И Сотрудник = &Сотрудник
	               |				И ТипЛгот = &ТипЛгот) КАК НалоговыеЛготыОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалоговыеЛготыИнформация.СрезПоследних КАК НалоговыеЛготыИнформацияСрезПоследних
	               |		ПО НалоговыеЛготыОстатки.Организация = НалоговыеЛготыИнформацияСрезПоследних.Организация
	               |			И НалоговыеЛготыОстатки.Сотрудник = НалоговыеЛготыИнформацияСрезПоследних.Сотрудник
	               |			И НалоговыеЛготыОстатки.Подразделение = НалоговыеЛготыИнформацияСрезПоследних.Подразделение";
	
	
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("Дата",Дата+1);
	Запрос.УстановитьПараметр("Организация",Организация);	
	
	Если Ведомость.ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента Тогда
		Запрос.УстановитьПараметр("ТипЛгот",Перечисления.ТипЛгот.УдержаниеДляКонтрагента);
	Иначе
		Запрос.УстановитьПараметр("ТипЛгот",Перечисления.ТипЛгот.Прочее);
	КонецЕсли;
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтрукОтвета.Сумма = СтрукОтвета.Сумма + Выборка.Сумма;
		СтрукОтвета.ПроцентПодоходного = Выборка.ПроцентПодоходного;
	КонецЕсли; 
	
	Возврат СтрукОтвета;
	
КонецФункции
//--- Дмгг, 07.05.2025, ONESOFT-4025
