
&НаКлиенте
Процедура ПланыОбменаМобильнойТорговли(Команда)
	ОткрытьФорму("ПланОбмена.ОПТИМУС_Дистрибуция.ФормаСписка");
КонецПроцедуры

// Процедура - обработчик нажатия ссылки НазадНаГлавнуюСтраницу.
//
&НаКлиенте
Процедура НазадНаГлавнуюСтраницуНажатие(Элемент)
	
	Если Модифицированность Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ТекстСообщения = НСтр("ka='მონაცემები ჯერ არ ჩაწერილა! დაბრუნება შესაძლებელია მხოლოდ მონაცემთა ჩაწერის შემდეგ! ჩავწეროთ?';ru='Данные еще не записаны! Возврат возможен только после записи данных! Записать?';en='The data has not yet been written! Return is possible only after the data! Record?'");
		Ответ = Вопрос(ТекстСообщения, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ФормаЗаписана = ЭтаФорма.Записать();
			Если НЕ ФормаЗаписана Тогда
				Возврат;
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры // НазадНаГлавнуюСтраницуНажатие()

&НаКлиенте
Процедура ОткрытьФормуМобильныеЛицензии(Команда)
	ОткрытьФорму("ОбщаяФорма.ОПТИМУС_КоличествоПлановОбменаДистрибуции");
КонецПроцедуры
