Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, Неопределено, "");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РегистрДокументЗапроса Приход
	
	Склад = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ОсновнойСклад");
	Подразделение = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ОсновноеПодразделение");
	
	
	Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 
		СтруктурнаяЕдиница = Склад;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДепартаментИспольнитель) Тогда 
		ДепартаментИспольнитель = Подразделение;	
	КонецЕсли;
	Движения.РегистрДокументЗапроса.Записывать = Истина;
	Для Каждого ТекСтрокаЗапасы Из Запасы Цикл
		Движение = Движения.РегистрДокументЗапроса.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
		Движение.Номенклатура = ТекСтрокаЗапасы.Номенклатура;
		Движение.Проект = Проект;
		Движение.ПередатьВЗаказ = ТекСтрокаЗапасы.ПередатьВЗаказ;
		Движение.ДепартаментИспольнитель = ДепартаментИспольнитель;
		Движение.Автор = Автор;
		Движение.Ответственный = Ответственный;
		Движение.Статус = Статус;
		Движение.ДатаДоставки = ДатаДоставки;
		Движение.Количество = ТекСтрокаЗапасы.Количество;
		Движение.Сумма = ТекСтрокаЗапасы.Цена;
		Движение.Заказшик = Заказшик;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
