
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	ХЗНастройкиОбмена = Константы.НастройкиДляОтправкиОтчетов.Получить();
	УстановитьПривилегированныйРежим(Истина);
	Если ХЗНастройкиОбмена <> Неопределено И ТипЗнч(ХЗНастройкиОбмена) = Тип("ХранилищеЗначения") Тогда
	
		НастройкиОбмена = ХЗНастройкиОбмена.Получить();
		Если ТипЗнч(НастройкиОбмена) = Тип("Структура") Тогда
		
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОбмена);	
		
		КонецЕсли; 
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	Профиль = новый ИнтернетПочтовыйПрофиль;
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = ИмяСервераSMTP;
	Профиль.ИспользоватьSSLSMTP = ИспользоватьSSLSMTP;
	Профиль.ПользовательSMTP =ЛогинSMTP;
	Профиль.ПарольSMTP = ПарольSMTP;
	Профиль.ПортSMTP = ПортSMTP;
	//Профиль.ТолькоЗащищеннаяАутентификацияSMTP = Истина;
	Профиль.Таймаут = 600;
	
	Попытка
        Почта = Новый ИнтернетПочта;
        Почта.Подключиться(Профиль);
    Исключение
        Сообщить("Ошибка подключения к серверу!");
        Сообщить(""+ОписаниеОшибки());
        Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	ТекстВопроса = НСтр("ka='Сохранить настройки?';ru='Сохранить настройки?';en='Сохранить настройки?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("СохранитьНастройкиЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
	
		СтруктураНастроек = Новый Структура;
		
		//POP3                                           
		//СтруктураНастроек.Вставить("ИспользоватьSSLPOP3", ИспользоватьSSLPOP3);
		//СтруктураНастроек.Вставить("ИмяСервераPOP3", ИмяСервераPOP3);
		//СтруктураНастроек.Вставить("ПортPOP3", ПортPOP3); 
		//СтруктураНастроек.Вставить("ЛогинPOP3", ЛогинPOP3);
		//СтруктураНастроек.Вставить("ПарольPOP3", ПарольPOP3); 
		
		//POP3                                           
		СтруктураНастроек.Вставить("ИспользоватьSSLSMTP", 	ИспользоватьSSLSMTP);
		СтруктураНастроек.Вставить("ИмяСервераSMTP", 		ИмяСервераSMTP);
		СтруктураНастроек.Вставить("ПортSMTP", 				ПортSMTP); 
		СтруктураНастроек.Вставить("ЛогинSMTP", 			ЛогинSMTP);
		СтруктураНастроек.Вставить("ПарольSMTP", 			ПарольSMTP);
		СтруктураНастроек.Вставить("КоличествоПисемЗаРаз", 	КоличествоПисемЗаРаз);
		СтруктураНастроек.Вставить("ПериодичностьОтправки", ПериодичностьОтправки);
		
		//IMAP                                           
		//СтруктураНастроек.Вставить("ИспользоватьSSLIMAP", ИспользоватьSSLIMAP);
		//СтруктураНастроек.Вставить("ИмяСервераIMAP", ИмяСервераIMAP);
		//СтруктураНастроек.Вставить("ПортIMAP", ПортIMAP); 
		//СтруктураНастроек.Вставить("ЛогинIMAP", ЛогинIMAP);
		//СтруктураНастроек.Вставить("ПарольIMAP", ПарольIMAP); 
		
		СохранитьНастройкиОбмена(СтруктураНастроек);
	
	КонецЕсли; 
	
	Если ЭтаФорма.Открыта() Тогда 
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкиОбмена(СтруктураНастроек)

	УстановитьПривилегированныйРежим(Истина);
	Константы.НастройкиДляОтправкиОтчетов.Установить(Новый ХранилищеЗначения(СтруктураНастроек, Новый СжатиеДанных(9)));
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры // СохранитьНастройкиОбмена()


