#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыЗаполненияДокумента

// Процедура заполняет авансы.
//
Процедура ЗаполнитьПредоплату() Экспорт
	
	ЗаказВШапке = (ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке);
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация);
	
	// Подготовка таблицы заказов.
	ТаблицаЗаказов = Запасы.Выгрузить(, "Заказ, Всего");
	ТаблицаЗаказов.Колонки.Добавить("ВсегоРасч");
	Для каждого ТекСтрока Из ТаблицаЗаказов Цикл
		Если НЕ Контрагент.ВестиРасчетыПоЗаказам Тогда
			ТекСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
		ИначеЕсли ЗаказВШапке Тогда
			ТекСтрока.Заказ = Заказ;
		Иначе
			ТекСтрока.Заказ = ?(ТекСтрока.Заказ = Неопределено, Документы.ЗаказПокупателя.ПустаяСсылка(), ТекСтрока.Заказ);
		КонецЕсли;
		ТекСтрока.ВсегоРасч = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
			ТекСтрока.Всего,
			?(Договор.ВалютаРасчетов = ВалютаДокумента, Курс, 1),
			Курс,
			?(Договор.ВалютаРасчетов = ВалютаДокумента, Кратность, 1),
			Кратность
		);
	КонецЦикла;
	ТаблицаЗаказов.Свернуть("Заказ", "Всего, ВсегоРасч");
	ТаблицаЗаказов.Сортировать("Заказ Возр");
	
	// Заполнение расшифровки предоплаты.
	Запрос = Новый Запрос;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|	РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|	РасчетыСПокупателямиОстатки.ДокументДата КАК ДокументДата,
	|	РасчетыСПокупателямиОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаВалОстаток) КАК СуммаВалОстаток,
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаРегОстаток) КАК СуммаРегОстаток
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателямиОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПокупателямиОстатки.Договор КАК Договор,
	|		РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|		РасчетыСПокупателямиОстатки.Документ.Дата КАК ДокументДата,
	|		РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРегОстаток, 0) КАК СуммаРегОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПокупателями.Остатки(
	|				,
	|				Организация = &Организация
	|					И Контрагент = &Контрагент
	|					И Договор = &Договор
	|					И Заказ В (&Заказ)
	|					И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК РасчетыСПокупателямиОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаРасчетыСПокупателями.Договор,
	|		ДвиженияДокументаРасчетыСПокупателями.Документ,
	|		ДвиженияДокументаРасчетыСПокупателями.Документ.Дата,
	|		ДвиженияДокументаРасчетыСПокупателями.Заказ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.Сумма, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.СуммаВал, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.СуммаВал, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.СуммаРег, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПокупателями.СуммаРег, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокументаРасчетыСПокупателями
	|	ГДЕ
	|		ДвиженияДокументаРасчетыСПокупателями.Регистратор = &Ссылка
	|		И ДвиженияДокументаРасчетыСПокупателями.Период <= &Период
	|		И ДвиженияДокументаРасчетыСПокупателями.Организация = &Организация
	|		И ДвиженияДокументаРасчетыСПокупателями.Контрагент = &Контрагент
	|		И ДвиженияДокументаРасчетыСПокупателями.Договор = &Договор
	|		И ДвиженияДокументаРасчетыСПокупателями.Заказ В(&Заказ)
	|		И ДвиженияДокументаРасчетыСПокупателями.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК РасчетыСПокупателямиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПокупателямиОстатки.Документ,
	|	РасчетыСПокупателямиОстатки.Заказ,
	|	РасчетыСПокупателямиОстатки.ДокументДата,
	|	РасчетыСПокупателямиОстатки.Договор.ВалютаРасчетов
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаВалОстаток) < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|	РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|	РасчетыСПокупателямиОстатки.ДокументДата КАК ДокументДата,
	|	РасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	|	-СУММА(РасчетыСПокупателямиОстатки.СуммаУчета) КАК СуммаУчета,
	|	-СУММА(РасчетыСПокупателямиОстатки.СуммаРасчетов) КАК СуммаРасчетов,
	|	-СУММА(РасчетыСПокупателямиОстатки.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРег, 0) = 0
	|				ТОГДА РасчетыСПокупателямиОстатки.СуммаУчета / ВЫБОР
	|						КОГДА ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРасчетов, 0) <> 0
	|							ТОГДА РасчетыСПокупателямиОстатки.СуммаРасчетов
	|						ИНАЧЕ 1
	|					КОНЕЦ * (РасчетыСПокупателямиОстатки.КурсыВалютыУчетаКурс / РасчетыСПокупателямиОстатки.КурсыВалютыУчетаКратность)
	|			ИНАЧЕ РасчетыСПокупателямиОстатки.СуммаРег / ВЫБОР
	|					КОГДА ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРасчетов, 0) <> 0
	|						ТОГДА РасчетыСПокупателямиОстатки.СуммаРасчетов
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОНЕЦ) КАК Курс,
	|	1 КАК Кратность,
	|	РасчетыСПокупателямиОстатки.КурсыВалютыДокументаКурс КАК КурсыВалютыДокументаКурс,
	|	РасчетыСПокупателямиОстатки.КурсыВалютыДокументаКратность КАК КурсыВалютыДокументаКратность
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	|		РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|		РасчетыСПокупателямиОстатки.ДокументДата КАК ДокументДата,
	|		РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаУчета,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаРасчетов,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) * КурсыВалютыУчета.Курс * &КратностьВалютыДокумента / (&КурсВалютыДокумента * КурсыВалютыУчета.Кратность) КАК СуммаПлатежа,
	|		ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаРегОстаток, 0) КАК СуммаРег,
	|		КурсыВалютыУчета.Курс КАК КурсыВалютыУчетаКурс,
	|		КурсыВалютыУчета.Кратность КАК КурсыВалютыУчетаКратность,
	|		&КурсВалютыДокумента КАК КурсыВалютыДокументаКурс,
	|		&КратностьВалютыДокумента КАК КурсыВалютыДокументаКратность
	|	ИЗ
	|		ВременнаяТаблицаРасчетыСПокупателямиОстатки КАК РасчетыСПокупателямиОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаУчета) КАК КурсыВалютыУчета
	|			ПО (ИСТИНА)) КАК РасчетыСПокупателямиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПокупателямиОстатки.Документ,
	|	РасчетыСПокупателямиОстатки.Заказ,
	|	РасчетыСПокупателямиОстатки.ДокументДата,
	|	РасчетыСПокупателямиОстатки.ВалютаРасчетов,
	|	РасчетыСПокупателямиОстатки.КурсыВалютыУчетаКурс,
	|	РасчетыСПокупателямиОстатки.КурсыВалютыУчетаКратность,
	|	РасчетыСПокупателямиОстатки.КурсыВалютыДокументаКурс,
	|	РасчетыСПокупателямиОстатки.КурсыВалютыДокументаКратность
	|
	|ИМЕЮЩИЕ
	|	-СУММА(РасчетыСПокупателямиОстатки.СуммаРасчетов) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата";

	Запрос.УстановитьПараметр("Заказ", ТаблицаЗаказов.ВыгрузитьКолонку("Заказ"));
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ВалютаДокумента", ВалютаДокумента);
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Если Договор.ВалютаРасчетов = ВалютаДокумента Тогда
		Запрос.УстановитьПараметр("КурсВалютыДокумента", Курс);
		Запрос.УстановитьПараметр("КратностьВалютыДокумента", Кратность);
	Иначе
		Запрос.УстановитьПараметр("КурсВалютыДокумента", 1);
		Запрос.УстановитьПараметр("КратностьВалютыДокумента", 1);
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = ТекстЗапроса;
	
	Предоплата.Очистить();
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
		
		НайденнаяСтрока = ТаблицаЗаказов.Найти(ВыборкаРезультатаЗапроса.Заказ, "Заказ");
		
		Если НайденнаяСтрока.ВсегоРасч = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыборкаРезультатаЗапроса.СуммаРасчетов <= НайденнаяСтрока.ВсегоРасч Тогда // сумма остатка меньше или равна чем осталось распределить
			
			НоваяСтрока = Предоплата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
			НайденнаяСтрока.ВсегоРасч = НайденнаяСтрока.ВсегоРасч - ВыборкаРезультатаЗапроса.СуммаРасчетов;
			
		Иначе // сумма остатка больше чем нужно распределить
			
			НоваяСтрока = Предоплата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
			НоваяСтрока.СуммаРасчетов = НайденнаяСтрока.ВсегоРасч;
			НоваяСтрока.СуммаПлатежа = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
				НоваяСтрока.СуммаРасчетов,
				ВыборкаРезультатаЗапроса.Курс,
				ВыборкаРезультатаЗапроса.КурсыВалютыДокументаКурс,
				ВыборкаРезультатаЗапроса.Кратность,
				ВыборкаРезультатаЗапроса.КурсыВалютыДокументаКратность
			);
			НайденнаяСтрока.ВсегоРасч = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПредоплату()

// Обработчик заполнения документа по структуре
//
// Параметры:
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения.Свойство("Основание")
		И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказПокупателя")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Основание, "ВидОперации") = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд
		Тогда
		ВызватьИсключение НСтр("ka='გასავლის ზედნადების შეყვანა შეუძლებელია შეკვეთა-განწესის საფუძველზე!';ru='Нельзя ввести Расходную накладную на основании заказ-наряда!';en='You can not enter outgoing invoices based on purchase order!'");
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("МассивЗаказовПокупателей") Тогда
		ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ДокументОснованиеПродажа") Тогда
		ЗаполнитьПоПриходнойНакладной(ДанныеЗаполнения.ДокументОснованиеПродажа, "Продажа");
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ДокументОснованиеВозврат") Тогда
		ЗаполнитьПоПриходнойНакладной(ДанныеЗаполнения.ДокументОснованиеВозврат, "Возврат");
	КонецЕсли;
	
КонецПроцедуры

// Обработчик заполнения документа на основании Приходной накладной.
//
// Параметры:
//  ДанныеЗаполнения - Структура - Основание для заполнения документа.
//
Процедура ЗаполнитьПоПриходнойНакладной(ДанныеЗаполнения, Операция = "") Экспорт
	
	// Заполнение шапки документа.
	Если Операция = "Продажа" Тогда
		Если ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика
			ИЛИ ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию Тогда
			ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
		Иначе
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ka='ოპერაცია ""მყიდველისთვის მიყიდვა""-ს შეყვანა შეუძლებელია ოპერაციის საფუძველზე - ""%1""!';ru='Невозможен ввод операции ""Продажа покупателю"" на основании операции - ""%1""!';en='You can not enter operations ""sale the buyer"" on the basis of the operation - ""%1""!'"),
			ДанныеЗаполнения.ВидОперации);
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
	ИначеЕсли Операция = "Возврат" Тогда
				
		Если ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика Тогда
			ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику;
		ИначеЕсли ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию Тогда
			ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту;
		ИначеЕсли ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемВПереработку Тогда
			ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки;
		ИначеЕсли ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаОтветхранение Тогда
			ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения;
		Иначе
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ka='ოპერაცია ""დაბრუნება""-ს შეყვანა შეუძლებელია ოპერაციის საფუძველზე - ""%1""!';ru='Невозможен ввод операции ""Возврат"" на основании операции - ""%1""!';en='You can not enter ""Operation Return"" on the basis of the operation - ""%1""!'"),
			ДанныеЗаполнения.ВидОперации);
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
	КонецЕсли;
	
	Если УправлениеНебольшойФирмойПовтИсп.РеквизитВШапке("ПоложениеЗаказаПокупателяВДокументахОтгрузки") 
		И ДанныеЗаполнения.ПоложениеЗаказаПоставщику = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		Заказ = ДанныеЗаполнения.Заказ;
	Иначе
		Заказ = Неопределено;
	КонецЕсли;
	
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
	Организация = ДанныеЗаполнения.Организация;
	
	Если ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения Тогда
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор;
		НалогообложениеНДС = ДанныеЗаполнения.НалогообложениеНДС;
	Иначе	
		НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Организация,, Дата);
	КонецЕсли;
	
	СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
	Ячейка = ДанныеЗаполнения.Ячейка;
	ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
	НДСВключатьВСтоимость = ДанныеЗаполнения.НДСВключатьВСтоимость;
	
	Курс = ДанныеЗаполнения.Курс;
	Кратность = ДанныеЗаполнения.Кратность;
	
	// Заполнение табличной части документа.
	Запасы.Очистить();
	СерийныеНомера.Очистить();
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Запасы Цикл
		
		НоваяСтрока = Запасы.Добавить();
		Если ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти, ,"Цена, Сумма, СуммаНДС, Всего");
		Иначе
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("УчетГТД") Тогда
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти, "СтранаПроисхождения, НомерГТД");
			
		КонецЕсли;
		
		НоваяСтрока.ТипНоменклатурыЗапас = (НоваяСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
		
		Если НЕ ДанныеЗаполнения.ПоложениеЗаказаПоставщику = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке
			И УправлениеНебольшойФирмойПовтИсп.РеквизитВШапке("ПоложениеЗаказаПокупателяВДокументахОтгрузки") Тогда
			НоваяСтрока.Заказ = Неопределено;
		КонецЕсли;
		
		Если НалогообложениеНДС = ДанныеЗаполнения.НалогообложениеНДС Тогда
			Продолжить;
		КонецЕсли;
		
		Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
			
			Для каждого СтрокаТабличнойЧасти Из Запасы Цикл
				
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС) Тогда
					СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
				Иначе
					СтрокаТабличнойЧасти.СтавкаНДС = Организация.СтавкаНДСПоУмолчанию;
				КонецЕсли;
				
				СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
					СтрокаТабличнойЧасти.СуммаНДС = ?(СуммаВключаетНДС, 
					СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
					СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
					СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
				
			КонецЦикла;
			
		Иначе
			
			Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
				СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
			Иначе
				СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
			КонецЕсли;
			
			Для каждого СтрокаТабличнойЧасти Из Запасы Цикл
				
				СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
				СтрокаТабличнойЧасти.СуммаНДС = 0;
				
				СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ЭтотОбъект, ДанныеЗаполнения);
	
	//+++
	//Заполнение таблицы "Предоплаты"
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная")
		И ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика
		И ДанныеЗаполнения.Предоплата.Количество() > 0 Тогда 
		
		Для Каждого СтрокаПредоплаты Из ДанныеЗаполнения.Предоплата Цикл 
			СтрокаТЧ_Предоплаты = Предоплата.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ_Предоплаты, СтрокаПредоплаты);
		КонецЦикла;
		
	КонецЕсли;
	//---
	
КонецПроцедуры // ЗаполнитьПоПриходнаяНакладная()

// Обработчик заполнения на основании Заказа покупателя.
//
// Параметры:
//  ДанныеЗаполнения - Структура, ДокументСсылка.ПриходнаяНакладная - Основание для заполнения документа.
//
Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения) Экспорт
	
	Если ЭтоВводНаОснованииЗаказНаряда(ДанныеЗаполнения) Тогда
		ВызватьИсключение НСтр("ka='გასავლის ზედნადების შეყვანა შეუძლებელია შეკვეთა-განწესის საფუძველზე!';ru='Нельзя ввести Расходную накладную на основании заказ-наряда!';en='You can not enter outgoing invoices based on purchase order!'");
	КонецЕсли;
	
	// Основание и настройка документа.
	МассивЗаказов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("МассивЗаказовПокупателей") Тогда
		МассивЗаказов = ДанныеЗаполнения.МассивЗаказовПокупателей;
		ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
	Иначе
		МассивЗаказов.Добавить(ДанныеЗаполнения.Ссылка);
		ПоложениеЗаказаПокупателя = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ПоложениеЗаказаПокупателяВДокументахОтгрузки");
		Если НЕ ЗначениеЗаполнено(ПоложениеЗаказаПокупателя) Тогда
			ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
		КонецЕсли;
		Если ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
			Заказ = ДанныеЗаполнения;
		КонецЕсли;
	КонецЕсли;
	
	//ДД Заполнить Доп Реквизиты
	ЗаполнитьДопРеквизиты(ДанныеЗаполнения);
	
	
	
	// Заполнение шапки.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК ОснованиеСсылка,
	|	ЗаказПокупателя.Проведен КАК ОснованиеПроведен,
	|	ЗаказПокупателя.СостояниеЗаказа КАК СостояниеЗаказа,
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.БанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ЗаказПокупателя.Организация.БанковскийСчетПоУмолчанию
	|		ИНАЧЕ ЗаказПокупателя.БанковскийСчет
	|	КОНЕЦ КАК БанковскийСчет,
	|	ВЫБОР
	|		КОГДА РезервированиеЗапасов.Значение
	|			ТОГДА ЗаказПокупателя.СтруктурнаяЕдиницаРезерв
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ЗаказПокупателя.СтруктурнаяЕдиницаПродажи КАК Подразделение,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.Договор КАК Договор,
	|	ЗаказПокупателя.Договор КАК ОснованиеПечатиСсылка,
	|	ЗаказПокупателя.ВидЦен КАК ВидЦен,
	|	ЗаказПокупателя.ВидСкидкиНаценки КАК ВидСкидкиНаценки,
	|	ЗаказПокупателя.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ЗаказПокупателя.ПроцентСкидкиПоДисконтнойКарте КАК ПроцентСкидкиПоДисконтнойКарте,
	|	ЗаказПокупателя.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗаказПокупателя.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ЗаказПокупателя.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЗаказПокупателя.НДСВключатьВСтоимость КАК НДСВключатьВСтоимость,
	|	ЗаказПокупателя.ОжидаетсяВыборВариантаКП,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.ВалютаДокумента = НациональнаяВалюта.Значение
	|			ТОГДА ЗаказПокупателя.Курс
	|		ИНАЧЕ КурсыВалютСрезПоследних.Курс
	|	КОНЕЦ КАК Курс,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.ВалютаДокумента = НациональнаяВалюта.Значение
	|			ТОГДА ЗаказПокупателя.Кратность
	|		ИНАЧЕ КурсыВалютСрезПоследних.Кратность
	|	КОНЕЦ КАК Кратность,
	|	ЗаказПокупателя.Вес КАК Вес,
	|	ЗаказПокупателя.Объем КАК Объем,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПустаяСсылка)
	|				ИЛИ ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		ИНАЧЕ ЗаказПокупателя.НоменклатураДоставки
	|	КОНЕЦ КАК НоменклатураДоставки,
	|	ЗаказПокупателя.СтоимостьДоставки КАК СтоимостьДоставки,
	|	ЗаказПокупателя.СтавкаНДСДоставки КАК СтавкаНДСДоставки,
	|	ЗаказПокупателя.СуммаНДСДоставки КАК СуммаНДСДоставки
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютСрезПоследних
	|		ПО ЗаказПокупателя.Договор.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта},
	|	Константа.НациональнаяВалюта КАК НациональнаяВалюта,
	|	Константа.ФункциональнаяОпцияРезервированиеЗапасов КАК РезервированиеЗапасов
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&МассивЗаказов)";
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("ДатаДокумента", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗначенияПроверяемыхРеквизитов = Новый Структура(
			"СостояниеЗаказа, Проведен, ОжидаетсяВыборВариантаКП",
			Выборка.СостояниеЗаказа, Выборка.ОснованиеПроведен, Выборка.ОжидаетсяВыборВариантаКП
		);
		Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(Выборка.ОснованиеСсылка, ЗначенияПроверяемыхРеквизитов);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ОсновнойСклад");
		Если НЕ ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
		КонецЕсли;
	КонецЕсли;
	
	// Заполнение табличной части.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.Характеристика КАК Характеристика,
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыОстатки.Характеристика КАК Характеристика,
	|		ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(
	|				,
	|				ЗаказПокупателя В (&МассивЗаказов)
	|					И (Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|						ИЛИ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))) КАК ЗаказыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗаказыПокупателей.ЗаказПокупателя,
	|		ДвиженияДокументаЗаказыПокупателей.Номенклатура,
	|		ДвиженияДокументаЗаказыПокупателей.Характеристика,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗаказыПокупателей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗаказыПокупателей.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗаказыПокупателей.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей КАК ДвиженияДокументаЗаказыПокупателей
	|	ГДЕ
	|		ДвиженияДокументаЗаказыПокупателей.Регистратор = &Ссылка) КАК ЗаказыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыОстатки.ЗаказПокупателя,
	|	ЗаказыОстатки.Номенклатура,
	|	ЗаказыОстатки.Характеристика
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяЗапасы.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТипНоменклатурыЗапас,
	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ВЫБОР
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET = 0
	|						ТОГДА ЗаказПокупателяЗапасы.Количество
	|					ИНАЧЕ ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET
	|				КОНЕЦ
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказПокупателяЗапасы.КоличествоСобр = 0
	|							ИЛИ ЗаказПокупателяЗапасы.КоличествоСобр = ЗаказПокупателяЗапасы.Количество
	|						ТОГДА ЗаказПокупателяЗапасы.Количество
	|					ИНАЧЕ ЗаказПокупателяЗапасы.КоличествоСобр
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказПокупателяЗапасы.Количество
	|	КОНЕЦ КАК Количество,
	|	ЗаказПокупателяЗапасы.Партия КАК Партия,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказПокупателяЗапасы.Цена КАК Цена,
	|	ЗаказПокупателяЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ВЫБОР
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение
	|			ТОГДА ЗаказПокупателяЗапасы.Сумма
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказПокупателяЗапасы.КоличествоСобр = 0
	|						ТОГДА ЗаказПокупателяЗапасы.Сумма
	|					ИНАЧЕ ЗаказПокупателяЗапасы.КоличествоСобр * ЗаказПокупателяЗапасы.Цена
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказПокупателяЗапасы.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ЗаказПокупателяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение
	|				И ЗаказПокупателяЗапасы.СуммаНДС > 0
	|				И ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET > 0
	|			ТОГДА ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET * ЗаказПокупателяЗапасы.Цена КАК ЧИСЛО(15, 2)) / 1.18 * 0.18 
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение
	|				И ЗаказПокупателяЗапасы.СуммаНДС > 0
	|				И ЗаказПокупателяЗапасы.КоличествоСобр > 0
	|			ТОГДА ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.КоличествоСобр * ЗаказПокупателяЗапасы.Цена / 1.18 * 0.18 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ЗаказПокупателяЗапасы.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET = 0
	|						ТОГДА ЗаказПокупателяЗапасы.Всего
	|					ИНАЧЕ ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET * ЗаказПокупателяЗапасы.Цена
	|				КОНЕЦ
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказПокупателяЗапасы.КоличествоСобр = 0
	|						ТОГДА ЗаказПокупателяЗапасы.Всего
	|					ИНАЧЕ ЗаказПокупателяЗапасы.КоличествоСобр * ЗаказПокупателяЗапасы.Цена
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказПокупателяЗапасы.Всего
	|	КОНЕЦ КАК Всего,
	|	ЗаказПокупателяЗапасы.Ссылка КАК Заказ,
	|	ЗаказПокупателяЗапасы.Содержание КАК Содержание,
	|	ЗаказПокупателяЗапасы.ПроцентАвтоматическойСкидки,
	|	ЗаказПокупателяЗапасы.СуммаАвтоматическойСкидки,
	|	ЗаказПокупателяЗапасы.КлючСвязи,
	|	ЗаказПокупателяЗапасы.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки1,
	|	ЗаказПокупателяЗапасы.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки1,
	|	ЗаказПокупателяЗапасы.Вес КАК Вес,
	|	ЗаказПокупателяЗапасы.Объем КАК Объем,
	|	ЗаказПокупателяЗапасы.НаименованиеДляРС КАК НаименованиеДляРС,
	|	ЗаказПокупателяЗапасы.ЭтоПодарок КАК ЭтоПодарок,
	|	ЗаказПокупателяЗапасы.СтруктурнаяЕдиницаЗапасы,
	|	ЗаказПокупателяЗапасы.КоличествоСобр
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,ВЫБОР
	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение ТОГДА 
	|			ЗаказПокупателяЗапасы.Усушка_СписаниеНаПотери
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Усушка_СписаниеНаПотери
	|	,ВЫБОР
	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение ТОГДА 
	|			ЗаказПокупателяЗапасы.Усушка_КоличествоСобрПотери
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Усушка_КоличествоСобрПотери
	|	,ЗаказПокупателяЗапасы.Количество КАК КоличествоСтарое
	|	,ВЫБОР
	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение ТОГДА
	|			ЕСТЬNULL(ЗаказПокупателяЗапасы.Усушка_КоличествоСобрNET,0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоСобрNET
	|	,ЗаказПокупателяЗапасы.Усушка_Потери КАК Усушка_Потери
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|ИЗ
	|	ВТЗаказПокупателяЗапасы КАК ЗаказПокупателяЗапасы,
	|	Константа.ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной КАК ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,Константа.German_Butcher КАК German_Butcher
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|ГДЕ
	|	(ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ИЛИ ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СкидкиНаценки.Ссылка КАК Заказ,
	|	СкидкиНаценки.КлючСвязи КАК КлючСвязи,
	|	СкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
	|	СкидкиНаценки.Сумма КАК Сумма
	|ИЗ
	|	Документ.ЗаказПокупателя.СкидкиНаценки КАК СкидкиНаценки
	|ГДЕ
	|	СкидкиНаценки.Ссылка В(&МассивЗаказов)
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 3
	|ВЫБРАТЬ
	|	Усушкa_СобранныеPаказыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	Усушкa_СобранныеPаказыОстатки.Номенклатура КАК Номенклатура,
	|	Усушкa_СобранныеPаказыОстатки.Характеристика КАК Характеристика,
	|	СУММА(Усушкa_СобранныеPаказыОстатки.КоличествоСобрОстаток) КАК КоличествоСобрОстаток,
	|	СУММА(Усушкa_СобранныеPаказыОстатки.КоличествоСобрNETОстаток) КАК КоличествоСобрNETОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		Усушкa_СобранныеPаказыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|		Усушкa_СобранныеPаказыОстатки.Номенклатура КАК Номенклатура,
	|		Усушкa_СобранныеPаказыОстатки.Характеристика КАК Характеристика,
	|		Усушкa_СобранныеPаказыОстатки.КоличествоСобрОстаток КАК КоличествоСобрОстаток,
	|		Усушкa_СобранныеPаказыОстатки.КоличествоСобрNETОстаток КАК КоличествоСобрNETОстаток
	|	ИЗ
	|		РегистрНакопления.Усушкa_СобранныеPаказы.Остатки
	|		(
	|				,
	|				ЗаказПокупателя В (&МассивЗаказов)
	|					И 
	|					(
	|						Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|						ИЛИ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|					)
	|		) КАК Усушкa_СобранныеPаказыОстатки
	|	) КАК Усушкa_СобранныеPаказыОстатки
	|СГРУППИРОВАТЬ ПО
	|	Усушкa_СобранныеPаказыОстатки.ЗаказПокупателя,
	|	Усушкa_СобранныеPаказыОстатки.Номенклатура,
	|	Усушкa_СобранныеPаказыОстатки.Характеристика
	|ИМЕЮЩИЕ СУММА(Усушкa_СобранныеPаказыОстатки.КоличествоСобрNETОстаток) > 0 
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|";
	
	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(МассивЗаказов, Запрос.МенеджерВременныхТаблиц, Ложь);
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
	ТаблицаОстатков.Индексы.Добавить("ЗаказПокупателя,Номенклатура,Характеристика");
	
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	ТаблицаОстатковСобр = МассивРезультатов[3].Выгрузить();
	ТаблицаОстатковСобр.Индексы.Добавить("ЗаказПокупателя,Номенклатура,Характеристика");
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	
	// АвтоматическиеСкидки.
	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки");
	Если ИспользоватьАвтоматическиеСкидки Тогда
		СкидкиНаценкиЗаказа = МассивРезультатов[2].Выгрузить();
		СкидкиНаценки.Очистить();
	КонецЕсли;
	// Конец АвтоматическиеСкидки.
	
	Запасы.Очистить();
	СерийныеНомера.Очистить();
	//Если ТаблицаОстатков.Количество() > 0 Тогда
	//	
	//	Выборка = МассивРезультатов[1].Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		
	//		СтруктураДляПоиска = Новый Структура;
	//		СтруктураДляПоиска.Вставить("ЗаказПокупателя", Выборка.Заказ);
	//		СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
	//		СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
	//		
	//		МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
	//		Если МассивСтрокОстатков.Количество() = 0 Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		НоваяСтрока = Запасы.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	//		
	//		КоличествоКСписанию = Окр(Выборка.Количество * Выборка.Коэффициент, 3);
	//		МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоКСписанию;
	//		Если МассивСтрокОстатков[0].КоличествоОстаток < 0 Тогда
	//			
	//			КоличествоКСписанию = Окр((КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент, 3);
	//			
	//			СтруктураДанных = УправлениеНебольшойФирмойСервер.ПолучитьСуммуСтрокиТабличнойЧасти(
	//				Новый Структура("Количество, Цена, Сумма, ПроцентСкидкиНаценки, СтавкаНДС, СуммаНДС, СуммаВключаетНДС, Всего",
	//					КоличествоКСписанию, Выборка.Цена, 0, Выборка.ПроцентСкидкиНаценки, Выборка.СтавкаНДС, 0, СуммаВключаетНДС, 0));
	//			
	//			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных);
	//			
	//		КонецЕсли;
	//		
	//		// АвтоматическиеСкидки
	//		Если ИспользоватьАвтоматическиеСкидки Тогда
	//			КоличествоВДокументе = Выборка.Количество * Выборка.Коэффициент;
	//			ПересчитатьСуммы = КоличествоВДокументе <> КоличествоКСписанию;
	//			КоэффициентПересчетаСкидки = ?(ПересчитатьСуммы, КоличествоКСписанию / КоличествоВДокументе, 1);
	//			Если КоэффициентПересчетаСкидки <> 1 Тогда
	//				НоваяСтрока.СуммаАвтоматическойСкидки = ОКР(Выборка.СуммаАвтоматическойСкидки * КоэффициентПересчетаСкидки,2);
	//			КонецЕсли;
	//			
	//			// Формирование табличной части скидок
	//			СуммаКРаспределению = НоваяСтрока.СуммаАвтоматическойСкидки;
	//			
	//			ЕстьСтрокаСкидки = Ложь;
	//			Если Выборка.КлючСвязи <> 0 Тогда
	//				Для Каждого СтрокаСкидкиЗаказа ИЗ СкидкиНаценкиЗаказа.НайтиСтроки(Новый Структура("Заказ,КлючСвязи", Выборка.Заказ, Выборка.КлючСвязи)) Цикл
	//					
	//					СтрокаСкидки = СкидкиНаценки.Добавить();
	//					ЗаполнитьЗначенияСвойств(СтрокаСкидки, СтрокаСкидкиЗаказа);
	//					СтрокаСкидки.Сумма = КоэффициентПересчетаСкидки * СтрокаСкидки.Сумма;
	//					СуммаКРаспределению = СуммаКРаспределению - СтрокаСкидки.Сумма;
	//					ЕстьСтрокаСкидки = Истина;
	//					
	//				КонецЦикла;
	//			КонецЕсли;
	//			
	//			Если ЕстьСтрокаСкидки И СуммаКРаспределению <> 0 Тогда
	//				СтрокаСкидки.Сумма = СтрокаСкидки.Сумма + СуммаКРаспределению;
	//			КонецЕсли;
	//		КонецЕсли;
	//		// Конец АвтоматическиеСкидки
	//		
	//		Если МассивСтрокОстатков[0].КоличествоОстаток <= 0 Тогда
	//			ТаблицаОстатков.Удалить(МассивСтрокОстатков[0]);
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	Выборка = МассивРезультатов[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоСобрNET > 0 Тогда
			
			СтруктураДляПоиска = Новый Структура;
			СтруктураДляПоиска.Вставить("ЗаказПокупателя", Выборка.Заказ);
			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
			
			МассивСтрокОстатков = ТаблицаОстатковСобр.НайтиСтроки(СтруктураДляПоиска);
			Если МассивСтрокОстатков.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Количество = Выборка.КоличествоСобрNET;
			
			//КоличествоКСписанию = Окр(Выборка.КоличествоСобрNETОстаток * Выборка.Коэффициент, 3);
			КоличествоКСписанию = Выборка.КоличествоСобрNET;
			МассивСтрокОстатков[0].КоличествоСобрNETОстаток = МассивСтрокОстатков[0].КоличествоСобрNETОстаток - КоличествоКСписанию;
			Если МассивСтрокОстатков[0].КоличествоСобрNETОстаток < 0 Тогда
				
				//КоличествоКСписанию = Окр((КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент, 3);
				КоличествоКСписанию = КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоСобрNETОстаток;
				
				СтруктураДанных = УправлениеНебольшойФирмойСервер.ПолучитьСуммуСтрокиТабличнойЧасти(
					Новый Структура("Количество, Цена, Сумма, ПроцентСкидкиНаценки, СтавкаНДС, СуммаНДС, СуммаВключаетНДС, Всего",
						КоличествоКСписанию, Выборка.Цена, 0, Выборка.ПроцентСкидкиНаценки, Выборка.СтавкаНДС, 0, СуммаВключаетНДС, 0));
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных);
				
			КонецЕсли;
			
			НоваяСтрока.Усушка_КоличествоСобрПотери = НоваяСтрока.Усушка_КоличествоСобрПотери * КоличествоКСписанию / Выборка.Количество;
			
			НоваяСтрока.Усушкa_КоличествоСтарое = Выборка.КоличествоСтарое *  КоличествоКСписанию / Выборка.Количество;
			
			Если МассивСтрокОстатков[0].КоличествоСобрNETОстаток <= 0 Тогда
				ТаблицаОстатковСобр.Удалить(МассивСтрокОстатков[0]);
			КонецЕсли;
		
		Иначе
			
			СтруктураДляПоиска = Новый Структура;
			СтруктураДляПоиска.Вставить("ЗаказПокупателя", Выборка.Заказ);
			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
			
			МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
			Если МассивСтрокОстатков.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);				
			
			КоличествоКСписанию = Окр(Выборка.Количество * Выборка.Коэффициент, 3);
			МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоКСписанию;
			Если МассивСтрокОстатков[0].КоличествоОстаток < 0 Тогда
				
				КоличествоКСписанию = Окр((КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент, 3);
				
				СтруктураДанных = УправлениеНебольшойФирмойСервер.ПолучитьСуммуСтрокиТабличнойЧасти(
					Новый Структура("Количество, Цена, Сумма, ПроцентСкидкиНаценки, СтавкаНДС, СуммаНДС, СуммаВключаетНДС, Всего",
						КоличествоКСписанию, Выборка.Цена, 0, Выборка.ПроцентСкидкиНаценки, Выборка.СтавкаНДС, 0, СуммаВключаетНДС, 0));
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных);
				
			КонецЕсли;
			
			НоваяСтрока.Усушкa_КоличествоСтарое = НоваяСтрока.Количество;
			
			Если МассивСтрокОстатков[0].КоличествоОстаток <= 0 Тогда
				ТаблицаОстатков.Удалить(МассивСтрокОстатков[0]);
			КонецЕсли;
		
		КонецЕсли;
		
		// АвтоматическиеСкидки
		Если ИспользоватьАвтоматическиеСкидки Тогда
			КоличествоВДокументе = Выборка.Количество * Выборка.Коэффициент;
			ПересчитатьСуммы = КоличествоВДокументе <> КоличествоКСписанию;
			КоэффициентПересчетаСкидки = ?(ПересчитатьСуммы, КоличествоКСписанию / КоличествоВДокументе, 1);
			Если КоэффициентПересчетаСкидки <> 1 Тогда
				НоваяСтрока.СуммаАвтоматическойСкидки = ОКР(Выборка.СуммаАвтоматическойСкидки * КоэффициентПересчетаСкидки,2);
			КонецЕсли;
			
			// Формирование табличной части скидок
			СуммаКРаспределению = НоваяСтрока.СуммаАвтоматическойСкидки;
			
			ЕстьСтрокаСкидки = Ложь;
			Если Выборка.КлючСвязи <> 0 Тогда
				Для Каждого СтрокаСкидкиЗаказа ИЗ СкидкиНаценкиЗаказа.НайтиСтроки(Новый Структура("Заказ,КлючСвязи", Выборка.Заказ, Выборка.КлючСвязи)) Цикл
					
					СтрокаСкидки = СкидкиНаценки.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСкидки, СтрокаСкидкиЗаказа);
					СтрокаСкидки.Сумма = КоэффициентПересчетаСкидки * СтрокаСкидки.Сумма;
					СуммаКРаспределению = СуммаКРаспределению - СтрокаСкидки.Сумма;
					ЕстьСтрокаСкидки = Истина;
					
				КонецЦикла;
			КонецЕсли;
			
			Если ЕстьСтрокаСкидки И СуммаКРаспределению <> 0 Тогда
				СтрокаСкидки.Сумма = СтрокаСкидки.Сумма + СуммаКРаспределению;
			КонецЕсли;
		КонецЕсли;
		// Конец АвтоматическиеСкидки
		
	КонецЦикла;
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	
	// Заполнение резервов.
	Если Запасы.Количество() > 0
		И Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить()
		И ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		ЗаполнитьКолонкуРезервПоРезервам();
	КонецЕсли;
	
	// АвтоматическиеСкидки.
	Если ИспользоватьАвтоматическиеСкидки Тогда
		РезультатРасчетаСкидокНаценок = СкидкиНаценки.Выгрузить();
		СкидкиНаценкиСервер.ПрименитьРезультатРасчетаСкидокКОбъекту(ЭтотОбъект, "Запасы", РезультатРасчетаСкидокНаценок);
	КонецЕсли;
	
	Если Константы.ФункционалСбораТоваров.Получить() Тогда
		Для Каждого Док Из МассивЗаказов Цикл 
			ДокОб = Док.ПолучитьОбъект();
			Если ДокОб.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Собран Или ДокОб.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.ВыгруженНаБорт Тогда
				ДокОб.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Доставлен;
				ДокОб.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
				
		
	
КонецПроцедуры // ЗаполнитьПоЗаказПокупателя()

// Обработчик заполнения документа на основании Заказа поставщику.
//
// Параметры:
//  ЗаказПоставщику - ДокументСсылка.ЗаказПоставщику.
//
Процедура ЗаполнитьПоЗаказуПоставщику(ЗаказПоставщику) Экспорт
	
	Если УправлениеНебольшойФирмойПовтИсп.РеквизитВШапке("ПоложениеЗаказаПокупателяВДокументахОтгрузки") Тогда
		Заказ = ЗаказПоставщику.Ссылка;
	Иначе
		Заказ = Неопределено;
	КонецЕсли;
	
	// Заполнение шапки.
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаказПоставщику,
	"Организация, ВидОперации, СтруктурнаяЕдиницаРезерв, Контрагент, Договор, ВалютаДокумента, НалогообложениеНДС, СуммаВключаетНДС, НДСВключатьВСтоимость, Курс, Кратность, СостояниеЗаказа, Проведен");
	
	Документы.ЗаказПоставщику.ПроверитьВозможностьВводаНаОснованииЗаказаПоставщику(ЗаказПоставщику, ЗначенияРеквизитов);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитов, "Организация, Контрагент, Договор, ВалютаДокумента, НалогообложениеНДС, СуммаВключаетНДС, НДСВключатьВСтоимость, Курс, Кратность");
	ЭтотОбъект.ДокументОснование = ЗаказПоставщику;
	
	Если НЕ ВалютаДокумента = Константы.НациональнаяВалюта.Получить() Тогда
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()), Новый Структура("Валюта", Договор.ВалютаРасчетов));
		Курс = СтруктураПоВалюте.Курс;
		Кратность = СтруктураПоВалюте.Кратность;
	КонецЕсли;
	
	// Заполнение табличной части.
	Запасы.Очистить();
	СерийныеНомера.Очистить();
	Если ЗаказПоставщику.ВидОперации = Перечисления.ВидыОперацийЗаказПоставщику.ЗаказНаПереработку Тогда
		ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку;
		СтруктурнаяЕдиница = ЗначенияРеквизитов.СтруктурнаяЕдиницаРезерв;
		НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Организация,, ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
		ЗаполнитьПоЗаказПоставщикуНаПереработку(ЗаказПоставщику);
	Иначе
		ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику;
		ЗаполнитьПоЗаказПоставщикуНаЗакупку(ЗаказПоставщику);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоЗаказПоставщику()

// Процедура заполнения документа на основании заказа поставщику.
//
// Параметры:
//  ДанныеЗаполнения - Структура - Данные заполнения документа
//
Процедура ЗаполнитьПоЗаказПоставщикуНаПереработку(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ЗаказыОстатки.НомерСтроки) КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ЗаказыОстатки.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТипНоменклатурыЗапас,
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ЗаказыОстатки.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|			ТОГДА ЗаказыОстатки.Заказ.Организация.СтавкаНДСПоУмолчанию
	|		ИНАЧЕ ЗаказыОстатки.Номенклатура.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС,
	|	ЗаказыОстатки.Характеристика КАК Характеристика,
	|	ЗаказыОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказыОстатки.Заказ КАК Заказ,
	|	СУММА(ЗаказыОстатки.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказПоставщикуМатериалы.НомерСтроки КАК НомерСтроки,
	|		ЗаказПоставщикуМатериалы.Номенклатура КАК Номенклатура,
	|		ЗаказПоставщикуМатериалы.Характеристика КАК Характеристика,
	|		ЗаказПоставщикуМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ЗаказПоставщикуМатериалы.Ссылка КАК Заказ,
	|		ЗаказПоставщикуМатериалы.Количество КАК Количество
	|	ИЗ
	|		Документ.ЗаказПоставщику.Материалы КАК ЗаказПоставщикуМатериалы
	|	ГДЕ
	|		ЗаказПоставщикуМатериалы.Ссылка = &ДокументОснование
	|		И ЗаказПоставщикуМатериалы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПриходнаяНакладнаяЗапасы.НомерСтроки,
	|		ПриходнаяНакладнаяЗапасы.Номенклатура,
	|		ПриходнаяНакладнаяЗапасы.Характеристика,
	|		ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения,
	|		ПриходнаяНакладнаяЗапасы.Заказ,
	|		ПриходнаяНакладнаяЗапасы.Количество
	|	ИЗ
	|		Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|	ГДЕ
	|		ПриходнаяНакладнаяЗапасы.Ссылка.Проведен
	|		И ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика)
	|		И ПриходнаяНакладнаяЗапасы.Заказ = &ДокументОснование
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасходнаяНакладнаяЗапасы.НомерСтроки,
	|		РасходнаяНакладнаяЗапасы.Номенклатура,
	|		РасходнаяНакладнаяЗапасы.Характеристика,
	|		РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения,
	|		РасходнаяНакладнаяЗапасы.Заказ,
	|		-РасходнаяНакладнаяЗапасы.Количество
	|	ИЗ
	|		Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|	ГДЕ
	|		РасходнаяНакладнаяЗапасы.Ссылка.Проведен
	|		И РасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|		И РасходнаяНакладнаяЗапасы.Заказ = &ДокументОснование
	|		И НЕ РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка) КАК ЗаказыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ЗаказыОстатки.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЗаказыОстатки.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЗаказыОстатки.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|			ТОГДА ЗаказыОстатки.Заказ.Организация.СтавкаНДСПоУмолчанию
	|		ИНАЧЕ ЗаказыОстатки.Номенклатура.СтавкаНДС
	|	КОНЕЦ,
	|	ЗаказыОстатки.Характеристика,
	|	ЗаказыОстатки.ЕдиницаИзмерения,
	|	ЗаказыОстатки.Заказ,
	|	ЗаказыОстатки.Номенклатура.СтранаПроисхождения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗаказыОстатки.Количество) > 0";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			Если НЕ НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
				
				Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
					НоваяСтрока.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
				Иначе
					НоваяСтрока.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
		
	// Заполнение резервов.
	Если Запасы.Количество() > 0
		И Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить()
		И ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		ЗаполнитьКолонкуРезервПоРезервам();
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоЗаказПоставщикуНаПереработку()

// Процедура заполнения документа на основании заказа поставщику.
//
// Параметры:
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоЗаказПоставщикуНаЗакупку(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.Характеристика КАК Характеристика,
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыОстатки.Характеристика КАК Характеристика,
	|		ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|				,
	|				ЗаказПоставщику = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗаказыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗаказыПоставщикам.Номенклатура,
	|		ДвиженияДокументаЗаказыПоставщикам.Характеристика,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗаказыПоставщикам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗаказыПоставщикам.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗаказыПоставщикам.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам КАК ДвиженияДокументаЗаказыПоставщикам
	|	ГДЕ
	|		ДвиженияДокументаЗаказыПоставщикам.Регистратор = &Ссылка
	|		И ДвиженияДокументаЗаказыПоставщикам.ЗаказПоставщику = &ДокументОснование) КАК ЗаказыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыОстатки.Номенклатура,
	|	ЗаказыОстатки.Характеристика
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗаказПоставщикуЗапасы.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуЗапасы.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТипНоменклатурыЗапас,
	|	ЗаказПоставщикуЗапасы.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПоставщикуЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПоставщикуЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ЗаказПоставщикуЗапасы.Количество КАК Количество,
	|	ЗаказПоставщикуЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказПоставщикуЗапасы.Цена КАК Цена,
	|	ЗаказПоставщикуЗапасы.Сумма КАК Сумма,
	|	ЗаказПоставщикуЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказПоставщикуЗапасы.СуммаНДС КАК СуммаНДС,
	|	ЗаказПоставщикуЗапасы.Всего КАК Всего,
	|	ЗаказПоставщикуЗапасы.Содержание КАК Содержание,
	|	ЗаказПоставщикуЗапасы.Ссылка КАК Заказ
	|ИЗ
	|	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
	|ГДЕ
	|	ЗаказПоставщикуЗапасы.Ссылка = &ДокументОснование
	|	И ЗаказПоставщикуЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
	ТаблицаОстатков.Индексы.Добавить("Номенклатура,Характеристика");
	
	Выборка = МассивРезультатов[1].Выбрать();
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДляПоиска = Новый Структура;
		СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
		
		МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
		Если МассивСтрокОстатков.Количество() = 0 Тогда
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) = Выборка.Количество Тогда
			
			Продолжить;
			
		ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) > Выборка.Количество Тогда
			
			МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - Выборка.Количество * Выборка.Коэффициент;
			Продолжить;
			
		ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) < Выборка.Количество Тогда
			
			КоличествоКСписанию = -1 * (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент - Выборка.Количество);
			МассивСтрокОстатков[0].КоличествоОстаток = 0;
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			СтруктураДанных = УправлениеНебольшойФирмойСервер.ПолучитьСуммуСтрокиТабличнойЧасти(
				Новый Структура("Количество, Цена, Сумма, СтавкаНДС, СуммаНДС, СуммаВключаетНДС, Всего",
					КоличествоКСписанию, Выборка.Цена, 0, Выборка.СтавкаНДС, 0, СуммаВключаетНДС, 0));
					
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоЗаказПоставщикуНаЗакупку()

// Процедура заполнения документа на основании приходной накладной.
//
// Параметры:
//	ДокументОснование - ДокументСсылка.ПриходнаяНакладная - приходная накладная
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоСчетуНаОплату(ДанныеЗаполнения) Экспорт
	
	// Заполнение шапки документа.
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
	
	ВидОперации			= Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
	Организация			= ДанныеЗаполнения.Организация;
	
	БанковскийСчет		= ДанныеЗаполнения.БанковскийСчет;
	Если НЕ ЗначениеЗаполнено(БанковскийСчет) 
		И ЗначениеЗаполнено(Организация) Тогда
		
		БанковскийСчет = Организация.БанковскийСчетПоУмолчанию;
		
	КонецЕсли;
	
	Контрагент			= ДанныеЗаполнения.Контрагент;
	Договор				= ДанныеЗаполнения.Договор;
	ВидЦен				= ДанныеЗаполнения.ВидЦен;
	ВидСкидкиНаценки	= ДанныеЗаполнения.ВидСкидкиНаценки;
	ВалютаДокумента		= ДанныеЗаполнения.ВалютаДокумента;
	СуммаВключаетНДС	= ДанныеЗаполнения.СуммаВключаетНДС;
	НалогообложениеНДС	= ДанныеЗаполнения.НалогообложениеНДС;
	// ДисконтныеКарты
	ДисконтнаяКарта = ДанныеЗаполнения.ДисконтнаяКарта;
	ПроцентСкидкиПоДисконтнойКарте = ДанныеЗаполнения.ПроцентСкидкиПоДисконтнойКарте;
	// Конец ДисконтныеКарты
		
	Если ВалютаДокумента = Константы.НациональнаяВалюта.Получить() Тогда
		Курс		= ДанныеЗаполнения.Курс;
		Кратность	= ДанныеЗаполнения.Кратность;
	Иначе
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Договор.ВалютаРасчетов));
		Курс		= СтруктураПоВалюте.Курс;
		Кратность	= СтруктураПоВалюте.Кратность;
	КонецЕсли;
	
	НоменклатураДоставки = ДанныеЗаполнения.НоменклатураДоставки;
	СтоимостьДоставки = ДанныеЗаполнения.СтоимостьДоставки;
	СтавкаНДСДоставки = ДанныеЗаполнения.СтавкаНДСДоставки;
	СуммаНДСДоставки = ДанныеЗаполнения.СуммаНДСДоставки;
	Вес = ДанныеЗаполнения.Вес;
	Объем = ДанныеЗаполнения.Объем;
	ЗаказВТабличнойЧасти = НЕ УправлениеНебольшойФирмойПовтИсп.РеквизитВШапке("ПоложениеЗаказаПокупателяВДокументахОтгрузки");	
	Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаказПокупателяДляЗаполнения = ДанныеЗаполнения.ДокументОснование;
	Иначе
		ЗаказПокупателяДляЗаполнения = Документы.ЗаказПокупателя.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗаказВТабличнойЧасти Тогда
		Заказ = ЗаказПокупателяДляЗаполнения;
	КонецЕсли;
	 
	// Заполнение табличной части документа.
	Запасы.Очистить();
	СерийныеНомера.Очистить();
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Запасы Цикл
		
		Если СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас
			ИЛИ СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
			НоваяСтрока.ТипНоменклатурыЗапас = (НоваяСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
			
			Если ЗаказВТабличнойЧасти Тогда
				
				НоваяСтрока.Заказ = ЗаказПокупателяДляЗаполнения;
				
			КонецЕсли;
			
			Если СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
				
				НоваяСтрока.СтранаПроисхождения = СтрокаТабличнойЧасти.Номенклатура.СтранаПроисхождения;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// АвтоматическиеСкидки
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки") Тогда
		СкидкиРассчитаны = Истина;
		СкидкиНаценки.Очистить();
		Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.СкидкиНаценки Цикл
			Если Запасы.Найти(СтрокаТабличнойЧасти.КлючСвязи, "КлючСвязи") <> Неопределено Тогда
				НоваяСтрокаСкидкиНаценки = СкидкиНаценки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаСкидкиНаценки, СтрокаТабличнойЧасти);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// Конец АвтоматическиеСкидки
	
КонецПроцедуры // ЗаполнитьПоСчетНаОплату()

// Обработчик заполнения на основании ПеремещениеЗапасов.
//
// Параметры:
//  ДанныеЗаполнения - Структура, ДокументСсылка.ПеремещениеЗапасов - Основание для заполнения документа.
//
Процедура ЗаполнитьПоПеремещениюЗапасов(ДанныеЗаполнения) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		ДокументСсылкаПеремещениеЗапасов = ДанныеЗаполнения;
	Иначе
		возврат;
	КонецЕсли;
	
	//Если перемещение введено на основании заказа покупателя, заполняем расходную накладную на основании этого заказа, но со складом-получателем перемещения
	ТабЗаказов = ДокументСсылкаПеремещениеЗапасов.Запасы.Выгрузить(,"ЗаказПокупателя");
	ТабЗаказов.Свернуть("ЗаказПокупателя");
	Если ТабЗаказов.Количество() = 1 И ЗначениеЗаполнено(ТабЗаказов[0].ЗаказПокупателя) Тогда
		ОдинЗаказПокупателяВСтроках = Истина;
	Иначе
		ОдинЗаказПокупателяВСтроках = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылкаПеремещениеЗапасов.ЗаказПокупателя) ИЛИ (НЕ ОдинЗаказПокупателяВСтроках) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиница,
		|	ТаблицаДокумента.ЯчейкаПолучатель КАК Ячейка,
		|	ТаблицаДокумента.Запасы.(
		|		НомерСтроки,
		|		Номенклатура,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.Запасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ КАК ТипНоменклатурыЗапас,
		|		Характеристика,
		|		Партия,
		|		ЕдиницаИзмерения,
		|		Количество,
		|		Резерв,
		|		ЗаказПокупателя,
		|		СерийныеНомера,
		|		КлючСвязи
		|	)
		|ИЗ
		|	Документ.ПеремещениеЗапасов КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
		Запасы.Загрузить(Выборка.Запасы.Выгрузить());
		
		РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ЭтотОбъект, ДокументСсылкаПеремещениеЗапасов);
		
	Иначе
		
		ЭтотОбъект.Заказ = ДокументСсылкаПеремещениеЗапасов.ЗаказПокупателя;
		
		// Заполнение шапки.
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Заказ,
		|	ЗаказПокупателя.Ссылка КАК ОснованиеСсылка,
		|	&ДокументСсылкаПеремещениеЗапасов КАК ДокументОснование,
		|	ЗаказПокупателя.Проведен КАК ОснованиеПроведен,
		|	ЗаказПокупателя.СостояниеЗаказа КАК СостояниеЗаказа,
		|	ЗаказПокупателя.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателя.БанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА ЗаказПокупателя.Организация.БанковскийСчетПоУмолчанию
		|		ИНАЧЕ ЗаказПокупателя.БанковскийСчет
		|	КОНЕЦ КАК БанковскийСчет,
		|	ВЫБОР
		|		КОГДА РезервированиеЗапасов.Значение
		|			ТОГДА ЗаказПокупателя.СтруктурнаяЕдиницаРезерв
		|	КОНЕЦ КАК СтруктурнаяЕдиницаОтправитель,
		|   &СкладПолучатель КАК СтруктурнаяЕдиница,
		|	ЗаказПокупателя.Контрагент КАК Контрагент,
		|	ЗаказПокупателя.Договор КАК Договор,
		|	ЗаказПокупателя.ВидЦен КАК ВидЦен,
		|	ЗаказПокупателя.ВидСкидкиНаценки КАК ВидСкидкиНаценки,
		|	ЗаказПокупателя.ДисконтнаяКарта КАК ДисконтнаяКарта,
		|	ЗаказПокупателя.ПроцентСкидкиПоДисконтнойКарте КАК ПроцентСкидкиПоДисконтнойКарте,
		|	ЗаказПокупателя.ВалютаДокумента КАК ВалютаДокумента,
		|	ЗаказПокупателя.НалогообложениеНДС КАК НалогообложениеНДС,
		|	ЗаказПокупателя.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ЗаказПокупателя.НДСВключатьВСтоимость КАК НДСВключатьВСтоимость,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателя.ВалютаДокумента = НациональнаяВалюта.Значение
		|			ТОГДА ЗаказПокупателя.Курс
		|		ИНАЧЕ КурсыВалютСрезПоследних.Курс
		|	КОНЕЦ КАК Курс,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателя.ВалютаДокумента = НациональнаяВалюта.Значение
		|			ТОГДА ЗаказПокупателя.Кратность
		|		ИНАЧЕ КурсыВалютСрезПоследних.Кратность
		|	КОНЕЦ КАК Кратность
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютСрезПоследних
		|		ПО ЗаказПокупателя.Договор.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта},
		|	Константа.НациональнаяВалюта КАК НациональнаяВалюта,
		|	Константа.ФункциональнаяОпцияРезервированиеЗапасов КАК РезервированиеЗапасов
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &ЗаказВПеремещенииЗапасов";
		
		Запрос.УстановитьПараметр("ЗаказВПеремещенииЗапасов", ДокументСсылкаПеремещениеЗапасов.ЗаказПокупателя);
		Запрос.УстановитьПараметр("СкладПолучатель", ДокументСсылкаПеремещениеЗапасов.СтруктурнаяЕдиницаПолучатель);
		Запрос.УстановитьПараметр("ДокументСсылкаПеремещениеЗапасов", ДокументСсылкаПеремещениеЗапасов);
		Запрос.УстановитьПараметр("ДатаДокумента", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗначенияПроверяемыхРеквизитов = Новый Структура("СостояниеЗаказа, Проведен", Выборка.СостояниеЗаказа, Выборка.ОснованиеПроведен);
			Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(Выборка.ОснованиеСсылка, ЗначенияПроверяемыхРеквизитов);
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
		Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
			ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ОсновнойСклад");
			Если НЕ ЗначениеЗаполнено(ЗначениеНастройки) Тогда
				СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
			КонецЕсли;
		КонецЕсли;
		
		// Заполнение табличной части.
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказыОстатки.Характеристика КАК Характеристика,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыОстатки.КоличествоОстаток - ПеремещениеКоличество.Количество >= 0
		|				ТОГДА ПеремещениеКоличество.Количество
		|			ИНАЧЕ ЗаказыОстатки.КоличествоОстаток
		|		КОНЕЦ) КАК КоличествоОстаток,
		|	ЗаказыОстатки.КоличествоОстаток КАК ЗаказыОстаток,
		|	ПеремещениеКоличество.Количество КАК ПеремещениеОстаток
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
		|		ПеремещениеЗапасовЗапасы.Характеристика КАК Характеристика,
		|		СУММА(ПеремещениеЗапасовЗапасы.Количество) КАК Количество,
		|		ПеремещениеЗапасовЗапасы.ЗаказПокупателя КАК ЗаказПокупателя
		|	ИЗ
		|		Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
		|	ГДЕ
		|		ПеремещениеЗапасовЗапасы.Ссылка = &Перемещение
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПеремещениеЗапасовЗапасы.Номенклатура,
		|		ПеремещениеЗапасовЗапасы.Характеристика,
		|		ПеремещениеЗапасовЗапасы.ЗаказПокупателя) КАК ПеремещениеКоличество
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗаказыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
		|			ЗаказыОстатки.Номенклатура КАК Номенклатура,
		|			ЗаказыОстатки.Характеристика КАК Характеристика,
		|			ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|		ИЗ
		|			РегистрНакопления.ЗаказыПокупателей.Остатки(
		|					,
		|					ЗаказПокупателя = &ЗаказПокупателя
		|						И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗаказыОстатки
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ДвиженияДокументаЗаказыПокупателей.ЗаказПокупателя,
		|			ДвиженияДокументаЗаказыПокупателей.Номенклатура,
		|			ДвиженияДокументаЗаказыПокупателей.Характеристика,
		|			ВЫБОР
		|				КОГДА ДвиженияДокументаЗаказыПокупателей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|					ТОГДА ЕСТЬNULL(ДвиженияДокументаЗаказыПокупателей.Количество, 0)
		|				ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗаказыПокупателей.Количество, 0)
		|			КОНЕЦ
		|		ИЗ
		|			РегистрНакопления.ЗаказыПокупателей КАК ДвиженияДокументаЗаказыПокупателей
		|		ГДЕ
		|			ДвиженияДокументаЗаказыПокупателей.Регистратор = &Ссылка) КАК ЗаказыОстатки
		|		ПО ПеремещениеКоличество.Номенклатура = ЗаказыОстатки.Номенклатура
		|			И ПеремещениеКоличество.Характеристика = ЗаказыОстатки.Характеристика
		|			И ПеремещениеКоличество.ЗаказПокупателя = ЗаказыОстатки.ЗаказПокупателя
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыОстатки.ЗаказПокупателя,
		|	ЗаказыОстатки.Номенклатура,
		|	ЗаказыОстатки.Характеристика,
		|	ЗаказыОстатки.КоличествоОстаток,
		|	ПеремещениеКоличество.Количество
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяЗапасы.НомерСтроки КАК НомерСтроки,
		|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
		|	ЗаказПокупателяЗапасы.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТипНоменклатурыЗапас,
		|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|			ТОГДА 1
		|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ КАК Коэффициент,
		|	ЗаказПокупателяЗапасы.Количество КАК Количество,
		|	ЗаказПокупателяЗапасы.Партия КАК Партия,
		|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЗаказПокупателяЗапасы.Цена КАК Цена,
		|	ЗаказПокупателяЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
		|	ЗаказПокупателяЗапасы.Сумма КАК Сумма,
		|	ЗаказПокупателяЗапасы.СтавкаНДС КАК СтавкаНДС,
		|	ЗаказПокупателяЗапасы.СуммаНДС КАК СуммаНДС,
		|	ЗаказПокупателяЗапасы.Всего КАК Всего,
		|	ЗаказПокупателяЗапасы.Ссылка КАК Заказ,
		|	ЗаказПокупателяЗапасы.Содержание КАК Содержание,
		|	ЗаказПокупателяЗапасы.ПроцентАвтоматическойСкидки,
		|	ЗаказПокупателяЗапасы.СуммаАвтоматическойСкидки,
		|	ЗаказПокупателяЗапасы.КлючСвязи,
		|	ЗаказПокупателяЗапасы.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки1,
		|	ЗаказПокупателяЗапасы.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки1
		|ИЗ
		|	ВТЗаказПокупателяЗапасы КАК ЗаказПокупателяЗапасы
		|ГДЕ
		|	(ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
		|			ИЛИ ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СкидкиНаценки.Ссылка КАК Заказ,
		|	СкидкиНаценки.КлючСвязи КАК КлючСвязи,
		|	СкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
		|	СкидкиНаценки.Сумма КАК Сумма
		|ИЗ
		|	Документ.ЗаказПокупателя.СкидкиНаценки КАК СкидкиНаценки
		|ГДЕ
		|	СкидкиНаценки.Ссылка = &ЗаказПокупателя";
		
		Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(ДокументСсылкаПеремещениеЗапасов.ЗаказПокупателя, Запрос.МенеджерВременныхТаблиц, Ложь);
		Запрос.УстановитьПараметр("ЗаказПокупателя", ДокументСсылкаПеремещениеЗапасов.ЗаказПокупателя);
		Запрос.УстановитьПараметр("Перемещение", ДокументСсылкаПеремещениеЗапасов);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
		ТаблицаОстатков.Индексы.Добавить("ЗаказПокупателя,Номенклатура,Характеристика");
		
		// АвтоматическиеСкидки.
		ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки");
		Если ИспользоватьАвтоматическиеСкидки Тогда
			СкидкиНаценкиЗаказа = МассивРезультатов[2].Выгрузить();
			СкидкиНаценки.Очистить();
		КонецЕсли;
		// Конец АвтоматическиеСкидки.
		
		Запасы.Очистить();
		СерийныеНомера.Очистить();
		Если ТаблицаОстатков.Количество() > 0 Тогда
			
			Выборка = МассивРезультатов[1].Выбрать();
			Пока Выборка.Следующий() Цикл
				
				СтруктураДляПоиска = Новый Структура;
				СтруктураДляПоиска.Вставить("ЗаказПокупателя", Выборка.Заказ);
				СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
				СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
				
				МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
				Если МассивСтрокОстатков.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
				КоличествоКСписанию = Выборка.Количество * Выборка.Коэффициент;
				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоКСписанию;
				Если МассивСтрокОстатков[0].КоличествоОстаток < 0 Тогда
					
					КоличествоКСписанию = (КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент;
					
					СтруктураДанных = УправлениеНебольшойФирмойСервер.ПолучитьСуммуСтрокиТабличнойЧасти(
					Новый Структура("Количество, Цена, Сумма, ПроцентСкидкиНаценки, СтавкаНДС, СуммаНДС, СуммаВключаетНДС, Всего",
					КоличествоКСписанию, Выборка.Цена, 0, Выборка.ПроцентСкидкиНаценки, Выборка.СтавкаНДС, 0, СуммаВключаетНДС, 0));
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных);
					
				КонецЕсли;
				
				
				// АвтоматическиеСкидки
				Если ИспользоватьАвтоматическиеСкидки Тогда
					КоличествоВДокументе = Выборка.Количество * Выборка.Коэффициент;
					ПересчитатьСуммы = КоличествоВДокументе <> КоличествоКСписанию;
					КоэффициентПересчетаСкидки = ?(ПересчитатьСуммы, КоличествоКСписанию / КоличествоВДокументе, 1);
					Если КоэффициентПересчетаСкидки <> 1 Тогда
						НоваяСтрока.СуммаАвтоматическойСкидки = ОКР(Выборка.СуммаАвтоматическойСкидки * КоэффициентПересчетаСкидки,2);
					КонецЕсли;
					
					// Формирование табличной части скидок
					СуммаКРаспределению = НоваяСтрока.СуммаАвтоматическойСкидки;
					
					ЕстьСтрокаСкидки = Ложь;
					Если Выборка.КлючСвязи <> 0 Тогда
						Для Каждого СтрокаСкидкиЗаказа ИЗ СкидкиНаценкиЗаказа.НайтиСтроки(Новый Структура("Заказ,КлючСвязи", Выборка.Заказ, Выборка.КлючСвязи)) Цикл
							
							СтрокаСкидки = СкидкиНаценки.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаСкидки, СтрокаСкидкиЗаказа);
							СтрокаСкидки.Сумма = КоэффициентПересчетаСкидки * СтрокаСкидки.Сумма;
							СуммаКРаспределению = СуммаКРаспределению - СтрокаСкидки.Сумма;
							ЕстьСтрокаСкидки = Истина;
							
						КонецЦикла;
					КонецЕсли;
					
					Если ЕстьСтрокаСкидки И СуммаКРаспределению <> 0 Тогда
						СтрокаСкидки.Сумма = СтрокаСкидки.Сумма + СуммаКРаспределению;
					КонецЕсли;
				КонецЕсли;
				// Конец АвтоматическиеСкидки
				
				Если МассивСтрокОстатков[0].КоличествоОстаток <= 0 Тогда
					ТаблицаОстатков.Удалить(МассивСтрокОстатков[0]);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		//Заполнение резервов.
		Если Запасы.Количество() > 0
			И Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить()
			И ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
			ЗаполнитьКолонкуРезервПоРезервам();
		КонецЕсли;
		
		// АвтоматическиеСкидки.
		Если ИспользоватьАвтоматическиеСкидки Тогда
			РезультатРасчетаСкидокНаценок = СкидкиНаценки.Выгрузить();
			СкидкиНаценкиСервер.ПрименитьРезультатРасчетаСкидокКОбъекту(ЭтотОбъект, "Запасы", РезультатРасчетаСкидокНаценок);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПоПеремещениюЗапасов()

// Обработчик заполнения на основании ПеремещениеЗапасов.
//
// Параметры:
//  ДанныеЗаполнения - Структура, ДокументСсылка.ПеремещениеЗапасов - Основание для заполнения документа.
//
Процедура ЗаполнитьПоСборкеЗапасов(ДанныеЗаполнения) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СборкаЗапасов") Тогда
		ДокументСсылкаСборкаЗапасов = ДанныеЗаполнения;
	Иначе
		возврат;
	КонецЕсли;
	
	Если УправлениеНебольшойФирмойПовтИсп.РеквизитВШапке("ПоложениеЗаказаПокупателяВДокументахОтгрузки") Тогда
		Заказ = ДанныеЗаполнения.ЗаказПокупателя;
	Иначе
		Заказ = Неопределено;
	КонецЕсли;
	
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
	Организация = ДанныеЗаполнения.Организация;
	ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
	НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Организация,, Дата);
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.СтруктурнаяЕдиницаПродукции) 
		И ДанныеЗаполнения.СтруктурнаяЕдиницаПродукции.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда
		
		СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиницаПродукции;
		Ячейка = ДанныеЗаполнения.ЯчейкаПродукции;
	Иначе
		СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.ЗаказПокупателя) Тогда
		Контрагент = ДанныеЗаполнения.ЗаказПокупателя.Контрагент;
		Договор = ДанныеЗаполнения.ЗаказПокупателя.Договор;
		ВидЦен = ДанныеЗаполнения.ЗаказПокупателя.ВидЦен;
		
		ВалютаДокумента = ДанныеЗаполнения.ЗаказПокупателя.ВалютаДокумента;
		СуммаВключаетНДС = ДанныеЗаполнения.ЗаказПокупателя.СуммаВключаетНДС;
		НДСВключатьВСтоимость = ДанныеЗаполнения.ЗаказПокупателя.НДСВключатьВСтоимость;
		
		Курс = ДанныеЗаполнения.ЗаказПокупателя.Курс;
		Кратность = ДанныеЗаполнения.ЗаказПокупателя.Кратность;
	КонецЕсли; 
	
	ЗаполнятьРезерв = ЗначениеЗаполнено(ДанныеЗаполнения.ЗаказПокупателя) И ПолучитьФункциональнуюОпцию("РезервированиеЗапасов");
	
	// Заполнение табличной части документа.
	Запасы.Очистить();
	СерийныеНомера.Очистить();
	Если ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка Тогда
		ТабЧастьЗаполнения = ДанныеЗаполнения.Продукция;
	Иначе
		ТабЧастьЗаполнения = ДанныеЗаполнения.Запасы;
	КонецЕсли;
	
	Для каждого СтрокаТабличнойЧасти Из ТабЧастьЗаполнения Цикл
		
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		
		НоваяСтрока.ТипНоменклатурыЗапас = (НоваяСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
		
		Если НЕ УправлениеНебольшойФирмойПовтИсп.РеквизитВШапке("ПоложениеЗаказаПокупателяВДокументахОтгрузки") Тогда
			НоваяСтрока.Заказ = ДанныеЗаполнения.ЗаказПокупателя;
		КонецЕсли;
		
		Если ЗаполнятьРезерв Тогда
			НоваяСтрока.Резерв = НоваяСтрока.Количество;
		КонецЕсли;
		
		Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
			
			Для каждого СтрокаТабличнойЧасти Из Запасы Цикл
				
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС) Тогда
					СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
				Иначе
					СтрокаТабличнойЧасти.СтавкаНДС = Организация.СтавкаНДСПоУмолчанию;
				КонецЕсли;	
				
				СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
				СтрокаТабличнойЧасти.СуммаНДС = ?(СуммаВключаетНДС, 
										  		СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
										  		СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
				СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
				
			КонецЦикла;
			
		Иначе
						
			Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
			    СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
			Иначе
				СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
			КонецЕсли;	
			
			Для каждого СтрокаТабличнойЧасти Из Запасы Цикл
			
				СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
				СтрокаТабличнойЧасти.СуммаНДС = 0;
				
				СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка Тогда
		РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ЭтотОбъект, ДанныеЗаполнения, "Продукция", "СерийныеНомераПродукция");
	Иначе
		РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоПеремещениюЗапасов()

// Обработчик заполнения на основании ПеремещениеЗапасов.
//
// Параметры:
//  ДанныеЗаполнения - Структура, ДокументСсылка.ПеремещениеЗапасов - Основание для заполнения документа.
//
Процедура ЗаполнитьПоПриемуВРемонт(ДанныеЗаполнения) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемИПередачаВРемонт") Тогда
		ДокументСсылкаПриемВРемонт= ДанныеЗаполнения;
	Иначе
		возврат;
	КонецЕсли;
	
	// Заполнение шапки документа.
	ЭтотОбъект.ДокументОснование = ДокументСсылкаПриемВРемонт.Ссылка;
	Организация = ДокументСсылкаПриемВРемонт.Организация;
	Контрагент = ДокументСсылкаПриемВРемонт.Контрагент;
	Договор = ДокументСсылкаПриемВРемонт.Договор;
	
	ВидЦен = Договор.ВидЦен;
	ВидСкидкиНаценки = Договор.ВидСкидкиНаценки;
	ВалютаДокумента = Договор.ВалютаРасчетов;
	СуммаВключаетНДС = ?(ЗначениеЗаполнено(Договор.ВидЦен), Договор.ВидЦен.ЦенаВключаетНДС, Неопределено);
	НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Организация,, Дата);
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Договор.ВалютаРасчетов));
	Курс = СтруктураПоВалюте.Курс;
	Кратность = СтруктураПоВалюте.Кратность;
	
КонецПроцедуры

// Процедура заполняет клонку Количество по резервам под заказ.
//
Процедура ЗаполнитьКолонкуРезервПоРезервам() Экспорт
	
	Запасы.ЗагрузитьКолонку(Новый Массив(Запасы.Количество()), "Резерв");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА &ЗаказВШапке
	|			ТОГДА &Заказ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|						И ТаблицаЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					ТОГДА ТаблицаЗапасы.Заказ
	|				ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	&ТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ТипНоменклатурыЗапас";
	
	ЗаказВШапке = ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
	Запрос.УстановитьПараметр("ТаблицаЗапасы", Запасы.Выгрузить());
	Запрос.УстановитьПараметр("ЗаказВШапке", ЗаказВШапке);
	Запрос.УстановитьПараметр("Заказ", ?(ЗначениеЗаполнено(Заказ), Заказ, Документы.ЗаказПокупателя.ПустаяСсылка()));
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг 
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОстатки.Организация КАК Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|		ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|		ЗапасыОстатки.Характеристика КАК Характеристика,
	|		ЗапасыОстатки.Партия КАК Партия,
	|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|					(ВЫБРАТЬ
	|						&Организация,
	|						&СтруктурнаяЕдиница,
	//|						ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасов,
	|						ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасовРегл, //+++ Дмгг
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ТаблицаЗапасы.ЗаказПокупателя
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|					ГДЕ
	|						ТаблицаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))) КАК ЗапасыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗапасы.Организация,
	|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	|		ДвиженияДокументаЗапасы.СчетУчета,
	|		ДвиженияДокументаЗапасы.СчетУчетаРегл, //+++ Дмгг
	|		ДвиженияДокументаЗапасы.ЗаказПокупателя,
	|		ДвиженияДокументаЗапасы.Номенклатура,
	|		ДвиженияДокументаЗапасы.Характеристика,
	|		ДвиженияДокументаЗапасы.Партия,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|	ГДЕ
	|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|		И ДвиженияДокументаЗапасы.Период <= &Период
	|		И ДвиженияДокументаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл, //+++ Дмгг
	|	ЗапасыОстатки.ЗаказПокупателя,
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДляПоиска = Новый Структура;
		Если НЕ ЗаказВШапке Тогда
			СтруктураДляПоиска.Вставить("Заказ", Выборка.ЗаказПокупателя);
		КонецЕсли;
		СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
		СтруктураДляПоиска.Вставить("Партия", Выборка.Партия);
		
		ВсегоОстаток = Выборка.КоличествоОстаток;
		МассивСтрокЗапасы = Запасы.НайтиСтроки(СтруктураДляПоиска);
		Для каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			
			ВсегоОстаток = ?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения"), ВсегоОстаток, ВсегоОстаток / СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент);
			Если СтрокаЗапасы.Количество >= ВсегоОстаток Тогда
				СтрокаЗапасы.Резерв = ВсегоОстаток;
				ВсегоОстаток = 0;
			Иначе
				СтрокаЗапасы.Резерв = СтрокаЗапасы.Количество;
				ВсегоОстаток = ВсегоОстаток - СтрокаЗапасы.Количество;
				ВсегоОстаток = ?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения"), ВсегоОстаток, ВсегоОстаток * СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьКолонкуРезервПоРезервам()

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПриходнойНакладной";
	СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
	СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПоставщику")] = "ЗаполнитьПоЗаказуПоставщику";
	СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплату")] = "ЗаполнитьПоСчетуНаОплату";
	СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеЗапасов")] = "ЗаполнитьПоПеремещениюЗапасов";
	СтратегияЗаполнения[Тип("ДокументСсылка.СборкаЗапасов")] = "ЗаполнитьПоСборкеЗапасов";
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриемИПередачаВРемонт")] = "ЗаполнитьПоПриемуВРемонт";
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	// Kuzmich, 12.05.2019, Заполнение типа цен из настроек склада
	Если Константы.ЗаполнениеТипаЦенИзНастроекСклада.Получить() Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект.СтруктурнаяЕдиница) Тогда
			ЭтотОбъект.ВидЦен = ЭтотОбъект.СтруктурнаяЕдиница.РозничныйВидЦен;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КомПредложение") Тогда
		Контрагент =  ДанныеЗаполнения.Контрагент;
		Договор=  ДанныеЗаполнения.Договор;
		Организация =  ДанныеЗаполнения.Организация;
		Дата  =  ДанныеЗаполнения.Дата;
		СтруктурнаяЕдиницаРезерв =  ДанныеЗаполнения.СтруктурнаяЕдиница;
		Ответственный =  ДанныеЗаполнения.Ответственный;
		ВалютаДокумента  =  ДанныеЗаполнения.ВалютаДокумента;
		Курс =  ДанныеЗаполнения.Курс;
		Кратность =  ДанныеЗаполнения.Кратность;
		СуммаВключаетНДС =  ДанныеЗаполнения.СуммаВключаетНДС;
		ВидЦен =  ДанныеЗаполнения.ВидЦен;
		НДСВключатьВСтоимость =  ДанныеЗаполнения.НДСВключатьВСтоимость;
		НалогообложениеНДС =  ДанныеЗаполнения.НалогообложениеНДС;
		ВидСкидкиНаценки  =  ДанныеЗаполнения.ВидСкидкиНаценки;
		ВидОперации  =  ДанныеЗаполнения.ВидОперации;
		
		
		
		Для Каждого ТекСтрока Из ДанныеЗаполнения.ТаблицаПредложений Цикл
			НоваяСтрока = Запасы.Добавить();
			НоваяСтрока.Количество = ТекСтрока.Количество;
			НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
			НоваяСтрока.Характеристика = ТекСтрока.Характеристика;
			НоваяСтрока.ПроцентСкидкиНаценки = ТекСтрока.ПроцентСкидкиНаценки;
			НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС;
			НоваяСтрока.СуммаНДС = ТекСтрока.СуммаНДС;
			СтавкаНДС=ПолучитьСтавкуНДСЧислом(НоваяСтрока.СтавкаНДС);
			НоваяСтрока.Сумма = ТекСтрока.Сумма;
			//Если Не ДанныеЗаполнения.ЦенаВклюЧаетНалоги Тогда
			НоваяСтрока.Цена = ТекСтрока.Цена;
			//				НоваяСтрока.ЦенаСкидком = ТекСтрока.Цена * (1-ТекСтрока.ПроцентСкидки/100);
			//НоваяСтрока.Всего = ТекСтрока.Сумма*(1+СтавкаНДС/100);    
			//Иначе
			//	НоваяСтрока.Цена = ТекСтрока.ЦенаСкидком/(1-ТекСтрока.ПроцентСкидки/100);
			//				НоваяСтрока.ЦенаСкидком = НоваяСтрока.Цена* ТекСтрока.Количество*(1-ТекСтрока.ПроцентСкидки/100);
			// ТекущиеДанные.Сумма = Цена * (1-ТекущиеДанные.ПроцентСкидки/100) * ТекущиеДанные.Количество;
			//НоваяСтрока.Всего = ТекСтрока.Сумма*(1+СтавкаНДС/100)
			//КонецЕсли;	
			НоваяСтрока.Всего =  ТекСтрока.Всего;
			
		КонецЦикла;
		
	//+++ Дмгг
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СборкаЗапасов") Тогда 
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ЗаказПокупателя) Тогда 
			
			тзЗапасы = ДанныеЗаполнения.ЗаказПокупателя.Запасы.Выгрузить();
			
			Для Каждого Строк Из Запасы Цикл 
				
				ПоискСтрок = тзЗапасы.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Строк.Номенклатура, Строк.Характеристика));
				Если ПоискСтрок.Количество() > 0 Тогда 
					Строк.Цена = ПоискСтрок[0].Цена;
					Строк.Сумма = ПоискСтрок[0].Сумма;
					Строк.Всего = ПоискСтрок[0].Всего;
					Строк.СуммаНДС = ПоискСтрок[0].СуммаНДС;
					Строк.СтавкаНДС = ПоискСтрок[0].СтавкаНДС;
				КонецЕсли;
				
			КонецЦикла;
			
			
		КонецЕсли;
	//--- Дмгг	
	КонецЕсли;
	
	
	// Kuzmich, 12.05.2019, Заполнение типа цен из настроек склада
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Проведен  и РежимЗаписи = РежимЗаписиДокумента.Проведение   Тогда 
		АвтоматическоеПроизводство = АвтоматическоеПроизводство();
	КонецЕсли;
	
	Если ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		Для каждого СтрокаТабличнойЧасти Из Запасы Цикл
			СтрокаТабличнойЧасти.Заказ = ?(ЗначениеЗаполнено(Заказ), Заказ, Неопределено);
		КонецЦикла;
		Если Контрагент.ВестиРасчетыПоЗаказам Тогда
			Для каждого СтрокаТабличнойЧасти Из Предоплата Цикл
				СтрокаТабличнойЧасти.Заказ = ?(ЗначениеЗаполнено(Заказ), Заказ, Неопределено);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//_Lazare
	Если  ПоложениеСклада = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ПустаяСсылка") Тогда  
		ПоложениеСклада  = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВШапке")  ;
	КонецЕсли;
	//Lazare_	
	Если ЗначениеЗаполнено(Контрагент)
	И НЕ Контрагент.ВестиРасчетыПоДоговорам
	И НЕ ЗначениеЗаполнено(Договор) Тогда
		Договор = Контрагент.ДоговорПоУмолчанию;
	КонецЕсли;
	
	СуммаДокумента = Запасы.Итог("Всего") + СтоимостьДоставки + ?(СуммаВключаетНДС, 0, СуммаНДСДоставки);
	
	// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность()
		И НЕ ПометкаУдаления Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
		
	// Конец МобильноеПриложение
	
	// ИнтеграцияГИСМ
	ЕстьМаркируемаяПродукцияГИСМ = ИнтеграцияГИСМУНФ.ЕстьМаркируемаяПродукцияГИСМ(Запасы);
	// Конец ИнтеграцияГИСМ
	
	//Паганини_
	Если НЕ ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
		ФактурыАвансов.Очистить();
	КонецЕсли;//_Паганини
	
	КоличествоТоваров = Запасы.Итог("Количество"); //+++ Дмгг
	
	//+++ Lazare
	Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройкиЗачетаАвансов() = Перечисления.ДаНет.Да
		И ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
		Предоплата.Очистить();
		ЗаполнитьПредоплату();
	КонецЕсли;
	//--- Lazare

	
	
КонецПроцедуры // ПередЗаписью()

Функция АвтоматическоеПроизводство() Экспорт
	
	Если Константы.АвтоматическоеПроизводство.Получить()  Тогда
		
		
	//	//СборкаЗапасов= Документы.СборкаЗапасов.ПустаяСсылка();
	//	тзЗапасы = Объект.Запасы.Выгрузить(,"Номенклатура,Количество");
	//	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	тзЗапасы.Номенклатура,
	//	|	тзЗапасы.Количество
	//	|ПОМЕСТИТЬ ВТ_Запасы
	//	|ИЗ
	//	|	&тзЗапасы КАК тзЗапасы
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Запасы.Номенклатура,
	//	|	ВЫРАЗИТЬ(ВТ_Запасы.Номенклатура КАК Справочник.Номенклатура).Спецификация КАК Спецификация,
	//	|	СУММА(ВТ_Запасы.Количество) КАК Количество,
	//	|	ЕСТЬNULL(АвтоматическоеПроизводство.Спецификация, ЗНАЧЕНИЕ(справочник.Спецификации.пустаяссылка)) КАК СпецификацияПроизводства
	//	|ПОМЕСТИТЬ ВТ_ТоЧтоПроизводим
	//	|ИЗ
	//	|	ВТ_Запасы КАК ВТ_Запасы
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
	//	|		ПО ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
	//	|			И (ВЫРАЗИТЬ(ВТ_Запасы.Номенклатура КАК Справочник.Номенклатура).Спецификация = АвтоматическоеПроизводство.Спецификация)
	//	|ГДЕ
	//	|	ЕСТЬNULL(АвтоматическоеПроизводство.Спецификация, ЗНАЧЕНИЕ(справочник.Спецификации.пустаяссылка)) <> ЗНАЧЕНИЕ(справочник.Спецификации.пустаяссылка)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_Запасы.Номенклатура,
	//	|	ВЫРАЗИТЬ(ВТ_Запасы.Номенклатура КАК Справочник.Номенклатура).Спецификация,
	//	|	ЕСТЬNULL(АвтоматическоеПроизводство.Спецификация, ЗНАЧЕНИЕ(справочник.Спецификации.пустаяссылка))
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ТоЧтоПроизводим.Номенклатура,
	//	|	ВТ_ТоЧтоПроизводим.Спецификация,
	//	|	(ЗапасыНаСкладахОстатки.КоличествоОстаток - ВТ_ТоЧтоПроизводим.Количество) * -1 КАК КоличествоНеобходимо,
	//	|	ЗапасыНаСкладахОстатки.КоличествоОстаток - ВТ_ТоЧтоПроизводим.Количество КАК Разница
	//	|ПОМЕСТИТЬ ВТ_Остатки
	//	|ИЗ
	//	|	ВТ_ТоЧтоПроизводим КАК ВТ_ТоЧтоПроизводим
	//	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
	//	|				&НаДату,
	//	|				Организация = &Организация
	//	|					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЗапасыНаСкладахОстатки
	//	|		ПО ВТ_ТоЧтоПроизводим.Номенклатура = ЗапасыНаСкладахОстатки.Номенклатура
	//	|ГДЕ
	//	|	ЗапасыНаСкладахОстатки.КоличествоОстаток - ВТ_ТоЧтоПроизводим.Количество < 0
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Остатки.Номенклатура,
	//	|	ВТ_Остатки.Спецификация,
	//	|	ВТ_Остатки.Разница КАК Количество
	//	|ИЗ
	//	|	ВТ_Остатки КАК ВТ_Остатки";
	//
	//
	//Запрос.УстановитьПараметр("НаДату", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата-1, ТекущаяДата()));
	//Запрос.УстановитьПараметр("Организация", Объект.Организация);
	//Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	//Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		СборкаЗапасов = Документы.СборкаЗапасов.СоздатьДокумент();
	//		СборкаЗапасов.Автор = Объект.Автор;
	//		СборкаЗапасов.СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиница;
	//	
	//	СборкаЗапасов.Дата = Объект.Дата - 1;
	//	СборкаЗапасов.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка;
	//	
	//	СборкаЗапасов.Организация = Справочники.Организации.ОсновнаяОрганизация;
	//	СборкаЗапасов.СтруктурнаяЕдиницаПродукции = Объект.СтруктурнаяЕдиница;
	//	СборкаЗапасов.СтруктурнаяЕдиница = Объект.Подразделение;
	//	СборкаЗапасов.СтруктурнаяЕдиницаОтходов = Объект.СтруктурнаяЕдиница;
	//	СборкаЗапасов.СтруктурнаяЕдиницаЗапасов = Объект.СтруктурнаяЕдиница;
	//	Объект.ДокументОснование = СборкаЗапасов.Ссылка;
	//	СборкаЗапасов.Продукция.Загрузить(РезультатЗапроса.Выгрузить());
	//	
	//	
	//КонецЦикла;
	
	Номенклатуранайдена = Ложь;
	//СборкаЗапасов= Документы.СборкаЗапасов.ПустаяСсылка();
		тзЗапасы = Запасы.Выгрузить(,"Номенклатура,Количество,ЕдиницаИзмерения, Характеристика");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗапасы.Номенклатура,
		|	тзЗапасы.Количество,
		|	тзЗапасы.ЕдиницаИзмерения,
		|	тзЗапасы.Характеристика
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Номенклатура,
		|	ВТ_Запасы.Количество КАК Количество,
		|	ВТ_Запасы.ЕдиницаИзмерения,
		|	ВТ_Запасы.Характеристика,
		|	АвтоматическоеПроизводство.Спецификация
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
		|		ПО ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|ГДЕ
		|	ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|	И ВТ_Запасы.Характеристика = АвтоматическоеПроизводство.Характеристика";
	
	//Запрос.УстановитьПараметр("НаДату", Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);
	РезультатЗапроса = Запрос.Выполнить();
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда  
	Пока  ВыборкаДетальныеЗаписи.Следующий() Цикл
		Номенклатуранайдена = Истина;
		СборкаЗапасов = Документы.СборкаЗапасов.СоздатьДокумент();
		СборкаЗапасов.Автор = Автор;
		СборкаЗапасов.СтруктурнаяЕдиница = СтруктурнаяЕдиница;

		СборкаЗапасов.Дата = Дата - 1;
		СборкаЗапасов.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка;
		//СборкаЗапасов.Реквизит1 = Истина;
		СборкаЗапасов.Организация = Справочники.Организации.ОсновнаяОрганизация;
		СборкаЗапасов.СтруктурнаяЕдиницаПродукции = СтруктурнаяЕдиница;
		СборкаЗапасов.СтруктурнаяЕдиница = Подразделение;
		//Объект.ДокументОснование = СборкаЗапасов.Ссылка;
		СборкаЗапасов.СтруктурнаяЕдиницаОтходов = СтруктурнаяЕдиница;
		СборкаЗапасов.СтруктурнаяЕдиницаЗапасов = СтруктурнаяЕдиница;
		//Объект.ДокументОснование = СборкаЗапасов.Ссылка;
		СборкаЗапасов.Продукция.Загрузить(РезультатЗапроса.Выгрузить());
		//СборкаЗапасов.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;	
	
	
	 
		
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗапаси.Номенклатура,
		|	ТЗапаси.Характеристика,
		|	ТЗапаси.Количество
		|ПОМЕСТИТЬ ТЗапасы
		|ИЗ
		|	&ТЗапаси КАК ТЗапаси
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗапасы.Номенклатура,
		|	ТЗапасы.Характеристика,
		|	ТЗапасы.Количество
		|ПОМЕСТИТЬ ТаблицаЗапасы
		|ИЗ
		|	ТЗапасы КАК ТЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпецификацииСостав.Ссылка,
		|	СпецификацииСостав.НомерСтроки,
		|	СпецификацииСостав.ТипСтрокиСостава,
		|	СпецификацииСостав.Номенклатура,
		|	СпецификацииСостав.Характеристика,
		|	СпецификацииСостав.ЕдиницаИзмерения,
		|	СУММА(СпецификацииСостав.Количество / СпецификацииСостав.КоличествоПродукции * ТаблицаЗапасы.Количество) КАК Количество,
		|	СпецификацииСостав.КоличествоПродукции,
		|	СпецификацииСостав.ДоляСтоимости,
		|	СпецификацииСостав.Спецификация
		|ИЗ
		|	ТаблицаЗапасы КАК ТаблицаЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
		|		ПО ТаблицаЗапасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура,
		|	Справочник.Спецификации.Состав КАК СпецификацииСостав,
		|	Справочник.Спецификации КАК Спецификации
		|ГДЕ
		|	ТаблицаЗапасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|	И Спецификации.Владелец = АвтоматическоеПроизводство.Номенклатура
		|	И Спецификации.Состав.Ссылка = СпецификацииСостав.Ссылка
		|	И ТаблицаЗапасы.Характеристика = АвтоматическоеПроизводство.Характеристика
		|	И СпецификацииСостав.Ссылка = АвтоматическоеПроизводство.Спецификация
		|
		|СГРУППИРОВАТЬ ПО
		|	СпецификацииСостав.Ссылка,
		|	СпецификацииСостав.НомерСтроки,
		|	СпецификацииСостав.ТипСтрокиСостава,
		|	СпецификацииСостав.Номенклатура,
		|	СпецификацииСостав.Характеристика,
		|	СпецификацииСостав.ЕдиницаИзмерения,
		|	СпецификацииСостав.КоличествоПродукции,
		|	СпецификацииСостав.ДоляСтоимости,
		|	СпецификацииСостав.Спецификация";
		
		
		Запрос.УстановитьПараметр("ТЗапаси", тзЗапасы);
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл  
			СборкаЗапасов.Запасы.Загрузить(Результат.Выгрузить());
			
		КонецЦикла;

		Если Номенклатуранайдена Тогда 
		СборкаЗапасов.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;

		//КонецЕсли;
	КонецЕсли;
	возврат Ложь;
	
КонецФункции	

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
		ПроверяемыеРеквизиты.Добавить("Подразделение");
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения Тогда
		ПроверяемыеРеквизиты.Добавить("Запасы.Партия");
	КонецЕсли;
	
	ЗаказВШапке = ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
	//СкладВШапке = ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;  //Lazare

	ТаблицаЗапасы = Запасы.Выгрузить(, "Заказ, Всего");
	ТаблицаЗапасы.Свернуть("Заказ", "Всего");
	
	ТаблицаПредоплата = Предоплата.Выгрузить(, "Заказ, СуммаПлатежа");
	ТаблицаПредоплата.Свернуть("Заказ", "СуммаПлатежа");
	
	Если ЗаказВШапке Тогда
		Для каждого СтрокаЗапасы Из ТаблицаЗапасы Цикл
			СтрокаЗапасы.Заказ = Заказ;
		КонецЦикла;
		Если Контрагент.ВестиРасчетыПоЗаказам Тогда
			Для каждого СтрокаПредоплата Из ТаблицаПредоплата Цикл
				СтрокаПредоплата.Заказ = Заказ;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	
	КоличествоЗапасы = Запасы.Количество();
	
	Для каждого Строка Из ТаблицаПредоплата Цикл
		
		НайденнаяСтрокаЗапасы = Неопределено;
		
		Если Контрагент.ВестиРасчетыПоЗаказам
		   И Строка.Заказ <> Неопределено
		   И Строка.Заказ <> Документы.ЗаказПокупателя.ПустаяСсылка()
		   И Строка.Заказ <> Документы.ЗаказПоставщику.ПустаяСсылка() Тогда
			НайденнаяСтрокаЗапасы = ТаблицаЗапасы.Найти(Строка.Заказ, "Заказ");
			Всего = ?(НайденнаяСтрокаЗапасы = Неопределено, 0, НайденнаяСтрокаЗапасы.Всего);
		ИначеЕсли Контрагент.ВестиРасчетыПоЗаказам Тогда
			НайденнаяСтрокаЗапасы = ТаблицаЗапасы.Найти(Неопределено, "Заказ");
			НайденнаяСтрокаЗапасы = ?(НайденнаяСтрокаЗапасы = Неопределено, ТаблицаЗапасы.Найти(Документы.ЗаказПокупателя.ПустаяСсылка(), "Заказ"), НайденнаяСтрокаЗапасы);
			НайденнаяСтрокаЗапасы = ?(НайденнаяСтрокаЗапасы = Неопределено, ТаблицаЗапасы.Найти(Документы.ЗаказПоставщику.ПустаяСсылка(), "Заказ"), НайденнаяСтрокаЗапасы);				
			Всего = ?(НайденнаяСтрокаЗапасы = Неопределено, 0, НайденнаяСтрокаЗапасы.Всего);
		Иначе
			Всего = Запасы.Итог("Всего");
		КонецЕсли;
		
		Если НайденнаяСтрокаЗапасы = Неопределено
		   И КоличествоЗапасы > 0
		   И Контрагент.ВестиРасчетыПоЗаказам Тогда
			ТекстСообщения = НСтр("ka='ავანსის ჩათვლა შეუძლებელია ცხრილის ნაწილ ""მარაგებში"" ან ""ხარჯებში"" მითითებული შეკევთისგან განსხვავებულის მიხედვით!';ru='Нельзя зачесть аванс по заказу отличному от указанных в табличных частях ""Запасы"" или ""Расходы""!';en='Can not be set off against the advance of order different from that indicated in the tables of ""reserves"" or ""costs""!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				,
				ТекстСообщения,
				Неопределено,
				Неопределено,
				"ПредоплатаИтогСуммаРасчетовВалюта",
				Отказ
			);
		КонецЕсли;
	КонецЦикла;
	
	Если Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить()
		И (ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию) Тогда
		
		Для каждого СтрокаЗапасы Из Запасы Цикл
			
			Если СтрокаЗапасы.Резерв > СтрокаЗапасы.Количество Тогда
				
				ТекстСообщения = НСтр("ka='ცხრილ ""მარაგების და მომსახურებების"" სტრიქონ №%Номер% რეზერვიდან გადმოტვირთული პოზიციების რაოდენობა აღემატება მარაგების საერთო რაოდენობას.';ru='В строке №%Номер% табл. части ""Запасы и услуги"" количество отгружаемых позиций из резерва превышает общее количество запасов.';en='In line №% number% Table. part of the ""Reserves and services,"" the number of items shipped from the reserve exceeds the total number of stocks.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номер%", СтрокаЗапасы.НомерСтроки);
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"Запасы",
					СтрокаЗапасы.НомерСтроки,
					"Резерв",
					Отказ
				);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Скидка 100%.
	ЕстьРучныеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиНаценкиПродажи");
	ЕстьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки"); // АвтоматическиеСкидки
	Если ЕстьРучныеСкидки ИЛИ ЕстьАвтоматическиеСкидки Тогда
		Для каждого СтрокаЗапасы Из Запасы Цикл
			// АвтоматическиеСкидки
			ТекСумма = СтрокаЗапасы.Цена * СтрокаЗапасы.Количество;
			ТекСуммаРучнойСкидки = ?(ЕстьРучныеСкидки, ОКР(ТекСумма * СтрокаЗапасы.ПроцентСкидкиНаценки / 100, 2), 0);
			ТекСуммаАвтоматическойСкидки = ?(ЕстьАвтоматическиеСкидки, СтрокаЗапасы.СуммаАвтоматическойСкидки, 0);
			ТекСуммаСкидки = ТекСуммаРучнойСкидки + ТекСуммаАвтоматическойСкидки;
			Если СтрокаЗапасы.ПроцентСкидкиНаценки <> 100 И ТекСуммаСкидки < ТекСумма
				И НЕ ЗначениеЗаполнено(СтрокаЗапасы.Сумма) Тогда
				ТекстСообщения = НСтр("ka='არ არის შევსებული სვეტი ""თანხა"" სია ""მარაგები""-ს სტრიქონ %Номер%-ში.';ru='Не заполнена колонка ""Сумма"" в строке %Номер% списка ""Запасы"".';en='Not filled column ""Amount"" on line% number% list ""Inventories"".'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номер%", СтрокаЗапасы.НомерСтроки);
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"Запасы",
					СтрокаЗапасы.НомерСтроки,
					"Сумма",
					Отказ
				);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ Контрагент.ВестиРасчетыПоДоговорам Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");
	КонецЕсли;
	
	//_Lazare
	Если  ПоложениеСклада = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ПустаяСсылка") Тогда  
		ПоложениеСклада  = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВШапке")  ;
	КонецЕсли;
	Если ПоложениеСклада  = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВШапке") Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Запасы.СтруктурнаяЕдиницаЗапасы");
	КонецЕсли;
	//Lazare_
	
	// Серийные номера
	Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктурнаяЕдиница,"ОрдерныйСклад") = Истина Тогда
		РаботаССерийнымиНомерами.ПроверкаЗаполненияСерийныхНомеров(Отказ, Запасы, СерийныеНомера, СтруктурнаяЕдиница, ЭтотОбъект);
	КонецЕсли;
	
	// Биллинг
	Если ПолучитьФункциональнуюОпцию("ИспользоватьБиллинг")
		И Договор.ЭтоДоговорОбслуживания Тогда
		
		Для Каждого Стр Из Запасы Цикл
			Если НЕ УправлениеНебольшойФирмойСервер.РазрешенаПродажаНоменклатурыПоДоговоруОбслуживания(Договор, Стр.Номенклатура, Стр.Характеристика) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					НСтр("ka='მომსახურების მიმდინარე ხელშეკრულების მიხედვით დაუგეგმავი საქონლების/მომსახურებების გატარება აკრძალულია!';ru='Запрещено проводить незапланированные товары/услуги по текущему договору обслуживания!';en='Prohibited conduct unscheduled products / services on the current contract of service!'"),
					Договор.ДоговорОбслуживанияТарифныйПлан,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Запасы", Стр.НомерСтроки, "Номенклатура"),,
					Отказ
				);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Доставка
	Если СтоимостьДоставки>0 Тогда
		ПроверяемыеРеквизиты.Добавить("НоменклатураДоставки");
	КонецЕсли;
	// Конец Доставка
	
	Если ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда 
		Если Запасы.Количество() = 0 Тогда 
			Отказ = Истина;
			Сообщить(НСтр("ka='ცხრილურ ნაწილში ""მარაგები"" არ არის შევსებული არცერთი სტრიქონი';ru='В табличной части ""Запасы"" нет ни одной записи';en='In the tables of this ""reserve"" no audio record'"));
		КонецЕсли;
	КонецЕсли;
	
	//+++ Дмгг БезвозмезднаяПродажа
	Если ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Контрагент");
	Иначе 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Запасы.Сотрудник");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Запасы.СтруктурнаяЕдиница");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВидНачисленияУдержания");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Запасы.ВидНалогаНДФЛ");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетДоходовБП");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Запасы.ВидУдержанияПФ");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратБезвозмезднойПродажиСотрудник");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратНДСБезвозмезднойПродажиСотрудник");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратНДФЛСотрудник");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратПФСотрудник");
	КонецЕсли;
	
	Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПроверятьЦенуПродажиВРасходнойНакладной") Тогда
		
		тзПоследнихЗакупочныхЦен = ПолучитьТаблицуПоследнихЗакупочнихЦен(Запасы.Выгрузить(,"НомерСтроки, Номенклатура, Характеристика"));
		Для Каждого Стр Из Запасы Цикл
			
			ПоискСтрокЦены = тзПоследнихЗакупочныхЦен.НайтиСтроки(Новый Структура("НомерСтроки", Стр.НомерСтроки));
			ЦенаЗакупки = 0;
			Если ПоискСтрокЦены.Количество() <> 0 Тогда 
				ЦенаЗакупки = ПоискСтрокЦены[0].Цена;
			КонецЕсли;
			
			Если Стр.Цена < ЦенаЗакупки Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ""+ Стр.Номенклатура +"-ის ბოლო შესყიდვის ფასი აღემატება ფასს";
				Сообщение.КлючДанных = Ссылка;
				Сообщение.Сообщить();
				
				Если НЕ Отказ И НЕ РольДоступна("ПолныеПрава") Тогда 
					
					Отказ = Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//--- Дмгг 
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	//+++ Дмгг 
	Если ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю
		И ВалютаДокумента <> УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("НациональнаяВалюта")
		И СуммаДокумента = Предоплата.Итог("СуммаРасчетов") Тогда 
		
			ДополнительныеСвойства.Вставить("ТребуетсяПроверкаИВыравнивание", ИСТИНА);
			
	Иначе
			
		ДополнительныеСвойства.Вставить("ТребуетсяПроверкаИВыравнивание", ЛОЖЬ);
		
	КонецЕсли;
	//--- Дмгг
	
	// Инициализация данных документа.
	Документы.РасходнаяНакладная.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыВРазрезеГТД(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗакупки(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьПродажи(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьВыпускПродукции(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоНалогам(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыКРасходуСоСкладов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыПринятые(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыПереданные(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗаказыПокупателей(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗаказыПоставщикам(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыКассовыйМетод(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыНераспределенные(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыОтложенные(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьПотребностьВЗапасах(ДополнительныеСвойства, Движения, Отказ);
	Если ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику Тогда
		УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПоставщиками(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ);
	
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыНДФЛ(ДополнительныеСвойства, Движения, Отказ); //+++ Дмгг
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПерсоналом(ДополнительныеСвойства, Движения, Отказ); //+++ Дмгг
	УправлениеНебольшойФирмойСервер.ОтразитьНачисленияИУдержания(ДополнительныеСвойства, Движения, Отказ); //+++ Дмгг
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьРасчетыСПенсионнымФондом(ДополнительныеСвойства, Движения, Отказ); //+++ Дмгг
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьДекларация(ДополнительныеСвойства, Движения, Отказ); //+++ Дмгг
	// СерийныеНомера
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераОстатки(ДополнительныеСвойства, Движения, Отказ);
	
	// ДисконтныеКарты
	УправлениеНебольшойФирмойСервер.ОтразитьПродажиПоДисконтнойКарте(ДополнительныеСвойства, Движения, Отказ);
	// АвтоматическиеСкидки
	УправлениеНебольшойФирмойСервер.ОтразитьПредоставленныеАвтоматическиеСкидки(ДополнительныеСвойства, Движения, Отказ);
	// Эквайринг
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыКассовыйМетодЭквайринг(ДополнительныеСвойства, Движения, Отказ);
	
	УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьАвансыОтправленныхФактур(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	
	// Биллинг
	УправлениеНебольшойФирмойСервер.ОтразитьВыполнениеДоговораОбслуживания(ДополнительныеСвойства, Движения, Отказ);
	
	// Рублевые суммы документов
	УправлениеНебольшойФирмойСервер.ОтразитьРублевыеСуммыДокументовВВалюте(ДополнительныеСвойства, Движения, Отказ);
	
	УправлениеНебольшойФирмойСервер.ОтразитьЗакупкиДляКУДиР(ДополнительныеСвойства, Движения, Отказ);
	
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	Если ПолучитьФункционалРезервированияЗаказов() И Константы_German_Butcher_Получить() Тогда
		УправлениеНебольшойФирмойСервер.ОтразитьУсушкa_СобранныеPаказы(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.РасходнаяНакладная.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	Если НЕ Отказ Тогда 
		Документы.РасходнаяНакладная.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ,,Истина);
	КонецЕсли;

	//Паганини_
	Если НЕ ОтключитьКонтрольЛимитаЗадолжностиПокупателя Тогда
		РС_ОбщегоНазначения.ПроверкаСуммиИДниЗадолженности(Ссылка, Отказ);
	КонецЕсли;
	//_Паганини
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КомПредложение") Тогда 
		ПроверитьВыполнениеКомПредложения();
	КонецЕсли;
	
	//+++ Lazare_27.08.2021
	Если не ОтключитьКонтрольЗадолжностиПокупателя и  ВидОперации =
		ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю") Тогда 
		РС_ОбщегоНазначения.ПроверитьсуммуЗадолженности (Ссылка,Отказ);
	КонецЕсли
	//--- Lazare_27.08.2021
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.РасходнаяНакладная.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
	// Подчиненная счет-фактура
	Если НЕ Отказ Тогда
		
		КонтрольПодчиненнойСчетФактуры();
		
		
		Если Константы.ФункционалСбораТоваров.Получить() Тогда  
			Если ЗначениеЗаполнено(Заказ) И ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда  
				ДокОб = Заказ.ПолучитьОбъект();
				Если ДокОб.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Доставлен Тогда
					ДокОб.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Собран;
					ДокОб.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Процедура - обработчик события ПриКопировании объекта.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ОчиститьДатуНомерВходящегоДокумента(ЭтотОбъект);
	Предоплата.Очистить();
	
	ПереданВЕГАИС = Неопределено;
	ТоварноТранспортнаяНакладнаяЕГАИС = Неопределено;
	СпособПродажиГИСМ = "";
	
КонецПроцедуры // ПриКопировании()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура отмены проведения у подченненой счет фактуры
//
Процедура КонтрольПодчиненнойСчетФактуры()
	
	СтруктураСчетаФактуры = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйСчетФактуру(Ссылка);
	Если СтруктураСчетаФактуры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СчетФактура	 = СтруктураСчетаФактуры.Ссылка;
	Если Не СчетФактура.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ka='მოძრაობების არარსებობის გამო დოკუმენტ %ПредставлениеТекущегоДокумента%-ს გაუტარდება ანგარიშფაქტურა %ПредставлениеСчетФактуры%.';ru='В связи с отсутствием движений у документа %ПредставлениеТекущегоДокумента% распроводится счет фактура %ПредставлениеСчетФактуры%.';en='Due to the lack of movement in the document% PredstavlenieTekuschegoDokumenta% rasprovoditsya invoice% PredstavlenieSchetFaktury%.'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеТекущегоДокумента%", """Расходная накладная № " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy") + """");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеСчетФактуры%", """Счет фактура (выданная) № " + СтруктураСчетаФактуры.Номер + " от " + СтруктураСчетаФактуры.Дата + """");
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
	СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
	СчетФактураОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры //КонтрольПодчиненнойСчетФактуры()

Функция ЭтоВводНаОснованииЗаказНаряда(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ВидОперацииЗаказаПокупателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ВидОперации");
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("Основание")
		И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказПокупателя")
		Тогда
		ВидОперацииЗаказаПокупателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Основание, "ВидОперации");
	КонецЕсли;
	
	Возврат ВидОперацииЗаказаПокупателя = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд;
	
КонецФункции

Процедура ЗаполнитьДопРеквизиты(Док)
	
	Для Каждого Стр Из Док.ДополнительныеРеквизиты Цикл 
		Если Лев(Стр.Свойство,19) = "გაყიდვების მენეჯერი" Тогда
			
			СвойствоДоп = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("გაყიდვების მენეჯერი (გასავლის ზედნადებები)");
			Если ЗначениеЗаполнено(СвойствоДоп) Тогда
				НовСтр = ЭтотОбъект.ДополнительныеРеквизиты.Добавить();
				НовСтр.Свойство = СвойствоДоп;
				НовСтр.Значение = Стр.Значение;
			КонецЕсли;	
			
		КонецЕсли;
		
		Если Лев(Стр.Свойство,20) = "კალკულაციის მენეჯერი" Тогда
			СвойствоДоп = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("კალკულაციის მენეჯერი (გასავლის ზედნადებები)");
			Если ЗначениеЗаполнено(СвойствоДоп) Тогда
				НовСтр = ЭтотОбъект.ДополнительныеРеквизиты.Добавить();
				НовСтр.Свойство = СвойствоДоп;
				НовСтр.Значение = Стр.Значение;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;					
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьСтавкуНДСЧислом(СтавкаНДС)
	
		Возврат СтавкаНДС.Ставка;
		
	Конецфункции
	
Процедура ПроверитьВыполнениеКомПредложения() //+++ Дмгг

	КомПредОбъект = ДокументОснование.ПолучитьОбъект();
	
	КомПредОбъект.СостояниеЗаказа = Перечисления.СтатусыКомПредложение.Выполнено;
	
	Попытка
		КомПредОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Сообщить("Не удалось изменить статус коммерческого предложения: """+ДокументОснование+""", на ""Выполнено""");
	КонецПопытки;

КонецПроцедуры

Функция ПолучитьТаблицуПоследнихЗакупочнихЦен(тзНоменклатуры)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзНоменклатуры.НомерСтроки,
		|	тзНоменклатуры.Номенклатура,
		|	тзНоменклатуры.Характеристика
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	&тзНоменклатуры КАК тзНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗакупкиОбороты.Период,
		|	ЗакупкиОбороты.Номенклатура,
		|	ЗакупкиОбороты.Характеристика,
		|	ЗакупкиОбороты.СуммаОборот,
		|	ЗакупкиОбороты.КоличествоОборот
		|ПОМЕСТИТЬ ВТ_Закупки
		|ИЗ
		|	РегистрНакопления.Закупки.Обороты(
		|			,
		|			,
		|			Запись,
		|			(Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						а.Номенклатура,
		|						а.Характеристика
		|					ИЗ
		|						ВТ_Номенклатура КАК а)
		|				И Организация = &Организация) КАК ЗакупкиОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_Закупки.Период) КАК Период,
		|	ВТ_Закупки.Номенклатура,
		|	ВТ_Закупки.Характеристика
		|ПОМЕСТИТЬ ВТ_МаксПериод
		|ИЗ
		|	ВТ_Закупки КАК ВТ_Закупки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Закупки.Номенклатура,
		|	ВТ_Закупки.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.НомерСтроки,
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика,
		|	ВТ_МаксПериод.Период,
		|	ВТ_Закупки.СуммаОборот,
		|	ВТ_Закупки.КоличествоОборот,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_Закупки.КоличествоОборот, 0) = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВТ_Закупки.СуммаОборот / ВТ_Закупки.КоличествоОборот
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксПериод КАК ВТ_МаксПериод
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Закупки КАК ВТ_Закупки
		|			ПО ВТ_МаксПериод.Период = ВТ_Закупки.Период
		|				И ВТ_МаксПериод.Номенклатура = ВТ_Закупки.Номенклатура
		|				И ВТ_МаксПериод.Характеристика = ВТ_Закупки.Характеристика
		|		ПО ВТ_Номенклатура.Номенклатура = ВТ_МаксПериод.Номенклатура
		|			И ВТ_Номенклатура.Характеристика = ВТ_МаксПериод.Характеристика";
	
	Запрос.УстановитьПараметр("тзНоменклатуры", тзНоменклатуры);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаблицуПоследнихЗакупочнихЦен(Запасы.Выгрузить(,"Номенклатура, Характеристика"))()


#КонецОбласти

#КонецЕсли

// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
#Область Потери_при_сушке_GermanButcher

Функция ПолучитьФункционалРезервированияЗаказов()
	Возврат Константы.ФункционалСбораТоваров.Получить();
КонецФункции

Функция Константы_German_Butcher_Получить()
	Возврат Константы.German_Butcher.Получить();
КонецФункции 

#КонецОбласти
// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010