
Процедура ПодпискаНаСобытиеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	СтруктураВременныеТаблицы = Источник.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	Если СтруктураВременныеТаблицы.Свойство("AzRy_НапПольз_ДвиженияЗапасыНаСкладахИзменение") И СтруктураВременныеТаблицы.AzRy_НапПольз_ДвиженияЗапасыНаСкладахИзменение Тогда
		
		Текст1 = "საწყობის პასუხისმგებლის კონტროლი: დოკუმენტის (გატარება/მოხსნა) საწყობის პასუხისმგებლის გარეშე  დაბლოკილია. საწყობის პასუხისმგებელი პირი - '";
		Текст2 = "საწყობის პასუხისმგებლის კონტროლი: დოკუმენტის  (გატარება/მოხსნა) უნდა მოახდინოს შეტყობინების მიმღებმა. შეტყობინების მიმღები პირი  - '";
		
		Для каждого ТекущийОтветственный Из СтруктураВременныеТаблицы.AzRy_НапПольз_МассивТекущийОтветственный Цикл
			
			Если ТекущийОтветственный = Пользователи.ТекущийПользователь() Тогда // თუ საწყობის პასუხისმგებელი პირი ატარებს დოკუმენტს შემოწმება საჭირო აღარ არის.
				
				Продолжить;
						
			ИначеЕсли СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Неопределено 
				Или СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.ОжидаетПодтверждения
				Или СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.ПодтверждениеНеОдобрено
				Или СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.Finnished Тогда
				
				Отказ = Истина;
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Источник, Текст1 + ТекущийОтветственный + "' ",,,, Истина);
				
			ИначеЕсли СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) <> Неопределено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.ПодтверждениеОдобрено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель <> Пользователи.ТекущийПользователь() Тогда				

				Отказ = Истина;
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Источник, Текст2 + СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель + "' ",,,, Истина);
				
			ИначеЕсли СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) <> Неопределено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель <> Пользователи.ТекущийПользователь() Тогда				

				Отказ = Истина;
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Источник, Текст2 + СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель + "' ",,,, Истина);				
				
			ИначеЕсли СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) <> Неопределено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.ПодтверждениеОдобрено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель = Пользователи.ТекущийПользователь() Тогда

				СтатусНапоминания = СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный);
				РегистрыСведений.AzRyНапоминанияПользователя.ОбновитьЗаписьПослеПроведенияДокумента(СтатусНапоминания, Источник.Ссылка); 

			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//СтруктураВременныеТаблицы = Источник.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;	
	//Если Не СтруктураВременныеТаблицы.Свойство("AzRyДвиженияЗапасыИзменение") Или Отказ Или Не СтруктураВременныеТаблицы.AzRyДвиженияЗапасыИзменение Или СтруктураВременныеТаблицы.AzRyАвторДокумента = СтруктураВременныеТаблицы.AzRyОтветственныйЗаСклад Тогда
	//	Возврат;	
	//КонецЕсли; 
	//
	//// ვიძახებთ დამუშავებას და ვაგზავნით მეილს	                     
	//ОтправитьПисьмоОтветственногоЗаСкладом(СтруктураВременныеТаблицы.AzRyРегистратор, Пользователи.ТекущийПользователь());
	
КонецПроцедуры