#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасы(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Возврат,
	|	ТаблицаЗапасы.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ТОГДА ТаблицаЗапасы.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДокументПродажи,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ТаблицаЗапасы.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказПродажи,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ТаблицаЗапасы.ПодразделениеПродажи
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ТаблицаЗапасы.Ответственный
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Ответственный,
	|	ТаблицаЗапасы.ПодразделениеПродажи КАК ПодразделениеПродажи,
	|	ТаблицаЗапасы.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельности,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость КАК СчетУчетаСебестоимость,
	|	ТаблицаЗапасы.СчетУчетаСебестоимостьРегл КАК СчетУчетаСебестоимостьРегл,
	|	ТаблицаЗапасы.КоррОрганизация КАК КоррОрганизация,
	//|	ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК СтруктурнаяЕдиница,
	//|	ЕСТЬNULL(ТаблицаЗапасы.КоррСтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК КоррСтруктурнаяЕдиница,
//	|	ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК СтруктурнаяЕдиница,
//	|	ЕСТЬNULL(ТаблицаЗапасы.КоррСтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК КоррСтруктурнаяЕдиница,
	//Lazare_
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
	|			ТОГДА ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
	|			ТОГДА ЕСТЬNULL(ТаблицаЗапасы.КоррСтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|	КОНЕЦ КАК КоррСтруктурнаяЕдиница,
	//_Lazare	
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.КоррСчетУчета КАК КоррСчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
	|	ТаблицаЗапасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ТаблицаЗапасы.СчетУчетаПереработчикуРегл КАК СчетУчетаПереработчикуРегл,
	|	ТаблицаЗапасы.ТоварыНаКомиссии КАК ТоварыНаКомиссии,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.КоррНоменклатура КАК КоррНоменклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.КоррХарактеристика КАК КоррХарактеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	ТаблицаЗапасы.Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ТаблицаЗапасы.КоррПартия КАК КоррПартия,
	|	ЛОЖЬ КАК Резервирование,//+++ Дмгг
	
	////Малышев 2024-11-19 ONESOFT-3602
	//|	ВЫБОР
	//|		КОГДА ТаблицаЗапасы.Номенклатура.МетодОценки <> Значение(Перечисление.МетодОценкиЗапасов.FIFO) ТОГДА НЕОПРЕДЕЛЕНО
	//|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	//|			ТОГДА ТаблицаЗапасы.ДокументОснование
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК ДокументПоступления, 
	////Малышев 2024-11-19 ONESOFT-3602
	
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ТаблицаЗапасы.Заказ
	|		КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|				И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|			ТОГДА ТаблицаЗапасы.Заказ.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.КоррЗаказ ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ТаблицаЗапасы.КоррЗаказ
	|		КОГДА ТаблицаЗапасы.КоррЗаказ ССЫЛКА Документ.ЗаказПоставщику
	|				И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				И ФункциональнаяОпцияРезервированиеЗапасов.Значение
	|			ТОГДА ТаблицаЗапасы.КоррЗаказ.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК КоррЗаказПокупателя,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|					ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|					ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|					ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|				ТОГДА -1 * ТаблицаЗапасы.Количество
	|			ИНАЧЕ ТаблицаЗапасы.Количество
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ТаблицаЗапасы.Резерв) КАК Резерв,
	|	ТаблицаЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ТаблицаЗапасы.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|					ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|					ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|				ТОГДА 0
	//+++ Дмгг
	//|			КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	//|				ТОГДА -1 * ТаблицаЗапасы.Сумма
	|			КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|					И ТаблицаЗапасы.Документ.СуммаВключаетНДС
	|				ТОГДА -1 * (ТаблицаЗапасы.Сумма - ТаблицаЗапасы.СуммаНДС)
	|			КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|					И НЕ ТаблицаЗапасы.Документ.СуммаВключаетНДС
	|				ТОГДА -1 * ТаблицаЗапасы.Сумма
	//--- Дмгг
	|			ИНАЧЕ ТаблицаЗапасы.Сумма
	|		КОНЕЦ) КАК Сумма,
	|	0 КАК Себестоимость,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ФиксированнаяСтоимость,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|			ТОГДА ТаблицаЗапасы.СчетУчетаСебестоимость
	|		ИНАЧЕ ТаблицаЗапасы.КоррСчетУчета
	|	КОНЕЦ КАК СчетДт,
	|	ТаблицаЗапасы.СчетУчета КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|			ТОГДА ТаблицаЗапасы.СчетУчетаСебестоимостьРегл
	|		ИНАЧЕ ТаблицаЗапасы.КоррСчетУчетаРегл
	|	КОНЕЦ КАК СчетДтРегл,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ТОГДА ВЫРАЗИТЬ(&ОприходованиеЗапасов КАК СТРОКА(100))
	|		ИНАЧЕ ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100))
	|	КОНЕЦ КАК Содержание,   
	|	ТаблицаЗапасы.ЭтоПодарок КАК ЭтоПодарок,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ТОГДА ВЫРАЗИТЬ(&ОприходованиеЗапасов КАК СТРОКА(100))
	|		ИНАЧЕ ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100))
	|	КОНЕЦ КАК СодержаниеПроводки,
	//Lazare_
	|	ТаблицаЗапасы.ПоложениеСклада КАК ПоложениеСклада,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы КАК СтруктурнаяЕдиницаЗапасы
	//_Lazare
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,СУММА(ТаблицаЗапасы.КоличествоСобрПотери) КАК КоличествоСобрПотери
	|	,МАКСИМУМ(ТаблицаЗапасы.СчетУчетаПотерь) КАК СчетУчетаПотерь
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы,
	|	Константа.ФункциональнаяОпцияРезервированиеЗапасов КАК ФункциональнаяОпцияРезервированиеЗапасов
	|ГДЕ
	|	ТаблицаЗапасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Документ,
	////Малышев 2024-11-19 ONESOFT-3602 (--
	//|	ВЫБОР
	//|		КОГДА ТаблицаЗапасы.Номенклатура.МетодОценки <> Значение(Перечисление.МетодОценкиЗапасов.FIFO) ТОГДА НЕОПРЕДЕЛЕНО
	//|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	//|			ТОГДА ТаблицаЗапасы.ДокументОснование
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ, 
	////Малышев 2024-11-19 ONESOFT-3602 --)
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ТОГДА ТаблицаЗапасы.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ТаблицаЗапасы.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ТаблицаЗапасы.ПодразделениеПродажи
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ТаблицаЗапасы.Ответственный
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаЗапасы.ПодразделениеПродажи,
	|	ТаблицаЗапасы.НаправлениеДеятельностиПродажи,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость,
	|	ТаблицаЗапасы.СчетУчетаСебестоимостьРегл,
	|	ТаблицаЗапасы.КоррОрганизация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.ЭтоПодарок,
	|	ТаблицаЗапасы.КоррСчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ТаблицаЗапасы.КоррСчетУчетаРегл,
	|	ТаблицаЗапасы.СчетУчетаЗатратРегл,
	|	ТаблицаЗапасы.СчетУчетаПереработчикуРегл,
	|	ТаблицаЗапасы.ТоварыНаКомиссии,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	ТаблицаЗапасы.Проект,
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ТаблицаЗапасы.КоррНоменклатура,
	|	ТаблицаЗапасы.КоррХарактеристика,
	|	ТаблицаЗапасы.КоррПартия,
	|	ТаблицаЗапасы.Ответственный,
	//Lazare_
	|	ТаблицаЗапасы.ПоложениеСклада,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы,
	//_Lazare		
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ТаблицаЗапасы.Заказ
	|		КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|				И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|			ТОГДА ТаблицаЗапасы.Заказ.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.КоррЗаказ ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ТаблицаЗапасы.КоррЗаказ
	|		КОГДА ТаблицаЗапасы.КоррЗаказ ССЫЛКА Документ.ЗаказПоставщику
	|				И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				И ФункциональнаяОпцияРезервированиеЗапасов.Значение
	|			ТОГДА ТаблицаЗапасы.КоррЗаказ.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаЗапасы.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ТОГДА ВЫРАЗИТЬ(&ОприходованиеЗапасов КАК СТРОКА(100))
	|		ИНАЧЕ ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|			ТОГДА ТаблицаЗапасы.СчетУчетаСебестоимостьРегл
	|		ИНАЧЕ ТаблицаЗапасы.КоррСчетУчетаРегл
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|			ТОГДА ТаблицаЗапасы.СчетУчетаСебестоимость
	|		ИНАЧЕ ТаблицаЗапасы.КоррСчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ТОГДА ВЫРАЗИТЬ(&ОприходованиеЗапасов КАК СТРОКА(100))
	|		ИНАЧЕ ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100))
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='მარაგების შემოსავალში აყვანა';ru='Оприходование запасов';en='Posting of Goods'"));
	Запрос.УстановитьПараметр("СписаниеЗапасов", НСтр("ka='მარაგების ჩამოწერა';ru='Списание запасов';en='Write-off stocks'"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());
	
	Если ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю 
		ИЛИ ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию 
		ИЛИ ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку
		ИЛИ ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение 
		ИЛИ ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику Тогда
		
		СформироватьТаблицаЗапасыПродажа(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
		
		// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
		// Увеличиваем количество на потери
		// так делать нехорошо.
		Если ПолучитьФункционалРезервированияЗаказов() И Константы_German_Butcher_Получить() Тогда
			Для Каждого СтрокаТаблицы из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы Цикл
				Если СтрокаТаблицы.Количество>0 Тогда
					НовоеКоличество = СтрокаТаблицы.Количество + СтрокаТаблицы.КоличествоСобрПотери;
					НоваяСумма = СтрокаТаблицы.Сумма * НовоеКоличество / СтрокаТаблицы.Количество;
					СтрокаТаблицы.Количество = НовоеКоличество;
					СтрокаТаблицы.Сумма = НоваяСумма;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
		
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда
		
		СформироватьТаблицаЗапасыВозврат(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
		
	КонецЕсли;
	
КонецПроцедуры // СформироватьТаблицаЗапасы()

// Олег Литвиненко 29.12.22 --->
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыВВалюте(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Возврат,
	|	ТаблицаЗапасы.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ТОГДА ТаблицаЗапасы.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДокументПродажи,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ТаблицаЗапасы.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказПродажи,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ТаблицаЗапасы.ПодразделениеПродажи
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ТаблицаЗапасы.Ответственный
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Ответственный,
	|	ТаблицаЗапасы.ПодразделениеПродажи КАК ПодразделениеПродажи,
	|	ТаблицаЗапасы.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельности,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость КАК СчетУчетаСебестоимость,
	|	ТаблицаЗапасы.СчетУчетаСебестоимостьРегл КАК СчетУчетаСебестоимостьРегл,
	|	ТаблицаЗапасы.КоррОрганизация КАК КоррОрганизация,
	//|	ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК СтруктурнаяЕдиница,
	//|	ЕСТЬNULL(ТаблицаЗапасы.КоррСтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК КоррСтруктурнаяЕдиница,
//	|	ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК СтруктурнаяЕдиница,
//	|	ЕСТЬNULL(ТаблицаЗапасы.КоррСтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК КоррСтруктурнаяЕдиница,
	//Lazare_
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
	|			ТОГДА ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
	|			ТОГДА ЕСТЬNULL(ТаблицаЗапасы.КоррСтруктурнаяЕдиница, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|	КОНЕЦ КАК КоррСтруктурнаяЕдиница,
	//_Lazare	
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.КоррСчетУчета КАК КоррСчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
	|	ТаблицаЗапасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ТаблицаЗапасы.СчетУчетаПереработчикуРегл КАК СчетУчетаПереработчикуРегл,
	|	ТаблицаЗапасы.ТоварыНаКомиссии КАК ТоварыНаКомиссии,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.КоррНоменклатура КАК КоррНоменклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.КоррХарактеристика КАК КоррХарактеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.ДокументПоступления КАК ДокументПоступления, //Малышев 2024-11-19 ONESOFT-3602
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	ТаблицаЗапасы.Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ТаблицаЗапасы.КоррПартия КАК КоррПартия,
	|	ЛОЖЬ КАК Резервирование,//+++ Дмгг
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ТаблицаЗапасы.Заказ
	|		КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|				И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|			ТОГДА ТаблицаЗапасы.Заказ.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.КоррЗаказ ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ТаблицаЗапасы.КоррЗаказ
	|		КОГДА ТаблицаЗапасы.КоррЗаказ ССЫЛКА Документ.ЗаказПоставщику
	|				И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				И ФункциональнаяОпцияРезервированиеЗапасов.Значение
	|			ТОГДА ТаблицаЗапасы.КоррЗаказ.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК КоррЗаказПокупателя,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|					ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|					ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|					ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|				ТОГДА -1 * ТаблицаЗапасы.Количество
	|			ИНАЧЕ ТаблицаЗапасы.Количество
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ТаблицаЗапасы.Резерв) КАК Резерв,
	|	ТаблицаЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ТаблицаЗапасы.СуммаНДС * КурсУпрВалюты.Кратность / КурсУпрВалюты.Курс) КАК СуммаНДС,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|					ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|					ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|				ТОГДА 0
	//+++ Дмгг
	//|			КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	//|				ТОГДА -1 * ТаблицаЗапасы.Сумма
	|			КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|					И ТаблицаЗапасы.Документ.СуммаВключаетНДС
	|				ТОГДА -1 * (ТаблицаЗапасы.Сумма - ТаблицаЗапасы.СуммаНДС)
	|			КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|					И НЕ ТаблицаЗапасы.Документ.СуммаВключаетНДС
	|				ТОГДА -1 * ТаблицаЗапасы.Сумма
	//--- Дмгг
	|			ИНАЧЕ ТаблицаЗапасы.Сумма
	|		КОНЕЦ * КурсУпрВалюты.Кратность / КурсУпрВалюты.Курс) КАК СуммаВал,
	|	0 КАК Себестоимость,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ФиксированнаяСтоимость,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|			ТОГДА ТаблицаЗапасы.СчетУчетаСебестоимость
	|		ИНАЧЕ ТаблицаЗапасы.КоррСчетУчета
	|	КОНЕЦ КАК СчетДт,
	|	ТаблицаЗапасы.СчетУчета КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|			ТОГДА ТаблицаЗапасы.СчетУчетаСебестоимостьРегл
	|		ИНАЧЕ ТаблицаЗапасы.КоррСчетУчетаРегл
	|	КОНЕЦ КАК СчетДтРегл,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ТОГДА ВЫРАЗИТЬ(&ОприходованиеЗапасов КАК СТРОКА(100))
	|		ИНАЧЕ ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100))
	|	КОНЕЦ КАК Содержание,   
	|	ТаблицаЗапасы.ЭтоПодарок КАК ЭтоПодарок,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ТОГДА ВЫРАЗИТЬ(&ОприходованиеЗапасов КАК СТРОКА(100))
	|		ИНАЧЕ ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100))
	|	КОНЕЦ КАК СодержаниеПроводки,
	//Lazare_
	|	ТаблицаЗапасы.ПоложениеСклада КАК ПоложениеСклада,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы КАК СтруктурнаяЕдиницаЗапасы
	//_Lazare
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,СУММА(ТаблицаЗапасы.КоличествоСобрПотери) КАК КоличествоСобрПотери
	|	,МАКСИМУМ(ТаблицаЗапасы.СчетУчетаПотерь) КАК СчетУчетаПотерь
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы,
	|	Константа.ФункциональнаяОпцияРезервированиеЗапасов КАК ФункциональнаяОпцияРезервированиеЗапасов,
	|	втКурсУпрВалюты КАК КурсУпрВалюты 
	|ГДЕ
	|	ТаблицаЗапасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	И КурсУпрВалюты.Курс > 0
	|	И КурсУпрВалюты.Кратность > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Документ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ТОГДА ТаблицаЗапасы.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ТаблицаЗапасы.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ТаблицаЗапасы.ПодразделениеПродажи
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ТаблицаЗапасы.Ответственный
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаЗапасы.ПодразделениеПродажи,
	|	ТаблицаЗапасы.НаправлениеДеятельностиПродажи,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость,
	|	ТаблицаЗапасы.СчетУчетаСебестоимостьРегл,
	|	ТаблицаЗапасы.КоррОрганизация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.ЭтоПодарок,
	|	ТаблицаЗапасы.КоррСчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ТаблицаЗапасы.КоррСчетУчетаРегл,
	|	ТаблицаЗапасы.СчетУчетаЗатратРегл,
	|	ТаблицаЗапасы.СчетУчетаПереработчикуРегл,
	|	ТаблицаЗапасы.ТоварыНаКомиссии,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.ДокументПоступления, //Малышев 2024-11-19 ONESOFT-3602
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	ТаблицаЗапасы.Проект,
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ТаблицаЗапасы.КоррНоменклатура,
	|	ТаблицаЗапасы.КоррХарактеристика,
	|	ТаблицаЗапасы.КоррПартия,
	|	ТаблицаЗапасы.Ответственный,
	//Lazare_
	|	ТаблицаЗапасы.ПоложениеСклада,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы,
	//_Lazare		
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|				И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ТаблицаЗапасы.Заказ
	|		КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|				И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|			ТОГДА ТаблицаЗапасы.Заказ.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.КоррЗаказ ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ТаблицаЗапасы.КоррЗаказ
	|		КОГДА ТаблицаЗапасы.КоррЗаказ ССЫЛКА Документ.ЗаказПоставщику
	|				И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				И ФункциональнаяОпцияРезервированиеЗапасов.Значение
	|			ТОГДА ТаблицаЗапасы.КоррЗаказ.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаЗапасы.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ТОГДА ВЫРАЗИТЬ(&ОприходованиеЗапасов КАК СТРОКА(100))
	|		ИНАЧЕ ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|			ТОГДА ТаблицаЗапасы.СчетУчетаСебестоимостьРегл
	|		ИНАЧЕ ТаблицаЗапасы.КоррСчетУчетаРегл
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|			ТОГДА ТаблицаЗапасы.СчетУчетаСебестоимость
	|		ИНАЧЕ ТаблицаЗапасы.КоррСчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ТОГДА ВЫРАЗИТЬ(&ОприходованиеЗапасов КАК СТРОКА(100))
	|		ИНАЧЕ ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100))
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='მარაგების შემოსავალში აყვანა';ru='Оприходование запасов';en='Posting of Goods'"));
	Запрос.УстановитьПараметр("СписаниеЗапасов", НСтр("ka='მარაგების ჩამოწერა';ru='Списание запасов';en='Write-off stocks'"));
	Запрос.УстановитьПараметр("НаДату", СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыВВалюте", РезультатЗапроса.Выгрузить());
	
	Если ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю 
		ИЛИ ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию 
		ИЛИ ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку
		ИЛИ ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение 
		ИЛИ ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику Тогда
		
		СформироватьТаблицаЗапасыВВалютеПродажа(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
		
		// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
		// Увеличиваем количество на потери
		// так делать нехорошо.
		Если ПолучитьФункционалРезервированияЗаказов() И Константы_German_Butcher_Получить() Тогда
			Для Каждого СтрокаТаблицы из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте Цикл
				Если СтрокаТаблицы.Количество>0 Тогда
					НовоеКоличество = СтрокаТаблицы.Количество + СтрокаТаблицы.КоличествоСобрПотери;
					НоваяСумма = СтрокаТаблицы.СуммаВал * НовоеКоличество / СтрокаТаблицы.Количество;
					СтрокаТаблицы.Количество = НовоеКоличество;
					СтрокаТаблицы.СуммаВал = НоваяСумма;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
		
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда
		
		СформироватьТаблицаЗапасыВВалютеВозврат(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
		
	КонецЕсли;
	
	//Малышев 2025-11-28 ES4001-103
	Для каждого СтрокаЗаписи из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте Цикл 
		Если ЗначениеЗаполнено(СтрокаЗаписи.Номенклатура) и СтрокаЗаписи.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
			СтрокаЗаписи.СчетУчетаЗатратРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры // СформироватьТаблицаЗапасыВВалюте() // Олег Литвиненко <---

// Олег Литвиненко 06.01.23 --->
Процедура СформироватьТаблицаПродажиВВалюте(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПродажи.Период КАК Период,
	|	ТаблицаПродажи.Порядок КАК Порядок,
	|	ТаблицаПродажи.Организация КАК Организация,
	|	ТаблицаПродажи.Номенклатура КАК Номенклатура,
	|	ТаблицаПродажи.Характеристика КАК Характеристика,
	|	ТаблицаПродажи.Партия КАК Партия,
	|	ТаблицаПродажи.Контрагент КАК Контрагент,
	|	ТаблицаПродажи.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаПродажи.Документ КАК Документ,
	|	ТаблицаПродажи.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаПродажи.Проект КАК Проект,
	|	ТаблицаПродажи.Подразделение КАК Подразделение,
	|	ТаблицаПродажи.Ответственный КАК Ответственный,
	|	ТаблицаПродажи.Количество КАК Количество,
	|	ТаблицаПродажи.СуммаНДС КАК СуммаНДС,
	|	ТаблицаПродажи.Сумма КАК Сумма,
	|	ТаблицаПродажи.ЭтоПодарок КАК ЭтоПодарок,
	|	ТаблицаПродажи.Себестоимость КАК Себестоимость
	|ПОМЕСТИТЬ втТаблицаПродажи
	|ИЗ
	|	&ТаблицаПродажи КАК ТаблицаПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапасыВВалюте.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыВВалюте.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасыВВалюте.ЗаказПродажи = НЕОПРЕДЕЛЕНО ИЛИ ТаблицаЗапасыВВалюте.ЗаказПродажи = NULL
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) 
	|		ИНАЧЕ ТаблицаЗапасыВВалюте.ЗаказПродажи 
	|	КОНЕЦ КАК ЗаказПродажи,
	|	ТаблицаЗапасыВВалюте.Порядок КАК Порядок,
	|	ТаблицаЗапасыВВалюте.СуммаВал КАК СуммаВал
	|ПОМЕСТИТЬ втТаблицаЗапасыВВалюте
	|ИЗ
	|	&ТаблицаЗапасыВВалюте КАК ТаблицаЗапасыВВалюте
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПродажи.Период КАК Период,
	|	ТаблицаПродажи.Организация КАК Организация,
	|	ТаблицаПродажи.Номенклатура КАК Номенклатура,
	|	ТаблицаПродажи.Характеристика КАК Характеристика,
	|	ТаблицаПродажи.Партия КАК Партия,
	|	ТаблицаПродажи.Контрагент КАК Контрагент,
	|	ТаблицаПродажи.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаПродажи.Документ КАК Документ,
	|	ТаблицаПродажи.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаПродажи.Проект КАК Проект,
	|	ТаблицаПродажи.Подразделение КАК Подразделение,
	|	ТаблицаПродажи.Ответственный КАК Ответственный,
	|	ТаблицаПродажи.Количество КАК Количество,
	|	ТаблицаПродажи.Сумма КАК Сумма,
	|	ВЫРАЗИТЬ(ТаблицаПродажи.Сумма * КурсУпрВалюты.Кратность / КурсУпрВалюты.Курс КАК ЧИСЛО(15, 2)) КАК СуммаВал,
	|	ТаблицаПродажи.СуммаНДС КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ТаблицаПродажи.СуммаНДС * КурсУпрВалюты.Кратность / КурсУпрВалюты.Курс КАК ЧИСЛО(15, 2)) КАК СуммаНДСВал,
	|	ТаблицаПродажи.ЭтоПодарок КАК ЭтоПодарок,
	|	ТаблицаПродажи.Себестоимость КАК Себестоимость,
	|	ТаблицаПродажи.Порядок КАК Порядок,
	|	ТаблицаЗапасыВВалюте.СуммаВал КАК СуммаВалЗапасы,
	|	ВЫБОР
	|		КОГДА ТаблицаПродажи.Порядок >= 99
	|			ТОГДА ТаблицаЗапасыВВалюте.СуммаВал
	|		ИНАЧЕ ТаблицаПродажи.Себестоимость
	|	КОНЕЦ КАК СебестоимостьВал
	|ИЗ
	|	втТаблицаПродажи КАК ТаблицаПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаЗапасыВВалюте КАК ТаблицаЗапасыВВалюте
	|		ПО ТаблицаПродажи.Номенклатура = ТаблицаЗапасыВВалюте.Номенклатура
	|			И ТаблицаПродажи.Характеристика = ТаблицаЗапасыВВалюте.Характеристика
	|			И ТаблицаПродажи.Порядок = ТаблицаЗапасыВВалюте.Порядок
	|			И ТаблицаПродажи.ЗаказПокупателя = ТаблицаЗапасыВВалюте.ЗаказПродажи,
	|	втКурсУпрВалюты КАК КурсУпрВалюты
	|ГДЕ
	|	КурсУпрВалюты.Курс > 0
	|	И КурсУпрВалюты.Кратность > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втТаблицаПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втТаблицаЗапасыВВалюте";
	
	Запрос.УстановитьПараметр("ТаблицаПродажи", СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажи); 
	Запрос.УстановитьПараметр("ТаблицаЗапасыВВалюте", СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте);

	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажиВВалюте", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры// Олег Литвиненко <---

Процедура СформироватьТаблицаЗапасыВРазрезеГТД(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки
	|	,ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	|	,ТаблицаЗапасыНаСкладах.Период КАК Период
	|	,ТаблицаЗапасыНаСкладах.Организация КАК Организация
	|	,ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура
	|	,ТаблицаЗапасыНаСкладах.Характеристика КАК Характеристика
	|	,ТаблицаЗапасыНаСкладах.Партия КАК Партия
	|	,ТаблицаЗапасыНаСкладах.НомерГТД КАК НомерГТД
	|	,ТаблицаЗапасыНаСкладах.СтранаПроисхождения КАК СтранаПроисхождения
	|	,СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|ГДЕ
	|	ТаблицаЗапасыНаСкладах.СтранаПроисхождения <> Значение(Справочник.СтраныМира.Россия)
	|	И ТаблицаЗапасыНаСкладах.СтранаПроисхождения <> Значение(Справочник.СтраныМира.ПустаяССылка)
	|	И ТаблицаЗапасыНаСкладах.НомерГТД <> Значение(Справочник.НомераГТД.ПустаяССылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период
	|	,ТаблицаЗапасыНаСкладах.Организация
	|	,ТаблицаЗапасыНаСкладах.Номенклатура
	|	,ТаблицаЗапасыНаСкладах.Характеристика
	|	,ТаблицаЗапасыНаСкладах.Партия
	|	,ТаблицаЗапасыНаСкладах.НомерГТД
	|	,ТаблицаЗапасыНаСкладах.СтранаПроисхождения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыВРазрезеГТД", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыПродажа(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	//--------------------------------------------------------------------------
	// © Шишка В.В. [17 августа 2021]  НАЧАЛО
	УчетСебестоимостиВРазрезеОрганизации = СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетСебестоимостиВРазрезеОрганизации;
	УправлениеНебольшойФирмойСервер.ВыполнитьКорректировкуВременнойТаблицыЗапасыПоУчетуВРазрезеОрганизаций(СтруктураДополнительныеСвойства);	
	// © Шишка В.В. [17 августа 2021]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	// Установка исключительной блокировки контролируемых остатков запасов.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти)
	|			ТОГДА ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы
	|		ИНАЧЕ ТаблицаЗапасы.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.Проект КАК Проект, //Малышев 2024-06-04 ONESOFT-3093
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаЗапасы.Организация КАК Организация,
	|		ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|		ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|		ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|		ТаблицаЗапасы.Характеристика КАК Характеристика,
	|		ТаблицаЗапасы.Партия КАК Партия,
	|		ТаблицаЗапасы.Проект КАК Проект, //Малышев 2024-06-04 ONESOFT-3093
	|		ВЫБОР
	|			КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				ТОГДА ТаблицаЗапасы.Заказ
	|			КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|					И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ТОГДА ТаблицаЗапасы.Заказ.ЗаказПокупателя
	|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОНЕЦ КАК ЗаказПокупателя,
	|		ТаблицаЗапасы.ПоложениеСклада КАК ПоложениеСклада,
	|		ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы КАК СтруктурнаяЕдиницаЗапасы
	|	ИЗ
	|		ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|	ГДЕ
	|		ТаблицаЗапасы.Заказ <> НЕОПРЕДЕЛЕНО
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаЗапасы.Организация,
	|		ТаблицаЗапасы.СтруктурнаяЕдиница,
	|		ТаблицаЗапасы.СчетУчета,
	|		ТаблицаЗапасы.СчетУчетаРегл,
	|		ТаблицаЗапасы.Номенклатура,
	|		ТаблицаЗапасы.Характеристика,
	|		ТаблицаЗапасы.Партия,
	|		ТаблицаЗапасы.Проект, //Малышев 2024-06-04 ONESOFT-3093
	|		ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
	|		ТаблицаЗапасы.ПоложениеСклада,
	|		ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы
	|	ИЗ
	|		ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы) КАК ТаблицаЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.Проект, //Малышев 2024-06-04 ONESOFT-3093
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти)
	|			ТОГДА ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы
	|		ИНАЧЕ ТаблицаЗапасы.СтруктурнаяЕдиница
	|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Запасы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	// Получение остатков запасов по стоимости.

	//Малышев 2024-06-16 ONESOFT-3094 (--
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗапасыОстатки.Организация КАК Организация,
	//|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	////|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	//|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	//|	ЗапасыОстатки.Характеристика КАК Характеристика,
	//|	ЗапасыОстатки.Партия КАК Партия,
	//|	ЗапасыОстатки.Проект КАК Проект, //Малышев 2024-06-04 ONESOFT-3093
	//|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	//|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток,
	//|	ЛОЖЬ КАК Резервирование,
	//|	ЗапасыОстатки.СчетУчетаРегл
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ЗапасыОстатки.Организация КАК Организация,
	//|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	////|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	//|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	//|		ЗапасыОстатки.Характеристика КАК Характеристика,
	//|		ЗапасыОстатки.Партия КАК Партия,
	//|		ЗапасыОстатки.Проект КАК Проект, //Малышев 2024-06-04 ONESOFT-3093
	//|		ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	//|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	//|		ЗапасыОстатки.СуммаОстаток КАК СуммаОстаток,
	//|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл
	//|	ИЗ
	//|		РегистрНакопления.Запасы.Остатки(
	//|				&МоментКонтроля,
	////|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	////|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, Проект, ЗаказПокупателя) В //Малышев 2024-06-04 ONESOFT-3093
	//|					(ВЫБРАТЬ
	//|						ТаблицаЗапасы.Организация КАК Организация,
	////|						ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	////+Lazare 12.09.2022
	//|						ВЫБОР
	//|							КОГДА ТаблицаЗапасы.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти)
	//|								ТОГДА ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы
	//|							ИНАЧЕ ТаблицаЗапасы.СтруктурнаяЕдиница
	//|						КОНЕЦ КАК СтруктурнаяЕдиница,	
	////+Lazare 12.09.2022
	////|						ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	//|						ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	//|						ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	//|						ТаблицаЗапасы.Характеристика КАК Характеристика,
	//|						ТаблицаЗапасы.Партия КАК Партия,
	//|						ТаблицаЗапасы.Проект КАК Проект, //Малышев 2024-06-04 ONESOFT-3093
	//|						ВЫБОР
	//|							КОГДА ТаблицаЗапасы.Заказ <> НЕОПРЕДЕЛЕНО
	//|								ТОГДА ВЫБОР
	//|										КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	//|											ТОГДА ТаблицаЗапасы.Заказ
	//|										КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	//|												И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	//|											ТОГДА ТаблицаЗапасы.Заказ.ЗаказПокупателя
	//|										ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//|									КОНЕЦ
	//|							ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//|						КОНЕЦ КАК ЗаказПокупателя
	//|					ИЗ
	//|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	//|					ГДЕ
	//|						ВЫБОР
	//|							КОГДА ТаблицаЗапасы.Заказ <> НЕОПРЕДЕЛЕНО
	//|								ТОГДА ВЫБОР
	//|										КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	//|											ТОГДА ТаблицаЗапасы.Заказ
	//|										КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	//|												И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	//|											ТОГДА ТаблицаЗапасы.Заказ.ЗаказПокупателя
	//|										ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//|									КОНЕЦ
	//|							ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//|						КОНЕЦ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//|				
	//|					ОБЪЕДИНИТЬ ВСЕ
	//|				
	//|					ВЫБРАТЬ
	//|						ТаблицаЗапасы.Организация,
	////|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	////+Lazare 12.09.2022
	//|  						ВЫБОР
	//|           				КОГДА ТаблицаЗапасы.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти)
	//|                   			 ТОГДА ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы
	//|            				ИНАЧЕ ТаблицаЗапасы.СтруктурнаяЕдиница
	//|    					КОНЕЦ,
	////+Lazare 12.09.2022
	////|						ТаблицаЗапасы.СчетУчета,
	//|						ТаблицаЗапасы.СчетУчетаРегл, //+++ Дмгг
	//|						ТаблицаЗапасы.Номенклатура,
	//|						ТаблицаЗапасы.Характеристика,
	//|						ТаблицаЗапасы.Партия,
	//|						ТаблицаЗапасы.Проект, //Малышев 2024-06-04 ONESOFT-3093
	//|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//|					ИЗ
	//|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки) КАК ЗапасыОстатки
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗапасыОстатки.Организация,
	//|	ЗапасыОстатки.СтруктурнаяЕдиница,
	////|	ЗапасыОстатки.СчетУчета,
	//|	ЗапасыОстатки.Номенклатура,
	//|	ЗапасыОстатки.Характеристика,
	//|	ЗапасыОстатки.Партия,
	//|	ЗапасыОстатки.Проект, //Малышев 2024-06-04 ONESOFT-3093
	//|	ЗапасыОстатки.ЗаказПокупателя,
	//|	ЗапасыОстатки.СчетУчетаРегл";  
	//
	//Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходнаяНакладная);
	//Запрос.УстановитьПараметр("МоментКонтроля", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Исключая));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ТаблицаЗапасыОстатки = РезультатЗапроса.Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	""товары из свободного остатка"" как ВидДвижения,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.Проект КАК Проект,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы_ДляПродажи
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	(ТаблицаЗапасы.Количество - ТаблицаЗапасы.Резерв) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""товары с указанием заказа резерва"",
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.Проект,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.Заказ <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|						ТОГДА ТаблицаЗапасы.Заказ
	|					КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|							И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|						ТОГДА ТаблицаЗапасы.Заказ.ЗаказПокупателя
	|					ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ            
	|	ТаблицаЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И ТаблицаЗапасы.Резерв > 0";
	
	Запрос.Выполнить();
	
	//ТаблицаЗапасыОстатки = УправлениеНебольшойФирмойСервер.ПолучитьОстаткиЗапасовПоСтоимостиПриПроведении(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства,,"ВременнаяТаблицаЗапасы_ДляПродажи").Выгрузить(); 
	ТаблицаЗапасыОстатки = УправлениеНебольшойФирмойСервер.ПолучитьОстаткиЗапасовПоСтоимостиПриПроведении(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства,,"ВременнаяТаблицаЗапасы_ДляПродажи",,,Ложь).Выгрузить(); //Малышев 2025-12-22 ES4001-107
	//Малышев 2024-06-16 ONESOFT-3094 --)
	
	
	
	
	// Kuzmich, 11.01.2020, Подбор цены и себестоимости для отрицательных остатков
	Если Константы.ПодборЦеныДляОтрицательныхОстатков.Получить() Тогда
		//Малышев 2024-06-16 ONESOFT-3094 - перенес в отдельный модуль
		 УправлениеНебольшойФирмойСервер.ДополнитьТаблицуОстатков_ПодборЦеныДляОтрицательныхОстатков(ТаблицаЗапасыОстатки, СтруктураДополнительныеСвойства, ДокументСсылкаРасходнаяНакладная);	
 	КонецЕсли;
	// Kuzmich, 11.01.2020, Подбор цены и себестоимости для отрицательных остатков   
	
	
	//ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,Номенклатура,Характеристика,Партия,ЗаказПокупателя");
	ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия,ЗаказПокупателя");
	
	ТаблицаЗапасыОстаткиПодРезерв = ТаблицаЗапасыОстатки.Скопировать();
	Если СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда 
		
		ТекстЗапроса = ПолучитьТекстЗапросаБезФильтрЗаказов();
		
		Запрос.Текст = ТекстЗапроса;
		ТаблицаЗапасыОстаткиПодРезерв = Запрос.Выполнить().Выгрузить();
		
		//ТаблицаЗапасыОстаткиПодРезерв.Свернуть("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,Номенклатура,Характеристика,Партия","КоличествоОстаток,СуммаОстаток");
		//ТаблицаЗапасыОстаткиПодРезерв.Свернуть("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия","КоличествоОстаток,СуммаОстаток");
		//ТаблицаЗапасыОстаткиПодРезерв.Свернуть("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия, Проект","КоличествоОстаток,СуммаОстаток");  //Малышев 2024-06-04 ONESOFT-3093
		ТаблицаЗапасыОстаткиПодРезерв.Свернуть("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия, Проект, ДокументПоступления","КоличествоОстаток,СуммаОстаток");  //Малышев 2024-19 ONESOFT-3602
		
	КонецЕсли;
	
	Передача = (ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию
				ИЛИ ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку
				ИЛИ ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение);
	
	ВременнаяТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.СкопироватьКолонки();
	ВременнаяТаблицаЗапасы.Колонки.Добавить("ДокументПоступления");
	
	МассивСчетовДтРегл = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.ВыгрузитьКолонку("СчетДтРегл");
	МассивСчетовКтРегл = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.ВыгрузитьКолонку("СчетКтРегл");
	СтруктураСчетовРегл = ПолучитьСтруктуруДТРегл(МассивСчетовДтРегл, МассивСчетовКтРегл, ДокументСсылкаРасходнаяНакладная);
	
	ФункционалСбораТоваров = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалСбораТоваров");
	
	Для н = 0 По СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Количество() - 1 Цикл
		
		СтрокаТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы[н];
		СтруктураДляПоиска = УправлениеНебольшойФирмойСервер.ПолучитьСтруктуруДляПоиска(СтрокаТаблицаЗапасы, СтруктураДополнительныеСвойства);

		//КоличествоТребуетсяРезерв = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.Резерв), СтрокаТаблицаЗапасы.Резерв, 0);
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		Если Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() Тогда
			КоличествоТребуетсяРезерв = 0;
		Иначе
			КоличествоТребуетсяРезерв = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.Резерв), СтрокаТаблицаЗапасы.Резерв, 0);
		КонецЕсли;
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		КоличествоТребуетсяСвободныйОстаток = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.Количество), СтрокаТаблицаЗапасы.Количество, 0);
		КоличествоТребуетсяВсего = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.Количество), СтрокаТаблицаЗапасы.Количество, 0);
		
		СебестоимостьЕдиницы = 0; //+++ Дмгг
		
		Если КоличествоТребуетсяРезерв > 0 Тогда
			
			КоличествоТребуетсяСвободныйОстаток = КоличествоТребуетсяСвободныйОстаток - КоличествоТребуетсяРезерв;
			
			//СтруктураДляПоиска.Вставить("ЗаказПокупателя", СтрокаТаблицаЗапасы.ЗаказПокупателя);  //+++ Дмгг
			Если НЕ СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда 
				
				СтруктураДляПоиска.Вставить("ЗаказПокупателя", СтрокаТаблицаЗапасы.ЗаказПокупателя);
				
			КонецЕсли;
			//--- Дмгг
			
			МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска); //+++ Дмгг
			//МассивСтрокОстатков = ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
			
			КоличествоОстаток = 0;
			СуммаОстаток = 0;
			
			Если МассивСтрокОстатков.Количество() > 0 Тогда
				КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
				СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток;
			КонецЕсли;
			
			Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуетсяРезерв Тогда
				
				СуммаКСписанию = Окр(СуммаОстаток * КоличествоТребуетсяРезерв / КоличествоОстаток , 2, 1);
				
				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуетсяРезерв;
				МассивСтрокОстатков[0].СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток - СуммаКСписанию;
				
			ИначеЕсли КоличествоОстаток = КоличествоТребуетсяРезерв Тогда
				
				СуммаКСписанию = СуммаОстаток;
				
				МассивСтрокОстатков[0].КоличествоОстаток = 0;
				МассивСтрокОстатков[0].СуммаОстаток = 0;
				
			Иначе
				СуммаКСписанию = 0;
			КонецЕсли;
			
			//+++ Дмгг
			// добавим себестоимость что бы обнулялся заказ
			СуммаКСписаниюКорр = 0;
			Если СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда
				
				СтруктураДляПоиска.Удалить("ЗаказПокупателя");
				
				МассивСтрокОстатковКорректировкиСебестоимости = ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
				
				КоличествоОстатокКорр = 0;
				СуммаОстатокКорр = 0;
				СебестоимостьЕдиницы = 0;
				
				Если МассивСтрокОстатковКорректировкиСебестоимости.Количество() > 0 Тогда
					КоличествоОстатокКорр = МассивСтрокОстатковКорректировкиСебестоимости[0].КоличествоОстаток;
					СуммаОстатокКорр = МассивСтрокОстатковКорректировкиСебестоимости[0].СуммаОстаток;
				КонецЕсли;
				//+++ Дмгг
				Если СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости И КоличествоОстатокКорр <> 0 И КоличествоТребуетсяВсего  <> 0 Тогда
					СебестоимостьЕдиницы = Окр(Окр(СуммаОстатокКорр * КоличествоТребуетсяВсего / КоличествоОстатокКорр , 2, 1) / КоличествоТребуетсяВсего, 3, 1);
				КонецЕсли;
				//+++ Дмгг
				Если КоличествоОстатокКорр > 0 И КоличествоОстатокКорр > КоличествоТребуетсяРезерв Тогда
					                                //+++ Дмгг Себ
					СуммаКСписаниюКорр = ?(СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости И СебестоимостьЕдиницы <> 0, Окр(СебестоимостьЕдиницы * КоличествоТребуетсяРезерв, 2, 1)
											,Окр(СуммаОстатокКорр * КоличествоТребуетсяРезерв / КоличествоОстатокКорр , 2, 1));//Окр(СуммаОстатокКорр * КоличествоТребуетсяРезерв / КоличествоОстатокКорр , 2, 1);
					
					МассивСтрокОстатковКорректировкиСебестоимости[0].КоличествоОстаток = МассивСтрокОстатковКорректировкиСебестоимости[0].КоличествоОстаток - КоличествоТребуетсяРезерв;
					МассивСтрокОстатковКорректировкиСебестоимости[0].СуммаОстаток = МассивСтрокОстатковКорректировкиСебестоимости[0].СуммаОстаток - СуммаКСписаниюКорр;
					
				ИначеЕсли КоличествоОстатокКорр = КоличествоТребуетсяРезерв Тогда
					
					СуммаКСписаниюКорр = СуммаОстатокКорр;
					
					МассивСтрокОстатковКорректировкиСебестоимости[0].КоличествоОстаток = 0;
					МассивСтрокОстатковКорректировкиСебестоимости[0].СуммаОстаток = 0;
					
				Иначе
					СуммаКСписаниюКорр = 0;
				КонецЕсли;
				//	
				СуммаПровдки =  СуммаКСписаниюКорр - СуммаКСписанию;
				
				СтрокаТаблицыРасходДляСебестоимости = ВременнаяТаблицаЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасходДляСебестоимости, СтрокаТаблицаЗапасы);
				//	
				
				ПериодПроводкиКорректировки = СтрокаТаблицыРасходДляСебестоимости.Период;
				Если ЗначениеЗаполнено(СтрокаТаблицаЗапасы.ЗаказПокупателя) Тогда 
					Если ФункционалСбораТоваров И ЗначениеЗаполнено(СтрокаТаблицаЗапасы.ЗаказПокупателя.ДатаКонцаСобран) Тогда 
						ПериодПроводкиКорректировки = СтрокаТаблицаЗапасы.ЗаказПокупателя.ДатаКонцаСобран;
					ИначеЕсли ФункционалСбораТоваров Тогда 
						ПериодПроводкиКорректировки = СтрокаТаблицаЗапасы.ЗаказПокупателя.Дата;
					ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицаЗапасы.ЗаказПокупателя) Тогда 
						ПериодПроводкиКорректировки = СтрокаТаблицаЗапасы.ЗаказПокупателя.Дата;
					КонецЕсли;
				КонецЕсли;
				
				СтрокаТаблицыРасходДляСебестоимости.ВидДвижения = ВидДвиженияНакопления.Расход;
				СтрокаТаблицыРасходДляСебестоимости.Сумма = СуммаКСписаниюКорр;
				СтрокаТаблицыРасходДляСебестоимости.Количество = 0; // количество уже было сделанов заказе
				СтрокаТаблицыРасходДляСебестоимости.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
				СтрокаТаблицыРасходДляСебестоимости.Период = ПериодПроводкиКорректировки;//?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.ЗаказПокупателя), СтрокаТаблицаЗапасы.ЗаказПокупателя.Дата, СтрокаТаблицыРасходДляСебестоимости.Период);
				СтрокаТаблицыРасходДляСебестоимости.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ЗаказПокупателя.СтруктурнаяЕдиницаРезерв;
				СтрокаТаблицыРасходДляСебестоимости.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ЗаказПокупателя.СтруктурнаяЕдиницаРезерв;//СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
				СтрокаТаблицыРасходДляСебестоимости.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
				СтрокаТаблицыРасходДляСебестоимости.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
				СтрокаТаблицыРасходДляСебестоимости.КоррЗаказПокупателя = СтрокаТаблицаЗапасы.ЗаказПокупателя;
				СтрокаТаблицыРасходДляСебестоимости.ЗаказПродажи = Документы.ЗаказПокупателя.ПустаяСсылка();
				СтрокаТаблицыРасходДляСебестоимости.ДокументПродажи  = Неопределено;
				СтрокаТаблицыРасходДляСебестоимости.Подразделение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
				СтрокаТаблицыРасходДляСебестоимости.Ответственный = Справочники.Сотрудники.ПустаяСсылка();
				СтрокаТаблицыРасходДляСебестоимости.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
				СтрокаТаблицыРасходДляСебестоимости.СодержаниеПроводки = НСтр("ka='მარაგების რეზერვირება';ru='Резервирование запасов';en='inventory reservations'");
				СтрокаТаблицыРасходДляСебестоимости.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗаказНаПродажу;
				СтрокаТаблицыРасходДляСебестоимости.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
				СтрокаТаблицыРасходДляСебестоимости.Резервирование = Истина;
			////	
				СтрокаТаблицыПриход = ВременнаяТаблицаЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриход, СтрокаТаблицаЗапасы);
				
				СтрокаТаблицыПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
				СтрокаТаблицыПриход.Сумма = СуммаКСписаниюКорр;
				СтрокаТаблицыПриход.Количество = 0; // количество уже было сделанов заказе
				СтрокаТаблицыПриход.Период = ПериодПроводкиКорректировки;//?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.ЗаказПокупателя), СтрокаТаблицаЗапасы.ЗаказПокупателя.Дата, СтрокаТаблицыПриход.Период);
				СтрокаТаблицыПриход.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ЗаказПокупателя.СтруктурнаяЕдиницаРезерв;
				СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ЗаказПокупателя.СтруктурнаяЕдиницаРезерв;//СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
				СтрокаТаблицыПриход.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
				СтрокаТаблицыПриход.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
				СтрокаТаблицыПриход.КоррЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
				СтрокаТаблицыПриход.ЗаказПродажи = Документы.ЗаказПокупателя.ПустаяСсылка();
				СтрокаТаблицыПриход.ДокументПродажи  = Неопределено;
				СтрокаТаблицыПриход.Подразделение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
				СтрокаТаблицыПриход.Ответственный = Справочники.Сотрудники.ПустаяСсылка();
				СтрокаТаблицыПриход.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
				СтрокаТаблицыПриход.СодержаниеПроводки = НСтр("ka='მარაგების რეზერვირება';ru='Резервирование запасов';en='inventory reservations'");
				СтрокаТаблицыПриход.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗаказНаПродажу;
				СтрокаТаблицыПриход.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
				СтрокаТаблицыПриход.Резервирование = Истина;
			//	
			КонецЕсли;
			//--- Дмгг
			
			// Расход. Запасы.
			СтрокаТаблицыРасход = ВременнаяТаблицаЗапасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
			
			СтрокаТаблицыРасход.Сумма = ?(СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости, СуммаКСписаниюКорр, СуммаКСписанию);
			СтрокаТаблицыРасход.Количество = КоличествоТребуетсяРезерв;
			// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
			ТекущаяСуммаПотерь = 0;
			Если ПолучитьФункционалРезервированияЗаказов() И Константы_German_Butcher_Получить()
				И СтрокаТаблицаЗапасы.КоличествоСобрПотери>0 И ЗначениеЗаполнено(СтрокаТаблицаЗапасы.СчетУчетаПотерь) Тогда
				
				ТекущаяСуммаСебестоимости = СтрокаТаблицыРасход.Сумма;
				ТекущееКоличествоСебестоимости = СтрокаТаблицыРасход.Количество;
					
				ТекущаяСуммаПотерь = (СтрокаТаблицаЗапасы.КоличествоСобрПотери * ТекущаяСуммаСебестоимости) / ТекущееКоличествоСебестоимости;
				
				СтрокаТаблицыРасход1 = ВременнаяТаблицаЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход1, СтрокаТаблицаЗапасы);
				
				СтрокаТаблицыРасход1.Сумма = ТекущаяСуммаПотерь;
				СтрокаТаблицыРасход1.Количество = СтрокаТаблицаЗапасы.КоличествоСобрПотери;
				СтрокаТаблицыРасход1.СчетУчетаЗатратРегл = СтрокаТаблицаЗапасы.СчетУчетаПотерь;
				
			КонецЕсли;
			// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
		
			// Сформируем проводки.
			//+++ Дмгг
			//Если Окр(СуммаКСписанию, 2, 1) <> 0 Тогда
			Если (Окр(СуммаКСписанию, 2, 1) <> 0 И НЕ СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости) 
				ИЛИ (Окр(СуммаКСписаниюКорр, 2, 1) <> 0 И СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости)Тогда
				
				СтрокаТаблицаУправленческий = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаУправленческий, СтрокаТаблицаЗапасы);
				СтрокаТаблицаУправленческий.Сумма = СуммаКСписаниюКорр;//СуммаКСписанию;
				
				СтрокаТаблицаХозрасчетный = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаХозрасчетный, СтрокаТаблицаЗапасы);
				СтрокаТаблицаХозрасчетный.СчетДт = СтрокаТаблицаЗапасы.СчетДтРегл;
				СтрокаТаблицаХозрасчетный.СчетКт = СтрокаТаблицаЗапасы.СчетКтРегл;
				
				Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетный.СчетДт) И СтрокаТаблицаХозрасчетный.СчетДт.Количественный Тогда
					СтрокаТаблицаХозрасчетный.КоличествоДт = КоличествоТребуетсяРезерв; //+++ Дмгг СтрокаТаблицаЗапасы.Количество;
				КонецЕсли; 
				Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетный.СчетКт) И СтрокаТаблицаХозрасчетный.СчетКт.Количественный Тогда
					СтрокаТаблицаХозрасчетный.КоличествоКт = КоличествоТребуетсяРезерв; //+++ Дмгг СтрокаТаблицаЗапасы.Количество;
				КонецЕсли; 
				
				//ПодольскийАИ #ПодстановкаСубконто 10.04.2022 {Начало
				//Было---
				//СтрокаТаблицаХозрасчетный.ВидСубконтоДт1 = "Подразделения";
				//СтрокаТаблицаХозрасчетный.ВидСубконтоДт2 = "Номенклатура";
				//СтрокаТаблицаХозрасчетный.ВидСубконтоДт3 = "ХарактеристикиНоменклатуры";
				//
				//СтрокаТаблицаХозрасчетный.ВидСубконтоКт1 = "Склады";
				//СтрокаТаблицаХозрасчетный.ВидСубконтоКт2 = "Номенклатура";
				//СтрокаТаблицаХозрасчетный.ВидСубконтоКт3 = "ХарактеристикиНоменклатуры";
				//
				//СтрокаТаблицаХозрасчетный.СубконтоДт1 = СтрокаТаблицаЗапасы.Подразделение;
				//СтрокаТаблицаХозрасчетный.СубконтоДт2 = СтрокаТаблицаЗапасы.Номенклатура;
				//СтрокаТаблицаХозрасчетный.СубконтоДт3 = СтрокаТаблицаЗапасы.Характеристика;
				//
				//СтрокаТаблицаХозрасчетный.СубконтоКт1 = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.СтруктурнаяЕдиница), СтрокаТаблицаЗапасы.СтруктурнаяЕдиница, СтрокаТаблицаЗапасы.Контрагент);//СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
				//СтрокаТаблицаХозрасчетный.СубконтоКт2 = СтрокаТаблицаЗапасы.Номенклатура;
				//СтрокаТаблицаХозрасчетный.СубконтоКт3 = СтрокаТаблицаЗапасы.Характеристика;
				//Стало+++
				
				СтрокаТаблицаХозрасчетный.ВидСубконтоДт1 = СтруктураСчетовРегл.СоответствиеСчетов[СтрокаТаблицаЗапасы.СчетДтРегл]["ВидСубконто1"];//"Подразделения";
				СтрокаТаблицаХозрасчетный.ВидСубконтоДт2 = СтруктураСчетовРегл.СоответствиеСчетов[СтрокаТаблицаЗапасы.СчетДтРегл]["ВидСубконто2"];//"Номенклатура";
				СтрокаТаблицаХозрасчетный.ВидСубконтоДт3 = СтруктураСчетовРегл.СоответствиеСчетов[СтрокаТаблицаЗапасы.СчетДтРегл]["ВидСубконто3"];//"ХарактеристикиНоменклатуры";
				
				СтрокаТаблицаХозрасчетный.ВидСубконтоКт1 = СтруктураСчетовРегл.СоответствиеСчетов[СтрокаТаблицаЗапасы.СчетКтРегл]["ВидСубконто1"];//"Склады";
				СтрокаТаблицаХозрасчетный.ВидСубконтоКт2 = СтруктураСчетовРегл.СоответствиеСчетов[СтрокаТаблицаЗапасы.СчетКтРегл]["ВидСубконто2"];//"Номенклатура";
				СтрокаТаблицаХозрасчетный.ВидСубконтоКт3 = СтруктураСчетовРегл.СоответствиеСчетов[СтрокаТаблицаЗапасы.СчетКтРегл]["ВидСубконто3"];//"ХарактеристикиНоменклатуры";
				
				Для Сч = 1 По 3 Цикл 
					
					Если СтрокаТаблицаХозрасчетный["ВидСубконтоДт"+Сч] = "" Тогда 
						// нет субконто в счете
						Продолжить;
					КонецЕсли;
					
					//СтруктураСчетовРегл.СтруктураСубконтоДт
					Если СтрокаТаблицаЗапасы.Документ.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику 
						И СтрокаТаблицаХозрасчетный["ВидСубконтоДт"+Сч] = "Подразделения" Тогда
						//временнаяТаблицаЗапасы
						//--------------------------------------------------------------------------
						// © Шишка В.В. [23 января 2022 г.]  НАЧАЛО
						//Кривое решение обращениея по индексу к таблице "временнаяТаблицаЗапасы"
						//Номера таблиц в пакете запроса изменён!  таблицу надо искать по имени! Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("ВременнаяТаблицаЗапасы")
						//МассивСтрокПоиска = Запрос.МенеджерВременныхТаблиц.Таблицы[10].ПолучитьДанные().Выгрузить().НайтиСтроки(Новый Структура("НомерСтроки",СтрокаТаблицаЗапасы.НомерСтроки));
						МассивСтрокПоиска = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("ВременнаяТаблицаЗапасы").ПолучитьДанные().Выгрузить().НайтиСтроки(Новый Структура("НомерСтроки",СтрокаТаблицаЗапасы.НомерСтроки));
						// © Шишка В.В. [23 января 2022 г.]  КОНЕЦ
						//--------------------------------------------------------------------------
						Если МассивСтрокПоиска.Количество() <> 0 Тогда 
							СтрокаТаблицаХозрасчетный.СубконтоДт1 = МассивСтрокПоиска[0].СтруктурнаяЕдиницаБезвозмезднойПродажи;
						КонецЕсли;
						Продолжить;
					КонецЕсли;
					
					НаименованиеПоля = СтруктураСчетовРегл.СтруктураСубконтоДт[СтрокаТаблицаХозрасчетный["ВидСубконтоДт"+Сч]];
					Если НаименованиеПоля = "" Тогда 
						Продолжить;
					КонецЕсли;
					
					Если ТипЗнч(НаименованиеПоля) = Тип("Строка") Тогда 
						ЗначениеПодстановки = СтрокаТаблицаЗапасы[НаименованиеПоля];
					Иначе
						ЗначениеПодстановки = НаименованиеПоля;
					КонецЕсли;
					
					СтрокаТаблицаХозрасчетный["СубконтоДт"+Сч] = ЗначениеПодстановки;
					
				КонецЦикла;
				
				Для Сч =1 По 3 Цикл 
					
					Если СтрокаТаблицаХозрасчетный["ВидСубконтоКт"+Сч] = "" Тогда 
						// нет субконто в счете
						Продолжить;
					КонецЕсли;
					
					Если СтрокаТаблицаХозрасчетный["ВидСубконтоКт"+Сч] = "Подразделения" Тогда 
						СтрокаТаблицаХозрасчетный["СубконтоКт"+Сч] = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.СтруктурнаяЕдиница), СтрокаТаблицаЗапасы.СтруктурнаяЕдиница, СтрокаТаблицаЗапасы.Контрагент);
						Продолжить;
					КонецЕсли;
					
					НаименованиеПоля = СтруктураСчетовРегл.СтруктураСубконтоКт[СтрокаТаблицаХозрасчетный["ВидСубконтоКт"+Сч]];
					Если НаименованиеПоля = "" Тогда 
						Продолжить;
					КонецЕсли;
					
					Если ТипЗнч(НаименованиеПоля) = Тип("Строка") Тогда 
						ЗначениеПодстановки = СтрокаТаблицаЗапасы[НаименованиеПоля];
					Иначе
						ЗначениеПодстановки = НаименованиеПоля;
					КонецЕсли;
					
					СтрокаТаблицаХозрасчетный["СубконтоКт"+Сч] = ЗначениеПодстановки;
					
				КонецЦикла;
				//ПодольскийАИ #ПодстановкаСубконто 10.04.2022 Конец}
				
				СтрокаТаблицаХозрасчетный.Сумма =  ?(СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости, СуммаКСписаниюКорр, СуммаКСписанию); //СуммаКСписанию;
				
				// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
				Если ПолучитьФункционалРезервированияЗаказов() И Константы_German_Butcher_Получить()
					И СтрокаТаблицаЗапасы.КоличествоСобрПотери>0 И ЗначениеЗаполнено(СтрокаТаблицаЗапасы.СчетУчетаПотерь) Тогда
					ТекущаяСуммаСебестоимости = СтрокаТаблицаХозрасчетный.Сумма;
					ТекущееКоличествоСебестоимости = СтрокаТаблицаХозрасчетный.КоличествоКт;
					
					ТекущаяСуммаПотерь = (СтрокаТаблицаЗапасы.КоличествоСобрПотери * ТекущаяСуммаСебестоимости) / ТекущееКоличествоСебестоимости;
					
					СтрокаТаблицаХозрасчетный1 = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицаХозрасчетный1, СтрокаТаблицаЗапасы);
					
					СтрокаТаблицаХозрасчетный1.СчетДт = СтрокаТаблицаЗапасы.СчетУчетаПотерь;
					СтрокаТаблицаХозрасчетный1.СчетКт = СтрокаТаблицаХозрасчетный.СчетКт;
					
					Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетный1.СчетДт) И СтрокаТаблицаХозрасчетный1.СчетДт.Количественный Тогда
						СтрокаТаблицаХозрасчетный1.КоличествоДт = СтрокаТаблицаЗапасы.КоличествоСобрПотери;
					КонецЕсли; 
					Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетный1.СчетКт) И СтрокаТаблицаХозрасчетный1.СчетКт.Количественный Тогда
						СтрокаТаблицаХозрасчетный1.КоличествоКт = СтрокаТаблицаЗапасы.КоличествоСобрПотери;
					КонецЕсли;
					
					СтрокаТаблицаХозрасчетный1.ВидСубконтоДт1 = "Подразделения";
					СтрокаТаблицаХозрасчетный1.ВидСубконтоДт2 = "Номенклатура";
					СтрокаТаблицаХозрасчетный1.ВидСубконтоДт3 = "ХарактеристикиНоменклатуры";
					
					СтрокаТаблицаХозрасчетный1.ВидСубконтоКт1 = "Склады";
					СтрокаТаблицаХозрасчетный1.ВидСубконтоКт2 = "Номенклатура";
					СтрокаТаблицаХозрасчетный1.ВидСубконтоКт3 = "ХарактеристикиНоменклатуры";
					
					СтрокаТаблицаХозрасчетный1.СубконтоДт1 = СтрокаТаблицаЗапасы.Подразделение;
					СтрокаТаблицаХозрасчетный1.СубконтоДт2 = СтрокаТаблицаЗапасы.Номенклатура;
					СтрокаТаблицаХозрасчетный1.СубконтоДт3 = СтрокаТаблицаЗапасы.Характеристика;
					
					СтрокаТаблицаХозрасчетный1.СубконтоКт1 = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.СтруктурнаяЕдиница), СтрокаТаблицаЗапасы.СтруктурнаяЕдиница, СтрокаТаблицаЗапасы.Контрагент);//СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
					СтрокаТаблицаХозрасчетный1.СубконтоКт2 = СтрокаТаблицаЗапасы.Номенклатура;
					СтрокаТаблицаХозрасчетный1.СубконтоКт3 = СтрокаТаблицаЗапасы.Характеристика;
					
					СтрокаТаблицаХозрасчетный1.Сумма =  ТекущаяСуммаПотерь;
					
					СтрокаТаблицаХозрасчетный1.Содержание = НСтр("ka='დანაკარგის ჩამოწერა';ru='Списание потерь';en='დანაკარგის ჩამოწერა'");
				
				КонецЕсли;
				// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
			КонецЕсли;
			
			Если Передача Тогда
				
				// Приход.
				СтрокаТаблицыПриход = ВременнаяТаблицаЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриход, СтрокаТаблицаЗапасы,,"СтруктурнаяЕдиница, КоррСтруктурнаяЕдиница");
				
				СтрокаТаблицыПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
				
				
				СтрокаТаблицыПриход.Организация = СтрокаТаблицаЗапасы.КоррОрганизация;
				СтрокаТаблицыПриход.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
				СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
				СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
				СтрокаТаблицыПриход.Номенклатура = СтрокаТаблицаЗапасы.КоррНоменклатура;
				СтрокаТаблицыПриход.Характеристика = СтрокаТаблицаЗапасы.КоррХарактеристика;
				СтрокаТаблицыПриход.Партия = СтрокаТаблицаЗапасы.КоррПартия;
				
				СтрокаТаблицыПриход.КоррОрганизация = СтрокаТаблицаЗапасы.Организация;
				СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
				СтрокаТаблицыПриход.КоррСчетУчета = СтрокаТаблицаЗапасы.СчетУчета;
				СтрокаТаблицыПриход.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
				СтрокаТаблицыПриход.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
				СтрокаТаблицыПриход.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
				СтрокаТаблицыПриход.КоррПартия = СтрокаТаблицаЗапасы.Партия;
			
				СтрокаТаблицыПриход.Сумма = СуммаКСписанию;
				СтрокаТаблицыПриход.Количество = КоличествоТребуетсяРезерв;
				
				СтрокаТаблицыПриход.СодержаниеПроводки = НСтр("ka='მარაგების გადაცემა';ru='Передача запасов';en='Transferring reserves'"); 
				
				СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
				СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
				
			Иначе
				
				Если СтрокаТаблицаЗапасы.ТоварыНаКомиссии Тогда
				
				ИначеЕсли (Окр(СуммаКСписанию, 2, 1) <> 0 И НЕ СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости) 
					ИЛИ (Окр(СуммаКСписаниюКорр, 2, 1) <> 0 И СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости) Тогда
					
					// Продвигаем доходы и расходы.
					СтрокаДоходыИРасходы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДоходыИРасходы, СтрокаТаблицаЗапасы);
					
					СтрокаДоходыИРасходы.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ПодразделениеПродажи;
					СтрокаДоходыИРасходы.СчетУчета = СтрокаТаблицаЗапасы.СчетУчетаСебестоимость;
					СтрокаДоходыИРасходы.СчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаСебестоимостьРегл;
					СтрокаДоходыИРасходы.СуммаДоходов = 0;
					СтрокаДоходыИРасходы.СуммаРасходов =  ?(СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости, СуммаКСписаниюКорр, СуммаКСписанию); //СуммаКСписанию; //+++ Дмгг
					СтрокаДоходыИРасходы.Сумма =  ?(СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости, СуммаКСписаниюКорр, СуммаКСписанию); //СуммаКСписанию; //+++ Дмгг
					
					СтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
					
					// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
					Если ПолучитьФункционалРезервированияЗаказов() И Константы_German_Butcher_Получить()
						И СтрокаТаблицаЗапасы.КоличествоСобрПотери>0 И ЗначениеЗаполнено(СтрокаТаблицаЗапасы.СчетУчетаПотерь) И ТекущаяСуммаПотерь>0 Тогда
						
						СтрокаДоходыИРасходы1 = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаДоходыИРасходы1, СтрокаТаблицаЗапасы);
						
						СтрокаДоходыИРасходы1.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ПодразделениеПродажи;
						СтрокаДоходыИРасходы1.СчетУчета = СтрокаТаблицаЗапасы.СчетУчетаСебестоимость;
						СтрокаДоходыИРасходы1.СчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаПотерь;
						СтрокаДоходыИРасходы1.СуммаДоходов = 0;
						СтрокаДоходыИРасходы1.СуммаРасходов =  ТекущаяСуммаПотерь;
						
						СтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
						
					КонецЕсли;
					// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
					
				КонецЕсли;
				
				Если (Окр(СуммаКСписанию, 2, 1) <> 0 И НЕ СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости) 
						ИЛИ (Окр(СуммаКСписаниюКорр, 2, 1) <> 0 И СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости) Тогда
				
					// Продвигаем себестоимость продаж.
					СтрокаПродажи = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажи.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаПродажи, СтрокаТаблицаЗапасы);
					СтрокаПродажи.Порядок = 99;
					СтрокаПродажи.Количество = 0;
					СтрокаПродажи.Сумма = 0;
					СтрокаПродажи.СуммаНДС = 0;
					СтрокаПродажи.Себестоимость =   ?(СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости, СуммаКСписаниюКорр, СуммаКСписанию); //СуммаКСписанию;//+++ Дмгг
					
					// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
					Если ПолучитьФункционалРезервированияЗаказов() И Константы_German_Butcher_Получить()
						И СтрокаТаблицаЗапасы.КоличествоСобрПотери>0 И ЗначениеЗаполнено(СтрокаТаблицаЗапасы.СчетУчетаПотерь) И ТекущаяСуммаПотерь>0 Тогда
						
						СтрокаПродажи1 = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажи.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаПродажи1, СтрокаТаблицаЗапасы);
						СтрокаПродажи1.Порядок = 99;
						СтрокаПродажи1.Количество = СтрокаТаблицаЗапасы.КоличествоСобрПотери;
						СтрокаПродажи1.Сумма = 0;
						СтрокаПродажи1.СуммаНДС = 0;
						СтрокаПродажи1.Себестоимость = ТекущаяСуммаПотерь;
						
					КонецЕсли;
					// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если КоличествоТребуетсяСвободныйОстаток > 0 Тогда
			
			//СтруктураДляПоиска.Вставить("ЗаказПокупателя", Документы.ЗаказПокупателя.ПустаяСсылка());  //+++ Дмгг
			
			//МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
			Если НЕ СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда 
				
				СтруктураДляПоиска.Вставить("ЗаказПокупателя", Документы.ЗаказПокупателя.ПустаяСсылка());
				МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
				
			Иначе
				МассивСтрокОстатков = ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
			КонецЕсли;
			//--- Дмгг
			
			//Малышев 2024-11-19 ONESOFT-3602
			Для каждого СтрокаТаблицыОстатков из МассивСтрокОстатков Цикл
				
				Если КоличествоТребуетсяСвободныйОстаток <= 0 Тогда
					Прервать;
				КонецЕсли;	
				
				КоличествоОстаток = СтрокаТаблицыОстатков.КоличествоОстаток;
				СуммаОстаток = СтрокаТаблицыОстатков.СуммаОстаток;
				
				КоличествоКСписанию = 0;
				СуммаКСписанию = 0;
				
				Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуетсяСвободныйОстаток Тогда
					КоличествоКСписанию = КоличествоТребуетсяСвободныйОстаток; //Малышев 2024-11-19 ONESOFT-3602
					//+++ Дмгг Себ
					СуммаКСписанию = ?(СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости И СебестоимостьЕдиницы <> 0, Окр(СебестоимостьЕдиницы * КоличествоТребуетсяСвободныйОстаток, 2, 1)
					//,Окр(СуммаОстаток * КоличествоТребуетсяСвободныйОстаток / КоличествоОстаток , 2, 1));//Окр(СуммаОстаток * КоличествоТребуетсяСвободныйОстаток / КоличествоОстаток , 2, 1);
					,Окр(СуммаОстаток * КоличествоКСписанию / КоличествоОстаток , 2, 1));//Малышев 2024-11-19 ONESOFT-3602
					
					
					//МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуетсяСвободныйОстаток;
					СтрокаТаблицыОстатков.КоличествоОстаток = СтрокаТаблицыОстатков.КоличествоОстаток - КоличествоКСписанию;
					
					//МассивСтрокОстатков[0].СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток - СуммаКСписанию;
					СтрокаТаблицыОстатков.СуммаОстаток = СтрокаТаблицыОстатков.СуммаОстаток - СуммаКСписанию;
					
					//ИначеЕсли КоличествоОстаток = КоличествоТребуетсяСвободныйОстаток Тогда
				ИначеЕсли КоличествоОстаток >0 и КоличествоОстаток <= КоличествоТребуетсяСвободныйОстаток Тогда  //Малышев 2024-11-19 ONESOFT-3602	
					
					СуммаКСписанию = СуммаОстаток; 
					
					//++Lazare 10.02.2025 ONESOFT-3832
					Если Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить() Тогда    
						КоличествоКСписанию = КоличествоТребуетсяСвободныйОстаток;
					Иначе
						//--Lazare 10.02.2025 ONESOFT-3832   
						КоличествоКСписанию = КоличествоОстаток; 		
					КонецЕсли;
					
					//МассивСтрокОстатков[0].КоличествоОстаток = 0;
					СтрокаТаблицыОстатков.КоличествоОстаток = 0;
					
					//МассивСтрокОстатков[0].СуммаОстаток = 0;
					СтрокаТаблицыОстатков.СуммаОстаток = 0
					
					
					//Малышев 2024-11-19 ONESOFT-3602 (--	
					
				ИначеЕсли КоличествоОстаток <= 0 Тогда  
					//Возврат;
					// Kuzmich, 15.05.2025, (ONESOFT-3975) ნიკა პლასტი - წარმოების დოკუმენტის დროს, უარყოფითი ნაშთები არ აისახება მარაგებში და დანახარჯებში 
					Прервать;
					//Малышев 2024-11-19 ONESOFT-3602 --)
					
				Иначе
					СуммаКСписанию = 0; 
					
				КонецЕсли;
				
				КоличествоТребуетсяСвободныйОстаток = КоличествоТребуетсяСвободныйОстаток - КоличествоКСписанию; //Малышев 2024-11-19 ONESOFT-3602
				
				ДокументПоступления = СтрокаТаблицыОстатков.ДокументПоступления;
				//СформироватьТаблицаЗапасыПродажа_ФормированиеДвижений(КоличествоКСписанию, СуммаКСписанию, СтрокаТаблицыОстатков, КоличествоТребуетсяСвободныйОстаток, СтруктураДополнительныеСвойства, СтрокаТаблицаЗапасы, СебестоимостьЕдиницы, ВременнаяТаблицаЗапасы, СтруктураСчетовРегл, Передача, Запрос);
				// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
				СформироватьТаблицаЗапасыПродажа_ФормированиеДвижений(КоличествоКСписанию, СуммаКСписанию, ДокументПоступления, КоличествоТребуетсяСвободныйОстаток, СтруктураДополнительныеСвойства, СтрокаТаблицаЗапасы, СебестоимостьЕдиницы, ВременнаяТаблицаЗапасы, СтруктураСчетовРегл, Передача, Запрос);
				// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
			
			КонецЦикла; //По таблице остатков
			
			Если КоличествоТребуетсяСвободныйОстаток>0 Тогда 
				КоличествоКСписанию = КоличествоТребуетсяСвободныйОстаток;
				СуммаКСписанию = 0;
				СформироватьТаблицаЗапасыПродажа_ФормированиеДвижений(КоличествоКСписанию, СуммаКСписанию, Неопределено, КоличествоТребуетсяСвободныйОстаток, СтруктураДополнительныеСвойства, СтрокаТаблицаЗапасы, СебестоимостьЕдиницы, ВременнаяТаблицаЗапасы, СтруктураСчетовРегл, Передача, Запрос);		
			КонецЕсли;	
			
		КонецЕсли; //КоличествоТребуетсяСвободныйОстаток > 0
		
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы = ВременнаяТаблицаЗапасы;
	
КонецПроцедуры // СформироватьТаблицаЗапасыПродажа()

Процедура СформироватьТаблицаЗапасыПродажа_ФормированиеДвижений(КоличествоКСписанию, СуммаКСписанию, ДокументПоступления, КоличествоТребуетсяСвободныйОстаток, СтруктураДополнительныеСвойства, СтрокаТаблицаЗапасы, СебестоимостьЕдиницы, ВременнаяТаблицаЗапасы, СтруктураСчетовРегл, Передача, Запрос)
	
	//Малышев 2024-11-19 ONESOFT-3602
	//КоличествоОстаток = 0;
	//СуммаОстаток = 0;
	//
	//Если МассивСтрокОстатков.Количество() > 0 Тогда
	//	КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
	//	СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток;
	//КонецЕсли;
	
	
	// Расход. Запасы.
	СтрокаТаблицыРасход = ВременнаяТаблицаЗапасы.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
	
	СтрокаТаблицыРасход.Сумма = СуммаКСписанию;
	//СтрокаТаблицыРасход.Количество = КоличествоТребуетсяСвободныйОстаток;
	СтрокаТаблицыРасход.Количество = КоличествоКСписанию;
	
	СтрокаТаблицыРасход.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
	СтрокаТаблицыРасход.ВидДвижения = ВидДвиженияНакопления.Расход;                 
	
	СтрокаТаблицыРасход.ДокументПоступления = ДокументПоступления; //Малышев 2024-11-19 ONESOFT-3602
	
	// Сформируем проводки.
	//Если Окр(СуммаКСписанию, 2, 1) <> 0 Тогда
	Если ИСТИНА ИЛИ Окр(СуммаКСписанию, 2, 1) <> 0 Тогда //Малышев 2024-06-25 - включил проводки с нулевыми суммами
		СтрокаТаблицаУправленческий = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицаУправленческий, СтрокаТаблицаЗапасы);
		СтрокаТаблицаУправленческий.Сумма = СуммаКСписанию;
		
		СтрокаТаблицаХозрасчетный = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицаХозрасчетный, СтрокаТаблицаЗапасы);
		СтрокаТаблицаХозрасчетный.СчетДт = СтрокаТаблицаЗапасы.СчетДтРегл;
		СтрокаТаблицаХозрасчетный.СчетКт = СтрокаТаблицаЗапасы.СчетКтРегл;
		Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетный.СчетДт) И СтрокаТаблицаХозрасчетный.СчетДт.Количественный Тогда
			//	СтрокаТаблицаХозрасчетный.КоличествоДт = КоличествоТребуетсяСвободныйОстаток; //+++ Дмгг СтрокаТаблицаЗапасы.Количество;
			СтрокаТаблицаХозрасчетный.КоличествоДт = КоличествоКСписанию; 
		КонецЕсли; 
		Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетный.СчетКт) И СтрокаТаблицаХозрасчетный.СчетКт.Количественный Тогда
			//	СтрокаТаблицаХозрасчетный.КоличествоКт = КоличествоТребуетсяСвободныйОстаток; //+++ Дмгг СтрокаТаблицаЗапасы.Количество;
			СтрокаТаблицаХозрасчетный.КоличествоКт = КоличествоКСписанию; 
		КонецЕсли; 
		
		СтрокаТаблицаХозрасчетный.ВидСубконтоДт1 = СтруктураСчетовРегл.СоответствиеСчетов[СтрокаТаблицаЗапасы.СчетДтРегл]["ВидСубконто1"];//"Подразделения";
		СтрокаТаблицаХозрасчетный.ВидСубконтоДт2 = СтруктураСчетовРегл.СоответствиеСчетов[СтрокаТаблицаЗапасы.СчетДтРегл]["ВидСубконто2"];//"Номенклатура";
		СтрокаТаблицаХозрасчетный.ВидСубконтоДт3 = СтруктураСчетовРегл.СоответствиеСчетов[СтрокаТаблицаЗапасы.СчетДтРегл]["ВидСубконто3"];//"ХарактеристикиНоменклатуры";
		
		СтрокаТаблицаХозрасчетный.ВидСубконтоКт1 = СтруктураСчетовРегл.СоответствиеСчетов[СтрокаТаблицаЗапасы.СчетКтРегл]["ВидСубконто1"];//"Склады";
		СтрокаТаблицаХозрасчетный.ВидСубконтоКт2 = СтруктураСчетовРегл.СоответствиеСчетов[СтрокаТаблицаЗапасы.СчетКтРегл]["ВидСубконто2"];//"Номенклатура";
		СтрокаТаблицаХозрасчетный.ВидСубконтоКт3 = СтруктураСчетовРегл.СоответствиеСчетов[СтрокаТаблицаЗапасы.СчетКтРегл]["ВидСубконто3"];//"ХарактеристикиНоменклатуры";
		
		Для Сч = 1 По 3 Цикл 
			
			Если СтрокаТаблицаХозрасчетный["ВидСубконтоДт"+Сч] = "" Тогда 
				// нет субконто в счете
				Продолжить;
			КонецЕсли;
			
			//СтруктураСчетовРегл.СтруктураСубконтоДт
			Если СтрокаТаблицаЗапасы.Документ.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику 
				И СтрокаТаблицаХозрасчетный["ВидСубконтоДт"+Сч] = "Подразделения" Тогда
				//временнаяТаблицаЗапасы
				//--------------------------------------------------------------------------
				// © Шишка В.В. [23 января 2022 г.]  НАЧАЛО
				//Кривое решение обращениея по индексу к таблице "временнаяТаблицаЗапасы"
				//Номера таблиц в пакете запроса изменён!  таблицу надо искать по имени! Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("ВременнаяТаблицаЗапасы")
				//МассивСтрокПоиска = Запрос.МенеджерВременныхТаблиц.Таблицы[10].ПолучитьДанные().Выгрузить().НайтиСтроки(Новый Структура("НомерСтроки",СтрокаТаблицаЗапасы.НомерСтроки));
				МассивСтрокПоиска = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("ВременнаяТаблицаЗапасы").ПолучитьДанные().Выгрузить().НайтиСтроки(Новый Структура("НомерСтроки",СтрокаТаблицаЗапасы.НомерСтроки));
				// © Шишка В.В. [23 января 2022 г.]  КОНЕЦ
				//--------------------------------------------------------------------------
				Если МассивСтрокПоиска.Количество() <> 0 Тогда 
					СтрокаТаблицаХозрасчетный.СубконтоДт1 = МассивСтрокПоиска[0].СтруктурнаяЕдиницаБезвозмезднойПродажи;
				КонецЕсли;
				Продолжить;
			КонецЕсли;
			
			НаименованиеПоля = СтруктураСчетовРегл.СтруктураСубконтоДт[СтрокаТаблицаХозрасчетный["ВидСубконтоДт"+Сч]];
			Если НаименованиеПоля = "" Тогда 
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(НаименованиеПоля) = Тип("Строка") Тогда 
				ЗначениеПодстановки = СтрокаТаблицаЗапасы[НаименованиеПоля];
			Иначе
				ЗначениеПодстановки = НаименованиеПоля;
			КонецЕсли;
			
			СтрокаТаблицаХозрасчетный["СубконтоДт"+Сч] = ЗначениеПодстановки;
			
		КонецЦикла;
		
		Для Сч =1 По 3 Цикл 
			
			Если СтрокаТаблицаХозрасчетный["ВидСубконтоКт"+Сч] = "" Тогда 
				// нет субконто в счете
				Продолжить;
			КонецЕсли;
			
			Если СтрокаТаблицаХозрасчетный["ВидСубконтоКт"+Сч] = "Подразделения" Тогда 
				СтрокаТаблицаХозрасчетный["СубконтоКт"+Сч] = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.СтруктурнаяЕдиница), СтрокаТаблицаЗапасы.СтруктурнаяЕдиница, СтрокаТаблицаЗапасы.Контрагент);
				Продолжить;
			КонецЕсли;
			
			НаименованиеПоля = СтруктураСчетовРегл.СтруктураСубконтоКт[СтрокаТаблицаХозрасчетный["ВидСубконтоКт"+Сч]];
			Если НаименованиеПоля = "" Тогда 
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(НаименованиеПоля) = Тип("Строка") Тогда 
				ЗначениеПодстановки = СтрокаТаблицаЗапасы[НаименованиеПоля];
			Иначе
				ЗначениеПодстановки = НаименованиеПоля;
			КонецЕсли;
			
			СтрокаТаблицаХозрасчетный["СубконтоКт"+Сч] = ЗначениеПодстановки;
			
		КонецЦикла;
		
		СтрокаТаблицаХозрасчетный.Сумма = СуммаКСписанию;
		
		// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
		Если ПолучитьФункционалРезервированияЗаказов() И Константы_German_Butcher_Получить()
			И СтрокаТаблицаЗапасы.КоличествоСобрПотери>0 И ЗначениеЗаполнено(СтрокаТаблицаЗапасы.СчетУчетаПотерь) Тогда
			
			ТекущаяСуммаСебестоимости = СуммаКСписанию;
			ТекущееКоличествоСебестоимости = СтрокаТаблицаХозрасчетный.КоличествоКт;
			
			ТекущаяСуммаПотерь = (СтрокаТаблицаЗапасы.КоличествоСобрПотери * ТекущаяСуммаСебестоимости) / ТекущееКоличествоСебестоимости;
			
			СтрокаТаблицаХозрасчетный1 = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицаХозрасчетный1, СтрокаТаблицаХозрасчетный);
			СтрокаТаблицаХозрасчетный1.СчетДт = СтрокаТаблицаЗапасы.СчетУчетаПотерь;
			//СтрокаТаблицаХозрасчетный1.СчетКт = СтрокаТаблицаЗапасы.СчетКтРегл;
			Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетный1.СчетДт) И СтрокаТаблицаХозрасчетный1.СчетДт.Количественный Тогда
				СтрокаТаблицаХозрасчетный1.КоличествоДт = СтрокаТаблицаЗапасы.КоличествоСобрПотери;
			КонецЕсли; 
			Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетный1.СчетКт) И СтрокаТаблицаХозрасчетный1.СчетКт.Количественный Тогда
				СтрокаТаблицаХозрасчетный1.КоличествоКт = СтрокаТаблицаЗапасы.КоличествоСобрПотери;
			КонецЕсли; 
			
			СтрокаТаблицаХозрасчетный1.Сумма = ТекущаяСуммаПотерь;
			
			СтрокаТаблицаХозрасчетный1.Содержание = НСтр("ka='დანაკარგის ჩამოწერა';ru='Списание потерь';en='დანაკარგის ჩამოწერა'");
			
		КонецЕсли;
		// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
		
	КонецЕсли;
	
	Если Передача Тогда
		
		// Приход.
		СтрокаТаблицыПриход = ВременнаяТаблицаЗапасы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриход, СтрокаТаблицаЗапасы,,"СтруктурнаяЕдиница, КоррСтруктурнаяЕдиница");
		
		СтрокаТаблицыПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		СтрокаТаблицыПриход.Организация = СтрокаТаблицаЗапасы.КоррОрганизация;
		СтрокаТаблицыПриход.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
		СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
		СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
		СтрокаТаблицыПриход.Номенклатура = СтрокаТаблицаЗапасы.КоррНоменклатура;
		СтрокаТаблицыПриход.Характеристика = СтрокаТаблицаЗапасы.КоррХарактеристика;
		СтрокаТаблицыПриход.Партия = СтрокаТаблицаЗапасы.КоррПартия;
		
		СтрокаТаблицыПриход.ЗаказПокупателя = СтрокаТаблицаЗапасы.КоррЗаказПокупателя;
		
		СтрокаТаблицыПриход.КоррОрганизация = СтрокаТаблицаЗапасы.Организация;
		СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
		СтрокаТаблицыПриход.КоррСчетУчета = СтрокаТаблицаЗапасы.СчетУчета;
		СтрокаТаблицыПриход.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
		СтрокаТаблицыПриход.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
		СтрокаТаблицыПриход.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
		СтрокаТаблицыПриход.КоррПартия = СтрокаТаблицаЗапасы.Партия;
		
		СтрокаТаблицыПриход.КоррЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
		
		СтрокаТаблицыПриход.Сумма = СуммаКСписанию;
		//СтрокаТаблицыПриход.Количество = КоличествоТребуетсяСвободныйОстаток;
		СтрокаТаблицыПриход.Количество = КоличествоКСписанию;
		
		СтрокаТаблицыПриход.СодержаниеПроводки = НСтр("ka='მარაგების გადაცემა';ru='Передача запасов';en='Transferring reserves'");
		
		СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
		СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
		
	Иначе
		
		Если СтрокаТаблицаЗапасы.ТоварыНаКомиссии Тогда
			
		ИначеЕсли Окр(СуммаКСписанию, 2, 1) <> 0 Тогда
			
			// Продвигаем доходы и расходы.
			СтрокаДоходыИРасходы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДоходыИРасходы, СтрокаТаблицаЗапасы);
			
			СтрокаДоходыИРасходы.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ПодразделениеПродажи;
			СтрокаДоходыИРасходы.СчетУчета = СтрокаТаблицаЗапасы.СчетУчетаСебестоимость;
			СтрокаДоходыИРасходы.СчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаСебестоимостьРегл;
			СтрокаДоходыИРасходы.СуммаДоходов = 0;
			СтрокаДоходыИРасходы.СуммаРасходов = СуммаКСписанию;
			СтрокаДоходыИРасходы.Сумма = СуммаКСписанию;       
			
			СтрокаДоходыИРасходы.Аналитика = СтрокаТаблицаЗапасы.Номенклатура; //++Lazare ONESOFT-3176
			
			СтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
			
			// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
			Если ПолучитьФункционалРезервированияЗаказов() И Константы_German_Butcher_Получить()
				И СтрокаТаблицаЗапасы.КоличествоСобрПотери>0 И ЗначениеЗаполнено(СтрокаТаблицаЗапасы.СчетУчетаПотерь) И ТекущаяСуммаПотерь>0 Тогда
				
				СтрокаДоходыИРасходы1 = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДоходыИРасходы1, СтрокаТаблицаЗапасы);
				
				СтрокаДоходыИРасходы1.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ПодразделениеПродажи;
				СтрокаДоходыИРасходы1.СчетУчета = СтрокаТаблицаЗапасы.СчетУчетаСебестоимость;
				СтрокаДоходыИРасходы1.СчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаПотерь;
				СтрокаДоходыИРасходы1.СуммаДоходов = 0;
				СтрокаДоходыИРасходы1.СуммаРасходов =  ТекущаяСуммаПотерь;
				
				СтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
				
			КонецЕсли;
			// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
			
		КонецЕсли;
		
		Если Окр(СуммаКСписанию, 2, 1) <> 0 Тогда
			
			// Продвигаем себестоимость продаж.
			СтрокаПродажи = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажи.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПродажи, СтрокаТаблицаЗапасы);
			СтрокаПродажи.Подразделение = СтрокаТаблицаЗапасы.ПодразделениеПродажи;  //Малышев 2025-12-24 ES4001-121
			СтрокаПродажи.Порядок = 999;
			СтрокаПродажи.Количество = 0;
			СтрокаПродажи.Сумма = 0;
			СтрокаПродажи.СуммаНДС = 0;
			СтрокаПродажи.Себестоимость = СуммаКСписанию;
			Если СтрокаТаблицаЗапасы.Документ.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику Тогда 
				СтрокаПродажи.Контрагент = СтрокаТаблицаЗапасы.Документ.Запасы[СтрокаТаблицаЗапасы.НомерСтроки-1].Сотрудник;
			КонецЕсли;
			
			// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
			Если ПолучитьФункционалРезервированияЗаказов() И Константы_German_Butcher_Получить()
				И СтрокаТаблицаЗапасы.КоличествоСобрПотери>0 И ЗначениеЗаполнено(СтрокаТаблицаЗапасы.СчетУчетаПотерь) И ТекущаяСуммаПотерь>0 Тогда
				
				СтрокаПродажи1 = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажи.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПродажи1, СтрокаТаблицаЗапасы);
				СтрокаПродажи1.Подразделение = СтрокаТаблицаЗапасы.ПодразделениеПродажи;  //Малышев 2025-12-24 ES4001-121
				СтрокаПродажи1.Порядок = 999;
				СтрокаПродажи1.Количество = СтрокаТаблицаЗапасы.КоличествоСобрПотери;
				СтрокаПродажи1.Сумма = 0;
				СтрокаПродажи1.СуммаНДС = 0;
				СтрокаПродажи1.Себестоимость = ТекущаяСуммаПотерь;
				
			КонецЕсли;
			// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
			
		КонецЕсли;	
		
	КонецЕсли;
	
			

КонецПроцедуры	


// Олег Литвиненко 29.12.22 --->
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыВВалютеПродажа(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	//--------------------------------------------------------------------------
	// © Шишка В.В. [17 августа 2021]  НАЧАЛО
	УчетСебестоимостиВРазрезеОрганизации = СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетСебестоимостиВРазрезеОрганизации;
	УправлениеНебольшойФирмойСервер.ВыполнитьКорректировкуВременнойТаблицыЗапасыПоУчетуВРазрезеОрганизаций(СтруктураДополнительныеСвойства);	
	// © Шишка В.В. [17 августа 2021]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	// Установка исключительной блокировки контролируемых остатков запасов.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти)
	|			ТОГДА ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы
	|		ИНАЧЕ ТаблицаЗапасы.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаЗапасы.Организация КАК Организация,
	|		ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|		ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|		ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|		ТаблицаЗапасы.Характеристика КАК Характеристика,
	|		ТаблицаЗапасы.Партия КАК Партия,
	|		ВЫБОР
	|			КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				ТОГДА ТаблицаЗапасы.Заказ
	|			КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|					И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ТОГДА ТаблицаЗапасы.Заказ.ЗаказПокупателя
	|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОНЕЦ КАК ЗаказПокупателя,
	|		ТаблицаЗапасы.ПоложениеСклада КАК ПоложениеСклада,
	|		ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы КАК СтруктурнаяЕдиницаЗапасы
	|	ИЗ
	|		ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|	ГДЕ
	|		ТаблицаЗапасы.Заказ <> НЕОПРЕДЕЛЕНО
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаЗапасы.Организация,
	|		ТаблицаЗапасы.СтруктурнаяЕдиница,
	|		ТаблицаЗапасы.СчетУчета,
	|		ТаблицаЗапасы.СчетУчетаРегл,
	|		ТаблицаЗапасы.Номенклатура,
	|		ТаблицаЗапасы.Характеристика,
	|		ТаблицаЗапасы.Партия,
	|		ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
	|		ТаблицаЗапасы.ПоложениеСклада,
	|		ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы
	|	ИЗ
	|		ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы) КАК ТаблицаЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти)
	|			ТОГДА ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы
	|		ИНАЧЕ ТаблицаЗапасы.СтруктурнаяЕдиница
	|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗапасыВВалюте");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	// Получение остатков запасов по стоимости.
	
	//Малышев 2024-06-16 ONESOFT-3094 (--
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗапасыОстатки.Организация КАК Организация,
	//|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	////|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	//|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	//|	ЗапасыОстатки.Характеристика КАК Характеристика,
	//|	ЗапасыОстатки.Партия КАК Партия,
	////|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	//|	СУММА(ЗапасыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток,
	//|	ЛОЖЬ КАК Резервирование,
	//|	ЗапасыОстатки.СчетУчетаРегл
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ЗапасыОстатки.Организация КАК Организация,
	//|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	////|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	//|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	//|		ЗапасыОстатки.Характеристика КАК Характеристика,
	//|		ЗапасыОстатки.Партия КАК Партия,
	////|		ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	//|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	//|		ЗапасыОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	//|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл
	//|	ИЗ
	//|		РегистрНакопления.ЗапасыВВалюте.Остатки(
	//|				&МоментКонтроля,
	////|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	////|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия) В //+++ Дмгг
	//|					(ВЫБРАТЬ
	//|						ТаблицаЗапасы.Организация КАК Организация,
	////|						ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	////+Lazare 12.09.2022
	//|						ВЫБОР
	//|							КОГДА ТаблицаЗапасы.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти)
	//|								ТОГДА ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы
	//|							ИНАЧЕ ТаблицаЗапасы.СтруктурнаяЕдиница
	//|						КОНЕЦ КАК СтруктурнаяЕдиница,	
	////+Lazare 12.09.2022
	////|						ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	//|						ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	//|						ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	//|						ТаблицаЗапасы.Характеристика КАК Характеристика,
	//|						ТаблицаЗапасы.Партия КАК Партия
	////|						ВЫБОР
	////|							КОГДА ТаблицаЗапасы.Заказ <> НЕОПРЕДЕЛЕНО
	////|								ТОГДА ВЫБОР
	////|										КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	////|											ТОГДА ТаблицаЗапасы.Заказ
	////|										КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	////|												И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	////|											ТОГДА ТаблицаЗапасы.Заказ.ЗаказПокупателя
	////|										ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	////|									КОНЕЦ
	////|							ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	////|						КОНЕЦ КАК ЗаказПокупателя
	//|					ИЗ
	//|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	////|					ГДЕ
	////|						ВЫБОР
	////|							КОГДА ТаблицаЗапасы.Заказ <> НЕОПРЕДЕЛЕНО
	////|								ТОГДА ВЫБОР
	////|										КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	////|											ТОГДА ТаблицаЗапасы.Заказ
	////|										КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	////|												И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	////|											ТОГДА ТаблицаЗапасы.Заказ.ЗаказПокупателя
	////|										ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	////|									КОНЕЦ
	////|							ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	////|						КОНЕЦ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//|				
	//|					ОБЪЕДИНИТЬ ВСЕ
	//|				
	//|					ВЫБРАТЬ
	//|						ТаблицаЗапасы.Организация,
	////|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	////+Lazare 12.09.2022
	//|  						ВЫБОР
	//|           				КОГДА ТаблицаЗапасы.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти)
	//|                   			 ТОГДА ТаблицаЗапасы.СтруктурнаяЕдиницаЗапасы
	//|            				ИНАЧЕ ТаблицаЗапасы.СтруктурнаяЕдиница
	//|    					КОНЕЦ,
	////+Lazare 12.09.2022
	////|						ТаблицаЗапасы.СчетУчета,
	//|						ТаблицаЗапасы.СчетУчетаРегл, //+++ Дмгг
	//|						ТаблицаЗапасы.Номенклатура,
	//|						ТаблицаЗапасы.Характеристика,
	//|						ТаблицаЗапасы.Партия
	////|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//|					ИЗ
	//|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки) КАК ЗапасыОстатки
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗапасыОстатки.Организация,
	//|	ЗапасыОстатки.СтруктурнаяЕдиница,
	////|	ЗапасыОстатки.СчетУчета,
	//|	ЗапасыОстатки.Номенклатура,
	//|	ЗапасыОстатки.Характеристика,
	//|	ЗапасыОстатки.Партия,
	////|	ЗапасыОстатки.ЗаказПокупателя,
	//|	ЗапасыОстатки.СчетУчетаРегл";
	//
	//Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходнаяНакладная);
	//Запрос.УстановитьПараметр("МоментКонтроля", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Исключая));
	
	//РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗапасыОстатки = РезультатЗапроса.Выгрузить();
	
	//Малышев 2025-12-22 ES4001-107 ((--
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	""товары из свободного остатка"" как ВидДвижения,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.Проект КАК Проект,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы_ДляПродажиВал
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	(ТаблицаЗапасы.Количество - ТаблицаЗапасы.Резерв) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""товары с указанием заказа резерва"",
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.Проект,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.Заказ <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|						ТОГДА ТаблицаЗапасы.Заказ
	|					КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|							И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|						ТОГДА ТаблицаЗапасы.Заказ.ЗаказПокупателя
	|					ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ            
	|	ТаблицаЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И ТаблицаЗапасы.Резерв > 0";
	
	Запрос.Выполнить();
    //Малышев 2025-12-22 ES4001-107 --))
	
	
	
	
	//ТаблицаЗапасыОстатки = УправлениеНебольшойФирмойСервер.ПолучитьОстаткиЗапасовПоСтоимостиПриПроведении(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства,,,Истина,Истина,Ложь).Выгрузить(); 
	ТаблицаЗапасыОстатки = УправлениеНебольшойФирмойСервер.ПолучитьОстаткиЗапасовПоСтоимостиПриПроведении(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства,,"ВременнаяТаблицаЗапасы_ДляПродажиВал",Истина,Истина,Ложь).Выгрузить(); //Малышев 2025-12-22 ES4001-107
	//Малышев 2024-06-16 ONESOFT-3094 --)
	
	
	// Kuzmich, 11.01.2020, Подбор цены и себестоимости для отрицательных остатков
	Если Константы.ПодборЦеныДляОтрицательныхОстатков.Получить() Тогда
		
		 //Малышев 2024-06-16 ONESOFT-3094 - перенес в отдельный модуль
		 УправлениеНебольшойФирмойСервер.ДополнитьТаблицуОстатков_ПодборЦеныДляОтрицательныхОстатков(ТаблицаЗапасыОстатки, СтруктураДополнительныеСвойства, ДокументСсылкаРасходнаяНакладная, Ложь);	
		
	КонецЕсли;
	// Kuzmich, 11.01.2020, Подбор цены и себестоимости для отрицательных остатков
	//ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,Номенклатура,Характеристика,Партия,ЗаказПокупателя");
	//ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия,ЗаказПокупателя");
	ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия");
	
	ТаблицаЗапасыОстаткиПодРезерв = ТаблицаЗапасыОстатки.Скопировать();
	Если СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда 
		
		ТекстЗапроса = ПолучитьТекстЗапросаБезФильтрЗаказов();
		
		Запрос.Текст = ТекстЗапроса;
		ТаблицаЗапасыОстаткиПодРезерв = Запрос.Выполнить().Выгрузить();
		
		//ТаблицаЗапасыОстаткиПодРезерв.Свернуть("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,Номенклатура,Характеристика,Партия","КоличествоОстаток,СуммаОстаток");
		ТаблицаЗапасыОстаткиПодРезерв.Свернуть("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия","КоличествоОстаток,СуммаОстаток");
		
	КонецЕсли;
	
	Передача = (ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию
				ИЛИ ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку
				ИЛИ ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение);
				
	// Олег Литвиненко 18.01.23 --->
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте.Колонки.Добавить("Порядок", ОбщегоНазначения.ОписаниеТипаЧисло(15));
	// Олег Литвиненко <---

	ВременнаяТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте.СкопироватьКолонки();
	
	МассивСчетовДтРегл = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте.ВыгрузитьКолонку("СчетДтРегл");
	МассивСчетовКтРегл = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте.ВыгрузитьКолонку("СчетКтРегл");
	СтруктураСчетовРегл = ПолучитьСтруктуруДТРегл(МассивСчетовДтРегл, МассивСчетовКтРегл, ДокументСсылкаРасходнаяНакладная);
	
	ФункционалСбораТоваров = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалСбораТоваров");
	
	Для н = 0 По СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте.Количество() - 1 Цикл
		
		СтрокаТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте[н];
		СтруктураДляПоиска = УправлениеНебольшойФирмойСервер.ПолучитьСтруктуруДляПоиска(СтрокаТаблицаЗапасы, СтруктураДополнительныеСвойства);
		
		//КоличествоТребуетсяРезерв = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.Резерв), СтрокаТаблицаЗапасы.Резерв, 0);
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		Если Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() Тогда
			КоличествоТребуетсяРезерв = 0;
		Иначе
			КоличествоТребуетсяРезерв = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.Резерв), СтрокаТаблицаЗапасы.Резерв, 0);
		КонецЕсли;
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		КоличествоТребуетсяСвободныйОстаток = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.Количество), СтрокаТаблицаЗапасы.Количество, 0);
		КоличествоТребуетсяВсего = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.Количество), СтрокаТаблицаЗапасы.Количество, 0);
		
		СебестоимостьЕдиницы = 0; //+++ Дмгг
		
		Если КоличествоТребуетсяРезерв > 0 Тогда
			
			КоличествоТребуетсяСвободныйОстаток = КоличествоТребуетсяСвободныйОстаток - КоличествоТребуетсяРезерв;
			
			//Запасы в валюте без учета заказа
			//СтруктураДляПоиска.Вставить("ЗаказПокупателя", СтрокаТаблицаЗапасы.ЗаказПокупателя);  //+++ Дмгг
			//Если НЕ СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда 
			//	
			//	СтруктураДляПоиска.Вставить("ЗаказПокупателя", СтрокаТаблицаЗапасы.ЗаказПокупателя);
			//	
			//КонецЕсли;
			//--- Дмгг
			
			МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска); //+++ Дмгг
			//МассивСтрокОстатков = ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
			
			КоличествоОстаток = 0;
			СуммаОстаток = 0;
			
			Если МассивСтрокОстатков.Количество() > 0 Тогда
				КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
				СуммаОстаток = МассивСтрокОстатков[0].СуммаВалОстаток;
			КонецЕсли;
			
			Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуетсяРезерв Тогда
				
				СуммаКСписанию = Окр(СуммаОстаток * КоличествоТребуетсяРезерв / КоличествоОстаток , 2, 1);
				
				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуетсяРезерв;
				МассивСтрокОстатков[0].СуммаВалОстаток = МассивСтрокОстатков[0].СуммаВалОстаток - СуммаКСписанию;
				
			ИначеЕсли КоличествоОстаток = КоличествоТребуетсяРезерв Тогда
				
				СуммаКСписанию = СуммаОстаток;
				
				МассивСтрокОстатков[0].КоличествоОстаток = 0;
				МассивСтрокОстатков[0].СуммаВалОстаток = 0;
				
			Иначе
				СуммаКСписанию = 0;
			КонецЕсли;
			
			СуммаКСписаниюКорр = 0;
						
			// Расход. Запасы.
			СтрокаТаблицыРасход = ВременнаяТаблицаЗапасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
			
			// Олег Литвиненко 18.01.23 --->
			СтрокаТаблицыРасход.Порядок = 99;
			// Олег Литвиненко <---

			СтрокаТаблицыРасход.СуммаВал = ?(СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости, СуммаКСписаниюКорр, СуммаКСписанию);
			СтрокаТаблицыРасход.Количество = КоличествоТребуетсяРезерв;
			// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
			ТекущаяСуммаПотерь = 0;
			Если ПолучитьФункционалРезервированияЗаказов() И Константы_German_Butcher_Получить()
				И СтрокаТаблицаЗапасы.КоличествоСобрПотери>0 И ЗначениеЗаполнено(СтрокаТаблицаЗапасы.СчетУчетаПотерь) Тогда
				
				ТекущаяСуммаСебестоимости = СтрокаТаблицыРасход.СуммаВал;
				ТекущееКоличествоСебестоимости = СтрокаТаблицыРасход.Количество;
					
				ТекущаяСуммаПотерь = (СтрокаТаблицаЗапасы.КоличествоСобрПотери * ТекущаяСуммаСебестоимости) / ТекущееКоличествоСебестоимости;
				
				СтрокаТаблицыРасход1 = ВременнаяТаблицаЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход1, СтрокаТаблицаЗапасы);
				
				// Олег Литвиненко 18.01.23 --->
				СтрокаТаблицыРасход1.Порядок = 99;
				// Олег Литвиненко <---
			
				СтрокаТаблицыРасход1.СуммаВал = ТекущаяСуммаПотерь;
				СтрокаТаблицыРасход1.Количество = СтрокаТаблицаЗапасы.КоличествоСобрПотери;
				СтрокаТаблицыРасход1.СчетУчетаЗатратРегл = СтрокаТаблицаЗапасы.СчетУчетаПотерь;
				
			КонецЕсли;
			// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
		
			Если Передача Тогда
				
				// Приход.
				СтрокаТаблицыПриход = ВременнаяТаблицаЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриход, СтрокаТаблицаЗапасы,,"СтруктурнаяЕдиница, КоррСтруктурнаяЕдиница");
				
				СтрокаТаблицыПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
				
				
				СтрокаТаблицыПриход.Организация = СтрокаТаблицаЗапасы.КоррОрганизация;
				СтрокаТаблицыПриход.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
				СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
				СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
				СтрокаТаблицыПриход.Номенклатура = СтрокаТаблицаЗапасы.КоррНоменклатура;
				СтрокаТаблицыПриход.Характеристика = СтрокаТаблицаЗапасы.КоррХарактеристика;
				СтрокаТаблицыПриход.Партия = СтрокаТаблицаЗапасы.КоррПартия;
				
				СтрокаТаблицыПриход.КоррОрганизация = СтрокаТаблицаЗапасы.Организация;
				СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
				СтрокаТаблицыПриход.КоррСчетУчета = СтрокаТаблицаЗапасы.СчетУчета;
				СтрокаТаблицыПриход.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
				СтрокаТаблицыПриход.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
				СтрокаТаблицыПриход.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
				СтрокаТаблицыПриход.КоррПартия = СтрокаТаблицаЗапасы.Партия;
			
				СтрокаТаблицыПриход.СуммаВал = СуммаКСписанию;
				СтрокаТаблицыПриход.Количество = КоличествоТребуетсяРезерв;
				
				СтрокаТаблицыПриход.СодержаниеПроводки = НСтр("ka='მარაგების გადაცემა';ru='Передача запасов';en='Transferring reserves'"); 
				
				СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
				СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если КоличествоТребуетсяСвободныйОстаток > 0 Тогда
			
			//СтруктураДляПоиска.Вставить("ЗаказПокупателя", Документы.ЗаказПокупателя.ПустаяСсылка());  //+++ Дмгг
			
			//Запасы в валюте учитываем без Заказа
			//МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
			//Если НЕ СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда 
			//	
			//	СтруктураДляПоиска.Вставить("ЗаказПокупателя", Документы.ЗаказПокупателя.ПустаяСсылка());
			//	МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
			//	
			//Иначе
				МассивСтрокОстатков = ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
			//КонецЕсли;
			//--- Дмгг
			
			КоличествоОстаток = 0;
			СуммаВалОстаток = 0;
			
			Если МассивСтрокОстатков.Количество() > 0 Тогда
				КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
				СуммаВалОстаток = МассивСтрокОстатков[0].СуммаВалОстаток;
			КонецЕсли;
			
			Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуетсяСвободныйОстаток Тогда
				                                      //+++ Дмгг Себ
				СуммаКСписанию = ?(СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости И СебестоимостьЕдиницы <> 0, Окр(СебестоимостьЕдиницы * КоличествоТребуетсяСвободныйОстаток, 2, 1)
									,Окр(СуммаВалОстаток * КоличествоТребуетсяСвободныйОстаток / КоличествоОстаток , 2, 1));//Окр(СуммаОстаток * КоличествоТребуетсяСвободныйОстаток / КоличествоОстаток , 2, 1);
				
				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуетсяСвободныйОстаток;
				МассивСтрокОстатков[0].СуммаВалОстаток = МассивСтрокОстатков[0].СуммаВалОстаток - СуммаКСписанию;
				
			ИначеЕсли КоличествоОстаток = КоличествоТребуетсяСвободныйОстаток Тогда
				
				СуммаКСписанию = СуммаВалОстаток;
				
				МассивСтрокОстатков[0].КоличествоОстаток = 0;
				МассивСтрокОстатков[0].СуммаВалОстаток = 0;
				
			Иначе
				СуммаКСписанию = 0;
			КонецЕсли;
			
			// Расход. Запасы.
			СтрокаТаблицыРасход = ВременнаяТаблицаЗапасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
			
			// Олег Литвиненко 18.01.23 --->
			СтрокаТаблицыРасход.Порядок = 999;
			// Олег Литвиненко <---
			
			СтрокаТаблицыРасход.СуммаВал = СуммаКСписанию;
			СтрокаТаблицыРасход.Количество = КоличествоТребуетсяСвободныйОстаток;
			Если ВременнаяТаблицаЗапасы.Колонки.Найти("ЗаказПокупателя")<>Неопределено Тогда //Малышев 2025-12-07 ONESOFT-4578
				СтрокаТаблицыРасход.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
			КонецЕсли;	
			СтрокаТаблицыРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
						
			Если Передача Тогда
				
				// Приход.
				СтрокаТаблицыПриход = ВременнаяТаблицаЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриход, СтрокаТаблицаЗапасы,,"СтруктурнаяЕдиница, КоррСтруктурнаяЕдиница");
				
				СтрокаТаблицыПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
				
				СтрокаТаблицыПриход.Организация = СтрокаТаблицаЗапасы.КоррОрганизация;
				СтрокаТаблицыПриход.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
				СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
				СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
				СтрокаТаблицыПриход.Номенклатура = СтрокаТаблицаЗапасы.КоррНоменклатура;
				СтрокаТаблицыПриход.Характеристика = СтрокаТаблицаЗапасы.КоррХарактеристика;
				СтрокаТаблицыПриход.Партия = СтрокаТаблицаЗапасы.КоррПартия;
 
				//СтрокаТаблицыПриход.ЗаказПокупателя = СтрокаТаблицаЗапасы.КоррЗаказПокупателя;
				
				СтрокаТаблицыПриход.КоррОрганизация = СтрокаТаблицаЗапасы.Организация;
				СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
				СтрокаТаблицыПриход.КоррСчетУчета = СтрокаТаблицаЗапасы.СчетУчета;
				СтрокаТаблицыПриход.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
				СтрокаТаблицыПриход.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
				СтрокаТаблицыПриход.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
				СтрокаТаблицыПриход.КоррПартия = СтрокаТаблицаЗапасы.Партия;
 
				//СтрокаТаблицыПриход.КоррЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
				
				СтрокаТаблицыПриход.СуммаВал = СуммаКСписанию;
				СтрокаТаблицыПриход.Количество = КоличествоТребуетсяСвободныйОстаток;
				
				СтрокаТаблицыПриход.СодержаниеПроводки = НСтр("ka='მარაგების გადაცემა';ru='Передача запасов';en='Transferring reserves'");
				
				СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
				СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте = ВременнаяТаблицаЗапасы;
	
КонецПроцедуры // СформироватьТаблицаЗапасыПродажа() // Олег Литвиненко <---

// Олег Литвиненко 21.02.23 --->
Процедура СформироватьТаблицаЗапасыВВалютеВозврат(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	ОснованиеНакладная = Неопределено;
	Если ЗначениеЗаполнено(ДокументСсылкаРасходнаяНакладная.ДокументОснование)
		И ТипЗнч(ДокументСсылкаРасходнаяНакладная.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		ОснованиеНакладная = ДокументСсылкаРасходнаяНакладная.ДокументОснование;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	// Установка исключительной блокировки контролируемых остатков запасов.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.СчетУчетаРегл";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗапасыВВалюте");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	// Получение остатков запасов по стоимости.
	Если ЗначениеЗаполнено(ОснованиеНакладная) Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Запасы.Организация КАК Организация,
		|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Запасы.СчетУчета КАК СчетУчета,
		|	Запасы.СчетУчетаРегл,
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Партия КАК Партия,
		|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя,
		|	СУММА(Запасы.Количество) КАК КоличествоОстаток,
		|	СУММА(Запасы.СуммаВал) КАК СуммаВалОстаток
		|ИЗ
		|	РегистрНакопления.ЗапасыВВалюте КАК Запасы
		|ГДЕ
		|	Запасы.Регистратор = &ОснованиеНакладная
		|
		|СГРУППИРОВАТЬ ПО
		|	Запасы.Организация,
		|	Запасы.СтруктурнаяЕдиница,
		|	Запасы.СчетУчета,
		|	Запасы.Номенклатура,
		|	Запасы.Характеристика,
		|	Запасы.Партия,
		|	Запасы.СчетУчетаРегл";
		
		Запрос.УстановитьПараметр("ОснованиеНакладная", ОснованиеНакладная);
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗапасыОстатки.Организация КАК Организация,
		|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
		|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.Партия КАК Партия,
		|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
		|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ЗапасыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗапасыОстатки.Организация КАК Организация,
		|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
		|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|		ЗапасыОстатки.Характеристика КАК Характеристика,
		|		ЗапасыОстатки.Партия КАК Партия,
		|		ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя,
		|		СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|		СУММА(ЗапасыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток,
		|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл
		|	ИЗ
		|		РегистрНакопления.ЗапасыВВалюте.Остатки(
		|				&МоментКонтроля,
		//|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В  //+++ Дмгг
		|				(Организация, СтруктурнаяЕдиница, СчетУчета, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В  //+++ Дмгг
		|					(ВЫБРАТЬ
		|						ТаблицаЗапасы.Организация,
		|						ТаблицаЗапасы.СтруктурнаяЕдиница,
		|						ТаблицаЗапасы.СчетУчета,
		|						ТаблицаЗапасы.СчетУчетаРегл,  //+++ ДМгг
		|						ТаблицаЗапасы.Номенклатура,
		|						ТаблицаЗапасы.Характеристика,
		|						ТаблицаЗапасы.Партия,
		|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|					ИЗ
		|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЗапасыОстатки.Организация,
		|		ЗапасыОстатки.СтруктурнаяЕдиница,
		|		ЗапасыОстатки.СчетУчета,
		|		ЗапасыОстатки.Номенклатура,
		|		ЗапасыОстатки.Характеристика,
		|		ЗапасыОстатки.Партия,
		|		ЗапасыОстатки.СчетУчетаРегл
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокументаЗапасы.Организация,
		|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
		|		ДвиженияДокументаЗапасы.СчетУчета,
		|		ДвиженияДокументаЗапасы.Номенклатура,
		|		ДвиженияДокументаЗапасы.Характеристика,
		|		ДвиженияДокументаЗапасы.Партия,
		|		ДвиженияДокументаЗапасы.ЗаказПокупателя,
		|		ВЫБОР
		|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
		|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.СуммаВал, 0)
		|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.СуммаВал, 0)
		|		КОНЕЦ,
		|		ДвиженияДокументаЗапасы.СчетУчетаРегл
		|	ИЗ
		|		РегистрНакопления.ЗапасыВВалюте КАК ДвиженияДокументаЗапасы
		|	ГДЕ
		|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
		|		И ДвиженияДокументаЗапасы.Период <= &ПериодКонтроля) КАК ЗапасыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстатки.Организация,
		|	ЗапасыОстатки.СтруктурнаяЕдиница,
		|	ЗапасыОстатки.СчетУчета,
		|	ЗапасыОстатки.Номенклатура,
		|	ЗапасыОстатки.Характеристика,
		|	ЗапасыОстатки.Партия,
		|	ЗапасыОстатки.ЗаказПокупателя,
		|	ЗапасыОстатки.СчетУчетаРегл";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходнаяНакладная);
		Запрос.УстановитьПараметр("МоментКонтроля", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
		
	КонецЕсли;
	
	СтруктураСчетовКурсРазниц = РегистрыСведений.УчетнаяПолитикаРегл.СоздатьМенеджерЗаписи();
	СтруктураСчетовКурсРазниц.Организация = ДокументСсылкаРасходнаяНакладная.Организация;
	СтруктураСчетовКурсРазниц.Период = ДокументСсылкаРасходнаяНакладная.Дата;
	СтруктураСчетовКурсРазниц.Прочитать();
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	
		ПоложительнаяКурсоваяРазница = СтруктураСчетовКурсРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
		ОтрицательнаяКурсоваяРазница = СтруктураСчетовКурсРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
		СчетПрочиеДоходыРегл = СтруктураСчетовКурсРазниц.СчетПрочихДоходов;
		СчетПрочиеРасходыРегл = СтруктураСчетовКурсРазниц.СчетПрочихРасходов;
		
	Иначе
	
		ПоложительнаяКурсоваяРазница = ПланыСчетов.Хозрасчетный.Вспомогательный;
		ОтрицательнаяКурсоваяРазница = ПланыСчетов.Хозрасчетный.Вспомогательный;
		СчетПрочиеДоходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		СчетПрочиеРасходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();

	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗапасыОстатки = РезультатЗапроса.Выгрузить();
	
	ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,Номенклатура,Характеристика,Партия");
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте.Колонки.Добавить("Порядок", ОбщегоНазначения.ОписаниеТипаЧисло(15));
	
	Для н = 0 По СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте.Количество() - 1 Цикл
		
		СтрокаТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте[н];
		
		СтрокаТаблицаЗапасы.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ВозвратПоставщику;
		
		СтруктураДляПоиска = Новый Структура;
		СтруктураДляПоиска.Вставить("Организация", СтрокаТаблицаЗапасы.Организация);
		СтруктураДляПоиска.Вставить("СчетУчета", СтрокаТаблицаЗапасы.СчетУчета);
		СтруктураДляПоиска.Вставить("СчетУчетаРегл", СтрокаТаблицаЗапасы.СчетУчетаРегл);
		СтруктураДляПоиска.Вставить("Номенклатура", СтрокаТаблицаЗапасы.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", СтрокаТаблицаЗапасы.Характеристика);
		СтруктураДляПоиска.Вставить("Партия", СтрокаТаблицаЗапасы.Партия);
		
		КоличествоТребуетсяСвободныйОстаток = -СтрокаТаблицаЗапасы.Количество;
		
		Если КоличествоТребуетсяСвободныйОстаток > 0 Тогда
			
			МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
			
			КоличествоОстаток = 0;
			СуммаВалОстаток = 0;
			
			Если МассивСтрокОстатков.Количество() > 0 Тогда
				КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
				СуммаВалОстаток = МассивСтрокОстатков[0].СуммаВалОстаток;
			КонецЕсли;
			
			Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуетсяСвободныйОстаток Тогда
				
				СуммаКСписанию = Окр(СуммаВалОстаток * КоличествоТребуетсяСвободныйОстаток / КоличествоОстаток , 2, 1);
				
				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуетсяСвободныйОстаток;
				МассивСтрокОстатков[0].СуммаВалОстаток = МассивСтрокОстатков[0].СуммаВалОстаток - СуммаКСписанию;
				
			ИначеЕсли КоличествоОстаток = КоличествоТребуетсяСвободныйОстаток Тогда
				
				СуммаКСписанию = СуммаВалОстаток;
				
				МассивСтрокОстатков[0].КоличествоОстаток = 0;
				МассивСтрокОстатков[0].СуммаВалОстаток = 0;
				
			Иначе
				СуммаКСписанию = 0;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьТаблицаЗапасыВозвратВВалюте() // Олег Литвиненко <---

Функция ПолучитьСтруктуруДТРегл(МассивСчетовДтРегл, МассивСчетовКтРегл, ДокументСсылкаРасходнаяНакладная)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйВидыСубконто1.Ссылка КАК Счет,
		|	ХозрасчетныйВидыСубконто1.Ссылка.Код КАК Код,
		|	ХозрасчетныйВидыСубконто1.ВидСубконто.ИмяПредопределенныхДанных КАК ВидСубконто
		|ИЗ
		|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто1
		|ГДЕ
		|	(ХозрасчетныйВидыСубконто1.Ссылка В (&МасивСчетовДтРегл)
		|			ИЛИ ХозрасчетныйВидыСубконто1.Ссылка В (&МасивСчетовКтРегл))
		|ИТОГИ ПО
		|	Счет";
	
	Запрос.УстановитьПараметр("МасивСчетовДтРегл", МассивСчетовДтРегл);
	Запрос.УстановитьПараметр("МасивСчетовКтРегл", МассивСчетовКтРегл);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСчетов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СоответствиеСчетов = Новый Соответствие;
	
	Пока ВыборкаСчетов.Следующий() Цикл
		
		СтруктураСубконто = Новый Структура;
		СтруктураСубконто.Вставить("ВидСубконто1", "");
		СтруктураСубконто.Вставить("ВидСубконто2", "");
		СтруктураСубконто.Вставить("ВидСубконто3", "");
		
		ВыборкаДетальныхЗаписей = ВыборкаСчетов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Счетчик = 1;
		Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
			
			СтруктураСубконто["ВидСубконто"+Счетчик] = ВыборкаДетальныхЗаписей.ВидСубконто;
			
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
		
		СоответствиеСчетов.Вставить(ВыборкаСчетов.Счет, СтруктураСубконто);
		
	КонецЦикла;
	
	СтруктураСубконтоДт = ПолучитьСтруктуруЗаполненияСубконтоДт(ДокументСсылкаРасходнаяНакладная);
	СтруктураСубконтоКт = ПолучитьСтруктуруЗаполненияСубконтоКт(ДокументСсылкаРасходнаяНакладная);
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("СоответствиеСчетов", СоответствиеСчетов);
	СтруктураВозврата.Вставить("СтруктураСубконтоДт", СтруктураСубконтоДт);
	СтруктураВозврата.Вставить("СтруктураСубконтоКт", СтруктураСубконтоКт);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьСтруктуруЗаполненияСубконтоДт(ДокументСсылкаРасходнаяНакладная)

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Продавцы"						, "");
	СтруктураВозврата.Вставить("Подразделения"					, "ПодразделениеПродажи");
	СтруктураВозврата.Вставить("СчетФактураПокупателя"			, "");
	СтруктураВозврата.Вставить("Валюты"							, ДокументСсылкаРасходнаяНакладная.ВалютаДокумента);
	СтруктураВозврата.Вставить("Документ"						, ДокументСсылкаРасходнаяНакладная); //+++ Дмгг, Походу кто-то добавил новое субконто
	СтруктураВозврата.Вставить("Сотрудники"						, "");
	СтруктураВозврата.Вставить("СотрудникНоменклатура"			, "Номенклатура");
	СтруктураВозврата.Вставить("КонтрагентыСотрудники"			, ДокументСсылкаРасходнаяНакладная.Контрагент);
	СтруктураВозврата.Вставить("Контрагенты"					, ДокументСсылкаРасходнаяНакладная.Контрагент);
	СтруктураВозврата.Вставить("СчетФактураПоставщика"			, "");
	СтруктураВозврата.Вставить("Номенклатура"					, "Номенклатура");
	СтруктураВозврата.Вставить("ХарактеристикиНоменклатуры"		, "Характеристика");
	СтруктураВозврата.Вставить("ОбособленныеПодразделения"		, "");
	СтруктураВозврата.Вставить("Продукция"						, "Номенклатура");
	СтруктураВозврата.Вставить("БанковскиеСчета"				, ДокументСсылкаРасходнаяНакладная.БанковскийСчет);
	СтруктураВозврата.Вставить("Касса"							, "");
	СтруктураВозврата.Вставить("СтавкиНДФЛ"						, "");
	СтруктураВозврата.Вставить("Склады"							, "СтруктурнаяЕдиница");
	СтруктураВозврата.Вставить("ТипыСуммГрафикаКредитовИЗаймов"	, "");
	СтруктураВозврата.Вставить("ДоговорыКредитовИЗаймов"		, "");
	СтруктураВозврата.Вставить("НомераГТД"						, "");
	СтруктураВозврата.Вставить("РаботникиОрганизаций"			, "");
	СтруктураВозврата.Вставить("СтатьиДвиженияДенежныхСредств"	, "");
	СтруктураВозврата.Вставить("Имущество"						, "");
	СтруктураВозврата.Вставить("ДокументыРасчетовСКонтрагентами", "");
	СтруктураВозврата.Вставить("Партии"							, "Партия");
	СтруктураВозврата.Вставить("Договоры"						, ДокументСсылкаРасходнаяНакладная.Договор);
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	СтруктураВозврата.Вставить("Проекты"						, "Проект");
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	
	Возврат СтруктураВозврата;

КонецФункции // ПолучитьСтруктуруЗаполненияСубконто()

Функция ПолучитьСтруктуруЗаполненияСубконтоКт(ДокументСсылкаРасходнаяНакладная)

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Продавцы"						, "");
	СтруктураВозврата.Вставить("Подразделения"					, "ПодразделениеПродажи");
	СтруктураВозврата.Вставить("СчетФактураПокупателя"			, "");
	СтруктураВозврата.Вставить("Валюты"							, ДокументСсылкаРасходнаяНакладная.ВалютаДокумента);
	СтруктураВозврата.Вставить("Документ"						, ДокументСсылкаРасходнаяНакладная); //+++ Дмгг, Походу кто-то добавил новое субконто
	СтруктураВозврата.Вставить("Сотрудники"						, "");
	СтруктураВозврата.Вставить("СотрудникНоменклатура"			, "Номенклатура");
	СтруктураВозврата.Вставить("КонтрагентыСотрудники"			, ДокументСсылкаРасходнаяНакладная.Контрагент);
	СтруктураВозврата.Вставить("Контрагенты"					, ДокументСсылкаРасходнаяНакладная.Контрагент);
	СтруктураВозврата.Вставить("СчетФактураПоставщика"			, "");
	СтруктураВозврата.Вставить("Номенклатура"					, "Номенклатура");
	СтруктураВозврата.Вставить("ХарактеристикиНоменклатуры"		, "Характеристика");
	СтруктураВозврата.Вставить("ОбособленныеПодразделения"		, "");
	СтруктураВозврата.Вставить("Продукция"						, "");
	СтруктураВозврата.Вставить("БанковскиеСчета"				, ДокументСсылкаРасходнаяНакладная.БанковскийСчет);
	СтруктураВозврата.Вставить("Касса"							, "");
	СтруктураВозврата.Вставить("СтавкиНДФЛ"						, "");
	СтруктураВозврата.Вставить("Склады"							, "СтруктурнаяЕдиница");
	СтруктураВозврата.Вставить("ТипыСуммГрафикаКредитовИЗаймов"	, "");
	СтруктураВозврата.Вставить("ДоговорыКредитовИЗаймов"		, "");
	СтруктураВозврата.Вставить("НомераГТД"						, "");
	СтруктураВозврата.Вставить("РаботникиОрганизаций"			, "");
	СтруктураВозврата.Вставить("СтатьиДвиженияДенежныхСредств"	, "");
	СтруктураВозврата.Вставить("Имущество"						, "");
	СтруктураВозврата.Вставить("ДокументыРасчетовСКонтрагентами", "");
	СтруктураВозврата.Вставить("Партии"							, "Партия");
	СтруктураВозврата.Вставить("Договоры"						, ДокументСсылкаРасходнаяНакладная.Договор);
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	СтруктураВозврата.Вставить("Проекты"						, "Проект");
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	
	Возврат СтруктураВозврата;

КонецФункции // ПолучитьСтруктуруЗаполненияСубконто()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыВозврат(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	ОснованиеНакладная = Неопределено;
	Если ЗначениеЗаполнено(ДокументСсылкаРасходнаяНакладная.ДокументОснование)
		И ТипЗнч(ДокументСсылкаРасходнаяНакладная.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		ОснованиеНакладная = ДокументСсылкаРасходнаяНакладная.ДокументОснование;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	// Установка исключительной блокировки контролируемых остатков запасов.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.СчетУчетаРегл";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Запасы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	// Получение остатков запасов по стоимости. 
	
	СтруктураСчетовКурсРазниц = РегистрыСведений.УчетнаяПолитикаРегл.СоздатьМенеджерЗаписи();
	СтруктураСчетовКурсРазниц.Организация = ДокументСсылкаРасходнаяНакладная.Организация;
	СтруктураСчетовКурсРазниц.Период = ДокументСсылкаРасходнаяНакладная.Дата;
	СтруктураСчетовКурсРазниц.Прочитать();
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	
		ПоложительнаяКурсоваяРазница = СтруктураСчетовКурсРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
		ОтрицательнаяКурсоваяРазница = СтруктураСчетовКурсРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
		СчетПрочиеДоходыРегл = СтруктураСчетовКурсРазниц.СчетПрочихДоходов;
		СчетПрочиеРасходыРегл = СтруктураСчетовКурсРазниц.СчетПрочихРасходов;
		
	Иначе
	
		ПоложительнаяКурсоваяРазница = ПланыСчетов.Хозрасчетный.Вспомогательный;
		ОтрицательнаяКурсоваяРазница = ПланыСчетов.Хозрасчетный.Вспомогательный;
		СчетПрочиеДоходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		СчетПрочиеРасходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();

	КонецЕсли;
	
	//Малышев 2024-11-25 ONESOFT-3602
	//РезультатЗапроса = Запрос.Выполнить();
	//ТаблицаЗапасыОстатки = РезультатЗапроса.Выгрузить();
	ТаблицаЗапасыОстатки = УправлениеНебольшойФирмойСервер.ПолучитьОстаткиЗапасовПоСтоимостиПриПроведении(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства,,,,,Ложь).Выгрузить(); 
	
	//ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,Номенклатура,Характеристика,Партия");
	ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия");
	НоваяТаблицаДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.СкопироватьКолонки();
	НоваяТаблицаДвижений.Колонки.Добавить("ДокументПоступления");
	НоваяТаблицаДвижений.Колонки.Добавить("СуммаВозврата");
	
	Для н = 0 По СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Количество() - 1 Цикл

		КоличествоКСписанию = 0;
		СуммаКСписанию = 0;
		
		СтрокаТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы[н];
		
		СтруктураДляПоиска = УправлениеНебольшойФирмойСервер.ПолучитьСтруктуруДляПоиска(СтрокаТаблицаЗапасы, СтруктураДополнительныеСвойства);
		
		КоличествоТребуетсяСвободныйОстаток = -СтрокаТаблицаЗапасы.Количество;
		
		Если КоличествоТребуетсяСвободныйОстаток > 0 Тогда
			
			МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
			
			//Малышев 2024-11-19 ONESOFT-3602
			Для каждого СтрокаТаблицыОстатков из МассивСтрокОстатков Цикл
			
				Если КоличествоТребуетсяСвободныйОстаток <= 0 Тогда
					Прервать;
				КонецЕсли;	
 

			//КоличествоОстаток = 0;
			//СуммаОстаток = 0;
			//
			//Если МассивСтрокОстатков.Количество() > 0 Тогда
			//	КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
			//	СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток;
			//КонецЕсли;
			
			КоличествоОстаток = СтрокаТаблицыОстатков.КоличествоОстаток;
			СуммаОстаток = СтрокаТаблицыОстатков.СуммаОстаток;
			
			КоличествоКСписанию = 0;
			СуммаКСписанию = 0;
		
			Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуетсяСвободныйОстаток Тогда
				
				КоличествоКСписанию = КоличествоТребуетсяСвободныйОстаток;
				СуммаКСписанию = Окр(СуммаОстаток * КоличествоТребуетсяСвободныйОстаток / КоличествоОстаток , 2, 1);
				
				//МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуетсяСвободныйОстаток;
				СтрокаТаблицыОстатков.КоличествоОстаток = СтрокаТаблицыОстатков.КоличествоОстаток - КоличествоКСписанию;
				//МассивСтрокОстатков[0].СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток - СуммаКСписанию;
				СтрокаТаблицыОстатков.СуммаОстаток = СтрокаТаблицыОстатков.СуммаОстаток - СуммаКСписанию;
				
			ИначеЕсли КоличествоОстаток <= 0 Тогда  
				Продолжить;
				
			//ИначеЕсли КоличествоОстаток = КоличествоТребуетсяСвободныйОстаток Тогда
			ИначеЕсли КоличествоОстаток >0 и КоличествоОстаток <= КоличествоТребуетсяСвободныйОстаток Тогда //Малышев 2024-11-19 ONESOFT-3602

				КоличествоКСписанию = КоличествоОстаток; 
				СуммаКСписанию = СуммаОстаток;
				
				//МассивСтрокОстатков[0].КоличествоОстаток = 0;
				СтрокаТаблицыОстатков.КоличествоОстаток = 0;
				//МассивСтрокОстатков[0].СуммаОстаток = 0;
				СтрокаТаблицыОстатков.СуммаОстаток = 0;
				
			Иначе
				СуммаКСписанию = 0;
			КонецЕсли;

			КоличествоТребуетсяСвободныйОстаток = КоличествоТребуетсяСвободныйОстаток - КоличествоКСписанию; //Малышев 2024-11-19 ONESOFT-3602

			// Запасы.
			//Если Окр((СтрокаТаблицаЗапасы.Сумма + СуммаКСписанию), 2, 1) <> 0 Тогда
			Если КоличествоКСписанию<>0  или Окр((СтрокаТаблицаЗапасы.Сумма + СуммаКСписанию), 2, 1) <> 0 Тогда
				
				СтрокаТаблицыРасход = НоваяТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
				СтрокаТаблицыРасход.Сумма = -СуммаКСписанию;
				СтрокаТаблицыРасход.Количество = -КоличествоКСписанию;
				СтрокаТаблицыРасход.ДокументПоступления = СтрокаТаблицыОстатков.ДокументПоступления;
				
				СтрокаТаблицыРасход.Себестоимость = -СуммаКСписанию;
				СтрокаТаблицыРасход.СуммаВозврата = -Окр((СтрокаТаблицаЗапасы.Сумма * КоличествоКСписанию/ СтрокаТаблицаЗапасы.Количество),2);
				
				Если ДокументСсылкаРасходнаяНакладная.ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда  //+++ Дмгг
					СтрокаТаблицыРасход = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
					
					РасчетнаяСумма = -(СтрокаТаблицыРасход.Сумма + СуммаКСписанию);
					СтрокаТаблицыРасход.ВидДвижения = ВидДвиженияНакопления.Приход;
					СтрокаТаблицыРасход.Сумма = РасчетнаяСумма;
					
					СтрокаТаблицыРасход.Количество = 0;
					СтрокаТаблицыРасход.ДокументПродажи = ДокументСсылкаРасходнаяНакладная;
					СтрокаТаблицыРасход.Возврат = Истина;
					СтрокаТаблицыРасход.ФиксированнаяСтоимость = Истина;
				
				// Доходы и расходы.
				//Если ДокументСсылкаРасходнаяНакладная.ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда  //+++ Дмгг Перенес Выещн
					СтрокаДоходыИРасходы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДоходыИРасходы, СтрокаТаблицаЗапасы);
					
					СтрокаДоходыИРасходы.СтруктурнаяЕдиница = Неопределено;
					СтрокаДоходыИРасходы.ЗаказПокупателя = Неопределено;
					СтрокаДоходыИРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					Если СтрокаТаблицыРасход.Сумма < 0 Тогда
						СтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
						СтрокаДоходыИРасходы.СчетУчетаРегл = СчетПрочиеРасходыРегл;
						СтрокаДоходыИРасходы.СуммаРасходов = - СтрокаТаблицыРасход.Сумма;
					Иначе
						СтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
						СтрокаДоходыИРасходы.СчетУчетаРегл = СчетПрочиеДоходыРегл;
						СтрокаДоходыИРасходы.СуммаДоходов = СтрокаТаблицыРасход.Сумма;
					КонецЕсли;
				
					СтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='ხარჯების ასახვა';
																	|ru='Отражение расходов';
																	|en='reflection expenditure'");
				КонецЕсли;
				
			КонецЕсли;
			КонецЦикла; //по остаткам
			// Kuzmich, 04.06.2025, (ONESOFT-3975) ნიკა პლასტი - წარმოების დოკუმენტის დროს, უარყოფითი ნაშთები არ აისახება მარაგებში და დანახარჯებში, доделки
			// делаем отрицательный остаток
			Если КоличествоТребуетсяСвободныйОстаток > 0 Тогда
				// Запасы.
				СтрокаТаблицыРасход = НоваяТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
				//СтрокаТаблицыРасход.Сумма = -СуммаКСписанию;
				СтрокаТаблицыРасход.Сумма = 0;
				СтрокаТаблицыРасход.Количество = -КоличествоТребуетсяСвободныйОстаток;
				попытка //Малышев 2025-10-22 ONESOFT-4450
				СтрокаТаблицыРасход.ДокументПоступления = СтрокаТаблицыОстатков.ДокументПоступления;
				исключение
				КонецПопытки;
				
				СтрокаТаблицыРасход.Себестоимость = -СуммаКСписанию;
				СтрокаТаблицыРасход.СуммаВозврата = -Окр((СтрокаТаблицаЗапасы.Сумма * КоличествоКСписанию/ СтрокаТаблицаЗапасы.Количество),2);
				
				Если ДокументСсылкаРасходнаяНакладная.ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда  //+++ Дмгг
					СтрокаТаблицыРасход = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
					
					//РасчетнаяСумма = -(СтрокаТаблицыРасход.Сумма + СуммаКСписанию);
					СтрокаТаблицыРасход.ВидДвижения = ВидДвиженияНакопления.Приход;
					//СтрокаТаблицыРасход.Сумма = РасчетнаяСумма;
					СтрокаТаблицыРасход.Сумма = 0;
					
					СтрокаТаблицыРасход.Количество = 0;
					СтрокаТаблицыРасход.ДокументПродажи = ДокументСсылкаРасходнаяНакладная;
					СтрокаТаблицыРасход.Возврат = Истина;
					СтрокаТаблицыРасход.ФиксированнаяСтоимость = Истина;
					
					// Доходы и расходы.
					//Если ДокументСсылкаРасходнаяНакладная.ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда  //+++ Дмгг Перенес Выещн
					СтрокаДоходыИРасходы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДоходыИРасходы, СтрокаТаблицаЗапасы);
					
					СтрокаДоходыИРасходы.СтруктурнаяЕдиница = Неопределено;
					СтрокаДоходыИРасходы.ЗаказПокупателя = Неопределено;
					СтрокаДоходыИРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					Если СтрокаТаблицыРасход.Сумма < 0 Тогда
						СтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
						СтрокаДоходыИРасходы.СчетУчетаРегл = СчетПрочиеРасходыРегл;
						СтрокаДоходыИРасходы.СуммаРасходов = - СтрокаТаблицыРасход.Сумма;
					Иначе
						СтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
						СтрокаДоходыИРасходы.СчетУчетаРегл = СчетПрочиеДоходыРегл;
						СтрокаДоходыИРасходы.СуммаДоходов = СтрокаТаблицыРасход.Сумма;
					КонецЕсли;
					
					СтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
				КонецЕсли;
				
			КонецЕсли;
			// Kuzmich, 04.06.2025, (ONESOFT-3975) ნიკა პლასტი - წარმოების დოკუმენტის დროს, უარყოფითი ნაშთები არ აისახება მარაგებში და დანახარჯებში, доделки
		КонецЕсли;
		
	КонецЦикла;
	
	//Малышев 2024-11-19 ONESOFT-3602
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы = НоваяТаблицаДвижений;
	
КонецПроцедуры // СформироватьТаблицаЗапасыВозврат()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗакупки(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗакупки.Период КАК Период,
	|	ТаблицаЗакупки.Организация КАК Организация,
	|	ТаблицаЗакупки.Номенклатура КАК Номенклатура,
	|	ТаблицаЗакупки.Характеристика КАК Характеристика,
	|	ТаблицаЗакупки.Партия КАК Партия,
	|	ТаблицаЗакупки.Заказ КАК ЗаказПоставщику,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаЗакупки.ДокументОснование) = ТИП(Документ.ПриходнаяНакладная)
	|				И ТаблицаЗакупки.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)
	|			ТОГДА ТаблицаЗакупки.ДокументОснование
	|		ИНАЧЕ ТаблицаЗакупки.Документ
	|	КОНЕЦ КАК Документ,
	|	ТаблицаЗакупки.СтавкаНДС КАК СтавкаНДС,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаЗакупки.Проект КАК Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }	
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаЗакупки.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаЗакупки.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare_	
	|	-СУММА(ТаблицаЗакупки.Количество) КАК Количество,
	|	-СУММА(ТаблицаЗакупки.СуммаНДСЗакупкиПродажи) КАК СуммаНДС,
	|	-СУММА(ТаблицаЗакупки.Сумма) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗакупки
	|ГДЕ
	|	ТаблицаЗакупки.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	И (ТаблицаЗакупки.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ИЛИ ТаблицаЗакупки.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗакупки.Период,
	|	ТаблицаЗакупки.Организация,
	|	ТаблицаЗакупки.Номенклатура,
	|	ТаблицаЗакупки.Характеристика,
	|	ТаблицаЗакупки.Партия,
	|	ТаблицаЗакупки.Заказ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаЗакупки.ДокументОснование) = ТИП(Документ.ПриходнаяНакладная)
	|				И ТаблицаЗакупки.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)
	|			ТОГДА ТаблицаЗакупки.ДокументОснование
	|		ИНАЧЕ ТаблицаЗакупки.Документ
	|	КОНЕЦ,
	|	ТаблицаЗакупки.СтавкаНДС,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаЗакупки.Проект";
	////ПодольскийАИ #УчетПроектов 10.10.2020 }	
	
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаЗакупки.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаЗакупки.Проект
	|	КОНЕЦ ";
	//Lazare_
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗакупки", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗакупки()

// Формирует таблицу значений, содержащую данные для проведения по регистру БалыЛояльности.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаБалыЛояльности(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 как Порядок,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) Как ВидДвижения,
	|	ВременнаяТаблицаБалыЛояльности.Период КАК Период,
	|	ВременнаяТаблицаБалыЛояльности.КартаЛояльности КАК КартаЛояльности,
	|	ВременнаяТаблицаБалыЛояльности.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаБалыЛояльности.Договор КАК Договор,
	|	СУММА(ВременнаяТаблицаБалыЛояльности.Всего) КАК Сумма,
	|	СУММА(ВременнаяТаблицаБалыЛояльности.КоличествоПриход) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаБалыЛояльности КАК ВременнаяТаблицаБалыЛояльности
	|ГДЕ
	|	ВременнаяТаблицаБалыЛояльности.КоличествоПриход <> 0
	|	И (ВременнаяТаблицаБалыЛояльности.ВидИспользоыванияБалов = ЗНАЧЕНИЕ(Перечисление.ВидыИспользованияБалов.Накопление)
	|		ИЛИ ВременнаяТаблицаБалыЛояльности.ВидИспользоыванияБалов = ЗНАЧЕНИЕ(Перечисление.ВидыИспользованияБалов.НакоплениеИРасход))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаБалыЛояльности.Период,
	|	ВременнаяТаблицаБалыЛояльности.КартаЛояльности,
	|	ВременнаяТаблицаБалыЛояльности.Контрагент,
	|	ВременнаяТаблицаБалыЛояльности.Договор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВременнаяТаблицаБалыЛояльности.Период,
	|	ВременнаяТаблицаБалыЛояльности.КартаЛояльности,
	|	ВременнаяТаблицаБалыЛояльности.Контрагент,
	|	ВременнаяТаблицаБалыЛояльности.Договор,
	|	СУММА(-ВременнаяТаблицаБалыЛояльности.КоличествоРасход), //ONESOFT-3509 сумма как количество    СУММА(ВременнаяТаблицаБалыЛояльности.Сумма),
	|	СУММА(-ВременнаяТаблицаБалыЛояльности.КоличествоРасход)
	|ИЗ
	|	ВременнаяТаблицаБалыЛояльности КАК ВременнаяТаблицаБалыЛояльности
	|ГДЕ
	|	ВременнаяТаблицаБалыЛояльности.КоличествоРасход <> 0
	|	И (ВременнаяТаблицаБалыЛояльности.ВидИспользоыванияБалов = ЗНАЧЕНИЕ(Перечисление.ВидыИспользованияБалов.Расход)
	|		ИЛИ ВременнаяТаблицаБалыЛояльности.ВидИспользоыванияБалов = ЗНАЧЕНИЕ(Перечисление.ВидыИспользованияБалов.НакоплениеИРасход))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаБалыЛояльности.КартаЛояльности,
	|	ВременнаяТаблицаБалыЛояльности.Период,
	|	ВременнаяТаблицаБалыЛояльности.Контрагент,
	|	ВременнаяТаблицаБалыЛояльности.Договор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБалыЛояльности", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПродажиПоПредоставленнымАвтоматическимСкидкам()


// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПродажи(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	| 	1 КАК Порядок,
	|	ТаблицаПродажи.Период КАК Период,
	|	ТаблицаПродажи.Организация КАК Организация,
	|	ТаблицаПродажи.Номенклатура КАК Номенклатура,
	|	ТаблицаПродажи.Характеристика КАК Характеристика,
	|	ТаблицаПродажи.Партия КАК Партия,
	|	Значение(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТаблицаПродажи.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ТаблицаПродажи.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ТаблицаПродажи.Документ КАК Документ,
	|	ТаблицаПродажи.СтавкаНДС КАК СтавкаНДС,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаПродажи.Проект КАК Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }	
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаПродажи.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаПродажи.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare_
	|	ТаблицаПродажи.ПодразделениеПродажи КАК Подразделение,
	|	ТаблицаПродажи.Ответственный КАК Ответственный,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	
	////Малышев 2024-11-11 (--
	////|	СУММА(ТаблицаПродажи.СуммаНДСЗакупкиПродажи) КАК СуммаНДС,
	//|	СУММА(ТаблицаПродажи.СуммаНДССтроки) КАК СуммаНДС,
	////Малышев 2024-11-11 --)                            
	// Kuzmich, 18.12.2024, (ONESOFT-3709) Сумма НДС в отправленной счет фактуре
	|	СУММА(ТаблицаПродажи.СуммаНДСРегл) КАК СуммаНДС,
	// Kuzmich, 18.12.2024, (ONESOFT-3709) Сумма НДС в отправленной счет фактуре
	|	СУММА(ТаблицаПродажи.Сумма) КАК Сумма,
	|	ТаблицаПродажи.ЭтоПодарок КАК Этоподарок,
	|	0 КАК Себестоимость
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаПродажи
	|ГДЕ
	|	ТаблицаПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.Организация,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Характеристика,
	|	ТаблицаПродажи.Партия,
	|	Значение(Справочник.Контрагенты.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ТаблицаПродажи.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ТаблицаПродажи.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаПродажи.Документ,
	|	ТаблицаПродажи.СтавкаНДС,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаПродажи.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }	
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаПродажи.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаПродажи.Проект
	|	КОНЕЦ,
	//Lazare_	
	|	ТаблицаПродажи.ПодразделениеПродажи,
	|	ТаблицаПродажи.ЭтоПодарок,
	|	ТаблицаПродажи.Ответственный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   2,
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.Организация,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Характеристика,
	|	ТаблицаПродажи.Партия,
	|	ТаблицаПродажи.Сотрудник,
	|	ВЫБОР
	|		КОГДА ТаблицаПродажи.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ТаблицаПродажи.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаПродажи.Документ,
	|	ТаблицаПродажи.СтавкаНДС,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаПродажи.Проект КАК Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаПродажи.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаПродажи.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare_
	|	ТаблицаПродажи.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаПродажи.Ответственный,
	|	СУММА(ТаблицаПродажи.Количество),
	|	СУММА(ТаблицаПродажи.СуммаНДСБезвозмездно),
	|	СУММА(ТаблицаПродажи.Сумма - ТаблицаПродажи.СуммаНДФЛ - ТаблицаПродажи.УдержаниеПенсии),
	|	ТаблицаПродажи.ЭтоПодарок,
	|	0
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаПродажи
	|ГДЕ
	|	ТаблицаПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.Организация,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Характеристика,
	|	ТаблицаПродажи.Партия,
	|	ТаблицаПродажи.Сотрудник,
	|	ТаблицаПродажи.ЭтоПодарок,
	|	ВЫБОР
	|		КОГДА ТаблицаПродажи.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ТаблицаПродажи.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаПродажи.Документ,
	|	ТаблицаПродажи.СтавкаНДС,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаПродажи.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаПродажи.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаПродажи.Проект
	|	КОНЕЦ,
	//Lazare_	
	|	ТаблицаПродажи.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаПродажи.Ответственный";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажи", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПродажи()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВыпускПродукции(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаВыпускПродукции.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаВыпускПродукции.Период КАК Период,
	|	ТаблицаВыпускПродукции.Организация КАК Организация,
	|	ТаблицаВыпускПродукции.ПодразделениеПродажи КАК СтруктурнаяЕдиница,
	|	ТаблицаВыпускПродукции.Номенклатура КАК Номенклатура,
	|	ТаблицаВыпускПродукции.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаВыпускПродукции.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ТаблицаВыпускПродукции.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	СУММА(ТаблицаВыпускПродукции.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаВыпускПродукции
	|ГДЕ
	|	ТаблицаВыпускПродукции.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВыпускПродукции.Период,
	|	ТаблицаВыпускПродукции.Организация,
	|	ТаблицаВыпускПродукции.ПодразделениеПродажи,
	|	ТаблицаВыпускПродукции.Номенклатура,
	|	ТаблицаВыпускПродукции.Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаВыпускПродукции.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ТаблицаВыпускПродукции.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыпускПродукции", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВыпускПродукции()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период КАК Период,
	|	ТаблицаЗапасыНаСкладах.Организация КАК Организация,
	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Характеристика КАК Характеристика,
	|	ТаблицаЗапасыНаСкладах.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасыНаСкладах.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
	|			ТОГДА ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница
	|		ИНАЧЕ ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиницаЗапасы
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Ячейка КАК Ячейка,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаЗапасыНаСкладах.Проект КАК Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	//|	ВЫБОР
	//|		КОГДА ТаблицаЗапасыНаСкладах.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаЗапасыНаСкладах.Проект
	//|	КОНЕЦ КАК Проект,  	
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам = ЛОЖЬ
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &УчетПоПроектам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаЗапасыНаСкладах.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|					ИНАЧЕ ТаблицаЗапасыНаСкладах.Проект
	|				КОНЕЦ
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|		КОНЕЦ КАК Проект,	
	////Lazare_	ONESOFT-4062
	//|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество,
	////_Lazare
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	СУММА(ВЫБОР
	|		КОГДА ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной.Значение И German_Butcher.Значение
	//|			И ТаблицаЗапасыНаСкладах.КоличествоСобрПотери>0
	|		 ТОГДА ТаблицаЗапасыНаСкладах.Количество+ТаблицаЗапасыНаСкладах.КоличествоСобрПотери
	|	ИНАЧЕ 
	|		ТаблицаЗапасыНаСкладах.Количество
	|	КОНЕЦ) КАК Количество,
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	ТаблицаЗапасыНаСкладах.ПоложениеСклада КАК ПоложениеСклада,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиницаЗапасы КАК СтруктурнаяЕдиницаЗапасы
	//_Lazare	
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,Константа.ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной КАК ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной
	|	,Константа.German_Butcher КАК German_Butcher
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|ГДЕ
	|	ТаблицаЗапасыНаСкладах.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	И НЕ ТаблицаЗапасыНаСкладах.ОрдерныйСклад
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Организация,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Характеристика,
	|	ТаблицаЗапасыНаСкладах.Партия,
	|	ТаблицаЗапасыНаСкладах.Ячейка,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаЗапасыНаСкладах.Проект";
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	//|	ВЫБОР
	//|		КОГДА ТаблицаЗапасыНаСкладах.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаЗапасыНаСкладах.Проект
	//|	КОНЕЦ,  	
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам = ЛОЖЬ
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &УчетПоПроектам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаЗапасыНаСкладах.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|					ИНАЧЕ ТаблицаЗапасыНаСкладах.Проект
	|				КОНЕЦ
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|		КОНЕЦ,
	//Lazare_   ONESOFT-4062
	|	ТаблицаЗапасыНаСкладах.ПоложениеСклада,
	//_Lazare
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиницаЗапасы,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасыНаСкладах.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
	|			ТОГДА ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница
	|		ИНАЧЕ ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиницаЗапасы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасыНаСкладах.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
	|			ТОГДА ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница
	|		ИНАЧЕ ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиницаЗапасы
	|	КОНЕЦ";
	//_Lazare          
	
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам); //_Lazare ONESOFT-4062
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры // СформироватьТаблицаЗапасыНаСкладах()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыКРасходуСоСкладов(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасыКРасходуСоСкладов.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасыКРасходуСоСкладов.Период КАК Период,
	|	ТаблицаЗапасыКРасходуСоСкладов.Организация КАК Организация,
	|	ТаблицаЗапасыКРасходуСоСкладов.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыКРасходуСоСкладов.Характеристика КАК Характеристика,
	|	ТаблицаЗапасыКРасходуСоСкладов.Партия КАК Партия,
	|	ТаблицаЗапасыКРасходуСоСкладов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ТаблицаЗапасыКРасходуСоСкладов.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыКРасходуСоСкладов
	|ГДЕ
	|	ТаблицаЗапасыКРасходуСоСкладов.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	И ТаблицаЗапасыКРасходуСоСкладов.ОрдерныйСклад
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыКРасходуСоСкладов.Период,
	|	ТаблицаЗапасыКРасходуСоСкладов.Организация,
	|	ТаблицаЗапасыКРасходуСоСкладов.Номенклатура,
	|	ТаблицаЗапасыКРасходуСоСкладов.Характеристика,
	|	ТаблицаЗапасыКРасходуСоСкладов.Партия,
	|	ТаблицаЗапасыКРасходуСоСкладов.СтруктурнаяЕдиница";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыКРасходуСоСкладов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыКРасходуСоСкладов()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыПринятые(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	МИНИМУМ(ТаблицаЗапасыПринятые.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасыПринятые.Период КАК Период,
	|	ТаблицаЗапасыПринятые.Организация КАК Организация,
	|	ТаблицаЗапасыПринятые.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыПринятые.Характеристика КАК Характеристика,
	|	ТаблицаЗапасыПринятые.Партия КАК Партия,
	|	ТаблицаЗапасыПринятые.Контрагент КАК Контрагент,
	|	ТаблицаЗапасыПринятые.Договор КАК Договор,
	|	ТаблицаЗапасыПринятые.Заказ КАК Заказ,
	|	ТаблицаЗапасыПринятые.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасыПринятые.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасыПринятые.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ПоступлениеОтКомитента)
	|		КОГДА ТаблицаЗапасыПринятые.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ПоступлениеВПереработку)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ОтветственноеХранение)
	|	КОНЕЦ КАК ТипПриемаПередачи,
	|	-СУММА(ТаблицаЗапасыПринятые.Количество) КАК Количество,
	|	-СУММА(ТаблицаЗапасыПринятые.СуммаРасчетовПринятыеПереданные) КАК СуммаРасчетов,
	|	-СУММА(ТаблицаЗапасыПринятые.СуммаРасчетовПринятыеПереданные) КАК Сумма,
	|	0 КАК СуммаПродажи,
	|	&ВалютаУпрУчета КАК Валюта,
	|	-СУММА(ТаблицаЗапасыПринятые.СуммаРасчетовПринятыеПереданные) КАК СуммаВал,
	|	ВЫРАЗИТЬ(&ПриемЗапасов КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыПринятые
	|ГДЕ
	|	ТаблицаЗапасыПринятые.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	И (ТаблицаЗапасыПринятые.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|			ИЛИ ТаблицаЗапасыПринятые.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|			ИЛИ ТаблицаЗапасыПринятые.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыПринятые.Период,
	|	ТаблицаЗапасыПринятые.Организация,
	|	ТаблицаЗапасыПринятые.Номенклатура,
	|	ТаблицаЗапасыПринятые.Характеристика,
	|	ТаблицаЗапасыПринятые.Партия,
	|	ТаблицаЗапасыПринятые.Контрагент,
	|	ТаблицаЗапасыПринятые.Договор,
	|	ТаблицаЗапасыПринятые.Заказ,
	|	ТаблицаЗапасыПринятые.СчетУчета,
	|	ТаблицаЗапасыПринятые.СчетУчетаРегл, //+++ Дмгг
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасыПринятые.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ПоступлениеОтКомитента)
	|		КОГДА ТаблицаЗапасыПринятые.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ПоступлениеВПереработку)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ОтветственноеХранение)
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	МИНИМУМ(ТаблицаЗапасыПринятые.НомерСтроки),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасыПринятые.Период,
	|	ТаблицаЗапасыПринятые.Организация,
	|	ТаблицаЗапасыПринятые.Номенклатура,
	|	ТаблицаЗапасыПринятые.Характеристика,
	|	ТаблицаЗапасыПринятые.Партия,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаЗапасыПринятые.Заказ,
	|	ТаблицаЗапасыПринятые.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаЗапасыПринятые.СчетУчетаРасчетовСПоставщикомРегл, //+++ Дмгг
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ОтчетКомитенту),
	|	СУММА(ТаблицаЗапасыПринятые.Количество),
	|	0,
	|	СУММА(ТаблицаЗапасыПринятые.Сумма),
	|	СУММА(ТаблицаЗапасыПринятые.Сумма),
	|	&ВалютаУпрУчета,
	|	СУММА(ТаблицаЗапасыПринятые.Сумма),
	|	ВЫРАЗИТЬ(&ПриемЗапасовТоварыНаКомиссии КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыПринятые
	|ГДЕ
	|	ТаблицаЗапасыПринятые.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	И ТаблицаЗапасыПринятые.ТоварыНаКомиссии
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыПринятые.Период,
	|	ТаблицаЗапасыПринятые.Организация,
	|	ТаблицаЗапасыПринятые.Номенклатура,
	|	ТаблицаЗапасыПринятые.Характеристика,
	|	ТаблицаЗапасыПринятые.Партия,
	|	ТаблицаЗапасыПринятые.Контрагент,
	|	ТаблицаЗапасыПринятые.Договор,
	|	ТаблицаЗапасыПринятые.Заказ,
	|	ТаблицаЗапасыПринятые.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаЗапасыПринятые.СчетУчетаРасчетовСПоставщикомРегл"; //+++ Дмгг
	
	Запрос.УстановитьПараметр("ПриемЗапасов", "");
	Запрос.УстановитьПараметр("ПриемЗапасовТоварыНаКомиссии", НСтр("ka='მარაგების მიღება';ru='Прием запасов';en='Admission stocks'"));
	Запрос.УстановитьПараметр("ВалютаУпрУчета", Константы.ВалютаУчета.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыПринятые", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыПринятые()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыПереданные(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасыПереданные.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасыПереданные.Период КАК Период,
	|	ТаблицаЗапасыПереданные.Организация КАК Организация,
	|	ТаблицаЗапасыПереданные.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыПереданные.Характеристика КАК Характеристика,
	|	ТаблицаЗапасыПереданные.Партия КАК Партия,
	|	ТаблицаЗапасыПереданные.Контрагент КАК Контрагент,
	|	ТаблицаЗапасыПереданные.Договор КАК Договор,
	|	ТаблицаЗапасыПереданные.Заказ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасыПереданные.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ПередачаКомиссионеру)
	|		КОГДА ТаблицаЗапасыПереданные.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ПередачаВПереработку)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ОтветственноеХранение)
	|	КОНЕЦ КАК ТипПриемаПередачи,
	|	СУММА(ТаблицаЗапасыПереданные.Количество) КАК Количество,
	|	СУММА(ТаблицаЗапасыПереданные.СуммаРасчетовПринятыеПереданные) КАК СуммаРасчетов
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыПереданные
	|ГДЕ
	|	ТаблицаЗапасыПереданные.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	И (ТаблицаЗапасыПереданные.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|			ИЛИ ТаблицаЗапасыПереданные.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|			ИЛИ ТаблицаЗапасыПереданные.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыПереданные.Период,
	|	ТаблицаЗапасыПереданные.Организация,
	|	ТаблицаЗапасыПереданные.Номенклатура,
	|	ТаблицаЗапасыПереданные.Характеристика,
	|	ТаблицаЗапасыПереданные.Партия,
	|	ТаблицаЗапасыПереданные.Контрагент,
	|	ТаблицаЗапасыПереданные.Договор,
	|	ТаблицаЗапасыПереданные.Заказ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасыПереданные.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ПередачаКомиссионеру)
	|		КОГДА ТаблицаЗапасыПереданные.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ПередачаВПереработку)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ОтветственноеХранение)
	|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыПереданные", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыПереданные()  

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗаказыПокупателей(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗаказыПокупателей.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗаказыПокупателей.Период КАК Период,
	|	ТаблицаЗаказыПокупателей.Организация КАК Организация,
	|	ТаблицаЗаказыПокупателей.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказыПокупателей.Характеристика КАК Характеристика,
	|	ТаблицаЗаказыПокупателей.Заказ КАК ЗаказПокупателя,
	|	СУММА(ТаблицаЗаказыПокупателей.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗаказыПокупателей
	|ГДЕ
	|	ТаблицаЗаказыПокупателей.Заказ <> НЕОПРЕДЕЛЕНО
	|	И (ТаблицаЗаказыПокупателей.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ИЛИ ТаблицаЗаказыПокупателей.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|			ИЛИ ТаблицаЗаказыПокупателей.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаказыПокупателей.Период,
	|	ТаблицаЗаказыПокупателей.Организация,
	|	ТаблицаЗаказыПокупателей.Номенклатура,
	|	ТаблицаЗаказыПокупателей.Характеристика,
	|	ТаблицаЗаказыПокупателей.Заказ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаказыПокупателей", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗаказыПокупателей()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗаказыПоставщикам(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗаказыПоставщикам.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗаказыПоставщикам.Период КАК Период,
	|	ТаблицаЗаказыПоставщикам.Организация КАК Организация,
	|	ТаблицаЗаказыПоставщикам.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказыПоставщикам.Характеристика КАК Характеристика,
	|	ТаблицаЗаказыПоставщикам.Заказ КАК ЗаказПоставщику,
	|	-СУММА(ТаблицаЗаказыПоставщикам.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗаказыПоставщикам
	|ГДЕ
	|	ТаблицаЗаказыПоставщикам.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	И ТаблицаЗаказыПоставщикам.Заказ <> НЕОПРЕДЕЛЕНО
	|	И (ТаблицаЗаказыПоставщикам.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ИЛИ ТаблицаЗаказыПоставщикам.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|			ИЛИ ТаблицаЗаказыПоставщикам.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаказыПоставщикам.Период,
	|	ТаблицаЗаказыПоставщикам.Организация,
	|	ТаблицаЗаказыПоставщикам.Номенклатура,
	|	ТаблицаЗаказыПоставщикам.Характеристика,
	|	ТаблицаЗаказыПоставщикам.Заказ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаказыПоставщикам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗаказыПоставщикам()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	СтруктураСчетовКурсРазниц = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(СтруктураДополнительныеСвойства.ДляПроведения.Организация, СтруктураДополнительныеСвойства.ДляПроведения.Дата);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	МАКСИМУМ(ТаблицаДоходыИРасходы.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период КАК Период,
	|	ТаблицаДоходыИРасходы.Организация КАК Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи КАК СтруктурнаяЕдиница,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельности,
	|	ТаблицаДоходыИРасходы.Заказ КАК ЗаказПокупателя,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект КАК Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare_	
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.ЭтоПодарок
	|				И ТаблицаДоходыИРасходы.СчетУчетаСвободнаяпродажа <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ТаблицаДоходыИРасходы.СчетУчетаСвободнаяпродажа
	|		ИНАЧЕ ТаблицаДоходыИРасходы.СчетУчетаПродажиРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	//|	НЕОПРЕДЕЛЕНО КАК Аналитика,
	|	ТаблицаДоходыИРасходы.Номенклатура КАК Аналитика,
	|	ВЫРАЗИТЬ(&Выручка КАК СТРОКА(100)) КАК СодержаниеПроводки,
	//|	СУММА(ТаблицаДоходыИРасходы.СуммаБезНДС) КАК СуммаДоходов,
	|	СУММА(ВЫБОР
	|		КОГДА ЕСТЬNULL(ВременнаяТаблицаБалыЛояльности.КоличествоПриход, 0) = 0
	//|			ТОГДА ВЫРАЗИТЬ(ТаблицаДоходыИРасходы.Сумма КАК ЧИСЛО(15,2))
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаДоходыИРасходы.СуммаБезНДС КАК ЧИСЛО(15,2))  //++Lazare 07.07.2023
	|		ИНАЧЕ (ВременнаяТаблицаБалыЛояльности.СуммаРегл) //Малышев 2024-11-06 ONESOFT-3558
	|	КОНЕЦ) КАК СуммаДоходов,
	|	0 КАК СуммаРасходов,
	//|	СУММА(ТаблицаДоходыИРасходы.СуммаБезНДС) КАК Сумма
	|	СУММА(ВЫБОР
	|		КОГДА ЕСТЬNULL(ВременнаяТаблицаБалыЛояльности.КоличествоПриход, 0) = 0
	//|			ТОГДА ВЫРАЗИТЬ(ТаблицаДоходыИРасходы.Сумма КАК ЧИСЛО(15,2))
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаДоходыИРасходы.СуммаБезНДС КАК ЧИСЛО(15,2)) //++Lazare 07.07.2023
	|		ИНАЧЕ (ВременнаяТаблицаБалыЛояльности.Сумма - ВременнаяТаблицаБалыЛояльности.КоличествоПриход) / (1+(ТаблицаДоходыИРасходы.СтавкаНДС.Ставка / 100)) //+++ Дмгг ВременнаяТаблицаБалыЛояльности.СуммаРегл
	|	КОНЕЦ) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	//+++ Дмгг
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаБалыЛояльности КАК ВременнаяТаблицаБалыЛояльности
	|		ПО (ТаблицаДоходыИРасходы.НомерСтроки = ВременнаяТаблицаБалыЛояльности.НомерСтроки)
	//--- Дмгг
	|ГДЕ
	|	ТаблицаДоходыИРасходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И ТаблицаДоходыИРасходы.СуммаБезНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.ЭтоПодарок
	|				И ТаблицаДоходыИРасходы.СчетУчетаСвободнаяпродажа <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ТаблицаДоходыИРасходы.СчетУчетаСвободнаяпродажа
	|		ИНАЧЕ ТаблицаДоходыИРасходы.СчетУчетаПродажиРегл
	|	КОНЕЦ
	|	,ТаблицаДоходыИРасходы.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	
	//Малышев 2024-11-06 ONESOFT-3558 (--
	|ВЫБРАТЬ
	|	1.3 КАК Порядок,
	|	МАКСИМУМ(ТаблицаДоходыИРасходы.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период КАК Период,
	|	ТаблицаДоходыИРасходы.Организация КАК Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи КАК СтруктурнаяЕдиница,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельности,
	|	ТаблицаДоходыИРасходы.Заказ КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ КАК Проект,
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи КАК СчетУчета,
	|	ВременнаяТаблицаБалыЛояльности.КартаЛояльностиСчетВыручкиОтПродажиБалловРегл КАК СчетУчетаРегл,
	|	ТаблицаДоходыИРасходы.Номенклатура КАК Аналитика,
	|	ВЫРАЗИТЬ(&Содержание_ПродажаСБаллами КАК СТРОКА(100)) КАК СодержаниеПроводки,
	|	СУММА(ВременнаяТаблицаБалыЛояльности.КоличествоИзрасходованныхБаллов //Малышев 2024-11-06 ONESOFT-3558
	|         - ВременнаяТаблицаБалыЛояльности.СуммаНДСБаллов //Малышев 2024-11-06 ONESOFT-3558
	|	) КАК СуммаДоходов,
	|	0 КАК СуммаРасходов,
	|	СУММА(ВЫБОР
	|		КОГДА ЕСТЬNULL(ВременнаяТаблицаБалыЛояльности.КоличествоПриход, 0) = 0
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаДоходыИРасходы.СуммаБезНДС КАК ЧИСЛО(15,2)) //++Lazare 07.07.2023
	|		ИНАЧЕ (ВременнаяТаблицаБалыЛояльности.Сумма - ВременнаяТаблицаБалыЛояльности.КоличествоПриход) / (1+(ТаблицаДоходыИРасходы.СтавкаНДС.Ставка / 100)) //+++ Дмгг ВременнаяТаблицаБалыЛояльности.СуммаРегл
	|	КОНЕЦ) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаБалыЛояльности КАК ВременнаяТаблицаБалыЛояльности
	|		ПО (ТаблицаДоходыИРасходы.НомерСтроки = ВременнаяТаблицаБалыЛояльности.НомерСтроки)
	|ГДЕ
	|	ТаблицаДоходыИРасходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И ВременнаяТаблицаБалыЛояльности.КоличествоИзрасходованныхБаллов <>0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ВременнаяТаблицаБалыЛояльности.КартаЛояльностиСчетВыручкиОтПродажиБалловРегл,
	|	ТаблицаДоходыИРасходы.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//Малышев 2024-11-06 ONESOFT-3558 --) 
	
	
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	НЕОПРЕДЕЛЕНО,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	НЕОПРЕДЕЛЕНО,
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ОтрицательнаяКурсоваяРазницаСчетУчета
	|		ИНАЧЕ &ПоложительнаяКурсоваяРазницаСчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	1,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	НЕОПРЕДЕЛЕНО,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	НЕОПРЕДЕЛЕНО,
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчета
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Дата КАК Дата,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Организация КАК Организация,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Валюта КАК Валюта,
	|		СУММА(ТаблицаКурсовыхРазницРасчетыСПокупателями.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаДокумента.Дата КАК Дата,
	|			ТаблицаДокумента.Организация КАК Организация,
	|			ТаблицаДокумента.Валюта КАК Валюта,
	|			ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы
	|		ИЗ
	|			ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	|		ГДЕ
	|			ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ТаблицаДокумента.Дата,
	|			ТаблицаДокумента.Организация,
	|			ТаблицаДокумента.Валюта,
	|			ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИЗ
	|			ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	|		ГДЕ
	|			ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазницРасчетыСПокупателями
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Дата,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Организация,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Валюта
	|	
	|	ИМЕЮЩИЕ
	|		(СУММА(ТаблицаКурсовыхРазницРасчетыСПокупателями.СуммаКурсовойРазницы) >= 0.005
	|			ИЛИ СУММА(ТаблицаКурсовыхРазницРасчетыСПокупателями.СуммаКурсовойРазницы) <= -0.005)) КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект КАК Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетЗатратБезвозмезднойПродажи.СчетАналогУУ,
	|	ТаблицаДоходыИРасходы.СчетЗатратБезвозмезднойПродажи,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫРАЗИТЬ(&БезвозмезднаяПродажа КАК СТРОКА(100)),
	|	0,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаБезНДС),
	|	СУММА(ТаблицаДоходыИРасходы.СуммаБезНДС)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	ТаблицаДоходыИРасходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И ТаблицаДоходыИРасходы.СуммаБезНДС <> 0
	|	И ТаблицаДоходыИРасходы.ЭтоПодарок
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетЗатратБезвозмезднойПродажи.СчетАналогУУ,
	|	ТаблицаДоходыИРасходы.СчетЗатратБезвозмезднойПродажи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетЗатратНДСБезвозмезднойПродажи.СчетАналогУУ,
	|	ТаблицаДоходыИРасходы.СчетЗатратНДСБезвозмезднойПродажи,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫРАЗИТЬ(&БезвозмезднаяПродажа КАК СТРОКА(100)),
	|	0,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаНДС),
	|	СУММА(ТаблицаДоходыИРасходы.СуммаНДС)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	ТаблицаДоходыИРасходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И ТаблицаДоходыИРасходы.СуммаБезНДС <> 0
	|	И ТаблицаДоходыИРасходы.ЭтоПодарок
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетЗатратНДСБезвозмезднойПродажи.СчетАналогУУ,
	|	ТаблицаДоходыИРасходы.СчетЗатратНДСБезвозмезднойПродажи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаНалогаНаПрибыль.СчетАналогУУ,
	|	ТаблицаДоходыИРасходы.СчетУчетаНалогаНаПрибыль,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫРАЗИТЬ(&БезвозмезднаяПродажа КАК СТРОКА(100)),
	|	0,
	|	СУММА((ТаблицаДоходыИРасходы.СуммаБезНДС)/0.85*0.15), // + ТаблицаДоходыИРасходы.СуммаБезНДС) / 0.85 * 0.15),
	|	СУММА((ТаблицаДоходыИРасходы.СуммаБезНДС)/0.85*0.15) // + ТаблицаДоходыИРасходы.СуммаБезНДС) / 0.85 * 0.15)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	ТаблицаДоходыИРасходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И ТаблицаДоходыИРасходы.СуммаБезНДС <> 0
	|	И ТаблицаДоходыИРасходы.ЭтоПодарок
	|	И ТаблицаДоходыИРасходы.ПровестиНалогПрибили
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаНалогаНаПрибыль.СчетАналогУУ,
	|	ТаблицаДоходыИРасходы.СчетУчетаНалогаНаПрибыль
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ТаблицаДоходыИРасходы.СчетДоходовБП,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫРАЗИТЬ(&Выручка КАК СТРОКА(100)),
	|	СУММА(ТаблицаДоходыИРасходы.Сумма - ТаблицаДоходыИРасходы.СуммаНДФЛ - ТаблицаДоходыИРасходы.СуммаНДСБезвозмездно - ТаблицаДоходыИРасходы.УдержаниеПенсии),
	|	0,
	|	СУММА(ТаблицаДоходыИРасходы.Сумма - ТаблицаДоходыИРасходы.СуммаНДФЛ - ТаблицаДоходыИРасходы.СуммаНДСБезвозмездно - ТаблицаДоходыИРасходы.УдержаниеПенсии)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	ТаблицаДоходыИРасходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И ТаблицаДоходыИРасходы.Сумма - ТаблицаДоходыИРасходы.СуммаНДФЛ - ТаблицаДоходыИРасходы.СуммаНДСБезвозмездно - ТаблицаДоходыИРасходы.УдержаниеПенсии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ТаблицаДоходыИРасходы.СчетДоходовБП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ТаблицаДоходыИРасходы.СчетДоходовБП,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫРАЗИТЬ(&СписаниеСебестоимости КАК СТРОКА(100)),
	|	0,
	|	0,
	|	0
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	ТаблицаДоходыИРасходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И ТаблицаДоходыИРасходы.СуммаБезНДС <> 0
	|	И ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ТаблицаДоходыИРасходы.СчетДоходовБП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	9,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ТаблицаДоходыИРасходы.СчетЗатратБезвозмезднойПродажиСотрудник, //СчетДоходовБП,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫРАЗИТЬ(&СписаниеСуммыБезНалогов КАК СТРОКА(100)),
	|	0,
	|	СУММА(ТаблицаДоходыИРасходы.Сумма - ТаблицаДоходыИРасходы.СуммаНДФЛ - ТаблицаДоходыИРасходы.СуммаНДСБезвозмездно - ТаблицаДоходыИРасходы.УдержаниеПенсии),
	|	СУММА(ТаблицаДоходыИРасходы.Сумма - ТаблицаДоходыИРасходы.СуммаНДФЛ - ТаблицаДоходыИРасходы.СуммаНДСБезвозмездно - ТаблицаДоходыИРасходы.УдержаниеПенсии)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	ТаблицаДоходыИРасходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И ТаблицаДоходыИРасходы.Сумма - ТаблицаДоходыИРасходы.СуммаНДФЛ - ТаблицаДоходыИРасходы.СуммаНДСБезвозмездно - ТаблицаДоходыИРасходы.УдержаниеПенсии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ТаблицаДоходыИРасходы.СчетЗатратБезвозмезднойПродажиСотрудник //СчетДоходовБП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	10,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ТаблицаДоходыИРасходы.СчетЗатратНДСБезвозмезднойПродажиСотрудник, //СчетДоходовБП,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫРАЗИТЬ(&НДС КАК СТРОКА(100)),
	|	0,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаНДСБезвозмездно),
	|	СУММА(ТаблицаДоходыИРасходы.СуммаНДСБезвозмездно)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	ТаблицаДоходыИРасходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И ТаблицаДоходыИРасходы.СуммаНДСБезвозмездно <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ТаблицаДоходыИРасходы.СчетЗатратНДСБезвозмезднойПродажиСотрудник //СчетДоходовБП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	10.1,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ТаблицаДоходыИРасходы.СчетЗатратНДФЛСотрудник, //СчетДоходовБП,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫРАЗИТЬ(&НДФЛ КАК СТРОКА(100)),
	|	0,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаНДФЛ),
	|	СУММА(ТаблицаДоходыИРасходы.СуммаНДФЛ)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	ТаблицаДоходыИРасходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И ТаблицаДоходыИРасходы.СуммаНДФЛ <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ТаблицаДоходыИРасходы.СчетЗатратНДФЛСотрудник //СчетДоходовБП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	11,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ТаблицаДоходыИРасходы.СчетЗатратПФСотрудник, //СчетДоходовБП,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫРАЗИТЬ(&ПФ КАК СТРОКА(100)),
	|	0,
	|	СУММА(ТаблицаДоходыИРасходы.УдержаниеПенсии),
	|	СУММА(ТаблицаДоходыИРасходы.УдержаниеПенсии)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	ТаблицаДоходыИРасходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И ТаблицаДоходыИРасходы.УдержаниеПенсии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ТаблицаДоходыИРасходы.СчетЗатратПФСотрудник //СчетДоходовБП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	12,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ТаблицаДоходыИРасходы.ВидУдержанияПФ.СчетЗатратРегл, //СчетДоходовБП,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫРАЗИТЬ(&ПФ КАК СТРОКА(100)),
	|	0,
	|	СУММА(ТаблицаДоходыИРасходы.УдержаниеПенсии),
	|	СУММА(ТаблицаДоходыИРасходы.УдержаниеПенсии)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	ТаблицаДоходыИРасходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И НЕ ТаблицаДоходыИРасходы.ТоварыНаКомиссии
	|	И ТаблицаДоходыИРасходы.УдержаниеПенсии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.НомерСтроки,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДоходыИРасходы.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДоходыИРасходы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДоходыИРасходы.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи,
	|	ТаблицаДоходыИРасходы.ВидУдержанияПФ.СчетЗатратРегл //СчетДоходовБП
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеДоходы);
	Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеРасходы);
	Запрос.УстановитьПараметр("Выручка", НСтр("en='Sales proceeds';ka='შემოსავალი გაყიდვიდან';ru='Выручка от продажи'"));
	Запрос.УстановитьПараметр("Доставка", НСтр("en='Revenue from delivery';ka='Выручка от доставки';ru='Выручка от доставки'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("en='Exchange difference';ka='სხვაობა კურსებს შორის';ru='Курсовая разница'"));
	Запрос.УстановитьПараметр("БезвозмезднаяПродажа", НСтр("en='Free sale';ka='Безвозмезная продажа';ru='Безвозмезная продажа'"));
	Запрос.УстановитьПараметр("СписаниеСебестоимости", НСтр("en='Write-off of cost';ka='Списание себестоимости';ru='Списание себестоимости'"));
	Запрос.УстановитьПараметр("НДС", НСтр("en='VAT';ka='НДС';ru='НДС'"));
	Запрос.УстановитьПараметр("НДФЛ", НСтр("en='PIT';ka='НДФЛ';ru='НДФЛ'"));
	Запрос.УстановитьПараметр("ПФ", НСтр("en='PF';ka='ПФ';ru='ПФ'"));
	Запрос.УстановитьПараметр("СписаниеСуммыБезНалогов", НСтр("en='Write-off amounts without taxes';ka='Списание суммы без налогов';ru='Списание суммы без налогов'"));
	
	Запрос.УстановитьПараметр("Содержание_ПродажаСБаллами",НСтр("ka='Продажа с баллами';ru='Продажа с баллами';en='Продажа с баллами'"));
	
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность);
		
	Иначе
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);

	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПотребностьВЗапасах(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПотребностьВЗапасах.Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаПотребностьВЗапасах.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДвиженийЗапасов.Отгрузка) КАК ТипДвижения,
	|	ТаблицаПотребностьВЗапасах.Номенклатура КАК Номенклатура,
	|	ТаблицаПотребностьВЗапасах.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ФункциональнаяОпцияРезервированиеЗапасов.Значение
	|				И ТаблицаПотребностьВЗапасах.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|			ТОГДА ЕСТЬNULL(ТаблицаПотребностьВЗапасах.Заказ.ЗаказПокупателя, ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	СУММА(ТаблицаПотребностьВЗапасах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаПотребностьВЗапасах,
	|	Константа.ФункциональнаяОпцияРезервированиеЗапасов КАК ФункциональнаяОпцияРезервированиеЗапасов
	|ГДЕ
	|	ТаблицаПотребностьВЗапасах.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	И ТаблицаПотребностьВЗапасах.Заказ <> НЕОПРЕДЕЛЕНО
	|	И ТаблицаПотребностьВЗапасах.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПотребностьВЗапасах.Период,
	|	ТаблицаПотребностьВЗапасах.Организация,
	|	ТаблицаПотребностьВЗапасах.Номенклатура,
	|	ТаблицаПотребностьВЗапасах.Характеристика,
	|	ВЫБОР
	|		КОГДА ФункциональнаяОпцияРезервированиеЗапасов.Значение
	|				И ТаблицаПотребностьВЗапасах.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|			ТОГДА ЕСТЬNULL(ТаблицаПотребностьВЗапасах.Заказ.ЗаказПокупателя, ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПотребностьВЗапасах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПотребностьВЗапасах()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходнаяНакладная);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВозникновениеОбязательствПокупателя", НСтр("ka='მყიდველის ვალდებულებების წარმოშობა';ru='Возникновение обязательств покупателя';en='The emergence of the obligations of the buyer'"));
	Запрос.УстановитьПараметр("ВозникновениеОбязательствПокупателяПоДоставке", НСтр("ka='Возникновение обязательств покупателя по доставке';ru='Возникновение обязательств покупателя по доставке';en=""The emergence of the buyer's delivery obligation"""));
	Запрос.УстановитьПараметр("ЗачетАванса", НСтр("ka='წინასწარ გადახდილი თანხის ჩათვლა';ru='Зачет предоплаты';en='Зачет предоплаты'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("БезвозмезднаяПродажа", НСтр("ka='Безвозмездная продажа';ru='Безвозмездная продажа';en='Безвозмездная продажа'"));
	
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	
	// Формирование временной таблицы по расчетам с покупателями.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Период КАК Дата,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем КАК СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ КАК Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДокумента.Проект КАК Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare_
	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,
	|	СУММА(ТаблицаДокумента.Сумма) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаДляОстатка,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВалДляОстатка,
	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПокупателя КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателями
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И ТаблицаДокумента.Сумма <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДокумента.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл
	///++++ Дмгг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаДокумента.Период КАК Дата,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем КАК СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект,
	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,  
	//|	СУММА(ВременнаяТаблицаБалыЛояльности.Сумма) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ВременнаяТаблицаБалыЛояльности.КартаЛояльности.Владелец.ВидСкидкиВДисконтныхКартах = ЗНАЧЕНИЕ(Перечисление.ВидыСкидокВДисконтныхКартах.НакопительнаяСкидка)
	|				ТОГДА - ВременнаяТаблицаБалыЛояльности.КоличествоРасход
	|			ИНАЧЕ ВременнаяТаблицаБалыЛояльности.Сумма
	|		КОНЕЦ) КАК Сумма,
	//|	СУММА(ВременнаяТаблицаБалыЛояльности.Сумма) КАК СуммаВал,
	//|	СУММА(ВременнаяТаблицаБалыЛояльности.Сумма) КАК СуммаДляОстатка,
	//|	СУММА(ВременнаяТаблицаБалыЛояльности.Сумма) КАК СуммаВалДляОстатка,
	|	СУММА(ВЫБОР
	|			КОГДА ВременнаяТаблицаБалыЛояльности.КартаЛояльности.Владелец.ВидСкидкиВДисконтныхКартах = ЗНАЧЕНИЕ(Перечисление.ВидыСкидокВДисконтныхКартах.НакопительнаяСкидка)
	|				ТОГДА - ВременнаяТаблицаБалыЛояльности.КоличествоРасход
	|			ИНАЧЕ ВременнаяТаблицаБалыЛояльности.Сумма
	|		КОНЕЦ) КАК СуммаВал,
	|	СУММА(ВЫБОР
	|			КОГДА ВременнаяТаблицаБалыЛояльности.КартаЛояльности.Владелец.ВидСкидкиВДисконтныхКартах = ЗНАЧЕНИЕ(Перечисление.ВидыСкидокВДисконтныхКартах.НакопительнаяСкидка)
	|				ТОГДА - ВременнаяТаблицаБалыЛояльности.КоличествоРасход
	|			ИНАЧЕ ВременнаяТаблицаБалыЛояльности.Сумма
	|		КОНЕЦ) КАК СуммаДляОстатка,
	|	СУММА(ВЫБОР
	|			КОГДА ВременнаяТаблицаБалыЛояльности.КартаЛояльности.Владелец.ВидСкидкиВДисконтныхКартах = ЗНАЧЕНИЕ(Перечисление.ВидыСкидокВДисконтныхКартах.НакопительнаяСкидка)
	|				ТОГДА - ВременнаяТаблицаБалыЛояльности.КоличествоРасход
	|			ИНАЧЕ ВременнаяТаблицаБалыЛояльности.Сумма
	|		КОНЕЦ) КАК СуммаВалДляОстатка,
	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПокупателя КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаБалыЛояльности КАК ВременнаяТаблицаБалыЛояльности
	|		ПО (ТаблицаДокумента.НомерСтроки = ВременнаяТаблицаБалыЛояльности.НомерСтроки)
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И ТаблицаДокумента.Сумма <> 0
	|	И ВременнаяТаблицаБалыЛояльности.КоличествоРасход < 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл
	///--- ДМгг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаДокумента.Период КАК Дата,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем КАК СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ КАК Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДокумента.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,
	|	СУММА(ТаблицаДокумента.Сумма) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаДляОстатка,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВалДляОстатка,
	|	ВЫРАЗИТЬ(&БезвозмезднаяПродажа КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И ТаблицаДокумента.ЭтоПодарок
	|	И ТаблицаДокумента.Сумма <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДокумента.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) КАК Проект,
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетов,
	|	СУММА(ТаблицаДокумента.СуммаАванса), //+++ Дмгг СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	СУММА(ТаблицаДокумента.СуммаАванса), //+++ Дмгг СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ТаблицаДокумента.ТипРасчетов,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.ДокументКуда
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетовКуда,
	|	СУММА(ТаблицаДокумента.СуммаАванса), //+++ Дмгг СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	-СУММА(ТаблицаДокумента.СуммаАванса), //+++ Дмгг -СУММА(ТаблицаДокумента.Сумма),
	|	-СУММА(ТаблицаДокумента.СуммаВал),
	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.ДокументКуда
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетовКуда
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	Проект,
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ТипРасчетов,
	|	СчетУчета";
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПокупателями.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПокупателями.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПокупателями.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПокупателями.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПокупателями.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПокупателями";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПокупателями");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса);
	Запрос.Текст = Запрос.Текст + ";" + УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателямиРегл(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходнаяНакладная);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("СторнированиеДолга", НСтр("ka='დავალიანების სტორნირება';ru='Сторнирование долга';en='Reversal of debt'"));
	Запрос.УстановитьПараметр("ВосстановлениеПредоплаты", НСтр("ka='წინასწარი გადახდის აღდგენა';ru='Восстановление предоплаты';en='Recovering pre-payment'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&СторнированиеДолга КАК СодержаниеПроводки,
	|	ТаблицаДокумента.Период КАК Дата,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком КАК СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументОснование) = ТИП(Документ.ПриходнаяНакладная)
	|							И ТаблицаДокумента.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)
	|						ТОГДА ТаблицаДокумента.ДокументОснование
	|					ИНАЧЕ ТаблицаДокумента.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ КАК Заказ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДокумента.Проект КАК Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare_
	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	-СУММА(ТаблицаДокумента.СуммаНДС) КАК СуммаНДС,
	|	-СУММА(ТаблицаДокумента.СуммаНДФЛ) КАК СуммаНДФЛ,
	|	-СУММА(ТаблицаДокумента.СуммаПФ) КАК СуммаПФ,
	|	-СУММА(ТаблицаДокумента.Сумма) КАК Сумма,
	|	-СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
	|	-СУММА(ТаблицаДокумента.Сумма) КАК СуммаДляОстатка,
	|	-СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВалДляОстатка
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщиками
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|	ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Сотрудник,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументОснование) = ТИП(Документ.ПриходнаяНакладная)
	|							И ТаблицаДокумента.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)
	|						ТОГДА ТаблицаДокумента.ДокументОснование
	|					ИНАЧЕ ТаблицаДокумента.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ТаблицаДокумента.Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Проект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	NULL,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	&ВосстановлениеПредоплаты,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументОснование) = ТИП(Документ.ПриходнаяНакладная)
	|							И ТаблицаДокумента.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)
	|						ТОГДА ТаблицаДокумента.ДокументОснование
	|					ИНАЧЕ &Ссылка
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетовКуда,
	|	NULL,
	|	0,
	|	0,
	|	0,
	|	-СУММА(ТаблицаДокумента.Сумма),
	|	-СУММА(ТаблицаДокумента.СуммаВал),
	|	-СУММА(ТаблицаДокумента.Сумма),
	|	-СУММА(ТаблицаДокумента.СуммаВал)
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ДокументОснование) = ТИП(Документ.ПриходнаяНакладная)
	|							И ТаблицаДокумента.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)
	|						ТОГДА ТаблицаДокумента.ДокументОснование
	|					ИНАЧЕ &Ссылка
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ТаблицаДокумента.ТипРасчетовКуда,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	NULL,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&ВосстановлениеПредоплаты,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетов,
	|	NULL,
	|	0,
	|	0,
	|	0,
	|	-СУММА(ТаблицаДокумента.Сумма),
	|	-СУММА(ТаблицаДокумента.СуммаВал),
	|	СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал)
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = НЕОПРЕДЕЛЕНО
	|				ИЛИ НЕ ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетов,
	|	ТаблицаДокумента.СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.СчетУчетаАвансовПоставщику
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	Проект,
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	ТипРасчетов,
	|	СчетУчета,
	|	СчетУчетаРегл";
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПоставщиками.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблицаРасчетыСПоставщиками";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщиками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	Запрос.Текст = Запрос.Текст + ";" + УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиРегл(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходнаяНакладная);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА &Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.Сумма КАК СуммаДоходов,
	|	ТаблицаДокумента.Сумма КАК НеРаспределено
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И ТаблицаДокумента.Сумма <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Организация КАК Организация,
	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаКСписанию
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И НЕ ТаблицаДокумента.ЭтоЭквайринговаяОперация
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Статья КАК Статья
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И НЕ ТаблицаДокумента.ЭтоЭквайринговаяОперация
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапасыДоходыИРасходыОтложенные = МассивРезультатов[0].Выгрузить();
	ВыборкаРезультатаЗапроса = МассивРезультатов[1].Выбрать();
	
	ТаблицаПредоплатаДоходыИРасходыОтложенные = ТаблицаЗапасыДоходыИРасходыОтложенные.Скопировать();
	ТаблицаПредоплатаДоходыИРасходыОтложенные.Очистить();
	
	Если ВыборкаРезультатаЗапроса.Следующий() Тогда
		СуммаКСписанию = ВыборкаРезультатаЗапроса.СуммаКСписанию;
		Для каждого СтрокаЗапасыДоходыИРасходыОтложенные Из ТаблицаЗапасыДоходыИРасходыОтложенные Цикл
			Если СуммаКСписанию = 0 Тогда
				Продолжить
			ИначеЕсли СтрокаЗапасыДоходыИРасходыОтложенные.СуммаДоходов <= СуммаКСписанию Тогда
				СтрокаПредоплатаДоходыИРасходыОтложенные = ТаблицаПредоплатаДоходыИРасходыОтложенные.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПредоплатаДоходыИРасходыОтложенные, СтрокаЗапасыДоходыИРасходыОтложенные);
				СуммаКСписанию = СуммаКСписанию - СтрокаЗапасыДоходыИРасходыОтложенные.СуммаДоходов;
			ИначеЕсли СтрокаЗапасыДоходыИРасходыОтложенные.СуммаДоходов > СуммаКСписанию Тогда
				СтрокаПредоплатаДоходыИРасходыОтложенные = ТаблицаПредоплатаДоходыИРасходыОтложенные.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПредоплатаДоходыИРасходыОтложенные, СтрокаЗапасыДоходыИРасходыОтложенные);
				СтрокаПредоплатаДоходыИРасходыОтложенные.СуммаДоходов = СуммаКСписанию;
				СуммаКСписанию = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрокаПредоплатаДоходыИРасходыОтложенные Из ТаблицаПредоплатаДоходыИРасходыОтложенные Цикл
		СтрокаЗапасыДоходыИРасходыОтложенные = ТаблицаЗапасыДоходыИРасходыОтложенные.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗапасыДоходыИРасходыОтложенные, СтрокаПредоплатаДоходыИРасходыОтложенные);
		СтрокаЗапасыДоходыИРасходыОтложенные.ВидДвижения = ВидДвиженияНакопления.Расход;
		СтрокаЗапасыДоходыИРасходыОтложенные.НеРаспределено = -СтрокаПредоплатаДоходыИРасходыОтложенные.СуммаДоходов;
	КонецЦикла;
	
	ВыборкаРезультатаЗапроса = МассивРезультатов[2].Выбрать();
	
	Если ВыборкаРезультатаЗапроса.Следующий() Тогда
		Статья = ВыборкаРезультатаЗапроса.Статья;
	Иначе
		Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Период КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Документ КАК Документ,
	|	&Статья КАК Статья,
	|	Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Таблица.СуммаДоходов КАК СуммаДоходов
	|ПОМЕСТИТЬ ВременнаяТаблицаПредоплатаДоходыИРасходыОтложенные
	|ИЗ
	|	&Таблица КАК Таблица";
	Запрос.УстановитьПараметр("Таблица", ТаблицаПредоплатаДоходыИРасходыОтложенные);
	Запрос.УстановитьПараметр("Статья", Статья);
	
	Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыОтложенные", ТаблицаЗапасыДоходыИРасходыОтложенные);
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыОтложенные()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	ТаблицаДокумента.Сумма КАК СуммаДоходов
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И НЕ ТаблицаДокумента.ЭтоЭквайринговаяОперация";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыНераспределенные", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыНераспределенные()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходнаяНакладная);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.ДокументДата КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	-ТаблицаДокумента.Сумма КАК СуммаДоходов
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И НЕ ТаблицаДокумента.ЭтоЭквайринговаяОперация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.Период,
	|	Таблица.Организация,
	|	Таблица.НаправлениеДеятельности,
	|	Таблица.Статья,
	|	Таблица.СуммаДоходов
	|ИЗ
	|	ВременнаяТаблицаПредоплатаДоходыИРасходыОтложенные КАК Таблица";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыКассовыйМетод", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыКассовыйМетод()

Процедура СформироватьТаблицаРасчетыПоНДФЛ(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства) //+++ Дмгг

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Содержание", Нстр("ka='Начислен налог';ru='Начислен налог';en='accrued tax'"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ТаблицаЗапасы.Сотрудник,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
	|	&Содержание КАК СодержаниеПроводки,
	|	СУММА(ТаблицаЗапасы.СуммаНДФЛ) КАК Сумма,
	|	СУММА(ТаблицаЗапасы.СуммаНДФЛВал) КАК СуммаВал
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.СуммаНДФЛ <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидНачисленияУдержания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНачисленияУдержания,
	|	ТаблицаЗапасы.Сотрудник,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	&Содержание,
	|	СУММА(ТаблицаЗапасы.СуммаНДФЛ),
	|	СУММА(ТаблицаЗапасы.СуммаНДФЛВал)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.СуммаНДФЛ <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидНачисленияУдержания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНачисленияУдержания,
	|	ТаблицаЗапасы.Сотрудник,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате),
	|	&Содержание,
	|	СУММА(ТаблицаЗапасы.СуммаНДФЛ),
	|	СУММА(ТаблицаЗапасы.СуммаНДФЛВал)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.СуммаНДФЛ <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидНачисленияУдержания";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", РезультатЗапроса.Выгрузить());

КонецПроцедуры

Процедура СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства) //+++ Дмгг

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Содержание","");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ТаблицаЗапасы.Сотрудник КАК Сотрудник,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи КАК СтруктурнаяЕдиница,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
	|	&Содержание КАК СодержаниеПроводки,
	|	СУММА(ТаблицаЗапасы.Сумма) КАК Сумма, // - ТаблицаЗапасы.СуммаНДФЛ - ТаблицаЗапасы.УдержаниеПенсии - ТаблицаЗапасы.СуммаНДСБезвозмездно) КАК Сумма,
	|	СУММА(ТаблицаЗапасы.Сумма) КАК СуммаВал // - ТаблицаЗапасы.СуммаНДФЛ - ТаблицаЗапасы.УдержаниеПенсии - ТаблицаЗапасы.СуммаНДСБезвозмездно) КАК СуммаВал
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.Сумма - ТаблицаЗапасы.СуммаНДФЛ - ТаблицаЗапасы.УдержаниеПенсии - ТаблицаЗапасы.СуммаНДСБезвозмездно <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидНачисленияУдержания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНачисленияУдержания,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	&Содержание,
	|	СУММА(ТаблицаЗапасы.СуммаНДСБезвозмездно),
	|	СУММА(ТаблицаЗапасы.СуммаНДСБезвозмездно)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.СуммаНДСБезвозмездно <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидНачисленияУдержания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНачисленияУдержания,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	&Содержание,
	|	СУММА(ТаблицаЗапасы.СуммаНДФЛ),
	|	СУММА(ТаблицаЗапасы.СуммаНДФЛ)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.СуммаНДФЛ <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидНачисленияУдержания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНачисленияУдержания,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	&Содержание,
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии),
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.УдержаниеПенсии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидНачисленияУдержания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНачисленияУдержания,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	&Содержание,
	|	СУММА(ТаблицаЗапасы.Сумма), // - ТаблицаЗапасы.СуммаНДФЛ - ТаблицаЗапасы.УдержаниеПенсии - ТаблицаЗапасы.СуммаНДСБезвозмездно),
	|	СУММА(ТаблицаЗапасы.Сумма) // - ТаблицаЗапасы.СуммаНДФЛ - ТаблицаЗапасы.УдержаниеПенсии - ТаблицаЗапасы.СуммаНДСБезвозмездно)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.Сумма - ТаблицаЗапасы.СуммаНДФЛ - ТаблицаЗапасы.УдержаниеПенсии - ТаблицаЗапасы.СуммаНДСБезвозмездно <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидНачисленияУдержания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНачисленияУдержания,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	&Содержание,
	|	-СУММА(ТаблицаЗапасы.СуммаНДСБезвозмездно),
	|	-СУММА(ТаблицаЗапасы.СуммаНДСБезвозмездно)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.СуммаНДСБезвозмездно <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидНачисленияУдержания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНачисленияУдержания,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	&Содержание,
	|	-СУММА(ТаблицаЗапасы.СуммаНДФЛ),
	|	-СУММА(ТаблицаЗапасы.СуммаНДФЛ)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.СуммаНДФЛ <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидНачисленияУдержания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНачисленияУдержания,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	&Содержание,
	|	-СУММА(ТаблицаЗапасы.УдержаниеПенсии),
	|	-СУММА(ТаблицаЗапасы.УдержаниеПенсии)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.УдержаниеПенсии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидНачисленияУдержания
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПерсоналом", РезультатЗапроса.Выгрузить());	

КонецПроцедуры

Процедура СформироватьТаблицаНачисленияИУдержания(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства) //+++ Дмгг

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Содержание","");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.ВидНачисленияУдержанияШапка КАК ВидНачисленияУдержания,
	|	ТаблицаЗапасы.Сотрудник КАК Сотрудник,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи КАК СтруктурнаяЕдиница,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ) КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ) КАК ДатаОкончания,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
	|	&Содержание КАК СодержаниеПроводки,
	|	СУММА(ТаблицаЗапасы.Сумма) КАК Сумма, // - ТаблицаЗапасы.СуммаНДФЛ - ТаблицаЗапасы.УдержаниеПенсии - ТаблицаЗапасы.СуммаНДСБезвозмездно) КАК Сумма,
	|	СУММА(ТаблицаЗапасы.Сумма) КАК Размер, // - ТаблицаЗапасы.СуммаНДФЛ - ТаблицаЗапасы.УдержаниеПенсии - ТаблицаЗапасы.СуммаНДСБезвозмездно) КАК Размер,
	|	СУММА(ТаблицаЗапасы.Сумма) КАК СуммаВал // - ТаблицаЗапасы.СуммаНДФЛ - ТаблицаЗапасы.УдержаниеПенсии - ТаблицаЗапасы.СуммаНДСБезвозмездно) КАК СуммаВал
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.Сумма - ТаблицаЗапасы.СуммаНДФЛ - ТаблицаЗапасы.УдержаниеПенсии - ТаблицаЗапасы.СуммаНДСБезвозмездно <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидНачисленияУдержанияШапка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНачисленияУдержания,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	КОНЕЦПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	&Содержание,
	|	СУММА(ТаблицаЗапасы.СуммаНДФЛ),
	|	СУММА(ТаблицаЗапасы.СуммаНДФЛ),
	|	СУММА(ТаблицаЗапасы.СуммаНДФЛ)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.СуммаНДФЛ <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидНачисленияУдержания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидУдержанияПФ,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	КОНЕЦПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	&Содержание,
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии),
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии),
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.УдержаниеПенсии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидУдержанияПФ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНачисленияИУдержания", РезультатЗапроса.Выгрузить());	

КонецПроцедуры

Процедура СформироватьТаблицаРасчетыСПенсионнымФондом(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства) //+++ Дмгг

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Содержание","");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.ВидУдержанияПФ КАК ВидНачисленияУдержания,
	|	ТаблицаЗапасы.Сотрудник КАК СотрудникКонтрагент,
	|	ТаблицаЗапасы.Сотрудник КАК Плательщик,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи КАК СтруктурнаяЕдиница,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ) КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ) КАК ДатаОкончания,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
	|	&Содержание КАК СодержаниеПроводки,
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии) КАК Сумма,
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии) КАК Размер,
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии) КАК СуммаВал
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.УдержаниеПенсии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидУдержанияПФ,
	|	ТаблицаЗапасы.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидУдержанияПФ,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	КОНЕЦПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	&Содержание,
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии),
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии),
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.УдержаниеПенсии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидУдержанияПФ,
	|	ТаблицаЗапасы.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидУдержанияПФ,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	КОНЕЦПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	&Содержание,
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии),
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии),
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.УдержаниеПенсии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидУдержанияПФ,
	|	ТаблицаЗапасы.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидУдержанияПФ,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	КОНЕЦПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	&Содержание,
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии),
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии),
	|	СУММА(ТаблицаЗапасы.УдержаниеПенсии)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.УдержаниеПенсии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Сотрудник,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидУдержанияПФ,
	|	ТаблицаЗапасы.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидУдержанияПФ,
	|	NULL,
	|	NULL,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	КОНЕЦПЕРИОДА(ТаблицаЗапасы.Период, МЕСЯЦ),
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате),
	|	&Содержание,
	|	СУММА(2*ТаблицаЗапасы.УдержаниеПенсии),
	|	СУММА(2*ТаблицаЗапасы.УдержаниеПенсии),
	|	СУММА(2*ТаблицаЗапасы.УдержаниеПенсии)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.УдержаниеПенсии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВалютаБезвозмезднойПродажи,
	|	ТаблицаЗапасы.ВидУдержанияПФ,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаБезвозмезднойПродажи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПенсионнымФондом", РезультатЗапроса.Выгрузить());	

КонецПроцедуры

Процедура СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	
	//ДД Откоментировал филтры по виду операции 11/08/19
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.ВидНалогаНДС КАК ВидНалога,
	|	СУММА(ТаблицаЗапасы.СуммаНДС) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ВЫБОР 
	|		КОГДА &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС) 
	|			И ТаблицаЗапасы.СтавкаНДС.Ставка <> 0
	|			ТОГДА ИСТИНА
	|		КОГДА &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|			И ТаблицаЗапасы.СтавкаНДС.Ставка <> 0
	|			ТОГДА ИСТИНА
	|		КОГДА &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НаЭкспорт)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ 
	|			ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			И ТаблицаЗапасы.СуммаНДС <> 0
	|	КОНЕЦ 
	|	И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И ТаблицаЗапасы.СуммаНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНалогаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНалогаНДС,
	|	СУММА(ТаблицаЗапасы.СуммаНДС)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ВЫБОР 
	|		КОГДА &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС) 
	|			И ТаблицаЗапасы.СтавкаНДС.Ставка <> 0
	|			ТОГДА ИСТИНА
	|		КОГДА &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|			И ТаблицаЗапасы.СтавкаНДС.Ставка <> 0
	|			ТОГДА ИСТИНА
	|		КОГДА &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НаЭкспорт)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ 
	|			ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			И ТаблицаЗапасы.СуммаНДС <> 0
	|	КОНЕЦ
	|	И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|	И ТаблицаЗапасы.СуммаНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.ВидНалогаНДС,
	|	ТаблицаЗапасы.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНалогаНДС,
	|	СУММА(ТаблицаЗапасы.СуммаНДСБезвозмездно)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ВЫБОР 
	|		КОГДА &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС) 
	|			И ТаблицаЗапасы.СтавкаНДС.Ставка <> 0
	|			ТОГДА ИСТИНА
	|		КОГДА &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|			И ТаблицаЗапасы.СтавкаНДС.Ставка <> 0
	|			ТОГДА ИСТИНА
	|		КОГДА &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НаЭкспорт)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ 
	|			ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			И ТаблицаЗапасы.СуммаНДС <> 0
	|	КОНЕЦ
	|	И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.СуммаНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНалогаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНалогаНДФЛ,
	|	СУММА(ТаблицаЗапасы.СуммаНДФЛ)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|	И ТаблицаЗапасы.СуммаНДФЛ <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНалогаНДФЛ";
	
	Запрос.УстановитьПараметр("НалогообложениеНДС", ДокументСсылкаРасходнаяНакладная.НалогообложениеНДС);
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура СформироватьТаблицаАвансыОтправленныхФактур(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)//Паганини
	
	Если ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасходнаяНакладнаяФактурыАвансов.Ссылка.Организация,
			|	РасходнаяНакладнаяФактурыАвансов.Ссылка.Контрагент,
			|	РасходнаяНакладнаяФактурыАвансов.Ссылка.Ссылка,
			|	РасходнаяНакладнаяФактурыАвансов.Ссылка.Дата,
			|	РасходнаяНакладнаяФактурыАвансов.НомерСтроки,
			|	КОНЕЦПЕРИОДА(РасходнаяНакладнаяФактурыАвансов.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
			|	РасходнаяНакладнаяФактурыАвансов.Договор,
			|	РасходнаяНакладнаяФактурыАвансов.СчетФактура,
			|	РасходнаяНакладнаяФактурыАвансов.СуммаНДС 
			|ПОМЕСТИТЬ ФактурыАвансов
			|ИЗ
			|	Документ.РасходнаяНакладная.ФактурыАвансов КАК РасходнаяНакладнаяФактурыАвансов
			|ГДЕ
			|	РасходнаяНакладнаяФактурыАвансов.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", 		ДокументСсылкаРасходнаяНакладная);
		Запрос.Выполнить();
	КонецЕсли;
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаАвансыОтправленныхФактур_РасходнаяНакладная(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаУправленческий.Период КАК Период,
	|	ТаблицаУправленческий.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|				ТОГДА ТаблицаУправленческий.СуммаБезНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВалДт,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.ТоварыНаКомиссии
	|			ТОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком
	|		ИНАЧЕ ТаблицаУправленческий.СчетУчетаПродажи
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.ТоварыНаКомиссии
	|			ТОГДА &ВалютаУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.ТоварыНаКомиссии
	|				ТОГДА ТаблицаУправленческий.СуммаБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВалКт,
	|	СУММА(ТаблицаУправленческий.СуммаБезНДС) КАК Сумма,
	|	&ОтражениеВыручки КАК Содержание
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И ТаблицаУправленческий.СуммаБезНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.ТоварыНаКомиссии
	|			ТОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком
	|		ИНАЧЕ ТаблицаУправленческий.СчетУчетаПродажи
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.ТоварыНаКомиссии
	|			ТОГДА &ВалютаУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки),
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчета.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчета.Валютный
	|				ТОГДА -ТаблицаУправленческий.СуммаБезНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком.Валютный
	|				ТОГДА -ТаблицаУправленческий.СуммаБезНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(-ТаблицаУправленческий.СуммаБезНДС),
	|	&СторнированиеПоставки
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУправленческий.СчетУчета,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчета.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	1,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаАвансовПокупателяВалютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаАвансовПокупателяВалютный
	|			ТОГДА ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаРасчетовСПокупателемВалютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаРасчетовСПокупателемВалютный
	|			ТОГДА ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.Сумма,
	|	&ЗачетПредоплаты
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаДокумента.Период КАК Период,
	|		ТаблицаДокумента.Организация КАК Организация,
	|		ТаблицаДокумента.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
	|		ТаблицаДокумента.СчетУчетаАвансовПокупателяВалютный КАК СчетУчетаАвансовПокупателяВалютный,
	|		ТаблицаДокумента.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|		ТаблицаДокумента.СчетУчетаРасчетовСПокупателемВалютный КАК СчетУчетаРасчетовСПокупателемВалютный,
	|		ТаблицаДокумента.ВалютаРасчетов КАК ВалютаРасчетов,
	|		СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
	|		СУММА(ТаблицаДокумента.Сумма) КАК Сумма
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаДокумента.Период КАК Период,
	|			ТаблицаДокумента.Организация КАК Организация,
	|			ТаблицаДокумента.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
	|			ТаблицаДокумента.СчетУчетаАвансовПокупателя.Валютный КАК СчетУчетаАвансовПокупателяВалютный,
	|			ТаблицаДокумента.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|			ТаблицаДокумента.СчетУчетаРасчетовСПокупателем.Валютный КАК СчетУчетаРасчетовСПокупателемВалютный,
	|			ТаблицаДокумента.ВалютаРасчетов КАК ВалютаРасчетов,
	|			ТаблицаДокумента.СуммаВал КАК СуммаВал,
	|			ТаблицаДокумента.Сумма КАК Сумма
	|		ИЗ
	|			ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ТаблицаДокумента.Дата,
	|			ТаблицаДокумента.Организация,
	|			ТаблицаДокумента.Контрагент.СчетУчетаАвансовПокупателя,
	|			ТаблицаДокумента.Контрагент.СчетУчетаАвансовПокупателя.Валютный,
	|			ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПокупателем,
	|			ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПокупателем.Валютный,
	|			ТаблицаДокумента.Валюта,
	|			0,
	|			ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИЗ
	|			ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	|		ГДЕ
	|			ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Организация,
	|		ТаблицаДокумента.СчетУчетаАвансовПокупателя,
	|		ТаблицаДокумента.СчетУчетаАвансовПокупателяВалютный,
	|		ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|		ТаблицаДокумента.СчетУчетаРасчетовСПокупателемВалютный,
	|		ТаблицаДокумента.ВалютаРасчетов
	|	
	|	ИМЕЮЩИЕ
	|		(СУММА(ТаблицаДокумента.Сумма) >= 0.005
	|			ИЛИ СУММА(ТаблицаДокумента.Сумма) <= -0.005
	|			ИЛИ СУММА(ТаблицаДокумента.СуммаВал) >= 0.005
	|			ИЛИ СУММА(ТаблицаДокумента.СуммаВал) <= -0.005)) КАК ТаблицаДокумента
	|ГДЕ
	|	&ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА -ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетУчетаАвансовПоставщику,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаАвансовПоставщику.Валютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаАвансовПоставщику.Валютный
	|			ТОГДА -ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	-ТаблицаДокумента.Сумма,
	|	&СторнированиеПредоплаты
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ТаблицаУправленческий.НомерСтроки,
	|	ТаблицаУправленческий.Дата,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА &ОтрицательнаяКурсоваяРазницаСчетУчета
	|		ИНАЧЕ ТаблицаУправленческий.СчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы < 0
	|				И ТаблицаУправленческий.СчетУчета.Валютный
	|			ТОГДА ТаблицаУправленческий.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаУправленческий.СчетУчета
	|		ИНАЧЕ &ПоложительнаяКурсоваяРазницаСчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|				И ТаблицаУправленческий.СчетУчета.Валютный
	|			ТОГДА ТаблицаУправленческий.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаУправленческий.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаУправленческий.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	&КурсоваяРазница
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаУправленческий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	1,
	|	ТаблицаУправленческий.Дата,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаУправленческий.СчетУчета
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|				И ТаблицаУправленческий.СчетУчетаВалютный
	|			ТОГДА ТаблицаУправленческий.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчета
	|		ИНАЧЕ ТаблицаУправленческий.СчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы < 0
	|				И ТаблицаУправленческий.СчетУчетаВалютный
	|			ТОГДА ТаблицаУправленческий.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаУправленческий.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаУправленческий.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	&КурсоваяРазница
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Дата КАК Дата,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Организация КАК Организация,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.СчетУчета КАК СчетУчета,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.СчетУчетаВалютный КАК СчетУчетаВалютный,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Валюта КАК Валюта,
	|		СУММА(ТаблицаКурсовыхРазницРасчетыСПокупателями.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаДокумента.Дата КАК Дата,
	|			ТаблицаДокумента.Организация КАК Организация,
	|			ТаблицаДокумента.СчетУчета КАК СчетУчета,
	|			ТаблицаДокумента.СчетУчета.Валютный КАК СчетУчетаВалютный,
	|			ТаблицаДокумента.Валюта КАК Валюта,
	|			ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы
	|		ИЗ
	|			ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	|		ГДЕ
	|			ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ТаблицаДокумента.Дата,
	|			ТаблицаДокумента.Организация,
	|			ТаблицаДокумента.СчетУчета,
	|			ТаблицаДокумента.СчетУчета.Валютный,
	|			ТаблицаДокумента.Валюта,
	|			ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИЗ
	|			ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	|		ГДЕ
	|			ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазницРасчетыСПокупателями
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Дата,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Организация,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.СчетУчета,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.СчетУчетаВалютный,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Валюта
	|	
	|	ИМЕЮЩИЕ
	|		(СУММА(ТаблицаКурсовыхРазницРасчетыСПокупателями.СуммаКурсовойРазницы) >= 0.005
	|			ИЛИ СУММА(ТаблицаКурсовыхРазницРасчетыСПокупателями.СуммаКурсовойРазницы) <= -0.005)) КАК ТаблицаУправленческий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки),
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|				ТОГДА ТаблицаУправленческий.СуммаНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ТаблицаУправленческий.ВидНалогаНДС.СчетУчета,
	|	НЕОПРЕДЕЛЕНО,
	|	СУММА(0),
	|	СУММА(ТаблицаУправленческий.СуммаНДС),
	|	&НачислениеНДС
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И ТаблицаУправленческий.СуммаНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.ВидНалогаНДС.СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.Организация,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки),
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению.Валютный
	|				ТОГДА -ТаблицаУправленческий.СуммаНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком.Валютный
	|				ТОГДА -ТаблицаУправленческий.СуммаНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(-ТаблицаУправленческий.СуммаНДС),
	|	&СторнированиеПоставки
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ЗачетПредоплаты", НСтр("ka='წინასწარ გადახდილი თანხის ჩათვლა';ru='Зачет предоплаты';en='Зачет предоплаты'"));
	Запрос.УстановитьПараметр("СторнированиеПредоплаты", НСтр("ka='წინასწარ გადახდის სტორნირება';ru='Сторнирование предоплаты';en='Reversal of pre-payment'"));
	Запрос.УстановитьПараметр("НачислениеНДС", НСтр("ka='Начисление НДС';ru='Начисление НДС';en='VAT Charge'"));
	Запрос.УстановитьПараметр("СторнированиеПоставки", НСтр("ka='მიწოდების სტორნირება';ru='Сторнирование поставки';en='delivery Reversal'"));
	Запрос.УстановитьПараметр("ОтражениеВыручки", НСтр("ka='შემოსავალი გაყიდვიდან';ru='Выручка от продажи';en='Sales proceeds'"));
	Запрос.УстановитьПараметр("ОтражениеДоставки", НСтр("ka='Выручка от доставки';ru='Выручка от доставки';en='Revenue from delivery'"));
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеДоходы);
	Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеРасходы);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ВидОперации", ДокументСсылкаРасходнаяНакладная.ВидОперации);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		НоваяПроводка = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяПроводка, Выборка);
	КонецЦикла;
	
КонецПроцедуры // СформироватьТаблицаУправленческий()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗакупкиДляКУДиР(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходнаяНакладная);
	Запрос.УстановитьПараметр("ДатаДокумента", СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаПредоплата.Период КАК Период,
	|	ВременнаяТаблицаПредоплата.Период КАК ДатаДокумента,
	|	ВременнаяТаблицаПредоплата.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаПредоплата.ОрганизацияВНУ КАК Организация,
	|	&Ссылка КАК ТоварныйДокумент,
	|	ВременнаяТаблицаПредоплата.Документ КАК ДенежныйДокумент,
	|	ВременнаяТаблицаПредоплата.Документ.УчитыватьВНУ КАК УчитыватьВНУ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаПредоплата.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС)
	|			ТОГДА 18
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДС,
	|	ЛОЖЬ КАК ЭтоТоварыКРеализации,
	|	- СУММА(ВременнаяТаблицаПредоплата.СуммаВал) КАК СуммаВал,
	|	ВременнаяТаблицаПредоплата.ВалютаРасчетов КАК Валюта
	|ПОМЕСТИТЬ ВременнаяТаблицаЗакупкиПоставщиковДляКУДиР
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ВременнаяТаблицаПредоплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПримененияЕНВД.СрезПоследних(&ДатаДокумента, ) КАК ПримененияЕНВД
	|		ПО ВременнаяТаблицаПредоплата.ОрганизацияВНУ = ПримененияЕНВД.Организация
	|			И (ПримененияЕНВД.СтруктурнаяЕдиница = ВременнаяТаблицаПредоплата.СтруктурнаяЕдиница)
	|ГДЕ
	|	ВременнаяТаблицаПредоплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|	И ВременнаяТаблицаПредоплата.ВестиРасчетыПоДокументам
	|	И ВременнаяТаблицаПредоплата.ОрганизацияВНУ.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПредоплата.НомерСтроки,
	|	ВременнаяТаблицаПредоплата.Период,
	|	ВременнаяТаблицаПредоплата.ОрганизацияВНУ,
	|	ВременнаяТаблицаПредоплата.Документ.УчитыватьВНУ,
	|	ВременнаяТаблицаПредоплата.НалогообложениеНДС,
	|	ВременнаяТаблицаПредоплата.ВалютаРасчетов,
	|	ВременнаяТаблицаПредоплата.Документ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ТоварныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗакупкиПоставщиковДляКУДиР.ТоварныйДокумент
	|ПОМЕСТИТЬ ВТТоварныеДокументы
	|ИЗ
	|	ВременнаяТаблицаЗакупкиПоставщиковДляКУДиР КАК ВТЗакупкиПоставщиковДляКУДиР
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗакупкиПоставщиковДляКУДиР.ТоварныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТоварныеДокументы.ТоварныйДокумент,
	|	ЗакупкиДляКУДиР.Номенклатура,
	|	ЗакупкиДляКУДиР.ЭтоТоварыКРеализации,
	|	СУММА(ЗакупкиДляКУДиР.СуммаВал) КАК Сумма,
	|	СУММА(ЗакупкиДляКУДиР.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТУчтенныеТовары
	|ИЗ
	|	РегистрНакопления.ЗакупкиДляКУДиР КАК ЗакупкиДляКУДиР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварныеДокументы КАК ВТТоварныеДокументы
	|		ПО (ВТТоварныеДокументы.ТоварныйДокумент = ЗакупкиДляКУДиР.ТоварныйДокумент)
	|			И (ЗакупкиДляКУДиР.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТТоварныеДокументы.ТоварныйДокумент,
	|	ЗакупкиДляКУДиР.Номенклатура,
	|	ЗакупкиДляКУДиР.ЭтоТоварыКРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗакупкиПоставщиковДляКУДиР.Период,
	|	ВТЗакупкиПоставщиковДляКУДиР.ДатаДокумента,
	|	ВТЗакупкиПоставщиковДляКУДиР.НомерСтроки,
	|	ВТЗакупкиПоставщиковДляКУДиР.Организация,
	|	ВТЗакупкиПоставщиковДляКУДиР.ДенежныйДокумент,
	|	ВТЗакупкиПоставщиковДляКУДиР.ТоварныйДокумент,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	ВТЗакупкиПоставщиковДляКУДиР.УчитыватьВНУ,
	|	ВТЗакупкиПоставщиковДляКУДиР.ЭтоТоварыКРеализации,
	|	ВТЗакупкиПоставщиковДляКУДиР.СуммаВал,
	|	ВТЗакупкиПоставщиковДляКУДиР.СуммаВал КАК Сумма,
	|	ВТЗакупкиПоставщиковДляКУДиР.СтавкаНДС,
	|	0 КАК Количество,
	|	0 КАК СуммаНДС
	|ИЗ
	|	ВременнаяТаблицаЗакупкиПоставщиковДляКУДиР КАК ВТЗакупкиПоставщиковДляКУДиР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Ссылка КАК ТоварныйДокумент,
	|	РасходнаяНакладнаяЗапасы.Номенклатура,
	|	- РасходнаяНакладнаяЗапасы.Всего  КАК Сумма,
	|	ЕСТЬNULL(РасходнаяНакладнаяЗапасы.СтавкаНДС.Ставка, 0) КАК СтавкаНДС,
	|	НЕ РасходнаяНакладнаяЗапасы.ТоварыДляПроизводства КАК ЭтоТоварыКРеализации,
	|	- ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА РасходнаяНакладнаяЗапасы.Количество
	|		ИНАЧЕ ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Количество * РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения.Коэффициент - &СмещениеДляОкругления КАК ЧИСЛО(15,3))
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	ТоварныйДокумент";
	
	// Олег Литвиненко 15.09.22 --->
	Запрос.УстановитьПараметр("СмещениеДляОкругления", 0.0005);
	// Олег Литвиненко <---
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаОплаты = РезультатЗапроса[3].Выгрузить();
	ТаблицаРезультат = ТаблицаОплаты.Скопировать(Новый Массив());
	ВыборкаДокументовСТоварами = РезультатЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	УчетВалюты = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	НацВалюта = Константы.НациональнаяВалюта.Получить();
	ВалютаДокумента = ДокументСсылкаРасходнаяНакладная.ВалютаДокумента;
	
	Если УчетВалюты И ВалютаДокумента <> НацВалюта Тогда
		ТекущийКурс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ДокументСсылкаРасходнаяНакладная.Дата);
	КонецЕсли;
	
	Пока ВыборкаДокументовСТоварами.Следующий() Цикл
		СвободныеОплаты = ТаблицаОплаты.НайтиСтроки(Новый Структура("ТоварныйДокумент", ВыборкаДокументовСТоварами.ТоварныйДокумент));
		ВыборкаЗаписей = ВыборкаДокументовСТоварами.Выбрать();
		Для Каждого ДокументОплаты Из СвободныеОплаты Цикл
			Пока ДокументОплаты.Сумма <> 0 И ВыборкаЗаписей.Следующий() Цикл
				НовСтр = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаЗаписей);
				ЗаполнитьЗначенияСвойств(НовСтр, ДокументОплаты,,"ЭтоТоварыКРеализации");
				Если ДокументОплаты.Сумма <= ВыборкаЗаписей.Сумма Тогда
					НовСтр.Сумма = ВыборкаЗаписей.Сумма;
				Иначе
					НовСтр.Сумма = ДокументОплаты.Сумма;
				КонецЕсли;
				ДокументОплаты.Сумма = ДокументОплаты.Сумма - НовСтр.Сумма;
				НовСтр.СуммаВал = НовСтр.Сумма;
				
				Если УчетВалюты И ВалютаДокумента <> НацВалюта Тогда
					НовСтр.Сумма = НовСтр.Сумма * ТекущийКурс.Курс / ТекущийКурс.Кратность;
				КонецЕсли;
				НовСтр.СуммаНДС = НовСтр.Сумма - НовСтр.Сумма /((100+ ВыборкаЗаписей.СтавкаНДС)/100);
				НовСтр.Номенклатура = ВыборкаЗаписей.Номенклатура;
				НовСтр.Количество =  ВыборкаЗаписей.Количество;
				НовСтр.Сумма = НовСтр.Сумма - НовСтр.СуммаНДС;
			КонецЦикла;
			Если ДокументОплаты.Сумма <> 0 Тогда
				НовСтр = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ДокументОплаты);
				НовСтр.СуммаВал = НовСтр.Сумма;
				Если УчетВалюты И ВалютаДокумента <> НацВалюта Тогда
					НовСтр.Сумма = НовСтр.Сумма * ТекущийКурс.Курс / ТекущийКурс.Кратность;
				КонецЕсли;
				НовСтр.СуммаНДС = НовСтр.Сумма - НовСтр.Сумма /((100+ ДокументОплаты.СтавкаНДС)/100);
				НовСтр.Сумма = НовСтр.Сумма - НовСтр.СуммаНДС;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗакупкиДляКУДиР", ТаблицаРезультат);
	
КонецПроцедуры // СформироватьТаблицаЗакупкиДляКУДиР()

// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
Процедура СформироватьТаблицаРезервированиеЗапасов(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Заказ КАК Документ,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаЗапасы.Проект ЕСТЬ NULL
	|							ИЛИ ТаблицаЗапасы.Проект = НЕОПРЕДЕЛЕНО
	|							ИЛИ ТаблицаЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						ТОГДА ТаблицаЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|					ИНАЧЕ ТаблицаЗапасы.Проект
	|				КОНЕЦ
	|	КОНЕЦ КАК Проект,
	|	СУММА(ТаблицаЗапасы.Резерв) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы,
	|	Константы КАК Константы
	|ГДЕ
	|	Константы.ФункциональнаяОпцияРезервированиеЗапасов_new
	|	И ТаблицаЗапасы.Резерв > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Заказ,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаЗапасы.Проект ЕСТЬ NULL
	|							ИЛИ ТаблицаЗапасы.Проект = НЕОПРЕДЕЛЕНО
	|							ИЛИ ТаблицаЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						ТОГДА ТаблицаЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|					ИНАЧЕ ТаблицаЗапасы.Проект
	|				КОНЕЦ
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("УчетПоПроектам",  СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРезервированиеЗапасов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
#КонецОбласти

#Область ДисконтныеКарты

// Формирует таблицу значений, содержащую данные для проведения по регистру ПродажиПоДисконтнымКартам.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПродажиПоДисконтнойКарте(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Если ДокументСсылкаРасходнаяНакладная.ДисконтнаяКарта.Пустая() Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажиПоДисконтнойКарте", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПродажи.Период КАК Период,
	|	ТаблицаПродажи.Документ.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ТаблицаПродажи.Документ.ДисконтнаяКарта.ВладелецКарты КАК ВладелецКарты,
	|	СУММА(ТаблицаПродажи.Сумма) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаПродажи
	|ГДЕ
	|	ТаблицаПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.Документ.ДисконтнаяКарта,
	|	ТаблицаПродажи.Документ.ДисконтнаяКарта.ВладелецКарты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажиПоДисконтнойКарте", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПродажиПоДисконтнойКарте()

#КонецОбласти

#Область АвтоматическиеСкидки

// Формирует таблицу значений, содержащую данные для проведения по регистру ПредоставленныеАвтоматическиеСкидки.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПродажиПоПредоставленнымАвтоматическимСкидкам(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Если ДокументСсылкаРасходнаяНакладная.СкидкиНаценки.Количество() = 0 Или НЕ ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки") Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПредоставленныеАвтоматическиеСкидки", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаАвтоСкидкиНаценки.Период КАК Период,
	|	ВременнаяТаблицаАвтоСкидкиНаценки.СкидкаНаценка КАК АвтоматическаяСкидка,
	|	ВременнаяТаблицаАвтоСкидкиНаценки.Сумма КАК СуммаСкидки,
	|	ВременнаяТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ВременнаяТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ВременнаяТаблицаЗапасы.Документ КАК ДокументСкидки,
	|	ВременнаяТаблицаЗапасы.Контрагент КАК ПолучательСкидки,
	|	ВременнаяТаблицаЗапасы.СуммаБезСкидки КАК СуммаБезСкидки //++Lazare_30.08.2021
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаАвтоСкидкиНаценки КАК ВременнаяТаблицаАвтоСкидкиНаценки
	|		ПО ВременнаяТаблицаЗапасы.КлючСвязи = ВременнаяТаблицаАвтоСкидкиНаценки.КлючСвязи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПредоставленныеАвтоматическиеСкидки", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПродажиПоПредоставленнымАвтоматическимСкидкам()

#КонецОбласти

#Область Биллинг

// Формирует таблицу значений, содержащую данные для проведения по регистру ВыполнениеДоговоровОбслуживания.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВыполнениеДоговораОбслуживания(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьБиллинг") Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыполнениеДоговораОбслуживания", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаЗапасы.Период,
	|	ВременнаяТаблицаЗапасы.Договор,
	|	ВременнаяТаблицаЗапасы.Номенклатура КАК ОбъектДоговораОбслуживания,
	|	ВременнаяТаблицаЗапасы.Характеристика,
	|	ИСТИНА КАК УказанаСтоимость,
	|	ВременнаяТаблицаЗапасы.Количество,
	|	ВременнаяТаблицаЗапасы.СуммаВал КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	ВременнаяТаблицаШапка.ЭтоДоговорОбслуживания";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыполнениеДоговораОбслуживания", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанныхИзВнешнегоИсточника

Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока30 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Штрихкод", НСтр("en='Barcode';ka='შტრიხ კოდი';ru='Штрихкод'"), ОписаниеТиповСтрока200, ОписаниеТиповКолонка, "Номенклатура", 1, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Артикул", НСтр("en='OptionCode';ka='არტიკული';ru='Артикул'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование", НСтр("ka='ნომენკლატურა (დასახელება)';ru='Номенклатура (наименование)';en='Nomenclature (name)'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Номенклатура", 3, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименованиеПолное",НСтр("ka='ნომენკლატურა (სრული დასახელება)';ru='Номенклатура (полное наименование';en='Nomenclature (full name'"), ОписаниеТиповСтрока1000, ОписаниеТиповКолонка, "Номенклатура", 5, , Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Содержание",  НСтр("en='Content';ka='შინაარსი';ru='Содержание'"), ОписаниеТиповСтрока1000, ОписаниеТиповСтрока1000, , , , , НастройкиЗагрузкиДанных.СодержаниеВидимо);
	
	
	//НСтр("ru='';ka=''");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Характеристика",  НСтр("ka='თვისება (დასახელება)';ru='Характеристика (наименование)';en='Characteristics (name)'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка);
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Партия", НСтр("ka='პარტია (დასახელება)';ru='Партия (наименование)';en='Party (name)'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
		
	КонецЕсли;
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Количество",  НСтр("en='Quantity';ka='რაოდენობა';ru='Количество'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Резерв", НСтр("ka='რეზერვი';ru='Резерв';en='Резерв'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , , , ПолучитьФункциональнуюОпцию("РезервированиеЗапасов"));
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения, СправочникСсылка.ЕдиницыИзмерения");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ЕдиницаИзмерения", НСтр("en='Unit Measurement';ka='საზომი ერთეული';ru='Ед. изм.'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка, , , , , ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения"));
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Цена", НСтр("en='Price';ka='ფასი';ru='Цена'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Ложь);
	//Lazare_
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Сумма", НСтр("en='Price';ka='თანხა';ru='Сумма'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Ложь);
	//_Lazare	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СтавкаНДС", НСтр("ka='დღგ';ru='Ставка НДС';en='VAT Rate'"), ОписаниеТиповСтрока50, ОписаниеТиповКолонка);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СуммаНДС",  НСтр("en='VAT Amount';ka='დღგ-ს თანხა';ru='Сумма НДС'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	
	ВидимостьЗаказаПокупателя = (НастройкиЗагрузкиДанных.ПоложениеЗаказаВДокументе = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти);
	ОписаниеТиповКолонка = Новый ОписаниеТипов(МассивТипов);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Заказ", НСтр("ka='შეკვეთა (მყიდველი/მომწოდებელი)';ru='Заказ (покупатель/поставщик)';en='Check (customer / supplier)'"), ОписаниеТиповСтрока50, ОписаниеТиповКолонка, , , , , ВидимостьЗаказаПокупателя);
	
	Если ПолучитьФункциональнуюОпцию("УчетГТД") Тогда
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.СтраныМира");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СтранаПроисхождения", НСтр("en='Country of Origin';ka='მწარმოებელი ქვეყანა';ru='Страна происхождения'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.НомераГТД");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НомерГТД", НСтр("ka='საბაჭო დეკლარაციის ნომერი';ru='Номер ГТД';en='Номер ГТД'"), ОписаниеТиповСтрока30, ОписаниеТиповКолонка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_mxl", "ОбразецЗагрузкиДанных_mxl");
	
	Образец_csv = ПолучитьМакет("ОбразецЗагрузкиДанных_csv");
	ОбразецЗагрузкиДанных_csv = ПоместитьВоВременноеХранилище(Образец_csv, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_csv", ОбразецЗагрузкиДанных_csv);
	
КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ТаблицаСопоставленияДанных, НастройкиЗагрузкиДанных) Экспорт
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Артикул, СтрокаТаблицыФормы.НоменклатураНаименование, СтрокаТаблицыФормы.НоменклатураНаименованиеПолное);
		
		// Содержание
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Содержание, СтрокаТаблицыФормы.Содержание_ВходящиеДанные);
		
		// Характеристика по Владельцу и Наименованию
		Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
			
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
				
				ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьХарактеристику(СтрокаТаблицыФормы.Характеристика, СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Характеристика_ВходящиеДанные);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Партия по Владельцу и Наименованию
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
			
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
				
				ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьПартию(СтрокаТаблицыФормы.Партия, СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Партия_ВходящиеДанные);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Количество
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Количество, СтрокаТаблицыФормы.Количество_ВходящиеДанные, 1);
		
		// Резерв
		Если ПолучитьФункциональнуюОпцию("РезервированиеЗапасов") Тогда
			
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Резерв, СтрокаТаблицыФормы.Резерв_ВходящиеДанные, 0);
			
		КонецЕсли;
		
		// ЕдиницыИзмерения по Наименованию (так же рассмотреть возможность прикрутить пользовательские ЕИ)
		ЗначениеПоУмолчанию = ?(ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура), СтрокаТаблицыФормы.Номенклатура.ЕдиницаИзмерения, Справочники.КлассификаторЕдиницИзмерения.шт);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЕдиницыИзмерения(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.ЕдиницаИзмерения, СтрокаТаблицыФормы.ЕдиницаИзмерения_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// Цена
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Цена, СтрокаТаблицыФормы.Цена_ВходящиеДанные, 0);
		//Lazare_
		// Сумма
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Сумма, СтрокаТаблицыФормы.Сумма_ВходящиеДанные, 0);
		//_Lazare		
		
		// СтавкаНДС по наименованию
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСтавкуНДС(СтрокаТаблицыФормы.СтавкаНДС, СтрокаТаблицыФормы.СтавкаНДС_ВходящиеДанные, Неопределено);
		
		// СуммаНДС
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.СуммаНДС, СтрокаТаблицыФормы.СуммаНДС_ВходящиеДанные, 0);
		
		// Заказ
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЗаказ(СтрокаТаблицыФормы.Заказ, СтрокаТаблицыФормы.Заказ_ВходящиеДанные);
		
		// Страна и ГТД
		Если ПолучитьФункциональнуюОпцию("УчетГТД") Тогда
			
			ЗначениеПоУмолчанию = Неопределено;
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
				
				ЗначениеПоУмолчанию = СтрокаТаблицыФормы.Номенклатура.СтранаПроисхождения;
				
			КонецЕсли;
			
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСтрануПроисхождения(СтрокаТаблицыФормы.СтранаПроисхождения, СтрокаТаблицыФормы.СтранаПроисхождения_ВходящиеДанные, ЗначениеПоУмолчанию);
			
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.СтранаПроисхождения)
				И СтрокаТаблицыФормы.СтранаПроисхождения <> Справочники.СтраныМира.Россия Тогда
				
				ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНомерГТД(СтрокаТаблицыФормы.НомерГТД, СтрокаТаблицыФормы.НомерГТД_ВходящиеДанные);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура)
		И (СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас 
			ИЛИ СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга)
		И СтрокаТаблицыФормы.Количество <> 0;
	
КонецПроцедуры

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область РаботаССерийнымиНомерами

// Формирует таблицу значений, содержащую данные для проведения по регистру СерийныеНомераГарантии.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСерийныеНомера(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Если ДокументСсылкаРасходнаяНакладная.СерийныеНомера.Количество()=0 Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", Новый ТаблицаЗначений);
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Движение)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Расход)
	|	КОНЕЦ КАК Операция,
	|	ВременнаяТаблицаЗапасы.Период КАК Период,
	|	ВременнаяТаблицаЗапасы.Период КАК ДатаСобытия,
	|	СерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	ВременнаяТаблицаЗапасы.Организация КАК Организация,
	|	ВременнаяТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ВременнаяТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ВременнаяТаблицаЗапасы.Партия КАК Партия,
	|	ВременнаяТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗапасы.Ячейка КАК Ячейка,
	|	ВременнаяТаблицаЗапасы.ОрдерныйСклад КАК ОрдерныйСклад,
	|	1 КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСерийныеНомера КАК СерийныеНомера
	|		ПО ВременнаяТаблицаЗапасы.КлючСвязи = СерийныеНомера.КлючСвязи";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", РезультатЗапроса);
	Если СтруктураДополнительныеСвойства.УчетнаяПолитика.ОстаткиСерийныхНомеров Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", РезультатЗапроса);
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", Новый ТаблицаЗначений);
	КонецЕсли; 
	
КонецПроцедуры // СформироватьТаблицаСерийныеНомера()

#КонецОбласти

#Область ИнициализацияДаных

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства) Экспорт
	
		
	Запрос = Новый Запрос(ТекстЗапросаИнициализироватьДанныеДокумента());
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	// Олег Литвиненко 15.09.22 --->
	Запрос.УстановитьПараметр("СмещениеДляОкругления", 0.0005);
	// Олег Литвиненко <---
	// Олег Литвиненко 09.01.23 --->
	Запрос.УстановитьПараметр("НаДату", СтруктураДополнительныеСвойства.ДляПроведения.Дата);	
	// Олег Литвиненко <---
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходнаяНакладная);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	Запрос.УстановитьПараметр("УчетПоЯчейкам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоЯчейкам);
	
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	
	Запрос.УстановитьПараметр("ИспользоватьСерийныеНомера", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьСерийныеНомера);
	
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаНациональная", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("ВалютаНакладной", ДокументСсылкаРасходнаяНакладная.ВалютаДокумента);
	Запрос.УстановитьПараметр("Контрагент", ДокументСсылкаРасходнаяНакладная.Контрагент);
	
	Запрос.ВыполнитьПакет();
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПодготовитьСтруктурыСубконтоСчетовДоходаПродажи(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства); //+++ Дмгг
	
	// Формирование проводок документа.
	УправлениеНебольшойФирмойСервер.СформироватьТаблицуПроводок(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗакупки(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПродажи(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	//--------------------------------------------------------------------------
	// © Шишка В.В. [21 января 2022]  НАЧАЛО
	Если СтруктураДополнительныеСвойства.Свойство("ЭтоПолучениеТаблицыПродаж") Тогда
	
		Возврат;	
	
	КонецЕсли; 	
	// © Шишка В.В. [21 января 2022]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	СформироватьТаблицаВыпускПродукции(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыВРазрезеГТД(СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыКРасходуСоСкладов(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыПринятые(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыПереданные(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗаказыПокупателей(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗаказыПоставщикам(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПотребностьВЗапасах(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);//+++ Дмгг
	СформироватьТаблицаНачисленияИУдержания(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства); //+++ Дмгг
	СформироватьТаблицаРасчетыСПенсионнымФондом(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства); //+++ Дмгг
	
	// ДисконтныеКарты
	СформироватьТаблицаПродажиПоДисконтнойКарте(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	// ДисконтныеКарты
	
	// Серийные номера
	СформироватьТаблицаСерийныеНомера(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	// Серийные номера
	
	СформироватьТаблицаПродажиПоПредоставленнымАвтоматическимСкидкам(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗапасы(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	// Олег Литвиненко 29.12.22 --->
	СформироватьТаблицаЗапасыВВалюте(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	// Олег Литвиненко <---
	// Олег Литвиненко 06.01.23 --->
	СформироватьТаблицаПродажиВВалюте(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	// Олег Литвиненко <---
	
	СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНДФЛ(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	// Эквайринг
	ЭквайринговыеОперацииСервер.СформироватьТаблицаДоходыИРасходыКассовыйМетодЭквайринг(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаУправленческий(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаАвансыОтправленныхФактур(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);//Паганини
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаДекларация_РасходнаяНакладная(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_РасходнаяНакладная(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	
	// Биллинг
	СформироватьТаблицаВыполнениеДоговораОбслуживания(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗакупкиДляКУДиР(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаУсушкa_СобранныеPаказы(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	
	// Рублевые суммы документов
	Если ДокументСсылкаРасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю
		И ДокументСсылкаРасходнаяНакладная.Договор.ВалютаРасчетов <> Константы.НациональнаяВалюта.Получить() Тогда
		
		ТаблицаВзаиморасчеты = РублевыеСуммыДокументов.ПодготовитьТаблицуДокументаРасчетыВВалюте(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
		Если СтруктураДополнительныеСвойства.ДляПроведения.ВалютаДокумента <> СтруктураДополнительныеСвойства.ДляПроведения.НациональнаяВалюта Тогда
			РублевыеСуммыДокументов.РаспределитьАвансыПоТаблицеРеализации(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства, ТаблицаВзаиморасчеты);
		КонецЕсли;
		РублевыеСуммыДокументов.СформироватьТаблицаРублевыеСуммыДокументовВВалюте(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
		РублевыеСуммыДокументов.ДобавитьДвиженияВТаблицуРасчетов(
			ТаблицаВзаиморасчеты,
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПокупателями,
			ДокументСсылкаРасходнаяНакладная,
			СтруктураДополнительныеСвойства,
			Ложь);
			
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРублевыеСуммыДокументовВВалюте", Новый ТаблицаЗначений);
	КонецЕсли;
	
	//Малышев 2024-10-11 ONESOFT-3509
	//СформироватьТаблицаБалыЛояльности(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства); //+++ Дмгг
	СформироватьТаблицаБалыЛояльности(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);

	СформироватьТаблицаРезервированиеЗапасов(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства); // Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()


Функция ТекстЗапросаИнициализироватьДанныеДокумента()
	
	ТекстЗапроса = 
	//+++ Дмгг
	//"ВЫБРАТЬ
	//|	ЕСТЬNULL(ВидыКартЛояльностиПорогиНакопительныхСкидок.СкидкаЛояльность, 0) КАК СкидкаЛояльность,
	//|	ЕСТЬNULL(ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка.КоэфициентПересчета, 1) КАК КоэфициентПересчета
	//|ПОМЕСТИТЬ ВТ_ПарогиЛояльности
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		РасходнаяНакладная.СуммаДокумента КАК СуммаДокумента,
	//|		МАКСИМУМ(ВидыКартЛояльностиПорогиНакопительныхСкидок.НижняяГраницаЛояльность) КАК НижняяГраницаЛояльность,
	//|		ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка КАК Ссылка
	//|	ИЗ
	//|		Документ.РасходнаяНакладная КАК РасходнаяНакладная
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыКартЛояльности.ПорогиНакопительныхСкидок КАК ВидыКартЛояльностиПорогиНакопительныхСкидок
	//|			ПО РасходнаяНакладная.СуммаДокумента >= ВидыКартЛояльностиПорогиНакопительныхСкидок.НижняяГраницаЛояльность
	//|				И РасходнаяНакладная.КартаЛояльности.Владелец = ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка
	//|	ГДЕ
	//|		РасходнаяНакладная.Ссылка = &Ссылка
	//|		И РасходнаяНакладная.Ссылка.КартаЛояльности <> ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка)  
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		РасходнаяНакладная.СуммаДокумента,
	//|		ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка) КАК ВложенныйЗапрос
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыКартЛояльности.ПорогиНакопительныхСкидок КАК ВидыКартЛояльностиПорогиНакопительныхСкидок
	//|		ПО ВложенныйЗапрос.Ссылка = ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка
	//|			И ВложенныйЗапрос.НижняяГраницаЛояльность = ВидыКартЛояльностиПорогиНакопительныхСкидок.НижняяГраницаЛояльность
	//|;
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Контрагент КАК Контрагент,
	|	РасходнаяНакладная.СуммаДокумента + ЕСТЬNULL(ВложенныйЗапрос.СуммаОборот, 0) КАК СуммаСОборотом,
	|	ЕСТЬNULL(ВложенныйЗапрос.СуммаОборот, 0) КАК СуммаОборот,
	|	РасходнаяНакладная.СуммаДокумента КАК СуммаДокумента,
	|	РасходнаяНакладная.КартаЛояльности КАК КартаЛояльности
	|ПОМЕСТИТЬ ВТ_ОборотыКонтрагента
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот,
	|			ПродажиОбороты.Контрагент КАК Контрагент
	|			ИЗ
	|					РегистрНакопления.Продажи.Обороты(, &НаДату, Регистратор, Контрагент = &Контрагент) КАК ПродажиОбороты
	|				ГДЕ
	|					ПродажиОбороты.Регистратор <> &Ссылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПродажиОбороты.Контрагент) КАК ВложенныйЗапрос
	|		ПО РасходнаяНакладная.Контрагент = ВложенныйЗапрос.Контрагент
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &Ссылка
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВложенныйЗапрос1.СкидкаЛояльность) КАК СкидкаЛояльность,
	|	ВложенныйЗапрос1.КоэфициентПересчета КАК КоэфициентПересчета
	|ПОМЕСТИТЬ ВТ_ПарогиЛояльности
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(ВидыКартЛояльностиПорогиНакопительныхСкидок.СкидкаЛояльность, 0) КАК СкидкаЛояльность,
	|		ЕСТЬNULL(ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка.КоэфициентПересчета, 1) КАК КоэфициентПересчета
	|	ИЗ
	|		(ВЫБРАТЬ
	|			РасходнаяНакладная.СуммаДокумента КАК СуммаДокумента,
	|			МАКСИМУМ(ВидыКартЛояльностиПорогиНакопительныхСкидок.НижняяГраницаЛояльность) КАК НижняяГраницаЛояльность,
	|			ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыКартЛояльности.ПорогиНакопительныхСкидок КАК ВидыКартЛояльностиПорогиНакопительныхСкидок
	|				ПО РасходнаяНакладная.СуммаДокумента >= ВидыКартЛояльностиПорогиНакопительныхСкидок.НижняяГраницаЛояльность
	|					И РасходнаяНакладная.КартаЛояльности.Владелец = ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка
	|		ГДЕ
	|			РасходнаяНакладная.Ссылка = &Ссылка
	|			И РасходнаяНакладная.Ссылка.КартаЛояльности <> ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РасходнаяНакладная.СуммаДокумента,
	|			ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыКартЛояльности.ПорогиНакопительныхСкидок КАК ВидыКартЛояльностиПорогиНакопительныхСкидок
	|			ПО ВложенныйЗапрос.Ссылка = ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка
	|				И ВложенныйЗапрос.НижняяГраницаЛояльность = ВидыКартЛояльностиПорогиНакопительныхСкидок.НижняяГраницаЛояльность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЕСТЬNULL(ВидыКартЛояльностиПорогиНакопительныхСкидок1.СкидкаЛояльность, 0),
	|		ЕСТЬNULL(ВидыКартЛояльностиПорогиНакопительныхСкидок1.Ссылка.КоэфициентПересчета, 1)
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВТ_ОборотыКонтрагента.СуммаСОборотом КАК СуммаДокумента,
	|			МАКСИМУМ(ВидыКартЛояльностиПорогиНакопительныхСкидок.НижняяГраницаЛояльность) КАК НижняяГраницаЛояльность,
	|			ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка КАК Ссылка
	|		ИЗ
	|			ВТ_ОборотыКонтрагента КАК ВТ_ОборотыКонтрагента
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыКартЛояльности.ПорогиНакопительныхСкидок1 КАК ВидыКартЛояльностиПорогиНакопительныхСкидок
	|				ПО ВТ_ОборотыКонтрагента.СуммаСОборотом >= ВидыКартЛояльностиПорогиНакопительныхСкидок.НижняяГраницаЛояльность
	|					И ВТ_ОборотыКонтрагента.КартаЛояльности.Владелец = ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВидыКартЛояльностиПорогиНакопительныхСкидок.Ссылка,
	|			ВТ_ОборотыКонтрагента.СуммаСОборотом) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыКартЛояльности.ПорогиНакопительныхСкидок1 КАК ВидыКартЛояльностиПорогиНакопительныхСкидок1
	|			ПО ВложенныйЗапрос.Ссылка = ВидыКартЛояльностиПорогиНакопительныхСкидок1.Ссылка
	|				И ВложенныйЗапрос.НижняяГраницаЛояльность = ВидыКартЛояльностиПорогиНакопительныхСкидок1.НижняяГраницаЛояльность) КАК ВложенныйЗапрос1
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос1.КоэфициентПересчета
	|;
	//--- Дмгг
	// Олег Литвиненко 09.01.23 --->
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетнаяПолитикаРеглСрезПоследних.Организация КАК Организация,
	|	УчетнаяПолитикаРеглСрезПоследних.СчетДляПредоплаченныхРасходовРегл как СчетДляПредоплаченныхРасходовРегл,
	|	УчетнаяПолитикаРеглСрезПоследних.ВалютаУправленческая КАК ВалютаУправленческая,
	|	УчетнаяПолитикаРеглСрезПоследних.ДатаНачалаУчетаПоУпрВалюте КАК ДатаНачалаУчетаПоУпрВалюте
	|ПОМЕСТИТЬ втУчетнаяПолитика
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&НаДату, Организация = &Организация) КАК УчетнаяПолитикаРеглСрезПоследних
	|ГДЕ
	|	УчетнаяПолитикаРеглСрезПоследних.ВестиУчетВУпрВалюте
	|	И УчетнаяПолитикаРеглСрезПоследних.ДатаНачалаУчетаПоУпрВалюте <= &НаДату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КурсыВалютСрезПоследних.Курс = 0
	|			ТОГДА 1	
	|		ИНАЧЕ КурсыВалютСрезПоследних.Курс
	|	КОНЕЦ КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ втКурсУпрВалюты
	|ИЗ
	|	втУчетнаяПолитика КАК втУчетнаяПолитика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, ) КАК КурсыВалютСрезПоследних
	|		ПО втУчетнаяПолитика.ВалютаУправленческая = КурсыВалютСрезПоследних.Валюта
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втУчетнаяПолитика
	|;
	// Олег Литвиненко <---
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.Ссылка КАК Ссылка,
	|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
	|	РасходнаяНакладнаяЗапасы.СерийныеНомера КАК СерийныеНомера,
	|	РасходнаяНакладнаяЗапасы.Цена КАК Цена,
	|	РасходнаяНакладнаяЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	РасходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	РасходнаяНакладнаяЗапасы.Заказ КАК Заказ,
	|	РасходнаяНакладнаяЗапасы.Всего КАК Всего,
	|	РасходнаяНакладнаяЗапасы.ТипНоменклатурыЗапас КАК ТипНоменклатурыЗапас,
	|	РасходнаяНакладнаяЗапасы.Резерв КАК Резерв,
	|	РасходнаяНакладнаяЗапасы.Содержание КАК Содержание,
	|	РасходнаяНакладнаяЗапасы.КлючСвязи КАК КлючСвязи,
	|	РасходнаяНакладнаяЗапасы.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	РасходнаяНакладнаяЗапасы.СправкаБ КАК СправкаБ,
	|	РасходнаяНакладнаяЗапасы.Партия КАК Партия,
	|	РасходнаяНакладнаяЗапасы.Количество КАК Количество,
	|	РасходнаяНакладнаяЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	РасходнаяНакладнаяЗапасы.НомерГТД КАК НомерГТД,
	|	РасходнаяНакладнаяЗапасы.ТоварыДляПроизводства КАК ТоварыДляПроизводства,
	|	РасходнаяНакладнаяЗапасы.Вес КАК Вес,
	|	ВЫБОР 
	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику) 
	|			ТОГДА ИСТИНА 
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.ЭтоПодарок 
	|	КОНЕЦ КАК ЭтоПодарок,
	|	РасходнаяНакладнаяЗапасы.Сотрудник КАК Сотрудник,
	
	//Малышев 2024-06-17 - перенес сюда
	//|	РасходнаяНакладнаяЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//+Lazare 12.09.2022
	|	ВЫБОР
	//Малышев 2025-12-24 ES4001-121 ((--
	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику) 
	|			ТОГДА РасходнаяНакладнаяЗапасы.СтруктурнаяЕдиница
	//Малышев 2025-12-24 ES4001-121 --)
	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти)
	|			ТОГДА РасходнаяНакладнаяЗапасы.СтруктурнаяЕдиницаЗапасы
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница,	
	//+Lazare 12.09.2022
	|	ВЫБОР
	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ПоложениеСклада = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти)
	|			ТОГДА РасходнаяНакладнаяЗапасы.СтруктурнаяЕдиницаЗапасы
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиницаЗапасы,	
	//Малышев 2024-06-17 --)
	
		
	|	РасходнаяНакладнаяЗапасы.СуммаНДФЛ КАК СуммаНДФЛ,
	|	РасходнаяНакладнаяЗапасы.УдержаниеПенсии КАК УдержаниеПенсии,
	|	РасходнаяНакладнаяЗапасы.УдерживатьПенсию КАК УдерживатьПенсию,
	|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДСБезвозмездно,
	|	РасходнаяНакладнаяЗапасы.Объем КАК Объем,
	//+++ Дмгг
	
	//Малышев 2024-11-08 ONESOFT-3589 (--
	|	ISNULL(РасходнаяНакладнаяЗапасы.Всего 
	|			- РасходнаяНакладнаяЗапасы.Всего * (ЕСТЬNULL(ВТ_ПарогиЛояльности.СкидкаЛояльность, 0) / 100) * ЕСТЬNULL(ВТ_ПарогиЛояльности.КоэфициентПересчета, 0) 
	|			- (РасходнаяНакладнаяЗапасы.Всего 
	|			- РасходнаяНакладнаяЗапасы.Сумма * (ЕСТЬNULL(ВТ_ПарогиЛояльности.СкидкаЛояльность, 0) / 100) * ЕСТЬNULL(ВТ_ПарогиЛояльности.КоэфициентПересчета, 0)) / (1 + РасходнаяНакладнаяЗапасы.СтавкаНДС.Ставка / 100)
	|	,0) КАК СуммаНДС,
	|	РасходнаяНакладнаяЗапасы.СуммаНДС как СуммаНДССтроки,	
	|	РасходнаяНакладнаяЗапасы.СуммаНДСБаллов как СуммаНДСБаллов,	
	|	РасходнаяНакладнаяЗапасы.СуммаНДСЛояльности как СуммаНДСЛояльности,	
	|	РасходнаяНакладнаяЗапасы.СуммаНДСНакопленныхБаллов как СуммаНДСНакопленныхБаллов,	
	//Малышев 2024-11-08 ONESOFT-3589 --)
	|	ISNULL(ВТ_ПарогиЛояльности.СкидкаЛояльность,0) КАК СкидкаЛояльность,  
	|	ISNULL(ВТ_ПарогиЛояльности.КоэфициентПересчета,0) КАК КоэфициентПересчета,
	
	//Малышев 2025-02-04 ONESOFT-3820 (--
	|	ВЫРАЗИТЬ(
	|		РасходнаяНакладнаяЗапасы.Всего 
	|		- ISNULL(РасходнаяНакладнаяЗапасы.Всего 
	|			- РасходнаяНакладнаяЗапасы.Всего * (ЕСТЬNULL(ВТ_ПарогиЛояльности.СкидкаЛояльность, 0) / 100) * ЕСТЬNULL(ВТ_ПарогиЛояльности.КоэфициентПересчета, 0) 
	|			- (РасходнаяНакладнаяЗапасы.Всего 
	|			- РасходнаяНакладнаяЗапасы.Сумма * (ЕСТЬNULL(ВТ_ПарогиЛояльности.СкидкаЛояльность, 0) / 100) * ЕСТЬNULL(ВТ_ПарогиЛояльности.КоэфициентПересчета, 0)) / (1 + РасходнаяНакладнаяЗапасы.СтавкаНДС.Ставка / 100)
	|	,0)
	
	//|		- РасходнаяНакладнаяЗапасы.Всего * (ISNULL(ВТ_ПарогиЛояльности.СкидкаЛояльность,0) / 100) * ISNULL(ВТ_ПарогиЛояльности.КоэфициентПересчета,0) 
	//|		- ВЫБОР
	//|			КОГДА РасходнаяНакладнаяЗапасы.СтавкаНДС.Ставка = 0
	//|				ТОГДА 0
	//|			ИНАЧЕ 
	//|				РасходнаяНакладнаяЗапасы.Всего 
	//|				- РасходнаяНакладнаяЗапасы.Всего * (ISNULL(ВТ_ПарогиЛояльности.СкидкаЛояльность,0) / 100) * ISNULL(ВТ_ПарогиЛояльности.КоэфициентПересчета,0) - (РасходнаяНакладнаяЗапасы.Всего - РасходнаяНакладнаяЗапасы.Сумма * (ISNULL(ВТ_ПарогиЛояльности.СкидкаЛояльность,0) / 100) * ISNULL(ВТ_ПарогиЛояльности.КоэфициентПересчета,0)) / (1 + РасходнаяНакладнаяЗапасы.СтавкаНДС.Ставка / 100)
	//|		КОНЕЦ 
	//Малышев 2025-02-04 --)
	
	|	КАК ЧИСЛО(15, 6)) КАК Сумма,
	|	РасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ КАК ВидНачисленияУдержания,
	|	РасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ КАК ВидНалогаНДФЛ,
	|	РасходнаяНакладнаяЗапасы.СчетДоходовБП КАК СчетДоходовБП,
	|	РасходнаяНакладнаяЗапасы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	РасходнаяНакладнаяЗапасы.НаправлениеДеятельности,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) //Малышев 2025-03-14
	|		КОГДА &УчетПоПроектам
	|			ТОГДА ВЫБОР
	|					КОГДА РасходнаяНакладнаяЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|					ИНАЧЕ РасходнаяНакладнаяЗапасы.Проект
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОНЕЦ КАК Проект,
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	РасходнаяНакладнаяЗапасы.Ссылка.ПровестиНалогПрибили КАК ПровестиНалогПрибили,
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	|	РасходнаяНакладнаяЗапасы.СчетУчетаВыручкиОтПродажРегл КАК СчетУчетаВыручкиОтПродажРегл,
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	РасходнаяНакладнаяЗапасы.Усушка_КоличествоСобрПотери КАК КоличествоСобрПотери
	|	,РасходнаяНакладнаяЗапасы.Усушка_СписаниеНаПотери.СчетУчетаПотерь КАК СчетУчетаПотерь
	|	,РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения.Коэффициент КАК ЕдиницаИзмеренияКоэффициент
	|	,РасходнаяНакладнаяЗапасы.Усушкa_КоличествоСтарое КАК КоличествоСтарое
	|	,РасходнаяНакладнаяЗапасы.Усушка_СписаниеНаПотери КАК СписаниеНаПотери
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,РасходнаяНакладнаяЗапасы.БалыРасход КАК БалыРасход
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыПерерасчетПред
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы,
	|	ВТ_ПарогиЛояльности КАК ВТ_ПарогиЛояльности
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.СуммаНДС КАК ЧИСЛО(15, 6))) КАК ЧИСЛО(15, 6)) КАК СуммаНДС,
	|	СУММА(1) КАК КоличествоСтрок,
	|	ВЫРАЗИТЬ(СУММА(ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.Сумма КАК ЧИСЛО(15, 6))) КАК ЧИСЛО(15, 6)) КАК Сумма
	|ПОМЕСТИТЬ вт_ЗапасыГрупп
	|ИЗ
	|	ВременнаяТаблицаЗапасыПерерасчетПред КАК ВременнаяТаблицаЗапасыПерерасчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка,
	|	ВременнаяТаблицаЗапасыПерерасчет.НомерСтроки,
	|	ВременнаяТаблицаЗапасыПерерасчет.Номенклатура,
	|	ВременнаяТаблицаЗапасыПерерасчет.ЕдиницаИзмерения,
	|	ВременнаяТаблицаЗапасыПерерасчет.Характеристика,
	|	ВременнаяТаблицаЗапасыПерерасчет.СерийныеНомера,
	|	ВременнаяТаблицаЗапасыПерерасчет.Цена,
	|	ВременнаяТаблицаЗапасыПерерасчет.ПроцентСкидкиНаценки,
	|	ВременнаяТаблицаЗапасыПерерасчет.СтавкаНДС,
	|	ВременнаяТаблицаЗапасыПерерасчет.Заказ,
	|	ВременнаяТаблицаЗапасыПерерасчет.Всего,
	|	ВременнаяТаблицаЗапасыПерерасчет.ТипНоменклатурыЗапас,
	//|	ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.Сумма / вт_ЗапасыГрупп.Сумма * вт_РасходыГрупп.СуммаБезНалогов КАК ЧИСЛО(15, 8)) КАК СуммаРасходов,
	|	ВременнаяТаблицаЗапасыПерерасчет.Содержание,
	|	ВременнаяТаблицаЗапасыПерерасчет.КлючСвязи,
	|	ВременнаяТаблицаЗапасыПерерасчет.Резерв,
	|	ВременнаяТаблицаЗапасыПерерасчет.СправкаБ,
	|	ВременнаяТаблицаЗапасыПерерасчет.Партия,
	|	ВременнаяТаблицаЗапасыПерерасчет.Количество,
	|	ВременнаяТаблицаЗапасыПерерасчет.СтранаПроисхождения,
	|	ВременнаяТаблицаЗапасыПерерасчет.НомерГТД,
	|	ВременнаяТаблицаЗапасыПерерасчет.ТоварыДляПроизводства,
	|	ВременнаяТаблицаЗапасыПерерасчет.Вес,
	|	ВременнаяТаблицаЗапасыПерерасчет.Объем,
	|	ВременнаяТаблицаЗапасыПерерасчет.ЭтоПодарок,
	|	ВременнаяТаблицаЗапасыПерерасчет.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблицаЗапасыПерерасчет.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗапасыПерерасчет.СуммаНДФЛ КАК СуммаНДФЛ,
	|	ВременнаяТаблицаЗапасыПерерасчет.УдержаниеПенсии КАК УдержаниеПенсии,
	|	ВременнаяТаблицаЗапасыПерерасчет.УдерживатьПенсию КАК УдерживатьПенсию,
	|	ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.СуммаНДС КАК ЧИСЛО(15, 6)) КАК СуммаНДС,
	|	ВременнаяТаблицаЗапасыПерерасчет.СуммаНДССтроки, //Малышев 2024-11-11 
	|	ВременнаяТаблицаЗапасыПерерасчет.СуммаНДСБезвозмездно КАК СуммаНДСБезвозмездно,
	|	ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.Сумма КАК ЧИСЛО(15, 6)) КАК Сумма,
	|	ВременнаяТаблицаЗапасыПерерасчет.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ВременнаяТаблицаЗапасыПерерасчет.ВидНалогаНДФЛ КАК ВидНалогаНДФЛ,
	|	ВременнаяТаблицаЗапасыПерерасчет.СчетДоходовБП КАК СчетДоходовБП,
	|	ВременнаяТаблицаЗапасыПерерасчет.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ВременнаяТаблицаЗапасыПерерасчет.НаправлениеДеятельности,
	
	//Малышев 2024-06-17 закоментировал, т.к. выше в ВременнаяТаблицаЗапасыПерерасчет уже все прописано (--
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА ВременнаяТаблицаЗапасыПерерасчет.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|	КОНЕЦ КАК Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	|    ВременнаяТаблицаЗапасыПерерасчет.Проект, 
	//Малышев 2024-06-17 --)
		
	|	ВременнаяТаблицаЗапасыПерерасчет.ПровестиНалогПрибили КАК ПровестиНалогПрибили
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	|	,ВременнаяТаблицаЗапасыПерерасчет.СчетУчетаВыручкиОтПродажРегл,
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	//Lazare_
	|	ВременнаяТаблицаЗапасыПерерасчет.СтруктурнаяЕдиницаЗапасы  КАК СтруктурнаяЕдиницаЗапасы
	//_Lazare
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,ВременнаяТаблицаЗапасыПерерасчет.КоличествоСобрПотери КАК КоличествоСобрПотери
	|	,ВременнаяТаблицаЗапасыПерерасчет.СчетУчетаПотерь КАК СчетУчетаПотерь
	|	,ВременнаяТаблицаЗапасыПерерасчет.ЕдиницаИзмеренияКоэффициент КАК ЕдиницаИзмеренияКоэффициент
	|	,ВременнаяТаблицаЗапасыПерерасчет.КоличествоСтарое КАК КоличествоСтарое
	|	,ВременнаяТаблицаЗапасыПерерасчет.СписаниеНаПотери КАК СписаниеНаПотери
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,ВременнаяТаблицаЗапасыПерерасчет.СуммаНДСНакопленныхБаллов КАК СуммаНДСНакопленныхБаллов
	|	,ВременнаяТаблицаЗапасыПерерасчет.СуммаНДСЛояльности КАК СуммаНДСЛояльности
	|	,ВременнаяТаблицаЗапасыПерерасчет.СуммаНДСБаллов КАК СуммаНДСБаллов
	|	,ВременнаяТаблицаЗапасыПерерасчет.БалыРасход КАК БалыРасход
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыПерерасчет
	|ИЗ
	|	ВременнаяТаблицаЗапасыПерерасчетПред КАК ВременнаяТаблицаЗапасыПерерасчет,
	//|	вт_РасходыГрупп КАК вт_РасходыГрупп,
	|	вт_ЗапасыГрупп КАК вт_ЗапасыГрупп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//+++ Дмгг, Переписан алгоритм получения среднего курса документа
	//|ВЫБРАТЬ
	//|	РасходнаяНакладная.Ссылка КАК Ссылка,
	//|	ВЫБОР
	//|		КОГДА РасходнаяНакладнаяПредоплата.Ссылка.СуммаДокумента = СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.СуммаРасчетов, 0))
	//|			ТОГДА СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.Курс, 0)) / МАКСИМУМ(РасходнаяНакладнаяПредоплата.НомерСтроки)
	//|		ИНАЧЕ (СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.Курс, 0)) + РасходнаяНакладнаяПредоплата.Ссылка.Курс) / (МАКСИМУМ(РасходнаяНакладнаяПредоплата.НомерСтроки) + 1)
	//|	КОНЕЦ КАК Курс,
	//|	ВЫБОР
	//|		КОГДА РасходнаяНакладнаяПредоплата.Ссылка.СуммаДокумента = СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.СуммаРасчетов, 0))
	//|			ТОГДА СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.Кратность, 0)) / МАКСИМУМ(РасходнаяНакладнаяПредоплата.НомерСтроки)
	//|		ИНАЧЕ (СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.Кратность, 0)) + РасходнаяНакладнаяПредоплата.Ссылка.Кратность) / (МАКСИМУМ(РасходнаяНакладнаяПредоплата.НомерСтроки) + 1)
	//|	КОНЕЦ КАК Кратность,
	//|	СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.СуммаРасчетов, 0)) КАК СуммаРасчетов,
	//|	МАКСИМУМ(РасходнаяНакладнаяПредоплата.НомерСтроки) КАК КолвоСтрок,
	//|	СУММА(ЕСТЬNULL(РасходнаяНакладнаяПредоплата.СуммаРасчетов * РасходнаяНакладнаяПредоплата.Курс / РасходнаяНакладнаяПредоплата.Кратность, 0)) КАК СуммаРасчетовНац
	//|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПредоплаты
	//|ИЗ
	//|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Предоплата КАК РасходнаяНакладнаяПредоплата
	//|		ПО РасходнаяНакладная.Ссылка = РасходнаяНакладнаяПредоплата.Ссылка
	//|ГДЕ
	//|	РасходнаяНакладная.Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасходнаяНакладная.Ссылка,
	//|	РасходнаяНакладнаяПредоплата.Ссылка.СуммаДокумента,
	//|	РасходнаяНакладнаяПредоплата.Ссылка.Курс,
	//|	РасходнаяНакладнаяПредоплата.Ссылка.Кратность
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка,
	////+++ Дмгг Все условия перенесены в предыдущей таблице
	////|	ВЫБОР
	////|		КОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов = ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента
	//////|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетовНац / ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента
	////|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.Курс
	////|		КОГДА ЕСТЬNULL(ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов, 0) = 0
	////|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Курс
	////|		ИНАЧЕ ((ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента - ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов) * ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Курс / ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Кратность + ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетовНац) / ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента * ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Кратность
	////|	КОНЕЦ КАК Курс,
	//|	ЕСТЬNULL(ВременнаяТаблицаСреднегоКурсаПредоплаты.Курс, ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Курс) КАК Курс,
	////|	ВЫБОР
	////|		КОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов = ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента
	//////|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность / ВременнаяТаблицаСреднегоКурсаПредоплаты.КолвоСтрок
	////|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность
	////|		КОГДА ЕСТЬNULL(ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов, 0) = 0
	////|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Кратность
	////|		ИНАЧЕ (ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность + ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Кратность) / 2 //(ВременнаяТаблицаСреднегоКурсаПредоплаты.КолвоСтрок + 1)
	////|	КОНЕЦ КАК Кратность
	//|	ЕСТЬNULL(ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность, ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Кратность) КАК Кратность
	//|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПоДокументу
	//|ИЗ
	//|	ВременнаяТаблицаСреднегоКурсаПредоплаты КАК ВременнаяТаблицаСреднегоКурсаПредоплаты
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяПредоплата.Ссылка,
	|	СУММА(РасходнаяНакладнаяПредоплата.СуммаРасчетов) КАК СуммаРасчетов,
	|	СУММА(РасходнаяНакладнаяПредоплата.СуммаРасчетов * РасходнаяНакладнаяПредоплата.Курс / РасходнаяНакладнаяПредоплата.Кратность) КАК СуммаРасчетовРеглПоКурсуПредоплаты
	|ПОМЕСТИТЬ ВременнаяТаблицаСуммаПредоплатыГрупп
	|ИЗ
	|	Документ.РасходнаяНакладная.Предоплата КАК РасходнаяНакладнаяПредоплата
	|ГДЕ
	|	РасходнаяНакладнаяПредоплата.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяПредоплата.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК Ссылка,
	|	РасходнаяНакладная.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) КАК СуммаНеОплаченаВал,
	|	(РасходнаяНакладная.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * РасходнаяНакладная.Курс / РасходнаяНакладная.Кратность КАК СуммаНеОплаченаРегл,
	|	ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) КАК СуммаРасчетовВал,
	|	ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты КАК СуммаРасчетовРегл,
	|	(РасходнаяНакладная.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * РасходнаяНакладная.Курс / РасходнаяНакладная.Кратность + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты, 0) КАК СуммаДокументаРеглПоВсемКурсам,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладная.СуммаДокумента = 0
	|			ТОГДА 1
	|		ИНАЧЕ ((РасходнаяНакладная.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * РасходнаяНакладная.Курс / РасходнаяНакладная.Кратность + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты, 0)) / РасходнаяНакладная.СуммаДокумента
	|	КОНЕЦ КАК СреднийКурсДокумента,
	|	1 КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПредоплаты
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСуммаПредоплатыГрупп КАК ВременнаяТаблицаСуммаПредоплатыГрупп
	|		ПО РасходнаяНакладная.Ссылка = ВременнаяТаблицаСуммаПредоплатыГрупп.Ссылка
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка,
	|	ВременнаяТаблицаСреднегоКурсаПредоплаты.СреднийКурсДокумента КАК Курс,
	|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПоДокументу
	|ИЗ
	|	ВременнаяТаблицаСреднегоКурсаПредоплаты КАК ВременнаяТаблицаСреднегоКурсаПредоплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//--- Дмгг
	|ВЫБРАТЬ
	|	РасходнаяНакладная.Договор.ЭтоДоговорОбслуживания КАК ЭтоДоговорОбслуживания,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладная.Договор.ЭтоДоговорОбслуживания
	|				И РасходнаяНакладная.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВестиУчетРасходовПоДоговорамОбслуживания,
	|	РасходнаяНакладная.Договор.ДоговорОбслуживанияНаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РасходнаяНакладная.СуммаВключаетНДС,
	|	РасходнаяНакладная.ВидНалогаНДС,
	|	РасходнаяНакладная.Договор.ВалютаРасчетов КАК ДоговорВалютаРасчетов,
	|	РасходнаяНакладная.Договор.РасчетыВУсловныхЕдиницах КАК ДоговорРасчетыВУсловныхЕдиницах,
	|	РасходнаяНакладная.Организация,
	|	РасходнаяНакладная.Контрагент,
	|	РасходнаяНакладная.ВалютаДокумента,
	|	РасходнаяНакладная.Кратность,
	|	РасходнаяНакладная.Курс,
	|	РасходнаяНакладная.Договор,
	|	РасходнаяНакладная.СчетЗатратБезвозмезднойПродажи,
	|	РасходнаяНакладная.СчетЗатратНДСБезвозмезднойПродажи,
	|	РасходнаяНакладная.СчетУчетаНалогаНаПрибыль,
	|	РасходнаяНакладная.СчетУчетаНалогаНаПрибыльПодлежащийОплате,
	|	РасходнаяНакладная.СчетЗатратБезвозмезднойПродажиСотрудник,
	|	РасходнаяНакладная.СчетЗатратНДСБезвозмезднойПродажиСотрудник,
	|	РасходнаяНакладная.СчетЗатратНДФЛСотрудник,
	|	РасходнаяНакладная.СчетЗатратПФСотрудник,
	|	РасходнаяНакладная.СчетУчетаСвободнаяпродажаСотрудник,
	|	РасходнаяНакладная.СчетУчетаСвободнаяпродажа,
	|	NULL КАК ВидНачисленияУдержания,
	|	РасходнаяНакладная.Дата,
	//Малышев 2024-10-31 ONESOFT-3558 (--
	|	РасходнаяНакладная.ОбщаяСуммаКОплате,
	|	РасходнаяНакладная.СуммаНДСБаллов,
	|	РасходнаяНакладная.СуммаНДСЛояльности,
	//Малышев 2024-10-31 ONESOFT-3558 --)
	
	|	РасходнаяНакладная.ВидИспользоыванияБалов КАК ВидИспользоыванияБалов, //+++ Дмгг
	//Lazare_
	|	РасходнаяНакладная.ПоложениеСклада КАК ПоложениеСклада
	//_Lazare
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаНациональная, &ВалютаНакладной)) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(РасходнаяНакладнаяЗапасы.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ МаксНомерСтрокиЗапасы
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.Ссылка,
	|	РасходнаяНакладнаяЗапасы.НомерСтроки,
	|	РасходнаяНакладнаяЗапасы.Номенклатура,
	|	РасходнаяНакладнаяЗапасы.Партия,
	|	РасходнаяНакладнаяЗапасы.СтранаПроисхождения,
	|	РасходнаяНакладнаяЗапасы.НомерГТД,
	|	РасходнаяНакладнаяЗапасы.Характеристика,
	|	РасходнаяНакладнаяЗапасы.Заказ,
	|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения,
	|	РасходнаяНакладнаяЗапасы.Количество,
	|	РасходнаяНакладнаяЗапасы.Резерв,
	|	РасходнаяНакладнаяЗапасы.СтавкаНДС,
	|	РасходнаяНакладнаяЗапасы.СуммаНДС,
	|	РасходнаяНакладнаяЗапасы.Всего,
	|	РасходнаяНакладнаяЗапасы.Сумма,
	|	РасходнаяНакладнаяЗапасы.КлючСвязи,
	|	РасходнаяНакладнаяЗапасы.ЭтоПодарок,
	|	РасходнаяНакладнаяЗапасы.Сотрудник КАК Сотрудник,
	|	РасходнаяНакладнаяЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	РасходнаяНакладнаяЗапасы.СуммаНДФЛ КАК СуммаНДФЛ,
	|	РасходнаяНакладнаяЗапасы.УдержаниеПенсии КАК УдержаниеПенсии,
	|	РасходнаяНакладнаяЗапасы.УдержаниеПенсии КАК СуммаПФ,
	|	РасходнаяНакладнаяЗапасы.УдерживатьПенсию КАК УдерживатьПенсию,
	|	РасходнаяНакладнаяЗапасы.СуммаНДСБезвозмездно КАК СуммаНДСБезвозмездно,
	|	РасходнаяНакладнаяЗапасы.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	РасходнаяНакладнаяЗапасы.ВидНачисленияУдержания КАК ВидУдержанияНДФЛ,
	|	РасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ КАК ВидНалогаНДФЛ,
	|	РасходнаяНакладнаяЗапасы.СчетДоходовБП КАК СчетДоходовБП,
	|	РасходнаяНакладнаяЗапасы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	РасходнаяНакладнаяЗапасы.ПровестиНалогПрибили КАК ПровестиНалогПрибили,
	|	РасходнаяНакладнаяЗапасы.НаправлениеДеятельности,
	
	//Малышев 2024-06-10 ONESOFT-3093  - проект уже описан выше(--
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	////|	ВЫБОР 
	////|		КОГДА &УчетПоПроектам 
	////|			ТОГДА РасходнаяНакладнаяЗапасы.Проект
	////|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	////|	КОНЕЦ КАК Проект,
	//////ПодольскийАИ #УчетПроектов 10.10.2020 }                                            
	//|	ВЫБОР
	//|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)   
	//|		КОГДА РасходнаяНакладнаяЗапасы.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА РасходнаяНакладнаяЗапасы.Проект
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) //++Lazare_05.02.2021
	//|	КОНЕЦ КАК Проект,                 
	|РасходнаяНакладнаяЗапасы.Проект,
	//Малышев 2024-06-10 ONESOFT-3093  --)
   		
	//|	РасходнаяНакладнаяЗапасы.СуммаРегл КАК СуммаРегл,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|			ТОГДА РасходнаяНакладнаяЗапасы.Всего
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Всего  * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность) 
	|	КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаРегл,
	//|	РасходнаяНакладнаяЗапасы.СуммаНДСРегл КАК СуммаНДСРегл
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|			ТОГДА РасходнаяНакладнаяЗапасы.СуммаНДС
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность) 
	|	КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаНДСРегл
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	|	,РасходнаяНакладнаяЗапасы.СчетУчетаВыручкиОтПродажРегл,
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	//Lazare_
	|	РасходнаяНакладнаяЗапасы.СтруктурнаяЕдиницаЗапасы как СтруктурнаяЕдиницаЗапасы ,
	|  ВЫРАЗИТЬ (РасходнаяНакладнаяЗапасы.Количество * РасходнаяНакладнаяЗапасы.Цена   КАК ЧИСЛО(15, 2))    КАК СуммаБезСкидки
	//_Lazare
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,РасходнаяНакладнаяЗапасы.КоличествоСобрПотери КАК КоличествоСобрПотери
	|	,РасходнаяНакладнаяЗапасы.СчетУчетаПотерь КАК СчетУчетаПотерь
	|	,РасходнаяНакладнаяЗапасы.КоличествоСтарое КАК КоличествоСтарое
	|	,РасходнаяНакладнаяЗапасы.СписаниеНаПотери КАК СписаниеНаПотери
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,РасходнаяНакладнаяЗапасы.СуммаНДСЛояльности //Малышев 2024-10-31 ONESOFT-3558
	|	,РасходнаяНакладнаяЗапасы.СуммаНДСНакопленныхБаллов //Малышев 2024-10-31 ONESOFT-3558
	|	,РасходнаяНакладнаяЗапасы.СуммаНДСБаллов //Малышев 2024-10-31 ONESOFT-3558
	|	,РасходнаяНакладнаяЗапасы.БалыРасход //Малышев 2024-10-31 ONESOFT-3558 
	|	,РасходнаяНакладнаяЗапасы.СуммаНДССтроки //Малышев 2024-11-11 
	|ПОМЕСТИТЬ ВТРасходнаяНакладнаяЗапасы
	|ИЗ
	//|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|	ВременнаяТаблицаЗапасыПерерасчет КАК РасходнаяНакладнаяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
	|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
	|		ПО (КурсыРегВалюты.Валюта = &ВалютаНациональная)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокумента
	|		ПО (СреднийКурсДокумента.Ссылка.ВалютаДокумента = РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента)
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка,
	|	ЕСТЬNULL(МаксНомерСтрокиЗапасы.НомерСтроки, 0) + 1,
	|	РасходнаяНакладная.НоменклатураДоставки,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	РасходнаяНакладная.Заказ,
	|	РасходнаяНакладная.НоменклатураДоставки.ЕдиницаИзмерения,
	|	1,
	|	0,
	|	РасходнаяНакладная.СтавкаНДСДоставки,
	|	РасходнаяНакладная.СуммаНДСДоставки,
	|	РасходнаяНакладная.СтоимостьДоставки,
	|	РасходнаяНакладная.СтоимостьДоставки - РасходнаяНакладная.СуммаНДСДоставки,
	|	0,
	|	ЛОЖЬ,
	|	Значение(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
	|	Значение(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК СтруктурнаяЕдиница,
	|	0 КАК СуммаНДФЛ,
	|	0 КАК УдержаниеПенсии,
	|	0 КАК СуммаПФ,
	|	ЛОЖЬ КАК УдерживатьПенсию,
	|	0 КАК СуммаНДСБезвозмездно,
	|	NULL КАК ВидНачисленияУдержания,
	|	NULL,
	|	NULL КАК ВидНалогаНДФЛ,
	|	NULL КАК СчетДоходовБП,
	|	NULL КАК ВидУдержанияПФ,
	|	NULL КАК ПровестиНалогПрибили,
	|	NULL,
	
	//Малышев 2024-07-17 ONESOFT-3335 (--
	////ПодольскийАИ #УчетПроектов 10.10.2020 {
	//|	NULL КАК Проект,
	////ПодольскийАИ #УчетПроектов 10.10.2020 }
	|ВЫБОР 
	|	КОГДА &УчетПоПроектам = Ложь 
	|		Тогда Значение(Справочник.Проекты.ПустаяСсылка)
	|	ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|КОНЕЦ КАК Проект,		
	//Малышев 2024-07-17 ONESOFT-3335 --	)
	
	//Lazare, 10.06.2021
	//|	0,
	//|	0	
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасходнаяНакладная.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА РасходнаяНакладная.СтоимостьДоставки - РасходнаяНакладная.СуммаНДСДоставки
	|			ИНАЧЕ РасходнаяНакладная.СтоимостьДоставки * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 6)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасходнаяНакладная.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА РасходнаяНакладная.СуммаНДСДоставки
	|			ИНАЧЕ РасходнаяНакладная.СуммаНДСДоставки * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 6)),
	//Lazare, 10.06.2021
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка),
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	//_Lazare
	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК СтруктурнаяЕдиницаЗапасы,
	|	NULL
	//Lazare_
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,0
	|	,NULL
	|	,0 КАК КоличествоСтарое
	|	,NULL КАК СписаниеНаПотери
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,0
	|	,0
	|	,0
	|	,0 
	|	,0
	|ИЗ
	|	МаксНомерСтрокиЗапасы КАК МаксНомерСтрокиЗапасы,
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	//Lazare, 10.06.2021
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
	|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
	|		ПО (КурсыРегВалюты.Валюта = &ВалютаНациональная)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокумента
	|		ПО (СреднийКурсДокумента.Ссылка.ВалютаДокумента = РасходнаяНакладная.Ссылка.ВалютаДокумента)
	//Lazare, 10.06.2021
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &Ссылка
	|	И РасходнаяНакладная.НоменклатураДоставки <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации КАК ВидОперации,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка КАК Документ,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Ответственный КАК Ответственный,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.ДокументОснование КАК ДокументОснование,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент КАК Контрагент,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Дата КАК Период,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидНачисленияУдержания КАК ВидНачисленияУдержанияШапка, //+++ Дмгг
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА &Организация
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррОрганизация,
	
	//Малышев 2025-12-24 ES4001-121 ((--
	//|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Подразделение КАК ПодразделениеПродажи,
	|	ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику)
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.СтруктурнаяЕдиница
	|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Ссылка.Подразделение
	|	КОНЕЦ КАК ПодразделениеПродажи,
	//Малышев 2025-12-24 ES4001-121 --))

	|	ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.НаправлениеДеятельности
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности
	|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельностиПродажи,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
	|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
	|	КОНЕЦ КАК СчетУчетаПродажи,
	//|	ВЫБОР
	//|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	//|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	//|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	//|	КОНЕЦ КАК СчетУчетаПродажиРегл,
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	|	ВЫБОР 
	|		КОГДА КонстантаСчетВыручкиВТабличнойЧасти.Значение ТОГДА
	|			ВЫБОР
	|				КОГДА ВТРасходнаяНакладнаяЗапасы.СчетУчетаВыручкиОтПродажРегл = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА // выбираем по-старому
	|					ВЫБОР
	|						КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|							ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|						ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|					КОНЕЦ
	|				ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СчетУчетаВыручкиОтПродажРегл
	|			КОНЕЦ 
	|	ИНАЧЕ  // выбираем по-старому
	|		ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|			КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|				ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|		КОНЕЦ
	|	КОНЕЦ КАК СчетУчетаПродажиРегл,
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
	|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
	|	КОНЕЦ КАК СчетУчетаСебестоимость,
	|	ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.НаправлениеДеятельности <> Значение(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
	|		ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
	|	КОНЕЦ КАК СчетУчетаСебестоимостьРегл,
	|	ВТРасходнаяНакладнаяЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррСтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОрдерныйСклад,
	|	ВЫБОР
	|		КОГДА &УчетПоЯчейкам
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.Ячейка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Ячейка,
	|	ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|	ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасов КАК СчетУчета,
	|	ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаПереработчикуРегл КАК СчетУчетаПереработчикуРегл,
	|	ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррСчетУчета,
	|	ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				И ФункциональнаяОпцияПередачаСырьяВПереработку.Значение
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаПереработчикуРегл
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				И НЕ ФункциональнаяОпцияПередачаСырьяВПереработку.Значение
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	//|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррСчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|				И ВТРасходнаяНакладнаяЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				И ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТоварыНаКомиссии,
	|	ВТРасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	ВТРасходнаяНакладнаяЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВТРасходнаяНакладнаяЗапасы.НомерГТД КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Номенклатура
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррНоменклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьХарактеристики
	|						ТОГДА ВТРасходнаяНакладнаяЗапасы.Характеристика
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррХарактеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьПартии
	|						ТОГДА ВТРасходнаяНакладнаяЗапасы.Партия
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррПартия,
	|	ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И ВТРасходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Заказ
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|				И ВТРасходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|				ИЛИ ВТРасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТРасходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|							И ВТРасходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|						ТОГДА ВТРасходнаяНакладнаяЗапасы.Заказ
	|					КОГДА ВТРасходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|							И ВТРасходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|						ТОГДА ВТРасходнаяНакладнаяЗапасы.Заказ
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррЗаказ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТРасходнаяНакладнаяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Количество
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТРасходнаяНакладнаяЗапасы.Количество * ВТРасходнаяНакладнаяЗапасы.ЕдиницаИзмерения.Коэффициент - &СмещениеДляОкругления КАК ЧИСЛО(15,3))
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТРасходнаяНакладнаяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ВТРасходнаяНакладнаяЗапасы.Резерв
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТРасходнаяНакладнаяЗапасы.Резерв * ВТРасходнаяНакладнаяЗапасы.ЕдиницаИзмерения.Коэффициент - &СмещениеДляОкругления КАК ЧИСЛО(15,3))
	|	КОНЕЦ КАК Резерв,
	|	ВТРасходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	//|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаНДС * ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаНДСРегл
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаНДС,
	|	ВТРасходнаяНакладнаяЗапасы.СуммаНДССтроки как СуммаНДССтроки, //Малышев 2024-11-11 ONESOFT-3589
	|	ВТРасходнаяНакладнаяЗапасы.СуммаНДСРегл КАК СуммаНДСРегл, // Kuzmich, 18.12.2024, (ONESOFT-3709) Сумма НДС в отправленной счет фактуре
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.СуммаПФ * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	//|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаНДС * ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаПФ
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаПФ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.СуммаПФ * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаПФ
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаПФВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	//|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаНДС * ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаНДСЗакупкиПродажи,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	//|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Всего * ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаРегл
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК Сумма,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.СуммаНДС
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаНДСВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.Всего * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Всего
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаВал,
	|	ВТРасходнаяНакладнаяЗапасы.Всего КАК СуммаРасчетовПринятыеПереданные,
	|	ВТРасходнаяНакладнаяЗапасы.Всего КАК ВсегоВалютаДокумента,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ВТРасходнаяНакладнаяЗапасы.КлючСвязи,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА (ВТРасходнаяНакладнаяЗапасы.Всего - ВТРасходнаяНакладнаяЗапасы.СуммаНДС) * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	//|			ИНАЧЕ (ВТРасходнаяНакладнаяЗапасы.Всего - ВТРасходнаяНакладнаяЗапасы.СуммаНДС) * ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность)
	//|			ИНАЧЕ (ВТРасходнаяНакладнаяЗапасы.СуммаРегл - ВТРасходнаяНакладнаяЗапасы.СуммаНДСРегл)
	|			ИНАЧЕ (ВТРасходнаяНакладнаяЗапасы.Всего - ВТРасходнаяНакладнаяЗапасы.СуммаНДС) * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.СуммаВключаетНДС
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|							ТОГДА (ВТРасходнаяНакладнаяЗапасы.Всего - ВТРасходнаяНакладнаяЗапасы.СуммаНДС) * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|						ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Всего - ВТРасходнаяНакладнаяЗапасы.СуммаНДС
	|					КОНЕЦ КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|						ТОГДА ВТРасходнаяНакладнаяЗапасы.Сумма * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|					ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Сумма
	|				КОНЕЦ КАК ЧИСЛО(15, 6))
	|	КОНЕЦ КАК СуммаБезНДСВал,
	|	ВременнаяТаблицаШапка.ВидНалогаНДС,
	|	ВременнаяТаблицаШапка.СчетЗатратБезвозмезднойПродажи КАК СчетЗатратБезвозмезднойПродажи,
	|	ВременнаяТаблицаШапка.СчетЗатратНДСБезвозмезднойПродажи КАК СчетЗатратНДСБезвозмезднойПродажи,
	|	ВременнаяТаблицаШапка.СчетУчетаНалогаНаПрибыль КАК СчетУчетаНалогаНаПрибыль,
	|	ВременнаяТаблицаШапка.СчетУчетаНалогаНаПрибыльПодлежащийОплате КАК СчетУчетаНалогаНаПрибыльПодлежащийОплате,
	|	ВременнаяТаблицаШапка.СчетУчетаСвободнаяпродажа КАК СчетУчетаСвободнаяпродажа,
	|   ВременнаяТаблицаШапка.СчетУчетаСвободнаяпродажаСотрудник КАК СчетУчетаСвободнаяпродажаСотрудник,
	|	ВТРасходнаяНакладнаяЗапасы.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ВТРасходнаяНакладнаяЗапасы.СчетДоходовБП КАК СчетДоходовБП,
	|	ВТРасходнаяНакладнаяЗапасы.ЭтоПодарок,
	|	ВТРасходнаяНакладнаяЗапасы.Сотрудник КАК Сотрудник,
	|	ВТРасходнаяНакладнаяЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаБезвозмезднойПродажи,
	|	ВТРасходнаяНакладнаяЗапасы.СуммаНДФЛ КАК СуммаНДФЛ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.СуммаНДФЛ * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.Всего
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК СуммаНДФЛВал,
	|	ВТРасходнаяНакладнаяЗапасы.УдержаниеПенсии КАК УдержаниеПенсии,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВТРасходнаяНакладнаяЗапасы.УдержаниеПенсии * КурсыРегВалюты.Курс * ВТРасходнаяНакладнаяЗапасы.Ссылка.Кратность / (ВТРасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ВТРасходнаяНакладнаяЗапасы.УдержаниеПенсии
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК УдержаниеПенсииВал,
	|	ВТРасходнаяНакладнаяЗапасы.УдерживатьПенсию КАК УдерживатьПенсию,
	|	ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента КАК ВалютаБезвозмезднойПродажи,
	|	ВТРасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ.ВидНалога КАК ВидНалогаНДФЛ,
	|	ВТРасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ КАК ВидУдержанияНДФЛ,
	|	ВТРасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ.СтавкаНДФЛ КАК СтавкаНДФЛ,
	|	ВТРасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ.ВидНалога.СчетУчетаРегл КАК СчетУчетаРеглВидНалогаНДФЛ,
	|	ВТРасходнаяНакладнаяЗапасы.ВидНалогаНДФЛ.ВидНалога.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРеглВидНалогаНДФЛ,
	|	ВТРасходнаяНакладнаяЗапасы.СуммаНДСБезвозмездно КАК СуммаНДСБезвозмездно,
	|	ВременнаяТаблицаШапка.СчетЗатратБезвозмезднойПродажиСотрудник КАК СчетЗатратБезвозмезднойПродажиСотрудник,
	|	ВременнаяТаблицаШапка.СчетЗатратНДСБезвозмезднойПродажиСотрудник КАК СчетЗатратНДСБезвозмезднойПродажиСотрудник,
	|	ВременнаяТаблицаШапка.СчетЗатратНДФЛСотрудник КАК СчетЗатратНДФЛСотрудник,
	|	ВременнаяТаблицаШапка.СчетЗатратПФСотрудник КАК СчетЗатратПФСотрудник,
	|	ВТРасходнаяНакладнаяЗапасы.Сотрудник.СчетРасчетовСПерсоналомРегл КАК СчетРасчетовСПерсоналомРегл,
	|	ВТРасходнаяНакладнаяЗапасы.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетУчетаРеглВидНалогаПФСотрудника,
	|	ВТРасходнаяНакладнаяЗапасы.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРеглВидНалогаПФСотрудника,
	|	ВТРасходнаяНакладнаяЗапасы.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетУчетаРеглВидНалогаПФОрганизации,
	|	ВТРасходнаяНакладнаяЗапасы.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетУчетаКВозмещениюРеглВидНалогаПФОрганизации,
	|	ВТРасходнаяНакладнаяЗапасы.ВидУдержанияПФ.СчетЗатратРегл КАК СчетЗатратРеглПФ,
	|	ВТРасходнаяНакладнаяЗапасы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ВТРасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДСВалютаДокумента,
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	|	ВТРасходнаяНакладнаяЗапасы.Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	|	Значение(Документ.ЗаказПокупателя.ПустаяСсылка) как ЗаказПокупателя,  //Малышев 2024-11-25 ONESOFT-3602
	|	Неопределено как ДокументПоступления,  //Малышев 2024-11-19 ONESOFT-3602
	|	ВТРасходнаяНакладнаяЗапасы.ПровестиНалогПрибили,
	//Lazare_
	|	ВТРасходнаяНакладнаяЗапасы.СтруктурнаяЕдиницаЗапасы КАК  СтруктурнаяЕдиницаЗапасы,
	|	ВременнаяТаблицаШапка.ПоложениеСклада КАК ПоложениеСклада,
	|   ВТРасходнаяНакладнаяЗапасы.СуммаБезСкидки как СуммаБезСкидки
	//_Lazare
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	|	,ВТРасходнаяНакладнаяЗапасы.КоличествоСобрПотери КАК КоличествоСобрПотери
	|	,ВТРасходнаяНакладнаяЗапасы.СчетУчетаПотерь КАК СчетУчетаПотерь
	|	,ВТРасходнаяНакладнаяЗапасы.КоличествоСтарое КАК КоличествоСтарое
	|	,ВременнаяТаблицаШапка.ВидИспользоыванияБалов КАК ВидИспользоыванияБалов //+++ Дмгг
	|	,ВТРасходнаяНакладнаяЗапасы.СписаниеНаПотери КАК СписаниеНаПотери
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	//+Lazare
	|	,ВТРасходнаяНакладнаяЗапасы.Номенклатура.ВключенВрегистр КаК ВключенВрегистр
	//-Lazare
	|	,ВТРасходнаяНакладнаяЗапасы.БалыРасход КаК БалыРасход
	|	,ВТРасходнаяНакладнаяЗапасы.СуммаНДСБаллов КаК СуммаНДСБаллов
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	ВТРасходнаяНакладнаяЗапасы КАК ВТРасходнаяНакладнаяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
	|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
	|		ПО (КурсыРегВалюты.Валюта = &ВалютаНациональная),
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокумента
	|		ПО (СреднийКурсДокумента.Ссылка.ВалютаДокумента = ВТРасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента),
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	|	,Константа.СчетВыручкиВТабличнойЧасти КАК КонстантаСчетВыручкиВТабличнойЧасти
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	//+++ Дмгг
	|	,Константа.ФункциональнаяОпцияПередачаСырьяВПереработку КАК ФункциональнаяОпцияПередачаСырьяВПереработку
	//--- Дмгг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.ВидОперации КАК ВидОперации,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл КАК СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл КАК СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Ссылка.Организация КАК ОрганизацияВНУ,
	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ТаблицаДокумента.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Ссылка.Договор КАК Договор,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельностиПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс) КАК ТипРасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетовКуда,
	|	&Ссылка КАК ДокументКуда,
	|	ТаблицаДокумента.Ссылка.ДокументОснование КАК ДокументОснование,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Статья
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|			КОНЕЦ
	|	КОНЕЦ КАК Статья,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.Взаимозачет).Дата
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
	|	КОНЕЦ КАК ДокументДата,
	//|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаАванса,
	//|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютДокументаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютДокументаСрезПоследних.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 6))) КАК СуммаАванса,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютДокументаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютДокументаСрезПоследних.Кратность) КАК ЧИСЛО(15, 6))) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.ОперацияПоПлатежнымКартам)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЭквайринговаяОперация,
	|	ТаблицаДокумента.Документ.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	НАЧАЛОПЕРИОДА(ТаблицаДокумента.Документ.Дата, ДЕНЬ) КАК ДатаПлатежа,
	|	ТаблицаДокумента.Курс,
	|	ТаблицаДокумента.Кратность,
	|	ТаблицаДокумента.Ссылка.Договор.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс / ТаблицаДокумента.Кратность КАК ЧИСЛО(15, 6))) КАК СуммаРубПоКурсуАванса
	|ПОМЕСТИТЬ ВременнаяТаблицаПредоплата
	|ИЗ
	|	Документ.РасходнаяНакладная.Предоплата КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютДокументаСрезПоследних
	|		ПО (КурсыВалютДокументаСрезПоследних.Валюта = &ВалютаНакладной)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Ссылка.Договор,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Статья
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.Взаимозачет).Дата
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.ДокументОснование,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Документ.ЭквайринговыйТерминал,
	|	НАЧАЛОПЕРИОДА(ТаблицаДокумента.Документ.Дата, ДЕНЬ),
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.ОперацияПоПлатежнымКартам)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Курс,
	|	ТаблицаДокумента.Кратность,
	|	ТаблицаДокумента.Ссылка.Договор.РасчетыВУсловныхЕдиницах,
	|	ТаблицаДокумента.Ссылка.Организация,
	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС,
	|	ТаблицаДокумента.Ссылка.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяСкидкиНаценки.КлючСвязи,
	|	РасходнаяНакладнаяСкидкиНаценки.СкидкаНаценка,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасходнаяНакладнаяСкидкиНаценки.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА РасходнаяНакладнаяСкидкиНаценки.Сумма * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ РасходнаяНакладнаяСкидкиНаценки.Сумма * РасходнаяНакладнаяСкидкиНаценки.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * РасходнаяНакладнаяСкидкиНаценки.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	РасходнаяНакладнаяСкидкиНаценки.Ссылка.Дата КАК Период,
	|	РасходнаяНакладнаяСкидкиНаценки.Ссылка.СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВременнаяТаблицаАвтоСкидкиНаценки
	|ИЗ
	|	Документ.РасходнаяНакладная.СкидкиНаценки КАК РасходнаяНакладнаяСкидкиНаценки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаВалютаУчета.Значение
	|					ИЗ
	|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаНациональнаяВалюта.Значение
	|					ИЗ
	|						Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты
	|		ПО (ИСТИНА),
	|	Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта
	|ГДЕ
	|	РасходнаяНакладнаяСкидкиНаценки.Ссылка = &Ссылка
	|	И РасходнаяНакладнаяСкидкиНаценки.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяСерийныеНомера.КлючСвязи,
	|	РасходнаяНакладнаяСерийныеНомера.СерийныйНомер
	|ПОМЕСТИТЬ ВременнаяТаблицаСерийныеНомера
	|ИЗ
	|	Документ.РасходнаяНакладная.СерийныеНомера КАК РасходнаяНакладнаяСерийныеНомера
	|ГДЕ
	|	РасходнаяНакладнаяСерийныеНомера.Ссылка = &Ссылка
	|	И &ИспользоватьСерийныеНомера
	|	И НЕ РасходнаяНакладнаяСерийныеНомера.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад
	|
	|";
	
	//Малышев 2024-10-11 ONESOFT-3509
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|" + БаллыЛояльностьСкидки.ПолучитьТекстЗапросаИнициализации_РасходнаяНакладная();
	
	Возврат ТекстЗапроса;
	
КонецФункции


// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаРасходнаяНакладная, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь, ПроверятьИтогиРегистров = ЛОЖЬ) Экспорт
	
	Если ДокументСсылкаРасходнаяНакладная.СтруктурнаяЕдиница.КонтролироватьОстатки Тогда // Kuzmich, 11.01.2020
		Возврат;
	КонецЕсли;
	
	Если Константы.КонтролироватьОстаткиЗапасовНаСкладахПриПроведении.Получить() Тогда
		
		Результат = УправлениеНебольшойФирмойСервер.ЗапросОтрицательныхОстатковЗапасовНаСкладахПриПроведенииДокумента(ДокументСсылкаРасходнаяНакладная);
		
		Если НЕ Результат.Пустой() Тогда
			ДокументСсылкаРасходнаяНакладная_Объект = ДокументСсылкаРасходнаяНакладная.ПолучитьОбъект();
			ВыборкаИзРезультатаЗапроса = Результат.Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладах(ДокументСсылкаРасходнаяНакладная_Объект, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;			
		
	КонецЕсли;
	
	Если Не УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;
	
	// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
		Возврат;
	КонецЕсли;
	// Конец МобильноеПриложение
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияЗапасыИзменение", "ДвиженияЗапасыНаСкладахИзменение", 
	// "ДвиженияЗапасыКРасходуСоСкладовИзменение", "ДвиженияЗапасыПереданныеИзменение",
	// "ДвиженияЗапасыПринятыеИзменение", "ДвиженияРазмещениеЗаказовИзменение",
	// "ДвиженияПотребностьВЗапасахИзменение содержат записи, необходимо выполнить 
	// контроль реализации товаров.
	
	Если СтруктураВременныеТаблицы.ДвиженияЗапасыИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыНаСкладахИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыКРасходуСоСкладовИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыПереданныеИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыПринятыеИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗаказыПокупателейИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗаказыПоставщикамИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияПотребностьВЗапасахИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияРасчетыСПокупателямиИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияСерийныеНомераИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыВРазрезеГТДИзменение
		ИЛИ (Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() И СтруктураВременныеТаблицы.ДвиженияРезервированиеЗапасовИзменение) // Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =  
		//Малышев 2024-12-03 ONESOFT-3670 (--
		УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКонтроля_ОстаткиЗапасовНаСкладе(ДополнительныеСвойства)  //[0]
		//"ВЫБРАТЬ
		//|	ДвиженияЗапасыНаСкладахИзменение.НомерСтроки КАК НомерСтроки,
		//|	ДвиженияЗапасыНаСкладахИзменение.Организация КАК ОрганизацияПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК НоменклатураПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.Характеристика КАК ХарактеристикаПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.Партия КАК ПартияПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.Ячейка КАК ЯчейкаПредставление,
		//|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		//|	ЗапасыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		//|	ЕСТЬNULL(ДвиженияЗапасыНаСкладахИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыНаСкладах,
		//|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
		//|ИЗ
		//|	ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(&МоментКонтроля, ) КАК ЗапасыНаСкладахОстатки
		//|		ПО ДвиженияЗапасыНаСкладахИзменение.Организация = ЗапасыНаСкладахОстатки.Организация
		//|			И ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница = ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница
		//|			И ДвиженияЗапасыНаСкладахИзменение.Номенклатура = ЗапасыНаСкладахОстатки.Номенклатура
		//|			И ДвиженияЗапасыНаСкладахИзменение.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
		//|			И ДвиженияЗапасыНаСкладахИзменение.Партия = ЗапасыНаСкладахОстатки.Партия
		//|			И ДвиженияЗапасыНаСкладахИзменение.Ячейка = ЗапасыНаСкладахОстатки.Ячейка
		//|			И (ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) < 0)
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	НомерСтроки 
		//Малышев 2024-12-03 ONESOFT-3670 --)
		+ "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияЗапасыИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		|	ДвиженияЗапасыИзменение.СчетУчета КАК СчетУчетаПредставление,
		|	ДвиженияЗапасыИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияЗапасыИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ДвиженияЗапасыИзменение.Партия КАК ПартияПредставление,
		|	ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателяПредставление,
		|	ЗапасыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) КАК СуммаОстатокЗапасы
		|ИЗ
		|	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(&МоментКонтроля, ) КАК ЗапасыОстатки
		|		ПО ДвиженияЗапасыИзменение.Организация = ЗапасыОстатки.Организация
		|			И ДвиженияЗапасыИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
		|			И ДвиженияЗапасыИзменение.СчетУчета = ЗапасыОстатки.СчетУчета
		|			И ДвиженияЗапасыИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
		|			И ДвиженияЗапасыИзменение.Характеристика = ЗапасыОстатки.Характеристика
		|			И ДвиженияЗапасыИзменение.Партия = ЗапасыОстатки.Партия
		|			И ДвиженияЗапасыИзменение.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
		|			И (ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыПереданныеИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияЗапасыПереданныеИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияЗапасыПереданныеИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияЗапасыПереданныеИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ДвиженияЗапасыПереданныеИзменение.Партия КАК ПартияПредставление,
		|	ДвиженияЗапасыПереданныеИзменение.Контрагент КАК КонтрагентПредставление,
		|	ДвиженияЗапасыПереданныеИзменение.Договор КАК ДоговорПредставление,
		|	ДвиженияЗапасыПереданныеИзменение.Заказ КАК ЗаказПредставление,
		|	ДвиженияЗапасыПереданныеИзменение.ТипПриемаПередачи КАК ТипПриемаПередачиПредставление,
		|	ЗапасыПереданныеОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыПереданныеИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыПереданныеОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыПереданные,
		|	ЕСТЬNULL(ЗапасыПереданныеОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыПереданные,
		|	ЕСТЬNULL(ДвиженияЗапасыПереданныеИзменение.СуммаРасчетовИзменение, 0) + ЕСТЬNULL(ЗапасыПереданныеОстатки.СуммаРасчетовОстаток, 0) КАК СуммаРасчетовЗапасыПереданные,
		|	ЕСТЬNULL(ЗапасыПереданныеОстатки.СуммаРасчетовОстаток, 0) КАК СуммаРасчетовОстатокЗапасыПереданные
		|ИЗ
		|	ДвиженияЗапасыПереданныеИзменение КАК ДвиженияЗапасыПереданныеИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыПереданные.Остатки(&МоментКонтроля, ) КАК ЗапасыПереданныеОстатки
		|		ПО ДвиженияЗапасыПереданныеИзменение.Организация = ЗапасыПереданныеОстатки.Организация
		|			И ДвиженияЗапасыПереданныеИзменение.Номенклатура = ЗапасыПереданныеОстатки.Номенклатура
		|			И ДвиженияЗапасыПереданныеИзменение.Характеристика = ЗапасыПереданныеОстатки.Характеристика
		|			И ДвиженияЗапасыПереданныеИзменение.Партия = ЗапасыПереданныеОстатки.Партия
		|			И ДвиженияЗапасыПереданныеИзменение.Контрагент = ЗапасыПереданныеОстатки.Контрагент
		|			И ДвиженияЗапасыПереданныеИзменение.Договор = ЗапасыПереданныеОстатки.Договор
		|			И ДвиженияЗапасыПереданныеИзменение.Заказ = ЗапасыПереданныеОстатки.Заказ
		|			И ДвиженияЗапасыПереданныеИзменение.ТипПриемаПередачи = ЗапасыПереданныеОстатки.ТипПриемаПередачи
		|			И (ЕСТЬNULL(ЗапасыПереданныеОстатки.КоличествоОстаток, 0) < 0
		|				ИЛИ ЕСТЬNULL(ЗапасыПереданныеОстатки.СуммаРасчетовОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыПринятыеИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияЗапасыПринятыеИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияЗапасыПринятыеИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияЗапасыПринятыеИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ДвиженияЗапасыПринятыеИзменение.Партия КАК ПартияПредставление,
		|	ДвиженияЗапасыПринятыеИзменение.Контрагент КАК КонтрагентПредставление,
		|	ДвиженияЗапасыПринятыеИзменение.Договор КАК ДоговорПредставление,
		|	ДвиженияЗапасыПринятыеИзменение.Заказ КАК ЗаказПредставление,
		|	ДвиженияЗапасыПринятыеИзменение.ТипПриемаПередачи КАК ТипПриемаПередачиПредставление,
		|	ЗапасыПринятыеОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыПринятыеИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыПринятыеОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыПринятые,
		|	ЕСТЬNULL(ЗапасыПринятыеОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыПринятые,
		|	ЕСТЬNULL(ДвиженияЗапасыПринятыеИзменение.СуммаРасчетовИзменение, 0) + ЕСТЬNULL(ЗапасыПринятыеОстатки.СуммаРасчетовОстаток, 0) КАК СуммаРасчетовЗапасыПринятые,
		|	ЕСТЬNULL(ЗапасыПринятыеОстатки.СуммаРасчетовОстаток, 0) КАК СуммаРасчетовОстатокЗапасыПринятые
		|ИЗ
		|	ДвиженияЗапасыПринятыеИзменение КАК ДвиженияЗапасыПринятыеИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыПринятые.Остатки(&МоментКонтроля, ) КАК ЗапасыПринятыеОстатки
		|		ПО ДвиженияЗапасыПринятыеИзменение.Организация = ЗапасыПринятыеОстатки.Организация
		|			И ДвиженияЗапасыПринятыеИзменение.Номенклатура = ЗапасыПринятыеОстатки.Номенклатура
		|			И ДвиженияЗапасыПринятыеИзменение.Характеристика = ЗапасыПринятыеОстатки.Характеристика
		|			И ДвиженияЗапасыПринятыеИзменение.Партия = ЗапасыПринятыеОстатки.Партия
		|			И ДвиженияЗапасыПринятыеИзменение.Контрагент = ЗапасыПринятыеОстатки.Контрагент
		|			И ДвиженияЗапасыПринятыеИзменение.Договор = ЗапасыПринятыеОстатки.Договор
		|			И ДвиженияЗапасыПринятыеИзменение.Заказ = ЗапасыПринятыеОстатки.Заказ
		|			И ДвиженияЗапасыПринятыеИзменение.ТипПриемаПередачи = ЗапасыПринятыеОстатки.ТипПриемаПередачи
		|			И (ЕСТЬNULL(ЗапасыПринятыеОстатки.КоличествоОстаток, 0) < 0
		|				ИЛИ ЕСТЬNULL(ЗапасыПринятыеОстатки.СуммаРасчетовОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗаказыПокупателейИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияЗаказыПокупателейИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияЗаказыПокупателейИзменение.ЗаказПокупателя КАК ЗаказПредставление,
		|	ДвиженияЗаказыПокупателейИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияЗаказыПокупателейИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ЗаказыПокупателейОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗаказыПокупателейИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) КАК ОстатокЗаказыПокупателей,
		|	ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗаказыПокупателей
		|ИЗ
		|	ДвиженияЗаказыПокупателейИзменение КАК ДвиженияЗаказыПокупателейИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(&МоментКонтроля, ) КАК ЗаказыПокупателейОстатки
		|		ПО ДвиженияЗаказыПокупателейИзменение.Организация = ЗаказыПокупателейОстатки.Организация
		|			И ДвиженияЗаказыПокупателейИзменение.ЗаказПокупателя = ЗаказыПокупателейОстатки.ЗаказПокупателя
		|			И ДвиженияЗаказыПокупателейИзменение.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура
		|			И ДвиженияЗаказыПокупателейИзменение.Характеристика = ЗаказыПокупателейОстатки.Характеристика
		|			И (ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗаказыПоставщикамИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияЗаказыПоставщикамИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияЗаказыПоставщикамИзменение.ЗаказПоставщику КАК ЗаказПредставление,
		|	ДвиженияЗаказыПоставщикамИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияЗаказыПоставщикамИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ЗаказыПоставщикамОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗаказыПоставщикамИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0) КАК ОстатокЗаказыПоставщикам,
		|	ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗаказыПоставщикам
		|ИЗ
		|	ДвиженияЗаказыПоставщикамИзменение КАК ДвиженияЗаказыПоставщикамИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(&МоментКонтроля, ) КАК ЗаказыПоставщикамОстатки
		|		ПО ДвиженияЗаказыПоставщикамИзменение.Организация = ЗаказыПоставщикамОстатки.Организация
		|			И ДвиженияЗаказыПоставщикамИзменение.ЗаказПоставщику = ЗаказыПоставщикамОстатки.ЗаказПоставщику
		|			И ДвиженияЗаказыПоставщикамИзменение.Номенклатура = ЗаказыПоставщикамОстатки.Номенклатура
		|			И ДвиженияЗаказыПоставщикамИзменение.Характеристика = ЗаказыПоставщикамОстатки.Характеристика
		|			И (ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияПотребностьВЗапасахИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияПотребностьВЗапасахИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияПотребностьВЗапасахИзменение.ТипДвижения КАК ТипДвиженияПредставление,
		|	ДвиженияПотребностьВЗапасахИзменение.ЗаказПокупателя КАК ЗаказПокупателяПредставление,
		|	ДвиженияПотребностьВЗапасахИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияПотребностьВЗапасахИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ПотребностьВЗапасахОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияПотребностьВЗапасахИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ПотребностьВЗапасахОстатки.КоличествоОстаток, 0) КАК ОстатокПотребностьВЗапасах,
		|	ЕСТЬNULL(ПотребностьВЗапасахОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокПотребностьВЗапасах
		|ИЗ
		|	ДвиженияПотребностьВЗапасахИзменение КАК ДвиженияПотребностьВЗапасахИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПотребностьВЗапасах.Остатки(&МоментКонтроля, ) КАК ПотребностьВЗапасахОстатки
		|		ПО ДвиженияПотребностьВЗапасахИзменение.Организация = ПотребностьВЗапасахОстатки.Организация
		|			И ДвиженияПотребностьВЗапасахИзменение.ТипДвижения = ПотребностьВЗапасахОстатки.ТипДвижения
		|			И ДвиженияПотребностьВЗапасахИзменение.ЗаказПокупателя = ПотребностьВЗапасахОстатки.ЗаказПокупателя
		|			И ДвиженияПотребностьВЗапасахИзменение.Номенклатура = ПотребностьВЗапасахОстатки.Номенклатура
		|			И ДвиженияПотребностьВЗапасахИзменение.Характеристика = ПотребностьВЗапасахОстатки.Характеристика
		|			И (ЕСТЬNULL(ПотребностьВЗапасахОстатки.КоличествоОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияРасчетыСПокупателямиИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияРасчетыСПокупателямиИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияРасчетыСПокупателямиИзменение.Контрагент КАК КонтрагентПредставление,
		|	ДвиженияРасчетыСПокупателямиИзменение.Договор КАК ДоговорПредставление,
		|	ДвиженияРасчетыСПокупателямиИзменение.Договор.ВалютаРасчетов КАК ВалютаПредставление,
		|	ДвиженияРасчетыСПокупателямиИзменение.Документ КАК ДокументПредставление,
		|	ДвиженияРасчетыСПокупателямиИзменение.Заказ КАК ЗаказПредставление,
		|	ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов КАК ТипРасчетовПредставление,
		|	ЛОЖЬ КАК ДвиженияДенежныхДокументов,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПриЗаписи - ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаПолученныхАвансов,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаНепогашеннойЗадолженности,
		|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов КАК ТипРасчетов
		|ИЗ
		|	ДвиженияРасчетыСПокупателямиИзменение КАК ДвиженияРасчетыСПокупателямиИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПокупателями.Остатки(&МоментКонтроля, ) КАК РасчетыСПокупателямиОстатки
		|		ПО ДвиженияРасчетыСПокупателямиИзменение.Организация = РасчетыСПокупателямиОстатки.Организация
		|			И ДвиженияРасчетыСПокупателямиИзменение.Контрагент = РасчетыСПокупателямиОстатки.Контрагент
		|			И ДвиженияРасчетыСПокупателямиИзменение.Договор = РасчетыСПокупателямиОстатки.Договор
		|			И ДвиженияРасчетыСПокупателямиИзменение.Документ = РасчетыСПокупателямиОстатки.Документ
		|			И ДвиженияРасчетыСПокупателямиИзменение.Заказ = РасчетыСПокупателямиОстатки.Заказ
		|			И ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов = РасчетыСПокупателямиОстатки.ТипРасчетов
		|			И (ВЫБОР
		|				КОГДА ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|					ТОГДА ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) > 0
		|				ИНАЧЕ ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) < 0
		|			КОНЕЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияСерийныеНомераИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияСерийныеНомераИзменение.СерийныйНомер КАК СерийныйНомерПредставление,
		|	ДвиженияСерийныеНомераИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		|	ДвиженияСерийныеНомераИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияСерийныеНомераИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ДвиженияСерийныеНомераИзменение.Партия КАК ПартияПредставление,
		|	ДвиженияСерийныеНомераИзменение.Ячейка КАК ЯчейкаПредставление,
		|	СерийныеНомераОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	СерийныеНомераОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияСерийныеНомераИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(СерийныеНомераОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыНаСкладах,
		|	ЕСТЬNULL(СерийныеНомераОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
		|ИЗ
		|	ДвиженияСерийныеНомераИзменение КАК ДвиженияСерийныеНомераИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СерийныеНомера.Остатки(&МоментКонтроля, ) КАК СерийныеНомераОстатки
		|		ПО ДвиженияСерийныеНомераИзменение.СерийныйНомер = СерийныеНомераОстатки.СерийныйНомер
		|			И ДвиженияСерийныеНомераИзменение.СтруктурнаяЕдиница = СерийныеНомераОстатки.СтруктурнаяЕдиница
		|			И ДвиженияСерийныеНомераИзменение.Номенклатура = СерийныеНомераОстатки.Номенклатура
		|			И ДвиженияСерийныеНомераИзменение.Характеристика = СерийныеНомераОстатки.Характеристика
		|			И ДвиженияСерийныеНомераИзменение.Партия = СерийныеНомераОстатки.Партия
		|			И ДвиженияСерийныеНомераИзменение.Ячейка = СерийныеНомераОстатки.Ячейка
		|			И (ЕСТЬNULL(СерийныеНомераОстатки.КоличествоОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыВРазрезеГТДИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД) КАК НомерГТДПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика) КАК ХарактеристикаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Партия) КАК ПартияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения) КАК СтранаПроисхожденияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыВРазрезеГТДОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыВРазрезеГТДИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыВРазрезеГТД,
		|	ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыВРазрезеГТД
		|ИЗ
		|	ДвиженияЗапасыВРазрезеГТДИзменение КАК ДвиженияЗапасыВРазрезеГТДИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыВРазрезеГТД.Остатки(
		|				&МоментКонтроля,
		|				(Организация, НомерГТД, Номенклатура, Характеристика, Партия, СтранаПроисхождения) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД КАК НомерГТД,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения КАК СтранаПроисхождения
		|					ИЗ
		|						ДвиженияЗапасыВРазрезеГТДИзменение КАК ДвиженияЗапасыВРазрезеГТДИзменение)) КАК ЗапасыВРазрезеГТДОстатки
		|		ПО ДвиженияЗапасыВРазрезеГТДИзменение.Организация = ЗапасыВРазрезеГТДОстатки.Организация
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД = ЗапасыВРазрезеГТДОстатки.НомерГТД
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура = ЗапасыВРазрезеГТДОстатки.Номенклатура
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика = ЗапасыВРазрезеГТДОстатки.Характеристика
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Партия = ЗапасыВРазрезеГТДОстатки.Партия
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения = ЗапасыВРазрезеГТДОстатки.СтранаПроисхождения
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;";
		
		//Малышев 2024-06-17 ONESOFT-3094 (--
	    //+ УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКонтроля_ОстаткиЗапасов(ДополнительныеСвойства, Ложь); // МассивРезультатов[10]
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		Если Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() Тогда
			
			Запрос.Текст = Запрос.Текст + УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКонтроля_ОстаткиЗапасов(ДополнительныеСвойства, ИСТИНА); // МассивРезультатов[10]
			
			Если ПроверятьИтогиРегистров Тогда
				
				Запрос.Текст = Запрос.Текст + РезервированиеЗапасов_new.ПолучитьТекстЗапросаКонтроля_РезервированиеЗапасов(ДополнительныеСвойства, ЛОЖЬ); //[14]
			
			Иначе
				
				Запрос.Текст = Запрос.Текст + РезервированиеЗапасов_new.ПолучитьТекстЗапросаКонтроля_РезервированиеЗапасов(ДополнительныеСвойства, ИСТИНА) //[14]
				+ РезервированиеЗапасов_new.ПолучитьТекстЗапросаКонтроля_СвободныеОстатки(ДополнительныеСвойства); //[20] 
			
			КонецЕсли;			 
			
			Запрос.УстановитьПараметр("КонтролироватьОстаткиПриПроведенииПоПроектам",  ДополнительныеСвойства.УчетнаяПолитика.КонтролироватьОстаткиПриПроведенииПоПроектам);
			Запрос.УстановитьПараметр("МоментКонтроляРезерва", ДокументСсылкаРасходнаяНакладная.МоментВремени());
			
		Иначе
			
			Запрос.Текст = Запрос.Текст + УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКонтроля_ОстаткиЗапасов(ДополнительныеСвойства, Ложь); // МассивРезультатов[10]
			
		КонецЕсли;
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
	
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ДвиженияЗапасыИзменение.НомерСтроки КАК НомерСтроки,
		//|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Организация) КАК ОрганизацияПредставление,
		//|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
		//|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.СчетУчетаРегл) КАК СчетУчетаРеглПредставление,
		//|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Номенклатура) КАК НоменклатураПредставление,
		//|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Характеристика) КАК ХарактеристикаПредставление,
		//|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Партия) КАК ПартияПредставление,
		//|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.ЗаказПокупателя) КАК ЗаказПокупателяПредставление,
		//|	ЗапасыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		//|	ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		//|	ЕСТЬNULL(ДвиженияЗапасыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасы,
		//|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасы,
		//|	ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) КАК СуммаОстатокЗапасы
		//|ИЗ
		//|	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(&МоментКонтроля, ) КАК ЗапасыОстатки
		//|		ПО ДвиженияЗапасыИзменение.Организация = ЗапасыОстатки.Организация
		//|			И ДвиженияЗапасыИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
		//|			И ДвиженияЗапасыИзменение.СчетУчетаРегл = ЗапасыОстатки.СчетУчетаРегл
		//|			И ДвиженияЗапасыИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
		//|			И ДвиженияЗапасыИзменение.Характеристика = ЗапасыОстатки.Характеристика
		//|			И ДвиженияЗапасыИзменение.Партия = ЗапасыОстатки.Партия
		//|			И ДвиженияЗапасыИзменение.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
		//|			И (ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) < 0)
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	НомерСтроки"
		//Малышев 2024-06-17 ONESOFT-3094 --)
		; 
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Если НЕ ПроверятьИтогиРегистров Тогда 
			Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		Иначе 
			Запрос.УстановитьПараметр("МоментКонтроля", Дата(2999,12,31));
		КонецЕсли;
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Если НЕ МассивРезультатов[0].Пустой()
			ИЛИ НЕ МассивРезультатов[1].Пустой()
			ИЛИ НЕ МассивРезультатов[2].Пустой()
			ИЛИ НЕ МассивРезультатов[3].Пустой()
			ИЛИ НЕ МассивРезультатов[4].Пустой()
			ИЛИ НЕ МассивРезультатов[5].Пустой()
			ИЛИ НЕ МассивРезультатов[6].Пустой()
			ИЛИ НЕ МассивРезультатов[7].Пустой()
			ИЛИ НЕ МассивРезультатов[8].Пустой()
			ИЛИ НЕ МассивРезультатов[9].Пустой()
			ИЛИ НЕ МассивРезультатов[10].Пустой()
			// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
			ИЛИ (Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() И НЕ(МассивРезультатов[14].Пустой()))
			ИЛИ (Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() И НЕ(ПроверятьИтогиРегистров) И НЕ(МассивРезультатов[20].Пустой()))
			// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
			Тогда
			
			ДокументОбъектРасходнаяНакладная = ДокументСсылкаРасходнаяНакладная.ПолучитьОбъект()
			
		КонецЕсли;
		
		// Отрицательный остаток запасов на складе.
		Если НЕ МассивРезультатов[0].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[0].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладах(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладах(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток учета запасов.
		Если НЕ ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов Тогда //+++ Дмгг
			Если НЕ МассивРезультатов[1].Пустой() Тогда
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[1].Выбрать();
				Если НЕ ПроверятьИтогиРегистров Тогда 
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ);
				Иначе 
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
				КонецЕсли;
			КонецЕсли;
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		ИначеЕсли Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() И НЕ(МассивРезультатов[14].Пустой()) Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[14].Выбрать();
			Если НЕ(ПроверятьИтогиРегистров) Тогда 
				РезервированиеЗапасов_new.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ,,,1);
			Иначе 
				РезервированиеЗапасов_new.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ,,ИСТИНА,1);
			КонецЕсли;
		ИначеЕсли Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() И НЕ(ПроверятьИтогиРегистров) И НЕ(МассивРезультатов[20].Пустой()) Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[20].Выбрать();
			РезервированиеЗапасов_new.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ,,,2);
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		Иначе
			Если НЕ МассивРезультатов[10].Пустой() Тогда
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[10].Выбрать();
				Если НЕ ПроверятьИтогиРегистров Тогда 
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ);
				Иначе 
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток запасов переданных.
		Если НЕ МассивРезультатов[2].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[2].Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыПереданные(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ);
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыПереданные(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыПереданные(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток запасов принятых.
		Если НЕ МассивРезультатов[3].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[3].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыПринятые(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыПринятые(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток по заказу покупателя.
		Если НЕ МассивРезультатов[4].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[4].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗаказыПокупателей(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗаказыПокупателей(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток по заказу поставщику.
		Если НЕ МассивРезультатов[5].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[5].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗаказыПоставщикам(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗаказыПоставщикам(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток потребности в запасах.
		Если НЕ МассивРезультатов[6].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[6].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструПотребностьВЗапасах(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструПотребностьВЗапасах(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток по расчетам с покупателями.
		Если НЕ МассивРезультатов[7].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[7].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПокупателями(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПокупателями(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток по серийным номерам.
		Если НЕ МассивРезультатов[8].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[8].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструСерийныеНомера(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструСерийныеНомера(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток по остаткам запасов в разрезе номеров ГТД.
		Если Константы.КонтролироватьОстаткиПоНомерамГТД.Получить()
			И НЕ МассивРезультатов[9].Пустой() Тогда
			
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[9].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыВРазрезеГТД(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыВРазрезеГТД(ДокументОбъектРасходнаяНакладная, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтроль()

Функция ПолучитьТекстЗапросаСтандартный() //+++ Дмгг

	Возврат "ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	ЗапасыОстатки.СчетУчетаРегл
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОстатки.Организация КАК Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|		ЗапасыОстатки.Характеристика КАК Характеристика,
	|		ЗапасыОстатки.Партия КАК Партия,
	|		ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|		ЗапасыОстатки.СуммаОстаток КАК СуммаОстаток,
	|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				&МоментКонтроля,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|				(Организация, СтруктурнаяЕдиница, СчетУчета, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|					(ВЫБРАТЬ
	|						ТаблицаЗапасы.Организация КАК Организация,
	|						ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|						ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|						ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|						ТаблицаЗапасы.Характеристика КАК Характеристика,
	|						ТаблицаЗапасы.Партия КАК Партия,
	|						ВЫБОР
	|							КОГДА ТаблицаЗапасы.Заказ <> НЕОПРЕДЕЛЕНО
	|								ТОГДА ВЫБОР
	|										КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|											ТОГДА ТаблицаЗапасы.Заказ
	|										КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|												И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|											ТОГДА ТаблицаЗапасы.Заказ.ЗаказПокупателя
	|										ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|									КОНЕЦ
	|							ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|						КОНЕЦ КАК ЗаказПокупателя
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|					ГДЕ
	|						ВЫБОР
	|							КОГДА ТаблицаЗапасы.Заказ <> НЕОПРЕДЕЛЕНО
	|								ТОГДА ВЫБОР
	|										КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|											ТОГДА ТаблицаЗапасы.Заказ
	|										КОГДА ТаблицаЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|												И ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|											ТОГДА ТаблицаЗапасы.Заказ.ЗаказПокупателя
	|										ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|									КОНЕЦ
	|							ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|						КОНЕЦ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				
	|					ОБЪЕДИНИТЬ ВСЕ
	|				
	|					ВЫБРАТЬ
	|						ТаблицаЗапасы.Организация,
	|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.СчетУчета,
	|						ТаблицаЗапасы.СчетУчетаРегл, //+++ Дмгг
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета,
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия,
	|	ЗапасыОстатки.ЗаказПокупателя,
	|	ЗапасыОстатки.СчетУчетаРегл";	

КонецФункции // ПолучитьТекстЗапросаСтандартный()

Функция ПолучитьТекстЗапросаБезФильтрЗаказов() //+++ Дмгг

	Возврат "ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Проект КАК Проект, //Малышев 2024-06-04 ONESOFT-3093
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	ЛОЖЬ КАК Резервирование,
	|	ЗапасыОстатки.СчетУчетаРегл
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОстатки.Организация КАК Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|		ЗапасыОстатки.Характеристика КАК Характеристика,
	|		ЗапасыОстатки.Проект КАК Проект, //Малышев 2024-06-04 ONESOFT-3093
	|		ЗапасыОстатки.Партия КАК Партия,
	|		ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|		ЗапасыОстатки.СуммаОстаток КАК СуммаОстаток,
	|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				&МоментКонтроля,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчета, СчетУчетаРегл, Номенклатура, Характеристика, Партия) В 
	//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия) В
	|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Проект, Партия) В //Малышев 2024-06-04 ONESOFT-3093
	|					(ВЫБРАТЬ
	|						ТаблицаЗапасы.Организация КАК Организация,
	|						ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|						ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|						ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|						ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|						ТаблицаЗапасы.Характеристика КАК Характеристика,
	|						ТаблицаЗапасы.Проект КАК Проект, //Малышев 2024-06-04 ONESOFT-3093
	|						ТаблицаЗапасы.Партия КАК Партия
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|				
	|					ОБЪЕДИНИТЬ ВСЕ
	|				
	|					ВЫБРАТЬ
	|						ТаблицаЗапасы.Организация,
	|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	//|						ТаблицаЗапасы.СчетУчета,
	|						ТаблицаЗапасы.СчетУчетаРегл, //+++ Дмгг
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Проект,   //Малышев 2024-06-04 ONESOFT-3093
	|						ТаблицаЗапасы.Партия
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	//|	ЗапасыОстатки.СчетУчета,
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Проект, //Малышев 2024-06-04 ONESOFT-3093
	|	ЗапасыОстатки.Партия,
	|	ЗапасыОстатки.ЗаказПокупателя,
	|	ЗапасыОстатки.СчетУчетаРегл";	

КонецФункции // ПолучитьТекстЗапросаБезФильтрЗаказов()

#КонецОбласти

#Область ДействияПриОбменеГИСМ

Функция ОбновитьСтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, Операция) Экспорт
	
	НовыйСтатус        = Неопределено;
	ДальнейшееДействие = Неопределено;
	
	ИспользоватьАвтоматическийОбмен = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическуюОтправкуПолучениеДанныхГИСМ");
	
	Если Операция = Перечисления.ОперацииОбменаГИСМ.ПередачаДанных Тогда
		НовыйСтатус = Перечисления.СтатусыИнформированияГИСМ.КПередаче;
		Если ИспользоватьАвтоматическийОбмен Тогда
			ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ОжидайтеПередачуДанныхРегламентнымЗаданием;
		Иначе
			ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ВыполнитеОбмен;
		КонецЕсли;
	КонецЕсли;
	
	Если НовыйСтатус = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РегистрыСведений.СтатусыИнформированияГИСМ.ОбновитьСтатус(
		ДокументСсылка,
		НовыйСтатус,
		ДальнейшееДействие);
	
	Возврат НовыйСтатус;
	
КонецФункции

Функция ОбновитьСтатусПослеПередачиДанных(ДокументСсылка, Операция, СтатусОбработки) Экспорт
	
	НовыйСтатус     = Неопределено;
	ДальнейшееДействие = Неопределено;
	
	Если Операция = Перечисления.ОперацииОбменаГИСМ.ПередачаДанных Тогда
		
		Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийГИСМ.Принято Тогда
			
			НовыйСтатус = Перечисления.СтатусыИнформированияГИСМ.Передано;
			ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ОжидайтеПолучениеКвитанцииОФиксации;
			
		ИначеЕсли СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийГИСМ.Отклонено
			ИЛИ СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийГИСМ.Ошибка Тогда
			
			НовыйСтатус = Перечисления.СтатусыИнформированияГИСМ.ОтклоненоГИСМ;
			ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПередайтеДанные;
			
		КонецЕсли;
		
	ИначеЕсли Операция = Перечисления.ОперацииОбменаГИСМ.ПередачаДанныхПолучениеКвитанции Тогда
		
		Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийГИСМ.Принято Тогда
			
			НовыйСтатус = Перечисления.СтатусыИнформированияГИСМ.ПринятоГИСМ;
			ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.НеТребуется;
			
		ИначеЕсли СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийГИСМ.Отклонено
			ИЛИ СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийГИСМ.Ошибка Тогда
			
			НовыйСтатус = Перечисления.СтатусыИнформированияГИСМ.ОтклоненоГИСМ;
			ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПередайтеДанные;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НовыйСтатус = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РегистрыСведений.СтатусыИнформированияГИСМ.ОбновитьСтатус(ДокументСсылка, НовыйСтатус, ДальнейшееДействие);
	
	Возврат НовыйСтатус;
	
КонецФункции

#КонецОбласти

#Область СообщенияГИСМ

Функция СообщениеКПередачеXML(ДокументСсылка, Операция) Экспорт
	
	Если Операция = Перечисления.ОперацииОбменаГИСМ.ПередачаДанных Тогда
		Возврат ОтчетОРозничныхПродажахXML(ДокументСсылка);
	ИначеЕсли Операция = Перечисления.ОперацииОбменаГИСМ.ПередачаДанныхПолучениеКвитанции Тогда
		Возврат ИнтеграцияГИСМВызовСервера.ЗапросКвитанцииОФиксацииПоСсылкеXML(ДокументСсылка, Перечисления.ОперацииОбменаГИСМ.ПередачаДанных);
	КонецЕсли;
	
КонецФункции

Функция ОтчетОРозничныхПродажахXML(ДокументСсылка) Экспорт
	
	Если ИнтеграцияГИСМ.ИспользоватьВозможностиВерсии("2.41") Тогда
		Возврат ОтчетОРозничныхПродажахXML2_41(ДокументСсылка);
	Иначе
		ВызватьИсключение НСтр("ka='Формат 2.40 для расходной накладной в розницу не поддерживается';ru='Формат 2.40 для расходной накладной в розницу не поддерживается';en='2.40 format for the expenditure invoice at retail is not supported'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Версия2_41

Функция ОтчетОРозничныхПродажахXML2_41(ДокументСсылка) Экспорт
	
	СообщенияXML = Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ГИСМПрисоединенныеФайлы.ВладелецФайла КАК Ссылка,
	|	КОЛИЧЕСТВО(ГИСМПрисоединенныеФайлы.Ссылка) КАК ПоследнийНомерВерсии
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Справочник.ГИСМПрисоединенныеФайлы КАК ГИСМПрисоединенныеФайлы
	|ГДЕ
	|	ГИСМПрисоединенныеФайлы.ВладелецФайла = &Ссылка
	|	И ГИСМПрисоединенныеФайлы.Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииОбменаГИСМ.ПередачаДанных)
	|	И ГИСМПрисоединенныеФайлы.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщенийГИСМ.Исходящее)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГИСМПрисоединенныеФайлы.ВладелецФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладная.Дата КАК Дата,
	|	ЕСТЬNULL(ВременнаяТаблица.ПоследнийНомерВерсии, 0) КАК ПоследнийНомерВерсии,
	|	РасходнаяНакладная.Организация КАК Организация,
	|	РасходнаяНакладная.Номер
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
	|		ПО РасходнаяНакладная.Ссылка = ВременнаяТаблица.Ссылка
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки,
	|	ВЫБОР
	|		КОГДА Товары.Количество <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ Товары.Ссылка.СуммаВключаетНДС
	|						ТОГДА ВЫРАЗИТЬ((Товары.Сумма + Товары.СуммаНДС) / Товары.Количество КАК ЧИСЛО(15, 2))
	|					ИНАЧЕ ВЫРАЗИТЬ(Товары.Сумма / Товары.Количество КАК ЧИСЛО(15, 2))
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Стоимость,
	|	Серии.СерийныйНомер.НомерКиЗГИСМ КАК НомерКиЗ,
	|	Товары.СуммаНДС
	|ИЗ
	|	Документ.РасходнаяНакладная.СерийныеНомера КАК Серии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Запасы КАК Товары
	|		ПО (Товары.Ссылка = Серии.Ссылка)
	|			И (Товары.КлючСвязи = Серии.КлючСвязи)
	|ГДЕ
	|	Серии.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Результат = Запрос.ВыполнитьПакет();
	Шапка = Результат[1].Выбрать();
	Товары = Результат[2].Выгрузить();
	Если Не Шапка.Следующий()
		Или Товары.Количество() = 0 Тогда
		
		СообщениеXML = ИнтеграцияГИСМКлиентСервер.СтруктураСообщенияXML();
		СообщениеXML.Документ = ДокументСсылка;
		СообщениеXML.Описание = ИнтеграцияГИСМ.ОписаниеОперацииПередачиДанных(
			Перечисления.ОперацииОбменаГИСМ.ПередачаДанныхРозничнаяПродажа, ДокументСсылка);
		СообщениеXML.ТекстОшибки = НСтр("ka='გადმოსატვირთად მონაცემები არ არის.';ru='Нет данных для выгрузки.';en='There is no data to upload.'");
		СообщенияXML.Добавить(СообщениеXML);
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	НомерВерсии = Шапка.ПоследнийНомерВерсии + 1;
	
	РеквизитыОгранизации = ИнтеграцияГИСМВызовСервера.ИННКППGLNОрганизации(Шапка.Организация, Неопределено);
	
	СообщениеXML = ИнтеграцияГИСМКлиентСервер.СтруктураСообщенияXML();
	СообщениеXML.Описание = ИнтеграцияГИСМ.ОписаниеОперацииПередачиДанных(
		Перечисления.ОперацииОбменаГИСМ.ПередачаДанныхРозничнаяПродажа, ДокументСсылка, НомерВерсии);
	
	ИмяТипа   = "query";
	ИмяПакета = "retail_sale";
	
	ПередачаДанных = ИнтеграцияГИСМ.ОбъектXDTOПоИмениСвойства(Неопределено, ИмяТипа);
	
	ОтчетОРозничныхПродажах = ИнтеграцияГИСМ.ОбъектXDTO(ИмяПакета);
	ОтчетОРозничныхПродажах.action_id  = ОтчетОРозничныхПродажах.action_id;
	
	Попытка
		ОтчетОРозничныхПродажах.sender_gln = РеквизитыОгранизации.GLN;
	Исключение
		ИнтеграцияГИСМКлиентСервер.ДобавитьТекстОшибкиНеЗаполненGLNОрганизации(СообщениеXML, РеквизитыОгранизации.GLN, Шапка.Организация);
	КонецПопытки;
	
	ОтчетОРозничныхПродажах.sales = ИнтеграцияГИСМ.ОбъектXDTOПоИмениСвойства(ОтчетОРозничныхПродажах, "sales");
	
	ХранилищеВременныхДат = Новый Соответствие;
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		
		НоваяСтрока = ИнтеграцияГИСМ.ОбъектXDTOПоИмениСвойства(ОтчетОРозничныхПродажах.sales, "detail");
		
		НоваяСтрока.sign_num   = СтрокаТЧ.НомерКиЗ;
		НоваяСтрока.cost       = СтрокаТЧ.Стоимость;
		Если ЗначениеЗаполнено(СтрокаТЧ.СуммаНДС) Тогда
			НоваяСтрока.vat_value = СтрокаТЧ.СуммаНДС;
		КонецЕсли;
		НоваяСтрока.sale_time  = Шапка.Дата;
		
		НоваяСтрока.sale_docs = ИнтеграцияГИСМ.ОбъектXDTOПоИмениСвойства(НоваяСтрока, "sale_docs");
		doc = ИнтеграцияГИСМ.ОбъектXDTOПоИмениСвойства(НоваяСтрока.sale_docs, "doc");
		doc.doc_type   = 1;
		doc.doc_name   = НСтр("ka='ჩეკი';ru='Чек';en='Check'");
		doc.doc_number = НСтр("ka='б/н';ru='б/н';en='b / n'");
		doc.doc_date   = Шапка.Дата;
		НоваяСтрока.sale_docs.doc.Добавить(doc);
		
		ОтчетОРозничныхПродажах.sales.detail.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	ПередачаДанных.version    = ПередачаДанных.version;
	ПередачаДанных[ИмяПакета] = ОтчетОРозничныхПродажах;
	
	ТекстСообщенияXML = ИнтеграцияГИСМ.ОбъектXDTOВXML(ПередачаДанных, ИмяТипа);
	ТекстСообщенияXML = ИнтеграцияГИСМ.ПреобразоватьВременныеДаты(ХранилищеВременныхДат, ТекстСообщенияXML);
	
	СообщениеXML.ТекстСообщенияXML  = ТекстСообщенияXML;
	СообщениеXML.КонвертSOAP = ИнтеграцияГИСМВызовСервера.ПоместитьТекстСообщенияXMLВКонвертSOAP(ТекстСообщенияXML);
	
	СообщениеXML.ТипСообщения = Перечисления.ТипыСообщенийГИСМ.Исходящее;
	СообщениеXML.Организация  = Шапка.Организация;
	СообщениеXML.Операция     = Перечисления.ОперацииОбменаГИСМ.ПередачаДанных;
	СообщениеXML.Документ     = ДокументСсылка;
	СообщениеXML.Версия       = НомерВерсии;
	
	СообщенияXML.Добавить(СообщениеXML);
	
	Возврат СообщенияXML;
	
КонецФункции

#КонецОбласти

#Область Доставка

// Добавляет во временную таблицу все позиции таблицы "Запасы",
// в т.ч. позицию услуги доставки
//
// Параметры:
//  РасходнаяНакладная                  - ДокументСсылка.РасходнаяНакладная, Массив
// 
// Возвращаемое значение:
//   - МенеджерВременныхТаблиц
//
Функция ВТРасходнаяНакладнаяЗапасы(Знач РасходнаяНакладная) Экспорт
	
	Если ТипЗнч(РасходнаяНакладная) <> Тип("Массив") Тогда
		РасходнаяНакладная = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РасходнаяНакладная);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.Ссылка КАК Ссылка,
	|	РасходнаяНакладнаяЗапасы.Заказ КАК Заказ,
	|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС,
	
	//Малышев 2024-10-15 ONESOFT-3508
	//|	РасходнаяНакладнаяЗапасы.Всего
	|	РасходнаяНакладнаяЗапасы.Всего - РасходнаяНакладнаяЗапасы.БалыРасход как Всего,
	//Малышев 2024-10-15 ONESOFT-3508

	|	РасходнаяНакладнаяЗапасы.БалыРасход КАК БалыРасход,
	|	РасходнаяНакладнаяЗапасы.СуммаНДСБаллов КАК СуммаНДСБаллов,
	|	РасходнаяНакладнаяЗапасы.СуммаНДСЛояльности КАК СуммаНДСЛояльности,
	|	РасходнаяНакладнаяЗапасы.СуммаНДСНакопленныхБаллов КАК СуммаНДСНакопленныхБаллов,
	|	РасходнаяНакладнаяЗапасы.КоличествоНакопленныхБаллов КАК КоличествоНакопленныхБаллов
	|ПОМЕСТИТЬ ВТРасходнаяНакладнаяЗапасы
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка В(&РасходнаяНакладная)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка,
	|	РасходнаяНакладная.Заказ,
	|	РасходнаяНакладная.НоменклатураДоставки,
	|	РасходнаяНакладная.СтавкаНДСДоставки,
	|	РасходнаяНакладная.СуммаНДСДоставки,
	|	РасходнаяНакладная.СтоимостьДоставки,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка В(&РасходнаяНакладная)
	|	И РасходнаяНакладная.НоменклатураДоставки <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)");
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("РасходнаяНакладная", РасходнаяНакладная);
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

#КонецОбласти

#Область ИнтерфейсПечати

Процедура УчестьОсобенностиФормированияСчетаОплату(ДанныеОбъектовПечати)
	
	Для каждого ОбъектПечати Из ДанныеОбъектовПечати Цикл
		
		Если ОбъектПечати.НомерСчетаНаОплату = Перечисления.НомераСчетаВРасходнойНакладной.ЗаказПокупателя Тогда
			
			Если ОбъектПечати.ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
				
				Если ЗначениеЗаполнено(ОбъектПечати.Заказ)
					И ТипЗнч(ОбъектПечати.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
					
					ОбъектПечати.Номер = ОбъектПечати.Заказ.Номер;
					
				КонецЕсли;
				
			Иначе
				
				Для каждого СтрокаТабличногоДокумента Из ОбъектПечати.ТаблицаЗапасы Цикл
					
					Если ЗначениеЗаполнено(СтрокаТабличногоДокумента.Заказ)
						И ТипЗнч(СтрокаТабличногоДокумента.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
						
						ОбъектПечати.Номер = СтрокаТабличногоДокумента.Заказ.Номер;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		ИначеЕсли ОбъектПечати.НомерСчетаНаОплату = Перечисления.НомераСчетаВРасходнойНакладной.СчетНаОплату
			И ТипЗнч(ОбъектПечати.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплату") Тогда
			
			ОбъектПечати.Номер = ОбъектПечати.ДокументОснование.Номер;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов, ИспользоватьФаксимиле = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ИспользоватьФаксимиле", ИспользоватьФаксимиле);
	
	Запрос.Текст = 
	"
	//:::Шапка
	|Выбрать
	|	РасходнаяНакладная.Ссылка КАК Ссылка
	|	,""Расходная накладная"" КАК ПредставлениеРегистратора
	|	,РасходнаяНакладная.Дата КАК ДатаДокумента
	|	,РасходнаяНакладная.Номер КАК Номер
	|	,РасходнаяНакладная.НомерСчетаНаОплату КАК НомерСчетаНаОплату
	|	,РасходнаяНакладная.ПоложениеЗаказаПокупателя КАК ПоложениеЗаказаПокупателя
	|	,РасходнаяНакладная.Организация КАК Организация
	|	,РасходнаяНакладная.Организация.Префикс КАК Префикс
	|	,РасходнаяНакладная.Организация.ФайлЛоготип КАК ФайлЛоготип
	|	,РасходнаяНакладная.Организация.ФайлФаксимильнаяПечать КАК ФаксимилеПечати
	|	,Выбор когда &ИспользоватьФаксимиле
	|		Тогда Значение(Перечисление.ДаНет.Да)
	|		Иначе Значение(Перечисление.ДаНет.Нет) Конец КАК ИспользоватьФаксимиле
	|	,РасходнаяНакладная.СтруктурнаяЕдиница КАК ПредставлениеСклада
	|	,РасходнаяНакладная.Ячейка КАК ПредставлениеЯчейки
	|	,РасходнаяНакладная.ПодписьРуководителя.Должность КАК ДолжностьРуководителя
	|	,РасходнаяНакладная.ПодписьРуководителя.РасшифровкаПодписи КАК РасшифровкаПодписиРуководителя
	|	,РасходнаяНакладная.ПодписьРуководителя.РасшифровкаПодписи КАК РасшифровкаПодписиВыполнилРаботыУслуги
	|	,РасходнаяНакладная.ПодписьРуководителя.Факсимиле КАК ФаксимилеРуководителя
	|	,РасходнаяНакладная.ПодписьГлавногоБухгалтера.Должность КАК ДолжностьГлавногоБухгалтера
	|	,РасходнаяНакладная.ПодписьГлавногоБухгалтера.РасшифровкаПодписи КАК РасшифровкаПодписиГлавногоБухгалтера
	|	,РасходнаяНакладная.ПодписьГлавногоБухгалтера.Факсимиле КАК ФаксимилеГлавногоБухгалтера
	|	,РасходнаяНакладная.БанковскийСчет КАК БанковскийСчет
	|	,РасходнаяНакладная.СуммаВключаетНДС КАК СуммаВключаетНДС
	|	,РасходнаяНакладная.ВалютаДокумента КАК ВалютаДокумента
	|	,РасходнаяНакладная.Контрагент КАК Контрагент
	|	,РасходнаяНакладная.КонтактноеЛицоПодписант.Наименование КАК РасшифровкаПодписиКонтрагента
	|	,РасходнаяНакладная.КонтактноеЛицоПодписант.Наименование КАК РасшифровкаПодписиПринялРаботыУслуги
	|	,РасходнаяНакладная.Договор
	|	,РасходнаяНакладная.УсловияСчетаЗаказа КАК ДополнительныеУсловия
	|	,РасходнаяНакладная.ДокументОснование
	|	,РасходнаяНакладная.Ответственный
	|	,РасходнаяНакладная.Автор
	|	,РасходнаяНакладная.ДисконтнаяКарта
	|	,РасходнаяНакладная.ПроцентСкидкиПоДисконтнойКарте
	|	,РасходнаяНакладная.Комментарий КАК Комментарий
	|	,РасходнаяНакладная.ОснованиеПечати КАК ОснованиеПечати
	|	,РасходнаяНакладная.ОснованиеПечатиСсылка КАК ОснованиеПечатиСсылка
	|	,РасходнаяНакладная.Заказ
	|	,ЛОЖЬ КАК ОжидаетсяВыборВариантаКП
	|	,РасходнаяНакладная.Вес
	|	,РасходнаяНакладная.Объем
	|	,РасходнаяНакладная.НоменклатураДоставки
	|	,Выбор когда (Выразить(РасходнаяНакладная.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|		Тогда РасходнаяНакладная.НоменклатураДоставки.Наименование
	|		Иначе Выразить(РасходнаяНакладная.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000)) Конец КАК ПредставлениеНоменклатурыДоставки
	|	,РасходнаяНакладная.НоменклатураДоставки.Артикул КАК АртикулДоставки
	|	,РасходнаяНакладная.НоменклатураДоставки.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДоставки
	|	,РасходнаяНакладная.СтоимостьДоставки
	|	,РасходнаяНакладная.СуммаНДСДоставки
	|
	//:::Табличная часть "Запасы"
	|	,РасходнаяНакладная.Запасы.(
	|		НомерСтроки КАК НомерСтроки
	|		,Выбор когда(Выразить(РасходнаяНакладная.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			Тогда РасходнаяНакладная.Запасы.Номенклатура.Наименование
	|			Иначе Выразить(РасходнаяНакладная.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) Конец КАК ПредставлениеНоменклатуры
	|		,Характеристика
	|		,Номенклатура.Артикул КАК Артикул
	|		,Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
	|		,Номенклатура.Склад КАК Склад
	|		,Номенклатура.Ячейка КАК Ячейка
	|		,ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|		,Цена КАК Цена
	|		,Сумма КАК Сумма
	|		,СуммаНДС КАК СуммаНДС
	|		,Всего КАК Всего
	|		,Количество КАК Количество
	|		,Вес КАК Вес
	|		,Объем КАК Объем
	|		,Содержание
	|		,ПроцентСкидкиНаценки
	|		,Выбор когда РасходнаяНакладная.Запасы.ПроцентСкидкиНаценки <> 0
	|				ИЛИ РасходнаяНакладная.Запасы.СуммаАвтоматическойСкидки <> 0
	|			Тогда 1
	|			Иначе 0 Конец КАК ЕстьСкидка
	|		,СуммаАвтоматическойСкидки
	|		,Заказ
	|		,КлючСвязи
	|		,Ложь КАК ЭтоРазделитель
	|	) КАК ТаблицаЗапасы
	|
	//:::Табличная часть "СерийныеНомера"
	|	,РасходнаяНакладная.СерийныеНомера.(
	|		СерийныйНомер
	|		,КлючСвязи
	|	) КАК ТаблицаСерийныеНомера
	|Из Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|Где РасходнаяНакладная.Ссылка В(&МассивОбъектов)
	|Упорядочить по Ссылка, НомерСтроки";
	
	ДанныеДокументов = Запрос.Выполнить().Выгрузить();
	ДоставкаСервер.ДобавитьСтрокуДоставкиУниверсальныеДанные(ДанныеДокументов);
	Возврат ДанныеДокументов;
	
КонецФункции

Функция ДанныеДокументовАктОбОказанииУслуг(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК Ссылка
	|	,РасходнаяНакладная.Номер КАК Номер
	|	,РасходнаяНакладная.Дата КАК ДатаДокумента
	|	,РасходнаяНакладная.Организация КАК Организация
	|	,РасходнаяНакладная.Организация.Префикс КАК Префикс
	|	,РасходнаяНакладная.Организация.ФайлЛоготип КАК ФайлЛоготип
	|	,РасходнаяНакладная.Контрагент КАК Контрагент
	|	,РасходнаяНакладная.ПодписьРуководителя.РасшифровкаПодписи КАК РасшифровкаПодписиВыполнилРаботыУслуги
	|	,РасходнаяНакладная.КонтактноеЛицоПодписант.Наименование КАК РасшифровкаПодписиПринялРаботыУслуги
	|	,РасходнаяНакладная.СуммаВключаетНДС КАК СуммаВключаетНДС
	|	,РасходнаяНакладная.ВалютаДокумента КАК ВалютаДокумента
	|	,РасходнаяНакладная.ОснованиеПечати
	|	,РасходнаяНакладная.ОснованиеПечатиСсылка
	|	,РасходнаяНакладная.Комментарий
	|	,РасходнаяНакладная.НоменклатураДоставки
	|	,Выбор когда (Выразить(РасходнаяНакладная.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|		Тогда РасходнаяНакладная.НоменклатураДоставки.Наименование
	|		Иначе ВЫРАЗИТЬ(РасходнаяНакладная.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000)) Конец КАК ПредставлениеНоменклатурыДоставки
	|	,РасходнаяНакладная.НоменклатураДоставки.Артикул КАК АртикулДоставки
	|	,РасходнаяНакладная.НоменклатураДоставки.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДоставки
	|	,РасходнаяНакладная.СтоимостьДоставки
	|	,РасходнаяНакладная.СуммаНДСДоставки
	|	,РасходнаяНакладная.Запасы.(
	|		НомерСтроки КАК НомерСтроки
	|		,Содержание
	|		,Выбор когда(Выразить(РасходнаяНакладная.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			Тогда РасходнаяНакладная.Запасы.Номенклатура.Наименование
	|			Иначе Выразить(РасходнаяНакладная.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) Конец КАК ПредставлениеНоменклатуры
	|		,Номенклатура.Артикул КАК Артикул
	|		,Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
	|		,ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения
	|		,Количество КАК Количество
	|		,Цена КАК Цена
	|		,Сумма КАК Сумма
	|		,СуммаНДС КАК СуммаНДС
	|		,Всего КАК Всего
	|		,Характеристика
	|		,ПроцентСкидкиНаценки
	|		,Выбор когда РасходнаяНакладная.Запасы.ПроцентСкидкиНаценки <> 0
	|					ИЛИ РасходнаяНакладная.Запасы.СуммаАвтоматическойСкидки <> 0
	|			Тогда 1
	|			Иначе 0 Конец КАК ЕстьСкидка
	|		,СуммаАвтоматическойСкидки
	|	) КАК ТаблицаРаботыУслуги
	|Из Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|Где РасходнаяНакладная.Ссылка В(&МассивОбъектов)
	|Упорядочить по Ссылка, НомерСтроки";
	
	ДеревоУслуг = Запрос.Выполнить().Выгрузить();
	
	ДоставкаСервер.ДобавитьСтрокуДоставкиАктОбОказанииУслуг(ДеревоУслуг);
	
	Возврат ДеревоУслуг;
	
КонецФункции

Функция ДанныеДокументовТОРГ12(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("НациональнаяВалюта", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("ШтукаНаименование", Справочники.КлассификаторЕдиницИзмерения.шт.Наименование);
	Запрос.УстановитьПараметр("ШтукаКод", Справочники.КлассификаторЕдиницИзмерения.шт.Код);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК Ссылка,
	|	РасходнаяНакладная.Дата КАК ДатаДокумента,
	|	РасходнаяНакладная.Номер КАК Номер,
	|	РасходнаяНакладная.Организация КАК Организация,
	|	РасходнаяНакладная.Организация.Префикс КАК Префикс,
	|	РасходнаяНакладная.БанковскийСчет КАК БанковскийСчет,
	|	ПРЕДСТАВЛЕНИЕ(РасходнаяНакладная.Подразделение) КАК ПредставлениеПодразделения,
	|	ПРЕДСТАВЛЕНИЕ(РасходнаяНакладная.СтруктурнаяЕдиница) КАК ПредставлениеСкладаСписания,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладная.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РасходнаяНакладная.Организация
	|		ИНАЧЕ РасходнаяНакладная.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РасходнаяНакладная.Контрагент КАК Контрагент,
	|	РасходнаяНакладная.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладная.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РасходнаяНакладная.Контрагент
	|		ИНАЧЕ РасходнаяНакладная.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	РасходнаяНакладная.АдресДоставки КАК АдресДоставки,
	|	РасходнаяНакладная.КонтактноеЛицоПодписант.Наименование КАК РасшифровкаПодписиКонтрагента,
	|	РасходнаяНакладная.ДоверенностьНомер,
	|	РасходнаяНакладная.ДоверенностьДата,
	|	РасходнаяНакладная.ДоверенностьВыдана,
	|	РасходнаяНакладная.ДоверенностьЛицо,
	|	РасходнаяНакладная.Договор.Представление КАК Основание,
	|	РасходнаяНакладная.ВалютаДокумента,
	|	РасходнаяНакладная.СуммаВключаетНДС,
	|	РасходнаяНакладная.НДСВключатьВСтоимость,
	|	РасходнаяНакладная.Курс,
	|	РасходнаяНакладная.Кратность,
	|	РасходнаяНакладная.ОснованиеПечати КАК ПредставлениеОснования,
	|	РасходнаяНакладная.ОснованиеПечатиСсылка КАК ОснованиеПечатиСсылка,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладная.ОснованиеПечатиСсылка ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА РасходнаяНакладная.ОснованиеПечатиСсылка.НомерДоговора
	|		ИНАЧЕ РасходнаяНакладная.ОснованиеПечатиСсылка.Номер
	|	КОНЕЦ КАК ОснованиеНомер,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладная.ОснованиеПечатиСсылка ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА РасходнаяНакладная.ОснованиеПечатиСсылка.ДатаДоговора
	|		ИНАЧЕ РасходнаяНакладная.ОснованиеПечатиСсылка.Дата
	|	КОНЕЦ КАК ОснованиеДата,
	|	НЕОПРЕДЕЛЕНО КАК ТранспортнаяНакладнаяНомер,
	|	НЕОПРЕДЕЛЕНО КАК ТранспортнаяНакладнаяДата,
	|	РасходнаяНакладная.ПодписьРуководителя.Должность КАК ДолжностьРуководителя,
	|	РасходнаяНакладная.ПодписьРуководителя.РасшифровкаПодписи КАК РасшифровкаПодписиРуководителя,
	|	РасходнаяНакладная.ПодписьГлавногоБухгалтера.РасшифровкаПодписи КАК РасшифровкаПодписиГлавногоБухгалтера,
	|	РасходнаяНакладная.ПодписьКладовщика.Должность КАК ДолжностьКладовщика,
	|	РасходнаяНакладная.ПодписьКладовщика.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщика,
	|	РасходнаяНакладная.Вес КАК Вес,
	|	РасходнаяНакладная.Объем КАК Объем,
	|	РасходнаяНакладная.Запасы.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Содержание,
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(РасходнаяНакладная.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|				ТОГДА РасходнаяНакладная.Запасы.Номенклатура.Наименование
	|			ИНАЧЕ ВЫРАЗИТЬ(РасходнаяНакладная.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
	|		КОНЕЦ КАК ПредставлениеНоменклатуры,
	|		Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|		Номенклатура.Код КАК ЗапасКод,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияПоОКЕИ_Наименование,
	|		Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияПоОКЕИ_Код,
	|		Характеристика КАК Характеристика,
	|		Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		НЕОПРЕДЕЛЕНО КАК ВидУпаковки,
	|		ВЫБОР
	|			КОГДА РасходнаяНакладная.Запасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				ТОГДА РасходнаяНакладная.Запасы.ЕдиницаИзмерения.Коэффициент
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК КоэффициентЕдиницыИзмерения,
	|		Количество КАК Количество,
	|		НЕОПРЕДЕЛЕНО КАК КоличествоВОдномМесте,
	|		НЕОПРЕДЕЛЕНО КАК КоличествоМест,
	|		СтавкаНДС,
	|		Вес КАК МассаБрутто,
	|		ВЫРАЗИТЬ(РасходнаяНакладная.Запасы.Цена * РасходнаяНакладная.Курс / РасходнаяНакладная.Кратность КАК ЧИСЛО(15, 2)) КАК Поле1,
	|		ВЫРАЗИТЬ(РасходнаяНакладная.Запасы.Сумма * РасходнаяНакладная.Курс / РасходнаяНакладная.Кратность КАК ЧИСЛО(15, 2)) КАК Сумма,
	|		ВЫРАЗИТЬ(РасходнаяНакладная.Запасы.СуммаНДС * РасходнаяНакладная.Курс / РасходнаяНакладная.Кратность КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|		ВЫРАЗИТЬ(РасходнаяНакладная.Запасы.Всего * РасходнаяНакладная.Курс / РасходнаяНакладная.Кратность КАК ЧИСЛО(15, 2)) КАК Всего
	|	) КАК ТаблицаЗапасы,
	|	РасходнаяНакладная.НоменклатураДоставки КАК НоменклатураДоставки,
	|	ПРЕДСТАВЛЕНИЕ(РасходнаяНакладная.НоменклатураДоставки) КАК ПредставлениеНоменклатурыДоставки,
	|	РасходнаяНакладная.НоменклатураДоставки.Код КАК КодНоменклатурыДоставки,
	|	РасходнаяНакладная.НоменклатураДоставки.Артикул КАК АртикулНоменклатурыДоставки,
	|	РасходнаяНакладная.СтоимостьДоставки КАК СтоимостьДоставки,
	|	РасходнаяНакладная.СтавкаНДСДоставки КАК СтавкаНДСДоставки,
	|	РасходнаяНакладная.СуммаНДСДоставки КАК СуммаНДСДоставки
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасходнаяНакладная.Запасы.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.Ссылка,
	|	МАКСИМУМ(РасходнаяНакладнаяЗапасы.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ МаксНомерСтрокиЗапасы
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяЗапасы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяЗапасы.Содержание КАК Содержание,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Номенклатура.Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
	|	КОНЕЦ КАК ПредставлениеНоменклатуры,
	|	РасходнаяНакладнаяЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	РасходнаяНакладнаяЗапасы.Номенклатура.Код КАК ЗапасКод,
	|	РасходнаяНакладнаяЗапасы.Номенклатура.Артикул КАК Артикул,
	|	РасходнаяНакладнаяЗапасы.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияПоОКЕИ_Наименование,
	|	РасходнаяНакладнаяЗапасы.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияПоОКЕИ_Код,
	|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
	|	РасходнаяНакладнаяЗапасы.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НЕОПРЕДЕЛЕНО КАК ВидУпаковки,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|			ТОГДА РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентЕдиницыИзмерения,
	|	РасходнаяНакладнаяЗапасы.Количество КАК Количество,
	|	РасходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	РасходнаяНакладнаяЗапасы.Вес КАК Вес,
	|	РасходнаяНакладнаяЗапасы.Цена КАК Цена,
	|	РасходнаяНакладнаяЗапасы.Сумма КАК Сумма,
	|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС,
	|	РасходнаяНакладнаяЗапасы.Всего КАК Всего,
	|	РасходнаяНакладнаяЗапасы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВременнаяТаблица_РасходнаяНакладнаяЗапасы
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МаксНомерСтрокиЗапасы.НомерСтроки + 1,
	|	РасходнаяНакладнаяЗапасы.НоменклатураДоставки,
	|	ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000)),
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.НоменклатураДоставки.Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000))
	|	КОНЕЦ,
	|	РасходнаяНакладнаяЗапасы.НоменклатураДоставки.ТипНоменклатуры,
	|	РасходнаяНакладнаяЗапасы.НоменклатураДоставки.Код,
	|	РасходнаяНакладнаяЗапасы.НоменклатураДоставки.Артикул,
	|	РасходнаяНакладнаяЗапасы.НоменклатураДоставки.ЕдиницаИзмерения.Наименование,
	|	РасходнаяНакладнаяЗапасы.НоменклатураДоставки.ЕдиницаИзмерения.Код,
	|	НЕОПРЕДЕЛЕНО,
	|	РасходнаяНакладнаяЗапасы.НоменклатураДоставки.ЕдиницаИзмерения,
	|	НЕОПРЕДЕЛЕНО,
	|	1,
	|	1,
	|	РасходнаяНакладнаяЗапасы.СтавкаНДСДоставки,
	|	0,
	|	РасходнаяНакладнаяЗапасы.СтоимостьДоставки,
	|	РасходнаяНакладнаяЗапасы.СтоимостьДоставки,
	|	РасходнаяНакладнаяЗапасы.СуммаНДСДоставки,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.СуммаВключаетНДС
	|			ТОГДА РасходнаяНакладнаяЗапасы.СтоимостьДоставки
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.СтоимостьДоставки + РасходнаяНакладнаяЗапасы.СуммаНДСДоставки
	|	КОНЕЦ,
	|	РасходнаяНакладнаяЗапасы.Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладнаяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксНомерСтрокиЗапасы КАК МаксНомерСтрокиЗапасы
	|		ПО (МаксНомерСтрокиЗапасы.Ссылка = РасходнаяНакладнаяЗапасы.Ссылка)
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка В(&МассивОбъектов)
	|	И РасходнаяНакладнаяЗапасы.НоменклатураДоставки <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяЗапасы.Содержание КАК Содержание,
	|	РасходнаяНакладнаяЗапасы.ПредставлениеНоменклатуры КАК ПредставлениеНоменклатуры,
	|	РасходнаяНакладнаяЗапасы.ТипНоменклатуры КАК ТипНоменклатуры,
	|	РасходнаяНакладнаяЗапасы.ЗапасКод КАК ЗапасКод,
	|	РасходнаяНакладнаяЗапасы.Артикул КАК Артикул,
	|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмеренияПоОКЕИ_Наименование КАК ЕдиницаИзмеренияПоОКЕИ_Наименование,
	|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмеренияПоОКЕИ_Код КАК ЕдиницаИзмеренияПоОКЕИ_Код,
	|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
	|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ВидУпаковки,
	|	РасходнаяНакладнаяЗапасы.КоэффициентЕдиницыИзмерения КАК КоэффициентЕдиницыИзмерения,
	|	РасходнаяНакладнаяЗапасы.Количество КАК Количество,
	|	НЕОПРЕДЕЛЕНО КАК КоличествоВОдномМесте,
	|	НЕОПРЕДЕЛЕНО КАК КоличествоМест,
	|	РасходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	РасходнаяНакладнаяЗапасы.Вес КАК МассаБрутто,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.Договор.РасчетыВУсловныхЕдиницах
	|				И РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &НациональнаяВалюта
	|			ТОГДА ВЫБОР
	|					КОГДА РублевыеСуммыДокументовВВалюте.Всего ЕСТЬ NULL
	|						ТОГДА ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Цена * РасходнаяНакладнаяЗапасы.Ссылка.Курс / РасходнаяНакладнаяЗапасы.Ссылка.Кратность КАК ЧИСЛО(15, 2))
	|					КОГДА РасходнаяНакладнаяЗапасы.Количество = 0
	|						ТОГДА РублевыеСуммыДокументовВВалюте.Всего
	|					ИНАЧЕ ВЫРАЗИТЬ(РублевыеСуммыДокументовВВалюте.Всего / РасходнаяНакладнаяЗапасы.Количество КАК ЧИСЛО(15, 2))
	|				КОНЕЦ
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.Договор.РасчетыВУсловныхЕдиницах
	|				И РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &НациональнаяВалюта
	|			ТОГДА ВЫБОР
	|					КОГДА РублевыеСуммыДокументовВВалюте.Всего ЕСТЬ NULL
	|						ТОГДА ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Сумма * РасходнаяНакладнаяЗапасы.Ссылка.Курс / РасходнаяНакладнаяЗапасы.Ссылка.Кратность КАК ЧИСЛО(15, 2))
	|					КОГДА РасходнаяНакладнаяЗапасы.Ссылка.СуммаВключаетНДС
	|						ТОГДА ВЫРАЗИТЬ(РублевыеСуммыДокументовВВалюте.Всего КАК ЧИСЛО(15, 2))
	|					ИНАЧЕ ВЫРАЗИТЬ(РублевыеСуммыДокументовВВалюте.Всего - РублевыеСуммыДокументовВВалюте.НДС КАК ЧИСЛО(15, 2))
	|				КОНЕЦ
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.Договор.РасчетыВУсловныхЕдиницах
	|				И РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &НациональнаяВалюта
	|			ТОГДА ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НДС, ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.СуммаНДС * РасходнаяНакладнаяЗапасы.Ссылка.Курс / РасходнаяНакладнаяЗапасы.Ссылка.Кратность КАК ЧИСЛО(15, 2)))
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.Договор.РасчетыВУсловныхЕдиницах
	|				И РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &НациональнаяВалюта
	|			ТОГДА ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.Всего, ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Всего * РасходнаяНакладнаяЗапасы.Ссылка.Курс / РасходнаяНакладнаяЗапасы.Ссылка.Кратность КАК ЧИСЛО(15, 2)))
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Всего
	|	КОНЕЦ КАК Всего,
	|	РасходнаяНакладнаяЗапасы.Ссылка КАК Ссылка
	|ИЗ
	|	ВременнаяТаблица_РасходнаяНакладнаяЗапасы КАК РасходнаяНакладнаяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|		ПО РасходнаяНакладнаяЗапасы.Ссылка = РублевыеСуммыДокументовВВалюте.Регистратор
	|			И РасходнаяНакладнаяЗапасы.НомерСтроки = РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	Результат = МассивРезультатов[0].Выгрузить();
	
	ТЗСтрок = МассивРезультатов[3].Выгрузить();
	Для Каждого ТекущаяСтрока Из Результат Цикл
		
		НайденныеСтроки = ТЗСтрок.НайтиСтроки(Новый Структура("Ссылка", ТекущаяСтрока.Ссылка));
		Если НайденныеСтроки.Количество() > 0 Тогда
			ТекущаяСтрока.ТаблицаЗапасы = ТЗСтрок.Скопировать(НайденныеСтроки);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Процедура формирования печатной формы Универсального передаточного документа
//
Функция СформироватьУниверсальныйПередаточныйДокумент(ТабличныйДокумент, ТекущийДокумент)
	
	НачалоИспользованияСФ1137	= Константы.НачалоИспользованияСФ1137.Получить();
	СтруктураЗаполненияСекции	= Новый Структура;
	СтавкаНДС0					= УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
	
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйПередаточныйДокумент";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СчетФактура.ПФ_MXL_УниверсальныйПередаточныйДокумент");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК Ссылка
	|	,РасходнаяНакладная.Дата КАК ДатаДокумента
	|	,РасходнаяНакладная.Номер КАК Номер
	|	,РасходнаяНакладная.Организация.Префикс КАК Префикс
	|	,РасходнаяНакладная.Организация КАК Организация
	|	,РасходнаяНакладная.Организация КАК Поставщик
	|	,РасходнаяНакладная.БанковскийСчет КАК БанковскийСчет
	|	,РасходнаяНакладная.Контрагент КАК Покупатель
	|	,Выбор когда РасходнаяНакладная.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		Тогда РасходнаяНакладная.Контрагент
	|		Иначе РасходнаяНакладная.Грузополучатель Конец КАК Грузополучатель
	|	,РасходнаяНакладная.АдресДоставки КАК АдресДоставки
	|	,Выбор Когда РасходнаяНакладная.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		Тогда РасходнаяНакладная.Организация
	|		Иначе РасходнаяНакладная.Грузоотправитель Конец КАК Грузоотправитель
	|	,РасходнаяНакладная.Контрагент КАК Плательщик
	|	,РасходнаяНакладная.ОснованиеПечати КАК Основание
	|	,ЕСТЬNULL(РасходнаяНакладная.Договор.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах
	|	,РасходнаяНакладная.ВалютаДокумента КАК Валюта
	|	,РасходнаяНакладная.СуммаВключаетНДС
	|	,РасходнаяНакладная.НДСВключатьВСтоимость
	|	,РасходнаяНакладная.Курс
	|	,РасходнаяНакладная.Кратность
	|	,РасходнаяНакладная.ПодписьРуководителя.Должность КАК ДолжностьРуководителя
	|	,РасходнаяНакладная.ПодписьРуководителя.РасшифровкаПодписи КАК РасшифровкаПодписиРуководителя
	|	,РасходнаяНакладная.ПодписьГлавногоБухгалтера.Должность КАК ДолжностьГлавногоБухгалтера
	|	,РасходнаяНакладная.ПодписьГлавногоБухгалтера.РасшифровкаПодписи КАК РасшифровкаПодписиГлавногоБухгалтера
	|	,РасходнаяНакладная.ПодписьКладовщика.Должность КАК ДолжностьКладовщика
	|	,РасходнаяНакладная.ПодписьКладовщика.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщика
	|	,РасходнаяНакладная.ДоверенностьВыдана КАК ДоверенностьВыдана
	|	,РасходнаяНакладная.ДоверенностьДата КАК ДоверенностьДата
	|	,РасходнаяНакладная.ДоверенностьЛицо КАК ДоверенностьЛицо
	|	,РасходнаяНакладная.ДоверенностьНомер КАК ДоверенностьНомер
	|Из Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|Где РасходнаяНакладная.Ссылка = &ТекущийДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ИспользоватьПересчет = Шапка.РасчетыВУсловныхЕдиницах И (Шапка.Валюта <> Константы.НациональнаяВалюта.Получить());
	
	Запрос.УстановитьПараметр("ИспользоватьПересчет", ИспользоватьПересчет);
	Запрос.УстановитьПараметр("Курс",		Шапка.Курс);
	Запрос.УстановитьПараметр("Кратность",	Шапка.Кратность);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Содержание КАК Содержание,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			ТОГДА ВложенныйЗапрос.Номенклатура.Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
	|	КОНЕЦ КАК ТоварНаименование,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Номенклатура.Код КАК ЗапасКод,
	|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ТОГДА ВложенныйЗапрос.Номенклатура.ТоварнаяНоменклатураВЭД.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТНВЭДКод,
	|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	0 КАК КоличествоМест,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПересчет
	|			ТОГДА ВЫБОР
	|					КОГДА ВложенныйЗапрос.ВсегоРуб ЕСТЬ NULL
	|						ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.Сумма * &Курс / &Кратность КАК ЧИСЛО(15, 2))
	|					КОГДА ВложенныйЗапрос.СуммаВключаетНДС
	|						ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.ВсегоРуб КАК ЧИСЛО(15, 2))
	|					ИНАЧЕ ВЫРАЗИТЬ(ВложенныйЗапрос.ВсегоРуб - ВложенныйЗапрос.СуммаНДСРуб КАК ЧИСЛО(15, 2))
	|				КОНЕЦ
	|		ИНАЧЕ ВложенныйЗапрос.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПересчет
	|			ТОГДА ЕСТЬNULL(ВложенныйЗапрос.СуммаНДСРуб, ВЫРАЗИТЬ(ВложенныйЗапрос.СуммаНДС * &Курс / &Кратность КАК ЧИСЛО(15, 2)))
	|		ИНАЧЕ ВложенныйЗапрос.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПересчет
	|			ТОГДА ЕСТЬNULL(ВложенныйЗапрос.ВсегоРуб, ВЫРАЗИТЬ(ВложенныйЗапрос.Всего * &Курс / &Кратность КАК ЧИСЛО(15, 2)))
	|		ИНАЧЕ ВложенныйЗапрос.Всего
	|	КОНЕЦ КАК Всего,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|		РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		РасходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|		ВЫБОР
	|			КОГДА &ИспользоватьПересчет
	|				ТОГДА ВЫБОР
	|						КОГДА РублевыеСуммыДокументовВВалюте.Всего ЕСТЬ NULL
	|							ТОГДА ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Цена * &Курс / &Кратность КАК ЧИСЛО(15, 2))
	|						КОГДА РасходнаяНакладнаяЗапасы.Количество = 0
	|							ТОГДА РублевыеСуммыДокументовВВалюте.Всего
	|						ИНАЧЕ ВЫРАЗИТЬ(РублевыеСуммыДокументовВВалюте.Всего / РасходнаяНакладнаяЗапасы.Количество КАК ЧИСЛО(15, 2))
	|					КОНЕЦ
	|			ИНАЧЕ РасходнаяНакладнаяЗапасы.Цена
	|		КОНЕЦ КАК Цена,
	|		СУММА(РасходнаяНакладнаяЗапасы.Количество) КАК Количество,
	|		СУММА(РасходнаяНакладнаяЗапасы.Сумма) КАК Сумма,
	|		СУММА(РасходнаяНакладнаяЗапасы.СуммаНДС) КАК СуммаНДС,
	|		СУММА(РасходнаяНакладнаяЗапасы.Всего) КАК Всего,
	|		МИНИМУМ(РасходнаяНакладнаяЗапасы.НомерСтроки) КАК НомерСтроки,
	|		РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
	|		ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Содержание КАК СТРОКА(1000)) КАК Содержание,
	|		СУММА(РублевыеСуммыДокументовВВалюте.Всего) КАК ВсегоРуб,
	|		СУММА(РублевыеСуммыДокументовВВалюте.НДС) КАК СуммаНДСРуб,
	|		РасходнаяНакладнаяЗапасы.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС
	|	ИЗ
	|		Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|			ПО РасходнаяНакладнаяЗапасы.Ссылка = РублевыеСуммыДокументовВВалюте.Регистратор
	|				И РасходнаяНакладнаяЗапасы.НомерСтроки = РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|	ГДЕ
	|		РасходнаяНакладнаяЗапасы.Ссылка = &ТекущийДокумент
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасходнаяНакладнаяЗапасы.Номенклатура,
	|		РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения,
	|		РасходнаяНакладнаяЗапасы.СтавкаНДС,
	|		РасходнаяНакладнаяЗапасы.Характеристика,
	|		ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Содержание КАК СТРОКА(1000)),
	|		РасходнаяНакладнаяЗапасы.Ссылка.СуммаВключаетНДС,
	|		ВЫБОР
	|			КОГДА &ИспользоватьПересчет
	|				ТОГДА ВЫБОР
	|						КОГДА РублевыеСуммыДокументовВВалюте.Всего ЕСТЬ NULL
	|							ТОГДА ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Цена * &Курс / &Кратность КАК ЧИСЛО(15, 2))
	|						КОГДА РасходнаяНакладнаяЗапасы.Количество = 0
	|							ТОГДА РублевыеСуммыДокументовВВалюте.Всего
	|						ИНАЧЕ ВЫРАЗИТЬ(РублевыеСуммыДокументовВВалюте.Всего / РасходнаяНакладнаяЗапасы.Количество КАК ЧИСЛО(15, 2))
	|					КОНЕЦ
	|			ИНАЧЕ РасходнаяНакладнаяЗапасы.Цена
	|		КОНЕЦ) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ТабличнаяЧасть = Запрос.Выполнить().Выгрузить();
	
	КоличествоСтраниц = 1;
	
	СведенияОПокупателе			= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Покупатель, Шапка.ДатаДокумента,	,	);
	СведенияОПоставщике			= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.ДатаДокумента,	,	);
	
	ФлагОнЖе = (Шапка.Поставщик = Шапка.Грузоотправитель);
	
	СведенияОГрузоотправителе	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(
		?(ФлагОнЖе, Шапка.Поставщик, Шапка.Грузоотправитель), 
		Шапка.ДатаДокумента,	,);
		
	СведенияОГрузополучателе	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(
		?(ФлагОнЖе И НЕ ЗначениеЗаполнено(Шапка.Грузополучатель), Шапка.Покупатель, Шапка.Грузополучатель), 
		Шапка.ДатаДокумента,	,);
	
	// Выводим шапку накладной
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	СчетФактураВыданный = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйСчетФактуру(Шапка.Ссылка, Ложь);
	НоменДляПечати = ?(ЗначениеЗаполнено(СчетФактураВыданный), СчетФактураВыданный.Номер, Шапка.Номер);
	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, НоменДляПечати, Шапка.Префикс);
	
	СтруктураЗаполненияСекции.Вставить("Номер", НомерДокумента);
	СтруктураЗаполненияСекции.Вставить("Дата", Формат(?(ЗначениеЗаполнено(СчетФактураВыданный), СчетФактураВыданный.Дата, Шапка.ДатаДокумента), "ДФ='дд ММММ гггг'")+ " г.");
	СтруктураЗаполненияСекции.Вставить("НомерИсправления", "--");
	СтруктураЗаполненияСекции.Вставить("ДатаИсправления", "--");
	
	ПредставлениеПоставщика = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
	Если НЕ (Шапка.ДатаДокумента < '20090609' ИЛИ Шапка.ДатаДокумента >= НачалоИспользованияСФ1137) Тогда
		
		ПредставлениеПоставщика = ПредставлениеПоставщика + " (" + УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПоставщике, "Представление,") + ")";
		
	КонецЕсли;
	
	СтруктураЗаполненияСекции.Вставить("ПредставлениеПоставщика", ПредставлениеПоставщика);
	
	ЗначениеАдресаПоставщика = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,");
	СтруктураЗаполненияСекции.Вставить("АдресПоставщика", ?(ПустаяСтрока(ЗначениеАдресаПоставщика), "--", ЗначениеАдресаПоставщика));
	СтруктураЗаполненияСекции.Вставить("ПоДокументу", "-- от --");
	СтруктураЗаполненияСекции.Вставить("ПредставлениеПокупателя", УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,"));
	
	ЗначениеАдресаПокупателя = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес,");
	СтруктураЗаполненияСекции.Вставить("АдресПокупателя", ?(ПустаяСтрока(ЗначениеАдресаПокупателя), "--", ЗначениеАдресаПокупателя));
	
	Если ФлагОнЖе Тогда
		
		ПредставлениеГрузоотправителя = "он же";
		
	ИначеЕсли ЗначениеЗаполнено(Шапка.Грузоотправитель) Тогда
		
		ПредставлениеГрузоотправителя = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОГрузоотправителе, "ПолноеНаименование, ФактическийАдрес,");
		
	Иначе
		
		ПредставлениеГрузоотправителя = "--";
		
	КонецЕсли; 
	СтруктураЗаполненияСекции.Вставить("ПредставлениеГрузоотправителя", ПредставлениеГрузоотправителя);
	
	Если ЗначениеЗаполнено(Шапка.Грузополучатель) Тогда
		
		Если ПустаяСтрока(Шапка.АдресДоставки) Тогда
			
			ПредставлениеГрузополучателя  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование, ФактическийАдрес,");
			
		Иначе
			
			ПредставлениеГрузополучателя  = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,");
			ПредставлениеГрузополучателя  = ПредставлениеГрузополучателя + "; " + Шапка.АдресДоставки;
			
		КонецЕсли;
		
	Иначе
		
		ПредставлениеГрузополучателя = "--";
		
	КонецЕсли;
	СтруктураЗаполненияСекции.Вставить("ПредставлениеГрузополучателя", ПредставлениеГрузополучателя);
	
	КПП = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПоставщике, "КПП,", Ложь);
	Если ЗначениеЗаполнено(КПП) Тогда
		КПП = "/" + КПП;
	КонецЕсли;
	СтруктураЗаполненияСекции.Вставить("ИННпоставщика", УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПоставщике, "ИНН,", Ложь) + КПП);
	
	КПП = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе, "КПП,", Ложь);
	Если ЗначениеЗаполнено(КПП) Тогда 
		КПП = "/" + КПП;
	КонецЕсли;
	СтруктураЗаполненияСекции.Вставить("ИННПокупателя", УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе, "ИНН,", Ложь) + КПП);
	
	Если Шапка.Валюта <> Константы.НациональнаяВалюта.Получить()
		И НЕ ИспользоватьПересчет Тогда
		
		Валюта = СокрЛП(Шапка.Валюта.НаименованиеПолное) + ", " + СокрЛП(Шапка.Валюта.Код) + "";
		
	Иначе
		
		Валюта = "Российский рубль,643";
		
	Конецесли;
	СтруктураЗаполненияСекции.Вставить("Валюта", Валюта);
	СтруктураЗаполненияСекции.Вставить("СтатусУПД", "2");
	
	ОбластьМакета.Параметры.Заполнить(СтруктураЗаполненияСекции);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	// Выводим шапку ТЧ накладной
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	// Выводим ТЧ накладной
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ИтогоСтоимость	= 0;
	ИтогоСуммаНДС	= 0;
	ИтогоВсего		= 0;
	
	НомерСтроки = 0;
	НомерЛиста = 1;
	КоличествоСтрок = ТабличнаяЧасть.Количество();
	
	Для Каждого Строчка Из ТабличнаяЧасть Цикл
		
		СтруктураЗаполненияСекции.Очистить();
		
		НомерСтроки = НомерСтроки + 1;
		
		СтруктураЗаполненияСекции.Вставить("НомерСтроки", НомерСтроки);
		СтруктураЗаполненияСекции.Вставить("ТоварКод", Строчка.Артикул);
		
		ТоварНаименование = Строчка.Содержание;
		Если ПустаяСтрока(ТоварНаименование) Тогда
			
			ТоварНаименование = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(Строчка.ТоварНаименование, Строчка.Характеристика, Строчка.Артикул);
			
		КонецЕсли;
		
		Если Шапка.ДатаДокумента >= Дата(2016, 07, 01) Тогда
			
			Если Строчка.СтавкаНДС = СтавкаНДС0
				И НЕ ПустаяСтрока(Строчка.ТНВЭДКод) Тогда
				
				ТоварНаименование = ТоварНаименование + НСтр("ka=', код ТН ВЭД ';ru=', код ТН ВЭД '") + Строчка.ТНВЭДКод;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураЗаполненияСекции.Вставить("ТоварНаименование", ТоварНаименование);
		
		ЕдиницаИзмеренияКод = Строчка.ЕдиницаИзмеренияКод;
		Если Шапка.ДатаДокумента >= НачалоИспользованияСФ1137 
			И НЕ ЗначениеЗаполнено(ЕдиницаИзмеренияКод) Тогда
			
			ЕдиницаИзмеренияКод = "--";
			
		КонецЕсли;
		СтруктураЗаполненияСекции.Вставить("ЕдиницаИзмеренияКод", ЕдиницаИзмеренияКод);
		
		ЕдиницаИзмерения = Строчка.ЕдиницаИзмерения;
		Если Шапка.ДатаДокумента >= НачалоИспользованияСФ1137 
			И НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
			
			ЕдиницаИзмерения = "--";
			
		КонецЕсли;
		СтруктураЗаполненияСекции.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
		СтруктураЗаполненияСекции.Вставить("Акциз", ?(Шапка.ДатаДокумента < НачалоИспользованияСФ1137, "", Нстр("ka='აქციზის გარეშე';ru='без акциза';en='without excise'")));
		СтруктураЗаполненияСекции.Вставить("Количество", Строчка.Количество);
		
		Если Строчка.Цена = 0 ИЛИ Строчка.Количество = 0 Тогда
			
			СтруктураЗаполненияСекции.Вставить("Цена", "--");
			
		Иначе
			
			СтруктураЗаполненияСекции.Вставить("Цена", Окр((Строчка.Всего - Строчка.СуммаНДС) / Строчка.Количество,2));
			
		КонецЕсли;
		
		СтруктураЗаполненияСекции.Вставить("Стоимость", Строчка.Всего - Строчка.СуммаНДС);
		СтруктураЗаполненияСекции.Вставить("Всего", Строчка.Всего);
		
		Если ВРег(Строчка.СтавкаНДС) = "БЕЗ НДС" Тогда
			
			СтруктураЗаполненияСекции.Вставить("СтавкаНДС", Нстр("ka='დღგ-ის გარეშე';ru='без НДС';en='without VAT'"));
			СтруктураЗаполненияСекции.Вставить("СуммаНДС", Нстр("ka='დღგ-ის გარეშე';ru='без НДС';en='without VAT'"));
			
		Иначе
			
			СтруктураЗаполненияСекции.Вставить("СтавкаНДС",Строчка.СтавкаНДС);
			СтруктураЗаполненияСекции.Вставить("СуммаНДС", Строчка.СуммаНДС);
			
		КонецЕсли;
		
		СтруктураЗаполненияСекции.Вставить("СтранаПроисхожденияКод", "--");
		СтруктураЗаполненияСекции.Вставить("ПредставлениеСтраны", "--");
		СтруктураЗаполненияСекции.Вставить("ПредставлениеГТД", "--");
		
		ИтогоСтоимость	= ИтогоСтоимость + (Строчка.Всего - Строчка.СуммаНДС);
		ИтогоСуммаНДС	= ИтогоСуммаНДС + Строчка.СуммаНДС;
		ИтогоВсего		= ИтогоВсего + Строчка.Всего;
		
		ОбластьМакета.Параметры.Заполнить(СтруктураЗаполненияСекции);
		
		Если НЕ УправлениеНебольшойФирмойСервер.ПроверитьВыводСчетаФактурыНаСтраницу(ТабличныйДокумент, ОбластьМакета, (НомерСтроки = КоличествоСтрок), Макет, НомерЛиста, НомерДокумента, Истина) Тогда
			
			КоличествоСтраниц = КоличествоСтраниц + 1;
			
		КонецЕсли;
		
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	// Выводим область ИТОГО
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	
	СтруктураЗаполненияСекции.Очистить();
	СтруктураЗаполненияСекции.Вставить("ИтогоСуммаНДС", ИтогоСуммаНДС);
	СтруктураЗаполненияСекции.Вставить("ИтогоВсего", ИтогоВсего);
	СтруктураЗаполненияСекции.Вставить("ИтогоСтоимость", ?(ИтогоСтоимость = 0, "--", ИтогоСтоимость));
	
	ОбластьМакета.Параметры.Заполнить(СтруктураЗаполненияСекции);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	// Выводим область Подвал
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ОтветственныеЛицаОрганизации = Новый Структура;
	Если Шапка.Организация.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		ОтветственныеЛицаОрганизации.Вставить("ФИОПБОЮЛ", Шапка.РасшифровкаПодписиРуководителя);
		
	Иначе
		
		ОтветственныеЛицаОрганизации.Вставить("ФИОРуководителя", Шапка.РасшифровкаПодписиРуководителя);
		ОтветственныеЛицаОрганизации.Вставить("ДолжностьРуководителя", Шапка.ДолжностьРуководителя);
		
	КонецЕсли;
	
	ОтветственныеЛицаОрганизации.Вставить("КоличествоЛистов", 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ka='დოკუმენტი შედგენილია %1%2 %3-ისთვის';ru='Документ составлен на%1%2 %3';en='The document is% 1% 2% 3'"), Символы.ПС, КоличествоСтраниц,
			УправлениеНебольшойФирмойСервер.ФормаМножественногоЧисла(НСтр("ka='ფურცელს';ru='листе';en='sheet'"), НСтр("en='sheets';ka='გვერდებზე';ru='листах'"), НСтр("en='sheets';ka='გვერდებზე';ru='листах'"), КоличествоСтраниц))
		);
	
	ОтветственныеЛицаОрганизации.Вставить("Свидетельство", УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПоставщике, "Свидетельство,"));
	
	ОтветственныеЛицаОрганизации.Вставить("ФИОКладовщика", Шапка.РасшифровкаПодписиКладовщика);
	ОтветственныеЛицаОрганизации.Вставить("ДолжностьКладовщика", Шапка.ДолжностьКладовщика);
	ОтветственныеЛицаОрганизации.Вставить("ФИОГлавногоБухгалтера", Шапка.РасшифровкаПодписиГлавногоБухгалтера);
	
	ОбластьМакета.Параметры.Заполнить(ОтветственныеЛицаОрганизации);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если Шапка.Организация.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		ОтветственныеЛицаОрганизации.Вставить("ФИОРуководителя", Шапка.РасшифровкаПодписиРуководителя);
		ОтветственныеЛицаОрганизации.Вставить("ДолжностьРуководителя", Шапка.ДолжностьРуководителя);
		
	КонецЕсли;
	
	// Выводим область Подвал накладной
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалНакладной");
	СтруктураЗаполненияСекции.Очистить();
	Если ЗначениеЗаполнено(Шапка.ДоверенностьВыдана)
		ИЛИ ЗначениеЗаполнено(Шапка.ДоверенностьДата)
		ИЛИ ЗначениеЗаполнено(Шапка.ДоверенностьЛицо)
		ИЛИ ЗначениеЗаполнено(Шапка.ДоверенностьНомер) Тогда
		
		ТекстОснования = Шапка.Основание + НСтр("ka='; მინდობილობით #';ru='; по доверенности №';en='; proxy number'") + Шапка.ДоверенностьНомер 
			+ НСтр("ru=' от ';ka='ვისგან'") + Формат(Шапка.ДоверенностьДата, "ДЛФ=DD") 
			+ НСтр("ka=' выданной ';ru=' выданной '") + Шапка.ДоверенностьВыдана + " " 
			+ Шапка.ДоверенностьЛицо;
			
		СтруктураЗаполненияСекции.Вставить("Основание", ТекстОснования);
		
	Иначе
		
		СтруктураЗаполненияСекции.Вставить("Основание", Шапка.Основание);
		
	КонецЕсли;
	
	СтруктураЗаполненияСекции.Вставить("ДатаОтгрузкиПередачи", Формат(Шапка.ДатаДокумента, "ДФ='« дд » ММММ гггг'"));
	
	ПредставлениеОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
	Если НЕ ПустаяСтрока(СведенияОПоставщике.ИНН) 
		И НЕ ПустаяСтрока(СведенияОПоставщике.КПП) Тогда
		
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='%1, გსნ/აამკ %2/%3';ru='%1, ИНН/КПП %2/%3';en='1%, TIN / KPP 2% / 3%'"),
			ПредставлениеОрганизации, СведенияОПоставщике.ИНН, СведенияОПоставщике.КПП);
		
	ИначеЕсли НЕ ПустаяСтрока(СведенияОПоставщике.ИНН) Тогда
		
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='%1, გსნ %2';ru='%1, ИНН %2';en='1%, 2% TIN'"),
			ПредставлениеОрганизации, СведенияОПоставщике.ИНН);
		
	КонецЕсли;
	СтруктураЗаполненияСекции.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
			
	ПредставлениеКонтрагента = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,");
	Если НЕ ПустаяСтрока(СведенияОПокупателе.ИНН)
		И НЕ ПустаяСтрока(СведенияОПокупателе.КПП) Тогда
		
		ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='%1, გსნ/აამკ %2/%3';ru='%1, ИНН/КПП %2/%3';en='1%, TIN / KPP 2% / 3%'"),
			ПредставлениеКонтрагента, СведенияОПокупателе.ИНН, СведенияОПокупателе.КПП);
			
	ИначеЕсли НЕ ПустаяСтрока(СведенияОПокупателе.ИНН) Тогда
		
		ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='%1, გსნ %2';ru='%1, ИНН %2';en='1%, 2% TIN'"),
			ПредставлениеКонтрагента, СведенияОПокупателе.ИНН);
		
	КонецЕсли;
	СтруктураЗаполненияСекции.Вставить("ПредставлениеКонтрагента", ПредставлениеКонтрагента);
	
	СтруктураЗаполненияСекции.Вставить("ДолжностьКладовщика", ОтветственныеЛицаОрганизации.ДолжностьКладовщика);
	СтруктураЗаполненияСекции.Вставить("ФИОКладовщика", ОтветственныеЛицаОрганизации.ФИОКладовщика);
	СтруктураЗаполненияСекции.Вставить("ФИОРуководителя", ОтветственныеЛицаОрганизации.ФИОРуководителя);
	СтруктураЗаполненияСекции.Вставить("ДолжностьРуководителя", ОтветственныеЛицаОрганизации.ДолжностьРуководителя);
	
	ОбластьМакета.Параметры.Заполнить(СтруктураЗаполненияСекции);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьУниверсальныйПередаточныйДокумент()

// Процедура формирования печатной формы Накладная, Накладная с услугами
//
Процедура СформироватьНакладную(ТабличныйДокумент, ТекущийДокумент, ИсключаяУслуги)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Дата КАК ДатаДокумента,
	|	РасходнаяНакладная.Организация КАК Организация,
	|	РасходнаяНакладная.Контрагент КАК Контрагент,
	|	РасходнаяНакладная.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	РасходнаяНакладная.ВалютаДокумента КАК ВалютаДокумента,
	|	РасходнаяНакладная.Номер,
	|	РасходнаяНакладная.Организация.Префикс КАК Префикс,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ""(მყიდველისთვის მიყიდვა)""
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|			ТОГДА ""(Передача на комиссию)""
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|			ТОГДА ""(Передача в переработку)""
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ""(Передача контрагенту на ответственное хранение)""
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ТОГДА ""(მომწოდებლისთვის დაბრუნება)""
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|			ТОГДА ""(Возврат комитенту)""
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|			ТОГДА ""(Возврат контрагенту из переработки)""
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ""(Возврат контрагенту с ответственного хранения)""
	|	КОНЕЦ КАК ВидОперации,
	|	РасходнаяНакладная.ПодписьКладовщика.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщика,
	|	РасходнаяНакладная.КонтактноеЛицоПодписант.Наименование КАК РасшифровкаПодписиКонтрагента,
	|	РасходнаяНакладная.НоменклатураДоставки,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладная.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			ТОГДА РасходнаяНакладная.НоменклатураДоставки.Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(РасходнаяНакладная.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000))
	|	КОНЕЦ КАК ЗапасДоставки,
	|	РасходнаяНакладная.НоменклатураДоставки.Код КАК КодДоставки,
	|	РасходнаяНакладная.НоменклатураДоставки.Артикул КАК АртикулДоставки,
	|	РасходнаяНакладная.НоменклатураДоставки.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДоставки,
	|	РасходнаяНакладная.СтоимостьДоставки,
	|	РасходнаяНакладная.СуммаНДСДоставки,
	|	РасходнаяНакладная.Запасы.(
	|		НомерСтроки КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(РасходнаяНакладная.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
	|				ТОГДА РасходнаяНакладная.Запасы.Номенклатура.Наименование
	|			ИНАЧЕ РасходнаяНакладная.Запасы.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Запас,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура.Код КАК Код,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		СуммаНДС,
	|		Всего,
	|		Характеристика,
	|		Партия,
	|		Содержание,
	|		ПроцентСкидкиНаценки,
	|		ВЫБОР
	|			КОГДА РасходнаяНакладная.Запасы.ПроцентСкидкиНаценки <> 0
	|					ИЛИ РасходнаяНакладная.Запасы.СуммаАвтоматическойСкидки <> 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЕстьСкидка,
	|		Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|		СуммаАвтоматическойСкидки,
	|		КлючСвязи
	|	),
	|	РасходнаяНакладная.СерийныеНомера.(
	|		СерийныйНомер,
	|		КлючСвязи
	|	)
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ПечататьДоставку = ЗначениеЗаполнено(Шапка.НоменклатураДоставки);
	
	ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
	ВыборкаСтрокСерийныеНомера = Шапка.СерийныеНомера.Выбрать();
	
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасходнаяНакладная_Накладная";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РасходнаяНакладная.ПФ_MXL_Накладная");
	СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента, ,);
	СведенияОбКонтрагенте = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.ДатаДокумента, ,);
	
	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "გასავლის ზედნადები № "
											+ НомерДокумента
											+ "       "
											+ Формат(Шапка.ДатаДокумента, "Л=ka; ДЛФ=D");
											
	ОбластьМакета.Параметры.ВидОперации = Шапка.ВидОперации;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.ПредставлениеПоставщика = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ФактическийАдрес");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.ПредставлениеПолучателя = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбКонтрагенте, "ПолноеНаименование,ФактическийАдрес");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Склад");
	ОбластьМакета.Параметры.ПредставлениеСклада = ТекущийДокумент.СтруктурнаяЕдиница;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ЕстьСкидки = Шапка.Запасы.Выгрузить().Итог("ЕстьСкидка") <> 0;

	Если ЕстьСкидки Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаСоСкидкой");
		
	Иначе
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
	КонецЕсли;
	
	Сумма		= 0;
	СуммаНДС	= 0;
	Всего		= 0;
	Количество	= 0;
	
	ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
	Пока ЕстьДанныеДляВывода ИЛИ ПечататьДоставку Цикл
	
		Если ПечататьДоставку И НЕ ЕстьДанныеДляВывода Тогда
			ПечататьДоставку = Ложь;
			ДанныеСтроки = ДоставкаСервер.ДанныеПечатиДоставки(Шапка);
		Иначе
			ДанныеСтроки = ВыборкаСтрокЗапасы;
		КонецЕсли; 
		
		Если ИсключаяУслуги И ДанныеСтроки.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
			Продолжить;
		КонецЕсли; 
		
		ОбластьМакета.Параметры.Заполнить(ДанныеСтроки);
		Если ЗначениеЗаполнено(ДанныеСтроки.Содержание) Тогда
			
			ОбластьМакета.Параметры.Запас = ДанныеСтроки.Содержание;
			
		Иначе
			
			СтрокаСерийныеНомера = РаботаССерийнымиНомерами.СтрокаСерийныеНомераИзВыборки(ВыборкаСтрокСерийныеНомера, ДанныеСтроки.КлючСвязи);
			ПредставлениеЗапаса = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(ДанныеСтроки.Запас, 
				ДанныеСтроки.Характеристика, ДанныеСтроки.Артикул, СтрокаСерийныеНомера);
				
			Если ЗначениеЗаполнено(ДанныеСтроки.Партия) Тогда
				
				ПредставлениеЗапаса = ПредставлениеЗапаса + "; " + Строка(ДанныеСтроки.Партия);
				
			КонецЕсли;
			
			ОбластьМакета.Параметры.Запас = ПредставлениеЗапаса;
			
		КонецЕсли;
			
		Если ЕстьСкидки Тогда
			Если ДанныеСтроки.ПроцентСкидкиНаценки = 100 Тогда
				Скидка = ДанныеСтроки.Цена * ДанныеСтроки.Количество;
				ОбластьМакета.Параметры.Скидка         = Скидка;
				ОбластьМакета.Параметры.СуммаБезСкидки = Скидка;
			ИначеЕсли ДанныеСтроки.ПроцентСкидкиНаценки = 0 И ДанныеСтроки.СуммаАвтоматическойСкидки = 0 Тогда
				ОбластьМакета.Параметры.Скидка         = 0;
				ОбластьМакета.Параметры.СуммаБезСкидки = ДанныеСтроки.Сумма;
			Иначе
				Скидка = ДанныеСтроки.Количество * ДанныеСтроки.Цена - ДанныеСтроки.Сумма; // АвтоматическиеСкидки
				ОбластьМакета.Параметры.Скидка         = Скидка;
				ОбластьМакета.Параметры.СуммаБезСкидки = ДанныеСтроки.Сумма + Скидка;
			КонецЕсли;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Сумма		= Сумма		+ ДанныеСтроки.Сумма;
		СуммаНДС	= СуммаНДС	+ ДанныеСтроки.СуммаНДС;
		Всего		= Всего		+ ДанныеСтроки.Всего;
		Количество	= Количество+ 1;
		
		ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Всего = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
	Если СуммаНДС = 0 Тогда
		ОбластьМакета.Параметры.НДС = "Без налога (НДС)";
		ОбластьМакета.Параметры.ВсегоНДС = "-";
	Иначе
		ОбластьМакета.Параметры.НДС = ?(Шапка.СуммаВключаетНДС, "მათ შორის დღგ:", "Сумма НДС:");
		ОбластьМакета.Параметры.ВсегоНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаНДС);
	КонецЕсли; 
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	СуммаКПрописи = Всего;
	ОбластьМакета.Параметры.ИтоговаяСтрока = "რაოდენობა "
											+ Строка(Количество)
											+ ",  ჯამი "
											+ УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента);
	
	ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента);
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ДатаПользователь");
	ОбластьМакета.Параметры.ТекДата = ТекущаяДата();
	ОбластьМакета.Параметры.ТекПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры // СформироватьНакладную()


// Процедура формирования печатной формы Товарный чек
//
Процедура СформироватьТоварныйЧек(ТабличныйДокумент, ТекущийДокумент)
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасходнаяНакладная_ТоварныйЧек";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЧекККМ.ПФ_MXL_ТоварныйЧек");
	СтруктураЗаполненияСекции = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Дата КАК ДатаДокумента,
	|	РасходнаяНакладная.Организация КАК Организация,
	|	РасходнаяНакладная.Контрагент КАК Контрагент,
	|	РасходнаяНакладная.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	РасходнаяНакладная.ВалютаДокумента КАК ВалютаДокумента,
	|	РасходнаяНакладная.Номер,
	|	РасходнаяНакладная.Организация.Префикс КАК Префикс,
	|	РасходнаяНакладная.ПодписьКладовщика.Должность КАК ДолжностьКладовщика,
	|	РасходнаяНакладная.ПодписьКладовщика.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщика,
	|	РасходнаяНакладная.КонтактноеЛицоПодписант.Наименование КАК РасшифровкаПодписиКонтрагента,
	|	РасходнаяНакладная.НоменклатураДоставки,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладная.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			ТОГДА РасходнаяНакладная.НоменклатураДоставки.Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(РасходнаяНакладная.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000))
	|	КОНЕЦ КАК ЗапасДоставки,
	|	РасходнаяНакладная.НоменклатураДоставки.Код КАК КодДоставки,
	|	РасходнаяНакладная.НоменклатураДоставки.Артикул КАК АртикулДоставки,
	|	РасходнаяНакладная.НоменклатураДоставки.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДоставки,
	|	РасходнаяНакладная.СтоимостьДоставки,
	|	РасходнаяНакладная.СуммаНДСДоставки,
	|	РасходнаяНакладная.Запасы.(
	|		НомерСтроки КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(РасходнаяНакладная.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
	|				ТОГДА РасходнаяНакладная.Запасы.Номенклатура.Наименование
	|			ИНАЧЕ РасходнаяНакладная.Запасы.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Запас,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура.Код КАК Код,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		СуммаНДС,
	|		Всего,
	|		Характеристика,
	|		Партия,
	|		Содержание,
	|		ПроцентСкидкиНаценки,
	|		ВЫБОР
	|			КОГДА РасходнаяНакладная.Запасы.ПроцентСкидкиНаценки <> 0
	|					ИЛИ РасходнаяНакладная.Запасы.СуммаАвтоматическойСкидки <> 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЕстьСкидка,
	|		Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|		СуммаАвтоматическойСкидки,
	|		КлючСвязи
	|	),
	|	РасходнаяНакладная.СерийныеНомера.(
	|		СерийныйНомер,
	|		КлючСвязи
	|	)
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ПечататьДоставку = ЗначениеЗаполнено(Шапка.НоменклатураДоставки);
	
	ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
	ВыборкаСтрокСерийныеНомера = Шапка.СерийныеНомера.Выбрать();
	
	СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента, ,);
	СведенияОбКонтрагенте = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.ДатаДокумента, ,);
	
	//:::Заголовок
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок|ОсновныеДанные");
	СтруктураЗаполненияСекции.Очистить();
	
	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
	СтруктураЗаполненияСекции.Вставить("ТекстЗаголовка",  НСтр("ka='Товарный чек № ';ru='Товарный чек № '") + НомерДокумента + НСтр("ru=' от ';ka='ვისგან'") + Формат(Шапка.ДатаДокумента, "ДЛФ=DD"));
	
	ОбластьМакета.Параметры.Заполнить(СтруктураЗаполненияСекции);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	//:::Поставщик
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	СтруктураЗаполненияСекции.Очистить();
	СтруктураЗаполненияСекции = Новый Структура(Новый ФиксированнаяСтруктура(СведенияОбОрганизации));
	
	ПредставлениеПоставщика = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	СтруктураЗаполненияСекции.Вставить("ПредставлениеПоставщика", ПредставлениеПоставщика);
	СтруктураЗаполненияСекции.Вставить("Поставщик", Шапка.Организация);
	
	ОбластьМакета.Параметры.Заполнить(СтруктураЗаполненияСекции);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	//:::Покупатель
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	СтруктураЗаполненияСекции.Очистить();
	СтруктураЗаполненияСекции = Новый Структура(Новый ФиксированнаяСтруктура(СведенияОбКонтрагенте));
	
	ПредставлениеПолучателя = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбКонтрагенте, "ПолноеНаименование,ФактическийАдрес,Телефоны");
	СтруктураЗаполненияСекции.Вставить("ПредставлениеПолучателя", ПредставлениеПолучателя);
	
	ОбластьМакета.Параметры.Заполнить(СтруктураЗаполненияСекции);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	//:::ШапкаТаблицы
	ЕстьСкидки = Шапка.Запасы.Выгрузить().Итог("ЕстьСкидка") <> 0;
	
	ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
	
	ТабличныйДокумент.Вывести(ОбластьНомера);
	
	ТабличныйДокумент.Присоединить(ОбластьДанных);
	Если ЕстьСкидки Тогда
		
		ТабличныйДокумент.Присоединить(ОбластьСкидок);
		
	КонецЕсли;
	ТабличныйДокумент.Присоединить(ОбластьСуммы);
	
	//:::СтрокиТаблицы
	ОбластьКолонкаЗапас = Макет.Область("Запас");
	Если Не ЕстьСкидки Тогда
		
		ОбластьКолонкаЗапас.ШиринаКолонки = ОбластьКолонкаЗапас.ШиринаКолонки + Макет.Область("СуммаБезСкидки").ШиринаКолонки + Макет.Область("СуммаСкидки").ШиринаКолонки;
		
	КонецЕсли;
	
	ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("Строка|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");
	
	Сумма			= 0;
	СуммаНДС		= 0;
	Всего			= 0;
	ВсегоСкидок		= 0;
	ВсегоБезСкидок	= 0;
	Количество		= 0;
	ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
	Пока ЕстьДанныеДляВывода ИЛИ ПечататьДоставку Цикл
	
		Если ПечататьДоставку И НЕ ЕстьДанныеДляВывода Тогда
			ПечататьДоставку = Ложь;
			ДанныеСтроки = ДоставкаСервер.ДанныеПечатиДоставки(Шапка);
		Иначе
			ДанныеСтроки = ВыборкаСтрокЗапасы;
		КонецЕсли; 
		
		СтруктураЗаполненияСекции.Очистить();
		ОбластьНомера.Параметры.Заполнить(ДанныеСтроки);
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ЗначениеЗаполнено(ДанныеСтроки.Содержание) Тогда
			
			СтруктураЗаполненияСекции.Вставить("Запас", ДанныеСтроки.Содержание);
			
		Иначе
			
			СтрокаСерийныеНомера = РаботаССерийнымиНомерами.СтрокаСерийныеНомераИзВыборки(ВыборкаСтрокСерийныеНомера, ДанныеСтроки.КлючСвязи);
			ПредставлениеЗапаса = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(ДанныеСтроки.Запас, 
				ДанныеСтроки.Характеристика, ДанныеСтроки.Артикул, СтрокаСерийныеНомера);
				
			СтруктураЗаполненияСекции.Вставить("Запас", ПредставлениеЗапаса);
			
		КонецЕсли;
		
		СтруктураЗаполненияСекции.Вставить("Количество", ДанныеСтроки.Количество);
		СтруктураЗаполненияСекции.Вставить("ЕдиницаИзмерения", ДанныеСтроки.ЕдиницаИзмерения);
		СтруктураЗаполненияСекции.Вставить("Цена", ДанныеСтроки.Цена);
		
		ОбластьДанных.Параметры.Заполнить(СтруктураЗаполненияСекции);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		Скидка = 0;
		Если ЕстьСкидки Тогда
			
			Если ДанныеСтроки.ПроцентСкидкиНаценки = 100 Тогда
				
				Скидка = ДанныеСтроки.Цена * ДанныеСтроки.Количество;
				СтруктураЗаполненияСекции.Вставить("Скидка", Скидка);
				СтруктураЗаполненияСекции.Вставить("СуммаБезСкидки", Скидка);
				
			ИначеЕсли ДанныеСтроки.ПроцентСкидкиНаценки = 0 И ДанныеСтроки.СуммаАвтоматическойСкидки = 0 Тогда
				
				СтруктураЗаполненияСекции.Вставить("Скидка", 0);
				СтруктураЗаполненияСекции.Вставить("СуммаБезСкидки", ДанныеСтроки.Сумма);
				
			Иначе
				
				Скидка = ДанныеСтроки.Количество * ДанныеСтроки.Цена - ДанныеСтроки.Сумма; // АвтоматическиеСкидки
				СтруктураЗаполненияСекции.Вставить("Скидка", Скидка);
				СтруктураЗаполненияСекции.Вставить("СуммаБезСкидки", ДанныеСтроки.Сумма + Скидка);
				
			КонецЕсли;
			
			ОбластьСкидок.Параметры.Заполнить(СтруктураЗаполненияСекции);
			ТабличныйДокумент.Присоединить(ОбластьСкидок);
			
		КонецЕсли;
		
		СтруктураЗаполненияСекции.Вставить("Сумма", ДанныеСтроки.Сумма);
		
		ОбластьСуммы.Параметры.Заполнить(СтруктураЗаполненияСекции);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
		
		Сумма			= Сумма			+ ДанныеСтроки.Сумма;
		СуммаНДС		= СуммаНДС		+ ДанныеСтроки.СуммаНДС;
		Всего			= Всего			+ ДанныеСтроки.Всего;
		ВсегоСкидок		= ВсегоСкидок	+ Скидка;
		ВсегоБезСкидок	= Сумма			+ ВсегоСкидок;
		Количество		= Количество	+ 1;
		
		ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
		
	КонецЦикла;
	
	//:::Итого
	ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
	ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("Итого|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("Итого|Сумма");
	СтруктураЗаполненияСекции.Очистить();
	
	СтруктураЗаполненияСекции.Вставить("Сумма", УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма));
	СтруктураЗаполненияСекции.Вставить("Всего", УправлениеНебольшойФирмойСервер.ФорматСумм(Всего));
	
	Если СуммаНДС = 0 Тогда
		
		СтруктураЗаполненияСекции.Вставить("ЗаголовокНДС", "Без налога (НДС)");
		СтруктураЗаполненияСекции.Вставить("СуммаНДС", "-");
		
	Иначе
		
		СтруктураЗаполненияСекции.Вставить("ЗаголовокНДС", ?(Шапка.СуммаВключаетНДС, "В том числе НДС:", "Сумма НДС:"));
		СтруктураЗаполненияСекции.Вставить("СуммаНДС", УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаНДС));
		
	КонецЕсли; 
	
	ТабличныйДокумент.Вывести(ОбластьНомера);
	
	ОбластьДанных.Параметры.Заполнить(СтруктураЗаполненияСекции);
	ТабличныйДокумент.Присоединить(ОбластьДанных);
	
	Если ЕстьСкидки Тогда
		
		СтруктураЗаполненияСекции.Вставить("ВсегоСкидок", ВсегоСкидок);
		СтруктураЗаполненияСекции.Вставить("ВсегоБезСкидок", ВсегоБезСкидок);
		
		ОбластьСкидок.Параметры.Заполнить(СтруктураЗаполненияСекции);
		ТабличныйДокумент.Присоединить(ОбластьСкидок);
		
	КонецЕсли;
	
	ОбластьСуммы.Параметры.Заполнить(СтруктураЗаполненияСекции);
	ТабличныйДокумент.Присоединить(ОбластьСуммы);
	
	//:::СуммаПрописью
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	СтруктураЗаполненияСекции.Очистить();
	
	СуммаКПрописи = Всего;
	СтруктураЗаполненияСекции.Вставить("ИтоговаяСтрока", 
		НСтр("ka='Всего наименований ';ru='Всего наименований '") + Строка(Количество) + НСтр("ka=', на сумму ';ru=', на сумму '") + УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента));
	СтруктураЗаполненияСекции.Вставить("СуммаПрописью", РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента));
	
	ОбластьМакета.Параметры.Заполнить(СтруктураЗаполненияСекции);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	//:::Подписи
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи|ОсновныеДанные");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры // СформироватьТоварныйЧек()

// Процедура формирования печатной формы М15
//
Процедура СформироватьМ15(ТабличныйДокумент, ТекущийДокумент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Дата КАК ДатаДокумента,
	|	РасходнаяНакладная.Номер КАК Номер,
	|	РасходнаяНакладная.Организация КАК Руководители,
	|	РасходнаяНакладная.Организация КАК Организация,
	|	РасходнаяНакладная.БанковскийСчет КАК БанковскийСчет,
	|	РасходнаяНакладная.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	РасходнаяНакладная.Организация.Префикс КАК Префикс,
	|	РасходнаяНакладная.СтруктурнаяЕдиница КАК СкладНаименование,
	|	РасходнаяНакладная.Контрагент КАК Контрагент,
	|	РасходнаяНакладная.Договор.Представление КАК Основание,
	|	РасходнаяНакладная.ВалютаДокумента,
	|	РасходнаяНакладная.СуммаВключаетНДС,
	|	РасходнаяНакладная.СтруктурнаяЕдиница.МОЛ КАК МОЛ,
	|	РасходнаяНакладная.Ответственный.Физлицо КАК Ответственный,
	|	РасходнаяНакладная.НДСВключатьВСтоимость,
	|	РасходнаяНакладная.Курс,
	|	РасходнаяНакладная.Кратность,
	|	РасходнаяНакладная.ПодписьРуководителя.Должность КАК ДолжностьРуководителя,
	|	РасходнаяНакладная.ПодписьРуководителя.РасшифровкаПодписи КАК РасшифровкаПодписиРуководителя,
	|	РасходнаяНакладная.ПодписьГлавногоБухгалтера.РасшифровкаПодписи КАК РасшифровкаПодписиГлавногоБухгалтера,
	|	РасходнаяНакладная.ПодписьКладовщика.Должность КАК ДолжностьКладовщика,
	|	РасходнаяНакладная.ПодписьКладовщика.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщика,
	|	РасходнаяНакладная.КонтактноеЛицоПодписант.Наименование КАК РасшифровкаПодписиКонтрагента
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	
	Шапка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	
	ИспользоватьПересчет = (НЕ Шапка.ВалютаДокумента = Константы.НациональнаяВалюта.Получить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Номенклатура.Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
	|	КОНЕЦ КАК ЗапасНаименование,
	|	РасходнаяНакладнаяЗапасы.Характеристика,
	|	ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Содержание КАК СТРОКА(1000)) КАК Содержание,
	|	РасходнаяНакладнаяЗапасы.Номенклатура.Код КАК ЗапасКод,
	|	РасходнаяНакладнаяЗапасы.Номенклатура.Артикул КАК Артикул,
	|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	РасходнаяНакладнаяЗапасы.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	РасходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	&Цена_Параметр КАК Цена,
	|	СУММА(РасходнаяНакладнаяЗапасы.Количество) КАК Количество,
	|	СУММА(&Сумма_Параметр) КАК Сумма,
	|	СУММА(&СуммаНДС_Параметр) КАК СуммаНДС,
	|	СУММА(&Всего_Параметр) КАК Всего,
	|	МИНИМУМ(РасходнаяНакладнаяЗапасы.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка = &ТекущийДокумент
	|	И (НЕ РасходнаяНакладнаяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяЗапасы.Номенклатура,
	|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения,
	|	РасходнаяНакладнаяЗапасы.СтавкаНДС,
	|	&Цена_Параметр,
	|	РасходнаяНакладнаяЗапасы.Характеристика,
	|	ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Содержание КАК СТРОКА(1000)),
	|	РасходнаяНакладнаяЗапасы.Номенклатура.Код,
	|	РасходнаяНакладнаяЗапасы.Номенклатура.Артикул,
	|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения.Наименование,
	|	РасходнаяНакладнаяЗапасы.Номенклатура.ЕдиницаИзмерения.Код,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Номенклатура.Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Если ИспользоватьПересчет Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Цена_Параметр", 		"Выразить(РасходнаяНакладнаяЗапасы.Цена * &Курс / &Кратность КАК Число(15,2))");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Сумма_Параметр", 	"Выразить(РасходнаяНакладнаяЗапасы.Сумма * &Курс / &Кратность КАК Число(15,2))");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаНДС_Параметр", 	"Выразить(РасходнаяНакладнаяЗапасы.СуммаНДС * &Курс / &Кратность КАК Число(15,2))");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Всего_Параметр", 	"Выразить(РасходнаяНакладнаяЗапасы.Всего * &Курс / &Кратность КАК Число(15,2))");
		
		Запрос.УстановитьПараметр("Курс",		Шапка.Курс);
		Запрос.УстановитьПараметр("Кратность",	Шапка.Кратность);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Цена_Параметр", 		"РасходнаяНакладнаяЗапасы.Цена");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Сумма_Параметр", 	"РасходнаяНакладнаяЗапасы.Сумма");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаНДС_Параметр", 	"РасходнаяНакладнаяЗапасы.СуммаНДС");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Всего_Параметр", 	"РасходнаяНакладнаяЗапасы.Всего");
		
	КонецЕсли;
	
	ВыборкаСтрокЗапасы = Запрос.Выполнить().Выбрать();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РасходнаяНакладная.ПФ_MXL_М15");
	
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента, , Шапка.БанковскийСчет);
	СведенияОГрузополучателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.ДатаДокумента, , Шапка.БанковскийСчетКонтрагента);
	
	ОбластьМакетаШапка.Параметры.Заполнить(Шапка);
	
	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
	
	ОбластьМакетаШапка.Параметры.НомерДокумента = НомерДокумента;
	ОбластьМакетаШапка.Параметры.ДатаДокумента = Шапка.ДатаДокумента;
	ОбластьМакетаШапка.Параметры.ПредставлениеОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации);
	ОбластьМакетаШапка.Параметры.КонтрагентНаименование = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОГрузополучателе,"ПолноеНаименование,");
	ОбластьМакетаШапка.Параметры.ОрганизацияПоОКПО = СведенияОбОрганизации.КодПоОКПО;
	
	ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
	
	// Выводим заголовок таблицы
	ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
	
	НомерСтраницы = 1;
	НомерСтроки = 0;
	КоличествоСтрок = ВыборкаСтрокЗапасы.Количество();
	
	// Инициализация итогов в документе
	ИтогоСуммаБезНДС = 0;
	ИтогоСуммаНДС = 0;
	ИтогоВсегоСНДС = 0;
	
	// Создаем массив для проверки вывода
	МассивВыводимыхОбластей = Новый Массив;
	
	// Выводим многострочную часть докмента
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		// Проверим вывод
		СтрокаСПодвалом = Новый Массив;
		Если НомерСтроки = 1 Тогда
			СтрокаСПодвалом.Добавить(ОбластьМакетаЗаголовокТаблицы); // если первая строка, то должен
		КонецЕсли;                                                   // помещаться заголовок
		СтрокаСПодвалом.Добавить(ОбластьМакетаСтрока);
		Если НомерСтроки = КоличествоСтрок Тогда           // если последняя строка, должен
			СтрокаСПодвалом.Добавить(ОбластьМакетаПодвал); // помещаться и подвал документа
		КонецЕсли;
		
		Если НомерСтроки <> 1 И НЕ ТабличныйДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда
			
			// Выведем заголовок таблицы
			НомерСтраницы	= НомерСтраницы + 1;
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ОбластьМакетаЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
			ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
			
		КонецЕсли;
		
		ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтрокЗапасы);
		
		Если ЗначениеЗаполнено(ВыборкаСтрокЗапасы.Содержание) Тогда
			ОбластьМакетаСтрока.Параметры.ЗапасНаименование = ВыборкаСтрокЗапасы.Содержание;
		Иначе
			ОбластьМакетаСтрока.Параметры.ЗапасНаименование = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаСтрокЗапасы.ЗапасНаименование, 
																ВыборкаСтрокЗапасы.Характеристика, ВыборкаСтрокЗапасы.Артикул);
		КонецЕсли;
		
		СуммаСНДС	= ВыборкаСтрокЗапасы.Всего;
		СуммаНДС	= ВыборкаСтрокЗапасы.СуммаНДС;
		СуммаБезНДС = ВыборкаСтрокЗапасы.Сумма - ?(Шапка.СуммаВключаетНДС, ВыборкаСтрокЗапасы.СуммаНДС, 0);
		
		Количество = ВыборкаСтрокЗапасы.Количество;
		Цена = СуммаБезНДС / Количество;
		
		ОбластьМакетаСтрока.Параметры.Количество = Количество;
		ОбластьМакетаСтрока.Параметры.СуммаСНДС = СуммаСНДС;
		ОбластьМакетаСтрока.Параметры.СуммаБезНДС = СуммаБезНДС;
		ОбластьМакетаСтрока.Параметры.СуммаНДС = СуммаНДС;
		ОбластьМакетаСтрока.Параметры.Цена = Цена;
		
		ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
		
		ИтогоСуммаБезНДС = ИтогоСуммаБезНДС + СуммаБезНДС;
		ИтогоСуммаНДС = ИтогоСуммаНДС + СуммаНДС;
		ИтогоВсегоСНДС = ИтогоВсегоСНДС + СуммаСНДС;
		
	КонецЦикла;
	
	// Выводим подвал документа
	ОбластьМакетаПодвал.Параметры.Заполнить(Шапка);
	
	ОбластьМакетаПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(НомерСтроки, "НП=Ложь", ",,,,,,,,0");
	ОбластьМакетаПодвал.Параметры.СуммаПрописью = ЧислоПрописью(ИтогоВсегоСНДС, "НП=Ложь", ",,,,,,,,0");
	ОбластьМакетаПодвал.Параметры.КопейкиСуммы = (ИтогоВсегоСНДС - Цел(ИтогоВсегоСНДС)) * 100;
	ОбластьМакетаПодвал.Параметры.ИтогоСуммаНДС = Цел(ИтогоСуммаНДС);
	ОбластьМакетаПодвал.Параметры.КопейкиСуммыНДС = (ИтогоСуммаНДС - Цел(ИтогоСуммаНДС)) * 100;
	
	ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
	
КонецПроцедуры

// Процедура формирования печатной формы Бланк товарного наполнения
//
Процедура СформироватьБланкТоварногоНаполнения(ТабличныйДокумент, ТекущийДокумент)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Дата КАК ДатаДокумента,
	|	РасходнаяНакладная.Номер КАК Номер,
	|	РасходнаяНакладная.Организация.Префикс КАК Префикс,
	|	РасходнаяНакладная.СтруктурнаяЕдиница КАК ПредставлениеСклада,
	|	РасходнаяНакладная.Ячейка КАК ПредставлениеЯчейки,
	|	РасходнаяНакладная.Запасы.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура.Склад КАК Склад,
	|		Номенклатура.Ячейка КАК Ячейка,
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(РасходнаяНакладная.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
	|				ТОГДА РасходнаяНакладная.Запасы.Номенклатура.Наименование
	|			ИНАЧЕ РасходнаяНакладная.Запасы.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Запас,
	|		Содержание КАК Содержание,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура.Код КАК Код,
	|		ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		Характеристика,
	|		Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|		КлючСвязи
	|	),
	|	РасходнаяНакладная.СерийныеНомера.(
	|		СерийныйНомер,
	|		КлючСвязи
	|	)
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
	ВыборкаСтрокСерийныеНомера = Шапка.СерийныеНомера.Выбрать();
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасходнаяНакладная_БланкТоварногоНаполнения";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РасходнаяНакладная.ПФ_MXL_БланкТоварногоНаполнения");
	
	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "Расходная накладная № "
											+ НомерДокумента
											+ " от "
											+ Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
											
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Склад");
	ОбластьМакета.Параметры.ПредставлениеСклада = Шапка.ПредставлениеСклада;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если Константы.ФункциональнаяОпцияУчетПоЯчейкам.Получить() Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейка");
		ОбластьМакета.Параметры.ПредставлениеЯчейки = Шапка.ПредставлениеЯчейки;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ВремяПечати");
	ОбластьМакета.Параметры.ВремяПечати = "Дата и время печати: "
										 	+ ТекущаяДата()
											+ ". Пользователь: "
											+ Пользователи.ТекущийПользователь();
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		
		Если НЕ ВыборкаСтрокЗапасы.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
			Продолжить;
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
		
		Если ЗначениеЗаполнено(ВыборкаСтрокЗапасы.Содержание) Тогда
			
			ОбластьМакета.Параметры.Запас = ВыборкаСтрокЗапасы.Содержание;
			
		Иначе
			
			СтрокаСерийныеНомера = РаботаССерийнымиНомерами.СтрокаСерийныеНомераИзВыборки(ВыборкаСтрокСерийныеНомера, ВыборкаСтрокЗапасы.КлючСвязи);
			ОбластьМакета.Параметры.Запас = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаСтрокЗапасы.Запас, 
				ВыборкаСтрокЗапасы.Характеристика, ВыборкаСтрокЗапасы.Артикул, СтрокаСерийныеНомера);
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры

//Паганини_

Функция НапечататьInvoice(МассивОбъектов, ОбъектыПечати)

	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Invoice";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплату_Invoice";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяЗапасы.Ссылка КАК Документ,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Дата КАК Дата,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Номер КАК Номер,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Организация.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.Наименование
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Организация.НаименованиеПолное
		|	КОНЕЦ КАК Продавец,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.Наименование
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.НаименованиеПолное
		|	КОНЕЦ КАК Покупатель,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
		|	РасходнаяНакладнаяЗапасы.Ссылка.СуммаДокумента КАК Сумма,
		|	РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
		|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Номенклатура.Наименование
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное
		|	КОНЕЦ КАК Номенклатура,
		|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
		|	РасходнаяНакладнаяЗапасы.Количество КАК Количество,
		|	РасходнаяНакладнаяЗапасы.Цена КАК Цена,
		|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС,
		|	РасходнаяНакладнаяЗапасы.Всего КАК Всего,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.НомерСчета КАК БанковскийСчет,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Код КАК БанкКод,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Наименование КАК Банк,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ИНН КАК ПокупательИНН,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ИНН КАК ПродавецИНН,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Ответственный.Физлицо КАК Ответственный,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлЛоготип КАК ФайлЛоготип,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлФаксимильнаяПечать КАК ФайлФаксимильнаяПечать,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлПечати КАК ФайлПечати,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо КАК Руководитель
		|ИЗ
		|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
		|ГДЕ
		|	РасходнаяНакладнаяЗапасы.Ссылка В(&МассивОбъектов)
		|ИТОГИ
		|	МАКСИМУМ(Продавец),
		|	МАКСИМУМ(Покупатель),
		|	КОЛИЧЕСТВО(НомерСтроки),
		|	СУММА(СуммаНДС),
		|	СУММА(Всего),
		|	МАКСИМУМ(БанковскийСчет)
		|ПО
		|	Документ";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		МакетПечатнойФормы	= УправлениеПечатью.МакетПечатнойФормы("Общиймакет.ПФ_MXL_Invoice");//ПолучитьМакет("ПФ_MXL_Invoice");
		
		// Вывод шапки для документа
		ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка");
		ОбластьШапки.Параметры.Заполнить(ВыборкаДокумент);
		Попытка
			ОбластьШапки.Параметры.Дата	= Формат(ВыборкаДокумент.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлЛоготип) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлЛоготип);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьШапки.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапки);
				
		// Вывод таблицной части
		ВыборкаДанныхДокумента = ВыборкаДокумент.Выбрать();
		ОбластьСтрока = МакетПечатнойФормы.ПолучитьОбласть("ТабличаяЧасть");
		Пока ВыборкаДанныхДокумента.Следующий() Цикл 
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДанныхДокумента);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		// Вывод подвала для документа
		ОбластьПодвал = МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(ВыборкаДокумент);
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлФаксимильнаяПечать) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлФаксимильнаяПечать);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Факсимилия.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлПечати) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлПечати);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.Руководитель) Тогда
			Попытка
				ОбластьПодвал.Параметры.Руководитель = РС_ОбщегоНазначения.ПолучитьФИОФизЛиц(ВыборкаДокумент.Руководитель, ВыборкаДокумент.Дата);
			Исключение
			КонецПопытки;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокумент.Документ);   
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции//_Паганини    

Функция НапечататьInvoiceGeoNew(МассивОбъектов, ОбъектыПечати)

	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_InvoiceGeoNew";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_РасходнаяНакладная_InvoiceGeoNew";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяЗапасы.Ссылка КАК Документ,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Дата КАК Дата,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Номер КАК Номер,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Организация.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.Наименование
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Организация.НаименованиеПолное
		|	КОНЕЦ КАК Продавец,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.Наименование
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.НаименованиеПолное
		|	КОНЕЦ КАК Покупатель,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
		|	РасходнаяНакладнаяЗапасы.Ссылка.СуммаДокумента КАК Сумма,
		|	РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
		|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Номенклатура.Наименование
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное
		|	КОНЕЦ КАК Номенклатура,
		|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
		|	РасходнаяНакладнаяЗапасы.Количество КАК Количество,
		|	РасходнаяНакладнаяЗапасы.Цена КАК Цена,
		|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС,
		|	РасходнаяНакладнаяЗапасы.Всего КАК Всего,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.НомерСчета КАК БанковскийСчет,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Код КАК БанкКод,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Наименование КАК Банк,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ИНН КАК ПокупательИНН,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ИНН КАК ПродавецИНН,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Ответственный.Физлицо КАК Ответственный,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлЛоготип КАК ФайлЛоготип,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлФаксимильнаяПечать КАК ФайлФаксимильнаяПечать,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлПечати КАК ФайлПечати,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо КАК Руководитель
		|ИЗ
		|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
		|ГДЕ
		|	РасходнаяНакладнаяЗапасы.Ссылка В(&МассивОбъектов)
		|ИТОГИ
		|	МАКСИМУМ(Продавец),
		|	МАКСИМУМ(Покупатель),
		|	КОЛИЧЕСТВО(НомерСтроки),
		|	СУММА(СуммаНДС),
		|	СУММА(Всего),
		|	МАКСИМУМ(БанковскийСчет)
		|ПО
		|	Документ";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		МакетПечатнойФормы	= УправлениеПечатью.МакетПечатнойФормы("Документ.РасходнаяНакладная.ПФ_MXL_InvoiceGeoNew");
		
		// Вывод шапки для документа
		ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка");
		ОбластьШапки.Параметры.Заполнить(ВыборкаДокумент);
		Попытка
			ОбластьШапки.Параметры.Дата	= Формат(ВыборкаДокумент.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлЛоготип) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлЛоготип);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьШапки.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапки);
				
		// Вывод таблицной части
		ВыборкаДанныхДокумента = ВыборкаДокумент.Выбрать();
		ОбластьСтрока = МакетПечатнойФормы.ПолучитьОбласть("ТабличаяЧасть");
		Пока ВыборкаДанныхДокумента.Следующий() Цикл 
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДанныхДокумента);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		// Вывод подвала для документа
		ОбластьПодвал = МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(ВыборкаДокумент);
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлФаксимильнаяПечать) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлФаксимильнаяПечать);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Факсимилия.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлПечати) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлПечати);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.Руководитель) Тогда
			Попытка
				ОбластьПодвал.Параметры.Руководитель = РС_ОбщегоНазначения.ПолучитьФИОФизЛиц(ВыборкаДокумент.Руководитель, ВыборкаДокумент.Дата);
			Исключение
			КонецПопытки;
		КонецЕсли;            
		
		ОбластьПодвал.Параметры.Ответственный = ВыборкаДокумент.Документ.Ответственный; 
		ОбластьПодвал.Параметры.Аддрес = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(ВыборкаДокумент.Документ.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
        ОбластьПодвал.Параметры.Mail = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(ОбластьПодвал.Параметры.Ответственный.Физлицо, Справочники.ВидыКонтактнойИнформации.EmailФизическиеЛица);
		//ОбластьПодвал.Параметры.Тел1 = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(ОбластьПодвал.Параметры.Ответственный.Физлицо, Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);
			
		ПараметрыОтбора = Новый Структура("Вид",Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);	
		ДанныеОтбора = ОбластьПодвал.Параметры.Ответственный.Физлицо.КонтактнаяИнформация.Выгрузить(ПараметрыОтбора); 	
		Если ДанныеОтбора.количество() = 1 Тогда  	
			ОбластьПодвал.Параметры.Тел1 = ДанныеОтбора[0].Представление;
		ИначеЕсли  ДанныеОтбора.количество() > 1 Тогда
			ОбластьПодвал.Параметры.Тел1 = ДанныеОтбора[0].Представление;
			ОбластьПодвал.Параметры.Тел = "ტელ:";	
			ОбластьПодвал.Параметры.Тел2 = ДанныеОтбора[1].Представление;	
		КонецЕсли; 
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокумент.Документ);   
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Сформировать печатные формы объектов
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	Перем Ошибки;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "Накладная" ИЛИ ИмяМакета = "НакладнаяСУслугами" Тогда
			
			ИсключаяУслуги = (ИмяМакета = "Накладная");
			СформироватьНакладную(ТабличныйДокумент, ТекущийДокумент, ИсключаяУслуги);
			
		ИначеЕсли ИмяМакета = "УниверсальныйПередаточныйДокумент" Тогда
			
			СформироватьУниверсальныйПередаточныйДокумент(ТабличныйДокумент, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "НакладнаяШтрихКод" Тогда
			
			СформироватьНакладнуюШтрихКод(ТабличныйДокумент, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "ГарантийныйТалон" Тогда
			
			РаботаСНоменклатуройСервер.СформироватьГарантийныеТалоныДокумента(ТабличныйДокумент, ТекущийДокумент, Ошибки);
			
		ИначеЕсли ИмяМакета = "М15" Тогда
			
			СформироватьМ15(ТабличныйДокумент, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "ТоварныйЧек" Тогда
			
			СформироватьТоварныйЧек(ТабличныйДокумент, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "БланкТоварногоНаполнения" Тогда
			
			СформироватьБланкТоварногоНаполнения(ТабличныйДокумент, ТекущийДокумент);
			
		КонецЕсли;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Перем Ошибки;
		
	//++Lazare 30.05.2023	
	Если ЕстЗапретПечати(МассивОбъектов) Тогда 	
		Сообщить(НСтр("ru = 'Запрешено печат непреоведених документов!'; ka = 'აკრძალულია გაუტარებელი დოკუმენტების ბეჭვდვა!'"));
		Возврат;
	КонецЕсли;
	//--Lazare 30.05.2023	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная", "Расходная накладная", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "Накладная"));
		
	КонецЕсли;
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяШтрихКод") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НакладнаяШтрихКод", "Расходная накладная (Штрих код)", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "НакладнаяШтрихКод"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяСУслугами") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НакладнаяСУслугами", "Расходная накладная (с услугами)", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "НакладнаяСУслугами"));
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ТОРГ12");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьТОРГ12.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьТОРГ12.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьТОРГ12.ПредставлениеПФ();
		
		ДанныеОбъектовПечати = ДанныеДокументовТОРГ12(МассивОбъектов);
		Обработки.ПечатьТОРГ12.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати, Ложь);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ТОРГ12СУслугами");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьТОРГ12.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьТОРГ12.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьТОРГ12.ПредставлениеПФ(Истина);
		
		ДанныеОбъектовПечати = ДанныеДокументовТОРГ12(МассивОбъектов);
		Обработки.ПечатьТОРГ12.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати, Истина);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, Обработки.ПечатьАктПередачиПрав.ИдентификаторПечатнойФормы());
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьАктПередачиПрав.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьАктПередачиПрав.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьАктПередачиПрав.ПредставлениеПФ();
		
		ДанныеОбъектовПечати = ДанныеДокументовТОРГ12(МассивОбъектов);
		Обработки.ПечатьАктПередачиПрав.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УниверсальныйПередаточныйДокумент") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "УниверсальныйПередаточныйДокумент", "Универсальный передаточный документ", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "УниверсальныйПередаточныйДокумент"));
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктОбОказанииУслуг");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьАктаОбОказанииУслуг.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьАктаОбОказанииУслуг.ПолныйПутьКМакету(Ложь);
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьАктаОбОказанииУслуг.ПредставлениеПФ();
		
		ДанныеОбъектовПечати = ДанныеДокументовАктОбОказанииУслуг(МассивОбъектов);
		Обработки.ПечатьАктаОбОказанииУслуг.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати, Ложь);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М15") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "М15", "М15 (Накладная на отпуск материалов)", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "М15"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТТН", "1-Т (Товарно-транспортная накладная)", Обработки.ПечатьТТН.ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТоварныйЧек") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТоварныйЧек", "Товарный чек", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ТоварныйЧек"));
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "СчетНаОплату");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьСчетНаОплату.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьСчетНаОплату.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьСчетНаОплату.ПредставлениеПФ(Ложь);
		
		ДанныеОбъектовПечати = УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов);
		УчестьОсобенностиФормированияСчетаОплату(ДанныеОбъектовПечати);
		Обработки.ПечатьСчетНаОплату.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати, Ложь);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "СчетНаОплатуСФаксимиле");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьСчетНаОплату.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьСчетНаОплату.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьСчетНаОплату.ПредставлениеПФ(Ложь, Истина);
		
		ДанныеОбъектовПечати = УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов, Истина);
		УчестьОсобенностиФормированияСчетаОплату(ДанныеОбъектовПечати);
		Обработки.ПечатьСчетНаОплату.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати, Ложь);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ГарантийныйТалон") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ГарантийныйТалон", "Гарантийный талон", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ГарантийныйТалон"));
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "БланкТоварногоНаполнения");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьБланкТоварногоНаполнения.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьБланкТоварногоНаполнения.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьБланкТоварногоНаполнения.ПредставлениеПФ();
		
		ДанныеОбъектовПечати = УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов);
		Обработки.ПечатьБланкТоварногоНаполнения.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура") Тогда
		
		МассивСчетФактур = Новый Массив;
		Для каждого ОбъектПечати Из МассивОбъектов Цикл
			
			СтруктураДанных = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйСчетФактуру(ОбъектПечати, Ложь);
			Если СтруктураДанных =  Неопределено Тогда
				
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетФактура", "Счет-фактура", Новый ТабличныйДокумент);
				
				ТекстСообщения = Нстр("ka='__________________"
"დოკუმენტი %1."
"ანგარიშფაქტურა არ არის ჩამოყალიბებული.';ru='__________________"
"Документ %1."
"Счет-фактура не сформирована.'");
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ОбъектПечати);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , ТекстСообщения, Неопределено);
				
			Иначе
				
				МассивСчетФактур.Добавить(СтруктураДанных.Ссылка);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивСчетФактур.Количество() > 0 Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетФактура", "Счет-фактура", Документы.СчетФактура.ПечатнаяФорма(МассивСчетФактур, ОбъектыПечати, Ложь));
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Паганини_
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Invoice Geo") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Invoice Geo", "Invoice Geo", НапечататьInvoice(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	//_Паганини    
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Invoice Geo New") Тогда	
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Invoice Geo New", "Invoice Geo New", НапечататьInvoiceGeoNew(МассивОбъектов, ОбъектыПечати));	
	КонецЕсли;
	
	//T
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Invoice Eng") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Invoice Eng", "Invoice Eng", НапечататьInvoiceEng(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
	//T
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Invoice GeoC") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Invoice GeoC", "Invoice GeoC", НапечататьInvoiceGeoC(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
	
	
	//N
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Invoice Rus") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Invoice Rus", "Invoice Rus", НапечататьInvoiceRus(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;

	//Rajak
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Печать Годность") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Печать Годность", "Печать Годность", печатьГодность(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Печать Товарный Чек") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Печать Товарный Чек", "Печать Товарный Чек", Документы.ЧекККМ.ПечатнаяФорма(МассивОбъектов, ОбъектыПечати,""));
		
	КонецЕсли;
	//Rajak


	Если Ошибки <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	ЗначениеИдентификатора = "АктОбОказанииУслуг,ТОРГ12,ТОРГ12СУслугами,%1,М15,ТТН,СчетФактура,Накладная,НакладнаяСУслугами,СчетНаОплату,ГарантийныйТалон,БланкТоварногоНаполнения";
	ЗначениеИдентификатора = СтрШаблон(ЗначениеИдентификатора, Обработки.ПечатьАктПередачиПрав.ИдентификаторПечатнойФормы());
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСерийныеНомера") Тогда
		
		ЗначениеИдентификатора = СтрЗаменить(ЗначениеИдентификатора, ",ГарантийныйТалон", "");
		
	КонецЕсли;
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = ЗначениеИдентификатора;
	КомандаПечати.Представление = НСтр("ka='Настраиваемый комплект документов';ru='Настраиваемый комплект документов';en='Customizable set of documents'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктОбОказанииУслуг";
	КомандаПечати.Представление = Обработки.ПечатьАктаОбОказанииУслуг.ПредставлениеПФ(Ложь);
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 4;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = Обработки.ПечатьАктПередачиПрав.ИдентификаторПечатнойФормы();
	КомандаПечати.Представление = Обработки.ПечатьАктПередачиПрав.ПредставлениеПФ();
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 7;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТОРГ12";
	КомандаПечати.Представление = Обработки.ПечатьТОРГ12.ПредставлениеПФ(Ложь);
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 10;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТОРГ12СУслугами";
	КомандаПечати.Представление = Обработки.ПечатьТОРГ12.ПредставлениеПФ(Истина);
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 14;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "М15";
	КомандаПечати.Представление = НСтр("ka='M15 (ზედნადები მასალების გასაცემად)';ru='М15 (Накладная на отпуск материалов)';en='M15 (invoices for materials leave)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 17;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТТН";
	КомандаПечати.Представление = НСтр("ka='1-Т (სატრანსპორტო-სასაქონლო ზედნადები)';ru='1-Т (Товарно-транспортная накладная)';en='1-T (bill of lading)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 20;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеНебольшойФирмойКлиент.ПечатьТН";
	КомандаПечати.Идентификатор = "ТН";
	КомандаПечати.Представление = НСтр("ka='დანართი #4 (სასაქონლო ზედანდები';ru='Приложение №4 (Товарная накладная)';en='Appendix №4 (invoices)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 23;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеНебольшойФирмойКлиент.ПечатьУПД";
	КомандаПечати.Идентификатор = "УниверсальныйПередаточныйДокумент";
	КомандаПечати.Представление = НСтр("ka='უნივერსალური გადასაცემი დოკუმენტი';ru='Универсальный передаточный документ';en='Universal transfer document'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 26;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетФактура";
	КомандаПечати.Представление = НСтр("en='Invoice';ka='Счет-фактура';ru='Счет-фактура'");
	КомандаПечати.ФункциональныеОпции = "ПередачаТоваровНаКомиссию,ПриемТоваровНаКомиссию,ИспользуетсяОСНО,ИспользоватьСчетаФактурыИсходящие";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 29;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Накладная";
	КомандаПечати.Представление = НСтр("en='Sales Invoice';ka='გასავლის ზედდებული';ru='Расходная накладная'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 32;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "НакладнаяСУслугами";
	КомандаПечати.Представление = НСтр("ka='გასავლის ზედნადები (მომსახურებებთან ერთად)';ru='Расходная накладная (с услугами)';en='Sales Invoice (with services)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 35;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетНаОплату";
	КомандаПечати.Представление = Обработки.ПечатьСчетНаОплату.ПредставлениеПФ(Ложь, Ложь);
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПредложитьЗаполнитьРеквизитыОрганизации";
	КомандаПечати.Порядок = 38;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетНаОплатуСФаксимиле";
	КомандаПечати.Представление = Обработки.ПечатьСчетНаОплату.ПредставлениеПФ(Ложь, Истина);
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПредложитьЗаполнитьРеквизитыОрганизации";
	КомандаПечати.Порядок = 38;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТоварныйЧек";
	КомандаПечати.Представление = НСтр("ka='სასაქონლო ჩეკი';ru='Товарный чек';en='Sales receipt'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 41;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ГарантийныйТалон";
	КомандаПечати.Представление = НСтр("ka='საგარანტიო ტალონი';ru='Гарантийный талон';en='warranty card'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.ФункциональныеОпции = "ИспользоватьСерийныеНомера";
	КомандаПечати.Порядок = 44;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "БланкТоварногоНаполнения";
	КомандаПечати.Представление = Обработки.ПечатьБланкТоварногоНаполнения.ПредставлениеПФ();
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 47;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Конверт";
	КомандаПечати.Представление = НСтр("ka='კონვერტი';ru='Конверт';en='The envelope'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПечатьКонверта";
	КомандаПечати.Порядок = 50;
	
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "НакладнаяШтрихКод";
	КомандаПечати.Представление 					= НСтр("ka='გასავლის ზედდებული(შტრიხ კოდით)';ru='Расходная Накладная (ШтрихКод)';en='Invoice (barcode)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок 	                        = 55;

	
	//Паганини_
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "Invoice Geo";
	КомандаПечати.Представление 					= "Invoice Geo";
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок 							= 51;
	//_Паганини             
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "Invoice Geo New";
	КомандаПечати.Представление 					= "Invoice Geo New";
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок                           = 51;
	
	//T
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "Invoice Eng";
	КомандаПечати.Представление 					= "Invoice Eng";
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок 							= 51;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "Invoice GeoC";
	КомандаПечати.Представление 					= "Invoice GeoC";
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок 							= 51;


	//N
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "Invoice Rus";
	КомандаПечати.Представление 					= "Invoice Rus";
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок 							= 51;
	
	//Rajak
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "Печать Годность";
	КомандаПечати.Представление 					= "ვარგისიანობა";
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок 							= 52;

	//Rajak
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "Печать Товарный Чек";
	КомандаПечати.Представление 					= "სასაქონლო ჩეკის ბეჭდვა";
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок 							= 52;
	
КонецПроцедуры


//T
Функция НапечататьInvoiceEng(МассивОбъектов, ОбъектыПечати)
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_InvoiceEng";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплату_InvoiceEng";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.Ссылка КАК Документ,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Дата КАК Дата,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Организация.НаименованиеАнглийское КАК СТРОКА(100))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.Наименование
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Организация.НаименованиеАнглийское
	|	КОНЕЦ КАК Продавец,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(100))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.Наименование
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.НаименованиеПолное
	|	КОНЕЦ КАК Покупатель,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
	|	РасходнаяНакладнаяЗапасы.Ссылка.СуммаДокумента КАК Сумма,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
	|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Номенклатура.Наименование
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
	|	РасходнаяНакладнаяЗапасы.Количество КАК Количество,
	|	РасходнаяНакладнаяЗапасы.Цена КАК Цена,
	|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС,
	|	РасходнаяНакладнаяЗапасы.Всего КАК Всего,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.НомерСчета КАК БанковскийСчет,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Код КАК БанкКод,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.НаименованиеАнглиское КАК СТРОКА(100))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Наименование
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.НаименованиеАнглиское
	|	КОНЕЦ КАК Банк,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ИНН КАК ПокупательИНН,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ИНН КАК ПродавецИНН,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Ответственный.Физлицо КАК Ответственный,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлЛоготип КАК ФайлЛоготип,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлФаксимильнаяПечать КАК ФайлФаксимильнаяПечать,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлПечати КАК ФайлПечати,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо.НаименованиеАнглиское КАК СТРОКА(100))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо.НаименованиеАнглиское
	|	КОНЕЦ КАК Руководитель
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка В(&МассивОбъектов)
	|ИТОГИ
	|	МАКСИМУМ(Продавец),
	|	МАКСИМУМ(Покупатель),
	|	КОЛИЧЕСТВО(НомерСтроки),
	|	СУММА(СуммаНДС),
	|	СУММА(Всего),
	|	МАКСИМУМ(БанковскийСчет)
	|ПО
	|	Документ";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		МакетПечатнойФормы	= УправлениеПечатью.МакетПечатнойФормы("Документ.РасходнаяНакладная.ПФ_MXL_InvoiceEng");//ПолучитьМакет("ПФ_MXL_Invoice");
		
		// Вывод шапки для документа
		ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка");
		ОбластьШапки.Параметры.Заполнить(ВыборкаДокумент);
		Попытка
			ОбластьШапки.Параметры.Дата	= Формат(ВыборкаДокумент.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлЛоготип) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлЛоготип);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьШапки.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		// Вывод таблицной части
		ВыборкаДанныхДокумента = ВыборкаДокумент.Выбрать();
		ОбластьСтрока = МакетПечатнойФормы.ПолучитьОбласть("ТабличаяЧасть");
		Пока ВыборкаДанныхДокумента.Следующий() Цикл 
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДанныхДокумента);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		// Вывод подвала для документа
		ОбластьПодвал = МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(ВыборкаДокумент);
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлФаксимильнаяПечать) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлФаксимильнаяПечать);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Факсимилия.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлПечати) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлПечати);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.Руководитель) Тогда
			Попытка
				ОбластьПодвал.Параметры.Руководитель = ВыборкаДокумент.Руководитель;
			Исключение
			КонецПопытки;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокумент.Документ);   
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция НапечататьInvoiceGeoC(МассивОбъектов, ОбъектыПечати)
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_InvoiceGeoC";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплату_InvoiceGeoC";
	ТабличныйДокумент.АвтоМасштаб			= ложь;
	ТабличныйДокумент.МасштабПечати			= 85;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ЮрАдресОрганизации КАК ЮрАдресОрганизации,
	|	ВложенныйЗапрос.EmailОрганизации КАК EmailОрганизации,
	|	ВложенныйЗапрос.ТелефонОрганизации КАК ТелефонОрганизации,
	|	ВложенныйЗапросКонтрагента.ЮрАдресКонтрагента КАК ЮрАдресКонтрагента,
	|	ВложенныйЗапросКонтрагента.EmailКонтрагента КАК EmailКонтрагента,
	|	ВложенныйЗапросКонтрагента.ТелефонКонтрагента КАК ТелефонКонтрагента,
	|	РасходнаяНакладнаяЗапасы.Ссылка КАК Документ,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Дата КАК Дата,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Организация.НаименованиеПолное КАК СТРОКА(100))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.Наименование
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Организация.НаименованиеПолное
	|	КОНЕЦ КАК Продавец,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.Наименование КАК Покупатель,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
	|	РасходнаяНакладнаяЗапасы.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
	|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
	|			ТОГДА РасходнаяНакладнаяЗапасы.Номенклатура.Наименование
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
	|	РасходнаяНакладнаяЗапасы.Количество КАК Количество,
	|	РасходнаяНакладнаяЗапасы.Всего КАК Всего,
	|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС,
	|	РасходнаяНакладнаяЗапасы.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.БанковскийСчет.НомерСчета ЕСТЬ NULL
	|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.НомерСчета
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.БанковскийСчет.НомерСчета
	|	КОНЕЦ КАК БанковскийСчет,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.БанковскийСчет.Банк.Код ЕСТЬ NULL
	|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Код
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.БанковскийСчет.Банк.Код
	|	КОНЕЦ КАК БанкКод,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.БанковскийСчет.Наименование ЕСТЬ NULL
	|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Наименование
	|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.БанковскийСчет.Наименование
	|	КОНЕЦ КАК Банк,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ИНН КАК ПокупательИНН,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ИНН КАК ПродавецИНН,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Ответственный.Физлицо КАК Ответственный,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлЛоготип КАК ФайлЛоготип,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлФаксимильнаяПечать КАК ФайлФаксимильнаяПечать,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлПечати КАК ФайлПечати,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо КАК Руководитель,
	|	РасходнаяНакладнаяЗапасы.Номенклатура.ОсновнойШтрихКод КАК НоменклатураОсновнойШтрихКод,
	|	РасходнаяНакладнаяЗапасы.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РасходнаяНакладнаяЗапасы.Цена * РасходнаяНакладнаяЗапасы.Количество КАК СуммаБезСкидки,
	|	РасходнаяНакладнаяЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Ссылка КАК ДокументСсылка,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ДополнительныйРеквизитБанка.Банк КАК ДопКод,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ДополнительныйРеквизитБанка.НомерСчета КАК ДопНомерСчета,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ДополнительныйРеквизитБанка.Наименование КАК ДопНаименование,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ДополнительныйРеквизитБанка1.Банк КАК ДопКод1,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ДополнительныйРеквизитБанка1.Наименование КАК ДопНаименование1,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ДополнительныйРеквизитБанка1.НомерСчета КАК ДопНомерСчета1,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ДополнительныйРеквизитБанка2.Банк КАК ДопКод2,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ДополнительныйРеквизитБанка2.Наименование КАК ДопНаименование2,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ДополнительныйРеквизитБанка2.НомерСчета КАК ДопНомерСчета2,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ДополнительныйРеквизитБанка3.Банк КАК ДопКод3,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ДополнительныйРеквизитБанка3.Наименование КАК ДопНаименование3,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ДополнительныйРеквизитБанка3.НомерСчета КАК ДопНомерСчета3,
	|	РасходнаяНакладнаяЗапасы.Сумма КАК Сумма
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
	|						ТОГДА ОрганизацииКонтактнаяИнформация.Представление
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ЮрАдресОрганизации,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации)
	|						ТОГДА ОрганизацииКонтактнаяИнформация.Представление
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК EmailОрганизации,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации)
	|						ТОГДА ОрганизацииКонтактнаяИнформация.Представление
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ТелефонОрганизации
	|		ИЗ
	|			Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОрганизацииКонтактнаяИнформация.Ссылка) КАК ВложенныйЗапрос
	|		ПО (ВложенныйЗапрос.Ссылка = РасходнаяНакладнаяЗапасы.Ссылка.Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|						ТОГДА КонтрагентыКонтактнаяИнформация.Представление
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ЮрАдресКонтрагента,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|						ТОГДА КонтрагентыКонтактнаяИнформация.Представление
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК EmailКонтрагента,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|						ТОГДА КонтрагентыКонтактнаяИнформация.Представление
	|					ИНАЧЕ """"
	|				КОНЕЦ) КАК ТелефонКонтрагента
	|		ИЗ
	|			Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		
	|		СГРУППИРОВАТЬ ПО
	|			КонтрагентыКонтактнаяИнформация.Ссылка) КАК ВложенныйЗапросКонтрагента
	|		ПО (ВложенныйЗапросКонтрагента.Ссылка = РасходнаяНакладнаяЗапасы.Ссылка.Контрагент)
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка В(&МассивОбъектов)
	|ИТОГИ
	|	МАКСИМУМ(ЮрАдресОрганизации),
	|	МАКСИМУМ(ЮрАдресКонтрагента),
	|	МАКСИМУМ(EmailОрганизации),
	|	МАКСИМУМ(EmailКонтрагента),
	|	МАКСИМУМ(ТелефонОрганизации),
	|	МАКСИМУМ(ТелефонКонтрагента),
	|	СУММА(Всего),
	|	СУММА(СуммаНДС),
	|	МАКСИМУМ(БанковскийСчет),
	|	МАКСИМУМ(ПокупательИНН),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураОсновнойШтрихКод),
	|	СУММА(ПроцентАвтоматическойСкидки),
	|	МАКСИМУМ(ЕдиницаИзмерения),
	|	СУММА(ПроцентСкидкиНаценки)
	|ПО
	|	Документ";         
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	
	Пока ВыборкаДокумент.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		МакетПечатнойФормы	= УправлениеПечатью.МакетПечатнойФормы("Документ.РасходнаяНакладная.ПФ_MXL_InvoiceGeoC");//ПолучитьМакет("ПФ_MXL_InvoiceGeoC");
		
		
		ВыводитьСкидки =  ВыборкаДокумент.ПроцентСкидкиНаценки <> 0 ИЛИ ВыборкаДокумент.ПроцентАвтоматическойСкидки <> 0;
		
		Если ВыводитьСкидки Тогда
			ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("ШапкаСкидки");
		Иначе	
			ОбластьШапки= МакетПечатнойФормы.ПолучитьОбласть("Шапка");
		КонецЕсли;
		ОбластьШапки.Параметры.Заполнить(ВыборкаДокумент);
		Попытка
			ОбластьШапки.Параметры.Дата	= Формат(ВыборкаДокумент.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		
		
		// Вывод таблицной части
		ВыборкаДанныхДокумента = ВыборкаДокумент.Выбрать();
		
		
		
		// Вывод шапки для документа
		//ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка|Основная");
		//ОбластьСумма = МакетПечатнойФормы.ПолучитьОбласть("Сумма");
		//ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка");
		ОбластьШапки.Параметры.Заполнить(ВыборкаДокумент);
		//ОбластьСумма.Параметры.Заполнить(ВыборкаДокумент);
		
		Попытка              
			ОбластьШапки.Параметры.Дата	= Формат(ВыборкаДокумент.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлЛоготип) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлЛоготип);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Если ВыводитьСкидки Тогда
					Попытка
						ОбластьШапки.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
					Исключение
					КонецПопытки;
				Иначе
					Попытка
						ОбластьШапки.Рисунки.Лого1.Картинка = Новый Картинка(ДанныеКартинки);
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		//ВыводитьСкидки = ВыборкаДокумент.ПроцентАвтоматическойСкидки <> 0;
		//
		//Если ВыводитьСкидки Тогда
		//	
		//	ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка|Основная");
		//	ОбластьШапки.Параметры.Заполнить(ВыборкаДокумент);
		//	ТабличныйДокумент.Вывести(ОбластьШапки);
		//	
		//	
		//КонецЕсли;	
		//	
		
		
		// Вывод таблицной части
		ВыборкаДанныхДокумента = ВыборкаДокумент.Выбрать();
		
		Если ВыводитьСкидки Тогда
			ОбластьСтрока = МакетПечатнойФормы.ПолучитьОбласть("ТабличаяЧастьСкидки");
		Иначе	
			ОбластьСтрока = МакетПечатнойФормы.ПолучитьОбласть("ТабличаяЧасть");
		КонецЕсли;
		
		Пока ВыборкаДанныхДокумента.Следующий() Цикл 
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДанныхДокумента);
			Если ВыводитьСкидки Тогда
				ОбластьСтрока.Параметры.ПроцентАвтоматическойСкидки = Строка(ВыборкаДанныхДокумента.ПроцентСкидкиНаценки+ВыборкаДанныхДокумента.ПроцентАвтоматическойСкидки) + "%";
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		// Вывод подвала для документа
		//ОбластьПодвал = МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		//ОбластьПодвал.Параметры.Заполнить(ВыборкаДокумент);
		
		ОбластьПодвалСумма = МакетПечатнойФормы.ПолучитьОбласть("ПодвалСумма");
		ОбластьПодвалСумма.Параметры.Заполнить(ВыборкаДокумент);
		ОбластьПодвалСумма.Параметры.СуммаВстроке = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ВыборкаДокумент.СуммаДокумента, ВыборкаДокумент.Валюта);
		
		ТабличныйДокумент.Вывести(ОбластьПодвалСумма);
		
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	РасходнаяНакладнаяРеквизитиБанка.БанковскийСчет.Код КАК ДопКод,
		//	|	РасходнаяНакладнаяРеквизитиБанка.БанковскийСчет.Банк КАК ДопБанк,
		//	|	РасходнаяНакладнаяРеквизитиБанка.БанковскийСчет.НомерСчета КАК ДопНомерСчета,
		//	|	РасходнаяНакладнаяРеквизитиБанка.Ссылка КАК Ссылка1,
		//	|	РасходнаяНакладнаяРеквизитиБанка.Ссылка.Ссылка КАК Ссылка2
		//	|ИЗ
		//	|	Документ.РасходнаяНакладная.РеквизитиБанка КАК РасходнаяНакладнаяРеквизитиБанка";
		//
		////Запрос.УстановитьПараметр("Ссылка", ВыборкаДокумент.ДокументСсылка);
		//
		//Результат = Запрос.Выполнить();
		//
		//ВыборкаДоп = Результат.Выбрать();
		//
		//Пока ВыборкаДоп.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДокумент.ДопКоД) Тогда
			ОбластьПодвалРеквизитов = МакетПечатнойФормы.ПолучитьОбласть("ПодвалРеквизитов");
			ОбластьПодвалРеквизитов.Параметры.Заполнить(ВыборкаДокумент);
			ТабличныйДокумент.Вывести(ОбластьПодвалРеквизитов);
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ДопКоД1) Тогда
			ОбластьПодвалРеквизитов1 = МакетПечатнойФормы.ПолучитьОбласть("ПодвалРеквизитов1");
			ОбластьПодвалРеквизитов1.Параметры.Заполнить(ВыборкаДокумент);
			ТабличныйДокумент.Вывести(ОбластьПодвалРеквизитов1);
			
		КонецЕсли;
		
		
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ДопКоД2) Тогда
			ОбластьПодвалРеквизитов2 = МакетПечатнойФормы.ПолучитьОбласть("ПодвалРеквизитов2");
			ОбластьПодвалРеквизитов2.Параметры.Заполнить(ВыборкаДокумент);
			ТабличныйДокумент.Вывести(ОбластьПодвалРеквизитов2);
		КонецЕсли;
		
		
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ДопКоД3) Тогда
			ОбластьПодвалРеквизитов3 = МакетПечатнойФормы.ПолучитьОбласть("ПодвалРеквизитов3");
			ОбластьПодвалРеквизитов3.Параметры.Заполнить(ВыборкаДокумент);
			ТабличныйДокумент.Вывести(ОбластьПодвалРеквизитов3);
		КонецЕсли;
		
		
		
		
		ОбластьПодвалРуководитель = МакетПечатнойФормы.ПолучитьОбласть("ПодвалРуководитель");
		ОбластьПодвалРуководитель.Параметры.Заполнить(ВыборкаДокумент);
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлФаксимильнаяПечать) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлФаксимильнаяПечать);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвалРуководитель.Рисунки.Факсимилия.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		//Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлПечати) Тогда
		//	ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлПечати);
		//	Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
		//		Попытка
		//			ОбластьПодвалРуководитель.Рисунки.Печать.Картинка = Новый Картинка(ДанныеКартинки);
		//		Исключение
		//		КонецПопытки;
		//	КонецЕсли;
		//КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.Руководитель) Тогда
			Попытка
				ОбластьПодвалРуководитель.Параметры.Руководитель = РС_ОбщегоНазначения.ПолучитьФИОФизЛиц(ВыборкаДокумент.Руководитель, ВыборкаДокумент.Дата);
			Исключение
			КонецПопытки;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПодвалРуководитель);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокумент.Документ);   
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция  печатьГодность(МассивОбъектов, ОбъектыПечати)Экспорт
	// Вставить содержимое обработчика.
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ОбработкаСобранныхЗаказов.Макет_печатьГодность");
	ТабличныйДокумент = Новый ТабличныйДокумент; 	
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_печатьГодность";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ОбработкаСобранныхЗаказов_печатьГодность";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	 ПервыйДокумент = Истина;
	
	//TODO
	
	
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗагаловокТабличнойЧасти = Макет.ПолучитьОбласть("ЗагаловокТабличнойЧасти");
	ОбластьТабличнаяЧасть = Макет.ПолучитьОбласть("ТабличнаяЧасть");	
	//ПримерСтруктуры = Новый Структура("Номенклатура, Количество, Единицаизмирения", "reg.ru", "www.craft1c.ru", 2019);
	
	
	
	Для Каждого Документ Из МассивОбъектов Цикл 
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		Дата = Формат(Документ.Ссылка.Дата, "ДФ=dd.MM.yyyy"); 
		Изгатовлено = Формат(Документ.Ссылка.Дата - 24*60*60,"ДФ=dd.MM.yyyy");
		ОбластьШапки.Параметры.Дата =Дата;
		ОбластьШапки.Параметры.Номер = Документ.Номер;
		ОбластьШапки.Параметры.Организация = Документ.Организация;
		ОбластьШапки.Параметры.ИннОрганизации = Документ.Организация.ИНН;
		ОбластьШапки.Параметры.Контрагент = Документ.Контрагент;
		ОбластьШапки.Параметры.ИннКонтрагента = Документ.Контрагент.ИНН;
		ОбластьШапки.Параметры.Контрагент = Документ.Контрагент;
		ОбластьШапки.Параметры.Договор = Документ.Договор;
		ОбластьШапки.Параметры.АдресДоговор = Документ.Договор.Адрес;
		
		
		ЛоготипЗаполнен = ЗначениеЗаполнено(Документ.Организация.ФайлЛоготип);
		Если ЛоготипЗаполнен Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(Документ.Организация.ФайлЛоготип);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				ОбластьШапки.Рисунки.Логотип.Картинка = Новый Картинка(ДанныеКартинки);
			КонецЕсли;
		КонецЕсли;
		
		
		
		
		//ОбластьШапки.Параметры.Склад = склад;
		ТабличныйДокумент.Вывести(ОбластьШапки);
		ТабличныйДокумент.Вывести(ОбластьЗагаловокТабличнойЧасти);
		
		//	МассивЗаказов = СписокПеремещений.Добавить();
		//Выгрузить().;
		//
		//
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
		//|	СУММА(ЗаказПокупателяЗапасы.Количество) КАК Количество,
		//|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения
		//|ИЗ
		//|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		//|ГДЕ
		//|	ЗаказПокупателяЗапасы.Ссылка В(&МассивЗаказов)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЗаказПокупателяЗапасы.Номенклатура,
		//|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения";
		//
		//Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
		//
		//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		//
		//
		номерСтроки = 0;
		
		Для Каждого стр Из Документ.Запасы Цикл 
			номерСтроки  = номерСтроки + 1;
			ОбластьТабличнаяЧасть.Параметры.НомерСтроки = номерСтроки;
			ОбластьТабличнаяЧасть.Параметры.Номенклатура = стр.Номенклатура;
			ОбластьТабличнаяЧасть.Параметры.Количество = стр.Количество;
			ОбластьТабличнаяЧасть.Параметры.Изгатовлено = Изгатовлено;
			Годен = Дата(Изгатовлено + " 00:00:00") + Число(стр.Номенклатура.СрокИсполненияЗаказа)*(24*60*60);
			ОбластьТабличнаяЧасть.Параметры.Годен = Формат(Годен,"ДФ=dd.MM.yyyy");
			
			ТабличныйДокумент.Вывести(ОбластьТабличнаяЧасть);	
		КонецЦикла;
		
	КонецЦикла;
	
	//ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	//КонецЦикла;
	Возврат ТабличныйДокумент;
	
КонецФункции

//Т
Процедура СформироватьНакладнуюШтрихКод(ТабличныйДокумент, ТекущийДокумент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Дата КАК ДатаДокумента,
	|	РасходнаяНакладная.Организация КАК Организация,
	|	РасходнаяНакладная.Контрагент КАК Контрагент,
	|	РасходнаяНакладная.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	РасходнаяНакладная.ВалютаДокумента КАК ВалютаДокумента,
	|	РасходнаяНакладная.Номер,
	|	РасходнаяНакладная.Организация.Префикс КАК Префикс,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|			ТОГДА ""(მყიდველისთვის მიყიდვა)""
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|			ТОГДА ""(Передача на комиссию)""
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)
	|			ТОГДА ""(Передача в переработку)""
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение)
	|			ТОГДА ""(Передача контрагенту на ответственное хранение)""
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|			ТОГДА ""(მომწოდებლისთვის დაბრუნება)""
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|			ТОГДА ""(Возврат комитенту)""
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
	|			ТОГДА ""(Возврат контрагенту из переработки)""
	|		КОГДА РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ""(Возврат контрагенту с ответственного хранения)""
	|	КОНЕЦ КАК ВидОперации,
	|	РасходнаяНакладная.ПодписьКладовщика.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщика,
	|	РасходнаяНакладная.КонтактноеЛицоПодписант.Наименование КАК РасшифровкаПодписиКонтрагента,
	|	РасходнаяНакладная.НоменклатураДоставки,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладная.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			ТОГДА РасходнаяНакладная.НоменклатураДоставки.Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(РасходнаяНакладная.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000))
	|	КОНЕЦ КАК ЗапасДоставки,
	|	РасходнаяНакладная.НоменклатураДоставки.Код КАК КодДоставки,
	|	РасходнаяНакладная.НоменклатураДоставки.Артикул КАК АртикулДоставки,
	|	РасходнаяНакладная.НоменклатураДоставки.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДоставки,
	|	РасходнаяНакладная.СтоимостьДоставки,
	|	РасходнаяНакладная.СуммаНДСДоставки,
	|	РасходнаяНакладная.Запасы.(
	|		НомерСтроки КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(РасходнаяНакладная.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
	|				ТОГДА РасходнаяНакладная.Запасы.Номенклатура.Наименование
	|			ИНАЧЕ РасходнаяНакладная.Запасы.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Запас,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура.Код КАК Код,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		СуммаНДС,
	|		Всего,
	|		Характеристика,
	|		Партия,
	|		Содержание,
	|		ПроцентСкидкиНаценки,
	|		ВЫБОР
	|			КОГДА РасходнаяНакладная.Запасы.ПроцентСкидкиНаценки <> 0
	|					ИЛИ РасходнаяНакладная.Запасы.СуммаАвтоматическойСкидки <> 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЕстьСкидка,
	|		Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|		СуммаАвтоматическойСкидки,
	|		КлючСвязи,
	|		Номенклатура.ОсновнойШтрихКод КАК ШтрихКод 
	|	),
	|	РасходнаяНакладная.СерийныеНомера.(
	|		СерийныйНомер,
	|		КлючСвязи
	|	)
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ПечататьДоставку = ЗначениеЗаполнено(Шапка.НоменклатураДоставки);
	
	ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
	ВыборкаСтрокСерийныеНомера = Шапка.СерийныеНомера.Выбрать();
	
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасходнаяНакладная_НакладнаяШтрихКод";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РасходнаяНакладная.ПФ_MXL_НакладнаяШтрихКод");
	СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента, ,);
	СведенияОбКонтрагенте = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.ДатаДокумента, ,);
	
	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "გასავლის ზედნადები № "
											+ НомерДокумента
											+ "       "
											+ Формат(Шапка.ДатаДокумента, "Л=ka; ДЛФ=D");
											
	ОбластьМакета.Параметры.ВидОперации = Шапка.ВидОперации;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.ПредставлениеПоставщика = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ФактическийАдрес");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.ПредставлениеПолучателя = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбКонтрагенте, "ПолноеНаименование,ФактическийАдрес");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ЕстьСкидки = Шапка.Запасы.Выгрузить().Итог("ЕстьСкидка") <> 0;

	Если ЕстьСкидки Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаСоСкидкой");
		
	Иначе
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
	КонецЕсли;
	
	Сумма		= 0;
	СуммаНДС	= 0;
	Всего		= 0;
	Количество	= 0;
	
	ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
	Пока ЕстьДанныеДляВывода ИЛИ ПечататьДоставку Цикл
	
		Если ПечататьДоставку И НЕ ЕстьДанныеДляВывода Тогда
			ПечататьДоставку = Ложь;
			ДанныеСтроки = ДоставкаСервер.ДанныеПечатиДоставки(Шапка);
		Иначе
			ДанныеСтроки = ВыборкаСтрокЗапасы;
		КонецЕсли; 
		
		//Если ИсключаяУслуги И ДанныеСтроки.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
		//	ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
		//	Продолжить;
		//КонецЕсли; 
		
		ОбластьМакета.Параметры.Заполнить(ДанныеСтроки);
		Если ЗначениеЗаполнено(ДанныеСтроки.Содержание) Тогда
			
			ОбластьМакета.Параметры.Запас = ДанныеСтроки.Содержание;
			
		Иначе
			
			СтрокаСерийныеНомера = РаботаССерийнымиНомерами.СтрокаСерийныеНомераИзВыборки(ВыборкаСтрокСерийныеНомера, ДанныеСтроки.КлючСвязи);
			ПредставлениеЗапаса = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(ДанныеСтроки.Запас, 
				ДанныеСтроки.Характеристика, ДанныеСтроки.Артикул, СтрокаСерийныеНомера);
				
			Если ЗначениеЗаполнено(ДанныеСтроки.Партия) Тогда
				
				ПредставлениеЗапаса = ПредставлениеЗапаса + "; " + Строка(ДанныеСтроки.Партия);
				
			КонецЕсли;
			
			ОбластьМакета.Параметры.Запас = ПредставлениеЗапаса;
			
		КонецЕсли;
			
		Если ЕстьСкидки Тогда
			Если ДанныеСтроки.ПроцентСкидкиНаценки = 100 Тогда
				Скидка = ДанныеСтроки.Цена * ДанныеСтроки.Количество;
				ОбластьМакета.Параметры.Скидка         = Скидка;
				ОбластьМакета.Параметры.СуммаБезСкидки = Скидка;
			ИначеЕсли ДанныеСтроки.ПроцентСкидкиНаценки = 0 И ДанныеСтроки.СуммаАвтоматическойСкидки = 0 Тогда
				ОбластьМакета.Параметры.Скидка         = 0;
				ОбластьМакета.Параметры.СуммаБезСкидки = ДанныеСтроки.Сумма;
			Иначе
				Скидка = ДанныеСтроки.Количество * ДанныеСтроки.Цена - ДанныеСтроки.Сумма; // АвтоматическиеСкидки
				ОбластьМакета.Параметры.Скидка         = Скидка;
				ОбластьМакета.Параметры.СуммаБезСкидки = ДанныеСтроки.Сумма + Скидка;
			КонецЕсли;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Сумма		= Сумма		+ ДанныеСтроки.Сумма;
		СуммаНДС	= СуммаНДС	+ ДанныеСтроки.СуммаНДС;
		Всего		= Всего		+ ДанныеСтроки.Всего;
		Количество	= Количество+ 1;
		
		ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Всего = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
	Если СуммаНДС = 0 Тогда
		ОбластьМакета.Параметры.НДС = "Без налога (НДС)";
		ОбластьМакета.Параметры.ВсегоНДС = "-";
	Иначе
		ОбластьМакета.Параметры.НДС = ?(Шапка.СуммаВключаетНДС, "მათ შორის დღგ:", "Сумма НДС:");
		ОбластьМакета.Параметры.ВсегоНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаНДС);
	КонецЕсли; 
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	СуммаКПрописи = Всего;
	ОбластьМакета.Параметры.ИтоговаяСтрока = "რაოდენობა "
											+ Строка(Количество)
											+ ",  ჯამი "
											+ УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента);
	
	ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента);
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры // СформироватьНакладную()

//N
Функция НапечататьInvoiceRus(МассивОбъектов, ОбъектыПечати)

	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_InvoiceRus";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплату_InvoiceRus";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяЗапасы.Ссылка КАК Документ,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Дата КАК Дата,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Номер КАК Номер,
		|	ВЫБОР
		|		КОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.НаименованиеРуское = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.Наименование
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Организация.НаименованиеРуское
		|	КОНЕЦ КАК Продавец,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.Наименование
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.НаименованиеПолное
		|	КОНЕЦ КАК Покупатель,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
		|	РасходнаяНакладнаяЗапасы.Ссылка.СуммаДокумента КАК Сумма,
		|	РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
		|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Номенклатура.Наименование
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Номенклатура.НаименованиеПолное
		|	КОНЕЦ КАК Номенклатура,
		|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
		|	РасходнаяНакладнаяЗапасы.Количество КАК Количество,
		|	РасходнаяНакладнаяЗапасы.Цена КАК Цена,
		|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС,
		|	РасходнаяНакладнаяЗапасы.Всего КАК Всего,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.НомерСчета КАК БанковскийСчет,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Код КАК БанкКод,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.НаименованиеРуское КАК СТРОКА(100))) = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Наименование
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.НаименованиеРуское
		|	КОНЕЦ КАК Банк,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.ИНН КАК ПокупательИНН,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ИНН КАК ПродавецИНН,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Ответственный.Физлицо КАК Ответственный,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлЛоготип КАК ФайлЛоготип,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлФаксимильнаяПечать КАК ФайлФаксимильнаяПечать,
		|	РасходнаяНакладнаяЗапасы.Ссылка.Организация.ФайлПечати КАК ФайлПечати,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(РасходнаяНакладнаяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо.НаименованиеРуское КАК СТРОКА(100))) = """"
		|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо.НаименованиеРуское
		|	КОНЕЦ КАК Руководитель
		|ИЗ
		|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
		|ГДЕ
		|	РасходнаяНакладнаяЗапасы.Ссылка В(&МассивОбъектов)
		|ИТОГИ
		|	МАКСИМУМ(Продавец),
		|	МАКСИМУМ(Покупатель),
		|	КОЛИЧЕСТВО(НомерСтроки),
		|	СУММА(СуммаНДС),
		|	СУММА(Всего),
		|	МАКСИМУМ(БанковскийСчет)
		|ПО
		|	Документ";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		МакетПечатнойФормы	= УправлениеПечатью.МакетПечатнойФормы("Документ.РасходнаяНакладная.ПФ_MXL_InvoiceRus");//ПолучитьМакет("ПФ_MXL_Invoice");
		
		// Вывод шапки для документа
		ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка");
		ОбластьШапки.Параметры.Заполнить(ВыборкаДокумент);
		Попытка
			ОбластьШапки.Параметры.Дата	= Формат(ВыборкаДокумент.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлЛоготип) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлЛоготип);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьШапки.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапки);
				
		// Вывод таблицной части
		ВыборкаДанныхДокумента = ВыборкаДокумент.Выбрать();
		ОбластьСтрока = МакетПечатнойФормы.ПолучитьОбласть("ТабличаяЧасть");
		Пока ВыборкаДанныхДокумента.Следующий() Цикл 
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДанныхДокумента);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		// Вывод подвала для документа
		ОбластьПодвал = МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(ВыборкаДокумент);
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлФаксимильнаяПечать) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлФаксимильнаяПечать);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Факсимилия.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлПечати) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлПечати);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.Руководитель) Тогда
			Попытка
				ОбластьПодвал.Параметры.Руководитель = ВыборкаДокумент.Руководитель;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокумент.Документ);   
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#Область ШаблоныСообщений

// Вызывается при подготовке шаблонов сообщений и позволяет переопределить список реквизитов и вложений.
//
// Параметры:
//  Реквизиты               - ДеревоЗначений - список реквизитов шаблона.
//         ** Имя            - Строка - Уникальное имя общего реквизита.
//         ** Представление  - Строка - Представление общего реквизита.
//         ** Тип            - Тип    - Тип реквизита. По умолчанию строка.
//         ** Формат         - Строка - Формат вывода значения для чисел, дат, строк и булевых значений.
//  Вложения                - ТаблицаЗначений - печатные формы и вложения
//         ** Имя            - Строка - Уникальное имя вложения.
//         ** Представление  - Строка - Представление варианта.
//         ** ТипФайла       - Строка - Тип вложения, который соответствует расширению файла: "pdf", "png", "jpg", mxl" и др.
//  ДополнительныеПараметры - Структура - дополнительные сведения о шаблоне сообщений.
//
Процедура ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// Вызывается в момент создания сообщений по шаблону для заполнения значений реквизитов и вложений.
//
// Параметры:
//  Сообщение - Структура - структура с ключами:
//    * ЗначенияРеквизитов - Соответствие - список используемых в шаблоне реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * ЗначенияОбщихРеквизитов - Соответствие - список используемых в шаблоне общих реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * Вложения - Соответствие - значения реквизитов 
//      ** Ключ     - Строка - имя вложения в шаблоне;
//      ** Значение - ДвоичныеДанные, Строка - двоичные данные или адрес во временном хранилище вложения.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект являющийся источником данных.
//  ДополнительныеПараметры - Структура -  Дополнительная информация о шаблоне сообщения.
//
Процедура ПриФормированииСообщения(Сообщение, ПредметСообщения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// Заполняет список получателей SMS при отправке сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиSMS - ТаблицаЗначений - список получается SMS.
//     * НомерТелефона - Строка - номер телефона, куда будет отправлено сообщение SMS.
//     * Представление - Строка - представление получателя сообщения SMS.
//     * Контакт       - Произвольный - контакт, которому принадлежит номер телефона.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.//
//
Процедура ПриЗаполненииТелефоновПолучателейВСообщении(ПолучателиSMS, ПредметСообщения) Экспорт
	
КонецПроцедуры

// Заполняет список получателей письма при отправки сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиПисьма - ТаблицаЗначений - список получается письма.
//     * Адрес           - Строка - адрес электронной почты получателя.
//     * Представление   - Строка - представление получается письма.
//     * Контакт         - Произвольный - контакт, которому принадлежит адрес электрнной почты.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//                                              если шаблон содержит произвольные параметры:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.
//
Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, ПредметСообщения) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли

Функция ЕстЗапретПечати(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная,
	|	Константа.ЗапретПечатиНепроведенныхРасходнихНакладних КАК ЗапретПечатиНепроведенныхРасходнихНакладних
	|ГДЕ
	|	РасходнаяНакладная.Ссылка В(&МассивОбъектов)
	|	И РасходнаяНакладная.Проведен = ЛОЖЬ
	|	И ЗапретПечатиНепроведенныхРасходнихНакладних.Значение = ИСТИНА";
	
	Запрос.УстановитьПараметр("МассивОбъектов",МассивОбъектов);
	
	РезултатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезултатЗапроса.Количество() > 0 Тогда  
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
#Область Потери_при_сушке_GermanButcher

Процедура СформироватьТаблицаУсушкa_СобранныеPаказы(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	ТаблицаУсушкa_СобранныеPаказы = Новый ТаблицаЗначений();
	Если ПолучитьФункционалРезервированияЗаказов() И Константы_German_Butcher_Получить() Тогда	
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МИНИМУМ(ТаблицаЗаказыПокупателей.НомерСтроки) КАК НомерСтроки,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ТаблицаЗаказыПокупателей.Период КАК Период,
		|	ТаблицаЗаказыПокупателей.Организация КАК Организация,
		|	ТаблицаЗаказыПокупателей.Номенклатура КАК Номенклатура,
		|	ТаблицаЗаказыПокупателей.Характеристика КАК Характеристика,
		|	ТаблицаЗаказыПокупателей.Заказ КАК ЗаказПокупателя,
		|	СУММА(ТаблицаЗаказыПокупателей.Количество) КАК КоличествоСобрNET,
		|	СУММА(ТаблицаЗаказыПокупателей.Количество+ТаблицаЗаказыПокупателей.КоличествоСобрПотери) КАК КоличествоСобр
		|ИЗ
		|	ВременнаяТаблицаЗапасы КАК ТаблицаЗаказыПокупателей
		|ГДЕ
		|	ТаблицаЗаказыПокупателей.Заказ <> НЕОПРЕДЕЛЕНО
		|	И (ТаблицаЗаказыПокупателей.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
		|			ИЛИ ТаблицаЗаказыПокупателей.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
		|			ИЛИ ТаблицаЗаказыПокупателей.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение))
		|	И НЕ ТаблицаЗаказыПокупателей.КоличествоСобрПотери = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЗаказыПокупателей.Период,
		|	ТаблицаЗаказыПокупателей.Организация,
		|	ТаблицаЗаказыПокупателей.Номенклатура,
		|	ТаблицаЗаказыПокупателей.Характеристика,
		|	ТаблицаЗаказыПокупателей.Заказ
		|";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТаблицаУсушкa_СобранныеPаказы = РезультатЗапроса.Выгрузить();
	
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУсушкa_СобранныеPаказы", ТаблицаУсушкa_СобранныеPаказы);
КонецПроцедуры

Функция ПолучитьФункционалРезервированияЗаказов()
	Возврат Константы.ФункционалСбораТоваров.Получить();
КонецФункции

Функция Константы_German_Butcher_Получить()
	Возврат Константы.German_Butcher.Получить();
КонецФункции 
#КонецОбласти
// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010

//--------------------------------------------------------------------------
// © Шишка В.В. [21 января 2022]  НАЧАЛО
Функция ПолучитьОткорректированнуюТаблицуСуммПродажи(СсылкаНаДокумент) Экспорт

	Если СсылкаНаДокумент.Проведен Тогда
		
		Запрос = Новый Запрос;
		
		Если ПолучитьФункциональнуюОпцию("ФункциональнаяОпцияТипЦеныНоменклатурыПоКоличеству") Тогда 
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
			|	РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика, //+++ Дмгг
			|	РасходнаяНакладнаяЗапасы.Количество КАК Количество,
			|	РасходнаяНакладнаяЗапасы.Сумма КАК Сумма,
			|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС,
			|	РасходнаяНакладнаяЗапасы.Себестоимость КАК Себестоимость,
			|	РасходнаяНакладнаяЗапасы.Цена КАК Цена,
			|	РасходнаяНакладнаяЗапасы.СуммаНДС / РасходнаяНакладнаяЗапасы.Количество КАК СуммаНДСЕдиницы
			|ИЗ
			|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
			|ГДЕ
			|	РасходнаяНакладнаяЗапасы.Ссылка = &СсылкаНаДокумент";
			
		Иначе
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПродажиОбороты.Номенклатура КАК Номенклатура,
			|	ПродажиОбороты.Характеристика КАК Характеристика, //+++ Дмгг
			|	СУММА(ПродажиОбороты.КоличествоОборот) КАК Количество,
			|	СУММА(ПродажиОбороты.СуммаОборот) КАК Сумма,
			|	СУММА(ПродажиОбороты.СуммаНДСОборот) КАК СуммаНДС,
			|	СУММА(ПродажиОбороты.СебестоимостьОборот) КАК Себестоимость,
			|	ВЫБОР
			|		КОГДА СУММА(ПродажиОбороты.КоличествоОборот) = 0
			|			ТОГДА 0
			|		ИНАЧЕ СУММА(ПродажиОбороты.СуммаОборот) / СУММА(ПродажиОбороты.КоличествоОборот)
			|	КОНЕЦ КАК Цена,
			|	ВЫБОР
			|		КОГДА СУММА(ПродажиОбороты.КоличествоОборот) = 0
			|			ТОГДА 0
			|		ИНАЧЕ СУММА(ПродажиОбороты.СуммаНДСОборот) / СУММА(ПродажиОбороты.КоличествоОборот)
			|	КОНЕЦ КАК СуммаНДСЕдиницы
			|ИЗ
			|	РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
			|ГДЕ
			|	ПродажиОбороты.Регистратор = &СсылкаНаДокумент
			|
			|СГРУППИРОВАТЬ ПО
			//+++ Дмгг
			//|	ПродажиОбороты.Номенклатура";
			|	ПродажиОбороты.Номенклатура,
			|	ПродажиОбороты.Характеристика";
			//--- Дмгг
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
		
		//Возврат Запрос.Выполнить().Выгрузить();
		Возврат ПолучитьТаблицуЦенДляОткорректированнойТаблицыСуммПродаж(СсылкаНаДокумент,Запрос.Выполнить().Выгрузить()); // Kuzmich, 04.03.2022, Ошибки при расчете цены для разных единиц измерения.
	
	КонецЕсли; 
	
	ДополнительныеСвойстваРеализации = Новый Структура("Модифицированность, РежимЗаписи, ЭтоПолучениеТаблицыПродаж", Ложь, РежимЗаписиДокумента.Проведение, Истина); 
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(СсылкаНаДокумент, ДополнительныеСвойстваРеализации);
	
	Если СсылкаНаДокумент.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю
		И СсылкаНаДокумент.ВалютаДокумента <> УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("НациональнаяВалюта")
		И СсылкаНаДокумент.СуммаДокумента = СсылкаНаДокумент.Предоплата.Итог("СуммаРасчетов") Тогда 
		
			ДополнительныеСвойстваРеализации.Вставить("ТребуетсяПроверкаИВыравнивание", ИСТИНА);
			
	Иначе
			
		ДополнительныеСвойстваРеализации.Вставить("ТребуетсяПроверкаИВыравнивание", ЛОЖЬ);
		
	КонецЕсли;
	
	// Инициализация данных документа.
	Документы.РасходнаяНакладная.ИнициализироватьДанныеДокумента(СсылкаНаДокумент, ДополнительныеСвойстваРеализации);
	
	ТаблицаПродажи = ДополнительныеСвойстваРеализации.ТаблицыДляДвижений.ТаблицаПродажи.Скопировать();
	ТаблицаПродажи.Свернуть("Номенклатура", "Сумма, СуммаНДС, Себестоимость, Количество");
	//ТаблицаПродажи.Колонки.Добавить("Цена", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2));
	//ТаблицаПродажи.Колонки.Добавить("СуммаНДСЕдиницы", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2));
	//
	//Для каждого ТекСтрока Из ТаблицаПродажи Цикл
	//
	//	ТекСтрока.Цена = ?(ТекСтрока.Количество = 0, 0, ТекСтрока.Сумма / ТекСтрока.Количество);	
	//	ТекСтрока.СуммаНДСЕдиницы = ?(ТекСтрока.Количество = 0, 0, ТекСтрока.СуммаНДС / ТекСтрока.Количество);
	//
	//КонецЦикла; 
	//
	//Возврат ТаблицаПродажи;
	
	Возврат ПолучитьТаблицуЦенДляОткорректированнойТаблицыСуммПродаж(СсылкаНаДокумент,ТаблицаПродажи); // Kuzmich, 04.03.2022, Ошибки при расчете цены для разных единиц измерения.

КонецФункции // ПолучитьОткорректированнуюТаблицуСуммПродажи()

// Kuzmich, 04.03.2022, Ошибки при расчете цены для разных единиц измерения.
Функция ПолучитьТаблицуЦенДляОткорректированнойТаблицыСуммПродаж(СсылкаНаДокумент,ТаблицаПродажи)
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ТаблицаПродажи.СкопироватьКолонки();
	Если РЕЗ.Колонки.Найти("Цена")=НЕОПРЕДЕЛЕНО Тогда
		РЕЗ.Колонки.Добавить("Цена", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 4));
	КонецЕсли;
	Если РЕЗ.Колонки.Найти("СуммаНДСЕдиницы")=НЕОПРЕДЕЛЕНО Тогда
		РЕЗ.Колонки.Добавить("СуммаНДСЕдиницы", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2));
	КонецЕсли;
	РЕЗ.Колонки.Добавить("ЕдиницаИзмерения");
	РЕЗ.Колонки.Добавить("СуммаПоДокументу", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(10, 3));
	
	ТаблицаЗапасыДокумента = СсылкаНаДокумент.Запасы.Выгрузить();
	
	Для каждого ТекСтрока Из ТаблицаПродажи Цикл
	
		СуммаПоДокументу=0;
		СтруктураПоискаНоменклатуры = Новый Структура("Номенклатура", ТекСтрока.Номенклатура);
		МассивСтрокЗапасы = ТаблицаЗапасыДокумента.НайтиСтроки(СтруктураПоискаНоменклатуры);
		Для каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			СуммаПоДокументу = СуммаПоДокументу + СтрокаЗапасы.Всего;
		КонецЦикла;
		
		Если СуммаПоДокументу>0 Тогда
			
			Для каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
				
				КоэффициентЕдиницыИзмерения = 1;
				
				Если ЗначениеЗаполнено(СтрокаЗапасы.ЕдиницаИзмерения) Тогда
					Если ТипЗНЧ(СтрокаЗапасы.ЕдиницаИзмерения)=Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
						КоэффициентЕдиницыИзмерения = СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент;
					КонецЕсли;
				КонецЕсли;
				
				СтрокаТаблицаЦен = РЕЗ.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаЦен,ТекСтрока);
				
				ТекущийКоэффициент = СтрокаЗапасы.Всего / СуммаПоДокументу;
				
				СтрокаТаблицаЦен.Цена = ?(ТекСтрока.Количество = 0, 0, ТекСтрока.Сумма / ТекСтрока.Количество) * КоэффициентЕдиницыИзмерения;	
				СтрокаТаблицаЦен.СуммаНДСЕдиницы = ?(ТекСтрока.Количество = 0, 0, ТекСтрока.СуммаНДС * ТекущийКоэффициент / СтрокаЗапасы.Количество);
				СтрокаТаблицаЦен.СуммаНДС = СтрокаТаблицаЦен.СуммаНДС * ТекущийКоэффициент;
				СтрокаТаблицаЦен.СуммаПоДокументу = СтрокаЗапасы.Всего;
				СтрокаТаблицаЦен.ЕдиницаИзмерения = СтрокаЗапасы.ЕдиницаИзмерения;
				
			КонецЦикла;
		
		Иначе
			
			СтрокаТаблицаЦен = РЕЗ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицаЦен,ТекСтрока);
			
			СтрокаТаблицаЦен.Цена = ?(ТекСтрока.Количество = 0, 0, ТекСтрока.Сумма / ТекСтрока.Количество);	
			СтрокаТаблицаЦен.СуммаНДСЕдиницы = ?(ТекСтрока.Количество = 0, 0, ТекСтрока.СуммаНДС / ТекСтрока.Количество);
			СтрокаТаблицаЦен.СуммаПоДокументу = СуммаПоДокументу;
			СтрокаТаблицаЦен.ЕдиницаИзмерения = ТекСтрока.Номенклатура.ЕдиницаИзмерения;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат РЕЗ;
КонецФункции // ()
// Kuzmich, 04.03.2022, Ошибки при расчете цены для разных единиц измерения.
// © Шишка В.В. [21 января 2022]  КОНЕЦ
//--------------------------------------------------------------------------

Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные) Экспорт
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("СтранаПроисхождения", СтруктураДанные.Номенклатура.СтранаПроисхождения);
	СтруктураДанные.Вставить("ЭтоЗапас", СтруктураДанные.Номенклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));
	
	Если СтруктураДанные.Свойство("НалогообложениеНДС") 
		И НЕ СтруктураДанные.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") Тогда
		
		Если СтруктураДанные.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС") Тогда
			СтруктураДанные.Вставить("СтавкаНДС", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС());
		Иначе
			СтруктураДанные.Вставить("СтавкаНДС", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль());
		КонецЕсли;	
																
	ИначеЕсли ЗначениеЗаполнено(СтруктураДанные.Номенклатура.СтавкаНДС) Тогда
		СтруктураДанные.Вставить("СтавкаНДС", СтруктураДанные.Номенклатура.СтавкаНДС);
	Иначе
		СтруктураДанные.Вставить("СтавкаНДС", СтруктураДанные.Организация.СтавкаНДСПоУмолчанию);
	КонецЕсли;	
		
	Если СтруктураДанные.Свойство("ВидЦен") Тогда
		Цена = УправлениеНебольшойФирмойСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
		СтруктураДанные.Вставить("Цена", Цена);
	Иначе
		СтруктураДанные.Вставить("Цена", 0);
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("ВидСкидкиНаценки") 
		И ЗначениеЗаполнено(СтруктураДанные.ВидСкидкиНаценки) Тогда
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", СтруктураДанные.ВидСкидкиНаценки.Процент);
	Иначе	
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", 0);
	КонецЕсли;
		
	Если СтруктураДанные.Свойство("ПроцентСкидкиПоДисконтнойКарте") 
		И ЗначениеЗаполнено(СтруктураДанные.ДисконтнаяКарта) Тогда
		ТекПроцент = СтруктураДанные.ПроцентСкидкиНаценки;
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", ТекПроцент + СтруктураДанные.ПроцентСкидкиПоДисконтнойКарте);
	КонецЕсли;
	
	//Серийные номера
	СтруктураДанные.Вставить("ИспользоватьСерийныеНомера", СтруктураДанные.Номенклатура.ИспользоватьСерийныеНомера);
	//Серийные номера
	
	СтруктураДанные.Вставить("ЭтоАлкогольнаяПродукция", СтруктураДанные.Номенклатура.АлкогольнаяПродукция);
	
	СтруктураДанные.Вставить("ВесЕдиницыТовара", СтруктураДанные.Номенклатура.Вес);
	СтруктураДанные.Вставить("ОбъемЕдиницыТовара", СтруктураДанные.Номенклатура.Объем);
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	СчетУчетаВыручкиОтПродажРегл = СтруктураДанные.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл;
	Если НЕ ЗначениеЗаполнено(СчетУчетаВыручкиОтПродажРегл) Тогда
		СчетУчетаВыручкиОтПродажРегл = Справочники.НаправленияДеятельности.ОсновноеНаправление.СчетУчетаВыручкиОтПродажРегл;
	КонецЕсли;
	СтруктураДанные.Вставить("СчетУчетаВыручкиОтПродажРегл", СчетУчетаВыручкиОтПродажРегл);
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	
	СтруктураДанные.Вставить("НаправлениеДеятельности", СтруктураДанные.Номенклатура.НаправлениеДеятельности); //+++ Дмгг
	
	СтруктураДанные.Вставить("СрокГодности", СтруктураДанные.Номенклатура.СрокГодности); //++Lazare
	
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

