
// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Или 
		 ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДополнительныеРасходы") Или 
		 ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетПереработчика") Тогда
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Автор = ДанныеЗаполнения.Автор;
		ПериодРегистрации = НачалоМесяца(ДанныеЗаполнения.Дата);
		НоваяСтрока = ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//СуммаДокумента = ДокументыОснования.Итог("СуммаДокумента");
	//СуммаНДС = ДокументыОснования.Итог("СуммаНДС");
	Если Аванс Тогда
		ДокументыОснования.Очистить();
		СуммаДокумента	= ДокументыПлатежа.Итог("Сумма");
		СуммаНДС 		= ДокументыПлатежа.Итог("СуммаНДС");
	Иначе
		СуммаДокумента	= 0;
		СуммаНДС 		= 0;
		Для Каждого СтрокаТЧ ИЗ ДокументыОснования Цикл
			Если НЕ ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
				СуммаДокумента 		= СуммаДокумента	+ СтрокаТЧ.СуммаДокумента;
				СуммаНДС 			= СуммаНДС 			+ СтрокаТЧ.СуммаНДС;
			Иначе
				//СуммаДокумента 	= СуммаДокумента	- СтрокаТЧ.СуммаДокумента;
				//СуммаНДС 			= СуммаНДС 			- СтрокаТЧ.СуммаНДС;		
				//Lazare_
				СуммаДокумента 		= СуммаДокумента	+ СтрокаТЧ.СуммаДокумента;  //Сумма возврата минусовое число
				СуммаНДС 			= СуммаНДС 			+ СтрокаТЧ.СуммаНДС;        //НДС возврата минусовое число
				//_Lazare			
			КонецЕсли;
			
			//Lazare_
			Если  ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная")Тогда 
				СсылкаНаОбъект 		= СтрокаТЧ.ДокументОснование.Ссылка ;
				ДокОбъект      		= СсылкаНаОбъект.ПолучитьОбъект();
				ДокОбъект.IDСФ      = Формат(Идентификатор,"ЧГ=0") ;
				ДокОбъект.НомерСФ   = НомерВходящегоДокумента ; 
				ДокОбъект.Записать();
			КонецЕсли;
			//_Lazare
		КонецЦикла;
		ДокументыПлатежа.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Аванс Тогда
		//ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа");
		ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа.Документ");
		ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа.Договор");
		ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа.Сумма");
		ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа.СуммаНДС");
	КонецЕсли;
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.СчетФактураПолученныйГрузия.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьАвансыПолученныхФактур(ДополнительныеСвойства, Движения, Отказ);
	Если ЗначениеЗаполнено(ВидНалога) Тогда // Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
		УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоНалогам(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

