
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеТопливаЗапасов.Ссылка 							КАК Ссылка,
	|	СписаниеТопливаЗапасов.Дата 							КАК Период,
	|	СписаниеТопливаЗапасов.ВидОперации 						КАК ВидОперации,
	|	СписаниеТопливаЗапасов.НаправлениеДеятельности 			КАК НаправлениеДеятельности,
	|	СписаниеТопливаЗапасов.Организация 						КАК Организация,
	|	СписаниеТопливаЗапасов.Подразделение 					КАК Подразделение,
	|	СписаниеТопливаЗапасов.СчетУчетаЗатрат 					КАК СчетУчетаЗатрат,
	|	СписаниеТопливаЗапасов.ПроводитьСДатойДокумента 		КАК ПроводитьСДатойДокумента,
	|	СписаниеТопливаЗапасов.СтруктурнаяЕдиница 				КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.СписаниеТопливаЗапасов КАК СписаниеТопливаЗапасов
	|ГДЕ
	|	СписаниеТопливаЗапасов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеТопливаЗапасовРасходы.Ссылка 							КАК Ссылка,
	|	СписаниеТопливаЗапасовРасходы.Ссылка.Организация 				КАК Организация,
	|	СписаниеТопливаЗапасовРасходы.Ссылка.ПроводитьСДатойДокумента 	КАК ПроводитьСДатойДокумента,
	|	СписаниеТопливаЗапасовРасходы.Ссылка.ВидОперации 				КАК ВидОперации,
	|	СписаниеТопливаЗапасовРасходы.НомерСтроки 						КАК НомерСтроки,
	|	СписаниеТопливаЗапасовРасходы.Дата 								КАК ДатаСписания,
	|	СписаниеТопливаЗапасовРасходы.ВнеоборотныйАктив 				КАК ВнеоборотныйАктив,
	|	СписаниеТопливаЗапасовРасходы.НомерВА 							КАК НомерВА,
	|	СписаниеТопливаЗапасовРасходы.Номенклатура 						КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)			КАК Партия,
	|	СписаниеТопливаЗапасовРасходы.Номенклатура.СчетУчетаЗатрат		КАК СчетУчетаЗатрат,
	|	СписаниеТопливаЗапасовРасходы.Номенклатура.СчетУчетаЗапасов		КАК СчетУчетаЗапасов,
	|	ВЫБОР
	|		КОГДА СписаниеТопливаЗапасовРасходы.Ссылка.ПроводитьСДатойДокумента
	|			ТОГДА СписаниеТопливаЗапасовРасходы.Ссылка.Дата
	|		ИНАЧЕ СписаниеТопливаЗапасовРасходы.Дата
	|	КОНЕЦ КАК Период,
	|	ВЫБОР 
	|		КОГДА СписаниеТопливаЗапасовРасходы.СчетУчетаЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА СписаниеТопливаЗапасовРасходы.Номенклатура.СчетУчетаЗатратРегл
	|		ИНАЧЕ СписаниеТопливаЗапасовРасходы.СчетУчетаЗатрат
	|	КОНЕЦ КАК СчетУчетаЗатратРегл,
	|	СписаниеТопливаЗапасовРасходы.Номенклатура.СчетУчетаЗапасовРегл	КАК СчетУчетаЗапасовРегл,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов 
	|			ТОГДА СписаниеТопливаЗапасовРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета
	|		ИНАЧЕ СписаниеТопливаЗапасовРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчетаУчетаЗатратРегл,
	|	СписаниеТопливаЗапасовРасходы.Характеристика 					КАК Характеристика,
	|	СписаниеТопливаЗапасовРасходы.ЕдиницаИзмерения 					КАК ЕдиницаИзмерения,
	|	СписаниеТопливаЗапасовРасходы.Количество 						КАК Количество,
	|	СписаниеТопливаЗапасовРасходы.ПробегНачало 						КАК ПробегНачало,
	|	СписаниеТопливаЗапасовРасходы.ПробегОкончание 					КАК ПробегОкончание,
	|	СписаниеТопливаЗапасовРасходы.ПробегРазница 					КАК ПробегРазница,
	|	СписаниеТопливаЗапасовРасходы.ПолныйБак 						КАК ПолныйБак,
	|	СписаниеТопливаЗапасовРасходы.СтруктурнаяЕдиница 				КАК СтруктурнаяЕдиница,
	|	СписаниеТопливаЗапасовРасходы.Подразделение 					КАК Подразделение,
	|	СписаниеТопливаЗапасовРасходы.НаправлениеДеятельности 			КАК НаправлениеДеятельности,
	|	&ВалютаУчета													КАК ВалютаУчета,
	|	ВЫБОР
	|		КОГДА СписаниеТопливаЗапасовРасходы.ВнеоборотныйАктив <> ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка)
	|				И ТИПЗНАЧЕНИЯ(СписаниеТопливаЗапасовРасходы.ВнеоборотныйАктив) = ТИП(Справочник.ТранспортныеСредства) 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоТС,    
	
	//Малышев 2024-06-17 ONESOFT-3094(-- Добавим поля для получения остатков
	|	Значение(Документ.ЗаказПокупателя.ПустаяСсылка) как ЗаказПокупателя, 
	|	СписаниеТопливаЗапасовРасходы.СтруктурнаяЕдиница 				КАК СтруктурнаяЕдиницаЗапасов,
	//Малышев 2024-06-17 --)
	
	//+++ Дмгг, 11.02.24, ONESOFT-2827
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)   //Малышев 2024-06-10 ONESOFT-3093 
	|		КОГДА СписаниеТопливаЗапасовРасходы.Проект <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА СписаниеТопливаЗапасовРасходы.Ссылка.Проект
	|			ТОГДА СписаниеТопливаЗапасовРасходы.Проект   //Малышев 2024-06-10 ONESOFT-3093 
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ КАК Проект, 
	//--- Дмгг, 11.02.24, ONESOFT-2827
	|	0 КАК Сумма,
	//++ 21.08.2025 ONESOFT-4304
	|	ВЫБОР
	|		КОГДА СписаниеТопливаЗапасовРасходы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеТопливаЗапасов.СписаниеТоплива)
	|				И (СписаниеТопливаЗапасовРасходы.СчетУчетаЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|					ИЛИ СписаниеТопливаЗапасовРасходы.СчетУчетаЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|					ИЛИ СписаниеТопливаЗапасовРасходы.СчетУчетаЗатрат.ТипСчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|			ТОГДА СписаниеТопливаЗапасовРасходы.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК КоррНоменклатура,
	|	ВЫБОР
	|	КОГДА &УчетПоПроектам = ЛОЖЬ
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОГДА СписаниеТопливаЗапасовРасходы.Проект <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|		ТОГДА СписаниеТопливаЗапасовРасходы.Проект
	|	ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ КАК КоррПроект	
	//-- 21.08.2025 ONESOFT-4304

	|ПОМЕСТИТЬ ВременнаяТаблицаРасходы
	|ИЗ
	|	Документ.СписаниеТопливаЗапасов.Расходы КАК СписаниеТопливаЗапасовРасходы
	|ГДЕ
	|	СписаниеТопливаЗапасовРасходы.Ссылка = &Ссылка";
	
	//Малышев 2024-06-17 - дополним копией таблицы для получения стоимости
	Запрос.Текст = Запрос.Текст + "; Выбрать * поместить ВременнаяТаблицаЗапасы из ВременнаяТаблицаРасходы";
	
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСписаниеТопливаЗапасов);
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ИспользованиеТолькоРеглПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	
	Запрос.ВыполнитьПакет();
	
	
	
	СформироватьТаблицаЗапасы(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства);
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаДанныеПоРасходуТС_СписаниеТопливаЗапасов(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

Процедура СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасыНаСкладах.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период КАК Период,
	|	ТаблицаЗапасыНаСкладах.Организация КАК Организация,
	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Характеристика КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Партия,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НЕОПРЕДЕЛЕНО КАК Ячейка,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|,	ТаблицаЗапасыНаСкладах.Проект КАК Проект //+++ Дмгг, 11.02.24, ONESOFT-2827
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаЗапасыНаСкладах
	|ГДЕ
	|	ТаблицаЗапасыНаСкладах.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|	И (НЕ ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница.ОрдерныйСклад)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.НомерСтроки,
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Организация,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Характеристика,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница
	|,	ТаблицаЗапасыНаСкладах.Проект"; //+++ Дмгг, 11.02.24, ONESOFT-2827
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура ЗаполнимСубконтоВТаблицеХозрасчетной(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства)

	//Малышев 2024-06-10 ONESOFT-3222
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("СубконтоДт1");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("СубконтоДт2");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("СубконтоДт3");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("СубконтоКт1");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("СубконтоКт2");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("СубконтоКт3");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("ВидСубконтоДт1");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("ВидСубконтоДт2");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("ВидСубконтоДт3");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("ВидСубконтоКт1");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("ВидСубконтоКт2");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("ВидСубконтоКт3");

	Для каждого СтрокаТаблицаХозрасчетный из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный Цикл	
		
		
		Для НомерСубконто = 1 По 3 Цикл
			ВидСубконтоДт = ""; 
			СубконтоДт = Неопределено;
			
			Если СтрокаТаблицаХозрасчетный.СчетДт.ВидыСубконто.Количество() >= НомерСубконто тогда
				 ВидСубконтоДт = СтрокаТаблицаХозрасчетный.СчетДт.ВидыСубконто[НомерСубконто-1].ВидСубконто.ИмяПредопределенныхДанных;	
			КонецЕсли;	       
			СтрокаТаблицаХозрасчетный["ВидСубконтоДт" + НомерСубконто] = ВидСубконтоДт; 
			
			ВидСубконтоКт = "";
			СубконтоКт = Неопределено;
			Если СтрокаТаблицаХозрасчетный.СчетКт.ВидыСубконто.Количество() >= НомерСубконто тогда
				 ВидСубконтоКт = СтрокаТаблицаХозрасчетный.СчетКт.ВидыСубконто[НомерСубконто-1].ВидСубконто.ИмяПредопределенныхДанных;	
			КонецЕсли;
			СтрокаТаблицаХозрасчетный["ВидСубконтоКт" + НомерСубконто] = ВидСубконтоКт;
			
			
			
			
			Если ВидСубконтоДт = "Подразделения" 
				и СтрокаТаблицаХозрасчетный.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)<>Неопределено 
				Тогда
				СубконтоДт = СтрокаТаблицаХозрасчетный.ПодразделениеДт;
				 СтрокаТаблицаХозрасчетный.ПодразделениеДт = "";
				//СубконтоДт = СтрокаТаблицаХозрасчетный.Подразделение;
				
			ИначеЕсли ВидСубконтоДт = "ОСТС" Тогда
				СубконтоДт = СтрокаТаблицаХозрасчетный.ВнеоборотныйАктив;
			ИначеЕсли ВидСубконтоДт = "Номенклатура" Тогда
				СубконтоДт = СтрокаТаблицаХозрасчетный.Номенклатура;
			ИначеЕсли ВидСубконтоДт = "СотрудникНоменклатура" Тогда
				СубконтоДт = СтрокаТаблицаХозрасчетный.Номенклатура;
			КонецЕсли;	
			
			
			Если ВидСубконтоКт = "Склады" Тогда
				СубконтоКт = СтрокаТаблицаХозрасчетный.СтруктурнаяЕдиница;
			ИначеЕсли ВидСубконтоКт = "Номенклатура" Тогда
				СубконтоКт = СтрокаТаблицаХозрасчетный.Номенклатура;
			ИначеЕсли ВидСубконтоКт = "ХарактеристикиНоменклатуры" Тогда
				СубконтоКт = СтрокаТаблицаХозрасчетный.Характеристика;
			КонецЕсли;	
			
			
			СтрокаТаблицаХозрасчетный["СубконтоДт" + НомерСубконто] = СубконтоДт;
			СтрокаТаблицаХозрасчетный["СубконтоКт" + НомерСубконто] = СубконтоКт;
			
		КонецЦикла; 
		
		
		
	КонецЦикла;
	
	//|   ""Подразделения"" КАК ВидСубконтоДт1,
	//|   ""СотрудникНоменклатура"" КАК ВидСубконтоДт2,
	//|   ""ОСТС"" КАК ВидСубконтоДт3,                 
	//|   ТаблицаРасходы.Подразделение КАК СубконтоДт1,
	//|   ТаблицаРасходы.Номенклатура КАК СубконтоДт2,
	//|   ТаблицаРасходы.ВнеоборотныйАктив КАК СубконтоДт3,
	
	//|   ""Склады"" КАК ВидСубконтоКт1,
	//|   ""Номенклатура"" КАК ВидСубконтоКт2,
	//|   ""ХарактеристикиНоменклатуры"" КАК ВидСубконтоКт3,
	//|   ТаблицаРасходы.СтруктурнаяЕдиница КАК СубконтоКт1,
	//|   ТаблицаРасходы.Номенклатура КАК СубконтоКт2,
	//|   ТаблицаРасходы.Характеристика КАК СубконтоКт3,
	
КонецПроцедуры	



Процедура СформироватьТаблицаЗапасы(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =            
	"ВЫБРАТЬ
	|	ТаблицаРасходы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаРасходы.Период КАК Период,
	|	ТаблицаРасходы.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ТаблицаРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаРасходы.ДатаСписания КАК ДатаСписания,
	//|	ТаблицаРасходы.СчетУчетаЗапасов КАК СчетУчета,
	|	ТаблицаРасходы.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|	ТаблицаРасходы.СчетУчетаЗапасовРегл КАК СчетУчета, //Малышев 2024-12-11 ONESOFT-3642
	|	ТаблицаРасходы.СчетУчетаЗатрат КАК КоррСчетУчета,
	//|	ТаблицаРасходы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ТаблицаРасходы.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаРасходы.НомерВА КАК НомерВА,
	|	ТаблицаРасходы.ВидОперации КАК Операция,
	|	ТаблицаРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаРасходы.СтруктурнаяЕдиница КАК Склад,
	|	ТаблицаРасходы.Подразделение КАК Подразделение,
	|	СУММА(ТаблицаРасходы.ПробегРазница) КАК Пробег,
	|	ТаблицаРасходы.СчетУчетаЗатратРегл КАК КоррСчетУчетаРегл,
	//|	ТаблицаРасходы.Номенклатура.СчетУчетаЗатратРегл КАК КоррСчетУчетаРегл, //Малышев 2024-07-27 поменял
	|	ТаблицаРасходы.ЭтоТС КАК ЭтоТС,
	|	ТаблицаРасходы.Номенклатура КАК Номенклатура,
	|	ТаблицаРасходы.Характеристика КАК Характеристика,
	//++ 21.08.2025 ONESOFT-4304
	//|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК КоррНоменклатура, 
	|	ТаблицаРасходы.КоррНоменклатура КАК КоррНоменклатура,   
	|	ТаблицаРасходы.КоррПроект КАК КоррПроект,
	//-- 21.08.2025 ONESOFT-4304
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК КоррХарактеристика,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|	ТаблицаРасходы.Ссылка КАК ДокументПродажи,
	|	ТаблицаРасходы.СчетУчетаЗатратРегл КАК СчетДт,
	|	ТаблицаРасходы.СчетУчетаЗапасовРегл КАК СчетКт,
	|	ВЫРАЗИТЬ(&СписаниеЗапасов КАК Строка (100)) КАК СодержаниеПроводки,
	|	ВЫРАЗИТЬ(&СписаниеЗапасов КАК Строка (100)) КАК Содержание,
	|	ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗатратРегл.Валютный 
	|			ТОГДА ТаблицаРасходы.ВалютаУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗапасовРегл.Валютный 
	|			ТОГДА ТаблицаРасходы.ВалютаУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	СУММА(ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗатратРегл.Валютный 
	|			ТОГДА ТаблицаРасходы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаВалДт,
	|	СУММА(ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗапасовРегл.Валютный 
	|			ТОГДА ТаблицаРасходы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаВалКт,
	|	СУММА(ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗатратРегл.Количественный 
	|			ТОГДА ТаблицаРасходы.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоличествоДт,
	|	СУММА(ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗапасовРегл.Количественный 
	|			ТОГДА ТаблицаРасходы.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоличествоКт,
	
	//Малышев 2024-06-10 ONESOFT-3222 - перенес заполнение субконто в отдельную процедуру
	//|   ""Подразделения"" КАК ВидСубконтоДт1,
	//|   ""СотрудникНоменклатура"" КАК ВидСубконтоДт2,
	//|   ""ОСТС"" КАК ВидСубконтоДт3,
	//|   ""Склады"" КАК ВидСубконтоКт1,
	//|   ""Номенклатура"" КАК ВидСубконтоКт2,
	//|   ""ХарактеристикиНоменклатуры"" КАК ВидСубконтоКт3,
	//|   ТаблицаРасходы.Подразделение КАК СубконтоДт1,
	//|   ТаблицаРасходы.Номенклатура КАК СубконтоДт2,
	//|   ТаблицаРасходы.ВнеоборотныйАктив КАК СубконтоДт3,
	//|   ТаблицаРасходы.СтруктурнаяЕдиница КАК СубконтоКт1,
	//|   ТаблицаРасходы.Номенклатура КАК СубконтоКт2,
	//|   ТаблицаРасходы.Характеристика КАК СубконтоКт3,  
	
	|	ТаблицаРасходы.Проект КАК Проект, 				//+++ Дмгг, 11.02.24, ONESOFT-2827
	|	СУММА(ТаблицаРасходы.Количество) КАК Количество,
	|	СУММА(ТаблицаРасходы.Сумма) КАК Сумма//,
	//|	ИСТИНА КАК ФиксированнаяСтоимость // Kuzmich, 15.09.2025, (ONESOFT-4334) Корректировка закрытия месяца – документ списания топлива
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаРасходы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасходы.Период,
	|	ТаблицаРасходы.НомерСтроки,
	|	ТаблицаРасходы.Ссылка,
	|	ТаблицаРасходы.Организация,
	|	ТаблицаРасходы.СтруктурнаяЕдиница,
	//|	ТаблицаРасходы.СчетУчетаЗапасов,
	|	ТаблицаРасходы.СчетУчетаЗапасовРегл,
	|	ТаблицаРасходы.Номенклатура,
	|	ТаблицаРасходы.Характеристика,
	//++ 21.08.2025 ONESOFT-4304
	|   ТаблицаРасходы.КоррНоменклатура,   
	|   ТаблицаРасходы.КоррПроект,
	//-- 21.08.2025 ONESOFT-4304
	|	ТаблицаРасходы.ДатаСписания,
	|	ТаблицаРасходы.ВидОперации,
	|	ТаблицаРасходы.СчетУчетаЗатрат,
	|	ТаблицаРасходы.СчетУчетаЗапасов,
	|	ТаблицаРасходы.СчетУчетаЗатратРегл, 
	|	ТаблицаРасходы.Номенклатура.СчетУчетаЗатратРегл,
	|	ТаблицаРасходы.ЭтоТС,
	|	ТаблицаРасходы.ВнеоборотныйАктив,
	|	ТаблицаРасходы.НомерВА,
	|	ТаблицаРасходы.НаправлениеДеятельности,
	|	ТаблицаРасходы.СтруктурнаяЕдиница,
	|	ТаблицаРасходы.Подразделение,
	|	ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗатратРегл.Валютный 
	|			ТОГДА ТаблицаРасходы.ВалютаУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаРасходы.СчетУчетаЗапасовРегл.Валютный 
	|			ТОГДА ТаблицаРасходы.ВалютаУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаРасходы.Проект, //+++ Дмгг, 11.02.24, ONESOFT-2827
	|	ТаблицаРасходы.СчетУчетаЗапасов";	
	
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='მარაგების შემოსავალში აყვანა';ru='Оприходование запасов';en='Posting of Goods'"));
	Запрос.УстановитьПараметр("СписаниеЗапасов", НСтр("ka='მარაგების ჩამოწერა';ru='Списание запасов';en='Write-off stocks'"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());	
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", РезультатЗапроса.Выгрузить());
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗатратыНаОСиТС", РезультатЗапроса.Выгрузить());
	////СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗатратыНаОСиТС.Колонки.Удалить("СчетУчета");
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗатратыНаОСиТС.Колонки.Добавить("СчетУчета");
	
	//Малышев 2025-02-27 ONESOFT-3879 (--
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Колонки.Добавить("ПодразделениеДт");
	МассивПодразделений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.ВыгрузитьКолонку("Подразделение");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.ЗагрузитьКолонку(МассивПодразделений, "ПодразделениеДт");
	//Малышев 2025-02-27 ONESOFT-3879 --)
	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.СкопироватьКолонки());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗатратыНаОСиТС", СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.СкопироватьКолонки());
	
	
	КопияТаблицыЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.СкопироватьКолонки();
	КопияТаблицыЗапасы.Колонки.Добавить("КоррСтруктурнаяЕдиница"); //+++ Дмгг
	КопияТаблицыЗапасы.Колонки.Добавить("ДокументПоступления"); 
	
	//////////////////////////////////////////
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	//--------------------------------------------------------------------------
	// © Шишка В.В. [17 августа 2021]  НАЧАЛО
	УчетСебестоимостиВРазрезеОрганизации = СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетСебестоимостиВРазрезеОрганизации;
	Запрос.УстановитьПараметр("УчетСебестоимостиВРазрезеОрганизации", УчетСебестоимостиВРазрезеОрганизации);	
	// © Шишка В.В. [17 августа 2021]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	// Установка исключительной блокировки контролируемых остатков запасов.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаРасходы.Организация КАК Организация,
	|	ТаблицаРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаРасходы.СчетУчетаЗапасов КАК СчетУчета,
	|	ТаблицаРасходы.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|	ТаблицаРасходы.Номенклатура КАК Номенклатура,
	|	ТаблицаРасходы.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаРасходы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасходы.Организация,
	|	ТаблицаРасходы.СтруктурнаяЕдиница,
	|	ТаблицаРасходы.СчетУчетаЗапасов,
	|	ТаблицаРасходы.СчетУчетаЗапасовРегл,
	|	ТаблицаРасходы.Номенклатура,
	|	ТаблицаРасходы.Характеристика";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Запасы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		Если КолонкаРезультатЗапроса.Имя <> "СчетУчетаЗатратРегл"
			И КолонкаРезультатЗапроса.Имя <> "КоррСчетУчета" 
			И КолонкаРезультатЗапроса.Имя <> "КоррСчетУчетаРегл" Тогда 
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
		КонецЕсли;
	КонецЦикла;
	Блокировка.Заблокировать();
	
	// Получение остатков запасов по стоимости.
	//Если ДокументСсылкаСписаниеТопливаЗапасов.ПроводитьСДатойДокумента=ложь ТОгда
		
		ТаблицаЗапасыОстатки = УправлениеНебольшойФирмойСервер.ПолучитьОстаткиЗапасовПоСтоимостиПриПроведении(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства, Истина,,,,Истина,ДокументСсылкаСписаниеТопливаЗапасов.Дата, ДокументСсылкаСписаниеТопливаЗапасов.Дата).Выгрузить();
	//Иначе
	//	ТаблицаЗапасыОстатки = УправлениеНебольшойФирмойСервер.ПолучитьОстаткиЗапасовПоСтоимостиПриПроведении(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства, Истина,,,,Ложь).Выгрузить();
	//КонецЕсли;	
	//Малышев 2024-06-13 ONESOFT-3092  --))
	
	//ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,Номенклатура,Характеристика,Партия");
	ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия");

	Для н = 0 По СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Количество() - 1 Цикл
		
		СтрокаТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы[н];
		
		//Малышев 2024-07-27 ((-
		СтруктураДляПоиска = УправлениеНебольшойФирмойСервер.ПолучитьСтруктуруДляПоиска(СтрокаТаблицаЗапасы, СтруктураДополнительныеСвойства);
		//Малышев 2024-07-27 --)
		
		КоличествоТребуется = СтрокаТаблицаЗапасы.Количество;
		
		Если КоличествоТребуется > 0 Тогда
			
			МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);

			//Малышев 2024-11-30 ONESOFT-3642
			Для каждого СтрокаТаблицыОстатков из МассивСтрокОстатков Цикл
			
				Если КоличествоТребуется <= 0 Тогда
					Прервать;
				КонецЕсли;	
		
			//КоличествоОстаток = 0;
			//СуммаОстаток = 0;
			//
			//Если МассивСтрокОстатков.Количество() > 0 Тогда
			//	КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
			//	СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток;
			//КонецЕсли;
			
			КоличествоОстаток = СтрокаТаблицыОстатков.КоличествоОстаток;
			СуммаОстаток = СтрокаТаблицыОстатков.СуммаОстаток;
			
			КоличествоКСписанию = 0;
			СуммаКСписанию = 0;
		
			Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуется Тогда
				
				КоличествоКСписанию = КоличествоТребуется; //Малышев 2024-11-30 ONESOFT-3642	
				СуммаКСписанию = Окр(СуммаОстаток * КоличествоТребуется / КоличествоОстаток , 2, 1);
				
				//МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуется;
				СтрокаТаблицыОстатков.СуммаОстаток = СтрокаТаблицыОстатков.СуммаОстаток - СуммаКСписанию;
				//МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуется;
				СтрокаТаблицыОстатков.КоличествоОстаток = СтрокаТаблицыОстатков.КоличествоОстаток - КоличествоКСписанию;
				
			ИначеЕсли КоличествоОстаток <= 0 Тогда  
				Продолжить;
				
			//ИначеЕсли КоличествоОстаток = КоличествоТребуется Тогда
			ИначеЕсли КоличествоОстаток <= КоличествоТребуется Тогда  //Малышев 2024-11-30 ONESOFT-3642				
				
				////++Lazare 10.03.2025 ONESOFT-3894
				//Если Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить() Тогда    
				//	КоличествоКСписанию = КоличествоТребуется;
				//Иначе
				////--Lazare 10.03.2025 ONESOFT-3894 // Kuzmich, 23.04.2025, (ONESOFT-3975) ნიკა პლასტი - წარმოების დოკუმენტის დროს, უარყოფითი ნაშთები არ აისახება მარაგებში და დანახარჯებში, закоментировал
					КоличествоКСписанию = КоличествоОстаток; 		
				//КонецЕсли;
   				СуммаКСписанию = СуммаОстаток;
				
				//МассивСтрокОстатков[0].КоличествоОстаток = 0;
				СтрокаТаблицыОстатков.КоличествоОстаток = 0;
				//МассивСтрокОстатков[0].СуммаОстаток = 0;
				СтрокаТаблицыОстатков.СуммаОстаток = 0;
				
			Иначе
				СуммаКСписанию = 0;	
			КонецЕсли;
			
			КоличествоТребуется = КоличествоТребуется - КоличествоКСписанию; //Малышев 2024-11-30 ONESOFT-3642
			
			//СтрокаТаблицаЗапасы.Сумма = СуммаКСписанию;
			//СтрокаТаблицаЗапасы.Количество = КоличествоТребуется;
			
			// Восстанавливаем строку расхода
			Если СтрокаТаблицаЗапасы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда 
				НоваяСтрокаРасход = КопияТаблицыЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРасход, СтрокаТаблицаЗапасы);
				
				НоваяСтрокаРасход.Сумма      = СуммаКСписанию;
				//НоваяСтрокаРасход.Количество = КоличествоТребуется;
				НоваяСтрокаРасход.Количество = КоличествоКСписанию;//Малышев 2024-11-30 ONESOFT-3642
                НоваяСтрокаРасход.ДокументПоступления      = СтрокаТаблицыОстатков.ДокументПоступления; //Малышев 2024-11-30 ONESOFT-3642
				
				
				//+++ Дмгг
				Если НоваяСтрокаРасход.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы
					ИЛИ НоваяСтрокаРасход.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы Тогда
					
					НоваяСтрокаРасход.Подразделение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
					НоваяСтрокаРасход.КоррСчетУчетаРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
					
				КонецЕсли;
				//--- Дмгг
				
				
				Если НоваяСтрокаРасход.СчетДт.Валютный Тогда 
				//	НоваяСтрокаРасход.СуммаВалДт = СтрокаТаблицаЗапасы.Сумма;
					НоваяСтрокаРасход.СуммаВалДт = СуммаКСписанию;
				КонецЕсли;
				Если НоваяСтрокаРасход.СчетДт.Количественный Тогда 
					НоваяСтрокаРасход.КоличествоДт = КоличествоКСписанию;
				КонецЕсли;	
				
				
				
				Если НоваяСтрокаРасход.СчетКт.Валютный Тогда 
				//	НоваяСтрокаРасход.СуммаВалКт = СтрокаТаблицаЗапасы.Сумма;
					НоваяСтрокаРасход.СуммаВалКт = СуммаКСписанию;
				КонецЕсли;
				Если НоваяСтрокаРасход.СчетКт.Количественный Тогда 
					НоваяСтрокаРасход.КоличествоКт = КоличествоКСписанию;
				КонецЕсли;	
				
				//формируем проводки
				НоваяСтрокаРасходХозрачетный = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРасходХозрачетный, НоваяСтрокаРасход);
				
				НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗатратыНаОСиТС.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НоваяСтрокаРасход);
				НоваяСтрока.Подразделение = НоваяСтрокаРасход.ПодразделениеДт; //Малышев 2025-02-27 ONESOFT-3879 
				НоваяСтрокаРасход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.Подразделение;//++ 21.08.2025 ONESOFT-4304

			КонецЕсли;
			
			// Добавляем строку прихода
			Если НоваяСтрокаРасход.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство
				ИЛИ НоваяСтрокаРасход.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда 
				
				НоваяСтрокаПриход = КопияТаблицыЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПриход, СтрокаТаблицаЗапасы);
				
				НоваяСтрокаПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
				НоваяСтрокаПриход.Сумма      = СуммаКСписанию;
				
				//НоваяСтрокаПриход.Количество = 0;//КоличествоТребуется;
				НоваяСтрокаПриход.Количество = КоличествоКСписанию;//Малышев 2024-11-30 ONESOFT-3642;
				
				НоменклатураСтроки = НоваяСтрокаПриход.Номенклатура;
				ХарактеристикаСтроки = НоваяСтрокаПриход.Характеристика;
				НоваяСтрокаПриход.Номенклатура = НоменклатураСтроки;//Справочники.Номенклатура.ПустаяСсылка();
				НоваяСтрокаПриход.Характеристика = ХарактеристикаСтроки;//Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
				НоваяСтрокаПриход.КоррНоменклатура = НоменклатураСтроки;
				НоваяСтрокаПриход.КоррХарактеристика = ХарактеристикаСтроки;
				//СчетУчетаРасхода = НоваяСтрокаКопииЗапасов.СчетУчета;
				СчетУчетаРасходаРегл = НоваяСтрокаПриход.СчетУчетаРегл;
				//НоваяСтрокаКопииЗапасов.СчетУчета = НоваяСтрокаКопииЗапасов.КоррСчетУчета;
				//НоваяСтрокаКопииЗапасов.КоррСчетУчета = СчетУчетаРасхода;
				НоваяСтрокаПриход.СчетУчетаРегл = НоваяСтрокаПриход.КоррСчетУчетаРегл;
				НоваяСтрокаПриход.КоррСчетУчетаРегл = СчетУчетаРасходаРегл;
				НоваяСтрокаПриход.СтруктурнаяЕдиница = НоваяСтрокаПриход.Подразделение;  
				НоваяСтрокаПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница; //++ 21.08.2025 ONESOFT-4304
				
				//НоваяСтрокаКопииЗапасов.Проект = НоваяСтрокаКопииЗапасов.Проект;
				
				//Малышев 2024-11-30 ONESOFT-3642; (--
				Если НоваяСтрокаПриход.СчетДт.Валютный Тогда 
					НоваяСтрокаПриход.СуммаВалДт = СуммаКСписанию;
				КонецЕсли;
				Если НоваяСтрокаПриход.СчетДт.Количественный Тогда 
					НоваяСтрокаПриход.КоличествоДт = КоличествоКСписанию;
				КонецЕсли;	
				
				Если НоваяСтрокаПриход.СчетКт.Валютный Тогда 
					НоваяСтрокаПриход.СуммаВалКт = СуммаКСписанию;
				КонецЕсли;
				Если НоваяСтрокаПриход.СчетКт.Количественный Тогда 
					НоваяСтрокаПриход.КоличествоКт = КоличествоКСписанию;
				КонецЕсли;	
			    //Малышев 2024-11-30 ONESOFT-3642; --)
				
				
			ИначеЕсли НоваяСтрокаРасход.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы
				ИЛИ НоваяСтрокаРасход.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы Тогда
				
				НоваяСтрокаДоходыИРасходы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаДоходыИРасходы, СтрокаТаблицаЗапасы);
				
				НоваяСтрокаДоходыИРасходы.СчетУчета = НоваяСтрокаРасход.КоррСчетУчета;
				НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = НоваяСтрокаРасход.КоррСчетУчетаРегл;
				НоваяСтрокаДоходыИРасходы.СуммаРасходов = СуммаКСписанию;
				НоваяСтрокаДоходыИРасходы.Аналитика = НоваяСтрокаРасход.Номенклатура;
				НоваяСтрокаДоходыИРасходы.СтруктурнаяЕдиница = НоваяСтрокаРасход.Подразделение;
				
			КонецЕсли;
			
			//ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаЗатратыНаОСиТС_СписаниеТопливаЗапасов(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства, н, НоваяСтрокаРасход);
			// Сформируем проводки.
			//Если Окр(СтрокаТаблицаЗапасы.Сумма, 2, 1) <> 0 Тогда
			//	
			//	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_СписаниеТопливаЗапасов(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства, н, НоваяСтрокаРасход);
			//	
			//КонецЕсли;
			
			КонецЦикла; //По остаткам
			
			// Kuzmich, 11.05.2025, (ONESOFT-3975) ნიკა პლასტი - წარმოების დოკუმენტის დროს, უარყოფითი ნაშთები არ აისახება მარაგებში და დანახარჯებში
			// делаем отрицательный остаток
			Если КоличествоТребуется > 0 Тогда
				
				// Расход.
				Если СтрокаТаблицаЗапасы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда 
					НоваяСтрокаРасходОтрицательныеОстатки = КопияТаблицыЗапасы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаРасходОтрицательныеОстатки, СтрокаТаблицаЗапасы);
					
					НоваяСтрокаРасходОтрицательныеОстатки.Сумма      = 0;
					НоваяСтрокаРасходОтрицательныеОстатки.Количество = КоличествоТребуется;
					НоваяСтрокаРасходОтрицательныеОстатки.ДокументПоступления = НЕОПРЕДЕЛЕНО;
					//+++ Дмгг
					Если НоваяСтрокаРасходОтрицательныеОстатки.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы
						ИЛИ НоваяСтрокаРасходОтрицательныеОстатки.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы Тогда
						
						НоваяСтрокаРасходОтрицательныеОстатки.Подразделение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
						НоваяСтрокаРасходОтрицательныеОстатки.КоррСчетУчетаРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
						
					КонецЕсли;
					//--- Дмгг
					Если НоваяСтрокаРасходОтрицательныеОстатки.СчетДт.Валютный Тогда 
						НоваяСтрокаРасходОтрицательныеОстатки.СуммаВалДт = 0;
					КонецЕсли;
					Если НоваяСтрокаРасходОтрицательныеОстатки.СчетДт.Количественный Тогда 
						НоваяСтрокаРасходОтрицательныеОстатки.КоличествоДт = КоличествоТребуется;
					КонецЕсли;	
					Если НоваяСтрокаРасходОтрицательныеОстатки.СчетКт.Валютный Тогда 
						НоваяСтрокаРасходОтрицательныеОстатки.СуммаВалКт = 0;
					КонецЕсли;
					Если НоваяСтрокаРасходОтрицательныеОстатки.СчетКт.Количественный Тогда 
						НоваяСтрокаРасходОтрицательныеОстатки.КоличествоКт = КоличествоТребуется;
					КонецЕсли;	
					
					//формируем проводки
					НоваяСтрокаРасходХозрачетныйОтрицательныеОстатки = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаРасходХозрачетныйОтрицательныеОстатки, НоваяСтрокаРасходОтрицательныеОстатки);
					
					НоваяСтрокаОтрицательныеОстатки = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗатратыНаОСиТС.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаОтрицательныеОстатки, НоваяСтрокаРасходОтрицательныеОстатки);
					НоваяСтрокаОтрицательныеОстатки.Подразделение = НоваяСтрокаРасходОтрицательныеОстатки.ПодразделениеДт; //Малышев 2025-02-27 ONESOFT-3879
				КонецЕсли;
				
				// Добавляем строку прихода
				Если НоваяСтрокаРасходОтрицательныеОстатки.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство
					ИЛИ НоваяСтрокаРасходОтрицательныеОстатки.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда 
					
					НоваяСтрокаПриходОтрицательныеОстатки = КопияТаблицыЗапасы.Добавить();
					//ЗаполнитьЗначенияСвойств(НоваяСтрокаПриход, СтрокаТаблицаЗапасы);
					ЗаполнитьЗначенияСвойств(НоваяСтрокаПриходОтрицательныеОстатки, СтрокаТаблицаЗапасы);
					
					НоваяСтрокаПриходОтрицательныеОстатки.ВидДвижения = ВидДвиженияНакопления.Приход;
					НоваяСтрокаПриходОтрицательныеОстатки.Сумма      = 0;
					
					НоваяСтрокаПриходОтрицательныеОстатки.Количество  = КоличествоТребуется;
					
					НоменклатураСтроки = НоваяСтрокаПриходОтрицательныеОстатки.Номенклатура;
					ХарактеристикаСтроки = НоваяСтрокаПриходОтрицательныеОстатки.Характеристика;
					НоваяСтрокаПриходОтрицательныеОстатки.Номенклатура = НоменклатураСтроки;//Справочники.Номенклатура.ПустаяСсылка();
					НоваяСтрокаПриходОтрицательныеОстатки.Характеристика = ХарактеристикаСтроки;//Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
					НоваяСтрокаПриходОтрицательныеОстатки.КоррНоменклатура = НоменклатураСтроки;
					НоваяСтрокаПриходОтрицательныеОстатки.КоррХарактеристика = ХарактеристикаСтроки;
					
					СчетУчетаРасходаРегл = НоваяСтрокаПриходОтрицательныеОстатки.СчетУчетаРегл;
					НоваяСтрокаПриходОтрицательныеОстатки.СчетУчетаРегл = НоваяСтрокаПриходОтрицательныеОстатки.КоррСчетУчетаРегл;
					НоваяСтрокаПриходОтрицательныеОстатки.КоррСчетУчетаРегл = СчетУчетаРасходаРегл;
					НоваяСтрокаПриходОтрицательныеОстатки.СтруктурнаяЕдиница = НоваяСтрокаПриходОтрицательныеОстатки.Подразделение;
					
					//Малышев 2024-11-30 ONESOFT-3642; (--
					Если НоваяСтрокаПриходОтрицательныеОстатки.СчетДт.Валютный Тогда 
						НоваяСтрокаПриходОтрицательныеОстатки.СуммаВалДт = 0;
					КонецЕсли;
					Если НоваяСтрокаПриходОтрицательныеОстатки.СчетДт.Количественный Тогда 
						НоваяСтрокаПриходОтрицательныеОстатки.КоличествоДт = КоличествоТребуется;
					КонецЕсли;	
					
					Если НоваяСтрокаПриходОтрицательныеОстатки.СчетКт.Валютный Тогда 
						НоваяСтрокаПриходОтрицательныеОстатки.СуммаВалКт = 0;
					КонецЕсли;
					Если НоваяСтрокаПриходОтрицательныеОстатки.СчетКт.Количественный Тогда 
						НоваяСтрокаПриходОтрицательныеОстатки.КоличествоКт = КоличествоТребуется;
					КонецЕсли;	
					//Малышев 2024-11-30 ONESOFT-3642; --)					
					
				ИначеЕсли НоваяСтрокаРасходОтрицательныеОстатки.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы
					ИЛИ НоваяСтрокаРасходОтрицательныеОстатки.КоррСчетУчетаРегл.ТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы Тогда
					
					НоваяСтрокаДоходыИРасходыОтрицательныеОстатки = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаДоходыИРасходыОтрицательныеОстатки, СтрокаТаблицаЗапасы);
					
					НоваяСтрокаДоходыИРасходыОтрицательныеОстатки.СчетУчета = НоваяСтрокаРасход.КоррСчетУчета;
					НоваяСтрокаДоходыИРасходыОтрицательныеОстатки.СчетУчетаРегл = НоваяСтрокаРасход.КоррСчетУчетаРегл;
					НоваяСтрокаДоходыИРасходыОтрицательныеОстатки.СуммаРасходов = 0;
					НоваяСтрокаДоходыИРасходыОтрицательныеОстатки.Аналитика = НоваяСтрокаРасход.Номенклатура;
					НоваяСтрокаДоходыИРасходыОтрицательныеОстатки.СтруктурнаяЕдиница = НоваяСтрокаРасход.Подразделение;
					
				КонецЕсли;
				
			КонецЕсли;
			// Kuzmich, 11.05.2025, (ONESOFT-3975) ნიკა პლასტი - წარმოების დოკუმენტის დროს, უარყოფითი ნაშთები არ აისახება მარაგებში და დანახარჯებში
			
		КонецЕсли;
		
		
		//ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаЗатратыНаОСиТС_СписаниеТопливаЗапасов(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства, н, СтрокаТаблицаЗапасы);
		//// Сформируем проводки.
		//Если Окр(СтрокаТаблицаЗапасы.Сумма, 2, 1) <> 0 Тогда
		//	
		//	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_СписаниеТопливаЗапасов(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства, н, СтрокаТаблицаЗапасы);
		//	
		//КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы = КопияТаблицыЗапасы;
	
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", КопияТаблицыЗапасы);
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗатратыНаОСиТС", КопияТаблицыЗапасы);
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗатратыНаОСиТС.Колонки.Добавить("СчетУчета");

	//Малышев 2024-11-30 ONESOFT-3642
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный = КопияТаблицыЗапасы;  
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗатратыНаОСиТС = КопияТаблицыЗапасы;

	ЗаполнимСубконтоВТаблицеХозрасчетной(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства);
	//Малышев 2024-11-30 ONESOFT-3642
	
КонецПроцедуры

Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаСписаниеТопливаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	// Олег Литвиненко 16.11.22 --->
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗапасы.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗапасы.Сумма КАК Сумма
	|ПОМЕСТИТЬ втТаблицаЗапасы
	|ИЗ
	|	&ВнешняяТаблица КАК ТаблицаЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗапасы.Сумма КАК Сумма
	|ПОМЕСТИТЬ втТаблицаСумм
	|ИЗ
	|	втТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втТаблицаЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Шапка.ПроводитьСДатойДокумента
	|			ТОГДА Шапка.Период
	|		ИНАЧЕ ТаблицаЗапасыНаСкладах.Период
	|	КОНЕЦ КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.НомерСтроки КАК НомерСтроки,
	|	Шапка.Организация КАК Организация,
	|	ТаблицаЗапасыНаСкладах.Подразделение КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаЗапасыНаСкладах.СчетУчетаЗапасов КАК СчетУчета,
	
	//Малышев 2025-02-27 ONESOFT-3896
	//|	Шапка.СчетУчетаЗатрат КАК СчетУчетаРегл,
	|	ТаблицаЗапасыНаСкладах.СчетУчетаЗатратРегл КАК СчетУчетаРегл,
	|	
	|
	|	ТаблицаЗапасыНаСкладах.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(втТаблицаСумм.Сумма, 0) КАК СуммаРасходов,
	//|	NULL КАК Аналитика,
	|   ТаблицаЗапасыНаСкладах.Номенклатура  КАК Аналитика, //ONESOFT-3176
	|	ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.СписаниеЗапасов) КАК ХозяйственнаяОперация,
	|	ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100)) КАК СодержаниеПроводки
	|,	ТаблицаЗапасыНаСкладах.Проект КАК Проект //+++ Дмгг, 11.02.24, ONESOFT-2827
	|ИЗ
	|	ВременнаяТаблицаШапка КАК Шапка,
	|	ВременнаяТаблицаРасходы КАК ТаблицаЗапасыНаСкладах
	|	ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаСумм КАК втТаблицаСумм
	|		ПО ТаблицаЗапасыНаСкладах.НомерСтроки = втТаблицаСумм.НомерСтроки
	|ГДЕ  
	//Малышев 2025-02-27  ONESOFT-3896
	|	ТаблицаЗапасыНаСкладах.СчетУчетаЗатратРегл.ТипСчета <> Значение(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|	И ТаблицаЗапасыНаСкладах.СчетУчетаЗатратРегл.ТипСчета <> Значение(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|";
	// Олег Литвиненко <---
	
	
	Запрос.УстановитьПараметр("ВнешняяТаблица", СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы);
	Запрос.УстановитьПараметр("СписаниеЗапасов", НСтр("ka='მარაგების ჩამოწერა';ru='Списание запасов';en='Write-off stocks'"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Нужны колонки, заполнения в процедуре запасов
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаСписаниеТопливаЗапасов, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если Константы.КонтролироватьОстаткиЗапасовНаСкладахПриПроведении.Получить() Тогда
		
		Результат = УправлениеНебольшойФирмойСервер.ЗапросОтрицательныхОстатковЗапасовНаСкладахПриПроведенииДокумента(ДокументСсылкаСписаниеТопливаЗапасов, ДокументСсылкаСписаниеТопливаЗапасов.СтруктурнаяЕдиница);
		
		Если НЕ Результат.Пустой() Тогда
			ДокументСсылкаПеремещениеЗапасов_Объект = ДокументСсылкаСписаниеТопливаЗапасов.ПолучитьОбъект();
			ВыборкаИзРезультатаЗапроса = Результат.Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладах(ДокументСсылкаПеремещениеЗапасов_Объект, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;			
		
	КонецЕсли;
	
	Если НЕ УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияЗапасыНаСкладахИзменение", "ДвиженияЗапасыИзменение"
	// содержат записи, необходимо выполнить контроль реализации товаров.
	
	Если СтруктураВременныеТаблицы.ДвиженияЗапасыНаСкладахИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыИзменение
		Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		//Малышев 2024-12-03 ONESOFT-3670 (--
		УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКонтроля_ОстаткиЗапасовНаСкладе(ДополнительныеСвойства) //[0]
		//"ВЫБРАТЬ
		//|	ДвиженияЗапасыНаСкладахИзменение.НомерСтроки КАК НомерСтроки,
		//|	ДвиженияЗапасыНаСкладахИзменение.Организация КАК ОрганизацияПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК НоменклатураПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.Характеристика КАК ХарактеристикаПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.Партия КАК ПартияПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.Ячейка КАК ЯчейкаПредставление,
		//|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		//|	ЗапасыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		//|	ЕСТЬNULL(ДвиженияЗапасыНаСкладахИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыНаСкладах,
		//|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
		//|ИЗ
		//|	ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
		//|				&МоментКонтроля,
		//|				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия, Ячейка) В
		//|					(ВЫБРАТЬ
		//|						ДвиженияЗапасыНаСкладахИзменение.Организация КАК Организация,
		//|						ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		//|						ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура,
		//|						ДвиженияЗапасыНаСкладахИзменение.Характеристика КАК Характеристика,
		//|						ДвиженияЗапасыНаСкладахИзменение.Партия КАК Партия,
		//|						ДвиженияЗапасыНаСкладахИзменение.Ячейка КАК Ячейка
		//|					ИЗ
		//|						ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение)) КАК ЗапасыНаСкладахОстатки
		//|		ПО ДвиженияЗапасыНаСкладахИзменение.Организация = ЗапасыНаСкладахОстатки.Организация
		//|			И ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница = ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница
		//|			И ДвиженияЗапасыНаСкладахИзменение.Номенклатура = ЗапасыНаСкладахОстатки.Номенклатура
		//|			И ДвиженияЗапасыНаСкладахИзменение.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
		//|			И ДвиженияЗапасыНаСкладахИзменение.Партия = ЗапасыНаСкладахОстатки.Партия
		//|			И ДвиженияЗапасыНаСкладахИзменение.Ячейка = ЗапасыНаСкладахОстатки.Ячейка
		//|			И (ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) < 0)
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	НомерСтроки
		//Малышев 2024-12-03 ONESOFT-3670 --)
		+ "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияЗапасыИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		|	ДвиженияЗапасыИзменение.СчетУчета КАК СчетУчетаПредставление,
		|	ДвиженияЗапасыИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияЗапасыИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ДвиженияЗапасыИзменение.Партия КАК ПартияПредставление,
		|	ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателяПредставление,
		|	ЗапасыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) КАК СуммаОстатокЗапасы
		|ИЗ
		|	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
		|				&МоментКонтроля,
		|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|						ДвиженияЗапасыИзменение.СчетУчета КАК СчетУчета,
		|						ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателя
		|					ИЗ
		|						ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение)) КАК ЗапасыОстатки
		|		ПО ДвиженияЗапасыИзменение.Организация = ЗапасыОстатки.Организация
		|			И ДвиженияЗапасыИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
		|			И ДвиженияЗапасыИзменение.СчетУчета = ЗапасыОстатки.СчетУчета
		|			И ДвиженияЗапасыИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
		|			И ДвиженияЗапасыИзменение.Характеристика = ЗапасыОстатки.Характеристика
		|			И ДвиженияЗапасыИзменение.Партия = ЗапасыОстатки.Партия
		|			И ДвиженияЗапасыИзменение.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
		|			И (ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) < 0)
		|;
		|" 
		
		//Малышев 2024-06-17 ONESOFT-3094 (--
	    + УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКонтроля_ОстаткиЗапасов(ДополнительныеСвойства) // МассивРезультатов[2]
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ДвиженияЗапасыИзменение.НомерСтроки КАК НомерСтроки,
		//|	ДвиженияЗапасыИзменение.Организация КАК ОрганизацияПредставление,
		//|	ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		//|	ДвиженияЗапасыИзменение.СчетУчетаРегл КАК СчетУчетаРеглПредставление,
		//|	ДвиженияЗапасыИзменение.Номенклатура КАК НоменклатураПредставление,
		//|	ДвиженияЗапасыИзменение.Характеристика КАК ХарактеристикаПредставление,
		//|	ДвиженияЗапасыИзменение.Партия КАК ПартияПредставление,
		//|	ДвиженияЗапасыИзменение.Проект КАК ПроектПредставление, //Малышев 2024-06-11 ONESOFT-3094
		//|	ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателяПредставление,
		//|	ЗапасыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		//|	ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		//|	ЕСТЬNULL(ДвиженияЗапасыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасы,
		//|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасы,
		//|	ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) КАК СуммаОстатокЗапасы
		//|ИЗ
		//|	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
		//|				&МоментКонтроля,
		////|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
		//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, Проект, ЗаказПокупателя) В //Малышев 2024-06-11 ONESOFT-3094
		//|					(ВЫБРАТЬ
		//|						ДвиженияЗапасыИзменение.Организация КАК Организация,
		//|						ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		//|						ДвиженияЗапасыИзменение.СчетУчетаРегл КАК СчетУчетаРегл,
		//|						ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
		//|						ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
		//|						ДвиженияЗапасыИзменение.Партия КАК Партия,
		//|						ДвиженияЗапасыИзменение.Проект КАК Проект, //Малышев 2024-06-11 ONESOFT-3094
		//|						ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателя
		//|					ИЗ
		//|						ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение)) КАК ЗапасыОстатки
		//|		ПО ДвиженияЗапасыИзменение.Организация = ЗапасыОстатки.Организация
		//|			И ДвиженияЗапасыИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
		//|			И ДвиженияЗапасыИзменение.СчетУчетаРегл = ЗапасыОстатки.СчетУчетаРегл
		//|			И ДвиженияЗапасыИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
		//|			И ДвиженияЗапасыИзменение.Характеристика = ЗапасыОстатки.Характеристика
		//|			И ДвиженияЗапасыИзменение.Партия = ЗапасыОстатки.Партия
		//|			И ДвиженияЗапасыИзменение.Проект = ЗапасыОстатки.Проект //Малышев 2024-06-11 ONESOFT-3094
		//|			И ДвиженияЗапасыИзменение.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
		//|			И (ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) < 0)
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	НомерСтроки"
		//Малышев 2024-06-17 ONESOFT-3094 --)
		
		;
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Если НЕ МассивРезультатов[0].Пустой()
			ИЛИ НЕ МассивРезультатов[1].Пустой()
			ИЛИ НЕ МассивРезультатов[2].Пустой()
			Тогда
			
			ДокументОбъектСписаниеТопливаЗапасов = ДокументСсылкаСписаниеТопливаЗапасов.ПолучитьОбъект()
			
		КонецЕсли;
		
		// Отрицательный остаток запасов на складе.
		Если НЕ МассивРезультатов[0].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[0].Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладах(ДокументОбъектСписаниеТопливаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
		// Отрицательный остаток учета запасов и затрат.
		Если НЕ ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов Тогда  
			Если НЕ МассивРезультатов[1].Пустой() Тогда
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[1].Выбрать();
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументСсылкаСписаниеТопливаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
			КонецЕсли;
		Иначе
			Если НЕ МассивРезультатов[2].Пустой() Тогда
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[2].Выбрать();
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументСсылкаСписаниеТопливаЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтроль()

#Область ЗагрузкаДанныхИзВнешнегоИсточника

Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока30 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	//ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(Дата(1,1,1)));
	
	
	ЭтоЗапасы = (ПолноеИмяОбъектаЗаполнения = "Документ.СписаниеТопливаЗапасов.ТабличнаяЧасть.Расходы");
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Штрихкод", НСтр("ka='შტრიხ კოდი';ru='Штрихкод';en='Barcode'"), ОписаниеТиповСтрока200, ОписаниеТиповКолонка, "Номенклатура", 1, , Истина, ЭтоЗапасы);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Артикул", НСтр("ka='არტიკული';ru='Артикул';en='Артикул'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование", НСтр("ka='ნომენკლატურა (დასახელება)';ru='Номенклатура (наименование)';en='Nomenclature (name)'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Номенклатура", 3, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименованиеПолное",НСтр("ka='ნომენკლატურა (სრული დასახელება)';ru='Номенклатура (полное наименование';en='Nomenclature (full name'"), ОписаниеТиповСтрока1000, ОписаниеТиповКолонка, "Номенклатура", 5, , Истина);
	
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Содержание", НСтр("ka='შინაარსი';ru='Содержание';en='Content'"), ОписаниеТиповСтрока1000, ОписаниеТиповСтрока1000, , , , , НастройкиЗагрузкиДанных.СодержаниеВидимо);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Характеристика", НСтр("ka='თვისება (დასახელება)';ru='Характеристика (наименование)';en='Characteristics (name)'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка);
		
	КонецЕсли;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ВнеоборотныеАктивы"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ТранспортныеСредства"));
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов(МассивТипов);
	//ОписаниеТиповКолонка.Добавить(Новый ОписаниеТипов("СправочникСсылка.ВнеоборотныеАктивы"));
	//ОписаниеТиповКолонка.Добавить(Новый ОписаниеТипов("СправочникСсылка.ТранспортныеСредства"));
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ВнеоборотныйАктивНаименование", НСтр("ru='ОС/Транспортне средство';ka='ძ/ს / სატრანსპორტო საშუალება'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка, "ВнеоборотныйАктив", 1, , Истина);
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ВнеоборотныйАктивКод", НСтр("ru='Инв./Гос. номер';ka='სახელმწიფო ნომერი'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка, "ВнеоборотныйАктив", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ВнеоборотныйАктив", НСтр("ru='ОС/Транспортне средство';ka='ძ/ს / სატრანსპორტო საშუალება'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Количество", НСтр("ka='რაოდენობა';ru='Количество';en='Количество'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Дата", НСтр("ka='თარიღი';ru='Дата';en='Date'"), ОписаниеТиповСтрока25, Новый ОписаниеТипов("Дата"), , , Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ПробегНачало", НСтр("ru='Пробег начало';ka='ოდომეტრის ჩვენება საწყისი'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ПробегРазница", НСтр("ru='Пробег (км)';ka='გავლილი კილომეტრაჟი'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ПолныйБак", НСтр("ru='Полный бак';ka='ავზი გაივსო'"), ОписаниеТиповСтрока25, Новый ОписаниеТипов("Булево"), , , Истина);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Подразделение", НСтр("ka='ქვეგანყოფილება';ru='Подразделение';en='Subdivision'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения, СправочникСсылка.ЕдиницыИзмерения");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ЕдиницаИзмерения", НСтр("ka='საზომი ერთეული';ru='Ед. изм.';en='Unit of Measurement'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка, , , , , ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения"));
	
	
КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	//Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	//ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	//НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	//
	//НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_mxl", "ОбразецЗагрузкиДанных_mxl");
	//
	//Образец_csv = ПолучитьМакет("ОбразецЗагрузкиДанных_csv");
	//ОбразецЗагрузкиДанных_csv = ПоместитьВоВременноеХранилище(Образец_csv, УникальныйИдентификатор);
	//НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_csv", ОбразецЗагрузкиДанных_csv);
	
КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ТаблицаСопоставленияДанных, НастройкиЗагрузкиДанных) Экспорт
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Артикул, СтрокаТаблицыФормы.НоменклатураНаименование, СтрокаТаблицыФормы.НоменклатураНаименованиеПолное);
		
		Если ПолноеИмяОбъектаЗаполнения = "Документ.СписаниеТопливаЗапасов.ТабличнаяЧасть.Расходы" Тогда
			
			Если СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
				
				СтрокаТаблицыФормы.Номенклатура = Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Содержание
		//Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
		//	
		//	ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Содержание, СтрокаТаблицыФормы.Содержание_ВходящиеДанные);
		//	
		//КонецЕсли;
		
		// Количество
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Количество, СтрокаТаблицыФормы.Количество_ВходящиеДанные, 1);
		
		// ЕдиницыИзмерения по Наименованию (так же рассмотреть возможность прикрутить пользовательские ЕИ)
		ЗначениеПоУмолчанию = ?(ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура), СтрокаТаблицыФормы.Номенклатура.ЕдиницаИзмерения, Справочники.КлассификаторЕдиницИзмерения.шт);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЕдиницыИзмерения(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.ЕдиницаИзмерения, СтрокаТаблицыФормы.ЕдиницаИзмерения_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// Дата
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтрокаТаблицыФормы.Дата, СтрокаТаблицыФормы.Дата_ВходящиеДанные);
		
		// Пробег Начало
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.ПробегНачало, СтрокаТаблицыФормы.ПробегНачало_ВходящиеДанные, 0);
		
		// Пробег пройдено
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.ПробегРазница, СтрокаТаблицыФормы.ПробегРазница_ВходящиеДанные, 0);
		
		// Подразделение
		ЗначениеПоУмолчанию = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСтруктурнуюЕдиницу(СтрокаТаблицыФормы.Подразделение, СтрокаТаблицыФормы.Подразделение_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// ОС/ТС
		ЗначениеПоУмолчанию = Справочники.ВнеоборотныеАктивы.ПустаяСсылка();
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьВнеоборотныйАктив(СтрокаТаблицыФормы.ВнеоборотныйАктив, СтрокаТаблицыФормы.ВнеоборотныйАктив_ВходящиеДанные);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыФормы.ВнеоборотныйАктив) Тогда 
			
			ЗначениеПоУмолчанию = Справочники.ТранспортныеСредства.ПустаяСсылка();
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьТранспортноеСредство(СтрокаТаблицыФормы.ВнеоборотныйАктив, СтрокаТаблицыФормы.ВнеоборотныйАктив_ВходящиеДанные);
			
		КонецЕсли;
		
		// Полный бак
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВБулево(СтрокаТаблицыФормы.ПолныйБак, СтрокаТаблицыФормы.ПолныйБак_ВходящиеДанные);
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	Если ПолноеИмяОбъектаЗаполнения = "Документ.СписаниеТопливаЗапасов.ТабличнаяЧасть.Расходы" Тогда
		
		СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура)
		И СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
		И СтрокаТаблицыФормы.Количество <> 0;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "УчетТоплива");
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Макет_СТ") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Макет_СТ", "Макет_СТ", НапечататьМакет_СТ(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Макет_СМ") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Макет_СМ", "Макет_СМ", НапечататьМакет_СМ(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	
	
	
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

Функция НапечататьМакет_СМ(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "Макет_СМ";
	
	МакетОбработки = ПолучитьМакет("Макет_СМ");	 
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	МакетПечатнойФормы = ПолучитьМакет("Макет_СМ");
	
	ТабличныйДокумент.Очистить();
	//   
	
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Макет_СТ";
	//ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеТопливаЗапасов_Макет_СТ";
	//ТабличныйДокумент.АвтоМасштаб			= Истина;
	//Страница = 1;
	//
	ПервыйДокумент = Истина;
	
	Для Каждого СсылкаНаОбъект из МассивОбъектов Цикл
		//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СписаниеТопливаЗапасов.Макет_СТ");		
		ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка");
		ОбластьТабличнаяЧасть = МакетПечатнойФормы.ПолучитьОбласть("ТабличнаяЧасть");
		
		ОбластьПодвал= МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		
		
		Попытка
			ОбластьШапки.Параметры.Дата	= Формат(СсылкаНаОбъект.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		
		
		ОбластьШапки.Параметры.Номер = СсылкаНаОбъект.Номер;
		//ОбластьШапки.Параметры.Дата  = СсылкаНаОбъект.Дата
		
		ОбластьПодвал.Параметры.Ответственный = СсылкаНаОбъект.Ответственный;
		
		
		
		
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		
		
		//МассивСтрок = Новый Массив; 
		//МассивСтрок.Очистить();		
		//МассивСтрок.Добавить(ОбластьПодвал);
		//МассивСтрок.Добавить(ОбластьПустаяСтрока);
		//МассивСтрок.Добавить(ОбластьПустаяСтрока);
		//МассивСтрок.Добавить(ОбластьПустаяСтрока);
		
		
		// КолЗапасов = СсылкаНаОбъект.ТаблицаПредложений.Количество();
		
		
		Для Каждого стр из СсылкаНаОбъект.Расходы Цикл
			
			ОбластьТабличнаяЧасть.Параметры.Номенклатура = стр.Номенклатура;
			ОбластьТабличнаяЧасть.Параметры.РасходыДата = стр.Дата;
			ОбластьТабличнаяЧасть.Параметры.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
			ОбластьТабличнаяЧасть.Параметры.ВнеоборотныйАктив	 = стр.ВнеоборотныйАктив;
			//ОбластьТабличнаяЧасть.Параметры.ПробегОкончание = стр.ПробегОкончание;
			ОбластьТабличнаяЧасть.Параметры.НомерВА  = стр.НомерВА;
			//ОбластьТабличнаяЧасть.Параметры.ПробегНачало = стр.ПробегНачало;
			//ОбластьТабличнаяЧасть.Параметры.ПробегРазница  = стр.ПробегРазница;
			//ОбластьТабличнаяЧасть.Параметры.ПолныйБак = стр.ПолныйБак;
			
			ТабличныйДокумент.Вывести(ОбластьТабличнаяЧасть);
			
		КонецЦикла;
		
		//ТабличныйДокумент.Вывести(ОбластьПодвал);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, СсылкаНаОбъект);
		
		
		
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
	КонецЦикла;	
	Возврат ТабличныйДокумент;
	
	
	
КонецФункции

Функция НапечататьМакет_СТ(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "Макет_СТ";
	
	МакетОбработки = ПолучитьМакет("Макет_СТ");	 
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	МакетПечатнойФормы = ПолучитьМакет("Макет_СТ");
	
	ТабличныйДокумент.Очистить();
	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеТопливаЗапасов.Организация.ФайлЛоготип,
	|	СписаниеТопливаЗапасов.Организация.ФайлПечати
	|ИЗ
	|	Документ.СписаниеТопливаЗапасов КАК СписаниеТопливаЗапасов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	//
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
	//   
	
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Макет_СТ";
	//ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеТопливаЗапасов_Макет_СТ";
	//ТабличныйДокумент.АвтоМасштаб			= Истина;
	//Страница = 1;
	//
	ПервыйДокумент = Истина;
	
	Для Каждого СсылкаНаОбъект из МассивОбъектов Цикл
		//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СписаниеТопливаЗапасов.Макет_СТ");		
		ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка");
		ОбластьТабличнаяЧасть = МакетПечатнойФормы.ПолучитьОбласть("ТабличнаяЧасть");			
		ОбластьПодвал= МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		
		
		//Попытка
		ОбластьШапки.Параметры.Дата	= Формат(СсылкаНаОбъект.Дата , "ДФ=dd.MM.yyyy");
		//Исключение
		//КонецПопытки;
		 ОбластьШапки.Параметры.Организация = СсылкаНаОбъект.Организация;
		
		
		ОбластьШапки.Параметры.Номер = СсылкаНаОбъект.Номер;
		//ОбластьШапки.Параметры.Дата  = СсылкаНаОбъект.Дата
		
		ОбластьПодвал.Параметры.Ответственный = СсылкаНаОбъект.Ответственный;
		
		
		Если ЗначениеЗаполнено(СсылкаНаОбъект.Организация.ФайлЛоготип) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(СсылкаНаОбъект.Организация.ФайлЛоготип);
			ОбластьШапки.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
		КонецЕсли;
		
		
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		
		
		//МассивСтрок = Новый Массив; 
		//МассивСтрок.Очистить();		
		//МассивСтрок.Добавить(ОбластьПодвал);
		//МассивСтрок.Добавить(ОбластьПустаяСтрока);
		//МассивСтрок.Добавить(ОбластьПустаяСтрока);
		//МассивСтрок.Добавить(ОбластьПустаяСтрока);
		
		
		// КолЗапасов = СсылкаНаОбъект.ТаблицаПредложений.Количество();
		
		
		Для Каждого стр из СсылкаНаОбъект.Расходы Цикл
			
			ОбластьТабличнаяЧасть.Параметры.Номенклатура = стр.Номенклатура;
			ОбластьТабличнаяЧасть.Параметры.РасходыДата = Формат(стр.Дата, "ДФ=dd.MM.yyyy");
			ОбластьТабличнаяЧасть.Параметры.ЕдиницаИзмерения = Строка(стр.Количество) + стр.ЕдиницаИзмерения;
			ОбластьТабличнаяЧасть.Параметры.ВнеоборотныйАктив	 = стр.ВнеоборотныйАктив;
			ОбластьТабличнаяЧасть.Параметры.ПробегОкончание = стр.ПробегОкончание;
			ОбластьТабличнаяЧасть.Параметры.НомерВА  = стр.НомерВА;
			ОбластьТабличнаяЧасть.Параметры.ПробегНачало = стр.ПробегНачало;
			ОбластьТабличнаяЧасть.Параметры.ПробегРазница  = стр.ПробегРазница;
			ОбластьТабличнаяЧасть.Параметры.ПолныйБак = стр.ПолныйБак;
			
			ТабличныйДокумент.Вывести(ОбластьТабличнаяЧасть);
			
		КонецЦикла;
		
		//ТабличныйДокумент.Вывести(ОбластьПодвал);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, СсылкаНаОбъект);
		
		Если ЗначениеЗаполнено(СсылкаНаОбъект.Организация.ФайлПечати) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(СсылкаНаОбъект.Организация.ФайлПечати);
			ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДанныеКартинки);
		КонецЕсли;	
		
		
		
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
	КонецЦикла;	
	Возврат ТабличныйДокумент;
	
	
	
КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "Макет_СТ";
	КомандаПечати.Представление 					= НСтр("ka='საწვავის ჩამოწერის აქტი';ru='Списание топлива'");
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок 	                        = 1;
	//УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,"ВидОперации",Перечисления.ВидыОперацийСписаниеТопливаЗапасов.СписаниеТоплива);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "Макет_СМ";
	КомандаПечати.Представление 					= НСтр("ka='მასალების ჩამოწერის აქტი';ru='Списание материалов'");
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок                           = 2; 	 
	//УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,"ВидОперации",Перечисления.ВидыОперацийСписаниеТопливаЗапасов.СписаниеЗапасовНаВнеоборотныеАктивы);
	
КонецПроцедуры

#КонецОбласти