
#Область ПрограммныйИнтерфейс

// Функция осуществляет подключение устройства.
//
Функция ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	ПараметрыПодключения.Вставить("ИДУстройства", "");
	
	ВыходныеПараметры 	= Новый Массив();
	
	Интерфейс	 		= Неопределено;
	Порт         		= Неопределено;
	Скорость     		= Неопределено;
	Таймаут      		= Неопределено;
	IPАдрес      		= Неопределено;
    UDPПортПолучателя 	= Неопределено;
    UDPТаймаут  		= Неопределено;
	Пароль              = Неопределено;
	БыстраяЗагрузка		= Неопределено;

    Параметры.Свойство("Интерфейс"			, Интерфейс);
    Параметры.Свойство("Порт"				, Порт);
    Параметры.Свойство("Скорость"			, Скорость);
    Параметры.Свойство("Таймаут"			, Таймаут);
    Параметры.Свойство("IPАдрес"			, IPАдрес);
    Параметры.Свойство("UDPПортПолучателя"	, UDPПортПолучателя);
    Параметры.Свойство("UDPТаймаут"			, UDPТаймаут);
    Параметры.Свойство("Пароль"				, Пароль);
    Параметры.Свойство("БыстраяЗагрузка"	, БыстраяЗагрузка);
  

	Если Интерфейс			= Неопределено           
	 Или Порт				= Неопределено
	 Или Скорость			= Неопределено		
	 Или Таймаут			= Неопределено
	 Или IPАдрес			= Неопределено
	 Или UDPПортПолучателя	= Неопределено
	 Или UDPТаймаут			= Неопределено 
	 Или Пароль				= Неопределено
	 Тогда
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Не настроены параметры устройства."
"Для корректной работы устройства необходимо задать параметры его работы."
"Сделать это можно при помощи формы ""Настройка параметров"" модели"
"подключаемого оборудования в форме ""Подключение и настройка оборудования"".';ka='Не настроены параметры устройства."
"Для корректной работы устройства необходимо задать параметры его работы."
"Сделать это можно при помощи формы ""Настройка параметров"" модели"
"подключаемого оборудования в форме ""Подключение и настройка оборудования"".'"));

		Результат = Ложь;
	КонецЕсли; // Конец: Проверка параметров устройства

	Если Результат Тогда	
		Попытка
			ОбъектДрайвера.ДобавитьЛУ();
    		ПараметрыПодключения.ИДУстройства	= ОбъектДрайвера.НомерЛУ;
    		ОбъектДрайвера.ИнтерфейсЛУ 			= Интерфейс;
    		ОбъектДрайвера.Пароль				= Пароль;

    		Если Интерфейс = 0 Тогда
    			ОбъектДрайвера.COMПортЛУ       	 = Порт;
    			ОбъектДрайвера.СкоростьОбменаЛУ	 = Скорость;
    			ОбъектДрайвера.ТаймаутЛУ       	 = Таймаут;
    		Иначе
    			ОбъектДрайвера.АдресПолучателяЛУ = IPАдрес;
    			ОбъектДрайвера.ПортПолучателяЛУ  = UDPПортПолучателя;
    			ОбъектДрайвера.UDPТаймаутЛУ      = UDPТаймаут;
    		КонецЕсли;
			ОбъектДрайвера.УстановитьПараметрыЛУ();
		                     
		Исключение
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеРезультата);
    		Результат = Ложь;	
		КонецПопытки;
	КонецЕсли;
 	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет отключение устройства.
//
Функция ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	// Обязательные выходные
	ВыходныеПараметры = Новый Массив();
	Результат = Истина;

	Попытка
		ОбъектДрайвера.НомерЛУ = ПараметрыПодключения.ИДУстройства;
		ОбъектДрайвера.УстановитьАктивноеЛУ();
		ОбъектДрайвера.РазорватьСоединение();
		ОбъектДрайвера.ИндексЛУ = 0;
		
		ОбъектДрайвера.ПеречислитьЛУ();
		ОбъектДрайвера.УстановитьАктивноеЛУ();
		ОбъектДрайвера.НомерЛУ = ПараметрыПодключения.ИДУстройства;
		ОбъектДрайвера.УдалитьЛУ();  
	Исключение
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка отключения устройства';ka='Ошибка отключения устройства'"));
    	Результат = Ложь;	
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

// Функция получает, обрабатывает и перенаправляет на исполнение команду к драйверу
//
Функция ВыполнитьКоманду(Команда, ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено,
                         ОбъектДрайвера = Неопределено, Параметры, ПараметрыПодключения) Экспорт

	Результат = Истина;
	ВыходныеПараметры = Новый Массив();

	// Выгрузка товаров в весы с печатью этикеток
	Если Команда = "ВыгрузитьТовары" Тогда
		Товары 				= ВходныеПараметры[0];
		ЧастичнаяВыгрузка 	= ВходныеПараметры[1];
		Результат = ВыгрузитьТовары(ПараметрыПодключения[0], Товары, ЧастичнаяВыгрузка);
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция осуществляет выгрузку таблицы товаров в весы с печатью этикеток
//
Функция ВыгрузитьТовары(ПараметрыПодключения, Товары, ЧастичнаяВыгрузка) Экспорт
	
	АдресПрограмы = ПараметрыПодключения.АдресПрограмы;
	IPАдрес = ПараметрыПодключения.IPАдрес;
	
	Текст = Новый ТекстовыйДокумент;                                            
	Текст.УстановитьТипФайла(КодировкаТекста.ANSI); 
	
	ВременнаяСтрокаЗаписи = "";
	СтрокаГорячихКнопок = "";
	
	Для Каждого ТекСтр Из Товары Цикл	
		                    
		//Номенклатура = ТекСтр.Номенклатура;
		НаименованиеНоменклатуры = ТекСтр.НаименованиеНоменклатуры;
		
		HEXДлинаНаим =  DecToHex(СтрДлина(НаименованиеНоменклатуры));     				
		Шрифт = ПолучитьРазмерДляШрифта(СтрДлина(НаименованиеНоменклатуры));   				
		НеХватаетРазмера = 2 - СтрДлина(HEXДлинаНаим);   
		
		НехватающаяЧасть = "";
		
		Пока   НеХватаетРазмера<> 0 Цикл    				  
			НехватающаяЧасть = НехватающаяЧасть + "0"; 
			НеХватаетРазмера = НеХватаетРазмера - 1; 					
		КонецЦикла;	
		
		HEXДлинаНаим = НехватающаяЧасть + HEXДлинаНаим;       			
		
		НаимНомен = ?(СтрДлина(НаименованиеНоменклатуры)>52,Сред(НаименованиеНоменклатуры,1,52),НаименованиеНоменклатуры);
		НаименованиеТовараКод =   ПолучитьНаименование_GE_RU_DIGI_ДляПрямогоЭкспорта(НаимНомен);
		
		ItemPLU = Формат(Число(ТекСтр.PLU),"ЧЦ=8; ЧВН=; ЧГ=0");  			  
				
		Если ТекСтр.Весовая Тогда
			PLUSTATUS = "FE01";
		Иначе
			PLUSTATUS = "FF01";                                                                                                                                                             
		КонецЕсли;    			  
		
		ЦенаКопеек=Формат( Цел(Текстр.Цена*100) ,  "ЧЦ=8; ЧДЦ=0; ЧН=; ЧВН=; ЧГ=0" );   					  
		ЦенаКонечная=Строка(ЦенаКопеек);//8   
		
		ПолеШтрихКод=Сред(Текстр.Штрихкод,1,12);   				
		Срок = "0000";  				
		
		СтрокаПередРазмером = PLUSTATUS + "DD215F" + ЦенаКонечная + "1105" + ПолеШтрихКод + "00" + Срок + "00000000000000000000000000010000000000000000000000" + Шрифт + HEXДлинаНаим + НаименованиеТовараКод ; 
		
		//Формат არ იმუშავებს, რადგან ასოებიც შედის !!! ფორმატი თექვსმეტობით რიცხვებს ვერ აღიქვამს,  PluRecordSize სტრიქონია !!!!
		PluRecordSize =  DecToHex( (СтрДлина(СтрокаПередРазмером) + 16) /2 )  ; 
		
		НеХватаетРазмера = 4 - СтрДлина(PluRecordSize);    			  
		НехватающаяЧасть = "";    
		
		Пока   НеХватаетРазмера <> 0 Цикл  				  
			НехватающаяЧасть = НехватающаяЧасть + "0"; 
			НеХватаетРазмера = НеХватаетРазмера - 1; 				  
		КонецЦикла;		
		
		PluRecordSize = НехватающаяЧасть + PluRecordSize;   			  
		
		//წონითი FE01, არაწონითი FF01 , ცალ-ცალკე სტრიქონებად არ ვწერთ !!!! 
		ВременнаяСтрокаЗаписи = ВременнаяСтрокаЗаписи + ItemPLU + PluRecordSize + PLUSTATUS + "DD215F" + ЦенаКонечная + "1105" + ПолеШтрихКод + "00" 
		+ Срок + "00000000000000000000000000010000000000000000000000"+Шрифт +HEXДлинаНаим+НаименованиеТовараКод+"0C00"; 
		
		//"ცხელი ღილაკები"   - HOTKEYS
		ВыгрузитьКнопки = Ложь;
		Если  ВыгрузитьКнопки И НЕ ТекСтр.Button = 0  Тогда
			
			СтрокаГорячихКнопокПередРазмером = Строка( Формат(Текстр.Button,  "ЧЦ=8; ЧВН=; ЧГ=0") ) + "0000" + ItemPLU + "00" + ПолучитьНаименование_GE_RU_DIGI_ДляПрямогоЭкспорта("PLU") + "20" +
			ПолучитьНаименование_GE_RU_DIGI_ДляПрямогоЭкспорта(ТекСтр.PLU)+"20"; 			
			
			PLUHotKeyRecordSize = DecToHex ( СтрДлина (СтрокаГорячихКнопокПередРазмером)/ 2 ); 						
			
			НеХватаетРазмера = 4 - СтрДлина(PLUHotKeyRecordSize);    			  
			НехватающаяЧасть = "";    					
			Пока   НеХватаетРазмера <> 0 Цикл  				  
				НехватающаяЧасть = НехватающаяЧасть + "0"; 
				НеХватаетРазмера = НеХватаетРазмера - 1; 				  
			КонецЦикла;		
			
			PLUHotKeyRecordSize = НехватающаяЧасть + PLUHotKeyRecordSize;
			
			СтрокаГорячихКнопок =СтрокаГорячихКнопок + Строка( Формат(Текстр.Button,  "ЧЦ=8; ЧВН=; ЧГ=0") ) + PLUHotKeyRecordSize + ItemPLU + "00" + ПолучитьНаименование_GE_RU_DIGI_ДляПрямогоЭкспорта("PLU") + "20" +
			ПолучитьНаименование_GE_RU_DIGI_ДляПрямогоЭкспорта(ТекСтр.PLU) + "20";		
			
		КонецЕсли;	
		
	КонецЦикла;	  
	
	СтрокаДляЗадачи = "";
	СтрокаДляЗадачиКнопок = "";
	
	Если Не ВременнаяСтрокаЗаписи = "" Тогда
		
		Текст.ДобавитьСтроку(ВременнаяСтрокаЗаписи);				
		
		
			
		Если Не Найти ( IPАдрес,"." ) = 0 Тогда	
			
			ФорматIP =  СтрЗаменить(СтрЗаменить(IPАдрес," ",""),Символы.Таб,""); 							
			ПослБайтIP =  Домейн(ФорматIP,Истина);		
			
			Если  ПослБайтIP=-1 Тогда	
				Сообщить("სასწორის მისამართი"+ IPАдрес + "არასწორია !");
				Возврат Ложь;
			КонецЕсли;
			
			ИмяФайлаВыгрузки = АдресПрограмы + "\SM" + ПослБайтIP + "F25.DAT";  					
			СтрокаДляЗадачи = СтрокаДляЗадачи + Домейн(ФорматIP,Истина)+" ";     				
			
			Попытка
				Текст.Записать(ИмяФайлаВыгрузки, КодировкаТекста.ANSI);       					
			Исключение
				Сообщить("ვერ მოხერხდა მონაცემების გადატვირთვა. გადაამოწმეთ სასწორის მისამართი");
				Возврат Ложь;
			КонецПопытки;   
		Иначе
			Сообщить("სასწორის მისამართი"+ IPАдрес + "არასწორია !");					
		КонецЕсли;	
		
		
		
		Если НЕ СтрокаГорячихКнопок ="" Тогда
			
			ТекстКнопок = Новый ТекстовыйДокумент;      					
			ТекстКнопок.ДобавитьСтроку(СтрокаГорячихКнопок);
			
			
				
				Если Не Найти ( IPАдрес,"." ) = 0 Тогда	 							
					ФорматIP =  СтрЗаменить(СтрЗаменить(IPАдрес," ",""),Символы.Таб,""); 							
					ПослБайтIP =  Домейн(ФорматIP,Истина);		
					
					Если  ПослБайтIP=-1 Тогда	
						Сообщить("სასწორის მისამართი"+ IPАдрес + "არასწორია !");
						Возврат Ложь;
					КонецЕсли;
					
					ИмяФайлаВыгрузкиКнопок = АдресПрограмы + "\SM" + ПослБайтIP + "F41.DAT";  					
					СтрокаДляЗадачиКнопок = СтрокаДляЗадачиКнопок + Домейн(ФорматIP,Истина)+" ";     				
					
					Попытка
						ТекстКнопок.Записать(ИмяФайлаВыгрузкиКнопок, КодировкаТекста.ANSI);       					
					Исключение
						Сообщить("ვერ მოხერხდა მონაცემების გადატვირთვა(""ცხელი კლავიშების"" განლაგება). გადაამოწმეთ სასწორის მისამართი");
						Возврат Ложь;
					КонецПопытки;  
					
				Иначе
					
					Сообщить("სასწორის მისამართი"+ IPАдрес + "არასწორია !");	
					
				КонецЕсли;	
				
			
			
		КонецЕсли;	  				
		
		АдресДрайвера = АдресПрограмы+"\twswtcp.exe";
		Драйвер = Новый Файл(АдресДрайвера);
				
		Если НЕ СтрокаДляЗадачи = "" Тогда
			
			ТекстЗадачи = Новый ТекстовыйДокумент;   					
			ТекстЗадачи.ДобавитьСтроку("TWSWTCP F25 "+СтрокаДляЗадачи);
			ТекстЗадачи.Записать(АдресПрограмы+"\ExportDataIntoScales.bat",КодировкаТекста.ANSI);					
			ЗапуститьПриложение("ExportDataIntoScales.bat",АдресПрограмы,Истина); 
			
			ERROR = Новый ТекстовыйДокумент;
			
			ERROR.Прочитать(АдресПрограмы +"\error");
			
			ТекстОшиб = ERROR.ПолучитьТекст();//+";";
			
			Пока ТекстОшиб <> "0" Цикл
				
				АдресНеудачногоВеса = Сред( ТекстОшиб,1,Найти(ТекстОшиб,";")-1);
				Сообщить("სასწორთან მისამართით " + АдресНеудачногоВеса +  " დაკავშირებისას მოხდა შეცდომა, PLU გადატვირთვა წარუმატებელია! გადაამოწმეთ სასწორის აწყობები");
				ТекстОшиб = Сред (ТекстОшиб, Найти(ТекстОшиб,";")+1, СтрДлина(ТекстОшиб));
				Возврат Ложь;
			КонецЦикла;	
			
		КонецЕсли;	
		
		Если НЕ СтрокаДляЗадачиКнопок = "" Тогда
			
			ТекстЗадачиКнопок = Новый ТекстовыйДокумент;   					
			ТекстЗадачиКнопок.ДобавитьСтроку("TWSWTCP F41 "+СтрокаДляЗадачиКнопок);
			ТекстЗадачиКнопок.Записать(АдресПрограмы+"\ExportHotkeysIntoScales.bat",КодировкаТекста.ANSI);					
			ЗапуститьПриложение("ExportHotkeysIntoScales.bat",АдресПрограмы,Истина);  
			
			ERROR = Новый ТекстовыйДокумент;
			
			ERROR.Прочитать(АдресПрограмы +"\error");
			
			ТекстОшиб = ERROR.ПолучитьТекст()+";";
			
			Пока Не Найти(ТекстОшиб,";") = 0 Цикл
				
				АдресНеудачногоВеса = Сред( ТекстОшиб,1,Найти(ТекстОшиб,";")-1);
				Сообщить("სასწორთან მისამართით " + АдресНеудачногоВеса +  " დაკავშირებისას მოხდა შეცდომა, ""ცხელი ღილაკების"" გადატვირთვა წარუმატებელია! გადაამოწმეთ სასწორის აწყობები");
				ТекстОшиб = Сред (ТекстОшиб, Найти(ТекстОшиб,";")+1, СтрДлина(ТекстОшиб));
				
				
			КонецЦикла;	    
			
		КонецЕсли;
		
	КонецЕсли;	
	

	
	
	
КонецФункции

Функция DecToHex(_Число)
	
                База = 16;
                Результат = "";
                Пока _Число <> 0 Цикл
                               Поз =_Число % База;
                               Результат = Сред("0123456789ABCDEF", Поз + 1, 1) + Результат;
                               _Число = Цел(_Число / База);
                КонецЦикла;
                Возврат Результат;
				
КонецФункции // DecToHex() 

Функция ПолучитьРазмерДляШрифта(Длина)
	
	Если Длина < 15 Тогда 		
		Возврат "08";     		
	ИначеЕсли Длина < 20 Тогда
		Возврат "08";
	ИначеЕсли Длина < 25 Тогда
		Возврат "07";	
	ИначеЕсли Длина < 28 Тогда	
		Возврат "06";
	ИначеЕсли Длина < 33 Тогда	
		Возврат "05";
	ИначеЕсли Длина < 35 Тогда	
		Возврат "03";
	ИначеЕсли Длина < 43 Тогда	
		Возврат "02";
	Иначе
		Возврат "01";
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьНаименование_GE_RU_DIGI_ДляПрямогоЭкспорта(Наименование) Экспорт
	
	//გასაღებებად გვინდოდა სიმბოლოებიც, რაც სტრუქტურას არ შეუძლია
	СоответствиеКодировки = Новый Соответствие;
	
	СоответствиеКодировки.Вставить("0", "30");
	СоответствиеКодировки.Вставить("1", "31");
	СоответствиеКодировки.Вставить("2", "32");
	СоответствиеКодировки.Вставить("3", "33");
	СоответствиеКодировки.Вставить("4", "34");
	СоответствиеКодировки.Вставить("5", "35");
	СоответствиеКодировки.Вставить("6", "36");
	СоответствиеКодировки.Вставить("7", "37");
	СоответствиеКодировки.Вставить("8", "38");
	СоответствиеКодировки.Вставить("9", "39");	  	
	
	СоответствиеКодировки.Вставить("a", "61");
	СоответствиеКодировки.Вставить("b", "62");
	СоответствиеКодировки.Вставить("c", "63");
	СоответствиеКодировки.Вставить("d", "64");
	СоответствиеКодировки.Вставить("e", "65");
	СоответствиеКодировки.Вставить("f", "66");
	СоответствиеКодировки.Вставить("g", "67");
	СоответствиеКодировки.Вставить("h", "68");
	СоответствиеКодировки.Вставить("i", "69");
	СоответствиеКодировки.Вставить("j", "6A");
	СоответствиеКодировки.Вставить("k", "6B");
	СоответствиеКодировки.Вставить("l", "6C");
	СоответствиеКодировки.Вставить("m", "6D");
	СоответствиеКодировки.Вставить("n", "6E");
	СоответствиеКодировки.Вставить("o", "6F");
	СоответствиеКодировки.Вставить("p", "70");
	СоответствиеКодировки.Вставить("q", "71");
	СоответствиеКодировки.Вставить("r", "72");
	СоответствиеКодировки.Вставить("s", "73");
	СоответствиеКодировки.Вставить("t", "74");
	СоответствиеКодировки.Вставить("u", "75");
	СоответствиеКодировки.Вставить("v", "76");
	СоответствиеКодировки.Вставить("w", "77");
	СоответствиеКодировки.Вставить("x", "78");
	СоответствиеКодировки.Вставить("y", "79");
	СоответствиеКодировки.Вставить("z", "7A");
	
	СоответствиеКодировки.Вставить("A", "41");
	СоответствиеКодировки.Вставить("B", "42");
	СоответствиеКодировки.Вставить("C", "43");
	СоответствиеКодировки.Вставить("D", "44");
	СоответствиеКодировки.Вставить("E", "45");
	СоответствиеКодировки.Вставить("F", "46");
	СоответствиеКодировки.Вставить("G", "47");
	СоответствиеКодировки.Вставить("H", "48");
	СоответствиеКодировки.Вставить("I", "49");
	СоответствиеКодировки.Вставить("J", "4A");
	СоответствиеКодировки.Вставить("K", "4B");
	СоответствиеКодировки.Вставить("L", "4C");
	СоответствиеКодировки.Вставить("M", "4D");
	СоответствиеКодировки.Вставить("N", "4E");
	СоответствиеКодировки.Вставить("O", "4F");
	СоответствиеКодировки.Вставить("P", "50");
	СоответствиеКодировки.Вставить("Q", "51");
	СоответствиеКодировки.Вставить("R", "52");
	СоответствиеКодировки.Вставить("S", "53");
	СоответствиеКодировки.Вставить("T", "54");
	СоответствиеКодировки.Вставить("U", "55");
	СоответствиеКодировки.Вставить("V", "56");
	СоответствиеКодировки.Вставить("W", "57");
	СоответствиеКодировки.Вставить("X", "58");
	СоответствиеКодировки.Вставить("Y", "59");
	СоответствиеКодировки.Вставить("Z", "5A"); 
	
	СоответствиеКодировки.Вставить("ა", "C0");
	СоответствиеКодировки.Вставить("ბ", "C1");
	СоответствиеКодировки.Вставить("გ", "C2");
	СоответствиеКодировки.Вставить("დ","C3");
	СоответствиеКодировки.Вставить("ე","C4");
	СоответствиеКодировки.Вставить("ვ","C5");
	СоответствиеКодировки.Вставить("ზ","C6");
	СоответствиеКодировки.Вставить("თ","C8");
	СоответствиеКодировки.Вставить("ი","C9");
	СоответствиеКодировки.Вставить("კ","CA");
	СоответствиеКодировки.Вставить("ლ","CB");
	СоответствиеКодировки.Вставить("მ","CC");
	СоответствиеКодировки.Вставить("ნ","CD");
	СоответствиеКодировки.Вставить("ო","CF");
	СоответствиеКодировки.Вставить("პ","D0");
	СоответствиеКодировки.Вставить("ჟ","D1");
	СоответствиеКодировки.Вставить("რ","D2");
	СоответствиеКодировки.Вставить("ს","D3");
	СоответствиеКодировки.Вставить("ტ","D4");
	СоответствиеКодировки.Вставить("უ","D6");
	СоответствиеКодировки.Вставить("ფ","D7");
	СоответствиеКодировки.Вставить("ქ","D8");
	СоответствиеКодировки.Вставить("ღ","D9");
	СоответствиеКодировки.Вставить("ყ","DA");
	СоответствиеКодировки.Вставить("შ","DB");
	СоответствиеКодировки.Вставить("ჩ","DC");
	СоответствиеКодировки.Вставить("ც","DD");
	СоответствиеКодировки.Вставить("ძ","DE");
	СоответствиеКодировки.Вставить("წ","DF");
	СоответствиеКодировки.Вставить("ჭ","E0");
	СоответствиеКодировки.Вставить("ხ","E1");
	СоответствиеКодировки.Вставить("ჯ","E3");
	СоответствиеКодировки.Вставить("ჰ","E4"); 	
	
	СоответствиеКодировки.Вставить(",",  "2C"); 
	СоответствиеКодировки.Вставить(" ",  "20");
	СоответствиеКодировки.Вставить("""", "22");
	СоответствиеКодировки.Вставить("(",  "7B");
	СоответствиеКодировки.Вставить(")",  "7D");
	СоответствиеКодировки.Вставить("%",  "25");
	СоответствиеКодировки.Вставить("”",  "22");

	НаименованиеДляВесевогоТовара = "";
	Символ = "";
	
	Для Счт = 1 По СтрДлина(Наименование) Цикл
		
		ГрузинскийСимвол = Сред(Наименование, Счт, 1);    		
		
		Если СтрЧислоВхождений("0123456789აბგდევზთიკლმნოპჟრსტუფქღყშჩცძწჭხჯჰABCDEFGHIJKLMNJPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz,()%-”""",ГрузинскийСимвол) > 0 Тогда 
			Символ = СоответствиеКодировки.Получить(ГрузинскийСимвол);  			
		Иначе   			
			Символ = "20"; 			
		КонецЕсли;     
		
		НаименованиеДляВесевогоТовара = НаименованиеДляВесевогоТовара + Символ; 
		
	КонецЦикла;
	
	Возврат НаименованиеДляВесевогоТовара;   	
	
КонецФункции

Функция  Домейн(IP,ДляЗадачи = Ложь)  Экспорт	
	
	   ScaleIP =  IP;    
	   
	   IPLastByte ="";
	   ИндексПоследнейТочки = СтрДлина(ScaleIP);
	   
	   НетТочки = Истина;
	   Счет = 0;
	   
	   Пока НетТочки Цикл  
		   
		   ВремСтрок = Сред (ScaleIP,ИндексПоследнейТочки,СтрДлина(ScaleIP));     		   
		   Если   Не Найти(ВремСтрок,".") = 0 Тогда   
			   НетТочки = Ложь;
			   Прервать;
		   КонецЕсли;
		   ИндексПоследнейТочки =  ИндексПоследнейТочки - 1;
		   IPLastByte =  ВремСтрок; 
		   Счет = Счет+1; 
		   
		   Если Счет >4 Тогда
			   Возврат -1;
		   КонецЕсли;	   
		 		   
	   КонецЦикла;	 
	   
	   Если ДляЗадачи Тогда   
		   Возврат  IPLastByte;
	   Иначе   
		   Возврат  "S0"+Формат(IPLastByte,"ЧЦ=3; ЧВН=; ЧГ=0");
	   КонецЕсли;
	   
КонецФункции	

// Функция осуществляет выгрузку позиции в весы с печатью этикеток.
//
Функция Выгрузить(ОбъектДрайвера, ВыходныеПараметры, PLU, КодТовара, Наименование, Цена, СрокХранения)
	
	Результат = Истина;
	ВремНаименование = СокрЛП(Наименование);
	ОбъектДрайвера.НомерПЛУ = PLU;
	ОбъектДрайвера.ПервоеНаименованиеТовара = ?(СтрДлина(ВремНаименование) > 28, Лев(ВремНаименование, 28), ВремНаименование);
	ОбъектДрайвера.ВтороеНаименованиеТовара = ?(СтрДлина(ВремНаименование) > 28, Сред(ВремНаименование, 29), "");
	ОбъектДрайвера.Тара                     = 0;
	Если СрокХранения > 0 Тогда
		ОбъектДрайвера.СрокХранения   = СрокХранения;     
		ОбъектДрайвера.ДатаРеализации = Дата(2001, 1, 1);
	Иначе
		ОбъектДрайвера.СрокХранения   = 0;     
		ОбъектДрайвера.ДатаРеализации = 0;
	КонецЕсли;
	ОбъектДрайвера.Цена             = Число(Цена);
	ОбъектДрайвера.ГрупповойКод     = 0;
	ОбъектДрайвера.КодТовара        = Число(КодТовара);
	ОбъектДрайвера.НомерИзображения = 0;
	ОбъектДрайвера.КодРОСТЕСТ       = " ";
	ОбъектДрайвера.ТипТовара        = 0;
	
	Если Число(ОбъектДрайвера.ВерсияКЭ) >= 3.0 Тогда
		
		ОбъектДрайвера.ДобавитьДанныеПЛУКБлокуДанных();
		
		Если ОбъектДрайвера.Результат = -21 Тогда // Блок полон – отправляем, а товар позже запишем в очищенный блок
			Если ОбъектДрайвера.ЗаписатьБлокДанныхПЛУ() <> 0 Тогда 
				ВыходныеПараметры.Очистить();
				ВыходныеПараметры.Добавить(999);
				ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеРезультата);
				Результат = Ложь;
			КонецЕсли;
			ОбъектДрайвера.ОчиститьБлокДанных();
			ОбъектДрайвера.ДобавитьДанныеПЛУКБлокуДанных();
		КонецЕсли
		
	Иначе
		Если ОбъектДрайвера.ЗаписатьДанныеПЛУ() <> 0 Тогда
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеРезультата);
			Результат = Ложь;	
		КонецЕсли;
	КонецЕсли;
		
	Если НЕ Результат  Тогда
		ОбъектДрайвера.БыстраяЗагрузка = 0;
		ОбъектДрайвера.УстановитьРежимЗагрузки();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НачатьВыгрузку(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;

	ПрефиксШтрихкодаВесовогоТовара   = "2" + МенеджерОборудованияВызовСервераПереопределяемый.ПолучитьПрефиксВесовогоТовара(Параметры.Идентификатор);
    ПрефиксШтучногоФасованногоТовара = "2" + МенеджерОборудованияВызовСервераПереопределяемый.ПолучитьПрефиксШтучногоТовара(Параметры.Идентификатор);

	// Инициализация префиксов
	ОбъектДрайвера.ИтоговыйПрефиксШК = 0;
	ОбъектДрайвера.ТипПрефиксаШК = 2;

	Если ОбъектДрайвера.УстановитьИтоговыйПрефиксШК() <> 0
	   И ОбъектДрайвера.УстановитьТипПрефиксаШК() <> 0 Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеРезультата);
		Результат = Ложь;	
	Иначе
		ОбъектДрайвера.ПолучитьПрефиксШК();
			
		Если ОбъектДрайвера.ШтучныйПрефиксШК = Число(ПрефиксШтрихкодаВесовогоТовара)
		   И ОбъектДрайвера.ВесовойПрефиксШК = Число(ПрефиксШтучногоФасованногоТовара) Тогда
			Для ПроизвольныйПрефикс = 20 По 29 Цикл
					
				Если ПроизвольныйПрефикс <> Число(ПрефиксШтрихкодаВесовогоТовара)
				   И ПроизвольныйПрефикс <> Число(ПрефиксШтучногоФасованногоТовара) Тогда
					ОбъектДрайвера.ВесовойПрефиксШК = ПроизвольныйПрефикс;
					ОбъектДрайвера.УстановитьВесовойПрефиксШК();
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			ОбъектДрайвера.ШтучныйПрефиксШК = Число(ПрефиксШтучногоФасованногоТовара);
			ОбъектДрайвера.УстановитьШтучныйПрефиксШК();
			ОбъектДрайвера.ВесовойПрефиксШК = Число(ПрефиксШтрихкодаВесовогоТовара);
			ОбъектДрайвера.УстановитьВесовойПрефиксШК();
				
			Если ОбъектДрайвера.Результат <> 0 Тогда
				ВыходныеПараметры.Очистить();
				ВыходныеПараметры.Добавить(999);
				ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеРезультата);
				Результат = Ложь;	
			КонецЕсли;
				                 
		ИначеЕсли ОбъектДрайвера.ШтучныйПрефиксШК = Число(ПрефиксШтрихкодаВесовогоТовара) Тогда
			ОбъектДрайвера.ШтучныйПрефиксШК = Число(ПрефиксШтучногоФасованногоТовара);
			ОбъектДрайвера.УстановитьШтучныйПрефиксШК();
			
			ОбъектДрайвера.ВесовойПрефиксШК = Число(ПрефиксШтрихкодаВесовогоТовара);
			ОбъектДрайвера.УстановитьВесовойПрефиксШК();

			Если ОбъектДрайвера.Результат <> 0 Тогда
				ВыходныеПараметры.Очистить();
				ВыходныеПараметры.Добавить(999);
				ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеРезультата);
				Результат = Ложь;	
			КонецЕсли;
		Иначе
			
			Если Число(ПрефиксШтрихкодаВесовогоТовара) > 9 Тогда	
				ОбъектДрайвера.ВесовойПрефиксШК = Число(ПрефиксШтрихкодаВесовогоТовара);
				ОбъектДрайвера.УстановитьВесовойПрефиксШК();
			Если ОбъектДрайвера.Результат <> 0 Тогда
					ВыходныеПараметры.Очистить();
					ВыходныеПараметры.Добавить(999);
					ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеРезультата);
					Результат = Ложь;	
				КонецЕсли;
			КонецЕсли;
			
			
			Если Число(ПрефиксШтучногоФасованногоТовара) > 9 Тогда	
				ОбъектДрайвера.ШтучныйПрефиксШК = Число(ПрефиксШтучногоФасованногоТовара);
				ОбъектДрайвера.УстановитьШтучныйПрефиксШК();
				Если ОбъектДрайвера.Результат <> 0 Тогда
					ВыходныеПараметры.Очистить();
					ВыходныеПараметры.Добавить(999);
					ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеРезультата);
					Результат = Ложь;	
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Деинициализацию процедуры выгрузки данных в весы с печатью этикеток.
Функция ЗавершитьВыгрузку(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) 
	
	Результат = Истина;
	
	Если Число(ОбъектДрайвера.ВерсияКЭ) >= 3.0 Тогда
		Если ОбъектДрайвера.ЗаписатьБлокДанныхПЛУ() <> 0 Тогда
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеРезультата);
			Результат = Ложь;	
		КонецЕсли;
		ОбъектДрайвера.ОчиститьБлокДанных(); 
	КонецЕсли;
	
	ОбъектДрайвера.БыстраяЗагрузка = 0;
	Если ОбъектДрайвера.УстановитьРежимЗагрузки() <> 0 Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеРезультата);
		Результат = Ложь;	
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Функция осуществляет очистку таблицы товаров в весы с печатью этикеток.
//
Функция ОчиститьТоварыВВесах(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт

	// Обязательные выходные
	ВыходныеПараметры = Новый Массив();
	Результат = Истина;
	
	
	
	ОбъектДрайвера.НомерЛУ = ПараметрыПодключения.ИДУстройства;
	ОбъектДрайвера.УстановитьАктивноеЛУ();

	Если ОбъектДрайвера.УстановитьСоединение() <> 0 Тогда	
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеРезультата);
		Результат = Ложь;
	Иначе
		Если ОбъектДрайвера.ОчиститьБазуТоваровИСообщений() <> 0 Тогда
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеРезультата);
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Функция осуществляет проверку путей по которым хранятся файлы обмена
//
Функция ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	
	Попытка
		ОбъектДрайвера.ДобавитьЛУ();
   		ОбъектДрайвера.ИнтерфейсЛУ 			= Параметры.Интерфейс;
   		ОбъектДрайвера.Пароль				= Параметры.Пароль;
		
		Если Параметры.Интерфейс = 0 Тогда
    		ОбъектДрайвера.COMПортЛУ       	 = Параметры.Порт;
    		ОбъектДрайвера.СкоростьОбменаЛУ	 = Параметры.Скорость;
    		ОбъектДрайвера.ТаймаутЛУ       	 = Параметры.Таймаут;
    	Иначе
    		ОбъектДрайвера.АдресПолучателяЛУ = Параметры.IPАдрес;
    		ОбъектДрайвера.ПортПолучателяЛУ  = Параметры.UDPПортПолучателя;
    		ОбъектДрайвера.UDPТаймаутЛУ      = Параметры.UDPТаймаут;
    	КонецЕсли;
				
		ОбъектДрайвера.УстановитьПараметрыЛУ();
   		ОбъектДрайвера.УстановитьАктивноеЛУ();

				
		Если ОбъектДрайвера.УстановитьСоединение() <> 0 Тогда
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеРезультата);
	   		Результат = Ложь;	
		КонецЕсли;
	Исключение
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Не опознанная ошибка.';ka='Не опознанная ошибка.'"));
   		Результат = Ложь;	
	КонецПопытки;
				
	Возврат Результат;
	
КонецФункции

// Функция возвращает версию установленного драйвера
//
Функция ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;

	ВыходныеПараметры.Добавить(НСтр("ka='დაყენებულია';ru='Установлен'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определена';ka='Не определена'"));

	Попытка
		ВыходныеПараметры[1] = СтрЗаменить(ОбработатьВерсиюДрайвера(ОбъектДрайвера.ВерсияФайлаСТ), "1.", "A ")  + "."
				              + ОбработатьВерсиюДрайвера(ОбъектДрайвера.ВерсияФайлаМЛ);
    Исключение
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Обработка версии драйвера
Функция ОбработатьВерсиюДрайвера(ВерсияИзДрайвера)
	
	//Преобразуем в двоичное значение
	ДвоичноеЗначение = "";
	ОстатокЗначения = ВерсияИзДрайвера;
	Пока ОстатокЗначения > 0 Цикл
		РезультатДеления = ОстатокЗначения / 2;
		ДвоичноеЗначение = ?(РезультатДеления = Цел(РезультатДеления), "0", "1") + ДвоичноеЗначение;
		ОстатокЗначения  = Цел(РезультатДеления);
	КонецЦикла;

	// Выделим старшую и младшую части
	СтаршаяЧасть = ?(СтрДлина(ДвоичноеЗначение) > 16, Сред(ДвоичноеЗначение, 1, СтрДлина(ДвоичноеЗначение) - 16), "0");
	МладшаяЧасть = ?(СтрДлина(ДвоичноеЗначение) > 16, Прав(ДвоичноеЗначение, 16), ДвоичноеЗначение);

	ДесятичноеЗначение = 0;
	Для ТекущийСимвол = 1 По СтрДлина(СтаршаяЧасть) Цикл
		ДесятичноеЗначение = ДесятичноеЗначение * 2 + Число(Сред(СтаршаяЧасть, ТекущийСимвол, 1));
	КонецЦикла;
	ВерсияДрайвера = Строка(ДесятичноеЗначение) + ".";

	ДесятичноеЗначение = 0;
	Для ТекущийСимвол = 1 По СтрДлина(МладшаяЧасть) Цикл
		ДесятичноеЗначение = ДесятичноеЗначение * 2 + Число(Сред(МладшаяЧасть, ТекущийСимвол, 1));
	КонецЦикла;
	ВерсияДрайвера = ВерсияДрайвера + Строка(ДесятичноеЗначение);

	Возврат ВерсияДрайвера;

КонецФункции

#КонецОбласти