
&НаСервере
Процедура КомандаОтправитьПисьмо(НавигационнаяСсылка, Автор) Экспорт
	
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду("0000000267");
	
	Событие = Документы.Событие.СоздатьДокумент();
	Событие.Дата = ТекущаяДата();
	Событие.Тема = "ნაშთების ცვლილება საწყობზე: 'ალექსი ზვიადაძე' ";
	Событие.ТипСобытия     = Перечисления.ТипыСобытий.ЭлектронноеПисьмо;
	Событие.Состояние      = Справочники.СостоянияСобытий.Запланировано;
	Событие.Важность       = Перечисления.ВариантыВажности.Обычная;
	Событие.Ответственный  = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнойОтветственный");
	Событие.Автор          = Пользователи.АвторизованныйПользователь();
	Событие.УчетнаяЗапись  = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	//Событие.Содержание = ПолучитьТекст("გიორგი მამულაშვილი", "e1cib/data/Документ.Событие?ref=9179000c29f6a05711ed644dd1bd18e8");
	
	Событие.СодержаниеHTML = ПолучитьТекст_HTML(Автор.Наименование, НавигационнаяСсылка);
	
	НоваяСтрока = Событие.Участники.Добавить();
	НоваяСтрока.Контакт = Сотрудник.Наименование;
	НоваяСтрока.КакСвязаться = "aleksi.zviadadze@azry.com"; // TODO .. მეილი ასაღებია მოხმარებლის ობიექტიდან ან პროცედურას უნდა გადმოეცეს
	//НоваяСтрока.КакСвязаться = "teona.tsuleiskiri@azry.com";
	
	Событие.Записать();
	
	Событие.ОтправитьЭлектронноеПисьмо();
	
КонецПроцедуры

Функция ПолучитьТекст_HTML(АвторДокумента, СсылкаДокумента)

	Текст = "<table border=""1"" cellpadding=""1"" cellspacing=""1"" style=""width:500px"">";
	Текст = Текст + "<thead>";
	Текст = Текст + "<tr>";
	Текст = Текст + "<th scope=""col""><strong>დასახელება</strong></th>";
	Текст = Текст + "<th scope=""col""><strong>მნიშვნელობა</strong></th>";
	Текст = Текст + "</tr>";
	Текст = Текст + "</thead>";
	
	Текст = Текст + "<tbody>";
	Текст = Текст + "<tr>";
	Текст = Текст + "<td>ცვლილების ავტორი</td>";
	Текст = Текст + "<td>"+АвторДокумента+"</td>";
	Текст = Текст + "</tr>";
	Текст = Текст + "<tr>";
	Текст = Текст + "<td>დოკუმენტის ლინკი</td>";
	Текст = Текст + "<td>"+СсылкаДокумента+"</td>";
	Текст = Текст + "</tr>";
	Текст = Текст + "</tbody>";
	Текст = Текст + "</table>";
	
	Возврат Текст;

КонецФункции

Функция ПолучитьТекст(АвторДокумента, СсылкаДокумента)

	Текст = " ცვლილების ავტორი: &Парам1 <br>  
			 | დოკუმენტის ლინკი: &Парам2";
	
	Текст = СтрЗаменить(Текст, "&Парам1", АвторДокумента);
	Текст = СтрЗаменить(Текст, "&Парам2", СсылкаДокумента);
	
	Возврат Текст;

КонецФункции
 