
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
		
		ОбъектВладелец = Параметры.Отбор.Владелец;
		
		Если ТипЗнч(ОбъектВладелец) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			Если НЕ ЗначениеЗаполнено(ОбъектВладелец)
				ИЛИ НЕ ОбъектВладелец.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас
				И НЕ ОбъектВладелец.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
				И НЕ ОбъектВладелец.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
				
				АвтоЗаголовок = Ложь;
				Заголовок = НСтр("ka='მახასიათებლები ინახება მხოლოდ მარაგებისთვის, მომსახურებებისთვის და სამუშაოებისთვის';ru='Характеристики хранятся только для запасов, услуг и работ';en='Features are only stored for inventory, services and works'");
				
				Элементы.Список.ТолькоПросмотр = Истина;
				
			КонецЕсли;
			
			НаборДопРеквизитов = ОбъектВладелец.КатегорияНоменклатуры.НаборСвойствХарактеристики;
			
		ИначеЕсли ТипЗнч(ОбъектВладелец) = Тип("СправочникСсылка.КатегорииНоменклатуры") Тогда
			
			НаборДопРеквизитов = ОбъектВладелец.НаборСвойствХарактеристики;
			
		Иначе
			
			Элементы.ИзменитьСоставДополнительныхРеквизитов.Видимость = Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Элементы.ИзменитьСоставДополнительныхРеквизитов.Видимость = Ложь;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	ИмяКлючаОбъекта = СтрЗаменить(ЭтотОбъект.ИмяФормы,".","");
	СохраненноеЗначение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+"_ВидимостьПанелиОтборов", Истина);
	Если ЗначениеЗаполнено(СохраненноеЗначение) Тогда
		Элементы.ПереключениеИзображений.Видимость = СохраненноеЗначение;
		Элементы.ДекорацияРазвернутьОтборы.Видимость = НЕ СохраненноеЗначение;
	КонецЕсли;
	
	//+++ Lazare_27.05.2021
	ВидимостАктивироватьСнятьАктивацию = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			Пользователи.ТекущийПользователь(),
			"УправлениеСхарактеристикамиНоменклатуры") И
			УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункциональнаяОпцияИспользоватьХарактеристики");				
	Элементы.ФормаАктивироватьСнятьАктивацию.Видимость = ВидимостАктивироватьСнятьАктивацию ;
	Элементы.ИспользуетсяВдокументах.Видимость = ВидимостАктивироватьСнятьАктивацию ;
	//--- Lazare_27.05.2021
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	СохранитьНастройкиОтборов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПрисоединенныйФайл" Тогда
		ОбновитьПросмотрИзображений();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик события Выполнить команды ИзменитьСоставДополнительныхРеквизитов.
//
Процедура ИзменитьСоставДополнительныхРеквизитов(Команда)
	
	Если НЕ ЗначениеЗаполнено(НаборДопРеквизитов) Тогда
		ПоказатьПредупреждение(,
			НСтр("ru='Не удалось получить наборы дополнительных реквизитов объекта."
""
"Возможно у объекта не заполнены необходимые реквизиты.';ka='ობიექტის დამატებითი რეკვიზიტების კრებულების მიღება ვერ მოხერხდა."
""
"შეიძლება, ობიექტს შევსებული არ აქვს აუცილებელი რეკვიზიტები.'")
		);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПоказатьДополнительныеРеквизиты");
	
	ОткрытьФорму("Справочник.НаборыДополнительныхРеквизитовИСведений.ФормаСписка", ПараметрыФормы);
	
	ПараметрыПерехода = Новый Структура;
	ПараметрыПерехода.Вставить("Набор", НаборДопРеквизитов);
	ПараметрыПерехода.Вставить("Свойство", Неопределено);
	ПараметрыПерехода.Вставить("ЭтоДополнительноеСведение", Ложь);
	
	Оповестить("Переход_НаборыДополнительныхРеквизитовИСведений", ПараметрыПерехода);
	
КонецПроцедуры // ИзменитьСоставДополнительныхРеквизитов()

// При клике на Характеристику из списка подключаем вывод картинки.
//
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если Элементы.ПереключениеИзображений.Видимость
			И НЕ ТекущаяХарактеристика = Элементы.Список.ТекущиеДанные.Ссылка Тогда
			
			ТекущаяХарактеристика = Элементы.Список.ТекущиеДанные.Ссылка;
			ПодключитьОбработчикОжидания("ДобавитьПросмотрИзображенийКлиент", 0.1, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПросмотрИзображенийКлиент()

	ДобавитьПросмотрИзображений();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПрокруткаИзображенийВправоНажатие(Элемент)
	
	СдвигИзображения(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПрокруткаИзображенийВлевоНажатие(Элемент)
	
	СдвигИзображения(-1);
	
КонецПроцедуры

#КонецОбласти

#Область ЗамерыПроизводительности

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "СозданиеФормы" + РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "ОткрытиеФормы" + РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	ИмяКлючаОбъекта = СтрЗаменить(ЭтотОбъект.ИмяФормы,".","");
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+"_ВидимостьПанелиОтборов", Элементы.ПереключениеИзображений.Видимость);
	
КонецПроцедуры

#КонецОбласти

#Область Изображение

// Функция возвращает данные файла
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла(ФайлКартинки, УникальныйИдентификатор)
	
	Возврат ПрисоединенныеФайлы.ПолучитьДанныеФайла(ФайлКартинки, УникальныйИдентификатор);
	
КонецФункции // ПолучитьДанныеФайла()

&НаКлиенте
Процедура ПросмотретьИзображение(Команда)
	
	ПросмотретьПрисоединенныйФайл();
	
КонецПроцедуры // ПросмотретьИзображение()

&НаКлиенте
Процедура СвернутьРазвернутьИзображение(Элемент)
	
	НовоеЗначениеВидимостьКартинки = НЕ Элементы.ПереключениеИзображений.Видимость;
	
	Элементы.ПереключениеИзображений.Видимость = НовоеЗначениеВидимостьКартинки;
	Элементы.ДекорацияРазвернутьОтборы.Видимость = НЕ НовоеЗначениеВидимостьКартинки;
	
	ТекущийЭлемент = Элементы.Список;
	
КонецПроцедуры

// Процедура - обработчик события Нажатие поля АдресКартинки.
//
&НаКлиенте
Процедура Подключаемый_АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элементы.АдресКартинки.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	Если ТекущееИзображение>=0 Тогда
		ПросмотретьПрисоединенныйФайл();
	КонецЕсли;
	
КонецПроцедуры // АдресКартинкиНажатие()

&НаКлиенте
Процедура ИзменитьИзображениеЗавершение(ИнформацияОФайле, ДополнительныеПараметры) Экспорт
	
	Если ИнформацияОФайле = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Изображение = Изображения[ТекущееИзображение].Ссылка;
	
	ИзменитьИзображениеЗавершениеНаСервере(ИнформацияОФайле);
	ОповеститьОбИзменении(Изображение);
	Оповестить("Запись_ПрисоединенныйФайл", Новый Структура, Изображение);
	
КонецПроцедуры

// Перезаписывает текущее изображение выбранным файлом с диска.
//
&НаСервере
Процедура ИзменитьИзображениеЗавершениеНаСервере(ИнформацияОФайле)
	
	Изображение = Изображения[ТекущееИзображение].Ссылка;
	ПрисоединенныеФайлы.ОбновитьПрисоединенныйФайл(Изображение, ИнформацияОФайле);
	ОбновитьПросмотрИзображений();
	
КонецПроцедуры

// Вызывается при изменении присоединенного файла.
//
&НаСервере
Процедура ОбновитьПросмотрИзображений()
	
	ТекущееИзображениеВрем = ТекущееИзображение;
	ДобавитьПросмотрИзображений();
	ТекущееИзображение = ТекущееИзображениеВрем;
	СдвигИзображения(0);
	
КонецПроцедуры

// Выводит на форму картинки из присоединенных файлов.
//
&НаСервере
Процедура ДобавитьПросмотрИзображений()
	
	Изображения.Очистить();
	
	// Присоединенный файл записанный в Объект.ФайлКартинки показываем первым.
	Если НЕ ТекущаяХарактеристика.ФайлКартинки.Пустая() Тогда
		
		ДвоичныеДанныеКартинки = УправлениеНебольшойФирмойСервер.СсылкаНаДвоичныеДанныеФайла(ТекущаяХарактеристика.ФайлКартинки, УникальныйИдентификатор);
		
		Если ДвоичныеДанныеКартинки <> Неопределено Тогда
			НоваяСтрока = Изображения.Вставить(0);
			НоваяСтрока.Ссылка = ТекущаяХарактеристика.ФайлКартинки;
			НоваяСтрока.Адрес = ДвоичныеДанныеКартинки;
		КонецЕсли;
		
	КонецЕсли;
	
	ДопустимыеЛоготипы = Новый Массив;
	ДопустимыеЛоготипы.Добавить("png");
	ДопустимыеЛоготипы.Добавить("jpeg");
	ДопустимыеЛоготипы.Добавить("jpg");
	ДопустимыеЛоготипы.Добавить("gif");
	
	// После присоединенного файла из Объект.ФайлКартинки показываем все остальные подходящие.
	Файлы = Новый Массив;
	ПрисоединенныеФайлы.ПолучитьПрикрепленныеФайлыКОбъекту(ТекущаяХарактеристика, Файлы);
	Для каждого Файл Из Файлы Цикл
		
		Если ДопустимыеЛоготипы.Найти(Файл.Расширение) <> Неопределено Тогда
			
			Если Файл = ТекущаяХарактеристика.ФайлКартинки Тогда
				Продолжить;
			КонецЕсли;
			
			ДвоичныеДанныеКартинки = УправлениеНебольшойФирмойСервер.СсылкаНаДвоичныеДанныеФайла(Файл, УникальныйИдентификатор);
			
			Если ДвоичныеДанныеКартинки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Изображения.Добавить();
			НоваяСтрока.Ссылка = Файл;
			НоваяСтрока.Адрес = ДвоичныеДанныеКартинки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого элКартинка Из Элементы.Изображение.ПодчиненныеЭлементы Цикл
		Если элКартинка.Видимость Тогда
			Если Изображения.Количество() = 0 Тогда
				элКартинка.ТекстНевыбраннойКартинки = "Нет изображения";
				элКартинка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
				элКартинка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
				элКартинка.РастягиватьПоВертикали = Истина;
				элКартинка.РастягиватьПоГоризонтали = Истина;
				элКартинка.Гиперссылка = Ложь;
				
				ТекущееИзображение = -1;
			Иначе
				элКартинка.Гиперссылка = Истина;
				элКартинка.РастягиватьПоВертикали = Истина;
				элКартинка.РастягиватьПоГоризонтали = Истина;
				элКартинка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
				элКартинка.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
				
				ТекущееИзображение = Элементы.Изображение.ПодчиненныеЭлементы.Индекс(элКартинка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПрокруткуИзображения();
	ИзображениеВидимостьКоманднойПанели();
	
КонецПроцедуры

// Показывает соседнее с текущим изображение.
// 
// Параметры:
//  Направление - Число - Если = -1 - сдивиг влево; Если = 1 - сдвиг вправо.
//
&НаСервере
Процедура СдвигИзображения(Направление)
	
	НомерЭлемента = ТекущееИзображение + Направление;
	Если НомерЭлемента < 0 ИЛИ НомерЭлемента >= Изображения.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКДанным = "Изображения[%НСтроки%].Адрес";
	ПутьКДанным = СтрЗаменить(ПутьКДанным, "%НСтроки%", НомерЭлемента);
	
	КоличествоИзображений = Элементы.Изображение.ПодчиненныеЭлементы.Количество();
	Если КоличествоИзображений = 1 Тогда
		ПредыдущееИзображение = Элементы.АдресКартинки;
	Иначе
		ПредыдущееИзображение = Элементы.Изображение.ПодчиненныеЭлементы[КоличествоИзображений - 1];
	КонецЕсли;
	
	Если КоличествоИзображений = 1 Тогда
		НовоеИзображениеНомер = 1;
	Иначе
		НовоеИзображениеНомер = Число(СтрЗаменить(ПредыдущееИзображение.Имя, "АдресКартинки", "")) + 1;
	КонецЕсли;
	НовоеИзображение = Элементы.Добавить("АдресКартинки" + НовоеИзображениеНомер, Тип("ПолеФормы"), Элементы.Изображение);
	НовоеИзображение.Вид = ВидПоляФормы.ПолеКартинки;
	НовоеИзображение.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовоеИзображение.Гиперссылка = Истина;
	НовоеИзображение.РазмерКартинки = РазмерКартинки.Пропорционально;
	НовоеИзображение.РастягиватьПоВертикали = Истина;
	НовоеИзображение.РастягиватьПоГоризонтали = Истина;
	НовоеИзображение.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	НовоеИзображение.УстановитьДействие("Нажатие", "Подключаемый_АдресКартинкиНажатие");
	НовоеИзображение.ПутьКДанным = ПутьКДанным;
	ТекущееИзображение = НомерЭлемента;
	
	Элементы.Переместить(ПредыдущееИзображение.КонтекстноеМеню.ПодчиненныеЭлементы["АдресКартинкиКонтекстноеМенюПросмотретьИзображение"],
	                     НовоеИзображение.КонтекстноеМеню);
	
	Если КоличествоИзображений = 1 Тогда
		ПредыдущееИзображение.Видимость = Ложь;
	Иначе
		Элементы.Удалить(ПредыдущееИзображение);
	КонецЕсли;
	УстановитьПрокруткуИзображения();
	
КонецПроцедуры

// Процедура просмотра картинки
//
&НаКлиенте
Процедура ПросмотретьПрисоединенныйФайл()
	
	Если Изображения.Количество()>0 Тогда
	
		ОчиститьСообщения();
		
		Файл = Изображения[ТекущееИзображение].Ссылка;
		ДанныеФайла = ПолучитьДанныеФайла(Файл, УникальныйИдентификатор);
		ПрисоединенныеФайлыКлиент.ОткрытьФайл(ДанныеФайла);
	
	КонецЕсли;
	
КонецПроцедуры // ПросмотретьПрисоединенныйФайл()

// Устанавливает видимость и доступность кнопок перелистывания изображения.
//
&НаСервере
Процедура УстановитьПрокруткуИзображения()
	
	Если Изображения.Количество() <= 1 Тогда
		Элементы.ДекорацияПрокруткаИзображенийВлево.Видимость = Ложь;
		Элементы.ДекорацияПрокруткаИзображенийВправо.Видимость = Ложь;
		Возврат;
	Иначе
		Элементы.ДекорацияПрокруткаИзображенийВлево.Видимость = Истина;
		Элементы.ДекорацияПрокруткаИзображенийВправо.Видимость = Истина;
	КонецЕсли;
	
	Если ТекущееИзображение = 0 Тогда
		Элементы.ДекорацияПрокруткаИзображенийВлево.Доступность = Ложь;
		Элементы.ДекорацияПрокруткаИзображенийВправо.Доступность = Истина;
	ИначеЕсли ТекущееИзображение = -1 Тогда
		Элементы.ДекорацияПрокруткаИзображенийВлево.Доступность = Ложь;
		Элементы.ДекорацияПрокруткаИзображенийВправо.Доступность = Ложь;
	ИначеЕсли ТекущееИзображение = Изображения.Количество() - 1 Тогда
		Элементы.ДекорацияПрокруткаИзображенийВлево.Доступность = Истина;
		Элементы.ДекорацияПрокруткаИзображенийВправо.Доступность = Ложь;
	Иначе
		Элементы.ДекорацияПрокруткаИзображенийВлево.Доступность = Истина;
		Элементы.ДекорацияПрокруткаИзображенийВправо.Доступность = Истина
	КонецЕсли;
	
	ТекущийЭлемент = Элементы.Список;
	
КонецПроцедуры

// Устанавливает видимость кнопок контекстного меню изображения.
//
&НаСервере
Процедура ИзображениеВидимостьКоманднойПанели()
	
	ЕстьИзображения = Изображения.Количество();
	Элементы.АдресКартинкиКонтекстноеМенюПросмотретьИзображение.Видимость = ЕстьИзображения;
	
КонецПроцедуры

#КонецОбласти

//+++ Lazare_27.05.2021
&НаКлиенте
Процедура АктивироватьСнятьАктивацию(Команда)
	
	СтрСписка     = элементы.Список.ТекущиеДанные;
	Исползование  = СтрСписка.ИспользуетсяВдокументах ;
	Если СтрСписка= Неопределено  Тогда 
		Возврат;
	КонецЕсли;
	ИзменитЗначебиеРеквизита(СтрСписка.Ссылка,Исползование ); 	 
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитЗначебиеРеквизита(Ссылка,Исползование)
	
	Объект =  Ссылка.ПолучитьОбъект(); 
	Объект.ИспользуетсяВдокументах = Не Исползование ;
	Объект.Записать();
	
КонецПроцедуры 
//--- Lazare_27.05.2021
