
&Вместо("ОбработкаЗаполнения")
Процедура РасшAzRy_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		ОбработкаПроверкиЗаполненияЛок(ДанныеЗаполнения, СтандартнаяОбработка);
		ЗаполнитьШапкуДокумента(ДанныеЗаполнения);
		//Паганини#OneSoft_
		Если ДанныеЗаполнения.Количество() > 0 И ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			Корректировочная					= Истина;
			ПричинаКорректировки				= Перечисления.ПричиныКорректировкиСФ.ИзмененаСуммаОперации;
			ОснованиеКорректировки				= НайтиФактуруПоНакладной(ДанныеЗаполнения[0].ДокументОснование);
			ЗаполнитьИзКорректировкиРеализации(ДанныеЗаполнения);
		ИначеЕсли ДанныеЗаполнения.Количество() > 0 И ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			Корректировочная					= Истина;
			ПричинаКорректировки				= Перечисления.ПричиныКорректировкиСФ.ВозвратТовара;
			ОснованиеКорректировки				= НайтиФактуруПоНакладной(ДанныеЗаполнения[0].ДокументОснование);
			ЗаполнитьИзПриходнаяНакладная(ДанныеЗаполнения);
		Иначе
		//_Паганини#OneSoft
		ЗаполнитьЗапасы(ДанныеЗаполнения);
		//Паганини#OneSoft_
	    КонецЕсли;
		//_Паганини#OneSoft
	//Paganini_ONESOFT-2337_
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеВКассу") ИЛИ
			  ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
		Если НЕ ДанныеЗаполнения.Проведен Тогда
			ТекстОшибки = НСтр("ru = 'Ввод на основании непроведенного документа запрещен.'; ka = 'გაუტარებელი დოკუმენტის საფუძველზე შეყვანა აკრძალულია.'; en = 'გაუტარებელი დოკუმენტის საფუძველზე შეყვანა აკრძალულია.'");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
		КоличетствоСтрокАванса = ДанныеЗаполнения.РасшифровкаПлатежа.НайтиСтроки(Новый Структура("ПризнакАванса", Истина)).Количество();
		Если КоличетствоСтрокАванса = 0  Тогда
			ТекстОшибки = НСтр("ru = 'На текущий документ (%НомерДокумента%), не фиксируется аванс. Фактуру невозможно сформировать!'; ka = 'მიმდინარე დოკუმენტით (%НомерДокумента%), არ გიფიქსირდებათ ავანსები. ფაქტურას ვერ შექმნით!'; en = 'მიმდინარე დოკუმენტით (%НомерДокумента%), არ გიფიქსირდებათ ავანსები. ფაქტურას ვერ შექმნით!'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерДокумента%", ДанныеЗаполнения.Номер);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
		Аванс 					= Истина;
		Контрагент 				= ДанныеЗаполнения.Контрагент;
		ДатаВходящегоДокумента 	= НачалоМесяца(ДанныеЗаполнения.Дата);
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасчетыСПокупателямиОбороты.Регистратор КАК Документ,
			|	РасчетыСПокупателямиОбороты.Договор КАК Договор,
			|	СУММА(-РасчетыСПокупателямиОбороты.СуммаОборот) КАК Сумма,
			|	СУММА(-(ВЫРАЗИТЬ(РасчетыСПокупателямиОбороты.СуммаОборот * 18 / 118 КАК ЧИСЛО(15, 2)))) КАК СуммаНДС
			|ИЗ
			|	РегистрНакопления.РасчетыСПокупателями.Обороты(, , Регистратор, ) КАК РасчетыСПокупателямиОбороты
			|ГДЕ
			|	РасчетыСПокупателямиОбороты.Регистратор = &ДанныеЗаполнения
			|	И РасчетыСПокупателямиОбороты.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетыСПокупателямиОбороты.Регистратор,
			|	РасчетыСПокупателямиОбороты.Договор";
		Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
		
		ДокументыПлатежа.Загрузить(Запрос.Выполнить().Выгрузить());
	//_Paganini_ONESOFT-2337
	
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЧекККМ") Тогда
		//ОбработкаПроверкиЗаполненияЛок(ДанныеЗаполнения, СтандартнаяОбработка);
		AzRyРаботаСДокументамыКлиентСервер_Deprecated.ЗаполнитьШапкуДокумента(ЭтотОбъект, ДанныеЗаполнения, ДокументыОснования);
		AzRyРаботаСДокументамыКлиентСервер_Deprecated.ЗаполнитьЗапасы(ЭтотОбъект, ДанныеЗаполнения);		
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	
	Иначе
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры
