
&Вместо("ОбработкаЗаполнения")
Процедура РасшAzRy_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		ОбработкаПроверкиЗаполненияЛок(ДанныеЗаполнения, СтандартнаяОбработка);
		ЗаполнитьШапкуДокумента(ДанныеЗаполнения);
		//Паганини#OneSoft_
		Если ДанныеЗаполнения.Количество() > 0 И ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			Корректировочная					= Истина;
			ПричинаКорректировки				= Перечисления.ПричиныКорректировкиСФ.ИзмененаСуммаОперации;
			ОснованиеКорректировки				= НайтиФактуруПоНакладной(ДанныеЗаполнения[0].ДокументОснование);
			ЗаполнитьИзКорректировкиРеализации(ДанныеЗаполнения);
		ИначеЕсли ДанныеЗаполнения.Количество() > 0 И ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			Корректировочная					= Истина;
			ПричинаКорректировки				= Перечисления.ПричиныКорректировкиСФ.ВозвратТовара;
			ОснованиеКорректировки				= НайтиФактуруПоНакладной(ДанныеЗаполнения[0].ДокументОснование);
			ЗаполнитьИзПриходнаяНакладная(ДанныеЗаполнения);
		Иначе
		//_Паганини#OneSoft
		ЗаполнитьЗапасы(ДанныеЗаполнения);
		//Паганини#OneSoft_
	    КонецЕсли;
		//_Паганини#OneSoft
	
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЧекККМ") Тогда
		//ОбработкаПроверкиЗаполненияЛок(ДанныеЗаполнения, СтандартнаяОбработка);
		AzRyРаботаСДокументамыКлиентСервер.ЗаполнитьШапкуДокумента(ЭтотОбъект, ДанныеЗаполнения, ДокументыОснования);
		AzRyРаботаСДокументамыКлиентСервер.ЗаполнитьЗапасы(ЭтотОбъект, ДанныеЗаполнения);		
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	
	Иначе
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры
