
#Область ПеременныеФормы

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;	// Параметры опроса завершения фонового задания. См. общий модуль ДлительныеОперацииКлиент

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БыстрыеДействияОткрыты = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "БыстрыеДействияОткрыты");
	Если БыстрыеДействияОткрыты=Неопределено Тогда
		// После обновления быстрые действия открываем отдельной формой
		ОбновитьИнтерфейс = Ложь;
		ДобавитьБыстрыеДействияНаРабочийСтол(ОбновитьИнтерфейс);
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПульсБизнеса", "БыстрыеДействияОткрыты", Истина);
		Если ОбновитьИнтерфейс Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	Инициализация();
	ЗагрузитьНастройкиПериоды();
	ЗагрузитьНастройки();
	СоздатьЭлементыПоказатели();
	СоздатьЭлементыДиаграммы();
	ОбновитьПредставленияПериодов(ЭтаФорма);
	
	// Признак размещения формы. Если Ложь (значение по умолчанию) то форма открыта средствами платформы на начальной странице.
	Параметры.Свойство("ОткрытаНеНаНачальнойСтранице", ОткрытаНеНаНачальнойСтранице);
	
	Если ОткрытаНеНаНачальнойСтранице Тогда
		Заголовок = НСтр("ka='ბიზნესის პულსი';ru='Пульс бизнеса';en='business pulse'");
	КонецЕсли; 
	
	АдресНастроекПоказателей = ПоместитьВоВременноеХранилище(НастройкиПоказателей.Выгрузить(), УникальныйИдентификатор);
	АдресНастроекДиаграмм = ПоместитьВоВременноеХранилище(НастройкиДиаграмм.Выгрузить(), УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОбновитьИнтерфейс Тогда
		ПодключитьОбработчикОжидания("ОбновлениеИнтефейсаСЗадержкой", 0.1, Истина);
		Возврат;
	КонецЕсли; 
	
	// При старте системы устанавливаем задержку
	Если ОткрытаНеНаНачальнойСтранице Тогда
		ИнтервалЗапускаФоновогоЗадания = 0.1;
	Иначе
		ИнтервалЗапускаФоновогоЗадания = 3;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьФоновоеЗаданиеПриОткрытии", ИнтервалЗапускаФоновогоЗадания, Истина);
	
	ТекущийЭлемент = Элементы.ДекорацияОбновить;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеИнтефейсаСЗадержкой()
	
	ОбновитьИнтерфейс();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если НЕ ТипЗнч(ВыбранноеЗначение)=Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение.Событие="НастройкаПоказателя" Тогда
		
		Если ВыбранноеЗначение.Свойство("ИдентификаторСтроки") Тогда
			Стр = ДобавленныеПоказатели.НайтиПоИдентификатору(ВыбранноеЗначение.ИдентификаторСтроки);
		Иначе
			Стр = ДобавленныеПоказатели.Добавить(); 
		КонецЕсли; 
		ЗаполнитьЗначенияСвойств(Стр, ВыбранноеЗначение);
		
		// Связь по идентификатору с таблицей вариантов показателей
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Показатель", ВыбранноеЗначение.Показатель);
		СтруктураОтбора.Вставить("Ресурс", ВыбранноеЗначение.Ресурс);
		Строки = НастройкиПоказателей.НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество()>0 Тогда
			Стр.ИдентификаторСтрокиНастроек = Строки[0].ПолучитьИдентификатор();
			Стр.Остаток = Строки[0].Остаток;
		КонецЕсли;
	
		Элементы.СтраницаОжидание.Видимость = Истина;
		Элементы.СтраницаДанные.Видимость = Ложь;
		СохранитьНастройкуПоказателяСервер();
		НачатьОжиданиеЗавершенияФоновогоЗаданияНаКлиенте();
		
	ИначеЕсли ВыбранноеЗначение.Событие="НастройкаДиаграммы" Тогда
		
		// Связь по идентификатору с таблицей вариантов показателей
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Диаграмма", ВыбранноеЗначение.Диаграмма);
		Строки = НастройкиДиаграмм.НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		СтрНастроек = Строки[0];
		ОписаниеСерий = СтрНастроек.Серии[ВыбранноеЗначение.Серия];
		ОписаниеТочек = СтрНастроек.Точки[ВыбранноеЗначение.Точка];
		
		Если ВыбранноеЗначение.Свойство("ИдентификаторСтроки") Тогда
			Стр = ДобавленныеДиаграммы.НайтиПоИдентификатору(ВыбранноеЗначение.ИдентификаторСтроки);
		Иначе
			Стр = ДобавленныеДиаграммы.Добавить(); 
		КонецЕсли; 
		ЗаполнитьЗначенияСвойств(Стр, ВыбранноеЗначение);
		
		Стр.ИдентификаторСтрокиНастроек = СтрНастроек.ПолучитьИдентификатор();
		Стр.ПредставленияТочек = ОписаниеТочек.Представления;
		
		Если ЗначениеЗаполнено(ВыбранноеЗначение.ПериодСравнения) И НЕ ВыбранноеЗначение.РежимОстатка Тогда
			МассивПредставлений = Новый Массив;
			МассивПредставлений.Добавить(ПредставлениеСтандартногоПериода(ВыбранноеЗначение.Период));
			МассивПредставлений.Добавить(ПредставлениеСтандартногоПериода(ВыбранноеЗначение.ПериодСравнения, ВыбранноеЗначение.Период));
			Стр.ПредставленияСерий = Новый ФиксированныйМассив(МассивПредставлений);
		ИначеЕсли ЗначениеЗаполнено(ВыбранноеЗначение.ПериодСравнения) И ВыбранноеЗначение.РежимОстатка Тогда
			МассивПредставлений = Новый Массив;
			МассивПредставлений.Добавить(ПредставлениеСтандартнойДатыНачала(ВыбранноеЗначение.Период));
			МассивПредставлений.Добавить(ПредставлениеСтандартнойДатыНачала(ВыбранноеЗначение.ПериодСравнения, ВыбранноеЗначение.Период));
			Стр.ПредставленияСерий = Новый ФиксированныйМассив(МассивПредставлений);
		Иначе
			Стр.ПредставленияСерий = ОписаниеСерий.Представления;
		КонецЕсли; 
		
		Элементы.СтраницаОжидание.Видимость = Истина;
		Элементы.СтраницаДанные.Видимость = Ложь;
		СохранитьНастройкуДиаграммыСервер();
		НачатьОжиданиеЗавершенияФоновогоЗаданияНаКлиенте();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="ВводОстатков" Тогда
		ОбновитьФорму();
		НачатьОжиданиеЗавершенияФоновогоЗаданияНаКлиенте();
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура Подключаемый_ПоказательЗначениеНажатие(Элемент)
	
	КонтекстРасшифроватьПоказатель(Элемент);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОбновитьНажатие(Элемент)
	
	ОбновитьФорму();
	НачатьОжиданиеЗавершенияФоновогоЗаданияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДиаграммаВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	
	ИмяГруппы = Лев(Элемент.Имя, Найти(Элемент.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеДиаграммы.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	РасшифроватьДиаграмму(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьПоказательКоманда(Команда)
	
	ОткрытьФормуДобавленияПоказателя();
	
КонецПроцедуры

#Область Периоды

&НаКлиенте
Процедура ДатаВыбор(Команда)
	
	Меню = Новый СписокЗначений;
	Если ДатаСравнения<>Неопределено Тогда
		Меню.Добавить("ВСравнении", НСтр("ka='შედარების გამორთვა';ru='Отключить сравнение';en='disable comparison'"));
	Иначе
		Меню.Добавить("ВСравнении", НСтр("ka='შედარებაში';ru='В сравнении';en='Compared'"));
	КонецЕсли; 
	
	Оповещение = Новый ОписаниеОповещения("ДатаВыборЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, Меню, Элементы.ДекорацияОтступДатаЦентр);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыборЗавершение(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение=Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	Если ВыбранноеЗначение.Значение="ВСравнении" Тогда
		Если ДатаСравнения=Неопределено Тогда
			ДатаСравнения = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтойНедели);
		Иначе
			ДатаСравнения = Неопределено;
		КонецЕсли; 
		ОбновитьПредставленияПериодов(ЭтаФорма);
		ОбновитьЧастично("Остатки", "ДатаСравнения");
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ДатаСравненияВыбор(Команда)
	
	МассивДат = Новый Массив;
	МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоПрошлогоДня));
	МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтойНедели));
	МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоМесяца));
	МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоКвартала));
	МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоПолугодия));
	МассивДат.Добавить(Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоГода));
	
	Меню = Новый СписокЗначений;
	Для каждого ЭлементДата Из МассивДат Цикл
		Меню.Добавить(ЭлементДата, ПредставлениеСтандартнойДатыНачала(ЭлементДата, Дата));
	КонецЦикла;
	
	Меню.Добавить(Новый СтандартнаяДатаНачала, НСтр("ka='თავისუფალი თარიღი';ru='Произвольная дата';en='arbitrary date'"));
	
	Оповещение = Новый ОписаниеОповещения("ДатаСравненияВыборЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, Меню, Элементы.ДекорацияОтступДатаСравненияЦентр);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСравненияВыборЗавершение(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение=Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	Если ВыбранноеЗначение.Значение=Новый СтандартнаяДатаНачала Тогда
		Оповещение = Новый ОписаниеОповещения("ДатаСравненияВыборПроизвольнаяДата", ЭтотОбъект);
		ПоказатьВводДаты(Оповещение, ДатаСравнения, НСтр("ka='მიუთითეთ თარიღი';ru='Укажите дату';en='select dates'"), ЧастиДаты.Дата);
	Иначе
		ДатаСравнения = ВыбранноеЗначение.Значение;
		ТипДатыСравнения = ТипДаты(ДатаСравнения);
		ОбновитьПредставленияПериодов(ЭтаФорма);
		ОбновитьЧастично("Остатки", "ДатаСравнения");
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ДатаСравненияВыборПроизвольнаяДата(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение=Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	ДатаСравнения = Новый СтандартнаяДатаНачала(ВыбранноеЗначение);
	ТипДатыСравнения = ТипДаты(ДатаСравнения);
	ОбновитьПредставленияПериодов(ЭтаФорма);
	ОбновитьЧастично("Остатки", "ДатаСравнения");
	
КонецПроцедуры
 
&НаКлиенте
Процедура ДатаСравненияНазад(Команда)
	
	ДатаСравнения = ПредыдущаяДата(ДатаСравнения, ТипДатыСравнения);
	ОбновитьПредставленияПериодов(ЭтаФорма);
	ОбновитьЧастично("Остатки");
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСравненияВперед(Команда)
	
	ДатаСравнения = СледующаяДата(ДатаСравнения, ТипДатыСравнения);
	ОбновитьПредставленияПериодов(ЭтаФорма);
	ОбновитьЧастично("Остатки");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВыбор(Команда)
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтаНеделя));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотКвартал));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтоПолугодие));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотГод));
	
	ПрошлыйГод = Новый Структура;
	ПрошлыйГод.Вставить("Вариант", "Последние7ДнейНеСчитаяТекущего");
	ПредыдущийПериод = УправлениеНебольшойФирмойКлиентСервер.Последние7ДнейНеСчитаяТекущего();
	ПрошлыйГод.Вставить("ДатаНачала", ПредыдущийПериод.ДатаНачала);
	ПрошлыйГод.Вставить("ДатаОкончания", ПредыдущийПериод.ДатаОкончания);
	МассивПериодов.Добавить(ПрошлыйГод);
	
	Меню = Новый СписокЗначений;
	Для каждого ЭлементПериод Из МассивПериодов Цикл
		Меню.Добавить(ЭлементПериод, ПредставлениеСтандартногоПериода(ЭлементПериод));
	КонецЦикла;
	
	Меню.Добавить(Новый СтандартныйПериод, НСтр("ka='თავისუფალი პერიოდი';ru='Произвольный период';en='any period'"));
	
	Если ПериодСравнения<>Неопределено Тогда
		Меню.Добавить("ВСравнении", НСтр("ka='შედარების გამორთვა';ru='Отключить сравнение';en='disable comparison'"));
	Иначе
		Меню.Добавить("ВСравнении", НСтр("ka='შედარებაში';ru='В сравнении';en='Compared'"));
	КонецЕсли; 
	
	Оповещение = Новый ОписаниеОповещения("ПериодВыборЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, Меню, Элементы.ДекорацияОтступПериодЦентр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВыборЗавершение(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение=Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	Если ВыбранноеЗначение.Значение="ВСравнении" Тогда
		Если ПериодСравнения=Неопределено Тогда
			ПериодСравнения = ПериодСравненияПоПериоду(Период);
			ТипПериодаСравнения = ТипПериода(ПериодСравнения);
		Иначе
			ПериодСравнения = Неопределено;
			ТипПериодаСравнения = "";
		КонецЕсли; 
		ОбновитьПредставленияПериодов(ЭтаФорма);
		ОбновитьЧастично("Обороты", "ПериодСравнения");
	ИначеЕсли ВыбранноеЗначение.Значение=Новый СтандартныйПериод Тогда
		Оповещение = Новый ОписаниеОповещения("ПериодВыборПроизвольныйПериод", ЭтотОбъект);
		Диалог = Новый ДиалогРедактированияСтандартногоПериода;
		Диалог.Период = ?(ТипЗнч(Период)=Тип("СтандартныйПериод"), Период, Новый СтандартныйПериод);
		Диалог.Показать(Оповещение);
	Иначе
		Период = ВыбранноеЗначение.Значение;
		ТипПериода = ТипПериода(Период);
		Если ПериодСравнения<>Неопределено Тогда
			ПериодСравнения = ПериодСравненияПоПериоду(Период);
			ТипПериодаСравнения = ТипПериода(ПериодСравнения);
		КонецЕсли; 
		ОбновитьПредставленияПериодов(ЭтаФорма);
		ОбновитьЧастично("Обороты", "Период"+?(ПериодСравнения<>Неопределено, ",ПериодСравнения", ""));
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПериодВыборПроизвольныйПериод(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение=Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	Период = ВыбранноеЗначение;
	ТипПериода = ТипПериода(Период);
	Если ПериодСравнения<>Неопределено Тогда
		ПериодСравнения = ПериодСравненияПоПериоду(Период);
		ТипПериодаСравнения = ТипПериода(ПериодСравнения);
	КонецЕсли; 
	ОбновитьПредставленияПериодов(ЭтаФорма);
	ОбновитьЧастично("Обороты", "Период"+?(ПериодСравнения<>Неопределено, ",ПериодСравнения", ""));
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПериодНазад(Команда)
	
	Период = ПредыдущийПериод(Период, ТипПериода);
	Если ПериодСравнения<>Неопределено Тогда
		ПериодСравнения = ПериодСравненияПоПериоду(Период);
		ТипПериодаСравнения = ТипПериода(ПериодСравнения);
	КонецЕсли; 
	ОбновитьПредставленияПериодов(ЭтаФорма);
	ОбновитьЧастично("Обороты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВперед(Команда)
	
	Период = СледующийПериод(Период, ТипПериода);
	Если ПериодСравнения<>Неопределено Тогда
		ПериодСравнения = ПериодСравненияПоПериоду(Период);
		ТипПериодаСравнения = ТипПериода(ПериодСравнения);
	КонецЕсли; 
	ОбновитьПредставленияПериодов(ЭтаФорма);
	ОбновитьЧастично("Обороты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСравненияВыбор(Команда)
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлаяНеделя));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйМесяц));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйКвартал));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлоеПолугодие));
	МассивПериодов.Добавить(Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйГод));
	СкользящийПериод = Новый Структура;
	СкользящийПериод.Вставить("Вариант", "ПредыдущийПлавающийПериод");
	ПредыдущийПериод = УправлениеНебольшойФирмойКлиентСервер.ПредыдущийПлавающийПериод(Период);
	СкользящийПериод.Вставить("ДатаНачала", ПредыдущийПериод.ДатаНачала);
	СкользящийПериод.Вставить("ДатаОкончания", ПредыдущийПериод.ДатаОкончания);
	МассивПериодов.Добавить(СкользящийПериод);
	ПрошлыйГод = Новый Структура;
	ПрошлыйГод.Вставить("Вариант", "ЗаПрошлыйГод");
	ПредыдущийПериод = УправлениеНебольшойФирмойКлиентСервер.АналогичныйПериодПрошлогоГода(Период);
	ПрошлыйГод.Вставить("ДатаНачала", ПредыдущийПериод.ДатаНачала);
	ПрошлыйГод.Вставить("ДатаОкончания", ПредыдущийПериод.ДатаОкончания);
	МассивПериодов.Добавить(ПрошлыйГод);
	
	Меню = Новый СписокЗначений;
	Для каждого ЭлементПериод Из МассивПериодов Цикл
		Меню.Добавить(ЭлементПериод, ПредставлениеСтандартногоПериода(ЭлементПериод, Период));
	КонецЦикла;
	
	
	Меню.Добавить(Новый СтандартныйПериод, НСтр("ka='თავისუფალი პერიოდი';ru='Произвольный период';en='any period'"));
	
	Оповещение = Новый ОписаниеОповещения("ПериодСравненияВыборЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, Меню, Элементы.ДекорацияОтступПериодСравненияЦентр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСравненияВыборЗавершение(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение=Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	Если ВыбранноеЗначение.Значение=Новый СтандартныйПериод Тогда
		Оповещение = Новый ОписаниеОповещения("ПериодСравненияВыборПроизвольныйПериод", ЭтотОбъект);
		Диалог = Новый ДиалогРедактированияСтандартногоПериода;
		Диалог.Период = ?(ТипЗнч(ПериодСравнения)=Тип("СтандартныйПериод"), ПериодСравнения, Новый СтандартныйПериод);
		Диалог.Показать(Оповещение);
	Иначе
		ПериодСравнения = ВыбранноеЗначение.Значение;
		ТипПериодаСравнения = ТипПериода(ПериодСравнения);
		ОбновитьПредставленияПериодов(ЭтаФорма);
		ОбновитьЧастично("Обороты", "ПериодСравнения");
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПериодСравненияВыборПроизвольныйПериод(ВыбранноеЗначение, ДополнительныеДанные) Экспорт
	
	Если ВыбранноеЗначение=Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	ПериодСравнения = ВыбранноеЗначение;
	ТипПериодаСравнения = ТипПериода(ПериодСравнения);
	ОбновитьПредставленияПериодов(ЭтаФорма);
	ОбновитьЧастично("Обороты", "ПериодСравнения");
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПериодСравненияНазад(Команда)
	
	ПериодСравнения = ПредыдущийПериод(ПериодСравнения, ТипПериодаСравнения);
	ОбновитьПредставленияПериодов(ЭтаФорма);
	ОбновитьЧастично("Обороты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСравненияВперед(Команда)
	
	ПериодСравнения = СледующийПериод(ПериодСравнения, ТипПериодаСравнения);
	ОбновитьПредставленияПериодов(ЭтаФорма);
	ОбновитьЧастично("Обороты");
	
КонецПроцедуры

#КонецОбласти 

#Область Показатели

&НаКлиенте
Процедура КонтекстНастроитьПоказатель(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, Найти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеПоказатели.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли; 
	ОткрытьФормуНастройкиПоказателя(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстУдалитьПоказатель(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, Найти(Команда.Имя, "_")-1);
	Оповещение = Новый ОписаниеОповещения("КонтекстУдалитьПоказательЗавершение", ЭтотОбъект, ИмяГруппы);
	ПоказатьВопрос(Оповещение, НСтр("ka='წავშალოთ მაჩვენებლები?';ru='Удалить показатель?';en='Remove indicator?'"), РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстУдалитьПоказательЗавершение(Результат, ИмяГруппы) Экспорт
	
	Если Результат<>КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 	
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеПоказатели.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	Индекс = ДобавленныеПоказатели.Индекс(Строки[0]);
	Индекс = ?(Индекс=0, 0, Индекс-1);
	КонтекстУдалитьПоказательСервер(Строки[0].ПолучитьИдентификатор());
	Если ДобавленныеПоказатели.Количество()>0 И НЕ ПустаяСтрока(ДобавленныеПоказатели[Индекс].ИмяГруппы) Тогда
		ТекущийЭлемент = Элементы[ДобавленныеПоказатели[Индекс].ИмяГруппы+"_Заголовок"];
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура КонтекстУдалитьПоказательСервер(Идентификатор)
	
	Стр = ДобавленныеПоказатели.НайтиПоИдентификатору(Идентификатор);
	УдалитьЭлементыРекурсивно(Элементы[Стр.ИмяГруппы]);
	Элементы.Удалить(Элементы[Стр.ИмяГруппы]);
	ДобавленныеПоказатели.Удалить(Стр);
	СохранитьНастройки("Показатели");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстСместитьВверхПоказатель(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, Найти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеПоказатели.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	КонтекстСместитьВверхПоказательСервер(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура КонтекстСместитьВверхПоказательСервер(Идентификатор)
	
	Стр = ДобавленныеПоказатели.НайтиПоИдентификатору(Идентификатор);
	Индекс = ДобавленныеПоказатели.Индекс(Стр);
	Группа = Элементы[Стр.ИмяГруппы];
	ПредыдущаяГруппа = ПредыдущийЭлемент(Группа);
	Если ПредыдущаяГруппа=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Элементы.Переместить(Группа, Группа.Родитель, ПредыдущаяГруппа);
	ДобавленныеПоказатели.Сдвинуть(Индекс, -1);
	СохранитьНастройки("Показатели");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстСместитьВнизПоказатель(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, Найти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеПоказатели.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	КонтекстСместитьВнизПоказательСервер(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура КонтекстСместитьВнизПоказательСервер(Идентификатор)
	
	Стр = ДобавленныеПоказатели.НайтиПоИдентификатору(Идентификатор);
	Индекс = ДобавленныеПоказатели.Индекс(Стр);
	Если Индекс=ДобавленныеПоказатели.Количество()-1 Тогда
		Возврат;
	КонецЕсли;
	Группа = Элементы[Стр.ИмяГруппы];
	СледующаяГруппа = СледующийЭлемент(Группа);
	Если СледующаяГруппа=Неопределено Тогда
		Элементы.Переместить(Группа, Группа.Родитель);
	Иначе
		Элементы.Переместить(Группа, Группа.Родитель, СледующаяГруппа);
	КонецЕсли; 
	ДобавленныеПоказатели.Сдвинуть(Индекс, 1);
	СохранитьНастройки("Показатели");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстРасшифроватьПоказатель(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, Найти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеПоказатели.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	РасшифроватьПоказатель(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти 

#Область Диаграммы

&НаКлиенте
Процедура ДобавитьДиаграммуКоманда(Команда)
	
	ОткрытьФормуДобавленияДиаграммы();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстНастроитьДиаграмму(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, Найти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеДиаграммы.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли; 
	ОткрытьФормуНастройкиДиаграммы(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстУдалитьДиаграмму(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, Найти(Команда.Имя, "_")-1);
	Оповещение = Новый ОписаниеОповещения("КонтекстУдалитьДиаграммуЗавершение", ЭтотОбъект, ИмяГруппы);
	ПоказатьВопрос(Оповещение, НСтр("ka='წავშალოთ დიაგრამა?';ru='Удалить диаграмму?';en='To delete a chart?'"), РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстУдалитьДиаграммуЗавершение(Результат, ИмяГруппы) Экспорт
	
	Если Результат<>КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 	
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеДиаграммы.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	КонтекстУдалитьДиаграммуСервер(Строки[0].ПолучитьИдентификатор());
	ТекущийЭлемент = Элементы.ДекорацияОбновить;
	
КонецПроцедуры
 
&НаСервере
Процедура КонтекстУдалитьДиаграммуСервер(Идентификатор)
	
	Стр = ДобавленныеДиаграммы.НайтиПоИдентификатору(Идентификатор);
	УдалитьЭлементыРекурсивно(Элементы[Стр.ИмяГруппы]);
	Элементы.Удалить(Элементы[Стр.ИмяГруппы]);
	ДобавленныеДиаграммы.Удалить(Стр);
	СохранитьНастройки("Диаграммы");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстСместитьВверхДиаграмму(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, Найти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеДиаграммы.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	КонтекстСместитьВверхДиаграммуСервер(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура КонтекстСместитьВверхДиаграммуСервер(Идентификатор)
	
	Стр = ДобавленныеДиаграммы.НайтиПоИдентификатору(Идентификатор);
	Индекс = ДобавленныеДиаграммы.Индекс(Стр);
	Если Индекс=0 Тогда
		Возврат;
	КонецЕсли;
	СтрПеред = ДобавленныеДиаграммы[Индекс-1];
	Элементы.Переместить(Элементы[Стр.ИмяГруппы], Элементы.ГруппаДобавленныеДиаграммы, Элементы[СтрПеред.ИмяГруппы]);
	ДобавленныеДиаграммы.Сдвинуть(Индекс, -1);
	СохранитьНастройки("Диаграммы");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстСместитьВнизДиаграмму(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, Найти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеДиаграммы.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	КонтекстСместитьВнизДиаграммуСервер(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура КонтекстСместитьВнизДиаграммуСервер(Идентификатор)
	
	Стр = ДобавленныеДиаграммы.НайтиПоИдентификатору(Идентификатор);
	Индекс = ДобавленныеДиаграммы.Индекс(Стр);
	Если Индекс=ДобавленныеДиаграммы.Количество()-1 Тогда
		Возврат;
	КонецЕсли;
	Если Индекс=ДобавленныеДиаграммы.Количество()-2 Тогда
		Элементы.Переместить(Элементы[Стр.ИмяГруппы], Элементы.ГруппаДобавленныеДиаграммы);
	Иначе
		СтрПосле = ДобавленныеДиаграммы[Индекс+2];
		Элементы.Переместить(Элементы[Стр.ИмяГруппы], Элементы.ГруппаДобавленныеДиаграммы, Элементы[СтрПосле.ИмяГруппы]);
	КонецЕсли; 
	ДобавленныеДиаграммы.Сдвинуть(Индекс, 1);
	СохранитьНастройки("Диаграммы");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстРасшифроватьДиаграмму(Команда)
	
	ИмяГруппы = Лев(Команда.Имя, Найти(Команда.Имя, "_")-1);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяГруппы", ИмяГруппы);
	Строки = ДобавленныеДиаграммы.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	РасшифроватьДиаграмму(Строки[0].ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#Область ФоновоеЗаданиеПолучениеДанных

&НаКлиенте
Процедура Подключаемый_ЗапуститьФоновоеЗаданиеПриОткрытии()
	
	ЗапуститьФоновоеЗаданиеНаСервере();
	НачатьОжиданиеЗавершенияФоновогоЗаданияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьЗавершениеДлительнойОперации()
	
	Если ФоновоеЗаданиеЗапущено Тогда
		
		Если ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор) Тогда
			// Данные расчитаны, обновим данные формы
			ФоновоеЗаданиеЗапущено = Ложь;
			ФоновоеЗаданиеВыполнено = Истина;
			ОбновитьДанные();
			Если Элементы.СтраницаОжидание.Видимость Тогда
				Элементы.СтраницаОжидание.Видимость = Ложь;
				Элементы.СтраницаДанные.Видимость = Истина;
			КонецЕсли;
			Если НЕ Элементы.ГруппаПоказателиОстатки.Доступность Тогда
				Элементы.ГруппаПоказателиОстатки.Доступность = Истина;
			КонецЕсли;
			Если НЕ Элементы.ГруппаПоказателиОбороты.Доступность Тогда
				Элементы.ГруппаПоказателиОбороты.Доступность = Истина;
			КонецЕсли; 
		Иначе
			// Продолжим ожидание
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьЗавершениеДлительнойОперации",
				ПараметрыОбработчикаОжидания.ТекущийИнтервал,
				Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьФоновоеЗаданиеНаСервере(Секция="", СохраняемыеПериоды = "")
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СохраняемыеПериоды) Тогда
		СохранитьНастройкиПериоды(СохраняемыеПериоды);
	КонецЕсли; 
	
	Если ФоновоеЗаданиеЗапущено И НЕ ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор) Тогда
		ФоновоеЗаданиеОтменить(ФоновоеЗаданиеИдентификатор);
	КонецЕсли;
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	// Параметры обернем в структуру для их передачи через механизм ДлительныеОперации.
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Дата", Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоСледующегоДня));
	ПараметрыПроцедуры.Вставить("ДатаСравнения", ДатаСравнения);
	ПараметрыПроцедуры.Вставить("Период", Период);
	ПараметрыПроцедуры.Вставить("ПериодСравнения", ПериодСравнения);
	ПараметрыПроцедуры.Вставить("Показатели", ДобавленныеПоказатели.Выгрузить());
	ПараметрыПроцедуры.Вставить("Диаграммы", ДобавленныеДиаграммы.Выгрузить());
	Если НЕ ПустаяСтрока(Секция) Тогда
		ПараметрыПроцедуры.Вставить("Секция", Секция);
	КонецЕсли; 
	
	НаименованиеЗадания = НСтр("ka='ბიზნესის პულსის ვიჯეტების განახლება';ru='Обновление виджетов пульса бизнеса';en='Update Business Pulse widget'");
	
	Результат = УправлениеНебольшойФирмойСервер.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Обработки.ПульсБизнеса.ПолучитьДанные",
		ПараметрыПроцедуры,
		НаименованиеЗадания,
		,
		Ложь);
	
	ФоновоеЗаданиеАдресРезультата = Результат.АдресХранилища;
	ФоновоеЗаданиеИдентификатор   = Результат.ИдентификаторЗадания;
	
	// Если фоновое задание завершилось за время вызова, то данные уже получены
	Если Результат.ЗаданиеВыполнено Тогда
		ОбновитьДанные();
		ФоновоеЗаданиеВыполнено = Истина;
	Иначе
		// иначе начнем ожидания завершения фонового задания
		ФоновоеЗаданиеЗапущено = Истина;
		Если ПустаяСтрока(Секция) Тогда
			Элементы.СтраницаОжидание.Видимость = Истина;
			Элементы.СтраницаДанные.Видимость = Ложь;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОжиданиеЗавершенияФоновогоЗаданияНаКлиенте()
	
	Если ФоновоеЗаданиеЗапущено Тогда
		// Начнем опрос окончания фонового задания
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьЗавершениеДлительнойОперации",
			ПараметрыОбработчикаОжидания.ТекущийИнтервал,
			Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ФоновоеЗаданиеОтменить(ФоновоеЗаданиеИдентификатор)
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ФоновоеЗаданиеИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Показатели

&НаСервере
Процедура ДобавитьПоказатель(
	Показатель, 
	Ресурс = "", 
	Представление = "", 
	ПредставлениеРесурса = "", 
	Остаток = Ложь, 
	Валютный = Ложь, 
	Формат = "", 
	ИмяМакета = "", 
	ИмяОтчета = "", 
	КлючВарианта = "", 
	КолонкиОтчета = "", 
	РазделУчета = "")
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Показатель", Показатель);
	СтруктураПоиска.Вставить("Ресурс", Ресурс);
	Если НастройкиПоказателей.НайтиСтроки(СтруктураПоиска).Количество()>0 Тогда
		Возврат;
	КонецЕсли; 
	
	Стр = НастройкиПоказателей.Добавить();
	Стр.Показатель = Показатель;
	Стр.Ресурс = Ресурс;
	Стр.Представление = ?(ПустаяСтрока(Представление), Показатель, Представление);
	Стр.ПредставлениеРесурса = ?(ПустаяСтрока(ПредставлениеРесурса), Ресурс, ПредставлениеРесурса);
	Стр.Остаток = Остаток;
	Стр.Валютный = Валютный;
	Стр.Формат = Формат;
	Стр.ИмяМакета = ИмяМакета;
	Стр.ИмяОтчета = ИмяОтчета;
	Стр.КлючВарианта = КлючВарианта;
	Если ЗначениеЗаполнено(ИмяОтчета) И ЗначениеЗаполнено(КлючВарианта) Тогда
		Стр.Вариант = ВариантыОтчетов.ПолучитьСсылку(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.НайтиПоПолномуИмени(ИмяОтчета)), КлючВарианта);
	КонецЕсли; 
	Стр.КолонкиОтчета = КолонкиОтчета;
	Стр.РазделУчета = РазделУчета;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьПоказатель(Показатель, Ресурс, Представление = "")
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Показатель", Показатель);
	СтруктураОтбора.Вставить("Ресурс", Ресурс);
	Строки = НастройкиПоказателей.НайтиСтроки(СтруктураОтбора);
	Для каждого Стр Из Строки Цикл
		СтрДанных = ДобавленныеПоказатели.Добавить();
		ЗаполнитьЗначенияСвойств(СтрДанных, Стр, "Показатель, Ресурс");
		СтрДанных.Представление = ?(ПустаяСтрока(Представление), Стр.ПредставлениеРесурса, Представление);
		СтрДанных.ИдентификаторСтрокиНастроек = Стр.ПолучитьИдентификатор();
		СтрДанных.Остаток = Стр.Остаток;
		Если НЕ ПустаяСтрока(Стр.РазделУчета) Тогда
			СтрДанных.ВводОстатков = РежимыВводаОстатков[Стр.РазделУчета];
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДобавленияПоказателя()
	
	Если ФоновоеЗаданиеЗапущено Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Показатель", Неопределено);
	СтруктураОткрытия.Вставить("Ресурс", Неопределено);
	СтруктураОткрытия.Вставить("Представление", "");
	СтруктураОткрытия.Вставить("Фильтры", Новый ФиксированныйМассив(Новый Массив));
	СтруктураОткрытия.Вставить("Настройки", Новый ФиксированныйМассив(Новый Массив));
	
	СтруктураОткрытия.Вставить("АдресНастроекПоказателей", АдресНастроекПоказателей);
	
	ОткрытьФорму("Обработка.ПульсБизнеса.Форма.ФормаНастройкиПоказателя", СтруктураОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиПоказателя(Идентификатор)
	
	Если ФоновоеЗаданиеЗапущено Тогда
		Возврат;
	КонецЕсли; 
	
	Стр = ДобавленныеПоказатели.НайтиПоИдентификатору(Идентификатор);
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Показатель", Стр.Показатель);
	СтруктураОткрытия.Вставить("Ресурс", Стр.Ресурс);
	СтруктураОткрытия.Вставить("Представление", Стр.Представление);
	СтруктураОткрытия.Вставить("Фильтры", Стр.Фильтры);
	СтруктураОткрытия.Вставить("Настройки", Стр.Настройки);
	СтруктураОткрытия.Вставить("ИдентификаторСтроки", Идентификатор);
	
	СтруктураОткрытия.Вставить("АдресНастроекПоказателей", АдресНастроекПоказателей);
	
	ОткрытьФорму("Обработка.ПульсБизнеса.Форма.ФормаНастройкиПоказателя", СтруктураОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначенияПоказателей()
	
	Данные = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресРезультата);
	
	Для каждого Стр Из ДобавленныеПоказатели Цикл
		Если НЕ ПустаяСтрока(Данные.Секция) И
			((Данные.Секция="Остатки" И НЕ Стр.Остаток) ИЛИ
			(Данные.Секция="Обороты" И Стр.Остаток))Тогда
			Продолжить;
		КонецЕсли; 
		Стр.Значение = 0;
		Стр.Изменение = 0;
		Стр.Подсказка = "";
	КонецЦикла;
	
	Для каждого Стр Из ДобавленныеДиаграммы Цикл
		ОбъектДиаграмма = ЭтаФорма[Стр.ИмяРеквизита];
		ОбъектДиаграмма.Обновление = Ложь;
	КонецЦикла;
	
	Для каждого Элемент Из Данные.Показатели Цикл
		СтруктураЗначения = Элемент.Значение;
		Если НЕ ЗначениеЗаполнено(СтруктураЗначения.Значение) И НЕ ЗначениеЗаполнено(СтруктураЗначения.ЗначениеСравнения) Тогда
			Продолжить;
		КонецЕсли; 
		Стр = ДобавленныеПоказатели[Элемент.Ключ];
		СтрокаНастроек = НастройкиПоказателей.НайтиПоИдентификатору(Стр.ИдентификаторСтрокиНастроек);
		Если ЗначениеЗаполнено(СтруктураЗначения.Значение) Тогда
			Стр.Значение = ОтформатироватьЗначение(СтруктураЗначения.Значение, Стр);
		КонецЕсли; 
		Если (ПериодСравнения<>Неопределено И НЕ Стр.Остаток) ИЛИ
			(ДатаСравнения<>Неопределено И Стр.Остаток) Тогда
			Если ТипЗнч(СтруктураЗначения.Значение)=Тип("Соответствие") Тогда
				Продолжить;
			КонецЕсли; 
			Если СтруктураЗначения.ЗначениеСравнения<СтруктураЗначения.Значение Тогда
				Стр.Изменение = 1;
			ИначеЕсли СтруктураЗначения.ЗначениеСравнения>СтруктураЗначения.Значение Тогда
				Стр.Изменение = 2;
			Иначе
				Стр.Изменение = 0;
			КонецЕсли;
			Если СтрокаНастроек.Остаток Тогда
				Стр.Подсказка = НСтр("ru = 'На '; ka = 'თარიღისთვის '")+НРег(ПредставлениеСтандартнойДатыНачала(ДатаСравнения, Дата))+": "+ОтформатироватьЗначение(СтруктураЗначения.ЗначениеСравнения, Стр);
			Иначе
				Стр.Подсказка = НСтр("ru = 'За '; ka = 'პერიოდისთვის '")+НРег(ПредставлениеСтандартногоПериода(ПериодСравнения, Период))+": "+ОтформатироватьЗначение(СтруктураЗначения.ЗначениеСравнения, Стр);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	Для каждого Стр Из ДобавленныеПоказатели Цикл
		Если ПустаяСтрока(Стр.Ресурс) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.Значение) Тогда
			Стр.Значение = ?(Стр.ВводОстатков, Новый ФорматированнаяСтрока(БиблиотекаКартинок.СерыйПлюс), "-");
		КонецЕсли; 
		ЭлементЗначение = Элементы[Стр.ИмяГруппы+"_Значение"];
		ЭлементЗначение.Заголовок = Стр.Значение;
		ЭлементЗначение.Гиперссылка = НЕ (Стр.Значение="-");
		ЭлементСравнение = Элементы[Стр.ИмяГруппы+"_Сравнение"];
		Если Стр.Изменение=0 Тогда
			ЭлементСравнение.Картинка = БиблиотекаКартинок.Пустая;
		ИначеЕсли Стр.Изменение=1 Тогда
			ЭлементСравнение.Картинка = БиблиотекаКартинок.ЗначениеУвеличилось;
		ИначеЕсли Стр.Изменение=2 Тогда
			ЭлементСравнение.Картинка = БиблиотекаКартинок.ЗначениеУменьшилось;
		КонецЕсли;
		ЭлементСравнение.Подсказка = Стр.Подсказка;
	КонецЦикла; 
	
	Для каждого Стр Из ДобавленныеДиаграммы Цикл
		ОбъектДиаграмма = ЭтаФорма[Стр.ИмяРеквизита];
		ОбъектДиаграмма.Обновление = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыПоказатели()
	
	Для каждого Стр Из ДобавленныеПоказатели Цикл
		Если ПустаяСтрока(Стр.Ресурс) Тогда
			Продолжить;
		КонецЕсли; 
		Если ПустаяСтрока(Стр.ИмяГруппы) Тогда
			Стр.ИмяГруппы = "Показатель"+СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
			Если Стр.Остаток Тогда
				Группа = Элементы.Добавить(Стр.ИмяГруппы, Тип("ГруппаФормы"), Элементы.ГруппаПоказателиОстатки);
			Иначе
				Группа = Элементы.Добавить(Стр.ИмяГруппы, Тип("ГруппаФормы"), Элементы.ГруппаПоказателиОбороты);
			КонецЕсли; 
			Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			Группа.ОтображатьЗаголовок = Ложь;
			Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
			Группа.РастягиватьПоВертикали = Ложь;
			Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			Группа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
			ЭлементЗаголовок = Элементы.Добавить(Стр.ИмяГруппы+"_Заголовок", Тип("ДекорацияФормы"), Группа);
			ЭлементЗаголовок.Вид = ВидДекорацииФормы.Надпись;
			ЭлементЗаголовок.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
			ЭлементЗаголовок.РастягиватьПоГоризонтали = Истина;
			ЭлементЗаголовок.АвтоМаксимальнаяШирина = Ложь;
			ЭлементЗаголовок.МаксимальнаяШирина = 0;
			ЭлементЗаголовок.ПропускатьПриВводе = Ложь;
			Если НЕ ПустаяСтрока(Стр.Ресурс) Тогда
				ЭлементЗаголовок.ЦветТекста = ЦветаСтиля.ТекстВторостепеннойНадписи;
				ЭлементЗаголовок.Ширина = 25;
				ЭлементЗначение = Элементы.Добавить(Стр.ИмяГруппы+"_Значение", Тип("ДекорацияФормы"), Группа);
				ЭлементЗначение.Вид = ВидДекорацииФормы.Надпись;
				ЭлементЗначение.Гиперссылка = Истина;
				ЭлементЗначение.Ширина = 11;
				ЭлементЗначение.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
				ЭлементЗначение.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
				ЭлементЗначение.РастягиватьПоГоризонтали = Ложь;
				ЭлементЗначение.Высота = 1;
				ЭлементЗначение.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
				ЭлементЗначение.УстановитьДействие("Нажатие", "Подключаемый_ПоказательЗначениеНажатие");
				ЭлементСравнение = Элементы.Добавить(Стр.ИмяГруппы+"_Сравнение", Тип("ДекорацияФормы"), Группа);
				ЭлементСравнение.Вид = ВидДекорацииФормы.Картинка;
				ЭлементСравнение.РастягиватьПоГоризонтали = Ложь;
				ЭлементСравнение.РастягиватьПоВертикали = Ложь;
				ЭлементСравнение.Высота = 1;
				ЭлементСравнение.Ширина = 1;
				ЭлементСравнение.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
			Иначе
				ЭлементЗаголовок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
				ЭлементЗаголовок.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Низ;
				ЭлементЗаголовок.Высота = ?(ДобавленныеПоказатели.Индекс(Стр)=0, 1, 2);
			КонецЕсли; 
			// Контекстное меню
			ДобавитьКоманду(Стр.ИмяГруппы, "_Настроить", ЭлементЗаголовок, "КонтекстНастроитьПоказатель", НСтр("ka='მაჩვენებლის აწყობა';ru='Настроить показатель';en='customize rate'"), БиблиотекаКартинок.ХранилищеНастроек);
			Кнопка = ДобавитьКоманду(Стр.ИмяГруппы, "_Удалить", ЭлементЗаголовок, "КонтекстУдалитьПоказатель", НСтр("ka='მაჩვენებლის წაშლა';ru='Удалить показатель';en='Remove record'"), БиблиотекаКартинок.Удалить);
			Если ПустаяСтрока(Стр.Ресурс) Тогда
				Кнопка.Заголовок = НСтр("ka='სათაურის წაშლა';ru='Удалить заголовок';en='remove header'");
			КонецЕсли; 
			ДобавитьКоманду(Стр.ИмяГруппы, "_Вверх", ЭлементЗаголовок, "КонтекстСместитьВверхПоказатель", НСтр("ka='გადაადგილება მაღლა';ru='Сместить вверх';en='shift up'"), БиблиотекаКартинок.ПереместитьВверх);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Вниз", ЭлементЗаголовок, "КонтекстСместитьВнизПоказатель", НСтр("ka='გადაადგილება დაბლა';ru='Сместить вниз';en='shift down'"), БиблиотекаКартинок.ПереместитьВниз);
		Иначе
			ЭлементЗаголовок = Элементы[Стр.ИмяГруппы+"_Заголовок"];
		КонецЕсли;
		Если ПустаяСтрока(Стр.Ресурс) Тогда
			ЭлементЗаголовок.Заголовок = Новый ФорматированнаяСтрока(ВРег(Стр.Представление), Новый Шрифт(Новый Шрифт(),,, Истина));
		Иначе
			ЭлементЗаголовок.Заголовок = Стр.Представление;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьПоказатель(Идентификатор)
	
	ТекСтр = ДобавленныеПоказатели.НайтиПоИдентификатору(Идентификатор);
	СтрНастроек = НастройкиПоказателей.НайтиПоИдентификатору(ТекСтр.ИдентификаторСтрокиНастроек);
	Если НЕ ЗначениеЗаполнено(СтрНастроек.Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтр.ВводОстатков Тогда
		// Вместо расшифровки открываем помощник ввода начальных остатков
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("РазделУчета", СтрНастроек.РазделУчета);
		ОткрытьФорму("Обработка.ПомощникВводаНачальныхОстатков.Форма", ПараметрыОткрытия, ЭтотОбъект);
		Возврат;
	КонецЕсли; 
	
	ОтборРасшифровки = Новый Соответствие;
	Если СтрНастроек.Остаток Тогда
		ПериодРасшифровки = '0001-01-01';
		ОтборРасшифровки.Вставить("НачалоПериода", НачалоДня(ПериодРасшифровки));
		ОтборРасшифровки.Вставить("Период", ПериодРасшифровки);
		ОтборРасшифровки.Вставить("КонецПериода", ПериодРасшифровки);
	Иначе
		Если ТипЗнч(Период)=Тип("СтандартныйПериод") Тогда
			ДатаНачалаРасшифровки = НачалоДня(Период.ДатаНачала);
			ДатаКонцаРасшифровки = ?(ЗначениеЗаполнено(Период.ДатаОкончания), КонецДня(Период.ДатаОкончания), '0001-01-01');
		ИначеЕсли ТипЗнч(Период)=Тип("Структура") Тогда
			ОбновитьДатыНачалаИКонцаПериода(Период);
			ДатаНачалаРасшифровки = НачалоДня(Период.ДатаНачала);
			ДатаКонцаРасшифровки = ?(ЗначениеЗаполнено(Период.ДатаОкончания), КонецДня(Период.ДатаОкончания), '0001-01-01');
		Иначе
			ДатаНачалаРасшифровки = '0001-01-01';
			ДатаКонцаРасшифровки = '0001-01-01';
		КонецЕсли; 
		ОтборРасшифровки.Вставить("НачалоПериода", ДатаНачалаРасшифровки);
		ОтборРасшифровки.Вставить("КонецПериода", ДатаКонцаРасшифровки);
	КонецЕсли;
	Если ТипЗнч(ТекСтр.Фильтры)=Тип("ФиксированныйМассив") Тогда
		Для каждого Фильтр Из ТекСтр.Фильтры Цикл
			СтруктураЗначения = Новый Структура;
			СтруктураЗначения.Вставить("ВидСравнения", Фильтр.ВидСравнения);
			СтруктураЗначения.Вставить("Значение", Фильтр.Значение);
			ОтборРасшифровки.Вставить(Фильтр.Поле, СтруктураЗначения);
		КонецЦикла; 
	КонецЕсли; 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	Если НЕ ПустаяСтрока(СтрНастроек.КолонкиОтчета) Тогда
		ПараметрыФормы.Вставить("Колонки", СтрНастроек.КолонкиОтчета);
	КонецЕсли; 
	ПараметрыФормы.Вставить("ОтборРасшифровки", ОтборРасшифровки);
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтаФорма, СтрНастроек.Вариант, ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкуПоказателяСервер()
	
	СохранитьНастройки("Показатели");
	СоздатьЭлементыПоказатели();
	ЗапуститьФоновоеЗаданиеНаСервере();
	
КонецПроцедуры

#КонецОбласти 

#Область Диаграммы

&НаСервере
Процедура ДобавитьОписаниеСерииТочки(СтруктураСерийТочек, Имя, Представления, Заголовок = "", ТипДиаграммы = Неопределено, Валютная = Ложь, Формат = "", ДоступныеТочкиСерии = "", ОбязательныеФильтры = Неопределено)
	
	ОписаниеСерииТочки = Новый Структура;
	Если ТипЗнч(Представления)=Тип("Строка") Тогда
		МассивПредставлений = Новый Массив;
		МассивПредставлений.Добавить(Представления);
	Иначе
		МассивПредставлений = Представления;
	КонецЕсли; 
	ОписаниеСерииТочки.Вставить("Представления", Новый ФиксированныйМассив(МассивПредставлений));
	ОписаниеСерииТочки.Вставить("Заголовок", Заголовок);
	ОписаниеСерииТочки.Вставить("ТипДиаграммы", ТипДиаграммы);
	ОписаниеСерииТочки.Вставить("Валютная", Валютная);
	ОписаниеСерииТочки.Вставить("Формат", Формат);
	ОписаниеСерииТочки.Вставить("ДоступныеТочкиСерии", ДоступныеТочкиСерии);
	ОписаниеСерииТочки.Вставить("ОбязательныеФильтры", ОбязательныеФильтры);
	СтруктураСерийТочек.Вставить(Имя, ОписаниеСерииТочки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДиаграмму(Диаграмма, Представление = "", Серии, Точки, Остаток, ИмяМакета = "", ИмяОтчета = "", КлючВарианта = "", ЗапретитьСравнение = Ложь)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Диаграмма", Диаграмма);
	Если НастройкиДиаграмм.НайтиСтроки(СтруктураПоиска).Количество()>0 Тогда
		Возврат;
	КонецЕсли; 
	
	Стр = НастройкиДиаграмм.Добавить();
	Стр.Диаграмма = Диаграмма;
	Стр.Представление = ?(ПустаяСтрока(Представление), Диаграмма, Представление);
	Стр.Серии = Серии;
	Стр.Точки = Точки;
	Стр.Остаток = Остаток;
	Стр.ИмяМакета = ИмяМакета;
	Стр.ИмяОтчета = ИмяОтчета;
	Стр.КлючВарианта = КлючВарианта;
	Стр.ЗапретитьСравнение = ЗапретитьСравнение;
	Если ЗначениеЗаполнено(ИмяОтчета) И ЗначениеЗаполнено(КлючВарианта) Тогда
		Стр.Вариант = ВариантыОтчетов.ПолучитьСсылку(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.НайтиПоПолномуИмени(ИмяОтчета)), КлючВарианта);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьДиаграмму(Диаграмма, Серия, Точка, Период = Неопределено, ПериодСравнения = Неопределено, Представление = "", Фильтры = Неопределено)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Диаграмма", Диаграмма);
	Строки = НастройкиДиаграмм.НайтиСтроки(СтруктураОтбора);
	Для каждого Стр Из Строки Цикл
		НастройкиСерии = Стр.Серии[Серия];
		НастройкиТочки = Стр.Точки[Точка];
		СтрДанных = ДобавленныеДиаграммы.Добавить();
		СтрДанных.Диаграмма = Диаграмма;
		СтрДанных.Серия = Серия;
		СтрДанных.Точка = Точка;
		СтрДанных.Представление = ?(ПустаяСтрока(Представление), Стр.Представление, Представление);
		СтрДанных.ПредставленияСерий = НастройкиСерии.Представления;
		СтрДанных.ПредставленияТочек = НастройкиТочки.Представления;
		СтрДанных.ИдентификаторСтрокиНастроек = Стр.ПолучитьИдентификатор();
		Если ЗначениеЗаполнено(Период) Тогда
			СтрДанных.Период = Период;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ПериодСравнения) Тогда
			СтрДанных.ПериодСравнения = ПериодСравнения;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Фильтры) Тогда
			СтрДанных.Фильтры = Новый ФиксированныйМассив(Фильтры);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДобавленияДиаграммы()
	
	Если ФоновоеЗаданиеЗапущено Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Диаграмма", Неопределено);
	СтруктураОткрытия.Вставить("Серия", Неопределено);
	СтруктураОткрытия.Вставить("Точка", Неопределено);
	СтруктураОткрытия.Вставить("Представление", "");
	СтруктураОткрытия.Вставить("Период", Новый СтандартныйПериод);
	СтруктураОткрытия.Вставить("ПериодСравнения", Новый СтандартныйПериод);
	СтруктураОткрытия.Вставить("Фильтры", Новый ФиксированныйМассив(Новый Массив));
	СтруктураОткрытия.Вставить("Настройки", Новый ФиксированныйМассив(Новый Массив));
	
	СтруктураОткрытия.Вставить("АдресНастроекДиаграмм", АдресНастроекДиаграмм);
	
	ОткрытьФорму("Обработка.ПульсБизнеса.Форма.ФормаНастройкиДиаграммы", СтруктураОткрытия, ЭтотОбъект);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОткрытьФормуНастройкиДиаграммы(Идентификатор)
	
	Если ФоновоеЗаданиеЗапущено Тогда
		Возврат;
	КонецЕсли; 
	
	Стр = ДобавленныеДиаграммы.НайтиПоИдентификатору(Идентификатор);
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Диаграмма", Стр.Диаграмма);
	СтруктураОткрытия.Вставить("Серия", Стр.Серия);
	СтруктураОткрытия.Вставить("Точка", Стр.Точка);
	СтруктураОткрытия.Вставить("Представление", Стр.Представление);
	СтруктураОткрытия.Вставить("Период", Стр.Период);
	СтруктураОткрытия.Вставить("ПериодСравнения", Стр.ПериодСравнения);
	Если ТипЗнч(Стр.Фильтры)=Тип("ФиксированныйМассив") Тогда
		СтруктураОткрытия.Вставить("Фильтры", Стр.Фильтры);
	Иначе
		СтруктураОткрытия.Вставить("Фильтры", Новый ФиксированныйМассив(Новый Массив));
	КонецЕсли;
	Если ТипЗнч(Стр.Настройки)=Тип("ФиксированныйМассив") Тогда
		СтруктураОткрытия.Вставить("Настройки", Стр.Настройки);
	Иначе
		СтруктураОткрытия.Вставить("Настройки", Новый ФиксированныйМассив(Новый Массив));
	КонецЕсли;
	СтруктураОткрытия.Вставить("ИдентификаторСтроки", Идентификатор);
	
	СтруктураОткрытия.Вставить("АдресНастроекДиаграмм", АдресНастроекДиаграмм);
	
	ОткрытьФорму("Обработка.ПульсБизнеса.Форма.ФормаНастройкиДиаграммы", СтруктураОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначенияДиаграмм()
	
	Данные = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресРезультата);
	
	Если НЕ ПустаяСтрока(Данные.Секция) Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого Стр Из ДобавленныеДиаграммы Цикл
		
		ОбъектДиаграмма = ЭтаФорма[Стр.ИмяРеквизита];
		ОбъектДиаграмма.Обновление = Ложь;
		ОбъектДиаграмма.Очистить();
		
	КонецЦикла; 
	
	Для каждого Элемент Из Данные.Диаграммы Цикл
		
		МассивДанных = Элемент.Значение;
		Стр = ДобавленныеДиаграммы[Элемент.Ключ];
		СтрокаНастройки = НастройкиДиаграмм.НайтиПоИдентификатору(Стр.ИдентификаторСтрокиНастроек);
		ОписаниеТочки = СтрокаНастройки.Точки[Стр.Точка];
		ОписаниеСерии = СтрокаНастройки.Серии[Стр.Серия];
		ОбъектДиаграмма = ЭтаФорма[Стр.ИмяРеквизита];
		
		Попытка
			
			ТаблицаЗначений = Новый ТаблицаЗначений;
			ТаблицаЗначений.Колонки.Добавить("Точка");
			ТаблицаЗначений.Колонки.Добавить("ДляСравнения");
			ТаблицаЗначений.Колонки.Добавить("Порядок");
			ТаблицаЗначений.Колонки.Добавить("КоличествоСерий");
			ТаблицаЗначений.Колонки.Добавить("БазовоеЗначение");
			ТекущееКоличествоСерий = 0;
			Для каждого СтруктураЗначения Из МассивДанных Цикл
				Если СтруктураЗначения.КоличествоСерий>ТекущееКоличествоСерий Тогда
					Для ии = ТекущееКоличествоСерий По СтруктураЗначения.КоличествоСерий Цикл
						ТаблицаЗначений.Колонки.Добавить("Серия"+(ии+1));
					КонецЦикла;
					ТекущееКоличествоСерий = СтруктураЗначения.КоличествоСерий;
				КонецЕсли; 
				ЗаполнитьЗначенияСвойств(ТаблицаЗначений.Добавить(), СтруктураЗначения);
			КонецЦикла; 
			ТаблицаЗначений.Сортировать("Порядок, ДляСравнения");
			
			ЕстьДанныеДляОтображения = НЕ ПустаяДиаграмма(ТаблицаЗначений);
			Если НЕ ЕстьДанныеДляОтображения Тогда
				НаполнитьСлучайнымиДанными(ОбъектДиаграмма, МассивДанных, ОписаниеТочки, ОписаниеСерии);
			Иначе
				ОбъектДиаграмма.ОтображатьЗаголовок = Ложь;
				Для каждого СтруктураЗначения Из ТаблицаЗначений Цикл
					Если ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.Круговая ИЛИ 
						ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.КруговаяОбъемная Тогда
						Если НЕ ЗначениеЗаполнено(СтруктураЗначения.Точка) Тогда
							Продолжить;
						КонецЕсли; 
						Точка = ОбъектДиаграмма.УстановитьТочку(Стр.ПредставленияСерий[0]);
						Серия = ОбъектДиаграмма.УстановитьСерию(?(НЕ ЗначениеЗаполнено(СтруктураЗначения.Серия1), 
						НСтр("ka='<არ არის ჩევსებული>';ru='<не заполнено>';en='<Not filled>'"), 
						СтруктураЗначения.Серия1));
						ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, СтруктураЗначения.Точка);
					ИначеЕсли ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.ГрафикСОбластямиИНакоплением Тогда
						Если Не ПустаяСтрока(ОписаниеТочки.Формат) Тогда
							Точка = ОбъектДиаграмма.УстановитьТочку(Формат(СтруктураЗначения.Точка, ОписаниеТочки.Формат));
						Иначе
							Точка = ОбъектДиаграмма.УстановитьТочку(
							?(НЕ ЗначениеЗаполнено(СтруктураЗначения.Точка), 
							НСтр("ka='არ არის შევსებული>';ru='<не заполнено>';en='<Not filled>'"), 
							Строка(СтруктураЗначения.Точка)));
						КонецЕсли;
						Если ЗначениеЗаполнено(СтруктураЗначения.БазовоеЗначение) Тогда
							Серия = ОбъектДиаграмма.УстановитьСерию("БазовоеЗначение");
							Серия.Текст = "-";
							Серия.Цвет = ЦветаСтиля.ЦветДиаграммыОтсутствующиеДанные;
							ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, СтруктураЗначения.БазовоеЗначение); 
						КонецЕсли; 
						Для ии = 1 По СтруктураЗначения.КоличествоСерий Цикл
							Если НЕ ЗначениеЗаполнено(СтруктураЗначения["Серия"+ии]) Тогда
								Продолжить;
							КонецЕсли; 
							Серия = ОбъектДиаграмма.УстановитьСерию(Стр.ПредставленияСерий[ии-1]);
							ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, ?(СтруктураЗначения["Серия"+ии]<0, -СтруктураЗначения["Серия"+ии], СтруктураЗначения["Серия"+ии]));
						КонецЦикла;  
					Иначе
						Если Не ПустаяСтрока(ОписаниеТочки.Формат) Тогда
							Точка = ОбъектДиаграмма.УстановитьТочку(Формат(СтруктураЗначения.Точка, ОписаниеТочки.Формат));
						Иначе
							Точка = ОбъектДиаграмма.УстановитьТочку(
							?(НЕ ЗначениеЗаполнено(СтруктураЗначения.Точка), 
							НСтр("ka='<არ არის შევსებული>';ru='<не заполнено>';en='<Not filled>'"), 
							Строка(СтруктураЗначения.Точка)));
						КонецЕсли;
						Если ЗначениеЗаполнено(СтруктураЗначения.Серия1) И СтруктураЗначения.ДляСравнения Тогда
							Серия = ОбъектДиаграмма.УстановитьСерию(Стр.ПредставленияСерий[1]);
							ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, СтруктураЗначения.Серия1);
						Иначе
							Для ии = 1 По СтруктураЗначения.КоличествоСерий Цикл
								Если НЕ ЗначениеЗаполнено(СтруктураЗначения["Серия"+ии]) Тогда
									Продолжить;
								КонецЕсли; 
								Серия = ОбъектДиаграмма.УстановитьСерию(Стр.ПредставленияСерий[ии-1]);
								ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, СтруктураЗначения["Серия"+ии]);
							КонецЦикла;  
						КонецЕсли; 
					КонецЕсли; 
				КонецЦикла;
			КонецЕсли; 
			
			Если НЕ ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.Круговая  
				И НЕ ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.КруговаяОбъемная
				И ОбъектДиаграмма.Серии.Количество()<=1 Тогда
				ОбъектДиаграмма.ОтображатьЛегенду = Ложь;
				ОбъектДиаграмма.ОбластьПостроения.Право = 0.99;
			Иначе
				ОбъектДиаграмма.ОтображатьЛегенду = Истина;
				ОбъектДиаграмма.ОбластьПостроения.Право = 0.75;
			КонецЕсли; 
			
			УстановитьОтображениеДиаграммы(ОбъектДиаграмма, ЕстьДанныеДляОтображения);
			ОбъектДиаграмма.Обновление = Истина;
			
		Исключение
			
			ОбъектДиаграмма.Очистить();
			ОбъектДиаграмма.Обновление = Истина;
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ВывестиОшибкуДиаграммы(ОбъектДиаграмма, ИнформацияОбОшибке);
		    
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиОшибкуДиаграммы(ОбъектДиаграмма, ИнформацияОбОшибке)
	
	ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	ПодробноеПредставлениеОшибки = НСтр("ka='შეცდომა შედგენისას:';ru='Ошибка при формировании:';en='Error in the formation of:'") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	Если ПустаяСтрока(ОписаниеОшибки) Тогда
		ОписаниеОшибки = ПодробноеПредставлениеОшибки;
	КонецЕсли;
	
	ОбъектДиаграмма.ОтображатьЗаголовок = Истина;
	ОбъектДиаграмма.ОбластьЗаголовка.Текст = ОписаниеОшибки;
	ОбъектДиаграмма.ОбластьЗаголовка.ЦветТекста = ЦветаСтиля.ЦветИнформацияОшибочна;
	
КонецПроцедуры
 
&НаСервере
Процедура СоздатьЭлементыДиаграммы()
	
	// Создание реквизитов формы
	МассивРеквизитов = Новый Массив;
	Для каждого Стр Из ДобавленныеДиаграммы Цикл
		Если НЕ ПустаяСтрока(Стр.ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		Стр.ИмяРеквизита = "Диаграмма"+СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Стр.ИмяРеквизита, Новый ОписаниеТипов("Диаграмма")));
	КонецЦикла;
	ИзменитьРеквизиты(МассивРеквизитов);
	
	Для каждого Стр Из ДобавленныеДиаграммы Цикл
		СтрокаНастройки = НастройкиДиаграмм.НайтиПоИдентификатору(Стр.ИдентификаторСтрокиНастроек);
		ОписаниеТочки = СтрокаНастройки.Точки[Стр.Точка];
		ОписаниеСерии = СтрокаНастройки.Серии[Стр.Серия];
		Если ПустаяСтрока(Стр.ИмяГруппы) Тогда
			Стр.ИмяГруппы = "Диаграмма"+СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
			Группа = Элементы.Добавить(Стр.ИмяГруппы, Тип("ГруппаФормы"), Элементы.ГруппаДобавленныеДиаграммы);
			Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			Группа.ОтображатьЗаголовок = Ложь;
			Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
			Группа.РастягиватьПоВертикали = Ложь;
			Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ЭлементЗаголовок = Элементы.Добавить(Стр.ИмяГруппы+"_Заголовок", Тип("ДекорацияФормы"), Группа);
			ЭлементЗаголовок.Вид = ВидДекорацииФормы.Надпись;
			ЭлементЗаголовок.РастягиватьПоГоризонтали = Истина;
			ЭлементЗаголовок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
			ЭлементЗаголовок.Шрифт = Новый Шрифт("Arial", 10, Истина);
			ЭлементЗаголовок.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Низ;
			ЭлементЗаголовок.Высота = ?(ДобавленныеДиаграммы.Индекс(Стр)=0, 1, 2);
			ЭлементДиаграмма = Элементы.Добавить(Стр.ИмяГруппы+"_Диаграмма", Тип("ПолеФормы"), Группа);
			ЭлементДиаграмма.Вид = ВидПоляФормы.ПолеДиаграммы;
			ЭлементДиаграмма.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ЭлементДиаграмма.ПутьКДанным = Стр.ИмяРеквизита;
			ЭлементДиаграмма.Ширина = 30;
			ЭлементДиаграмма.Высота = 7;
			ЭлементДиаграмма.УстановитьДействие("Выбор", "Подключаемый_ДиаграммаВыбор");
			// Контекстное меню
			ДобавитьКоманду(Стр.ИмяГруппы, "_Настроить", ЭлементДиаграмма, "КонтекстНастроитьДиаграмму", НСтр("ka='გრაფიკის აწყობა';ru='Настроить график';en='configure schedule'"), БиблиотекаКартинок.ХранилищеНастроек);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Удалить", ЭлементДиаграмма, "КонтекстУдалитьДиаграмму", НСтр("ka='გრაფიკის წაშლა';ru='Удалить график';en='Delete schedule'"), БиблиотекаКартинок.Удалить);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Вверх", ЭлементДиаграмма, "КонтекстСместитьВверхДиаграмму", НСтр("ka='გადაადგილება ზემოთ';ru='Сместить вверх';en='shift up'"), БиблиотекаКартинок.ПереместитьВверх);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Вниз", ЭлементДиаграмма, "КонтекстСместитьВнизДиаграмму", НСтр("ka='გადაადგილება ქვემოთ';ru='Сместить вниз';en='shift down'"), БиблиотекаКартинок.ПереместитьВниз);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Расшифровать", ЭлементДиаграмма, "КонтекстРасшифроватьДиаграмму", НСтр("ka='გაშიფრვა';ru='Расшифровать';en='decrypt'"), БиблиотекаКартинок.Найти);
			// Контекстное меню заголовка
			ДобавитьКоманду(Стр.ИмяГруппы, "_Настроить", ЭлементЗаголовок, "КонтекстНастроитьДиаграмму", НСтр("ka='გრაფიკის აწყობა';ru='Настроить график';en='configure schedule'"), БиблиотекаКартинок.ХранилищеНастроек);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Удалить", ЭлементЗаголовок, "КонтекстУдалитьДиаграмму", НСтр("ka='გრაფიკის წაშლა';ru='Удалить график';en='Delete schedule'"), БиблиотекаКартинок.Удалить);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Вверх", ЭлементЗаголовок, "КонтекстСместитьВверхДиаграмму", НСтр("ka='გადაადგილება ზემოთ';ru='Сместить вверх';en='shift up'"), БиблиотекаКартинок.ПереместитьВверх);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Вниз", ЭлементЗаголовок, "КонтекстСместитьВнизДиаграмму", НСтр("ka='გადაადგილება ქვემოთ';ru='Сместить вниз';en='shift down'"), БиблиотекаКартинок.ПереместитьВниз);
			ДобавитьКоманду(Стр.ИмяГруппы, "_Расшифровать", ЭлементЗаголовок, "КонтекстРасшифроватьДиаграмму", НСтр("ka='გაშიფრვა';ru='Расшифровать';en='decrypt'"), БиблиотекаКартинок.Найти);
		Иначе
			Группа = Элементы[Стр.ИмяГруппы];
			ЭлементДиаграмма = Элементы[Стр.ИмяГруппы+"_Диаграмма"];
			ЭлементЗаголовок = Элементы[Стр.ИмяГруппы+"_Заголовок"];
		КонецЕсли;
		ЭлементЗаголовок.Заголовок = ВРег(Стр.Представление);
		ОбъектДиаграмма = ЭтаФорма[Стр.ИмяРеквизита];
		ОбъектДиаграмма.Обновление = Ложь;
		ОбъектДиаграмма.ТипДиаграммы = ОписаниеСерии.ТипДиаграммы;
		ОбъектДиаграмма.ОтображатьЗаголовок = Ложь;
		ОбъектДиаграмма.ОбластьЛегенды.Шрифт = Новый Шрифт(ОбъектДиаграмма.ОбластьЛегенды.Шрифт, "Arial", 7);
		ОбъектДиаграмма.ОбластьПостроения.Шрифт = Новый Шрифт(ОбъектДиаграмма.ОбластьПостроения.Шрифт, "Arial", 7);
		ОбъектДиаграмма.ОбластьПостроения.Право = 0.75;
		ОбъектДиаграмма.ОбластьЛегенды.Лево = 0.78;
		ОбъектДиаграмма.ОбластьПостроения.Низ = 0.99;
		Если ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.Круговая ИЛИ 
			ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.КруговаяОбъемная Тогда
			ОбъектДиаграмма.МаксимумСерий = МаксимумСерий.Ограничено;
			ОбъектДиаграмма.МаксимумСерийКоличество = 10;
		ИначеЕсли ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.ГрафикСОбластямиИНакоплением Тогда
			ОбъектДиаграмма.АвтоУстановкаТекстаСерий = Ложь;
			ОбъектДиаграмма.ОбластьПостроения.ОтображатьПодписиШкалыТочек = Ложь;
			ОбъектДиаграмма.ОбластьПостроения.ОтображатьЛинииЗначенийШкалы = Ложь;
			ОбъектДиаграмма.РежимСглаживания = РежимСглаживанияДиаграммы.ГладкаяКривая;
		Иначе
			ОбъектДиаграмма.ОбластьПостроения.ОриентацияМеток = ОриентацияМетокДиаграммы.Вертикально;
			Если НЕ ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.ГистограммаСНакоплением 
				И НЕ ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.ГистограммаСНакоплениемОбъемная Тогда
				ОбъектДиаграмма.РежимПробелов = РежимПробеловДиаграммы.Нет;
			КонецЕсли; 
			ОбъектДиаграмма.ОбластьПостроения.ОтображатьЛинииЗначенийШкалы = Ложь;
		КонецЕсли;
		
		ОбъектДиаграмма.Анимация = АнимацияДиаграммы.НеИспользовать;
		
		ОбъектДиаграмма.Обновление = Истина;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура НаполнитьСлучайнымиДанными(ОбъектДиаграмма, ТаблицаЗначений, ОписаниеТочки, ОписаниеСерии)
	
	Генератор = Новый ГенераторСлучайныхЧисел;
	СуммаБазовая = 100;
	Если ТаблицаЗначений.Количество()>0 Тогда
		Для каждого СтруктураЗначения Из ТаблицаЗначений Цикл
			СуфиксСравнения = ?(СтруктураЗначения.ДляСравнения, НСтр("ru = ' (сравн)'; ka = ' (შედარება)'"), "");
			Если Не ПустаяСтрока(ОписаниеТочки.Формат) Тогда
				Точка = ОбъектДиаграмма.УстановитьТочку(Формат(СтруктураЗначения.Точка, ОписаниеТочки.Формат)+СуфиксСравнения);
			Иначе
				Точка = ОбъектДиаграмма.УстановитьТочку(
				?(НЕ ЗначениеЗаполнено(СтруктураЗначения.Точка), 
				НСтр("ka='<არ არის შევსებული>';ru='<не заполнено>';en='<Not filled>'")+СуфиксСравнения, 
				Строка(СтруктураЗначения.Точка)+СуфиксСравнения));
			КонецЕсли; 
			Серия = ОбъектДиаграмма.УстановитьСерию(НСтр("ka='თანხა';ru='Сумма';en='Сумма'"));
			ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, Генератор.СлучайноеЧисло(0, 100));
			Если ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.ГистограммаСНакоплением 
				ИЛИ ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.ГистограммаСНакоплениемОбъемная Тогда
				Серия = ОбъектДиаграмма.УстановитьСерию(НСтр("ka='თანხა 2';ru='Сумма 2';en='sum 2'"));
				ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, Генератор.СлучайноеЧисло(0, 30));
			КонецЕсли; 
		КонецЦикла; 
	Иначе
		Для ии = 1 По 8 Цикл
			Если ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.Круговая ИЛИ 
				ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.КруговаяОбъемная Тогда
				СуммаБазовая = Окр(СуммаБазовая*(100-Генератор.СлучайноеЧисло(0, 30))/100, 2);
				Точка = ОбъектДиаграмма.УстановитьТочку(НСтр("ka='თანხა';ru='Сумма';en='Сумма'"));
				Серия = ОбъектДиаграмма.УстановитьСерию(НСтр("ru='Пример ';ka='მაგალითი '")+ии);
				ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, СуммаБазовая);
			Иначе
				Точка = ОбъектДиаграмма.УстановитьТочку(НСтр("ru='Пример ';ka='მაგალითი '")+ии);
				Серия = ОбъектДиаграмма.УстановитьСерию(НСтр("ka='თანხა';ru='Сумма';en='Сумма'"));
				ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, Генератор.СлучайноеЧисло(0, 100));
				Если ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.ГистограммаСНакоплением 
					ИЛИ ОписаниеСерии.ТипДиаграммы=ТипДиаграммы.ГистограммаСНакоплениемОбъемная Тогда
					Серия = ОбъектДиаграмма.УстановитьСерию(НСтр("ka='თანხა 2';ru='Сумма 2';en='sum 2'"));
					ОбъектДиаграмма.УстановитьЗначение(Точка, Серия, Генератор.СлучайноеЧисло(0, 30));
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	ОбъектДиаграмма.ОтображатьЗаголовок = Истина;
	ОбъектДиаграмма.ОбластьЗаголовка.Текст = НСтр("ka='მაგალითი';ru='ПРИМЕР';en='EXAMPLE'");
	ОбъектДиаграмма.ОбластьЗаголовка.ЦветТекста = ЦветаСтиля.ЦветРамки;
	ОбъектДиаграмма.ОбластьЗаголовка.Шрифт = Новый Шрифт("Arial", 18, Истина);
			
КонецПроцедуры

&НаСервере
Функция ПустаяДиаграмма(Данные)
	
	Для каждого Стр Из Данные Цикл
		Если ТипЗнч(Стр.Точка)=Тип("Число") И ЗначениеЗаполнено(Стр.Точка) Тогда
			Возврат Ложь;
		КонецЕсли; 
		Для ии = 1 По Стр.КоличествоСерий Цикл
			Если ТипЗнч(Стр["Серия"+ии])=Тип("Число") И ЗначениеЗаполнено(Стр["Серия"+ии]) Тогда
				Возврат Ложь;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 
	Возврат Истина;
	
КонецФункции

// Процедура постобработки диаграмм. Устанавливает цвета серий и толщину линий
//
// Параметры:
//  Диаграмма				 - диаграмма - обрабатываемая диаграмма
//  ЕстьДанныеДляОтображения - булево	 - признак наличия/отсутствия данных
//  ЦветаСерий				 - массив	 - массив цветов в соответствии с которым назначаются цвета. Если не задан, то назначаются по умолчанию
&НаСервереБезКонтекста
Процедура УстановитьОтображениеДиаграммы(Диаграмма, ЕстьДанныеДляОтображения, ЦветаСерий = Неопределено)
	
	Диаграмма.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, 0);
	Диаграмма.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
	Диаграмма.ОбластьЗаголовка.ПрозрачныйФон = Истина;
	Диаграмма.ОбластьПостроения.ПрозрачныйФон = Истина;
	Диаграмма.ОбластьЛегенды.ПрозрачныйФон = Истина;
	
	Диаграмма.ОбластьПостроения.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
	Диаграмма.ОбластьЛегенды.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
	Диаграмма.ОбластьЗаголовка.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
		
	Если ЦветаСерий = Неопределено Тогда
		ЦветаСерий = УправлениеНебольшойФирмойКлиентСервер.ЦветаСерийДиаграмм();
	КонецЕсли;
	Диаграмма.СводнаяСерия.Цвет = ЦветаСтиля.ЦветДиаграммыОтсутствующиеДанные;
	Диаграмма.СводнаяСерия.Текст = НСтр("ka='სხვა დანარჩენი';ru='Прочее';en='Other'");
	
	// Если точек на диаграмме меньше, то серии рисуем толстой линией, если больше - то тонкой
	МаксТочекДиаграммыСТолстойЛинией = 10;
	
	ТонкаяЛиния = Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
	ТолстаяЛиния = Новый Линия(ТипЛинииДиаграммы.Сплошная, 2);
	
	Для ИндексСерии = 0 По Диаграмма.Серии.Количество() - 1 Цикл
		
		Серия = Диаграмма.Серии[ИндексСерии];
		
		Если Серия.Цвет=ЦветаСтиля.ЦветДиаграммыОтсутствующиеДанные Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ЕстьДанныеДляОтображения И ИндексСерии<ЦветаСерий.Количество() Тогда
			Серия.Цвет = ЦветаСерий[ИндексСерии];
		ИначеЕсли НЕ ЕстьДанныеДляОтображения И ИндексСерии<ЦветаСерий.Количество() Тогда
			ЦветБазовый = ЦветаСерий[ИндексСерии];
			ЦветСерии = Новый Цвет(
			ЦветБазовый.Красный+(255-ЦветБазовый.Красный)/2,
			ЦветБазовый.Зеленый+(255-ЦветБазовый.Зеленый)/2,
			ЦветБазовый.Синий+(255-ЦветБазовый.Синий)/2);
			Серия.Цвет = ЦветСерии;
		Иначе
			Серия.Цвет = ЦветаСтиля.ЦветДиаграммыОтсутствующиеДанные;
		КонецЕсли;
		
		Если Диаграмма.Точки.Количество() > МаксТочекДиаграммыСТолстойЛинией Тогда
			Серия.Линия = ТонкаяЛиния;
		Иначе
			Серия.Линия = ТолстаяЛиния;
		КонецЕсли;
		
	КонецЦикла;
	
	Диаграмма.ОбластьЗаголовка.Лево = 0;
	Диаграмма.ОбластьЗаголовка.Право = 1;
	Диаграмма.ОбластьЗаголовка.Верх = 0;
	Диаграмма.ОбластьЗаголовка.Низ = 1;
	Диаграмма.ОбластьПостроения.Верх = 0.01;
	Диаграмма.ОбластьЛегенды.Верх = 0.01;
	Диаграмма.ОбластьЛегенды.Прокрутка = (Диаграмма.Серии.Количество()>5);
		
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьДиаграмму(Идентификатор)
	
	ТекСтр = ДобавленныеДиаграммы.НайтиПоИдентификатору(Идентификатор);
	СтрНастроек = НастройкиДиаграмм.НайтиПоИдентификатору(ТекСтр.ИдентификаторСтрокиНастроек);
	Если НЕ ЗначениеЗаполнено(СтрНастроек.Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборРасшифровки = Новый Соответствие;
	Если СтрНастроек.Остаток Тогда
		Если ТипЗнч(ТекСтр.Период)=Тип("СтандартнаяДатаНачала") Тогда
			ПериодРасшифровки = НачалоДня(ТекСтр.Период.Дата)-1;
		ИначеЕсли ТипЗнч(ТекСтр.Период)=Тип("СтандартнаяДатаНачала") Тогда
			ОбновитьДату(ТекСтр.Период);
			ПериодРасшифровки = НачалоДня(ТекСтр.Период.Дата)-1;
		Иначе
			ПериодРасшифровки = '0001-01-01';
		КонецЕсли; 
		ОтборРасшифровки.Вставить("НачалоПериода", НачалоДня(ПериодРасшифровки));
		ОтборРасшифровки.Вставить("Период", ПериодРасшифровки);
		ОтборРасшифровки.Вставить("КонецПериода", ПериодРасшифровки);
	Иначе
		Если ТипЗнч(ТекСтр.Период)=Тип("СтандартныйПериод") Тогда
			ДатаНачалаРасшифровки = НачалоДня(ТекСтр.Период.ДатаНачала);
			ДатаКонцаРасшифровки = ?(ЗначениеЗаполнено(ТекСтр.Период.ДатаОкончания), КонецДня(ТекСтр.Период.ДатаОкончания), '0001-01-01');
		ИначеЕсли ТипЗнч(ТекСтр.Период)=Тип("Структура") Тогда
			ОбновитьДатыНачалаИКонцаПериода(ТекСтр.Период);
			ДатаНачалаРасшифровки = НачалоДня(ТекСтр.Период.ДатаНачала);
			ДатаКонцаРасшифровки = ?(ЗначениеЗаполнено(ТекСтр.Период.ДатаОкончания), КонецДня(ТекСтр.Период.ДатаОкончания), '0001-01-01');
		Иначе
			ДатаНачалаРасшифровки = '0001-01-01';
			ДатаКонцаРасшифровки = '0001-01-01';
		КонецЕсли; 
		ОтборРасшифровки.Вставить("НачалоПериода", ДатаНачалаРасшифровки);
		ОтборРасшифровки.Вставить("КонецПериода", ДатаКонцаРасшифровки);
	КонецЕсли;
	Если ТипЗнч(ТекСтр.Фильтры)=Тип("ФиксированныйМассив") Тогда
		Для каждого Фильтр Из ТекСтр.Фильтры Цикл
			СтруктураЗначения = Новый Структура;
			СтруктураЗначения.Вставить("ВидСравнения", Фильтр.ВидСравнения);
			СтруктураЗначения.Вставить("Значение", Фильтр.Значение);
			ОтборРасшифровки.Вставить(Фильтр.Поле, СтруктураЗначения);
		КонецЦикла; 
	КонецЕсли; 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("ОтборРасшифровки", ОтборРасшифровки);
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтаФорма, СтрНастроек.Вариант, ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкуДиаграммыСервер()
	
	СохранитьНастройки("Диаграммы");
	СоздатьЭлементыДиаграммы();
	ЗапуститьФоновоеЗаданиеНаСервере();
	
КонецПроцедуры

#КонецОбласти 

#Область Периоды

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеСтандартногоПериода(Период, ПериодОснование = Неопределено)
	
	Если ТипЗнч(Период)=Тип("Структура") Тогда
		ОбновитьДатыНачалаИКонцаПериода(Период, ПериодОснование);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Возврат НСтр("ka='არ არის შერცეული';ru='Не выбран';en='not selected'");
	ИначеЕсли Период.Вариант=ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) Тогда
			Возврат НСтр("ru='до ';ka='მდე '")+Формат(Период.ДатаОкончания, "ДЛФ=D");
		ИначеЕсли НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
			Возврат НСтр("ru='от ';ka='დან '")+Формат(Период.ДатаНачала, "ДЛФ=D");
		Иначе
			Возврат ПредставлениеПериода(НачалоДня(Период.ДатаНачала), ?(ЗначениеЗаполнено(Период.ДатаОкончания), КонецДня(Период.ДатаОкончания), Период.ДатаОкончания), НСТР("ka='Л=ka; ФП = Истина';ru='ФП = Истина';en='OP = True'"));
		КонецЕсли; 
	ИначеЕсли Период.Вариант="ПредыдущийПлавающийПериод" Тогда
		Возврат НСтр("ka='გასული პერიოდი (';ru='Предыдущий период (';en='Previous period ('")+ПредставлениеПериода(НачалоДня(Период.ДатаНачала), КонецДня(Период.ДатаОкончания), НСТР("ka='Л=ka; ФП = Истина';ru='ФП = Истина';en='OP = True'"))+")";
	ИначеЕсли Период.Вариант="ЗаПрошлыйГод" Тогда
		Возврат НСтр("ka='გასული წელი (';ru='За прошлый год (';en='For the last year ('")+ПредставлениеПериода(НачалоДня(Период.ДатаНачала), КонецДня(Период.ДатаОкончания), НСТР("ka='Л=ka; ФП = Истина';ru='ФП = Истина';en='OP = True'"))+")";
	ИначеЕсли Период.Вариант="Последние7ДнейНеСчитаяТекущего" Тогда
		Возврат НСтр("ka='გასული 7 დღე, მიმდინარე დღის გაუთვალისწინებლად';ru='Последние 7 дней, не считая текущего';en='The last 7 days, not including the current'");
	Иначе
		пПериод = Строка(Период);
		Если пПериод = "Вчера" Тогда
			Возврат  НСТР("ka='გუშინ';ru='Вчера';en='Yesterday'");
		ИначеЕсли пПериод = "Сегодня" Тогда
			Возврат НСТР("ka='დღეს';ru='Сегодня';en='Today'")
		Иначе
			Возврат пПериод;
		КонецЕсли;
	КонецЕсли; 
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеСтандартнойДатыНачала(Дата, ДатаСравнения = Неопределено)
	
	Если ТипЗнч(Дата)=Тип("Структура") Тогда
		ОбновитьДату(Дата, ДатаСравнения);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат НСтр("ka='არ არის არჩეული';ru='Не выбрана';en='not selected'");
	ИначеЕсли Дата.Вариант=ВариантСтандартнойДатыНачала.ПроизвольнаяДата Тогда
		Возврат Формат(Дата.Дата, "ДФ=dd.MM.yyyy");
	ИначеЕсли Дата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтогоДня Тогда
		Возврат НСтр("ka='დღეს, დღის დასაწყისისთვის';ru='Сегодня, на начало дня';en='Today, at the beginning of the day'");
	ИначеЕсли Дата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующегоДня Тогда
		Возврат НСтр("ka='ყოველთვის აქტუალურია';ru='Всегда актуально';en='always true'");
	ИначеЕсли Дата.Вариант="ТакойЖеДеньНаПрошлойНеделе" Тогда
		Возврат НСтр("ka='წინა კვირას იგივე დღე (';ru='Такой же день на прошлой неделе (';en='The same day last week ('")+Формат(Дата.Дата, "ДФ='dd.MM.yyyy, ддд'")+")";
	ИначеЕсли Дата.Вариант="ТакойЖеДеньВПрошломМесяце" Тогда
		Возврат НСтр("ka='წინა თვის იგივე დღე (';ru='Такой же день прошлого месяца (';en='The same day last month ('")+Формат(Дата.Дата, "ДФ='dd.MM.yyyy, ддд'")+")";
	ИначеЕсли Дата.Вариант="ТакойЖеДеньВПрошломГоду" Тогда
		Возврат НСтр("ka='წინა წლის იგივე დღე (';ru='Такой же день в прошлом году (';en='The same day last year ('")+Формат(Дата.Дата, "ДФ='dd.MM.yyyy'")+")";
	Иначе
		Возврат Строка(Дата);
	КонецЕсли; 
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредыдущаяДата(Знач СтандартнаяДата, ТипДаты)
	
	Если ПустаяСтрока(ТипДаты) ИЛИ ТипДаты="День" Тогда
		СтандартнаяДата.Дата = СтандартнаяДата.Дата-3600*24;
	ИначеЕсли ТипДаты="Неделя" Тогда
		СтандартнаяДата.Дата = СтандартнаяДата.Дата-3600*24*7;
	ИначеЕсли ТипДаты="Декада" Тогда
		СтандартнаяДата.Дата = СтандартнаяДата.Дата-3600*24*10;
	ИначеЕсли ТипДаты="Месяц" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, -1);
	ИначеЕсли ТипДаты="Квартал" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, -3);
	ИначеЕсли ТипДаты="Полугодие" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, -6);
	ИначеЕсли ТипДаты="Год" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, -12);
	КонецЕсли; 	
	
	Возврат СтандартнаяДата;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция СледующаяДата(Знач СтандартнаяДата, ТипДаты)
	
	Если ПустаяСтрока(ТипДаты) ИЛИ ТипДаты="День" Тогда
		СтандартнаяДата.Дата = СтандартнаяДата.Дата+3600*24;
	ИначеЕсли ТипДаты="Неделя" Тогда
		СтандартнаяДата.Дата = СтандартнаяДата.Дата+3600*24*7;
	ИначеЕсли ТипДаты="Декада" Тогда
		СтандартнаяДата.Дата = СтандартнаяДата.Дата+3600*24*10;
	ИначеЕсли ТипДаты="Месяц" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, 1);
	ИначеЕсли ТипДаты="Квартал" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, 3);
	ИначеЕсли ТипДаты="Полугодие" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, 6);
	ИначеЕсли ТипДаты="Год" Тогда
		СтандартнаяДата.Дата = ДобавитьМесяц(СтандартнаяДата.Дата, 12);
	КонецЕсли; 	
	
	Возврат СтандартнаяДата;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ПредыдущийПериод(Знач СтандартныйПериод, ТипПериода)
	
	Если ТипЗнч(СтандартныйПериод)=Тип("Структура") Тогда
		ОбновитьДатыНачалаИКонцаПериода(СтандартныйПериод);
	КонецЕсли; 
	
	Если ПустаяСтрока(ТипПериода) Тогда
		КоличествоДней = (НачалоДня(СтандартныйПериод.ДатаОкончания)-НачалоДня(СтандартныйПериод.ДатаНачала))/86400+1;
		Результат = Новый СтандартныйПериод(
		НачалоДня(СтандартныйПериод.ДатаНачала)-КоличествоДней*86400,
		НачалоДня(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="День" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоДня(СтандартныйПериод.ДатаНачала)-86400,
		НачалоДня(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="Неделя" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоНедели(НачалоНедели(СтандартныйПериод.ДатаНачала)-1),
		НачалоНедели(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="Декада" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоДекады(СтандартныйПериод.ДатаНачала-10*86400),
		НачалоДекады(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="Месяц" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоМесяца(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -1)),
		КонецМесяца(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -1)));
	ИначеЕсли ТипПериода="Квартал" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоКвартала(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -3)),
		КонецКвартала(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -3)));
	ИначеЕсли ТипПериода="Полугодие" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоПолугодия(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -6)),
		КонецПолугодия(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -6)));
	ИначеЕсли ТипПериода="Год" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоГода(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -12)),
		КонецГода(ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -12)));
	ИначеЕсли ТипПериода="ДоКонцаНедели" Тогда 
		Результат = Новый СтандартныйПериод(
		СтандартныйПериод.ДатаНачала-7*86400,
		НачалоНедели(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="СНачалаНедели" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоНедели(НачалоНедели(СтандартныйПериод.ДатаНачала)-1),
		СтандартныйПериод.ДатаОкончания-7*86400);
	ИначеЕсли ТипПериода="ДоКонцаДекады" Тогда
		ДеньДекады = ДеньДекады(СтандартныйПериод.ДатаНачала);
		НачалоДекады = НачалоДекады(НачалоДекады(СтандартныйПериод.ДатаНачала)-1);
		ДатаНачала = НачалоДекады+(ДеньДекады-1)*86400;
		Если НачалоДекады(ДатаНачала)<>НачалоДекады Тогда
			ДатаНачала = НачалоДня(КонецДекады(НачалоДекады));
		КонецЕсли; 
		Результат = Новый СтандартныйПериод(
		ДатаНачала,
		НачалоДекады(НачалоДекады));
	ИначеЕсли ТипПериода="СНачалаДекады" Тогда 
		ДеньДекады = ДеньДекады(СтандартныйПериод.ДатаОкончания);
		НачалоДекады = НачалоДекады(НачалоДекады(СтандартныйПериод.ДатаНачала)-1);
		ДатаОкончания = КонецДня(НачалоДекады+(ДеньДекады-1)*86400);
		Если НачалоДекады(ДатаОкончания)<>НачалоДекады Тогда
			ДатаОкончания = КонецДекады(НачалоДекады);
		КонецЕсли; 
		Результат = Новый СтандартныйПериод(
		НачалоДекады,
		ДатаОкончания);
	ИначеЕсли ТипПериода="ДоКонцаМесяца" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -1),
		НачалоМесяца(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="СНачалаМесяца" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоМесяца(НачалоМесяца(СтандартныйПериод.ДатаНачала)-1),
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, -1));
	ИначеЕсли ТипПериода="ДоКонцаКвартала" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -3),
		НачалоКвартала(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="СНачалаКвартала" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоКвартала(НачалоКвартала(СтандартныйПериод.ДатаНачала)-1),
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, -3));
	ИначеЕсли ТипПериода="ДоКонцаПолугодия" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -6),
		НачалоПолугодия(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="СНачалаПолугодия" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоПолугодия(НачалоПолугодия(СтандартныйПериод.ДатаНачала)-1),
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, -6));
	ИначеЕсли ТипПериода="ДоКонцаГода" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -12),
		НачалоГода(СтандартныйПериод.ДатаНачала)-1);
	ИначеЕсли ТипПериода="СНачалаГода" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоГода(НачалоГода(СтандартныйПериод.ДатаНачала)-1),
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, -12));
	ИначеЕсли ТипПериода="ЗаПрошлыйГод" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, -12),
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, -12));
	КонецЕсли; 	 	
	
	Возврат Результат;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция СледующийПериод(Знач СтандартныйПериод, ТипПериода)
	
	Если ТипЗнч(СтандартныйПериод)=Тип("Структура") Тогда
		ОбновитьДатыНачалаИКонцаПериода(СтандартныйПериод);
	КонецЕсли; 
	
	Если ПустаяСтрока(ТипПериода) Тогда
		КоличествоДней = (НачалоДня(СтандартныйПериод.ДатаОкончания)-НачалоДня(СтандартныйПериод.ДатаНачала))/86400+1;
		Результат = Новый СтандартныйПериод(
		КонецДня(СтандартныйПериод.ДатаОкончания)+1,
		КонецДня(СтандартныйПериод.ДатаОкончания)+КоличествоДней*86400);
	ИначеЕсли ТипПериода="День" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецДня(СтандартныйПериод.ДатаОкончания)+1,
		КонецДня(СтандартныйПериод.ДатаОкончания)+86400);
	ИначеЕсли ТипПериода="Неделя" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецНедели(СтандартныйПериод.ДатаОкончания)+1,
		КонецНедели(КонецНедели(СтандартныйПериод.ДатаОкончания)+1));
	ИначеЕсли ТипПериода="Декада" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецДекады(СтандартныйПериод.ДатаОкончания)+1,
		КонецДекады(КонецДекады(СтандартныйПериод.ДатаОкончания)+1));
	ИначеЕсли ТипПериода="Месяц" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоМесяца(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 1)),
		КонецМесяца(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 1)));
	ИначеЕсли ТипПериода="Квартал" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоКвартала(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 3)),
		КонецКвартала(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 3)));
	ИначеЕсли ТипПериода="Полугодие" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоПолугодия(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 6)),
		КонецПолугодия(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 6)));
	ИначеЕсли ТипПериода="Год" Тогда 
		Результат = Новый СтандартныйПериод(
		НачалоГода(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 12)),
		КонецГода(ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 12)));
	ИначеЕсли ТипПериода="ДоКонцаНедели" Тогда 
		Результат = Новый СтандартныйПериод(
		СтандартныйПериод.ДатаНачала+7*86400,
		КонецНедели(КонецНедели(СтандартныйПериод.ДатаОкончания)+1));
	ИначеЕсли ТипПериода="СНачалаНедели" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецНедели(СтандартныйПериод.ДатаОкончания)+1,
		СтандартныйПериод.ДатаОкончания+7*86400);
	ИначеЕсли ТипПериода="ДоКонцаДекады" Тогда
		ДеньДекады = ДеньДекады(СтандартныйПериод.ДатаНачала);
		НачалоДекады = КонецДекады(СтандартныйПериод.ДатаОкончания)+1;
		ДатаНачала = НачалоДекады+(ДеньДекады-1)*86400;
		Если НачалоДекады(ДатаНачала)<>НачалоДекады(НачалоДекады) Тогда
			ДатаНачала = НачалоДня(КонецДекады(НачалоДекады));
		КонецЕсли; 
		Результат = Новый СтандартныйПериод(
		ДатаНачала,
		КонецДекады(НачалоДекады));
	ИначеЕсли ТипПериода="СНачалаДекады" Тогда 
		ДеньДекады = ДеньДекады(СтандартныйПериод.ДатаОкончания);
		НачалоДекады = КонецДекады(СтандартныйПериод.ДатаОкончания)+1;
		ДатаОкончания = КонецДня(НачалоДекады+(ДеньДекады-1)*86400);
		Если НачалоДекады(ДатаОкончания)<>НачалоДекады(НачалоДекады) Тогда
			ДатаОкончания = КонецДекады(НачалоДекады);
		КонецЕсли; 
		Результат = Новый СтандартныйПериод(
		НачалоДекады,
		ДатаОкончания);
	ИначеЕсли ТипПериода="ДоКонцаМесяца" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, 1),
		КонецМесяца(КонецМесяца(СтандартныйПериод.ДатаОкончания)+1));
	ИначеЕсли ТипПериода="СНачалаМесяца" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецМесяца(СтандартныйПериод.ДатаНачала)+1,
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 1));
	ИначеЕсли ТипПериода="ДоКонцаКвартала" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, 3),
		КонецКвартала(КонецКвартала(СтандартныйПериод.ДатаОкончания)+1));
	ИначеЕсли ТипПериода="СНачалаКвартала" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецКвартала(СтандартныйПериод.ДатаОкончания)+1,
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 3));
	ИначеЕсли ТипПериода="ДоКонцаПолугодия" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, 6),
		КонецПолугодия(КонецПолугодия(СтандартныйПериод.ДатаОкончания)+1));
	ИначеЕсли ТипПериода="СНачалаПолугодия" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецПолугодия(СтандартныйПериод.ДатаОкончания)+1,
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 6));
	ИначеЕсли ТипПериода="ДоКонцаГода" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, 12),
		КонецГода(КонецГода(СтандартныйПериод.ДатаОкончания)+1));
	ИначеЕсли ТипПериода="СНачалаГода" Тогда 
		Результат = Новый СтандартныйПериод(
		КонецГода(СтандартныйПериод.ДатаОкончания)+1,
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 12));
	ИначеЕсли ТипПериода="ЗаПрошлыйГод" Тогда 
		Результат = Новый СтандартныйПериод(
		ДобавитьМесяц(СтандартныйПериод.ДатаНачала, 12),
		ДобавитьМесяц(СтандартныйПериод.ДатаОкончания, 12));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДатыНачалаИКонцаПериода(СтандартныйПериод, ПериодОснование = Неопределено)

	Если НЕ ТипЗнч(СтандартныйПериод)=Тип("Структура") Тогда
		Возврат;
	КонецЕсли; 
	Если СтандартныйПериод.Вариант="Последние7ДнейНеСчитаяТекущего" Тогда
		СтандартныйПериод.Вставить("ДатаНачала", НачалоДня(ТекущаяДата())-86400*7);
		СтандартныйПериод.Вставить("ДатаОкончания", НачалоДня(ТекущаяДата())-1);
	ИначеЕсли СтандартныйПериод.Вариант="ЗаПрошлыйГод" И ПериодОснование<>Неопределено Тогда
		Период = УправлениеНебольшойФирмойКлиентСервер.АналогичныйПериодПрошлогоГода(ПериодОснование);
		СтандартныйПериод.Вставить("ДатаНачала", Период.ДатаНачала);
		СтандартныйПериод.Вставить("ДатаОкончания", Период.ДатаОкончания);
	ИначеЕсли СтандартныйПериод.Вариант="ПредыдущийПлавающийПериод" И ПериодОснование<>Неопределено Тогда
		Период = УправлениеНебольшойФирмойКлиентСервер.ПредыдущийПлавающийПериод(ПериодОснование);
		СтандартныйПериод.Вставить("ДатаНачала", Период.ДатаНачала);
		СтандартныйПериод.Вставить("ДатаОкончания", Период.ДатаОкончания);
	КонецЕсли; 	
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДату(СтандартнаяДата, ДатаСравнения = Неопределено)

	Если НЕ ТипЗнч(СтандартнаяДата)=Тип("Структура") Тогда
		Возврат;
	КонецЕсли; 
	Если СтандартнаяДата.Вариант="ТакойЖеДеньНаПрошлойНеделе" Тогда
		СтандартнаяДата.Вставить("Дата", НачалоДня(ТекущаяДата())-86400*7);
	ИначеЕсли СтандартнаяДата.Вариант="ТакойЖеДеньВПрошломМесяце" Тогда
		СтандартнаяДата.Вставить("Дата", ДобавитьМесяц(НачалоДня(ТекущаяДата()), -1));
	ИначеЕсли СтандартнаяДата.Вариант="ТакойЖеДеньВПрошломГоду" Тогда
		СтандартнаяДата.Вставить("Дата", ДобавитьМесяц(НачалоДня(ТекущаяДата()), -12));
	КонецЕсли; 	
	
КонецПроцедуры 

// Возвращает начало декады для заданной даты
//
// Параметры:
//    ПараметрДата - Дата - Дата определения начала декады
//
// Возвращаемое значение: 
//    * Дата - Дата начала декады
//
&НаСервереБезКонтекста
Функция НачалоДекады(ПараметрДата)
	
	Если ТипЗнч(ПараметрДата)<>Тип("Дата") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если День(ПараметрДата) < 11 Тогда
		Возврат Дата(Год(ПараметрДата), Месяц(ПараметрДата), 1);
	КонецЕсли;
	
	Если День(ПараметрДата) < 21 Тогда
		Возврат Дата(Год(ПараметрДата), Месяц(ПараметрДата), 11);
	КонецЕсли;
	
	Возврат Дата(Год(ПараметрДата), Месяц(ПараметрДата), 21);
	
КонецФункции

// Возвращает конец декады для заданной даты
//
// Параметры:
//    ПараметрДата - Дата - Дата определения конца декады
//
// Возвращаемое значение: 
//    * Дата - Дата конца декады
//
&НаСервереБезКонтекста
Функция КонецДекады(ПараметрДата)
	
	Если ТипЗнч(ПараметрДата)<>Тип("Дата") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если День(ПараметрДата) >= 21 Тогда
		Возврат КонецМесяца(ПараметрДата);
	КонецЕсли;
	
	Если День(ПараметрДата) >= 11 Тогда
		Возврат КонецДня(Дата(Год(ПараметрДата), Месяц(ПараметрДата), 20));
	КонецЕсли;
	
	Возврат КонецДня(Дата(Год(ПараметрДата), Месяц(ПараметрДата), 10));
	
КонецФункции

// Возвращает номер дня декады для заданной даты
//
// Параметры:
//    ПараметрДата - Дата - Дата определения начала декады
//
// Возвращаемое значение: 
//    * Число - Номер дня декады
//
&НаСервереБезКонтекста
Функция ДеньДекады(ПараметрДата)
	
	Если ТипЗнч(ПараметрДата)<>Тип("Дата") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	День = День(ПараметрДата);
	Если День=31 Тогда
		Возврат 11;
	КонецЕсли; 
	ДеньДекады = День % 10;
	Если ДеньДекады=0 Тогда
		ДеньДекады = 10;
	КонецЕсли; 
	
	Возврат ДеньДекады;
	
КонецФункции

// Возвращает полугодия декады для заданной даты
//
// Параметры:
//    ПараметрДата - Дата - Дата определения начала полугодия
//
// Возвращаемое значение: 
//    * Дата - Дата начала полугодия
//
&НаСервереБезКонтекста
Функция НачалоПолугодия(ПараметрДата)
	
	Если ТипЗнч(ПараметрДата)<>Тип("Дата") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Месяц(ПараметрДата) < 7 Тогда
		Возврат НачалоГода(ПараметрДата);
	Иначе
		Возврат ДобавитьМесяц(НачалоГода(ПараметрДата), 7);
	КонецЕсли;
	
КонецФункции

// Возвращает конец полугодия для заданной даты
//
// Параметры:
//    ПараметрДата - Дата - Дата определения конца полугодия
//
// Возвращаемое значение: 
//    * Дата - Дата конца полугодия
//
&НаСервереБезКонтекста
Функция КонецПолугодия(ПараметрДата)
	
	Если ТипЗнч(ПараметрДата)<>Тип("Дата") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Месяц(ПараметрДата) < 7 Тогда
		Возврат КонецМесяца(ДобавитьМесяц(НачалоГода(ПараметрДата), 6));
	Иначе
		Возврат КонецГода(ПараметрДата);
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипДаты(Знач СтандартнаяДата)
	
	Если СтандартнаяДата=Неопределено 
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.ПроизвольнаяДата Тогда
		Возврат "";
	ИначеЕсли СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтогоДня
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоПрошлогоДня
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующегоДня Тогда
		Возврат "День";
	ИначеЕсли СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтойНедели
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоПрошлойНедели
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующегоДня
		ИЛИ СтандартнаяДата.Вариант="ТакойЖеДеньНаПрошлойНеделе" Тогда
		Возврат "Неделя";
	ИначеЕсли СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтойДекады
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоПрошлойДекады
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующейДекады Тогда
		Возврат "Декада";
	ИначеЕсли СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтогоМесяца
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоПрошлогоМесяца
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующегоМесяца
		ИЛИ СтандартнаяДата.Вариант="ТакойЖеДеньВПрошломМесяце" Тогда
		Возврат "Месяц";
	ИначеЕсли СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтогоКвартала
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоПрошлогоКвартала
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующегоКвартала Тогда
		Возврат "Квартал";
	ИначеЕсли СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтогоПолугодия
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоПрошлогоПолугодия
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующегоПолугодия Тогда
		Возврат "Полугодие";
	ИначеЕсли СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоЭтогоГода
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоПрошлогоГода
		ИЛИ СтандартнаяДата.Вариант=ВариантСтандартнойДатыНачала.НачалоСледующегоГода
		ИЛИ СтандартнаяДата.Вариант="ТакойЖеДеньВПрошломГоду" Тогда
		Возврат "Год";
	КонецЕсли; 	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипПериода(СтандартныйПериод)
	
	Если СтандартныйПериод=Неопределено
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.Последние7Дней
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.Следующие7Дней
		ИЛИ СтандартныйПериод.Вариант="Последние7ДнейНеСчитаяТекущего"
		ИЛИ СтандартныйПериод.Вариант="ПредыдущийПлавающийПериод" Тогда
		Возврат "";
	ИначеЕсли СтандартныйПериод.Вариант="ЗаПрошлыйГод" Тогда
		Возврат "ЗаПрошлыйГод";
	ИначеЕсли НачалоНедели(СтандартныйПериод.ДатаНачала)=НачалоНедели(СтандартныйПериод.ДатаОкончания) И
		НачалоНедели(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецНедели(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбрана произвольная неделя целиком
		Возврат "Неделя";
	ИначеЕсли НачалоМесяца(СтандартныйПериод.ДатаНачала)=НачалоМесяца(СтандартныйПериод.ДатаОкончания) И
		НачалоМесяца(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецМесяца(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбран произвольный месяц целиком
		Возврат "Месяц";
	ИначеЕсли НачалоКвартала(СтандартныйПериод.ДатаНачала)=НачалоКвартала(СтандартныйПериод.ДатаОкончания) И
		НачалоКвартала(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецКвартала(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбран произвольный квартал целиком
		Возврат "Квартал";
	ИначеЕсли НачалоПолугодия(СтандартныйПериод.ДатаНачала)=НачалоПолугодия(СтандартныйПериод.ДатаОкончания) И
		НачалоПолугодия(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецПолугодия(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбрано произвольное полугодие целиком
		Возврат "Полугодие";
	ИначеЕсли НачалоГода(СтандартныйПериод.ДатаНачала)=НачалоГода(СтандартныйПериод.ДатаОкончания) И
		НачалоГода(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецГода(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбран произвольный год целиком
		Возврат "Год";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		Возврат "";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.Вчера
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.Сегодня
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.Завтра Тогда
		Возврат "День";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлаяНеделя
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующаяНеделя
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтаНеделя Тогда
		Возврат "Неделя";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ДоКонцаЭтойНедели Тогда
		Возврат "ДоКонцаНедели";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СНачалаЭтойНедели
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлаяНеделяДоТакогоЖеДняНедели
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующаяНеделяДоТакогоЖеДняНедели Тогда
		Возврат "СНачалаНедели";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлаяДекада
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующаяДекада
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтаДекада Тогда
		Возврат "Декада";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ДоКонцаЭтойДекады Тогда
		Возврат "ДоКонцаДекады";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СНачалаЭтойДекады
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлаяДекадаДоТакогоЖеНомераДня
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующаяДекадаДоТакогоЖеНомераДня Тогда
		Возврат "СНачалаДекады";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлыйМесяц
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующийМесяц
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтотМесяц Тогда
		Возврат "Месяц";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ДоКонцаЭтогоМесяца Тогда
		Возврат "ДоКонцаМесяца";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СНачалаЭтогоМесяца
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлыйМесяцДоТакойЖеДаты
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующийМесяцДоТакойЖеДаты Тогда
		Возврат "СНачалаМесяца";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлыйКвартал
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующийКвартал
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтотКвартал Тогда
		Возврат "Квартал";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ДоКонцаЭтогоКвартала Тогда
		Возврат "ДоКонцаКвартала";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СНачалаЭтогоКвартала
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлыйКварталДоТакойЖеДаты
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующийКварталДоТакойЖеДаты Тогда
		Возврат "СНачалаКвартала";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлоеПолугодие
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующееПолугодие
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтоПолугодие Тогда
		Возврат "Полугодие";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ДоКонцаЭтогоПолугодия Тогда
		Возврат "ДоКонцаПолугодия";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СНачалаЭтогоПолугодия
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлоеПолугодиеДоТакойЖеДаты
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующееПолугодиеДоТакойЖеДаты Тогда
		Возврат "СНачалаПолугодия";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлыйГод
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующийГод
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтотГод Тогда
		Возврат "Год";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ДоКонцаЭтогоГода Тогда
		Возврат "ДоКонцаГода";
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СНачалаЭтогоГода
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПрошлыйГодДоТакойЖеДаты
		ИЛИ СтандартныйПериод.Вариант=ВариантСтандартногоПериода.СледующийГодДоТакойЖеДаты Тогда
		Возврат "СНачалаГода";
	КонецЕсли; 	
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ПериодСравненияПоПериоду(СтандартныйПериод)
	
	Если ТипЗнч(СтандартныйПериод)=Тип("Структура") Тогда
		ОбновитьДатыНачалаИКонцаПериода(СтандартныйПериод);
	КонецЕсли; 
	
	Если ТипЗнч(СтандартныйПериод)=Тип("Структура") И СтандартныйПериод.Вариант="Последние7ДнейНеСчитаяТекущего" Тогда
		Результат = Новый Структура;
		Результат.Вставить("Вариант", "ПредыдущийПлавающийПериод");
		ПредыдущийПериод = УправлениеНебольшойФирмойКлиентСервер.ПредыдущийПлавающийПериод(СтандартныйПериод);
		Результат.Вставить("ДатаНачала", ПредыдущийПериод.ДатаНачала);
		Результат.Вставить("ДатаОкончания", ПредыдущийПериод.ДатаОкончания);
		Возврат Результат;
	ИначеЕсли НЕ ТипЗнч(СтандартныйПериод)=Тип("СтандартныйПериод") Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйМесяц);
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.Сегодня Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтаНеделя Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлаяНеделяДоТакогоЖеДняНедели);
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтаДекада Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлаяДекадаДоТакогоЖеНомераДня);
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтотМесяц Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйМесяцДоТакойЖеДаты);
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтотКвартал Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйКварталДоТакойЖеДаты);
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтоПолугодие Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлоеПолугодиеДоТакойЖеДаты);
	ИначеЕсли СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ЭтотГод Тогда
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйГодДоТакойЖеДаты);
	ИначеЕсли НачалоНедели(СтандартныйПериод.ДатаНачала)=НачалоНедели(СтандартныйПериод.ДатаОкончания) И
		НачалоНедели(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецНедели(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбрана произвольная неделя целиком
		ДатаНачала = НачалоНедели(НачалоНедели(СтандартныйПериод.ДатаНачала)-1);
		ДатаОкончания = НачалоНедели(СтандартныйПериод.ДатаНачала)-1;
		Возврат Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
	ИначеЕсли НачалоМесяца(СтандартныйПериод.ДатаНачала)=НачалоМесяца(СтандартныйПериод.ДатаОкончания) И
		НачалоМесяца(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецМесяца(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбран произвольный месяц целиком
		ДатаНачала = НачалоМесяца(НачалоМесяца(СтандартныйПериод.ДатаНачала)-1);
		ДатаОкончания = НачалоМесяца(СтандартныйПериод.ДатаНачала)-1;
		Возврат Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
	ИначеЕсли НачалоКвартала(СтандартныйПериод.ДатаНачала)=НачалоКвартала(СтандартныйПериод.ДатаОкончания) И
		НачалоКвартала(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецКвартала(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбран произвольный квартал целиком
		ДатаНачала = НачалоКвартала(НачалоКвартала(СтандартныйПериод.ДатаНачала)-1);
		ДатаОкончания = НачалоКвартала(СтандартныйПериод.ДатаНачала)-1;
		Возврат Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
	ИначеЕсли НачалоПолугодия(СтандартныйПериод.ДатаНачала)=НачалоПолугодия(СтандартныйПериод.ДатаОкончания) И
		НачалоПолугодия(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецПолугодия(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбрано произвольное полугодие целиком
		ДатаНачала = НачалоКвартала(НачалоКвартала(СтандартныйПериод.ДатаНачала)-1);
		ДатаОкончания = НачалоКвартала(СтандартныйПериод.ДатаНачала)-1;
		Возврат Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
	ИначеЕсли НачалоГода(СтандартныйПериод.ДатаНачала)=НачалоГода(СтандартныйПериод.ДатаОкончания) И
		НачалоГода(СтандартныйПериод.ДатаНачала)=НачалоДня(СтандартныйПериод.ДатаНачала) И
		КонецГода(СтандартныйПериод.ДатаОкончания)=КонецДня(СтандартныйПериод.ДатаОкончания) Тогда
		// Периодом выбран произвольный год целиком
		ДатаНачала = НачалоГода(НачалоГода(СтандартныйПериод.ДатаНачала)-1);
		ДатаОкончания = НачалоГода(СтандартныйПериод.ДатаНачала)-1;
		Возврат Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
	ИначеЕсли ЗначениеЗаполнено(СтандартныйПериод.ДатаНачала) И НачалоГода(СтандартныйПериод.ДатаНачала)=НачалоГода(СтандартныйПериод.ДатаОкончания) Тогда
		Результат = Новый Структура;
		Результат.Вставить("Вариант", "ЗаПрошлыйГод");
		Период = УправлениеНебольшойФирмойКлиентСервер.АналогичныйПериодПрошлогоГода(СтандартныйПериод);
		Если Период<>Неопределено Тогда
			Результат.Вставить("ДатаНачала", Период.ДатаНачала);
			Результат.Вставить("ДатаОкончания", Период.ДатаОкончания);
			Возврат Результат;
		Иначе
			Возврат Неопределено;
		КонецЕсли; 
	Иначе
		Результат = Новый Структура;
		Результат.Вставить("Вариант", "ПредыдущийПлавающийПериод");
		Период = УправлениеНебольшойФирмойКлиентСервер.ПредыдущийПлавающийПериод(СтандартныйПериод);
		Если Период<>Неопределено Тогда
			Результат.Вставить("ДатаНачала", Период.ДатаНачала);
			Результат.Вставить("ДатаОкончания", Период.ДатаОкончания);
			Возврат Результат;
		Иначе
			Возврат Неопределено;
		КонецЕсли; 
	КонецЕсли; 	
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция МожноСместитьПериод(СтандартныйПериод)
	
	Если СтандартныйПериод=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтандартныйПериод.Вариант="" Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если СтандартныйПериод.Вариант=ВариантСтандартногоПериода.ПроизвольныйПериод 
		И (НЕ ЗначениеЗаполнено(СтандартныйПериод.ДатаНачала)
		ИЛИ НЕ ЗначениеЗаполнено(СтандартныйПериод.ДатаОкончания)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПредставленияПериодов(Форма)
	
	// Видимость групп выбора параметров сравнения
	ВидимостьДатыСравнения = (Форма.ДатаСравнения<>Неопределено);
	Если Форма.Элементы.ГруппаПоказателиОстаткиДатаСравнения.Видимость<>ВидимостьДатыСравнения Тогда
		Форма.Элементы.ГруппаПоказателиОстаткиДатаСравнения.Видимость = ВидимостьДатыСравнения;
	КонецЕсли; 
	ВидимостьПериодаСравнения = (Форма.ПериодСравнения<>Неопределено);
	Если Форма.Элементы.ГруппаПоказателиОборотыПериодСравнения.Видимость<>ВидимостьПериодаСравнения Тогда
		Форма.Элементы.ГруппаПоказателиОборотыПериодСравнения.Видимость = ВидимостьПериодаСравнения;
	КонецЕсли;
	
	// Доступность кнопок смещения периода
	ДоступностьКнопокПериод = МожноСместитьПериод(Форма.Период);
	Если Форма.Элементы.ПериодНазад.Доступность<>ДоступностьКнопокПериод Тогда
		Форма.Элементы.ПериодНазад.Доступность = ДоступностьКнопокПериод;
		Форма.Элементы.ПериодВперед.Доступность = ДоступностьКнопокПериод;
	КонецЕсли; 
	ДоступностьКнопокПериодСравнения = МожноСместитьПериод(Форма.ПериодСравнения);
	Если Форма.Элементы.ПериодСравненияНазад.Доступность<>ДоступностьКнопокПериодСравнения Тогда
		Форма.Элементы.ПериодСравненияНазад.Доступность = ДоступностьКнопокПериодСравнения;
		Форма.Элементы.ПериодСравненияВперед.Доступность = ДоступностьКнопокПериодСравнения;
	КонецЕсли; 
	
	// Представления периодов
	Форма.Элементы.ДатаВыбор.Заголовок = ВРег(НСтр("ka='დღეისთვის';ru='На сегодня';en='For today'"));
	Форма.Элементы.ДатаВыбор.РасширеннаяПодсказка.Заголовок = Форма.Элементы.ДатаВыбор.Заголовок;
	
	Представление = ПредставлениеСтандартнойДатыНачала(Форма.ДатаСравнения, Форма.Дата);
	Форма.Элементы.ДатаСравненияВыбор.Заголовок = НСтр("ru='Сравнить с: ';ka='შედარება : '")+Представление + НСТР("ka = '-თან'");
	Форма.Элементы.ДатаСравненияВыбор.РасширеннаяПодсказка.Заголовок = Представление;
	
	Форма.Элементы.ПериодВыбор.Заголовок = ВРег(ПредставлениеСтандартногоПериода(Форма.Период));
	Форма.Элементы.ПериодВыбор.РасширеннаяПодсказка.Заголовок = Форма.Элементы.ПериодВыбор.Заголовок;
	
	Представление = ПредставлениеСтандартногоПериода(Форма.ПериодСравнения, Форма.Период);
	Форма.Элементы.ПериодСравненияВыбор.Заголовок = НСтр("ru='Сравнить с: ';ka='შედარება : '")+Представление + НСТР("ka = '-თან'");
	Форма.Элементы.ПериодСравненияВыбор.РасширеннаяПодсказка.Заголовок = Представление;	
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ОбновитьЧастично(Секция, СохраняемыеПериоды = "")
	
	Если ПустаяСтрока(Секция) Тогда
		Возврат;
	КонецЕсли; 
	Если Секция="Остатки" Тогда
		Элементы.ГруппаПоказателиОстатки.Доступность = Ложь;
	ИначеЕсли Секция="Обороты" Тогда
		Элементы.ГруппаПоказателиОбороты.Доступность = Ложь;
	КонецЕсли; 
	ЗапуститьФоновоеЗаданиеНаСервере(Секция, СохраняемыеПериоды);
	НачатьОжиданиеЗавершенияФоновогоЗаданияНаКлиенте();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФорму()
	
	УдалитьЭлементыРекурсивно(Элементы.ГруппаПоказателиОстатки);
	УдалитьЭлементыРекурсивно(Элементы.ГруппаПоказателиОбороты);
	ДобавленныеПоказатели.Очистить();
	УдалитьЭлементыРекурсивно(Элементы.ГруппаДобавленныеДиаграммы);
	ДобавленныеДиаграммы.Очистить();
	ЗагрузитьНастройки();
	СоздатьЭлементыПоказатели();
	СоздатьЭлементыДиаграммы();
	ЗапуститьФоновоеЗаданиеНаСервере();
	
КонецПроцедуры
 
&НаСервере
Процедура ОбновитьДанные()
	
	ОбновитьЗначенияПоказателей();
	ОбновитьЗначенияДиаграмм();
	
КонецПроцедуры

&НаСервере
Процедура Инициализация()
	
	// Заполнение таблицы показателей

	// Продажи
	ДобавитьПоказатель("Продажи", "Выручка", НСтр("ka='გაყიდვები';ru='Продажи';en='the sale'"), НСтр("ka='შემოსავალი';ru='Выручка';en='revenue'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_Продажи", "Отчет.Продажи", "Основной", "Сумма");
	ДобавитьПоказатель("Продажи", "Количество", НСтр("ka='გაყიდვები';ru='Продажи';en='the sale'"), НСтр("ka='გაყიდული საქონლის რაოდ-ბა';ru='Кол-во проданных товаров';en='Quantity of goods sold'"),,, "ЧН=-", "СКД_РН_Продажи", "Отчет.Продажи", "Основной", "Количество");
	ДобавитьПоказатель("Продажи", "КоличествоДокументов", НСтр("ka='გაყიდვები';ru='Продажи';en='the sale'"), НСтр("ka='გაყიდვების რაოდენობა (დოკუმენტების)';ru='Кол-во продаж (документов)';en='Bestselling (documents)'"),,, "ЧДЦ=; ЧН=-", "СКД_РН_Продажи", "Отчет.Продажи", "ВаловаяПрибыльПоМенеджерам", "КоличествоДокументов");
	ДобавитьПоказатель("Продажи", "Себестоимость", НСтр("ka='გაყიდვები';ru='Продажи';en='the sale'"), НСтр("ka='თვითღირებულება';ru='Себестоимость';en='Cost price'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_Продажи", "Отчет.Продажи", "ВаловаяПрибыль", "Себестоимость");
	ДобавитьПоказатель("Продажи", "Прибыль", НСтр("ka='გაყიდვები';ru='Продажи';en='the sale'"), НСтр("ka='მოგება';ru='Прибыль';en='Profit'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_Продажи", "Отчет.Продажи", "ВаловаяПрибыль", "ВаловаяПрибыль");
	ДобавитьПоказатель("Продажи", "Наценка", НСтр("ka='გაყიდვები';ru='Продажи';en='the sale'"), НСтр("ka='მოგება';ru='Прибыль/с-сть';en='Profit / s-st'"),,, "ЧН=-", "СКД_РН_Продажи", "Отчет.Продажи", "ВаловаяПрибыль", "Наценка");
	ДобавитьПоказатель("Продажи", "Рентабельность", НСтр("ka='გაყიდვები';ru='Продажи';en='the sale'"), НСтр("ka='მოგება/ამონაგები';ru='Прибыль/выручка';en='Profit / Revenues'"),,, "ЧН=-", "СКД_РН_Продажи", "Отчет.Продажи", "ВаловаяПрибыль", "Рентабельность");
	ДобавитьПоказатель("Продажи", "ВозвратыСумма", НСтр("ka='გაყიდვები';ru='Продажи';en='the sale'"), НСтр("ka='დაბრინებების თანხა';ru='Сумма возвратов';en='repayment of a sum'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_Продажи", "Отчет.Продажи", "Возвраты", "Сумма");
	ДобавитьПоказатель("Продажи", "ВозвратыКоличество", НСтр("ka='გაყიდვები';ru='Продажи';en='the sale'"), НСтр("ka='დაბრუნების რაოდ-ბა';ru='Кол-во возвратов';en='Number of refunds'"),,, "ЧН=-", "СКД_РН_Продажи", "Отчет.Продажи", "Возвраты", "Количество");
	
	// Розница
	ДобавитьПоказатель("Розница", "РозничныеПродажи", НСтр("ka='საცალო';ru='Розница';en='Retail'"), НСтр("ka='საცალო გაყიდვები';ru='Розничные продажи';en='Retail sales'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_Продажи", "Отчет.РозничныеПродажи", "РозничныеПродажиКонтекст", "Сумма");
	ДобавитьПоказатель("Розница", "КоличествоЧеков", НСтр("ka='საცალო';ru='Розница';en='Retail'"), НСтр("ka='ჩეკების რაოდენობა';ru='Количество чеков';en='Number of tickets'"),,, "ЧН=-", "СКД_Розница", "Отчет.РозничныеПродажи", "РозничныеПродажиПоТочкамКонтекст", "КоличествоЧеков");
	ДобавитьПоказатель("Розница", "СреднийЧек", НСтр("ka='საცალო';ru='Розница';en='Retail'"), НСтр("ka='საშუალო ჩეკი';ru='Средний чек';en='average check'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_Розница", "Отчет.РозничныеПродажи", "РозничныеПродажиПоТочкамКонтекст", "СреднийЧек");
	ДобавитьПоказатель("Розница", "ПолученоНаличными", НСтр("ka='საცალო';ru='Розница';en='Retail'"), НСтр("ka='მიღებულია ნაღდი ფულით';ru='Получено наличными';en='cashed'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_Розница", "Отчет.РозничныеПродажи", "РозничныеПродажиПоТочкамКонтекст", "ПолученоНаличными");
	ДобавитьПоказатель("Розница", "ПолученоКартами", НСтр("ka='საცალო';ru='Розница';en='Retail'"), НСтр("ka='ბარათებით მიღებული';ru='Получено картами';en='Get a map'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_Розница", "Отчет.РозничныеПродажи", "РозничныеПродажиПоТочкамКонтекст", "ПолученоКартами");
	ДобавитьПоказатель("Розница", "СуммаОстаток", НСтр("ka='საცალო';ru='Розница';en='Retail'"), НСтр("ka='ნაშთები სსა სალაროებში';ru='Остаток в кассах ККМ';en='Balance at the box office cash register'"), Истина, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_ДенежныеСредстваВКассахККМ", "Отчет.ДенежныеСредстваВКассахККМ", "Остатки", "СуммаКонечныйОстаток");

	// Товары
	ДобавитьПоказатель("Товары", "КоличествоОстаток", НСтр("ka='საქონელი';ru='Товары';en='Products'"), НСтр("ka='ნაშთი (რაოდენობა)';ru='Остаток (кол-во)';en='The residue (quantity)'"), Истина,, "ЧН=-", "СКД_РН_Запасы", "Отчет.Запасы", "Остатки",, "Запасы");
	ДобавитьПоказатель("Товары", "СуммаОстаток", НСтр("ka='საქონელი';ru='Товары';en='Products'"), НСтр("ka='ნაშთი (თანხა)';ru='Остаток (сумма)';en='The residue (amount)'"), Истина, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_Запасы", "Отчет.Запасы", "Остатки",, "Запасы");
	ДобавитьПоказатель("Товары", "КоличествоПриход", НСтр("ka='საქონელი';ru='Товары';en='Products'"), НСтр("ka='შემოსავალი (რაოდენობა)';ru='Приход (кол-во)';en='Parish (number)'"),,, "ЧН=-", "СКД_РН_Запасы", "Отчет.Запасы", "Ведомость");
	ДобавитьПоказатель("Товары", "СуммаПриход", НСтр("ka='საქონელი';ru='Товары';en='Products'"), НСтр("ka='შემოსავალი (თანხა)';ru='Приход (сумма)';en='Parish (amount)'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_Запасы", "Отчет.Запасы", "Ведомость");
	ДобавитьПоказатель("Товары", "КоличествоРасход", НСтр("ka='საქონელი';ru='Товары';en='Products'"), НСтр("ka='გასავალი (რაოდენობა)';ru='Расход (кол-во)';en='Flow rate (quantity)'"),,, "ЧН=-", "СКД_РН_Запасы", "Отчет.Запасы", "Ведомость");
	ДобавитьПоказатель("Товары", "СуммаРасход", НСтр("ka='საქონელი';ru='Товары';en='Products'"), НСтр("ka='გასავალი (თანხა)';ru='Расход (сумма)';en='Consumption (total)'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_Запасы", "Отчет.Запасы", "Ведомость");

	// Деньги
	ДобавитьПоказатель("Деньги", "СуммаОстаток", НСтр("ka='ფული';ru='Деньги';en='Money'"), НСтр("ka='თანხის ნაშთი';ru='Остаток денег';en='The rest of money'"), Истина, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_ДенежныеСредства", "Отчет.ДенежныеСредства", "Остатки",, "Деньги");
	ДобавитьПоказатель("Деньги", "ДенежныйПоток", НСтр("ka='ფული';ru='Деньги';en='Money'"), НСтр("ka='სუფთა ფულადი ნაკადი';ru='Чистый денежный поток';en='Net cash flow'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_ДенежныеСредства", "Отчет.ДенежныеСредства", "Ведомость");
	ДобавитьПоказатель("Деньги", "Поступления", НСтр("ka='ფული';ru='Деньги';en='Money'"), НСтр("ka='შემოსვლები';ru='Поступления';en='receipts'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_ДенежныеСредства", "Отчет.ДенежныеСредства", "Ведомость");
	ДобавитьПоказатель("Деньги", "Платежи", НСтр("ka='ფული';ru='Деньги';en='Money'"), НСтр("ka='გადახდები';ru='Платежи';en='payments'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_ДенежныеСредства", "Отчет.ДенежныеСредства", "Ведомость");
	ДобавитьПоказатель("Деньги", "ПоступленияПлан", НСтр("ka='ფული';ru='Деньги';en='Money'"), НСтр("ka='შემოსვლა (გეგმა)';ru='Поступления (план)';en='Proceeds (plan)'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_ПлатежныйКалендарь", "Отчет.ПлановыеДвиженияДенежныхСредств", "Ведомость", "Поступления");
	ДобавитьПоказатель("Деньги", "ПлатежиПлан", НСтр("ka='ფული';ru='Деньги';en='Money'"), НСтр("ka='გადახდები (გეგმა)';ru='Платежи (план)';en='Payments (plan)'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_ПлатежныйКалендарь", "Отчет.ПлановыеДвиженияДенежныхСредств", "Ведомость", "Платежи");

	// Счета-заказы
	ДобавитьПоказатель("СчетаЗаказы", "СуммаСчетов", НСтр("ka='ანგარიშები - შეკვეთები';ru='Счета - заказы';en='Account - Orders'"), НСтр("ka='წარმოდგენილია ანგარიშები თანხით';ru='Выставлено счетов на сумму';en='invoiced the sum of'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "СчетаНаОплатуКонтекст", "Сумма");
	ДобавитьПоказатель("СчетаЗаказы", "КоличествоСчетов", НСтр("ka='ანგარიშები - შეკვეთები';ru='Счета - заказы';en='Account - Orders'"), НСтр("ka='წარმოდგენილია ანგარიშები (ცალი)';ru='Выставлено счетов (штук)';en='Billed (pieces)'"),,, "ЧДЦ=; ЧН=-", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "СчетаНаОплатуКонтекст", "КоличествоДокументов");
	ДобавитьПоказатель("СчетаЗаказы", "СуммаЗаказов", НСтр("ka='ანგარიშები - შეკვეთები';ru='Счета - заказы';en='Account - Orders'"), НСтр("ka='მიღებულია შეკვეთები თანხით';ru='Получено заказов на сумму';en='Received orders worth'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "ЗаказыПокупателейКонтекст", "Сумма");
	ДобавитьПоказатель("СчетаЗаказы", "КоличествоЗаказов", НСтр("ka='ანგარიშები - შეკვეთები';ru='Счета - заказы';en='Account - Orders'"), НСтр("ka='მიღებულია შეკვეთები (ცალი)';ru='Получено заказов (штук)';en='Received orders (units)'"),,, "ЧДЦ=; ЧН=-", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "ЗаказыПокупателейКонтекст", "КоличествоДокументов");
	ДобавитьПоказатель("СчетаЗаказы", "СуммаЗаказовПоставщику", НСтр("ka='ანგარიშები - შეკვეთები';ru='Счета - заказы';en='Account - Orders'"), НСтр("ka='გაგზავნილია შეკვეთები თანხით';ru='Отправлено заказов на сумму';en='Sent orders to the amount of'"),, Истина, "ЧДЦ=2; ЧН=-", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "ЗаказыПоставщикамКонтекст", "Сумма");
	ДобавитьПоказатель("СчетаЗаказы", "КоличествоЗаказовПоставщику", НСтр("ka='ანგარიშები - შეკვეთები';ru='Счета - заказы';en='Account - Orders'"), НСтр("ka='გაგზავნილია შეკვეთები (ცალი)';ru='Отправлено заказов (штук)';en='Sent orders (units)'"),,, "ЧДЦ=; ЧН=-", "СКД_РН_ОплатаСчетовИЗаказов", "Отчет.АнализСчетовИЗаказовВВалютеУчета", "ЗаказыПоставщикамКонтекст", "КоличествоДокументов");

	// Долги
	ДобавитьПоказатель("Долги", "ДолгиОбщие", НСтр("ka='დავალიანებები';ru='Долги';en='debts'"), НСтр("ka='საერთო დავალიანება';ru='Общий долг';en='overall debt'"), Истина, Истина, "ЧДЦ=2; ЧН=-", "СКД_Расчеты", "Отчет.Взаиморасчеты", "Остатки",, "Покупатели");
	ДобавитьПоказатель("Долги", "ДолгиНам", НСтр("ka='დავალიანებები';ru='Долги';en='debts'"), НСтр("ka='ვალები ჩვენ';ru='Долги нам';en='debts us'"), Истина, Истина, "ЧДЦ=2; ЧН=-", "СКД_Расчеты", "Отчет.Взаиморасчеты", "Остатки",, "Покупатели");
	ДобавитьПоказатель("Долги", "ДолгиНаши", НСтр("ka='დავალიანებები';ru='Долги';en='debts'"), НСтр("ka='ჩვენი ვალები';ru='Долги наши';en='our debts'"), Истина, Истина, "ЧДЦ=2; ЧН=-", "СКД_Расчеты", "Отчет.Взаиморасчеты", "Остатки",, "Поставщики");

	// Фин. анализ
	ДобавитьПоказатель("ФинАнализ", "ЧистыеАктивы", НСтр("ka='ფინანსური ანალიზი';ru='Фин. анализ';en='Fin. analysis'"), НСтр("ka='სუფთა აქტივები';ru='Чистые активы';en='net assets'"), Истина, Истина, "ЧДЦ=2; ЧН=-", "СКД_РБ_Управленческий", "Отчет.ЧистыеАктивы", "ЧистыеАктивы");

	НастройкиПоказателей.Сортировать("Представление,ПредставлениеРесурса");

	// Заполнение таблицы диаграмм
	
	ИспользуютсяОбщиеДопРеквизиты = ПолучитьФункциональнуюОпцию("ИспользоватьОбщиеДополнительныеРеквизитыИСведения");
	НаборыСвойствНоменклатура = НаборыРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура, ИспользуютсяОбщиеДопРеквизиты);
	
	// Диаграмма "Динамика продаж"
	СтруктураСерий = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Сумма", НСтр("ka='გაყიდვების თანხა';ru='Сумма продаж';en='sales amount'"), НСтр("ka='გაყიდვები';ru='Продажи';en='the sale'"), ТипДиаграммы.Гистограмма, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Количество", НСтр("ka='გაყიდული საქონლის რაოდენობა';ru='Количество проданных товаров';en='The number of sold goods'"),, ТипДиаграммы.Гистограмма);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "КоличествоДокументов", НСтр("ka='გაყიდვების რაოდენობა (ჩეკების)';ru='Количество продаж (чеков)';en='The number of sales (receipts)'"),, ТипДиаграммы.Гистограмма);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Прибыль", НСтр("ka='მოგება';ru='Прибыль';en='Profit'"),, ТипДиаграммы.Гистограмма, Истина);
	МассивПредставлений = Новый Массив;
	МассивПредставлений.Добавить(НСтр("ka='თვითღირებულება';ru='Себестоимость';en='Cost price'"));
	МассивПредставлений.Добавить(НСтр("ka='მოგება';ru='Прибыль';en='Profit'"));
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "ПрибыльИСебестоимость", МассивПредставлений, НСтр("ka='თვითღირებულება და მოგება';ru='Себестоимость и прибыль';en='Cost and profit'"), ТипДиаграммы.ГистограммаСНакоплением, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "ВозвратыСумма", НСтр("ka='დაბრუნებები (თანხა)';ru='Возвраты (сумма)';en='Refunds (amount)'"),, ТипДиаграммы.Гистограмма, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "ВозвратыКоличество", НСтр("ka='დაბრუნებები (რაოდენობა)';ru='Возвраты (количество)';en='Return (number)'"),, ТипДиаграммы.Гистограмма);
	СтруктураТочек = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "День", НСтр("ka='დღეები';ru='Дни';en='days'"),,,, "ДЛФ=D");
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Неделя", НСтр("ka='კვირა';ru='Недели';en='of the week'"),,,, "ДЛФ=D");
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Месяц", НСтр("ka='თვეები';ru='Месяцы';en='months'"),,,, "ДФ='МММ гггг'");
	ДобавитьДиаграмму("ДинамикаПродаж", НСтр("ka='გაყიდვების დინამიკა';ru='Динамика продаж';en='sales growth'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_РН_Продажи", "Отчет.Продажи", "Основной");  
	
	// Диаграмма "Структура продаж"
	СтруктураСерий = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "НоменклатураРодитель", НСтр("ka='Группы товаров';ru='Группы товаров';en='groups of goods'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "КатегорияНоменклатуры", НСтр("ka='ნომენკლატურის კატეგორიები';ru='Категории номенклатуры';en='category nomenclature'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Склад", НСтр("ka='საწყობები';ru='Склады';en='warehouses'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Номенклатура", НСтр("ka='საქონელი';ru='Товары';en='Products'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Контрагент", НСтр("ka='მყიდველები';ru='Покупатели';en='Buyers'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Организация", НСтр("ka='ორგანიზაციები';ru='Организации';en='organizations'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Подразделение", НСтр("ka='ქვეგანყოფილებები';ru='Подразделения';en='unit'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Ответственный", НСтр("ka='მენეჯერები';ru='Менеджеры';en='Managers'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Валюта", НСтр("ka='ვალუტა';ru='Валюта';en='Currency'"),, ТипДиаграммы.Круговая);
	СтруктураОтбора = Новый Соответствие;
	СтруктураОтбора.Вставить("Отбор.НаборСвойств", НаборыСвойствНоменклатура);
	СтруктураОтбора.Вставить("НаборСвойств", Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура_Общие);
	СтруктураОтбора.Вставить("ТекущийНаборСвойств", Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура_Общие);
	СтруктураОтбора.Вставить("ЭтоДополнительноеСведение", Ложь);
	СтруктураОтбора.Вставить("ТолькоПросмотр", Истина);
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("СвойствоНоменклатуры", СтруктураОтбора);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "СвойствоНоменклатуры", НСтр("ka='ნომენკლატურის დამატებითი რეკვიზიტები';ru='Доп. реквизиты номенклатуры';en='Extras. nomenclature details'"),, ТипДиаграммы.Круговая,,,, СтруктураНастроек);
	СтруктураОтбора = Новый Соответствие;
	СтруктураОтбора.Вставить("Отбор.НаборСвойств", Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Контрагенты);
	СтруктураОтбора.Вставить("НаборСвойств", Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Контрагенты);
	СтруктураОтбора.Вставить("ТекущийНаборСвойств", Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Контрагенты);
	СтруктураОтбора.Вставить("ЭтоДополнительноеСведение", Ложь);
	СтруктураОтбора.Вставить("ТолькоПросмотр", Истина);
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("СвойствоПокупателя", СтруктураОтбора);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "СвойствоПокупателя", НСтр("ka='მყიდველების დამატებითი რეკვიზიტები';ru='Доп. реквизиты покупателей';en='Extras. customer details'"),, ТипДиаграммы.Круговая,,,, СтруктураНастроек);
	СтруктураТочек = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Сумма", НСтр("ka='გაყიდვების თანხა';ru='Сумма продаж';en='sales amount'"), НСтр("ka='გაყიდვები';ru='Продажи';en='the sale'"),, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Количество", НСтр("ka='გაყიდული საქონლის რაოდენობა';ru='Количество проданных товаров';en='The number of sold goods'"));
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "КоличествоДокументов", НСтр("ka='გაყიდვების რაოდენობა (ჩეკების)';ru='Количество продаж (чеков)';en='The number of sales (receipts)'"));
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Прибыль", НСтр("ka='მოგება';ru='Прибыль';en='Profit'"),,, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "ВозвратыСумма", НСтр("ka='დაბრუნებები (თანხა)';ru='Возвраты (сумма)';en='Refunds (amount)'"),,, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "ВозвратыКоличество", НСтр("ka='დაბრუნებები (რაოდენობა)';ru='Возвраты (количество)';en='Return (number)'"));
	ДобавитьДиаграмму("СтруктураПродаж", НСтр("ka='გაყიდვების სტრუქტურა';ru='Структура продаж';en='sales pattern'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_РН_Продажи", "Отчет.Продажи", "Основной");  
	
	// Диаграмма "Структура розничных продаж"
	СтруктураСерий = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "НоменклатураРодитель", НСтр("ka='საქონლის ჯგუფები';ru='Группы товаров';en='groups of goods'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "КатегорияНоменклатуры", НСтр("ka='ნომენკლატურის კატეგორიები';ru='Категории номенклатуры';en='category nomenclature'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Склад", НСтр("ka='საწყობები';ru='Склады';en='warehouses'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Номенклатура", НСтр("ka='საქონელი';ru='Товары';en='Products'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Организация", НСтр("ka='ორგანიზაციები';ru='Организации';en='organizations'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Подразделение", НСтр("ka='ქვეგანყოფილებები';ru='Подразделения';en='unit'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "КассаККМ", НСтр("ka='სალარო საკონტროლო-საკასო აპარატი';ru='Касса ККМ';en='Cashier CMC'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Ответственный", НСтр("ka='მენეჯერები';ru='Менеджеры';en='Managers'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Валюта", НСтр("ka='ვალუტა';ru='Валюта';en='Currency'"),, ТипДиаграммы.Круговая);
	СтруктураОтбора = Новый Соответствие;
	СтруктураОтбора.Вставить("Отбор.НаборСвойств", НаборыСвойствНоменклатура);
	СтруктураОтбора.Вставить("НаборСвойств", Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура_Общие);
	СтруктураОтбора.Вставить("ТекущийНаборСвойств", Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура_Общие);
	СтруктураОтбора.Вставить("ЭтоДополнительноеСведение", Ложь);
	СтруктураОтбора.Вставить("ТолькоПросмотр", Истина);
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("СвойствоНоменклатуры", СтруктураОтбора);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "СвойствоНоменклатуры", НСтр("ka='ნომენკლატურის დამატებითი რეკვიზიტები';ru='Доп. реквизиты номенклатуры';en='Extras. nomenclature details'"),, ТипДиаграммы.Круговая,,,, СтруктураНастроек);
	СтруктураТочек = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Сумма", НСтр("ka='გაყიდვების თანხა';ru='Сумма продаж';en='sales amount'"), НСтр("ka='გაყიდვები';ru='Продажи';en='the sale'"),, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Количество", НСтр("ka='გაყიდული საქონლის რაოდენობა';ru='Количество проданных товаров';en='The number of sold goods'"));
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "КоличествоДокументов", НСтр("ka='გაყიდვების რაოდენობა (ჩეკების)';ru='Количество продаж (чеков)';en='The number of sales (receipts)'"));
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Прибыль", НСтр("ka='მოგება';ru='Прибыль';en='Profit'"),,, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "ВозвратыСумма", НСтр("ka='დაბრუნებები (თანხა)';ru='Возвраты (сумма)';en='Refunds (amount)'"),,, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "ВозвратыКоличество", НСтр("ka='დაბრუნებები (რაოდენობა)';ru='Возвраты (количество)';en='Return (number)'"));
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "КоличествоЧеков", НСтр("ka='ჩეკების რაოდენობა';ru='Количество чеков';en='Number of tickets'"));
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "СреднийЧек", НСтр("ka='საშუალო ჩეკი';ru='Средний чек';en='average check'"));
	ДобавитьДиаграмму("СтруктураРозничныхПродаж", НСтр("ka='საცალო გაყიდვების სტრუქტურა';ru='Структура розничных продаж';en='Structure of retail sales'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_Розница", "Отчет.РозничныеПродажи", "РозничныеПродажиКонтекст");  
	
	// Диаграмма "Динамика денег"
	СтруктураСерий = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "СуммаОстаток", НСтр("ka='ნაშთი';ru='Остаток';en='the balance'"), НСтр("ka='ფულის ნაშთი';ru='Остаток денег';en='The rest of money'"), ТипДиаграммы.Гистограмма, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "СуммаПриход", НСтр("ka='შემოსვლები';ru='Поступления';en='receipts'"), НСтр("ka='თანხის შემოსვლა';ru='Поступления денег';en='receipt of money'"), ТипДиаграммы.Гистограмма, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "СуммаРасход", НСтр("ka='Списания';ru='Списания';en='write-off'"), НСтр("ka='ფულის ჩამოწერა';ru='Списания денег';en='debiting'"), ТипДиаграммы.Гистограмма, Истина);
	СтруктураТочек = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "День", НСтр("ka='დღეები';ru='Дни';en='days'"),,,, "ДЛФ=D");
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Неделя", НСтр("ka='კვირა';ru='Недели';en='of the week'"),,,, "ДЛФ=D");
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Месяц", НСтр("ka='თვეები';ru='Месяцы';en='months'"),,,, "ДФ='МММ гггг'");
	ДобавитьДиаграмму("ДинамикаДенег", НСтр("ka='ფული (დინამიკა)';ru='Деньги (динамика)';en='Money (dynamics)'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_РН_ДенежныеСредства", "Отчет.ДенежныеСредства", "Ведомость");  
	
	// Диаграмма "Структура денег"
	СтруктураСерий = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "БанковскийСчетКасса", НСтр("ka='საბანკო ანგარიში / სალარო';ru='Банковский счет / касса';en='Bank account / cash register'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Валюта", НСтр("ka='ვალუტა';ru='Валюта';en='Currency'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Организация", НСтр("ka='ორგანიზაცია';ru='Организация';en='Organization'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "ТипДенежныхСредств", НСтр("ka='ფულადი სახსრების ტიპი';ru='Тип денежных средств';en='Type of funds'"),, ТипДиаграммы.Круговая);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "ХозяйственнаяОперация", НСтр("ka='ბუღ. ოპერაცია';ru='Хоз. операция';en='Households. operation'"),, ТипДиаграммы.Круговая,,, "СуммаПриход,СуммаРасход");
	СтруктураОтбора = Новый Соответствие;
	МассивХозОпераций = ХозоперацииДС();
	СтруктураОтбора.Вставить("Отбор.Ссылка", МассивХозОпераций);
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ХозяйственнаяОперация", СтруктураОтбора);
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Аналитика", НСтр("ka='ანალიტიკა';ru='Аналитика';en='Analytics'"),, ТипДиаграммы.Круговая,,, "СуммаПриход,СуммаРасход", СтруктураНастроек);
	СтруктураТочек = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "СуммаОстаток", НСтр("ka='ნაშთი';ru='Остаток';en='the balance'"), НСтр("ka='Остаток денег';ru='ფულის ნაშთი'"),, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "СуммаПриход", НСтр("ka='შემოსვლები';ru='Поступления';en='receipts'"), НСтр("ka='ფულის შემოსვლა';ru='Поступления денег';en='receipt of money'"),, Истина);
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "СуммаРасход", НСтр("ka='ჩამოწერა';ru='Списания';en='write-off'"), НСтр("ka='ფულის ჩამოწერა';ru='Списания денег';en='debiting'"),, Истина);
	ДобавитьДиаграмму("СтруктураДенег", НСтр("ka='ფულის სტრუქტურა';ru='Структура денег';en='structure of money'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_РН_ДенежныеСредстваДвижения", "Отчет.ДенежныеСредства", "Ведомость");  
	
	// Диаграмма "Динамика активов"
	СтруктураСерий = Новый Структура;
	МассивПредставлений = Новый Массив;
	МассивПредставлений.Добавить(НСтр("ka='ვალები ჩვენ';ru='Долги нам';en='debts us'"));
	МассивПредставлений.Добавить(НСтр("ka='ჩვენი ვალი';ru='Наши долги';en='our debts'"));
	МассивПредставлений.Добавить(НСтр("ka='ფული';ru='Деньги';en='Money'"));
	МассивПредставлений.Добавить(НСтр("ka='საქონელი';ru='Товары';en='Products'"));
	МассивПредставлений.Добавить(НСтр("ka='ქონება';ru='Имущество';en='Propety'"));
	ДобавитьОписаниеСерииТочки(СтруктураСерий, "Сумма", МассивПредставлений, НСтр("ka='სუფთა აქტივები';ru='Чистые активы';en='net assets'"), ТипДиаграммы.ГрафикСОбластямиИНакоплением, Истина);
	СтруктураТочек = Новый Структура;
	ДобавитьОписаниеСерииТочки(СтруктураТочек, "Время", НСтр("ka='დრო';ru='Время';en='Time'"),,,, "ДЛФ=D");
	ДобавитьДиаграмму("ДинамикаАктивов", НСтр("ka='წმინდა აქტივები (დინამიკა)';ru='Чистые активы (динамика)';en='Net assets (dynamics)'"), СтруктураСерий, СтруктураТочек, Ложь, "СКД_РБ_Управленческий", "Отчет.ЧистыеАктивы", "ЧистыеАктивы", Истина);  

	НастройкиДиаграмм.Сортировать("Представление");

	// Прочие операции инициализации
	
	СимволРеглВалюты = УправлениеНебольшойФирмойПовтИсп.ПолучитьСимвольноеПредставлениеВалюты(
	УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета());
	
	ОпределитьРежимыВводаОстатков();
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьРежимыВводаОстатков()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДенежныеСредства.Регистратор
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	|ГДЕ
	|	НЕ ДенежныеСредства.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗапасыНаСкладах.Регистратор
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах КАК ЗапасыНаСкладах
	|ГДЕ
	|	НЕ ЗапасыНаСкладах.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасчетыСПокупателями.Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПокупателями КАК РасчетыСПокупателями
	|ГДЕ
	|	НЕ РасчетыСПокупателями.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасчетыСПоставщиками.Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|ГДЕ
	|	НЕ РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков";
	Результат = Запрос.ВыполнитьПакет();
	Режимы = Новый Структура;
	Режимы.Вставить("Деньги", Результат.Получить(0).Пустой());
	Режимы.Вставить("Запасы", Результат.Получить(1).Пустой());
	Режимы.Вставить("Покупатели", Результат.Получить(2).Пустой());
	Режимы.Вставить("Поставщики", Результат.Получить(3).Пустой());
	РежимыВводаОстатков = Новый ФиксированнаяСтруктура(Режимы);
	
	ЕстьВводыОстатков = Ложь;
	Для каждого Режим Из РежимыВводаОстатков Цикл
		Если НЕ Режим.Значение Тогда
			ЕстьВводыОстатков = Истина;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиПериоды(СохраняемыеПериоды)
	
	Имена = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СохраняемыеПериоды);
	Для каждого Имя Из Имена Цикл
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПульсБизнеса", Имя, ЭтаФорма[Имя]);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки(ВидНастроек = "")

	Если ПустаяСтрока(ВидНастроек) ИЛИ ВидНастроек="Показатели" Тогда
		Таб = ДобавленныеПоказатели.Выгрузить(, "Показатель,Ресурс,Представление,Фильтры,Настройки");
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПульсБизнеса", "Показатели", Таб);
	КонецЕсли;
	Если ПустаяСтрока(ВидНастроек) ИЛИ ВидНастроек="Диаграммы" Тогда
		Таб = ДобавленныеДиаграммы.Выгрузить(, "Диаграмма,Серия,Точка,Представление,Период,ПериодСравнения,Фильтры,Настройки");
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПульсБизнеса", "Диаграммы", Таб);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиПериоды()
	
	Дата = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоСледующегоДня);
	
	ТекДатаСравнения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "ДатаСравнения");
	Если ТипЗнч(ТекДатаСравнения)<>Тип("СтандартнаяДатаНачала") И ТипЗнч(ТекДатаСравнения)<>Тип("Структура") И ТекДатаСравнения<>Неопределено Тогда
		ТекДатаСравнения = Неопределено;
	КонецЕсли;
	ДатаСравнения = ТекДатаСравнения;
	
	ТекТипДатыСравнения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "ТипДатыСравнения");
	Если ТипЗнч(ТекТипДатыСравнения)<>Тип("Строка") Тогда
		ТекТипДатыСравнения = ТипДаты(ДатаСравнения);
	КонецЕсли; 
	ТипДатыСравнения = ТекТипДатыСравнения;
	
	ТекПериод = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "Период");
	Если ТипЗнч(ТекПериод)<>Тип("СтандартныйПериод") И ТипЗнч(ТекПериод)<>Тип("Структура") Тогда
		ТекПериод = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц);
	КонецЕсли; 
	Период = ТекПериод;
	
	ТекТипПериода = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "ТипПериода");
	Если ТипЗнч(ТекТипПериода)<>Тип("Строка") Тогда
		ТекТипПериода = ТипПериода(Период);
	КонецЕсли; 
	ТипПериода = ТекТипПериода;
	
	ТекПериодСравнения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "ПериодСравнения");
	Если ТипЗнч(ТекПериодСравнения)<>Тип("СтандартныйПериод") И ТипЗнч(ТекПериодСравнения)<>Тип("Структура") И ТекПериодСравнения<>Неопределено Тогда
		ТекПериодСравнения = Неопределено;
	КонецЕсли; 
	ПериодСравнения = ТекПериодСравнения;
	
	ТекТипПериодаСравнения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "ТипПериодаСравнения");
	Если ТипЗнч(ТекТипПериодаСравнения)<>Тип("Строка") Тогда
		ТекТипПериодаСравнения = ТипПериода(ПериодСравнения);
	КонецЕсли; 
	ТипПериодаСравнения = ТекТипПериодаСравнения;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройки()
	
	ТаблицаПоказателей = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "Показатели");
	ТаблицаДиаграмм = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПульсБизнеса", "Диаграммы");
	
	Если ТаблицаПоказателей=Неопределено Тогда
		ПоказателиПоУмолчанию();
	Иначе
		ДобавленныеПоказатели.Очистить();
		Для каждого Стр Из ТаблицаПоказателей Цикл
			Если НЕ ПустаяСтрока(Стр.Ресурс) Тогда
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Показатель", Стр.Показатель);
				СтруктураОтбора.Вставить("Ресурс", Стр.Ресурс);
				Строки = НастройкиПоказателей.НайтиСтроки(СтруктураОтбора);
				Если Строки.Количество()=0 Тогда
					// Устаревший показатель
					Продолжить;
				КонецЕсли; 
			КонецЕсли; 
			НоваяСтрока = ДобавленныеПоказатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			Если НЕ ПустаяСтрока(Стр.Ресурс) Тогда
				СтрНастроек = Строки[0];
				НоваяСтрока.ИдентификаторСтрокиНастроек = СтрНастроек.ПолучитьИдентификатор();
				НоваяСтрока.Остаток = СтрНастроек.Остаток;
				Если НЕ ПустаяСтрока(СтрНастроек.РазделУчета) Тогда
					НоваяСтрока.ВводОстатков = РежимыВводаОстатков[СтрНастроек.РазделУчета];
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
	
	Если ТаблицаДиаграмм=Неопределено Тогда
		ДиаграммыПоУмолчанию();
	Иначе
		ДобавленныеДиаграммы.Очистить();
		Для каждого Стр Из ТаблицаДиаграмм Цикл
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Диаграмма", ?(ТаблицаДиаграмм.Колонки.Найти("Показатель")=Неопределено, Стр.Диаграмма, Стр.Показатель));
			Строки = НастройкиДиаграмм.НайтиСтроки(СтруктураОтбора);
			Если Строки.Количество()=0 Тогда
				// Устаревшая диаграмма
				Продолжить;
			КонецЕсли;
			СтрокаНастройки = Строки[0];
			Если НЕ СтрокаНастройки.Серии.Свойство(Стр.Серия) ИЛИ НЕ СтрокаНастройки.Точки.Свойство(Стр.Точка) Тогда
				// Устаревшая диаграмма
				Продолжить;
			КонецЕсли; 
			НоваяСтрока = ДобавленныеДиаграммы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			Если НЕ ТаблицаДиаграмм.Колонки.Найти("Показатель")=Неопределено Тогда
				НоваяСтрока.Диаграмма = Стр.Показатель;
			КонецЕсли; 
			НоваяСтрока.ИдентификаторСтрокиНастроек = Строки[0].ПолучитьИдентификатор();
			Если ЗначениеЗаполнено(НоваяСтрока.ПериодСравнения) И ТипЗнч(НоваяСтрока.ПериодСравнения)=Тип("СтандартныйПериод") Тогда
				МассивПредставлений = Новый Массив;
				МассивПредставлений.Добавить(ПредставлениеСтандартногоПериода(НоваяСтрока.Период));
				МассивПредставлений.Добавить(ПредставлениеСтандартногоПериода(НоваяСтрока.ПериодСравнения, НоваяСтрока.Период));
				НоваяСтрока.ПредставленияСерий = Новый ФиксированныйМассив(МассивПредставлений);
			ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.ПериодСравнения) И ТипЗнч(НоваяСтрока.ПериодСравнения)=Тип("СтандартнаяДатаНачала") Тогда
				МассивПредставлений = Новый Массив;
				МассивПредставлений.Добавить(ПредставлениеСтандартнойДатыНачала(НоваяСтрока.Период));
				МассивПредставлений.Добавить(ПредставлениеСтандартнойДатыНачала(НоваяСтрока.ПериодСравнения, НоваяСтрока.Период));
				НоваяСтрока.ПредставленияСерий = Новый ФиксированныйМассив(МассивПредставлений);
			ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.ПериодСравнения) И ТипЗнч(НоваяСтрока.ПериодСравнения)=Тип("Структура") Тогда
				МассивПредставлений = Новый Массив;
				Если НоваяСтрока.ПериодСравнения.Вариант="ТакойЖеДеньНаПрошлойНеделе" 
					ИЛИ НоваяСтрока.ПериодСравнения.Вариант="ТакойЖеДеньВПрошломМесяце" 
					ИЛИ НоваяСтрока.ПериодСравнения.Вариант="ТакойЖеДеньВПрошломГоду" Тогда
					МассивПредставлений.Добавить(ПредставлениеСтандартнойДатыНачала(НоваяСтрока.Период));
					МассивПредставлений.Добавить(ПредставлениеСтандартнойДатыНачала(НоваяСтрока.ПериодСравнения, НоваяСтрока.Период));
				Иначе
					МассивПредставлений.Добавить(ПредставлениеСтандартногоПериода(НоваяСтрока.Период));
					МассивПредставлений.Добавить(ПредставлениеСтандартногоПериода(НоваяСтрока.ПериодСравнения, НоваяСтрока.Период));
				КонецЕсли; 
				НоваяСтрока.ПредставленияСерий = Новый ФиксированныйМассив(МассивПредставлений);
			Иначе
				НоваяСтрока.ПредставленияСерий = СтрокаНастройки.Серии[Стр.Серия].Представления;
			КонецЕсли; 
			НоваяСтрока.ПредставленияТочек = СтрокаНастройки.Точки[Стр.Точка].Представления;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказателиПоУмолчанию()
	
	Если ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж") Тогда
		
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня);
		ПериодСравнения = Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
		ДатаСравнения = Неопределено;
		ОбновитьПредставленияПериодов(ЭтаФорма);
		
		ДобавленныеПоказатели.Очистить();
		ОтобразитьПоказатель("Деньги", "СуммаОстаток");
		ОтобразитьПоказатель("Розница", "СуммаОстаток", НСтр("ka='სსა სალაროებში';ru='В кассах ККМ';en='At the box office cash register'"));
		ОтобразитьПоказатель("Долги", "ДолгиНам");
		ОтобразитьПоказатель("Долги", "ДолгиНаши");
		ОтобразитьПоказатель("Розница", "РозничныеПродажи");
		ОтобразитьПоказатель("Розница", "КоличествоЧеков"); 
		ОтобразитьПоказатель("Розница", "СреднийЧек"); 
		ОтобразитьПоказатель("Розница", "ПолученоНаличными"); 
		ОтобразитьПоказатель("Розница", "ПолученоКартами"); 
		ОтобразитьПоказатель("Деньги", "Платежи", НСтр("ka='დახარჯული ფული';ru='Потрачено денег';en='wasted money'")); 
		
	Иначе
		
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.СНачалаЭтогоГода);
		ПериодСравнения = Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйГодДоТакойЖеДаты);
		ДатаСравнения = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтойНедели);
		ОбновитьПредставленияПериодов(ЭтаФорма);
		
		ДобавленныеПоказатели.Очистить();
		ОтобразитьПоказатель("Деньги", "СуммаОстаток");
		ОтобразитьПоказатель("Товары", "СуммаОстаток", НСтр("ka='საქონელი';ru='Товары';en='Products'"));
		ОтобразитьПоказатель("Долги", "ДолгиНам");
		ОтобразитьПоказатель("Долги", "ДолгиНаши");
		ОтобразитьПоказатель("ФинАнализ", "ЧистыеАктивы", НСтр("ka='სულ წმინდა აქტივები';ru='Итого чистые активы';en='Total net assets'"));
		ОтобразитьПоказатель("Продажи", "Выручка", НСтр("ka='გაყიდვები';ru='Продажи';en='the sale'"));
		ОтобразитьПоказатель("Деньги", "Поступления", НСтр("ka='შემოსვლები';ru='Поступления';en='receipts'"));
		ОтобразитьПоказатель("Деньги", "Платежи", НСтр("ka='გადახდები';ru='Платежи';en='payments'"));
		
	КонецЕсли; 
	
	СохранитьНастройки("Показатели");
	СохранитьНастройкиПериоды("ДатаСравнения,Период,ПериодСравнения");
	
КонецПроцедуры

&НаСервере
Процедура ДиаграммыПоУмолчанию()
	
	Если ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж") Тогда
		
		ПериодДиаграмм = Новый Структура;
		ПериодДиаграмм.Вставить("Вариант", "Последние7ДнейНеСчитаяТекущего");
		
		Структура = СтруктураФильтра("РозничныеПродажи",, ИСТИНА);
		МассивФильтров = Новый Массив;
		МассивФильтров.Добавить(Структура);
		ОтобразитьДиаграмму(
		"ДинамикаПродаж", 
		"ПрибыльИСебестоимость", 
		"День", 
		ПериодДиаграмм,, 
		НСтр("ka='გაყიდვების დინამიკა';ru='Динамика продаж';en='sales growth'"),
		МассивФильтров);
		
		Структура = СтруктураФильтра("ХозяйственнаяОперация",, Справочники.ХозяйственныеОперации.НаРасходы);
		МассивФильтров = Новый Массив;
		МассивФильтров.Добавить(Структура);
		ОтобразитьДиаграмму(
		"СтруктураДенег", 
		"Аналитика", 
		"СуммаРасход", 
		ПериодДиаграмм,, 
		НСтр("ka='ფულის ჩამოწერის სტრუქტურა';ru='Структура списания денег';en='The structure of the write-off of money'"), 
		МассивФильтров);
		
		ОтобразитьДиаграмму(
		"СтруктураРозничныхПродаж", 
		"КатегорияНоменклатуры", 
		"Сумма", 
		ПериодДиаграмм,, 
		НСтр("ka='გაყიდვები კატეგორიების მიხედვით';ru='Продажи по категориям';en='Sales by Category'"));
		
		ОтобразитьДиаграмму(
		"СтруктураРозничныхПродаж", 
		"Склад", 
		"Сумма", 
		ПериодДиаграмм,, 
		НСтр("ka='გაყიდვები წერტილების მიხედვით';ru='Продажи по точкам';en='Sales points'"));
		
		ОтобразитьДиаграмму(
		"СтруктураРозничныхПродаж", 
		"Склад", 
		"СреднийЧек", 
		ПериодДиаграмм,, 
		НСтр("ka='საშუალო ჩეკი წერტილების მიხედვით';ru='Средний чек по точкам';en='The average check for points'"));
		
	Иначе
		
		ПериодДиаграмм = Новый СтандартныйПериод(ВариантСтандартногоПериода.СНачалаЭтогоГода);
		
		ОтобразитьДиаграмму(
		"ДинамикаПродаж", 
		"ПрибыльИСебестоимость", 
		"Месяц", 
		ПериодДиаграмм,, 
		НСтр("ka='გაყიდვების დინამიკა';ru='Динамика продаж';en='sales growth'"));
		
		Структура = СтруктураФильтра("ХозяйственнаяОперация",, Справочники.ХозяйственныеОперации.НаРасходы);
		МассивФильтров = Новый Массив;
		МассивФильтров.Добавить(Структура);
		ОтобразитьДиаграмму(
		"СтруктураДенег", 
		"Аналитика", 
		"СуммаРасход", 
		ПериодДиаграмм,, 
		НСтр("ka='ფულის ჩამოწერის სტრუქტურა';ru='Структура списания денег';en='The structure of the write-off of money'"), 
		МассивФильтров);
		
	КонецЕсли; 
	
	СохранитьНастройки("Диаграммы");
	
КонецПроцедуры

#Область ОбщиеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СтруктураФильтра(Поле, ВидСравнения = Неопределено, Значение = Неопределено)
	
	СтруктураФильтра = Новый Структура;
	СтруктураФильтра.Вставить("Поле", Поле);
	СтруктураФильтра.Вставить("ВидСравнения", ?(ВидСравнения=Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения));
	СтруктураФильтра.Вставить("Значение", Значение);
	Возврат СтруктураФильтра;
	
КонецФункции 

&НаСервере
Функция ДобавитьКоманду(ИмяГруппы, Суффикс, Элемент, Действие, Заголовок, Картинка)
	
	ИмяКоманды = ИмяГруппы+Суффикс;
	Команда = Команды.Найти(ИмяКоманды);
	Если Команда=Неопределено Тогда
		Команда = Команды.Добавить(ИмяКоманды);
		Команда.Действие = Действие;
		Команда.Картинка = Картинка;
		Команда.Заголовок = Заголовок;
	КонецЕсли; 
	Кнопка = Элементы.Добавить(Команда.Имя+СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", ""), Тип("КнопкаФормы"), Элементы[Элемент.Имя+"КонтекстноеМеню"]);
	Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Кнопка.ИмяКоманды = Команда.Имя;
	Кнопка.Картинка = Картинка;
	Кнопка.Заголовок = Заголовок;
	Возврат Кнопка;
	
КонецФункции
 
&НаСервере
Функция ОтформатироватьЗначение(Значение, Стр)
	
	Если ТипЗнч(Значение)=Тип("ФорматированнаяСтрока") Тогда
		Возврат Значение;
	КонецЕсли; 
	Если ТипЗнч(Значение)=Тип("Строка") Тогда
		Возврат ВФорматированнуюСтроку(Значение);
	КонецЕсли; 
	СтрНастроек = НастройкиПоказателей.НайтиПоИдентификатору(Стр.ИдентификаторСтрокиНастроек);
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Если ПустаяСтрока(СтрНастроек.Формат) Тогда
			Результат = Строка(Значение);
		Иначе
			Результат = Формат(Значение, СтрНастроек.Формат);
		КонецЕсли;
	Иначе
		Если ПустаяСтрока(СтрНастроек.Формат) Тогда
			Результат = ВФорматированнуюСтроку(Строка(Значение));
		Иначе
			Результат = ВФорматированнуюСтроку(Формат(Значение, СтрНастроек.Формат));
		КонецЕсли;
		Результат = Новый ФорматированнаяСтрока(
		Результат, 
		?(СтрНастроек.Валютный И ЗначениеЗаполнено(Значение), Новый ФорматированнаяСтрока(" "+СимволРеглВалюты, Новый Шрифт(Новый Шрифт,,8), ЦветаСтиля.ЦветТекстаФормы), ""));
	КонецЕсли; 
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВФорматированнуюСтроку(Строка, Ссылка = "")
	
	РазделительДробнойЧасти = Сред(Формат(0.1), 2,1);
	Если СтрЧислоВхождений(Строка, РазделительДробнойЧасти)>1 Тогда
		Возврат Новый ФорматированнаяСтрока(Строка,,,, Ссылка);
	КонецЕсли; 
	Позиция = Найти(Строка, РазделительДробнойЧасти);
	Если Позиция=0 Тогда
		Возврат Новый ФорматированнаяСтрока(Строка, Новый Шрифт(Новый Шрифт,,, Истина), ЦветаСтиля.ЦветТекстаФормы,, Ссылка);
	Иначе
		ТекстДо = Лев(Строка, Позиция-1);
		ТекстПосле = Сред(Строка, Позиция);
		Возврат Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока(ТекстДо, Новый Шрифт(Новый Шрифт,,, Истина), ЦветаСтиля.ЦветТекстаФормы,, Ссылка),
		Новый ФорматированнаяСтрока(ТекстПосле, Новый Шрифт(Новый Шрифт,, 8), ЦветаСтиля.ЦветТекстаФормы,, Ссылка));
	КонецЕсли; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ХозоперацииДС()
	
	МассивХозОпераций = Новый Массив;
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.Аванс);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ВозвратЗаймаСотрудником);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ВозвратОплатыНаПлатежныеКарты);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ВозвратОплатыПокупателю);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ВыдачаЗаймаСотруднику);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.Зарплата);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.КредитПолученный);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.НаРасходы);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.Оплата);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ПеремещениеВКассуККМ);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ПеремещениеДС);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ПеречислениеНалога);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.Подотчетнику);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.Покупателю);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ПокупкаВалюты);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.Поставщику);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ПоступлениеОплатыОтПокупателя);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.ПоступлениеОплатыПоКартам);
	МассивХозОпераций.Добавить(Справочники.ХозяйственныеОперации.СписаниеНаРасходы);
	Возврат МассивХозОпераций;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредыдущийЭлемент(Элемент)
	
	Результат = Неопределено;
	Для каждого ТекЭлемент Из Элемент.Родитель.ПодчиненныеЭлементы Цикл
		Если Элемент=ТекЭлемент Тогда
			Прервать;
		КонецЕсли; 
		Результат = ТекЭлемент;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция СледующийЭлемент(Элемент)
	
	Результат = Неопределено;
	НайденТекущий = Ложь;
	НайденСледующий = Ложь;
	Для каждого ТекЭлемент Из Элемент.Родитель.ПодчиненныеЭлементы Цикл
		Если НайденСледующий Тогда
			Результат = ТекЭлемент;
			Прервать;
		КонецЕсли; 
		Если НайденТекущий И НЕ НайденСледующий Тогда
			НайденСледующий = Истина;
		КонецЕсли; 
		Если Элемент=ТекЭлемент Тогда
			НайденТекущий = Истина;
		КонецЕсли; 
	КонецЦикла;
	Возврат Результат;
	
КонецФункции 

&НаСервере
Функция НаборыРеквизитов(Группа, ИспользуютсяОбщиеДопРеквизиты)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("ИспользуютсяОбщиеДопРеквизиты", ИспользуютсяОбщиеДопРеквизиты);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НаборыДополнительныхРеквизитовИСведений.Ссылка
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	|ГДЕ
	|	НаборыДополнительныхРеквизитовИСведений.Ссылка В ИЕРАРХИИ(&Группа)
	|	И НЕ НаборыДополнительныхРеквизитовИСведений.ЭтоГруппа
	|	И (НаборыДополнительныхРеквизитовИСведений.Ссылка <> ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура_Общие)
	|			ИЛИ &ИспользуютсяОбщиеДопРеквизиты)";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьБыстрыеДействияНаРабочийСтол(ОбновитьИнтерфейс)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	НастройкиНачальнойСтраницы = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить("Общее/НастройкиНачальнойСтраницы", "", , , Пользователь.Имя);
	Если ТипЗнч(НастройкиНачальнойСтраницы)<>Тип("НастройкиНачальнойСтраницы") Тогда
		Возврат;
	КонецЕсли;
	СоставФорм = НастройкиНачальнойСтраницы.ПолучитьСоставФорм();
	Если СоставФорм.ЛеваяКолонка.Найти("Обработка.ПульсБизнеса.Форма.ПульсБизнеса")<>Неопределено
		И СоставФорм.ЛеваяКолонка.Найти("Обработка.БыстрыеДействия.Форма.БыстрыеДействия")=Неопределено Тогда
		Индекс = СоставФорм.ЛеваяКолонка.Найти("Обработка.ПульсБизнеса.Форма.ПульсБизнеса");
		СоставФорм.ЛеваяКолонка.Вставить(Индекс, "Обработка.БыстрыеДействия.Форма.БыстрыеДействия");
		ОбновитьИнтерфейс = Истина;
	ИначеЕсли СоставФорм.ПраваяКолонка.Найти("Обработка.ПульсБизнеса.Форма.ПульсБизнеса")<>Неопределено
		И СоставФорм.ПраваяКолонка.Найти("Обработка.БыстрыеДействия.Форма.БыстрыеДействия")=Неопределено Тогда
		Индекс = СоставФорм.ПраваяКолонка.Найти("Обработка.ПульсБизнеса.Форма.ПульсБизнеса");
		СоставФорм.ПраваяКолонка.Вставить(Индекс, "Обработка.БыстрыеДействия.Форма.БыстрыеДействия");
		ОбновитьИнтерфейс = Истина;
	Иначе
		Возврат;
	КонецЕсли; 
	НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
	ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить("Общее/НастройкиНачальнойСтраницы", "", НастройкиНачальнойСтраницы, , Пользователь.Имя);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементыРекурсивно(Группа)
	
	Пока Группа.ПодчиненныеЭлементы.Количество()>0 Цикл
		Элемент = Группа.ПодчиненныеЭлементы[0];
		Если ТипЗнч(Элемент)=Тип("КнопкаФормы") Тогда
			Команды.Удалить(Элемент.ИмяКоманды);
		ИначеЕсли ТипЗнч(Элемент)=Тип("ГруппаФормы") Тогда
			УдалитьЭлементыРекурсивно(Элемент);
		КонецЕсли; 
		Элементы.Удалить(Элемент);
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти
 
