&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяМакета = Параметры.АдресФаила;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьФайл()
    
    
    АдресДанных = ПрочитатьФайлСервер(УникальныйИдентификатор);
    Если ЭтоАдресВременногоХранилища(АдресДанных) Тогда
        
        ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресДанных);
        Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
			
			Путь = КаталогВременныхФайлов() + "temp.pdf";			
            ДвоичныеДанные.Записать(Путь);		
			КодHTML = Путь;
			
        КонецЕсли;
        
    КонецЕсли;
        
КонецПроцедуры

&НаСервере
Функция ПрочитатьФайлСервер(Знач УникальныйИдентификаторФормы)
    
    АдресДанных = Неопределено;	
	МакетСДанными = РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета);	
	АдресДанных = ПоместитьВоВременноеХранилище(МакетСДанными, УникальныйИдентификаторФормы);
	
    Возврат АдресДанных;
    
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СкопироватьФайл();
КонецПроцедуры
