
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеВА);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета());
	
	//ПодольскийАИ #УчетПроектов 10.12.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 10.12.2020 }
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеВА.Ссылка,
	|	ПеремещениеВА.Номер,
	|	ПеремещениеВА.Дата,
	|	ПеремещениеВА.Организация
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.ПеремещениеВА КАК ПеремещениеВА
	|ГДЕ
	|	ПеремещениеВА.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка,
	|	ПеремещениеВАВнеоборотныеАктивы.НомерСтроки,
	|	ПеремещениеВАВнеоборотныеАктивы.ВнеоборотныйАктив,
	|	ПеремещениеВАВнеоборотныеАктивы.СтруктурнаяЕдиница,
	|	ПеремещениеВАВнеоборотныеАктивы.СтруктурнаяЕдиницаПолучатель,
	|	ПеремещениеВАВнеоборотныеАктивы.Адрес,
	|	ПеремещениеВАВнеоборотныеАктивы.АдресПолучатель,
	|	ПеремещениеВАВнеоборотныеАктивы.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.ПервоначальнаяСтоимость,
	|	ПеремещениеВАВнеоборотныеАктивы.НачислятьАмортизациюВТекущемМесяце,
	|	ПеремещениеВАВнеоборотныеАктивы.СрокИспользованияДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.СчетЗатрат,
	|	ПеремещениеВАВнеоборотныеАктивы.НаправлениеДеятельности,
	|	ПеремещениеВАВнеоборотныеАктивы.СчетЗатратРегл,
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка.Дата КАК Период,
	|	&ВалютаУчета КАК Валюта,
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка.Организация КАК Организация,
	|	ПеремещениеВАВнеоборотныеАктивы.ГодовойПроцентАмортизацииДляУменьшенногоОстатка КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ПеремещениеВАВнеоборотныеАктивы.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка,
	//ПодольскийАИ #УчетПроектов 08.12.2020 {
	|	Выбор 
	|		Когда &УчетПоПроектам 
	|			Тогда ПеремещениеВАВнеоборотныеАктивы.Проект
	|		Иначе Значение(Справочник.Проекты.ПустаяСсылка)
	|	Конец КАК Проект,
	|	Выбор 
	|		Когда &УчетПоПроектам 
	|			Тогда ПеремещениеВАВнеоборотныеАктивы.ПроектПолучатель
	|		Иначе Значение(Справочник.Проекты.ПустаяСсылка)
	|	Конец КАК ПроектПолучатель 
	//ПодольскийАИ #УчетПроектов 08.12.2020 }
	|ПОМЕСТИТЬ ВременнаяТаблицаВнеоборотныхАктивов
	|ИЗ
	|	Документ.ПеремещениеВА.ВнеоборотныеАктивы КАК ПеремещениеВАВнеоборотныеАктивы
	|ГДЕ
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка = &Ссылка";
	
	Запрос.ВыполнитьПакет();
	
	// Формирование таблиц движений по разделам учета.
	СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства);
	
	//ПодольскийАИ #УчетПроектов 08.12.2020 {
	СформироватьТаблицаУчетПоПроектамВнеоборотныхАктивов(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства);
	//ПодольскийАИ #УчетПроектов 08.12.2020 }
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ПеремещениеВА(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиница,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ТаблицаДокумента.НачислятьАмортизациюВТекущемМесяце КАК ПрименитьВТекущемМесяце,
	|	ТаблицаДокумента.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаДокумента.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ТаблицаДокумента.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.АдресПолучатель КАК Адрес,
	|	ТаблицаДокумента.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ТаблицаДокумента.ГодовойПроцентАмортизацииДляУменьшенногоОстатка КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ТаблицаДокумента.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка
	|ИЗ
	|	ВременнаяТаблицаВнеоборотныхАктивов КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыВнеоборотныхАктивов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПараметрыВнеоборотныхАктивов()

//ПодольскийАИ #УчетПроектов 08.12.2020 {
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУчетПоПроектамВнеоборотныхАктивов(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства)
	
	Если Не СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Проект КАК ПроектТекущий,
	|	ТаблицаДокумента.ПроектПолучатель КАК Проект
	|ИЗ
	|	ВременнаяТаблицаВнеоборотныхАктивов КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Проект <> ТаблицаДокумента.ПроектПолучатель
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетПоПроектамВнеоборотныхАктивов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПараметрыВнеоборотныхАктивов()

//ПодольскийАИ #УчетПроектов 08.12.2020 }
