
Перем ИспользоватьТолькоРегламентированныйПланСчетов Экспорт; //+++ Дмгг

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("СправочникСсылка.ВнеоборотныеАктивы")] = "ЗаполнитьПоВнеоборотныеАктивы";
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
		// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.ПеремещениеВА.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	УправлениеНебольшойФирмойСервер.ОтразитьПараметрыВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	
	//ПодольскийАИ #УчетПроектов 08.12.2020 {
	УправлениеНебольшойФирмойСервер.ОтразитьУчетПоПроектамВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	//ПодольскийАИ #УчетПроектов 08.12.2020 }
	
	УправлениеНебольшойФирмойСервер.ОтразитьСостоянияВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ); //+++ Дмгг
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) //+++ Дмгг
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата);
	Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВнеоборотныеАктивы.СчетЗатрат");
	Иначе
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВнеоборотныеАктивы.СчетЗатратРегл");
	КонецЕсли;
	
	//+++ Дмгг
	Для Каждого СтрокаТЧ Из ВнеоборотныеАктивы Цикл 
		
		Если СтрокаТЧ.ВнеоборотныйАктив.СпособАмортизации = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка Тогда 
			
			Если СтрокаТЧ.ГодовойПроцентАмортизацииДляУменьшенногоОстатка = 0 Тогда 
				
				ТекстСообщения = НСтр("ka='სია ""ამორტიზაციის %"" სტრიქონ %НомерСтроки%-ში სვეტი ""ქონება"" არ არის შევსებული.';ru='Не заполнена колонка ""Годовой процент амортизации"" в строке %НомерСтроки% списка ""Имущество"".';en='Not filled column ""Annual percentage"" on line% NomerStroki% ""Propety"" list.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Строка(СтрокаТЧ.НомерСтроки));
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"ВнеоборотныеАктивы",
					СтрокаТЧ.НомерСтроки,
					"ГодовойПроцентАмортизацииДляУменьшенногоОстатка",
					Отказ
				);
			КонецЕсли;
			
			Если СтрокаТЧ.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка = 0 Тогда 
				
				ТекстСообщения = НСтр("ka='სია ""სალიკვიდაციო ღირებულება"" სტრიქონ %НомерСтроки%-ში სვეტი ""ქონება"" არ არის შევსებული.';ru='Не заполнена колонка ""Ликвидационная стоимость"" в строке %НомерСтроки% списка ""Имущество"".';en='Not filled column ""Liquidation value"" on line% NomerStroki% ""Propety"" list.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Строка(СтрокаТЧ.НомерСтроки));
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"ВнеоборотныеАктивы",
					СтрокаТЧ.НомерСтроки,
					"ЛиквидационнаяСтоимостьДляУменьшенногоОстатка",
					Отказ
				);
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//--- Дмгг
	
КонецПроцедуры

ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата()));//+++ Дмгг

