
Перем ИспользоватьТолькоРегламентированныйПланСчетов Экспорт; //+++ Дмгг

//29.07.2025 ONESOFT-4150
Процедура ЗаполнитьПоИнвентаризацииОсновныхСредств(ДокументСсылкаИнвентаризацияОсновныхСредств) Экспорт
	
	// Заполнение шапки документа.
	ДокументОснование = ДокументСсылкаИнвентаризацияОсновныхСредств.Ссылка;
	Организация = ДокументСсылкаИнвентаризацияОсновныхСредств.Организация;
	
	// Заполнение табличной части документа.
	Для каждого СтрокаТабличнойЧасти Из ДокументСсылкаИнвентаризацияОсновныхСредств.ВнеоборотныеАктивы Цикл
		
		Если СтрокаТабличнойЧасти.Отклонение < 0 Тогда
			НоваяСтрока = ВнеоборотныеАктивы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);   
						
			ЗаполнитьДанныеВА(НоваяСтрока);
			
			НоваяСтрока.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка = СтрокаТабличнойЧасти.ВнеоборотныйАктив.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка;   
			НоваяСтрока.ГодовойПроцентАмортизацииДляУменьшенногоОстатка = СтрокаТабличнойЧасти.ВнеоборотныйАктив.ГодовойПроцентАмортизацииДляУменьшенногоОстатка;    		
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьДанныеВА(НоваяСтрока)
	
	ДатаЗапроса = Дата(1,1,1);
	Если ЗначениеЗаполнено(Дата) Тогда 
		Если Дата = НачалоДня(Дата) Тогда 
			ДатаЗапроса = ТекущаяДата();
		Иначе
			ДатаЗапроса = Дата-1;
		КонецЕсли;
	Иначе
		ДатаЗапроса = ТекущаяДата();
	КонецЕсли;
		
	Если НоваяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктивТек,
	|	ПараметрыАмортизацииСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПараметрыАмортизацииСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПолучатель,
	|	ПараметрыАмортизацииСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатрат КАК СчетЗатрат,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ПараметрыАмортизацииСрезПоследних.Адрес КАК Адрес,
	|	ПараметрыАмортизацииСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПараметрыАмортизацииСрезПоследних.ГодовойПроцентАмортизацииДляУменьшенногоОстатка КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ПараметрыАмортизацииСрезПоследних.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка,
	|	ЕСТЬNULL(СостоянияВнеоборотныхАктивовСрезПоследних.НачислятьАмортизацию, ЛОЖЬ) КАК Амортизация,
	|	ЕСТЬNULL(СостоянияВнеоборотныхАктивовСрезПоследних.НачислятьАмортизациюВТекущемМесяце, ЛОЖЬ) КАК НачислятьАмортизациюВТекущемМесяце,
	|	ЕСТЬNULL(РыночныеЦеныВАСрезПоследних.Цена, 0) КАК РыночнаяЦена
	|ИЗ
	|	РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(
	|			&ДатаДокумента,
	|			Организация = &Организация
	|				И ВнеоборотныйАктив = &ВнеоборотныйАктив
	|				И НЕ Регистратор = &Ссылка
	|) КАК ПараметрыАмортизацииСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(
	|				&ДатаДокумента,
	|				Организация = &Организация
	|					И ВнеоборотныйАктив = &ВнеоборотныйАктив
	|					И НЕ Регистратор = &Ссылка) КАК СостоянияВнеоборотныхАктивовСрезПоследних
	|		ПО ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив = СостоянияВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РыночныеЦеныВА.СрезПоследних(&ДатаДокумента, ) КАК РыночныеЦеныВАСрезПоследних
	|		ПО ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив = РыночныеЦеныВАСрезПоследних.Имущество";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВнеоборотныйАктив", НоваяСтрока.ВнеоборотныйАктив);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаРезультат = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультат.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(НоваяСтрока ,ВыборкаРезультат);
	КонецЦикла;
	
	НоваяСтрока.Проект = Справочники.Проекты.ПустаяСсылка();
	НоваяСтрока.ПроектПолучатель = Справочники.Проекты.ПустаяСсылка();
	
	УчетПоПроектам = ПолучитьФункциональнуюОпцию("УчетПоПроектам");
	
	Если УчетПоПроектам Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетПоПроектамВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив,
		|	УчетПоПроектамВнеоборотныхАктивовСрезПоследних.Проект
		|ИЗ
		|	РегистрСведений.УчетПоПроектамВнеоборотныхАктивов.СрезПоследних(
		|			&ДатаДокумента,
		|			Организация = &Организация
		|				И ВнеоборотныйАктив = &ВнеоборотныйАктив) КАК УчетПоПроектамВнеоборотныхАктивовСрезПоследних";
		
		ВыборкаРезультат = Запрос.Выполнить().Выбрать();
		Пока ВыборкаРезультат.Следующий() Цикл 
			НоваяСтрока.Проект = ВыборкаРезультат.Проект;
			НоваяСтрока.ПроектПолучатель = ВыборкаРезультат.Проект;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

//&НаСервере
//Функция НайтиСкладВПринятиеКУчету(ВнеоборотныйАктив)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ПринятиеКУчетуВА.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
//		|ИЗ
//		|	Документ.ПринятиеКУчетуВА КАК ПринятиеКУчетуВА
//		|ГДЕ
//		|	ПринятиеКУчетуВА.ВнеоборотныеАктивы.ВнеоборотныйАктив = &ВнеоборотныйАктив";
//	
//	Запрос.УстановитьПараметр("ВнеоборотныйАктив", ВнеоборотныйАктив);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Возврат ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница;
//	КонецЦикла;
//	
//	Возврат Неопределено;	
//КонецФункции
//29.07.2025 ONESOFT-4150

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("СправочникСсылка.ВнеоборотныеАктивы")] = "ЗаполнитьПоВнеоборотныеАктивы"; 
	СтратегияЗаполнения[Тип("ДокументСсылка.ИнвентаризацияОсновныхСредств")] = "ЗаполнитьПоИнвентаризацииОсновныхСредств";//29.07.2025 ONESOFT-4150
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
		// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.ПеремещениеВА.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	УправлениеНебольшойФирмойСервер.ОтразитьПараметрыВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	
	//ПодольскийАИ #УчетПроектов 08.12.2020 {
	УправлениеНебольшойФирмойСервер.ОтразитьУчетПоПроектамВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	//ПодольскийАИ #УчетПроектов 08.12.2020 }
	
	УправлениеНебольшойФирмойСервер.ОтразитьСостоянияВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ); //+++ Дмгг
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) //+++ Дмгг
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата);
	Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВнеоборотныеАктивы.СчетЗатрат");
	Иначе
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВнеоборотныеАктивы.СчетЗатратРегл");
	КонецЕсли;
	
	//+++ Дмгг
	Для Каждого СтрокаТЧ Из ВнеоборотныеАктивы Цикл 
		
		Если СтрокаТЧ.ВнеоборотныйАктив.СпособАмортизации = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка Тогда 
			
			Если СтрокаТЧ.ГодовойПроцентАмортизацииДляУменьшенногоОстатка = 0 Тогда 
				
				ТекстСообщения = НСтр("ka='სია ""ამორტიზაციის %"" სტრიქონ %НомерСтроки%-ში სვეტი ""ქონება"" არ არის შევსებული.';ru='Не заполнена колонка ""Годовой процент амортизации"" в строке %НомерСтроки% списка ""Имущество"".';en='Not filled column ""Annual percentage"" on line% NomerStroki% ""Propety"" list.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Строка(СтрокаТЧ.НомерСтроки));
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"ВнеоборотныеАктивы",
					СтрокаТЧ.НомерСтроки,
					"ГодовойПроцентАмортизацииДляУменьшенногоОстатка",
					Отказ
				);
			КонецЕсли;
			
			Если СтрокаТЧ.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка = 0 Тогда 
				
				ТекстСообщения = НСтр("ka='სია ""სალიკვიდაციო ღირებულება"" სტრიქონ %НомерСтроки%-ში სვეტი ""ქონება"" არ არის შევსებული.';ru='Не заполнена колонка ""Ликвидационная стоимость"" в строке %НомерСтроки% списка ""Имущество"".';en='Not filled column ""Liquidation value"" on line% NomerStroki% ""Propety"" list.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Строка(СтрокаТЧ.НомерСтроки));
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"ВнеоборотныеАктивы",
					СтрокаТЧ.НомерСтроки,
					"ЛиквидационнаяСтоимостьДляУменьшенногоОстатка",
					Отказ
				);
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//--- Дмгг
	
КонецПроцедуры

ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата()));//+++ Дмгг

