
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
		//+++ Дмгг
		ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()); //+++ Дмгг
	Иначе
		ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ДатаДокумента);
		//--- Дмгг
	КонецЕсли;
	ЭтотОбъект.ОснованиеСоздания = Параметры.Основание;
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	//Паганини_
	ФункциональнаяОпцияУчетПоНесколькимСкладам = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункциональнаяОпцияУчетПоНесколькимСкладам");
	ЗаполнитьСтруктурныеЕдиницыПолучателейИУстановитьВидимость("ПриСозданииНаСервере");
	ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах");
	Если ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах Тогда
		ПравоИзмененияЗаказовНаПеремещения	= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(, "ПравоИзмененияЗаказовНаПеремещения");
		ОсновнойСкладПользователя			= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(, "ОсновнойСклад");
		УстановитьВидимостьИДоступностьПоЗаказуНаПеремещения();
	КонецЕсли;
	//_Паганини
	
	ЕстьРозница = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
				ИЛИ Объект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница;
	ЕстьРозницаСуммовойУчет = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет
				ИЛИ Объект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет;
	
	// ФО Использовать подсистему Производство.
	УстановитьВидимостьОтФОИспользоватьПодсистемуПроизводство();
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы Тогда
		Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить() Тогда
			Пользователь = Пользователи.ТекущийПользователь();
			ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновноеПодразделение");
			ОсновноеПодразделение = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
			Объект.СтруктурнаяЕдиницаПолучатель = ОсновноеПодразделение;
		КонецЕсли;
	КонецЕсли;
	
	ИменаТЧ = Новый Массив;
	ИменаТЧ.Добавить(Новый Структура("ИмяПоляПроверки, ИмяПоляОформления", "Объект.Запасы.СтранаПроисхождения", "ЗапасыНомерГТД"));
	
	ГрузовыеТаможенныеДекларацииСервер.ПриСозданииНаСервере(ЭтаФорма, ИменаТЧ, КэшЗначений);
	КэшЗначений.Вставить("Перемещение", Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение);
	КэшЗначений.Вставить("ПоложениеЗаказаВТабличнойЧасти", Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти);
	
	//ПодольскийАИ #УчетПроектов 05.10.2020 {
	УчетПоПроектам = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункциональнаяОпцияУчетПоПроектам");
	
	КэшЗначений.Вставить("СписаниеНаРасходы", Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы);
	КэшЗначений.Вставить("Перемещение", Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение);
	КэшЗначений.Вставить("ПустойПроект", Справочники.Проекты.ПустаяСсылка());
	//ПодольскийАИ #УчетПроектов 05.10.2020 }
	
	//Установить надпись основание
	Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Объект.ДокументОснование);
	ЗаполнитьСписокДокументОснование();
	
	////-------------------------- // Россофт // --->
	НайденныйЭлНакладная = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйЭлНакладная(Объект.Ссылка);
	Элементы.ЭлектроннаяНакладнаяНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьЭлНакладная(НайденныйЭлНакладная);
	Элементы.ЭлектроннаяНакладнаяНадпись.Доступность= РС_ИнтеграцияСНалоговойСлужбойГрузииПовтИсп.ПодсистемаДоступна_ИнтеграцияСНалоговойСлужбойГрузии();//Паганини
	////-------------------------- //Россофт  // <---
	
	УстановитьВидимостьИДоступность();
	
	// ПодборНоменклатурыВДокументах
	ПодборНоменклатурыВДокументах.НазначитьФормуПодбора(ПараметрыОткрытияПодбора, Объект.Ссылка.Метаданные().Имя, "Запасы");
	// Конец ПодборНоменклатурыВДокументах
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	СписокЭлектронныхВесов = МенеджерОборудованияВызовСервера.ПолучитьСписокОборудования("ЭлектронныеВесы", , МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
	Если СписокЭлектронныхВесов.Количество() = 0 Тогда
		// Нет подключенных весов.
		Элементы.ЗапасыПолучитьВес.Видимость = Ложь;
	КонецЕсли;
	Элементы.ЗапасыЗагрузитьДанныеИзТСД.Видимость = ИспользоватьПодключаемоеОборудование;
	// Конец ПодключаемоеОборудование
	
	// КопированиеСтрокТабличныхЧастей
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Запасы");
	
	// Серийные номера
	ИспользоватьСерийныеНомераОстатки = РаботаССерийнымиНомерами.ИспользоватьСерийныеНомераОстатки();
	
	//Паганини_
	Элементы.ЗапасыЗаполнитьДоМинимальногоОстатка.Видимость = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьМинимальныеОстаткиСклада");
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.НомерТТН 					= "";
		Объект.IDTТН						= "";
		//Объект.СтатусТТН					= Неопределено;
		//Объект.ДатаНачалаТранспортировки	= Дата(1,1,1);
	КонецЕсли;//_Паганини
	ОбщегоНазначенияПереопределяемый.УстановитьДополнительноеПоведениеСтандартныхКнопокТЧЗапасы(ЭтаФорма);// Kuzmich, 07.08.2019, Дополнительные инструменты в табличных частях документов движения товаров
	УстановитьВидимостиЯчейкиВА();//+++ Дмгг
	УстановитьВидимостиСчетовЗатрат(); //+++ Дмгг
	
	НайденныйНалоговыйДокумент = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйНалоговыйДокумент(Объект.Ссылка);
	Элементы.НалоговыйДокументНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьНалоговыйДокумент(НайденныйНалоговыйДокумент);
	
	
	// ЗагрузкаДанныхИзВнешнегоИсточника
	//Lazare_
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.ПеремещениеЗапасов.ТабличныеЧасти.Запасы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	//_Lazare
	
	//+++ Дмгг
	//+++ Если включена настройка то пользователь может редактировать только документы своего основного склада
	ДобавитьОрганиченияНаРедактированиеДокумента(Пользователь);
	//--- Дмгг
	
	УстановитьВидимостьКнопки_ЗаполнитьКолонкуОС(); //+++ Дмгг
	
	ДобавитьОрганиченияНаРедактированиеТЧЗапасы();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ДобавитьОрганиченияНаРедактированиеДокумента(Пользователь)
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	ИспользоватьФильтр = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ФильтрСкладскихДокументовПоОсновномуСкладу");
	Если НЕ ЗначениеЗаполнено(ОсновнойСкладПользователя) Тогда 
		ОсновныеСкладыПользователя			= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ДоступныеСклады");
	КонецЕсли;
	
	МассивСкладов = ОсновныеСкладыПользователя.СписокСкладов.ВыгрузитьКолонку("Склад");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеЗапасов.Ссылка
		|ИЗ
		|	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
		|ГДЕ
		|	ПеремещениеЗапасов.СтруктурнаяЕдиница В(&МассивСкладов)
		|	И ПеремещениеЗапасов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И ИспользоватьФильтр
		И НЕ ВыборкаДетальныеЗаписи.Следующий() Тогда 
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
	КонецЕсли;	

КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтатистикаИспользованияФормКлиент.ПроверитьЗаписатьСтатистикуКоманды(
		"СоздатьНаОсновании.ПеремещениеЗапасов",
		ЭтотОбъект.ВладелецФормы,
		ЭтотОбъект.ОснованиеСоздания
	);
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьПараметрыВыбора();
	
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик события ОбработкаВыбора.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПечатьТТН.Форма.ДанныеПечати" Тогда
		
		Для каждого ЗначенияРеквизита Из ВыбранноеЗначение Цикл
			
			Если ЗначенияРеквизита.Ключ = "БанковскийСчетОрганизации" Тогда
				
				Объект.БанковскийСчет = ЗначенияРеквизита.Значение;
				
			Иначе
				
				Объект[ЗначенияРеквизита.Ключ] = ЗначенияРеквизита.Значение;
				
			КонецЕсли;
			
			Модифицированность = Истина;
			
		КонецЦикла;
	// Kuzmich, 16.07.2019, Заполнение Перемещения из заказа покупателя
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаВыбора" Тогда
		Если ТипЗНЧ(ВыбранноеЗначение)=Тип("Массив") Тогда
			Для каждого СтрВыбранноеЗначение Из ВыбранноеЗначение Цикл
				ЗаполнитьПоЗаказуПокупателя(СтрВыбранноеЗначение);
			КонецЦикла; 
		ИначеЕсли ТипЗНЧ(ВыбранноеЗначение)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ЗаполнитьПоЗаказуПокупателя(ВыбранноеЗначение);
		КонецЕсли;
	// Kuzmich, 16.07.2019, Заполнение Перемещения из заказа покупателя
	//+++ Дмгг
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ВнеоборотныеАктивы")
				И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС") Тогда 
				
		Для Каждого Строк из Объект.Запасы Цикл 
			Строк.ВнеоборотныйАктив = ВыбранноеЗначение;		
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры // ОбработкаВыбора()

// Процедура - обработчик события ПередЗаписью.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "Проведение"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
	КолТоваров = 0;
	для Каждого стр из Объект.Запасы цикл
		КолТоваров = КолТоваров + стр.Количество;		
	КонецЦикла;
	Объект.КоличествоТоваров = КолТоваров;
КонецПроцедуры

// Процедура - обработчик события ПередЗаписьюНаСервере.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность",Модифицированность);
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Процедура - обработчик события ОбработкаОповещения формы.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование"
	   И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			//Преобразуем предварительно к ожидаемому формату
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;
			
			ПолученыШтрихкоды(Данные);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если ИмяСобытия = "ПодборПроизведен" 
		И ЗначениеЗаполнено(Параметр) 
		//Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		АдресЗапасовВХранилище = Параметр;
		
		ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, "Запасы", Истина, Истина);
		
	ИначеЕсли ИмяСобытия = "ПодборСерий"
		И ЗначениеЗаполнено(Параметр) 
		//Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		ИзменилосьКоличество = ПолучитьСерийныеНомераИзХранилища(Параметр.АдресВоВременномХранилище, Параметр.КлючСтроки);
		Если ИзменилосьКоличество Тогда
			РассчитатьСуммуВСтрокеТабличнойЧасти();
		КонецЕсли; 
		
	КонецЕсли;
	
	// КопированиеСтрокТабличныхЧастей
	Если ИмяСобытия = "БуферОбменаТабличнаяЧастьКопированиеСтрок" Тогда
		КопированиеТабличнойЧастиКлиент.ОбработкаОповещения(Элементы, "Запасы");
	КонецЕсли;
	
	// Обсуждения
	ОбсужденияКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры // ОбработкаОповещения()

// Процедура - обработчик события ПриЗакрытии.
//
&НаКлиенте
Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры // ПриЗакрытии()

// Процедура - обработчик команды НастройкаДокумента.
//
&НаКлиенте
Процедура НастройкаДокумента(Команда)
	
	// 1. Формируем структуру параметров для заполнения формы "Настройка документа".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПоложениеЗаказаПокупателяВПеремещенииЗапасов", 	Объект.ПоложениеЗаказаПокупателя);
	СтруктураПараметров.Вставить("ПоложениеЯчейкиВПеремещенииЗапасов", 	Объект.ПоложениеЯчейкиВПеремещенииЗапасов);
	СтруктураПараметров.Вставить("БылиВнесеныИзменения", 							Ложь);
	
	СтруктураНастройкаДокумента = Неопределено;

	
	ОткрытьФорму("ОбщаяФорма.НастройкаДокумента", СтруктураПараметров,,,,, Новый ОписаниеОповещения("НастройкаДокументаЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДокументаЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    // 2. Открвыаем форму "Цены и Валюта".
    СтруктураНастройкаДокумента = Результат;
    
    // 3. Применяем изменения, сделанные в форме "Настройка документа".
    Если ТипЗнч(СтруктураНастройкаДокумента) = Тип("Структура") И СтруктураНастройкаДокумента.БылиВнесеныИзменения Тогда
        
        Объект.ПоложениеЗаказаПокупателя = СтруктураНастройкаДокумента.ПоложениеЗаказаПокупателяВПеремещенииЗапасов;
		Объект.ПоложениеЯчейкиВПеремещенииЗапасов = СтруктураНастройкаДокумента.ПоложениеЯчейкиВПеремещенииЗапасов;
        УстановитьВидимостьИДоступность();
        
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении поля ввода Дата.
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	//Паганини_
	Если ЗначениеЗаполнено(Объект.ДатаПеремещенияИзТранзита) И Объект.ДатаПеремещенияИзТранзита <= Объект.Дата Тогда
		Объект.ДатаПеремещенияИзТранзита = Объект.Дата + 1;
	КонецЕсли;
	//_Паганини
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ДатаДокумента); //+++ Дмгг
	
КонецПроцедуры // ДатаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Организация.
// В процедуре осуществляется очистка номера документа,
// а также производится установка параметров функциональных опций формы.
// Переопределяет соответствующий параметр формы.
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	// Обработка события изменения организации.
	Объект.Номер = "";
	СтруктураДанные = ПолучитьДанныеОрганизацияПриИзменении(Объект.Организация, Объект.Дата);
	Компания = СтруктураДанные.Компания;
	
	Объект.ПодписьРуководителя = СтруктураДанные.ПодписьРуководителя;
	Объект.ПодписьГлавногоБухгалтера = СтруктураДанные.ПодписьГлавногоБухгалтера;
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ВидОперации.
//
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ОбработатьИзменениеВидаОперации();
	
	Если Объект.ВидОперации = КэшЗначений.Перемещение Тогда
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
			
			СтрокаТабличнойЧасти["СтранаПроисхождения"] = Неопределено;
			СтрокаТабличнойЧасти["НомерГТД"] = Неопределено;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//ПодольскийАИ #УчетПроектов 05.10.2020 {
	Если УчетПоПроектам Тогда
		Если Объект.ВидОперации <> КэшЗначений.СписаниеНаРасходы Тогда
			ЗаполнитьПроектПоДокументу( , "СписаниеНаРасходы");
		ИначеЕсли Объект.ВидОперации <> КэшЗначений.Перемещение Тогда
			ЗаполнитьПроектПоДокументу( , "Перемещение");
		КонецЕсли;
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 05.10.2020 }
	
	УстановитьВидимостиЯчейкиВА();
	УстановитьВидимостиСчетовЗатрат(); //+++ Дмгг
	УстановитьВидимостьКнопки_ЗаполнитьКолонкуОС(); //+++ Дмгг
	СчетЗатратПриИзменении(Элемент) //+++ Дмгг
	
КонецПроцедуры // ВидОперацииПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СчетЗатрат.
//
&НаКлиенте
Процедура СчетЗатратПриИзменении(Элемент)
	
	//+++ Дмгг
	Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
		Элементы.НаправлениеДеятельности.Видимость = ПолучитьВидимостьНаправленияДеятельности(Объект.СчетЗатратРегл);
	Иначе
		Элементы.НаправлениеДеятельности.Видимость = ПолучитьВидимостьНаправленияДеятельности(Объект.СчетЗатрат);
	КонецЕсли;
	//--- Дмгг

КонецПроцедуры // СчетЗатратПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СтруктурнаяЕдиница.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	Если объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС") ТОгда 
		Возврат;
	КонецЕсли;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ВидОперации", Объект.ВидОперации);
	СтруктураДанные.Вставить("Источник", Объект.СтруктурнаяЕдиница);
	
	СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиницаПриИзменении(СтруктураДанные);
	
	Объект.ПодписьКладовщикаОтправил = СтруктураДанные.ПодписьКладовщика;
	
	УстановитьВидимостьИДоступность();
	Элементы.СтруктурнаяЕдиница.АвтоМаксимальнаяШирина = НЕ Элементы.Ячейка.Видимость;
	
	Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаПолучатель) Тогда
		Объект.СтруктурнаяЕдиницаПолучатель = СтруктураДанные.СтруктурнаяЕдиницаПолучатель;
		Объект.ЯчейкаПолучатель = СтруктураДанные.ЯчейкаПолучатель;
		Элементы.ЯчейкаПолучатель.Видимость = УчетПоЯчейкам И СтруктураДанные.ОрдерныйСкладПолучатель;
		Элементы.СтруктурнаяЕдиницаПолучатель.АвтоМаксимальнаяШирина = НЕ Элементы.ЯчейкаПолучатель.Видимость;
	 	//Паганини_
		Элементы.СтруктурнаяЕдиницаКонечныйПолучатель.АвтоМаксимальнаяШирина = НЕ Элементы.ЯчейкаПолучатель.Видимость;
		ЗаполнитьСтруктурныеЕдиницыПолучателейИУстановитьВидимость("СтруктурнаяЕдиницаПолучательПриИзменении");
	 	//_Паганини
	КонецЕсли;
	
	Если СтруктураДанные.ТипСтруктурнойЕдиницыРозницаСуммовойУчет Тогда
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыСебестоимость.Видимость = Истина;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыСумма.Видимость = Истина;
	ИначеЕсли НЕ СтруктураДанные.ТипСтруктурнойЕдиницыРозницаСуммовойУчет Тогда
		Для каждого СтрокаЗапасы Из Объект.Запасы Цикл
			СтрокаЗапасы.Себестоимость = 0;
			СтрокаЗапасы.Сумма = 0;
		КонецЦикла;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыСебестоимость.Видимость = Ложь;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыСумма.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьПараметрыВыбора();
	
КонецПроцедуры // СтруктурнаяЕдиницаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СтруктурнаяЕдиницаПолучатель.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаПолучательПриИзменении(Элемент)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ВидОперации", Объект.ВидОперации);
	СтруктураДанные.Вставить("Получатель", Объект.СтруктурнаяЕдиницаПолучатель);
	
	СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиницаПолучательПриИзменении(СтруктураДанные);
	
	Объект.ПодписьКладовщикаПолучил = СтруктураДанные.ПодписьКладовщика;
	
	Элементы.ЯчейкаПолучатель.Видимость = УчетПоЯчейкам И СтруктураДанные.ОрдерныйСклад;
	Элементы.СтруктурнаяЕдиницаПолучатель.АвтоМаксимальнаяШирина = НЕ Элементы.ЯчейкаПолучатель.Видимость;
	//Паганини_
	Элементы.СтруктурнаяЕдиницаКонечныйПолучатель.АвтоМаксимальнаяШирина = НЕ Элементы.ЯчейкаПолучатель.Видимость;
	//_Паганини
	
	Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		Объект.СтруктурнаяЕдиница = СтруктураДанные.СтруктурнаяЕдиница;
		Объект.Ячейка = СтруктураДанные.Ячейка;
		Элементы.Ячейка.Видимость = УчетПоЯчейкам И СтруктураДанные.ОрдерныйСкладИсточник;
		Элементы.СтруктурнаяЕдиница.АвтоМаксимальнаяШирина = НЕ Элементы.Ячейка.Видимость;
	КонецЕсли;
	
	СтруктураДанные.Свойство("АдресДоставки", Объект.АдресДоставки);
	
	УстановитьПараметрыВыбора();
	//Паганини_
	ЗаполнитьСтруктурныеЕдиницыПолучателейИУстановитьВидимость("СтруктурнаяЕдиницаПолучательПриИзменении");
	//_Паганини
	
КонецПроцедуры // СтруктурнаяЕдиницаПолучательПриИзменении()

// Процедура - обработчик события Открытие поля ввода СтруктурнаяЕдиница.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Элементы.СтруктурнаяЕдиница.РежимВыбораИзСписка
		И НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // СтруктурнаяЕдиницаОткрытие()

// Процедура - обработчик события Открытие поля ввода СтруктурнаяЕдиницаПолучатель.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаПолучательОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Элементы.СтруктурнаяЕдиницаПолучатель.РежимВыбораИзСписка
		И НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаПолучатель) Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // СтруктурнаяЕдиницаПолучательОткрытие()

// Процедура устанавливает связи параметров выбора.
//
&НаКлиенте
Процедура УстановитьПараметрыВыбора()
	
	Если ЕстьРозницаСуммовойУчет Тогда
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.СобственныеЗапасы"));
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Статус", Новый ФиксированныйМассив(НовыйМассив));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыПартия.ПараметрыВыбора = НовыеПараметры;
	ИначеЕсли ЕстьРозница Тогда
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.СобственныеЗапасы"));
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварыНаКомиссии"));
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Статус", Новый ФиксированныйМассив(НовыйМассив));
		НовыйПараметр2 = Новый ПараметрВыбора("Дополнительно.ОграничениеСтатуса", Новый ФиксированныйМассив(НовыйМассив));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыйМассив.Добавить(НовыйПараметр2);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыПартия.ПараметрыВыбора = НовыеПараметры;
	Иначе
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.СобственныеЗапасы"));
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.ОтветственноеХранение"));
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.ДавальческоеСырье"));
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварыНаКомиссии"));
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Статус", Новый ФиксированныйМассив(НовыйМассив));
		НовыйПараметр2 = Новый ПараметрВыбора("Дополнительно.ОграничениеСтатуса", Новый ФиксированныйМассив(НовыйМассив));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыйМассив.Добавить(НовыйПараметр2);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыПартия.ПараметрыВыбора = НовыеПараметры;
	КонецЕсли;
	
КонецПроцедуры // УстановитьПараметрыВыбора()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

// Процедура - обработчик события ПриИзменении поля ввода Номенклатура.
//
&НаКлиенте
//Процедура ЗапасыНоменклатураПриИзменении(Элемент)
//	
//	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
// Kuzmich, 16.07.2019, Заполнение Перемещения из заказа покупателя
Процедура ЗапасыНоменклатураПриИзменении(Элемент, ТекСтрокаЗапасы=НЕОПРЕДЕЛЕНО)
	Если НЕ ТекСтрокаЗапасы=НЕОПРЕДЕЛЕНО Тогда
		СтрокаТабличнойЧасти = ТекСтрокаЗапасы;
	Иначе	
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
// Kuzmich, 16.07.2019, Заполнение Перемещения из заказа покупателя	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.СтранаПроисхождения = СтруктураДанные.СтранаПроисхождения;
	СтрокаТабличнойЧасти.НомерГТД = Неопределено;
	СтрокаТабличнойЧасти.Количество = 1;
	
	//Серийные номера
	Для каждого ВыделеннаяСтрока Из Элементы.Запасы.ВыделенныеСтроки Цикл
		ТекущиеДанныеСтроки = Элементы.Запасы.ДанныеСтроки(ВыделеннаяСтрока);
		РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомера, ТекущиеДанныеСтроки,,ИспользоватьСерийныеНомераОстатки);
	КонецЦикла;
	
КонецПроцедуры // ЗапасыНоменклатураПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Количество.
//
&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	//Паганини_
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти.КоличествоВДороге > СтрокаТабличнойЧасти.Количество Тогда
		СтрокаТабличнойЧасти.КоличествоВДороге = СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	//_Паганини

КонецПроцедуры // ТоварыКоличествоЕдиницПриИзменении()

&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Себестоимость;
	
	// Серийные номера
	Если ИспользоватьСерийныеНомераОстатки<>Неопределено Тогда
		РаботаССерийнымиНомерамиКлиентСервер.ОбновитьСерийныеНомераКоличество(Объект, СтрокаТабличнойЧасти);
	КонецЕсли;
		
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

// Процедура - обработчик события ПриИзменении поля ввода Себестоимость.
//
&НаКлиенте
Процедура ЗапасыСебестоимостьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Себестоимость;

КонецПроцедуры // ЗапасыСебестоимостьПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Сумма.
//
&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	// Цена.
	Если СтрокаТабличнойЧасти.Количество <> 0 Тогда
		СтрокаТабличнойЧасти.Себестоимость = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
КонецПроцедуры // ЗапасыСуммаПриИзменении()

&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		Элемент.ТекущиеДанные.КлючСвязи = 0;
		Элемент.ТекущиеДанные.СерийныеНомера = "";
	КонецЕсли;	
	
	//ПодольскийАИ #УчетПроектов 05.10.2020 {
	Если УчетПоПроектам И НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Проект = Объект.Проект;
		Элемент.ТекущиеДанные.ПроектОтправитель = Объект.ПроектОтправитель;
		Элемент.ТекущиеДанные.ПроектПолучатель = Объект.ПроектПолучатель;
	КонецЕсли;	
	//ПодольскийАИ #УчетПроектов 05.10.2020 }
	
	Если Элемент.ТекущийЭлемент.Имя = "ЗапасыСерийныеНомера" Тогда
		ОткрытьПодборСерийныеНомера();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередУдалением(Элемент, Отказ)
	
	// Серийные номера
	Для каждого ВыделеннаяСтрока Из Элементы.Запасы.ВыделенныеСтроки Цикл
		ТекущиеДанныеСтроки = Элементы.Запасы.ДанныеСтроки(ВыделеннаяСтрока);
		РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомера, ТекущиеДанныеСтроки,,ИспользоватьСерийныеНомераОстатки);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
//Процедура ЗапасыНомерГТДПриИзменении(Элемент)
//	
//	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
// Kuzmich, 16.07.2019, Заполнение Перемещения из заказа покупателя
Процедура ЗапасыНомерГТДПриИзменении(Элемент, ТекСтрокаЗапасы=НЕОПРЕДЕЛЕНО)
	Если НЕ ТекСтрокаЗапасы=НЕОПРЕДЕЛЕНО Тогда
		СтрокаТабличнойЧасти = ТекСтрокаЗапасы;
	Иначе	
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
// Kuzmich, 16.07.2019, Заполнение Перемещения из заказа покупателя
	Если СтрокаТабличнойЧасти <> Неопределено
		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.НомерГТД) Тогда
		
		ДатаГТД = ГрузовыеТаможенныеДекларацииКлиент.ВыделитьДатуИзНомераГТД(Строка(СтрокаТабличнойЧасти.НомерГТД));
		Если ДатаГТД > КонецДня(Объект.Дата) Тогда
			
			ТекстСообщения = НСтр("ka='ყურადღება! არჩეული სატვირთო-საბაჟო დეკლარაცია დათარიღებულია უფრო გვიანი თარიღით, ვიდრე მიმდინარე დოკუმენტი';ru='Внимание! Выбранная ГТД датирована более поздней датой, чем текущий документ';en='Attention! Selected GTD dated later date than the current document'");
			Прилипалка = СтрШаблон("Объект.Запасы[%1].НомерГТД", СтрокаТабличнойЧасти.ПолучитьИдентификатор());
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Прилипалка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//Процедура ЗапасыСтранаПроисхожденияПриИзменении(Элемент)
Процедура ЗапасыСтранаПроисхожденияПриИзменении(Элемент, ТекСтрокаЗапасы=НЕОПРЕДЕЛЕНО)// Kuzmich, 16.07.2019, Заполнение Перемещения из заказа покупателя
		
	Если КэшЗначений.УчетГТД Тогда
		
		//СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		// Kuzmich, 16.07.2019, Заполнение Перемещения из заказа покупателя
		Если НЕ ТекСтрокаЗапасы=НЕОПРЕДЕЛЕНО Тогда
			СтрокаТабличнойЧасти = ТекСтрокаЗапасы;
		Иначе	
			СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		КонецЕсли;
		// Kuzmich, 16.07.2019, Заполнение Перемещения из заказа покупателя
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтранаПроисхождения)
			ИЛИ СтрокаТабличнойЧасти.СтранаПроисхождения = КэшЗначений.Россия Тогда
			
			СтрокаТабличнойЧасти.НомерГТД = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовПодвалаФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
		
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "удалить" Тогда
		Объект.ДокументОснование = Неопределено;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Неопределено);
		Модифицированность = Истина;
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "заполнить" Тогда
		ЗаполнитьПоОснованиюНачало();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "выбрать" Тогда
		//Выбрать основание
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборТипаОснованияЗавершение", ЭтотОбъект);
		ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДокументОснование, Элементы.ДокументОснованиеНадпись);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "открыть" Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) тогда
			возврат;
		КонецЕсли;
		
		РаботаСФормойДокументаКлиент.ОткрытьФормуДокументаПоТипу(Объект.ДокументОснование);
		
	КонецЕсли;
	//Паганини_
	УстановитьВидимостьИДоступностьПоЗаказуНаПеремещения();
	//_Паганини
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДокументОснование()
	
	СписокДокументОснование = Новый СписокЗначений;
	СписокДокументОснование.Добавить("Документ.ПриходнаяНакладная.ФормаВыбора", "Приходная накладная");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныйСклад") Тогда
		СписокДокументОснование.Добавить("Документ.ПриходныйОрдер.ФормаВыбора", "Приходный ордер");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуПроизводство") Тогда
		СписокДокументОснование.Добавить("Документ.ЗаказНаПроизводство.ФормаВыбора", "Заказ на производство");
		СписокДокументОснование.Добавить("Документ.СборкаЗапасов.ФормаВыбора", "Производство");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("УчетПоЯчейкам") Тогда
		СписокДокументОснование.Добавить("Документ.ПеремещениеПоЯчейкам.ФормаВыбора", "Перемещение по ячейкам");
	КонецЕсли;
	СписокДокументОснование.Добавить("Документ.СчетНаОплату.ФормаВыбора", "Счет на оплату");
	//Паганини_
	СписокДокументОснование.Добавить("Документ.ВнутреннийЗаказ.ФормаВыбора", "Заказ на внутреннее перемещение");
	//_Паганини
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТипаОснованияЗавершение(ВыбИмяФормы, Параметры) Экспорт
	
	Если ВыбИмяФормы<>Неопределено Тогда
		
		СтруктураПараметровОтбора = Новый Структура();
		_ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьОснованиеЗавершение", ЭтотОбъект);
		ОткрытьФорму(ВыбИмяФормы.Значение, СтруктураПараметровОтбора, ЭтотОбъект, ,,,_ОповещениеОЗакрытии);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОснованиеЗавершение(ВыбЗначение, Параметры) Экспорт

	Если ВыбЗначение<>Неопределено Тогда
		Объект.ДокументОснование = ВыбЗначение;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(ВыбЗначение);
		Модифицированность = Истина;
		
		ЗаполнитьПоОснованиюНачало();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюНачало() Экспорт

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", ЭтотОбъект);
	ПоказатьВопрос(
		ОписаниеОповещения, 
		НСтр("ka='შევავსოთ დოკუმენტი არჩეული საფუძვლით?';ru='Заполнить документ по выбранному основанию?';en='Complete the document by the selected base?'"), 
		РежимДиалогаВопрос.ДаНет, 0);		

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДекорацияПечатьНажатие(Элемент)
	
	НаборОснованийПечати = Новый Массив;
	Если Объект.ПоложениеЗаказаПокупателя = КэшЗначений.ПоложениеЗаказаВТабличнойЧасти Тогда
		
		Для каждого СтрокаТаблицы Из Объект.Запасы Цикл
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ЗаказПокупателя)
				И НаборОснованийПечати.Найти(СтрокаТаблицы.ЗаказПокупателя) = Неопределено Тогда
				
				НаборОснованийПечати.Добавить(СтрокаТаблицы.ЗаказПокупателя);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияРеквизитовПечати", ЭтотОбъект);
	ОткрытьФорму("Обработка.РеквизитыПечати.Форма.РеквизитыПечатиПеремещениеЗапасов", Новый Структура("КонтекстПечати, НаборОснованийПечати", Объект, НаборОснованийПечати), ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Ответ = Результат;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        ЗаполнитьПоДокументу(Объект.ДокументОснование);
    КонецЕсли;

КонецПроцедуры // ЗаполнитьПоОснованию()

// Процедура обработчик события команды ЗаполнитьПоОстаткам
//
&НаКлиенте
Процедура ЗаполнитьПоОстаткамНаСкладе(Команда)
	
	Если Объект.Запасы.Количество() > 0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоОстаткамНаСкладеЗавершение", ЭтотОбъект), НСтр("ka='ცხრილი გასუფთავდება! გავაგრძელოთ ოპერაციის შესრულება?';ru='Табличная часть будет очищена! Продолжить выполнение операции?';en='Tabular section will be cleared! To continue the operation?'"), РежимДиалогаВопрос.ДаНет, 0);
        Возврат; 
	КонецЕсли;
	
	ЗаполнитьПоОстаткамНаСкладеФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткамНаСкладеЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Ответ = Результат;
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли; 
    
    ЗаполнитьПоОстаткамНаСкладеФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткамНаСкладеФрагмент()
    
    ЗаполнитьЗапасыПоОстаткамНаСкладеНаСервере();

КонецПроцедуры //ЗаполнитьПоОстаткамНаСкладе()

// Процедура - обработчик команды ЗаполнитьПоРезервам подменю ИзменитьРезерв.
//
&НаКлиенте
Процедура ИзменитьРезервЗаполнитьПоРезервам(Команда)
	
	Если Объект.Запасы.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='ცხრილი ""მარაგები"" შევსებული არ არის!';ru='Табличная часть ""Запасы"" не заполнена!';en='A table of the ""Inventories"" is not full!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКолонкуРезервПоРезервамНаСервере();
	
КонецПроцедуры // ИзменитьРезервЗаполнитьПоРезервам()

// Процедура - обработчик команды ОчиститьРезерв подменю ИзменитьРезерв.
//
&НаКлиенте
Процедура ИзменитьРезервОчиститьРезерв(Команда)
	
	Если Объект.Запасы.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='ცხრილი ""მარაგები"" შევსებული არ არის!';ru='Табличная часть ""Запасы"" не заполнена!';en='A table of the ""Inventories"" is not full!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		СтрокаТабличнойЧасти.Резерв = 0;
	КонецЦикла;
	
КонецПроцедуры // ИзменитьРезервЗаполнитьПоОстаткам()



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКомандуПечати(Результат.Команда);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывает обработку заполнения документа по основанию.
//
&НаСервере
Процедура ЗаполнитьПоДокументу(ДокОснование)
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.Заполнить(ДокОснование);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Истина;
	
КонецПроцедуры // ЗаполнитьПоДокументу()

// Получает набор данных с сервера для процедуры ДатаПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", УправлениеНебольшойФирмойСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

// Получает набор данных с сервера.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеОрганизацияПриИзменении(Организация, ДатаДокумента)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Компания", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	СтруктураДанные.Вставить("ПодписьРуководителя", Организация.ПодписьРуководителя);
	СтруктураДанные.Вставить("ПодписьГлавногоБухгалтера", Организация.ПодписьГлавногоБухгалтера);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеОрганизацияПриИзменении()

// Получает набор данных с сервера для процедуры НоменклатураПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("СтранаПроисхождения", СтруктураДанные.Номенклатура.СтранаПроисхождения);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()	

// Получает признак видимости направления деятельности.
//
&НаСервереБезКонтекста
Функция ПолучитьВидимостьНаправленияДеятельности(СчетЗатрат)
	
	Возврат СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()	

// Получает набор данных с сервера для процедуры СтруктурнаяЕдиницаПриИзменении.
//
&НаСервере
Функция ПолучитьДанныеСтруктурнаяЕдиницаПриИзменении(СтруктураДанные)
	
	ЕстьРозница = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			  ИЛИ Объект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница;
	ЕстьРозницаСуммовойУчет = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет
						  ИЛИ Объект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет;
	
	СтруктураДанные.Вставить("ПодписьКладовщика", СтруктураДанные.Источник.ПодписьМОЛ);
	
	Если НЕ ЗначениеЗаполнено(СтруктураДанные.Источник)
		ИЛИ СтруктураДанные.Источник.ОрдерныйСклад 
		ИЛИ СтруктураДанные.Источник.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
		ИЛИ СтруктураДанные.Источник.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
		СтруктураДанные.Вставить("ОрдерныйСклад", Ложь);
	Иначе
		СтруктураДанные.Вставить("ОрдерныйСклад", Истина);
	КонецЕсли;
	
	Если СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение Тогда
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаПолучатель", СтруктураДанные.Источник.ПолучательПеремещения);
		СтруктураДанные.Вставить("ЯчейкаПолучатель", СтруктураДанные.Источник.ЯчейкаПолучателяПеремещения);
		СтруктураДанные.Вставить("ТипСтруктурнойЕдиницыРозницаСуммовойУчет", СтруктураДанные.Источник.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет);
		
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Источник.ПолучательПеремещения)
			ИЛИ СтруктураДанные.Источник.ПолучательПеремещения.ОрдерныйСклад 
			ИЛИ СтруктураДанные.Источник.ПолучательПеремещения.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			ИЛИ СтруктураДанные.Источник.ПолучательПеремещения.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Истина);
		КонецЕсли;
		
		ФункциональнаяОпцияЗаказПриПеремещенииВШапке = Объект.ПоложениеЗаказаПокупателя <> Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
		
		Если Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
		 ИЛИ Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
			Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыРезерв.Видимость = Ложь;
			Элементы.ЗапасыИзменитьРезерв.Видимость = Ложь;
			ИспользуетсяРезервирование = Ложь;
			
		Иначе
			Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыРезерв.Видимость = Истина;
			Элементы.ЗапасыИзменитьРезерв.Видимость = Истина;
			ИспользуетсяРезервирование = Истина;
		КонецЕсли;
		
		Если (Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			ИЛИ Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
			И (Объект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
		ИЛИ Объект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет) Тогда
			Элементы.ЗаказПокупателя.Видимость = Ложь;
			Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыЗаказПокупателя.Видимость = Ложь;
		Иначе
			Элементы.ЗаказПокупателя.Видимость = ФункциональнаяОпцияЗаказПриПеремещенииВШапке;
			Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыЗаказПокупателя.Видимость = НЕ ФункциональнаяОпцияЗаказПриПеремещенииВШапке;
		КонецЕсли;
		
	ИначеЕсли СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы Тогда	
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаПолучатель", СтруктураДанные.Источник.ПолучательСписанияНаРасходы);
		СтруктураДанные.Вставить("ЯчейкаПолучатель", СтруктураДанные.Источник.ЯчейкаПолучателяСписанияНаРасходы);
		СтруктураДанные.Вставить("ТипСтруктурнойЕдиницыРозницаСуммовойУчет", Ложь);
		
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Источник.ПолучательСписанияНаРасходы)
			ИЛИ СтруктураДанные.Источник.ПолучательСписанияНаРасходы.ОрдерныйСклад Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Истина);
		КонецЕсли;
		
	ИначеЕсли СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию Тогда		
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаПолучатель", СтруктураДанные.Источник.ПолучательПередачиВЭксплуатацию);
		СтруктураДанные.Вставить("ЯчейкаПолучатель", СтруктураДанные.Источник.ЯчейкаПолучателяПередачиВЭксплуатацию);
		СтруктураДанные.Вставить("ТипСтруктурнойЕдиницыРозницаСуммовойУчет", Ложь);
		
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Источник.ПолучательПередачиВЭксплуатацию)
			ИЛИ СтруктураДанные.Источник.ПолучательПередачиВЭксплуатацию.ОрдерныйСклад Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Истина);
		КонецЕсли;
		
	ИначеЕсли СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда	
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаПолучатель", СтруктураДанные.Источник.ПолучательВозвратаИзЭксплуатации);
		СтруктураДанные.Вставить("ЯчейкаПолучатель", СтруктураДанные.Источник.ЯчейкаПолучателяВозвратаИзЭксплуатации);
		СтруктураДанные.Вставить("ТипСтруктурнойЕдиницыРозницаСуммовойУчет", Ложь);
		
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Источник.ПолучательВозвратаИзЭксплуатации)
			ИЛИ СтруктураДанные.Источник.ПолучательВозвратаИзЭксплуатации.ОрдерныйСклад Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеСтруктурнаяЕдиницаПриИзменении()	

// Получает набор данных с сервера для процедуры СтруктурнаяЕдиницаПолучательПриИзменении.
//
&НаСервере
Функция ПолучитьДанныеСтруктурнаяЕдиницаПолучательПриИзменении(СтруктураДанные)

	ЕстьРозница = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			  ИЛИ Объект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница;
	ЕстьРозницаСуммовойУчет = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет
						  ИЛИ Объект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет;
	
	СтруктураДанные.Вставить("ПодписьКладовщика", СтруктураДанные.Получатель.ПодписьМОЛ);
	
	Если НЕ ЗначениеЗаполнено(СтруктураДанные.Получатель)
		ИЛИ СтруктураДанные.Получатель.ОрдерныйСклад 
		ИЛИ СтруктураДанные.Получатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
		ИЛИ СтруктураДанные.Получатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
		СтруктураДанные.Вставить("ОрдерныйСклад", Ложь);
	Иначе
		СтруктураДанные.Вставить("ОрдерныйСклад", Истина);
	КонецЕсли;
	
	Если СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение Тогда
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиница", СтруктураДанные.Получатель.ИсточникПеремещения);
		СтруктураДанные.Вставить("Ячейка", СтруктураДанные.Получатель.ЯчейкаИсточникаПеремещения);
				
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Получатель.ИсточникПеремещения)
			ИЛИ СтруктураДанные.Получатель.ИсточникПеремещения.ОрдерныйСклад 
			ИЛИ СтруктураДанные.Получатель.ИсточникПеремещения.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			ИЛИ СтруктураДанные.Получатель.ИсточникПеремещения.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Истина);
		КонецЕсли;
		
		ФункциональнаяОпцияЗаказПриПеремещенииВШапке = Объект.ПоложениеЗаказаПокупателя <> Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
		
		Если Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
	 	 ИЛИ Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
			Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыРезерв.Видимость = Ложь;
			Элементы.ЗапасыИзменитьРезерв.Видимость = Ложь;
			ИспользуетсяРезервирование = Ложь;
			
		Иначе
			Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыРезерв.Видимость = Истина;
			Элементы.ЗапасыИзменитьРезерв.Видимость = Истина;
			ИспользуетсяРезервирование = Истина;
			
		КонецЕсли;
		
		Если (Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
		 ИЛИ Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
		   И (Объект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
	 	ИЛИ Объект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет) Тогда
		 	Элементы.ЗаказПокупателя.Видимость = Ложь;
			Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыЗаказПокупателя.Видимость = Ложь;
		Иначе
			Элементы.ЗаказПокупателя.Видимость = ФункциональнаяОпцияЗаказПриПеремещенииВШапке;
			Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыЗаказПокупателя.Видимость = НЕ ФункциональнаяОпцияЗаказПриПеремещенииВШапке;
		КонецЕсли;
		
	ИначеЕсли СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы Тогда	
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиница", СтруктураДанные.Получатель.ИсточникСписанияНаРасходы);
		СтруктураДанные.Вставить("Ячейка", СтруктураДанные.Получатель.ЯчейкаИсточникаСписанияНаРасходы);
		
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Получатель.ИсточникСписанияНаРасходы)
			ИЛИ СтруктураДанные.Получатель.ИсточникСписанияНаРасходы.ОрдерныйСклад Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Истина);
		КонецЕсли;
		
	ИначеЕсли СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию Тогда		
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиница", СтруктураДанные.Получатель.ИсточникПередачиВЭксплуатацию);
		СтруктураДанные.Вставить("Ячейка", СтруктураДанные.Получатель.ЯчейкаИсточникаПередачиВЭксплуатацию);
		
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Получатель.ИсточникПередачиВЭксплуатацию)
			ИЛИ СтруктураДанные.Получатель.ИсточникПередачиВЭксплуатацию.ОрдерныйСклад Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Истина);
		КонецЕсли;
							
	ИначеЕсли СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда	
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиница", СтруктураДанные.Получатель.ИсточникВозвратаИзЭксплуатации);
		СтруктураДанные.Вставить("Ячейка", СтруктураДанные.Получатель.ЯчейкаИсточникаВозвратаИзЭксплуатации);
		
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Получатель.ИсточникВозвратаИзЭксплуатации)
			ИЛИ СтруктураДанные.Получатель.ИсточникВозвратаИзЭксплуатации.ОрдерныйСклад Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Истина);
		КонецЕсли;
						
	КонецЕсли;
	
	АдресДоставки = "";
	МассивВладельцев = Новый Массив;
	МассивВладельцев.Добавить(СтруктураДанные.Получатель);
	
	Адреса = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивВладельцев, , Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
	Если Адреса.Количество() > 0 Тогда
		
		АдресДоставки = Адреса[0].Представление;
		
	КонецЕсли;
	СтруктураДанные.Вставить("АдресДоставки", АдресДоставки);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеСтруктурнаяЕдиницаПолучательПриИзменении()

// Процедура обработки изменения вида операции документа.
//
&НаСервере
Процедура ОбработатьИзменениеВидаОперации()
	
	Если ЗначениеЗаполнено(Объект.ВидОперации)
		И НЕ Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение Тогда
		
		Пользователь = Пользователи.ТекущийПользователь();
		
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойСклад");
		ОсновнойСклад = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
		
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновноеПодразделение");
		ОсновноеПодразделение = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы 
			ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию Тогда
			
			Если НЕ ФункциональнаяОпцияУчетПоНесколькимСкладам Тогда
				
				Объект.СтруктурнаяЕдиница = ОсновнойСклад;
				
			КонецЕсли;
			
			Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить() Тогда
				
				Объект.СтруктурнаяЕдиницаПолучатель = ОсновноеПодразделение;
				
			КонецЕсли;
			
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда
			
			Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить() Тогда
				
				Объект.СтруктурнаяЕдиница = ОсновноеПодразделение;
				
			КонецЕсли;
			
			Если НЕ ФункциональнаяОпцияУчетПоНесколькимСкладам Тогда
				
				Объект.СтруктурнаяЕдиницаПолучатель = ОсновнойСклад;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьВидимостьИДоступность(Истина);
	
КонецПроцедуры // ОбработатьИзменениеВидаОперации()

// ПодключаемоеОборудование
// Процедура получает данные по штрихкодам.
//
&НаСервереБезКонтекста
Процедура ПолучитьДанныеПоШтрихКодам(СтруктураДанные)
	
	// Преобразование весовых штрихкодов.
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ТекШтрихкод);
		
	КонецЦикла;
	
	ДанныеПоШтрихКодам = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодам(СтруктураДанные.МассивШтрихкодов);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		ДанныеШтрихкода = ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если ДанныеШтрихкода <> Неопределено
		   И ДанныеШтрихкода.Количество() <> 0 Тогда
			
			СтруктураДанныеНоменклатуры = Новый Структура();
			СтруктураДанныеНоменклатуры.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
			СтруктураДанныеНоменклатуры.Вставить("ТипНоменклатуры", ДанныеШтрихкода.Номенклатура.ТипНоменклатуры);
			ДанныеШтрихкода.Вставить("СтруктураДанныеНоменклатуры", ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры));
			
			Если НЕ ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения) Тогда
				ДанныеШтрихкода.ЕдиницаИзмерения  = ДанныеШтрихкода.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	СтруктураДанные.Вставить("ДанныеПоШтрихКодам", ДанныеПоШтрихКодам);
	
	Для каждого парам Из Метаданные.Документы.ПеремещениеЗапасов.ТабличныеЧасти.Запасы.Реквизиты.Номенклатура.ПараметрыВыбора Цикл
		Если парам.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(парам.Значение)=Тип("ФиксированныйМассив") Тогда
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", парам.Значение);
			Иначе
			    МассивТипов = Новый Массив;
				МассивТипов.Добавить(парам.Значение);
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", МассивТипов);
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПолучитьДанныеПоШтрихКодам()

&НаКлиенте
Функция ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрикодов)
	
	НеизвестныеШтрихкоды = Новый Массив;
	ШтрихкодыНекорректногоТипа = Новый Массив;
	
	Если ТипЗнч(ДанныеШтрикодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрикодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрикодов);
	КонецЕсли;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("МассивШтрихкодов", МассивШтрихкодов);
	ПолучитьДанныеПоШтрихКодам(СтруктураДанные);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		ДанныеШтрихкода = СтруктураДанные.ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если ДанныеШтрихкода <> Неопределено
		   И ДанныеШтрихкода.Количество() = 0 Тогда
			НеизвестныеШтрихкоды.Добавить(ТекШтрихкод);
		ИначеЕсли СтруктураДанные.ОтборТипНоменклатуры.Найти(ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры) = Неопределено Тогда
			ШтрихкодыНекорректногоТипа.Добавить(Новый Структура("Штрихкод,Номенклатура,ТипНоменклатуры", ТекШтрихкод.Штрихкод, ДанныеШтрихкода.Номенклатура, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры));
		Иначе
			МассивСтрокТЧ = Объект.Запасы.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,ЕдиницаИзмерения",ДанныеШтрихкода.Номенклатура,ДанныеШтрихкода.Характеристика,ДанныеШтрихкода.ЕдиницаИзмерения));
			Если МассивСтрокТЧ.Количество() = 0 Тогда
				НоваяСтрока = Объект.Запасы.Добавить();
				НоваяСтрока.Номенклатура = ДанныеШтрихкода.Номенклатура;
				НоваяСтрока.Характеристика = ДанныеШтрихкода.Характеристика;
				НоваяСтрока.Партия = ДанныеШтрихкода.Партия;
				НоваяСтрока.Количество = ТекШтрихкод.Количество;
				НоваяСтрока.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения), ДанныеШтрихкода.ЕдиницаИзмерения, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЕдиницаИзмерения);
				НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Себестоимость;
				Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
			Иначе
				НоваяСтрока = МассивСтрокТЧ[0];
				НоваяСтрока.Количество = НоваяСтрока.Количество + ТекШтрихкод.Количество;
				НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Себестоимость;
				Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
			Если ДанныеШтрихкода.Свойство("СерийныйНомер") И ЗначениеЗаполнено(ДанныеШтрихкода.СерийныйНомер) Тогда
				РаботаССерийнымиНомерамиКлиентСервер.ДобавитьСерийныйНомерВСтроку(НоваяСтрока, ДанныеШтрихкода.СерийныйНомер, Объект);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа",НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа);КонецФункции // ЗаполнитьПоДаннымШтрихкодов()

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Процедура ПолученыШтрихкоды(ДанныеШтрикодов) Экспорт
	
	Модифицированность = Истина;
	
	НедобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрикодов);
	НеизвестныеШтрихкоды		= НедобавленныеШтрихкоды.НеизвестныеШтрихкоды;
	ШтрихкодыНекорректногоТипа	= НедобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
	
	ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	
	Если НеизвестныеШтрихкоды.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПолученыШтрихкодыЗавершение", ЭтотОбъект, НеизвестныеШтрихкоды);
		
		ОткрытьФорму(
			"РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры",
			Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды), ЭтотОбъект,,,,Оповещение
		);
		
		Возврат;
		
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры // ПолученыШтрихкоды()

&НаКлиенте
Процедура ПолученыШтрихкодыЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт
	
	НеизвестныеШтрихкоды = Параметры;
	
	Если ВозвращаемыеПараметры <> Неопределено Тогда
		
		МассивШтрихкодов = Новый Массив;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ЗарегистрированныеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ПолученыНовыеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		НедобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(МассивШтрихкодов);
		НеизвестныеШтрихкоды		= НедобавленныеШтрихкоды.НеизвестныеШтрихкоды;
		ШтрихкодыНекорректногоТипа	= НедобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
		ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды) Экспорт
	
	Для каждого ТекНеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
		
		СтрокаСообщения = НСтр("ka='მონაცემები შტრიხკოდის მიხედვით ნაპოვნი არ არის: %1%; რაოდენობა: %2%';ru='Данные по штрихкоду не найдены: %1%; количество: %2%';en='Data on the barcode is not found:% 1%; amount% 2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНеизвестныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНеизвестныйШтрихкод.Количество);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа) Экспорт
	
	Для каждого ТекНекорректныйШтрихкод Из ШтрихкодыНекорректногоТипа Цикл
		
		СтрокаСообщения = НСтр("ka='შტრიხკოდ %1%-ით მოძებნილ ნომენკლატურას -%2%- აქვს ტიპი %3%, რომელიც ამ ცხრილის შესაფერი არ არის';ru='Найденная по штрихкоду %1% номенклатура -%2%- имеет тип %3%, который не подходит для этой табличной части';en='Found by barcode nomenclature% 1% -% 2% - 3% of type%, which is not suitable for this table part'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНекорректныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНекорректныйШтрихкод.Номенклатура);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", ТекНекорректныйШтрихкод.ТипНоменклатуры);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

// Конец ПодключаемоеОборудование

// Процедура заполняет колонку Резерв по резервам под заказ.
//
&НаСервере
Процедура ЗаполнитьЗапасыПоОстаткамНаСкладеНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьЗапасыПоОстаткамНаСкладе();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры // ЗаполнитьЗапасыПоОстаткамНаСкладеНаСервере()

// Процедура заполняет колонку Резерв по резервам под заказ.
//
&НаСервере
Процедура ЗаполнитьКолонкуРезервПоРезервамНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьКолонкуРезервПоРезервам();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры // ЗаполнитьКолонкуРезервПоРезервамНаСервере()

//++Lazare
&НаСервере
Процедура ДобавитьОрганиченияНаРедактированиеТЧЗапасы()
	
	ЗапретРедактированияТчЗапасы = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ЗапретНаРедактированиеТабличнойЧастиПеремещениеЗапасов");

	Если ЗапретРедактированияТчЗапасы Тогда 	
		Элементы.Запасы.ТолькоПросмотр 	 = Истина;
		Элементы.Запасы.КоманднаяПанель.Доступность  = Ложь; 
	Иначе 
		Элементы.Запасы.ТолькоПросмотр 	= Ложь;
		Элементы.Запасы.КоманднаяПанель.Доступность = Истина;
	КонецЕсли;
									
КонецПроцедуры 
//--Lazare

#КонецОбласти

#Область ЗаполнениеОбъектов

&НаКлиенте
Процедура СохранитьДокументКакШаблон(Параметр) Экспорт
	
	ЗаполнениеОбъектовУНФКлиент.СохранитьДокументКакШаблон(Объект, ОтображаемыеРеквизиты(), Параметр);
	
КонецПроцедуры

&НаСервере
Функция ОтображаемыеРеквизиты()
	
	Возврат ЗаполнениеОбъектовУНФ.ОтображаемыеРеквизиты(ЭтотОбъект);
	
КонецФункции

#КонецОбласти

#Область КопированиеСтрокТабличныхЧастей

// Процедура - обработчик нажатия кнопки Копировать строки в ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыКопироватьСтроки(Команда)
	
	КопироватьСтроки("Запасы");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Вставить строки в ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыВставитьСтроки(Команда)
	
	ВставитьСтроки("Запасы");
	
КонецПроцедуры

// Вызывает процедуру копирования строк и оповещает пользователя о количестве скопированных.
//
&НаКлиенте
Процедура КопироватьСтроки(ИмяТЧ)
	
	Если КопированиеТабличнойЧастиКлиент.МожноКопироватьСтроки(Объект[ИмяТЧ], Элементы[ИмяТЧ].ТекущиеДанные) Тогда
		КоличествоСкопированных = 0;
		КопироватьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных);
		КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОКопированииСтрок(КоличествоСкопированных);
	КонецЕсли;
	
КонецПроцедуры

// Вызывает процедуру вставки строк и оповещает пользователя о количетсве вставленных.
//
&НаКлиенте
Процедура ВставитьСтроки(ИмяТЧ)
	
	КоличествоСкопированных = 0;
	КоличествоВставленных = 0;
	ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных);
	КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоСкопированных, КоличествоВставленных);
	
КонецПроцедуры

// Выполняет копирование выделенных строк в буфер обмена.
//
&НаСервере
Процедура КопироватьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных)
	
	КопированиеТабличнойЧастиСервер.Копировать(Объект[ИмяТЧ], Элементы[ИмяТЧ].ВыделенныеСтроки, КоличествоСкопированных);
	
КонецПроцедуры

// Вставляет скопированные строки из буфера обмена в выбранную табличную часть.
//
&НаСервере
Процедура ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных)
	
	КопированиеТабличнойЧастиСервер.Вставить(Объект, ИмяТЧ, Элементы, КоличествоСкопированных, КоличествоВставленных);
	ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных);
	
КонецПроцедуры

// Обрабатывает вставленные строки.
//
&НаСервере
Процедура ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных)
	
	Количество = Объект[ИмяТЧ].Количество();
	
	Для Итератор = 1 По КоличествоВставленных Цикл
		
		Строка = Объект[ИмяТЧ][Количество - Итератор];
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
		
		СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		Если НЕ ЗначениеЗаполнено(Строка.ЕдиницаИзмерения) Тогда
			Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПодбором

// Процедура - обработчик события Действие команды Подбор
//
&НаКлиенте
Процедура Подбор(Команда)
	
	ИмяТабличнойЧасти 	= "Запасы";
	
	Если НЕ ПустаяСтрока(ПараметрыОткрытияПодбора[ИмяТабличнойЧасти]) Тогда
		
		ПодборНоменклатурыВДокументахКлиент.ОткрытьПодбор(ЭтотОбъект, ИмяТабличнойЧасти, ПараметрыОткрытияПодбора[ИмяТабличнойЧасти]);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("Период", 				Объект.Дата);
	ПараметрыПодбора.Вставить("Организация", 			Компания);
	
	ПараметрыПодбора.Вставить("СтруктурнаяЕдиница", 	Объект.СтруктурнаяЕдиница);
	ПараметрыПодбора.Вставить("ИспользуетсяРезервирование", ИспользуетсяРезервирование);
	
	ПараметрыПодбора.Вставить("ОтображатьКолонкуЦена", 	Ложь);
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("ТипНоменклатуры", ТипНоменклатуры);
	
	СтатусПартии = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Партия"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.Статус" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					СтатусПартии.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				СтатусПартии.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПодбора.Вставить("СтатусПартии", СтатусПартии);
	
	ПараметрыПодбора.Вставить("УникальныйИдентификаторФормыВладельца", УникальныйИдентификатор);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбора", ПараметрыПодбора, ЭтотОбъект);
	
КонецПроцедуры // ПодборВыполнить()

// Функция получает список товаров из временного хранилища
//
&НаСервере
Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьХарактеристики, ЕстьПартии)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		НоваяСтрока = Объект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
		
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

// ПодключаемоеОборудование
// Процедура - обработчик команды командной панели табличной части.
//
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ТекШтрихкод = "";
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект, Новый Структура("ТекШтрихкод", ТекШтрихкод)), ТекШтрихкод, НСтр("ka='შეიყვანეთ შტრიხკოდი';ru='Введите штрихкод';en='enter the barcode'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ТекШтрихкод = ?(Результат = Неопределено, ДополнительныеПараметры.ТекШтрихкод, Результат);
    
    
    Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
        ПолученыШтрихкоды(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1));
    КонецЕсли;

КонецПроцедуры // ПоискПоШтрихкоду()

// Процедура - обработчик события Действие команды ПолучитьВес
//
&НаКлиенте
Процедура ПолучитьВес(Команда)
	
	ПодключаемоеОборудованиеУНФКлиент.ПолучениеВесаСЭлектронныхВесовДляТабличнойЧасти(ЭтотОбъект, "Запасы");
	
КонецПроцедуры // ПолучитьВес()

&НаКлиенте
Процедура ПолучитьВесЗавершение(Параметры) Экспорт
	
	СтрокаТабличнойЧасти = Параметры;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Себестоимость;
	
КонецПроцедуры

// Процедура - обработчик команды ЗагрузитьДанныеИзТСД.
//
&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ПодключаемоеОборудованиеУНФКлиент.ПолучитьДанныеИзТСД(ЭтотОбъект);
	
КонецПроцедуры // ЗагрузитьДанныеИзТСД()

// Конец ПодключаемоеОборудование

#КонецОбласти

#Область УправлениеВнешнимВидомФормы

// Процедура устанавливает доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность(ВидОперацииПриИзменении = Ложь)
	
	ФункциональнаяОпцияЗаказПриПеремещенииВШапке = Объект.ПоложениеЗаказаПокупателя <> Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
	
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Склад);
	НовыйМассив.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Розница);
	НовыйМассив.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет);
	Если Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство.Получить() Тогда
		НовыйМассив.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Подразделение);
	КонецЕсли;
	МассивСкладПодразделениеРозница = Новый ФиксированныйМассив(НовыйМассив);
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Подразделение);
	МассивПодразделение = Новый ФиксированныйМассив(НовыйМассив);
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Склад);
	МассивСклад = Новый ФиксированныйМассив(НовыйМассив);
	//Паганини_
	ЭтаПеремещение = (Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение);
	//_Паганини
	
	Если Объект.ПоложениеЯчейкиВПеремещенииЗапасов <> Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
		Элементы.Ячейка.Видимость = Истина;
		Элементы.ЗапасыЯчейка.Видимость = Ложь;
	Иначе
		Элементы.Ячейка.Видимость = Ложь;
		Элементы.ЗапасыЯчейка.Видимость = Истина;
	КонецЕсли;
	
	
	Если ЭтаПеремещение Тогда
		
		ЭтотОбъект.Элементы.СчетЗатрат.Видимость = Ложь;
		ЭтотОбъект.Элементы.СчетЗатратРегл.Видимость = Ложь; //+++
		ЭтотОбъект.Элементы.НаправлениеДеятельности.Видимость = Ложь;
		ЭтотОбъект.Элементы.ЗаказПокупателя.Видимость = ФункциональнаяОпцияЗаказПриПеремещенииВШапке;
		ЭтотОбъект.Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыЗаказПокупателя.Видимость = НЕ ФункциональнаяОпцияЗаказПриПеремещенииВШапке;
		Элементы.ЗапасыПодбор.Видимость = Истина;
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", МассивСкладПодразделениеРозница);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		ЭтотОбъект.Элементы.СтруктурнаяЕдиница.ПараметрыВыбора = НовыеПараметры;
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", МассивСкладПодразделениеРозница);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		ЭтотОбъект.Элементы.СтруктурнаяЕдиницаПолучатель.ПараметрыВыбора = НовыеПараметры;
		
		Если Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			ИЛИ Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
			Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыРезерв.Видимость = Ложь;
			Элементы.ЗапасыИзменитьРезерв.Видимость = Ложь;
			ИспользуетсяРезервирование = Ложь;
		Иначе
			Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыРезерв.Видимость = Истина;
			Элементы.ЗапасыИзменитьРезерв.Видимость = Истина;
			ИспользуетсяРезервирование = Истина;
		КонецЕсли;
		
		Если (Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			ИЛИ Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
			И (Объект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
	 	ИЛИ Объект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет) Тогда
			Элементы.ЗаказПокупателя.Видимость = Ложь;
			Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыЗаказПокупателя.Видимость = Ложь;
		Иначе
			Элементы.ЗаказПокупателя.Видимость = ФункциональнаяОпцияЗаказПриПеремещенииВШапке;
			Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыЗаказПокупателя.Видимость = НЕ ФункциональнаяОпцияЗаказПриПеремещенииВШапке;
		КонецЕсли;
		
		Элементы.СтруктурнаяЕдиница.Видимость = Истина;
		//Паганини_
		//Элементы.СтруктурнаяЕдиницаПолучатель.Видимость = Истина;
		Если ВидОперацииПриИзменении Тогда
			ЗаполнитьСтруктурныеЕдиницыПолучателейИУстановитьВидимость("ВидОперацииПриИзменении");
		КонецЕсли;
		ЭтотОбъект.Элементы.СтруктурнаяЕдиницаКонечныйПолучатель.ПараметрыВыбора = НовыеПараметры;
		//_Паганини
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы Тогда
		
		ЭтотОбъект.Элементы.СчетЗатрат.Видимость = Истина;
		ЭтотОбъект.Элементы.СчетЗатратРегл.Видимость = Истина;
		Если НЕ ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
			ЭтотОбъект.Элементы.НаправлениеДеятельности.Видимость = ПолучитьВидимостьНаправленияДеятельности(Объект.СчетЗатрат);//+++ Дмгг
		Иначе   //+++ Дмгг
			ЭтотОбъект.Элементы.НаправлениеДеятельности.Видимость = ПолучитьВидимостьНаправленияДеятельности(Объект.СчетЗатратРегл);//+++ Дмгг
		КонецЕсли;//+++ Дмгг
		ЭтотОбъект.Элементы.ЗаказПокупателя.Видимость = ФункциональнаяОпцияЗаказПриПеремещенииВШапке;
		ЭтотОбъект.Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыЗаказПокупателя.Видимость = НЕ ФункциональнаяОпцияЗаказПриПеремещенииВШапке;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыРезерв.Видимость = Истина;
		Элементы.ЗапасыИзменитьРезерв.Видимость = Истина;
		Элементы.ЗапасыПодбор.Видимость = Истина;
		ИспользуетсяРезервирование = Истина;
				
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", МассивСклад);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		ЭтотОбъект.Элементы.СтруктурнаяЕдиница.ПараметрыВыбора = НовыеПараметры;
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", МассивПодразделение);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		ЭтотОбъект.Элементы.СтруктурнаяЕдиницаПолучатель.ПараметрыВыбора = НовыеПараметры;
		
		Если НЕ ФункциональнаяОпцияУчетПоНесколькимСкладам Тогда
			
			Элементы.СтруктурнаяЕдиница.Видимость = Ложь;
			
		Иначе	
			
			Элементы.СтруктурнаяЕдиница.Видимость = Истина;
			
		КонецЕсли;
		
		Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить() Тогда
			
			Элементы.СтруктурнаяЕдиницаПолучатель.Видимость = Ложь;
			
		Иначе
			
			Элементы.СтруктурнаяЕдиницаПолучатель.Видимость = Истина;
			
		КонецЕсли;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию Тогда
		
		Элементы.СчетЗатрат.Видимость = Истина;
		Элементы.СчетЗатратРегл.Видимость = Истина;
		Если НЕ ИспользоватьТолькоРегламентированныйПланСчетов Тогда //+++ Дмгг
			Элементы.НаправлениеДеятельности.Видимость = ПолучитьВидимостьНаправленияДеятельности(Объект.СчетЗатрат);
		Иначе //+++ Дмгг
			Элементы.НаправлениеДеятельности.Видимость = ПолучитьВидимостьНаправленияДеятельности(Объект.СчетЗатратРегл); //+++ Дмгг
		КонецЕсли; //+++ Дмгг
		Элементы.ЗаказПокупателя.Видимость = Ложь;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыЗаказПокупателя.Видимость = Ложь;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыРезерв.Видимость = Ложь;
		Элементы.ЗапасыИзменитьРезерв.Видимость = Ложь;
		Элементы.ЗапасыПодбор.Видимость = Истина;
		ИспользуетсяРезервирование = Ложь;
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", МассивСклад);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		ЭтотОбъект.Элементы.СтруктурнаяЕдиница.ПараметрыВыбора = НовыеПараметры;
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", МассивПодразделение);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		ЭтотОбъект.Элементы.СтруктурнаяЕдиницаПолучатель.ПараметрыВыбора = НовыеПараметры;
		
		Для каждого СтрокаЗапасы Из Объект.Запасы Цикл
			СтрокаЗапасы.Резерв = 0;
		КонецЦикла;
		
		Если НЕ ФункциональнаяОпцияУчетПоНесколькимСкладам Тогда
			
			Элементы.СтруктурнаяЕдиница.Видимость = Ложь;
			
		Иначе
			
			Элементы.СтруктурнаяЕдиница.Видимость = Истина;
			
		КонецЕсли;
		
		Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить() Тогда
			
			Элементы.СтруктурнаяЕдиницаПолучатель.Видимость = Ложь;
			
		Иначе
			
			Элементы.СтруктурнаяЕдиницаПолучатель.Видимость = Истина;
			
		КонецЕсли;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда
		
		Элементы.СчетЗатрат.Видимость = Ложь;
		Элементы.СчетЗатратРегл.Видимость = Ложь;
		Элементы.НаправлениеДеятельности.Видимость = Ложь;
		Элементы.ЗаказПокупателя.Видимость = Ложь;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыЗаказПокупателя.Видимость = Ложь;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыРезерв.Видимость = Ложь;
		Элементы.ЗапасыИзменитьРезерв.Видимость = Ложь;
		Элементы.ЗапасыПодбор.Видимость = Ложь;
		ИспользуетсяРезервирование = Ложь;
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", МассивПодразделение);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		ЭтотОбъект.Элементы.СтруктурнаяЕдиница.ПараметрыВыбора = НовыеПараметры;
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", МассивСклад);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		ЭтотОбъект.Элементы.СтруктурнаяЕдиницаПолучатель.ПараметрыВыбора = НовыеПараметры;
		
		Для каждого СтрокаЗапасы Из Объект.Запасы Цикл
			СтрокаЗапасы.Резерв = 0;
		КонецЦикла;
		
		Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить() Тогда
			
			Элементы.СтруктурнаяЕдиница.Видимость = Ложь;
			
		Иначе
			
			Элементы.СтруктурнаяЕдиница.Видимость = Истина;
			
		КонецЕсли;
		
		Если НЕ ФункциональнаяОпцияУчетПоНесколькимСкладам Тогда
			
			Элементы.СтруктурнаяЕдиницаПолучатель.Видимость = Ложь;
			
		Иначе
			
			Элементы.СтруктурнаяЕдиницаПолучатель.Видимость = Истина;
			
		КонецЕсли;
		
	Иначе
		
		Элементы.СтруктурнаяЕдиница.Видимость = Истина;
		Элементы.СтруктурнаяЕдиницаПолучатель.Видимость = Истина;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыСтранаПроисхождения", "Видимость", Объект.ВидОперации <> Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыНомерГТД", "Видимость", Объект.ВидОперации <> Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение);
	
	Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыСебестоимость.Видимость = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет;
	Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыСумма.Видимость = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет;
	
	Если НЕ ИспользоватьТолькоРегламентированныйПланСчетов Тогда  //+++ Дмгг
		Элементы.НаправлениеДеятельности.Видимость = Объект.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы;
	Иначе 
		Элементы.НаправлениеДеятельности.Видимость = Объект.СчетЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы;
	КонецЕсли;
	//--- Дмгг	
	УчетПоЯчейкам = ПолучитьФункциональнуюОпцию("УчетПоЯчейкам");
	УстановитьВидимостьЯчейки();
	УстановитьВидимостьЯчейкиПолучатель();
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

// Получает признак Ордерного склада.
//
&НаСервере
Процедура УстановитьВидимостьЯчейки()
	
	СтрокаРеквизитов = "ТипСтруктурнойЕдиницы, ОрдерныйСклад";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СтруктурнаяЕдиница, СтрокаРеквизитов);
	
	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) 
		И НЕ ЗначенияРеквизитов.ОрдерныйСклад
		И НЕ ЗначенияРеквизитов.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
		И НЕ ЗначенияРеквизитов.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет 
		И УчетПоЯчейкам Тогда
		
		//Элементы.Ячейка.Видимость = Истина;
		Элементы.СтруктурнаяЕдиница.АвтоМаксимальнаяШирина = Ложь;
	Иначе
		Элементы.Ячейка.Видимость = Ложь;
		Элементы.ЗапасыЯчейка.Видимость = Ложь;
		Элементы.СтруктурнаяЕдиница.АвтоМаксимальнаяШирина = Истина;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьЯчейки()

//+++ Дмгг
&НаСервере
Процедура УстановитьВидимостиЯчейкиВА()
	
	ЗначениеВидимости = Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС;
	
	Элементы.ЗапасыВнеоборотныйАктив.Видимость = ЗначениеВидимости;
	Элементы.СтруктурнаяЕдиницаПолучатель.Видимость = НЕ ЗначениеВидимости;
	Элементы.ЗаказПокупателя.Видимость = НЕ ЗначениеВидимости;
	Элементы.СчетЗатрат.Видимость = НЕ ЗначениеВидимости;
	Элементы.СчетЗатратРегл.Видимость = НЕ ЗначениеВидимости;
	Элементы.НаправлениеДеятельности.Видимость = НЕ ЗначениеВидимости;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЯчейкиПолучатель()
	
	СтрокаРеквизитов = "ТипСтруктурнойЕдиницы, ОрдерныйСклад";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СтруктурнаяЕдиницаПолучатель, СтрокаРеквизитов);
	
	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаПолучатель) 
		И НЕ ЗначенияРеквизитов.ОрдерныйСклад
		И НЕ ЗначенияРеквизитов.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
		И НЕ ЗначенияРеквизитов.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет
		И УчетПоЯчейкам Тогда
		
		Элементы.ЯчейкаПолучатель.Видимость = Истина;
		Элементы.СтруктурнаяЕдиницаПолучатель.АвтоМаксимальнаяШирина = Ложь;
		//Паганини_
	    Элементы.СтруктурнаяЕдиницаКонечныйПолучатель.АвтоМаксимальнаяШирина = Ложь;
		//_Паганини
	Иначе
		Элементы.ЯчейкаПолучатель.Видимость = Ложь;
		Элементы.СтруктурнаяЕдиницаПолучатель.АвтоМаксимальнаяШирина = Истина;
		//Паганини_
	    Элементы.СтруктурнаяЕдиницаКонечныйПолучатель.АвтоМаксимальнаяШирина = Истина;
		//_Паганини
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьЯчейкиПолучателя()

&НаСервере
// Процедура устанавливает видимость реквизитов формы от опции
// Использовать подсистему Производство.
//
// Параметры:
// Нет.
//
Процедура УстановитьВидимостьОтФОИспользоватьПодсистемуПроизводство()
	
	// Производство.
	Если Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство.Получить() Тогда
		
		// Установка способа выбора структурной единицы в зависимости от ФО.
		Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить()
			И НЕ ФункциональнаяОпцияУчетПоНесколькимСкладам Тогда
			
			Элементы.СтруктурнаяЕдиница.РежимВыбораИзСписка = Истина;
			Элементы.СтруктурнаяЕдиница.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
			Элементы.СтруктурнаяЕдиница.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
			
			Элементы.СтруктурнаяЕдиницаПолучатель.РежимВыбораИзСписка = Истина;
			Элементы.СтруктурнаяЕдиницаПолучатель.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
			Элементы.СтруктурнаяЕдиницаПолучатель.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
			//Паганини_
			Элементы.СтруктурнаяЕдиницаКонечныйПолучатель.РежимВыбораИзСписка = Истина;
			Элементы.СтруктурнаяЕдиницаКонечныйПолучатель.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
			Элементы.СтруктурнаяЕдиницаКонечныйПолучатель.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
			//_Паганини
		КонецЕсли;
		
	КонецЕсли;
	
	Если Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство.Получить()
		ИЛИ ФункциональнаяОпцияУчетПоНесколькимСкладам Тогда
		
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение, НСтр("ka='მარაგების გადაადგილება';ru='Перемещение';en='displacement'"));
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы;
		
	КонецЕсли;
	
	Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы, НСтр("ka='ხარჯებზე ჩამოწერა';ru='Списание на расходы';en='Deduction of expenses'"));
	Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию, НСтр("ka='ექსპლუატაციაში გადაცემა';ru='Передача в эксплуатацию';en='Transfer into operation'"));
	Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации, НСтр("ka='ექსპლუატაციიდან დაბრუნება';ru='Возврат из эксплуатации';en='Return of service'"));
	Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС, НСтр("ka='მარაგების ძ/ს–ზე ჩამოწერა';ru='Списание таваров на ОС';en='Write-off of Tawara OS'"));//+++ Дмгг
	
КонецПроцедуры // УстановитьВидимостьОтФОИспользоватьПодсистемуПроизводство()

//+++ Дмгг
&НаСервере
Процедура УстановитьВидимостиСчетовЗатрат()
	
	ЗначениеВидимости = Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы;
	
	Элементы.СчетЗатрат.Видимость = ЗначениеВидимости;
	Элементы.СчетЗатратРегл.Видимость = ЗначениеВидимости;
	
	//ПодольскийАИ #УчетПроектов 05.10.2020 {
	Элементы.Проект.Видимость = ЗначениеВидимости; //И УчетПоПроектам;
	Элементы.ЗапасыПроект.Видимость = ЗначениеВидимости; //И УчетПоПроектам;
	//ПодольскийАИ #УчетПроектов 05.10.2020 }
	
КонецПроцедуры


#КонецОбласти

#Область РаботаССерийнымиНомерами

&НаКлиенте
Процедура ЗапасыСерийныеНомераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерийныеНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерийныеНомера()
		
	ТекущиеДанныеИдентификатор = Элементы.Запасы.ТекущиеДанные.ПолучитьИдентификатор();
	ПараметрыСерийныхНомеров = ПараметрыПодбораСерийныхНомеров(ТекущиеДанныеИдентификатор);
	
	ОткрытьФорму("Обработка.ПодборСерийныхНомеров.Форма", ПараметрыСерийныхНомеров, ЭтотОбъект);

КонецПроцедуры

Функция ПолучитьСерийныеНомераИзХранилища(АдресВоВременномХранилище, КлючСтроки)
	
	Модифицированность = Истина;
	Возврат РаботаСФормойДокумента.ПолучитьСерийныеНомераИзХранилища(Объект, АдресВоВременномХранилище, КлючСтроки);
	
КонецФункции

Функция ПараметрыПодбораСерийныхНомеров(ТекущиеДанныеИдентификатор)
	
	Возврат РаботаСФормойДокумента.ПараметрыПодбораСерийныхНомеров(Объект, ЭтотОбъект.УникальныйИдентификатор, ТекущиеДанныеИдентификатор, Истина);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура ЭлектроннаяНакладнаяНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьВозможностьСозданияЭЛНакладной() Тогда 
		Возврат;	
	КонецЕсли;
	
	
	ПараметрыФормы   = Новый Структура;
	массивДокументов = Новый Массив;
	массивДокументов.Добавить(Объект.Ссылка);
	ПараметрыФормы.Вставить("ДокументыОснования", массивДокументов);
	
	УправлениеНебольшойФирмойКлиент.ОткрытьЭлНакладную(ЭтотОбъект,ПараметрыФормы);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ОбработкаНавигационнойСсылки");
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВозможностьСозданияЭЛНакладной()
	
	Результат = Истина;
	Если Модифицированность Или НЕ ПроверитьЗаполнение() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='დოკუმენტი შეიცვალა. თავდაპირველად, საჭიროა დოკუმენტის ჩაწერა!';ru='Документ был изменен. Сначала следует записать документ!';en='The document has been changed. First, you must write the document!'");	
		Сообщение.Сообщить();
		Результат = Ложь;
	Иначе
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВШаблонRS(Команда)
		
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		ТекстСообщение = НСтр("ka='აუცილებელია დოკუმენტის ჩაწერა. ჩაიწეროს?';ru='Документ должен быть записан. Записать?';en='The document should be written. Record?'");
		Если Вопрос(ТекстСообщение, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Попытка
				Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
			Исключение
				Возврат;
			КонецПопытки;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	Текст = "ru = ""Таблица XLS""; en = ""XLS table""";
	Фильтр = НСтр(Текст)+"(*.xls)|*.xls";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Заголовок = "Выберите путь для сохранения";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
	Иначе
		Текст = "Путь сохранения не выбран!";
		Предупреждение(Текст);
		Возврат;
	КонецЕсли;	
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ВыгрузитьВШаблонRS(Объект.Ссылка, ПутьКФайлу);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетЗатратРеглПриИзменении(Элемент)
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(Объект.СчетЗатратРегл, Объект.СчетЗатрат);
	СчетЗатратПриИзменении(Элементы.СчетЗатрат)
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств(Команда)
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры // Подключаемый_РедактироватьСоставСвойств()

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// СтандартныеПодсистемы.Свойства

#КонецОбласти


&НаКлиенте
Процедура ЗаполнитьДоМинимальногоОстатка(Команда)
	ОчиститьСообщения();
	Если Объект.Запасы.Количество() > 0 Тогда
		Ответ = Неопределено;
		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаЗаполнитьДоМинимальногоОстатка", ЭтотОбъект), НСтр("ka='ცხრილი გასუფთავდება! გავაგრძელოთ ოპერაციის შესრულება?';ru='Табличная часть будет очищена! Продолжить выполнение операции?';en='Tabular section will be cleared! To continue the operation?'"), РежимДиалогаВопрос.ДаНет, 0);
        Возврат; 
	КонецЕсли;
	ЗаполнитьДоМинимальногоОстаткаНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура КомандаЗаполнитьДоМинимальногоОстатка(Результат, ДополнительныеПараметры) Экспорт
    
    Ответ = Результат;
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли; 
    
    ЗаполнитьДоМинимальногоОстаткаНаСервере();

КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДоМинимальногоОстаткаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МинимальныеОстаткиСкладаСрезПоследних.Номенклатура,
		|	СУММА(МинимальныеОстаткиСкладаСрезПоследних.Количество) КАК Количество
		|ПОМЕСТИТЬ Лимиты
		|ИЗ
		|	РегистрСведений.МинимальныеОстаткиСклада.СрезПоследних(&Дата, СтруктурнаяЕдиница = &СтруктурнаяЕдиницаПолучатель) КАК МинимальныеОстаткиСкладаСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	МинимальныеОстаткиСкладаСрезПоследних.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыОстаткиИОбороты.Номенклатура,
		|	СУММА(ВЫБОР
		|			КОГДА ЗапасыОстаткиИОбороты.СтруктурнаяЕдиница = &СтруктурнаяЕдиницаОтправитель
		|				ТОГДА ЗапасыОстаткиИОбороты.КоличествоОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстатокОтправителя,
		|	СУММА(ВЫБОР
		|			КОГДА ЗапасыОстаткиИОбороты.СтруктурнаяЕдиница = &СтруктурнаяЕдиницаПолучатель
		|				ТОГДА ЗапасыОстаткиИОбороты.КоличествоОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстатокПолучателя
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.Запасы.ОстаткиИОбороты(
		|			,
		|			,
		|			Авто,
		|			,
		|			Номенклатура В
		|					(ВЫБРАТЬ
		|						Лимиты.Номенклатура
		|					ИЗ
		|						Лимиты КАК Лимиты)
		|				И СтруктурнаяЕдиница В (&СтруктурнаяЕдиницаОтправитель, &СтруктурнаяЕдиницаПолучатель)) КАК ЗапасыОстаткиИОбороты
		|ГДЕ
		|	НЕ ЗапасыОстаткиИОбороты.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстаткиИОбороты.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лимиты.Номенклатура КАК Номенклатура,
		|	Лимиты.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА Лимиты.Количество - Остатки.ОстатокПолучателя < Остатки.ОстатокОтправителя
		|			ТОГДА Лимиты.Количество - Остатки.ОстатокПолучателя
		|		ИНАЧЕ Остатки.ОстатокОтправителя
		|	КОНЕЦ КАК Количество,
		|	ЕСТЬNULL(Остатки.ОстатокОтправителя, 0) > 0
		|		И Лимиты.Количество - ЕСТЬNULL(Остатки.ОстатокПолучателя, 0) > 0 КАК Загружать,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Остатки.ОстатокОтправителя, 0) = 0
		|				И Лимиты.Количество - ЕСТЬNULL(Остатки.ОстатокПолучателя, 0) > 0
		|			ТОГДА ИСТИНА
		|		КОГДА Остатки.ОстатокОтправителя > 0
		|				И Лимиты.Количество - ЕСТЬNULL(Остатки.ОстатокПолучателя, 0) - ЕСТЬNULL(Остатки.ОстатокОтправителя, 0) > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеХватаетОстатков,
		|	Лимиты.Количество КАК Лимит,
		|	Лимиты.Количество - ЕСТЬNULL(Остатки.ОстатокПолучателя, 0) - ЕСТЬNULL(Остатки.ОстатокОтправителя, 0) КАК НеХватает,
		|	ПРЕДСТАВЛЕНИЕ(&СтруктурнаяЕдиницаОтправитель) КАК Отправитель
		|ИЗ
		|	Лимиты КАК Лимиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО Лимиты.Номенклатура = Остатки.Номенклатура";
	Запрос.УстановитьПараметр("Дата", 							?(Объект.Ссылка.Пустая() И НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДата()), ТекущаяДата(), Объект.Дата));
	Запрос.УстановитьПараметр("Ссылка", 						Объект.Ссылка);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиницаОтправитель",	Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиницаПолучатель",	?(ЧерезТранзитныйСклад, Объект.СтруктурнаяЕдиницаКонечныйПолучатель, Объект.СтруктурнаяЕдиницаПолучатель));
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Объект.Запасы.Очистить();
	ЗагрузаемыеСтроки = Таблица.НайтиСтроки(Новый Структура("Загружать", Истина));
	Для Каждого СтрокаЗ ИЗ ЗагрузаемыеСтроки Цикл 
		НовСтрока = Объект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаЗ);
	КонецЦикла;
	
	ТаблицаНеХватаетОстатков = Таблица.НайтиСтроки(Новый Структура("НеХватаетОстатков", Истина));
	Для Каждого СтрокаТЧ ИЗ ТаблицаНеХватаетОстатков Цикл
		Сообщить(НСтр("ka='ნომენკლატურა ""';ru='Номенклатура ""';en='Nomenclature ""'") + СтрокаТЧ.Номенклатура + НСтр("ka='"" საწყობში ""';ru='"" на складу ""';en='""In stock""'") + СтрокаТЧ.Отправитель +
				 НСтр("ka='"" თარიღზე ""';ru='"" на дату ""';en='"" on the date ""'") + Строка(Объект.Дата) +
				 НСтр("ka='"" არასაკმარისია ლიმიტის შესავსებად. დანაკლისი:';ru='"" не хватает для заполнения лимитов. Не хватает:';en='""Is not enough to fill the limits are not enough.:'") +
				 Строка(СтрокаТЧ.НеХватает) + НСтр("ka=', ლიმიტი:';ru=', Лимит:';en=', Limit:'") + Строка(СтрокаТЧ.Лимит));
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция МассивПринятыхВА()
	
	ДатаЗапроса = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата-1, ТекущаяДата());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив
		|ИЗ
		|	РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(&НаДату, ) КАК СостоянияВнеоборотныхАктивовСрезПоследних
		|ГДЕ
		|	СостоянияВнеоборотныхАктивовСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВнеоборотныхАктивов.ПринятКУчету)";
	
	Запрос.УстановитьПараметр("НаДату", ДатаЗапроса);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВнеоборотныйАктив");	
	
КонецФункции


&НаКлиенте
Процедура ЗапасыВнеоборотныйАктивИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	МассивПринятыхВА = МассивПринятыхВА();
	НовыйПараметрСсылки = Новый ПараметрВыбора("Отбор.Ссылка", МассивПринятыхВА);
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметрСсылки);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ЗапасыВнеоборотныйАктив.ПараметрыВыбора = НовыеПараметры;	// Вставить содержимое обработчика.
	
КонецПроцедуры


&НаКлиенте
Процедура СтруктурнаяЕдиницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС") Тогда 
		
		НовыйПараметрСсылки = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад"));
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметрСсылки);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.СтруктурнаяЕдиница.ПараметрыВыбора = НовыеПараметры;
		
	КонецЕсли;	
	
КонецПроцедуры

// Kuzmich, 16.07.2019, Заполнение Перемещения из заказа покупателя
&НаКлиенте
Процедура ЗаполнитьПоЗаказуПокупателя(ВыбранноеЗначение)
	Если ТипЗНЧ(ВыбранноеЗначение)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		МассивСтрок = ЗаполнитьПоЗаказуПокупателяНаСервере(ВыбранноеЗначение);
		Для каждого СтрМассивСтрок Из МассивСтрок Цикл
		
			СтрокаТабличнойЧасти = Объект.Запасы.НайтиПоИдентификатору(СтрМассивСтрок);
			Если НЕ СтрокаТабличнойЧасти = НЕОПРЕДЕЛЕНО Тогда
			
				ЗапасыНоменклатураПриИзменении(НЕОПРЕДЕЛЕНО, СтрокаТабличнойЧасти);
				РассчитатьСуммуВСтрокеТабличнойЧасти();
				СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Себестоимость;
				ЗапасыСтранаПроисхожденияПриИзменении(НЕОПРЕДЕЛЕНО, СтрокаТабличнойЧасти);
				ЗапасыНомерГТДПриИзменении(НЕОПРЕДЕЛЕНО, СтрокаТабличнойЧасти);
			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПоЗаказуПокупателяНаСервере(ВыбранноеЗначение)
	ПЕРЕМ РЕЗ;
	
	РЕЗ = Новый Массив();
	
	Для каждого СтрЗапасыЗаказПокупателя Из ВыбранноеЗначение.Запасы Цикл
		
		СтруктураПоиска = Новый Структура("Номенклатура,Характеристика,СерийныеНомера,Партия,НомерГТД,ЗаказПокупателя");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрЗапасыЗаказПокупателя);
		МассивНайденныхСтрок = Объект.Запасы.НайтиСтроки(СтруктураПоиска);
		
		Если МассивНайденныхСтрок.Количество()=0 Тогда
			СтрокаТабличнойЧасти = Объект.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтрЗапасыЗаказПокупателя);
			СтрокаТабличнойЧасти.ЗаказПокупателя = ВыбранноеЗначение.Ссылка;
			РЕЗ.Добавить(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РЕЗ;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоЗаказамПокупателя(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СостояниеЗаказа", Справочники_СостоянияЗаказовПокупателей_Собран());
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
	ПараметрыФормы.Вставить("МножественныйВыбор", ИСТИНА);
	
	ОткрытьФорму("Документ.ЗаказПокупателя.ФормаВыбора",ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция Справочники_СостоянияЗаказовПокупателей_Собран()
	Возврат Справочники.СостоянияЗаказовПокупателей.Собран;
КонецФункции
// Kuzmich, 16.07.2019, Заполнение Перемещения из заказа покупателя

//Паганини_
&НаКлиенте
Процедура ЗапасыКоличествоВДорогеПриИзменении(Элемент)
	ТекДанные = Элементы.Запасы.ТекущиеДанные;
	Если ТекДанные.КоличествоВДороге > ТекДанные.Количество Тогда
		Предупреждение(НСТР("ka='""რაოდენობა გზაში"" არ უნდა იყოს მეტი ""რაოდენობაზე""';ru='""Количество в дороге"" не должно быть больше количества';en='""Number of the road"" should not be greater than the number'"), 20);
		ТекДанные.КоличествоВДороге = ТекДанные.Количество;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДатаПеремещенияИзТранзитаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДатаПеремещенияИзТранзита) И Объект.ДатаПеремещенияИзТранзита <= Объект.Дата Тогда
		Предупреждение(НСТР("ka='ტრანზიტიდან გადაადგილების თარიღი უნდა იყოს დოკუმენტის თარიღზე მეტი.';ru='Дата перемещения из транзита должно быть больше даты документа.';en='Date of transit movement must be greater than the document date.'"), 20);
		Объект.ДатаПеремещенияИзТранзита = Объект.Дата + 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапонитьКоличествоВДороге(Команда)
	Для Каждого СтрокаТЧ Из Объект.Запасы Цикл
		СтрокаТЧ.КоличествоВДороге = СтрокаТЧ.Количество;
	КонецЦикла;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКоличествоВДороге(Команда)
	Для Каждого СтрокаТЧ Из Объект.Запасы Цикл
		СтрокаТЧ.КоличествоВДороге = 0;
	КонецЦикла;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЧерезТранзитныйСкладПриИзменении(Элемент)
	ЗаполнитьСтруктурныеЕдиницыПолучателейИУстановитьВидимость("ЧерезТранзитныйСкладПриИзменении");
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаКонечныйПолучательПриИзменении(Элемент)
	ЗаполнитьСтруктурныеЕдиницыПолучателейИУстановитьВидимость("СтруктурнаяЕдиницаКонечныйПолучательПриИзменении");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктурныеЕдиницыПолучателейИУстановитьВидимость(ИмяСобытия)
	
	ЭтаПеремещение 			= (Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение);
	ЧерезТранзитныйСклад 	= Объект.ЧерезТранзитныйСклад И ЭтаПеремещение;
	
	//Если ЗначениеЗаполнено(Объект.ДокументПеремещенияВТранзит) Тогда
	//	ТолькоПросмотр = Истина;
	//КонецЕсли;
	
	Элементы.СтруктурнаяЕдиницаКонечныйПолучатель.Видимость = ЧерезТранзитныйСклад;
	Элементы.СтруктурнаяЕдиницаПолучатель.ТолькоПросмотр 	= ЧерезТранзитныйСклад;
	Элементы.ЯчейкаПолучатель.ТолькоПросмотр 				= ЧерезТранзитныйСклад;
	
	Если ИмяСобытия = "ЧерезТранзитныйСкладПриИзменении" ИЛИ
		 ИмяСобытия = "ПриСозданииНаСервере" ИЛИ
		 ИмяСобытия = "ВидОперацииПриИзменении" Тогда
		 
		ЗначениеЗаполнено_ДокументПеремещенияВТранзит = ЗначениеЗаполнено(Объект.ДокументПеремещенияВТранзит); 
		 
		Элементы.ДатаПеремещенияИзТранзита.Видимость	= ЧерезТранзитныйСклад;
		Элементы.ЗапасыКоличествоВДороге.Видимость 		= ЧерезТранзитныйСклад;
		Элементы.ЗапасыЗаполнитьОчистить.Видимость		= ЧерезТранзитныйСклад;
		Элементы.ДокументПеремещенияВТранзит.Видимость	= ЗначениеЗаполнено_ДокументПеремещенияВТранзит;
		Элементы.ДокументОснованиеНадпись.Доступность	= НЕ ЗначениеЗаполнено_ДокументПеремещенияВТранзит;
		Элементы.ЧерезТранзитныйСклад.Видимость			= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") И НЕ ЗначениеЗаполнено_ДокументПеремещенияВТранзит;
		
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") Тогда
			Если ЧерезТранзитныйСклад Тогда
				Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаПолучатель) Тогда
					Объект.СтруктурнаяЕдиницаКонечныйПолучатель = Объект.СтруктурнаяЕдиницаПолучатель;
				КонецЕсли;
				Объект.СтруктурнаяЕдиницаКонечныйПолучатель	= УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("СтруктурныеЕдиницы", "ТранзитныйСклад");
			ИначеЕсли ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаКонечныйПолучатель) Тогда
				Объект.СтруктурнаяЕдиницаКонечныйПолучатель = Объект.СтруктурнаяЕдиницаКонечныйПолучатель;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "СтруктурнаяЕдиницаПолучательПриИзменении" Тогда
		Если ЧерезТранзитныйСклад Тогда
			Объект.СтруктурнаяЕдиницаКонечныйПолучатель = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("СтруктурныеЕдиницы", "ТранзитныйСклад");
		Иначе
			Объект.СтруктурнаяЕдиницаКонечныйПолучатель	= Объект.СтруктурнаяЕдиницаПолучатель;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "СтруктурнаяЕдиницаКонечныйПолучательПриИзменении" Тогда
		Объект.СтруктурнаяЕдиницаКонечныйПолучатель = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("СтруктурныеЕдиницы", "ТранзитныйСклад");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаКонечныйПолучательОткрытие(Элемент, СтандартнаяОбработка)
	Если Элементы.СтруктурнаяЕдиницаКонечныйПолучатель.РежимВыбораИзСписка
		И НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаКонечныйПолучатель) Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступностьПоЗаказуНаПеремещения()
	
	пЗаказНаПеремещения = (Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение И ЗначениеЗаполнено(Объект.ДокументОснование) И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ВнутреннийЗаказ"));
	Элементы.ЗапасыКоличествоВДороге.Видимость 			= пЗаказНаПеремещения;
	Элементы.ЗапасыЗапонитьКоличествоВДороге.Видимость 	= пЗаказНаПеремещения;
	Элементы.ЗапасыОчиститьКоличествоВДороге.Видимость 	= пЗаказНаПеремещения;
	Если пЗаказНаПеремещения Тогда
		Если Объект.Проведен И НЕ ПравоИзмененияЗаказовНаПеремещения Тогда
			Если ОсновнойСкладПользователя = Объект.СтруктурнаяЕдиницаПолучатель Тогда
				Для Каждого пЭлемент ИЗ ЭтаФорма.Элементы Цикл
					Если ТипЗнч(пЭлемент) = Тип("ПолеФормы") Тогда
						пЭлемент.ТолькоПросмотр = Истина;
					КонецЕсли;
				КонецЦикла;
				Элементы.Запасы.ТолькоПросмотр 							= Ложь;
				Элементы.ЗапасыКоличествоВДороге.ТолькоПросмотр 		= Ложь;
				КомандыЗапасов = Элементы.Запасы.КоманднаяПанель.ПодчиненныеЭлементы;
				Для Каждого пКоманда Из КомандыЗапасов Цикл
					Если ТипЗнч(пКоманда) = Тип("ГруппаФормы") Тогда
						Если НЕ пКоманда.Имя = "ЗапасыЗаполнитьОчистить" Тогда
							ПодчиненныеКоманды = пКоманда.ПодчиненныеЭлементы;
							Для Каждого пПодчиненнаяКоманда Из ПодчиненныеКоманды Цикл
								пПодчиненнаяКоманда.Доступность = Ложь;
							КонецЦикла;
						КонецЕсли;
					Иначе
						пКоманда.Доступность = Ложь;
					КонецЕсли;
				КонецЦикла;
			Иначе
				ТолькоПросмотр = Истина;
				Элементы.Запасы.КоманднаяПанель.Доступность = Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах Тогда
		УстановитьВидимостьИДоступностьПоЗаказуНаПеремещения();
	КонецЕсли;
КонецПроцедуры
//_Паганини

&НаКлиенте
Процедура НалоговыйДокументНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьВозможностьСозданияЭЛНакладной() Тогда 
		Возврат;	
	КонецЕсли;
	
	
	ПараметрыФормы   = Новый Структура;
	массивДокументов = Новый Массив;
	массивДокументов.Добавить(Объект.Ссылка);
	ПараметрыФормы.Вставить("ДокументыОснования", массивДокументов);
	
	УправлениеНебольшойФирмойКлиент.ОткрытьНалоговыйДокумент(ЭтотОбъект,ПараметрыФормы);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ОбработкаНавигационнойСсылки");
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	// დამმუშავებლის შემადგენლობის ჩასმა.
КонецПроцедуры

// ЗагрузкаДанныхИзВнешнегоИсточника
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	ТоварыДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаТовары = Объект.Запасы.Добавить();
		НоваяСтрокаТовары.Номенклатура = СтрокаТаблицы.Номенклатура;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
			
			НоваяСтрокаТовары.Характеристика = СтрокаТаблицы.Характеристика;
			
		КонецЕсли;
		
		//НоваяСтрокаТовары.Цена = СтрокаТаблицы.Цена;
		НоваяСтрокаТовары.Количество = СтрокаТаблицы.Количество;
		
		Если ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения") Тогда
			
			НоваяСтрокаТовары.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
			
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрокаТовары.Номенклатура) Тогда
			
			НоваяСтрокаТовары.ЕдиницаИзмерения = СтрокаТаблицы.Номенклатура.ЕдиницаИзмерения;
			
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(СтрокаТаблицы.СтавкаНДС) Тогда
		//	НоваяСтрокаТовары.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
		//Иначе
		//	НоваяСтрокаТовары.СтавкаНДС = СтрокаТаблицы.Номенклатура.СтавкаНДС;
		//КонецЕсли;
		
		ТоварыДобавлены = Истина;
		
	КонецЦикла;
	
	Если ТоварыДобавлены Тогда
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных);
	//
	//Для каждого СтрокаТаблицы Из Объект.Запасы Цикл 
	//	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТаблицы);
	//КонецЦикла;
	//
	//ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			ОбработатьПодготовленныеДанные(РезультатЗагрузки);
			
		КонецЕсли;
		
	Иначе
		
		ЗагрузитьИзФайлаЗавершение(РезультатЗагрузки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодготовленныеДанные(РезультатЗагрузки)
	
	Попытка
		
		НачатьТранзакцию();
		
		ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			Если ЗагрузкаВПриложениеВозможна Тогда
				
				НоваяСтрока = Объект.Запасы.Добавить();
				
				ИменаСвойств = "Номенклатура,Количество,ЕдиницаИзмерения,Резерв";
				Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
					
					ИменаСвойств = ИменаСвойств + ", Характеристика";
					
				КонецЕсли;
				
				Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
					
					ИменаСвойств = ИменаСвойств + ", Партия";
					
				КонецЕсли;
				//
				//Если ПолучитьФункциональнуюОпцию("УчетГТД") Тогда
				//	
				//	ИменаСвойств = ИменаСвойств + ", СтранаПроисхождения, НомерГТД";
				//	
				//КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				
				//НоваяСтрока.ТипНоменклатурыЗапас = (НоваяСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
				//НоваяСтрока.Цена = СтрокаТаблицы.Цена;
				ОбработатьТаблицуНаСервереВезИзм(НоваяСтрока);
				//НоваяСтрока.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;   ტესტ
				//НоваяСтрока.Сумма = НоваяСтрока.Цена * СтрокаТаблицы.Количество;
				
				//Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
				//	
				//	Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтавкаНДС) Тогда
				//		
				//		НоваяСтрока.СтавкаНДС = ?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура.СтавкаНДС), НоваяСтрока.Номенклатура.СтавкаНДС, Объект.Организация.СтавкаНДСПоУмолчанию);
				//		
				//	КонецЕсли;
				//	
				//	Если ЗначениеЗаполнено(СтрокаТаблицы.СуммаНДС) Тогда
				//		
				//		НоваяСтрока.СуммаНДС = СтрокаТаблицы.СуммаНДС;
				//		
				//	Иначе
				//		
				//		СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
				//		
				//		НоваяСтрока.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
				//			НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДС + 100) / 100),
				//			НоваяСтрока.Сумма * СтавкаНДС / 100);
				//		
				//	КонецЕсли;
				//	
				//Иначе
					
					//НоваяСтрока.СтавкаНДС = ?(Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС,
					//	УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС(),
					//	УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль());
					//
					//НоваяСтрока.СуммаНДС = 0;
				//	
				//КонецЕсли;
				
				//НоваяСтрока.Всего = НоваяСтрока.Сумма + ?(Объект.СуммаВключаетНДС, 0, НоваяСтрока.СуммаНДС);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ka='მონაცემების ჩატვირთვა';ru='Загрузка данных';en='Loading data'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Номенклатура, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуНаСервереВезИзм(Строка)
		
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", Строка.Характеристика);
	//СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	
	//Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
	//	
	//	СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
	//	СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	//	СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	//	СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
	//	СтруктураДанные.Вставить("Коэффициент", 1);
	//	СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
	//	
	//КонецЕсли;
	
	// ДисконтныеКарты
	//СтруктураДанные.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
	//СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);		
	// Конец ДисконтныеКарты
	
	//СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	//Если Строка.Цена = 0 Тогда
	//	Строка.Цена = СтруктураДанные.Цена;
	//КонецЕсли;
	//
	//Строка.НаименованиеДляРС = Строка(Строка.Номенклатура) + " " + Строка(Строка.Характеристика);
	
КонецПроцедуры
&НаКлиенте

Процедура ЗапасыЗагрузкаДанныхИзВнешнегоИсточника(Команда)
ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	НастройкиЗагрузкиДанных.Вставить("ИмяМакетаСШаблоном","ЗагрузкаИзФайла");
	НастройкиЗагрузкиДанных.Вставить("Заголовок", НСтр("ka='მარაგების ჩატვირთვა ფაილიდან';ru='Загрузка запасов из файла';en='Download the file from the reserves'"));
	НастройкиЗагрузкиДанных.Вставить("СодержаниеВидимо", Истина);
	//НастройкиЗагрузкиДанных.Вставить("ПоложениеЗаказаВДокументе", Объект.ПоложениеЗаказаПокупателя);
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяТабличнойЧасти", "ПеремещениеЗапасов.Запасы");
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопки_ЗаполнитьКолонкуОС()
	
	ЭтоПеремещениеНаОС = Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС;
	
	Элементы.ЗапасыЗаполнитьКолонкуОС.Видимость = ЭтоПеремещениеНаОС;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКолонкуОС(Команда)
	ФормаВыбораОС = ПолучитьФорму("Справочник.ВнеоборотныеАктивы.ФормаВыбора",,Этаформа);
	ФормаВыбораОС.Открыть();
КонецПроцедуры
// Конец ЗагрузкаДанныхИзВнешнегоИсточника

//ПодольскийАИ #УчетПроектов 05.10.2020 {
&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ЗаполнитьПроектПоДокументу(Объект.Проект, "СписаниеНаРасходы");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектОтправительПриИзменении(Элемент)
	
	ЗаполнитьПроектПоДокументу(Объект.ПроектОтправитель, "Перемещение");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПолучательПриИзменении(Элемент)
	
	ЗаполнитьПроектПоДокументу(Объект.ПроектПолучатель, "Перемещение");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроектПоДокументу(ПроектЗначение = Неопределено, мВидОперации)
	
	Если ПроектЗначение = Неопределено Тогда
		Если мВидОперации = "СписаниеНаРасходы" Тогда
			Объект.Проект = КэшЗначений.ПустойПроект;
		ИначеЕсли мВидОперации = "Перемещение" Тогда
			Объект.ПроектОтправитель = КэшЗначений.ПустойПроект;
			Объект.ПроектПолучатель = КэшЗначений.ПустойПроект;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаЗапасы Из Объект.Запасы Цикл
		Если мВидОперации = "СписаниеНаРасходы" Тогда
			СтрокаЗапасы.Проект = Объект.Проект;
		ИначеЕсли мВидОперации = "Перемещение" Тогда
			СтрокаЗапасы.ПроектОтправитель = Объект.ПроектОтправитель;
			СтрокаЗапасы.ПроектПолучатель = Объект.ПроектПолучатель;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
// Конец ЗагрузкаДанныхИзВнешнегоИсточника


