
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ПоказатьВсеЗаписи = РольДоступна("AzRyНапоминанияПользователяАдминистратор");
	//Элементы.ПоказатьВсеЗаписы.Видимость = ПоказатьВсеЗаписи; 
	ПоказатьВсеЗаписиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеЗаписиПриИзменении(Элемент)
	
	ПоказатьВсеЗаписиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьВсеЗаписиПриИзмененииНаСервере()
		
	Если ПоказатьВсеЗаписи Тогда		
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, " И РегистрСведенийAzRyНапоминанияПользователя.Получатель = &Получатель Или РегистрСведенийAzRyНапоминанияПользователя.Отправитель = &Отправитель ", "");	
	Иначе 		
		Список.ТекстЗапроса = Список.ТекстЗапроса + " И РегистрСведенийAzRyНапоминанияПользователя.Получатель = &Получатель Или РегистрСведенийAzRyНапоминанияПользователя.Отправитель = &Отправитель ";		
		Список.Параметры.УстановитьЗначениеПараметра("Получатель", Пользователи.ТекущийПользователь());
		Список.Параметры.УстановитьЗначениеПараметра("Отправитель", Пользователи.ТекущийПользователь());
	КонецЕсли;	
	    
КонецПроцедуры