Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	//НаборТестов.Добавить("Тест_Проверить_ТочкуМаршрута_ОдинБП");
	//НаборТестов.Добавить("Тест_Проверить_ТочкуМаршрута_ДваБП");
	НаборТестов.Добавить("Тест_НеРезидент_ПриходнаяНакладная");
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт 
	//Размещение = "C:\1С базы\Белгипрозем 2015\Тесты\xUnitFor1C\Разрабатываемые\СозданиеЭлементовСправочников.epf";
	//ВнОбр = ВнешниеОбработки.Создать(Размещение);
	
	//КонтекстЯдра.ВывестиСообщение("Перед запуском теста"); 
	НачатьТранзакцию();
КонецПроцедуры 

Процедура ПослеЗапускаТеста() Экспорт 
	
	Если ТранзакцияАктивна() Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	//КонтекстЯдра.ВывестиСообщение("После запуска теста"); 
	
КонецПроцедуры 

//Процедура Тест_Проверить_ТочкуМаршрута_ОдинБП() Экспорт
//	
//	ТестовыеДанные = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "ТестовыеДанные");
//	
//	Утверждения.ПроверитьТип(ТестовыеДанные, "Структура");
//	Утверждения.ПроверитьРавенство(5, ТестовыеДанные.Количество(), "ТестовыеДанные.Количество()");
//	
//	// Проверим точку маршрута в задаче
//	Есть = ТестовыеДанные.Задача1БП1.ТочкаМаршрута;
//	Надо = БизнесПроцессы.БизнесПроцесс1.ТочкиМаршрута.Действие1;
//	Утверждения.ПроверитьРавенство(Есть, Надо, "Точка маршрута 1 БП");
//	
//КонецПроцедуры

//Процедура Тест_Проверить_ТочкуМаршрута_ДваБП() Экспорт
//	
//	ТестовыеДанные = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "ТестовыеДанные");
//	
//	Утверждения.ПроверитьТип(ТестовыеДанные, "Структура");
//	Утверждения.ПроверитьРавенство(5, ТестовыеДанные.Количество(), "ТестовыеДанные.Количество()");
//	
//	// Проверим точку маршрута в задаче
//	Есть = ТестовыеДанные.Задача1БП2.ТочкаМаршрута;
//	Надо = БизнесПроцессы.БизнесПроцесс2.ТочкиМаршрута.Действие1;
//	Утверждения.ПроверитьРавенство(Есть, Надо, "ТочкаМаршрута");
//	
//КонецПроцедуры

Процедура Тест_НеРезидент_ПриходнаяНакладная() Экспорт
	
	// ERPM-809
	
	ДатаДокумента = ТекущаяДата(); 
	
	// Валюта
	//Валюта = СоздатВалюту();
	Валюта = Справочники.Валюты.НайтиПоНаименованию("USD"); // TODO
	
	// Рег сведений курсы валют
	СоздаЗаписьКурсыВалют(Валюта, ДатаДокумента);
	
	// Контрагент
	Контрагент = СоздатКонтрагента(Истина);
	
	// Договор
	Договор = СоздатДоговор(Контрагент.Ссылка, Валюта.Ссылка);
	
	// Приходная Накладная
	ПриходнаяНакладная = СоздатьПриходнаяНакладная(ДатаДокумента, Контрагент.Ссылка, Договор.Ссылка, Валюта.Ссылка);
	
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.Хозрасчетный.Количество() = 3, "ბუღალტრულ გატარებაში 3 ჩანაწერი უნდა იყოს, გასარკვევია რატომ არ არის ასე!");
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.Хозрасчетный[0].Сумма = 200, "ძირითადი თანხა უნდა უდრიდეს 200 ლარს!");
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.Хозрасчетный[1].Сумма = 40, "დ.ღ.გ. ს თანხა უნდა უდრიდეს 40 ლარს!");
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.Хозрасчетный[2].Сумма = 22.22, "საშემოსავლოს თანხა უნდა უდრიდეს 22.22 ლარს!");
	
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.Закупки.Количество() = 1, "რეგისტრში 'შესყიდვები' ერთი ჩანაწერი უნდა იყოს!");
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.Закупки[0].Сумма     = 200, "ძირითადი თანხა უნდა უდრიდეს 200 ლარს!");
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.Закупки[0].СуммаНДС  = 40, "დ.ღ.გ. ს თანხა უნდა უდრიდეს 40 ლარს!");
	
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.РасчетыПоНалогам.Количество() = 2, "რეგისტრში 'გადასახადები ანგარიშსწორებები გადასახადების მიხედვით' ერთი ჩანაწერი უნდა იყოს!");
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.РасчетыПоНалогам[0].Сумма     = 40, "დ.ღ.გ. ს თანხა უნდა უდრიდეს 40 ლარს!");
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.РасчетыПоНалогам[1].Сумма  = 22.22, "საშემოსავლოს თანხა უნდა უდრიდეს 22.22 ლარს!");	
	
КонецПроцедуры

Процедура Тест_НеРезидент_ПриходнаяНакладная2() Экспорт
	
	// ERPM-809
	
	ДатаДокумента = ТекущаяДата(); 
	
	// Валюта
	//Валюта = СоздатВалюту();
	Валюта = Справочники.Валюты.НайтиПоНаименованию("USD"); // TODO
	
	// Рег сведений курсы валют
	СоздаЗаписьКурсыВалют(Валюта, ДатаДокумента);
	
	// Контрагент
	Контрагент = СоздатКонтрагента(Истина);
	
	// Договор
	Договор = СоздатДоговор(Контрагент.Ссылка, Валюта.Ссылка);
	
	// Приходная Накладная
	ПриходнаяНакладная = СоздатьПриходнаяНакладная(ДатаДокумента, Контрагент.Ссылка, Договор.Ссылка, Валюта.Ссылка);
	
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.Хозрасчетный.Количество() = 3, "ბუღალტრულ გატარებაში 3 ჩანაწერი უნდა იყოს, გასარკვევია რატომ არ არის ასე!");
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.Хозрасчетный[0].Сумма = 200, "ძირითადი თანხა უნდა უდრიდეს 200 ლარს!");
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.Хозрасчетный[1].Сумма = 40, "დ.ღ.გ. ს თანხა უნდა უდრიდეს 40 ლარს!");
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.Хозрасчетный[2].Сумма = 22.22, "საშემოსავლოს თანხა უნდა უდრიდეს 22.22 ლარს!");
	
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.Закупки.Количество() = 1, "რეგისტრში 'შესყიდვები' ერთი ჩანაწერი უნდა იყოს!");
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.Закупки[0].Сумма     = 200, "ძირითადი თანხა უნდა უდრიდეს 200 ლარს!");
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.Закупки[0].СуммаНДС  = 40, "დ.ღ.გ. ს თანხა უნდა უდრიდეს 40 ლარს!");
	
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.РасчетыПоНалогам.Количество() = 2, "რეგისტრში 'გადასახადები ანგარიშსწორებები გადასახადების მიხედვით' ერთი ჩანაწერი უნდა იყოს!");
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.РасчетыПоНалогам[0].Сумма     = 40, "დ.ღ.გ. ს თანხა უნდა უდრიდეს 40 ლარს!");
	Утверждения.ПроверитьИстину(ПриходнаяНакладная.Движения.РасчетыПоНалогам[1].Сумма  = 22.22, "საშემოსავლოს თანხა უნდა უდრიდეს 22.22 ლარს!");	
	
КонецПроцедуры



///////////////////////////////////////////////////////////////////////////////////////////////////
// 

Функция СоздатКонтрагента(ЯвляетсяНеРезидентом)
	
	Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
	Контрагент.Наименование = "არარეზიდენტი";
	Контрагент.ВестиРасчетыПоДоговорам = Истина;
	Контрагент.Поставщик			   = Истина;
	Контрагент.ЯвляетсяНеРезидентом    = ЯвляетсяНеРезидентом;
	Контрагент.НалогообложениеНДС      = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	Контрагент.СчетУчетаАвансовПокупателяРегл = ПланыСчетов.Хозрасчетный.НайтиПоКоду("1410");
	Контрагент.СчетУчетаАвансовПоставщикуРегл = ПланыСчетов.Хозрасчетный.НайтиПоКоду("3110");
	Контрагент.СчетУчетаРасчетовСПокупателемРегл = ПланыСчетов.Хозрасчетный.НайтиПоКоду("3110");
	Контрагент.СчетУчетаРасчетовСПоставщикомРегл = ПланыСчетов.Хозрасчетный.НайтиПоКоду("3110");
	Контрагент.Записать();
	
	Возврат Контрагент;
	
КонецФункции

Функция СоздатДоговор(Контрагент, Валюта)
	
	Договор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	Договор.Наименование   = "არარეზიდენტის ხელშეკრულება";
	Договор.Владелец       = Контрагент;
	Договор.УчитыватьНДФЛ  = Истина;
	Договор.ВалютаРасчетов = Валюта;
	Договор.ВидУдержанияНДФЛ = Справочники.ВидыНачисленийИУдержаний.НайтиПоКоду("SS-000005"); // TODO
	Договор.Записать();
	
	Возврат Договор;
	
КонецФункции

Процедура СоздаЗаписьКурсыВалют(Валюта, Дата)
	
	МенеджерЗаписи = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период    = Дата;
	МенеджерЗаписи.Валюта    = Валюта;
	МенеджерЗаписи.Курс      = 2;
	МенеджерЗаписи.Кратность = 1;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
 
Функция СоздатВалюту()
	
	Валюта = Справочники.Валюты.СоздатьЭлемент();
	Валюта.Наименование = "USD";
	Валюта.Код          = 999;
	Валюта.Записать();
	
	Возврат Валюта;
	
КонецФункции

Функция СоздатьНалог()

	ВидыНалогов = Справочники.ВидыНалогов.СоздатьЭлемент();
	ВидыНалогов.Наименование             = "დღგ - რეზიდენტის მომსახურებიდან";
	ВидыНалогов.СчетУчетаРегл            = ПланыСчетов.Хозрасчетный.НайтиПоКоду("3330");
	ВидыНалогов.СчетУчетаКВозмещениюРегл = ПланыСчетов.Хозрасчетный.НайтиПоКоду("3340");
	ВидыНалогов.Записать();
	
	Возврат ВидыНалогов;	

КонецФункции

Функция СоздатьПриходнаяНакладная(ДатаДокумента, Контрагент, Договор, Валюта)

	ПриходнаяНакладная = Документы.ПриходнаяНакладная.СоздатьДокумент();
	ПриходнаяНакладная.Дата       = ДатаДокумента;
	ПриходнаяНакладная.Организация= Справочники.Организации.ОсновнаяОрганизация;
	ПриходнаяНакладная.Контрагент = Контрагент;
	ПриходнаяНакладная.Договор    = Договор;
	ПриходнаяНакладная.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	ПриходнаяНакладная.ВидОперации        = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
	ПриходнаяНакладная.ВидНалогаНДС       = СоздатьНалог().Ссылка;
	ПриходнаяНакладная.ВалютаДокумента    = Валюта;
	ПриходнаяНакладная.Курс               = 2;
	ПриходнаяНакладная.Кратность          = 1;
	ПриходнаяНакладная.СуммаВключаетНДС   = Истина;
	ПриходнаяНакладная.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	
	НоваяСтрока = ПриходнаяНакладная.Расходы.Добавить();
	НоваяСтрока.Номенклатура     = Справочники.Номенклатура.НайтиПоНаименованию("facebook პოსტის დაბუსტვა"); // TODO 
	НоваяСтрока.Количество       = 1;
	НоваяСтрока.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию("ც"); // TODO 
	НоваяСтрока.Цена             = 100;
	НоваяСтрока.ВидУдержанияНДФЛ = Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию("საშემოსავლო გადასახადი (არარეზიდენტი)"); // TODO
	НоваяСтрока.СуммаНДФЛ         = 11.11;
	НоваяСтрока.СтавкаНДС        = Справочники.СтавкиНДС.НайтиПоНаименованию("18%"); // TODO
	НоваяСтрока.СуммаНДС         = 20;
	НоваяСтрока.Сумма            = 100;
	НоваяСтрока.Всего            = 100;
	НоваяСтрока.СтруктурнаяЕдиница      = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
	
	ПриходнаяНакладная.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ПриходнаяНакладная;	

КонецФункции
 