&После("ПриЗаписи")
Процедура РасшAzRy_ПриЗаписи(Отказ, Замещение)
	
	Если Константы.AzRyНапоминанияПользователя.Получить() И ДополнительныеСвойства.Количество() <> 0 Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВременнаяТаблицаЗапасы.СтруктурнаяЕдиница.AzRyТекущийОтветственный КАК AzRyТекущийОтветственныйФизЛицо,
		|	&ДокСсылка КАК ДокСсылка,
		|	Сотрудники.Ссылка КАК AzRyТекущийОтветственныйСотрудник
		|ПОМЕСТИТЬ вр_Таблица
		|ИЗ
		|	ДвиженияЗапасыНаСкладахИзменение КАК ВременнаяТаблицаЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО ВременнаяТаблицаЗапасы.СтруктурнаяЕдиница.AzRyТекущийОтветственный = Сотрудники.Физлицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вр_Таблица.ДокСсылка КАК ДокСсылка,
		|	вр_Таблица.AzRyТекущийОтветственныйФизЛицо КАК AzRyТекущийОтветственныйФизЛицо,
		|	вр_Таблица.AzRyТекущийОтветственныйСотрудник КАК AzRyТекущийОтветственныйСотрудник,
		|	СотрудникиПользователя.Пользователь КАК AzRyТекущийОтветственный
		|ПОМЕСТИТЬ вр_Таблица2
		|ИЗ
		|	вр_Таблица КАК вр_Таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
		|		ПО вр_Таблица.AzRyТекущийОтветственныйСотрудник = СотрудникиПользователя.Сотрудник
		|ГДЕ
		|	вр_Таблица.AzRyТекущийОтветственныйФизЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вр_Таблица2.AzRyТекущийОтветственный КАК AzRyТекущийОтветственный,
		|	вр_Таблица2.ДокСсылка КАК ДокСсылка,
		|	ЕСТЬNULL(AzRyНапоминанияПользователя.СтатусНапоминания, НЕОПРЕДЕЛЕНО) КАК СтатусНапоминания,
		|	AzRyНапоминанияПользователя.Получатель КАК Получатель
		|ИЗ
		|	вр_Таблица2 КАК вр_Таблица2
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AzRyНапоминанияПользователя КАК AzRyНапоминанияПользователя
		|		ПО вр_Таблица2.ДокСсылка = AzRyНапоминанияПользователя.Источник
		|			И (вр_Таблица2.AzRyТекущийОтветственный = AzRyНапоминанияПользователя.Получатель
		|				ИЛИ вр_Таблица2.AzRyТекущийОтветственный = AzRyНапоминанияПользователя.Отправитель)");
		
		Запрос.УстановитьПараметр("ДокСсылка", Отбор.Регистратор.Значение);
		Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц; 
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество() > 0 И AzRyFunctions.ТаблицаЗначениеЗаполнено(ТЗ, "AzRyТекущийОтветственный") Тогда
			МассивТекущийОтветственный = Новый Массив;
			СоотСтатусНапоминания = Новый Соответствие;
			Для каждого ТекСтрока Из ТЗ Цикл
				//Если ЗначениеЗаполнено(ТекСтрока.AzRyТекущийОтветственный) И ТекСтрока.AzRyТекущийОтветственный <> Пользователи.ТекущийПользователь() Тогда
				Если ЗначениеЗаполнено(ТекСтрока.AzRyТекущийОтветственный) Тогда
					ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("AzRy_НапПольз_ДвиженияЗапасыНаСкладахИзменение", Истина);
					//ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("AzRyИсточникВерсияДанных", ТекСтрока.ИсточникВерсияДанных);
					ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("AzRy_НапПольз_Получатель", ТекСтрока.Получатель);
					
					МассивТекущийОтветственный.Добавить(ТекСтрока.AzRyТекущийОтветственный);
					ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("AzRy_НапПольз_МассивТекущийОтветственный", МассивТекущийОтветственный);
					
					СоотСтатусНапоминания.Вставить(ТекСтрока.AzRyТекущийОтветственный, ТекСтрока.СтатусНапоминания); 
					ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("AzRy_НапПольз_КешСтатусНапоминания", СоотСтатусНапоминания);
				КонецЕсли; 				
			КонецЦикла; 
		Иначе 	
			ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("AzRy_НапПольз_ДвиженияЗапасыНаСкладахИзменение", Ложь);		
		КонецЕсли; 		
		
	КонецЕсли; 
	
КонецПроцедуры

