
&НаКлиенте
Процедура СпианиеНаРемонт(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("СписаниеТопливаЗапасов", "СписаниеЗапасовНаВнеоборотныеАктивы", ДанныеМеток);
	
КонецПроцедуры


&НаКлиенте
Процедура СписаниеТоплива(Команда)
	
	ДвиженияДенежныхСредствКлиент.СоздатьДокумент("СписаниеТопливаЗапасов", "СписаниеТоплива", ДанныеМеток);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидОперации") Тогда 
		Если Параметры.ВидОперации = "СписаниеТоплива" Тогда 
			
			Элементы.СпианиеНаРемонт.Видимость = ЛОЖЬ;
			Элементы.СписаниеТоплива.Видимость = Истина;
			
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ПравоеЗначение = Перечисления.ВидыОперацийСписаниеТопливаЗапасов.СписаниеТоплива;
			
		ИначеЕсли Параметры.ВидОперации = "СписаниеНаРемонт" Тогда 
			
			Элементы.СпианиеНаРемонт.Видимость = Истина;
			Элементы.СписаниеТоплива.Видимость = ЛОЖЬ;
			
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ПравоеЗначение = Перечисления.ВидыОперацийСписаниеТопливаЗапасов.СписаниеЗапасовНаВнеоборотныеАктивы;
			
		КонецЕсли;
	КонецЕсли;
	
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);

    //+++ Дмгг
	//Ограничение Видимости складских документов по основному складу
	ОбщегоНазначения.УстановитьФильтрСпискаДокументовПоОсновномуСкладу(Список, "СписаниеТопливаЗапасов");
	//--- Дмгг
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
КонецПроцедуры
