Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	         //ნიმუში РеализацияТоваровИУслуг-დან
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеализацияТоваровИУслуг(MSWord)";
	КомандаПечати.Представление = НСтр("ka='საქონლის და მომსახურების რეალიზაცია';ru='Реализация товаров и услуг в Microsoft Word';en='Sales of goods and services in Microsoft Word'");
	КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Обработчик = "УправлениеПечатьюКлиент.ПечатьДокументРеализацияТоваровИУслуг";
	КомандаПечати.ТребуетсяРасширениеРаботыСФайлами = Истина;
	
	
	
	КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Работа с макетами офисных документов.

   //ნიმუში РеализацияТоваровИУслуг-დან

Функция ПолучитьДанныеПечати(Знач МассивДокументов, Знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	Для Каждого ОбъектСсылка Из МассивДокументов Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ПолучитьДанныеОбъекта(ОбъектСсылка));
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		Если ИмяМакета = "РеализацияТоваровИУслуг(MSWord)" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, УправлениеПечатью.ПолучитьМакет("Документ.РеализацияТоваровИУслуг.ПФ_DOC_РеализацияТоваровИУслуг"));
			ТипыМакетов.Вставить(ИмяМакета, "DOC");
		КонецЕсли;	
		//Если ИмяМакета = "РеализацияТоваровИУслуг2(MSWord)" Тогда
		//	ДвоичныеДанныеМакетов.Вставить(ИмяМакета, УправлениеПечатью.ПолучитьМакет("Документ.РеализацияТоваровИУслуг.ПФ_DOC_РеализацияТоваровИУслуг2"));
		//	ТипыМакетов.Вставить(ИмяМакета, "DOC");
		//КонецЕсли;
		ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента());
	КонецЦикла;
	
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции

Функция ПолучитьДанныеОбъекта(СсылкаНаОбъект)
	
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	
	ДанныеОбъекта = Новый Структура;
	
	//ДанныеОбъекта.Вставить("Комментарий",	Объект.Комментарий);
	//ДанныеОбъекта.Вставить("Организация",	Объект.Организация.Наименование);
	//ДанныеОбъекта.Вставить("Ответственный",	Объект.Ответственный);
	//ДанныеОбъекта.Вставить("МестоХранения",	Объект.Склад);
	ДанныеОбъекта.Вставить("Дата",			Строка(ТекущаяДатаСеанса()));
	ДанныеОбъекта.Вставить("Номер",     	Объект.Номер);
    ДанныеОбъекта.Вставить("Отправитель",   Объект.Организация);
    ДанныеОбъекта.Вставить("Получатель",    Объект.Контрагент);
	
	
	ДанныеОбъекта.Вставить("Товары", Новый Массив);
		Для Каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		СтрокаТаблицыТовары = Новый Структура;
		//СтрокаТаблицыТовары.Вставить("Номенклатура",			СтрокаТабличнойЧасти.Номенклатура);
		СтрокаТаблицыТовары.Вставить("Количество",				СтрокаТабличнойЧасти.Количество);
		//СтрокаТаблицыТовары.Вставить("Себестоимость",			СтрокаТабличнойЧасти.Цена);
		СтрокаТаблицыТовары.Вставить("Цена",					СтрокаТабличнойЧасти.Цена);
		СтрокаТаблицыТовары.Вставить("ном",						СтрокаТабличнойЧасти.НомерСтроки);
		СтрокаТаблицыТовары.Вставить("Товары",					СтрокаТабличнойЧасти.Номенклатура);
		//СтрокаТаблицыТовары.Вставить("СебестоимостьЕдиницы", 	СтрокаТабличнойЧасти.ЦенаПродажи);
		ДанныеОбъекта.Товары.Добавить(СтрокаТаблицыТовары);
	КонецЦикла;
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента()
	
	ОписаниеОбластей = Новый Структура;
	// обычный
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ШапкаТаблицы",	"СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СтрокаТаблицы",	"СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ШапкаДокумента",	"Общая");
	// расширенный
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ВерхнийКолонтитул",	"ВерхнийКолонтитул");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "НижнийКолонтитул",		"НижнийКолонтитул");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок",			"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "НижняяЧасть",			"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ШапкаТаблицыТовары",	"СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СтрокаТаблицаТовары",	"СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ШапкаТаблицыТоварыТекст",	"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ШапкаТоварыНоменклатура",	"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ТоварыНоменклатура",		"Список");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ШапкаТоварыВсего",		"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ТоварыВсего",			"Список");
	
	Возврат ОписаниеОбластей;
	
КонецФункции
