
&НаКлиенте
Процедура загрузить(Команда)
	
	
	ЕстьОшибки = ЛОЖЬ;
	загрузитьНаСервере(ЕстьОшибки) ;

	Если ЕстьОшибки Тогда 
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(НСтр("ru = 'Продолжить выполнение операции?';"
		+ "ka = 'გაგრძელდეს მონაემების ჩატვირთვა ?'"), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе 
			загрузитьНаСервере1();
		КонецЕсли;
		
	Иначе 
		
		загрузитьНаСервере1();
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура загрузитьНаСервере(ЕстьОшибки)
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнеоборотныеАктивы.Ссылка,
	|	ВнеоборотныеАктивы.Код,
	|	ВнеоборотныеАктивы.Наименование
	|ИЗ
	|	Справочник.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы
	|ГДЕ
	|	ВнеоборотныеАктивы.ПометкаУдаления = ложь";
	
	тзИмущество = Запрос.Выполнить().Выгрузить();
	
	
	ТЗ.Очистить();
	КолСтрок = ТабличнийДокумент.ВысотаТаблицы;
	Для Стр = 2 По КолСтрок Цикл
		ИС1 = Формат(Стр, "ЧГ=0");
		ТекстПериод = ТабличнийДокумент.Область("R"+ИС1+"C1").Текст;
		НовСтрока	= ТЗ.Добавить();
		НомерСтр =Стр -1 ;
		Если ЗначениеЗаполнено(Период) тогда
			НовСтрока.Период 		= Период  ;
		Иначе 
			Попытка
				//НовСтрока.Период 		= Дата(Сред(ТекстПериод, 7, 10), Сред(ТекстПериод, 4, 5), Сред(ТекстПериод, 1, 2), Сред(ТекстПериод, 12, 13), Сред(ТекстПериод, 15, 16), Сред(ТекстПериод, 18, 19));//31.03.2013 23:59:59							
				НовСтрока.Период 		= Дата(Сред(ТекстПериод, 7, 10), Сред(ТекстПериод, 4, 5), Сред(ТекстПериод, 1, 2));//30.12.2020		
			Исключение
				Сообщить("თარიღის ველი შესავსებია ან ფორმატი არასწორია.სწორი ფორმატია: 30.12.2020" +" " + "სტრ " + НомерСтр );
			КонецПопытки;
		КонецЕсли;
		ЗначениеКолонки = ПолучитьЗначениеКолонки(тзИмущество, ТабличнийДокумент.Область("R"+Стр+"C14").Текст);  ///საინვენტარო ნომერი
		НовСтрока.ВнеоборотныйАктив  = ЗначениеКолонки;
		
		
		
		//ТабличнийДокумент.Область("R"+ИС1+"C10").Текст = НомерСтр ;
		
		Если не ЗначениеЗаполнено(НовСтрока.ВнеоборотныйАктив)  Тогда 
			Сообщить(  ТабличнийДокумент.Область("R"+ИС1+"C2").Текст +    "- ძ.ს. ამ საინვენტარო ნომერით ვერ მოიძებნა" +"  " + "სტრ  " + НомерСтр ) ;
			ЕстьОшибки = ИСТИНА;				  
		КонецЕсли;
	
		Если   Не ЗначениеЗаполнено(НовСтрока.ВнеоборотныйАктив) Тогда 		
			ЗначениеКолонки = ПолучитьЗначениеКолонки1(тзИмущество, ТабличнийДокумент.Область("R"+Стр+"C5").Текст);   ///ძს
			НовСтрока.ВнеоборотныйАктив  = ЗначениеКолонки;		
		КонецЕсли;	
		НовСтрока.Организация 							= Организация;
		НовСтрока.ОбъемПродукцииРаботДляВычисленияАмортизации 	= ТабличнийДокумент.Область("R"+ИС1+"C6").Текст;    //
		НовСтрока.СтоимостьДляВычисленияАмортизации 	= ТабличнийДокумент.Область("R"+ИС1+"C7").Текст;           //
		
		Если    ТабличнийДокумент.Область("R"+ИС1+"C8").Текст   = "არა" Тогда 
			НовСтрока.ПрименитьВТекущемМесяце =Ложь ;
		Иначе 
			НовСтрока.ПрименитьВТекущемМесяце = Истина; 
		КонецЕсли;
		НовСтрока.СрокИспользованияДляВычисленияАмортизации 	= ТабличнийДокумент.Область("R"+ИС1+"C11").Текст;
		НовСтрока.ГодовойПроцентАмортизацииДляУменьшенногоОстатка	= ТабличнийДокумент.Область("R"+ИС1+"C12").Текст;
		НовСтрока.КонечнаяСтоимость							 	= ТабличнийДокумент.Область("R"+ИС1+"C13").Текст;		
		НовСтрока.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка	= ТабличнийДокумент.Область("R"+ИС1+"C15").Текст;		
		НовСтрока.Организация							   		= Организация;
		НовСтрока.СтруктурнаяЕдиница							= СтруктурнаяЕдиница;
		НовСтрока.СчетЗатратРегл							   	= СчетЗатрат;
				
	КонецЦикла;
	
	
КонецПроцедуры



&НаСервере
Процедура загрузитьНаСервере1()
	
	ТаблицаЗагрузки = ТЗ.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗагрузки.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
		|	тзЗагрузки.КонечнаяСтоимость КАК КонечнаяСтоимость,
		|	тзЗагрузки.Период КАК Период,
		|	тзЗагрузки.ВнеоборотныйАктивКод КАК ВнеоборотныйАктивКод,
		|	тзЗагрузки.Организация КАК Организация,
		|	тзЗагрузки.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
		|	тзЗагрузки.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
		|	тзЗагрузки.ПрименитьВТекущемМесяце КАК ПрименитьВТекущемМесяце,
		|	тзЗагрузки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	тзЗагрузки.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
		|	тзЗагрузки.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка,
		|	тзЗагрузки.ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
		|	тзЗагрузки.СчетЗатратРегл
		|ПОМЕСТИТЬ ВТ_Загрузки
		|ИЗ
		|	&тзЗагрузки КАК тзЗагрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Загрузки.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
		|	ВТ_Загрузки.КонечнаяСтоимость КАК КонечнаяСтоимость,
		|	ВТ_Загрузки.Период КАК Период,
		|	ВТ_Загрузки.ВнеоборотныйАктивКод КАК ВнеоборотныйАктивКод,
		|	ВТ_Загрузки.Организация КАК Организация,
		|	ВТ_Загрузки.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
		|	ВТ_Загрузки.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
		|	ВТ_Загрузки.ПрименитьВТекущемМесяце КАК ПрименитьВТекущемМесяце,
		|	ВТ_Загрузки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВТ_Загрузки.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
		|	ВТ_Загрузки.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка,
		|	ВТ_Загрузки.ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
		|	ВТ_Загрузки.СчетЗатратРегл
		|ИЗ
		|	ВТ_Загрузки КАК ВТ_Загрузки";
	
	Запрос.УстановитьПараметр("тзЗагрузки", ТаблицаЗагрузки);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	НаборВнеоборотныеАктивы = Регистрысведений.ПараметрыВнеоборотныхАктивов.СоздатьНаборЗаписей();
	НаборВнеоборотныеАктивы.Отбор.Регистратор.Установить(Регистратор);
	НаборВнеоборотныеАктивы.Прочитать();
	НаборВнеоборотныеАктивы.Загрузить(РезультатЗапроса);
	НаборВнеоборотныеАктивы.ОбменДанными.Загрузка = Истина;
	НаборВнеоборотныеАктивы.Записать();

	

КонецПроцедуры // загрузитьНаСервере1()


////сатестоа
&НаСервере
Функция ПолучитьЗначениеКолонки(ТаблицаПоиска, ТекстПоиска)
	
	РезультатПоиска = Неопределено;
	
	ПоискСтрок = ТаблицаПоиска.НайтиСтроки(Новый Структура("Код",ТекстПоиска));
	
	Если ПоискСтрок.Количество() > 0 Тогда 
		РезультатПоиска = ПоискСтрок[0].Ссылка;
	КонецЕсли;
	
	
	Возврат РезультатПоиска;
	
КонецФункции


&НаСервере
Функция ПолучитьЗначениеКолонки1(ТаблицаПоиска, ТекстПоиска)
	
	РезультатПоиска = Неопределено;
	
	ПоискСтрок = ТаблицаПоиска.НайтиСтроки(Новый Структура("Наименование",ТекстПоиска));
	
	Если ПоискСтрок.Количество() > 0 Тогда 
		РезультатПоиска = ПоискСтрок[0].Ссылка;
	КонецЕсли;
	
	
	Возврат РезультатПоиска;
	
КонецФункции


