
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураДополнительныхПараметров = Новый Структура("ЗаголовокФормы", Нстр("ka='Инструкция ""Как создать факсимиле печати""';ru='Инструкция ""Как создать факсимиле печати""'"));
	
	ПараметрыКомандыПечати = Новый Массив;
	ПараметрыКомандыПечати.Добавить(ПараметрКоманды);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.Организации", "НапечататьПомощникСозданияФаксимилеПечати", ПараметрыКомандыПечати, ПараметрыВыполненияКоманды, СтруктураДополнительныхПараметров);
	
КонецПроцедуры
