
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Объект.ВидОперации    = ПредопределенноеЗначение("Перечисление.AzRyВидыОперацийПередачаИмуществаСотруднику.Передача");
	КонецЕсли; 
	
	Объект.IT                 = Справочники.AzRyНастройки.ПередачаИмуществаСотруднику_IT.Значение;
	Объект.HumanResources     = Справочники.AzRyНастройки.ПередачаИмуществаСотруднику_HumanResources.Значение;
	Объект.ЗаведующийПоСкладу = Справочники.AzRyНастройки.ПередачаИмуществаСотруднику_ЗаведующийПоСкладу.Значение;
		
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере(ТабДок)
	
	ВидОперацииПередача = Объект.ВидОперации = Перечисления.AzRyВидыОперацийПередачаИмуществаСотруднику.Передача;
	Документы.AzRyПередачаИмуществаСотруднику.Печать(ТабДок, Объект.Ссылка, ВидОперацииПередача);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	ПечатьНаСервере(ТабДок);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.Показать();	
	
КонецПроцедуры

&НаКлиенте
Процедура Печать2(Команда)
		
	ТабДок = Новый ТабличныйДокумент;
	Печать2НаСервере(ТабДок);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура Печать2НаСервере(ТабДок)
	
	Документы.AzRyПередачаИмуществаСотруднику.Печать2(ТабДок, Объект.Ссылка);	
	
КонецПроцедуры

&НаСервере
Процедура Печать3НаСервере(ТабДок)
	
	Документы.AzRyПередачаИмуществаСотруднику.Печать3(ТабДок, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать3(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	Печать3НаСервере(ТабДок);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура Печать4НаСервере(ТабДок)
	
Документы.AzRyПередачаИмуществаСотруднику.Печать4(ТабДок, Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура Печать4(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	Печать4НаСервере(ТабДок);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		
		Если Объект.ВнеоборотныеАктивы.Количество() = 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВнеоборотныеАктивы_.Ссылка КАК Ссылка,
			|	ВнеоборотныеАктивы_.AzRyОтветственный КАК AzRyОтветственный,
			|	ВнеоборотныеАктивы_.НачальнаяСтоимостьДляУменьшенногоОстатка КАК НачальнаяСтоимостьДляУменьшенногоОстатка,
			|	AzRyШтрихкодыВнеоборотныеАктивы.Штрихкод КАК Штрихкод
			|ИЗ
			|	Справочник.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы_
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AzRyШтрихкодыВнеоборотныеАктивы КАК AzRyШтрихкодыВнеоборотныеАктивы
			|		ПО ВнеоборотныеАктивы_.Ссылка = AzRyШтрихкодыВнеоборотныеАктивы.ВнеоборотныеАктивы
			|ГДЕ
			|	ВнеоборотныеАктивы_.AzRyОтветственный = &AzRyОтветственный";
			
			Запрос.УстановитьПараметр("AzRyОтветственный", Объект.Сотрудник.Физлицо);
			
			РезультатЗапроса = Запрос.Выполнить();			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
			
			Объект.ВнеоборотныеАктивы.Очистить();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НоваяСтрока = Объект.ВнеоборотныеАктивы.Добавить();
				НоваяСтрока.ВнеоборотныйАктив = ВыборкаДетальныеЗаписи.Ссылка;
				НоваяСтрока.СтоимостьЗакупкиСНДС = ВыборкаДетальныеЗаписи.НачальнаяСтоимостьДляУменьшенногоОстатка;
				НоваяСтрока.Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;
			КонецЦикла;			
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Объект.Сотрудник) И Не ЗначениеЗаполнено(Объект.Организация) Тогда
				
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СотрудникиСрезПоследних.Организация КАК Организация,
			|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
			|	СотрудникиСрезПоследних.Должность КАК Должность,
			|	СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
			|	СотрудникиСрезПоследних.AzRyDivision КАК AzRyDivision,
			|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
			|ИЗ
			|	РегистрСведений.Сотрудники.СрезПоследних(&ДАТА, Сотрудник = &Сотрудник) КАК СотрудникиСрезПоследних";
			
			Запрос.УстановитьПараметр("ДАТА", Объект.Дата);
			Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Объект.Организация = ВыборкаДетальныеЗаписи.Организация;	
				
			КонецЦикла;
					
		КонецЕсли; 
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ВнеоборотныеАктивыВнеоборотныйАктивПриИзмененииНаСервере(ВнеоборотныйАктив)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	AzRyШтрихкодыВнеоборотныеАктивы.Штрихкод КАК Штрихкод
		|ПОМЕСТИТЬ Ш
		|ИЗ
		|	РегистрСведений.AzRyШтрихкодыВнеоборотныеАктивы КАК AzRyШтрихкодыВнеоборотныеАктивы
		|ГДЕ
		|	AzRyШтрихкодыВнеоборотныеАктивы.ВнеоборотныеАктивы = &ВнеоборотныйАктив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнеоборотныеАктивы.НачальнаяСтоимостьДляУменьшенногоОстатка КАК НачальнаяСтоимостьДляУменьшенногоОстатка,
		|	ВнеоборотныеАктивы.Ссылка КАК Ссылка,
		|	Ш.Штрихкод КАК Штрихкод
		|ИЗ
		|	Справочник.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы,
		|	Ш КАК Ш
		|ГДЕ
		|	ВнеоборотныеАктивы.Ссылка = &ВнеоборотныйАктив";
	
	Запрос.УстановитьПараметр("ВнеоборотныйАктив", ВнеоборотныйАктив);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Стр = Новый Структура("НачальнаяСтоимостьДляУменьшенногоОстатка, Штрихкод");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Стр.НачальнаяСтоимостьДляУменьшенногоОстатка = ВыборкаДетальныеЗаписи.НачальнаяСтоимостьДляУменьшенногоОстатка;	
		Стр.Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;
		
	КонецЦикла;
	
	Возврат Стр;
	
КонецФункции

&НаКлиенте
Процедура ВнеоборотныеАктивыВнеоборотныйАктивПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ВнеоборотныеАктивы.ТекущиеДанные; 
	
	Ответ = ВнеоборотныеАктивыВнеоборотныйАктивПриИзмененииНаСервере(СтрокаТабличнойЧасти.ВнеоборотныйАктив);
	
	СтрокаТабличнойЧасти.Штрихкод = Ответ.Штрихкод;
	СтрокаТабличнойЧасти.СтоимостьЗакупкиСНДС = Ответ.НачальнаяСтоимостьДляУменьшенногоОстатка;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.AzRyВидыОперацийПередачаИмуществаСотруднику.Возврат") Тогда
		ВидОперацииПриИзмененииНаСервере();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	
	Если Объект.ВидОперации = Перечисления.AzRyВидыОперацийПередачаИмуществаСотруднику.Возврат Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	AzRyПередачаИмуществаСотрудникуОстатки.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
		|	AzRyПередачаИмуществаСотрудникуОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.AzRyПередачаИмуществаСотруднику.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник) КАК AzRyПередачаИмуществаСотрудникуОстатки";
		
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Объект.ВнеоборотныеАктивы.Очистить();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = Объект.ВнеоборотныеАктивы.Добавить();
			НоваяСтрока.ВнеоборотныйАктив = ВыборкаДетальныеЗаписи.ВнеоборотныйАктив;
			
			Ответ = ВнеоборотныеАктивыВнеоборотныйАктивПриИзмененииНаСервере(ВыборкаДетальныеЗаписи.ВнеоборотныйАктив);		
			НоваяСтрока.Штрихкод = Ответ.Штрихкод;
			НоваяСтрока.СтоимостьЗакупкиСНДС = Ответ.НачальнаяСтоимостьДляУменьшенногоОстатка;
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	
	
КонецПроцедуры
