
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресТаблицыВХранилище = Параметры.АдресТаблицыВХранилище;
	а=1;
	Организация = Параметры.Отборы.Организация;
	ДатаИмпорта = Параметры.Отборы.Дата;
										 //ДокументыПоступления.Отбор.ДоступныеПоляОтбора.Элементы[17].Элементы[8]
	ГруппаОтбора = ДокументыПоступления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	//Отбираем только те у которых есть хоть одна запись в Запасах
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проведен");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	//Организация         ДокументыПоступления.Отбор.Элементы.Добавить(
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Организация;
	
	//Дата          ДокументыПоступления.Отбор.Элементы.Добавить(
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ДатаИмпорта;
	
	//ВидОперации
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
	
	//Отбираем только те у которых есть хоть одна запись в Запасах
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Запасы.НомерСтроки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = 1;
	
	// Только документы с пометкой Импорт
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Импорт");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ИспользоватьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
	УстановаитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура УстановаитьВидимость()

	Элементы.ЗапазыДокументаХарактеристика.Видимость = ИспользоватьХарактеристики;
	Элементы.ЗапазыДокументаХарактеристика.Доступность = ИспользоватьХарактеристики;
	
	Элементы.РезультатВыбора1Характеристика.Видимость = ИспользоватьХарактеристики;
	Элементы.РезультатВыбора1Характеристика.Доступность = ИспользоватьХарактеристики;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	а=1;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоступленияПриАктивизацииСтроки(Элемент)
	а=1;
	
	ТекСтрокаДокумент = Элементы.ДокументыПоступления.ТекущиеДанные;
	
	ЗапасыДокумента.Отбор.Элементы.Очистить();
	
	ГруппаОтбора = ЗапасыДокумента.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	//Отбираем номенклавтуру по выбранному документу
	Если ТекСтрокаДокумент <> Неопределено Тогда 
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ТекСтрокаДокумент.Ссылка;
		
	Иначе
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Документ.ПриходнаяНакладная.ПустаяСсылка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	ТаблицаВХранилище = РезультатВыбора.Выгрузить();
	ТаблицаВХранилище.Колонки.Найти("Документ").Имя = "ДокументПоступления";
	ПоместитьВоВременноеХранилище(ТаблицаВХранилище, АдресТаблицыВХранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Отказ = Ложь;
	
	//ПроверитьЗаполнениеРеквизитовФормы(Отказ);
	
	Если НЕ Отказ Тогда
		ЗаписатьПодборВХранилище();
		Закрыть(КодВозвратаДиалога.OK);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоступленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	ТекСтрокаДокумент = Элементы.ДокументыПоступления.ТекущиеДанные;
	ДокументыПоступленияВыборНаСервере(ТекСтрокаДокумент.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ДокументыПоступленияВыборНаСервере(ДокумментСсылка)
	      
	тчЗапасы = ДокумментСсылка.Запасы;
	тзЗагрузки = тчЗапасы.Выгрузить();
	
	Для Каждого Строк Из тзЗагрузки Цикл 
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Документ", ДокумментСсылка);
		СтруктураПоиска.Вставить("Номенклатура", Строк.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика", Строк.Характеристика);
		СтруктураПоиска.Вставить("Количество", Строк.Количество);
		СтруктураПоиска.Вставить("Цена", Строк.Цена);
		СтруктураПоиска.Вставить("Сумма", Строк.Сумма);
		//СтруктураПоиска.Вставить("СтавкаНДС", Строк.СтавкаНДС);
		
		ПоискСтроки = РезультатВыбора.НайтиСтроки(СтруктураПоиска);
		Если ПоискСтроки.Количество() = 0 Тогда 
			НовСтрок = РезультатВыбора.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрок, Строк);
			НовСтрок.Документ = ДокумментСсылка;
			НовСтрок.СтавкаНДС = НовСтрок.Номенклатура.СтавкаНДС;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗапазыДокументаВыборНаСервере(СтруктураСтроки)
	
	тзРезультатВыбора = РезультатВыбора.Выгрузить();
	ПоискСтроки = тзРезультатВыбора.НайтиСтроки(СтруктураСтроки);
	Если ПоискСтроки.Количество() = 0 Тогда 
		НовСтрок = РезультатВыбора.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрок, СтруктураСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапазыДокументаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрокаДокумент = Элементы.ЗапасыДокумента.ТекущиеДанные;
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Документ", ТекСтрокаДокумент.Ссылка);
	СтруктураСтроки.Вставить("ЕдиницаИзмерения", ТекСтрокаДокумент.ЕдиницаИзмерения);
	СтруктураСтроки.Вставить("Номенклатура", ТекСтрокаДокумент.Номенклатура);
	Если ИспользоватьХарактеристики Тогда //ИспользоватьХарактеристики
		СтруктураСтроки.Вставить("Характеристика", ТекСтрокаДокумент.Характеристика);
	КонецЕсли;
	СтруктураСтроки.Вставить("Количество", ТекСтрокаДокумент.Количество);
	СтруктураСтроки.Вставить("Цена", ТекСтрокаДокумент.Цена);
	СтруктураСтроки.Вставить("Сумма", ТекСтрокаДокумент.Сумма);
	СтруктураСтроки.Вставить("СтавкаНДС", ТекСтрокаДокумент.СтавкаНДС);
	
	ЗапазыДокументаВыборНаСервере(СтруктураСтроки);
	
КонецПроцедуры

&НаСервере
Процедура РезультатВыбора1НоменклатураПриИзмененииНаСервере(УИД)
	
	ТекСтрок = РезультатВыбора.НайтиПоИдентификатору(УИД);
	Если НЕ ЗначениеЗаполнено(ТекСтрок.Документ) Тогда 
		Сообщить(НСтр("ka='Укажите документ!';ru='Укажите документ!';en='Specify the document!'"));
		ТекСтрок.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		ТекСтрок.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
		ТекСтрок.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		ТекСтрок.Количество = 0;
		ТекСтрок.Цена = 0;
		ТекСтрок.Сумма = 0;
		ТекСтрок.СтавкаНДС = 0;
		Возврат;
	КонецЕсли;
	
	тчЗапасыДокумента = ТекСтрок.Документ.Запасы;
	
	//МассивСтрокЗапасов = тчЗапасыДокумента.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ЕдиницаИзмерения", ТекСтрок.Номенклатура, ТекСтрок.Характеристика, ТекСтрок.ЕдиницаИзмерения));
	МассивСтрокЗапасов = тчЗапасыДокумента.НайтиСтроки(Новый Структура("Номенклатура", ТекСтрок.Номенклатура));
	
	Если МассивСтрокЗапасов.Количество() = 0 Тогда 
		Сообщить(НСтр("ka='В документе нет указанной номенклатуры!';ru='В документе нет указанной номенклатуры!';en='The document is not specified range!'"));
		ТекСтрок.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатВыбора1НоменклатураПриИзменении(Элемент)
	
	ОчиститьСообщения();
	ТекСтрокаДокумент = Элементы.РезультатВыбора1.ТекущиеДанные;
	УИД = ТекСтрокаДокумент.ПолучитьИдентификатор();
	РезультатВыбора1НоменклатураПриИзмененииНаСервере(УИД);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзДокумента(Команда)
	
	ТекСтрокаДокумент = Элементы.ДокументыПоступления.ТекущиеДанные;
	ДокументыПоступленияВыборНаСервере(ТекСтрокаДокумент.Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура ДокументыПоступленияОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	ТекСтрокаДокумент = Элементы.ДокументыПоступления.ТекущиеДанные;
	ДокументыПоступленияВыборНаСервере(ТекСтрокаДокумент.Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыДокументаОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	ТекСтрокаДокумент = Элементы.ЗапасыДокумента.ТекущиеДанные;
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Документ", ТекСтрокаДокумент.Ссылка);
	СтруктураСтроки.Вставить("ЕдиницаИзмерения", ТекСтрокаДокумент.ЕдиницаИзмерения);
	СтруктураСтроки.Вставить("Номенклатура", ТекСтрокаДокумент.Номенклатура);
	СтруктураСтроки.Вставить("Характеристика", ТекСтрокаДокумент.Характеристика);
	СтруктураСтроки.Вставить("Количество", ТекСтрокаДокумент.Количество);
	СтруктураСтроки.Вставить("Цена", ТекСтрокаДокумент.Цена);
	СтруктураСтроки.Вставить("Сумма", ТекСтрокаДокумент.Сумма);
	СтруктураСтроки.Вставить("СтавкаНДС", ТекСтрокаДокумент.СтавкаНДС);
	
	ЗапазыДокументаВыборНаСервере(СтруктураСтроки);
	
КонецПроцедуры

