Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;
Перем ЗапросыИзБД;
Перем УтвержденияПроверкаТаблиц;
Перем РаботаСДокументами;

#Область ЮнитТестирование

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
	
	//РаботаСДокументами = КонтекстЯдра.Плагин("Plugin_РаботаСДокументами");
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.Добавить("ТЕСТ_ЧекККМ");
	
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура ТЕСТ_ЧекККМ() Экспорт
	
	Номенклатура = СоздатьНоменклатуру();	
	Контрагент   = СоздатьКонтрагент();
	КассаККМ     = КассаККМ();
	
    ЧекККМ                        = ЧекККМ(КассаККМ.Ссылка, Номенклатура.Ссылка);	
	РС_ЭлектроннаяНакладная       = РС_ЭлектроннаяНакладная(ЧекККМ.Ссылка);
	СчетФактураОтправленныйГрузия = СчетФактураОтправленныйГрузия(РС_ЭлектроннаяНакладная.Ссылка);
	
	//Результат = Метаданные.ОпределяемыеТипы.ВерсионируемыеДанные.Тип.СодержитТип(Тип("ДокументСсылка.ПриходныйОрдерНаТовары"));
	//Утверждения.ПроверитьРавенство(Результат, Истина, "Тип ВерсионируемыеДанные не содержит документа ПриходныйОрдер");
	//
	//Результат = Метаданные.ПодпискиНаСобытия.ЗаписатьВерсиюДокумента.Источник.СодержитТип(Тип("ДокументОбъект.ПриходныйОрдерНаТовары"));
	//Утверждения.ПроверитьРавенство(Результат, Истина, "Подкиска ЗаписатьВерсиюДокумента не содержит документа ПриходныйОрдер");
	
КонецПроцедуры	

Функция СоздатьНоменклатуру()

	Ном = Справочники.Номенклатура.СоздатьЭлемент();
	Ном.УстановитьНовыйКод();
	Ном.Наименование = "Тест";
	Ном.Записать();
	
	Возврат Ном;

КонецФункции

Функция СоздатьКонтрагент()

	Кон = Справочники.Контрагенты.СоздатьЭлемент();
	Кон.Наименование = "სატესტო კონტრაგენტი";
	Кон.Записать();
	
	Возврат Кон;
	
КонецФункции

Функция КассаККМ()

	ККТ = Справочники.КассыККМ.СоздатьЭлемент();
	ККТ.Наименование = "სატესტო საკასო აპარატი";
	ККТ.Владелец = Справочники.Организации.ОсновнаяОрганизация;
	ККТ.Записать();
	
	Возврат ККТ;

КонецФункции
 
Функция ЧекККМ(КассаККМ, Номенклатура)
	
	Док = Документы.ЧекККМ.СоздатьДокумент();
	Док.Организация = Справочники.Организации.ОсновнаяОрганизация;
	Док.Дата        = ТекущаяДата();
	Док.КассаККМ    = КассаККМ;
	
	НоваяСтрока = Док.Запасы.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура.Ссылка;
	НоваяСтрока.Количество   = 5;
	НоваяСтрока.Цена         = 5;
	
	Док.Записать(РежимЗаписиДокумента.Проведение);	
	
	Возврат Док;
	
КонецФункции
 
Функция РС_ЭлектроннаяНакладная(ЧекККМ)

	РС_ЭлектроннаяНакладная = Документы.РС_ЭлектроннаяНакладная.СоздатьДокумент();
	РС_ЭлектроннаяНакладная.Заполнить(ЧекККМ);
	
	НоваяСтрока = РС_ЭлектроннаяНакладная.ДокументыОснования.Добавить();
	НоваяСтрока.ДокументОснование = ЧекККМ; 
	
	РС_ЭлектроннаяНакладная.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат РС_ЭлектроннаяНакладная;
	
КонецФункции

Функция СчетФактураОтправленныйГрузия(РС_ЭлектроннаяНакладная)

	Док = Документы.СчетФактураОтправленныйГрузия.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Заполнить(РС_ЭлектроннаяНакладная);
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Док;

КонецФункции
 
 