
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОтменитьСчетФактуру(ПараметрКоманды);
	Оповестить("ПерепрочитатьФорму");
	Состояние(НСтр("ka='RS.GE-ს სერვერთან მუშაობა დასრულებულია';ru='Работа с сервером RS.GE завершена'"));
КонецПроцедуры


&НаСервере
Процедура ОтменитьСчетФактуру(ПараметрКоманды)
	
	Для Каждого Ссылка ИЗ ПараметрКоманды Цикл
		Если НЕ Ссылка.Проведен Тогда
			ТекстСообщения = Строка(Ссылка) + " არ არის გატარებული. შეუძლებელია ანგარიშფაქტურის უარყოფა!";
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Ссылка, ТекстСообщения, , , , Истина);
			Продолжить;
		КонецЕсли;
		
		Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтменитьСчетФактуру(Ссылка, Ссылка.Идентификатор) = Неопределено Тогда
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбновитьИдентификаторИСтатусДокументаСФ(Ссылка, Ссылка.Идентификатор, 6);			
		Иначе
			//ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбновитьСтатусыСФ(Ссылка);
			ТекстСообщения = НСтр("ka='ანგარიშფაქტურის უარყოფა ვერ მოხერხდა';ru='Не удалось отменить счет-фактуру'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Ссылка, ТекстСообщения, , , , Истина);
		КонецЕсли;

	КонецЦикла;	
	
КонецПроцедуры