////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дополнительные отчеты и обработки в модели сервиса", процедуры
//  и функции с повторным использованием возвращаемых значений.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция возвращает фиксированную массив, содержащий имена констант, регулирующих доступность
//  использования дополнительных отчетов и обработок в модели сервиса.
//
Функция РегулирующиеКонстанты() Экспорт
	
	Результат = Новый Массив();
	Результат.Добавить("НезависимоеИспользованиеДополнительныхОтчетовИОбработокВМоделиСервиса");
	Результат.Добавить("ИспользованиеКаталогаДополнительныхОтчетовИОбработокВМоделиСервиса");
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

// Функция возвращает массив, содержащий имена реквизитов справочника ДополнительныеОтчетыИОбработки,
//  которые запрещено изменять при наличии связи с поставляемыми обработками.
//
Функция КонтролируемыеРеквизиты() Экспорт
	
	Результат = Новый Массив();
	Результат.Добавить("БезопасныйРежим");
	Результат.Добавить("ХранилищеОбработки");
	Результат.Добавить("ИмяОбъекта");
	Результат.Добавить("Версия");
	Результат.Добавить("Вид");
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

// Функция возвращает соответствие элементов перечисления ПричиныОтключенияДополнительныхОтчетовИОбработокВМоделиСервиса
//  подробному описанию причины отключения.
//
Функция РасширенныеОписанияПричинБлокировки() Экспорт
	
	Причины = Перечисления.ПричиныОтключенияДополнительныхОтчетовИОбработокВМоделиСервиса;
	
	Результат = Новый Соответствие();
	Результат.Вставить(Причины.БлокировкаАдминистраторомСервиса, НСтр("ka='სერვისის წესების დარღვევისთვის დამატებითი დამუშავების გამოყენება აკრძალულია!';ru='Использование дополнительной обработки запрещено из-за нарушений правил сервиса!';en='The use of additional treatment is prohibited because of the violations of the rules of service!'"));
	Результат.Вставить(Причины.БлокировкаВладельцем, НСтр("ka='დამატებითი დამუშავების გამოყენება დამუშავების მფლობელის მიერ აკრძალულია!';ru='Использование дополнительной обработки запрещено владельцем обработки!';en='The use of additional treatment prohibited by the owner of the treatment!'"));
	Результат.Вставить(Причины.ОбновлениеВерсииКонфигурации, НСтр("ka='დამატებითი დამუშავების გამოყენება დროებით მიუწვდომელია დანართის განახლების შესრულების მიზეზის გამო. მოცემულ პროცესს შეიძლება რამდენიმე წუთი დასჭირდეს. ბოდიშს გიხდით შექმნილი უხერხულობისთვის.';ru='Использование дополнительной обработки временно недоступно по причине выполнения обновления приложения. Данный процесс может занять несколько минут. Приносим извинения на доставленные неудобства.';en='The use of additional treatment is temporarily unavailable due to the upgrade application. This process can take several minutes. We apologize to any inconvenience caused.'"));
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

#КонецОбласти