

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

//Экспортные переменные

//Обычные переменные


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

КонецПроцедуры

&НаСервере
Процедура ОбновитьДополнительныеРеквизиты()
	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	ИДСтроки = Элементы.Сотрудники.ТекущаяСтрока;
	ЗаполнитьДанныеСотрудника(ИДСтроки);
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДанныеСотрудника(ИДСтроки)
	
	ТекСтрока = Объект.Сотрудники.НайтиПоИдентификатору(ИДСтроки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.СтруктурнаяЕдиница КАК Подразделение,
		|	Сотрудники.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
		|	МАКСИМУМ(ПлановыеНачисленияИУдержания.ВидНачисленияУдержания) КАК ВидРасчета
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник) КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(
		|				&Дата,
		|				Сотрудник = &Сотрудник
		|					И ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)) КАК ПлановыеНачисленияИУдержания
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.СтруктурнаяЕдиница,
		|	Сотрудники.ВидУдержанияНДФЛ";
	Запрос.УстановитьПараметр("Дата", 				Объект.Дата);
	Запрос.УстановитьПараметр("Организация", 		Объект.Организация);
	Запрос.УстановитьПараметр("Сотрудник",			ТекСтрока.Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ТекСтрока, Выборка);
		
		СтавкаНДФЛ	= ?(ЗначениеЗаполнено(ТекСтрока.ВидУдержанияНДФЛ), ТекСтрока.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0);
		ТекСтрока.СуммаНДФЛ = (ТекСтрока.ЗачисленнаяСумма * СтавкаНДФЛ / 100) / 2;
		
	Иначе
		ТекСтрока.Подразделение = Неопределено;
		ТекСтрока.ВидУдержанияНДФЛ	= Неопределено;
		ТекСтрока.СуммаНДФЛ		= 0;
		ТекСтрока.ВидРасчета	= Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СотрудникиСтавкаНДФЛПриИзменении(Элемент)
	РасчитатьСуммыТЧ(Элементы.Сотрудники.ТекущаяСтрока);
КонецПроцедуры
&НаКлиенте
Процедура СотрудникиЗачисленнаяСуммаПриИзменении(Элемент)
	РасчитатьСуммыТЧ(Элементы.Сотрудники.ТекущаяСтрока);
КонецПроцедуры
&НаСервере
Процедура РасчитатьСуммыТЧ(ИД, ИмяТЧ = "Сотрудники")
	
	ТекСтрока = Объект[ИмяТЧ].НайтиПоИдентификатору(ИД);
	СтавкаНДФЛ	= ?(ЗначениеЗаполнено(ТекСтрока.ВидУдержанияНДФЛ), ТекСтрока.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0);
	ТекСтрока.СуммаНДФЛ = (ТекСтрока.ЗачисленнаяСумма * СтавкаНДФЛ / 100)/2;
	
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентыКонтрагентПриИзменении(Элемент)
	КонтрагентыКонтрагентПриИзмененииНаСервере(Элементы.Контрагенты.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура КонтрагентыКонтрагентПриИзмененииНаСервере(ИД)
	
	ТекСтрока = Объект.Контрагенты.НайтиПоИдентификатору(ИД);
	ОсновнойДоговорКонтрагента = ТекСтрока.Контрагент.ДоговорПоУмолчанию;
	Если ОсновнойДоговорКонтрагента.УчитыватьНДФЛ Тогда
		ТекСтрока.ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
		ТекСтрока.ВидУдержанияНДФЛ		 = ОсновнойДоговорКонтрагента.ВидУдержанияНДФЛ;
		Если ЗначениеЗаполнено(ТекСтрока.ЗачисленнаяСумма) Тогда
			СтавкаНДФЛ	= ?(ЗначениеЗаполнено(ТекСтрока.ВидУдержанияНДФЛ), ТекСтрока.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0);
			ТекСтрока.СуммаНДФЛ = ТекСтрока.ЗачисленнаяСумма * СтавкаНДФЛ / 100;
		Иначе
			ТекСтрока.СуммаНДФЛ = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыДоговорКонтрагентаПриИзменении(Элемент)
	ТекДанные = Элементы.Контрагенты.ТекущиеДанные;
	ТекДанные.ВидУдержанияНДФЛ = РС_ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекДанные.ДоговорКонтрагента, "ВидУдержанияНДФЛ");
	РасчитатьСуммыТЧ(ТекДанные.ПолучитьИдентификатор(), "Контрагенты");
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыЗачисленнаяСуммаПриИзменении(Элемент)
	РасчитатьСуммыТЧ(Элементы.Контрагенты.ТекущаяСтрока, "Контрагенты");
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыСтавкаНДФЛПриИзменении(Элемент)
	РасчитатьСуммыТЧ(Элементы.Контрагенты.ТекущаяСтрока, "Контрагенты");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры
