
&НаСервере
&После("ОбновитьВиджетПродажи")
Процедура РасшAzRy_ОбновитьВиджетПродажи(ДанныеПродажи, НастройкаВиджета)
	
	КонтролироватьОстаткиПриПроведении = Константы.КонтролироватьОстаткиПриПроведении.Получить(); 	
	Если КонтролироватьОстаткиПриПроведении Тогда
		Элементы.AzRyПереключательКонтролироватьОстаткиВыкл.Видимость = Ложь;
		Элементы.AzRyПереключательКонтролироватьОстаткиВкл.Видимость = Истина;
	Иначе 	
		Элементы.AzRyПереключательКонтролироватьОстаткиВыкл.Видимость = Истина;
		Элементы.AzRyПереключательКонтролироватьОстаткиВкл.Видимость = Ложь;	
	КонецЕсли;
	
	ОтключениеКонтроляОстатковВДокументахДенежныхСредств = Не Константы.ОтключениеКонтроляОстатковВДокументахДенежныхСредств.Получить();	
	Если ОтключениеКонтроляОстатковВДокументахДенежныхСредств Тогда
		Элементы.AzRyОтключениеКонтроляОстатковВДокументахДенежныхСредствВыкл.Видимость = Ложь;
		Элементы.AzRyОтключениеКонтроляОстатковВДокументахДенежныхСредствВкл.Видимость = Истина;
	Иначе 	
		Элементы.AzRyОтключениеКонтроляОстатковВДокументахДенежныхСредствВыкл.Видимость = Истина;
		Элементы.AzRyОтключениеКонтроляОстатковВДокументахДенежныхСредствВкл.Видимость = Ложь;	
	КонецЕсли;	 	
	
КонецПроцедуры
