
Процедура СоздатьДокументПроизводстваСПроверкойОстатков(ДокументОбъект) Экспорт

	Если НЕ ПолучитьФункциональнуюОпцию("АвтоматическоеПроизводство") Тогда 
		Возврат;
	КонецЕсли;
	
	ДатаОстатков 		= ДокументОбъект.Дата - 1;
	Дата 				= ДокументОбъект.Дата;
	Организация 		= ДокументОбъект.Организация;
	СтруктурнаяЕдиница 	= ДокументОбъект.СтруктурнаяЕдиница;
	тзЗапасы 			= ДокументОбъект.Запасы.Выгрузить();
	Автор 				= ДокументОбъект.Автор;
	Подразделение 		= ДокументОбъект.Подразделение;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗапасы.Номенклатура КАК Номенклатура,
		|	тзЗапасы.Характеристика КАК Характеристика,
		|	тзЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	тзЗапасы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			&ДатаОстатков,
		|			&Организация = Организация
		|				И &СтруктурнаяЕдиница = СтруктурнаяЕдиница
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						а.Номенклатура,
		|						а.Характеристика
		|					ИЗ
		|						ВТ_Запасы КАК а)) КАК ЗапасыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	-(ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество) КАК Количество,
		|	ВТ_Запасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_Запасы.Характеристика КАК Характеристика,
		|	АвтоматическоеПроизводство.Спецификация КАК Спецификация
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
		|		ПО ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО (ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура)
		|			И ВТ_Запасы.Характеристика = ВТ_Остатки.Характеристика
		|ГДЕ
		|	ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|	И ВТ_Запасы.Характеристика = АвтоматическоеПроизводство.Характеристика
		|	И ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество < 0";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);
				
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СборкаЗапасов = Неопределено;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Номенклатуранайдена = Истина;
		СборкаЗапасов = Документы.СборкаЗапасов.СоздатьДокумент();
		СборкаЗапасов.Автор = Автор;
		СборкаЗапасов.СтруктурнаяЕдиница = СтруктурнаяЕдиница;

		СборкаЗапасов.Дата = Дата - 1;
		СборкаЗапасов.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка;
		СборкаЗапасов.Организация = Справочники.Организации.ОсновнаяОрганизация;
		СборкаЗапасов.СтруктурнаяЕдиницаПродукции = СтруктурнаяЕдиница;
		СборкаЗапасов.СтруктурнаяЕдиница = Подразделение;
		СборкаЗапасов.СтруктурнаяЕдиницаОтходов = СтруктурнаяЕдиница;
		СборкаЗапасов.СтруктурнаяЕдиницаЗапасов = СтруктурнаяЕдиница;
		СборкаЗапасов.Продукция.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЦикла;
	
	Если СборкаЗапасов = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗапасы.Номенклатура КАК Номенклатура,
		|	тзЗапасы.Характеристика КАК Характеристика,
		|	тзЗапасы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			&ДатаОстатков,
		|			&Организация = Организация
		|				И &СтруктурнаяЕдиница = СтруктурнаяЕдиница
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						а.Номенклатура,
		|						а.Характеристика
		|					ИЗ
		|						ВТ_Запасы КАК а)) КАК ЗапасыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	ВТ_Запасы.Характеристика КАК Характеристика,
		|	-(ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество) КАК Количество
		|ПОМЕСТИТЬ ТаблицаЗапасы
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО ВТ_Запасы.Номенклатура = ВТ_Остатки.Номенклатура
		|			И ВТ_Запасы.Характеристика = ВТ_Остатки.Характеристика
		|ГДЕ
		|	ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпецификацииСостав.Ссылка КАК Ссылка,
		|	СпецификацииСостав.НомерСтроки КАК НомерСтроки,
		|	СпецификацииСостав.ТипСтрокиСостава КАК ТипСтрокиСостава,
		|	СпецификацииСостав.Номенклатура КАК Номенклатура,
		|	СпецификацииСостав.Характеристика КАК Характеристика,
		|	СпецификацииСостав.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СпецификацииСостав.КоличествоПродукции КАК КоличествоПродукции,
		|	СпецификацииСостав.ДоляСтоимости КАК ДоляСтоимости,
		|	СпецификацииСостав.Спецификация КАК Спецификация,
		|	СУММА(СпецификацииСостав.Количество / СпецификацииСостав.КоличествоПродукции * ТаблицаЗапасы.Количество) КАК Количество
		|ИЗ
		|	ТаблицаЗапасы КАК ТаблицаЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
		|		ПО ТаблицаЗапасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура,
		|	Справочник.Спецификации.Состав КАК СпецификацииСостав,
		|	Справочник.Спецификации КАК Спецификации
		|ГДЕ
		|	ТаблицаЗапасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|	И Спецификации.Владелец = АвтоматическоеПроизводство.Номенклатура
		|	И Спецификации.Состав.Ссылка = СпецификацииСостав.Ссылка
		|	И ТаблицаЗапасы.Характеристика = АвтоматическоеПроизводство.Характеристика
		|	И СпецификацииСостав.Ссылка = АвтоматическоеПроизводство.Спецификация
		|
		|СГРУППИРОВАТЬ ПО
		|	СпецификацииСостав.Ссылка,
		|	СпецификацииСостав.НомерСтроки,
		|	СпецификацииСостав.ТипСтрокиСостава,
		|	СпецификацииСостав.Номенклатура,
		|	СпецификацииСостав.Характеристика,
		|	СпецификацииСостав.ЕдиницаИзмерения,
		|	СпецификацииСостав.КоличествоПродукции,
		|	СпецификацииСостав.ДоляСтоимости,
		|	СпецификацииСостав.Спецификация";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТЗапаси", тзЗапасы);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		
		СборкаЗапасов.Запасы.Загрузить(Результат.Выгрузить());
		
	КонецЦикла;
	
	Если Номенклатуранайдена Тогда 
		СборкаЗапасов.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьДокументПроизводстваБезПроверкиОстатков(ДокументОбъект) Экспорт

	Если НЕ ПолучитьФункциональнуюОпцию("АвтоматическоеПроизводство") Тогда 
		Возврат;
	КонецЕсли;
	     	
	Дата 				= ДокументОбъект.Дата;
	Организация 		= ДокументОбъект.Организация;
	СтруктурнаяЕдиница 	= ДокументОбъект.СтруктурнаяЕдиница;
	тзЗапасы 			= ДокументОбъект.Запасы.Выгрузить();
	Автор 				= ДокументОбъект.Автор;
	Подразделение 		= ДокументОбъект.Подразделение;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗапасы.Номенклатура,
		|	тзЗапасы.Количество,
		|	тзЗапасы.ЕдиницаИзмерения,
		|	тзЗапасы.Характеристика
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Номенклатура,
		|	ВТ_Запасы.Количество КАК Количество,
		|	ВТ_Запасы.ЕдиницаИзмерения,
		|	ВТ_Запасы.Характеристика,
		|	АвтоматическоеПроизводство.Спецификация
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
		|		ПО ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|ГДЕ
		|	ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|	И ВТ_Запасы.Характеристика = АвтоматическоеПроизводство.Характеристика";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);
				
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СборкаЗапасов = Неопределено;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Номенклатуранайдена = Истина;
		СборкаЗапасов = Документы.СборкаЗапасов.СоздатьДокумент();
		СборкаЗапасов.Автор = Автор;
		СборкаЗапасов.СтруктурнаяЕдиница = СтруктурнаяЕдиница;

		СборкаЗапасов.Дата = Дата - 1;
		СборкаЗапасов.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка;
		СборкаЗапасов.Организация = Справочники.Организации.ОсновнаяОрганизация;
		СборкаЗапасов.СтруктурнаяЕдиницаПродукции = СтруктурнаяЕдиница;
		СборкаЗапасов.СтруктурнаяЕдиница = Подразделение;
		СборкаЗапасов.СтруктурнаяЕдиницаОтходов = СтруктурнаяЕдиница;
		СборкаЗапасов.СтруктурнаяЕдиницаЗапасов = СтруктурнаяЕдиница; 
		СборкаЗапасов.ДокументАвтоматическогоПроизводства = ДокументОбъект.Ссылка;
		СборкаЗапасов.Продукция.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЦикла;
	
	Если СборкаЗапасов = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗапаси.Номенклатура,
		|	ТЗапаси.Характеристика,
		|	ТЗапаси.Количество
		|ПОМЕСТИТЬ ТЗапасы
		|ИЗ
		|	&ТЗапаси КАК ТЗапаси
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗапасы.Номенклатура,
		|	ТЗапасы.Характеристика,
		|	ТЗапасы.Количество
		|ПОМЕСТИТЬ ТаблицаЗапасы
		|ИЗ
		|	ТЗапасы КАК ТЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпецификацииСостав.Ссылка,
		|	СпецификацииСостав.НомерСтроки,
		|	СпецификацииСостав.ТипСтрокиСостава,
		|	СпецификацииСостав.Номенклатура,
		|	СпецификацииСостав.Характеристика,
		|	СпецификацииСостав.ЕдиницаИзмерения,
		|	СУММА(СпецификацииСостав.Количество / СпецификацииСостав.КоличествоПродукции * ТаблицаЗапасы.Количество) КАК Количество,
		|	СпецификацииСостав.КоличествоПродукции,
		|	СпецификацииСостав.ДоляСтоимости,
		|	СпецификацииСостав.Спецификация
		|ИЗ
		|	ТаблицаЗапасы КАК ТаблицаЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
		|		ПО ТаблицаЗапасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура,
		|	Справочник.Спецификации.Состав КАК СпецификацииСостав,
		|	Справочник.Спецификации КАК Спецификации
		|ГДЕ
		|	ТаблицаЗапасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|	И Спецификации.Владелец = АвтоматическоеПроизводство.Номенклатура
		|	И Спецификации.Состав.Ссылка = СпецификацииСостав.Ссылка
		|	И ТаблицаЗапасы.Характеристика = АвтоматическоеПроизводство.Характеристика
		|	И СпецификацииСостав.Ссылка = АвтоматическоеПроизводство.Спецификация
		|
		|СГРУППИРОВАТЬ ПО
		|	СпецификацииСостав.Ссылка,
		|	СпецификацииСостав.НомерСтроки,
		|	СпецификацииСостав.ТипСтрокиСостава,
		|	СпецификацииСостав.Номенклатура,
		|	СпецификацииСостав.Характеристика,
		|	СпецификацииСостав.ЕдиницаИзмерения,
		|	СпецификацииСостав.КоличествоПродукции,
		|	СпецификацииСостав.ДоляСтоимости,
		|	СпецификацииСостав.Спецификация";
	
	
	Запрос.УстановитьПараметр("ТЗапаси", тзЗапасы);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		
		СборкаЗапасов.Запасы.Загрузить(Результат.Выгрузить());
		
	КонецЦикла;
	
	Если Номенклатуранайдена Тогда 
		СборкаЗапасов.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	ДокументОбъект.ДокументАвтоматическогоПроизводства = СборкаЗапасов.Ссылка;
	
КонецПроцедуры

Процедура СоздатьДокументПроизводстваСПроверкойОстатков_ДокументСборкаЗапасав(ДокументОбъект) Экспорт

	Если НЕ ПолучитьФункциональнуюОпцию("АвтоматическоеПроизводство") Тогда 
		Возврат;
	КонецЕсли;
	
	ДатаОстатков 		= ДокументОбъект.Дата - 1;
	Дата 				= ДокументОбъект.Дата;
	Организация 		= ДокументОбъект.Организация;
	СтруктурнаяЕдиница 	= ДокументОбъект.СтруктурнаяЕдиница;
	тзЗапасы 			= ДокументОбъект.Запасы.Выгрузить();
	Автор 				= ДокументОбъект.Автор;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗапасы.Номенклатура КАК Номенклатура,
		|	тзЗапасы.Характеристика КАК Характеристика,
		|	тзЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	тзЗапасы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			&ДатаОстатков,
		|			&Организация = Организация
		|				И &СтруктурнаяЕдиница = СтруктурнаяЕдиница
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						а.Номенклатура,
		|						а.Характеристика
		|					ИЗ
		|						ВТ_Запасы КАК а)) КАК ЗапасыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	-(ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество) КАК Количество,
		|	ВТ_Запасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_Запасы.Характеристика КАК Характеристика,
		|	АвтоматическоеПроизводство.Спецификация КАК Спецификация
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
		|		ПО ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО (ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура)
		|			И ВТ_Запасы.Характеристика = ВТ_Остатки.Характеристика
		|ГДЕ
		|	ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|	И ВТ_Запасы.Характеристика = АвтоматическоеПроизводство.Характеристика
		|	И ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество < 0";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);
				
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СборкаЗапасов = Неопределено;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Номенклатуранайдена = Истина;
		СборкаЗапасов = Документы.СборкаЗапасов.СоздатьДокумент();
		СборкаЗапасов.Автор = Автор;
		СборкаЗапасов.СтруктурнаяЕдиница = СтруктурнаяЕдиница;

		СборкаЗапасов.Дата = Дата - 1;
		СборкаЗапасов.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка;
		СборкаЗапасов.Организация = Организация;
		СборкаЗапасов.СтруктурнаяЕдиницаПродукции = ДокументОбъект.СтруктурнаяЕдиницаПродукции;
		СборкаЗапасов.СтруктурнаяЕдиница = ДокументОбъект.СтруктурнаяЕдиница;
		СборкаЗапасов.СтруктурнаяЕдиницаОтходов = ДокументОбъект.СтруктурнаяЕдиницаОтходов;
		СборкаЗапасов.СтруктурнаяЕдиницаЗапасов = ДокументОбъект.СтруктурнаяЕдиницаЗапасов;
		СборкаЗапасов.ДокументАвтоматическогоПроизводства = ДокументОбъект.Ссылка;
		СборкаЗапасов.Продукция.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЦикла;
	
	Если СборкаЗапасов = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗапасы.Номенклатура КАК Номенклатура,
		|	тзЗапасы.Характеристика КАК Характеристика,
		|	тзЗапасы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			&ДатаОстатков,
		|			&Организация = Организация
		|				И &СтруктурнаяЕдиница = СтруктурнаяЕдиница
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						а.Номенклатура,
		|						а.Характеристика
		|					ИЗ
		|						ВТ_Запасы КАК а)) КАК ЗапасыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	ВТ_Запасы.Характеристика КАК Характеристика,
		|	-(ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество) КАК Количество
		|ПОМЕСТИТЬ ТаблицаЗапасы
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО ВТ_Запасы.Номенклатура = ВТ_Остатки.Номенклатура
		|			И ВТ_Запасы.Характеристика = ВТ_Остатки.Характеристика
		|ГДЕ
		|	(ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество) < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпецификацииСостав.Ссылка КАК Ссылка,
		|	СпецификацииСостав.НомерСтроки КАК НомерСтроки,
		|	СпецификацииСостав.ТипСтрокиСостава КАК ТипСтрокиСостава,
		|	СпецификацииСостав.Номенклатура КАК Номенклатура,
		|	СпецификацииСостав.Характеристика КАК Характеристика,
		|	СпецификацииСостав.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СпецификацииСостав.КоличествоПродукции КАК КоличествоПродукции,
		|	СпецификацииСостав.ДоляСтоимости КАК ДоляСтоимости,
		|	СпецификацииСостав.Спецификация КАК Спецификация,
		|	СУММА(СпецификацииСостав.Количество / СпецификацииСостав.КоличествоПродукции * ТаблицаЗапасы.Количество) КАК Количество
		|ИЗ
		|	ТаблицаЗапасы КАК ТаблицаЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
		|		ПО ТаблицаЗапасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура,
		|	Справочник.Спецификации.Состав КАК СпецификацииСостав,
		|	Справочник.Спецификации КАК Спецификации
		|ГДЕ
		|	ТаблицаЗапасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|	И Спецификации.Владелец = АвтоматическоеПроизводство.Номенклатура
		|	И Спецификации.Состав.Ссылка = СпецификацииСостав.Ссылка
		|	И ТаблицаЗапасы.Характеристика = АвтоматическоеПроизводство.Характеристика
		|	И СпецификацииСостав.Ссылка = АвтоматическоеПроизводство.Спецификация
		|
		|СГРУППИРОВАТЬ ПО
		|	СпецификацииСостав.Ссылка,
		|	СпецификацииСостав.НомерСтроки,
		|	СпецификацииСостав.ТипСтрокиСостава,
		|	СпецификацииСостав.Номенклатура,
		|	СпецификацииСостав.Характеристика,
		|	СпецификацииСостав.ЕдиницаИзмерения,
		|	СпецификацииСостав.КоличествоПродукции,
		|	СпецификацииСостав.ДоляСтоимости,
		|	СпецификацииСостав.Спецификация";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		
		СборкаЗапасов.Запасы.Загрузить(Результат.Выгрузить());
		
	КонецЦикла;
	
	Если Номенклатуранайдена Тогда 
		СборкаЗапасов.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	ДокументОбъект.ДокументАвтоматическогоПроизводства = СборкаЗапасов.Ссылка;
	
КонецПроцедуры
