#Если Не ВебКлиент Тогда
	
// Функция - Получить параметры соединения с банком ProCredit для пользователя
//
// Параметры:
//  ТекущийПользователь	 - СправочникСсылка.Пользователи - пользователь, для которого нужно получить настройки
// 
// Возвращаемое значение:
// 	Поля структуры:
//      ProCredit_Login					 - Строка - логин пользователя
//      ProCredit_Password				 - Строка - пароль пользователя
//      ProCredit_ТестовыйРежим			 - Булево - работаем в тестовом режиме
//      ProCredit_РаботаЧерезСервер		 - Булево - предполагается, что соединение с сайтом ProCredit будет происходить с сервера 1С
//
Функция ПолучитьПараметрыСоединенияProCredit(ТекущийПользователь = НЕОПРЕДЕЛЕНО) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ИнтеграцияСБанкомProCredit_Сервер.ПолучитьПараметрыСоединенияProCredit(ТекущийПользователь);
	
	Возврат РЕЗ;
КонецФункции // () 

// Процедура - Выполнить запрос к сервису банка ProCredit
//
// Параметры:
//  ПараметрыСоединенияProCredit				 - Структура:
//      ProCredit_Login					 - Строка - логин пользователя
//      ProCredit_Password				 - Строка - пароль пользователя
//      ProCredit_ТестовыйРежим			 - Булево - работаем в тестовом режиме
//      ProCredit_РаботаЧерезСервер		 - Булево - предполагается, что соединение с сайтом ProCredit будет происходить с сервера 1С
//  СтруктураПарметровЗапросаВБанк	 - Структура:
//		ИмяМетода					 - Строка - имя метода, вызываемого в запросе в банк
//		МассивДокументов			 - Массив - массив ссылок на документы, для которых выполняется запрос в банке
//		Другие поля					 - различные другие поля, необходимые для составления запроса в банке
//
Процедура ВыполнитьЗапросВБанк(ПараметрыСоединенияProCredit, СтруктураПарметровЗапросаВБанк) ЭКСПОРТ
	
	ИмяМетода = СтруктураПарметровЗапросаВБанк.ИмяМетода;
	
	Если ИмяМетода = "GetTransferStatus" Тогда
		
		МассивДокументов = СтруктураПарметровЗапросаВБанк.МассивДокументов;
		
		Для каждого ДокументСсылка Из МассивДокументов Цикл
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для документа: """+ ДокументСсылка + """'; ka = 'დოკუმენტისთვის: """+ ДокументСсылка + """'"));
			
			НовыйДокументов = Новый Массив();
			НовыйДокументов.Добавить(ДокументСсылка);
		
			Массив_УИД_Документа = ИнтеграцияСБанкомProCredit_Сервер.ПолучитьМассив_УИД_Документа(ДокументСсылка);
			
			Если Массив_УИД_Документа.Количество()=0 Тогда
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ: """+ДокументСсылка+""" ранее не выгружался в банк ProCredit'; ka = 'დოკუმენტი: """+ДокументСсылка+""" ადრე არ იყო ატვირტული პროკრედიტ ბანკში'"));
				
				Продолжить;
			
			КонецЕсли;
			
			Для каждого ТекущаяУИД Из Массив_УИД_Документа Цикл
				
				НоваяСтруктураПарметровЗапросаВБанк = Новый Структура;
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода",ИмяМетода); 
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("ИмяСервиса", "api/Transfer/GetTransferStatus");
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("ID_Отправки", ТекущаяУИД);
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("МассивДокументов",НовыйДокументов);
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("УИД", ТекущаяУИД);
				
				РезультатОперации = ВыполнитьМетодСервиса(ПараметрыСоединенияProCredit, НоваяСтруктураПарметровЗапросаВБанк);
				
				Если РезультатОперации.Успешно Тогда
					
					СтруктураОтвета = РезультатОперации.ВозвращаемоеЗначение;
					
					ИнтеграцияСБанкомProCredit_Сервер.ОбновитьСтатусДокумента(ДокументСсылка,СтруктураОтвета,НоваяСтруктураПарметровЗапросаВБанк,ТекущаяУИД);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ: """+ДокументСсылка+""" статус обновлен'; ka = 'დოკუმენტი: """+ДокументСсылка+""" სტატუსი განახლებულია'"));
					
				Иначе
					
					Если ТипЗНЧ(РезультатОперации.ВозвращаемоеЗначение) = Тип("Структура") И РезультатОперации.ВозвращаемоеЗначение.Свойство("ТекстОшибки") Тогда
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ВозвращаемоеЗначение.ТекстОшибки);
						
					Иначе
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.Описание);
						
					КонецЕсли;
					
				КонецЕсли;				
				
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли ИмяМетода = "SendTransfers" Тогда
		
		МассивДокументов = СтруктураПарметровЗапросаВБанк.МассивДокументов;
		
		Для каждого ДокументСсылка Из МассивДокументов Цикл
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для документа: """+ ДокументСсылка + """'; ka = 'დოკუმენტისთვის: """+ ДокументСсылка + """'"));
			
			НовыйДокументов = Новый Массив();
			НовыйДокументов.Добавить(ДокументСсылка);
		
			Массив_УИД_Документа = ИнтеграцияСБанкомProCredit_Сервер.ПолучитьМассив_УИД_Документа(ДокументСсылка);
			
			Если Массив_УИД_Документа.Количество()>0 Тогда
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ: """+ДокументСсылка+""" ранее был выгружен в банк ProCredit'; ka = 'დოკუმენტი: """+ДокументСсылка+""" ადრე აიტვირთა პროკრედიტ ბანკში'"));
				
				Продолжить;
			
			КонецЕсли;
			
			СтруктураJSONДокументов =ИнтеграцияСБанкомProCredit_Сервер.ПолучитьСтруктуруJSONДокументов(ДокументСсылка);//ДокументСсылка);
			ТаблицаПозицийАдресВременногоХранилища = ИнтеграцияСБанкомTBC_Сервер.ПолучитьТаблицуПозицийВременноеХранилище();
			
			НоваяСтруктураПарметровЗапросаВБанк = Новый Структура();
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода",ИмяМетода); 
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("ИмяСервиса", "api/Transfer/SendTransfers");
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("ВалютаУчета",СтруктураПарметровЗапросаВБанк.ВалютаУчета);
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("СтруктураJSONДокументов",СтруктураJSONДокументов);
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("ТаблицаПозиций",ТаблицаПозицийАдресВременногоХранилища);
			
			РезультатОперации = ВыполнитьМетодСервиса(ПараметрыСоединенияProCredit,НоваяСтруктураПарметровЗапросаВБанк);
			
			Если РезультатОперации.Успешно Тогда
				
				ID_Отправки = РезультатОперации.ВозвращаемоеЗначение.Data.RequestId;
				
				НоваяСтруктураПарметровЗапросаВБанк = Новый Структура;
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода","GetTransferStatus"); 
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("ИмяСервиса", "api/Transfer/GetTransferStatus");
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("ID_Отправки",ID_Отправки);
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("УИД", ТекущаяУИД);
				
				РезультатОперации = ВыполнитьМетодСервиса(ПараметрыСоединенияProCredit, НоваяСтруктураПарметровЗапросаВБанк);
				
				ИнтеграцияСБанкомProCredit_Сервер.ОбработатьВыгрузкуДокументовВБанкНаСервере(РезультатОперации.ВозвращаемоеЗначение,ТаблицаПозицийАдресВременногоХранилища,ID_Отправки,ДокументСсылка);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ: """+ДокументСсылка+""" успешно выгружен в банк ProCredit'; ka = 'დოკუმენტი: """+ДокументСсылка+"""  წარმატებით აიტვირთა პროკრედიტ ბანკში'"));
				
			Иначе
				
				Если ТипЗНЧ(РезультатОперации.ВозвращаемоеЗначение) = Тип("Структура") И РезультатОперации.ВозвращаемоеЗначение.Свойство("ТекстОшибки") Тогда
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ВозвращаемоеЗначение.ТекстОшибки);
					
				Иначе
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.Описание);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	
	ИначеЕсли ИмяМетода = "SendBatchTransfers" Тогда
		
		МассивДокументов = СтруктураПарметровЗапросаВБанк.МассивДокументов;
		
		Для каждого ДокументСсылка Из МассивДокументов Цикл
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для документа: """+ ДокументСсылка + """'; ka = 'დოკუმენტისთვის: """+ ДокументСсылка + """'"));
			
			НовыйДокументов = Новый Массив();
			НовыйДокументов.Добавить(ДокументСсылка);
		
			Массив_УИД_Документа = ИнтеграцияСБанкомProCredit_Сервер.ПолучитьМассив_УИД_Документа(ДокументСсылка);
			
			Если Массив_УИД_Документа.Количество()>0 Тогда
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ: """+ДокументСсылка+""" ранее был выгружен в банк ProCredit'; ka = 'დოკუმენტი: """+ДокументСсылка+""" ადრე აიტვირთა პროკრედიტ ბანკში'"));
				
				Продолжить;
			
			КонецЕсли;
			
			СтруктураJSONДокументов =ИнтеграцияСБанкомProCredit_Сервер.ПолучитьСтруктуруJSONДокументов(ДокументСсылка);//ДокументСсылка);
			ТаблицаПозицийАдресВременногоХранилища = ИнтеграцияСБанкомTBC_Сервер.ПолучитьТаблицуПозицийВременноеХранилище();  
			
			НоваяСтруктураПарметровЗапросаВБанк = Новый Структура();
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода", "SendTransfers"); 
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("ИмяСервиса", "api/Transfer/SendTransfers");
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("ВалютаУчета",СтруктураПарметровЗапросаВБанк.ВалютаУчета);
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("СтруктураJSONДокументов",СтруктураJSONДокументов);
			НоваяСтруктураПарметровЗапросаВБанк.Вставить("ТаблицаПозиций",ТаблицаПозицийАдресВременногоХранилища);         
			
			РезультатОперации = ВыполнитьМетодСервиса(ПараметрыСоединенияProCredit,НоваяСтруктураПарметровЗапросаВБанк);
			
			Если РезультатОперации.Успешно Тогда
				
				ID_Отправки = РезультатОперации.ВозвращаемоеЗначение.Data.RequestId;
				
				НоваяСтруктураПарметровЗапросаВБанк = Новый Структура;
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода","GetTransferStatus"); 
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("ИмяСервиса", "api/Transfer/GetTransferStatus");
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("ID_Отправки",ID_Отправки);
				НоваяСтруктураПарметровЗапросаВБанк.Вставить("УИД", ТекущаяУИД);
				
				РезультатОперации = ВыполнитьМетодСервиса(ПараметрыСоединенияProCredit, НоваяСтруктураПарметровЗапросаВБанк);
				
				ИнтеграцияСБанкомProCredit_Сервер.ОбработатьВыгрузкуДокументовВБанкНаСервере(РезультатОперации.ВозвращаемоеЗначение,ТаблицаПозицийАдресВременногоХранилища,ID_Отправки,ДокументСсылка);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ: """+ДокументСсылка+""" успешно выгружен в банк ProCredit'; ka = 'Документ: """+ДокументСсылка+""" წარმატებით აიტვირთა პროკრედიტ ბანკში'"));
				
			Иначе
				
				Если ТипЗНЧ(РезультатОперации.ВозвращаемоеЗначение) = Тип("Структура") И РезультатОперации.ВозвращаемоеЗначение.Свойство("ТекстОшибки") Тогда
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ВозвращаемоеЗначение.ТекстОшибки);
					
				Иначе
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.Описание);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ИмяМетода = "GetAccountStatment" Тогда
		
		ТаблицаДвиженийПоСчетуАдресВременногоХранилища = ИнтеграцияСБанкомProCredit_Сервер.ПолучитьТаблицуДвиженийПоСчетуВременноеХранилище();
		
		СтруктураПарметровЗапросаВБанк.Вставить("ТаблицаДвиженийПоСчету",ТаблицаДвиженийПоСчетуАдресВременногоХранилища);
		
		ФильтраЗапроса = СтруктураПарметровЗапросаВБанк.ФильтраЗапроса;
		
		РезультатОперации = ВыполнитьМетодСервиса(ПараметрыСоединенияProCredit,СтруктураПарметровЗапросаВБанк);
		
		Если РезультатОперации.Успешно Тогда
			
			ИнтеграцияСБанкомProCredit_Сервер.ОбработатьДанныеДвиженийПоСчетуНаСервере(РезультатОперации.ВозвращаемоеЗначение,ТаблицаДвиженийПоСчетуАдресВременногоХранилища);
			
		Иначе
			
			Если ТипЗНЧ(РезультатОперации.ВозвращаемоеЗначение) = Тип("Структура") И РезультатОперации.ВозвращаемоеЗначение.Свойство("ТекстОшибки") Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ВозвращаемоеЗначение.ТекстОшибки);
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.Описание);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяМетода = "GetRate" Тогда
		
		ТаблицаДвиженийПоСчетуАдресВременногоХранилища = ИнтеграцияСБанкомProCredit_Сервер.ПолучитьТаблицуДляКурсаВременноеХранилище();
		
		СтруктураПарметровЗапросаВБанк.Вставить("ТаблицаДвиженийПоСчету",ТаблицаДвиженийПоСчетуАдресВременногоХранилища);
		
		ФильтраЗапроса = СтруктураПарметровЗапросаВБанк.ФильтраЗапроса;
		
		РезультатОперации = ВыполнитьМетодСервиса(ПараметрыСоединенияProCredit,СтруктураПарметровЗапросаВБанк);
		
		Если РезультатОперации.Успешно Тогда
			
			ИнтеграцияСБанкомProCredit_Сервер.ОбработатьДанныеДвиженийПоСчетуНаСервере(РезультатОперации.ВозвращаемоеЗначение,ТаблицаДвиженийПоСчетуАдресВременногоХранилища);
			
		Иначе
			
			Если ТипЗНЧ(РезультатОперации.ВозвращаемоеЗначение) = Тип("Структура") И РезультатОперации.ВозвращаемоеЗначение.Свойство("ТекстОшибки") Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ВозвращаемоеЗначение.ТекстОшибки);
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.Описание);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры      

// Функция - Выгрузить документы в банк
//
// Параметры:
//  ПараметрыСоединенияProCredit	 - Структура:
//      ProCredit_Login					 - Строка - логин пользователя
//      ProCredit_Password				 - Строка - пароль пользователя
//      ProCredit_ТестовыйРежим			 - Булево - работаем в тестовом режиме
//      ProCredit_РаботаЧерезСервер		 - Булево - предполагается, что соединение с сайтом TBC будет происходить с сервера 1С
//      OTP								 - Строка - OTP
//  СтруктураПарметровЗапросаВБанк	 - Структура:
//		ИмяМетода					 - Строка - имя метода, вызываемого в запросе в банк
//		МассивДокументов			 - Массив - массив ссылок на документы, для которых выполняется запрос в банке
//		Другие поля					 - различные другие поля, необходимые для составления запроса в банке
//				
// Возвращаемое значение: 
//   Структура:
//      Успешно				 - Булево - результат выполнения операции
//      ВозвращаемоеЗначение - Структура - содержит различные данные результата операции
//      Описание			 - Строка - текстовое описание результата операции
//
Функция ВыполнитьМетодСервиса(ПараметрыСоединенияProCredit, СтруктураПарметровЗапросаВБанк) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
		
	РЕЗ = Новый Структура("Успешно,ВозвращаемоеЗначение,Описание",ЛОЖЬ,"","");
	
	ИмяСервиса = СтруктураПарметровЗапросаВБанк.ИмяСервиса;
	
	ФильтраЗапроса = Неопределено;
	Если ИмяСервиса <> "api/Transfer/SendTransfers" И ИмяСервиса <> "api/Transfer/GetTransferStatus" Тогда
		ФильтраЗапроса = СтруктураПарметровЗапросаВБанк.ФильтраЗапроса; 
	КонецЕсли;
	
	Если НЕ ПараметрыСоединенияProCredit.Свойство("AccessToken") Тогда   
		
		СтруктураAccessToken = ПолучитьAccessToken(ПараметрыСоединенияProCredit); 
		
		Если НЕ СтруктураAccessToken.Успешно Тогда 
			
			РЕЗ.Успешно = ЛОЖЬ;
			РЕЗ.ВозвращаемоеЗначение = Неопределено;
			РЕЗ.Описание = НСтр("ru = 'Ошибка авторизации AccessToken: "+СтруктураAccessToken.Описание+"'; ka = 'Ошибка авторизации AccessToken: "+СтруктураAccessToken.Описание+"'");
			
			Возврат РЕЗ;
			
		КонецЕсли;
		
		ПараметрыСоединенияProCredit.Вставить("AccessToken", СтруктураAccessToken.ВозвращаемоеЗначение); 
		
	КонецЕсли;
	
	mhttp = СоздатьHTTPСоединение(ПараметрыСоединенияProCredit);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type"	, "application/json"); 
	Заголовки.Вставить("token"	, ПараметрыСоединенияProCredit.AccessToken);
	
	Если ИмяСервиса = "api/Transfer/SendTransfers" Тогда      
		Запрос = Новый HTTPЗапрос(ИмяСервиса, Заголовки);
		ТекстОснова = ПолучитьТекст_JSON(СтруктураПарметровЗапросаВБанк.СтруктураJSONДокументов, ПараметрыСоединенияProCredit);
		СтруктураЗначений = Новый Структура("Transfer, Hash", СтруктураПарметровЗапросаВБанк.СтруктураJSONДокументов, ИнтеграцияСБанкомProCredit_Сервер.ПолучитьХэш(ТекстОснова));
		ТекстJSON = ПолучитьТекст_JSON(СтруктураЗначений, ПараметрыСоединенияProCredit); 
		Запрос.УстановитьТелоИзСтроки(ТекстJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.Использовать); 
		//+++ Дмгг, 19.08.24, ONESOFT-3255
		//Результат = mhttp.ОтправитьДляОбработки(Запрос);
		// У некоторых клиентов выбивает ошибку проблемы с интеретом через раз, поставил костыль, повторения несколько раз
		ПрошлоБезПроблем = ЛОЖЬ;
		
		Для Сч = 1 по 5 Цикл 
			Попытка
				Результат = mhttp.ОтправитьДляОбработки(Запрос);
				ПрошлоБезПроблем = Истина;
			Исключение
			КонецПопытки;
			
			Если ПрошлоБезПроблем Тогда 
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		//--- Дмгг, 19.08.24, ONESOFT-3255
	ИначеЕсли ИмяСервиса = "api/Transfer/GetTransferStatus" Тогда
		
		ID_Отправки = СтруктураПарметровЗапросаВБанк.ID_Отправки;
		ИмяСервиса = ИмяСервиса + "?batchId="+ID_Отправки;  //286 
		Запрос = Новый HTTPЗапрос(ИмяСервиса, Заголовки);  
		//+++ Дмгг, 19.08.24, ONESOFT-3255
		//Результат = mhttp.Получить(Запрос);
		// У некоторых клиентов выбивает ошибку проблемы с интеретом через раз, поставил костыль, повторения несколько раз
		ПрошлоБезПроблем = ЛОЖЬ;
		
		Для Сч = 1 по 5 Цикл 
			Попытка
				Результат = mhttp.Получить(Запрос);
				ПрошлоБезПроблем = Истина;
			Исключение
			КонецПопытки;
			
			Если ПрошлоБезПроблем Тогда 
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		//--- Дмгг, 19.08.24, ONESOFT-3255
		
	ИначеЕсли ИмяСервиса = "api/Rate/GetRate" Тогда
		
		//ID_Отправки = СтруктураПарметровЗапросаВБанк.ID_Отправки;
		//ИмяСервиса = ИмяСервиса + "?batchId="+ID_Отправки;  //286 
		Запрос = Новый HTTPЗапрос(ИмяСервиса, Заголовки);     
		ТекстJSON = ПолучитьТекст_JSON(ФильтраЗапроса, ПараметрыСоединенияProCredit); 
		Запрос.УстановитьТелоИзСтроки(ТекстJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.Использовать);
		//+++ Дмгг, 19.08.24, ONESOFT-3255
		//Результат = mhttp.ОтправитьДляОбработки(Запрос);
		// У некоторых клиентов выбивает ошибку проблемы с интеретом через раз, поставил костыль, повторения несколько раз
		ПрошлоБезПроблем = ЛОЖЬ;
		
		Для Сч = 1 по 5 Цикл 
			Попытка
				Результат = mhttp.ОтправитьДляОбработки(Запрос);
				ПрошлоБезПроблем = Истина;
			Исключение
			КонецПопытки;
			
			Если ПрошлоБезПроблем Тогда 
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		//--- Дмгг, 19.08.24, ONESOFT-3255
		
	Иначе
		Запрос = Новый HTTPЗапрос(ИмяСервиса, Заголовки);
		
		AccountNumber = СтруктураПарметровЗапросаВБанк.ФильтраЗапроса.accountNumber + СтруктураПарметровЗапросаВБанк.ФильтраЗапроса.accountCurrencyCode; 
		ДатаНачала = ЗаписатьДатуJSON(ФильтраЗапроса.periodFrom,ФорматДатыJSON.ISO);
		ДатаОкончания = ЗаписатьДатуJSON(ФильтраЗапроса.periodTo,ФорматДатыJSON.ISO);     
		
		СтруктураЗначений = Новый Структура("AccountNumber, StartDate, EndDate", AccountNumber,ДатаНачала, ДатаОкончания);
		ТекстJSON = ПолучитьТекст_JSON(СтруктураЗначений, ПараметрыСоединенияProCredit);        
		Запрос.УстановитьТелоИзСтроки(ТекстJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.Использовать);         
		//+++ Дмгг, 19.08.24, ONESOFT-3255
		//Результат = mhttp.ОтправитьДляОбработки(Запрос);
		// У некоторых клиентов выбивает ошибку проблемы с интеретом через раз, поставил костыль, повторения несколько раз
		ПрошлоБезПроблем = ЛОЖЬ;
		
		Для Сч = 1 по 5 Цикл 
			Попытка
				Результат = mhttp.ОтправитьДляОбработки(Запрос);
				ПрошлоБезПроблем = Истина;
			Исключение
			КонецПопытки;
			
			Если ПрошлоБезПроблем Тогда 
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		//--- Дмгг, 19.08.24, ONESOFT-3255
	КонецЕсли; 
	
	res = Результат.КодСостояния;
	
	РЕЗ.Успешно = ИСТИНА;
	
	Если res <> 200 Тогда 
		
		РЕЗ.Успешно = ЛОЖЬ;
		РЕЗ.ВозвращаемоеЗначение = "";
		РЕЗ.Описание = НСтр("ka='შეცდომა მოთხოვნის გაგზავნისას';ru='Ошибка отправки запроса'");
		Возврат РЕЗ;
		
	КонецЕсли;
	
	ОтветПоток = Результат.ПолучитьТелоКакПоток(); //ПолучитьТелоКакСтроку();  
	
	СтруктураОтвета = ПолучитьСтруктуруОтвета(ОтветПоток);   
	
	ОтветПоток.Закрыть();
	
    Если СтруктураОтвета.Свойство("Message") Тогда 
		РЕЗ.Описание = СтруктураОтвета.Message;  
		//При успешной отправки сообщение равно ""
		Если ЗначениеЗаполнено(РЕЗ.Описание) Тогда 
			РЕЗ.Успешно	= Ложь; 
		КонецЕсли; 
	Иначе 
		РЕЗ.Успешно = ИСТИНА;
		РЕЗ.Описание = "Successful";
	КонецЕсли;
	
	РЕЗ.ВозвращаемоеЗначение = СтруктураОтвета;
	
	Возврат РЕЗ;     
	
КонецФункции  

Функция ПолучитьAuthToken(ПараметрыСоединенияProCredit) Экспорт
	ПЕРЕМ РЕЗ;
		
	РЕЗ = Новый Структура("Успешно,ВозвращаемоеЗначение,Описание",ЛОЖЬ,"","");
	
	mhttp = СоздатьHTTPСоединение(ПараметрыСоединенияProCredit);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type"	, "application/json");
	
	Если ПараметрыСоединенияProCredit.ProCredit_ТестовыйРежим Тогда
		//Запрос = Новый HTTPЗапрос("api/Auth/Authenticate", Заголовки);
		Запрос = Новый HTTPЗапрос("Login/Token/api/Auth/Authenticate", Заголовки);
	Иначе	
		//Запрос = Новый HTTPЗапрос("Login/Token/api/Auth/Authenticate", Заголовки);
		Запрос = Новый HTTPЗапрос("api/Auth/Authenticate", Заголовки);
	КонецЕсли;
	
	СтруктураЗначений = Новый Структура("UserName, Password", ПараметрыСоединенияProCredit.ProCredit_Login, ПараметрыСоединенияProCredit.ProCredit_Password);
	ТекстJSON = ПолучитьТекст_JSON(СтруктураЗначений, ПараметрыСоединенияProCredit);
	
	Запрос.УстановитьТелоИзСтроки(ТекстJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.Использовать);  
	
	//+++ Дмгг, 19.08.24, ONESOFT-3255
	//Результат = mhttp.ОтправитьДляОбработки(Запрос);
	// У некоторых клиентов выбивает ошибку проблемы с интеретом через раз, поставил костыль, повторения несколько раз
	ПрошлоБезПроблем = ЛОЖЬ;
	
	Для Сч = 1 по 5 Цикл 
		Попытка
			Результат = mhttp.ОтправитьДляОбработки(Запрос);
			ПрошлоБезПроблем = Истина;
		Исключение
		КонецПопытки;
		
		Если ПрошлоБезПроблем Тогда 
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	//--- Дмгг, 19.08.24, ONESOFT-3255
			
	res = Результат.КодСостояния;
	
	Если res <> 200 Тогда  
		РЕЗ.Успешно = ЛОЖЬ;
		РЕЗ.Описание = "";    
		РЕЗ.ВозвращаемоеЗначение = Неопределено; 
		Возврат РЕЗ;
	КонецЕсли;
	
	ОтветСтрока = Результат.ПолучитьТелоКакСтроку();
	Если Лев(ОтветСтрока, 6) = "<html>"Тогда   
		РЕЗ.Успешно = Ложь;  
		ПоискТекстаБоди = СтрНайти(ОтветСтрока, "<body>"); 
		ПоискТекстаКонцаБоди = СтрНайти(ОтветСтрока, "</body>");  
		ЧислоСимволоов = ПоискТекстаКонцаБоди - 1 - ПоискТекстаБоди + 7;
		РЕЗ.Описание = Сред(ОтветСтрока, ПоискТекстаБоди +7, ЧислоСимволоов);  
		Возврат РЕЗ;
	КонецЕсли;
	
	ОтветПоток = Результат.ПолучитьТелоКакПоток();      
	
	СтруктураОтвета = ПолучитьСтруктуруОтвета(ОтветПоток);  
	
	ОтветПоток.Закрыть();
	
	РЕЗ.Успешно = Истина;
	Если СтруктураОтвета.Свойство("Message") Тогда 
		РЕЗ.Описание = СтруктураОтвета.Message;  
		//При успешной отправки сообщение равно ""
		Если ЗначениеЗаполнено(РЕЗ.Описание) Тогда 
			РЕЗ.Успешно	= Ложь; 
		КонецЕсли;
	КонецЕсли;        
	
	Если СтруктураОтвета.Свойство("Data") И СтруктураОтвета.Data <> Неопределено Тогда 
		Если СтруктураОтвета.Data.Свойство("AuthToken") Тогда  
			РЕЗ.ВозвращаемоеЗначение = СтруктураОтвета.Data.AuthToken;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РЕЗ;
	
КонецФункции  

Функция ПолучитьAccessToken(ПараметрыСоединенияProCredit) Экспорт
	ПЕРЕМ РЕЗ;
		
	РЕЗ = Новый Структура("Успешно,ВозвращаемоеЗначение,Описание",ЛОЖЬ,"","");
	
	mhttp = СоздатьHTTPСоединение(ПараметрыСоединенияProCredit);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type"	, "application/json");
	
	Если ПараметрыСоединенияProCredit.ProCredit_ТестовыйРежим Тогда
		//Запрос = Новый HTTPЗапрос("api/Auth/CheckOTP", Заголовки);
		Запрос = Новый HTTPЗапрос("Login/Token/api/Auth/CheckOTP", Заголовки);
	Иначе	
		//Запрос = Новый HTTPЗапрос("Login/Token/api/Auth/CheckOTP", Заголовки);
		Запрос = Новый HTTPЗапрос("api/Auth/CheckOTP", Заголовки);
	КонецЕсли;
	
	
	СтруктураЗначений = Новый Структура("AuthToken, OTP", ПараметрыСоединенияProCredit.AuthToken, ПараметрыСоединенияProCredit.OTP);
	ТекстJSON = ПолучитьТекст_JSON(СтруктураЗначений, ПараметрыСоединенияProCredit);
	
	Запрос.УстановитьТелоИзСтроки(ТекстJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.Использовать);  
	
	//+++ Дмгг, 19.08.24, ONESOFT-3255
	//Результат = mhttp.ОтправитьДляОбработки(Запрос);
	// У некоторых клиентов выбивает ошибку проблемы с интеретом через раз, поставил костыль, повторения несколько раз
	ПрошлоБезПроблем = ЛОЖЬ;
	
	Для Сч = 1 по 5 Цикл 
		Попытка
			Результат = mhttp.ОтправитьДляОбработки(Запрос);
			ПрошлоБезПроблем = Истина;
		Исключение
		КонецПопытки;
		
		Если ПрошлоБезПроблем Тогда 
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	//--- Дмгг, 19.08.24, ONESOFT-3255
	res = Результат.КодСостояния;
	
	Если res <> 200 Тогда 
		РЕЗ.Успешно = ЛОЖЬ;
		РЕЗ.Описание = "";    
		РЕЗ.ВозвращаемоеЗначение = Неопределено; 
		Возврат РЕЗ;
	КонецЕсли;
	                       
	ОтветПоток = Результат.ПолучитьТелоКакПоток(); //ПолучитьТелоКакСтроку();  
	
	СтруктураОтвета = ПолучитьСтруктуруОтвета(ОтветПоток);   
	
	ОтветПоток.Закрыть(); 
	
	РЕЗ.Успешно = Истина;
	Если СтруктураОтвета.Свойство("Message") Тогда 
		РЕЗ.Описание = СтруктураОтвета.Message;  
		//При успешной отправки сообщение равно ""
		Если ЗначениеЗаполнено(РЕЗ.Описание) Тогда 
			РЕЗ.Успешно	= Ложь; 
		КонецЕсли;
	КонецЕсли;        
	
	Если СтруктураОтвета.Свойство("Data") И СтруктураОтвета.Data <> Неопределено Тогда 
		Если СтруктураОтвета.Data.Свойство("AccessToken") Тогда  
			РЕЗ.ВозвращаемоеЗначение = СтруктураОтвета.Data.AccessToken;
		КонецЕсли;
	КонецЕсли;
	
	ИнтеграцияСБанком_НаСервере.УстановитьТокенДоступа(РЕЗ.ВозвращаемоеЗначение, "MIBGGE22");
	
	Возврат РЕЗ;
	
КонецФункции

Функция ПолучитьСтруктуруОтвета(Поток)

	ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.ОткрытьПоток(Поток);
	
	РезультатМассив = ПрочитатьJSON(ЧтениеJSON, ЛОЖЬ);
	
	Возврат РезультатМассив;
	
КонецФункции

Функция ПолучитьТекст_JSON(СтруктураОтправки, ПараметрыСоединенияProCredit)
	
	КаталогВременныъхфайлов = КаталогВременныхФайлов();                 
	ПутьКФайлу = КаталогВременныъхфайлов + "Token.json";
	тЗапись = Новый ЗаписьJSON;
	тЗапись.ОткрытьФайл(ПутьКФайлу);
	
	ЗаписатьJSON(тЗапись, СтруктураОтправки, Новый НастройкиСериализацииJSON, "ФункцияПреобразования", ИнтеграцияСБанкомProCredit_КлиентСервер);
	тЗапись.Закрыть();  
	
	ЧтениеJson = Новый ЧтениеТекста;
	ЧтениеJson.Открыть(ПутьКФайлу, КодировкаТекста.UTF8);
	
	ТекстJson = ЧтениеJson.Прочитать();
	ЧтениеJson.Закрыть(); 
	
	УдалитьФайлы(ПутьКФайлу);
	
	Возврат ТекстJson;
	
КонецФункции

Функция ФункцияПреобразования(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт   
	
	Если ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
		Возврат Строка(Значение);
	КонецЕсли;     
	
	Отказ = Истина;   
	
КонецФункции    

Функция СоздатьHTTPСоединение(ПараметрыСоединенияProCredit) ЭКСПОРТ
	ПЕРЕМ mhttp;
	
	
	Если ПараметрыСоединенияProCredit.ProCredit_ТестовыйРежим Тогда
		Сервер = "185.118.87.253:90/Service";;
	Иначе	
		Сервер = "oris.procreditbank.ge";
	КонецЕсли;   
	
	mhttp = Новый HTTPСоединение(Сервер,,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Возврат mhttp;
	
КонецФункции // ()

#КонецЕсли
