
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Элементы.ГруппаОбщееДеталная.Видимость	= ЗначениеЗаполнено(Объект.НазначениеНД);	
	//ДД
	Элементы.ТоварыНаименованиеДляРС.Видимость = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалНаименованияРС");
	
	Если Объект.ТипНД = Перечисления.РС_ТипыНД.Аванс ИЛИ Объект.ТипНД = Перечисления.РС_ТипыНД.Услуга Тогда	
		Элементы.АдресПогрузки.Видимость = Ложь;	
	Иначе		
		Элементы.АдресПогрузки.Видимость = Истина;		
	КонецЕсли;
	
	Если Объект.ТипНД = Перечисления.РС_ТипыНД.Аванс ИЛИ Объект.ТипНД = Перечисления.РС_ТипыНД.Услуга ИЛИ Объект.ТипНД = Перечисления.РС_ТипыНД.РеализацияБезТранспортировки  Тогда	
		пБезТранспортировки = Истина;	
	Иначе
		пБезТранспортировки = Ложь;		
	КонецЕсли;
	
	Если Объект.ТипНД = Перечисления.РС_ТипыНД.ВнутреннееПеремещение ИЛИ Объект.ТипНД = Перечисления.РС_ТипыНД.Дистрибуция  Тогда	
		Элементы.ИнформацияОПолучателе.Видимость = Ложь;	
	Иначе		
		Элементы.ИнформацияОПолучателе.Видимость = Истина;		
	КонецЕсли;
	
	Элементы.ТипНД.Видимость = НЕ Объект.ТипНД = Перечисления.РС_ТипыНД.Аванс;
	
	Прочее = Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Прочее;
	
	Элементы.ГруппаПеревозчика.Видимость = НЕ Прочее И Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Перегрузчик_Автомобильная;
	Элементы.ГруппаТранспортноеСредство.Видимость = НЕ Прочее;		
	Элементы.ГруппаТранспортировка.Видимость = НЕ пБезТранспортировки;
	Элементы.АдресДоставки.Видимость		 = НЕ пБезТранспортировки;
	Элементы.ДругойТранспорт.Видимость 		 = НЕ пБезТранспортировки И Прочее;
	
	ВидимостьТранспорта = ЗначениеЗаполнено(Объект.ВидТранспортировки);
	
	Элементы.ГруппаНачалоТранспортировки.Видимость = ВидимостьТранспорта;
	Элементы.ГруппаКонецТранспортировки.Видимость  = ВидимостьТранспорта;
	Если НЕ ВидимостьТранспорта Тогда		
		Элементы.ГруппаПеревозчика.Видимость           = Ложь;
		Элементы.ГруппаТранспортноеСредство.Видимость  = Ложь;		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	УстановитьВидимостьИДоступность();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Параметры.Свойство("ДокументыОснования") Тогда
		
		Для Каждого ДокументОснование Из Параметры.ДокументыОснования Цикл
			НоваяСтрока = Объект.ДокументыОснования.Добавить();
			НоваяСтрока.ДокументОснование = ДокументОснование;
		КонецЦикла;
		Если Параметры.Свойство("НакладнаяДистрибюций") Тогда 
			Объект.НакладнаяДистрибюций = Параметры.НакладнаяДистрибюций;
			СсылкаЭН = Параметры.СсылкаЭН;
			Объект.ТранспортноеСредство	= СсылкаЭН.ТранспортноеСредство;
			Объект.ГосНомерАвтомобиля	= СсылкаЭН.ГосНомерАвтомобиля;
			Объект.Водитель				= СсылкаЭН.Водитель;
			Объект.НомерУдостоверения	= СсылкаЭН.НомерУдостоверения;
			Объект.ДругойТранспорт      = СсылкаЭН.ДругойТранспорт;
		КонецЕсли;
		ЗапольнитьРеквизитиНакладной(Параметры.ДокументыОснования);
	КонецЕсли;
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузополучателя, 	Объект.ГрузоПолучатель); //ГрузоПолучатель
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузоотправителя, 	Объект.ГрузоОтправитель);//ГрузоОтправитель
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННПеревозчика, 		Объект.Перевозчик);      //Перевозчик
	СписокДокументыОснования.ЗагрузитьЗначения(Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование"));
	УстановитьПараметрыВыбора_ТипТН(Истина);
	НазначениеНДПриИзмененииНаСервере();
	
	Массив_Транспорт = Новый Массив;
	Массив_Транспорт.Добавить(ПредопределенноеЗначение("Перечисление.РС_ВидыТранспортировки.Автомобильная"));
	Массив_Транспорт.Добавить(ПредопределенноеЗначение("Перечисление.РС_ВидыТранспортировки.Перегрузчик_Автомобильная"));
	Массив_Транспорт.Добавить(ПредопределенноеЗначение("Перечисление.РС_ВидыТранспортировки.Прочее"));
	
	Элементы.ВидТранспортировки.СписокВыбора.ЗагрузитьЗначения(Массив_Транспорт);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТНПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
	Если Объект.ТипНД = ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Дистрибуция") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ВидЦены) Тогда
			Объект.ВидЦены = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ВидыЦен", "Оптовая");
		КонецЕсли;
		ЗаполнитьЦеныПоДистрибюции();
	ИначеЕсли Объект.ТипНД = ПредопределенноеЗначение("Перечисление.РС_ТипыНД.РеализацияБезТранспортировки") Тогда
		Объект.АдресДоставки		= "";
		Объект.ВидТранспортировки	= Неопределено;
		Объект.ДругойТранспорт		= "";
		Объект.Перевозчик			= Неопределено;
		ИННПеревозчика				= "";
		Объект.НомерУдостоверения	= "";
		Объект.Водитель				= "";
		Объект.ТранспортноеСредство = "";
		Объект.ГосНомерАвтомобиля	= "";
		Объект.Прицеп               = "";
	КонецЕсли;
КонецПроцедуры
 
 
 //<Запольнить Реквизити Накладной>
 //Запольняется таб часть
 &НаСервере
 Процедура ЗапольнитьРеквизитиНакладной(МассивДокументовОснования)
	 
	 //ЗапольнитьЗначенияШапки();
	 Если Объект.ТипНД = Перечисления.РС_ТипыНД.ВозвратОтПокупателя Тогда
		 Объект.Товары.Загрузить(ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуВозврата(МассивДокументовОснования));
	 ИначеЕсли Объект.ТипНД = Перечисления.РС_ТипыНД.ВнутреннееПеремещение ИЛИ Объект.ТипНД = Перечисления.РС_ТипыНД.Дистрибуция Тогда
		 Объект.Товары.Загрузить(ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуПеремешения(МассивДокументовОснования));
		Если Объект.ТипНД = Перечисления.РС_ТипыНД.Дистрибуция Тогда
			Объект.ВидЦены = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ВидыЦен", "Оптовая");
			ЗаполнитьЦеныПоДистрибюции();
		КонецЕсли;
	 Иначе
		 Объект.Товары.Загрузить(ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуРеализации(МассивДокументовОснования));
	 КонецЕсли;
	 //Записать();Паганини
	 
	 ДокументОбъект = РеквизитФормыВЗначение("Объект");
	 ДокументОбъект.СформироватьТаблицуЭлНакладных();
	 ДокументОбъект.СформироватьТаблицуШапкаRS();
	 ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	 Записать();//Паганини
 
 КонецПроцедуры // ()


&НаСервере
Процедура ЗаполнитьТоварыНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда
		Записать();
	КонецЕсли;

	Объект.Товары.Очистить(); 
	ЗапольнитьРеквизитиНакладной(Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование"));
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьТовары(Команда)
	
	Если Объект.Товары.Количество() > 0 Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		ТекстВопроса = Нстр("ka='შევსებამდე გასუფთავდება არსებული საქონლის ცხრილი. გაგრძელდეს?';ru='Перед заполнением очистится табличная часть Товары. Продолжить?';en='Before filling cleared tabular section Goods. Proceed?'");
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	Иначе 
		ЗаполнитьТоварыНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе 
		ЗаполнитьТоварыНаСервере();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузоотправителя, Объект.ГрузоОтправитель);
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузополучателя, Объект.ГрузоПолучатель);
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ТранспортноеСредствоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТранспортноеСредствоПриИзмененииНаСервере()
	
	Если ТипЗнч(Объект.ТранспортноеСредство) = Тип("СправочникСсылка.ТранспортныеСредства") Тогда
		Объект.ГосНомерАвтомобиля = Объект.ТранспортноеСредство.Код;
		ОсновнойВодитель = Объект.ТранспортноеСредство.ОсновнойВодитель;
		Если ЗначениеЗаполнено(ОсновнойВодитель) Тогда
			Если НЕ ЗначениеЗаполнено(Объект.Водитель) Тогда
				Объект.Водитель 			= ОсновнойВодитель;
				Объект.НомерУдостоверения 	= ОсновнойВодитель.ИНН;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ВодительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВодительПриИзмененииНаСервере()
	
	Объект.НомерУдостоверения = Объект.Водитель.ИНН;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТН(Команда)
	ОбновитьДанныеОтправкиНаСервере();	
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
	
КонецПроцедуры


&НаКлиенте
Процедура Операция_ЭлНакладная(КомандаТН)
	
	ОчиститьСообщения();//Паганини
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		Если Не Объект.РучнаяКорректировка Тогда 
			ОбновитьДанныеОтправкиНаСервере();
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		КонецЕсли; 
	КонецЕсли;
	
	Результат = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбработатьОперациюНД(КомандаТН, Объект);
	Если Не Результат = 0 Тогда 
		Сообщить(Результат);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруЭлНакладных()
	
	Возврат Документы.РС_ЭлектроннаяНакладная.ПолучитьСтруктуруЭлНакладных(Объект.Ссылка);
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеОтправкиНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.СформироватьТаблицуЭлНакладных();
	ДокументОбъект.СформироватьТаблицуШапкаRS();
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеОтправки(Команда)
	ОбновитьДанныеОтправкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусТН(Команда)
	ОбновитьДанныеОтправкиНаСервере();
	Если ЗначениеЗаполнено(Объект.ID_НД) Тогда
		Операция_ЭлНакладная(Команда.Имя);
		Прочитать();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьИД(Команда)
	Элементы.ID_НД.ТолькоПросмотр = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьТН(Команда)
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная("СоздатьИАктивироватьТН");
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьТН(Команда)
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьТН(Команда)
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИАктивироватьТН(Команда)
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

//Паганини
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.Сумма 	= ТекДанные.Количество	* ТекДанные.Цена;
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.Сумма 	= ТекДанные.Количество	* ТекДанные.Цена;
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.Цена 	= ?(ТекДанные.Количество = 0, 0, Окр(ТекДанные.Сумма / ТекДанные.Количество, 2));
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры



&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.ЕдиницаИзмерения 	= ПолучитьЗначенияРеквизита(ТекДанные.Номенклатура, "ЕдиницаИзмерения");
	ТекДанные.СтавкаНДС 		= ПолучитьЗначенияРеквизита(ТекДанные.Номенклатура, "СтавкаНДС");
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначенияРеквизита(Ссылка, ИмяРеквизита)
	Возврат Ссылка[ИмяРеквизита];
КонецФункции

&НаКлиенте
Процедура ВидТранспортировкиПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикПриИзменении(Элемент)
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННПеревозчика, Объект.Перевозчик);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ПолеИНН, Контрагент)
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ПолеИНН = Контрагент.ИНН;
	Иначе
		ПолеИНН = "";
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)
	ЗаполнитьЦеныПоДистрибюции();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныПоДистрибюции()
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл 
		РС_ОбщегоНазначения.ЗаполнитьЦену(СтрокаТЧ, Объект.ВидЦены);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбора_ТипТН(ПриОткрытии = Ложь)
	
	Если СписокДокументыОснования.Количество() = 0 Тогда
		Объект.ДокументыОснования.Очистить();
		Возврат;
	КонецЕсли;
	ТипЗнченияДокумента = ТипЗнч(СписокДокументыОснования[0].Значение);
	
	Массив_ТипТН = Новый Массив;
	Массив_Назначения = Новый Массив;
	
	Если Объект.Получен Тогда
		
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.ВнутреннееПеремещение"));
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Дистрибуция"));		
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.ВозвратОтПокупателя"));		
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.РеализацияБезТранспортировки"));
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.РеализацияСТранспортировкой"));
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Услуга"));
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Аванс"));
		Массив_Назначения.Добавить(ПредопределенноеЗначение("Перечисление.РС_НазначенияНД.Аванс"));		
		Массив_Назначения.Добавить(ПредопределенноеЗначение("Перечисление.РС_НазначенияНД.ДоставкаУслуга"));
		
	Иначе
		Если ТипЗнченияДокумента = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
			Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.ВнутреннееПеремещение"));
			Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Дистрибуция"));
		ИначеЕсли ТипЗнченияДокумента = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.ВозвратОтПокупателя"));
		Иначе
			Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.РеализацияБезТранспортировки"));
			Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.РеализацияСТранспортировкой"));
			Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Услуга"));
			//Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Аванс"));
			Массив_Назначения.Добавить(ПредопределенноеЗначение("Перечисление.РС_НазначенияНД.Аванс"));
		КонецЕсли;
		
		Массив_Назначения.Добавить(ПредопределенноеЗначение("Перечисление.РС_НазначенияНД.ДоставкаУслуга"));
		
	КонецЕсли;
	
	Элементы.ТипНД.СписокВыбора.ЗагрузитьЗначения(Массив_ТипТН);
	Элементы.НазначениеНД.СписокВыбора.ЗагрузитьЗначения(Массив_Назначения);
	
	Если НЕ ПриОткрытии И Массив_ТипТН.Найти(Объект.ТипНД) = Неопределено Тогда
		Если ТипЗнченияДокумента = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
			Объект.ТипНД = ПредопределенноеЗначение("Перечисление.РС_ТипыНД.ВнутреннееПеремещение");
		ИначеЕсли ТипЗнченияДокумента = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			Объект.ТипНД = ПредопределенноеЗначение("Перечисление.РС_ТипыНД.ВозвратОтПокупателя");
		Иначе
			Объект.ТипНД = ПредопределенноеЗначение("Перечисление.РС_ТипыНД.РеализацияСТранспортировкой");
		КонецЕсли;
		УстановитьВидимостьИДоступность();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументыОснованияПриИзменении(Элемент)
	УстановитьПараметрыВыбора_ТипТН();
	Модифицированность = Истина;
КонецПроцедуры

#Область ОбработчикиБиблиотек
// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ДокументыОснования.Очистить();
	Для Каждого ЗнДокумента ИЗ СписокДокументыОснования Цикл
		НоваяСтрока = Объект.ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ЗнДокумента.Значение;
	КонецЦикла;
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

&НаСервере
Процедура НазначениеНДПриИзмененииНаСервере()
	
	Если Объект.НазначениеНД = Перечисления.РС_НазначенияНД.ДоставкаУслуга Тогда
		Если Не ЗначениеЗаполнено(Объект.ТипНД) ИЛИ Объект.ТипНД = Перечисления.РС_ТипыНД.Аванс Тогда			
			Объект.ТипНД = Перечисления.РС_ТипыНД.ПустаяСсылка();		
		КонецЕсли;					
	Иначе 		
		Объект.ТипНД = Перечисления.РС_ТипыНД.Аванс;		
	КонецЕсли;	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеНДПриИзменении(Элемент)
	НазначениеНДПриИзмененииНаСервере();
КонецПроцедуры
