

// Процедура на основании анализа типа данных заменяет их на данные, удаляющие
// информацию из узла в котором их не должно быть
//
// Параметры:
//  Данные	– Объект, набор записей,... который нужно преобразовать
//
Процедура УдалениеДанных(Данные)
	
	// Получаем объект описания метаданного, соответствующий данным.
	ОбъектМетаданных = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Данные.Ссылка.Метаданные(), Данные.Метаданные());
	
	// Проверяем тип, интересуют только те типы, которые реализованы на мобильной платформе.
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных)
		ИЛИ Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		
		// Перенос удаления объекта для объектных.
		Данные = Новый УдалениеОбъекта(Данные.Ссылка);
		
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных)
		ИЛИ Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных)
		ИЛИ Метаданные.Последовательности.Содержит(ОбъектМетаданных) Тогда
		
		// Очищаем данные.
		Данные.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры // УдалениеДанных()

// Функция формирует пакет обмена, который будет отправлен узлу УзелОбмена
//
// Параметры:
//  УзелОбмена	– узел плана обмена "МобильноеПриложение", с которым осуществляется обмен
//
// Возвращаемое значение:
//  сформированный пакет, помещенный в хранилище значения
Функция СформироватьПакетОбмена(УзелОбмена, ПолучитьОстатки) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);
	
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");
	
	ТипДанныхУдаления = Тип("УдалениеОбъекта");
	
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения);
	
	ВозвращаемыйСписок = СоздатьОбъект("Objects");
	
	НужныеТорговыеПредставители = ПолучитьНужныеТорговыеПредставители(УзелОбмена);
	НужныеДоговоры 				= ПолучитьНужныеДоговоры(НужныеТорговыеПредставители);
	НужныеКонтрагенты   		= ПолучитьНужныеКонтрагенты(НужныеДоговоры);
	НужныеНоменклатуры 			= ПолучитьНужныеНоменклатуры(УзелОбмена);
	НужныеСклады 				= ПолучитьНужныеСклады(УзелОбмена);
	
	Сч = 0;
	Пока ВыборкаИзменений.Следующий() Цикл
		Сч = Сч + 1;
		
		Данные = ВыборкаИзменений.Получить();
		
		// Если перенос данных не нужен, то, возможно, необходимо записать удаление данных.
		Если НЕ НуженПереносДанных(Данные, УзелОбмена, НужныеКонтрагенты,НужныеДоговоры) Тогда
			//// Получаем значение с возможным удалением данных.
			//УдалениеДанных(Данные);
			Продолжить;
		КонецЕсли;
		
		ЗаписатьДанные(ВозвращаемыйСписок, Данные, НужныеНоменклатуры);
	КонецЦикла;
	
	Если ПолучитьОстатки Тогда
		ЗаписатьОстатки(ВозвращаемыйСписок, УзелОбмена, НужныеНоменклатуры, НужныеСклады);
		ЗаписатьРасчетыСПокупателями(ВозвращаемыйСписок, УзелОбмена, НужныеКонтрагенты, НужныеДоговоры);
	КонецЕсли;
	
	ЗаписатьПрефикс(ВозвращаемыйСписок, УзелОбмена);
	ЗаписатьКонстанты(ВозвращаемыйСписок, УзелОбмена);
	
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВозвращаемыйСписок);
	
	ЗаписьСообщения.ЗакончитьЗапись();
	
	Возврат Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));
	
КонецФункции // СформироватьПакетОбмена()

Функция СформироватьПакетОбменаСКД(УзелОбмена, ПольныйОбмен) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);
	
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");
	
	ТипДанныхУдаления = Тип("УдалениеОбъекта");
	
	//ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения);
	
	ВозвращаемыйСписок = СоздатьОбъект("Objects");

	
	дзДанные = СформироватьСКДНаСервере(УзелОбмена,ПольныйОбмен);
	МассивВзаиморасчети = Новый Массив;
	МассивОстатки = Новый Массив;
	МассивОстаткиВозвратов = Новый Массив;
	
	Для Каждого стрДанные Из дзДанные.Строки Цикл 
		Если стрДанные.Ссылка = "Взаиморасчети" Тогда 
			МассивВзаиморасчети.Добавить(стрДанные);
		ИначеЕсли стрДанные.Ссылка = "Остатки" Тогда 
			МассивОстатки.Добавить(стрДанные);
		ИначеЕсли стрДанные.Ссылка = "ОстаткиВозвратов" Тогда 
			МассивОстаткиВозвратов.Добавить(стрДанные);
		Иначе 
			ЗаписатьДанныеСКД(ВозвращаемыйСписок, стрДанные.Ссылка,стрДанные);
		КонецЕсли;
	КонецЦикла;
	ЗаписатьДанныеСКД_ОстаткиВзаиморасчети(МассивОстатки,МассивОстаткиВозвратов, МассивВзаиморасчети,ВозвращаемыйСписок);
	
	
	ЗаписатьПрефикс(ВозвращаемыйСписок, УзелОбмена);
	ЗаписатьКонстанты(ВозвращаемыйСписок, УзелОбмена);
	
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВозвращаемыйСписок);
	
	ЗаписьСообщения.ЗакончитьЗапись();
	
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, Неопределено);	
	
	//ЗаписатьЛог(УзелОбмена,Перечисления.ОПТИМУС_ВыдиОбменаДистрибуций.Выгрузка);	
	
	Возврат Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));
	
КонецФункции // СформироватьПакетОбмена()

// Процедура вносит в информационную базу данные, которые присланы из узла УзелОбмена 
//
// Параметры:
//  УзелОбмена	– узел плана обмена "МобильноеПриложение", с которым осуществляется обмен
//  ДанныеОбмена - пакет обмена полученный из узла УзелОбмена, помещен в ХранилищеЗначения
//
Процедура ПринятьПакетОбмена(УзелОбмена, ДанныеОбмена) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());
	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
	
	Попытка 
		ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка моб. апп", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки;
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://www.optimus.ge/SB/DistributionExchange", "Objects");
	
	Объекты = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	
	ЗагрузитьОбъекты(УзелОбмена, Объекты);
	
	ЧтениеСообщения.ЗакончитьЧтение();
	ЧтениеXML.Закрыть();
	
КонецПроцедуры // ПринятьПакетОбмена()

// Функция создает объект переданного типа.
//
Функция СоздатьОбъект(ТипОбъекта) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.optimus.ge/SB/DistributionExchange", ТипОбъекта));
	
КонецФункции // СоздатьОбъект()



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ЗАГРУЗКИ

// Процедура загружает объекты в информационную базу.
//
Процедура ЗагрузитьОбъекты(УзелОбмена, Объекты) Экспорт
	
	ДокументыДляОтложенногоПроведения = Новый ТаблицаЗначений;
	ДокументыДляОтложенногоПроведения.Колонки.Добавить("ДокументСсылка");
	ДокументыДляОтложенногоПроведения.Колонки.Добавить("ДокументТип");
	
	НачатьТранзакцию();
	
	Если Объекты <> Неопределено Тогда
		Для Каждого ОбъектXDTO Из Объекты.objects Цикл
			Если ОбъектXDTO.Тип().Имя = "DocVisit" Тогда
				НайтиСоздатьВизит(УзелОбмена, ОбъектXDTO, ДокументыДляОтложенногоПроведения);
			ИначеЕсли ОбъектXDTO.Тип().Имя = "ObjectDeletion" Тогда
				ПометитьОбъектНаУдаление(УзелОбмена, ОбъектXDTO);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	ВыполнитьОтложенноеПроведениеДокументов(УзелОбмена, ДокументыДляОтложенногоПроведения);
	
КонецПроцедуры // ЗагрузитьОбъекты()

// Функция помечает объект на удаление.
//
Функция ПометитьОбъектНаУдаление(УзелОбмена, ОбъектXDTO)
	
	Если ОбъектXDTO = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Идентификатор = Новый УникальныйИдентификатор(ОбъектXDTO.Id);
	
	Если ОбъектXDTO.Type = "DocVisit" Тогда
		Ссылка = Документы.Визит.ПолучитьСсылку(Идентификатор);
	КонецЕсли;
	
	Попытка
		Объект = Ссылка.ПолучитьОбъект();
		Объект.УстановитьПометкуУдаления(Истина);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, Объект);
	Исключение
	КонецПопытки;
	
КонецФункции // ПометитьОбъектНаУдаление()

// Функция создает новый документ в информационной базе.
//
Функция СоздатьДокумент(ИмяДокумента, ОбъектXDTO)
	
	Идентификатор = Новый УникальныйИдентификатор(ОбъектXDTO.Id);
	Ссылка = Документы[ИмяДокумента].ПолучитьСсылку(Идентификатор);
	Объект = Ссылка.ПолучитьОбъект();
	Если Объект = Неопределено Тогда
		Объект = Документы[ИмяДокумента].СоздатьДокумент();
		Объект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции // СоздатьДокумент()

// Процедура заполняет основные реквизиты документа.
//
Процедура ЗаполнитьОсновныеРеквизитыДокумента(Объект, ОбъектXDTO, НужноЗаписыватьОбъект)
	
	Если Объект.Дата <> ОбъектXDTO.Date Тогда
		Объект.Дата = ОбъектXDTO.Date;
		НужноЗаписыватьОбъект = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = Пользователи.ТекущийПользователь();
		НужноЗаписыватьОбъект = Истина;
	КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	//	ОсновнаяОрганизация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
	//		Объект.Автор,
	//		"ОсновнаяОрганизация"
	//	);
	//	Объект.Организация = ?(ЗначениеЗаполнено(ОсновнаяОрганизация), ОсновнаяОрганизация, Справочники.Организации.ОсновнаяОрганизация);
	//	НужноЗаписыватьОбъект = Истина;
	//КонецЕсли;
	
КонецПроцедуры // ЗаполнитьОсновныеРеквизитыДокумента()

// Процедура удаления существующих движений документа при перепроведении (отмене проведения).
//
Процедура УдалитьДвиженияУДокумента(ДокументОбъект)
	
	МассивОбрабатываемыхСтрокТаблицыДвижений = Новый Массив();
	
	// получение списка регистров, по которым существуют движения
	ТаблицаДвижений = ОпределитьНаличиеДвиженийПоДокументу(ДокументОбъект.Ссылка);
	ТаблицаДвижений.Колонки.Добавить("НаборЗаписей");
	ТаблицаДвижений.Колонки.Добавить("БезусловноеУдаление", Новый ОписаниеТипов("Булево"));
		
	Для Каждого СтрокаДвижения Из ТаблицаДвижений Цикл
		// имя регистра передается как значение, полученное с помощью
		// функции ПолноеИмя() метаданных регистра
		ПозицияТочки = Найти(СтрокаДвижения.Имя, ".");
		ТипРегистра = Лев(СтрокаДвижения.Имя, ПозицияТочки - 1);
		ИмяРегистра = СокрП(Сред(СтрокаДвижения.Имя, ПозицияТочки + 1));

		МассивОбрабатываемыхСтрокТаблицыДвижений.Добавить(СтрокаДвижения);
		
		Если ТипРегистра = "РегистрНакопления" Тогда
			МетаданныеНабора = Метаданные.РегистрыНакопления[ИмяРегистра];
			Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
			
		ИначеЕсли ТипРегистра = "РегистрБухгалтерии" Тогда
			МетаданныеНабора = Метаданные.РегистрыБухгалтерии[ИмяРегистра];
			Набор = РегистрыБухгалтерии[ИмяРегистра].СоздатьНаборЗаписей();
			
		ИначеЕсли ТипРегистра = "РегистрСведений" Тогда
			МетаданныеНабора = Метаданные.РегистрыСведений[ИмяРегистра];
			Набор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
			
		ИначеЕсли ТипРегистра = "РегистрРасчета" Тогда
			МетаданныеНабора = Метаданные.РегистрыРасчета[ИмяРегистра];
			Набор = РегистрыРасчета[ИмяРегистра].СоздатьНаборЗаписей();
			
		КонецЕсли;
		
		Если НЕ ПравоДоступа("Изменение", Набор.Метаданные()) Тогда
			// отсутствуют права на всю таблицу регистра
			ВызватьИсключение "Нарушение прав доступа: " + СтрокаДвижения.Имя;
			Возврат;
		КонецЕсли;

		Набор.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);

		// набор не записывается сразу, чтобы не откатывать транзакцию, если впоследствии
		// выяснится, что на один из регистров не хватает прав.
		СтрокаДвижения.НаборЗаписей = Набор;
		
	КонецЦикла;	
	
	Для Каждого СтрокаДвижения Из МассивОбрабатываемыхСтрокТаблицыДвижений Цикл		
		Попытка
			СтрокаДвижения.НаборЗаписей.Записать();
		Исключение
			// возможно «сработал» RLS или подсистема даты запрета изменения
			ВызватьИсключение "Операция не выполнена: " + СтрокаДвижения.Имя + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЦикла;
	
	ОчисткаКоллекцииДвиженийДокумента(ДокументОбъект);
	
КонецПроцедуры // УдалитьДвиженияУДокумента()

// Функция определяет наличие движений документа.
//
Функция ОпределитьНаличиеДвиженийПоДокументу(ДокументСсылка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса = "";
	// для исключения падения для документов, проводящимся более чем по 256 таблицам
	счетчик_таблиц = 0;
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	Если МетаданныеДокумента.Движения.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Для Каждого Движение Из МетаданныеДокумента.Движения Цикл
		// в запросе получаем имена регистров, по которым есть хотя бы одно движение
		// например,
		// ВЫБРАТЬ Первые 1 «РегистрНакопления.ТоварыНаСкладах»
		// ИЗ РегистрНакопления.ТоварыНаСкладах
		// ГДЕ Регистратор = &Регистратор
		
		// имя регистра приводим к Строка(200), см. ниже
		ТекстЗапроса = ТекстЗапроса + "
		|" + ?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ ") + "
		|ВЫБРАТЬ ПЕРВЫЕ 1 ВЫРАЗИТЬ(""" + Движение.ПолноеИмя() 
		+  """ КАК Строка(200)) КАК Имя ИЗ " + Движение.ПолноеИмя() 
		+ " ГДЕ Регистратор = &Регистратор";
		
		// если в запрос попадает более 256 таблиц – разбиваем его на две части
		// (вариант документа с проведением по 512 регистрам считаем нежизненным)
		счетчик_таблиц = счетчик_таблиц + 1;
		Если счетчик_таблиц = 256 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	ЗАпрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	// при выгрузке для колонки «Имя» тип устанавливается по самой длинной строке из запроса
	// при втором проходе по таблице новое имя может не «влезть», по этому сразу в запросе
	// приводится к строка(200)
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	// если количество таблиц не превысило 256 – возвращаем таблицу
	Если счетчик_таблиц = МетаданныеДокумента.Движения.Количество() Тогда
		Возврат ТаблицаЗапроса;			
	КонецЕсли;
	
	// таблиц больше чем 256, делаем доп. запрос и дополняем строки таблицы.
	
	ТекстЗапроса = "";
	Для Каждого Движение Из МетаданныеДокумента.Движения Цикл
		
		Если счетчик_таблиц > 0 Тогда
			счетчик_таблиц = счетчик_таблиц - 1;
			Продолжить;
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|" + ?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ ") + "
		|ВЫБРАТЬ ПЕРВЫЕ 1 """ + Движение.ПолноеИмя() +  """ КАК Имя ИЗ " 
		+ Движение.ПолноеИмя() + " ГДЕ Регистратор = &Регистратор";	
		
		
	КонецЦикла;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ТаблицаЗапроса.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
	КонецЦикла;
	
	Возврат ТаблицаЗапроса;
	
КонецФункции // ОпределитьНаличиеДвиженийПоДокументу()

// Процедура очищает коллекцию движений документа.
//
Процедура ОчисткаКоллекцииДвиженийДокумента(ДокументОбъект)
		
	Для каждого Движение Из ДокументОбъект.Движения Цикл
		Если Движение.Количество() > 0 Тогда
			Движение.Очистить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ОчисткаКоллекцииДвиженийДокумента()

// Процедура записывает документ в информационную базу.
//
Процедура ЗаписатьДокумент(УзелОбмена, Объект, ОбъектXDTO, НужноЗаписыватьОбъект, ДокументыДляОтложенногоПроведения)
	
	Если НужноЗаписыватьОбъект Тогда
		
		Объект.ПометкаУдаления = ОбъектXDTO.DeletionMark;
		
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
		//Если Не ОбъектXDTO.Posted Тогда
		//	РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
		//КонецЕсли;
		//Если УзелОбмена.ИспользоватьНовуюВерсию Тогда
		//
		//	 Объект.НеРедактировать  = ОбъектXDTO.Posted ;
		//
		//КонецЕсли;
		
		
		Если Объект.ПометкаУдаления
			И (РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда
			
			Объект.ПометкаУдаления = Ложь;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Номер) Тогда
			
			Объект.УстановитьНовыйНомер(УзелОбмена.ПрефиксДокументов);
			
		КонецЕсли;
		
		Объект.ОбменДанными.Загрузка = Истина;
		Попытка
			
			Если Не Объект.Проведен Тогда
				Объект.Записать();
			Иначе
				// отменяем проведение документа
				Объект.Проведен = Ложь;
				Объект.Записать();
				УдалитьДвиженияУДокумента(Объект);
			КонецЕсли;
			
		Исключение
			
			ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
		КонецПопытки;
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			Если ДокументыДляОтложенногоПроведения.Найти(Объект.Ссылка, "ДокументСсылка") = Неопределено Тогда
				СтрокаТаблицы = ДокументыДляОтложенногоПроведения.Добавить();
				СтрокаТаблицы.ДокументСсылка = Объект.Ссылка;
				СтрокаТаблицы.ДокументТип = Объект.Метаданные().Имя;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаписатьДокумент()

// Процедура выполняет проведение документов.
//
Процедура ВыполнитьОтложенноеПроведениеДокументов(УзелОбмена, ДокументыДляОтложенногоПроведения)

	ДокументыДляОтложенногоПроведения.Сортировать("ДокументТип");
	
	Для Каждого СтрокаТаблицы Из ДокументыДляОтложенногоПроведения Цикл
		
		Если СтрокаТаблицы.ДокументСсылка.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		Объект = СтрокаТаблицы.ДокументСсылка.ПолучитьОбъект();
		
		Если Объект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка 
			УдалятьРегистрациюИзменений = Не ПланыОбмена.ИзменениеЗарегистрировано(УзелОбмена, Объект);
		Исключение
			УдалятьРегистрациюИзменений = Ложь;
		КонецПопытки;
		Объект.ОбменДанными.Загрузка = Ложь;
		
		Попытка
			
			Объект.ПроверитьЗаполнение();
			Объект.Записать(РежимЗаписиДокумента.Проведение);
			
			Если УдалятьРегистрациюИзменений Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, Объект);
			КонецЕсли;
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры // ВыполнитьОтложенноеПроведениеДокументов()

Функция НайтиСоздатьВизит(УзелОбмена, ОбъектXDTO, ДокументыДляОтложенногоПроведения)
	
	Если ОбъектXDTO = Неопределено Тогда
		Возврат Документы.Визит.ПустаяСсылка();
	КонецЕсли;
	
	Объект = СоздатьДокумент("Визит", ОбъектXDTO);
	//Если УзелОбмена.ИспользоватьНовуюВерсию И Не ОбъектXDTO.Posted И ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	Возврат 0;
	//КонецЕсли;

	//!!!
	НужноЗаписыватьОбъект = Истина;
	//!!!
	
	ЗаполнитьОсновныеРеквизитыДокумента(Объект, ОбъектXDTO, НужноЗаписыватьОбъект);
	
	Договор = НайтиСоздатьДоговор(УзелОбмена, ОбъектXDTO.Contract);
	Если Объект.Договор <> Договор Тогда
		Объект.Договор 			= Договор;
		Объект.ВидЦен			= Договор.ВидЦен;
		НужноЗаписыватьОбъект 	= Истина;
	КонецЕсли;
	
	Если Строка(ОбъектXDTO.PriceTypeGUID) <> "" Тогда
	
		Попытка
		
			ВидЦеныСсылка = Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка(ОбъектXDTO.PriceTypeGUID)));
			Если ВидЦеныСсылка.ПолучитьОбъект() <> Неопределено Тогда
			
				Объект.ВидЦен = ВидЦеныСсылка;
			
			КонецЕсли; 
		
		Исключение
		
		КонецПопытки; 
	
	КонецЕсли; 
	
	Объект.РезервированиеЗапасов = УзелОбмена.РезервированиеЗапасов;
	
	Объект.Контрагент = Объект.Договор.Владелец;
	
	Если Объект.СуммаПолученная <> ОбъектXDTO.TotalReceive Тогда
		Объект.СуммаПолученная = ОбъектXDTO.TotalReceive;
		НужноЗаписыватьОбъект = Истина;
	КонецЕсли;
	
		
	Если Объект.Комментарий <> ОбъектXDTO.Comment Тогда
		Объект.Комментарий = ОбъектXDTO.Comment;
		НужноЗаписыватьОбъект = Истина;
	КонецЕсли;  	
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = УзелОбмена.Организация;
		НужноЗаписыватьОбъект = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		Объект.СтруктурнаяЕдиница = УзелОбмена.СтруктурнаяЕдиница;
		НужноЗаписыватьОбъект = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаДляВозврата) Тогда
		Объект.СтруктурнаяЕдиницаДляВозврата = УзелОбмена.СтруктурнаяЕдиницаДляВозврата;
		НужноЗаписыватьОбъект = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = УзелОбмена.Ответственный;
		НужноЗаписыватьОбъект = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Касса) Тогда
		Объект.Касса = УзелОбмена.Касса;
		НужноЗаписыватьОбъект = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		Объект.ТранспортноеСредство = УзелОбмена.ТранспортноеСредство;
		НужноЗаписыватьОбъект = Истина;
	КонецЕсли;
	
	Если Объект.ПодарокЗаказа <> ОбъектXDTO.OrderGift Тогда
		Объект.ПодарокЗаказа = ОбъектXDTO.OrderGift;
		НужноЗаписыватьОбъект = Истина;
	КонецЕсли;  	
	
	Если Объект.ПодарокРеализации <> ОбъектXDTO.SaleGift Тогда
		Объект.ПодарокРеализации = ОбъектXDTO.SaleGift;
		НужноЗаписыватьОбъект = Истина;
	КонецЕсли;  
	
	ВидСкидкиНаценки = НайтиСоздатьВидыСкидокНаценок(УзелОбмена, ОбъектXDTO.DiscountType);
	Если Объект.ВидСкидкиНаценки <> ВидСкидкиНаценки Тогда
		Объект.ВидСкидкиНаценки = ВидСкидкиНаценки;
		НужноЗаписыватьОбъект = Истина;
	КонецЕсли;
	
	Объект.ЗаказПокупателя.Очистить();
	Если ОбъектXDTO.OrderItems <> Неопределено Тогда
		Для Каждого ТекСтрока Из ОбъектXDTO.OrderItems.Item Цикл
			НоваяСтрока = Объект.ЗаказПокупателя.Добавить();
			НоваяСтрока.Номенклатура = НайтиСоздатьНоменклатура(УзелОбмена, ТекСтрока.Nomenclature);
			НоваяСтрока.Цена = ТекСтрока.Price;
			НоваяСтрока.Количество = ТекСтрока.Quantity;
			НоваяСтрока.Сумма = ТекСтрока.Total;
			НоваяСтрока.ПроцентСкидкиНаценки = ТекСтрока.Discount ;
			НоваяСтрока.Подарок=ТекСтрока.Present;
			НужноЗаписыватьОбъект = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Объект.ВозвратОтПокупателя.Очистить();
	Если ОбъектXDTO.ReturnItems <> Неопределено Тогда
		Для Каждого ТекСтрока Из ОбъектXDTO.ReturnItems.Item Цикл
			НоваяСтрока = Объект.ВозвратОтПокупателя.Добавить();
			НоваяСтрока.Номенклатура = НайтиСоздатьНоменклатура(УзелОбмена, ТекСтрока.Nomenclature);
			НоваяСтрока.Цена = ТекСтрока.Price;
			НоваяСтрока.Количество = ТекСтрока.Quantity;
			НоваяСтрока.Сумма = ТекСтрока.Total;
			//НоваяСтрока.ПроцентСкидкиНаценки = ТекСтрока.Discount ;
			НужноЗаписыватьОбъект = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Объект.Реализация.Очистить();
	Если ОбъектXDTO.SoldItems <> Неопределено Тогда
		Для Каждого ТекСтрока Из ОбъектXDTO.SoldItems.Item Цикл
			НоваяСтрока = Объект.Реализация.Добавить();
			НоваяСтрока.Номенклатура = НайтиСоздатьНоменклатура(УзелОбмена, ТекСтрока.Nomenclature);
			НоваяСтрока.Цена = ТекСтрока.Price;
			НоваяСтрока.Количество = ТекСтрока.Quantity;
			НоваяСтрока.Сумма = ТекСтрока.Total;
			НоваяСтрока.ПроцентСкидкиНаценки = ТекСтрока.Discount;
			НоваяСтрока.Подарок=ТекСтрока.Present;
			НужноЗаписыватьОбъект = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Объект.ЗаказНаВозврат.Очистить();
	Если ОбъектXDTO.OrderOnReturnItems <> Неопределено Тогда
		Для Каждого ТекСтрока Из ОбъектXDTO.OrderOnReturnItems.Item Цикл
			НоваяСтрока = Объект.ЗаказНаВозврат.Добавить();
			НоваяСтрока.Номенклатура = НайтиСоздатьНоменклатура(УзелОбмена, ТекСтрока.Nomenclature);
			НоваяСтрока.Цена = ТекСтрока.Price;
			НоваяСтрока.Количество = ТекСтрока.Quantity;
			НоваяСтрока.Сумма = ТекСтрока.Total;
			//НоваяСтрока.ПроцентСкидкиНаценки = ТекСтрока.Discount ;
			НужноЗаписыватьОбъект = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Объект.ВнутреннийЗаказ.Очистить();
	Если ОбъектXDTO.InternalOrder <> Неопределено Тогда
		Для Каждого ТекСтрока Из ОбъектXDTO.InternalOrder.Item Цикл
			НоваяСтрока = Объект.ВнутреннийЗаказ.Добавить();
			НоваяСтрока.Номенклатура = НайтиСоздатьНоменклатура(УзелОбмена, ТекСтрока.Nomenclature);
			НоваяСтрока.Количество = ТекСтрока.Quantity;
		КонецЦикла;
	КонецЕсли;

	
	Объект.ПоследняяСинхронизация = ТекущаяДата();
	
	ЗаписатьДокумент(УзелОбмена, Объект, ОбъектXDTO, НужноЗаписыватьОбъект, ДокументыДляОтложенногоПроведения);
	
	Возврат Объект.Ссылка;
	
КонецФункции


Функция НайтиСоздатьДоговор(УзелОбмена, ОбъектXDTO)
	
	Если ОбъектXDTO = Неопределено Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Идентификатор = Новый УникальныйИдентификатор(ОбъектXDTO.Id);
	Ссылка = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Идентификатор);
	
	Возврат Ссылка;
	
КонецФункции

Функция НайтиСоздатьВидыСкидокНаценок(УзелОбмена, ОбъектXDTO)
	
	Если ОбъектXDTO = Неопределено Тогда
		Возврат Справочники.ВидыСкидокНаценок.ПустаяСсылка();
	КонецЕсли;
	
	Идентификатор = Новый УникальныйИдентификатор(ОбъектXDTO.Id);
	Ссылка = Справочники.ВидыСкидокНаценок.ПолучитьСсылку(Идентификатор);
	
	Возврат Ссылка;
	
КонецФункции

Функция НайтиСоздатьНоменклатура(УзелОбмена, ОбъектXDTO)
	
	Если ОбъектXDTO = Неопределено Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Идентификатор = Новый УникальныйИдентификатор(ОбъектXDTO.Id);
	Ссылка = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
	
	Возврат Ссылка;
	
КонецФункции

//Процедура записывает остатки
//
Процедура ЗаписатьОстатки(ВозвращаемыйСписок, УзелОбмена, НужныеНоменклатуры, НужныеСклады) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗапасыОстатки.Номенклатура,
		|	ЗапасыОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			СтруктурнаяЕдиница В (&СтруктурнаяЕдиница)
		|				И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|				И Номенклатура В (&НужныеНоменклатуры)) КАК ЗапасыОстатки"
	);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", НужныеСклады);
	Запрос.УстановитьПараметр("НужныеНоменклатуры", НужныеНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПередаваемыйОбъект = СоздатьОбъект("Remains");

	Пока Выборка.Следующий() Цикл
		ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("Item").Тип;
		ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
		Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			ДобавляемаяСтрока.Nomenclature = ПолучитьОбъектXDTO(Выборка.Номенклатура.ПолучитьОбъект());
		Конецесли;
		ДобавляемаяСтрока.Quantity = Выборка.КоличествоОстаток;
		ПередаваемыйОбъект.Item.Добавить(ДобавляемаяСтрока);
	КонецЦикла;
	
	ВозвращаемыйСписок.objects.Добавить(ПередаваемыйОбъект);
	
КонецПроцедуры

//Процедура записывает расчеты с покупателями
//
Процедура ЗаписатьРасчетыСПокупателями(ВозвращаемыйСписок, УзелОбмена, НужныеКонтрагенты, НужныеДоговоры) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыСПокупателямиОстатки.Контрагент,
		|	ВЫБОР
		|		КОГДА НЕ РасчетыСПокупателямиОстатки.Документ ЕСТЬ NULL 
		|			ТОГДА РасчетыСПокупателямиОстатки.Документ.Дата
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Дата,
		|	РасчетыСПокупателямиОстатки.СуммаОстаток КАК Сумма,
		|	ВЫБОР
		|		КОГДА НЕ РасчетыСПокупателямиОстатки.Документ ЕСТЬ NULL 
		|			ТОГДА РасчетыСПокупателямиОстатки.Документ.Номер
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Номер,
		|	РасчетыСПокупателямиОстатки.Договор
		|ИЗ
		|	РегистрНакопления.РасчетыСПокупателями.Остатки(
		|			,
		|			Контрагент В (&НужныеКонтрагенты)
		|				И Договор В (&НужныеДоговоры)) КАК РасчетыСПокупателямиОстатки"
	);
	
	Запрос.УстановитьПараметр("НужныеКонтрагенты", НужныеКонтрагенты);
	Запрос.УстановитьПараметр("НужныеДоговоры", НужныеДоговоры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПередаваемыйОбъект = СоздатьОбъект("Payable");

	Пока Выборка.Следующий() Цикл
		ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("Item").Тип;
		ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
		Если ЗначениеЗаполнено(Выборка.Контрагент) Тогда
			ДобавляемаяСтрока.Contactor = ПолучитьОбъектXDTO(Выборка.Контрагент.ПолучитьОбъект());
		Конецесли;
		Если ЗначениеЗаполнено(Выборка.Договор) Тогда
			ДобавляемаяСтрока.Contract = ПолучитьОбъектXDTO(Выборка.Договор.ПолучитьОбъект());
		Конецесли;
		ДобавляемаяСтрока.Total = Выборка.Сумма;
		ДобавляемаяСтрока.Document = Формат(Выборка.Дата, "ДФ=yyyy-MM-dd") + "   " + Строка(Выборка.Номер);
		ПередаваемыйОбъект.Item.Добавить(ДобавляемаяСтрока);
	КонецЦикла;
	
	ВозвращаемыйСписок.objects.Добавить(ПередаваемыйОбъект);
	
КонецПроцедуры

// Процедура записывает префикс
//
Процедура ЗаписатьПрефикс(ВозвращаемыйСписок, УзелОбмена) Экспорт
	
	Префикс = СоздатьОбъект("ObjPrefix");
	Префикс.Prefix = УзелОбмена.ПрефиксДокументов;
	
	ВозвращаемыйСписок.objects.Добавить(Префикс);
	
КонецПроцедуры

// Процедура записывает константы
//
Процедура ЗаписатьКонстанты(ВозвращаемыйСписок, УзелОбмена) Экспорт
	
	КонстантыДляОтправления = СоздатьОбъект("ObjConstants");
	КонстантыДляОтправления.UseRealisationAndReturn  = УзелОбмена.ИспользоватьРеализациюИВозвратПриВизите;
	КонстантыДляОтправления.UseOrderAndOrderOnReturn = УзелОбмена.ИспользоватьЗаказИЗаказНаВозвратПриВизите;
	КонстантыДляОтправления.ShowRemains    = УзелОбмена.ПоказыватьОстаткиВПодборе;
	КонстантыДляОтправления.ChangePrices   = УзелОбмена.РедактироватьЦены;
	КонстантыДляОтправления.UseDiscounts   = УзелОбмена.ИспользоватьСкидки;
	КонстантыДляОтправления.ControlRemains = УзелОбмена.КонтролироватьОстаткиПриПроведении;
	КонстантыДляОтправления.Cash		   = ПолучитьОстатокКасси(УзелОбмена.Касса);
	

	ВозвращаемыйСписок.objects.Добавить(КонстантыДляОтправления);
	
КонецПроцедуры

Функция ПолучитьНужныеНоменклатуры(УзелОбмена)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ПометкаУдаления = ЛОЖЬ";

    Выгрузка = Запрос.Выполнить().Выгрузить();
		
	СтруктураОписанияОбъекта = ПолучитьСтруктуруОписанияОбъекта(Метаданные.Справочники.Номенклатура, Ложь);
	
	НужныеНоменклатуры = ОбъектПодлежитРегистрацииВУзле(Выгрузка[0].Ссылка.ПолучитьОбъект(), СтруктураОписанияОбъекта, УзелОбмена, Выгрузка).ВыгрузитьКолонку("Ссылка");
	
	Возврат НужныеНоменклатуры;
	
КонецФункции

Функция ПолучитьНужныеСклады(УзелОбмена)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|ГДЕ
		|	СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ";

    Выгрузка = Запрос.Выполнить().Выгрузить();
		
	СтруктураОписанияОбъекта = ПолучитьСтруктуруОписанияОбъекта(Метаданные.Справочники.СтруктурныеЕдиницы, Ложь);
	
	НужныеСклады = ОбъектПодлежитРегистрацииВУзле(Выгрузка[0].Ссылка.ПолучитьОбъект(), СтруктураОписанияОбъекта, УзелОбмена, Выгрузка).ВыгрузитьКолонку("Ссылка");
	
	Возврат НужныеСклады;
	
КонецФункции


Функция ПолучитьНужныеТорговыеПредставители(УзелОбмена)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ПометкаУдаления = ЛОЖЬ";

    Выгрузка = Запрос.Выполнить().Выгрузить();

	СтруктураОписанияОбъекта = ПолучитьСтруктуруОписанияОбъекта(Метаданные.Справочники.Пользователи, Ложь);
	
	Возврат ОбъектПодлежитРегистрацииВУзле(Выгрузка[0].Ссылка.ПолучитьОбъект(), СтруктураОписанияОбъекта, УзелОбмена, Выгрузка).ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьНужныеДоговоры(НужныеТорговыеПредставители)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ТорговыйПредставитель В (&ТорговыйПредставитель)";

	Запрос.УстановитьПараметр("ТорговыйПредставитель", НужныеТорговыеПредставители);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

Функция ПолучитьНужныеКонтрагенты(НужныеДоговоры)
	
	НужныеКонтрагенты = Новый Массив;
	
	Для Каждого ЭлементМассива Из НужныеДоговоры Цикл
		НужныеКонтрагенты.Добавить(ЭлементМассива.Владелец);
	КонецЦикла;

	Возврат НужныеКонтрагенты;

КонецФункции




////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ВЫГРУЗКИ

// Функция выполняет проверку того, что данные нужно переносить в данный узел
//
// Параметры:
//  Данные	– Объект, набор записей,... который нужно проверить.
//			То, что переносится везде, не обрабатывается
//  УзелОбмена - узел плана обмена, куда осуществляется перенос
//
// Возвращаемое значение:
//  Перенос - булево, если Истина - необходимо выполнять перенос, 
//			  иначе - перенос выполнять не нужно
//
Функция НуженПереносДанных(Данные, УзелОбмена, НужныеКонтрагенты,НужныеДоговоры) Экспорт
	
	Перенос = Истина;
	
	Если Не ТипЗнч(Данные) = Тип("СправочникСсылка.Номенклатура") И
		 Не ТипЗнч(Данные) = Тип("СправочникОбъект.Номенклатура") И
		 Не ТипЗнч(Данные) = Тип("СправочникСсылка.ВидыЦен") И
		 Не ТипЗнч(Данные) = Тип("СправочникОбъект.ВидыЦен") И
		 Не ТипЗнч(Данные) = Тип("СправочникСсылка.Контрагенты") И
		 Не ТипЗнч(Данные) = Тип("СправочникОбъект.Контрагенты") И
		 Не ТипЗнч(Данные) = Тип("СправочникСсылка.ДоговорыКонтрагентов") И
		 Не ТипЗнч(Данные) = Тип("СправочникОбъект.ДоговорыКонтрагентов") И
		 Не ТипЗнч(Данные) = Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатуры") Тогда
		Перенос = Ложь;
	КонецЕсли;
	
	
	Если (ТипЗнч(Данные) = Тип("СправочникСсылка.ВидыЦен") Или
		  ТипЗнч(Данные) = Тип("СправочникОбъект.ВидыЦен")) И
		 Не Данные.ЦенаВключаетНДС Тогда
		Перенос = Ложь;
	КонецЕсли;
	
	
	Если ТипЗнч(Данные) = Тип("СправочникСсылка.Контрагенты") Или
		 ТипЗнч(Данные) = Тип("СправочникОбъект.Контрагенты") Тогда
		Если НужныеКонтрагенты.Найти(Данные.Ссылка) = Неопределено Тогда
			Перенос = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Данные) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Или
		 ТипЗнч(Данные) = Тип("СправочникОбъект.ДоговорыКонтрагентов") Тогда
		Если НужныеДоговоры.Найти(Данные.Ссылка) = Неопределено Тогда
			Перенос = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат Перенос;
	
КонецФункции // НуженПереносДанных()

// Процедура записывает данные в формат XML
// Процедура анализирует переданный объект данных и на основе этого анализа
// записывает его определенным образом в формат XML
//
// Параметры:
//  ЗаписьXML	- объект, записывающий XML данные
//  Данные 		- данные, подлежащие записи в формат XML
//
Процедура ЗаписатьДанные(ВозвращаемыйСписок, Данные, НужныеНоменклатуры) Экспорт
	
	ОбъектXDTO = ПолучитьОбъектXDTO(Данные, НужныеНоменклатуры);
	Если ОбъектXDTO <> Неопределено Тогда
		ВозвращаемыйСписок.objects.Добавить(ОбъектXDTO);
	КонецЕсли;
	
КонецПроцедуры // ЗаписатьДанные()

// Получает объект XDTO из переданного объекта конфигурации.
//
Функция ПолучитьОбъектXDTO(Данные, НужныеНоменклатуры = Неопределено)
	
	ПередаваемыйОбъект = Неопределено;
	
	Если ТипЗнч(Данные) = Тип("СправочникОбъект.Номенклатура")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		ПередаваемыйОбъект = СоздатьОбъект("CatItems");
		ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
		ПередаваемыйОбъект.Name = Данные.Наименование;
		ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;

		Если ЗначениеЗаполнено(Данные.Родитель) Тогда
			ПередаваемыйОбъект.Group = ПолучитьОбъектXDTO(Данные.Родитель);
		КонецЕсли;
		Если Данные.ЭтоГруппа Тогда
			ПередаваемыйОбъект.ThisIsGroup = Истина;
			Возврат ПередаваемыйОбъект;
		Иначе
			ПередаваемыйОбъект.ThisIsGroup = Ложь;
			ПередаваемыйОбъект.Disabled = Данные.Неактивен;
		КонецЕсли;
		ПередаваемыйОбъект.Article = Данные.Артикул;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ВидыЦен")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.ВидыЦен") Тогда
		
		ПередаваемыйОбъект = СоздатьОбъект("CatPriceTypes");
		ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
		ПередаваемыйОбъект.Name = Данные.Наименование;
		ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;
		Если ЗначениеЗаполнено(Данные.Родитель) Тогда
			ПередаваемыйОбъект.Group = ПолучитьОбъектXDTO(Данные.Родитель);
		КонецЕсли;
		Если Данные.ЭтоГруппа Тогда
			ПередаваемыйОбъект.ThisIsGroup = Истина;
			Возврат ПередаваемыйОбъект;
		Иначе
			ПередаваемыйОбъект.ThisIsGroup = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Контрагенты")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ПередаваемыйОбъект = СоздатьОбъект("CatContactors");
		ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
		ПередаваемыйОбъект.Name = Данные.Наименование;
		ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;
		Если ЗначениеЗаполнено(Данные.Родитель) Тогда
			ПередаваемыйОбъект.Group = ПолучитьОбъектXDTO(Данные.Родитель);
		КонецЕсли;
		Если Данные.ЭтоГруппа Тогда
			ПередаваемыйОбъект.ThisIsGroup = Истина;
			Возврат ПередаваемыйОбъект;
		Иначе
			ПередаваемыйОбъект.ThisIsGroup = Ложь;
		КонецЕсли;
		
		ПередаваемыйОбъект.INN = Строка(Данные.Ссылка.ИНН);
		
		ПередаваемыйОбъект.Tel = "";
		Для Каждого ТекСтрока Из Данные.КонтактнаяИнформация Цикл
			Если ТекСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				ПередаваемыйОбъект.Tel = ТекСтрока.Представление;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ДоговорыКонтрагентов")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		ПередаваемыйОбъект = СоздатьОбъект("CatContracts");
		ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
		ПередаваемыйОбъект.Name = Данные.Наименование;
		ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;
		ПередаваемыйОбъект.Blocked = Данные.Заблокировано;
		ПередаваемыйОбъект.Disabled = Данные.Неактивен;
		ПередаваемыйОбъект.Limit = Данные.Ссылка.Лимит;
		
		Если ЗначениеЗаполнено(Данные.Владелец) Тогда
			ПередаваемыйОбъект.Owner = ПолучитьОбъектXDTO(Данные.Владелец);
		Конецесли;
		Если ЗначениеЗаполнено(Данные.ВидЦен) Тогда
			ПередаваемыйОбъект.PriceType = ПолучитьОбъектXDTO(Данные.ВидЦен);
		Конецесли;
		
		Строка = "";		
		Для Каждого СтрокаТаблицы Из Данные.ГрафикПосещения Цикл
			Если СтрокаТаблицы.ДеньНедели = Перечисления.ДниНедели.Понедельник Тогда
				Строка = Строка + "1";
			ИначеЕсли СтрокаТаблицы.ДеньНедели = Перечисления.ДниНедели.Вторник Тогда
				Строка = Строка + "2";
			ИначеЕсли СтрокаТаблицы.ДеньНедели = Перечисления.ДниНедели.Среда Тогда
				Строка = Строка + "3";
			ИначеЕсли СтрокаТаблицы.ДеньНедели = Перечисления.ДниНедели.Четверг Тогда
				Строка = Строка + "4";
			ИначеЕсли СтрокаТаблицы.ДеньНедели = Перечисления.ДниНедели.Пятница Тогда
				Строка = Строка + "5";
			ИначеЕсли СтрокаТаблицы.ДеньНедели = Перечисления.ДниНедели.Суббота Тогда
				Строка = Строка + "6";
			ИначеЕсли СтрокаТаблицы.ДеньНедели = Перечисления.ДниНедели.Воскресенье Тогда
				Строка = Строка + "7";
			КонецЕсли
		КонецЦикла;
		ПередаваемыйОбъект.Schedule = Строка;
		
		
		//ВидыЦен  CatPriceTypes
		Если ЗначениеЗаполнено(Данные.ВидЦен) Тогда
			ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("CatPriceTypes").Тип;
			ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
			ДобавляемаяСтрока.CatPriceType = ПолучитьОбъектXDTO(Данные.ВидЦен);
			ПередаваемыйОбъект.CatPriceTypes.Добавить(ДобавляемаяСтрока);
		Конецесли;
		
		Для Каждого  СтрокаТаблицы Из Данные.ВидыЦен Цикл
			ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("CatPriceTypes").Тип;
			ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
			Если ЗначениеЗаполнено(СтрокаТаблицы.ВидЦен) Тогда
				ДобавляемаяСтрока.CatPriceType = ПолучитьОбъектXDTO(СтрокаТаблицы.ВидЦен);
				ПередаваемыйОбъект.CatPriceTypes.Добавить(ДобавляемаяСтрока);
			Конецесли;
		КонецЦикла;
		//ВидыЦен CatPriceTypes
		
		//ВидыСкидокНаценок CatDiscounts 
		Если ЗначениеЗаполнено(Данные.ВидСкидкиНаценки) Тогда
			ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("CatDiscounts").Тип;
			ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
			ДобавляемаяСтрока.CatDiscount = ПолучитьОбъектXDTO(Данные.ВидСкидкиНаценки);
			ПередаваемыйОбъект.CatDiscounts.Добавить(ДобавляемаяСтрока);
		Конецесли;
		Для Каждого  СтрокаТаблицы Из Данные.ВидыСкидокНаценок Цикл
			ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("CatDiscounts").Тип;
			ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);			Если ЗначениеЗаполнено(СтрокаТаблицы.ВидСкидкиНаценки) Тогда
				ДобавляемаяСтрока.CatDiscount = ПолучитьОбъектXDTO(СтрокаТаблицы.ВидСкидкиНаценки);
			Конецесли;
			ПередаваемыйОбъект.CatDiscounts.Добавить(ДобавляемаяСтрока);
		КонецЦикла;
		//ВидыСкидокНаценок CatDiscounts
		
		ПередаваемыйОбъект.Address = "";
		ПередаваемыйОбъект.Tel = "";
		Для Каждого ТекСтрока Из Данные.КонтактнаяИнформация Цикл
			Если ТекСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
				ПередаваемыйОбъект.Address = ТекСтрока.Представление;
			КонецЕсли;
			Если ТекСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				ПередаваемыйОбъект.Tel = ТекСтрока.Представление;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатуры") Тогда
		
		Если Данные.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ВыгрузкаРегистра = Данные.Выгрузить();
		
		Если Не ЗначениеЗаполнено(ВыгрузкаРегистра[0].Номенклатура) Или
			 Не ЗначениеЗаполнено(ВыгрузкаРегистра[0].ВидЦен) Или
			 ЗначениеЗаполнено(ВыгрузкаРегистра[0].Характеристика) Или
			 НужныеНоменклатуры.Найти(ВыгрузкаРегистра[0].Номенклатура) = Неопределено Тогда
			Возврат Неопределено; 
		КонецЕсли;
		
		ПередаваемыйОбъект = СоздатьОбъект("Prices");
		
		ПередаваемыйОбъект.Nomenclature = ПолучитьОбъектXDTO(ВыгрузкаРегистра[0].Номенклатура);
		ПередаваемыйОбъект.PriceType = ПолучитьОбъектXDTO(ВыгрузкаРегистра[0].ВидЦен);
		ПередаваемыйОбъект.Date = ВыгрузкаРегистра[0].Период;
		ПередаваемыйОбъект.Price = ВыгрузкаРегистра[0].Цена;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("УдалениеОбъекта") Тогда
		
		ПередаваемыйОбъект = СоздатьОбъект("ObjectDeletion");
		ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
		
		Если ТипЗнч(Данные.Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
			ПередаваемыйОбъект.Type = "CatItems";
		ИначеЕсли ТипЗнч(Данные.Ссылка) = Тип("СправочникСсылка.ВидыЦен") Тогда
			ПередаваемыйОбъект.Type = "CatPriceTypes";
		ИначеЕсли ТипЗнч(Данные.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
			ПередаваемыйОбъект.Type = "CatContactors";
		ИначеЕсли ТипЗнч(Данные.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			ПередаваемыйОбъект.Type = "CatContracts";
		КонецЕсли;
		
	КонецЕсли;		
	
	Возврат ПередаваемыйОбъект;
	
КонецФункции // ПолучитьОбъектXDTO()




////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ RS.GE

Функция ОперацияRSGE(УзелОбмена, ДанныеОбмена, ЭтоВозврат) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://www.optimus.ge/SB/DistributionExchange", "Objects");
	
	Объекты = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	
	ЗагрузитьОбъекты(УзелОбмена, Объекты);
	ЧтениеXML.Закрыть();
	
	Идентификатор = Новый УникальныйИдентификатор(Объекты.objects[0].id);
	ДокументСсылка = Документы.Визит.ПолучитьСсылку(Идентификатор);
	
	Возврат ВыполнитьОперациюRSGE(ДокументСсылка, ЭтоВозврат);
	
КонецФункции

Функция ОперацияОтменаRSGE(УзелОбмена, ДанныеОбмена, ЭтоВозврат) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://www.optimus.ge/SB/DistributionExchange", "Objects");
	
	Объекты = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	
	ЗагрузитьОбъекты(УзелОбмена, Объекты);
	ЧтениеXML.Закрыть();
	
	Идентификатор = Новый УникальныйИдентификатор(Объекты.objects[0].id);
	ДокументСсылка = Документы.Визит.ПолучитьСсылку(Идентификатор);
	
	Возврат ВыполнитьОтменуТТН(ДокументСсылка, ЭтоВозврат);
	
КонецФункции

Функция ВыполнитьОперациюRSGE(ДокументВизита, ЭтоВозврат) Экспорт 
	
	Если Не ЭтоВозврат Тогда
		ДокументРасхода = ПолучитьДокументРасхода(ДокументВизита);
		
		Если ДокументРасхода = Неопределено Тогда
			Возврат НСтр("ka='გასავლის ზედნადების დოკუმენტი ვერ მოიძებნა. ხელახლა სცადეთ ვიზიტის დოკუმენტის გატარება სერვერზე';ru='Не найден документ расходной накладной. Попробуйте сначала провести документ визита на сервере';en='Document not found the expenditure invoice. Try to first conduct a visit to the document on the server'")
		КонецЕсли;
		
		ДокументПеремещения = ПолучитьДокументПеремещения(ДокументРасхода);
		
		Если ДокументПеремещения = Неопределено Тогда
			Возврат НСтр("ka='მარაგების დისტრიბუციის დოკუმენტი ვერ მოიძებნა.';ru='Не найден документ дистрибуций запасов.';en='Unable to find the document distributions stocks.'")
		КонецЕсли;
		
		ЭлНакладная = Неопределено;
		Результат = ОбновитьТТНВыписанные(ДокументВизита, ДокументРасхода, ДокументПеремещения, ЭлНакладная);
		Если Не ПустаяСтрока(Результат) Тогда
			Возврат Результат;
		КонецЕсли;
		
		Результат = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбработатьОперациюТН("СоздатьТН", ЭлНакладная.Ссылка);
		Если Не Результат = 0 Тогда 
			Возврат НСтр("ka='შეცდომა სატრანსპორტო-სასაქონლო ზედნადების ჩატვირთვისას';ru='Ошибка при загрузке ТТН';en='Error loading Waybill'") + ": " + Результат;
		КонецЕсли;
		
		Результат = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбработатьОперациюТН("ЗавершитьТН", ЭлНакладная.Ссылка);
		Если Не Результат = 0 Тогда 
			Возврат НСтр("ka='შეცდომა სატრანსპორტო-სასაქონლო ზედნადების დახურვისას';ru='Ошибка при закрытый ТТН';en='Error closing Waybill'") + ": " + Результат;
		КонецЕсли;
		
		Возврат НСтр("ka='RS.GE-ს სერვისთან მუშაობა დასრულებულია';ru='Работа с сервисом RS.GE завершена';en='Working with service RS.GE completed'") + ПолучитьСтрокуНомераТТННалоговой(ДокументРасхода);
	Иначе
		ДокументПрихода = ПолучитьДокументПрихода(ДокументВизита);
		
		Если ДокументПрихода = Неопределено Тогда
			Возврат НСтр("ka='შემოსვლის ზედნადების დოკუმენტი ვერ მოიძებნა. ხელახლა სცადეთ ვიზიტის დოკუმენტის გატარება სერვერზე';ru='Не найден документ приходной накладной. Попробуйте сначала провести документ визита на сервере';en='Document not found a credit note. Try to first conduct a visit to the document on the server'")
		КонецЕсли;
		 
		ЭлНакладная = Неопределено;
		Результат = ОбновитьТТНВыписанные(ДокументВизита, ДокументПрихода, , ЭлНакладная);
		Если Не ПустаяСтрока(Результат) Тогда
			Возврат Результат;
		КонецЕсли;
		
		АктивироватьТТН = Истина;
		Если ЭлНакладная.СтатусТН =  Перечисления.РС_СтатусыТН.Активная Тогда 		
			АктивироватьТТН = Ложь;
		КонецЕсли;
		
		Результат = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбработатьОперациюТН("СоздатьТН", ЭлНакладная.Ссылка);;
		Если Не Результат = 0 Тогда
			Возврат НСтр("ka='შეცდომა სატრანსპორტო-სასაქონლო ზედნადების ჩატვირთვისას';ru='Ошибка при загрузке ТТН';en='Error loading Waybill'") + ": " + Результат;
		КонецЕсли;      
		
		Если АктивироватьТТН Тогда 
			Результат = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбработатьОперациюТН("АктивироватьТН", ЭлНакладная.Ссылка);
			Если Не Результат = 0 Тогда 
				Возврат НСтр("ka='შეცდომა სატრანსპორტო-სასაქონლო ზედნადების აქტივაციის დროს';ru='Ошибка при активации ТТН';en='Error during activation Waybill'") + ": " + Результат;
			КонецЕсли;
		КонецЕсли;
		
		Возврат НСтр("ka='RS.GE-ს სერვისთან მუშაობა დასრულებულია';ru='Работа с сервисом RS.GE завершена';en='Working with service RS.GE completed'") + ПолучитьСтрокуНомераТТННалоговой(ДокументПрихода);
		
	КонецЕсли;
	
КонецФункции

Функция ВыполнитьОтменуТТН(ДокументВизита, ЭтоВозврат) Экспорт 
	
	Если Не ЭтоВозврат Тогда
		ДокументРасхода = ПолучитьДокументРасхода(ДокументВизита,Ложь);
		
		Если ДокументРасхода = Неопределено Тогда
			Возврат НСтр("ka='გასავლის ზედნადების დოკუმენტი ვერ მოიძებნა. ხელახლა სცადეთ ვიზიტის დოკუმენტის გატარება სერვერზე';ru='Не найден документ расходной накладной. Попробуйте сначала провести документ визита на сервере';en='Document not found the expenditure invoice. Try to first conduct a visit to the document on the server'")
		КонецЕсли;
		
		ДокументПеремещения = ПолучитьДокументПеремещения(ДокументРасхода);
		
		Если ДокументПеремещения = Неопределено Тогда
			Возврат НСтр("ka='მარაგების დისტრიბუციის დოკუმენტი ვერ მოიძებნა.';ru='Не найден документ дистрибуций запасов.';en='Unable to find the document distributions stocks.'")
		КонецЕсли;
		
		ЭлНакладная = Неопределено;
		Результат = ОбновитьТТНВыписанные(ДокументВизита, ДокументРасхода,ДокументПеремещения, ЭлНакладная);
		Если Не ПустаяСтрока(Результат) Тогда
			Возврат Результат;
		КонецЕсли;

		Результат = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбработатьОперациюТН("ОтменитьТН", ЭлНакладная.Ссылка);
		Если Не Результат = 0 Тогда 
			Возврат НСтр("ka='შეცდომა სასაქონლო ზედნადების გაუქმებისას';ru='Ошибка при отмене ТТН';en='Error cases Waybill'") + ": " + Результат;
		КонецЕсли;
		
		Возврат НСтр("ka='RS.GE-ს სერვისთან მუშაობა დასრულებულია';ru='Работа с сервисом RS.GE завершена';en='Working with service RS.GE completed'") + ПолучитьСтрокуНомераТТННалоговой(ДокументРасхода);
	Иначе
		ДокументПрихода = ПолучитьДокументПрихода(ДокументВизита,Ложь);
		
		Если ДокументПрихода = Неопределено Тогда
			Возврат НСтр("ka='შემოსვლის ზედნადების დოკუმენტი ვერ მოიძებნა. ხელახლა სცადეთ ვიზიტის დოკუმენტის გატარება სერვერზე';ru='Не найден документ приходной накладной. Попробуйте сначала провести документ визита на сервере';en='Document not found a credit note. Try to first conduct a visit to the document on the server'")
		КонецЕсли;
		
		ЭлНакладная = Неопределено;
		Результат = ОбновитьТТНВыписанные(ДокументВизита, ДокументПрихода, ,ЭлНакладная);
		Если Не ПустаяСтрока(Результат) Тогда
			Возврат Результат;
		КонецЕсли;
		
		Результат = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбработатьОперациюТН("ОтменитьТН", ЭлНакладная.Ссылка);
		Если Не Результат = 0 Тогда 
			Возврат НСтр("ka='შეცდომა სასაქონლო ზედნადების გაუქმებისას';ru='Ошибка при отмене ТТН';en='Error cases Waybill'") + ": " + Результат;
		КонецЕсли;
		
		Возврат НСтр("ka='RS.GE-ს სერვისთან მუშაობა დასრულებულია';ru='Работа с сервисом RS.GE завершена';en='Working with service RS.GE completed'") + ПолучитьСтрокуНомераТТННалоговой(ДокументПрихода);
	КонецЕсли;
	
КонецФункции


Функция ПолучитьДокументРасхода(ДокументВизита,Проведен = Истина)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.ДокументВизита = &ДокументВизита" + ?(Проведен,"
		|	И РасходнаяНакладная.Проведен = ИСТИНА","");

	Запрос.УстановитьПараметр("ДокументВизита", ДокументВизита);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьДокументПеремещения(ДокументРасхода)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеЗапасов.Ссылка
		|ИЗ
		|	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
		|ГДЕ
		|	ПеремещениеЗапасов.Проведен = ИСТИНА
		|	И ПеремещениеЗапасов.Организация = &Организация
		|	И ПеремещениеЗапасов.СтруктурнаяЕдиницаПолучатель = &СтруктурнаяЕдиницаПолучатель
		|	И ПеремещениеЗапасов.Дата <= &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПеремещениеЗапасов.Дата УБЫВ";

	Запрос.УстановитьПараметр("Организация", ДокументРасхода.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиницаПолучатель", ДокументРасхода.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	Возврат Неопределено;
	
КонецФункции

//ПМ++ Глухов 11.04.21
//Ищем водителя, который ранее доставил товары этому контрагенту. Значит он же заберет товары при возврате
Процедура ЗаполнитьВодителяИТранспортноеСредствоПриВозврате(ДокументВизита, ЭлНакладная, ГрузоПолучатель, ТипДокумента="ПеремещениеЗапасов") Экспорт
	ЭлНакладная.ТранспортноеСредство = ДокументВизита.ТранспортноеСредство;
	ЭлНакладная.ГосНомерАвтомобиля	 = ДокументВизита.ТранспортноеСредство.Код;
	ЭлНакладная.Водитель	 	= ЭлНакладная.ТранспортноеСредство.ОсновнойВодитель;
	ЭлНакладная.НомерУдостоверения	 	= ЭлНакладная.Водитель.ИНН;
	Возврат;

	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РС_ЭлектроннаяНакладная.ТранспортноеСредство,
	|	РС_ЭлектроннаяНакладная.ГосНомерАвтомобиля,
	|	РС_ЭлектроннаяНакладная.ГосНомерПрицепа,
	|	РС_ЭлектроннаяНакладная.Водитель,
	|	РС_ЭлектроннаяНакладная.НомерУдостоверения,
	|	РС_ЭлектроннаяНакладная.Дата КАК Дата
	|ИЗ
	|	Документ.РС_ЭлектроннаяНакладная КАК РС_ЭлектроннаяНакладная
	|ГДЕ
	|	НЕ РС_ЭлектроннаяНакладная.ПометкаУдаления
	|	И РС_ЭлектроннаяНакладная.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И РС_ЭлектроннаяНакладная.Организация = &Организация
	|	И РС_ЭлектроннаяНакладная.ГрузоПолучатель = &ГрузоПолучатель
	|	И РС_ЭлектроннаяНакладная.Ссылка <> &Ссылка
	|	И РС_ЭлектроннаяНакладная.Водитель <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	И 1 = 1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	Запрос.Текст=СтрЗаменить(Запрос.Текст,"1 = 1","РС_ЭлектроннаяНакладная.ДокументыОснования.ДокументОснование ССЫЛКА Документ."+ТипДокумента);

	Запрос.УстановитьПараметр("Ссылка",ЭлНакладная.Ссылка);
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ЭлНакладная.Дата));
	Запрос.УстановитьПараметр("ДатаКон",ЭлНакладная.Дата);
	Запрос.УстановитьПараметр("Организация",ЭлНакладная.Организация);
	Запрос.УстановитьПараметр("ГрузоПолучатель",ГрузоПолучатель);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Водитель) Тогда
			ЗаполнитьЗначенияСвойств(ЭлНакладная,Выборка,"Водитель,НомерУдостоверения");
		КонецЕсли;	
		Если ЗначениеЗаполнено(Выборка.ТранспортноеСредство) Тогда
			ЗаполнитьЗначенияСвойств(ЭлНакладная,Выборка,"ТранспортноеСредство,ГосНомерАвтомобиля,ГосНомерПрицепа");
		КонецЕсли;	
	КонецЕсли; 	
КонецПроцедуры // ПолучитьВодителяИТранспортноеСредствоПриВозврате()
 
Функция ОбновитьТТНВыписанные(ДокументВизита, ДокументТТН, ДокументПеремещения = Неопределено, ЭлНакладная)

	ЭтаДистрибуция = Константы.ОПТИМУС_ФункциональнаяОпцияДистрибуция.Получить();
	ИспользоватьАдресИзДоговораДляТТН = Константы.ОПТИМУС_ИспользоватьАдресИзДоговораДляТТН.Получить();
	
	Попытка
		////Если ЗначениеЗаполнено(ДокументТТН.ТТНВыписанный) Тогда 
		////	Запись = ДокументТТН.ТТНВыписанный.ПолучитьОбъект();
		////	НадоОбновитьРеквизитДокументаТТН = Ложь;
		////Иначе 
		////	Запись = Справочники.ОПТИМУС_ТТНВыписанные.СоздатьЭлемент();
		////	НадоОбновитьРеквизитДокументаТТН = Истина;
		////КонецЕсли;
		////
		////Запись.ПометкаУдаления = Ложь;
		////Запись.Документ = ДокументТТН;
		////Запись.ДокументОснование = ДокументПеремещения;
		////Запись.ТекущийСтатусТТН = Перечисления.ОПТИМУС_СтатусыВыписанныхТТН.Неопределено;
		////
		////Запись.Отправитель = Запись.Документ.СтруктурнаяЕдиница;
		////Запись.Получатель  = Запись.Документ.Контрагент;
		////Если Не ДокументПеремещения = Неопределено Тогда
		////	Запись.ВидТТН = Перечисления.ОПТИМУС_ВидыТТН.ПодчиненнаяТТН;
		////Иначе
		////	Запись.ВидТТН = Перечисления.ОПТИМУС_ВидыТТН.ВозвратОтПокупателя;
		////	
		////КонецЕсли;
		////Запись.СпособТранспортировки = Перечисления.ОПТИМУС_ВидыТранспортировокВТТН.ТранспортировкаАвтомобилем;
		////Запись.Комментарий = Запись.Документ.Комментарий;
		////
		////АдресПоДоговору = Запись.Документ.Договор.Адрес;
		////АдресКонтрагента = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Запись.Документ.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
		////
		//////Запись.АдресОтправки = ?(ЭтаДистрибуция Или ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);
		//////Запись.АдресДоставки = Запись.Отправитель.Адрес;
		////
		//////+++ИС Гоч Сергей 15-06-2015 (
		////Если Запись.ВидТТН = Перечисления.ОПТИМУС_ВидыТТН.ВозвратОтПокупателя Тогда
		////	Запись.АдресОтправки = ?(ЭтаДистрибуция Или ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);
		////	Запись.АдресДоставки = Запись.Отправитель.Адрес;
		////Иначе           
		////	Запись.АдресДоставки = ?(ЭтаДистрибуция Или ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);
		////	Запись.АдресОтправки = Запись.Отправитель.Адрес;
		////КонецЕсли;
		//////+++ИС Гоч Сергей 15-06-2015 )
		////
		////Запись.ТранспортноеСредство = ДокументВизита.ТранспортноеСредство;
		////Запись.Водитель = Запись.ТранспортноеСредство.ОсновнойВодитель;
		////
		////Запись.Записать();
		////
		////Если НадоОбновитьРеквизитДокументаТТН Тогда
		////	ДокументТТНОбъект = ДокументТТН.ПолучитьОбъект();
		////	
		////	ДокументТТНОбъект.ТТНВыписанный = Запись.Ссылка;
		////	ДокументТТНОбъект.Записать();
		////КонецЕсли;
		Договор 		= ДокументВизита.Договор;
		
		АдресПоДоговору = Договор.Адрес;
		АдресКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(ДокументВизита.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	
		ЭлНакладная = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйЭлНакладная(ДокументТТН);
		Если ЗначениеЗаполнено(ЭлНакладная) Тогда
			ЭлНакладная = ЭлНакладная.Ссылка.Получитьобъект();
			ЭлНакладная.ДокументыОснования.Очистить();
		Иначе
			ЭлНакладная = Документы.РС_ЭлектроннаяНакладная.СоздатьДокумент();
		КонецЕсли;
		ЭлНакладная.Организация				= ДокументТТН.Организация;
		ЭлНакладная.ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ЭлНакладная.Дата 					= ТекущаяДата();
		ЭлНакладная.ТранспортноеСредство	= ДокументВизита.ТранспортноеСредство;
		ЭлНакладная.ГосНомерАвтомобиля	 	= ДокументВизита.ТранспортноеСредство.Код;
		
		НоваяСтрока = ЭлНакладная.ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ДокументТТН;
		
		МассивДокументовОснования = Новый Массив;
		МассивДокументовОснования.Добавить(ДокументТТН);
		Если Не ДокументПеремещения = Неопределено Тогда
			ЭлНакладная.НакладнаяДистрибюций 	= ДокументПеремещения;
			
			ЭлНакладная.ТипТН 					= Перечисления.РС_ТипыТН.ПодчиненнаяТН;
			ЭлНакладная.ГрузоОтправитель   		= ДокументТТН.Организация;
			ЭлНакладная.АдресОтправки 			= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(ДокументВизита.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
			ЭлНакладная.ГрузоПолучатель 		= ?(ЭтаДистрибуция Или ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);
			ЭлНакладная.АдресДоставки 			= Договор.Адрес;	
			ЭлНакладная.Водитель			 	= Договор.Водитель;
			ЭлНакладная.НомерУдостоверения   	= Договор.Водитель.ИНН;
			
			ЭлНакладная.Товары.Загрузить(ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуРеализации(МассивДокументовОснования));
		Иначе
			ЭлНакладная.ТипТН 					= Перечисления.РС_ТипыТН.ВозвратОтПокупателя;
			ЭлНакладная.ГрузоОтправитель 		= ДокументТТН.Контрагент;
			ЭлНакладная.АдресОтправки	 		= ?(ЭтаДистрибуция Или ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);
			ЭлНакладная.Грузополучатель			= ДокументТТН.Организация;			
			ЭлНакладная.АдресДоставки   		= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(ДокументВизита.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);			
			ЭлНакладная.Водитель			 	= Договор.Водитель;
			ЭлНакладная.НомерУдостоверения   	= Договор.Водитель.ИНН;
			
			//ПМ++ Глухов 11.04.21
			ЗаполнитьВодителяИТранспортноеСредствоПриВозврате(ДокументВизита, ЭлНакладная, ЭлНакладная.ГрузоОтправитель);
			//ПМ--
			
			ЭлНакладная.Товары.Загрузить(ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуВозврата(МассивДокументовОснования));
		КонецЕсли;
		
		Организация_СоответствиеНоменклатур = ДокументТТН.Организация.СоответствиеНоменклатур;
		ЭлНакладная.ТоварыЭлНакладных.Очистить();
		
		//СформироватьТаблицуЭлНакладных
		Для каждого СтрТаб Из ЭлНакладная.Товары  Цикл
			СтрЭлНТаб = ЭлНакладная.ТоварыЭлНакладных.Добавить();
			Если Не ЗначениеЗаполнено(СтрТаб.Номенклатура) Тогда 
				Продолжить;
			КонецЕсли;
			СтрЭлНТаб.ID       = 0;//СтрТаб.НомерСтроки-1 Паганини
			СтрЭлНТаб.W_NAME   = РС_ОбщегоНазначения.ПредставлениеНоменклатуры(СтрТаб.Номенклатура,СтрТаб.Характеристика,СтрТаб.Партия);
			СтрЭлНТаб.UNIT_ID  = СтрТаб.ЕдиницаИзмерения.КодДляНалоговой;
			СтрЭлНТаб.UNIT_TXT = СтрТаб.ЕдиницаИзмерения.Наименование;
			СтрЭлНТаб.QUANTITY = СтрТаб.Количество;
			СтрЭлНТаб.PRICE	   = СтрТаб.Цена;
			СтрЭлНТаб.STATUS   = "1";
			СтрЭлНТаб.AMOUNT   = СтрТаб.Сумма;
			Если Организация_СоответствиеНоменклатур = Перечисления.СоответствияНоменклатуры.ПоАртикулу Тогда 
				СтрЭлНТаб.BAR_CODE = СтрТаб.Номенклатура.Артикул;
			ИначеЕсли Организация_СоответствиеНоменклатур = Перечисления.СоответствияНоменклатуры.ПоШтрихкоду Тогда 
				СтрЭлНТаб.BAR_CODE = СтрТаб.Номенклатура.ОсновнойШтрихКод;
			ИначеЕсли Организация_СоответствиеНоменклатур = Перечисления.СоответствияНоменклатуры.ПоХарактеристике Тогда
				СтрЭлНТаб.BAR_CODE = ПолучитьКодХарактеристики(СтрТаб);	
			Иначе
				СтрЭлНТаб.BAR_CODE = СтрТаб.Номенклатура.Код;
			КонецЕсли;
			СтрЭлНТаб.A_ID     = 0;//Акциз
			Если СтрТаб.СтавкаНДС.НеОблагается Тогда
				СтрЭлНТаб.VAT_TYPE = 2;
			ИначеЕсли СтрТаб.СтавкаНДС.Ставка = 0 Тогда
				СтрЭлНТаб.VAT_TYPE = 1;
			ИначеЕсли СтрТаб.СтавкаНДС.Ставка = 18 Тогда
				СтрЭлНТаб.VAT_TYPE = 0;
			КонецЕсли;
			СтрЭлНТаб.QUANTITY_EXT =  СтрТаб.Количество;
		КонецЦикла;
		
		//СформироватьТаблицуШапкаRS
		TRANS_ID = 0;
		TRANS_TXT = "";
		документы.РС_ЭлектроннаяНакладная.ПолучитьВидТранспортировкиЭл(ЭлНакладная.ТипТН, ЭлНакладная.ВидТранспортировки, "", "", TRANS_ID, TRANS_TXT);
		СтатусыОперацииТН = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьСтатусОперацииТН();
		
		СтрукПар = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИнициализацияОтправкиТН(Новый Структура, ЭлНакладная.Организация);
		Если ТипЗнч(СтрукПар) = Тип("Строка") Тогда 
			Возврат СтрукПар;
		КонецЕсли;
		seller_un_id 	= СтрукПар.un_id;
		
		ЭлНакладная.ШапкаRS.Очистить();

		//ID
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "ID"; 
		СтрШапкаRS.ЗначениеПараметраRS = ЭлНакладная.ID_ТН; 
		
		//STATUS
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "STATUS"; 
		СтрШапкаRS.ЗначениеПараметраRS =?(ЗначениеЗаполнено(ЭлНакладная.СтатусТН),СтатусыОперацииТН[ЭлНакладная.СтатусТН],0); 

		//TYPE
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "TYPE"; 
		СтрШапкаRS.ЗначениеПараметраRS = документы.РС_ЭлектроннаяНакладная.ОпределитьТипТН(ЭлНакладная.ТипТН); 
		
		//ACTIVATE_DATE
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "ACTIVATE_DATE"; 
		СтрШапкаRS.ЗначениеПараметраRS = ЭлНакладная.ДатаНачалаТранспортировки; 
		
		//BUYER
		Если ЭлНакладная.ТипТН =  Перечисления.РС_ТипыТН.ВозвратОтПокупателя Тогда 
			ГрузоОтправитель = ЭлНакладная.ГрузоОтправитель;
			//BUYER_TIN
			СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
			СтрШапкаRS.ИмяПараметраRS = "BUYER_TIN"; 
			СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ГрузоОтправитель), СокрЛП(ГрузоОтправитель.ИНН), ""); 
			
			//CHEK_BUYER_TIN
			СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
			СтрШапкаRS.ИмяПараметраRS = "CHEK_BUYER_TIN"; 
			СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ГрузоОтправитель), ?(ГрузоОтправитель.ЯвляетсяНеРезидентом,0,1), 0); 
			//BUYER_NAME
			СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
			СтрШапкаRS.ИмяПараметраRS = "BUYER_NAME"; 
			СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ГрузоОтправитель), ГрузоОтправитель.Наименование, ""); 
		Иначе 
			Грузополучатель = ЭлНакладная.Грузополучатель;
			//BUYER_TIN
			СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
			СтрШапкаRS.ИмяПараметраRS = "BUYER_TIN"; 
			СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(Грузополучатель), СокрЛП(Грузополучатель.ИНН), ""); 
			
			//CHEK_BUYER_TIN
			СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
			СтрШапкаRS.ИмяПараметраRS = "CHEK_BUYER_TIN"; 
			СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(Грузополучатель), ?(Грузополучатель.ЯвляетсяНеРезидентом,0,1), 0); 
			//BUYER_NAME
			СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
			СтрШапкаRS.ИмяПараметраRS = "BUYER_NAME"; 
			СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(Грузополучатель), Грузополучатель.Наименование, ""); 
		КонецЕсли;
		
		//START_ADDRESS
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "START_ADDRESS"; 
		СтрШапкаRS.ЗначениеПараметраRS =  ЭлНакладная.АдресОтправки; 
		
		//END_ADDRESS
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "END_ADDRESS"; 
		СтрШапкаRS.ЗначениеПараметраRS = ЭлНакладная.АдресДоставки; 
		
		//DRIVER_TIN
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "DRIVER_TIN"; 
		СтрШапкаRS.ЗначениеПараметраRS = СокрЛП(ЭлНакладная.НомерУдостоверения); 
		
		//CHEK_DRIVER_TIN
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "CHEK_DRIVER_TIN"; 
		СтрШапкаRS.ЗначениеПараметраRS = ?(ЭлНакладная.Водитель.ЯвляетсяНеРезидентом,0,1); 
		
		//DRIVER_NAME
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "DRIVER_NAME"; 
		СтрШапкаRS.ЗначениеПараметраRS = ЭлНакладная.Водитель.Наименование;  
		
		//RECEPTION_INFO
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "RECEPTION_INFO"; 
		СтрШапкаRS.ЗначениеПараметраRS = Строка(ЭлНакладная.Отпустил); 
		
		//RECEIVER_INFO
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "RECEIVER_INFO"; 
		СтрШапкаRS.ЗначениеПараметраRS = Строка(ЭлНакладная.Получил);
		
		//SELER_UN_ID
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "SELER_UN_ID"; 
		СтрШапкаRS.ЗначениеПараметраRS = seller_un_id; 
		
		//CAR_NUMBER
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "CAR_NUMBER"; 
		СтрШапкаRS.ЗначениеПараметраRS = ЭлНакладная.ГосНомерАвтомобиля; 
		
		//BEGIN_DATE
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "BEGIN_DATE"; 
		СтрШапкаRS.ЗначениеПараметраRS = ЭлНакладная.ДатаНачалаТранспортировки; 
		
		//TRANS_ID
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "TRANS_ID"; 
		СтрШапкаRS.ЗначениеПараметраRS = TRANS_ID;
		
		//TRANSPORTER_TIN
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "TRANSPORTER_TIN";
		Если TRANS_ID = 7 Тогда
			Если ЗначениеЗаполнено(ЭлНакладная.Перевозчик) Тогда
				СтрШапкаRS.ЗначениеПараметраRS = ЭлНакладная.Перевозчик.ИНН;
			Иначе
			    СтрШапкаRS.ЗначениеПараметраRS = "";
			КонецЕсли;
		Иначе
			СтрШапкаRS.ЗначениеПараметраRS = "";
		КонецЕсли;
		
		//TRANS_TXT
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "TRANS_TXT"; 
		СтрШапкаRS.ЗначениеПараметраRS = TRANS_TXT; 
		
		//COMMENT
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "COMMENT"; 
		СтрШапкаRS.ЗначениеПараметраRS = ЭлНакладная.КомментарийТН; 
		
		//PAR_ID
		//Паганини_
		Если ЭлНакладная.ТипТН = Перечисления.РС_ТипыТН.ПодчиненнаяТН Тогда
			СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
			СтрШапкаRS.ИмяПараметраRS 		= "PAR_ID"; 
			СтрШапкаRS.ЗначениеПараметраRS 	= ЭлНакладная.НакладнаяДистрибюций.IDTТН;
		Иначе//_Паганини
			СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
			СтрШапкаRS.ИмяПараметраRS 		= "PAR_ID"; 
			СтрШапкаRS.ЗначениеПараметраRS 	= "";
		КонецЕсли;//Паганини
		
		Если ЭлНакладная.ТипТН = Перечисления.РС_ТипыТН.РеализацияСТранспортировкой ИЛИ ЭлНакладная.ТипТН = Перечисления.РС_ТипыТН.ВозвратОтПокупателя Тогда
			УказыватьЗатратуТранспортировки = ЭлНакладная.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Автомобильная ИЛИ
											  ЭлНакладная.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Автомобильная_Заграничная ИЛИ
											  ЭлНакладная.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Перегрузчик_Автомобильная;
		Иначе
			УказыватьЗатратуТранспортировки = Ложь;
		КонецЕсли;
		//TRANSPORT_COAST
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "TRANSPORT_COAST"; 
		СтрШапкаRS.ЗначениеПараметраRS = ?(УказыватьЗатратуТранспортировки, ЭлНакладная.СуммаОплатыТранспортировки, 0);
		
		//TRAN_COST_PAYER
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "TRAN_COST_PAYER"; 
		СтрШапкаRS.ЗначениеПараметраRS = ?(УказыватьЗатратуТранспортировки, ?(ЭлНакладная.ПлательщикТранспортировкиТН = Перечисления.ПлательщикТранспортировкиТН.Покупатель, 1, 2), 2);//?(ЭлНакладная.ТранспортировкаЗаСчетПокупателя,1,2) 
		
		//Паганини
		//FULL_AMOUNT
		СтрШапкаRS = ЭлНакладная.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "FULL_AMOUNT"; 
		СтрШапкаRS.ЗначениеПараметраRS = ЭлНакладная.Товары.Итог("Сумма");
		
		ЭлНакладная.Записать();
		
		
		Возврат "";
	Исключение
		Возврат НСтр("ka='რეგისტრის განახლების შეცდომა სატრანსპორტო-სასაქონლო ზედნადებები გამოწერილი';ru='Ошибка обновления регистра ТТНВыписанные';en='Error updating register TTNVypisannye'")
	КонецПопытки;
	
КонецФункции

//ДД
Функция ПолучитьКодХарактеристики(Стр)
	
	Если ЗначениеЗаполнено(Стр.Характеристика) Тогда
		Возврат Стр.Характеристика.Код;
	Иначе
		Возврат Стр.Номенклатура.Код;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьДокументПрихода(ДокументВизита,Проведен = Истина)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПриходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	ПриходнаяНакладная.ДокументВизита = &ДокументВизита" + ?(Проведен,"
		|	И ПриходнаяНакладная.Проведен = ИСТИНА","");

	Запрос.УстановитьПараметр("ДокументВизита", ДокументВизита);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСтрокуНомераТТННалоговой(ДокументТТН)
	
	Возврат "%НомерТТН%" + ДокументТТН.НомерТТН;
	
КонецФункции




////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ПЕЧАТИ ТТН

// Печатает ТТН
//
Функция ОперацияНапечататьТТН(УзелОбмена, ДанныеОбмена, ЭтоВозврат) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://www.optimus.ge/SB/DistributionExchange", "Objects");
	
	Объекты = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	
	ЗагрузитьОбъекты(УзелОбмена, Объекты);
	ЧтениеXML.Закрыть();
	
	Идентификатор = Новый УникальныйИдентификатор(Объекты.objects[0].id);
	ДокументСсылка = Документы.Визит.ПолучитьСсылку(Идентификатор);
	
	Возврат ВыполнитьОперациюНапечататьТТН(ДокументСсылка, ЭтоВозврат);
	
КонецФункции

Функция ВыполнитьОперациюНапечататьТТН(ДокументВизита, ЭтоВозврат)
	
	ЗначениеДляВозврата = СоздатьОбъект("DataWithAnswer");
	
	Если Не ЭтоВозврат Тогда
		ДокументТТН = ПолучитьДокументРасхода(ДокументВизита);
	Иначе
		ДокументТТН = ПолучитьДокументПрихода(ДокументВизита);
	КонецЕсли;
	
	Если ДокументТТН = Неопределено Тогда
		ЗначениеДляВозврата.Answer = НСтр("ka='გასავლის ზედნადების დოკუმენტი ვერ მოიძებნა. ხელახლა სცადეთ ვიზიტის დოკუმენტის გატარება სერვერზე';ru='Не найден документ расходной накладной. Попробуйте сначала провести документ визита на сервере';en='Document not found the expenditure invoice. Try to first conduct a visit to the document on the server'");
		Возврат ЗначениеДляВозврата;
	КонецЕсли;
	МассивСОбъектами = Новый Массив;
	НайденныйЭлНакладная = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйЭлНакладная(ДокументТТН);
	
	Если Не ТипЗнч(НайденныйЭлНакладная)=Тип("Структура") ИЛИ Не ЗначениеЗаполнено(НайденныйЭлНакладная.Ссылка) Тогда
		ЗначениеДляВозврата.Answer = НСтр("ka='სასაქონლო ზედნადები არ არის გამოწერილი';ru='Товарно-транспортная накладная не выписана';en='Document not found the expenditure invoice.'");
		Возврат ЗначениеДляВозврата;
	КонецЕсли; 
	
	МассивСОбъектами.Добавить(НайденныйЭлНакладная.Ссылка);
	
	//ПараметрыПечати=Новый Структура("ДополнитьКомплектВнешнимиПечатнымиФормами",Ложь);
	//ПараметрыОтправки=Новый Структура("Получатель,Текст,Тема",Неопределено,"","");
	//ПараметрыВывода=Новый Структура("ДоступнаПечатьПоКомплектно,ПараметрыОтправки",Ложь,ПараметрыОтправки);
	//КоллекцияПечатныхФорм=Новый ТаблицаЗначений;
	//КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
	//КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	//КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	//КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");
	//КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
	//КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	//КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	//КоллекцияПечатныхФорм.Колонки.Добавить("Экземпляров");
	//стр=КоллекцияПечатныхФорм.Добавить();
	//стр.ИмяВРЕГ="ТОВАРНАЯНАКЛАДНАЯRS";
	//стр.ИмяМакета="ТоварнаяНакладнаяRS";
	//стр.Экземпляров=1;
	
	Если Не ЭтоВозврат Тогда
		//ПМ++ Глухов 19.04.21
		//ТабДок = Документы.РасходнаяНакладная.ПечатьПечатьФормаТТН(МассивСОбъектами);
		//ТабДок=Обработки.ПечатьТТН.ПечатнаяФорма(МассивСОбъектами,Новый СписокЗначений,Неопределено);
		
		ТабДок=Документы.РС_ЭлектроннаяНакладная.ПечатнаяФорма(МассивСОбъектами,Новый СписокЗначений,"ТоварнаяНакладнаяRS");
	Иначе
		//ПМ++ Глухов 19.04.21
		//ТабДок = Документы.ПриходнаяНакладная.ПечатьПечатьФормаТТН(МассивСОбъектами);
		ТабДок=Документы.РС_ЭлектроннаяНакладная.ПечатнаяФорма(МассивСОбъектами,Новый СписокЗначений,"ТоварнаяНакладнаяRS");
	КонецЕсли;
	ТабДок.Автомасштаб=Истина;
	
	ПутьФайлаСервер = ПолучитьИмяВременногоФайла("pdf");
	ТабДок.Записать(ПутьФайлаСервер, ТипФайлаТабличногоДокумента.PDF);
	ДДФайла = Новый ДвоичныеДанные(ПутьФайлаСервер);
	Попытка
		УдалитьФайлы(ПутьФайлаСервер);
	Исключение
	КонецПопытки;
	
	ЗначениеДляВозврата.Data = Новый ХранилищеЗначения(ДДФайла, Новый СжатиеДанных(9));
	
	Возврат ЗначениеДляВозврата;
	
КонецФункции

Функция ПолучитьРезультатОтчета(УзелОбмена, ИмяОтчета, ВариантОтчета, Знач ДатаНачала, Знач ДатаОкончания, ДанныеОбмена) Экспорт
	
	ЗначениеДляВозврата = СоздатьОбъект("DataWithAnswer");
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://www.optimus.ge/SB/DistributionExchange", "Objects");
	
	Объекты = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	
	//ЗагрузитьОбъекты(УзелОбмена, Объекты);
	ЧтениеXML.Закрыть();
	Попытка
	  Если Объекты.objects.Количество()>0 Тогда
			Идентификатор = Новый УникальныйИдентификатор(Объекты.objects[0].id);
			Договор = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Идентификатор);
		Иначе
			Договор=Неопределено;
		КонецЕсли; 
		ДатаНачала=XMLЗначение(Тип("Дата"),ДатаНачала);
		ДатаОкончания=XMLЗначение(Тип("Дата"),ДатаОкончания);	
		
		от=Отчеты[ИмяОтчета].Создать();
		
		ПараметрыОтчета=Новый Структура("ВариантОтчета,ДатаНачала,ДатаОкончания,Договор,ТорговыйПредставитель",ВариантОтчета,ДатаНачала,ДатаОкончания,Договор,ПолучитьТорговогоПредставительяИзУзлаОбмена(УзелОбмена));
		ТабДок=от.ПолучитьРезультат(ПараметрыОтчета);
		
		Если ТипЗнч(ТабДок)=Тип("ТабличныйДокумент") Тогда
			ПутьФайлаСервер = ПолучитьИмяВременногоФайла("MXL");
			ТабДок.Записать(ПутьФайлаСервер, ТипФайлаТабличногоДокумента.MXL);
			ДДФайла = Новый ДвоичныеДанные(ПутьФайлаСервер);
			ЗначениеДляВозврата.Data = Новый ХранилищеЗначения(ДДФайла, Новый СжатиеДанных(9));
		Иначе
			ЗначениеДляВозврата.Answer=ТабДок;
		КонецЕсли; 
	Исключение
	  ЗначениеДляВозврата.Answer=ОписаниеОшибки();
		Возврат ЗначениеДляВозврата;
	КонецПопытки;
	
	Попытка
		УдалитьФайлы(ПутьФайлаСервер);
	Исключение
	КонецПопытки;
	
		
	Возврат ЗначениеДляВозврата;
КонецФункции

Функция ПолучитьТорговогоПредставительяИзУзлаОбмена(УзелОбмена) Экспорт
	СтруктураОтбора = УзелОбмена.ХранилищеОтбораСхемыОбмена.Получить();
	СтруктураОтвета=Новый Структура("ВидСравнения,ПравоеЗначение",СтруктураОтбора.ТорговыйПредставитель.ВидСравнения,СтруктураОтбора.ТорговыйПредставитель.ПравоеЗначение);
	Возврат СтруктураОтвета;
КонецФункции // ПолучитьТорговогоПредставительяИзУзлаОбмена()
 
Функция УстановитьПараметрыОтчета(КомпоновщикНастроек, ПараметрыОтчета) Экспорт
	Если ПараметрыОтчета.Свойство("Договор") И ЗначениеЗаполнено(ПараметрыОтчета.Договор) Тогда
		Для каждого стр Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если стр.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Договор") Тогда
				стр.ПравоеЗначение=ПараметрыОтчета.Договор;
				стр.Использование=Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	Если ПараметрыОтчета.Свойство("ТорговыйПредставитель") И ЗначениеЗаполнено(ПараметрыОтчета.ТорговыйПредставитель) Тогда
		Для каждого стр Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если стр.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Договор.ТорговыйПредставитель") Тогда				
				стр.ВидСравнения=ПараметрыОтчета.ТорговыйПредставитель.ВидСравнения;
				стр.ПравоеЗначение=ПараметрыОтчета.ТорговыйПредставитель.ПравоеЗначение;
				стр.Использование=Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Параметр = НастройкиКомпоновки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтПериод"));
	Если Параметр <> Неопределено Тогда
	  Параметр.Значение.ДатаНачала=ПараметрыОтчета.ДатаНачала;
		Параметр.Значение.ДатаОкончания=ПараметрыОтчета.ДатаОкончания;
	  Параметр.Использование = Истина;
	КонецЕсли;
	Возврат НастройкиКомпоновки;
КонецФункции
 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РЕГИСТРАЦИИ ДЛЯ ОБМЕНА

// Регистрация изменений справочника для обмена
//
Процедура ОПТИМУС_ЗарегистрироватьИзмененияСправочникаДляОбменаОПТИМУС_ДистрибуцияПередЗаписью(Источник, Отказ) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ОПТИМУС_Дистрибуция") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.ЭтоНовый() Тогда
		Источник.ДополнительныеСвойства.Вставить("ТребуетсяПроверитьРегистрацию", Истина);
	Иначе	
		Источник.ДополнительныеСвойства.Вставить("ВозможноУдалениеРегистрацииИзменений", Истина);
		ВыборочнаяРегистрацияОбъекта(Источник, Отказ, "ОПТИМУС_Дистрибуция");
	КонецЕсли;

КонецПроцедуры

// Регистрация изменений справочника для обмена при записи
//
Процедура ОПТИМУС_ЗарегистрироватьИзмененияСправочникаПриЗаписиДляОбменаОПТИМУС_ДистрибуцияПриЗаписи(Источник, Отказ) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ОПТИМУС_Дистрибуция") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПроверитьРегистрацию = Ложь;
	Если Источник.ДополнительныеСвойства.Свойство("ТребуетсяПроверитьРегистрацию", ТребуетсяПроверитьРегистрацию) Тогда
		Если ТребуетсяПроверитьРегистрацию Тогда			
			ВыборочнаяРегистрацияОбъекта(Источник, Отказ, "ОПТИМУС_Дистрибуция");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Формирует и возвращает массив, содержащий имена полей, на которые могут накладываться отборы
//
// Параметры:
//  ИмяКласса - имя класса, к которому принадлежит объект (Справочники, Документы и т.д)
//  ИмяОбъекта - имя объекта метаданных, для которого формируется массив полей
//
// Возвращаемое значение:
//  Массив, содержащий имена полей
//
Функция ПолучитьМассивПолейОтбораДляОбъекта(ИмяКласса, ИмяОбъекта) Экспорт

	МассивПолей = Новый Массив();

	Если ИмяКласса = "Справочники" Тогда

		//Если ИмяОбъекта = "Партнеры" Тогда
		//	МассивПолей.Добавить("ОбслуживаетсяТорговымиПредставителями");
		//	МассивПолей.Добавить("Клиент");
		//ИначеЕсли ИмяОбъекта = "СоглашенияСКлиентами" Тогда
		//	МассивПолей.Добавить("Статус");
		//	МассивПолей.Добавить("Типовое");
		//ИначеЕсли ИмяОбъекта = "ДоговорыКонтрагентов" Тогда
		//	МассивПолей.Добавить("Статус");
		//	МассивПолей.Добавить("ХозяйственнаяОперация");
		//ИначеЕсли ИмяОбъекта = "Контрагенты" Тогда
		//	МассивПолей.Добавить("Партнер");
		//ИначеЕсли ИмяОбъекта = "КонтактныеЛицаПартнеров" Тогда
		//	МассивПолей.Добавить("Владелец");
		//ИначеЕсли ИмяОбъекта = "ВидыЦен" Тогда
		//	МассивПолей.Добавить("ИспользоватьПриПродаже");
		//ИначеЕсли ИмяОбъекта = "УпаковкиНоменклатуры" Тогда
		//	МассивПолей.Добавить("Владелец");
		//ИначеЕсли ИмяОбъекта = "ХарактеристикиНоменклатуры" Тогда
		//	МассивПолей.Добавить("Владелец");
		//КонецЕсли;

	ИначеЕсли ИмяКласса = "Документы" Тогда

		//Если ИмяОбъекта = "ЗаданиеТорговомуПредставителю" Тогда
		//	МассивПолей.Добавить("Партнер");
		//	МассивПолей.Добавить("Статус");
		//	МассивПолей.Добавить("ТорговыйПредставитель");
		//КонецЕсли;

	ИначеЕсли ИмяКласса = "РегистрыСведений" Тогда

		//Если ИмяОбъекта = "ЦеныНоменклатуры" Тогда
		//	МассивПолей.Добавить("ВидЦены");
		//	МассивПолей.Добавить("Номенклатура");
		//ИначеЕсли ИмяОбъекта = "ДоступностьТоваровДляВнешнихПользователей" Тогда
		//	МассивПолей.Добавить("Номенклатура");
		//	МассивПолей.Добавить("Склад");
		//КонецЕсли;

	КонецЕсли;

	Возврат МассивПолей;

КонецФункции

// Возвращает структуру, содержащую имя таблицы для выборки и массив полей, которые нужно выбрать
//
// Параметры:
//  ОбъектМетаданных - объект метаданных, структуру описания которого требуется получить
//  Изменения - признак того, что в качестве таблицы для выборки выступает таблица изменений
//
// Возвращаемое значение:
//  Структура, содержащая описание объекта метаданных
//
Функция ПолучитьСтруктуруОписанияОбъекта(ОбъектМетаданных, Изменения = Ложь) Экспорт

	Если Метаданные.Константы.Содержит(ОбъектМетаданных) Тогда
		ИмяКласса = "Константы";
		ИмяТаблицы = "Константы";
	ИначеЕсли Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		ИмяКласса = "Справочники";
		ИмяТаблицы = "Справочник." + ОбъектМетаданных.Имя;
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		ИмяКласса = "Документы";
		ИмяТаблицы = "Документ." + ОбъектМетаданных.Имя;
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
		ИмяКласса = "РегистрыСведений";
		ИмяТаблицы = "РегистрСведений." + ОбъектМетаданных.Имя;
	КонецЕсли;	
	
	// Если требуется только выборка изменений, то выбирать необходимо по таблицам изменений
	Если Изменения Тогда
		ИмяТаблицы = ИмяТаблицы + ".Изменения";
	КонецЕсли;
	
	СтруктураОписания = Новый Структура();
	СтруктураОписания.Вставить("ИмяКласса", ИмяКласса);
	СтруктураОписания.Вставить("ИмяОбъекта", ОбъектМетаданных.Имя);
	СтруктураОписания.Вставить("ИмяТаблицы", ИмяТаблицы);
	
	Возврат СтруктураОписания;

КонецФункции

// Выполняет выборочную регистрацию изменений, с учетом правил обмена
//
// Параметры:
//  Объект - объект, изменения которого регистрируются
//  Отказ - отказ от записи объекта
//  ИмяПланаОбмена - имя используемого плана обмена
//
Процедура ВыборочнаяРегистрацияОбъекта(Объект, Отказ, ИмяПланаОбмена, УзелОбмена = Неопределено)
	
	// Если при записи объекта был произведен отказ, то дальнейшего анализа не требуется -
	// никаких изменений не будет
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	// Если объект не входит в состав плана обмена, то регистрировать нечего
	Если Не Метаданные.ПланыОбмена[ИмяПланаОбмена].Состав.Содержит(МетаданныеОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОписанияОбъекта = ПолучитьСтруктуруОписанияОбъекта(МетаданныеОбъекта, Ложь);
	
	ВыборкаУзлов = ПланыОбмена[ИмяПланаОбмена].Выбрать();

	Пока ВыборкаУзлов.Следующий() Цикл
		
		Если Не УзелОбмена = Неопределено И
			 Не ВыборкаУзлов.Ссылка = УзелОбмена Тогда
			Продолжить;
		КонецЕсли;

		Если Объект.ОбменДанными.Загрузка Тогда
			Если Объект.ОбменДанными.Отправитель = ВыборкаУзлов.Ссылка Тогда
				// Для узла, по которому пришли изменения, их регистрировать не нужно
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ВыборкаУзлов.Ссылка <> ПланыОбмена[ИмяПланаОбмена].ЭтотУзел() Тогда
			
			НеРегистрироватьИзменения = Ложь;
			Если Объект.ДополнительныеСвойства.Свойство("НеРегистрироватьИзменения", НеРегистрироватьИзменения) Тогда
				Если НеРегистрироватьИзменения Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ОбъектПодлежитРегистрацииВУзле(Объект, СтруктураОписанияОбъекта, ВыборкаУзлов.Ссылка) Тогда
				Если УзелОбмена = Неопределено Тогда
					Объект.ОбменДанными.Получатели.Добавить(ВыборкаУзлов.Ссылка);
				Иначе
					ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Объект);
				КонецЕсли;
			Иначе
				Если УзелОбмена = Неопределено Тогда
					ВозможноУдалениеРегистрацииИзменений = Ложь;
					Если Объект.ДополнительныеСвойства.Свойство("ВозможноУдалениеРегистрацииИзменений", ВозможноУдалениеРегистрацииИзменений) Тогда
						Если ВозможноУдалениеРегистрацииИзменений Тогда
							ПланыОбмена.УдалитьРегистрациюИзменений(ВыборкаУзлов.Ссылка, Объект);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Проверяет, подлежит ли объект регистрации в указанном узле обмена
//
// Параметры:
//  Объект - объект, изменения которого регистрируются
//  СтруктураОписанияОбъекта - Структура, содержащая описание объекта
//  УзелОбмена - узел плана обмена, для которого проверяется необходимость регистрации
//
Функция ОбъектПодлежитРегистрацииВУзле(Объект, СтруктураОписанияОбъекта, УзелОбмена, ТаблицаДанныхОбъекта = Неопределено)
	
	ИмяКласса = СтруктураОписанияОбъекта.ИмяКласса;
	ИмяОбъекта = СтруктураОписанияОбъекта.ИмяОбъекта;
	
	Если ИмяКласса = "Константы" Тогда
		// Для констант никаких условий отбора не задается, поэтому изменения регистрируем всегда
		Возврат Истина;
	Иначе
		
		МассивПолей = ПолучитьМассивПолейОтбораДляОбъекта(ИмяКласса, ИмяОбъекта);
		
		Если ИмяКласса = "Справочники" ИЛИ ИмяКласса = "Документы" Тогда
			
			Если МассивПолей.Найти("Ссылка") = Неопределено Тогда
				МассивПолей.Добавить("Ссылка");
			КонецЕсли;
			
			Если ТаблицаДанныхОбъекта = Неопределено Тогда
				ТаблицаДанныхОбъекта = Новый ТаблицаЗначений();
				Для Каждого Поле из МассивПолей Цикл
					ТаблицаДанныхОбъекта.Колонки.Добавить(Поле);
				КонецЦикла;
			КонецЕсли;
			
			СтруктураРеквизитовОбъекта = Новый Структура();
			
			СтрокаТаблицы = ТаблицаДанныхОбъекта.Добавить();
			Для Каждого Поле из МассивПолей Цикл
				СтрокаТаблицы[Поле] = Объект[Поле];
				СтруктураРеквизитовОбъекта.Вставить(Поле, Объект[Поле]);
			КонецЦикла;
		
			Возврат ОПТИМУС_ОбменДистрибуция_ВыборочнаяРегистрация.ТребуетсяРегистрацияИзмененийОбъекта(СтруктураРеквизитовОбъекта, СтруктураОписанияОбъекта, МассивПолей, ТаблицаДанныхОбъекта, УзелОбмена);
			
		ИначеЕсли ИмяКласса = "РегистрыСведений" Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции


// Процедура регистрирует изменения, для всех данных, входящих в состав плана обмена
// Параметры:
//  УзелОбмена - узел плана обмена, для которого регистрируются изменения
Процедура ЗарегистрироватьИзмененияДанных(УзелОбмена) Экспорт
	
	СоставПланаОбмена = УзелОбмена.Метаданные().Состав;
	Для каждого ЭлементСоставаПланаОбмена Из СоставПланаОбмена Цикл
		Если ЭлементСоставаПланаОбмена.АвтоРегистрация = АвтоРегистрацияИзменений.Разрешить Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ЭлементСоставаПланаОбмена.Метаданные);
		Иначе
			СтруктуруОписанияОбъекта = ПолучитьСтруктуруОписанияОбъекта(ЭлементСоставаПланаОбмена.Метаданные);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Мета.Ссылка
				|ИЗ
				|	Справочник.Номенклатура КАК Мета
				|ГДЕ
				|	Мета.ПометкаУдаления = ЛОЖЬ";
				
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Номенклатура", СтруктуруОписанияОбъекта.ИмяТаблицы);

			Результат = Запрос.Выполнить();

			ВыборкаДетальныеЗаписи = Результат.Выбрать();

			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ВыборочнаяРегистрацияОбъекта(ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект(), Ложь, "ОПТИМУС_Дистрибуция", УзелОбмена);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗарегистрироватьИзмененияДанных()

Процедура НачальнаяРегистрацияИзменений(УзлыОбмена) Экспорт
	
	Для Каждого УзелОбмена Из УзлыОбмена Цикл
		Если Не УзелОбмена = ПланыОбмена.ОПТИМУС_Дистрибуция.ЭтотУзел() Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена);
			ЗарегистрироватьИзмененияДанных(УзелОбмена);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьСКДНаСервере(УзелОбмена,ПольныйОбмен)
	Если ПольныйОбмен Тогда 
		СхемаКомпоновкиДанных = Отчеты.ОПТИМУС_АнализОбменаДистрибуция.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		КомпоновщикНастроек =  СхемаКомпоновкиДанных.ВариантыНастроек.Основной;
		Настройки = КомпоновщикНастроек.Настройки;
		
	Иначе 
		ОтчетыСКД = Отчеты.ОПТИМУС_АнализОбменаДистрибуцияИзменения.Создать();
		СхемаКомпоновкиДанных = ОтчетыСКД.СхемаКомпоновкиДанных;
		КомпоновщикНастроек =  ОтчетыСКД.КомпоновщикНастроек;
		Настройки = ОтчетыСКД.КомпоновщикНастроек.Настройки;
	КонецЕсли;
	
	Если ПольныйОбмен Тогда 
		УстановитьПараметрыСКД(УзелОбмена,Настройки);
	Иначе 
		УстановитьПараметрыСКД_Изменения(УзелОбмена,Настройки)
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Построение таблицы значений.
	Процессор = Новый ПроцессорКомпоновкиДанных;
	Процессор.Инициализировать(МакетКомпоновкиДанных);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	ИсходныеДанные = Новый ДеревоЗначений;
	ПроцессорВывода.УстановитьОбъект(ИсходныеДанные);
	ПроцессорВывода.Вывести(Процессор);
	Возврат ИсходныеДанные;
	
КонецФункции

Процедура УстановитьПараметрыСКД(УзелОбмена,Настройки)
	врУзелОбмена = УзелОбмена;
	Если Не ЗначениеЗаполнено(врУзелОбмена) Тогда 
		Возврат;
	КонецЕсли; 	
	
	СтруктураОтбораСхемыОбмена = врУзелОбмена.ХранилищеОтбораСхемыОбмена.Получить();
	НастройкиСКД = Настройки;
	ЭлементыОтбораСКД = НастройкиСКД.Отбор.Элементы;
	ЭлементыОтбораСКД.Очистить();
	
	Для Каждого стр Из СтруктураОтбораСхемыОбмена Цикл 
		новыйЭлСКД = ЭлементыОтбораСКД.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(новыйЭлСКД,стр.значение);
		//Если стр.Ключ =  "Склад" Тогда 
		//	новыйЭлСКД.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтруктурнаяЕдиница"); 
		//КонецЕсли;
	КонецЦикла;
	
	Если Константы.ИспользоватьНесколькоОрганизаций.Получить() Тогда 
		новыйЭлСКД = ЭлементыОтбораСКД.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		новыйЭлСКД.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Организация");
		новыйЭлСКД.Использование  = Истина;
		новыйЭлСКД.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		новыйЭлСКД.ПравоеЗначение = врУзелОбмена.Организация;
	КонецЕсли;
	
	новыйЭлСКД = ЭлементыОтбораСКД.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	новыйЭлСКД.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СкладВозврата");
	новыйЭлСКД.Использование  = Истина;
	новыйЭлСКД.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	новыйЭлСКД.ПравоеЗначение = врУзелОбмена.СтруктурнаяЕдиницаДляВозврата;

	ВыгружатьТолькоОстатки=Новый ПараметрКомпоновкиДанных("ВыгружатьТолькоОстатки");
	ВыгружатьТолькоОстатки=НастройкиСКД.ПараметрыДанных.НайтиЗначениеПараметра(ВыгружатьТолькоОстатки);

	Если ВыгружатьТолькоОстатки<>Неопределено Тогда
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ВыгружатьТолькоОстатки",УзелОбмена.ВыгружатьТолькоОстатки);		
	КонецЕсли; 
	//Если УзелОбмена.ВыгружатьТолькоОстатки Тогда
		//новыйЭлСКД = ЭлементыОтбораСКД.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//новыйЭлСКД.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("КоличествоОстаток");
		//новыйЭлСКД.Использование  = Истина;
		//новыйЭлСКД.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
		//новыйЭлСКД.ПравоеЗначение = 0;
	//КонецЕсли; 
КонецПроцедуры


Процедура УстановитьПараметрыСКД_Изменения(УзелОбмена,Настройки)
	врУзелОбмена = УзелОбмена;
	Если Не ЗначениеЗаполнено(врУзелОбмена) Тогда 
		Возврат;
	КонецЕсли; 	
	
	СтруктураОтбораСхемыОбмена = врУзелОбмена.ХранилищеОтбораСхемыОбмена.Получить();
	НастройкиСКД = Настройки;
	
	ПараметрСКД = Настройки.ПараметрыДанных.Элементы.Найти("Узел");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение = врУзелОбмена;

	Для Каждого стр Из СтруктураОтбораСхемыОбмена Цикл 
		ПараметрСКД = Настройки.ПараметрыДанных.Элементы.Найти(стр.Ключ);
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение = стр.Значение.ПравоеЗначение;
	КонецЦикла;
	
	ПараметрСКД = Настройки.ПараметрыДанных.Элементы.Найти("Организация");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение	  = врУзелОбмена.Организация;
	
	ПараметрСКД = Настройки.ПараметрыДанных.Элементы.Найти("НесколькоОрганизация");
	ПараметрСКД.Использование = Истина;
	//Паганини_
	ПараметрСКД.Значение	  = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьНесколькоОрганизаций");
								//Константы.ФункциональнаяОпцияУчетПоНесколькимОрганизациям.Получить();
	//_Паганини
	
	
	ПараметрСКД = Настройки.ПараметрыДанных.Элементы.Найти("СкладВотврата");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение	  = врУзелОбмена.СтруктурнаяЕдиницаДляВозврата;

КонецПроцедуры

Процедура ЗаписатьДанныеСКД(ВозвращаемыйСписок, Данные,стрДанные) Экспорт
	
	ОбъектXDTO = ПолучитьОбъектXDTO_СКД(Данные,стрДанные);
	Если ОбъектXDTO <> Неопределено Тогда
		ВозвращаемыйСписок.objects.Добавить(ОбъектXDTO);
	КонецЕсли;
	
КонецПроцедуры // ЗаписатьДанные()

Функция ПолучитьОбъектXDTO_СКД(Данные,СтрокаДанные=Неопределено)
	
	ПередаваемыйОбъект = Неопределено;
	
	Если ТипЗнч(Данные) = Тип("СправочникОбъект.Номенклатура")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		ПередаваемыйОбъект = СоздатьОбъект("CatItems");
		ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
		ПередаваемыйОбъект.Name = Данные.Наименование;
		ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;

		Если ЗначениеЗаполнено(Данные.Родитель) Тогда
			ПередаваемыйОбъект.Group =ПолучитьОбъектXDTO_СКД(Данные.Родитель);
		КонецЕсли;
		Если Данные.ЭтоГруппа Тогда
			ПередаваемыйОбъект.ThisIsGroup = Истина;
			Возврат ПередаваемыйОбъект;
		Иначе
			ПередаваемыйОбъект.ThisIsGroup = Ложь;
			ПередаваемыйОбъект.Disabled = Данные.Неактивен;
		КонецЕсли;
		ПередаваемыйОбъект.Article = Данные.Артикул;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ВидыЦен")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.ВидыЦен") Тогда
		
		ПередаваемыйОбъект = СоздатьОбъект("CatPriceTypes");
		ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
		ПередаваемыйОбъект.Name = Данные.Наименование;
		ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;
		Если ЗначениеЗаполнено(Данные.Родитель) Тогда
			ПередаваемыйОбъект.Group =ПолучитьОбъектXDTO_СКД(Данные.Родитель);
		КонецЕсли;
		Если Данные.ЭтоГруппа Тогда
			ПередаваемыйОбъект.ThisIsGroup = Истина;
			Возврат ПередаваемыйОбъект;
		Иначе
			ПередаваемыйОбъект.ThisIsGroup = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ВидыСкидокНаценок")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.ВидыСкидокНаценок") Тогда
		
		ПередаваемыйОбъект = СоздатьОбъект("CatDiscounts");
		ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
		ПередаваемыйОбъект.Name = Данные.Наименование;
		ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;
		
		Если ЗначениеЗаполнено(Данные.Родитель) Тогда
			ПередаваемыйОбъект.Group =ПолучитьОбъектXDTO_СКД(Данные.Родитель);
		КонецЕсли;
		Если Данные.ЭтоГруппа Тогда
			ПередаваемыйОбъект.ThisIsGroup = Истина;
			Возврат ПередаваемыйОбъект;
		Иначе
			ПередаваемыйОбъект.Percent	   = Данные.Процент;
			ПередаваемыйОбъект.ThisIsGroup = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Контрагенты")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ПередаваемыйОбъект = СоздатьОбъект("CatContactors");
		ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
		ПередаваемыйОбъект.Name = Данные.Наименование;
		ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;
		Если ЗначениеЗаполнено(Данные.Родитель) Тогда
			ПередаваемыйОбъект.Group =ПолучитьОбъектXDTO_СКД(Данные.Родитель);
		КонецЕсли;
		Если Данные.ЭтоГруппа Тогда
			ПередаваемыйОбъект.ThisIsGroup = Истина;
			Возврат ПередаваемыйОбъект;
		Иначе
			ПередаваемыйОбъект.ThisIsGroup = Ложь;
		КонецЕсли;
		
		ПередаваемыйОбъект.INN = Строка(Данные.Ссылка.ИНН);
		
		ПередаваемыйОбъект.Tel = "";
		Для Каждого ТекСтрока Из Данные.КонтактнаяИнформация Цикл
			Если ТекСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				ПередаваемыйОбъект.Tel = ТекСтрока.Представление;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ДоговорыКонтрагентов")
		ИЛИ ТипЗнч(Данные) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		ПередаваемыйОбъект = СоздатьОбъект("CatContracts");
		ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
		ПередаваемыйОбъект.Name = Данные.Наименование;
		ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;
		ПередаваемыйОбъект.Blocked = Данные.Заблокировано;
		ПередаваемыйОбъект.Disabled = Данные.Неактивен;
		ПередаваемыйОбъект.Limit = Данные.Лимит;
		
		Если ЗначениеЗаполнено(Данные.Владелец) Тогда
			ПередаваемыйОбъект.Owner =ПолучитьОбъектXDTO_СКД(Данные.Владелец);
		Конецесли;
		Если ЗначениеЗаполнено(Данные.ВидЦен) Тогда
			ПередаваемыйОбъект.PriceType =ПолучитьОбъектXDTO_СКД(Данные.ВидЦен);
		Конецесли;
		
		Если ЗначениеЗаполнено(Данные.ВидСкидкиНаценки) Тогда
			ПередаваемыйОбъект.DiscountType =ПолучитьОбъектXDTO_СКД(Данные.ВидСкидкиНаценки);
		Конецесли;
		
		Строка = "";		
		Для Каждого СтрокаТаблицы Из Данные.ГрафикПосещения Цикл
			Если СтрокаТаблицы.ДеньНедели = Перечисления.ДниНедели.Понедельник Тогда
				Строка = Строка + "1";
			ИначеЕсли СтрокаТаблицы.ДеньНедели = Перечисления.ДниНедели.Вторник Тогда
				Строка = Строка + "2";
			ИначеЕсли СтрокаТаблицы.ДеньНедели = Перечисления.ДниНедели.Среда Тогда
				Строка = Строка + "3";
			ИначеЕсли СтрокаТаблицы.ДеньНедели = Перечисления.ДниНедели.Четверг Тогда
				Строка = Строка + "4";
			ИначеЕсли СтрокаТаблицы.ДеньНедели = Перечисления.ДниНедели.Пятница Тогда
				Строка = Строка + "5";
			ИначеЕсли СтрокаТаблицы.ДеньНедели = Перечисления.ДниНедели.Суббота Тогда
				Строка = Строка + "6";
			ИначеЕсли СтрокаТаблицы.ДеньНедели = Перечисления.ДниНедели.Воскресенье Тогда
				Строка = Строка + "7";
			КонецЕсли
		КонецЦикла;
		ПередаваемыйОбъект.Schedule = Строка;
		
		ПередаваемыйОбъект.Address = Данные.Адрес;
		ПередаваемыйОбъект.Tel = "";
		
		//ВидыЦен  CatPriceTypes
		Если ЗначениеЗаполнено(Данные.ВидЦен) Тогда
			ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("CatPriceTypes").Тип;
			ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
			ДобавляемаяСтрока.CatPriceType = ПолучитьОбъектXDTO(Данные.ВидЦен);
			ПередаваемыйОбъект.CatPriceTypes.Добавить(ДобавляемаяСтрока);
		Конецесли;
		
		Для Каждого  СтрокаТаблицы Из Данные.ВидыЦен Цикл
			ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("CatPriceTypes").Тип;
			ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
			Если ЗначениеЗаполнено(СтрокаТаблицы.ВидЦен) Тогда
				ДобавляемаяСтрока.CatPriceType = ПолучитьОбъектXDTO(СтрокаТаблицы.ВидЦен);
			Конецесли;
			ПередаваемыйОбъект.CatPriceTypes.Добавить(ДобавляемаяСтрока);
		КонецЦикла;
		//ВидыЦен CatPriceTypes
		
		//ВидыСкидокНаценок CatDiscounts 
		Если ЗначениеЗаполнено(Данные.ВидСкидкиНаценки) Тогда
			ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("CatDiscounts").Тип;
			ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
			ДобавляемаяСтрока.CatDiscount = ПолучитьОбъектXDTO_СКД(Данные.ВидСкидкиНаценки);
			ПередаваемыйОбъект.CatDiscounts.Добавить(ДобавляемаяСтрока);
		Конецесли;
		Для Каждого  СтрокаТаблицы Из Данные.ВидыСкидокНаценок Цикл
			ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("CatDiscounts").Тип;
			ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
			Если ЗначениеЗаполнено(СтрокаТаблицы.ВидСкидкиНаценки) Тогда
				ДобавляемаяСтрока.CatDiscount = ПолучитьОбъектXDTO_СКД(СтрокаТаблицы.ВидСкидкиНаценки);
			Конецесли;
			ПередаваемыйОбъект.CatDiscounts.Добавить(ДобавляемаяСтрока);
		КонецЦикла;
		//ВидыСкидокНаценок CatDiscounts
		
		
		//Для Каждого ТекСтрока Из Данные.КонтактнаяИнформация Цикл
		//	Если ТекСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		//		ПередаваемыйОбъект.Address = ТекСтрока.Представление;
		//	КонецЕсли;
		//	Если ТекСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		//		ПередаваемыйОбъект.Tel = ТекСтрока.Представление;
		//	КонецЕсли;
		//КонецЦикла;

		
	ИначеЕсли Данные = "Взаиморасчети" Тогда
		
		ПередаваемыйОбъект = СоздатьОбъект("Payable");
		
		ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("Item").Тип;
		ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
		Если ЗначениеЗаполнено(СтрокаДанные.Контрагент) Тогда
			ДобавляемаяСтрока.Contactor = ПолучитьОбъектXDTO(СтрокаДанные.Контрагент.ПолучитьОбъект());
		Конецесли;
		Если ЗначениеЗаполнено(СтрокаДанные.Договор) Тогда
			ДобавляемаяСтрока.Contract = ПолучитьОбъектXDTO(СтрокаДанные.Договор.ПолучитьОбъект());
		Конецесли;
		ДобавляемаяСтрока.Total = СтрокаДанные.Сумма;
		ДобавляемаяСтрока.Document = Формат(СтрокаДанные.Дата, "ДФ=yyyy-MM-dd") + "   " + Строка(СтрокаДанные.Номер);
		ПередаваемыйОбъект.Item.Добавить(ДобавляемаяСтрока);
		
		
	ИначеЕсли Данные = "Остатки" Тогда
		
		ПередаваемыйОбъект = СоздатьОбъект("ReturnRemains");
		
		ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("Item").Тип;
		ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
		Если ЗначениеЗаполнено(СтрокаДанные.Номенклатура) Тогда
			ДобавляемаяСтрока.Nomenclature = ПолучитьОбъектXDTO(СтрокаДанные.Номенклатура.ПолучитьОбъект());
		Конецесли;
		ДобавляемаяСтрока.Quantity = СтрокаДанные.КоличествоОстаток;
		ПередаваемыйОбъект.Item.Добавить(ДобавляемаяСтрока);
		
	ИначеЕсли Данные = "Остатки" Тогда
		
		ПередаваемыйОбъект = СоздатьОбъект("Remains");
		
		ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("Item").Тип;
		ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
		Если ЗначениеЗаполнено(СтрокаДанные.Номенклатура) Тогда
			ДобавляемаяСтрока.Nomenclature = ПолучитьОбъектXDTO(СтрокаДанные.Номенклатура.ПолучитьОбъект());
		Конецесли;
		ДобавляемаяСтрока.Quantity = СтрокаДанные.КоличествоОстаток;
		ПередаваемыйОбъект.Item.Добавить(ДобавляемаяСтрока);
		
	ИначеЕсли Данные = "Цены" Тогда

		ПередаваемыйОбъект = СоздатьОбъект("Prices");
		
		ПередаваемыйОбъект.Nomenclature = ПолучитьОбъектXDTO_СКД(СтрокаДанные.Номенклатура);
		ПередаваемыйОбъект.PriceType    = ПолучитьОбъектXDTO_СКД(СтрокаДанные.ВидЦен);
		ПередаваемыйОбъект.Date  		= СтрокаДанные.Период;
		ПередаваемыйОбъект.Price		= СтрокаДанные.Цена;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("УдалениеОбъекта") Тогда
		
		ПередаваемыйОбъект = СоздатьОбъект("ObjectDeletion");
		ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
		
	Если ТипЗнч(Данные.Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
			ПередаваемыйОбъект.Type = "CatItems";
		ИначеЕсли ТипЗнч(Данные.Ссылка) = Тип("СправочникСсылка.ВидыЦен") Тогда
			ПередаваемыйОбъект.Type = "CatPriceTypes";
		ИначеЕсли ТипЗнч(Данные.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
			ПередаваемыйОбъект.Type = "CatContactors";
		ИначеЕсли ТипЗнч(Данные.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			ПередаваемыйОбъект.Type = "CatContracts";
		КонецЕсли;
		
	КонецЕсли;		
	
	Возврат ПередаваемыйОбъект;
	
КонецФункции // ПолучитьОбъектXDTO()


Процедура ЗаписатьДанныеСКД_ОстаткиВзаиморасчети(МассивОстатки, МассивОстаткиВозвратов, МассивВзаиморасчети,ВозвращаемыйСписок) Экспорт 
	
	//--Остатки	
	Если МассивОстатки.Количество() Тогда 
		ПередаваемыйОбъект = СоздатьОбъект("Remains");
		
		Для Каждого  Выборка Из МассивОстатки Цикл
			ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("Item").Тип;
			ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
			Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
				ДобавляемаяСтрока.Nomenclature = ПолучитьОбъектXDTO(Выборка.Номенклатура.ПолучитьОбъект());
			Конецесли;
			ДобавляемаяСтрока.Quantity = Выборка.КоличествоОстаток;
			ПередаваемыйОбъект.Item.Добавить(ДобавляемаяСтрока);
		КонецЦикла;
		
		ВозвращаемыйСписок.objects.Добавить(ПередаваемыйОбъект);
	КонецЕсли;	
	
	Если МассивОстаткиВозвратов.Количество() Тогда 
		ПередаваемыйОбъект = СоздатьОбъект("ReturnRemains");
		
		Для Каждого  Выборка Из МассивОстаткиВозвратов Цикл
			ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("Item").Тип;
			ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
			Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
				ДобавляемаяСтрока.Nomenclature = ПолучитьОбъектXDTO(Выборка.Номенклатура.ПолучитьОбъект());
			Конецесли;
			ДобавляемаяСтрока.Quantity = Выборка.КоличествоОстаток;
			ПередаваемыйОбъект.Item.Добавить(ДобавляемаяСтрока);
		КонецЦикла;
		
		ВозвращаемыйСписок.objects.Добавить(ПередаваемыйОбъект);
	КонецЕсли;	
	
	
	//--Взаиморасчети
	Если МассивВзаиморасчети.Количество() Тогда 
		ПередаваемыйОбъект = СоздатьОбъект("Payable");
		
		Для Каждого  Выборка Из МассивВзаиморасчети Цикл
			ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("Item").Тип;
			ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
			Если ЗначениеЗаполнено(Выборка.Контрагент) Тогда
				ДобавляемаяСтрока.Contactor = ПолучитьОбъектXDTO_СКД(Выборка.Контрагент.ПолучитьОбъект());
			Конецесли;
			Если ЗначениеЗаполнено(Выборка.Договор) Тогда
				ДобавляемаяСтрока.Contract = ПолучитьОбъектXDTO_СКД(Выборка.Договор.ПолучитьОбъект());
			Конецесли;
			ДобавляемаяСтрока.Total = Выборка.Сумма;
			ДобавляемаяСтрока.Document = Формат(Выборка.Дата, "ДФ=yyyy-MM-dd") + "   " + Строка(Выборка.Номер);
			ПередаваемыйОбъект.Item.Добавить(ДобавляемаяСтрока);
		КонецЦикла;
		
		ВозвращаемыйСписок.objects.Добавить(ПередаваемыйОбъект);
	КонецЕсли;	
	

КонецПроцедуры


Функция ОперацияФормироватьОтчетаДляКПК(УзелОбмена, ДанныеОбмена) Экспорт
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://www.optimus.ge/SB/DistributionExchange", "Objects");
	
	Объекты = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	
	ЗагрузитьОбъекты(УзелОбмена, Объекты);
	ЧтениеXML.Закрыть();
	
	Идентификатор = Новый УникальныйИдентификатор(Объекты.objects[0].id);
	Договор = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Идентификатор);
	
	Возврат ФормироватьОтчетаДляКПК(Договор);
	
КонецФункции

Функция ФормироватьОтчетаДляКПК(Договор) Экспорт
	
	ЗначениеДляВозврата = СоздатьОбъект("DataWithAnswer");
	
	// Отчет Задолженности
	СхемаКомпоновкиДанных = Отчеты.ОПТИМУС_ЗадолженностиПоИнтервалам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек =  СхемаКомпоновкиДанных.ВариантыНастроек.ВариантДляОбмена;
	Настройки = КомпоновщикНастроек.Настройки;
	
	УстановитьПараметрыСКДДолг(Настройки,Договор);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Построение таблицы значений.
	Процессор = Новый ПроцессорКомпоновкиДанных;
	Процессор.Инициализировать(МакетКомпоновкиДанных);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	ИсходныеДанные = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ИсходныеДанные);
	ПроцессорВывода.Вывести(Процессор);
	
	ЗначениеДляВозврата.Data = Новый ХранилищеЗначения(ИсходныеДанные, Новый СжатиеДанных(9));
	Возврат ЗначениеДляВозврата;
	
КонецФункции

Процедура УстановитьПараметрыСКДДолг(Настройки,Договор)
	
	ПараметрыДанных = Настройки.ПараметрыДанных.Элементы;
	
	Пар =ПараметрыДанных.Найти("Период");
	Если НЕ   Пар =  Неопределено  Тогда
		Пар.Использование  = Истина;
		Пар.Значение  =  КонецДня(ТекущаяДата()); 
	КонецЕсли;

	Пар =ПараметрыДанных.Найти("СсылкаНаИнтервал");
	Если НЕ   Пар =  Неопределено  Тогда
		Пар.Использование  = Истина;
		Пар.Значение  =  Справочники.ОПТИМУС_ИнтервалиДляОтчетов.НайтиПоКоду("000000001"); 
	КонецЕсли;

	Пар =ПараметрыДанных.Найти("СНаступающимиЗадолженностьями");
	Если НЕ   Пар =  Неопределено  Тогда
		Пар.Использование  = Истина;
		Пар.Значение  =  Истина; 
	КонецЕсли;

	Отбор = Настройки.Отбор.Элементы;
	
	Для каждого Элемент из Отбор Цикл
		Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Договор") Тогда
			Элемент.ПравоеЗначение = Договор;
			Элемент.Использование  = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОстатокКасси(Касса)
	ОстатокКасси = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДенежныеСредстваОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(, БанковскийСчетКасса = &Касса) КАК ДенежныеСредстваОстатки";
	Запрос.УстановитьПараметр("Касса", Касса);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ОстатокКасси = Выборка.СуммаОстаток;
	КонецЕсли;
	
	Возврат ОстатокКасси;
	
КонецФункции