
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СчетЗатрат") Тогда
		
		Если ЗначениеЗаполнено(Параметры.СчетЗатрат) Тогда
			
			Если Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Расходы
			   И Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.СебестоимостьПродаж
			   И Параметры.СчетЗатрат.ТипСчета <> Перечисления.ТипыСчетов.Доходы Тогда
				
				ТекстСообщения = НСтр("ka='ანგარიშის მოცემული ტიპისთვის საქმიანობის მიმართულება არ მიეთითება!';ru='Для данного типа счета направление деятельности не указывается!';en='For this type of account activity is not specified!'");
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(, ТекстСообщения, , , , Отказ);
				
			КонецЕсли;
			
		Иначе
			
			ТекстСообщения = НСтр("ka='არ არის არჩეული ანაგარიში!';ru='Не выбран счет!';en='Not selected by!'");
			//УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(, ТекстСообщения, , , , Отказ);
			//--giga 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
