
//&Вместо("СформироватьТаблицаРасчетыСПоставщиками_Deprecated")
//Процедура РасшAzRy_СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаДополнительныеРасходы, СтруктураДополнительныеСвойства)
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
//	
//	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаДополнительныеРасходы);
//	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
//	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
//	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
//	Запрос.УстановитьПараметр("ВозникновениеОбязательствПередПоставщиком", НСтр("ka='მომწოდებლის წინაშე ვალდებულებების წარმოშობა';ru='Возникновение обязательств перед поставщиком';en='The emergence of obligations to the supplier'"));
//	Запрос.УстановитьПараметр("ЗачетАванса", НСтр("ka='წინასწარ გადახდილი თანხის ჩათვლა';ru='Зачет предоплаты';en='Зачет предоплаты'"));
//	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
//	Запрос.УстановитьПараметр("СуммаВключаетНДС", ДокументСсылкаДополнительныеРасходы.СуммаВключаетНДС);
//	
//	//ПодольскийАИ #УчетПроектов 15.02.2021 {
//	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
//	//ПодольскийАИ #УчетПроектов 15.02.2021 }
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	1 КАК Порядок, 
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
//	|	ТаблицаДокумента.Период КАК Дата,
//	|	ТаблицаДокумента.Организация КАК Организация,
//	|	ТаблицаДокумента.Контрагент КАК Контрагент,
//	|	ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком КАК СчетУчета,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРегл,
//	|	ТаблицаДокумента.Договор КАК Договор,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//	|			ТОГДА &Ссылка
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК Документ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ЗаказПоставщику ССЫЛКА Документ.ЗаказПоставщику
//	|				И ТаблицаДокумента.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|				И ТаблицаДокумента.ВестиРасчетыПоЗаказам
//	|			ТОГДА ТаблицаДокумента.ЗаказПоставщику
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|	КОНЕЦ КАК Заказ,
//	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
//	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,
//	//ПодольскийАИ #УчетПроектов 15.02.2021 {
//	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) КАК Проект,
//	//ПодольскийАИ #УчетПроектов 15.02.2021 }
//	//Паганини ПФ_
//	//|	СУММА(ТаблицаДокумента.СуммаРасходов - ТаблицаДокумента.СуммаРасходовНДФЛ) КАК Сумма,
//	//|	СУММА(ТаблицаДокумента.СуммаРасходовВал - ТаблицаДокумента.СуммаРасходовНДФЛВал) КАК СуммаВал,
//	//|	СУММА(ТаблицаДокумента.СуммаРасходов - ТаблицаДокумента.СуммаРасходовНДФЛ) КАК СуммаДляОстатка,
//	//|	СУММА(ТаблицаДокумента.СуммаРасходовВал - ТаблицаДокумента.СуммаРасходовНДФЛВал) КАК СуммаВалДляОстатка,
//	//|	СУММА(ТаблицаДокумента.СуммаРасходов - ТаблицаДокумента.СуммаРасходовНДФЛ - ТаблицаДокумента.СуммаРасходовПФ) КАК Сумма,
//	|	СУММА(ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВалютаРасчетов <> НацВалюта.Значение И &СуммаВключаетНДС
//	//|			ТОГДА ТаблицаДокумента.СуммаРасходов + ТаблицаДокумента.СуммаРасходовНДС - ТаблицаДокумента.СуммаРасходовНДФЛ - ТаблицаДокумента.СуммаРасходовПФ
//	//|			ТОГДА ТаблицаДокумента.СуммаРасходов - ТаблицаДокумента.СуммаРасходовНДФЛ - ТаблицаДокумента.СуммаРасходовПФ
//	// Олег Литвиненко 22.06.23 --->
//	// Задача от Mariam Brolashvili
//	|			ТОГДА ТаблицаДокумента.СуммаИмпорт - ТаблицаДокумента.СуммаРасходовНДФЛ - ТаблицаДокумента.СуммаРасходовПФ	
//	// Олег Литвиненко <---
//	//|		ИНАЧЕ ТаблицаДокумента.СуммаРасходов - ТаблицаДокумента.СуммаРасходовНДФЛ - ТаблицаДокумента.СуммаРасходовПФ
//	|		КОГДА ТаблицаДокумента.ВалютаРасчетов <> НацВалюта.Значение И НЕ &СуммаВключаетНДС
//	//|			ТОГДА ТаблицаДокумента.СуммаРасходов - ТаблицаДокумента.СуммаРасходовНДФЛ - ТаблицаДокумента.СуммаРасходовПФ
//	// Олег Литвиненко 22.06.23 --->
//	// Задача от Mariam Brolashvili
//	|			ТОГДА ТаблицаДокумента.СуммаИмпорт - ТаблицаДокумента.СуммаРасходовНДФЛ - ТаблицаДокумента.СуммаРасходовПФ	
//	// Олег Литвиненко <---
//	//--------------------------------------------------------------------------
//	// © Шишка В.В. [17 мая 2022 г.]  НАЧАЛО
//	//|		ИНАЧЕ ТаблицаДокумента.СуммаРасходов - ТаблицаДокумента.СуммаРасходовНДФЛ - ТаблицаДокумента.СуммаРасходовПФ
//	|		ИНАЧЕ ТаблицаДокумента.СуммаРасходовУпр - ТаблицаДокумента.СуммаРасходовНДФЛ - ТаблицаДокумента.СуммаРасходовПФ
//	// © Шишка В.В. [17 мая 2022 г.]  КОНЕЦ
//	//--------------------------------------------------------------------------
//	|	КОНЕЦ) КАК Сумма,
//	|	СУММА(ТаблицаДокумента.СуммаРасходовВал - ТаблицаДокумента.СуммаРасходовНДФЛВал - ТаблицаДокумента.СуммаРасходовПФВал) КАК СуммаВал,
//	//|	СУММА(ТаблицаДокумента.СуммаРасходов - ТаблицаДокумента.СуммаРасходовНДФЛ - ТаблицаДокумента.СуммаРасходовПФ) КАК СуммаДляОстатка,
//	|	СУММА(ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВалютаРасчетов <> НацВалюта.Значение И &СуммаВключаетНДС
//	|			ТОГДА ТаблицаДокумента.СуммаРасходов + ТаблицаДокумента.СуммаРасходовНДС - ТаблицаДокумента.СуммаРасходовНДФЛ - ТаблицаДокумента.СуммаРасходовПФ
//	|		КОГДА ТаблицаДокумента.ВалютаРасчетов <> НацВалюта.Значение И НЕ &СуммаВключаетНДС
//	|			ТОГДА ТаблицаДокумента.СуммаРасходов - ТаблицаДокумента.СуммаРасходовНДФЛ - ТаблицаДокумента.СуммаРасходовПФ
//	|		ИНАЧЕ ТаблицаДокумента.СуммаРасходов - ТаблицаДокумента.СуммаРасходовНДФЛ - ТаблицаДокумента.СуммаРасходовПФ
//	|	КОНЕЦ) КАК СуммаДляОстатка,
//	|	СУММА(ТаблицаДокумента.СуммаРасходовВал - ТаблицаДокумента.СуммаРасходовНДФЛВал - ТаблицаДокумента.СуммаРасходовПФВал) КАК СуммаВалДляОстатка,
//	//_Паганини ПФ	
//	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПередПоставщиком КАК СТРОКА(100)) КАК СодержаниеПроводки
//	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщиками
//	|ИЗ
//	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента,
//	|	Константа.НациональнаяВалюта КАК НацВалюта
//	|
//	|ГДЕ 
//	|	ТаблицаДокумента.СуммаРасходов <> 0
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаДокумента.Период,
//	|	ТаблицаДокумента.Организация,
//	|	ТаблицаДокумента.Контрагент,
//	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.Договор,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ЗаказПоставщику ССЫЛКА Документ.ЗаказПоставщику
//	|				И ТаблицаДокумента.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|				И ТаблицаДокумента.ВестиРасчетыПоЗаказам
//	|			ТОГДА ТаблицаДокумента.ЗаказПоставщику
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|	КОНЕЦ,
//	|	ТаблицаДокумента.ВалютаРасчетов,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//	|			ТОГДА &Ссылка
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ,
//	//ПодольскийАИ #УчетПроектов 15.02.2021 {
//	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
//	//ПодольскийАИ #УчетПроектов 15.02.2021 }
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	2,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
//	|	Расходы.Период,
//	|	Расходы.Организация,
//	|	Расходы.Контрагент,
//	|	Расходы.ВестиРасчетыПоДокументам,
//	|	Расходы.СчетУчетаРасчетовСПоставщиком,
//	|	Расходы.СчетУчетаРасчетовСПоставщикомРегл,
//	|	Расходы.Договор,
//	|	ВЫБОР
//	|		КОГДА Расходы.ВестиРасчетыПоДокументам
//	|			ТОГДА &Ссылка
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА Расходы.ЗаказПоставщику ССЫЛКА Документ.ЗаказПоставщику
//	|				И Расходы.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|				И Расходы.ВестиРасчетыПоЗаказам
//	|			ТОГДА Расходы.ЗаказПоставщику
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|	КОНЕЦ,
//	|	Расходы.ВалютаРасчетов,
//	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
//	//ПодольскийАИ #УчетПроектов 15.02.2021 {
//	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
//	//ПодольскийАИ #УчетПроектов 15.02.2021 }
//	|	СУММА(Расходы.СуммаНДС),
//	|	СУММА(Расходы.СуммаНДСВал),
//	|	СУММА(Расходы.СуммаНДС),
//	|	СУММА(Расходы.СуммаНДСВал),
//	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПередПоставщиком КАК СТРОКА(100))
//	|ИЗ
//	|	ВременнаяТаблицаРасходы КАК Расходы
//	|ГДЕ
//	|	Расходы.СуммаНДС <> 0
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Расходы.Период,
//	|	Расходы.Организация,
//	|	Расходы.Контрагент,
//	|	Расходы.ВестиРасчетыПоДокументам,
//	|	Расходы.Договор,
//	|	ВЫБОР
//	|		КОГДА Расходы.ЗаказПоставщику ССЫЛКА Документ.ЗаказПоставщику
//	|				И Расходы.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|				И Расходы.ВестиРасчетыПоЗаказам
//	|			ТОГДА Расходы.ЗаказПоставщику
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|	КОНЕЦ,
//	|	Расходы.ВалютаРасчетов,
//	|	Расходы.СчетУчетаРасчетовСПоставщиком,
//	|	Расходы.СчетУчетаРасчетовСПоставщикомРегл,
//	|	ВЫБОР
//	|		КОГДА Расходы.ВестиРасчетыПоДокументам
//	|			ТОГДА &Ссылка
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ,
//	//ПодольскийАИ #УчетПроектов 15.02.2021 {
//	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
//	//ПодольскийАИ #УчетПроектов 15.02.2021 }
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	3,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
//	|	ТаблицаДокумента.Период,
//	|	ТаблицаДокумента.Организация,
//	|	ТаблицаДокумента.Контрагент,
//	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.СчетУчетаАвансовПоставщику,
//	|	ТаблицаДокумента.СчетУчетаАвансовПоставщикуРегл,
//	|	ТаблицаДокумента.Договор,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//	|			ТОГДА ТаблицаДокумента.Документ
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Заказ ССЫЛКА Документ.ЗаказПоставщику
//	|				И ТаблицаДокумента.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|				И ТаблицаДокумента.ВестиРасчетыПоЗаказам
//	|			ТОГДА ТаблицаДокумента.Заказ
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|	КОНЕЦ,
//	|	ТаблицаДокумента.ВалютаРасчетов,
//	|	ТаблицаДокумента.ТипРасчетов,
//	//ПодольскийАИ #УчетПроектов 15.02.2021 {
//	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
//	//ПодольскийАИ #УчетПроектов 15.02.2021 }
//	|	СУММА(ТаблицаДокумента.Сумма),
//	|	СУММА(ТаблицаДокумента.СуммаВал),
//	|	СУММА(ТаблицаДокумента.Сумма),
//	|	СУММА(ТаблицаДокумента.СуммаВал),
//	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
//	|ИЗ
//	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаДокумента.Период,
//	|	ТаблицаДокумента.Организация,
//	|	ТаблицаДокумента.Контрагент,
//	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.Договор,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//	|			ТОГДА ТаблицаДокумента.Документ
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Заказ ССЫЛКА Документ.ЗаказПоставщику
//	|				И ТаблицаДокумента.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|				И ТаблицаДокумента.ВестиРасчетыПоЗаказам
//	|			ТОГДА ТаблицаДокумента.Заказ
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|	КОНЕЦ,
//	|	ТаблицаДокумента.ТипРасчетов,
//	|	ТаблицаДокумента.ВалютаРасчетов,
//	|	ТаблицаДокумента.СчетУчетаАвансовПоставщику,
//	|	ТаблицаДокумента.СчетУчетаАвансовПоставщикуРегл,
//	//ПодольскийАИ #УчетПроектов 15.02.2021 {
//	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
//	//ПодольскийАИ #УчетПроектов 15.02.2021 }
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	4,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
//	|	ТаблицаДокумента.Период,
//	|	ТаблицаДокумента.Организация,
//	|	ТаблицаДокумента.Контрагент,
//	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл,
//	|	ТаблицаДокумента.Договор,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//	|			ТОГДА ТаблицаДокумента.ДокументКуда
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Заказ ССЫЛКА Документ.ЗаказПоставщику
//	|				И ТаблицаДокумента.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|				И ТаблицаДокумента.ВестиРасчетыПоЗаказам
//	|			ТОГДА ТаблицаДокумента.Заказ
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|	КОНЕЦ,
//	|	ТаблицаДокумента.ВалютаРасчетов,
//	|	ТаблицаДокумента.ТипРасчетовКуда,
//	//ПодольскийАИ #УчетПроектов 15.02.2021 {
//	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
//	//ПодольскийАИ #УчетПроектов 15.02.2021 }
//	|	СУММА(ТаблицаДокумента.Сумма),
//	|	СУММА(ТаблицаДокумента.СуммаВал),
//	|	-СУММА(ТаблицаДокумента.Сумма),
//	|	-СУММА(ТаблицаДокумента.СуммаВал),
//	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
//	|ИЗ
//	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаДокумента.Период,
//	|	ТаблицаДокумента.Организация,
//	|	ТаблицаДокумента.Контрагент,
//	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
//	|	ТаблицаДокумента.Договор,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//	|			ТОГДА ТаблицаДокумента.ДокументКуда
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.Заказ ССЫЛКА Документ.ЗаказПоставщику
//	|				И ТаблицаДокумента.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|				И ТаблицаДокумента.ВестиРасчетыПоЗаказам
//	|			ТОГДА ТаблицаДокумента.Заказ
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
//	|	КОНЕЦ,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком,
//	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл,
//	|	ТаблицаДокумента.ВалютаРасчетов,
//	|	ТаблицаДокумента.ТипРасчетовКуда,
//	//ПодольскийАИ #УчетПроектов 15.02.2021 {
//	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
//	//ПодольскийАИ #УчетПроектов 15.02.2021 }
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Организация,
//	|	Контрагент,
//	|	Договор,
//	|	Валюта,
//	|	Документ,
//	|	Заказ,
//	|	ТипРасчетов,
//	|	СчетУчета,
//	|	СчетУчетаРегл";
//	
//	// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment: 
//	AzRyУправлениеНебольшойФирмойСервер_Deprecated.ПриходнаяНакладная_ИнициализироватьДанныеДокумента_ДопТекстЗапроса("ДополнительныеРасходы", Запрос, ДокументСсылкаДополнительныеРасходы.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено);	
//	// +++ } AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment:
//	
//	Запрос.Выполнить();
//	
//	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ВременнаяТаблицаРасчетыСПоставщиками.Организация КАК Организация,
//	|	ВременнаяТаблицаРасчетыСПоставщиками.Контрагент КАК Контрагент,
//	|	ВременнаяТаблицаРасчетыСПоставщиками.Договор КАК Договор,
//	|	ВременнаяТаблицаРасчетыСПоставщиками.Документ КАК Документ,
//	|	ВременнаяТаблицаРасчетыСПоставщиками.Заказ КАК Заказ,
//	|	ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов КАК ТипРасчетов
//	|ИЗ
//	|	ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблицаРасчетыСПоставщиками";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Блокировка = Новый БлокировкаДанных;
//	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщиками");
//	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
//	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
//	
//	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
//		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
//	КонецЦикла;
//	Блокировка.Заблокировать();
//	
//							  
//																																																																											  
//																				  
// 
//							  
//																																																																											  
//																				  
// 
//	// +++ { AzRy - [28.12.2021] - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:
//	Если ДокументСсылкаДополнительныеРасходы.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
//		
//		// +++ { AzRy - [28.12.2021] - Jira:ERPM-223 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:კურსი დოკ. კურსზე დავსვით
//		Запрос.УстановитьПараметр("КурсыВалютРасчетовСрезПоследних_Курс", ДокументСсылкаДополнительныеРасходы.Курс);
//		Запрос.УстановитьПараметр("КурсыВалютРасчетовСрезПоследних_Кратность", ДокументСсылкаДополнительныеРасходы.Кратность);
//		// +++ } AzRy - [28.12.2021] - Jira:ERPM-223 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:კურსი დოკ. კურსზე დავსვით
//		
//		// +++ { AzRy - [28.12.2021] - Developer:გიორგი მამულაშვილი - Comment:
//		AzRyУправлениеНебольшойФирмойСервер_Deprecated.Сформировать_ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная(Запрос);
//		// +++ } AzRy - [28.12.2021] - Developer:გიორგი მამულაშვილი - Comment:
//		
//		НомерЗапроса = 0;
//		Запрос.Текст = AzRyУправлениеНебольшойФирмойСервер_Deprecated.AzRy_ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса, ДокументСсылкаДополнительныеРасходы);
//		МассивРезультатов = Запрос.ВыполнитьПакет();
//		
//		НомерЗапроса = 0;
//		Запрос.Текст = AzRyУправлениеНебольшойФирмойСервер_Deprecated.AzRy_ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиРегл(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса,, ДокументСсылкаДополнительныеРасходы);
//		МассивРезультатов = Запрос.ВыполнитьПакет();		
//	Иначе 	
//		НомерЗапроса = 0;
//		Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса);
//		МассивРезультатов = Запрос.ВыполнитьПакет();
//		
//		НомерЗапроса = 0;
//		Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиРегл(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса);
//		МассивРезультатов = Запрос.ВыполнитьПакет();	
//	КонецЕсли;
//	// +++ } AzRy - [28.12.2021] - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:
//	
//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", МассивРезультатов[НомерЗапроса].Выгрузить());
//	
//КонецПроцедуры

//&После("ИнициализироватьДанныеДокумент_Deprecated")
//Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаДополнительныеРасходы, СтруктураДополнительныеСвойства)
//	
//	// +++ { AzRy - [29.10.2021]
//	Если ДокументСсылкаДополнительныеРасходы.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
//		
//		// +++ { AzRy - [28.01.2022]
//		Запрос = Новый Запрос;
//		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
//		Запрос.Текст = 
//		
//		"ВЫБРАТЬ
//		|	*
//		|ИЗ
//		|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиРегл; ";
//		
//		ТЗ = Запрос.Выполнить().Выгрузить();
//		
//		Для каждого ТекСтрока Из ТЗ Цикл
//			СуммаДляСравнения = ?(ТекСтрока.СуммаКурсовойРазницы < 0, ТекСтрока.СуммаКурсовойРазницы * ( -1), ТекСтрока.СуммаКурсовойРазницы);
//			
//			Для каждого ТекСтрока2 Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный Цикл
//				СуммаДляСравнения2 = ?(ТекСтрока2.Сумма < 0, ТекСтрока2.Сумма * ( -1), ТекСтрока2.Сумма);
//				Если СуммаДляСравнения = СуммаДляСравнения2 И (СокрЛП(ТекСтрока2.Содержание) = "Зачет предоплаты" Или СокрЛП(ТекСтрока2.Содержание) = "წინასწარ გადახდილი თანხის ჩათვლა" ) Тогда
//					ТекСтрока2.Сумма = 0;	
//				КонецЕсли; 		
//			КонецЦикла;			
//		КонецЦикла;
//		// +++ } AzRy - [28.01.2022]
//		
//		Для каждого ТекСтрока Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный Цикл
//			//Если ТипЗнч(ТекСтрока.СчетДт) = Тип("ПланСчетовСсылка.Управленческий") Тогда
//			//	ТекСтрока.СчетДт = ДокументСсылкаДополнительныеРасходы.Контрагент.СчетУчетаАвансовПоставщикуРегл;	
//			//КонецЕсли;
//			//Если ТипЗнч(ТекСтрока.СчетКт) = Тип("ПланСчетовСсылка.Управленческий") Тогда
//			//	ТекСтрока.СчетКт = ДокументСсылкаДополнительныеРасходы.Контрагент.СчетУчетаАвансовПоставщикуРегл;	
//			//КонецЕсли;
//			
//			Если ТипЗнч(ТекСтрока.СчетДт) = Тип("ПланСчетовСсылка.Управленческий") Или ТипЗнч(ТекСтрока.СчетКт) = Тип("ПланСчетовСсылка.Управленческий") Тогда
//				ТекСтрока.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8140/2");
//				Если ДокументСсылкаДополнительныеРасходы.Предоплата.Количество() = 0 Тогда
//				    ТекСтрока.СчетКт = ДокументСсылкаДополнительныеРасходы.Контрагент.СчетУчетаРасчетовСПоставщикомРегл;
//				Иначе 		
//				   	ТекСтрока.СчетКт = ДокументСсылкаДополнительныеРасходы.Контрагент.СчетУчетаАвансовПоставщикуРегл;
//				КонецЕсли; 
//				//ТекСтрока.СчетКт = ДокументСсылкаДополнительныеРасходы.Контрагент.СчетУчетаАвансовПоставщикуРегл;
//				//ТекСтрока.СчетКт = ДокументСсылкаДополнительныеРасходы.Контрагент.СчетУчетаРасчетовСПоставщикомРегл;
//				//ТекСтрока.СчетДт = ДокументСсылкаДополнительныеРасходы.Контрагент.СчетУчетаАвансовПоставщикуРегл;
//				//ТекСтрока.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8140/2");
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли; 
//	// +++ } AzRy - [29.10.2021]
//	
//КонецПроцедуры
