
&После("ОбработкаПроверкиЗаполнения")
Процедура РасшAzRy_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Проведен И Предоплата.Итог("СуммаПлатежа") > 0 И ФактурыАвансов.Количество() = 0 Тогда

		ТекстСообщения = НСтр("ru = 'Итог колонки ""сумма платежа"" в табл. части ""Предоплата"" болше нуля, Заполнение таблицы ""Фактуры авансов"" обязательна'; ka = 'ცხრილი ""წინასწარი გადახდა"" - ის ჯამი მეტია 0 - ზე, სავალდებულოა ავანსის ფაქტურების ცხრილის შევსება.'; en = 'ცხრილი ""წინასწარი გადახდა"" - ის ჯამი მეტია 0 - ზე, სავალდებულოა ავანსის ფაქტურების ცხრილის შევსება.'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			ЭтотОбъект,
			ТекстСообщения,
			,
			,
			,
			Отказ
		);
		
	КонецЕсли; 
		
КонецПроцедуры
