
//&После("ОбработкаПроверкиЗаполнения_Deprecated")
//Процедура РасшAzRy_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//	
//	//// თუ დოკუმენტი გატარებულია და შემოწმების მექანიზმი გათიშულია მაშინ ქვედა შემოქმებას აზრი აღარ აქვს
//	//Если Проведен Или AzRyПроверкаЗаполнениеТаблицыФактурыАвансовОтключена_1 Или AzRyDEV.ЯвляетсяНеРезидентом(Контрагент) Или AzRyDEV.НалогообложениеНДСНеОблагаетсяНДС(НалогообложениеНДС) Тогда
//	//	Возврат;	
//	//КонецЕсли; 
//	//
//	////Если Не Проведен И Предоплата.Итог("СуммаПлатежа") > 0 И ФактурыАвансов.Количество() = 0 Тогда
//	//Если AzRyDEV.ДатаПредоплатыМеньшеТекущегоМесяца(Предоплата, Дата) И (Предоплата.Итог("СуммаПлатежа") > 0 И ФактурыАвансов.Количество() = 0) Тогда
//	//
//	//	ТекстСообщения = НСтр("ru = 'Итог колонки ""сумма платежа"" в табл. части ""Предоплата"" болше нуля, Заполнение таблицы ""Фактуры авансов"" обязательна'; ka = 'ცხრილი ""წინასწარი გადახდა"" - ის ჯამი მეტია 0 - ზე, სავალდებულოა ავანსის ფაქტურების ცხრილის შევსება.'; en = 'ცხრილი ""წინასწარი გადახდა"" - ის ჯამი მეტია 0 - ზე, სავალდებულოა ავანსის ფაქტურების ცხრილის შევსება.'");
//	//	УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
//	//		ЭтотОбъект,
//	//		ТекстСообщения,
//	//		,
//	//		,
//	//		,
//	//		Отказ
//	//	);
//	//		
//	//КонецЕсли; 
//		
//КонецПроцедуры

&После("ПередЗаписью")
Процедура РасшAzRy_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// თუ დოკუმენტი გატარებულია და შემოწმების მექანიზმი გათიშულია მაშინ ქვედა შემოქმებას აზრი აღარ აქვს
	Если Проведен Или AzRyПроверкаЗаполнениеТаблицыФактурыАвансовОтключена_1 Или AzRyDEV.ЯвляетсяНеРезидентом(Контрагент) Или AzRyDEV.НалогообложениеНДСНеОблагаетсяНДС(НалогообложениеНДС) Тогда
		Возврат;	
	КонецЕсли; 
	
	//Если Не Проведен И Предоплата.Итог("СуммаПлатежа") > 0 И ФактурыАвансов.Количество() = 0 Тогда
	Если AzRyDEV.ДатаПредоплатыМеньшеТекущегоМесяца(Предоплата, Дата) И (Предоплата.Итог("СуммаПлатежа") > 0 И ФактурыАвансов.Количество() = 0) Тогда
	
		ТекстСообщения = НСтр("ru = 'Итог колонки ""сумма платежа"" в табл. части ""Предоплата"" болше нуля, Заполнение таблицы ""Фактуры авансов"" обязательна'; ka = 'ცხრილი ""წინასწარი გადახდა"" - ის ჯამი მეტია 0 - ზე, სავალდებულოა ავანსის ფაქტურების ცხრილის შევსება.'; en = 'ცხრილი ""წინასწარი გადახდა"" - ის ჯამი მეტია 0 - ზე, სავალდებულოა ავანსის ფაქტურების ცხრილის შევსება.'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			ЭтотОбъект,
			ТекстСообщения,
			,
			,
			,
			Отказ
		);
			
	КонецЕсли;	
	
КонецПроцедуры
