
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЭлектронноеВзаимодействиеПереопределяемый.ЕстьПравоОткрытияЖурналаРегистрации() Тогда
		ТекстСообщения = НСтр("ka='რეგისტრაციის ჟურნალის სანახავად უფლებები არასაკმარისია.';ru='Недостаточно прав для просмотра журнала регистрации.';en='Not have permission to view the log.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
