
#Область ПрограммныйИнтерфейс

Функция СформироватьНадписьСчетФактура(НайденныйСчетФактура, Полученный = Ложь, СчетФактураТекст="") Экспорт

	КомпонентыФС = Новый Массив;
	Если Полученный Тогда
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Счет-фактура (полученный): ';ka='ანგარიშფაქტურა (полученный): '")));
		
	Иначе
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Счет-фактура: ';ka='ანგარიშფაქტურა: '")));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденныйСчетФактура) Тогда
		Если ТипЗнч(НайденныйСчетФактура) = Тип("Структура") Тогда
			Если Полученный Тогда
				СчетФактураТекст = СтрЗаменить(НайденныйСчетФактура.Ссылка, 
					НСтр("ru='Счет-фактура (полученный) ';ka='ანგარიშფაქტურა (полученный) '")+РаботаСФормойДокументаКлиентСервер.ПолучитьКороткийНомерДокумента(НайденныйСчетФактура.Ссылка.Номер),
					"№ "+НайденныйСчетФактура.Ссылка.НомерВходящегоДокумента);
			Иначе
				СчетФактураТекст = СтрЗаменить(НайденныйСчетФактура.Ссылка, НСтр("ru='Счет-фактура ';ka='ანგარიშფაქტურა '"),"№");
			КонецЕсли;
		Иначе
			//для строки
			СчетФактураТекст = СтрЗаменить(НайденныйСчетФактура, НСтр("ru='Счет-фактура ';ka='ანგარიშფაქტურა '"),"№");
		КонецЕсли;
		
		СчетФактураТекст = СтрЗаменить(СчетФактураТекст, НСтр("ka='(წაშლილია)';ru=' (удален)'"),"");
		СчетФактураТекст = СтрЗаменить(СчетФактураТекст, НСтр("ka='(არ  არის გატარებული)';ru=' (не проведен)'"),"");
		
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(СчетФактураТекст, , , , "открыть"));
	Иначе
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока("შექმნა", , , , "შექმნა"));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(КомпонентыФС);

КонецФункции

Функция СформироватьНадписьДокументОснование(Знач ДокОснование, Знач пТолькоПросмотр = Ложь) Экспорт
	
	КомпонентыФС = Новый Массив;
	
	ПредставлениеДокОснования = РаботаСФормойДокумента.ПредставлениеДокументаОснования(ДокОснование);
	
	Если ПредставлениеДокОснования = "НетОбъекта" Тогда
		
		КомпонентыФС = Новый Массив;
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ka='საფუძველი: იმყოფება ავტონომიურ სამუშაო ადგილზე';ru='Основание: находится в автомном рабочем месте';en='Base: it is in avtomnom workplace'")));
		
	ИначеЕсли ЗначениеЗаполнено(ПредставлениеДокОснования) Тогда
		
		//Для документов, у которых "номер входящего документа" указывается в отдельном поле, например Счет-фактура входящий
		Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			ПредставлениеДокОснования = СтрЗаменить(ПредставлениеДокОснования, 
				НСтр("ru='Счет-фактура (полученный) ';ka='Счет-фактура (полученный) '")+РаботаСФормойДокументаКлиентСервер.ПолучитьКороткийНомерДокумента(ДокОснование.Номер),
				НСтр("ru='Счет-фактура (полученный) ';ka='Счет-фактура (полученный) '")+ДокОснование.НомерВходящегоДокумента);
			ПредставлениеДокОснования = СтрЗаменить(ПредставлениеДокОснования,
				Формат(ДокОснование.Дата,"ДФ=dd.MM.yyyy"),
				Формат(ДокОснование.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy"));
		КонецЕсли;
		
		ДокОснованиеТекст = ПредставлениеДокОснования;
		
		ДокОснованиеТекст = СтрЗаменить(ДокОснованиеТекст, НСтр("ka='(წაშლილია)';ru=' (удален)'"),"");
		ДокОснованиеТекст = СтрЗаменить(ДокОснованиеТекст, НСтр("ka='(არ  არის გატარებული)';ru=' (не проведен)'"),"");

		КомпонентыФС = Новый Массив;
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ka='საფუძველი: ';ru='Основание: '")));
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(ДокОснованиеТекст, , , , "открыть"));
		Если НЕ пТолькоПросмотр Тогда
			КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(" "));
			КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(БиблиотекаКартинок.ЗаполнитьПоОснованию12х12, , , , "заполнить"));
			КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(" "));
			КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(БиблиотекаКартинок.Очистить, , , , "удалить"));
		КонецЕсли;
	Иначе
		КомпонентыФС = Новый Массив;
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ka='საფუძველი: ';ru='Основание: '")));
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ka='არჩევა';ru='выбрать';en='select'"), , , , "выбрать"));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(КомпонентыФС);

КонецФункции


Функция ПолучитьЗаголовокПредоплаты(Знач ТабЧасть, Знач ВалютаДокумента) Экспорт
	
	Если ТабЧасть.Количество()>0 Тогда
		Возврат НСтр("ru='Предоплата: ';ka='წინასწარი გადახდა: '") + ТабЧасть.Итог("СуммаРасчетов") + " " + УправлениеНебольшойФирмойПовтИсп.ПолучитьСимвольноеПредставлениеВалюты(ВалютаДокумента); 
	Иначе
		Возврат НСтр("ru = 'Предоплата'; ka = 'წინასწარი გადახდა'; en = 'prepayment'");
	КонецЕсли;
	
КонецФункции

Функция КраткоеПредставлениеТипаНалогообложенияНДС(НалогообложениеНДС) Экспорт
	
	Если НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") Тогда
		Возврат НСтр("ka='დღგ-ით';ru='с НДС';en='VAT included'");
	ИначеЕсли НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС") Тогда
		Возврат НСтр("ka='დღგ-ის გარეშე';ru='без НДС';en='without VAT'");
	ИначеЕсли НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НаЭкспорт") Тогда
		Возврат НСтр("ka='0% დღგ';ru='0% НДС';en='0% VAT'");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКороткийНомерДокумента(Знач НомерДок) Экспорт
	
	СоответствиеЧисел = Новый Соответствие();
	СоответствиеЧисел.Вставить("1",1);
	СоответствиеЧисел.Вставить("2",2);
	СоответствиеЧисел.Вставить("3",3);
	СоответствиеЧисел.Вставить("4",4);
	СоответствиеЧисел.Вставить("5",5);
	СоответствиеЧисел.Вставить("6",6);
	СоответствиеЧисел.Вставить("7",7);
	СоответствиеЧисел.Вставить("8",8);
	СоответствиеЧисел.Вставить("9",9);
	СоответствиеЧисел.Вставить("0",0);
	
	НомерДок = СокрЛП(НомерДок);
	ДлинаСтроки = СтрДлина(НомерДок);
	НомерЧисло = НомерДок;
	
	Для н=1 По ДлинаСтроки Цикл
	
		Если СоответствиеЧисел.Получить(Сред(НомерДок,ДлинаСтроки-н+1,1)) = Неопределено Тогда
			НомерЧисло = Прав(НомерДок, н-1); 
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Если СтрДлина(НомерЧисло)>0 Тогда
		возврат Число(НомерЧисло);
	Иначе
		возврат НомерДок;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИмяФормыСтрокой(Знач ИмяФормы) Экспорт
	
	ИмяФормы = СтрЗаменить(ИмяФормы, ".ФормаСписка", "");
	ИмяФормы = СтрЗаменить(ИмяФормы, ".ФормаДокумента", "");
	ИмяФормы = СтрЗаменить(ИмяФормы, ".ФормаВыбора", "");
	ИмяФормы = СтрЗаменить(ИмяФормы, ".ФормаЭлемента", "");
	ИмяФормы = СтрЗаменить(ИмяФормы, ".Форма", "");
	
	ИмяФормы = СтрЗаменить(ИмяФормы, ".", "");
	
	Возврат ИмяФормы;
	
КонецФункции

Функция ВариантОтчета(ИмяОтчета, КлючВарианта) Экспорт
	
	Возврат РаботаСФормойДокумента.СсылкаВариантаОтчета(ИмяОтчета, КлючВарианта);
	
КонецФункции

#КонецОбласти

#Область Россофт
Функция СформироватьНадписьЭлНакладная(НайденныйЭлНакладная, ЭлНакладнаяТекст="") Экспорт

	КомпонентыЭН = Новый Массив;
	КомпонентыЭН.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Эл-Накладная: '; ka = 'სასაქონლო ზედნადები: '; en = 'Waybill:'")));
	
	Если ЗначениеЗаполнено(НайденныйЭлНакладная) Тогда
		Если ТипЗнч(НайденныйЭлНакладная) = Тип("Структура") Тогда
			ЭлНакладнаяТекст = СтрЗаменить(НайденныйЭлНакладная.Ссылка, НСтр("ru='Эл-Накладная: ';ka='სასაქონლო ზედნადები: '"),"№");
		КонецЕсли;
		ЭлНакладнаяТекст = СтрЗаменить(ЭлНакладнаяТекст, НСтр("ka='(წაშლილია)';ru=' (удален)'"),"");
		ЭлНакладнаяТекст = СтрЗаменить(ЭлНакладнаяТекст, НСтр("ka='(არ არის გატარებული)';ru=' (не проведен)'"),"");
		
		КомпонентыЭН.Добавить(Новый ФорматированнаяСтрока(ЭлНакладнаяТекст, , , , НСтр("ka='გახსნა';ru='открыть';en='open'")));
	Иначе
		КомпонентыЭН.Добавить(Новый ФорматированнаяСтрока(НСтр("ka='შექმნა';ru='создать';en='create'"), , , , НСтр("ka='შექმნა';ru='создать';en='create'")));
	КонецЕсли;
	Возврат Новый ФорматированнаяСтрока(КомпонентыЭН);

КонецФункции

Функция СформироватьНадписьНалоговыйДокумент(НайденныйЭлНакладная, ЭлНакладнаяТекст="") Экспорт

	КомпонентыЭН = Новый Массив;
	КомпонентыЭН.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Налоговый документ: '; ka = 'საგადასახადო დოკუმენტი: '; en = 'Tax Document: '")));
	
	Если ЗначениеЗаполнено(НайденныйЭлНакладная) Тогда
		Если ТипЗнч(НайденныйЭлНакладная) = Тип("Структура") Тогда
			ЭлНакладнаяТекст = СтрЗаменить(НайденныйЭлНакладная.Ссылка, НСтр("ru='Налоговый документ: ';ka='საგადასახადო დოკუმენტი: '"),"№");
		КонецЕсли;
		ЭлНакладнаяТекст = СтрЗаменить(ЭлНакладнаяТекст, НСтр("ka='(წაშლილია)';ru=' (удален)'"),"");
		ЭлНакладнаяТекст = СтрЗаменить(ЭлНакладнаяТекст, НСтр("ka='(არ არის გატარებული)';ru=' (не проведен)'"),"");
		
		КомпонентыЭН.Добавить(Новый ФорматированнаяСтрока(ЭлНакладнаяТекст, , , , НСтр("ka='გახსნა';ru='открыть';en='open'")));
	Иначе
		КомпонентыЭН.Добавить(Новый ФорматированнаяСтрока(НСтр("ka='შექმნა';ru='создать';en='create'"), , , , НСтр("ka='შექმნა';ru='создать';en='create'")));
	КонецЕсли;
	Возврат Новый ФорматированнаяСтрока(КомпонентыЭН);

КонецФункции
	
#КонецОбласти 