
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Справочники.Потери.ПроцентУсушкиУжеСуществует(ЭтотОбъект.ПроцентУсушки) ИЛИ ЭтотОбъект.ПроцентУсушки = 0 Тогда
		
		ТекстСообщения = НСтр("ka='შრობის პროცენტი არ არის არჩეული';ru='Неправильно выбран процент усушки.';en='შრობის პროცენტი არ არის არჩეული.'");
		
		РеквизитПроверки = "ПроцентУсушки";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,РеквизитПроверки,"Объект",Отказ);
	
	КонецЕсли;
	
КонецПроцедуры
