

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.Конвертация.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДенежныеСредства(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПодотчетниками(ДополнительныеСвойства, Движения, Отказ);
	ОтразитьОтчетКурсовыхРазниц(ДополнительныеСвойства, Движения, Отказ);
	
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения, "");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.ВидыОперацийКонвертация.Подотчетник Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Отправитель");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Получатель");
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийКонвертация.СоСчета Тогда
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьЗагрузкуИзБанка") 
			И Отправитель.Банк.ИспользуетсяДляИнтеграцииСБанком Тогда  
			
			ПроверяемыеРеквизиты.Добавить("Комментарий");
			
		КонецЕсли;
	КонецЕсли;
	
	СуммаАванс =  ВыданныеАвансы.Итог("Сумма");  //++Lazare
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.Подотчетник")  Тогда 
		Если СуммаАванс <> СуммаКонвертации Тогда
			
			ТекстСообщения =			    
			НСтр("ru = 'Сумма конвертации: %СуммаКонвертации% %ВалютаОтправитель%, не соответствует сумме разнесенных платежей в табличной части: %СуммаАванс% %ВалютаОтправитель%!'; ka = 'დოკუმენტის თანხა: %СуммаКонвертации% %ВалютаОтправитель%, არ შეესაბამება განკუთვნებულ გადახდებს ცხრილში: %СуммаАванс% %ВалютаОтправитель%!'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаКонвертации%", Строка(СуммаКонвертации));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаАванс%", Строка(СуммаАванс));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВалютаОтправитель%", СокрЛП(Строка(ВалютаОтправитель)));
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			ЭтотОбъект,
			ТекстСообщения,
			,
			,
			"СуммаКонвертации",
			Отказ
			);
			
		КонецЕсли;
	КонецЕсли;

	

	
КонецПроцедуры

Процедура ОтразитьОтчетКурсовыхРазниц(ДополнительныеСвойства, Движения, Отказ)

	ТаблицаОтчетКурсовыхРазниц = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОтчетКурсовыхРазниц;
	
	Если Отказ
	 ИЛИ ТаблицаОтчетКурсовыхРазниц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Создадим набор записей регистра сведений ОтчетПоКурсовымРазницам.
	НаборЗаписейОтчетПоКурсовымРазницам = РегистрыСведений.ОтчетПоКурсовымРазницам.СоздатьНаборЗаписей();
	НаборЗаписейОтчетПоКурсовымРазницам.Отбор.Регистратор.Установить(Ссылка);	
	
	Для Каждого Строк Из ТаблицаОтчетКурсовыхРазниц Цикл 
		
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строк);	
		НоваяСтрока.Период = Дата;
		
	КонецЦикла;
	
	НаборЗаписейОтчетПоКурсовымРазницам.Записать(Истина);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	УникальныйКлючВИнтернетБанке = "";
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КурсОтправительНацБанк) Тогда 
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаОтправитель));
		КурсОтправительНацБанк = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);       
		КурсОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);       
		КратностьОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КурсПолучательНацБанк) Тогда 
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаПолучатель));
		КурсПолучательНацБанк = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс); 
		КурсПолучатель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);           
		КратностьПолучатель  = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
	КонецЕсли;
	
КонецПроцедуры
