
&НаСервере
&Вместо("ПересчитатьСуммыВСтрокиРасходов")
Процедура РасшAzRy_ПересчитатьСуммыВСтрокиРасходов(Идентификатор, ИмяПоля)
	
	// +++ { AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:	
	ЯвляетсяНеРезидентом = Объект.Контрагент.ЯвляетсяНеРезидентом И Объект.Контрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС И Объект.ДоговорДляЗачетаАвансаСПомощником.УчитыватьНДФЛ;
	// +++ } AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	
	Если Идентификатор = Неопределено ИЛИ Идентификатор = 0 Тогда
		Для Каждого СтрокаТЧ ИЗ Объект.РасшифровкаПлатежа Цикл
			Идентификатор = СтрокаТЧ.ПолучитьИдентификатор();
			ТекДанные = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(Идентификатор);
			
			// +++ { AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
			Если ЯвляетсяНеРезидентом Тогда
				AzRyОбщегоНазначения.ПересчитатьСуммыСтроки_РасходИзКассы_РасходСоСчета(ИмяПоля, ТекДанные);
			Иначе 
				РС_ОбщегоНазначения.ПересчитатьСуммыСтроки_РасходИзКассы_РасходСоСчета(ИмяПоля, ТекДанные);
			КонецЕсли; 
			// +++ } AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:			
		КонецЦикла;
	Иначе
		ТекДанные = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(Идентификатор);
		// +++ { AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
		Если ЯвляетсяНеРезидентом Тогда
			AzRyОбщегоНазначения.ПересчитатьСуммыСтроки_РасходИзКассы_РасходСоСчета(ИмяПоля, ТекДанные);
		Иначе 
			РС_ОбщегоНазначения.ПересчитатьСуммыСтроки_РасходИзКассы_РасходСоСчета(ИмяПоля, ТекДанные);
		КонецЕсли; 
		// +++ } AzRy - [29.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:		
	КонецЕсли;
КонецПроцедуры
