
&НаКлиенте
Процедура ЗвукОщыбкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Текстовый файл (*.wav)|*.wav|";
	
	//Если пользователь не нажал кнопку ОТМЕНА в диалоге
	Если Диалог.Выбрать() Тогда
		Объект[Элемент.Имя] = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры
