
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.Период) Тогда
	
		Запись.Период = ТекущаяДата();
	
	КонецЕсли; 
	
	НаборДвижений = РегистрыСведений.НеПереоцениватьСчета.СоздатьНаборЗаписей();
	НаборДвижений.Прочитать();
	НеПереоцениватьСчета.Загрузить(НаборДвижений.Выгрузить());
	
	НаборДвижений = РегистрыСведений.СчетаФинансовогоРезультатаДоходы.СоздатьНаборЗаписей();
	НаборДвижений.Прочитать();
	СчетаФинансовогоРезультатаДоходы.Загрузить(НаборДвижений.Выгрузить());
	
	НаборДвижений = РегистрыСведений.СчетаФинансовогоРезультатаРасходы.СоздатьНаборЗаписей();
	НаборДвижений.Прочитать();
	СчетаФинансовогоРезультатаРасходы.Загрузить(НаборДвижений.Выгрузить());
	
	НаборДвижений = РегистрыСведений.СчетаКосвенныхПроизводственныхЗатрат.СоздатьНаборЗаписей();
	НаборДвижений.Прочитать();
	СчетаКосвенныхЗатрат.Загрузить(НаборДвижений.Выгрузить());
	
	НаборДвижений = РегистрыСведений.СчетаРасходыДляРасчетаРетроБонуси.СоздатьНаборЗаписей();
	НаборДвижений.Прочитать();
	СчетаРасходыДляРасчетаРетроБонуси.Загрузить(НаборДвижений.Выгрузить());

	//+Lazare 04.10.2022
	ИспользоватьРетроБонуси = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("КонстантаРетроБонуси");	
	Элементы.РетроБонуси.Видимость = ИспользоватьРетроБонуси ;
	//-Lazare 04.10.2022
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НаборДвижений = РегистрыСведений.НеПереоцениватьСчета.СоздатьНаборЗаписей();
	НаборДвижений.Загрузить(НеПереоцениватьСчета.Выгрузить());
	НаборДвижений.Записать(Истина);
		
	ПустойСчет = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	
	тзСчетов = СчетаФинансовогоРезультатаДоходы.Выгрузить();
	тзЗагрузки = тзСчетов.Скопировать();
	тзЗагрузки.Очистить();
	
	Для Каждого Счета Из тзСчетов Цикл
		
		Если Счета.СчетУчета = ПустойСчет Тогда 
			Продолжить;
		КонецЕсли;
		
		СтроаЗагрузки = тзЗагрузки.Добавить();
		ЗаполнитьЗначенияСвойств(СтроаЗагрузки, Счета);
		
	КонецЦикла;
		
	НаборДвижений = РегистрыСведений.СчетаФинансовогоРезультатаДоходы.СоздатьНаборЗаписей();
	НаборДвижений.Загрузить(тзЗагрузки); //СчетаФинансовогоРезультатаДоходы.Выгрузить());
	НаборДвижений.Записать(Истина);
	
	
	тзСчетов = СчетаФинансовогоРезультатаРасходы.Выгрузить();
	тзЗагрузки = тзСчетов.Скопировать();
	тзЗагрузки.Очистить();
	
	Для Каждого Счета Из тзСчетов Цикл
		
		Если Счета.СчетУчета = ПустойСчет Тогда 
			Продолжить;
		КонецЕсли;
		
		СтроаЗагрузки = тзЗагрузки.Добавить();
		ЗаполнитьЗначенияСвойств(СтроаЗагрузки, Счета);
		
	КонецЦикла;
	
	
	НаборДвижений = РегистрыСведений.СчетаФинансовогоРезультатаРасходы.СоздатьНаборЗаписей();
	НаборДвижений.Загрузить(тзЗагрузки); //СчетаФинансовогоРезультатаРасходы.Выгрузить());
	НаборДвижений.Записать(Истина);
	
	НаборДвижений = РегистрыСведений.СчетаКосвенныхПроизводственныхЗатрат.СоздатьНаборЗаписей();
	НаборДвижений.Загрузить(СчетаКосвенныхЗатрат.Выгрузить());
	НаборДвижений.Записать(Истина);
	
	
	тзСчетов = СчетаРасходыДляРасчетаРетроБонуси.Выгрузить();
	тзЗагрузки = тзСчетов.Скопировать();
	тзЗагрузки.Очистить();
	
	Для Каждого Счета Из тзСчетов Цикл
		
		Если Счета.СчетУчетаРегл = ПустойСчет Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрЗагрузки = тзЗагрузки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрЗагрузки, Счета);
		
	КонецЦикла;
	
	НаборДвижений = РегистрыСведений.СчетаРасходыДляРасчетаРетроБонуси.СоздатьНаборЗаписей();
	НаборДвижений.Загрузить(СчетаРасходыДляРасчетаРетроБонуси.Выгрузить());
	НаборДвижений.Записать(Истина);

	
КонецПроцедуры

 &НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СчетФактураПолученныйВидНалогаПриСинхронизацииПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.СчетФактураПолученныйВидНалогаПриСинхронизации) Тогда
		Запись.СчетФактураПолученныйСчетУчетаПриСинхронизации
			= ЗначениеРеквизитаОбъекта(Запись.СчетФактураПолученныйВидНалогаПриСинхронизации, "СчетУчетаКВозмещениюРегл");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураВыданныйВидНалогаПриСинхронизацииПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.СчетФактураВыданныйВидНалогаПриСинхронизации) Тогда
		Запись.СчетФактураВыданныйСчетУчетаПриСинхронизации
			= ЗначениеРеквизитаОбъекта(Запись.СчетФактураВыданныйВидНалогаПриСинхронизации, "СчетУчетаРегл");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьСчетаПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСчетаПоУмолчанию()
	
	Запись.СчетНезавершенноеПроизводство = ПланыСчетов.Хозрасчетный.НайтиПоКоду("1630");
	
	Запись.СчетПоложительнаяКурсоваяРазницаДеньги = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8140/1");
	Запись.СчетОтрицательнаяКурсоваяРазницаДеньги = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8240/1");
	
	Запись.СчетПоложительнаяКурсоваяРазницаЗадолженность = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8140/2");
	Запись.СчетОтрицательнаяКурсоваяРазницаЗадолженность = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8240/2");
	Запись.СчетДеньгиВПути = ПланыСчетов.Хозрасчетный.НайтиПоКоду("2015");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

#КонецОбласти

