
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

	//СчетУчета = Параметры.СчетУчета;
	//СчетАмортизации = Параметры.СчетАмортизации;
	////+++	
	СчетУчетаРегл = Параметры.СчетУчетаРегл;
	СчетАмортизацииРегл = Параметры.СчетАмортизацииРегл;
	//---
	Если ОтказИзменитьСчетУчета(Ссылка) Тогда
		Элементы.ГруппаСчетовУчета.Подсказка = НСтр("ka='ბაზაში არის ამ გრძელვადიანი აქტივის თაობაზე მოძრაობები! აღრიცხვის ანგარიშების შეცვლა აკრძალულია!';ru='В базе есть движения по этому внеоборотному активу! Изменение счетов учета запрещено!';en='At the base there is movement on the non-current assets! Change of accounting is prohibited!'");
		Элементы.ГруппаСчетовУчета.Доступность = Ложь;
		Элементы.ПоУмолчанию.Видимость = Ложь;
	КонецЕсли;
	
	РегламентированныйУчетСервер.УстановитьВидимостьУпрУчета(ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчета) Тогда
	//	СчетУчета = ПредопределенноеЗначение("ПланСчетов.Управленческий.ВнеоборотныеАктивы");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетАмортизацииПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетАмортизации) Тогда
	//	СчетАмортизации = ПредопределенноеЗначение("ПланСчетов.Управленческий.АмортизацияВнеоборотныхАктивов");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоУмолчанию(Команда)
	
	СчетУчета = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	СчетАмортизации = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	
	//+++
	СчетУчетаРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	СчетАмортизацииРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	//---
	
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры // ПоУмолчанию()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция проверяет возможность изменения счета учета.
//
&НаСервере
Функция ОтказИзменитьСчетУчета(ТекстСообщения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнеоборотныеАктивы.Период,
	|	ВнеоборотныеАктивы.Регистратор,
	|	ВнеоборотныеАктивы.НомерСтроки,
	|	ВнеоборотныеАктивы.Активность,
	|	ВнеоборотныеАктивы.ВидДвижения,
	|	ВнеоборотныеАктивы.Организация,
	|	ВнеоборотныеАктивы.ВнеоборотныйАктив,
	|	ВнеоборотныеАктивы.Стоимость,
	|	ВнеоборотныеАктивы.Амортизация,
	|	ВнеоборотныеАктивы.СодержаниеПроводки
	|ИЗ
	|	РегистрНакопления.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы
	|ГДЕ
	|	ВнеоборотныеАктивы.ВнеоборотныйАктив = &ВнеоборотныйАктив");
	
	Запрос.УстановитьПараметр("ВнеоборотныйАктив", ?(ЗначениеЗаполнено(Ссылка), Ссылка, Неопределено));
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции // ОтказИзменитьСчетУчета()

&НаКлиенте
Процедура ОповеститьОбИзмененииСчетовРасчетов()
	
	СтруктураПараметры = Новый Структура("СчетУчета, СчетАмортизации, СчетУчетаРегл, СчетАмортизацииРегл", СчетУчета, СчетАмортизации, СчетУчетаРегл, СчетАмортизацииРегл);
	Оповестить("ИзменилисьСчетаВнеоборотныеАктивы", СтруктураПараметры);
	
КонецПроцедуры

//+++
&НаКлиенте
Процедура СчетУчетаРеглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаРегл) Тогда
		СчетУчетаРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	КонецЕсли;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаРегл, СчетУчета);
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетАмортизацииРеглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетАмортизацииРегл) Тогда
		СчетАмортизацииРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	КонецЕсли;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетАмортизацииРегл, СчетАмортизации);
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры
//---

#КонецОбласти
