
&НаСервере
Процедура РасшAzRy_ПередЗаписьюНаСервереВместо(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// +++ { AzRy - [17.03.2023] - Jira: - Developer:გიორგი მამულაშვილი - Comment: 					 				 
	Если ЗначениеЗаполнено(Объект.ТипВнеоборотныеАктивы) И Не ЗначениеЗаполнено(ТекущийОбъект.СчетУчетаРегл) И Не ЗначениеЗаполнено(ТекущийОбъект.СчетАмортизацииРегл) Тогда
	// +++ } AzRy - [17.03.2023] - Jira: - Developer:გიორგი მამულაშვილი - Comment:	
		ТекущийОбъект.СчетУчетаРегл = Объект.ТипВнеоборотныеАктивы.СчетУчетаРегл;
		ТекущийОбъект.СчетАмортизацииРегл  = Объект.ТипВнеоборотныеАктивы.СчетАмортизацииРегл;
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
