#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Пользователь = Параметры.Пользователь;
	ПарольПользователяСервиса = Параметры.ПарольПользователяСервиса;
	СтараяПочта = Параметры.СтараяПочта;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СменитьПочту(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "";
	Если Не ЗначениеЗаполнено(СтараяПочта) Тогда
		ТекстВопроса =
			НСтр("ka='სერვისის მომხმარებლის ელექტრონული ფოსტის მისამართი შეცვლილია. მფლობელები და აბონენტის ადმინისტრატორები ვეღარ შეძლებენ მომხმარებლის პარამეტრების შეცვლას.';ru='Адрес электронной почты пользователя сервиса изменен."
"Владельцы и администраторы абонента больше не смогут изменять параметры пользователя.'")
			+ Символы.ПС
			+ Символы.ПС;
	КонецЕсли;
	ТекстВопроса = ТекстВопроса + НСтр("ka='შევცვალოთ ელექტრონული ფოსტის მისამართი?';ru='Выполнить изменение адреса электронной почты?';en='Run email change?'");
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("СменитьПочтуЗавершение", ЭтотОбъект),
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьЗапросНаСменуПочты()
	
	ИнтеграцияСтандартныхПодсистем.ПриСозданииЗапросаНаСменуПочты(НоваяПочта,
		Пользователь, ПарольПользователяСервиса);
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьПочтуЗавершение(Ответ, Неопределен) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		СоздатьЗапросНаСменуПочты();
		
		ПоказатьПредупреждение(
			Новый ОписаниеОповещения("Закрыть", ЭтотОбъект),
			НСтр("ka='აღნიშნულ მისამართზე გაგზავნილია წერილი დადასტურების მოთხოვნით. ფოსტა შეიცვლება მხოლოდ მომხმარებლის მიერ მოთხოვნის დადასტურების შემდეგ.';ru='На указанный адрес отправлено письмо с запросом на подтверждение."
"Почта будет изменена только после подтверждения запроса пользователем.'"));
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
