////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дополнительные отчеты и обработки", расширение безопасного режима.
// Процедуры и функции с повторным использованием возвращаемых значений.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает массив методов, которые могут быть выполнены расширением безопасного
// режима.
//
// Возвращаемое значение: Массив(Строка).
//
Функция ПолучитьРазрешенныеМетоды() Экспорт
	
	Результат = Новый Массив();
	
	// ДополнительныеОтчетыИОбработкиВБезопасномРежиме
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ЧтениеXMLИзДвоичныхДанных");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ЗаписьXMLВДвоичныеДанные");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ЧтениеHTMLИзДвоичныхДанных");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ЗаписьHTMLВДвоичныеДанные");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ЧтениеFastInfosetИзДвоичныхДанных");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ЗаписьFastInfosetВДвоичныеДанные");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.СоздатьComОбъект");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПодключитьВнешнююКомпонентуИзОбщегоМакетаКонфигурации");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПодключитьВнешнююКомпонентуИзМакетаКонфигурации");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПолучитьФайлИзВнешнегоОбъекта");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПередатьФайлВоВнешнийОбъект");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПолучитьФайлИзИнтернета");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПередатьФайлВИнтернет");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.WSСоединение");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПроведениеДокументов");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ЗаписатьОбъекты");
	// ДополнительныеОтчетыИОбработкиВБезопасномРежиме
	
	// ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.ТекстовыйДокументИзДвоичныхДанных");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.ТекстовыйДокументВДвоичныеДанные");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.ТабличныйДокументИзДвоичныхДанных");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.ТабличныйДокументВДвоичныеДанные");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.ФорматированныйДокументВДвоичныеДанные");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.СтрокаИзДвоичныхДанных");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.СтрокаВДвоичныеДанные");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.РаспаковатьАрхив");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.УпаковатьФайлыВАрхив");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.ВыполнитьСценарийВБезопасномРежиме");
	// Конец ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

// Возвращает словарь синонимов видов разрешений дополнительных отчетов и обработок
// и их параметров (для отображения в пользовательском интерфейсе).
//
// Возвращаемое значение:
//  ФиксированноеСоответствие:
//    Ключ - ТипXDTO, соответствующий виду разрешения,
//    Значение - Структура, ключи:
//      Представление - строка, краткое представление вида разрешения,
//      Описание - строка, подробное описание вида разрешения,
//      Параметры - ТаблицаЗначений, колонки:
//        Имя - строка, имя свойства, определенного для ТипаXDTO,
//        Описание - строка, описание последствий параметра разрешения для
//          указанного значения параметра,
//        ОписаниеЛюбогоЗначения - строка, описание последствий параметра
//          разрешения для неуказанного значения параметра.
//
Функция Словарь() Экспорт
	
	Результат = Новый Соответствие();
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}GetFileFromInternet
	
	Представление = НСтр("ka='მონაცემთა მიღება ინტერნეტის ქსელიდან';ru='Получение данных из сети Интернет';en='Getting data from the Internet'");
	Описание = НСтр("ka='დამატებითი ანგარიშგებისთვის ან დამუშავებისთვის ნებადართული იქნება მონაცემთა მიღება ინტერნეტის ქსელიდან';ru='Дополнительному отчету или обработке будет разрешено получать данные из сети Интернет';en='Additional reports or treatment will be allowed to receive data from the Internet'");
	
	Параметры = ТаблицаПараметров();
	ДобавитьПараметр(Параметры, "Host", НСтр("ka='სერვერ %1-იდან';ru='с сервера %1';en='with 1% server'"), НСтр("ka='ნებისმიერი სერვერიდან';ru='с любого сервера';en='from any server'"));
	ДобавитьПараметр(Параметры, "Protocol", НСтр("ka='по протоколу %1';ru='по протоколу %1';en='protocol 1%'"), НСтр("ka='по любому протоколу';ru='по любому протоколу';en='any protocol'"));
	ДобавитьПараметр(Параметры, "Port", НСтр("ka='через порт %1';ru='через порт %1';en='port% 1'"), НСтр("ka='через любой порт';ru='через любой порт';en='any port'"));
	
	Значение = Новый Структура;
	Значение.Вставить("Представление", Представление);
	Значение.Вставить("Описание", Описание);
	Значение.Вставить("Параметры", Параметры);
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипПолучениеДанныхИзИнтернет(),
		Значение);
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}GetFileFromInternet
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SendFileToInternet
	
	Представление = НСтр("ka='მონაცემთა გადაცემა ინტერნეტის ქსელში';ru='Передача данных в сеть Интернет';en='Transferring data to the Internet'");
	Описание = НСтр("ka='დამატებითი ანგარიშგებისთვის ან დამუშავებისთვის ნებადართული იქნება მონაცემთა გაგზავნა ინტერნეტის ქსელში';ru='Дополнительному отчету или обработке будет разрешено отправлять данные в сеть Интернет';en='Additional reports or treatment will be allowed to send data to the Internet'");
	Последствия = НСтр("ka='ყურადღება! მონაცემთა გაგზავნა პოტენციურად შეიძლება, რომ გამოყენებული იქნას დამატებითი ანგარიშგების ან დამუშავების მიერ საინფორმაციო ბაზის ადმინისტრატორის მიერ გაუთვალისწინებელი მოქმედებების ჩასატარებლად."
""
"მოცემული დამატებითი ანგარიშგება ან დამუშავება გამოიყენეთ მხოლოდ იმ შემთხვევაში, თუ მას ანდობთ შემმუშავებელს და აკონტროლებთ გაცემულ ნებართვეზე მისაბმელ შეზღუდვებს (სერვერი, პროტოკოლი და პორტი).';ru='Внимание! Отправка данных потенциально может использоваться дополнительным"
"отчетом или обработкой для совершения действий, не предполагаемых администратором"
"информационной базы."
""
"Используйте данный дополнительный отчет или обработку только в том случае, если Вы доверяете"
"ее разработчику и контролируйте ограничения (сервер, протокол и порт), накладываемые на"
"выданные разрешения.'");
	
	Параметры = ТаблицаПараметров();
	ДобавитьПараметр(Параметры, "Host", НСтр("ka='через порт %1';ru='через порт %1';en='port% 1'"), НСтр("ka='на любой сервера';ru='на любой сервера';en='on any server'"));
	ДобавитьПараметр(Параметры, "Protocol", НСтр("ka='по протоколу %1';ru='по протоколу %1';en='protocol 1%'"), НСтр("ka='по любому протоколу';ru='по любому протоколу';en='any protocol'"));
	ДобавитьПараметр(Параметры, "Port", НСтр("ka='через порт %1';ru='через порт %1';en='port% 1'"), НСтр("ka='через любой порт';ru='через любой порт';en='any port'"));
	
	Значение = Новый Структура;
	Значение.Вставить("Представление", Представление);
	Значение.Вставить("Описание", Описание);
	Значение.Вставить("Последствия", Последствия);
	Значение.Вставить("Параметры", Параметры);
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипПередачаДанныхВИнтернет(),
		Значение);
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SendFileToInternet
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SoapConnect
	
	Представление = НСтр("ka='Обращение к веб-сервисам в сети Интернет';ru='Обращение к веб-сервисам в сети Интернет';en='Appeal to the Internet web services'");
	Описание = НСтр("ka='დამატებითი ანგარიშგებისთვის ან დამუშავებისთვის ნებადართული იქნება ინტერნეტის ქსელში განთავსებულ ვებ-სერვისებთან მიმართვა (ამასთან, დამატებითი ანგარიშგების ან დამუშავების მიერ შესაძლებელია ინტერნეტიდან როგორც ინფორმაციის მიღება, ასევე გადაცემა.';ru='Дополнительному отчету или обработке будет разрешено обращаться к веб-сервисам, расположенным в сети Интернет (при этом возможно как получение дополнительным отчетом или обработкой информации из сети Интернет, так и передача.';en='Additional reports or treatment will be allowed to access the Web services located on the Internet (it is possible both to obtain additional reports or processing of information from the Internet and transfer.'");
	Последствия = НСтр("ka='ყურადღება! ვებ-სერვისებთან მიმართვა პოტენციურად შეიძლება გამოყენებული იქნას დამატებითი ანგარიშგების ან დამუშავების მიერ ისეთი მოქმედებების ჩასატარებლად, რომლებიც არ არის გათვალისწინებული საინფორმაციო ბაზის ადმინისტრატორის მიერ."
""
"მოცემული დამატებითი ანგარიშგება ან დამუშავება გამოიყენეთ მხოლოდ იმ შემთხვევაში, თუ თქვენ ენდობით მის შემმუშავებელს და აკონტროლებთ გაცემულ ნებართვებზე დართულ შეზღუდვებს (შეერთების მისამართი).';ru='Внимание! Обращение к веб-сервисам потенциально может использоваться дополнительным"
"отчетом или обработкой для совершения действий, не предполагаемых администратором"
"информационной базы."
""
"Используйте данный дополнительный отчет или обработку только в том случае, если Вы доверяете"
"ее разработчику и контролируйте ограничения (адрес подключения), накладываемые на"
"выданные разрешения.'");
	
	Параметры = ТаблицаПараметров();
	ДобавитьПараметр(Параметры, "WsdlDestination", НСтр("ka='по адресу %1';ru='по адресу %1';en='at 1%'"), НСтр("ka='по любому адресу';ru='по любому адресу';en='any address'"));
	
	Значение = Новый Структура;
	Значение.Вставить("Представление", Представление);
	Значение.Вставить("Описание", Описание);
	Значение.Вставить("Последствия", Последствия);
	Значение.Вставить("Параметры", Параметры);
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипWSСоединение(),
		Значение);
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SoapConnect
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}CreateComObject
	
	Представление = НСтр("ka=' COM-ობიექტის შექმნა';ru='Создание COM-объекта';en='Creating a COM-object'");
	Описание = НСтр("ka='დამატებითი ანგარიშგებისთვის ან დამუშავებისთვის ნებადართული იქნება გარე პროგრამული უზრუნველყოფის მექანიზმების გამოყენება COM-დაკავშირების მეშვეობით';ru='Дополнительному отчету или обработке будет разрешено использовать механизмы внешнего программного обеспечения с помощью COM-соединения';en='Additional reports or treatment will be allowed to use the mechanisms of the external software using the COM-connection'");
	Последствия = НСтр("ka='ყურადღება! გარეშე პროგრამული უზრუნველყოფის საშუალებების გამოყენება შეიძლება გამოყენებული იქნას დამატებითი ანგარიშგების ან დამუშავების მიერ საინფორმაციო ბაზის ადმინისტრატორის მიერ გაუთვალისწინებელი მოქმედებების ჩასატარებლად, აგრეთვე, უსაფრთხო რეჟიმში დამატებით დამუშავებაზე მიბმული შეზღუდვების არასანქცირებულად გვერდის ასავლელად."
""
"მოცემული დამატებითი ანგარიშგება ან დამუშავება გამოიყენეთ მხოლოდ იმ შემთხვევაში, თუ ენდობით მის შემმუშავებელს და აკონტროლებთ გაცემულ ნებართვებზე მიბმულ შეზღუდვებს (პროგრამული იდენტიფიკატორი).';ru='Внимание! Использование средств стороннего программного обеспечения может использоваться"
"дополнительным отчетом или обработкой для совершения действий, не предполагаемых администратором"
"информационной базы, а также для несанкционированного обхода ограничений, накладываемых на дополнительную обработку"
"в безопасном режиме."
""
"Используйте данный дополнительный отчет или обработку только в том случае, если Вы доверяете"
"ее разработчику и контролируйте ограничения (программный идентификатор), накладываемые на"
"выданные разрешения.'");
	
	Параметры = ТаблицаПараметров();
	ДобавитьПараметр(Параметры, "ProgId", НСтр("ka='с программным идентификатором %1';ru='с программным идентификатором %1';en='with program identifier% 1'"), НСтр("ka='с любым программным идентификатором';ru='с любым программным идентификатором';en='with any software identifier'"));
	
	Значение = Новый Структура;
	Значение.Вставить("Представление", Представление);
	Значение.Вставить("Описание", Описание);
	Значение.Вставить("Последствия", Последствия);
	Значение.Вставить("Параметры", Параметры);
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипСозданиеCOMОбъекта(),
		Значение);
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}CreateComObject
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}AttachAddin
	
	Представление = НСтр("ka='Создание объекта внешней компоненту';ru='Создание объекта внешней компоненту';en='Creating an object of external components'");
	Описание = НСтр("ka='დამატებითი ანგარიშგებისთვის ან დამუშავებისთვის ნებადართული იქნება კონფიგურაციის მაკეტში მოწოდებული გარე კომპონენტის ობიექტის შექმნის მეშვეობით გარე პროგრამული უზრუნველყოფის მექანიზმების გამოყენება';ru='Дополнительному отчету или обработке будет разрешено использовать механизмы внешнего программного обеспечения с помощью создания объекта внешней компоненты, поставляемой в макете конфигурации';en='Additional reports or processing would be allowed to use the mechanisms of external software using object creation external components supplied to the layout configuration'");
	Последствия = НСтр("ka='ყურადღება! გარეშე პროგრამული უზრუნველყოფის საშუალებების გამოყენება შეიძლება გამოყენებული იქნას დამატებითი ანგარიშგების ან დამუშავების მიერ საინფორმაციო ბაზის ადმინისტრატორის მიერ გაუთვალისწინებელი მოქმედებების ჩასატარებლად, აგრეთვე, უსაფრთხო რეჟიმში დამატებით დამუშავებაზე მიბმული შეზღუდვების არასანქცირებულად გვერდის ასავლელად."
""
"მოცემული დამატებითი ანგარიშგება ან დამუშავება გამოიყენეთ მხოლოდ იმ შემთხვევაში, თუ ენდობით მის შემმუშავებელს და აკონტროლებთ გაცემულ ნებართვებზე მიბმულ შეზღუდვებს (მაკეტის სახელი, საიდანაც ხორციელდება გარე კომპონენტის შეერთება).';ru='Внимание! Использование средств стороннего программного обеспечения может использоваться"
"дополнительным отчетом или обработкой для совершения действий, не предполагаемых администратором"
"информационной базы, а также для несанкционированного обхода ограничений, накладываемых на дополнительную обработку"
"в безопасном режиме."
""
"Используйте данный дополнительный отчет или обработку только в том случае, если Вы доверяете"
"ее разработчику и контролируйте ограничения (имя макета, из которого выполняется подключение внешней"
"компоненты), накладываемые на выданные разрешения.'");
	
	Параметры = ТаблицаПараметров();
	ДобавитьПараметр(Параметры, "TemplateName", НСтр("ka='из макета %1';ru='из макета %1';en='Layout 1% of'"), НСтр("ka='из любого макета';ru='из любого макета';en='from any layout'"));
	
	Значение = Новый Структура;
	Значение.Вставить("Представление", Представление);
	Значение.Вставить("Описание", Описание);
	Значение.Вставить("Последствия", Последствия);
	Значение.Вставить("Параметры", Параметры);
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипПодключениеВнешнейКомпоненты(),
		Значение);
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}AttachAddin
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}GetFileFromExternalSoftware
	
	Представление = НСтр("ka='Получение файлов из внешнего объекта';ru='Получение файлов из внешнего объекта';en='Getting files from an external entity'");
	Описание = НСтр("ka='დამატებითი ანგარიშგებისთვის ან დამუშავებისთვის ნებადართული იქნება ფაილების მიღება გარე პროგრამული უზრუნველყოფიდან (მაგალითად, COM-შეერთების ან გარე კომპონენტის დახმარებით)';ru='Дополнительному отчету или обработке будет разрешено получать файлы из внешнего программного обеспечения (например, с помощью COM-соединения или внешней компоненты)';en='Additional reports or processing would be allowed to receive files from external software (e.g. via COM-compound or external components)'");
	
	Значение = Новый Структура;
	Значение.Вставить("Представление", Представление);
	Значение.Вставить("Описание", Описание);
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипПолучениеФайлаИзВнешнегоОбъекта(),
		Значение);
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}GetFileFromExternalSoftware
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SendFileToExternalSoftware
	
	Представление = НСтр("ka='Передача файлов во внешний объект';ru='Передача файлов во внешний объект';en='Transferring files to an external object'");
	Описание = НСтр("ka='დამატებითი ანგარიშგებისთვის ან დამუშავებისთვის ნებადართული იქნება ფაილების გადაცემა გარე პროგრამულ უზრუნველყოფაში (მაგალითად, COM-შეერთების ან გარე კომპონენტის დახმარებით)';ru='Дополнительному отчету или обработке будет разрешено передавать файлы во внешнее программное обеспечение (например, с помощью COM-соединения или внешней компоненты)';en='Additional reports or treatment will be allowed to transfer files to an external software (eg via COM-connection or external components)'");
	
	Значение = Новый Структура;
	Значение.Вставить("Представление", Представление);
	Значение.Вставить("Описание", Описание);
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипПередачаФайлаВоВнешнийОбъект(),
		Значение);
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SendFileToExternalSoftware
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SendFileToInternet
	
	Представление = НСтр("ka='დოკუმენტების გატარება';ru='Проведение документов';en='holding documents'");
	Описание = НСтр("ka='დამატებითი ანგარიშგებისთვის ან დამუშავებისთვის ნებადართული იქნება დოკუმენტების გატარებულობის მდგომარეობის შეცვლა';ru='Дополнительному отчету или обработке будет разрешено изменять состояние проведенности документов';en='Additional reports or treatment will be allowed to change the status of posted documents'");
	
	Параметры = ТаблицаПараметров();
	ДобавитьПараметр(Параметры, "DocumentType", НСтр("ka='დოკუმენტები %1 ტიპით';ru='документы с типом %1';en='documents with the type% 1'"), НСтр("ka='ნებისმიერი დოკუმენტები';ru='любые документы';en='any documents'"));
	ДобавитьПараметр(Параметры, "Action", НСтр("ka='разрешенное действие: %1';ru='разрешенное действие: %1';en='permited action: 1%'"), НСтр("ka='любое изменение состояния проведения';ru='любое изменение состояния проведения';en='any change in the status of'"));
	
	Значение = Новый Структура;
	Значение.Вставить("Представление", Представление);
	Значение.Вставить("Описание", Описание);
	Значение.Вставить("Параметры", Параметры);
	Значение.Вставить("ОтображатьПользователю", Неопределено);
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипПроведениеДокументов(),
		Значение);
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SendFileToInternet
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПараметр(Знач ТаблицаПараметров, Знач Имя, Знач Описание, Знач ОписаниеЛюбогоЗначения)
	
	Параметр = ТаблицаПараметров.Добавить();
	Параметр.Имя = Имя;
	Параметр.Описание = Описание;
	Параметр.ОписаниеЛюбогоЗначения = ОписаниеЛюбогоЗначения;
	
КонецПроцедуры

Функция ТаблицаПараметров()
	
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОписаниеЛюбогоЗначения", Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
