// ===============================================================================
// МОДУЛЬ ФОРМЫ - Универсальная обработка изменения дат документов
// ===============================================================================

#Область ПеременныеФормы

&НаКлиенте
Перем МассивРеквизитовДляУдаления;

&НаКлиенте
Перем ИмяРеквизитаФлажок;

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Процедура выполняет инициализацию формы при создании.
// Параметры:
//   Отказ (Булево) - признак отмены создания формы. Если Истина, создание формы будет отменено.
//   СтандартнаяОбработка (Булево) - признак стандартной обработки. Если Истина, будет выполнена стандартная обработка события.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокДокументов();
	
КонецПроцедуры

// Процедура выполняет действия при открытии формы.
// Параметры:
//   Отказ - признак отмены открытия формы.
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура вызывается при изменении значения фильтра "Организация".
// Параметры:
//   Элемент - элемент формы, вызвавший событие.
&НаКлиенте
Процедура ИспользоватьФильтрОрганизацияПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

// Процедура вызывается при изменении значения поля "ИмяДокумента".
// Параметры:
//   Элемент - элемент формы, вызвавший событие.
&НаКлиенте
Процедура ИмяДокументаПриИзменении(Элемент)
	
	ОбработатьИзменениеТипаДокумента();
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

// Процедура вызывается при изменении значения флажка.
// Параметры:
//   Элемент - элемент формы, вызвавший событие.
&НаКлиенте
Процедура ПриИзмененииФлажка(Элемент)

	Элементы[ПриИзмененииФлажкаНаСервере()].Доступность = ЭтотОбъект.AzRy_Флажок; 
	Элементы[ПриИзмененииФлажкаНаСервере()].АвтоОтметкаНезаполненного = ЭтотОбъект.AzRy_Флажок;
	
КонецПроцедуры

// Функция, вызываемая при изменении флажка на клиенте, для серверной логики.
// Возвращает:
//   Массив - массив реквизитов для удаления (предположительно).
&НаСервере
Функция ПриИзмененииФлажкаНаСервере()

	ТестовыйДокумент = Документы[ИмяДокумента].СоздатьДокумент();
		
	ИмяПеречисления = ТестовыйДокумент.ВидОперации.Метаданные().Имя;				
	
	azКонстанты = ПолучитьКонстантыДляСоздания();
	
	Возврат azКонстанты.ПрефиксРеквизита + ИмяПеречисления;	
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура-обработчик команды "УниверсальноИзменитьДаты".
// Параметры:
//   Команда - объект команды.
&НаКлиенте
Процедура УниверсальноИзменитьДатыКоманда(Команда)
	
	Если Не ПроверитьЗаполнениеПараметров() Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьПодтверждениеПользователя();
	
	//Если Не ПолучитьПодтверждениеПользователя() Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ВыполнитьИзменениеДатДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииКлиента

// Функция проверяет заполнение всех обязательных параметров формы.
// Возвращает:
//   Булево - Истина, если все параметры заполнены, иначе Ложь.
&НаКлиенте
Функция ПроверитьЗаполнениеПараметров()
	
	Если ПустаяСтрока(ИмяДокумента) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Не задано имя типа документа (например: РасходСоСчета).'; ka='დოკუმენტის ტიპის სახელი მითითებული არაა (მაგ.: გასავალი ანგარიშიდან).'"));
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаСтарая) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Поле «Старая дата» не заполнено!'; ka='ველი «ძველი თარიღი» ცარიელია!'"));
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаНовая) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Поле «Новая дата» не заполнено!'; ka='ველი «ახალი თარიღი» ცარიელია!'"));
		Возврат Ложь;
	КонецЕсли;
	
	Если ИспользоватьФильтрОрганизация И Не ЗначениеЗаполнено(Организация) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Поле «Организация» не заполнено!'; ka='ველი «ორგანიზაცია» ცარიელია!'"));
		Возврат Ложь;
	КонецЕсли;
		                                                      
	Если (МассивРеквизитовДляУдаления.Количество() > 0 И ЭтотОбъект[МассивРеквизитовДляУдаления[1]]) И Не ЗначениеЗаполнено(ЭтотОбъект[МассивРеквизитовДляУдаления[0]]) Тогда 
		ПоказатьПредупреждение(, НСтр("ru='Поле «Вид операций» не заполнено!'; ka='ველი «ოპერაციის ტიპი» ცარიელია!'"));
		Возврат Ложь;
	КонецЕсли;	
		
	Возврат Истина;
	
КонецФункции

// Функция запрашивает подтверждение пользователя на выполнение операции изменения дат.
// Возвращает:
//   Булево - Истина, если пользователь подтвердил выполнение, иначе Ложь.
&НаКлиенте
Функция ПолучитьПодтверждениеПользователя()
	
	ТекстВопроса = СтрШаблон(	
	    НСтр("ru = 'Изменить дату с %1 на %2 для документов типа 
	        |«%3»?
			|
	        |Продолжить выполнение операции?';
	        |ka = 'შეცვალოს თარიღი %1-დან %2-ზე  
	        |«%3»
			|ტიპის დოკუმენტებისთვის?
			|
	        |გავაგრძელოთ ოპერაციის შესრულება?';
	        |en = 'Change date from %1 to %2 for documents of type
	        |«%3»?
			|
	        |Continue operation?'"),
	    Формат(ДатаСтарая, "ДФ=dd.MM.yyyy"),
	    Формат(ДатаНовая, "ДФ=dd.MM.yyyy"),
	    ПолучитьСинонимДокумента(ИмяДокумента));
	
	//Возврат Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0) = КодВозвратаДиалога.Да;
    ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаОтветаПользователя", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОтветаПользователя(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		// Продолжить выполнение операции
		ВыполнитьИзменениеДатДокументов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСинонимДокумента(ИмяДокумента)
	
	МетДанные = Метаданные.Документы.Найти(ИмяДокумента);
	
	Возврат МетДанные.Синоним;

КонецФункции
 

// Процедура выполняет изменение дат документов на клиенте.
&НаКлиенте
Процедура ВыполнитьИзменениеДатДокументов()
	
	ПараметрыИзменения = СформироватьПараметрыИзменения();
	
	УниверсальноИзменитьДатыНаСервере(ПараметрыИзменения);
	
КонецПроцедуры

// Функция формирует структуру параметров для изменения дат документов.
// Возвращает:
//   Структура - параметры для изменения дат.
&НаКлиенте
Функция СформироватьПараметрыИзменения()
	
	ПараметрыИзменения = Новый Структура;
	ПараметрыИзменения.Вставить("ИмяДокумента", ИмяДокумента);
	ПараметрыИзменения.Вставить("ДатаСтарая", ДатаСтарая);
	ПараметрыИзменения.Вставить("ДатаНовая", ДатаНовая);
	ПараметрыИзменения.Вставить("ИспользоватьФильтрОрганизация", ИспользоватьФильтрОрганизация);
	ПараметрыИзменения.Вставить("ЗначениеОрганизация", Организация);
	//ПараметрыИзменения.Вставить("ИмяПоляВидОперации", ИмяПоляВидОперации);
	ПараметрыИзменения.Вставить("ЗначениеВидОперации", ЗначениеВидОперации);
	
	Возврат ПараметрыИзменения;
	
КонецФункции

// Процедура устанавливает доступность элементов формы в зависимости от выбранных параметров.
&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	Элементы.Организация.Доступность = ИспользоватьФильтрОрганизация;
	
КонецПроцедуры

// Процедура обрабатывает изменение типа документа.
&НаКлиенте
Процедура ОбработатьИзменениеТипаДокумента()
	
	МассивРеквизитовДляУдаления = ИмяДокументаПриИзмененииНаСервере(МассивРеквизитовДляУдаления, ИмяРеквизитаФлажок);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииСервера

// Процедура заполняет список выбора доступных документов.
&НаСервере
Процедура ЗаполнитьСписокДокументов()
	
	СписокВыбора = Элементы.ИмяДокумента.СписокВыбора;
	СписокВыбора.Очистить();
	
	Для Каждого МетаданныеДокумента Из Метаданные.Документы Цикл
		ТехническоеИмя = МетаданныеДокумента.Имя;
		Синоним = МетаданныеДокумента.Синоним;
		
		Представление = ?(ПустаяСтрока(Синоним), ТехническоеИмя, Синоним);
		
		СписокВыбора.Добавить(ТехническоеИмя, Представление);
	КонецЦикла;
	
	СписокВыбора.СортироватьПоПредставлению();
	
КонецПроцедуры

// Процедура выполняет изменение дат документов на сервере.
// Параметры:
//   ПараметрыИзменения (Структура) - структура с параметрами для изменения дат.
&НаСервере
Процедура УниверсальноИзменитьДатыНаСервере(Знач ПараметрыИзменения)
	
	Запрос = СформироватьЗапросПоискаДокументов(ПараметрыИзменения);
	РезультатЗапроса = Запрос.Выполнить();
	
	// For Debug
	// Запрос.Выполнить().Выгрузить().Количество();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить(НСтр("ru='Подходящих документов не найдено.'; ka='შესაბამისი დოკუმენტები ვერ მოიძებნა.'"));
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбновлениеДатДокументов(РезультатЗапроса, ПараметрыИзменения.ДатаНовая);
	
КонецПроцедуры

// Функция формирует запрос для поиска документов по заданным параметрам.
// Параметры:
//   ПараметрыИзменения (Структура) - структура с параметрами для запроса.
// Возвращает:
//   Запрос - сформированный объект запроса.
&НаСервере
Функция СформироватьЗапросПоискаДокументов(ПараметрыИзменения)
	
	ТекстЗапроса = СформироватьБазовыйТекстЗапроса(ПараметрыИзменения.ИмяДокумента);
	
	ДобавитьФильтрПоОрганизации(ТекстЗапроса, ПараметрыИзменения);
	ДобавитьФильтрПоВидуОперации(ТекстЗапроса, ПараметрыИзменения);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	УстановитьПараметрыЗапроса(Запрос, ПараметрыИзменения);
	
	Возврат Запрос;
	
КонецФункции

// Функция формирует базовый текст запроса для выборки документов.
// Параметры:
//   ИмяДокумента (Строка) - имя документа, для которого формируется запрос.
// Возвращает:
//   Строка - базовый текст запроса.
&НаСервере
Функция СформироватьБазовыйТекстЗапроса(ИмяДокумента)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата   КАК Дата
	|ИЗ
	|	Документ." + ИмяДокумента + " КАК Док
	|ГДЕ
	|	Док.Проведен = ИСТИНА
	|	И Док.Дата МЕЖДУ &ДатаНачало И &ДатаКонец"; 
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Процедура добавляет фильтр по организации в текст запроса, если это необходимо.
// Параметры:
//   ТекстЗапроса (Строка) - текст запроса, в который добавляется фильтр.
//   ПараметрыИзменения (Структура) - структура с параметрами для запроса.
&НаСервере
Процедура ДобавитьФильтрПоОрганизации(ТекстЗапроса, ПараметрыИзменения)
	
	Если Не ПараметрыИзменения.ИспользоватьФильтрОрганизация 
		Или ПустаяСтрока(ПараметрыИзменения.ЗначениеОрганизация) Тогда       
		Возврат;
	КонецЕсли;
	
	ПредставлениеОбъектаОрганизация = ПараметрыИзменения.ЗначениеОрганизация.Метаданные().ПредставлениеОбъекта;
	Если Не РеквизитСуществуетУДокумента(ПараметрыИзменения.ИмяДокумента, ПредставлениеОбъектаОрганизация) Тогда
		ТекстОшибки = СтрШаблон(
			НСтр("ru='У документа «%1» нет реквизита «%2». Фильтр по организации пропущен.'; ka='დოკუმენტს «%1» არ აქვს რეკვიზიტი «%2». ორგანიზციით ფილტრი გამოტოვებულია.'"),
			ПараметрыИзменения.ИмяДокумента,
			ПредставлениеОбъектаОрганизация);
		Сообщить(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И Док.Организация = &ЗначениеОрганизация";
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьФильтрПоВидуОперации(ТекстЗапроса, ПараметрыИзменения)
	
	КонстантыДляСоздания = ПолучитьКонстантыДляСоздания();
	
	Если Не РеквизитСуществует("AzRy_Флажок") Тогда
	//Если Не ЭтотОбъект.AzRy_Флажок 
	//	Или Не ЗначениеЗаполнено(ЭтотОбъект[КонстантыДляСоздания.ПрефиксРеквизита + ИмяПеречисления()]) Тогда
		Возврат;
	КонецЕсли;	
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И Док.ВидОперации = &ЗначениеВидОперации";
	
КонецПроцедуры

&НаСервере
Функция РеквизитСуществует(ИмяРеквизита)
	
	Попытка
		ТестовоеЗначение = ЭтотОбъект[ИмяРеквизита];
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Процедура устанавливает параметры в объект запроса.
// Параметры:
//   Запрос (Запрос) - объект запроса, в который устанавливаются параметры.
//   ПараметрыИзменения (Структура) - структура с параметрами для запроса.
&НаСервере
Процедура УстановитьПараметрыЗапроса(Запрос, ПараметрыИзменения)
	
	Запрос.УстановитьПараметр("ДатаНачало", НачалоДня(ПараметрыИзменения.ДатаСтарая));
	Запрос.УстановитьПараметр("ДатаКонец", КонецДня(ПараметрыИзменения.ДатаСтарая));
	
	Если ПараметрыИзменения.ИспользоватьФильтрОрганизация 
		И ЗначениеЗаполнено(ПараметрыИзменения.ЗначениеОрганизация) Тогда
		Запрос.УстановитьПараметр("ЗначениеОрганизация", ПараметрыИзменения.ЗначениеОрганизация);
	КонецЕсли;
	
	КонстантыДляСоздания = ПолучитьКонстантыДляСоздания();
	
	Если РеквизитСуществует("AzRy_Флажок") Тогда
	//Если ЭтотОбъект.AzRy_Флажок 
	//	Или ЗначениеЗаполнено(ЭтотОбъект[КонстантыДляСоздания.ПрефиксРеквизита + ИмяПеречисления()]) Тогда
		Запрос.УстановитьПараметр("ЗначениеВидОперации", ЭтотОбъект[КонстантыДляСоздания.ПрефиксРеквизита + ИмяПеречисления()]); 
	КонецЕсли;	
	
КонецПроцедуры

// Процедура выполняет обновление дат документов, найденных запросом.
// Параметры:
//   РезультатЗапроса (РезультатЗапроса) - результат выполнения запроса с документами.
//   НоваяДата (Дата) - новая дата, на которую будут установлены документы.
&НаСервере
Процедура ВыполнитьОбновлениеДатДокументов(РезультатЗапроса, НоваяДата)
	
	НачатьТранзакцию();
	
	Попытка
		КоличествоОбновленных = 0;
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ОбновитьДатуДокумента(Выборка.Ссылка, НоваяДата);
			КоличествоОбновленных = КоличествоОбновленных + 1;
		КонецЦикла;
		
		ТекстСообщения = СтрШаблон(НСтр("ru='Готово. Обновлено документов: %1'; ka='დასრულდა. განახლდა დოკუმენტები: %1'"), Формат(КоличествоОбновленных, "ЧГ="));
		Сообщить(ТекстСообщения);
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = СтрШаблон(НСтр("ru='Ошибка при изменении дат: %1'; ka='თარიღების შეცვლის შეცდომა: %1'"), ОписаниеОшибки());
		Сообщить(ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

// Процедура обновляет дату конкретного документа и записывает его.
// Параметры:
//   СсылкаДокумента (СсылкаДокумента) - ссылка на обновляемый документ.
//   НоваяДата (Дата) - новая дата для документа.
&НаСервере
Процедура ОбновитьДатуДокумента(СсылкаДокумента, НоваяДата)
	
	ОбъектДокумента = СсылкаДокумента.ПолучитьОбъект();
	ОбъектДокумента.Дата = КонецДня(НоваяДата);
	ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

// Функция обрабатывает изменение имени документа на сервере.
// Параметры:
//   МассивРеквизитовДляУдаления (Массив) - массив имен реквизитов для удаления.
//   П (Структура) - структура с параметрами (предположительно, для новых реквизитов).
// Возвращает:
//   Массив - обновленный массив реквизитов для удаления.
&НаСервере
Функция ИмяДокументаПриИзмененииНаСервере(Знач МассивРеквизитовДляУдаления, Знач П)
	
	ИспользоватьФильтрОрганизация = Ложь;
	
	
	ОбъектМетаданных = Метаданные.Документы.Найти(ИмяДокумента);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат МассивРеквизитовДляУдаления;
	КонецЕсли;
	
	УправлениеВидимостьюГруппОрганизации(ОбъектМетаданных);
	УправлениеВидимостьюГруппВидаОперации(ОбъектМетаданных, МассивРеквизитовДляУдаления, П);
	
	Возврат МассивРеквизитовДляУдаления;
	
КонецФункции

// Процедура управляет видимостью группы элементов, связанных с организацией.
// Параметры:
//   ОбъектМетаданных (МетаданныеОбъекта) - объект метаданных текущего документа.
&НаСервере
Процедура УправлениеВидимостьюГруппОрганизации(ОбъектМетаданных)
	
	ЕстьРеквизитОрганизация = (ОбъектМетаданных.Реквизиты.Найти("Организация") <> Неопределено);
	Элементы.Группа1.Видимость = ЕстьРеквизитОрганизация;
	
КонецПроцедуры

// Процедура управляет видимостью группы элементов, связанных с видом операции.
// Параметры:
//   ОбъектМетаданных (МетаданныеОбъекта) - объект метаданных текущего документа.
//   МассивРеквизитовДляУдаления (Массив) - массив имен реквизитов для удаления.
//   П (Структура) - структура с параметрами для новых реквизитов.
&НаСервере
Процедура УправлениеВидимостьюГруппВидаОперации(ОбъектМетаданных, МассивРеквизитовДляУдаления, П)
	
	РеквизитВидОперации = ОбъектМетаданных.Реквизиты.Найти("ВидОперации");
	
	Если РеквизитВидОперации = Неопределено Тогда
		УдалитьСуществующуюГруппуВидаОперации(МассивРеквизитовДляУдаления);
		Возврат;
	КонецЕсли;
	
	УдалитьСуществующуюГруппуВидаОперации(МассивРеквизитовДляУдаления);
	СоздатьГруппуВидаОперации(МассивРеквизитовДляУдаления, П);
	
КонецПроцедуры

// Процедура удаляет существующую группу элементов, связанную с видом операции, и её реквизиты.
// Параметры:
//   МассивРеквизитовДляУдаления (Массив) - массив имен реквизитов для удаления.
&НаСервере
Процедура УдалитьСуществующуюГруппуВидаОперации(МассивРеквизитовДляУдаления)
	
	ГруппаДляУдаления = Элементы.Найти("ГруппаОбычная");
	
	Если ГруппаДляУдаления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Удаляем дочерние элементы
	МассивДочерних = Новый Массив;
	Для Каждого ДочернийЭлемент Из ГруппаДляУдаления.ПодчиненныеЭлементы Цикл
		МассивДочерних.Добавить(ДочернийЭлемент);
	КонецЦикла;
	
	Для Каждого ЭлементДляУдаления Из МассивДочерних Цикл
		Элементы.Удалить(ЭлементДляУдаления);
	КонецЦикла;
	
	// Удаляем группу и реквизиты
	Элементы.Удалить(ГруппаДляУдаления);
	ИзменитьРеквизиты(, МассивРеквизитовДляУдаления);
	МассивРеквизитовДляУдаления.Очистить();
	
КонецПроцедуры

// Процедура создает новую группу элементов, связанную с видом операции, и её реквизиты.
// Параметры:
//   МассивРеквизитовДляУдаления (Массив) - массив имен реквизитов для удаления.
//   П (Структура) - структура с параметрами для новых реквизитов.
&НаСервере
Процедура СоздатьГруппуВидаОперации(МассивРеквизитовДляУдаления, П)
	
	ИмяПеречисления = ИмяПеречисления();
	
	Если ИмяПеречисления = "" Тогда
		Возврат;
	КонецЕсли;	
	
	СоздатьГруппуИРеквизиты(ИмяПеречисления, МассивРеквизитовДляУдаления, П);
	СоздатьЭлементыФормы(ИмяПеречисления);
	
КонецПроцедуры

&НаСервере
Функция ИмяПеречисления()
	
	ТестовыйДокумент = Документы[ИмяДокумента].СоздатьДокумент();
	
	Если ТипЗнч(ТестовыйДокумент.ВидОперации) = Тип("Строка") Тогда
		Возврат "";
	КонецЕсли;
		
	Возврат ТестовыйДокумент.ВидОперации.Метаданные().Имя;	

КонецФункции
 

// Процедура создает группу элементов и реквизиты формы для выбора вида операции.
// Параметры:
//   ИмяПеречисления (Строка) - имя перечисления, которое будет использоваться для создания реквизитов.
//   МассивРеквизитовДляУдаления (Массив) - массив имен реквизитов для удаления.
//   П (Структура) - структура с параметрами для новых реквизитов.
&НаСервере
Процедура СоздатьГруппуИРеквизиты(ИмяПеречисления, МассивРеквизитовДляУдаления, П)
	
	azКонстанты = ПолучитьКонстантыДляСоздания();
	
	// Создаем группу
	ГруппаВидОпераций = ЭтотОбъект.Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"), ЭтаФорма);
	НастроитьГруппу(ГруппаВидОпераций);
	
	// Создаем реквизиты
	ДобавляемыеРеквизиты = Новый Массив;
	
	ИмяРеквизитаПеречисления = azКонстанты.ПрефиксРеквизита + ИмяПеречисления;
	ИмяРеквизитаФлажка = azКонстанты.ПрефиксРеквизита + "Флажок";
	
	Реквизит1 = Новый РеквизитФормы(
		ИмяРеквизитаПеречисления,
		Новый ОписаниеТипов("ПеречислениеСсылка." + ИмяПеречисления),
		,
		НСтр("ru='Вид операций'; ka='ოპერაციის ტიპი'"),
		Истина);
		
	Реквизит2 = Новый РеквизитФормы(
		ИмяРеквизитаФлажка,
		Новый ОписаниеТипов("Булево"),
		,
		НСтр("ru='Использовать фильтр'; ka='ფილტრის გამოყენება'"),
		Истина);
		
	П = Новый Структура("Имя1, Имя2", ИмяРеквизитаПеречисления, ИмяРеквизитаФлажка);	
		
	ДобавляемыеРеквизиты.Добавить(Реквизит1);
	ДобавляемыеРеквизиты.Добавить(Реквизит2);
	
	МассивРеквизитовДляУдаления.Добавить(ИмяРеквизитаПеречисления);
	МассивРеквизитовДляУдаления.Добавить(ИмяРеквизитаФлажка);
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);  
	
КонецПроцедуры

// Функция возвращает структуру с константами, используемыми для создания элементов и реквизитов.
// Возвращает:
//   Структура - структура с константами.
&НаСервере
Функция ПолучитьКонстантыДляСоздания()
	
	azКонстанты = Новый Структура;
	azКонстанты.Вставить("ПрефиксРеквизита", "AzRy_");
	
	Возврат azКонстанты;
	
КонецФункции

// Процедура настраивает свойства группы элементов формы.
// Параметры:
//   ГруппаВидОпераций (ГруппаФормы) - объект группы формы.
&НаСервере
Процедура НастроитьГруппу(ГруппаВидОпераций)
	
	ГруппаВидОпераций.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВидОпераций.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаВидОпераций.ОтображатьЗаголовок = Ложь;
	ГруппаВидОпераций.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
КонецПроцедуры

// Процедура создает элементы формы для выбора вида операции.
// Параметры:
//   ИмяПеречисления (Строка) - имя перечисления, которое будет использоваться для создания элементов.
&НаСервере
Процедура СоздатьЭлементыФормы(ИмяПеречисления)
	
	azКонстанты = ПолучитьКонстантыДляСоздания();
	ГруппаВидОпераций = Элементы.Найти("ГруппаОбычная");
	
	ИмяРеквизитаПеречисления = azКонстанты.ПрефиксРеквизита + ИмяПеречисления;
	ИмяРеквизитаФлажка = azКонстанты.ПрефиксРеквизита + "Флажок";
	
	// Создаем элемент флажка
	ЭлементФлажок = Элементы.Добавить(
		ИмяРеквизитаФлажка + "_" + ИмяПеречисления,
		Тип("ПолеФормы"),
		ГруппаВидОпераций);
	ЭлементФлажок.ПутьКДанным = ИмяРеквизитаФлажка;
	ЭлементФлажок.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФлажок.УстановитьДействие("ПриИзменении", "ПриИзмененииФлажка"); 
	
	// Создаем элемент перечисления
	ЭлементПеречисления = Элементы.Добавить(
		ИмяРеквизитаПеречисления,
		Тип("ПолеФормы"),
		ГруппаВидОпераций);
	ЭлементПеречисления.ПутьКДанным = ИмяРеквизитаПеречисления;
	ЭлементПеречисления.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементПеречисления.Доступность = ЭтотОбъект.AzRy_Флажок;
	ЭлементПеречисления.Ширина = 40;
	
	Если ИмяДокумента = "РасходСоСчета" Тогда
	
		ЭтотОбъект.AzRy_Флажок = Истина;
		ЭтотОбъект.AzRy_ВидыОперацийРасходСоСчета = Перечисления.ВидыОперацийРасходСоСчета.Зарплата;
		ЭлементПеречисления.Доступность = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииСервераБезКонтекста

// Функция проверяет существование реквизита с указанным именем у документа.
// Параметры:
//   ИмяДокумента (Строка) - имя объекта метаданных документа.
//   ИмяРеквизита (Строка) - имя реквизита для проверки.
// Возвращает:
//   Булево - Истина, если реквизит существует, иначе Ложь.
&НаСервереБезКонтекста
Функция РеквизитСуществуетУДокумента(ИмяДокумента, ИмяРеквизита)
	
	Попытка
		МетаданныеДокумента = Метаданные.Документы[ИмяДокумента];
		Возврат (МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) <> Неопределено);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область Инициализация

МассивРеквизитовДляУдаления = Новый Массив;
ИмяРеквизитаФлажок = Новый Структура();

#КонецОбласти