
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	КассовыеСменыПереопределяемый.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	КассовыеСменыПереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	КассовыеСменыПереопределяемый.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

//+++ Дмгг, Для нумератора очереди
Процедура ПриЗаписи(Отказ)
	
	Если не Отказ Тогда 
		Если Ссылка.Статус = Перечисления.СтатусыКассовойСмены.Закрыта Тогда 
			НаботРаписейНумераторыЧековККМДляОчереди = РегистрыСведений.НумераторыЧековККМДляОчереди.СоздатьНаборЗаписей();
			НаботРаписейНумераторыЧековККМДляОчереди.Отбор.КассоваяСмена.Установить(Ссылка);
			НаботРаписейНумераторыЧековККМДляОчереди.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//--- Дмгг

#КонецОбласти

#КонецЕсли
