
&НаКлиенте
Процедура РасшAzRy_СотрудникиСотрудникПриИзмененииВместо(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	ТекущиеДанные.Период = ТекущаяДата();
	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийКадровоеПеремещение.ПеремещениеИИзменениеСпособаОплаты") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураСотрудник = Новый Структура();
	СтруктураСотрудник.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
	СтруктураСотрудник.Вставить("Период", ТекущиеДанные.Период);
	СтруктураСотрудник.Вставить("Организация", Объект.Организация);
	СтруктураСотрудник.Вставить("Ссылка", Объект.Ссылка);//Паганини
	
	ПолучитьДанныеСотрудника(СтруктураСотрудник);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтруктураСотрудник);
		
	ТекущиеДанные.ПрежнееПодразделение = СтруктураСотрудник.СтруктурнаяЕдиница;
	ТекущиеДанные.ПрежняяДолжность = СтруктураСотрудник.Должность;
	ТекущиеДанные.ПрежнееКоличествоЗанимаемыхСтавок = СтруктураСотрудник.ЗанимаемыхСтавок;
	ТекущиеДанные.ПрежнийГрафикРаботы = СтруктураСотрудник.ГрафикРаботы;
	//Паганини ПФ_
	ТекущиеДанные.ПрежнийУчастникПенсионногоФонда		= СтруктураСотрудник.УчастникПенсионногоФонда;
	ТекущиеДанные.ПрежнийВидУдержанияПФ					= СтруктураСотрудник.ВидУдержанияПФ;
	ТекущиеДанные.ПрежнийУчаствуетДобровольно 			= СтруктураСотрудник.УчаствуетДобровольно;
	//_Паганини ПФ
	// +++ { AzRy - [19.07.2022] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	ТекущиеДанные.AzRyDivision = СтруктураСотрудник.AzRyDivision;
	// +++ } AzRy - [19.07.2022] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СтруктурнаяЕдиница) Тогда
		ТекущиеДанные.СтруктурнаяЕдиница = ОсновноеПодразделение;
	КонецЕсли;	
		
КонецПроцедуры

&НаСервереБезКонтекста
&Вместо("ПолучитьДанныеСотрудника")
Процедура РасшAzRy_ПолучитьДанныеСотрудника(СтруктураСотрудник)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.Должность,
	|	СотрудникиСрезПоследних.ЗанимаемыхСтавок,
	//Паганини_
	|	СотрудникиСрезПоследних.УчастникПенсионногоФонда,
	|	СотрудникиСрезПоследних.ВидУдержанияПФ,
	|	СотрудникиСрезПоследних.УчаствуетДобровольно,
	//_Паганини
	|	СотрудникиСрезПоследних.ГрафикРаботы
	// +++ { AzRy - [19.07.2022] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,СотрудникиСрезПоследних.AzRyDivision
	// +++ } AzRy - [19.07.2022] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			&Период,
	|			Сотрудник = &Сотрудник
	//Паганини_
	|			И НЕ Регистратор = &Ссылка
	//_Паганини
	|				И Организация = &Организация) КАК СотрудникиСрезПоследних");
	
	Запрос.УстановитьПараметр("Период", СтруктураСотрудник.Период);
	Запрос.УстановитьПараметр("Сотрудник", СтруктураСотрудник.Сотрудник);
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(СтруктураСотрудник.Организация));
	Запрос.УстановитьПараметр("Ссылка", 	 СтруктураСотрудник.Ссылка);//Паганини
	
	СтруктураСотрудник.Вставить("СтруктурнаяЕдиница");
	СтруктураСотрудник.Вставить("Должность");
	СтруктураСотрудник.Вставить("ЗанимаемыхСтавок", 1);
	СтруктураСотрудник.Вставить("ГрафикРаботы");
	//Паганини_
	СтруктураСотрудник.Вставить("УчастникПенсионногоФонда");
	СтруктураСотрудник.Вставить("ВидУдержанияПФ");
	СтруктураСотрудник.Вставить("УчаствуетДобровольно");
	//_Паганини
	// +++ { AzRy - [19.07.2022] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	СтруктураСотрудник.Вставить("AzRyDivision");
	// +++ } AzRy - [19.07.2022] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураСотрудник, Выборка);
	КонецЦикла;

КонецПроцедуры
