
Процедура ДвиженияПродажиВВалютеПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	СсылкаНаДокумент = Источник.Отбор.Регистратор.Значение;
	ТаблицаПродажи = Источник.Выгрузить();
	
	Если Не Отказ И Замещение 
			И (ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказПокупателя") 
			//ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗакрытиеМесяца") 
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.КорректировкаРеализации") 
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.КорректировкаРегистров")    
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах")
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПриходнаяНакладная")
			//ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.РасходнаяНакладная")
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЧекККМ")
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЧекККМВозврат")) Тогда
			
		ПараметрыПроцедуры = Новый Структура("СсылкаНаДокумент,ТаблицаПродажи", СсылкаНаДокумент, ТаблицаПродажи);
		
		Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Или Истина Тогда // Отключено фоновое выполнение, чтобы не было блокировок
			
			СформироватьДвиженияПродажиВВалюте(СсылкаНаДокумент, ТаблицаПродажи, Ложь);
			
		Иначе
			
			ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
			ПараметрыВыполнения.КлючФоновогоЗадания = "ФормированиеДвиженийПродажиВВалюте";
			ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ka='მოძრაობის ფორმირება რეზერვები ვალუტაში';ru='Формирование движений Продажи в валюте';en='Formation of movements Sales in currency'");
			
			ДлительныеОперации.ВыполнитьВФоне(
				"ВалютныйУчетПродаж.СформироватьДвиженияПродажиВВалютеВФоне",
				ПараметрыПроцедуры,                                                                                                             
				ПараметрыВыполнения);
		
		КонецЕсли;
		 
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияПродажиВВалютеВФоне(ПараметрыПроцедуры, АдресХранилища) Экспорт
	
	СформироватьДвиженияПродажиВВалюте(ПараметрыПроцедуры.СсылкаНаДокумент, ПараметрыПроцедуры.ТаблицаПродажи);
	
КонецПроцедуры

Процедура СформироватьДвиженияПродажиВВалюте(СсылкаНаДокумент, ТаблицаПродажи, ЗаписыватьВЖурнал = Истина) Экспорт
	
	ИмяСобытия = "Формирование движений по регистру ПродажиВВалюте";
		
	НаборЗаписей = СсылкаНаДокумент.ПолучитьОбъект().Движения.ПродажиВВалюте;
	
	Если ТаблицаПродажи.Количество()>0 Тогда
	
		РезультатМассив = ПолучитьМассивРезультатов(ТаблицаПродажи);
		
		ОстановитьФормирование = Ложь;                 
		
		ВыборкаУпрВалюта = РезультатМассив[1].Выбрать();
		Если ВыборкаУпрВалюта.Следующий() Тогда       
			Если Не ЗначениеЗаполнено(ВыборкаУпрВалюта.ВалютаУправленческая) Тогда      
				ОстановитьФормирование = Истина;
				ТекстОшибки = "Не задана ""Валюта управленческая"" в регистре сведений ""Учетная политика (бух. учет)""";
				Если ЗаписыватьВЖурнал Тогда
					ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, СсылкаНаДокумент.Метаданные(), СсылкаНаДокумент, ТекстОшибки);
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;	
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ВыборкаУпрВалюта.ДатаНачалаУчетаПоУпрВалюте) Тогда  
				ОстановитьФормирование = Истина;
				ТекстОшибки = "Не задана ""Дата начала учета по управленческой валюте"" в регистре сведений ""Учетная политика (бух. учет)""";				
				Если ЗаписыватьВЖурнал Тогда
					ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, СсылкаНаДокумент.Метаданные(), СсылкаНаДокумент, ТекстОшибки);
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;	
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;    
		
		ВыборкаКурс = РезультатМассив[2].Выбрать();
		Если Не ВыборкаКурс.Следующий() Тогда
			ОстановитьФормирование = Истина;
			ТекстОшибки = СтрШаблон("Не задан курс валюты %1", ВыборкаУпрВалюта.ВалютаУправленческая);
			Если ЗаписыватьВЖурнал Тогда
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, СсылкаНаДокумент.Метаданные(), СсылкаНаДокумент, ТекстОшибки);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
		
		Если ОстановитьФормирование Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого ТекСтр Из ТаблицаПродажи Цикл
			НовСтр = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
			НовСтр.СуммаВал = ТекСтр.Сумма * ВыборкаКурс.Кратность / ВыборкаКурс.Курс;
			НовСтр.СуммаНДСВал = ТекСтр.СуммаНДС * ВыборкаКурс.Кратность / ВыборкаКурс.Курс;
			НовСтр.СебестоимостьВал = ТекСтр.Себестоимость * ВыборкаКурс.Кратность / ВыборкаКурс.Курс;
		КонецЦикла;		
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("ФормироватьПроводки", Истина);
		НаборЗаписей.Записывать = Истина;
		
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Если ЗаписыватьВЖурнал Тогда
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, СсылкаНаДокумент.Метаданные(), СсылкаНаДокумент, ТекстОшибки);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
		КонецПопытки;
		
	Иначе
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();   
		
	КонецЕсли; 
		
КонецПроцедуры

Функция ПолучитьМассивРезультатов(ТаблицаПродажи)
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетнаяПолитикаРеглСрезПоследних.ВалютаУправленческая КАК ВалютаУправленческая,
	               |	УчетнаяПолитикаРеглСрезПоследних.ДатаНачалаУчетаПоУпрВалюте КАК ДатаНачалаУчетаПоУпрВалюте
	               |ПОМЕСТИТЬ втУчетнаяПолитика
	               |ИЗ
	               |	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&НаДату, ) КАК УчетнаяПолитикаРеглСрезПоследних
	               |ГДЕ
	               |	УчетнаяПолитикаРеглСрезПоследних.ВестиУчетВУпрВалюте
	               |	И УчетнаяПолитикаРеглСрезПоследних.ДатаНачалаУчетаПоУпрВалюте <= &НаДату
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втУчетнаяПолитика.ВалютаУправленческая КАК ВалютаУправленческая,
	               |	втУчетнаяПолитика.ДатаНачалаУчетаПоУпрВалюте КАК ДатаНачалаУчетаПоУпрВалюте
	               |ИЗ
	               |	втУчетнаяПолитика КАК втУчетнаяПолитика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Курс КАК Курс,
	               |	КурсыВалютСрезПоследних.Кратность КАК Кратность
	               |ИЗ
	               |	втУчетнаяПолитика КАК втУчетнаяПолитика
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, ) КАК КурсыВалютСрезПоследних
	               |		ПО втУчетнаяПолитика.ВалютаУправленческая = КурсыВалютСрезПоследних.Валюта
	               |ГДЕ
	               |	НЕ КурсыВалютСрезПоследних.Курс = 0
	               |	И НЕ КурсыВалютСрезПоследних.Кратность = 0";    
	Запрос.УстановитьПараметр("НаДату", ТаблицаПродажи[0].Период);    
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("ПустаяВалюта", Справочники.Валюты.ПустаяСсылка());    
	Возврат Запрос.ВыполнитьПакет();
			
КонецФункции

