#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	// Биллинг
	ДоговорОбслуживанияНаправлениеДеятельности = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		// Программное заполнение по методу Заполнить()
		
		СтандартнаяОбработка = Ложь;
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Покупатель,Поставщик,ПрочиеОтношения");
		
		ОрганизацияПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
		Если Не ЗначениеЗаполнено(ОрганизацияПоУмолчанию) Тогда
			ОрганизацияПоУмолчанию = Справочники.Организации.ОсновнаяОрганизация;
		КонецЕсли;
		
		Наименование		= НСТР("ka='ძირითადი ხელშეკრულება';ru='Основной договор';en='main contract'");
		ВалютаРасчетов		= УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту();//Константы.НациональнаяВалюта.Получить();
		Организация			= ОрганизацияПоУмолчанию;
		ВидЦен				= Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи();
		Владелец			= ДанныеЗаполнения;
		СрокОплатыПоставщику = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("СрокОплатыПоставщику");//Константы.СрокОплатыПоставщику.Получить();
		СрокОплатыПокупателя = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("СрокОплатыПокупателя");//Константы.СрокОплатыПокупателя.Получить();
		ДопустимыйЛимитЗадолженностиОтПокупателя = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("КонтрольДебиторскойЗадолженности");//++Lazare 23.06.2022
		ВидДоговора			= Перечисления.ВидыДоговоров.СПокупателем;
		Если ЗначенияРеквизитов.Поставщик И Не ЗначенияРеквизитов.Покупатель Тогда
			ВидДоговора		= Перечисления.ВидыДоговоров.СПоставщиком;
		ИначеЕсли ЗначенияРеквизитов.ПрочиеОтношения И Не ЗначенияРеквизитов.Покупатель И Не ЗначенияРеквизитов.Поставщик Тогда
			ВидДоговора		= Перечисления.ВидыДоговоров.Прочее;
		КонецЕсли;
		//Paganini_{
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПриИзминенииИлиСозданииКонтрагентаОбновлениеАдресаИТелефонаВОсновномДоговоре") Тогда
			АресаКонтрагента 	= Владелец.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ВидыКонтактнойИнформации", "ФактАдресКонтрагента")));
			//АресаКонтрагента.Сортировать("НомерСтроки")
			Если АресаКонтрагента.Количество() > 0 Тогда
				Адрес 	= АресаКонтрагента[0].Представление;
			КонецЕсли;
			ТелефоныКонтрагента = Владелец.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
			Если ТелефоныКонтрагента.Количество() > 0 Тогда
				Телефон = ТелефоныКонтрагента[0].Представление;
			КонецЕсли;
		КонецЕсли;
		//}_Paganini
		
		// Заполним вид цен котрагента
		Если ПолучитьФункциональнуюОпцию("УчетЦенКонтрагентов") Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			
			НовыйВидЦенКонтрагентов = Справочники.ВидыЦенКонтрагентов.ВидЦенКонтрагентаПоУмолчанию(ДанныеЗаполнения);
			Если НЕ ЗначениеЗаполнено(НовыйВидЦенКонтрагентов) Тогда 
				
				НовыйВидЦенКонтрагентов = Справочники.ВидыЦенКонтрагентов.НайтиЛюбойПервыйВидЦенКонтрагента(ДанныеЗаполнения);
				
				Если НЕ ЗначениеЗаполнено(НовыйВидЦенКонтрагентов) Тогда
					
					НовыйВидЦенКонтрагентов = Справочники.ВидыЦенКонтрагентов.СоздатьВидЦенКонтрагента(ДанныеЗаполнения, ВалютаРасчетов);
					
				КонецЕсли;
				
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Ложь);
			
			ВидЦенКонтрагента = НовыйВидЦенКонтрагентов;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вид цен.
	Если ЗначениеЗаполнено(ВидСкидкиНаценки) Тогда
		ПроверяемыеРеквизиты.Добавить("ВидЦен");
	КонецЕсли;
	
	// Биллинг
	Если ЭтоДоговорОбслуживания Тогда
		ПроверяемыеРеквизиты.Добавить("ВидЦен");
		ПроверяемыеРеквизиты.Добавить("ДоговорОбслуживанияДатаНачала");
		ПроверяемыеРеквизиты.Добавить("ДоговорОбслуживанияТарифныйПлан");
		ПроверяемыеРеквизиты.Добавить("ДоговорОбслуживанияПериодичность");
	КонецЕсли;
	
	Если УчитыватьНДФЛ Тогда//Паганини
		ПроверяемыеРеквизиты.Добавить("ВидУдержанияНДФЛ");
		ПроверяемыеРеквизиты.Добавить("ВидВыдачиНДФЛ");
		ПроверяемыеРеквизиты.Добавить("КатегорияПолучателейДоходов");
	КонецЕсли;
	Если ЗначениеЗаполнено(ТорговыйПредставитель) Тогда
		ПроверяемыеРеквизиты.Добавить("ТранспортноеСредство");
		ПроверяемыеРеквизиты.Добавить("Водитель");
		ПроверяемыеРеквизиты.Добавить("Адрес");
		//Таблица_ФактическикАдресов = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресДоговорыКонтрагентов")));
		//Если Таблица_ФактическикАдресов.Количество() = 0 Тогда
		//	ТекстСообщения = НСтр("ka='ველი ""მისამართი"" არ არის შევსებული';ru='Поле ""Адрес"" не заполнено';en='""Address"" field is not filled'");
		//	УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, , , , Отказ);
		//КонецЕсли;
		Если ЗначениеЗаполнено(Водитель) И НЕ ЗначениеЗаполнено(Водитель.ИНН) Тогда
			ТекстСообщения = НСтр("ka='ველი ""ს/ნ"" არ არის შევსებული ცნობარში ""მძროლი""';ru='Поле ""ИНН"" не заполнено в справочнике водителя';en='The ""inn"" is not filled in the driver''s handbook'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		
		ЗначенияРеквизитовКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "ПометкаУдаления, ДоговорПоУмолчанию");
		
		Если Не ЗначенияРеквизитовКонтрагента.ПометкаУдаления И ЗначенияРеквизитовКонтрагента.ДоговорПоУмолчанию = Ссылка Тогда
			ТекстСообщения = НСтр("ka='ძირითად ხელშეკრულებად დაყენებული კონტრაგენტის ხელშეკრულების წასაშლელად მონიშვნა არ შეიძლება.';ru='Договор контрагента, установленный в качестве основного, не может быть помечен на удаление.';en='company contract, established as the core, can not be marked for deletion.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка <> &Ссылка
	|	И ДоговорыКонтрагентов.Владелец = &Владелец
	|	И НЕ ДоговорыКонтрагентов.Владелец.ВестиРасчетыПоДоговорам");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекстСообщения = НСтр("ka='კონტრაგენტისთვის ხელშეკრულებების მიხედვით აღრიცხვა არ წარმოებს.';ru='Для контрагента не ведется учет по договорам.';en='For the counterparty does not keep records on the contracts.'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			ЭтотОбъект,
			ТекстСообщения,
			,
			,
			,
			Отказ
		);
	КонецЕсли;
	
	// Биллинг
	Если ЭтоДоговорОбслуживания И ЭтоНовый()
		ИЛИ ЭтоДоговорОбслуживания И НЕ ЭтоНовый() И НЕ Ссылка.ЭтоДоговорОбслуживания Тогда
		
		ИспользоватьНаправленияДеятельности = Константы.БиллингВестиУчетРасходовПоДоговорамОбслуживания.Получить();
		Если ИспользоватьНаправленияДеятельности Тогда
			ДоговорОбслуживанияНаправлениеДеятельности = 
				Справочники.ДоговорыКонтрагентов.СоздатьНаправлениеДеятельностиДляДоговораОбслуживания(Владелец, Наименование);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ДополнительныеСвойства.Вставить("ПометкаУдаления", Ссылка.ПометкаУдаления);
	Иначе  
		//+++ Дмгг
		Если Не ЗначениеЗаполнено(КатегорияПолучателейДоходов) Тогда 
			КатегорияПолучателейДоходов = 26;
		КонецЕсли;
		//--- Дмгг
	КонецЕсли;
	
	//Паганини_
	Если НЕ УчитыватьНДФЛ И ЗначениеЗаполнено(ВидУдержанияНДФЛ) Тогда
		ВидУдержанияНДФЛ = Неопределено;
	КонецЕсли;
	//_Паганини
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Биллинг
	Если ЭтоДоговорОбслуживания Тогда
		Если ЗначениеЗаполнено(ДоговорОбслуживанияНаправлениеДеятельности) Тогда
			// Если договор помечается (снимается пометка) на удаление, так же помечаем и связанное с ним направление деятельности.
			Если ДополнительныеСвойства.Свойство("ПометкаУдаления") Тогда
				Если ДополнительныеСвойства.ПометкаУдаления = Ложь И ПометкаУдаления = Истина
					ИЛИ ДополнительныеСвойства.ПометкаУдаления = Истина И ПометкаУдаления = Ложь Тогда
					
					НаправлениеДеятельностиОбъект = ДоговорОбслуживанияНаправлениеДеятельности.ПолучитьОбъект();
					НаправлениеДеятельностиОбъект.ПометкаУдаления = ПометкаУдаления;
					НаправлениеДеятельностиОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ Тогда 
		
		Если ПолучитьФункциональнуюОпцию("ФункциональнаяОпцияИспользоватьИсториюНалогообложенияКонтрагентов") Тогда 
			
			ДобавитьЗаписть_РС_НалогообложенияКонтрагентов(Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьНаименование() Экспорт
	
	Если Не ПустаяСтрока(НомерДоговора) Тогда
		Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='№ %1 %2 (%3)';ru='№ %1 %2 (%3)';en='№% 1% 2 (3%)'"),
			СокрЛП(НомерДоговора),
			?(ЗначениеЗаполнено(ДатаДоговора), "от " + Формат(ДатаДоговора, "ДЛФ=D"), ""),
			Строка(ВалютаРасчетов));
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЗаписть_РС_НалогообложенияКонтрагентов(Отказ)

	тзНалогообложения = РегистрыСведений.НалогообложениеКонтрагентов.СрезПоследних(ТекущаяДата(), Новый Структура("Контрагент, Договор", Владелец, Ссылка));
	
	Если тзНалогообложения.Количество() = 0 Тогда 
		
		
		НаборЗаписейНалогообложения = РегистрыСведений.НалогообложениеКонтрагентов.СоздатьНаборЗаписей();
		НаборЗаписейНалогообложения.Отбор.Контрагент.Установить(Владелец);
		НаборЗаписейНалогообложения.Отбор.Договор.Установить(Ссылка);
		НаборЗаписейНалогообложения.Отбор.Период.Установить(НачалоГода(ТекущаяДата()));
		
		НоваяЗапись = НаборЗаписейНалогообложения.Добавить();
		
		НоваяЗапись.Период 				= НачалоГода(ТекущаяДата());
		НоваяЗапись.Договор 			= Ссылка;
		НоваяЗапись.Контрагент 			= Владелец;
		НоваяЗапись.НалогообложениеНДС 	= Владелец.НалогообложениеНДС;
		
		Если НоваяЗапись.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда	
		    НоваяЗапись.СтавкаНДС 		= УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
		ИначеЕсли НоваяЗапись.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
			НоваяЗапись.СтавкаНДС 		= УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
		Иначе
			НоваяЗапись.СтавкаНДС		= УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
		КонецЕсли;
		
		Попытка
			НаборЗаписейНалогообложения.Записать();
		Исключение
			Отказ = Истина;
		КонецПопытки;
		
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
