Функция ПолучитьSLLСоединение() Экспорт 
	
	SLL = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(),Новый СертификатыУдостоверяющихЦентровWindows());
	
	Возврат SLL;
	
КонецФункции

Функция ПолучитьWSОпределение(РежимПротокола = Неопределено) Экспорт 
	
	SLL = ПолучитьSLLСоединение();
	
	#Если Сервер Тогда
		Если РежимПротокола = Перечисления.РС_ВидыРежимовПротокола.http Тогда 
			Возврат Новый WSОпределения("http://services.rs.ge/WayBillService/WayBillService.asmx?wsdl", "");
		Иначе 
			Возврат Новый WSОпределения("https://services.rs.ge/WayBillService/WayBillService.asmx?wsdl", "",,,,SLL);
		КонецЕсли;
	#Иначе
		Если глОпределение = Неопределено Тогда
			Если РежимПротокола = Перечисления.РС_ВидыРежимовПротокола.http Тогда 
				глОпределение = Новый WSОпределения("http://services.rs.ge/WayBillService/WayBillService.asmx?wsdl", "");
			Иначе 
				глОпределение = Новый WSОпределения("https://services.rs.ge/WayBillService/WayBillService.asmx?wsdl", "",,,,SLL);
			КонецЕсли;
		КонецЕсли;
		Возврат	глОпределение;
	#КонецЕсли
	
КонецФункции

Функция ПолучитьWSОпределениеСФ(РежимПротокола = Неопределено) Экспорт 
	
	SLL = ПолучитьSLLСоединение();
	
	#Если Сервер Тогда
		Если РежимПротокола = Перечисления.РС_ВидыРежимовПротокола.http Тогда 
			Возврат Новый WSОпределения("http://www.revenue.mof.ge/ntosservice/ntosservice.asmx?wsdl", "");
		Иначе 
			Возврат Новый WSОпределения("https://www.revenue.mof.ge/ntosservice/ntosservice.asmx?wsdl", "",,,,SLL);
		КонецЕсли;
	#Иначе
		Если глОпределение = Неопределено Тогда
			Если РежимПротокола = Перечисления.РС_ВидыРежимовПротокола.http Тогда 
				глОпределение = Новый WSОпределения("http://www.revenue.mof.ge/ntosservice/ntosservice.asmx?wsdl", "");
			Иначе 
				глОпределение = Новый WSОпределения("https://www.revenue.mof.ge/ntosservice/ntosservice.asmx?wsdl", "",,,,SLL);
			КонецЕсли;
		КонецЕсли;
		Возврат	глОпределение;
	#КонецЕсли
	
КонецФункции

Функция ПолучитьСтруктуруПараметровWS(Организация = Неопределено) Экспорт
	
	СтруктураИнициализации = Новый Структура;
	СтруктураИнициализации.Вставить("ПользовательПодключения","");
	СтруктураИнициализации.Вставить("ПарольПодключения","");
	СтруктураИнициализации.Вставить("РежимовПротоколаДляОбменаRS","");
	
	Если Организация = Неопределено Тогда 
		Организация = РегламентированнаяОтчетность.ПолучитьОрганизациюПоУмолчанию();//РС_ИнтеграцияСНалоговойСлужбойГрузииПовтИсп
	КонецЕсли;
	
	Если Организация.МногопользовательскийРежимОбменаRS Тогда 
		Отбор = Новый Структура;
		//Отбор.Вставить("Организация", Организация);
		Отбор.Вставить("Пользователь", Пользователи.ТекущийПользователь());
		ВыборкаТекПараметрыПользователья = РегистрыСведений.РС_ПользователиИнтеграцийНалоговойСлужбы.Выбрать(Отбор);
		Если ВыборкаТекПараметрыПользователья.Следующий() Тогда  
			СтруктураИнициализации.ПользовательПодключения		= ВыборкаТекПараметрыПользователья.ПользовательПодключения;
			СтруктураИнициализации.ПарольПодключения			= ВыборкаТекПараметрыПользователья.ПарольПодключения;
			СтруктураИнициализации.РежимовПротоколаДляОбменаRS  = ?(ЗначениеЗаполнено(Организация.РежимовПротоколаДляОбменаRS), Организация.РежимовПротоколаДляОбменаRS, Перечисления.РС_ВидыРежимовПротокола.http);
		Иначе 
			Сообщить(НСтр("ka='არ არის ნაპოვნი სერვისის მომხმარებელი პროგრამის მიმდინარე მომხმარებლისთვის.';ru='Не найдены настройки сервиса для текущего пользователя.'"));
		КонецЕсли;
	Иначе 
		СтруктураИнициализации.ПользовательПодключения		= Организация.ПользовательПодключения;
		СтруктураИнициализации.ПарольПодключения			= Организация.ПарольПодключения;
		СтруктураИнициализации.РежимовПротоколаДляОбменаRS  = ?(ЗначениеЗаполнено(Организация.РежимовПротоколаДляОбменаRS), Организация.РежимовПротоколаДляОбменаRS, Перечисления.РС_ВидыРежимовПротокола.http);
	КонецЕсли;
	Возврат СтруктураИнициализации;
	
КонецФункции

Функция ПодсистемаДоступна_ИнтеграцияСНалоговойСлужбойГрузии() Экспорт
	
	Возврат (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("РаботаСМодулемИнтеграцииRSGE"));
	
КонецФункции