
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ)
		
	Если НЕ Отказ Тогда
		
		Если НЕ ЗначениеЗаполнено(НаборСвойствХарактеристики) Тогда
			ОбъектНабора = Справочники.НаборыДополнительныхРеквизитовИСведений.СоздатьЭлемент();
		Иначе
			ОбъектНабора = НаборСвойствХарактеристики.ПолучитьОбъект();
			ЗаблокироватьДанныеДляРедактирования(ОбъектНабора.Ссылка);
		КонецЕсли;

		ОбъектНабора.Наименование    = Наименование;
		ОбъектНабора.Родитель        = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ХарактеристикиНоменклатуры;
		ОбъектНабора.ПометкаУдаления = ПометкаУдаления;
		ОбъектНабора.Записать();
		НаборСвойствХарактеристики = ОбъектНабора.Ссылка;
		
	КонецЕсли;	
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриКопировании.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	НаборСвойствХарактеристики = Неопределено;
	
КонецПроцедуры // ПриКопировании()
