
#Область ПрограммныйИнтерфейс

// ფუნქცია ბრძანების დასახელების მიხედვით გადასცემს მოწყობილობას შესაბამის ბრძანებას
// Функция получает, обрабатывает и перенаправляет на исполнение команду к драйверу
//
Функция ВыполнитьКоманду(Команда, ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено, ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт
	
	Результат = Истина;
	
	ВыходныеПараметры = Новый Массив;
	
		
	// Тестирование устройства
	Если Команда = "ТестУстройства" ИЛИ Команда = "CheckHealth" Тогда
		
		Результат = ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Получение версии драйвера
	ИначеЕсли Команда = "GetVersion"  ИЛИ Команда = "ПолучитьВерсиюДрайвера" Тогда
		
		Результат = ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Получение описание драйвера.
	ИначеЕсли Команда = "ПолучитьОписаниеДрайвера" ИЛИ Команда = "GetDescription" Тогда
		
		
	// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩИЕ ДЛЯ РАБОТЫ С УСТРОЙСТВАМИ ВВОДА ДАННЫХ
	
	// Обработка события от устройства.
	ИначеЕсли Команда = "ОбработатьСобытие" Тогда
		Событие = ВходныеПараметры[0];
		Данные  = ВходныеПараметры[1];
		
	// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩИЕ ДЛЯ РАБОТЫ С ЭКВАЙРИНГОВЫМИ ТЕРМИНАЛАМИ
	
	// Функция возвращает, будет ли печать слип чеков на терминале.
	ИначеЕсли Команда = "PrintSlipOnTerminal" ИЛИ Команда = "ПечатьКвитанцийНаТерминале" Тогда
		Результат = ПечатьКвитанцийНаТерминале(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	// Печать чека коррекции
	ИначеЕсли Команда = "PrintReceiptCorrection" ИЛИ Команда = "ПечатьЧекаКоррекции" Тогда
		
	// Оплата платежной картой	
	ИначеЕсли Команда = "AuthorizeSales" ИЛИ Команда = "ОплатитьПлатежнойКартой" Тогда
		
		Результат = AuthorizeSales(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	// Преавторизация платежа
	ИначеЕсли Команда = "AuthorizePreSales" ИЛИ Команда = "ПреавторизацияПоПлатежнойКарте" Тогда
		Сумма      = ВходныеПараметры[0];
		НомерКарты = ВходныеПараметры[1];
		НомерЧека  = ?(ВходныеПараметры.Количество() > 2, ВходныеПараметры[2], "");
		
	// Отмена преавторизации платежа.
	ИначеЕсли Команда = "AuthorizeVoidPreSales" ИЛИ Команда = "ОтменитьПреавторизациюПоПлатежнойКарте" Тогда
		Сумма          = ВходныеПараметры[0];
		НомерКарты     = ВходныеПараметры[1];
		СсылочныйНомер = ?(ВходныеПараметры.Количество() > 2, ВходныеПараметры[2], "");
		НомерЧека      = ?(ВходныеПараметры.Количество() > 3, ВходныеПараметры[3], "");
		
	// Завершение преавторизации платежа.
	ИначеЕсли Команда = "AuthorizeCompletion" ИЛИ Команда = "ЗавершитьПреавторизациюПоПлатежнойКарте" Тогда
		Сумма          = ВходныеПараметры[0];
		НомерКарты     = ВходныеПараметры[1];
		СсылочныйНомер = ?(ВходныеПараметры.Количество() > 2, ВходныеПараметры[2], "");
		НомерЧека      = ?(ВходныеПараметры.Количество() > 3, ВходныеПараметры[3], "");
		
		
	// Возврат платежа
	ИначеЕсли Команда = "AuthorizeRefund" ИЛИ Команда = "ВернутьПлатежПоПлатежнойКарте" Тогда
		Сумма          = ВходныеПараметры[0];
		НомерКарты     = ВходныеПараметры[1];
		СсылочныйНомер = ?(ВходныеПараметры.Количество() > 2, ВходныеПараметры[2], "");
		НомерЧека      = ?(ВходныеПараметры.Количество() > 3, ВходныеПараметры[3], "");
		
		Результат = AuthorizeRefund(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	// Отмена платежа
	ИначеЕсли Команда = "AuthorizeVoid" ИЛИ Команда = "ОтменитьПлатежПоПлатежнойКарте" Тогда
		Сумма          = ВходныеПараметры[0];
		СсылочныйНомер = ВходныеПараметры[1];
		НомерЧека      = ?(ВходныеПараметры.Количество() > 2, ВходныеПараметры[2], "");
		
		Результат = AuthorizeVoid(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Закрытие документа - который завис не закрытым в банке и мешает закрытию дня
	ИначеЕсли Команда = "CloseDoc" ИЛИ Команда = "ЗакрытьДокумент" Тогда
		
		Результат = CloseDoc(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "КраткийОтчет"  Тогда
		
		Результат = КраткийОтчет(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "ПолныйОтчет" Тогда
		
		Результат = ПолныйОтчет(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "КопияЧека" Тогда
		
		Результат = КопияЧека(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "ПроверкаСоеденений" Тогда
		
		Результат = ПроверкаСоеденений(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "Settlement" или Команда = "ИтогиДняПоКартам" Тогда
		
		Результат = ИтогиДняПоКартам(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);

			
	// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩИЕ ДЛЯ РАБОТЫ С ДИСПЛЕЯМИ ПОКУПАТЕЛЯ
	
	// Вывод строк на дисплей
	ИначеЕсли Команда = "DisplayText" ИЛИ Команда = "ВывестиСтрокуНаДисплейПокупателя" Тогда
		СтрокаТекста = ВходныеПараметры[0];
		
	// Очистка дисплея
	ИначеЕсли Команда = "ClearText" ИЛИ Команда = "ОчиститьДисплейПокупателя" Тогда

	// Получить параметры вывода
	ИначеЕсли Команда = "GetOutputOptions" ИЛИ Команда = "ПолучитьПараметрыВывода" Тогда
		
		
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает возможность работы модуля в асинхронном режиме.
// Стандартные команды модуля:
// - ПодключитьУстройство
// - ОтключитьУстройство
// - ВыполнитьКоманду
// Команды модуля для работы асинхронном режиме (должны быть определены):
// - НачатьПодключениеУстройства
// - НачатьОтключениеУстройства
// - НачатьВыполнениеКоманды.
//
Функция ПоддержкаАсинхронногоРежима() Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти //ПрограммныйИнтерфейс

#Область Команды_Эквайрингового_Терминала

Функция ВозвратВходныеПараметры(Идентификатор, впСуммаЭС, МетодОплаты, ПериодРасрочки = 0, СуммаДляВозврата, НомерСсылкы, КодАвторизации, ВидОплатыДляВозврата, КодОперацииЭС, CashbackAmount)
	
	Параметры = Новый Структура;

	Параметры.Вставить("Сумма" , 			впСуммаЭС);	
	//Параметры.Вставить("ДокументОбъект", 	ЭтотОбъект);
	//Параметры.Вставить("Объект", 			впСтрокаЭС.млЭС.Объект);
	//Параметры.Вставить("КассаККМ"     , 	КассаККМ);     //     впСтрокаЭС.КассаККМ
	//Параметры.Вставить("COMПорт"      , 	впСтрокаЭС.млЭС.порт);	//впСтрокаЭС.Порт
	//Параметры.Вставить("Скорость"      ,    впСтрокаЭС.млЭС.Скорость);
	//Параметры.Вставить("TerminalID"      , 	впСтрокаЭС.млЭС.TerminalID);
	////დაბრუნების შემთხვევაში
	////Параметры.Вставить("СуммаДляВозврата"   ,ЧекККМ.СуммаЭС);
	////Параметры.Вставить("НомерСсылкы"        ,ЧекККМ.НомерСсылкыЭС);
	////Параметры.Вставить("КодАвторизации"     ,ЧекККМ.КодАвторизацииЭС);
	//Параметры.Вставить("СуммаДляВозврата"   ,0);   
	Параметры.Вставить("НомерСсылкы"      	,НомерСсылкы);  
	Параметры.Вставить("КодАвторизации"     ,КодАвторизации);  
	Параметры.Вставить("МетодОплаты"        ,МетодОплаты); 
	Параметры.Вставить("ПериодРасрочки"     ,ПериодРасрочки); 
	Параметры.Вставить("СуммаДляВозврата"   ,СуммаДляВозврата); 
	Параметры.Вставить("ВидОплатыДляВозврата"   ,ВидОплатыДляВозврата); 
	Параметры.Вставить("КодОперацииЭС"   ,КодОперацииЭС); 
	Параметры.Вставить("CashbackAmount"   ,CashbackAmount); 
	
	Для Каждого впСтрокаЭС Из глПодключаемоеОборудование.ПараметрыПодключенияПО Цикл 
		Если впСтрокаЭС.Ссылка = Идентификатор Тогда 
			Если впСтрокаЭС.Свойство("мRequest") Тогда
				Параметры.Вставить("мRequest", впСтрокаЭС.мRequest);  
			КонецЕсли;	
			Если впСтрокаЭС.Свойство("мМассив") Тогда
				Параметры.Вставить("мМассив" , впСтрокаЭС.мМассив); 
			КонецЕсли;	
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Параметры;
	
КонецФункции



////////////////////////////////////////////////////////////////
#Область ПодключитьУстройство
// მოწყობილობასთან დაკავშირება
// Функция представляет реализацию операции "Подключить".
//
// Параметры
//  Модель   - <СправочникСсылка.ТорговоеОборудование>
//           - Модель подключаемого торгового оборудования.
//
//  НомерЛУ  - <Число>
//           - Номер логического устройства.
//
//  Объект   - <НеизвестныйОбъект>
//           - Выходной параметр; созданный объект драйвера.
//
// Возвращаемое значение:
//  <Строка> – Описание произошедшей ошибки или пустая строка в случае успеха.
//
Функция ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт

	РезультатПодключения = TransLinkRESTAPI.КомандаТерминалу_OPENPOS(Параметры);
    
	ВыходныеПараметры = Новый Массив;                                           
		
	ВыходныеПараметры.Добавить("");
	ВыходныеПараметры.Добавить(РезультатПодключения);
	
 	Возврат РезультатПодключения;
	
КонецФункции	
#КонецОбласти //ПодключитьУстройство

////////////////////////////////////////////////////////////////
#Область ОтключитьУстройство
// მოწყობილობასთან კავშირის გაწყვეტა
// Функция осуществляет отключение устройства.
//
// Параметры:
//  ОбъектДрайвера - <*>
//         - ОбъектДрайвера драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)  Экспорт

//4.1.1 TypeResult 	
//{ 
//"resultCode": "NotFound",      
//"resultMessage": "Transaction is not found, does not exists", 
//"resultTime": "20191224152644"
//} 
	
	//ПараметрыКоманды = ПараметрыКомандыREST();
	//ПараметрыКоманды.Метод = "POST"; 
	//ПараметрыКоманды.ИмяФункции = "/closepos";  //4.4 Метод closepos 
	
	СтруктураОтвета = TransLinkRESTAPI.КомандаТерминалу_CLOSEPOS(Параметры);
		
	Возврат Ложь;
	
КонецФункции

#КонецОбласти  //ОтключитьУстройство

/////////////////////////////////////////////////////////////////////
#Область ТестУстройства

Функция ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
//Функция ТестУстройства(Объект, TerminalID, COMПортФР, мRequest, мМассив, TerminalAlias, ИспользоватьTranslinkДляТерминала)

	Результат = Ложь; 
	
	ДополнительноеОписание = "Результат подключения:";
	
	Если НЕ TransLinkRESTAPI.ПолученТокен(Параметры) Тогда
		СтруктураПодключение = TransLinkRESTAPI.КомандаТерминалу_OPENPOS(Параметры); 
	КонецЕсли;	
	
	СтруктураОтвета = TransLinkRESTAPI.КомандаТерминалу_GETPOSSTATUS(Параметры);
	
	ДополнительноеОписание = ДополнительноеОписание + "
	|Code   : " + СтруктураОтвета.TypeResult.resultCode + "
	|Message: " + СтруктураОтвета.TypeResult.resultMessage + "
	|Time   : " + СтруктураОтвета.TypeResult.resultTime;
	
	Если СтруктураОтвета.TypeResult.resultCode = TransLinkRESTAPI.TypeResult_OK() Тогда
		Результат = истина;
	КонецЕсли;	
	
	ВыходныеПараметры.Добавить("Начали подключение"); //0
    ВыходныеПараметры.Добавить(ДополнительноеОписание); //

	Возврат Результат;

КонецФункции	

#КонецОбласти  //ТестУстройства


////////////////////////////////////////////////////////////////
#Область ПечатьКвитанцийНаТерминале
Функция ПечатьКвитанцийНаТерминале(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	//РезультатПечати = TransLinkRESTAPI.КомандаТерминалу_PRINT(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	
	Результат = Истина;
	ВыходныеПараметры.Очистить();  
	ВыходныеПараметры.Добавить(Ложь);
	Возврат Результат;
	
КонецФункции

#КонецОбласти //ПечатьКвитанцийНаТерминале

////////////////////////////////////////////////////////////////
#Область ПолучитьВерсиюДрайвера
// ფუნქცია აბრუნებს მოწყობილობის დრიავერის ვერსიას
// Функция возвращает версию установленного драйвера
//
Функция ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Ложь;
	
	Если НЕ TransLinkRESTAPI.ПолученТокен(Параметры) Тогда
		СтруктураПодключение = TransLinkRESTAPI.КомандаТерминалу_OPENPOS(Параметры); 
	КонецЕсли;	
	
	Драйвера_Имя = "Не задан";
	Драйвер_Версия = "Не опреелена";
	
	СтруктураОтвета = TransLinkRESTAPI.КомандаТерминалу_GETSOFTWAREVERSION(Параметры);
	
	ТелоОтветаДанные = СтруктураОтвета.ОТВЕТ.ТелоОтветаДанные;
	Если ТипЗнч(ТелоОтветаДанные) = Тип("Структура") Тогда
		ТелоОтветаДанные.Свойство("CompatibleApiVersions", Драйвер_Версия);
		Если ТипЗнч(Драйвер_Версия) = Тип("Массив") тогда
			Драйвер_Версия = TransLinkRESTAPI.МассивВСтроку(Драйвер_Версия);
		КонецЕсли;	
		ТелоОтветаДанные.Свойство("ReleaseVersion", Драйвера_Имя);
	КонецЕсли;
	
	//УстройствоОтключено = ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	Результат = Истина;
		
		
	//СтруктураОтветаGETPOSSTATUS = TransLinkRESTAPI.КомандаТерминалу_GETPOSSTATUS(Параметры);
		
    ВыходныеПараметры.Добавить(Драйвера_Имя);
	ВыходныеПараметры.Добавить(Драйвер_Версия);
	ВыходныеПараметры.Добавить(Драйвер_Версия);
	
	Возврат Результат;
   
КонецФункции

#КонецОбласти //ПолучитьВерсиюДрайвера

///////////////////////////////////////
#Область AuthorizeSales

Функция AuthorizeSales(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Сумма", ВходныеПараметры[0]);
	ДанныеДокумента.Вставить("СуммаВозврата", 0);
	ДанныеДокумента.Вставить("posOperation", TransLinkRESTAPI.posOperation_AUTHORIZE());
	
    Результат = ЗапустимПроцедуруРаботыСТерминалом(ДанныеДокумента, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры );
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработаемСобытияОтТерминала(ПолученныеСобытия, СписокСтрокСлипЧека, Параметры, СтрокаСообщенияОжижания)
	
	//Обрабатываем результат
	eventType = ПолученныеСобытия.Получить("CANCEL");
	Если eventType<>Неопределено Тогда 
		СписокСтрокСлипЧека.ПричинаОтмены = "Операция отменена оператором";
		//Возврат;
	КонецЕсли;
	
	eventType = ПолученныеСобытия.Получить("ONCARD");
	Если eventType<>Неопределено Тогда 
		СписокСтрокСлипЧека.КартаПредоставлена = Истина;
		СписокСтрокСлипЧека.КартаДействительна = eventType.properties.allowAuthorize;
		СписокСтрокСлипЧека.НомерКарты = eventType.properties.PAN;
		Если СписокСтрокСлипЧека.КартаДействительна = Ложь Тогда
	    	СписокСтрокСлипЧека.ПричинаОтмены = "Карта не действительна.";
		КонецЕсли;	
	КонецЕсли;					
			
	
	eventType = ПолученныеСобытия.Получить("ONCARDREMOVE");
	Если eventType<>Неопределено Тогда    
		СписокСтрокСлипЧека.КартаПредоставлена = Ложь;
		СписокСтрокСлипЧека.ПричинаОтмены = "Карта не представлена.";
	КонецЕсли;
	
	
	
	//получена печатная форма чека
	eventType = ПолученныеСобытия.Получить("ONPRINT");	
	Если eventType<>Неопределено Тогда
		СписокСтрокСлипЧека.СлипОтХоста = eventType.properties.receiptText; 
	КонецЕсли;
	
	//Получено состояние транзакции
	eventType = ПолученныеСобытия.Получить("ONTRNSTATUS");	
	Если eventType<>Неопределено Тогда
		СписокСтрокСлипЧека.state  = eventType.properties.state;
		
		TransLinkRESTAPI.ЗаполнитьСписокСтрокСлипЧекаПоСтатусуТерминала(СписокСтрокСлипЧека, eventType, Параметры);
		
			
		//ВходныеПараметры.Вставить("параметрыКоманды", ПараметрыКомандыТерминала);
		
			
		СписокСтрокСлипЧека.Результат = (СписокСтрокСлипЧека.state = "Approved");
		Если не СписокСтрокСлипЧека.Результат Тогда
			СписокСтрокСлипЧека.ПричинаОтмены = "статус транзакции " + СписокСтрокСлипЧека.state;
		ИначеЕсли ЗначениеЗаполнено(eventType.properties.documentNr) Тогда 
			
			МассивОпераций = Новый Массив;
			МассивОпераций.Добавить(СписокСтрокСлипЧека.ИдентификаторОперацииНаТерминале);
			
			
			ПараметрыКомандыТерминала = Новый Структура;
			ПараметрыКомандыТерминала.Вставить("operations", МассивОпераций); 
			ПараметрыКомандыТерминала.Вставить("documentNr", eventType.properties.documentNr); 
			//Закроем документ на POS
			РезультатОбработкиCLOSEDOC = TransLinkRESTAPI.КомандаТерминалу_CLOSEDOC(ПараметрыКомандыТерминала, Параметры);	
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Если Параметры.Отладка Тогда
		Сообщить(СтрокаСообщенияОжижания);
		Сообщить("Получено событий "+ ПолученныеСобытия.Количество());	
		Для каждого ЭлементСобытия из ПолученныеСобытия Цикл
			Сообщить("  " + ЭлементСобытия.Ключ);	
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьВсеСобытияОтТерминала(Параметры, СтрокаСообщенияОжидания)
	
	ПолученыДанные = Новый Соответствие;
	//Получим одно из ключевых событий
	Пока 
		ПолученыДанные.Получить("ONCARD")=Неопределено 
		и ПолученыДанные.Получить("ONCARDREMOVE")=Неопределено 
		и ПолученыДанные.Получить("ONPRINT")=Неопределено 
		и ПолученыДанные.Получить("ONTRNSTATUS")=Неопределено 
		и ПолученыДанные.Получить("CANCEL")=Неопределено //Если нажали отмену
		Цикл             
	
		РезультатСобытия = ОжидаемСобытияОтТерминала(Параметры, СтрокаСообщенияОжидания);
		eventType = РезультатСобытия.eventType;
		
		eventName = eventType.eventName;
		
		ПолученыДанные.Вставить(eventName, eventType); 

	    Если Параметры.Отладка ТОгда
			Сообщить("Возникло событие1 " + eventName);
		КонецЕсли;	
			
	КонецЦикла;                                                                                
	
	НомерСобытия = ПолученыДанные.Количество();
	
	//Прочитать остальные события, чтобы очередь стала пустая
	Пока Истина Цикл
		НомерСобытия = НомерСобытия + 1;
		
		РезультатСобытия = ОжидаемСобытияОтТерминала(Параметры, "Получаем остальные события " + НомерСобытия,,Истина);	
		
		eventType = РезультатСобытия.eventType;
		eventName = eventType.eventName;
		
		Если eventName = Null или eventName = Неопределено Тогда
			Прервать;	
		Иначе     
			ПолученыДанные.Вставить(eventName, eventType); 
			Если Параметры.Отладка ТОгда
				Сообщить("Возникло событие1 " + eventName);			
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ПолученыДанные;
	
КонецФункции		
		
	

Функция ЗапустимПроцедуруРаботыСТерминалом(ДанныеДокумента, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры )
	
	СписокСтрокСлипЧека = TransLinkRESTAPI.СоздатьСтрокиСлипЧека();
	ДанныеДокумента.Вставить("documentNr", TransLinkRESTAPI.ПолучитьПроизвольныйНомерДокументаСтрокой()); 
	СписокСтрокСлипЧека.Вставить("ДанныеДокумента", ДанныеДокумента);
	СписокСтрокСлипЧека.Вставить("НомерЧекаЭТ", ДанныеДокумента.documentNr);
	
	//разблокировку POS, для выполнения последующих операций
	РезультатОбработки = TransLinkRESTAPI.КомандаТерминалу_UNLOCKDEVICE(ДанныеДокумента, Параметры);	
	
	//Ждем, пока пользователь оплатит или откажется
	ПолученныеСобытия = ПолучитьВсеСобытияОтТерминала(Параметры, "Ожидаем прикладывания карты");
    ОбработаемСобытияОтТерминала(ПолученныеСобытия, СписокСтрокСлипЧека, Параметры, "Ожидаем прикладывания карты");	
	
	//Если СписокСтрокСлипЧека.КартаПредоставлена Тогда
	//	Если СписокСтрокСлипЧека.КартаДействительна Тогда               
			
			//Отправляем запрос в банк на подтверждение
			РезультатКомандыОперации = TransLinkRESTAPI.КомандаТерминалуНачатьДействие(ДанныеДокумента, ВходныеПараметры, Параметры);	
			
			ПолученныеСобытия = ПолучитьВсеСобытияОтТерминала(Параметры, "Ожидаем завершения транзакции");
   			ОбработаемСобытияОтТерминала(ПолученныеСобытия, СписокСтрокСлипЧека, Параметры, "Ожидаем завершения транзакции");	
	
	//	КонецЕсли;
		
	//КонецЕсли;	
	
	//Завершили операци. Блокируем POS
	РезультатОбработкиLOCKDEVICE = TransLinkRESTAPI.КомандаТерминалу_LOCKDEVICE(Параметры);	
						
	
	Тестируем = Ложь;
	Если Тестируем ТОгда
		РезультатСобытияONTRNSTATUS = ПолучитьТекстФайла("D:\TEMP\ответ о статусе документа.txt");
		//ЗаполнитьСписокСтрокСлипЧекаПоСтатусуТерминала(СписокСтрокСлипЧека, РезультатСобытияONTRNSTATUS.eventType, Параметры, ДанныеДокумента.posOperation);
		
	КонецЕсли;
	
	//СсылочныйНомер = ИдентификаторОперации; //СписокСтрокСлипЧека.НомерСсылкы;
	
	Если не ЗначениеЗаполнено(СписокСтрокСлипЧека.СлипОтХоста) тогда
		СписокСтрокСлипЧека.СлипОтХоста = 
		"Печатная форма чека документа 
		|на сумму " + ДанныеДокумента + " не сформировался
		|по причине " + СписокСтрокСлипЧека.ПричинаОтмены + "
		|";
	КонецЕсли;	
	
	КодАвторизации = СписокСтрокСлипЧека.КодАвторизации;
	
	Если СписокСтрокСлипЧека.Результат Тогда
			
		//ВыходныеПараметры.Добавить("****************");
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.НомерКарты); //0
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.СсылочныйНомер);  //1
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.НомерЧекаЭТ); //2
		ВыходныеПараметры.Добавить(Новый Массив()); //3
		ВыходныеПараметры[3].Добавить("СлипЧек");
		ВыходныеПараметры[3].Добавить(СписокСтрокСлипЧека.СлипОтХоста);
		ВыходныеПараметры.Добавить(КодАвторизации);  //4
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
	Иначе
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.НомерКарты);
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.ПричинаОтмены);
		
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.ИдентификаторОперацииНаТерминале);
		ВыходныеПараметры.Добавить(Новый Массив());
		ВыходныеПараметры[3].Добавить("СлипЧек");
		ВыходныеПараметры[3].Добавить(СписокСтрокСлипЧека.СлипОтХоста);
		ВыходныеПараметры.Добавить(КодАвторизации);
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
		
	КонецЕсли;
	
	Возврат СписокСтрокСлипЧека.Результат;
		
КонецФункции	


Функция ОжидаемСобытияОтТерминала(Параметры, СтрокаСообщения="", БесконечныйЦикл = Истина, ПрерватьсяНаПустомСобытии = Ложь)
	
	Результат = Неопределено;
	РезультатПолучен = Ложь;

	ВремяОжиданияКарты = Параметры.ВремяОжиданияКарты;
	ПредлагатьПовторитьОперациюОжидания = Параметры.ПредлагатьПовторитьОперациюОжидания;
	
	Если ВремяОжиданияКарты = 0 Тогда
		ВремяОжиданияКарты = 30;
	КонецЕсли;	      
	
	ДатаОкончания = ТекущаяДата() + ВремяОжиданияКарты;
	
	Пока РезультатПолучен = Ложь Цикл
		ТекстСообщения = 
		"" + Параметры.TerminalAlias + "
		|" + СтрокаСообщения + "
		|";
		ФормаЗаставка =	ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация",
			Новый Структура("ИдентификаторЗадания, ТекстСообщения", Неопределено, ТекстСообщения), 
			Неопределено);

		ТекДата = ТекущаяДата(); 
		
		Пока Истина Цикл
			
			МенеджерОборудованияКлиент.Пауза(1);
			
			РезультатСобытия = TransLinkRESTAPI.ПолучитьСобытиеОтТерминала_RestX(Параметры);
			
			eventName = "";
			Если ЗначениеЗаполнено(РезультатСобытия.eventType.eventName) Тогда
				РезультатСобытия.eventType.Свойство("eventName", eventName);

			ИначеЕсли ПрерватьсяНаПустомСобытии тогда
				РезультатПолучен = Истина; 
				Результат = РезультатСобытия;
				прервать;
				//Возврат Результат;
				
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(eventName) Тогда                                                       
				РезультатПолучен = Истина; 
				Результат = РезультатСобытия;
				Прервать;
			КонецЕсли;
			
			ТекДата = ТекущаяДата();
			Если ТекДата > ДатаОкончания Тогда
				//Сообщить("Закончилось время ожидания");
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		ФормаЗаставка.Закрыть();
		
		Если не РезультатПолучен Тогда                                                                                  
			КнопкаПоУмолчанию = КодВозвратаДиалога.Да;			
			Если БесконечныйЦикл = Ложь ТОгда
				КнопкаПоУмолчанию = КодВозвратаДиалога.Нет;			
			КонецЕсли;
			
			РезультатОтветаПродолжить = КодВозвратаДиалога.Нет;
			Если ПредлагатьПовторитьОперациюОжидания = Истина Тогда			
				РезультатОтветаПродолжить = Вопрос("Повторить ожидание?",РежимДиалогаВопрос.ДаНет,10,,Параметры.TerminalAlias,КнопкаПоУмолчанию);
			КонецЕсли;
			
			Если РезультатОтветаПродолжить = КодВозвратаДиалога.Нет ТОгда
				Результат = РезультатСобытия;
				РезультатСобытия.eventType.eventName = "CANCEL";
				//РезультатСобытия.eventType.eventMessage = "Отменено оператором.";
				прервать; 
			Иначе
				ДатаОкончания = ТекущаяДата() + ВремяОжиданияКарты;
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции	

Функция AuthorizeSales_ActiveX(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	мТипТранзакции = "Оплата";
	
    TerminalID = Параметры.TerminalID;
    TerminalAlias = Параметры.TerminalAlias;
    ИспользоватьTranslinkДляТерминала = Ложь;
	Параметры.Свойство("ИспользоватьTranslinkДляТерминала",ИспользоватьTranslinkДляТерминала);  //Малышев 2024-07-24
	Сумма = ВходныеПараметры.Сумма;
	КодОперации = Неопределено;
	КодRRN = Неопределено;
	КодАвторизации = ВходныеПараметры.КодАвторизации;
	COMПортФР = Параметры.Порт;
	//COMПортФР = "";
	СписокСтрокСлипЧека = Новый Структура;
	МетодОплаты = ВходныеПараметры.МетодОплаты;
	мRequest = ВходныеПараметры.мRequest;
	мRequest.TerminalID = TerminalID;  
	
	Если ИспользоватьTranslinkДляТерминала Тогда 
		мRequest.TerminalAlias = TerminalAlias;  
	КонецЕсли;

	мМассив = ВходныеПараметры.мМассив;
	ПериодРасрочки = ВходныеПараметры.ПериодРасрочки;
	CashbackAmount = ВходныеПараметры.CashbackAmount;
	
	СуммаВременная = Неопределено;
	
	КодКарты       = Неопределено;
	СсылочныйНомер = Неопределено;
	НомерЧека      = Неопределено;
	СлипЧек = Неопределено;
	
	Ответ = "";
	Результат = ОплатитьПлатежнойКартой_ActiveX(ОбъектДрайвера, TerminalID, СтрЗаменить(Формат(Сумма + CashbackAmount,"ЧДЦ=2; ЧРД=,; ЧГ="),",",""), КодRRN, КодАвторизации,  СписокСтрокСлипЧека, КодОперации, COMПортФР, МетодОплаты, мRequest, мМассив, ПериодРасрочки, TerminalAlias, СтрЗаменить(Формат(CashbackAmount,"ЧДЦ=2; ЧРД=,; ЧН=0; ЧГ="),",",""), ИспользоватьTranslinkДляТерминала,Ответ);
	
	Если Результат Тогда
		
		СсылочныйНомер = СписокСтрокСлипЧека.НомерСсылкы;
		КодАвторизации = СписокСтрокСлипЧека.КодАвторизации;
		
		//ВыходныеПараметры.Добавить("****************");
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.НомерКарты);
		ВыходныеПараметры.Добавить(СсылочныйНомер);
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.ИдентификаторОперацииНаТерминале);
		ВыходныеПараметры.Добавить(Новый Массив());
		ВыходныеПараметры[3].Добавить("СлипЧек");
		ВыходныеПараметры[3].Добавить(СписокСтрокСлипЧека.СлипОтХоста);
		ВыходныеПараметры.Добавить(КодАвторизации);
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
	Иначе
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.НомерКарты);
		ВыходныеПараметры.Добавить(Ответ);
		
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.ИдентификаторОперацииНаТерминале);
		ВыходныеПараметры.Добавить(Новый Массив());
		ВыходныеПараметры[3].Добавить("СлипЧек");
		ВыходныеПараметры[3].Добавить(СписокСтрокСлипЧека.СлипОтХоста);
		ВыходныеПараметры.Добавить(КодАвторизации);
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
		
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ОплатитьПлатежнойКартой_ActiveX(Объект, TerminalID, Сумма, КодRRN, КодАвторизации,  СписокСтрокСлипЧека,КодОперации, COMПортФР, МетодОплаты = Неопределено, мRequest, мМассив, ПериодРасрочки = Неопределено, TerminalAlias, CashbackAmount, ИспользоватьTranslinkДляТерминала,Ответ) 
 
	Ответ = "";
	мRequest.OperatorID = "";
	мRequest.OperatorName = ""; 
	мRequest.Amount = СтрЗаменить(Формат(Сумма,"ЧГ=0"),",","");
	мRequest.CurrencyCode = "981"; 
	мRequest.InstallmentPayments = ПериодРасрочки; 
	мRequest.InstallmentType = ""; 	
	впSelected = Неопределено;
	//мRequest.TerminalID = "";               	       	
    //мRequest.ComPort = COMПортФР; 
	
	Результат = Объект.NewBonusTender(TransLinkRESTAPI.СтрокаДляТерминала(мRequest), Ответ);  	
	
	Если Результат И Сред(Ответ, 1, Найти(Ответ,";")-1) = "Select currency" Тогда 
		впМассив = ПолучитьВалютыДляВыбор(Ответ);
		впФорма = ПолучитьФорму("ОбщаяФорма.ФормаСписокОплат_AXConnect");
		
		Для Каждого Строка Из впМассив Цикл 
			НовСтрока = впФорма.ЭквайринговыхТерминалов.Добавить();	
			НовСтрока.ВидОплаты = Строка; 	
		КонецЦикла;
		
		Если МетодОплаты = ПредопределенноеЗначение("Перечисление.МетодыОплаты.РасрочкаТерминала") Тогда 
			впSelected = впМассив[0];
		Иначе 
			впSelected = впФорма.ОткрытьМодально();
		КонецЕсли;
	
		мRequest.Selected = впSelected;
		Результат = Объект.Selected(TransLinkRESTAPI.СтрокаДляТерминала(мRequest), Ответ);
		
		Если впSelected = Неопределено Тогда 
			//Возврат "გადახდა შეწყვეტილია.";
			Возврат Ложь;
		КонецЕсли;

	КонецЕсли;	
	
	Если НЕ Результат Тогда          			
		
		мТипТранзакции = "Отказ";
		
		Попытка
			TransLinkRESTAPI.СтрокаОтТерминала(Ответ, мRequest, мМассив);
			ПолучитьСтрокиСлипЧека(Объект, СписокСтрокСлипЧека, "გადახდა", мRequest, впSelected);
			Ответ = TransLinkRESTAPI.Кодировка(мRequest.TextResponse);
		Исключение
		КонецПопытки;
	
		//Возврат "შეცდომა ("+ Ответ +").";		
		Возврат Ложь;
	Иначе 
		TransLinkRESTAPI.СтрокаОтТерминала(Ответ, мRequest, мМассив);
		ПолучитьСтрокиСлипЧека(Объект, СписокСтрокСлипЧека, "გადახდა", мRequest, впSelected);
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

#КонецОбласти  //AuthorizeSales

///////////////////////////////////////
#Область AuthorizeRefund

Функция AuthorizeRefund(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Сумма", ВходныеПараметры[0]);
	ДанныеДокумента.Вставить("СуммаВозврата", 0);
	ДанныеДокумента.Вставить("posOperation", TransLinkRESTAPI.posOperation_CREDIT());
	
    Результат = ЗапустимПроцедуруРаботыСТерминалом(ДанныеДокумента, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры );
	
	Возврат Результат;

	//мТипТранзакции = "Оплата";
	//
	//TerminalID = Параметры.TerminalID;
	//TerminalAlias = Параметры.TerminalAlias;
	//ИспользоватьTranslinkДляТерминала = Ложь;
	//Параметры.Свойство("ИспользоватьTranslinkДляТерминала",ИспользоватьTranslinkДляТерминала); //Малышев 2024-07-24
	//
	//Сумма = ВходныеПараметры.Сумма;
	//СуммаДляВозврата = ВходныеПараметры.СуммаДляВозврата;  
	//НомерСсылкы = ВходныеПараметры.НомерСсылкы;  
	//ВидОплатыДляВозврата = ВходныеПараметры.ВидОплатыДляВозврата;  
	//КодОперации = Неопределено;
	//КодRRN = Неопределено;
	//КодАвторизации = ВходныеПараметры.КодАвторизации;
	////COMПортФР = Параметры.Порт;
	//COMПортФР = "";
	//СписокСтрокСлипЧека = Новый Структура;
	//МетодОплаты = ВходныеПараметры.МетодОплаты;
	//мRequest = ВходныеПараметры.мRequest;
	//мМассив = ВходныеПараметры.мМассив;
	//
	//СуммаВременная = Неопределено;
	//
	//КодКарты       = Неопределено;
	//СсылочныйНомер = Неопределено;
	//НомерЧека      = Неопределено;
	//СлипЧек = Неопределено;
	//	
	//Результат = ОтменитьПлатежаПоПлатежнойКарте_ActiveX(ОбъектДрайвера, TerminalID, СтрЗаменить(Формат(Сумма,"ЧДЦ=2; ЧРД=,; ЧГ="),",",""), СтрЗаменить(Формат(СуммаДляВозврата,"ЧДЦ=2; ЧРД=,; ЧГ="),",",""), КодRRN, КодАвторизации,  СписокСтрокСлипЧека, КодОперации, COMПортФР, МетодОплаты, мRequest, мМассив, НомерСсылкы, ВидОплатыДляВозврата, TerminalAlias, ИспользоватьTranslinkДляТерминала);
	//		
	//Если Результат Тогда
	//	
	//	СсылочныйНомер = СписокСтрокСлипЧека.НомерСсылкы;
	//	КодАвторизации = СписокСтрокСлипЧека.КодАвторизации;
	//	
	//	ВыходныеПараметры.Добавить("****************");
	//	ВыходныеПараметры.Добавить(СсылочныйНомер);
	//	ВыходныеПараметры.Добавить(НомерЧека);
	//	ВыходныеПараметры.Добавить(Новый Массив());
	//	ВыходныеПараметры[3].Добавить("СлипЧек");
	//	ВыходныеПараметры[3].Добавить(СлипЧек);
	//	ВыходныеПараметры.Добавить(КодАвторизации);
	//	ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
	//	
	//КонецЕсли;

	//Возврат Результат;

КонецФункции

Функция ОтменитьПлатежаПоПлатежнойКарте_ActiveX(Объект, TerminalID, Сумма, СуммаДляВозврата, КодRRN, КодАвторизации,  СписокСтрокСлипЧека,КодОперации, COMПортФР, МетодОплаты = Неопределено, мRequest, мМассив, НомерСсылкы = "", ВидОплатыДляВозврата, TerminalAlias, ИспользоватьTranslinkДляТерминала) 
 
	Ответ = "";
	
	мRequest.OperatorID = "";
	мRequest.OperatorName = ""; 
	мRequest.Amount = СтрЗаменить(Формат(Сумма,"ЧГ=0"),",","");
	мRequest.CurrencyCode = "981";
	мRequest.AdditionalAmount = СтрЗаменить(Формат(СуммаДляВозврата,"ЧГ=0"),",","");
	мRequest.ReferenceNumber = НомерСсылкы;
	впCOMПортФР = ?(ЗначениеЗаполнено(COMПортФР), COMПортФР, 0);
	мRequest.ComPort = впCOMПортФР;	
	мRequest.InstallmentPayments = 0; 
	мRequest.InstallmentType = "CREDIT"; 
	
	Если ИспользоватьTranslinkДляТерминала Тогда 
		мRequest.TerminalAlias = TerminalAlias;	
	КонецЕсли;

	впSelected = Неопределено;	
	
	//мRequest.OperationCode = "4";	
	
	Если МетодОплаты = ПредопределенноеЗначение("Перечисление.МетодыОплаты.ОплатаБаламиТерминалаMR") Тогда 
		мRequest.CurrencyCode = "102"; 
		Результат = Объект.NewCreditTenderWithCurrency(TransLinkRESTAPI.СтрокаДляТерминала(мRequest), Ответ);
	ИначеЕсли МетодОплаты = ПредопределенноеЗначение("Перечисление.МетодыОплаты.ОплатаБаламиТерминалаExpress") Тогда 
		мRequest.CurrencyCode = "EXP"; 
		Результат = Объект.NewCreditTenderWithCurrency(TransLinkRESTAPI.СтрокаДляТерминала(мRequest), Ответ);
	ИначеЕсли МетодОплаты = ПредопределенноеЗначение("Перечисление.МетодыОплаты.ОплатаБаламиТерминалаPlus") Тогда 
		мRequest.CurrencyCode = "PLS"; 
		Результат = Объект.NewCreditTenderWithCurrency(TransLinkRESTAPI.СтрокаДляТерминала(мRequest), Ответ);
	ИначеЕсли МетодОплаты = ПредопределенноеЗначение("Перечисление.МетодыОплаты.ОплатаБаламиТерминалаScool") Тогда 
		мRequest.CurrencyCode = "SCL"; 
		Результат = Объект.NewCreditTenderWithCurrency(TransLinkRESTAPI.СтрокаДляТерминала(мRequest), Ответ);
	Иначе
		Результат = Объект.NewCreditTenderWithCurrency(TransLinkRESTAPI.СтрокаДляТерминала(мRequest), Ответ);
	КонецЕсли;
	
	Если Результат И Сред(Ответ, 1, Найти(Ответ,";")-1) = "Select currency" Тогда 
		впМассив = ПолучитьВалютыДляВыбор(Ответ);		
		впВидОплатыПродажи = Сред(ВидОплатыДляВозврата, 1, Найти(ВидОплатыДляВозврата,"-")-2);
		
		Для Каждого Строка Из впМассив Цикл 
			
			Если Найти(Строка,впВидОплатыПродажи) <> Неопределено И Найти(Строка,впВидОплатыПродажи) > 0 Тогда  
				впSelected = Строка;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
				
		мRequest.Selected = впSelected;
		Результат = Объект.Selected(TransLinkRESTAPI.СтрокаДляТерминала(мRequest), Ответ);
		
		Если впSelected = Неопределено Тогда 
			//Возврат "დაბრუნება შეწყვეტილია.";
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;		
	
	
	
	Если НЕ Результат Тогда          			
		
		мТипТранзакции = "Отказ";
		
		Попытка
			TransLinkRESTAPI.СтрокаОтТерминала(Ответ, мRequest, мМассив);
			ПолучитьСтрокиСлипЧека(Объект, СписокСтрокСлипЧека, "დაბრუნება", мRequest, впSelected);
			Ответ = TransLinkRESTAPI.Кодировка(мRequest.TextResponse);
		Исключение
		КонецПопытки;
	
		//Возврат "შეცდომა ("+ Ответ +").";		
		Возврат Ложь;
	Иначе 
		TransLinkRESTAPI.СтрокаОтТерминала(Ответ, мRequest, мМассив);
		ПолучитьСтрокиСлипЧека(Объект, СписокСтрокСлипЧека, "დაბრუნება", мRequest, впSelected);
	КонецЕсли;
			
	Возврат Истина;

КонецФункции
#КонецОбласти //AuthorizeRefund

///////////////////////////////////////
#Область AuthorizeVoid

Функция AuthorizeVoid(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	СписокСтрокСлипЧека = TransLinkRESTAPI.СоздатьСтрокиСлипЧека();
	
	СуммаДокумента = ВходныеПараметры[0];
	СсылочныйНомер = ВходныеПараметры[1]; 
	НомерЧека = ?(ВходныеПараметры.Количество()>=3,ВходныеПараметры[2],"");
	
	СуммаДокументаОснования = СуммаДокумента; 
	
	Если Лев(СсылочныйНомер,1)="{" ТОгда
		СтруктураВозврата = TransLinkRESTAPI.ИзJSON_в_Данные1с(СсылочныйНомер);
		СуммаДокументаОснования = СтруктураВозврата.ИзначальнаяСумма;
		СсылочныйНомер = СтруктураВозврата.СсылочныйНомер;
	КонецЕсли;	
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Сумма", СуммаДокумента);
	ДанныеДокумента.Вставить("operationId", СсылочныйНомер);
	ДанныеДокумента.Вставить("posOperation", TransLinkRESTAPI.posOperation_NOOPERATION());
	СписокСтрокСлипЧека.Вставить("ДанныеДокумента", ДанныеДокумента); 
	
	РезультатОбработки = TransLinkRESTAPI.КомандаТерминалу_UNLOCKDEVICE(ДанныеДокумента, Параметры);	
	
	Если СуммаДокумента = СуммаДокументаОснования Тогда
		РезультатVOID = TransLinkRESTAPI.КомандаТерминалу_VOID(ДанныеДокумента, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	Иначе     
		ДанныеДокумента.Вставить("СуммаПервоначальная", СуммаДокументаОснования);
		РезультатVOID = TransLinkRESTAPI.КомандаТерминалу_VOIDPARTIAL(ДанныеДокумента, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	КонецЕсли;	

	//Ждем пока пройдет обмен с банком
	ПолученныеСобытия = ПолучитьВсеСобытияОтТерминала(Параметры, "Ожидаем завершения транзакции");
    ОбработаемСобытияОтТерминала(ПолученныеСобытия, СписокСтрокСлипЧека, Параметры, "Ожидаем завершения транзакции");	
	
	//Завершили операци. Блокируем POS
	РезультатОбработкиLOCKDEVICE = TransLinkRESTAPI.КомандаТерминалу_LOCKDEVICE(Параметры);	
						
	НомерЧека = "";
	Если не ЗначениеЗаполнено(СписокСтрокСлипЧека.СлипОтХоста) тогда
		СписокСтрокСлипЧека.СлипОтХоста = 
		"Печатная форма чека документа                                                     
		|Возврат по операции " + НомерЧека + " " + СписокСтрокСлипЧека.state + "
		|на сумму " + ДанныеДокумента.Сумма + " не сформировался
		|по причине " + СписокСтрокСлипЧека.ПричинаОтмены + "
		|";
	КонецЕсли;	
	
	Если СписокСтрокСлипЧека.Результат Тогда   
		МассивСлипчека = Новый Массив();
		МассивСлипчека.Добавить("СлипЧек");
		МассивСлипчека.Добавить(СписокСтрокСлипЧека.СлипОтХоста);
			
		ВыходныеПараметры.Добавить("****************"); //0
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.ПричинаОтмены);              //1
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.НомерЧекаЭТ);          //2
		ВыходныеПараметры.Добавить(МассивСлипчека); //3
		
	Иначе
		МассивСлипчека = Новый Массив();
		МассивСлипчека.Добавить("СлипЧек");
		МассивСлипчека.Добавить(СписокСтрокСлипЧека.ПричинаОтмены);
	
		ВыходныеПараметры.Добавить(); //0
		ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.ПричинаОтмены); //1
	КонецЕсли;
	
	Возврат СписокСтрокСлипЧека.Результат;

КонецФункции

Функция УдалитьПлатежаПоПлатежнойКарте(Объект, СписокСтрокСлипЧека, TerminalID, OperationID, мRequest, мМассив, TerminalAlias, ИспользоватьTranslinkДляТерминала)
	
	Ответ = "";
	мRequest.OperatorID = "";
	мRequest.OperatorName = ""; 
	мRequest.OperationID = OperationID; 
	
	Если ИспользоватьTranslinkДляТерминала Тогда 
		мRequest.TerminalAlias = TerminalAlias; 
	КонецЕсли;

	Результат = Объект.NewVoid(TransLinkRESTAPI.СтрокаДляТерминала(мRequest), Ответ);
	
	Если НЕ Результат Тогда          			
		мТипТранзакции = "Отказ";
		
		Попытка
			TransLinkRESTAPI.СтрокаОтТерминала(Ответ, мRequest, мМассив);
			ПолучитьСтрокиСлипЧека(Объект, СписокСтрокСлипЧека, "გადახდა", мRequest);
			Ответ = TransLinkRESTAPI.Кодировка(мRequest.TextResponse);
		Исключение
		КонецПопытки;
	
		//Возврат "შეცდომა ("+ Ответ +").";	
		Возврат Ложь;
		
	иначе
		TransLinkRESTAPI.СтрокаОтТерминала(Ответ, мRequest, мМассив);
		ПолучитьСтрокиСлипЧека(Объект, СписокСтрокСлипЧека, "დაბრუნება", мRequest);
		
		Если Не ЗначениеЗаполнено(мRequest.ReceiptData) Тогда 
			//Возврат "შეცდომა ("+"ვერ მოხერხდა ტრანზაქციის გაუქმება. Wrong card!"+").";	
			Сообщить("შეცდომა ("+"ვერ მოხერხდა ტრანზაქციის გაუქმება. Wrong card!"+").");
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
	
КонецФункции


#КонецОбласти

Функция CloseDoc(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Ложь;
	СписокСтрокСлипЧека = TransLinkRESTAPI.СоздатьСтрокиСлипЧека();
	
	Если не TransLinkRESTAPI.ПолученТокен(Параметры) Тогда
		TransLinkRESTAPI.КомандаТерминалу_OPENPOS(Параметры);
	КонецЕсли;	
	
	Если TransLinkRESTAPI.ПолученТокен(Параметры) Тогда
		
			
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Сумма", 0);
		ДанныеДокумента.Вставить("posOperation", TransLinkRESTAPI.posOperation_NOOPERATION());
		
		СписокСтрокСлипЧека.Вставить("ДанныеДокумента", ДанныеДокумента); 
		
		РезультатОбработки = TransLinkRESTAPI.КомандаТерминалу_UNLOCKDEVICE(ДанныеДокумента, Параметры);	
		
		
		
		МассивОпераций = Новый Массив;
		МассивОпераций.Добавить(ВходныеПараметры.СсылочныйНомер);
		
		ПараметрыКомандыТерминала = Новый Структура;
		ПараметрыКомандыТерминала.Вставить("operations", МассивОпераций); 
		ПараметрыКомандыТерминала.Вставить("documentNr", ВходныеПараметры.НомерЧека); 
		
		//Закроем документ на POS
		РезультатОбработкиCLOSEDOC = TransLinkRESTAPI.КомандаТерминалу_CLOSEDOC(ПараметрыКомандыТерминала, Параметры);	
		
		Если РезультатОбработкиCLOSEDOC.TypeResult.resultCode = "OK" Тогда
			Результат = Истина;
			СписокСтрокСлипЧека.ПричинаОтмены = "";
		Иначе
			СписокСтрокСлипЧека.ПричинаОтмены = РезультатОбработкиCLOSEDOC.TypeResult.resultMessage;
		КонецЕсли;	
		
		РезультатОбработки_LOCKDEVICE = TransLinkRESTAPI.КомандаТерминалу_LOCKDEVICE(Параметры);	
	Иначе
		СписокСтрокСлипЧека.ПричинаОтмены = "Не авторизован.";
	КонецЕсли;
	
	
	ВыходныеПараметры.Добавить(999);
	ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.ПричинаОтмены);
	
	Возврат Результат;
	
КонецФункции

///////////////////////////////////////
#Область КраткийОтчет

Функция КраткийОтчет(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	СписокСтрокСлипЧека = TransLinkRESTAPI.СоздатьСтрокиСлипЧека();

	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Сумма", 0);
	ДанныеДокумента.Вставить("СуммаВозврата", 0);
	ТипОперации = TransLinkRESTAPI.posOperation_NOOPERATION();
	ДанныеДокумента.Вставить("posOperation", ТипОперации);
	
	РезультатОбработки1 = TransLinkRESTAPI.КомандаТерминалу_UNLOCKDEVICE(ДанныеДокумента, Параметры);	
	
	РезультатОтвета = TransLinkRESTAPI.КомандаТерминалу_PRINTTOTALS(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	
	
	ПолученныеСобытия = ПолучитьВсеСобытияОтТерминала(Параметры, "Ожидаем завершения транзакции");
    ОбработаемСобытияОтТерминала(ПолученныеСобытия, СписокСтрокСлипЧека, Параметры, "Ожидаем завершения транзакции");	
	Если ПолученныеСобытия.Получить("ONPRINT")<>Неопределено тогда
		СписокСтрокСлипЧека.Результат = истина;	
	КонецЕсли;
	
	
	//Если РезультатОтвета.TypeResult.resultCode = TransLinkRESTAPI.TypeResult_OK() Тогда 
	//	//Ждем, пока пользователь получит ответ
	//	eventName = "";
	//	Пока eventName<>"ONPRINT" и eventName<>"CANCEL" Цикл
	//		РезультатСобытия = ОжидаемСобытияОтТерминала(Параметры, "Ожидаем получение отчета", Ложь);
	//		eventName = РезультатСобытия.eventType.eventName;
	//		
	//		Если eventName="ONPRINT" Тогда
	//			ТекстСообщения = РезультатСобытия.eventType.properties.receiptText;
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//Иначе
	//	
	//КонецЕсли;

	РезультатОбработки1 = TransLinkRESTAPI.КомандаТерминалу_LOCKDEVICE(Параметры);	
	
	Если не ЗначениеЗаполнено(СписокСтрокСлипЧека.СлипОтХоста) ТОгда 
		СписокСтрокСлипЧека.СлипОтХоста = 
		"PRINTTOTALS-operatiopn.";
	КонецЕсли;
	
	
	СтрокиПечати = Новый Массив;
	СтрокиПечати.Добавить("Слип-чек");
	СтрокиПечати.Добавить(СписокСтрокСлипЧека.СлипОтХоста);
	
	ВыходныеПараметры.Добавить(СтрокиПечати); //0
	ВыходныеПараметры.Добавить("Печать итогов"); //1
	
	Возврат СписокСтрокСлипЧека.Результат;  
	
КонецФункции


#КонецОбласти //КраткийОтчет

//////////////////////////////////////////////
#Область ПолныйОтчет 

Функция ПолныйОтчет(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	ВыходныеПараметры.Очистить();  
	ВыходныеПараметры.Добавить(Ложь);
	Возврат Результат; 

КонецФункции

#КонецОбласти //ПолныйОтчет

//////////////////////////////////////////////
#Область КопияЧека
Функция КопияЧека(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Возврат Ложь;
КонецФункции

#КонецОбласти //КопияЧека

//////////////////////////////////////////////
#Область ПроверкаСединений

Функция ПроверкаСоеденений(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	СтруктураОтветаGETPOSSTATUS = TransLinkRESTAPI.КомандаТерминалу_GETPOSSTATUS(Параметры);
	
	Результат = СтруктураОтветаGETPOSSTATUS.ОТВЕТ.Выполнен;
	
	СписокСтрокСлипЧека = TransLinkRESTAPI.СоздатьСтрокиСлипЧека();
	ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
	
	Возврат Результат;
	
	
	
	
	Ответ = "";
	СписокСтрокСлипЧека = Новый Структура;
	
	//COMПортФР = Параметры.Порт;
	COMПортФР = "";
	COMПортФР = Параметры.Порт; //Малышев 2024-07-21
	
	мRequest = ВходныеПараметры.мRequest;
	мМассив = ВходныеПараметры.мМассив;
	
	впCOMПортФР = ?(ЗначениеЗаполнено(COMПортФР), COMПортФР, 0);
	
	мRequest.ComPort = впCOMПортФР;
	
	TerminalID	= Параметры.TerminalID;
	TerminalAlias	= Параметры.TerminalAlias;
	ИспользоватьTranslinkДляТерминала	= Ложь;
	Параметры.Свойство("ИспользоватьTranslinkДляТерминала", ИспользоватьTranslinkДляТерминала);

	//Результат = ТестУстройства(ОбъектДрайвера, TerminalID, впCOMПортФР, мRequest, мМассив, TerminalAlias, ИспользоватьTranslinkДляТерминала);
	Результат = ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);  //Малышев 2024-07-21
	
	ВыходныеПараметры.Добавить(СписокСтрокСлипЧека);
	
	Возврат Истина;

КонецФункции

#КонецОбласти //ПроверкаСединений

//////////////////////////////////////////////
#Область ИтогиДняПоКартам
Функция ИтогиДняПоКартам(ОбъектДрайвера, ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	СписокСтрокСлипЧека = TransLinkRESTAPI.СоздатьСтрокиСлипЧека();
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Сумма", 0);
	ДанныеДокумента.Вставить("СуммаВозврата", 0);
	ТипОперации = TransLinkRESTAPI.posOperation_NOOPERATION();
	ДанныеДокумента.Вставить("posOperation", ТипОперации);
	
		
	РезультатОбработки1 = TransLinkRESTAPI.КомандаТерминалу_UNLOCKDEVICE(ДанныеДокумента, Параметры);	
	
	//РезультатСобытия = TransLinkRESTAPI.ПолучитьСобытиеОтТерминала_RestX(ВходныеПараметры, Параметры);
			
	
	РезультатОбработки = TransLinkRESTAPI.КомандаТерминалу_CLOSEDAY(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	//РезультатОбработки2 =TransLinkRESTAPI.КомандаТерминалу_PRINTTOTALS(ВходныеПараметры, Параметры, ПараметрыПодключения, ВыходныеПараметры);	
	
	ПолученныеСобытия = ПолучитьВсеСобытияОтТерминала(Параметры, "Ожидаем завершения транзакции");
    ОбработаемСобытияОтТерминала(ПолученныеСобытия, СписокСтрокСлипЧека, Параметры, "Ожидаем завершения транзакции");	
	Если ПолученныеСобытия.Получить("ONPRINT")<>Неопределено тогда
		СписокСтрокСлипЧека.Результат = истина;	
	ИначеЕсли ПолученныеСобытия.Получить("CANCEL")<>Неопределено тогда
		СписокСтрокСлипЧека.ПричинаОтмены = 
		"" + Параметры.TerminalAlias + "
		|Операция отменена оператором. Возможно в терминале имеются не закрытые документы. 
		|Закройте документы и повторите операцию.";
	КонецЕсли;	

	РезультатОбработки1 = TransLinkRESTAPI.КомандаТерминалу_LOCKDEVICE(Параметры);	
	
	
	Результат = РезультатОбработки.ОТВЕТ.Выполнен;	
	
	Если не ЗначениеЗаполнено(СписокСтрокСлипЧека.СлипОтХоста) ТОгда 
		СписокСтрокСлипЧека.СлипОтХоста = 
		"CLOSEDAY-operatiopn.
		|Result: " +  РезультатОбработки.TypeResult.resultCode + "
		|" +  РезультатОбработки.TypeResult.resultMessage + "
		|Time :" +  РезультатОбработки.TypeResult.resultTime;
	КонецЕсли;
	
	МассивСлипЧека = Новый Массив;
	МассивСлипЧека.Добавить("Слип-чек");    //0
	Если СписокСтрокСлипЧека.Результат Тогда
		МассивСлипЧека.Добавить(СписокСтрокСлипЧека.СлипОтХоста); //1 
	Иначе     
		МассивСлипЧека.Добавить(СписокСтрокСлипЧека.ПричинаОтмены); //1 
	КонецЕсли;	
	
	ВыходныеПараметры.Добавить(МассивСлипЧека); //0
	ВыходныеПараметры.Добавить(СписокСтрокСлипЧека.ПричинаОтмены); //1

	Возврат СписокСтрокСлипЧека.Результат;
	
КонецФункции

#КонецОбласти //ИтогиДняПоКартам


Функция ПолучитьВалютыДляВыбор(СтрокаОтвета)
	
	впМассивВалют = Новый Массив;
	СтрокаОтвета = Сред(СтрокаОтвета,Найти(СтрокаОтвета,";")+1);
	впСтрока = СтрокаОтвета;
	
	Пока СтрокаОтвета <> "" Цикл 
		
		Если Найти(СтрокаОтвета,";") > 0 Тогда 
			впСтрока = Лев(СтрокаОтвета,Найти(СтрокаОтвета,";")-1);
			СтрокаОтвета = Сред(СтрокаОтвета,Найти(СтрокаОтвета,";")+1);
		Иначе
			впСтрока = СтрокаОтвета;
			СтрокаОтвета = "";
		КонецЕсли;
		
		Если впСтрока <> "" Тогда 
			впМассивВалют.Добавить(впСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат впМассивВалют;	
	
КонецФункции



#КонецОбласти   

//////////////////////////////////////////////////////////////////////////////////////////////////////
//USHBURN International 
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ActiveX_Вспомогательные_Функции

Процедура ПолучитьСтрокиСлипЧека(Объект, СписокСтрокСлипЧека, Операция, мRequest, ВидОплатыДляВозврата = "") 
	
	СписокСтрокСлипЧека.Вставить("Сумма",								мRequest.Amount);
	СписокСтрокСлипЧека.Вставить("ИдентификаторОперацииНаТерминале",	мRequest.CheckNumber);
	СписокСтрокСлипЧека.Вставить("ВремяОперацииНаТерминале",			мRequest.TerminalDateTime);	
	СписокСтрокСлипЧека.Вставить("ИдентификаторТерминала",				мRequest.TerminalID);
	СписокСтрокСлипЧека.Вставить("КодАвторизации",						мRequest.AuthorizationCode);
	СписокСтрокСлипЧека.Вставить("КодОтветаХоста",						мRequest.ResponseCodeHost);
	СписокСтрокСлипЧека.Вставить("НомерСсылкы",							мRequest.ReferenceNumber);
	СписокСтрокСлипЧека.Вставить("НомерКарты",							мRequest.PAN);
	СписокСтрокСлипЧека.Вставить("ОписаниеОтветаХоста",					TransLinkRESTAPI.Кодировка(мRequest.TextResponse));
	СписокСтрокСлипЧека.Вставить("Операция",							Операция);
	СписокСтрокСлипЧека.Вставить("СлипОтХоста",							TransLinkRESTAPI.Кодировка(мRequest.ReceiptData));
	СписокСтрокСлипЧека.Вставить("ВидОплатыДляВозврата",				ВидОплатыДляВозврата);
	СписокСтрокСлипЧека.Вставить("КодОперацииЭС",				        мRequest.OperationID);
	
КонецПроцедуры 

//Вспомогательная функция
Функция ПолучитьТекстФайла(Пустьфайла)
	
	Т = Новый ТекстовыйДокумент;
	Т.Прочитать(Пустьфайла);
	
	Рез = TransLinkRESTAPI.ИзJSON_в_Данные1с(Т.ПолучитьТекст());
	Возврат Рез;
	
КонецФункции	

//Вспомогательная функция
Функция ПолучитьПеременнуюКакТекст(данные)
	
	//Рез = TransLinkRESTAPI.ИзJSON_в_Данные1с(данные);
	Рез = TransLinkRESTAPI.ИзДанных1с_в_JSON(данные);
	Возврат Рез;
	
КонецФункции	

// ფუნქცია აბრუნებს მოწყობილობის დრაივერის ვერსიის მნიშვნელობას მინიშნების გარეშე
// Возвращает версию компоненты расположенной в макете.
//
Функция ПолучитьВерсиюВнешнейКомпоненты() 
	
	Возврат "1.0.0.1";
	
КонецФункции

// ფუნქცია გარდაქმნის ვერსიის სტრიქონულ მნიშვნელობას რიცხვით მნიშვნელობად
// Функция преобразует строковое представление версии (с тремя точками) к числовому (пригодному для сравнения)
Функция ВерсияСтрокаВЧисло(ВерсияСтрока) 
	
	Попытка
		Версия = ВерсияСтрока;
		Результат = Число(Лев(Версия, Найти(Версия, ".")-1));
		Версия = Сред(Версия, Найти(Версия, ".") + 1);
		Результат = Результат*100 + Число(Лев(Версия, Найти(Версия, ".")-1));
		Версия = Сред(Версия, Найти(Версия, ".") + 1);
		Результат = Результат*100 + Число(Лев(Версия, Найти(Версия, ".")-1));
		Версия = Сред(Версия, Найти(Версия, ".") + 1);
		Результат = Результат*100 + Число(Версия);
	Исключение
		Возврат 0;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти

