
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	
КонецПроцедуры



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыНаСервере()
	
	Если Объект.Ссылка = Справочники.ИнтеграцииСБанками.BAGAGE22 Тогда 
		Константы.ИспользоватьЗагрузкуИзБанка.Установить(Объект.ЗначениеКонстанты);
	ИначеЕсли Объект.Ссылка = Справочники.ИнтеграцииСБанками.TBCBGE22 Тогда
		Константы.ИнтеграцияСБанкомTBC.Установить(Объект.ЗначениеКонстанты);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьЗначениеКонстантыНаСервере();
	
КонецПроцедуры

