
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("Получатель") Тогда
		Запись.СтатусНапоминания = Параметры.СтатусНапоминания;
		Запись.Получатель = Параметры.Получатель;
		Запись.Отправитель = Параметры.Отправитель;
		Запись.Источник = Параметры.Источник;
		Возврат;
	КонецЕсли;	       
	
	Если Запись.СтатусНапоминания = Перечисления.AzRyСтатусНапоминания.Finnished Тогда
		ЭтаФорма.КоманднаяПанель.Доступность = РольДоступна("AzRyНапоминанияПользователяАдминистратор");
		Элементы.AzRyОтветственныйЗаСкладСтатусДокумента.ТолькоПросмотр = Не РольДоступна("AzRyНапоминанияПользователяАдминистратор");
		Элементы.Получатель.ТолькоПросмотр = Не РольДоступна("AzRyНапоминанияПользователяАдминистратор");
		Элементы.Отправитель.ТолькоПросмотр = Не РольДоступна("AzRyНапоминанияПользователяАдминистратор");
		Элементы.Источник.ТолькоПросмотр = Не РольДоступна("AzRyНапоминанияПользователяАдминистратор");
		Элементы.Комментарий.ТолькоПросмотр = Не РольДоступна("AzRyНапоминанияПользователяАдминистратор");
	Иначе
		ПравоНаРедактирование = Запись.Получатель = Пользователи.ТекущийПользователь() Или РольДоступна("AzRyНапоминанияПользователяАдминистратор");
		ЭтаФорма.КоманднаяПанель.Доступность = ПравоНаРедактирование;
		Элементы.AzRyОтветственныйЗаСкладСтатусДокумента.ТолькоПросмотр = Не ПравоНаРедактирование;
		Элементы.Получатель.ТолькоПросмотр = Не ПравоНаРедактирование;
		Элементы.Отправитель.ТолькоПросмотр = Не ПравоНаРедактирование;
		Элементы.Источник.ТолькоПросмотр = Не ПравоНаРедактирование;
		Элементы.Комментарий.ТолькоПросмотр = Не ПравоНаРедактирование;		
	КонецЕсли;
		
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ДанныеТаблицыЗначенийВТабличныйДокумент(ДанныеВТабличныйДокумент)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ДанныеВТабличныйДокумент);       
	Построитель.Вывести(ТабличныйДокумент);
		
	Возврат ТабличныйДокумент;

КонецФункции

&НаКлиенте
Процедура AzRyОтветственныйЗаСкладСтатусДокументаПриИзменении(Элемент)
	
	AzRyОтветственныйЗаСкладСтатусДокументаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура AzRyОтветственныйЗаСкладСтатусДокументаПриИзмененииНаСервере()
	
	Если Запись.СтатусНапоминания = Перечисления.AzRyСтатусНапоминания.ПодтверждениеОдобрено Или Запись.СтатусНапоминания = Перечисления.AzRyСтатусНапоминания.ПодтверждениеНеОдобрено Тогда
		
		Запись.Получатель = Параметры.Ключ.Отправитель;
		Запись.Отправитель   = Параметры.Ключ.Получатель;		
		
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура AzRyОтветственныйЗаСкладСтатусДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Запись.СтатусНапоминания = ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПустаяСсылка") Тогда
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ОжидаетПодтверждения"));
		
	ИначеЕсли Запись.СтатусНапоминания = ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ОжидаетПодтверждения") И ЗначениеЗаполнено(Параметры.Ключ) = Ложь Тогда // ახალის შემთხვევაში
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ОжидаетПодтверждения"));                                                                         

	ИначеЕсли Запись.СтатусНапоминания = ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ОжидаетПодтверждения") И ЗначениеЗаполнено(Параметры.Ключ) = Истина Тогда // არსებულის შემთხვევაში
		ДанныеВыбора = Новый СписокЗначений;
		//ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ОжидаетПодтверждения"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеОдобрено"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеНеОдобрено"));		
		
	ИначеЕсли Запись.СтатусНапоминания = ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеОдобрено") Тогда
		ДанныеВыбора = Новый СписокЗначений;
		//ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеОдобрено"));
		//ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеНеОдобрено"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.Finnished"));
		
	ИначеЕсли Запись.СтатусНапоминания = ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеНеОдобрено") Тогда
		ДанныеВыбора = Новый СписокЗначений;                                                                          
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ОжидаетПодтверждения"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеОдобрено"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеНеОдобрено"));
		
	КонецЕсли; 	
	
	Если РольДоступнаНаСервере("AzRyНапоминанияПользователяАдминистратор") Тогда
		СтандартнаяОбработка = Истина;		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция РольДоступнаНаСервере(Роль)

	Возврат РольДоступна(Роль);

КонецФункции
 
&НаКлиенте
Процедура КомандаТоварыВДокументе(Команда)
	
	//ТабДок = КомандаТоварыВДокументеНаСервере();
	//ТабДок.Показать("დოკუმენტის ნომენკლატურის სია");
	
	СтруктураПараметров = КомандаТоварыВДокументеНаСервере();
	ОткрытьФорму("ОбщаяФорма.AzRyРасш_НапоминанияПользователя", СтруктураПараметров,,,,,);
	
КонецПроцедуры

&НаСервере
Функция КомандаТоварыВДокументеНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	                                       
	Запрос = Новый Запрос;  
	Запрос.Текст = ТекстЗапросаТоварыВДокументе(Запись.Источник);
	Запрос.УстановитьПараметр("Ссылка", Запись.Источник);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ_Шапка = ТЗ.Скопировать();
	ТЗ_Шапка.Свернуть("Номер, Дата, Организация, Контрагент, Договор, СтруктурнаяЕдиница, Ячейка");
	
	Стр = Новый Структура("Номер, Дата, Организация, Контрагент, Договор, СтруктурнаяЕдиница, Ячейка, Таблица", 
							ТЗ_Шапка[0].Номер, ТЗ_Шапка[0].Дата, ТЗ_Шапка[0].Организация, ТЗ_Шапка[0].Контрагент, ТЗ_Шапка[0].Договор, ТЗ_Шапка[0].СтруктурнаяЕдиница, ТЗ_Шапка[0].Ячейка, Новый Массив);
	
	Для каждого ТекСтрока Из ТЗ Цикл
	
		Стр.Таблица.Добавить(Новый Структура("НоменклатураКод, Номенклатура, ЕдиницаИзмерения, Характеристика, Количество", ТекСтрока.НоменклатураКод, ТекСтрока.Номенклатура, ТекСтрока.ЕдиницаИзмерения, ТекСтрока.Характеристика, ТекСтрока.Количество));		
	
	КонецЦикла;
	
	//Кеш = Новый Соответствие;
	//Кеш.Вставить(1, "კოდი");
	//Кеш.Вставить(2, "ნომენკლატურა");
	//Кеш.Вставить(3, "ზომის ერთეული");
	//Кеш.Вставить(4, "მახასიათებელი");
	//Кеш.Вставить(5, "რაოდენობა");
	//
	//ТабДок = Новый ТабличныйДокумент;
	//Сч = 1;
	//Для Каждого Колонка Из ТЗ.Колонки Цикл
	//	ТабДок.Область(1, Сч).Текст = Кеш.Получить(Сч);
	//	Сч = Сч + 1
	//КонецЦикла;
	//
	//КоличествоКолонок = ТЗ.Колонки.Количество();
	//
	//ТекущаяСтрока = 2;
	//Для Каждого Стр Из ТЗ Цикл
	//	Для Сч = 1 По КоличествоКолонок Цикл
	//		ТабДок.Область(ТекущаяСтрока, Сч).Текст = Стр[Сч - 1];			
	//	КонецЦикла;
	//	ТекущаяСтрока = ТекущаяСтрока + 1;
	//КонецЦикла;
	//
	//УстановитьПривилегированныйРежим(Ложь);
	//
	//Возврат ТабДок;
	
	Возврат Стр;
КонецФункции

&НаСервере
Функция ТекстЗапросаТоварыВДокументе(СсылкаДокумента)

	ТексЗапроса = "";
	
	Если Тип("ДокументСсылка.ПриходнаяНакладная") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ПриходнаяНакладнаяЗапасы.Номенклатура.Код КАК НоменклатураКод,
		              |	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
		              |	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ПриходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
		              |	ПриходнаяНакладнаяЗапасы.Количество КАК Количество,
		              |	ПриходнаяНакладнаяЗапасы.Ссылка.Номер КАК Номер,
		              |	ПриходнаяНакладнаяЗапасы.Ссылка.Дата КАК Дата,
		              |	ПриходнаяНакладнаяЗапасы.Ссылка.Организация КАК Организация,
		              |	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент КАК Контрагент,
		              |	ПриходнаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
		              |	ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		              |	ПриходнаяНакладнаяЗапасы.Ссылка.Ячейка КАК Ячейка
		              |ИЗ
		              |	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		              |ГДЕ
		              |	ПриходнаяНакладнаяЗапасы.Ссылка = &Ссылка
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	ПриходнаяНакладнаяРасходы.Номенклатура.Код,
		              |	ПриходнаяНакладнаяРасходы.Номенклатура,
		              |	ПриходнаяНакладнаяРасходы.ЕдиницаИзмерения,
		              |	NULL,
		              |	ПриходнаяНакладнаяРасходы.Количество,
		              |	ПриходнаяНакладнаяРасходы.Ссылка.Номер,
		              |	ПриходнаяНакладнаяРасходы.Ссылка.Дата,
		              |	ПриходнаяНакладнаяРасходы.Ссылка.Организация,
		              |	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент,
		              |	ПриходнаяНакладнаяРасходы.Ссылка.Договор,
		              |	ПриходнаяНакладнаяРасходы.Ссылка.СтруктурнаяЕдиница,
		              |	ПриходнаяНакладнаяРасходы.Ссылка.Ячейка
		              |ИЗ
		              |	Документ.ПриходнаяНакладная.Расходы КАК ПриходнаяНакладнаяРасходы
		              |ГДЕ
		              |	ПриходнаяНакладнаяРасходы.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.АвансовыйОтчет") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	АвансовыйОтчетЗапасы.Номенклатура.Код КАК НоменклатураКод,
		              |	АвансовыйОтчетЗапасы.Номенклатура КАК Номенклатура,
		              |	АвансовыйОтчетЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	АвансовыйОтчетЗапасы.Характеристика КАК Характеристика,
		              |	АвансовыйОтчетЗапасы.Количество КАК Количество,
		              |	АвансовыйОтчетЗапасы.Ссылка.Номер КАК Номер,
		              |	АвансовыйОтчетЗапасы.Ссылка.Дата КАК Дата,
		              |	АвансовыйОтчетЗапасы.Ссылка.Организация КАК Организация,
		              |	НЕОПРЕДЕЛЕНО КАК Контрагент,
		              |	НЕОПРЕДЕЛЕНО КАК Договор,
		              |	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
		              |	НЕОПРЕДЕЛЕНО КАК Ячейка
		              |ИЗ
		              |	Документ.АвансовыйОтчет.Запасы КАК АвансовыйОтчетЗапасы
		              |ГДЕ
		              |	АвансовыйОтчетЗапасы.Ссылка = &Ссылка
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	АвансовыйОтчетРасходы.Номенклатура.Код,
		              |	АвансовыйОтчетРасходы.Номенклатура,
		              |	АвансовыйОтчетРасходы.ЕдиницаИзмерения,
		              |	NULL,
		              |	АвансовыйОтчетРасходы.Количество,
		              |	АвансовыйОтчетРасходы.Ссылка.Номер,
		              |	АвансовыйОтчетРасходы.Ссылка.Дата,
		              |	АвансовыйОтчетРасходы.Ссылка.Организация,
		              |	НЕОПРЕДЕЛЕНО,
		              |	НЕОПРЕДЕЛЕНО,
		              |	НЕОПРЕДЕЛЕНО,
		              |	НЕОПРЕДЕЛЕНО
		              |ИЗ
		              |	Документ.АвансовыйОтчет.Расходы КАК АвансовыйОтчетРасходы
		              |ГДЕ
		              |	АвансовыйОтчетРасходы.Ссылка = &Ссылка";		
		
	ИначеЕсли Тип("ДокументСсылка.ЗаказПокупателя") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ЗаказПокупателяЗапасы.Номенклатура.Код КАК НоменклатураКод,
		              |	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
		              |	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
		              |	ЗаказПокупателяЗапасы.Количество КАК Количество,
		              |	ЗаказПокупателяЗапасы.Ссылка.Номер КАК Номер,
		              |	ЗаказПокупателяЗапасы.Ссылка.Дата КАК Дата,
		              |	ЗаказПокупателяЗапасы.Ссылка.Организация КАК Организация,
		              |	ЗаказПокупателяЗапасы.Ссылка.Контрагент КАК Контрагент,
		              |	ЗаказПокупателяЗапасы.Ссылка.Договор КАК Договор,
		              |	ЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаПродажи КАК СтруктурнаяЕдиница,
		              |	ЗаказПокупателяЗапасы.Ссылка.Ячейка КАК Ячейка
		              |ИЗ
		              |	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		              |ГДЕ
		              |	ЗаказПокупателяЗапасы.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.ОприходованиеЗапасов") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ОприходованиеЗапасовЗапасы.Номенклатура.Код КАК НоменклатураКод,
		              |	ОприходованиеЗапасовЗапасы.Номенклатура КАК Номенклатура,
		              |	ОприходованиеЗапасовЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ОприходованиеЗапасовЗапасы.Характеристика КАК Характеристика,
		              |	ОприходованиеЗапасовЗапасы.Количество КАК Количество,
		              |	ОприходованиеЗапасовЗапасы.Ссылка.Номер КАК Номер,
		              |	ОприходованиеЗапасовЗапасы.Ссылка.Дата КАК Дата,
		              |	ОприходованиеЗапасовЗапасы.Ссылка.Организация КАК Организация,
		              |	ОприходованиеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		              |	ОприходованиеЗапасовЗапасы.Ссылка.Ячейка КАК Ячейка,
		              |	НЕОПРЕДЕЛЕНО КАК Контрагент,
		              |	НЕОПРЕДЕЛЕНО КАК Договор
		              |ИЗ
		              |	Документ.ОприходованиеЗапасов.Запасы КАК ОприходованиеЗапасовЗапасы
		              |ГДЕ
		              |	ОприходованиеЗапасовЗапасы.Ссылка = &Ссылка";

	ИначеЕсли Тип("ДокументСсылка.ОтчетОРозничныхПродажах") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ОтчетОРозничныхПродажах.Номенклатура.Код КАК НоменклатураКод,
		              |	ОтчетОРозничныхПродажах.Номенклатура КАК Номенклатура,
		              |	ОтчетОРозничныхПродажах.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ОтчетОРозничныхПродажах.Характеристика КАК Характеристика,
		              |	ОтчетОРозничныхПродажах.Количество КАК Количество,
		              |	ОтчетОРозничныхПродажах.Ссылка.Номер КАК Номер,
		              |	ОтчетОРозничныхПродажах.Ссылка.Дата КАК Дата,
		              |	ОтчетОРозничныхПродажах.Ссылка.Организация КАК Организация,
		              |	ОтчетОРозничныхПродажах.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		              |	НЕОПРЕДЕЛЕНО КАК Ячейка,
		              |	НЕОПРЕДЕЛЕНО КАК Контрагент,
		              |	НЕОПРЕДЕЛЕНО КАК Договор
		              |ИЗ
		              |	Документ.ОтчетОРозничныхПродажах.Запасы КАК ОтчетОРозничныхПродажах
		              |ГДЕ
		              |	ОтчетОРозничныхПродажах.Ссылка = &Ссылка";

	ИначеЕсли Тип("ДокументСсылка.ПеремещениеЗапасов") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ПеремещениеЗапасов.Номенклатура.Код КАК НоменклатураКод,
		              |	ПеремещениеЗапасов.Номенклатура КАК Номенклатура,
		              |	ПеремещениеЗапасов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ПеремещениеЗапасов.Характеристика КАК Характеристика,
		              |	ПеремещениеЗапасов.Количество КАК Количество,
		              |	ПеремещениеЗапасов.Ссылка.Номер КАК Номер,
		              |	ПеремещениеЗапасов.Ссылка.Дата КАК Дата,
		              |	ПеремещениеЗапасов.Ссылка.Организация КАК Организация,
		              |	ПеремещениеЗапасов.Ссылка.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиница,
		              |	ПеремещениеЗапасов.Ссылка.ЯчейкаПолучатель КАК Ячейка,
					  |	НЕОПРЕДЕЛЕНО КАК Контрагент,
		              |	НЕОПРЕДЕЛЕНО КАК Договор
		              |ИЗ
		              |	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасов
		              |ГДЕ
		              |	ПеремещениеЗапасов.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.ПеремещениеПоЯчейкам") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ПеремещениеПоЯчейкам.Номенклатура.Код КАК НоменклатураКод,
		              |	ПеремещениеПоЯчейкам.Номенклатура КАК Номенклатура,
		              |	ПеремещениеПоЯчейкам.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ПеремещениеПоЯчейкам.Характеристика КАК Характеристика,
		              |	ПеремещениеПоЯчейкам.Количество КАК Количество,
		              |	ПеремещениеПоЯчейкам.Ссылка.Номер КАК Номер,
		              |	ПеремещениеПоЯчейкам.Ссылка.Дата КАК Дата,
		              |	ПеремещениеПоЯчейкам.Ссылка.Организация КАК Организация,
		              |	ПеремещениеПоЯчейкам.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		              |	ПеремещениеПоЯчейкам.Ссылка.Ячейка КАК Ячейка,
		              |	НЕОПРЕДЕЛЕНО КАК Контрагент,
		              |	НЕОПРЕДЕЛЕНО КАК Договор
		              |ИЗ
		              |	Документ.ПеремещениеПоЯчейкам.Запасы КАК ПеремещениеПоЯчейкам
		              |ГДЕ
		              |	ПеремещениеПоЯчейкам.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.РасходнаяНакладная") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	РасходнаяНакладная.Номенклатура.Код КАК НоменклатураКод,
		              |	РасходнаяНакладная.Номенклатура КАК Номенклатура,
		              |	РасходнаяНакладная.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	РасходнаяНакладная.Характеристика КАК Характеристика,
		              |	РасходнаяНакладная.Количество КАК Количество,
		              |	РасходнаяНакладная.Ссылка.Номер КАК Номер,
		              |	РасходнаяНакладная.Ссылка.Дата КАК Дата,
		              |	РасходнаяНакладная.Ссылка.Организация КАК Организация,
		              |	РасходнаяНакладная.Ссылка.Контрагент КАК Контрагент,
		              |	РасходнаяНакладная.Ссылка.Договор КАК Договор,
		              |	РасходнаяНакладная.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		              |	РасходнаяНакладная.Ссылка.Ячейка КАК Ячейка
		              |ИЗ
		              |	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладная
		              |ГДЕ
		              |	РасходнаяНакладная.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.ПриходныйОрдер") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ПриходныйОрдер.Номенклатура.Код КАК НоменклатураКод,
		              |	ПриходныйОрдер.Номенклатура КАК Номенклатура,
		              |	ПриходныйОрдер.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ПриходныйОрдер.Характеристика КАК Характеристика,
		              |	ПриходныйОрдер.Количество КАК Количество,
		              |	ПриходныйОрдер.Ссылка.Номер КАК Номер,
		              |	ПриходныйОрдер.Ссылка.Дата КАК Дата,
		              |	ПриходныйОрдер.Ссылка.Организация КАК Организация,
		              |	ПриходныйОрдер.Ссылка.Контрагент КАК Контрагент,
		              |	ПриходныйОрдер.Ссылка.Договор КАК Договор,
		              |	ПриходныйОрдер.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		              |	ПриходныйОрдер.Ссылка.Ячейка КАК Ячейка
		              |ИЗ
		              |	Документ.ПриходныйОрдер.Запасы КАК ПриходныйОрдер
		              |ГДЕ
		              |	ПриходныйОрдер.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.ПриходныйОрдер") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ПриходныйОрдер.Номенклатура.Код КАК НоменклатураКод,
		              |	ПриходныйОрдер.Номенклатура КАК Номенклатура,
		              |	ПриходныйОрдер.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ПриходныйОрдер.Характеристика КАК Характеристика,
		              |	ПриходныйОрдер.Количество КАК Количество,
		              |	ПриходныйОрдер.Ссылка.Номер КАК Номер,
		              |	ПриходныйОрдер.Ссылка.Дата КАК Дата,
		              |	ПриходныйОрдер.Ссылка.Организация КАК Организация,
		              |	ПриходныйОрдер.Ссылка.Контрагент КАК Контрагент,
		              |	ПриходныйОрдер.Ссылка.Договор КАК Договор,
		              |	ПриходныйОрдер.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		              |	ПриходныйОрдер.Ссылка.Ячейка КАК Ячейка
		              |ИЗ
		              |	Документ.ПриходныйОрдер.Запасы КАК ПриходныйОрдер
		              |ГДЕ
		              |	ПриходныйОрдер.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.СборкаЗапасов") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	СборкаЗапасов.Номенклатура.Код КАК НоменклатураКод,
		              |	СборкаЗапасов.Номенклатура КАК Номенклатура,
		              |	СборкаЗапасов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	СборкаЗапасов.Характеристика КАК Характеристика,
		              |	СборкаЗапасов.Количество КАК Количество,
		              |	СборкаЗапасов.Ссылка.Номер КАК Номер,
		              |	СборкаЗапасов.Ссылка.Дата КАК Дата,
		              |	СборкаЗапасов.Ссылка.Организация КАК Организация,
		              |	СборкаЗапасов.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		              |	СборкаЗапасов.Ссылка.Ячейка КАК Ячейка,
		              |	НЕОПРЕДЕЛЕНО КАК Контрагент,
		              |	НЕОПРЕДЕЛЕНО КАК Договор
		              |ИЗ
		              |	Документ.СборкаЗапасов.Продукция КАК СборкаЗапасов
		              |ГДЕ
		              |	СборкаЗапасов.Ссылка = &Ссылка
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	СборкаЗапасов.Номенклатура.Код,
		              |	СборкаЗапасов.Номенклатура,
		              |	СборкаЗапасов.ЕдиницаИзмерения,
		              |	NULL,
		              |	СборкаЗапасов.Количество,
		              |	СборкаЗапасов.Ссылка.Номер,
		              |	СборкаЗапасов.Ссылка.Дата,
		              |	СборкаЗапасов.Ссылка.Организация,
		              |	СборкаЗапасов.Ссылка.СтруктурнаяЕдиница,
		              |	СборкаЗапасов.Ссылка.Ячейка,
		              |	NULL,
		              |	NULL
		              |ИЗ
		              |	Документ.СборкаЗапасов.Запасы КАК СборкаЗапасов
		              |ГДЕ
		              |	СборкаЗапасов.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.СборкаЗапасов") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ЧекККМЗапасы.Номенклатура.Код КАК НоменклатураКод,
		              |	ЧекККМЗапасы.Номенклатура КАК Номенклатура,
		              |	ЧекККМЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ЧекККМЗапасы.Характеристика КАК Характеристика,
		              |	ЧекККМЗапасы.Количество КАК Количество,
		              |	ЧекККМЗапасы.Ссылка.Номер КАК Номер,
		              |	ЧекККМЗапасы.Ссылка.Дата КАК Дата,
		              |	ЧекККМЗапасы.Ссылка.Организация КАК Организация,
		              |	ЧекККМЗапасы.Ссылка.Контрагент КАК Контрагент,
		              |	ЧекККМЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		              |	НЕОПРЕДЕЛЕНО КАК Ячейка,
		              |	НЕОПРЕДЕЛЕНО КАК Договор
		              |ИЗ
		              |	Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
		              |ГДЕ
		              |	ЧекККМЗапасы.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.ЧекККМВозврат") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ЧекККМВозврат.Номенклатура.Код КАК НоменклатураКод,
		              |	ЧекККМВозврат.Номенклатура КАК Номенклатура,
		              |	ЧекККМВозврат.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ЧекККМВозврат.Характеристика КАК Характеристика,
		              |	ЧекККМВозврат.Количество КАК Количество,
		              |	ЧекККМВозврат.Ссылка.Номер КАК Номер,
		              |	ЧекККМВозврат.Ссылка.Дата КАК Дата,
		              |	ЧекККМВозврат.Ссылка.Организация КАК Организация,
		              |	ЧекККМВозврат.Ссылка.Контрагент КАК Контрагент,
		              |	ЧекККМВозврат.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		              |	НЕОПРЕДЕЛЕНО КАК Ячейка,
		              |	НЕОПРЕДЕЛЕНО КАК Договор
		              |ИЗ
		              |	Документ.ЧекККМВозврат.Запасы КАК ЧекККМВозврат
		              |ГДЕ
		              |	ЧекККМВозврат.Ссылка = &Ссылка";		
			
	КонецЕсли; 
	
	Возврат ТексЗапроса;

КонецФункции



