
&НаКлиенте
Процедура Команда1(Команда)

	Если Не ЗначениеЗаполнено(Организация) Тогда
		Сообщить(НСтр("ru = 'Поле Организация не заполнено!'; ka = 'ორგანიზაციის ველი ცარიელია!'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата1) Тогда
		Сообщить(НСтр("ru = 'Поле Дата старая  не заполнено!'; ka = 'ძველი თარიღის ველი ცარიელია!'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата2) Тогда
		Сообщить(НСтр("ru = 'Поле Дата новая  не заполнено!'; ka = 'ახალი თარიღის ველი ცარიელია!'"));
		Возврат;
	КонецЕсли;	
		
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос(НСтр("ru = 'Продолжить выполнение операции?'; ka = 'მოხდეს ოპერაციის გაგრძელება?'; en = 'Do you want to continue?'"), Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Команда1НаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходСоСчета.Ссылка КАК Ссылка,
		|	РасходСоСчета.Дата КАК Дата,
		|	РасходСоСчета.Организация КАК Организация,
		|	РасходСоСчета.ВидОперации КАК ВидОперации
		|ИЗ
		|	Документ.РасходСоСчета КАК РасходСоСчета
		|ГДЕ
		|	РасходСоСчета.Проведен = ИСТИНА
		|	И РасходСоСчета.Дата МЕЖДУ &Дата1 И &Дата2 
		|	И РасходСоСчета.ВидОперации = &ВидОперации
		|	И РасходСоСчета.Организация = &Организация ";
	
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРасходСоСчета.Зарплата);
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата1));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		О = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		О.Дата = КонецДня(Дата2);
		О.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидыОперацийРасходСоСчета = Перечисления.ВидыОперацийРасходСоСчета.Зарплата;	
	
КонецПроцедуры
