
&НаСервере
Процедура ПолучитьПараметрыЗаполнения(СтруктураЗаполнения)
	
	СтруктураЗаполнения.Вставить("Договор", СтруктураЗаполнения.Контрагент.ДоговорПоУмолчанию);
	СтруктураЗаполнения.Вставить("ОснованиеПечатиСсылка", СтруктураЗаполнения.Контрагент.ДоговорПоУмолчанию);
	СтруктураЗаполнения.Вставить("ОснованиеПечати", Нстр("ka='Договор: ';ru='Договор: '") + СтруктураЗаполнения.Контрагент.ДоговорПоУмолчанию.Наименование);
	СтруктураЗаполнения.Вставить("ВидОперации", Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд);
	СтруктураЗаполнения.Вставить("ЭтоГруппа", СтруктураЗаполнения.Контрагент.ЭтоГруппа);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("Контрагент", ПараметрКоманды);
	ПолучитьПараметрыЗаполнения(СтруктураЗаполнения);
	
	Если СтруктураЗаполнения.ЭтоГруппа Тогда
		ВызватьИсключение НСтр("ka='კონტრაგენტების ჯგუფის არჩევა არ შეიძლება.';ru='Нельзя выбирать группу контрагентов.';en='You can not select a group of counterparties.'");
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаказПокупателя.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения));
	
КонецПроцедуры
