
#Область ОписаниеНастроек

Процедура РазделыНастроек(ДеревоРазделов, знач РежимРаботы) Экспорт
	
	Раздел_Компания = ДеревоРазделов.Строки.Добавить();
	Раздел_Компания.Идентификатор = "Компания";
	Раздел_Компания.Представление = НСтр("ka='კომპანია';ru='Компания';en='Company'");
	
	Раздел_CRM = ДеревоРазделов.Строки.Добавить();
	Раздел_CRM.Идентификатор = "CRM";
	Раздел_CRM.Представление = НСтр("ka='CRM';ru='CRM';en='CRM'");
	
	Раздел_Продажи = ДеревоРазделов.Строки.Добавить();
	Раздел_Продажи.Идентификатор = "Продажи";
	Раздел_Продажи.Представление = НСтр("ka='გაყიდვები';ru='Продажи';en='the sale'");
	
	Раздел_Закупки = ДеревоРазделов.Строки.Добавить();
	Раздел_Закупки.Идентификатор = "Закупки";
	Раздел_Закупки.Представление = НСтр("ka='შესყიდვები';ru='Закупки';en='purchases'");
	
	Раздел_Работы = ДеревоРазделов.Строки.Добавить();
	Раздел_Работы.Идентификатор = "Работы";
	Раздел_Работы.Представление = НСтр("ka='სამუშაოები';ru='Работы';en='work'");
	
	Раздел_Производство = ДеревоРазделов.Строки.Добавить();
	Раздел_Производство.Идентификатор = "Производство";
	Раздел_Производство.Представление = НСтр("ka='წარმოება';ru='Производство';en='Production'");
	
	Раздел_Деньги = ДеревоРазделов.Строки.Добавить();
	Раздел_Деньги.Идентификатор = "Деньги";
	Раздел_Деньги.Представление = НСтр("ka='ფული';ru='Деньги';en='Money'");
	
	Раздел_Зарплата = ДеревоРазделов.Строки.Добавить();
	Раздел_Зарплата.Идентификатор = "Зарплата";
	Раздел_Зарплата.Представление = НСтр("ka='ხელფასი';ru='Зарплата';en='Salary'");
	
	Раздел_Персональные = ДеревоРазделов.Строки.Добавить();
	Раздел_Персональные.Идентификатор = "Персональные";
	Раздел_Персональные.Представление = НСтр("ka='პერსონალური პარამეტრები';ru='Персональные настройки';en='personal settings'");
	
	Раздел_ПочтаSMS = Раздел_Персональные.Строки.Добавить();
	Раздел_ПочтаSMS.Идентификатор = "ПочтаSMS";
	Раздел_ПочтаSMS.Представление = НСтр("ka='ფოსტა და SMS';ru='Почта и SMS';en='Mail and SMS'");
	
	Раздел_Телефония = Раздел_Персональные.Строки.Добавить();
	Раздел_Телефония.Идентификатор = "Телефония";
	Раздел_Телефония.Представление = НСтр("ka='ტელეფონია';ru='Телефония';en='Telephony'");
	
	Раздел_ОбменСGoogle = Раздел_Персональные.Строки.Добавить();
	Раздел_ОбменСGoogle.Идентификатор = "ОбменСGoogle";
	Раздел_ОбменСGoogle.Представление = НСтр("ka='გაცვლა Google-თან';ru='Обмен с Google';en='Sharing with Google'");
	
	Раздел_ПерсональныеПараметрыПечати = Раздел_Персональные.Строки.Добавить();
	Раздел_ПерсональныеПараметрыПечати.Идентификатор = "ПерсональныеПараметрыПечати";
	Раздел_ПерсональныеПараметрыПечати.Представление = НСтр("ka='ბეჭდვის პარამეტრები';ru='Параметры печати';en='Print Settings'");
	
	Раздел_РаботаСФайлами = Раздел_Персональные.Строки.Добавить();
	Раздел_РаботаСФайлами.Идентификатор = "РаботаСФайлами";
	Раздел_РаботаСФайлами.Представление = НСтр("ka='ფაილებთან მუშაობა';ru='Работа с файлами';en='Working with Files'");
	
	Раздел_Прочее = Раздел_Персональные.Строки.Добавить();
	Раздел_Прочее.Идентификатор = "Прочее";
	Раздел_Прочее.Представление = НСтр("ka='სხვა დანარჩენი';ru='Прочее';en='Other'");
	
	Раздел_Интеграция = ДеревоРазделов.Строки.Добавить();
	Раздел_Интеграция.Идентификатор = "Интеграция";
	Раздел_Интеграция.Представление = НСтр("ka='სხვა პროგრამებთან ინტეგრაცია';ru='Интеграция с другими программами';en='Integration with other programs'");
	
	//+++Дмгг
	Раздел_Имущество = ДеревоРазделов.Строки.Добавить();
	Раздел_Имущество.Идентификатор = "Имущество";
	Раздел_Имущество.Представление = НСтр("ka='ძირითადი საშუალებები';ru='Имущество';en='Property'");
	//--- Дмгг
	
	////-------------------------- // Россофт // --->
	Раздел_Программы1СПредприятие = Раздел_Интеграция.Строки.Добавить();
	Раздел_Программы1СПредприятие.Идентификатор = "ИнтеграцияСНалоговойСлужбойГрузии";
	Раздел_Программы1СПредприятие.Представление = НСтр("ka='შემოსავლების სამსახურთან ინტეგრაცია rs.ge';ru='Интеграция с налоговой службой грузии rs.ge';en='Integration with the Internal Revenue Service of Georgia rs.ge'");
	////-------------------------- //Россофт  // <---
	
	Раздел_Программы1СПредприятие = Раздел_Интеграция.Строки.Добавить();
	Раздел_Программы1СПредприятие.Идентификатор = "Программы1СПредприятие";
	Раздел_Программы1СПредприятие.Представление = НСтр("ka='1C: საწარმოს პროგრამებთან ინტეგრაცია';ru='Синхронизация с программами 1С:Предприятие';en='Synchronization with programs 1C: Enterprise'");
	
	Раздел_СинхронизацияСМобильнымПриложением = Раздел_Интеграция.Строки.Добавить();
	Раздел_СинхронизацияСМобильнымПриложением.Идентификатор = "СинхронизацияСМобильнымПриложением";
	Раздел_СинхронизацияСМобильнымПриложением.Представление = НСтр("ka='სინქრონიზაცია მობილურ დანართთან';ru='Синхронизация с мобильным приложением';en='Sync with your mobile app'");
	
	Раздел_ОбменССайтом = Раздел_Интеграция.Строки.Добавить();
	Раздел_ОбменССайтом.Идентификатор = "ОбменССайтом";
	Раздел_ОбменССайтом.Представление = НСтр("ka='საიტთან გაცვლა';ru='Обмен с сайтом';en='Exchange with the site'");
	
	Раздел_ЯндексДоставка = Раздел_Интеграция.Строки.Добавить();
	Раздел_ЯндексДоставка.Идентификатор = "ЯндексДоставка";
	Раздел_ЯндексДоставка.Представление = НСтр("ka='იანდექს მოწოდება';ru='Яндекс.Доставка';en='Yandeks.Dostavka'");
	
	Раздел_ОбменЭлектроннымиДокументами = ДеревоРазделов.Строки.Добавить();
	Раздел_ОбменЭлектроннымиДокументами.Идентификатор = "ОбменЭлектроннымиДокументами";
	Раздел_ОбменЭлектроннымиДокументами.Представление = НСтр("ka='ელექტრონული დოკუმენტებით გაცვლა';ru='Обмен электронными документами';en='Exchange of electronic documents'");
	
	Раздел_ОбменСКонтрагентами = Раздел_ОбменЭлектроннымиДокументами.Строки.Добавить();
	Раздел_ОбменСКонтрагентами.Идентификатор = "ОбменСКонтрагентами";
	Раздел_ОбменСКонтрагентами.Представление = НСтр("ka='კონტრაგენტებთან გაცვლა';ru='Обмен с контрагентами';en='Exchange with counterparts'");
	
	Раздел_ОбменСБанками = Раздел_ОбменЭлектроннымиДокументами.Строки.Добавить();
	Раздел_ОбменСБанками.Идентификатор = "ОбменСБанками";
	Раздел_ОбменСБанками.Представление = НСтр("ka='ბანკებთან გაცვლა';ru='Обмен с банками';en='Exchange with the banks'");
	
	Раздел_Администрирование = ДеревоРазделов.Строки.Добавить();
	Раздел_Администрирование.Идентификатор = "Администрирование";
	Раздел_Администрирование.Представление = НСтр("ka='ადმინისტრირება';ru='Администрирование';en='Administration'");
	
	Раздел_ОбщиеНастройки = Раздел_Администрирование.Строки.Добавить();
	Раздел_ОбщиеНастройки.Идентификатор = "ОбщиеНастройки";
	Раздел_ОбщиеНастройки.Представление = НСтр("ka='საერთო გასწორებები';ru='Общие настройки';en='General settings'");
	
	Раздел_ПоддержкаИОбслуживание = Раздел_Администрирование.Строки.Добавить();
	Раздел_ПоддержкаИОбслуживание.Идентификатор = "ПоддержкаИОбслуживание";
	Раздел_ПоддержкаИОбслуживание.Представление = НСтр("ka='მხარდაჭერა და მომსახურება';ru='Поддержка и обслуживание';en='Support and service'");
	
	Раздел_ИнтернетПоддержкаПользователей = Раздел_Администрирование.Строки.Добавить();
	Раздел_ИнтернетПоддержкаПользователей.Идентификатор = "ИнтернетПоддержкаПользователей";
	Раздел_ИнтернетПоддержкаПользователей.Представление = НСтр("ka='მომხმარებლების ინტერნეტ-მხარდაჭერა';ru='Интернет-поддержка пользователей';en='Internet-user support'");
	
	Раздел_ПереходМеждуЛокальнымИСервиснымРежимамиРаботы = Раздел_Администрирование.Строки.Добавить();
	Раздел_ПереходМеждуЛокальнымИСервиснымРежимамиРаботы.Идентификатор = "ПереходМеждуЛокальнымИСервиснымРежимамиРаботы";
	Раздел_ПереходМеждуЛокальнымИСервиснымРежимамиРаботы.Представление = НСтр("ka='სერვისში მუშაობა';ru='Работа в сервисе';en='Work when'");
	
	Раздел_ВерсионированиеОбъектов = Раздел_Администрирование.Строки.Добавить();
	Раздел_ВерсионированиеОбъектов.Идентификатор = "ВерсионированиеОбъектов";
	Раздел_ВерсионированиеОбъектов.Представление = НСтр("ka='ობიექტების ვერსიების წარმოშობა';ru='Версионирование объектов';en='versioning of files'");
	
	Раздел_ДополнительныеРеквизиты = Раздел_Администрирование.Строки.Добавить();
	Раздел_ДополнительныеРеквизиты.Идентификатор = "ДополнительныеРеквизиты";
	Раздел_ДополнительныеРеквизиты.Представление = НСтр("ka='დამატებითი რეკვიზიტები';ru='Дополнительные реквизиты';en='Additional Information'");
	
	Раздел_КонтактнаяИнформация = Раздел_Администрирование.Строки.Добавить();
	Раздел_КонтактнаяИнформация.Идентификатор = "КонтактнаяИнформация";
	Раздел_КонтактнаяИнформация.Представление = НСтр("ka='საკონტაქტო ინფორმაცია';ru='Контактная информация';en='Contact Information'");
	
	Раздел_НастройкиПользователейИПрав = Раздел_Администрирование.Строки.Добавить();
	Раздел_НастройкиПользователейИПрав.Идентификатор = "НастройкиПользователейИПрав";
	Раздел_НастройкиПользователейИПрав.Представление = НСтр("ka='მომხმარებლების და უფლებების გამართვები';ru='Настройки пользователей и прав';en='Settings and user rights'");
	
	Раздел_ПроверкаКонтрагентов = Раздел_Администрирование.Строки.Добавить();
	Раздел_ПроверкаКонтрагентов.Идентификатор = "ПроверкаКонтрагентов";
	Раздел_ПроверкаКонтрагентов.Представление = НСтр("ka='კონტრაგენტების შემოწმება';ru='Проверка контрагентов';en='Checking counterparties'");
	
	Раздел_КорректировкаДанных = Раздел_Администрирование.Строки.Добавить();
	Раздел_КорректировкаДанных.Идентификатор = "КорректировкаДанных";
	Раздел_КорректировкаДанных.Представление = НСтр("ka='მონაცემების კორექტირება';ru='Корректировка данных';en='Correction data'");
	
	Раздел_ПечатныеФормыОтчетыОбработки = Раздел_Администрирование.Строки.Добавить();
	Раздел_ПечатныеФормыОтчетыОбработки.Идентификатор = "ПечатныеФормыОтчетыОбработки";
	Раздел_ПечатныеФормыОтчетыОбработки.Представление = НСтр("ka='საბეჭდი ფორმები, ანგარიშგებები და დამუშავებები';ru='Печатные формы, отчеты и обработки';en='Printed forms, reports and processing'");
	
	Раздел_Органайзер = Раздел_Администрирование.Строки.Добавить();
	Раздел_Органайзер.Идентификатор = "Органайзер";
	Раздел_Органайзер.Представление = НСтр("ka='ფოსტა ,SMS და შეხსენება';ru='Почта, SMS, напоминания';en='Mail, SMS, reminders'");
	
	Раздел_НастройкиРаботыСФайлами = Раздел_Администрирование.Строки.Добавить();
	Раздел_НастройкиРаботыСФайлами.Идентификатор = "НастройкиРаботыСФайлами";
	Раздел_НастройкиРаботыСФайлами.Представление = НСтр("ka='ფაილებთან მუშაობა';ru='Работа с файлами';en='Working with Files'");
	
	Раздел_ПодключаемоеОборудование = Раздел_Администрирование.Строки.Добавить();
	Раздел_ПодключаемоеОборудование.Идентификатор = "ПодключаемоеОборудование";
	Раздел_ПодключаемоеОборудование.Представление = НСтр("ka='შესაერთებელი მოწყობილობა';ru='Подключаемое оборудование';en='Device Connectivity'");
	
	Раздел_ЗащитаПерсональныхДанных = Раздел_Администрирование.Строки.Добавить();
	Раздел_ЗащитаПерсональныхДанных.Идентификатор = "ЗащитаПерсональныхДанных";
	Раздел_ЗащитаПерсональныхДанных.Представление = НСтр("ka='პერსონალური მონაცემების დაცვა';ru='Защита персональных данных';en='Protection of personal information'");
	
	Раздел_ОценкаПроизводительностиИЦентрМониторинга = Раздел_Администрирование.Строки.Добавить();
	Раздел_ОценкаПроизводительностиИЦентрМониторинга.Идентификатор = "ОценкаПроизводительностиИЦентрМониторинга";
	Раздел_ОценкаПроизводительностиИЦентрМониторинга.Представление = НСтр("ka='მწარმოებლურობის მონიტორინგი და შეფასება';ru='Мониторинг и оценка производительности';en='Monitoring and evaluating the performance'");
	
	Раздел_РегламентныеОперации = Раздел_Администрирование.Строки.Добавить();
	Раздел_РегламентныеОперации.Идентификатор = "РегламентныеОперации";
	Раздел_РегламентныеОперации.Представление = НСтр("ka='სარეგლამენტო ოპერაციები';ru='Регламентные операции';en='routine operations'");
	
КонецПроцедуры

Процедура НастройкиПрограммы(ТаблицаНастроек, знач РежимРаботы) Экспорт
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьНесколькоОрганизаций",
		"Компания",
		НСтр("ka='რამდენიმეორგანიზაცია';ru='Несколько организаций';en='several organizations'"),
		НСтр("ka='პროგრამულ პროდუქტში გათვალისწინებულია როგორც ერთი ორგანიზაციის (მეწარმეს, იურიდიული პირის წარმოშობის გარეშე), ასევე ორის და მეტის აღრიცხვის წარმოების შესაძლებლობა. თუ რამდენიმე ორგანიზაციის მიხედვით აღრიცხვა აუცილებელია, მაშინ საჭიროა ამ ოპციის დაყენება.';ru='В программном продукте предусмотрена возможность ведения учета как по одной организации (предпринимателю без образования юридического лица), так и по двум и более. Если учет по нескольким организациям необходим, то нужно установить эту опцию.';en='The software product provides the opportunity to record-keeping both in the same organization (entrepreneur without a legal entity), and two or more. If registration is required for several organizations, it is necessary to set this option.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"УчетПоКомпании",
		"Компания",
		НСтр("ka='მთლიანობაში კომპანიის მიხედვით აღრიცხვა';ru='Учет по компании в целом';en='Accounting for the company in general'"),
		НСтр("ka='В программном продукте предусмотрено две схемы учета в случае, когда в учетной системе присутствуют несколько организаций:"
""
"• Независимая. Учет ведется обособленно по каждой организации, первичные документы оформляются отдельно по каждой организации. Преимущество такого подхода заключается в использовании общих справочников (объектов аналитики), а также общей информационной базы (вся информация хранится в одном месте). "
"• По компании. Учет ведется агрегировано, по компании в целом, первичные документы оформляются отдельно по каждой организации. Преимущество такого подхода заключается в использовании общих справочников (объектов аналитики), использовании общей информационной базы (вся информация хранится в одном месте), организации учета по компании (если с точки зрения ведения бизнеса все организации представляют собой единое целое)."
""
"ВАЖНО! "
"Параметр является ключевым. Если ранее осуществлялся учет по компании, переход к ведению учета по отдельным организациям невозможен. Если ранее ведение учета осуществлялось по нескольким организациям, но без агрегирования учетных данных по компании, переход к учету по компании невозможен.';ru='В программном продукте предусмотрено две схемы учета в случае, когда в учетной системе присутствуют несколько организаций:"
""
"• Независимая. Учет ведется обособленно по каждой организации, первичные документы оформляются отдельно по каждой организации. Преимущество такого подхода заключается в использовании общих справочников (объектов аналитики), а также общей информационной базы (вся информация хранится в одном месте). "
"• По компании. Учет ведется агрегировано, по компании в целом, первичные документы оформляются отдельно по каждой организации. Преимущество такого подхода заключается в использовании общих справочников (объектов аналитики), использовании общей информационной базы (вся информация хранится в одном месте), организации учета по компании (если с точки зрения ведения бизнеса все организации представляют собой единое целое)."
""
"ВАЖНО! "
"Параметр является ключевым. Если ранее осуществлялся учет по компании, переход к ведению учета по отдельным организациям невозможен. Если ранее ведение учета осуществлялось по нескольким организациям, но без агрегирования учетных данных по компании, переход к учету по компании невозможен.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьНесколькоОрганизаций";
	НоваяНастройка.Зависимости = "ИспользоватьНесколькоОрганизаций";
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "Компания";
	НоваяНастройка.Раздел			= "Компания";
	НоваяНастройка.Представление	= НСтр("ka='კომპანია';ru='Компания';en='Company'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("СправочникСсылка.Организации");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаОткрытия", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 30);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьНесколькоОрганизаций";
	НоваяНастройка.Зависимости = "ИспользоватьНесколькоОрганизаций,УчетПоКомпании";

	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"КорректированиеВидаУчетаНДСВДокументах",
		"Компания",
		НСтр("ka='გადასახადის ტიპი დღგ-ს რედაქტირება დოკუმენტებში';ru='Корректирование вида учета НДС в документах';en='Correcting VAT type in documents'"),
		НСтр("ru='В программном продукте предусмотрена возможность указывать счета НДС в документах.';en='The software product provides the ability to specify a VAT invoice documents.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	//Паганини_
	//1.
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ПредупреждатьПриРедактированииДокументовИСправочников",
		"Компания",
		НСтр("ka='გაფრთხილება დოკუმენტის და ცნობარის რედაქტირებისას';ru='Предупреждать при редактировании документов и справочников';en='Warn when editing documents and manuals'"),
		НСтр("ru = 'При включении функционала, после редактирования предупреждает об изминении документов и справочников.
              |
              |ВАЖНО!
              |Возможность нельзя отключить после начала работы в программе.'; ka = 'დოკუმენტის და ცნობარის რედაქტირების შემდეგ ჩაწერისას გამოაქვს გაფრთხილება მონაცემის რედაქტირების თაობაზე.
              |
              |მნიშვნელოვანია!
              |შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.'")
			);
	НоваяНастройка.ОбновлятьИнтерфейс	= Истина;
	НоваяНастройка.ПравоРедактирования	= РежимРаботы.ЭтоАдминистраторПрограммы;
	
	//2.
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункционалЗапретаРедактированияДокументов",
		"Компания",
		НСтр("ka='დოკუმენტის რედაქტირების აკრძალვის ფუნქციონალი';ru='Функционал запрета редактирования документов';en='Document editing functionality ban'"),
		НСтр("ru = 'Дает возможность блокирования конкретного документа.
              |Изменять сможет только конкретный пользователь, у которого есть соответствующие права.
              |Включается из справочника пользователя. Пароль: Ro$$OfT!
              |
              |ВАЖНО!
              |Возможность нельзя отключить после начала работы в программе.'; ka = 'შესაძლებლობას იძლევა დაიბლოკოს კონკრეტული დოკუმენტები და რედაქტირება შეძლოს მხოლოდ იმ მომხმარებელმა,
              |ვისაც აქვს შესაბამისი უფლება. ეს უფლება ირთვება მომხმარებლის ცნობარიდან. პაროლი: Ro$$OfT!
              |
              |მნიშვნელოვანია!
              |შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.'")
			);
	НоваяНастройка.ОбновлятьИнтерфейс	= Истина;
	НоваяНастройка.ПравоРедактирования	= РежимРаботы.ЭтоАдминистраторПрограммы;
	//_Паганини
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетПоНесколькимПодразделениям",
		"Компания",
		НСтр("ka='რამდენიმე ქვეგანყოფილება';ru='Несколько подразделений';en='several units'"),
		НСтр("ka='ჩართვა იძლევა დოკუმენტების შევსებისას ქვეგანყოფილების მითითების საშუალებას."
""
"ქვეგანყოფილებების სია მდებარეობს შემდეგ ნაწილში ""კომპანია - ქვეგანყოფილებები"".';ru='Включение позволяет указывать подразделение при заполнении документов."
""
"Список подразделений находится в разделе Компания – Подразделения.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Заказ покупателя,Приходная накладная,Расходная накладная,Акт выполненных работ,Счет на оплату,Задание на работу,Заказ поставщику,Поступление в кассу,Расход из кассы,Поступление на счет,Расход со счета,Начальные остатки прочее,Начальные остатки расчетов,Ввод начальных остатков';ru='Заказ покупателя,Приходная накладная,Расходная накладная,Акт выполненных работ,Счет на оплату,Задание на работу,Заказ поставщику,Поступление в кассу,Расход из кассы,Поступление на счет,Расход со счета,Начальные остатки прочее,Начальные остатки расчетов,Ввод начальных остатков';en='Order buyer, Purchase Invoice, Sales Invoice, Contract, Invoice for payment, Setting to work, orders to suppliers, a cash income, expenses from the cash register, receipt on account, expense account, the opening balance etc., the opening balance of payments, input the initial balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности",
		"Компания",
		НСтр("ka='საქმიანობის რამდენიმე მიმართულება';ru='Несколько направлений деятельности';en='Several activities'"),
		НСтр("ka='ჩართვა საშუალებას იძლევა, რომ დოკუმენტების შევსებისას მითითებული იქნას საქმიანობის მიმართულება."
""
"საქმიანობის მიმართულებების სია მდებარეობს შემდეგ ნაწილში კომპანია - ყველა ცნობარი - საქმიანობის მიმართულება.';ru='Включение позволяет указывать направление деятельности при заполнении документов."
""
"Список направлений деятельности находится в разделе Компания – Все справочники – Направления деятельности.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Номенклатура,Авансовый отчет,Корректировка поступления,Начисление зарплаты,Начисление налогов,Перемещение запасов,Поступление в кассу,Приходная накладная,Прочие затраты (расходы),Расход из кассы,Расход со счета,Начальные остатки прочее,Ввод начальных остатков';ru='Номенклатура,Авансовый отчет,Корректировка поступления,Начисление зарплаты,Начисление налогов,Перемещение запасов,Поступление в кассу,Приходная накладная,Прочие затраты (расходы),Расход из кассы,Расход со счета,Начальные остатки прочее,Ввод начальных остатков';en='Nomenclature, expense reports, receipts adjustment, wages, salaries, taxes, salaries, stock transfer, a cash income, Purchase Invoice, Other expenses (costs) from the cash flow, expense account, the opening balance etc., Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьОтчетность",
		"Компания",
		НСтр("ka='რეგლამენტირებული ანგარიშგებობა';ru='Регламентированная отчетность';en='regulatory reporting'"),
		НСтр("ka='ჩართვის მეშვეობით შესაძლებელი გახდება რეგლამენტირებული ანგარიშგებულობის ჩამოყალიბება და მაკონტროლებელ ორგანოებში ჩაბარება."
""
"ანგარიშგებულობის ჩაბარება შეიძლება მაშინ, თუ ინდმეწარმე იყენებს დაბეგვრის გამარტივებულ სისტემას (დგს) ან მთლიან შემოსავალზე ერთიან';ru='Включение позволяет формировать регламентированную отчетность и сдавать в контролирующие органы."
""
"Можно сдавать отчетность, если ИП использует упрощенную систему налогообложения (УСН) или единый налог на вмененный доход (ЕНВД).'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='საავანსო ანგარიშგება,საცალო გაყიდვების ანგარიშგება,სალაროში შემოსვლა,ანგარიშზე შემოსვლა,სალაროდან გასავალი,ანგარიშიდან გასავალი';ru='Авансовый отчет,Отчет о розничных продажах,Поступление в кассу,Поступление на счет,Расход из кассы,Расход со счета';en='Advance report on retail sales report, receipts in cash, to the account, the costs of cash, expense account'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов",
		"Компания",
		НСтр("ka='შემოსავლების და ხარჯების აღრიცხვის საკასო მეთოდი';ru='Кассовый метод учета доходов и расходов';en='Cash method of accounting for income and expenses'"),
		НСтр("ka='ჩართვა იძლევა შემოსავლების და ხარჯების სალაროს მეთოდით (გადახდის მიხედვით) აღრიცხვის წარმოების საშუალებას."
""
"პროგრამულ პროდუქტში შემოსავლების და ხარჯების აღრიცხვის ძირითადი მეთოდია - დარიცხვის მეთოდი (გადატვირთვის მიხედვით). დამატებით, დარიცხვის მეთოდისადმი შეიძლება გამოყენებული იქნას შემოსავლების და ხარჯების აღრიცხვის სალაროს მეთოდი (გადახდის მიხედვით). შემოსავლების და ხარჯების აღრიცხვა სალაროს მეთოდით წარმოებს საქმიანობის მიმართულებების, ჩამოწერის მიმართულებების და ფულადი სახსრების შემოსვლის წყაროების ჭრილში.';ru='Включение позволяет вести учет доходов и расходов кассовым методом (по оплате)."
""
"Основной метод учета доходов и расходов в программном продукте - метод начисления (по отгрузке). Дополнительно к методу начисления может применяться кассовый метод учета доходов и расходов (по оплате). Учет доходов и расходов кассовым методом ведется в разрезе направлений деятельности, направлений списания и источников поступления денежных средств.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='საავანსო ანგარიშგება,შემოსვლის ზედნადები,გასავლის ზედნადები';ru='Авансовый отчет,Приходная накладная,Расходная накладная';en='Expense report, Purchase Invoice, Sales Invoice'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьБюджетирование",
		"Компания",
		НСтр("ka='ბიუჯეტირება';ru='Бюджетирование';en='budgeting'"),
		НСтр("ka='ჩართვა იძლევა ფირმის ფინანსური გეგმის შედგენის და მისი შესრულების გაკონტროლების საშუალებას."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='Включение позволяет составлять финансовый план фирмы и контролировать его исполнение."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетВнеоборотныхАктивов",
		"Компания",
		НСтр("ka='ქონება';ru='Имущество';en='Propety'"),
		НСтр("ka='ჩართვა იძლევა ფირმის ქონების - ძირითადი საშუალებების და არამატერიალური აქტივების აღრიცხვის წარმოების საშუალებას."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='Включение позволяет вести учет имущества фирмы - основных средств и нематериальных активов."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='ნომენკლატურა,საწყისი ნაშთი სხვა დანარჩენი,საწყისი ნაშთების შეყვანა';ru='Номенклатура,Начальные остатки прочее,Ввод начальных остатков';en='Nomenclature, the opening balance etc., Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятия",
		"Компания",
		НСтр("ka='საწარმოს რესურსების დატვირთვის დაგეგმვა';ru='Планировать загрузку ресурсов предприятия';en='Enterprise resource planning loading'"),
		НСтр("ka='ჩართვა იძლევა საწარმოს საწარმოო რესურსების ჩატვირთვის დაგეგმვის საშუალებას."
""
"რესურსი შეიძლება იყოს ნებისმიერი საწარმოო რესურსი, რომლის ჩატვირთვის დაგეგმვა მიზანშეწონილია. მაგალითად: მოწყობილობა, ინვენტარი, მექანიზმები, მუშების ბრიგადები, ცალკეული მუშაკები."
""
"რესურსების სია ხელმისაწვდომია შემდეგ ნაწილში სამუშაოები - საწარმოს რესურსები.';ru='Включение позволяет планировать загрузку производственных ресурсов предприятия."
""
"Ресурсом может являться любой производственный ресурс, загрузку которого целесообразно планировать. Например: оборудование, инвентарь, механизмы, бригады рабочих, отдельные работники."
""
"Список ресурсов доступен в разделе Работы - Ресурсы предприятия.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='საწარმოო შეკვეთა.მყიდველის შეკვეთა';ru='Заказ на производство,Заказ покупателя';en='Manufacturing order, the customer order'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"АртикулНоменклатурыВСодержание",
		"Компания",
		НСтр("ka='ნომენკლატურის არტიკული ბეჭდურ ფორმებში';ru='Артикул номенклатуры в печатных формах';en='Reference nomenclatures in printed form'"),
		НСтр("ka='დოკუმენტების ამობეჭდვისას, ნომენკლატურის სრულ სახელწოდებაში დამატებული იქნება არტიკული.';ru='При печати документов, в полное наименование номенклатуры будет добавляться артикул.';en='If you print documents in full name will be added to the nomenclature of the article.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='გასავლის ზედნადები,მყიდველის შეკვეთა,შემოსვლის ზედნადები,შესრულებული სამუშაოების აქტი,გადასახდელი ანგარიში,შეკვეთა მომწოდებელს,ნომენკლატურა';ru='Расходная накладная,Заказ покупателя,Приходная накладная,Акт выполненных работ,Счет на оплату,Заказ поставщику,Номенклатура';en='Sales Invoice, Order of the buyer, Purchase Invoice, Contract, Invoicing, Purchase Orders, Nomenclature'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ВестиУчетМаркировкиПродукцииВГИСМ",
		"Компания",
		НСтр("ka='საქონლის მარკირება საკონტროლო (საიდენტიფიკაციო) ნიშნებით';ru='Маркировка товаров контрольными (идентификационными) знаками';en='Labeling of goods with control (identification) signs'"),
		НСтр("ka='Включение позволяет вести учет маркировки продукции в государственной информационной системе маркировки (ГИСМ)."
"А также хранить информацию о маркировке товаров контрольными (идентификационными) знаками (КиЗ) и отслеживать движения маркированных товаров."
""
"Для использования возможности, требуется ведение серийных номеров товаров (будет включено автоматически).';ru='Включение позволяет вести учет маркировки продукции в государственной информационной системе маркировки (ГИСМ)."
"А также хранить информацию о маркировке товаров контрольными (идентификационными) знаками (КиЗ) и отслеживать движения маркированных товаров."
""
"Для использования возможности, требуется ведение серийных номеров товаров (будет включено автоматически).'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='მარკირების სახელმწიფო საინფორმაციო სისტემა (მარკირების სისტემა)';ru='Государственная информационная система маркировки (ГИСМ)';en='State information labeling system (GISM)'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"СписокСостоянияСобытийИЗаданий",
		"Компания",
		НСтр("ka='მოვლენების მდგომარეობა';ru='Состояния событий';en='event status'"),
		НСтр("ru=''"),
		"e1cib/list/Справочник.СостоянияСобытий"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"Интеркампани",
		"Компания",
		НСтр("ka='ინტერკამპანი(ელიმინირება)';ru='Интеркампани (элиминирование)';en='Interkampani (elimination)'"),
		НСтр("ka='თუ თქვენ გყავთ რამდენიმე იურიდიული პირი და ანგარიშგებების ანალიზის დროს გსურთ ფირმათშორისი ბრუნვების გამორიცხვა (ელიმინირების განხორციელება), ასევე, საკუთარ იურიდიულ პირებს შორის ავტომატურად შეადგინოთ ""შემხვედრი"" დოკუმენტები, მაშინ აღნიშნეთ ეს ოპცია.';ru='Если у вас есть несколько юр.лиц и при анализе отчетов вы хотите исключить межфирменные обороты (произвести элиминирование), а также автоматически формировать ""встречные"" документы между собственными юр.лицами - отметьте эту опцию.';en='If you have multiple legal entities and in the analysis of the reports you want to exclude inter-company turnover (produce elimination), and automatically generate a ""counter"" documents between their own legal entity - check this option.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьМобильнуюТелефонию",
		"CRM",
		НСтр("ka='მობილური ტელეფონია';ru='Мобильная телефония';en='Mobile telephony'"),
		НСтр("ru='Возможность совершать и принимать звонки через мобильное приложение 1С:УНФ во взаимодействии с настольной или облачной 1С:УНФ.';en='Ability to make and receive calls through the mobile application 1C: UNF in conjunction with a desktop or cloud 1C: UNF.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Телефония,CRM';en='Telephony, CRM'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НеобрабатываемыеТелефонныеНомера",
		"CRM",
		НСтр("ka='ტელეფონის ნომრები';ru='Необрабатываемые телефонные номера';en='Uncultivated numbers'"),
		НСтр("ru='Список номеров телефонов, с которых не принимаются звонки в 1С:УНФ';en='The list of telephone numbers from which the calls are not accepted in the 1C: UNF'"),
		"e1cib/list/РегистрСведений.НеобрабатываемыеТелефонныеНомера"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьМобильнуюТелефонию";
	НоваяНастройка.Зависимости = "ИспользоватьМобильнуюТелефонию";
	НоваяНастройка.Теги = НСтр("ka='CRM,Телефония,Событие';ru='CRM,Телефония,Событие';en='CRM, Telephony Event'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ИнструкцияМобильнаяТелефония",
		"CRM",
		НСтр("ka='მობიური ტელეფონები გამოყენების ფუნქციონალი';ru='Инструкция по использованию мобильной телефонии';en='on the use of mobile telephony Instructions'"),
		НСтр("ru=''"),
		"e1cib/command/Обработка.МенеджерПодсказок.Команда.Телефония_МобильнаяТелефония"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьМобильнуюТелефонию";
	НоваяНастройка.Теги = НСтр("ka='CRM,ტელეფონები,მოქმედება';ru='CRM,Телефония,Событие';en='CRM, Telephony Event'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ДействияПриОбработкеЗвонка";
	НоваяНастройка.Раздел			= "CRM";
	НоваяНастройка.Представление	= НСтр("ru='Действия при обработке звонка';en='Action when a call is processed'");
	НоваяНастройка.ТипЭлемента		= Тип("ДекорацияФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидДекорацииФормы.Надпись);
	НоваяНастройка.СвойстваЭлемента.Вставить("Гиперссылка", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ДействиеТекущегоЗвонкаНайденногоАбонента";
	НоваяНастройка.Раздел			= "CRM";
	НоваяНастройка.Представление	= НСтр("ru='от известного абонента';en='proximity to the subscriber'");
	НоваяНастройка.Описание			= НСтр("ka='Настройка определяет поведение программы при обработке звонка (F8) от абонента, которого удалось найти в программе по номеру телефона.';ru='Настройка определяет поведение программы при обработке звонка (F8) от абонента, которого удалось найти в программе по номеру телефона.';en='The setting determines the behavior of the program when a call processing (F8) from the user, which could be found in the program for a phone number.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РежимВыбораИзСписка", Истина);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
	НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить("ОткрытьКарточкуАбонента", НСтр("ka='კონტრაგენტის ბარათის გახსნა';ru='Открыть карточку контрагента';en='Open counterparty card'"));
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить("ОткрытьСобытие", НСтр("ka='შემთხვევა-ზარის გახსნა';ru='Открыть событие-звонок';en='Open-Up Event'"));
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить("ОткрыватьСобытиеПриЗакрытииКарточкиАбонента", НСтр("ka='ჯერ კონტრაგენტის ბარათი, შემდეგ ზარი';ru='Сперва карточку контрагента, потом событие-звонок';en='First counterparty card, then-Up Event'"));
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ДействияПриОбработкеЗвонка";
	НоваяНастройка.Зависимости = "ИспользоватьМобильнуюТелефонию";
	НоваяНастройка.Теги = НСтр("ka='Событие,CRM,Телефония';ru='Событие,CRM,Телефония';en='Event, CRM, Telephony'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ДействиеТекущегоЗвонкаНеизвестногоАбонента";
	НоваяНастройка.Раздел			= "CRM";
	НоваяНастройка.Представление	= НСтр("ru='от неизвестного абонента';en='from unknown caller'");
	НоваяНастройка.Описание			= НСтр("ka='Настройка определяет поведение программы при обработке звонка (F8) от абонента, найти которого в программе не удалось.';ru='Настройка определяет поведение программы при обработке звонка (F8) от абонента, найти которого в программе не удалось.';en='The setting determines the behavior of the program when a call processing (F8) from the subscribers who could not find the program.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РежимВыбораИзСписка", Истина);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
	НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить("СозданиеКонтрагента", НСтр("ka='კონტრაგენტის შექმნა';ru='Создание контрагента';en='Creating a counterparty'"));
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить("СозданиеСобытия", НСтр("ka='შემთხვევა-ზარის შექმნა';ru='Создание события-звонка';en='Create an event, call'"));
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить("ЗадаватьВопрос", НСтр("ka='შეკითხვის დასმა';ru='Задавать вопрос';en='ask a question'"));
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ДействияПриОбработкеЗвонка";
	НоваяНастройка.Зависимости = "ИспользоватьМобильнуюТелефонию";
	НоваяНастройка.Теги = НСтр("ka='Событие,CRM,Телефония';ru='Событие,CRM,Телефония';en='Event, CRM, Telephony'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "КоммерческиеПредложения";
	НоваяНастройка.Раздел			= "CRM";
	НоваяНастройка.Представление	= НСтр("ka='კომერციული შემოთავაზებები';ru='Коммерческие предложения';en='Commercial offers'");
	НоваяНастройка.ТипЭлемента		= Тип("ДекорацияФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидДекорацииФормы.Надпись);
	НоваяНастройка.СвойстваЭлемента.Вставить("Гиперссылка", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьНесколькоВариантовКП",
		"CRM",
		НСтр("ka='რამდენიმე ვარიანტი კომერციული შემოთავაზებების';ru='Несколько вариантов КП';en='Several variants of the KP'"),
		НСтр("ru='Появится возможность создавать несколько вариантов коммерческого предложения в одном заказе покупателя.';en='It will be possible to create multiple versions of the offer in a single purchase order.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "КоммерческиеПредложения";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ШаблоныКоммерческихПредложений",
		"CRM",
		НСтр("ka='კომერციული შემოთავაზებების შაბლონები';ru='Шаблоны коммерческих предложений';en='Templates of business proposals'"),
		НСтр("ru=''"),
		"e1cib/list/Справочник.ШаблоныПечатиОфисныхДокументов"
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.ВместеС = "КоммерческиеПредложения";
	НоваяНастройка.Теги = НСтр("ru='Заказ покупателя,Печать документов';en=""Buyer's order, Document Printing""");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ПисьмаИSMS";
	НоваяНастройка.Раздел			= "CRM";
	НоваяНастройка.Представление	= НСтр("ru='Письма и SMS';en='Mails and SMS'");
	НоваяНастройка.ТипЭлемента		= Тип("ДекорацияФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидДекорацииФормы.Надпись);
	НоваяНастройка.СвойстваЭлемента.Вставить("Гиперссылка", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ШаблоныСообщений",
		"CRM",
		НСтр("ka='შეტყობინების შაბლონები';ru='Шаблоны сообщений';en='message templates'"),
		НСтр("ru=''"),
		"e1cib/list/Справочник.ШаблоныСообщений"
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.ВместеС = "ПисьмаИSMS";
	НоваяНастройка.Теги = НСтр("ka='CRM,Событие,E-mail,SMS';ru='CRM,Событие,E-mail,SMS';en='CRM, event, E-mail, SMS'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ТелефонияВиртуальнаяАТС",
		"CRM",
		НСтр("ru='Телефония. Интеграция с виртуальной АТС ';ka='ტელეფონები. ინტეგრაცია ვირტუალურ ატს-თან'"),
		НСтр("ka='IP-ტელეფონია ვირტუალური ღრუბლოვანი ავტომატური სატელეფონო სადგურის ერთ-ერთი ოპერატორის მეშვეობით';ru='IP-телефония через одного из операторов виртуальных облачных АТС';en='IP-telephony operators through one of the virtual PBX cloud'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='შემთხვევა(მოვლენა) , საკონტაქტო პირები';ru='Событие,Контактные лица';en='Event Contacts'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ТелефонияОфиснаяАТС",
		"CRM",
		НСтр("ka='ტელეფონია. საოფისე ავტომატურ სატელეფონო სადგურთან ინტეგრაცია';ru='Телефония. Интеграция с офисной АТС';en='Telephony. Integration with PBX'"),
		НСтр("ka='ინტეგრაცია უკვე არსებულ ავტომატური სატელეფონო სადგურის საოფისე პროგრამულ-აპარატულ კომპლექსთან';ru='Интеграция с уже имеющимся офисным программно-аппаратным комплексом АТС';en='Integration with existing office PBX software and hardware complex'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='შემთხვევა(მოვლენა) , საკონტაქტო პირები';ru='Событие,Контактные лица';en='Event Contacts'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"Лиды",
		"CRM",
		НСтр("ka='პოტენციური კლიენტების (ლიდების) აღრიცხვა';ru='Учет потенциальных клиентов (лидов)';en='Accounting for potential customers (Disabilities)'"),
		НСтр("ka='კონტრაგენტების და პოტენციური მყიდველების (ლიდების) განცალკევებული აღრიცხვა';ru='Раздельный учет контрагентов и потенциальных покупателей (лидов)';en='Separate accounting contractors and potential buyers (Disabilities)'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='CRM,ლიდები';ru='CRM,Лиды';en='CRM, Lida'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ГенераторЛидов",
		"CRM",
		НСтр("ka='ლიდების გენერატორი';ru='Генератор лидов';en='generator of leads'"),
		НСтр("ka='კომპანიის ბაზის მიღება ერთი დაწკაპუნებით ბიზნესის ტიპების და გეოგრაფიული მდებარეობის მიხედვით შერჩევით!';ru='Получить базу компаний с отбором по видам бизнеса и географическому расположению в один клик!';en='Get database companies with the selection by type of business and geographical position in one click!'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='CRM,ლიდები';ru='CRM,Лиды';en='CRM, Lida'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИнтеграцияМассовыеРассылки",
		"CRM",
		НСтр("ru='Интеграция с сервисами массовых рассылок ';ka='მასიური დაგზავნის სერვისებთან ინტეგრაცია'"),
		НСтр("ka='მაგალითად, E-mail - Unisender, MailChimp.';ru='Например, E-mail - Unisender, MailChimp.';en='For example, E-mail - Unisender, MailChimp.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='მოვლენა,საკონტაქტო პირები,მასობრივი დაგზავნა,დაგზავნები';ru='Событие,Контактные лица,Массовая рассылка,Рассылки';en='Event, contact persons, spaming, Subscriptions'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"Синхронизации2",
		"CRM",
		НСтр("ru='Синхронизации Outlook, iCal, CalDav и пр.';en='Synchronize Outlook, iCal, CalDav and others.'"),
		НСтр("ru='В данный момент реализована синхронизация с контактной книгой и календарями Google. Отметьте этот пункт, если вы хотите, чтобы 1С:УНФ синхронизировалось с контактной книгой и календарем вашего iPhone.';en='Currently implemented synchronization with contact book and Google calendars. Check this box if you want to 1C: UNF synchronized with the contact and calendar to your iPhone.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='შემთხვევა(მოვლენა) , საკონტაქტო პირები';ru='Событие,Контактные лица';en='Event Contacts'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"СинхронизацияCRM",
		"CRM",
		НСтр("ka='CRM სისტემებთან სინქრონიზაცია (დააზუსტეთ რომელთან)';ru='Синхронизация с CRM системами (уточните с какими)';en='Synchronization with CRM systems (check with what)'"),
		НСтр("ka='თუ თქვენ იყენებთ CRM სისტემას და გსურთ მონაცემთა სინქრონიზაცია 1С:მფმ-სთან, მაშინ დააყენეთ აქ ალამი და დააზუსტეთ CRM სისტემის სახელწოდება.';ru='Если вы используете CRM систему и хотите синхронизировать данные с 1С:УНФ – поставьте здесь флажок и уточните название CRM системы.';en='If you are using the CRM system and want to synchronize data with 1C: UNF - Choose this option and specify the name of the CRM system.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='CRM,მონაცემების სინქრონიზაცია';ru='CRM,Синхронизация данных';en='CRM, Data Synchronization'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи",
		"Продажи",
		НСтр("ka='ფასდაკლებები და ფასნამატები გაყიდვებში';ru='Скидки и наценки в продажах';en='Discounts and mark-ups in sales'"),
		НСтр("ka='ავტომატური ფასდაკლებები';ru='Автоматические скидки';en='automatic discounts'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='ფასდაკლება,ხელშეკრულებები,შესრულებული სამუშაოების აქტი,მყიდველის შეკვეთა,გადამუშავების ანგარიშგება,საცალო გაყიდვების ანგარიშგება,გასავლის ზედნადები,გადასახდელი ანგარიში,სსა-ის ჩეკი,სსა-ის ჩეკი დასაბრუნებლად,გაყიდვების დოკუმენტები,ანგარიშსწორებების საწყისი';ru='Скидка,Договоры,Акт выполненных работ,Заказ покупателя,Отчет о переработке,Отчет о розничных продажах,Расходная накладная,Счет на оплату,Чек ККМ,Чек ККМ на возврат,Документы по продажам,Начальные остатки расчетов,Ввод начальных остатков';en=""Discount Contracts, Contract, Buyer's order, report processing, report on retail sales, Sales Invoice, Receipt for payment, Check CMC, CMC Check for refund, sales documents, the opening balance calculations Entering opening balances""");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьДисконтныеКарты",
		"Продажи",
		НСтр("ka='დისკონტური ბარათები';ru='Дисконтные карты';en='discount cards'"),
		НСтр("ka='ჩართვა იძლევა დისკონტური ბარათების აღრიცხვის წარმოების და გაყიდვის დოკუმენტების გაფორმებისას მათი მითითების საშუალებას."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='Включение позволяет вести учет дисконтных карт и указывать их при оформлении документов продаж."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи";
	НоваяНастройка.Теги = НСтр("ka='საცალო გაყიდვების ანგარიშგება,გაყიდვის დოკუმენტები,ფასდაკლება,მყიდველის შეკვეთა,ანგარიშსწორებების საწყისი ნაშთი,საწყისი ნაშთების შეყვანა';ru='Отчет о розничных продажах,Документы по продажам,Скидка,Заказ покупателя,Начальные остатки расчетов,Ввод начальных остатков';en='A report on retail sales, sales documents, discounts, order of the buyer, the opening balance calculations Entering opening balances'");
	
	//Малышев 2024-11-16 (--
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьКартыЛояльности",
		"Продажи",
		НСтр("ka='ლოიალობის ბარათები';ru='Карты лояльности';en='Loyalty cards'"),
		НСтр("ka='ჩართვა იძლევა დისკონტური ბარათების აღრიცხვის წარმოების და გაყიდვის დოკუმენტების გაფორმებისას მათი მითითების საშუალებას."
""
"მნიშვნელოვანია!"
"ჩართვა საშუალებას გაძლევთ თვალყური ადევნოთ ლოიალობის ბარათებს და მიუთითოთ ისინი გაყიდვების დოკუმენტების მომზადებისას.';ru='Включение позволяет вести учет карт лояльности и указывать их при оформлении документов продаж."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи";
	НоваяНастройка.Теги = НСтр("ka='საცალო გაყიდვების ანგარიშგება,გაყიდვის დოკუმენტები,ფასდაკლება,მყიდველის შეკვეთა,ანგარიშსწორებების საწყისი ნაშთი,საწყისი ნაშთების შეყვანა';ru='Отчет о розничных продажах,Документы по продажам,Скидка,Заказ покупателя,Начальные остатки расчетов,Ввод начальных остатков';en='A report on retail sales, sales documents, discounts, order of the buyer, the opening balance calculations Entering opening balances'");
	//Малышев 2024-11-16 --)
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьАвтоматическиеСкидкиНаценки",
		"Продажи",
		НСтр("ka='ავტომატური ფასდაკლებები';ru='Автоматические скидки';en='automatic discounts'"),
		НСтр("ka='ჩართვა იძლევა ავტომატური ფასდაკლებების და ფასნამატების მიცემის, მათი შეთავაზების პირობების გამართვის საშუალებას. ფასდაკლებები და ფასნამატები გამოიყენება გაყიდვის დოკუმენტების გაფორმებისას."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='Включение позволяет задавать автоматические скидки и наценки, настраивать условия их предоставления. Скидки и наценки применяются при оформлении документов продаж."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='ფასდაკლება,შესრულებული სამუშაოების აქტი,მყიდველის შეკვეთა,გადამუშავების ანგარიშგება,საცალო გაყიდვების ანგარიშგება,გასავლის ზედნადები,გადასახდელი ანგარიში,სსა-ის ჩეკი,სსა-ის ჩეკი დასაბრუნებლად,გაყიდვების დოკუმენტები,ანგარიშსწორებების საწყისი ნაშთები,საწყის';ru='Скидка,Акт выполненных работ,Заказ покупателя,Отчет о переработке,Отчет о розничных продажах,Расходная накладная,Счет на оплату,Чек ККМ,Чек ККМ на возврат,Документы по продажам,Начальные остатки расчетов,Ввод начальных остатков';en=""Discount, Contract, Buyer's order, report processing, report on retail sales, Sales Invoice, Receipt for payment, Check CMC, CMC Check for refund, sales documents, the opening balance calculations Entering opening balances""");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПередачаТоваровНаКомиссию",
		"Продажи",
		НСтр("ka='საქონლის გადაცემა საკომისიოდ';ru='Передача товаров на комиссию';en='Transfer of goods on commission'"),
		НСтр("ka='ჩართვა იძლევა გარეშე კონტრაგენტისთვის საკუთარი საქონლის საკომისიოდ გადაცემის საშუალებას."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='Включение позволяет передавать собственные товары на комиссию стороннему контрагенту."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='გაყიდვის დოკუმენტები,საქონლიების საწყისი ნაშთი,საწყისი ნაშთების შეყვანა';ru='Документы по продажам,Начальные остатки товаров,Ввод начальных остатков';en='Sales documents, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПриемТоваровНаКомиссию",
		"Продажи",
		НСтр("ka='საკომისიოდ საქონლის მიღება';ru='Прием товаров на комиссию';en='Reception of goods on commission'"),
		НСтр("ka='ჩართვა იძლევა გარეშე კონტრაგენტისგან საკომისიოდ მიღებული საქონლის აღრიცხვის წარმოების საშუალებას."
""
"მნიშვნელოვანია! "
"იმისთვის, რომ საკუთარი მარაგები გავარჩიოთ საკომისიოდ მიღებული მარაგებისგან, გამოიყენება აღრიცხვის დამატებითი ჭრილი - ""ნომენკლატურის პარტიები"". ამიტომ, მოცემული შესაძლებლობის გამოსაყენებლად აუცილებელია ნაწილ ""შესყიდვები""-ში ოპცია ""ნომენკლატურის პარტიები""-ს ჩართვა."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='Включение позволяет вести учет принятых на комиссию товаров от стороннего контрагента."
""
"ВАЖНО! "
"Для отличия собственных запасов от запасов, принятых на комиссию, используется дополнительный разрез учета - ""Партии номенклатуры"". Поэтому для использования данной возможности необходимо включить опцию ""Партии номенклатуры"" в разделе ""Закупки""."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПартии";
	НоваяНастройка.Теги = НСтр("ka='საქონლის საწყისი ნაშთები,საწყისი ნაშთების შეყვანა';ru='Начальные остатки товаров,Ввод начальных остатков';en='The carrying amounts of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьКорректировкиРеализаций",
		"Продажи",
		НСтр("ka='რეალიზაციის კორექტირება';ru='Корректировки реализаций';en='adjustments implementations'"),
		НСтр("ka='ჩართვა იძლევა საქონლის რეალიზაციის კორექტირებების და საკორექტირებო ანგარიშფაქტურების ცალკე დოკუმენტებად გაფორმების საშუალებას."
""
"საკორექტირებო დოკუმენტებით შესაძლებელია რედაქტირებისთვის დახურულ და აკრძალულ პერიოდში მყოფ მონაცემთა შეცვლა.';ru='Включение позволяет оформлять отдельными документами корректировки реализации товаров и корректировочные счета-фактуры."
""
"Корректировочные документы позволяют изменить данные, находящиеся в закрытом и запрещенном для редактирования периоде.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='გასავლის ზედნადები,მყიდველის შეკვეთა,ანგარიშსწორებების საწყისი ნაშთი,საწყისი ნაშთების შეყვანა';ru='Расходная накладная,Заказ покупателя,Начальные остатки расчетов,Ввод начальных остатков';en='Sales Invoice, Order of the buyer, the opening balance calculations Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьПланПродаж",
		"Продажи",
		НСтр("ka='გაყიდვების დაგეგმვა';ru='Планирование продаж';en='sales planning'"),
		НСтр("ka='შესაძლებლობა იძლევა დოკუმენტ ""გაყიდვების გეგმა""-ს შეყვანის საშუალებას ნომენკლატურის და მახასიათებლების, და აგრეთვე, მყიდველთა შეკვეთების მიხედვით დეტალიზაციით."
""
"""გაყიდვების გეგმა"" არსებითად ამსუბუქებს გაყიდვების გეგმა-ფაქტიური ანალიზის შესრულებას, რომელიც გაყიდვების მართვის პროცესის განუყოფელ ნაწილს წარმოადგენს.';ru='Возможность позволяет вводить документ ""План продаж"" с детализацией по номенклатуре и характеристикам, а также заказам покупателей."
""
"""План продаж"" существенно облегчает выполнение план-фактного анализа продаж, который является неотъемлемой частью процесса по управлению продажами.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='გადასახდელი ანგარიში,გაყიდვების დოკუმენტები';ru='Счет на оплату,Документы по продажам';en='Invoicing, Sales Documents'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьСверкиВзаиморасчетов",
		"Продажи",
		НСтр("ka='ურთიერთანგარიშსწორებების შედარება';ru='Сверки взаиморасчетов';en='intercalculation'"),
		НСтр("ka='ჩართვა იძლევა კონტრაგენტებთან ურთიერთანგარიშსწორების შედარების რეგისტრირების და გაკონტროლების საშუალებას."
""
"შედარება ხორციელდება დოკუმენტ ""ურთიერთანგარიშსწორებების შეპირისპირება""-ს მეშვეობით, რომელიც ხელმისაწვდომია შემდეგ ნაწილებში:"
"• გაყიდვები – მყიდველებთან ანგარიშსწორება – ურთიერთანგარიშსწორებების შედარება;"
"• შესყიდვები – მომწოდებლებთან ანგარიშსწორება - ურთიერთანგარიშსწორებების შედარება.';ru='Включение позволяет регистрировать и контролировать сверки взаиморасчетов с контрагентами."
""
"Сверка осуществляется с помощью документа «Сверка взаиморасчетов», доступного в разделах:"
"• Продажи – Расчеты с покупателями – Сверки взаиморасчетов;"
"• Закупки – Расчеты с поставщиками - Сверки взаиморасчетов.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='ანგარიშიდან გასავალი,ანგარიშზე შემოსვლა,სალაროში შემოსვლა,სალაროდან გასავალი,კონტრაგენტები,ანგარიშსწორებების საწყისი ნაშთი,საწყისი ნაშთების შეყვანა';ru='Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Контрагенты,Начальные остатки расчетов,Ввод начальных остатков';en='Flow from the account to the account, a cash income, cash flow from the counterparty, the opening balance calculations Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьКорректировкиДолга",
		"Продажи",
		НСтр("ka='ვალების კორექტირებები';ru='Корректировки долга';en='adjustments to debt'"),
		НСтр("ka='ჩართვა იძლევა მყიდველებთან და მომწოდებლებთან ვალის ურთიერთჩათვლის, დათმობის და კორექტირების ჩატარების საშუალებას."
""
"მოცემული ოპერაციები ხორციელდება დოკუმენტ ""ვალის კორექტირებები""-ს მეშვეობით, რომელიც ხელმისაწვდომია შემდეგ ნაწილებში:"
"• გაყიდვები – მყიდველებთან ანგარიშსწორება – ვალის კორექტირებები;"
"• შესყიდვები – მომწოდებლებთან ანგარიშსწორება – ვალის კორექტირებები.';ru='Включение позволяет проводить взаимозачеты, переуступки и корректировки долга с покупателями и поставщиками."
""
"Данные операции осуществляются с помощью документа «Корректировки долга», доступного в разделах:"
"• Продажи – Расчеты с покупателями – Корректировки долга;"
"• Закупки – Расчеты с поставщиками – Корректировки долга.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='ანგარიშიდან გასავალი,ანგარიშზე შემოსვლა,სალაროში შემოსვლა,სალაროდან გასავალი,კონტრაგენტები,ანგარიშსწორებების საწყისი ნაშთი,საწყისი ნაშთების შეყვანა';ru='Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Контрагенты,Начальные остатки расчетов,Ввод начальных остатков';en='Flow from the account to the account, a cash income, cash flow from the counterparty, the opening balance calculations Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетПоПроектам",
		"Продажи",
		НСтр("ka='პროექტები';ru='Проекты';en='projects'"),
		НСтр("ka='Включение позволяет объединять несколько заказов покупателей в один проект."
""
"При указании проекта в заказе покупателя документ, фактически, становится спецификацией к договору с заказчиком и определяет список объектов поставки по договору (перечень товаров, продукции, работ, услуг), цену, стоимость и сроки поставки. Таким образом, учитывая затраты, доходы и расходы в разрезе заказов покупателей, можно получить агрегированную информацию о затратах, доходах и расходах и по проекту в целом."
""
"ПРИМЕР. "
"Компания ""Ветерок"" выиграла тендер на разработку и установку системы вентиляции и кондиционирования торгового зала в одном из супермаркетов. С заказчиком было заключено два договора: договор подряда на проектирование и монтаж системы кондиционирования и договор на поставку оборудования. Для компании важно учитывать затраты, доходы и расходы как в разрезе заказов и видов деятельности, так и в целом по конкретному проекту. Для этого в программе открыли новый проект ""Торговый зал"", а так же два заказа: один на поставку оборудования, второй - на выполнение работ. Учитывая затраты, доходы и расход по этим заказам, мы можем получить информацию и в целом по проекту ""Торговый зал"".';ru='Включение позволяет объединять несколько заказов покупателей в один проект."
""
"При указании проекта в заказе покупателя документ, фактически, становится спецификацией к договору с заказчиком и определяет список объектов поставки по договору (перечень товаров, продукции, работ, услуг), цену, стоимость и сроки поставки. Таким образом, учитывая затраты, доходы и расходы в разрезе заказов покупателей, можно получить агрегированную информацию о затратах, доходах и расходах и по проекту в целом."
""
"ПРИМЕР. "
"Компания ""Ветерок"" выиграла тендер на разработку и установку системы вентиляции и кондиционирования торгового зала в одном из супермаркетов. С заказчиком было заключено два договора: договор подряда на проектирование и монтаж системы кондиционирования и договор на поставку оборудования. Для компании важно учитывать затраты, доходы и расходы как в разрезе заказов и видов деятельности, так и в целом по конкретному проекту. Для этого в программе открыли новый проект ""Торговый зал"", а так же два заказа: один на поставку оборудования, второй - на выполнение работ. Учитывая затраты, доходы и расход по этим заказам, мы можем получить информацию и в целом по проекту ""Торговый зал"".'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='მყიდველის შეკვეთა,მოვლენა,გაყიდვების დოკუმენტები';ru='Заказ покупателя,Событие,Документы по продажам';en='Order of the buyer, Event Sales Documents'");
	
	
		//Малышев 2024-12-03 ONESOFT-3670(--  контроль остатков по проектам
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"КонтролироватьОстаткиПриПроведенииПоПроектам",
		"Продажи",
		НСтр("ka='პროექტებით აღრიცხვისას ნაშთების რაოდენობრივი კონტროლი';ru='Контроль остатков по проектам';en='Monitor residues during on projects'"),
		НСтр("ka='ჩართვა იძლევა დისკონტური ბარათების აღრიცხვის წარმოების და გაყიდვის დოკუმენტების გაფორმებისას მათი მითითების საშუალებას."
""
"მნიშვნელოვანია!"
"ჩართვა საშუალებას გაძლევთ თვალყური ადევნოთ ლოიალობის ბარათებს და მიუთითოთ ისინი გაყიდვების დოკუმენტების მომზადებისას.';ru='Включение позволяет вести учет карт лояльности и указывать их при оформлении документов продаж."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетПоПроектам";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетПоПроектам";
	НоваяНастройка.Теги = НСтр("ka='საცალო გაყიდვების ანგარიშგება,გაყიდვის დოკუმენტები,ფასდაკლება,მყიდველის შეკვეთა,ანგარიშსწორებების საწყისი ნაშთი,საწყისი ნაშთების შეყვანა';ru='Отчет о розничных продажах,Документы по продажам,Скидка,Заказ покупателя,Начальные остатки расчетов,Ввод начальных остатков';en='A report on retail sales, sales documents, discounts, order of the buyer, the opening balance calculations Entering opening balances'");
	//Малышев 2024-12-03 ONESOFT-3670 --)

	//Малышев 2024-12-03 ONESOFT-3670(--
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"СебестоимостьЗапасовПоПроектам",
		"Продажи",
		НСтр("ka='მარაგების თვითღირებულება პროექტების მიხედვით';ru='Себестоимость запасов по проектам';en='Себестоимость запасов по проектам'"),
		НСтр("ka='ჩართვა იძლევა დისკონტური ბარათების აღრიცხვის წარმოების და გაყიდვის დოკუმენტების გაფორმებისას მათი მითითების საშუალებას."
""
"მნიშვნელოვანია!"
"ჩართვა საშუალებას გაძლევთ თვალყური ადევნოთ ლოიალობის ბარათებს და მიუთითოთ ისინი გაყიდვების დოკუმენტების მომზადებისას.';ru='Включение позволяет вести учет карт лояльности и указывать их при оформлении документов продаж."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетПоПроектам";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетПоПроектам";
	НоваяНастройка.Теги = НСтр("ka='საცალო გაყიდვების ანგარიშგება,გაყიდვის დოკუმენტები,ფასდაკლება,მყიდველის შეკვეთა,ანგარიშსწორებების საწყისი ნაშთი,საწყისი ნაშთების შეყვანა';ru='Отчет о розничных продажах,Документы по продажам,Скидка,Заказ покупателя,Начальные остатки расчетов,Ввод начальных остатков';en='A report on retail sales, sales documents, discounts, order of the buyer, the opening balance calculations Entering opening balances'");
	//Малышев 2024-12-03 ONESOFT-3670 --)

	
	
	
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьПечатьЭтикетокИЦенников",
		"Продажи",
		НСтр("ka='ფასდებულების და ეტიკეტების ბეჭდვა';ru='Печать этикеток и ценников';en='Printing labels and price tags'"),
		НСтр("ka='ჩართვა იძლევა საქონლის ეტიკეტების და ფასდებულების ბეჭდვის საშუალებას."
""
"ეტიკეტების და ფასდებულების ბეჭდვა ხორციელდება გამართვადი შაბლონების მიხედვით, რომელიც ხელმისაწვდომია შემდეგ ნაწილში გაყიდვები - სერვისი - ეტიკეტების და ფასდებულების ბეჭდვა.';ru='Включение позволяет печатать этикетки и ценники на товары."
""
"Печать этикеток и ценников осуществляется по настраиваемым шаблонам, доступным в разделе Продажи - Сервис - Печать этикеток и ценников.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='გადასახდელი ანგარიში,ნომენკლატურა';ru='Счет на оплату,Номенклатура';en='Bill, Nomenclature'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьРемонты",
		"Продажи",
		НСтр("ru = 'Приемка и передача в ремонт'; ka = 'რემონტის გამოყენება'; en = 'Acceptance and transmission repair'"),
		НСтр("ru = 'Включение позволяет принимать проданные товары от покупателей по претензии, учитывать их ремонт или передачу в сервисный центр для ремонта.""""ВАЖНО!""Для идентификации возвращенных товаров в ремонте используются серийные номера, поэтому для использования данной возможности рекомендуется включить опцию ""Серийные номера"" в разделе ""Закупки"".""""Учет запасов в ремонте ведется отдельно от товаров в продаже.'; ka = 'კონსტანტის ჩართვა უფლებას გვაძლებს მივიღოთ გაყიდული საქონელი მყიდველისგან პრეტენზიის საფუძველზე, გავითვალისწინოთ ის რემონტში ან გადავცეთ სერვის ცენტს რემონტისთვის. ""მნიშვნელოვანია"" დაბრუნებული საქონლის იდენტიფიკაციისთვის გამოიყენება სერიული ნომრები, ამიტომ ამ ფუქნციონალის გამოყენებისთვის რეკომედირებულია ჩაირთოს სერიული ნომრების გამოყენების ფუქნციონალი შესყიდვების ქვესისტემიდან. რემონტში არსებული მარაგების აღრიცხვა ხდება გაყიდული მარაგებიდან გამოყოფით'; en = 'Enabling allows you to accept sold goods from buyers on a claim, take into account their repair or transfer to a service center for repair. """" IMPORTANT! ""Serial numbers are used to identify returned goods for repair, therefore, to use this feature, it is recommended to enable the"" Serial numbers ""option in the section Purchases. Inventories in repair are kept separately from goods on sale.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "СрокОплатыПокупателя";
	НоваяНастройка.Раздел			= "Продажи";
	НоваяНастройка.Представление	= НСтр("ka='მყიდველის მიერ გადახდილის შენატანი(დღე-ღამეში)';ru='Поступление оплаты от покупателя (в сутках)';en='Receipt of payment from the buyer (in days)'");
	НоваяНастройка.Описание			= НСтр("ru='Срок отсрочки платежа от покупателя. Указывается в сутках. "
""
"Данное значение устанавливается при создании нового договора с контрагентом. А также используется для определения даты оплаты при планировании платежей.';ka='მყიდველისგან გადახდის გადავადების ვადა. მიეთითება დღეებით. "
""
"მოცემული მნიშვნელობის დაყენება ხდება კონტრაგენტთან ახალი ხელშეკრულების შექმნისას. ასევე, გადახდების დაგეგმვისას გამოიყენება გადახდის თარიღის დასადგენად.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Число");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаРегулирования", Истина);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 6);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='მყიდველის შეკვეთა,გადასახდელი ანგარიში,ხელშეკრულებები,კონტრაგენტები';ru='Заказ покупателя,Счет на оплату,Договоры,Контрагенты';en='the customer orders, invoices for payment, contracts, Contractors'");
	
	//Малышев 2025-11-30 ONESOFT-4552 (--
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"КонтрольОстатковВЗаказеПокупателя",
		"Продажи",
		НСтр("ka='ნაშთების კონტროლი მყიდველის შეკვეთაში';
				|ru='Контроль остатков в заказе покупателя';
				|en='Control of balances in a customer order'"),
		НСтр("ru='Управление контролем остатков при проведении заказа покупателя.
				|';
				|ka='მომხმარებლის შეკვეთის განთავსებისას ბალანსის კონტროლის მართვა.
				|'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Заказ покупателя,Бизнес-процесс,Воронка продаж';ru='Заказ покупателя,Бизнес-процесс,Воронка продаж';en='Order of the buyer, Business Process, Sales Funnel'");
	//Малышев 2025-11-30 ONESOFT-4552 --)

	
	
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьВидыЗаказовПокупателей",
		"Продажи",
		НСтр("ka='მყიდველთა შეკვეთების სახეობები';ru='Виды заказов покупателей';en='Types of customer orders'"),
		НСтр("ru='Включение позволяет создавать несколько наборов состояний заказов и фиксировать их взаимный порядок. Набор состояний и их взаимный порядок указываются в виде заказа. Вид заказ выбирается непосредственно в документе Заказ покупателя."
"Использование видов заказов позволяет вести индивидуальные воронки продаж.';ka='Включение позволяет создавать несколько наборов состояний заказов и фиксировать их взаимный порядок. Набор состояний и их взаимный порядок указываются в виде заказа. Вид заказ выбирается непосредственно в документе Заказ покупателя."
"Использование видов заказов позволяет вести индивидуальные воронки продаж.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Заказ покупателя,Бизнес-процесс,Воронка продаж';ru='Заказ покупателя,Бизнес-процесс,Воронка продаж';en='Order of the buyer, Business Process, Sales Funnel'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьСправочникВидыЗаказовПокупателей",
		"Продажи",
		НСтр("ka='მყიდველთა შეკვეთის სახეობების სია';ru='Список видов заказов покупателей';en='List of types of customer orders'"),
		НСтр("ru=''"),
		"e1cib/list/Справочник.ВидыЗаказовПокупателей"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ИспользоватьВидыЗаказовПокупателей";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетРозничныхПродаж",
		"Продажи",
		НСтр("ka='საცალო გაყიდვები';ru='Розничные продажи';en='Retail sales'"),
		НСтр("ka='ჩართვა იძლევა საცალო ვაჭრობაში გაყიდვების აღრიცხვის წარმოების საშუალებას."
""
"საცალო გაყიდვებთან მუშაობა ხორციელდება შემდეგ ნაწილში ""გაყიდვები"" - ""საცალო გაყიდვები"".';ru='Включение позволяет вести учет продаж в рознице."
""
"Работа с розничными продажами осуществляется в разделе Продажи - Розничные продажи.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"АрхивироватьЧекиККМПриЗакрытииКассовойСмены",
		"Продажи",
		НСтр("ka='სსა-ის ჩეკების დაარქივება';ru='Архивировать чеки ККМ';en='Archive checks CMC'"),
		НСтр("ru='При включенной опции, все движения, сформированные чеками ККМ, будут переноситься в отчет о розничных продажах при закрытии кассовой смены."
""
"Данная возможность позволяет значительно уменьшить объем данных при большом количестве розничных продаж за день.';ka='ჩართული ოპციისას, სსა-ის ჩეკების მიერ ჩამოყალიბებული ყველა მოძრაობა სალაროს ცვლის დახურვისას გადატანილი იქნება საცალო გაყიდვების ანგარიშგებაში."
""
"მოცემული შესაძლებლობა დღის განმავლობაში დიდი რაოდენობით საცალო გაყიდვებისას, იძლევა მონაცემთა მოცულობის მნიშვნელოვნად შემცირების საშუალებას.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетРозничныхПродаж";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"УдалятьНепробитыеЧекиПриЗакрытииКассовойСмены",
		"Продажи",
		НСтр("ka='სსა-ის ამოურტყმელი ჩეკების წაშლა';ru='Удалять непробитые чеки ККМ';en='Remove no penetration checks CMC'"),
		НСтр("ru='При включенной опции, все не пробитые на фискальном регистраторе чеки будут удаляться при закрытии кассовой смены."
""
"Данная возможность позволяет значительно уменьшить объем данных при большом количестве непробитых чеков за день."
""
"Если флаг сброшен и используется резервирование запасов, резерв товаров в непробитых чеках сохраняется при закрытии кассовой смены. Отмену резерва требуется производить вручную в каждом отложенном чеке.';ka='ჩართული ოპციის შემთხვევაში, ფისკალურ რეგისტრატორზე ამორტყმული ყველა ჩეკი სალაროს ცვლის დახურვისას წაიშლება."
""
"მოცემული შესაძლებლობა იძლევა დღის მანძილზე ამოურტყმელი ჩეკების დიდი რაოდენობის შემთხვევაში მონაცემთა მოცულობის მნიშვნელოვნად შემცირების საშუალებას."
""
"თუ ალამი ჩამოგდებულია და მარაგების დარეზერვება გამოიყენება, ამოურტყმელ ჩეკებში სალაროს ცვლის დახურვისას საქონლის რეზერვი შენარჩუნდება. რეზერვის გაუქმება უნდა განხორციელდეს ხელით, ყოველ გადადებულ ჩეკში.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетРозничныхПродаж";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"КонтролироватьОстаткиПриПробитииЧековККМ",
		"Продажи",
		НСтр("ka='ნაშთის შემოწმება საკონტროლო-საკასო აპარატის ჩეკის ამორტყმისას და ანგარიშგებების გატარებისას';ru='Контролировать остатки при пробитии чеков ККМ и проведении отчетов';en='Monitor residues at a penetration CMC checks and conduct reports'"),
		НСтр("ka='При пробитии чеков ККМ и проведении отчетов о розничных продажах будет осуществляться контроль остатков.';ru='При пробитии чеков ККМ и проведении отчетов о розничных продажах будет осуществляться контроль остатков.';en='At a penetration CMC checks and conduct reports on retail sales will be residues control.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетРозничныхПродаж";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек",
		"Продажи",
		НСтр("ka='მყიდველთა შეკვეთები საცალო ვაჭრობაში';ru='Заказы покупателей в розничной торговле';en='Orders of buyers in retail trade'"),
		НСтр("ka='ოპცია იძლევა მყიდველთა შეკვეთების საფუძველზე სსა-ის ჩეკების გაფორმების საშუალებას. ოპცია შესაცვლელად ხელმისაწვდომია, თუ ჩამოგდებულია ალამი ""სსა-ის ჩეკების დაარქივება""!';ru='Опция позволяет оформлять чеки ККМ на основании заказов покупателей. Опция доступна для изменения, если сброшен флаг ""Архивировать чеки ККМ""!';en='This option allows you to draw checks on the basis of CMC customer orders. The option is available to change if the reset flag ""Archive CMC checks!""'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетРозничныхПродаж";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж";
	НоваяНастройка.Теги = НСтр("ka='მყიდველის შეკვეთა,საცალო გაყიდვების ანგარიშგება,სსა-ის ჩეკი,სსა-ის ცეკი დასაბრუნებლად,გაყიდვების დოკუმენტები';ru='Заказ покупателя,Отчет о розничных продажах,Чек ККМ,Чек ККМ на возврат,Документы по продажам';en=""Buyer's order, report on retail sales, Check CMC, CMC Check for a refund, documents Sales""");
	
	Если Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "ОтправкаЭлектронныхЧековПослеПробитияЧека";
		НоваяНастройка.Раздел			= "Продажи";
		НоваяНастройка.Представление	= НСтр("ka='ელექტრონული ჩეკების გაგზავნა';ru='54-ФЗ: отправка электронных чеков';en='54-FZ: sending electronic checks'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Число");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
		НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(0, НСтр("ka='ქვითრების გატარების შემდეგ';ru='После пробития чеков';en='After breaking checks'"));
		НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(1, НСтр("ka='განრიგის მიხედვით';ru='По расписанию';en='Scheduled'"));
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторСистемы;
		НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетРозничныхПродаж";
		НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж";
		НоваяНастройка.Теги = НСтр("ka='54 ФЗ';ru='54 ФЗ';en='54 of the Federal Law'");
	КонецЕсли;
	
	Если Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"АвтоматическаяОтправкаЭлектронныхЧековПоРасписанию",
			"Продажи",
			НСтр("ka='ელექტრონული ჩეკების ავტომატურად გაგზავნა განრიგის მიხედვით';ru='Автоматически отправлять электронные чеки по расписанию';en='Automatically send electronic checks on schedule'"),
			НСтр("ru=''")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторСистемы;
		НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетРозничныхПродаж";
		НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж,ОтправкаЭлектронныхЧековПослеПробитияЧека";
		НоваяНастройка.Теги = НСтр("ka='54 ФЗ';ru='54 ФЗ';en='54 of the Federal Law'");
	КонецЕсли;
	
	Если Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "РассылкаЭлектронныхЧековРасписание";
		НоваяНастройка.Раздел			= "Продажи";
		НоваяНастройка.Представление	= НСтр("ka='განრიგი';ru='Расписание';en='schedule'");
		НоваяНастройка.ТипЭлемента		= Тип("ДекорацияФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидДекорацииФормы.Надпись);
		НоваяНастройка.СвойстваЭлемента.Вставить("Гиперссылка", Истина);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторСистемы;
		НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетРозничныхПродаж";
		НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж,ОтправкаЭлектронныхЧековПослеПробитияЧека,АвтоматическаяОтправкаЭлектронныхЧековПоРасписанию";
		НоваяНастройка.Теги = НСтр("ka='54 ФЗ';ru='54 ФЗ';en='54 of the Federal Law'");
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьОчередьЭлектронныхЧеков",
		"Продажи",
		НСтр("ka='ელექტრონული ჩეკების რიგის გახსნა';ru='Открыть очередь электронных чеков';en='Open all electronic checks'"),
		НСтр("ru=''"),
		"e1cib/list/Справочник.ОчередьЭлектронныхЧековКОтправке"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетРозничныхПродаж";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж";
	НоваяНастройка.Теги = НСтр("ka='54 ФЗ';ru='54 ФЗ';en='54 of the Federal Law'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ТиповыеСхемыУчета_Розница",
		"Продажи",
		НСтр("ka='აღრიცხვის ტიპიური სქემები';ru='Типовые схемы учета';en='Typical schemes of accounting'"),
		НСтр("ru=''"),
		"e1cib/command/Обработка.МенеджерПодсказок.Команда.ТиповыеСхемыУчета_Розница"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетРозничныхПродаж";
	
	//Паганини#ЛимитиПокупателей_
	//1.
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"КонтрольЛимитовЗадолжностиПокупателей",
		"Продажи",
		НСтр("ka='მყიდველთა დავალიანების ლიმიტის კონტროლი';ru='Контроль лимитов задолжности покупателей';en='Control limits customer debts'"),
		НСтр("ru = 'Дает возможность указаниа лимитов задолжности покупателей в резрезе договора.
	          |Этим функционалом в расходном накладном появляется галочка ""Отключить контроль лимита задолжности покупателя"".
	          |Если эта галочка не включена, то при проведении документа идет проверка на лимиты задолжности.
	          |'; ka = 'შესაძლებლობას იძლევა ხელშეკრულების ჭრილში დადგინდეს დავალიანების ლიმიტი მყიდველზე.
	          |ამ ფუნქციონალით გასავლის ზედნადებში გამოჩნდება ალამი ""მყიდველის დავალიანების ლიმიტის კონტროლის გამორთვა"".
	          |თუ ეს ალამი არ არის მონიშნული, გატარებისას ხდება ლიმიტის გადაჭარბებაზე შემოწმება.'")
					);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	//2.
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "НачалоПериодаКонтроляЛимитовЗадолжностиПокупателей";
	НоваяНастройка.Раздел			= "Продажи";
	НоваяНастройка.Представление	= НСтр("ka='მყიდველთა დავალიანების ლიმიტის კონტროლის დაწყების თარიღი';ru='Начало периода контроля лимитов задолжности покупателей';en='Beginning of the period control limits customer debts'");
	НоваяНастройка.Описание			= НСтр("ru = 'Указывается дата, и которого начнется проверка лимитов.
                                            |Если не указана дата, то проверка будет во всем периоде.'; ka = 'ეთითება თარიღი, საიდანაც უნდა დაიწყოს ლიმიტების შემოწმება.
                                            |თუ არ იქნება მითითებული თარიღი, შემოწმება მოხდება სრულ პერიოდში.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Дата", , , , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", 				НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", 				НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", 					ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаРегулирования", 	Истина);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", 	ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 					12);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);		
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС 		= "КонтрольЛимитовЗадолжностиПокупателей";
	НоваяНастройка.Зависимости 	= "КонтрольЛимитовЗадолжностиПокупателей";
	//_Паганини#ЛимитиПокупателей	
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьБиллинг",
		"Продажи",
		НСтр("ka='ბილინგი და მუშაობა რეგულარულ მომსახურებებთან';ru='Биллинг и работа с регулярными услугами';en='Billing and work with regular services'"),
		НСтр("ka='თქვენთვის ხელმისაწვდომი გახდება სატარიფო გეგმები, აგრეთვე, მომსახურების ხელშეკრულებების დადების და მათ მიხედვით გადასახდელი ანგარიშების ავტომატურად წარდგენის შესაძლებლობა.';ru='Вам станут доступны тарифные планы, а так же возможность заключать договоры обслуживания и автоматически выставлять по ним Счета на оплату.';en='You will be available tariff plans, as well as the opportunity to enter into service contracts and automatically put on them to pay the bills.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"БиллингВестиУчетРасходовПоДоговорамОбслуживания",
		"Продажи",
		НСтр("ka='ხარჯების აღრიცხვის წარმოება მომსახურების ხელშეკრულებების ჭრილში';ru='Вести учет расходов в разрезе договоров обслуживания';en='Keep track of costs in the context of service contracts'"),
		НСтр("ka='მომსახურების ყოველ ხელშეკრულებაზე, ხარჯების დასაგროვებლად, ჩვენ ავტომატურად შევქმნით საქმიანობის უნიკალურ მიმართულებას.';ru='На каждый договор обслуживания, для накопления расходов, мы будем автоматически создавать уникальное направление деятельности.';en='For each service contract, for the accumulation of costs, we will automatically create a unique activity.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьБиллинг";
	НоваяНастройка.Зависимости = "ИспользоватьБиллинг";
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "БиллингГоловноеНаправлениеДеятельности";
	НоваяНастройка.Раздел			= "Продажи";
	НоваяНастройка.Представление	= НСтр("ka='საქმიანობის სათავო მიმართულება';ru='Головное направление деятельности';en='Head activity'");
	НоваяНастройка.Описание			= НСтр("ru='Элемент, в иерархию которого будут добавляться создаваемые автоматически направления деятельности по договорам обслуживания."
"Если не выбран — будут добавляться в общий список.';ka='ელემენტი, რომლის იერარქიაში დამატებული იქნება მომსახურების ხელშეკრულებების მიხედვით საქმიანობის ავტომატურად შექმნილი მიმართულებები."
"თუ არ არის არჩეული, მაშინ დამატებული იქნება საერთო სიაში.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 31);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаОткрытия", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьБиллинг";
	НоваяНастройка.Зависимости = "БиллингВестиУчетРасходовПоДоговорамОбслуживания";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ВестиСведенияДляДекларацийПоАлкогольнойПродукции",
		"Продажи",
		НСтр("ka='ალკოჰოლური პროდუქცია';ru='Алкогольная продукция';en='Алкогольная продукция'"),
		НСтр("ka='ჩართვა იძლევა ესასს-თან გაცვლის და ალკოჰოლური პროდუქციის საცალო გაყიდვის მოცულობის აღრიცხვის ჟურნალის შესავსებად აუცილებელი ცნობების რეგისტრირების საშუალებას."
""
"მოცემული შესაძლებლობის ჩასართავად აუცილებელია ""საცალო გაყიდვები''-ს ჩართვა.';ru='Включение позволяет обмениваться с ЕГАИС и регистрировать сведения, необходимые для заполнения журнала учета объема розничной продажи алкогольной продукции."
""
"Для включения данной возможности, необходимо включить ""Розничные продажи"".'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж";
	НоваяНастройка.Теги = НСтр("ru='Расходная накладная,Номенклатура,Категории номенклатуры,Виды алкогольной продукции,Лицензии поставщиков алкогольной продукции';en='Sales Invoice, Inventory, Categories nomenclature Types of alcoholic beverages, alcoholic beverages suppliers Licenses'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ДатаНачалаРегистрацииРозничныхПродажВЕГАИС";
	НоваяНастройка.Раздел			= "Продажи";
	НоваяНастройка.Представление	= НСтр("ka='ესასს-ში გაყიდვების რეგისტრაციის დაწყების თარიღი';ru='Дата начала регистрации продаж в ЕГАИС';en='Date of commencement of registration of sales in EGAIS'");
	НоваяНастройка.Описание			= НСтр("ka='ესასს-ში საცალო გაყიდვების რეგისტრაციის დაწყების თარიღი განისაზღვრება კანონმდებლობით';ru='Дата начала регистрации розничных продаж в ЕГАИС "
"определяется законодательством'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Дата");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("ФорматРедактирования", "ДФ=dd.MM.yyyy");
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 10);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ВестиСведенияДляДекларацийПоАлкогольнойПродукции";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж,ВестиСведенияДляДекларацийПоАлкогольнойПродукции";
	НоваяНастройка.Теги = НСтр("ru='Расходная накладная,Номенклатура,Категории номенклатуры,Виды алкогольной продукции,Лицензии поставщиков алкогольной продукции';en='Sales Invoice, Inventory, Categories nomenclature Types of alcoholic beverages, alcoholic beverages suppliers Licenses'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ВыгружатьПродажиНемаркируемойПродукцииВЕГАИС",
		"Продажи",
		НСтр("ka='არამარკირებადი პროდუქციის გაყიდვების გადმოტვირთვა ესასს-ში';ru='Выгружать продажи немаркируемой продукции в ЕГАИС';en='Unload sale nemarkiruemoy products EGAIS'"),
		НСтр("ru=''")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ВестиСведенияДляДекларацийПоАлкогольнойПродукции";
	НоваяНастройка.Зависимости = "ВестиСведенияДляДекларацийПоАлкогольнойПродукции";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкиОбменаЕГАИС",
		"Продажи",
		НСтр("ka='გაცვლის გამართვა ესასს';ru='Настройки обмена ЕГАИС';en='Settings EGAIS exchange'"),
		НСтр("ka='ესასს-სთან შეერთების გამოსაყენებელი მეთოდების გამართვები მაღაზიების და ორგანიზაციების ჭრილში.';ru='Настройки используемых способов подключения к ЕГАИС в разрезе магазинов и организаций.';en='Settings used to connect to EGAIS ways in the context of the shops and organizations.'"),
		"e1cib/list/РегистрСведений.НастройкиОбменаЕГАИС"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ВестиСведенияДляДекларацийПоАлкогольнойПродукции";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетРозничныхПродаж,ВестиСведенияДляДекларацийПоАлкогольнойПродукции";
	НоваяНастройка.Теги = НСтр("ru='Расходная накладная,Номенклатура,Категории номенклатуры,Виды алкогольной продукции,Лицензии поставщиков алкогольной продукции';en='Sales Invoice, Inventory, Categories nomenclature Types of alcoholic beverages, alcoholic beverages suppliers Licenses'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ПодарочныеСертификаты",
		"Продажи",
		НСтр("ka='სასაჩუქრე სერტიფიკატები';ru='Подарочные сертификаты';en='Gift certificates'"),
		НСтр("ka='თუ თქვენ იყენებთ ან გსურთ გამოიყენოთ სასაჩუქრე სერთიფიკატები, მაშინ აქ, დააყენეთ ალამი და აღწერეთ გამოყენების თქვენი სცენარი.';ru='Если вы используете или хотите использовать подарочные сертификаты - поставьте здесь флажок и опишите ваш сценарий использования.';en='If you are using or want to use the gift certificates - Choose this option and describe your usage scenario.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='მყიდველის შეკვეთა,გადასახდელი ანგარიში,გაყიდვების დოკუმენტები';ru='Заказ покупателя,Счет на оплату,Документы по продажам';en=""Buyer's order, Invoicing, Sales Documents""");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"Бонусы",
		"Продажи",
		НСтр("ka='ფასდაკლებების ბონუს-სისტემა';ru='Бонусная система скидок';en='Loyalty discounts'"),
		НСтр("ka='თუ თქვენ იყენებთ ან გსურთ გამოიყენოთ ლოიალობის ბონუს-სისტემა, მაშინ აქ, დასვით ალამი და აღწერეთ გამოყენების თქვენი სცენარი.';ru='Если вы используете или хотите использовать бонусную систему лояльности - поставьте здесь флажок и опишите ваш сценарий использования.';en='If you are using or want to use a loyalty bonus system - Choose this option and describe your usage scenario.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='Скидка,Заказ покупателя,Счет на оплату,Контрагенты,Документы по продажам';ru='Скидка,Заказ покупателя,Счет на оплату,Контрагенты,Документы по продажам';en='Discount, the buyer orders, invoices for payment, Accounts, Sales Documents'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"Купоны",
		"Продажи",
		НСтр("ka='საფასდაკლებო კუპონები';ru='Скидочные купоны';en='Discount coupons'"),
		НСтр("ka='თუ თქვენ იყენებთ ან გსურთ გამოიყენოთ ფასდაკლების კუპონები, მაშინ აქ, დააყენეთ ალამი და აღწერეთ გამოყენების თქვენი სცენარი.';ru='Если вы используете или хотите использовать купоны на скидку - поставьте здесь флажок и опишите ваш сценарий использования.';en='If you are using or want to use the discount coupons - Choose this option and describe your usage scenario.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='მყიდველის შეკვეთა,გადასახდელი ანგარიში,კონტრაგენტები,გაყიდვის დოკუმენტები';ru='Заказ покупателя,Счет на оплату,Контрагенты,Документы по продажам';en='the customer orders, invoices for payment, Accounts, Sales Documents'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"НаборыИКомплекты",
		"Продажи",
		НСтр("ka='კრებულები და კომპლექტები';ru='Наборы и комплекты';en='Sets & Kits'"),
		НСтр("ka='გაგვაგებინეთ, თუ საქონელს კრებულებად ან კომპლექტებად ყიდით, და ჩვენ, მოვახდენთ ამ შესაძლებლობის რეალიზებას პროგრამაში.';ru='Дайте нам знать, если продаете товары наборами или комплектами, и мы реализуем эту возможность в программе.';en='Let us know if you are selling goods or sets of sets, and we will implement this feature in the program.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='Заказ покупателя,Счет на оплату,Расходная накладная,Продажи';ru='Заказ покупателя,Счет на оплату,Расходная накладная,Продажи';en=""Buyer's order, Invoicing, Invoice, Sales""");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"СопутствующиеТовары",
		"Продажи",
		НСтр("ka='დაკავშირებული საქონელლი';ru='Сопутствующие товары';en='Related products'"),
		НСтр("ru='Товары, дополняющие основной, образующие вместе с ним единый комплект, и продающиеся совместно.';en='Products that complement the main, forming with it a single set, and sold together.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='Заказ покупателя,Счет на оплату,Расходная накладная,Продажи';ru='Заказ покупателя,Счет на оплату,Расходная накладная,Продажи';en=""Buyer's order, Invoicing, Invoice, Sales""");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ВесовойУчет",
		"Продажи",
		НСтр("ka='წონითი აღრიცხვა';ru='Весовой учет';en='weight records'"),
		НСтр("ru='Работа с весовым товаром. Когда при продаже товар необходимо взвесить и сгенерировать штрих-код с весом. При считывании сканером такого штрих-кода, цена рассчитается в соответствии с весом.';en='Working with weight goods. When the sale of the goods to be weighed with the weight and generate a barcode. When reading scanner of the bar code, the price is calculated according to weight.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='წონა';ru='Вес';en='Weight'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"EDI",
		"Продажи",
		НСтр("ru='Обмен с EDI-провайдерами';en='Exchange with EDI-Providers'"),
		НСтр("ka='Поставляете свои товары в розничные сети, которые работают через EDI-провайдеров типа Корус, Exite, CISLink, EDIWeb, Comarch или других? Отправьте нам название вашего провайдера - мы постараемся сделать синхронизацию с ним.';ru='Поставляете свои товары в розничные сети, которые работают через EDI-провайдеров типа Корус, Exite, CISLink, EDIWeb, Comarch или других? Отправьте нам название вашего провайдера - мы постараемся сделать синхронизацию с ним.';en='Deliver products to retailers that operate via EDI-type Korus providers, Exite, CISLink, EDIWeb, Comarch or other? Send us the name of your service provider - we will try to sync with it.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетПоНесколькимСкладам",
		"Закупки",
		НСтр("ka='რამდენიმე საწყობი';ru='Несколько складов';en='several warehouses'"),
		НСтр("ru='Включение позволяет вести учет в разрезе складов. Указание склада будет требоваться во всех складских документах."
""
"Задать имеющиеся склады можно в разделе Компания – Склады.';ka='ჩართვა იძლევა საწყობების ჭრილში აღრიცხვის წარმოების საშუალებას. საწყობის მითითება მოთხოვნილი იქნება ყველა სასაწყობე დოკუმენტში."
""
"არსებული საწყობების მიცემა შეიძლება მხოლოდ შემდეგ ნაწილში კომპანია - საწყობები.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Авансовый отчет,Дополнительные расходы,Заказ покупателя,Заказ поставщику,Приходная накладная,Расходная накладная,Корректировка поступления,Корректировка реализации,Документы по складу,Начальные остатки товаров,Ввод начальных остатков';ru='Авансовый отчет,Дополнительные расходы,Заказ покупателя,Заказ поставщику,Приходная накладная,Расходная накладная,Корректировка поступления,Корректировка реализации,Документы по складу,Начальные остатки товаров,Ввод начальных остатков';en='Expense report, additional costs, the customer order, the dealer, Purchase Invoice, Sales Invoice, revenue adjustment, the implementation of adjustment, warehouse documents, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетВРазличныхЕдиницахИзмерения",
		"Закупки",
		НСтр("ka='რამდენიმე საზომი ერთეული';ru='Несколько единиц измерения';en='Several units'"),
		НСтр("ru='Включение позволяет учитывать номенклатуру в различных единицах измерения. Например в штуках, блоках, коробках или килограммах."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';ka='Включение позволяет учитывать номенклатуру в различных единицах измерения. Например в штуках, блоках, коробках или килограммах."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Приходная накладная,Расходная накладная,Заказ поставщику,Номенклатура,Начальные остатки товаров,Ввод начальных остатков';ru='Приходная накладная,Расходная накладная,Заказ поставщику,Номенклатура,Начальные остатки товаров,Ввод начальных остатков';en='Purchase Invoice, Sales Invoice, Purchase Orders, Inventory, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьХарактеристики",
		"Закупки",
		НСтр("ka='ნომენკლატურის მახასიათებლები';ru='Характеристики номенклатуры';en='Features nomenclature'"),
		НСтр("ru='Включение позволяет вести учет номенклатуры в разрезе дополнительных характеристик."
""
"Характеристики – это отдельные варианты номенклатуры. Они представляют собой комбинацию конкретных значений по указанным свойствам."
""
"Использование характеристик позволяет избежать создания большого количества схожих номенклатур."
""
"ПРИМЕР."
"Фирма реализует покупателям товары народного потребления: одежду, обувь, бытовую химию. Каждая модель одежды или обуви характеризуется размером и цветом, а у бытовой химии таких свойств нет. Зато могут быть другие свойства: тип упаковки (пластмасса, стекло) и емкость упаковки (в мл.). В этом случае, в программе будет номенклатура ""Футболка мужская"", характеристика ""50, желтая"", свойства: размер = 50, цвет = желтая."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';ka='ჩართვა იძლევა დამატებითი მახასიათებლების ჭრილში ნომენკლატურის აღრიცხვის წარმოების საშუალებას."
""
"მახასიათებლები, ეს არის ნომენკლატურის ცალკეული ვარიანტები. ისინი წარმოადგენენ აღნიშნული თვისებების მიხედვით კონკრეტული მნიშვნელობების კომბინაციას."
""
"მახასიათებლების გამოყენება იძლევა დიდი რაოდენობით მსგავსი ნომენკლატურის შექმნისგან თავის არიდების საშუალებას."
""
"მაგალითი."
"ფირმა მყიდველებისთვის ახორციელებს სახალხო მოხმარების საქონლის - ტანსაცმლის, ფეხსაცმლის, საყოფაცხოვრებო ქიმიის რეალიზაციას. ტანსაცმლის ან ფეხსაცმლის ყოველ მოდელს ახასიათებს ზომა და ფერი, ხოლო საყოფაცხოვრებო ქიმიას ამგვარი თვისებები არ გააჩნია. სამაგიეროდ, შეიძლება ჰქონდეს სხვა თვისებები: შეფუთვის ტიპი (პლასტმასი, მინა) და შეფუთვის ტევადობა (მლ-ებში). ამ შემთხვევაში, პროგრამაში იქნება ნომენკლატურა ""მამაკაცის მაისური"", მახასიათებელი ""50, ყვითელი"", თვისებები: ზომა = 50, ფერი = ყვითელი."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Категории номенклатуры,Номенклатура,Характеристики,Акт выполненных работ,Задание на работу,Заказ на производство,Заказ покупателя,Заказ поставщику,Перемещение запасов,Приходная накладная,Расходная накладная,Счет на оплату,Счет на оплату (полученный),Начальные остатки товаров,Ввод начальных остатков';ru='Категории номенклатуры,Номенклатура,Характеристики,Акт выполненных работ,Задание на работу,Заказ на производство,Заказ покупателя,Заказ поставщику,Перемещение запасов,Приходная накладная,Расходная накладная,Счет на оплату,Счет на оплату (полученный),Начальные остатки товаров,Ввод начальных остатков';en='Category nomenclature Nomenclature, Specifications, Contract, Assignment for work, order for production, the customer order, the dealer, stock transfer, Purchase Invoice, Sales Invoice, Receipt for payment, invoice for payment (received), the opening balance of goods Entry opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьПартии",
		"Закупки",
		НСтр("ka='ნომენკლატურის პარტიები';ru='Партии номенклатуры';en='nomenclature party'"),
		НСтр("ru='Включение позволяет учитывать запасы в разрезе конкретных партий номенклатуры."
""
"Партионный учет предполагает, что каждая партия одного и того же запаса может учитываться на складе отдельно. Ведение партионного учета для запасов, принятых на комиссию, в переработку или на ответственное хранение от стороннего контрагента является обязательным. Для собственных запасов определяется спецификой компании."
""
"ВАЖНО!"
"Партия номенклатуры не является аналогом документа оприходования запасов и не используется для определения стоимости списания товарно-материальных запасов по методу FIFO."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';ka='ჩართვა იძლევა ნომენკლატურის კონკრეტული პარტიების ჭრილში მარაგების აღრიცხვის საშუალებას."
""
"პარტიონული აღრიცხვა გულისხმობს იმას, რომ ერთი და იგივე მარაგის ყოველი პარტია საწყობში შეიძლება ცალკე იქნას აღრიცხული. პარტიონული აღრიცხვის წარმოება საკომისიოდ, გადამუშავებაში ან გარეშე კონტრაგენტისგან საპასუხისმგებლო შენახვაზე მიღებული მარაგებისთვის, სავალდებულოა. საკუთარი მარაგებისთვის განისაზღვრება კომპანიის სპეციფიკით."
""
"მნიშვნელოვანია!"
"ნომენკლატურის პარტია მარაგების შემოსავალში აყვანის დოკუმენტის ანალოგს არ წარმოადგენს და FIFO-ს მეთოდით სასაქონლო-მატერიალური მარაგების ჩამოწერის ღირებულების დასადგენად არ გამოიყენება."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Номенклатура,Авансовый отчет,Дополнительные расходы,Заказ покупателя,Инвентаризация запасов,Корректировка поступления,Корректировка реализации,Оприходование запасов,Отчет комиссионера,Отчет комитенту,Отчет о переработке,Отчет о розничных продажах,Отчет переработчика,Перемещение запасов,Перемещение по ячейкам,Переоценка в рознице (суммовой учет),Принятие к учету,Приходная накладная,Приходный ордер,Распределение затрат,Расходная накладная,Расходный ордер,Резервирование запасов,Сдельный наряд,Списание запасов,Счет на оплату,Счет на оплату (полученный),Счет-фактура,Счет на оплату (полученный),Чек ККМ,Чек ККМ на возврат,Документы по закупкам,Начальные остатки товаров,Ввод начальных остатков';ru='Номенклатура,Авансовый отчет,Дополнительные расходы,Заказ покупателя,Инвентаризация запасов,Корректировка поступления,Корректировка реализации,Оприходование запасов,Отчет комиссионера,Отчет комитенту,Отчет о переработке,Отчет о розничных продажах,Отчет переработчика,Перемещение запасов,Перемещение по ячейкам,Переоценка в рознице (суммовой учет),Принятие к учету,Приходная накладная,Приходный ордер,Распределение затрат,Расходная накладная,Расходный ордер,Резервирование запасов,Сдельный наряд,Списание запасов,Счет на оплату,Счет на оплату (полученный),Счет-фактура,Счет на оплату (полученный),Чек ККМ,Чек ККМ на возврат,Документы по закупкам,Начальные остатки товаров,Ввод начальных остатков';en='Nomenclature, expense reports, additional costs, the customer order, inventory reserves, income adjustment, adjustment realization Posting inventory report of the commission, report to the principal of processing, Retail Sales Report Report Report processor, inventory movement, movement of cells, Revaluation retail (accrual accounting), initial recognition Purchase Invoice, credit orders, cost Allocation, Sales Invoice, disbursement vouchers, Reserving inventory, piece outfit, write-downs, to pay bills, for payment (received), Invoice, Receipt for payment (received), Check CMC, CMC Check for refund, procurement documents, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьСерийныеНомера",
		"Закупки",
		НСтр("ru = 'Серийные номера, гарантийные сроки'; ka = 'სერიული ნომრების გამოყენება'; en = 'Serial numbers, warranty periods'"),
		НСтр("ru = 'Включение позволяет использовать серийные номера товаров, как справочно (для контроля гарантийного срока после продажи), так и для учета остатков в разрезе серийных номеров.""Серийный номер - уникальный для каждой единицы товара.""""Можно использовать 2 режима серийных номеров:""Справочно: серийные номера можно указывать при необходимости. Целесообразно указывать серийный номер при продаже товара, чтобы зафиксировать факт продажи и начало гарантийного срока.""Учет остатков: серийные номера обязательны к заполнению во всех документах движения товаров. Ведется контроль остатков в разрезе серийных номеров.'; ka = 'ფუნქციონალის ჩართვა საშუალებას გაძლევთ გამოიყენოთ საქონლის სერიული ნომრები, როგორც ინფორმაციულად (გაყიდვის შემდეგ საგარანტიო პერიოდის გასაკონტროლებლად), ასევე ნაშთების აღრიცხვისთვის სერიული ნომრების მიხედვით. ""სერიული ნომერი უნიკალურია საქონლის თითოეული ერთეულისთვის."" ""შეგიძლიათ გამოიყენეთ სერიული ნომრების 2 რეჟიმი:"" ინფორმაციისთვის: სერიული ნომრების მითითება შესაძლებელია საჭიროებისამებრ. მიზანშეწონილია საქონლის რეალიზაციისას მიეთითოს სერიული ნომერი რეალიზაციის ფაქტისა და საგარანტიო ვადის დაწყების დაფქსირების მიზნით.„ნაშთების აღრიცხვისთვის: საქონლის გადაადგილების ყველა დოკუმენტში საჭიროა სერიული ნომრების შევსება. ნაშთების კონტროლი სერიული ნომრების მიხედვით ხორციელდება.'; en = 'Allows you to use serial numbers of goods, both for reference (to control the warranty period after sale), and for accounting of balances in the context of serial numbers. ""Serial number is unique for each unit of goods."" ""You can use 2 modes of serial numbers:"" For reference: serial numbers can be specified as required. It is advisable to indicate the serial number when selling the goods in order to record the fact of sale and the beginning of the warranty period. ""Accounting of balances: serial numbers are required to be filled in all documents of the movement of goods. Control of balances in the context of serial numbers is carried out.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Начальные остатки товаров,Ввод начальных остатков';en='Nomenclature, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"КонтрольОстатковСерийныхНомеров",
		"Закупки",
		НСтр("ka='სერიული ნომრების ნაშთების კონტროლი';ru='Контроль остатков серийных номеров';en='Control of residues of serial numbers'"),
		НСтр("ru = 'Контроль остатков запасов с учетом серийных номеров. """"Если контроль остатков ОТКЛЮЧЕН:""Серийные номера в документах можно указывать произвольно. Достаточно указывать серийные номера в документах продажи товара, чтобы зафиксировать начало гарантийного срока.""""Если контроль остатков ВКЛЮЧЕН:""Серийные номера нужно обязательно вводить во всех документах. Можно посмотреть, какие серийные номера есть в наличии, в момент подбора товаров или в отчетах.""""ВАЖНО!""Возможность нельзя отключить после начала работы в программе. Необходимо провести инвентаризацию запасов с учетом серийных номеров.'; ka = 'მარაგების ნაშთების კონტროლი სერიული ნომრების გათვალისწინებით. """" თუ მარაგების კონტროლი გამორთულია: ""დოკუმენტებში სერიული ნომრები შეიძლება მხოლოდ ინფორმაციულად იყოს მითითებული. საკმარისია გაყიდვის დოკუმენტებში სერიული ნომრების მითითება გარანტიის პერიოდის დასაწყისად."" ""თუ მარაგების კონტროლი ჩართულია:"" სერიული ნომრები უნდა იყოს ყველა დოკუმენტში მითითებული. დაინახავთ სერიულ ნომრებს საქონლის შერჩევისას ან ანგარიშგებებში. """" მნიშვნელოვანია! ""ფუნქციონალის გამორთვა შეუძლებელია პროგრამაში მუშაობის დაწყების შემდეგ.'; en = 'Control of inventory balances taking into account serial numbers. """" If inventory control is DISABLED: ""Serial numbers in documents can be specified arbitrarily. It is enough to indicate serial numbers in the sale documents to record the beginning of the warranty period."" ""If inventory control is ON:"" Serial numbers must be entered in all documents. You can see what serial numbers are in stock at the time of selection of goods or in reports. """" IMPORTANT! ""The option cannot be turned off after you start working in the program.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьСерийныеНомера";
	НоваяНастройка.Зависимости = "ИспользоватьСерийныеНомера";
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Начальные остатки товаров,Ввод начальных остатков';en='Nomenclature, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетГТД",
		"Закупки",
		НСтр("ka='სატვირთო-საბაჟო დეკლარაციები (სსდ)';ru='Грузовые таможенные декларации (ГТД)';en='Cargo customs declaration (CCD)'"),
		НСтр("ka='ჩართვა იძლევა სატვირთო-საბაჟო დეკლარაციების ჭრილში ნაშთების აღრიცხვის საშუალებას.';ru='Включение позволяет учитывать остатки в разрезе ГТД.';en='Inclusion takes into account the residues in the context of GTD.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Приходная накладная,Расходная накладная,Документы по закупкам,Начальные остатки товаров,Ввод начальных остатков,Номенклатура';ru='Приходная накладная,Расходная накладная,Документы по закупкам,Начальные остатки товаров,Ввод начальных остатков,Номенклатура';en='Purchase Invoice, Sales Invoice, procurement documents, the opening balance of goods Entering opening balances, Nomenclature'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"КонтролироватьОстаткиПоНомерамГТД",
		"Закупки",
		НСтр("ka='ნაშთების კონტროლი სატვირთო-საბაჟო დეკლარაციის ნომრების მიხედვით';ru='Контроль остатков по номерам ГТД';en='Control of residues numbers GTE'"),
		НСтр("ru='Контроль остатков запасов в разрезе ГТД. '")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияУчетГТД";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияУчетГТД";
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Начальные остатки товаров,Ввод начальных остатков';en='Nomenclature, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиЗакупки",
		"Закупки",
		НСтр("ka='ფასდაკლებები და ფასნამატები შესყიდვებში';ru='Скидки и наценки в закупках';en='Discounts and mark-ups in the procurement'"),
		НСтр("ka='უჯრებიანი საწყობები';ru='Ячеистые склады';en='cellular warehouses'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='შეკვეთა მომწოდებელს,შემოსვლის ზედნადები,გადასახდელი ანგარიში (მიღებული),ხელშეკრულებები,შესყიდვის დოკუმენტები,ანგარიშსწორებების საწყისი ნაშთები,საწყისი ნაშთების შეყვანა';ru='Заказ поставщику,Приходная накладная,Счет на оплату (полученный),Договоры,Документы по закупкам,Начальные остатки расчетов,Ввод начальных остатков';en='Purchase Orders, Purchase Invoice, Receipt for payment (received), contracts, procurement documents, the opening balance calculations Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетЦенКонтрагентов",
		"Закупки",
		НСтр("ka='კონტრაგენტთა ფასები';ru='Цены контрагентов';en='counterparties prices'"),
		НСтр("ka='ჩართვა იძლევა შემოსვლის ზედნადებების გაფორმებისას მომწოდებლების ფასების (შემომავალი ფასების) დაფიქსირების საშუალებას."
""
"პროგრამაში არსებობს შემომავალი ფასების ავტომატურად რეგისტრირების შესაძლებლობა. ამისთვის, საჭიროა კონტრაგენტის ხელშეკრულებაში ველ ""კონტრაგენტის ფასების სახეობა""-ს შევსება.';ru='Включение позволяет фиксировать цены поставщиков (входящие цены) при оформлении приходных накладных."
""
"В программе существует возможность регистрировать входящие цены автоматически. Для этого необходимо заполнить поле ""Вид цен контрагента"" в договоре контрагента.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Приходная накладная,Договоры,Контрагенты,Документы по закупкам';ru='Приходная накладная,Договоры,Контрагенты,Документы по закупкам';en='Purchase Invoice, Contracts, Accounts, procurement documents'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияРезервированиеЗапасов",
		"Закупки",
		НСтр("ka='მარაგების რეზერვირება';ru='Резервирование запасов';en='inventory reservations'"),
		НСтр("ka='ჩართვა იძლევა საწყობებში მარაგების დარეზერვების, მყიდველთა შეკვეთების მიხედვით წარმოებაში მატერიალური და სხვა პირდაპირი დანახარჯების გათვალისწინების, მყიდველთა შეკვეთების მომწოდებლებისთვის ღია შეკვეთებში და საწარმოო (აწყობის, დაშლის) შეკვეთებში განთავსების საშუალებას."
""
"მნიშვნელოვანია!"
"პროგრამაში მუშაობის დაწყების შემდეგ, შესაძლებლობის გამორთვა არ შეიძლება.';ru='Включение позволяет резервировать запасы на складах, учитывать материальные и другие прямые затраты в производстве по заказам покупателей, размещать заказы покупателей в открытых заказах поставщикам и заказах на производство (сборку, разборку)."
""
"ВАЖНО! Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Авансовый отчет,Дополнительные расходы,Заказ на производство,Заказ покупателя,Заказ поставщику,Корректировка реализации,Начисление зарплаты,Отчет о переработке,Отчет переработчика,Перемещение запасов,Приходная накладная,Прочие затраты (расходы),Распределение затрат,Расходная накладная,Сдельный наряд,Производство,Документы по закупкам,Начальные остатки товаров,Ввод начальных остатков';ru='Авансовый отчет,Дополнительные расходы,Заказ на производство,Заказ покупателя,Заказ поставщику,Корректировка реализации,Начисление зарплаты,Отчет о переработке,Отчет переработчика,Перемещение запасов,Приходная накладная,Прочие затраты (расходы),Распределение затрат,Расходная накладная,Сдельный наряд,Производство,Документы по закупкам,Начальные остатки товаров,Ввод начальных остатков';en='Expense report, additional costs, order for production, the customer order, the dealer, the implementation of adjustment, wages, salaries, report processing, report processor, Stock Transfer, Purchase Invoice, Other expenses (costs), Cost Allocation, Sales Invoice, piece outfit, production, procurement documents, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПриемЗапасовНаОтветхранение",
		"Закупки",
		НСтр("ka='მარაგების მიღება პასუხისმგებლიან შენახვაში';ru='Прием запасов на ответственное хранение';en='Admission reserves for safekeeping'"),
		НСтр("ka='ჩართვა იძლევა გარეშე კონტრაგენტებისგან საპასუხისმგებლო შენახვაზე მარაგების მიღების წარმოების საშუალებას."
""
"მნიშვნელოვანია!"
"საკუთარი მარაგების გასარჩევად საპასუხისმგებლო შენახვაზე მიღებული მარაგებისგან, გამოიყენება აღრიცხვის დამატებითი ჭრილი - ""ნომენკლატურის პარტიები"". ამიტომ, მოცემული შესაძლებლობის გამოსაყენებლად აუცილებელია ნაწილ ""შესყიდვები""-ში ოპცია ""ნომენკლატურის პარტიები""-ს ჩართვა."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='Включение позволяет вести прием запасов на ответственное хранение от сторонних контрагентов."
""
"ВАЖНО!"
"Для отличия собственных запасов от запасов, принятых на ответственное хранение, используется дополнительный разрез учета - ""Партии номенклатуры"". Поэтому для использования данной возможности необходимо включить опцию ""Партии номенклатуры"" в разделе ""Закупки""."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПартии";
	НоваяНастройка.Теги = НСтр("ka='Приходная накладная,Номенклатура,Документы по закупкам,Начальные остатки товаров,Ввод начальных остатков';ru='Приходная накладная,Номенклатура,Документы по закупкам,Начальные остатки товаров,Ввод начальных остатков';en='Purchase Invoice, Inventory, procurement documents, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПередачаСырьяВПереработку",
		"Закупки",
		НСтр("ka='ნედლეულის და მატერიალების გადაცემა გადასამუშავებლად';ru='Передача сырья и материалов в переработку';en='Transfer of raw materials and materials processing'"),
		НСтр("ka='ჩართვა იძლევა საკუთარი ნედლეულის და მასალების გარეშე კონტრაგენტებისთვის პროდუქციის დასამზადებლად ან გადასამუშავებლად გადაცემის გათვალისწინების საშუალებას."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='Включение позволяет учитывать передачу собственного сырья и материалов сторонним контрагентам для изготовления продукции или переработки."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='ნომენკლატურა,შეკვეთა მომწოდებელს,საქონლების საწყისი ნაშთი,საწყისი ნაშთების შეყვანა';ru='Номенклатура,Заказ поставщику,Начальные остатки товаров,Ввод начальных остатков';en='Nomenclature, orders to suppliers, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПередачаЗапасовНаОтветхранение",
		"Закупки",
		НСтр("ru = 'Передача запасов на ответственное хранение'; ka = 'მარაგების გადაცემა შესანახად'; en = 'Transfer of Stocks for safekeeping'"),
		НСтр("ru = 'Опция определяет возможность передачи собственных запасов на ответственное хранение сторонним контрагентам.""""ВАЖНО!""Возможность нельзя отключить после начала работы в программе.'; ka = 'ფუქნციონალის ჩართვა გაძლევთ საშუალებას გადასცეთ საკუთარი მარაგები შესანახად მესამე მხარეს. ""მნიშვნელოვანია"" ფუქნციონალის გამორთვა შეუძლებელია მისი ჩართვისა და გამოყენების შემდეგ'; en = 'The option determines the ability to transfer your own stocks for safekeeping to third-party counterparties. """" IMPORTANT! ""The option cannot be disabled after starting of work in the program.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Начальные остатки товаров,Ввод начальных остатков';en='Nomenclature, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьКорректировкиПоступлений",
		"Закупки",
		НСтр("ka='შემოსვლების კორექტირება';ru='Корректировки поступлений';en='adjustments to earnings'"),
		НСтр("ka='ჩართვა იძლევა საქონლის შემოსვლის კორექტირებების და საკორექტირებო ანგარიშფაქტურების ცალკე დოკუმენტებად გაფორმების საშუალებას."
""
"საკორექტირებო დოკუმენტები იძლევა რედაქტირებისთვის დახურულ და აკრძალულ პერიოდში მყოფი მონაცემების შეცვლის საშუალებას.';ru='Включение позволяет оформлять отдельными документами корректировки поступления товаров и корректировочные счета-фактуры."
""
"Корректировочные документы позволяют изменить данные, находящиеся в закрытом и запрещенном для редактирования периоде.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Приходная накладная,Заказ поставщику,Начальные остатки расчетов,Ввод начальных остатков';ru='Приходная накладная,Заказ поставщику,Начальные остатки расчетов,Ввод начальных остатков';en='Purchase Invoice, Purchase Orders, the opening balance calculations Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьОрдерныйСклад",
		"Закупки",
		НСтр("ka='საორდერო საწყობები';ru='Ордерные склады';en='a warrant warehouses'"),
		НСтр("ka='ჩართვა იძლევა მარაგების აღრიცხვის სასაწყობედ და ფინანსურად გაყოფის საშუალებას."
""
"მექანიზმი გამოიყენება საწყობში არსებული მარაგების აღრიცხვის და მმართველობით კონტურში მარაგების აღრიცხვის გაყოფის საჭიროების შემთხვევაში."
""
"ამ შემთხვევაში, საწყობში არსებული მარაგების აღრიცხვისთვის გამოიყენება შემოსვლის და გასავლის სასაწყობე ორდერები, აგრეთვე, დოკუმენტი საწყობის სტრუქტურის შიგნით მარაგების გადაადგილების ასასახად (მაგალითად, შემოსული საქონლის თაროებზე და უჯრედებში გასანაწილებლად ან გადასატვირთად შეკვეთის კომპლექტაციისთვის)."
""
"მმართველობით კონტურში მარაგების აღრიცხვისთვის გამოიყენება ფინანსური დოკუმენტები - გასავლის ზედნადებები, მარაგების გადაადგილებები და ა.შ."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='Включение позволяет разделить учет запасов на складской и финансовый."
""
"Механизм используется при необходимости разделить учет запасов на складе и учет запасов в управленческом контуре."
""
"В этом случае, для учета запасов на складе используются приходные и расходные складские ордера, а также документ для отражения перемещения запасов внутри структуры склада (например, для распределения поступивших товаров по полкам и ячейкам или комплектации заказа для отгрузки)."
""
"Для учета запасов в управленческом контуре используются финансовые документы - расходные накладные, перемещения запасов и т.д."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Приходная накладная,Расходная накладная,Заказ поставщику,Начальные остатки товаров,Ввод начальных остатков';ru='Приходная накладная,Расходная накладная,Заказ поставщику,Начальные остатки товаров,Ввод начальных остатков';en='Purchase Invoice, Sales Invoice, Purchase Orders, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияУчетПоЯчейкам",
		"Закупки",
		НСтр("ka='უჯრებიანი საწყობები';ru='Ячеистые склады';en='cellular warehouses'"),
		НСтр("ru='Включение позволяет детализировать место хранения номенклатуры до складской ячейки."
""
"Перечень ячеек определяется для каждого склада отдельно."
"Вместе с этой опцией будет включен учет по нескольким складам."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.';ka='Включение позволяет детализировать место хранения номенклатуры до складской ячейки."
""
"Перечень ячеек определяется для каждого склада отдельно."
"Вместе с этой опцией будет включен учет по нескольким складам."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Номенклатура,Авансовый отчет,Заказ покупателя,Заказ поставщику,Корректировка поступления,Корректировка реализации,Оприходование запасов,Перемещение запасов,Приходная накладная,Расходная накладная,Производство,Документы по складу,Начальные остатки товаров,Ввод начальных остатков';ru='Номенклатура,Авансовый отчет,Заказ покупателя,Заказ поставщику,Корректировка поступления,Корректировка реализации,Оприходование запасов,Перемещение запасов,Приходная накладная,Расходная накладная,Производство,Документы по складу,Начальные остатки товаров,Ввод начальных остатков';en='Nomenclature, expense reports, order of the buyer, orders to suppliers, income adjustment, the implementation of adjustment, Posting stocks, stock transfer, Purchase Invoice, Sales Invoice, Production, warehouse documents, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьСервисРасчетПотребностей",
		"Закупки",
		НСтр("ru = 'Расчет потребностей (планирование)'; ka = 'მოთხოვნილებების გამოანგარიშება (დაგეგმვა)'; en = 'Calculation of requirements (planning)'"),
		НСтр("ru = 'Включение позволяет рассчитывать потребности фирмы (дефицит) в тех или иных товарах.""""Расчет производится на основании:""• прогнозируемых остатков товаров;""• ожидаемых поступлений и потреблений;""• минимального и максимального уровня запасов;""• детализации до заказов – источников поступления и потребления товаров.""""Сервис доступен в разделах:""• Закупки – Планирование – Расчет потребностей;""• Производство - Планирование - Расчет потребностей.'; ka = 'ჩართვა იძლევა ამა თუ იმ საქონელში ფირმის მოთხოვნილებების (დეფიციტის) გამოთვლის საშუალებას.""""გამოთვლის საფუძველს წარმოადგენს:""• საქონლების პროგნოზირებადი ნაშთი;""• მოსალოდნელი შემოსვლები და მოხმარებები;""• მარაგების მინიმალური და მაქსიმალური დონე;""• შეკვეთებამდე - საქონლის შემოსვლის და მოხმარების წყაროებამდე დეტალიზაცია.""""სერვისი ხელმისაწვდომია შემდეგ ნაწილებში:""• შესყიდვები – დაგეგმვა – მოთხოვნილებების გამოთვლა;""• წარმოება - დაგეგმვა - მოთხოვნილებების გამოთვლა.'; en = 'Allows you to calculate the firm''s needs (deficit) in certain goods. """" The calculation is made on the basis of: ""• projected stock balances;"" • expected receipts and consumption; ""• minimum and maximum inventory levels;"" • detailing to orders - sources of receipts and consumption of goods. """" The service is available in the following sections: ""• Procurement - Planning - Calculation of needs;"" • Production - Planning - Calculation of requirements.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='შეკვეთა მომწოდებელს';ru='Заказ поставщику';en='Supplier Order'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьСервисЗакупкаТоваров",
		"Закупки",
		НСтр("ka='საქონლის შესყიდვა (დაგეგმვა)';ru='Закупка товаров (планирование)';en='Purchase of goods (planning)'"),
		НСтр("ka='ჩართვა იძლევა მომწოდებლებისთვის შეკვეთების ავტომატურად შედგენის საშუალებას, გასული პერიოდის მანძილზე გაყიდვის სტატისტიკის საფუძველზე საქონლის მოთხოვნილებების გამოთვლით."
""
"სერვისი ხელმისაწვდომია შემდეგ ნაწილში შესყიდვები - დაგეგმვა - საქონლების შესყიდვა.';ru='Включение позволяет формировать заказы поставщикам автоматически, рассчитывая потребности товаров на основании статистики продаж за прошлый период."
""
"Сервис доступен в разделе Закупки – Планирование – Закупка товаров.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='შეკვეთა მომწოდებელს,ნომენკლატურა,შესყიდვის დოკუმენტები';ru='Заказ поставщику,Номенклатура,Документы по закупкам';en='Purchase Orders, Inventory, Procurement Documents'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "СрокОплатыПоставщику";
	НоваяНастройка.Раздел			= "Закупки";
	НоваяНастройка.Представление	= НСтр("ka='მომწოდებელთან ანგარიშსწორების ვადა (დღე)';ru='Срок оплаты поставщику (в сутках)';en='Term of payment to the supplier (in days)'");
	НоваяНастройка.Описание			= НСтр("ru='Срок отсрочки платежа поставщику. Указывается в сутках. "
""
"Данное значение устанавливается при создании нового договора с контрагентом. А также используется для определения даты оплаты при планировании платежей.';ka='Срок отсрочки платежа поставщику. Указывается в сутках. "
""
"Данное значение устанавливается при создании нового договора с контрагентом. А также используется для определения даты оплаты при планировании платежей.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Число");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаРегулирования", Истина);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 6);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='შეკვეთა მომწოდებელს,ხელშეკრულებები,კონტრაგენტები,ანგარიშსწორებების საწყისი ნაშთი,საწყისი ნაშტების შეყვანა';ru='Заказ поставщику,Договоры,Контрагенты,Начальные остатки расчетов,Ввод начальных остатков';en='Purchase Orders, Contracts, Accounts, opening balance calculations Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"СрокиГодности",
		"Закупки",
		НСтр("ka='ვარგისიანობის ვადა';ru='Сроки годности';en='shelf life'"),
		НСтр("ka='ჩვენ ვვარაუდობთ საქონლების ვარგისიანობის ვადების მიხედვით აღრიცხვის რეალიზაციას. თუ თქვენ, ეს გჭირდებათ - დააყენეთ ალამი და აღწერეთ ვარგისიანობის შეზღუდული ვადის მქონე საქონლებთან მუშაობის თქვენი სცენარი. დამატებითი ინფორმაცია იმის შესახებ, თუ როგორ ხდება ეს თქვენთან - ჩვენ დაგვეხმარება იმაში, რომ სწორედ ისე გავაკეთოთ, როგორც გჭირდებათ!';ru='Мы предполагаем реализацию учета по срокам годности товаров. Если вам это нужно - поставьте флаг и опишите ваш сценарий работы с товарами, которые имеют ограниченный срок годности. Дополнительная информация о том, как это происходит именно у вас - поможет нам сделать именно так, как нужно вам!';en=""We expect the implementation of accounting for the product's life. If you need it - put a flag and describe your script to work with products that have a limited shelf life. For more information about how this happens is you - will help us to do exactly as you need!""")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='შესყიდვების დოკუმენტები';ru='Документы по закупкам';en='Procurement documents'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"Аналоги",
		"Закупки",
		НСтр("ka='ნომენკლატურის ანალოგები';ru='Аналоги номенклатуры';en='analogs nomenclature'"),
		НСтр("ka='Удобный учет, подбор и поиск номенклатуры с аналогичными свойствами';ru='Удобный учет, подбор и поиск номенклатуры с аналогичными свойствами';en='Convenient registration, selection and search nomenclatures with similar properties'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='ნომენკლატურის ანალოგები,შერჩევა';ru='Аналоги номенклатуры,Подбор';en='Analogs nomenclature Selection'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьПодсистемуРаботы",
		"Работы",
		НСтр("ka='სამუშაოების შესრულება და მომსახურებების გაწევა';ru='Выполнение работ и оказание услуг';en='Execution of works and provision of services'"),
		НСтр("ka='ახდენს ნაწილ ""სამუშაოები""-ს ჩართვას სამუშაოების შესასრულებლად და მომსახურებების გასაწევად."
""
"შესაძლებლობები ხელმისაწვდომია ნაწილ ""სამუშაოები""-ში არსებულ დოკუმენტ ""სერვისის დოკუმენტი''-ში.';ru='Включает раздел ""Работы"" для выполнения работ и оказания услуг."
""
"Возможности доступны в документе ""Заказ-наряд"" в разделе ""Работы"".'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='შესრულებული სამუშაოების აქტი,სამუშაო დავალება,ნომენკლატურა,მყიდველის შეკვეთა';ru='Акт выполненных работ,Задание на работу,Номенклатура,Заказ покупателя';en='Certificate of completion, work Assignment, Nomenclature, Order of the buyer'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьВидыЗаказНарядов",
		"Работы",
		НСтр("ka='სერვისის დოკუმენტების სახეობები';ru='Виды заказ-нарядов';en='Types of purchase orders'"),
		НСтр("ru='Включение позволяет создавать несколько наборов состояний заказов и фиксировать их взаимный порядок. Набор состояний и их взаимный порядок указываются в виде заказа. Вид заказ выбирается непосредственно в документе Заказ-наряд."
"Использование видов заказов позволяет вести индивидуальные воронки продаж.';ka='Включение позволяет создавать несколько наборов состояний заказов и фиксировать их взаимный порядок. Набор состояний и их взаимный порядок указываются в виде заказа. Вид заказ выбирается непосредственно в документе Заказ-наряд."
"Использование видов заказов позволяет вести индивидуальные воронки продаж.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуРаботы";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуРаботы";
	НоваяНастройка.Теги = НСтр("ka='სერვისის დოკუმენტი,ბიზნეს-პროცესი, გაყიდვების ძაბრი';ru='Заказ-наряд,Бизнес-процесс,Воронка продаж';en='Work Order, Business Process, Sales Funnel'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьСправочникВидыЗаказНарядов",
		"Работы",
		НСтр("ka='Список видов заказ-нарядов';ru='Список видов заказ-нарядов';en='List of types of work orders'"),
		НСтр("ru=''"),
		"e1cib/list/Справочник.ВидыЗаказНарядов"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуРаботы";
	НоваяНастройка.Зависимости = "ИспользоватьВидыЗаказНарядов";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьРемонты2",
		"Работы",
		НСтр("ru = 'Приемка и передача в ремонт'; ka = 'რემონტის გამოყენება 2'; en = 'Acceptance and transmission repair'"),
		НСтр("ru = 'Включение позволяет принимать проданные товары от покупателей по претензии, учитывать их ремонт или передачу в сервисный центр для ремонта.""""ВАЖНО!""Для идентификации возвращенных товаров в ремонте используются серийные номера, поэтому для использования данной возможности рекомендуется включить опцию ""Серийные номера"" в разделе ""Закупки"".""""Учет запасов в ремонте ведется отдельно от товаров в продаже.'; ka = 'კონსტანტის ჩართვა უფლებას გვაძლებს მივიღოთ გაყიდული საქონელი მყიდველისგან პრეტენზიის საფუძველზე, გავითვალისწინოთ ის რემონტში ან გადავცეთ სერვის ცენტს რემონტისთვის. ""მნიშვნელოვანია"" დაბრუნებული საქონლის იდენტიფიკაციისთვის გამოიყენება სერიული ნომრები, ამიტომ ამ ფუქნციონალის გამოყენებისთვის რეკომედირებულია ჩაირთოს სერიული ნომრების გამოყენების ფუქნციონალი შესყიდვების ქვესისტემიდან. რემონტში არსებული მარაგების აღრიცხვა ხდება გაყიდული მარაგებიდან გამოყოფით'; en = 'Enabling allows you to accept sold goods from buyers on a claim, take into account their repair or transfer to a service center for repair. """" IMPORTANT! ""Serial numbers are used to identify returned goods for repair, therefore, to use this feature, it is recommended to enable the"" Serial numbers ""option in the section Purchases. Inventories in repair are kept separately from goods on sale.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуРаботы";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуРаботы";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьПодсистемуПроизводство",
		"Производство",
		НСтр("ka='სამეწარმეო საქმიანობის დაგეგმვა და აღრიცხვა';ru='Планирование и учет производственной деятельности';en='Planning and accounting of production activities'"),
		НСтр("ka='მოიცავს ნაწილ ""წარმოება""-ს პროდუქციის გამოშვების აღრიცხვის, საწარმოო დაგეგმვის და კონტროლის მიზნით.';ru='Включает раздел ""Производство"" для учета выпуска продукции, производственного планирования и контроля.';en='It includes a section ""Production"" to account for output, production planning and control.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='ნომენკლატურა,მყიდველის შეკვეთა,საქონლის საწყისი ნაშთი,საწყისი ნაშთების შეყვანა';ru='Номенклатура,Заказ покупателя,Начальные остатки товаров,Ввод начальных остатков';en='Nomenclature, Order of the buyer, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьТехоперации",
		"Производство",
		НСтр("ka='ტექნოლოგიური ოპერაციები';ru='Технологические операции';en='technological operations'"),
		НСтр("ka='ჩართვის მეშვეობით შესაძლებელია:"
"• ნაწარმის დამზადების და სანარდო განწესების სპეციფიკაციებში ტექნოლოგიური ოპერაციების გამოყენება;"
"• სანარდო განწესების მიხედვით თანამშრომლებისთვის ხელფასის დარიცხვა; "
"• ტიპ ""ოპერაცია""-თი ნომენკლატურის შეყვანა."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='Включение позволяет:"
"• использовать технологические операции в спецификациях изготовления изделий и сдельных нарядов;"
"• начислять зарплату сотрудникам по сдельным нарядам; "
"• вводить номенклатуру с типом ""Операция""."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуПроизводство";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуПроизводство";
	НоваяНастройка.Теги = НСтр("ka='ნომენკლატურა';ru='Номенклатура';en='Nomenclature'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПереработкаДавальческогоСырья",
		"Производство",
		НСтр("ka='მიმცემის ნედლეულის გადამუშავება';ru='Переработка давальческого сырья';en='Tolling'"),
		НСтр("ka='ჩართვა იძლევა გარეშე კონტრაგენტებისგან გადასამუშავებლად მარაგების მიღების წარმოების საშუალებას."
""
"მნიშვნელოვანია!"
"იმისთვის, რომ საკუთარი მარაგები გავარჩიოთ გადასამუშავებლად მიღებული მარაგებისგან, გამოიყენება აღრიცხვის დამატებითი ჭრილი - ""ნომენკლატურის პარტიები"". ამიტომ, მოცემული შესაძლებლობის გამოსაყენებლად, აუცილებელია ნაწილ ""შესყიდვები""-ში არსებული ოპცია ""ნომენკლატურის პარტიები""-ს ჩართვა."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='Включение позволяет вести прием запасов на переработку от сторонних контрагентов."
""
"ВАЖНО!"
"Для отличия собственных запасов от запасов, принятых на переработку, используется дополнительный разрез учета - ""Партии номенклатуры"". Поэтому для использования данной возможности необходимо включить опцию ""Партии номенклатуры"" в разделе ""Закупки""."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуПроизводство";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуПроизводство,ФункциональнаяОпцияИспользоватьПартии";
	НоваяНастройка.Теги = НСтр("ru='Номенклатура,Начальные остатки товаров,Ввод начальных остатков';en='Nomenclature, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"УчетМерныхИзделий",
		"Производство",
		НСтр("ka='გასაზომი პროდუქტების აღრიცხვა';ru='Учет мерных изделий';en='Accounting dimensional products'"),
		НСтр("ka='გამოიყენება მაშინ, როდესაც აუცილებელია სხვადასხვა ზომის ერთი და იგივე საქონლის ნატეხი აღრიცხვის წარმოება. იმისთვის, რომ ანგარიშგებებში ასახული იქნას ჯამი გრძივ მეტრებში/კვადრატულ მეტრებში/კუბურ მეტრებში, მაგრამ ამასთან ერთად, გასაგები იყოს ის, თუ როგორი ზ';ru='Используется, когда необходимо вести кусковой учет одного и того же товара разных размеров. Чтобы в отчетах отображался итог в метрах погонных/метрах квадратных/метрах кубических, но при этом было понятно из кусков каких размеров этот остаток образовался.';en='It is used when it is necessary to conduct lump records of the same product in different sizes. The report shows that total in running meters / square meters / cubic meters, but it was clear from the pieces of any size, this balance was.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуПроизводство";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяУчетВалютныхОпераций",
		"Деньги",
		НСтр("ka='რამდენიმე ვალუტა';ru='Несколько валют';en='multiple currencies'"),
		НСтр("ka='ჩართვა იძლევა დოკუმენტების შევსებისას სხვადასხვა ვალუტის მითითების საშუალებას.';ru='Включение позволяет указывать различные валюты при заполнении документов.';en='Enabling allows you to specify various currencies in completing the documents.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Банковские счета,Договоры,Авансовый отчет,Акт выполненных работ,Заказ покупателя,Заказ поставщику,Корректировка поступления,Корректировка реализации,Операция по платежным картам,Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Приходная накладная,Расходная накладная,Счет на оплату,Документы по банку,Документы по кассе,Начальные остатки денег,Начальные остатки расчетов,Ввод начальных остатков';ru='Банковские счета,Договоры,Авансовый отчет,Акт выполненных работ,Заказ покупателя,Заказ поставщику,Корректировка поступления,Корректировка реализации,Операция по платежным картам,Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Приходная накладная,Расходная накладная,Счет на оплату,Документы по банку,Документы по кассе,Начальные остатки денег,Начальные остатки расчетов,Ввод начальных остатков';en=""Bank accounts, contracts, expense reports, Contract, Buyer's order, orders to suppliers, income adjustment, adjustment realization, operation of payment cards, expense from the account to the account, a cash income, expenses from the cash register, Purchase Invoice, Sales Invoice the Invoice, bank documents, office documents, the carrying amounts of money, the opening balance calculations Entering opening balances""");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "НациональнаяВалюта";
	НоваяНастройка.Раздел			= "Деньги";
	НоваяНастройка.Представление	= НСтр("ka='ეროვნული ვალუტა';ru='Национальная валюта';en='National Currency'");
	НоваяНастройка.Описание			= НСтр("ka='თქვენი ქვეყნის ეროვნული ვალუტა."
""
"მაგალითად, საქართველოს ეროვნულ ვალუტას წარმოადგენს ლარი.';ru='Национальная валюта вашей страны."
""
"Например, для России национальной валютой являются рубли.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("СправочникСсылка.Валюты");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 20);
	НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаОткрытия", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("БыстрыйВыбор", Ложь);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ФункциональнаяУчетВалютныхОпераций";
	НоваяНастройка.Теги = НСтр("ka='Платежное поручение,Банковские счета,Документы по банку,Документы по кассе,Начальные остатки денег,Начальные остатки прочее,Начальные остатки расчетов,Ввод начальных остатков';ru='Платежное поручение,Банковские счета,Документы по банку,Документы по кассе,Начальные остатки денег,Начальные остатки прочее,Начальные остатки расчетов,Ввод начальных остатков';en='Money Order, Bank accounts, bank documents, office documents, the carrying amounts of money, the opening balance etc., the opening balance calculations Entering opening balances'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ВалютаУчета";
	НоваяНастройка.Раздел			= "Деньги";
	НоваяНастройка.Представление	= НСтр("ka='აღრიცხვის ვალუტა';ru='Валюта учета';en='currency account'");
	НоваяНастройка.Описание			= НСтр("ka='აღრიცხვის ვალუტა პროგრამაში ძირითად ვალუტას წარმოადგენს. "
""
"ყველა ფულადი ოპერაცია ორ ვალუტაში აისახება:"
"• დოკუმენტში მითითებულ ვალუტაში;"
"• აღრიცხვის ვალუტაში."
""
"მნიშვნელოვანია!"
"აღრიცხვის ვალუტის შეცვლა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='Валюта учета является основной валютой в программе. "
""
"Все денежные операции отражаются в двух валютах:"
"• в валюте указанной в документе;"
"• в валюте учета."
""
"ВАЖНО!"
"Изменить валюту учета нельзя после начала работы в программе.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("СправочникСсылка.Валюты");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 20);
	НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаОткрытия", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("БыстрыйВыбор", Ложь);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ФункциональнаяУчетВалютныхОпераций";
	НоваяНастройка.Теги = НСтр("ka='Заказ покупателя,Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Приходная накладная,Расходная накладная,Акт выполненных работ,Платежное поручение,Счет на оплату,Заказ поставщику,Банковские счета,Документы по банку,Документы по кассе,Начальные остатки денег,Начальные остатки прочее,Начальные остатки расчетов,Ввод начальных остатков';ru='Заказ покупателя,Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Приходная накладная,Расходная накладная,Акт выполненных работ,Платежное поручение,Счет на оплату,Заказ поставщику,Банковские счета,Документы по банку,Документы по кассе,Начальные остатки денег,Начальные остатки прочее,Начальные остатки расчетов,Ввод начальных остатков';en='The order of the buyer, the costs from the account to the account, a cash income, expenses from the cash register, Purchase Invoice, Sales Invoice, Certificate of Completion, Money Order, Invoice on the payment order to the supplier, bank accounts, documents bank documents on hand, the carrying amounts of money, opening balances etc., opening balances calculations Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияПлатежныйКалендарь",
		"Деньги",
		НСтр("ka='გადახდების კალენდარი';ru='Платежный календарь';en='Payment schedule'"),
		НСтр("ka='ჩართვა იძლევა საგადახდო კალენდრის წარმოების საშუალებას."
""
"საგადახდო კალენდარი წარმოადგენს ფულადი სახსრების ხარჯვის, შემოსვლის და გადაადგილების ოპერატიული დაგეგმვის ინსტრუმენტს.';ru='Включение позволяет вести платежный календарь."
""
"Платежный календарь является инструментом для оперативного планирования расхода, поступления и перемещения денежных средств.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='მყიდველის შეკვეთა,ოპერაცია საგადახდო ბარათების მიხედვით,ფულის გადაადგილება,სალაროში შემოსვლა,ანგარიშზე შემოსვლა,სალაროდან გასავალი,ანგარიშიდან გასავალი,გადასახდელი ანგარიში,გადასახდელი ანგარიში (მიღებული),დოკუმენტები ბანკის თაობაზე,დოკუმენტები გაყიდვის თაობაზე,დოკუმენტები სალაროს თაობაზე';ru='Заказ покупателя,Заказ поставщику,Операция по платежным картам,Перемещение денег,Поступление в кассу,Поступление на счет,Расход из кассы,Расход со счета,Счет на оплату,Счет на оплату (полученный),Документы по банку,Документы по продажам,Документы по кассе';en=""Buyer's order, the order to the supplier, the operations on payment cards, move money, receipts in cash, to the account, the costs of cash, expense account, account for payment, Invoice for payment (receipt), Documents on the bank Documents Sales Documents at the box office""");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьСтатьиДвиженияДенежныхСредств",
		"Деньги",
		НСтр("ka='ფულადი სახსრების მოძრაობის მუხლები';ru='Статьи движения денежных средств (ДДС)';en='Articles of cash flows (DDS)'"),
		НСтр("ka='ჩართვა იძლევა ფულადი სახსრების მოძრაობის ჭრილში აღრიცხვის წარმოების საშუალებას.';ru='Включение позволяет вести учет в разрезе статей движения денежных средств.';en='Enabling allows accounting by items of cash flow.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='საბანკო ანგარიშები,სალაროში შემოსვლა,ანგარიშზე შემოსვლა,სალაროდან გასავალი,ანგარიშიდან გასავალი,ბანკის დოკუმენტები,სალაროს დოკუმენტები,ფულის საწყისი ნაშთი,საწყისი ნაშთების შეყვანა';ru='Банковские счета,Поступление в кассу,Поступление на счет,Расход из кассы,Расход со счета,Документы по банку,Документы по кассе,Начальные остатки денег,Ввод начальных остатков';en='Bank accounts, income in cash, to the account, the costs of cash, expense account, bank documents, office documents, the carrying amounts of money Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером",
		"Деньги",
		НСтр("ka='აღრიცხვა ეკვაირინგი – ბანკით';ru='Расчеты с банком-эквайрером';en='Calculations with the acquiring bank'"),
		НСтр("ka='ჩართვა იძლევა ეკვაირერ ბანკთან ანგარიშსწორებების წარმოების, დავალიანების ნაშთის გაკონტროლების, ასევე, ოპერაცია ""ეკვაირერის ანგარიშგება""-ს მქონე დოკუმენტ ""ანგარიშზე შემოსვლა""-ს და ""ანგარიშიდან გასავალი""-ს გაფორმების საშუალებას.';ru='Включение позволяет вести расчеты с банком-эквайрером, контролировать остаток задолженности, а также оформлять документы ""Поступление на счет"" и ""Расход со счета"" с операцией ""Отчет эквайрера"".';en='Enabling allows payments to acquiring bank, to control the balance of debt, as well as the paperwork ""to the account"" and ""flow from the account"" with the operation of the ""Report acquirer.""'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Платежное поручение,Контрагенты,Банковские счета,Поступление на счет,Расход со счета,Начальные остатки расчетов,Ввод начальных остатков';en='Money Order, Accounts, Bank Accounts, to the account, expense account, the opening balance calculations Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям",
		"Деньги",
		НСтр("ka='გადახდის წარმოება ეკვაირინგის ოპერაციებით';ru='Разносить оплату по эквайринговым операциям';en='Spread the payment for acquiring operations'"),
		НСтр("ka='ჩართვა იძლევა ცალკეული ეკვაირინგის ოპერაციების მიხედვით ეკვაირერი ბანკისგან გადახდების ჩამორიგების საშუალებას. აგრეთვე, ეკვაირინგის მიხედვით ხარჯების მყიდველთა შეკვეთებზე მიკუთვნების საშუალებას."
""
"შესაძლებლობის ჩართვა ავტომატურად ხდება, შემოსავლების და ხარჯების აღრიცხვის სალარო მეთოდის გამოყენებისას.';ru='Включение позволяет разносить оплаты от банка-эквайрера по отдельным эквайринговым операциям. А также относить расходы по эквайрингу на заказы покупателей."
""
"Возможность включается автоматически при использовании кассового метода учета доходов и расходов.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером";
	НоваяНастройка.Теги = НСтр("ka='შემთხვევა(მოვლენა) , საკონტაქტო პირები';ru='Событие,Контактные лица';en='Event Contacts'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
	"ФункциональнаяОпцияИспользоватьОплатуКартамиВОптовойТорговле",
	"Деньги",
	НСтр("ka='ბარათით გადახდა საბითუმო ვაჭრობაში';ru='Оплата картами в оптовой торговле';en='Payment cards in the wholesale trade'"),
	НСтр("ru='Включение позволяет оформлять оплату картами в оптовой торговле на основании следующих документов:"
""
"• Акт выполненных работ;"
"• Счет на оплату;"
"• Заказ покупателя;"
"• Заказ-наряд;"
"• Расходная накладная;"
"• Продажа имущества;"
"• Прием и передача в ремонт.';ka='Включение позволяет оформлять оплату картами в оптовой торговле на основании следующих документов:"
""
"• Акт выполненных работ;"
"• Счет на оплату;"
"• Заказ покупателя;"
"• Заказ-наряд;"
"• Расходная накладная;"
"• Продажа имущества;"
"• Прием и передача в ремонт.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;

	////-------------------------- // Россофт // --->
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
	"ИспользоватьЗагрузкуИзБанка",
	"Деньги",
	НСтр("ka='ბანკიდან ჩატვირთვის გამოყენება';ru='Использовать загрузку из банка';en='Use loading from the bank'"),
	НСтр("ru='Включение позволяет оформлять банковские документы по помощнику загрузки банковской выписки';en='Enabling allows to issue bank documents for download assistant bank statement'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	////-------------------------- //Россофт  // <---
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияКредитыИЗаймы",
		"Деньги",
		НСтр("ka='სესხები და კრედიტები';ru='Займы и кредиты';en='Loans and credits'"),
		НСтр("ka='ჩართვა იძლევა გარეშე კონტრაგენტებისგან მიღებული კრედიტების მიხედვით ანგარიშსწორებების წარმოების საშუალებას. ასევე, თანამშრომლებისთვის გაცემული სესხების მიხედვით.';ru='Включение позволяет вести расчеты по кредитам, полученным от сторонних контрагентов. А также по займам, выданным сотрудникам.';en='Enabling allows payments on loans obtained from third-party suppliers. And for loans to employees.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები,თანამშრომლები,სალაროში შემოსვლა,ანგარიშზე შემოსვლა,სალაროდან გასავალი,ანგარიშიდან გასავალი';ru='Контрагенты,Сотрудники,Поступление в кассу,Поступление на счет,Расход из кассы,Расход со счета';en='Contractors, employees, income in cash, to the account, the costs of cash, expense account'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ЧастотаРасчетаКурсовыхРазниц";
	НоваяНастройка.Раздел			= "Деньги";
	НоваяНастройка.Представление	= НСтр("ka='კურსის სხვაობების გაანგარიშება';ru='Расчет курсовых разниц';en='Calculation of exchange rate differences'");
	НоваяНастройка.Описание			= НСтр("ka='კურსითი სხვაობების გამოთვლის სიხშირის გამართვა:"
""
"• ოპერაციების შესრულების მომენტში. კურსითი სხვაობები გამოთვლილი იქნება ყოველი ოპერაციის ჩატარებისას. მოცემული ოპციის ჩართვას შეუძლია გაზარდოს დოკუმენტების გატარების დრო. "
""
"• კალენდარული თვის დახურვისას. ყოველი ოპერაციის კურსითი სხვაობები გამოთვლილი იქნება კალენდარული თვის დახურვის მომენტში.';ru='Настройка частоты расчета курсовых разниц:"
""
"• В момент выполнения операций. Курсовые разницы будут рассчитываться при совершении каждой операции. Включение данной опции может увеличить время проведения документов. "
""
"• При закрытии месяца. Курсовые разницы по каждой операции будут рассчитываться в момент закрытия месяца.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("ПеречислениеСсылка.ЧастотаРасчетаКурсовыхРазниц");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	МетаданныеПеречисления = Метаданные.НайтиПоТипу(Тип("ПеречислениеСсылка.ЧастотаРасчетаКурсовыхРазниц"));
	Если МетаданныеПеречисления <> Неопределено Тогда
		НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
		Для Каждого МетаданныеЗначения Из МетаданныеПеречисления.ЗначенияПеречисления Цикл
			НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(Перечисления[МетаданныеПеречисления.Имя][МетаданныеЗначения.Имя], МетаданныеЗначения.Синоним);
		КонецЦикла;
	КонецЕсли;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ФункциональнаяУчетВалютныхОпераций";
	НоваяНастройка.Теги = НСтр("ka='Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Платежное поручение,Документы по банку,Документы по кассе,Начальные остатки денег,Ввод начальных остатков';ru='Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Платежное поручение,Документы по банку,Документы по кассе,Начальные остатки денег,Ввод начальных остатков';en='Flow from the account to the account, a cash income, cash flow from, Money Order, bank documents, office documents, the carrying amounts of money Entering opening balances'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ЗачитыватьАвансыДолгиАвтоматически";
	НоваяНастройка.Раздел			= "Деньги";
	НоваяНастройка.Представление	= НСтр("ka='ავანსების ავტოჩათვლა:';ru='Автозачет авансов';en='Avtozachet advances'");
	НоваяНастройка.Описание			= НСтр("ka='ავანსების და ვალების ავტომატური ჩათვლის გამართვა დოკუმენტების გატარებისას:"
""
"• დიახ. დოკუმენტის ჩაწერის წინ განხორციელდება ავანსის ან ვალის ავტომატური ჩათვლის მცდელობა. "
""
"• არა. დოკუმენტებში ავანსების და ვალების გატარება საჭირო იქნება ხელით.';ru='Настройка автоматического зачета авансов и долгов при проведении документов:"
""
"• Да. Перед записью документа будет произведена попытка автоматического зачета аванса или долга. "
""
"• Нет. Авансы и долги в документах необходимо будет разносить вручную.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("ПеречислениеСсылка.ДаНет");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	МетаданныеПеречисления = Метаданные.НайтиПоТипу(Тип("ПеречислениеСсылка.ДаНет"));
	Если МетаданныеПеречисления <> Неопределено Тогда
		НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
		Для Каждого МетаданныеЗначения Из МетаданныеПеречисления.ЗначенияПеречисления Цикл
			НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(Перечисления[МетаданныеПеречисления.Имя][МетаданныеЗначения.Имя], МетаданныеЗначения.Синоним);
		КонецЦикла;
	КонецЕсли;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='მყიდველის შეკვეთა,ანგარიშიდან გასავალი,ანგარიშზე შემოსვლა,სალაროში შემოსვლა,სალაროდან გასავალი,შესრულებული სამუშაოების აქტი,საგადახდო დავალება,კონტრაგენტები';ru='Заказ покупателя,Расход со счета,Поступление на счет,Поступление в кассу,Расход из кассы,Акт выполненных работ,Платежное поручение,Контрагенты';en=""Buyer's order flow from the account to the account, a cash income, expenses from the cash register, Certificate of Completion, Money Order, Accounts""");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ПереводыВПути",
		"Деньги",
		НСтр("ka='გადარიცხვები გზაში';ru='Переводы в пути';en='Transfers in the way'"),
		НСтр("ru='Перемещение денежных средств на другой счет организации, взнос, снятие наличных с расчетного счета в банке отражается с использованием 57 счета ""Переводы в пути"". Это необходимо в том случае, если есть задержка во времени между снятием и внесением денежных средств. Для отражения таких операций используются следующие пары документов:"
"- Перемещение из кассы на банковский счет (взнос наличными в банк). Отражается документом ""Расход из кассы"" и документом ""Поступление на счет""."
"- Перемещение с банковского счета в кассу (снятие наличных в кассу). Отражается документом ""Поступление в кассу и документом ""Расход со счета""."
"- Перемещение между банковскими счетами организации. Отражается документом ""Расход со счета"" и документом ""Поступление на счет"".';ka='Перемещение денежных средств на другой счет организации, взнос, снятие наличных с расчетного счета в банке отражается с использованием 57 счета ""Переводы в пути"". Это необходимо в том случае, если есть задержка во времени между снятием и внесением денежных средств. Для отражения таких операций используются следующие пары документов:"
"- Перемещение из кассы на банковский счет (взнос наличными в банк). Отражается документом ""Расход из кассы"" и документом ""Поступление на счет""."
"- Перемещение с банковского счета в кассу (снятие наличных в кассу). Отражается документом ""Поступление в кассу и документом ""Расход со счета""."
"- Перемещение между банковскими счетами организации. Отражается документом ""Расход со счета"" и документом ""Поступление на счет"".'"),
		"e1cib/list/РегистрСведений.ПрименениеПереводовВПути"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='Расход со счета,Расход из кассы,Поступление в кассу,Поступление на счет,Перемещение денег';ru='Расход со счета,Расход из кассы,Поступление в кассу,Поступление на счет,Перемещение денег';en='Expense account, flow from the cash register, receipt in cash, to the account, move money'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьПодсистемуЗарплата",
		"Зарплата",
		НСтр("ka='ქვესისტემა ხელფასი-ს გამოყენება';ru='Управление персоналом, начисление зарплаты';en='personnel management, payroll'"),
		НСтр("ka='მოიცავს ნაწილ ""ხელფასს"" თანამშრომლების შესახებ ინფორმაციის აღრიცხვის, მათი სამუშაო დროის აღრიცხვის, ხელფასის დარიცხვის და გადახდის მიზნით.';ru='Включает раздел ""Зарплата"" для учета сведений о сотрудниках, учета их рабочего времени, начисления и выплаты зарплаты.';en='It includes a section ""salary"" to account for the details of the employees, regardless of their working time, calculation and payment of salaries.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='სამუშაო დავალება,თანამშრომლები,ანგარიშსწორებების საწყისი ნაშთი,საწყისი ნაშთების შეყვანა';ru='Задание на работу,Сотрудники,Начальные остатки расчетов,Ввод начальных остатков';en='work assignment, staff, opening balance calculations Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияВестиШтатноеРасписание",
		"Зарплата",
		НСтр("ka='საშტატო განრიგი';ru='Штатное расписание';en='staff list'"),
		НСтр("ka='ჩართვა იძლევა საშტატო განრიგის წარმოების საშუალებას."
""
"სამუშაოზე თანამშრომლების მიღებისას განხორციელდება ვაკანტური განაკვეთების არსებობის შემოწმება.';ru='Включение позволяет вести штатное расписание."
""
"При приеме сотрудников на работу будет осуществляться проверка наличия вакантных ставок.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
	НоваяНастройка.Теги = НСтр("ka='საკადრო გადანაცვლება, სამუშაოზე მიღება';ru='Кадровое перемещение,Прием на работу';en='Personnel movement Recruitment'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьСовместительство",
		"Зарплата",
		НСтр("ka='შეთავსება';ru='Совместительство';en='moonlighting'"),
		НСтр("ka='ჩართვა იძლევა თანამშრომლის რამდენიმე თანამდებობაზე მიღების საშუალებას."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='Включение позволяет принимать сотрудника на несколько должностей."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
	НоваяНастройка.Теги = НСтр("ka='Сотрудники,Задание на работу';ru='Сотрудники,Задание на работу';en='Employees who work on Task'");
	
	//Паганини_
	//1.
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ОбязательностьИННФизЛица",
		"Зарплата",
		НСтр("ka='ფიზიკური პირის საიდენტიფიკაციო ნომრის აუცილებლობა';ru='Обязательность ИНН физического лица';en='Obligation INN natural person'"),
		НСтр("ka='ჩართვით აუცილებელი ხდება ფიზიკური პირის საიდენტიფიკაციო ნომრის შევსება."
			""
			"მნიშვნელოვანია!"
			"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='При включении обязательным становится заполнение ИНН физического лица."
			""
			"ВАЖНО!"
			"Возможность нельзя отключить после начала работы в программе.'")
			);
	НоваяНастройка.ОбновлятьИнтерфейс	= Истина;
	НоваяНастройка.ПравоРедактирования	= РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС 				= "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
	НоваяНастройка.Зависимости 			= "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
	НоваяНастройка.Теги					= НСтр("ka='Сотрудники,Задание на работу';ru='Сотрудники,Задание на работу';en='Employees who work on Task'");
	//2.
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении",
		"Зарплата",
		НСтр("ka='კონტრაგენტზე გადასახდელი თანხების წილი გადასახადების გადასახდელში გადატანა დარიცხვისას';ru='Суммы налогов удержание для контрагента к оплате при начислении';en='Amounts of tax deduction to the counterparty for payment when calculating'"),
		НСтр("ka='ჩართვის შემდეგ, ხელფასის დარიცხვისას კონტრაგენტზე გადასახდელი თანხების წილი გადასახადები გადადის გადასახდელში."
			""
			"მნიშვნელოვანია!"
			"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='При включении константы, после начислении зарплаты суммы налогов удержание для контрагента переходит к оплате."
			""
			"ВАЖНО!"
			"Возможность нельзя отключить после начала работы в программе.'")
			);
	НоваяНастройка.ОбновлятьИнтерфейс	= Истина;
	НоваяНастройка.ПравоРедактирования	= РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС 				= "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
	НоваяНастройка.Зависимости 			= "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
	НоваяНастройка.Теги					= НСтр("ka='Сотрудники,Задание на работу';ru='Сотрудники,Задание на работу';en='Employees who work on Task'");
	//_Паганини
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов",
		"Зарплата",
		НСтр("ka='ფპსგ და შენატანები';ru='НДФЛ и взносы';en='Personal income tax and contributions'"),
		НСтр("ka='ჩართვა იძლევა საშემოსავლო გადასახადის და იმ ორგანიზაციების მიხედვით შენატანების გამოთვლის საშუალებას, რომლებიც მაკონტროლებელ ორგანოებში აყალიბებენ რეგლამენტირებულ ანგარიშგებულობას."
""
"მნიშვნელოვანია!"
"შესაძლებლობის გამორთვა არ შეიძლება პროგრამაში მუშაობის დაწყების შემდეგ.';ru='Включение позволяет рассчитывать налог на доходы и взносы по организациям, которые формируют регламентированную отчетность в контролирующие органы."
""
"ВАЖНО!"
"Возможность нельзя отключить после начала работы в программе.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата";
	НоваяНастройка.Теги = НСтр("ka='საკადრო გადაადგილება,ხელფასის დარიცხვა,სამუშაოზე მიღება';ru='Кадровое перемещение,Начисление зарплаты,Прием на работу';en='Personnel changes, wages, salaries, Recruitment'");
	
	
	//Малышев 2025-12-25 ES4001-121 ((--
	//ФункциональнаяОпцияИспользыватьБезвозмезднуюПродажуСотрудникам
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользыватьБезвозмезднуюПродажуСотрудникам",
		"Зарплата",
		НСтр("ka='უფასო გაყიდვები თანამშრომლებისთვის';
				|ru='Безвозмездная продажа сотрудникам';
				|en='Free sales to employees'"),
		НСтр("ka='';
				|ru='';
				|en=''")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='სამუშაო დავალება,თანამშრომლები,ანგარიშსწორებების საწყისი ნაშთი,საწყისი ნაშთების შეყვანა უფასო გაყიდვები თანამშრომლებისთვის';
								|ru='Задание на работу,Сотрудники,Начальные остатки расчетов,Ввод начальных остатков, Безвозмездная продажа';
								|en='work assignment, staff, opening balance calculations Entering opening balances, Free sales'");
    //Малышев 2025-12-25 ES4001-121 --)

	
	
	
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"МоиУчетныеЗаписи",
		"ПочтаSMS",
		НСтр("ka='ჩემი სააღრიცხვო ჩანაწერები';ru='Мои учетные записи';en='My accounts'"),
		НСтр("ka='ფოსტის გადმოტვირთვის ჩართვა და გამორთვა აღნიშნული სააღრიცხვო ჩანაწერებისთვის.';ru='Включение и отключение загрузки почты для указанных учетных записей.';en='Enable or disable email upload for these accounts.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Теги = НСтр("ka='შემთხვევა(მოვლენა) , საკონტაქტო პირები';ru='Событие,Контактные лица';en='Event Contacts'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ОтправлятьСлепыеКопииПисем",
		"ПочтаSMS",
		НСтр("ka='გამომავალი მეილების ასლების გაგზავნა';ru='Отправлять копии исходящих писем';en='Send a copy of outgoing emails'"),
		НСтр("ka='ჩართვა იძლევა ელექტრონული ფოსტის მისამართის მითითების საშუალებას, რომელზეც პროგრამის მიმდინარე მომხმარებლისთვის გაიგზავნება გამავალი წერილების ასლები.';ru='Включение позволяет указать адрес электронной почты, на который будут отправляться копии исходящих писем для текущего пользователя программы.';en='Enabling allows you to specify the email address that will receive copies of outgoing messages for the current user of the program.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Теги = НСтр("ka='შემთხვევა(მოვლენა) , საკონტაქტო პირები';ru='Событие,Контактные лица';en='Event Contacts'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "АдресПолучателяСкрытойКопии";
	НоваяНастройка.Раздел			= "ПочтаSMS";
	НоваяНастройка.Представление	= НСтр("ka='მისამართზე';ru='на адрес';en='address'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 30);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПодсказкаВвода", "my_mail@example.org");
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.ВместеС = "ОтправлятьСлепыеКопииПисем";
	НоваяНастройка.Зависимости = "ОтправлятьСлепыеКопииПисем";
	НоваяНастройка.Теги = НСтр("ka='შემთხვევა(მოვლენა) , საკონტაქტო პირები';ru='Событие,Контактные лица';en='Event Contacts'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкаПодписиНовыхСообщений",
		"ПочтаSMS",
		НСтр("ka='ხელმოწერის გამართვა ახალი შეტყობინებებისთვის';ru='Настройка подписи для новых сообщений';en='Setting a signature for new messages'"),
		НСтр("ka='Подпись подставляется автоматически в текст исходящего письма.';ru='Подпись подставляется автоматически в текст исходящего письма.';en='Text is entered automatically into the text of outgoing messages.'"),
		"e1cib/command/Обработка.НастройкаПрограммы.Команда.НастройкаПодписиПочты"
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Теги = НСтр("ka='შემთხვევა(მოვლენა) , საკონტაქტო პირები';ru='Событие,Контактные лица';en='Event Contacts'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ИмяОтправителяSMS";
	НоваяНастройка.Раздел			= "ПочтаSMS";
	НоваяНастройка.Представление	= НСтр("ka='SMS-ის გამგზავნის სახელი';ru='Имя отправителя SMS';en='SMS sender name'");
	НоваяНастройка.Описание			= НСтр("ka='SMS-ის გამგზავნის სახელი, რომელიც სტანდარტულად იქნება გამოყენებული SMS შეტყობინებების გაგზავნისას."
""
"გამგზავნის სახელი არის ტექსტი, რომელსაც ბოლო მიმღები იმ ნომრის ნაცვლად იხილავს, საიდანაც განხორციელდა SMS-ის გაგზავნა.';ru='Имя отправителя SMS, которое будет использоваться по умолчанию при отправке SMS сообщений."
""
"Имя отправителя – это текст, который увидит конечный получатель вместо номера, с которого осуществлялась отправка SMS.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 30);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Теги = НСтр("ka='შემთხვევა(მოვლენა) , საკონტაქტო პირები';ru='Событие,Контактные лица';en='Event Contacts'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ПерсональноеМобильноеУстройство";
	НоваяНастройка.Раздел			= "Телефония";
	НоваяНастройка.Представление	= НСтр("ka='მობილური მოწყობილობა';ru='Мобильное устройство';en='Mobile device'");
	НоваяНастройка.Описание			= НСтр("ka='მობილური მოწყობილება, რომელიც იქნება გამოყენებული ზარების სინქრონიზაციიცას.';ru='Мобильное устройство, которое будет использоваться при синхронизации звонков.';en='The mobile device to be used when synchronizing rings.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("ПланОбменаСсылка.МобильноеПриложение");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.ОтображатьСнизу);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 30);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Теги = НСтр("ka='Событие,CRM';ru='Событие,CRM';en='Event, CRM'");
	
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ЗагрузкаКонтактовGoogle",
			"ОбменСGoogle",
			НСтр("ka='კონტაქტების ჩატვირთვა';ru='Загрузка контактов';en='Loading contacts'"),
			НСтр("ka='ჩართვა იძლევა ახალი კონტრაგენტების შეყვანის და Google-ის თქვენი სამისამართო წიგნის მონაცემებიდან კონტრაგენტების საკონტაქტო ინფორმაციის შევსების საშუალებას."
""
"შესაძლებლობა ხელმისაწვდომია იმ დოკუმენტებში, სადაც არის კონტრაგენტის მისათითებელი ველი.';ru='Включение позволяет вводить новых контрагентов и заполнять их контактную информацию из данных вашей адресной книги Google."
""
"Возможность доступна в документах, где есть поле для указания контрагента.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.Теги = НСтр("ka='შემთხვევა, კონტრაგენტები,საკონტაქტო პირები ';ru='Событие,Контрагенты,Контактные лица';en='Event, Accounts, Contacts'");
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ЗагрузитьКонтактыGoogle",
			"ОбменСGoogle",
			НСтр("ka='კონტაქტების ჩატვირთვა';ru='Загрузить контакты';en='Download contacts'"),
			НСтр("ka='ბრძანება ასრულებს Google-ის სამისამართო წიგნიდან კონტაქტების ჩატვირთვას.';ru='Команда выполняет загрузку контактов из адресной книги Google.';en='The team performs load contacts from your Google address book.'"),
			"e1cib/command/Обработка.ОбменСGoogle.Команда.ЗагрузитьКонтактыGoogle"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "ЗагрузкаКонтактовGoogle";
		НоваяНастройка.Зависимости = "ЗагрузкаКонтактовGoogle";
		НоваяНастройка.Теги = НСтр("ka='შემთხვევა, კონტრაგენტები,საკონტაქტო პირები ';ru='Событие,Контрагенты,Контактные лица';en='Event, Accounts, Contacts'");
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"СинхронизацияКалендаряGoogle",
			"ОбменСGoogle",
			НСтр("ka='კალენდრის სინქრონიზაცია';ru='Синхронизация календаря';en='Synchronize your calendar'"),
			НСтр("ru='При включении будет выполняться автоматическая двусторонняя синхронизация событий в программе с календарем Google.
		|
		|Созданные в программе события с типами ""Телефонный звонок"", ""Личная встреча"" и ""Прочее"" будут передаваться в календарь Google. Добавленные записи календаря в Google будут также отображаться в 1С:УНФ.
		|
		|Синхронизация происходит только по тем событиям, в которых указан календарь сотрудника с включенным признаком ""Синхронизировать с Google"".'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.Теги = НСтр("ka='შემთხვევა(მოვლენა) , საკონტაქტო პირები';ru='Событие,Контактные лица';en='Event Contacts'");
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"СинхронизироватьКалендарьGoogle",
			"ОбменСGoogle",
			НСтр("ka='კალენდრის სინქრონიზირება';ru='Синхронизировать календарь';en='synchronize calendar'"),
			НСтр("ru='Команда выполняет синхронизацию событий"
"из календаря сотрудника с календарем Google.';ka='ბრძანება ახდენს თანამშრომლის კალენდრიდან Google-ის კალენდართან მოვლენების სინქრონიზაციას.'"),
			"e1cib/command/Обработка.ОбменСGoogle.Команда.СинхронизироватьКалендарьGoogle"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "СинхронизацияКалендаряGoogle";
		НоваяНастройка.Зависимости = "СинхронизацияКалендаряGoogle";
		НоваяНастройка.Теги = НСтр("ka='შემთხვევა(მოვლენა) , საკონტაქტო პირები';ru='Событие,Контактные лица';en='Event Contacts'");
	КонецЕсли;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ИдентификацияПриложенияGoogle";
	НоваяНастройка.Раздел			= "ОбменСGoogle";
	НоваяНастройка.Представление	= НСтр("ka='Google-ის დანართის იდენტიფიკაცია';ru='Идентификация приложения Google';en='Identification of Google applications'");
	НоваяНастройка.Описание			= НСтр("ka='თქვენი პროექტისთვის https://console.developers.google.com/project-იდან ჩასვით იდენტიფიკატორი';ru='Вставьте идентификатор из https://console.developers.google.com/project для вашего проекта';en='Insert the ID of https://console.developers.google.com/project for your project'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.ОтображатьСнизу);
	НоваяНастройка.СвойстваЭлемента.Вставить("МногострочныйРежим", Истина);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПодсказкаВвода", "{""web"":{""auth_uri"":""https://accounts.google.com/o/oauth2/auth"",""client_secret"":""...");
	НоваяНастройка.СвойстваЭлемента.Вставить("МаксимальнаяШирина", 70);
	НоваяНастройка.СвойстваЭлемента.Вставить("АвтоМаксимальнаяШирина", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("МаксимальнаяВысота", 7);
	НоваяНастройка.СвойстваЭлемента.Вставить("АвтоМаксимальнаяВысота", Ложь);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторСистемы И Не ОбщегоНазначения.ИспользованиеРазделителяСеанса();
	НоваяНастройка.Теги = НСтр("ka='მოვლენა';ru='Событие';en='Event'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"РабочийКаталогПечати",
		"ПерсональныеПараметрыПечати",
		НСтр("ka='ამობეჭდვის სამუშაო კატალოგის გამართვა';ru='Настройка рабочего каталога печати';en='Customize your print catalog'"),
		НСтр("ru='Указывается каталог на вашем персональном компьютере, в котором временно хранятся файлы, полученные из информационной базы для просмотра или редактирования. Настройка действует для печати в веб-клиенте.';en='Specifies the directory on your personal computer, which temporarily stores files received from an information database for viewing or editing. This setting is effective for printing from the Web client.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"СписокПрисоединенныхФайлов",
		"РаботаСФайлами",
		НСтр("ka='ფაილების საცავი';ru='Хранилище файлов';en='file Storage'"),
		НСтр("ru='Общие файлы для информационной базы (не присоединенные к объектам).';en='Common files for information base (not attached to the objects).'"),
		"e1cib/command/Справочник.Файлы.Команда.Файлы"
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"СписокРедактируемыхФайлов",
		"РаботаСФайлами",
		НСтр("ka='რედაქტირებადი ფაილები';ru='Редактируемые файлы';en='editable files'"),
		НСтр("ka='ყველა მიუერთებელი ფაილი, რომლებიც მომხმარებლების მიერ რედაქტირებისთვის არის დაკავებული.';ru='Все не присоединенные файлы, занятые пользователями для редактирования.';en='All attached files are not employed by users for editing.'"),
		"e1cib/command/Справочник.Файлы.Команда.РедактируемыеФайлы"
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ПоказыватьЗанятыеФайлыПриЗавершенииРаботы",
		"РаботаСФайлами",
		НСтр("ka='დაკავებული ფაილების ჩვენება მუშაობის დასრულებისას';ru='Показывать занятые файлы при завершении работы';en='Show busy files on shutdown'"),
		НСтр("ka='Перед завершением работы выводить окно с занятыми файлами. Появление сообщения исключает вопрос ""При завершении программы"".';ru='Перед завершением работы выводить окно с занятыми файлами. Появление сообщения исключает вопрос ""При завершении программы"".';en='Before shutting down output window engaged files. Posts preclude the emergence of the question, ""At the end of the program.""'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"СпрашиватьРежимРедактированияПриОткрытииФайла",
		"РаботаСФайлами",
		НСтр("ka='გახსნის რეჟიმის არჩევა ფაილის არჩევისას';ru='Выбор режима открытия при выборе файла';en='Choosing open mode when you select a file'"),
		НСтр("ka='თუ ფაილი უკვე დაკავებულია რედაქტირებისთვის, მაშინ არ მკითხო, ეგრევე გავხსნათ/ავირჩიოთ. ოპციას აზრი აქვს მხოლოდ ფაილის არჩევის რეჟიმში.';ru='Если файл уже занят для редактирования, то не спрашивать, а  сразу открывать/выбирать. Опция имеет смысл только в режиме выбора файла.';en='If the file is already in use for editing, do not ask, and immediately open / select. The option makes sense only in the file selection mode.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	Если РежимРаботы.ЭтоВебКлиент Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ПоказыватьПодсказкиПриРедактированииФайлов",
			"РаботаСФайлами",
			НСтр("ka='Подсказки при редактировании';ru='Подсказки при редактировании';en='when editing tips'"),
			НСтр("ka='კარნახების გამოტანა მიერთებული ფაილის რედაქტირებისას.';ru='Выводить подсказки при редактировании присоединенного файла.';en='Show tips on editing the attached file.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ДействиеСФайламиПоДвойномуЩелчкуМыши";
	НоваяНастройка.Раздел			= "РаботаСФайлами";
	НоваяНастройка.Представление	= НСтр("ka='მოქმედება ფაილზე ორმაგი დაწკაპუნებით';ru='Действие по двойному щелчку на файле';en='Action by double-clicking on the file'");
	НоваяНастройка.Описание			= НСтр("ka='მოქმედება, რომელიც მიერთებულ ფაილზე ორმაგი დაწკაპუნებისას მოხდება.';ru='Действие, которое будет происходить по двойному щелчку на присоединенном файле.';en='An action that will occur by double clicking on the attached file.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("ПеречислениеСсылка.ДействияСФайламиПоДвойномуЩелчку");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	МетаданныеПеречисления = Метаданные.НайтиПоТипу(Тип("ПеречислениеСсылка.ДействияСФайламиПоДвойномуЩелчку"));
	Если МетаданныеПеречисления <> Неопределено Тогда
		НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
		Для Каждого МетаданныеЗначения Из МетаданныеПеречисления.ЗначенияПеречисления Цикл
			НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(Перечисления[МетаданныеПеречисления.Имя][МетаданныеЗначения.Имя], МетаданныеЗначения.Синоним);
		КонецЦикла;
	КонецЕсли;
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "СпособСравненияВерсийФайлов";
	НоваяНастройка.Раздел			= "РаботаСФайлами";
	НоваяНастройка.Представление	= НСтр("ka='ფაილების ვერსიის შედარების მეთოდი';ru='Способ сравнения версий файлов';en='Way to compare versions of files'");
	НоваяНастройка.Описание			= НСтр("ka='Укажите программу, которая будет использоваться при сравнении файлов следующих типов: ""ODT, DOC, RTF, TXT"".';ru='Укажите программу, которая будет использоваться при сравнении файлов следующих типов: ""ODT, DOC, RTF, TXT"".';en='Specify the program that will be used when you compare files of the following types: ""ODT, DOC, RTF, TXT"".'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("ПеречислениеСсылка.СпособыСравненияВерсийФайлов");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	МетаданныеПеречисления = Метаданные.НайтиПоТипу(Тип("ПеречислениеСсылка.СпособыСравненияВерсийФайлов"));
	Если МетаданныеПеречисления <> Неопределено Тогда
		НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
		Для Каждого МетаданныеЗначения Из МетаданныеПеречисления.ЗначенияПеречисления Цикл
			НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(Перечисления[МетаданныеПеречисления.Имя][МетаданныеЗначения.Имя], МетаданныеЗначения.Синоним);
		КонецЦикла;
	КонецЕсли;
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"НастройкаСканирования",
		"РаботаСФайлами",
		НСтр("ka='სკანირების გასწორება';ru='Настройка сканирования';en='Setting scan'"),
		НСтр("ru='Программа позволяет хранить файлы, полученные напрямую со сканера. Для работы со сканером в программе необходимо произвести настройку сканирования."
""
"Перед выполнением настроек к компьютеру необходимо подключить сканер, при этом в зависимости от возможностей подключенного сканера будут доступны те или иные параметры.';ka='Программа позволяет хранить файлы, полученные напрямую со сканера. Для работы со сканером в программе необходимо произвести настройку сканирования."
""
"Перед выполнением настроек к компьютеру необходимо подключить сканер, при этом в зависимости от возможностей подключенного сканера будут доступны те или иные параметры.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"НастройкаРабочегоКаталогаФайлов",
		"РаботаСФайлами",
		НСтр("ka='ძირითადი სამუშაო კატალოგის გასწორება';ru='Настройка основного рабочего каталога';en='Setting the main working directory'"),
		НСтр("ka='ბრძანებაზე გაიხსნება მენიუ, რომელიც განკუთვნილია კატალოგის გამართვების დასაყენებლად თქვენს პერსონალურ კომპიუტერზე, სადაც დროებით იქნება შენახული საინფორმაციო ბაზიდან სანახავად ან რედაქტირებისთვის მიღებული ფაილები.';ru='Команда открывает меню, предназначенное для установки настроек каталога на вашем персональном компьютере, в котором временно будут храниться файлы, полученные из информационной базы для просмотра или редактирования.';en='The command opens a menu for setting the directory settings on your personal computer, in which temporary files will be stored, derived from the knowledge base for viewing or editing.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	Если РежимРаботы.ЭтоВебКлиент Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"УстановкаРасширенияРаботыСФайлами",
			"РаботаСФайлами",
			НСтр("ka='ფაილებთან მუშაობის გაფართოების დაყენება';ru='Установить расширение работы с файлами';en='Install the extension to work with files'"),
			НСтр("ka='ზოგიერთი ოპერაციის შესასრულებლად ბრაუზერში (ვებ-კლიენტში) საჭიროა ფაილებთან მუშაობის გაფართოების დაყენება და შეერთება.';ru='Для выполнения некоторых операций в браузере (веб-клиенте) требуется установка и подключение расширения работы с файлами.';en='To perform certain operations in the browser (web client) requires the installation and connection of expansion work with files.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"НастройкаЭлектроннойПодписиИШифрования",
		"РаботаСФайлами",
		НСтр("ka='ელექტრონული ხელმოწერის და დაშიფრვის გამართვა';ru='Настройка электронной подписи и шифрования';en='Setting up an electronic signature and encryption'"),
		НСтр("ru='Управление персональными настройками электронной подписи и шифрования.';en='personal settings of electronic signatures and encryption management.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	Если РежимРаботы.ЭтоВебКлиент Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"УстановитьРасширениеРаботыСКриптографией",
			"РаботаСФайлами",
			НСтр("ka='კრიპტოგრაფიასთან მუშაობის გაფართოების დაყენება';ru='Установить расширение работы с криптографией';en='Install the extension work with cryptography'"),
			НСтр("ka='ბრაუზერში (ვებ-კლიენტში) ზოგიერთი ოპერაციის შესასრულებლად საჭიროა კრიპტოგრაფიასთან მუშაობის გაფართოების დაყენება და შეერთება.';ru='Для выполнения некоторых операций в браузере (веб-клиенте) требуется установка и подключение расширения работы с криптографией.';en='To perform certain operations in the browser (web client) requires the installation and connection of expansion work with cryptography.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"СведенияОПользователе",
		"Прочее",
		НСтр("ka='ცნობები მომხმარებლის შესახებ';ru='Сведения о пользователе';en='User Information'"),
		НСтр("ka='Открыть сведения (логин, пароль, права доступа и другие) о текущем пользователе программы.';ru='Открыть сведения (логин, пароль, права доступа и другие) о текущем пользователе программы.';en='Open information (login, password, access rights, etc.) about the current user of the program.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ПолнотекстовыйПоиск",
		"Прочее",
		НСтр("ka='სრულტექტიანი ძებნა მონაცემებში';ru='Полнотекстовый поиск в данных';en='Full-text search in data'"),
		НСтр("ka='Полнотекстовый поиск данных позволяет находить любые сведения не только по полям карточек, но и по содержимому присоединенных файлов.';ru='Полнотекстовый поиск данных позволяет находить любые сведения не только по полям карточек, но и по содержимому присоединенных файлов.';en='Full-text search data enables us to find any information on the card not only the fields, but also the contents of attachments.'"),
		"e1cib/app/Обработка.ПолнотекстовыйПоискВДанных"
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользуютсяПрофилиБезопасности") Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"НастройкаДоступаКПрокси",
			"Прочее",
			НСтр("ka='პროქსი-სერვერთან წვდომის გამართვა';ru='Настроить доступ к прокси-серверу';en='Configure access to the proxy server'"),
			НСтр("ka='Персональные настройки входа в интернет с использованием прокси-сервера.';ru='Персональные настройки входа в интернет с использованием прокси-сервера.';en='Individual input settings in the Internet using a proxy server.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторПрограммы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ПодключениеИНастройкаОборудования",
			"Прочее",
			НСтр("ka='მოწყობილობის შეერთება და გასწორება';ru='Подключение и настройка оборудования';en='Connecting and setting up equipment'"),
			НСтр("ru='Работа с подключаемым оборудованием и управление рабочим местом."
""
"Настройка доступна при использовании подключаемого оборудования (Администрирование - Подключаемое оборудование - Использовать подключаемое оборудование).';ka='Работа с подключаемым оборудованием и управление рабочим местом."
""
"Настройка доступна при использовании подключаемого оборудования (Администрирование - Подключаемое оборудование - Использовать подключаемое оборудование).'"),
			"e1cib/command/Справочник.ПодключаемоеОборудование.Команда.ОткрытьПодключаемоеОборудование"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование";
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ПодтверждениеПриЗавершенииПрограммы",
		"Прочее",
		НСтр("ka='დადასტურება პროგრამის დასრულებისას';ru='Подтверждение при завершении программы';en='Confirmation at the end of the program'"),
		НСтр("ka='Показывать окно с подтверждением при закрытии программы';ru='Показывать окно с подтверждением при закрытии программы';en='Show confirmation window when closing the program'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	Если Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ИспользоватьСинхронизациюДанных",
			"Программы1СПредприятие",
			НСтр("ka='მონაცემთა სინქრონიზაცია';ru='Синхронизация данных';en='data synchronization'"),
			НСтр("ka='ჩართვა იძლევა 1C:საწარმოს პროგრამებთან სინქრონიზაციის გამოყენების საშუალებას.';ru='Включение позволяет использовать синхронизацию с программами 1С:Предприятие.';en='Inclusion can be used to synchronize with programs 1C: Enterprise.'")
		);
		НоваяНастройка.ОбновлятьИнтерфейс = Истина;
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.Теги = НСтр("ka='ხელშეკრულებები,საწყისი ნაშთების შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Договоры,Ввод начальных остатков,Начальные остатки организации';en='Contracts Entering opening balances, initial organization of the remains'");
	КонецЕсли;
	
	////-------------------------- // Россофт // --->
	//НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
	//"НастройкаСинхронизацииДанных",
	//"ИнтеграцияСНалоговойСлужбойГрузии",
	//НСтр("ka='Интеграция с налоговой службой грузии rs.ge';ru='Интеграция с налоговой службой грузии rs.ge';en='Integration with the Internal Revenue Service of Georgia rs.ge'"),
	//НСтр("ka='Интеграция с налоговой службой грузии rs.ge';ru='Интеграция с налоговой службой грузии rs.ge';en='Integration with the Internal Revenue Service of Georgia rs.ge'")
	//);
	////-------------------------- //Россофт  // <---
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"НастройкаСинхронизацииДанных",
		"Программы1СПредприятие",
		НСтр("ka='მონაცემთა სინქრონიზაციის გამართვა';ru='Настройка синхронизации данных';en='Setting Data Synchronization'"),
		НСтр("ka='მონაცემთა სინქრონიზაციის გამართვა და შესრულება.';ru='Настройка и выполнение синхронизации данных.';en='Setting up and executing data synchronization.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Зависимости = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"РезультатыСинхронизацииДанных",
		"Программы1СПредприятие",
		НСтр("ka='გაფრთხილება მონაცემთა სინქრონიზაციის დროს';ru='Предупреждения при синхронизации данных';en='Cards synchronization data'"),
		НСтр("ru='Просмотр потенциально ошибочных ситуаций, требующих ручного исправления:"
"• непроведенные документы;"
"• незаполненные реквизиты;"
"• конфликты;"
"• документы, непринятые по дате запрета.';ka='Просмотр потенциально ошибочных ситуаций, требующих ручного исправления:"
"• непроведенные документы;"
"• незаполненные реквизиты;"
"• конфликты;"
"• документы, непринятые по дате запрета.'"),
		"e1cib/list/РегистрСведений.РезультатыОбменаДанными"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Зависимости = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьДатыЗапретаЗагрузки",
		"Программы1СПредприятие",
		НСтр("ka='გასული პერიოდების მონაცემთა ჩატვირთვის აკრძალვა';ru='Запрещать загружать данные прошлых периодов';en='Do not upload historical data'"),
		НСтр("ka='სხვა პროგრამებიდან გასული პერიოდის მონაცემთა ჩატვირთვის აკრძალვა.';ru='Запрет загрузки данных прошлых периодов из других программ.';en='Ban download historical data from other programs.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Зависимости = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ДатыЗапретаЗагрузкиДанных",
		"Программы1СПредприятие",
		НСтр("ka='მონაცემთა ჩატვირთვის აკრძალვის თარიღები';ru='Даты запрета загрузки данных';en='Dates ban downloading data'"),
		НСтр("ka='სხვა პროგრამებიდან გასული პერიოდის მონაცემთა ჩატვირთვის აკრძალვა.';ru='Запрет загрузки данных прошлых периодов из других программ.';en='Ban download historical data from other programs.'"),
		"e1cib/command/РегистрСведений.ДатыЗапретаИзменения.Команда.ДатыЗапретаЗагрузкиДанных"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Зависимости = "ИспользоватьДатыЗапретаЗагрузки,ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	
	Если Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "ПрефиксУзлаРаспределеннойИнформационнойБазы";
		НоваяНастройка.Раздел			= "Программы1СПредприятие";
		НоваяНастройка.Представление	= НСтр("ka='ბაზის პრეფიქსი';ru='Префикс базы';en='prefix database'");
		НоваяНастройка.Описание			= НСтр("ka='პრეფიქსი ავტომატურად ემატება ცნობარების ელემენტების კოდებს და დოკუმენტების ნომრებს იმისათვის, რომ განვასხვავოთ, თუ რომელ პროგრამაში იქნა ისინი შეყვანილი და თავიდან ავიცილოთ მონაცემთა დუბლირება.';ru='Префикс добавляется автоматически к кодам элементов справочников и номерам документов для того, чтобы различать программы, в которых они были введены, и избежать дублирования данных.';en='The prefix is ​​automatically added to the Directory element codes and numbers of documents in order to distinguish between the programs in which they were entered, and to avoid duplication of data.'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
		НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 4);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
		НоваяНастройка.Зависимости = "ИспользоватьСинхронизациюДанных";
		НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	КонецЕсли;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "КонтрольДоговоровПриПроведенииДокументов";
	НоваяНастройка.Раздел			= "Программы1СПредприятие";
	НоваяНастройка.Представление	= НСтр("ka='ხელშეკრულებების კონტროლი';ru='Контроль договоров';en='control treaties'");
	НоваяНастройка.Описание			= НСтр("ru='При проведении документов, у которых договор контрагента не соответствует операции документа:"
"• Только предупреждать. Выдается сообщение о несоответствии договора, но документ проводится."
"• Не проводить. Выдается сообщение о несоответствии договора и документ не проводится."
""
"ВАЖНО!"
"Контроль договоров контрагентов выполняется только при настроенной синхронизации данных с программой ""1С: Бухгалтерия предприятия"".';ka='При проведении документов, у которых договор контрагента не соответствует операции документа:"
"• Только предупреждать. Выдается сообщение о несоответствии договора, но документ проводится."
"• Не проводить. Выдается сообщение о несоответствии договора и документ не проводится."
""
"ВАЖНО!"
"Контроль договоров контрагентов выполняется только при настроенной синхронизации данных с программой ""1С: Бухгалтерия предприятия"".'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Число");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(0, НСтр("ka='გავატაროთ';ru='Предупреждать';en='Warn'"));
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(1, НСтр("ka='არ გავატაროთ';ru='Не проводить';en='not hold'"));
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Зависимости = "ИспользоватьСинхронизациюДанных";
	НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	
	Если РежимРаботы.КлиентСерверный И РежимРаботы.ЭтоАдминистраторСистемы И Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "КаталогСообщенийОбменаДаннымиДляWindows";
		НоваяНастройка.Раздел			= "Программы1СПредприятие";
		НоваяНастройка.Представление	= НСтр("ka='მონაცემთა გაცვლის შეტყობინებების კატალოგი საოპერაციო სისტემა Windows-ისთვის';ru='Каталог сообщений обмена данными для ОС Windows';en='Catalog of data communication messages for Windows'");
		НоваяНастройка.Описание			= НСтр("ka='Путь к единому сетевому каталогу для общих временных файлов серверов 1С:Предприятие, работающих в одном кластере.';ru='Путь к единому сетевому каталогу для общих временных файлов серверов 1С:Предприятие, работающих в одном кластере.';en='The path to a common network directory for general temporary file server 1C: Enterprise, operating in the same cluster.'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
		НоваяНастройка.Зависимости = "ИспользоватьСинхронизациюДанных";
		НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	КонецЕсли;
	
	Если РежимРаботы.КлиентСерверный И РежимРаботы.ЭтоАдминистраторСистемы И Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "КаталогСообщенийОбменаДаннымиДляLinux";
		НоваяНастройка.Раздел			= "Программы1СПредприятие";
		НоваяНастройка.Представление	= НСтр("ka='მონაცემთა გაცვლის შეტყობინებების კატალოგი საოპერაციო სისტემა Linux-ისთვის';ru='Каталог сообщений обмена данными для ОС Linux';en='Catalog of data communication messages for Linux'");
		НоваяНастройка.Описание			= НСтр("ka='Путь к единому сетевому каталогу для общих временных файлов серверов 1С:Предприятие, работающих в одном кластере.';ru='Путь к единому сетевому каталогу для общих временных файлов серверов 1С:Предприятие, работающих в одном кластере.';en='The path to a common network directory for general temporary file server 1C: Enterprise, operating in the same cluster.'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьСинхронизациюДанных";
		НоваяНастройка.Зависимости = "ИспользоватьСинхронизациюДанных";
		НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	КонецЕсли;
	
	Если РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ИнформацияСинхронизацияБП",
			"Программы1СПредприятие",
			НСтр("ka='დეტალურად ""1C:Бухгалтерия"" თან სინქრონიზაციის შესახებ';ru='Подробнее о синхронизации с ""1C:Бухгалтерия""';en='Learn more about syncing with ""1C: Accounting""'"),
			НСтр("ru=''"),
			"https://1cfresh.com/articles/obmen"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	КонецЕсли;
	
	Если РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ИнформацияСинхронизацияОП",
			"Программы1СПредприятие",
			НСтр("ka='Подробнее о синхронизации с ""1С:Отчетность предпринимателя""';ru='Подробнее о синхронизации с ""1С:Отчетность предпринимателя""';en='Learn more about syncing with ""1C: Accounting Entrepreneur""'"),
			НСтр("ru=''"),
			"https://1cfresh.com/articles/op_unf"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"СинхронизацияСМобильнымПриложением",
		"СинхронизацияСМобильнымПриложением",
		НСтр("ka='როგორ მოვახდინოთ მობილური დანართის შეერთება';ru='Как подключить мобильное приложение';en='How to connect a mobile application'"),
		НСтр("ka='ინფორმაცია მობილური დანართის შეერთების შესახებ, და სინქრონიზაციის შესრულება';ru='Информация о подключении мобильного приложения, и выполнение синхронизации';en='Information about mobile application connects, and execute synchronization'"),
		"e1cib/command/ПланОбмена.МобильноеПриложение.Команда.ОткрытьМобильноеПриложение"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкаМеханизмаСинхронизацииМобильноеПриложение",
		"СинхронизацияСМобильнымПриложением",
		НСтр("ka='დაწვრილებით მობილურ აპლიკაციასთან სინქრონიზაციაზე';ru='Подробнее о синхронизации с мобильным приложением';en='Learn more about syncing with mobile app'"),
		НСтр("ru=''"),
		"http://sbm.1c.ru/about/nastroyka-mekhanizma-sinkhronizatsii/"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьОбменССайтами",
		"ОбменССайтом",
		НСтр("ka='საიტთან გაცვლა';ru='Обмен с сайтом';en='Exchange with the site'"),
		НСтр("ka='ჩართვა იძლევა საიტებთან სინქრონიზაციის შესრულების საშუალებას.';ru='Включение позволяет выполнять синхронизацию с сайтами.';en='Inclusion enables you to synchronize the sites.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкаОбменаССайтами",
		"ОбменССайтом",
		НСтр("ka='საიტთან გაცვლის სახელწოდება';ru='Настройка обмена с сайтом';en='Setting up the site sharing'"),
		НСтр("ka='გამართვა და საიტთან გაცვლის შესრულება.';ru='Настройка и выполнение обмена с сайтом.';en='Setting up and implementation of the site sharing.'"),
		"e1cib/list/ПланОбмена.ОбменУправлениеНебольшойФирмойСайт"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьОбменССайтами";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьОбменССайтами";
	НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ПрефиксДляОбменаССайтом";
	НоваяНастройка.Раздел			= "ОбменССайтом";
	НоваяНастройка.Представление	= НСтр("ka='პრეფიქსი საიტთან გასაცვლელად';ru='Префикс для обмена с сайтом';en='Prefix to the site exchange'");
	НоваяНастройка.Описание			= НСтр("ka='Префикс автоматически добавляется к номерам заказов покупателей загруженных с сайта для того, чтобы отделить их от заказов, созданных в информационной базе и избежать дублирования данных.';ru='Префикс автоматически добавляется к номерам заказов покупателей загруженных с сайта для того, чтобы отделить их от заказов, созданных в информационной базе и избежать дублирования данных.';en='The prefix is ​​automatically added to the numbers of customer orders downloaded from the site in order to separate them from the orders created in the information database and avoid data duplication.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 4);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьОбменССайтами";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьОбменССайтами";
	НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	
	Если РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ИнформацияОбменССайтом",
			"ОбменССайтом",
			НСтр("ka='დეტალურად საიტთან გაცვლის შესახებ';ru='Подробнее о настройке и возможностях обмена с сайтом';en='Learn more about setting up and sharing capabilities with a site'"),
			НСтр("ru=''"),
			"https://1cfresh.com/articles/unf_site"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.Теги = НСтр("ka='საწყისი ნაშთის შეყვანა,ორგანიზაციის საწყისი ნაშთები';ru='Ввод начальных остатков,Начальные остатки организации';en='Entering opening balances, initial organization of the remains'");
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкиЯндексДоставки",
		"ЯндексДоставка",
		НСтр("ka='Настройки Яндекс.Доставки';ru='Настройки Яндекс.Доставки';en='Yandeks.Dostavki settings'"),
		НСтр("ru=''"),
		"e1cib/list/Справочник.НастройкиЯндексДоставки"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='მიწოდება';ru='Доставка';en='Delivery'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьОбменЭД",
		"ОбменСКонтрагентами",
		НСтр("ka='ელექტრონული დოკუმენტების გაცვლა კონტრაგენტებთან';ru='Обмен электронными документами с контрагентами';en='Exchange of electronic documents with contractors'"),
		НСтр("ka='ჩართვა იძლევა გარეშე კონტრაგენტებთან და საკუთარ ორგანიზაციებს შორის ელექტრონული დოკუმენტების გაცვლის საშუალებას.';ru='Включение позволяет обмениваться электронными документами со сторонними контрагентами и между собственными организациями.';en='Enabling allows the exchange of electronic documents with third parties and between their organizations.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები,გასავლის ზედნადები';ru='Контрагенты,Расходная накладная';en='Contractors, Sales Invoice'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ТиповыеСоглашенияОбИспользованииЭД",
		"ОбменСКонтрагентами",
		НСтр("ka='აწყობების პროფილები ედბ';ru='Профили настроек ЭДО';en='Profiles EDM settings'"),
		НСтр("ka='ორგანიზაციის პროფილების გამართვა ელექტრონული დოკუმენტების გასაცვლელად.';ru='Настройка профилей организации для обмена электронными документами.';en='Setting the profile of the organization for the exchange of electronic documents.'"),
		"e1cib/list/Справочник.ПрофилиНастроекЭДО"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьОбменЭД";
	НоваяНастройка.Зависимости = "ИспользоватьОбменЭД";
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"СоглашенияОбИспользованииЭД",
		"ОбменСКонтрагентами",
		НСтр("ka='ედბ-ს აწყობები';ru='Настройки ЭДО';en='EDM settings'"),
		НСтр("ru=''"),
		"e1cib/list/Справочник.СоглашенияОбИспользованииЭД"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьОбменЭД";
	НоваяНастройка.Зависимости = "ИспользоватьОбменЭД";
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	
	Если Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"АвтоматическаяОтправкаЭД",
			"ОбменСКонтрагентами",
			НСтр("ka='ელექტრონული დოკუმენტების ავტომატური გაგზავნა';ru='Автоматическая отправка электронных документов';en='Automatic sending of electronic documents'"),
			НСтр("ka='ჩართული ოფციის პირობებში ელექტრონული დოკუმენტები ავტომატურად გაიგზავნება მითითებული განრიგით';ru='При включенной опции будет происходить автоматическая отправка электронных документов по указанному расписанию.';en='If the option will be automatically send electronic documents to the specified schedule.'")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьОбменЭД";
		НоваяНастройка.Зависимости = "ИспользоватьОбменЭД";
		НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	КонецЕсли;
	
	Если Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "ОтправкаОформленныхЭДРасписание";
		НоваяНастройка.Раздел			= "ОбменСКонтрагентами";
		НоваяНастройка.Представление	= НСтр("ka='განრიგი';ru='Расписание';en='schedule'");
		НоваяНастройка.ТипЭлемента		= Тип("ДекорацияФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидДекорацииФормы.Надпись);
		НоваяНастройка.СвойстваЭлемента.Вставить("Гиперссылка", Истина);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьОбменЭД";
		НоваяНастройка.Зависимости = "АвтоматическаяОтправкаЭД,ИспользоватьОбменЭД";
		НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	КонецЕсли;
	
	Если Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"АвтоматическоеПолучениеЭД",
			"ОбменСКонтрагентами",
			НСтр("ka='ელექტრონული დოკუმენტების ავტომატური მიღება';ru='Автоматическое получение электронных документов';en='Automatic receipt of electronic documents'"),
			НСтр("ka='ჩართული ოფციის პირობებში ელექტრონული დოკუმენტების მიღება მოხდება ავტომატურად  მითითებული განრიგის მიხედვით';ru='При включенной опции будет происходить автоматическое получение электронных документов по указанному расписанию.';en='If the option will be automatically acquire electronic documents to the specified schedule.'")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьОбменЭД";
		НоваяНастройка.Зависимости = "ИспользоватьОбменЭД";
		НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	КонецЕсли;
	
	Если Не РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "ПолучениеНовыхЭДРасписание";
		НоваяНастройка.Раздел			= "ОбменСКонтрагентами";
		НоваяНастройка.Представление	= НСтр("ka='განრიგი';ru='Расписание';en='schedule'");
		НоваяНастройка.ТипЭлемента		= Тип("ДекорацияФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидДекорацииФормы.Надпись);
		НоваяНастройка.СвойстваЭлемента.Вставить("Гиперссылка", Истина);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьОбменЭД";
		НоваяНастройка.Зависимости = "ИспользоватьОбменЭД,АвтоматическоеПолучениеЭД";
		НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьОтложеннуюОтправкуЭлектронныхДокументов",
		"ОбменСКонтрагентами",
		НСтр("ka='ელექტრონული დოკუმენტების გადადებული გაგზავნა';ru='Отложенная отправка электронных документов';en='Delay Sending of electronic documents'"),
		НСтр("ka='Отключение немедленной отправки электронных документов при выполнении команды ""Отправить электронный документ"".';ru='Отключение немедленной отправки электронных документов при выполнении команды ""Отправить электронный документ"".';en='Disabling the immediate sending of electronic documents when you run the ""Send e-document"".'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьОбменЭД";
	НоваяНастройка.Зависимости = "ИспользоватьОбменЭД";
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьЭлектронныеПодписи",
		"ОбменСКонтрагентами",
		НСтр("ka='ელექტრონული ხელმოწერები';ru='Электронные подписи';en='electronic signatures'"),
		НСтр("ka='ელექტრონული ხელმოწერით ელექტრონული დოკუმენტების გაგზავნის შესაძლებლობა.';ru='Возможность отправлять электронные документы с электронной подписью.';en='The ability to send electronic documents with an electronic signature.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"НастройкиЭлектроннойПодписиИШифрования",
		"ОбменСКонтрагентами",
		НСтр("ka='ელექტრონული ხელმოწერის და დაშიფრვის გამართვები';ru='Настройки электронной подписи и шифрования';en='Settings of electronic signatures and encryption'"),
		НСтр("ka='ხელმოსაწერად და დასაშიფრად გამოსაყენებელი სერთიფიკატების და პროგრამების გამართვა.';ru='Настройка сертификатов и программ, используемых для подписания и шифрования.';en='Configuring certificates and programs used for signing and encryption.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьЭлектронныеПодписи";
	НоваяНастройка.Зависимости = "ИспользоватьЭлектронныеПодписи";
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"ПодключениеКСервису1С_ЭДО",
		"ОбменСКонтрагентами",
		НСтр("ka='1С-ედბ სერვისთან მიერთება';ru='Подключиться к сервису 1С-ЭДО';en='Connect to 1C-EDI service'"),
		НСтр("ka='Обмен юридически значимыми электронными документами с контрагентами через сервис 1С-ЭДО.';ru='Обмен юридически значимыми электронными документами с контрагентами через сервис 1С-ЭДО.';en='Exchange of legally relevant electronic documents with partners through the service of 1C-EDM.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьЭлектронныеПодписи";
	НоваяНастройка.Зависимости = "ИспользоватьЭлектронныеПодписи";
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"ПомощникПодключенияКСервису1СТакском",
		"ОбменСКонтрагентами",
		НСтр("ka='1С-ტაქსკომ სერვისთან მიერთება';ru='Подключиться к сервису 1С-Такском';en='Connect to the service of 1C-Taxcom'"),
		НСтр("ka='Обмен юридически значимыми электронными документами с контрагентами через сервис 1С-Такском.';ru='Обмен юридически значимыми электронными документами с контрагентами через сервис 1С-Такском.';en='Exchange of legally relevant electronic documents with partners through the service-1C Taxcom.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьЭлектронныеПодписи";
	НоваяНастройка.Зависимости = "ИспользоватьЭлектронныеПодписи";
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ПомощникПодключенияКСервисуБизнесСеть",
		"ОбменСКонтрагентами",
		НСтр("ka='გაცვლის სერვისთან ელექტრონული ხელმოწერის გარეშე მიერთება';ru='Подключиться к сервису обмена без электронной подписи';en='Connect to the exchange service without a digital signature'"),
		НСтр("ka='Обмен электронными документами без электронной подписи для участников 1С:Бизнес-сеть. Не имеет юридической значимости.';ru='Обмен электронными документами без электронной подписи для участников 1С:Бизнес-сеть. Не имеет юридической значимости.';en='electronic exchange of documents without an electronic signature for the participants of the 1C: Business Network. It has no legal significance.'"),
		"e1cib/app/Обработка.БизнесСеть"
	);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები,გასავლის ზედნადები';ru='Контрагенты,Расходная накладная';en='Contractors, Sales Invoice'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"СервисныеКомандыБизнесСеть",
		"ОбменСКонтрагентами",
		НСтр("ka='სერვისული ბრძანებები 1С:ბიზნეს-ქსელი';ru='Сервисные команды 1С:Бизнес-сеть';en='Service commands 1C: Business Network'"),
		НСтр("ka='1C:ბიზნეს-ქსელში დაშვების გამართვები და სინქრონიზაცია';ru='Настройки и синхронизация доступа в 1С:Бизнес-сеть.';en='Tuning and synchronization of access to the 1C: Business Network.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ИнформацияЭДО",
		"ОбменСКонтрагентами",
		НСтр("ka='დეტალურად კონტრაგენტებთან გაცვლის შესახებ';ru='Подробнее о настройке и возможностях обмена с контрагентами';en='Learn more about setting up and sharing opportunities with contractors'"),
		НСтр("ru=''"),
		"http://its.1c.ru/db/bspdoc#content:303:1:issogl1_1.1_обмен_с_контрагентами"
	);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ИнформацияЭДОБизнесСеть",
		"ОбменСКонтрагентами",
		НСтр("ru='Подробнее о настройке и возможностях 1С:Бизнес-сеть';ka='დეტალურად  1С:Бизнес-сеть'-ის შესახებ"),
		НСтр("ru=''"),
		"http://its.1c.ru/db/bspdoc#content:303:1:issogl1_1.4_бизнес-сеть"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьОбменСБанками",
		"ОбменСБанками",
		НСтр("ka='ბანკთან გაცვლა ელექტრონული დოკუმენტებით';ru='Обмен электронными документами с банками';en='Exchange of electronic documents with the banks'"),
		НСтр("ka='Формирование платежных документов в электронном виде и передача в банк напрямую через интернет без использования программы клиент-банка.';ru='Формирование платежных документов в электронном виде и передача в банк напрямую через интернет без использования программы клиент-банка.';en='Formation of payment documents in the electronic form and send to the bank directly through the Internet without the use of client-bank programs.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='საბანკო ანგარიშები';ru='Банковские счета';en='bank accounts'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкиОбменаСБанками",
		"ОбменСБанками",
		НСтр("ka='ბანკებთან გაცვლის გამართვები';ru='Настройки обмена с банками';en='sharing settings with banks'"),
		НСтр("ka='ბანკებთან ელექტრონული დოკუმენტების პირდაპირი გაცვლის გამართვების შესრულება.';ru='Выполнение настроек прямого обмена электронными документами с банками.';en='Performing a factory direct exchange of electronic documents with the banks.'"),
		"e1cib/list/Справочник.НастройкиОбменСБанками"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьОбменСБанками";
	НоваяНастройка.Зависимости = "ИспользоватьОбменСБанками";
	НоваяНастройка.Теги = НСтр("ka='საბანკო ანგარიშები';ru='Банковские счета';en='bank accounts'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ИнформацияЭДООбменСБанками",
		"ОбменСБанками",
		НСтр("ka='დეტალურად ბანკთან გაცვლის აწყობებზე და შესაძლებლობებზე';ru='Подробнее о настройке и возможностях обмена с банками';en='Learn more about setting up and sharing opportunities with banks'"),
		НСтр("ru=''"),
		"http://its.1c.ru/db/bspdoc#content:303:1:issogl1_1.2_обмен_с_банками"
	);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='საბანკო ანგარიშები';ru='Банковские счета';en='bank accounts'");
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ЗаголовокСистемы";
	НоваяНастройка.Раздел			= "ОбщиеНастройки";
	НоваяНастройка.Представление	= НСтр("ka='პროგრამის სათაური';ru='Заголовок программы';en='Title of the program'");
	НоваяНастройка.Описание			= НСтр("ka='პროგრამის სათაური გამოისახება მთავარი ფანჯრის ზემო ნაწილში, მიმდინარე მომხმარებლის და ვალუტების აქტუალური კურსების შესახებ ინფორმაციასთან ერთად."
""
"რჩევა."
"სათაურის მიცემა სასარგებლოა, როდესაც რამდენიმე პროგრამაში ერთდროულად აწარმოებთ მუშაობას. მაშინ, გახსნილი ფანჯრის სათაური გიკარნახებთ, თუ რომელ პროგრამაში მუშაობთ ეხლა.';ru='Заголовок программы отображается в верхней части главного окна, вместе с информацией о текущем пользователе и актуальных курсах валют."
""
"СОВЕТ."
"Заголовок полезно задавать, когда вы ведете работу в нескольких программах одновременно. Тогда заголовок открытого окна будет подсказывать, в какой программе вы сейчас работаете.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 40);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПодсказкаВвода", "Заголовок программы");
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ЧасовойПоясПрограммы";
	НоваяНастройка.Раздел			= "ОбщиеНастройки";
	НоваяНастройка.Представление	= НСтр("ka='დროის სარტყელი';ru='Часовой пояс';en='Timezone'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("Гиперссылка", Истина);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 15);
	НоваяНастройка.СвойстваЭлемента.Вставить("РежимВыбораИзСписка", Истина);
	НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.ЗагрузитьЗначения(ПолучитьДопустимыеЧасовыеПояса());
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"ВремяТекущегоСеанса",
		"ОбщиеНастройки",
		НСтр("ka='მიმდინარე სეანსის დრო';ru='Время текущего сеанса';en='The current session'"),
		НСтр("ru=''")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "ПереноситьДатуЗапретаРедактирования";
	НоваяНастройка.Раздел			= "ОбщиеНастройки";
	НоваяНастройка.Представление	= НСтр("ka='რედაქტირების შეზღუდვის თარიღის გადაწევა';ru='Перенос даты запрета редактирования';en='Postponement of the date of the ban editing'");
	НоваяНастройка.Описание			= НСтр("ka='კალენდარული თვის დახურვისას რედაქტირების აკრძალვის თარიღის ავტომატური გადატანა.';ru='Автоматически переносить дату запрета редактирования при закрытии месяца.';en='Automatically transfer the date of the prohibition of editing at the close of the month.'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("ПеречислениеСсылка.ДаНет");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(Перечисления.ДаНет.Да);
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(Перечисления.ДаНет.Нет);
	НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(Перечисления.ДаНет.ПустаяСсылка(), НСтр("ka='შევეკითხოთ';ru='Спрашивать';en='Ask'"));
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если Не УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ОграничениеДоступаКФункционалуКонтролироватьОстаткиПриПроведении") Тогда //+Lazare 25.11.2023
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"КонтролироватьОстаткиПриПроведении",
		"ОбщиеНастройки",
		НСтр("ka='გატარებისას ნაშთების შემოწმება';ru='Контролировать остатки при проведении';en='Monitor residues during'"),
		НСтр("ka='ჩართვის შედეგად იკრძალება დოკუმენტების გატარება და გაუქმება უარყოფითი ნაშთის გამოჩენის შემთხვევაში.';ru='Включение запрещает проводить и отменять проведение документов, в случае появления отрицательных остатков.';en='Inclusion prohibits conduct and revoke documents, in case of negative balances.'")
		);
		НоваяНастройка.ДобавлятьОтступ = Истина;
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли; //+Lazare 25.11.2023
	
	Если РежимРаботы.КлиентСерверный И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"ПараметрыПроксиСервера",
			"ОбщиеНастройки",
			НСтр("ka='Параметры доступа в Интернет';ru='Параметры доступа в Интернет';en='Parameters for Internet access'"),
			НСтр("ka='პროქსი-სერვერის პარამეტრები გამართვები 1С:საწარმოს სერვერზე.';ru='Настройки параметров прокси-сервера на сервере 1С:Предприятие.';en='The settings of the proxy server on the 1C: Enterprise.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РаботаВБезопасномРежимеСлужебный.ДоступнаНастройкаПрофилейБезопасности() И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"НастройкиИспользованияПрофилейБезопасности",
			"ОбщиеНастройки",
			НСтр("ka='უსაფრთხოების პროფილები';ru='Профили безопасности';en='security profiles'"),
			НСтр("ka='უსაფრთხოების პროფილების გამოყენება გარე რესურსების პროგრამის გამოყენების გასაკონტროლებლად (1С:საწარმოს სერვერების კლასტერთან მიმართებაში).';ru='Использование профилей безопасности для контроля за использованием программой внешних (относительно кластера серверов 1С:Предприятия) ресурсов.';en='Using security profiles to control the use of external program (with respect to the cluster server 1C: Enterprise) resources.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"РИБ",
		"ОбщиеНастройки",
		НСтр("ka='გადანაწილებული ინფურმაციული ბაზა';ru='Распределенная информационная база';en='Distributed data base'"),
		НСтр("ka='У вас несколько территориально удаленных подразделений и нет возможности работать с базой онлайн, так как интернет оставляет желать лучшего? Дайте нам знать об этом - мы подумаем о возможности работы каждой базы автономно и синхронизации по мере появления интернета.';ru='У вас несколько территориально удаленных подразделений и нет возможности работать с базой онлайн, так как интернет оставляет желать лучшего? Дайте нам знать об этом - мы подумаем о возможности работы каждой базы автономно и синхронизации по мере появления интернета.';en='You have several geographically remote offices and do not have the opportunity to work with the database online, because the Internet is poor? Let us know about it - we think about the possibility of working independently of each database and synchronization as the advent of the Internet.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ЗапретРедактированияДокументов",
		"ОбщиеНастройки",
		НСтр("ka='დოკუმენტების რედაქტირების აკრძალვა';ru='Запрет редактирования документов';en='Prohibition editing documents'"),
		НСтр("ka='ჩვენ ვფიქრობთ იმაზე, რომ გავაკეთოთ გატარებული დოკუმენტების (შეკვეთების გარდა) რედაქტირების ოპციური აკრძალვა და მათ რედაქტირებაზე განაცხადების შეყვანის შესაძლებლობა. ასეთი რამ გჭირდებათ თქვენ?';ru='Мы подумываем о том, чтобы сделать опциональный запрет редактирования проведенных документов (кроме заказов) и возможность введение заявок на их редактирование. Вам такое надо?';en=""We're thinking about how to make the ban optional editing of posted documents (except for orders) and the possibility of the introduction of applications for editing. You should be so?""")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ИнформацияИПоддержка",
		"ПоддержкаИОбслуживание",
		НСтр("ka='ინფორმაცია და მხარდაჭერა';ru='Информация и поддержка';en='Information and Support'"),
		НСтр("ka='Оформление непосредственно из программы запросов в службу поддержки (для пользователей сервиса). Ссылки на правовую и методическую поддержку с портала its.1c.ru';ru='Оформление непосредственно из программы запросов в службу поддержки (для пользователей сервиса). Ссылки на правовую и методическую поддержку с портала its.1c.ru';en='Clearance directly from the program in support of requests (for users of the service). Links to legal and methodological support to the portal its.1c.ru'"),
		"e1cib/command/ОбщаяКоманда.ОткрытьИнформационныйЦентр"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если ПолучитьФункциональнуюОпцию("РаботаВЛокальномРежиме") Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ЖурналРегистрации",
			"ПоддержкаИОбслуживание",
			НСтр("ka='რეგისტრაციის ჟურნალი';ru='Журнал регистрации';en='log'"),
			НСтр("ka='რეგისტრაციის ჟურნალი შეიცავს ინფორმაციას იმის შესახებ, თუ დროის გარკვეულ მომენტში როგორი მოვლენები ხდებოდა საინფორმაციო ბაზაში, ან როგორ მოქმედებებს ასრულებდა ეს თუ ის მომხმარებელი.';ru='Журнал регистрации содержит информацию о том, какие события происходили в информационной базе в определенный момент времени, или какие действия выполнял тот или иной пользователь.';en='The log contains information about what events occurred in the information database in a certain time, or any action performed a particular user.'"),
			"e1cib/app/Обработка.ЖурналРегистрации"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("СтандартныеПодсистемыВЛокальномРежиме") Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"АнализЖурналаРегистрации",
			"ПоддержкаИОбслуживание",
			НСтр("ka='რეგისტრაციის ჟურნალის ანალიზი';ru='Анализ журнала регистрации';en='Analysis of log'"),
			НСтр("ka='Переход к отчету ""Анализ журнала регистрации"". Отчет также позволяет анализировать активность пользователей.';ru='Переход к отчету ""Анализ журнала регистрации"". Отчет также позволяет анализировать активность пользователей.';en='Go to report ""Analysis of the log."" The report also allows you to analyze user activity.'"),
			"e1cib/app/Отчет.АнализЖурналаРегистрации"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"АктивныеПользователи",
		"ПоддержкаИОбслуживание",
		НСтр("ka='აქტიური მომხმარებლები';ru='Активные пользователи';en='users Online'"),
		НСтр("ru='Пользователи, работающие в программе на текущий момент.';en='Users working in the program to date.'"),
		"e1cib/app/Обработка.АктивныеПользователи"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"БлокировкаРаботыПользователей",
		"ПоддержкаИОбслуживание",
		НСтр("ka='მომხმარებელთა მუშაობის ბლოკირება';ru='Блокировка работы пользователей';en='Blocking user experience'"),
		НСтр("ka='მომხმარებლებისთვის საინფორმაციო ბაზაში შესვლის აკრძალვა.';ru='Запрет входа в информационную базу для пользователей.';en='Ban the entrance of the information base for users.'"),
		"e1cib/app/Обработка.БлокировкаРаботыПользователей"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"ОбновитьПараметрыСистемы",
		"ПоддержкаИОбслуживание",
		НСтр("ru='Обновить параметры системы';en='Update System Settings'"),
		НСтр("ka='Сброс кэша, обновление интерфейса с учетом функциональных опций.';ru='Сброс кэша, обновление интерфейса с учетом функциональных опций.';en='Reset cache interface update, taking into account the functional options.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"УдалениеПомеченныхОбъектов",
		"ПоддержкаИОбслуживание",
		НСтр("ka='მონიშნული ობიექტების წაშლა';ru='Удаление помеченных объектов';en='Deleting marked objects'"),
		НСтр("ka='Окончательное удаление объектов, помеченных на удаление, с контролем ссылочной целостности.';ru='Окончательное удаление объектов, помеченных на удаление, с контролем ссылочной целостности.';en='Permanently delete objects that are marked for deletion, the control referential integrity.'"),
		"e1cib/app/Обработка.УдалениеПомеченныхОбъектов"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если (РежимРаботы.Локальный	Или РежимРаботы.Автономный)
	И РежимРаботы.ЭтоАдминистраторСистемы
	И Не РежимРаботы.ЭтоВебКлиент
	И РежимРаботы.ЭтоWindowsКлиент Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"РезервноеКопированиеИВосстановление",
			"ПоддержкаИОбслуживание",
			НСтр("ka='სერვისში გადასვლა';ru='Перейти в сервис';en='Go to the service'"),
			НСтр("ka='Создание резервных копий информационных баз, восстановление из копии и настройка резервного копирования. Резервное копирование можно осуществлять как на локальный компьютер, так и в 1С:Облачный архив.';ru='Создание резервных копий информационных баз, восстановление из копии и настройка резервного копирования. Резервное копирование можно осуществлять как на локальный компьютер, так и в 1С:Облачный архив.';en='Backing up information databases, recovery from a backup and configuration backup. Backups can be done both on the local computer and in the 1C: Cloud archive.'"),
			"e1cib/command/Обработка.ОблачныйАрхив.Команда.РезервноеКопированиеИВосстановление"
		);
		НоваяНастройка.ДобавлятьОтступ = Истина;
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ИнформацияОбОблачномАрхиве",
		"ПоддержкаИОбслуживание",
		НСтр("ka='დეტალურად 1С:Облачный архив';ru='Подробнее о 1С:Облачный архив';en='More about 1C: Cloud archive'"),
		НСтр("ru=''"),
		"https://portal.1c.ru/app/arhiv"
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	Если РежимРаботы.Локальный И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ЗагрузитьКлассификаторБанков",
			"ПоддержкаИОбслуживание",
			НСтр("ka='ბანკების კლასიფიკატორის ჩატვირთვა';ru='Загрузить классификатор банков';en='Upload qualifier banks'"),
			НСтр("ka='საქართველოს ბანკების კლასიფიკატორის ჩატვირთვა 1С:სტთ-ის დისკიდან ან საიტიდან.';ru='Загрузка классификатора банков РФ с диска 1С:ИТС или сайта РБК.';en='Loading classifier Russian banks from the disk 1C: ITS, or RBC.'"),
			"e1cib/command/Справочник.КлассификаторБанковРФ.Команда.ЗагрузкаКлассификатораБанковРФ"
		);
		НоваяНастройка.ДобавлятьОтступ = Истина;
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.Теги = НСтр("ka='საბანკო ანგარიშები';ru='Банковские счета';en='bank accounts'");
	КонецЕсли;
	
	Если РежимРаботы.Локальный Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ЗагрузкаКурсовВалют",
			"ПоддержкаИОбслуживание",
			НСтр("ka='ვალუტის კურსების ჩატვირთვა';ru='Загрузить курсы валют';en='Download exchange rates'"),
			НСтр("ka='არჩეული ვალუტის კურსების საიტიდან ჩატვირთვა მითითებული პერიოდისთვის.';ru='Загрузка курсов выбранных валют за указанный период с сайта РБК.';en='Loading courses selected currencies over the period from RBC.'"),
			"e1cib/app/Обработка.ЗагрузкаКурсовВалют"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.Теги = НСтр("ka='საბანკო ანგარიშები';ru='Банковские счета';en='bank accounts'");
	КонецЕсли;
	
	Если Не РежимРаботы.ЭтоLinuxКлиент Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ИспользоватьИнтеграцию1СБухфон",
			"ПоддержкаИОбслуживание",
			НСтр("ka='1С-ბუხფონის გაშვება';ru='Запуск 1С-Бухфон';en='Running 1C Buhfon'"),
			НСтр("ka='Разрешить запуск приложения 1С-Бухфон для соединения со специалистом поддержки.';ru='Разрешить запуск приложения 1С-Бухфон для соединения со специалистом поддержки.';en='Allow a 1C-Buhfon applications to connect with a specialist support.'")
		);
		НоваяНастройка.ДобавлятьОтступ = Истина;
		НоваяНастройка.ОбновлятьИнтерфейс = Истина;
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если Не РежимРаботы.ЭтоLinuxКлиент Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"Настройка1СБухфон",
			"ПоддержкаИОбслуживание",
			НСтр("ka='1С-ბუხფონის გამართვა';ru='Настройка 1С-Бухфон';en='Setting 1C Buhfon'"),
			НСтр("ka='ამ კომპიუტერზე დანართ 1С-ბუხფონის გაშვების გამართვა.';ru='Настройка запуска приложения 1С-Бухфон на этом компьютере.';en='Configuring an application 1C Buhfon on this computer.'")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьИнтеграцию1СБухфон";
	КонецЕсли;
	
	Если РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"НастройкаСтандартногоИнтерфейсаOData",
			"ПоддержкаИОбслуживание",
			НСтр("ka='სტანდარტული ინტერფეისის გამართვა Odata';ru='Настройка стандартного интерфейса OData';en='Setting the OData standard interface'"),
			НСтр("ru=''"),
			"e1cib/app/Обработка.НастройкаСтандартногоИнтерфейсаOData"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьДатыЗапретаИзменения",
		"ПоддержкаИОбслуживание",
		НСтр("ka='გასული პერიოდების ცვლილების აკრძალვა';ru='Запрещать изменения прошлых периодов';en='Prohibit changes prior periods'"),
		НСтр("ka='გასული პერიოდების მონაცემთა შეცვლის აკრძალვა.';ru='Запрет изменения данных прошлых периодов.';en='Restrict changes historical data.'")
	);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ДатыЗапретаИзмененияДанных",
		"ПоддержкаИОбслуживание",
		НСтр("ka='მონაცემთა შეცვლის აკრძალვის თარიღები';ru='Даты запрета изменения данных';en='The date of the prohibition of data changes'"),
		НСтр("ru=''"),
		"e1cib/command/РегистрСведений.ДатыЗапретаИзменения.Команда.ДатыЗапретаИзмененияДанных"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьДатыЗапретаИзменения";
	НоваяНастройка.Зависимости = "ИспользоватьДатыЗапретаИзменения";
	
	Если ПолучениеОбновленийПрограммы.ДоступноИспользованиеОбновленияПрограммы() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"ОбновлениеПрограммы",
			"ИнтернетПоддержкаПользователей",
			НСтр("ka='პროგრამის განახლება';ru='Обновление программы';en='Program update'"),
			НСтр("ka='Получение информации и установка новых версий конфигурации и платформы 1С:Предприятия.';ru='Получение информации и установка новых версий конфигурации и платформы 1С:Предприятия.';en='information to obtain and install new versions of configuration and platform 1C: Enterprise.'")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторСистемы;
	КонецЕсли;
	
	Если ИнтернетПоддержкаПользователейВызовСервера.ДоступноПодключениеИнтернетПоддержки() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"ПодключитьИПП",
			"ИнтернетПоддержкаПользователей",
			НСтр("ru='Подключить Интернет-поддержку';en='Connect Internet support'"),
			НСтр("ka='მომხმარებლების ინტერნეტ-მხარდაჭერის სისტემაში ავტორიზაციისთვის გამოიყენება იგივე ლოგ-ინი და პაროლი, რომელიც შემდეგ საიტზე users.v8.1c.ru."
"თუ თქვენ, ჯერ კიდევ არ გაქვთ ლოგ-ინი და პაროლი, მაშინ დამოუკიდებლად შეასრულეთ რეგისტრაცია ან დახმარებისთვის მიმართეთ ფირმა ""1С""-ის პარტნიორს, რომელთანაც თქვენ დადებული გაქვთ სტთ-ის ხელშეკრულება.';ru='Для авторизации в системе Интернет-поддержки пользователей используется тот же логин и пароль, что и на сайте users.v8.1c.ru."
"Если у Вас ещё нет логина и пароля, то выполните регистрацию самостоятельно или обратитесь за помощью к партнёру фирмы ""1С"", с которым у Вас заключен договор ИТС.'")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если МониторИнтернетПоддержки.ДоступноИспользованиеМонитораИнтернетПоддержки() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"МониторИнтернетПоддержки",
			"ИнтернетПоддержкаПользователей",
			НСтр("ka='ინტერნეტ-მხარდაჭერის მონიტორი ';ru='Монитор Интернет-поддержки';en='Internet Support Monitor'"),
			НСтр("ka='ინფორმაცია პროგრამული პროდუქტის, პროგრამის ვერსიის მხარდაჭერის შესახებ და სხვა.';ru='Информация о поддержке программного продукта, версии программы и др.';en='Information on the support of the product, version, and others.'")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если ИнтернетПоддержкаПользователейВызовСервера.ДоступнаНастройкаПараметровПодключенияКИнтернетПоддержке() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"НастройкиСоединенияССерверомИнтернетПоддержки",
			"ИнтернетПоддержкаПользователей",
			НСтр("ka='სერვერთან შეერთების გამართვები';ru='Настройки соединения с сервером';en='Server Connection Settings'"),
			НСтр("ka='ინტერნეტ-მხარდაჭერის სერვერთან ქსელური შეერთების პარამეტრების გამართვა';ru='Настройка параметров сетевого соединения с сервером Интернет-поддержки';en='Configuring network connection settings with Internet-enabled server'")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"РезультатыОбновленияИДополнительнаяОбработкаДанных",
		"ИнтернетПоддержкаПользователей",
		НСтр("ka='განახლების შედეგები და მონაცემების დამატებითი დამუშავება';ru='Результаты обновления и дополнительная обработка данных';en='Results updates and additional data processing'"),
		НСтр("ka='Сведения о ходе обновления версии программы, отложенное выполнение дополнительных процедур обработки данных.';ru='Сведения о ходе обновления версии программы, отложенное выполнение дополнительных процедур обработки данных.';en='Information on the progress of the update version of the program, deferred execution of additional data-processing procedures.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ДетализироватьОбновлениеИБВЖурналеРегистрации",
			"ИнтернетПоддержкаПользователей",
			НСтр("ka='განახლების მსვლელობის დეტალიზაცია რეგისტრაციის ჟურნალში';ru='Детализировать ход обновления в журнале регистрации';en='Detail the progress of the update in the log'"),
			НСтр("ka='განახლების შესრულების შესახებ დაწვრილებითი ინფორმაციის ჩაწერა რეგისტრაციის ჟურნალში.';ru='Записывать в журнал регистрации подробную информацию о ходе выполнения обновления.';en='Write to the log information on the progress of the update.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если ПолучениеОбновленийПрограммы.ДоступноИспользованиеОбновленияПрограммы() И Не ПустаяСтрока(ПолучениеОбновленийПрограммы.КаталогСохраненияПоследнегоПолученногоДистрибутива()) Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "КаталогДистрибутиваПлатформы";
		НоваяНастройка.Раздел			= "ИнтернетПоддержкаПользователей";
		НоваяНастройка.Представление	= НСтр("ka='პლატფორმის ბოლო მიღებული დისტრიბუცია შენახულია საქაღალდეში';ru='Последний полученный дистрибутив платформы сохранен в папку';en='Last received distribution platform is stored in a folder'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеНадписи);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
		НоваяНастройка.СвойстваЭлемента.Вставить("Гиперссылка", Истина);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"РазрешенаРаботаСНовостями",
			"ИнтернетПоддержкаПользователей",
			НСтр("ka='სიახლეების მიღება';ru='Получение новостей';en='Receive news'"),
			НСтр("ka='ახალი ამბების ავტომატური მიღება 1С-ის სერვერებიდან, ახალი ამბების და ახალი ამბების ლენტების გამართვები.';ru='Автоматическое получение новостей с серверов 1С, настройки новостей и лент новостей.';en='To automatically receive news from 1C server, configure news and news feeds.'")
		);
		НоваяНастройка.ОбновлятьИнтерфейс = Истина;
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"УправлениеНовостями",
			"ИнтернетПоддержкаПользователей",
			НСтр("ka='სიახლეებით მართვა';ru='Управление новостями';en='news management'"),
			НСтр("ka='Управление настройками новостей, обновление лент новостей и списка новостей.';ru='Управление настройками новостей, обновление лент новостей и списка новостей.';en='news management settings, updated news feeds and news list.'"),
			"e1cib/command/Обработка.УправлениеНовостями.Команда.КомандаФормаНастроекНовостей"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "РазрешенаРаботаСНовостями";
		НоваяНастройка.Зависимости = "РазрешенаРаботаСНовостями";
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы И РежимРаботы.Локальный Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"ВыгрузитьДанныеДляПереходаВСервис",
			"ПереходМеждуЛокальнымИСервиснымРежимамиРаботы",
			НСтр("ka='სერვისში გადასვლა';ru='Перейти в сервис';en='Go to the service'"),
			НСтр("ka='შეგიძლიათ სერვისში მუშაობა გააგრძელოთ საკუთარი მონაცემებით ამ პროგრამიდან. ამისთვის, საჭიროა მიღებული ფაილის სერვისში გადაცემა ან ჩატვირთვა.';ru='Вы можете продолжить работу в сервисе со своими данными из этой программы. Для этого необходимо передать или загрузить полученный файл в сервис.';en='You can continue to work in the service with the data from this program. To do this, you must send or download the file to the service.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы И РежимРаботы.Локальный Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"ЗагрузитьДанныеИзСервиса",
			"ПереходМеждуЛокальнымИСервиснымРежимамиРаботы",
			НСтр("ka='სერვისიდან ჩატვირთვა';ru='Загрузить из сервиса';en='Upload of service'"),
			НСтр("ka='მონაცემებიანი ფაილის ჩატვირთვა სერვისიდან. ჩატვირთვის წინ უნდა დავრწმუნდეთ იმაში, რომ პროგრამის ვერსია ემთხვევა იმ ვერსიას, საიდანაც გადმოიტვირთა მონაცემები.';ru='Загрузка файла с данными из сервиса. Перед загрузкой необходимо убедится, что версия программы совпадает с версией, из которой выгружались данные.';en='Uploading a file with data from the service. Before loading, check that the version matches the version from which you upload data.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторПрограммы И РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"ВыгрузитьДанныеВЛокальнуюВерсию",
			"ПереходМеждуЛокальнымИСервиснымРежимамиРаботы",
			НСтр("ka='ლოკალურ ვერსიაში გადმოტვირთვა';ru='Выгрузить в локальную версию';en='Upload to a local version'"),
			НСтр("ka='თქვენ შეგიძლიათ ამ დანართის მონაცემთან მუშაობის გაგრძელება ლოკალურ ვერსიაში. ამისთვის, აუცილებელია თქვენს კომპიუტერზე დაყენებულ პროგრამაში მონაცემთა ჩატვირთვა.';ru='Вы можете продолжить работу с данным этого приложением в локальной версии. Для этого необходимо загрузить данные программу, которая установлена на вашем компьютере.';en='You can continue to work with the data of the application in the local version. To do this, you need to download the data program that is installed on your computer.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.МодельСервиса Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"АвтономнаяРабота",
			"ПереходМеждуЛокальнымИСервиснымРежимамиРаботы",
			НСтр("ka='ავტონომიური მუშაობა';ru='Автономная работа';en='Stand-alone operation'"),
			НСтр("ka='Работа с приложением, имеющим плохое подключение сервису';ru='Работа с приложением, имеющим плохое подключение сервису';en='Working with applications that have a bad connection service'"),
			"e1cib/command/ОбщаяКоманда.АвтономнаяРаботаВМоделиСервиса"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если РежимРаботы.Автономный Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"АвтономнаяРабота_Локально",
			"ПереходМеждуЛокальнымИСервиснымРежимамиРаботы",
			НСтр("ka='ავტონომიური მუშაობა';ru='Автономная работа';en='Stand-alone operation'"),
			НСтр("ka='Обмен с приложением в интернете';ru='Обмен с приложением в интернете';en='Exchange with the application on the Internet'"),
			"e1cib/command/ОбщаяКоманда.АвтономнаяРабота"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьВерсионированиеОбъектов",
		"ВерсионированиеОбъектов",
		НСтр("ka='ობიექტების ვერსიების წარმოშობა';ru='Версионирование объектов';en='versioning of files'"),
		НСтр("ka='დოკუმენტების ვერსიების და პროგრამის ცნობარების შენახვა და ნახვა.';ru='Хранение и просмотр версий документов и справочников программы.';en='Storage and viewing document versions and reference program.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкиВерсионированияОбъектов",
		"ВерсионированиеОбъектов",
		НСтр("ka='ობიექტების ვერსიონირების გამართვები';ru='Настройки версионирования объектов';en='Versioning Settings objects'"),
		НСтр("ka='ვერსიონირების ვარიანტების გამართვა დოკუმენტებისთვის და ცნობარებისთვის.';ru='Настройка вариантов версионирования для документов и справочников.';en='Setting options for versioning of documents and directories.'"),
		"e1cib/list/РегистрСведений.НастройкиВерсионированияОбъектов"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьВерсионированиеОбъектов";
	НоваяНастройка.Зависимости = "ИспользоватьВерсионированиеОбъектов";
	НоваяНастройка.Теги = НСтр("ka='Версионирование';ru='Версионирование';en='versioning'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"ДополнительныеРеквизиты",
		"ДополнительныеРеквизиты",
		НСтр("ka='დამატებითი რეკვიზიტები';ru='Дополнительные реквизиты';en='Additional Information'"),
		НСтр("ru='Создание реквизитов, их изменение, описание свойств."
"Эти реквизиты отображаются в формах.';ka='Создание реквизитов, их изменение, описание свойств."
"Эти реквизиты отображаются в формах.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='მახასიათებლები';ru='Характеристики';en='Characteristics'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"ДополнительныеСведения",
		"ДополнительныеРеквизиты",
		НСтр("ka='დამატებითი ცნობები';ru='Дополнительные сведения';en='additional information'"),
		НСтр("ru='Создание сведений, их изменение, описание свойств."
"Эти сведения отображаются в отдельной форме,"
"которая открывается специальной командой.';ka='Создание сведений, их изменение, описание свойств."
"Эти сведения отображаются в отдельной форме,"
"которая открывается специальной командой.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='მახასიათებლები';ru='Характеристики';en='Characteristics'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьОбщиеДополнительныеЗначения",
		"ДополнительныеРеквизиты",
		НСтр("ka='რეკვიზიტები და მონაცემები საერთო მნიშვნელობების სიით';ru='Реквизиты и сведения с общим списком значений';en='Details and information to the general list of values'"),
		НСтр("ru='Разрешить добавление реквизитов, у которых общий список значений с другими реквизитами (команда Добавить - По образцу).';ka='Разрешить добавление реквизитов, у которых общий список значений с другими реквизитами (команда Добавить - По образцу).'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Характеристики,Дополнительные реквизиты и сведения';en='Characteristics, details and more details'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьОбщиеДополнительныеРеквизитыИСведения",
		"ДополнительныеРеквизиты",
		НСтр("ka='საერთო რეკვიზიტები და მონაცემები';ru='Общие реквизиты и сведения';en='General details and information'"),
		НСтр("ka='Разрешить добавление реквизитов сразу к нескольким объектам программы одновременно (команда Добавить - Общий).';ru='Разрешить добавление реквизитов сразу к нескольким объектам программы одновременно (команда Добавить - Общий).';en='Allow adding details to multiple objects at the same time the program (command Add - General).'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ru='Характеристики,Дополнительные реквизиты и сведения';en='Characteristics, details and more details'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьВидыКонтактнойИнформации",
		"КонтактнаяИнформация",
		НСтр("ka='საკონტაქტო ინფორმაციის სახეობები';ru='Виды контактной информации';en='Types of contact information'"),
		НСтр("ka='სისტემის სხვადასხვა ობიექტის საკონტაქტო ინფორმაციის კლასიფიკაცია, მაგალითად, კონტრაგენტების, ორგანიზაციების, თანამშრომლების და ა.შ.';ru='Классификация контактной информации различных объектов системы, например, контрагентов, организаций, сотрудников и т.д.';en='Classification contact information of various system objects, such as contractors, organizations, employees, etc.'"),
		"e1cib/list/Справочник.ВидыКонтактнойИнформации"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები, საკონტაქტო პირები';ru='Контрагенты,Контактные лица';en='Accounts, Contacts'");
	
	Если РежимРаботы.Локальный Или РежимРаботы.Автономный Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "ИсточникДанныхАдресногоКлассификатора";
		НоваяНастройка.Раздел			= "КонтактнаяИнформация";
		НоваяНастройка.Представление	= НСтр("ka='სამისამართო კლასიფიკატორის მონაცემთა წყარო';ru='Источник данных адресного классификатора';en='Data source address of the classifier'");
		НоваяНастройка.Описание			= НСтр("ka='• ფირმა 1С-ის მიერ შემოთავაზებული ვებ-სერვისის გამოყენება. საჭიროა ინტერნეტთან მუდმივი შეერთება."
""
"• საიტ 1С-დან ან საქაღალდიდან დისკზე ჩასატვირთი მონაცემების გამოყენება. შეიძლება ინტერნეტთან შეერთების გარეშე მუშაობა .';ru='• Использовать веб-сервис, предоставляемый фирмой 1С. Требуется постоянное подключение к Интернету."
""
"• Использовать данные, загружаемые с сайта 1С или из папки на диске. Возможна работа без подключения к Интернету.'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
		НоваяНастройка.СвойстваЭлемента.Вставить("КоличествоКолонок", 1);
		НоваяНастройка.ОбновлятьИнтерфейс = Истина;
		НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
		НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить("Сервис1С", НСтр("ka='გამოვიყენოთ 1C-ის ვებ-სერვისი მისამართების შესაყვანად და შესამოწმებლად';ru='Использовать веб-сервис 1С для ввода и проверки адресов';en='Use a web service to enter 1C and address verification'"));
		НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить("", НСтр("ka='კლასიფიკატორის ჩატვირთვა პროგრამაში';ru='Загружать классификатор в программу';en='Download qualifier in program'"));
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторСистемы;
	КонецЕсли;
	
	Если РежимРаботы.Локальный Или РежимРаботы.Автономный Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ЗагрузитьАдресныйКлассификатор",
			"КонтактнаяИнформация",
			НСтр("ka='სამისამართო კლასიფიკატორის ჩატვირთვა';ru='Загрузить адресный классификатор';en='Upload address qualifier'"),
			НСтр("ka='სამისამართო კლასიფიკატორის ჩატვირთვა 1С-ის საიტიდან ან საქაღალდიდან დისკზე.';ru='Загрузка адресного классификатора с сайта 1С или из папки на диске.';en='Loading address classifier with 1C site or from a folder on the disk.'"),
			"e1cib/command/РегистрСведений.АдресныеОбъекты.Команда.ЗагрузитьАдресныйКлассификатор"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторСистемы;
		НоваяНастройка.Зависимости = "ИсточникДанныхАдресногоКлассификатора";
	КонецЕсли;
	
	Если РежимРаботы.Локальный Или РежимРаботы.Автономный Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ОчиститьАдресныйКлассификатор",
			"КонтактнаяИнформация",
			НСтр("ka='მისამართის ინფორმაციის გასუფთავება';ru='Очистить адресные сведения';en='Clear information address'"),
			НСтр("ka='ჩატვირთული სამისამართო ინფორმაციის წაშლა არჩეული გამოუყენებელი რეგიონების მიხედვით, ბაზის ზომის შესამცირებლად.';ru='Удаление загруженных адресных сведений по выбранным неиспользуемым регионам для уменьшения размера базы.';en='Deleting downloaded address information for the selected unused regions to reduce the size of the database.'"),
			"e1cib/command/РегистрСведений.АдресныеОбъекты.Команда.ОчиститьАдресныйКлассификатор"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторСистемы;
		НоваяНастройка.Зависимости = "ИсточникДанныхАдресногоКлассификатора";
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ПользователиПрограммы",
		"НастройкиПользователейИПрав",
		НСтр("ka='მომხმარებლები';ru='Пользователи';en='users'"),
		НСтр("ka='პროგრამასთან მომუშავე მომხმარებელთა სიის წარმოება.';ru='Ведение списка пользователей, которые работают с программой.';en='Maintain a list of users who work with the program.'"),
		"e1cib/list/Справочник.Пользователи"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если Пользователи.ОбщиеНастройкиВходаИспользуются() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"НастройкаВходаПользователей",
			"НастройкиПользователейИПрав",
			НСтр("ka='მომხმარებლების შესვლის ავტორიზაცია';ru='Настройка входа пользователей';en='User input setting'"),
			НСтр("ka='პაროლების სირთულე და ცვლილება, არააქტიური მომხმარებლების მუშაობის შეზღუდვა.';ru='Сложность и смена паролей, ограничение работы неактивных пользователей.';en='The complexity and changing passwords, restricting the work of inactive users.'")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкиПользователей",
		"НастройкиПользователейИПрав",
		НСтр("ka='მომხმარებლების გასწორებები';ru='Настройки пользователей';en='user settings'"),
		НСтр("ka='ანგარიშგებების სამომხმარებლო გამართვების, პროგრამის გარეგნული იერის და სხვა გასწორებების მართვა.';ru='Управление пользовательскими настройками отчетов, внешнего вида программы и прочими настройками.';en='Manage Custom Reports settings, appearance of the program and other settings.'"),
		"e1cib/app/Обработка.НастройкиПользователей"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"КопированиеНастроекПользователей",
		"НастройкиПользователейИПрав",
		НСтр("ka='მომხმარებელთა გამართვების კოპირება';ru='Копирование настроек пользователей';en='Copying user settings'"),
		НСтр("ka='სააღრიცხვო ჩანაწერებს შორის სამომამხმარებლო გამართვების კოპირება.';ru='Копирование пользовательских настроек между учетными записями.';en='Copy custom settings between accounts.'"),
		"e1cib/command/Обработка.НастройкиПользователей.Команда.КопированиеНастроекПользователей"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОчисткаНастроекПользователей",
		"НастройкиПользователейИПрав",
		НСтр("ka='აწყობების გასუფთავება';ru='Очистка настроек';en='Cleanup settings'"),
		НСтр("ka='გამართვების წაშლა ყველა ან შერჩეული მომხმარებლისთვის.';ru='Удаление настроек у всех или выбранных пользователей.';en='Deleting settings for all or selected users.'"),
		"e1cib/command/Обработка.НастройкиПользователей.Команда.ОчисткаНастроекПользователей"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ОграничиватьДоступНаУровнеЗаписей",
		"НастройкиПользователейИПрав",
		НСтр("ka='ჩანაწერების დონეზე დაშვების შეზღუდვა';ru='Ограничивать доступ на уровне записей';en='Restrict access to the record level'"),
		НСтр("ka='გაფართოვებული აწყობა გვაძლევს ცნობარებთან, დოკუმენტებთან და პროგრამის სხვა მონაცემებთან მაქსიმალურად მოქნილი  წვდომის უფლებების აწყობის საშუალებას.';ru='Расширенная настройка, позволяющая максимально гибко настраивать права доступа к справочникам, документам и другим данным программы в предусмотренных разрезах.';en='Advanced setup, allowing maximum flexibility to customize the permissions on the directories, documents and other data provided for in the program sections.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьГруппыДоступаКонтрагентов",
		"НастройкиПользователейИПрав",
		НСтр("ka='კონტრაგენტების დაშვების ჯგუფები';ru='Группы доступа контрагентов';en='counterparties access group'"),
		НСтр("ka='კონტრაგენტების დაყოფა ჯგუფებად, რომელთა მიხედვით შეიძლება მომხმარებლებისთვის უფლებების დანიშვნა კონტრაგენტების დასამატებლად (შესაცვლელად), სანახავად და ამ კონტრაგენტების თაობაზე ყველა დოკუმენტის სანახავად.';ru='Деление контрагентов на группы, по которым можно назначать пользователям права на добавление (изменение), просмотр контрагентов и всех документов по этим контрагентам.';en='Dividing into groups of counterparties, for which you can assign user rights to add (changing), view of counterparties and all documents to these counterparties.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ОграничиватьДоступНаУровнеЗаписей";
	НоваяНастройка.Зависимости = "ОграничиватьДоступНаУровнеЗаписей";
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьГруппыДоступаКонтрагентов",
		"НастройкиПользователейИПрав",
		НСтр("ka='კონტრაგენტების დაშვების ჯგუფები';ru='Группы доступа контрагентов';en='counterparties access group'"),
		НСтр("ka='კონტრაგენტების ხელმისაწვდომობის ჯგუფის შექმნა.';ru='Создание групп доступа контрагентов.';en='Creating counterparties access groups.'"),
		"e1cib/list/Справочник.ГруппыДоступаКонтрагентов"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ОграничиватьДоступНаУровнеЗаписей";
	НоваяНастройка.Зависимости = "ОграничиватьДоступНаУровнеЗаписей,ИспользоватьГруппыДоступаКонтрагентов";
	НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ИнформацияОНастройкеПравДоступа",
		"НастройкиПользователейИПрав",
		НСтр("ka='დაწვრილებით, მომხმარებლების დაშვების უფლებების შესაძლებლობების შესახებ';ru='Подробнее о возможностях прав доступа пользователей';en='For more information about the rights of users to access opportunities'"),
		НСтр("ka='რესურს its.1c.ru-ზე არსებული სტატია, სადაც დაწვრილებით არის აღწერილი მომხმარებლების დაშვების უფლებების გამართვების შესაძლებლობები და სხვადასხვა ვარიანტი.';ru='Статья на ресурсе its.1c.ru, в которой подробно описываются возможности и различные варианты настроек прав доступа пользователей.';en='Article on its.1c.ru resource in which opportunities and various options for setting user access rights are described in detail.'"),
		"http://its.1c.ru/db/updinfo#content:142:1:issogl2_8"
	);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ОграничениеПравДоступаПоОрганизациям",
		"НастройкиПользователейИПрав",
		НСтр("ka='დაშვების უფლებების შეზღუდვა ორგანიზაციების მიხედვით';ru='Ограничение прав доступа по организациям';en='Restriction of access rights by organizations'"),
		НСтр("ka='თუ თქვენთვის ნამდვილად მნიშვნელოვანია ის, რომ თანამშრომელი ხედავდეს დოკუმენტებს, რაოდენობრივ და ხარისხობრივ მაჩვენებლებს მხოლოდ საკუთარი ორგანიზაციის თაობაზე, მაშინ, ჩვენ შეგვიძლია დავგეგმოთ ასეთი ფუნქციონალის რეალიზაცია. უნდა აღინიშნოს, რომ ორგანიზაციის მიხედვით გაფილტრვა უკვე ეხლავე შეიძლება. საკითხი ის არის, რომ ""უცხო"" თანამშრომელმა ვერ დაინახოს არასაკუთარი ორგანიზაციის მონაცემები იმ შემთხვევაშიც, თუ ის მოისურვებს.';ru='Если вам действительно важно, чтобы сотрудник видел документы, количественные и суммовые показатели только по своей организации - мы можем запланировать реализацию такого функционала. Важно отметить, что фильтровать по организации можно уже сейчас. Вопрос в том, чтобы ""чужой"" сотрудник не мог увидеть данные не по своей организации, даже если захочет.';en='If you are really important to the employee saw the documents, quantitative metrics and sum only by their organization - we can plan for the implementation of such functionality. It is important to note that the filtering of the organization can now. The question is, to the ""foreign"" staff member could not see no data in their organization, even if he wanted.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ОграничениеПравДоступаПоСкладам",
		"НастройкиПользователейИПрав",
		НСтр("ka='საწყობებში დაშვების უფლებების შეზღუდვა';ru='Ограничение прав доступа по складам';en='Restriction of access rights to spell'"),
		НСтр("ka='თუ თქვენთვის მნიშვნელოვანია, რომ სხვადასხვა ფილიალის, მაღაზიის ან საწყობის მუშაკებმა იხილონ დოკუმენტები და რაოდენობრივი მაჩვენებლები მხოლოდ თავიანთი საწყობების მიხედვით, მაშინ, ჩვენ შეგვიძლია დავგეგმოთ ასეთი ფუნქციონალის რეალიზაცია. უნდა აღინიშნოს, რომ საწყობების გაფილტრვა უკვე, ეხლავე შეიძლება. საქმე ის არის, რომ ""უცხო"" მესაწყობემ ვერ შეძლოს სხვისი მონაცემების ნახვა მაშინაც, თუ იგი ამას მოისურვებს.';ru='Если вам действительно важно, чтобы работники разных филиалов, магазинов или складов видели документы и количественные показатели только по своим складам - мы можем запланировать реализацию такого функционала. Важно отметить, что фильтровать складам можно уже сейчас. Вопрос в том, чтобы ""чужой"" кладовщик не мог увидеть чужие данные даже если захочет.';en='If you are really important to workers of different branches, stores or warehouses see documents and quantitative indicators only in its warehouses - we can plan the implementation of such functionality. It is important to note that the filtering warehouses can now. The question is, to a ""foreign"" storekeeper could not see other people''s data even if he wants to.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ОграничениеПравДоступаПоКассам",
		"НастройкиПользователейИПрав",
		НСтр("ka='დაშვების უფლებების შეზღუდვა სალაროების მიხედვით';ru='Ограничение прав доступа по кассам';en='Restriction of access rights to the cash register'"),
		НСтр("ka='თუ თქვენთვის ნამდვილად მნიშვნელოვანია, რომ მოლარემ იხილოს დოკუმენტები, რაოდენობრივი და თანხობრივი მაჩვენებლები მხოლოდ საკუთარი სალაროს მიხედვით - ჩვენ შეგვიძლია ასეთი ფუნქციონალის რეალიზების დაგეგმვა. მნიშვნელოვანია იმის აღნიშვნა, რომ სალაროების მიხედვით გაფილტრვა უკვე ეხლავე შეიძლება. საქმე იმაშია, რომ ""უცხო"" მოლარემ ვერ იხილოს სხვისი მონაცემები იმ შემთხვევაშიც, თუ იგი მოისურვებს.';ru='Если вам действительно важно, чтобы кассир видел документы, количественные и суммовые показатели только по своей кассе - мы можем запланировать реализацию такого функционала. Важно отметить, что фильтровать по кассам можно уже сейчас. Вопрос в том, чтобы ""чужой"" кассир не мог увидеть чужие данные даже если захочет.';en='If you are really important to the cashier saw documents, quantitative metrics and sum only in their office - we can plan for the implementation of such functionality. It is important to note that the filtering of the booths can now. The question is, to a ""foreign"" cashier could not see other people''s data even if he wants to.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ИспользоватьПроверкуКонтрагентов",
			"ПроверкаКонтрагентов",
			НСтр("ka='გესრ-ის მიხედვით კონტრაგენტების ავტომატური შემოწმება';ru='Автоматически проверять контрагентов по ЕГРН';en='Automatically check for contractors USRRE'"),
			НСтр("ka='ავტომატური შემოწმების ჩართვამ ნელ კომპიუტერებზე შეიძლება შეანელოს დოკუმენტების გახსნა. ასეთი კომპიუტერებისთვის რეკომენდებულია ქვემენიუ ""კიდევ""-ში არსებული ღილაკით ხელით შემოწმების გამოყენება.';ru='Включение автоматической проверки может замедлить открытие документов на медленных компьютерах. Для таких компьютеров рекомендуется использовать ручную проверку по кнопке в подменю Еще.';en='Enabling automatic verification can slow opening documents on slow computers. it is recommended to use a manual check button in the submenu for these computers more.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ПодробнееОПроверкеКонтрагентов",
			"ПроверкаКонтрагентов",
			НСтр("ka='დეტალურად სერვისსზე';ru='Подробнее о сервисе';en='More about the service'"),
			НСтр("ru=''"),
			"e1cib/app/Обработка.ИнструкцияПоИспользованиюПроверкиКонтрагента"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "ИспользоватьПроверкуКонтрагентов";
		НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"ПроверитьДоступКСервисуПроверкиКонтрагентов",
			"ПроверкаКонтрагентов",
			НСтр("ka='ვებ სერვისთან წვდომის შემოწმება';ru='Проверить доступ к веб-сервису';en='Check access to web service'"),
			НСтр("ru=''")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "ИспользоватьПроверкуКонтрагентов";
		НоваяНастройка.Теги = НСтр("ka='კონტრაგენტები';ru='Контрагенты';en='contracting parties'");
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ПоискИУдалениеДублей",
		"КорректировкаДанных",
		НСтр("ka='დუბლების ძებნა და წაშლა';ru='Поиск и удаление дублей';en='Find and delete duplicates'"),
		НСтр("ka='მსგავსი ელემენტების ძებნა შედარების მიცემული პირობების მიხედვით.';ru='Поиск похожих элементов по заданным условиям сравнения.';en='Find similar items on the set of comparison criteria.'"),
		"e1cib/app/Обработка.ПоискИУдалениеДублей"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если РежимРаботы.ЭтоАдминистраторПрограммы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ГрупповоеИзменениеРеквизитов",
			"КорректировкаДанных",
			НСтр("ka='რეკვიზიტების ჯგუფური ცვლილება';ru='Групповое изменение реквизитов';en='Bulk change details'"),
			НСтр("ka='რეკვიზიტების და ცხრილების შეცვლა არჩეულ ელემენტებში.';ru='Изменение реквизитов и табличных частей в выбранных элементах.';en='Changes in details and parts table to selected elements.'"),
			"e1cib/app/Обработка.ГрупповоеИзменениеРеквизитов"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторПрограммы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ГрупповоеПерепроведениеДокументов",
			"КорректировкаДанных",
			НСтр("ka='დოკუმენტების ჯგუფური ხელახლა გატარება';ru='Групповое перепроведение документов';en='Group reposting of documents'"),
			НСтр("ka='დამუშავებაზე გადასვლა, რომელიც განკუთვნილია დოკუმენტების ხელახლა, ჯგუფურად გასატარებლად.';ru='Переход к обработке, предназначеной для группового перепроведения документов.';en='The transition to processing for the group reposting of documents.'"),
			"e1cib/app/Обработка.ГрупповоеПерепроведениеДокументов"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОчисткаИсторииОбсуждений",
		"КорректировкаДанных",
		НСтр("ka='განხილვის ისტორიის გასუფთავება';ru='Очистка истории обсуждений';en='Cleaning discussions stories'"),
		НСтр("ka='ობიექტების ცვლილების ისტორიის და განხილვებში მომხმარებელთა შეტყობინებების წაშლა.';ru='Удаление истории изменений объектов и сообщений пользователей в обсуждениях.';en='Deleting the history of changes to objects and users posts in the discussion.'"),
		"e1cib/app/Обработка.ОчисткаИсторииОбсуждений"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьДокументыКорректировкиРегистров",
		"КорректировкаДанных",
		НСтр("ka='დოკუმენტების სია ""რეგისტრების კორექტირება""';ru='Список документов ""Корректировка регистров""';en='The list of documents ""registers Adjustment""'"),
		НСтр("ka='დოკუმენტების სია ""რეგისტრების კორექტირებაზე"" გადასვლა';ru='Переход к списку документов ""Корректировка регистров"".';en='Access the list of documents ""Adjustment registers.""'"),
		"e1cib/list/Документ.КорректировкаРегистров"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"МакетыПечатныхФорм",
		"ПечатныеФормыОтчетыОбработки",
		НСтр("ka='საბეჭდი ფორმების მაკეტები';ru='Макеты печатных форм';en='Layouts of printed forms'"),
		НСтр("ka='დოკუმენტების ბეჭდური ფორმების მაკეტების გამართვა.';ru='Настройка макетов печатных форм документов.';en='Setting printing forms of documents layouts.'"),
		"e1cib/list/РегистрСведений.ПользовательскиеМакетыПечати"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"ПодменюПечать",
		"ПечатныеФормыОтчетыОбработки",
		НСтр("ru='Подменю ""Печать""';en='Sub-menu ""Print""'"),
		НСтр("ka='ფორმებში ბეჭდვის ბრძანებების ხილვადობის გამართვა.';ru='Настройка видимости команд печати в формах.';en='Setting the visibility of the teams in the print forms.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьВариантыОтчетов",
		"ПечатныеФормыОтчетыОбработки",
		НСтр("ka='ანგარიშგებები კონფიგურაციები';ru='Отчеты конфигурации';en='configuration reports'"),
		НСтр("ka='ანგარიშგებების ყველა ვარიანტის სიის ნახვა, ანგარიშგების გამართვები ხელმისაწვდომია კონტექსტური მენიუდან.';ru='Просмотр списка всех вариантов отчетов, настройки отчета доступны через контекстное меню.';en='View a list of all reports option, the report settings are available via the context menu.'"),
		"e1cib/command/ОбщаяКоманда.ПанельОтчетов"
	);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если РежимРаботы.Локальный Или РежимРаботы.Автономный Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ИспользоватьДополнительныеОтчетыИОбработки",
			"ПечатныеФормыОтчетыОбработки",
			НСтр("ka='დამატებითი ანგარიშგებები და დამუშავებები';ru='Дополнительные отчеты и обработки';en='Advanced reporting and processing'"),
			НСтр("ka='გარე ბეჭდური ფორმების, ანგარიშგებების და დამუშავებების გამოყენება პროგრამაში გათვალისწინებული დამატებით.';ru='Использование внешних печатных форм, отчетов и обработок в дополнение к предусмотренным в программе.';en='The use of external printing of forms, reports and data processors, in addition to those provided for in the program.'")
		);
		НоваяНастройка.ОбновлятьИнтерфейс = Истина;
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторСистемы;
	КонецЕсли;
	
	Если РежимРаботы.Локальный Или РежимРаботы.Автономный Или Константы.ИспользоватьДополнительныеОтчетыИОбработки.Получить() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ОткрытьДополнительныеОтчетыИОбработки",
			"ПечатныеФормыОтчетыОбработки",
			НСтр("ka='დამატებითი ანგარიშგებები და დამუშავებები';ru='Дополнительные отчеты и обработки';en='Advanced reporting and processing'"),
			НСтр("ka='პროგრამაში გათვალისწინებულის დამატებით გარე ბეჭდური ფორმების, ანგარიშგებების და დამუშავებების ჩართვა.';ru='Подключение внешних печатных форм, отчетов и обработок в дополнение к предусмотренным в программе.';en='Connecting external printing forms, reports and data processors, in addition to those provided for in the program.'"),
			"e1cib/list/Справочник.ДополнительныеОтчетыИОбработки"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ИспользоватьДополнительныеОтчетыИОбработки";
		НоваяНастройка.Зависимости = "ИспользоватьДополнительныеОтчетыИОбработки";
	КонецЕсли;
	
	Если Не РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ОбновитьОтчеты",
			"ПечатныеФормыОтчетыОбработки",
			НСтр("ka='ანგარიშგებების განახლება';ru='Обновить отчеты';en='update reports'"),
			НСтр("ru='Обновление настроек встроенных и дополнительных отчетов.';en='Update settings built and additional reports.'"),
			"e1cib/command/ОбщаяКоманда.ОбновитьОтчеты"
		);
		НоваяНастройка.ДобавлятьОтступ = Истина;
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"УниверсальныйОтчет",
		"ПечатныеФормыОтчетыОбработки",
		НСтр("ka='უნივერსალური ანგარისგება';ru='Универсальный отчет';en='universal report'"),
		НСтр("ka='უნივერსალური ანგარიშგება ცნობარების, დოკუმენტების, რეგისტრების და სხვათა მიხედვით.';ru='Универсальный отчет по справочникам, документам, регистрам и т.д.';en='Universal report directories, documents, registers, etc.'"),
		"e1cib/app/Отчет.УниверсальныйОтчет"
	);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	Если РассылкаОтчетов.ПравоДобавления() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ОткрытьРассылкиОтчетов",
			"ПечатныеФормыОтчетыОбработки",
			НСтр("ka='ანგარიშგებების დაგზავნა';ru='Рассылки отчетов';en='mailing reports'"),
			НСтр("ka='ანგარიშგებების დაგზავნის სიის გამართვა, გაგზავნა მოთხოვნით ან ავტომატურად განრიგის მიხედვით.';ru='Настройка списка рассылок отчетов, отправка по требованию или автоматически по расписанию.';en='Configuring report mailing list, send on-demand or automatically on schedule.'"),
			"e1cib/list/Справочник.РассылкиОтчетов"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если Не СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"РасширенияПрограммы",
			"ПечатныеФормыОтчетыОбработки",
			НСтр("ka='პროგრამის შესაძლებლობების გაფართოება';ru='Расширение возможностей программы';en=""The expansion of the program's features"""),
			НСтр("ka='შემდეგი გაფართოებების შეერთება: ნაწილების, ანგარიშგებების და დამუშავებების პროგრამაში გათვალისწინებულების დამატებად.';ru='Подключение расширений: разделов, отчетов и обработок в дополнение к предусмотренным в программе.';en='Connection extensions sections, reports and data processors, in addition to those provided for in the program.'")
		);
		НоваяНастройка.ДобавлятьОтступ = Истина;
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьНастройкиСистемнойУчетнойЗаписиЭП",
		"Органайзер",
		НСтр("ka='ფოსტის სისტემური სააღრიცხვო ჩანაწერის გამართვა';ru='Настройка системной учетной записи почты';en='Setting up the system mail account'"),
		НСтр("ka='ელექტრონული ხელმოწერა';ru='Электронная подпись';en='Electronic signature'"),
		"e1cib/command/ОбщаяКоманда.НастройкаСистемнойУчетнойЗаписиЭлектроннойПочты"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='მოვლენა';ru='Событие';en='Event'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьУчетныеЗаписиЭлектроннойПочты",
		"Органайзер",
		НСтр("ka='ელექტრონული ფოსტის სააღრიცხვო ჩანაწერები';ru='Учетные записи электронной почты';en='E-mail Accounts'"),
		НСтр("ka='ელექტრონული ფოსტის სააღრიცხვო ჩანაწერების გამართვა.';ru='Настройка учетных записей электронной почты.';en='Setting up e-mail accounts.'"),
		"e1cib/list/Справочник.УчетныеЗаписиЭлектроннойПочты"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='მოვლენა';ru='Событие';en='Event'");
	
	Если Не РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"АвтоматическиЗагружатьПочту",
			"Органайзер",
			НСтр("ka='ფოსტის ავტომატური ჩატვირთვა';ru='Автоматически загружать почту';en='Automatically download mail'"),
			НСтр("ka='განრიგის მიხედვით ფოსტის ავტომატური ჩატვირთვა.';ru='Автоматическая загрузка почты по расписанию.';en='Automatic download of mail on a schedule.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.Теги = НСтр("ka='მოვლენა';ru='Событие';en='Event'");
	КонецЕсли;
	
	Если Не РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"АвтоматическиЗагружатьЭлектроннуюПочтуРасписание",
			"Органайзер",
			НСтр("ka='განრიგი';ru='Расписание';en='schedule'"),
			НСтр("ka='განრიგის გამართვა ელექტრონული ფოსტის ჩასატვირთად.';ru='Настройка расписания для загрузки электронной почты.';en='Setting up a schedule to download e-mail.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "АвтоматическиЗагружатьПочту";
		НоваяНастройка.Зависимости = "АвтоматическиЗагружатьПочту";
		НоваяНастройка.Теги = НСтр("ka='მოვლენა';ru='Событие';en='Event'");
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НапоминанияПользователей",
		"Органайзер",
		НСтр("ka='შეხსენებები მომხმარებლებს';ru='Напоминания пользователей';en='reminders users'"),
		НСтр("ka='ყველა მომხმარებლის ყველა შეხსენების სიაზე გადასვლა. ინსტრუმენტი განკუთვნილია დანართების ადმინისტრატორებისთვის.';ru='Переход к списку всех напоминаний всех пользователей. Инструмент предназначен для администраторов приложений.';en='Open a list of all reminders of all users. The tool is intended for application administrators.'"),
		"e1cib/list/РегистрСведений.НапоминанияПользователя"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"НастройкаОтправкиSMS",
		"Органайзер",
		НСтр("ka='SMS-ის გაგზავნის გამართვა';ru='Настройка отправки SMS';en='Setting sending SMS'"),
		НСтр("ka='ეს გამართვა გამოიყენება პროგრამიდან SMS შეტყობინებების გასაგზავნად.';ru='Эта настройка используется для отправки SMS сообщений из программы.';en='This setting is used to send SMS messages from the program.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"Синхронизации",
		"Органайзер",
		НСтр("ru='Синхронизации Outlook, iCal, CalDav и пр.';en='Synchronize Outlook, iCal, CalDav and others.'"),
		НСтр("ru='В данный момент реализована синхронизация с контактной книгой и календарями Google. Отметьте этот пункт, если вы хотите, чтобы 1С:УНФ синхронизировалось с контактной книгой и календарем вашего iPhone.';en='Currently implemented synchronization with contact book and Google calendars. Check this box if you want to 1C: UNF synchronized with the contact and calendar to your iPhone.'")
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Потенциальная = Истина;
	НоваяНастройка.Теги = НСтр("ka='შემთხვევა(მოვლენა) , საკონტაქტო პირები';ru='Событие,Контактные лица';en='Event Contacts'");
	
	Если Не РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ХранитьФайлыВТомахНаДиске",
			"НастройкиРаботыСФайлами",
			НСтр("ka='ფაილების შენახვა ტომებში დისკზე';ru='Хранить файлы в томах на диске';en='Store files on disk volumes'"),
			НСтр("ka='არჩევანი საინფორმაციო ბაზაში ან დისკზე ტომებში ფაილების შენახვას შორის.';ru='Выбор между хранением файлов в информационной базе или в томах на диске.';en='The choice between keeping files in the information database or on disk volumes.'")
		);
		НоваяНастройка.ОбновлятьИнтерфейс = Истина;
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если Не РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ТомаХраненияФайлов",
			"НастройкиРаботыСФайлами",
			НСтр("ka='ფაილების შენახვის ტომები';ru='Тома хранения файлов';en='Volume storage files'"),
			НСтр("ka='ფაილურ სერვერზე ფაილების შესანახ ტომებთან (საქაღალდეებთან) შეერთების გამართვა.';ru='Настройка подключения к томам (папкам) хранения файлов на файловом сервере.';en='Configuring the connection to the volumes (folders) store the files on a file server.'"),
			"e1cib/list/Справочник.ТомаХраненияФайлов"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
		НоваяНастройка.ВместеС = "ХранитьФайлыВТомахНаДиске";
		НоваяНастройка.Зависимости = "ХранитьФайлыВТомахНаДиске";
	КонецЕсли;
	
	Если РежимРаботы.Локальный Или РежимРаботы.Автономный Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "МаксимальныйРазмерФайла";
		НоваяНастройка.Раздел			= "НастройкиРаботыСФайлами";
		НоваяНастройка.Представление	= НСтр("ka='ფაილის მაქსიმალური ზომა (მბაიტი)';ru='Максимальный размер файла (Мбайт)';en='Maximum file size (MB)'");
		НоваяНастройка.Описание			= НСтр("ka='მითითებულ ზომაზე დიდი ფაილების ჩატვირთვის შეზღუდვა.';ru='Ограничение загрузки файлов, превышающих указанный размер.';en='Restrict File Download, exceeding a specified size.'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Число");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаРегулирования", Истина);
		НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
		НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 8);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если Не (РежимРаботы.Локальный Или РежимРаботы.Автономный) Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "МаксимальныйРазмерФайлаОбластиДанных";
		НоваяНастройка.Раздел			= "НастройкиРаботыСФайлами";
		НоваяНастройка.Представление	= НСтр("ka='ფაილის მაქსიმალური ზომა (მბაიტი)';ru='Максимальный размер файла (Мбайт)';en='Maximum file size (MB)'");
		НоваяНастройка.Описание			= НСтр("ka='მითითებულ ზომაზე დიდი ფაილების ჩატვირთვის შეზღუდვა.';ru='Ограничение загрузки файлов, превышающих указанный размер.';en='Restrict File Download, exceeding a specified size.'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Число");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаРегулирования", Истина);
		НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
		НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 8);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкаОчисткиФайлов",
		"НастройкиРаботыСФайлами",
		НСтр("ka='ფაილების გასუფთავების გამართვები';ru='Настройка очистки файлов';en='Configuring file cleanup'"),
		НСтр("ka='ფორმაზე გადასვლა, რომელიც იძლევა მოძველებული მიერთებული ფაილების ავტომატური წაშლის განრიგის გამართვის საშუალებას';ru='Переход к форме, которая позволяет настроить расписание автоматического удаления устаревших присоединенных файлов';en='The transition to a form that allows you to set a schedule for automatic removal of obsolete attachments'"),
		"e1cib/list/РегистрСведений.НастройкиОчисткиФайлов"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "СписокРасширенийТекстовыхФайлов";
	НоваяНастройка.Раздел			= "НастройкиРаботыСФайлами";
	НоваяНастройка.Представление	= НСтр("ka='ტექსტური ფაილების გაფრთოებები';ru='Расширения текстовых файлов';en='Extension text files'");
	НоваяНастройка.Описание			= НСтр("ka='ტექსტური მონაცემების შემცველი ფაილების გაფართოებები (მიეთითება ""გამოტოვებით"")';ru='Расширения файлов, содержащих текстовые данные (указываются через ""пробел"").';en='Extensions of files containing text data (indicated by the ""gap"").'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 40);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "СписокРасширенийФайловOpenDocumentОбластиДанных";
	НоваяНастройка.Раздел			= "НастройкиРаботыСФайлами";
	НоваяНастройка.Представление	= НСтр("ka='ფაილების გაფართოებები Open Document';ru='Расширения файлов Open Document';en='File extensions Open Document'");
	НоваяНастройка.Описание			= НСтр("ka='დოკუმენტების ღია ფორმატის (ODF) ფაილების გაფართოებები საოფისე დანართებისთვის (მიეთითება ""გამოტოვება""-თი).';ru='Расширения файлов открытого формата документов (ODF) для офисных приложений (указываются через ""пробел"").';en='Expansion of an open format document files (the ODF) for office applications (indicated by ""blank"").'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 40);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ЗапрещатьЗагрузкуФайловПоРасширению",
		"НастройкиРаботыСФайлами",
		НСтр("ka='გაფართოებებიანი ფაილების ჩატვირთვის აკრძალვა';ru='Запрет загрузки файлов с расширениями';en='Ban download files with extensions'"),
		НСтр("ru=''")
	);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 30);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "СписокЗапрещенныхРасширенийОбластиДанных";
	НоваяНастройка.Раздел			= "НастройкиРаботыСФайлами";
	НоваяНастройка.Представление	= НСтр("ka='აკრძალული გაფართოებების სია';ru='Список запрещенных расширений';en='The list of banned extensions'");
	НоваяНастройка.Описание			= НСтр("ka='ფაილების გაფართოებები რომლებისთვის აკრძალული იქნება პროგრამის საქაღალდეებში ჩატვირთვა (მიეთითება ""გამოტოვება""-თი).';ru='Расширения файлов, для которых будет запрещена загрузка в папки программы (указываются через ""пробел"").';en='File extensions, which will be banned in the loading of the program folder (indicated by ""blank"").'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("ПодсказкаВвода", "Список запрещенных расширений");
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 40);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ЗапрещатьЗагрузкуФайловПоРасширению";
	НоваяНастройка.Зависимости = "ЗапрещатьЗагрузкуФайловПоРасширению";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьЭлектронныеПодписи2",
		"НастройкиРаботыСФайлами",
		НСтр("ka='ელექტრონული ხელმოწერა';ru='Электронная подпись';en='Electronic signature'"),
		НСтр("ka='მონაცემთა ხელმოწერის ნებართვა მათი უცვლელობის გარანტიისთვის და მონაცემთა დაშიფრვის ნებართვა დაშვების საიმედოდ შესაზღუდავად.';ru='Разрешить подписание данных для гарантии их неизменности и шифрование данных для надежного ограничения доступа.';en='Allow signing data to ensure their constancy and data encryption for secure access restrictions.'")
	);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьШифрование",
		"НастройкиРаботыСФайлами",
		НСтр("ka='დაშიფრვა';ru='Шифрование';en='Encryption'"),
		НСтр("ru=''")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"НастройкиКриптографии",
		"НастройкиРаботыСФайлами",
		НСтр("ka='ელექტრონული ხელმოწერის და დაშიფრვის გამართვები';ru='Настройки электронной подписи и шифрования';en='Settings of electronic signatures and encryption'"),
		НСтр("ka='პარამეტრების გამართვა კრიპტოგრაფიის საშუალებების გამოსაყენებლად: ელექტრონული ხელმოწერის და დაშიფრვის.';ru='Настройка параметров для использования средств криптографии: электронной подписи и шифрования.';en='Setting parameters for the use of cryptography: electronic signature and encryption.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ИспользоватьШифрование,ИспользоватьЭлектронныеПодписи2";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"СинхронизироватьФайлы",
		"НастройкиРаботыСФайлами",
		НСтр("ka='ფაილების სინქრონიზირება Cloud სერვისებით';ru='Синхронизировать файлы с облачными сервисами';en='Sync files with cloud services'"),
		НСтр("ka='სინქრონიზაცია იანდექს.დისკთან, Box-თან და ა.შ. ფაილების რედაქტირების გასამარტივებლად.';ru='Синхронизация с Яндекс.Диск, Box и т.д. для упрощения редактирования файлов.';en='Synchronization with Yandex.Disk, Box, etc. to simplify editing.'")
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='ფაილები';ru='Файлы';en='files'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"НастройкиСинхронизацииФайлов",
		"НастройкиРаботыСФайлами",
		НСтр("ka='ფაილების სინქრონიზაციის გამართვები';ru='Настройки синхронизации файлов';en='Settings file synchronization'"),
		НСтр("ka='ფაილების სინქრონიზაციის წესების გამართვა.';ru='Настройка правил синхронизации файлов.';en='Setting rules file synchronization.'"),
		"e1cib/list/РегистрСведений.НастройкиСинхронизацииФайлов"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "СинхронизироватьФайлы";
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ФункциональнаяОпцияИспользоватьПодключаемоеОборудование",
		"ПодключаемоеОборудование",
		НСтр("ka='შესაერთებელი მოწყობილობა';ru='Подключаемое оборудование';en='Device Connectivity'"),
		НСтр("ka='ჩართვის მეშვეობით შესაძლებელი ხდება მუშაობის ორგანიზება გარე შესაერთებელი მოწყობილობის - სასწორის, ეტიკეტების პრინტერის, მონაცემთა შეკრების ტერმინალების და ა.შ. გამოყენებით.';ru='Включение позволяет организовать работу с использованием внешнего подключаемого оборудования: весов, принтеров этикеток, терминалов сбора данных и т.д.';en='Turning allows to organize work using external equipment to be connected: weights label printers, data terminals, etc.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Теги = НСтр("ka='მყიდველის შეკვეთა,ოპერაცია საგადახდო ბარათებით,სალაროში შემოსვლა,საწყისი ნაშთები სხვა დანარჩენი,ანგარიშსწორების საწყისი ნაშთები,საქონლის საწყისი ნაშთები,საწყისი ნაშთების შეყვანა';ru='Заказ покупателя,Операция по платежным картам,Поступление в кассу,Начальные остатки прочее,Начальные остатки расчетов,Начальные остатки товаров,Ввод начальных остатков';en=""Buyer's order, transactions on payment cards, receipts to the cashier, the opening balance etc., the opening balance of payments, the opening balance of goods Entering opening balances""");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьПодключаемоеОборудование",
		"ПодключаемоеОборудование",
		НСтр("ka='შესაერთებელი მოწყობილობა';ru='Подключаемое оборудование';en='Device Connectivity'"),
		НСтр("ka='გამოყენებადი მოწყობილობის შეერთება და გამართვა.';ru='Подключение и настройка используемого оборудования.';en='Connecting and setting up the equipment used.'"),
		"e1cib/command/Справочник.ПодключаемоеОборудование.Команда.ОткрытьПодключаемоеОборудование"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование";
	НоваяНастройка.Теги = НСтр("ka='მყიდველის შეკვეთა,საწყისი ნაშთი სხვა დანარჩენი,ანგარიშსწორებების საწყისი ნაშთი,საქონლების საწყისი ნაშთი,საწყისი ნაშთების შეყვანა';ru='Заказ покупателя,Начальные остатки прочее,Начальные остатки расчетов,Начальные остатки товаров,Ввод начальных остатков';en='The order of the buyer, the opening balance etc., the opening balance of payments, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ОткрытьРабочиеМеста",
		"ПодключаемоеОборудование",
		НСтр("ka='სამუშაო ადგილების გახსნა';ru='Открыть рабочие места';en='Open jobs'"),
		НСтр("ka='სამუშაო ადგილების სიაზე გადასვლა.';ru='Переход к списку рабочих мест.';en='Access the list of jobs.'"),
		"e1cib/list/Справочник.РабочиеМеста"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование";
	НоваяНастройка.Теги = НСтр("ka='მყიდველის შეკვეთა,საწყისი ნაშთი სხვა დანარჩენი,ანგარიშსწორებების საწყისი ნაშთი,საქონლების საწყისი ნაშთი,საწყისი ნაშთების შეყვანა';ru='Заказ покупателя,Начальные остатки прочее,Начальные остатки расчетов,Начальные остатки товаров,Ввод начальных остатков';en='The order of the buyer, the opening balance etc., the opening balance of payments, the opening balance of goods Entering opening balances'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьОбменСПодключаемымОборудованиемOffline",
		"ПодключаемоеОборудование",
		НСтр("ka='გაცვლა შესაერთებელ მოწყობილობასთან Offline';ru='Обмен с подключаемым оборудованием offline';en='Exchange with plug equipments offline'"),
		НСтр("ka='ოპციის ჩართვა საჭიროა სსა-ის სალაროების, ეტიკეტების მბეჭდავი სასწორის გამოსაყენებლად.';ru='Включение опции необходимо для использования касс ККМ, весов с печатью этикеток.';en='Enable the option required to use cash registers cash register, scales with label printing.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование";
	НоваяНастройка.Теги = НСтр("ka='მყიდველის შეკვეთა';ru='Заказ покупателя';en='Заказ покупателя'");
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ПравилаОбменаСПодключаемымОборудованием",
		"ПодключаемоеОборудование",
		НСтр("ka='შესაერთებელ მოწყობილობასთან გაცვლის წესები';ru='Правила обмена с подключаемым оборудованием';en='Rules of exchange with the equipment you are connecting'"),
		НСтр("ka='გაცვლის წესები გამოიყენება OffLine რეჟიმში მომუშავე სსა სალაროებთან და ელექტრონულ სასწორებთან მუშაობისას.';ru='Правила обмена используются при работе с кассами ККМ и электронными весами, которые работают в режиме OffLine.';en='Rules of exchange used at work with cash registers cash register and electronic scales that operate in OffLine mode.'"),
		"e1cib/list/Справочник.ПравилаОбменаСПодключаемымОборудованиемOffline"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	НоваяНастройка.ВместеС = "ИспользоватьОбменСПодключаемымОборудованиемOffline";
	НоваяНастройка.Зависимости = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование,ИспользоватьОбменСПодключаемымОборудованиемOffline";
	НоваяНастройка.Теги = НСтр("ka='მყიდველის შეკვეთა';ru='Заказ покупателя';en='Заказ покупателя'");
	
	Если РежимРаботы.МодельСервиса И Константы.ИспользоватьОбменССерверомШтрихМ.Получить()  Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ИспользоватьОбменСКассойMinikassir",
			"ПодключаемоеОборудование",
			НСтр("ru='Обмен с кассой ШТРИХ-MPAY-Ф';en='Communication with the cash register BAR-MPAY-F'"),
			НСтр("ru='Обмен с автономными кассами ШТРИХ-MPAY-Ф. Вместе с этой опцией будет включена опция Розничные продажи. '")
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ПодробнееОПодключенииКассКФискальномуРегистратору",
		"ПодключаемоеОборудование",
		НСтр("ka='სალაროების მიერთება ფისკალური მონაცემების ოპერატორთან (54-ФЗ)';ru='Подключить кассы к оператору фискальных данных (54-ФЗ)';en='Connect the cash to the operator the fiscal data (FL-54)'"),
		НСтр("ru=''"),
		"http://v8.1c.ru/cnt.jsp/:kd_unf:/https://portal.1c.ru/applications/56"
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ПодробнееО54ФЗ",
		"ПодключаемоеОборудование",
		НСтр("ka='ყველაფერი 54-ФЗ-ს შესახებ';ru='Все о 54-ФЗ и переходе на онлайн-ККТ';en='All of the 54-FZ and the transition to online CCV'"),
		НСтр("ru=''"),
		"http://v8.1c.ru/cnt.jsp/:kd_unf:/http://v8.1c.ru/kkt/"
	);
	НоваяНастройка.ПравоРедактирования = Истина;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
		"ЗащитаПерсональныхДанных",
		"ЗащитаПерсональныхДанных",
		НСтр("ka='პერსონალური მონაცემების დაცვა';ru='Защита персональных данных';en='Protection of personal information'"),
		НСтр("ka='პროგრამის არჩეული ობიექტების პერსონალურ მონაცემებთან მიმართვების ნახვა.';ru='Просмотр обращений к персональным данным выбранных объектов программы.';en='View appeals to the personal data of the selected objects the program.'"),
		"e1cib/command/Обработка.ЗащитаПерсональныхДанных.Команда.ЗащитаПерсональныхДанных"
	);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
		"НастройкиРегистрацииСобытийДоступаКПерсональнымДанным",
		"ЗащитаПерсональныхДанных",
		НСтр("ka='პერსონალურ მონაცემებთან წვდომის მოვლენების რეგისტრაციის გამართვები';ru='Настройки регистрации событий доступа к персональным данным';en='Event Log Settings to access personal data'"),
		НСтр("ka='დაშვების მოვლენების რეგისტრაცია ""პერსონალური მონაცემების შესახებ"" 27.07.2006-ის კანონის მოთხოვნის შესაბამისად.';ru='Регистрация событий доступа в соответствии с требованиями Федерального закона от 27.07.2006 N152-ФЗ ""О персональных данных""';en='Register access events in accordance with the requirements of the Federal Law dated 27.07.2006 N152-FZ ""On Personal Data""'")
	);
	НоваяНастройка.СвойстваЭлемента.Вставить("Высота", 1);
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторСистемы;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "ОтправлятьДанныеВЦентрМониторинга";
		НоваяНастройка.Раздел			= "ОценкаПроизводительностиИЦентрМониторинга";
		НоваяНастройка.Представление	= НСтр("ka='მონაცემთა გაგზავნა მონიტორინგის ცენტრში';ru='Отправлять данные в центр мониторинга';en='Send data to the monitoring center'");
		НоваяНастройка.Описание			= НСтр("ru='Статистические отчеты позволяют нам определить наиболее востребованные механизмы в программе. Их мы стараемся улучшить в первую очередь."
""
"Собранные сведения являются обезличенными и содержат только статистические показатели. Подготовка и отправка отчетов не замедлит работу программы.';ka='სტატისტიკური ანგარიშგებები იძლევა პროგრამაში არსებული ყველაზე მოთხოვნადი მექანიზმების დადგენის საშუალებას. პირველ რიგში, მათ გაუმჯობესებაზე ვზრუნავთ ჩვენ."
""
"შეგროვებული ინფორმაცია არის გაუპიროვნებელი და მხოლოდ სტატისტიკურ მაჩვენებლებს შეიცავს. ანგარიშგებების მომზადება და გაგზავნა პროგრამის მუშაობას არ შეანელებს.'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Число");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеПереключателя);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.СвойстваЭлемента.Вставить("КоличествоКолонок", 1);
		НоваяНастройка.СвойстваЭлемента.Вставить("СписокВыбора", Новый СписокЗначений);
		НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(0, НСтр("ka='ფირმა ""1C""-ში ინფორმაციის გაგზავნის ნებართვა';ru='Разрешить отправку сведений в фирму ""1С""';en='Allow the sending of information to the firm ""1C""'"));
		НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(1, НСтр("ka='გარეშე შემმუშავებლისთვის ინფორმაციის გაგზავნის ნებართვა';ru='Разрешить отправку сведений стороннему разработчику';en='Allow sending information that third party'"));
		НоваяНастройка.СвойстваЭлемента.СписокВыбора.Добавить(2, НСтр("ka='ინფორმაციის გაგზავნის აკრძალვა';ru='Запретить отправку сведений';en='Prohibit send information'"));
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "АдресСервисаЦентраМониторинга";
		НоваяНастройка.Раздел			= "ОценкаПроизводительностиИЦентрМониторинга";
		НоваяНастройка.Представление	= НСтр("ka='მონიტორინგის ცენტრის სერვისის მისამართი';ru='Адрес сервиса центра мониторинга';en='Address service monitoring center'");
		НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Строка");
		НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.СвойстваЭлемента.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
		НоваяНастройка.СвойстваЭлемента.Вставить("ПодсказкаВвода", НСтр("ka='სერვისის მისამართი';ru='Адрес сервиса';en='service address'"));
		НоваяНастройка.СвойстваЭлемента.Вставить("АвтоМаксимальнаяШирина", Ложь);
		НоваяНастройка.СвойстваЭлемента.Вставить("МаксимальнаяШирина", 60);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "ОтправлятьДанныеВЦентрМониторинга";
		НоваяНастройка.Зависимости = "ОтправлятьДанныеВЦентрМониторинга";
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"ВыполнятьЗамерыПроизводительности",
			"ОценкаПроизводительностиИЦентрМониторинга",
			НСтр("ka='მწარმოებლურობის აზომვების შესრულება';ru='Выполнять замеры производительности';en='Carry out performance measurements'"),
			НСтр("ka='პროგრამის ინტეგრალური მწარმოებლურობის შეფასება APDEX-ის მეთოდიკით.';ru='Оценка интегральной производительности программы по методике APDEX.';en='Qualification integral performance APDEX procedure program.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"ОценкаПроизводительности",
			"ОценкаПроизводительностиИЦентрМониторинга",
			НСтр("ka='მწარმოებლურობის მაჩვენებლები';ru='Показатели производительности';en='performance indicators'"),
			НСтр("ka='მწარმოებლურობის აზომვების შედეგების ნახვა და შეფასება.';ru='Просмотр и оценка результатов замеров производительности.';en='Viewing and evaluation of the results of measurements of performance.'"),
			"e1cib/app/Обработка.ОценкаПроизводительности"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "ВыполнятьЗамерыПроизводительности";
		НоваяНастройка.Зависимости = "ВыполнятьЗамерыПроизводительности";
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"НастройкиОценкиПроизводительности",
			"ОценкаПроизводительностиИЦентрМониторинга",
			НСтр("ka='მწარმოებლურობის შეფასების გამართვები';ru='Настройки оценки производительности';en='Setting performance evaluation'"),
			НСтр("ka='მწარმოებლურობის შეფასების პარამეტრების გამართვები.';ru='Настройки параметров оценки производительности.';en='Setting performance evaluation parameters.'"),
			"e1cib/command/Обработка.ОценкаПроизводительности.Команда.НастройкиОценкиПроизводительности"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "ВыполнятьЗамерыПроизводительности";
		НоваяНастройка.Зависимости = "ВыполнятьЗамерыПроизводительности";
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"РегламентныеИФоновыеЗадания",
			"РегламентныеОперации",
			НСтр("ka='რეგალამენტური და ფონური დავალებები';ru='Регламентные и фоновые задания';en='Routine and background jobs'"),
			НСтр("ka='სარეგლამენტო დავალებების დაგეგმვა და გაშვება.';ru='Планирование и запуск регламентных заданий.';en='Planning and launch of scheduled tasks.'"),
			"e1cib/app/Обработка.РегламентныеИФоновыеЗадания"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"РазблокироватьРаботуСВнешнимиРесурсами",
			"РегламентныеОперации",
			НСтр("ka='გარე რესურსებთან მუშაობა';ru='Разблокировать работу с внешними ресурсами';en='Unlock work with external resources'"),
			НСтр("ka='განრგის მიხედვით შესრულებულ ყველა გარე რესურსთან მუშაობა (მონაცემთა სინქრონიზაცია, ფოსტის გაგზავნა და მისთ.) დაბლოკილია ძირითად საინფორმაციო ბაზასთან კონფლიქტების აღკვეთის მიზნით.';ru='Работа со всеми внешними ресурсами (синхронизация данных, отправка почты и т.п.), выполняемая по расписанию заблокирована для предотвращения конфликтов с основной информационной базой.';en='Work with all external resources (data synchronization, sending mail, etc.) is scheduled locked to prevent conflicts with the basic information base.'"),
			"e1cib/command/ОбщаяКоманда.РазблокироватьРаботуСВнешнимиРесурсами"
		);
		НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторПрограммы И (РежимРаботы.Локальный Или РежимРаботы.Автономный) Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуГиперссылкаНавигации(ТаблицаНастроек,
			"УправлениеИтогамиИАгрегатами",
			"РегламентныеОперации",
			НСтр("ka='ჯამების და აგრეგატების მართვა';ru='Управление итогами и агрегатами';en='Management results and units'"),
			НСтр("ru='Установка периода рассчитанных итогов."
"Перестройка, заполнение и оптимизация агрегатов.';ka='გამოანგარიშებული ჯამების პერიოდის დაყენება. აგრეგატების გარდაქმნა, შევსება და ოპტიმიზაცია.'"),
			"e1cib/app/Обработка.УправлениеИтогамиИАгрегатами"
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуКоманда(ТаблицаНастроек,
			"УправлениеПолнотекстовымПоискомИИзвлечениемТекстов",
			"РегламентныеОперации",
			НСтр("ka='სრულტექსტიანი ძებნის მართვა';ru='Управление полнотекстовым поиском';en='Manage full-text search'"),
			НСтр("ru='Обновление и очистка индекса полнотекстового поиска."
"Управление извлечением текстов из файлов.';ka='სრულტექსტიანი ძებნის ინდექსის განახლება და გასუფთავება. ფაილებიდან ტექსტების ამოღების მართვა.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если Не РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
			"АвтоматическоеУдалениеПомеченных",
			"РегламентныеОперации",
			НСтр("ka='მონიშნული ობიექტების ავტომატური წაშლა შემდეგი განრიგის მიხედვით:';ru='Автоматически удалять помеченные объекты по расписанию';en='Automatically delete marked objects on schedule'"),
			НСтр("ka='ჩართვა იძლევა მოცემული განრიგის შესაბამისად წასაშლელად მონიშნული ობიექტების ავტომატური წაშლის შესრულების საშუალებას.';ru='Включение позволяет выполнять автоматическое удаление объектов, помеченных на удаление, в соответствии с заданным расписанием.';en='Enable enables automatic deletion of objects marked for deletion in accordance with a predetermined schedule.'")
		);
		НоваяНастройка.ПравоРедактирования = Истина;
	КонецЕсли;
	
	Если Не РежимРаботы.МодельСервиса И РежимРаботы.ЭтоАдминистраторСистемы Тогда
		НоваяНастройка = ТаблицаНастроек.Добавить();
		НоваяНастройка.Идентификатор	= "УдалениеПомеченныхРасписание";
		НоваяНастройка.Раздел			= "РегламентныеОперации";
		НоваяНастройка.Представление	= НСтр("ka='განრიგი';ru='Расписание';en='schedule'");
		НоваяНастройка.ТипЭлемента		= Тип("ДекорацияФормы");
		НоваяНастройка.СвойстваЭлемента	= Новый Структура;
		НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
		НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидДекорацииФормы.Надпись);
		НоваяНастройка.СвойстваЭлемента.Вставить("Гиперссылка", Истина);
		НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
		НоваяНастройка.ПравоРедактирования = Истина;
		НоваяНастройка.ВместеС = "АвтоматическоеУдалениеПомеченных";
		НоваяНастройка.Зависимости = "АвтоматическоеУдалениеПомеченных";
	КонецЕсли;
	
	// Kuzmich, 12.05.2019, Заполнение типа цен из настроек склада
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ЗаполнениеТипаЦенИзНастроекСклада",
		"Продажи",
		НСтр("ka='გასავლის ზედდებულში ფასების შევსება საწყობის ფასის ტიპის მიხედვით';ru='Заполнение типа цен из настроек склада';en='Filling type price of stock options'"),
		НСтр("ka='გასავლის ზედდებულში ფასების შევსება საწყობის ფასის ტიპის მიხედვით';ru='Заполнение типа цен из настроек склада';en='Filling type price of stock options'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = ИСТИНА;
	НоваяНастройка.Теги = НСтр("ka='Заказ покупателя,Счет на оплату,Расходная накладная,Продажи';ru='Заказ покупателя,Счет на оплату,Расходная накладная,Продажи';en=""Buyer's order, Invoicing, Invoice, Sales""");	
	// Kuzmich, 12.05.2019, Заполнение типа цен из настроек склада
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"СчетВыручкиВТабличнойЧасти",
		"Продажи",
		НСтр("ka='შემოსავალი რეალიზაციიდან ცხრილურ ნაწილში';ru='Счет выручки в табличной части';en='Revenue account in the dimension tables'"),
		НСтр("ka='შემოსავალი რეალიზაციიდან ცხრილურ ნაწილში';ru='Счет выручки в табличной части';en='Revenue account in the dimension tables'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = ИСТИНА;
	НоваяНастройка.Теги = НСтр("ka='Расходная накладная,Продажи';ru='Расходная накладная,Продажи';en='Sales Invoice, Sales'");	
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	// Kuzmich, 03.06.2019, Вывести в Заказ покупателя адрес покупателя из договора
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ДляЗаказаАдресКонтрагентаБратьИзДоговора",
		"Продажи",
		НСтр("ka='მყიდველის შეკვეთაში მისამართის ხელშეკრულებიდან გამოტანა';ru='Для заказа адрес контрагента брать из договора';en='Ordering address contractor to take out a contract'"),
		НСтр("ka='მყიდველის შეკვეთაში მისამართის ხელშეკრულებიდან გამოტანა';ru='Для заказа адрес контрагента брать из договора';en='Ordering address contractor to take out a contract'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = ИСТИНА;
	НоваяНастройка.Теги = НСтр("ka='Заказ покупателя,Счет на оплату,Расходная накладная,Продажи';ru='Заказ покупателя,Счет на оплату,Расходная накладная,Продажи';en=""Buyer's order, Invoicing, Invoice, Sales""");	
	// Kuzmich, 03.06.2019, Вывести в Заказ покупателя адрес покупателя из договора
	// Kuzmich, 05.06.2019, Количество знаков после запятой в цене
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор	= "КоличествоЗнаковПослеЗапятойВЦене";
	НоваяНастройка.Раздел			= "Продажи";
	НоваяНастройка.Представление	= НСтр("ka='წერტილის შემდეგ სიმბოლოების რადენობა.(0 დან 9–ამდე მნიშვნელობა. 0=2)';ru='Количество знаков после запятой в цене.(Значение от 0 до 9. 0=2)';en='Number of decimal places in price. (Value between 0 and 9. 0 = 2)'");
	НоваяНастройка.Описание			= НСтр("ru = 'Количество знаков после запятой в цене.(Значение от 0 до 9. 0=2)'; ka = 'წერტილის შემდეგ სიმბოლოების რადენობა.(0 დან 9–ამდე მნიშვნელობა. 0=2).მყიდველის შეკვეთის, შეკვეთა მომწოდებლის,გასავლის ზედდებულის,შემოსავლის ზედდებულის, მარაგების შემოსავალში აყვანისა და ელექტრონული ზედანდების დოკუმენტებში.'; en = 'Number of decimal places in price. (Value between 0 and 9. 0 = 2)'");
	НоваяНастройка.ТипРеквизита		= Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1,0));
	НоваяНастройка.ТипЭлемента		= Тип("ПолеФормы");
	НоваяНастройка.СвойстваЭлемента	= Новый Структура;
	НоваяНастройка.СвойстваЭлемента.Вставить("Заголовок", НоваяНастройка.Представление);
	НоваяНастройка.СвойстваЭлемента.Вставить("Подсказка", НоваяНастройка.Описание);
	НоваяНастройка.СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	НоваяНастройка.СвойстваЭлемента.Вставить("КнопкаРегулирования", Истина);
	НоваяНастройка.СвойстваЭлемента.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
	НоваяНастройка.СвойстваЭлемента.Вставить("Ширина", 6);
	НоваяНастройка.СвойстваЭлемента.Вставить("РастягиватьПоГоризонтали", Ложь);
	НоваяНастройка.ОбновлятьИнтерфейс = ИСТИНА;
	НоваяНастройка.ПравоРедактирования = ИСТИНА;
	НоваяНастройка.Теги = НСтр("ka='Заказ покупателя,Счет на оплату,Расходная накладная,Продажи';ru='Заказ покупателя,Счет на оплату,Расходная накладная,Продажи';en=""Buyer's order, Invoicing, Invoice, Sales""");
	// Kuzmich, 05.06.2019, Количество знаков после запятой в цене
	// Kuzmich, 20.06.2019, Печ форме ел накладная (брать дату из дату транспортировки)
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ЭлектроннаяНакладнаяДатуБратьИзДатыТранспортировки",
		"ИнтеграцияСНалоговойСлужбойГрузии",
		НСтр("ka='ელ. ზედნადების თარიღი საბ. ფორმის თარიღი წამოიღოს ტრანსპორტიბის დაწყები';ru='Эл. накладная: дату брать из даты транспортировки';en='E. bill: the date taken from the date of transport'"),
		НСтр("ka='ელ. ზედნადების თარიღი საბ. ფორმის თარიღი წამოიღოს ტრანსპორტიბის დაწყები';ru='Эл. накладная: дату брать из даты транспортировки';en='E. bill: the date taken from the date of transport'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = ИСТИНА;
	НоваяНастройка.Теги = НСтр("ka='Электронная накладная,ИнтеграцияСНалоговойСлужбойГрузии';ru='Электронная накладная,ИнтеграцияСНалоговойСлужбойГрузии';en='The electronic consignment note, IntegratsiyaSNalogovoySluzhboyGruzii'");	
	// Kuzmich, 20.06.2019, Печ форме ел накладная (брать дату из дату транспортировки)
	// Kuzmich, 20.06.2019, Вывод штрихкода в печать заказа покупателя
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ВыводШтрихкодаВПечатьЗаказаПокупателя",
		"Продажи",
		НСтр("ka='მყიდველის შეკვეთის საბეჭდ ფორმაში შტრიხკოდის გამოტანა';ru='Вывод штрихкода в печать заказа покупателя';en=""Output barcode print buyer's order"""),
		НСтр("ka='მყიდველის შეკვეთის საბეჭდ ფორმაში შტრიხკოდის გამოტანა';ru='Вывод штрихкода в печать заказа покупателя';en=""Output barcode print buyer's order""")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = ИСТИНА;
	НоваяНастройка.Теги = НСтр("ka='Заказ покупателя,Продажи';ru='Заказ покупателя,Продажи';en=""Buyer's order, Sales""");	
	//--------------------------------------------------------------------------
	// © Шишка В.В. [13 августа 2020 г.]  НАЧАЛО
	//##Перевести
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьГарантииВНарядЗаказах",
		"Продажи",
		НСтр("ka='Использовать гарантии в наряд-заказах';ru='Использовать гарантии в наряд-заказах';en='Использовать гарантии в наряд-заказах'"),
		НСтр("ru = 'Дает возможность использовать гарантии в табличных частях документа ""Наряд-заказ"".
		|'; ka = 'Дает возможность использовать гарантии в табличных частях документа ""Наряд-заказ"".'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = Истина;
	НоваяНастройка.Теги = НСтр("ka='Наряд-заказ,Продажи';ru='Наряд-заказ,Продажи';en=""Buyer's order, Sales""");	
	// © Шишка В.В. [13 августа 2020 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	// Kuzmich, 20.06.2019, Вывод штрихкода в печать заказа покупателя
	//// Kuzmich, 25.07.2019, Контролировать остатки запасов на складах при проведении документов
	//НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
	//	"КонтролироватьОстаткиЗапасовНаСкладахПриПроведении",
	//	"ОбщиеНастройки",
	//	НСтр("ka='გატარების მომენტრში ნაშთების შემოწმება';ru='Контролировать остатки запасов на складах при проведении документов';en='Control the remnants of the warehouse stock during documents'"),
	//	НСтр("ka='გატარების მომენტრში ნაშთების შემოწმება.';ru='Контролировать остатки запасов на складах при проведении документов.';en='Control the remnants of the warehouse stock during the document.'")
	//);
	//НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	////НоваяНастройка.ДобавлятьОтступ = Истина;
	//НоваяНастройка.ПравоРедактирования = ИСТИНА;
	//// Kuzmich, 25.07.2019, Контролировать остатки запасов на складах при проведении документов
	// Kuzmich, 14.08.2019, Дополнительные инструменты в табличных частях документов движения товаров
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ДополнительныеИнструментыВТЧдокументовДвиженияТоваров",
		"ОбщиеНастройки",
		НСтр("ka='საქონლის მოძრაობის დოკუმენტების ცხრილური ნაწილის დამატებითი ინსტრუმენტები';ru='Дополнительные инструменты в табличных частях документов движения товаров';en='Additional tools in the tables of this document movement of goods'"),
		НСтр("ka='საქონლის მოძრაობის დოკუმენტების ცხრილური ნაწილის დამატებითი ინსტრუმენტები.';ru='Дополнительные инструменты в табличных частях документов движения товаров.';en='Additional tools in the tables of this document movement of goods.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	//НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = ИСТИНА;
	// Kuzmich, 14.08.2019, Дополнительные инструменты в табличных частях документов движения товаров
	// Kuzmich, 14.08.2019, Использовать виды договоров
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьВидыДоговоров",
		"ОбщиеНастройки",
		НСтр("ka='ხელშეკრულებების ტიპების გამოყენება';ru='Использовать виды договоров';en='Use types of contracts'"),
		НСтр("ka='ხელშეკრულებების ტიპების გამოყენება.';ru='Использовать виды договоров.';en='Use types of contracts.'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	//НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = ИСТИНА;
	// Kuzmich, 14.08.2019, Использовать виды договоров
	// Kuzmich, 15.08.2019, ИспользоватьТоварныйЧекПоступлениеРасходКассы
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьТоварныйЧекПоступлениеРасходКассы",
		"Деньги",
		НСтр("ka='ჩგდს–გამოყენება სალაროში (შემოსავალი სალაროში, დანახარჯი სალაროდან)';ru='Использовать товарный чек (Поступление в кассу, Расход из кассы)';en='Use receipt (receipt to the cashier, flow from the cash register)'"),
		НСтр("ka='ჩგდს–გამოყენება სალაროში (შემოსავალი სალაროში, დანახარჯი სალაროდან).';ru='Использовать товарный чек (Поступление в кассу, Расход из кассы).';en='Use receipt (receipt to the cashier, flow from the cash register).'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	//НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = ИСТИНА;
	// Kuzmich, 15.08.2019, ИспользоватьТоварныйЧекПоступлениеРасходКассы
	
	//ПодольскийАИ #УникальностьХарактеристи 21.02.2023 {
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ИспользоватьУникальностьХарактеристикиПоВладельцу",
		"Компания",
		НСтр("ru = 'Использовать уникальность характеристики по владельцу'; ka = 'Использовать уникальность характеристики по владельцу'; en = 'Использовать уникальность характеристики по владельцу'")
	);
	НоваяНастройка.ОбновлятьИнтерфейс = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;
	//ПодольскийАИ #УникальностьХарактеристи 21.02.2023 }
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСлужебныхСобытий

Процедура ПриПолученииЗначенияНастройки(знач Идентификатор, Значение, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если Идентификатор = "ДействиеТекущегоЗвонкаНайденногоАбонента" Тогда
		
		Значение = ТелефонияСервер.ПолучитьНастройкиТелефонии().ДействиеТекущегоЗвонкаНайденногоАбонента;
		
	ИначеЕсли Идентификатор = "ДействиеТекущегоЗвонкаНеизвестногоАбонента" Тогда
		
		Значение = ТелефонияСервер.ПолучитьНастройкиТелефонии().ДействиеТекущегоЗвонкаНеизвестногоАбонента;
		
	ИначеЕсли Идентификатор = "ОтправкаЭлектронныхЧековПослеПробитияЧека" Тогда
		
		Значение = Число(Не Константы.ОтправкаЭлектронныхЧековПослеПробитияЧека.Получить());
		
	ИначеЕсли Идентификатор = "АвтоматическаяОтправкаЭлектронныхЧековПоРасписанию" Тогда
		
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.РассылкаЭлектронныхЧеков);
		Значение = ?(РегЗадание = Неопределено, Неопределено, РегЗадание.Использование);
		
	ИначеЕсли Идентификатор = "ИспользоватьРемонты2" Тогда
		
		Значение = Константы.ИспользоватьРемонты.Получить();
		
	ИначеЕсли Идентификатор = "ОтправлятьСлепыеКопииПисем" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПараметрыОтправкиСкрытыхКопий", "ОтправлятьСлепыеКопииПисем", Ложь);
		
	ИначеЕсли Идентификатор = "АдресПолучателяСкрытойКопии" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПараметрыОтправкиСкрытыхКопий", "АдресПолучателяСкрытойКопии", "");
		
	ИначеЕсли Идентификатор = "ИмяОтправителяSMS" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиSMS", "ИмяОтправителяSMS", "");
		
	ИначеЕсли Идентификатор = "ПерсональноеМобильноеУстройство" Тогда
		
		Значение = ТелефонияСервер.ПерсональноеМобильноеУстройство();
		
	ИначеЕсли Идентификатор = "ЗагрузкаКонтактовGoogle" Тогда
		
		ОтключенныеОбластиДоступа = РегистрыСведений.СеансовыеДанныеGoogle.ОтключенныеОбластиДоступа(Пользователи.ТекущийПользователь());
		Значение = ОтключенныеОбластиДоступа.Найти(Перечисления.ОбластиДоступаGoogle.Контакты) = Неопределено;
		Если Значение И РегистрыСведений.СчетчикиПодсказок.ПревышеноЗначение(Перечисления.ВидыПодсказок.Google, 5,,, Ложь) Тогда
			Значение = Ложь;
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "СинхронизацияКалендаряGoogle" Тогда
		
		ОтключенныеОбластиДоступа = РегистрыСведений.СеансовыеДанныеGoogle.ОтключенныеОбластиДоступа(Пользователи.ТекущийПользователь());
		Значение = ОтключенныеОбластиДоступа.Найти(Перечисления.ОбластиДоступаGoogle.Календарь) = Неопределено;
		
	ИначеЕсли Идентификатор = "ПоказыватьЗанятыеФайлыПриЗавершенииРаботы" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПрограммы", "ПоказыватьЗанятыеФайлыПриЗавершенииРаботы", Истина);
		
	ИначеЕсли Идентификатор = "СпрашиватьРежимРедактированияПриОткрытииФайла" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиОткрытияФайлов", "СпрашиватьРежимРедактированияПриОткрытииФайла", Истина);
		
	ИначеЕсли Идентификатор = "ПоказыватьПодсказкиПриРедактированииФайлов" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиОткрытияФайлов", "ПоказыватьПодсказкиПриРедактированииФайлов", Истина);
		
	ИначеЕсли Идентификатор = "ДействиеСФайламиПоДвойномуЩелчкуМыши" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиОткрытияФайлов", "ДействиеПоДвойномуЩелчкуМыши", Перечисления.ДействияСФайламиПоДвойномуЩелчку.ОткрыватьФайл);
		
	ИначеЕсли Идентификатор = "СпособСравненияВерсийФайлов" Тогда
		
		Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиСравненияФайлов", "СпособСравненияВерсийФайлов", Перечисления.СпособыСравненияВерсийФайлов.MicrosoftOfficeWord);
		
	ИначеЕсли Идентификатор = "ПодтверждениеПриЗавершенииПрограммы" Тогда
		
		Значение = СтандартныеПодсистемыСервер.ЗапрашиватьПодтверждениеПриЗавершенииПрограммы();
		
	ИначеЕсли Идентификатор = "КонтрольДоговоровПриПроведенииДокументов" Тогда
		
		Значение = ?(Константы.НеПроводитьДокументыСНекорректнымиДоговорами.Получить(), 1, 0);
		
	ИначеЕсли Идентификатор = "АвтоматическаяОтправкаЭД" Тогда
		
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОтправкаОформленныхЭД);
		Значение = ?(РегЗадание = Неопределено, Неопределено, РегЗадание.Использование);
		
	ИначеЕсли Идентификатор = "АвтоматическоеПолучениеЭД" Тогда
		
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ПолучениеНовыхЭД);
		Значение = ?(РегЗадание = Неопределено, Неопределено, РегЗадание.Использование);
		
	ИначеЕсли Идентификатор = "ЧасовойПоясПрограммы" Тогда
		
		Значение = ПолучитьЧасовойПоясИнформационнойБазы();
		Если ПустаяСтрока(Значение) Тогда
			Значение = ЧасовойПояс();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "КаталогДистрибутиваПлатформы" Тогда
		
		Каталог = ПолучениеОбновленийПрограммы.КаталогСохраненияПоследнегоПолученногоДистрибутива();
		Значение = ?(ПустаяСтрока(Каталог), НСтр("ka='<ჯერ არ შენახულა>';ru='<Еще не сохранялся>';en='<It is not maintained>'"), Каталог);
		
	ИначеЕсли Идентификатор = "АвтоматическиЗагружатьПочту" Тогда
		
		РегЗадание = РегистрыСведений.ЗаданияОбменаСGoogle.РегламентноеЗадание(Перечисления.ОбластиДоступаGoogle.Почта);
		Значение = ?(РегЗадание = Неопределено, Ложь, РегЗадание.Использование);
		
	ИначеЕсли Идентификатор = "МаксимальныйРазмерФайла" Тогда
		
		Значение = ФайловыеФункции.МаксимальныйРазмерФайлаОбщий() / (1024*1024);
		
	ИначеЕсли Идентификатор = "МаксимальныйРазмерФайлаОбластиДанных" Тогда
		
		Значение = ФайловыеФункции.МаксимальныйРазмерФайла() / (1024*1024);
		
	ИначеЕсли Идентификатор = "ИспользоватьЭлектронныеПодписи2" Тогда
		
		Значение = Константы.ИспользоватьЭлектронныеПодписи.Получить();
		
	ИначеЕсли Идентификатор = "ОтправлятьДанныеВЦентрМониторинга" Тогда
		
		Значение = УправлениеНебольшойФирмойСервер.ПолучитьПереключательОтправкиДанных();
		
	ИначеЕсли Идентификатор = "АдресСервисаЦентраМониторинга" Тогда
		
		Значение = УправлениеНебольшойФирмойСервер.ПолучитьАдресСервисаЦентраМониторинга();
		
	ИначеЕсли Идентификатор = "АвтоматическоеУдалениеПомеченных" Тогда
		
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.УдалениеПомеченных);
		Значение = ?(РегЗадание = Неопределено, Неопределено, РегЗадание.Использование);
	// Kuzmich, 12.05.2019, Заполнение типа цен из настроек склада	
	ИначеЕсли Идентификатор = "ЗаполнениеТипаЦенИзНастроекСклада" Тогда
		
		Значение = Константы.ЗаполнениеТипаЦенИзНастроекСклада.Получить();
	// Kuzmich, 12.05.2019, Заполнение типа цен из настроек склада
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	ИначеЕсли Идентификатор = "СчетВыручкиВТабличнойЧасти" Тогда
		
		Значение = Константы.СчетВыручкиВТабличнойЧасти.Получить();
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	// Kuzmich, 03.06.2019, Вывести в Заказ покупателя адрес покупателя из договора
	ИначеЕсли Идентификатор = "ДляЗаказаАдресКонтрагентаБратьИзДоговора" Тогда
		
		Значение = Константы.ДляЗаказаАдресКонтрагентаБратьИзДоговора.Получить();
	// Kuzmich, 03.06.2019, Вывести в Заказ покупателя адрес покупателя из договора
	// Kuzmich, 05.06.2019, Количество знаков после запятой в цене
	ИначеЕсли Идентификатор = "КоличествоЗнаковПослеЗапятойВЦене" Тогда
		
		Значение = Константы.КоличествоЗнаковПослеЗапятойВЦене.Получить();
	// Kuzmich, 05.06.2019, Количество знаков после запятой в цене
	// Kuzmich, 20.06.2019, Печ форме ел накладная (брать дату из дату транспортировки)
	ИначеЕсли Идентификатор = "ЭлектроннаяНакладнаяДатуБратьИзДатыТранспортировки" Тогда
		
		Значение = Константы.ЭлектроннаяНакладнаяДатуБратьИзДатыТранспортировки.Получить();
	// Kuzmich, 20.06.2019, Печ форме ел накладная (брать дату из дату транспортировки)
	// Kuzmich, 20.06.2019, Вывод штрихкода в печать заказа покупателя
	ИначеЕсли Идентификатор = "ВыводШтрихкодаВПечатьЗаказаПокупателя" Тогда
		
		Значение = Константы.ВыводШтрихкодаВПечатьЗаказаПокупателя.Получить();

	// Kuzmich, 20.06.2019, Вывод штрихкода в печать заказа покупателя
	//--------------------------------------------------------------------------
	// © Шишка В.В. [13 августа 2020 г.]  НАЧАЛО
	ИначеЕсли Идентификатор = "ИспользоватьГарантииВНарядЗаказах" Тогда
		
		Значение = Константы.ИспользоватьГарантииВНарядЗаказах.Получить();

	// © Шишка В.В. [13 августа 2020 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	Иначе
		
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриПроверкеКорректностиНастройки(знач Идентификатор, НовоеЗначение, ТекстОшибки, Отказ) Экспорт
	
	Если Идентификатор = "ИспользоватьНесколькоОрганизаций" Тогда
		
		Если Не НовоеЗначение Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьИспользоватьНесколькоОрганизаций();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "УчетПоКомпании" Тогда
		
		Если НовоеЗначение Тогда
			Если УправлениеНебольшойФирмойСервер.ЕстьДвиженияПоДругимОрганизациям(Справочники.Организации.ОсновнаяОрганизация) Тогда
				ТекстОшибки = НСтр("ka='ბაზაში არის ძირითადისგან განსხვავებული ორგანიზაციების მიხედვით მოძრაობები. ოპციის ჩასართავად საჭიროა სხვა ორგანიზაციების მიხედვით მონაცემთა გასუფთავება.';ru='В базе есть движения по организации, отличной от основной. Для включения опции необходимо очистить данные по прочим организациям.';en='At the base there is movement on the organization, other than the main one. To enable these options must be cleaned by other organizations.'");
			КонецЕсли;
		Иначе
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьУчетПоКомпании();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "Компания" Тогда
		
		Если Не ЗначениеЗаполнено(НовоеЗначение) И Константы.УчетПоКомпании.Получить() Тогда
			ТекстОшибки = НСтр("ka='ორგანიზაცია-კომპანია არ არის შევსებული კომპანიის მიხედვით აღრიცხვის საწარმოებლად';ru='Не заполнена организация-компания для ведения учета по компании';en='Not filled Organization company to maintain a record of the company'");
		ИначеЕсли НовоеЗначение <> Константы.Компания.Получить() Тогда
			Если УправлениеНебольшойФирмойСервер.ЕстьДвиженияПоДругимОрганизациям(НовоеЗначение) Тогда
				ТекстОшибки = НСтр("ka='ბაზაში არის მოძრაობები არჩეულისგან განსხვავებული ორგანიზაციის თაობაზე. ოპციის ჩასართავად, აუცილებელია სხვა ორგანიზაციების თაობაზე არსებულ მონაცემთა გასუფთავება.';ru='В базе есть движения по организации, отличной от выбранной. Для включения опции необходимо очистить данные по прочим организациям.';en='At the base there is movement on the organization, other than the selected one. To enable these options must be cleaned by other organizations.'");
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетПоНесколькимПодразделениям" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить()
			И Справочники.СтруктурныеЕдиницы.КоличествоСтруктурныхЕдиниц(Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, Ложь) > 0 Тогда
			
			ТекстОшибки = НСтр("ka='ბაზაში არის ქვეგანყოფილებები, რომლებიც ძირითადი ქვეგანყოფილებისგან განსხვავდება! ოპციის მოხსნა აკრძალულია!';ru='В базе имеются подразделения, отличные от основного! Снятие опции запрещено!';en='The base units are different from the main! Removing options forbidden!'");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить()
			И Справочники.НаправленияДеятельности.КоличествоНаправленийДеятельности(Ложь, Ложь) > 0 Тогда
			
			ТекстОшибки = НСтр("ka='ბაზაში არის ძირითადისგან განსხვავებული საქმიანობის მიმართულებები! ოპციის მოხსნა აკრძალულია!';ru='В базе имеются направления деятельности, отличные от основного! Снятие опции запрещено!';en='In the database there are activities other than the main! Removing options forbidden!'");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов" Тогда
		
		Если НовоеЗначение И Не Константы.ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов.Получить()
			И Не ПолучитьФункциональнуюОпцию("РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям")
			И РегистрыНакопления.РасчетыПоЭквайрингу.ЕстьДвиженияПоЭквайрингу() Тогда
			
			ТекстОшибки = НСтр("ru='Регистр накопления ""Расчеты по эквайрингу"" содержит информацию об эквайринговых операциях! Установка опции запрещена!"
"Выполнить анализ можно в отчете ""Расчеты по эквайрингу (сводно)"" с детализацией до регистратора. Отчет вызывается из раздела ""Деньги"".';ka='დაგროვების რეგისტრი ""ეკვაირინგის მიხედვით ანგარიშსწორებები"" შეიცავს ინფორმაციას ეკვაირინგის ოპერაციების შესახებ! ოპციის დაყენება აკრძალულია!"
"ანალიზის შესრულება შეიძლება ანგარიშგება ""ეკვაირინგის მიხედვით ანგარიშსწორებები (კრებსითად)""-ში რეგისტრატორამდე დეტალიზაციით. ანგარიშგების მოხმობა ხდება ნაწილ ""ფული""-დან.'");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетВнеоборотныхАктивов" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетВнеоборотныхАктивов.Получить()
			И Справочники.ВнеоборотныеАктивы.ЕстьДвиженияПоВнеоборотнымАктивам() Тогда
			
			ТекстОшибки = НСтр("ka='ბაზაში არის გრძელვადიანი აქტივების მოძრაობები! ოპციის მოხსნა აკრძალულია!';ru='В базе присутствуют движения по внеоборотным активам! Снятие опции запрещено!';en='The database contains the movement of non-current assets! Removing options forbidden!'");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьНесколькоВариантовКП" Тогда
		
		Если Не НовоеЗначение Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияНесколькоВариантовКП();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьСкидкиНаценки();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьДисконтныеКарты" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьДисконтныеКарты.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьДисконтныеКарты();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьАвтоматическиеСкидкиНаценки" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьАвтоматическиеСкидкиНаценки.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьАвтоматическиеСкидкиНаценки();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПередачаТоваровНаКомиссию" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияПередачаТоваровНаКомиссию.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияПередачаТоваровНаКомиссию();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПриемТоваровНаКомиссию" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияПриемТоваровНаКомиссию.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияПриемТоваровНаКомиссию();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьРемонты" Тогда
		
		Если Не НовоеЗначение И Константы.ИспользоватьРемонты.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьРемонты();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьВидыЗаказовПокупателей" Тогда
		
		Если Не НовоеЗначение Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьВидыЗаказовПокупателей();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетРозничныхПродаж" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетРозничныхПродаж.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияУчетРозничныхПродаж();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек.Получить() Тогда
		ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговле();
КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьБиллинг" Тогда
		
		Если НЕ НовоеЗначение И Справочники.ДоговорыКонтрагентов.ЕстьДоговорыОбслуживания() Тогда
			ТекстОшибки = НСтр("ka='ბაზაში არის მომსახურების ხელშეკრულებები! ოპციის მოხსნა აკრძალულია!';ru='В базе имеются договоры обслуживания! Снятие опции запрещено!';en='In the database there are service contracts! Removing options forbidden!'");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "БиллингВестиУчетРасходовПоДоговорамОбслуживания" Тогда
		
		Если НЕ НовоеЗначение И Справочники.ДоговорыКонтрагентов.ЕстьДоговорыОбслуживанияСУникальнымиНаправлениямиДеятельности() Тогда
			ТекстОшибки = НСтр("ka='ბაზაში არის მომსახურების ხელშეკრულებები საქმიანობის არჩეული მიმართულებებით! ოპციის მოხსნა აკრძალულია!';ru='В базе имеются договоры обслуживания с выбранными направлениями деятельности! Снятие опции запрещено!';en='The database has service contracts with selected activities! Removing options forbidden!'");
		КонецЕсли;
		Если НЕ НовоеЗначение И Справочники.ТарифныеПланыДоговоровОбслуживания.ЕстьТарифныеПланыСУчетомЗатрат() Тогда
			ТекстОшибки = НСтр("ka='ბაზაში არის სატარიფო გეგმები ხარჯების წარდგენის მოცემული წესებით! ოპციის მოხსნა აკრძალულია!';ru='В базе имеются тарифные планы с заданными правилами выставления затрат! Снятие опции запрещено!';en='In the database there are tariff plans with predetermined rules billing costs! Removing options forbidden!'");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетПоНесколькимСкладам" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетПоНесколькимСкладам.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятиеУчетПоНесколькимСкладам();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетВРазличныхЕдиницахИзмерения" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетВРазличныхЕдиницахИзмерения.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияУчетВРазличныхЕдиницахИзмерения();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьХарактеристики" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьХарактеристики.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьХарактеристики();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьПартии" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьПартии.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьПартии();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьСерийныеНомера" Тогда
		
		Если Не НовоеЗначение И Константы.ИспользоватьСерийныеНомера.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьСерийныеНомера();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "КонтрольОстатковСерийныхНомеров" Тогда
		
		Если НовоеЗначение = Ложь И 
	Константы.КонтрольОстатковСерийныхНомеров.Получить()=Истина Тогда
	ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьСерийныеНомера();
КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетГТД" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетГТД.Получить()
			И РегистрыНакопления.ЗапасыВРазрезеГТД.ЕстьОстаткиПоЗапасамВРазрезеГТД() Тогда
			
			ТекстОшибки = НСтр("ka='ბაზაში არის მარაგების ნაშთი საბაჟო დეკლარაციების ჭრილში. ალმის მოხსნა აკრძალულია!';ru='В базе есть остатки по запасам в разрезе ГТД. Снятие флага запрещено!';en='At the base there are the remains of reserves in the context of GTD. Removing forbidden flag!'");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "КонтролироватьОстаткиПоНомерамГТД" Тогда
		
			Если НЕ ГрузовыеТаможенныеДекларацииСервер.МожноВключитьКонтролироватьОстаткиПоНомерамГТД() Тогда
		ТекстОшибки = НСтр("ka='ოპცია ""ნაშთის კონტროლი საბაჟო დეკლარაციების ჭრილში""-ს მნიშვნელობის შეცვლა არ შეიძლება, ვინაიდან პროგრამაში საბაჟო დეკლარაციების მიხედვით დაფიქსირებულია უარყოფითი ნაშთი.';ru='Нельзя изменить значение опции Контроль остатков в разрезе ГТД, потому что в программе зафиксированы отрицательные остатки по ГТД.';en='You can not change the options in the context of control of residues of GTE, because the program recorded negative balances GTD.'");
	КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетЦенКонтрагентов" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетЦенКонтрагентов.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияУчетЦенКонтрагентов();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияРезервированиеЗапасов" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияРезервированиеЗапасов();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПриемЗапасовНаОтветхранение" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияПриемЗапасовНаОтветхранение.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияПриемЗапасовНаОтветхранение();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПередачаСырьяВПереработку" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияПередачаСырьяВПереработку.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияПередачаСырьяВПереработку();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПередачаЗапасовНаОтветхранение" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияПередачаЗапасовНаОтветхранение.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияПередачаЗапасовНаОтветхранение();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьОрдерныйСклад" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьОрдерныйСклад.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьОрдерныйСклад();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетПоЯчейкам" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияУчетПоЯчейкам.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияУчетПоЯчейкам();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьПодсистемуРаботы" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьПодсистемуРаботы();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьВидыЗаказНарядов" Тогда
		
		Если Не НовоеЗначение Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьВидыЗаказНарядов();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьРемонты2" Тогда
		
		Если Не НовоеЗначение И Константы.ИспользоватьРемонты.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьРемонты();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьПодсистемуПроизводство" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьПодсистемуПроизводство();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьТехоперации" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьТехоперации.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьТехоперации();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПереработкаДавальческогоСырья" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияПереработкаДавальческогоСырья.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияПереработкаДавальческогоСырья();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяУчетВалютныхОпераций" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяУчетВалютныхОпераций.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяУчетВалютныхОпераций();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ВалютаУчета" Тогда
		
		ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказИзменитьВалютаУчета();
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьСтатьиДвиженияДенежныхСредств" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьСтатьиДвиженияДенежныхСредств.Получить() Тогда
	ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяИспользоватьСтатьиДвиженияДенежныхСредств();
КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияКредитыИЗаймы" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияКредитыИЗаймы.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияКредитыИЗаймы();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьПодсистемуЗарплата();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьСовместительство" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьСовместительство.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьСовместительство();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "АдресПолучателяСкрытойКопии" Тогда
		
		ТекстОшибки = СобытияУНФКлиентСервер.ПроверитьКорректностьАдресаЭлектроннойПочты(НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ИдентификацияПриложенияGoogle" Тогда
		
		Если Не ПустаяСтрока(НовоеЗначение) Тогда
			ТекстОшибки = ОбменСGoogle.ИдентификацияПриложенияGoogleКорректна(НовоеЗначение);
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьОбменССайтами" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьОбменССайтами.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьИспользоватьОбменССайтом();
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "АвтоматическиЗагружатьПочту" Тогда
		
		РегЗадание = РегистрыСведений.ЗаданияОбменаСGoogle.РегламентноеЗадание(Перечисления.ОбластиДоступаGoogle.Почта);
	Если РегЗадание = Неопределено Тогда
		ТекстОшибки = "Учетная запись электронной почты не подключена";
	КонецЕсли;

		
	ИначеЕсли Идентификатор = "МаксимальныйРазмерФайла" Тогда
		
		ТекстОшибки = ?(НовоеЗначение = 0, НСтр("ka='ველი ""ფაილის მაქსიმალური ზომა"" არ არის შევსებული.';ru='Поле ""Максимальный размер файла"" не заполнено.';en='The ""Maximum file size"" is not filled.'"),"");
		
	ИначеЕсли Идентификатор = "МаксимальныйРазмерФайлаОбластиДанных" Тогда
		
		ТекстОшибки = ?(НовоеЗначение = 0, НСтр("ka='ველი ""ფაილის მაქსიმალური ზომა"" არ არის შევსებული.';ru='Поле ""Максимальный размер файла"" не заполнено.';en='The ""Maximum file size"" is not filled.'"),"");
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьПодключаемоеОборудование" Тогда
		
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование.Получить() Тогда
			ТекстОшибки = УправлениеНебольшойФирмойСервер.ОтказСнятьФункциональнаяОпцияИспользоватьПодключаемоеОборудование();
		КонецЕсли;
	// Kuzmich, 05.06.2019, Количество знаков после запятой в цене
	ИначеЕсли Идентификатор = "КоличествоЗнаковПослеЗапятойВЦене" Тогда
		
		Если (НовоеЗначение < 0) ИЛИ (НовоеЗначение > 9) Тогда
			ТекстОшибки = НСтр("ka='0 დან 9–ამდე მნიშვნელობა';ru='Значение от 0 до 9';en='From 0 to 9'");
		КонецЕсли;
		
	// Kuzmich, 05.06.2019, Количество знаков после запятой в цене
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеЗначенияНастройки(знач Идентификатор, НовоеЗначение, ОповещенияНаКлиенте, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если Идентификатор = "ИспользоватьНесколькоОрганизаций" Тогда
		
		СтандартнаяОбработка = Истина;
		Если Не НовоеЗначение Тогда
			Константы.УчетПоКомпании.Установить(Ложь);
			Константы.Компания.Установить(Справочники.Организации.ПустаяСсылка());
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "УчетПоКомпании");
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "Компания");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "УчетПоКомпании" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение И Не ЗначениеЗаполнено(Константы.Компания.Получить()) Тогда
			Константы.Компания.Установить(Справочники.Организации.ОсновнаяОрганизация);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "Компания");
		ИначеЕсли Не НовоеЗначение Тогда
			Константы.Компания.Установить(Справочники.Организации.ПустаяСсылка());
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "Компания");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение Тогда
			Константы.ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям.Установить(Истина);
			Константы.ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером.Установить(Истина);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям");
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ВестиУчетМаркировкиПродукцииВГИСМ" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение Тогда
			Константы.ИспользоватьСерийныеНомера.Установить(Истина);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ИспользоватьСерийныеНомера");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьМобильнуюТелефонию" Тогда
		
		СтандартнаяОбработка = Истина;
	Если НовоеЗначение И Константы.ИспользоватьОблачнуюТелефонию.Получить() Тогда
		Константы.ИспользоватьОблачнуюТелефонию.Установить(Ложь);
		Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ИспользоватьОблачнуюТелефонию");
	КонецЕсли;
		
	ИначеЕсли Идентификатор = "ДействиеТекущегоЗвонкаНайденногоАбонента" Тогда
		
		ТелефонияСервер.УстановитьНастройкуТелефонии("ДействиеТекущегоЗвонкаНайденногоАбонента", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ДействиеТекущегоЗвонкаНеизвестногоАбонента" Тогда
		
		ТелефонияСервер.УстановитьНастройкуТелефонии("ДействиеТекущегоЗвонкаНеизвестногоАбонента", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьДисконтныеКарты" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение И Не Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи.Получить() Тогда
			Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи.Установить(Истина);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек" Тогда
		
		Константы.ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек.Установить(НовоеЗначение);
Константы.ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговле.Установить(НовоеЗначение И Константы.ФункциональнаяОпцияУчетРозничныхПродаж.Получить());
		
	ИначеЕсли Идентификатор = "ОтправкаЭлектронныхЧековПослеПробитияЧека" Тогда
		
		ОтправкаЭлектронныхЧековПослеПробития = Не Булево(НовоеЗначение);
		Константы.ОтправкаЭлектронныхЧековПослеПробитияЧека.Установить(ОтправкаЭлектронныхЧековПослеПробития);
		Если ОтправкаЭлектронныхЧековПослеПробития Тогда
			РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.РассылкаЭлектронныхЧеков);
			РегЗадание.Использование = НовоеЗначение;
			РегЗадание.Записать();
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "АвтоматическаяОтправкаЭлектронныхЧековПоРасписанию");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "АвтоматическаяОтправкаЭлектронныхЧековПоРасписанию" Тогда
		
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.РассылкаЭлектронныхЧеков);
		РегЗадание.Использование = НовоеЗначение;
		РегЗадание.Записать();
		
	ИначеЕсли Идентификатор = "ИспользоватьБиллинг" Тогда
		
		Константы.ИспользоватьБиллинг.Установить(НовоеЗначение);
		Если НовоеЗначение = Ложь Тогда
			Константы.БиллингВестиУчетРасходовПоДоговорамОбслуживания.Установить(Ложь);
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "БиллингВестиУчетРасходовПоДоговорамОбслуживания" Тогда
		
		Константы.БиллингВестиУчетРасходовПоДоговорамОбслуживания.Установить(НовоеЗначение);
Если НовоеЗначение И НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
			Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Установить(НовоеЗначение);
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "БиллингГоловноеНаправлениеДеятельности" Тогда
		
		Константы.БиллингГоловноеНаправлениеДеятельности.Установить(НовоеЗначение);
		Справочники.НаправленияДеятельности.СгруппироватьНаправленияДеятельностиДоговоровОбслуживания();
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияУчетПоЯчейкам" Тогда
		
		Если НовоеЗначение = Истина И НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимСкладам.Получить() Тогда
			Константы.ФункциональнаяОпцияУчетПоНесколькимСкладам.Установить(Истина);
		КонецЕсли;
Константы.ФункциональнаяОпцияУчетПоЯчейкам.Установить(НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ИспользоватьРемонты2" Тогда
		
		Константы.ИспользоватьРемонты.Установить(НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьПодсистемуПроизводство" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение = Ложь Тогда
			Константы.ФункциональнаяОпцияПереработкаДавальческогоСырья.Установить(Ложь);
			Константы.ФункциональнаяОпцияИспользоватьТехоперации.Установить(Ложь);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияПереработкаДавальческогоСырья");
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияИспользоватьТехоперации");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером" Тогда
		
		СтандартнаяОбработка = Истина;
		Если Не НовоеЗначение И Константы.ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям.Получить() = Истина Тогда
			Константы.ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям.Установить(Ложь);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьПодсистемуЗарплата" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение = Ложь Тогда
			Константы.ФункциональнаяОпцияИспользоватьСовместительство.Установить(Ложь);
			Константы.ФункциональнаяОпцияВестиШтатноеРасписание.Установить(Ложь);
			Константы.ФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов.Установить(Ложь);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияИспользоватьСовместительство");
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияВестиШтатноеРасписание");
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ОтправлятьСлепыеКопииПисем" Тогда
		
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПараметрыОтправкиСкрытыхКопий", "ОтправлятьСлепыеКопииПисем", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "АдресПолучателяСкрытойКопии" Тогда
		
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПараметрыОтправкиСкрытыхКопий", "АдресПолучателяСкрытойКопии", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ИмяОтправителяSMS" Тогда
		
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиSMS", "ИмяОтправителяSMS", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ПерсональноеМобильноеУстройство" Тогда
		
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиТелефонии", "УзелОбмена", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ЗагрузкаКонтактовGoogle" Тогда
		
		Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "ОчиститьСеансовыеДанные", Новый Структура, Идентификатор);
		
		РегистрыСведений.СчетчикиПодсказок.Сбросить(Перечисления.ВидыПодсказок.Google);
		РегистрыСведений.СеансовыеДанныеGoogle.ОтключитьОбластьДоступа(
			Пользователи.ТекущийПользователь(),
			Перечисления.ОбластиДоступаGoogle.Контакты,
			Не НовоеЗначение);
		
	ИначеЕсли Идентификатор = "СинхронизацияКалендаряGoogle" Тогда
		
		Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "ОчиститьСеансовыеДанные", Новый Структура, Идентификатор);
		
		РегистрыСведений.СеансовыеДанныеGoogle.ОтключитьОбластьДоступа(
			Пользователи.ТекущийПользователь(),
			Перечисления.ОбластиДоступаGoogle.Календарь,
			Не НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ПоказыватьЗанятыеФайлыПриЗавершенииРаботы" Тогда
		
		ХранилищеОбщихНастроек.Сохранить("НастройкиПрограммы", "ПоказыватьЗанятыеФайлыПриЗавершенииРаботы", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "СпрашиватьРежимРедактированияПриОткрытииФайла" Тогда
		
		ХранилищеОбщихНастроек.Сохранить("НастройкиОткрытияФайлов", "СпрашиватьРежимРедактированияПриОткрытииФайла", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ПоказыватьПодсказкиПриРедактированииФайлов" Тогда
		
		ХранилищеОбщихНастроек.Сохранить("НастройкиОткрытияФайлов", "ПоказыватьПодсказкиПриРедактированииФайлов", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ДействиеСФайламиПоДвойномуЩелчкуМыши" Тогда
		
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиОткрытияФайлов", "ДействиеПоДвойномуЩелчкуМыши", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "СпособСравненияВерсийФайлов" Тогда
		
		ХранилищеОбщихНастроек.Сохранить("НастройкиСравненияФайлов", "СпособСравненияВерсийФайлов", НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ПодтверждениеПриЗавершенииПрограммы" Тогда
		
		ОбщегоНазначения.СохранитьПерсональныеНастройки(Новый Структура("ЗапрашиватьПодтверждениеПриЗавершенииПрограммы", НовоеЗначение));
		
	ИначеЕсли Идентификатор = "КонтрольДоговоровПриПроведенииДокументов" Тогда
		
		Константы.НеПроводитьДокументыСНекорректнымиДоговорами.Установить(НовоеЗначение = 1);
		
	ИначеЕсли Идентификатор = "АвтоматическаяОтправкаЭД" Тогда
		
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОтправкаОформленныхЭД);
		РегЗадание.Использование = НовоеЗначение;
		РегЗадание.Записать();
		
	ИначеЕсли Идентификатор = "АвтоматическоеПолучениеЭД" Тогда
		
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ПолучениеНовыхЭД);
		РегЗадание.Использование = НовоеЗначение;
		РегЗадание.Записать();
		
	ИначеЕсли Идентификатор = "ЧасовойПоясПрограммы" Тогда
		
		Если НовоеЗначение <> ПолучитьЧасовойПоясИнформационнойБазы() Тогда 
			УстановитьПривилегированныйРежим(Истина);
			Попытка
				ОбщегоНазначения.ЗаблокироватьИБ();
				УстановитьЧасовойПоясИнформационнойБазы(НовоеЗначение);
				ОбщегоНазначения.РазблокироватьИБ();
			Исключение
				ОбщегоНазначения.РазблокироватьИБ();
				ВызватьИсключение;
			КонецПопытки;
			УстановитьПривилегированныйРежим(Ложь);
			УстановитьЧасовойПоясСеанса(НовоеЗначение);
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ОграничиватьДоступНаУровнеЗаписей" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение = Ложь Тогда
			Константы.ИспользоватьГруппыДоступаКонтрагентов.Установить(Ложь);
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "ИспользоватьГруппыДоступаКонтрагентов");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ИспользоватьПроверкуКонтрагентов" Тогда
		
		ПроверкаКонтрагентовВызовСервера.ПриВключенииВыключенииПроверки(НовоеЗначение = 1);
		
	ИначеЕсли Идентификатор = "АвтоматическиЗагружатьПочту" Тогда
		
		РегЗадание = РегистрыСведений.ЗаданияОбменаСGoogle.РегламентноеЗадание(Перечисления.ОбластиДоступаGoogle.Почта);
		РегЗадание.Использование = НовоеЗначение;
		РегЗадание.Записать();
		
	ИначеЕсли Идентификатор = "МаксимальныйРазмерФайла" Тогда
		
		Константы.МаксимальныйРазмерФайла.Установить(НовоеЗначение * 1024 * 1024);
		
	ИначеЕсли Идентификатор = "МаксимальныйРазмерФайлаОбластиДанных" Тогда
		
		Константы.МаксимальныйРазмерФайлаОбластиДанных.Установить(НовоеЗначение * 1024 * 1024);
		
	ИначеЕсли Идентификатор = "ИспользоватьЭлектронныеПодписи2" Тогда
		
		Константы.ИспользоватьЭлектронныеПодписи.Установить(НовоеЗначение);
		
	ИначеЕсли Идентификатор = "ИспользоватьОбменСКассойMinikassir" Тогда
		
		СтандартнаяОбработка = Истина;
		Если НовоеЗначение Тогда
			Константы.ФункциональнаяОпцияУчетРозничныхПродаж.Установить(Истина);
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "ОтправлятьДанныеВЦентрМониторинга" Тогда
		
		УправлениеНебольшойФирмойСервер.УстановитьПереключательОтправкиДанных(НовоеЗначение);
		Если НовоеЗначение = 0 Или НовоеЗначение = 2 Тогда
			Обработки.НастройкаПрограммы.ДобавитьОповещение(ОповещенияНаКлиенте, "Запись_НаборКонстант", Новый Структура, "АдресСервисаЦентраМониторинга");
		КонецЕсли;
		
	ИначеЕсли Идентификатор = "АдресСервисаЦентраМониторинга" Тогда
		
		УправлениеНебольшойФирмойСервер.УстановитьАдресСервисаЦентраМониторинга(НовоеЗначение);
		
	ИначеЕсли Идентификатор = "АвтоматическоеУдалениеПомеченных" Тогда
		
		РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.УдалениеПомеченных);
		РегЗадание.Использование = НовоеЗначение;
		РегЗадание.Записать();
	// Kuzmich, 12.05.2019, Заполнение типа цен из настроек склада	
	ИначеЕсли Идентификатор = "ЗаполнениеТипаЦенИзНастроекСклада" Тогда
		
		Константы.ЗаполнениеТипаЦенИзНастроекСклада.Установить(НовоеЗначение);
	// Kuzmich, 12.05.2019, Заполнение типа цен из настроек склада
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	ИначеЕсли Идентификатор = "СчетВыручкиВТабличнойЧасти" Тогда
		
		Константы.СчетВыручкиВТабличнойЧасти.Установить(НовоеЗначение);
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	// Kuzmich, 03.06.2019, Вывести в Заказ покупателя адрес покупателя из договора
	ИначеЕсли Идентификатор = "ДляЗаказаАдресКонтрагентаБратьИзДоговора" Тогда
		
		Константы.ДляЗаказаАдресКонтрагентаБратьИзДоговора.Установить(НовоеЗначение);
	// Kuzmich, 03.06.2019, Вывести в Заказ покупателя адрес покупателя из договора
	// Kuzmich, 05.06.2019, Количество знаков после запятой в цене
	ИначеЕсли Идентификатор = "КоличествоЗнаковПослеЗапятойВЦене" Тогда
		
		Константы.КоличествоЗнаковПослеЗапятойВЦене.Установить(НовоеЗначение);
	// Kuzmich, 05.06.2019, Количество знаков после запятой в цене
	// Kuzmich, 20.06.2019, Печ форме ел накладная (брать дату из дату транспортировки)
	ИначеЕсли Идентификатор = "ЭлектроннаяНакладнаяДатуБратьИзДатыТранспортировки" Тогда
		
		Константы.ЭлектроннаяНакладнаяДатуБратьИзДатыТранспортировки.Установить(НовоеЗначение);
	// Kuzmich, 20.06.2019, Печ форме ел накладная (брать дату из дату транспортировки)
	// Kuzmich, 20.06.2019, Вывод штрихкода в печать заказа покупателя
	ИначеЕсли Идентификатор = "ВыводШтрихкодаВПечатьЗаказаПокупателя" Тогда
		
		Константы.ВыводШтрихкодаВПечатьЗаказаПокупателя.Установить(НовоеЗначение);
	// Kuzmich, 20.06.2019, Вывод штрихкода в печать заказа покупателя
	//--------------------------------------------------------------------------
	// © Шишка В.В. [13 августа 2020 г.]  НАЧАЛО
	ИначеЕсли Идентификатор = "ВыводШтрихкодаВПечатьЗаказаПокупателя" Тогда
		
		Константы.ИспользоватьГарантииВНарядЗаказах.Установить(НовоеЗначение);
	// © Шишка В.В. [13 августа 2020 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	Иначе
		
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриОпределенииДоступности(знач Идентификатор, ЭлементФормы, Форма) Экспорт
	
	Если Идентификатор = "УчетПоКомпании" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьНесколькоОрганизаций;
		
	ИначеЕсли Идентификатор = "Компания" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьНесколькоОрганизаций И Форма.УчетПоКомпании;
		
	ИначеЕсли Идентификатор = "НеобрабатываемыеТелефонныеНомера" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьМобильнуюТелефонию;
		
	ИначеЕсли Идентификатор = "ДействиеТекущегоЗвонкаНайденногоАбонента" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьМобильнуюТелефонию;
		
	ИначеЕсли Идентификатор = "ДействиеТекущегоЗвонкаНеизвестногоАбонента" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьМобильнуюТелефонию;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьДисконтныеКарты" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПриемТоваровНаКомиссию" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПартии;
		
	ИначеЕсли Идентификатор = "ОткрытьСправочникВидыЗаказовПокупателей" Тогда
		
		ЭлементФормы.Видимость = Форма.ИспользоватьВидыЗаказовПокупателей;
		
	ИначеЕсли Идентификатор = "АрхивироватьЧекиККМПриЗакрытииКассовойСмены" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж;
		
	ИначеЕсли Идентификатор = "УдалятьНепробитыеЧекиПриЗакрытииКассовойСмены" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж;
		
	ИначеЕсли Идентификатор = "КонтролироватьОстаткиПриПробитииЧековККМ" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж;
		
	ИначеЕсли Идентификатор = "ОтправкаЭлектронныхЧековПослеПробитияЧека" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж;
		
	ИначеЕсли Идентификатор = "АвтоматическаяОтправкаЭлектронныхЧековПоРасписанию" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж И Форма.ОтправкаЭлектронныхЧековПослеПробитияЧека = 1;
		
	ИначеЕсли Идентификатор = "РассылкаЭлектронныхЧековРасписание" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж И Форма.ОтправкаЭлектронныхЧековПослеПробитияЧека = 1 И Форма.АвтоматическаяОтправкаЭлектронныхЧековПоРасписанию;
		
	ИначеЕсли Идентификатор = "ОткрытьОчередьЭлектронныхЧеков" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж;
		
	//Паганини#ЛимитиПокупателей_
	ИначеЕсли Идентификатор = "НачалоПериодаКонтроляЛимитовЗадолжностиПокупателей" Тогда
		
		ЭлементФормы.Доступность = Форма.КонтрольЛимитовЗадолжностиПокупателей;
	//_Паганини#ЛимитиПокупателей
		
	ИначеЕсли Идентификатор = "БиллингВестиУчетРасходовПоДоговорамОбслуживания" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьБиллинг;
		
	ИначеЕсли Идентификатор = "БиллингГоловноеНаправлениеДеятельности" Тогда
		
		ЭлементФормы.Доступность = Форма.БиллингВестиУчетРасходовПоДоговорамОбслуживания;
		
	ИначеЕсли Идентификатор = "ВестиСведенияДляДекларацийПоАлкогольнойПродукции" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж;
		
	ИначеЕсли Идентификатор = "ДатаНачалаРегистрацииРозничныхПродажВЕГАИС" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж И Форма.ВестиСведенияДляДекларацийПоАлкогольнойПродукции;
		
	ИначеЕсли Идентификатор = "ВыгружатьПродажиНемаркируемойПродукцииВЕГАИС" Тогда
		
		ЭлементФормы.Доступность = Форма.ВестиСведенияДляДекларацийПоАлкогольнойПродукции;
		
	ИначеЕсли Идентификатор = "НастройкиОбменаЕГАИС" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж И Форма.ВестиСведенияДляДекларацийПоАлкогольнойПродукции;
		
	ИначеЕсли Идентификатор = "КонтрольОстатковСерийныхНомеров" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьСерийныеНомера
		
	ИначеЕсли Идентификатор = "КонтролироватьОстаткиПоНомерамГТД" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетГТД;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПриемЗапасовНаОтветхранение" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПартии;
		
	ИначеЕсли Идентификатор = "ИспользоватьВидыЗаказНарядов" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуРаботы;
		
	ИначеЕсли Идентификатор = "ОткрытьСправочникВидыЗаказНарядов" Тогда
		
		ЭлементФормы.Видимость = Форма.ИспользоватьВидыЗаказНарядов;
		
	ИначеЕсли Идентификатор = "ИспользоватьРемонты2" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуРаботы;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьТехоперации" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияПереработкаДавальческогоСырья" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство И Форма.ФункциональнаяОпцияИспользоватьПартии;
		
	ИначеЕсли Идентификатор = "УчетМерныхИзделий" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство;
		
	ИначеЕсли Идентификатор = "НациональнаяВалюта" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяУчетВалютныхОпераций;
		
	ИначеЕсли Идентификатор = "ВалютаУчета" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяУчетВалютныхОпераций;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияРазноситьОплатуОтЭквайрераПоЭквайринговымОперациям" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером;
		
	ИначеЕсли Идентификатор = "ЧастотаРасчетаКурсовыхРазниц" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяУчетВалютныхОпераций;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияВестиШтатноеРасписание" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияИспользоватьСовместительство" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата;
		
	ИначеЕсли Идентификатор = "ФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата;
		
	ИначеЕсли Идентификатор = "АдресПолучателяСкрытойКопии" Тогда
		
		ЭлементФормы.Доступность = Форма.ОтправлятьСлепыеКопииПисем;
		
	ИначеЕсли Идентификатор = "ЗагрузитьКонтактыGoogle" Тогда
		
		ЭлементФормы.Доступность = Форма.ЗагрузкаКонтактовGoogle;
		
	ИначеЕсли Идентификатор = "СинхронизироватьКалендарьGoogle" Тогда
		
		ЭлементФормы.Доступность = Форма.СинхронизацияКалендаряGoogle;
		
	ИначеЕсли Идентификатор = "ПодключениеИНастройкаОборудования" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование;
		
	ИначеЕсли Идентификатор = "НастройкаСинхронизацииДанных" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
		
	ИначеЕсли Идентификатор = "РезультатыСинхронизацииДанных" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
		
	ИначеЕсли Идентификатор = "ИспользоватьДатыЗапретаЗагрузки" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
		
	ИначеЕсли Идентификатор = "ДатыЗапретаЗагрузкиДанных" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных") И Форма.ИспользоватьДатыЗапретаЗагрузки;
		
	ИначеЕсли Идентификатор = "ПрефиксУзлаРаспределеннойИнформационнойБазы" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
		
	ИначеЕсли Идентификатор = "КонтрольДоговоровПриПроведенииДокументов" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
		
	ИначеЕсли Идентификатор = "КаталогСообщенийОбменаДаннымиДляWindows" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
		
	ИначеЕсли Идентификатор = "КаталогСообщенийОбменаДаннымиДляLinux" Тогда
		
		ЭлементФормы.Доступность = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
		
	ИначеЕсли Идентификатор = "НастройкаОбменаССайтами" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьОбменССайтами;
		
	ИначеЕсли Идентификатор = "ПрефиксДляОбменаССайтом" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьОбменССайтами;
		
	ИначеЕсли Идентификатор = "ТиповыеСоглашенияОбИспользованииЭД" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменЭД;
		
	ИначеЕсли Идентификатор = "СоглашенияОбИспользованииЭД" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменЭД;
		
	ИначеЕсли Идентификатор = "АвтоматическаяОтправкаЭД" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменЭД;
		
	ИначеЕсли Идентификатор = "ОтправкаОформленныхЭДРасписание" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменЭД И Форма.АвтоматическаяОтправкаЭД;
		
	ИначеЕсли Идентификатор = "АвтоматическоеПолучениеЭД" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменЭД;
		
	ИначеЕсли Идентификатор = "ПолучениеНовыхЭДРасписание" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменЭД И Форма.АвтоматическоеПолучениеЭД;
		
	ИначеЕсли Идентификатор = "ИспользоватьОтложеннуюОтправкуЭлектронныхДокументов" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменЭД;
		
	ИначеЕсли Идентификатор = "НастройкиЭлектроннойПодписиИШифрования" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьЭлектронныеПодписи;
		
	ИначеЕсли Идентификатор = "ПодключениеКСервису1С_ЭДО" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьЭлектронныеПодписи;
		
	ИначеЕсли Идентификатор = "ПомощникПодключенияКСервису1СТакском" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьЭлектронныеПодписи;
		
	ИначеЕсли Идентификатор = "НастройкиОбменаСБанками" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьОбменСБанками;
		
	ИначеЕсли Идентификатор = "ДатыЗапретаИзмененияДанных" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьДатыЗапретаИзменения;
		
	ИначеЕсли Идентификатор = "УправлениеНовостями" Тогда
		
		ЭлементФормы.Доступность = Форма.РазрешенаРаботаСНовостями;
		
	ИначеЕсли Идентификатор = "НастройкиВерсионированияОбъектов" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьВерсионированиеОбъектов;
		
	ИначеЕсли Идентификатор = "ЗагрузитьАдресныйКлассификатор" Тогда
		
		ЭлементФормы.Доступность = ПустаяСтрока(Форма.ИсточникДанныхАдресногоКлассификатора);
		
	ИначеЕсли Идентификатор = "ОчиститьАдресныйКлассификатор" Тогда
		
		ЭлементФормы.Доступность = ПустаяСтрока(Форма.ИсточникДанныхАдресногоКлассификатора);
		
	ИначеЕсли Идентификатор = "ИспользоватьГруппыДоступаКонтрагентов" Тогда
		
		ЭлементФормы.Доступность = Форма.ОграничиватьДоступНаУровнеЗаписей;
		
	ИначеЕсли Идентификатор = "ОткрытьГруппыДоступаКонтрагентов" Тогда
		
		ЭлементФормы.Доступность = Форма.ОграничиватьДоступНаУровнеЗаписей И Форма.ИспользоватьГруппыДоступаКонтрагентов;
		
	ИначеЕсли Идентификатор = "ОткрытьДополнительныеОтчетыИОбработки" Тогда
		
		ЭлементФормы.Доступность = Константы.ИспользоватьДополнительныеОтчетыИОбработки.Получить();
		
	ИначеЕсли Идентификатор = "АвтоматическиЗагружатьЭлектроннуюПочтуРасписание" Тогда
		
		ЭлементФормы.Доступность = Форма.АвтоматическиЗагружатьПочту
		
	ИначеЕсли Идентификатор = "ТомаХраненияФайлов" Тогда
		
		ЭлементФормы.Доступность = Форма.ХранитьФайлыВТомахНаДиске;
		
	ИначеЕсли Идентификатор = "СписокЗапрещенныхРасширенийОбластиДанных" Тогда
		
		ЭлементФормы.Доступность = Форма.ЗапрещатьЗагрузкуФайловПоРасширению;
		
	ИначеЕсли Идентификатор = "НастройкиКриптографии" Тогда
		
		ЭлементФормы.Доступность = Форма.ИспользоватьЭлектронныеПодписи2 Или Форма.ИспользоватьШифрование;
		
	ИначеЕсли Идентификатор = "НастройкиСинхронизацииФайлов" Тогда
		
		ЭлементФормы.Доступность = Форма.СинхронизироватьФайлы;
		
	ИначеЕсли Идентификатор = "ОткрытьПодключаемоеОборудование" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование;
		
	ИначеЕсли Идентификатор = "ОткрытьРабочиеМеста" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование;
		
	ИначеЕсли Идентификатор = "ИспользоватьОбменСПодключаемымОборудованиемOffline" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование;
		
	ИначеЕсли Идентификатор = "ПравилаОбменаСПодключаемымОборудованием" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование И Форма.ИспользоватьОбменСПодключаемымОборудованиемOffline;
		
	ИначеЕсли Идентификатор = "ИспользоватьОбменСКассойMinikassir" Тогда
		
		ЭлементФормы.Доступность = Форма.ФункциональнаяОпцияУчетРозничныхПродаж;
		
	ИначеЕсли Идентификатор = "АдресСервисаЦентраМониторинга" Тогда
		
		ЭлементФормы.Доступность = Форма.ОтправлятьДанныеВЦентрМониторинга = 1;
		
	ИначеЕсли Идентификатор = "ОценкаПроизводительности" Тогда
		
		ЭлементФормы.Доступность = Форма.ВыполнятьЗамерыПроизводительности;
		
	ИначеЕсли Идентификатор = "НастройкиОценкиПроизводительности" Тогда
		
		ЭлементФормы.Доступность = Форма.ВыполнятьЗамерыПроизводительности;
		
	ИначеЕсли Идентификатор = "УдалениеПомеченныхРасписание" Тогда
		
		ЭлементФормы.Доступность = Форма.АвтоматическоеУдалениеПомеченных;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
