#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВзаимозачет);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	//ПодольскийАИ #УчетПроектов 15.02.2021 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 15.02.2021 }
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ТаблицаДокумента.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
	//ПодольскийАИ #УчетПроектов 15.02.2021 {
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) КАК Проект,
	//ПодольскийАИ #УчетПроектов 15.02.2021 }
	|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
	// Щербаков +++
	|	ТаблицаДокумента.СчетУчетаРегл КАК СчетУчетаРегл,
	// Щербаков ---
	|	ТаблицаДокумента.Дата КАК Дата,
	|	СУММА(ТаблицаДокумента.СуммаУчета) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал,
	|	СУММА(ТаблицаДокумента.СуммаУчетаОстаток) КАК СуммаДляОстатка,
	|	СУММА(ТаблицаДокумента.СуммаРасчетовОстаток) КАК СуммаВалДляОстатка
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателями
	|ИЗ
	|	ВременнаяТаблицаПокупатели КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.СодержаниеПроводки,
	|	ТаблицаДокумента.ВидДвижения,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Валюта,
	|	ТаблицаДокумента.ТипРасчетов,
	//ПодольскийАИ #УчетПроектов 15.02.2021 {
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 15.02.2021 }
	|	ТаблицаДокумента.СчетУчета,
	// Щербаков +++
	|	ТаблицаДокумента.СчетУчетаРегл,
	// Щербаков ---
	|	ТаблицаДокумента.Дата,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов,
	|	СчетУчета";
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПокупателями.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПокупателями.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПокупателями.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПокупателями.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПокупателями.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПокупателями";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПокупателями");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	// Щербаков +++
	Запрос.Текст = Запрос.Текст + ";" + УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателямиРегл(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	// Щербаков ---
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПокупателями()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВзаимозачет);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ТаблицаДокумента.Валюта КАК Валюта,
	|	ТаблицаДокумента.ПризнакАванса КАК ПризнакАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.Заказпоставщику.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
	|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
	// Щербаков +++
	|	ТаблицаДокумента.СчетУчетаРегл КАК СчетУчетаРегл,
	// Щербаков ---
	|	ТаблицаДокумента.Дата КАК Дата,
	|	СУММА(ТаблицаДокумента.СуммаУчета) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал,
	|	СУММА(ТаблицаДокумента.СуммаУчетаОстаток) КАК СуммаДляОстатка,
	|	СУММА(ТаблицаДокумента.СуммаРасчетовОстаток) КАК СуммаВалДляОстатка
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщиками
	|ИЗ
	|	ВременнаяТаблицаПоставщики КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.СодержаниеПроводки,
	|	ТаблицаДокумента.ВидДвижения,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Валюта,
	|	ТаблицаДокумента.ТипРасчетов,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ТаблицаДокумента.СчетУчета,
	// Щербаков +++
	|	ТаблицаДокумента.СчетУчетаРегл,
	// Щербаков ---
	|	ТаблицаДокумента.Дата,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.Заказпоставщику.ПустаяСсылка)
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов,
	|	СчетУчета";
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПоставщиками.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПоставщиками";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщиками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками_КорректировкаДолга(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	// Щербаков +++
	Запрос.Текст = Запрос.Текст + ";" + УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиРегл(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	// Щербаков ---
	//+++ Дмгг
	Запрос.УстановитьПараметр("Отправитель", ДокументСсылкаВзаимозачет.КонтрагентИсточник);
	Запрос.УстановитьПараметр("Получатель", ДокументСсылкаВзаимозачет.Контрагент);
	Запрос.УстановитьПараметр("ВидОперации", ДокументСсылкаВзаимозачет.ВидОперации);
	Запрос.УстановитьПараметр("ДоговорПолучатель", ДокументСсылкаВзаимозачет.Договор);
	//--- Дмгг	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", МассивРезультатов[НомерЗапроса].Выгрузить());
	// Kuzmich, 24.11.2024, (ONESOFT-3522) Декларация для ИП (Индивидуальный предприниматель)
	ТаблицаРасчетыСПоставщиками = МассивРезультатов[НомерЗапроса].Выгрузить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", ТаблицаРасчетыСПоставщиками);
	
	Если ТаблицаРасчетыСПоставщиками.Количество()>0 Тогда
	
		ЗапросДекларация = Новый Запрос;
		ЗапросДекларация.Текст =
			"ВЫБРАТЬ
			|	Взаимозачет.Организация КАК Организация,
			|	Взаимозачет.Контрагент КАК Контрагент,
			|	Взаимозачет.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ
			|ПОМЕСТИТЬ Взаимозачет
			|ИЗ
			|	Документ.Взаимозачет КАК Взаимозачет
			|ГДЕ
			|	Взаимозачет.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаРасчетыСПоставщиками.Период КАК Период,
			|	ТаблицаРасчетыСПоставщиками.Организация КАК Организация,
			|	ТаблицаРасчетыСПоставщиками.Контрагент КАК Контрагент,
			|	ТаблицаРасчетыСПоставщиками.Договор КАК Договор,
			|	ТаблицаРасчетыСПоставщиками.Сумма КАК Сумма
			|ПОМЕСТИТЬ ТаблицаРасчетыСПоставщиками
			|ИЗ
			|	&ТаблицаРасчетыСПоставщиками КАК ТаблицаРасчетыСПоставщиками
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаРасчетыСПоставщиками.Период КАК Период,
			|	ТаблицаРасчетыСПоставщиками.Организация КАК Организация,
			|	ТаблицаРасчетыСПоставщиками.Контрагент КАК Контрагент,
			|	ТаблицаРасчетыСПоставщиками.Договор КАК Договор,
			|	СУММА(ТаблицаРасчетыСПоставщиками.Сумма) КАК Сумма
			|ПОМЕСТИТЬ ТаблицаДокумента
			|ИЗ
			|	ТаблицаРасчетыСПоставщиками КАК ТаблицаРасчетыСПоставщиками
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаРасчетыСПоставщиками.Период,
			|	ТаблицаРасчетыСПоставщиками.Организация,
			|	ТаблицаРасчетыСПоставщиками.Контрагент,
			|	ТаблицаРасчетыСПоставщиками.Договор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаДокумента.Период КАК Период,
			|	ТаблицаДокумента.Организация КАК Организация,
			|	ТаблицаДокумента.Контрагент КАК Получатель,
			|	ВЫРАЗИТЬ(ТаблицаДокумента.Договор КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
			|	ЕСТЬNULL(ВЫРАЗИТЬ(Взаимозачет.ВидУдержанияНДФЛ КАК Справочник.ВидыНачисленийИУдержаний).СтавкаНДФЛ, 0) КАК СтавкаНДФЛ,
			|	ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаДокумента.Договор КАК Справочник.ДоговорыКонтрагентов).ВидОплатыУслуг, ЗНАЧЕНИЕ(Справочник.ВидыОплатУслуг.ПустаяСсылка)) КАК ВидОплатыУслуг,
			|	ТаблицаДокумента.Сумма КАК СуммаВыдачи,
			|	0 КАК СуммаНДФЛ,
			|	0 КАК СуммаПФСотрудника,
			|	0 КАК СуммаПФОрганизации,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(Взаимозачет.ВидУдержанияНДФЛ КАК Справочник.ВидыНачисленийИУдержаний).СтавкаНДФЛ, 0) = 0
			|			ТОГДА ТаблицаДокумента.Сумма
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаЛьготы
			|ИЗ
			|	ТаблицаДокумента КАК ТаблицаДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ Взаимозачет КАК Взаимозачет
			|		ПО ТаблицаДокумента.Организация = Взаимозачет.Организация
			|			И ТаблицаДокумента.Контрагент = Взаимозачет.Контрагент
			|ГДЕ
			|	(ВЫРАЗИТЬ(ТаблицаДокумента.Договор КАК Справочник.ДоговорыКонтрагентов).УчитыватьНДФЛ
			|				И НЕ (ВЫРАЗИТЬ(Взаимозачет.ВидУдержанияНДФЛ КАК Справочник.ВидыНачисленийИУдержаний)) = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
			|			ИЛИ ВЫРАЗИТЬ(ТаблицаДокумента.Договор КАК Справочник.ДоговорыКонтрагентов).УслугаИП
			|				И НЕ ВЫРАЗИТЬ(ТаблицаДокумента.Договор КАК Справочник.ДоговорыКонтрагентов).ВидОплатыУслуг = ЗНАЧЕНИЕ(Справочник.ВидыОплатУслуг.ПустаяСсылка))";
		
		ЗапросДекларация.УстановитьПараметр("Ссылка", ДокументСсылкаВзаимозачет.Ссылка);
		ЗапросДекларация.УстановитьПараметр("ТаблицаРасчетыСПоставщиками", ТаблицаРасчетыСПоставщиками);
		
		РезультатЗапросаДекларация = ЗапросДекларация.Выполнить();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДекларация", РезультатЗапросаДекларация.Выгрузить());
	
	КонецЕсли;
	// Kuzmich, 24.11.2024, (ONESOFT-3522) Декларация для ИП (Индивидуальный предприниматель)
КонецПроцедуры // СформироватьТаблицаРасчетыСПоставщиками()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПрочимиКонтрагентами(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВзаимозачет);
	
	
	// Установка исключительной блокировки контролируемых остатков расчетов с подотчетными лицами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаПрочиеРасчеты.СчетУчета КАК СчетУчета,
	// Щербаков +++
	|	ВременнаяТаблицаПрочиеРасчеты.СчетУчетаРегл КАК СчетУчетаРегл,
	// Щербаков ---
	|	ВременнаяТаблицаПрочиеРасчеты.Организация КАК Организация,
	|	ВременнаяТаблицаПрочиеРасчеты.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаПрочиеРасчеты.Договор КАК Договор
	|ИЗ
	|	ВременнаяТаблицаПрочиеРасчеты КАК ВременнаяТаблицаПрочиеРасчеты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПрочимиКонтрагентами");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоПрочимОперациям(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	// Щербаков +++
	Запрос.Текст = Запрос.Текст + ";" + УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоПрочимОперациямРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	// Щербаков ---
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	//Малышев 2025-02-24
	ТаблицаДвижений = МассивРезультатов[НомерЗапроса].Выгрузить();
	ТаблицаДвижений.Колонки.Добавить("СчетУчетаРегл");
	ТаблицаДвижений.ЗаполнитьЗначения(ДокументСсылкаВзаимозачет.КорреспонденцияПрочиеРасчетыРегл, "СчетУчетаРегл");
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПрочимиКонтрагентами", ТаблицаДвижений);
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПрочимиКонтрагентами()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.СчетНаОплату КАК СчетНаОплату,
	|	СУММА(ВЫБОР
	|			КОГДА (НЕ ТаблицаДокумента.ПризнакАванса)
	|				ТОГДА 0
	|			КОГДА Константы.ВалютаУчета = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаУчета
	|			КОГДА ТаблицаДокумента.Валюта = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * КурсыВалютРасчетов.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СуммаАванса,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА Константы.ВалютаУчета = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаУчета
	|			КОГДА ТаблицаДокумента.Валюта = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * КурсыВалютРасчетов.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СуммаОплаты
	|ИЗ
	|	ВременнаяТаблицаПокупатели КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютСчета
	|		ПО ТаблицаДокумента.СчетНаОплату.ВалютаДокумента = КурсыВалютСчета.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО ТаблицаДокумента.Валюта = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТаблицаДокумента.ВестиУчетОплатыПоСчетам
	|	И ТИПЗНАЧЕНИЯ(ТаблицаДокумента.СчетНаОплату) = ТИП(Документ.СчетНаОплату)
	|	И ТаблицаДокумента.СчетНаОплату <> ЗНАЧЕНИЕ(Документ.СчетНаОплату.ПустаяСсылка)
	|	И ТаблицаДокумента.СчетНаОплату <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.ВидДвижения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ТаблицаДокумента.СчетНаОплату,
	|	СУММА(ВЫБОР
	|			КОГДА (НЕ ТаблицаДокумента.ПризнакАванса)
	|				ТОГДА 0
	|			КОГДА Константы.ВалютаУчета = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаУчета
	|			КОГДА ТаблицаДокумента.Валюта = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * КурсыВалютРасчетов.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА Константы.ВалютаУчета = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаУчета
	|			КОГДА ТаблицаДокумента.Валюта = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * КурсыВалютРасчетов.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	ВременнаяТаблицаПоставщики КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютСчета
	|		ПО ТаблицаДокумента.СчетНаОплату.ВалютаДокумента = КурсыВалютСчета.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО ТаблицаДокумента.Валюта = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТаблицаДокумента.ВестиУчетОплатыПоСчетам
	|	И ТИПЗНАЧЕНИЯ(ТаблицаДокумента.СчетНаОплату) = ТИП(Документ.СчетНаОплатуПоставщика)
	|	И ТаблицаДокумента.СчетНаОплату <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПоставщика.ПустаяСсылка)
	|	И ТаблицаДокумента.СчетНаОплату <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.ВидДвижения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ТаблицаДокумента.Заказ,
	|	СУММА(ВЫБОР
	|			КОГДА (НЕ ТаблицаДокумента.ПризнакАванса)
	|				ТОГДА 0
	|			КОГДА Константы.ВалютаУчета = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаУчета
	|			КОГДА ТаблицаДокумента.Валюта = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * КурсыВалютРасчетов.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА Константы.ВалютаУчета = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаУчета
	|			КОГДА ТаблицаДокумента.Валюта = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * КурсыВалютРасчетов.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	ВременнаяТаблицаПокупатели КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютСчета
	|		ПО ТаблицаДокумента.Заказ.ВалютаДокумента = КурсыВалютСчета.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО ТаблицаДокумента.Валюта = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТаблицаДокумента.ВестиУчетОплатыПоСчетам
	|	И ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Заказ) = ТИП(Документ.ЗаказПокупателя)
	|	И ТаблицаДокумента.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.ВидДвижения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ТаблицаДокумента.Заказ,
	|	СУММА(ВЫБОР
	|			КОГДА (НЕ ТаблицаДокумента.ПризнакАванса)
	|				ТОГДА 0
	|			КОГДА Константы.ВалютаУчета = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаУчета
	|			КОГДА ТаблицаДокумента.Валюта = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * КурсыВалютРасчетов.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА Константы.ВалютаУчета = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаУчета
	|			КОГДА ТаблицаДокумента.Валюта = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * КурсыВалютРасчетов.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) * ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	ВременнаяТаблицаПоставщики КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютСчета
	|		ПО ТаблицаДокумента.Заказ.ВалютаДокумента = КурсыВалютСчета.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО ТаблицаДокумента.Валюта = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТаблицаДокумента.ВестиУчетОплатыПоСчетам
	|	И ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Заказ) = ТИП(Документ.ЗаказПоставщику)
	|	И ТаблицаДокумента.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.ВидДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОплатаСчетовИЗаказов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаОплатаСчетовИЗаказов()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВзаимозачет);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.Документ.Статья КАК Статья,
	|	0 КАК СуммаДоходов,
	|	-ТаблицаДокумента.СуммаУчета КАК СуммаРасходов
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику))
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам),
	|	0,
	|	ТаблицаДокумента.СуммаУчета
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику))
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаДокумента.Документ.Статья,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ -ТаблицаДокумента.СуммаУчета
	|	КОНЕЦ
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаДокумента.Документ.Статья,
	|	-ТаблицаДокумента.СуммаУчета,
	|	0
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику))
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам),
	|	ТаблицаДокумента.СуммаУчета,
	|	0
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику))
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаДокумента.Документ.Статья,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ -ТаблицаДокумента.СуммаУчета
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыКассовыйМетод", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыКассовыйМетод()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВзаимозачет);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ.Статья
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|						ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|			КОНЕЦ
	|	КОНЕЦ КАК Статья,
	|	0 КАК СуммаДоходов,
	|	ТаблицаДокумента.СуммаУчета КАК СуммаРасходов
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику))
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА &Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ.Статья
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|						ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику)
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	ТаблицаДокумента.СуммаУчета
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику))
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ.Статья
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|						ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета,
	|	0
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику))
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА &Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ.Статья
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|						ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику)
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета,
	|	0
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику))
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ.Статья
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ -ТаблицаДокумента.СуммаУчета
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ.Статья
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ -ТаблицаДокумента.СуммаУчета
	|	КОНЕЦ
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыНераспределенные", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыНераспределенные()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВзаимозачет);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	Запрос.УстановитьПараметр("Период", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("МассивДокументов", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	
	// Формирование таблицы с суммами к списанию.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.Ссылка.ВидОперации КАК ВидОперации,
	|	СУММА(ТаблицаДокумента.СуммаУчета) КАК СуммаКСписанию
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	|	И НЕ ТаблицаДокумента.ПризнакАванса
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков денежных средств.
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДоходыИРасходыОтложенные");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Организация");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Документ", "Документ");
	Блокировка.Заблокировать();
	
	ТаблицаСуммыКСписанию = РезультатЗапроса.Выгрузить();
	
	// Формирование таблицы с остатками.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ДоходыИРасходыОтложенныеОстатки.Организация КАК Организация,
	|	ДоходыИРасходыОтложенныеОстатки.Документ КАК Документ,
	|	ДоходыИРасходыОтложенныеОстатки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	0 КАК СуммаДоходов,
	|	0 КАК СуммаРасходов,
	|	СУММА(ДоходыИРасходыОтложенныеОстатки.СуммаДоходовОстаток) КАК СуммаДоходовОстаток,
	|	СУММА(ДоходыИРасходыОтложенныеОстатки.СуммаРасходовОстаток) КАК СуммаРасходовОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДоходыИРасходыОтложенныеОстатки.Организация КАК Организация,
	|		ДоходыИРасходыОтложенныеОстатки.Документ КАК Документ,
	|		ДоходыИРасходыОтложенныеОстатки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ДоходыИРасходыОтложенныеОстатки.СуммаДоходовОстаток КАК СуммаДоходовОстаток,
	|		ДоходыИРасходыОтложенныеОстатки.СуммаРасходовОстаток КАК СуммаРасходовОстаток
	|	ИЗ
	|		РегистрНакопления.ДоходыИРасходыОтложенные.Остатки(
	|				,
	|				Организация = &Организация
	|					И Документ В
	|						(ВЫБРАТЬ
	|							ТаблицаДокумента.Документ
	|						ИЗ
	|							Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|						ГДЕ
	|							ТаблицаДокумента.Ссылка = &Ссылка
	|				
	|						ОБЪЕДИНИТЬ ВСЕ
	|				
	|						ВЫБРАТЬ
	|							ТаблицаДокумента.Документ
	|						ИЗ
	|							Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|						ГДЕ
	|							ТаблицаДокумента.Ссылка = &Ссылка)) КАК ДоходыИРасходыОтложенныеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаДоходыИРасходыОтложенные.Организация,
	|		ДвиженияДокументаДоходыИРасходыОтложенные.Документ,
	|		ДвиженияДокументаДоходыИРасходыОтложенные.НаправлениеДеятельности,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаДоходыИРасходыОтложенные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаДоходыИРасходыОтложенные.СуммаДоходов, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаДоходыИРасходыОтложенные.СуммаДоходов, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаДоходыИРасходыОтложенные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаДоходыИРасходыОтложенные.СуммаРасходов, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаДоходыИРасходыОтложенные.СуммаРасходов, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ДоходыИРасходыОтложенные КАК ДвиженияДокументаДоходыИРасходыОтложенные
	|	ГДЕ
	|		ДвиженияДокументаДоходыИРасходыОтложенные.Регистратор = &Ссылка) КАК ДоходыИРасходыОтложенныеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыИРасходыОтложенныеОстатки.Организация,
	|	ДоходыИРасходыОтложенныеОстатки.Документ,
	|	ДоходыИРасходыОтложенныеОстатки.НаправлениеДеятельности
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ";
	
	ТаблицаСуммыОстатки = Запрос.Выполнить().Выгрузить();
	
	ТаблицаСуммыОстатки.Индексы.Добавить("Документ");
	
	// Расчет сумм списания.
	Для каждого СтрокаСуммыКСписанию Из ТаблицаСуммыКСписанию Цикл
		СуммаКСписанию = СтрокаСуммыКСписанию.СуммаКСписанию;
		Отбор = Новый Структура("Документ", СтрокаСуммыКСписанию.Документ);
		МассивСтрокСуммыОстатки = ТаблицаСуммыОстатки.НайтиСтроки(Отбор);
		Для каждого СтрокаСуммыОстатки Из МассивСтрокСуммыОстатки Цикл
			Если СуммаКСписанию = 0 Тогда
				Продолжить
			ИначеЕсли СтрокаСуммыОстатки.СуммаДоходовОстаток < СуммаКСписанию Тогда
				СтрокаСуммыОстатки.СуммаДоходов = СтрокаСуммыОстатки.СуммаДоходовОстаток;
				СуммаКСписанию = СуммаКСписанию - СтрокаСуммыОстатки.СуммаДоходовОстаток;
			ИначеЕсли СтрокаСуммыОстатки.СуммаДоходовОстаток >= СуммаКСписанию Тогда
				СтрокаСуммыОстатки.СуммаДоходов = СуммаКСписанию;
				СуммаКСписанию = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Формирование таблицы с суммами к списанию.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.Ссылка.ВидОперации КАК ВидОперации,
	|	СУММА(ТаблицаДокумента.СуммаУчета) КАК СуммаКСписанию
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику)
	|	И НЕ ТаблицаДокумента.ПризнакАванса
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ"; 
	
	ТаблицаСуммыКСписанию = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаСуммыКСписанию Из ТаблицаСуммыКСписанию Цикл
		СуммаКСписанию = СтрокаСуммыКСписанию.СуммаКСписанию;
		Отбор = Новый Структура("Документ", СтрокаСуммыКСписанию.Документ);
		МассивСтрокСуммыОстатки = ТаблицаСуммыОстатки.НайтиСтроки(Отбор);
		Для каждого СтрокаСуммыОстатки Из МассивСтрокСуммыОстатки Цикл
			Если СуммаКСписанию = 0 Тогда
				Продолжить
			ИначеЕсли СтрокаСуммыОстатки.СуммаРасходовОстаток < СуммаКСписанию Тогда
				СтрокаСуммыОстатки.СуммаРасходов = СтрокаСуммыОстатки.СуммаРасходовОстаток;
				СуммаКСписанию = СуммаКСписанию - СтрокаСуммыОстатки.СуммаРасходовОстаток;
			ИначеЕсли СтрокаСуммыОстатки.СуммаРасходовОстаток >= СуммаКСписанию Тогда
				СтрокаСуммыОстатки.СуммаРасходов = СуммаКСписанию;
				СуммаКСписанию = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	
	// Формирование временной таблицы с суммами, статьями и направлениями
	// деятельности. Понадобится для формирования движений по доходам и расходам
	// кассовым методом.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Период КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Документ КАК Документ,
	|	Таблица.СуммаДоходов КАК СуммаДоходов,
	|	Таблица.СуммаРасходов КАК СуммаРасходов,
	|	Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВременнаяТаблицаТаблицаДоходыИРасходыОтложенные
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	(Таблица.СуммаДоходов > 0
	|			ИЛИ Таблица.СуммаРасходов > 0)";
	
	Запрос.УстановитьПараметр("Таблица", ТаблицаСуммыОстатки);
	
	Запрос.Выполнить();
	
	// Формирование таблицы для записи в регистр.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Таблица.Период КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Документ КАК Документ,
	|	Таблица.СуммаДоходов КАК СуммаДоходов,
	|	Таблица.СуммаРасходов КАК СуммаРасходов,
	|	Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	ВременнаяТаблицаТаблицаДоходыИРасходыОтложенные КАК Таблица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Таблица.Период,
	|	Таблица.Организация,
	|	&Ссылка,
	|	Таблица.СуммаДоходов,
	|	Таблица.СуммаРасходов,
	|	Таблица.НаправлениеДеятельности
	|ИЗ
	|	ВременнаяТаблицаТаблицаДоходыИРасходыОтложенные КАК Таблица";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыОтложенные", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыНераспределенные()  

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства)
	
	СтруктураСчетовКурсРазниц = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(СтруктураДополнительныеСвойства.ДляПроведения.Организация, СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВзаимозачет);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("КорректировкаДолга", НСтр("ka='ვალის კორექტირება';ru='Корректировка долга';en='adjustment of duty'"));
	Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеДоходы);
	Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеРасходы);
	
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность);
		
	Иначе
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);

	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	НЕОПРЕДЕЛЕНО КАК Заказ,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Валюта КАК Аналитика,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ТаблицаДокумента.Корреспонденция,
	|	ТаблицаДокумента.КорреспонденцияРегл,
	|	ТаблицаДокумента.Контрагент,
	|	&КорректировкаДолга,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.КорреспонденцияТипСчетаРегл = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.КорреспонденцияТипСчетаРегл = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета
	|ИЗ
	|	ВременнаяТаблицаПокупатели КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ТаблицаДокумента.Корреспонденция,
	|	ТаблицаДокумента.КорреспонденцияРегл,
	|	ТаблицаДокумента.Контрагент,
	|	&КорректировкаДолга,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|			ТОГДА ТаблицаДокумента.СуммаУчета
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета
	|ИЗ
	|	ВременнаяТаблицаПоставщики КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВзаимозачет);
	Запрос.УстановитьПараметр("Взаимозачет", "Взаимозачет");
	Запрос.УстановитьПараметр("ПереуступкаДолга", "Переуступка долга ");
	Запрос.УстановитьПараметр("КорректировкаДолга", "Корректировка долга ");
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПереводыВПути) КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	0 КАК СуммаВалДт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет)
	|				И ТаблицаДокумента.Ссылка.ВидПрочегоВзаимозачета = ЗНАЧЕНИЕ(Перечисление.ВидыПрочегоВзаимозачета.ДолгПрочегоКонтрагентаИДолгПередПоставщиком)
	|			ТОГДА ТаблицаДокумента.Ссылка.КорреспонденцияПрочиеРасчеты
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет)
	|				И ТаблицаДокумента.Ссылка.ВидПрочегоВзаимозачета = ЗНАЧЕНИЕ(Перечисление.ВидыПрочегоВзаимозачета.ДолгПрочегоКонтрагентаИДолгПередПоставщиком)
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияПрочиеРасчеты.Валютный
	|						ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем.Валютный
	|					ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет)
	|				И ТаблицаДокумента.Ссылка.ВидПрочегоВзаимозачета = ЗНАЧЕНИЕ(Перечисление.ВидыПрочегоВзаимозачета.ДолгПрочегоКонтрагентаИДолгПередПоставщиком)
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияПрочиеРасчеты.Валютный
	|						ТОГДА ТаблицаДокумента.СуммаРасчетов
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем.Валютный
	|					ТОГДА ТаблицаДокумента.СуммаРасчетов
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаВалКт,
	|	ТаблицаДокумента.СуммаУчета КАК Сумма,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА &Взаимозачет
	|		ИНАЧЕ &ПереуступкаДолга
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет))
	|	И НЕ ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя.Валютный
	|			ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПереводыВПути),
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ТаблицаДокумента.СуммаУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА &Взаимозачет
	|		ИНАЧЕ &ПереуступкаДолга
	|	КОНЕЦ
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА ТаблицаДокумента.Ссылка.Корреспонденция
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|				И ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|				И ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Корреспонденция
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				И ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				И ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета,
	|	&КорректировкаДолга
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|	И НЕ ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Корреспонденция
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|				И ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя.Валютный
	|			ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|				И ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Корреспонденция
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				И ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя.Валютный
	|			ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				И ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета,
	|	&КорректировкаДолга
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет)
	|				И ТаблицаДокумента.Ссылка.ВидПрочегоВзаимозачета = ЗНАЧЕНИЕ(Перечисление.ВидыПрочегоВзаимозачета.ДолгПокупателяИДолгПрочемуКонтрагенту)
	|			ТОГДА ТаблицаДокумента.Ссылка.КорреспонденцияПрочиеРасчеты
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет)
	|				И ТаблицаДокумента.Ссылка.ВидПрочегоВзаимозачета = ЗНАЧЕНИЕ(Перечисление.ВидыПрочегоВзаимозачета.ДолгПокупателяИДолгПрочемуКонтрагенту)
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияПрочиеРасчеты.Валютный
	|						ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный
	|					ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет)
	|				И ТаблицаДокумента.Ссылка.ВидПрочегоВзаимозачета = ЗНАЧЕНИЕ(Перечисление.ВидыПрочегоВзаимозачета.ДолгПокупателяИДолгПрочемуКонтрагенту)
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияПрочиеРасчеты.Валютный
	|						ТОГДА ТаблицаДокумента.СуммаРасчетов
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный
	|					ТОГДА ТаблицаДокумента.СуммаРасчетов
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПереводыВПути),
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ТаблицаДокумента.СуммаУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА &Взаимозачет
	|		ИНАЧЕ &ПереуступкаДолга
	|	КОНЕЦ
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет))
	|	И НЕ ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА ТаблицаДокумента.Ссылка.Корреспонденция
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|				И ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|				И ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Корреспонденция
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				И ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				И ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета,
	|	&КорректировкаДолга
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|	И НЕ ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Корреспонденция
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|				И ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику.Валютный
	|			ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|				И ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Корреспонденция
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				И ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику.Валютный
	|			ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				И ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПоставщику.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета,
	|	&КорректировкаДолга
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПереводыВПути),
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику.Валютный
	|			ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА &Взаимозачет
	|		ИНАЧЕ &ПереуступкаДолга
	|	КОНЕЦ
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаУчета / ТаблицаДокумента.Ссылка.СуммаУчета * ТаблицаДокумента.Ссылка.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА &Взаимозачет
	|		ИНАЧЕ &ПереуступкаДолга
	|	КОНЕЦ
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	|	И НЕ ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя.Валютный
	|			ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя.Валютный
	|			ТОГДА ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаУчета / ТаблицаДокумента.Ссылка.СуммаУчета * ТаблицаДокумента.Ссылка.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА &Взаимозачет
	|		ИНАЧЕ &ПереуступкаДолга
	|	КОНЕЦ
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	9,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаУчета / ТаблицаДокумента.Ссылка.СуммаУчета * ТаблицаДокумента.Ссылка.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА &Взаимозачет
	|		ИНАЧЕ &ПереуступкаДолга
	|	КОНЕЦ
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику)
	|	И НЕ ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	10,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику.Валютный
	|			ТОГДА ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаУчета / ТаблицаДокумента.Ссылка.СуммаУчета * ТаблицаДокумента.Ссылка.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПоставщику,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПоставщику.Валютный
	|			ТОГДА ТаблицаДокумента.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПоставщику.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаРасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СуммаУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА &Взаимозачет
	|		ИНАЧЕ &ПереуступкаДолга
	|	КОНЕЦ
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику)
	|	И ТаблицаДокумента.ПризнакАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	11,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СчетУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|				И ТаблицаДокумента.СчетУчета.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	|				И ТаблицаДокумента.СчетУчета.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	&КурсоваяРазница
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	12,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	|				И ТаблицаДокумента.СчетУчета.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СчетУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|				И ТаблицаДокумента.СчетУчета.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	&КурсоваяРазница
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаУправленческий()

Процедура СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства);

	ТаблицаСотрудники = Новый ТаблицаЗначений;
	ТаблицаСотрудники.Колонки.Добавить("Сотрудник", 				Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаСотрудники.Колонки.Добавить("ПенсионныйФонд",			Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаСотрудники.Колонки.Добавить("ДоговорПенсионногоФонда",	Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаСотрудники.Колонки.Добавить("ВидУдержанияПФ",			Новый ОписаниеТипов("СправочникСсылка.ВидыНачисленийИУдержаний"));
	ТаблицаСотрудники.Колонки.Добавить("ВидУдержанияНДФЛ",			Новый ОписаниеТипов("СправочникСсылка.ВидыНачисленийИУдержаний"));
	ТаблицаСотрудники.Колонки.Добавить("ВидНалога",					Новый ОписаниеТипов("СправочникСсылка.ВидыНалогов"));
	ТаблицаСотрудники.Колонки.Добавить("ВидНалогаВыплат",			Новый ОписаниеТипов("СправочникСсылка.ВидыНалогов"));	
	ТаблицаСотрудники.Колонки.Добавить("ПериодРегистрации",			Новый ОписаниеТипов("Дата"));
	ТаблицаСотрудники.Колонки.Добавить("СтавкаНДФЛ",				Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	ТаблицаСотрудники.Колонки.Добавить("СтавкаПФ",					Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	ПредидущийПериод	= Дата(1,1,1);
	Для Каждого СтрокатС ИЗ ДокументСсылкаВзаимозачет.РасчетыСПерсоналом Цикл
		Если НЕ ПредидущийПериод = СтрокатС.ПериодРегистрации Тогда
			ПредидущийПериод = СтрокатС.ПериодРегистрации;	
			
			СтрокаС = ТаблицаСотрудники.Добавить();
			СтрокаС.Сотрудник = ДокументСсылкаВзаимозачет.Сотрудник; 
			СтрокаС.ПенсионныйФонд = ДокументСсылкаВзаимозачет.ВидУдержанияПФ.Контрагент;
			СтрокаС.ДоговорПенсионногоФонда = ДокументСсылкаВзаимозачет.ВидУдержанияПФ.Договор;
			СтрокаС.ВидУдержанияПФ = ДокументСсылкаВзаимозачет.ВидУдержанияПФ;
			СтрокаС.ВидУдержанияНДФЛ = ДокументСсылкаВзаимозачет.ВидУдержанияНДФЛ;
			СтрокаС.ВидНалога = ДокументСсылкаВзаимозачет.ВидУдержанияНДФЛ.ВидНалога;
			СтрокаС.ВидНалогаВыплат = ДокументСсылкаВзаимозачет.ВидУдержанияНДФЛ.ВидНалогаВыплат;
			СтрокаС.ПериодРегистрации = СтрокатС.ПериодРегистрации ;
			СтрокаС.СтавкаНДФЛ = ДокументСсылкаВзаимозачет.ВидУдержанияНДФЛ.СтавкаНДФЛ;
			СтрокаС.СтавкаПФ = ДокументСсылкаВзаимозачет.ВидУдержанияНДФЛ.СтавкаПФ;			
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		 "ВЫБРАТЬ
		 |	ТаблицаСотрудники.Сотрудник КАК Сотрудник,
		 |	ТаблицаСотрудники.ПериодРегистрации КАК ПериодРегистрации,
		 |	ТаблицаСотрудники.ПенсионныйФонд КАК ПенсионныйФонд,
		 |	ТаблицаСотрудники.ДоговорПенсионногоФонда КАК ДоговорПенсионногоФонда,
		 |	ТаблицаСотрудники.СтавкаНДФЛ КАК СтавкаНДФЛ,
		 |	ВЫРАЗИТЬ(ТаблицаСотрудники.ВидУдержанияПФ КАК Справочник.ВидыНачисленийИУдержаний) КАК ВидУдержанияПФ,
		 |	ТаблицаСотрудники.СтавкаПФ КАК СтавкаПФ,
		 |	ТаблицаСотрудники.ВидНалога КАК ВидНалога,
		 |	ТаблицаСотрудники.ВидНалогаВыплат КАК ВидНалогаВыплат,
		 |	ТаблицаСотрудники.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ
		 |ПОМЕСТИТЬ ТаблицаСотрудники
		 |ИЗ
		 |	&ТаблицаСотрудники КАК ТаблицаСотрудники
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	Взаимозачет.СуммаВал КАК СуммаВал,
		 |	Взаимозачет.Валюта КАК Валюта,
		 |	Взаимозачет.Сумма КАК Сумма,
		 |	Взаимозачет.Ссылка КАК Ссылка,
		 |	Взаимозачет.НомерСтроки КАК НомерСтроки,
		 |	Взаимозачет.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		 |	ВЫРАЗИТЬ(ТаблицаСотрудники.ВидУдержанияПФ КАК Справочник.ВидыНачисленийИУдержаний) КАК ВидУдержанияПФ,
		 |	Взаимозачет.СуммаПФ КАК СуммаПФ,
		 |	Взаимозачет.СуммаНДФЛ КАК СуммаНДФЛ,
		 |	Взаимозачет.Ссылка.Организация КАК Организация,
		 |	Взаимозачет.Ссылка.Сотрудник КАК Сотрудник,
		 |	Взаимозачет.ПериодРегистрации КАК ПериодРегистрации,
		 |	ТаблицаСотрудники.ВидНалога КАК ВидНалога,
		 |	ТаблицаСотрудники.ВидНалогаВыплат КАК ВидНалогаВыплат,
		 |	ВЫРАЗИТЬ(ТаблицаСотрудники.ВидУдержанияНДФЛ КАК Справочник.ВидыНачисленийИУдержаний) КАК ВидУдержанияНДФЛ,
		 |	Взаимозачет.Всего КАК Всего,
		 |	Взаимозачет.СуммаВал / ((100 - Взаимозачет.Ссылка.ВидУдержанияНДФЛ.СтавкаНДФЛ) / 100) * (Взаимозачет.Ссылка.ВидУдержанияНДФЛ.СтавкаНДФЛ / 100) КАК СуммаНДФЛВал
		 |ПОМЕСТИТЬ РасчетСПерсоналом
		 |ИЗ
		 |	Документ.Взаимозачет.РасчетыСПерсоналом КАК Взаимозачет
		 |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСотрудники КАК ТаблицаСотрудники
		 |		ПО Взаимозачет.ПериодРегистрации = ТаблицаСотрудники.ПериодРегистрации
		 |			И Взаимозачет.Ссылка.Сотрудник = ТаблицаСотрудники.Сотрудник
		 |ГДЕ
		 |	Взаимозачет.Ссылка = &Ссылка
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	ВЫРАЗИТЬ(ТаблицаСотрудники.ВидУдержанияПФ КАК Справочник.ВидыНачисленийИУдержаний) КАК ВидУдержанияПФ,
		 |	Взаимозачет.СуммаПФ КАК СуммаПФ,
		 |	Взаимозачет.НомерСтроки КАК НомерСтроки,
		 |	Взаимозачет.Ссылка.Дата КАК Период,
		 |	Взаимозачет.Ссылка.Организация КАК Организация,
		 |	Взаимозачет.Ссылка.ВидУдержанияПФ.Контрагент КАК Контрагент,
		 |	Взаимозачет.Валюта КАК Валюта,
		 |	Взаимозачет.СуммаВал / ((100 - Взаимозачет.Ссылка.ВидУдержанияНДФЛ.СтавкаНДФЛ) / 100) * (Взаимозачет.Ссылка.ВидУдержанияНДФЛ.СтавкаНДФЛ / 100) КАК СуммаНДФЛВал,
		 |	Взаимозачет.СуммаВал КАК СуммаВал,
		 |	ТаблицаСотрудники.Сотрудник КАК Сотрудник,
		 |	ТаблицаСотрудники.ПериодРегистрации КАК ПериодРегистрации
		 |ПОМЕСТИТЬ Пф
		 |ИЗ
		 |	Документ.Взаимозачет.РасчетыСПерсоналом КАК Взаимозачет
		 |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСотрудники КАК ТаблицаСотрудники
		 |		ПО Взаимозачет.ПериодРегистрации = ТаблицаСотрудники.ПериодРегистрации
		 |			И Взаимозачет.Ссылка.Сотрудник = ТаблицаСотрудники.Сотрудник
		 |ГДЕ
		 |	Взаимозачет.Ссылка = &Ссылка
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	&Организация КАК Организация,
		 |	&Период КАК Период,
		 |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		 |	РасчетСПерсоналом.ВидНалога КАК ВидНалога,
		 |	РасчетСПерсоналом.СуммаНДФЛ КАК Сумма,
		 |	&РасчетыПоНалогам КАК СодержаниеПроводки
		 |ИЗ
		 |	ТаблицаСотрудники КАК ТаблицаСотрудники,
		 |	РасчетСПерсоналом КАК РасчетСПерсоналом
		 |ГДЕ
		 |	РасчетСПерсоналом.СуммаНДФЛ > 0
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	&Организация,
		 |	&Период,
		 |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		 |	РасчетСПерсоналом.ВидНалогаВыплат,
		 |	РасчетСПерсоналом.СуммаНДФЛ,
		 |	&РасчетыПоНалогам
		 |ИЗ
		 |	РасчетСПерсоналом КАК РасчетСПерсоналом
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСотрудники КАК ТаблицаСотрудники
		 |		ПО РасчетСПерсоналом.ПериодРегистрации = ТаблицаСотрудники.ПериодРегистрации
		 |ГДЕ
		 |	РасчетСПерсоналом.СуммаНДФЛ > 0
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	&Организация КАК Организация,
		 |	&Период КАК Период,
		 |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		 |	РасчетСПерсоналом.Сотрудник КАК Сотрудник,
		 |	РасчетСПерсоналом.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		 |	РасчетСПерсоналом.Валюта КАК Валюта,
		 |	РасчетСПерсоналом.ПериодРегистрации КАК ПериодРегистрации,
		 |	РасчетСПерсоналом.Сумма КАК Сумма,
		 |	РасчетСПерсоналом.СуммаВал КАК СуммаВал,
		 |	&РасчетыСПерсоналом КАК СодержаниеПроводки
		 |ИЗ
		 |	РасчетСПерсоналом КАК РасчетСПерсоналом
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	Пф.НомерСтроки КАК НомерСтроки,
		 |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		 |	Пф.Период КАК Период,
		 |	Пф.Организация КАК Организация,
		 |	Пф.Сотрудник КАК Плательщик,
		 |	Пф.Сотрудник КАК СотрудникКонтрагент,
		 |	Пф.ПериодРегистрации КАК ПериодРегистрации,
		 |	Пф.ВидУдержанияПФ КАК ВидНачисленияУдержания,
		 |	Пф.Валюта КАК Валюта,
		 |	Пф.СуммаПФ КАК Сумма,
		 |	(Пф.СуммаВал + Пф.СуммаНДФЛВал) / ((100 - Пф.ВидУдержанияПФ.СтавкаПФ) / 100) * (Пф.ВидУдержанияПФ.СтавкаПФ / 100) КАК СуммаВал,
		 |	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
		 |	&НалогПенсионногоФонда КАК СодержаниеПроводки
		 |ИЗ
		 |	Пф КАК Пф
		 |ГДЕ
		 |	Пф.СуммаПФ > 0
		 |	И НЕ Пф.ВидУдержанияПФ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	Пф.НомерСтроки,
		 |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		 |	Пф.Период,
		 |	Пф.Организация,
		 |	Пф.Организация,
		 |	Пф.Сотрудник,
		 |	Пф.ПериодРегистрации,
		 |	Пф.ВидУдержанияПФ,
		 |	Пф.Валюта,
		 |	Пф.СуммаПФ,
		 |	(Пф.СуммаВал + Пф.СуммаНДФЛВал) / ((100 - Пф.ВидУдержанияПФ.СтавкаПФ) / 100) * (Пф.ВидУдержанияПФ.СтавкаПФ / 100),
		 |	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
		 |	&НалогПенсионногоФонда
		 |ИЗ
		 |	Пф КАК Пф
		 |ГДЕ
		 |	Пф.СуммаПФ > 0
		 |	И НЕ Пф.ВидУдержанияПФ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	Пф.НомерСтроки,
		 |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		 |	Пф.Период,
		 |	Пф.Организация,
		 |	НЕОПРЕДЕЛЕНО,
		 |	НЕОПРЕДЕЛЕНО,
		 |	НЕОПРЕДЕЛЕНО,
		 |	Пф.ВидУдержанияПФ,
		 |	Пф.Валюта,
		 |	Пф.СуммаПФ * 2,
		 |	(Пф.СуммаВал + Пф.СуммаНДФЛВал) / ((100 - Пф.ВидУдержанияПФ.СтавкаПФ) / 100) * (Пф.ВидУдержанияПФ.СтавкаПФ / 100) * 2,
		 |	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате),
		 |	&НалогПенсионногоФонда
		 |ИЗ
		 |	Пф КАК Пф
		 |ГДЕ
		 |	Пф.СуммаПФ > 0
		 |	И НЕ Пф.ВидУдержанияПФ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	РасчетСПерсоналом.Ссылка.Дата КАК Период,
		 |	РасчетСПерсоналом.Организация КАК Организация,
		 |	РасчетСПерсоналом.Сотрудник КАК Получатель,
		 |	РасчетСПерсоналом.ВидУдержанияНДФЛ.СтавкаНДФЛ КАК СтавкаНДФЛ,
		 |	РасчетСПерсоналом.Всего КАК СуммаВыдачи,
		 |	РасчетСПерсоналом.СуммаНДФЛ КАК СуммаНДФЛ,
		 |	РасчетСПерсоналом.СуммаПФ КАК СуммаПФСотрудника,
		 |	РасчетСПерсоналом.СуммаПФ КАК СуммаПФОрганизации,
		 |	ВЫБОР
		 |		КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(РасчетСПерсоналом.ВидУдержанияНДФЛ КАК Справочник.ВидыНачисленийИУдержаний).СтавкаНДФЛ, 0) = 0
		 |			ТОГДА РасчетСПерсоналом.Сумма + РасчетСПерсоналом.СуммаНДФЛ + РасчетСПерсоналом.СуммаПФ
		 |		ИНАЧЕ РасчетСПерсоналом.СуммаПФ
		 |	КОНЕЦ КАК СуммаЛьготы
		 |ИЗ
		 |	РасчетСПерсоналом КАК РасчетСПерсоналом
		 |ГДЕ
		 |	НЕ РасчетСПерсоналом.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	РасчетСПерсоналом.Ссылка.Дата КАК Период,
		 |	РасчетСПерсоналом.Организация КАК Организация,
		 |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		 |	РасчетСПерсоналом.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		 |	РасчетСПерсоналом.Сотрудник КАК Сотрудник,
		 |	РасчетСПерсоналом.ПериодРегистрации КАК ПериодРегистрации,
		 |	РасчетСПерсоналом.Валюта КАК Валюта,
		 |	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
		 |	РасчетСПерсоналом.СуммаНДФЛ КАК Сумма,
		 |	РасчетСПерсоналом.СуммаНДФЛВал КАК СуммаВал,
		 |	&ПогашениеНалога КАК СодержаниеПроводки
		 |ИЗ
		 |	РасчетСПерсоналом КАК РасчетСПерсоналом
		 |ГДЕ
		 |	НЕ РасчетСПерсоналом.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	РасчетСПерсоналом.Ссылка.Дата,
		 |	РасчетСПерсоналом.Организация,
		 |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		 |	РасчетСПерсоналом.ВидУдержанияНДФЛ,
		 |	РасчетСПерсоналом.Сотрудник,
		 |	РасчетСПерсоналом.ПериодРегистрации,
		 |	РасчетСПерсоналом.Валюта,
		 |	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате),
		 |	РасчетСПерсоналом.СуммаНДФЛ,
		 |	РасчетСПерсоналом.СуммаНДФЛВал,
		 |	&НачислениеНалога
		 |ИЗ
		 |	РасчетСПерсоналом КАК РасчетСПерсоналом
		 |ГДЕ
		 |	НЕ РасчетСПерсоналом.ВидУдержанияНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)" ;
	
	Запрос.УстановитьПараметр("Организация",ДокументСсылкаВзаимозачет.Организация);
	Запрос.УстановитьПараметр("Период",	СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	Запрос.УстановитьПараметр("ТаблицаСотрудники",ТаблицаСотрудники);
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылкаВзаимозачет);
	Запрос.УстановитьПараметр("РасчетыПоНалогам",НСтр("ru='Подоходный налог с выплат';ka='გადახდების საშემოსავლო გადასახადი'"));
	Запрос.УстановитьПараметр("РасчетыСПерсоналом",НСтр("ru='Погашение обязательств перед персоналом';ka='პერსონალის წინაშე ვალდებულებების დაფარვა'"));
	Запрос.УстановитьПараметр("НалогПенсионногоФонда",НСтр("ka='საპენსიო ფონდის გადასახადი';ru='Налог пенсионного фонда';en='Tax pension fund'"));
	Запрос.УстановитьПараметр("НачислениеНалога",	НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога';en='tax accrual'"));
	Запрос.УстановитьПараметр("ПогашениеНалога",	НСтр("ka='გადასახადის დაფარვა';ru='Погашение налога';en='repayment of the tax'"));	
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", МассивРезультатов[3].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПерсоналом", МассивРезультатов[4].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПенсионнымФондом", МассивРезультатов[5].Выгрузить());
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДекларация", МассивРезультатов[6].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", МассивРезультатов[7].Выгрузить());

	// Kuzmich, 24.11.2024, (ONESOFT-3522) Декларация для ИП (Индивидуальный предприниматель)
	ТаблицаДекларация = МассивРезультатов[6].Выгрузить();
	Если СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаДекларация") И СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДекларация.Количество()>0 Тогда
		
		Для каждого СтрокаТаблицаДекларация Из ТаблицаДекларация Цикл
		
			НоваяСтрокаТаблицаДекларация = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДекларация.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицаДекларация,СтрокаТаблицаДекларация);
		
		КонецЦикла;
	
	Иначе
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДекларация", ТаблицаДекларация);
	
	КонецЕсли;
	// Kuzmich, 24.11.2024, (ONESOFT-3522) Декларация для ИП (Индивидуальный предприниматель)
КонецПроцедуры                        

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВзаимозачет);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Взаимозачет", НСтр("ka='ურთიერთჩათვლა';ru='Взаимозачет';en='netting'"));
	Запрос.УстановитьПараметр("ПереуступкаДолга", НСтр("ka='ვალის გადაპირება';ru='Переуступка долга';en='novation'"));
	Запрос.УстановитьПараметр("КорректировкаДолга", НСтр("ka='ვალის კორექტირება';ru='Корректировка долга';en='adjustment of duty'"));
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("УчетРасчетовПоПрочимОперациям", НСтр("ka='სხვა ოპერაციების მიხედვით ანგარიშსწორების აღრიცხვა';ru='Учет расчетов по прочим операциям';en='The account of calculations on other transactions'"));
	Запрос.УстановитьПараметр("Комментарий", НСтр("ka='ურთიერთჩათვლა';ru='Взаимозачет';en='netting'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаДокумента.ПризнакАванса КАК ПризнакАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ КАК ТипРасчетов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Документ ССЫЛКА Документ.РасходнаяНакладная
	|					ИЛИ ТаблицаДокумента.Документ ССЫЛКА Документ.ЗаказПокупателя)
	|				И (ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.ПоступлениеВКассу
	|					ИЛИ ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.ПоступлениеНаСчет)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.Ссылка.ВидОперации КАК ВидОперации,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник КАК Контрагент,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов КАК Валюта,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ТаблицаДокумента.СчетНаОплату КАК СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.Корреспонденция КАК Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл КАК КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета КАК КорреспонденцияТипСчета,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета КАК КорреспонденцияТипСчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателяРегл
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателемРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Ссылка.Дата КАК Дата,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаРасчетов,
	|	СУММА(ТаблицаДокумента.СуммаУчета) КАК СуммаУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА СУММА(ТаблицаДокумента.СуммаРасчетов)
	|		ИНАЧЕ -СУММА(ТаблицаДокумента.СуммаРасчетов)
	|	КОНЕЦ КАК СуммаРасчетовОстаток,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА СУММА(ТаблицаДокумента.СуммаУчета)
	|		ИНАЧЕ -СУММА(ТаблицаДокумента.СуммаУчета)
	|	КОНЕЦ КАК СуммаУчетаОстаток,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА &Взаимозачет
	|		ИНАЧЕ &ПереуступкаДолга
	|	КОНЕЦ КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаПокупатели
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	            //Малышев 2025-02-24
	|			ИЛИ (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет)
	|				И ТаблицаДокумента.Ссылка.ВидПрочегоВзаимозачета = ЗНАЧЕНИЕ(Перечисление.ВидыПрочегоВзаимозачета.ДолгПокупателяИДолгПрочемуКонтрагенту))
	
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ЗачетДолгаПокупателяПерсонала))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателяРегл
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателемРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Ссылка.Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Документ ССЫЛКА Документ.РасходнаяНакладная
	|					ИЛИ ТаблицаДокумента.Документ ССЫЛКА Документ.ЗаказПокупателя)
	|				И (ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.ПоступлениеВКассу
	|					ИЛИ ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.ПоступлениеНаСчет)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ = НЕОПРЕДЕЛЕНО
	|			ТОГДА &Ссылка
	|		ИНАЧЕ ТаблицаДокумента.Документ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.ПризнакАванса
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателяРегл
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателемРегл
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателяРегл
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателемРегл
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателяРегл
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателемРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов),
	|	СУММА(ТаблицаДокумента.СуммаУчета),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|			ТОГДА СУММА(ТаблицаДокумента.СуммаРасчетов)
	|		ИНАЧЕ -СУММА(ТаблицаДокумента.СуммаРасчетов)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|			ТОГДА СУММА(ТаблицаДокумента.СуммаУчета)
	|		ИНАЧЕ -СУММА(ТаблицаДокумента.СуммаУчета)
	|	КОНЕЦ,
	|	&КорректировкаДолга
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателя
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателем
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателяРегл
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателемРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Ссылка.Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.ПризнакАванса
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателяРегл
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателемРегл
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателяРегл
	|		КОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателемРегл
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПокупателяРегл
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПокупателемРегл
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|						ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|						И (ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.ПоступлениеВКассу
	|							ИЛИ ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.ПоступлениеНаСчет)
	|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА &Ссылка
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.ДокументРасчетов
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.Договор,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.Заказ,
	|	ТаблицаДокумента.Ссылка.СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.Ссылка.СуммаУчета = 0
	|				ТОГДА 0
	|			ИНАЧЕ ТаблицаДокумента.СуммаУчета / ТаблицаДокумента.Ссылка.СуммаУчета * ТаблицаДокумента.Ссылка.СуммаРасчетов
	|		КОНЕЦ),
	|	СУММА(ТаблицаДокумента.СуммаУчета),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|						ТОГДА -1
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|	КОНЕЦ * СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.Ссылка.СуммаУчета = 0
	|				ТОГДА 0
	|			ИНАЧЕ ТаблицаДокумента.СуммаУчета / ТаблицаДокумента.Ссылка.СуммаУчета * ТаблицаДокумента.Ссылка.СуммаРасчетов
	|		КОНЕЦ),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|						ТОГДА -СУММА(ТаблицаДокумента.СуммаУчета)
	|					ИНАЧЕ СУММА(ТаблицаДокумента.СуммаУчета)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|					ТОГДА -СУММА(ТаблицаДокумента.СуммаУчета)
	|				ИНАЧЕ СУММА(ТаблицаДокумента.СуммаУчета)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА &Взаимозачет
	|		ИНАЧЕ &ПереуступкаДолга
	|	КОНЕЦ
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.ПризнакАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Ссылка.Договор,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА &Ссылка
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.ДокументРасчетов
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Заказ,
	|	ТаблицаДокумента.Ссылка.СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|						ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|						И (ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.ПоступлениеВКассу
	|							ИЛИ ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.ПоступлениеНаСчет)
	|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.ПризнакАванса,
	|	ТаблицаДокумента.Ссылка.ДокументРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.ПризнакАванса КАК ПризнакАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ КАК ТипРасчетов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
	|		КОГДА (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет))
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И ТаблицаДокумента.Ссылка.ВидПрочегоВзаимозачета = ЗНАЧЕНИЕ(Перечисление.ВидыПрочегоВзаимозачета.ДолгПокупателяИДолгПрочемуКонтрагенту)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
	|		КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПриходнаяНакладная
	|				И ТаблицаДокумента.Ссылка.ДокументРасчетов <> НЕОПРЕДЕЛЕНО
	|				И (ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходСоСчета
	|						И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходСоСчета.ПустаяСсылка)
	|					ИЛИ ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходИзКассы
	|						И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходИзКассы.ПустаяСсылка))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПриходнаяНакладная
	|				И (ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходСоСчета
	|					ИЛИ ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходИзКассы)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПриходнаяНакладная
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
	|		КОГДА НЕ ТаблицаДокумента.ПризнакАванса
	|				И ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|				И ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
	|		КОГДА НЕ ТаблицаДокумента.ПризнакАванса
	|				И ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|				И ТаблицаДокумента.Ссылка.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходИзКассы
	|						И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходИзКассы.ПустаяСсылка)
	|					ИЛИ ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходСоСчета
	|						И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходСоСчета.ПустаяСсылка))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|				И ТаблицаДокумента.Ссылка.Контрагент.Поставщик
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.Ссылка.ВидОперации КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет)
	|					И ТаблицаДокумента.Ссылка.ВидПрочегоВзаимозачета = ЗНАЧЕНИЕ(Перечисление.ВидыПрочегоВзаимозачета.ДолгПрочегоКонтрагентаИДолгПередПоставщиком)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|	КОНЕЦ КАК ВестиРасчетыПоДоговорам,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|	КОНЕЦ КАК ВестиРасчетыПоДокументам,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|	КОНЕЦ КАК ВестиРасчетыПоЗаказам,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|	КОНЕЦ КАК ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов КАК Валюта,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ТаблицаДокумента.СчетНаОплату КАК СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.Корреспонденция КАК Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл КАК КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета КАК КорреспонденцияТипСчета,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета КАК КорреспонденцияРеглТипСчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|						ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику
	|					ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПоставщику
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|					ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком
	|				ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПоставщиком
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|						ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|					ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПоставщикуРегл
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|					ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|				ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПоставщикомРегл
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Ссылка.Дата КАК Дата,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаРасчетов,
	|	СУММА(ТаблицаДокумента.СуммаУчета) КАК СуммаУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА СУММА(ТаблицаДокумента.СуммаРасчетов)
	|		ИНАЧЕ -СУММА(ТаблицаДокумента.СуммаРасчетов)
	|	КОНЕЦ КАК СуммаРасчетовОстаток,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА СУММА(ТаблицаДокумента.СуммаУчета)
	|		ИНАЧЕ -СУММА(ТаблицаДокумента.СуммаУчета)
	|	КОНЕЦ КАК СуммаУчетаОстаток,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА &Взаимозачет
	|		ИНАЧЕ &ПереуступкаДолга
	|	КОНЕЦ КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаПоставщики
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику)
	|			ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет)
	|				И ТаблицаДокумента.Ссылка.ВидПрочегоВзаимозачета = ЗНАЧЕНИЕ(Перечисление.ВидыПрочегоВзаимозачета.ДолгПрочегоКонтрагентаИДолгПередПоставщиком))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|						ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику
	|					ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПоставщику
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|					ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком
	|				ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПоставщиком
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|						ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|					ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаАвансовПоставщикуРегл
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|					ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|				ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.СчетУчетаРасчетовСПоставщикомРегл
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДоговорам
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоДокументам
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиРасчетыПоЗаказам
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник.ВестиУчетОплатыПоСчетам
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет)
	|					И ТаблицаДокумента.Ссылка.ВидПрочегоВзаимозачета = ЗНАЧЕНИЕ(Перечисление.ВидыПрочегоВзаимозачета.ДолгПрочегоКонтрагентаИДолгПередПоставщиком)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
	|		КОГДА (ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|				ИЛИ ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет))
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И ТаблицаДокумента.Ссылка.ВидПрочегоВзаимозачета = ЗНАЧЕНИЕ(Перечисление.ВидыПрочегоВзаимозачета.ДолгПокупателяИДолгПрочемуКонтрагенту)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
	|		КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПриходнаяНакладная
	|				И ТаблицаДокумента.Ссылка.ДокументРасчетов <> НЕОПРЕДЕЛЕНО
	|				И (ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходСоСчета
	|						И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходСоСчета.ПустаяСсылка)
	|					ИЛИ ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходИзКассы
	|						И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходИзКассы.ПустаяСсылка))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПриходнаяНакладная
	|				И (ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходСоСчета
	|					ИЛИ ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходИзКассы)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПриходнаяНакладная
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
	|		КОГДА НЕ ТаблицаДокумента.ПризнакАванса
	|				И ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|				И ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
	|		КОГДА НЕ ТаблицаДокумента.ПризнакАванса
	|				И ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|				И ТаблицаДокумента.Ссылка.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходИзКассы
	|						И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходИзКассы.ПустаяСсылка)
	|					ИЛИ ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходСоСчета
	|						И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходСоСчета.ПустаяСсылка))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|				И ТаблицаДокумента.Ссылка.Контрагент.Поставщик
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				И (ТаблицаДокумента.Документ ССЫЛКА Документ.ПриходнаяНакладная
	|					ИЛИ ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|					ИЛИ ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				И ТаблицаДокумента.Документ ССЫЛКА Документ.ДополнительныеРасходы
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				И ТаблицаДокумента.Документ ССЫЛКА Документ.ПриходнаяНакладная
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ = НЕОПРЕДЕЛЕНО
	|			ТОГДА &Ссылка
	|		ИНАЧЕ ТаблицаДокумента.Документ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов),
	|	СУММА(ТаблицаДокумента.СуммаУчета),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|			ТОГДА -СУММА(ТаблицаДокумента.СуммаРасчетов)
	|		ИНАЧЕ СУММА(ТаблицаДокумента.СуммаРасчетов)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|			ТОГДА -СУММА(ТаблицаДокумента.СуммаУчета)
	|		ИНАЧЕ СУММА(ТаблицаДокумента.СуммаУчета)
	|	КОНЕЦ,
	|	&КорректировкаДолга
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|	И ТаблицаДокумента.СуммаРасчетов <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.КонтрагентИсточник
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Ссылка.Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				И (ТаблицаДокумента.Документ ССЫЛКА Документ.ПриходнаяНакладная
	|					ИЛИ ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|					ИЛИ ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				И ТаблицаДокумента.Документ ССЫЛКА Документ.ДополнительныеРасходы
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|				И ТаблицаДокумента.Документ ССЫЛКА Документ.ПриходнаяНакладная
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|				И НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам
	|				И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику)
	|				И НЕ ТаблицаДокумента.ПризнакАванса
	|				И (ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|					ИЛИ ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|							И (ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|								ИЛИ ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы)
	|						ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|							И (ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|								ИЛИ ТаблицаДокумента.Документ ССЫЛКА Документ.ДополнительныеРасходы)
	|						ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//+++ Дмгг, 25.07.25, ONESOFT-4195 
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|							И ТаблицаДокумента.Документ ССЫЛКА Документ.АвансовыйОтчет
	|						ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//--- Дмгг, 25.07.25, ONESOFT-4195
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|								ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
	|							ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
	|				КОГДА НЕ ТаблицаДокумента.ПризнакАванса
	|						И (ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|							ИЛИ ТаблицаДокумента.Документ ССЫЛКА Документ.ДополнительныеРасходы)
	|						И ТаблицаДокумента.Ссылка.ПризнакАванса
	|						И (ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходИзКассы
	|								И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходИзКассы.ПустаяСсылка)
	|							ИЛИ ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходСоСчета
	|								И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходСоСчета.ПустаяСсылка))
	|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|						И ТаблицаДокумента.Документ ССЫЛКА Документ.ПриходнаяНакладная
	|						И ТаблицаДокумента.Ссылка.ДокументРасчетов <> НЕОПРЕДЕЛЕНО
	|						И (ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходСоСчета
	|								И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходСоСчета.ПустаяСсылка)
	|							ИЛИ ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходИзКассы
	|								И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходИзКассы.ПустаяСсылка))
	|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА &Ссылка
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.ДокументРасчетов
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.Договор,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.Заказ,
	|	ТаблицаДокумента.Ссылка.СчетНаОплату,
	|	ТаблицаДокумента.Ссылка.Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.Ссылка.СуммаУчета = 0
	|				ТОГДА 0
	|			ИНАЧЕ ТаблицаДокумента.СуммаУчета / ТаблицаДокумента.Ссылка.СуммаУчета * ТаблицаДокумента.Ссылка.СуммаРасчетов
	|		КОНЕЦ),
	|	СУММА(ТаблицаДокумента.СуммаУчета),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|						ТОГДА -1
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|	КОНЕЦ * СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.Ссылка.СуммаУчета = 0
	|				ТОГДА 0
	|			ИНАЧЕ ТаблицаДокумента.СуммаУчета / ТаблицаДокумента.Ссылка.СуммаУчета * ТаблицаДокумента.Ссылка.СуммаРасчетов
	|		КОНЕЦ),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|						ТОГДА -СУММА(ТаблицаДокумента.СуммаУчета)
	|					ИНАЧЕ СУММА(ТаблицаДокумента.СуммаУчета)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|					ТОГДА -СУММА(ТаблицаДокумента.СуммаУчета)
	|				ИНАЧЕ СУММА(ТаблицаДокумента.СуммаУчета)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.Взаимозачет)
	|			ТОГДА &Взаимозачет
	|		ИНАЧЕ &ПереуступкаДолга
	|	КОНЕЦ
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|				И ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Ссылка.Договор,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.Корреспонденция,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл.ТипСчета,
	|	ТаблицаДокумента.Ссылка.Заказ,
	|	ТаблицаДокумента.Ссылка.СчетНаОплату,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА &Ссылка
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.ДокументРасчетов
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|							И (ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|								ИЛИ ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы)
	|						ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|							И (ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|								ИЛИ ТаблицаДокумента.Документ ССЫЛКА Документ.ДополнительныеРасходы)
	|						ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//+++ Дмгг, 25.07.25, ONESOFT-4195 
	|					КОГДА ТаблицаДокумента.ПризнакАванса
	|							И ТаблицаДокумента.Документ ССЫЛКА Документ.АвансовыйОтчет
	|						ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//--- Дмгг, 25.07.25, ONESOFT-4195
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|								ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
	|							ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.КорреспонденцияРегл.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
	|				КОГДА НЕ ТаблицаДокумента.ПризнакАванса
	|						И (ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|							ИЛИ ТаблицаДокумента.Документ ССЫЛКА Документ.ДополнительныеРасходы)
	|						И ТаблицаДокумента.Ссылка.ПризнакАванса
	|						И (ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходИзКассы
	|								И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходИзКассы.ПустаяСсылка)
	|							ИЛИ ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходСоСчета
	|								И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходСоСчета.ПустаяСсылка))
	|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|						И ТаблицаДокумента.Документ ССЫЛКА Документ.ПриходнаяНакладная
	|						И ТаблицаДокумента.Ссылка.ДокументРасчетов <> НЕОПРЕДЕЛЕНО
	|						И (ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходСоСчета
	|								И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходСоСчета.ПустаяСсылка)
	|							ИЛИ ТаблицаДокумента.Ссылка.ДокументРасчетов ССЫЛКА Документ.РасходИзКассы
	|								И ТаблицаДокумента.Ссылка.ДокументРасчетов <> ЗНАЧЕНИЕ(Документ.РасходИзКассы.ПустаяСсылка))
	|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				КОГДА ТаблицаДокумента.Ссылка.ПризнакАванса
	|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.ПризнакАванса,
	|	ТаблицаДокумента.Ссылка.ДокументРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,  
	|	1 как Порядок,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Документ = НЕОПРЕДЕЛЕНО
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор.ВалютаРасчетов КАК Валюта,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) КАК Проект,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Дата КАК Дата,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК Сумма,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВал,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК СуммаДляОстатка,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВалДляОстатка,
	|	&УчетРасчетовПоПрочимОперациям КАК СодержаниеПроводки,
	|	&Комментарий КАК Комментарий,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.КорреспонденцияПрочиеРасчеты КАК СчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.КорреспонденцияПрочиеРасчетыРегл КАК СчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Дата КАК Период
	|ПОМЕСТИТЬ ВременнаяТаблицаПрочиеРасчеты
	|ИЗ
	|	Документ.Взаимозачет.Кредитор КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка = &Ссылка
	|	И ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет)
	|	И ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.ВидПрочегоВзаимозачета = ЗНАЧЕНИЕ(Перечисление.ВидыПрочегоВзаимозачета.ДолгПокупателяИДолгПрочемуКонтрагенту)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор.ВалютаРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Документ = НЕОПРЕДЕЛЕНО
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.КорреспонденцияПрочиеРасчеты,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.КорреспонденцияПрочиеРасчетыРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	2 как Порядок,
	|	&Организация,
	//Малышев 2025-03-04 ONESOFT-3869
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.КонтрагентИсточник,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Документ = НЕОПРЕДЕЛЕНО
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор.ВалютаРасчетов,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Дата,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов),
	|	&УчетРасчетовПоПрочимОперациям,
	|	&Комментарий,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.КорреспонденцияПрочиеРасчеты,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.КорреспонденцияПрочиеРасчетыРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Дата
	|ИЗ
	|	Документ.Взаимозачет.Дебитор КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка = &Ссылка
	|	И ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.ПрочийВзаимозачет)
	|	И ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.ВидПрочегоВзаимозачета = ЗНАЧЕНИЕ(Перечисление.ВидыПрочегоВзаимозачета.ДолгПрочегоКонтрагентаИДолгПередПоставщиком)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор.ВалютаРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Документ = НЕОПРЕДЕЛЕНО
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.КорреспонденцияПрочиеРасчеты,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.КорреспонденцияПрочиеРасчетыРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.КонтрагентИсточник,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Ссылка.Дата";
	
	Запрос.ВыполнитьПакет();
	
	// Формирование таблиц движений по разделам учета.
	СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства);

	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_Взаимозачет(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства);
	// Щербакво ---
	СформироватьТаблицаРасчетыСПрочимиКонтрагентами(ДокументСсылкаВзаимозачет, СтруктураДополнительныеСвойства);
	
	
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаВзаимозачет, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь, ПроверятьИтогиРегистров = Ложь) Экспорт
	
 	Если НЕ УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы содержат записи, необходимо выполнить контроль
	// отрицательных остатков.
	Если СтруктураВременныеТаблицы.ДвиженияРасчетыСПокупателямиИзменение
	 ИЛИ СтруктураВременныеТаблицы.ДвиженияРасчетыСПоставщикамиИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияРасчетыСПокупателямиИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПокупателямиИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПокупателямиИзменение.Контрагент) КАК КонтрагентПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПокупателямиИзменение.Договор) КАК ДоговорПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПокупателямиИзменение.Договор.ВалютаРасчетов) КАК ВалютаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПокупателямиИзменение.Документ) КАК ДокументПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПокупателямиИзменение.Заказ) КАК ЗаказПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов) КАК ТипРасчетовПредставление,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаОстаткаЗадолженности,
		|	-(ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0)) КАК СуммаНепогашенныхАвансов,
		|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов КАК ТипРасчетов
		|ИЗ
		|	ДвиженияРасчетыСПокупателямиИзменение КАК ДвиженияРасчетыСПокупателямиИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПокупателями.Остатки(
		|				&МоментКонтроля,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ
		|						ДвиженияРасчетыСПокупателямиИзменение.Организация КАК Организация,
		|						ДвиженияРасчетыСПокупателямиИзменение.Контрагент КАК Контрагент,
		|						ДвиженияРасчетыСПокупателямиИзменение.Договор КАК Договор,
		|						ДвиженияРасчетыСПокупателямиИзменение.Документ КАК Документ,
		|						ДвиженияРасчетыСПокупателямиИзменение.Заказ КАК Заказ,
		|						ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов КАК ТипРасчетов
		|					ИЗ
		|						ДвиженияРасчетыСПокупателямиИзменение КАК ДвиженияРасчетыСПокупателямиИзменение)) КАК РасчетыСПокупателямиОстатки
		|		ПО ДвиженияРасчетыСПокупателямиИзменение.Организация = РасчетыСПокупателямиОстатки.Организация
		|			И ДвиженияРасчетыСПокупателямиИзменение.Контрагент = РасчетыСПокупателямиОстатки.Контрагент
		|			И ДвиженияРасчетыСПокупателямиИзменение.Договор = РасчетыСПокупателямиОстатки.Договор
		|			И ДвиженияРасчетыСПокупателямиИзменение.Документ = РасчетыСПокупателямиОстатки.Документ
		|			И ДвиженияРасчетыСПокупателямиИзменение.Заказ = РасчетыСПокупателямиОстатки.Заказ
		|			И ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов = РасчетыСПокупателямиОстатки.ТипРасчетов
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|				ТОГДА
		//+++ Дмгг, 07.05.2025, ONESOFT-4065
		|					ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) > 0
		//|					-ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) > 0
		//--- Дмгг, 07.05.2025, ONESOFT-4065
		|			ИНАЧЕ 
		//|				ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) < 0
		|				ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) < 0
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияРасчетыСПоставщикамиИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Контрагент) КАК КонтрагентПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Договор) КАК ДоговорПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Договор.ВалютаРасчетов) КАК ВалютаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Документ) КАК ДокументПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Заказ) КАК ЗаказПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов) КАК ТипРасчетовПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаОстаткаЗадолженности,
		|	-(ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0)) КАК СуммаНепогашенныхАвансов,
		|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов КАК ТипРасчетов
		|ИЗ
		|	ДвиженияРасчетыСПоставщикамиИзменение КАК ДвиженияРасчетыСПоставщикамиИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|				&МоментКонтроля,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ
		|						ДвиженияРасчетыСПоставщикамиИзменение.Организация КАК Организация,
		|						ДвиженияРасчетыСПоставщикамиИзменение.Контрагент КАК Контрагент,
		|						ДвиженияРасчетыСПоставщикамиИзменение.Договор КАК Договор,
		|						ДвиженияРасчетыСПоставщикамиИзменение.Документ КАК Документ,
		|						ДвиженияРасчетыСПоставщикамиИзменение.Заказ КАК Заказ,
		|						ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов КАК ТипРасчетов
		|					ИЗ
		|						ДвиженияРасчетыСПоставщикамиИзменение КАК ДвиженияРасчетыСПоставщикамиИзменение)) КАК РасчетыСПоставщикамиОстатки
		|		ПО ДвиженияРасчетыСПоставщикамиИзменение.Организация = РасчетыСПоставщикамиОстатки.Организация
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Контрагент = РасчетыСПоставщикамиОстатки.Контрагент
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Договор = РасчетыСПоставщикамиОстатки.Договор
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Документ = РасчетыСПоставщикамиОстатки.Документ
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Заказ = РасчетыСПоставщикамиОстатки.Заказ
		|			И ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов = РасчетыСПоставщикамиОстатки.ТипРасчетов
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|				ТОГДА 
		|					ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) > 0
		|			ИНАЧЕ 
		|				ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) < 0
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц; 
		//+++ Дмгг, 07.05.2025, ONESOFT-4065
		//Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);      
		Если НЕ ПроверятьИтогиРегистров Тогда 
			Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		Иначе 
			Запрос.УстановитьПараметр("МоментКонтроля", Дата(2999,12,31));
		КонецЕсли;          
		//--- Дмгг, 07.05.2025, ONESOFT-4065
		Запрос.УстановитьПараметр("ВидОперации", ДокументСсылкаВзаимозачет.ВидОперации);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Если НЕ МассивРезультатов[0].Пустой()
			ИЛИ НЕ МассивРезультатов[1].Пустой() Тогда
			ДокументОбъектВзаимозачет = ДокументСсылкаВзаимозачет.ПолучитьОбъект()
		КонецЕсли;
		
		// Отрицательный остаток по расчетам с покупателями.
		Если НЕ МассивРезультатов[0].Пустой() Тогда
			
			ЗаголовокОшибки = НСтр("ka='შეცდომა:';ru='Ошибка:';en='Mistake:'");
			ТекстЗаголовкаСообщения = ЗаголовокОшибки + Символы.ПС + НСтр("ka='მყიდველებთან ანგარიშსწორებების დაფიქსირების შესაძლებლობა არ არის';ru='Нет возможности зафиксировать расчеты с покупателями';en='There is no way to fix the receivables from customers'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ДокументОбъектВзаимозачет,
				ТекстЗаголовкаСообщения,
				Неопределено,
				Неопределено,
				"",
				Отказ
			);
			
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[0].Выбрать();
			Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
				Если ВыборкаИзРезультатаЗапроса.ТипРасчетов = Перечисления.ТипыРасчетов.Долг Тогда
					ТекстСообщения = НСтр("ka='%ПредставлениеКонтрагента% - მყიდველის დავალიანების ნაშთი ანგარიშსწორებების დოკუმენტის მიხედვით ჩამოსაწერ თანხაზე ნაკლებია."
"ჩამოსაწერი თანხა: %СуммаВалПриЗаписи% %ВалютаПредставление%."
"მყიდველის დავალიანების ნაშთი: %СуммаОстаткаЗадолженности% %ВалютаПредставление%.';ru='%ПредставлениеКонтрагента% - остаток задолженности покупателя по документу расчетов меньше списываемой суммы."
"Списываемая сумма: %СуммаВалПриЗаписи% %ВалютаПредставление%."
"Остаток задолженности покупателя: %СуммаОстаткаЗадолженности% %ВалютаПредставление%.'"
					//);
					) + ?(ПроверятьИтогиРегистров, НСтр("ka=' რეგისტრის ჯამების შედეგად';ru=' По итогам регистра'"), "");
				КонецЕсли;
				Если ВыборкаИзРезультатаЗапроса.ТипРасчетов = Перечисления.ТипыРасчетов.Аванс Тогда
					Если ВыборкаИзРезультатаЗапроса.СуммаНепогашенныхАвансов = 0 Тогда
						ТекстСообщения = НСтр("ka='%ПредставлениеКонтрагента% - შესაძლებელია, მყიდველისგან ავანსები არ ყოფილა ან იგი უკვე სრულად ჩათვლილია სასაქონლო დოკუმენტებში.';ru='%ПредставлениеКонтрагента% - возможно, авансов от покупателя не было или они уже полностью зачтены в товарных документах.';en='% PredstavlenieKontragenta% - possibly advances from customers was not, or they are already fully utilized in commercial documents.'"
						//);   
						) + ?(ПроверятьИтогиРегистров, НСтр("ka=' რეგისტრის ჯამების შედეგად';ru=' По итогам регистра'"), "");
					Иначе
						ТекстСообщения = НСтр("ka='%ПредставлениеКонтрагента% - მყიდველისგან მიღებული ავანსები უკვე ნაწილობრივ ჩათვლილია საქონლის დოკუმენტებში."
"ჩაუთვლელი ავანსების ნაშთი: %СуммаНепогашенныхАвансов% %ВалютаПредставление%.';ru='%ПредставлениеКонтрагента% - полученные авансы от покупателя уже частично зачтены в товарных документах."
"Остаток незачтенных авансов: %СуммаНепогашенныхАвансов% %ВалютаПредставление%.'"
						//); 
						) + ?(ПроверятьИтогиРегистров, НСтр("ka=' რეგისტრის ჯამების შედეგად';ru=' По итогам регистра'"), "");
						ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаНепогашенныхАвансов%", Строка(ВыборкаИзРезультатаЗапроса.СуммаНепогашенныхАвансов));
					КонецЕсли;
				КонецЕсли;
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеКонтрагента%", УправлениеНебольшойФирмойСервер.ПредставлениеКонтрагента(ВыборкаИзРезультатаЗапроса.КонтрагентПредставление, ВыборкаИзРезультатаЗапроса.ДоговорПредставление, ВыборкаИзРезультатаЗапроса.ДокументПредставление, ВыборкаИзРезультатаЗапроса.ЗаказПредставление, ВыборкаИзРезультатаЗапроса.ТипРасчетовПредставление));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВалютаПредставление%", ВыборкаИзРезультатаЗапроса.ВалютаПредставление);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаВалПриЗаписи%", Строка(ВыборкаИзРезультатаЗапроса.СуммаВалПриЗаписи));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаОстаткаЗадолженности%", Строка(ВыборкаИзРезультатаЗапроса.СуммаОстаткаЗадолженности));
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ДокументОбъектВзаимозачет,
					ТекстСообщения,
					Неопределено,
					Неопределено,
					"",
					Отказ
				);
			КонецЦикла; 
				
		КонецЕсли;
		
		// Отрицательный остаток по расчетам с поставщиками.
		Если НЕ МассивРезультатов[1].Пустой() Тогда
			
			ЗаголовокОшибки = НСтр("ka='შეცდომა:';ru='Ошибка:';en='Mistake:'");
			ТекстЗаголовкаСообщения = ЗаголовокОшибки + Символы.ПС + НСтр("ka='მომწოდებლებთან ანგარიშსწორებების დაფიქსირების შესაძლებლობა არ არის';ru='Нет возможности зафиксировать расчеты с поставщиками';en='There is no way to fix payments to suppliers'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ДокументОбъектВзаимозачет,
				ТекстЗаголовкаСообщения,
				Неопределено,
				Неопределено,
				"",
				Отказ
			);
			
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[1].Выбрать();
			Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
				Если ВыборкаИзРезультатаЗапроса.ТипРасчетов = Перечисления.ТипыРасчетов.Долг Тогда
					ТекстСообщения = НСтр("ka='%ПредставлениеКонтрагента% - დავალიანების ნაშთი მომწოდებლის წინაშე ანგარიშსწორებების დოკუმენტის მიხედვით ჩამოსაწერ თანხაზე ნაკლებია."
"ჩამოსაწერი თანხა: %СуммаВалПриЗаписи% %ВалютаПредставление%."
"დავალიანების ნაშთი მომწოდებლის წინაშე: %СуммаОстаткаЗадолженности% %ВалютаПредставление%.';ru='%ПредставлениеКонтрагента% - остаток задолженности перед поставщиком по документу расчетов меньше списываемой суммы."
"Списываемая сумма: %СуммаВалПриЗаписи% %ВалютаПредставление%."
"Остаток задолженности перед поставщиком: %СуммаОстаткаЗадолженности% %ВалютаПредставление%.'"
					//);    
					) + ?(ПроверятьИтогиРегистров, НСтр("ka=' რეგისტრის ჯამების შედეგად';ru=' По итогам регистра'"), "");
				КонецЕсли;
				Если ВыборкаИзРезультатаЗапроса.ТипРасчетов = Перечисления.ТипыРасчетов.Аванс Тогда
					Если ВыборкаИзРезультатаЗапроса.СуммаНепогашенныхАвансов = 0 Тогда
						ТекстСообщения = НСтр("ka='%ПредставлениеКонтрагента% - შესაძლებელია, მომწოდებლისთვის ავანსები არ ყოფილა ან იგი უკვე სრულად ჩათვლილია სასაქონლო დოკუმენტებში.';ru='%ПредставлениеКонтрагента% - возможно, авансов поставщику не было или они уже полностью зачтены в товарных документах.';en='% PredstavlenieKontragenta% - perhaps Advances to suppliers were not, or they are already fully utilized in commercial documents.'"
						//); 
						) + ?(ПроверятьИтогиРегистров, НСтр("ka=' რეგისტრის ჯამების შედეგად';ru=' По итогам регистра'"), "");
					Иначе
						ТекстСообщения = НСтр("ka='%ПредставлениеКонтрагента% - მომწოდებლისთვის გაცემული ავანსები უკვე ნაწილობრივ ჩათვლილია საქონლის დოკუმენტებში."
"ჩაუთვლელი ავანსების ნაშთი: %СуммаНепогашенныхАвансов% %ВалютаПредставление%.';ru='%ПредставлениеКонтрагента% - выданные авансы поставщику уже частично зачтены в товарных документах."
"Остаток незачтенных авансов: %СуммаНепогашенныхАвансов% %ВалютаПредставление%.'"
						//);       
						) + ?(ПроверятьИтогиРегистров, НСтр("ka=' რეგისტრის ჯამების შედეგად';ru=' По итогам регистра'"), "");
						ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаНепогашенныхАвансов%", Строка(ВыборкаИзРезультатаЗапроса.СуммаНепогашенныхАвансов));
					КонецЕсли;
				КонецЕсли;
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеКонтрагента%", УправлениеНебольшойФирмойСервер.ПредставлениеКонтрагента(ВыборкаИзРезультатаЗапроса.КонтрагентПредставление, ВыборкаИзРезультатаЗапроса.ДоговорПредставление, ВыборкаИзРезультатаЗапроса.ДокументПредставление, ВыборкаИзРезультатаЗапроса.ЗаказПредставление, ВыборкаИзРезультатаЗапроса.ТипРасчетовПредставление));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВалютаПредставление%", ВыборкаИзРезультатаЗапроса.ВалютаПредставление);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаВалПриЗаписи%", Строка(ВыборкаИзРезультатаЗапроса.СуммаВалПриЗаписи));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаОстаткаЗадолженности%", Строка(ВыборкаИзРезультатаЗапроса.СуммаОстаткаЗадолженности));
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ДокументОбъектВзаимозачет,
					ТекстСообщения,
					Неопределено,
					Неопределено,
					"",
					Отказ
				);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтроль()

#КонецОбласти

#Область ИнтерфейсПечати

// Процедура формирует печатную форму документа по указанному макету.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ТипДокумента)
	
	Перем Ошибки;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктВзаимозачета";
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаДолга.Ссылка,
	|	КорректировкаДолга.Номер,
	|	КорректировкаДолга.Дата,
	|	КорректировкаДолга.ВидОперации,
	|	КорректировкаДолга.Договор,
	|	КорректировкаДолга.Контрагент,
	|	КорректировкаДолга.КонтрагентИсточник,
	|	КорректировкаДолга.Кратность,
	|	КорректировкаДолга.Курс,
	|	КорректировкаДолга.Организация,
	|	КорректировкаДолга.ПодписьРуководителя.Должность КАК ДолжностьПодписантОрганизации,
	|	КорректировкаДолга.ПодписьРуководителя.РасшифровкаПодписи КАК РасшифровкаПодписиПодписантаОрганизации,
	|	КорректировкаДолга.СуммаРасчетов,
	|	КорректировкаДолга.СуммаУчета,
	|	КорректировкаДолга.Корреспонденция,
	|	КорректировкаДолга.ДокументРасчетов,
	|	КорректировкаДолга.ПризнакАванса,
	|	КорректировкаДолга.Заказ,
	|	КорректировкаДолга.СчетНаОплату,
	|	КорректировкаДолга.ДокументОснование,
	|	КорректировкаДолга.ХозяйственнаяОперация,
	|	КорректировкаДолга.Дебитор.(
	|		НомерСтроки,
	|		Договор,
	|		Договор.Наименование КАК ДоговорПредставление,
	|		Документ,
	|		Заказ,
	|		Кратность,
	|		Курс,
	|		ПризнакАванса,
	|		СуммаРасчетов,
	|		СуммаУчета,
	|		СчетНаОплату
	|	),
	|	КорректировкаДолга.Кредитор.(
	|		НомерСтроки,
	|		Договор,
	|		Договор.Наименование КАК ДоговорПредставление,
	|		Документ,
	|		Заказ,
	|		Кратность,
	|		Курс,
	|		ПризнакАванса,
	|		СуммаРасчетов,
	|		СуммаУчета,
	|		СчетНаОплату
	|	)
	|ИЗ
	|	Документ.Взаимозачет КАК КорректировкаДолга
	|ГДЕ
	|	КорректировкаДолга.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КорректировкаДолга.Ссылка,
	|	КорректировкаДолга.Дебитор.НомерСтроки,
	|	КорректировкаДолга.Кредитор.НомерСтроки";
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	ВалютаУчета = УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета();

	Шапка = Запрос.Выполнить().Выбрать();
	ПервыйДокумент = Истина;
	
	Пока Шапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктВзаимозачета";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Взаимозачет.ПФ_MXL_Взаимозачет");
		
		СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		ПредставлениеОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		
		СведенияОбКонтрагенте = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.КонтрагентИсточник, Шапка.Дата);
		ПредставлениеКредитора= УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбКонтрагенте, "ПолноеНаименование,ИНН,КПП,РегистрационныйНомер,ЮридическийАдрес,Телефоны,");
		
		СтрокаКредиторки = НСтр("ka='1. %ПредставлениеКредитора%-ის წინაშე %ПредставлениеОрганизации%-ის დავალიანება შეადგენს';ru='1. Задолженность %ПредставлениеОрганизации% перед %ПредставлениеКредитора% составляет';en='1. Debt PredstavlenieOrganizatsii%%% before PredstavlenieKreditora% of'")+ " ";
		СтрокаКредиторки = СтрЗаменить(СтрокаКредиторки,"%ПредставлениеОрганизации%",ПредставлениеОрганизации);
		СтрокаКредиторки = СтрЗаменить(СтрокаКредиторки,"%ПредставлениеКредитора%",ПредставлениеКредитора);
		
		КолонкаСуммы        = "СуммаУчета";
		ПредставлениеВалюты = строка(ВалютаУчета);
		
		ДебиторскаяЗадолженность = Шапка.Дебитор.Выгрузить();
		КредиторскаяЗадолженность = Шапка.Кредитор.Выгрузить();
		ДебиторскаяЗадолженность.Свернуть("Договор,ДоговорПредставление","СуммаУчета,СуммаРасчетов");
		ДебиторскаяЗадолженность.Сортировать("ДоговорПредставление,СуммаУчета");
		КредиторскаяЗадолженность.Свернуть("Договор,ДоговорПредставление","СуммаУчета,СуммаРасчетов");
		КредиторскаяЗадолженность.Сортировать("ДоговорПредставление,СуммаУчета");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		СтрокаШапки = НСтр("ka='%Дата%-ის ურთიერთჩათვლის აქტი № %Номер%';ru='Акт взаимозачета № %Номер% от %Дата%';en='Netting Act number% number% of% date%'"); 
		СтрокаШапки = СтрЗаменить(СтрокаШапки,"%Номер%", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Истина, Ложь));
		СтрокаШапки = СтрЗаменить(СтрокаШапки,"%Дата%",   Формат(Шапка.Дата, "ДЛФ=DD"));
		СтрокаКредиторки  = СтрокаКредиторки + Формат(КредиторскаяЗадолженность.Итог(КолонкаСуммы), "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты + " " +НСтр("ka='შემდეგი ხელშეკრულებების მიხედვით:';ru='по следующим договорам:';en='under the following agreements:'");
		
		ОбластьМакета.Параметры.СтрокаШапки      = СтрокаШапки;
		ОбластьМакета.Параметры.СтрокаКредиторки = СтрокаКредиторки;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКредиторки");
		Для каждого СтрокаЗадолженности Из КредиторскаяЗадолженность Цикл
			ОбластьМакета.Параметры.СтрокаДокументовКред = сокрЛП(СтрокаЗадолженности.ДоговорПредставление) + " :"+ символы.Таб + Формат(СтрокаЗадолженности[КолонкаСуммы], "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты;
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета         = Макет.ПолучитьОбласть("ЗаголовокДебиторки");
		
		СведенияОбКонтрагенте = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		ПредставлениеДебитора = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбКонтрагенте, "ПолноеНаименование,ИНН,КПП,РегистрационныйНомер,ЮридическийАдрес,Телефоны,");
		
		СтрокаДебиторки       = НСтр("ru = '2. Задолженность %ПредставлениеДебитора% перед %ПредставлениеОрганизации% составляет "
		                      + "%Сумма% %ПредставлениеВалюты% по следующим договорам:'");
		СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%ПредставлениеДебитора%", ПредставлениеДебитора);
		СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%ПредставлениеОрганизации%", ПредставлениеОрганизации);
		СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%ПредставлениеВалюты%", ПредставлениеВалюты);
		СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%Сумма%", Формат(ДебиторскаяЗадолженность.Итог(КолонкаСуммы), "ЧЦ=15; ЧДЦ=2; ЧН=Ноль"));
		
		ОбластьМакета.Параметры.СтрокаДебиторки = СтрокаДебиторки;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаДебиторки");
		Для каждого СтрокаЗадолженности Из ДебиторскаяЗадолженность Цикл
			
			ОбластьМакета.Параметры.СтрокаДокументовДеб = сокрЛП(СтрокаЗадолженности.ДоговорПредставление) + " :" + Символы.Таб + Формат(СтрокаЗадолженности[КолонкаСуммы], "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
		ОбластьПодвала     = Макет.ПолучитьОбласть("Подвал");
		СтрокаВзаимозачета = НСтр("ka='3. ურთიერთჩათვლა ხორციელდება შემდეგ თანხაზე';ru='3. Взаимозачет производится на сумму';en='3. Offsetting is made in the amount of'")+ " " + Формат(ДебиторскаяЗадолженность.Итог(КолонкаСуммы), "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты;
		
		ОбластьПодвала.Параметры.СтрокаВзаимозачета       = СтрокаВзаимозачета;
		ОбластьПодвала.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации;
		ОбластьПодвала.Параметры.ПредставлениеКредитора   = ПредставлениеКредитора;
		
		ОбластьПодвала.Параметры.ДолжностьПодписантОрганизации = Шапка.ДолжностьПодписантОрганизации;
		ОбластьПодвала.Параметры.РасшифровкаПодписиПодписантаОрганизации = Шапка.РасшифровкаПодписиПодписантаОрганизации;
		ОбластьПодвала.Параметры.ДолжностьПодписантКонтрагента = "";
		ОбластьПодвала.Параметры.РасшифровкаПодписиПодписантаКонтрагента = "";
		
		ТабличныйДокумент.Вывести(ОбластьПодвала);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;

	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктВзаимозачета") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктВзаимозачета", "Акт взаимозачета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "АктВзаимозачета"));
		
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктВзаимозачета";
	КомандаПечати.Представление = НСтр("ka='ურთიეთჩათვლის აქტი';ru='Акт взаимозачета';en='Offsetting act'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанныхИзВнешнегоИсточника

Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока30 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_4 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 4, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	//ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ОписаниеТиповКолонка1 = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КонтрагентИНН", НСтр("ru = 'Контаргент(ИНН)'; ka = 'კონტრაგენტი(ს.კ)'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Контаргент", 1, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Догово_ВходящиеДанные",НСтр("ru = 'Договор'; ka = 'ხელშეკრულება'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка1, "Договор", 2, , Истина);
		
	//СуммаРасчетов
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СуммаРасчетов",  НСтр("ru = 'Сумма расчетов'; ka = 'ანგარიშსწორების თანხა'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, ,3 ,Истина );
	//Курс
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Курс",  НСтр("ru = 'Курс'; ka = 'კურსი'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_4, ,4 , );
	////Кратность
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Кратность",  НСтр("ru = 'Кратность'; ka = 'ჯერადობა'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_4, ,5 , );		
	//СуммаУчета
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СуммаУчета",  НСтр("ru = 'Сумма учета'; ka = 'აღრიცხვის თანხა'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, ,6 , );
	
		
КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_mxl", "ОбразецЗагрузкиДанных_mxl");
	
	Образец_csv = ПолучитьМакет("ОбразецЗагрузкиДанных_csv");
	ОбразецЗагрузкиДанных_csv = ПоместитьВоВременноеХранилище(Образец_csv, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_csv", ОбразецЗагрузкиДанных_csv);
	
КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ТаблицаСопоставленияДанных, НастройкиЗагрузкиДанных) Экспорт
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	Контрагент = КонтрагентПоИннПоНаимоенованию((ТаблицаСопоставленияДанных[0].КонтрагентИНН));
	
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		
		СтрокаТаблицыФормы.Контаргент = Контрагент;
		
		// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьДоговор(Контрагент,СтрокаТаблицыФормы.Договор,СтрокаТаблицыФормы.Догово_ВходящиеДанные);
		
		//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Курс, СтрокаТаблицыФормы.Курс_ВходящиеДанные, 0);
		//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Кратность, СтрокаТаблицыФормы.Кратность_ВходящиеДанные, 0);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.СуммаРасчетов, СтрокаТаблицыФормы.СуммаРасчетов_ВходящиеДанные, 0);
		//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.СуммаУчета, СтрокаТаблицыФормы.СуммаУчета_ВходящиеДанные, 0);

		
		//Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Договор) Тогда 
		//	Валюта   = СтрокаТаблицыФормы.Договор.ВалютаРасчетов;
		//	ТекКурс  = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Валюта",Валюта));
		//	СтрокаТаблицыФормы.Курс = ТекКурс.Курс;
		//	СтрокаТаблицыФормы.Курс_ВходящиеДанные = Строка(ТекКурс.Курс); 
		//	СтрокаТаблицыФормы.Кратность= ТекКурс.Кратность;
		//	СтрокаТаблицыФормы.Кратность_ВходящиеДанные = Строка(ТекКурс.Кратность);
		//	СтрокаТаблицыФормы.СуммаУчета_ВходящиеДанные = Строка(СтрокаТаблицыФормы.СуммаРасчетов * ТекКурс.Курс/ТекКурс.Кратность);
		//	СтрокаТаблицыФормы.СуммаУчета =  СтрокаТаблицыФормы.СуммаРасчетов * ТекКурс.Курс/ТекКурс.Кратность;		
		//КонецЕсли;
				
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.СуммаРасчетов) 
	И ЗначениеЗаполнено(СтрокаТаблицыФормы.Договор);
		
КонецПроцедуры


Функция КонтрагентПоИннПоНаимоенованию(ИннНаименование)
	
	Перем Контрагент;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Справочник.Контрагенты.Ссылка ГДЕ НЕ ЭтоГруппа И ИНН = &ИннНаименование");
	Запрос.УстановитьПараметр("ИннНаименование", ИннНаименование);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество()= 0 Тогда 
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ИНН = &ИннНаименование", "Наименование = &ИннНаименование");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		
		Контрагент = Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Контрагент;
		
КонецФункции
#КонецОбласти


#КонецЕсли