#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиОтчета.ПоказыватьНастройкиДиаграммыНаФормеОтчета = Ложь;
	
	НастройкиВариантов["МониторРасчетовСПокупателями"].Теги = НСТР("ka='Мониторы,Компания,Покупатели,Контрагенты,Долги,Авансы';ru='Мониторы,Компания,Покупатели,Контрагенты,Долги,Авансы'");
	НастройкиВариантов["МониторРасчетовСПоставщиками"].Теги = НСТР("ka='Мониторы,Компания,Поставщики,Контрагенты,Долги,Авансы';ru='Мониторы,Компания,Поставщики,Контрагенты,Долги,Авансы'");
	НастройкиВариантов["МониторДенежныеСредства"].Теги = НСТР("ka='Мониторы,Компания,Деньги';ru='Мониторы,Компания,Деньги'");
	НастройкиВариантов["МониторОбщиеПоказатели"].Теги = НСТР("ka='Мониторы,Компания';ru='Мониторы,Компания'");
	НастройкиВариантов["МониторРуководителя"].Теги = НСТР("ka='Мониторы,Компания';ru='Мониторы,Компания'");
	НастройкиВариантов["МониторРуководителяНовый"].Теги = НСТР("ka='Мониторы,Компания';ru='Мониторы,Компания'");
	НастройкиВариантов["МониторПульсБизнеса"].Теги = НСТР("ka='Мониторы,Компания';ru='Мониторы,Компания'");
	
КонецПроцедуры

#КонецОбласти

ЭтоОтчетУНФ = Истина;


#КонецЕсли