&НаСервере
Функция ПолучитьСписокМакетов()
	
	Тз = Новый ТаблицаЗначений;
	Тз.Колонки.Добавить("Имя");
	Тз.Колонки.Добавить("Заголовок");
	
	Для Каждого Макет Из Метаданные.Обработки.ОбработкаРелизов.Макеты Цикл
		Стр = Тз.Добавить();
		Стр.Заголовок = Макет.Синоним;
		Стр.Имя       = Макет.Имя;
	КонецЦикла;	
	
	Возврат Тз;
	
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		
	МассивРелизов = ПолучитьСписокМакетов();
	
	Для Каждого Стр Из МассивРелизов Цикл 
		
		НовНадпись = Элементы.Добавить(Стр.Имя,Тип("ДекорацияФормы"),ЭтаФорма);
		НовНадпись.Вид = ВидДекорацииФормы.Надпись;
		НовНадпись.Гиперссылка = Истина;
		НовНадпись.Заголовок = Стр.Заголовок;
		НовНадпись.УстановитьДействие("Нажатие", "ВыполнитьДействиеНажатие");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеНажатие(Элемент)
	
	ИмяФайла = Элемент.Имя;
					
	П = Новый Структура;	
	П.Вставить("АдресФаила", ИмяФайла);
	
	ОткрытьФорму("Обработка.ОбработкаРелизов.Форма.ФормаPDF", П, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если ВебКлиент Тогда		
		Отказ = Истина;
	#КонецЕсли
КонецПроцедуры
