
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидыОтчетов = Строка(Параметры.ВидыОтчетов);
	
	//Если Параметры.ВидыОтчетов = 1 Тогда
	//	ВидыОтчетов = НСтр("ka='Первичные и корректирующие';ru='Первичные и корректирующие';en='Primary and corrective'");
	//ИначеЕсли Параметры.ВидыОтчетов = 2 Тогда
	//	ВидыОтчетов = НСтр("ka='პირველადი';ru='Первичные';en='primary'");
	//Иначе
	//	ВидыОтчетов = НСтр("ka='მაკორექტირებლები';ru='Корректирующие';en='corrective'");
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(Число(ВидыОтчетов));
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
