
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", НСтр("ka='მობილური ტელეფონია';ru='Мобильная телефония';en='Mobile telephony'"));
	ПараметрыФормы.Вставить("КлючПодсказки", "Телефония_МобильнаяТелефония");
	
	ОткрытьФорму("Обработка.МенеджерПодсказок.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	
КонецПроцедуры
