
//+++ Дмгг
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда 
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетРасчетовСПерсоналом");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетРасчетовСПодотчетниками");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетРасчетовПоПерерасходу");
		
	КонецЕсли;
	
КонецПроцедуры

//+++ Дмгг, 11.08.2025, ONESOFT-4283
Процедура ПередЗаписью(Отказ)
	
	Если РольДоступна("ЗапретДоступаКСправочникуСотрудники") Тогда 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
//--- Дмгг, 11.08.2025, ONESOFT-4283