#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("КонтрольнаяСумма", КонтрольнаяСумма);
	Параметры.Свойство("Дистрибутив", Дистрибутив);
	Параметры.Свойство("Версия", Версия);
	
	Элементы.Дистрибутив.Подсказка = СтрШаблон(НСтр("ka='Версия: %1';ru='Версия: %1'"), Версия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	
	Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти