#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет распределение затрат по количеству.
//
Процедура РаспределитьТабЧастьРасходыПоКоличеству() Экспорт
	
	ИсхСумма = 0;
	ИсхСуммаНДС = 0;
	БазаРаспределенияКоличество = Запасы.Итог("Количество");
	//ВсегоРасходы = Расходы.Итог("Всего");
	ВсегоРасходы = Расходы.Итог("Всего") - Расходы.Итог("СуммаНДС");
	ВсегоНДСРасходы = Расходы.Итог("СуммаНДС");
	//Паганини_
	ИсхСуммаНДФЛ = 0;	
	ВсегоРасходыНДФЛ = Расходы.Итог("СуммаНДФЛ");
	ИсхСуммаПФ = 0;	
	ВсегоРасходыПФ = Расходы.Итог("СуммаПФ");
	//_Паганини
	НОД = УправлениеНебольшойФирмойСервер.ПолучитьНОДДляМассива(Запасы.ВыгрузитьКолонку("Количество"), 1000);
	
	//Просьба не удалять, пока данное распределение поставлено на паузу
	ТзИмпортаСебестоимость = ДопРасходыИмпорт.Выгрузить(Новый Структура("ДобавлятьВСебистоимость", Истина), "Сумма");
	ВсегоИмпорт = ТзИмпортаСебестоимость.Итог("Сумма"); //+++ Дмгг
	ИсхСуммаИмпорт = 0; //+++ Дмгг
	
	Если НОД = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		СтрокаЗапасы.Коэффициент = СтрокаЗапасы.Количество / НОД * 1000;
		СтрокаЗапасы.СуммаРасходов = ?(БазаРаспределенияКоличество <> 0, Окр((ВсегоРасходы - ИсхСумма) * СтрокаЗапасы.Количество / БазаРаспределенияКоличество, 2, 1),0);
		СтрокаЗапасы.СуммаРасходовНДФЛ = ?(БазаРаспределенияКоличество <> 0, Окр((ВсегоРасходыНДФЛ - ИсхСуммаНДФЛ) * СтрокаЗапасы.Количество / БазаРаспределенияКоличество, 2, 1),0);//Паганини
		СтрокаЗапасы.СуммаРасходовПФ   = ?(БазаРаспределенияКоличество <> 0, Окр((ВсегоРасходыПФ   - ИсхСуммаПФ)   * СтрокаЗапасы.Количество / БазаРаспределенияКоличество, 2, 1),0);//Паганини ПФ
		СтрокаЗапасы.СуммаРасходовНДС = ?(БазаРаспределенияКоличество <> 0, Окр((ВсегоНДСРасходы - ИсхСуммаНДС) * СтрокаЗапасы.Количество / БазаРаспределенияКоличество, 2, 1),0);
		
		СтрокаЗапасы.СуммаИмпорт = ?(БазаРаспределенияКоличество <> 0, Окр((ВсегоИмпорт- ИсхСуммаИмпорт) * СтрокаЗапасы.Количество / БазаРаспределенияКоличество, 2, 1),0);//+++ Дмгг
		ИсхСуммаИмпорт = ИсхСуммаИмпорт + СтрокаЗапасы.СуммаИмпорт; //+++ Дмгг
		БазаРаспределенияКоличество = БазаРаспределенияКоличество - СтрокаЗапасы.Количество;
		
		ИсхСумма = ИсхСумма + СтрокаЗапасы.СуммаРасходов;
		ИсхСуммаНДС = ИсхСуммаНДС + СтрокаЗапасы.СуммаРасходовНДС;
		ИсхСуммаНДФЛ = ИсхСуммаНДФЛ + СтрокаЗапасы.СуммаРасходовНДФЛ;//Паганини
		ИсхСуммаПФ = ИсхСуммаПФ + СтрокаЗапасы.СуммаРасходовПФ;//Паганини ПФ
		
	КонецЦикла;
	
КонецПроцедуры // РаспределитьТабЧастьРасходыПоКоличеству()

// Процедура выполняет распределение затрат по сумме.
//
Процедура РаспределитьТабЧастьРасходыПоСумме() Экспорт

	//+++ Дмгг, 22.05.2025, ONESOFT=4031
	// мееня. бо может не на все строки распределяться, бага нет, просто так работает
	//ИсхСумма = 0;
	//ИсхСуммаНДС = 0;
	//БазаРаспределенияСумма = Запасы.Итог("Сумма");
	//БазаРаспределенияСуммаНДС = Запасы.Итог("СуммаНДС");
	////ВсегоРасходы = Расходы.Итог("Всего");
	//ВсегоРасходы = Расходы.Итог("Всего") - Расходы.Итог("СуммаНДС");
	//ВсегоНДСРасходы = Расходы.Итог("СуммаНДС");
	////Паганини_
	//ИсхСуммаНДФЛ = 0;	
	//ВсегоРасходыНДФЛ = Расходы.Итог("СуммаНДФЛ");
	//ИсхСуммаПФ = 0;	
	//ВсегоРасходыПФ = Расходы.Итог("СуммаПФ");
	////_Паганини
	//НОД = УправлениеНебольшойФирмойСервер.ПолучитьНОДДляМассива(Запасы.ВыгрузитьКолонку("Сумма"), 100);
	//
	//ТзИмпортаСебестоимость = ДопРасходыИмпорт.Выгрузить(Новый Структура("ДобавлятьВСебистоимость", Истина), "Сумма");
	//ИсхСуммаИмпорт = 0; //+++ Дмгг
	//ВсегоИмпорт = ТзИмпортаСебестоимость.Итог("Сумма"); //+++ Дмгг
	//
	//Если НОД = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Для каждого СтрокаЗапасы Из Запасы Цикл
	//	
	//	СтрокаЗапасы.Коэффициент = СтрокаЗапасы.Сумма / НОД * 100;
	//	СтрокаЗапасы.СуммаРасходов = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоРасходы - ИсхСумма) * СтрокаЗапасы.Сумма / БазаРаспределенияСумма, 2, 1), 0);
	//	СтрокаЗапасы.СуммаРасходовНДС = ?(БазаРаспределенияСуммаНДС <> 0, Окр((ВсегоНДСРасходы - ИсхСуммаНДС) * СтрокаЗапасы.СуммаНДС / БазаРаспределенияСуммаНДС, 2, 1),0);
	//	СтрокаЗапасы.СуммаРасходовНДФЛ = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоРасходыНДФЛ - ИсхСуммаНДФЛ) * СтрокаЗапасы.Всего / БазаРаспределенияСумма, 2, 1),0);//Паганини
	//	СтрокаЗапасы.СуммаРасходовПФ   = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоРасходыПФ   - ИсхСуммаПФ)   * СтрокаЗапасы.Всего / БазаРаспределенияСумма, 2, 1),0);//Паганини ПФ
	//	
	//	СтрокаЗапасы.СуммаИмпорт = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоИмпорт- ИсхСуммаИмпорт) * СтрокаЗапасы.Сумма / БазаРаспределенияСумма, 2, 1),0); //++ Дмгг
	//	ИсхСуммаИмпорт = ИсхСуммаИмпорт + СтрокаЗапасы.СуммаИмпорт;
	//	
	//	БазаРаспределенияСумма = БазаРаспределенияСумма - СтрокаЗапасы.Сумма;
	//	ИсхСумма = ИсхСумма + СтрокаЗапасы.СуммаРасходов;
	//	
	//	ИсхСуммаНДС = ИсхСуммаНДС + СтрокаЗапасы.СуммаРасходовНДС;
	//	ИсхСуммаНДФЛ = ИсхСуммаНДФЛ + СтрокаЗапасы.СуммаРасходовНДФЛ;//Паганини
	//	ИсхСуммаПФ   = ИсхСуммаПФ   + СтрокаЗапасы.СуммаРасходовПФ;//Паганини ПФ
	//	
	//	
	//	
	//КонецЦикла; 
	
	тзЗапасы = Запасы.Выгрузить();
	тзЗапасы.Колонки.Добавить("СуммаНДФЛ");
	тзЗапасы.Колонки.Добавить("СуммаПФ");
	
	ИсхСумма = 0;
	ИсхСуммаНДС = 0;
	БазаРаспределенияСумма = Запасы.Итог("Сумма");
	БазаРаспределенияСуммаОснова = БазаРаспределенияСумма;
	БазаРаспределенияСуммаНДС = Запасы.Итог("СуммаНДС");
	
	Для Каждого Строк Из тзЗапасы Цикл 
		Всего			= Строк.Всего;
		СуммаНДС		= Строк.СуммаНДС;		
		Строк.СуммаПФ	= Окр((Всего - СуммаНДС) * 2/100, 2);
		Строк.СуммаНДФЛ = Окр((Всего - Строк.СуммаПФ - СуммаНДС) * 20/100, 2);
	КонецЦикла;
	БазаРаспределенияНДФЛ = тзЗапасы.Итог("СуммаНДФЛ");
	БазаРаспределенияПФ = тзЗапасы.Итог("СуммаПФ");
	
	ВсегоРасходы = Расходы.Итог("Всего") - Расходы.Итог("СуммаНДС");
	ВсегоНДСРасходы = Расходы.Итог("СуммаНДС");
	ИсхСуммаНДФЛ = 0;	
	ВсегоРасходыНДФЛ = Расходы.Итог("СуммаНДФЛ");
	ИсхСуммаПФ = 0;	
	ВсегоРасходыПФ = Расходы.Итог("СуммаПФ");
	НОД = УправлениеНебольшойФирмойСервер.ПолучитьНОДДляМассива(Запасы.ВыгрузитьКолонку("Сумма"), 100);
	
	ТзИмпортаСебестоимость = ДопРасходыИмпорт.Выгрузить(Новый Структура("ДобавлятьВСебистоимость", Истина), "Сумма");
	ИсхСуммаИмпорт = 0; 
	ВсегоИмпорт = ТзИмпортаСебестоимость.Итог("Сумма"); 
	
	Если НОД = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Ит = 0;
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		СтрокаТЗ = тзЗапасы[Ит];
		
		СтрокаЗапасы.Коэффициент = СтрокаЗапасы.Сумма / НОД * 100;                                           
		
		//СтрокаЗапасы.СуммаРасходов = ВсегоРасходы / БазаРаспределенияСуммаОснова * СтрокаЗапасы.Сумма; 
		СтрокаЗапасы.СуммаРасходов = ?(БазаРаспределенияСуммаОснова <> 0, ВсегоРасходы / БазаРаспределенияСуммаОснова * СтрокаЗапасы.Сумма,0); //Малышев 2025-06-18 ONESOFT-4166
		
		//СтрокаЗапасы.СуммаРасходовНДС = ВсегоНДСРасходы / БазаРаспределенияСуммаНДС * СтрокаЗапасы.СуммаНДС; 
		СтрокаЗапасы.СуммаРасходовНДС = ?(БазаРаспределенияСуммаНДС <> 0, ВсегоНДСРасходы / БазаРаспределенияСуммаНДС * СтрокаЗапасы.СуммаНДС, 0); //Малышев 2025-06-18 ONESOFT-4166
		
		//СтрокаЗапасы.СуммаРасходовНДФЛ = ВсегоРасходыНДФЛ / БазаРаспределенияНДФЛ * СтрокаТЗ.СуммаНДФЛ; 
		СтрокаЗапасы.СуммаРасходовНДФЛ = ?(БазаРаспределенияНДФЛ <> 0, ВсегоРасходыНДФЛ / БазаРаспределенияНДФЛ * СтрокаТЗ.СуммаНДФЛ, 0); //Малышев 2025-06-18 ONESOFT-4166
		
		//СтрокаЗапасы.СуммаРасходовПФ = ВсегоРасходыПФ / БазаРаспределенияПФ * СтрокаТЗ.СуммаПФ;         
		СтрокаЗапасы.СуммаРасходовПФ = ?(БазаРаспределенияПФ <> 0, ВсегоРасходыПФ / БазаРаспределенияПФ * СтрокаТЗ.СуммаПФ, 0); //Малышев 2025-06-18 ONESOFT-4166        
		
		СтрокаЗапасы.СуммаИмпорт = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоИмпорт- ИсхСуммаИмпорт) * СтрокаЗапасы.Сумма / БазаРаспределенияСумма, 2, 1),0); 
		ИсхСуммаИмпорт = ИсхСуммаИмпорт + СтрокаЗапасы.СуммаИмпорт;
		
		БазаРаспределенияСумма = БазаРаспределенияСумма - СтрокаЗапасы.Сумма;
		ИсхСумма = ИсхСумма + СтрокаЗапасы.СуммаРасходов;
		ИсхСуммаНДС = ИсхСуммаНДС + СтрокаЗапасы.СуммаРасходовНДС;
		ИсхСуммаНДФЛ = ИсхСуммаНДФЛ + СтрокаЗапасы.СуммаРасходовНДФЛ;
		ИсхСуммаПФ   = ИсхСуммаПФ   + СтрокаЗапасы.СуммаРасходовПФ;
		
		Ит = Ит + 1;
		
	КонецЦикла;
	
	//Выровняем тетри
	СтрокаЗапасы.СуммаРасходов = СтрокаЗапасы.СуммаРасходов + (ВсегоРасходы - ИсхСумма);
	СтрокаЗапасы.СуммаРасходовНДС = СтрокаЗапасы.СуммаРасходовНДС + (ВсегоНДСРасходы - ИсхСуммаНДС);
	СтрокаЗапасы.СуммаРасходовНДФЛ = СтрокаЗапасы.СуммаРасходовНДФЛ + (ВсегоРасходыНДФЛ - ИсхСуммаНДФЛ);    
	СтрокаЗапасы.СуммаРасходовПФ = СтрокаЗапасы.СуммаРасходовПФ + (ВсегоРасходыПФ - ИсхСуммаПФ);
	//--- Дмгг, 22.05.2025, ONESOFT=4031
	
КонецПроцедуры // РаспределитьТабЧастьРасходыПоСумме()

#КонецОбласти

#Область ПроцедурыЗаполненияДокумента

// Процедура заполняет авансы.
//
Процедура ЗаполнитьПредоплату() Экспорт
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация);
	
	// Заполнение расшифровки предоплаты.
	Запрос = Новый Запрос;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|	РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|	РасчетыСПоставщикамиОстатки.ДокументДата КАК ДокументДата,
	|	РасчетыСПоставщикамиОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщикамиОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПоставщикамиОстатки.Договор КАК Договор,
	|		РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|		РасчетыСПоставщикамиОстатки.Документ.Дата КАК ДокументДата,
	|		РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|				&ПериодГраница, // Kuzmich, 23.08.2023, ONESOFT-2496, константа: Зачитывать авансы автоматически - по дату документа
	|				Организация = &Организация
	|					И Контрагент = &Контрагент
	|					И Договор = &Договор
	|					И Заказ В (&Заказ)
	|					И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК РасчетыСПоставщикамиОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаРасчетыСПоставщиками.Договор,
	|		ДвиженияДокументаРасчетыСПоставщиками.Документ,
	|		ДвиженияДокументаРасчетыСПоставщиками.Документ.Дата,
	|		ДвиженияДокументаРасчетыСПоставщиками.Заказ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокументаРасчетыСПоставщиками
	|	ГДЕ
	|		ДвиженияДокументаРасчетыСПоставщиками.Регистратор = &Ссылка
	|		И ДвиженияДокументаРасчетыСПоставщиками.Период <= &Период
	|		И ДвиженияДокументаРасчетыСПоставщиками.Организация = &Организация
	|		И ДвиженияДокументаРасчетыСПоставщиками.Контрагент = &Контрагент
	|		И ДвиженияДокументаРасчетыСПоставщиками.Договор = &Договор
	|		И ДвиженияДокументаРасчетыСПоставщиками.Заказ В (&Заказ)
	|		И ДвиженияДокументаРасчетыСПоставщиками.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК РасчетыСПоставщикамиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиОстатки.Документ,
	|	РасчетыСПоставщикамиОстатки.Заказ,
	|	РасчетыСПоставщикамиОстатки.ДокументДата,
	|	РасчетыСПоставщикамиОстатки.Договор.ВалютаРасчетов
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаВалОстаток) < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|	РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|	РасчетыСПоставщикамиОстатки.ДокументДата КАК ДокументДата,
	|	РасчетыСПоставщикамиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаУчета) КАК СуммаУчета,
	|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаРасчетов) КАК СуммаРасчетов,
	|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаУчета / ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаРасчетов, 0) <> 0
	|				ТОГДА РасчетыСПоставщикамиОстатки.СуммаРасчетов
	|			ИНАЧЕ 1
	|		КОНЕЦ) * (РасчетыСПоставщикамиОстатки.КурсыВалютыУчетаКурс / РасчетыСПоставщикамиОстатки.КурсыВалютыУчетаКратность) КАК Курс,
	|	1 КАК Кратность,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыДокументаКурс КАК КурсыВалютыДокументаКурс,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыДокументаКратность КАК КурсыВалютыДокументаКратность
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПоставщикамиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	|		РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|		РасчетыСПоставщикамиОстатки.ДокументДата КАК ДокументДата,
	|		РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаУчета,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаРасчетов,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) * КурсыВалютыУчета.Курс * &КратностьВалютыДокумента / (&КурсВалютыДокумента * КурсыВалютыУчета.Кратность) КАК СуммаПлатежа,
	|		КурсыВалютыУчета.Курс КАК КурсыВалютыУчетаКурс,
	|		КурсыВалютыУчета.Кратность КАК КурсыВалютыУчетаКратность,
	|		&КурсВалютыДокумента КАК КурсыВалютыДокументаКурс,
	|		&КратностьВалютыДокумента КАК КурсыВалютыДокументаКратность
	|	ИЗ
	|		ВременнаяТаблицаРасчетыСПоставщикамиОстатки КАК РасчетыСПоставщикамиОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаУчета) КАК КурсыВалютыУчета
	|			ПО (ИСТИНА)) КАК РасчетыСПоставщикамиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиОстатки.Документ,
	|	РасчетыСПоставщикамиОстатки.Заказ,
	|	РасчетыСПоставщикамиОстатки.ДокументДата,
	|	РасчетыСПоставщикамиОстатки.ВалютаРасчетов,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыУчетаКурс,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыУчетаКратность,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыДокументаКурс,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыДокументаКратность
	|
	|ИМЕЮЩИЕ
	|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаРасчетов) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата";
	
	Запрос.УстановитьПараметр("Заказ", ?(Контрагент.ВестиРасчетыПоЗаказам, ЗаказПоставщику, Документы.ЗаказПоставщику.ПустаяСсылка()));
	
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ПериодГраница", Новый Граница(Дата, ВидГраницы.Включая)); // Kuzmich, 23.08.2023, ONESOFT-2496, константа: Зачитывать авансы автоматически - по дату документа
	Запрос.УстановитьПараметр("ВалютаДокумента", ВалютаДокумента);
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Если Договор.ВалютаРасчетов = ВалютаДокумента Тогда
		Запрос.УстановитьПараметр("КурсВалютыДокумента", Курс);
		Запрос.УстановитьПараметр("КратностьВалютыДокумента", Кратность);
	Иначе
		Запрос.УстановитьПараметр("КурсВалютыДокумента", 1);
		Запрос.УстановитьПараметр("КратностьВалютыДокумента", 1);
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = ТекстЗапроса;
	
	Предоплата.Очистить();
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 декабря 2021]  НАЧАЛО
	//СуммаОсталосьРаспределить = Расходы.Итог("Всего");
	СуммаОсталосьРаспределить = Расходы.Итог("Всего") - Расходы.Итог("СуммаНДФЛ") - Расходы.Итог("СуммаПФ");
	// © Шишка В.В. [1 декабря 2021]  КОНЕЦ
	//--------------------------------------------------------------------------
	СуммаОсталосьРаспределить = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
		СуммаОсталосьРаспределить,
		?(Договор.ВалютаРасчетов = ВалютаДокумента, Курс, 1),
		Курс,
		?(Договор.ВалютаРасчетов = ВалютаДокумента, Кратность, 1),
		Кратность
	);
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока СуммаОсталосьРаспределить > 0 Цикл
		
		Если ВыборкаРезультатаЗапроса.Следующий() Тогда
			
			Если ВыборкаРезультатаЗапроса.СуммаРасчетов <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
				
				НоваяСтрока = Предоплата.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
				СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - ВыборкаРезультатаЗапроса.СуммаРасчетов;
				
			Иначе // сумма остатка больше чем нужно распределить
				
				НоваяСтрока = Предоплата.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
				НоваяСтрока.СуммаРасчетов = СуммаОсталосьРаспределить;
				НоваяСтрока.СуммаПлатежа = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
					НоваяСтрока.СуммаРасчетов,
					ВыборкаРезультатаЗапроса.Курс,
					ВыборкаРезультатаЗапроса.КурсыВалютыДокументаКурс,
					ВыборкаРезультатаЗапроса.Кратность,
					ВыборкаРезультатаЗапроса.КурсыВалютыДокументаКратность
				);
				СуммаОсталосьРаспределить = 0;
				
			КонецЕсли;
			
		Иначе
			
			СуммаОсталосьРаспределить = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполнения документа на основании приходная накладной.
//
// Параметры:
//	ДокументОснование - ДокументСсылка.ПриходнаяНакладная - приходная накладная
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоПриходнойНакладной(ДанныеЗаполнения) Экспорт
	
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Договор = ДанныеЗаполнения.Договор;
	СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
	ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
	НДСВключатьВСтоимость = ДанныеЗаполнения.НДСВключатьВСтоимость;
	НалогообложениеНДС = ДанныеЗаполнения.НалогообложениеНДС; 
	Если ВалютаДокумента = Константы.НациональнаяВалюта.Получить() Тогда
		Курс = ДанныеЗаполнения.Курс;
		Кратность = ДанныеЗаполнения.Кратность;
	Иначе
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Договор.ВалютаРасчетов));
		Курс = СтруктураПоВалюте.Курс;
		Кратность = СтруктураПоВалюте.Кратность;
	КонецЕсли;
	
	// Заполнение табличной части документа.
	Запасы.Очистить();
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Запасы Цикл
		
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		НоваяСтрока.ДокументПоступления = ДанныеЗаполнения.Ссылка;
		
		Если ТипЗнч(СтрокаТабличнойЧасти.Заказ) = Тип("ДокументСсылка.ЗаказПоставщику")
			И ПолучитьФункциональнуюОпцию("РезервированиеЗапасов") Тогда
			НоваяСтрока.ЗаказПокупателя = СтрокаТабличнойЧасти.Заказ.ЗаказПокупателя;
		КонецЕсли;
		
	КонецЦикла;
	ВидНалогаНДС = ДанныеЗаполнения.ВидНалогаНДС;
	
КонецПроцедуры // ЗаполнитьПоПриходнойНакладной()

// Процедура заполнения документа на основании авансовый отчет.
//
// Параметры:
//	ДокументОснование - ДокументСсылка.АвансовыйОтчет - авансовый отчет
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоАвансовомуОтчету(ДанныеЗаполнения) Экспорт
	
	Организация = ДанныеЗаполнения.Организация;
	ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
	НДСВключатьВСтоимость = ДанныеЗаполнения.НДСВключатьВСтоимость;
	Курс = ДанныеЗаполнения.Курс;
	Кратность = ДанныеЗаполнения.Кратность;
	НалогообложениеНДС = ДанныеЗаполнения.НалогообложениеНДС; 
	
	// Заполнение табличной части документа.	
	Запасы.Очистить();
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Запасы Цикл
		
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		НоваяСтрока.ДокументПоступления	= ДанныеЗаполнения.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоАвансовомуОтчету()

#КонецОбласти

#Область ОбработчикиСобыий

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПриходнойНакладной";
	СтратегияЗаполнения[Тип("ДокументСсылка.АвансовыйОтчет")] = "ЗаполнитьПоАвансовомуОтчету";
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	//Если Запасы.Итог("СуммаРасходов") <> Расходы.Итог("Всего") Тогда
	Если Запасы.Итог("СуммаРасходов") <> Расходы.Итог("Всего") - Расходы.Итог("СуммаНДС") Тогда
		
		ТекстСообщения = НСтр("ka='მომსახურებების ჯამი მარაგებზე განაწილებული ჯამის ტოლი არ არის!';ru='Сумма услуг не равна распределенной сумме по запасам!';en='Service is not equal to the sum of the amount distributed on reserves!'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
		);
		
	КонецЕсли;
	
	//Паганини_
	Если Запасы.Итог("СуммаРасходовНДФЛ") <> Расходы.Итог("СуммаНДФЛ") Тогда
		ТекстСообщения = НСтр("ka='მომსახურებების საშემოსავლო თანხა არ არის ტოლი მარაგებზე გადანაწილებული საშემოსავლო თანხის!';ru='Сумма НДФЛ услуг не равна распределенной сумме НДФЛ по запасам!';en='The amount of personal income tax services is not equal to the sum of personal income tax distributed on reserves!'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(,ТекстСообщения,Неопределено,Неопределено,Неопределено,Отказ);
	КонецЕсли;
	Если Запасы.Итог("СуммаРасходовПФ") <> Расходы.Итог("СуммаПФ") Тогда
		ТекстСообщения = НСтр("ka='მომსახურებების საპენსიო თანხა არ არის ტოლი მარაგებზე გადანაწილებული საპენსიო თანხის!';ru='Сумма ПФ услуг не равна распределенной сумме ПФ по запасам!';en='PF service amount is not equal to the amount distributed PF reserves!'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(,ТекстСообщения,Неопределено,Неопределено,Неопределено,Отказ);
	КонецЕсли;
	//Паганини
	
	Если НЕ Контрагент.ВестиРасчетыПоДоговорам Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");
	КонецЕсли;
	Если НЕ НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Расходы.СтавкаНДС");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Запасы.СтавкаНДС");
	КонецЕсли;
	
	//+++ Дмгг
	Если Импорт Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Запасы.СуммаРасходов");
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент)
	И НЕ Контрагент.ВестиРасчетыПоДоговорам
	И НЕ ЗначениеЗаполнено(Договор) Тогда
		Договор = Контрагент.ДоговорПоУмолчанию;
	КонецЕсли;
	
	//Малышев 2025-07-01 ONESOFT-4196 
	Если не Справочники.ДоговорыКонтрагентов.ВводПФДляДоговора_Актуальность(Дата, Контрагент, Договор) ТОгда
		Для каждого СтрУслуг из Расходы Цикл
			Если ЗначениеЗаполнено(СтрУслуг.ВидУдержанияПФ) ТОгда
				СтрУслуг.ВидУдержанияПФ = 0;
			КонецЕсли;	                    
			Если СтрУслуг.СуммаПФ <> 0 ТОгда          
				СтрУслуг.СуммаПФ = 0;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	

	
	СуммаДокумента = Расходы.Итог("Всего");
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ДополнительныеРасходы.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗакупки(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоНалогам(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗаказыПоставщикам(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПоставщиками(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыКассовыйМетод(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыНераспределенные(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыОтложенные(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьАвансыПолученныхФактур(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗакупкиДляКУДиР(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыНДФЛ(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьРасчетыСПенсионнымФондом(ДополнительныеСвойства, Движения, Отказ);//Паганини ПФ
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьСебестоимостьЗакупки(ДополнительныеСвойства, Движения, Отказ);//+++ Дмгг
	
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.ДополнительныеРасходы.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.ДополнительныеРасходы.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
	// Подчиненная счет-фактура (полученная)
	Если НЕ Отказ Тогда
		
		КонтрольПодчиненнойСчетФактуры();
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Процедура - обработчик события ПриКопировании объекта.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Предоплата.Очистить();
	
КонецПроцедуры // ПриКопировании()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура отмены проведения у подченненой счет фактуры (полученной)
//
Процедура КонтрольПодчиненнойСчетФактуры()
	
	СтруктураСчетаФактуры = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйСчетФактуру(Ссылка, Истина);
	Если СтруктураСчетаФактуры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СчетФактура	 = СтруктураСчетаФактуры.Ссылка;
	Если Не СчетФактура.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ka='მოძრაობების არარსებობის გამო დოკუმენტ %ПредставлениеТекущегоДокумента%-ს გაუტარდება %ПредставлениеСчетФактуры%.';ru='В связи с отсутствием движений у документа %ПредставлениеТекущегоДокумента% распроводится %ПредставлениеСчетФактуры%.';en='Due to the lack of movement in the document PredstavlenieTekuschegoDokumenta%%% rasprovoditsya PredstavlenieSchetFaktury%.'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеТекущегоДокумента%", """Поступление дополнительных расходов № " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy") + """");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеСчетФактуры%", """Счет фактура (полученная) № " + СтруктураСчетаФактуры.Номер + " от " + СтруктураСчетаФактуры.Дата + """");
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
	СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
	СчетФактураОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры //КонтрольПодчиненнойСчетФактуры()

#КонецОбласти

#КонецЕсли

// Kuzmich, 26.03.2019, распределение услуг по весу/объему
#Область РаспределениеУслугПоВесуОбъему

Функция РаспределитьТабЧастьРасходыПоВесу() ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = Новый Массив();
	
	ИсхСумма = 0;
	ИсхСуммаНДС = 0;
	БазаРаспределенияВес = 0;
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		Если ЗначениеЗаполнено(СтрокаЗапасы.Номенклатура.Вес) Тогда
			Если СтрокаЗапасы.Номенклатура.Вес>0 Тогда
				БазаРаспределенияВес = БазаРаспределенияВес + СтрокаЗапасы.Количество*СтрокаЗапасы.Номенклатура.Вес;
			Иначе
				Если РЕЗ.Найти(СтрокаЗапасы.Номенклатура)=НЕОПРЕДЕЛЕНО Тогда
					РЕЗ.Добавить(СтрокаЗапасы.Номенклатура);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если РЕЗ.Найти(СтрокаЗапасы.Номенклатура)=НЕОПРЕДЕЛЕНО Тогда
				РЕЗ.Добавить(СтрокаЗапасы.Номенклатура);
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла; 
	ВсегоРасходы = Расходы.Итог("СуммаБезНалогов");//Паганини Расходы.Итог("Всего")
	ВсегоНДСРасходы = Расходы.Итог("СуммаНДС");
	//Паганини_
	ИсхСуммаНДФЛ = 0;	
	ВсегоРасходыНДФЛ = Расходы.Итог("СуммаНДФЛ");
	ИсхСуммаПФ = 0;	
	ВсегоРасходыПФ = Расходы.Итог("СуммаПФ");
	//_Паганини
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		СтрокаЗапасы.СуммаРасходов = 0;
		СтрокаЗапасы.СуммаРасходовНДФЛ = 0;
		СтрокаЗапасы.СуммаРасходовПФ = 0;
		
		Если НЕ РЕЗ.Найти(СтрокаЗапасы.Номенклатура)=НЕОПРЕДЕЛЕНО Тогда
			Продолжить;
		КонецЕсли;
		
		ТекКоэффицинтВес = СтрокаЗапасы.Количество*СтрокаЗапасы.Номенклатура.Вес;
		СтрокаЗапасы.Коэффициент  =  ТекКоэффицинтВес ; //+++Lazare
		СтрокаЗапасы.СуммаРасходов = ?(БазаРаспределенияВес <> 0, Окр((ВсегоРасходы - ИсхСумма) * ТекКоэффицинтВес / БазаРаспределенияВес, 2, 1),0);
		СтрокаЗапасы.СуммаРасходовНДФЛ = ?(БазаРаспределенияВес <> 0, Окр((ВсегоРасходыНДФЛ - ИсхСуммаНДФЛ) * ТекКоэффицинтВес / БазаРаспределенияВес, 2, 1),0);//Паганини
		СтрокаЗапасы.СуммаРасходовПФ   = ?(БазаРаспределенияВес <> 0, Окр((ВсегоРасходыПФ   - ИсхСуммаПФ)   * ТекКоэффицинтВес / БазаРаспределенияВес, 2, 1),0);//Паганини ПФ
		БазаРаспределенияВес = БазаРаспределенияВес - ТекКоэффицинтВес;
		ИсхСумма = ИсхСумма + СтрокаЗапасы.СуммаРасходов;
		ИсхСуммаНДФЛ = ИсхСуммаНДФЛ + СтрокаЗапасы.СуммаРасходовНДФЛ;//Паганини
		ИсхСуммаПФ   = ИсхСуммаПФ   + СтрокаЗапасы.СуммаРасходовПФ;//Паганини ПФ
		
	КонецЦикла;
	
	Возврат РЕЗ;
КонецФункции


Функция РаспределитьТабЧастьРасходыПоОбъему() ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = Новый Массив();
	
	ИсхСумма = 0;
	ИсхСуммаНДС = 0;
	БазаРаспределенияОбъем = 0;
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		Если ЗначениеЗаполнено(СтрокаЗапасы.Номенклатура.Объем) Тогда
			Если СтрокаЗапасы.Номенклатура.Объем>0 Тогда
				БазаРаспределенияОбъем = БазаРаспределенияОбъем + СтрокаЗапасы.Количество*СтрокаЗапасы.Номенклатура.Объем;
			Иначе
				Если РЕЗ.Найти(СтрокаЗапасы.Номенклатура)=НЕОПРЕДЕЛЕНО Тогда
					РЕЗ.Добавить(СтрокаЗапасы.Номенклатура);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если РЕЗ.Найти(СтрокаЗапасы.Номенклатура)=НЕОПРЕДЕЛЕНО Тогда
				РЕЗ.Добавить(СтрокаЗапасы.Номенклатура);
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла; 
	ВсегоРасходы = Расходы.Итог("СуммаБезНалогов");//Паганини Расходы.Итог("Всего")
	ВсегоНДСРасходы = Расходы.Итог("СуммаНДС");
	//Паганини_
	ИсхСуммаНДФЛ = 0;	
	ВсегоРасходыНДФЛ = Расходы.Итог("СуммаНДФЛ");
	ИсхСуммаПФ = 0;	
	ВсегоРасходыПФ = Расходы.Итог("СуммаПФ");
	//_Паганини
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		СтрокаЗапасы.СуммаРасходов = 0;
		СтрокаЗапасы.СуммаРасходовНДФЛ = 0;
		СтрокаЗапасы.СуммаРасходовПФ = 0;
		
		Если НЕ РЕЗ.Найти(СтрокаЗапасы.Номенклатура)=НЕОПРЕДЕЛЕНО Тогда
			Продолжить;
		КонецЕсли;
		
		ТекКоэффицинтОбъем = СтрокаЗапасы.Количество*СтрокаЗапасы.Номенклатура.Объем;
		
		СтрокаЗапасы.СуммаРасходов = ?(БазаРаспределенияОбъем <> 0, Окр((ВсегоРасходы - ИсхСумма) * ТекКоэффицинтОбъем / БазаРаспределенияОбъем, 2, 1),0);
		СтрокаЗапасы.СуммаРасходовНДФЛ = ?(БазаРаспределенияОбъем <> 0, Окр((ВсегоРасходыНДФЛ - ИсхСуммаНДФЛ) * ТекКоэффицинтОбъем / БазаРаспределенияОбъем, 2, 1),0);//Паганини
		СтрокаЗапасы.СуммаРасходовПФ   = ?(БазаРаспределенияОбъем <> 0, Окр((ВсегоРасходыПФ   - ИсхСуммаПФ)   * ТекКоэффицинтОбъем / БазаРаспределенияОбъем, 2, 1),0);//Паганини ПФ
		БазаРаспределенияОбъем = БазаРаспределенияОбъем - ТекКоэффицинтОбъем;
		ИсхСумма = ИсхСумма + СтрокаЗапасы.СуммаРасходов;
		ИсхСуммаНДФЛ = ИсхСуммаНДФЛ + СтрокаЗапасы.СуммаРасходовНДФЛ;//Паганини
		ИсхСуммаПФ   = ИсхСуммаПФ   + СтрокаЗапасы.СуммаРасходовПФ;//Паганини ПФ
		
	КонецЦикла;
	
	Возврат РЕЗ;
КонецФункции

#КонецОбласти
// Kuzmich, 26.03.2019, распределение услуг по весу/объему
