////////////////////////////////////////////////////////////////////////////////
// Подсистема "Отправка SMS"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Отправляет SMS через SMS.RU.
//
// Параметры:
//  НомераПолучателей - Массив - номера получателей в формате +7ХХХХХХХХХХ;
//  Текст 			  - Строка - текст сообщения, длиной не более 480 символов;
//  ИмяОтправителя 	  - Строка - имя отправителя, которое будет отображаться вместо номера входящего SMS;
//  Логин			  - Строка - логин пользователя услуги отправки sms;
//  Пароль			  - Строка - пароль пользователя услуги отправки sms.
//
// Возвращаемое значение:
//  Структура: ОтправленныеСообщения - Массив структур: НомерОтправителя.
//                                                  ИдентификаторСообщения.
//             ОписаниеОшибки        - Строка - пользовательское представление ошибки, если пустая строка,
//                                          то ошибки нет.
Функция ОтправитьSMS(НомераПолучателей, Текст, ИмяОтправителя, Логин, Пароль) Экспорт
	
	Результат = Новый Структура("ОтправленныеСообщения,ОписаниеОшибки", Новый Массив, "");
	
	// Подготовка строки получателей.
	СтрокаПолучателей = МассивПолучателейСтрокой(НомераПолучателей);
	
	// Проверка на заполнение обязательных параметров.
	Если ПустаяСтрока(СтрокаПолучателей) Или ПустаяСтрока(Текст) Тогда
		Результат.ОписаниеОшибки = НСтр("ka='შეტყობინების არასწორი პარამეტრები';ru='Неверные параметры сообщения';en='Incorrect parameters message'");
		Возврат Результат;
	КонецЕсли;
	
	// Получение токена.
	ИмяФайлаОтвета = ВыполнитьЗапрос("auth/get_token", Новый Структура);
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаОтвета);
	Токен = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	// Подготовка передачи пароля.
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.Добавить(КодироватьСтроку(Пароль, СпособКодированияСтроки.КодировкаURL)+Токен);
	КодАвторизации = НРег(СтрЗаменить(ХешированиеДанных.ХешСумма, " ", ""));
	
	// Подготовка параметров запроса.
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("login", Логин);
	ПараметрыЗапроса.Вставить("token", Токен);
	ПараметрыЗапроса.Вставить("sig", КодАвторизации);
	
	ПараметрыЗапроса.Вставить("text", Текст);
	ПараметрыЗапроса.Вставить("to", СтрокаПолучателей);
	ПараметрыЗапроса.Вставить("from", ИмяОтправителя);
	
	// отправка запроса
	ИмяФайлаОтвета = ВыполнитьЗапрос("sms/send", ПараметрыЗапроса);
	Если ПустаяСтрока(ИмяФайлаОтвета) Тогда
		Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + НСтр("ka='დაკავშირება არ არის დაყენებული';ru='Соединение не установлено';en='Connection not established'");
		Возврат Результат;
	КонецЕсли;
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаОтвета);
	ОтветСервера = ЧтениеТекста.ПрочитатьСтроку();
	Если ОтветСервера = "100" Тогда
		Для Каждого НомерПолучателя Из СтрРазделить(СтрокаПолучателей, ",", Ложь) Цикл
			ИдентификаторСообщения = ЧтениеТекста.ПрочитатьСтроку();
			Если ИдентификаторСообщения = Неопределено Тогда
				Результат.ОписаниеОшибки = НСтр("ka='Ответ сервера не распознан';ru='Ответ сервера не распознан';en='the server response is not recognized'");
				Прервать;
			КонецЕсли;
			
			Если Не ПустаяСтрока(НомерПолучателя) Тогда
				ОтправленноеСообщение = Новый Структура("НомерПолучателя,ИдентификаторСообщения",
					НомерПолучателя,ИдентификаторСообщения);
				Результат.ОтправленныеСообщения.Добавить(ОтправленноеСообщение);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Результат.ОписаниеОшибки = ОписаниеОшибкиОтправки(ОтветСервера);
	КонецЕсли;
	ЧтениеТекста.Закрыть();
	УдалитьФайлы(ИмяФайлаОтвета);
	
	Возврат Результат;
	
КонецФункции

// Возвращает текстовое представление статуса доставки сообщения.
//
// Параметры:
//  ИдентификаторСообщения - Строка - идентификатор, присвоенный sms при отправке;
//  НастройкиОтправкиSMS   - Структура - см. ОтправкаSMSПовтИсп.НастройкиОтправкиSMS;
//
// Возвращаемое значение:
//  Строка - статус доставки. См. описание функции ОтправкаSMS.СтатусДоставки.
Функция СтатусДоставки(ИдентификаторСообщения, НастройкиОтправкиSMS) Экспорт
	
	Логин = НастройкиОтправкиSMS.Логин;
	Пароль = НастройкиОтправкиSMS.Пароль;
	
	// Получение токена.
	ИмяФайлаОтвета = ВыполнитьЗапрос("auth/get_token", Новый Структура);
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаОтвета);
	Токен = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	// Подготовка передачи пароля.
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.Добавить(КодироватьСтроку(Пароль, СпособКодированияСтроки.КодировкаURL)+Токен);
	КодАвторизации = НРег(СтрЗаменить(ХешированиеДанных.ХешСумма, " ", ""));
	
	// Подготовка параметров запроса.
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("login", Логин);
	ПараметрыЗапроса.Вставить("token", Токен);
	ПараметрыЗапроса.Вставить("sig", КодАвторизации);
	ПараметрыЗапроса.Вставить("id", ИдентификаторСообщения);
	
	// отправка запроса
	ИмяФайлаОтвета = ВыполнитьЗапрос("sms/status", ПараметрыЗапроса);
	Если ПустаяСтрока(ИмяФайлаОтвета) Тогда
		Возврат "Ошибка";
	КонецЕсли;
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаОтвета);
	КодСостояния = ЧтениеТекста.ПрочитатьСтроку();
	ЧтениеТекста.Закрыть();
	УдалитьФайлы(ИмяФайлаОтвета);
	
	Результат = СтатусДоставкиSMS(КодСостояния);
	Если Результат = "Ошибка" Тогда
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не удалось получить статус доставки SMS (id: ""%3""):"
"%1 (код ошибки: %2)';ka='Не удалось получить статус доставки SMS (id: ""%3""):"
"%1 (код ошибки: %2)'"), ОписаниеОшибкиПолученияСтатуса(КодСостояния), КодСостояния, ИдентификаторСообщения);
		ЗаписьЖурналаРегистрации(НСтр("ka='SMS-ის გაგზავნა';ru='Отправка SMS';en='sending SMS'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтатусДоставкиSMS(КодСостояния)
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить("-1", "НеОтправлялось");
	СоответствиеСтатусов.Вставить("100", "НеОтправлялось");
	СоответствиеСтатусов.Вставить("101", "Отправляется");
	СоответствиеСтатусов.Вставить("102", "Отправлено");
	СоответствиеСтатусов.Вставить("103", "Доставлено");
	СоответствиеСтатусов.Вставить("104", "НеДоставлено");
	СоответствиеСтатусов.Вставить("105", "НеДоставлено");
	СоответствиеСтатусов.Вставить("106", "НеДоставлено");
	СоответствиеСтатусов.Вставить("107", "НеДоставлено");
	СоответствиеСтатусов.Вставить("108", "НеДоставлено");
	
	Результат = СоответствиеСтатусов[НРег(КодСостояния)];
	Возврат ?(Результат = Неопределено, "Ошибка", Результат);
КонецФункции

Функция ОписанияОшибок()
	ОписанияОшибок = Новый Соответствие;
	ОписанияОшибок.Вставить("200", НСтр("ka='Авторизация не выполнена: неверный api_id.';ru='Авторизация не выполнена: неверный api_id.';en='Authorization failed: incorrect api_id.'"));
	ОписанияОшибок.Вставить("201", НСтр("ka='Не достаточно средств на лицевом счету.';ru='Не достаточно средств на лицевом счету.';en='Not enough money in the account.'"));
	ОписанияОшибок.Вставить("202", НСтр("ka='Неправильно указан получатель.';ru='Неправильно указан получатель.';en='Incorrect recipient.'"));
	ОписанияОшибок.Вставить("203", НСтр("ka='Нет текста сообщения.';ru='Нет текста сообщения.';en='No text messages.'"));
	ОписанияОшибок.Вставить("204", НСтр("ka='Имя отправителя не согласовано с провайдером (SMS.RU).';ru='Имя отправителя не согласовано с провайдером (SMS.RU).';en='The name of the sender has not agreed with the provider (SMS.RU).'"));
	ОписанияОшибок.Вставить("205", НСтр("ka='Сообщение слишком длинное (превышает 8 SMS).';ru='Сообщение слишком длинное (превышает 8 SMS).';en='Message is too long (more than 8 SMS).'"));
	ОписанияОшибок.Вставить("206", НСтр("ka='Достигнут дневной лимит на отправку сообщений.';ru='Достигнут дневной лимит на отправку сообщений.';en='Reached the daily limit for sending messages.'"));
	ОписанияОшибок.Вставить("207", НСтр("ka='На этот номер (или один из номеров) нельзя отправлять сообщения, либо указано более 100 номеров в списке получателей';ru='На этот номер (или один из номеров) нельзя отправлять сообщения, либо указано более 100 номеров в списке получателей';en='This number (or one of the numbers) can not send messages, or stated more than 100 rooms in the recipient list'"));
	ОписанияОшибок.Вставить("208", НСтр("ka='Параметр time указан неправильно.';ru='Параметр time указан неправильно.';en='The time parameter is incorrect.'"));
	ОписанияОшибок.Вставить("209", НСтр("ka='Номер получателя (или один из номеров) в стоп-листе (см. в личном кабинете на сайте).';ru='Номер получателя (или один из номеров) в стоп-листе (см. в личном кабинете на сайте).';en=""recipient's phone number (or one of the rooms) in the stop list (see. in your account on the site)."""));
	ОписанияОшибок.Вставить("210", НСтр("ka='Используется GET, где необходимо использовать POST.';ru='Используется GET, где необходимо использовать POST.';en='Use GET, where you must use POST.'"));
	ОписанияОшибок.Вставить("211", НСтр("ka='Метод не найден.';ru='Метод не найден.';en='The method is not found.'"));
	ОписанияОшибок.Вставить("212", НСтр("ka='Неверная кодировка текста сообщения (необходимо использовать UTF-8).';ru='Неверная кодировка текста сообщения (необходимо использовать UTF-8).';en='Incorrect coding of the message text (UTF-8 should be used).'"));
	ОписанияОшибок.Вставить("220", НСтр("ka='Сервис временно недоступен.';ru='Сервис временно недоступен.';en='Service is temporarily unavailable.'"));
	ОписанияОшибок.Вставить("230", НСтр("ka='Сообщение не принято к отправке: достигнут дневной лимит сообщений на один номер (60 шт).';ru='Сообщение не принято к отправке: достигнут дневной лимит сообщений на один номер (60 шт).';en='Message not accepted for delivery: We have reached the daily limit messages to a single number (60 pcs).'"));
	ОписанияОшибок.Вставить("300", НСтр("ka='Авторизация не выполнена: token устарел (истек срок действия, либо изменился IP отправителя.';ru='Авторизация не выполнена: token устарел (истек срок действия, либо изменился IP отправителя.';en='Authorization is not performed: token outdated (expired or changed the IP of the sender.'"));
	ОписанияОшибок.Вставить("301", НСтр("ka='Авторизация не выполнена: логин или пароль указаны неверно.';ru='Авторизация не выполнена: логин или пароль указаны неверно.';en='Authorization failed: username or password are incorrect.'"));
	ОписанияОшибок.Вставить("302", НСтр("ka='Авторизация не выполнена: пользователь авторизован, но аккаунт не подтвержден (пользователь не ввел код, присланный в регистрационной SMS.)';ru='Авторизация не выполнена: пользователь авторизован, но аккаунт не подтвержден (пользователь не ввел код, присланный в регистрационной SMS.)';en='Authorization failed: the user is authorized, but the account is not confirmed (the user enters a code sent in a registration SMS.)'"));
	
	Возврат ОписанияОшибок;
КонецФункции

Функция ОписаниеОшибкиОтправки(КодОшибки)
	ОписанияОшибок = ОписанияОшибок();
	ТекстСообщения = ОписанияОшибок[КодОшибки];
	Если ТекстСообщения = Неопределено Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ka='Сообщение не отправлено (код ошибки: %1).';ru='Сообщение не отправлено (код ошибки: %1).';en='Message not sent (error code:% 1).'"), КодОшибки);
	КонецЕсли;
	Возврат ТекстСообщения;
КонецФункции

Функция ОписаниеОшибкиПолученияСтатуса(КодОшибки)
	ОписанияОшибок =ОписанияОшибок();
	ТекстСообщения = ОписанияОшибок[КодОшибки];
	Если ТекстСообщения = Неопределено Тогда
		ТекстСообщения = НСтр("ka='Отказ выполнения операции';ru='Отказ выполнения операции';en='Failure operation'");
	КонецЕсли;
	Возврат ТекстСообщения;
КонецФункции

Функция ВыполнитьЗапрос(ИмяМетода, ПараметрыЗапроса)
	
	Результат = "";
	
	ИмяФайлаЗапроса = СформироватьФайлДляPOSTЗапроса(ПараметрыЗапроса);
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла("txt");
	
	// формирование заголовка
	Заголовок = Новый Соответствие;
	Заголовок.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Заголовок.Вставить("Content-Length", XMLСтрока(РазмерФайла(ИмяФайлаЗапроса)));
	
	// Отправка запроса и получение ответа.
	Попытка
		Соединение = Новый HTTPСоединение("sms.ru", , , , ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("http"), 60);
		Соединение.ОтправитьДляОбработки(ИмяФайлаЗапроса, "/" + ИмяМетода, ИмяФайлаОтвета, Заголовок);
		Результат = ИмяФайлаОтвета;
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ka='SMS-ის გაგზავნა';ru='Отправка SMS';en='sending SMS'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	УдалитьФайлы(ИмяФайлаЗапроса);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьФайлДляPOSTЗапроса(ПараметрыЗапроса)
	СтрокаЗапроса = "";
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Если Не ПустаяСтрока(СтрокаЗапроса) Тогда
			СтрокаЗапроса = СтрокаЗапроса + "&";
		КонецЕсли;
		СтрокаЗапроса = СтрокаЗапроса + Параметр.Ключ + "=" + КодироватьСтроку(Параметр.Значение, СпособКодированияСтроки.КодировкаURL);
	КонецЦикла;
	
	ИмяФайлаЗапроса = ПолучитьИмяВременногоФайла("txt");
	
	ФайлЗапроса = Новый ЗаписьТекста(ИмяФайлаЗапроса, КодировкаТекста.ANSI);
	ФайлЗапроса.Записать(СтрокаЗапроса);
	ФайлЗапроса.Закрыть();
	
	Возврат ИмяФайлаЗапроса;
КонецФункции

Функция РазмерФайла(ИмяФайла)
	Файл = Новый Файл(ИмяФайла);
	Возврат Файл.Размер();
КонецФункции

Функция МассивПолучателейСтрокой(Массив)
	Получатели = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Получатели, Массив, Истина);
	
	Результат = "";
	Для Каждого Получатель Из Получатели Цикл
		Номер = ФорматироватьНомер(Получатель);
		Если НЕ ПустаяСтрока(Номер) Тогда 
			Если Не ПустаяСтрока(Результат) Тогда
				Результат = Результат + ",";
			КонецЕсли;
			Результат = Результат + Номер;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ФорматироватьНомер(Номер)
	Результат = "";
	ДопустимыеСимволы = "+1234567890";
	Для Позиция = 1 По СтрДлина(Номер) Цикл
		Символ = Сред(Номер,Позиция,1);
		Если СтрНайти(ДопустимыеСимволы, Символ) > 0 Тогда
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;	
КонецФункции

// Возвращает список разрешений для отправки SMS с использованием всех доступных провайдеров.
//
// Возвращаемое значение:
//  Массив.
//
Функция Разрешения() Экспорт
	
	Протокол = "HTTP";
	Адрес = "sms.ru";
	Порт = Неопределено;
	Описание = НСтр("ka='Отправка SMS через ""SMS.RU"".';ru='Отправка SMS через ""SMS.RU"".';en='Sending SMS via ""SMS.RU"".'");
	
	Разрешения = Новый Массив;
	Разрешения.Добавить(
		РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(Протокол, Адрес, Порт, Описание));
	
	Возврат Разрешения;
КонецФункции

#КонецОбласти

