#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПараметрыПоискаСпособаДоставки(Знач ТекущийВариантКП) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация", Организация);
	Результат.Вставить("Магазин", СтруктурнаяЕдиницаПродажи);
	Результат.Вставить("Склад", СтруктурнаяЕдиницаРезерв);
	Результат.Вставить("СпособДоставки", СпособДоставки);
	Если ДоставкаСервер.АдресОтправленияИзСклада() Тогда
		ПоляАдресаОтправления = ДоставкаСервер.ПоляАдресаОтправления(СтруктурнаяЕдиницаРезерв);
	Иначе
		ПоляАдресаОтправления = ДоставкаСервер.ПоляАдресаОтправления(Организация);
	КонецЕсли;
	Результат.Вставить("АдресОтправленияЗначенияПолей", ПоляАдресаОтправления.АдресОтправленияЗначенияПолей);
	Результат.Вставить("АдресДоставкиЗначенияПолей", АдресДоставкиЗначенияПолей);
	Результат.Вставить("Ширина", Ширина);
	Результат.Вставить("Высота", Высота);
	Результат.Вставить("Длина", Длина);
	Результат.Вставить("Вес", Вес);
	Результат.Вставить("ОбъявленнаяЦенность", ОбъявленнаяЦенность);
	
	ТаблицаЗапасы = Запасы.Выгрузить(Новый Структура("ТипНоменклатурыЗапас, НомерВариантаКП", Истина, ТекущийВариантКП));
	ТаблицаЗапасы.Колонки.Добавить("ЦенаДляДоставки", Новый ОписаниеТипов("Число"));
	ТаблицаЗапасы.Колонки.Добавить("КоличествоДляДоставки", Новый ОписаниеТипов("Число"));
	ТаблицаЗапасы.Колонки.Добавить("СуммаДляДоставки", Новый ОписаниеТипов("Число"));
	
	ЯндексДоставка.РассчитатьЦеныДляДоставки(ТаблицаЗапасы);
	
	Результат.Вставить("СуммаЗаказа", ТаблицаЗапасы.Итог("СуммаДляДоставки"));
	Результат.Вставить("КоличествоТоваров", ТаблицаЗапасы.Итог("КоличествоДляДоставки"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ОчиститьДатуНомерВходящегоДокумента(ЭтотОбъект);
	
	ЭтотОбъект.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.ПустаяСсылка();
	Если ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		ЭтотОбъект.СостояниеЗаказа = ЗаполнениеОбъектовУНФ.ПолучитьСостояниеЗаказНаряда(ВидЗаказа);
	Иначе
		ЭтотОбъект.СостояниеЗаказа = ЗаполнениеОбъектовУНФ.ПолучитьСостояниеЗаказаПокупателя(ВидЗаказа);
	КонецЕсли;
	ЭтотОбъект.УдалитьЗакрыт = Ложь;
	ЭтотОбъект.КалькуляцияРассчитана = Ложь;
	ЭтотОбъект.Событие = Документы.Событие.ПустаяСсылка();
	
	Предоплата.Очистить();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ВидОперации")
		И ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд
		И ДанныеЗаполнения.Свойство("Номенклатура") Тогда
		
		Номенклатура = ДанныеЗаполнения.Номенклатура;
		ТабличнаяЧасть = Новый ТаблицаЗначений;
		ТабличнаяЧасть.Колонки.Добавить("Номенклатура");
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		
		Если Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
			ИмяТЧ = "Запасы";
		ИначеЕсли Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
			ИЛИ Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
			ИмяТЧ = "Работы";
		Иначе
			ИмяТЧ = "";
		КонецЕсли;
		
		ДанныеЗаполнения = Новый Структура;
		Если ЗначениеЗаполнено(ИмяТЧ) Тогда
			ДанныеЗаполнения.Вставить(ИмяТЧ, ТабличнаяЧасть);
		КонецЕсли;
		Если Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ВидРабот Тогда
			ДанныеЗаполнения.Вставить("ВидРабот", Номенклатура);
		КонецЕсли;
		ДанныеЗаполнения.Вставить("ВидОперации", Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд);
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемИПередачаВРемонт") Тогда
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ЗаполнитьПоПриемуВРемонт");
	ИначеЕсли ОбщегоНазначения.ЗначениеСсылочногоТипа(ДанныеЗаполнения) Тогда
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
	Иначе
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, , "СостояниеЗаказа, ВариантЗавершения, ПричинаОтмены");
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КомПредложение") Тогда
		 Контрагент =  ДанныеЗаполнения.Контрагент;
	     Договор=  ДанныеЗаполнения.Договор;
		 Организация =  ДанныеЗаполнения.Организация;
	     Дата  =  ДанныеЗаполнения.Дата;
		 СтруктурнаяЕдиницаРезерв =  ДанныеЗаполнения.СтруктурнаяЕдиница;
		 Ответственный =  ДанныеЗаполнения.Ответственный;
		 ВалютаДокумента  =  ДанныеЗаполнения.ВалютаДокумента;
		 Курс =  ДанныеЗаполнения.Курс;
		 Кратность =  ДанныеЗаполнения.Кратность;
		 СуммаВключаетНДС =  ДанныеЗаполнения.СуммаВключаетНДС;
		 ВидЦен =  ДанныеЗаполнения.ВидЦен;
		 НДСВключатьВСтоимость =  ДанныеЗаполнения.НДСВключатьВСтоимость;
		 НалогообложениеНДС =  ДанныеЗаполнения.НалогообложениеНДС;
		 ВидСкидкиНаценки  =  ДанныеЗаполнения.ВидСкидкиНаценки;
		 ВидОперации  =  ДанныеЗаполнения.ВидОперации;
		 

		 
		 Для Каждого ТекСтрока Из ДанныеЗаполнения.ТаблицаПредложений Цикл
			НоваяСтрока = Запасы.Добавить();
			НоваяСтрока.Количество = ТекСтрока.Количество;
			НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
			НоваяСтрока.Характеристика = ТекСтрока.Характеристика;
			НоваяСтрока.ПроцентСкидкиНаценки = ТекСтрока.ПроцентСкидкиНаценки;
			НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС;
			НоваяСтрока.СуммаНДС = ТекСтрока.СуммаНДС;
			СтавкаНДС=ПолучитьСтавкуНДСЧислом(НоваяСтрока.СтавкаНДС);
			НоваяСтрока.Сумма = ТекСтрока.Сумма;
			//Если Не ДанныеЗаполнения.ЦенаВклюЧаетНалоги Тогда
				НоваяСтрока.Цена = ТекСтрока.Цена;
//				НоваяСтрока.ЦенаСкидком = ТекСтрока.Цена * (1-ТекСтрока.ПроцентСкидки/100);
				//НоваяСтрока.Всего = ТекСтрока.Сумма*(1+СтавкаНДС/100);    
			//Иначе
			//	НоваяСтрока.Цена = ТекСтрока.ЦенаСкидком/(1-ТекСтрока.ПроцентСкидки/100);
//				НоваяСтрока.ЦенаСкидком = НоваяСтрока.Цена* ТекСтрока.Количество*(1-ТекСтрока.ПроцентСкидки/100);
			    // ТекущиеДанные.Сумма = Цена * (1-ТекущиеДанные.ПроцентСкидки/100) * ТекущиеДанные.Количество;
			    //НоваяСтрока.Всего = ТекСтрока.Сумма*(1+СтавкаНДС/100)
			//КонецЕсли;	
				НоваяСтрока.Всего =  ТекСтрока.Всего;
							
		КонецЦикла;
		
	КонецЕсли;
		 
	Если НЕ ЗначениеЗаполнено(УсловияСчетаЗаказа) Тогда
		УсловияСчетаЗаказа = Справочники.ДополнительныеУсловия.ПолучитьТиповыеУсловия();
	КонецЕсли;
	

	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
		ДатаОтгрузки = Дата;
	КонецЕсли;
	// Конец МобильноеПриложение
	
	Если ПоложениеДатыОтгрузки = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		Для каждого СтрокаТабличнойЧасти Из Запасы Цикл
			Если СтрокаТабличнойЧасти.ДатаОтгрузки <> ДатаОтгрузки Тогда
				СтрокаТабличнойЧасти.ДатаОтгрузки = ДатаОтгрузки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПоложениеДатыОтгрузки = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
		Если ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
			ДатаОтгрузки = Финиш;
		Иначе
			Для каждого Строка Из Запасы Цикл
				Если НЕ ЗначениеЗаполнено(Строка.ДатаОтгрузки) Тогда
					Продолжить;
				КонецЕсли;
				ДатаОтгрузки = Строка.ДатаОтгрузки;
				Прервать;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоложениеВидаРабот = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		Для каждого СтрокаТабличнойЧасти Из Работы Цикл
			СтрокаТабличнойЧасти.ВидРабот = ВидРабот;
		КонецЦикла;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		
		СписокРесурсов = "";
		Для Каждого СтрокаРесурс Из РесурсыПредприятия Цикл
			СписокРесурсов = СписокРесурсов + ?(СписокРесурсов = "","","; " + Символы.ПС) + СокрЛП(СтрокаРесурс.РесурсПредприятия);
		КонецЦикла;
		
		СписокНоменклатуры = "";
		Для Каждого СтрокаНоменклатура Из Работы Цикл
			ХарактеристикаПредставление = "";
			Если Константы.ФункциональнаяОпцияИспользоватьХарактеристики.Получить() 
				И ЗначениеЗаполнено(СтрокаНоменклатура.Характеристика) Тогда
				ХарактеристикаПредставление = " (" + СокрЛП(СтрокаНоменклатура.Характеристика) + ")";
			КонецЕсли;
			КоличествоНоменклатуры = СтрокаНоменклатура.Количество * СтрокаНоменклатура.Кратность * СтрокаНоменклатура.Коэффициент;
			СписокНоменклатуры = СписокНоменклатуры + ?(СписокНоменклатуры = "","","; " + Символы.ПС) + СокрЛП(СтрокаНоменклатура.Номенклатура) + ХарактеристикаПредставление + ", " + КоличествоНоменклатуры + " " + СокрЛП(Справочники.КлассификаторЕдиницИзмерения.ч);
		КонецЦикла;
		
		Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказНарядов") Тогда
			ЭтотОбъект.ВидЗаказа = Справочники.ВидыЗаказНарядов.Основной;
		КонецЕсли;
		
	Иначе
		
		Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей") Тогда
			ЭтотОбъект.ВидЗаказа = Справочники.ВидыЗаказовПокупателей.Основной;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент)
	И НЕ Контрагент.ВестиРасчетыПоДоговорам
	И НЕ ЗначениеЗаполнено(Договор) Тогда
		Договор = Контрагент.ДоговорПоУмолчанию;
	КонецЕсли;
	
	ОжидаетсяВыборВариантаКП = КоличествоВариантовКП <> 0 И ОсновнойВариантКП = 0;
	РассчитатьСуммуДокумента();
	ДатаИзменения = ТекущаяДата();
	
	// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность()
		И НЕ ПометкаУдаления Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	// Конец МобильноеПриложение
	
	СостоянияЗаказов.ПередЗаписьюЗаказа(ЭтотОбъект);
	
	ПривестиДанныеКСогласованномуСостоянию();
	ДополнительныеСвойства.Вставить("ЯндексДоставкаИзмененЛокально", ЯндексДоставка.ИзмененЛокально(ЭтотОбъект));
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СостоянияЗаказов.ПриЗаписиЗаказа(ЭтотОбъект);
	
	Если ДополнительныеСвойства.ЯндексДоставкаИзмененЛокально Тогда
		РегистрыСведений.ЯндексДоставка.УстановитьОтметкуИзмененЛокально(ЭтотОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.ЗаказПокупателя.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, ЭтотОбъект);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	УправлениеНебольшойФирмойСервер.ОтразитьГрафикДвиженияЗапасов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗаказыПокупателей(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьПотребностьВЗапасах(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРазмещениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	
	Если ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		
		УправлениеНебольшойФирмойСервер.ОтразитьЗапасыВРазрезеГТД(ДополнительныеСвойства, Движения, Отказ);
		УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоНалогам(ДополнительныеСвойства, Движения, Отказ);
		УправлениеНебольшойФирмойСервер.ОтразитьРасчетыНДФЛ(ДополнительныеСвойства, Движения, Отказ);//Паганини
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьРасчетыСПенсионнымФондом(ДополнительныеСвойства, Движения, Отказ);//Паганини ПФ
//ПМ Для отладки		
		//ПаганиниRS_
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьАвансыОтправленныхФактур(ДополнительныеСвойства, Движения, Отказ);
		//_ПаганиниRS
	КонецЕсли;
	
	УправлениеНебольшойФирмойСервер.ОтразитьПлатежныйКалендарь(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьОплатаСчетовИЗаказов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьВыпускПродукции(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыКассовыйМетод(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыНераспределенные(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыОтложенные(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыПоЗаказамПрогноз(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыКРасходуСоСкладов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыПринятые(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьНачисленияИУдержания(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПерсоналом(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьПродажи(ДополнительныеСвойства, Движения, Отказ);
	//--------------------------------------------------------------------------
	// © Шишка В.В. [13 августа 2020 г.]  НАЧАЛО
	УправлениеНебольшойФирмойСервер.ОтразитьГарантийноеОбслуживание(ДополнительныеСвойства, Движения, Отказ);
	// © Шишка В.В. [13 августа 2020 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	//+++ Дмгг
	УправлениеНебольшойФирмойСервер.ОтразитьПроБег(ДополнительныеСвойства, Движения, Отказ);
	//--- Дмгг
	// СерийныеНомера
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераОстатки(ДополнительныеСвойства, Движения, Отказ);
	
	// ДисконтныеКарты
	УправлениеНебольшойФирмойСервер.ОтразитьПродажиПоДисконтнойКарте(ДополнительныеСвойства, Движения, Отказ);
	// АвтоматическиеСкидки
	УправлениеНебольшойФирмойСервер.ОтразитьПредоставленныеАвтоматическиеСкидки(ДополнительныеСвойства, Движения, Отказ);
	// Эквайринг
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыКассовыйМетодЭквайринг(ДополнительныеСвойства, Движения, Отказ);
	
	УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	
	//+++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
//ПМ Для отладки
	//---
	
	// Биллинг
	УправлениеНебольшойФирмойСервер.ОтразитьВыполнениеДоговораОбслуживания(ДополнительныеСвойства, Движения, Отказ);
	
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	Если ПолучитьФункционалРезервированияЗаказов() И Константы_German_Butcher_Получить() Тогда
		УправлениеНебольшойФирмойСервер.ОтразитьУсушкa_СобранныеPаказы(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	// Контроль
	Документы.ЗаказПокупателя.ВыполнитьКонтроль(ЭтотОбъект, ДополнительныеСвойства, Отказ);
	Если НЕ Отказ Тогда 
		Документы.ЗаказПокупателя.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ,,Истина);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
	    Отказ = ПроверяиятьНаМаксимальныйПроцентСкидки();
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
		
	//Отказ = ПроверяиятьНаМаксимальныйПроцентСкидки();
КонецПроцедуры



Функция ПроверяиятьНаМаксимальныйПроцентСкидки()
	
	Отказ =ложь;
	
	КонтролСкидкиНаЗаказПокупателя = Константы.КонтролСкидкиНаЗаказПокупателя.Получить() ;
	
	Если КонтролСкидкиНаЗаказПокупателя > 0 Тогда
		
	//	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаказПокупателяЗапасы.ПроцентСкидкиНаценки,
	//	|	ЗаказПокупателяРаботы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценкиНаРаботе
	//	|ИЗ
	//	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы,
	//	|	Документ.ЗаказПокупателя.Работы КАК ЗаказПокупателяРаботы
	//	|ГДЕ
	//	|	ЗаказПокупателяЗапасы.Ссылка.Ссылка = &Ссылка
	//	|	И ЗаказПокупателяРаботы.Ссылка.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	Если ВыборкаДетальныеЗаписи.ПроцентСкидкиНаценки > КонтролСкидкиНаЗаказПокупателя () Или ВыборкаДетальныеЗаписи.ПроцентСкидкиНаценкиНаРаботе > КонтролСкидкиНаЗаказПокупателя Тогда
	//		
	//		Отказ = истина;
	//		Сообщить("ფასდაკლების პროცენტი მეტია" + " " + Константы.КонтролСкидкиНаЗаказПокупателя.Получить() + "ზე");
	//		Возврат  Отказ;	
	//	КонецЕсли				
	//КонецЦикла;
	
	
	Для Каждого Стр Из Запасы Цикл
		Если Стр.ПроцентСкидкиНаценки > КонтролСкидкиНаЗаказПокупателя Тогда
			 Отказ = истина;
			Сообщить("ფასდაკლების პროცენტი მეტია" + " " + Константы.КонтролСкидкиНаЗаказПокупателя.Получить() + "ზე");
			Возврат  Отказ
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из Работы Цикл
		Если Стр.ПроцентСкидкиНаценки > КонтролСкидкиНаЗаказПокупателя Тогда
			 Отказ = истина;
			Сообщить("ფასდაკლების პროცენტი მეტია" + " " + КонтролСкидкиНаЗаказПокупателя + "ზე");
			Возврат  Отказ
		КонецЕсли;
	КонецЦикла;
	
	
КонецЕсли;

	Возврат  Отказ;	
	
КонецФункции
	


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для удаления проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.ЗаказПокупателя.ВыполнитьКонтроль(ЭтотОбъект, ДополнительныеСвойства, Отказ, Истина);
	
	// Подчиненная счет-фактура
	Если НЕ Отказ Тогда
		
		КонтрольПодчиненнойСчетФактуры();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Контрагент.ВестиРасчетыПоДоговорам Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");
	КонецЕсли;	
	//_Lazare
	Если ПоложениеСклада  = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВШапке") Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Запасы.СтруктурнаяЕдиницаЗапасы");
	КонецЕсли;
	//Lazare_	
	Если ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаОтгрузки"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("МатериалыЗаказчика.ДатаПоступления"));
		
		ПроверяемыеРеквизиты.Добавить("Старт");
		ПроверяемыеРеквизиты.Добавить("Финиш");
		
		Если Материалы.Количество() > 0 ИЛИ Запасы.Количество() > 0 Тогда
			
			ПроверяемыеРеквизиты.Добавить("СтруктурнаяЕдиницаРезерв");
			
		КонецЕсли;
		
	Иначе
		
		Если ПоложениеДатыОтгрузки = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаОтгрузки"));
		КонецЕсли;
		
	КонецЕсли;
	
	МетаданныеДокумента = Документы.ЗаказПокупателя.ПустаяСсылка().Метаданные();
	ТекстКолонкаНеЗаполненаШаблон = НСтр("ka='სია ""%3""-ის სტრიქონ %2-ში სვეტი ""%1"" არ არის შევსებული';ru='Не заполнена колонка ""%1"" в строке %2 списка ""%3""';en='Not filled column ""%1"" in row 2% list ""%3""'");
	
	Для каждого Стр Из Запасы Цикл
		
		Если Стр.ЭтоРазделитель Тогда
			Продолжить;
		КонецЕсли;
		
		Если Стр.НомерВариантаКП <> ОсновнойВариантКП Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВидОперации <> Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
			Если НЕ ЗначениеЗаполнено(Стр.ДатаОтгрузки) И ПоложениеДатыОтгрузки = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
				ТекстСообщения = СтрШаблон(
					ТекстКолонкаНеЗаполненаШаблон,
					МетаданныеДокумента.ТабличныеЧасти.Запасы.Реквизиты.ДатаОтгрузки.Синоним,
					Стр.НомерСтроки,
					МетаданныеДокумента.ТабличныеЧасти.Запасы.Синоним,
				);
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, "Запасы", Стр.НомерСтроки, "ДатаОтгрузки", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Стр.Количество) Тогда
			ТекстСообщения = СтрШаблон(
				ТекстКолонкаНеЗаполненаШаблон,
				МетаданныеДокумента.ТабличныеЧасти.Запасы.Реквизиты.Количество.Синоним,
				Стр.НомерСтроки,
				МетаданныеДокумента.ТабличныеЧасти.Запасы.Синоним,
			);
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, "Запасы", Стр.НомерСтроки, "Количество", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Стр.Цена) Тогда
			ТекстСообщения = СтрШаблон(
				ТекстКолонкаНеЗаполненаШаблон,
				МетаданныеДокумента.ТабличныеЧасти.Запасы.Реквизиты.Цена.Синоним,
				Стр.НомерСтроки,
				МетаданныеДокумента.ТабличныеЧасти.Запасы.Синоним,
			);
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, "Запасы", Стр.НомерСтроки, "Цена", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Стр.СтавкаНДС) Тогда
			ТекстСообщения = СтрШаблон(
				ТекстКолонкаНеЗаполненаШаблон,
				МетаданныеДокумента.ТабличныеЧасти.Запасы.Реквизиты.СтавкаНДС.Синоним,
				Стр.НомерСтроки,
				МетаданныеДокумента.ТабличныеЧасти.Запасы.Синоним,
			);
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, "Запасы", Стр.НомерСтроки, "СтавкаНДС", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Запасы.Итог("Резерв") > 0 Тогда
		
		Для каждого СтрокаЗапасы Из Запасы Цикл
		
			Если СтрокаЗапасы.Резерв > 0
			И НЕ ЗначениеЗаполнено(СтруктурнаяЕдиницаРезерв) Тогда
				
				ТекстСообщения = НСтр("ka='რეზერვის საწყობი არ არის შევსებული';ru='Не заполнен склад резерва'");
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, , , "СтруктурнаяЕдиницаРезерв", Отказ);
				
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;
	
	Если ЗапланироватьОплату
		И ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные Тогда
		
		Если ПроверяемыеРеквизиты.Найти("Касса") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Касса"));
		КонецЕсли;
		
	ИначеЕсли ЗапланироватьОплату
		И ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
		
		Если ПроверяемыеРеквизиты.Найти("БанковскийСчет") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("БанковскийСчет"));
		КонецЕсли;
		
	Иначе
		
		Если ПроверяемыеРеквизиты.Найти("Касса") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Касса"));
		КонецЕсли;
		Если ПроверяемыеРеквизиты.Найти("БанковскийСчет") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("БанковскийСчет"));
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗапланироватьОплату
		И ПлатежныйКалендарь.Количество() = 1
		И НЕ ЗначениеЗаполнено(ПлатежныйКалендарь[0].ДатаОплаты) Тогда
		
		ТекстСообщения = НСтр("ka='ველი ""გადახდის თარიღი"" შეუვსებელია.';ru='Поле ""Дата оплаты"" не заполнено.';en='The ""Payment Date"" is not filled.'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, , , "ДатаОплаты", Отказ);
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПлатежныйКалендарь.ДатаОплаты"));
		
	КонецЕсли;
	
	Если Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить() Тогда
		
		Если ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу Тогда
		
			Для каждого СтрокаЗапасы Из Запасы Цикл
				
				Если СтрокаЗапасы.Резерв > СтрокаЗапасы.Количество Тогда
					
					ТекстСообщения = НСтр("ru='В строке №%1 табл. части ""Товары, услуги"" количество резервируемых позиций превышает общее количество запасов.';ka='В строке №%1 табл. части ""Товары, услуги"" количество резервируемых позиций превышает общее количество запасов.'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаЗапасы.НомерСтроки);
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
						ЭтотОбъект,
						ТекстСообщения,
						"Запасы",
						СтрокаЗапасы.НомерСтроки,
						"Резерв",
						Отказ
					);
					
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
			
			СтрокаСостояния = ЭтотОбъект.ВидЗаказа.ПорядокСостояний.Найти(ЭтотОбъект.СостояниеЗаказа, "Состояние");
			Если СтрокаСостояния <> Неопределено Тогда
			
				ЗаказНарядВСостоянииВыполнения = СтрокаСостояния.НомерСтроки >= ЭтотОбъект.ВидЗаказа.НомерСостоянияВыполнения;
				
				Для Каждого СтрокаЗапасы Из Запасы Цикл
					
					Если ЗаказНарядВСостоянииВыполнения
						И СтрокаЗапасы.РезервОтгрузка > СтрокаЗапасы.Количество Тогда
						
						ТекстСообщения = НСтр("ru='В строке №%1 табл. части ""Товары"" количество списываемых позиций из резерва превышает общее количество запасов.';ka='В строке №%1 табл. части ""Товары"" количество списываемых позиций из резерва превышает общее количество запасов.'");
						ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаЗапасы.НомерСтроки);
						УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
							ЭтотОбъект,
							ТекстСообщения,
							"Запасы",
							СтрокаЗапасы.НомерСтроки,
							"РезервОтгрузка",
							Отказ
						);
						
					ИначеЕсли СтрокаЗапасы.Резерв > СтрокаЗапасы.Количество Тогда	
						
						ТекстСообщения = НСтр("ru='В строке №%1 табл. части ""Товары"" количество резервируемых позиций превышает общее количество запасов.';ka='В строке №%1 табл. части ""Товары"" количество резервируемых позиций превышает общее количество запасов.'");
						ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаЗапасы.НомерСтроки);
						УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
							ЭтотОбъект,
							ТекстСообщения,
							"Запасы",
							СтрокаЗапасы.НомерСтроки,
							"Резерв",
							Отказ
						);
						
					КонецЕсли;
					
				КонецЦикла;
				
				Для Каждого СтрокаЗапасы Из Материалы Цикл
					
					Если ЗаказНарядВСостоянииВыполнения
						И СтрокаЗапасы.РезервОтгрузка > СтрокаЗапасы.Количество Тогда
						
						ТекстСообщения = НСтр("ru='В строке №%1 табл. части ""Материалы"" количество списываемых позиций из резерва превышает общее количество запасов.';ka='В строке №%1 табл. части ""Материалы"" количество списываемых позиций из резерва превышает общее количество запасов.'");
						ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаЗапасы.НомерСтроки);
						УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
							ЭтотОбъект,
							ТекстСообщения,
							"Материалы",
							СтрокаЗапасы.НомерСтроки,
							"РезервОтгрузка",
							Отказ
						);
						
					ИначеЕсли СтрокаЗапасы.Резерв > СтрокаЗапасы.Количество Тогда
						
						ТекстСообщения = НСтр("ru='В строке №%1 табл. части ""Материалы"" количество резервируемых позиций превышает общее количество запасов.';ka='В строке №%1 табл. части ""Материалы"" количество резервируемых позиций превышает общее количество запасов.'");
						ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаЗапасы.НомерСтроки);
						УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
							ЭтотОбъект,
							ТекстСообщения,
							"Материалы",
							СтрокаЗапасы.НомерСтроки,
							"Резерв",
							Отказ
						);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			// Серийные номера
			Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктурнаяЕдиницаРезерв,"ОрдерныйСклад") = Истина Тогда
				РаботаССерийнымиНомерами.ПроверкаЗаполненияСерийныхНомеров(Отказ, Запасы, СерийныеНомера, СтруктурнаяЕдиницаРезерв, ЭтотОбъект);
				РаботаССерийнымиНомерами.ПроверкаЗаполненияСерийныхНомеров(Отказ, Материалы, СерийныеНомераМатериалы, СтруктурнаяЕдиницаРезерв, ЭтотОбъект, "КлючСвязиСерийныеНомера");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Скидка 100%.
	ЕстьРучныеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиНаценкиПродажи");
	ЕстьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки"); // АвтоматическиеСкидки
	Если ЕстьРучныеСкидки ИЛИ ЕстьАвтоматическиеСкидки Тогда
		Для каждого СтрокаЗапасы Из Запасы Цикл
			// АвтоматическиеСкидки
			ТекСумма = СтрокаЗапасы.Цена * СтрокаЗапасы.Количество;
			ТекСуммаРучнойСкидки = ?(ЕстьРучныеСкидки, ОКР(ТекСумма * СтрокаЗапасы.ПроцентСкидкиНаценки / 100, 2), 0);
			ТекСуммаАвтоматическойСкидки = ?(ЕстьАвтоматическиеСкидки, СтрокаЗапасы.СуммаАвтоматическойСкидки, 0);
			ТекСуммаСкидки = ТекСуммаРучнойСкидки + ТекСуммаАвтоматическойСкидки;
			Если СтрокаЗапасы.ПроцентСкидкиНаценки <> 100 И ТекСуммаСкидки < ТекСумма
				И НЕ ЗначениеЗаполнено(СтрокаЗапасы.Сумма) Тогда
				ТекстСообщения = НСтр("ru='Не заполнена колонка ""Сумма"" в строке %1 списка ""Товары, работы, услуги"".';ka='Не заполнена колонка ""Сумма"" в строке %1 списка ""Товары, работы, услуги"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаЗапасы.НомерСтроки);
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"Запасы",
					СтрокаЗапасы.НомерСтроки,
					"Сумма",
					Отказ
				);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ЕстьРучныеСкидки Тогда
		Для каждого СтрокаРаботы Из Работы Цикл
			// АвтоматическиеСкидки
			ТекСумма = СтрокаРаботы.Цена * СтрокаРаботы.Количество;
			ТекСуммаРучнойСкидки = ?(ЕстьРучныеСкидки, ОКР(ТекСумма * СтрокаРаботы.ПроцентСкидкиНаценки / 100, 2), 0);
			ТекСуммаАвтоматическойСкидки = ?(ЕстьАвтоматическиеСкидки, СтрокаРаботы.СуммаАвтоматическойСкидки, 0);
			ТекСуммаСкидки = ТекСуммаРучнойСкидки + ТекСуммаАвтоматическойСкидки;
			Если СтрокаРаботы.ПроцентСкидкиНаценки <> 100 И ТекСуммаСкидки < ТекСумма
				И НЕ ЗначениеЗаполнено(СтрокаРаботы.Сумма) Тогда
				ТекстСообщения = НСтр("ru='Не заполнена колонка ""Сумма"" в строке %1 списка ""Работы"".';ka='Не заполнена колонка ""Сумма"" в строке %1 списка ""Работы"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаРаботы.НомерСтроки);
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"Работы",
					СтрокаРаботы.НомерСтроки,
					"Сумма",
					Отказ
				);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Так же проверим заполнение начислений сотрудников
	Документы.ЗаказПокупателя.ЕстьИсполнителиСПустойСуммойНачисления(Исполнители);
	
	// Биллинг
	Если ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд
		И ПолучитьФункциональнуюОпцию("ИспользоватьБиллинг")
		И Договор.ЭтоДоговорОбслуживания Тогда
		
		Для Каждого Стр Из Работы Цикл
			Если НЕ УправлениеНебольшойФирмойСервер.РазрешенаПродажаНоменклатурыПоДоговоруОбслуживания(Договор, Стр.Номенклатура) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					НСтр("ka='მომსახურების მიმდინარე ხელშეკრულების მიხედვით დაუგეგმავი საქონლების/მომსახურებების გატარება აკრძალულია!';ru='Запрещено проводить незапланированные работы/услуги по текущему договору обслуживания!'"),
					Договор.ДоговорОбслуживанияТарифныйПлан,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Работы", Стр.НомерСтроки, "Номенклатура"),,
					Отказ
				);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Стр Из Запасы Цикл
			Если НЕ УправлениеНебольшойФирмойСервер.РазрешенаПродажаНоменклатурыПоДоговоруОбслуживания(Договор, Стр.Номенклатура, Стр.Характеристика) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					НСтр("ka='მომსახურების მიმდინარე ხელშეკრულების მიხედვით დაუგეგმავი საქონლის გატარება აკრძალულია!';ru='Запрещено проводить незапланированные товары по текущему договору обслуживания!'"),
					Договор.ДоговорОбслуживанияТарифныйПлан,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Работы", Стр.НомерСтроки, "Номенклатура"),,
					Отказ
				);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Доставка
	Если ДоставкаСервер.ИспользуетсяДоставка(СпособДоставки) Тогда
		ПроверяемыеРеквизиты.Добавить("НоменклатураДоставки");
		ПроверяемыеРеквизиты.Добавить("СлужбаДоставки");
	КонецЕсли; 
	// Конец Доставка
	
	Если Не СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Завершен
		И Не СостояниеЗаказа = Справочники.СостоянияЗаказНарядов.Завершен Тогда
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВариантЗавершения"));
	КонецЕсли;
	
	Если Не ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Отменен Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПричинаОтмены"));
	КонецЕсли;
	
	//++Lazare
	Если ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь") //+++ Дмгг
		И ЗапланироватьОплату 
			И ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу Тогда
		СуммаЗапасов			= Запасы.Итог("Всего");
		СуммаПлатежныйКалендарь = ПлатежныйКалендарь.Итог("СуммаОплаты");
		Если СуммаЗапасов <> СуммаПлатежныйКалендарь Тогда
			ТекстСообщения = "ცხრილურ ნაწილში ""საქონელი, მომსახურება"" და ""გადახდების კალენდარი"" თანხები არ ემთხვევა. გადასახდელია: " +
							 + СуммаЗапасов + " კალენდრის თანხაა: " + СуммаПлатежныйКалендарь;
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	//--Lazare
	
	//_Lazare
	Если  ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ПустаяСсылка()  Тогда  
		ПоложениеСклада  = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке ;
	КонецЕсли;
	Если ПоложениеСклада  = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке  Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Запасы.СтруктурнаяЕдиницаЗапасы");
	КонецЕсли;
	//Lazare_

	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтавкуНДСЧислом(СтавкаНДС)
	
		Возврат СтавкаНДС.Ставка;
		
Конецфункции

&НаКлиенте
Функция ПолучитьНаКлиенте(Ответ)
	
	
    
КонецФункции

#КонецОбласти

#Область ПроцедурыЗаполненияДокумента

Процедура ОбработчикЗаполнения(ДанныеЗаполнения) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ЗначениеСсылочногоТипа(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяТабличнойЧасти(ДанныеЗаполнения)) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = ЗапросДанныхДляЗаполнения(ДанныеЗаполнения).Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаШапка = РезультатЗапроса.Выбрать();
	ВыборкаШапка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
	
	Если ВалютаДокумента <> Константы.НациональнаяВалюта.Получить() Тогда
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Договор.ВалютаРасчетов));
		Курс = СтруктураПоВалюте.Курс;
		Кратность = СтруктураПоВалюте.Кратность;
	КонецЕсли;
	
	ЭтотОбъект.Запасы.Очистить();
	ВыборкаТабличнаяЧасть = ВыборкаШапка[ИмяТабличнойЧасти(ДанныеЗаполнения)].Выбрать();
	Пока ВыборкаТабличнаяЧасть.Следующий() Цикл
		НовСтр = ЭтотОбъект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаТабличнаяЧасть);
		НовСтр.ТипНоменклатурыЗапас = (ВыборкаТабличнаяЧасть.НоменклатураТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
	КонецЦикла;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки") Тогда
		ВыборкаСкидкиНаценки = ВыборкаШапка.СкидкиНаценки.Выбрать();
		Пока ВыборкаСкидкиНаценки.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ЭтотОбъект.СкидкиНаценки.Добавить(), ВыборкаСкидкиНаценки);
		КонецЦикла;
	КонецЕсли;
	
	СуммаОплаты = Запасы.Итог("Всего");
	
КонецПроцедуры

Процедура ЗаполнитьПоПриемуВРемонт(ДокументСсылкаПриемВРемонт) Экспорт
	
	// Заполнение шапки документа.
	ЭтотОбъект.ДокументОснование = ДокументСсылкаПриемВРемонт.Ссылка;
	ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд;
	
	Организация = ДокументСсылкаПриемВРемонт.Организация;
	Контрагент = ДокументСсылкаПриемВРемонт.Контрагент;
	Договор = ДокументСсылкаПриемВРемонт.Договор;
	
	ВидЦен = Договор.ВидЦен;
	ВидСкидкиНаценки = Договор.ВидСкидкиНаценки;
	ВалютаДокумента = Договор.ВалютаРасчетов;
	СуммаВключаетНДС = ?(ЗначениеЗаполнено(Договор.ВидЦен), Договор.ВидЦен.ЦенаВключаетНДС, Неопределено);
	НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Организация,, Дата);
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Договор.ВалютаРасчетов));
	Курс = СтруктураПоВалюте.Курс;
	Кратность = СтруктураПоВалюте.Кратность;
	
КонецПроцедуры

Функция ЗапросДанныхДляЗаполнения(ДанныеЗаполнения)
	
	Конструктор = Новый СхемаЗапроса;
	Пакет = Конструктор.ПакетЗапросов[0];
	Пакет.ВыбиратьРазрешенные = Истина;
	Оператор0 = Пакет.Операторы[0];
	Оператор0.Источники.Добавить(ДанныеЗаполнения.Метаданные().ПолноеИмя());
	Для Каждого ОписаниеПоляШапки Из ОписаниеПолейШапки(ДанныеЗаполнения) Цикл
		Оператор0.ВыбираемыеПоля.Добавить(ОписаниеПоляШапки.Ключ);
		Если ЗначениеЗаполнено(ОписаниеПоляШапки.Значение) Тогда
			Пакет.Колонки[Пакет.Колонки.Количество() - 1].Псевдоним = ОписаниеПоляШапки.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекОписаниеПоляТабличнойЧастиЗапасы Из ОписаниеПолейТабличнойЧастиЗапасы(ДанныеЗаполнения) Цикл
		Оператор0.ВыбираемыеПоля.Добавить(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1.%2",
		ИмяТабличнойЧасти(ДанныеЗаполнения),
		ТекОписаниеПоляТабличнойЧастиЗапасы.Ключ));
		Если ЗначениеЗаполнено(ТекОписаниеПоляТабличнойЧастиЗапасы.Значение) Тогда
			Пакет.Колонки[Пакет.Колонки.Количество() - 1].Псевдоним = ТекОписаниеПоляТабличнойЧастиЗапасы.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки") Тогда
		Оператор0.ВыбираемыеПоля.Добавить("СкидкиНаценки.КлючСвязи");
		Оператор0.ВыбираемыеПоля.Добавить("СкидкиНаценки.СкидкаНаценка");
		Оператор0.ВыбираемыеПоля.Добавить("СкидкиНаценки.Сумма");
	КонецЕсли;
	
	Оператор0.Отбор.Добавить("Ссылка = &Параметр");
	
	Результат = Новый Запрос(Конструктор.ПолучитьТекстЗапроса());
	Результат.УстановитьПараметр("Параметр", ДанныеЗаполнения);
	
	Возврат Результат;
	
КонецФункции

Функция ИмяТабличнойЧасти(ДанныеЗаполнения)
	
	ИменаТабличныхЧастей = Новый Соответствие;
	ИменаТабличныхЧастей[Тип("ДокументСсылка.СчетНаОплату")] = "Запасы";
	
	Возврат ИменаТабличныхЧастей[ТипЗнч(ДанныеЗаполнения)];
	
КонецФункции

Функция ОписаниеПолейШапки(ДанныеЗаполнения)
	
	Результат = Новый Соответствие;
	
	ДанныеЗаполненияМетаданные = ДанныеЗаполнения.Метаданные();
	
	Результат.Вставить("Ссылка", "ДокументОснование");
	Результат.Вставить("Организация");
	Результат.Вставить("Организация.БанковскийСчетПоУмолчанию", "БанковскийСчет");
	
	ДобавитьРеквизитЕслиОнЕстьВДокументе(Результат, ДанныеЗаполненияМетаданные, "ДисконтнаяКарта");
	ДобавитьРеквизитЕслиОнЕстьВДокументе(Результат, ДанныеЗаполненияМетаданные, "УсловияСчетаЗаказа");
	ДобавитьРеквизитЕслиОнЕстьВДокументе(Результат, ДанныеЗаполненияМетаданные, "ПроцентСкидкиПоДисконтнойКарте");
	ДобавитьРеквизитЕслиОнЕстьВДокументе(Результат, ДанныеЗаполненияМетаданные, "Курс");
	ДобавитьРеквизитЕслиОнЕстьВДокументе(Результат, ДанныеЗаполненияМетаданные, "Кратность");
	ДобавитьРеквизитЕслиОнЕстьВДокументе(Результат, ДанныеЗаполненияМетаданные, "СуммаВключаетНДС");
	ДобавитьРеквизитЕслиОнЕстьВДокументе(Результат, ДанныеЗаполненияМетаданные, "НалогообложениеНДС");
	ДобавитьРеквизитЕслиОнЕстьВДокументе(Результат, ДанныеЗаполненияМетаданные, "Договор");
	ДобавитьРеквизитЕслиОнЕстьВДокументе(Результат, ДанныеЗаполненияМетаданные, "Контрагент");
	ДобавитьРеквизитЕслиОнЕстьВДокументе(Результат, ДанныеЗаполненияМетаданные, "ВалютаДокумента");
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки") Тогда
		Результат.Вставить("СкидкиРассчитаны");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьРеквизитЕслиОнЕстьВДокументе(РезультатСоответствие, ДанныеЗаполненияМетаданные, ИмяРеквизита)
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяРеквизита, ДанныеЗаполненияМетаданные) Тогда
		РезультатСоответствие.Вставить(ИмяРеквизита);
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеПолейТабличнойЧастиЗапасы(ДанныеЗаполнения)
	
	Результат = Новый Соответствие;
	Результат.Вставить("Номенклатура");
	Результат.Вставить("Номенклатура.ТипНоменклатуры");
	Результат.Вставить("Характеристика");
	Результат.Вставить("Содержание");
	Результат.Вставить("ЕдиницаИзмерения");
	Результат.Вставить("Количество");
	Результат.Вставить("Цена");
	Результат.Вставить("ПроцентСкидкиНаценки");
	Результат.Вставить("Сумма");
	Результат.Вставить("СтавкаНДС");
	Результат.Вставить("СуммаНДС");
	Результат.Вставить("Всего");
	Если ИмяТабличнойЧасти(ДанныеЗаполнения) <> "РаботыИУслуги" Тогда
		Результат.Вставить("Партия");
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки") Тогда
		Результат.Вставить("КлючСвязи");
		Результат.Вставить("СуммаАвтоматическойСкидки");
		Результат.Вставить("ПроцентАвтоматическойСкидки");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьТабличнуюЧастьИсполнителиПоРесурсам(ИсполнителиКлючСвязи) Экспорт
	
	МассивСотрудников	= Новый Массив();
	МассивБригад 		= Новый Массив();
	Для каждого СтрокаТЧ Из РесурсыПредприятия Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЧ.РесурсПредприятия) Тогда
			
			ЗначениеРесурса = СтрокаТЧ.РесурсПредприятия.ЗначениеРесурса;
			Если ТипЗнч(ЗначениеРесурса) = Тип("СправочникСсылка.Сотрудники") Тогда
				
				МассивСотрудников.Добавить(ЗначениеРесурса);
				
			ИначеЕсли ТипЗнч(ЗначениеРесурса) = Тип("СправочникСсылка.Бригады") Тогда
				
				МассивБригад.Добавить(ЗначениеРесурса);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСотрудников.Сотрудник КАК Сотрудник,
	|	ТаблицаСотрудников.Наименование КАК Наименование,
	|	ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания КАК ВидНачисленияУдержания
	|ПОМЕСТИТЬ ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний
	|ИЗ
	|	(ВЫБРАТЬ
	|		Сотрудники.Ссылка КАК Сотрудник,
	|		Сотрудники.Наименование КАК Наименование
	|	ИЗ
	|		Справочник.Сотрудники КАК Сотрудники
	|	ГДЕ
	|		Сотрудники.Ссылка В(&МассивСотрудников)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Сотрудники.Ссылка,
	|		Сотрудники.Наименование
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		БригадыСостав.Сотрудник,
	|		БригадыСостав.Сотрудник.Наименование
	|	ИЗ
	|		Справочник.Бригады.Состав КАК БригадыСостав
	|	ГДЕ
	|		БригадыСостав.Ссылка В(&МассивБригад)) КАК ТаблицаСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(
	|				&НаДату,
	|				Организация = &Организация
	|					И Актуальность
	|					И ВидНачисленияУдержания В (ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата), ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент), ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ФиксированнаяСумма))) КАК ПлановыеНачисленияИУдержанияСрезПоследних
	|		ПО ТаблицаСотрудников.Сотрудник = ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний.Наименование КАК Наименование,
	|	ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	1 КАК КТУ,
	|	ПлановыеНачисленияИУдержанияСрезПоследних.Сумма * КурсВалютыНачисления.Курс * КурсВалютыДокумента.Кратность / (КурсВалютыДокумента.Курс * КурсВалютыНачисления.Кратность) КАК РазмерНачисленияУдержания
	|ИЗ
	|	ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний КАК ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(
	|				&НаДату,
	|				Организация = &Организация
	|					И Актуальность) КАК ПлановыеНачисленияИУдержанияСрезПоследних
	|		ПО ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний.Сотрудник = ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник
	|			И ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний.ВидНачисленияУдержания = ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, ) КАК КурсВалютыНачисления
	|		ПО (ПлановыеНачисленияИУдержанияСрезПоследних.Валюта = КурсВалютыНачисления.Валюта),
	|	РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, Валюта = &ВалютаДокумента) КАК КурсВалютыДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВалютаДокумента", ВалютаДокумента);
	Запрос.УстановитьПараметр("МассивБригад", МассивБригад);
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаСотрудников = МассивРезультатов[1].Выгрузить();
	
	Если ИсполнителиКлючСвязи = Неопределено Тогда
		
		Для каждого СтрокаТабличнойЧасти Из Работы Цикл
			
			Если СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
				
				Для каждого СтрокаТЧ Из ТаблицаСотрудников Цикл
					
					НоваяСтрока = Исполнители.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
					НоваяСтрока.КлючСвязи = СтрокаТабличнойЧасти.КлючСвязи;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для каждого СтрокаТЧ Из ТаблицаСотрудников Цикл
			
			НоваяСтрока = Исполнители.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.КлючСвязи = ИсполнителиКлючСвязи;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьИсполнителиПоБригадам(МассивБригад, ИсполнителиКлючСвязи) Экспорт
	
	
	МассивСотрудников = Новый Массив();
	
	Для Каждого стр Из МассивБригад Цикл 
		
		
		Для  Каждого стр Из  стр.Состав Цикл 
			
			МассивСотрудников.Добавить(стр.Сотрудник);
			
		КонецЦикла;
		
	КонецЦикла;
	

	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БригадыСостав.Сотрудник КАК Сотрудник,
	|	БригадыСостав.Сотрудник.Наименование КАК Наименование,
	|	ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания КАК ВидНачисленияУдержания
	|ПОМЕСТИТЬ ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний
	|ИЗ
	|	Справочник.Бригады.Состав КАК БригадыСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(
	|				&НаДату,
	|				Организация = &Организация
	|					И Актуальность
	|					И ВидНачисленияУдержания В (ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата), ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент), ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ФиксированнаяСумма))) КАК ПлановыеНачисленияИУдержанияСрезПоследних
	|		ПО БригадыСостав.Сотрудник = ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник
	|ГДЕ
	|	БригадыСостав.Ссылка В(&МассивБригад)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний.Наименование КАК Наименование,
	|	ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	1 КАК КТУ,
	|	ПлановыеНачисленияИУдержанияСрезПоследних.Сумма * КурсВалютыНачисления.Курс * КурсВалютыДокумента.Кратность / (КурсВалютыДокумента.Курс * КурсВалютыНачисления.Кратность) КАК РазмерНачисленияУдержания
	|ИЗ
	|	ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний КАК ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(
	|				&НаДату,
	|				Организация = &Организация
	|					И Актуальность) КАК ПлановыеНачисленияИУдержанияСрезПоследних
	|		ПО ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний.Сотрудник = ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник
	|			И ВременнаяТаблицаСотрудникиИВидыНачисленийУдержаний.ВидНачисленияУдержания = ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, ) КАК КурсВалютыНачисления
	|		ПО (ПлановыеНачисленияИУдержанияСрезПоследних.Валюта = КурсВалютыНачисления.Валюта),
	|	РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, Валюта = &ВалютаДокумента) КАК КурсВалютыДокумента
	//Rajak
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиСрезПоследних.ВидУдержанияНДФЛ,
	|	СотрудникиСрезПоследних.ВидУдержанияПФ
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			&НаДату,
	|			Организация = &Организация
	|				И Сотрудник В(&МассивСотрудников)) КАК СотрудникиСрезПоследних
	//Rajak	
	|";
	
	//|УПОРЯДОЧИТЬ ПО
	//|	Наименование";
	
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВалютаДокумента", ВалютаДокумента);
	Запрос.УстановитьПараметр("МассивБригад", МассивБригад);
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
		
	//МассивБригад[0].Состав[0].Сотрудник
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаСотрудников = МассивРезультатов[1].Выгрузить();
	
	
	//Паганини ПФ_
	ТаблицаУдержании = МассивРезультатов[2].Выгрузить();
	//Если ТаблицаУдержании.Количество() = 0 Тогда
	//	СтруктураДанные.Вставить("ВидУдержанияНДФЛ", 	Неопределено);
	//	СтруктураДанные.Вставить("ВидУдержанияПФ", 		Неопределено);
	//Иначе
	//	СтруктураДанные.Вставить("ВидУдержанияНДФЛ", 	ТаблицаУдержании[0].ВидУдержанияНДФЛ);
	//	СтруктураДанные.Вставить("ВидУдержанияПФ", 		ТаблицаУдержании[0].ВидУдержанияПФ);
	//КонецЕсли;
	//_Паганини ПФ	

	
	Если ИсполнителиКлючСвязи = Неопределено Тогда
		
		Для каждого СтрокаТабличнойЧасти Из Работы Цикл
			
			Если СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
				
				Для каждого СтрокаТЧ Из ТаблицаСотрудников Цикл
					
					НоваяСтрока = Исполнители.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
					НоваяСтрока.КлючСвязи = СтрокаТабличнойЧасти.КлючСвязи;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для каждого СтрокаТЧ Из ТаблицаСотрудников Цикл				
			
			
			НоваяСтрока = Исполнители.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.КлючСвязи = ИсполнителиКлючСвязи;
			
			Для Каждого стрУд Из ТаблицаУдержании Цикл 
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрУд);	
				
			КонецЦикла;
			
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКолонкуРезервПоОстаткам(ПараметрыОтбора = Неопределено) Экспорт
	
	Если ПараметрыОтбора = Неопределено Тогда
		ПараметрыОтбора = Новый Структура;
	КонецЕсли;
	ПараметрыОтбора.Вставить("ЭтоРазделитель", Ложь);
	
	Строки = Запасы.НайтиСтроки(ПараметрыОтбора);
	Для каждого Строка Из Строки Цикл
		Строка.Резерв = 0;
	КонецЦикла;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	&ТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ТипНоменклатурыЗапас";
	
	Запрос.УстановитьПараметр("ТаблицаЗапасы", Запасы.Выгрузить(ПараметрыОтбора));
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,//+++ Дмгг
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОстатки.Организация КАК Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|		ЗапасыОстатки.Характеристика КАК Характеристика,
	|		ЗапасыОстатки.Партия КАК Партия,
	|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				&Период,
	//|				
	//|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг	
	|				(Организация, СтруктурнаяЕдиница, СчетУчета, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|					(ВЫБРАТЬ
	|						&Организация,
	|						&СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасов,
	|						ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасовРегл, //+++ Дмгг
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗапасы.Организация,
	|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	|		ДвиженияДокументаЗапасы.СчетУчета,
	|		ДвиженияДокументаЗапасы.СчетУчетаРегл, //+++ Дмгг
	|		ДвиженияДокументаЗапасы.Номенклатура,
	|		ДвиженияДокументаЗапасы.Характеристика,
	|		ДвиженияДокументаЗапасы.Партия,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|	ГДЕ
	|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|		И ДвиженияДокументаЗапасы.Период <= &Период
	|		И ДвиженияДокументаЗапасы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		И ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл, //+++ Дмгг
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиницаРезерв);
	
	ТаблицаПериодов = Новый ТаблицаЗначений();
	ТаблицаПериодов.Колонки.Добавить("ДатаОтгрузки");
	ТаблицаПериодов.Колонки.Добавить("СтрокаЗапасы");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДляПоиска = Новый Структура;
		СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
		СтруктураДляПоиска.Вставить("Партия", Выборка.Партия);
		
		Для каждого КлючИЗначение Из ПараметрыОтбора Цикл
			Если СтруктураДляПоиска.Свойство(КлючИЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			СтруктураДляПоиска.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		
		МассивСтрокЗапасы = Запасы.НайтиСтроки(СтруктураДляПоиска);
		Для каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			НоваяСтрока = ТаблицаПериодов.Добавить();
			НоваяСтрока.ДатаОтгрузки = СтрокаЗапасы.ДатаОтгрузки;
			НоваяСтрока.СтрокаЗапасы = СтрокаЗапасы;
		КонецЦикла;
		
		ВсегоОстаток = Выборка.КоличествоОстаток;
		ТаблицаПериодов.Сортировать("ДатаОтгрузки");
		Для каждого СтрокаТаблицыПериодов Из ТаблицаПериодов Цикл
			СтрокаЗапасы = СтрокаТаблицыПериодов.СтрокаЗапасы;
			ВсегоОстаток = ?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения"), ВсегоОстаток, ВсегоОстаток / СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент);
			Если СтрокаЗапасы.Количество >= ВсегоОстаток Тогда
				СтрокаЗапасы.Резерв = ВсегоОстаток;
				ВсегоОстаток = 0;
			Иначе
				СтрокаЗапасы.Резерв = СтрокаЗапасы.Количество;
				ВсегоОстаток = ВсегоОстаток - СтрокаЗапасы.Количество;
				ВсегоОстаток = ?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения"), ВсегоОстаток, ВсегоОстаток * СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент);
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаПериодов.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ТоварыЗаполнитьКолонкуРезервПоОстаткам() Экспорт
	
	Запасы.ЗагрузитьКолонку(Новый Массив(Запасы.Количество()), "Резерв");
	Запасы.ЗагрузитьКолонку(Новый Массив(Запасы.Количество()), "РезервОтгрузка");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	&ТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ТипНоменклатурыЗапас";
	
	Запрос.УстановитьПараметр("ТаблицаЗапасы", Запасы.Выгрузить());
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОстатки.Организация КАК Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|		ЗапасыОстатки.Характеристика КАК Характеристика,
	|		ЗапасыОстатки.Партия КАК Партия,
	|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|				(Организация, СтруктурнаяЕдиница, СчетУчета, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|					(ВЫБРАТЬ
	|						&Организация,
	|						&СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасов, 
	|						ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасовРегл, //+++ Дмгг
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗапасы.Организация,
	|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	|		ДвиженияДокументаЗапасы.СчетУчета,
	|		ДвиженияДокументаЗапасы.СчетУчетаРегл, //+++ Дмгг
	|		ДвиженияДокументаЗапасы.Номенклатура,
	|		ДвиженияДокументаЗапасы.Характеристика,
	|		ДвиженияДокументаЗапасы.Партия,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|	ГДЕ
	|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|		И ДвиженияДокументаЗапасы.Период <= &Период
	|		И ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл, //+++ Дмгг
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия";
	
	Запрос.УстановитьПараметр("Период", Финиш);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиницаРезерв);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДляПоиска = Новый Структура;
		СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
		СтруктураДляПоиска.Вставить("Партия", Выборка.Партия);
		
		ВсегоОстаток = Выборка.КоличествоОстаток;
		МассивСтрокЗапасы = Запасы.НайтиСтроки(СтруктураДляПоиска);
		Для каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			ВсегоОстаток = ?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения"), ВсегоОстаток, ВсегоОстаток / СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент);
			Если СтрокаЗапасы.Количество >= ВсегоОстаток Тогда
				СтрокаЗапасы.Резерв = ВсегоОстаток;
				СтрокаЗапасы.РезервОтгрузка = СтрокаЗапасы.Резерв;
				ВсегоОстаток = 0;
			Иначе
				СтрокаЗапасы.Резерв = СтрокаЗапасы.Количество;
				СтрокаЗапасы.РезервОтгрузка = СтрокаЗапасы.Резерв;
				ВсегоОстаток = ВсегоОстаток - СтрокаЗапасы.Количество;
				ВсегоОстаток = ?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения"), ВсегоОстаток, ВсегоОстаток * СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ТоварыЗаполнитьКолонкуРезервПоРезервам() Экспорт
	
	Запасы.ЗагрузитьКолонку(Новый Массив(Запасы.Количество()), "РезервОтгрузка");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	&Заказ КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	&ТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ТипНоменклатурыЗапас";
	
	Запрос.УстановитьПараметр("ТаблицаЗапасы", Запасы.Выгрузить());
	Запрос.УстановитьПараметр("Заказ", Ссылка);
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОстатки.Организация КАК Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	|		ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|		ЗапасыОстатки.Характеристика КАК Характеристика,
	|		ЗапасыОстатки.Партия КАК Партия,
	|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|				(Организация, СтруктурнаяЕдиница, СчетУчета, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|					(ВЫБРАТЬ
	|						&Организация,
	|						&СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасов,
	|						ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасовРегл, //+++ Дмгг
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ТаблицаЗапасы.ЗаказПокупателя
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|					ГДЕ
	|						ТаблицаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))) КАК ЗапасыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗапасы.Организация,
	|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	|		ДвиженияДокументаЗапасы.СчетУчета,
	|		ДвиженияДокументаЗапасы.СчетУчетаРегл, //+++ Дмгг
	|		ДвиженияДокументаЗапасы.ЗаказПокупателя,
	|		ДвиженияДокументаЗапасы.Номенклатура,
	|		ДвиженияДокументаЗапасы.Характеристика,
	|		ДвиженияДокументаЗапасы.Партия,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|	ГДЕ
	|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|		И ДвиженияДокументаЗапасы.Период <= &Период
	|		И ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ДвиженияДокументаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл, //+++ Дмгг
	|	ЗапасыОстатки.ЗаказПокупателя,
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия";
	
	Запрос.УстановитьПараметр("Период", Финиш);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиницаРезерв);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДляПоиска = Новый Структура;
		СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
		СтруктураДляПоиска.Вставить("Партия", Выборка.Партия);
		
		ВсегоОстаток = Выборка.КоличествоОстаток;
		МассивСтрокЗапасы = Запасы.НайтиСтроки(СтруктураДляПоиска);
		Для каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			
			ВсегоОстаток = ?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения"), ВсегоОстаток, ВсегоОстаток / СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент);
			Если СтрокаЗапасы.Количество >= ВсегоОстаток Тогда
				
				СтрокаЗапасы.РезервОтгрузка = ВсегоОстаток;
				ВсегоОстаток = 0;
				
			Иначе
				
				СтрокаЗапасы.РезервОтгрузка = СтрокаЗапасы.Количество;
				ВсегоОстаток = ВсегоОстаток - СтрокаЗапасы.Количество;
				ВсегоОстаток = ?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения"), ВсегоОстаток, ВсегоОстаток * СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого СтрокаТабличнойЧасти Из Запасы Цикл
		Если СтрокаТабличнойЧасти.РезервОтгрузка < СтрокаТабличнойЧасти.Резерв Тогда
			СтрокаТабличнойЧасти.Резерв = СтрокаТабличнойЧасти.РезервОтгрузка;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура МатериалыЗаполнитьКолонкуРезервПоОстаткам(МатериалыКлючСвязи) Экспорт
	
	Если МатериалыКлючСвязи = Неопределено Тогда
		Материалы.ЗагрузитьКолонку(Новый Массив(Материалы.Количество()), "Резерв");
		Материалы.ЗагрузитьКолонку(Новый Массив(Материалы.Количество()), "РезервОтгрузка");
	Иначе
		РезультатПоиска = Материалы.НайтиСтроки(Новый Структура("КлючСвязи", МатериалыКлючСвязи));
		Для каждого СтрокаТабличнойЧасти Из РезультатПоиска Цикл
			СтрокаТабличнойЧасти.Резерв = 0;
			СтрокаТабличнойЧасти.РезервОтгрузка = 0;
		КонецЦикла;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
		Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	&ТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборПоКлючуСвязи
	|				ТОГДА ТаблицаЗапасы.КлючСвязи = &КлючСвязи
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТаблицаЗапасы", Материалы.Выгрузить());
	Запрос.УстановитьПараметр("ОтборПоКлючуСвязи", ?(МатериалыКлючСвязи = Неопределено, Ложь, Истина));
	Запрос.УстановитьПараметр("КлючСвязи", МатериалыКлючСвязи);
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОстатки.Организация КАК Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|		ЗапасыОстатки.СчетУчета КАК СчетУчетаРегл, //+++ Дмгг
	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|		ЗапасыОстатки.Характеристика КАК Характеристика,
	|		ЗапасыОстатки.Партия КАК Партия,
	|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|				(Организация, СтруктурнаяЕдиница, СчетУчета, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|					(ВЫБРАТЬ
	|						&Организация,
	|						&СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасов,
	|						ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасовРегл, //+++ Дмгг
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗапасы.Организация,
	|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	|		ДвиженияДокументаЗапасы.СчетУчета,
	|		ДвиженияДокументаЗапасы.СчетУчетаРегл, //+++ Дмгг
	|		ДвиженияДокументаЗапасы.Номенклатура,
	|		ДвиженияДокументаЗапасы.Характеристика,
	|		ДвиженияДокументаЗапасы.Партия,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|	ГДЕ
	|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|		И ДвиженияДокументаЗапасы.Период <= &Период
	|		И ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл, //+++ Дмгг
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиницаРезерв);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДляПоиска = Новый Структура;
		Если МатериалыКлючСвязи <> Неопределено Тогда
			СтруктураДляПоиска.Вставить("КлючСвязи", МатериалыКлючСвязи);
		КонецЕсли;
		СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
		СтруктураДляПоиска.Вставить("Партия", Выборка.Партия);
		
		ВсегоОстаток = Выборка.КоличествоОстаток;
		МассивСтрокЗапасы = Материалы.НайтиСтроки(СтруктураДляПоиска);
		Для каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			ВсегоОстаток = ?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения"), ВсегоОстаток, ВсегоОстаток / СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент);
			Если СтрокаЗапасы.Количество >= ВсегоОстаток Тогда
				СтрокаЗапасы.Резерв = ВсегоОстаток;
				СтрокаЗапасы.РезервОтгрузка = СтрокаЗапасы.Резерв;
				ВсегоОстаток = 0;
			Иначе
				СтрокаЗапасы.Резерв = СтрокаЗапасы.Количество;
				СтрокаЗапасы.РезервОтгрузка = СтрокаЗапасы.Резерв;
				ВсегоОстаток = ВсегоОстаток - СтрокаЗапасы.Количество;
				ВсегоОстаток = ?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения"), ВсегоОстаток, ВсегоОстаток * СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура МатериалыЗаполнитьКолонкуРезервПоРезервам(МатериалыКлючСвязи) Экспорт
	
	Если МатериалыКлючСвязи = Неопределено Тогда
		Материалы.ЗагрузитьКолонку(Новый Массив(Материалы.Количество()), "РезервОтгрузка");
	Иначе
		РезультатПоиска = Материалы.НайтиСтроки(Новый Структура("КлючСвязи", МатериалыКлючСвязи));
		Для каждого СтрокаТабличнойЧасти Из РезультатПоиска Цикл
			СтрокаТабличнойЧасти.РезервОтгрузка = 0;
		КонецЦикла;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	&Заказ КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	&ТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборПоКлючуСвязи
	|				ТОГДА ТаблицаЗапасы.КлючСвязи = &КлючСвязи
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТаблицаЗапасы", Материалы.Выгрузить());
	Запрос.УстановитьПараметр("ОтборПоКлючуСвязи", ?(МатериалыКлючСвязи = Неопределено, Ложь, Истина));
	Запрос.УстановитьПараметр("КлючСвязи", МатериалыКлючСвязи);
	Запрос.УстановитьПараметр("Заказ", Ссылка);
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл, //+++ Дмгг
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОстатки.Организация КАК Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	|		ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|		ЗапасыОстатки.Характеристика КАК Характеристика,
	|		ЗапасыОстатки.Партия КАК Партия,
	|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В  //+++ Дмгг
	|				(Организация, СтруктурнаяЕдиница, СчетУчета, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В  //+++ Дмгг
	|					(ВЫБРАТЬ
	|						&Организация,
	|						&СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасов,
	|						ТаблицаЗапасы.Номенклатура.СчетУчетаЗапасовРегл, //+++ Дмгг
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ТаблицаЗапасы.ЗаказПокупателя
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|					ГДЕ
	|						ТаблицаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))) КАК ЗапасыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗапасы.Организация,
	|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	|		ДвиженияДокументаЗапасы.СчетУчета,
	|		ДвиженияДокументаЗапасы.СчетУчетаРегл, //+++ Дмгг
	|		ДвиженияДокументаЗапасы.ЗаказПокупателя,
	|		ДвиженияДокументаЗапасы.Номенклатура,
	|		ДвиженияДокументаЗапасы.Характеристика,
	|		ДвиженияДокументаЗапасы.Партия,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|	ГДЕ
	|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|		И ДвиженияДокументаЗапасы.Период <= &Период
	|		И ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ДвиженияДокументаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл, //+++ Дмгг
	|	ЗапасыОстатки.ЗаказПокупателя,
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия";
	
	Запрос.УстановитьПараметр("Период", Финиш);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиницаРезерв);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДляПоиска = Новый Структура;
		Если МатериалыКлючСвязи <> Неопределено Тогда
			СтруктураДляПоиска.Вставить("КлючСвязи", МатериалыКлючСвязи);
		КонецЕсли;
		СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
		СтруктураДляПоиска.Вставить("Партия", Выборка.Партия);
		
		ВсегоОстаток = Выборка.КоличествоОстаток;
		МассивСтрокЗапасы = Материалы.НайтиСтроки(СтруктураДляПоиска);
		Для каждого СтрокаЗапасы Из МассивСтрокЗапасы Цикл
			
			ВсегоОстаток = ?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения"), ВсегоОстаток, ВсегоОстаток / СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент);
			Если СтрокаЗапасы.Количество >= ВсегоОстаток Тогда
				
				СтрокаЗапасы.РезервОтгрузка = ВсегоОстаток;
				ВсегоОстаток = 0;
				
			Иначе
				
				СтрокаЗапасы.РезервОтгрузка = СтрокаЗапасы.Количество;
				ВсегоОстаток = ВсегоОстаток - СтрокаЗапасы.Количество;
				ВсегоОстаток = ?(ТипЗнч(СтрокаЗапасы.ЕдиницаИзмерения) = ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения"), ВсегоОстаток, ВсегоОстаток * СтрокаЗапасы.ЕдиницаИзмерения.Коэффициент);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если МатериалыКлючСвязи = Неопределено Тогда
		Для каждого СтрокаТабличнойЧасти Из Материалы Цикл
			Если СтрокаТабличнойЧасти.РезервОтгрузка < СтрокаТабличнойЧасти.Резерв Тогда
				СтрокаТабличнойЧасти.Резерв = СтрокаТабличнойЧасти.РезервОтгрузка;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого СтрокаТабличнойЧасти Из РезультатПоиска Цикл
			Если СтрокаТабличнойЧасти.РезервОтгрузка < СтрокаТабличнойЧасти.Резерв Тогда
				СтрокаТабличнойЧасти.Резерв = СтрокаТабличнойЧасти.РезервОтгрузка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
	Если ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		
		Если Не ЗначениеЗаполнено(ВидЗаказа) Тогда
			
			ВидЗаказа = ЗаполнениеОбъектовУНФ.ПолучитьВидЗаказНаряда();
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СостояниеЗаказа) Тогда
			
			СостояниеЗаказа = ЗаполнениеОбъектовУНФ.ПолучитьСостояниеЗаказНаряда(ВидЗаказа);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктурнаяЕдиницаРезерв) Тогда
			
			ПодписьКладовщика = СтруктурнаяЕдиницаРезерв.ПодписьМОЛ;
			
		КонецЕсли;
		
	Иначе // Заказ покупателя
		
		Если Не ЗначениеЗаполнено(ВидЗаказа) Тогда
			
			ВидЗаказа = ЗаполнениеОбъектовУНФ.ПолучитьВидЗаказаПокупателя();
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СостояниеЗаказа) Тогда
			
			СостояниеЗаказа = ЗаполнениеОбъектовУНФ.ПолучитьСостояниеЗаказаПокупателя(ВидЗаказа);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура отмены проведения у подченненой счет фактуры
//
Процедура КонтрольПодчиненнойСчетФактуры()
	
	СтруктураСчетаФактуры = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйСчетФактуру(Ссылка);
	Если СтруктураСчетаФактуры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СчетФактура	 = СтруктураСчетаФактуры.Ссылка;
	Если Не СчетФактура.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ka='მოძრაობების არარსებობის გამო დოკუმენტ %ПредставлениеТекущегоДокумента%-ს გაუტარდება ანგარიშფაქტურა %ПредставлениеСчетФактуры%.';ru='В связи с отсутствием движений у документа %ПредставлениеТекущегоДокумента% распроводится счет фактура %ПредставлениеСчетФактуры%.';en='Due to the lack of movement in the document% PredstavlenieTekuschegoDokumenta% rasprovoditsya invoice% PredstavlenieSchetFaktury%.'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеТекущегоДокумента%", """Заказ-наряд  № " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy") + """");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеСчетФактуры%", """Счет фактура (выданная) № " + СтруктураСчетаФактуры.Номер + " от " + СтруктураСчетаФактуры.Дата + """");
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
	СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
	СчетФактураОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры

Процедура ПривестиДанныеКСогласованномуСостоянию()
	
	Если СостояниеЗаказа <> Справочники.СостоянияЗаказовПокупателей.Завершен 
		И СостояниеЗаказа <> Справочники.СостоянияЗаказНарядов.Завершен Тогда
		
		ЭтотОбъект.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.ПустаяСсылка();
	КонецЕсли;
	
	Если ВариантЗавершения <> Перечисления.ВариантыЗавершенияЗаказа.Отменен Тогда
		ЭтотОбъект.ПричинаОтмены	= Справочники.ПричиныОтменыЗаказа.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьСуммуДокумента()
	
	СуммаДокумента = 0;
	
	Если ОжидаетсяВыборВариантаКП Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Стр Из Запасы Цикл
		Если Стр.ЭтоРазделитель ИЛИ Стр.НомерВариантаКП <> ОсновнойВариантКП Тогда
			Продолжить;
		КонецЕсли;
		СуммаДокумента = СуммаДокумента + Стр.Всего;
	КонецЦикла;
	
	СуммаДокумента = СуммаДокумента + Работы.Итог("Всего") + СтоимостьДоставки + ?(СуммаВключаетНДС, 0, СуммаНДСДоставки);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
#Область Потери_при_сушке_GermanButcher

Функция ПолучитьФункционалРезервированияЗаказов()
	Возврат Константы.ФункционалСбораТоваров.Получить();
КонецФункции

Функция Константы_German_Butcher_Получить()
	Возврат Константы.German_Butcher.Получить();
КонецФункции 

#КонецОбласти
// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010