
&Вместо("СформироватьТаблицаУправленческий")
Процедура РасшAzRy_СформироватьТаблицаУправленческий(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаУправленческий.Период КАК Период,
	|	ТаблицаУправленческий.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ТаблицаУправленческий.СчетУчета КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаВалютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаВалютный
	|				ТОГДА ТаблицаУправленческий.СуммаБезНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВалДт,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомВалютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомВалютный
	|				ТОГДА ТаблицаУправленческий.СуммаБезНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВалКт,
	|	СУММА(ТаблицаУправленческий.СуммаБезНДС) КАК Сумма,
	|	&ОприходованиеЗапасов КАК Содержание,
	|	NULL КАК СубконтоДт1,
	|	NULL КАК СубконтоДт2,
	|	NULL КАК СубконтоДт3,
	|	NULL КАК ВидСубконтоДт1,
	|	NULL КАК ВидСубконтоДт2,
	|	NULL КАК ВидСубконтоДт3,
	|	NULL КАК СубконтоКт1,
	|	NULL КАК СубконтоКт2,
	|	NULL КАК СубконтоКт3,
	|	NULL КАК ВидСубконтоКт1,
	|	NULL КАК ВидСубконтоКт2,
	|	NULL КАК ВидСубконтоКт3
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика)
	|	И НЕ ТаблицаУправленческий.ВключатьРасходыВСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУправленческий.Организация,
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаВалютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомВалютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки),
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаВалютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаВалютный
	|				ТОГДА ТаблицаУправленческий.СуммаБезНДСВал + ТаблицаУправленческий.СуммаРасходовВал - ТаблицаУправленческий.СуммаРасходовНДФЛВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомВалютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомВалютный
	|				ТОГДА ТаблицаУправленческий.СуммаБезНДСВал + ТаблицаУправленческий.СуммаРасходовВал - ТаблицаУправленческий.СуммаРасходовНДФЛВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ТаблицаУправленческий.СуммаБезНДС + ТаблицаУправленческий.СуммаРасходов - ТаблицаУправленческий.СуммаРасходовНДФЛ),
	|	&ОприходованиеЗапасов,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика)
	|	И ТаблицаУправленческий.ВключатьРасходыВСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаВалютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.Организация,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомВалютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.СчетУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки),
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаРегл.Валютный
	|				ТОГДА ТаблицаУправленческий.СуммаВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомРегл.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомРегл.Валютный
	|				ТОГДА ТаблицаУправленческий.СуммаВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ТаблицаУправленческий.Сумма),
	|	&ПрочиеРасходы,
	|	ТаблицаУправленческий.Подразделение,
	|	ТаблицаУправленческий.Номенклатура,
	|	ТаблицаУправленческий.Валюта,
	|	""Подразделения"",
	|	""Номенклатура"",
	|	""ХарактеристикиНоменклатуры"",
	|	ТаблицаУправленческий.Контрагент,
	|	ТаблицаУправленческий.Договор,
	|	ТаблицаУправленческий.Валюта,
	|	""Контрагенты"",
	|	""Договоры"",
	|	""Валюты""
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика)
	|	И НЕ ТаблицаУправленческий.ВключатьРасходыВСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.Организация,
	|	ТаблицаУправленческий.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомРегл.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаУправленческий.Подразделение,
	|	ТаблицаУправленческий.Номенклатура,
	|	ТаблицаУправленческий.Контрагент,
	|	ТаблицаУправленческий.Договор,
	|	ТаблицаУправленческий.Валюта,
	|	ТаблицаУправленческий.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки),
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|				ТОГДА -ТаблицаУправленческий.СуммаБезНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ТаблицаУправленческий.СчетУчетаПродажи,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	СУММА(-ТаблицаУправленческий.СуммаБезНДС),
	|	&СторнированиеВыручки,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
	|	И НЕ ТаблицаУправленческий.ТоварыНаКомиссии
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУправленческий.СчетУчетаПродажи,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки),
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.СчетУчетаСебестоимость,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ТаблицаУправленческий.СчетУчета,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	СУММА(-ТаблицаУправленческий.Себестоимость),
	|	&СторнированиеЗапасов,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
	|	И ЕСТЬNULL(ТаблицаУправленческий.ДокументОснование.ВидОперации, ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|	И ЕСТЬNULL(ТаблицаУправленческий.ДокументОснование.ВидОперации, ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
	|	И НЕ ТаблицаУправленческий.ДокументОснование ССЫЛКА Документ.ЧекККМ
	|	И НЕ ТаблицаУправленческий.ТоварыНаКомиссии
	|	И ТаблицаУправленческий.Себестоимость > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ТаблицаУправленческий.СчетУчета,
	|	ТаблицаУправленческий.СчетУчетаСебестоимость
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	1,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомВалютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомВалютный
	|			ТОГДА ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетУчетаАвансовПоставщику,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаАвансовПоставщикуВалютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаАвансовПоставщикуВалютный
	|			ТОГДА ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.Сумма,
	|	&ЗачетПредоплаты,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаДокумента.Период КАК Период,
	|		ТаблицаДокумента.Организация КАК Организация,
	|		ТаблицаДокумента.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
	|		ТаблицаДокумента.СчетУчетаАвансовПоставщикуВалютный КАК СчетУчетаАвансовПоставщикуВалютный,
	|		ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|		ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомВалютный КАК СчетУчетаРасчетовСПоставщикомВалютный,
	|		ТаблицаДокумента.ВалютаРасчетов КАК ВалютаРасчетов,
	|		СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
	|		СУММА(ТаблицаДокумента.Сумма) КАК Сумма
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаДокумента.Период КАК Период,
	|			ТаблицаДокумента.Организация КАК Организация,
	|			ТаблицаДокумента.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
	|			ТаблицаДокумента.СчетУчетаАвансовПоставщику.Валютный КАК СчетУчетаАвансовПоставщикуВалютный,
	|			ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|			ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком.Валютный КАК СчетУчетаРасчетовСПоставщикомВалютный,
	|			ТаблицаДокумента.ВалютаРасчетов КАК ВалютаРасчетов,
	|			ТаблицаДокумента.СуммаВал КАК СуммаВал,
	|			ТаблицаДокумента.Сумма КАК Сумма
	|		ИЗ
	|			ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ТаблицаДокумента.Дата,
	|			ТаблицаДокумента.Организация,
	|			ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщику,
	|			ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщику.Валютный,
	|			ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|			ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный,
	|			ТаблицаДокумента.Валюта,
	|			0,
	|			ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИЗ
	|			ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
	|		ГДЕ
	|			ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Организация,
	|		ТаблицаДокумента.СчетУчетаАвансовПоставщику,
	|		ТаблицаДокумента.СчетУчетаАвансовПоставщикуВалютный,
	|		ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком,
	|		ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомВалютный,
	|		ТаблицаДокумента.ВалютаРасчетов
	|	
	|	ИМЕЮЩИЕ
	|		(СУММА(ТаблицаДокумента.Сумма) >= 0.005
	|			ИЛИ СУММА(ТаблицаДокумента.Сумма) <= -0.005
	|			ИЛИ СУММА(ТаблицаДокумента.СуммаВал) >= 0.005
	|			ИЛИ СУММА(ТаблицаДокумента.СуммаВал) <= -0.005)) КАК ТаблицаДокумента
	|ГДЕ
	|	&ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаАвансовПокупателя.Валютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаАвансовПокупателя.Валютный
	|			ТОГДА -ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА -ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	-ТаблицаДокумента.Сумма,
	|	&СторнированиеПредоплаты,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	9,
	|	1,
	|	ТаблицаУправленческий.Дата,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА &ОтрицательнаяКурсоваяРазницаСчетУчета
	|		ИНАЧЕ ТаблицаУправленческий.СчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы < 0
	|				И ТаблицаУправленческий.СчетУчетаВалютный
	|			ТОГДА ТаблицаУправленческий.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаУправленческий.СчетУчета
	|		ИНАЧЕ &ПоложительнаяКурсоваяРазницаСчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|				И ТаблицаУправленческий.СчетУчетаВалютный
	|			ТОГДА ТаблицаУправленческий.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаУправленческий.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаУправленческий.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	&КурсоваяРазница,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаКурсовыхРазницРасчетыСПоставщиками.Дата КАК Дата,
	|		ТаблицаКурсовыхРазницРасчетыСПоставщиками.Организация КАК Организация,
	|		ТаблицаКурсовыхРазницРасчетыСПоставщиками.СчетУчета КАК СчетУчета,
	|		ТаблицаКурсовыхРазницРасчетыСПоставщиками.СчетУчетаВалютный КАК СчетУчетаВалютный,
	|		ТаблицаКурсовыхРазницРасчетыСПоставщиками.Валюта КАК Валюта,
	|		СУММА(ТаблицаКурсовыхРазницРасчетыСПоставщиками.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаДокумента.Дата КАК Дата,
	|			ТаблицаДокумента.Организация КАК Организация,
	|			ТаблицаДокумента.СчетУчета КАК СчетУчета,
	|			ТаблицаДокумента.СчетУчета.Валютный КАК СчетУчетаВалютный,
	|			ТаблицаДокумента.Валюта КАК Валюта,
	|			ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы
	|		ИЗ
	|			ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
	|		ГДЕ
	|			ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ТаблицаДокумента.Дата,
	|			ТаблицаДокумента.Организация,
	|			ТаблицаДокумента.СчетУчета,
	|			ТаблицаДокумента.СчетУчета.Валютный,
	|			ТаблицаДокумента.Валюта,
	|			ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИЗ
	|			ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
	|		ГДЕ
	|			ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазницРасчетыСПоставщиками
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаКурсовыхРазницРасчетыСПоставщиками.Дата,
	|		ТаблицаКурсовыхРазницРасчетыСПоставщиками.Организация,
	|		ТаблицаКурсовыхРазницРасчетыСПоставщиками.СчетУчета,
	|		ТаблицаКурсовыхРазницРасчетыСПоставщиками.СчетУчетаВалютный,
	|		ТаблицаКурсовыхРазницРасчетыСПоставщиками.Валюта
	|	
	|	ИМЕЮЩИЕ
	|		(СУММА(ТаблицаКурсовыхРазницРасчетыСПоставщиками.СуммаКурсовойРазницы) >= 0.005
	|			ИЛИ СУММА(ТаблицаКурсовыхРазницРасчетыСПоставщиками.СуммаКурсовойРазницы) <= -0.005)) КАК ТаблицаУправленческий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	10,
	|	ТаблицаУправленческий.НомерСтроки,
	|	ТаблицаУправленческий.Дата,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаУправленческий.СчетУчета
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|				И ТаблицаУправленческий.СчетУчета.Валютный
	|			ТОГДА ТаблицаУправленческий.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчета
	|		ИНАЧЕ ТаблицаУправленческий.СчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы < 0
	|				И ТаблицаУправленческий.СчетУчета.Валютный
	|			ТОГДА ТаблицаУправленческий.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаУправленческий.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаУправленческий.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	&КурсоваяРазница,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаУправленческий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	11,
	|	ТаблицаУправленческий.НомерСтроки,
	|	ТаблицаУправленческий.Дата,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчета.Валютный
	|			ТОГДА ТаблицаУправленческий.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ТаблицаУправленческий.СчетУчетаНаценки,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаНаценки.Валютный
	|			ТОГДА ТаблицаУправленческий.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ТаблицаУправленческий.Сумма - ТаблицаУправленческий.Себестоимость,
	|	&Наценка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВременнаяТаблицаСуммовойУчетВРознице КАК ТаблицаУправленческий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	12,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки),
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению.Валютный
	|				ТОГДА ТаблицаУправленческий.СуммаНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомВалютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомВалютный
	|				ТОГДА ТаблицаУправленческий.СуммаНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ТаблицаУправленческий.СуммаНДС),
	|	&НачислениеНДС,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика)
	|	И НЕ ТаблицаУправленческий.ВключатьРасходыВСебестоимость
	|	И ТаблицаУправленческий.СуммаНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУправленческий.Организация,
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомВалютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	13,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки),
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению.Валютный
	|				ТОГДА ТаблицаУправленческий.СуммаНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомВалютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомВалютный
	|				ТОГДА ТаблицаУправленческий.СуммаНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ТаблицаУправленческий.СуммаНДС),
	|	&НачислениеНДС,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика)
	|	И ТаблицаУправленческий.ВключатьРасходыВСебестоимость
	|	И ТаблицаУправленческий.СуммаНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУправленческий.Организация,
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщикомВалютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещению.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	14,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки),
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещениюРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещениюРегл.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещениюРегл.Валютный
	|				ТОГДА ТаблицаУправленческий.СуммаНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаРегл.Валютный
	|				ТОГДА ТаблицаУправленческий.СуммаНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ТаблицаУправленческий.СуммаНДС),
	|	&НачислениеНДС,
	|	NULL,
	|	ТаблицаУправленческий.Договор,
	|	ТаблицаУправленческий.Валюта,
	|	""СчетФактураПоставщика"",
	|	""Валюты"",
	|	""Контрагенты"",
	|	ТаблицаУправленческий.Контрагент,
	|	ТаблицаУправленческий.Договор,
	|	ТаблицаУправленческий.Валюта,
	|	""Договоры"",
	|	""Валюты"",
	|	NULL
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика)
	|	И НЕ ТаблицаУправленческий.ВключатьРасходыВСебестоимость
	|	И ТаблицаУправленческий.СуммаНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаРегл,
	|	ТаблицаУправленческий.Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещениюРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.ВидНалогаНДС.СчетУчетаКВозмещениюРегл.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.Договор,
	|	ТаблицаУправленческий.Валюта,
	|	ТаблицаУправленческий.Контрагент,
	|	ТаблицаУправленческий.Договор,
	|	ТаблицаУправленческий.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	15,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки),
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|				ТОГДА -ТаблицаУправленческий.СуммаНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ТаблицаУправленческий.ВидНалогаНДС.СчетУчета,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	СУММА(-ТаблицаУправленческий.СуммаНДС),
	|	&СторнированиеЗапасов,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
	|	И НЕ ТаблицаУправленческий.ТоварыНаКомиссии
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУправленческий.Организация,
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.ВидНалогаНДС.СчетУчета,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	16,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки),
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаРегл.Валютный
	|				ТОГДА ТаблицаУправленческий.СуммаНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ТаблицаУправленческий.СчетНачисленияНДФЛ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетНачисленияНДФЛ.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетНачисленияНДФЛ.Валютный
	|				ТОГДА ТаблицаУправленческий.СуммаНДСВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ТаблицаУправленческий.СуммаНДФЛ),
	|	&НачислениеНДФЛ,
	|	ТаблицаУправленческий.Контрагент,
	|	ТаблицаУправленческий.Договор,
	|	ТаблицаУправленческий.Валюта,
	|	""Контрагенты"",
	|	""Договоры"",
	|	""Валюты"",
	|	ТаблицаУправленческий.Контрагент,
	|	ТаблицаУправленческий.Договор,
	|	ТаблицаУправленческий.Валюта,
	|	""КонтрагентыСотрудники"",
	|	""Договоры"",
	|	""Валюты""
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика)
	|	И НЕ ТаблицаУправленческий.ВключатьРасходыВСебестоимость
	|	И ТаблицаУправленческий.СуммаНДФЛ <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУправленческий.Организация,
	|	ТаблицаУправленческий.Период,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРегл.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.СчетУчетаРегл,
	|	ТаблицаУправленческий.СчетНачисленияНДФЛ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетНачисленияНДФЛ.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.Контрагент,
	|	ТаблицаУправленческий.Договор,
	|	ТаблицаУправленческий.Валюта,
	|	ТаблицаУправленческий.Контрагент,
	|	ТаблицаУправленческий.Договор,
	|	ТаблицаУправленческий.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	17,
	|	МИНИМУМ(ТаблицаУправленческий.НомерСтроки),
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаВалютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетУчетаВалютный
	|				ТОГДА ТаблицаУправленческий.СуммаРасходовНДФЛВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ТаблицаУправленческий.СчетНачисленияНДФЛ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетНачисленияНДФЛ.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаУправленческий.СчетНачисленияНДФЛ.Валютный
	|				ТОГДА ТаблицаУправленческий.СуммаРасходовНДФЛВал
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ТаблицаУправленческий.СуммаРасходовНДФЛ),
	|	&НачислениеНДФЛ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика)
	|	И ТаблицаУправленческий.ВключатьРасходыВСебестоимость
	|	И ТаблицаУправленческий.СуммаРасходовНДФЛ <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаВалютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.Организация,
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетНачисленияНДФЛ.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаУправленческий.СчетНачисленияНДФЛ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
		
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='მარაგების შემოსავალში აყვანა';ru='Оприходование запасов';en='Posting of Goods'"));
	Запрос.УстановитьПараметр("ПрочиеРасходы", НСтр("ka='დანახარჯების ასახვა';ru='Отражение затрат';en='reflection costs'"));
	Запрос.УстановитьПараметр("НачислениеНДС", НСтр("ka='Начисление НДС';ru='Начисление НДС';en='VAT Charge'"));
	Запрос.УстановитьПараметр("ЗачетПредоплаты", НСтр("ka='წინასწარ გადახდილი თანხის ჩათვლა';ru='Зачет предоплаты';en='Зачет предоплаты'"));
	Запрос.УстановитьПараметр("СторнированиеПредоплаты", НСтр("ka='წინასწარ გადახდის სტორნირება';ru='Сторнирование предоплаты';en='Reversal of pre-payment'"));
	Запрос.УстановитьПараметр("СторнированиеЗапасов", НСтр("ka='თვითღირებულების სტორნირება';ru='Сторнирование себестоимости';en='Reversal of cost'"));
	Запрос.УстановитьПараметр("СторнированиеВыручки", НСтр("ka='მოგების სტორნირება';ru='Сторнирование выручки';en='Reversal of revenue'"));
	Запрос.УстановитьПараметр("Наценка", НСтр("ka='ფასნამატი';ru='Наценка';en='mark-up'"));
	Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеДоходы);
	Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеРасходы);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ВидОперации", ДокументСсылкаПриходнаяНакладная.ВидОперации);
	Запрос.УстановитьПараметр("НачислениеНДФЛ", НСтр("ka='Начисление НДФЛ';ru='Начисление НДФЛ';en='Earning personal income tax'"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
		//НоваяПроводка = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
		НоваяПроводка = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
		// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:		
		ЗаполнитьЗначенияСвойств(НоваяПроводка, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&Вместо("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства)
	
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	ЯвляетсяНеРезидентом = ДокументСсылкаПриходнаяНакладная.Контрагент.ЯвляетсяНеРезидентом 
						И ДокументСсылкаПриходнаяНакладная.Контрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС И ДокументСсылкаПриходнаяНакладная.Договор.УчитыватьНДФЛ;
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходнаяНакладнаяРасходы.Ссылка КАК Ссылка,
	|	ПриходнаяНакладнаяРасходы.НомерСтроки КАК НомерСтроки,
	|	ПриходнаяНакладнаяРасходы.Номенклатура КАК Номенклатура,
	|	ПриходнаяНакладнаяРасходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПриходнаяНакладнаяРасходы.Количество КАК Количество,
	|	ПриходнаяНакладнаяРасходы.Цена КАК Цена,
	|	ПриходнаяНакладнаяРасходы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ПриходнаяНакладнаяРасходы.СтавкаНДС КАК СтавкаНДС,
	|	ПриходнаяНакладнаяРасходы.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ПриходнаяНакладнаяРасходы.Всего КАК Всего,
	|	ПриходнаяНакладнаяРасходы.Заказ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяРасходы.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ПриходнаяНакладнаяРасходы.Ссылка.Подразделение
	|		ИНАЧЕ ПриходнаяНакладнаяРасходы.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ПриходнаяНакладнаяРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПриходнаяНакладнаяРасходы.Содержание КАК Содержание,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	ПриходнаяНакладнаяРасходы.СуммаНДФЛ КАК СуммаНДФЛ,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяРасходы.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ПриходнаяНакладнаяРасходы.Ссылка.Подразделение
	|		ИНАЧЕ ПриходнаяНакладнаяРасходы.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиницаТаб,
	|	ПриходнаяНакладнаяРасходы.СуммаНДС КАК СуммаНДС,
	|	ПриходнаяНакладнаяРасходы.Всего - ПриходнаяНакладнаяРасходы.СуммаНДС КАК Сумма,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ПриходнаяНакладнаяРасходы.СуммаПФ КАК СуммаПФ,
	|	ПриходнаяНакладнаяРасходы.СуммаБезНалогов КАК СуммаБезНалогов
	|ПОМЕСТИТЬ ВременнаяТаблицаРасходыПерерасчет
	|ИЗ
	|	Документ.ПриходнаяНакладная.Расходы КАК ПриходнаяНакладнаяРасходы
	|ГДЕ
	|	ПриходнаяНакладнаяРасходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВременнаяТаблицаРасходыПерерасчет.Сумма) КАК Сумма,
	|	СУММА(ВременнаяТаблицаРасходыПерерасчет.СуммаБезНалогов) КАК СуммаБезНалогов,
	|	СУММА(ВременнаяТаблицаРасходыПерерасчет.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ вт_РасходыГрупп
	|ИЗ
	|	ВременнаяТаблицаРасходыПерерасчет КАК ВременнаяТаблицаРасходыПерерасчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходнаяНакладнаяЗатратыНаИмущество.Ссылка КАК Ссылка,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.НомерСтроки КАК НомерСтроки,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.Номенклатура КАК Номенклатура,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.Количество КАК Количество,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.Цена КАК Цена,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.СтавкаНДС КАК СтавкаНДС,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.Всего КАК Всего,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.Заказ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗатратыНаИмущество.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ПриходнаяНакладнаяЗатратыНаИмущество.Ссылка.Подразделение
	|		ИНАЧЕ ПриходнаяНакладнаяЗатратыНаИмущество.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.Содержание КАК Содержание,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.СуммаНДФЛ КАК СуммаНДФЛ,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаТаб,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.СуммаНДС КАК СуммаНДС,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.Всего - ПриходнаяНакладнаяЗатратыНаИмущество.СуммаНДС КАК Сумма,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.СуммаПФ КАК СуммаПФ,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ПриходнаяНакладнаяЗатратыНаИмущество.СуммаБезНалогов КАК СуммаБезНалогов
	|ПОМЕСТИТЬ ВременнаяТаблицаЗатратыНаИмуществоПерерасчет
	|ИЗ
	|	Документ.ПриходнаяНакладная.ЗатратыНаИмущество КАК ПриходнаяНакладнаяЗатратыНаИмущество
	|ГДЕ
	|	ПриходнаяНакладнаяЗатратыНаИмущество.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВременнаяТаблицаЗатратыНаИмуществоПерерасчет.Сумма) КАК Сумма,
	|	СУММА(ВременнаяТаблицаЗатратыНаИмуществоПерерасчет.СуммаБезНалогов) КАК СуммаБезНалогов,
	|	СУММА(ВременнаяТаблицаЗатратыНаИмуществоПерерасчет.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ вт_ЗатратыНаИмуществоГрупп
	|ИЗ
	|	ВременнаяТаблицаЗатратыНаИмуществоПерерасчет КАК ВременнаяТаблицаЗатратыНаИмуществоПерерасчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходнаяНакладнаяЗапасы.Ссылка КАК Ссылка,
	|	ПриходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПриходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
	|	ПриходнаяНакладнаяЗапасы.СерийныеНомера КАК СерийныеНомера,
	|	ПриходнаяНакладнаяЗапасы.Цена КАК Цена,
	|	ПриходнаяНакладнаяЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ПриходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ПриходнаяНакладнаяЗапасы.Заказ КАК Заказ,
	|	ПриходнаяНакладнаяЗапасы.Всего КАК Всего,
	|	ПриходнаяНакладнаяЗапасы.Себестоимость КАК Себестоимость,
	|	ПриходнаяНакладнаяЗапасы.СуммаРасходов КАК СуммаРасходов,
	|	ПриходнаяНакладнаяЗапасы.Содержание КАК Содержание,
	|	ПриходнаяНакладнаяЗапасы.КлючСвязи КАК КлючСвязи,
	|	ПриходнаяНакладнаяЗапасы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ПриходнаяНакладнаяЗапасы.НеобходимостьВводаАкцизнойМарки КАК НеобходимостьВводаАкцизнойМарки,
	|	ПриходнаяНакладнаяЗапасы.Партия КАК Партия,
	|	ПриходнаяНакладнаяЗапасы.Количество КАК Количество,
	|	ПриходнаяНакладнаяЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ПриходнаяНакладнаяЗапасы.НомерГТД КАК НомерГТД,
	|	ПриходнаяНакладнаяЗапасы.ТоварыДляПроизводства КАК ТоварыДляПроизводства,
	|	ПриходнаяНакладнаяЗапасы.СуммаРасходовНДФЛ КАК СуммаРасходовНДФЛ,
	|	ПриходнаяНакладнаяЗапасы.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Ссылка.Подразделение
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиницаТаб,
	|	ПриходнаяНакладнаяЗапасы.СуммаРасходовПФ КАК СуммаРасходовПФ,
	|	ПриходнаяНакладнаяЗапасы.СуммаРасходовНДС КАК СуммаРасходовНДС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПриходнаяНакладнаяЗапасы.СтавкаНДС.Ставка, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.Всего / (1 + ПриходнаяНакладнаяЗапасы.СтавкаНДС.Ставка / 100)
	|	КОНЕЦ КАК СуммаНДС,
	|	ПриходнаяНакладнаяЗапасы.Всего - ВЫБОР
	|		КОГДА ЕСТЬNULL(ПриходнаяНакладнаяЗапасы.СтавкаНДС.Ставка, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.Всего / (1 + ПриходнаяНакладнаяЗапасы.СтавкаНДС.Ставка / 100)
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыПерерасчетПред
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|ГДЕ
	|	ПриходнаяНакладнаяЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВременнаяТаблицаЗапасыПерерасчет.СуммаНДС) КАК СуммаНДС,
	|	СУММА(1) КАК КоличествоСтрок,
	|	СУММА(ВременнаяТаблицаЗапасыПерерасчет.Сумма) КАК Сумма
	|ПОМЕСТИТЬ вт_ЗапасыГрупп
	|ИЗ
	|	ВременнаяТаблицаЗапасыПерерасчетПред КАК ВременнаяТаблицаЗапасыПерерасчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка,
	|	ВременнаяТаблицаЗапасыПерерасчет.НомерСтроки,
	|	ВременнаяТаблицаЗапасыПерерасчет.Номенклатура,
	|	ВременнаяТаблицаЗапасыПерерасчет.ЕдиницаИзмерения,
	|	ВременнаяТаблицаЗапасыПерерасчет.Характеристика,
	|	ВременнаяТаблицаЗапасыПерерасчет.СерийныеНомера,
	|	ВременнаяТаблицаЗапасыПерерасчет.Цена,
	|	ВременнаяТаблицаЗапасыПерерасчет.ПроцентСкидкиНаценки,
	|	ВременнаяТаблицаЗапасыПерерасчет.СтавкаНДС,
	|	ВременнаяТаблицаЗапасыПерерасчет.Заказ,
	|	ВременнаяТаблицаЗапасыПерерасчет.Всего,
	|	ВременнаяТаблицаЗапасыПерерасчет.Себестоимость,
	|	ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.Сумма / вт_ЗапасыГрупп.Сумма * вт_РасходыГрупп.СуммаБезНалогов КАК ЧИСЛО(15, 8)) КАК СуммаРасходов,
	|	ВременнаяТаблицаЗапасыПерерасчет.Содержание,
	|	ВременнаяТаблицаЗапасыПерерасчет.КлючСвязи,
	|	ВременнаяТаблицаЗапасыПерерасчет.ИдентификаторСтроки,
	|	ВременнаяТаблицаЗапасыПерерасчет.НеобходимостьВводаАкцизнойМарки,
	|	ВременнаяТаблицаЗапасыПерерасчет.Партия,
	|	ВременнаяТаблицаЗапасыПерерасчет.Количество,
	|	ВременнаяТаблицаЗапасыПерерасчет.СтранаПроисхождения,
	|	ВременнаяТаблицаЗапасыПерерасчет.НомерГТД,
	|	ВременнаяТаблицаЗапасыПерерасчет.ТоварыДляПроизводства,
	|	ВременнаяТаблицаЗапасыПерерасчет.СуммаРасходовНДФЛ,
	|	ВременнаяТаблицаЗапасыПерерасчет.СтруктурнаяЕдиницаТаб,
	|	ВременнаяТаблицаЗапасыПерерасчет.СуммаРасходовПФ,
	|	ВременнаяТаблицаЗапасыПерерасчет.НаправлениеДеятельности,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЕСТЬNULL(вт_РасходыГрупп.СуммаНДС, 0) = 0
	|				ТОГДА 0
	|			КОГДА вт_ЗапасыГрупп.СуммаНДС = 0
	|					И вт_РасходыГрупп.СуммаНДС <> 0
	|				ТОГДА вт_РасходыГрупп.СуммаНДС / вт_ЗапасыГрупп.КоличествоСтрок
	|			ИНАЧЕ ВременнаяТаблицаЗапасыПерерасчет.СуммаНДС / вт_ЗапасыГрупп.СуммаНДС * вт_РасходыГрупп.СуммаНДС
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаРасходовНДС,
	|	ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.СуммаНДС КАК ЧИСЛО(15, 8)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.Сумма КАК ЧИСЛО(15, 8)) КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыПерерасчет
	|ИЗ
	|	ВременнаяТаблицаЗапасыПерерасчетПред КАК ВременнаяТаблицаЗапасыПерерасчет,
	|	вт_РасходыГрупп КАК вт_РасходыГрупп,
	|	вт_ЗапасыГрупп КАК вт_ЗапасыГрупп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(&Ссылка КАК Документ.ПриходнаяНакладная) КАК Ссылка,
	|	СУММА(ЕСТЬNULL(ПриходнаяНакладнаяПредоплата.Курс, 0)) КАК Курс,
	|	СУММА(ЕСТЬNULL(ПриходнаяНакладнаяПредоплата.Кратность, 0)) КАК Кратность,
	|	СУММА(ЕСТЬNULL(ПриходнаяНакладнаяПредоплата.СуммаРасчетов, 0)) КАК СуммаРасчетов,
	|	СУММА(1) КАК КолвоСтрок,
	|	СУММА(ЕСТЬNULL(ПриходнаяНакладнаяПредоплата.СуммаРасчетов * ПриходнаяНакладнаяПредоплата.Курс / ПриходнаяНакладнаяПредоплата.Кратность, 0)) КАК СуммаРасчетовНац
	|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПредоплаты
	|ИЗ
	|	Документ.ПриходнаяНакладная.Предоплата КАК ПриходнаяНакладнаяПредоплата
	|ГДЕ
	|	ПриходнаяНакладнаяПредоплата.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов = ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента
	|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетовНац / ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента
	|		КОГДА ЕСТЬNULL(ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов, 0) = 0
	|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Курс
	|		ИНАЧЕ ((ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента - ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов) * ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Курс / ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Кратность + ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетовНац) / ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента
	|	КОНЕЦ КАК Курс,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов = ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.СуммаДокумента
	|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность / ВременнаяТаблицаСреднегоКурсаПредоплаты.КолвоСтрок
	|		КОГДА ЕСТЬNULL(ВременнаяТаблицаСреднегоКурсаПредоплаты.СуммаРасчетов, 0) = 0
	|			ТОГДА ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Кратность
	|		ИНАЧЕ (ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность + ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка.Кратность) / (ВременнаяТаблицаСреднегоКурсаПредоплаты.КолвоСтрок + 1)
	|	КОНЕЦ КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПоДокументу
	|ИЗ
	|	ВременнаяТаблицаСреднегоКурсаПредоплаты КАК ВременнаяТаблицаСреднегоКурсаПредоплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладная.Договор.ЭтоДоговорОбслуживания
	|				И ПриходнаяНакладная.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВестиУчетРасходовПоДоговорамОбслуживания,
	|	ПриходнаяНакладная.Договор.ДоговорОбслуживанияНаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПриходнаяНакладная.СуммаВключаетНДС,
	|	ПриходнаяНакладная.ВидНалогаНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаНациональная)) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации КАК ВидОперации,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПриходнаяНакладнаяЗапасы.Ссылка КАК Документ,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.ДокументОснование КАК ДокументОснование,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент КАК Контрагент,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Ответственный КАК Ответственный,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаНаценки КАК СчетУчетаНаценки,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.ДокументОснование КАК ДокументОснования,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаНаценкиРегл КАК СчетУчетаНаценкиРегл,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.РозничныйВидЦен КАК РозничныйВидЦен,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены КАК ВалютаЦены,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРознице КАК СчетУчетаВРознице,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРозницеРегл КАК СчетУчетаВРозницеРегл,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПриемВПереработку)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПриемНаОтветхранение)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПеремещениеВРозницуСуммовойУчет,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА &Организация
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррОрганизация,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррСтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОрдерныйСклад,
	|	ВЫБОР
	|		КОГДА &УчетПоЯчейкам
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Ссылка.Ячейка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Ячейка,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ИЛИ  ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.ТранзитныйСклад = &ТранзитныйСклад
	|	ТОГДА ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРознице
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасов
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.ТранзитныйСклад
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаРегл
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ИЛИ  ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.ТранзитныйСклад = &ТранзитныйСклад	
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРозницеРегл
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ИЛИ  ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.ТранзитныйСклад = &ТранзитныйСклад	
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРознице.Валютный
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасов.Валютный
	|	КОНЕЦ КАК СчетУчетаВалютный,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.ТранзитныйСклад
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаРегл.Валютный
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ИЛИ  ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.ТранзитныйСклад = &ТранзитныйСклад	
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРозницеРегл.Валютный
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл.Валютный
	|	КОНЕЦ КАК СчетУчетаВалютныйРегл,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррСчетУчета,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррСчетУчетаРегл,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Номенклатура
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррНоменклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьХарактеристики
	|						ТОГДА ПриходнаяНакладнаяЗапасы.Характеристика
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррХарактеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьПартии
	|						ТОГДА ПриходнаяНакладнаяЗапасы.Партия
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррПартия,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И ПриходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Заказ
	|		КОГДА ПриходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|				И ПриходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|				И ПриходнаяНакладнаяЗапасы.Заказ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаказНаряд,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ВЫБОР
	|					КОГДА ПриходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|							И ПриходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|						ТОГДА ПриходнаяНакладнаяЗапасы.Заказ
	|					КОГДА ПриходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	|							И ПриходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|						ТОГДА ПриходнаяНакладнаяЗапасы.Заказ
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КоррЗаказ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|				И ПриходнаяНакладнаяЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				И ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТоварыНаКомиссии,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ДокументОснование ССЫЛКА Документ.РасходнаяНакладная
	|				И ПриходнаяНакладнаяЗапасы.Ссылка.ДокументОснование <> ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ДокументОснование.Подразделение
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Ссылка.Подразделение
	|	КОНЕЦ КАК ПодразделениеПродажи,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.НаправлениеДеятельности
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельностиПродажи,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
	|	КОНЕЦ КАК СчетУчетаПродажи,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|	КОНЕЦ КАК СчетУчетаПродажиРегл,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаРегл.СчетЗатратВозврат <> Значение(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА УчетнаяПолитикаРегл.СчетЗатратВозврат
	|		КОГДА ПриходнаяНакладнаяЗапасы.НаправлениеДеятельности <> Значение(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|				И ПриходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаПрибылиРегл <> Значение(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|	КОНЕЦ КАК СчетУчетаПродажиВозвратРегл,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
	|	КОНЕЦ КАК СчетУчетаСебестоимость,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
	|	КОНЕЦ КАК СчетУчетаСебестоимостьРегл,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Количество
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Количество * ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ПриходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаНДС * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаНДС * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДСЗакупкиПродажи,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяЗапасы.Всего * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.Всего * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК Сумма,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|					ТОГДА ПриходнаяНакладнаяЗапасы.СуммаРасходов * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|				КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|						И НЕ &ПоКурстуДокумента
	|					ТОГДА ПриходнаяНакладнаяЗапасы.СуммаРасходов * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|				ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаРасходов * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|			КОНЕЦ КАК ЧИСЛО(15, 8)), 0) КАК СуммаРасходов,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаРасходов * КурсыРегВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность / (ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаРасходов
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаРасходовВал,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|					ТОГДА ПриходнаяНакладнаяЗапасы.СуммаРасходовНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|				КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|						И НЕ &ПоКурстуДокумента
	|					ТОГДА ПриходнаяНакладнаяЗапасы.СуммаРасходовНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|				ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаРасходовНДС * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|			КОНЕЦ КАК ЧИСЛО(15, 8)), 0) КАК СуммаРасходовНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаРасходовНДС * КурсыРегВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность / (ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаРасходовНДС
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаРасходовНДСВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.Себестоимость * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяЗапасы.Себестоимость * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.Себестоимость * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК Себестоимость,
	|	ПриходнаяНакладнаяЗапасы.Всего КАК СуммаРасчетовПринятыеПереданные,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.ВключатьРасходыВСебестоимость КАК ВключатьРасходыВСебестоимость,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратСОтветхранения)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
	|					И (ЕСТЬNULL(ПриходнаяНакладнаяЗапасы.Ссылка.ДокументОснование.ВидОперации, ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|						ИЛИ ЕСТЬNULL(ПриходнаяНакладнаяЗапасы.Ссылка.ДокументОснование.ВидОперации, ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
	|						ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ДокументОснование ССЫЛКА Документ.ЧекККМ)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ФиксированнаяСтоимость,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПриемВПереработку)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПриемНаОтветхранение)
	|			ТОГДА ВЫРАЗИТЬ(&ОприходованиеЗапасов КАК СТРОКА(100))
	|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика)
	|				ИЛИ ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратСОтветхранения)
	|			ТОГДА ВЫРАЗИТЬ(&СписаниеЗапасов КАК СТРОКА(100))
	|	КОНЕЦ КАК СодержаниеПроводки,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный КАК СчетУчетаРасчетовСПоставщикомВалютный,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл.Валютный КАК СчетУчетаРасчетовСПоставщикомВалютныйРегл,
	|	ПриходнаяНакладнаяЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ПриходнаяНакладнаяЗапасы.НомерГТД КАК НомерГТД,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.Всего * КурсыРегВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность / (ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.Всего
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность / (ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаНДС
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДСВал,
	|	ПриходнаяНакладнаяЗапасы.КлючСвязи,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА (ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС) * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА (ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС) * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ (ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС) * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаБезНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА (ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС) * КурсыРегВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность / (ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаБезНДСВал,
	|	ВременнаяТаблицаШапка.ВидНалогаНДС,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Договор.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	ПриходнаяНакладнаяЗапасы.СтруктурнаяЕдиницаТаб,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Договор.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК СчетНачисленияНДФЛ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаРасходовПФ * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаРасходовПФ * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаРасходовПФ * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаРасходовПФ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаРасходовПФ * КурсыРегВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность / (ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаРасходовПФ
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаРасходовПФВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаРасходовНДФЛ * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаРасходовНДФЛ * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаРасходовНДФЛ * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаРасходовНДФЛ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаРасходовНДФЛ * КурсыРегВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность / (ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаРасходовНДФЛ
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаРасходовНДФЛВал
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	ВременнаяТаблицаЗапасыПерерасчет КАК ПриходнаяНакладнаяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
	|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
	|		ПО (КурсыРегВалюты.Валюта = &ВалютаНациональная)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокумента
	|		ПО (СреднийКурсДокумента.Ссылка.ВалютаДокумента = ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&ДатаСреза, ) КАК УчетнаяПолитикаРегл
	|		ПО ПриходнаяНакладнаяЗапасы.Ссылка.Организация = УчетнаяПолитикаРегл.Организация,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	ПриходнаяНакладнаяЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходнаяНакладнаяРасходы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Дата КАК Период,
	|	ПриходнаяНакладнаяРасходы.Ссылка КАК Документ,
	|	ПриходнаяНакладнаяРасходы.Ссылка.ВидОперации КАК ВидОперации,
	|	&Организация КАК Организация,
	|	ПриходнаяНакладнаяРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента КАК Валюта,
	|	ПриходнаяНакладнаяРасходы.Номенклатура.СчетУчетаЗатрат КАК СчетУчета,
	|	ПриходнаяНакладнаяРасходы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаРегл,
	|	ПриходнаяНакладнаяРасходы.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК ЗапасыНоменклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|	ПриходнаяНакладнаяРасходы.Заказ КАК Заказ,
	|	ПриходнаяНакладнаяРасходы.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПриходнаяНакладнаяРасходы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ПриходнаяНакладнаяРасходы.Количество
	|		ИНАЧЕ ПриходнаяНакладнаяРасходы.Количество * ПриходнаяНакладнаяРасходы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ПриходнаяНакладнаяРасходы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяРасходы.Всего * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.Всего * ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК Сумма,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.Всего * КурсыРегВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность / (ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.Всего
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.СуммаНДС * ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.СуммаНДС * ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДСЗакупкиПродажи,
	|	ПриходнаяНакладнаяРасходы.Ссылка.ВключатьРасходыВСебестоимость КАК ВключатьРасходыВСебестоимость,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ВЫБОР
	|					КОГДА ПриходнаяНакладнаяРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|							И НЕ ПриходнаяНакладнаяРасходы.Ссылка.ВключатьРасходыВСебестоимость
	|						ТОГДА ПриходнаяНакладнаяРасходы.НаправлениеДеятельности
	|					ИНАЧЕ ПриходнаяНакладнаяРасходы.Номенклатура.НаправлениеДеятельности
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПриходнаяНакладнаяРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|						И НЕ ПриходнаяНакладнаяРасходы.Ссылка.ВключатьРасходыВСебестоимость
	|					ТОГДА ПриходнаяНакладнаяРасходы.НаправлениеДеятельности
	|				ИНАЧЕ ПриходнаяНакладнаяРасходы.Номенклатура.НаправлениеДеятельности
	|			КОНЕЦ
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент КАК Контрагент,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Договор КАК Договор,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПриходнаяНакладнаяРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета
	|		ИНАЧЕ ПриходнаяНакладнаяРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчета,
	|	ПриходнаяНакладнаяРасходы.СтруктурнаяЕдиницаТаб,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА (ПриходнаяНакладнаяРасходы.Всего - ПриходнаяНакладнаяРасходы.СуммаНДС - ПриходнаяНакладнаяРасходы.СуммаПФ) * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА (ПриходнаяНакладнаяРасходы.Всего - ПриходнаяНакладнаяРасходы.СуммаНДС - ПриходнаяНакладнаяРасходы.СуммаПФ) * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ (ПриходнаяНакладнаяРасходы.Всего - ПриходнаяНакладнаяРасходы.СуммаНДС - ПриходнаяНакладнаяРасходы.СуммаПФ) * ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаБезНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА (ПриходнаяНакладнаяРасходы.Всего - ПриходнаяНакладнаяРасходы.СуммаНДС - ПриходнаяНакладнаяРасходы.СуммаПФ) * КурсыРегВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность / (ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.Всего - ПриходнаяНакладнаяРасходы.СуммаНДС - ПриходнаяНакладнаяРасходы.СуммаПФ
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаБезНДСВал,
	|	ПриходнаяНакладнаяРасходы.Ссылка.ВидНалогаНДС КАК ВидНалогаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДС * КурсыРегВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность / (ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.СуммаНДС
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДСВал,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК СчетНачисленияНДФЛ,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.СчетЗатратРегл КАК СчетЗатратРеглПФ,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.СчетЗатрат КАК СчетЗатратПФ,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета
	|		ИНАЧЕ ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.СчетЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчетаЗатратПФ,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаПФ * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаПФ * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.СуммаПФ * ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаПФ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаПФ * КурсыРегВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность / (ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.СуммаПФ
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаПФВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДФЛ * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДФЛ * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.СуммаНДФЛ * ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДФЛ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДФЛ * КурсыРегВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность / (ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.СуммаНДФЛ
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДФЛВал
	|ПОМЕСТИТЬ ВременнаяТаблицаРасходы
	|ИЗ
	|	ВременнаяТаблицаРасходыПерерасчет КАК ПриходнаяНакладнаяРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
	|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
	|		ПО (КурсыРегВалюты.Валюта = &ВалютаНациональная)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокумента
	|		ПО (СреднийКурсДокумента.Ссылка.ВалютаДокумента = ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента)
	|ГДЕ
	|	ПриходнаяНакладнаяРасходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходнаяНакладнаяРасходы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Дата КАК Период,
	|	ПриходнаяНакладнаяРасходы.Ссылка КАК Документ,
	|	ПриходнаяНакладнаяРасходы.Ссылка.ВидОперации КАК ВидОперации,
	|	&Организация КАК Организация,
	|	ПриходнаяНакладнаяРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента КАК Валюта,
	|	ПриходнаяНакладнаяРасходы.Номенклатура.СчетУчетаЗатрат КАК СчетУчета,
	|	ПриходнаяНакладнаяРасходы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаРегл,
	|	ПриходнаяНакладнаяРасходы.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК ЗапасыНоменклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|	ПриходнаяНакладнаяРасходы.Заказ КАК Заказ,
	|	ПриходнаяНакладнаяРасходы.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПриходнаяНакладнаяРасходы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ПриходнаяНакладнаяРасходы.Количество
	|		ИНАЧЕ ПриходнаяНакладнаяРасходы.Количество * ПриходнаяНакладнаяРасходы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ПриходнаяНакладнаяРасходы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяРасходы.Всего * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.Всего * ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК Сумма,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.Всего * КурсыРегВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность / (ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.Всего
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.СуммаНДС * ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.СуммаНДС * ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДСЗакупкиПродажи,
	|	ПриходнаяНакладнаяРасходы.Ссылка.ВключатьРасходыВСебестоимость КАК ВключатьРасходыВСебестоимость,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ВЫБОР
	|					КОГДА ПриходнаяНакладнаяРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|							И НЕ ПриходнаяНакладнаяРасходы.Ссылка.ВключатьРасходыВСебестоимость
	|						ТОГДА ПриходнаяНакладнаяРасходы.НаправлениеДеятельности
	|					ИНАЧЕ ПриходнаяНакладнаяРасходы.Номенклатура.НаправлениеДеятельности
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПриходнаяНакладнаяРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|						И НЕ ПриходнаяНакладнаяРасходы.Ссылка.ВключатьРасходыВСебестоимость
	|					ТОГДА ПриходнаяНакладнаяРасходы.НаправлениеДеятельности
	|				ИНАЧЕ ПриходнаяНакладнаяРасходы.Номенклатура.НаправлениеДеятельности
	|			КОНЕЦ
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент КАК Контрагент,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Договор КАК Договор,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ПриходнаяНакладнаяРасходы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПриходнаяНакладнаяРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета
	|		ИНАЧЕ ПриходнаяНакладнаяРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчета,
	|	ПриходнаяНакладнаяРасходы.СтруктурнаяЕдиницаТаб,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА (ПриходнаяНакладнаяРасходы.Всего - ПриходнаяНакладнаяРасходы.СуммаНДС - ПриходнаяНакладнаяРасходы.СуммаПФ) * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА (ПриходнаяНакладнаяРасходы.Всего - ПриходнаяНакладнаяРасходы.СуммаНДС - ПриходнаяНакладнаяРасходы.СуммаПФ) * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ (ПриходнаяНакладнаяРасходы.Всего - ПриходнаяНакладнаяРасходы.СуммаНДС - ПриходнаяНакладнаяРасходы.СуммаПФ) * ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаБезНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА (ПриходнаяНакладнаяРасходы.Всего - ПриходнаяНакладнаяРасходы.СуммаНДС - ПриходнаяНакладнаяРасходы.СуммаПФ) * КурсыРегВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность / (ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.Всего - ПриходнаяНакладнаяРасходы.СуммаНДС - ПриходнаяНакладнаяРасходы.СуммаПФ
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаБезНДСВал,
	|	ПриходнаяНакладнаяРасходы.Ссылка.ВидНалогаНДС КАК ВидНалогаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДС * КурсыРегВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность / (ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.СуммаНДС
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДСВал,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК СчетНачисленияНДФЛ,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.СчетЗатратРегл КАК СчетЗатратРеглПФ,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.СчетЗатрат КАК СчетЗатратПФ,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета
	|		ИНАЧЕ ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.СчетЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчетаЗатратПФ,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	ПриходнаяНакладнаяРасходы.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаПФ * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаПФ * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.СуммаПФ * ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаПФ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаПФ * КурсыРегВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность / (ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.СуммаПФ
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаПФВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДФЛ * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДФЛ * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.СуммаНДФЛ * ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДФЛ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяРасходы.СуммаНДФЛ * КурсыРегВалюты.Курс * ПриходнаяНакладнаяРасходы.Ссылка.Кратность / (ПриходнаяНакладнаяРасходы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяРасходы.СуммаНДФЛ
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДФЛВал,
	|	ПриходнаяНакладнаяРасходы.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.ПрименитьВТекущемМесяце КАК ПрименитьВТекущемМесяце,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат КАК СчетЗатратВА,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаВА,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельностиВА,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ВЫРАЗИТЬ(ПараметрыВнеоборотныхАктивовСрезПоследних.Адрес КАК СТРОКА(250)) КАК Адрес
	|ПОМЕСТИТЬ ВременнаяТаблицаЗатратыНаВА
	|ИЗ
	|	ВременнаяТаблицаЗатратыНаИмуществоПерерасчет КАК ПриходнаяНакладнаяРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
	|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
	|		ПО (КурсыРегВалюты.Валюта = &ВалютаНациональная)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокумента
	|		ПО (СреднийКурсДокумента.Ссылка.ВалютаДокумента = ПриходнаяНакладнаяРасходы.Ссылка.ВалютаДокумента)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&ДатаСреза, ) КАК ПараметрыВнеоборотныхАктивовСрезПоследних
	|		ПО ПриходнаяНакладнаяРасходы.ВнеоборотныйАктив = ПараметрыВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив
	|			И ПриходнаяНакладнаяРасходы.Ссылка.Организация = ПараметрыВнеоборотныхАктивовСрезПоследних.Организация
	|ГДЕ
	|	ПриходнаяНакладнаяРасходы.Ссылка = &Ссылка
	|	И ПриходнаяНакладнаяРасходы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ЗакупкаКапитальныхЗатрат)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.ВидОперации КАК ВидОперации,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл КАК СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл КАК СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Ссылка.Организация КАК ОрганизацияВНУ,
	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ТаблицаДокумента.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Ссылка.Договор КАК Договор,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельностиПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс) КАК ТипРасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетовКуда,
	|	&Ссылка КАК ДокументКуда,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.Ссылка.ДокументОснование КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.АвансовыйОтчет)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Статья
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|			КОНЕЦ
	|	КОНЕЦ КАК Статья,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.АвансовыйОтчет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.АвансовыйОтчет).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.Взаимозачет).Дата
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
	|	КОНЕЦ КАК ДокументДата,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 8))) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал
	|ПОМЕСТИТЬ ВременнаяТаблицаПредоплата
	|ИЗ
	|	Документ.ПриходнаяНакладная.Предоплата КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Ссылка.Договор,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Ссылка.ВидОперации,
	|	ТаблицаДокумента.Ссылка.ДокументОснование,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.АвансовыйОтчет)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Статья
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.АвансовыйОтчет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.АвансовыйОтчет).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.Взаимозачет).Дата
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.Организация,
	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС,
	|	ТаблицаДокумента.Ссылка.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходнаяНакладнаяСерийныеНомера.КлючСвязи,
	|	ПриходнаяНакладнаяСерийныеНомера.СерийныйНомер
	|ПОМЕСТИТЬ ВременнаяТаблицаСерийныеНомера
	|ИЗ
	|	Документ.ПриходнаяНакладная.СерийныеНомера КАК ПриходнаяНакладнаяСерийныеНомера
	|ГДЕ
	|	ПриходнаяНакладнаяСерийныеНомера.Ссылка = &Ссылка
	|	И &ИспользоватьСерийныеНомера
	|	И НЕ ПриходнаяНакладнаяСерийныеНомера.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПриходнаяНакладная);
	Запрос.УстановитьПараметр("ДатаСреза", ?(ЗначениеЗаполнено(ДокументСсылкаПриходнаяНакладная.Дата), ДокументСсылкаПриходнаяНакладная.Дата - 1, ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	Запрос.УстановитьПараметр("УчетПоЯчейкам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоЯчейкам);
	Запрос.УстановитьПараметр("ИспользоватьСерийныеНомера", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьСерийныеНомера);
	
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='მარაგების შემოსავალში აყვანა';ru='Оприходование запасов';en='Posting of Goods'"));
	Запрос.УстановитьПараметр("СписаниеЗапасов", НСтр("ka='მარაგების ჩამოწერა';ru='Списание запасов';en='Write-off stocks'"));
	
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаНациональная", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("ПоКурстуДокумента", Константы.ОприходованиеТоворовПоКурсуДокумента.Получить());
	Запрос.УстановитьПараметр("ИспользованиеТолькоРеглПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);//+++ Дмгг
	Запрос.УстановитьПараметр("ТранзитныйСклад", Истина); 
	Запрос.ВыполнитьПакет();
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПодготовитьСтруктурыСубконтоСчетовДоходаПродажи(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства); //+++ Дмгг
	
	// Формирование проводок документа.
	УправлениеНебольшойФирмойСервер.СформироватьТаблицуПроводок(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗакупки(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПродажи(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыКПоступлениюНаСклады(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыПринятые(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыПереданные(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗаказыПокупателей(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗаказыПоставщикам(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРазмещениеЗаказов(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПотребностьВЗапасах(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасы(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыВРазрезеГТД(СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСуммовойУчетВРознице(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаУправленческий(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаАвансыПолученныхФактур(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);//Паганини
	// +++ { AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	Если Не ЯвляетсяНеРезидентом Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Очистить();
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ПриходнаяНакладная(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);	
	КонецЕсли; 
	// +++ } AzRy - [28.01.2021] - Jira:ERPM-809 - Developer:გიორგი მამულაშვილი - Comment:
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыСПенсионнымФондом_ПриходнаяНакладная(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьСебестоимостьЗакупки_ПриходнаяНакладная(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);//+++ Дмгг
	
	// ДисконтныеКарты
	СформироватьТаблицаПродажиПоДисконтнойКарте(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);

	// Серийные номера
	СформироватьТаблицаСерийныеНомера(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);	
	
	СформироватьТаблицаЗакупкиПоставщиковДляКУДиР(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	
	//+++ Дмгг
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаВнеоборотныеАктивы(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	//--- Дмгг
	
КонецПроцедуры
