
&Вместо("ПредопределенныйЭлемент")
Функция РасшAzRy_ПредопределенныйЭлемент(Знач ПолноеИмяПредопределенного)
	
	ИмяПредопределенного = ВРег(ПолноеИмяПредопределенного);
	
	Точка = СтрНайти(ИмяПредопределенного, ".");
	ИмяКоллекции = Лев(ИмяПредопределенного, Точка - 1);
	ИмяПредопределенного = Сред(ИмяПредопределенного, Точка + 1);
	
	Точка = СтрНайти(ИмяПредопределенного, ".");
	ИмяТаблицы = Лев(ИмяПредопределенного, Точка - 1);
	ИмяПредопределенного = Сред(ИмяПредопределенного, Точка + 1);
	
	УстановитьПривилегированныйРежим(Истина);
	
	// - AzRy : shecdomis gamo droebiT davakomentire
	//ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 Ссылка ИЗ &ПолноеИмяТаблицы ГДЕ ИмяПредопределенныхДанных = &ИмяПредопределенного";	
	// - AzRy : shecdomis gamo droebiT davakomentire
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ &ПолноеИмяТаблицы ГДЕ ИмяПредопределенныхДанных = &ИмяПредопределенного";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяТаблицы", ИмяКоллекции + "." + ИмяТаблицы);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ИмяПредопределенного", ИмяПредопределенного);

	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Результат.Выгрузить()[0].Ссылка;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Неопределено;
	
КонецФункции
