// +++ { AzRy - [15.12.2025] - Jira:ERPM-966 - Developer:გიორგი მამულაშვილი - Comment: 

&После("ОбработкаПроведения")
Процедура AzRyFix_ОбработкаПроведения(Отказ, РежимПроведения)
	 
	Если СостояниеЗаказа <> Справочники.СостоянияЗаказНарядов.Завершен Или СостояниеЗаказа <> Справочники.СостоянияЗаказНарядов.НайтиПоНаименованию("უარი შეკეთებაზე") Тогда
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// +++ } AzRy - [15.12.2025] - Jira:ERPM-966 - Developer:გიორგი მამულაშვილი - Comment:	  

