
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если ПустаяСтрока(Фамилия) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Не указана фамилия сотрудника.';ru='Не указана фамилия сотрудника.';en='Not specified Name of officer.'"), ,"Фамилия");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Имя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Не указан имя сотрудника.';ru='Не указан имя сотрудника.';en='Unknown name of the employee.'"), ,"Имя");
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ЭтаФорма.ВладелецФормы.ИмяФормы,"Мастер") = 0 Тогда
		ЭтаФорма.ВладелецФормы.Объект.ВладелецЭЦПФамилия	= Фамилия;
		ЭтаФорма.ВладелецФормы.Объект.ВладелецЭЦПИмя		= Имя;
		ЭтаФорма.ВладелецФормы.Объект.ВладелецЭЦПОтчество	= Отчество;
	Иначе
		ЭтаФорма.ВладелецФормы.ВладелецЭЦПФамилия	= Фамилия;
		ЭтаФорма.ВладелецФормы.ВладелецЭЦПИмя		= Имя;
		ЭтаФорма.ВладелецФормы.ВладелецЭЦПОтчество	= Отчество;
	КонецЕсли;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти
