
#Область AzRy

&НаКлиенте
Процедура РасшAzRy_ГиперссылкаJiraНажатиеПосле(Элемент)
	
	Если ЗначениеЗаполнено(Объект.AzRyJiraCode) Тогда
		ЗапуститьПриложение(AzRyОбщегоНазначения.ПолучитьАдресВебРесурсаJira() + Объект.AzRyJiraCode);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_AzRyНастройкаДокументаВместо(Команда)
	
	// 1. Формируем структуру параметров для заполнения формы "Настройка документа".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПоложениеЗаказаПокупателяВПеремещенииЗапасов", 	Объект.ПоложениеЗаказаПокупателя);
	СтруктураПараметров.Вставить("ПоложениеЯчейкиВПеремещенииЗапасов", 	Объект.ПоложениеЯчейкиВПеремещенииЗапасов);
	СтруктураПараметров.Вставить("БылиВнесеныИзменения", 							Ложь);
	
	СтруктураНастройкаДокумента = Неопределено;

	
	ОткрытьФорму("ОбщаяФорма.НастройкаДокумента", СтруктураПараметров,,,,, Новый ОписаниеОповещения("НастройкаДокументаЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаСервере
Процедура РасшAzRy_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если AzRyFunctions.AzRyНапоминанияПользователяДокументНаКонтроле(Параметры.Ключ) Тогда		
		AzRyFunctions.AzRyНапПользователяУстановитьТолькоПросмотр(ЭтаФорма)				
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

