
#Область AzRy

&НаКлиенте
Процедура РасшAzRy_ГиперссылкаJiraНажатиеПосле(Элемент)
	
	Если ЗначениеЗаполнено(Объект.AzRyJiraCode) Тогда
		ЗапуститьПриложение(AzRyОбщегоНазначения.ПолучитьАдресВебРесурсаJira() + Объект.AzRyJiraCode);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_AzRyНастройкаДокументаВместо(Команда)
	
	// 1. Формируем структуру параметров для заполнения формы "Настройка документа".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПоложениеЗаказаПокупателяВПеремещенииЗапасов", 	Объект.ПоложениеЗаказаПокупателя);
	СтруктураПараметров.Вставить("ПоложениеЯчейкиВПеремещенииЗапасов", 	Объект.ПоложениеЯчейкиВПеремещенииЗапасов);
	СтруктураПараметров.Вставить("БылиВнесеныИзменения", 							Ложь);
	
	СтруктураНастройкаДокумента = Неопределено;

	
	ОткрытьФорму("ОбщаяФорма.НастройкаДокумента", СтруктураПараметров,,,,, Новый ОписаниеОповещения("НастройкаДокументаЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаСервере
Процедура РасшAzRy_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если AzRyFunctions.AzRyНапоминанияПользователяДокументНаКонтроле(Параметры.Ключ) Тогда		
		AzRyFunctions.AzRyНапПользователяУстановитьТолькоПросмотр(ЭтаФорма)				
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_ЗапасыНоменклатураПриИзмененииПосле(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Ячейка) Тогда	
		СтрокаТабличнойЧасти.Ячейка = ЯчейкаНоменклатуры(Объект.СтруктурнаяЕдиница, СтрокаТабличнойЧасти.Номенклатура);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ЯчейкаНоменклатуры(Владелец, Номенклатура)
	
	Ячейка = Неопределено;
	
	Если Не Объект.ПоложениеЯчейкиВПеремещенииЗапасов = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Или Не ЗначениеЗаполнено(Номенклатура.AzRyНомерЯчейки) Или Не ЗначениеЗаполнено(Владелец) Тогда
		Возврат Ячейка;		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ячейки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Ячейки КАК Ячейки
		|ГДЕ
		|	Ячейки.Владелец = &Владелец
		|	И Ячейки.Наименование = &Наименование
		|	И НЕ Ячейки.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Наименование", СокрЛП(Номенклатура.AzRyНомерЯчейки));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ячейка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
		
	Возврат Ячейка;

КонецФункции

#КонецОбласти

