#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем ИспользоватьТолькоРегламентированныйПланСчетов Экспорт; //+++ Дмгг
#Область ПрограммныйИнтерфейс

// Процедура выполняет распределение затрат по количеству.
//
Процедура РаспределитьТабЧастьРасходыПоКоличеству() Экспорт
	
	ИсхСумма = 0;
	ИсхСуммаНДС = 0;
	БазаРаспределенияКоличество = Запасы.Итог("Количество");
	ВсегоРасходы = Расходы.Итог("СуммаБезНалогов");//Паганини Расходы.Итог("Всего")
	ВсегоНДСРасходы = Расходы.Итог("СуммаНДС");
	//Паганини_
	ИсхСуммаНДФЛ = 0;	
	ВсегоРасходыНДФЛ = Расходы.Итог("СуммаНДФЛ");
	ИсхСуммаПФ = 0;	
	ВсегоРасходыПФ = Расходы.Итог("СуммаПФ");
	//_Паганини
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		СтрокаЗапасы.СуммаРасходов = ?(БазаРаспределенияКоличество <> 0, Окр((ВсегоРасходы - ИсхСумма) * СтрокаЗапасы.Количество / БазаРаспределенияКоличество, 2, 1),0);
		//СтрокаЗапасы.СуммаРасходовНДС = ?(БазаРаспределенияКоличество <> 0, Окр((ВсегоНДСРасходы - ИсхСуммаНДС) * СтрокаЗапасы.Количество / БазаРаспределенияКоличество, 2, 1),0);
		СтрокаЗапасы.СуммаРасходовНДФЛ = ?(БазаРаспределенияКоличество <> 0, Окр((ВсегоРасходыНДФЛ - ИсхСуммаНДФЛ) * СтрокаЗапасы.Количество / БазаРаспределенияКоличество, 2, 1),0);//Паганини
		СтрокаЗапасы.СуммаРасходовПФ   = ?(БазаРаспределенияКоличество <> 0, Окр((ВсегоРасходыПФ   - ИсхСуммаПФ)   * СтрокаЗапасы.Количество / БазаРаспределенияКоличество, 2, 1),0);//Паганини ПФ
		БазаРаспределенияКоличество = БазаРаспределенияКоличество - СтрокаЗапасы.Количество;
		ИсхСумма = ИсхСумма + СтрокаЗапасы.СуммаРасходов;
		//ИсхСуммаНДС = ИсхСуммаНДС + СтрокаЗапасы.СуммаРасходовНДС;
		ИсхСуммаНДФЛ = ИсхСуммаНДФЛ + СтрокаЗапасы.СуммаРасходовНДФЛ;//Паганини
		ИсхСуммаПФ   = ИсхСуммаПФ   + СтрокаЗапасы.СуммаРасходовПФ;//Паганини ПФ
		
	КонецЦикла;
	
КонецПроцедуры // РаспределитьТабЧастьРасходыПоКоличеству()

// Процедура выполняет распределение затрат по сумме.
//
Процедура РаспределитьТабЧастьРасходыПоСумме() Экспорт
	
	ИсхСумма = 0;
	ИсхСуммаНДС = 0;
	БазаРаспределенияСумма = Запасы.Итог("Всего");
	ВсегоРасходы = Расходы.Итог("СуммаБезНалогов");//Расходы.Итог("Всего");
	БазаРаспределенияСуммаНДС = Запасы.Итог("СуммаНДС");
	ВсегоНДСРасходы = Расходы.Итог("СуммаНДС");
	//Паганини_
	ИсхСуммаНДФЛ = 0;	
	ВсегоРасходыНДФЛ = Расходы.Итог("СуммаНДФЛ");
	ИсхСуммаПФ = 0;	
	ВсегоРасходыПФ = Расходы.Итог("СуммаПФ");
	//_Паганини
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		СтрокаЗапасы.СуммаРасходов = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоРасходы - ИсхСумма) * СтрокаЗапасы.Всего / БазаРаспределенияСумма, 2, 1),0);
		//СтрокаЗапасы.СуммаРасходовНДС = ?(БазаРаспределенияСуммаНДС <> 0, Окр((ВсегоНДСРасходы - ИсхСуммаНДС) * СтрокаЗапасы.СуммаНДС / БазаРаспределенияСуммаНДС, 2, 1),0);
		//СтрокаЗапасы.СуммаРасходовНДС = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоНДСРасходы - ИсхСуммаНДС) * СтрокаЗапасы.Всего / БазаРаспределенияСумма, 2, 1),0);
		//СтрокаЗапасы.СуммаРасходов = (СтрокаЗапасы.Всего-СтрокаЗапасы.СуммаНДС)/(БазаРаспределенияСумма - Запасы.Итог("СуммаНДС"))*ВсегоРасходы+(СтрокаЗапасы.Всего-СтрокаЗапасы.СуммаНДС);
		//////СтрокаЗапасы.СуммаРасходовНДС = ?(БазаРаспределенияСуммаНДС <> 0, Окр((ВсегоНДСРасходы - ИсхСуммаНДС) * СтрокаЗапасы.СуммаНДС / БазаРаспределенияСуммаНДС, 2, 1),0);
		//СтрокаЗапасы.СуммаРасходовНДС = СтрокаЗапасы.СуммаНДС/БазаРаспределенияСуммаНДС*ВсегоНДСРасходы;

		СтрокаЗапасы.СуммаРасходовНДФЛ = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоРасходыНДФЛ - ИсхСуммаНДФЛ) * СтрокаЗапасы.Всего / БазаРаспределенияСумма, 2, 1),0);//Паганини
		СтрокаЗапасы.СуммаРасходовПФ   = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоРасходыПФ   - ИсхСуммаПФ)   * СтрокаЗапасы.Всего / БазаРаспределенияСумма, 2, 1),0);//Паганини ПФ
		БазаРаспределенияСумма = БазаРаспределенияСумма - СтрокаЗапасы.Всего;
		ИсхСумма = ИсхСумма + СтрокаЗапасы.СуммаРасходов;
		//ИсхСуммаНДС = ИсхСуммаНДС + СтрокаЗапасы.СуммаРасходовНДС;
		ИсхСуммаНДФЛ = ИсхСуммаНДФЛ + СтрокаЗапасы.СуммаРасходовНДФЛ;//Паганини
		ИсхСуммаПФ = ИсхСуммаПФ + СтрокаЗапасы.СуммаРасходовПФ;//Паганини ПФ
		
	КонецЦикла;
	
КонецПроцедуры // РаспределитьТабЧастьРасходыПоСумме()

#КонецОбласти

#Область ПроцедурыЗаполненияДокумента

Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	Если Не ДанныеЗаполнения.Свойство("МассивЗаказовПоставщикам") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоЗаказуПоставщику(ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура заполняет авансы.
//
Процедура ЗаполнитьПредоплату() Экспорт
	
	ЗаказВШапке = (ПоложениеЗаказаПоставщику = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке);
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация);
	
	// Подготовка таблицы заказов.
	ТаблицаЗаказов = Запасы.Выгрузить(, "Заказ, Всего");
	ТаблицаЗаказов.Колонки.Добавить("ВсегоРасч");
	Для каждого ТекСтрока Из Расходы Цикл
		НоваяСтрока = ТаблицаЗаказов.Добавить();
		НоваяСтрока.Заказ = ТекСтрока.ЗаказПоставщику;
		НоваяСтрока.Всего = ТекСтрока.Всего;
	КонецЦикла;
	Для каждого ТекСтрока Из ТаблицаЗаказов Цикл
		Если НЕ Контрагент.ВестиРасчетыПоЗаказам Тогда
			ТекСтрока.Заказ = Документы.ЗаказПоставщику.ПустаяСсылка();
		ИначеЕсли ЗаказВШапке Тогда
			ТекСтрока.Заказ = Заказ;
		Иначе
			ТекСтрока.Заказ = ?(ТекСтрока.Заказ = Неопределено, Документы.ЗаказПоставщику.ПустаяСсылка(), ТекСтрока.Заказ);
		КонецЕсли;
		ТекСтрока.ВсегоРасч = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
			ТекСтрока.Всего,
			?(Договор.ВалютаРасчетов = ВалютаДокумента, Курс, 1),
			Курс,
			?(Договор.ВалютаРасчетов = ВалютаДокумента, Кратность, 1),
			Кратность
		);
	КонецЦикла;
	ТаблицаЗаказов.Свернуть("Заказ", "Всего, ВсегоРасч");
	ТаблицаЗаказов.Сортировать("Заказ Возр");
	
	// Заполнение расшифровки предоплаты.
	Запрос = Новый Запрос;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|	РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|	РасчетыСПоставщикамиОстатки.ДокументДата КАК ДокументДата,
	|	РасчетыСПоставщикамиОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщикамиОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПоставщикамиОстатки.Договор КАК Договор,
	|		РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|		РасчетыСПоставщикамиОстатки.Документ.Дата КАК ДокументДата,
	|		РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|				&ПериодГраница,
	|				Организация = &Организация
	|					И Контрагент = &Контрагент
	|					И Договор = &Договор
	|					И Заказ В (&Заказ)
	|					И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК РасчетыСПоставщикамиОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаРасчетыСПоставщиками.Договор,
	|		ДвиженияДокументаРасчетыСПоставщиками.Документ,
	|		ДвиженияДокументаРасчетыСПоставщиками.Документ.Дата,
	|		ДвиженияДокументаРасчетыСПоставщиками.Заказ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокументаРасчетыСПоставщиками
	|	ГДЕ
	|		ДвиженияДокументаРасчетыСПоставщиками.Регистратор = &Ссылка
	|		И ДвиженияДокументаРасчетыСПоставщиками.Период <= &Период
	|		И ДвиженияДокументаРасчетыСПоставщиками.Организация = &Организация
	|		И ДвиженияДокументаРасчетыСПоставщиками.Контрагент = &Контрагент
	|		И ДвиженияДокументаРасчетыСПоставщиками.Договор = &Договор
	|		И ДвиженияДокументаРасчетыСПоставщиками.Заказ В (&Заказ)
	|		И ДвиженияДокументаРасчетыСПоставщиками.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК РасчетыСПоставщикамиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиОстатки.Документ,
	|	РасчетыСПоставщикамиОстатки.Заказ,
	|	РасчетыСПоставщикамиОстатки.ДокументДата,
	|	РасчетыСПоставщикамиОстатки.Договор.ВалютаРасчетов
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаВалОстаток) < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|	РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|	РасчетыСПоставщикамиОстатки.ДокументДата КАК ДокументДата,
	|	РасчетыСПоставщикамиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаУчета) КАК СуммаУчета,
	|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаРасчетов) КАК СуммаРасчетов,
	|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаУчета / ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаРасчетов, 0) <> 0
	|				ТОГДА РасчетыСПоставщикамиОстатки.СуммаРасчетов
	|			ИНАЧЕ 1
	|		КОНЕЦ) * (РасчетыСПоставщикамиОстатки.КурсыВалютыУчетаКурс / РасчетыСПоставщикамиОстатки.КурсыВалютыУчетаКратность) КАК Курс,
	|	1 КАК Кратность,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыДокументаКурс КАК КурсыВалютыДокументаКурс,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыДокументаКратность КАК КурсыВалютыДокументаКратность
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПоставщикамиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	|		РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|		РасчетыСПоставщикамиОстатки.ДокументДата КАК ДокументДата,
	|		РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаУчета,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаРасчетов,
	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) * КурсыВалютыУчета.Курс * &КратностьВалютыДокумента / (&КурсВалютыДокумента * КурсыВалютыУчета.Кратность) КАК СуммаПлатежа,
	|		КурсыВалютыУчета.Курс КАК КурсыВалютыУчетаКурс,
	|		КурсыВалютыУчета.Кратность КАК КурсыВалютыУчетаКратность,
	|		&КурсВалютыДокумента КАК КурсыВалютыДокументаКурс,
	|		&КратностьВалютыДокумента КАК КурсыВалютыДокументаКратность
	|	ИЗ
	|		ВременнаяТаблицаРасчетыСПоставщикамиОстатки КАК РасчетыСПоставщикамиОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаУчета) КАК КурсыВалютыУчета
	|			ПО (ИСТИНА)) КАК РасчетыСПоставщикамиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиОстатки.Документ,
	|	РасчетыСПоставщикамиОстатки.Заказ,
	|	РасчетыСПоставщикамиОстатки.ДокументДата,
	|	РасчетыСПоставщикамиОстатки.ВалютаРасчетов,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыУчетаКурс,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыУчетаКратность,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыДокументаКурс,
	|	РасчетыСПоставщикамиОстатки.КурсыВалютыДокументаКратность
	|
	|ИМЕЮЩИЕ
	|	-СУММА(РасчетыСПоставщикамиОстатки.СуммаРасчетов) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата";
	
	Запрос.УстановитьПараметр("Заказ", ТаблицаЗаказов.ВыгрузитьКолонку("Заказ"));
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ВалютаДокумента", ВалютаДокумента);
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ПериодГраница", Новый Граница(Дата, ВидГраницы.Включая)); //+++ Дмгг
	Если Договор.ВалютаРасчетов = ВалютаДокумента Тогда
		Запрос.УстановитьПараметр("КурсВалютыДокумента", Курс);
		Запрос.УстановитьПараметр("КратностьВалютыДокумента", Кратность);
	Иначе
		Запрос.УстановитьПараметр("КурсВалютыДокумента", 1);
		Запрос.УстановитьПараметр("КратностьВалютыДокумента", 1);
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = ТекстЗапроса;
	
	Предоплата.Очистить();
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
		
		НайденнаяСтрока = ТаблицаЗаказов.Найти(ВыборкаРезультатаЗапроса.Заказ, "Заказ");
		
		Если НайденнаяСтрока.ВсегоРасч = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыборкаРезультатаЗапроса.СуммаРасчетов <= НайденнаяСтрока.ВсегоРасч Тогда // сумма остатка меньше или равна чем осталось распределить
			
			НоваяСтрока = Предоплата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
			НайденнаяСтрока.ВсегоРасч = НайденнаяСтрока.ВсегоРасч - ВыборкаРезультатаЗапроса.СуммаРасчетов;
			
		Иначе // сумма остатка больше чем нужно распределить
			
			НоваяСтрока = Предоплата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
			НоваяСтрока.СуммаРасчетов = НайденнаяСтрока.ВсегоРасч;
			НоваяСтрока.СуммаПлатежа = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
				НоваяСтрока.СуммаРасчетов,
				ВыборкаРезультатаЗапроса.Курс,
				ВыборкаРезультатаЗапроса.КурсыВалютыДокументаКурс,
				ВыборкаРезультатаЗапроса.Кратность,
				ВыборкаРезультатаЗапроса.КурсыВалютыДокументаКратность
			);
			НайденнаяСтрока.ВсегоРасч = 0;
			
		КонецЕсли;
		
		//--------------------------------------------------------------------------
		// © Шишка В.В. [29 сентября 2021]  НАЧАЛО
		СтуктураЗаполнения = ПолучитьСтавкиНаСервере(НоваяСтрока.СуммаРасчетов);
		НоваяСтрока.СуммаНДФЛ = СтуктураЗаполнения.СуммаНДФЛ;
		НоваяСтрока.СуммаПФ = СтуктураЗаполнения.СуммаПФ;
		// © Шишка В.В. [29 сентября 2021]  КОНЕЦ
		//--------------------------------------------------------------------------
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПредоплату()

// Процедура заполнения документа на основании расходной накладной.
//
// Параметры:
//	ДокументОснование - ДокументСсылка.РасходнаяНакладная - расходная накладная
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоРасходнойНакладной(ДанныеЗаполнения) Экспорт
	
	// Заполнение шапки документа.
	Если ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
		ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
		ДисконтнаяКарта = ДанныеЗаполнения.ДисконтнаяКарта;
	ИначеЕсли ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию Тогда
		ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера;
	ИначеЕсли ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку Тогда
		ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика;
	ИначеЕсли ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение Тогда
		ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратСОтветхранения;
	Иначе
		ТекстИсключения = НСтр("ka='ოპერაცია ""შემოსავლების"" შეყვანა შეუძლებელია ოპერაცია ""%ВидОперации"" საფუძველზე!';ru='Невозможен ввод операции ""Поступления"" на основании операции - ""%ВидОперации""!';en='You can not enter the operation ""Income"" on the basis of the operation - ""% VidOperatsii""!'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ВидОперации", ДанныеЗаполнения.ВидОперации);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке 
		И УправлениеНебольшойФирмойПовтИсп.РеквизитВШапке("ПоложениеЗаказаПоставщикуВДокументахПоступления") Тогда
		Заказ = ДанныеЗаполнения.Заказ;
	Иначе
		Заказ = Неопределено;
	КонецЕсли;
	
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Договор = ДанныеЗаполнения.Договор;
	СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
	Ячейка = ДанныеЗаполнения.Ячейка;
	ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
	НДСВключатьВСтоимость = ДанныеЗаполнения.НДСВключатьВСтоимость;
	НалогообложениеНДС = ДанныеЗаполнения.НалогообложениеНДС;
	
	Курс = ДанныеЗаполнения.Курс;
	Кратность = ДанныеЗаполнения.Кратность;
	
	// Заполнение табличной части документа.
	Запасы.Очистить();
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Запасы Цикл
		
		Если СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
		
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
			
			Если НЕ ДанныеЗаполнения.ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке
				И УправлениеНебольшойФирмойПовтИсп.РеквизитВШапке("ПоложениеЗаказаПоставщикуВДокументахПоступления") Тогда
				НоваяСтрока.Заказ = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ЭтотОбъект, ДанныеЗаполнения);
	
	//+++
	//Заполнение таблицы "Предоплаты"
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная")
		И ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю
		И ДанныеЗаполнения.Предоплата.Количество() > 0 Тогда 
		
		Для Каждого СтрокаПредоплаты Из ДанныеЗаполнения.Предоплата Цикл 
			СтрокаТЧ_Предоплаты = Предоплата.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ_Предоплаты, СтрокаПредоплаты);
		КонецЦикла;
		
	КонецЕсли;
	//---
		
КонецПроцедуры // ЗаполнитьПоРасходнаяНакладная()

// Процедура заполнения документа на основании заказа покупателя.
//
// Параметры:
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения) Экспорт
	
	Если УправлениеНебольшойФирмойПовтИсп.РеквизитВШапке("ПоложениеЗаказаПоставщикуВДокументахПоступления") Тогда
		Заказ = ДанныеЗаполнения;
	Иначе
		Заказ = Неопределено;
	КонецЕсли;
	
	// Заполнение шапки.
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, 
			Новый Структура("Организация, Ссылка, ВидОперации, Контрагент, Договор, ВалютаДокумента, НалогообложениеНДС, СуммаВключаетНДС, НДСВключатьВСтоимость, Курс, Кратность, СостояниеЗаказа, ВариантЗавершения, Проведен, ОжидаетсяВыборВариантаКП"));
			
	ЗначенияРеквизитов.Вставить("ЗаказНарядВозврат");
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(ДанныеЗаполнения, ЗначенияРеквизитов);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитов, "Организация, Контрагент, Договор, ВалютаДокумента, НалогообложениеНДС, СуммаВключаетНДС, НДСВключатьВСтоимость, Курс, Кратность");
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения;
	
	Если НЕ ВалютаДокумента = Константы.НациональнаяВалюта.Получить() Тогда
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()), Новый Структура("Валюта", Договор.ВалютаРасчетов));
		Курс = СтруктураПоВалюте.Курс;
		Кратность = СтруктураПоВалюте.Кратность;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		
		ВидЦенКонтрагента = Договор.ВидЦенКонтрагента;
		РегистрироватьЦеныПоставщика = Истина;
		
	КонецЕсли;
	
	// Заполнение табличной части.
	Запасы.Очистить();
	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПереработку Тогда
		ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемВПереработку;
		НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		ЗаполнитьПоЗаказуПокупателяНаПереработку(ДанныеЗаполнения);
	ИначеЕсли ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
		ЗаполнитьПоЗаказНаряду(ДанныеЗаполнения);
		ДисконтнаяКарта = ДанныеЗаполнения.ДисконтнаяКарта;
	Иначе
		ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
		ЗаполнитьПоЗаказуПокупателяНаПродажу(ДанныеЗаполнения);
		ДисконтнаяКарта = ДанныеЗаполнения.ДисконтнаяКарта;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоЗаказПокупателя()

// Процедура заполнения документа на основании заказа покупателя.
//
// Параметры:
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоЗаказуПокупателяНаПереработку(ДанныеЗаполнения)
	
		Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,
	Новый Структура("Организация, Ссылка, ВидОперации, Старт, ДатаОтгрузки, СостояниеЗаказа, Проведен, ОжидаетсяВыборВариантаКП"));

	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(ДанныеЗаполнения, ЗначенияРеквизитов);

	
	Организация = ЗначенияРеквизитов.Организация;
	ЗаказПокупателя = ЗначенияРеквизитов.Ссылка;
	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		ДатаПоступления = ЗначенияРеквизитов.Старт;
	Иначе
		ДатаПоступления = ЗначенияРеквизитов.ДатаОтгрузки;
	КонецЕсли;	
	
	
	// Заполнение табличной части.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.Характеристика КАК Характеристика,
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыОстатки.Характеристика КАК Характеристика,
	|		ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗаказыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗапасыОстатки.Номенклатура,
	|		ЗапасыОстатки.Характеристика,
	|		-ЗапасыОстатки.КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗапасыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РазмещениеОстатки.Номенклатура,
	|		РазмещениеОстатки.Характеристика,
	|		-РазмещениеОстатки.КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказов.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК РазмещениеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаРазмещениеЗаказов.Номенклатура,
	|		ДвиженияДокументаРазмещениеЗаказов.Характеристика,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРазмещениеЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказов КАК ДвиженияДокументаРазмещениеЗаказов
	|	ГДЕ
	|		ДвиженияДокументаРазмещениеЗаказов.Регистратор = &Ссылка
	|		И ДвиженияДокументаРазмещениеЗаказов.ЗаказПокупателя = &ДокументОснование) КАК ЗаказыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыОстатки.Номенклатура,
	|	ЗаказыОстатки.Характеристика
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ЗаказПокупателяЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Старт
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ДатаОтгрузки
	|	КОНЕЦ КАК ЗапасыДатаПоступления,
	|	ЗаказПокупателяЗапасы.СтавкаНДС,
	|	СУММА(ЗаказПокупателяЗапасы.Количество) КАК Количество,
	|	ЗаказПокупателяЗапасы.Спецификация
	|ИЗ
	|	ВТЗаказПокупателяЗапасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяЗапасы.Номенклатура,
	|	ЗаказПокупателяЗапасы.Характеристика,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	|	ЗаказПокупателяЗапасы.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Старт
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ДатаОтгрузки
	|	КОНЕЦ,
	|	ЗаказПокупателяЗапасы.Спецификация
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(ДанныеЗаполнения, Запрос.МенеджерВременныхТаблиц, Ложь);
	
	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		

	
	Запрос.Текст = Запрос.Текст + "; " +
	"ВЫБРАТЬ
	|	ПотребностьОстатки.Номенклатура КАК Номенклатура,
	|	ПотребностьОстатки.Характеристика КАК Характеристика,
	|	СУММА(ПотребностьОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПотребностьОстатки.Номенклатура КАК Номенклатура,
	|		ПотребностьОстатки.Характеристика КАК Характеристика,
	|		ПотребностьОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ПотребностьВЗапасах.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженийЗапасов.Поступление)) КАК ПотребностьОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаПотребностьВЗапасах.Номенклатура,
	|		ДвиженияДокументаПотребностьВЗапасах.Характеристика,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаПотребностьВЗапасах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаПотребностьВЗапасах.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаПотребностьВЗапасах.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ПотребностьВЗапасах КАК ДвиженияДокументаПотребностьВЗапасах
	|	ГДЕ
	|		ДвиженияДокументаПотребностьВЗапасах.Регистратор = &Ссылка
	|		И ДвиженияДокументаПотребностьВЗапасах.ЗаказПокупателя = &ДокументОснование) КАК ПотребностьОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьОстатки.Номенклатура,
	|	ПотребностьОстатки.Характеристика
	|
	|ИМЕЮЩИЕ
	|	СУММА(ПотребностьОстатки.КоличествоОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ЗаказПокупателяМатериалыЗаказчика.НомерСтроки) КАК НомерСтроки,
	|	ЗаказПокупателяМатериалыЗаказчика.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяМатериалыЗаказчика.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ЗаказПокупателяМатериалыЗаказчика.Характеристика КАК Характеристика,
	|	ЗаказПокупателяМатериалыЗаказчика.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяМатериалыЗаказчика.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяМатериалыЗаказчика.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяМатериалыЗаказчика.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|			ТОГДА ЗаказПокупателяМатериалыЗаказчика.Ссылка.Организация.СтавкаНДСПоУмолчанию
	|		ИНАЧЕ ЗаказПокупателяМатериалыЗаказчика.Номенклатура.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС,
	|	ЗаказПокупателяМатериалыЗаказчика.Ссылка КАК Заказ,
	|	СУММА(ЗаказПокупателяМатериалыЗаказчика.Количество) КАК Количество
	|ИЗ
	|	Документ.ЗаказПокупателя.МатериалыЗаказчика КАК ЗаказПокупателяМатериалыЗаказчика
	|ГДЕ
	|	ЗаказПокупателяМатериалыЗаказчика.Ссылка = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяМатериалыЗаказчика.Номенклатура,
	|	ЗаказПокупателяМатериалыЗаказчика.Характеристика,
	|	ЗаказПокупателяМатериалыЗаказчика.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяМатериалыЗаказчика.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяМатериалыЗаказчика.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ,
	|	ЗаказПокупателяМатериалыЗаказчика.Ссылка,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяМатериалыЗаказчика.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|			ТОГДА ЗаказПокупателяМатериалыЗаказчика.Ссылка.Организация.СтавкаНДСПоУмолчанию
	|		ИНАЧЕ ЗаказПокупателяМатериалыЗаказчика.Номенклатура.СтавкаНДС
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
	ТаблицаОстатков.Индексы.Добавить("Номенклатура,Характеристика");
	
	Запасы.Очистить();
	Если ТаблицаОстатков.Количество() > 0 Тогда
		
		Выборка = МассивРезультатов[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтруктураДляПоиска = Новый Структура;
			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
			
			МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
			Если МассивСтрокОстатков.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
//--------------			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			КоличествоКСписанию = Выборка.Количество * Выборка.Коэффициент;
			МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоКСписанию;
			Если МассивСтрокОстатков[0].КоличествоОстаток < 0 Тогда
				
				НоваяСтрока.Количество = (КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент;
				
			КонецЕсли;
			
			НоваяСтрока.Заказ = Выборка.ЗапасыДатаПоступления;
			Если Заказ <> НоваяСтрока.Заказ Тогда
				ПоложениеДатыПоступленияВШапке = Ложь;
			КонецЕсли;
	
			
			Если МассивСтрокОстатков[0].КоличествоОстаток <= 0 Тогда
				ТаблицаОстатков.Удалить(МассивСтрокОстатков[0]);
			КонецЕсли;
			
			
		КонецЦикла;
		
	КонецЕсли;

	
КонецПроцедуры // ЗаполнитьПоЗаказПокупателяНаПереработку()

// Процедура заполнения документа на основании заказа покупателя.
//
// Параметры:
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоЗаказуПокупателяНаПродажу(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.Характеристика КАК Характеристика,
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыОстатки.Характеристика КАК Характеристика,
	|		ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗаказыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗаказыПокупателей.Номенклатура,
	|		ДвиженияДокументаЗаказыПокупателей.Характеристика,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗаказыПокупателей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗаказыПокупателей.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗаказыПокупателей.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей КАК ДвиженияДокументаЗаказыПокупателей
	|	ГДЕ
	|		ДвиженияДокументаЗаказыПокупателей.Регистратор = &Ссылка
	|		И ДвиженияДокументаЗаказыПокупателей.ЗаказПокупателя = &ДокументОснование) КАК ЗаказыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыОстатки.Номенклатура,
	|	ЗаказыОстатки.Характеристика
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяЗапасы.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ЗаказПокупателяЗапасы.Партия КАК Партия,
	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ЗаказПокупателяЗапасы.Количество КАК Количество,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказПокупателяЗапасы.Цена КАК Цена,
	|	ЗаказПокупателяЗапасы.Сумма КАК Сумма,
	|	ЗаказПокупателяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказПокупателяЗапасы.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателяЗапасы.Всего КАК Всего,
	|	ЗаказПокупателяЗапасы.Содержание КАК Содержание,
	|	ЗаказПокупателяЗапасы.Ссылка КАК Заказ
	|ИЗ
	|	ВТЗаказПокупателяЗапасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(ДанныеЗаполнения, Запрос.МенеджерВременныхТаблиц, Истина);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
	ТаблицаОстатков.Индексы.Добавить("Номенклатура,Характеристика");
	
	Выборка = МассивРезультатов[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДляПоиска = Новый Структура;
		СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
		
		МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
		Если МассивСтрокОстатков.Количество() = 0 Тогда
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) = Выборка.Количество Тогда
			
			Продолжить;
			
		ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) > Выборка.Количество Тогда
			
			МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - Выборка.Количество * Выборка.Коэффициент;
			Продолжить;
			
		ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) < Выборка.Количество Тогда
			
			КоличествоКСписанию = -1 * (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент - Выборка.Количество);
			МассивСтрокОстатков[0].КоличествоОстаток = 0;
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			СтруктураДанных = УправлениеНебольшойФирмойСервер.ПолучитьСуммуСтрокиТабличнойЧасти(
				Новый Структура("Количество, Цена, Сумма, СтавкаНДС, СуммаНДС, СуммаВключаетНДС, Всего",
					КоличествоКСписанию, Выборка.Цена, 0, Выборка.СтавкаНДС, 0, СуммаВключаетНДС, 0));
					
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоЗаказПокупателяНаПродажу()

// Процедура заполнения документа на основании заказ-наряд.
//
// Параметры:
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоЗаказНаряду(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяЗапасы.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ЗаказПокупателяЗапасы.Партия КАК Партия,
	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
	|	ЗаказПокупателяЗапасы.Количество КАК Количество,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказПокупателяЗапасы.Цена КАК Цена,
	|	ЗаказПокупателяЗапасы.Сумма КАК Сумма,
	|	ЗаказПокупателяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказПокупателяЗапасы.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателяЗапасы.Всего КАК Всего,
	|	ЗаказПокупателяЗапасы.Содержание КАК Содержание,
	|	ЗаказПокупателяЗапасы.Ссылка КАК Заказ
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Ссылка = &ДокументОснование
	|	И ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
	КонецЕсли;
	
	РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры // ЗаполнитьПоЗаказНаряд()

// Процедура заполнения документа на основании заказа поставщику.
//
// Параметры:
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоЗаказуПоставщику(ДанныеЗаполнения) Экспорт
	
	// Основание и настройка документа.
	МассивЗаказов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("МассивЗаказовПоставщикам") Тогда
		МассивЗаказов = ДанныеЗаполнения.МассивЗаказовПоставщикам;
		ПоложениеЗаказаПоставщику = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
	Иначе
		МассивЗаказов.Добавить(ДанныеЗаполнения.Ссылка);
		ПоложениеЗаказаПоставщику = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ПоложениеЗаказаПоставщикуВДокументахПоступления");
		Если НЕ ЗначениеЗаполнено(ПоложениеЗаказаПоставщику) Тогда
			ПоложениеЗаказаПоставщику = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
		КонецЕсли;
		Если ПоложениеЗаказаПоставщику = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
			Заказ = ДанныеЗаполнения;
		КонецЕсли;
	КонецЕсли;
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())); //+++ Дмгг
	
	// Заполнение шапки.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка КАК ОснованиеСсылка,
	|	ЗаказПоставщику.Проведен КАК ОснованиеПроведен,
	|	ЗаказПоставщику.СостояниеЗаказа КАК СостояниеЗаказа,
	|	ЗаказПоставщику.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗаказПоставщику.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаРасход,
	|	ЗаказПоставщику.Организация КАК Организация,
	|	ЗаказПоставщику.Контрагент КАК Контрагент,
	|	ЗаказПоставщику.Договор КАК Договор,
	|	ЗаказПоставщику.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗаказПоставщику.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЗаказПоставщику.НДСВключатьВСтоимость КАК НДСВключатьВСтоимость,
	|	ЗаказПоставщику.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщику.ВидЦенКонтрагента = ЗНАЧЕНИЕ(Справочник.ВидыЦенКонтрагентов.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщику.Договор.ВидЦенКонтрагента
	|		ИНАЧЕ ЗаказПоставщику.ВидЦенКонтрагента
	|	КОНЕЦ КАК ВидЦенКонтрагента,
	|	Истина КАК РегистрироватьЦеныПоставщика,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщику.ВалютаДокумента = НациональнаяВалюта.Значение
	|			ТОГДА ЗаказПоставщику.Курс
	|		ИНАЧЕ КурсыВалютСрезПоследних.Курс
	|	КОНЕЦ КАК Курс,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщику.ВалютаДокумента = НациональнаяВалюта.Значение
	|			ТОГДА ЗаказПоставщику.Кратность
	|		ИНАЧЕ КурсыВалютСрезПоследних.Кратность
	|	КОНЕЦ КАК Кратность
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютСрезПоследних
	|		ПО ЗаказПоставщику.Договор.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта},
	|	Константа.НациональнаяВалюта КАК НациональнаяВалюта
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В(&МассивЗаказов)";
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("ДатаДокумента", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗначенияПроверяемыхРеквизитов = Новый Структура("СостояниеЗаказа, Проведен", Выборка.СостояниеЗаказа, Выборка.ОснованиеПроведен);
		Документы.ЗаказПоставщику.ПроверитьВозможностьВводаНаОснованииЗаказаПоставщику(Выборка.ОснованиеСсылка, ЗначенияПроверяемыхРеквизитов);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	Если МассивЗаказов.Количество() = 1 Тогда
		ЭтотОбъект.ДокументОснование = МассивЗаказов[0];
	КонецЕсли;
	
	// Заполнение документа.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.Характеристика КАК Характеристика,
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыОстатки.Характеристика КАК Характеристика,
	|		ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|				,
	|				ЗаказПоставщику В (&МассивЗаказов)
	|					И (Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|						ИЛИ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))) КАК ЗаказыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗаказыПоставщикам.ЗаказПоставщику,
	|		ДвиженияДокументаЗаказыПоставщикам.Номенклатура,
	|		ДвиженияДокументаЗаказыПоставщикам.Характеристика,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗаказыПоставщикам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗаказыПоставщикам.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗаказыПоставщикам.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам КАК ДвиженияДокументаЗаказыПоставщикам
	|	ГДЕ
	|		ДвиженияДокументаЗаказыПоставщикам.Регистратор = &Ссылка) КАК ЗаказыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыОстатки.ЗаказПоставщику,
	|	ЗаказыОстатки.Номенклатура,
	|	ЗаказыОстатки.Характеристика
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗаказПоставщикуЗапасы.Ссылка.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗаказПоставщикуЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаРасход,
	|	ЗаказПоставщикуЗапасы.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуЗапасы.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ЗаказПоставщикуЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	//+++ Дмгг
	//|	ЗаказПоставщикуЗапасы.Номенклатура.СчетУчетаЗатрат.ТипСчета КАК ТипСчета,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|			ТОГДА ЗаказПоставщикуЗапасы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета
	|		ИНАЧЕ ЗаказПоставщикуЗапасы.Номенклатура.СчетУчетаЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчета,
	//--- Дмгг
	|	ЗаказПоставщикуЗапасы.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПоставщикуЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПоставщикуЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ЗаказПоставщикуЗапасы.Количество КАК Количество,
	|	ЗаказПоставщикуЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказПоставщикуЗапасы.Цена КАК Цена,
	|	ЗаказПоставщикуЗапасы.Сумма КАК Сумма,
	|	ЗаказПоставщикуЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказПоставщикуЗапасы.СуммаНДС КАК СуммаНДС,
	|	ЗаказПоставщикуЗапасы.Всего КАК Всего,
	|	ЗаказПоставщикуЗапасы.Содержание КАК Содержание,
	|	ЗаказПоставщикуЗапасы.Ссылка КАК ЗаказОснование,
	|	ЗаказПоставщикуЗапасы.ПроцентСкидкиНаценки
	|ИЗ
	|	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
	|ГДЕ
	|	ЗаказПоставщикуЗапасы.Ссылка В(&МассивЗаказов)
	|	И (ЗаказПоставщикуЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ИЛИ ЗаказПоставщикуЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас))
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("ДатаДокумента", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", ИспользоватьТолькоРегламентированныйПланСчетов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
	ТаблицаОстатков.Индексы.Добавить("ЗаказПоставщику,Номенклатура,Характеристика");
	
	Запасы.Очистить();
	Расходы.Очистить();
	пСтавкаНДФЛ = Договор.ВидУдержанияНДФЛ.СтавкаНДФЛ;//Паганини
	Если ТаблицаОстатков.Количество() > 0 Тогда
		Выборка = МассивРезультатов[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтруктураДляПоиска = Новый Структура;
			СтруктураДляПоиска.Вставить("ЗаказПоставщику", Выборка.ЗаказОснование);
			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
			
			МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
			Если МассивСтрокОстатков.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Выборка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				НоваяСтрока = Расходы.Добавить();
				НоваяСтрока.ЗаказПоставщику = Выборка.ЗаказОснование;
				НоваяСтрока.СтруктурнаяЕдиница = Выборка.СтруктурнаяЕдиницаРасход;
				Если ЗначениеЗаполнено(Выборка.ЗаказПокупателя)
					И (Выборка.ТипСчета = Перечисления.ТипыСчетов.Расходы
					ИЛИ Выборка.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
					ИЛИ Выборка.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство) Тогда
					НоваяСтрока.Заказ = Выборка.ЗаказПокупателя;
				КонецЕсли;
				//Паганини_
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.СуммаБезНалогов = ?(СуммаВключаетНДС, НоваяСтрока.Сумма - НоваяСтрока.СуммаНДС, НоваяСтрока.Сумма);
				Если Договор.УчитыватьНДФЛ Тогда
					Если СуммаВключаетНДС Тогда
						НоваяСтрока.СуммаНДФЛ	= Окр(НоваяСтрока.Сумма/(1-пСтавкаНДФЛ/100), 2)-НоваяСтрока.Сумма;
						НоваяСтрока.Всего		= НоваяСтрока.Сумма + НоваяСтрока.СуммаНДФЛ;
					Иначе
						НоваяСтрока.СуммаНДФЛ	= Окр((НоваяСтрока.Сумма+НоваяСтрока.СуммаНДС)*(пСтавкаНДФЛ/100)/(1-пСтавкаНДФЛ/100), 2);
						НоваяСтрока.Всего		= НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС + НоваяСтрока.СуммаНДФЛ;
					КонецЕсли;
					НоваяСтрока.ВидУдержанияНДФЛ			= Договор.ВидУдержанияНДФЛ;
				КонецЕсли;
				//_Паганини
			Иначе
				НоваяСтрока = Запасы.Добавить();
				НоваяСтрока.Заказ = Выборка.ЗаказОснование;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);//Паганини
			КонецЕсли;
			//ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);//Паганини
			
			КоличествоКСписанию = Выборка.Количество * Выборка.Коэффициент;
			МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоКСписанию;
			Если МассивСтрокОстатков[0].КоличествоОстаток < 0 Тогда
				
				КоличествоКСписанию = (КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент;
				
				СтруктураДанных = УправлениеНебольшойФирмойСервер.ПолучитьСуммуСтрокиТабличнойЧасти(
					Новый Структура("Количество, Цена, Сумма, СтавкаНДС, СуммаНДС, СуммаВключаетНДС, Всего",
						КоличествоКСписанию, Выборка.Цена, 0, Выборка.СтавкаНДС, 0, СуммаВключаетНДС, 0));
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных);
				
			КонецЕсли;
			
			Если МассивСтрокОстатков[0].КоличествоОстаток <= 0 Тогда
				ТаблицаОстатков.Удалить(МассивСтрокОстатков[0]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоЗаказПоставщику()




Процедура ЗаполнитьПоДокументЗапроса(ДанныеЗаполнения) Экспорт
	
	// Заполнение шапки документа.
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
	Организация = ДанныеЗаполнения.Организация;
	СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
	Комментарий = ДанныеЗаполнения.Комментарий; 
	//ЗапасыИзменениеСтрокДействие
	
	//Запасы;
	//Контрагент = ДанныеЗаполнения.Контрагент;
	//	Договор = ДанныеЗаполнения.Договор;
	
	// Заполнение табличной части документа.
	Запасы.Очистить();
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Запасы Цикл
		Если СтрокаТабличнойЧасти.ПередатьВЗаказ Тогда 
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
			
			НоваяСтрока.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
			
			РассчитатьСуммуВСтрокеТабличнойЧасти(НоваяСтрока);
		КонецЕсли;
		Если ПолучитьФункциональнуюОпцию("УчетГТД") Тогда
			
			НоваяСтрока.СтранаПроисхождения = НоваяСтрока.Номенклатура.СтранаПроисхождения;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры


Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ИмяПоля = "")//Паганини Добавленн параметр #3
	
	//Если СтрокаТабличнойЧасти = Неопределено Тогда
	//	СтрокаТабличнойЧасти = Запасы.ТекущиеДанные;
	//КонецЕсли;
	
	Если ИмяПоля = "" Тогда//Паганини
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	
	//Если ИмяТабличнойЧасти = "Запасы" Тогда
		
		//Скидки
		Если СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100 Тогда
			
			СтрокаТабличнойЧасти.Сумма = 0;
			
		ИначеЕсли НЕ СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 0
			И НЕ СтрокаТабличнойЧасти.Количество = 0 Тогда
			
			СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма * (1 - СтрокаТабличнойЧасти.ПроцентСкидкиНаценки / 100);
			
		КонецЕсли;
 
	КонецЕсли;
	
	//+++ Дмгг
	//Если ИмяТабличнойЧасти = "Запасы" Тогда 
	//	СтрокаТабличнойЧасти.Себестоимость = СтрокаТабличнойЧасти.СебестоимостьЕдиницы * СтрокаТабличнойЧасти.Количество;
	//КонецЕсли;
	//--- Дмгг
	
	//ОбновитьПодвалФормы();
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()









// Процедура заполнения документа на основании приходного ордера.
//
// Параметры:
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоПриходномуОрдеру(ДанныеЗаполнения) Экспорт
	
	// Заполнение шапки документа.
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
	ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
	Организация = ДанныеЗаполнения.Организация;
	СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
	Ячейка = ДанныеЗаполнения.Ячейка;
	НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Договор = ДанныеЗаполнения.Договор;
	
	// Заполнение табличной части документа.
	Запасы.Очистить();
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Запасы Цикл
		
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		
		НоваяСтрока.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
		
		Если ПолучитьФункциональнуюОпцию("УчетГТД") Тогда
			
			НоваяСтрока.СтранаПроисхождения = НоваяСтрока.Номенклатура.СтранаПроисхождения;
			
		КонецЕсли;
		
	КонецЦикла;
	
	РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры // ЗаполнитьПоПриходныйОрдер()

// Процедура заполнения документа на основании заказа поставщику.
//
// Параметры:
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоСчетуНаОплатуПоставщика(ДанныеЗаполнения) Экспорт
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())); //+++ Дмгг
	
	// Заполнение шапки документа.
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
	ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
	
	Если УправлениеНебольшойФирмойПовтИсп.РеквизитВШапке("ПоложениеЗаказаПоставщикуВДокументахПоступления") Тогда
		Заказ = ДанныеЗаполнения.ДокументОснование;
	Иначе
		Заказ = Неопределено;
	КонецЕсли;
	
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Договор = ДанныеЗаполнения.Договор;
	ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
	НалогообложениеНДС = ДанныеЗаполнения.НалогообложениеНДС;
	
	ВидЦенКонтрагента = ДанныеЗаполнения.ВидЦенКонтрагента;
	Если НЕ ЗначениеЗаполнено(ВидЦенКонтрагента) Тогда
		ВидЦенКонтрагента = Договор.ВидЦенКонтрагента;
	КонецЕсли;
	
	РегистрироватьЦеныПоставщика = ЗначениеЗаполнено(ВидЦенКонтрагента);
	
	Если ВалютаДокумента = Константы.НациональнаяВалюта.Получить() Тогда
		Курс = ДанныеЗаполнения.Курс;
		Кратность = ДанныеЗаполнения.Кратность;
	Иначе
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Договор.ВалютаРасчетов));
		Курс = СтруктураПоВалюте.Курс;
		Кратность = СтруктураПоВалюте.Кратность;
	КонецЕсли;
	
	// Заполнение табличной части документа.
	Запасы.Очистить();
	Расходы.Очистить();
	пСтавкаНДФЛ = Договор.ВидУдержанияНДФЛ.СтавкаНДФЛ;//Паганини
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Запасы Цикл
		
		Если СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
			НоваяСтрока.Заказ = ДанныеЗаполнения.ДокументОснование;
			
			Если ПолучитьФункциональнуюОпцию("УчетГТД") Тогда
				
				НоваяСтрока.СтранаПроисхождения = СтрокаТабличнойЧасти.Номенклатура.СтранаПроисхождения;
				
			КонецЕсли;
			
		ИначеЕсли СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			
			НоваяСтрока = Расходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
			//Паганини_
			НоваяСтрока.СуммаБезНалогов = ?(СуммаВключаетНДС, НоваяСтрока.Сумма - НоваяСтрока.СуммаНДС, НоваяСтрока.Сумма);
			Если Договор.УчитыватьНДФЛ Тогда
				Если СуммаВключаетНДС Тогда
					НоваяСтрока.СуммаНДФЛ	= Окр(НоваяСтрока.Сумма/(1-пСтавкаНДФЛ/100), 2)-НоваяСтрока.Сумма;
					НоваяСтрока.Всего		= НоваяСтрока.Сумма + НоваяСтрока.СуммаНДФЛ;
				Иначе
					НоваяСтрока.СуммаНДФЛ	= Окр((НоваяСтрока.Сумма+НоваяСтрока.СуммаНДС)*(пСтавкаНДФЛ/100)/(1-пСтавкаНДФЛ/100), 2);
					НоваяСтрока.Всего		= НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС + НоваяСтрока.СуммаНДФЛ;
				КонецЕсли;
			КонецЕсли;
			//_Паганини
			НоваяСтрока.ЗаказПоставщику = ДанныеЗаполнения.ДокументОснование;
			
			//+++ Дмгг
			//ТипСчетаРасходы = НоваяСтрока.Номенклатура.СчетУчетаЗатрат.ТипСчета;
			Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
				ТипСчетаРасходы = НоваяСтрока.Номенклатура.СчетУчетаЗатратРегл.ТипСчета;
			Иначе
				ТипСчетаРасходы = НоваяСтрока.Номенклатура.СчетУчетаЗатрат.ТипСчета;
			КонецЕсли;
			//--- Дмгг
			
			Если ТипСчетаРасходы <> Перечисления.ТипыСчетов.Расходы
				И ТипСчетаРасходы <> Перечисления.ТипыСчетов.Доходы
				И ТипСчетаРасходы <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
				И ТипСчетаРасходы <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
				
				НоваяСтрока.Заказ = Неопределено;
				НоваяСтрока.СтруктурнаяЕдиница = Неопределено;
				
			Иначе
				
				НоваяСтрока.СтруктурнаяЕдиница = ДанныеЗаполнения.Подразделение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоЗаказПоставщику()

// Процедура заполнения документа на основании заказа поставщику.
//
// Параметры:
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоСчетуНаОплатуВозврат(ДанныеЗаполнения) Экспорт
	
	// Заполнение шапки документа.
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
	ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
		
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Договор = ДанныеЗаполнения.Договор;
	ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
	НалогообложениеНДС = ДанныеЗаполнения.НалогообложениеНДС;
	
	ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	
	Если ВалютаДокумента = Константы.НациональнаяВалюта.Получить() Тогда
		Курс = ДанныеЗаполнения.Курс;
		Кратность = ДанныеЗаполнения.Кратность;
	Иначе
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Договор.ВалютаРасчетов));
		Курс = СтруктураПоВалюте.Курс;
		Кратность = СтруктураПоВалюте.Кратность;
	КонецЕсли;
	
	// Заполнение табличной части документа.
	Запасы.Очистить();
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Запасы Цикл
		
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		НоваяСтрока.Заказ = ДанныеЗаполнения.ДокументОснование;
		
		Если ПолучитьФункциональнуюОпцию("УчетГТД") Тогда
			
			НоваяСтрока.СтранаПроисхождения = СтрокаТабличнойЧасти.Номенклатура.СтранаПроисхождения;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоЗаказПоставщику()

// Процедура заполнения документа на основании расходной накладной.
//
// Параметры:
//	ДокументОснование - ДокументСсылка.РасходнаяНакладная - расходная накладная
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоПриемуВРемонт(ДанныеЗаполнения) Экспорт
	
	// Заполнение шапки документа.
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
	ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
		
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Договор = ДанныеЗаполнения.Договор;
	ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
	НалогообложениеНДС = ДанныеЗаполнения.НалогообложениеНДС;
	
	Если ВалютаДокумента = Константы.НациональнаяВалюта.Получить() Тогда
		Курс = ДанныеЗаполнения.Курс;
		Кратность = ДанныеЗаполнения.Кратность;
	Иначе
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Договор.ВалютаРасчетов));
		Курс = СтруктураПоВалюте.Курс;
		Кратность = СтруктураПоВалюте.Кратность;
	КонецЕсли;
	
	// Заполнение табличной части документа.
	Запасы.Очистить();
		
	НоваяСтрока = Запасы.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеЗаполнения);
	НоваяСтрока.КлючСвязи = 1;
	НоваяСтрока.Количество = 1;
	НоваяСтрока.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ЕдиницаИзмерения");
	
	СерийныеНомера.Очистить();
	Если ЗначениеЗаполнено(ДанныеЗаполнения.СерийныйНомер) Тогда
		НоваяСтрокаСН = СерийныеНомера.Добавить();
		НоваяСтрокаСН.СерийныйНомер = ДанныеЗаполнения.СерийныйНомер;
		НоваяСтрокаСН.КлючСвязи = 1;
		
		НоваяСтрока.СерийныеНомера = РаботаССерийнымиНомерамиКлиентСервер.СтроковоеПредставлениеСерийныхНомеровСтроки(СерийныеНомера, НоваяСтрокаСН.КлючСвязи);
	КонецЕсли;
		
КонецПроцедуры // ЗаполнитьПоРасходнаяНакладная()

#Область РМК

// Процедура заполнения документа на основании расходной накладной.
//
// Параметры:
//	ДокументОснование - ДокументСсылка.РасходнаяНакладная - расходная накладная
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоЧекуККМ(ДанныеЗаполнения) Экспорт
	
	// Заполнение шапки документа.
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
	ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
	Заказ = Неопределено;
	ДисконтнаяКарта = ДанныеЗаполнения.ДисконтнаяКарта;
	
	ЭтотОбъект.ЧекККМ = ДанныеЗаполнения.Ссылка;
	Организация = ДанныеЗаполнения.Организация;
	СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
	ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
	НДСВключатьВСтоимость = ДанныеЗаполнения.НДСВключатьВСтоимость;
	НалогообложениеНДС = ДанныеЗаполнения.НалогообложениеНДС;
	// Заказы покупателей в Рознице
	Заказ = ДанныеЗаполнения.Заказ;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Если ЗначениеЗаполнено(Заказ) Тогда
		Договор = Заказ.Договор;
	КонецЕсли;
	// Конец Заказы покупателей в Рознице
	
	Курс = 1; // Чеки оформляются в валюте регламентированного учёта.
	Кратность = 1; // Чеки оформляются в валюте регламентированного учёта.
	
	// Заполнение табличной части документа.
	Запасы.Очистить();
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Запасы Цикл
		
		Если СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
		
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
			
		КонецЕсли;
		
	КонецЦикла;
	
	АкцизныеМарки.Очистить();
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.АкцизныеМарки Цикл
		
		НоваяСтрока = АкцизныеМарки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		
	КонецЦикла;
	
	РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры // ЗаполнитьПоРасходнаяНакладная()

#КонецОбласти

#Область ЕГАИС

// Процедура заполнения документа на основании ТТН ЕГАИС.
//
// Параметры:
//	ДокументОснование - ДокументСсылка.ТТНВходящаяЕГАИС - ТТН ЕГАИС
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоНакладнойЕГАИС(ТТНВходящаяЕГАИС) Экспорт

	ЭтотОбъект.ТоварыПоДаннымПоставщика.Очистить();
	ЭтотОбъект.Запасы.Очистить();
	
	ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТТНВходящаяЕГАИС.НомерТТН КАК НомерВходящегоДокумента,
	|	ТТНВходящаяЕГАИС.ДатаТТН КАК ДатаВходящегоДокумента,
	|	ТТНВходящаяЕГАИС.Ссылка КАК ТТНВходящаяЕГАИС,
	|	НастройкиОбменаЕГАИС.ТорговаяТочка КАК СтруктурнаяЕдиница,
	|	НастройкиОбменаЕГАИС.Организация КАК Организация,
	|	ИСТИНА КАК ПолученИзЕГАИС,
	|	ВЫБОР
	|		КОГДА ТТНВходящаяЕГАИС.Поставщик = &ПустаяСсылкаПоставщика
	|			ТОГДА ТТНВходящаяЕГАИС.Грузоотправитель
	|		ИНАЧЕ ТТНВходящаяЕГАИС.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	ТТНВходящаяЕГАИС.СуммаДокумента,
	|	ТТНВходящаяЕГАИС.ВидОперации
	|ПОМЕСТИТЬ ТаблицаВЗапросе
	|ИЗ
	|	Документ.ТТНВходящаяЕГАИС КАК ТТНВходящаяЕГАИС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиОбменаЕГАИС КАК НастройкиОбменаЕГАИС
	|		ПО ТТНВходящаяЕГАИС.Грузополучатель.Код = НастройкиОбменаЕГАИС.ИдентификаторФСРАР
	|ГДЕ
	|	ТТНВходящаяЕГАИС.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВЗапросе.НомерВходящегоДокумента,
	|	ТаблицаВЗапросе.ДатаВходящегоДокумента,
	|	ТаблицаВЗапросе.ТТНВходящаяЕГАИС,
	|	ТаблицаВЗапросе.ПолученИзЕГАИС,
	|	ВЫБОР
	|		КОГДА СоответствиеОрганизацийЕГАИС.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		ИНАЧЕ СоответствиеОрганизацийЕГАИС.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ТаблицаВЗапросе.СуммаДокумента,
	|	ТаблицаВЗапросе.ВидОперации,
	|	ТаблицаВЗапросе.Организация,
	|	ТаблицаВЗапросе.СтруктурнаяЕдиница
	|ИЗ
	|	ТаблицаВЗапросе КАК ТаблицаВЗапросе
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОрганизацийЕГАИС КАК СоответствиеОрганизацийЕГАИС
	|		ПО ТаблицаВЗапросе.Поставщик = СоответствиеОрганизацийЕГАИС.ОрганизацияЕГАИС";
	
	Запрос.УстановитьПараметр("Ссылка", ТТНВходящаяЕГАИС);
	Запрос.УстановитьПараметр("ПустаяСсылкаПоставщика", Справочники.КлассификаторОрганизацийЕГАИС.ПустаяСсылка());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЕсли;
	
	Если Выборка.ВидОперации = Перечисления.ВидыОперацийТТНВходящейЕГАИС.ВозвратОтПокупателя Тогда
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
	Иначе
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
	КонецЕсли;
	
	ЭтотОбъект.НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(ЭтотОбъект.Организация,, ЭтотОбъект.Дата);
	ЭтотОбъект.СуммаВключаетНДС    = Истина;
	ЭтотОбъект.НДСВключатьВСтоимость    = ЭтотОбъект.Организация.НДСВключатьВСтоимость;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Контрагент)
		И Не ЗначениеЗаполнено(ЭтотОбъект.Договор) Тогда
		СписокВидовДоговора = Новый СписокЗначений;
		СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоров.СПоставщиком);
		
		ЭтотОбъект.Договор = Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(ЭтотОбъект.Контрагент, ЭтотОбъект.Организация, СписокВидовДоговора);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.АлкогольнаяПродукция,
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.Количество,
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.Сумма,
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.Цена,
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.ИдентификаторУпаковки,
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаЕГАИС
	|ИЗ
	|	Документ.ТТНВходящаяЕГАИС.Товары КАК ТоварноТранспортнаяНакладнаяЕГАИСТовары
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяЕГАИСТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЕГАИС.АлкогольнаяПродукция,
	|	ТаблицаЕГАИС.Количество,
	|	ТаблицаЕГАИС.Сумма,
	|	ТаблицаЕГАИС.Цена,
	|	ТаблицаЕГАИС.ИдентификаторУпаковки,
	|	ТаблицаЕГАИС.ИдентификаторСтроки,
	|	СоответствиеНоменклатурыЕГАИС.Номенклатура,
	|	СоответствиеНоменклатурыЕГАИС.Характеристика,
	|	СоответствиеНоменклатурыЕГАИС.Упаковка,
	|	ВЫБОР
	|		КОГДА СоответствиеНоменклатурыЕГАИС.Номенклатура ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИскатьСоответствиеБезУпаковок
	|ПОМЕСТИТЬ ТаблицаСоответствий
	|ИЗ
	|	ТаблицаЕГАИС КАК ТаблицаЕГАИС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|		ПО ТаблицаЕГАИС.АлкогольнаяПродукция = СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция
	|			И ТаблицаЕГАИС.ИдентификаторУпаковки = СоответствиеНоменклатурыЕГАИС.ИдентификаторУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСоответствий.АлкогольнаяПродукция,
	|	ТаблицаСоответствий.Количество,
	|	ТаблицаСоответствий.Сумма,
	|	ТаблицаСоответствий.Цена,
	|	ТаблицаСоответствий.ИдентификаторУпаковки,
	|	ТаблицаСоответствий.ИдентификаторСтроки,
	|	ТаблицаСоответствий.Номенклатура,
	|	ТаблицаСоответствий.Характеристика,
	|	ТаблицаСоответствий.Упаковка,
	|	ТаблицаСоответствий.ИскатьСоответствиеБезУпаковок
	|ПОМЕСТИТЬ ТаблицаПодготовкаДополнительногоПоиска
	|ИЗ
	|	ТаблицаСоответствий КАК ТаблицаСоответствий
	|ГДЕ
	|	ТаблицаСоответствий.ИскатьСоответствиеБезУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДополнительногноПоиска.АлкогольнаяПродукция,
	|	ВЫБОР
	|		КОГДА СоответствиеНоменклатурыЕГАИС.Упаковка = &УпаковкиПустоеЗначение
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПараметрРанжирования,
	|	СоответствиеНоменклатурыЕГАИС.Номенклатура,
	|	СоответствиеНоменклатурыЕГАИС.Упаковка КАК ЕдиницаИзмерения
	|ИЗ
	|	ТаблицаПодготовкаДополнительногоПоиска КАК ТаблицаДополнительногноПоиска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|		ПО ТаблицаДополнительногноПоиска.АлкогольнаяПродукция = СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПараметрРанжирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСоответствий.АлкогольнаяПродукция,
	|	ТаблицаСоответствий.Количество,
	|	ТаблицаСоответствий.Сумма,
	|	ТаблицаСоответствий.Цена,
	|	ТаблицаСоответствий.ИдентификаторУпаковки,
	|	ТаблицаСоответствий.ИдентификаторСтроки,
	|	ТаблицаСоответствий.Номенклатура,
	|	ТаблицаСоответствий.Характеристика,
	|	ТаблицаСоответствий.Упаковка КАК ЕдиницаИзмерения,
	|	ТаблицаСоответствий.Номенклатура.ЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения,
	|	ТаблицаСоответствий.ИскатьСоответствиеБезУпаковок
	|ИЗ
	|	ТаблицаСоответствий КАК ТаблицаСоответствий";
	
	Запрос.УстановитьПараметр("Ссылка", ТТНВходящаяЕГАИС);
	Запрос.УстановитьПараметр("УпаковкиПустоеЗначение", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаДанныеЕГАИС = Результат[4].Выгрузить();
	ТаблицаДополнительныхДанные = Результат[3].Выгрузить();
	
	Для каждого СтрокаДанныхЕГАИС Из ТаблицаДанныеЕГАИС Цикл
		СтрокаТаблицы = ЭтотОбъект.ТоварыПоДаннымПоставщика.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаДанныхЕГАИС);
		
		Если СтрокаДанныхЕГАИС.ИскатьСоответствиеБезУпаковок Тогда
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("АлкогольнаяПродукция", СтрокаДанныхЕГАИС.АлкогольнаяПродукция);
			
			МассивСтрок = ТаблицаДополнительныхДанные.НайтиСтроки(СтруктураПоиска);
			
			Если МассивСтрок.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, МассивСтрок[0]);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
			СтрокаТаблицы.ЕдиницаИзмерения = СтрокаДанныхЕГАИС.БазоваяЕдиницаИзмерения;
		КонецЕсли;
		
		Если ЭтотОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура.СтавкаНДС) Тогда
				СтрокаТаблицы.СтавкаНДС = СтрокаТаблицы.Номенклатура.СтавкаНДС;
			Иначе
				СтрокаТаблицы.СтавкаНДС = ЭтотОбъект.Организация.СтавкаНДСПоУмолчанию;
			КонецЕсли;
			
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
			СтрокаТаблицы.СуммаНДС = ?(ЭтотОбъект.СуммаВключаетНДС, СтрокаТаблицы.Сумма - (СтрокаТаблицы.Сумма) / ((СтавкаНДС + 100) / 100), СтрокаТаблицы.Сумма * СтавкаНДС / 100);
			СтрокаТаблицы.Всего = СтрокаТаблицы.Сумма + ?(ЭтотОбъект.СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
			
		Иначе
			
			Если ЭтотОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда	
				СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
			Иначе
				СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
			КонецЕсли;	
			
			СтрокаТаблицы.СтавкаНДС = СтавкаНДСПоУмолчанию;
			СтрокаТаблицы.СуммаНДС = 0;
			
			СтрокаТаблицы.Всего = СтрокаТаблицы.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоНакладнойЕГАИС()

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ПриКопировании объекта.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	ТоварыПоДаннымПоставщика.Очистить();
	ЕстьРасхождения  = Ложь;
	ПолученИзЕГАИС   = Ложь;
	АктПереданВЕГАИС = Ложь;
	АдресЧекаЕГАИС = "";
	ПодписьЧекаЕГАИС = "";
	
	ТоварноТранспортнаяНакладнаяЕГАИС = Документы.ТТНВходящаяЕГАИС.ПустаяСсылка();
	
	УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ОчиститьДатуНомерВходящегоДокумента(ЭтотОбъект);
	Предоплата.Очистить();
	
КонецПроцедуры // ПриКопировании()

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	СтратегияЗаполнения[Тип("ДокументСсылка.РасходнаяНакладная")] = "ЗаполнитьПоРасходнойНакладной";
	СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
	СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПоставщику")] = "ЗаполнитьПоЗаказуПоставщику";
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходныйОрдер")] = "ЗаполнитьПоПриходномуОрдеру";
	СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплатуПоставщика")] = "ЗаполнитьПоСчетуНаОплатуПоставщика";
	СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплату")] = "ЗаполнитьПоСчетуНаОплатуВозврат";
	СтратегияЗаполнения[Тип("ДокументСсылка.ЧекККМ")] = "ЗаполнитьПоЧекуККМ";
	СтратегияЗаполнения[Тип("ДокументСсылка.ТТНВходящаяЕГАИС")] = "ЗаполнитьПоНакладнойЕГАИС";
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриемИПередачаВРемонт")] = "ЗаполнитьПоПриемуВРемонт";
	//Rajak
	СтратегияЗаполнения[Тип("ДокументСсылка.ДокументЗапроса")] = "ЗаполнитьПоДокументЗапроса";
	//Rajak
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
	РегистрироватьЦеныПоставщика = ЗначениеЗаполнено(ВидЦенКонтрагента);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())); //+++ Дмгг
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПоложениеЗаказаПоставщику = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		Для каждого СтрокаТабличнойЧасти Из Запасы Цикл
			СтрокаТабличнойЧасти.Заказ = ?(ЗначениеЗаполнено(Заказ), Заказ, Неопределено);
		КонецЦикла;
		Если Контрагент.ВестиРасчетыПоЗаказам Тогда
			Для каждого СтрокаТабличнойЧасти Из Предоплата Цикл
				СтрокаТабличнойЧасти.Заказ = ?(ЗначениеЗаполнено(Заказ), Заказ, Неопределено);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	СуммаДокумента = Запасы.Итог("Всего") + Расходы.Итог("Всего") + ЗатратыНаИмущество.Итог("Всего");
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
		
		Если ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика
			И НЕ ВключатьРасходыВСебестоимость Тогда
			
			Для каждого СтрокаРасходы из Расходы Цикл
				//+++ Дмгг
				Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
					
					Если СтрокаРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
						
						СтрокаРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
						
					КонецЕсли;
					
				Иначе
					//--- Дмгг
					Если СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
						
						СтрокаРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
						
					КонецЕсли;
					
				КонецЕсли; //+++ Дмгг
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент)
	И НЕ Контрагент.ВестиРасчетыПоДоговорам
	И НЕ ЗначениеЗаполнено(Договор) Тогда
		Договор = Контрагент.ДоговорПоУмолчанию;
	КонецЕсли;
	
	// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность()
		И НЕ ПометкаУдаления Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	// Конец МобильноеПриложение
	
	// ИнтеграцияГИСМ
	ЕстьМаркируемаяПродукцияГИСМ = ИнтеграцияГИСМУНФ.ЕстьМаркируемаяПродукцияГИСМ(Запасы);
	// Конец ИнтеграцияГИСМ
	
	//Паганини_
	Если НЕ ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика Тогда
		ФактурыАвансов.Очистить();
	КонецЕсли;//_Паганини
	
	КоличествоТоваров = Запасы.Итог("Количество"); //+++ Дмгг
	
	//+++ Дмгг
	Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройкиЗачетаАвансов() = Перечисления.ДаНет.Да
			И ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика Тогда
			Предоплата.Очистить();
			ЗаполнитьПредоплату();
	КонецЕсли;
	//--- Дмгг
	
	//Проверяет уникальность реквизитов - НомерТТН и IDTТН
	//Lazare_
	Если НЕ ПометкаУдаления И НЕ РС_ОбщегоНазначения.РеквизитНомерТТНДокументаУникален(Ссылка,"НомерТТН",НомерТТН,"ПриходнаяНакладная" ) Тогда
		ТекстСообщения = НСтр("ru = 'НомерТТН не уникален!'; ka = 'ს/ზ ნომერი არ არის უნიკალური.'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, , , "НомерТТН", Отказ);   
	КонецЕсли;	
	Если НЕ ПометкаУдаления И НЕ РС_ОбщегоНазначения.РеквизитIDTТНДокументаУникален(Ссылка,"IDTТН",IDTТН ,"ПриходнаяНакладная" ) Тогда
		ТекстСообщения = НСтр("ru = 'IDTТН не уникален!'; ka = 'ს/ზ ID არ არის უნიკალური.'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, , , "IDTТН", Отказ);   
	КонецЕсли;	
	//_Lazare	
			
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка наличия розничной цены.
	ПроверитьНаличиеРозничнойЦены(Отказ);
	
	//+++ Дмгг
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата);
	//--- Дмгг
	
	Если Запасы.Количество() > 0 Тогда
		ПроверяемыеРеквизиты.Добавить("СтруктурнаяЕдиница");
		Если ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию
			ИЛИ ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемВПереработку
			ИЛИ ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаОтветхранение Тогда
			ПроверяемыеРеквизиты.Добавить("Запасы.Партия");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ВключатьРасходыВСебестоимость Тогда
		
		Для каждого СтрокаРасходы Из Расходы Цикл
			
			Если НЕ ИспользоватьТолькоРегламентированныйПланСчетов Тогда //+++ Дмгг 
				
				Если Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить()
					И (СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство
					ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
					ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.Доходы
					ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы)
					И НЕ ЗначениеЗаполнено(СтрокаРасходы.СтруктурнаяЕдиница) Тогда
					ТекстСообщения = НСтр("ka='სია ""მომსახურებები""-ს სტრიქონ %НомерСтроки%-ში მითითებული ნომენკლატურა ""%Номенклатура%""-ისთვის შევსებული უნდა იქნას რეკვიზიტი ""ქვეგანყოფილება"".';ru='Для номенклатуры ""%Номенклатура%"" указанной в строке %НомерСтроки% списка ""Услуги"", должен быть заполнен реквизит ""Подразделение"".';en='For nomenclature ""% Range%"" indicated in the line%% NomerStroki list of ""services"" should be filled with props ""Division"".'"
					);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номенклатура%", СокрЛП(Строка(СтрокаРасходы.Номенклатура))); 
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%",Строка(СтрокаРасходы.НомерСтроки));
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"Расходы",
					СтрокаРасходы.НомерСтроки,
					"СтруктурнаяЕдиница",
					Отказ
					);
				КонецЕсли;
				//+++ Дмгг
			Иначе
				Если Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить()
					И (СтрокаРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство
					ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
					ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.Доходы
					ИЛИ СтрокаРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы)
					И НЕ ЗначениеЗаполнено(СтрокаРасходы.СтруктурнаяЕдиница) Тогда
					ТекстСообщения = НСтр("ka='სია ""მომსახურებები""-ს სტრიქონ %НомерСтроки%-ში მითითებული ნომენკლატურა ""%Номенклатура%""-ისთვის შევსებული უნდა იქნას რეკვიზიტი ""ქვეგანყოფილება"".';ru='Для номенклатуры ""%Номенклатура%"" указанной в строке %НомерСтроки% списка ""Услуги"", должен быть заполнен реквизит ""Подразделение"".';en='For nomenclature ""% Range%"" indicated in the line%% NomerStroki list of ""services"" should be filled with props ""Division"".'"
					);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номенклатура%", СокрЛП(Строка(СтрокаРасходы.Номенклатура))); 
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%",Строка(СтрокаРасходы.НомерСтроки));
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"Расходы",
					СтрокаРасходы.НомерСтроки,
					"СтруктурнаяЕдиница",
					Отказ
					);
				КонецЕсли;
			КонецЕсли;
			//--- Дмгг
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВключатьРасходыВСебестоимость
		//И Запасы.Итог("СуммаРасходов") <> Расходы.Итог("Всего") Тогда
		И Запасы.Итог("СуммаРасходов") <> Расходы.Итог("СуммаБезНалогов") Тогда
		
		ТекстСообщения = НСтр("ka='მომსახურებების ჯამი მარაგებზე განაწილებული ჯამის ტოლი არ არის!';ru='Сумма услуг не равна распределенной сумме по запасам!';en='Service is not equal to the sum of the amount distributed on reserves!'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
		);
		
	КонецЕсли;
	
	//Паганини_
	Если ВключатьРасходыВСебестоимость Тогда
		Если Запасы.Итог("СуммаРасходовНДФЛ") <> Расходы.Итог("СуммаНДФЛ") Тогда
			ТекстСообщения = НСтр("ka='მომსახურებების საშემოსავლო თანხა არ არის ტოლი მარაგებზე გადანაწილებული საშემოსავლო თანხის!';ru='Сумма НДФЛ услуг не равна распределенной сумме НДФЛ по запасам!';en='The amount of personal income tax services is not equal to the sum of personal income tax distributed on reserves!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(,ТекстСообщения,Неопределено,Неопределено,Неопределено,Отказ);
		КонецЕсли;
		Если Запасы.Итог("СуммаРасходовПФ") <> Расходы.Итог("СуммаПФ") Тогда
			ТекстСообщения = НСтр("ka='მომსახურებების საპენსიო თანხა არ არის ტოლი მარაგებზე გადანაწილებული საპენსიო თანხის!';ru='Сумма ПФ услуг не равна распределенной сумме ПФ по запасам!';en='PF service amount is not equal to the amount distributed PF reserves!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(,ТекстСообщения,Неопределено,Неопределено,Неопределено,Отказ);
		КонецЕсли;
	Иначе
		Для Каждого СтрокаЗ из Запасы Цикл
			СтрокаЗ.СуммаРасходовНДФЛ	= 0;
			СтрокаЗ.СуммаРасходовПФ		= 0;
		КонецЦикла;
	КонецЕсли;
	Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		ПроверяемыеРеквизиты.Добавить("ВидНалогаНДС");
	КонецЕсли;
	//Паганини
	
	ЗаказПриПоступленииВШапке = ПоложениеЗаказаПоставщику = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
	
	ТаблицаЗапасы = Запасы.Выгрузить(, "Заказ, Всего");
	ТаблицаЗапасы.Свернуть("Заказ", "Всего");
	
	ТаблицаРасходы = Расходы.Выгрузить(, "ЗаказПоставщику, Всего");
	ТаблицаРасходы.Свернуть("ЗаказПоставщику", "Всего");
	
	ТаблицаПредоплата = Предоплата.Выгрузить(, "Заказ, СуммаПлатежа");
	ТаблицаПредоплата.Свернуть("Заказ", "СуммаПлатежа");
	
	Если ЗаказПриПоступленииВШапке Тогда
		Для каждого СтрокаЗапасы Из ТаблицаЗапасы Цикл
			СтрокаЗапасы.Заказ = Заказ;
		КонецЦикла;
		Если Контрагент.ВестиРасчетыПоЗаказам Тогда
			Для каждого СтрокаПредоплата Из ТаблицаПредоплата Цикл
				СтрокаПредоплата.Заказ = Заказ;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	КоличествоЗапасыРасходы = Запасы.Количество() + Расходы.Количество();
	
	Для каждого Строка Из ТаблицаПредоплата Цикл
		
		НайденнаяСтрокаРасходы = Неопределено;
		НайденнаяСтрокаЗапасы = Неопределено;
		
		Если Контрагент.ВестиРасчетыПоЗаказам
		   И Строка.Заказ <> Неопределено
		   И Строка.Заказ <> Документы.ЗаказПокупателя.ПустаяСсылка()
		   И Строка.Заказ <> Документы.ЗаказПоставщику.ПустаяСсылка() Тогда
			НайденнаяСтрокаЗапасы = ТаблицаЗапасы.Найти(Строка.Заказ, "Заказ");
			НайденнаяСтрокаРасходы = ТаблицаРасходы.Найти(Строка.Заказ, "ЗаказПоставщику");
			Всего = 0 + ?(НайденнаяСтрокаЗапасы = Неопределено, 0, НайденнаяСтрокаЗапасы.Всего) + ?(НайденнаяСтрокаРасходы = Неопределено, 0, НайденнаяСтрокаРасходы.Всего);
		ИначеЕсли Контрагент.ВестиРасчетыПоЗаказам Тогда
			НайденнаяСтрокаЗапасы = ТаблицаЗапасы.Найти(Неопределено, "Заказ");
			НайденнаяСтрокаЗапасы = ?(НайденнаяСтрокаЗапасы = Неопределено, ТаблицаЗапасы.Найти(Документы.ЗаказПокупателя.ПустаяСсылка(), "Заказ"), НайденнаяСтрокаЗапасы);
			НайденнаяСтрокаЗапасы = ?(НайденнаяСтрокаЗапасы = Неопределено, ТаблицаЗапасы.Найти(Документы.ЗаказПоставщику.ПустаяСсылка(), "Заказ"), НайденнаяСтрокаЗапасы);
			НайденнаяСтрокаРасходы = ТаблицаРасходы.Найти(Неопределено, "ЗаказПоставщику");
			НайденнаяСтрокаРасходы = ?(НайденнаяСтрокаРасходы = Неопределено, ТаблицаРасходы.Найти(Документы.ЗаказПокупателя.ПустаяСсылка(), "ЗаказПоставщику"), НайденнаяСтрокаРасходы);
			НайденнаяСтрокаРасходы = ?(НайденнаяСтрокаРасходы = Неопределено, ТаблицаРасходы.Найти(Документы.ЗаказПоставщику.ПустаяСсылка(), "ЗаказПоставщику"), НайденнаяСтрокаРасходы);
			Всего = 0 + ?(НайденнаяСтрокаЗапасы = Неопределено, 0, НайденнаяСтрокаЗапасы.Всего) + ?(НайденнаяСтрокаРасходы = Неопределено, 0, НайденнаяСтрокаРасходы.Всего);
		Иначе
			Всего = Запасы.Итог("Всего") + Расходы.Итог("Всего") + ЗатратыНаИмущество.Итог("Всего");
		КонецЕсли;
		
		Если НайденнаяСтрокаЗапасы = Неопределено
		   И НайденнаяСтрокаРасходы = Неопределено
		   И КоличествоЗапасыРасходы > 0
		   И Контрагент.ВестиРасчетыПоЗаказам Тогда
			ТекстСообщения = НСтр("ka='ავანსის ჩათვლა ცხრილ ""მარაგები""-ში ან ""მომსახურებებიში""-ში მითითებულისგან განსხვავებული შეკვეთის მიხედვით არ შეიძლება!';ru='Нельзя зачесть аванс по заказу отличному от указанных в табличных частях ""Запасы"" или ""Услуги""!';en='Can not be set off against the advance of order different from that indicated in the tables of ""reserves"" or ""Services""!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				,
				ТекстСообщения,
				Неопределено,
				Неопределено,
				"ПредоплатаИтогСуммаРасчетовВалюта",
				Отказ
			);
		КонецЕсли;
		
		
		
	КонецЦикла;
	
	//+++ Дмгг
	Если Контрагент.ВестиРасчетыПоДокументам Тогда 
		Для Каждого СтрокП Из Предоплата Цикл 
			
			Если НЕ ЗначениеЗаполнено(СтрокП.Документ) Тогда 
				ТекстСообщения = НСтр("ka='სტრიქონში %НомерСтроки% სიაში ""წინასწარი გადახდა"", უნდა იყოს შევსებული ""დოკუმენტი"".';ru='Для строки %НомерСтроки% списка ""Предоплаты"", должен быть заполнен реквизит ""Документ"".';en='For line% NomerStroki% list ""prepaid"" shall be filled with props ""Document"".'"
				);
				//ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номенклатура%", СокрЛП(Строка(СтрокаРасходы.Номенклатура))); 
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%",Строка(СтрокП.НомерСтроки));
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстСообщения,
				"Расходы",
				СтрокП.НомерСтроки,
				"СтруктурнаяЕдиница",
				Отказ
				);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	//--- Дмгг
	
	Если НЕ Контрагент.ВестиРасчетыПоДоговорам Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");
	КонецЕсли;
	
	// Серийные номера
	Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктурнаяЕдиница,"ОрдерныйСклад") = Истина Тогда
		РаботаССерийнымиНомерами.ПроверкаЗаполненияСерийныхНомеров(Отказ, Запасы, СерийныеНомера, СтруктурнаяЕдиница, ЭтотОбъект);
	КонецЕсли;
	
	Если НЕ НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Расходы.СтавкаНДС");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Запасы.СтавкаНДС");
	КонецЕсли;
	
	//+++ Lazare_13.09.2021
	Если РС_ОбщегоНазначения.ПроверкаЗаполненияПоляКомментарий(Организация)и
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя")
	Тогда 	
		ПроверяемыеРеквизиты.Добавить("Комментарий"); 
	КонецЕсли; 
	//--- Lazare_13.09.2021
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	//+++ Дмгг 
	Если ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика
		И ВалютаДокумента <> УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("НациональнаяВалюта")
		И СуммаДокумента = Предоплата.Итог("СуммаРасчетов") Тогда 
		
		ДополнительныеСвойства.Вставить("ТребуетсяПроверкаИВыравнивание", ИСТИНА);
			
	Иначе
			
		ДополнительныеСвойства.Вставить("ТребуетсяПроверкаИВыравнивание", ЛОЖЬ);
		
	КонецЕсли;
	
	// Инициализация данных документа.
	Документы.ПриходнаяНакладная.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыВРазрезеГТД(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРазмещениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗакупки(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьПродажи(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоНалогам(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыКПоступлениюНаСклады(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыПринятые(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыПереданные(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗаказыПокупателей(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗаказыПоставщикам(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыКассовыйМетод(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыНераспределенные(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыОтложенные(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьПотребностьВЗапасах(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПоставщиками(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьСуммовойУчетВРознице(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыНДФЛ(ДополнительныеСвойства, Движения, Отказ);
	
	УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьАвансыПолученныхФактур(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьРасчетыСПенсионнымФондом(ДополнительныеСвойства, Движения, Отказ);//Паганини ПФ
	УправлениеНебольшойФирмойСервер.ОтразитьАнализПоПодразделениям(ДополнительныеСвойства, Движения, Отказ);//Паганини
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьСебестоимостьЗакупки(ДополнительныеСвойства, Движения, Отказ);//Дмгг
	УправлениеНебольшойФирмойСервер.ОтразитьВнеоборотныеАктивы(ДополнительныеСвойства, Движения, Отказ); //Дмгг
	УправлениеНебольшойФирмойСервер.ОтразитьПараметрыВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ); //Дмгг
	
	// ДисконтныеКарты
	УправлениеНебольшойФирмойСервер.ОтразитьПродажиПоДисконтнойКарте(ДополнительныеСвойства, Движения, Отказ);
	
	// Серийные номера
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераОстатки(ДополнительныеСвойства, Движения, Отказ);
	
	УправлениеНебольшойФирмойСервер.ОтразитьЗакупкиДляКУДиР(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.ПриходнаяНакладная.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	// Запись цен в регистр сведений Цены номенклатуры контрагентов.
	Документы.ПриходнаяНакладная.ЗарегистрироватьЦеныПоставщика(Ссылка, Отказ);
	Если НЕ Отказ Тогда 
		Документы.ПриходнаяНакладная.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ,,Истина);
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	//+++ Lazare_27.08.2021
	Если не ОтключитьКонтрольЗадолжностиПередПоставшика и  ВидОперации =
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика") Тогда 
		РС_ОбщегоНазначения.ПроверитьсуммуЗадолженности (Ссылка,Отказ);
	КонецЕсли
	//--- Lazare_27.08.2021
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.ПриходнаяНакладная.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
	// Удаление цен из регистра сведений Цены номенклатуры контрагентов.
	Документы.ПриходнаяНакладная.УдалитьЦеныПоставщика(Ссылка);
	
	// Подчиненная счет-фактура (полученная)
	Если НЕ Отказ Тогда
		
		КонтрольПодчиненнойСчетФактуры();
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Процедура проверяет наличие розничной цены.
//
Процедура ПроверитьНаличиеРозничнойЦены(Отказ)
	
	Если СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
	 ИЛИ СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
	 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("ТаблицаДокумента", Запасы);
		Запрос.УстановитьПараметр("РозничныйВидЦен", СтруктурнаяЕдиница.РозничныйВидЦен);
		Запрос.УстановитьПараметр("СписокНоменклатура", Запасы.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("СписокХарактеристика", Запасы.ВыгрузитьКолонку("Характеристика"));
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
		|	ТаблицаДокумента.Характеристика КАК Характеристика,
		|	ТаблицаДокумента.Партия КАК Партия
		|ПОМЕСТИТЬ ПеремещениеЗапасовЗапасы
		|ИЗ
		|	&ТаблицаДокумента КАК ТаблицаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕ(ПеремещениеЗапасовЗапасы.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ПеремещениеЗапасовЗапасы.Характеристика) КАК ХарактеристикаПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ПеремещениеЗапасовЗапасы.Партия) КАК ПартияПредставление
		|ИЗ
		|	ПеремещениеЗапасовЗапасы КАК ПеремещениеЗапасовЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				&Дата,
		|				ВидЦен = &РозничныйВидЦен
		|					И Номенклатура В (&СписокНоменклатура)
		|					И Характеристика В (&СписокХарактеристика)) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ПеремещениеЗапасовЗапасы.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ПеремещениеЗапасовЗапасы.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
		|ГДЕ
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) = 0";
		
		ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
			
			ТекстСообщения = НСтр("ka='სია ""მარაგების"" სტრიქონ %НомерСтроки%-ში ნომენკლატურა %ПредставлениеНоменклатуры%-სთვის საცალო ფასი არ არის დაყენებული!';ru='Для номенклатуры %ПредставлениеНоменклатуры% в строке %НомерСтроки% списка ""Запасы"" не установлена розничная цена!';en='For nomenclature PredstavlenieNomenklatury%% Row% NomerStroki% list ""Inventories"" does not set the retail price!'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Строка(ВыборкаРезультатаЗапроса.НомерСтроки));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеНоменклатуры%",  УправлениеНебольшойФирмойСервер.ПредставлениеНоменклатуры(ВыборкаРезультатаЗапроса.НоменклатураПредставление, ВыборкаРезультатаЗапроса.ХарактеристикаПредставление, ВыборкаРезультатаЗапроса.ПартияПредставление));
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстСообщения,
				"Запасы",
				ВыборкаРезультатаЗапроса.НомерСтроки,
				"Номенклатура",
				Отказ
			);
	
		КонецЦикла;
	 
	КонецЕсли;
	
КонецПроцедуры // ПроверитьНаличиеРозничнойЦены()

#КонецОбласти

#Область СлужебныеПроцедурыИФнукции

// Процедура отмены проведения у подченненой счет фактуры (полученной)
//
Процедура КонтрольПодчиненнойСчетФактуры()
	
	СтруктураСчетаФактуры = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйСчетФактуру(Ссылка, Истина);
	Если СтруктураСчетаФактуры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СчетФактура	 = СтруктураСчетаФактуры.Ссылка;
	Если Не СчетФактура.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ka='მოძრაობების არარსებობის გამო დოკუმენტ %ПредставлениеТекущегоДокумента%-ს გაუტარდება %ПредставлениеСчетФактуры%.';ru='В связи с отсутствием движений у документа %ПредставлениеТекущегоДокумента% распроводится %ПредставлениеСчетФактуры%.';en='Due to the lack of movement in the document PredstavlenieTekuschegoDokumenta%%% rasprovoditsya PredstavlenieSchetFaktury%.'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеТекущегоДокумента%", """Приходная накладная № " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy") + """");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеСчетФактуры%", """Счет фактура (полученная) № " + СтруктураСчетаФактуры.Номер + " от " + СтруктураСчетаФактуры.Дата + """");
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
	СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
	СчетФактураОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры //КонтрольПодчиненнойСчетФактуры()

#КонецОбласти

#КонецЕсли

Процедура Дистрибуция_ЗаполнитьЗаказНаВозврат(ДанныеЗаполнения)
	
	// Заполнение шапки документа.
	ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
	
	//ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Договор = ДанныеЗаполнения.Договор;
	//СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
	//Ячейка = ДанныеЗаполнения.Ячейка;
	//ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	//СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
	//НДСВключатьВСтоимость = ДанныеЗаполнения.НДСВключатьВСтоимость;
	//НалогообложениеНДС = ДанныеЗаполнения.НалогообложениеНДС;
	ТорговаяТочка = ДанныеЗаполнения.ТорговаяТочка;
	СуммаВключаетНДС = Истина;
	
	ВалютаДокумента = Константы.НациональнаяВалюта.Получить();
	Курс = 1;
	Кратность = 1;
	
	// Заполнение табличной части документа.
	Запасы.Очистить();
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Запасы Цикл
		Если СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
			
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
			НоваяСтрока.СтавкаНДС = НоваяСтрока.Номенклатура.СтавкаНДС;
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
			НоваяСтрока.СуммаНДС = ?(СуммаВключаетНДС, 
									 НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДС + 100) / 100),
									 НоваяСтрока.Сумма * СтавкаНДС / 100);
			НоваяСтрока.Всего = НоваяСтрока.Сумма + ?(СуммаВключаетНДС, 0, НоваяСтрока.СуммаНДС);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры // ЗаполнитьПоРасходнаяНакладная()

	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТабТоваров.Номенклатура,
	//|	ТабТоваров.Количество
	//|ПОМЕСТИТЬ врТабТоваров1
	//|ИЗ
	//|	&ТабТоваров КАК ТабТоваров
	//|;
	//|ВЫБРАТЬ
	//|	ТабТоваров.Номенклатура,
	//|	ТабТоваров.Количество
	//|ПОМЕСТИТЬ врТабТоваров
	//|ИЗ
	//|	&ТабТоваров КАК ТабТоваров
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ПродажиОбороты.Документ КАК Документ,
	//|	СУММА(ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)) КАК КоличествоПродажи,
	//|	СУММА(ЕСТЬNULL(ПродажиОбороты.СебестоимостьОборот, 0)) КАК СебестоимостьПродажи,
	//|	ПродажиОбороты.Номенклатура,
	//|	ПродажиОбороты.Характеристика,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) = 0
	//|			ТОГДА 0
	//|		ИНАЧЕ ПродажиОбороты.СуммаОборот / ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)
	//|	КОНЕЦ КАК Цена,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) = 0
	//|			ТОГДА 0
	//|		ИНАЧЕ ПродажиОбороты.СебестоимостьОборот / ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)
	//|	КОНЕЦ КАК СебестоимостьЕд
	//|ПОМЕСТИТЬ врТабПродажи
	//|ИЗ
	//|	РегистрНакопления.Продажи.Обороты(
	//|			,
	//|			&МоментВремени,
	//|			,
	//|			Документ ССЫЛКА Документ.РасходнаяНакладная
	//|				И Документ.Контрагент = &Контрагент
	//|				И Документ.Договор = &Договор
	//|				И ВЫБОР
	//|					КОГДА &ЕстьДокумент
	//|						ТОГДА Документ = &Документ
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК ПродажиОбороты
	//|ГДЕ
	//|	ПродажиОбороты.КоличествоОборот > 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПродажиОбороты.Характеристика,
	//|	ПродажиОбороты.Номенклатура,
	//|	ПродажиОбороты.Документ,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) = 0
	//|			ТОГДА 0
	//|		ИНАЧЕ ПродажиОбороты.СуммаОборот / ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) = 0
	//|			ТОГДА 0
	//|		ИНАЧЕ ПродажиОбороты.СебестоимостьОборот / ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)
	//|	КОНЕЦ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	врТабТоваров.Номенклатура КАК Номенклатура,
	//|	врТабТоваров.Количество КАК Количество,
	//|	ЕСТЬNULL(врТабПродажи.Документ, ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) КАК ДокументОснование,
	//|	ЕСТЬNULL(врТабПродажи.КоличествоПродажи, 0) КАК КоличествоПродажи,
	//|	ЕСТЬNULL(врТабПродажи.СебестоимостьПродажи, 0) КАК СебестоимостьПродажи,
	//|	ЕСТЬNULL(врТабПродажи.Цена, 0) КАК Цена,
	//|	ЕСТЬNULL(врТабПродажи.СебестоимостьЕд, 0) КАК СебестоимостьЕд
	//|ИЗ
	//|	врТабТоваров КАК врТабТоваров
	//|		ЛЕВОЕ СОЕДИНЕНИЕ врТабПродажи КАК врТабПродажи
	//|		ПО врТабТоваров.Номенклатура = врТабПродажи.Номенклатура
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	врТабПродажи.Документ.Дата УБЫВ
	//|ИТОГИ
	//|	МАКСИМУМ(Количество),
	//|	СУММА(КоличествоПродажи)
	//|ПО
	//|	Номенклатура";

&НаСервере
Процедура Дистрибуция_ЗаполнитьПродажамиНаСервере(ЗапасыИзВизита = Неопределено)Экспорт 
	
	Если ЗапасыИзВизита = Неопределено Тогда 
		ТаблицаЗапасы = Запасы.Выгрузить();
	Иначе 
		ТаблицаЗапасы = ЗапасыИзВизита;
	КонецЕсли;
	
  ТаблицаЗапасыЦени = ТаблицаЗапасы.скопировать(); 
	//ТаблицаЗапасы.Свернуть("Номенклатура","Количество","Сумма");
	
	КопияТаблицаЗапасы = Новый ТаблицаЗначений;
	КопияТаблицаЗапасы = ТаблицаЗапасы.СкопироватьКолонки("Номенклатура,Количество");
	КопияТаблицаЗапасы.Колонки.Добавить("ДокументОснование" );		  
	КопияТаблицаЗапасы.Колонки.Добавить("Цена");		  
	КопияТаблицаЗапасы.Колонки.Добавить("Себестоимость");		  
	
	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабТоваров.Номенклатура,
	|	ТабТоваров.Количество КАК Количество,
	|	ТабТоваров.Цена КАК Цена,
	|	ТабТоваров.Сумма КАК Сумма
	|ПОМЕСТИТЬ врТабТоваров1
	|ИЗ
	|	&ТабТоваров КАК ТабТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	врТабТоваров1.Номенклатура,
	|	СУММА(врТабТоваров1.Количество) КАК Количество,
	|	МАКСИМУМ(врТабТоваров1.Цена) КАК Цена,
	|	СУММА(врТабТоваров1.Сумма) КАК Сумма
	|ПОМЕСТИТЬ врТабТоваров
	|ИЗ
	|	врТабТоваров1 КАК врТабТоваров1
	|
	|СГРУППИРОВАТЬ ПО
	|	врТабТоваров1.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.Документ КАК Документ,
	|	СУММА(ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)) КАК КоличествоПродажи,
	|	СУММА(ЕСТЬNULL(ПродажиОбороты.СебестоимостьОборот, 0)) КАК СебестоимостьПродажи,
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ПродажиОбороты.СуммаОборот / ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ПродажиОбороты.СебестоимостьОборот / ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)
	|	КОНЕЦ КАК СебестоимостьЕд
	|ПОМЕСТИТЬ врТабПродажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			,
	|			&МоментВремени,
	|			,
	|			Документ ССЫЛКА Документ.РасходнаяНакладная
	|				И Документ.Контрагент = &Контрагент
	|				И Документ.Договор = &Договор
	|				И ВЫБОР
	|					КОГДА &ЕстьДокумент
	|						ТОГДА Документ = &Документ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.КоличествоОборот > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Характеристика,
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.Документ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ПродажиОбороты.СуммаОборот / ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ПродажиОбороты.СебестоимостьОборот / ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	врТабТоваров.Номенклатура КАК Номенклатура,
	|	врТабТоваров.Количество КАК Количество,
	|	ЕСТЬNULL(врТабПродажи.Документ, ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) КАК ДокументОснование,
	|	ЕСТЬNULL(врТабПродажи.КоличествоПродажи, 0) КАК КоличествоПродажи,
	|	ЕСТЬNULL(врТабПродажи.СебестоимостьПродажи, 0) КАК СебестоимостьПродажи,
	|	ЕСТЬNULL(врТабПродажи.Цена, ВЫБОР
	|			КОГДА врТабТоваров.Количество = 0
	|				ТОГДА 0
	|			ИНАЧЕ врТабТоваров.Сумма / врТабТоваров.Количество
	|		КОНЕЦ) КАК Цена,
	|	ЕСТЬNULL(врТабПродажи.СебестоимостьЕд, 0) КАК СебестоимостьЕд
	|ИЗ
	|	врТабТоваров КАК врТабТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ врТабПродажи КАК врТабПродажи
	|		ПО врТабТоваров.Номенклатура = врТабПродажи.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	врТабПродажи.Документ.Дата УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(Количество),
	|	СУММА(КоличествоПродажи),
	|	МАКСИМУМ(СебестоимостьПродажи),
	|	МАКСИМУМ(Цена),
	|	МАКСИМУМ(СебестоимостьЕд)
	|ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("ТабТоваров", ТаблицаЗапасы);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", 	Договор);
	Запрос.УстановитьПараметр("ЕстьДокумент", ЗначениеЗаполнено(ДокументОснование));
	Запрос.УстановитьПараметр("Документ", 	ДокументОснование);
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	
	ВыборкаНоменклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		КоличествоПогасить = ВыборкаНоменклатура.Количество;
			
		ВыборкаПродажи = ВыборкаНоменклатура.Выбрать(); 		
		Пока ВыборкаПродажи.Следующий() Цикл
			Если Не ВыборкаПродажи.КоличествоПродажи > 0 Тогда
				Продолжить;
			КонецЕсли;
			Если КоличествоПогасить > 0 Тогда 
				стрЗапасы = КопияТаблицаЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(стрЗапасы,ВыборкаПродажи);
				стрЗапасы.Количество = Мин(ВыборкаПродажи.КоличествоПродажи,КоличествоПогасить);
				стрЗапасы.Себестоимость = ВыборкаПродажи.СебестоимостьЕд * стрЗапасы.Количество;
				КоличествоПогасить 	 = КоличествоПогасить - ВыборкаПродажи.КоличествоПродажи;
			КонецЕсли;
		КонецЦикла;
		Если КоличествоПогасить > 0 Тогда 
			стрЗапасы = КопияТаблицаЗапасы.Добавить();
			ЗаполнитьЗначенияСвойств(стрЗапасы,ВыборкаНоменклатура);
			стрЗапасы.Количество = КоличествоПогасить;
		КонецЕсли;			
	КонецЦикла;
	
	Запасы.Загрузить(КопияТаблицаЗапасы);
	
	// Заполнение табличной части документа.
	Для каждого СтрокаТабличнойЧасти Из Запасы Цикл
		Если СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
			//НайденнаяСтрока = ТаблицаЗапасыЦени.Найти(СтрокаТабличнойЧасти.Номенклатура,"Номенклатура");
			//Если Не НайденнаяСтрока = Неопределено И НайденнаяСтрока.Цена > 0 Тогда 
			//	СтрокаТабличнойЧасти.Цена = НайденнаяСтрока.Цена;
			//КонецЕсли;
			СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
			
			СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;
			
			СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
			СтрокаТабличнойЧасти.СуммаНДС = ?(СуммаВключаетНДС, 
			СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
			СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);

		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры

// Kuzmich, 25.03.2019, распределение услуг по весу/объему
#Область РаспределениеУслугПоВесуОбъему

Функция РаспределитьТабЧастьРасходыПоВесу() ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = Новый Массив();
	
	ИсхСумма = 0;
	ИсхСуммаНДС = 0;
	БазаРаспределенияВес = 0;
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		Если ЗначениеЗаполнено(СтрокаЗапасы.Номенклатура.Вес) Тогда
			Если СтрокаЗапасы.Номенклатура.Вес>0 Тогда
				БазаРаспределенияВес = БазаРаспределенияВес + СтрокаЗапасы.Количество*СтрокаЗапасы.Номенклатура.Вес;
			Иначе
				Если РЕЗ.Найти(СтрокаЗапасы.Номенклатура)=НЕОПРЕДЕЛЕНО Тогда
					РЕЗ.Добавить(СтрокаЗапасы.Номенклатура);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если РЕЗ.Найти(СтрокаЗапасы.Номенклатура)=НЕОПРЕДЕЛЕНО Тогда
				РЕЗ.Добавить(СтрокаЗапасы.Номенклатура);
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла; 
	ВсегоРасходы = Расходы.Итог("СуммаБезНалогов");//Паганини Расходы.Итог("Всего")
	ВсегоНДСРасходы = Расходы.Итог("СуммаНДС");
	//Паганини_
	ИсхСуммаНДФЛ = 0;	
	ВсегоРасходыНДФЛ = Расходы.Итог("СуммаНДФЛ");
	ИсхСуммаПФ = 0;	
	ВсегоРасходыПФ = Расходы.Итог("СуммаПФ");
	//_Паганини
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		СтрокаЗапасы.СуммаРасходов = 0;
		СтрокаЗапасы.СуммаРасходовНДФЛ = 0;
		СтрокаЗапасы.СуммаРасходовПФ = 0;
		
		Если НЕ РЕЗ.Найти(СтрокаЗапасы.Номенклатура)=НЕОПРЕДЕЛЕНО Тогда
			Продолжить;
		КонецЕсли;
		
		ТекКоэффицинтВес = СтрокаЗапасы.Количество*СтрокаЗапасы.Номенклатура.Вес;
		
		СтрокаЗапасы.СуммаРасходов = ?(БазаРаспределенияВес <> 0, Окр((ВсегоРасходы - ИсхСумма) * ТекКоэффицинтВес / БазаРаспределенияВес, 2, 1),0);
		СтрокаЗапасы.СуммаРасходовНДФЛ = ?(БазаРаспределенияВес <> 0, Окр((ВсегоРасходыНДФЛ - ИсхСуммаНДФЛ) * ТекКоэффицинтВес / БазаРаспределенияВес, 2, 1),0);//Паганини
		СтрокаЗапасы.СуммаРасходовПФ   = ?(БазаРаспределенияВес <> 0, Окр((ВсегоРасходыПФ   - ИсхСуммаПФ)   * ТекКоэффицинтВес / БазаРаспределенияВес, 2, 1),0);//Паганини ПФ
		БазаРаспределенияВес = БазаРаспределенияВес - ТекКоэффицинтВес;
		ИсхСумма = ИсхСумма + СтрокаЗапасы.СуммаРасходов;
		ИсхСуммаНДФЛ = ИсхСуммаНДФЛ + СтрокаЗапасы.СуммаРасходовНДФЛ;//Паганини
		ИсхСуммаПФ   = ИсхСуммаПФ   + СтрокаЗапасы.СуммаРасходовПФ;//Паганини ПФ
		
	КонецЦикла;
	
	Возврат РЕЗ;
КонецФункции


Функция РаспределитьТабЧастьРасходыПоОбъему() ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = Новый Массив();
	
	ИсхСумма = 0;
	ИсхСуммаНДС = 0;
	БазаРаспределенияОбъем = 0;
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		Если ЗначениеЗаполнено(СтрокаЗапасы.Номенклатура.Объем) Тогда
			Если СтрокаЗапасы.Номенклатура.Объем>0 Тогда
				БазаРаспределенияОбъем = БазаРаспределенияОбъем + СтрокаЗапасы.Количество*СтрокаЗапасы.Номенклатура.Объем;
			Иначе
				Если РЕЗ.Найти(СтрокаЗапасы.Номенклатура)=НЕОПРЕДЕЛЕНО Тогда
					РЕЗ.Добавить(СтрокаЗапасы.Номенклатура);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если РЕЗ.Найти(СтрокаЗапасы.Номенклатура)=НЕОПРЕДЕЛЕНО Тогда
				РЕЗ.Добавить(СтрокаЗапасы.Номенклатура);
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла; 
	ВсегоРасходы = Расходы.Итог("СуммаБезНалогов");//Паганини Расходы.Итог("Всего")
	ВсегоНДСРасходы = Расходы.Итог("СуммаНДС");
	//Паганини_
	ИсхСуммаНДФЛ = 0;	
	ВсегоРасходыНДФЛ = Расходы.Итог("СуммаНДФЛ");
	ИсхСуммаПФ = 0;	
	ВсегоРасходыПФ = Расходы.Итог("СуммаПФ");
	//_Паганини
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		СтрокаЗапасы.СуммаРасходов = 0;
		СтрокаЗапасы.СуммаРасходовНДФЛ = 0;
		СтрокаЗапасы.СуммаРасходовПФ = 0;
		
		Если НЕ РЕЗ.Найти(СтрокаЗапасы.Номенклатура)=НЕОПРЕДЕЛЕНО Тогда
			Продолжить;
		КонецЕсли;
		
		ТекКоэффицинтОбъем = СтрокаЗапасы.Количество*СтрокаЗапасы.Номенклатура.Объем;
		
		СтрокаЗапасы.СуммаРасходов = ?(БазаРаспределенияОбъем <> 0, Окр((ВсегоРасходы - ИсхСумма) * ТекКоэффицинтОбъем / БазаРаспределенияОбъем, 2, 1),0);
		СтрокаЗапасы.СуммаРасходовНДФЛ = ?(БазаРаспределенияОбъем <> 0, Окр((ВсегоРасходыНДФЛ - ИсхСуммаНДФЛ) * ТекКоэффицинтОбъем / БазаРаспределенияОбъем, 2, 1),0);//Паганини
		СтрокаЗапасы.СуммаРасходовПФ   = ?(БазаРаспределенияОбъем <> 0, Окр((ВсегоРасходыПФ   - ИсхСуммаПФ)   * ТекКоэффицинтОбъем / БазаРаспределенияОбъем, 2, 1),0);//Паганини ПФ
		БазаРаспределенияОбъем = БазаРаспределенияОбъем - ТекКоэффицинтОбъем;
		ИсхСумма = ИсхСумма + СтрокаЗапасы.СуммаРасходов;
		ИсхСуммаНДФЛ = ИсхСуммаНДФЛ + СтрокаЗапасы.СуммаРасходовНДФЛ;//Паганини
		ИсхСуммаПФ   = ИсхСуммаПФ   + СтрокаЗапасы.СуммаРасходовПФ;//Паганини ПФ
		
	КонецЦикла;
	
	Возврат РЕЗ;
КонецФункции

#КонецОбласти
// Kuzmich, 25.03.2019, распределение услуг по весу/объему

//+++ Lazare_07.09.2021
Процедура РассчитатьСтомостьВозвратов()ЭКСПОРТ
	
	Если  не (ТипЗнЧ(ДокументОснование) = ПредопределенноеЗначение("Документ.ЧекККМ") ) Тогда 
		Возврат
	КонецЕсли;
	
	 Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(Запасы.Период, МЕСЯЦ) КАК Период,
	|	Запасы.Организация КАК Организация,
	|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Запасы.СчетУчета КАК СчетУчета,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия,
	|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	Запасы.ЗаказПродажи КАК ЗаказПродажи,
	|	Запасы.СтавкаНДС КАК СтавкаНДС,
	|	Запасы.ДокументПродажи КАК ДокументПродажи,
	|	Запасы.Подразделение КАК Подразделение,
	|	Запасы.КоррСчетУчета КАК КоррСчетУчета,
	|	Запасы.Ответственный КАК Ответственный,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(Запасы.ДокументПродажи.Дата, МЕСЯЦ) < КОНЕЦПЕРИОДА(Запасы.Период, МЕСЯЦ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратПрошлогоПериода,
	|	-СУММА(Запасы.Количество) КАК Количество,
	|	-СУММА(Запасы.Сумма) КАК Сумма,
	|	Запасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	Запасы.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл
	|ПОМЕСТИТЬ ВтВозвраты
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Возврат
	|	И Запасы.Организация = &Организация
	|	И ВЫБОР
	|			КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|				ТОГДА Запасы.КоррСчетУчетаРегл = &ПустойСчетРегл
	|			ИНАЧЕ Запасы.КоррСчетУчета = &ПустойСчет
	|		КОНЕЦ
	|	И Запасы.ДокументПродажи <> НЕОПРЕДЕЛЕНО
	|	И Запасы.ДокументПродажи = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(Запасы.ДокументПродажи.Дата, МЕСЯЦ) < КОНЕЦПЕРИОДА(Запасы.Период, МЕСЯЦ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Запасы.Организация,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.СчетУчета,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия,
	|	Запасы.ЗаказПокупателя,
	|	Запасы.ЗаказПродажи,
	|	Запасы.СтавкаНДС,
	|	Запасы.ДокументПродажи,
	|	Запасы.Подразделение,
	|	Запасы.КоррСчетУчета,
	|	Запасы.Ответственный,
	|	Запасы.СчетУчетаРегл,
	|	Запасы.КоррСчетУчетаРегл,
	|	КОНЕЦПЕРИОДА(Запасы.Период, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВозвратов.Период КАК Период,
	|	ИСТИНА КАК Возврат,
	|	&Организация КАК Организация,
	|	ТаблицаВозвратов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВозвратов.СчетУчета КАК СчетУчета,
	|	ТаблицаВозвратов.Номенклатура КАК Номенклатура,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельностиПродажи,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
	|		ИНАЧЕ УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат
	|	КОНЕЦ КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
	|	ТаблицаВозвратов.Характеристика КАК Характеристика,
	|	ТаблицаВозвратов.Партия КАК Партия,
	|	ТаблицаВозвратов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаВозвратов.ЗаказПродажи КАК ЗаказПродажи,
	|	ТаблицаВозвратов.Количество КАК КоличествоВозвратов,
	|	ТаблицаВозвратов.Сумма КАК СуммаВозвратов,
	|	ТаблицаВозвратов.ДокументПродажи КАК ДокументПродажи,
	|	ТаблицаВозвратов.Подразделение КАК Подразделение,
	|	ТаблицаВозвратов.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаВозвратов.Ответственный КАК Ответственный,
	|	ТаблицаВозвратов.ЭтоВозвратПрошлогоПериода КАК ЭтоВозвратПрошлогоПериода,
	|	&ПустойСчет КАК КоррСчетУчета,
	|	&ПустойСчетРегл КАК КоррСчетУчетаРегл,
	|	СУММА(ТаблицаПродажи.Количество) КАК КоличествоПродаж,
	|	СУММА(ТаблицаПродажи.Сумма) КАК СуммаПродаж,
	|	ТаблицаВозвратов.СчетУчетаРегл КАК СчетУчетаРегл
	|ИЗ
	|	ВтВозвраты КАК ТаблицаВозвратов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК ТаблицаПродажи
	|		ПО ТаблицаВозвратов.Номенклатура = ТаблицаПродажи.Номенклатура
	|			И ТаблицаВозвратов.Характеристика = ТаблицаПродажи.Характеристика
	|			И ТаблицаВозвратов.Партия = ТаблицаПродажи.Партия
	|			И ТаблицаВозвратов.ЗаказПродажи = ТаблицаПродажи.ЗаказПродажи
	|			И (ТаблицаПродажи.Организация = &Организация)
	|			И ТаблицаВозвратов.ДокументПродажи = ТаблицаПродажи.ДокументПродажи
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА ТаблицаВозвратов.СчетУчетаРегл = ТаблицаПродажи.СчетУчетаРегл
	|				ИНАЧЕ ТаблицаВозвратов.СчетУчета = ТаблицаПродажи.СчетУчета
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА ТаблицаПродажи.КоррСчетУчетаРегл = &ПустойСчетРегл
	|				ИНАЧЕ ТаблицаПродажи.КоррСчетУчета = &ПустойСчет
	|			КОНЕЦ)
	|			И (ТаблицаПродажи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И (НЕ ТаблицаПродажи.Возврат),
	|	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УчетнаяПолитикаРеглСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВозвратов.Период,
	|	ТаблицаВозвратов.СтруктурнаяЕдиница,
	|	ТаблицаВозвратов.СчетУчета,
	|	ТаблицаВозвратов.Номенклатура,
	|	ТаблицаВозвратов.Характеристика,
	|	ТаблицаВозвратов.Партия,
	|	ТаблицаВозвратов.ЗаказПокупателя,
	|	ТаблицаВозвратов.ЗаказПродажи,
	|	ТаблицаВозвратов.Количество,
	|	ТаблицаВозвратов.Сумма,
	|	ТаблицаВозвратов.ДокументПродажи,
	|	ТаблицаВозвратов.Подразделение,
	|	ТаблицаВозвратов.СтавкаНДС,
	|	ТаблицаВозвратов.Ответственный,
	|	ТаблицаВозвратов.ЭтоВозвратПрошлогоПериода,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж,
	|	ТаблицаВозвратов.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
	|		ИНАЧЕ УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	(ВЫРАЗИТЬ(СУММА(ТаблицаПродажи.Сумма) - ТаблицаВозвратов.Сумма КАК ЧИСЛО(15, 2))) <> 0");
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПустойСчет", ПланыСчетов.Управленческий.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойСчетРегл", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", ИспользоватьТолькоРегламентированныйПланСчетов);
	Запрос.УстановитьПараметр("Ссылка",?(ТипЗнЧ(ДокументОснование) = ПредопределенноеЗначение("Документ.ЧекККМ"),
	ДокументОснование.КассоваяСмена ,ДокументОснование));

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	
	
	// Корректировка стоимости.
	                                  	
	// Создадим набор записей регистра накопления Учет запасов и затрат.
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();	
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейЗапасы.Прочитать();

	// Создадим набор записей регистра накопления Продажи.
	НаборЗаписейПродажи = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НаборЗаписейПродажи.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейПродажи.Прочитать();
		
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейДоходыИРасходы.Прочитать();
	
	// Создадим набор записей регистра накопления СебестоимостьЗакупки.
	НаборЗаписейСебестоимостьЗакупки = РегистрыНакопления.СебестоимостьЗакупки.СоздатьНаборЗаписей();
	НаборЗаписейСебестоимостьЗакупки.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейСебестоимостьЗакупки.Прочитать();	
	
	//// Создадим набор записей регистра накопления Управленческий.
	//НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	//НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	//НаборЗаписейУправленческий.Прочитать();

	// Создадим набор записей регистра накопления Хозрасчетный.
	//НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	//НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
	//НаборЗаписейХозрасчетный.Прочитать();
	НаборЗаписейХозрасчетный1 = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный1.Отбор.Регистратор.Установить(Ссылка);	
	НаборЗаписейХозрасчетный1.Прочитать();
	
	
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ИндХозрасчетный = 0 ;
	инд1 = НаборЗаписейХозрасчетный1.количество() ;
	Инд = 0;
	ИндХозрасчетный = НаборЗаписейЗапасы.количество();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СуммаРасходов = 0  ;
		Если ВыборкаДетальныеЗаписи.КоличествоПродаж = 0 Тогда
			СуммаКорректировки = 0;
		Иначе                  
			ЦенаПродажи = ВыборкаДетальныеЗаписи.СуммаПродаж / ВыборкаДетальныеЗаписи.КоличествоПродаж;
			СуммаВозвратов = ЦенаПродажи * ВыборкаДетальныеЗаписи.КоличествоВозвратов;
			СуммаКорректировки = ВыборкаДетальныеЗаписи.СуммаВозвратов - ЦенаПродажи * ВыборкаДетальныеЗаписи.КоличествоВозвратов;
			//Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура ;
			//Характеристика = ВыборкаДетальныеЗаписи.Характеристика;	
			//Партия = ВыборкаДетальныеЗаписи.Партия;
		КонецЕсли;
		
		//Отбор = Новый  Структура ;
		//Отбор.Вставить("Номенклатура" ,Номенклатура);
		//Отбор.Вставить("Характеристика",Характеристика);
		//Отбор.Вставить("Партия", Партия);
		
		//Строки  = Запасы.НайтиСтроки(Отбор) ;	
		//Для Каждого Ст из Строки Цикл 
		//	Ст.Себестоимость = (СуммаКорректировки )*-1;	
		//КонецЦикла;
		
		
		Если (НЕ Окр(СуммаКорректировки, 2) = 0) Тогда
			
			//Запасы
			НаборЗаписейЗапасы[Инд].Сумма =  СуммаКорректировки ;
			НаборЗаписейЗапасы[Инд].ФиксированнаяСтоимость =  Истина ;
			//Продажи
			НаборЗаписейПродажи[Инд].Себестоимость = СуммаКорректировки ;	
			//Доходы и расходы
			НаборЗаписейДоходыИРасходы[0].СуммаРасходов = НаборЗаписейДоходыИРасходы[0].СуммаРасходов+ СуммаКорректировки ;	
			//ебестоимость закупки
			НаборЗаписейСебестоимостьЗакупки[Инд].Сумма =  СуммаКорректировки ; 
			//Хозрасчетный
			//НаборЗаписейХозрасчетный[ИндХозрасчетный].Сумма =  СуммаКорректировки ;
		КонецЕсли;
		Инд =Инд +1; 
		ИндХозрасчетный = ИндХозрасчетный +1 ;
		
		Если ТипЗнЧ(ДокументОснование) = ПредопределенноеЗначение("Документ.ЧекККМ") Тогда 
			
			НоваяСтрока = НаборЗаписейХозрасчетный1.Вставить(инд1);
			НоваяСтрока.Период = Дата;
			НоваяСтрока.Регистратор = Ссылка;
			НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
			//НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
			//НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
			НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
			НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
			НоваяСтрока.Содержание = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
			//НоваяСтрока.Сумма = СуммаКорректировки;
			НоваяСтрока.Сумма = -СуммаКорректировки;
			НоваяСтрока.КоличествоДт = ВыборкаДетальныеЗаписи.КоличествоВозвратов ;
			
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
			
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
			
			инд1 = инд1+1;
			НаборЗаписейХозрасчетный1.Записать(Истина);

		КонецЕсли;
		
	КонецЦикла;
	
	//Записать(РежимЗаписиДокумента.Проведение);
	
	// Пишем оставшиеся записи Учет запасов и затрат.
	НаборЗаписейЗапасы.Записать(Истина);
	
	// Пишем оставшиеся записи Продажи.
	НаборЗаписейПродажи.Записать(Истина);
	
	// Пишем оставшиеся записи Учет доходов и расходов.
	НаборЗаписейДоходыИРасходы.Записать(Истина);
	
	// Пишем оставшиеся записи Учет Себестоимость закупки 
	НаборЗаписейСебестоимостьЗакупки.Записать(Истина);
	
	
	//////// Пишем оставшиеся записи Управленческий.
	//////Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда  //+++ Дмгг
	//////	НаборЗаписейУправленческий.Записать(Истина);
	//////КонецЕсли;  //--- Дмгг
	
	// Пишем оставшиеся записи Хозрасчетный.
	//НаборЗаписейХозрасчетный.Записать(Истина);
	
	НаборЗаписейХозрасчетный1.Записать(Истина);
		
КонецПроцедуры

//--- Lazare_07.09.2021

//--------------------------------------------------------------------------
// © Шишка В.В. [29 сентября 2021]  НАЧАЛО
Функция ПолучитьСтавкиНаСервере(СуммаРасчетов)
	
	СтруктураВозврата = Новый Структура;
	
	СтавкаПФ = 0;
	тзСтавкиПФ = РегистрыСведений.УдержанияДляПенсионногоФонда.СрезПоследних(Дата, Новый Структура("Контрагент, Договор", Контрагент, Договор));
	Если тзСтавкиПФ.Количество() <> 0 Тогда 
		СтавкаПФ = тзСтавкиПФ[0].ВидУдержания.СтавкаПФ;
	КонецЕсли;
	
	СтавкаНДС = 0;
	Если НЕ НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		
		Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
		Иначе
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
		КонецЕсли;
	
	Иначе
		СтавкаНДС = Организация.СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
	Если Договор.УчитыватьНДФЛ Тогда          
		Если СуммаВключаетНДС Тогда 
			Ставки = РС_ОбщегоНазначения.ПолучитьЗначенииСтавок(0, Договор.ВидУдержанияНДФЛ);
			СуммаБезНалогов = СуммаРасчетов;
			СуммаНДФЛ		= Окр(СуммаРасчетов/((100-Ставки.СтавкаНДФЛ)/100)*(Ставки.СтавкаНДФЛ/100), 2);
			СуммаПФ			= Окр(((СуммаРасчетов+СуммаНДФЛ)/((100-СтавкаПФ)/100))*(СтавкаПФ/100), 2);
			//СуммаНДС		= Окр(СуммаРасчетов - СуммаРасчетов/(1+(Ставки.СтавкаНДС/100)), 2);
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаПФ;
			
			СтруктураВозврата.Вставить("СуммаНДФЛ",СуммаНДФЛ);
			СтруктураВозврата.Вставить("СуммаПФ", СуммаПФ);
			
		Иначе
			Ставки = РС_ОбщегоНазначения.ПолучитьЗначенииСтавок(0, Договор.ВидУдержанияНДФЛ);
			//СуммаНДФЛ = Окр(СуммаРасчетов/((100 - Ставки.СтавкаНДФЛ)/ Ставки.СтавкаНДФЛ), 2);
			//СтруктураВозврата.Вставить("СуммаНДФЛ",СуммаНДФЛ);
			//СтруктураВозврата.Вставить("СуммаПФ", Окр(((СуммаРасчетов+СуммаНДФЛ)/((100 - СтавкаПФ)/ 100)) - (СуммаРасчетов+СуммаНДФЛ), 2));
			СуммаБезНалогов = СуммаРасчетов;
			СуммаНДС		= Окр(СуммаРасчетов - СуммаРасчетов*((100-СтавкаНДС)/100), 2);
			СуммаНДФЛ		= Окр((СуммаРасчетов + СуммаНДС)/((100-Ставки.СтавкаНДФЛ)/100)*(Ставки.СтавкаНДФЛ/100), 2);
			СуммаПФ			= Окр(((СуммаРасчетов + СуммаНДС + СуммаНДФЛ)/((100-СтавкаПФ)/100)) * (СтавкаПФ / 100), 2);
			
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
			
			СтруктураВозврата.Вставить("СуммаНДФЛ",СуммаНДФЛ);
			СтруктураВозврата.Вставить("СуммаПФ", СуммаПФ);
			
		КонецЕсли;
	Иначе 
		СтруктураВозврата.Вставить("СуммаНДФЛ",0);
		СтруктураВозврата.Вставить("СуммаПФ", 0);
	КонецЕсли;

	Возврат СтруктураВозврата;
	
КонецФункции
	
// © Шишка В.В. [29 сентября 2021]  КОНЕЦ
//--------------------------------------------------------------------------


ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())); //+++ Дмгг
