
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыЗаполненияДокумента

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	// Инициализация данных документа.
	Документы.НевыходыНаРаботуСотрудников.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ОтразитьТаблицаНевыходыНаРаботуСотрудников(ДополнительныеСвойства, Движения, Отказ);
	
КонецПроцедуры

Процедура ОтразитьТаблицаНевыходыНаРаботуСотрудников(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаНевыходыНаРаботуСотрудников = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНевыходыНаРаботуСотрудников;
	
	Если Отказ
	 ИЛИ ТаблицаНевыходыНаРаботуСотрудников.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияНевыходыНаРаботуСотрудников = Движения.НевыходыНаРаботуСотрудников;
	ДвиженияНевыходыНаРаботуСотрудников.Записывать = Истина;
	ДвиженияНевыходыНаРаботуСотрудников.Загрузить(ТаблицаНевыходыНаРаботуСотрудников);
	
КонецПроцедуры





#КонецОбласти

	
	

	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
#КонецЕсли
	