
&Вместо("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства)
	
	МассивСчетовФинРезРасходы = РегламентированныйУчетСервер.ПолучитьСчетаФинРезРасход();
	МассивСчетовФинРезДоходы = РегламентированныйУчетСервер.ПолучитьСчетаФинРезДоход();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалютРасчетов.Валюта,
	|	КурсыВалютРасчетов.Курс,
	|	КурсыВалютРасчетов.Кратность
	|ПОМЕСТИТЬ КурсыВалютРасчетов
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаДокумента) КАК КурсыВалютРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютУчета.Валюта,
	|	КурсыВалютУчета.Курс,
	|	КурсыВалютУчета.Кратность
	|ПОМЕСТИТЬ КурсыВалютУчета
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Удержания.НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Удержания.Ссылка КАК Регистратор,
	|	Удержания.Ссылка.Дата КАК Период,
	|	Удержания.Ссылка.Организация,
	|	Удержания.Ссылка.СтруктурнаяЕдиница,
	|	Удержания.Ссылка.ВалютаДокумента КАК Валюта,
	|	Удержания.Сотрудник,
	|	Удержания.ВидУдержания,
	|	Удержания.ВидУдержания.Контрагент КАК Контрагент,
	|	Удержания.ВидУдержания.Договор КАК Договор,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА Удержания.Проект
	//|		ИНАЧЕ Значение(Справочник.Проекты.ПустаяСсылка)
	//|	 КОНЕЦ КАК Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }	
	 //_Lazare
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА Удержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ Удержания.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект, 
	 //Lazare_	
	|	Удержания.Ссылка.ПериодРегистрации,
	|	Удержания.Ссылка.ПериодРегистрации КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(Удержания.Ссылка.ПериодРегистрации, МЕСЯЦ) КАК ДатаОкончания,
	|	Удержания.Сотрудник.СчетРасчетовСПерсоналомРегл КАК СчетРасчетовСПерсоналомРегл,
	|	Удержания.ВидУдержания.СчетЗатрат КАК СчетЗатрат,
	|	Удержания.ВидУдержания.СчетЗатратРегл КАК СчетЗатратРегл,
	|	Удержания.ВидУдержания.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетРасчетовСКонтрагентомРегл,
	|	ВЫРАЗИТЬ(Удержания.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	Удержания.Сумма КАК СуммаВал,
	|	Удержания.ВидУдержанияПФ,
	|	Удержания.ВидУдержанияПФ.ПенсионныйНалогСотрудника КАК ПенсионныйНалогСотрудника,
	|	Удержания.ВидУдержанияПФ.ПенсионныйНалогОрганизации КАК ПенсионныйНалогОрганизации,
	|	Удержания.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	Удержания.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФОрганизации,
	|	Удержания.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	Удержания.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФСотрудника,
	|	Удержания.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	Удержания.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	ВЫРАЗИТЬ(Удержания.СуммаПФ * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаПФ,
	|	Удержания.СуммаПФ КАК СуммаПФВал,
	|	Удержания.ВидУдержанияПФ.СчетЗатрат КАК СчетЗатратПФ,
	|	Удержания.ВидУдержанияПФ.СчетЗатратРегл КАК СчетЗатратПФРегл,
	|	Удержания.ВидУдержанияНДФЛ,
	|	Удержания.ВидУдержанияНДФЛ.ВидНалога КАК НДФЛНачислении,
	|	Удержания.ВидУдержанияНДФЛ.ВидНалогаВыплат КАК НДФЛКОплате,
	|	ВЫРАЗИТЬ(Удержания.СуммаНДФЛ * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДФЛ,
	|	Удержания.СуммаНДФЛ КАК СуммаНДФЛВал,
	|	Удержания.ВидУдержанияНДФЛ.СчетЗатрат КАК СчетЗатратНДФЛ,
	|	Удержания.ВидУдержанияНДФЛ.СчетЗатратРегл КАК СчетЗатратНДФЛРегл,
	|	Удержания.ВидУдержанияНДФЛ.ВидНалога.СчетУчета КАК НДФЛНачисленииСчетУчета,
	|	Удержания.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК НДФЛНачисленииСчетУчетаРегл,
	|	Удержания.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещению КАК НДФЛКОплатеСчетУчета,
	|	Удержания.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК НДФЛКОплатеСчетУчетаРегл,
	|	Удержания.ВидУдержания.Тип,
	|	Удержания.Ссылка,
	|	Удержания.СуммаЛгот КАК СуммаЛгот
	|ПОМЕСТИТЬ Удержания
	|ИЗ
	|	Документ.НачислениеЗарплаты.Удержания КАК Удержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютУчета КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютРасчетов КАК КурсыВалютРасчетов
	|		ПО Удержания.Ссылка.ВалютаДокумента = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	Удержания.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки КАК НомерСтроки,
	|	НачислениеЗарплатыНачисленияУдержания.Ссылка.Дата КАК Период,
	|	НачислениеЗарплатыНачисленияУдержания.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплатыНачисленияУдержания.Ссылка.ВалютаДокумента КАК Валюта,
	|	НачислениеЗарплатыНачисленияУдержания.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Сотрудник,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл КАК СчетЗатратРегл,
	|	НачислениеЗарплатыНачисленияУдержания.ЗаказПокупателя КАК ЗаказПокупателя,
	|	НачислениеЗарплатыНачисленияУдержания.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НачислениеЗарплатыНачисленияУдержания.ДатаНачала КАК ДатаНачала,
	|	НачислениеЗарплатыНачисленияУдержания.ДатаОкончания КАК ДатаОкончания,
	//ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	НачислениеЗарплатыНачисленияУдержания.ОтработаноДней КАК ОтработаноДней,
	//|	НачислениеЗарплатыНачисленияУдержания.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.ОтработаноДнейПоПроекту
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.ОтработаноДней
	|	 КОНЕЦ КАК ОтработаноДней,
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.ОтработаноЧасовПоПроекту
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.ОтработаноЧасов
	|	 КОНЕЦ КАК ОтработаноЧасов,
	//ПодольскийАИ #УчетПроектов 23.10.2020 }
	|	НачислениеЗарплатыНачисленияУдержания.Размер КАК Размер,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Проект
	//|		ИНАЧЕ Значение(Справочник.Проекты.ПустаяСсылка)
	//|	 КОНЕЦ КАК Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_Lazare
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА НачислениеЗарплатыНачисленияУдержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК Проект, 
	 //Lazare_
	|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисленияУдержания.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ,
	|	НачислениеЗарплатыНачисленияУдержания.СуммаПФ КАК СуммаПФВал,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисленияУдержания.СуммаПФ * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаПФ,
	|	НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.ПенсионныйНалогСотрудника КАК ПенсионныйНалогСотрудника,
	|	НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.ПенсионныйНалогОрганизации КАК ПенсионныйНалогОрганизации,
	|	НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.СчетЗатрат КАК СчетЗатратПФ,
	|	НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.СчетЗатратРегл КАК СчетЗатратРеглПФ,
	|	НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.Контрагент КАК Контрагент,
	|	НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.Договор КАК Договор,
	|	НачислениеЗарплатыНачисленияУдержания.Сумма КАК СуммаВал,
	|   0
	// +++ { AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili
	|	,НачислениеЗарплатыНачисленияУдержания.AzRyDivision КАК AzRyDivision
	// +++ } AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili
	|ПОМЕСТИТЬ ТаблицаНачисления
	|ИЗ
	|	Документ.НачислениеЗарплаты.НачисленияУдержания КАК НачислениеЗарплатыНачисленияУдержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютУчета КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютРасчетов КАК КурсыВалютРасчетов
	|		ПО НачислениеЗарплатыНачисленияУдержания.Ссылка.ВалютаДокумента = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки,
	|	НачислениеЗарплатыНачисленияУдержания.Ссылка.Дата,
	|	НачислениеЗарплатыНачисленияУдержания.Ссылка.ПериодРегистрации,
	|	НачислениеЗарплатыНачисленияУдержания.Ссылка.ВалютаДокумента,
	|	НачислениеЗарплатыНачисленияУдержания.Ссылка.СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.ВидНалога.СчетУчета,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.ВидНалога.СчетУчетаРегл,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	|	НачислениеЗарплатыНачисленияУдержания.Ссылка.ПериодРегистрации,
	|	КОНЕЦПЕРИОДА(НачислениеЗарплатыНачисленияУдержания.Ссылка.ПериодРегистрации, МЕСЯЦ),
	|	0,
	|	0,
	|	0,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам 
	//|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Проект
	//|		ИНАЧЕ Значение(Справочник.Проекты.ПустаяСсылка)
	//|	 КОНЕЦ,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	 //_Lazare
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам 
	|			ТОГДА 
	|       		ВЫбор
	|					КОГДА НачислениеЗарплатыНачисленияУдержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|                      ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|                    ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Проект 
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ, 
	 //Lazare_
	|	ВЫРАЗИТЬ(НачислениеЗарплатыНачисленияУдержания.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)),
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НачислениеЗарплатыНачисленияУдержания.Сумма,
	|   НачислениеЗарплатыНачисленияУдержания.СуммаЛгот
	// +++ { AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili
	|	,НЕОПРЕДЕЛЕНО
	// +++ } AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili
	|ИЗ
	|	Документ.НачислениеЗарплаты.НалогиНаДоходы КАК НачислениеЗарплатыНачисленияУдержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютУчета КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютРасчетов КАК КурсыВалютРасчетов
	|		ПО НачислениеЗарплатыНачисленияУдержания.Ссылка.ВалютаДокумента = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	НачислениеЗарплатыВзносы.НомерСтроки КАК НомерСтроки,
	|	НачислениеЗарплатыВзносы.Ссылка.Дата КАК Период,
	|	НачислениеЗарплатыВзносы.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплатыВзносы.Ссылка.ВалютаДокумента КАК Валюта,
	|	НачислениеЗарплатыВзносы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплатыВзносы.Сотрудник КАК Сотрудник,
	|	НачислениеЗарплатыВзносы.СчетЗатрат КАК СчетЗатрат,
	|	НачислениеЗарплатыВзносы.СчетЗатратРегл КАК СчетЗатратРегл,
	|	НачислениеЗарплатыВзносы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	НачислениеЗарплатыВзносы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НачислениеЗарплатыВзносы.Ссылка.ПериодРегистрации КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(НачислениеЗарплатыВзносы.Ссылка.ПериодРегистрации, МЕСЯЦ) КАК ДатаОкончания,
	|	0 КАК ОтработаноДней,
	|	0 КАК ОтработаноЧасов,
	|	0 КАК Размер,
	|	НачислениеЗарплатыВзносы.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	//ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	Значение(Справочник.Проекты.ПустаяСсылка) КАК Проект,
	|   ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) КАК Проект, //++Lazare_05.02.2021
	//ПодольскийАИ #УчетПроектов 23.10.2020 }
	|	ВЫРАЗИТЬ(НачислениеЗарплатыВзносы.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	НачислениеЗарплатыВзносы.Сумма КАК СуммаВал
	|ПОМЕСТИТЬ ТаблицаВзносов
	|ИЗ
	|	Документ.НачислениеЗарплаты.Взносы КАК НачислениеЗарплатыВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютУчета КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютРасчетов КАК КурсыВалютРасчетов
	|		ПО НачислениеЗарплатыВзносы.Ссылка.ВалютаДокумента = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	НачислениеЗарплатыВзносы.Ссылка = &Ссылка 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	НачислениеЗарплатыПогашениеЗаймов.НомерСтроки КАК НомерСтроки,
	|	НачислениеЗарплатыПогашениеЗаймов.Ссылка.Дата КАК Период,
	|	НачислениеЗарплатыПогашениеЗаймов.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплатыПогашениеЗаймов.Ссылка.ВалютаДокумента КАК Валюта,
	|	НачислениеЗарплатыПогашениеЗаймов.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплатыПогашениеЗаймов.Сотрудник КАК Сотрудник,
	|	НачислениеЗарплатыПогашениеЗаймов.ДоговорЗаймаСотруднику КАК ДоговорЗаймаСотруднику,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.ПогашеноЗайма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК ПогашеноЗайма,
	|	НачислениеЗарплатыПогашениеЗаймов.ПогашеноЗайма КАК ПогашеноЗаймаВал,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияНДФЛ.ВидНалога КАК НДФЛНачислении,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияНДФЛ.ВидНалогаВыплат КАК НДФЛКОплате,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияНДФЛ.СчетЗатрат КАК СчетЗатратНДФЛ,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияНДФЛ.СчетЗатратРегл КАК СчетЗатратНДФЛРегл,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияНДФЛ.ВидНалога.СчетУчета КАК НДФЛНачисленииСчетУчета,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК НДФЛНачисленииСчетУчетаРегл,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещению КАК НДФЛКОплатеСчетУчета,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК НДФЛКОплатеСчетУчетаРегл,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияПФ,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияПФ.ПенсионныйНалогСотрудника КАК ПенсионныйНалогСотрудника,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияПФ.ПенсионныйНалогОрганизации КАК ПенсионныйНалогОрганизации,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФОрганизации,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФСотрудника,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияПФ.СчетЗатрат КАК СчетЗатратПФ,
	|	НачислениеЗарплатыПогашениеЗаймов.ВидУдержанияПФ.СчетЗатратРегл КАК СчетЗатратПФРегл,
	   //(СтрокаТЧ.Сумма + СтрокаТЧ.СуммаНДФЛ) * СтавкаПФ / (100 - СтавкаПФ);
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.СуммаНДФЛПогашеноЗайма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК НДФЛ_ПогашеноЗайма,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.СуммаНДФЛПогашеноЗайма КАК ЧИСЛО (15,2)) КАК НДФЛ_ПогашеноЗаймаВал,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.СуммаПФПогашеноЗайма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК ПФ_ПогашеноЗайма,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.СуммаПФПогашеноЗайма КАК ЧИСЛО (15,2)) КАК ПФ_ПогашеноЗаймаВал,
	|	НачислениеЗарплатыПогашениеЗаймов.Ссылка.ПериодРегистрации КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(НачислениеЗарплатыПогашениеЗаймов.Ссылка.ПериодРегистрации, МЕСЯЦ) КАК ДатаОкончания,
	|	НачислениеЗарплатыПогашениеЗаймов.НачисленоПроцентов КАК НачисленоПроцентовВал,
	|	НачислениеЗарплатыПогашениеЗаймов.ПогашеноПроцентов КАК ПогашеноПроцентовВал,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.НачисленоПроцентов * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК НачисленоПроцентов,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.ПогашеноПроцентов * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК ПогашеноПроцентов,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.СуммаНДФЛПогашеноПроцентов * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК НДФЛ_ПогашеноПроцентов,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.СуммаНДФЛПогашеноПроцентов КАК ЧИСЛО(15, 2)) КАК НДФЛ_ПогашеноПроцентовВал,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.СуммаПФПогашеноПроцентов * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК ПФ_ПогашеноПроцентов,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.СуммаПФПогашеноПроцентов КАК ЧИСЛО(15, 2)) КАК ПФ_ПогашеноПроцентовВал,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.СуммаЛгот КАК ЧИСЛО(15, 2)) КАК СуммаЛгот,
	|	ВЫРАЗИТЬ(НачислениеЗарплатыПогашениеЗаймов.СуммаЛготПроцента КАК ЧИСЛО(15, 2)) КАК СуммаЛготПроцента
	|ПОМЕСТИТЬ ТаблицаПогашениеЗаймов
	|ИЗ
	|	Документ.НачислениеЗарплаты.ПогашениеЗаймов КАК НачислениеЗарплатыПогашениеЗаймов
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютУчета КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютРасчетов КАК КурсыВалютРасчетов
	|		ПО НачислениеЗарплатыПогашениеЗаймов.Ссылка.ВалютаДокумента = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	НачислениеЗарплатыПогашениеЗаймов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	НачислениеЗарплатыНачисленияУдержания.Период КАК Период,
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплатыНачисленияУдержания.Валюта КАК Валюта,
	|	НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Сотрудник,
	|	НачислениеЗарплатыНачисленияУдержания.ДатаНачала КАК ДатаНачала,
	|	НачислениеЗарплатыНачисленияУдержания.ДатаОкончания КАК ДатаОкончания,
	|	НачислениеЗарплатыНачисленияУдержания.ОтработаноДней КАК ОтработаноДней,
	|	НачислениеЗарплатыНачисленияУдержания.ОтработаноЧасов КАК ОтработаноЧасов,
	|	НачислениеЗарплатыНачисленияУдержания.Размер КАК Размер,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	НачислениеЗарплатыНачисленияУдержания.Проект КАК Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_lazare
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare_
	|	НачислениеЗарплатыНачисленияУдержания.Сумма КАК Сумма,
	|	НачислениеЗарплатыНачисленияУдержания.СуммаВал КАК СуммаВал	
	// +++ { AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili
	|	,НачислениеЗарплатыНачисленияУдержания.AzRyDivision КАК AzRyDivision
	// +++ } AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili		
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	НачислениеЗарплатыНачисленияУдержания.Период,
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации,
	|	НачислениеЗарплатыНачисленияУдержания.Валюта,
	|	НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник,
	|	НачислениеЗарплатыНачисленияУдержания.ДатаНачала,
	|	НачислениеЗарплатыНачисленияУдержания.ДатаОкончания,
	|	НачислениеЗарплатыНачисленияУдержания.ОтработаноДней,
	|	НачислениеЗарплатыНачисленияУдержания.ОтработаноЧасов,
	|	0,
	|	НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	НачислениеЗарплатыНачисленияУдержания.Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_lazare
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Проект
	|	КОНЕЦ,
	//Lazare
	|	НачислениеЗарплатыНачисленияУдержания.СуммаПФ,
	|	НачислениеЗарплатыНачисленияУдержания.СуммаПФВал
	
	// +++ { AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili
	|	,НачислениеЗарплатыНачисленияУдержания.AzRyDivision
	// +++ } AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili	
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.СуммаПФ > 0
	|	И НЕ НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Удержания.Организация,
	|	Удержания.Период,
	|	Удержания.ПериодРегистрации,
	|	Удержания.Валюта,
	|	Удержания.СтруктурнаяЕдиница,
	|	Удержания.Сотрудник,
	|	Удержания.ДатаНачала,
	|	Удержания.ДатаОкончания,
	|	0,
	|	0,
	|	0,
	|	Удержания.ВидУдержания,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	Удержания.Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_lazare
	|	ВЫБОР
	|		КОГДА Удержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ Удержания.Проект
	|	КОНЕЦ,
	//Lazare
	|	Удержания.Сумма,
	|	Удержания.СуммаВал
	// +++ { AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili
	|	,НЕОПРЕДЕЛЕНО
	// +++ } AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili	
	|ИЗ
	|	Удержания КАК Удержания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	НачислениеЗарплатыНачисленияУдержания.Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации КАК ПериодРегистрации,
	|	НачислениеЗарплатыНачисленияУдержания.Валюта КАК Валюта,
	|	НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Сотрудник,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	НачислениеЗарплатыНачисленияУдержания.Проект КАК Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_lazare
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.СуммаВал
	|		ИНАЧЕ -1 * НачислениеЗарплатыНачисленияУдержания.СуммаВал
	|	КОНЕЦ КАК СуммаВал,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Сумма
	|		ИНАЧЕ -1 * НачислениеЗарплатыНачисленияУдержания.Сумма
	|	КОНЕЦ КАК Сумма,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом КАК СчетУчета,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналомРегл КАК СчетУчетаРегл,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит) КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог)
	|			ТОГДА ВЫРАЗИТЬ(&НачисленНалог КАК СТРОКА(100))
	|		ИНАЧЕ ВЫРАЗИТЬ(&НачислениеЗарплаты КАК СТРОКА(100))
	|	КОНЕЦ КАК СодержаниеПроводки
	// +++ { AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili
	|	,НачислениеЗарплатыНачисленияУдержания.AzRyDivision КАК AzRyDivision 
	// +++ } AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili	
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.СуммаВал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	НачислениеЗарплатыНачисленияУдержания.Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	НачислениеЗарплатыНачисленияУдержания.ПериодРегистрации,
	|	НачислениеЗарплатыНачисленияУдержания.Валюта,
	|	НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	НачислениеЗарплатыНачисленияУдержания.Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_lazare
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Проект
	|	КОНЕЦ,
	//Lazare
	|	-1 * НачислениеЗарплатыНачисленияУдержания.СуммаПФВал,
	|	-1 * НачислениеЗарплатыНачисленияУдержания.СуммаПФ,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналомРегл,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит),
	|	ВЫРАЗИТЬ(&НалогПенсионногоФонда КАК СТРОКА(100))
	// +++ { AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili
	|	,НачислениеЗарплатыНачисленияУдержания.AzRyDivision 
	// +++ } AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili	
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.СуммаПФВал <> 0
	|	И НЕ НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Удержания.Организация,
	|	Удержания.Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Удержания.ПериодРегистрации,
	|	Удержания.Валюта,
	|	Удержания.СтруктурнаяЕдиница,
	|	Удержания.Сотрудник,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	Удержания.Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_lazare
	|	ВЫБОР
	|		КОГДА Удержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ Удержания.Проект
	|	КОНЕЦ,
	//Lazare
	|	Удержания.СуммаВал,
	|	Удержания.Сумма,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫРАЗИТЬ(&Удержание КАК СТРОКА(100))
	// +++ { AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili
	|	,НЕОПРЕДЕЛЕНО 
	// +++ } AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili	
	|ИЗ
	|	Удержания КАК Удержания
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Удержания.ВидУдержанияТип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|				ИЛИ Удержания.ВидУдержанияТип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.УдержаниеДляКонтрагента)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НачислениеЗарплатыНачисленияУдержания.Период КАК Период,
	|	&Организация КАК Организация,
	|	НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	НачислениеЗарплатыНачисленияУдержания.Проект КАК Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_lazare
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатрат КАК СчетУчета,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл КАК СчетЗатратРегл,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл КАК СчетУчетаРегл,
	|	НачислениеЗарплатыНачисленияУдержания.ЗаказПокупателя КАК ЗаказПокупателя,
	//--------------------------------------------------------------------------
	// © Шишка В.В. [31 мая 2022 г.]  НАЧАЛО
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|			ТОГДА -1 * НачислениеЗарплатыНачисленияУдержания.Сумма
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Сумма
	|	КОНЕЦ КАК Сумма,
	// © Шишка В.В. [31 мая 2022 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет) КАК ВидДвиженияУправленческий,
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	ВЫРАЗИТЬ(&НачислениеЗарплаты КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип <> ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог)
	|	И ВЫБОР
	|			КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|				ТОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|						ИЛИ НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|			ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|					ИЛИ НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|		КОНЕЦ
	|	И НачислениеЗарплатыНачисленияУдержания.СуммаВал <> 0
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 июня 2022 г.]  НАЧАЛО
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НачислениеЗарплатыНачисленияУдержания.Период КАК Период,
	|	&Организация КАК Организация,
	|	НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатрат КАК СчетУчета,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл КАК СчетЗатратРегл,
	|	НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.СчетЗатратРегл КАК СчетУчетаРегл,
	|	НачислениеЗарплатыНачисленияУдержания.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|			ТОГДА -1 * НачислениеЗарплатыНачисленияУдержания.СуммаПФ
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.СуммаПФ
	|	КОНЕЦ КАК Сумма,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет) КАК ВидДвиженияУправленческий,
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	ВЫРАЗИТЬ(&НачислениеЗарплаты КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип <> ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог)
	|	И ВЫБОР
	|			КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|				ТОГДА НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|						ИЛИ НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И НачислениеЗарплатыНачисленияУдержания.СуммаПФ <> 0
	// © Шишка В.В. [1 июня 2022 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыВзносы.НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	НачислениеЗарплатыВзносы.Период,
	|	&Организация,
	|	НачислениеЗарплатыВзносы.СтруктурнаяЕдиница,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	НачислениеЗарплатыВзносы.Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_lazare
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыВзносы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ НачислениеЗарплатыВзносы.Проект
	|	КОНЕЦ ,
	//Lazare
	|	НачислениеЗарплатыВзносы.СчетЗатрат,
	|	НачислениеЗарплатыВзносы.СчетЗатрат,
	|	НачислениеЗарплатыВзносы.СчетЗатратРегл,
	|	НачислениеЗарплатыВзносы.СчетЗатратРегл,
	|	НачислениеЗарплатыВзносы.ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыВзносы.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|			ТОГДА -1 * НачислениеЗарплатыВзносы.Сумма
	|		ИНАЧЕ НачислениеЗарплатыВзносы.Сумма
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет),
	|	ИСТИНА,
	|	ВЫРАЗИТЬ(&НачислениеЗарплаты КАК СТРОКА(100))
	|ИЗ
	|	ТаблицаВзносов КАК НачислениеЗарплатыВзносы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|				ТОГДА НачислениеЗарплатыВзносы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|						ИЛИ НачислениеЗарплатыВзносы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|			ИНАЧЕ НачислениеЗарплатыВзносы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|					ИЛИ НачислениеЗарплатыВзносы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|		КОНЕЦ
	|	И НачислениеЗарплатыВзносы.СуммаВал <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки КАК НомерСтроки,
	|	НачислениеЗарплатыНачисленияУдержания.Период КАК Период,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ВЫБОР
	|					КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|						ТОГДА НачислениеЗарплатыНачисленияУдержания.НаправлениеДеятельности
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ТОГДА НачислениеЗарплатыНачисленияУдержания.НаправлениеДеятельности
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|			КОНЕЦ
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ВЫБОР
	|					КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|						ТОГДА НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ТОГДА НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	НачислениеЗарплатыНачисленияУдержания.Проект КАК Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_lazare
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатрат КАК СчетУчета,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл КАК СчетУчетаРегл,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл КАК СчетЗатратРегл,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Аналитика,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|			ТОГДА -1 * НачислениеЗарплатыНачисленияУдержания.Сумма
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ВЫБОР
	|					КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|						ТОГДА НачислениеЗарплатыНачисленияУдержания.ЗаказПокупателя
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ТОГДА НачислениеЗарплатыНачисленияУдержания.ЗаказПокупателя
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет) КАК ВидДвиженияУправленческий,
	|	ВЫРАЗИТЬ(&НачислениеЗарплаты КАК СТРОКА(100)) КАК СодержаниеПроводки
	// +++ { AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili
	|	,НачислениеЗарплатыНачисленияУдержания.AzRyDivision КАК AzRyDivision
	// +++ } AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili	
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип <> ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог)
	|	И ВЫБОР
	|			КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|				ТОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл.ТипСчета В (ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|						ИЛИ НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл В (&СчетаФинРезРасходы, &СчетаФинРезДоходы)
	|			ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.ТипСчета В (ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|					ИЛИ НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл В (&СчетаФинРезРасходы, &СчетаФинРезДоходы)
	|		КОНЕЦ
	|	И НачислениеЗарплатыНачисленияУдержания.СуммаВал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияВзносы.НомерСтроки,
	|	НачислениеЗарплатыНачисленияВзносы.Период,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ВЫБОР
	|					КОГДА НачислениеЗарплатыНачисленияВзносы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|						ТОГДА НачислениеЗарплатыНачисленияВзносы.НаправлениеДеятельности
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НачислениеЗарплатыНачисленияВзносы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ТОГДА НачислениеЗарплатыНачисленияВзносы.НаправлениеДеятельности
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ВЫБОР
	|					КОГДА НачислениеЗарплатыНачисленияВзносы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|						ТОГДА НачислениеЗарплатыНачисленияВзносы.СтруктурнаяЕдиница
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НачислениеЗарплатыНачисленияВзносы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ТОГДА НачислениеЗарплатыНачисленияВзносы.СтруктурнаяЕдиница
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ,
	|	НачислениеЗарплатыНачисленияВзносы.СчетЗатрат,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	НачислениеЗарплатыНачисленияВзносы.Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_lazare
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияВзносы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ НачислениеЗарплатыНачисленияВзносы.Проект
	|	КОНЕЦ,
	//Lazare
	|	НачислениеЗарплатыНачисленияВзносы.СчетЗатрат,
	|	НачислениеЗарплатыНачисленияВзносы.СчетЗатратРегл,
	|	НачислениеЗарплатыНачисленияВзносы.СчетЗатратРегл,
	|	НачислениеЗарплатыНачисленияВзносы.Сотрудник,
	|	НачислениеЗарплатыНачисленияВзносы.Сумма,
	|	0,
	|	НачислениеЗарплатыНачисленияВзносы.Сумма,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ВЫБОР
	|					КОГДА НачислениеЗарплатыНачисленияВзносы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|						ТОГДА НачислениеЗарплатыНачисленияВзносы.ЗаказПокупателя
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НачислениеЗарплатыНачисленияВзносы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ТОГДА НачислениеЗарплатыНачисленияВзносы.ЗаказПокупателя
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет),
	|	ВЫРАЗИТЬ(&НачислениеВзносов КАК СТРОКА(100))
	// +++ { AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili
	|	,НЕОПРЕДЕЛЕНО
	// +++ } AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili	
	|ИЗ
	|	ТаблицаВзносов КАК НачислениеЗарплатыНачисленияВзносы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|				ТОГДА НачислениеЗарплатыНачисленияВзносы.СчетЗатратРегл.ТипСчета В (ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|						ИЛИ НачислениеЗарплатыНачисленияВзносы.СчетЗатратРегл В (&СчетаФинРезРасходы, &СчетаФинРезДоходы)
	|			ИНАЧЕ НачислениеЗарплатыНачисленияВзносы.СчетЗатрат.ТипСчета В (ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы), ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|					ИЛИ НачислениеЗарплатыНачисленияВзносы.СчетЗатратРегл В (&СчетаФинРезРасходы, &СчетаФинРезДоходы)
	|		КОНЕЦ
	|	И НачислениеЗарплатыНачисленияВзносы.СуммаВал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки,
	|	НачислениеЗарплатыНачисленияУдержания.Период,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ВЫБОР
	|					КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатратРеглПФ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|						ТОГДА НачислениеЗарплатыНачисленияУдержания.НаправлениеДеятельности
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатратПФ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ТОГДА НачислениеЗарплатыНачисленияУдержания.НаправлениеДеятельности
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ВЫБОР
	|					КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатратРеглПФ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|						ТОГДА НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатратПФ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ТОГДА НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	НачислениеЗарплатыНачисленияУдержания.Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_lazare
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Проект
	|	КОНЕЦ,
	//Lazare
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатратПФ,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатратПФ,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатратРеглПФ,
	|	НачислениеЗарплатыНачисленияУдержания.СчетЗатратРеглПФ,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник,
	|	НачислениеЗарплатыНачисленияУдержания.СуммаПФ,
	|	0,
	|	-1 * НачислениеЗарплатыНачисленияУдержания.СуммаПФ,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ВЫБОР
	|					КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатратРеглПФ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|						ТОГДА НачислениеЗарплатыНачисленияУдержания.ЗаказПокупателя
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатратПФ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|					ТОГДА НачислениеЗарплатыНачисленияУдержания.ЗаказПокупателя
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет),
	|	ВЫРАЗИТЬ(&УдержаниеПенсионногоФонда КАК СТРОКА(100))
	// +++ { AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili
	|	,НачислениеЗарплатыНачисленияУдержания.AzRyDivision
	// +++ } AzRy - [04.08.2022] - Jira: - Developer: George Mamulashvili
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НЕ НачислениеЗарплатыНачисленияУдержания.СуммаПФВал = 0
	|	И НЕ НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	//--------------------------------------------------------------------------
	// © Шишка В.В. [31 мая 2022 г.]  НАЧАЛО
	|	И ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|				И НЕ НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета В (ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|						, НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))
	|		ТОГДА ИСТИНА
	|		КОГДА НЕ &ИспользованиеТолькоРеглПланаСчетов И НЕ НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета В (ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|					, НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))
	|	ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ	
	// © Шишка В.В. [31 мая 2022 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НачислениеЗарплатыНачисленияУдержания.Период КАК Период,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.ВидНалога КАК ВидНалога,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.ВидНалога.СчетУчета КАК СчетУчета,
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.ВидНалога.СчетУчетаРегл КАК СчетУчетаРегл,
	|	НачислениеЗарплатыНачисленияУдержания.Сумма,
	|	ВЫРАЗИТЬ(&НачисленНалог КАК СТРОКА(100)) КАК СодержаниеПроводки,
	|   ЛОЖЬ КАК Распределить
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог)
	|	И НачислениеЗарплатыНачисленияУдержания.СуммаВал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	НачислениеЗарплатыНачисленияВзносы.Период,
	|	НачислениеЗарплатыНачисленияВзносы.ВидНачисленияУдержания.ВидНалога,
	|	НачислениеЗарплатыНачисленияВзносы.ВидНачисленияУдержания.ВидНалога.СчетУчета,
	|	НачислениеЗарплатыНачисленияВзносы.ВидНачисленияУдержания.ВидНалога.СчетУчетаРегл,
	|	НачислениеЗарплатыНачисленияВзносы.Сумма,
	|	ВЫРАЗИТЬ(&НачисленНалог КАК СТРОКА(100)),
	|   ЛОЖЬ
	|ИЗ
	|	ТаблицаВзносов КАК НачислениеЗарплатыНачисленияВзносы
	|ГДЕ
	|	НачислениеЗарплатыНачисленияВзносы.СуммаВал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Удержания.Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Удержания.Период,
	|	Удержания.НДФЛНачислении,
	|	Удержания.НДФЛНачисленииСчетУчета,
	|	Удержания.НДФЛНачисленииСчетУчетаРегл,
	|	Удержания.СуммаНДФЛ,
	|	ВЫРАЗИТЬ(&НачисленНалог КАК СТРОКА(100)),
	|   ИСТИНА
	|ИЗ
	|	Удержания КАК Удержания
	|ГДЕ
	|	НЕ Удержания.СуммаНДФЛВал = 0
	|	И ВЫБОР
	|			КОГДА Удержания.ВидУдержанияТип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|					ИЛИ &СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении
	|						И Удержания.ВидУдержанияТип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.УдержаниеДляКонтрагента)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Удержания.Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Удержания.Период,
	|	Удержания.НДФЛКОплате,
	|	Удержания.НДФЛКОплатеСчетУчета,
	|	Удержания.НДФЛКОплатеСчетУчетаРегл,
	|	Удержания.СуммаНДФЛ,
	|	ВЫРАЗИТЬ(&НДФЛКОплате КАК СТРОКА(100)),
	|   ИСТИНА
	|ИЗ
	|	Удержания КАК Удержания
	|ГДЕ
	|	НЕ Удержания.СуммаНДФЛВал = 0
	|	И ВЫБОР
	|			КОГДА Удержания.ВидУдержанияТип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|					ИЛИ &СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении
	|						И Удержания.ВидУдержанияТип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.УдержаниеДляКонтрагента)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	//+++ Дмгг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	НачислениеЗарплатыПогашениеЗаймов.Период,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛКОплате,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛКОплатеСчетУчета,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛКОплатеСчетУчетаРегл,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛ_ПогашеноЗайма,
	|	ВЫРАЗИТЬ(&НДФЛКОплате КАК СТРОКА(100)),
	|   ИСТИНА
	|ИЗ
	|	ТаблицаПогашениеЗаймов КАК НачислениеЗарплатыПогашениеЗаймов
	|ГДЕ
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛ_ПогашеноЗайма <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыПогашениеЗаймов.Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	НачислениеЗарплатыПогашениеЗаймов.Период,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛНачислении,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛНачисленииСчетУчета,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛНачисленииСчетУчетаРегл,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛ_ПогашеноЗайма,
	|	ВЫРАЗИТЬ(&НачисленНалог КАК СТРОКА(100)),
	|   ИСТИНА
	|ИЗ
	|	ТаблицаПогашениеЗаймов КАК НачислениеЗарплатыПогашениеЗаймов
	|ГДЕ
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛ_ПогашеноЗайма <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	НачислениеЗарплатыПогашениеЗаймов.Период,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛКОплате,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛКОплатеСчетУчета,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛКОплатеСчетУчетаРегл,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛ_ПогашеноПроцентов,
	|	ВЫРАЗИТЬ(&НДФЛКОплате КАК СТРОКА(100)),
	|   ИСТИНА
	|ИЗ
	|	ТаблицаПогашениеЗаймов КАК НачислениеЗарплатыПогашениеЗаймов
	|ГДЕ
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛ_ПогашеноПроцентов <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыПогашениеЗаймов.Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	НачислениеЗарплатыПогашениеЗаймов.Период,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛНачислении,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛНачисленииСчетУчета,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛНачисленииСчетУчетаРегл,
	|	НачислениеЗарплатыПогашениеЗаймов.НДФЛ_ПогашеноПроцентов,
	|	ВЫРАЗИТЬ(&НачисленНалог КАК СТРОКА(100)),
	|   ИСТИНА
	|ИЗ
	|	ТаблицаПогашениеЗаймов КАК НачислениеЗарплатыПогашениеЗаймов
	|ГДЕ
	|	НЕ НачислениеЗарплатыПогашениеЗаймов.НДФЛ_ПогашеноПроцентов = 0
	//--- Дмгг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки КАК НомерСтроки,
	|	НачислениеЗарплатыНачисленияУдержания.Период КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.СчетЗатрат
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА (НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|					ИЛИ НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог))
	|					И НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом.Валютный
	|				ИЛИ НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|					И НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.Валютный
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА (НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|					ИЛИ НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог))
	|					И НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом.Валютный
	|				ИЛИ НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|					И НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.Валютный
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалДт,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.СчетЗатрат
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА (НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|					ИЛИ НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог))
	|					И НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.Валютный
	|				ИЛИ НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|					И НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом.Валютный
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА (НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|					ИЛИ НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог))
	|					И НачислениеЗарплатыНачисленияУдержания.СчетЗатрат.Валютный
	|				ИЛИ НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|					И НачислениеЗарплатыНачисленияУдержания.Сотрудник.СчетРасчетовСПерсоналом.Валютный
	|			ТОГДА НачислениеЗарплатыНачисленияУдержания.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалКт,
	|	НачислениеЗарплатыНачисленияУдержания.Сумма КАК Сумма,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог)
	|				ТОГДА &НачисленНалог
	|			ИНАЧЕ &НачислениеЗарплаты
	|		КОНЕЦ КАК СТРОКА(100)) КАК Содержание
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.СуммаВал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЗарплатыВзносы.НомерСтроки,
	|	НачислениеЗарплатыВзносы.Период,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	НачислениеЗарплатыВзносы.СчетЗатрат,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыВзносы.СчетЗатрат.Валютный
	|			ТОГДА НачислениеЗарплатыВзносы.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыВзносы.СчетЗатрат.Валютный
	|			ТОГДА НачислениеЗарплатыВзносы.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НачислениеЗарплатыВзносы.ВидНачисленияУдержания.ВидНалога.СчетУчета,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыВзносы.ВидНачисленияУдержания.ВидНалога.СчетУчета.Валютный
	|			ТОГДА НачислениеЗарплатыВзносы.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыВзносы.ВидНачисленияУдержания.ВидНалога.СчетУчета.Валютный
	|			ТОГДА НачислениеЗарплатыВзносы.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	НачислениеЗарплатыВзносы.Сумма,
	|	ВЫРАЗИТЬ(&НачислениеВзносов КАК СТРОКА(100))
	|ИЗ
	|	ТаблицаВзносов КАК НачислениеЗарплатыВзносы
	|ГДЕ
	|	НачислениеЗарплатыВзносы.СуммаВал <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПримененныеВычетыПоНДФЛ.Ссылка.Дата КАК Период,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ПримененныеВычетыПоНДФЛ.Сотрудник КАК Сотрудник,
	|	ПримененныеВычетыПоНДФЛ.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|	ПримененныеВычетыПоНДФЛ.КодВычета КАК КодВычета,
	|	ПримененныеВычетыПоНДФЛ.СуммаВычета КАК СуммаВычета
	|ИЗ
	|	Документ.НачислениеЗарплаты.ПримененныеВычетыПоНДФЛ КАК ПримененныеВычетыПоНДФЛ
	|ГДЕ
	|	ПримененныеВычетыПоНДФЛ.Ссылка = &Ссылка
	|	И ПримененныеВычетыПоНДФЛ.СуммаВычета <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТаблицаНачисления.Период, МЕСЯЦ) КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ТаблицаНачисления.Сотрудник,
	|	ТаблицаНачисления.ПериодРегистрации,
	|	ТаблицаНачисления.Сумма КАК Сумма
	|ИЗ
	|	ТаблицаНачисления КАК ТаблицаНачисления
	|ГДЕ
	|	ТаблицаНачисления.ВидНачисленияУдержания = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.НалогНаДоходы)
	|	И ТаблицаНачисления.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ТаблицаНачисления.Период, МЕСЯЦ) КАК Период,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ТаблицаНачисления.Сотрудник КАК сотрудник,
	|	ТаблицаНачисления.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаНачисления.ВидНачисленияУдержания.КодДоходаНДФЛ КАК КодДохода,
	|	СУММА(ТаблицаНачисления.Сумма) КАК СуммаДохода
	|ИЗ
	|	ТаблицаНачисления КАК ТаблицаНачисления
	|ГДЕ
	|	ТаблицаНачисления.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНачисления.Период,
	|	ТаблицаНачисления.ПериодРегистрации,
	|	ТаблицаНачисления.Сотрудник,
	|	ТаблицаНачисления.ВидНачисленияУдержания.КодДоходаНДФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Начисления.Период, МЕСЯЦ) КАК Период,
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Начисления.Сотрудник,
	|	ИСТИНА КАК ЭтоСтраховыеВзносы,
	|	Начисления.ВидОбязательногоСтрахованияСотрудников,
	|	СУММА(Начисления.Сумма) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВзносыЗаМесяц.Сотрудник КАК Сотрудник,
	|		ВзносыЗаМесяц.Период КАК Период,
	|		ВзносыЗаМесяц.Сумма КАК Сумма,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРПоСуммарномуТарифу) КАК ВидОбязательногоСтрахованияСотрудников
	|	ИЗ
	|		ТаблицаВзносов КАК ВзносыЗаМесяц
	|	ГДЕ
	|		ВзносыЗаМесяц.ВидНачисленияУдержания = &ПФРПоСуммарномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыЗаМесяц.Сотрудник,
	|		ВзносыЗаМесяц.Период,
	|		ВзносыЗаМесяц.Сумма,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРНакопительная)
	|	ИЗ
	|		ТаблицаВзносов КАК ВзносыЗаМесяц
	|	ГДЕ
	|		ВзносыЗаМесяц.ВидНачисленияУдержания = &ПФРНакопительная
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыЗаМесяц.Сотрудник,
	|		ВзносыЗаМесяц.Период,
	|		ВзносыЗаМесяц.Сумма,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРСтраховая)
	|	ИЗ
	|		ТаблицаВзносов КАК ВзносыЗаМесяц
	|	ГДЕ
	|		ВзносыЗаМесяц.ВидНачисленияУдержания = &ПФРСтраховая
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыЗаМесяц.Сотрудник,
	|		ВзносыЗаМесяц.Период,
	|		ВзносыЗаМесяц.Сумма,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФФОМС)
	|	ИЗ
	|		ТаблицаВзносов КАК ВзносыЗаМесяц
	|	ГДЕ
	|		ВзносыЗаМесяц.ВидНачисленияУдержания = &ФФОМС
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыЗаМесяц.Сотрудник,
	|		ВзносыЗаМесяц.Период,
	|		ВзносыЗаМесяц.Сумма,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФСС)
	|	ИЗ
	|		ТаблицаВзносов КАК ВзносыЗаМесяц
	|	ГДЕ
	|		ВзносыЗаМесяц.ВидНачисленияУдержания = &ФСС
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыЗаМесяц.Сотрудник,
	|		ВзносыЗаМесяц.Период,
	|		ВзносыЗаМесяц.Сумма,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)
	|	ИЗ
	|		ТаблицаВзносов КАК ВзносыЗаМесяц
	|	ГДЕ
	|		ВзносыЗаМесяц.ВидНачисленияУдержания = &ФССНесчастныеСлучаи) КАК Начисления
	|ГДЕ
	|	Начисления.Сумма <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник,
	|	Начисления.Период,
	|	Начисления.ВидОбязательногоСтрахованияСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК порядок,
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаНачисления.Период КАК Период,
	|	ТаблицаНачисления.ВидНачисленияУдержания.ВидНалога КАК ВидНалога,
	|	ТаблицаНачисления.ВидНачисленияУдержания.ВидНалога.СчетУчета КАК СчетУчета,
	|	ТаблицаНачисления.Сумма - СУММА(ЕСТЬNULL(Удержания.СуммаНДФЛ, 0)) КАК СУММА,
	|	ВЫРАЗИТЬ(&НачисленНалог КАК СТРОКА(100)) КАК СодержаниеПроводки,
	|	ТаблицаНачисления.Сотрудник,
	|	ТаблицаНачисления.СуммаВал - Сумма(ЕСТЬNULL(Удержания.СуммаНДФЛВал,0)) КАК СуммаВал,
	|	ТаблицаНачисления.ПериодРегистрации,
	|	ТаблицаНачисления.ВидНачисленияУдержания,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
	|	ТаблицаНачисления.Валюта,
	|   ЛОЖЬ КАК Распределить
	|ИЗ
	|	ТаблицаНачисления КАК ТаблицаНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Удержания КАК Удержания
	|		ПО ТаблицаНачисления.Сотрудник = Удержания.Сотрудник
	|			И (Удержания.ВидУдержанияТип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.УдержаниеДляКонтрагента))
	|ГДЕ
	|	ТаблицаНачисления.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНачисления.Период,
	|	ТаблицаНачисления.ВидНачисленияУдержания.ВидНалога,
	|	ТаблицаНачисления.ВидНачисленияУдержания.ВидНалога.СчетУчета,
	|	ТаблицаНачисления.Сотрудник,
	|	ТаблицаНачисления.Сумма,
	|	ТаблицаНачисления.СуммаВал,
	|	ТаблицаНачисления.ПериодРегистрации,
	|	ТаблицаНачисления.ВидНачисленияУдержания,
	|	ТаблицаНачисления.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	Удержания.Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Удержания.Период,
	|	Удержания.НДФЛКОплате,
	|	Удержания.НДФЛКОплатеСчетУчета,
	|	Удержания.СуммаНДФЛ,
	|	ВЫРАЗИТЬ(&НачисленНалогДляКонтрагента КАК СТРОКА(100)),
	|	Удержания.Сотрудник,
	|	Удержания.СуммаНДФЛВал,
	|	Удержания.ПериодРегистрации,
	|	Удержания.ВидУдержанияНДФЛ,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	Удержания.Валюта,
	|   ЛОЖЬ
	|ИЗ
	|	Удержания КАК Удержания
	|ГДЕ
	|	НЕ Удержания.СуммаНДФЛВал = 0
	|	И Удержания.ВидУдержанияТип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.УдержаниеДляКонтрагента)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	Удержания.Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Удержания.Период,
	|	Удержания.НДФЛНачислении,
	|	Удержания.НДФЛНачисленииСчетУчета,
	|	Удержания.СуммаНДФЛ,
	|	ВЫРАЗИТЬ(&НачисленНалог КАК СТРОКА(100)),
	|	Удержания.Сотрудник,
	|	Удержания.СуммаНДФЛВал,
	|	Удержания.ПериодРегистрации,
	|	Удержания.ВидУдержанияНДФЛ,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	Удержания.Валюта,
	|   ИСТИНА
	|ИЗ
	|	Удержания КАК Удержания
	|ГДЕ
	|	НЕ Удержания.СуммаНДФЛВал = 0
	|	И ВЫБОР
	|			КОГДА Удержания.ВидУдержанияТип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|					ИЛИ &СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении
	|						И Удержания.ВидУдержанияТип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.УдержаниеДляКонтрагента)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	Удержания.Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Удержания.Период,
	|	Удержания.НДФЛКОплате,
	|	Удержания.НДФЛКОплатеСчетУчета,
	|	Удержания.СуммаНДФЛ,
	|	ВЫРАЗИТЬ(&НДФЛКОплате КАК СТРОКА(100)),
	|	Удержания.Сотрудник,
	|	Удержания.СуммаНДФЛВал,
	|	Удержания.ПериодРегистрации,
	|	Удержания.ВидУдержанияНДФЛ,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате),
	|	Удержания.Валюта,
	|   ИСТИНА
	|ИЗ
	|	Удержания КАК Удержания
	|ГДЕ
	|	НЕ Удержания.СуммаНДФЛВал = 0
	|	И ВЫБОР
	|			КОГДА Удержания.ВидУдержанияТип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|					ИЛИ &СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении
	|						И Удержания.ВидУдержанияТип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.УдержаниеДляКонтрагента)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	//+++ Дмгг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ПогашениеЗаймов.Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ПогашениеЗаймов.Период,
	|	ПогашениеЗаймов.НДФЛНачислении,
	|	ПогашениеЗаймов.НДФЛНачисленииСчетУчета,
	|	ПогашениеЗаймов.НДФЛ_ПогашеноЗаймаВал,
	|	ВЫРАЗИТЬ(&НДФЛКОплате КАК СТРОКА(100)),
	|	ПогашениеЗаймов.Сотрудник,
	|	ПогашениеЗаймов.НДФЛ_ПогашеноЗаймаВал,
	|	ПогашениеЗаймов.ПериодРегистрации,
	|	ПогашениеЗаймов.ВидУдержанияНДФЛ,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	ПогашениеЗаймов.Валюта,
	|   ИСТИНА
	|ИЗ
	|	ТаблицаПогашениеЗаймов КАК ПогашениеЗаймов
	|ГДЕ
	|	НЕ ПогашениеЗаймов.НДФЛ_ПогашеноЗаймаВал = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ПогашениеЗаймов.Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ПогашениеЗаймов.Период,
	|	ПогашениеЗаймов.НДФЛКОплате,
	|	ПогашениеЗаймов.НДФЛКОплатеСчетУчета,
	|	ПогашениеЗаймов.НДФЛ_ПогашеноЗайма,
	|	ВЫРАЗИТЬ(&НДФЛКОплате КАК СТРОКА(100)),
	|	ПогашениеЗаймов.Сотрудник,
	|	ПогашениеЗаймов.НДФЛ_ПогашеноЗаймаВал,
	|	ПогашениеЗаймов.ПериодРегистрации,
	|	ПогашениеЗаймов.ВидУдержанияНДФЛ,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате),
	|	ПогашениеЗаймов.Валюта,
	|   ИСТИНА
	|ИЗ
	|	ТаблицаПогашениеЗаймов КАК ПогашениеЗаймов
	|ГДЕ
	|	НЕ ПогашениеЗаймов.НДФЛ_ПогашеноЗаймаВал = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	ПогашениеЗаймов.Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ПогашениеЗаймов.Период,
	|	ПогашениеЗаймов.НДФЛНачислении,
	|	ПогашениеЗаймов.НДФЛНачисленииСчетУчета,
	|	ПогашениеЗаймов.НДФЛ_ПогашеноПроцентов,
	|	ВЫРАЗИТЬ(&НДФЛКОплате КАК СТРОКА(100)),
	|	ПогашениеЗаймов.Сотрудник,
	|	ПогашениеЗаймов.НДФЛ_ПогашеноПроцентовВал,
	|	ПогашениеЗаймов.ПериодРегистрации,
	|	ПогашениеЗаймов.ВидУдержанияНДФЛ,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
	|	ПогашениеЗаймов.Валюта,
	|   ИСТИНА
	|ИЗ
	|	ТаблицаПогашениеЗаймов КАК ПогашениеЗаймов
	|ГДЕ
	|	НЕ ПогашениеЗаймов.НДФЛ_ПогашеноПроцентовВал = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	ПогашениеЗаймов.Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ПогашениеЗаймов.Период,
	|	ПогашениеЗаймов.НДФЛКОплате,
	|	ПогашениеЗаймов.НДФЛКОплатеСчетУчета,
	|	ПогашениеЗаймов.НДФЛ_ПогашеноПроцентов,
	|	ВЫРАЗИТЬ(&НДФЛКОплате КАК СТРОКА(100)),
	|	ПогашениеЗаймов.Сотрудник,
	|	ПогашениеЗаймов.НДФЛ_ПогашеноПроцентовВал,
	|	ПогашениеЗаймов.ПериодРегистрации,
	|	ПогашениеЗаймов.ВидУдержанияНДФЛ,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.КОплате),
	|	ПогашениеЗаймов.Валюта,
	|   ИСТИНА
	|ИЗ
	|	ТаблицаПогашениеЗаймов КАК ПогашениеЗаймов
	|ГДЕ
	|	НЕ ПогашениеЗаймов.НДФЛ_ПогашеноПроцентовВал = 0
	//ПодольскийАИ #УчетПроектов 28.10.2020 {
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	НачислениеЗарплатыНачисленияУдержания.Период КАК Период,
	|	НачислениеЗарплатыНачисленияУдержания.Валюта КАК Валюта,
	|	НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Сотрудник,
	|	НачислениеЗарплатыНачисленияУдержания.ДатаНачала КАК ДатаНачала,
	|	НачислениеЗарплатыНачисленияУдержания.ДатаОкончания КАК ДатаОкончания,
	|	НачислениеЗарплатыНачисленияУдержания.ОтработаноДней КАК ОтработаноДней,
	|	НачислениеЗарплатыНачисленияУдержания.ОтработаноЧасов КАК ОтработаноЧасов,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	НачислениеЗарплатыНачисленияУдержания.Проект КАК Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_lazare
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare
	|	НачислениеЗарплатыНачисленияУдержания.Сумма КАК Сумма,
	|	НачислениеЗарплатыНачисленияУдержания.СуммаВал КАК СуммаВал
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	НачислениеЗарплатыНачисленияУдержания.Период,
	|	НачислениеЗарплатыНачисленияУдержания.Валюта,
	|	НачислениеЗарплатыНачисленияУдержания.СтруктурнаяЕдиница,
	|	НачислениеЗарплатыНачисленияУдержания.Сотрудник,
	|	НачислениеЗарплатыНачисленияУдержания.ДатаНачала,
	|	НачислениеЗарплатыНачисленияУдержания.ДатаОкончания,
	|	НачислениеЗарплатыНачисленияУдержания.ОтработаноДней,
	|	НачислениеЗарплатыНачисленияУдержания.ОтработаноЧасов,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	НачислениеЗарплатыНачисленияУдержания.Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_lazare
	|	ВЫБОР
	|		КОГДА НачислениеЗарплатыНачисленияУдержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ НачислениеЗарплатыНачисленияУдержания.Проект
	|	КОНЕЦ,
	//Lazare
	|	НачислениеЗарплатыНачисленияУдержания.СуммаПФ,
	|	НачислениеЗарплатыНачисленияУдержания.СуммаПФВал
	|ИЗ
	|	ТаблицаНачисления КАК НачислениеЗарплатыНачисленияУдержания
	|ГДЕ
	|	НачислениеЗарплатыНачисленияУдержания.СуммаПФ > 0
	|	И НЕ НачислениеЗарплатыНачисленияУдержания.ВидУдержанияПФ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Удержания.Организация,
	|	Удержания.Период,
	|	Удержания.Валюта,
	|	Удержания.СтруктурнаяЕдиница,
	|	Удержания.Сотрудник,
	|	Удержания.ДатаНачала,
	|	Удержания.ДатаОкончания,
	|	0,
	|	0,
	////ПодольскийАИ #УчетПроектов 23.10.2020 {
	//|	Удержания.Проект,
	////ПодольскийАИ #УчетПроектов 23.10.2020 }
	//_lazare
	|	ВЫБОР
	|		КОГДА Удержания.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ Удержания.Проект
	|	КОНЕЦ,
	//Lazare
	|	Удержания.Сумма,
	|	Удержания.СуммаВал
	|ИЗ
	|	Удержания КАК Удержания
	//ПодольскийАИ #УчетПроектов 28.10.2020 }
	|";
	//--- Дмгг
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачислениеЗарплаты);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ОрганизацияДляРегОтчетности", ДокументСсылкаНачислениеЗарплаты.Организация);
	Запрос.УстановитьПараметр("НачислениеЗарплаты", НСтр("ka='ხელფასის დარიცხვა';ru='Начисление зарплаты';en='Payroll'"));
	Запрос.УстановитьПараметр("НачисленНалогДляКонтрагента","გადასახადის დარიცხვა კონტრაგენზე გადასახდელად");
	Запрос.УстановитьПараметр("НачисленНалог", НСтр("ka='დარიცხულია გადასახადი';ru='Начислен налог';en='accrued tax'"));
	Запрос.УстановитьПараметр("НачислениеВзносов", НСтр("ka='დარიცხულია შენატანი';ru='Начислен взнос';en='assessed'"));
	Запрос.УстановитьПараметр("УдержаниеВСчетПогашенияЗаймаИПроцентов", НСтр("ka='დაკავება სესხის და პროცენტების დაფარვის ანგარიშში';ru='Удержание в счет погашения займа и процентов';en='Deduction for repayment of the loan and interest'"));
	Запрос.УстановитьПараметр("ОбъединятьНакопительнуюИСтраховуюЧасть", ДокументСсылкаНачислениеЗарплаты.Дата >= УчетСтраховыхВзносов.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР());
	Запрос.УстановитьПараметр("ПФРПоСуммарномуТарифу", Справочники.ВидыНачисленийИУдержаний.ПФРПоСуммарномуТарифу);
	Запрос.УстановитьПараметр("ПФРСтраховая", Справочники.ВидыНачисленийИУдержаний.ПФРСтраховая);
	Запрос.УстановитьПараметр("ПФРНакопительная", Справочники.ВидыНачисленийИУдержаний.ПФРНакопительная);
	Запрос.УстановитьПараметр("ФСС", Справочники.ВидыНачисленийИУдержаний.ФСС);
	Запрос.УстановитьПараметр("ФССНесчастныеСлучаи", Справочники.ВидыНачисленийИУдержаний.ФССНесчастныеСлучаи);
	Запрос.УстановитьПараметр("ФФОМС", Справочники.ВидыНачисленийИУдержаний.ФФОМС);
	Запрос.УстановитьПараметр("УправленческиеРасходы", ПланыСчетов.Управленческий.УправленческиеРасходы);
	Запрос.УстановитьПараметр("СчетаФинРезРасходы", МассивСчетовФинРезРасходы);
	Запрос.УстановитьПараметр("СчетаФинРезДоходы", МассивСчетовФинРезДоходы);
	//Паганини_ ПФ
	Запрос.УстановитьПараметр("НалогПенсионногоФонда", 		НСтр("ka='საპენსიო ფონდის გადასახადი';ru='Налог пенсионного фонда';en='Tax pension fund'"));
	Запрос.УстановитьПараметр("УдержаниеПенсионногоФонда",	НСтр("ka='ორგანიზაციის ხარჯი საპენსიო ფონდისთვის';ru='Удержание организации для пенсионного фонда';en='Hold the organization to the Pension Fund'"));
	Запрос.УстановитьПараметр("ВалютаУчета",				УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета"));
	Запрос.УстановитьПараметр("ВалютаДокумента",			ДокументСсылкаНачислениеЗарплаты.ВалютаДокумента);
	Запрос.УстановитьПараметр("Удержание",					НСтр("ka='დაკავება';ru='Удержание';en='retention'"));
	Запрос.УстановитьПараметр("НДФЛКОплате",				НСтр("ka='საშემოსავლო გადასახდელად';ru='НДФЛ к оплате';en='Personal income tax payable'"));
	Запрос.УстановитьПараметр("УдержаниеДляКонтрагента",	НСтр("ka='დაკავება კონტრაგენტზე გადასახდელად';ru='Удержание для контрагента';en='Hold for counterparty'"));
	Запрос.УстановитьПараметр("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении",	УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении"));
	//_Паганини ПФ
	
	Запрос.УстановитьПараметр("ИспользованиеТолькоРеглПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов); //+++ Дмгг
	
	//ПодольскийАИ #УчетПроектов 23.10.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 23.10.2020 }
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНачисленияИУдержания", 					МассивРезультатов[6].Выгрузить());//2
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПерсоналом", 					МассивРезультатов[7].Выгрузить());//3
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", 								МассивРезультатов[8].Выгрузить());//4
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", 						МассивРезультатов[9].Выгрузить());//5
	
	ТаблицаРасчетыПоНалогам = МассивРезультатов[10].Выгрузить();	
	РаспределитьНДФЛ(ТаблицаРасчетыПоНалогам,СтруктураДополнительныеСвойства);	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", 						ТаблицаРасчетыПоНалогам);//6
	
	
	
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", 						МассивРезультатов[10].Выгрузить());//7
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПримененныеВычетыПоНДФЛ",				МассивРезультатов[12].Выгрузить());//8
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНДФЛРасчетыНалоговыхАгентовСБюджетом",	МассивРезультатов[13].Выгрузить());//9
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНДФЛДоходы",							МассивРезультатов[14].Выгрузить());//10
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСФондамиПоСтраховымВзносам",		МассивРезультатов[15].Выгрузить());//11
	
	ТаблицаРасчетыНДФЛ = МассивРезультатов[16].Выгрузить();		
	РаспределитьНДФЛ(ТаблицаРасчетыНДФЛ,СтруктураДополнительныеСвойства);	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ",							ТаблицаРасчетыНДФЛ);//12

	//ПодольскийАИ #УчетПроектов 28.10.2020 {
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНачисленияИУдержанияВРазрезеПроекта", МассивРезультатов[17].Выгрузить());
	//ПодольскийАИ #УчетПроектов 28.10.2020 }
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыСПенсионнымФондом_НачислениеЗарплаты(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства);//Паганини ПФ
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаДекларация_НачислениеЗарплаты(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_НачислениеЗарплаты(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаТаблицаРасчетыСПоставщиками_НачислениеЗарплаты(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыПоУдержаниям_НачислениеЗарплаты(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства);
	
	// Прочие Расчеты
	СформироватьТаблицаРасчетыПоКредитамИЗаймам(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства);
	СформироватьТаблицыПоУчетуЗаймов(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства);
	//ДД
	СформироватьТаблицаНалоговыеЛготы(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОстаткиНалоговыхеЛьгот(ДокументСсылкаНачислениеЗарплаты, СтруктураДополнительныеСвойства)
	// Конец Прочие Расчеты
		
КонецПроцедуры
