
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОткудаКуда = 1;
	УстановитьЗаголовкиРеквизитов();
	УстановитьВидимость();
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Организация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекущийПользователь, "ОсновнаяОрганизация");
	ДатаСозданияДокументов = ТекущаяДата();
	СтруктурнаяЕдиница = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекущийПользователь, "ОсновнойСклад");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиРеквизитов()

	ЭтоОтправитель = ?(ОткудаКуда = 1, Истина, ЛОЖЬ);
	
	Элементы.СтруктурнаяЕдиница.Заголовок = ?(ЭтоОтправитель, Нстр("ka='საწყობის გამგზავნი';ru='Склад отправитель';en='Poster warehouse'"), Нстр("ru = 'Склад получатель'; ka = 'საწყობის მიმღები'"));
	Элементы.ТаблицаЗапасовСтруктурнаяЕдиница.Заголовок = ?(НЕ ЭтоОтправитель, Нстр("ka='საწყობის გამგზავნი';ru='Склад отправитель';en='Poster warehouse'"), Нстр("ru = 'Склад получатель'; ka = 'საწყობის მიმღები'"));

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()

	ИспользоватьЯчейки = ПолучитьФункциональнуюОпцию("УчетПоЯчейкам");
	ИспользоватьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
	Элементы.Ячейка.Видимость = ИспользоватьЯчейки;
	Элементы.ТаблицаЗапасовЯчейка.Видимость = ИспользоватьЯчейки;
	Элементы.ТаблицаЗапасовХарактеристика.Видимость = ИспользоватьХарактеристики;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаток(СтрокаТаблицы)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапасыНаСкладахОстатки.Организация,
		|	ЗапасыНаСкладахОстатки.Номенклатура,
		|	ЗапасыНаСкладахОстатки.Характеристика,
		|	ЗапасыНаСкладахОстатки.Партия,
		|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница,
		|	ЗапасыНаСкладахОстатки.Ячейка,
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|			&НаДату,
		|			Номенклатура = &Номенклатура
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Характеристика = &Характеристика
		|				И Ячейка = &Ячейка
		|				И Организация = &Организация) КАК ЗапасыНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("НаДату", ДатаСозданияДокументов);
	Запрос.УстановитьПараметр("Номенклатура", СтрокаТаблицы.Номенклатура);
	Запрос.УстановитьПараметр("Организация", Организация);
	Если ОткудаКуда = 1 Тогда 
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("Ячейка", Ячейка);
	ИначеЕсли ОткудаКуда = 2 Тогда
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтрокаТаблицы.СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("Ячейка", СтрокаТаблицы.Ячейка);
	КонецЕсли;
	Запрос.УстановитьПараметр("Характеристика", СтрокаТаблицы.Характеристика);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		СтрокаТаблицы.Остаток = 0;
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТаблицы.Остаток = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаЗапасовНоменклатураПриИзмененииНаСервере(УИДСтроки)
	
	СтрокаТаблицы = ТаблицаЗапасов.НайтиПоИдентификатору(УИДСтроки);
	
	Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда 
		СтрокаТаблицы.Остаток = 0;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОстаток(СтрокаТаблицы); 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗапасовНоменклатураПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаЗапасов.ТекущиеДанные;
	УИДСтроки = ТекСтрока.ПолучитьИдентификатор();
	ТаблицаЗапасовНоменклатураПриИзмененииНаСервере(УИДСтроки);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	Если ОткудаКуда = 1 Тогда 
		СоздатьДокументыОтправительПолучателиНаСервере();
	Иначе
		СоздатьДокументыПолучательОтправителиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыОтправительПолучателиНаСервере()
	
	тзОснова = ТаблицаЗапасов.Выгрузить();
	ТаблицаСтруктурныхЕдиниц = тзОснова.Скопировать(, "СтруктурнаяЕдиница, Ячейка");
	ТаблицаСтруктурныхЕдиниц.Свернуть("СтруктурнаяЕдиница, Ячейка");
	
	СкладПолучатель = Неопределено;
	ЯчейкаПолучатель = Неопределено;
	НовыйДокумент = Неопределено;
	ТаблицаЗапасы = Неопределено;
	Для Каждого СтрокПолучатель Из ТаблицаСтруктурныхЕдиниц Цикл 
		
		Если СкладПолучатель <> СтрокПолучатель.СтруктурнаяЕдиница
			ИЛИ ЯчейкаПолучатель <> СтрокПолучатель.Ячейка Тогда 
			
			СкладПолучатель = СтрокПолучатель.СтруктурнаяЕдиница;
			ЯчейкаПолучатель = СтрокПолучатель.Ячейка;
			
			НовыйДокумент = Документы.ПеремещениеЗапасов.СоздатьДокумент();
			
			НовыйДокумент.Заполнить(Неопределено);
			НовыйДокумент.Дата = ДатаСозданияДокументов;
			НовыйДокумент.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
			НовыйДокумент.Ячейка = Ячейка;
			НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение;
			ФункциональнаяОпцияЗаказПриПеремещенииВШапке = НовыйДокумент.ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
			// Кусок типового механизма формы +
			СтруктураДанные = Новый Структура();
			СтруктураДанные.Вставить("ВидОперации", НовыйДокумент.ВидОперации);
			СтруктураДанные.Вставить("Источник", НовыйДокумент.СтруктурнаяЕдиница);
			
			СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиница(СтруктураДанные, НовыйДокумент, ФункциональнаяОпцияЗаказПриПеремещенииВШапке);
			
			НовыйДокумент.ПодписьКладовщикаОтправил = СтруктураДанные.ПодписьКладовщика;
			// Кусок типового механизма формы -
			
			НовыйДокумент.СтруктурнаяЕдиницаПолучатель =СкладПолучатель;
			
			// Кусок типового механизма формы +
			СтруктураДанные = Новый Структура();
			СтруктураДанные.Вставить("ВидОперации", НовыйДокумент.ВидОперации);
			СтруктураДанные.Вставить("Получатель", НовыйДокумент.СтруктурнаяЕдиницаПолучатель);
			
			СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиницаПолучатель(СтруктураДанные, НовыйДокумент);
			
			НовыйДокумент.ПодписьКладовщикаПолучил = СтруктураДанные.ПодписьКладовщика;
			// Кусок типового механизма формы -
			
			НовыйДокумент.ЯчейкаПолучатель = ЯчейкаПолучатель;
			
			ТаблицаЗапасы = НовыйДокумент.Запасы;
			
		КонецЕсли;
		
		МассивСтрокПолучателей = ТаблицаЗапасов.НайтиСтроки(Новый Структура("СтруктурнаяЕдиница, Ячейка", СкладПолучатель, ЯчейкаПолучатель));
		
		Для Каждого СтрокаИсточник Из МассивСтрокПолучателей Цикл 
			
			//Если СтрокаИсточник[СтруктураДокумента.ИмяКолонкиКоличество] = 0 Тогда 
			//	Продолжить;
			//КонецЕсли;
			
			НоваяСтрока = ТаблицаЗапасы.Добавить();
			
			НоваяСтрока.Номенклатура = СтрокаИсточник.Номенклатура;
			
			// Кусок типового механизма формы +
			СтруктураДанные = Новый Структура();
			СтруктураДанные.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
			
			СтруктураДанные = ПолучитьДанныеНоменклатура(СтруктураДанные);
			
			НоваяСтрока.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
			НоваяСтрока.СтранаПроисхождения = СтруктураДанные.СтранаПроисхождения;
			НоваяСтрока.НомерГТД = Неопределено;
			НоваяСтрока.Количество = 1;
			// Кусок типового механизма формы -
			
			НоваяСтрока.Характеристика = СтрокаИсточник.Характеристика;
			
			НоваяСтрока.Количество = СтрокаИсточник.Количество;
			
		КонецЦикла;
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			Сообщить(НСтр("ru = Не удалось провести документ:" + НовыйДокумент.Ссылка + "'; ka = 'Не удалось провести документ:" + НовыйДокумент.Ссылка + "'"));
		КонецПопытки;
		
		Для Каждого Строк Из МассивСтрокПолучателей Цикл 
			
			Строк.ДокументПеремещения = НовыйДокумент.Ссылка;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыПолучательОтправителиНаСервере()
	
тзОснова = ТаблицаЗапасов.Выгрузить();
	ТаблицаСтруктурныхЕдиниц = тзОснова.Скопировать(, "СтруктурнаяЕдиница, Ячейка");
	ТаблицаСтруктурныхЕдиниц.Свернуть("СтруктурнаяЕдиница, Ячейка");
	
	СкладОтправитель = Неопределено;
	ЯчейкаОтправитель = Неопределено;
	НовыйДокумент = Неопределено;
	ТаблицаЗапасы = Неопределено;
	Для Каждого СтрокОтправитель Из ТаблицаСтруктурныхЕдиниц Цикл 
		
		Если СкладОтправитель <> СтрокОтправитель.СтруктурнаяЕдиница
			ИЛИ ЯчейкаОтправитель <> СтрокОтправитель.Ячейка Тогда 
			
			СкладОтправитель = СтрокОтправитель.СтруктурнаяЕдиница;
			ЯчейкаОтправитель = СтрокОтправитель.Ячейка;
			
			НовыйДокумент = Документы.ПеремещениеЗапасов.СоздатьДокумент();
			
			НовыйДокумент.Заполнить(Неопределено);
			НовыйДокумент.Дата = ДатаСозданияДокументов;
			НовыйДокумент.СтруктурнаяЕдиница = СкладОтправитель;
			НовыйДокумент.Ячейка = ЯчейкаОтправитель;
			НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение;
			ФункциональнаяОпцияЗаказПриПеремещенииВШапке = НовыйДокумент.ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
			// Кусок типового механизма формы +
			СтруктураДанные = Новый Структура();
			СтруктураДанные.Вставить("ВидОперации", НовыйДокумент.ВидОперации);
			СтруктураДанные.Вставить("Источник", НовыйДокумент.СтруктурнаяЕдиница);
			
			СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиница(СтруктураДанные, НовыйДокумент, ФункциональнаяОпцияЗаказПриПеремещенииВШапке);
			
			НовыйДокумент.ПодписьКладовщикаОтправил = СтруктураДанные.ПодписьКладовщика;
			// Кусок типового механизма формы -
			
			НовыйДокумент.СтруктурнаяЕдиницаПолучатель = СтруктурнаяЕдиница;
			
			// Кусок типового механизма формы +
			СтруктураДанные = Новый Структура();
			СтруктураДанные.Вставить("ВидОперации", НовыйДокумент.ВидОперации);
			СтруктураДанные.Вставить("Получатель", НовыйДокумент.СтруктурнаяЕдиницаПолучатель);
			
			СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиницаПолучатель(СтруктураДанные, НовыйДокумент);
			
			НовыйДокумент.ПодписьКладовщикаПолучил = СтруктураДанные.ПодписьКладовщика;
			// Кусок типового механизма формы -
			
			НовыйДокумент.ЯчейкаПолучатель = Ячейка;
			
			ТаблицаЗапасы = НовыйДокумент.Запасы;
			
		КонецЕсли;
		
		МассивСтрокПолучателей = ТаблицаЗапасов.НайтиСтроки(Новый Структура("СтруктурнаяЕдиница, Ячейка", СкладОтправитель, ЯчейкаОтправитель));
		
		Для Каждого СтрокаИсточник Из МассивСтрокПолучателей Цикл 
			
			//Если СтрокаИсточник[СтруктураДокумента.ИмяКолонкиКоличество] = 0 Тогда 
			//	Продолжить;
			//КонецЕсли;
			
			НоваяСтрока = ТаблицаЗапасы.Добавить();
			
			НоваяСтрока.Номенклатура = СтрокаИсточник.Номенклатура;
			
			// Кусок типового механизма формы +
			СтруктураДанные = Новый Структура();
			СтруктураДанные.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
			
			СтруктураДанные = ПолучитьДанныеНоменклатура(СтруктураДанные);
			
			НоваяСтрока.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
			НоваяСтрока.СтранаПроисхождения = СтруктураДанные.СтранаПроисхождения;
			НоваяСтрока.НомерГТД = Неопределено;
			НоваяСтрока.Количество = 1;
			// Кусок типового механизма формы -
			
			НоваяСтрока.Характеристика = СтрокаИсточник.Характеристика;
			
			НоваяСтрока.Количество = СтрокаИсточник.Количество;
			
		КонецЦикла;
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			Сообщить(НСтр("ru = Не удалось провести документ:" + НовыйДокумент.Ссылка + "'; ka = 'Не удалось провести документ:" + НовыйДокумент.Ссылка + "'"));
		КонецПопытки;
		
		Для Каждого Строк Из МассивСтрокПолучателей Цикл 
			
			Строк.ДокументПеремещения = НовыйДокумент.Ссылка;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСтруктурнаяЕдиницаПолучатель(СтруктураДанные, ДокументОбъект)

	ЕстьРозница = ДокументОбъект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			  ИЛИ ДокументОбъект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница;
	ЕстьРозницаСуммовойУчет = ДокументОбъект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет
						  ИЛИ ДокументОбъект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет;
	
	СтруктураДанные.Вставить("ПодписьКладовщика", СтруктураДанные.Получатель.ПодписьМОЛ);
	
	Если НЕ ЗначениеЗаполнено(СтруктураДанные.Получатель)
		ИЛИ СтруктураДанные.Получатель.ОрдерныйСклад 
		ИЛИ СтруктураДанные.Получатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
		ИЛИ СтруктураДанные.Получатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
		СтруктураДанные.Вставить("ОрдерныйСклад", Ложь);
	Иначе
		СтруктураДанные.Вставить("ОрдерныйСклад", Истина);
	КонецЕсли;
	
	Если СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение Тогда
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиница", СтруктураДанные.Получатель.ИсточникПеремещения);
		СтруктураДанные.Вставить("Ячейка", СтруктураДанные.Получатель.ЯчейкаИсточникаПеремещения);
				
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Получатель.ИсточникПеремещения)
			ИЛИ СтруктураДанные.Получатель.ИсточникПеремещения.ОрдерныйСклад 
			ИЛИ СтруктураДанные.Получатель.ИсточникПеремещения.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			ИЛИ СтруктураДанные.Получатель.ИсточникПеремещения.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Истина);
		КонецЕсли;
		
		ФункциональнаяОпцияЗаказПриПеремещенииВШапке = ДокументОбъект.ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
		
	ИначеЕсли СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы Тогда	
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиница", СтруктураДанные.Получатель.ИсточникСписанияНаРасходы);
		СтруктураДанные.Вставить("Ячейка", СтруктураДанные.Получатель.ЯчейкаИсточникаСписанияНаРасходы);
		
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Получатель.ИсточникСписанияНаРасходы)
			ИЛИ СтруктураДанные.Получатель.ИсточникСписанияНаРасходы.ОрдерныйСклад Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Истина);
		КонецЕсли;
		
	ИначеЕсли СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию Тогда		
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиница", СтруктураДанные.Получатель.ИсточникПередачиВЭксплуатацию);
		СтруктураДанные.Вставить("Ячейка", СтруктураДанные.Получатель.ЯчейкаИсточникаПередачиВЭксплуатацию);
		
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Получатель.ИсточникПередачиВЭксплуатацию)
			ИЛИ СтруктураДанные.Получатель.ИсточникПередачиВЭксплуатацию.ОрдерныйСклад Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Истина);
		КонецЕсли;
							
	ИначеЕсли СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда	
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиница", СтруктураДанные.Получатель.ИсточникВозвратаИзЭксплуатации);
		СтруктураДанные.Вставить("Ячейка", СтруктураДанные.Получатель.ЯчейкаИсточникаВозвратаИзЭксплуатации);
		
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Получатель.ИсточникВозвратаИзЭксплуатации)
			ИЛИ СтруктураДанные.Получатель.ИсточникВозвратаИзЭксплуатации.ОрдерныйСклад Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладИсточник", Истина);
		КонецЕсли;
						
	КонецЕсли;
	
	АдресДоставки = "";
	МассивВладельцев = Новый Массив;
	МассивВладельцев.Добавить(СтруктураДанные.Получатель);
	
	Адреса = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивВладельцев, , Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
	Если Адреса.Количество() > 0 Тогда
		
		АдресДоставки = Адреса[0].Представление;
		
	КонецЕсли;
	СтруктураДанные.Вставить("АдресДоставки", АдресДоставки);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеСтруктурнаяЕдиница(СтруктураДанные, ДокументОбъект, ФункциональнаяОпцияЗаказПриПеремещенииВШапке)
	
	ЕстьРозница = ДокументОбъект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			  ИЛИ ДокументОбъект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница;
	ЕстьРозницаСуммовойУчет = ДокументОбъект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет
						  ИЛИ ДокументОбъект.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет;
	
	СтруктураДанные.Вставить("ПодписьКладовщика", СтруктураДанные.Источник.ПодписьМОЛ);
	
	Если НЕ ЗначениеЗаполнено(СтруктураДанные.Источник)
		ИЛИ СтруктураДанные.Источник.ОрдерныйСклад 
		ИЛИ СтруктураДанные.Источник.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
		ИЛИ СтруктураДанные.Источник.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
		СтруктураДанные.Вставить("ОрдерныйСклад", Ложь);
	Иначе
		СтруктураДанные.Вставить("ОрдерныйСклад", Истина);
	КонецЕсли;
	
	Если СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение Тогда
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаПолучатель", СтруктураДанные.Источник.ПолучательПеремещения);
		СтруктураДанные.Вставить("ЯчейкаПолучатель", СтруктураДанные.Источник.ЯчейкаПолучателяПеремещения);
		СтруктураДанные.Вставить("ТипСтруктурнойЕдиницыРозницаСуммовойУчет", СтруктураДанные.Источник.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет);
		
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Источник.ПолучательПеремещения)
			ИЛИ СтруктураДанные.Источник.ПолучательПеремещения.ОрдерныйСклад 
			ИЛИ СтруктураДанные.Источник.ПолучательПеремещения.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			ИЛИ СтруктураДанные.Источник.ПолучательПеремещения.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Истина);
		КонецЕсли;
		
		Если ДокументОбъект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
		 ИЛИ ДокументОбъект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
			ИспользуетсяРезервирование = Ложь;
		Иначе
			ИспользуетсяРезервирование = Истина;
		КонецЕсли;
		
	ИначеЕсли СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы Тогда	
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаПолучатель", СтруктураДанные.Источник.ПолучательСписанияНаРасходы);
		СтруктураДанные.Вставить("ЯчейкаПолучатель", СтруктураДанные.Источник.ЯчейкаПолучателяСписанияНаРасходы);
		СтруктураДанные.Вставить("ТипСтруктурнойЕдиницыРозницаСуммовойУчет", Ложь);
		
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Источник.ПолучательСписанияНаРасходы)
			ИЛИ СтруктураДанные.Источник.ПолучательСписанияНаРасходы.ОрдерныйСклад Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Истина);
		КонецЕсли;
		
	ИначеЕсли СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию Тогда		
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаПолучатель", СтруктураДанные.Источник.ПолучательПередачиВЭксплуатацию);
		СтруктураДанные.Вставить("ЯчейкаПолучатель", СтруктураДанные.Источник.ЯчейкаПолучателяПередачиВЭксплуатацию);
		СтруктураДанные.Вставить("ТипСтруктурнойЕдиницыРозницаСуммовойУчет", Ложь);
		
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Источник.ПолучательПередачиВЭксплуатацию)
			ИЛИ СтруктураДанные.Источник.ПолучательПередачиВЭксплуатацию.ОрдерныйСклад Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Истина);
		КонецЕсли;
		
	ИначеЕсли СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда	
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаПолучатель", СтруктураДанные.Источник.ПолучательВозвратаИзЭксплуатации);
		СтруктураДанные.Вставить("ЯчейкаПолучатель", СтруктураДанные.Источник.ЯчейкаПолучателяВозвратаИзЭксплуатации);
		СтруктураДанные.Вставить("ТипСтруктурнойЕдиницыРозницаСуммовойУчет", Ложь);
		
		Если НЕ ЗначениеЗаполнено(СтруктураДанные.Источник.ПолучательВозвратаИзЭксплуатации)
			ИЛИ СтруктураДанные.Источник.ПолучательВозвратаИзЭксплуатации.ОрдерныйСклад Тогда
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Ложь);
		Иначе
			СтруктураДанные.Вставить("ОрдерныйСкладПолучатель", Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатура(СтруктураДанные)
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("СтранаПроисхождения", СтруктураДанные.Номенклатура.СтранаПроисхождения);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПООстаткам(Команда)
	
	Для Каждого Строк из ТаблицаЗапасов Цикл 
		
		Строк.Количество = Строк.Остаток;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗапасовХарактеристикаПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаЗапасов.ТекущиеДанные;
	УИДСтроки = ТекСтрока.ПолучитьИдентификатор();
	ТаблицаЗапасовНоменклатураПриИзмененииНаСервере(УИДСтроки);	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗапасовСтруктурнаяЕдиницаПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаЗапасов.ТекущиеДанные;
	УИДСтроки = ТекСтрока.ПолучитьИдентификатор();
	ТаблицаЗапасовНоменклатураПриИзмененииНаСервере(УИДСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗапасовЯчейкаПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаЗапасов.ТекущиеДанные;
	УИДСтроки = ТекСтрока.ПолучитьИдентификатор();
	ТаблицаЗапасовНоменклатураПриИзмененииНаСервере(УИДСтроки);
КонецПроцедуры

