
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработка параметров.
	МассивОшибок = Параметры.Ошибки;
	
	Параметры.Свойство("ЭтоОбмен", 					ЭтоОбмен);
	Параметры.Свойство("ЭтоОтправка", 				ЭтоОтправка);
	Параметры.Свойство("ЭтоРасшифровка", 			ЭтоРасшифровка);
	Параметры.Свойство("ЭтоОбменИзОтчета", 			ЭтоОбменИзОтчета);
	Параметры.Свойство("ЭтоОбменИзЭтаповОтправки", 	ЭтоОбменИзЭтаповОтправки);
	Параметры.Свойство("ЭтоАвтозапрос", 			ЭтоАвтозапрос);
	
	ИспользуетсяОднаОрганизация = РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация();
	
	ЗаполнитьДеревоОшибок(МассивОшибок);
	
	УстановитьЗаголовок(Параметры);
	
	ВывестиНадписьПроОшибки(МассивОшибок);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ОшибкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОшибки = Элемент.ТекущиеДанные.ОписаниеОшибки;
	ПоказатьЗначение(,ОписаниеОшибки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовок(Параметры)
	
	Если ЭтоРасшифровка Тогда
	    Заголовок = НСтр("ka='Ошибки расшифровки';ru='Ошибки расшифровки';en='decryption error'");
	ИначеЕсли ЭтоОбмен Тогда
		Заголовок = НСтр("ka='Ошибки обновления';ru='Ошибки обновления';en='update errors'");
	ИначеЕсли ЭтоАвтозапрос Тогда
		Заголовок = НСтр("ka='Протокол не получен';ru='Протокол не получен';en='The protocol has not been received'");
	Иначе
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОшибок(МассивОшибок)

	Ошибки = Новый ТаблицаЗначений;
	Ошибки.Колонки.Добавить("ОписаниеОшибки");
	Ошибки.Колонки.Добавить("Организация");
	
	// Раскладывание ошибок по таблице.
	Организации = Новый Массив;
	Для каждого Ошибка Из МассивОшибок Цикл
		НоваяОшибка = Ошибки.Добавить();
		НоваяОшибка.ОписаниеОшибки 	= Ошибка.ОписаниеОшибки;
		НоваяОшибка.Организация 	= Ошибка.Организация;
		
		Если Организации.Найти(Ошибка.Организация) = Неопределено Тогда
			Организации.Добавить(Ошибка.Организация);
		КонецЕсли;
	КонецЦикла;
	
	ДеревоОшибок  = РеквизитФормыВЗначение("ОшибкиПоОрганизациям");
	
	Если ИспользуетсяОднаОрганизация
		ИЛИ ЭтоОбменИзОтчета
		ИЛИ ЭтоОбменИзЭтаповОтправки
		ИЛИ ЭтоОтправка Тогда
		СформироватьДеревоОшибокПлоско(ДеревоОшибок, Ошибки);
	Иначе
		СформироватьДеревоОшибокПоОрганизациям(ДеревоОшибок, Организации, Ошибки);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоОшибок, "ОшибкиПоОрганизациям");

КонецПроцедуры 

&НаСервере
Процедура СформироватьДеревоОшибокПоОрганизациям(ДеревоОшибок, Организации, Ошибки)

	Корень = ДеревоОшибок.Строки;
	Для каждого Организация Из Организации Цикл
		
		УровеньОрганизации = Корень.Добавить();
		УровеньОрганизации.ОписаниеОшибки = Организация;
		УровеньОрганизации.ЭтоЗаголовок   = Истина;
		
		Отбор = Новый Структура();
		Отбор.Вставить("Организация", Организация);
		
		ОшибкиПоОрганизации = Ошибки.НайтиСтроки(Отбор);
		Для каждого ОшибкаПоОрганизации Из ОшибкиПоОрганизации Цикл
			УровеньОшибки = УровеньОрганизации.Строки.Добавить();
			УровеньОшибки.ОписаниеОшибки = ОшибкаПоОрганизации.ОписаниеОшибки;
		КонецЦикла; 
		
	КонецЦикла;

	Элементы.ОшибкиПоОрганизациям.Отображение = ОтображениеТаблицы.Список;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоОшибокПлоско(ДеревоОшибок, Ошибки)

	Корень = ДеревоОшибок.Строки;
	Для каждого Ошибка Из Ошибки Цикл
		УровеньОшибки = Корень.Добавить();
		УровеньОшибки.ОписаниеОшибки = Ошибка.ОписаниеОшибки;
	КонецЦикла; 

	Элементы.ОшибкиПоОрганизациям.Отображение = ОтображениеТаблицы.Список;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиНадписьПроОшибки(МассивОшибок)

	Если ЭтоРасшифровка Тогда
		Надпись = НСтр("ka='Обратите внимание, при расшифровке возникли следующие ошибки:';ru='Обратите внимание, при расшифровке возникли следующие ошибки:';en='Note when interpreting any following errors:'");
	ИначеЕсли ЭтоОбмен Тогда
		Надпись = НСтр("ka='Обратите внимание, при обновлении возникли следующие ошибки:';ru='Обратите внимание, при обновлении возникли следующие ошибки:';en='Note that when you upgrade any following errors:'");
	ИначеЕсли ЭтоОтправка Тогда
		Надпись = НСтр("ka='Возникли следующие ошибки:';ru='Возникли следующие ошибки:';en='The following error occurred:'");
	Иначе
		Надпись = НСтр("ka='Обратите внимание, при обновлении возникли следующие ошибки:';ru='Обратите внимание, при обновлении возникли следующие ошибки:';en='Note that when you upgrade any following errors:'");
	КонецЕсли;
	
	Элементы.НадписьПроКоличествоОшибок.Заголовок = Надпись;

КонецПроцедуры

#КонецОбласти