
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураДополнительныхРеквизитов_Документ_ПриходнаяНакладная = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная);
	СтруктураДополнительныхРеквизитов_Документ_ПеремещениеЗапасов = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеЗапасов);
	СтруктураДополнительныхРеквизитов_Документ_ПриходныйОрдер = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходныйОрдер);
	СтруктураДополнительныхРеквизитов_Документ_ОприходованиеЗапасов = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОприходованиеЗапасов);
	СтруктураДополнительныхРеквизитов_Документ_РасходнаяНакладная = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
	СтруктураДополнительныхРеквизитов_Документ_ОтчетОРозничныхПродажах = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОтчетОРозничныхПродажах);
	СтруктураДополнительныхРеквизитов_Документ_ПоступлениеВКассу = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеВКассу);
	СтруктураДополнительныхРеквизитов_Документ_ПоступлениеНаСчет = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеНаСчет);
	СтруктураДополнительныхРеквизитов_Документ_ПеремещениеДС = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеДС);
	
	СтруктураДополнительныхРеквизитов_Справочник_СтруктурныеЕдиницы = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
	
	Если НЕ ЗначениеЗаполнено(Объект.СтатьиДвиженияДенежныхСредств_ПеремещениеДС) Тогда
		Объект.СтатьиДвиженияДенежныхСредств_ПеремещениеДС = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам;
	КонецЕсли;
	
	Заполнить_ТЗ_СкладыПодразделения();
	
КонецПроцедуры

&НаСервере
Процедура Заполнить_ТЗ_СкладыПодразделения()
	
	РЕЗ = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка,
		|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК Тип,
		|	СтруктурныеЕдиницыДополнительныеРеквизиты.Свойство,
		|	СтруктурныеЕдиницыДополнительныеРеквизиты.Значение
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы.ДополнительныеРеквизиты КАК СтруктурныеЕдиницыДополнительныеРеквизиты
		|		ПО СтруктурныеЕдиницы.Ссылка = СтруктурныеЕдиницыДополнительныеРеквизиты.Ссылка
		|ГДЕ
		|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтруктурныеЕдиницыДополнительныеРеквизиты.Ссылка,
		|	Тип";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура("Склад", ВыборкаДетальныеЗаписи.Ссылка);
		МассивСтрок = ТЗ_СкладыПодразделения.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество()=0 Тогда
			ТекСтрока = ТЗ_СкладыПодразделения.Добавить();
			ТекСтрока.Склад = ВыборкаДетальныеЗаписи.Ссылка;
			ТекСтрока.Тип = ВыборкаДетальныеЗаписи.Тип;
		Иначе
			ТекСтрока = МассивСтрок[0];
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.Свойство = РЕЗ.SurplusSubdivision Тогда
			
			ТекСтрока.SurplusSubdivision = ВыборкаДетальныеЗаписи.Значение;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = РЕЗ.SurplusInventorySubdivision Тогда
			
			ТекСтрока.SurplusInventorySubdivision = ВыборкаДетальныеЗаписи.Значение;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = РЕЗ.WriteОffSubdivision Тогда
			
			ТекСтрока.WriteОffSubdivision = ВыборкаДетальныеЗаписи.Значение;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = РЕЗ.WriteОffUniformSubdivision Тогда
			
			ТекСтрока.WriteОffUniformSubdivision = ВыборкаДетальныеЗаписи.Значение;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = РЕЗ.WriteОffUtilizationSubdivision Тогда
			
			ТекСтрока.WriteОffUtilizationSubdivision = ВыборкаДетальныеЗаписи.Значение;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = РЕЗ.WriteОffInventorySubdivision Тогда
			
			ТекСтрока.WriteОffInventorySubdivision = ВыборкаДетальныеЗаписи.Значение;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = РЕЗ.SaleSubdivision Тогда
			
			ТекСтрока.SaleSubdivision = ВыборкаДетальныеЗаписи.Значение;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РЕЗ = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
	
	Для каждого СтрТЗ_СкладыПодразделения Из ТЗ_СкладыПодразделения Цикл
	
		Если ЗначениеЗаполнено(СтрТЗ_СкладыПодразделения.SurplusSubdivision) Тогда
			
			ТекСклад = СтрТЗ_СкладыПодразделения.Склад.ПолучитьОбъект();
			РозницаHTTP.УстановитьДополнительныйРеквизит(ТекСклад,РЕЗ.SurplusSubdivision,СтрТЗ_СкладыПодразделения.SurplusSubdivision);
			ТекСклад.Записать();
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СтрТЗ_СкладыПодразделения.SurplusInventorySubdivision) Тогда
			
			ТекСклад = СтрТЗ_СкладыПодразделения.Склад.ПолучитьОбъект();
			РозницаHTTP.УстановитьДополнительныйРеквизит(ТекСклад,РЕЗ.SurplusInventorySubdivision,СтрТЗ_СкладыПодразделения.SurplusInventorySubdivision);
			ТекСклад.Записать();
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СтрТЗ_СкладыПодразделения.WriteОffSubdivision) Тогда
			
			ТекСклад = СтрТЗ_СкладыПодразделения.Склад.ПолучитьОбъект();
			РозницаHTTP.УстановитьДополнительныйРеквизит(ТекСклад,РЕЗ.WriteОffSubdivision,СтрТЗ_СкладыПодразделения.WriteОffSubdivision);
			ТекСклад.Записать();
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СтрТЗ_СкладыПодразделения.WriteОffUniformSubdivision) Тогда
			
			ТекСклад = СтрТЗ_СкладыПодразделения.Склад.ПолучитьОбъект();
			РозницаHTTP.УстановитьДополнительныйРеквизит(ТекСклад,РЕЗ.WriteОffUniformSubdivision,СтрТЗ_СкладыПодразделения.WriteОffUniformSubdivision);
			ТекСклад.Записать();
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СтрТЗ_СкладыПодразделения.WriteОffUtilizationSubdivision) Тогда
			
			ТекСклад = СтрТЗ_СкладыПодразделения.Склад.ПолучитьОбъект();
			РозницаHTTP.УстановитьДополнительныйРеквизит(ТекСклад,РЕЗ.WriteОffUtilizationSubdivision,СтрТЗ_СкладыПодразделения.WriteОffUtilizationSubdivision);
			ТекСклад.Записать();
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СтрТЗ_СкладыПодразделения.WriteОffInventorySubdivision) Тогда
			
			ТекСклад = СтрТЗ_СкладыПодразделения.Склад.ПолучитьОбъект();
			РозницаHTTP.УстановитьДополнительныйРеквизит(ТекСклад,РЕЗ.WriteОffInventorySubdivision,СтрТЗ_СкладыПодразделения.WriteОffInventorySubdivision);
			ТекСклад.Записать();
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрТЗ_СкладыПодразделения.SaleSubdivision) Тогда
			
			ТекСклад = СтрТЗ_СкладыПодразделения.Склад.ПолучитьОбъект();
			РозницаHTTP.УстановитьДополнительныйРеквизит(ТекСклад,РЕЗ.SaleSubdivision,СтрТЗ_СкладыПодразделения.SaleSubdivision);
			ТекСклад.Записать();
			
		КонецЕсли;
	
	КонецЦикла; 
КонецПроцедуры

