
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭУ();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// определяем возможные полномочия в таблице
	ОпределитьПолномочиеВТаблице("01", НСтр("ka='подписывать налоговую декларацию, др. отчетность';ru='подписывать налоговую декларацию, др. отчетность';en='sign tax return al. statements'"));
	ОпределитьПолномочиеВТаблице("02", НСтр("ka='საგადასახო დეკლარაციისა და სხვა გადასახადების ნახვა.';ru='представлять налоговую декларацию, др. отчетность';en='represent a tax return, et al. statements'"));
	ОпределитьПолномочиеВТаблице("03", НСтр("ka='получать документы в инспекции ФНС России';ru='получать документы в инспекции ФНС России';en='receive documents inspectorate Russian'"));
	ОпределитьПолномочиеВТаблице("04", НСтр("ka='вносить изменения в документы налоговой отчетности';ru='вносить изменения в документы налоговой отчетности';en='make changes in tax reporting documents'"));
	ОпределитьПолномочиеВТаблице("05", НСтр("ka='подписывать документы, используемые при постановке и снятии с учета и сообщении сведений, установленных НК РФ (за исключением документов, используемых при  учете и контроле банковских счетов)';ru='подписывать документы, используемые при постановке и снятии с учета и сообщении сведений, установленных НК РФ (за исключением документов, используемых при  учете и контроле банковских счетов)';en='sign documents that are used in the formulation and deregistration and the message data set of the Tax Code (except for documents used in accounting and control of bank accounts)'"));
	ОпределитьПолномочиеВТаблице("06", НСтр("ka='представлять документы, используемые при постановке и снятии с учета и сообщении сведений, установленных НК РФ (за исключением документов,  используемых при  учете и контроле банковских счетов)';ru='представлять документы, используемые при постановке и снятии с учета и сообщении сведений, установленных НК РФ (за исключением документов,  используемых при  учете и контроле банковских счетов)';en='submit documents used in the formulation and deregistration and the message data set of the Tax Code (except for documents used in accounting and control of bank accounts)'"));
	ОпределитьПолномочиеВТаблице("07", НСтр("ka='получать от налогового органа документы, подтверждающие постановку и снятие с учета';ru='получать от налогового органа документы, подтверждающие постановку и снятие с учета';en='receive from the tax authority documents confirming the statement and deregistration'"));
	ОпределитьПолномочиеВТаблице("08", НСтр("ka='подписывать документы, используемые при  учете и контроле банковских счетов';ru='подписывать документы, используемые при  учете и контроле банковских счетов';en='sign documents used in accounting and control of bank accounts'"));
	ОпределитьПолномочиеВТаблице("09", НСтр("ka='представлять документы, используемые при  учете и контроле банковских счетов';ru='представлять документы, используемые при  учете и контроле банковских счетов';en='submit documents used in accounting and control of bank accounts'"));
	ОпределитьПолномочиеВТаблице("10", НСтр("ka='სპეციალური საგადასახადო რეჟიმის გამოყენების შესახებ დოკუმენტაციის წარდგენა და ცალკეული ქვეგანყოფილებების ბუღალტრული აღრიცხვის კონსოლიდაცია"
"';ru='представлять документы по применению специальных налоговых режимов и консолидации учета по обособленным подразделениям';en='submit documents for application of special tax regimes and accounting consolidation of separate subdivisions'"));
	ОпределитьПолномочиеВТаблице("11", НСтр("ka='получать в инспекции ФНС России документы по применению специальных налоговых режимов и консолидации учета по обособленным подразделениям';ru='получать в инспекции ФНС России документы по применению специальных налоговых режимов и консолидации учета по обособленным подразделениям';en='receive inspectorate Russian documents on the application of special tax regimes and accounting consolidation of separate subdivisions'"));
	ОпределитьПолномочиеВТаблице("12", НСтр("ka='подписывать документы по консолидации учета по обособленным подразделениям';ru='подписывать документы по консолидации учета по обособленным подразделениям';en='sign documents on account of the consolidation of separate subdivisions'"));
	ОпределитьПолномочиеВТаблице("13", НСтр("ka='ბიუჯეტთან ანგარიშსწორების შედგენასთან დაკავშირებული განაცხადებისა და მოთხოვნების წარდგენა, ბიუჯეტთან ანგარიშსწორების სტატუსის შესახებ ინფორმაციის მიღება.';ru='представлять заявления и запросы на проведение сверки расчетов с бюджетом, получение справок о состоянии расчетов с бюджетом';en='submit applications and requests for payment reconciliation with the budget, the preparation of certificates on the status of settlements with the budget'"));
	ОпределитьПолномочиеВТаблице("14", НСтр("ka='получать в инспекции ФНС России акты сверок и справки о состоянии расчетов с бюджетом';ru='получать в инспекции ФНС России акты сверок и справки о состоянии расчетов с бюджетом';en='receive inspectorate Russian acts of verifications and inquiries about the status of settlements with the budget'"));
	ОпределитьПолномочиеВТаблице("15", НСтр("ka='подписывать акт сверки расчетов с бюджетом';ru='подписывать акт сверки расчетов с бюджетом';en='to sign an act of reconciliation with the budget'"));
	ОпределитьПолномочиеВТаблице("16", НСтр("ka='подписывать акт и решение налоговой проверки';ru='подписывать акт и решение налоговой проверки';en='to sign the act and decision of the tax audit'"));
	ОпределитьПолномочиеВТаблице("17", НСтр("ka='подписывать заявление на зачет/возврат налога';ru='подписывать заявление на зачет/возврат налога';en='sign the application for credit / refund of tax'"));
	ОпределитьПолномочиеВТаблице("18", НСтр("ka='подписывать заявления о ввозе товаров и уплате косвенных налогов';ru='подписывать заявления о ввозе товаров и уплате косвенных налогов';en='sign the application on the import of goods and payment of indirect taxes'"));
	ОпределитьПолномочиеВТаблице("19", НСтр("ka='получать заявления о ввозе товаров и уплате';ru='получать заявления о ввозе товаров и уплате';en='receive applications for import of goods and payment'"));
	ОпределитьПолномочиеВТаблице("20", НСтр("ka='подписывать документы по применению специальных налоговых режимов, игорному бизнесу и консолидации учета по обособленным подразделениям';ru='подписывать документы по применению специальных налоговых режимов, игорному бизнесу и консолидации учета по обособленным подразделениям';en='to sign documents for the application of special tax regimes, gambling and consolidation accounting for separate subdivisions'"));
	ОпределитьПолномочиеВТаблице("21", НСтр("ka='подписывать документы (информацию)';ru='подписывать документы (информацию)';en='sign documents (information)'"));
	ОпределитьПолномочиеВТаблице("22", НСтр("ka='ნახვა დოკუმენტების ( ინფორმაციის)';ru='представлять документы (информацию)';en='submit documents (information)'"));
	
	// расставляем флажки
	ПолныеПолномочия = Параметры.ИсходныеДанныеСтроки.ПризнакПолныеПолномочия;
	Если НЕ ПолныеПолномочия Тогда
		Для Каждого СтрПолномочие Из Полномочия Цикл
			СтрПолномочие.Пометка = Параметры.ИсходныеДанныеСтроки["Признак" + СтрПолномочие.Код];
		КонецЦикла;
	КонецЕсли;
	
	// устанавливаем в исходное значение переключатель "Полные полномочия"
	ПереключательПолныеПолномочия = ?(ПолныеПолномочия, "0", "1");
	
	// инициализируем КПП
	ЭтоПБОЮЛ = НЕ РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(Параметры.Организация);
	Элементы.КПП.Видимость = НЕ ЭтоПБОЮЛ;
	КПП = Параметры.ИсходныеДанныеСтроки.КПП;
	
	// инициализируем ОКАТО
	ОКАТО = Параметры.ИсходныеДанныеСтроки.ОКАТО;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РеквизитПереключательПолныеПолномочияПриИзменении(Элемент)
	
	ПолныеПолномочия = ?(ПереключательПолныеПолномочия = "0", Истина, Ложь);
	УправлениеЭУ();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого Стр Из Полномочия Цикл
		Стр.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого Стр Из Полномочия Цикл
		Стр.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеОК(Команда)
	
	Если НЕ СохранениеВозможно() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПризнакПолныеПолномочия", ?(ПереключательПолныеПолномочия = "0", Истина, Ложь));
	Результат.Вставить("ОКАТО", СокрЛП(ОКАТО));
	Результат.Вставить("КПП", СокрЛП(КПП));
	Для Каждого Стр Из Полномочия Цикл
		Результат.Вставить("Признак" + Стр.Код, ?(ПереключательПолныеПолномочия = "0", Ложь, Стр.Пометка));
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеЭУ()
	
	Элементы.ГруппаТаблицаПолномочий.Доступность = НЕ ПолныеПолномочия;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьПолномочиеВТаблице(КодПолномочия, НаименованиеПолномочия)
	
	НовСтр = Полномочия.Добавить();
	НовСтр.Код = КодПолномочия;
	НовСтр.Наименование = НаименованиеПолномочия;
	
КонецПроцедуры

&НаКлиенте
Функция СохранениеВозможно()
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	// проверяем полномочия
	Если ПереключательПолныеПолномочия <> "0" Тогда
		СтрокиИстина = Полномочия.НайтиСтроки(Новый Структура("Пометка", Истина));
		Если СтрокиИстина.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='უფლებამოსილების არცერთი ტიპი არ არის არჩეული.';ru='Не выбран ни один вид полномочия.';en='Do not select any kind of authority.'"), , "Полномочия", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	// проверяем ОКАТО
	СокрЛПОКАТО = СокрЛП(ОКАТО);
	Если СтрДлина(СокрЛПОКАТО) <> 0 И СтрДлина(СокрЛПОКАТО) <> 11 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Число цифр в ОКАТО должно быть равно 11.';ru='Число цифр в ОКАТО должно быть равно 11.';en='The number of digits in OKATO must be equal to 11.'"), , "ОКАТО", , Отказ);
	ИначеЕсли НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СокрЛПОКАТО) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='ОКАТО должен состоять только из цифр.';ru='ОКАТО должен состоять только из цифр.';en='OKATO must consist only of numbers.'"), , "ОКАТО", , Отказ);
	КонецЕсли;
	
	// проверяем КПП
	Если Элементы.КПП.Видимость Тогда
		СокрЛПКПП = СокрЛП(КПП);
		Если СтрДлина(СокрЛПКПП) <> 0 И СтрДлина(СокрЛПКПП) <> 9 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='ციფრების რაოდენობა ს.კ / პ.ნ-ში უნდა იყოს 9-ის ტოლი.';ru='Число цифр в КПП должно быть равно 9.';en='The number of digits in the check point must be equal to 9.'"), , "КПП", , Отказ);
		ИначеЕсли НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СокрЛПКПП) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='КПП უნდა შედგებოდეს მხოლოდ ციფრებისგან.';ru='КПП должен состоять только из цифр.';en='CPR should contain only numbers.'"), , "КПП", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

#КонецОбласти
