
&Вместо("ПриОпределенииНастроекОтчета")
Процедура РасшAzRy_ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов)
	
	НастройкиВариантов["ВВалюте"].Рекомендуемый = Истина;
	
	//ПодольскийАИ #УчетПроектов 01.12.2020 {
	//НастройкиВариантов["ВВалютеПоПроекту"].Рекомендуемый = Истина; // AzRy - შეცდომას არტყავდა და დროებით დავაკომენტარე
	//ПодольскийАИ #УчетПроектов 01.12.2020 }
	
	ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов);
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

&Вместо("УстановитьТегиВариантов")
Процедура РасшAzRy_УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["Основной"].Теги = НСТР("ka='Зарплата,Сотрудники,Начисления,Удержания';ru='Зарплата,Сотрудники,Начисления,Удержания';en='Salary, Employees, Accruals, Deductions'");
	НастройкиВариантов["ВВалюте"].Теги = НСТР("ka='Зарплата,Сотрудники,Начисления,Удержания,Валюты';ru='Зарплата,Сотрудники,Начисления,Удержания,Валюты';en='Salary, Employees, Accruals, Deductions, Currency'");
	
	//ПодольскийАИ #УчетПроектов 01.12.2020 {
	//НастройкиВариантов["ОсновнойПоПроекту"].Теги = НСТР("ka='Зарплата,Сотрудники,Начисления,Удержания,Проекты';ru='Зарплата,Сотрудники,Начисления,Удержания,Проекты'");                 // AzRy - შეცდომას არტყავდა და დროებით დავაკომენტარე
	//НастройкиВариантов["ВВалютеПоПроекту"].Теги = НСТР("ka='Зарплата,Сотрудники,Начисления,Удержания,Валюты,Проекты';ru='Зарплата,Сотрудники,Начисления,Удержания,Валюты,Проекты'");    // AzRy - შეცდომას არტყავდა და დროებით დავაკომენტარე
	//ПодольскийАИ #УчетПроектов 01.12.2020 }
	
КонецПроцедуры

&Вместо("ДобавитьОписанияСвязанныхПолей")
Процедура РасшAzRy_ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "Сотрудник", "Справочник.Сотрудники");
	
	//ПодольскийАИ #УчетПроектов 01.12.2020 {
	//ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ОсновнойПоПроекту"].СвязанныеПоля, "Сотрудник", "Справочник.Сотрудники");  // AzRy - შეცდომას არტყავდა და დროებით დავაკომენტარე
	//ПодольскийАИ #УчетПроектов 01.12.2020 }
	
КонецПроцедуры
