
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Дата1) И Не ЗначениеЗаполнено(Дата2) Тогда
		Возврат;
	КонецЕсли; 
	
    СтандартнаяОбработка = Ложь;
    //Получаем схему
    Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    
    //...и настройки
    Настройки = КомпоновщикНастроек.ПолучитьНастройки();
    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
    
    //Создаем компоновщик макета и получаем макет компоновки
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, ДанныеРасшифровки);
		
    ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ТЗ", СформироватьТЗ());
    
    //Инициализируем процессор компоновки
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	//Очищаем документ результата
    ДокументРезультат.Очистить();
    
    //Выводим отчет в документ
    ПроцессорВывода = Новый
    ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	
КонецПроцедуры

Функция СформироватьТЗ()
		
	Если Не ЗначениеЗаполнено(Дата1) И Не ЗначениеЗаполнено(Дата2) Тогда
		Возврат "";
	КонецЕсли; 	
	
	Возврат СформироватьДанные();
	
КонецФункции

// ახალი ფუნქიონალი
Функция СформироватьДанные()
	
	ТЗ  = ТаблицаЭтап1();
	ТЗ2	= ТаблицаЭтап2(ТЗ);
	
	Возврат ТЗ2;

КонецФункции

Функция ТаблицаЭтап1()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияИУдержания.Сотрудник,
		|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, ДЕНЬ) КАК Период,
		|	МАКСИМУМ(Сотрудники.Период) КАК МаксимальнаяДатаРегистра,
		|	НачисленияИУдержания.Организация,
		|	НачисленияИУдержания.СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ТЗПериодДляДольжносты
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		НачисленияИУдержания.Сотрудник КАК Сотрудник,
		|		НачисленияИУдержания.Организация КАК Организация,
		|		НачисленияИУдержания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, ДЕНЬ) КАК Период
		|	ИЗ
		|		РегистрНакопления.НачисленияИУдержания КАК НачисленияИУдержания
		|	ГДЕ
		|		НачисленияИУдержания.ПериодРегистрации МЕЖДУ &ПериодРегистрации1 И &ПериодРегистрации2) КАК НачисленияИУдержания
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК Сотрудники
		|		ПО НачисленияИУдержания.Сотрудник = Сотрудники.Сотрудник
		|ГДЕ
		|	НачисленияИУдержания.Период >= Сотрудники.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияИУдержания.Сотрудник,
		|	НачисленияИУдержания.Период,
		|	НачисленияИУдержания.Организация,
		|	НачисленияИУдержания.СтруктурнаяЕдиница
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияИУдержания.НачалоПериодРегистрации,
		|	НачисленияИУдержания.Период КАК Период,
		|	НачисленияИУдержания.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(НачисленияИУдержания.Сумма, 0) КАК Сумма,
		|	НачисленияИУдержания.ВидНачисленияУдержания,
		|	НачисленияИУдержания.Организация КАК Организация,
		|	НачисленияИУдержания.СтруктурнаяЕдиница,
		|	НачисленияИУдержания.Валюта,
		|	Должности.Должность,
		|	КонтактнаяИнформация.НомерТелефона,
		|	КадровыеДанныеСрезПоследных.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаСрезПоследных,
		|	КадровыеДанныеСрезПоследных.Должность КАК ДолжностьСрезПоследных,
		|	НачисленияИУдержания.Сотрудник.Код КАК СотрудникКод,
		|	КадровыеДанныеСрезПоследных.AzRyDivision
		|ИЗ
		|	(ВЫБРАТЬ
		|		НАЧАЛОПЕРИОДА(НачисленияИУдержания.ПериодРегистрации, МЕСЯЦ) КАК НачалоПериодРегистрации,
		|		НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, ДЕНЬ) КАК Период,
		|		НачисленияИУдержания.Сотрудник КАК Сотрудник,
		|		СУММА(ВЫБОР
		|				КОГДА НачисленияИУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
		|						ИЛИ НачисленияИУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог)
		|					ТОГДА -НачисленияИУдержания.Сумма
		|				ИНАЧЕ НачисленияИУдержания.Сумма
		|			КОНЕЦ) КАК Сумма,
		|		НачисленияИУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
		|		НачисленияИУдержания.Организация КАК Организация,
		|		НачисленияИУдержания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		НачисленияИУдержания.Валюта КАК Валюта
		|	ИЗ
		|		РегистрНакопления.НачисленияИУдержания КАК НачисленияИУдержания
		|	ГДЕ
		|		НачисленияИУдержания.ПериодРегистрации МЕЖДУ &ПериодРегистрации1 И &ПериодРегистрации2
		|	
		|	СГРУППИРОВАТЬ ПО
		|		НАЧАЛОПЕРИОДА(НачисленияИУдержания.ПериодРегистрации, МЕСЯЦ),
		|		НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, ДЕНЬ),
		|		НачисленияИУдержания.Сотрудник,
		|		НачисленияИУдержания.ВидНачисленияУдержания,
		|		НачисленияИУдержания.Организация,
		|		НачисленияИУдержания.СтруктурнаяЕдиница,
		|		НачисленияИУдержания.Валюта) КАК НачисленияИУдержания
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТЗПериодДляДольжносты.Сотрудник КАК Сотрудник,
		|			ТЗПериодДляДольжносты.Период КАК Период,
		|			ТЗПериодДляДольжносты.МаксимальнаяДатаРегистра КАК МаксимальнаяДатаРегистра,
		|			ТЗПериодДляДольжносты.Организация КАК Организация,
		|			ТЗПериодДляДольжносты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|			ДолжностьСотрудника.Должность КАК Должность
		|		ИЗ
		|			ТЗПериодДляДольжносты КАК ТЗПериодДляДольжносты
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК ДолжностьСотрудника
		|				ПО ТЗПериодДляДольжносты.Сотрудник = ДолжностьСотрудника.Сотрудник
		|					И ТЗПериодДляДольжносты.Организация = ДолжностьСотрудника.Организация
		|					И ТЗПериодДляДольжносты.МаксимальнаяДатаРегистра = ДолжностьСотрудника.Период) КАК Должности
		|		ПО НачисленияИУдержания.Организация = Должности.Организация
		|			И НачисленияИУдержания.Сотрудник = Должности.Сотрудник
		|			И НачисленияИУдержания.Период = Должности.Период
		|			И НачисленияИУдержания.СтруктурнаяЕдиница = Должности.СтруктурнаяЕдиница
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка,
		|			ФизическиеЛицаКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|		ИЗ
		|			Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|		ГДЕ
		|			ФизическиеЛицаКонтактнаяИнформация.Тип = &Тип) КАК КонтактнаяИнформация
		|		ПО НачисленияИУдержания.Сотрудник.Физлицо = КонтактнаяИнформация.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СотрудникиСрезПоследних.Организация КАК Организация,
		|			СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
		|			СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|			СотрудникиСрезПоследних.Должность КАК Должность,
		|			СотрудникиСрезПоследних.AzRyDivision КАК AzRyDivision
		|		ИЗ
		|			РегистрСведений.Сотрудники.СрезПоследних(&ПериодРегистрации2, ТИПЗНАЧЕНИЯ(Регистратор) <> ТИП(Документ.Увольнение)) КАК СотрудникиСрезПоследних) КАК КадровыеДанныеСрезПоследных
		|		ПО НачисленияИУдержания.Организация = КадровыеДанныеСрезПоследных.Организация
		|			И НачисленияИУдержания.Сотрудник = КадровыеДанныеСрезПоследных.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Сотрудник,
		|	Период";
	
	Запрос.УстановитьПараметр("ПериодРегистрации1", Дата1);
	Запрос.УстановитьПараметр("ПериодРегистрации2", Дата2);
	Запрос.Параметры.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ТаблицаЭтап2(ТЗНачисленияСотрудника)

	ТЗСотрудники = ТЗНачисленияСотрудника.Скопировать(, "Сотрудник");
	ТЗСотрудники.Свернуть("Сотрудник");	
	ТЗДаты = СписокМесяцевЗаПериод(Дата1, Дата2, ТЗСотрудники.ВыгрузитьКолонку("Сотрудник"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗНачисленияСотрудника.НачалоПериодРегистрации,
		|	ТЗНачисленияСотрудника.Период,
		|	ТЗНачисленияСотрудника.Сотрудник, 
		|	ЕСТЬNULL(ТЗНачисленияСотрудника.Сумма, 0) КАК Сумма,
		|	ТЗНачисленияСотрудника.ВидНачисленияУдержания,
		|	ТЗНачисленияСотрудника.Организация,
		|	ТЗНачисленияСотрудника.СтруктурнаяЕдиница,
		|	ТЗНачисленияСотрудника.AzRyDivision,
		|	ТЗНачисленияСотрудника.Должность,		
		|	ТЗНачисленияСотрудника.Валюта,
		|	ТЗНачисленияСотрудника.НомерТелефона,
		|	ТЗНачисленияСотрудника.СтруктурнаяЕдиницаСрезПоследных,
		|	ТЗНачисленияСотрудника.ДолжностьСрезПоследных,
		|	ТЗНачисленияСотрудника.СотрудникКод
		|ПОМЕСТИТЬ ТЗНачисленияСотрудника_
		|ИЗ
		|	&ТЗНачисленияСотрудника КАК ТЗНачисленияСотрудника
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗДаты.Период,
		|	ТЗДаты.Сотрудник
		|ПОМЕСТИТЬ ТЗДаты_
		|ИЗ
		|	&ТЗДаты КАК ТЗДаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТЗНачисленияСотрудника.НачалоПериодРегистрации, ТЗДаты.Период) КАК НачалоПериодРегистрации,
		|	ЕСТЬNULL(ТЗНачисленияСотрудника.Период, ТЗДаты.Период) КАК Период,
		|	ЕСТЬNULL(ТЗНачисленияСотрудника.Сотрудник, ТЗДаты.Сотрудник) КАК Сотрудник,
		|	ЕСТЬNULL(ТЗНачисленияСотрудника.Сумма, 0) * &Парам КАК Сумма,
		|	ТЗНачисленияСотрудника.ВидНачисленияУдержания,
		|	ТЗНачисленияСотрудника.Организация,
		|	ТЗНачисленияСотрудника.СтруктурнаяЕдиница,
		|	ТЗНачисленияСотрудника.AzRyDivision,
		|	ТЗНачисленияСотрудника.Должность,
		|	ТЗНачисленияСотрудника.Валюта,
		|	ТЗНачисленияСотрудника.НомерТелефона,
		|	ВЫБОР
		|		КОГДА ТЗНачисленияСотрудника.Сотрудник ЕСТЬ NULL 
		|			ТОГДА ТЗДаты.Сотрудник.Физлицо.ИНН
		|		ИНАЧЕ ТЗДаты.Сотрудник.Физлицо.ИНН
		|	КОНЕЦ КАК ПерсональныйНомер,
		|	ТЗНачисленияСотрудника.СтруктурнаяЕдиницаСрезПоследных,
		|	ТЗНачисленияСотрудника.ДолжностьСрезПоследных,
		|	ТЗНачисленияСотрудника.СотрудникКод
		|ИЗ
		|	ТЗДаты_ КАК ТЗДаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗНачисленияСотрудника_ КАК ТЗНачисленияСотрудника
		|		ПО ТЗДаты.Сотрудник = ТЗНачисленияСотрудника.Сотрудник
		|			И ТЗДаты.Период = ТЗНачисленияСотрудника.НачалоПериодРегистрации
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник";
				
	Запрос.Параметры.Вставить("ТЗНачисленияСотрудника", ТЗНачисленияСотрудника);
	Запрос.Параметры.Вставить("ТЗДаты", ТЗДаты);
	Запрос.Параметры.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.Параметры.Вставить("Парам", ?(КлючТекущегоВариантаОтчета = "Основной4", 0.8, 1));
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;

КонецФункции

Функция СписокМесяцевЗаПериод(ДатаН, ДатаК, МассивСотрудников)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	
	Для каждого ТекСотрудник Из МассивСотрудников Цикл
		ТекДата = ДатаН;
		Пока ТекДата < ДатаК Цикл
			
			НоваяСтрока = ТЗ.Добавить();
			НоваяСтрока.Период = ТекДата;
			НоваяСтрока.Сотрудник = ТекСотрудник;
			
			//  Для получения даты следющего месяца на Конец Дня,
			// получаем дату конца месяца текущей даты и плюс одни сутки
			//ТекДата = КонецМесяца(ТекДата) + 60 * 60 * 24;
			//  Для получения даты следющего месяца на Начало Дня,
			// получаем дату конца месяца текущей даты и плюс один
			ТекДата = КонецМесяца(ТекДата) + 1; 			
		КонецЦикла;		
	КонецЦикла;
		
	Возврат ТЗ;
	
КонецФункции

// მონაცემების დასელექტების მაგალითი: https://1s83.info/programmirovanie/srez-poslednih-na-kazhduyu-datu-v-zaprose-1s.html




