                         
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест"
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Параметры.Свойство("Идентификатор", Идентификатор);
	Параметры.Свойство("ДрайверОборудования", ДрайверОборудования);
	Заголовок = НСтр("ka='ДП';ru='ДП'") + " """ + Строка(Идентификатор) + """";

	ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	ЦветОшибки = ЦветаСтиля.ЦветОтрицательногоЧисла;

	СпПорт = Элементы.Порт.СписокВыбора;
	Для Номер = 1 По 32 Цикл
		СпПорт.Добавить(Номер, "COM" + Формат(Номер, "ЧЦ=2; ЧДЦ=0; ЧН=0; ЧГ=0"));
	КонецЦикла;

	СпСкорость = Элементы.Скорость.СписокВыбора;
	СпСкорость.Добавить(3,  "1200");
	СпСкорость.Добавить(4,  "2400");
	СпСкорость.Добавить(5,  "4800");
	СпСкорость.Добавить(7,  "9600");

	СпЧетность = Элементы.Четность.СписокВыбора;
	СпЧетность.Добавить(0, НСтр("ka='არა';ru='Нет'"));
	СпЧетность.Добавить(1, НСтр("ka='კენტი';ru='Нечетность'"));
	СпЧетность.Добавить(2, НСтр("ka='ორის ჯერადი';ru='Четность'"));

	времПорт         = Неопределено;
	времСкорость     = Неопределено;
	времЧетность     = Неопределено;
	времНаименование = Неопределено;
	времTerminalID = Неопределено;
	времБанкТерминала = Неопределено;
	времЗапретВозвратаЧастичнуюСуммуНаТерминале = Неопределено;
	времTerminalAlias = Неопределено;
	времИспользоватьTranslinkДляТерминала = Неопределено;
	времПечатьСлипНаТерминале = Неопределено;

	Параметры.ПараметрыОборудования.Свойство("Порт"        , времПорт);
	Параметры.ПараметрыОборудования.Свойство("Скорость"    , времСкорость);
	Параметры.ПараметрыОборудования.Свойство("Четность"    , времЧетность);
	Параметры.ПараметрыОборудования.Свойство("Наименование", времНаименование);
	Параметры.ПараметрыОборудования.Свойство("TerminalID"  , времTerminalID);
	Параметры.ПараметрыОборудования.Свойство("БанкТерминала"  , времБанкТерминала);
	Параметры.ПараметрыОборудования.Свойство("ЗапретВозвратаЧастичнуюСуммуНаТерминале"  , времЗапретВозвратаЧастичнуюСуммуНаТерминале);
	Параметры.ПараметрыОборудования.Свойство("TerminalAlias"  , времTerminalAlias);
	Параметры.ПараметрыОборудования.Свойство("ИспользоватьTranslinkДляТерминала"  , времИспользоватьTranslinkДляТерминала);
	Параметры.ПараметрыОборудования.Свойство("ПечатьСлипНаТерминале"  , времПечатьСлипНаТерминале);

	Порт         = ?(времПорт         = Неопределено, 1, времПорт);
	Скорость     = ?(времСкорость     = Неопределено, 7, времСкорость);
	Четность     = ?(времЧетность     = Неопределено, 0, времЧетность);
	Наименование = ?(времНаименование = Неопределено, "", времНаименование);
	TerminalID   = ?(времTerminalID = Неопределено, "", времTerminalID);
	БанкТерминала= ?(времБанкТерминала = Неопределено, "", времБанкТерминала);
	ЗапретВозвратаЧастичнуюСуммуНаТерминале= ?(времЗапретВозвратаЧастичнуюСуммуНаТерминале = Неопределено, Ложь, времЗапретВозвратаЧастичнуюСуммуНаТерминале);
	TerminalAlias= ?(времTerminalAlias = Неопределено, "", времTerminalAlias);
	ИспользоватьTranslinkДляТерминала= ?(времИспользоватьTranslinkДляТерминала = Неопределено, "", времИспользоватьTranslinkДляТерминала);
	ПечатьСлипНаТерминале= ?(времПечатьСлипНаТерминале = Неопределено, "", времПечатьСлипНаТерминале);

	Элементы.ТестУстройства.Видимость    = (ПараметрыСеанса.РабочееМестоКлиента
	                                        = Идентификатор.РабочееМесто);
	Элементы.УстановитьДрайвер.Видимость = (ПараметрыСеанса.РабочееМестоКлиента
	                                        = Идентификатор.РабочееМесто);

	//Элементы.Порт.Видимость    = ВозвратИсползованиеНесколькоЭквайринговыхТерминалов();
	Элементы.TerminalAlias.Видимость    = ИспользоватьTranslinkДляТерминала;
	
КонецПроцедуры

// Процедура - обработчик события "Перед открытием" формы.
//
// Параметры:
//  Отказ                - <Булево>
//                       - Признак отказа от открытия формы. Если в теле
//                         процедуры-обработчика установить данному параметру
//                         значение Истина, открытие формы выполнено не будет.
//                         Значение по умолчанию: Ложь 
//
//  СтандартнаяОбработка - <Булево>
//                       - В данный параметр передается признак выполнения
//                         стандартной (системной) обработки события. Если в
//                         теле процедуры-обработчика установить данному
//                         параметру значение Ложь, стандартная обработка
//                         события производиться не будет. Отказ от стандартной
//                         обработки не отменяет открытие формы.
//                         Значение по умолчанию: Истина 
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьИнформациюОДрайвере();

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура МодельОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	//Наименование = Элементы.ТипВесов.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение).Представление;

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Процедура представляет обработчик события "Нажатие" кнопки
// "ОК" командной панели "ОсновныеДействияФормы".
//
// Параметры:
//  Кнопка - <КнопкаКоманднойПанели>
//         - Кнопка, с которой связано данное событие (кнопка "ОК").
//
&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()

	НовыеЗначениеПараметров = Новый Структура;
	//НовыеЗначениеПараметров.Вставить("Порт"           , ?(ВозвратИсползованиеНесколькоЭквайринговыхТерминалов(), Порт, 0));
	НовыеЗначениеПараметров.Вставить("Скорость"       , Скорость);
	НовыеЗначениеПараметров.Вставить("Четность"  	  , Четность);
	НовыеЗначениеПараметров.Вставить("Наименование"   , Наименование);
	НовыеЗначениеПараметров.Вставить("TerminalID"     , TerminalID);
	НовыеЗначениеПараметров.Вставить("БанкТерминала"  , БанкТерминала);
	НовыеЗначениеПараметров.Вставить("ЗапретВозвратаЧастичнуюСуммуНаТерминале"  , ЗапретВозвратаЧастичнуюСуммуНаТерминале);
	НовыеЗначениеПараметров.Вставить("TerminalAlias"  , TerminalAlias);
	НовыеЗначениеПараметров.Вставить("ИспользоватьTranslinkДляТерминала"  , ИспользоватьTranslinkДляТерминала);
	НовыеЗначениеПараметров.Вставить("ПечатьСлипНаТерминале"  , ПечатьСлипНаТерминале);
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("ПараметрыОборудования", НовыеЗначениеПараметров);
	
	Закрыть(Результат);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДрайвер(Команда)

	ОчиститьСообщения();
	
	УстановитьДрайверAXConnect();
	
	ОбновитьИнформациюОДрайвере();

КонецПроцедуры

&НаКлиенте
Процедура ТестУстройства(Команда)

	РезультатТеста = Неопределено;

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Порт"         , Порт);
	времПараметрыУстройства.Вставить("Скорость"     , Скорость);
	времПараметрыУстройства.Вставить("Четность"     , Четность);
	времПараметрыУстройства.Вставить("Наименование" , Наименование);

	Результат = МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("CheckHealth",
	                                                                      ВходныеПараметры,
	                                                                      ВыходныеПараметры,
	                                                                      Идентификатор,
	                                                                      времПараметрыУстройства);

	ДополнительноеОписание = ?(ТипЗнч(ВыходныеПараметры) = Тип("Массив")
	                           И ВыходныеПараметры.Количество(),
	                           НСтр("ka='დამატებითი აღწერილობა:';ru='Дополнительное описание:'") + " " + ВыходныеПараметры[1],
	                           "");
	Если Результат Тогда
		ТекстСообщения = НСтр("ka='ტესტი შესრულებულია წარმატებით.%ПереводСтроки%%ДополнительноеОписание%';ru='Тест успешно выполнен.%ПереводСтроки%%ДополнительноеОписание%'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПереводСтроки%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                  "",
		                                                                  Символы.ПС));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                           "",
		                                                                           ДополнительноеОписание));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ka='ტესტი არ არის ჩაბარებული.%ПереводСтроки%%ДополнительноеОписание%';ru='Тест не пройден.%ПереводСтроки%%ДополнительноеОписание%'");
	
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПереводСтроки%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                  "",
		                                                                  Символы.ПС));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                           "",
		                                                                           ДополнительноеОписание));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОбновитьИнформациюОДрайвере()

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Порт"        , Порт);
	времПараметрыУстройства.Вставить("Скорость"    , Скорость);
	времПараметрыУстройства.Вставить("Четность"    , Четность);
	времПараметрыУстройства.Вставить("Наименование", Наименование);

	Если МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("ПолучитьВерсиюДрайвера",
	                                                               ВходныеПараметры,
	                                                               ВыходныеПараметры,
	                                                               Идентификатор,
	                                                               времПараметрыУстройства) Тогда
		Драйвер = ВыходныеПараметры[0];
		Версия  = ВыходныеПараметры[1];
	Иначе
		Драйвер = ВыходныеПараметры[2];
		Версия  = НСтр("ka='არ არის განსაზღვრული';ru='Не определена'");
	КонецЕсли;

	Элементы.Драйвер.ЦветТекста = ?(Драйвер = НСтр("ka='არ არის დაყენებული';ru='Не установлен'"), ЦветОшибки, ЦветТекста);
	Элементы.Версия.ЦветТекста  = ?(Версия  = НСтр("ka='არ არის განსაზღვრული';ru='Не определена'"), ЦветОшибки, ЦветТекста);

	Элементы.УстановитьДрайвер.Доступность = Не (Драйвер = НСтр("ka='დაყენებულია';ru='Установлен'"));

КонецПроцедуры

&НаСервере
Функция ВозвратИсползованиеНесколькоЭквайринговыхТерминалов()
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	НастройкиРМКЭквайринговыеТерминалы.ЭквайринговыйТерминал,
	|	НастройкиРМКЭквайринговыеТерминалы.ПодключаемоеОборудование
	|ИЗ
	|	Справочник.НастройкиРМК.ЭквайринговыеТерминалы КАК НастройкиРМКЭквайринговыеТерминалы
	|ГДЕ
	|	НЕ НастройкиРМКЭквайринговыеТерминалы.ИспользоватьБезПодключенияОборудования
	|	И НЕ НастройкиРМКЭквайринговыеТерминалы.Ссылка.ПометкаУдаления
	|	И НастройкиРМКЭквайринговыеТерминалы.Ссылка.РабочееМесто = &РабочееМесто
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиРМКЭквайринговыеТерминалы.ЭквайринговыйТерминал,
	|	НастройкиРМКЭквайринговыеТерминалы.ПодключаемоеОборудование";
	
	Запрос.УстановитьПараметр("РабочееМесто", МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
	Таб = Запрос.Выполнить().Выгрузить();
	
	Если Таб.Количество() > 1 Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура УстановитьДрайверAXConnect()
	
	АдресZIPфайла = КаталогПрограммы() + "AXConnect.zip";
	
	Файл = Новый Файл(АдресZIPфайла);		
	
	СсылкаНаФайл = МенеджерОборудованияВызовСервера.ПолучитьМакетССервера("ДрайверBOG_AXConnect");
	Результат = ПолучитьФайл(СсылкаНаФайл, АдресZIPфайла, Ложь);
				
	ZIPфайл = Новый ЧтениеZipФайла(АдресZIPфайла);
	ZIPфайл.ИзвлечьВсе(КаталогПрограммы());
	
	Если ИспользоватьTranslinkДляТерминала Тогда 
		ЗапуститьПриложение("regasm.exe AXCAddInLibrary.dll ",, Истина);
	Иначе
		ЗапуститьПриложение("regasm.exe AXCBog.dll ",, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьTranslinkДляТерминалаПриИзменении(Элемент)
	
	Элементы.TerminalAlias.Видимость = ИспользоватьTranslinkДляТерминала;
	
КонецПроцедуры
