#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) ЭКСПОРТ
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	ВыполнитьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства);
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияРезервированиеЗапасовИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

Процедура ВыполнитьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) ЭКСПОРТ

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	РезервированиеЗапасов.НомерСтроки КАК НомерСтроки,
	|	РезервированиеЗапасов.Организация КАК Организация,
	|	РезервированиеЗапасов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	РезервированиеЗапасов.Документ КАК Документ,
	|	РезервированиеЗапасов.Номенклатура КАК Номенклатура,
	|	РезервированиеЗапасов.Характеристика КАК Характеристика,
	|	РезервированиеЗапасов.Партия КАК Партия,
	|	РезервированиеЗапасов.Проект КАК Проект,
	|	РезервированиеЗапасов.Количество КАК КоличествоПередЗаписью,
	|	РезервированиеЗапасов.Количество КАК КоличествоИзменение,
	|	РезервированиеЗапасов.Количество КАК КоличествоПриЗаписи
	|ПОМЕСТИТЬ ДвиженияРезервированиеЗапасовИзменение
	|ИЗ
	|	РегистрНакопления.РезервированиеЗапасов КАК РезервированиеЗапасов");
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();	

КонецПроцедуры

#КонецОбласти

#КонецЕсли