//ПроверкаКонтрагентовБРО
&НаКлиенте
Перем ПроверкаКонтрагентовПараметрыОбработчикаОжидания Экспорт;
//Конец ПроверкаКонтрагентовБРО

&НаКлиенте
Перем ФормаВыгрузкиРеглОтчета;

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем ОбработкаКС Экспорт;

&НаСервере
Перем СписокРасшифровкиПоказателей;

&НаСервере
Перем СписокРасшифровкиформулы;

&НаСервере
Перем мОбъектОтчета;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обход ошибки платформы Параметр сеанса отсутствует или удален
	ТабличныйДокумент.Очистить();
	
	СформироватьСтруктуруРеквизитовФормы();
	
	СтруктураРеквизитовФормы.СписокПечатаемыхЛистов = Новый СписокЗначений;
	
	СтруктураРеквизитовФормы.мСоставПоказателей = "СоставПоказателей2017Кв1";
	
	СоответствиеЕдиницыИзмеренияДелителю = Новый Структура;
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1", 1);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000", 1000);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000000", 1000000);
	
	СтруктураРеквизитовФормы.мОписаниеТиповЧислоЕ = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(16, 2));
	
	// ОПИСАНИЕ ПАРАМЕТРОВ МНОГОСТРОЧНЫХ ГРУПП
	// Идентификаторы многострочных групп
	СтруктураРеквизитовФормы.мИдГруппы31  = "П0003100070";
	СтруктураРеквизитовФормы.мИдГруппы32  = "П0003200001";
	СтруктураРеквизитовФормы.мИдГруппы4М1 = "П0004М100";
	СтруктураРеквизитовФормы.мИдГруппы4М2 = "П0004М200";
	СтруктураРеквизитовФормы.мИдГруппы4М3 = "П0004М300";
	СтруктураРеквизитовФормы.мИдГруппы5   = "П00050000";
	СтруктураРеквизитовФормы.мИдГруппы6М1 = "П0006М100";
	СтруктураРеквизитовФормы.мИдГруппы6М2 = "П0006М200";
	СтруктураРеквизитовФормы.мИдГруппы6М3 = "П0006М300";
	СтруктураРеквизитовФормы.мИдГруппы7   = "П0007000001";
	
	// количество строк многострочных разделов по "бумажной" форме отчета
	// (минимальное количество строк, которое должно присутствовать всегда)
	КолИсхСтрокИдГруппы31  = 10;
	КолИсхСтрокИдГруппы32  = 1;
	КолИсхСтрокИдГруппы4М1 = 1;
	КолИсхСтрокИдГруппы4М2 = 1;
	КолИсхСтрокИдГруппы4М3 = 1;
	КолИсхСтрокИдГруппы5   = 1;
	КолИсхСтрокИдГруппы6М1 = 1;
	КолИсхСтрокИдГруппы6М2 = 1;
	КолИсхСтрокИдГруппы6М3 = 1;
	КолИсхСтрокИдГруппы7   = 1;
	
	КолКолонокИдГруппы31  = 4;
	КолКолонокИдГруппы32  = 3;
	КолКолонокИдГруппы4М1 = 5;
	КолКолонокИдГруппы4М2 = 3;
	КолКолонокИдГруппы4М3 = 3;
	КолКолонокИдГруппы5   = 7;
	КолКолонокИдГруппы6М1 = 4;
	КолКолонокИдГруппы6М2 = 4;
	КолКолонокИдГруппы6М3 = 5;
	КолКолонокИдГруппы7   = 4;
	
	СтруктураДанныхТитульный     = Новый Структура;
	СтруктураДанныхРаздел1       = Новый Структура;
	СтруктураДанныхРаздел3       = Новый Структура;
	СтруктураДанныхРаздел3_Прил2 = Новый Структура;
	СтруктураДанныхРаздел4       = Новый Структура;
	СтруктураДанныхРаздел6       = Новый Структура;
	СтруктураДанныхРаздел7       = Новый Структура;
	
	ИнициализацияМногостраничныхРазделов();
	
	// структура многострочных разделов формы
	мСтруктураМногострочныхРазделов = Новый Структура;
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы31,  СтруктураРеквизитовФормы.мИдГруппы31);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы32,  СтруктураРеквизитовФормы.мИдГруппы32);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы4М1, СтруктураРеквизитовФормы.мИдГруппы4М1);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы4М2, СтруктураРеквизитовФормы.мИдГруппы4М2);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы4М3, СтруктураРеквизитовФормы.мИдГруппы4М3);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы5,   СтруктураРеквизитовФормы.мИдГруппы5);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы6М1, СтруктураРеквизитовФормы.мИдГруппы6М1);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы6М2, СтруктураРеквизитовФормы.мИдГруппы6М2);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы6М3, СтруктураРеквизитовФормы.мИдГруппы6М3);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы7,   СтруктураРеквизитовФормы.мИдГруппы7);
	
	// Структура содержит данные дополнительных страниц
	мСтруктураМногостраничныхРазделов = Новый Структура;
	мСтруктураМногостраничныхРазделов.Вставить("Раздел2",       "ТаблицаСтраницыРаздела2");
	мСтруктураМногостраничныхРазделов.Вставить("Раздел3_Прил1", "ТаблицаСтраницыРаздела3_Прил1");
	мСтруктураМногостраничныхРазделов.Вставить("Раздел5",       "ТаблицаСтраницыРаздела5");
	
	// структура исходных строк (минимального кол-ва) многострочных разделов формы
	мСтруктураИсхКолвоСтрокРазделов = Новый Структура;
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы31,  КолИсхСтрокИдГруппы31);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы32,  КолИсхСтрокИдГруппы32);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы4М1, КолИсхСтрокИдГруппы4М1);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы4М2, КолИсхСтрокИдГруппы4М2);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы4М3, КолИсхСтрокИдГруппы4М3);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы5,   КолИсхСтрокИдГруппы5);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы6М1, КолИсхСтрокИдГруппы6М1);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы6М2, КолИсхСтрокИдГруппы6М2);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы6М3, КолИсхСтрокИдГруппы6М3);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы7,   КолИсхСтрокИдГруппы7);
	
	мСтруктураКолвоКолонокРазделов = Новый Структура;
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы31,  КолКолонокИдГруппы31);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы32,  КолКолонокИдГруппы32);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы4М1, КолКолонокИдГруппы4М1);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы4М2, КолКолонокИдГруппы4М2);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы4М3, КолКолонокИдГруппы4М3);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы5,   КолКолонокИдГруппы5);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы6М1, КолКолонокИдГруппы6М1);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы6М2, КолКолонокИдГруппы6М2);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы6М3, КолКолонокИдГруппы6М3);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы7,   КолКолонокИдГруппы7);
	
	ЦветЗаполняетсяТолькоВручную     = Новый Цвет(255, 255, 225);
	ЦветЗаполняетсяАвтоКорректир     = Новый Цвет(255, 240, 200);
	ЦветЗаполняетсяАвтоБезКорректир  = Новый Цвет(230, 240, 220);
	СтруктураРеквизитовФормы.ЦветЗаполняетсяАвтоАрифметика = Новый Цвет(192, 220, 192); // ЗЕЛЕНЫЙ
	ЦветЗаполняетсяОднозначноВручную = Новый Цвет(255, 255, 192); // ЖЕЛТЫЙ
	ЦветЗаполняетсяАвтоматически     = Новый Цвет(255, 255, 255); // Белый, Ввод запрещен
	
	// структура цветов раскраски автозаполняемых ячеек
	мСтруктураЦветовРаскраски = Новый Структура;
	мСтруктураЦветовРаскраски.Вставить("_1", ЦветЗаполняетсяТолькоВручную);
	мСтруктураЦветовРаскраски.Вставить("_2", ЦветЗаполняетсяАвтоКорректир);
	мСтруктураЦветовРаскраски.Вставить("_3", ЦветЗаполняетсяАвтоБезКорректир);
	мСтруктураЦветовРаскраски.Вставить("_4", СтруктураРеквизитовФормы.ЦветЗаполняетсяАвтоАрифметика);
	мСтруктураЦветовРаскраски.Вставить("_0", ЦветЗаполняетсяОднозначноВручную);
	мСтруктураЦветовРаскраски.Вставить("_5", ЦветЗаполняетсяАвтоматически);
	
	мСтруктураВариантыЗаполнения       = Новый Структура;
	мСтруктураВариантыЗаполненияЭталон = Новый Структура;
	
	// Версия формы
	СтруктураРеквизитовФормы.мВерсияФормы = "01/01/2017";
	
	// Код отчета, равен КНД
	СтруктураРеквизитовФормы.мКодОтчета = "1151001";
	
	СтруктураРеквизитовФормы.мПечатныеформы = Новый СписокЗначений;
	СтруктураРеквизитовФормы.мПечатаемыеРазделы = Новый СписокЗначений;
	
	ИмяРаздела = "Титульный";
	
	ТабличныйДокумент.Вывести(ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяРаздела));
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	СтруктураРеквизитовФормы.мВыбраннаяФорма          = Параметры.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета  = Параметры.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета = Параметры.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мПериодичность           = Параметры.мПериодичность;
	СтруктураРеквизитовФормы.мСкопированаФорма        = Параметры.мСкопированаФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок          = Параметры.мСохраненныйДок;
	СтруктураРеквизитовФормы.Организация              = Параметры.Организация;
	СтруктураРеквизитовФормы.ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417 = Параметры.ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417;
	СтруктураРеквизитовФормы.СформироватьФормуОтчетаАвтоматически = Параметры.СформироватьФормуОтчетаАвтоматически;
	
	ДатаПодписи = ТекущаяДатаСеанса();
	
	ПорядкиОкругленияОтчетности = Новый Структура;
	ПорядкиОкругленияОтчетности.Вставить("ПеречислениеПорядкиОкругленияОтчетностиОкр1",       Перечисления.ПорядкиОкругленияОтчетности.Окр1);
	ПорядкиОкругленияОтчетности.Вставить("ПеречислениеПорядкиОкругленияОтчетностиОкр1000",    Перечисления.ПорядкиОкругленияОтчетности.Окр1000);
	ПорядкиОкругленияОтчетности.Вставить("ПеречислениеПорядкиОкругленияОтчетностиОкр1000000", Перечисления.ПорядкиОкругленияОтчетности.Окр1000000);
	
	СтруктураРеквизитовФормы.СправочникиВидыКонтактнойИнформацииФактАдресОрганизации = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
	
	//ПроверкаКонтрагентовБРО
	ПроверкаКонтрагентовБРО.ПриСозданииНаСервере(ЭтотОбъект);
	//Конец ПроверкаКонтрагентовБРО
	
	Инициализация(Параметры.БезОткрытияФормы);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("Организация");
	СтруктураРеквизитовФормы.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитовФормы.Вставить("ТочностьЕдиницыИзмерения");
	СтруктураРеквизитовФормы.Вставить("ВидДокумента");
	СтруктураРеквизитовФормы.Вставить("ДатаНачалаАвтозаполнения");
	СтруктураРеквизитовФормы.Вставить("ИП");
	СтруктураРеквизитовФормы.Вставить("мАвтоВыборКодов");
	СтруктураРеквизитовФормы.Вставить("мБезОткрытияФормы");
	СтруктураРеквизитовФормы.Вставить("мВариант");
	СтруктураРеквизитовФормы.Вставить("мВерсияФормы");
	СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДокументПредставителя");
	СтруктураРеквизитовФормы.Вставить("мЗаписываетсяНовыйДокумент");
	СтруктураРеквизитовФормы.Вставить("мЗаписьЗапрещена");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы31");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы32");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы4М1");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы4М2");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы4М3");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы5");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы6М1");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы6М2");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы6М3");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы7");
	СтруктураРеквизитовФормы.Вставить("мИмяПредставителя");
	СтруктураРеквизитовФормы.Вставить("мКодОтчета");
	СтруктураРеквизитовФормы.Вставить("мНазваниеПредставителя");
	СтруктураРеквизитовФормы.Вставить("мОписаниеТиповЧислоЕ");
	СтруктураРеквизитовФормы.Вставить("мОтчествоПредставителя");
	СтруктураРеквизитовФормы.Вставить("мПериодичность");
	СтруктураРеквизитовФормы.Вставить("мПечатаемыеРазделы");
	СтруктураРеквизитовФормы.Вставить("мПечатныеФормы");
	СтруктураРеквизитовФормы.Вставить("мПечатьБезШтрихкодаРазрешена");
	СтруктураРеквизитовФормы.Вставить("мПредставительФизЛицо");
	СтруктураРеквизитовФормы.Вставить("мРежимПечати");
	СтруктураРеквизитовФормы.Вставить("мСкопированаФорма");
	СтруктураРеквизитовФормы.Вставить("мСоставПоказателей");
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	СтруктураРеквизитовФормы.Вставить("мСтрокаФормата");
	СтруктураРеквизитовФормы.Вставить("мСчетчикСтраниц");
	СтруктураРеквизитовФормы.Вставить("мФамилияПредставителя");
	СтруктураРеквизитовФормы.Вставить("СправочникиВидыКонтактнойИнформацииФактАдресОрганизации");
	СтруктураРеквизитовФормы.Вставить("ФлажокОтклАвтоРасчет", Ложь);
	СтруктураРеквизитовФормы.Вставить("ЦветЗаполняетсяАвтоАрифметика");
	СтруктураРеквизитовФормы.Вставить("НаимОрганизации");
	СтруктураРеквизитовФормы.Вставить("СтрПериодОтчета");
	СтруктураРеквизитовФормы.Вставить("ВыводитьСтраницуВТаблДокНаСервере");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
	СтруктураРеквизитовФормы.Вставить("НомерТекущейСтраницы");
	СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов");
	СтруктураРеквизитовФормы.Вставить("ОтображатьКнопкуЗаполнить", Ложь);
	СтруктураРеквизитовФормы.Вставить("ОтображатьКнопкуРасшифровать", Ложь);
	СтруктураРеквизитовФормы.Вставить("ТекущаяСтрокаРазделовОтчета");
	СтруктураРеквизитовФормы.Вставить("ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417");
	СтруктураРеквизитовФормы.Вставить("ГруппаОрганизаций", Новый СписокЗначений);
	СтруктураРеквизитовФормы.Вставить("ТекстДляЗаголовочнойЧасти");
	СтруктураРеквизитовФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки");
	СтруктураРеквизитовФормы.Вставить("мСохранятьРасшифровку", Истина);
	СтруктураРеквизитовФормы.Вставить("АдресВременногоХранилищаРасшифровки");
	СтруктураРеквизитовФормы.Вставить("СформироватьФормуОтчетаАвтоматически");
	СтруктураРеквизитовФормы.Вставить("ИдентификаторЗадания");
	СтруктураРеквизитовФормы.Вставить("АдресВоВременномХранилище");
	СтруктураРеквизитовФормы.Вставить("ОтчетСтарогоОбразца", Ложь);
	СтруктураРеквизитовФормы.Вставить("ОтчетСформированОбработкойКонсолидацияОтчетностиПоНДС", Ложь);
	СтруктураРеквизитовФормы.Вставить("АдресХранилищаПроверкиВыгрузки", Неопределено);
	
	СтруктураРеквизитовФормы.Вставить("ВыполненоЗаполнениеРазделов", НовыйНаборПризнаковЗаполнения());
	СтруктураРеквизитовФормы.Вставить("УспешноеАвтозаполнение");
	СтруктураРеквизитовФормы.Вставить("АвтозаполнениеРазделовВТекущейСессии", НовыйНаборПризнаковАвтозаполнения());
	
	СтруктураРеквизитовФормы.Вставить("ПодключенДокументооборотСКонтролирующимОрганом", Ложь);
	
	СтруктураРеквизитовФормы.Вставить("СтатусОтчета", "Не отправлено");
	
	СтруктураРеквизитовФормы.Вставить("АвтоЗаполнениеРеглОтчетаДоступно", Истина);
	
	СтруктураРеквизитовФормы.Вставить("ОКВЭД",  "");
	СтруктураРеквизитовФормы.Вставить("ОКВЭД2", "");
	
КонецПроцедуры

&НаСервере
Функция НовыйНаборПризнаковЗаполнения()
	
	ПризнакиЗаполнения = Новый Структура;
	ПризнакиЗаполнения.Вставить("Раздел8", Ложь);
	ПризнакиЗаполнения.Вставить("Раздел8_Прил1", Ложь);
	ПризнакиЗаполнения.Вставить("Раздел9", Ложь);
	ПризнакиЗаполнения.Вставить("Раздел9_Прил1", Ложь);
	ПризнакиЗаполнения.Вставить("Раздел10", Ложь);
	ПризнакиЗаполнения.Вставить("Раздел11", Ложь);
	ПризнакиЗаполнения.Вставить("Раздел12", Ложь);
	
	Возврат ПризнакиЗаполнения;
	
КонецФункции

&НаСервере
Функция НовыйНаборПризнаковАвтозаполнения(ВыполнялосьАвтозаполнение = Ложь)
	
	Признаки = Новый Структура;
	Признаки.Вставить("Раздел8",       ВыполнялосьАвтозаполнение);
	Признаки.Вставить("Раздел8_Прил1", ВыполнялосьАвтозаполнение);
	Признаки.Вставить("Раздел9",       ВыполнялосьАвтозаполнение);
	Признаки.Вставить("Раздел9_Прил1", ВыполнялосьАвтозаполнение);
	Признаки.Вставить("Раздел10",      ВыполнялосьАвтозаполнение);
	Признаки.Вставить("Раздел11",      ВыполнялосьАвтозаполнение);
	Признаки.Вставить("Раздел12",      ВыполнялосьАвтозаполнение);
	
	Возврат Признаки;
	
КонецФункции

&НаСервере
Процедура ИнициализацияМногостраничныхРазделов()
	
	СтрПерваяСтраница = ЭтаФорма.ТаблицаСтраницыРаздела2.Добавить();
	СтрПерваяСтраница.Представление               = "Новая страница";
	СтрПерваяСтраница.АктивнаяСтраница            = Истина;
	СтрПерваяСтраница.АвтоматическоеПредставление = Истина;
	
	СтрПерваяСтраница = ЭтаФорма.ТаблицаСтраницыРаздела3_Прил1.Добавить();
	СтрПерваяСтраница.Представление               = "Новая страница";
	СтрПерваяСтраница.АктивнаяСтраница            = Истина;
	СтрПерваяСтраница.АвтоматическоеПредставление = Истина;
	
	СтрПерваяСтраница = ЭтаФорма.ТаблицаСтраницыРаздела5.Добавить();
	СтрПерваяСтраница.Представление               = "Новая страница";
	СтрПерваяСтраница.АктивнаяСтраница            = Истина;
	СтрПерваяСтраница.АвтоматическоеПредставление = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета()
	
	СтруктураЗависимыхЯчеекДляАвторасчета = Новый Структура;
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000100004003", "П000300020003;П000300021003;П000300011805;П000300001005;П000300002005;П000300003005;П000300004005;П000300004105;П000300004205;П000300005005;П000300006005;П000300007005;П000300008005;П000300010505;П000300010605;П000300010705;П000300010805;П000300010905;П000300011005;П000300011505;П000300001003;П000300002003;П000300003003;П000300004003;П000300004103;П000300004203;П000300006003;П000300010503;П000300010603;П000300010703;П000300010803;П000300019003;П000300012003;П000300013003;П000300014003;П000300015003;П000300016003;П000300017003;П000300018003;П000300018503;П000400012003;П000400013003;П0004М1003003;П0004М1004003;П0004М1005003;П0004М2008003;П000500008003;П000500009003;П000500005003;П000500007003;П000600016003;П000600017003;П000600005003;П0006М2010003;П0006М3013003;П000600006003;П0006М2009003;П0006М3015003;П0006М1003003;П0006М1004003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000100005003", "П000300020003;П000300021003;П000300011805;П000300001005;П000300002005;П000300003005;П000300004005;П000300004105;П000300004205;П000300005005;П000300006005;П000300007005;П000300008005;П000300010505;П000300010605;П000300010705;П000300010805;П000300010905;П000300011005;П000300011505;П000300001003;П000300002003;П000300003003;П000300004003;П000300004103;П000300004203;П000300006003;П000300010503;П000300010603;П000300010703;П000300010803;П000300019003;П000300012003;П000300013003;П000300014003;П000300015003;П000300016003;П000300017003;П000300018003;П000300018503;П000400012003;П000400013003;П0004М1003003;П0004М1004003;П0004М1005003;П0004М2008003;П000500008003;П000500009003;П000500005003;П000500007003;П000600016003;П000600017003;П000600005003;П0006М2010003;П0006М3013003;П000600006003;П0006М2009003;П0006М3015003;П0006М1003003;П0006М1004003");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000200006003", "П000200008003;П000200009003;П000200010003");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300001005", "П000300001003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300002005", "П000300002003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300003005", "П000300003003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300004005", "П000300004003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300004105", "П000300004103");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300004205", "П000300004203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300006005", "П000300006003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300010505", "П000300010503");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300010605", "П000300010603");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300010705", "П000300010703");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300010805", "П000300010803");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300011805", "П000300001005;П000300002005;П000300003005;П000300004005;П000300004105;П000300004205;П000300005005;П000300006005;П000300007005;П000300008005;П000300010505;П000300010605;П000300010705;П000300010805;П000300010905;П000300011005;П000300011505;П000300001003;П000300002003;П000300003003;П000300004003;П000300004103;П000300004203;П000300006003;П000300010503;П000300010603;П000300010703;П000300010803");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300019003", "П000300012003;П000300013003;П000300014003;П000300015003;П000300016003;П000300017003;П000300018003;П000300018503");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300020003", "П000300011805;П000300001005;П000300002005;П000300003005;П000300004005;П000300004105;П000300004205;П000300005005;П000300006005;П000300007005;П000300008005;П000300010505;П000300010605;П000300010705;П000300010805;П000300010905;П000300011005;П000300011505;П000300001003;П000300002003;П000300003003;П000300004003;П000300004103;П000300004203;П000300006003;П000300010503;П000300010603;П000300010703;П000300010803;П000300019003;П000300012003;П000300013003;П000300014003;П000300015003;П000300016003;П000300017003;П000300018003;П000300018503");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000300021003", "П000300011805;П000300001005;П000300002005;П000300003005;П000300004005;П000300004105;П000300004205;П000300005005;П000300006005;П000300007005;П000300008005;П000300010505;П000300010605;П000300010705;П000300010805;П000300010905;П000300011005;П000300011505;П000300001003;П000300002003;П000300003003;П000300004003;П000300004103;П000300004203;П000300006003;П000300010503;П000300010603;П000300010703;П000300010803;П000300019003;П000300012003;П000300013003;П000300014003;П000300015003;П000300016003;П000300017003;П000300018003;П000300018503");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000310007004", "П000310006001;П000310007003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000310008004", "П000310007004;П000310006001;П000310007003");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000320000202", "П000320000102");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000320000203", "П000320000103");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000400012003", "П0004М1003003;П0004М1004003;П0004М1005003;П0004М2008003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000400013003", "П0004М1003003;П0004М1004003;П0004М1005003;П0004М2008003");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000500008003", "П000500005003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000500009003", "П000500007003");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000600005003", "П0006М1003003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000600006003", "П0006М1004003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000600016003", "П000600005003;П0006М2010003;П0006М3013003;П000600006003;П0006М2009003;П0006М3015003;П0006М1003003;П0006М1004003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000600017003", "П000600005003;П0006М2010003;П0006М3013003;П000600006003;П0006М2009003;П0006М3015003;П0006М1003003;П0006М1004003");
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	Перем ИсходноеКоличествоСтрокГруппы;
	
	СтруктураРеквизитовФормы.мБезОткрытияФормы = БезОткрытияФормы;
	
	СтруктураРеквизитовФормы.Вставить("АктуальностьСведенийРаздел8", 0);
	СтруктураРеквизитовФормы.Вставить("АктуальностьСведенийРаздел8_Прил1", 0);
	СтруктураРеквизитовФормы.Вставить("АктуальностьСведенийРаздел9", 0);
	СтруктураРеквизитовФормы.Вставить("АктуальностьСведенийРаздел9_Прил1", 0);
	СтруктураРеквизитовФормы.Вставить("АктуальностьСведенийРаздел10", 0);
	СтруктураРеквизитовФормы.Вставить("АктуальностьСведенийРаздел11", 0);
	СтруктураРеквизитовФормы.Вставить("АктуальностьСведенийРаздел12", 0);
	
	ЗаполнитьНачальныеНастройки();
	
	ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета();
	
	ФормироватьСтруктуруСтраницОтчета();
	
	ФормироватьСтруктуруСвойствСтраниц();
	
	СформироватьДеревоРазделовОтчетаНаСервере();
	
	ТабличныйДокумент.Области.НомерКорректировки.Значение = 0;
	СтруктураРеквизитовФормы.ВидДокумента = 0;
	
	СтруктураРеквизитовФормы.мАвтоВыборКодов = Ложь;
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
	СтруктураРеквизитовФормы.ДатаНачалаАвтозаполнения = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	
	Если НЕ НачалоГода(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) = НачалоКвартала(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) Тогда
		Элементы.ФормаНастроитьПериодЗаполнения.Видимость = Ложь;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.ОтчетСформированОбработкойКонсолидацияОтчетностиПоНДС = РегламентированнаяОтчетностьВызовСервера.ОтчетСформированОбработкойКонсолидацияОтчетностиПоНДС(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		
		НачальныеОперацииСМногострочнымиБлоками();
			
		Если СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда // документ скопирован
			
			ВосстановитьСохраненныеДанные();
			
			СтруктураРеквизитовФормы.ДатаНачалаАвтозаполнения = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
			
		Иначе // новый документ
			
			Если НЕ СтруктураРеквизитовФормы.мБезОткрытияФормы Тогда
				// Для нового док-та установим возведенный флаг проверки соотношений.
				СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки = Ложь;
			КонецЕсли;
			
			СтруктураРеквизитовФормы.ЕдиницаИзмерения         = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 0;
			КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
			ЗаполнитьЗначенияПолейПоУмолчанию();
			
		КонецЕсли;
		
		ЗаполнитьДатуПодписи(ЭтаФорма);
		
		Модифицированность = Истина;
		
	Иначе
		
		ВосстановитьСохраненныеДанные();
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма) Тогда
			
			СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено;
			
			СтруктураРеквизитовФормы.ДатаНачалаАвтозаполнения = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
			
			СтруктураРеквизитовФормы.СтатусОтчета = "Не отправлено";
			
		КонецЕсли;
		
		Если НЕ БезОткрытияФормы
		   И НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
			
			ЗаблокироватьДанныеДляРедактирования(СтруктураРеквизитовФормы.мСохраненныйДок, , ЭтаФорма.УникальныйИдентификатор);
			
		КонецЕсли;
		
	КонецЕсли;
	
	РегламентированнаяОтчетность.ПолучитьСведенияОПоказателяхОтчета(ЭтаФорма);
	
	Если СтруктураРеквизитовФормы.ОтчетСформированОбработкойКонсолидацияОтчетностиПоНДС Тогда
		
		СтруктураРеквизитовФормы.ОтображатьКнопкуЗаполнить    = Ложь;
		СтруктураРеквизитовФормы.ОтображатьКнопкуРасшифровать = Ложь;
		
	КонецЕсли;
	
	Если НЕ СтруктураРеквизитовФормы.ОтображатьКнопкуЗаполнить Тогда
		Элементы.Заполнить.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ СтруктураРеквизитовФормы.ОтображатьКнопкуРасшифровать Тогда
		Элементы.Расшифровать.Видимость = Ложь;
		СтруктураРеквизитовФормы.мСохранятьРасшифровку = Ложь;
		Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Видимость = Ложь;
	КонецЕсли;
	
	ПоказатьПериод();
	
	СтруктураРеквизитовФормы.ИП = НЕ РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(СтруктураРеквизитовФормы.Организация);
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено
	 ИЛИ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма)
	 ИЛИ СтруктураРеквизитовФормы.СформироватьФормуОтчетаАвтоматически Тогда
	 
		ЗаполнитьСведенияОбОрганизацииНаСервере();
		
	Иначе
		
		РегламентированнаяОтчетность.ПолучитьЗначениеОКВЭД(ДатаПодписи, СтруктураРеквизитовФормы);
		
	КонецЕсли;
	
	Если НЕ БезОткрытияФормы Тогда
		СформироватьСпискиВыбора();
		РегламентированнаяОтчетностьКлиентСервер.ПоказатьКнопкиПечати(ЭтаФорма);
		УстановитьДоступностьОбластей(ЭтаФорма, "Титульный");
	КонецЕсли;
	
	СтруктураРеквизитовФормы.НаимОрганизации = СтруктураРеквизитовФормы.Организация.Наименование;
	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
	РегламентированнаяОтчетность.ДобавитьКнопкуПрисоединенныеФайлы(ЭтаФорма);
	
	РегламентированнаяОтчетностьКлиентСервер.ПриИнициализацииФормыРегламентированногоОтчета(ЭтаФорма);
	
	СтруктураРеквизитовФормы.ПодключенДокументооборотСКонтролирующимОрганом = ИнтерфейсыВзаимодействияБРО.ПодключенДокументооборотСКонтролирующимОрганом(СтруктураРеквизитовФормы.Организация);
	
	Если СтруктураРеквизитовФормы.ПодключенДокументооборотСКонтролирующимОрганом
		И СтруктураРеквизитовФормы.СтатусОтчета = "Сдано" Тогда
		Элементы.НаименованиеЭтапа.ЦветТекста = Новый Цвет(28, 85, 174);
		Элементы.НаименованиеЭтапа.Заголовок = СтруктураРеквизитовФормы.СтатусОтчета;
	ИначеЕсли НЕ СтруктураРеквизитовФормы.ПодключенДокументооборотСКонтролирующимОрганом Тогда
		Элементы.НаименованиеЭтапа.Гиперссылка = Истина;
		Элементы.НаименованиеЭтапа.ЦветТекста = Новый Цвет(28, 85, 174);
		Элементы.НаименованиеЭтапа.Заголовок = СтруктураРеквизитовФормы.СтатусОтчета;
	КонецЕсли;
	
	Если СтруктураРеквизитовФормы.СформироватьФормуОтчетаАвтоматически Тогда
		ЗначениеТаймера = ЗначениеТаймера();
		ЗаполнитьАвтоНаСервере();
		ЗаписатьЗамер(ЗначениеТаймера);
		Если Элементы.Расшифровать.Видимость Тогда
			Элементы.Расшифровать.Доступность = Истина;
			Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.АвтоЗаполнениеРеглОтчетаДоступно = АвтоЗаполнениеРеглОтчетаДоступно();
	
КонецПроцедуры

&НаСервере
Процедура НачальныеОперацииСМногострочнымиБлоками()
	Перем ИсходноеКоличествоСтрокГруппы;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		
		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
		
		Для НСтр = 1 По ИсходноеКоличествоСтрокГруппы Цикл
			
			СтруктураГруппы.Добавить();
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСпискиВыбора()
	
	МакетСоставаПоказателей = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет("Списки2017Кв1");
	
	КПП = СокрЛП(ТабличныйДокумент.Области["КПП1"].Значение);
	Если ЗначениеЗаполнено(КПП) Тогда
		Символы56КПП = Сред(КПП, 5, 2);
	Иначе
		Символы56КПП = "";
	КонецЕсли;
	
	КоллекцияСписковВыбора = Новый Соответствие;
	Для Каждого Область Из МакетСоставаПоказателей.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда
			ВерхОбласти = Область.Верх;
			НизОбласти = Область.Низ;
			ТаблСписка = Новый ТаблицаЗначений;
			ТаблСписка.Колонки.Добавить("Код",,, МакетСоставаПоказателей.Область(ВерхОбласти, 1, ВерхОбласти, 1).ШиринаКолонки);
			ТаблСписка.Колонки.Добавить("Название",,, МакетСоставаПоказателей.Область(ВерхОбласти, 2, ВерхОбласти, 2).ШиринаКолонки);
			ТаблСписка.Колонки.Добавить("РезультатПроверки",,, 0);
			Для НомСтр = ВерхОбласти По НизОбласти Цикл
				КодПоказателя = СокрП(МакетСоставаПоказателей.Область(НомСтр, 1).Текст);
				Если КодПоказателя <> "###" Тогда
					
					Если Область.Имя = "КодыПоМестуНахождения" Тогда
						
						Если СтруктураРеквизитовФормы.ИП Тогда
							
							Если НЕ (КодПоказателя = "" ИЛИ КодПоказателя = "116" ИЛИ КодПоказателя = "231") Тогда
								Продолжить;
							КонецЕсли;
							
						Иначе
							
							Если КодПоказателя = "116" Тогда
								Продолжить;
							ИначеЕсли ЗначениеЗаполнено(Символы56КПП) Тогда
								Если КодПоказателя = "213" Тогда
									Если НЕ (Символы56КПП = "50") Тогда
										Продолжить;
									КонецЕсли;
								ИначеЕсли КодПоказателя = "227" Тогда
									Если НЕ (Символы56КПП = "4T" ИЛИ Символы56КПП = "5G") Тогда
										Продолжить;
									КонецЕсли;
								ИначеЕсли КодПоказателя = "250" Тогда
									Если НЕ (Символы56КПП = "36" ИЛИ Символы56КПП = "76" ИЛИ Символы56КПП = "51") Тогда
										Продолжить;
									КонецЕсли;
								ИначеЕсли КодПоказателя = "214" ИЛИ КодПоказателя = "215" ИЛИ КодПоказателя = "216"
									ИЛИ КодПоказателя = "231" ИЛИ КодПоказателя = "331" Тогда
									Если Символы56КПП = "36" ИЛИ Символы56КПП = "76"
										ИЛИ Символы56КПП = "4T" ИЛИ Символы56КПП = "5G" Тогда
										Продолжить;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					НовСтрока = ТаблСписка.Добавить();
					НовСтрока.Код = КодПоказателя;
					НовСтрока.Название = СокрП(МакетСоставаПоказателей.Область(НомСтр, 2).Текст);
					НовСтрока.РезультатПроверки = СокрП(МакетСоставаПоказателей.Область(НомСтр, 3).Текст);
					
				КонецЕсли;
			КонецЦикла;
			КоллекцияСписковВыбора.Вставить(Область.Имя, ТаблСписка);
		КонецЕсли;
	КонецЦикла;
	
	СвойстваПоказателей.Очистить();
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "Период", 2, , "Выбор кода периода", КоллекцияСписковВыбора["КодыНалоговыхПериодов"]);
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "ПоМесту", 3, , "Выбор места представления", КоллекцияСписковВыбора["КодыПоМестуНахождения"]);
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "КодФормыРеорганизации", 1, , "Выбор кода формы реорганизации, ликвидации", КоллекцияСписковВыбора["КодыФормыРеорганизации"]);
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000500002003", 2, , "Выбор кода периода", КоллекцияСписковВыбора["КодыНалоговыхПериодов_Раздел5"]);
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000100001003", 11, "ОКТМО");
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000200005003", 11, "ОКТМО");
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000100002003", 20, , "Выбор КБК", КоллекцияСписковВыбора["КодыБюджетнойКлассификации_Раздел1"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000200004003", 20, , "Выбор КБК", КоллекцияСписковВыбора["КодыБюджетнойКлассификации_Раздел2"]);
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000200007003", 7, , "Выбор кода операции", КоллекцияСписковВыбора["КодыОпераций_Раздел2"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000310002001", 7, , "Выбор кода операции", КоллекцияСписковВыбора["КодыОпераций_Раздел3_Прил1"]);
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П0004М1001003", 7, , "Выбор кода операции", КоллекцияСписковВыбора["КодыОпераций_Раздел4"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П0004М2006003", 7, , "Выбор кода операции", КоллекцияСписковВыбора["КодыОпераций_Раздел4"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П0004М3009003", 7, , "Выбор кода операции", КоллекцияСписковВыбора["КодыОпераций_Раздел4"]);
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000500003003", 7, , "Выбор кода операции", КоллекцияСписковВыбора["КодыОпераций_Раздел5"]);
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П0006М1001003", 7, , "Выбор кода операции", КоллекцияСписковВыбора["КодыОпераций_Раздел6"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П0006М2007003", 7, , "Выбор кода операции", КоллекцияСписковВыбора["КодыОпераций_Раздел6"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П0006М3011003", 7, , "Выбор кода операции", КоллекцияСписковВыбора["КодыОпераций_Раздел6"]);
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000700000101", 7, , "Выбор кода операции", КоллекцияСписковВыбора["КодыОпераций_Раздел7"]);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальныеНастройки()
	
	МакетСоставаПоказателей = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(СтруктураРеквизитовФормы.мСоставПоказателей);
	
	ОписаниеТиповСтрока15  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(15));
	ОписаниеТиповСтрока50  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100));
	ОписаниеТиповЧисло1    = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1));
	
	МассивТиповТаблицаЗначений = Новый Массив; 
	МассивТиповТаблицаЗначений.Добавить(Тип("ТаблицаЗначений"));
	ОписаниеТиповТаблицаЗначений = Новый ОписаниеТипов(МассивТиповТаблицаЗначений);
	
	Для Инд = 0 По МакетСоставаПоказателей.Области.Количество() - 1 Цикл
		
		ТекОбласть    = МакетСоставаПоказателей.Области[Инд];
		ИмяСтраницы   = ТекОбласть.Имя;
		
		ЭтаФорма["ТаблицаВариантыЗаполнения" + ИмяСтраницы].Добавить();
		
		Для Ном = ТекОбласть.Верх По ТекОбласть.Низ Цикл
			
			КодПоказателя = СокрП(МакетСоставаПоказателей.Область(Ном, 1).Текст);
			ИмяПоказателя = КодПоказателя;
			
			Если КодПоказателя = "===" Тогда
				Прервать;
			КонецЕсли;
			
			Если КодПоказателя = "###" Тогда
				Прервать;
			КонецЕсли;
			
			Если Лев(КодПоказателя, 2) = "//" Тогда
				Продолжить;
			КонецЕсли;
			
			КодПоказателяПоФорме = СокрЛП(МакетСоставаПоказателей.Область(Ном, 2).Текст);
			ПризнМногострочность = СокрЛП(МакетСоставаПоказателей.Область(Ном, 3).Текст);
			ТипДанныхРеквизита   = СокрЛП(МакетСоставаПоказателей.Область(Ном, 4).Текст);
			стрКолСтрокИсходный  = СокрЛП(МакетСоставаПоказателей.Область(Ном, 5).Текст);
			стрВариантЗаполнения = РегламентированнаяОтчетность.ПолучитьВариантЗаполненияПоказателяРегОтчета(МакетСоставаПоказателей, Ном);
			КодПоказателяПоСтруктуре = СокрЛП(МакетСоставаПоказателей.Область(Ном, 9).Текст);
			
			чКолСтрокИсходный  = ? (ПустаяСтрока(стрКолСтрокИсходный),  0, Число(стрКолСтрокИсходный));
			чВариантЗаполнения = ? (ПустаяСтрока(стрВариантЗаполнения), 0, Число(стрВариантЗаполнения));
			
			НоваяСтрока = мТаблицаСоставПоказателей.Добавить();
			НоваяСтрока.ИмяПоляТаблДокумента   = ИмяСтраницы;
			НоваяСтрока.КодПоказателяПоСоставу = КодПоказателя;
			НоваяСтрока.КодПоказателяПоФорме   = КодПоказателяПоФорме;
			НоваяСтрока.ПризнМногострочности   = ПризнМногострочность;
			НоваяСтрока.ТипДанныхПоказателя    = ТипДанныхРеквизита;
			НоваяСтрока.КодПоказателяПоСтруктуре = КодПоказателяпоСтруктуре;
			
			Если чВариантЗаполнения <> 0
				ИЛИ ИмяСтраницы = "Раздел2" Тогда
				// Если в колонке 6 задан вариант заполнения показателя,
				// то его значение может определяться по данным ИБ.
				// Дополняем таблицу значений вариантов заполнения
				НоваяСтрока = ЭтаФорма["ТаблицаВариантыЗаполнения" + ИмяСтраницы][0].ТаблицаВариантовЗаполнения.Добавить();
				НоваяСтрока.КодПоказателя      = ? (Не ПустаяСтрока(КодПоказателяПоФорме), КодПоказателяПоФорме, КодПоказателя);
				НоваяСтрока.ВариантЗаполнения  = чВариантЗаполнения;
				НоваяСтрока.КодПоказателяПоСтруктуре  = КодПоказателяПоСтруктуре;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭтаФорма["ТаблицаВариантыЗаполнения" + ИмяСтраницы][0].ТаблицаВариантовЗаполнения.Количество() > 0 Тогда		
			
			мСтруктураВариантыЗаполнения.Вставить(ИмяСтраницы, ИмяСтраницы);
			мСтруктураВариантыЗаполненияЭталон.Вставить(ИмяСтраницы, ИмяСтраницы);
			
		Конецесли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСтраницОтчета()
	
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Титульный";
	СтрокаУровня1.Представление            = "Титульный лист";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел1";
	СтрокаУровня1.Представление            = "Раздел 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел2";
	СтрокаУровня1.Представление            = "Раздел 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел3";
	СтрокаУровня1.Представление            = "Раздел 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел3_Прил1";
	СтрокаУровня1.Представление            = "Раздел 3. Прил. 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел3_Прил2";
	СтрокаУровня1.Представление            = "Раздел 3. Прил. 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел4";
	СтрокаУровня1.Представление            = "Раздел 4";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел5";
	СтрокаУровня1.Представление            = "Раздел 5";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел6";
	СтрокаУровня1.Представление            = "Раздел 6";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел7";
	СтрокаУровня1.Представление            = "Раздел 7";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел8";
	СтрокаУровня1.Представление            = "Раздел 8";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел8_Прил1";
	СтрокаУровня1.Представление            = "Раздел 8. Прил. 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел9";
	СтрокаУровня1.Представление            = "Раздел 9";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел9_Прил1";
	СтрокаУровня1.Представление            = "Раздел 9. Прил. 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел10";
	СтрокаУровня1.Представление            = "Раздел 10";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел11";
	СтрокаУровня1.Представление            = "Раздел 11";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел12";
	СтрокаУровня1.Представление            = "Раздел 12";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСвойствСтраниц() Экспорт
	
	мСвойстваРазделовДекларации.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	
	СтрокаУровня1.ИмяСтраницы                          = "Титульный";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Ложь;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Истина;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел3_Прил1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы31;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел3_Прил2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы32;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел4";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы4М1;
	НовСтр.Область = "МногострочнаяЧасть4М1";
	НовСтр.ВысотаСтроки = 10;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы4М2;
	НовСтр.Область = "МногострочнаяЧасть4М2";
	НовСтр.ВысотаСтроки = 6;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы4М3;
	НовСтр.Область = "МногострочнаяЧасть4М3";
	НовСтр.ВысотаСтроки = 6;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел5";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы5;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 10;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел6";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;

	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы6М1;
	НовСтр.Область = "МногострочнаяЧасть6М1";
	НовСтр.ВысотаСтроки = 8;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы6М2;
	НовСтр.Область = "МногострочнаяЧасть6М2";
	НовСтр.ВысотаСтроки = 8;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы6М3;
	НовСтр.Область = "МногострочнаяЧасть6М3";
	НовСтр.ВысотаСтроки = 10;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел7";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы7;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел8";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел8_Прил1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел9";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел9_Прил1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел10";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел11";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел12";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоРазделовОтчетаНаСервере() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоРазделовОтчетаНаКлиенте() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДеревоРазделовОтчета(Форма)
	
	Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	
	Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
			
			ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
			ЭлементРазделовОтчета.КолонкаРазделыОтчета = ЭлементДереваСтраницОтчета.Представление;
			ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
			ЭлементРазделовОтчета.ИндексКартинки               = 1;
			ЭлементРазделовОтчета.РазделМногостраничный        = Ложь;
			ЭлементРазделовОтчета.РазделМногострочный          = Ложь;
			
			НайденноеЗначение = Неопределено;
			
			Если Форма["мСтруктураМногостраничныхРазделов"].Свойство(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, НайденноеЗначение) Тогда
				
				Если НЕ НайденноеЗначение = Неопределено Тогда
					
					НайденноеЗначение = Форма[НайденноеЗначение];
					
					ЭлементРазделовОтчета.ИндексКартинки        = 0;
					ЭлементРазделовОтчета.РазделМногостраничный = Истина;
					
					Для НомерСтраницы = 1 По НайденноеЗначение.Количество() Цикл
						СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
						СтраницаРазделаОтчета.КолонкаРазделыОтчета              = "Стр. " + НомерСтраницы;
						СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим;
						СтраницаРазделаОтчета.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
						СтраницаРазделаОтчета.ИндексКартинки                    = 1;
						СтраницаРазделаОтчета.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
						СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
					КонецЦикла;
					
				КонецЕсли;
				
			ИначеЕсли ЭтоРазделРегистраУчетаНДС(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Тогда
				СтраницыРаздела = Форма["Страницы" + ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим];
				
				Если СтраницыРаздела.Количество() > 0 Тогда
					ЭлементРазделовОтчета.ИндексКартинки        = 0;
					ЭлементРазделовОтчета.РазделМногостраничный = Истина;
					
					НомерСтраницы = 1;
					Для Каждого СтраницаРаздела Из СтраницыРаздела Цикл
						СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
						СтраницаРазделаОтчета.КолонкаРазделыОтчета              = СтраницаРаздела.Представление;
						СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим;
						СтраницаРазделаОтчета.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
						СтраницаРазделаОтчета.ИндексКартинки                    = 1;
						СтраницаРазделаОтчета.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
						СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
						НомерСтраницы = НомерСтраницы + 1;
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент) Экспорт
	
	Если Элемент.ТекущиеДанные = Неопределено
	 ИЛИ Элемент.ТекущаяСтрока = СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоЗаголовокРаздела = (Элемент.ТекущиеДанные.ПолучитьРодителя() = Неопределено);
	
	КМенюРО = Элементы.РазделыОтчета.КонтекстноеМеню;
	КМенюТД = Элементы.ТабличныйДокументКонтекстноеМеню;
	
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = Элемент.ТекущаяСтрока;
	
	ЭтоРазделРегистраУчетаНДС = ЭтоРазделРегистраУчетаНДС(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
	Элементы.ОчиститьТекущийРаздел.Видимость   = ЭтоРазделРегистраУчетаНДС;
	Элементы.ОчиститьТекущуюСтраницу.Видимость = НЕ ЭтоРазделРегистраУчетаНДС;
	
	ЭтоЦентральныйУзелМногостраничногоРаздела = ЭтоЗаголовокРаздела И Элемент.ТекущиеДанные.РазделМногостраничный;
	Элементы.ОчиститьТекущуюСтраницу.Доступность = НЕ ЭтоЦентральныйУзелМногостраничногоРаздела;
	
	Если СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере Тогда
		Если Элемент.ТекущиеДанные.РазделМногостраничный Тогда
			Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета
			= ?(Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета = Неопределено
			ИЛИ Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета = 0, 1, Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета);
		КонецЕсли;
		ВывестиМакетСтраницыВТабличныйДокументНаСервере(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим,
		Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета, ЭтоЗаголовокРаздела);
	Иначе
		СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Истина;
	КонецЕсли;
	
	ТабличныйДокумент.ФиксацияСверху = 0;
	
	Если Элемент.ТекущиеДанные.РазделМногостраничный И НЕ ЭтоРазделРегистраУчетаНДС Тогда
		Элемент.Развернуть(Элемент.ТекущаяСтрока);
		КМенюРО.Видимость = Истина;
		КМенюТД.Видимость = Ложь;
		Если НЕ Элемент.ТекущиеДанные.ПолучитьРодителя() = Неопределено
		   И Элемент.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы().Количество() > 1 Тогда
			Элементы.РазделыОтчета.КонтекстноеМеню.ПодчиненныеЭлементы.РазделыОтчетаКонтекстноеМенюКнопкаУдалитьСтраницу.Видимость = Истина;
			Элементы.РазделыОтчета.КонтекстноеМеню.ПодчиненныеЭлементы.РазделыОтчетаКонтекстноеМенюКнопкаДобавитьСтраницу.Видимость = Истина;
		Иначе
			Элементы.РазделыОтчета.КонтекстноеМеню.ПодчиненныеЭлементы.РазделыОтчетаКонтекстноеМенюКнопкаУдалитьСтраницу.Видимость = Ложь;
			Элементы.РазделыОтчета.КонтекстноеМеню.ПодчиненныеЭлементы.РазделыОтчетаКонтекстноеМенюКнопкаДобавитьСтраницу.Видимость = Истина;
		КонецЕсли;
	Иначе
		КМенюРО.Видимость = Ложь;
		КМенюРО.ПодчиненныеЭлементы.РазделыОтчетаКонтекстноеМенюКнопкаУдалитьСтраницу.Видимость = Ложь;
		КМенюРО.ПодчиненныеЭлементы.РазделыОтчетаКонтекстноеМенюКнопкаДобавитьСтраницу.Видимость = Ложь;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел7"
		ИЛИ Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел3_Прил2"
		ИЛИ Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел4"
		ИЛИ Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел5"
		ИЛИ Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел6" Тогда
		КМенюРО.Видимость = Ложь;
		КМенюТД.Видимость = Истина;
		КМенюТД.ПодчиненныеЭлементы.ТабличныйДокументКонтекстноеМенюГруппаСтроки.Видимость = Истина;
	Иначе
		КМенюРО.Видимость = Ложь;
		КМенюТД.Видимость = Ложь;
		КМенюТД.ПодчиненныеЭлементы.ТабличныйДокументКонтекстноеМенюГруппаСтроки.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.Обновить.Доступность = ?(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Титульный", Истина, Ложь);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела, НомерСтраницыРазделаОтчета, ЗаголовокРаздела = Ложь)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Истина);
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела, НомерСтраницыРазделаОтчета, ЗаголовокРаздела);
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяТекРаздела;
	СтруктураРеквизитовФормы.НомерТекущейСтраницы = НомерСтраницыРазделаОтчета;
	
	Если ИмяТекРаздела = "Раздел2" Тогда
		ИзменитьЦветЯчеекНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеРаздела(НаимРаздела, ОчищатьРазделЕслиЕстьМногострочность, ИзменятьАктивнуюСтраницу = Истина) Экспорт
	
	Если НаимРаздела = "Раздел8"
		ИЛИ НаимРаздела = "Раздел8_Прил1"
		ИЛИ НаимРаздела = "Раздел9"
		ИЛИ НаимРаздела = "Раздел9_Прил1"
		ИЛИ НаимРаздела = "Раздел10"
		ИЛИ НаимРаздела = "Раздел11"
		ИЛИ НаимРаздела = "Раздел12" Тогда
		
		// Сбор данных по разделу не требуется.
		
	// Многостраничные разделы.
	//
	ИначеЕсли НаимРаздела = "Раздел2"
		ИЛИ НаимРаздела = "Раздел3_Прил1" Тогда
		
		СтруктураДанных = Новый Структура;
		
		Для Каждого Область Из ТабличныйДокумент.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник
			   И Область.СодержитЗначение Тогда
				СтруктураДанных.Вставить(Область.Имя, Область.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		Если НаимРаздела = "Раздел2" Тогда
			НаимТаблицыСтраницы = "ТаблицаСтраницыРаздела2";
		ИначеЕсли НаимРаздела = "Раздел3_Прил1" Тогда
			НаимТаблицыСтраницы = "ТаблицаСтраницыРаздела3_Прил1";
		КонецЕсли;
		
		АктивнаяСтраница = ЭтаФорма[НаимТаблицыСтраницы].НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
		
		Если АктивнаяСтраница.Количество() > 0 Тогда
			
			АктивнаяСтраница = АктивнаяСтраница[0];
			
			АктивнаяСтраница.Данные.Очистить();
			АктивнаяСтраница.Данные.Добавить(СтруктураДанных);
			
			АктивнаяСтраница.АктивнаяСтраница = НЕ ИзменятьАктивнуюСтраницу;
			
		КонецЕсли;
		
	// Многостраничные и многострочные разделы.
	//
	ИначеЕсли НаимРаздела = "Раздел5" Тогда
		
		ТаблицаСтраницРаздела = Неопределено;
		мСтруктураМногостраничныхРазделов.Свойство(НаимРаздела, ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		СтрТаблицыСтраниц = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
		
		Если СтрТаблицыСтраниц.Количество() > 0 Тогда
			СтрТаблицаСтраницы = СтрТаблицыСтраниц[0];
			
			РегламентированнаяОтчетностьКлиентСервер.СохранитьДанныеМногостраничногоРазделаВактивнойСтранице(
			ЭтаФорма, НаимРаздела, ОчищатьРазделЕслиЕстьМногострочность);
			
			Для каждого СтрТаблица Из СтрТаблицыСтраниц Цикл
				СтрТаблица.АктивнаяСтраница = Ложь;
			КонецЦикла;
			
			СтрТаблицаСтраницы.АктивнаяСтраница = НЕ ИзменятьАктивнуюСтраницу;
		КонецЕсли;
		
	// Многострочные разделы.
	//
	ИначеЕсли НаимРаздела = "Раздел3_Прил2"
		ИЛИ НаимРаздела = "Раздел4"
		ИЛИ НаимРаздела = "Раздел6"
		ИЛИ НаимРаздела = "Раздел7" Тогда
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
		Если НаимРаздела = "Раздел4" Тогда
			
			ОбновитьСтруктуруМногострочногоРазделаНаСервере(СтруктураРеквизитовФормы.мИдГруппы4М1);
			ОбновитьСтруктуруМногострочногоРазделаНаСервере(СтруктураРеквизитовФормы.мИдГруппы4М2);
			ОбновитьСтруктуруМногострочногоРазделаНаСервере(СтруктураРеквизитовФормы.мИдГруппы4М3);
			
		ИначеЕсли НаимРаздела = "Раздел6" Тогда
			
			ОбновитьСтруктуруМногострочногоРазделаНаСервере(СтруктураРеквизитовФормы.мИдГруппы6М1);
			ОбновитьСтруктуруМногострочногоРазделаНаСервере(СтруктураРеквизитовФормы.мИдГруппы6М2);
			ОбновитьСтруктуруМногострочногоРазделаНаСервере(СтруктураРеквизитовФормы.мИдГруппы6М3);
			
		Иначе
			
			ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(НаимРаздела);
			ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы);
			
		КонецЕсли;
		
	// Обычные разделы.
	//
	Иначе
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела, НомерСтраницыРазделаОтчета, ЗаголовокРаздела = Ложь) Экспорт
	
	Если ИмяТекРаздела = "Раздел8"
	 ИЛИ ИмяТекРаздела = "Раздел8_Прил1"
	 ИЛИ ИмяТекРаздела = "Раздел9"
	 ИЛИ ИмяТекРаздела = "Раздел9_Прил1"
	 ИЛИ ИмяТекРаздела = "Раздел10"
	 ИЛИ ИмяТекРаздела = "Раздел11"
	 ИЛИ ИмяТекРаздела = "Раздел12" Тогда
		Элементы.СтраницыОтчета.ТекущаяСтраница = Элементы.СтраницаРегистраУчетаНДС;
		ВывестиРазделРегистраУчетаНДС(ИмяТекРаздела, НомерСтраницыРазделаОтчета);
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыОтчета.ТекущаяСтраница = Элементы.СтраницаОтчета;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(МакетПомощникаПоУчетуНДС);
	ТабличныйДокумент.Вывести(ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяТекРаздела));
	
	// Многостраничные разделы.
	//
	Если ИмяТекРаздела = "Раздел2"
	 ИЛИ ИмяТекРаздела = "Раздел3_Прил1" Тогда
		
		Если ИмяТекРаздела = "Раздел2" Тогда
			НаимТаблицыСтраницы = "ТаблицаСтраницыРаздела2";
		ИначеЕсли ИмяТекРаздела = "Раздел3_Прил1" Тогда
			НаимТаблицыСтраницы = "ТаблицаСтраницыРаздела3_Прил1";
		ИначеЕсли ИмяТекРаздела = "Раздел5" Тогда
			НаимТаблицыСтраницы = "ТаблицаСтраницыРаздела5";
		КонецЕсли;
		
		Для каждого ТаблицаСтраницы Из ЭтаФорма[НаимТаблицыСтраницы] Цикл
			Если ЭтаФорма[НаимТаблицыСтраницы].Количество() = 1 Или ЗаголовокРаздела Тогда
				Для Каждого Область Из ТабличныйДокумент.Области Цикл
					Если СтрЧислоВхождений(Область.Имя, "УдалитьСтраницу") > 0 Тогда
						Область.Текст = "";
						Область.Гиперссылка = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			ТаблицаСтраницы.АктивнаяСтраница = Ложь;
		КонецЦикла;
		
		ЭтаФорма[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].АктивнаяСтраница = Истина;
		
		СписокДанных = ЭтаФорма[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].Данные;
		СтруктураДанных = Новый Структура;
		
		Если СписокДанных.Количество() > 0 Тогда
			СтруктураДанных = СписокДанных[0].Значение;
		КонецЕсли;
		
		Для Каждого ЭлСтруктуры Из СтруктураДанных Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	// Многостраничные и многострочные разделы.
	//
	ИначеЕсли ИмяТекРаздела = "Раздел5" Тогда
		
		НаимТаблицыСтраницы = мСтруктураМногостраничныхРазделов[ИмяТекРаздела];
		
		СтруктураДанных = Новый Структура;
		
		СписокДанных = ЭтаФорма[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].Данные;
		
		Для Каждого ТаблицаСтраницы Из ЭтаФорма[НаимТаблицыСтраницы] Цикл
			
			Если ЭтаФорма[НаимТаблицыСтраницы].Количество() = 1 Или ЗаголовокРаздела Тогда
				Для Каждого Область Из ТабличныйДокумент.Области Цикл
					Если СтрЧислоВхождений(Область.Имя, "УдалитьСтраницу") > 0 Тогда
						Область.Текст = "";
						Область.Гиперссылка = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ТаблицаСтраницы.АктивнаяСтраница = Ложь;
			
		КонецЦикла;
		
		ЭтаФорма[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].АктивнаяСтраница = Истина;
		
		Если СписокДанных.Количество() > 0 Тогда
			СтруктураДанных = СписокДанных[0].Значение;
		КонецЕсли;
		
		Для Каждого ЭлСтруктуры Из СтруктураДанных Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		ТаблицаСтраницРаздела = Неопределено;
		мСтруктураМногостраничныхРазделов.Свойство(ИмяТекРаздела, ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		СтрСледующаяСтраница = ТаблицаСтраницРаздела[НомерСтраницыРазделаОтчета - 1];
		СтрСледующаяСтраница.АктивнаяСтраница = Истина;
		ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьВызовСервера.ПолучитьТаблицуВариантовЗаполненияНаСервере(ЭтаФорма, ИмяТекРаздела);
		КолМногострочныхЧастей = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(ЭтаФорма, ИмяТекРаздела, "МногострочностьВРазделе").Количество();
		
		Если КолМногострочныхЧастей > 0 Тогда
			НовДанныеДопСтрокРаздела = СтрСледующаяСтраница.ДанныеДопСтрок;
			Если (ТипЗнч(НовДанныеДопСтрокРаздела) = Тип("СписокЗначений"))
			   И (НовДанныеДопСтрокРаздела.Количество() > 0)
			   И (НовДанныеДопСтрокРаздела[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела") Тогда
				НовДанныеДопСтрокРаздела = НовДанныеДопСтрокРаздела[0].Значение;
			Иначе
				НовДанныеДопСтрокРаздела = Неопределено;
			КонецЕсли;
			// Способ хранения многострочных частей
			СохранятьМногострКакТЗ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(ЭтаФорма, ИмяТекРаздела, "СохранятьМногострКакТЗ");
		Иначе
			НовТаблицаДопСтрокРаздела = Неопределено; // Многострочности нет
			ИмяГруппыДопСтрок = Неопределено; // Имя группы строк неопределено
		КонецЕсли;
		
		Если НовДанныеДопСтрокРаздела <> Неопределено Тогда
			
			// В случае, если многострочных частей больше 1, то хранится структура, иначе, таблица значений с данными
			Если (КолМногострочныхЧастей > 0) И (НЕ СохранятьМногострКакТЗ) Тогда
				
				Для Каждого ГруппаСтрок Из НовДанныеДопСтрокРаздела Цикл
					ИмяГруппыДопСтрок = ГруппаСтрок.Ключ;
					ДанныеГруппыСтрок = ГруппаСтрок.Значение;
					
					ПромТаблицаГруппыСтрок = ЭтаФорма["Хранилище" + ИмяГруппыДопСтрок].Добавить().Таблица;
					
					КопироватьДанныеФормы(ДанныеГруппыСтрок, ПромТаблицаГруппыСтрок);
					
					// Заменяем таблицу значений с данными текущей страницы.
					КопироватьДанныеФормы(ПромТаблицаГруппыСтрок, ЭтаФорма[ИмяГруппыДопСтрок]);
					
					ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппыДопСтрок, ПромТаблицаГруппыСтрок);
					ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппыДопСтрок);
					
				КонецЦикла;
				
			ИначеЕсли (КолМногострочныхЧастей > 0) И (СохранятьМногострКакТЗ) Тогда
				
				ИмяГруппыДопСтрок = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекРаздела);
				
				ПромТаблицаДопСтрокРаздела = ЭтаФорма["Хранилище" + ИмяГруппыДопСтрок].Добавить().Таблица;
				
				КопироватьДанныеФормы(НовДанныеДопСтрокРаздела, ПромТаблицаДопСтрокРаздела);
				
				// Заменяем таблицу значений с данными текущей страницы.
				КопироватьДанныеФормы(ПромТаблицаДопСтрокРаздела, ЭтаФорма[ИмяГруппыДопСтрок]);
				
				// Выводим в табличный документ данные группы дополнительных строк и обновляем структуру многострочного раздела
				ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппыДопСтрок, ПромТаблицаДопСтрокРаздела);
				ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппыДопСтрок);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ИмяГруппыДопСтрок = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекРаздела);
		
		Если ТабличныйДокумент.Области.Найти("УдалитьСтроку" + ИмяГруппыДопСтрок + "3003_2") = Неопределено Тогда
			Обл = ТабличныйДокумент.Области.Найти("УдалитьСтроку" + ИмяГруппыДопСтрок + "3003_1");
			Если Обл <> Неопределено Тогда 
				Обл.Гиперссылка = Ложь;
				Обл.Текст = "";
			КонецЕсли;
		КонецЕсли;
		
	// Многострочные разделы.
	//
	ИначеЕсли ИмяТекРаздела = "Раздел3_Прил2"
		  ИЛИ ИмяТекРаздела = "Раздел4"
		  ИЛИ ИмяТекРаздела = "Раздел6"
		  ИЛИ ИмяТекРаздела = "Раздел7" Тогда
		
		СтруктураДанныхРаздела = ЭтаФорма["СтруктураДанных" + ИмяТекРаздела];
		
		Для Каждого ЭлСтруктуры Из СтруктураДанныхРаздела Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		ТекТабличноеПоле = ЭтаФорма.ТабличныйДокумент;
		
		Если ИмяТекРаздела = "Раздел4" Тогда
			
			СтруктураГруппы = ЭтаФорма[СтруктураРеквизитовФормы.мИдГруппы4М1];
			ВывестиРазделВТабличныйДокумент(ЭтаФорма, СтруктураРеквизитовФормы.мИдГруппы4М1, СтруктураГруппы);
			
			СтруктураГруппы = ЭтаФорма[СтруктураРеквизитовФормы.мИдГруппы4М2];
			ВывестиРазделВТабличныйДокумент(ЭтаФорма, СтруктураРеквизитовФормы.мИдГруппы4М2, СтруктураГруппы);
			
			СтруктураГруппы = ЭтаФорма[СтруктураРеквизитовФормы.мИдГруппы4М3];
			ВывестиРазделВТабличныйДокумент(ЭтаФорма, СтруктураРеквизитовФормы.мИдГруппы4М3, СтруктураГруппы);
			
		ИначеЕсли ИмяТекРаздела = "Раздел6" Тогда
			
			СтруктураГруппы = ЭтаФорма[СтруктураРеквизитовФормы.мИдГруппы6М1];
			ВывестиРазделВТабличныйДокумент(ЭтаФорма, СтруктураРеквизитовФормы.мИдГруппы6М1, СтруктураГруппы);
			
			СтруктураГруппы = ЭтаФорма[СтруктураРеквизитовФормы.мИдГруппы6М2];
			ВывестиРазделВТабличныйДокумент(ЭтаФорма, СтруктураРеквизитовФормы.мИдГруппы6М2, СтруктураГруппы);
			
			СтруктураГруппы = ЭтаФорма[СтруктураРеквизитовФормы.мИдГруппы6М3];
			ВывестиРазделВТабличныйДокумент(ЭтаФорма, СтруктураРеквизитовФормы.мИдГруппы6М3, СтруктураГруппы);
			
		Иначе
			
			ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекРаздела);
			
			СтруктураГруппы = Неопределено;
			
			мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
			
			СтруктураГруппы = ЭтаФорма[СтруктураГруппы];
			
			ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
			
		КонецЕсли;
		
		Если ИмяТекРаздела = "Раздел4" ИЛИ ИмяТекРаздела = "Раздел6" Тогда
			
			ИменаГруппРаздела = Новый Массив;
			
			Если ИмяТекРаздела = "Раздел4" Тогда
				
				ИменаГруппРаздела.Добавить(СтруктураРеквизитовФормы.мИдГруппы4М1);
				ИменаГруппРаздела.Добавить(СтруктураРеквизитовФормы.мИдГруппы4М2);
				ИменаГруппРаздела.Добавить(СтруктураРеквизитовФормы.мИдГруппы4М3);
				
			Иначе
				
				ИменаГруппРаздела.Добавить(СтруктураРеквизитовФормы.мИдГруппы6М1);
				ИменаГруппРаздела.Добавить(СтруктураРеквизитовФормы.мИдГруппы6М2);
				ИменаГруппРаздела.Добавить(СтруктураРеквизитовФормы.мИдГруппы6М3);
				
			КонецЕсли;
			
			Для каждого ИмяГруппы Из ИменаГруппРаздела Цикл
				
				ЕстьДопСтроки = Ложь;
				
				НачалоИмениПоказателя = Лев(ИмяГруппы, 8);
				
				Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
					Если СтрНачинаетсяС(ОбластьТД.Имя, НачалоИмениПоказателя) Тогда
						Если СтрНайти(ОбластьТД.Имя, "_2", , 14) > 0 Тогда
							ЕстьДопСтроки = Истина;
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Если ЕстьДопСтроки Тогда
					Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
						Если СтрНачинаетсяС(ОбластьТД.Имя, "УдалитьСтроку" + НачалоИмениПоказателя) Тогда
							ОбластьТД.Гиперссылка = Истина;
							ОбластьТД.Текст = "х";
						КонецЕсли;
					КонецЦикла;
				Иначе
					Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
						Если СтрНачинаетсяС(ОбластьТД.Имя, "УдалитьСтроку" + НачалоИмениПоказателя) Тогда
							ОбластьТД.Гиперссылка = Ложь;
							ОбластьТД.Текст = "";
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			ЕстьДопСтроки = Ложь;
			
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
					ЕстьДопСтроки = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьДопСтроки Тогда
				Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
					Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
						ОбластьТД.Гиперссылка = Истина;
						ОбластьТД.Текст = "х";
					КонецЕсли;
				КонецЦикла;
			Иначе
				Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
					Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
						ОбластьТД.Гиперссылка = Ложь;
						ОбластьТД.Текст = "";
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	// Обычные разделы.
	Иначе
		
		Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ИмяТекРаздела = "Титульный" Тогда
		
		УстановитьДоступностьОбластей(ЭтаФорма, "Титульный");
		
	Иначе
		
		УстановитьФорматВыводаВПоляхВводаНаСервере(ИмяТекРаздела);
		
		УстановитьЦветФонаЯчейкиНаСервере(,, ИмяТекРаздела);
		
		Если ИмяТекРаздела = "Раздел1" Тогда
			
			УстановитьДоступностьОбластей(ЭтаФорма, "Раздел1");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы31",  СтруктураРеквизитовФормы.мИдГруппы31);
	ИдГрупп.Вставить("мИдГруппы32",  СтруктураРеквизитовФормы.мИдГруппы32);
	ИдГрупп.Вставить("мИдГруппы4М1", СтруктураРеквизитовФормы.мИдГруппы4М1);
	ИдГрупп.Вставить("мИдГруппы4М2", СтруктураРеквизитовФормы.мИдГруппы4М2);
	ИдГрупп.Вставить("мИдГруппы4М3", СтруктураРеквизитовФормы.мИдГруппы4М3);
	ИдГрупп.Вставить("мИдГруппы5",   СтруктураРеквизитовФормы.мИдГруппы5);
	ИдГрупп.Вставить("мИдГруппы6М1", СтруктураРеквизитовФормы.мИдГруппы6М1);
	ИдГрупп.Вставить("мИдГруппы6М2", СтруктураРеквизитовФормы.мИдГруппы6М2);
	ИдГрупп.Вставить("мИдГруппы6М3", СтруктураРеквизитовФормы.мИдГруппы6М3);
	ИдГрупп.Вставить("мИдГруппы7",   СтруктураРеквизитовФормы.мИдГруппы7);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаСервере
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы31",  СтруктураРеквизитовФормы.мИдГруппы31);
	ИдГрупп.Вставить("мИдГруппы32",  СтруктураРеквизитовФормы.мИдГруппы32);
	ИдГрупп.Вставить("мИдГруппы4М1", СтруктураРеквизитовФормы.мИдГруппы4М1);
	ИдГрупп.Вставить("мИдГруппы4М2", СтруктураРеквизитовФормы.мИдГруппы4М2);
	ИдГрупп.Вставить("мИдГруппы4М3", СтруктураРеквизитовФормы.мИдГруппы4М3);
	ИдГрупп.Вставить("мИдГруппы5",   СтруктураРеквизитовФормы.мИдГруппы5);
	ИдГрупп.Вставить("мИдГруппы6М1", СтруктураРеквизитовФормы.мИдГруппы6М1);
	ИдГрупп.Вставить("мИдГруппы6М2", СтруктураРеквизитовФормы.мИдГруппы6М2);
	ИдГрупп.Вставить("мИдГруппы6М3", СтруктураРеквизитовФормы.мИдГруппы6М3);
	ИдГрупп.Вставить("мИдГруппы7",   СтруктураРеквизитовФормы.мИдГруппы7);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп) Экспорт
	
	Перем ТекТабличноеПоле;
	
	Если ИдГруппы = ИдГрупп.мИдГруппы31 Тогда
		
		ТекТабличноеПоле = "Раздел3_Прил1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы32 Тогда
		
		ТекТабличноеПоле = "Раздел3_Прил2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы4М1
		ИЛИ ИдГруппы = ИдГрупп.мИдГруппы4М2
		ИЛИ ИдГруппы = ИдГрупп.мИдГруппы4М3 Тогда
		
		ТекТабличноеПоле = "Раздел4";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы5 Тогда
		
		ТекТабличноеПоле = "Раздел5";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы6М1
		ИЛИ ИдГруппы = ИдГрупп.мИдГруппы6М2
		ИЛИ ИдГруппы = ИдГрупп.мИдГруппы6М3 Тогда
		
		ТекТабличноеПоле = "Раздел6";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы7 Тогда
		
		ТекТабличноеПоле = "Раздел7";
		
	КонецЕсли;
	
	Возврат ТекТабличноеПоле;
	
КонецФункции

&НаСервере
Процедура УстановитьФорматВыводаВПоляхВводаНаСервере(НаимРаздела)
	
	УстановитьФорматВыводаВПоляхВвода(ЭтаФорма, НаимРаздела);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФорматВыводаВПоляхВвода(Форма, НаимРаздела) Экспорт
	Перем СтруктураГруппы;
	
	Если Форма.СтруктураРеквизитовФормы.ЕдиницаИзмерения = Форма.ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1 Тогда
		Форма.СтруктураРеквизитовФормы.мСтрокаФормата = "; ЧДЦ = " + Форма.СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧС = 0";
	ИначеЕсли Форма.СтруктураРеквизитовФормы.ЕдиницаИзмерения = Форма.ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000 Тогда
		Форма.СтруктураРеквизитовФормы.мСтрокаФормата = "; ЧДЦ = " + Форма.СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧС = 3";
	ИначеЕсли Форма.СтруктураРеквизитовФормы.ЕдиницаИзмерения = Форма.ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000000 Тогда
		Форма.СтруктураРеквизитовФормы.мСтрокаФормата = "; ЧДЦ = " + Форма.СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧС = 6";
	КонецЕсли;
	
	Для Каждого СтрПоказатели Из Форма.мТаблицаСоставПоказателей Цикл
		
		Если НЕ НаимРаздела = СтрПоказатели.ИмяПоляТаблДокумента Тогда
			Продолжить;
		КонецЕсли;
		
		КодПоказателя            = СокрП(СтрПоказатели.КодПоказателяПоСоставу);
		ПризнМногострочность     = СокрП(СтрПоказатели.ПризнМногострочности);
		КодПоказателяПоСтруктуре = СокрП(СтрПоказатели.КодПоказателяПоСтруктуре);
		КодПоказателяПоФорме     = СокрП(СтрПоказатели.КодПоказателяПоФорме);
		ТипДанныхПоказателя      = СокрП(СтрПоказатели.ТипДанныхПоказателя);
		ИмяПоказателя            = ?(ПустаяСтрока(СтрПоказатели.КодПоказателяПоФорме), КодПоказателя, КодПоказателяПоФорме);
		
		Если ПустаяСтрока(КодПоказателя) ИЛИ КодПоказателя = "===" ИЛИ КодПоказателя = "###" ИЛИ Лев(КодПоказателя, 2) = "//" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипДанныхПоказателя = "Е" И ПустаяСтрока(КодПоказателяПоСтруктуре) Тогда
			ТекТабличноеПоле = Форма.ТабличныйДокумент;
			Если ПризнМногострочность <> "/" Тогда
				ФорматируемаяОбласть = ТекТабличноеПоле.Области[ИмяПоказателя];
				ДопустимыйЗнакПоказателя = ФорматируемаяОбласть.ТипЗначения.КвалификаторыЧисла.ДопустимыйЗнак;
				ЧислоЕЗнак = Форма.СтруктураРеквизитовФормы.мОписаниеТиповЧислоЕ;
				Если ДопустимыйЗнакПоказателя = ДопустимыйЗнак.Неотрицательный Тогда
					ЧислоЕЗнак = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(ЧислоЕЗнак.КвалификаторыЧисла.Разрядность,ЧислоЕЗнак.КвалификаторыЧисла.РазрядностьДробнойЧасти, ДопустимыйЗнакПоказателя));
				КонецЕсли;
				ФорматируемаяОбласть.ТипЗначения = ЧислоЕЗнак;
				ФорматируемаяОбласть.Формат = "ЧЦ = " + ЧислоЕЗнак.КвалификаторыЧисла.Разрядность + Форма.СтруктураРеквизитовФормы.мСтрокаФормата;
			Иначе
				// определяем кол-во строк многострочного раздела и применяем процедуру форматирования к данной графе по всем строкам
				НСтр = 1;
				Пока ТекТабличноеПоле.Области.Найти(ИмяПоказателя + "_" + Формат(НСтр, "ЧГ=0")) <> Неопределено Цикл
					ФорматируемаяОбласть = ТекТабличноеПоле.Области[ИмяПоказателя + "_" + Формат(НСтр, "ЧГ=0")];
					ДопустимыйЗнакПоказателя = ФорматируемаяОбласть.ТипЗначения.КвалификаторыЧисла.ДопустимыйЗнак;
					ЧислоЕЗнак = Форма.СтруктураРеквизитовФормы.мОписаниеТиповЧислоЕ;
					Если ДопустимыйЗнакПоказателя = ДопустимыйЗнак.Неотрицательный Тогда
						ЧислоЕЗнак = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(ЧислоЕЗнак.КвалификаторыЧисла.Разрядность,ЧислоЕЗнак.КвалификаторыЧисла.РазрядностьДробнойЧасти, ДопустимыйЗнакПоказателя));
					КонецЕсли;
					ФорматируемаяОбласть.ТипЗначения = ЧислоЕЗнак;
					ФорматируемаяОбласть.Формат = "ЧЦ = " + ЧислоЕЗнак.КвалификаторыЧисла.Разрядность + Форма.СтруктураРеквизитовФормы.мСтрокаФормата;
					НСтр = НСтр + 1;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если НаимРаздела = "Раздел3_Прил1" Тогда
			
			ТекТабличноеПоле = Форма.ТабличныйДокумент;
			НСтр = 1;
			Пока ТекТабличноеПоле.Области.Найти("П000310007001_" + Формат(НСтр, "ЧГ=0")) <> Неопределено Цикл
				ФорматируемаяОбласть1 = ТекТабличноеПоле.Область("П000310007002_" + Формат(НСтр, "ЧГ=0"));
				ФорматируемаяОбласть2 = ТекТабличноеПоле.Область("П000310007004_" + Формат(НСтр, "ЧГ=0"));
				ФорматОбласти1 = "";
				ФорматОбласти2 = ФорматируемаяОбласть2.Формат;
				Если ЗначениеЗаполнено(ТекТабличноеПоле.Область("П000310007001_" + Формат(НСтр, "ЧГ=0")).Значение) Тогда
					Если НЕ ЗначениеЗаполнено(ФорматируемаяОбласть1.Значение) Тогда
						ФорматОбласти1 = "ДП=-";
					КонецЕсли;
					ФорматОбласти2 = СтрЗаменить(ФорматОбласти2, "ЧН=-", "ЧН=0");
				Иначе
					ФорматОбласти2 = СтрЗаменить(ФорматОбласти2, "ЧН=0", "ЧН=-");
				КонецЕсли;
				ФорматируемаяОбласть1.Формат = ФорматОбласти1;
				ФорматируемаяОбласть2.Формат = ФорматОбласти2;
				НСтр = НСтр + 1;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДатуПодписи(Форма)
	
	Форма.ТабличныйДокумент.Области.ДатаПодписи.Значение = Форма.ДатаПодписи;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьПериод()
	
	ПолеТабличногоДокументаТитульный = ТабличныйДокумент;
	
	Если (НЕ ЗначениеЗаполнено(ПолеТабличногоДокументаТитульный.Области.Период.Значение)
		И СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено)
		ИЛИ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма) Тогда
		
		СоответствиеНомераМесяцаКодуОтчетногоПериода = Новый Соответствие;
		
		СоответствиеНомераМесяцаКодуОтчетногоПериода.Вставить(3,  "21");
		СоответствиеНомераМесяцаКодуОтчетногоПериода.Вставить(6,  "22");
		СоответствиеНомераМесяцаКодуОтчетногоПериода.Вставить(9,  "23");
		СоответствиеНомераМесяцаКодуОтчетногоПериода.Вставить(12, "24");
		
		// выводим признак периода на титульный лист
		КодОтчетногоПериода = СоответствиеНомераМесяцаКодуОтчетногоПериода[Месяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета)];
		ПолеТабличногоДокументаТитульный.Области.Период.Значение = КодОтчетногоПериода;
	КонецЕсли;
	
	// выводим год на титульный лист
	ОтчетныйГод = Формат(Год(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ЧГ=");
	ПолеТабличногоДокументаТитульный.Области.ОтчетГод.Значение = ОтчетныйГод;
	
	// задаем заголовок формы
	СтруктураРеквизитовФормы.СтрПериодОтчета = ПредставлениеПериода(НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета), КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦветФонаЯчейкиНаКлиенте(ИмяЯчейки = Неопределено, ВариантЗаполнения = Неопределено, ИмяТекущейСтраницыПанели = "") Экспорт
	
	УстановитьЦветФонаЯчейки(ЭтаФорма, ИмяЯчейки, ВариантЗаполнения, ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветФонаЯчейкиНаСервере(ИмяЯчейки = Неопределено, ВариантЗаполнения = Неопределено, ИмяТекущейСтраницыПанели = "") Экспорт
	
	УстановитьЦветФонаЯчейки(ЭтаФорма, ИмяЯчейки, ВариантЗаполнения, ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЦветФонаЯчейки(Форма, ИмяЯчейки = Неопределено, ВариантЗаполнения = Неопределено, ИмяТекущейСтраницыПанели = "") Экспорт
	
	Перем ЦветФона;
	Перем Комментарий;
	
	Если Форма.СтруктураРеквизитовФормы.мБезОткрытияФормы ИЛИ Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИмяЯчейки = Неопределено Тогда
		
		#Если НаКлиенте Тогда
			ИмяСтраницыПанели = РегламентированнаяОтчетностьКлиент.ОпределитьСтраницуПанелиПоКодуПоказателяНаКлиенте(Форма, ИмяЯчейки);
		#Иначе
			ИмяСтраницыПанели = РегламентированнаяОтчетностьВызовСервера.ОпределитьСтраницуПанелиПоКодуПоказателяНаСервере(Форма, ИмяЯчейки);
		#КонецЕсли
		Если ИмяСтраницыПанели = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ИмяПоляТаблДокумента = "ТабличныйДокумент";
		
		Ключ = "_" + ВариантЗаполнения;
		Форма.мСтруктураЦветовРаскраски.Свойство(Ключ, ЦветФона);
		
		ЗначениеВКвадратах = РегламентированнаяОтчетностьКлиентСервер.ОбластьЯвляетсяЯчейкойСоставногоПоля(Форма, ИмяЯчейки);
		
		Если ВариантЗаполнения = 4 ИЛИ ВариантЗаполнения = 5 Тогда
			
			Если ЗначениеВКвадратах Тогда
				РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяЯчейки, "УстановитьЗащиту");
			Иначе
				Форма[ИмяПоляТаблДокумента].Области[ИмяЯчейки].Защита = Истина;
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеВКвадратах Тогда
				РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяЯчейки, "СнятьЗащиту");
			Иначе
				Форма[ИмяПоляТаблДокумента].Области[ИмяЯчейки].Защита = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеВКвадратах Тогда
			РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяЯчейки, "ПроставитьЦветРаскраски", ЦветФона);
		Иначе
			Форма[ИмяПоляТаблДокумента].Области[ИмяЯчейки].ЦветФона = ЦветФона;
		КонецЕсли;
		
	Иначе
		
		#Если НаКлиенте Тогда
			ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьКлиент.ПолучитьТаблицуВариантовЗаполненияНаКлиенте(Форма, ИмяТекущейСтраницыПанели);
		#Иначе
			ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьВызовСервера.ПолучитьТаблицуВариантовЗаполненияНаСервере(Форма, ИмяТекущейСтраницыПанели);
		#КонецЕсли
		
		Если ТаблицаВариантыЗаполнения = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого Строка Из ТаблицаВариантыЗаполнения Цикл
			ИмяПоказателя            =  Строка.КодПоказателя;
			ВариантЗаполнения        =  Строка.ВариантЗаполнения;
			Комментарий              =  Строка.Комментарий;
			КодПоказателяПоСтруктуре =  Строка.КодПоказателяПоСтруктуре;
			
			КолвоСтрокВМногострочнойЧасти = РегламентированнаяОтчетностьКлиентСервер.ПоказательВходитВМногострочнуюЧасть(
			Форма, ИмяПоказателя);
			
			// Конвертация данных после перехода с 2.0 на 3.0.
			Если ИмяТекущейСтраницыПанели = "Раздел4" Тогда
				Если СтрНачинаетсяС(ИмяПоказателя, "П0004М1") Тогда
					КолвоСтрокВМногострочнойЧасти = Форма["П0004М100"].Количество();
				ИначеЕсли СтрНачинаетсяС(ИмяПоказателя, "П0004М2") Тогда
					КолвоСтрокВМногострочнойЧасти = Форма["П0004М200"].Количество();
				ИначеЕсли СтрНачинаетсяС(ИмяПоказателя, "П0004М3") Тогда
					КолвоСтрокВМногострочнойЧасти = Форма["П0004М300"].Количество();
				КонецЕсли;
			ИначеЕсли ИмяТекущейСтраницыПанели = "Раздел6" Тогда
				Если СтрНачинаетсяС(ИмяПоказателя, "П0006М1") Тогда
					КолвоСтрокВМногострочнойЧасти = Форма["П0006М100"].Количество();
				ИначеЕсли СтрНачинаетсяС(ИмяПоказателя, "П0006М2") Тогда
					КолвоСтрокВМногострочнойЧасти = Форма["П0006М200"].Количество();
				ИначеЕсли СтрНачинаетсяС(ИмяПоказателя, "П0006М3") Тогда
					КолвоСтрокВМногострочнойЧасти = Форма["П0006М300"].Количество();
				КонецЕсли;
			КонецЕсли;
			
			Если КолвоСтрокВМногострочнойЧасти > 0 Тогда
				Многострочность = Истина;
				БазоваяЧасть = ИмяПоказателя;
				ОписанияБлоков = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(
				Форма, ИмяТекущейСтраницыПанели, "МногострочностьВРазделе");
				
				Если ТипЗнч(ОписанияБлоков) = Тип("Число") Тогда
					ВБлокеВсеПоказателиЗаполняются = Истина;
				ИначеЕсли ТипЗнч(ОписанияБлоков) = Тип("ДанныеФормыКоллекция") Тогда
					ИмяГруппы = Сред(ИмяПоказателя, 1, 11);
					
					// Конвертация данных после перехода с 2.0 на 3.0.
					Если ИмяТекущейСтраницыПанели = "Раздел4" Тогда
						Если СтрНачинаетсяС(ИмяПоказателя, "П0004М1") Тогда
							ИмяГруппы = "П0004М100";
						ИначеЕсли СтрНачинаетсяС(ИмяПоказателя, "П0004М2") Тогда
							ИмяГруппы = "П0004М200";
						ИначеЕсли СтрНачинаетсяС(ИмяПоказателя, "П0004М3") Тогда
							ИмяГруппы = "П0004М300";
						КонецЕсли;
					ИначеЕсли ИмяТекущейСтраницыПанели = "Раздел6" Тогда
						Если СтрНачинаетсяС(ИмяПоказателя, "П0006М1") Тогда
							ИмяГруппы = "П0006М100";
						ИначеЕсли СтрНачинаетсяС(ИмяПоказателя, "П0006М2") Тогда
							ИмяГруппы = "П0006М200";
						ИначеЕсли СтрНачинаетсяС(ИмяПоказателя, "П0006М3") Тогда
							ИмяГруппы = "П0006М300";
						КонецЕсли;
					КонецЕсли;
					
					ВБлокеВсеПоказателиЗаполняются = НЕ ОписанияБлоков.НайтиСтроки(
					Новый Структура("ИдГруппы", ИмяГруппы))[0].НезаполняемыеПоказателиЕсть;
				КонецЕсли;
				
			Иначе
				Многострочность = Ложь;
				ВБлокеВсеПоказателиЗаполняются = Истина;
				КолвоСтрокВМногострочнойЧасти = 1;
			КонецЕсли;
			
			Для Инд = 1 по КолвоСтрокВМногострочнойЧасти Цикл
				
				Если Многострочность Тогда
					ИмяПоказателя = БазоваяЧасть + "_" + Формат(Инд, "ЧГ=0");
				КонецЕсли;
				
				ТекОбластьЯчеек = Форма.ТабличныйДокумент.Области[ИмяПоказателя];
				Если (Не ПустаяСтрока(Комментарий)) ИЛИ (Не ПустаяСтрока(ТекОбластьЯчеек.Примечание.Текст)) Тогда
					ТекОбластьЯчеек.Примечание.Текст = Комментарий;
				КонецЕсли;
				
				Ключ = "_" + ВариантЗаполнения;
				Форма.мСтруктураЦветовРаскраски.Свойство(Ключ, ЦветФона);
				
				ЗначениеВКвадратах = ?(ПустаяСтрока(КодПоказателяПоСтруктуре), Ложь, Истина);
				
				Если ВариантЗаполнения = 4 ИЛИ ВариантЗаполнения = 5 Тогда
					
					Если ЗначениеВКвадратах Тогда
						РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(
						Форма, ИмяПоказателя, "УстановитьЗащиту");
					Иначе
						Форма.ТабличныйДокумент.Области[ИмяПоказателя].Защита = Истина;
					КонецЕсли;
					
				Иначе
					
					Если ЗначениеВКвадратах Тогда
						РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(
						Форма, ИмяПоказателя, "СнятьЗащиту");
					Иначе
						Форма.ТабличныйДокумент.Области[ИмяПоказателя].Защита = Ложь;
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеВКвадратах Тогда
					РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(
					Форма, ИмяПоказателя, "ПроставитьЦветРаскраски", ЦветФона);
				Иначе
					Форма.ТабличныйДокумент.Области[ИмяПоказателя].ЦветФона = ЦветФона;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизации(Форма, ИзмененаДатаПодписи = Ложь)
	
	Если НЕ ИзмененаДатаПодписи Тогда
		
		СтрокаСведений = "ИННЮЛ, КППЮЛ, НаимЮЛПол, КодНО, НаимНО, ТипНП, ТелОрганизации, ФИО, ОКТМО";
		СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
		СтруктураРеквизитовФормы.Организация, ДатаПодписи, СтрокаСведений);
		
		ДополнитьСправа = 1;
		
		ТабличныйДокумент.Области["ИНН1"].Значение = СведенияОбОрганизации.ИННЮЛ;
		ТабличныйДокумент.Области["КПП1"].Значение = СведенияОбОрганизации.КППЮЛ;
		
		КодНО = СведенияОбОрганизации.КодНО;
		Для Инд = СтрДлина(СведенияОбОрганизации.КодНО) + 1 По 4 Цикл
			КодНО = " " + КодНО;
		КонецЦикла;
		
		ТабличныйДокумент.Области["КодИМНС"].Значение = КодНО;
		
		ПоМесту = "";
		Если СведенияОбОрганизации.ТипНП = 1 Тогда
			ПоМесту = "214";
			КПП = СокрЛП(СведенияОбОрганизации.КППЮЛ);
			Если ЗначениеЗаполнено(КПП) Тогда
				Символы56КПП = Сред(КПП, 5, 2);
			Иначе
				Символы56КПП = "";
			КонецЕсли;
			Если ЗначениеЗаполнено(Символы56КПП) Тогда
				Если Символы56КПП = "36" ИЛИ Символы56КПП = "76" Тогда
					ПоМесту = "250";
				ИначеЕсли Символы56КПП = "4T" ИЛИ Символы56КПП = "5G" Тогда
					ПоМесту = "227";
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СведенияОбОрганизации.ТипНП = 5 Тогда
			ПоМесту = "331";
		ИначеЕсли СведенияОбОрганизации.ТипНП = 3 Тогда
			ПоМесту = "116";
		КонецЕсли;
		
		ТабличныйДокумент.Области["ПоМесту"].Значение = ПоМесту;
		
		Если СтруктураРеквизитовФормы.ИП Тогда
			НаименованиеОрганизации = СокрЛП(СведенияОбОрганизации.ФИО);
		Иначе
			НаименованиеОрганизации = СокрЛП(СведенияОбОрганизации.НаимЮлПол);
		КонецЕсли;
		
		ТабличныйДокумент.Области.НаимОрг.Значение = НаименованиеОрганизации;
		
		ТабличныйДокумент.Области.ТелОрганизации.Значение = СокрЛП(СведенияОбОрганизации.ТелОрганизации);
		
		КодТерриториальногоОбразования = СведенияОбОрганизации.ОКТМО;
		ЗаполнитьОКТМО(ЭтаФорма, КодТерриториальногоОбразования);
		
	КонецЕсли;
	
	РегламентированнаяОтчетность.ПолучитьЗначениеОКВЭД(ДатаПодписи, СтруктураРеквизитовФормы);
	РегламентированнаяОтчетностьКлиентСервер.УстановитьЗначениеОКВЭД(
	ДатаПодписи, СтруктураРеквизитовФормы, ТабличныйДокумент.Области.ОКВЭД.Значение);
	
	ЗаполнитьСведенияОПодписантах();
	
	ЗаполнитьЗначенияПолейПоУмолчанию();
	
	СформироватьСпискиВыбора();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизацииНаСервере(ВПрограммеИзмененаДатаПодписи = Ложь)
	
	ЗаполнитьСведенияОбОрганизации(ЭтаФорма, ВПрограммеИзмененаДатаПодписи);
	ЗаполнитьЗначенияПолейПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОПодписантахИКодПоОКТМО(Ссылка)
	
	КодТерриториальногоОбразования = Ссылка.КодПоОКТМО;
	ЗаполнитьОКТМО(ЭтаФорма, КодТерриториальногоОбразования);
	
	ЗаполнитьСведенияОПодписантах();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОПодписантах() Экспорт
	
	ТипПодписанта = "1";
	Подписант = "";
	НаименованиеОрганизацииПредставителя = "";
	ДокументПредставителя = "";
	
	//выясним, есть ли представитель
	КодНО = СокрЛП(ТабличныйДокумент.Области.КодИМНС.Значение);
	КПП   = СокрЛП(ТабличныйДокумент.Области.КПП1.Значение);
	
	СведенияОПредставителе = РегламентированнаяОтчетностьВызовСервера.ПолучитьПоКодамСведенияОПредставителе(
	СтруктураРеквизитовФормы.Организация, КодНО, КПП);
	
	ТипПодписанта = СведенияОПредставителе.ТипПодписанта;
	
	Если ТипПодписанта = "1" Тогда
		//представителя нет
		Если РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(СтруктураРеквизитовФормы.Организация) Тогда
			//подписант - руководитель
			СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
			СтруктураРеквизитовФормы.Организация, ДатаПодписи, "ФИОРук, ФИО");
			Подписант = СокрЛП(?(ЗначениеЗаполнено(СведенияОбОрганизации.ФИОРук), СведенияОбОрганизации.ФИОРук, СведенияОбОрганизации.ФИО));
		КонецЕсли;
	Иначе
		//есть представитель, подписант - он
		Подписант = СведенияОПредставителе.ФИОПредставителя;
		НаименованиеОрганизацииПредставителя = СведенияОПредставителе.НаименованиеОрганизацииПредставителя;
		ДокументПредставителя = СведенияОПредставителе.ДокументПредставителя;
	КонецЕсли;
	
	ТабличныйДокумент.Области.ПрПодп.Значение = ТипПодписанта;
	ТабличныйДокумент.Области.ОргПодписант.Значение = Подписант;
	ТабличныйДокумент.Области.ОргУп.Значение = НаименованиеОрганизацииПредставителя;
	ТабличныйДокумент.Области.ДокУпПред.Значение = ДокументПредставителя;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция СобратьДанныеТекущегоТаблПоляНаСервере(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтаФорма, ИмяТабличногоПоля);

КонецФункции

&НаКлиенте
Функция СобратьДанныеТекущегоТаблПоляНаКлиенте(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтаФорма, ИмяТабличногоПоля);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СобратьДанныеТекущегоТаблПоля(Форма, ТабличноеПоле) Экспорт

	СтруктураДанныхПоля = Новый Структура;
	Для Каждого ТекущаяОбласть Из Форма[ТабличноеПоле].Области Цикл
		Если СтрЧислоВхождений(Тип(ТекущаяОбласть), "Рисунок") = 0
			И ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник
			И ТекущаяОбласть.СодержитЗначение = Истина Тогда
			СтруктураДанныхПоля.Вставить(ТекущаяОбласть.Имя, ТекущаяОбласть.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураДанныхПоля;

КонецФункции

&НаСервере
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы31",  СтруктураРеквизитовФормы.мИдГруппы31);
	ИдГрупп.Вставить("мИдГруппы32",  СтруктураРеквизитовФормы.мИдГруппы32);
	ИдГрупп.Вставить("мИдГруппы4М1", СтруктураРеквизитовФормы.мИдГруппы4М1);
	ИдГрупп.Вставить("мИдГруппы4М2", СтруктураРеквизитовФормы.мИдГруппы4М2);
	ИдГрупп.Вставить("мИдГруппы4М3", СтруктураРеквизитовФормы.мИдГруппы4М3);
	ИдГрупп.Вставить("мИдГруппы5",   СтруктураРеквизитовФормы.мИдГруппы5);
	ИдГрупп.Вставить("мИдГруппы6М1", СтруктураРеквизитовФормы.мИдГруппы6М1);
	ИдГрупп.Вставить("мИдГруппы6М2", СтруктураРеквизитовФормы.мИдГруппы6М2);
	ИдГрупп.Вставить("мИдГруппы6М3", СтруктураРеквизитовФормы.мИдГруппы6М3);
	ИдГрупп.Вставить("мИдГруппы7",   СтруктураРеквизитовФормы.мИдГруппы7);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ЭтаФорма, ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиенте
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы31",  СтруктураРеквизитовФормы.мИдГруппы31);
	ИдГрупп.Вставить("мИдГруппы32",  СтруктураРеквизитовФормы.мИдГруппы32);
	ИдГрупп.Вставить("мИдГруппы4М1", СтруктураРеквизитовФормы.мИдГруппы4М1);
	ИдГрупп.Вставить("мИдГруппы4М2", СтруктураРеквизитовФормы.мИдГруппы4М2);
	ИдГрупп.Вставить("мИдГруппы4М3", СтруктураРеквизитовФормы.мИдГруппы4М3);
	ИдГрупп.Вставить("мИдГруппы5",   СтруктураРеквизитовФормы.мИдГруппы5);
	ИдГрупп.Вставить("мИдГруппы6М1", СтруктураРеквизитовФормы.мИдГруппы6М1);
	ИдГрупп.Вставить("мИдГруппы6М2", СтруктураРеквизитовФормы.мИдГруппы6М2);
	ИдГрупп.Вставить("мИдГруппы6М3", СтруктураРеквизитовФормы.мИдГруппы6М3);
	ИдГрупп.Вставить("мИдГруппы7",   СтруктураРеквизитовФормы.мИдГруппы7);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ЭтаФорма, ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(Форма, ИмяЛиста = Неопределено, ТекущаяСтраница, ИдГрупп)
	Перем ИмяГруппы;
	
	Если ИмяЛиста = Неопределено Тогда
		ИмяТекущейСтраницыПанели = ТекущаяСтраница.Имя;
	Иначе
		ИмяТекущейСтраницыПанели = ИмяЛиста;
	КонецЕсли;
	
	Если ИмяТекущейСтраницыПанели = "Раздел3_Прил1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы31;
	ИначеЕсли ИмятекущейСтраницыПанели = "Раздел3_Прил2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы32;
	ИначеЕсли ИмятекущейСтраницыПанели = "Раздел4" Тогда
		ИмяГруппы = РазделТекущейОбласти(Форма, Форма.Элементы.ТабличныйДокумент.ТекущаяОбласть);
	ИначеЕсли ИмятекущейСтраницыПанели = "Раздел5" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы5;
	ИначеЕсли ИмятекущейСтраницыПанели = "Раздел6" Тогда
		ИмяГруппы = РазделТекущейОбласти(Форма, Форма.Элементы.ТабличныйДокумент.ТекущаяОбласть);
	ИначеЕсли ИмятекущейСтраницыПанели = "Раздел7" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы7;
	КонецЕсли;
	
	Возврат ИмяГруппы;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РазделТекущейОбласти(Форма, ТекущаяОбласть, ДлИмениОбласти = 13) Экспорт
	
	Если ТекущаяОбласть = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяТекущейОбласти = СтрЗаменить(ТекущаяОбласть.Имя, "ДобавитьСтрокуЗначок", "ДобавитьСтроку");
	Если ИмяТекущейОбласти = "ДобавитьСтроку32" Тогда
		Возврат Форма.СтруктураРеквизитовФормы.мИдГруппы32;
	ИначеЕсли ИмяТекущейОбласти = "ДобавитьСтроку4М1" Тогда
		Возврат Форма.СтруктураРеквизитовФормы.мИдГруппы4М1;
	ИначеЕсли ИмяТекущейОбласти = "ДобавитьСтроку4М2" Тогда
		Возврат Форма.СтруктураРеквизитовФормы.мИдГруппы4М2;
	ИначеЕсли ИмяТекущейОбласти = "ДобавитьСтроку4М3" Тогда
		Возврат Форма.СтруктураРеквизитовФормы.мИдГруппы4М3;
	ИначеЕсли ИмяТекущейОбласти = "ДобавитьСтроку5" Тогда
		Возврат Форма.СтруктураРеквизитовФормы.мИдГруппы5;
	ИначеЕсли ИмяТекущейОбласти = "ДобавитьСтроку6М1" Тогда
		Возврат Форма.СтруктураРеквизитовФормы.мИдГруппы6М1;
	ИначеЕсли ИмяТекущейОбласти = "ДобавитьСтроку6М2" Тогда
		Возврат Форма.СтруктураРеквизитовФормы.мИдГруппы6М2;
	ИначеЕсли ИмяТекущейОбласти = "ДобавитьСтроку6М3" Тогда
		Возврат Форма.СтруктураРеквизитовФормы.мИдГруппы6М3;
	ИначеЕсли ИмяТекущейОбласти = "ДобавитьСтроку7" Тогда
		Возврат Форма.СтруктураРеквизитовФормы.мИдГруппы7;
	ИначеЕсли СтрНайти(ИмяТекущейОбласти, "УдалитьСтроку") > 0 Тогда
		ИмяТекущейОбласти = СтрЗаменить(ИмяТекущейОбласти, "УдалитьСтроку", "");
	КонецЕсли;
	
	ИмяАктивногоРаздела = Лев(ИмяТекущейОбласти, ДлИмениОбласти);
	
	Для Каждого ЭлементСтруктуры Из Форма.мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = Форма[ЭлементСтруктуры.Значение];
		Если СтруктураГруппы[0].Свойство(ИмяАктивногоРаздела) Тогда
			Возврат ИмяГруппы;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы) Экспорт
	
	Перем СтруктураГруппы;
	
	Если СтрДлина(ИмяГруппы) = 9 Тогда
		
		мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
		
		СтруктураГруппы = ЭтаФорма[СтруктураГруппы];
		
		ТекТабличноеПолеИмя = "ТабличныйДокумент";
		
		ТекТабличноеПоле = ЭтаФорма[ТекТабличноеПолеИмя];
		
		Для НСтр = 1 По СтруктураГруппы.Количество() Цикл
			
			ТекСтрокаТаблицы = СтруктураГруппы[НСтр - 1];
			
			Для НомерГрафы = 1 По мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				
				Если ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы4М1 Тогда
					
					ИмяКолонки = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы4М2 Тогда
					
					ИмяКолонки = ИмяГруппы + Формат((НомерГрафы + 5) * 10, "ЧЦ=2; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы4М3 Тогда
					
					ИмяКолонки = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 8) * 10, "ЧЦ=3; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы6М1 Тогда
					
					ИмяКолонки = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы6М2 Тогда
					
					ИмяКолонки = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 6) * 10, "ЧЦ=3; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы6М3 Тогда
					
					ИмяКолонки = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 10) * 10, "ЧЦ=3; ЧВН=") + "03";
					
				Иначе
					
					ИмяКолонки = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
					
				КонецЕсли;
				
				Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
					
					ИмяЯчейки     = ИмяКолонки + "_" + НСтр;
					ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяЯчейки];
					
					Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
						ЗначениеЯчейки = ОбластьЯчейки.Значение;
					Иначе
						ЗначениеЯчейки = ОбластьЯчейки.Текст;
					КонецЕсли;
					
					ТекСтрокаТаблицы[ИмяКолонки] = ЗначениеЯчейки;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		
		РегламентированнаяОтчетностьКлиентСервер.ОбновитьСтруктуруМногострочногоРаздела(ЭтаФорма, ИмяГруппы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтруктуруМногострочногоРазделаНаКлиенте(ИмяГруппы) Экспорт
	
	Перем СтруктураГруппы;
	
	Если СтрДлина(ИмяГруппы) = 9 Тогда
		
		мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
		
		СтруктураГруппы = ЭтаФорма[СтруктураГруппы];
		
		ТекТабличноеПолеИмя = "ТабличныйДокумент";
		
		ТекТабличноеПоле = ЭтаФорма[ТекТабличноеПолеИмя];
		
		Для НСтр = 1 По СтруктураГруппы.Количество() Цикл
			
			ТекСтрокаТаблицы = СтруктураГруппы[НСтр - 1];
			
			Для НомерГрафы = 1 По мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				
				Если ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы4М1 Тогда
					
					ИмяКолонки = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы4М2 Тогда
					
					ИмяКолонки = ИмяГруппы + Формат((НомерГрафы + 5) * 10, "ЧЦ=2; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы4М3 Тогда
					
					ИмяКолонки = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 8) * 10, "ЧЦ=3; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы6М1 Тогда
					
					ИмяКолонки = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы6М2 Тогда
					
					ИмяКолонки = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 6) * 10, "ЧЦ=3; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы6М3 Тогда
					
					ИмяКолонки = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 10) * 10, "ЧЦ=3; ЧВН=") + "03";
					
				Иначе
					
					ИмяКолонки = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
					
				КонецЕсли;
				
				Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
					
					ИмяЯчейки     = ИмяКолонки + "_" + НСтр;
					ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяЯчейки];
					
					Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
						ЗначениеЯчейки = ОбластьЯчейки.Значение;
					Иначе
						ЗначениеЯчейки = ОбластьЯчейки.Текст;
					КонецЕсли;
					
					ТекСтрокаТаблицы[ИмяКолонки] = ЗначениеЯчейки;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		
		РегламентированнаяОтчетностьКлиентСервер.ОбновитьСтруктуруМногострочногоРаздела(ЭтаФорма, ИмяГруппы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ДанныеМногострочныхРазделов;
	Перем ДанныеМногостраничныхРазделов;
	Перем ДанныеВариановАвтоЗаполнения;
	Перем ПоказателиОтчета;
	Перем Автозаполнение;
	Перем ТаблицаМногостраничногоДокумента;
	Перем ТаблицаРасшифровки;
	Перем ВерсияФормы;
	Перем ВыполненоЗаполнениеРазделов;
	Перем УспешноеАвтозаполнение;
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.Организация) Тогда
		СтруктураРеквизитовФормы.Организация = СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
	КонецЕсли;
	
	ДатаПодписи                                       = СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи;
	СтруктураРеквизитовФормы.ЕдиницаИзмерения         = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	Комментарий                                       = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтатусОтчета                                      = СтруктураРеквизитовФормы.мСохраненныйДок.СтатусОтчета;
	
	Если ЗначениеЗаполнено(СтатусОтчета) Тогда
		СтруктураРеквизитовФормы.СтатусОтчета = СтатусОтчета;
	КонецЕсли;

	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	СтруктураРеквизитовФормы.ОтчетСтарогоОбразца = СписокСохранения.Свойство("ОкружениеСохранения");
	
	ВерсияФормыИзменилась = Ложь;
	Если СписокСохранения.Свойство("ВерсияФормы", ВерсияФормы) И (ВерсияФормы <> СтруктураРеквизитовФормы.мВерсияФормы) Тогда
		ВерсияФормыИзменилась = Истина;
	КонецЕсли;
	
	// список листов, выводимых на печать
	ДеревоНастройкиСтраниц = СтруктураРеквизитовФормы.мСохраненныйДок.ДеревоНастройкиСтраниц.Получить();
	
	// Установим актуальные представления разделов.
	Если НЕ ДеревоНастройкиСтраниц = Неопределено Тогда
		
		Для Каждого СтрокаДерева Из ДеревоНастройкиСтраниц.Строки Цикл
			Счетчик = ?(Счетчик = Неопределено, 0, Счетчик);
			ЭлементмДеревоСтраницОтчета = мДеревоСтраницОтчета.ПолучитьЭлементы().Получить(Счетчик);
			Если СтрокаДерева.ИмяСтраницы = ЭлементмДеревоСтраницОтчета.ИмяСтраницы Тогда
				Если НЕ СтрокаДерева.Представление = ЭлементмДеревоСтраницОтчета.Представление Тогда
					СтрокаДерева.Представление = ЭлементмДеревоСтраницОтчета.Представление;
				КонецЕсли;
			Иначе
				Продолжить;
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ДеревоНастройкиСтраниц.Скопировать(), "мДеревоСтраницОтчета");
		
	КонецЕсли;
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	
	// восстанавливаем сохраненные данные многострочных разделов
	Если СписокСохранения.Свойство( "ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
			
			НайденноеЗначение = Неопределено;
			мСтруктураМногострочныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
			
			Если НЕ НайденноеЗначение = Неопределено Тогда
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма[НайденноеЗначение]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// восстанавливаем сохраненные данные вариантов автозаполнения ячеек
	Если СписокСохранения.Свойство("ДанныеВариантовАвтоЗаполнения", ДанныеВариановАвтоЗаполнения) Тогда
		
		Если НЕ ДанныеВариановАвтоЗаполнения = Неопределено Тогда
			
			мСтруктураВариантыЗаполнения.Очистить();
			
			Для Каждого ЭлементСтруктуры Из ДанныеВариановАвтоЗаполнения Цикл
				
				мСтруктураВариантыЗаполнения.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Ключ);
				ЭтаФорма["ТаблицаВариантыЗаполнения" + ЭлементСтруктуры.Ключ].Очистить();
				
				Для Каждого ЭлементМассива Из ЭлементСтруктуры.Значение Цикл
					ТаблВарЗаполнения = ЭтаФорма["ТаблицаВариантыЗаполнения" + ЭлементСтруктуры.Ключ].Добавить().ТаблицаВариантовЗаполнения;
					ЗначениеВДанныеФормы(ЭлементМассива, ТаблВарЗаполнения);
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Данные многостраничных разделов.
	Если СписокСохранения.Свойство("ДанныеМногостраничныхРазделов", ДанныеМногостраничныхРазделов) Тогда
		Для Каждого ЭлементСтруктуры Из ДанныеМногостраничныхРазделов Цикл
			ИмяРаздела = ЭлементСтруктуры.Ключ;
			ТаблицаСДанными = ЭлементСтруктуры.Значение;
			ВосстановитьМногостраничныйРазделИзТаблицы(ИмяРаздела, ТаблицаСДанными);
		КонецЦикла;
	КонецЕсли;
	
	// Восстанавливаем дату начала и окончания автозаполнения.
	СписокСохранения.Свойство("ДатаНачалаАвтозаполнения", СтруктураРеквизитовФормы.ДатаНачалаАвтозаполнения);
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.ДатаНачалаАвтозаполнения) Тогда
		СтруктураРеквизитовФормы.ДатаНачалаАвтозаполнения = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	КонецЕсли;
	
	СписокСохранения.Свойство("ФлПодсчетСтраниц", СтруктураРеквизитовФормы.мСчетчикСтраниц);
	СписокСохранения.Свойство("ФлПроверятьСоотношенияПриПечатиИВыгрузки", СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки);
	СписокСохранения.Свойство("ФлОтклВыборЗначений", СтруктураРеквизитовФормы.мАвтоВыборКодов);
	СтруктураРеквизитовФормы.мАвтоВыборКодов = ?(СтруктураРеквизитовФормы.мАвтоВыборКодов = Неопределено, Ложь, СтруктураРеквизитовФормы.мАвтоВыборКодов);
	
	СписокСохранения.Свойство("ГруппаОрганизаций", СтруктураРеквизитовФормы.ГруппаОрганизаций);
	Если СтруктураРеквизитовФормы.ГруппаОрганизаций = Неопределено Тогда
		СтруктураРеквизитовФормы.ГруппаОрганизаций = Новый СписокЗначений;
	КонецЕсли;
	
	СписокСохранения.Свойство("Автозаполнение", Автозаполнение);
	СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет = Автозаполнение;
	
	СписокСохранения.Свойство("СохранятьРасшифровку", СтруктураРеквизитовФормы.мСохранятьРасшифровку);
	Если СтруктураРеквизитовФормы.мСохранятьРасшифровку = Неопределено Тогда
		СтруктураРеквизитовФормы.мСохранятьРасшифровку = Истина;
	КонецЕсли;
	
	СписокСохранения.Свойство("Расшифровка", ТаблицаРасшифровки);
	
	Если ТипЗнч(ТаблицаРасшифровки) = Тип("ТаблицаЗначений") Тогда
		
		Если ТаблицаРасшифровки.Колонки.Найти("НомСтроки") <> Неопределено Тогда
			
			ИмяПоказателя     = ТаблицаРасшифровки.Колонки.Найти("ИмяПоказателя");
			ИмяПоказателя.Имя = "НаименованиеПоказателя";
			
			ИмяЯчейки     = ТаблицаРасшифровки.Колонки.Найти("ИмяЯчейки");
			ИмяЯчейки.Имя = "ИмяПоказателя";
			
			Раздел     = ТаблицаРасшифровки.Колонки.Найти("Раздел");
			Раздел.Имя = "ИмяРаздела";
			
			ИмяСлагаемого     = ТаблицаРасшифровки.Колонки.Найти("ИмяСлагаемого");
			ИмяСлагаемого.Имя = "НаименованиеСлагаемого";
			
			ТаблицаРасшифровки.Колонки.Добавить("ДополнительныеПараметры");
			
			Для Каждого Элемент Из ТаблицаРасшифровки Цикл
				
				Если ЗначениеЗаполнено(Элемент.КодСчета) Тогда
					Элемент.НаименованиеСлагаемого = Элемент.НаименованиеСлагаемого + Элемент.КодСчета.Код;
				КонецЕсли;
				
				ДопПараметры = Новый Структура;
				
				Если ЗначениеЗаполнено(Элемент.Субконто1) Тогда
					ДопПараметры.Вставить("Субконто1", Новый Структура("ВидСубконто,ЗначениеСубконто", Элемент.КодСчета.ВидыСубконто[0].ВидСубконто, Элемент.Субконто1));
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Элемент.Субконто2) Тогда
					ДопПараметры.Вставить("Субконто2", Новый Структура("ВидСубконто,ЗначениеСубконто", Элемент.КодСчета.ВидыСубконто[1].ВидСубконто, Элемент.Субконто2));
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Элемент.Субконто3) Тогда
					ДопПараметры.Вставить("Субконто3", Новый Структура("ВидСубконто,ЗначениеСубконто", Элемент.КодСчета.ВидыСубконто[2].ВидСубконто, Элемент.Субконто3));
				КонецЕсли;
				
				Элемент.ДополнительныеПараметры = ДопПараметры;
				
			КонецЦикла;
			
			ТаблицаРасшифровки = ТаблицаРасшифровки.Скопировать(, "ИмяПоказателя, НаименованиеПоказателя, ЗнакОперации, НаименованиеСлагаемого, Сумма, ИмяРаздела, ДополнительныеПараметры");
			
		КонецЕсли;
		
		СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки = ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, УникальныйИдентификатор);
		Элементы.Расшифровать.Доступность = Истина;
		Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Доступность = Истина;
		
	КонецЕсли;
	
	Если НЕ СписокСохранения.Свойство("ПечатьБезШтрихкодаРазрешена", СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена) Тогда
		СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена = Ложь;
	КонецЕсли;
	
	ВосстановитьПризнакАктуальностиСведенийРаздела(СписокСохранения, "Раздел8");
	ВосстановитьПризнакАктуальностиСведенийРаздела(СписокСохранения, "Раздел8_Прил1");
	ВосстановитьПризнакАктуальностиСведенийРаздела(СписокСохранения, "Раздел9");
	ВосстановитьПризнакАктуальностиСведенийРаздела(СписокСохранения, "Раздел9_Прил1");
	ВосстановитьПризнакАктуальностиСведенийРаздела(СписокСохранения, "Раздел10");
	ВосстановитьПризнакАктуальностиСведенийРаздела(СписокСохранения, "Раздел11");
	ВосстановитьПризнакАктуальностиСведенийРаздела(СписокСохранения, "Раздел12");
	
	Если НЕ СписокСохранения.Свойство("ВыполненоЗаполнениеРазделов", ВыполненоЗаполнениеРазделов) Тогда
		УстановитьПризнакиЗаполненияПоДаннымРегистра();
	Иначе
		СтруктураРеквизитовФормы.ВыполненоЗаполнениеРазделов = ВыполненоЗаполнениеРазделов;
	КонецЕсли;
	
	СписокСохранения.Свойство("УспешноеАвтозаполнение", УспешноеАвтозаполнение);
	СтруктураРеквизитовФормы.УспешноеАвтозаполнение = УспешноеАвтозаполнение;
	
	ОтчетЗаполнялсяБезДеленияНаСекции = (СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Неопределено);
	
	Если ОтчетЗаполнялсяБезДеленияНаСекции Тогда
		ВосстановитьСведенияНДС("Раздел8");
		ВосстановитьСведенияНДС("Раздел8_Прил1");
		ВосстановитьСведенияНДС("Раздел9");
		ВосстановитьСведенияНДС("Раздел9_Прил1");
		ВосстановитьСведенияНДС("Раздел10");
		ВосстановитьСведенияНДС("Раздел11");
		ВосстановитьСведенияНДС("Раздел12");
	Иначе
		Если СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
			СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Неопределено;
		Иначе
			СформироватьСпискиСекций();
		КонецЕсли;
	КонецЕсли;
	
	СформироватьДеревоРазделовОтчетаНаСервере();
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		Если НЕ Раздел.МногостраничностьВРазделе
		   И Раздел.ИмяСтраницы <> "Раздел8"
		   И Раздел.ИмяСтраницы <> "Раздел8_Прил1"
		   И Раздел.ИмяСтраницы <> "Раздел9"
		   И Раздел.ИмяСтраницы <> "Раздел9_Прил1"
		   И Раздел.ИмяСтраницы <> "Раздел10"
		   И Раздел.ИмяСтраницы <> "Раздел11"
		   И Раздел.ИмяСтраницы <> "Раздел12" Тогда
			Если СтруктураРеквизитовФормы.ОтчетСтарогоОбразца Тогда
				// Конвертация данных после перехода с 2.0 на 3.0.
				ВосстановитьСтруктуруДанныхРазделаСтарогоОбразца(ПоказателиОтчета, Префикс + Раздел.ИмяСтраницы, Раздел.ИмяСтраницы);
			КонецЕсли;
			ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы] = ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы];
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьДатуПодписи(ЭтаФорма);
	
	ИмяТекРаздела = "Титульный";
	
	Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
		Если ТабличныйДокумент.Области.Найти(ЭлСтруктуры.Ключ) <> Неопределено Тогда
			Если ТабличныйДокумент.Области.Найти(ЭлСтруктуры.Ключ).Имя = "ДатаПодписи" Тогда
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ДатаПодписи;
			Иначе
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ВерсияФормыИзменилась Тогда
		ОбновитьПользовательскиеНастройки();
	КонецЕсли;
	
	РегламентированнаяОтчетность.ОперацииПриВосстановленииРегламентированногоОтчета(ЭтаФорма);
	
	КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма) Тогда
		
		ВосстановитьРезультатПроверкиВыгрузки();
		
	КонецЕсли;
	
	//ПроверкаКонтрагентовБРО
	ПроверкаКонтрагентовБРО.ВосстановитьРезультатыПроверкиПриСозданииНаСервере(ЭтотОбъект);
	//Конец ПроверкаКонтрагентовБРО
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСпискиСекций()
	
	СформироватьСписокСекцийРаздела("Раздел8");
	СформироватьСписокСекцийРаздела("Раздел8_Прил1");
	СформироватьСписокСекцийРаздела("Раздел9");
	СформироватьСписокСекцийРаздела("Раздел9_Прил1");
	СформироватьСписокСекцийРаздела("Раздел10");
	СформироватьСписокСекцийРаздела("Раздел11");
	СформироватьСписокСекцийРаздела("Раздел12");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокСекцийРаздела(ИмяРаздела)
	
	СписокСтраницРаздела = СписокСекцийРазделаИзРегистра(ИмяРаздела);
	ЗначениеВРеквизитФормы(СписокСтраницРаздела, "Страницы" + ИмяРаздела);
	
КонецПроцедуры

&НаСервере
Функция СписокСекцийРазделаИзРегистра(ИмяРаздела)
	
	Префикс = "Данные" + ИмяРаздела + ".";
	
	ЗапросПоДанным = Новый Запрос;
	ЗапросПоДанным.Текст = "ВЫБРАТЬ
	                       |	ДополнительныеФайлыРегламентированныхОтчетов.ВидДополнительногоФайла Как ВидДополнительногоФайла
	                       |ИЗ
	                       |	РегистрСведений.ДополнительныеФайлыРегламентированныхОтчетов КАК ДополнительныеФайлыРегламентированныхОтчетов
	                       |ГДЕ
	                       |	ДополнительныеФайлыРегламентированныхОтчетов.РегламентированныйОтчет = &РегламентированныйОтчет
	                       |	И ДополнительныеФайлыРегламентированныхОтчетов.ВидДополнительногоФайла ПОДОБНО &ШаблонОтбора";
	
	ЗапросПоДанным.УстановитьПараметр("ШаблонОтбора", Префикс + "%");
	ЗапросПоДанным.УстановитьПараметр("РегламентированныйОтчет", СтруктураРеквизитовФормы.мСохраненныйДок);
	
	СписокСтраницРаздела = РеквизитФормыВЗначение("Страницы" + ИмяРаздела);
	СписокСтраницРаздела.Очистить();
	
	ВыборкаСегментов = ЗапросПоДанным.Выполнить().Выбрать();
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	Пока ВыборкаСегментов.Следующий() Цикл
		НомерПервойСтрокиСегмента = Сред(ВыборкаСегментов.ВидДополнительногоФайла, СтрДлина(Префикс) + 1);
		НомерПервойСтрокиСегмента = ТипЧисло.ПривестиЗначение(НомерПервойСтрокиСегмента);
		
		Страница = СписокСтраницРаздела.Добавить();
		Страница.НомерПервойСтроки = НомерПервойСтрокиСегмента;
	КонецЦикла;
	
	СписокСтраницРаздела.Сортировать("НомерПервойСтроки");
	ВсегоСтраниц = СписокСтраницРаздела.Количество();
	
	Для Инд = 0 По ВсегоСтраниц - 2 Цикл
		СписокСтраницРаздела[Инд].НомерПоследнейСтроки = СписокСтраницРаздела[Инд + 1].НомерПервойСтроки - 1;
	КонецЦикла;
	
	Если ВсегоСтраниц > 0 Тогда
		НомерПервойСтрокиПоследнегоСегмента = СписокСтраницРаздела[ВсегоСтраниц-1].НомерПервойСтроки;
		ДанныеСегмента = РегламентированнаяОтчетность.СегментДанныхРазделаДекларацииНДС(СтруктураРеквизитовФормы.мСохраненныйДок, ИмяРаздела, НомерПервойСтрокиПоследнегоСегмента);
		ВсегоСтрокВСегменте = ДанныеСегмента.Количество();
		СписокСтраницРаздела[ВсегоСтраниц-1].НомерПоследнейСтроки = НомерПервойСтрокиПоследнегоСегмента - 1 + ВсегоСтрокВСегменте;
	КонецЕсли;
	
	Для Каждого Страница Из СписокСтраницРаздела Цикл
		НомерСтраницы = СписокСтраницРаздела.Индекс(Страница) + 1;
		Страница.Представление = "Часть " + СтрокаЧГ0(НомерСтраницы);
	КонецЦикла;
	
	Возврат СписокСтраницРаздела;
	
КонецФункции

&НаСервере
Процедура УстановитьПризнакиЗаполненияПоДаннымРегистра()
	
	СтруктураРеквизитовФормы.ВыполненоЗаполнениеРазделов = НовыйНаборПризнаковЗаполнения();
	
	УстановитьПризнакиЗаполненияРазделаПоДаннымРегистра("Раздел8");
	УстановитьПризнакиЗаполненияРазделаПоДаннымРегистра("Раздел8_Прил1");
	УстановитьПризнакиЗаполненияРазделаПоДаннымРегистра("Раздел9");
	УстановитьПризнакиЗаполненияРазделаПоДаннымРегистра("Раздел9_Прил1");
	УстановитьПризнакиЗаполненияРазделаПоДаннымРегистра("Раздел10");
	УстановитьПризнакиЗаполненияРазделаПоДаннымРегистра("Раздел11");
	УстановитьПризнакиЗаполненияРазделаПоДаннымРегистра("Раздел12");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакиЗаполненияРазделаПоДаннымРегистра(ИмяРаздела)
	
	ЗаписьРегистраСведений = РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов.СоздатьМенеджерЗаписи();
	ЗаписьРегистраСведений.РегламентированныйОтчет = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	ЗаписьРегистраСведений.ВидДополнительногоФайла = "Данные" + ИмяРаздела;
	
	ЗаписьРегистраСведений.Прочитать();
	
	Если ЗначениеЗаполнено(ЗаписьРегистраСведений.ВидДополнительногоФайла) Тогда
		СтруктураРеквизитовФормы.ВыполненоЗаполнениеРазделов.Вставить(ИмяРаздела, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьМногостраничныйРазделИзТаблицы(ИмяРаздела, ТаблицаСДанными)
	
	ИмяРеквизитаФормы = Неопределено;
	Если НЕ мСтруктураМногостраничныхРазделов.Свойство(ИмяРаздела, ИмяРеквизитаФормы) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитФормы = ЭтаФорма[ИмяРеквизитаФормы];
	ЗначениеВДанныеФормы(ТаблицаСДанными, РеквизитФормы);
	
	Если РеквизитФормы[0].Свойство("Данные") Тогда
		Для Каждого СтрокаТаблицы Из РеквизитФормы Цикл
			Если ТипЗнч(СтрокаТаблицы.Данные) = Тип("СписокЗначений") Тогда
				СтрокаТаблицы.Данные.Очистить();
				СтрокаТаблицы.Данные.Добавить(ТаблицаСДанными[РеквизитФормы.Индекс(СтрокаТаблицы)].Данные);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если РеквизитФормы[0].Свойство("ДанныеДопСтрок") Тогда
		Ном = 0;
		Для Каждого СтрокаТаблицы Из ТаблицаСДанными Цикл
			Если ТипЗнч(СтрокаТаблицы.ДанныеДопСтрок) = Тип("Структура") Тогда
				Для Каждого ЭлСтруктуры Из СтрокаТаблицы.ДанныеДопСтрок Цикл
					ТаблЗнач = ЭлСтруктуры.Значение;
					СтрокаТаблЗначДанныеДопСтрок = ЭтаФорма["Хранилище" + ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяРаздела)].Добавить().Таблица;
					ЗначениеВДанныеФормы(ТаблЗнач, СтрокаТаблЗначДанныеДопСтрок);
					РеквизитФормы[Ном].ДанныеДопСтрок.Добавить(СтрокаТаблЗначДанныеДопСтрок, "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела");
				КонецЦикла;
			ИначеЕсли ТипЗнч(СтрокаТаблицы.ДанныеДопСтрок) = Тип("ТаблицаЗначений") Тогда
				СтрокаТаблЗначДанныеДопСтрок = ЭтаФорма["Хранилище" + ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяРаздела)].Добавить().Таблица;
				ЗначениеВДанныеФормы(СтрокаТаблицы.ДанныеДопСтрок, СтрокаТаблЗначДанныеДопСтрок);
				РеквизитФормы[Ном].ДанныеДопСтрок.Добавить(СтрокаТаблЗначДанныеДопСтрок, "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела");
			КонецЕсли;
			Ном = Ном + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСтруктуруДанныхРазделаСтарогоОбразца(ПоказателиОтчета, ИмяСтруктурыДанных, ИмяРаздела)
	
	Если ИмяРаздела = "Титульный" Тогда
		
		Данные = ПоказателиОтчета[ИмяСтруктурыДанных];
		
		Для Каждого Показатель Из Данные Цикл
			
			ИмяПоказателя = Показатель.Ключ;
			
			Если ИмяПоказателя = "ИНН1_1" Тогда
				Данные.Вставить("ИНН1");
				Для Ном = 1 По 12 Цикл
					Данные.ИНН1 = СокрЛП(Данные.ИНН1) + Данные["ИНН1_" + Ном];
					Данные.Удалить("ИНН1_" + Ном);
				КонецЦикла;
				Если Лев(Данные.ИНН1, 2) = "00" Тогда
					Данные.ИНН1 = Сред(Данные.ИНН1, 3);
				КонецЕсли;
				Если Прав(Данные.ИНН1, 2) = "--" Тогда
					Данные.ИНН1 = Лев(Данные.ИНН1, СтрНайти(Данные.ИНН1, "--") - 1);
				КонецЕсли;
			ИначеЕсли ИмяПоказателя = "КПП1_1" Тогда
				Данные.Вставить("КПП1");
				Для Ном = 1 По 9 Цикл
					Данные.КПП1 = СокрЛП(Данные.КПП1) + Данные["КПП1_" + Ном];
					Данные.Удалить("КПП1_" + Ном);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаСервере
Процедура ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиРазделВТабличныйДокумент(Форма, ИмяГруппы, СтруктураГруппы)
	Перем ИсходноеКоличествоСтрокГруппы;
	
	#Если НаКлиенте Тогда
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИмяГруппы);
	#Иначе
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИмяГруппы);
	#КонецЕсли
	
	// определим исходное колво строк многострочного раздела,
	// соответствующее бумажной форме отчета
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	// реальное кол-во строк (колво заполненных строк)
	ТекущееКоличествоСтрокГруппы = СтруктураГруппы.Количество();
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	ПерерисоватьСтроки = (НЕ ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы);
	
	Раздел = Форма[ТекТабличноеПолеИмя];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// При восстановлении сохраненных данных отчета сравниваем исходное кол-во
	// отображаемых в форме строк многострочного раздела с реальным количеством
	// созданных строк в сохраненном отчете.
	Если ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы Тогда
		
		// При превышении реального кол-ва строк над исходным кол-вом (по шаблону),
		// автоматически добавляем необходимое колво строк.
		Форма.ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки);

		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	// выводим значения строк
	Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
		НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
		НомерСтрокиВФормеТаблицы = НомерСтрокиВТаблице + 1;
		НомерСтрокиВФормеТаблицыСтр = Формат(НомерСтрокиВФормеТаблицы, "ЧГ=0");
		
		Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
			
			Если СтрДлина(ИмяГруппы) = 9 Тогда
				
				Если ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М1 Тогда
					
					КолонкаТаблицыИмя = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М2 Тогда
					
					КолонкаТаблицыИмя = ИмяГруппы + Формат((НомерГрафы + 5) * 10, "ЧЦ=2; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М3 Тогда
					
					КолонкаТаблицыИмя = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 8) * 10, "ЧЦ=3; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М1 Тогда
					
					КолонкаТаблицыИмя = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М2 Тогда
					
					КолонкаТаблицыИмя = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 6) * 10, "ЧЦ=3; ЧВН=") + "03";
					
				ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М3 Тогда
					
					КолонкаТаблицыИмя = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 10) * 10, "ЧЦ=3; ЧВН=") + "03";
					
				Иначе
					
					КолонкаТаблицыИмя = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
					
				КонецЕсли;
				
			Иначе
				
				КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
			КонецЕсли;
				
			Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
				
				ЗначениеЯчейки = СтрокаТаблицы[КолонкаТаблицыИмя];
				ИмяЯчейки      = КолонкаТаблицыИмя + "_" + НомерСтрокиВФормеТаблицыСтр;
				
				ОбластьЯчейкиТаблицы = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейкиТаблицы.СодержитЗначение = Истина Тогда
					ОбластьЯчейкиТаблицы.Значение = ЗначениеЯчейки;
				Иначе
					ОбластьЯчейкиТаблицы.Текст = ЗначениеЯчейки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки) Экспорт
	
	ПостфиксВИмениОбластиМногострочнаяЧасть = "";
	Если ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы4М1 Тогда
		ПостфиксВИмениОбластиМногострочнаяЧасть = "4М1";
	ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы4М2 Тогда
		ПостфиксВИмениОбластиМногострочнаяЧасть = "4М2";
	ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы4М3 Тогда
		ПостфиксВИмениОбластиМногострочнаяЧасть = "4М3";
	ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы6М1 Тогда
		ПостфиксВИмениОбластиМногострочнаяЧасть = "6М1";
	ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы6М2 Тогда
		ПостфиксВИмениОбластиМногострочнаяЧасть = "6М2";
	ИначеЕсли ИмяГруппы = СтруктураРеквизитовФормы.мИдГруппы6М3 Тогда
		ПостфиксВИмениОбластиМногострочнаяЧасть = "6М3";
	КонецЕсли;
	
	ОбластьДопСтроки = ТекТабличноеПоле.ПолучитьОбласть("МногострочнаяЧасть" + ПостфиксВИмениОбластиМногострочнаяЧасть);
	
	КоординатыОбластей = Новый Структура();
	
	Для Каждого Область Из ТекТабличноеПоле.Области Цикл
		
		Если СтрНайти(Область.Имя, "_") Тогда
			
			КоординатыОбластей.Вставить(Область.Имя, Область.Верх);
			
		КонецЕсли;
		
	КонецЦикла;
	
	МногострочнаяЧастьВерх = ТекТабличноеПоле.Области["МногострочнаяЧасть" + ПостфиксВИмениОбластиМногострочнаяЧасть].Верх;
	
	МногострочнаяЧастьНиз = ТекТабличноеПоле.Области["МногострочнаяЧасть" + ПостфиксВИмениОбластиМногострочнаяЧасть].Низ;
	
	ТекТабличноеПоле.ВставитьОбласть(ОбластьДопСтроки.Область(), ТекТабличноеПоле.Область(МногострочнаяЧастьНиз + 1, , МногострочнаяЧастьНиз + (ТекущееКоличествоСтрокГруппы - 1) * ВысотаСтроки), ТипСмещенияТабличногоДокумента.ПоВертикали);
	
	Для НомНовойСтроки = ИсходноеКоличествоСтрокГруппы По ТекущееКоличествоСтрокГруппы Цикл
		
		Для Каждого Область Из ОбластьДопСтроки.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
				
				ОбластьТаблДок = ТекТабличноеПоле.Область(КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Лево, КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Право);
				
				Если ОбластьТаблДок.СодержитЗначение Тогда
					ОбластьТаблДок.Очистить();
				КонецЕсли;
				
				ОбластьТаблДок.Имя = Лев(Область.Имя, СтрНайти(Область.Имя, "_")) + Строка(ТекущееКоличествоСтрокГруппы - НомНовойСтроки + 1);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
	
	ТекТабличноеПоле.Область(ТекТабличноеПоле.Области["МногострочнаяЧасть" + ПостфиксВИмениОбластиМногострочнаяЧасть].Верх, ,
	ТекТабличноеПоле.Области["МногострочнаяЧасть" + ПостфиксВИмениОбластиМногострочнаяЧасть].Низ).Имя = "";
	
	ТекТабличноеПоле.Область(МногострочнаяЧастьВерх, , МногострочнаяЧастьНиз).Имя = "МногострочнаяЧасть" + ПостфиксВИмениОбластиМногострочнаяЧасть;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьПеременныеМодуляНаСервере(ИмяПоказателя, ЗначениеПоказателя) Экспорт
	
	ПеременныеМодуля = Новый Структура;
	ПеременныеМодуля.Вставить("мПредставительФизЛицо",  СтруктураРеквизитовФормы.мПредставительФизЛицо);
	ПеременныеМодуля.Вставить("мНазваниеПредставителя", СтруктураРеквизитовФормы.мНазваниеПредставителя);
	ПеременныеМодуля.Вставить("мДокументПредставителя", СтруктураРеквизитовФормы.мДокументПредставителя);
	ПеременныеМодуля.Вставить("мФамилияПредставителя",  СтруктураРеквизитовФормы.мФамилияПредставителя);
	ПеременныеМодуля.Вставить("мИмяПредставителя",      СтруктураРеквизитовФормы.мИмяПредставителя);
	ПеременныеМодуля.Вставить("мОтчествоПредставителя", СтруктураРеквизитовФормы.мОтчествоПредставителя);
	
	флОбновитьПеременныеМодуля = ОбновитьПеременныеМодуля(ИмяПоказателя, ЗначениеПоказателя, ПеременныеМодуля);
	
	СтруктураРеквизитовФормы.мПредставительФизЛицо  = ПеременныеМодуля.мПредставительФизЛицо;
	СтруктураРеквизитовФормы.мНазваниеПредставителя = ПеременныеМодуля.мНазваниеПредставителя;
	СтруктураРеквизитовФормы.мДокументПредставителя = ПеременныеМодуля.мДокументПредставителя;
	СтруктураРеквизитовФормы.мФамилияПредставителя  = ПеременныеМодуля.мФамилияПредставителя;
	СтруктураРеквизитовФормы.мИмяПредставителя      = ПеременныеМодуля.мИмяПредставителя;
	СтруктураРеквизитовФормы.мОтчествоПредставителя = ПеременныеМодуля.мОтчествоПредставителя;
	
	Возврат флОбновитьПеременныеМодуля;
	
КонецФункции

&НаКлиенте
Функция ОбновитьПеременныеМодуляНаКлиенте(ИмяПоказателя, ЗначениеПоказателя) Экспорт

	ПеременныеМодуля = Новый Структура;
	ПеременныеМодуля.Вставить("мПредставительФизЛицо",  СтруктураРеквизитовФормы.мПредставительФизЛицо);
	ПеременныеМодуля.Вставить("мНазваниеПредставителя", СтруктураРеквизитовФормы.мНазваниеПредставителя);
	ПеременныеМодуля.Вставить("мДокументПредставителя", СтруктураРеквизитовФормы.мДокументПредставителя);
	ПеременныеМодуля.Вставить("мФамилияПредставителя",  СтруктураРеквизитовФормы.мФамилияПредставителя);
	ПеременныеМодуля.Вставить("мИмяПредставителя",      СтруктураРеквизитовФормы.мИмяПредставителя);
	ПеременныеМодуля.Вставить("мОтчествоПредставителя", СтруктураРеквизитовФормы.мОтчествоПредставителя);
	
	флОбновитьПеременныеМодуля = ОбновитьПеременныеМодуля(ИмяПоказателя, ЗначениеПоказателя, ПеременныеМодуля);
	
	СтруктураРеквизитовФормы.мПредставительФизЛицо  = ПеременныеМодуля.мПредставительФизЛицо;
	СтруктураРеквизитовФормы.мНазваниеПредставителя = ПеременныеМодуля.мНазваниеПредставителя;
	СтруктураРеквизитовФормы.мДокументПредставителя = ПеременныеМодуля.мДокументПредставителя;
	СтруктураРеквизитовФормы.мФамилияПредставителя  = ПеременныеМодуля.мФамилияПредставителя;
	СтруктураРеквизитовФормы.мИмяПредставителя      = ПеременныеМодуля.мИмяПредставителя;
	СтруктураРеквизитовФормы.мОтчествоПредставителя = ПеременныеМодуля.мОтчествоПредставителя;
	
	Возврат флОбновитьПеременныеМодуля;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОбновитьПеременныеМодуля(ИмяПоказателя, ЗначениеПоказателя, ПеременныеМодуля)
	
	ИзмененияПроизошли = Ложь;
	
	Если Лев(ИмяПоказателя, 1) = "_" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ИмяПоказателя = "ПредставительФизЛицо" Тогда
		ПеременныеМодуля.мПредставительФизЛицо = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "НазваниеПредставителя" Тогда
		ПеременныеМодуля.мНазваниеПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ДокументПредставителя" Тогда
		ПеременныеМодуля.мДокументПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ФамилияПредставителя" Тогда
		ПеременныеМодуля.мФамилияПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ИмяПредставителя" Тогда
		ПеременныеМодуля.мИмяПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ОтчествоПредставителя" Тогда
		ПеременныеМодуля.мОтчествоПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	КонецЕсли;
	
	Возврат ИзмененияПроизошли;
	
КонецФункции

&НаКлиенте
Процедура СохранитьОтчет(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если (НЕ АвтоЗаполнениеРеглОтчетаДоступно()
		ИЛИ СтруктураРеквизитовФормы.СтатусОтчета = "Сдано") Тогда
		
		ПоказатьПредупреждение(, НСтр("ka='Декларация по НДС сдана. Запись запрещена."
"Для подготовки уточненной декларации создайте новый отчет.';ru='Декларация по НДС сдана. Запись запрещена."
"Для подготовки уточненной декларации создайте новый отчет.'"));
		Возврат;
		
	КонецЕсли;
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено, ИзмененСтатусОтчета = Ложь) Экспорт
	
	Если (НЕ АвтоЗаполнениеРеглОтчетаДоступно()
		ИЛИ СтруктураРеквизитовФормы.СтатусОтчета = "Сдано")
		И Модифицированность И НЕ ИзмененСтатусОтчета Тогда
		
		ПоказатьПредупреждение(, НСтр("ka='Декларация по НДС сдана. Запись запрещена."
"Для подготовки уточненной декларации создайте новый отчет.';ru='Декларация по НДС сдана. Запись запрещена."
"Для подготовки уточненной декларации создайте новый отчет.'"));
		Возврат;
		
	КонецЕсли;
	
	Если СтруктураДанныхТитульный.Количество() = 0
		ИЛИ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
		СтруктураДанныхТитульный.Вставить("КодИМНС", ТабличныйДокумент.Области.КодИМНС.Значение);
		СтруктураДанныхТитульный.Вставить("КПП1", ТабличныйДокумент.Области.КПП1.Значение);
		СтруктураДанныхТитульный.Вставить("НомерКорректировки", ТабличныйДокумент.Области.НомерКорректировки.Значение);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктураДанныхТитульный.НомерКорректировки) Тогда
		ЗначениеКорректировки = 0;
	Иначе
		ЗначениеКорректировки = Число(СтруктураДанныхТитульный.НомерКорректировки);
	КонецЕсли;
	Вариант = СтруктураРеквизитовФормы.ВидДокумента * ЗначениеКорректировки;
	
	КодИФНС = СтруктураДанныхТитульный.КодИМНС;
	КПП = СтруктураДанныхТитульный.КПП1;
	
	Если НЕ РегламентированнаяОтчетностьКлиент.ПриЗаписиРегламентированногоОтчетаНаКлиенте(ЭтаФорма, КодИФНС, Автосохранение, Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	ПодобныйОтчетСуществует = Ложь;
	ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки = Ложь;
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		НаименованиеТекущегоРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	Иначе
		НаименованиеТекущегоРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	КонецЕсли;
	
	РезультатСохранения = ПередСохранением(КодИФНС, КПП, ПодобныйОтчетСуществует, Вариант, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, Автосохранение, НаименованиеТекущегоРаздела);
	
	ВидДокументаНомерКорректировкиИзменен = Неопределено;
	
	Если ПодобныйОтчетСуществует И Автосохранение Тогда
		Возврат;
	КонецЕсли;
	
	НуженВопросПередСохранением = (ПодобныйОтчетСуществует ИЛИ ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки);
	
	Если НуженВопросПередСохранением Тогда
		
		СохранитьНаКлиентеСВопросом(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, ПодобныйОтчетСуществует, КодИФНС, КПП);
		
	Иначе
		
		ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиентеСВопросом(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, ПодобныйОтчетСуществует, КодИФНС, КПП)
	
	Если ПодобныйОтчетСуществует Тогда
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, "Сохранить");
		Кнопки.Добавить(КодВозвратаДиалога.Нет, "Отмена");
		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Отчет с видом %1 уже существует."
"Сохранить отчет с таким же видом?';ka='Отчет с видом %1 уже существует."
"Сохранить отчет с таким же видом?'"), ?(Вариант = 0, """Первичный""", """Корректирующий/" + Вариант + """"));
		ДополнительныеПараметры = Новый Структура("Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, КодИФНС, КПП", Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, КодИФНС, КПП);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросСохранитьОтчетСТакимЖеВидомЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , Кнопки.Получить(1).Значение);
		
	Иначе
		
		СохранитьНаКлиентеСВопросомПродолжение(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки,КодИФНС, КПП);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохранитьОтчетСТакимЖеВидомЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Автосохранение = ДополнительныеПараметры.Автосохранение;
	Вариант = ДополнительныеПараметры.Вариант;
	ВыполняемоеОповещение = ДополнительныеПараметры.ВыполняемоеОповещение;
	КодИФНС = ДополнительныеПараметры.КодИФНС;
	КПП = ДополнительныеПараметры.КПП;
	ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки = ДополнительныеПараметры.ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки;
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		СтруктураРеквизитовФормы.СтатусОтчета = "Не отправлено";
		
		Элементы.НаименованиеЭтапа.Заголовок = СтруктураРеквизитовФормы.СтатусОтчета;
		
		Возврат;
		
	КонецЕсли;
	
	СохранитьНаКлиентеСВопросомПродолжение(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки,КодИФНС, КПП);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиентеСВопросомПродолжение(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, КодИФНС, КПП)
	
	Если ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ВидОтчета", Вариант);
		
		ФормаВопроса = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("ВопросПриИзмененииВидаДокументаНомераКорректировки", ПараметрыФормы);
		ФормаВопроса.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ДополнительныеПараметры = Новый Структура("Автосохранение, Вариант, ВыполняемоеОповещение, КодИФНС, КПП", Автосохранение, Вариант, ВыполняемоеОповещение,КодИФНС, КПП );
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриИзмененииВидаДокументаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ФормаВопроса.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
		ФормаВопроса.Открыть();
	Иначе
		Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='ინახება %1...';ru='Сохраняется %1...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Записать);
		РезультатСохранения = Сохранить(Автосохранение, КодИФНС, КПП, Вариант, Неопределено, Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
		ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзмененииВидаДокументаЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	
	Автосохранение = ДополнительныеПараметры.Автосохранение;
	Вариант = ДополнительныеПараметры.Вариант;
	ВыполняемоеОповещение = ДополнительныеПараметры.ВыполняемоеОповещение;
	КодИФНС = ДополнительныеПараметры.КодИФНС;
	КПП = ДополнительныеПараметры.КПП;
	Если КодВозврата = КодВозвратаДиалога.Да
		ИЛИ КодВозврата = КодВозвратаДиалога.Нет Тогда
		ВидДокументаНомерКорректировкиИзменен = ?(КодВозврата = КодВозвратаДиалога.Да, Истина, Ложь);
	Иначе
		Возврат;
	КонецЕсли;
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='ინახება %1...';ru='Сохраняется %1...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Записать);
	РезультатСохранения = Сохранить(Автосохранение, КодИФНС, КПП, Вариант, ВидДокументаНомерКорректировкиИзменен, Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения)
	
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
	Если РезультатСохранения Тогда
		
		РегламентированнаяОтчетностьКлиент.ПослеЗаписиРегламентированногоОтчета(ЭтаФорма);
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПередСохранением(КодИФНС, КПП, ПодобныйОтчетСуществует, Вариант, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, Автосохранение, НаимТекРаздела)
	
	Если РегламентированнаяОтчетность.БылиИзмененыКлючевыеРеквизитыОтчета(ЭтаФорма, КодИФНС, КПП)
		И РегламентированнаяОтчетность.СуществуетДокументСАналогичнымиРеквизитами(ЭтаФорма, КодИФНС, КПП) Тогда
		
		ПодобныйОтчетСуществует = Истина;
		
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мЗаписываетсяНовыйДокумент = (СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено ИЛИ СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено);
	
	Если Вариант <> Неопределено И ((СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено) ИЛИ (СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено) ИЛИ (Вариант <> СтруктураРеквизитовФормы.мВариант)) Тогда
		
		Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено ИЛИ СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
			
		ИначеЕсли Вариант <> СтруктураРеквизитовФормы.мВариант Тогда
			
			ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПодобныйОтчетСуществует
		ИЛИ ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Сохранить(Автосохранение, КодИФНС, КПП, Вариант, , НаимТекРаздела);
	
КонецФункции

&НаСервере
Функция Сохранить(Автосохранение = Ложь, КодИФНС, КПП, Вариант, ВидДокументаНомерКорректировкиИзменен = Неопределено, НаимТекРаздела) Экспорт	
	
	ДанныеДляРазблокирования = Неопределено;
	
	Если НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		Если НЕ СтруктураРеквизитовФормы.мБезОткрытияФормы Тогда
			ДанныеДляРазблокирования = Новый Структура("Ключ,ИдФормы",
			СтруктураРеквизитовФормы.мСохраненныйДок, ЭтаФорма.УникальныйИдентификатор);
		КонецЕсли;
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект();
	КонецЕсли;
	
	Если НЕ РегламентированнаяОтчетность.ПриЗаписиРегламентированногоОтчетаНаСервере(ЭтаФорма, КодИФНС, Автосохранение, Вариант, ВидДокументаНомерКорректировкиИзменен, СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецЕсли;
	
	// установим текущие значения реквизитов документа
	СтруктураРеквизитовФормы.мСохраненныйДок.ИсточникОтчета           = Метаданные.Отчеты[Сред(Лев(СтрЗаменить(ЭтаФорма.ИмяФормы, "Внешний", ""), СтрНайти(СтрЗаменить(ЭтаФорма.ИмяФормы, "Внешний", ""), ".Форма.") - 1), 7)].Имя;
	СтруктураРеквизитовФормы.мСохраненныйДок.НаименованиеОтчета       = Метаданные.Отчеты[Сред(Лев(СтрЗаменить(ЭтаФорма.ИмяФормы, "Внешний", ""), СтрНайти(СтрЗаменить(ЭтаФорма.ИмяФормы, "Внешний", ""), ".Форма.") - 1), 7)].ОсновнаяФорма.Синоним;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаНачала               = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания            = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.Периодичность            = СтруктураРеквизитовФормы.мПериодичность;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма           = СтруктураРеквизитовФормы.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок.Организация              = СтруктураРеквизитовФормы.Организация;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи              = ДатаПодписи;
	СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения         = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВидОтчетности            = Перечисления.ВидыОтчетности.РегламентированнаяОтчетность;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	СтруктураРеквизитовФормы.мСохраненныйДок.КодНалоговогоОргана      = КодИФНС;
	СтруктураРеквизитовФормы.мСохраненныйДок.КПП                      = КПП;
	СтруктураРеквизитовФормы.мСохраненныйДок.Вид                      = Вариант;
	СтруктураРеквизитовФормы.мСохраненныйДок.ПредставлениеВида        = РегламентированнаяОтчетность.ПредставлениеВидаДокумента(СтруктураРеквизитовФормы.мСохраненныйДок.Вид);
	СтруктураРеквизитовФормы.мВариант                                 = Вариант;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи              = ДатаПодписи;
	СтруктураРеквизитовФормы.мСохраненныйДок.СтатусОтчета             = СтруктураРеквизитовФормы.СтатусОтчета;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ФорматВыгрузки = "Автоматически";
	
	СохранитьДанныеРаздела(НаимТекРаздела, Ложь, Ложь);
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	// формируем данные редактируемых ячеек таблицы
	ПоказателиОтчета = Новый Структура();
	
	ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета);
	
	// формируем список сохранения
	СписокСохранения = Новый Структура();

	// вставляем данные редактируемых ячеек таблицы	
	СписокСохранения.Вставить("ПоказателиОтчета", ПоказателиОтчета);

	ДанныеМногострочныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		
		ДанныеМногострочныхРазделов.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
	КонецЦикла;
	
	СписокСохранения.Вставить("ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов);
	
	ДанныеМногостраничныхРазделов = Новый Структура;
	
	МассивТиповНеопределено = Новый Массив; 
	МассивТиповНеопределено.Добавить(Тип("Неопределено"));
	ОписаниеТиповНеопределено = Новый ОписаниеТипов(МассивТиповНеопределено);
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногостраничныхРазделов Цикл
		ИмяРаздела = ЭлементСтруктуры.Ключ;
		ИмяСтруктурыДанных = ЭлементСтруктуры.Значение;
		ДанныеВТаблицеЗначений = СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных);
		Если ДанныеВТаблицеЗначений <> Неопределено Тогда
			ДанныеМногостраничныхРазделов.Вставить(ИмяРаздела, ДанныеВТаблицеЗначений);
		КонецЕсли;
	КонецЦикла;
	
	СписокСохранения.Вставить("ДанныеМногостраничныхРазделов", ДанныеМногостраничныхРазделов);
	
	ДанныеВариантовАвтоЗаполнения = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураВариантыЗаполнения Цикл
		
		МассивТаблЗнач = Новый Массив;
		
		ДанныеВариантовАвтоЗаполнения.Вставить(ЭлементСтруктуры.Ключ, МассивТаблЗнач);
			
		Для Каждого ЭлементМассива Из ЭтаФорма["ТаблицаВариантыЗаполнения" + ЭлементСтруктуры.Ключ] Цикл
			
			МассивТаблЗнач.Добавить(ДанныеФормыВЗначение(ЭлементМассива.ТаблицаВариантовЗаполнения, Тип("ТаблицаЗначений")));
			
		КонецЦикла;
			
	КонецЦикла;
	
	// вставляем данные вариантов автозаполнения ячеек
	СписокСохранения.Вставить("ДанныеВариантовАвтоЗаполнения", ДанныеВариантовАвтоЗаполнения);
	
	// вставляем версию формы
	СписокСохранения.Вставить("ВерсияФормы", СтруктураРеквизитовФормы.мВерсияФормы);
	
	СписокСохранения.Вставить("СохранятьРасшифровку", СтруктураРеквизитовФормы.мСохранятьРасшифровку);
	
	Если СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки <> Неопределено Тогда
	
		ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки);

		Если СтруктураРеквизитовФормы.мСохранятьРасшифровку = Истина Тогда
			СписокСохранения.Вставить("Расшифровка", ТаблицаРасшифровки);
		КонецЕсли;
		
	КонецЕсли;
	
	СписокСохранения.Вставить("ФлПодсчетСтраниц", СтруктураРеквизитовФормы.мСчетчикСтраниц);
	
	СписокСохранения.Вставить("ФлПроверятьСоотношенияПриПечатиИВыгрузки", СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки);
	
	СписокСохранения.Вставить("ФлОтклВыборЗначений", СтруктураРеквизитовФормы.мАвтоВыборКодов);
	
	СписокСохранения.Вставить("Автозаполнение", СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);
	
	СписокСохранения.Вставить("ПечатьБезШтрихкодаРазрешена", СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена);
	
	СписокСохранения.Вставить("ГруппаОрганизаций", СтруктураРеквизитовФормы.ГруппаОрганизаций);
	
	СписокСохранения.Вставить("ДатаНачалаАвтозаполнения", СтруктураРеквизитовФормы.ДатаНачалаАвтозаполнения);
	
	ДобавитьПризнакАктуальностиСведенийРаздела(СписокСохранения, "Раздел8");
	ДобавитьПризнакАктуальностиСведенийРаздела(СписокСохранения, "Раздел8_Прил1");
	ДобавитьПризнакАктуальностиСведенийРаздела(СписокСохранения, "Раздел9");
	ДобавитьПризнакАктуальностиСведенийРаздела(СписокСохранения, "Раздел9_Прил1");
	ДобавитьПризнакАктуальностиСведенийРаздела(СписокСохранения, "Раздел10");
	ДобавитьПризнакАктуальностиСведенийРаздела(СписокСохранения, "Раздел11");
	ДобавитьПризнакАктуальностиСведенийРаздела(СписокСохранения, "Раздел12");
	
	СписокСохранения.Вставить("ВыполненоЗаполнениеРазделов", СтруктураРеквизитовФормы.ВыполненоЗаполнениеРазделов);
	
	СписокСохранения.Вставить("УспешноеАвтозаполнение", СтруктураРеквизитовФормы.УспешноеАвтозаполнение);
	
	ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
	СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета = ХранилищеДанных;
	
	Попытка
		СтруктураРеквизитовФормы.мСохраненныйДок.Записать();
	Исключение
		Если НЕ Автосохранение Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='%1';ru='%1'"), РегламентированнаяОтчетностьКлиентСервер.СформироватьТекстСообщения(ОписаниеОшибки()));
			Сообщение.Сообщить();
		КонецЕсли;
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецПопытки;
	
	Модифицированность = Ложь;
	
	СохранитьДеревоНастройкиСтраниц(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	
	Если НЕ СтруктураРеквизитовФормы.мБезОткрытияФормы
		И НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		
		ЗаблокироватьДанныеДляРедактирования(СтруктураРеквизитовФормы.мСохраненныйДок, , ЭтаФорма.УникальныйИдентификатор);
		
	КонецЕсли;
	
	СохранитьСведенияНДС("Раздел8");
	СохранитьСведенияНДС("Раздел8_Прил1");
	СохранитьСведенияНДС("Раздел9");
	СохранитьСведенияНДС("Раздел9_Прил1");
	СохранитьСведенияНДС("Раздел10");
	СохранитьСведенияНДС("Раздел11");
	СохранитьСведенияНДС("Раздел12");
	
	СтруктураРеквизитовФормы.ОтчетСтарогоОбразца = Ложь;
	
	ЗаписатьРезультатПроверкиВыгрузки();
	
	//ПроверкаКонтрагентовБРО
	ПроверкаКонтрагентовБРО.СохранитьРезультатыПроверкиПриСохраненииДекларации(ЭтотОбъект);
	//Конец ПроверкаКонтрагентовБРО
	
	Если ДанныеДляРазблокирования <> Неопределено Тогда
		РазблокироватьДанныеДляРедактирования(ДанныеДляРазблокирования.Ключ, ДанныеДляРазблокирования.ИдФормы);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных)
	
	ОписаниеТиповНеопределено = Новый ОписаниеТипов("Неопределено");
	
	ТаблицаЗначенийСДанными = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных], Тип("ТаблицаЗначений"));
	
	Если ТаблицаЗначенийСДанными <> Неопределено Тогда
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("Данные") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("Данные");
			ТаблицаЗначенийСДанными.Колонки.Добавить("Данные", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				СтрокаТаблицыЗначений.Данные = ЭтаФорма[ИмяСтруктурыДанных][Ном].Данные[0].Значение;
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("ДанныеДопСтрок") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("ДанныеДопСтрок");
			ТаблицаЗначенийСДанными.Колонки.Добавить("ДанныеДопСтрок", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				
				Если ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок.Количество() > 0
				   И ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела" Тогда
					СтрокаТаблицыЗначений.ДанныеДопСтрок = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Значение, Тип("ТаблицаЗначений"));
					
					Ном = Ном + 1;
					Продолжить;
				КонецЕсли;
				
				СтруктураДанныхДопСтрок = Новый Структура;
				
				Для Каждого ЭлСтруктуры Из ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок Цикл
					СтруктураДанныхДопСтрок.Вставить(ДанныеФормыВЗначение(ЭлСтруктуры.Значение, Тип("ТаблицаЗначений")));
				КонецЦикла;
				
				СтрокаТаблицыЗначений.ДанныеДопСтрок = СтруктураДанныхДопСтрок;
				
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаЗначенийСДанными;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета)
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		Если НЕ Раздел.МногостраничностьВРазделе
			И Раздел.ИмяСтраницы <> "Раздел8"
			И Раздел.ИмяСтраницы <> "Раздел8_Прил1"
			И Раздел.ИмяСтраницы <> "Раздел9"
			И Раздел.ИмяСтраницы <> "Раздел9_Прил1"
			И Раздел.ИмяСтраницы <> "Раздел10"
			И Раздел.ИмяСтраницы <> "Раздел11"
			И Раздел.ИмяСтраницы <> "Раздел12" Тогда
			ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеСтруктурыДанных()
	
	СохрТабличныйДокумент = Новый ТабличныйДокумент;
	
	СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		Если НЕ Раздел.МногостраничностьВРазделе
			И НЕ Раздел.ИмяСтраницы = "Раздел8"
			И НЕ Раздел.ИмяСтраницы = "Раздел8_Прил1"
			И НЕ Раздел.ИмяСтраницы = "Раздел9"
			И НЕ Раздел.ИмяСтраницы = "Раздел9_Прил1"
			И НЕ Раздел.ИмяСтраницы = "Раздел10"
			И НЕ Раздел.ИмяСтраницы = "Раздел11"
			И НЕ Раздел.ИмяСтраницы = "Раздел12"
			И (ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы].Количество() = 0) Тогда
			ТабличныйДокумент.Очистить();
			ТабличныйДокумент.Вывести(ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
			
			СохранитьДанныеРаздела(Раздел.ИмяСтраницы, Ложь);
			
		ИначеЕсли Раздел.МногостраничностьВРазделе
			И (ЭтаФорма[мСтруктураМногостраничныхРазделов[Раздел.ИмяСтраницы]][0].Данные.Количество() = 0) Тогда
			
			ТабличныйДокумент.Очистить();
			ТабличныйДокумент.Вывести(ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
			
			СохранитьДанныеРаздела(Раздел.ИмяСтраницы, Ложь);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДеревоНастройкиСтраниц(Знач мСохраненныйДок)
	
	Если мСохраненныйДок <> Неопределено Тогда
		
		Если ТипЗнч(мСохраненныйДок) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
			мСохраненныйДок = мСохраненныйДок.ПолучитьОбъект();
		КонецЕсли;
		
		Если Не мСохраненныйДок.ЭтоНовый() Тогда
			// Сохраняем выбранные листы для печати в хранилище
			ХранилищеДанных = Новый ХранилищеЗначения(РеквизитФормыВЗначение("мДеревоСтраницОтчета"));
			мСохраненныйДок.ДеревоНастройкиСтраниц = ХранилищеДанных;
			Попытка
				мСохраненныйДок.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
Конецпроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если (НЕ СтруктураРеквизитовФормы.АвтоЗаполнениеРеглОтчетаДоступно
		ИЛИ СтруктураРеквизитовФормы.СтатусОтчета = "Сдано")
		И Модифицированность Тогда
		
		Модифицированность = Ложь;
		
		Если ЗавершениеРаботы Тогда
			
			Отказ = Истина;
			
			ТекстПредупреждения = НСтр("ka='Декларация по НДС сдана. Изменения не сохранены."
"Для подготовки уточненной декларации создайте новый отчет.';ru='Декларация по НДС сдана. Изменения не сохранены."
"Для подготовки уточненной декларации создайте новый отчет.'");
			
			Возврат;
			
		КонецЕсли;
		
		ПоказатьПредупреждение(, НСтр("ka='Декларация по НДС сдана. Изменения не сохранены."
"Для подготовки уточненной декларации создайте новый отчет.';ru='Декларация по НДС сдана. Изменения не сохранены."
"Для подготовки уточненной декларации создайте новый отчет.'"));
		
	Иначе
		
		РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(
		ЭтаФорма, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РегламентированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
	
	//ПроверкаКонтрагентовБРО
	ПроверкаКонтрагентовБРО.ПриЗакрытииОтчета(ЭтотОбъект);
	//Конец ПроверкаКонтрагентовБРО
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦветЯчеекНаКлиенте(ТекущаяОбластьИмя = "") Экспорт
	
	ИзменитьЦветЯчеек(ЭтаФорма, ТекущаяОбластьИмя);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЦветЯчеекНаСервере(ТекущаяОбластьИмя = "") Экспорт
	
	ИзменитьЦветЯчеек(ЭтаФорма, ТекущаяОбластьИмя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьЦветЯчеек(Форма, ТекущаяОбластьИмя = "")
	
	Если НЕ ЗначениеЗаполнено(ТекущаяОбластьИмя) Тогда
		ТекущаяОбластьИмя = Форма.ТабличныйДокумент.ТекущаяОбласть.Имя;
	КонецЕсли;
	
	Строка060БылаАвторасчитываемая = Форма.ТабличныйДокумент.Области.П000200006003.Защита;
	
	КодОперации = СокрЛП(Форма.ТабличныйДокумент.Области.П000200007003.Значение);
	
	Если КодОперации = "1011705" ИЛИ КодОперации = "1011707" Тогда
		
		Если Форма.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет Тогда
			ИзменитьВариантЗаполненияЯчейки(Форма, 0, "П000200006003");
		Иначе	
			ИзменитьВариантЗаполненияЯчейки(Форма, 4, "П000200006003");
		КонецЕсли;
		
		Если Форма.СтруктураРеквизитовФормы.ОтображатьКнопкуЗаполнить Тогда
			ИзменитьВариантЗаполненияЯчейки(Форма, 3, "П000200008003");
			ИзменитьВариантЗаполненияЯчейки(Форма, 3, "П000200009003");
		Иначе
			ИзменитьВариантЗаполненияЯчейки(Форма, 0, "П000200008003");
			ИзменитьВариантЗаполненияЯчейки(Форма, 0, "П000200009003");
		КонецЕсли;
		ИзменитьВариантЗаполненияЯчейки(Форма, 0, "П000200010003");
		
		Если ТекущаяОбластьИмя = "П000200007003"
			И Форма.ТабличныйДокумент.Области.П000200006003.Значение > 0 Тогда
			
			Форма.ТабличныйДокумент.Области.П000200006003.Значение = 0;
			Форма.ТабличныйДокумент.Области.П000200008003.Значение = 0;
			Форма.ТабличныйДокумент.Области.П000200009003.Значение = 0;
			Форма.ТабличныйДокумент.Области.П000200010003.Значение = 0;
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = НСтр("ka='Значения по строкам 60, 80, 90, 100 раздела 2 очищены вследствие изменения кода операции по строке 070.';ru='Значения по строкам 60, 80, 90, 100 раздела 2 очищены вследствие изменения кода операции по строке 070.'");
			
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	Иначе
		
		ИзменитьВариантЗаполненияЯчейки(Форма, 0, "П000200006003");
		ИзменитьВариантЗаполненияЯчейки(Форма, 5, "П000200008003");
		ИзменитьВариантЗаполненияЯчейки(Форма, 5, "П000200009003");
		ИзменитьВариантЗаполненияЯчейки(Форма, 5, "П000200010003");
		
		Если Строка060БылаАвторасчитываемая
			И Форма.ТабличныйДокумент.Области.П000200006003.Значение > 0 Тогда
			
			Форма.ТабличныйДокумент.Области.П000200006003.Значение = 0;
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = НСтр("ka='Значение по строке 060 раздела 2 очищено вследствие изменения кода операции по строке 070.';ru='Значение по строке 060 раздела 2 очищено вследствие изменения кода операции по строке 070.'");
			
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		Форма.ТабличныйДокумент.Области.П000200008003.Значение = "";
		Форма.ТабличныйДокумент.Области.П000200009003.Значение = "";
		Форма.ТабличныйДокумент.Области.П000200010003.Значение = "";
		
	КонецЕсли;
	
	ИзменитьВариантЗаполненияЯчейки(Форма, 0, "П000200004003");
	ИзменитьВариантЗаполненияЯчейки(Форма, 5, "П000200005003");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьВариантЗаполненияЯчейки(Форма, НовыйВариант, Показатель = Неопределено)
	
	ИмяТекущейСтраницыПанели = Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	
	#Если НаКлиенте Тогда
		ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьКлиент.ПолучитьТаблицуВариантовЗаполненияНаКлиенте(Форма, ИмяТекущейСтраницыПанели);
	#Иначе
		ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьВызовСервера.ПолучитьТаблицуВариантовЗаполненияНаСервере(Форма, ИмяТекущейСтраницыПанели);
	#КонецЕсли
	
	Если ТаблицаВариантыЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяОбласть  = Форма.Элементы.ТабличныйДокумент.ТекущаяОбласть;
	Если Показатель = Неопределено Тогда
		ИмяПоказателя   = ТекущаяОбласть.Имя;
	Иначе
		ИмяПоказателя = Показатель;
	КонецЕсли;
	
	НайденнаяСтрока = ТаблицаВариантыЗаполнения.НайтиСтроки(Новый Структура("КодПоказателя", ИмяПоказателя));
	Если НайденнаяСтрока.Количество() > 0 Тогда
		НайденнаяСтрока = НайденнаяСтрока[0];
		НайденнаяСтрока.ВариантЗаполнения = НовыйВариант;
	КонецЕсли;
	
	УстановитьЦветФонаЯчейки(Форма, ИмяПоказателя, НовыйВариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеЗначенийВКвадратикахНаКлиенте(Знач ИмяСтраницы) Экспорт
	
	Возврат;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеЗначенийВКвадратикахНаСервере(Знач ИмяСтраницы) Экспорт
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличноеПолеНаКлиенте(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНаСервере(ВыбТабличноеПолеИмя) Экспорт
	
	Если ВыбТабличноеПолеИмя = "Раздел8"
		ИЛИ ВыбТабличноеПолеИмя = "Раздел8_Прил1"
		ИЛИ ВыбТабличноеПолеИмя = "Раздел9"
		ИЛИ ВыбТабличноеПолеИмя = "Раздел9_Прил1"
		ИЛИ ВыбТабличноеПолеИмя = "Раздел10"
		ИЛИ ВыбТабличноеПолеИмя = "Раздел11"
		ИЛИ ВыбТабличноеПолеИмя = "Раздел12" Тогда
		ОчиститьТабличноеПолеНДС(ВыбТабличноеПолеИмя)
	Иначе
		ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя)
	
	ВыбТабличноеПоле = Форма.ТабличныйДокумент;
	
	//для очистки защищенных областей итоговых ячеек
	//получим список итоговых ячеек, снимая с них защиту), а после очищения вернем защиту
	СписокИтоговыхЯчеек = Новый СписокЗначений;
	
	Если НЕ ВыбТабличноеПолеИмя = "Раздел5" Тогда
		
		Для каждого Область Из ВыбТабличноеПоле.Области Цикл
			Если Область.ЦветФона = Форма.СтруктураРеквизитовФормы.ЦветЗаполняетсяАвтоАрифметика И Область.Защита Тогда
				Область.Защита = Ложь;
				СписокИтоговыхЯчеек.Добавить(Область.Имя);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиентСервер.ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя);
	
	ВыбТабличноеПоле = Форма.ТабличныйДокумент;
	
	// Непосредственно очищаем ячейки табличного документа.
	// Повторно, так как в результате расчета многостраничного многострочного блока заполняются итоговые ячейки, 
	// в арифметике которых есть показатели не из многострочного блока
	Для Инд = 0 По ВыбТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ВыбТабличноеПоле.Области[Инд];
		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;
		Если ТекущаяОбласть.Защита Тогда
			Продолжить;
		КонецЕсли;
		ТекущаяОбласть.Очистить();
	КонецЦикла;
	
	Для каждого КодИтоговогоПоказателя Из СписокИтоговыхЯчеек Цикл
		ОбластьПоказателя=ВыбТабличноеПоле.Области.Найти(КодИтоговогоПоказателя.Значение);
		Если ОбластьПоказателя <> Неопределено Тогда
			ОбластьПоказателя.Защита = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделуНаКлиенте(Знач ИмяРаздела) Экспорт
	
	ПеременныеМодуля = Новый Структура;
	ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделу(ИмяРаздела, ПеременныеМодуля);
	
КонецПроцедуры

&НаСервере
Процедура ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделуНаСервере(Знач ИмяРаздела) Экспорт
	
	ПеременныеМодуля = Новый Структура;
	ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделу(ИмяРаздела, ПеременныеМодуля);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделу(Знач ИмяРаздела, ПеременныеМодуля)
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт
	
	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);
	
КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт
	
	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяСтраницыПанели = "", ОбластьИмя = "")
	
	Перем ТаблицаБлока;
	
	Если Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСтраницыПанели = "Раздел1" Тогда
		
		Если Форма.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя)
			ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000100004003, ОбластьИмя) > 0
			ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000100005003, ОбластьИмя) > 0 Тогда
			
			ОкрП000300020003 = 0;
			ОкрП000300021003 = 0;
			ОкрП000400012003 = 0;
			ОкрП000400013003 = 0;
			ОкрП000500008003 = 0;
			ОкрП000500009003 = 0;
			ОкрП000600016003 = 0;
			ОкрП000600017003 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел3" Тогда
				ОкрП000300020003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300020003.Значение);
			ИначеЕсли Форма.СтруктураДанныхРаздел3.Свойство("П000300020003") Тогда
				ОкрП000300020003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300020003);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел3" Тогда
				ОкрП000300021003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300021003.Значение);
			ИначеЕсли Форма.СтруктураДанныхРаздел3.Свойство("П000300021003") Тогда
				ОкрП000300021003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300021003);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел4" Тогда
				ОкрП000400012003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000400012003.Значение);
			ИначеЕсли Форма.СтруктураДанныхРаздел4.Свойство("П000400012003") Тогда
				ОкрП000400012003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел4.П000400012003);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел4" Тогда
				ОкрП000400013003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000400013003.Значение);
			ИначеЕсли Форма.СтруктураДанныхРаздел4.Свойство("П000400013003") Тогда
				ОкрП000400013003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел4.П000400013003);
			КонецЕсли;
			
			СумПоказатели = Новый Структура;
			СумПоказатели.Вставить("П000500008003", 0);
			СумПоказатели.Вставить("П000500009003", 0);
			
			РассчитатьСуммуПоказателейНаВсехСтраницах(Форма, "Раздел5", СумПоказатели, Истина);
			
			ОкрП000500008003 = СумПоказатели.П000500008003;
			ОкрП000500009003 = СумПоказатели.П000500009003;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел6" Тогда
				ОкрП000600016003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000600016003.Значение);
			ИначеЕсли Форма.СтруктураДанныхРаздел6.Свойство("П000600016003") Тогда
				ОкрП000600016003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел6.П000600016003);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел6" Тогда
				ОкрП000600017003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000600017003.Значение);
			ИначеЕсли Форма.СтруктураДанныхРаздел6.Свойство("П000600017003") Тогда
				ОкрП000600017003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел6.П000600017003);
			КонецЕсли;
			
			СуммаНалога
			= (ОкрП000300020003 + ОкрП000400013003 + ОкрП000600016003)
			- (ОкрП000300021003 + ОкрП000400012003 + ОкрП000500008003 + ОкрП000500009003 + ОкрП000600017003);
			
			Форма.СтруктураДанныхРаздел1.Вставить("П000100004003", Макс(СуммаНалога, 0));
			Форма.СтруктураДанныхРаздел1.Вставить("П000100005003", Макс(-СуммаНалога, 0));
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел1" Тогда
				Форма.ТабличныйДокумент.Области.П000100004003.Значение = Макс(СуммаНалога, 0);
				Форма.ТабличныйДокумент.Области.П000100005003.Значение = Макс(-СуммаНалога, 0);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Раздел2" Тогда
		
		Если Форма.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя)
			ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000200006003, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				КодОперации = СокрЛП(Форма.ТабличныйДокумент.Области.П000200007003.Значение);
				
				Если КодОперации = "1011705" ИЛИ КодОперации = "1011707" Тогда
					
					ОкрП000200008003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области.П000200008003.Значение);
					ОкрП000200009003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области.П000200009003.Значение);
					ОкрП000200010003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области.П000200010003.Значение);
					
					Если ОкрП000200008003 = 0 Тогда
						Форма.ТабличныйДокумент.Области.П000200006003.Значение
						= ОкрП000200009003;
					Иначе
						Форма.ТабличныйДокумент.Области.П000200006003.Значение
						= ОкрП000200008003 + ОкрП000200009003 - ОкрП000200010003;
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Для Каждого ЭлементТабл Из Форма.ТаблицаСтраницыРаздела2 Цикл
					
					ЭлементТабл = ЭлементТабл.Данные[0].Значение;
					
					КодОперации = СокрЛП(ЭлементТабл.П000200007003);
					
					Если КодОперации = "1011705" ИЛИ КодОперации = "1011707" Тогда
						
						ОкрП000200008003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
						Форма, ЭлементТабл.П000200008003);
						ОкрП000200009003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
						Форма, ЭлементТабл.П000200009003);
						ОкрП000200010003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
						Форма, ЭлементТабл.П000200010003);
						
						Если ОкрП000200008003 = 0 Тогда
							ЭлементТабл.П000200006003 = ОкрП000200009003;
						Иначе
							ЭлементТабл.П000200006003 = ОкрП000200008003 + ОкрП000200009003 - ОкрП000200010003;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Конецесли;
		
	ИначеЕсли ИмяСтраницыПанели = "Раздел3" Тогда
		
		Если Форма.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет Тогда
			Возврат;
		КонецЕсли;
	
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300001005, ОбластьИмя) > 0 Тогда
				ОкрП000300001003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300001003.Значение);
				Форма.ТабличныйДокумент.Области.П000300001005.Значение = ОкрП000300001003 * 18 / 100;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300002005, ОбластьИмя) > 0 Тогда
				ОкрП000300002003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300002003.Значение);
				Форма.ТабличныйДокумент.Области.П000300002005.Значение = ОкрП000300002003 * 10 / 100;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300003005, ОбластьИмя) > 0 Тогда
				ОкрП000300003003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300003003.Значение);
				Форма.ТабличныйДокумент.Области.П000300003005.Значение = ОкрП000300003003 * 18 / 118;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300004005, ОбластьИмя) > 0 Тогда
				ОкрП000300004003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300004003.Значение);
				Форма.ТабличныйДокумент.Области.П000300004005.Значение = ОкрП000300004003 * 10 / 110;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300004105, ОбластьИмя) > 0 Тогда
				ОкрП000300004103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300004103.Значение);
				Форма.ТабличныйДокумент.Области.П000300004105.Значение = ОкрП000300004103 * 18 / 118;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300004205, ОбластьИмя) > 0 Тогда
				ОкрП000300004203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300004203.Значение);
				Форма.ТабличныйДокумент.Области.П000300004205.Значение = ОкрП000300004203 * 10 / 110;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300006005, ОбластьИмя) > 0 Тогда
				ОкрП000300006003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300006003.Значение);
				Форма.ТабличныйДокумент.Области.П000300006005.Значение = ОкрП000300006003 * 18 / 100;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300010505, ОбластьИмя) > 0 Тогда
				ОкрП000300010503 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300010503.Значение);
				Форма.ТабличныйДокумент.Области.П000300010505.Значение = ОкрП000300010503 * 18 / 100;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300010605, ОбластьИмя) > 0 Тогда
				ОкрП000300010603 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300010603.Значение);
				Форма.ТабличныйДокумент.Области.П000300010605.Значение = ОкрП000300010603 * 10 / 100;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300010705, ОбластьИмя) > 0 Тогда
				ОкрП000300010703 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300010703.Значение);
				Форма.ТабличныйДокумент.Области.П000300010705.Значение = ОкрП000300010703 * 18 / 118;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300010805, ОбластьИмя) > 0 Тогда
				ОкрП000300010803 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300010803.Значение);
				Форма.ТабличныйДокумент.Области.П000300010805.Значение = ОкрП000300010803 * 10 / 110;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300011805, ОбластьИмя) > 0 Тогда
				
				ОкрП000300001005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300001005.Значение);
				ОкрП000300002005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300002005.Значение);
				ОкрП000300003005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300003005.Значение);
				ОкрП000300004005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300004005.Значение);
				ОкрП000300004105 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300004105.Значение);
				ОкрП000300004205 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300004205.Значение);
				ОкрП000300005005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300005005.Значение);
				ОкрП000300006005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300006005.Значение);
				ОкрП000300007005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300007005.Значение);
				ОкрП000300008005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300008005.Значение);
				ОкрП000300010505 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300010505.Значение);
				ОкрП000300010605 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300010605.Значение);
				ОкрП000300010705 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300010705.Значение);
				ОкрП000300010805 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300010805.Значение);
				ОкрП000300010905 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300010905.Значение);
				ОкрП000300011005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300011005.Значение);
				ОкрП000300011505 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300011505.Значение);
				
				Форма.ТабличныйДокумент.Области.П000300011805.Значение
				= ОкрП000300001005 + ОкрП000300002005 + ОкрП000300003005 + ОкрП000300004005
				+ ОкрП000300004105 + ОкрП000300004205 + ОкрП000300005005 + ОкрП000300006005
				+ ОкрП000300007005 + ОкрП000300008005 + ОкрП000300010505 + ОкрП000300010605
				+ ОкрП000300010705 + ОкрП000300010805 + ОкрП000300010905 + ОкрП000300011005
				+ ОкрП000300011505;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300019003, ОбластьИмя) > 0 Тогда
				
				ОкрП000300012003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300012003.Значение);
				ОкрП000300013003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300013003.Значение);
				ОкрП000300014003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300014003.Значение);
				ОкрП000300015003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300015003.Значение);
				ОкрП000300016003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300016003.Значение);
				ОкрП000300017003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300017003.Значение);
				ОкрП000300018003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300018003.Значение);
				ОкрП000300018503 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000300018503.Значение);
				
				Форма.ТабличныйДокумент.Области.П000300019003.Значение
				= ОкрП000300012003 + ОкрП000300013003 + ОкрП000300014003 + ОкрП000300015003
				+ ОкрП000300016003 + ОкрП000300017003 + ОкрП000300018003 + ОкрП000300018503;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300020003, ОбластьИмя) > 0 Тогда
				Форма.ТабличныйДокумент.Области.П000300020003.Значение
				= Макс(Форма.ТабличныйДокумент.Области.П000300011805.Значение
				- Форма.ТабличныйДокумент.Области.П000300019003.Значение, 0);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300021003, ОбластьИмя) > 0 Тогда
				Форма.ТабличныйДокумент.Области.П000300021003.Значение
				= Макс(Форма.ТабличныйДокумент.Области.П000300019003.Значение
				- Форма.ТабличныйДокумент.Области.П000300011805.Значение, 0);
			КонецЕсли;
			
		Иначе
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300001005, ОбластьИмя) > 0 Тогда
				ОкрП000300001003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300001003);
				Форма.СтруктураДанныхРаздел3.П000300001005 = ОкрП000300001003 * 18 / 100;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300002005, ОбластьИмя) > 0 Тогда
				ОкрП000300002003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300002003);
				Форма.СтруктураДанныхРаздел3.П000300002005 = ОкрП000300002003 * 10 / 100;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300003005, ОбластьИмя) > 0 Тогда
				ОкрП000300003003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300003003);
				Форма.СтруктураДанныхРаздел3.П000300003005 = ОкрП000300003003 * 18 / 118;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300004005, ОбластьИмя) > 0 Тогда
				ОкрП000300004003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300004003);
				Форма.СтруктураДанныхРаздел3.П000300004005 = ОкрП000300004003 * 10 / 110;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300004105, ОбластьИмя) > 0 Тогда
				ОкрП000300004103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300004103);
				Форма.СтруктураДанныхРаздел3.П000300004105 = ОкрП000300004103 * 18 / 118;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300004205, ОбластьИмя) > 0 Тогда
				ОкрП000300004203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300004203);
				Форма.СтруктураДанныхРаздел3.П000300004205 = ОкрП000300004203 * 10 / 110;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300006005, ОбластьИмя) > 0 Тогда
				ОкрП000300006003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300006003);
				Форма.СтруктураДанныхРаздел3.П000300006005 = ОкрП000300006003 * 18 / 100;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300010505, ОбластьИмя) > 0 Тогда
				ОкрП000300010503 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300010503);
				Форма.СтруктураДанныхРаздел3.П000300010505 = ОкрП000300010503 * 18 / 100;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300010605, ОбластьИмя) > 0 Тогда
				ОкрП000300010603 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300010603);
				Форма.СтруктураДанныхРаздел3.П000300010605 = ОкрП000300010603 * 10 / 100;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300010705, ОбластьИмя) > 0 Тогда
				ОкрП000300010703 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300010703);
				Форма.СтруктураДанныхРаздел3.П000300010705 = ОкрП000300010703 * 18 / 118;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300010805, ОбластьИмя) > 0 Тогда
				ОкрП000300010803 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300010803);
				Форма.СтруктураДанныхРаздел3.П000300010805 = ОкрП000300010803 * 10 / 110;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300011805, ОбластьИмя) > 0 Тогда
				
				ОкрП000300001005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300001005);
				ОкрП000300002005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300002005);
				ОкрП000300003005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300003005);
				ОкрП000300004005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300004005);
				ОкрП000300004105 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300004105);
				ОкрП000300004205 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300004205);
				ОкрП000300005005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300005005);
				ОкрП000300006005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300006005);
				ОкрП000300007005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300007005);
				ОкрП000300008005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300008005);
				ОкрП000300010505 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300010505);
				ОкрП000300010605 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300010605);
				ОкрП000300010705 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300010705);
				ОкрП000300010805 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300010805);
				ОкрП000300010905 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300010905);
				ОкрП000300011005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300011005);
				ОкрП000300011505 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300011505);
				
				Форма.СтруктураДанныхРаздел3.П000300011805
				= ОкрП000300001005 + ОкрП000300002005 + ОкрП000300003005 + ОкрП000300004005
				+ ОкрП000300004105 + ОкрП000300004205 + ОкрП000300005005 + ОкрП000300006005
				+ ОкрП000300007005 + ОкрП000300008005 + ОкрП000300010505 + ОкрП000300010605
				+ ОкрП000300010705 + ОкрП000300010805 + ОкрП000300010905 + ОкрП000300011005
				+ ОкрП000300011505;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300019003, ОбластьИмя) > 0 Тогда
				
				ОкрП000300012003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300012003);
				ОкрП000300013003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300013003);
				ОкрП000300014003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300014003);
				ОкрП000300015003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300015003);
				ОкрП000300016003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300016003);
				ОкрП000300017003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300017003);
				ОкрП000300018003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300018003);
				ОкрП000300018503 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел3.П000300018503);
				
				Форма.СтруктураДанныхРаздел3.П000300019003
				= ОкрП000300012003 + ОкрП000300013003 + ОкрП000300014003 + ОкрП000300015003
				+ ОкрП000300016003 + ОкрП000300017003 + ОкрП000300018003 + ОкрП000300018503;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300020003, ОбластьИмя) > 0 Тогда
				Форма.СтруктураДанныхРаздел3.П000300020003
				= Макс(Форма.СтруктураДанныхРаздел3.П000300011805 - Форма.СтруктураДанныхРаздел3.П000300019003, 0);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000300021003, ОбластьИмя) > 0 Тогда
				Форма.СтруктураДанныхРаздел3.П000300021003
				= Макс(Форма.СтруктураДанныхРаздел3.П000300019003 - Форма.СтруктураДанныхРаздел3.П000300011805, 0);
			КонецЕсли;
			
		КонецЕсли;
		
		Расчет(Форма, "Раздел1", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Раздел3_Прил1" Тогда
			
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			Если НЕ Форма.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет И (НЕ ЗначениеЗаполнено(ОбластьИмя)
				ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000310007004, ОбластьИмя) > 0) Тогда
				
				Для Ном = 1 По 10 Цикл
					
					Форма.ТабличныйДокумент.Области["П000310007004_" + Ном].Значение
					= РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма,
					Форма.ТабличныйДокумент.Области["П000310006001"].Значение) / 10
					* Форма.ТабличныйДокумент.Области["П000310007003_" + Ном].Значение / 100;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000310008004, ОбластьИмя) > 0 Тогда
				
				Колонка4 = 0;
				Для Ном = 1 По 10 Цикл
					Колонка4 = Колонка4 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области["П000310007004_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000310008004.Значение = Колонка4;
				
			КонецЕсли;
			
		Иначе
			
			Если НЕ Форма.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет И (НЕ ЗначениеЗаполнено(ОбластьИмя)
				ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000310007004, ОбластьИмя) > 0) Тогда
				
				Для Каждого ЭлементТабл Из Форма.ТаблицаСтраницыРаздела3_Прил1 Цикл
					
					ЭлементТабл = ЭлементТабл.Данные[0].Значение;
					
					Для Ном = 1 По 10 Цикл
						
						ЭлементТабл["П000310007004_" + Ном]
						= РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма,
						ЭлементТабл["П000310006001"]) / 10 * ЭлементТабл["П000310007003_" + Ном] / 100;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000310008004, ОбластьИмя) > 0 Тогда
				
				Для Каждого ЭлементТабл Из Форма.ТаблицаСтраницыРаздела3_Прил1 Цикл
					
					ЭлементТабл = ЭлементТабл.Данные[0].Значение;
					
					Колонка4 = 0;
					Для Ном = 1 По 10 Цикл
						Колонка4 = Колонка4 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
						Форма, ЭлементТабл["П000310007004_" + Ном]);
					КонецЦикла;
					
					ЭлементТабл.П000310008004 = Колонка4;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Раздел3_Прил2" Тогда
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
			Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000320000202, ОбластьИмя) > 0 Тогда
			
			Форма.мСтруктураМногострочныхРазделов.Свойство(Форма.СтруктураРеквизитовФормы.мИдГруппы32, ТаблицаБлока);
			
			ТаблицаБлока = Форма[ТаблицаБлока];
			Колонка2 = 0;
			Ном = 1;
			
			Для Каждого ЭлементТабл Из ТаблицаБлока Цикл
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
					Колонка2 = Колонка2 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области["П000320000102_" + Ном].Значение);
				Иначе
					Колонка2 = Колонка2 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, ЭлементТабл.П000320000102);
				КонецЕсли;
				
				Ном = Ном + 1;
				
			КонецЦикла;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000320000202.Значение = Колонка2;
			Иначе
				Форма.СтруктураДанныхРаздел3_Прил2.П000320000202 = Колонка2;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
			Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000320000203, ОбластьИмя) > 0 Тогда
			
			Форма.мСтруктураМногострочныхРазделов.Свойство(Форма.СтруктураРеквизитовФормы.мИдГруппы32, ТаблицаБлока);
			
			ТаблицаБлока = Форма[ТаблицаБлока];
			Колонка3 = 0;
			Ном = 1;
			
			Для Каждого ЭлементТабл Из ТаблицаБлока Цикл
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
					Колонка3 = Колонка3 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области["П000320000103_" + Ном].Значение);
				Иначе
					Колонка3 = Колонка3 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, ЭлементТабл.П000320000103);
				КонецЕсли;
				
				Ном = Ном + 1;
				
			КонецЦикла;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000320000203.Значение = Колонка3;
			Иначе
				Форма.СтруктураДанныхРаздел3_Прил2.П000320000203 = Колонка3;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Раздел4" Тогда
		
		Если Форма.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя)
			ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000400012003, ОбластьИмя) > 0
			ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000400013003, ОбластьИмя) > 0 Тогда
			
			СуммаП0004М1003003 = 0;
			СуммаП0004М1004003 = 0;
			СуммаП0004М1005003 = 0;
			СуммаП0004М2008003 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы4М1]].Количество() Цикл
					СуммаП0004М1003003 = СуммаП0004М1003003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области["П0004М1003003_" + Ном].Значение);
					СуммаП0004М1004003 = СуммаП0004М1004003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области["П0004М1004003_" + Ном].Значение);
					СуммаП0004М1005003 = СуммаП0004М1005003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области["П0004М1005003_" + Ном].Значение);
				КонецЦикла;
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы4М2]].Количество() Цикл
					СуммаП0004М2008003 = СуммаП0004М2008003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области["П0004М2008003_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000400012003.Значение
				= Макс((СуммаП0004М1003003 + СуммаП0004М1004003) - (СуммаП0004М1005003 + СуммаП0004М2008003), 0);
				
				Форма.ТабличныйДокумент.Области.П000400013003.Значение
				= Макс((СуммаП0004М1005003 + СуммаП0004М2008003) - (СуммаП0004М1003003 + СуммаП0004М1004003), 0);
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы4М1]].Количество() Цикл
					СуммаП0004М1003003 = СуммаП0004М1003003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы4М1]][Ном - 1].П0004М1003003);
					СуммаП0004М1004003 = СуммаП0004М1004003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы4М1]][Ном - 1].П0004М1004003);
					СуммаП0004М1005003 = СуммаП0004М1005003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы4М1]][Ном - 1].П0004М1005003);
				КонецЦикла;
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы4М2]].Количество() Цикл
					СуммаП0004М2008003 = СуммаП0004М2008003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы4М2]][Ном - 1].П0004М2008003);
				КонецЦикла;
				
				Форма.СтруктураДанныхРаздел4.П000400012003
				= Макс((СуммаП0004М1003003 + СуммаП0004М1004003) - (СуммаП0004М1005003 + СуммаП0004М2008003), 0);
				
				Форма.СтруктураДанныхРаздел4.П000400013003
				= Макс((СуммаП0004М1005003 + СуммаП0004М2008003) - (СуммаП0004М1003003 + СуммаП0004М1004003), 0);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Расчет(Форма, "Раздел1", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Раздел5" Тогда
		
		Если Форма.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
			Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000500008003, ОбластьИмя) > 0 Тогда
			
			СуммаП000500005003 = 0;
			
			Для Каждого ЭлементТабл Из Форма.ТаблицаСтраницыРаздела5 Цикл
				
				Если ЭлементТабл.ДанныеДопСтрок.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ЭлементТаблДанныеДопСтрок = ЭлементТабл.ДанныеДопСтрок[0].Значение;
				
				Для Ном = 0 По ЭлементТаблДанныеДопСтрок.Количество() - 1 Цикл
					СуммаП000500005003 = СуммаП000500005003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, ЭлементТаблДанныеДопСтрок[Ном].П000500005003);
				КонецЦикла;
				
			КонецЦикла;
			
			Для Каждого ЭлементТабл Из Форма.ТаблицаСтраницыРаздела5 Цикл
				
				Если НЕ ЭлементТабл.Данные.Количество() = 0 Тогда
					ЭлементТабл.Данные[0].Пометка = Ложь; //для инициализации обмена с сервером
					ЭлементТабл.Данные[0].Значение.П000500008003 = СуммаП000500005003;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000500008003.Значение = СуммаП000500005003;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
			Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000500009003, ОбластьИмя) > 0 Тогда
			
			СуммаП000500007003 = 0;
			
			Для Каждого ЭлементТабл Из Форма.ТаблицаСтраницыРаздела5 Цикл
				
				Если ЭлементТабл.ДанныеДопСтрок.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ЭлементТаблДанныеДопСтрок = ЭлементТабл.ДанныеДопСтрок[0].Значение;
				
				Для Ном = 0 По ЭлементТаблДанныеДопСтрок.Количество() - 1 Цикл
					СуммаП000500007003 = СуммаП000500007003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, ЭлементТаблДанныеДопСтрок[Ном].П000500007003);
				КонецЦикла;
				
			КонецЦикла;
			
			Для Каждого ЭлементТабл Из Форма.ТаблицаСтраницыРаздела5 Цикл
				
				Если НЕ ЭлементТабл.Данные.Количество() = 0 Тогда
					ЭлементТабл.Данные[0].Пометка = Ложь; //для инициализации обмена с сервером
					ЭлементТабл.Данные[0].Значение.П000500009003 = СуммаП000500007003;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000500009003.Значение = СуммаП000500007003;
			КонецЕсли;
			
		КонецЕсли;
		
		Расчет(Форма, "Раздел1", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Раздел6" Тогда
		
		Если Форма.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет Тогда
			Возврат;
		КонецЕсли;
		
		СуммаП0006М1003003 = 0;
		СуммаП0006М1004003 = 0;
		СуммаП0006М2009003 = 0;
		СуммаП0006М2010003 = 0;
		СуммаП0006М3013003 = 0;
		СуммаП0006М3015003 = 0;
		
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000600005003, ОбластьИмя) > 0 Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[
					Форма.СтруктураРеквизитовФормы.мИдГруппы6М1]].Количество() Цикл
					СуммаП0006М1003003 = СуммаП0006М1003003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области["П0006М1003003_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000600005003.Значение = СуммаП0006М1003003;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000600006003, ОбластьИмя) > 0 Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы6М1]].Количество() Цикл
					СуммаП0006М1004003 = СуммаП0006М1004003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области["П0006М1004003_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000600006003.Значение = СуммаП0006М1004003;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя)
				ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000600016003, ОбластьИмя) > 0
				ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000600017003, ОбластьИмя) > 0 Тогда
				
				П000600005003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000600005003.Значение);
				П000600006003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.ТабличныйДокумент.Области.П000600006003.Значение);
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы6М2]].Количество() Цикл
					СуммаП0006М2009003 = СуммаП0006М2009003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области["П0006М2009003_" + Ном].Значение);
					СуммаП0006М2010003 = СуммаП0006М2010003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области["П0006М2010003_" + Ном].Значение);
				КонецЦикла;
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы6М3]].Количество() Цикл
					СуммаП0006М3013003 = СуммаП0006М3013003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области["П0006М3013003_" + Ном].Значение);
					СуммаП0006М3015003 = СуммаП0006М3015003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма.ТабличныйДокумент.Области["П0006М3015003_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000600016003.Значение
				= Макс((П000600005003 + СуммаП0006М2010003 + СуммаП0006М3013003)
				- (П000600006003 + СуммаП0006М2009003 + СуммаП0006М3015003), 0);
				
				Форма.ТабличныйДокумент.Области.П000600017003.Значение
				= Макс((П000600006003 + СуммаП0006М2009003 + СуммаП0006М3015003)
				- (П000600005003 + СуммаП0006М2010003 + СуммаП0006М3013003), 0);
				
			КонецЕсли;
			
		Иначе
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000600005003, ОбластьИмя) > 0 Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы6М1]].Количество() Цикл
					СуммаП0006М1003003 = СуммаП0006М1003003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы6М1]][Ном - 1].П0006М1003003);
				КонецЦикла;
				
				Форма.СтруктураДанныхРаздел6.П000600005003 = СуммаП0006М1003003;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(
				Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000600006003, ОбластьИмя) > 0 Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы6М1]].Количество() Цикл
					СуммаП0006М1004003 = СуммаП0006М1004003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы6М1]][Ном - 1].П0006М1004003);
				КонецЦикла;
				
				Форма.СтруктураДанныхРаздел6.П000600006003 = СуммаП0006М1004003;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбластьИмя)
				ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000600016003, ОбластьИмя) > 0
				ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000600017003, ОбластьИмя) > 0 Тогда
				
				П000600005003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел6.П000600005003);
				П000600006003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
				Форма, Форма.СтруктураДанныхРаздел6.П000600006003);
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы6М2]].Количество() Цикл
					СуммаП0006М2009003 = СуммаП0006М2009003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы6М2]][Ном - 1].П0006М2009003);
					СуммаП0006М2010003 = СуммаП0006М2010003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы6М2]][Ном - 1].П0006М2010003);
				КонецЦикла;
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы6М3]].Количество() Цикл
					СуммаП0006М3013003 = СуммаП0006М3013003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы6М3]][Ном - 1].П0006М3013003);
					СуммаП0006М3015003 = СуммаП0006М3015003 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы6М3]][Ном - 1].П0006М3015003);
				КонецЦикла;
				
				Форма.СтруктураДанныхРаздел6.П000600016003
				= Макс((П000600005003 + СуммаП0006М2010003 + СуммаП0006М3013003)
				- (П000600006003 + СуммаП0006М2009003 + СуммаП0006М3015003), 0);
				
				Форма.СтруктураДанныхРаздел6.П000600017003
				= Макс((П000600006003 + СуммаП0006М2009003 + СуммаП0006М3015003)
				- (П000600005003 + СуммаП0006М2010003 + СуммаП0006М3013003), 0);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Расчет(Форма, "Раздел1", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "" Тогда
		
		Расчет(Форма, "Раздел2",       ОбластьИмя);
		Расчет(Форма, "Раздел3_Прил1", ОбластьИмя);
		Расчет(Форма, "Раздел3_Прил2", ОбластьИмя);
		Расчет(Форма, "Раздел3",       ОбластьИмя);
		Расчет(Форма, "Раздел4",       ОбластьИмя);
		Расчет(Форма, "Раздел5",       ОбластьИмя);
		Расчет(Форма, "Раздел6",       ОбластьИмя);
		Расчет(Форма, "Раздел1",       ОбластьИмя);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСуммуПоказателейНаВсехСтраницах(Форма, ИмяСтраницы, СумПоказатели, Округлять)
	
	ТаблицаРаздела = Неопределено;
	
	Форма.мСтруктураМногостраничныхРазделов.Свойство(ИмяСтраницы, ТаблицаРаздела);
	
	Если ТаблицаРаздела <> Неопределено Тогда
		
		ТаблицаРаздела = Форма[ТаблицаРаздела];
		
		Для Инд = 0 По ТаблицаРаздела.Количество() - 1 Цикл
			
			ДанныеТаблПоле = ТаблицаРаздела[Инд].Данные;
			
			Если ДанныеТаблПоле.Количество() = 0 Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел5" Тогда
					
					Для Каждого СумПоказатель Из СумПоказатели Цикл
						
						СумПоказатели.Вставить(
						СумПоказатель.Ключ, РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
						Форма, Форма.ТабличныйДокумент.Области[СумПоказатель.Ключ].Значение));
						
					КонецЦикла;
					
				КонецЕсли;
				
				Прервать;
				
			Иначе
				
				Для Каждого СумПоказатель Из СумПоказатели Цикл
					
					СумПоказатели.Вставить(СумПоказатель.Ключ, СумПоказатель.Значение
					+ РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(
					Форма, ДанныеТаблПоле[0].Значение[СумПоказатель.Ключ]));
					
				КонецЦикла;
				
				Если ИмяСтраницы = "Раздел5" Тогда
					
					Прервать;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтраницу(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел2" Тогда
		ОКТМО = ТабличныйДокумент.Области.П000200005003.Значение;
	КонецЕсли;
	
	ВставитьДополнительнуюСтраницуНаСервере(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
	Если Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел2" Тогда
		ТабличныйДокумент.Области.П000200005003.Значение = ОКТМО;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.НомерТекущейСтраницы = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницу(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтраницуЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ka='Удалить текущую страницу?';ru='Удалить текущую страницу?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = Элементы.РазделыОтчета.ТекущиеДанные;
	
	КопияТекущиеДанные = ТекущиеДанные;
	
	ТекущиеДанные = ТекущиеДанные.ПолучитьРодителя();
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ПолучитьЭлементы().Количество() = 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтраницаРазделаПослеУдаления = Неопределено;
	Если КопияТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета = ТекущиеДанные.ПолучитьЭлементы().Количество() Тогда
		ТекущаяСтраницаРазделаПослеУдаления = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(ТекущиеДанные.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", КопияТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета - 1);
		СтруктураРеквизитовФормы.НомерТекущейСтраницы = ТекущаяСтраницаРазделаПослеУдаления.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	ИндексУдаляемойСтраницы = ТекущиеДанные.ПолучитьЭлементы().Индекс(КопияТекущиеДанные);
	
	УдалитьДополнительнуюСтраницуНаСервере(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим, ИндексУдаляемойСтраницы);
	
	ТекущиеДанные.ПолучитьЭлементы().Удалить(ИндексУдаляемойСтраницы);
	
	НомерСтраницы = 1;
	
	Для Каждого СтраницаРаздела Из ТекущиеДанные.ПолучитьЭлементы() Цикл
		
		СтраницаРаздела.КолонкаРазделыОтчета = "Стр. " + НомерСтраницы;
		СтраницаРаздела.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	
	Если НЕ ТекущаяСтраницаРазделаПослеУдаления = Неопределено Тогда
		Элементы.РазделыОтчета.ТекущаяСтрока = ТекущаяСтраницаРазделаПослеУдаления.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтраницуНаСервере(ИмяТекущейСтраницыПанели = Неопределено)
	
	Перем ТаблицаСтраницРаздела;
	Перем СтруктураДанныхДопСтрокРаздела;
	
	Если ИмяТекущейСтраницыПанели = Неопределено Тогда
		ИмяТекущейСтраницыПанели = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	КонецЕсли;
	
	Если Не мСтруктураМногостраничныхРазделов.Свойство(ИмяТекущейСтраницыПанели, ТаблицаСтраницРаздела) Тогда
		Возврат;
	Иначе
		МаксКолвоЭкз = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(ЭтаФорма, ИмяТекущейСтраницыПанели, "МаксКолвоЭкз", 0);
		Если МаксКолвоЭкз <> 0 И ЭтаФорма[мСтруктураМногостраничныхРазделов[ИмяТекущейСтраницыПанели]].Количество() >= МаксКолвоЭкз Тогда
			ЗаголовокСтраницы = ИмяТекущейСтраницыПанели;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='В разделе ""%1"" максимальное количество экземпляров страниц равно %2.';ru='В разделе ""%1"" максимальное количество экземпляров страниц равно %2.'"),
			ЗаголовокСтраницы, МаксКолвоЭкз);
			Сообщение.Сообщить();
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	СохранитьДанныеМногостраничногоРазделаВактивнойСтраницеНаСервере(ИмяТекущейСтраницыПанели);
	
	ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
	
	// Найдем активную страницу
	СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
	
	Если СтрТаблицаСтраницы.Количество() > 0 Тогда
		
		СтрТаблицаСтраницы = СтрТаблицаСтраницы[0];
		
		// Убираем активность у текущей страницы
		СтрТаблицаСтраницы.АктивнаяСтраница = Ложь;
		
	КонецЕсли;
	
	// Добавляем новую страницу
	СтрНоваяСтраница = ТаблицаСтраницРаздела.Добавить();
	
	// Присваиваем представление по умолчанию
	СтрНоваяСтраница.Представление = "Новая страница";
	СтрНоваяСтраница.АвтоматическоеПредставление = Истина;
	
	// Ставим признак активной страницы
	СтрНоваяСтраница.АктивнаяСтраница = Истина;
	
	ПослеДобавленияДопСтрНаСервере(ИмяТекущейСтраницыПанели);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПослеДобавленияДопСтрНаСервере(ИмяТекущейСтраницыПанели)
	
	ОчиститьТабличноеПолеНаСервере(ИмяТекущейСтраницыПанели);
	
	СохранитьДанныеМногостраничногоРазделаВактивнойСтраницеНаСервере(ИмяТекущейСтраницыПанели);
	
	ПослеВставкиДополнительнойСтраницыНаСервере(ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

&НаСервере
Процедура ПослеВставкиДополнительнойСтраницыНаСервере(ИмяТекущейСтраницыПанели)
	
	Если ИмяТекущейСтраницыПанели = "Раздел2" Тогда
		ИзменитьЦветЯчеекНаСервере();
	КонецЕсли;
	
	РегламентированнаяОтчетность.ПослеВставкиДополнительнойСтраницыНаСервере(ЭтаФорма, ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеМногостраничногоРазделаВактивнойСтраницеНаСервере(ИмяТекущейСтраницыПанели)
	
	РегламентированнаяОтчетностьКлиентСервер.СохранитьДанныеМногостраничногоРазделаВактивнойСтранице(
	ЭтаФорма, ИмяТекущейСтраницыПанели, Истина);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтраницуНаСервере(ИмяТекущейСтраницыПанели = Неопределено, НомерУдаляемойСтраницы = Неопределено)
	
	Перем ТаблицаСтраницРаздела;
	Перем МассивВариантовЗаполненияСтраниц;
	
	РегламентированнаяОтчетность.УдалитьДополнительнуюСтраницуНаСервере(ЭтаФорма, ИмяТекущейСтраницыПанели);
	
	Если НомерУдаляемойСтраницы <> Неопределено
		И мСтруктураМногостраничныхРазделов.Свойство(ИмяТекущейСтраницыПанели, ТаблицаСтраницРаздела)
		И мСтруктураВариантыЗаполнения.Свойство(ИмяТекущейСтраницыПанели, МассивВариантовЗаполненияСтраниц) Тогда
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		МассивВариантовЗаполненияСтраниц = ЭтаФорма["ТаблицаВариантыЗаполнения" + ИмяТекущейСтраницыПанели];
		
		МассивВариантовЗаполненияСтраниц.Удалить(НомерУдаляемойСтраницы);
		
		КолСтраниц = ТаблицаСтраницРаздела.Количество();
		КолВариантов = МассивВариантовЗаполненияСтраниц.Количество();
		
		Для Инд = КолСтраниц + 1 По КолВариантов Цикл
			
			МассивВариантовЗаполненияСтраниц.Удалить(МассивВариантовЗаполненияСтраниц.Количество() - 1);
			
		КонецЦикла;
		
	КонецЕсли;
	
	РасчетНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	#Если ВебКлиент Тогда
		ВставитьДополнительнуюСтрокуНаСервере();
	#Иначе
		ВставитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ТекТабличноеПоле = ЭтаФорма["ТабличныйДокумент"];
	
	ТекущаяОбласть = ТекТабличноеПоле.ТекущаяОбласть;
	
	ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(ЭтаФорма, ТекущаяОбласть);
	
	Если ИмяГруппы = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='Не выбрана удаляемая строка многострочного раздела.';ru='Не выбрана удаляемая строка многострочного раздела.'");
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтрокуЗавершение", ЭтотОбъект);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='Удалить выбранную строку?';ru='Удалить выбранную строку?'"), Символы.ПС);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		УдалитьДополнительнуюСтрокуНаСервере();
	#Иначе
		УдалитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтрокуНаСервере()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьДополнительнуюСтрокуНаКлиенте()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьДополнительнуюСтроку(Форма, ИмяГруппыБлока = Неопределено, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем СтруктураГруппы;
	Перем МаксимальноеКоличествоСтрокГруппы;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		#Если НаКлиенте Тогда
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#Иначе
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#КонецЕсли
		
		Если ИмяГруппы = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ka='არჩეული არ არის მრავალსტრიქონიანი ნაწილი, რომელშიც საჭიროა სტრიქონის დამატება.';ru='Не выбран многострочный раздел, в который необходимо добавить строку.'");
			Сообщение.Сообщить();
			Возврат;
			
		КонецЕсли;
	Иначе
		ИмяГруппы = ИмяГруппыБлока;
	КонецЕсли;
	
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, МаксимальноеКоличествоСтрокГруппы);

	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];

	// определяем последнюю строку многострочной группы
	КолСтрок = СтруктураГруппы.Количество();
	КолСтрокСтр = Формат(КолСтрок, "ЧГ=0");
	
	Если ИмяГруппы = "П00050000" Тогда
		
		ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "3003_" + КолСтрокСтр;
		
	ИначеЕсли СтрДлина(ИмяГруппы) = 9 Тогда
		
		Если ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М1 Тогда
			
			ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "1003_" + КолСтрокСтр;
			
		ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М2 Тогда
			
			ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "6003_" + КолСтрокСтр;
			
		ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М3 Тогда
			
			ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "9003_" + КолСтрокСтр;
			
		ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М1 Тогда
			
			ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "1003_" + КолСтрокСтр;
			
		ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М2 Тогда
			
			ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "7003_" + КолСтрокСтр;
			
		ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М3 Тогда
			
			ИмяПервойЯчейкиПоследнейСтроки = Лев(ИмяГруппы, 8) + "11003_" + КолСтрокСтр;
			
		Иначе
			
			ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "1003_" + КолСтрокСтр;
			
		КонецЕсли;
		
	Иначе
		
		ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "01_" + КолСтрокСтр;
		
	КонецЕсли;

	// область первой ячейки последней строки многострочного раздела
	ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиПоследнейСтроки];

	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// номера строк исходной области
	НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
	НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
	СдвигСтрок = НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти + 1;

	// номера строк вставляемой области
	НомерВерхЯчейкиНовойОбласти = НомерВерхЯчейкиОбласти + СдвигСтрок;
	НомерНижнЯчейкиНовойОбласти = НомерНижнЯчейкиОбласти + СдвигСтрок;
	
	НазначитьИмяОбластиМЧ = Ложь;
	ВставляемаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, );
	Если СтрНайти(ВставляемаяОбласть.Имя, "МногострочнаяЧасть") Тогда
		НазначитьИмяОбластиМЧ = Истина;
		ИмяМногострочнойЧасти = ВставляемаяОбласть.Имя;
	КонецЕсли;
	
	Если НЕ СпециальноеДобавление Тогда
		
		РегламентированнаяОтчетностьВызовСервера.ВставитьОбластьВТабличныйДокумент(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	Если НазначитьИмяОбластиМЧ Тогда
		ТекТабличноеПоле.Область(НомерНижнЯчейкиОбласти + 1, , НомерНижнЯчейкиОбласти + (НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти) + 1, ).Имя = "";
		ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, ).Имя = ИмяМногострочнойЧасти;
	КонецЕсли;
	
	КолСтрокСтр1 = Формат(КолСтрок + 1, "ЧГ=0");
	
	Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
		
		Если СтрДлина(ИмяГруппы) = 9 Тогда
			
			Если ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М1 Тогда
				
				ИмяКолонки = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М2 Тогда
				
				ИмяКолонки = ИмяГруппы + Формат((НомерГрафы + 5) * 10, "ЧЦ=2; ЧВН=") + "03";
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М3 Тогда
				
				ИмяКолонки = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 8) * 10, "ЧЦ=3; ЧВН=") + "03";
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М1 Тогда
				
				ИмяКолонки = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М2 Тогда
				
				ИмяКолонки = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 6) * 10, "ЧЦ=3; ЧВН=") + "03";
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М3 Тогда
				
				ИмяКолонки = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 10) * 10, "ЧЦ=3; ЧВН=") + "03";
				
			Иначе
				
				ИмяКолонки = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
				
			КонецЕсли;
			
		Иначе
			
			ИмяКолонки = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
			
		КонецЕсли;
		
		// переопределяем имена вставленной области
		Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
			
			ИмяОбластиЯчейки    = ИмяКолонки + "_" + КолСтрокСтр;
			ИмяНовОбластиЯчейки = ИмяКолонки + "_" + КолСтрокСтр1;
			
			ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];
			ОбластьЯчейки.Имя = ИмяНовОбластиЯчейки;
			
			Если (ИмяГруппы = "П00050000" И НомерГрафы = 3)
			 ИЛИ (НомерГрафы = 1) Тогда
				ТекТабличноеПоле.Области["УдалитьСтроку" + ИмяОбластиЯчейки].Имя = "УдалитьСтроку" + ИмяНовОбластиЯчейки;
			КонецЕсли;
			
			// определяем границы ячейки исходной области
			НомерВерхСтрокиЯчейки  = ОбластьЯчейки.Верх - СдвигСтрок;
			НомерНижнСтрокиЯчейки  = ОбластьЯчейки.Низ  - СдвигСтрок;
			НомерЛевоКолонкиЯчейки = ОбластьЯчейки.Лево;
			НомерПравКолонкиЯчейки = ОбластьЯчейки.Право;
			
			// Назначаем имя ячейки исходной области,
			// (т.к. в результате вставки новой области оно было очищено)
			ОбластьЯчейкиИсходнойОбласти = ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки);
			ОбластьЯчейкиИсходнойОбласти.Имя = ИмяОбластиЯчейки;
			
			Если (ИмяГруппы = "П00050000" И НомерГрафы = 3)
			 ИЛИ (НомерГрафы = 1) Тогда
				
				Если СтрДлина(ИмяГруппы) = 9 Тогда
					ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 3, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки - 3).Имя  = "УдалитьСтроку" + ИмяОбластиЯчейки;
				Иначе
					ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки - 1).Имя  = "УдалитьСтроку" + ИмяОбластиЯчейки;
				КонецЕсли;
				
			КонецЕсли;
			
			// очищаем значения ячеек вставленной области
			Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
				ОбластьЯчейки.Очистить();
			КонецЕсли;
			
			Если ИмяКолонкиНомера <> Неопределено Тогда
				Если ИмяКолонкиНомера = ИмяКолонки Тогда
					Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
						ОбластьЯчейки.Значение = КолСтрокСтр1;
					Иначе
						ОбластьЯчейки.Текст = КолСтрокСтр1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		
		Если ИмяГруппы = "П00050000" Тогда
		
			ИмяТекущейОбласти = ИмяГруппы + "3003_" + КолСтрокСтр;
		
		ИначеЕсли СтрДлина(ИмяГруппы) = 9 Тогда
			
			Если ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М1 Тогда
				
				ИмяТекущейОбласти = ИмяГруппы + "1003_" + КолСтрокСтр;
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М2 Тогда
				
				ИмяТекущейОбласти = ИмяГруппы + "6003_" + КолСтрокСтр;
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М3 Тогда
				
				ИмяТекущейОбласти = ИмяГруппы + "9003_" + КолСтрокСтр;
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М1 Тогда
				
				ИмяТекущейОбласти = ИмяГруппы + "1003_" + КолСтрокСтр;
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М2 Тогда
				
				ИмяТекущейОбласти = ИмяГруппы + "7003_" + КолСтрокСтр;
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М3 Тогда
				
				ИмяТекущейОбласти = Лев(ИмяГруппы, 8) + "11003_" + КолСтрокСтр;
				
			Иначе
				
				ИмяТекущейОбласти = ИмяГруппы + "1003_" + КолСтрокСтр;
				
			КонецЕсли;
			
		Иначе
			
			ИмяТекущейОбласти = ИмяГруппы + "01_" + КолСтрокСтр1;
			
		КонецЕсли;
		
		Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
		
		// установим фокус на поле табличн. документа
		ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
		
	КонецЕсли;
	
	// добавляем в структуру многострочной группы новую строку
	СтруктураГруппы.Добавить();
	
	Если ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М1
		ИЛИ ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М2
		ИЛИ ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М3
		ИЛИ ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М1
		ИЛИ ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М2
		ИЛИ ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М3 Тогда
		
		НачалоИмениПоказателя = Лев(ИмяГруппы, 8);
		
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрНачинаетсяС(ОбластьТД.Имя, "УдалитьСтроку" + НачалоИмениПоказателя) Тогда
				ОбластьТД.Гиперссылка = Истина;
				ОбластьТД.Текст = "х";
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
				ОбластьТД.Гиперссылка = Истина;
				ОбластьТД.Текст = "х";
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтрокуНаСервере()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДополнительнуюСтрокуНаКлиенте()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДополнительнуюСтроку(Форма, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем ИсходноеКоличествоСтрокГруппы;
	Перем СтруктураГруппы;
	
	ТекущаяСтраница = Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	ТекТабличноеПоле = Форма.ТабличныйДокумент;
	
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	#Если НаКлиенте ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(Форма, ТекущаяОбласть);
	#Иначе
		ИмяГруппы = РегламентированнаяОтчетностьВызовСервера.РазделТекущейОбластиНаСервере(Форма, ТекущаяОбласть);
	#КонецЕсли
	
	// исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];
	
	// Выполним также проверку вхождения текущей (выделенной) ячейки в многострочный раздел
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	ИмяЯчейки = ТекущаяОбласть.Имя;
	
	// номер строки многострочного раздела определим
	// по имени выделенной ячейки
	НомУдаляемойСтроки = Число(Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки, "_") + 1));
	НомерСтрокиТаблицы = НомУдаляемойСтроки - 1; // нумерация строк в таблице значений начинается с нуля
	
	Если СтруктураГруппы.Количество() > ИсходноеКоличествоСтрокГруппы Тогда
		
		Если ИмяГруппы = "П00050000" Тогда
			
			ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "3003_" + Формат(НомУдаляемойСтроки, "ЧГ=0");
			
		ИначеЕсли СтрДлина(ИмяГруппы) = 9 Тогда
			
			Если ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М1 Тогда
				
				ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "1003_" + Формат(НомУдаляемойСтроки, "ЧГ=0");
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М2 Тогда
				
				ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "6003_" + Формат(НомУдаляемойСтроки, "ЧГ=0");
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М3 Тогда
				
				ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "9003_" + Формат(НомУдаляемойСтроки, "ЧГ=0");
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М1 Тогда
				
				ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "1003_" + Формат(НомУдаляемойСтроки, "ЧГ=0");
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М2 Тогда
				
				ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "7003_" + Формат(НомУдаляемойСтроки, "ЧГ=0");
				
			ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М3 Тогда
				
				ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + Лев(ИмяГруппы, 8) + "11003_" + Формат(НомУдаляемойСтроки, "ЧГ=0");
				
			Иначе
				
				ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "1003_" + Формат(НомУдаляемойСтроки, "ЧГ=0");
				
			КонецЕсли;
			
		Иначе
			
			ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомУдаляемойСтроки, "ЧГ=0");
			
		КонецЕсли;
		
		// область первой ячейки удаляемой строки многострочного раздела
		ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиУдаляемойСтроки];
		
		НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
		ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
		
		НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
		НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
		МногострочностьВРазделе = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе");
		МногострочностьВРазделеТип = ТипЗнч(МногострочностьВРазделе);
		Если МногострочностьВРазделеТип = Тип("Число") Тогда
			ИмяОбластиМнгЧ = "МногострочнаяЧасть";
		ИначеЕсли МногострочностьВРазделеТип = Тип("ДанныеФормыКоллекция") Тогда
			ИмяОбластиМнгЧ = МногострочностьВРазделе.НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0].Область;
		КонецЕсли;
		// Найдем координаты области, для последующего восстановления.
		
		Если ТекТабличноеПоле.Области.Найти(ИмяОбластиМнгЧ) <> Неопределено Тогда
			ОбластьВерх = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Верх;
			ОбластьНиз = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Низ;
		КонецЕсли;
		
		Если СпециальноеДобавление Тогда
			
		Иначе
			
			РегламентированнаяОтчетностьВызовСервера.УдалитьОбластьИзТабличногоДокумента(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
			
			Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
			
		КонецЕсли;
		// Восстановим область.
		ТекТабличноеПоле.Область(ОбластьВерх, 0, ОбластьНиз, 0).Имя = ИмяОбластиМнгЧ;
		
		КолвоСдвигаемыхСтрок = СтруктураГруппы.Количество() - НомУдаляемойСтроки;
		
		// обновим имена ячеек сдвинутых строк
		Если КолвоСдвигаемыхСтрок > 0 Тогда
			
			Для НСтр = НомУдаляемойСтроки + 1 По СтруктураГруппы.Количество() Цикл
				
				ТекСтрока = СтруктураГруппы[НСтр - 1];
				
				НСтрСтр = Формат(НСтр, "ЧГ=0");
				НСтрСтр1 = Формат(НСтр - 1, "ЧГ=0");
				
				Для НомерГрафы = 0 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
					
					Если НомерГрафы = 0 Тогда
						
						Если ИмяГруппы = "П00050000" Тогда
							
							КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + "3003";
							
						ИначеЕсли СтрДлина(ИмяГруппы) = 9 Тогда
							
							Если ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М1 Тогда
								
								КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + "1003";
								
							ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М2 Тогда
								
								КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + "6003";
								
							ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М3 Тогда
								
								КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + "9003";
								
							ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М1 Тогда
								
								КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + "1003";
								
							ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М2 Тогда
								
								КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + "7003";
								
							ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М3 Тогда
								
								КолонкаИмя = "УдалитьСтроку" + Лев(ИмяГруппы, 8) + "11003";
								
							Иначе
								
								КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + "1003";
								
							КонецЕсли;
							
						Иначе
							
							КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + Формат( 1, "ЧЦ=2; ЧВН=");
							
						КонецЕсли;
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
					Если СтрДлина(ИмяГруппы) = 9 Тогда
						
						Если ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М1 Тогда
							
							КолонкаИмя = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
							
						ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М2 Тогда
							
							КолонкаИмя = ИмяГруппы + Формат((НомерГрафы + 5) * 10, "ЧЦ=2; ЧВН=") + "03";
							
						ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М3 Тогда
							
							КолонкаИмя = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 8) * 10, "ЧЦ=3; ЧВН=") + "03";
							
						ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М1 Тогда
							
							КолонкаИмя = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
							
						ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М2 Тогда
							
							КолонкаИмя = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 6) * 10, "ЧЦ=3; ЧВН=") + "03";
							
						ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М3 Тогда
							
							КолонкаИмя = Лев(ИмяГруппы, 8) + Формат((НомерГрафы + 10) * 10, "ЧЦ=3; ЧВН=") + "03";
							
						Иначе
							
							КолонкаИмя = ИмяГруппы + Формат((НомерГрафы) * 10, "ЧЦ=2; ЧВН=") + "03";
							
						КонецЕсли;
						
					Иначе
						
						КолонкаИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
						
					КонецЕсли;
					
					Если СтруктураГруппы[0].Свойство(КолонкаИмя) Тогда
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		
		// обновляем структуру многострочного раздела
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	Иначе
		// строка не удаляется в форме табличного документа,
		// а должна осуществляться сдвиг строк
		
		// обновляем структуру многострочного раздела
		// методом удаления выбранной строки и добавления пустой строки
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		// обновляем порядковые номера строк, выводимых в табличный документ
		Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
			
			НомерСтрокиВТаблице = СтруктураГруппы.Индекс(СтрокаТаблицы);
			НомерСтрокиВФормеТаблицы = Формат(НомерСтрокиВТаблице + 1, "ЧГ=0");
			
			Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				
				Если ИмяГруппы = "П00050000" Тогда
					
					КолонкаТаблицыИмя = ИмяГруппы + "3003";
					
				ИначеЕсли СтрДлина(ИмяГруппы) = 9 Тогда
					
					Если ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М1 Тогда
						
						КолонкаТаблицыИмя = ИмяГруппы + "1003";
						
					ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М2 Тогда
						
						КолонкаТаблицыИмя = ИмяГруппы + "6003";
						
					ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М3 Тогда
						
						КолонкаТаблицыИмя = ИмяГруппы + "9003";
						
					ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М1 Тогда
						
						КолонкаТаблицыИмя = ИмяГруппы + "1003";
						
					ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М2 Тогда
						
						КолонкаТаблицыИмя = ИмяГруппы + "7003";
						
					ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М3 Тогда
						
						КолонкаТаблицыИмя = Лев(ИмяГруппы, 8) + "11003";
						
					Иначе
						
						КолонкаТаблицыИмя = ИмяГруппы + "1003";
						
					КонецЕсли;
					
				Иначе
					
					КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
					
				КонецЕсли;
				
				Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
					
					Если ИмяКолонкиНомера <> Неопределено Тогда
						Если ИмяКолонкиНомера = КолонкаТаблицыИмя Тогда
							// обновляем порядковый номер строки
							СтрокаТаблицы[КолонкаТаблицыИмя] = НомерСтрокиВФормеТаблицы;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		#Если НаКлиенте Тогда
			Форма.ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы);
		#Иначе
			Форма.ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы);
		#КонецЕсли
		
	КонецЕсли;
	
	НомТекущейСтроки = Мин(НомУдаляемойСтроки, СтруктураГруппы.Количество());
	
	Если ИмяГруппы = "П00050000" Тогда
		
		ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "3003_" + Формат(НомТекущейСтроки, "ЧГ=0");
		
	ИначеЕсли СтрДлина(ИмяГруппы) = 9 Тогда
		
		Если ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М1 Тогда
			
			ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "1003_" + Формат(НомТекущейСтроки, "ЧГ=0");
			
		ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М2 Тогда
			
			ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "6003_" + Формат(НомТекущейСтроки, "ЧГ=0");
			
		ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М3 Тогда
			
			ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "9003_" + Формат(НомТекущейСтроки, "ЧГ=0");
			
		ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М1 Тогда
			
			ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "1003_" + Формат(НомТекущейСтроки, "ЧГ=0");
			
		ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М2 Тогда
			
			ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "7003_" + Формат(НомТекущейСтроки, "ЧГ=0");
			
		ИначеЕсли ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М3 Тогда
			
			ИмяТекущейОбласти = "УдалитьСтроку" + Лев(ИмяГруппы, 8) + "11003_" + Формат(НомТекущейСтроки, "ЧГ=0");
			
		Иначе
			
			ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "1003_" + Формат(НомТекущейСтроки, "ЧГ=0");
			
		КонецЕсли;
		
	Иначе
		
		ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомТекущейСтроки, "ЧГ=0");
		
	КонецЕсли;
	
	Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
	
	ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
	
	ЕстьДопСтроки = Ложь;
	
	Если ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М1
		ИЛИ ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М2
		ИЛИ ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы4М3
		ИЛИ ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М1
		ИЛИ ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М2
		ИЛИ ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппы6М3 Тогда
		
		НачалоИмениПоказателя = Лев(ИмяГруппы, 8);
		
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрНачинаетсяС(ОбластьТД.Имя, НачалоИмениПоказателя) Тогда
				Если СтрНайти(ОбластьТД.Имя, "_2", , 14) > 0 Тогда
					ЕстьДопСтроки = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЕстьДопСтроки Тогда
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрНачинаетсяС(ОбластьТД.Имя, "УдалитьСтроку" + НачалоИмениПоказателя) Тогда
					ОбластьТД.Гиперссылка = Ложь;
					ОбластьТД.Текст = "";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
				ЕстьДопСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЕстьДопСтроки Тогда
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Ложь;
					ОбластьТД.Текст = "";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
	Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел5" Тогда
		РегламентированнаяОтчетностьКлиентСервер.СохранитьДанныеМногостраничногоРазделаВактивнойСтранице(Форма, Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь);
	КонецЕсли;
	
	#Если НаКлиенте Тогда
		Форма.РасчетНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	#Иначе
		Форма.РасчетНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка)
	
	Если РегламентированнаяОтчетностьКлиент.ВыбраннаяОбластьРегламентированногоОтчетаНеВерна(ЭтаФорма, Область, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЯчейки = Область.Имя;
	
	Если Лев(ИмяЯчейки, 7) = "КодИМНС" Тогда
		СтандартнаяОбработка = Ложь;
		ОбработкаВыбораИФНС();
		Возврат;
	КонецЕсли;
	
	Если СтрНачинаетсяС(Область.Имя, "П000310007001")
		ИЛИ Область.Имя = "П000500001003" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокГодов = Новый СписокЗначений;
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ПервоеЧисло", Год(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
		Если СтрНачинаетсяС(Область.Имя, "П000310007001") Тогда
			СтруктураПараметров.Вставить("ПоследнееЧисло", 2006);
		Иначе
			СтруктураПараметров.Вставить("ПоследнееЧисло", 1900);
		КонецЕсли;
		СтруктураПараметров.Вставить("ТипСтрока", Истина);
		
		СписокГодов.ЗагрузитьЗначения(МассивЧиселЗаданныйИнтервалом(СтруктураПараметров));
		
		СписокГодов.Вставить(0, "", "Пустое значение");
		
		Оп = Новый ОписаниеОповещения("ВыбратьЧислоИзСпискаЗавершение", ЭтотОбъект, Область);
		
		Элементы.ТабличныйДокумент.Доступность = Ложь;
		
		ПоказатьВыборИзСписка(Оп, СписокГодов, Элементы.ТабличныйДокумент.ТекущаяОбласть,
		СписокГодов.НайтиПоЗначению(СокрЛП(Область.Значение)));
		
	КонецЕсли;
	
	ПараметрВводаПоля = РегламентированнаяОтчетностьКлиентСервер.НайтиСвойстваПоказателя(ЭтаФорма, ИмяЯчейки);
	
	Если ПараметрВводаПоля <> Неопределено И ПараметрВводаПоля.ТаблицаЗначений.Количество() > 0 Тогда
		
		КодПоказателя = ПараметрВводаПоля.Показатель;
		
		КопироватьДанныеФормы(ПараметрВводаПоля.ТаблицаЗначений, ТЗВыбора);
		
		ТребРезультат = 0;
		
		Если КодПоказателя = "Период" Тогда
			
			НомерКвартала = Число(Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=к"));
			
			ТребРезультат = НомерКвартала;
			
		КонецЕсли;
		
		Если ТребРезультат <> 0 Тогда
			РазмерТЗ = ТЗВыбора.Количество();
			Для Сч = 1 По РазмерТЗ Цикл
				ЭлементТЗ = ТЗВыбора[РазмерТЗ - Сч];
				Рез = ?(ЭлементТЗ.РезультатПроверки = "", 0, Число(ЭлементТЗ.РезультатПроверки));
				Если Рез <> 0 И Рез <> ТребРезультат Тогда
					ТЗВыбора.Удалить(ЭлементТЗ);
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
		
		ВвестиПоказатель(Элемент, Область, КодПоказателя, Ложь, ПараметрВводаПоля.ТекстПриВыборе, ТЗВыбора, СтандартнаяОбработка);
		
	Иначе
		Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
			УстановитьДоступностьОбластей(ЭтаФорма, "Титульный");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если ТабличныйДокумент.Области.Найти("ПерейтиКПомощнику") <> Неопределено Тогда
		Если Область.Верх = ТабличныйДокумент.Области.ПерейтиКПомощнику.Верх Тогда
			СтандартнаяОбработка = Ложь;
			РегламентированнаяОтчетностьКлиентПереопределяемый.ОткрытьФормуПомощникаПоУчетуНДС(Область.Расшифровка);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка);
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
		Если Область.Имя = "ОрганизацииДляЗаполненияОтчета" И Область.Гиперссылка Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("НачальноеЗначениеВыбора", Новый Структура("Организация", СтруктураРеквизитовФормы.Организация));
			ПараметрыФормы.Вставить("Организация", СтруктураРеквизитовФормы.ГруппаОрганизаций);
			
			ФормаВыбораОрганизаций = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("ФормаВыбораОрганизаций", ПараметрыФормы, ЭтаФорма);
			ФормаВыбораОрганизаций.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			ФормаВыбораОрганизаций.Открыть();
			
		КонецЕсли;
		УстановитьДоступностьОбластей(ЭтаФорма, "Титульный");
	КонецЕсли;
	
	Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтраницу") > 0 Тогда
		ДобавитьСтраницу("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтраницу") > 0 И Область.Гиперссылка Тогда
		УдалитьСтраницу("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "ДобавитьСтроку") > 0 Тогда
		ДобавитьСтроку("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтроку") > 0 И Область.Гиперссылка Тогда
		УдалитьСтроку("");
	КонецЕсли;
	
	Если РегламентированнаяОтчетностьКлиент.ВыбраннаяОбластьРегламентированногоОтчетаНеВерна(
		ЭтаФорма, Область, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЧислоИзСпискаЗавершение(ВыбЭлемент, ДополнительныйПараметр) Экспорт
	
	Если ВыбЭлемент <> Неопределено Тогда
		Если ВыбЭлемент.Значение <> ДополнительныйПараметр.Значение Тогда
			ДополнительныйПараметр.Значение = ВыбЭлемент.Значение;
			Если СтрНачинаетсяС(ДополнительныйПараметр.Имя, "П000310007") Тогда
				УстановитьФорматВыводаВПоляхВвода(ЭтаФорма, "Раздел3_Прил1");
			КонецЕсли;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ТабличныйДокумент.Доступность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция МассивЧиселЗаданныйИнтервалом(СтруктураПараметров)
	
	МассивЧисел = Новый Массив;
	
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		
		ПервоеЧисло    = Неопределено;
		ПоследнееЧисло = Неопределено;
		
		Если СтруктураПараметров.Свойство("ПервоеЧисло", ПервоеЧисло)
			И СтруктураПараметров.Свойство("ПоследнееЧисло", ПоследнееЧисло) Тогда
			
			Если ПервоеЧисло <= ПоследнееЧисло Тогда
				ПоУбыванию = Ложь;
			Иначе
				ПоУбыванию = Истина;
				ПромежуточноеЗначение = ПервоеЧисло;
				ПервоеЧисло = ПоследнееЧисло;
				ПоследнееЧисло = ПромежуточноеЗначение;
			КонецЕсли;
			
			ТипСтрока = Ложь;
			СтруктураПараметров.Свойство("ТипСтрока", ТипСтрока);
			ТипСтрока = ТипСтрока = Истина;
			
			ДлинаСЛидирующимиНулями = Неопределено;
			СтруктураПараметров.Свойство("ДлинаСЛидирующимиНулями", ДлинаСЛидирующимиНулями);
			Если ТипЗнч(ДлинаСЛидирующимиНулями) <> Тип("Число")
				ИЛИ ДлинаСЛидирующимиНулями = 0 Тогда
				ДлинаСЛидирующимиНулями = Неопределено;
			КонецЕсли;
			
			Для ТекущееЧисло = ПервоеЧисло По ПоследнееЧисло Цикл
				
				Если ДлинаСЛидирующимиНулями <> Неопределено Тогда
					СтрокаФормата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						"ЧЦ=%1;ЧГ=;ЧВН=", ДлинаСЛидирующимиНулями);
					ТекущееЗначение = Формат(ТекущееЧисло, СтрокаФормата);
				ИначеЕсли ТипСтрока Тогда
					ТекущееЗначение = Формат(ТекущееЧисло, "ЧГ=");
				Иначе
					ТекущееЗначение = ТекущееЧисло;
				КонецЕсли;
				
				Если ПоУбыванию Тогда
					МассивЧисел.Вставить(0, ТекущееЗначение);
				Иначе
					МассивЧисел.Добавить(ТекущееЗначение);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивЧисел;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИзмененияСодержимогоВПолеТабличногоДокумента(Элемент, Область)
	
	Модифицированность = Истина;
	
	ПараметрВводаПоля = СвойстваПоказателей.НайтиСтроки(Новый Структура("Показатель", Область.Имя));
	
	Если ПараметрВводаПоля.Количество() > 0 Тогда
		
		ПараметрВводаПоля = ПараметрВводаПоля[0];
		
		Если ПараметрВводаПоля.Тип = "ОКТМО" И ЗначениеЗаполнено(Область.Значение) Тогда
			ДлинаЗначения = СтрДлина(СокрЛП(Область.Значение));
			Для Инд = ДлинаЗначения+1 По 11 Цикл
				Область.Значение = СокрЛП(Область.Значение) + "0";
			КонецЦикла;
		КонецЕсли;
		
		Если СтрДлина(СокрЛП(Область.Значение)) <> 0 И ПараметрВводаПоля.Длина <> 0 И СтрДлина(СокрЛП(Область.Значение)) <> ПараметрВводаПоля.Длина Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='Длина значения показателя должна быть равна %1!';ru='Длина значения показателя должна быть равна %1!'"), ПараметрВводаПоля.Длина);
			Сообщение.Сообщить();
		КонецЕсли;
	
	КонецЕсли;
	
	Если Область.Имя = "ОКВЭД" Тогда
		
		Если НЕ РегламентированнаяОтчетностьКлиентСервер.ОКВЭДСоответствуетТребованиям(Область.Значение) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='На титульном листе задано некорректное значение кода вида деятельности по ОКВЭД!%1Допустимы значения, соответствующие следующим шаблонам:%2""XX"", ""XX.X"", ""XX.XX"", ""XX.XX.X"", ""XX.XX.XX"" (X - любая цифра).';ru='На титульном листе задано некорректное значение кода вида деятельности по ОКВЭД!%1Допустимы значения, соответствующие следующим шаблонам:%2""XX"", ""XX.X"", ""XX.XX"", ""XX.XX.X"", ""XX.XX.XX"" (X - любая цифра).'"), Символы.ПС, Символы.ПС);
			Сообщение.Сообщить();
		КонецЕсли;
		
	ИначеЕсли Область.Имя = "НомерКорректировки" Тогда
		
		НомерКорректировки = ТабличныйДокумент.Области.НомерКорректировки.Значение;
		
		СтруктураРеквизитовФормы.ВидДокумента = ?(Область.Значение = 0, 0, 1);
		
		УстановитьДоступностьПризнакаАктуальностиРанееОтправленныхСведений();
		
		РегламентированнаяОтчетностьКлиентСервер.УстановитьЗначениеОКВЭД(
		ДатаПодписи, СтруктураРеквизитовФормы, ТабличныйДокумент.Области.ОКВЭД.Значение);
		
		Модифицированность = Истина;
		
	ИначеЕсли Область.Имя = "ДатаПодписи" Тогда
		
		ДатаПодписи = ТабличныйДокумент.Области.ДатаПодписи.Значение;
		ЗаполнитьСведенияОбОрганизацииНаСервере(Истина);
		Модифицированность = Истина;
		
	КонецЕсли;
	
	ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	Если ИмяРаздела = "Раздел1"
		ИЛИ ИмяРаздела = "Раздел2"
		ИЛИ ИмяРаздела = "Раздел3"
		ИЛИ ИмяРаздела = "Раздел3_Прил1"
		ИЛИ ИмяРаздела = "Раздел3_Прил2"
		ИЛИ ИмяРаздела = "Раздел4"
		ИЛИ ИмяРаздела = "Раздел5"
		ИЛИ ИмяРаздела = "Раздел6"
		ИЛИ ИмяРаздела = "Раздел7" Тогда
		
		ИмяОбласти = Область.Имя;
		
		ПозицияПодстроки = СтрНайти(ИмяОбласти, "_");
		
		Если ПозицияПодстроки > 0 Тогда
			ИмяОбласти = Лев(ИмяОбласти, ПозицияПодстроки - 1);
		КонецЕсли;
		
		Если ИмяРаздела = "Раздел5" Тогда
			РегламентированнаяОтчетностьКлиентСервер.СохранитьДанныеМногостраничногоРазделаВактивнойСтранице(
			ЭтаФорма, ИмяРаздела, Ложь);
		КонецЕсли;
		
		Если СтрНачинаетсяС(Область.Имя, "П000310007") Тогда
			УстановитьФорматВыводаВПоляхВвода(ЭтаФорма, "Раздел3_Прил1");
		КонецЕсли;
		
		РасчетНаКлиенте(ИмяРаздела, ИмяОбласти);
		
	ИначеЕсли ИмяРаздела = "Титульный" Тогда
		
		УстановитьДоступностьОбластей(ЭтаФорма, "Титульный");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеСменыЕдИзмеренияИТочности()
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	ПроверитьТочность();
	
	УстановитьФорматВыводаВПоляхВводаНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	РасчетНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьТочность()
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1 Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 2 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='%1: при выводе сумм в рублях точность не может превышать 2 знака';ru='%1: при выводе сумм в рублях точность не может превышать 2 знака'"), ЭтаФорма.Заголовок);
			Сообщение.Сообщить();
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
			
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000 Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 3 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='%1: при выводе сумм в тысячах рублей точность не может превышать 3 знака';ru='%1: при выводе сумм в тысячах рублей точность не может превышать 3 знака'"), ЭтаФорма.Заголовок);
			Сообщение.Сообщить();
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 3;
			
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000000 Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 6 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='%1: при выводе сумм в миллионах рублей точность не может превышать 6 знаков';ru='%1: при выводе сумм в миллионах рублей точность не может превышать 6 знаков'"), ЭтаФорма.Заголовок);
			Сообщение.Сообщить();
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 6;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	
	ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)
	Перем ТекущийРазделОтчетаСокрНаим;
	Перем НомерСтраницыРазделаОтчета;
	
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("ПроверкаСоотношений", Ложь);
	мПараметры.Вставить("Автосохранение", Ложь);
	мПараметры.Вставить("ИмеетсяРеквизитДеревоВыбранныхСтраниц", Истина);
	
	Если СтруктураРеквизитовФормы.ОтображатьКнопкуРасшифровать Тогда
		мПараметры.Вставить("СохранятьРасшифровкуАвтозаполнения", Истина);
	КонецЕсли;
	
	Если СтруктураРеквизитовФормы.ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417 Тогда
		мПараметры.Вставить("РазрешитьВстроеннуюПечать", Истина);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФлажокОтклАвтоРасчет",                    СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);
	ПараметрыФормы.Вставить("мПечатьБезШтрихкодаРазрешена",            СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена);
	ПараметрыФормы.Вставить("мСчетчикСтраниц",                         СтруктураРеквизитовФормы.мСчетчикСтраниц);
	ПараметрыФормы.Вставить("мАвтоВыборКодов",                         СтруктураРеквизитовФормы.мАвтоВыборКодов);
	ПараметрыФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки", СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения",                        СтруктураРеквизитовФормы.ЕдиницаИзмерения);
	ПараметрыФормы.Вставить("ТочностьЕдиницыИзмерения",                СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения);
	ПараметрыФормы.Вставить("СохранятьРасшифровкуАвтозаполнения",      СтруктураРеквизитовФормы.мСохранятьРасшифровку);
	ПараметрыФормы.Вставить("мПараметры",                              мПараметры);
	
	ФормаНастройкиОтчета = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	
	КопироватьДанныеФормы(мДеревоСтраницОтчета, ФормаНастройкиОтчета.Дерево);
	
	ЗначениеАвторасчета = СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет;
	ЗначениеЕдИзм       = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ЗначениеЗпт         = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	
	ДополнительныеПараметры = Новый Структура(
	"ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим",
	ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраницЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраницЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ЗначениеАвторасчета = ДополнительныеПараметры.ЗначениеАвторасчета;
	ЗначениеЕдИзм = ДополнительныеПараметры.ЗначениеЕдИзм;
	ЗначениеЗпт = ДополнительныеПараметры.ЗначениеЗпт;
	НомерСтраницыРазделаОтчета = ДополнительныеПараметры.НомерСтраницыРазделаОтчета;
	ТекущийРазделОтчетаСокрНаим = ДополнительныеПараметры.ТекущийРазделОтчетаСокрНаим;
	
	РегламентированнаяОтчетностьКлиентСервер.ПоказатьКнопкиПечати(ЭтаФорма);
	Модифицированность = Истина;
	
	флЗначенияИдентичны = Истина;
	
	Для Индекс = 0 По мДеревоСтраницОтчета.ПолучитьЭлементы().Количество() - 1 Цикл
		
		Если НЕ мДеревоСтраницОтчета.ПолучитьЭлементы()[Индекс].ПоказатьСтраницу
			= мДеревоВыбранныхСтраниц.ПолучитьЭлементы()[Индекс].ПоказатьСтраницу Тогда
			флЗначенияИдентичны = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеАвторасчета <> СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет Тогда
		
		Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел2" Тогда
			
			ИзменитьЦветЯчеек(ЭтаФорма);
			
		Иначе
			
			#Если ВебКлиент Тогда
				ИзменитьТаблицуВариантовЗаполненияНаСервере();
			#Иначе
				РегламентированнаяОтчетностьКлиентСервер.ИзменитьТаблицуВариантовЗаполнения(
				ЭтаФорма, НЕ СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);
			#КонецЕсли
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЕдИзм <> СтруктураРеквизитовФормы.ЕдиницаИзмерения
		ИЛИ ЗначениеЗпт <> СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения Тогда
		ПослеСменыЕдИзмеренияИТочности();
	КонецЕсли;
	
	// Управляем видимостью страниц основной панели формы
	РегламентированнаяОтчетностьКлиент.ПоказатьСтраницыОтчетаНаКлиенте(ЭтаФорма);
	
	Если НЕ флЗначенияИдентичны Тогда
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
		Если НЕ ТекущийРазделОтчетаСокрНаим = Неопределено Тогда
			
			// Пытаемся найти ранее запомненный раздел.
			НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(
			РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", ТекущийРазделОтчетаСокрНаим);
			
			Если НЕ НайденнаяСтрока = Неопределено 
				И НЕ НомерСтраницыРазделаОтчета = Неопределено 
				И НайденнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
				
				НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(
				НайденнаяСтрока.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСтраницыРазделаОтчета);
				
			КонецЕсли;
			
			// В случае успешного поиска, устанавливаем курсор на найденный раздел.
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьТаблицуВариантовЗаполненияНаСервере()
	
	РегламентированнаяОтчетностьКлиентСервер.ИзменитьТаблицуВариантовЗаполнения(
	ЭтаФорма, НЕ СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);
	
	РегламентированнаяОтчетность.ПолучитьСведенияОПоказателяхОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтчет(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьВесьОтчет");
	
	СтруктураРеквизитовФормы.НомерТекущейСтраницы
	= Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущуюСтраницу(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьТекущуюСтраницуЗавершение", ЭтотОбъект);
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(
	ЭтаФорма, "ОчиститьТекущийЭкземплярМногостраничногоРаздела"
	+ Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим,
	ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущуюСтраницуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел3_Прил1" Тогда
		УстановитьФорматВыводаВПоляхВвода(ЭтаФорма, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(ВыполняемоеОповещение = Неопределено) Экспорт
	
	РегламентированнаяОтчетностьКлиент.Очистить(ЭтаФорма, ВыполняемоеОповещение);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьПоказателиОтчетаЗаполняемыеИзИБНаСервере(ИмяСтраницы)
	
	РегламентированнаяОтчетностьКлиентСервер.ОчиститьПоказателиОтчетаЗаполняемыеИзИБ(ЭтаФорма, ИмяСтраницы);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере() Экспорт
	
	СохрП000100001003 = СтруктураДанныхРаздел1.П000100001003;
	
	СтруктураДанныхРаздел1.Очистить();
	СтруктураДанныхРаздел3.Очистить();
	СтруктураДанныхРаздел3_Прил2.Очистить();
	СтруктураДанныхРаздел4.Очистить();
	СтруктураДанныхРаздел6.Очистить();
	СтруктураДанныхРаздел7.Очистить();
	
	ТаблицаСтраницыРаздела2.Очистить();
	ТаблицаСтраницыРаздела3_Прил1.Очистить();
	ТаблицаСтраницыРаздела5.Очистить();
	
	ОчиститьСведенияРазделаНДС("Раздел8");
	ОчиститьСведенияРазделаНДС("Раздел8_Прил1");
	ОчиститьСведенияРазделаНДС("Раздел9");
	ОчиститьСведенияРазделаНДС("Раздел9_Прил1");
	ОчиститьСведенияРазделаНДС("Раздел10");
	ОчиститьСведенияРазделаНДС("Раздел11");
	ОчиститьСведенияРазделаНДС("Раздел12");
	
	ИнициализацияМногостраничныхРазделов();
	
	Для Каждого мнгРаздел Из мСтруктураМногострочныхРазделов Цикл
		ЭтаФорма[мнгРаздел.Ключ].Очистить();
	КонецЦикла;
	
	НачальныеОперацииСМногострочнымиБлоками();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	Если НЕ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный"
	   И НЕ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "ФизЛица" Тогда
		ОчиститьТабличноеПолеНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	КонецЕсли;
	
	ЗаполнитьОКТМО(ЭтаФорма, СокрЛП(СохрП000100001003));
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела, 1);
	
	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
	РегламентированнаяОтчетностьКлиентСервер.ОчиститьВариантыЗаполнения(ЭтаФорма);
	
	РегламентированнаяОтчетность.ПолучитьСведенияОПоказателяхОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораИФНС()
	
	КодИМНС = СокрЛП(ТабличныйДокумент.Области.КодИМНС.Значение);
	КПП     = СокрЛП(ТабличныйДокумент.Области.КПП1.Значение); 
	ЗначенияДляОтбора = Новый Массив;
	ЗначенияДляОтбора.Добавить(Новый Структура("КодНО, КПП", КодИМНС, КПП));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", СтруктураРеквизитовФормы.Организация);
	ПараметрыФормы.Вставить("ЗначенияДляОтбора", ЗначенияДляОтбора);
	
	ФормаВыбораНалоговогоОргана = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени(
	"ФормаВыбораНалоговогоОргана", ПараметрыФормы, ЭтаФорма);
	
	Если ФормаВыбораНалоговогоОргана.ТаблицаНО.Количество() <> 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораИФНСЗавершение", ЭтотОбъект);
		ФормаВыбораНалоговогоОргана.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
		ФормаВыбораНалоговогоОргана.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбораНалоговогоОргана.Открыть();
		
	ИначеЕсли НЕ ЗначениеЗаполнено(КодИМНС) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ka='Код налогового органа необходимо задать в справочнике ""Организации"".';ru='Код налогового органа необходимо задать в справочнике ""Организации"".'");
		
		Сообщение.Сообщить();
		Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
			УстановитьДоступностьОбластей(ЭтаФорма, "Титульный");
		КонецЕсли;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ka='ინსპექციის ასარჩევად აუცილებელია შესაბამისი ჩანაწერის შეყვანა ცნობარ ""საგადასახადო ორგანოში რეგისტრაციები""-ში';ru='Для выбора инспекции, необходимо завести соответствующую запись в справочнике ""Регистрации в налоговом органе"".'");
		
		Сообщение.Сообщить();
		Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
			УстановитьДоступностьОбластей(ЭтаФорма, "Титульный");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораИФНСЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		ВыбранныйКодНО = РезультатВыбора.КодНО;
		ДлинаКодаНО = СтрДлина(ВыбранныйКодНО);
		
		Для Инд = ДлинаКодаНО + 1 По 4 Цикл
			ВыбранныйКодНО = "0" + ВыбранныйКодНО;
		КонецЦикла;
		
		ТабличныйДокумент.Области["КодИМНС"].Значение = ВыбранныйКодНО;
		
		ТабличныйДокумент.Области["КПП1"].Значение = РезультатВыбора.КПП;
		
		ЗаполнитьСведенияОПодписантахИКодПоОКТМО(РезультатВыбора.Ссылка);
		
		СформироватьСпискиВыбора();
		
		Модифицированность = Истина;
	КонецЕсли;
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
		УстановитьДоступностьОбластей(ЭтаФорма, "Титульный");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПоказатель(Элемент, Область, КодПоказателя, Знач ЭтоСумма, Знач ТекстВыбора, ТаблицаВыбора, СтандартнаяОбработка, КолонкаПоиска = "Код") Экспорт
	
	Если ТаблицаВыбора = Неопределено ИЛИ СтруктураРеквизитовФормы.мАвтоВыборКодов Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Область.Имя = КодПоказателя
		ИЛИ Лев(Область.Имя, СтрНайти(Область.Имя, "_") - 1) = КодПоказателя
		ИЛИ РегламентированнаяОтчетностьКлиентСервер.ПоказательВходитВМногострочнуюЧасть(ЭтаФорма, КодПоказателя) > 0 Тогда
		
		ИсходноеЗначение = ?(ТипЗнч(Область.Значение) = Тип("Строка"), СокрЛП(Область.Значение), Область.Значение);
		
	Иначе
		
		Разделитель = ?(Лев(Область.Имя, СтрДлина(КодПоказателя) + 1) = КодПоказателя + "_", "_", "");
		ИндексОбласти = 1;
		ИсходноеЗначение = "";
		
		Пока ЭтаФорма[ТекущийЭлемент.Имя].Области.Найти(КодПоказателя + Разделитель + Формат(ИндексОбласти, "ЧГ=")) <> Неопределено Цикл
			ИсходноеЗначение = ИсходноеЗначение + Строка(ЭтаФорма[ТекущийЭлемент.Имя].Области[КодПоказателя + Разделитель + Формат(ИндексОбласти, "ЧГ=")].Значение);
			ИндексОбласти = ИндексОбласти + 1;
		КонецЦикла;
		
		ИсходноеЗначение = СокрЛП(ИсходноеЗначение);
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",          ТекстВыбора);
	ПараметрыФормы.Вставить("ТаблицаЗначений",    ТаблицаВыбора);
	ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура(КолонкаПоиска, ИсходноеЗначение));
	
	ДополнительныеПараметры = Новый Структура(
	"ИндексОбласти, КодПоказателя, КолонкаПоиска, Область, Разделитель",
	ИндексОбласти, КодПоказателя, КолонкаПоиска, Область, Разделитель);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиПоказательЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы",
	ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПоказательЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ИндексОбласти = ДополнительныеПараметры.ИндексОбласти;
	КодПоказателя = ДополнительныеПараметры.КодПоказателя;
	КолонкаПоиска = ДополнительныеПараметры.КолонкаПоиска;
	Область = ДополнительныеПараметры.Область;
	Разделитель = ДополнительныеПараметры.Разделитель;
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Область.Имя = КодПоказателя
	 ИЛИ Лев(Область.Имя, СтрНайти(Область.Имя, "_") - 1) = КодПоказателя
	 ИЛИ РегламентированнаяОтчетностьКлиентСервер.ПоказательВходитВМногострочнуюЧасть(ЭтаФорма, КодПоказателя) > 0 Тогда
		
		Область.Значение = РезультатВыбора[КолонкаПоиска];
		
	Иначе
		
		СтрокаРезультатВыбора = Строка(РезультатВыбора[КолонкаПоиска]);
		
		Для Инд = СтрДлина(СтрокаРезультатВыбора) + 1 По ИндексОбласти - 1 Цикл
			СтрокаРезультатВыбора = " " + РезультатВыбора[КолонкаПоиска];
		КонецЦикла;
		
		Для Инд = 1 По ИндексОбласти - 1 Цикл
			ЭтаФорма[ТекущийЭлемент.Имя].Области[КодПоказателя + Разделитель + Формат(Инд, "ЧГ=")].Значение
			= СокрЛП(Сред(РезультатВыбора[КолонкаПоиска], Инд, 1));
		КонецЦикла;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
	РасчетНаКлиенте(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Область.Имя);
	
	Если Область.Имя = "П000200007003" Тогда
		#Если ВебКлиент Тогда
			ИзменитьЦветЯчеекНаСервере(Область.Имя);
		#Иначе
			ИзменитьЦветЯчеекНаКлиенте(Область.Имя);
		#КонецЕсли
	КонецЕсли;
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
		УстановитьДоступностьОбластей(ЭтаФорма, "Титульный");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтотОбъект);
	
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗагрузкойРегламентированногоОтчета(
	ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект);
	
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(
	ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаОтчет() Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзФайлаОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	РегламентированнаяОтчетностьЗагрузкаКлиент.ЗагрузитьИзФайлаОтчет(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Функция ЗагрузкаОтчетаИзФайла(ДанныеДляЗагрузки) Экспорт
	
	Если Модифицированность Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(НСтр("ka='Отчет ""%1"" не сохранен.';ru='Отчет ""%1"" не сохранен.'"), ЭтотОбъект.Заголовок);
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗагрузкаОтчетаИзФайлаНаСервере(ДанныеДляЗагрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ЗагрузкаОтчетаИзФайлаНаСервере(ДанныеДляЗагрузки)
	
	СформироватьСтруктуруПоказателей();
	
	ПараметрыОтчета = СформироватьСтруктуруПараметров();
	
	ДеревоДляЗагрузки = ИзвлечьСтруктуруXML();
	
	Если НЕ РегламентированнаяОтчетностьЗагрузка.ЗагрузкаОтчетаИзФайла(
		ЭтотОбъект, ПараметрыОтчета, ДанныеДляЗагрузки, ДеревоДляЗагрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчет() Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = Неопределено;
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн);
	
	ВывестиРезультатПроверки();
	
КонецПроцедуры

&НаКлиенте
Функция УниверсальнаяВыгрузка(ТекстВыгрузки = Неопределено, ПроверятьБлокировки = Истина) Экспорт
	
	Перем ПараметрыВыгрузки;
	
	Если Модифицированность Тогда
		ТекстЗаголовка = ЗаголовокРегламентированногоОтчета(
		СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		
		ОргСтр = " (" + СтруктураРеквизитовФормы.Организация + ")";
		Если СтрНайти(ТекстЗаголовка, ОргСтр) = 0 Тогда
			ТекстЗаголовка = ТекстЗаголовка + ОргСтр;
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отчет """ + ТекстЗаголовка + """ не сохранен.";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	КонецЕсли;
	
	Если Открыта() Тогда
		Если СтруктураРеквизитовФормы.ЕдиницаИзмерения
			<> ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ka='Перед выгрузкой необходимо установить единицу измерения ""в рублях"".';ru='Перед выгрузкой необходимо установить единицу измерения ""в рублях"".'");
			Сообщение.Сообщить();
			Возврат Ложь;
			
		КонецЕсли;
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения <> 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ka='Перед выгрузкой необходимо установить точность ""0"".';ru='Перед выгрузкой необходимо установить точность ""0"".'");
			Сообщение.Сообщить();
			Возврат Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	РезультатВыгрузки = УниверсальнаяВыгрузкаXMLНаСервере(ТекстВыгрузки, ПараметрыВыгрузки);
	
	Возврат РезультатВыгрузки;
	
КонецФункции

&НаКлиенте
Функция ЗаголовокРегламентированногоОтчета(ДатаНач, ДатаКон, Периодичность = Неопределено) Экспорт
	
	СтрПериодОтчета = ПредставлениеПериода(
	НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета),
	КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" );
	
	Если СтрНайти(ЭтаФорма.Заголовок, СтрПериодОтчета) = 0 Тогда
		Возврат ЭтаФорма.Заголовок + " за " + СтрПериодОтчета;
	Иначе
		Возврат ЭтаФорма.Заголовок;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция УниверсальнаяВыгрузкаXMLНаСервере(ТекстВыгрузки, ПараметрыВыгрузки)
	
	СформироватьСтруктуруПоказателей();
	ПараметрыВыгрузки = СформироватьСтруктуруПараметров();
	ДеревоВыгрузки = ИзвлечьСтруктуруXML();
	
	ПроверитьВыгрузкуПоНовомуАлгоритмуНаСервере();
	
	Результат = ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы.АдресХранилищаПроверкиВыгрузки);
	
	Если Результат.КоличествоОшибок <> 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗаполнитьДанными(ДеревоВыгрузки, ПараметрыВыгрузки);
	
	Если НЕ ПроверитьДанные(ДеревоВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстВыгрузки = Новый Массив;
	
	ВыгрузкаРаздела = ВыгрузкаРаздел8(ПараметрыВыгрузки);
	Если ВыгрузкаРаздела <> Неопределено Тогда
		ТекстВыгрузки.Добавить(ВыгрузкаРаздела);
	КонецЕсли;
	
	ВыгрузкаРаздела = ВыгрузкаРаздел8_Прил1(ПараметрыВыгрузки);
	Если ВыгрузкаРаздела <> Неопределено Тогда
		ТекстВыгрузки.Добавить(ВыгрузкаРаздела);
	КонецЕсли;
	
	ВыгрузкаРаздела = ВыгрузкаРаздел9(ПараметрыВыгрузки);
	Если ВыгрузкаРаздела <> Неопределено Тогда
		ТекстВыгрузки.Добавить(ВыгрузкаРаздела);
	КонецЕсли;
	
	ВыгрузкаРаздела = ВыгрузкаРаздел9_Прил1(ПараметрыВыгрузки);
	Если ВыгрузкаРаздела <> Неопределено Тогда
		ТекстВыгрузки.Добавить(ВыгрузкаРаздела);
	КонецЕсли;
	
	ВыгрузкаРаздела = ВыгрузкаРаздел10(ПараметрыВыгрузки);
	Если ВыгрузкаРаздела <> Неопределено Тогда
		ТекстВыгрузки.Добавить(ВыгрузкаРаздела);
	КонецЕсли;
	
	ВыгрузкаРаздела = ВыгрузкаРаздел11(ПараметрыВыгрузки);
	Если ВыгрузкаРаздела <> Неопределено Тогда
		ТекстВыгрузки.Добавить(ВыгрузкаРаздела);
	КонецЕсли;
	
	ВыгрузкаРаздела = ВыгрузкаРаздел12(ПараметрыВыгрузки);
	Если ВыгрузкаРаздела <> Неопределено Тогда
		ТекстВыгрузки.Добавить(ВыгрузкаРаздела);
	КонецЕсли;
	
	ЗаполнитьСведенияОРазделах8_12(ДеревоВыгрузки, ПараметрыВыгрузки);
	
	ТекстВыгрузкиРазделов1_7 = ВыгрузитьДеревоВXML(ДеревоВыгрузки, ПараметрыВыгрузки);
	
	ТекстВыгрузки.Добавить(РезультатВыгрузкиВоВременномХранилище(
	ТекстВыгрузкиРазделов1_7, ПараметрыВыгрузки.ИдФайл + ".xml", "НДС2017Разделы1_7"));
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция РезультатВыгрузкиВоВременномХранилище(ТекстВыгрузки, ИмяФайлаВыгрузки, ТипФайлаВыгрузки)
	
	КодировкаФайлаВыгрузки = "windows-1251";
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаФайлаВыгрузки);
	ЗаписьТекста.Записать(ТекстВыгрузки);
	ЗаписьТекста.Закрыть();
	ЗаписьТекста = Неопределено;
	
	ФайлВыгрузки = Новый ДвоичныеДанные(ИмяВременногоФайла);
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(ФайлВыгрузки, Новый УникальныйИдентификатор);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	РезультатВыгрузки = Новый Структура;
	РезультатВыгрузки.Вставить("ИмяФайлаВыгрузки", ИмяФайлаВыгрузки);
	РезультатВыгрузки.Вставить("АдресФайлаВыгрузки", АдресВХранилище);
	РезультатВыгрузки.Вставить("ТипФайлаВыгрузки", ТипФайлаВыгрузки);
	РезультатВыгрузки.Вставить("КодировкаФайлаВыгрузки", КодировкаФайлаВыгрузки);
	
	Возврат РезультатВыгрузки;
	
КонецФункции

&НаСервере
Функция СформироватьСтруктуруПоказателей()
	
	мДанныеОтчета = Новый Структура;
	
	Префикс = "ПолеТабличногоДокумента";
	
	СохрСтруктура = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	ПоказателиОтчета = СохрСтруктура.ПоказателиОтчета;
	Для Каждого Раздел Из ПоказателиОтчета Цикл
		Если СтруктураРеквизитовФормы.ОтчетСтарогоОбразца Тогда
			// Конвертация данных после перехода с 2.0 на 3.0.
			ИмяРаздела = СтрЗаменить(Раздел.Ключ, Префикс, "");
			ВосстановитьСтруктуруДанныхРазделаСтарогоОбразца(ПоказателиОтчета, Раздел.Ключ, ИмяРаздела);
		КонецЕсли;
		мДанныеОтчета.Вставить(Раздел.Ключ, РегламентированнаяОтчетность.СвернутьДанныеТабличногоПоля(Раздел.Значение));
	КонецЦикла;
	
	Для Каждого ЭлементСтруктуры Из СохрСтруктура.ДанныеМногостраничныхРазделов Цикл
		
		НайденноеЗначение = Неопределено;
		
		мСтруктураМногостраничныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
		
		Если НЕ НайденноеЗначение = Неопределено Тогда
			
			НайденноеЗначение = ЭтаФорма[НайденноеЗначение];
			
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, НайденноеЗначение);
			
			Если НайденноеЗначение[0].Свойство("Данные") Тогда
				
				Для Каждого СтрокаТаблЗнач Из НайденноеЗначение Цикл
					
					Если ТипЗнч(СтрокаТаблЗнач.Данные) = Тип("СписокЗначений") Тогда
						
						СтрокаТаблЗнач.Данные.Очистить();
						СтрокаТаблЗнач.Данные.Добавить(ЭлементСтруктуры.Значение[НайденноеЗначение.Индекс(СтрокаТаблЗнач)].Данные);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если НайденноеЗначение[0].Свойство("ДанныеДопСтрок") Тогда
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ЭлементСтруктуры.Значение Цикл
					
					Если ТипЗнч(СтрокаТаблЗнач.ДанныеДопСтрок) = Тип("Структура") Тогда
						
						Для Каждого ЭлСтруктуры Из СтрокаТаблЗнач.ДанныеДопСтрок Цикл
							
							ТаблЗнач = ЭлСтруктуры.Значение;
							
							СтрокаТаблЗначДанныеДопСтрок = ЭтаФорма["Хранилище" + ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ЭлементСтруктуры.Ключ)].Добавить().Таблица;
							ЗначениеВДанныеФормы(ТаблЗнач, СтрокаТаблЗначДанныеДопСтрок);
							НайденноеЗначение[Ном].ДанныеДопСтрок.Добавить(СтрокаТаблЗначДанныеДопСтрок, "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела");
							
						КонецЦикла;
						
					ИначеЕсли ТипЗнч(СтрокаТаблЗнач.ДанныеДопСтрок) = Тип("ТаблицаЗначений") Тогда
						
						СтрокаТаблЗначДанныеДопСтрок = ЭтаФорма["Хранилище" + ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ЭлементСтруктуры.Ключ)].Добавить().Таблица;
						ЗначениеВДанныеФормы(СтрокаТаблЗнач.ДанныеДопСтрок, СтрокаТаблЗначДанныеДопСтрок);
						НайденноеЗначение[Ном].ДанныеДопСтрок.Добавить(СтрокаТаблЗначДанныеДопСтрок, "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела");
						
					КонецЕсли;
					
					Ном = Ном + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Раздел Из мСтруктураМногостраничныхРазделов Цикл
		ТаблицаЛистовРаздела = ЭтаФорма[Раздел.Значение];
		Для Каждого Лист Из ТаблицаЛистовРаздела Цикл
			Лист.Данные[0].Значение = РегламентированнаяОтчетность.СвернутьДанныеТабличногоПоля(Лист.Данные[0].Значение);
		КонецЦикла;
		мДанныеОтчета.Вставить(Раздел.Ключ, ЭтаФорма[Раздел.Значение]);
	КонецЦикла;
	
	ДанныеРаздела2 = мДанныеОтчета.Раздел2;
	Для Каждого ЛистРаздела2 Из ДанныеРаздела2 Цикл
		ДанныеЛистаРаздела2 = ЛистРаздела2.Данные[0].Значение;
		ФИО = РегламентированнаяОтчетность.РазложитьФИО(СокрЛП(ДанныеЛистаРаздела2.П000200002003));
		ДанныеЛистаРаздела2.Вставить("П000200002003_1", ФИО.Фамилия);
		ДанныеЛистаРаздела2.Вставить("П000200002003_2", ФИО.Имя);
		ДанныеЛистаРаздела2.Вставить("П000200002003_3", ФИО.Отчество);
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция СформироватьСтруктуруПараметров()
	
	Титульный = мДанныеОтчета.ПолеТабличногоДокументаТитульный;
	
	ПараметрыВыгрузки = Новый Структура;
	ПараметрыВыгрузки.Вставить("ВерсПрог",     РегламентированнаяОтчетность.НазваниеИВерсияПрограммы());
	ПараметрыВыгрузки.Вставить("КНД",          "1151001");
	ПараметрыВыгрузки.Вставить("ДатаДок",      Формат(ТекущаяДатаСеанса(), "ДФ=дд.ММ.гггг"));
	ПараметрыВыгрузки.Вставить("ГодПериодОтч", Формат(СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания, "ДФ=гггг"));
	ПараметрыВыгрузки.Вставить("ПериодОтч",    СокрЛП(Титульный.Период));
	ПараметрыВыгрузки.Вставить("КодИФНС",      СокрЛП(Титульный.КодИМНС));
	ПараметрыВыгрузки.Вставить("ВидДок",       Строка(СтруктураРеквизитовФормы.мСохраненныйДок.Вид));
	ПараметрыВыгрузки.Вставить("ПоМесту",      СокрЛП(Титульный.ПоМесту));
	ПараметрыВыгрузки.Вставить("ОКВЭДОрг",     СтрЗаменить(СокрЛП(СтрЗаменить(Титульный.ОКВЭД, ".", " ")), " ", "."));
	ПараметрыВыгрузки.Вставить("ТелОрг",       СокрЛП(Титульный.ТелОрганизации));
	ПараметрыВыгрузки.Вставить("НаимОрг",      СокрЛП(Титульный.НаимОрг));
	ПараметрыВыгрузки.Вставить("ИННОрг",       СокрЛП(СтруктураРеквизитовФормы.Организация.ИНН));
	ПараметрыВыгрузки.Вставить("КППОрг",       СокрЛП(Титульный.КПП1));
	ПараметрыВыгрузки.Вставить("КодФормРеорг", СокрЛП(Титульный.КодФормыРеорганизации));
	ПараметрыВыгрузки.Вставить("ИННОргРеорг",  СокрЛП(Титульный.ИННРеорганизованнойОрганизации));
	ПараметрыВыгрузки.Вставить("КППОргРеорг",  СокрЛП(Титульный.КППРеорганизованнойОрганизации));
	
	ПараметрыВыгрузки.Вставить("КодИФНСПосредника", ?(СтруктураРеквизитовФормы.Организация.КрупнейшийНалогоплательщик,
	СокрЛП(СтруктураРеквизитовФормы.Организация.КодНалоговогоОрганаПолучателя), ""));
	
	ПараметрыВыгрузки.Вставить("ТипПодписанта",        СокрЛП(Титульный.ПрПодп));
	ПараметрыВыгрузки.Вставить("НаимОргПредставителя", СокрЛП(Титульный.ОргУп));
	ПараметрыВыгрузки.Вставить("НаимДокПредставителя", СокрЛП(Титульный.ДокУпПред));
	
	ФИОИП = РегламентированнаяОтчетность.РазложитьФИО(Титульный.НаимОрг);
	ПараметрыВыгрузки.Вставить("ФамилияИП",  ФИОИП.Фамилия);
	ПараметрыВыгрузки.Вставить("ИмяИП",      ФИОИП.Имя);
	ПараметрыВыгрузки.Вставить("ОтчествоИП", ФИОИП.Отчество);
	
	ПараметрыВыгрузки.Вставить("ЭтоПБОЮЛ", НЕ РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(СтруктураРеквизитовФормы.Организация));
	
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация, ТекущаяДатаСеанса(), "ФИОБух, ТелБух");
	Если ПараметрыВыгрузки.ЭтоПБОЮЛ И ПустаяСтрока(СведенияОбОрганизации.ФИОБух) Тогда
		ПараметрыВыгрузки.Вставить("ДолжОтв",     "Индивидуальный предприниматель");
		ПараметрыВыгрузки.Вставить("ФамилияОтв",  ФИОИП.Фамилия);
		ПараметрыВыгрузки.Вставить("ИмяОтв",      ФИОИП.Имя);
		ПараметрыВыгрузки.Вставить("ОтчествоОтв", ФИОИП.Отчество);
		ПараметрыВыгрузки.Вставить("ТелОтв",      ?(ПараметрыВыгрузки.Свойство("ТелОрг"), ПараметрыВыгрузки.ТелОрг, ""));
	Иначе
		ФИОБух = РегламентированнаяОтчетность.РазложитьФИО(СведенияОбОрганизации.ФИОБух);
		ПараметрыВыгрузки.Вставить("ДолжОтв",     "Главный бухгалтер");
		ПараметрыВыгрузки.Вставить("ФамилияОтв",  ФИОБух.Фамилия);
		ПараметрыВыгрузки.Вставить("ИмяОтв",      ФИОБух.Имя);
		ПараметрыВыгрузки.Вставить("ОтчествоОтв", ФИОБух.Отчество);
		ПараметрыВыгрузки.Вставить("ТелОтв",      СведенияОбОрганизации.ТелБух);
	КонецЕсли;
	
	ФИОПодписанта = РегламентированнаяОтчетность.РазложитьФИО(Титульный.ОргПодписант);
	ПараметрыВыгрузки.Вставить("ФамилияПодписанта",  ФИОПодписанта.Фамилия);
	ПараметрыВыгрузки.Вставить("ИмяПодписанта",      ФИОПодписанта.Имя);
	ПараметрыВыгрузки.Вставить("ОтчествоПодписанта", ФИОПодписанта.Отчество);
	
	ПараметрыВыгрузки.Вставить("ПрефиксИмениФайлаВыгрузки", "NO_NDS");
	
	ПараметрыВыгрузки.Вставить("ИмяКлючевогоУзлаСодержательнойЧасти", "НДС");
	
	ПараметрыВыгрузки.Вставить("ИдФайл", СформироватьИдФайл(ПараметрыВыгрузки));
	
	СохраненныеДанные = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	ПараметрыВыгрузки.Вставить("АктуальностьСведенийРаздел8", Формат(СохраненныеДанные.АктуальностьСведенийРаздел8, "ЧН="));
	ПараметрыВыгрузки.Вставить("АктуальностьСведенийРаздел8_Прил1", Формат(СохраненныеДанные.АктуальностьСведенийРаздел8_Прил1, "ЧН="));
	ПараметрыВыгрузки.Вставить("АктуальностьСведенийРаздел9", Формат(СохраненныеДанные.АктуальностьСведенийРаздел9, "ЧН="));
	ПараметрыВыгрузки.Вставить("АктуальностьСведенийРаздел9_Прил1", Формат(СохраненныеДанные.АктуальностьСведенийРаздел9_Прил1, "ЧН="));
	ПараметрыВыгрузки.Вставить("АктуальностьСведенийРаздел10", Формат(СохраненныеДанные.АктуальностьСведенийРаздел10, "ЧН="));
	ПараметрыВыгрузки.Вставить("АктуальностьСведенийРаздел11", Формат(СохраненныеДанные.АктуальностьСведенийРаздел11, "ЧН="));
	ПараметрыВыгрузки.Вставить("АктуальностьСведенийРаздел12", Формат(СохраненныеДанные.АктуальностьСведенийРаздел12, "ЧН="));
	
	ПараметрыВыгрузки.Вставить("ДанныеСегментированы",
	СохраненныеДанные.Свойство("УспешноеАвтозаполнение") И СохраненныеДанные.УспешноеАвтозаполнение = Истина);
	
	УстановитьПризнакиВыгрузкиРазделов8и9(ПараметрыВыгрузки);
	
	Возврат ПараметрыВыгрузки;
	
КонецФункции

&НаСервере
Процедура УстановитьПризнакиВыгрузкиРазделов8и9(ПараметрыВыгрузки)
	
	Раздел3 = мДанныеОтчета.ПолеТабличногоДокументаРаздел3;
	Раздел4 = мДанныеОтчета.ПолеТабличногоДокументаРаздел4;
	Раздел5 = мДанныеОтчета.Раздел5;
	Раздел6 = мДанныеОтчета.ПолеТабличногоДокументаРаздел6;
	
	ЗаполненаРаздел4Строка030 = Ложь;
	ЗаполненаРаздел4Строка040 = Ложь;
	ЗаполненаРаздел4Строка050 = Ложь;
	ЗаполненаРаздел4Строка080 = Ложь;
	НомерСтроки = 1;
	Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Раздел4, "П0004М1003003_" + Формат(НомерСтроки, "ЧГ=")) Цикл
		ЗаполненаРаздел4Строка030 = ЗаполненаРаздел4Строка030 ИЛИ Раздел4["П0004М1003003_" + Формат(НомерСтроки, "ЧГ=")] > 0;
		ЗаполненаРаздел4Строка040 = ЗаполненаРаздел4Строка040 ИЛИ Раздел4["П0004М1004003_" + Формат(НомерСтроки, "ЧГ=")] > 0;
		ЗаполненаРаздел4Строка050 = ЗаполненаРаздел4Строка050 ИЛИ Раздел4["П0004М1005003_" + Формат(НомерСтроки, "ЧГ=")] > 0;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	НомерСтроки = 1;
	Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Раздел4, "П0004М2008003_" + Формат(НомерСтроки, "ЧГ=")) Цикл
		ЗаполненаРаздел4Строка080 = ЗаполненаРаздел4Строка050 ИЛИ Раздел4["П0004М2008003_" + Формат(НомерСтроки, "ЧГ=")] > 0;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ЗаполненаРаздел5Строка050 = Ложь;
	ЗаполненаРаздел5Строка070 = Ложь;
	Для Каждого ЛистРаздела Из Раздел5 Цикл
		ДанныеЛиста = ЛистРаздела.Данные[0].Значение;
		НомерСтроки = 1;
		Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ДанныеЛиста, "П000500005003_" + Формат(НомерСтроки, "ЧГ=")) Цикл
			ЗаполненаРаздел5Строка050 = ЗаполненаРаздел5Строка050 ИЛИ ДанныеЛиста["П000500005003_" + Формат(НомерСтроки, "ЧГ=")] > 0;
			ЗаполненаРаздел5Строка070 = ЗаполненаРаздел5Строка070 ИЛИ ДанныеЛиста["П000500007003_" + Формат(НомерСтроки, "ЧГ=")] > 0;
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
	КонецЦикла;
	
	ЗаполненаРаздел6Строка030 = Ложь;
	ЗаполненаРаздел6Строка040 = Ложь;
	ЗаполненаРаздел6Строка100 = Ложь;
	ЗаполненаРаздел6Строка120 = Ложь;
	ЗаполненаРаздел6Строка140 = Ложь;
	НомерСтроки = 1;
	Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Раздел6, "П0006М1003003_" + Формат(НомерСтроки, "ЧГ=")) Цикл
		ЗаполненаРаздел6Строка030 = ЗаполненаРаздел6Строка030 ИЛИ Раздел6["П0006М1003003_" + Формат(НомерСтроки, "ЧГ=")] > 0;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	НомерСтроки = 1;
	Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Раздел6, "П0006М1004003_" + Формат(НомерСтроки, "ЧГ=")) Цикл
		ЗаполненаРаздел6Строка040 = ЗаполненаРаздел6Строка040 ИЛИ Раздел6["П0006М1004003_" + Формат(НомерСтроки, "ЧГ=")] > 0;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	НомерСтроки = 1;
	Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Раздел6, "П0006М2010003_" + Формат(НомерСтроки, "ЧГ=")) Цикл
		ЗаполненаРаздел6Строка100 = ЗаполненаРаздел6Строка100 ИЛИ Раздел6["П0006М2010003_" + Формат(НомерСтроки, "ЧГ=")] > 0;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	НомерСтроки = 1;
	Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Раздел6, "П0006М3012003_" + Формат(НомерСтроки, "ЧГ=")) Цикл
		ЗаполненаРаздел6Строка120 = ЗаполненаРаздел6Строка120 ИЛИ Раздел6["П0006М3012003_" + Формат(НомерСтроки, "ЧГ=")] > 0;
		ЗаполненаРаздел6Строка140 = ЗаполненаРаздел6Строка140 ИЛИ Раздел6["П0006М3014003_" + Формат(НомерСтроки, "ЧГ=")] > 0;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ДанныеРаздел8_Прил1 = ДанныеРазделаНДСИзРегистра("Раздел8_Прил1", ПараметрыВыгрузки.ДанныеСегментированы);
	ДанныеРаздел9_Прил1 = ДанныеРазделаНДСИзРегистра("Раздел9_Прил1", ПараметрыВыгрузки.ДанныеСегментированы);
	
	Раздел8Обязателен
	= ДанныеРаздел8_Прил1 <> Неопределено
	ИЛИ Раздел3.П000300019003 > 0
	ИЛИ ЗаполненаРаздел4Строка030
	ИЛИ ЗаполненаРаздел4Строка040
	ИЛИ ЗаполненаРаздел5Строка050
	ИЛИ ЗаполненаРаздел5Строка070
	ИЛИ ЗаполненаРаздел6Строка040
	ИЛИ ЗаполненаРаздел6Строка140;
	
	ПараметрыВыгрузки.Вставить("Раздел8Обязателен", Раздел8Обязателен);
	
	Раздел9Обязателен
	= ДанныеРаздел9_Прил1 <> Неопределено
	ИЛИ Раздел3.П000300011805 > 0
	ИЛИ ЗаполненаРаздел4Строка050
	ИЛИ ЗаполненаРаздел4Строка080
	ИЛИ ЗаполненаРаздел6Строка030
	ИЛИ ЗаполненаРаздел6Строка100
	ИЛИ ЗаполненаРаздел6Строка120;
	
	ПараметрыВыгрузки.Вставить("Раздел9Обязателен", Раздел9Обязателен);
	
КонецПроцедуры

&НаСервере
Функция ИзвлечьСтруктуруXML()
	
	ДеревоСтруктуры = Новый ДеревоЗначений;
	ДеревоСтруктуры.Колонки.Добавить("Код");
	ДеревоСтруктуры.Колонки.Добавить("Тип");
	ДеревоСтруктуры.Колонки.Добавить("Формат");
	ДеревоСтруктуры.Колонки.Добавить("МинРазмерность");
	ДеревоСтруктуры.Колонки.Добавить("МаксРазмерность");
	ДеревоСтруктуры.Колонки.Добавить("Обязательность");
	ДеревоСтруктуры.Колонки.Добавить("Многостраничность");
	ДеревоСтруктуры.Колонки.Добавить("Многострочность");
	ДеревоСтруктуры.Колонки.Добавить("Раздел");
	ДеревоСтруктуры.Колонки.Добавить("Ключ");
	ДеревоСтруктуры.Колонки.Добавить("Условие");
	ДеревоСтруктуры.Колонки.Добавить("ЗначениеПоУмолчанию");
	ДеревоСтруктуры.Колонки.Добавить("Значение");
	ДеревоСтруктуры.Колонки.Добавить("Представление");
	ДеревоСтруктуры.Колонки.Добавить("Показатели");
	
	ИмяМакетаСтруктурыВыгрузки = "СхемаВыгрузки505";
	
	Макет = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(ИмяМакетаСтруктурыВыгрузки);
	
	ВысотаТаблицы = Макет.ВысотаТаблицы;
	
	УчтенныеГруппы = Новый Соответствие;
	
	Для Уровень = 0 По Макет.КоличествоУровнейГруппировокСтрок() - 1 Цикл
		Макет.ПоказатьУровеньГруппировокСтрок(Уровень);
		Для НомерСтроки = 2 По ВысотаТаблицы Цикл
			НомСтр = ВысотаТаблицы - НомерСтроки + 2;
			Если Макет.Область(НомСтр, 1).Видимость И УчтенныеГруппы.Получить(НомСтр) = Неопределено Тогда	
				
				РодительскийУзел = ДеревоСтруктуры;
				Если Уровень <> 0 Тогда
					Для Инд = 1 По НомСтр - 2 Цикл
						Узел = УчтенныеГруппы.Получить(НомСтр - Инд);
						Если Узел <> Неопределено Тогда
							РодительскийУзел = Узел;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				НовСтр = РодительскийУзел.Строки.Вставить(0);
				НовСтр.Код = СокрЛП(Макет.Область(НомСтр, 1, НомСтр, 1).Текст);
				НовСтр.Раздел = СокрЛП(Макет.Область(НомСтр, 2, НомСтр, 2).Текст);
				НовСтр.Ключ = СокрЛП(Макет.Область(НомСтр, 3, НомСтр, 3).Текст);
				НовСтр.Тип = СокрЛП(Макет.Область(НомСтр, 4, НомСтр, 4).Текст);
				НовСтр.Формат = СокрЛП(Макет.Область(НомСтр, 5, НомСтр, 5).Текст);
				МинРазмерность = СокрЛП(Макет.Область(НомСтр, 6, НомСтр, 6).Текст);
				НовСтр.МинРазмерность = ?(ПустаяСтрока(МинРазмерность), ?(НовСтр.Формат = "N", 99999, 0), Число(МинРазмерность));
				МаксРазмерность = СокрЛП(Макет.Область(НомСтр, 7, НомСтр, 7).Текст);
				НовСтр.МаксРазмерность = ?(ПустаяСтрока(МаксРазмерность), 99999, Число(МаксРазмерность));
				НовСтр.Обязательность = СокрЛП(Макет.Область(НомСтр, 8, НомСтр, 8).Текст);
				НовСтр.Многостраничность = НЕ ПустаяСтрока(Макет.Область(НомСтр, 9, НомСтр, 9).Текст);
				НовСтр.Многострочность = НЕ ПустаяСтрока(Макет.Область(НомСтр, 10, НомСтр, 10).Текст);
				НовСтр.Условие = СокрЛП(Макет.Область(НомСтр, 11, НомСтр, 11).Текст);
				НовСтр.ЗначениеПоУмолчанию = СокрЛП(Макет.Область(НомСтр, 12, НомСтр, 12).Текст);
				НовСтр.Представление = СокрЛП(Макет.Область(НомСтр, 13, НомСтр, 13).Текст);
				
				УчтенныеГруппы.Вставить(НомСтр, НовСтр);
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДеревоСтруктуры;
	
КонецФункции

&НаСервере
Функция ДанныеРазделаНДСИзРегистра(ИмяРаздела, ДанныеСегментированы)
	
	Если ДанныеСегментированы Тогда
		СекцииРаздела = СписокСекцийРазделаИзРегистра(ИмяРаздела);
		
		Если СекцииРаздела.Количество() > 0 Тогда
			ДанныеРаздела = СекцииРаздела.ВыгрузитьКолонку("НомерПервойСтроки");
		Иначе
			ДанныеРаздела = Неопределено;
		КонецЕсли;
		
	Иначе
		ЗаписьРегистраСведений = РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов.СоздатьМенеджерЗаписи();
		ЗаписьРегистраСведений.РегламентированныйОтчет = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		ЗаписьРегистраСведений.ВидДополнительногоФайла = "Данные" + ИмяРаздела;
		
		ЗаписьРегистраСведений.Прочитать();
		
		Если ЗначениеЗаполнено(ЗаписьРегистраСведений.ВидДополнительногоФайла) Тогда
			ДанныеРаздела = ЗаписьРегистраСведений.СодержимоеФайла.Получить();
			Если ДанныеРаздела.Записи.Количество() = 0 Тогда
				ДанныеРаздела = Неопределено;
			КонецЕсли;
		Иначе
			ДанныеРаздела = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеРаздела;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаЧГ0(ИсходноеЧисло)
	
	Возврат Формат(ИсходноеЧисло, "ЧН=; ЧГ=0");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРазделРегистраУчетаНДС(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Раздел8")
	        ИЛИ (ИмяРаздела = "Раздел8_Прил1")
	        ИЛИ (ИмяРаздела = "Раздел9")
	        ИЛИ (ИмяРаздела = "Раздел9_Прил1")
	        ИЛИ (ИмяРаздела = "Раздел10")
	        ИЛИ (ИмяРаздела = "Раздел11")
	        ИЛИ (ИмяРаздела = "Раздел12");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанными(ДеревоВыгрузки, ПараметрыВыгрузки)
	
	ОбработатьУсловныеЭлементы(ПараметрыВыгрузки, ДеревоВыгрузки); // формируем точную структуру XML-макета
	ЗаполнитьДаннымиУзел(ПараметрыВыгрузки, ДеревоВыгрузки); // заполняем дерево данными
	ОтсечьНезаполненныеНеобязательныеУзлы(ДеревоВыгрузки);
	ПостобработкаДереваВыгрузки(ДеревоВыгрузки);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДанные(Узел)
	
	СтатусПроверки = Истина;
	Если ТипЗнч(Узел) <> Тип("ДеревоЗначений") Тогда
		Если НЕ ЗначениеСоответствуетФормату(Узел) Тогда
			СтатусПроверки = Ложь;
		КонецЕсли;
	КонецЕсли;
	Для Каждого Стр из Узел.Строки Цикл
		СтатусПроверки = (ПроверитьДанные(Стр) И СтатусПроверки); // именно в указанном порядке для выдачи всех ошибок
	КонецЦикла;
	Возврат СтатусПроверки;
	
КонецФункции

&НаСервере
Функция ВыгрузитьДеревоВXML(ДеревоВыгрузки, ПараметрыВыгрузки)
	
	ПотокXML = РегламентированнаяОтчетность.СоздатьНовыйПотокXML("windows-1251"); // создаем новый поток для записи
	ЗаписатьУзелДереваВXML(ДеревоВыгрузки, ПотокXML, ПараметрыВыгрузки); // пишем дерево в поток
	ТекстДляЗаписи = ПотокXML.Закрыть(); // получаем текст XML
	Возврат ТекстДляЗаписи;
	
КонецФункции

&НаСервере
Функция СформироватьИдФайл(ПараметрыВыгрузки)
	
	Возврат ПараметрыВыгрузки.ПрефиксИмениФайлаВыгрузки
		+ "_" + ?(ЗначениеЗаполнено(ПараметрыВыгрузки.КодИФНСПосредника), ПараметрыВыгрузки.КодИФНСПосредника, ПараметрыВыгрузки.КодИФНС)
		+ "_" + ПараметрыВыгрузки.КодИФНС
		+ "_" + ?(ПараметрыВыгрузки.Свойство("ЭтоПБОЮЛ") И ПараметрыВыгрузки.ЭтоПБОЮЛ, СокрЛП(ПараметрыВыгрузки.ИННОрг), СокрЛП(ПараметрыВыгрузки.ИННОрг) + СокрЛП(ПараметрыВыгрузки.КППОрг))
		+ "_" + Формат(ТекущаяДатаСеанса(), "ДФ=ггггММдд")
		+ "_" + Строка(Новый УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция ЗначениеСуммыЗаполнено(ЗначениеСуммы)
	
	Возврат (Окр(ЗначениеСуммы) <> 0);
	
КонецФункции

&НаСервере
Процедура ОбработатьУсловныеЭлементы(Знач ПараметрыВыгрузки, Узел)
	
	Если ТипЗнч(Узел) <> Тип("ДеревоЗначений") Тогда
		Если Узел.Код = ПараметрыВыгрузки.ИмяКлючевогоУзлаСодержательнойЧасти Тогда
			Возврат;
		КонецЕсли;
		РегламентированнаяОтчетность.ДополнитьСтруктуруПараметровПрочиеОтчеты(мДанныеОтчета, ПараметрыВыгрузки, Узел);
	КонецЕсли;
	КоличествоСтрок = Узел.Строки.Количество();
	Для Инд = 1 По КоличествоСтрок Цикл
		ТекСтр = Узел.Строки.Получить(КоличествоСтрок - Инд);
		Если НЕ ПустаяСтрока(ТекСтр.Условие) Тогда
			Если НЕ РегламентированнаяОтчетность.УсловиеВыполнено(ЭтаФорма, ПараметрыВыгрузки, ТекСтр.Условие) Тогда
				Узел.Строки.Удалить(ТекСтр);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ОбработатьУсловныеЭлементы(ПараметрыВыгрузки, ТекСтр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиУзел(ПараметрыВыгрузки, Узел, НомерСтроки = Неопределено)
	
	Для Каждого Стр из Узел.Строки Цикл
		Если Стр.Тип = "С" ИЛИ Стр.Тип = "C" Тогда // учтем оба варианта: кириллицу и латиницу
			Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ПараметрыВыгрузки, "ИмяКлючевогоУзлаСодержательнойЧасти") И Стр.Код = ПараметрыВыгрузки.ИмяКлючевогоУзлаСодержательнойЧасти Тогда
				ЗаполнитьСодержательнуюЧасть(Стр);
			Иначе
				ЗаполнитьДаннымиУзел(ПараметрыВыгрузки, Стр);
			КонецЕсли;
		Иначе
			Если ПустаяСтрока(Стр.ЗначениеПоУмолчанию) Тогда
				Если НЕ ПустаяСтрока(Стр.Ключ) И РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ПараметрыВыгрузки, Стр.Ключ) Тогда
					ВывестиПоказательВXML(Стр, ПараметрыВыгрузки[Стр.Ключ]);
				Иначе
					Стр.Значение = "";
				КонецЕсли;
			ИначеЕсли Лев(Стр.ЗначениеПоУмолчанию, 1) = "&" Тогда
				Ключ = Сред(Стр.ЗначениеПоУмолчанию, 2);
				Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ПараметрыВыгрузки, Ключ) Тогда
					ВывестиПоказательВXML(Стр, ПараметрыВыгрузки[Ключ]);
				КонецЕсли;
			Иначе
				Стр.Значение = Стр.ЗначениеПоУмолчанию;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтсечьНезаполненныеНеобязательныеУзлы(Узел)
	
	КоличествоСтрок = Узел.Строки.Количество();
	Для Инд = 1 По КоличествоСтрок Цикл
		Стр = Узел.Строки.Получить(КоличествоСтрок - Инд);
		ОтсечьНезаполненныеНеобязательныеУзлы(Стр);
	КонецЦикла;
	
	Если ТипЗнч(Узел) <> Тип("ДеревоЗначений") Тогда
		Если (СтрНайти(Узел.Обязательность, "Н") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "H") <> 0) И УзелПуст(Узел) Тогда // учтем оба варианта: кириллицу и латиницу
			РегламентированнаяОтчетность.УдалитьУзел(Узел);
		ИначеЕсли (СтрНайти(Узел.Обязательность, "М") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "M") <> 0) // учтем оба варианта: кириллицу и латиницу
		И УзелПуст(Узел)
		И ?(СтрНайти(Узел.Обязательность, "О") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "O") <> 0, РегламентированнаяОтчетность.ИмеютсяАналогичныеСоседниеУзлыКлюч(Узел), Истина) Тогда
			РегламентированнаяОтчетность.УдалитьУзел(Узел);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПостобработкаДереваВыгрузки(ДеревоВыгрузки)
	
	УзелНДС = ДеревоВыгрузки.Строки.Найти("НДС", "Код", Истина);
	
	// решаем, оставлять ли узел НалИсчСМР (раздел 3)
	УзелНалИсчСМР = УзелНДС.Строки.Найти("НалИсчСМР", "Код", Истина);
	Если УзелНалИсчСМР <> Неопределено И УзелПуст(УзелНалИсчСМР) И УзелНалИсчСМР.Родитель.Родитель.Строки.Найти("ВыпСМРСоб", "Код", Истина) = Неопределено Тогда
		
		// удаляем НалИсчСМР
		УзелНалИсчСМР.Родитель.Строки.Удалить(УзелНалИсчСМР);
		
	КонецЕсли;
	
	// решаем, оставлять ли узел СумНалВосст (раздел 3)
	УзелСумНалВосст = УзелНДС.Строки.Найти("СумНалВосст", "Код", Истина);
	Если УзелСумНалВосст <> Неопределено И УзелПуст(УзелСумНалВосст) Тогда
		
		// определяем, пусты ли все узлы ДатаИсп170
		УзлыДатаИсп170 = УзелНДС.Строки.НайтиСтроки(Новый Структура("Код", "ДатаИсп170"), Истина);
		Если УзлыДатаИсп170.Количество() = 0 Тогда
			
			// удаляем узел СумНалВосст
			УзелСумНалВосст.Родитель.Строки.Удалить(УзелСумНалВосст);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// если узел СумНалОб пуст и СумНалИсч отсутствует, то удалим СумНалОб (раздел 3)
	// узел СумНалОб проверяем на пустоту именно по количеству подчиненных строк,
	// потому что возможны ситуации, когда узлу подчинен пустой узел СумНалВосст (см. выше)
	УзелСумНалОб = УзелНДС.Строки.Найти("СумНалОб", "Код", Истина);
	Если УзелСумНалОб <> Неопределено И УзелСумНалОб.Строки.Количество() = 1 И УзелПуст(УзелСумНалОб.Строки[0]) Тогда
		
		// определяем, пусты ли все узлы СумНалИсч
		УзлыСумНалИсч = УзелНДС.Строки.НайтиСтроки(Новый Структура("Код", "СумНалИсч"), Истина);
		Если УзлыСумНалИсч.Количество() = 0 Тогда
			
			// удаляем узел СумНалОб
			УзелСумНалОб.Родитель.Строки.Удалить(УзелСумНалОб);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// если узел СумНалВыч пуст и нет ни одного (СумНалВыч, подчиненного СумВычИн),
	// то удалим СумНалВыч
	УзелСумУпл164 = УзелНДС.Строки.Найти("СумУпл164", "Код", Истина);
	Если УзелСумУпл164 <> Неопределено Тогда
		
		// ищем СумНалВыч в подчинении СумУпл164
		УзелСумНалВычСложный = УзелСумУпл164.Строки.Найти("СумНалВыч", "Код");
		Если УзелСумНалВычСложный <> Неопределено Тогда
			
			// если остался только НалВычОбщ и он пустой
			Если УзелСумНалВычСложный.Строки.Количество() = 1 И УзелПуст(УзелСумНалВычСложный.Строки[0]) Тогда
				
				// если при этом нет ни одного заполненного СумНалВыч(П000320000103), то удаляем сложный СумНалВыч
				УзлыСумНалВыч = УзелНДС.Строки.НайтиСтроки(Новый Структура("Код, Ключ", "СумНалВыч", "П000320000103"), Истина);
				Если УзлыСумНалВыч.Количество() = 0 Тогда
					УзелСумНалВычСложный.Родитель.Строки.Удалить(УзелСумНалВычСложный);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// решаем, оставлять ли узел НалВычПред0 (раздел 5)
	НалВычПред0 = УзелНДС.Строки.Найти("НалВычПред0", "Код", Истина);
	Если НалВычПред0 <> Неопределено Тогда
		СумВозмПдтв = НалВычПред0.Строки.Найти("СумВозмПдтв", "Код", Истина);
		СумВозмНеПдтв = НалВычПред0.Строки.Найти("СумВозмНеПдтв", "Код", Истина);
		Если СумВозмПдтв = Неопределено И СумВозмНеПдтв = Неопределено Тогда
			НалВычПред0.Родитель.Строки.Удалить(НалВычПред0);
		КонецЕсли;
	КонецЕсли;
	
	// решаем, оставлять ли узел СумНал164Ит (раздел 6)
	УзелСумНал164Ит = УзелНДС.Строки.Найти("СумНал164Ит", "Код", Истина);
	Если УзелСумНал164Ит <> Неопределено Тогда
		МногострочнаяЧастьЗаполнена = (УзелНДС.Строки.Найти("СумОпер6", "Код", Истина) <> Неопределено);
		Если НЕ МногострочнаяЧастьЗаполнена И УзелПуст(УзелСумНал164Ит) Тогда
			РегламентированнаяОтчетность.УдалитьУзел(УзелСумНал164Ит);
		КонецЕсли;
	КонецЕсли;
	
	// удалить пустые необязательные родительские узлы после предварительной обработки
	ОтсечьНезаполненныеНеобязательныеУзлы(ДеревоВыгрузки);
	
КонецПроцедуры

&НаСервере
Функция ЗначениеСоответствуетФормату(Стр)
	
	СтатусПроверки = Истина;
	Если Стр.Формат = "Т" ИЛИ Стр.Формат = "T"  ИЛИ Стр.Формат = "S" Тогда // учтем оба варианта: кириллицу и латиницу
		ДлинаЗначения = СтрДлина(Стр.Значение);
		Если ДлинаЗначения < Стр.МинРазмерность Тогда
			СтатусПроверки = Ложь;
			Если ЗначениеЗаполнено(Стр.Раздел) И ЗначениеЗаполнено(Стр.Ключ) Тогда
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма,
					"Формирование XML: Длина значения показателя """
					+ РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)
					+ """ (" + АдресПоказателя(Стр)+ ") меньше минимально возможной (" + ДлинаЗначения
					+ " < " + Стр.МинРазмерность + ")", Стр.Раздел, Стр.Ключ, "");
			Иначе
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма,
					"Формирование XML: Длина значения показателя """
					+ РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)
					+ """ (" + АдресПоказателя(Стр)+ ") меньше минимально возможной (" + ДлинаЗначения
					+ " < " + Стр.МинРазмерность + ")", "Титульный", "");
			КонецЕсли;
		КонецЕсли;
		Если ДлинаЗначения > Стр.МаксРазмерность Тогда
			СтатусПроверки = Ложь;
			Если ЗначениеЗаполнено(Стр.Раздел) И ЗначениеЗаполнено(Стр.Ключ) Тогда
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма,
					"Формирование XML: Длина значения показателя """
					+ РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)
					+ """  (" + АдресПоказателя(Стр)+ ") больше максимально возможной (" + ДлинаЗначения
					+ " > " + Стр.МаксРазмерность + ")", Стр.Раздел, Стр.Ключ, "");
			Иначе
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма,
					"Формирование XML: Длина значения показателя """
					+ РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)
					+ """  (" + АдресПоказателя(Стр)+ ") больше максимально возможной (" + ДлинаЗначения
					+ " > " + Стр.МаксРазмерность + ")", "Титульный", "");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат СтатусПроверки;
	
КонецФункции

&НаСервере
Функция ЗаписатьУзелДереваВXML(СтрокаДерева, ПотокXML, ПараметрыВыгрузки) Экспорт
	
	Если ТипЗнч(СтрокаДерева) = Тип("ДеревоЗначений") Тогда
		ПотокXML.ЗаписатьНачалоЭлемента("Файл");
		ПотокXML.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
		Для каждого Стр Из СтрокаДерева.Строки Цикл
			ЗаписатьУзелДереваВXML(Стр, ПотокXML, ПараметрыВыгрузки);
		КонецЦикла;
		ПотокXML.ЗаписатьКонецЭлемента();
	Иначе
		Если СтрокаДерева.Тип = "А" ИЛИ СтрокаДерева.Тип = "A" Тогда
			ПотокXML.ЗаписатьАтрибут(СтрокаДерева.Код, Строка(СтрокаДерева.Значение));
		Иначе
			ПотокXML.ЗаписатьНачалоЭлемента(СтрокаДерева.Код);
			Для каждого Лист из СтрокаДерева.Строки Цикл
				ЗаписатьУзелДереваВXML(Лист, ПотокXML, ПараметрыВыгрузки);
			КонецЦикла;
			ПотокXML.ЗаписатьТекст(Строка(СтрокаДерева.Значение));
			ПотокXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
	КонецЕсли;

КонецФункции

&НаСервере
Функция ЗначениеПоказателяЗаполнено(ЗначениеПоказателя, ЯвляетсяСуммой)
	
	Если ТипЗнч(ЯвляетсяСуммой) = Тип("Булево") Тогда
		ПоказательЯвляетсяСуммой = ЯвляетсяСуммой;
	Иначе
		ПоказательЯвляетсяСуммой = (ЯвляетсяСуммой.Формат = "N" И ЯвляетсяСуммой.МаксРазмерность >= 10 И ЯвляетсяСуммой.МинРазмерность = 99999);
	КонецЕсли;
	
	Возврат ?(ПоказательЯвляетсяСуммой, ЗначениеСуммыЗаполнено(ЗначениеПоказателя), ЗначениеЗаполнено(ЗначениеПоказателя));
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСодержательнуюЧасть(УзелРодитель)
	
	Титульный     = мДанныеОтчета.ПолеТабличногоДокументаТитульный;
	Раздел1       = мДанныеОтчета.ПолеТабличногоДокументаРаздел1;
	Раздел2       = мДанныеОтчета.Раздел2;
	Раздел3       = мДанныеОтчета.ПолеТабличногоДокументаРаздел3;
	Раздел3_Прил1 = мДанныеОтчета.Раздел3_Прил1;
	Раздел3_Прил2 = мДанныеОтчета.ПолеТабличногоДокументаРаздел3_Прил2;
	Раздел4       = мДанныеОтчета.ПолеТабличногоДокументаРаздел4;
	Раздел5       = мДанныеОтчета.Раздел5;
	Раздел6       = мДанныеОтчета.ПолеТабличногоДокументаРаздел6;
	Раздел7       = мДанныеОтчета.ПолеТабличногоДокументаРаздел7;
	
	// Раздел 1.
	УзелСумУплНП = ПолучитьПодчиненныйЭлемент(УзелРодитель, "СумУплНП");
	ЗадатьЗначениеЭлемента(УзелСумУплНП, "ОКТМО", Раздел1.П000100001003);
	ЗадатьЗначениеЭлемента(УзелСумУплНП, "КБК",   Раздел1.П000100002003);
	
	П100100004003 = ?(ЗначениеСуммыЗаполнено(Раздел1.П000100005003), -Раздел1.П000100005003, Раздел1.П000100004003);
	
	ЗадатьЗначениеЭлемента(УзелСумУплНП, "СумПУ_173.5", Раздел1.П000100003003);
	ЗадатьЗначениеЭлемента(УзелСумУплНП, "СумПУ_173.1", П100100004003);
	
	Узел_СумПУ_173_5 = ПолучитьПодчиненныйЭлемент(УзелСумУплНП, "СумПУ_173.5");
	Узел_СумПУ_173_1 = ПолучитьПодчиненныйЭлемент(УзелСумУплНП, "СумПУ_173.1");
	
	ЗаполненоОКТМО = ЗначениеЗаполнено(Раздел1.П000100001003);
	
	Если ЗаполненоОКТМО Тогда
		Если ЗначениеЗаполнено(Раздел1.П000100003003) И НЕ ЗначениеЗаполнено(П100100004003) Тогда
			РегламентированнаяОтчетность.УдалитьУзел(Узел_СумПУ_173_1);
		ИначеЕсли НЕ ЗначениеЗаполнено(Раздел1.П000100003003) Тогда
			РегламентированнаяОтчетность.УдалитьУзел(Узел_СумПУ_173_5);
		КонецЕсли;
	Иначе
		РегламентированнаяОтчетность.УдалитьУзел(Узел_СумПУ_173_5);
		РегламентированнаяОтчетность.УдалитьУзел(Узел_СумПУ_173_1);
	КонецЕсли;
	
	ЗадатьЗначениеЭлемента(УзелСумУплНП, "НомДогИТ",     Раздел1.П000100006003);
	ЗадатьЗначениеЭлемента(УзелСумУплНП, "ДатаНачДогИТ", Раздел1.П000100007003);
	ЗадатьЗначениеЭлемента(УзелСумУплНП, "ДатаКонДогИТ", Раздел1.П000100008003);
	
	// Раздел 2.
	УзелСумУплНАШаблон = ПолучитьПодчиненныйЭлемент(УзелРодитель, "СумУплНА");
	Для Каждого ЛистРаздела2 Из Раздел2 Цикл
		
		УзелСумУплНА = СкопироватьУзел(УзелРодитель, УзелСумУплНАШаблон);
		ЗаполнитьДаннымиУзел(ЛистРаздела2.Данные[0].Значение, УзелСумУплНА);
		
		ИННЭкземпляраРаздела = СокрЛП(ЛистРаздела2.Данные[0].Значение.П000200003003);
		Если СтрДлина(ИННЭкземпляраРаздела) = 10 ИЛИ НЕ ЗначениеЗаполнено(ИННЭкземпляраРаздела) Тогда
			РегламентированнаяОтчетность.УдалитьУзел(ПолучитьПодчиненныйЭлемент(УзелСумУплНА, "СведПродФЛ"));
		ИначеЕсли СтрДлина(ИННЭкземпляраРаздела) = 12 Тогда
			РегламентированнаяОтчетность.УдалитьУзел(ПолучитьПодчиненныйЭлемент(УзелСумУплНА, "СведПродЮЛ"));
		КонецЕсли;
		
	КонецЦикла;
	
	// Раздел 3.
	УзелСумУпл164 = ПолучитьПодчиненныйЭлемент(УзелРодитель, "СумУпл164");
	ЗадатьЗначениеЭлемента(УзелСумУпл164, "НалПУ164", ?(ЗначениеСуммыЗаполнено(Раздел3.П000300021003), -Раздел3.П000300021003, Раздел3.П000300020003));
	ЗаполнитьДаннымиУзел(Раздел3, ПолучитьПодчиненныйЭлемент(УзелСумУпл164, "СумНалОб"));
	ЗаполнитьДаннымиУзел(Раздел3, ПолучитьПодчиненныйЭлемент(УзелСумУпл164, "СумНалВыч"));
	
	// Раздел 3 приложение 1.
	УзелСумВосУплШаблон = ПолучитьПодчиненныйЭлемент(УзелСумУпл164, "СумВосУпл");
	Для Каждого ЛистРаздел3Прил1 Из Раздел3_Прил1 Цикл
		УзелСумВосУпл = СкопироватьУзел(УзелСумУпл164, УзелСумВосУплШаблон);
		ДанныеЛистРаздел3Прил1 = ЛистРаздел3Прил1.Данные[0].Значение;
		Для Каждого Узел Из УзелСумВосУпл.Строки Цикл
			Если Узел.Тип = "А" ИЛИ Узел.Тип = "A" Тогда
				ВывестиПоказательВXML(Узел, ДанныеЛистРаздел3Прил1[Узел.Ключ]);
			КонецЕсли;
		КонецЦикла;
		УзелСведНалГодШаблон = ПолучитьПодчиненныйЭлемент(УзелСумВосУпл, "СведНалГод");
		Инд = 1;
		Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ДанныеЛистРаздел3Прил1, "П000310007001_" + Формат(Инд, "ЧГ=")) Цикл
			УзелСведНалГод = СкопироватьУзел(УзелСумВосУпл, УзелСведНалГодШаблон);
			ВыгрузитьСтрокуМногострочнойЧасти(ДанныеЛистРаздел3Прил1, УзелСведНалГод, Инд);
			Инд = Инд + 1;
		КонецЦикла;
	КонецЦикла;
	
	// Раздел 3 приложение 2.
	УзелСумВычИн = ПолучитьПодчиненныйЭлемент(УзелСумУпл164, "СумВычИн");
	УзелСведНалГодИШаблон = ПолучитьПодчиненныйЭлемент(УзелСумВычИн, "СведНалГодИ");
	Инд = 1;
	Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Раздел3_Прил2, "П000320000101_" + Формат(Инд, "ЧГ=")) Цикл
		УзелСведНалГодИ = СкопироватьУзел(УзелСумВычИн, УзелСведНалГодИШаблон);
		ВыгрузитьСтрокуМногострочнойЧасти(Раздел3_Прил2, УзелСведНалГодИ, Инд);
		Инд = Инд + 1;
	КонецЦикла;
	
	// Раздел 4.
	УзелНалПодтв0 = ПолучитьПодчиненныйЭлемент(УзелРодитель, "НалПодтв0");
	ЗадатьЗначениеЭлемента(УзелНалПодтв0, "СумИсчислИтог", ?(ЗначениеСуммыЗаполнено(Раздел4.П000400013003), -Раздел4.П000400013003, Раздел4.П000400012003));
	УзелСумОперШаблон = ПолучитьПодчиненныйЭлемент(УзелНалПодтв0, "СумОпер4");
	Инд = 1;
	Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Раздел4, "П0004М1001003_" + Формат(Инд, "ЧГ=")) Цикл
		УзелСумОпер = СкопироватьУзел(УзелНалПодтв0, УзелСумОперШаблон);
		ВыгрузитьСтрокуМногострочнойЧасти(Раздел4, УзелСумОпер, Инд);
		Инд = Инд + 1;
	КонецЦикла;
	УзелКорНБВозврТовШаблон = ПолучитьПодчиненныйЭлемент(УзелНалПодтв0, "КорНБВозврТов");
	Инд = 1;
	Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Раздел4, "П0004М2006003_" + Формат(Инд, "ЧГ=")) Цикл
		УзелКорНБВозврТов = СкопироватьУзел(УзелНалПодтв0, УзелКорНБВозврТовШаблон);
		ВыгрузитьСтрокуМногострочнойЧасти(Раздел4, УзелКорНБВозврТов, Инд);
		Инд = Инд + 1;
	КонецЦикла;
	УзелКорНБИзмЦенШаблон = ПолучитьПодчиненныйЭлемент(УзелНалПодтв0, "КорНБИзмЦен");
	Инд = 1;
	Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Раздел4, "П0004М3009003_" + Формат(Инд, "ЧГ=")) Цикл
		УзелКорНБИзмЦен = СкопироватьУзел(УзелНалПодтв0, УзелКорНБИзмЦенШаблон);
		ВыгрузитьСтрокуМногострочнойЧасти(Раздел4, УзелКорНБИзмЦен, Инд);
		Инд = Инд + 1;
	КонецЦикла;
	
	// Раздел 5.
	СумВозмПдтв   = 0;
	СумВозмНеПдтв = 0;
	УзелНалВычПред0 = ПолучитьПодчиненныйЭлемент(УзелРодитель, "НалВычПред0");
	УзелСумПерШаблон = ПолучитьПодчиненныйЭлемент(УзелНалВычПред0, "СумПер");
	Для Каждого ЛистРаздела5 Из Раздел5 Цикл
		ДанныеЛистаРаздела5 = ЛистРаздела5.Данные[0].Значение;
		УзелЛистаРаздела5 = СкопироватьУзел(УзелНалВычПред0, УзелСумПерШаблон);
		Для Каждого Узел Из УзелЛистаРаздела5.Строки Цикл
			Если Узел.Тип = "А" ИЛИ Узел.Тип = "A" Тогда
				ВывестиПоказательВXML(Узел, ДанныеЛистаРаздела5[Узел.Ключ]);
			КонецЕсли;
		КонецЦикла;
		Если Раздел5.Индекс(ЛистРаздела5) = 0 Тогда
			СумВозмПдтв   = ДанныеЛистаРаздела5.П000500008003;
			СумВозмНеПдтв = ДанныеЛистаРаздела5.П000500009003;
		КонецЕсли;
		УзелСумОперШаблон = ПолучитьПодчиненныйЭлемент(УзелЛистаРаздела5, "СумОпер5");
		Инд = 1;
		Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ДанныеЛистаРаздела5, "П000500003003_" + Формат(Инд, "ЧГ=")) Цикл
			УзелСумОпер = СкопироватьУзел(УзелЛистаРаздела5, УзелСумОперШаблон);
			ВыгрузитьСтрокуМногострочнойЧасти(ДанныеЛистаРаздела5, УзелСумОпер, Инд, "П000500003003");
			Инд = Инд + 1;
		КонецЦикла;
	КонецЦикла;
	ЗадатьЗначениеЭлемента(УзелНалВычПред0, "СумВозмПдтв", СумВозмПдтв);
	ЗадатьЗначениеЭлемента(УзелНалВычПред0, "СумВозмНеПдтв", СумВозмНеПдтв);
	
	// Раздел 6.
	УзелНалНеПодтв0 = ПолучитьПодчиненныйЭлемент(УзелРодитель, "НалНеПодтв0");
	ЗадатьЗначениеЭлемента(УзелНалНеПодтв0, "СумНал164Ит", Раздел6.П000600005003);
	ЗадатьЗначениеЭлемента(УзелНалНеПодтв0, "НалВычНеПодИт", Раздел6.П000600006003);
	ЗадатьЗначениеЭлемента(УзелНалНеПодтв0, "НалИсчислИт", ?(ЗначениеСуммыЗаполнено(Раздел6.П000600017003), -Раздел6.П000600017003, Раздел6.П000600016003));
	УзелСумОперШаблон = ПолучитьПодчиненныйЭлемент(УзелНалНеПодтв0, "СумОпер6");
	Инд = 1;
	Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Раздел6, "П0006М1001003_" + Формат(Инд, "ЧГ=")) Цикл
		УзелСумОпер = СкопироватьУзел(УзелНалНеПодтв0, УзелСумОперШаблон);
		ВыгрузитьСтрокуМногострочнойЧасти(Раздел6, УзелСумОпер, Инд);
		Инд = Инд + 1;
	КонецЦикла;
	УзелКорНалВозврТовШаблон = ПолучитьПодчиненныйЭлемент(УзелНалНеПодтв0, "КорНалВозврТов");
	Инд = 1;
	Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Раздел6, "П0006М2007003_" + Формат(Инд, "ЧГ=")) Цикл
		УзелКорНалВозврТов = СкопироватьУзел(УзелНалНеПодтв0, УзелКорНалВозврТовШаблон);
		ВыгрузитьСтрокуМногострочнойЧасти(Раздел6, УзелКорНалВозврТов, Инд);
		Инд = Инд + 1;
	КонецЦикла;
	УзелКорНалИзмЦенШаблон = ПолучитьПодчиненныйЭлемент(УзелНалНеПодтв0, "КорНалИзмЦен");
	Инд = 1;
	Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Раздел6, "П0006М3011003_" + Формат(Инд, "ЧГ=")) Цикл
		УзелКорНалИзмЦен = СкопироватьУзел(УзелНалНеПодтв0, УзелКорНалИзмЦенШаблон);
		ВыгрузитьСтрокуМногострочнойЧасти(Раздел6, УзелКорНалИзмЦен, Инд);
		Инд = Инд + 1;
	КонецЦикла;
	
	// Раздел 7.
	УзелОперНеНал = ПолучитьПодчиненныйЭлемент(УзелРодитель, "ОперНеНал");
	ЗадатьЗначениеЭлемента(УзелОперНеНал, "ОплПостСв6Мес", Раздел7.П000700001001);
	Инд = 1;
	УзелСумОперШаблон = ПолучитьПодчиненныйЭлемент(УзелОперНеНал, "СумОпер7");
	Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Раздел7, "П000700000101_" + Формат(Инд, "ЧГ=")) Цикл
		УзелСумОпер = СкопироватьУзел(УзелОперНеНал, УзелСумОперШаблон);
		ВыгрузитьСтрокуМногострочнойЧасти(Раздел7, УзелСумОпер, Инд);
		Инд = Инд + 1;
	КонецЦикла;
	
	// Разделы 8-12
	УзелКнигаПокуп = ПолучитьПодчиненныйЭлемент(УзелРодитель, "КнигаПокуп");
	ЗадатьЗначениеЭлемента(УзелКнигаПокуп, "НаимКнПок", "NO_NDS.8");
	
	УзелКнигаПокупДЛ = ПолучитьПодчиненныйЭлемент(УзелРодитель, "КнигаПокупДЛ");
	ЗадатьЗначениеЭлемента(УзелКнигаПокупДЛ, "НаимКнПокДЛ", "NO_NDS.81");
	
	УзелКнигаПрод = ПолучитьПодчиненныйЭлемент(УзелРодитель, "КнигаПрод");
	ЗадатьЗначениеЭлемента(УзелКнигаПрод, "НаимКнПрод", "NO_NDS.9");
	
	УзелКнигаПродДЛ = ПолучитьПодчиненныйЭлемент(УзелРодитель, "КнигаПродДЛ");
	ЗадатьЗначениеЭлемента(УзелКнигаПродДЛ, "НаимКнПродДЛ", "NO_NDS.91");
	
	УзелЖУчВыстСчФ = ПолучитьПодчиненныйЭлемент(УзелРодитель, "ЖУчВыстСчФ");
	ЗадатьЗначениеЭлемента(УзелЖУчВыстСчФ, "НаимЖУчВыстСчФ", "NO_NDS.10");
	
	УзелЖУчПолучСчФ = ПолучитьПодчиненныйЭлемент(УзелРодитель, "ЖУчПолучСчФ");
	ЗадатьЗначениеЭлемента(УзелЖУчПолучСчФ, "НаимЖУчПолучСчФ", "NO_NDS.11");
	
	УзелВыстСчФ_173_5 = ПолучитьПодчиненныйЭлемент(УзелРодитель, "ВыстСчФ_173.5");
	ЗадатьЗначениеЭлемента(УзелВыстСчФ_173_5, "НаимВыстСчФ_173.5", "NO_NDS.12");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОРазделах8_12(ДеревоВыгрузки, ПараметрыВыгрузки)
	
	УзелНДС = ДеревоВыгрузки.Строки.Найти("НДС", "Код", Истина);
	
	Если УзелНДС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПризнакиЗаполненностиРазделов8_12 = Новый Структура;
	ПризнакиЗаполненностиРазделов8_12.Вставить("ПризнНал8",  "0");
	ПризнакиЗаполненностиРазделов8_12.Вставить("ПризнНал81", "0");
	ПризнакиЗаполненностиРазделов8_12.Вставить("ПризнНал9",  "0");
	ПризнакиЗаполненностиРазделов8_12.Вставить("ПризнНал91", "0");
	ПризнакиЗаполненностиРазделов8_12.Вставить("ПризнНал10", "0");
	ПризнакиЗаполненностиРазделов8_12.Вставить("ПризнНал11", "0");
	ПризнакиЗаполненностиРазделов8_12.Вставить("ПризнНал12", "0");
	
	ЕстьРазделы8_12 = Ложь;
	
	ИмяФайлаСведенийРаздела = Неопределено;
	
	УзелКнигаПокуп = ПолучитьПодчиненныйЭлемент(УзелНДС, "КнигаПокуп");
	Если ПараметрыВыгрузки.Свойство("ИдФайлРаздел8", ИмяФайлаСведенийРаздела) Тогда
		ЗадатьЗначениеЭлемента(УзелКнигаПокуп, "НаимКнПок", ИмяФайлаСведенийРаздела + ".xml");
		ПризнакиЗаполненностиРазделов8_12.Вставить("ПризнНал8", "1");
		ЕстьРазделы8_12 = Истина;
	Иначе
		РегламентированнаяОтчетность.УдалитьУзел(УзелКнигаПокуп);
	КонецЕсли;
	
	УзелКнигаПокупДЛ = ПолучитьПодчиненныйЭлемент(УзелНДС, "КнигаПокупДЛ");
	Если ПараметрыВыгрузки.Свойство("ИдФайлРаздел8_Прил1", ИмяФайлаСведенийРаздела) Тогда
		ЗадатьЗначениеЭлемента(УзелКнигаПокупДЛ, "НаимКнПокДЛ", ИмяФайлаСведенийРаздела + ".xml");
		ПризнакиЗаполненностиРазделов8_12.Вставить("ПризнНал81", "1");
		ЕстьРазделы8_12 = Истина;
	Иначе
		РегламентированнаяОтчетность.УдалитьУзел(УзелКнигаПокупДЛ);
	КонецЕсли;
	
	УзелКнигаПрод = ПолучитьПодчиненныйЭлемент(УзелНДС, "КнигаПрод");
	Если ПараметрыВыгрузки.Свойство("ИдФайлРаздел9", ИмяФайлаСведенийРаздела) Тогда
		ЗадатьЗначениеЭлемента(УзелКнигаПрод, "НаимКнПрод", ИмяФайлаСведенийРаздела + ".xml");
		ПризнакиЗаполненностиРазделов8_12.Вставить("ПризнНал9", "1");
		ЕстьРазделы8_12 = Истина;
	Иначе
		РегламентированнаяОтчетность.УдалитьУзел(УзелКнигаПрод);
	КонецЕсли;
	
	УзелКнигаПродДЛ = ПолучитьПодчиненныйЭлемент(УзелНДС, "КнигаПродДЛ");
	Если ПараметрыВыгрузки.Свойство("ИдФайлРаздел9_Прил1", ИмяФайлаСведенийРаздела) Тогда
		ЗадатьЗначениеЭлемента(УзелКнигаПродДЛ, "НаимКнПродДЛ", ИмяФайлаСведенийРаздела + ".xml");
		ПризнакиЗаполненностиРазделов8_12.Вставить("ПризнНал91", "1");
		ЕстьРазделы8_12 = Истина;
	Иначе
		РегламентированнаяОтчетность.УдалитьУзел(УзелКнигаПродДЛ);
	КонецЕсли;
	
	УзелЖУчВыстСчФ = ПолучитьПодчиненныйЭлемент(УзелНДС, "ЖУчВыстСчФ");
	Если ПараметрыВыгрузки.Свойство("ИдФайлРаздел10", ИмяФайлаСведенийРаздела) Тогда
		ЗадатьЗначениеЭлемента(УзелЖУчВыстСчФ, "НаимЖУчВыстСчФ", ИмяФайлаСведенийРаздела + ".xml");
		ПризнакиЗаполненностиРазделов8_12.Вставить("ПризнНал10", "1");
		ЕстьРазделы8_12 = Истина;
	Иначе
		РегламентированнаяОтчетность.УдалитьУзел(УзелЖУчВыстСчФ);
	КонецЕсли;
	
	УзелЖУчПолучСчФ = ПолучитьПодчиненныйЭлемент(УзелНДС, "ЖУчПолучСчФ");
	Если ПараметрыВыгрузки.Свойство("ИдФайлРаздел11", ИмяФайлаСведенийРаздела) Тогда
		ЗадатьЗначениеЭлемента(УзелЖУчПолучСчФ, "НаимЖУчПолучСчФ", ИмяФайлаСведенийРаздела + ".xml");
		ПризнакиЗаполненностиРазделов8_12.Вставить("ПризнНал11", "1");
		ЕстьРазделы8_12 = Истина;
	Иначе
		РегламентированнаяОтчетность.УдалитьУзел(УзелЖУчПолучСчФ);
	КонецЕсли;
	
	УзелВыстСчФ_173_5 = ПолучитьПодчиненныйЭлемент(УзелНДС, "ВыстСчФ_173.5");
	Если ПараметрыВыгрузки.Свойство("ИдФайлРаздел12", ИмяФайлаСведенийРаздела) Тогда
		ЗадатьЗначениеЭлемента(УзелВыстСчФ_173_5, "НаимВыстСчФ_173.5", ИмяФайлаСведенийРаздела + ".xml");
		ПризнакиЗаполненностиРазделов8_12.Вставить("ПризнНал12", "1");
		ЕстьРазделы8_12 = Истина;
	Иначе
		РегламентированнаяОтчетность.УдалитьУзел(УзелВыстСчФ_173_5);
	КонецЕсли;
	
	Если ЕстьРазделы8_12 Тогда
		ЗадатьЗначениеЭлемента(ДеревоВыгрузки, "ПризнНал8-12", "1");
	КонецЕсли;
	
	Для каждого ИмяПризнакаИЗначение Из ПризнакиЗаполненностиРазделов8_12 Цикл
		УзелПризнакаЗаполненностиРаздела = ПолучитьПодчиненныйЭлемент(ДеревоВыгрузки, ИмяПризнакаИЗначение.Ключ);
		Если ЕстьРазделы8_12 Тогда
			ВывестиПоказательВXML(УзелПризнакаЗаполненностиРаздела, ИмяПризнакаИЗначение.Значение);
		Иначе
			РегламентированнаяОтчетность.УдалитьУзел(УзелПризнакаЗаполненностиРаздела);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВывестиПоказательВXML(Узел, ЗначениеПоказателя)
	
	МинШирина = Узел.МинРазмерность;
	МаксШирина = Узел.МаксРазмерность;
	
	Если Узел.Формат = "T" ИЛИ Узел.Формат = "Т" ИЛИ Узел.Формат = "S" Тогда // учтем оба варианта: кириллицу и латиницу	
		Если ТипЗнч(ЗначениеПоказателя) = Тип("Дата") Тогда
			ЗначениеПоказателяСтр = Формат(ЗначениеПоказателя, "ДФ=dd.MM.yyyy");
		Иначе
			ЗначениеПоказателяСтр = СокрЛП(ЗначениеПоказателя);
		КонецЕсли;
		Узел.Значение = ?(МаксШирина < СтрДлина(ЗначениеПоказателяСтр), СокрЛП(Лев(ЗначениеПоказателяСтр, МаксШирина)), ЗначениеПоказателяСтр);
	ИначеЕсли Узел.Формат = "N" Тогда
		СтрокаФормата = "ЧРД=.;ЧН=0;ЧГ=;";
		Если Узел.МаксРазмерность <> 0 И Узел.МаксРазмерность <> 99999 Тогда
			СтрокаФормата = СтрокаФормата + "ЧЦ=" + Формат(Узел.МаксРазмерность, "ЧГ=") + ";";
		КонецЕсли;
		Если Узел.МинРазмерность <> 99999 Тогда
			СтрокаФормата = СтрокаФормата + "ЧДЦ=" + Формат(Узел.МинРазмерность, "ЧГ=") + ";";
		КонецЕсли;
		Узел.Значение = СокрЛП(Формат(ЗначениеПоказателя, СтрокаФормата));
	ИначеЕсли Узел.Формат = "gYear" Тогда
		Если ТипЗнч(ЗначениеПоказателя) = Тип("Дата") Тогда
			Узел.Значение = СокрЛП(Формат(ЗначениеПоказателя, "ДФ=гггг"));
		Иначе
			Узел.Значение = Прав(СокрЛП(ЗначениеПоказателя), 4);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция УзелПуст(Узел)
	
	Для Каждого Стр из Узел.Строки Цикл
		Если НЕ УзелПуст(Стр) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если Узел.Формат = "S" Тогда
		Возврат Истина;
	ИначеЕсли Узел.Формат = "N" Тогда
		Возврат Узел.Значение = "0" ИЛИ (НЕ ЗначениеЗаполнено(Узел.Значение));
	Иначе
		Возврат НЕ ЗначениеЗаполнено(Узел.Значение);
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьПодчиненныйЭлемент(Узел, КодЭлемента)
	
	Для Каждого Стр Из Узел.Строки Цикл
		Если Стр.Код = КодЭлемента Тогда
			Возврат Стр;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаСервере
Процедура ЗадатьЗначениеЭлемента(Узел, КодЭлемента, Значение)
	
	ВывестиПоказательВXML(ПолучитьПодчиненныйЭлемент(Узел, КодЭлемента), Значение);
	
КонецПроцедуры

&НаСервере
Функция СкопироватьУзел(Родитель, Узел)
	
	// находим узел в максимальным индексом с тем же кодом, что и у копируемого и добавляем его сразу после найденного элемента
	СтрокиСТемЖеКодом = Родитель.Строки.НайтиСтроки(Новый Структура("Код", Узел.Код), Ложь);
	МаксИндекс = -1;
	Для Каждого СтрокаСТемЖеКодом Из СтрокиСТемЖеКодом Цикл
		ТекИндекс = Родитель.Строки.Индекс(СтрокаСТемЖеКодом);
		Если ТекИндекс > МаксИндекс Тогда
			МаксИндекс = ТекИндекс;
		КонецЕсли;
	КонецЦикла;
	
	ИндексСоздаваемогоУзла = МаксИндекс + 1;
	Если ИндексСоздаваемогоУзла >= Родитель.Строки.Количество() ИЛИ ИндексСоздаваемогоУзла = 0 Тогда // если аналогичный узел не найден или найденный узел - последний
		НовыйУзел = Родитель.Строки.Добавить();
	Иначе
		НовыйУзел = Родитель.Строки.Вставить(ИндексСоздаваемогоУзла);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйУзел, Узел, , "Родитель, Строки");
	Для Каждого Стр из Узел.Строки Цикл
		СкопироватьУзел(НовыйУзел, Стр);
	КонецЦикла;
	Возврат НовыйУзел;
	
КонецФункции

&НаСервере
Процедура ВыгрузитьСтрокуМногострочнойЧасти(Данные, Узел, НомерСтроки, ПоказателиИсключения = Неопределено)
	
	Если ПоказателиИсключения = Неопределено Тогда
		СтрИсключения = Новый Структура;
	Иначе
		СтрИсключения = Новый Структура(ПоказателиИсключения);
	КонецЕсли;
	
	СуффиксТекущейСтроки = "_" + Формат(НомерСтроки, "ЧГ=");
	
	СтрокаПустая = Истина;
	Для Каждого Стр Из Узел.Строки Цикл
		Если НЕ СтрИсключения.Свойство(Стр.Ключ) И ЗначениеПоказателяЗаполнено(Данные[Стр.Ключ + СуффиксТекущейСтроки], Стр) Тогда
			СтрокаПустая = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ СтрокаПустая Тогда
		Для Каждого Стр Из Узел.Строки Цикл
			ВывестиПоказательВXML(Стр, Данные[Стр.Ключ + СуффиксТекущейСтроки]);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьЯчейку(Ячейка) Экспорт
	
	Если Ячейка.Свойство("Раздел") И ЭтоРазделРегистраУчетаНДС(Ячейка.Раздел)
		И Элементы.РазделыОтчета.ТекущиеДанные <> Неопределено Тогда
		УзелСтраницРаздела = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", Ячейка.Раздел);
		Если УзелСтраницРаздела <> Неопределено Тогда
			
			СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Истина;
			
			СписокСтраниц = ЭтаФорма["Страницы" + Ячейка.Раздел];
			
			Если СписокСтраниц.Количество() > 0 Тогда
				ТипЧисло = Новый ОписаниеТипов("Число");
				НомерСтрокиСОшибкой = ТипЧисло.ПривестиЗначение(Ячейка.Страница);
				РазмерСегмента = СписокСтраниц[0].НомерПоследнейСтроки - СписокСтраниц[0].НомерПервойСтроки + 1;
				
				НомерСегмента = Цел((НомерСтрокиСОшибкой - 1) / РазмерСегмента) + 1;
				ОтображемаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(УзелСтраницРаздела.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСегмента);
			Иначе
				ОтображемаяСтрока = УзелСтраницРаздела;
			КонецЕсли;
			Элементы.РазделыОтчета.ТекущаяСтрока = ОтображемаяСтрока.ПолучитьИдентификатор();
			
			Если Лев(Ячейка.Страница, 6) = "e1cib/" Тогда
				ПерейтиПоНавигационнойСсылке(Ячейка.Страница);
				
			Иначе
				ОбластьСтроки = ТабличныйДокументУчетаНДС.Области.Найти("Строка_" + Ячейка.Страница);
				Если ОбластьСтроки <> Неопределено Тогда
					ТипЧисло = Новый ОписаниеТипов("Число");
					НомерГрафы = ТипЧисло.ПривестиЗначение(Ячейка.ИмяЯчейки);
					ОбластьСОшибкой = ТабличныйДокументУчетаНДС.Область(ОбластьСтроки.Верх, НомерГрафы, ОбластьСтроки.Низ, НомерГрафы);
					Элементы.ТабличныйДокументУчетаНДС.ТекущаяОбласть = ОбластьСОшибкой;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		РегламентированнаяОтчетностьКлиент.АктивизироватьЯчейку(ЭтаФорма, Ячейка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузку(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьВыгрузкуЗавершение", ЭтотОбъект);
	
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузкуЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьВыгрузкуОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузкуОтчета()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьВыгрузкуОтчетаЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(, ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузкуОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.Проверить(СпДокОсн);
	
	ВывестиРезультатПроверки();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВыгрузкуПоНовомуАлгоритмуНаСервере()
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ШаблоныОшибок = Отчеты.РегламентированныйОтчетНДС.ПолучитьМакет("ШаблоныСообщенийОбОшибках2017Кв1");
	РегламентированныйОтчет = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	
	СтруктураРеквизитовФормы.Вставить("АдресХранилищаПроверкиВыгрузки", АдресХранилища);
	
	РегламентированнаяОтчетностьПроверкаНДС.ВыявитьОшибкиЗаполненияПрепятствующиеФормированиюЭлектронногоПредставления_ФормаОтчета2017Кв1(РегламентированныйОтчет, ШаблоныОшибок, Заголовок, АдресХранилища);
	
	ЗаписатьРезультатПроверкиВыгрузки();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПоказатели() Экспорт
	
	ПроверитьВыгрузкуПоНовомуАлгоритмуНаСервере();
	
	Результат = ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы.АдресХранилищаПроверкиВыгрузки);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСДвухмернымШтрихкодомPDF417(Команда)
	
	РегламентированнаяОтчетностьКлиент.ВывестиМашиночитаемуюФорму(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланк(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланкЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
		
	Печать(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(ВидПечати, НеИзФормыОтчета = Ложь) Экспорт
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='%1. Формируется печатная форма...';ru='%1. Формируется печатная форма...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Печать);
	
	Если НЕ ПечатьНаСервере(ВидПечати) Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ЭтаФорма, ВидПечати, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ВидПечати)
	
	Если НЕ РегламентированнаяОтчетность.ПринтерДоступен() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='ბეჭდური ფორმების ჩამოყალიბებამდე აუცილებელია სისტემაში პრინტერის გარკვევა და მისი მიცემა როგორც სტანდარტულად გამოსაყენებელი!';ru='Перед формированием печатных форм необходимо определить в системе принтер и задать его в качестве используемого по умолчанию!'");
		Сообщение.Сообщить();
		Возврат Ложь;
		
	КонецЕсли;
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения
		<> ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1
		ИЛИ СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения <> 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='Печать возможна только при установленной единице измерения ""в рублях"" и точности ""0"".';ru='Печать возможна только при установленной единице измерения ""в рублях"" и точности ""0"".'");
		Сообщение.Сообщить();
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ТипЗнч(мДеревоВыбранныхСтраниц) <> Тип("ДанныеФормыДерево") Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мПечатныеФормы.Очистить();
	СтруктураРеквизитовФормы.мРежимПечати = Истина;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь, Ложь);
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел8"
	 ИЛИ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел8_Прил1"
	 ИЛИ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел9"
	 ИЛИ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел9_Прил1"
	 ИЛИ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел10"
	 ИЛИ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел11"
	 ИЛИ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел12" Тогда
		сохрТаблДок = ТабличныйДокументУчетаНДС.ПолучитьОбласть();
	Иначе
		сохрТаблДок = ТабличныйДокумент.ПолучитьОбласть();
	КонецЕсли;
	
	СтрПоля = "ПолеСверху, ПолеСправа, ПолеСнизу, ПолеСлева";
	ВремПоля = Новый Структура(СтрПоля);
	
	ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
	
	ВывестиМакетВТаблДокНаСервере("Титульный", 0);
	
	ОбщиеРеквизитыРазделов = ПолучитьОбщиеРеквизитыСТитульногоЛиста();
	
	Для Каждого СтрокаУровня1 Из мДеревоВыбранныхСтраниц.ПолучитьЭлементы() Цикл
		
		Если СтрокаУровня1.ВыводНаПечать = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НаименованиеЛиста",  СтрокаУровня1.Представление);
		СтруктураПараметров.Вставить("ОриентацияЛиста",    СтрокаУровня1.ОриентацияСтраницы);
		СтруктураПараметров.Вставить("ИмяСтраницы",        СтрокаУровня1.ИмяСтраницы);
		Структурапараметров.Вставить("ИмяОбластиТаблПоля", СтрокаУровня1.ИмяОбластиТабличногоПоля);
		СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
		
		Если СтрокаУровня1.ИмяСтраницы = "Раздел8"
		 ИЛИ СтрокаУровня1.ИмяСтраницы = "Раздел8_Прил1"
		 ИЛИ СтрокаУровня1.ИмяСтраницы = "Раздел9"
		 ИЛИ СтрокаУровня1.ИмяСтраницы = "Раздел9_Прил1"
		 ИЛИ СтрокаУровня1.ИмяСтраницы = "Раздел10"
		 ИЛИ СтрокаУровня1.ИмяСтраницы = "Раздел11"
		 ИЛИ СтрокаУровня1.ИмяСтраницы = "Раздел12" Тогда
			
			Если СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Неопределено Тогда
				ВывестиНаПечатьЛистыРазделов8_12_ЗаполненныхБезДеленияНаСекции(
				СтруктураПараметров, ОбщиеРеквизитыРазделов, СтрПоля);
			Иначе
				ВывестиНаПечатьЛистыРазделов8_12_ЗаполненныхСДелениемНаСекции(
				СтруктураПараметров, ОбщиеРеквизитыРазделов, СтрПоля);
			КонецЕсли;
			
		Иначе
			
			Если НЕ мСтруктураМногостраничныхРазделов.Свойство(СтрокаУровня1.ИмяСтраницы) Тогда
				ВывестиМакетВТаблДокНаСервере(СтрокаУровня1.ИмяСтраницы, 0);
				ВывестиНаПечатьЛист(СтруктураПараметров, ОбщиеРеквизитыРазделов, СтрПоля);
			Иначе
				СтруктураПараметров.Вставить("ИмяСтраницыПанели", СтрокаУровня1.ИмяСтраницы);
				ВывестиНаПечатьДополнительныеСтраницы(СтруктураПараметров, ОбщиеРеквизитыРазделов);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел8"
		ИЛИ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел8_Прил1"
		ИЛИ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел9"
		ИЛИ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел9_Прил1"
		ИЛИ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел10"
		ИЛИ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел11"
		ИЛИ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел12" Тогда
		Элементы.СтраницыОтчета.ТекущаяСтраница = Элементы.СтраницаРегистраУчетаНДС;
		ТабличныйДокументУчетаНДС.Очистить();
		ТабличныйДокументУчетаНДС.Вывести(сохрТаблДок);
	Иначе
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(сохрТаблДок);
		ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(ЭтаФорма, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	КопироватьДанныеФормы(мДеревоВыбранныхСтраниц, мДеревоСтраницОтчета);
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ВывестиНаПечатьЛист(Парам1, ОбщиеРеквизитыРазделов, СтрПоля = Неопределено)
	
	СоответствиеРазделовМакетам = Новый Соответствие;
	
	СоответствиеРазделовМакетам.Вставить("Титульный",     "ПечатныйБланк2017Кв1_Титульный");
	СоответствиеРазделовМакетам.Вставить("Раздел1",       "ПечатныйБланк2017Кв1_Раздел1");
	СоответствиеРазделовМакетам.Вставить("Раздел2",       "ПечатныйБланк2017Кв1_Раздел2");
	СоответствиеРазделовМакетам.Вставить("Раздел3",       "ПечатныйБланк2017Кв1_Раздел3");
	СоответствиеРазделовМакетам.Вставить("Раздел3_Прил1", "ПечатныйБланк2017Кв1_Раздел3_Прил1");
	СоответствиеРазделовМакетам.Вставить("Раздел3_Прил2", "ПечатныйБланк2017Кв1_Раздел3_Прил2");
	СоответствиеРазделовМакетам.Вставить("Раздел4",       "ПечатныйБланк2017Кв1_Раздел4");
	СоответствиеРазделовМакетам.Вставить("Раздел5",       "ПечатныйБланк2017Кв1_Раздел5");
	СоответствиеРазделовМакетам.Вставить("Раздел6",       "ПечатныйБланк2017Кв1_Раздел6");
	СоответствиеРазделовМакетам.Вставить("Раздел7",       "ПечатныйБланк2017Кв1_Раздел7");
	
	МЧБРаздела = СоответствиеРазделовМакетам[Парам1.ИмяСтраницы];
	
	МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
	МакетМЧБ.ПолеСверху = 5;
	МакетМЧБ.ПолеСправа = 5;
	МакетМЧБ.ПолеСнизу  = 5;
	МакетМЧБ.ПолеСлева  = 5;
	
	ВремПоля = Новый Структура(СтрПоля);
	
	Если Парам1.ИмяСтраницы = "Раздел4" Тогда
		ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы4М1;
	ИначеЕсли Парам1.ИмяСтраницы = "Раздел6" Тогда
		ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы6М1;
	Иначе
		ИдГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(Парам1.ИмяСтраницы);
	КонецЕсли;
	
	Если ИдГруппы <> Неопределено Тогда
		
		ИсхКолвоСтрокБлока = 0;
		
		//определение исходного количества строк на листе МЧБ
		Если Парам1.ИмяСтраницы = "Раздел3_Прил2" Тогда
			ИсхКолвоСтрокБлока = 23;
		ИначеЕсли Парам1.ИмяСтраницы = "Раздел4" Тогда
			ИмяГруппы1 = СтруктураРеквизитовФормы.мИдГруппы4М1;
			ИмяГруппы2 = СтруктураРеквизитовФормы.мИдГруппы4М2;
			ИмяГруппы3 = СтруктураРеквизитовФормы.мИдГруппы4М3;
			ТекКолвоСтрокБлокаМ1 = ЭтаФорма[ИмяГруппы1].Количество();
			ТекКолвоСтрокБлокаМ2 = ЭтаФорма[ИмяГруппы2].Количество();
			ТекКолвоСтрокБлокаМ3 = ЭтаФорма[ИмяГруппы3].Количество();
			ИсхКолвоСтрокБлокаМ1 = 4;
			ИсхКолвоСтрокБлокаМ2 = 1;
			ИсхКолвоСтрокБлокаМ3 = 1;
		ИначеЕсли Парам1.ИмяСтраницы = "Раздел5" Тогда
			ИсхКолвоСтрокБлока = 3;
		ИначеЕсли Парам1.ИмяСтраницы = "Раздел6" Тогда
			ИмяГруппы1 = СтруктураРеквизитовФормы.мИдГруппы6М1;
			ИмяГруппы2 = СтруктураРеквизитовФормы.мИдГруппы6М2;
			ИмяГруппы3 = СтруктураРеквизитовФормы.мИдГруппы6М3;
			ТекКолвоСтрокБлокаМ1 = ЭтаФорма[ИмяГруппы1].Количество();
			ТекКолвоСтрокБлокаМ2 = ЭтаФорма[ИмяГруппы2].Количество();
			ТекКолвоСтрокБлокаМ3 = ЭтаФорма[ИмяГруппы3].Количество();
			ИсхКолвоСтрокБлокаМ1 = 2;
			ИсхКолвоСтрокБлокаМ2 = 1;
			ИсхКолвоСтрокБлокаМ3 = 1;
		ИначеЕсли Парам1.ИмяСтраницы = "Раздел7" Тогда
			ИсхКолвоСтрокБлока = 21;
		КонецЕсли;
		
		СохрТабличныйДокумент = Новый ТабличныйДокумент;
		СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
		
		Если Парам1.ИмяСтраницы = "Раздел4"
			ИЛИ Парам1.ИмяСтраницы = "Раздел6" Тогда
			
			Если (ТекКолвоСтрокБлокаМ1 > 0 И ИсхКолвоСтрокБлокаМ1 > 0)
			 ИЛИ (ТекКолвоСтрокБлокаМ2 > 0 И ИсхКолвоСтрокБлокаМ2 > 0)
			 ИЛИ (ТекКолвоСтрокБлокаМ3 > 0 И ИсхКолвоСтрокБлокаМ3 > 0) Тогда
				
				ДробноеКолвоЛистовМЧБ = Макс(
				?(ТекКолвоСтрокБлокаМ1 > ИсхКолвоСтрокБлокаМ1, ТекКолвоСтрокБлокаМ1 / ИсхКолвоСтрокБлокаМ1, 1),
				?(ТекКолвоСтрокБлокаМ2 > ИсхКолвоСтрокБлокаМ2, ТекКолвоСтрокБлокаМ2 / ИсхКолвоСтрокБлокаМ2, 1),
				?(ТекКолвоСтрокБлокаМ3 > ИсхКолвоСтрокБлокаМ3, ТекКолвоСтрокБлокаМ3 / ИсхКолвоСтрокБлокаМ3, 1));
				
				ЦелоеКолвоЛистовМЧБ = Цел(ДробноеКолвоЛистовМЧБ);
				
				КолвоЛистовМЧБ = ?(ДробноеКолвоЛистовМЧБ = ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ + 1);
				
				СтрИменаПоказателей = "";
				Колонки = ДанныеФормыВЗначение(ЭтаФорма[ИмяГруппы1], Тип("ТаблицаЗначений")).Колонки;
				Для Каждого КолонкаСтруктуры ИЗ Колонки Цикл
					СтрИменаПоказателей = СтрИменаПоказателей + КолонкаСтруктуры.Имя;
				КонецЦикла;
				Колонки = ДанныеФормыВЗначение(ЭтаФорма[ИмяГруппы2], Тип("ТаблицаЗначений")).Колонки;
				Для Каждого КолонкаСтруктуры ИЗ Колонки Цикл
					СтрИменаПоказателей = СтрИменаПоказателей + КолонкаСтруктуры.Имя;
				КонецЦикла;
				Колонки = ДанныеФормыВЗначение(ЭтаФорма[ИмяГруппы3], Тип("ТаблицаЗначений")).Колонки;
				Для Каждого КолонкаСтруктуры ИЗ Колонки Цикл
					СтрИменаПоказателей = СтрИменаПоказателей + КолонкаСтруктуры.Имя;
				КонецЦикла;
				
				СписокЛистовМЧБ = Новый СписокЗначений;
				Для Сч = 1 По КолвоЛистовМЧБ Цикл
					
					СписокОчищаемыхОбластей = Новый Массив;
					СписокОбластейПереименования = Новый СписокЗначений;
					Для каждого ТекущаяОбласть Из МакетМЧБ.Области Цикл
						ИмяЯчейки = ТекущаяОбласть.Имя;
						
						Если СтрДлина(ИмяЯчейки) < 13 ИЛИ СтрНайти(СтрИменаПоказателей, Лев(ИмяЯчейки, 13)) = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						ПоказательИНомерСтрокиСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Истина); // ВМЕСТЕ с разделителем
						ПоказательИНомерСтроки = Лев(ПоказательИНомерСтрокиСРазделителем,СтрДлина(ПоказательИНомерСтрокиСРазделителем) - 1);
						НомерЯчейки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Ложь);
						
						СмысловаяЧастьСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Истина); // ВМЕСТЕ с разделителем
						СмысловаяЧасть = Лев(СмысловаяЧастьСРазделителем,СтрДлина(СмысловаяЧастьСРазделителем) - 1);
						ТекущийСчетчик = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Ложь);
						
						Если СтрНайти(СтрИменаПоказателей,СмысловаяЧасть) = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						Если СтрНачинаетсяС(ТекущаяОбласть.Имя, Лев(ИмяГруппы1, 7)) Тогда
							НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаМ1);
							ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаМ1;
						ИначеЕсли СтрНачинаетсяС(ТекущаяОбласть.Имя, Лев(ИмяГруппы2, 7)) Тогда
							НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаМ2);
							ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаМ2;
						ИначеЕсли СтрНачинаетсяС(ТекущаяОбласть.Имя, Лев(ИмяГруппы3, 7)) Тогда
							НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаМ3);
							ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаМ3;
						КонецЕсли;
						
						Если НовыйСчетчик > ТекКолвоСтрокБлока Тогда
							СписокОчищаемыхОбластей.Добавить(ТекущаяОбласть);
							Продолжить;
						КонецЕсли;
						
						СписокОбластейПереименования.Добавить(ТекущаяОбласть, СмысловаяЧасть + "_" + НовыйСчетчик + "_" + НомерЯчейки);
						
					КонецЦикла;
					
					Для каждого ОбластьСписка Из СписокОчищаемыхОбластей Цикл
						ОбластьСписка.Имя = "";
						ОбластьСписка.Текст = ?(СокрЛП(ОбластьСписка.Текст) = ".", ".", "-");
					КонецЦикла;
					
					Для каждого ЭлСпискаОбластей Из СписокОбластейПереименования Цикл
						ЭлСпискаОбластей.Значение.Имя = ЭлСпискаОбластей.Представление;
					КонецЦикла;
					
					СписокЛистовМЧБ.Добавить(МакетМЧБ.ПолучитьОбласть());
					
				КонецЦикла;
				
				Для каждого элЛистМЧБ Из СписокЛистовМЧБ Цикл
					
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
					
					ЛистМЧБ = элЛистМЧБ.Значение;
					
					ЛистМЧБ.ПолеСверху = 5;
					ЛистМЧБ.ПолеСправа = 5;
					ЛистМЧБ.ПолеСнизу  = 5;
					ЛистМЧБ.ПолеСлева  = 5;
					
					ЗаполнитьМакетМЧБ(Парам1, ЛистМЧБ, ОбщиеРеквизитыРазделов);
					
					Если СписокЛистовМЧБ.Индекс(элЛистМЧБ) > 0 Тогда
						ОбнулитьИтоговыеПоказателиНаЛистеМЧБ(ЛистМЧБ);
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(ЛистМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ЛистМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
					
				КонецЦикла;
				
				Возврат;
				
			КонецЕсли;
			
		Иначе
			
			ТекКолвоСтрокБлока = ЭтаФорма[мСтруктураМногострочныхРазделов[ИдГруппы]].Количество();
			Если ТекКолвоСтрокБлока > 0 И ИсхКолвоСтрокБлока > 0 Тогда
				//Определение общего количества листов МЧБ
				КолвоЛистовМЧБ = Цел(ТекКолвоСтрокБлока / ИсхКолвоСтрокБлока);
				КолвоСтрокНаПоследнемЛисте = ТекКолвоСтрокБлока % ИсхКолвоСтрокБлока;
				Если КолвоСтрокНаПоследнемЛисте <> 0 Тогда
					КолвоЛистовМЧБ = КолвоЛистовМЧБ + 1;	
				КонецЕсли;
				
				//заполнение строки имен показателей (для проверки перед переименованием)
				СтрИменаПоказателей = "";
				
				Колонки = ДанныеФормыВЗначение(ЭтаФорма[мСтруктураМногострочныхРазделов[ИдГруппы]], Тип("ТаблицаЗначений")).Колонки;
				
				Для каждого КолонкаСтруктуры Из Колонки Цикл
					СтрИменаПоказателей = СтрИменаПоказателей + КолонкаСтруктуры.Имя;
				КонецЦикла;
				
				//Заполнение списка листов МЧБ
				СписокЛистовМЧБ = Новый СписокЗначений;
				Для Сч = 1 По КолвоЛистовМЧБ Цикл
					
					СписокОчищаемыхОбластей = Новый Массив;
					СписокОбластейПереименования = Новый СписокЗначений;
					Для каждого ТекущаяОбласть Из МакетМЧБ.Области Цикл
						ИмяЯчейки = ТекущаяОбласть.Имя;
						
						Если СтрДлина(ИмяЯчейки) < 13 ИЛИ СтрНайти(СтрИменаПоказателей, Лев(ИмяЯчейки, 13)) = 0 Тогда
							//проверка на вхождение в данную многострочную часть
							Продолжить;
						КонецЕсли;
						
						//определение и обрасывание НомерЯчейки
						ПоказательИНомерСтрокиСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Истина); // ВМЕСТЕ с разделителем
						ПоказательИНомерСтроки = Лев(ПоказательИНомерСтрокиСРазделителем,СтрДлина(ПоказательИНомерСтрокиСРазделителем) - 1);
						НомерЯчейки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Ложь);
						//определение СмысловаяЧасть и ТекущийСчетчик
						СмысловаяЧастьСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Истина); // ВМЕСТЕ с разделителем
						СмысловаяЧасть = Лев(СмысловаяЧастьСРазделителем,СтрДлина(СмысловаяЧастьСРазделителем) - 1);
						ТекущийСчетчик = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Ложь);
						
						//Окончательная проверка на вхождение в данную многострочную часть
						Если СтрНайти(СтрИменаПоказателей,СмысловаяЧасть) = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлока);
						Если НовыйСчетчик > ТекКолвоСтрокБлока Тогда
							//очищение происходит после этого цикла
							СписокОчищаемыхОбластей.Добавить(ТекущаяОбласть);
							Продолжить;
						КонецЕсли;
						
						//Подготовка к переименованию
						//заполнение списка: значение - область, представление - будущее имя
						СписокОбластейПереименования.Добавить(ТекущаяОбласть, СмысловаяЧасть + "_" + НовыйСчетчик + "_" + НомерЯчейки);
					КонецЦикла;
					
					//Очищение
					Для каждого ОбластьСписка Из СписокОчищаемыхОбластей Цикл
						ОбластьСписка.Имя = "";
						ОбластьСписка.Текст = ?(СокрЛП(ОбластьСписка.Текст) = ".", ".", "-");
					КонецЦикла;
					
					//Переименование
					Для каждого ЭлСпискаОбластей Из СписокОбластейПереименования Цикл
						ЭлСпискаОбластей.Значение.Имя = ЭлСпискаОбластей.Представление;
					КонецЦикла;
					
					СписокЛистовМЧБ.Добавить(МакетМЧБ.ПолучитьОбласть());
				КонецЦикла;
				
				Для каждого элЛистМЧБ Из СписокЛистовМЧБ Цикл
					
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
					
					ЛистМЧБ = элЛистМЧБ.Значение;
					
					ЛистМЧБ.ПолеСверху = 5;
					ЛистМЧБ.ПолеСправа = 5;
					ЛистМЧБ.ПолеСнизу  = 5;
					ЛистМЧБ.ПолеСлева  = 5;
					
					ЗаполнитьМакетМЧБ(Парам1, ЛистМЧБ, ОбщиеРеквизитыРазделов);
					
					Если СписокЛистовМЧБ.Индекс(элЛистМЧБ) > 0 Тогда
						// Выводится не первый лист многострочной серии листов МЧБ.
						// Необходимо обнулить итоговые показатели.
						ОбнулитьИтоговыеПоказателиНаЛистеМЧБ(ЛистМЧБ);
					ИначеЕсли Парам1.ИмяСтраницы = "Раздел5" Тогда
						Если СтруктураРеквизитовФормы.мПечатныеФормы[СтруктураРеквизитовФормы.мПечатныеФормы.Количество() - 1].Представление = "Раздел 5" Тогда
							// Выводится не первый лист многостранично-многострочной серии листов МЧБ Раздела 5.
							// Необходимо обнулить итоговые показатели.
							ОбнулитьИтоговыеПоказателиНаЛистеМЧБ(ЛистМЧБ);
						КонецЕсли;
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(ЛистМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ЛистМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
				КонецЦикла;
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов);
	
	ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(МакетМЧБ);
	ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
	
	РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиНаПечатьЛистыРазделов8_12_ЗаполненныхБезДеленияНаСекции(Парам1, ОбщиеРеквизитыРазделов, СтрПоля = Неопределено)
	
	Если НЕ СтруктураРеквизитовФормы.Свойство("АдресДанных" + Парам1.ИмяСтраницы) Тогда
		Данные = Неопределено;
	ИначеЕсли СтруктураРеквизитовФормы["АдресДанных" + Парам1.ИмяСтраницы] = Неопределено Тогда
		Данные = Неопределено;
	Иначе
		Данные = ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы["АдресДанных" + Парам1.ИмяСтраницы]);
		Если Данные.Записи.Количество() = 0 Тогда
			Данные = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Данные = Неопределено Тогда
		
		Данные = ДанныеДляПечатиПустыхМЧБРазделов8_12();
		
	КонецЕсли;
	
	Данные.Вставить("ЭтоПерваяСтраницаРаздела",    Неопределено);
	Данные.Вставить("ЭтоПоследняяСтраницаРаздела", Неопределено);
	
	ВывестиНаПечатьЛистыРазделов8_12_ОбщаяЧасть(Парам1, ОбщиеРеквизитыРазделов, СтрПоля, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиНаПечатьЛистыРазделов8_12_ЗаполненныхСДелениемНаСекции(Парам1, ОбщиеРеквизитыРазделов, СтрПоля = Неопределено)
	
	РазделЗаполнен = ЭтаФорма["Страницы" + Парам1.ИмяСтраницы].Количество() > 0;
	
	Если РазделЗаполнен Тогда;
		
		ДанныеРаздела = ДанныеРазделаНДСДляПечати(Парам1.ИмяСтраницы);
		
	Иначе
		
		// Раздел либо а) не заполнялся совсем, либо б) был
		// заполнен, но затем был очищен, а отчет не сохранен.
		ДанныеРаздела = Неопределено;
		
	КонецЕсли;
	
	Если ДанныеРаздела = Неопределено Тогда
		
		Данные = ДанныеДляПечатиПустыхМЧБРазделов8_12();
		
		ВывестиНаПечатьЛистыРазделов8_12_ОбщаяЧасть(Парам1, ОбщиеРеквизитыРазделов, СтрПоля, Данные);
		
	Иначе
		
		СтрокиРаздела = ДанныеРаздела.СтрокиРаздела;
		
		ПечататьОдинКомплектЛистовРаздела
			= (СтруктураРеквизитовФормы["АктуальностьСведений" + Парам1.ИмяСтраницы] = 1
			И СтруктураРеквизитовФормы.ВидДокумента <> 0);
		
		Для Каждого НомерПервойСтрокиСекции Из СтрокиРаздела Цикл
			
			СтрокиСегментаРаздела = РегламентированнаяОтчетность.СегментДанныхРазделаДекларацииНДС(
				СтруктураРеквизитовФормы.мСохраненныйДок, Парам1.ИмяСтраницы, НомерПервойСтрокиСекции);
			
			Для Каждого СтрокаДанных ИЗ СтрокиСегментаРаздела Цикл
				
				// Преобразование структуры данных, передаваемой в общий механизм вывода листов
				// МЧБ разделов 8 - 12 при новом ("сегментированном") варианте хранения данных.
				Данные = Новый Структура;
				
				МассивКопируемыхСтрок = Новый Массив;
				МассивКопируемыхСтрок.Добавить(СтрокаДанных);
				
				// Данные, полученные из ИБ потребителя.
				Данные.Вставить("Записи", СтрокиСегментаРаздела.Скопировать(МассивКопируемыхСтрок));
				Данные.Вставить("Итоги",  ДанныеРаздела.Итоги);
				
				// Служебные данные, определяющие необходимость вывода на печать
				// значений отдельных показателей и/или формат вывода этих значений.
				Данные.Вставить("ЭтоПерваяСтраницаРаздела",
					НомерПервойСтрокиСекции = СтрокиРаздела[0] И СтрокиСегментаРаздела.Индекс(СтрокаДанных) = 0);
				Данные.Вставить("ЭтоПоследняяСтраницаРаздела",
					НомерПервойСтрокиСекции = СтрокиРаздела[СтрокиРаздела.Количество() - 1]
					И СтрокиСегментаРаздела.Индекс(СтрокаДанных) = СтрокиСегментаРаздела.Количество() - 1);
				
				ВывестиНаПечатьЛистыРазделов8_12_ОбщаяЧасть(Парам1, ОбщиеРеквизитыРазделов, СтрПоля, Данные);
				
				Если ПечататьОдинКомплектЛистовРаздела Тогда
					Возврат;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиНаПечатьЛистыРазделов8_12_ОбщаяЧасть(Парам1, ОбщиеРеквизитыРазделов, СтрПоля = Неопределено, Данные)
	
	Для каждого Запись Из Данные.Записи Цикл
		
		Если Парам1.ИмяСтраницы = "Раздел8" Тогда
			
			Если Запись <> "" И НЕ (СтруктураРеквизитовФормы.АктуальностьСведенийРаздел8 = 1
				И СтруктураРеквизитовФормы.ВидДокумента <> 0) Тогда
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел8";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				ТекКолвоСтрокБлокаРаздел8_1 = Запись.КодВидОпер.Количество();
				ТекКолвоСтрокБлокаРаздел8_2 = Запись.ДокПдтвУпл.Количество();
				ТекКолвоСтрокБлокаРаздел8_3 = Запись.ДатаУчТов.Количество();
				
				ИсхКолвоСтрокБлокаРаздел8_1 = 7;
				ИсхКолвоСтрокБлокаРаздел8_2 = 1;
				ИсхКолвоСтрокБлокаРаздел8_3 = 1;
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				Если (ТекКолвоСтрокБлокаРаздел8_1 > 0 И ИсхКолвоСтрокБлокаРаздел8_1 > 0)
				 ИЛИ (ТекКолвоСтрокБлокаРаздел8_2 > 0 И ИсхКолвоСтрокБлокаРаздел8_2 > 0)
				 ИЛИ (ТекКолвоСтрокБлокаРаздел8_3 > 0 И ИсхКолвоСтрокБлокаРаздел8_3 > 0) Тогда
					
					ДробноеКолвоЛистовМЧБ = Макс(
						?(ТекКолвоСтрокБлокаРаздел8_1 > ИсхКолвоСтрокБлокаРаздел8_1, ТекКолвоСтрокБлокаРаздел8_1 / ИсхКолвоСтрокБлокаРаздел8_1, 1),
						?(ТекКолвоСтрокБлокаРаздел8_2 > ИсхКолвоСтрокБлокаРаздел8_2, ТекКолвоСтрокБлокаРаздел8_2 / ИсхКолвоСтрокБлокаРаздел8_2, 1),
						?(ТекКолвоСтрокБлокаРаздел8_3 > ИсхКолвоСтрокБлокаРаздел8_3, ТекКолвоСтрокБлокаРаздел8_3 / ИсхКолвоСтрокБлокаРаздел8_3, 1));
					
					ЦелоеКолвоЛистовМЧБ = Цел(ДробноеКолвоЛистовМЧБ);
					
					КолвоЛистовМЧБ = ?(ДробноеКолвоЛистовМЧБ = ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ + 1);
					
					СтрИменаПоказателей = "П000800001003;П000800010003;П000800011003;П000800012003";
					
					СписокЛистовМЧБ = Новый СписокЗначений;
					
					Для Сч = 1 По КолвоЛистовМЧБ Цикл
						
						СписокОчищаемыхОбластей = Новый Массив;
						СписокОбластейПереименования = Новый СписокЗначений;
						
						Для каждого ТекущаяОбласть Из МакетМЧБ.Области Цикл
							
							ИмяЯчейки = ТекущаяОбласть.Имя;
							
							Если СтрДлина(ИмяЯчейки) < 13 ИЛИ СтрНайти(СтрИменаПоказателей, Лев(ИмяЯчейки, 13)) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							ПоказательИНомерСтрокиСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Истина); // ВМЕСТЕ с разделителем
							ПоказательИНомерСтроки = Лев(ПоказательИНомерСтрокиСРазделителем,СтрДлина(ПоказательИНомерСтрокиСРазделителем) - 1);
							НомерЯчейки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Ложь);
							
							СмысловаяЧастьСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Истина); // ВМЕСТЕ с разделителем
							СмысловаяЧасть = Лев(СмысловаяЧастьСРазделителем,СтрДлина(СмысловаяЧастьСРазделителем) - 1);
							ТекущийСчетчик = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Ложь);
							
							Если СтрНайти(СтрИменаПоказателей,СмысловаяЧасть) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Если СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000800001003") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел8_1);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел8_1;
							ИначеЕсли СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000800010003") > 0 ИЛИ СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000800011003") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел8_2);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел8_2;
							ИначеЕсли СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000800012003") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел8_3);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел8_3;
							КонецЕсли;
							
							Если НовыйСчетчик > ТекКолвоСтрокБлока Тогда
								СписокОчищаемыхОбластей.Добавить(ТекущаяОбласть);
								Продолжить;
							КонецЕсли;
							
							СписокОбластейПереименования.Добавить(ТекущаяОбласть, СмысловаяЧасть + "_" + НовыйСчетчик + "_" + НомерЯчейки);
							
						КонецЦикла;
						
						Для каждого ОбластьСписка Из СписокОчищаемыхОбластей Цикл
							ОбластьСписка.Имя = "";
							ОбластьСписка.Текст = ?(СокрЛП(ОбластьСписка.Текст) = ".", ".", "-");
						КонецЦикла;
						
						Для каждого ЭлСпискаОбластей Из СписокОбластейПереименования Цикл
							ЭлСпискаОбластей.Значение.Имя = ЭлСпискаОбластей.Представление;
						КонецЦикла;
						
						СписокЛистовМЧБ.Добавить(МакетМЧБ.ПолучитьОбласть());
					КонецЦикла;
					
					Для каждого элЛистМЧБ Из СписокЛистовМЧБ Цикл
						
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
						
						ЛистМЧБ = элЛистМЧБ.Значение;
						
						ЛистМЧБ.ПолеСверху = 5;
						ЛистМЧБ.ПолеСправа = 5;
						ЛистМЧБ.ПолеСнизу  = 5;
						ЛистМЧБ.ПолеСлева  = 5;
						
						ДопПараметры = Новый Структура();
						Если Данные.ЭтоПерваяСтраницаРаздела <> Неопределено Тогда
							ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела", Данные.ЭтоПерваяСтраницаРаздела);
						Иначе
							ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела",
								Данные.Записи.Индекс(Запись) = 0 И СписокЛистовМЧБ.Индекс(элЛистМЧБ) = 0);
						КонецЕсли;
						ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
						ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
						ДопПараметры.Вставить("ИндексЛистаМЧБ", СписокЛистовМЧБ.Индекс(элЛистМЧБ));
						ЗаполнитьМакетМЧБ(Парам1, ЛистМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
						
						ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(ЛистМЧБ);
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ЛистМЧБ, СтрПоля, "Макет");
						
						РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
						
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
						
					КонецЦикла;
					
				Иначе
					
					ДопПараметры = Новый Структура();
					ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела", Истина);
					ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
					ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
					ДопПараметры.Вставить("ИндексЛистаМЧБ", 0);
					ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(МакетМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
				КонецЕсли;
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел8_Прод";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				ТекКолвоСтрокБлокаРаздел8_Прод_1 = Запись.СвПрод.Количество();
				ТекКолвоСтрокБлокаРаздел8_Прод_2 = Запись.РегНомТД.Количество();
				
				ИсхКолвоСтрокБлокаРаздел8_Прод_1 = 1;
				ИсхКолвоСтрокБлокаРаздел8_Прод_2 = 9;
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				Если (ТекКолвоСтрокБлокаРаздел8_Прод_1 > 0 И ИсхКолвоСтрокБлокаРаздел8_Прод_1 > 0)
				 ИЛИ (ТекКолвоСтрокБлокаРаздел8_Прод_2 > 0 И ИсхКолвоСтрокБлокаРаздел8_Прод_2 > 0) Тогда
					
					ДробноеКолвоЛистовМЧБ = Макс(
						?(ТекКолвоСтрокБлокаРаздел8_Прод_1 > ИсхКолвоСтрокБлокаРаздел8_Прод_1, ТекКолвоСтрокБлокаРаздел8_Прод_1 / ИсхКолвоСтрокБлокаРаздел8_Прод_1, 1),
						?(ТекКолвоСтрокБлокаРаздел8_Прод_2 > ИсхКолвоСтрокБлокаРаздел8_Прод_2, ТекКолвоСтрокБлокаРаздел8_Прод_2 / ИсхКолвоСтрокБлокаРаздел8_Прод_2, 1));
				
					ЦелоеКолвоЛистовМЧБ = Цел(ДробноеКолвоЛистовМЧБ);
					
					КолвоЛистовМЧБ = ?(ДробноеКолвоЛистовМЧБ = ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ + 1);
					
					СтрИменаПоказателей = "П000800013003;П000800013004;П000800015003";
					
					СписокЛистовМЧБ = Новый СписокЗначений;
					
					Для Сч = 1 По КолвоЛистовМЧБ Цикл
						
						СписокОчищаемыхОбластей = Новый Массив;
						СписокОбластейПереименования = Новый СписокЗначений;
						
						Для каждого ТекущаяОбласть Из МакетМЧБ.Области Цикл
							
							ИмяЯчейки = ТекущаяОбласть.Имя;
							
							Если СтрДлина(ИмяЯчейки) < 13 ИЛИ СтрНайти(СтрИменаПоказателей, Лев(ИмяЯчейки, 13)) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							ПоказательИНомерСтрокиСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Истина); // ВМЕСТЕ с разделителем
							ПоказательИНомерСтроки = Лев(ПоказательИНомерСтрокиСРазделителем,СтрДлина(ПоказательИНомерСтрокиСРазделителем) - 1);
							НомерЯчейки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Ложь);
							
							СмысловаяЧастьСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Истина); // ВМЕСТЕ с разделителем
							СмысловаяЧасть = Лев(СмысловаяЧастьСРазделителем,СтрДлина(СмысловаяЧастьСРазделителем) - 1);
							ТекущийСчетчик = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Ложь);
							
							Если СтрНайти(СтрИменаПоказателей,СмысловаяЧасть) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Если СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000800013003") > 0 ИЛИ СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000800013004") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел8_Прод_1);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел8_Прод_1;
							ИначеЕсли СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000800015003") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел8_Прод_2);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел8_Прод_2;
							КонецЕсли;
							
							Если НовыйСчетчик > ТекКолвоСтрокБлока Тогда
								СписокОчищаемыхОбластей.Добавить(ТекущаяОбласть);
								Продолжить;
							КонецЕсли;
							
							СписокОбластейПереименования.Добавить(ТекущаяОбласть, СмысловаяЧасть + "_" + НовыйСчетчик + "_" + НомерЯчейки);
							
						КонецЦикла;
						
						Для каждого ОбластьСписка Из СписокОчищаемыхОбластей Цикл
							ОбластьСписка.Имя = "";
							ОбластьСписка.Текст = ?(СокрЛП(ОбластьСписка.Текст) = ".", ".", "-");
						КонецЦикла;
						
						Для каждого ЭлСпискаОбластей Из СписокОбластейПереименования Цикл
							ЭлСпискаОбластей.Значение.Имя = ЭлСпискаОбластей.Представление;
						КонецЦикла;
						
						СписокЛистовМЧБ.Добавить(МакетМЧБ.ПолучитьОбласть());
					КонецЦикла;
					
					Для каждого элЛистМЧБ Из СписокЛистовМЧБ Цикл
						
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
						
						ЛистМЧБ = элЛистМЧБ.Значение;
						
						ЛистМЧБ.ПолеСверху = 5;
						ЛистМЧБ.ПолеСправа = 5;
						ЛистМЧБ.ПолеСнизу  = 5;
						ЛистМЧБ.ПолеСлева  = 5;
						
						ДопПараметры = Новый Структура();
						Если Данные.ЭтоПоследняяСтраницаРаздела <> Неопределено Тогда
							ДопПараметры.Вставить("ЭтоПоследняяСтраницаРаздела", Данные.ЭтоПоследняяСтраницаРаздела);
						Иначе
							ДопПараметры.Вставить("ЭтоПоследняяСтраницаРаздела",
								Данные.Записи.Индекс(Запись) = (Данные.Записи.Количество() - 1)
								И СписокЛистовМЧБ.Индекс(элЛистМЧБ) = СписокЛистовМЧБ.Количество() - 1);
						КонецЕсли;
						ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод");
						ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
						ДопПараметры.Вставить("ИндексЛистаМЧБ", СписокЛистовМЧБ.Индекс(элЛистМЧБ));
						ДопПараметры.Вставить("Итоги", Данные.Итоги);
						ЗаполнитьМакетМЧБ(Парам1, ЛистМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
						
						ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(ЛистМЧБ);
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ЛистМЧБ, СтрПоля, "Макет");
						
						РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
						
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
						
					КонецЦикла;
					
				Иначе
					
					ДопПараметры = Новый Структура();
					Если Данные.ЭтоПоследняяСтраницаРаздела <> Неопределено Тогда
						ДопПараметры.Вставить("ЭтоПоследняяСтраницаРаздела", Данные.ЭтоПоследняяСтраницаРаздела);
					Иначе
						ДопПараметры.Вставить("ЭтоПоследняяСтраницаРаздела", Данные.Записи.Индекс(Запись) = (Данные.Записи.Количество() - 1));
					КонецЕсли;
					ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод");
					ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
					ДопПараметры.Вставить("ИндексЛистаМЧБ", 0);
					ДопПараметры.Вставить("Итоги", Данные.Итоги);
					ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(МакетМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
				КонецЕсли;
				
			Иначе
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел8";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел8_Прод";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				Возврат;
				
			КонецЕсли;
			
		ИначеЕсли Парам1.ИмяСтраницы = "Раздел8_Прил1" Тогда
			
			Если Запись <> "" И НЕ (СтруктураРеквизитовФормы.АктуальностьСведенийРаздел8_Прил1 = 1
				И СтруктураРеквизитовФормы.ВидДокумента <> 0) Тогда
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел8_Прил1";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				ТекКолвоСтрокБлокаРаздел8_1 = Запись.КодВидОпер.Количество();
				ТекКолвоСтрокБлокаРаздел8_2 = Запись.ДокПдтвУпл.Количество();
				ТекКолвоСтрокБлокаРаздел8_3 = Запись.ДатаУчТов.Количество();
				
				ИсхКолвоСтрокБлокаРаздел8_1 = 7;
				ИсхКолвоСтрокБлокаРаздел8_2 = 1;
				ИсхКолвоСтрокБлокаРаздел8_3 = 1;
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				Если (ТекКолвоСтрокБлокаРаздел8_1 > 0 И ИсхКолвоСтрокБлокаРаздел8_1 > 0)
				 ИЛИ (ТекКолвоСтрокБлокаРаздел8_2 > 0 И ИсхКолвоСтрокБлокаРаздел8_2 > 0)
				 ИЛИ (ТекКолвоСтрокБлокаРаздел8_3 > 0 И ИсхКолвоСтрокБлокаРаздел8_3 > 0) Тогда
					
					ДробноеКолвоЛистовМЧБ = Макс(
						?(ТекКолвоСтрокБлокаРаздел8_1 > ИсхКолвоСтрокБлокаРаздел8_1, ТекКолвоСтрокБлокаРаздел8_1 / ИсхКолвоСтрокБлокаРаздел8_1, 1),
						?(ТекКолвоСтрокБлокаРаздел8_2 > ИсхКолвоСтрокБлокаРаздел8_2, ТекКолвоСтрокБлокаРаздел8_2 / ИсхКолвоСтрокБлокаРаздел8_2, 1),
						?(ТекКолвоСтрокБлокаРаздел8_3 > ИсхКолвоСтрокБлокаРаздел8_3, ТекКолвоСтрокБлокаРаздел8_3 / ИсхКолвоСтрокБлокаРаздел8_3, 1));
					
					ЦелоеКолвоЛистовМЧБ = Цел(ДробноеКолвоЛистовМЧБ);
					
					КолвоЛистовМЧБ = ?(ДробноеКолвоЛистовМЧБ = ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ + 1);
					
					СтрИменаПоказателей = "П000810001003;П000810010003;П000810011003;П000810012003";
					
					СписокЛистовМЧБ = Новый СписокЗначений;
					
					Для Сч = 1 По КолвоЛистовМЧБ Цикл
						
						СписокОчищаемыхОбластей = Новый Массив;
						СписокОбластейПереименования = Новый СписокЗначений;
						
						Для каждого ТекущаяОбласть Из МакетМЧБ.Области Цикл
							
							ИмяЯчейки = ТекущаяОбласть.Имя;
							
							Если СтрДлина(ИмяЯчейки) < 13 ИЛИ СтрНайти(СтрИменаПоказателей, Лев(ИмяЯчейки, 13)) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							ПоказательИНомерСтрокиСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Истина); // ВМЕСТЕ с разделителем
							ПоказательИНомерСтроки = Лев(ПоказательИНомерСтрокиСРазделителем,СтрДлина(ПоказательИНомерСтрокиСРазделителем) - 1);
							НомерЯчейки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Ложь);
							
							СмысловаяЧастьСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Истина); // ВМЕСТЕ с разделителем
							СмысловаяЧасть = Лев(СмысловаяЧастьСРазделителем,СтрДлина(СмысловаяЧастьСРазделителем) - 1);
							ТекущийСчетчик = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Ложь);
							
							Если СтрНайти(СтрИменаПоказателей,СмысловаяЧасть) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Если СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000810001003") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел8_1);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел8_1;
							ИначеЕсли СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000810010003") > 0 ИЛИ СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000800011003") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел8_2);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел8_2;
							ИначеЕсли СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000810012003") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел8_3);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел8_3;
							КонецЕсли;
							
							Если НовыйСчетчик > ТекКолвоСтрокБлока Тогда
								СписокОчищаемыхОбластей.Добавить(ТекущаяОбласть);
								Продолжить;
							КонецЕсли;
							
							СписокОбластейПереименования.Добавить(ТекущаяОбласть, СмысловаяЧасть + "_" + НовыйСчетчик + "_" + НомерЯчейки);
							
						КонецЦикла;
						
						Для каждого ОбластьСписка Из СписокОчищаемыхОбластей Цикл
							ОбластьСписка.Имя = "";
							ОбластьСписка.Текст = ?(СокрЛП(ОбластьСписка.Текст) = ".", ".", "-");
						КонецЦикла;
						
						Для каждого ЭлСпискаОбластей Из СписокОбластейПереименования Цикл
							ЭлСпискаОбластей.Значение.Имя = ЭлСпискаОбластей.Представление;
						КонецЦикла;
						
						СписокЛистовМЧБ.Добавить(МакетМЧБ.ПолучитьОбласть());
					КонецЦикла;
					
					Для каждого элЛистМЧБ Из СписокЛистовМЧБ Цикл
						
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
						
						ЛистМЧБ = элЛистМЧБ.Значение;
						
						ЛистМЧБ.ПолеСверху = 5;
						ЛистМЧБ.ПолеСправа = 5;
						ЛистМЧБ.ПолеСнизу  = 5;
						ЛистМЧБ.ПолеСлева  = 5;
						
						ДопПараметры = Новый Структура();
						Если Данные.ЭтоПерваяСтраницаРаздела <> Неопределено Тогда
							ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела", Данные.ЭтоПерваяСтраницаРаздела);
						Иначе
							ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела",
								Данные.Записи.Индекс(Запись) = 0 И СписокЛистовМЧБ.Индекс(элЛистМЧБ) = 0);
						КонецЕсли;
						ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
						ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
						ДопПараметры.Вставить("ИндексЛистаМЧБ", СписокЛистовМЧБ.Индекс(элЛистМЧБ));
						ДопПараметры.Вставить("Итоги", Данные.Итоги);
						ЗаполнитьМакетМЧБ(Парам1, ЛистМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
						
						ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(ЛистМЧБ);
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ЛистМЧБ, СтрПоля, "Макет");
						
						РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
						
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
						
					КонецЦикла;
					
				Иначе
					
					ДопПараметры = Новый Структура();
					ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела", Истина);
					ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
					ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
					ДопПараметры.Вставить("ИндексЛистаМЧБ", 0);
					ДопПараметры.Вставить("Итоги", Данные.Итоги);
					ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(МакетМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
				КонецЕсли;
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел8_Прил1_Прод";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				ТекКолвоСтрокБлокаРаздел8_Прод_1 = Запись.СвПрод.Количество();
				ТекКолвоСтрокБлокаРаздел8_Прод_2 = Запись.РегНомТД.Количество();
				
				ИсхКолвоСтрокБлокаРаздел8_Прод_1 = 1;
				ИсхКолвоСтрокБлокаРаздел8_Прод_2 = 9;
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				Если (ТекКолвоСтрокБлокаРаздел8_Прод_1 > 0 И ИсхКолвоСтрокБлокаРаздел8_Прод_1 > 0)
				 ИЛИ (ТекКолвоСтрокБлокаРаздел8_Прод_2 > 0 И ИсхКолвоСтрокБлокаРаздел8_Прод_2 > 0) Тогда
					
					ДробноеКолвоЛистовМЧБ = Макс(
						?(ТекКолвоСтрокБлокаРаздел8_Прод_1 > ИсхКолвоСтрокБлокаРаздел8_Прод_1, ТекКолвоСтрокБлокаРаздел8_Прод_1 / ИсхКолвоСтрокБлокаРаздел8_Прод_1, 1),
						?(ТекКолвоСтрокБлокаРаздел8_Прод_2 > ИсхКолвоСтрокБлокаРаздел8_Прод_2, ТекКолвоСтрокБлокаРаздел8_Прод_2 / ИсхКолвоСтрокБлокаРаздел8_Прод_2, 1));
				
					ЦелоеКолвоЛистовМЧБ = Цел(ДробноеКолвоЛистовМЧБ);
					
					КолвоЛистовМЧБ = ?(ДробноеКолвоЛистовМЧБ = ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ + 1);
					
					СтрИменаПоказателей = "П000810013003;П000810013004;П000810015003";
					
					СписокЛистовМЧБ = Новый СписокЗначений;
					
					Для Сч = 1 По КолвоЛистовМЧБ Цикл
						
						СписокОчищаемыхОбластей = Новый Массив;
						СписокОбластейПереименования = Новый СписокЗначений;
						
						Для каждого ТекущаяОбласть Из МакетМЧБ.Области Цикл
							
							ИмяЯчейки = ТекущаяОбласть.Имя;
							
							Если СтрДлина(ИмяЯчейки) < 13 ИЛИ СтрНайти(СтрИменаПоказателей, Лев(ИмяЯчейки, 13)) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							ПоказательИНомерСтрокиСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Истина); // ВМЕСТЕ с разделителем
							ПоказательИНомерСтроки = Лев(ПоказательИНомерСтрокиСРазделителем,СтрДлина(ПоказательИНомерСтрокиСРазделителем) - 1);
							НомерЯчейки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Ложь);
							
							СмысловаяЧастьСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Истина); // ВМЕСТЕ с разделителем
							СмысловаяЧасть = Лев(СмысловаяЧастьСРазделителем,СтрДлина(СмысловаяЧастьСРазделителем) - 1);
							ТекущийСчетчик = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Ложь);
							
							Если СтрНайти(СтрИменаПоказателей,СмысловаяЧасть) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Если СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000810013003") > 0 ИЛИ СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000810013004") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел8_Прод_1);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел8_Прод_1;
							ИначеЕсли СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000810015003") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел8_Прод_2);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел8_Прод_2;
							КонецЕсли;
							
							Если НовыйСчетчик > ТекКолвоСтрокБлока Тогда
								СписокОчищаемыхОбластей.Добавить(ТекущаяОбласть);
								Продолжить;
							КонецЕсли;
							
							СписокОбластейПереименования.Добавить(ТекущаяОбласть, СмысловаяЧасть + "_" + НовыйСчетчик + "_" + НомерЯчейки);
							
						КонецЦикла;
						
						Для каждого ОбластьСписка Из СписокОчищаемыхОбластей Цикл
							ОбластьСписка.Имя = "";
							ОбластьСписка.Текст = ?(СокрЛП(ОбластьСписка.Текст) = ".", ".", "-");
						КонецЦикла;
						
						Для каждого ЭлСпискаОбластей Из СписокОбластейПереименования Цикл
							ЭлСпискаОбластей.Значение.Имя = ЭлСпискаОбластей.Представление;
						КонецЦикла;
						
						СписокЛистовМЧБ.Добавить(МакетМЧБ.ПолучитьОбласть());
					КонецЦикла;
					
					Для каждого элЛистМЧБ Из СписокЛистовМЧБ Цикл
						
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
						
						ЛистМЧБ = элЛистМЧБ.Значение;
						
						ЛистМЧБ.ПолеСверху = 5;
						ЛистМЧБ.ПолеСправа = 5;
						ЛистМЧБ.ПолеСнизу  = 5;
						ЛистМЧБ.ПолеСлева  = 5;
						
						ДопПараметры = Новый Структура();
						Если Данные.ЭтоПоследняяСтраницаРаздела <> Неопределено Тогда
							ДопПараметры.Вставить("ЭтоПоследняяСтраницаРаздела", Данные.ЭтоПоследняяСтраницаРаздела);
						Иначе
							ДопПараметры.Вставить("ЭтоПоследняяСтраницаРаздела",
								Данные.Записи.Индекс(Запись) = (Данные.Записи.Количество() - 1)
								И СписокЛистовМЧБ.Индекс(элЛистМЧБ) = СписокЛистовМЧБ.Количество() - 1);
						КонецЕсли;
						ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод");
						ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
						ДопПараметры.Вставить("ИндексЛистаМЧБ", СписокЛистовМЧБ.Индекс(элЛистМЧБ));
						ДопПараметры.Вставить("Итоги", Данные.Итоги);
						ЗаполнитьМакетМЧБ(Парам1, ЛистМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
						
						ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(ЛистМЧБ);
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ЛистМЧБ, СтрПоля, "Макет");
						
						РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
						
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
						
					КонецЦикла;
					
				Иначе
					
					ДопПараметры = Новый Структура();
					Если Данные.ЭтоПоследняяСтраницаРаздела <> Неопределено Тогда
						ДопПараметры.Вставить("ЭтоПоследняяСтраницаРаздела", Данные.ЭтоПоследняяСтраницаРаздела);
					Иначе
						ДопПараметры.Вставить("ЭтоПоследняяСтраницаРаздела", Данные.Записи.Индекс(Запись) = (Данные.Записи.Количество() - 1));
					КонецЕсли;
					ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод");
					ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
					ДопПараметры.Вставить("ИндексЛистаМЧБ", 0);
					ДопПараметры.Вставить("Итоги", Данные.Итоги);
					ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(МакетМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
				КонецЕсли;
				
			Иначе
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел8_Прил1";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел8_Прил1_Прод";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				Возврат;
				
			КонецЕсли;
			
		ИначеЕсли Парам1.ИмяСтраницы = "Раздел9" Тогда
			
			Если Запись <> "" И НЕ (СтруктураРеквизитовФормы.АктуальностьСведенийРаздел9 = 1
				И СтруктураРеквизитовФормы.ВидДокумента <> 0) Тогда
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел9";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				ТекКолвоСтрокБлокаРаздел9_1 = Запись.КодВидОпер.Количество();
				ТекКолвоСтрокБлокаРаздел9_2 = Запись.СвПокуп.Количество();
				ТекКолвоСтрокБлокаРаздел9_3 = Запись.РегНомТД.Количество();
				
				ИсхКолвоСтрокБлокаРаздел9_1 = 7;
				ИсхКолвоСтрокБлокаРаздел9_2 = 1;
				ИсхКолвоСтрокБлокаРаздел9_3 = 2;
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				Если (ТекКолвоСтрокБлокаРаздел9_1 > 0 И ИсхКолвоСтрокБлокаРаздел9_1 > 0)
				 ИЛИ (ТекКолвоСтрокБлокаРаздел9_2 > 0 И ИсхКолвоСтрокБлокаРаздел9_2 > 0)
				 ИЛИ (ТекКолвоСтрокБлокаРаздел9_3 > 0 И ИсхКолвоСтрокБлокаРаздел9_3 > 0) Тогда
					
					ДробноеКолвоЛистовМЧБ = Макс(
						?(ТекКолвоСтрокБлокаРаздел9_1 > ИсхКолвоСтрокБлокаРаздел9_1, ТекКолвоСтрокБлокаРаздел9_1 / ИсхКолвоСтрокБлокаРаздел9_1, 1),
						?(ТекКолвоСтрокБлокаРаздел9_2 > ИсхКолвоСтрокБлокаРаздел9_2, ТекКолвоСтрокБлокаРаздел9_2 / ИсхКолвоСтрокБлокаРаздел9_2, 1),
						?(ТекКолвоСтрокБлокаРаздел9_3 > ИсхКолвоСтрокБлокаРаздел9_3, ТекКолвоСтрокБлокаРаздел9_3 / ИсхКолвоСтрокБлокаРаздел9_3, 1));
					
					ЦелоеКолвоЛистовМЧБ = Цел(ДробноеКолвоЛистовМЧБ);
					
					КолвоЛистовМЧБ = ?(ДробноеКолвоЛистовМЧБ = ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ + 1);
					
					СтрИменаПоказателей = "П000900001003;П000900003503;П000900010003;П000900010004";
					
					СписокЛистовМЧБ = Новый СписокЗначений;
					
					Для Сч = 1 По КолвоЛистовМЧБ Цикл
						
						СписокОчищаемыхОбластей = Новый Массив;
						СписокОбластейПереименования = Новый СписокЗначений;
						
						Для каждого ТекущаяОбласть Из МакетМЧБ.Области Цикл
							
							ИмяЯчейки = ТекущаяОбласть.Имя;
							
							Если СтрДлина(ИмяЯчейки) < 13 ИЛИ СтрНайти(СтрИменаПоказателей, Лев(ИмяЯчейки, 13)) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							ПоказательИНомерСтрокиСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Истина); // ВМЕСТЕ с разделителем
							ПоказательИНомерСтроки = Лев(ПоказательИНомерСтрокиСРазделителем,СтрДлина(ПоказательИНомерСтрокиСРазделителем) - 1);
							НомерЯчейки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Ложь);
							
							СмысловаяЧастьСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Истина); // ВМЕСТЕ с разделителем
							СмысловаяЧасть = Лев(СмысловаяЧастьСРазделителем,СтрДлина(СмысловаяЧастьСРазделителем) - 1);
							ТекущийСчетчик = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Ложь);
							
							Если СтрНайти(СтрИменаПоказателей,СмысловаяЧасть) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Если СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000900001003") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел9_1);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел9_1;
							ИначеЕсли СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000900010003") > 0 ИЛИ СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000900010004") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел9_2);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел9_2;
							ИначеЕсли СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000900003503") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел9_3);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел9_3;
							КонецЕсли;
							
							Если НовыйСчетчик > ТекКолвоСтрокБлока Тогда
								СписокОчищаемыхОбластей.Добавить(ТекущаяОбласть);
								Продолжить;
							КонецЕсли;
							
							СписокОбластейПереименования.Добавить(ТекущаяОбласть, СмысловаяЧасть + "_" + НовыйСчетчик + "_" + НомерЯчейки);
							
						КонецЦикла;
						
						Для каждого ОбластьСписка Из СписокОчищаемыхОбластей Цикл
							ОбластьСписка.Имя = "";
							ОбластьСписка.Текст = ?(СокрЛП(ОбластьСписка.Текст) = ".", ".", "-");
						КонецЦикла;
						
						Для каждого ЭлСпискаОбластей Из СписокОбластейПереименования Цикл
							ЭлСпискаОбластей.Значение.Имя = ЭлСпискаОбластей.Представление;
						КонецЦикла;
						
						СписокЛистовМЧБ.Добавить(МакетМЧБ.ПолучитьОбласть());
					КонецЦикла;
					
					Для каждого элЛистМЧБ Из СписокЛистовМЧБ Цикл
						
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
						
						ЛистМЧБ = элЛистМЧБ.Значение;
						
						ЛистМЧБ.ПолеСверху = 5;
						ЛистМЧБ.ПолеСправа = 5;
						ЛистМЧБ.ПолеСнизу  = 5;
						ЛистМЧБ.ПолеСлева  = 5;
						
						ДопПараметры = Новый Структура();
						Если Данные.ЭтоПерваяСтраницаРаздела <> Неопределено Тогда
							ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела", Данные.ЭтоПерваяСтраницаРаздела);
						Иначе
							ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела",
								Данные.Записи.Индекс(Запись) = 0 И СписокЛистовМЧБ.Индекс(элЛистМЧБ) = 0);
						КонецЕсли;
						ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
						ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
						ДопПараметры.Вставить("ИндексЛистаМЧБ", СписокЛистовМЧБ.Индекс(элЛистМЧБ));
						ЗаполнитьМакетМЧБ(Парам1, ЛистМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
						
						ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(ЛистМЧБ);
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ЛистМЧБ, СтрПоля, "Макет");
						
						РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
						
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
						
					КонецЦикла;
					
				Иначе
					
					ДопПараметры = Новый Структура();
					ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела", Истина);
					ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
					ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
					ДопПараметры.Вставить("ИндексЛистаМЧБ", 0);
					ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(МакетМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
				КонецЕсли;
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел9_Прод1";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				ТекКолвоСтрокБлокаРаздел9_Прод1 = Запись.ДокПдтвОпл.Количество();
				
				ИсхКолвоСтрокБлокаРаздел9_Прод1 = 1;
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				Если ТекКолвоСтрокБлокаРаздел9_Прод1 > 0 И ИсхКолвоСтрокБлокаРаздел9_Прод1 > 0 Тогда
					
					ДробноеКолвоЛистовМЧБ = ?(ТекКолвоСтрокБлокаРаздел9_Прод1 > ИсхКолвоСтрокБлокаРаздел9_Прод1,
						ТекКолвоСтрокБлокаРаздел9_Прод1 / ИсхКолвоСтрокБлокаРаздел9_Прод1, 1);
					
					ЦелоеКолвоЛистовМЧБ = Цел(ДробноеКолвоЛистовМЧБ);
					
					КолвоЛистовМЧБ = ?(ДробноеКолвоЛистовМЧБ = ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ + 1);
					
					СтрИменаПоказателей = "П000900012003;П000900013003";
					
					СписокЛистовМЧБ = Новый СписокЗначений;
					
					Для Сч = 1 По КолвоЛистовМЧБ Цикл
						
						СписокОчищаемыхОбластей = Новый Массив;
						СписокОбластейПереименования = Новый СписокЗначений;
						
						Для каждого ТекущаяОбласть Из МакетМЧБ.Области Цикл
							
							ИмяЯчейки = ТекущаяОбласть.Имя;
							
							Если СтрДлина(ИмяЯчейки) < 13 ИЛИ СтрНайти(СтрИменаПоказателей, Лев(ИмяЯчейки, 13)) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							ПоказательИНомерСтрокиСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Истина); // ВМЕСТЕ с разделителем
							ПоказательИНомерСтроки = Лев(ПоказательИНомерСтрокиСРазделителем,СтрДлина(ПоказательИНомерСтрокиСРазделителем) - 1);
							НомерЯчейки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Ложь);
							
							СмысловаяЧастьСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Истина); // ВМЕСТЕ с разделителем
							СмысловаяЧасть = Лев(СмысловаяЧастьСРазделителем,СтрДлина(СмысловаяЧастьСРазделителем) - 1);
							ТекущийСчетчик = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Ложь);
							
							Если СтрНайти(СтрИменаПоказателей,СмысловаяЧасть) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Если СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000900012003") > 0 ИЛИ СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000900013003") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел9_Прод1);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел9_Прод1;
							КонецЕсли;
							
							Если НовыйСчетчик > ТекКолвоСтрокБлока Тогда
								СписокОчищаемыхОбластей.Добавить(ТекущаяОбласть);
								Продолжить;
							КонецЕсли;
							
							СписокОбластейПереименования.Добавить(ТекущаяОбласть, СмысловаяЧасть + "_" + НовыйСчетчик + "_" + НомерЯчейки);
							
						КонецЦикла;
						
						Для каждого ОбластьСписка Из СписокОчищаемыхОбластей Цикл
							ОбластьСписка.Имя = "";
							ОбластьСписка.Текст = ?(СокрЛП(ОбластьСписка.Текст) = ".", ".", "-");
						КонецЦикла;
						
						Для каждого ЭлСпискаОбластей Из СписокОбластейПереименования Цикл
							ЭлСпискаОбластей.Значение.Имя = ЭлСпискаОбластей.Представление;
						КонецЦикла;
						
						СписокЛистовМЧБ.Добавить(МакетМЧБ.ПолучитьОбласть());
					КонецЦикла;
					
					Для каждого элЛистМЧБ Из СписокЛистовМЧБ Цикл
						
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
						
						ЛистМЧБ = элЛистМЧБ.Значение;
						
						ЛистМЧБ.ПолеСверху = 5;
						ЛистМЧБ.ПолеСправа = 5;
						ЛистМЧБ.ПолеСнизу  = 5;
						ЛистМЧБ.ПолеСлева  = 5;
						
						ДопПараметры = Новый Структура();
						ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод1");
						ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
						ДопПараметры.Вставить("ИндексЛистаМЧБ", СписокЛистовМЧБ.Индекс(элЛистМЧБ));
						ЗаполнитьМакетМЧБ(Парам1, ЛистМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
						
						ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(ЛистМЧБ);
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ЛистМЧБ, СтрПоля, "Макет");
						
						РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
						
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
						
					КонецЦикла;
					
				Иначе
					
					ДопПараметры = Новый Структура();
					ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод1");
					ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
					ДопПараметры.Вставить("ИндексЛистаМЧБ", 0);
					ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(МакетМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
				КонецЕсли;
				
				Если Данные.ЭтоПоследняяСтраницаРаздела <> Неопределено Тогда
					ВыводитьНаПечать_Раздел9_Прод2 = Данные.ЭтоПоследняяСтраницаРаздела;
				Иначе
					ВыводитьНаПечать_Раздел9_Прод2 = (Данные.Записи.Индекс(Запись) = Данные.Записи.Количество() - 1);
				КонецЕсли;
				
				Если ВыводитьНаПечать_Раздел9_Прод2 Тогда
					
					МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел9_Прод2";
					
					МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
					МакетМЧБ.ПолеСверху = 5;
					МакетМЧБ.ПолеСправа = 5;
					МакетМЧБ.ПолеСнизу  = 5;
					МакетМЧБ.ПолеСлева  = 5;
					
					ВремПоля = Новый Структура(СтрПоля);
					
					СохрТабличныйДокумент = Новый ТабличныйДокумент;
					СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
					
					ДопПараметры = Новый Структура();
					ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод2");
					ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
					ДопПараметры.Вставить("Итоги", Данные.Итоги);
					ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(МакетМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
				КонецЕсли;
				
			Иначе
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел9";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел9_Прод1";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод1");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел9_Прод2";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод2");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				Возврат;
				
			КонецЕсли;
			
		ИначеЕсли Парам1.ИмяСтраницы = "Раздел9_Прил1" Тогда
			
			Если Запись <> "" И НЕ (СтруктураРеквизитовФормы.АктуальностьСведенийРаздел9_Прил1 = 1
				И СтруктураРеквизитовФормы.ВидДокумента <> 0) Тогда
			
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел9_Прил1";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				Если Данные.ЭтоПерваяСтраницаРаздела <> Неопределено Тогда
					ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела", Данные.ЭтоПерваяСтраницаРаздела);
				Иначе
					ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела", Данные.Записи.Индекс(Запись) = 0);
				КонецЕсли;
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
				ДопПараметры.Вставить("Итоги", Данные.Итоги);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел9_Прил1_Прод1";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				ТекКолвоСтрокБлокаРаздел9_Прил1_1 = Запись.КодВидОпер.Количество();
				ТекКолвоСтрокБлокаРаздел9_Прил1_2 = Запись.СвПокуп.Количество();
				ТекКолвоСтрокБлокаРаздел9_Прил1_3 = Запись.РегНомТД.Количество();
				
				ИсхКолвоСтрокБлокаРаздел9_Прил1_1 = 7;
				ИсхКолвоСтрокБлокаРаздел9_Прил1_2 = 1;
				ИсхКолвоСтрокБлокаРаздел9_Прил1_3 = 2;
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				Если (ТекКолвоСтрокБлокаРаздел9_Прил1_1 > 0 И ИсхКолвоСтрокБлокаРаздел9_Прил1_1 > 0)
				 ИЛИ (ТекКолвоСтрокБлокаРаздел9_Прил1_2 > 0 И ИсхКолвоСтрокБлокаРаздел9_Прил1_2 > 0)
				 ИЛИ (ТекКолвоСтрокБлокаРаздел9_Прил1_3 > 0 И ИсхКолвоСтрокБлокаРаздел9_Прил1_3 > 0) Тогда
					
					ДробноеКолвоЛистовМЧБ = Макс(
						?(ТекКолвоСтрокБлокаРаздел9_Прил1_1 > ИсхКолвоСтрокБлокаРаздел9_Прил1_1, ТекКолвоСтрокБлокаРаздел9_Прил1_1 / ИсхКолвоСтрокБлокаРаздел9_Прил1_1, 1),
						?(ТекКолвоСтрокБлокаРаздел9_Прил1_2 > ИсхКолвоСтрокБлокаРаздел9_Прил1_2, ТекКолвоСтрокБлокаРаздел9_Прил1_2 / ИсхКолвоСтрокБлокаРаздел9_Прил1_2, 1),
						?(ТекКолвоСтрокБлокаРаздел9_Прил1_3 > ИсхКолвоСтрокБлокаРаздел9_Прил1_3, ТекКолвоСтрокБлокаРаздел9_Прил1_3 / ИсхКолвоСтрокБлокаРаздел9_Прил1_3, 1));
					
					ЦелоеКолвоЛистовМЧБ = Цел(ДробноеКолвоЛистовМЧБ);
					
					КолвоЛистовМЧБ = ?(ДробноеКолвоЛистовМЧБ = ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ + 1);
					
					СтрИменаПоказателей = "П000910009003;П000910011503;П000910018003;П000910018004";
					
					СписокЛистовМЧБ = Новый СписокЗначений;
					
					Для Сч = 1 По КолвоЛистовМЧБ Цикл
						
						СписокОчищаемыхОбластей = Новый Массив;
						СписокОбластейПереименования = Новый СписокЗначений;
						
						Для каждого ТекущаяОбласть Из МакетМЧБ.Области Цикл
							
							ИмяЯчейки = ТекущаяОбласть.Имя;
							
							Если СтрДлина(ИмяЯчейки) < 13 ИЛИ СтрНайти(СтрИменаПоказателей, Лев(ИмяЯчейки, 13)) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							ПоказательИНомерСтрокиСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Истина); // ВМЕСТЕ с разделителем
							ПоказательИНомерСтроки = Лев(ПоказательИНомерСтрокиСРазделителем,СтрДлина(ПоказательИНомерСтрокиСРазделителем) - 1);
							НомерЯчейки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Ложь);
							
							СмысловаяЧастьСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Истина); // ВМЕСТЕ с разделителем
							СмысловаяЧасть = Лев(СмысловаяЧастьСРазделителем,СтрДлина(СмысловаяЧастьСРазделителем) - 1);
							ТекущийСчетчик = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Ложь);
							
							Если СтрНайти(СтрИменаПоказателей,СмысловаяЧасть) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Если СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000910009003") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел9_Прил1_1);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел9_Прил1_1;
							ИначеЕсли СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000910018003") > 0 ИЛИ СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000910018004") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел9_Прил1_2);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел9_Прил1_2;
							ИначеЕсли СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000910011503") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел9_Прил1_3);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел9_Прил1_3;
							КонецЕсли;
							
							Если НовыйСчетчик > ТекКолвоСтрокБлока Тогда
								СписокОчищаемыхОбластей.Добавить(ТекущаяОбласть);
								Продолжить;
							КонецЕсли;
							
							СписокОбластейПереименования.Добавить(ТекущаяОбласть, СмысловаяЧасть + "_" + НовыйСчетчик + "_" + НомерЯчейки);
							
						КонецЦикла;
						
						Для каждого ОбластьСписка Из СписокОчищаемыхОбластей Цикл
							ОбластьСписка.Имя = "";
							ОбластьСписка.Текст = ?(СокрЛП(ОбластьСписка.Текст) = ".", ".", "-");
						КонецЦикла;
						
						Для каждого ЭлСпискаОбластей Из СписокОбластейПереименования Цикл
							ЭлСпискаОбластей.Значение.Имя = ЭлСпискаОбластей.Представление;
						КонецЦикла;
						
						СписокЛистовМЧБ.Добавить(МакетМЧБ.ПолучитьОбласть());
					КонецЦикла;
					
					Для каждого элЛистМЧБ Из СписокЛистовМЧБ Цикл
						
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
						
						ЛистМЧБ = элЛистМЧБ.Значение;
						
						ЛистМЧБ.ПолеСверху = 5;
						ЛистМЧБ.ПолеСправа = 5;
						ЛистМЧБ.ПолеСнизу  = 5;
						ЛистМЧБ.ПолеСлева  = 5;
						
						ДопПараметры = Новый Структура();
						ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод1");
						ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
						ДопПараметры.Вставить("ИндексЛистаМЧБ", СписокЛистовМЧБ.Индекс(элЛистМЧБ));
						ЗаполнитьМакетМЧБ(Парам1, ЛистМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
						
						ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(ЛистМЧБ);
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ЛистМЧБ, СтрПоля, "Макет");
						
						РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
						
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
						
					КонецЦикла;
					
				Иначе
					
					ДопПараметры = Новый Структура();
					ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод1");
					ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
					ДопПараметры.Вставить("ИндексЛистаМЧБ", 0);
					ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(МакетМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
				КонецЕсли;
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел9_Прил1_Прод2";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				ТекКолвоСтрокБлокаРаздел9_Прил1_3 = Запись.ДокПдтвОпл.Количество();
				
				ИсхКолвоСтрокБлокаРаздел9_Прил1_3 = 1;
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				Если ТекКолвоСтрокБлокаРаздел9_Прил1_3 > 0 И ИсхКолвоСтрокБлокаРаздел9_Прил1_3 > 0 Тогда
					
					ДробноеКолвоЛистовМЧБ = ?(ТекКолвоСтрокБлокаРаздел9_Прил1_3 > ИсхКолвоСтрокБлокаРаздел9_Прил1_3,
						ТекКолвоСтрокБлокаРаздел9_Прил1_3 / ИсхКолвоСтрокБлокаРаздел9_Прил1_3, 1);
					
					ЦелоеКолвоЛистовМЧБ = Цел(ДробноеКолвоЛистовМЧБ);
					
					КолвоЛистовМЧБ = ?(ДробноеКолвоЛистовМЧБ = ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ + 1);
					
					СтрИменаПоказателей = "П000910020003;П000910021003";
					
					СписокЛистовМЧБ = Новый СписокЗначений;
					
					Для Сч = 1 По КолвоЛистовМЧБ Цикл
						
						СписокОчищаемыхОбластей = Новый Массив;
						СписокОбластейПереименования = Новый СписокЗначений;
						
						Для каждого ТекущаяОбласть Из МакетМЧБ.Области Цикл
							
							ИмяЯчейки = ТекущаяОбласть.Имя;
							
							Если СтрДлина(ИмяЯчейки) < 13 ИЛИ СтрНайти(СтрИменаПоказателей, Лев(ИмяЯчейки, 13)) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							ПоказательИНомерСтрокиСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Истина); // ВМЕСТЕ с разделителем
							ПоказательИНомерСтроки = Лев(ПоказательИНомерСтрокиСРазделителем,СтрДлина(ПоказательИНомерСтрокиСРазделителем) - 1);
							НомерЯчейки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Ложь);
							
							СмысловаяЧастьСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Истина); // ВМЕСТЕ с разделителем
							СмысловаяЧасть = Лев(СмысловаяЧастьСРазделителем,СтрДлина(СмысловаяЧастьСРазделителем) - 1);
							ТекущийСчетчик = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Ложь);
							
							Если СтрНайти(СтрИменаПоказателей,СмысловаяЧасть) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Если СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000910020003") > 0 ИЛИ СтрЧислоВхождений(ТекущаяОбласть.Имя, "П000910021003") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел9_Прил1_3);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел9_Прил1_3;
							КонецЕсли;
							
							Если НовыйСчетчик > ТекКолвоСтрокБлока Тогда
								СписокОчищаемыхОбластей.Добавить(ТекущаяОбласть);
								Продолжить;
							КонецЕсли;
							
							СписокОбластейПереименования.Добавить(ТекущаяОбласть, СмысловаяЧасть + "_" + НовыйСчетчик + "_" + НомерЯчейки);
							
						КонецЦикла;
						
						Для каждого ОбластьСписка Из СписокОчищаемыхОбластей Цикл
							ОбластьСписка.Имя = "";
							ОбластьСписка.Текст = ?(СокрЛП(ОбластьСписка.Текст) = ".", ".", "-");
						КонецЦикла;
						
						Для каждого ЭлСпискаОбластей Из СписокОбластейПереименования Цикл
							ЭлСпискаОбластей.Значение.Имя = ЭлСпискаОбластей.Представление;
						КонецЦикла;
						
						СписокЛистовМЧБ.Добавить(МакетМЧБ.ПолучитьОбласть());
					КонецЦикла;
					
					Для каждого элЛистМЧБ Из СписокЛистовМЧБ Цикл
						
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
						
						ЛистМЧБ = элЛистМЧБ.Значение;
						
						ЛистМЧБ.ПолеСверху = 5;
						ЛистМЧБ.ПолеСправа = 5;
						ЛистМЧБ.ПолеСнизу  = 5;
						ЛистМЧБ.ПолеСлева  = 5;
						
						ДопПараметры = Новый Структура();
						ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод2");
						ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
						ДопПараметры.Вставить("ИндексЛистаМЧБ", СписокЛистовМЧБ.Индекс(элЛистМЧБ));
						ЗаполнитьМакетМЧБ(Парам1, ЛистМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
						
						ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(ЛистМЧБ);
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ЛистМЧБ, СтрПоля, "Макет");
						
						РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
						
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
						
					КонецЦикла;
					
				Иначе
					
					ДопПараметры = Новый Структура();
					ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод2");
					ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
					ДопПараметры.Вставить("ИндексЛистаМЧБ", 0);
					ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(МакетМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
				КонецЕсли;
				
				Если Данные.ЭтоПоследняяСтраницаРаздела <> Неопределено Тогда
					ВыводитьНаПечать_Раздел9_Прил1_Прод3 = Данные.ЭтоПоследняяСтраницаРаздела;
				Иначе
					ВыводитьНаПечать_Раздел9_Прил1_Прод3 = (Данные.Записи.Индекс(Запись) = Данные.Записи.Количество() - 1);
				КонецЕсли;
				
				Если ВыводитьНаПечать_Раздел9_Прил1_Прод3 Тогда
					
					МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел9_Прил1_Прод3";
					
					МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
					МакетМЧБ.ПолеСверху = 5;
					МакетМЧБ.ПолеСправа = 5;
					МакетМЧБ.ПолеСнизу  = 5;
					МакетМЧБ.ПолеСлева  = 5;
					
					ВремПоля = Новый Структура(СтрПоля);
					
					СохрТабличныйДокумент = Новый ТабличныйДокумент;
					СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
					
					ДопПараметры = Новый Структура();
					ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод3");
					ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
					ДопПараметры.Вставить("Итоги", Данные.Итоги);
					ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(МакетМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
				КонецЕсли;
				
			Иначе
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел9_Прил1";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел9_Прил1_Прод1";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод1");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел9_Прил1_Прод2";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод2");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел9_Прил1_Прод3";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод3");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				Возврат;
				
			КонецЕсли;
			
		ИначеЕсли Парам1.ИмяСтраницы = "Раздел10" Тогда
			
			Если Запись <> "" И НЕ (СтруктураРеквизитовФормы.АктуальностьСведенийРаздел10 = 1
				И СтруктураРеквизитовФормы.ВидДокумента <> 0) Тогда
			
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел10";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				ТекКолвоСтрокБлокаРаздел10 = Запись.КодВидОпер.Количество();
				
				ИсхКолвоСтрокБлокаРаздел10 = 7;
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				Если ТекКолвоСтрокБлокаРаздел10 > 0 И ИсхКолвоСтрокБлокаРаздел10 > 0 Тогда
					
					ДробноеКолвоЛистовМЧБ = ?(ТекКолвоСтрокБлокаРаздел10 > ИсхКолвоСтрокБлокаРаздел10, ТекКолвоСтрокБлокаРаздел10 / ИсхКолвоСтрокБлокаРаздел10, 1);
					
					ЦелоеКолвоЛистовМЧБ = Цел(ДробноеКолвоЛистовМЧБ);
					
					КолвоЛистовМЧБ = ?(ДробноеКолвоЛистовМЧБ = ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ + 1);
					
					СтрИменаПоказателей = "П001000002003";
					
					СписокЛистовМЧБ = Новый СписокЗначений;
					
					Для Сч = 1 По КолвоЛистовМЧБ Цикл
						
						СписокОчищаемыхОбластей = Новый Массив;
						СписокОбластейПереименования = Новый СписокЗначений;
						
						Для каждого ТекущаяОбласть Из МакетМЧБ.Области Цикл
							
							ИмяЯчейки = ТекущаяОбласть.Имя;
							
							Если СтрДлина(ИмяЯчейки) < 13 ИЛИ СтрНайти(СтрИменаПоказателей, Лев(ИмяЯчейки, 13)) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							ПоказательИНомерСтрокиСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Истина); // ВМЕСТЕ с разделителем
							ПоказательИНомерСтроки = Лев(ПоказательИНомерСтрокиСРазделителем,СтрДлина(ПоказательИНомерСтрокиСРазделителем) - 1);
							НомерЯчейки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Ложь);
							
							СмысловаяЧастьСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Истина); // ВМЕСТЕ с разделителем
							СмысловаяЧасть = Лев(СмысловаяЧастьСРазделителем,СтрДлина(СмысловаяЧастьСРазделителем) - 1);
							ТекущийСчетчик = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Ложь);
							
							Если СтрНайти(СтрИменаПоказателей,СмысловаяЧасть) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Если СтрЧислоВхождений(ТекущаяОбласть.Имя, "П001000002003") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел10);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел10;
							КонецЕсли;
							
							Если НовыйСчетчик > ТекКолвоСтрокБлока Тогда
								СписокОчищаемыхОбластей.Добавить(ТекущаяОбласть);
								Продолжить;
							КонецЕсли;
							
							СписокОбластейПереименования.Добавить(ТекущаяОбласть, СмысловаяЧасть + "_" + НовыйСчетчик + "_" + НомерЯчейки);
							
						КонецЦикла;
						
						Для каждого ОбластьСписка Из СписокОчищаемыхОбластей Цикл
							ОбластьСписка.Имя = "";
							ОбластьСписка.Текст = ?(СокрЛП(ОбластьСписка.Текст) = ".", ".", "-");
						КонецЦикла;
						
						Для каждого ЭлСпискаОбластей Из СписокОбластейПереименования Цикл
							ЭлСпискаОбластей.Значение.Имя = ЭлСпискаОбластей.Представление;
						КонецЦикла;
						
						СписокЛистовМЧБ.Добавить(МакетМЧБ.ПолучитьОбласть());
					КонецЦикла;
					
					Для каждого элЛистМЧБ Из СписокЛистовМЧБ Цикл
						
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
						
						ЛистМЧБ = элЛистМЧБ.Значение;
						
						ЛистМЧБ.ПолеСверху = 5;
						ЛистМЧБ.ПолеСправа = 5;
						ЛистМЧБ.ПолеСнизу  = 5;
						ЛистМЧБ.ПолеСлева  = 5;
						
						ДопПараметры = Новый Структура();
						Если Данные.ЭтоПерваяСтраницаРаздела <> Неопределено Тогда
							ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела", Данные.ЭтоПерваяСтраницаРаздела);
						Иначе
							ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела",
								Данные.Записи.Индекс(Запись) = 0 И СписокЛистовМЧБ.Индекс(элЛистМЧБ) = 0);
						КонецЕсли;
						ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
						ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
						ДопПараметры.Вставить("ИндексЛистаМЧБ", СписокЛистовМЧБ.Индекс(элЛистМЧБ));
						ЗаполнитьМакетМЧБ(Парам1, ЛистМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
						
						ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(ЛистМЧБ);
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ЛистМЧБ, СтрПоля, "Макет");
						
						РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
						
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
						
					КонецЦикла;
					
				Иначе
					
					ДопПараметры = Новый Структура();
					ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела", Истина);
					ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
					ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
					ДопПараметры.Вставить("ИндексЛистаМЧБ", 0);
					ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(МакетМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
				КонецЕсли;
				
				Для каждого Сведения Из Запись.СвСчФОтПрод Цикл
					
					МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел10_Прод";
					
					МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
					МакетМЧБ.ПолеСверху = 5;
					МакетМЧБ.ПолеСправа = 5;
					МакетМЧБ.ПолеСнизу  = 5;
					МакетМЧБ.ПолеСлева  = 5;
					
					ВремПоля = Новый Структура(СтрПоля);
					
					СохрТабличныйДокумент = Новый ТабличныйДокумент;
					СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
					
					ДопПараметры = Новый Структура();
					ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод");
					ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
					ДопПараметры.Вставить("Сведения", Сведения);
					ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(МакетМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
				КонецЦикла;
				
			Иначе
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел10";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел10_Прод";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				Возврат;
				
			КонецЕсли;
			
		ИначеЕсли Парам1.ИмяСтраницы = "Раздел11" Тогда
			
			Если Запись <> "" И НЕ (СтруктураРеквизитовФормы.АктуальностьСведенийРаздел11 = 1
				И СтруктураРеквизитовФормы.ВидДокумента <> 0) Тогда
			
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел11";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				ТекКолвоСтрокБлокаРаздел11 = Запись.КодВидОпер.Количество();
				
				ИсхКолвоСтрокБлокаРаздел11 = 7;
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				Если ТекКолвоСтрокБлокаРаздел11 > 0 И ИсхКолвоСтрокБлокаРаздел11 > 0 Тогда
					
					ДробноеКолвоЛистовМЧБ = ?(ТекКолвоСтрокБлокаРаздел11 > ИсхКолвоСтрокБлокаРаздел11, ТекКолвоСтрокБлокаРаздел11 / ИсхКолвоСтрокБлокаРаздел11, 1);
					
					ЦелоеКолвоЛистовМЧБ = Цел(ДробноеКолвоЛистовМЧБ);
					
					КолвоЛистовМЧБ = ?(ДробноеКолвоЛистовМЧБ = ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ, ЦелоеКолвоЛистовМЧБ + 1);
					
					СтрИменаПоказателей = "П001100002003";
					
					СписокЛистовМЧБ = Новый СписокЗначений;
					
					Для Сч = 1 По КолвоЛистовМЧБ Цикл
						
						СписокОчищаемыхОбластей = Новый Массив;
						СписокОбластейПереименования = Новый СписокЗначений;
						
						Для каждого ТекущаяОбласть Из МакетМЧБ.Области Цикл
							
							ИмяЯчейки = ТекущаяОбласть.Имя;
							
							Если СтрДлина(ИмяЯчейки) < 13 ИЛИ СтрНайти(СтрИменаПоказателей, Лев(ИмяЯчейки, 13)) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							ПоказательИНомерСтрокиСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Истина); // ВМЕСТЕ с разделителем
							ПоказательИНомерСтроки = Лев(ПоказательИНомерСтрокиСРазделителем,СтрДлина(ПоказательИНомерСтрокиСРазделителем) - 1);
							НомерЯчейки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Ложь);
							
							СмысловаяЧастьСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Истина); // ВМЕСТЕ с разделителем
							СмысловаяЧасть = Лев(СмысловаяЧастьСРазделителем,СтрДлина(СмысловаяЧастьСРазделителем) - 1);
							ТекущийСчетчик = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Ложь);
							
							Если СтрНайти(СтрИменаПоказателей,СмысловаяЧасть) = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Если СтрЧислоВхождений(ТекущаяОбласть.Имя, "П001100002003") > 0 Тогда
								НовыйСчетчик = Число(ТекущийСчетчик) + ?(Сч = 1, 0, ИсхКолвоСтрокБлокаРаздел11);
								ТекКолвоСтрокБлока = ТекКолвоСтрокБлокаРаздел11;
							КонецЕсли;
							
							Если НовыйСчетчик > ТекКолвоСтрокБлока Тогда
								СписокОчищаемыхОбластей.Добавить(ТекущаяОбласть);
								Продолжить;
							КонецЕсли;
							
							СписокОбластейПереименования.Добавить(ТекущаяОбласть, СмысловаяЧасть + "_" + НовыйСчетчик + "_" + НомерЯчейки);
							
						КонецЦикла;
						
						Для каждого ОбластьСписка Из СписокОчищаемыхОбластей Цикл
							ОбластьСписка.Имя = "";
							ОбластьСписка.Текст = ?(СокрЛП(ОбластьСписка.Текст) = ".", ".", "-");
						КонецЦикла;
						
						Для каждого ЭлСпискаОбластей Из СписокОбластейПереименования Цикл
							ЭлСпискаОбластей.Значение.Имя = ЭлСпискаОбластей.Представление;
						КонецЦикла;
						
						СписокЛистовМЧБ.Добавить(МакетМЧБ.ПолучитьОбласть());
					КонецЦикла;
					
					Для каждого элЛистМЧБ Из СписокЛистовМЧБ Цикл
						
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
						
						ЛистМЧБ = элЛистМЧБ.Значение;
						
						ЛистМЧБ.ПолеСверху = 5;
						ЛистМЧБ.ПолеСправа = 5;
						ЛистМЧБ.ПолеСнизу  = 5;
						ЛистМЧБ.ПолеСлева  = 5;
						
						ДопПараметры = Новый Структура();
						Если Данные.ЭтоПерваяСтраницаРаздела <> Неопределено Тогда
							ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела", Данные.ЭтоПерваяСтраницаРаздела);
						Иначе
							ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела",
								Данные.Записи.Индекс(Запись) = 0 И СписокЛистовМЧБ.Индекс(элЛистМЧБ) = 0);
						КонецЕсли;
						ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
						ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
						ДопПараметры.Вставить("ИндексЛистаМЧБ", СписокЛистовМЧБ.Индекс(элЛистМЧБ));
						ЗаполнитьМакетМЧБ(Парам1, ЛистМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
						
						ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
						ТабличныйДокумент.Очистить();
						ТабличныйДокумент.Вывести(ЛистМЧБ);
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ЛистМЧБ, СтрПоля, "Макет");
						
						РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
						
						ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
						
					КонецЦикла;
					
				Иначе
					
					ДопПараметры = Новый Структура();
					ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела", Истина);
					ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
					ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
					ДопПараметры.Вставить("ИндексЛистаМЧБ", 0);
					ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
					
					ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
					ТабличныйДокумент.Очистить();
					ТабличныйДокумент.Вывести(МакетМЧБ);
					ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
				КонецЕсли;
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел11_Прод";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
			Иначе
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел11";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел11_Прод";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "_Прод");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				Возврат;
				
			КонецЕсли;
			
		ИначеЕсли Парам1.ИмяСтраницы = "Раздел12" Тогда
			
			Если Запись <> "" И НЕ (СтруктураРеквизитовФормы.АктуальностьСведенийРаздел12 = 1
				И СтруктураРеквизитовФормы.ВидДокумента <> 0) Тогда
			
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел12";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				Если Данные.ЭтоПерваяСтраницаРаздела <> Неопределено Тогда
					ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела", Данные.ЭтоПерваяСтраницаРаздела);
				Иначе
					ДопПараметры.Вставить("ЭтоПерваяСтраницаРаздела", Данные.Записи.Индекс(Запись) = 0);
				КонецЕсли;
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Ложь);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, Запись, ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
			Иначе
				
				МЧБРаздела = "ПечатныйБланк2017Кв1_Раздел12";
				
				МакетМЧБ = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(МЧБРаздела);
				МакетМЧБ.ПолеСверху = 5;
				МакетМЧБ.ПолеСправа = 5;
				МакетМЧБ.ПолеСнизу  = 5;
				МакетМЧБ.ПолеСлева  = 5;
				
				ВремПоля = Новый Структура(СтрПоля);
				
				СохрТабличныйДокумент = Новый ТабличныйДокумент;
				СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПостфиксВИмениРаздела", "");
				ДопПараметры.Вставить("ПечатьПустыхБланков", Истина);
				ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов, , ДопПараметры);
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(МакетМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДанныеРазделаНДСДляПечати(ИмяРаздела)
	
	ДанныеРаздела = Неопределено;
	
	Секции = СписокСекцийРазделаИзРегистра(ИмяРаздела);
	
	Если Секции.Количество() > 0 Тогда
		ДанныеРаздела = Новый Структура();
		ДанныеРаздела.Вставить("СтрокиРаздела", Секции.ВыгрузитьКолонку("НомерПервойСтроки"));
		ДанныеРаздела.Вставить("Итоги", РегламентированнаяОтчетность.ИтогиРазделаДекларацииНДС(
		СтруктураРеквизитовФормы.мСохраненныйДок, ИмяРаздела));
	КонецЕсли;
	
	Возврат ДанныеРаздела;
	
КонецФункции

&НаСервере
Функция ДанныеДляПечатиПустыхМЧБРазделов8_12()
	
	Записи = Новый Массив;
	Записи.Вставить(0, "");
	
	Данные = Новый Структура;
	Данные.Вставить("Записи", Записи);
	
	Возврат Данные;
	
КонецФункции

&НаСервере
Процедура ВывестиНаПечатьДополнительныеСтраницы(СтруктураПараметровСтраницы, ОбщиеРеквизитыРазделов)
	
	Перем ИмяСтраницы;
	Перем ТаблицаСтраницРаздела;
	
	СтруктураПараметровСтраницы.Свойство("ИмяСтраницыПанели", ИмяСтраницы);
	
	Если Не мСтруктураМногостраничныхРазделов.Свойство(ИмяСтраницы, ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
	
	МассивПризнаковАктивности = Новый Массив;
	Для Каждого Страница Из ТаблицаСтраницРаздела Цикл
		ТекущийИндекс = ТаблицаСтраницРаздела.Индекс(Страница);
		МассивПризнаковАктивности.Добавить(ТаблицаСтраницРаздела[ТекущийИндекс].АктивнаяСтраница);
	КонецЦикла;
	
	Для Каждого Страница Из ТаблицаСтраницРаздела Цикл
		ТекущийИндекс = ТаблицаСтраницРаздела.Индекс(Страница);
		ВывестиМакетВТаблДокНаСервере(ИмяСтраницы, ТекущийИндекс + 1);
		ВывестиНаПечатьЛист(СтруктураПараметровСтраницы, ОбщиеРеквизитыРазделов);
	КонецЦикла;
	
	Для Каждого Страница Из ТаблицаСтраницРаздела Цикл
		ТекущийИндекс = ТаблицаСтраницРаздела.Индекс(Страница);
		ТаблицаСтраницРаздела[ТекущийИндекс].АктивнаяСтраница = МассивПризнаковАктивности[ТекущийИндекс];
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиРазделов8_12(Показатели, ИмяРаздела, ДанныеРазделов8_12, ДопПараметры)
	
	Если ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел8" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800000103";
			Если ДопПараметры.ЭтоПерваяСтраницаРаздела Тогда
				Если СтруктураРеквизитовФормы.ВидДокумента = 1 Тогда
					Если СтруктураРеквизитовФормы.АктуальностьСведенийРаздел8 = 1 Тогда
						НовСтр.Значение = "1";
					Иначе
						НовСтр.Значение = "0";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "-";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "-";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800000503";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомерПор, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=12;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НачНомСтрКодВидОпер = ДопПараметры.ИндексЛистаМЧБ * 7 + 1;
			Для НомСтрКодВидОпер = НачНомСтрКодВидОпер По НачНомСтрКодВидОпер + 6 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000800001003_" + НомСтрКодВидОпер;
				ИндексВМассиве = НомСтрКодВидОпер - 1;
				Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.КодВидОпер.Количество() Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.КодВидОпер[ИндексВМассиве]);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800002003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.НомСчФПрод), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800003003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаСчФПрод), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800004003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомИспрСчФ, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800005003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаИспрСчФ), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800006003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.НомКСчФПрод), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800007003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаКСчФПрод), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800008003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомИспрКСчФ, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800009003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаИспрКСчФ), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800010003_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.ДокПдтвУпл.Количество() Тогда
				НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.ДокПдтвУпл[ИндексВМассиве].НомДокПдтвУпл);
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800011003_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.ДокПдтвУпл.Количество() Тогда
				НовСтр.Значение = СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДокПдтвУпл[ИндексВМассиве].ДатаДокПдтвУпл), ".", "");
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800012003_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.ДатаУчТов.Количество() Тогда
				НовСтр.Значение = СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаУчТов[ИндексВМассиве]), ".", "");
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800000103";
			Если СтруктураРеквизитовФормы.ВидДокумента = 1 Тогда
				Если СтруктураРеквизитовФормы.АктуальностьСведенийРаздел8 = 1 Тогда
					НовСтр.Значение = "1";
				Иначе
					НовСтр.Значение = "0";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "-";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800000503";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=12;ЧДЦ=0;ЧН=-;ЧГ=");
			
			Для НомСтрКодВидОпер = 1 По 7 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000800001003_" + НомСтрКодВидОпер;
				НовСтр.Значение = "";
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800002003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800003003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800004003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800005003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800006003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800007003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800008003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800009003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800010003_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800011003_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800012003_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел8_Прод" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800013003_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.СвПрод.Количество() Тогда
				Если ТипЗнЧ(ДанныеРазделов8_12.СвПрод[ИндексВМассиве]) = Тип("Структура") Тогда
					Если ДанныеРазделов8_12.СвПрод[ИндексВМассиве].Свойство("ИННЮЛ") Тогда
						НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПрод[ИндексВМассиве].ИННЮЛ) + "--";
					ИначеЕсли ДанныеРазделов8_12.СвПрод[ИндексВМассиве].Свойство("ИННФЛ") Тогда
						НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПрод[ИндексВМассиве].ИННФЛ);
					Иначе
						НовСтр.Значение = "";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800013004_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.СвПрод.Количество() Тогда
				Если ТипЗнЧ(ДанныеРазделов8_12.СвПрод[ИндексВМассиве]) = Тип("Структура") Тогда
					Если ДанныеРазделов8_12.СвПрод[ИндексВМассиве].Свойство("КПП") Тогда
						НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПрод[ИндексВМассиве].КПП);
					Иначе
						НовСтр.Значение = "";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800014003";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвПос) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвПос.Свойство("ИННЮЛ") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПос.ИННЮЛ) + "--", "");
				ИначеЕсли ДанныеРазделов8_12.СвПос.Свойство("ИННФЛ") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПос.ИННФЛ), "");
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800014004";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвПос) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвПос.Свойство("КПП") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПос.КПП), "");
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НачНомСтрРегНомТД = ДопПараметры.ИндексЛистаМЧБ * 9 + 1;
			Для НомСтрРегНомТД = НачНомСтрРегНомТД По НачНомСтрРегНомТД + 8 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000800015003_" + НомСтрРегНомТД;
				ИндексВМассиве = НомСтрРегНомТД - 1;
				Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.РегНомТД.Количество() Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.РегНомТД[ИндексВМассиве]);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800016003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.ОКВ), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800017003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимПокупВ) = Тип("Число"), ДанныеРазделов8_12.СтоимПокупВ, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800018003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СумНДСВыч) = Тип("Число"), ДанныеРазделов8_12.СумНДСВыч, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800019003";
			Если ДопПараметры.ЭтоПоследняяСтраницаРаздела Тогда
				НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СумНДСВсКПк) = Тип("Число"), ДопПараметры.Итоги.СумНДСВсКПк, 0);
			Иначе
				НовСтр.Значение = 0;
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800013003_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800013004_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800014003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800014004";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			Для НомСтрРегНомТД = 1 По 9 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000800015003_" + НомСтрРегНомТД;
				НовСтр.Значение = "";
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800016003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800017003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800018003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000800019003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел8_Прил1" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810000103";
			Если ДопПараметры.ЭтоПерваяСтраницаРаздела Тогда
				Если СтруктураРеквизитовФормы.ВидДокумента = 1 Тогда
					Если СтруктураРеквизитовФормы.АктуальностьСведенийРаздел8_Прил1 = 1 Тогда
						НовСтр.Значение = "1";
					Иначе
						НовСтр.Значение = "0";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "-";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "-";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810000503";
			Если ДопПараметры.ЭтоПерваяСтраницаРаздела Тогда
				НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СумНДСИтКПк) = Тип("Число"), ДопПараметры.Итоги.СумНДСИтКПк, 0);
			Иначе
				НовСтр.Значение = 0;
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810000803";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомерПор, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=12;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НачНомСтрКодВидОпер = ДопПараметры.ИндексЛистаМЧБ * 7 + 1;
			Для НомСтрКодВидОпер = НачНомСтрКодВидОпер По НачНомСтрКодВидОпер + 6 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000810001003_" + НомСтрКодВидОпер;
				ИндексВМассиве = НомСтрКодВидОпер - 1;
				Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.КодВидОпер.Количество() Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.КодВидОпер[ИндексВМассиве]);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810002003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.НомСчФПрод), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810003003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаСчФПрод), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810004003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомИспрСчФ, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810005003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаИспрСчФ), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810006003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.НомКСчФПрод), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810007003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаКСчФПрод), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810008003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомИспрКСчФ, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810009003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаИспрКСчФ), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810010003_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.ДокПдтвУпл.Количество() Тогда
				НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.ДокПдтвУпл[ИндексВМассиве].НомДокПдтвУпл);
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810011003_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.ДокПдтвУпл.Количество() Тогда
				НовСтр.Значение = СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДокПдтвУпл[ИндексВМассиве].ДатаДокПдтвУпл), ".", "");
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810012003_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.ДатаУчТов.Количество() Тогда
				НовСтр.Значение = СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаУчТов[ИндексВМассиве]), ".", "");
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810000103";
			Если СтруктураРеквизитовФормы.ВидДокумента = 1 Тогда
				Если СтруктураРеквизитовФормы.АктуальностьСведенийРаздел8_Прил1 = 1 Тогда
					НовСтр.Значение = "1";
				Иначе
					НовСтр.Значение = "0";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "-";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810000503";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810000803";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=12;ЧДЦ=0;ЧН=-;ЧГ=");
			
			Для НомСтрКодВидОпер = 1 По 7 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000810001003_" + НомСтрКодВидОпер;
				НовСтр.Значение = "";
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810002003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810003003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810004003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810005003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810006003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810007003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810008003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810009003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810010003_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810011003_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810012003_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
		Конецесли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел8_Прил1_Прод" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810013003_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.СвПрод.Количество() Тогда
				Если ТипЗнЧ(ДанныеРазделов8_12.СвПрод[ИндексВМассиве]) = Тип("Структура") Тогда
					Если ДанныеРазделов8_12.СвПрод[ИндексВМассиве].Свойство("ИННЮЛ") Тогда
						НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПрод[ИндексВМассиве].ИННЮЛ) + "--";
					ИначеЕсли ДанныеРазделов8_12.СвПрод[ИндексВМассиве].Свойство("ИННФЛ") Тогда
						НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПрод[ИндексВМассиве].ИННФЛ);
					Иначе
						НовСтр.Значение = "";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810013004_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.СвПрод.Количество() Тогда
				Если ТипЗнЧ(ДанныеРазделов8_12.СвПрод[ИндексВМассиве]) = Тип("Структура") Тогда
					Если ДанныеРазделов8_12.СвПрод[ИндексВМассиве].Свойство("КПП") Тогда
						НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПрод[ИндексВМассиве].КПП);
					Иначе
						НовСтр.Значение = "";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810014003";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвПос) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвПос.Свойство("ИННЮЛ") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПос.ИННЮЛ) + "--", "");
				ИначеЕсли ДанныеРазделов8_12.СвПос.Свойство("ИННФЛ") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПос.ИННФЛ), "");
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810014004";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвПос) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвПос.Свойство("КПП") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПос.КПП), "");
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НачНомСтрРегНомТД = ДопПараметры.ИндексЛистаМЧБ * 9 + 1;
			Для НомСтрРегНомТД = НачНомСтрРегНомТД По НачНомСтрРегНомТД + 8 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000810015003_" + НомСтрРегНомТД;
				ИндексВМассиве = НомСтрРегНомТД - 1;
				Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.РегНомТД.Количество() Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.РегНомТД[ИндексВМассиве]);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810016003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.ОКВ), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810017003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимПокупВ) = Тип("Число"), ДанныеРазделов8_12.СтоимПокупВ, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810018003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СумНДС) = Тип("Число"), ДанныеРазделов8_12.СумНДС, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810019003";
			Если ДопПараметры.ЭтоПоследняяСтраницаРаздела Тогда
				НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СумНДСИтП1Р8) = Тип("Число"), ДопПараметры.Итоги.СумНДСИтП1Р8, 0);
			Иначе
				НовСтр.Значение = 0;
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810013003_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810013004_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810014003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810014004";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			Для НомСтрРегНомТД = 1 По 9 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000810015003_" + НомСтрРегНомТД;
				НовСтр.Значение = "";
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810016003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810017003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810018003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000810019003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел9" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900000103";
			Если ДопПараметры.ЭтоПерваяСтраницаРаздела Тогда
				Если СтруктураРеквизитовФормы.ВидДокумента = 1 Тогда
					Если СтруктураРеквизитовФормы.АктуальностьСведенийРаздел9 = 1 Тогда
						НовСтр.Значение = "1";
					Иначе
						НовСтр.Значение = "0";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "-";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "-";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900000503";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомерПор, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=12;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НачНомСтрКодВидОпер = ДопПараметры.ИндексЛистаМЧБ * 7 + 1;
			Для НомСтрКодВидОпер = НачНомСтрКодВидОпер По НачНомСтрКодВидОпер + 6 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000900001003_" + НомСтрКодВидОпер;
				ИндексВМассиве = НомСтрКодВидОпер - 1;
				Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.КодВидОпер.Количество() Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.КодВидОпер[ИндексВМассиве]);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900002003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.НомСчФПрод), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900003003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаСчФПрод), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НачНомСтрРегНомТД = ДопПараметры.ИндексЛистаМЧБ * 2 + 1;
			Для НомСтрРегНомТД = НачНомСтрРегНомТД По НачНомСтрРегНомТД + 1 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000900003503_" + НомСтрРегНомТД;
				ИндексВМассиве = НомСтрРегНомТД - 1;
				Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.РегНомТД.Количество() Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.РегНомТД[ИндексВМассиве]);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900004003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомИспрСчФ, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900005003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаИспрСчФ), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900006003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.НомКСчФПрод), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900007003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаКСчФПрод), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900008003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомИспрКСчФ, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900009003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаИспрКСчФ), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900010003_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.СвПокуп.Количество() Тогда
				Если ТипЗнЧ(ДанныеРазделов8_12.СвПокуп[ИндексВМассиве]) = Тип("Структура") Тогда
					Если ДанныеРазделов8_12.СвПокуп[ИндексВМассиве].Свойство("ИННЮЛ") Тогда
						НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПокуп[ИндексВМассиве].ИННЮЛ) + "--";
					ИначеЕсли ДанныеРазделов8_12.СвПокуп[ИндексВМассиве].Свойство("ИННФЛ") Тогда
						НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПокуп[ИндексВМассиве].ИННФЛ);
					Иначе
						НовСтр.Значение = "";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900010004_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.СвПокуп.Количество() Тогда
				Если ТипЗнЧ(ДанныеРазделов8_12.СвПокуп[ИндексВМассиве]) = Тип("Структура") Тогда
					Если ДанныеРазделов8_12.СвПокуп[ИндексВМассиве].Свойство("КПП") Тогда
						НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПокуп[ИндексВМассиве].КПП);
					Иначе
						НовСтр.Значение = "";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900000103";
				Если СтруктураРеквизитовФормы.ВидДокумента = 1 Тогда
					Если СтруктураРеквизитовФормы.АктуальностьСведенийРаздел9 = 1 Тогда
						НовСтр.Значение = "1";
					Иначе
						НовСтр.Значение = "0";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "-";
				КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900000503";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=12;ЧДЦ=0;ЧН=-;ЧГ=");
			
			Для НомСтрКодВидОпер = 1 По 7 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000900001003_" + НомСтрКодВидОпер;
				НовСтр.Значение = "";
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900002003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900003003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			Для НомСтрКодВидОпер = 1 По 2 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000900003503_" + НомСтрКодВидОпер;
				НовСтр.Значение = "";
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900004003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900005003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900006003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900007003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900008003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900009003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900010003_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900010004_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел9_Прод1" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900011003";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвПос) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвПос.Свойство("ИННЮЛ") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПос.ИННЮЛ) + "--", "");
				ИначеЕсли ДанныеРазделов8_12.СвПос.Свойство("ИННФЛ") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПос.ИННФЛ), "");
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900011004";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвПос) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвПос.Свойство("КПП") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПос.КПП), "");
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900012003_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.ДокПдтвОпл.Количество() Тогда
				НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.ДокПдтвОпл[ИндексВМассиве].НомДокПдтвОпл);
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900013003_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.ДокПдтвОпл.Количество() Тогда
				НовСтр.Значение = СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДокПдтвОпл[ИндексВМассиве].ДатаДокПдтвОпл), ".", "");
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900014003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.ОКВ), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900015003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимПродСФВ) = Тип("Число"), ДанныеРазделов8_12.СтоимПродСФВ, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900016003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимПродСФ) = Тип("Число"), ДанныеРазделов8_12.СтоимПродСФ, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900017003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимПродСФ18) = Тип("Число"), ДанныеРазделов8_12.СтоимПродСФ18, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900018003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимПродСФ10) = Тип("Число"), ДанныеРазделов8_12.СтоимПродСФ10, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900019003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимПродСФ0) = Тип("Число"), ДанныеРазделов8_12.СтоимПродСФ0, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900020003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СумНДССФ18) = Тип("Число"), ДанныеРазделов8_12.СумНДССФ18, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900021003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СумНДССФ10) = Тип("Число"), ДанныеРазделов8_12.СумНДССФ10, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900022003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимПродОсв) = Тип("Число"), ДанныеРазделов8_12.СтоимПродОсв, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900011003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900011004";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900012003_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900013003_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900014003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900015003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900016003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900017003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900018003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900019003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900020003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900021003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900022003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел9_Прод2" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900023003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СтПродБезНДС18) = Тип("Число"), ДопПараметры.Итоги.СтПродБезНДС18, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900024003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СтПродБезНДС10) = Тип("Число"), ДопПараметры.Итоги.СтПродБезНДС10, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900025003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СтПродБезНДС0) = Тип("Число"), ДопПараметры.Итоги.СтПродБезНДС0, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900026003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СумНДСВсКПр18) = Тип("Число"), ДопПараметры.Итоги.СумНДСВсКПр18, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900027003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СумНДСВсКПр10) = Тип("Число"), ДопПараметры.Итоги.СумНДСВсКПр10, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900028003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СтПродОсвВсКПр) = Тип("Число"), ДопПараметры.Итоги.СтПродОсвВсКПр, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900023003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900024003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900025003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900026003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900027003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000900028003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел9_Прил1" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910000103";
			Если ДопПараметры.ЭтоПерваяСтраницаРаздела Тогда
				Если СтруктураРеквизитовФормы.ВидДокумента = 1 Тогда
					Если СтруктураРеквизитовФормы.АктуальностьСведенийРаздел9_Прил1 = 1 Тогда
						НовСтр.Значение = "1";
					Иначе
						НовСтр.Значение = "0";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "-";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "-";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910002003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.ИтСтПродКПр18) = Тип("Число"), ДопПараметры.Итоги.ИтСтПродКПр18, 0);
			НовСтр.Значение = ?(ДопПараметры.ЭтоПерваяСтраницаРаздела, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910003003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.ИтСтПродКПр10) = Тип("Число"), ДопПараметры.Итоги.ИтСтПродКПр10, 0);
			НовСтр.Значение = ?(ДопПараметры.ЭтоПерваяСтраницаРаздела, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910004003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.ИтСтПродКПр0) = Тип("Число"), ДопПараметры.Итоги.ИтСтПродКПр0, 0);
			НовСтр.Значение = ?(ДопПараметры.ЭтоПерваяСтраницаРаздела, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910005003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СумНДСИтКПр18) = Тип("Число"), ДопПараметры.Итоги.СумНДСИтКПр18, 0);
			НовСтр.Значение = ?(ДопПараметры.ЭтоПерваяСтраницаРаздела, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910006003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СумНДСИтКПр10) = Тип("Число"), ДопПараметры.Итоги.СумНДСИтКПр10, 0);
			НовСтр.Значение = ?(ДопПараметры.ЭтоПерваяСтраницаРаздела, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910007003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.ИтСтПродОсвКПр) = Тип("Число"), ДопПараметры.Итоги.ИтСтПродОсвКПр, 0);
			НовСтр.Значение = ?(ДопПараметры.ЭтоПерваяСтраницаРаздела, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910000103";
			Если СтруктураРеквизитовФормы.ВидДокумента = 1 Тогда
				Если СтруктураРеквизитовФормы.АктуальностьСведенийРаздел9_Прил1 = 1 Тогда
					НовСтр.Значение = "1";
				Иначе
					НовСтр.Значение = "0";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "-";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910002003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910003003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910004003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910005003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910006003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910007003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел9_Прил1_Прод1" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910008003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомерПор, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=12;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НачНомСтрКодВидОпер = ДопПараметры.ИндексЛистаМЧБ * 7 + 1;
			Для НомСтрКодВидОпер = НачНомСтрКодВидОпер По НачНомСтрКодВидОпер + 6 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000910009003_" + НомСтрКодВидОпер;
				ИндексВМассиве = НомСтрКодВидОпер - 1;
				Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.КодВидОпер.Количество() Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.КодВидОпер[ИндексВМассиве]);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910010003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.НомСчФПрод), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910011003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаСчФПрод), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НачНомСтрРегНомТД = ДопПараметры.ИндексЛистаМЧБ * 2 + 1;
			Для НомСтрРегНомТД = НачНомСтрРегНомТД По НачНомСтрРегНомТД + 1 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000910011503_" + НомСтрРегНомТД;
				ИндексВМассиве = НомСтрРегНомТД - 1;
				Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.РегНомТД.Количество() Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.РегНомТД[ИндексВМассиве]);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910012003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомИспрСчФ, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910013003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаИспрСчФ), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910014003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.НомКСчФПрод), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910015003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаКСчФПрод), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910016003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомИспрКСчФ, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910017003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаИспрКСчФ), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910018003_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.СвПокуп.Количество() Тогда
				Если ТипЗнЧ(ДанныеРазделов8_12.СвПокуп[ИндексВМассиве]) = Тип("Структура") Тогда
					Если ДанныеРазделов8_12.СвПокуп[ИндексВМассиве].Свойство("ИННЮЛ") Тогда
						НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПокуп[ИндексВМассиве].ИННЮЛ) + "--";
					ИначеЕсли ДанныеРазделов8_12.СвПокуп[ИндексВМассиве].Свойство("ИННФЛ") Тогда
						НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПокуп[ИндексВМассиве].ИННФЛ);
					Иначе
						НовСтр.Значение = "";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910018004_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.СвПокуп.Количество() Тогда
				Если ТипЗнЧ(ДанныеРазделов8_12.СвПокуп[ИндексВМассиве]) = Тип("Структура") Тогда
					Если ДанныеРазделов8_12.СвПокуп[ИндексВМассиве].Свойство("КПП") Тогда
						НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПокуп[ИндексВМассиве].КПП);
					Иначе
						НовСтр.Значение = "";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910008003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=12;ЧДЦ=0;ЧН=-;ЧГ=");
			
			Для НомСтрКодВидОпер = 1 По 7 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000910009003_" + НомСтрКодВидОпер;
				НовСтр.Значение = "";
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910010003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910011003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			Для НомСтрКодВидОпер = 1 По 2 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П000910011503_" + НомСтрКодВидОпер;
				НовСтр.Значение = "";
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910012003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910013003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910014003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910015003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910016003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910017003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910018003_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910018004_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел9_Прил1_Прод2" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910019003";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвПос) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвПос.Свойство("ИННЮЛ") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПос.ИННЮЛ) + "--", "");
				ИначеЕсли ДанныеРазделов8_12.СвПос.Свойство("ИННФЛ") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПос.ИННФЛ), "");
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910019004";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвПос) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвПос.Свойство("КПП") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПос.КПП), "");
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910020003_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.ДокПдтвОпл.Количество() Тогда
				НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.ДокПдтвОпл[ИндексВМассиве].НомДокПдтвОпл);
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910021003_" + Формат(ДопПараметры.ИндексЛистаМЧБ + 1, "ЧГ=");
			ИндексВМассиве = ДопПараметры.ИндексЛистаМЧБ;
			Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.ДокПдтвОпл.Количество() Тогда
				НовСтр.Значение = СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДокПдтвОпл[ИндексВМассиве].ДатаДокПдтвОпл), ".", "");
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910022003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.ОКВ), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910023003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимПродСФВ) = Тип("Число"), ДанныеРазделов8_12.СтоимПродСФВ, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910024003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимПродСФ) = Тип("Число"), ДанныеРазделов8_12.СтоимПродСФ, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910025003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимПродСФ18) = Тип("Число"), ДанныеРазделов8_12.СтоимПродСФ18, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910026003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимПродСФ10) = Тип("Число"), ДанныеРазделов8_12.СтоимПродСФ10, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910027003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимПродСФ0) = Тип("Число"), ДанныеРазделов8_12.СтоимПродСФ0, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910028003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СумНДССФ18) = Тип("Число"), ДанныеРазделов8_12.СумНДССФ18, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910029003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СумНДССФ10) = Тип("Число"), ДанныеРазделов8_12.СумНДССФ10, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910030003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимПродОсв) = Тип("Число"), ДанныеРазделов8_12.СтоимПродОсв, 0);
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, НовСтр.Значение, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910019003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910019004";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910020003_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910021003_1";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910022003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910023003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910024003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910025003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910026003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910027003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910028003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910029003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910030003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел9_Прил1_Прод3" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910031003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СтПродВсП1Р9_18) = Тип("Число"), ДопПараметры.Итоги.СтПродВсП1Р9_18, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910032003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СтПродВсП1Р9_10) = Тип("Число"), ДопПараметры.Итоги.СтПродВсП1Р9_10, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910033003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СтПродВсП1Р9_0) = Тип("Число"), ДопПараметры.Итоги.СтПродВсП1Р9_0, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910034003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СумНДСВсП1Р9_18) = Тип("Число"), ДопПараметры.Итоги.СумНДСВсП1Р9_18, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910035003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СумНДСВсП1Р9_10) = Тип("Число"), ДопПараметры.Итоги.СумНДСВсП1Р9_10, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910036003";
			НовСтр.Значение = ?(ТипЗнч(ДопПараметры.Итоги.СтПродОсвП1Р9Вс) = Тип("Число"), ДопПараметры.Итоги.СтПродОсвП1Р9Вс, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910031003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910032003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910033003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910034003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910035003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П000910036003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел10" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000000103";
			Если ДопПараметры.ЭтоПерваяСтраницаРаздела Тогда
				Если СтруктураРеквизитовФормы.ВидДокумента = 1 Тогда
					Если СтруктураРеквизитовФормы.АктуальностьСведенийРаздел10 = 1 Тогда
						НовСтр.Значение = "1";
					Иначе
						НовСтр.Значение = "0";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "-";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "-";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000000503";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомерПор, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=12;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НачНомСтрКодВидОпер = ДопПараметры.ИндексЛистаМЧБ * 7 + 1;
			Для НомСтрКодВидОпер = НачНомСтрКодВидОпер По НачНомСтрКодВидОпер + 6 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П001000002003_" + НомСтрКодВидОпер;
				ИндексВМассиве = НомСтрКодВидОпер - 1;
				Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.КодВидОпер.Количество() Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.КодВидОпер[ИндексВМассиве]);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000003003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.НомСчФПрод), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000004003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаСчФПрод), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000005003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомИспрСчФ, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000006003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаИспрСчФ), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000007003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.НомКСчФПрод), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000008003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаКСчФПрод), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000009003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомИспрКСчФ, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000010003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаИспрКСчФ), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000011003";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвПокуп) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвПокуп.Свойство("ИННЮЛ") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПокуп.ИННЮЛ) + "--", "");
				ИначеЕсли ДанныеРазделов8_12.СвПокуп.Свойство("ИННФЛ") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПокуп.ИННФЛ), "");
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000011004";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвПокуп) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвПокуп.Свойство("КПП") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПокуп.КПП), "");
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000000103";
			Если СтруктураРеквизитовФормы.ВидДокумента = 1 Тогда
				Если СтруктураРеквизитовФормы.АктуальностьСведенийРаздел10 = 1 Тогда
					НовСтр.Значение = "1";
				Иначе
					НовСтр.Значение = "0";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "-";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000000503";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=12;ЧДЦ=0;ЧН=-;ЧГ=");
			
			Для НомСтрКодВидОпер = 1 По 7 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П001000002003_" + НомСтрКодВидОпер;
				НовСтр.Значение = "";
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000003003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000004003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000005003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000006003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000007003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000008003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000009003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000010003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000011003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000011004";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел10_Прод" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			Сведения = ДопПараметры.Сведения;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000012003";
			Если ТипЗнЧ(Сведения.СвПрод) = Тип("Структура") Тогда
				Если Сведения.СвПрод.Свойство("ИННЮЛ") Тогда
					НовСтр.Значение = СокрЛП(Сведения.СвПрод.ИННЮЛ) + "--";
				ИначеЕсли Сведения.СвПрод.Свойство("ИННФЛ") Тогда
					НовСтр.Значение = СокрЛП(Сведения.СвПрод.ИННФЛ);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000012004";
			Если ТипЗнЧ(Сведения.СвПрод) = Тип("Структура") Тогда
				Если Сведения.СвПрод.Свойство("КПП") Тогда
					НовСтр.Значение = СокрЛП(Сведения.СвПрод.КПП);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000013003";
			НовСтр.Значение = СокрЛП(Сведения.НомСчФОтПрод);
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000014003";
			НовСтр.Значение = СтрЗаменить(СокрЛП(Сведения.ДатаСчФОтПрод), ".", "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000015003";
			НовСтр.Значение = СокрЛП(Сведения.ОКВ);
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000016003";
			НовСтр.Значение = ?(ТипЗнч(Сведения.СтоимТовСчФВс) = Тип("Число"), Сведения.СтоимТовСчФВс, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000017003";
			НовСтр.Значение = ?(ТипЗнч(Сведения.СумНДССчФ) = Тип("Число"), Сведения.СумНДССчФ, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000018003";
			НовСтр.Значение = ?(ТипЗнч(Сведения.РазСтКСчФУм) = Тип("Число"), Сведения.РазСтКСчФУм, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000019003";
			НовСтр.Значение = ?(ТипЗнч(Сведения.РазСтКСчФУв) = Тип("Число"), Сведения.РазСтКСчФУв, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000020003";
			НовСтр.Значение = ?(ТипЗнч(Сведения.РазНДСКСчФУм) = Тип("Число"), Сведения.РазНДСКСчФУм, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000021003";
			НовСтр.Значение = ?(ТипЗнч(Сведения.РазНДСКСчФУв) = Тип("Число"), Сведения.РазНДСКСчФУв, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000012003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000012004";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000013003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000014003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000015003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000016003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000017003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000018003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000019003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000020003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001000021003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел11" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100000103";
			Если ДопПараметры.ЭтоПерваяСтраницаРаздела Тогда
				Если СтруктураРеквизитовФормы.ВидДокумента = 1 Тогда
					Если СтруктураРеквизитовФормы.АктуальностьСведенийРаздел11 = 1 Тогда
						НовСтр.Значение = "1";
					Иначе
						НовСтр.Значение = "0";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "-";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "-";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100000503";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомерПор, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=12;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НачНомСтрКодВидОпер = ДопПараметры.ИндексЛистаМЧБ * 7 + 1;
			Для НомСтрКодВидОпер = НачНомСтрКодВидОпер По НачНомСтрКодВидОпер + 6 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П001100002003_" + НомСтрКодВидОпер;
				ИндексВМассиве = НомСтрКодВидОпер - 1;
				Если ИндексВМассиве + 1 <= ДанныеРазделов8_12.КодВидОпер.Количество() Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.КодВидОпер[ИндексВМассиве]);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100003003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.НомСчФПрод), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100004003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаСчФПрод), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100005003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомИспрСчФ, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100006003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаИспрСчФ), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100007003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.НомКСчФПрод), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100008003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаКСчФПрод), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100009003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, ДанныеРазделов8_12.НомИспрКСчФ, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100010003";
			НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаИспрКСчФ), ".", ""), "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100011003";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвПрод) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвПрод.Свойство("ИННЮЛ") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПрод.ИННЮЛ) + "--", "");
				ИначеЕсли ДанныеРазделов8_12.СвПрод.Свойство("ИННФЛ") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПрод.ИННФЛ), "");
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100011004";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвПрод) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвПрод.Свойство("КПП") Тогда
					НовСтр.Значение = ?(ДопПараметры.ИндексЛистаМЧБ = 0, СокрЛП(ДанныеРазделов8_12.СвПрод.КПП), "");
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100000103";
			Если СтруктураРеквизитовФормы.ВидДокумента = 1 Тогда
				Если СтруктураРеквизитовФормы.АктуальностьСведенийРаздел11 = 1 Тогда
					НовСтр.Значение = "1";
				Иначе
					НовСтр.Значение = "0";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "-";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100000503";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=12;ЧДЦ=0;ЧН=-;ЧГ=");
			
			Для НомСтрКодВидОпер = 1 По 7 Цикл
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = "П001100002003_" + НомСтрКодВидОпер;
				НовСтр.Значение = "";
				НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			КонецЦикла;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100003003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100004003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100005003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100006003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100007003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100008003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100009003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=3;ЧДЦ=0;ЧН=-;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100010003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100011003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100011004";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел11_Прод" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100012003";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвКомис) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвКомис.Свойство("ИННЮЛ") Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвКомис.ИННЮЛ) + "--";
				ИначеЕсли ДанныеРазделов8_12.СвКомис.Свойство("ИННФЛ") Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвКомис.ИННФЛ);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100012004";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвКомис) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвКомис.Свойство("КПП") Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвКомис.КПП);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100013003";
			НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.КодВидСд);
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100014003";
			НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.ОКВ);
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100015003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимТовСчФВс) = Тип("Число"), ДанныеРазделов8_12.СтоимТовСчФВс, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100016003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СумНДССчФ) = Тип("Число"), ДанныеРазделов8_12.СумНДССчФ, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100017003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.РазСтКСчФУм) = Тип("Число"), ДанныеРазделов8_12.РазСтКСчФУм, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100018003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.РазСтКСчФУв) = Тип("Число"), ДанныеРазделов8_12.РазСтКСчФУв, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100019003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.РазНДСКСчФУм) = Тип("Число"), ДанныеРазделов8_12.РазНДСКСчФУм, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100020003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.РазНДСКСчФУв) = Тип("Число"), ДанныеРазделов8_12.РазНДСКСчФУв, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100012003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100012004";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100013003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100014003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100015003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100016003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100017003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100018003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100019003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001100020003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела + ДопПараметры.ПостфиксВИмениРаздела = "Раздел12" Тогда
		
		Если НЕ ДопПараметры.ПечатьПустыхБланков Тогда
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200000103";
			Если ДопПараметры.ЭтоПерваяСтраницаРаздела Тогда
				Если СтруктураРеквизитовФормы.ВидДокумента = 1 Тогда
					Если СтруктураРеквизитовФормы.АктуальностьСведенийРаздел12 = 1 Тогда
						НовСтр.Значение = "1";
					Иначе
						НовСтр.Значение = "0";
					КонецЕсли;
				Иначе
					НовСтр.Значение = "-";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "-";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200002003";
			НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.НомСчФ);
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200003003";
			НовСтр.Значение = СтрЗаменить(СокрЛП(ДанныеРазделов8_12.ДатаСчФ), ".", "");
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200004003";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвПокуп) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвПокуп.Свойство("ИННЮЛ") Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПокуп.ИННЮЛ) + "--";
				ИначеЕсли ДанныеРазделов8_12.СвПокуп.Свойство("ИННФЛ") Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПокуп.ИННФЛ);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200004004";
			Если ТипЗнЧ(ДанныеРазделов8_12.СвПокуп) = Тип("Структура") Тогда
				Если ДанныеРазделов8_12.СвПокуп.Свойство("КПП") Тогда
					НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.СвПокуп.КПП);
				Иначе
					НовСтр.Значение = "";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200005003";
			НовСтр.Значение = СокрЛП(ДанныеРазделов8_12.ОКВ);
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200006003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимТовБНалВс) = Тип("Число"), ДанныеРазделов8_12.СтоимТовБНалВс, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200007003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СумНалПокуп) = Тип("Число"), ДанныеРазделов8_12.СумНалПокуп, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200008003";
			НовСтр.Значение = ?(ТипЗнч(ДанныеРазделов8_12.СтоимТовСНалВс) = Тип("Число"), ДанныеРазделов8_12.СтоимТовСНалВс, 0);
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		Иначе
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200000103";
			Если СтруктураРеквизитовФормы.ВидДокумента = 1 Тогда
				Если СтруктураРеквизитовФормы.АктуальностьСведенийРаздел12 = 1 Тогда
					НовСтр.Значение = "1";
				Иначе
					НовСтр.Значение = "0";
				КонецЕсли;
			Иначе
				НовСтр.Значение = "-";
			КонецЕсли;
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200002003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200003003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200004003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200004004";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200005003";
			НовСтр.Значение = "";
			НовСтр.ЗначениеМЧБ = НовСтр.Значение;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200006003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200007003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "П001200008003";
			НовСтр.Значение = 0;
			НовСтр.ЗначениеМЧБ = Формат(НовСтр.Значение, "ЧЦ=19;ЧДЦ=2;ЧН=-;ЧРД=.;ЧГ=");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМакетМЧБ(ПараметрыПечати, МакетМЧБ, ОбщиеРеквизитыРазделов, ДанныеРазделов8_12 = Неопределено, ДопПараметры = Неопределено)
	
	Показатели = Новый ТаблицаЗначений;
	Показатели.Колонки.Добавить("Имя");
	Показатели.Колонки.Добавить("Значение");
	Показатели.Колонки.Добавить("ЗначениеМЧБ");
	
	Показатели.Индексы.Добавить("Имя");
	
	Если ПараметрыПечати.ИмяСтраницы = "Раздел8"
		ИЛИ ПараметрыПечати.ИмяСтраницы = "Раздел8_Прил1"
		ИЛИ ПараметрыПечати.ИмяСтраницы = "Раздел9"
		ИЛИ ПараметрыПечати.ИмяСтраницы = "Раздел9_Прил1"
		ИЛИ ПараметрыПечати.ИмяСтраницы = "Раздел10"
		ИЛИ ПараметрыПечати.ИмяСтраницы = "Раздел11"
		ИЛИ ПараметрыПечати.ИмяСтраницы = "Раздел12" Тогда
		ЗаполнитьПоказателиРазделов8_12(Показатели, ПараметрыПечати.ИмяСтраницы, ДанныеРазделов8_12, ДопПараметры);
	Иначе
		ИсходныйМакет = ТабличныйДокумент;
		Для Каждого Область Из ИсходныйМакет.Области Цикл
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник И Область.СодержитЗначение = Истина Тогда
				НовСтр = Показатели.Добавить();
				НовСтр.Имя = Область.Имя;
				НовСтр.Значение = Область.Значение;
				НовСтр.ЗначениеМЧБ = ПолучитьЗначениеМЧБ(Область);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НайденноеЗначение = Показатели.Найти("ИНН1", "Имя");
	
	Если НЕ НайденноеЗначение = Неопределено Тогда
		Показатели.Удалить(НайденноеЗначение);
	КонецЕсли;
	
	ИНН = "";
	Для Ном = 0 По 11 Цикл
		ИНН = ИНН + ОбщиеРеквизитыРазделов.ИНН[Ном];
	КонецЦикла;
	
	НовСтр = Показатели.Добавить();
	НовСтр.Имя = "ИНН1";
	НовСтр.Значение = ИНН;
	НовСтр.ЗначениеМЧБ = СокрЛП(ИНН);
	
	НовСтр = Показатели.Добавить();
	НовСтр.Имя = "ИНН2";
	НовСтр.Значение = ИНН;
	НовСтр.ЗначениеМЧБ = СокрЛП(ИНН);
	
	НайденноеЗначение = Показатели.Найти("КПП1", "Имя");
	
	Если НЕ НайденноеЗначение = Неопределено Тогда
		Показатели.Удалить(НайденноеЗначение);
	КонецЕсли;
	
	КПП = "";
	Для Ном = 0 По 8 Цикл
		КПП = КПП + ОбщиеРеквизитыРазделов.КПП[Ном];
	КонецЦикла;
	
	НовСтр = Показатели.Добавить();
	НовСтр.Имя = "КПП1";
	НовСтр.Значение = КПП;
	НовСтр.ЗначениеМЧБ = СокрЛП(КПП);
	
	НовСтр = Показатели.Добавить();
	НовСтр.Имя = "КПП2";
	НовСтр.Значение = КПП;
	НовСтр.ЗначениеМЧБ = СокрЛП(КПП);
	
	НайденноеЗначение = Показатели.Найти("ДатаПодписи", "Имя");
	
	Если НЕ НайденноеЗначение = Неопределено Тогда
		Показатели.Удалить(НайденноеЗначение);
	КонецЕсли;
	
	ДатаПодписиСтр = "";
	Для Ном = 0 По 7 Цикл
		ДатаПодписиСтр = ДатаПодписиСтр + ОбщиеРеквизитыРазделов.ДатаПодписи[Ном];
	КонецЦикла;
	
	НовСтр = Показатели.Добавить();
	НовСтр.Имя = "ДатаПодписи";
	НовСтр.Значение = ДатаПодписиСтр;
	НовСтр.ЗначениеМЧБ = СокрЛП(ДатаПодписиСтр);
	
	НовСтр = Показатели.Добавить();
	НовСтр.Имя = "ДатаПодписиПолная";
	Если СокрЛП(ДатаПодписиСтр) <> "" Тогда
		НовСтр.Значение = Формат(Дата(Прав(ДатаПодписиСтр, 4) + Сред(ДатаПодписиСтр, 3, 2) + Лев(ДатаПодписиСтр, 2) + "000000"), "ДФ = ""дд.ММ.гггг""");
		НовСтр.ЗначениеМЧБ = СокрЛП(Формат(Дата(Прав(ДатаПодписиСтр, 4) + Сред(ДатаПодписиСтр, 3, 2) + Лев(ДатаПодписиСтр, 2) + "000000"), "ДФ = ""дд.ММ.гггг"""));
	КонецЕсли;
	
	// Особая обработка ФИО на титульном листе.
	Если ПараметрыПечати.ИмяСтраницы = "Титульный" Тогда
		
		ПокПодписант = Показатели.Найти("ОргПодписант", "Имя");
		Если ПокПодписант <> Неопределено Тогда
			
			ФИО = РегламентированнаяОтчетность.РазложитьФИО(ПокПодписант.Значение);
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "ОргПодписантФамилия";
			НовСтр.Значение = ФИО.Фамилия;
			НовСтр.ЗначениеМЧБ = ФИО.Фамилия;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "ОргПодписантИмя";
			НовСтр.Значение = ФИО.Имя;
			НовСтр.ЗначениеМЧБ = ФИО.Имя;
			
			НовСтр = Показатели.Добавить();
			НовСтр.Имя = "ОргПодписантОтчество";
			НовСтр.Значение = ФИО.Отчество;
			НовСтр.ЗначениеМЧБ = ФИО.Отчество;
			
		КонецЕсли;
		
		ПокОКВЭД = Показатели.Найти("ОКВЭД", "Имя");
		Если ПокОКВЭД <> Неопределено Тогда
			ОКВЭД = ПокОКВЭД.ЗначениеМЧБ;
			Если Сред(ОКВЭД, 2, 1) = "." Тогда
				ОКВЭД = Лев(ОКВЭД, 1) + " " + Сред(ОКВЭД, 2);
			КонецЕсли;
			Если Сред(ОКВЭД, 5, 1) = "." Тогда
				ОКВЭД = Лев(ОКВЭД, 4) + " " + Сред(ОКВЭД, 5);
			КонецЕсли;
			ПокОКВЭД.Значение = ОКВЭД;
			ПокОКВЭД.ЗначениеМЧБ = ОКВЭД;
		КонецЕсли;
		
	КонецЕсли;
	
	ИндексТочкиПоКорню = Новый Структура;
	Для каждого Область Из МакетМЧБ.Области Цикл
		Если Область.Текст = "." Тогда
			ТекАдресЗначенияОбласти = АдресЗначенияОбласти(Область);
			Корень = ТекАдресЗначенияОбласти.Корень;
			ИндексТочкиЧислаНаМЧБ = ТекАдресЗначенияОбласти.ИндексЗнакоместа;
			ИндексТочкиПоКорню.Вставить(Корень,ИндексТочкиЧислаНаМЧБ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Область Из МакетМЧБ.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			ИмяОбласти = Область.Имя;
			
			Если СтрЧислоВхождений(ИмяОбласти, "НомСтр") > 0
				ИЛИ СтрЧислоВхождений(ИмяОбласти, "СоставленаНа") > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			РезультатПоиска = Показатели.Найти(ИмяОбласти, "Имя");
			Если РезультатПоиска = Неопределено Тогда
				ТекАдресЗначенияОбласти = АдресЗначенияОбласти(Область);
				ЗначениеВыведено = Ложь;
				Если ТекАдресЗначенияОбласти.ИндексЗнакоместа <> 0 Тогда
					РезультатПоиска = Показатели.Найти(ТекАдресЗначенияОбласти.Корень, "Имя");
					Если РезультатПоиска <> Неопределено Тогда
						Если ТипЗнч(РезультатПоиска.Значение)=Тип("Число") Тогда
							//разделение числа на 2 части
							ЦелаяЧасть = Цел(РезультатПоиска.Значение);
							СтрЦелаяЧасть = СтрЗаменить(Строка(Формат(Цел(РезультатПоиска.Значение), "ЧРГ=';'")), ";", "");
							Если РезультатПоиска.Значение < 0 И СтрНайти(РезультатПоиска.ЗначениеМЧБ, ".") > 0 Тогда
								СтрДробнаяЧасть = Сред(Строка(РезультатПоиска.Значение - ЦелаяЧасть),4);
							Иначе
								СтрДробнаяЧасть = Сред(Строка(РезультатПоиска.Значение - ЦелаяЧасть),3);
							КонецЕсли;
							//разделение областей показателя на 2 части
							
							ИндексТочкиЧислаНаМЧБ = Неопределено;
							Если ИндексТочкиПоКорню.Свойство(ТекАдресЗначенияОбласти.Корень,ИндексТочкиЧислаНаМЧБ) = Ложь Тогда
								//На МЧБ нет разделения на целую и дробную части
								ПрисвоитьЗначениеОбласти(Область, РезультатПоиска.ЗначениеМЧБ, ТекАдресЗначенияОбласти.ИндексЗнакоместа);
								ЗначениеВыведено = Истина;
							Иначе
								//определяем какая часть выводится (Целая, дробная или точка)
								Если ТекАдресЗначенияОбласти.ИндексЗнакоместа<ИндексТочкиЧислаНаМЧБ Тогда
									//выводится целая часть
									ПрисвоитьЗначениеОбласти(Область, ?(РезультатПоиска.ЗначениеМЧБ = "-","-",СтрЦелаяЧасть), ТекАдресЗначенияОбласти.ИндексЗнакоместа);
									ЗначениеВыведено = Истина;
								ИначеЕсли ТекАдресЗначенияОбласти.ИндексЗнакоместа > ИндексТочкиЧислаНаМЧБ Тогда
									//выводится дробная часть
									ПрисвоитьЗначениеОбласти(Область, СтрДробнаяЧасть, ТекАдресЗначенияОбласти.ИндексЗнакоместа - ИндексТочкиЧислаНаМЧБ);
									ЗначениеВыведено = Истина;
								Иначе
									//выводится точка
									//присваивать ничего не будем, но считаем, что область заполненяется корректно
									ЗначениеВыведено = Истина;
								КонецЕсли;
							КонецЕсли;
						Иначе
							ПрисвоитьЗначениеОбласти(Область, РезультатПоиска.ЗначениеМЧБ, ТекАдресЗначенияОбласти.ИндексЗнакоместа, ТипЗнч(РезультатПоиска.Значение) <> Тип("Строка") ИЛИ НЕ ЗначениеЗаполнено(РезультатПоиска.Значение));
							ЗначениеВыведено = Истина;
						КонецЕсли;
					КонецЕсли;
					
					Если НЕ ЗначениеВыведено
						И (ПараметрыПечати.ИмяСтраницы = "Раздел3_Прил2"
						ИЛИ ПараметрыПечати.ИмяСтраницы = "Раздел7") Тогда
						ЗначениеВыведено = Истина;
					КонецЕсли;
					
				КонецЕсли;
				Если НЕ ЗначениеВыведено Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='Не удалось заполнить область ""%1""!';ru='Не удалось заполнить область ""%1""!'"), ИмяОбласти);
					Сообщение.Сообщить();
					
				КонецЕсли;
			Иначе
				ПрисвоитьЗначениеОбласти(Область, РезультатПоиска.ЗначениеМЧБ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбщиеРеквизитыСТитульногоЛиста()
	
	МассивИНН         = Новый Массив(12);
	МассивКПП         = Новый Массив(9);
	МассивДатаПодписи = Новый Массив(8);
	
	ИсходныйМакет = ТабличныйДокумент;
	
	Область = ИсходныйМакет.Области.Найти("ИНН1");
	
	Если НЕ Область = Неопределено Тогда
		
		СтрИНН = Область.Значение;
		
		Если СтрДлина(СтрИНН) = 10 Тогда
			СтрИНН = СтрИНН + "--";
		КонецЕсли;
		
		Для Ном = 1 По СтрДлина(СтрИНН) Цикл
			
			МассивИНН[Ном - 1] = Сред(СтрИНН, Ном, 1);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Область = ИсходныйМакет.Области.Найти("КПП1");
	
	Если НЕ Область = Неопределено Тогда
		
		Для Ном = 1 По СтрДлина(Область.Значение) Цикл
			
			МассивКПП[Ном - 1] = Сред(Область.Значение, Ном, 1);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Область = ИсходныйМакет.Области.Найти("ДатаПодписи");
	
	Если НЕ Область = Неопределено Тогда
		
		Если ЗначениеЗаполнено(Область.Значение) Тогда
			Если ТипЗнч(Область.Значение) = Тип("Строка") Тогда
				СтрДатаПодписи = Лев(СтрЗаменить(Область.Значение, ".", ""), 8);
			ИначеЕсли ТипЗнч(Область.Значение) = Тип("Дата") Тогда
				СтрДатаПодписи = Лев(СтрЗаменить(Формат(Область.Значение, "ДФ = ""дд.ММ.гггг 'г.'"""), ".", ""), 8);
			КонецЕсли;
		Иначе
			СтрДатаПодписи = "        ";
		КонецЕсли;
		
		Для Ном = 1 По СтрДлина(СтрДатаПодписи) Цикл
			МассивДатаПодписи[Ном - 1] = Сред(СтрДатаПодписи, Ном, 1);
		КонецЦикла;
		
	КонецЕсли;
	
	ОбщиеРеквизитыРазделов = Новый Структура;
	
	ОбщиеРеквизитыРазделов.Вставить("ИНН", МассивИНН);
	ОбщиеРеквизитыРазделов.Вставить("КПП", МассивКПП);
	ОбщиеРеквизитыРазделов.Вставить("ДатаПодписи", МассивДатаПодписи);
	
	Возврат ОбщиеРеквизитыРазделов;
	
КонецФункции

&НаСервере
Процедура ОбнулитьИтоговыеПоказателиНаЛистеМЧБ(ТаблДок)
	
	ИменаОбластейИтоговыхПоказателей = Новый Массив;
	
	ИменаОбластейИтоговыхПоказателей.Добавить("ИтоговыеПоказатели");
	ИменаОбластейИтоговыхПоказателей.Добавить("ИтоговыеПоказатели1");
	ИменаОбластейИтоговыхПоказателей.Добавить("ИтоговыеПоказатели2");
	
	Для каждого ИмяОбластиИтоговыхПоказателей Из ИменаОбластейИтоговыхПоказателей Цикл
		
		ОбластьИтоговыеПоказатели = ТаблДок.Области.Найти(ИмяОбластиИтоговыхПоказателей);
		
		Если ОбластьИтоговыеПоказатели <> Неопределено Тогда
			
			ОбластьИтоговыеПоказателиВерх = ОбластьИтоговыеПоказатели.Верх;
			ОбластьИтоговыеПоказателиНиз = ОбластьИтоговыеПоказатели.Низ;
			
			Для Каждого Обл Из ТаблДок.Области Цикл
				
				Если Обл.ГраницаСлева = Неопределено
					ИЛИ СтрНайти(Обл.Имя, "П0") = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если Обл.Верх >= ОбластьИтоговыеПоказателиВерх
					И Обл.Низ <= ОбластьИтоговыеПоказателиНиз
					И Обл.ГраницаСлева.ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.Точечная Тогда
					
					Если Обл.СодержитЗначение = Истина Тогда // возможны 3 состояния
						Обл.Значение = "-";
					Иначе
						Обл.Текст = "-";
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеМЧБ(Область)
	
	ТипЗначения = ТипЗнч(Область.Значение);
	Если ТипЗначения = Тип("Число") Тогда
		ФорматОбласти = Область.Формат;
		СоотвСтрокаФормата = РазобратьСтрокуФормата(ФорматОбласти);
		СоотвСтрокаФормата.Вставить("ЧРД", ".");
		СоотвСтрокаФормата.Вставить("ЧГ", "");
		Результат = Формат(Область.Значение, СобратьСтрокуФормата(СоотвСтрокаФормата));
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		Результат = СокрЛП(Область.Значение);
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Результат = Формат(Область.Значение, ?(ПустаяСтрока(Область.Формат), "ДФ=ddMMyyyy", Область.Формат));
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Результат = Формат(Область.Значение, Область.Формат);
	КонецЕсли;
	Возврат СокрЛП(Результат);
	
КонецФункции

&НаСервере
Функция АдресЗначенияОбласти(Область)
	
	Имя = Область.Имя;
	КореньИмениОбласти = Неопределено;
	СтрИндексЗнакоместа = "";
	ИндексЗнакоместа = 0;
	ДлинаИмени = СтрДлина(Имя);
	Для ИндексВхождения = 1 По ДлинаИмени Цикл
		СтрИндексЗнакоместа = Сред(Имя, ДлинаИмени - ИндексВхождения + 1);
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрИндексЗнакоместа) Тогда
			КореньИмениОбласти = Лев(Имя, ДлинаИмени - ИндексВхождения);
			ИндексЗнакоместа = Число(СтрИндексЗнакоместа);
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Прав(КореньИмениОбласти, 1) = "_" Тогда
		КореньИмениОбласти = Лев(КореньИмениОбласти, СтрДлина(КореньИмениОбласти) - 1);
	КонецЕсли;
		
	Возврат Новый Структура("Корень, ИндексЗнакоместа", КореньИмениОбласти, ИндексЗнакоместа);
	
КонецФункции

&НаСервере
Процедура ПрисвоитьЗначениеОбласти(Область, Знач Значение, ИндексЗнакоместа = 0, ДополнятьСправа_ = Истина)
	
	Если ИндексЗнакоместа <> 0 Тогда
		Если СтрДлина(Значение) >= ИндексЗнакоместа Тогда
			Значение = Сред(Значение, ИндексЗнакоместа, 1);
		Иначе
			Значение = ?(ДополнятьСправа_, "-", "");
		КонецЕсли;
	ИначеЕсли НЕ ЗначениеЗаполнено(Значение) Тогда
		Значение = "-";
	КонецЕсли;
	
	Если Область.СодержитЗначение = Истина Тогда
		Область.Значение = ВРЕГ(Значение);
	Иначе
		Область.Текст = ВРЕГ(Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РазобратьСтрокуФормата(Знач СтрокаФормата)
	
	ЗначенияПараметров = Новый Соответствие;
	Пока СтрНайти(СтрокаФормата, ";") <> 0 Цикл
		ВхождениеРазделителя = СтрНайти(СтрокаФормата, ";");
		ДоРазделителя = Лев(СтрокаФормата, ВхождениеРазделителя - 1);
		ВхождениеРавно = СтрНайти(ДоРазделителя, "=");
		Если ВхождениеРавно <> 0 И ВхождениеРавно <> 1 Тогда
			ЗначенияПараметров.Вставить(Лев(ДоРазделителя, ВхождениеРавно - 1), Сред(ДоРазделителя, ВхождениеРавно + 1));
		КонецЕсли;
		СтрокаФормата = Сред(СтрокаФормата, ВхождениеРазделителя + 1);
	КонецЦикла;
	ВхождениеРавно = СтрНайти(СтрокаФормата, "=");
	Если ВхождениеРавно <> 0 И ВхождениеРавно <> 1 Тогда
		ЗначенияПараметров.Вставить(Лев(СтрокаФормата, ВхождениеРавно - 1), Сред(СтрокаФормата, ВхождениеРавно + 1));
	КонецЕсли;
	Возврат ЗначенияПараметров;
	
КонецФункции

&НаСервере
Функция СобратьСтрокуФормата(ПараметрыФормата)
	
	СтрокаФормата = "";
	Для Каждого Параметр Из ПараметрыФормата Цикл
		СтрокаФормата = СтрокаФормата + "; " + Параметр.Ключ + "=" + Параметр.Значение;
	КонецЦикла;
	Если НЕ ПустаяСтрока(СтрокаФормата) Тогда
		СтрокаФормата = Сред(СтрокаФормата, 3);
	КонецЕсли;
	Возврат СтрокаФормата;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СтрНайти(Заголовок, СтруктураРеквизитовФормы.СтрПериодОтчета) = 0 Тогда
		Заголовок = Заголовок + " за " + СтруктураРеквизитовФормы.СтрПериодОтчета;
	КонецЕсли;
	
	ОргСтр = " (" + СтруктураРеквизитовФормы.НаимОрганизации + ")";
	Если СтрНайти(Заголовок, ОргСтр) = 0 Тогда
		Заголовок = Заголовок + ОргСтр;
	КонецЕсли;
	
	УстановитьДоступностьПризнакаАктуальностиРанееОтправленныхСведений();
	
	Заголовок = Заголовок + ?(СтрНайти(ЭтаФорма.ИмяФормы, "Внешний") > 0, " - внешний отчет", "");
	
	ПодключитьОбработчикОжидания("ВыполнитьПроверкуПередОткрытием", 0.1, Истина);
	
	ВывестиРезультатПроверки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуПередОткрытием()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект);
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередОткрытиемФормыРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Модифицированность = Ложь;
		Закрыть();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПолейПоУмолчанию()
	
	Если СтруктураДанныхРаздел1.Свойство("П000100002003") Тогда
		Если НЕ ЗначениеЗаполнено(СтруктураДанныхРаздел1.П000100002003) Тогда
			СтруктураДанныхРаздел1.Вставить("П000100002003", "18210301000011000110");
		КонецЕсли;
	Иначе
		СтруктураДанныхРаздел1.Вставить("П000100002003", "18210301000011000110");
	КонецЕсли;
	
	Если НЕ СтруктураДанныхРаздел1.Свойство("П000100003003") Тогда
		СтруктураДанныхРаздел1.Вставить("П000100003003", 0);
	КонецЕсли;
	
	Если НЕ СтруктураДанныхРаздел1.Свойство("П000100004003") Тогда
		СтруктураДанныхРаздел1.Вставить("П000100004003", 0);
	КонецЕсли;
	
	Если НЕ СтруктураДанныхРаздел1.Свойство("П000100005003") Тогда
		СтруктураДанныхРаздел1.Вставить("П000100005003", 0);
	КонецЕсли;
	
	Если НЕ СтруктураДанныхРаздел1.Свойство("П000100006003") Тогда
		СтруктураДанныхРаздел1.Вставить("П000100006003", "");
	КонецЕсли;
	
	Если НЕ СтруктураДанныхРаздел1.Свойство("П000100007003") Тогда
		СтруктураДанныхРаздел1.Вставить("П000100007003", "");
	КонецЕсли;
	
	Если НЕ СтруктураДанныхРаздел1.Свойство("П000100008003") Тогда
		СтруктураДанныхРаздел1.Вставить("П000100008003", "");
	КонецЕсли;
	
	Для Каждого СтраницаРаздела2 Из ТаблицаСтраницыРаздела2 Цикл
		
		Если СтраницаРаздела2.Данные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ПоказательСтраницыРаздела2 Из СтраницаРаздела2.Данные[0].Значение Цикл
			
			Если НЕ ПоказательСтраницыРаздела2.Ключ = "П000200005003"
				И ЗначениеЗаполнено(ПоказательСтраницыРаздела2.Значение) Тогда
				
				СтраницаРаздела2.Данные[0].Значение.Вставить("П000200004003", "18210301000011000110");
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗапретитьВводДанныхВОбласть(мСтруктураЦветовРаскраски, ОбрабатываемаяОбласть)
	
	ЦветНедоступнойОбласти = мСтруктураЦветовРаскраски["_5"];
	
	ОбрабатываемаяОбласть.Защита   = Истина;
	ОбрабатываемаяОбласть.ЦветФона = ЦветНедоступнойОбласти;
	
	ТипЗначенияОбласти = ТипЗнч(ОбрабатываемаяОбласть.Значение);
	Если ТипЗначенияОбласти = Тип("Число") Тогда
		ОбрабатываемаяОбласть.Значение = 0;
	ИначеЕсли ТипЗначенияОбласти = Тип("Строка") Тогда
		ОбрабатываемаяОбласть.Значение = "";
	Иначе
		ОбрабатываемаяОбласть.Значение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РазрешитьВводДанныхВОбласть(мСтруктураЦветовРаскраски, ОбрабатываемаяОбласть)
	
	ЦветОбластиРучногоВвода = мСтруктураЦветовРаскраски["_0"];
	
	ОбрабатываемаяОбласть.Защита   = Ложь;
	ОбрабатываемаяОбласть.ЦветФона = ЦветОбластиРучногоВвода;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьОбластей(Форма, ИмяТекРаздела)
	
	Если ИмяТекРаздела = "Титульный" Тогда
		
		Если РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация()
		 ИЛИ Форма.СтруктураРеквизитовФормы.ОтчетСформированОбработкойКонсолидацияОтчетностиПоНДС Тогда	
			
			ОрганизацияДляЗаполнения = Форма.ТабличныйДокумент.Области.ОрганизацииДляЗаполненияОтчета;
			ОрганизацияДляЗаполнения.Гиперссылка = Ложь;
			ОрганизацияДляЗаполнения.Текст = "";
			
		КонецЕсли;
		
		ОпределяющаяОбласть = Форма.ТабличныйДокумент.Области.КодФормыРеорганизации;
		
		ОбрабатываемаяОбласть1 = Форма.ТабличныйДокумент.Области.ИННРеорганизованнойОрганизации;
		ОбрабатываемаяОбласть2 = Форма.ТабличныйДокумент.Области.КППРеорганизованнойОрганизации;
		
		Если ПустаяСтрока(ОпределяющаяОбласть.Значение)
			ИЛИ ОпределяющаяОбласть.Значение = "0" Тогда
			
			ЗапретитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски, ОбрабатываемаяОбласть1);
			ЗапретитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски, ОбрабатываемаяОбласть2);
			
		Иначе
			
			РазрешитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски, ОбрабатываемаяОбласть1);
			РазрешитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски, ОбрабатываемаяОбласть2);
			
		КонецЕсли;
		
	ИначеЕсли ИмяТекРаздела = "Раздел1" Тогда
		
		Если Форма.СтруктураДанныхТитульный.ПоМесту = "227" Тогда
			
			РазрешитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски, Форма.ТабличныйДокумент.Области.П000100006003);
			РазрешитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски, Форма.ТабличныйДокумент.Области.П000100007003);
			РазрешитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски, Форма.ТабличныйДокумент.Области.П000100008003);
			
		Иначе
			
			ЗапретитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски, Форма.ТабличныйДокумент.Области.П000100006003);
			ЗапретитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски, Форма.ТабличныйДокумент.Области.П000100007003);
			ЗапретитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски, Форма.ТабличныйДокумент.Области.П000100008003);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаРегламентированногоОтчетаНаСервере(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийРаздел") > 0 Тогда
		
		Если (Многостраничность) И (КолВоСтраницВРазделе > 1) Тогда
			ОчиститьПоказателиОтчетаЗаполняемыеИзИБНаСервере(ИмяСтраницы);
			РегламентированнаяОтчетность.ПолучитьСведенияОПоказателяхОтчета(ЭтаФорма);
			УдалятьсяВсеДопЭкземпляры = Истина;
		Иначе
			ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
		КонецЕсли;
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(
		ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
		СформироватьДеревоРазделовОтчетаНаСервере();
		
	ИначеЕсли СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
		
		Если ИмяСтраницы = "Раздел5" Тогда
			РегламентированнаяОтчетностьКлиентСервер.СохранитьДанныеМногостраничногоРазделаВактивнойСтранице(ЭтаФорма, ИмяСтраницы, Ложь);
		КонецЕсли;
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(
		ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
	Если ИмяСтраницы = "Титульный" Тогда
		Если Элементы.Найти("ДатаПодписи") = Неопределено Тогда
			Область = ТабличныйДокумент.Области.Найти("ДатаПодписи");
			Если НЕ Область = Неопределено Тогда
				Если ТипЗнч(Область.Значение) = Тип("Строка") Тогда
					ДатаПодписи = Лев(СтрЗаменить(Область.Значение, ".", ""), 8);
				ИначеЕсли ТипЗнч(Область.Значение) = Тип("Дата") Тогда
					Если ЗначениеЗаполнено(Область.Значение) Тогда
						ДатаПодписи = Лев(СтрЗаменить(Формат(Область.Значение, "ДФ = ""дд.ММ.гггг 'г.'"""), ".", ""), 8);
					Иначе
						ДатаПодписи = "        ";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаРегламентированногоОтчетаНаКлиенте(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийРаздел") > 0 Тогда
		
		Если (Многостраничность) И (КолВоСтраницВРазделе > 1) Тогда
			РегламентированнаяОтчетностьКлиентСервер.ОчиститьПоказателиОтчетаЗаполняемыеИзИБ(ЭтаФорма, ИмяСтраницы);
			УдалятьсяВсеДопЭкземпляры = Истина;
		Иначе
			ОчиститьТабличноеПолеНаКлиенте(ИмяСтраницы);
		КонецЕсли;
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(
		ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
	ИначеЕсли СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаКлиенте(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(
		ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвто(Команда) Экспорт
	
	Отказ = Ложь;
	
	РегламентированнаяОтчетностьКлиентПереопределяемый.ПроверитьВозможностьАвтоЗаполненияРеглОтчета(ИмяФормы, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ АвтоЗаполнениеРеглОтчетаДоступно()
		ИЛИ СтруктураРеквизитовФормы.СтатусОтчета = "Сдано" Тогда
		
		ПоказатьПредупреждение(, НСтр("ka='Декларация по НДС сдана. Автоматическое заполнение запрещено."
"Для подготовки уточненной декларации создайте новый отчет.';ru='Декларация по НДС сдана. Автоматическое заполнение запрещено."
"Для подготовки уточненной декларации создайте новый отчет.'"));
		Возврат;
		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоПредупредитьОСохранении", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗаполнениемРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаСервере
Функция АвтоЗаполнениеРеглОтчетаДоступно()
	
	СтруктураРеквизитовФормы.АвтоЗаполнениеРеглОтчетаДоступно
	= (НЕ СведенияПоОтправкам.СтатусОтправкиРеглОтчета(СтруктураРеквизитовФормы.мСохраненныйДок)
	= Перечисления.СтатусыОтправки.Сдан);
	
	Возврат СтруктураРеквизитовФормы.АвтоЗаполнениеРеглОтчетаДоступно;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьАвтоПредупредитьОСохранении(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоСохранениеОтчета", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ka='Автоматическое заполнение приведет к сохранению отчета с новыми данными. Заполнить отчет?';ru='Автоматическое заполнение приведет к сохранению отчета с новыми данными. Заполнить отчет?'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Заполнить", "Заполнить и сохранить");
	Кнопки.Добавить("НеЗаполнять", "Не заполнять");
	
	КнопкаПоУмолчанию = "НеЗаполнять";
	
	ЗаголовокВопроса = НСтр("ka='Автоматическое заполнение отчета';ru='Автоматическое заполнение отчета'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КнопкаПоУмолчанию, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоСохранениеОтчета(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя <> "Заполнить" Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
	"ЗаполнитьАвтоПослеСохранениеОтчета", ЭтотОбъект, ДополнительныеПараметры);
	
	СохранитьНаКлиенте(,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПослеСохранениеОтчета(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаданиеВыполнено = ЗаполнитьАвтоНаСервере();
	
	Если ЗаданиеВыполнено Тогда
		СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
		
		РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
		
		Если НЕ Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
			Элементы.РазделыОтчета.ТекущаяСтрока
			= Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы()[0].ПолучитьИдентификатор();
		КонецЕсли;
		
		Если Элементы.Расшифровать.Видимость Тогда
			Элементы.Расшифровать.Доступность = Истина;
			Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Доступность = Истина;
		КонецЕсли;
		
		ЗапуститьПроверки();
		
	Иначе
		
		ПараметрыОбработчикаОжидания = Новый Структура;
		ПараметрыОбработчикаОжидания.Вставить("МинимальныйИнтервал", 1);
		ПараметрыОбработчикаОжидания.Вставить("МаксимальныйИнтервал", 15);
		ПараметрыОбработчикаОжидания.Вставить("ТекущийИнтервал", 1);
		ПараметрыОбработчикаОжидания.Вставить("КоэффициентУвеличенияИнтервала", 1.4);
		
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		
		ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация", Новый Структура("ИдентификаторЗадания", СтруктураРеквизитовФормы.ИдентификаторЗадания), ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьАвтоНаСервере()
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь);
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	СтруктураРеквизитовФормы.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	НомерКорректировки = СтруктураДанныхТитульный.НомерКорректировки;
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",              СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("ГруппаОрганизаций",        СтруктураРеквизитовФормы.ГруппаОрганизаций);
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета", СтруктураРеквизитовФормы.ДатаНачалаАвтозаполнения);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета",  СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("ВидДокумента",             ?(НомерКорректировки = 0, 0, 1));
	ПараметрыОтчета.Вставить("НомерКорректировки",       НомерКорректировки);
	ПараметрыОтчета.Вставить("ДатаПодписи",              ДатаПодписи);
	ПараметрыОтчета.Вставить("УникальныйИдентификаторФормы", ЭтаФорма.УникальныйИдентификатор);
	ПараметрыОтчета.Вставить("АдресВоВременномХранилище", СтруктураРеквизитовФормы.АдресВоВременномХранилище);
	ПараметрыОтчета.Вставить("АдресВременногоХранилищаРасшифровки", СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки);
	ПараметрыОтчета.Вставить("Декларация", СтруктураРеквизитовФормы.мСохраненныйДок);
	
	Контейнер = Новый Структура();
	Контейнер.Вставить("Раздел1", СтруктураДанныхРаздел1);
	Контейнер.Вставить("Раздел2", СведенияМногостраничногоРазделаВТаблице("ТаблицаСтраницыРаздела2"));
	Контейнер.Вставить("Раздел3", СтруктураДанныхРаздел3);
	Контейнер.Вставить("Раздел3_Прил1", СведенияМногостраничногоРазделаВТаблице("ТаблицаСтраницыРаздела3_Прил1"));
	Контейнер.Вставить("Раздел3_Прил2", СтруктураДанныхРаздел3_Прил2);
	Контейнер.Вставить("Раздел3_Прил2_ДанныеДопСтрок", ДанныеФормыВЗначение(П0003200001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Раздел4", СтруктураДанныхРаздел4);
	Контейнер.Вставить("Раздел4_ДанныеДопСтрок010_050", ДанныеФормыВЗначение(П0004М100, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Раздел4_ДанныеДопСтрок060_080", ДанныеФормыВЗначение(П0004М200, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Раздел4_ДанныеДопСтрок090_110", ДанныеФормыВЗначение(П0004М300, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Раздел5", СведенияМногостраничногоРазделаВТаблице("ТаблицаСтраницыРаздела5"));
	Контейнер.Вставить("Раздел5_ДанныеДопСтрок", ДанныеФормыВЗначение(П00050000, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Раздел6", СтруктураДанныхРаздел6);
	Контейнер.Вставить("Раздел6_ДанныеДопСтрок010_040", ДанныеФормыВЗначение(П0006М100, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Раздел6_ДанныеДопСтрок070_100", ДанныеФормыВЗначение(П0006М200, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Раздел6_ДанныеДопСтрок110_150", ДанныеФормыВЗначение(П0006М300, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Раздел7", СтруктураДанныхРаздел7);
	Контейнер.Вставить("Раздел7_ДанныеДопСтрок", ДанныеФормыВЗначение(П0007000001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Раздел8", Новый Структура);
	Контейнер.Вставить("Раздел8_Прил1", Новый Структура);
	Контейнер.Вставить("Раздел9", Новый Структура);
	Контейнер.Вставить("Раздел9_Прил1", Новый Структура);
	Контейнер.Вставить("Раздел10", Новый Структура);
	Контейнер.Вставить("Раздел11", Новый Структура);
	Контейнер.Вставить("Раздел12", Новый Структура);
	
	Контейнер.Вставить("ДополнительныеСведения", Новый Структура("П000100001003", СтруктураДанныхРаздел1.П000100001003));
	
	ЗаданиеВыполнено = Ложь;
	
	НаименованиеЗадания = НСтр("ka='Автоматическое заполнение по данным информационной базы';ru='Автоматическое заполнение по данным информационной базы'");
	
	ПараметрыЗаполнения = Новый Массив;
	ПараметрыЗаполнения.Добавить(Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7));
	ПараметрыЗаполнения.Добавить(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") + 7));
	ПараметрыЗаполнения.Добавить(ПараметрыОтчета);
	ПараметрыЗаполнения.Добавить(Контейнер);
	
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания = 4;
	Иначе
		ВремяОжидания = 2;
	КонецЕсли;
	
	Задание = ФоновыеЗадания.Выполнить("РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет", ПараметрыЗаполнения, , НаименованиеЗадания);
	
	Попытка
		Задание.ОжидатьЗавершения(ВремяОжидания);
	Исключение
		// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	КонецПопытки;
	
	СтруктураРеквизитовФормы.ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	
	// Если операция уже завершилась, то сразу обрабатываем результат.
	Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда
		
		ЗаданиеВыполнено = Истина;
		
		ЗагрузитьПодготовленныеДанные();
		
	КонецЕсли;
	
	Возврат ЗаданиеВыполнено;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Истина;
	СтруктураРеквизитовФормы.АвтозаполнениеРазделовВТекущейСессии = НовыйНаборПризнаковАвтозаполнения(Истина);
	
	Контейнер = ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы.АдресВоВременномХранилище);
	
	Если ТипЗнч(Контейнер) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из Контейнер Цикл
		ИмяЭлемента = ЭлементСтруктуры.Ключ;
		
		Если ИмяЭлемента = "Раздел8"
		 ИЛИ ИмяЭлемента = "Раздел8_Прил1"
		 ИЛИ ИмяЭлемента = "Раздел9"
		 ИЛИ ИмяЭлемента = "Раздел9_Прил1"
		 ИЛИ ИмяЭлемента = "Раздел10"
		 ИЛИ ИмяЭлемента = "Раздел11"
		 ИЛИ ИмяЭлемента = "Раздел12" Тогда
			ЗаполнитьСведенияНДС(Контейнер, ИмяЭлемента);
			
		ИначеЕсли мСтруктураМногостраничныхРазделов.Свойство(ИмяЭлемента) Тогда
			ВосстановитьМногостраничныйРазделИзТаблицы(ИмяЭлемента, ЭлементСтруктуры.Значение);
			
		ИначеЕсли ИмяЭлемента = "Раздел3_Прил2_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0003200001);
			
		ИначеЕсли ИмяЭлемента = "Раздел4_ДанныеДопСтрок010_050" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0004М100);
			
		ИначеЕсли ИмяЭлемента = "Раздел4_ДанныеДопСтрок060_080" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0004М200);
			
		ИначеЕсли ИмяЭлемента = "Раздел4_ДанныеДопСтрок090_110" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0004М300);
			
		ИначеЕсли ИмяЭлемента = "Раздел5_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П00050000);
			
		ИначеЕсли ИмяЭлемента = "Раздел6_ДанныеДопСтрок010_040" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0006М100);
			
		ИначеЕсли ИмяЭлемента = "Раздел6_ДанныеДопСтрок070_100" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0006М200);
			
		ИначеЕсли ИмяЭлемента = "Раздел6_ДанныеДопСтрок110_150" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0006М300);
			
		ИначеЕсли ИмяЭлемента = "Раздел7_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0007000001);
			
		ИначеЕсли ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма["СтруктураДанных" + ИмяЭлемента]);
			
		ИначеЕсли ИмяЭлемента = "ДополнительныеСведения" Тогда
			ОКТМО = СОКРЛП(ЭлементСтруктуры.Значение.П000100001003);
			ЗаполнитьОКТМО(ЭтаФорма, СокрЛП(ОКТМО));
			
		Иначе
			ЭтаФорма["СтруктураДанных" + ИмяЭлемента] = ЭлементСтруктуры.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьЗначенияПолейПоУмолчанию();
	
	ВывестиМакетВТаблДокНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела, 1);
	
	РасчетНаСервере();
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Раздел2" Тогда
		
		ТабличныйДокумент.Области.П000200006003.Защита = Ложь;
		
		ИзменитьЦветЯчеекНаСервере();
		
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Если НЕ ЗначениеЗаполнено(СтруктураДанныхТитульный.НомерКорректировки) Тогда
		ЗначениеКорректировки = 0;
	Иначе
		ТипЧисло = Новый ОписаниеТипов("Число");
		ЗначениеКорректировки = ТипЧисло.ПривестиЗначение(СтруктураДанныхТитульный.НомерКорректировки);
	КонецЕсли;
	
	КодИФНС = СтруктураДанныхТитульный.КодИМНС;
	КПП = СтруктураДанныхТитульный.КПП1;
	Вариант = СтруктураРеквизитовФормы.ВидДокумента * ЗначениеКорректировки;
	НаименованиеТекущегоРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	
	Сохранить( , КодИФНС, КПП, Вариант, , НаименованиеТекущегоРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		
		Если ПроверитьВыполнениеЗадания() Тогда 
			
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			
			СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
			
			РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
			
			Если НЕ Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы()[0].ПолучитьИдентификатор();
			КонецЕсли;
			
			Если Элементы.Расшифровать.Видимость Тогда
				Элементы.Расшифровать.Доступность = Истина;
				Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Доступность = Истина;
			КонецЕсли;
			
			ЗапуститьПроверки();
			
			Возврат;
			
		КонецЕсли;
		
	Исключение
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
		
	КонецПопытки;
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВыполнениеЗадания()
	
	Если ДлительныеОперации.ЗаданиеВыполнено(СтруктураРеквизитовФормы.ИдентификаторЗадания) Тогда
		ЗагрузитьПодготовленныеДанные();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Расшифровать(Команда)
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация", СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("ДатаНачалаПериодаОтчета", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("ДатаКонцаПериодаОтчета", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("НомерТекущейСтраницы", СтруктураРеквизитовФормы.НомерТекущейСтраницы);
	ПараметрыОтчета.Вставить("АдресВременногоХранилищаРасшифровки", СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки);
	ПараметрыОтчета.Вставить("ГруппаОрганизаций", СтруктураРеквизитовФормы.ГруппаОрганизаций);
	
	ИДИменПоказателей = Новый Массив();
	ИДИменПоказателей.Добавить(Элементы.ТабличныйДокумент.ТекущаяОбласть.Имя);
	
	РегламентированнаяОтчетностьКлиент.ОткрытьРасшифровкуОтчета(
	Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7),
	Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") + 7), ИДИменПоказателей, ПараметрыОтчета)
	
КонецПроцедуры

&НаСервере
Функция АдресПоказателя(СтрокаПоказателя)
	
	Результат = СтрокаПоказателя.Код;
	
	СтрокаВерхнегоУровня = СтрокаПоказателя.Родитель;
	
	Пока ЗначениеЗаполнено(СтрокаВерхнегоУровня) Цикл
		Результат = СтрокаВерхнегоУровня.Код + "\" + Результат;
		СтрокаВерхнегоУровня = СтрокаВерхнегоУровня.Родитель;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьОКТМО(Форма, Знач ОКТМО)
	
	ПроставитьНаВсехЛистах(Форма, ОКТМО);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПроставитьНаВсехЛистах(Форма, Знач ЗначениеПоказателя)
	
	ТипЗначенияПоказателя = ТипЗнч(ЗначениеПоказателя);
	
	Если ТипЗначенияПоказателя = Тип("Число") Тогда
		ЗначениеПоказателя = Формат(ЗначениеПоказателя, "ЧГ=");
	КонецЕсли;
	
	Форма.СтруктураДанныхРаздел1.Вставить("П000100001003", ЗначениеПоказателя);
	
	Для Каждого СтраницаРаздела Из Форма.ТаблицаСтраницыРаздела2 Цикл
		
		ДанныеСтраницы = СтраницаРаздела.Данные;
		
		Если ДанныеСтраницы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСтраницы[0].Значение.Вставить("П000200005003", ЗначениеПоказателя);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПользовательскиеНастройки()
	
	Сообщение = Новый СообщениеПользователю;
	
	Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='Изменилась версия формы отчета.%1Выполняется обновление пользовательских настроек.';ru='Изменилась версия формы отчета.%1Выполняется обновление пользовательских настроек.'"), Символы.ПС);
	
	Сообщение.Сообщить();
	
	ЕстьИзмененияВариантыЗаполнения = ОбновитьВариантыЗаполнения();
	
	Если ЕстьИзмененияВариантыЗаполнения Тогда
		
		// Если были изменения в пользовательских настройках,
		// то устанавливаем флаг модифицированности формы.
		Модифицированность = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='Обновление пользовательских настроек успешно завершено!';ru='Обновление пользовательских настроек успешно завершено!'");
		Сообщение.Сообщить();
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='Изменения в структуре пользовательских настроек не обнаружены!';ru='Изменения в структуре пользовательских настроек не обнаружены!'");
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьВариантыЗаполнения()
	
	Перем МассивВариантовЗаполненияСтраниц;
	
	ЕстьИзменения = Ложь;
	
	МакетСоставаПоказателей = ОбъектОтчета(ЭтаФорма.ИмяФормы).ПолучитьМакет(СтруктураРеквизитовФормы.мСоставПоказателей);
	
	ОписаниеТиповЧисло1 = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1));
	
	ОписаниеТиповСтрока15  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(15));
	ОписаниеТиповСтрока50  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100));
	
	Для Каждого ОбластьОтчета Из МакетСоставаПоказателей.Области Цикл
		
		ИмяСтраницы = ОбластьОтчета.Имя;
		
		ТаблицаВариантыЗаполнения = Новый ТаблицаЗначений;
		ТаблицаВариантыЗаполнения.Колонки.Добавить("КодПоказателя",            ОписаниеТиповСтрока50);
		ТаблицаВариантыЗаполнения.Колонки.Добавить("ВариантЗаполнения",        ОписаниеТиповЧисло1);
		ТаблицаВариантыЗаполнения.Колонки.Добавить("ЗначениеАвто",             СтруктураРеквизитовФормы.мОписаниеТиповЧислоЕ);
		ТаблицаВариантыЗаполнения.Колонки.Добавить("Дельта",                   СтруктураРеквизитовФормы.мОписаниеТиповЧислоЕ);
		ТаблицаВариантыЗаполнения.Колонки.Добавить("Комментарий",              ОписаниеТиповСтрока100);
		ТаблицаВариантыЗаполнения.Колонки.Добавить("КодПоказателяПоСтруктуре", ОписаниеТиповСтрока50);
		
		Для Ном = ОбластьОтчета.Верх По ОбластьОтчета.Низ Цикл
			// Код показателя (по составу показателей) определяется по первой колонке макета.
			КодПоказателя = СокрП(МакетСоставаПоказателей.Область(Ном, 1).Текст);
			ИмяПоказателя = КодПоказателя;
			
			Если КодПоказателя = "===" Тогда
				Прервать; // конечная строка
			КонецЕсли;
			
			Если Лев(КодПоказателя, 2) = "//" Тогда
				Продолжить; // комментарий
			КонецЕсли;
			
			// Код показателя по форме отчете (имя ячейки в полях табличного документа формы).
			КодПоказателяПоФорме = СокрЛП(МакетСоставаПоказателей.Область(Ном, 2).Текст);
			// Вариант заполнения ячейки определяется по колонке 6 макета.
			стрВариантЗаполнения = РегламентированнаяОтчетность.ПолучитьВариантЗаполненияПоказателяРегОтчета(МакетСоставаПоказателей, Ном);
			
			чВариантЗаполнения = ? (ПустаяСтрока(стрВариантЗаполнения), 0, Число(стрВариантЗаполнения));
			Если чВариантЗаполнения <> 0 Тогда
				НоваяСтрока = ТаблицаВариантыЗаполнения.Добавить();
				НоваяСтрока.КодПоказателя      = ? (Не ПустаяСтрока(КодПоказателяПоФорме), КодПоказателяПоФорме, КодПоказателя);
				НоваяСтрока.ВариантЗаполнения  = чВариантЗаполнения;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ мСтруктураВариантыЗаполнения.Свойство(ИмяСтраницы, МассивВариантовЗаполненияСтраниц) Тогда
			
			МассивВариантовЗаполненияСтраниц = ЭтаФорма["ТаблицаВариантыЗаполнения" + ИмяСтраницы];
			
			Если ТаблицаВариантыЗаполнения.Количество() > 0 Тогда
				
				МассивВариантовЗаполненияСтраниц.Очистить();
				МассивВариантовЗаполненияСтраниц.Добавить(ТаблицаВариантыЗаполнения);
				
				мСтруктураВариантыЗаполнения.Вставить(ИмяСтраницы, ИмяСтраницы);
				
				ЕстьИзменения = Истина;
				
			КонецЕсли;
		Иначе
			
			МассивВариантовЗаполненияСтраниц = ЭтаФорма["ТаблицаВариантыЗаполнения" + ИмяСтраницы];
			
			Если ТаблицаВариантыЗаполнения.Количество() = 0 Тогда
				
				мСтруктураВариантыЗаполнения.Удалить(ИмяСтраницы);
				
				ЕстьИзменения = Истина;
				
			Иначе
				// Актуализация вариантов автозаполнения текущей страницы.
				Для Каждого ЭлементМассива Из МассивВариантовЗаполненияСтраниц Цикл
					
					ЭлементМассива = ЭлементМассива.ТаблицаВариантовЗаполнения;
					
					Для каждого СтрокаТаблицы Из ТаблицаВариантыЗаполнения Цикл
						КодПоказателя     = СтрокаТаблицы.КодПоказателя;
						ВариантЗаполнения = СтрокаТаблицы.ВариантЗаполнения;
						
						ДействующийВариантАвтозаполнения = Неопределено;
						
						НайденныеСтроки = ЭлементМассива.НайтиСтроки(Новый Структура("КодПоказателя", КодПоказателя));
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ДействующийВариантАвтозаполнения = НайденныеСтроки[0];
						КонецЕсли;
						
						Если ДействующийВариантАвтозаполнения = Неопределено Тогда
							// Новый автозаполняемый показатель.
							НоваяСтрока = ЭлементМассива.Добавить();
							НоваяСтрока.КодПоказателя     = КодПоказателя;
							НоваяСтрока.ВариантЗаполнения = ВариантЗаполнения;
							
							ЕстьИзменения = Истина;
							
						Иначе
							// Показатель должен соответствовать эталону, кроме удовлетворяющих следующим критериям:
							// - вариант эталона не 4 (авторасчет)и не 5 (запрет ввода значения);
							// - действующий вариант допускает корректировку (варианты 1-3).
							ИспользоватьДействующийВариант = ((ДействующийВариантАвтозаполнения.ВариантЗаполнения = 1
							ИЛИ ДействующийВариантАвтозаполнения.ВариантЗаполнения = 2
							ИЛИ ДействующийВариантАвтозаполнения.ВариантЗаполнения = 3)
							И (ВариантЗаполнения <> 4) И (ВариантЗаполнения <> 4));
							Если Не ИспользоватьДействующийВариант Тогда
								ДействующийВариантАвтозаполнения.КодПоказателя     = КодПоказателя;
								ДействующийВариантАвтозаполнения.ВариантЗаполнения = ВариантЗаполнения;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					ТаблДляЦикла = ЭлементМассива.Выгрузить();
					
					Для Каждого СтрокаТаблицы Из ТаблДляЦикла Цикл
						КодПоказателя = СтрокаТаблицы.КодПоказателя;
						
						Если ТаблицаВариантыЗаполнения.Найти(КодПоказателя, "КодПоказателя") = Неопределено Тогда
							// В новой версии отчета автозаполнение показателя не предусмотрено.
							СтрокиВЭлементеМассива = ЭлементМассива.НайтиСтроки(Новый Структура("КодПоказателя", КодПоказателя));
							Если СтрокиВЭлементеМассива.Количество() > 0 Тогда
								ЭлементМассива.Удалить(СтрокиВЭлементеМассива[0]);
								
								ЕстьИзменения = Истина;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЕстьИзменения;
	
КонецФункции

&НаКлиенте
Процедура НастроитьПериодЗаполнения(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("НачалоПериода", СтруктураРеквизитовФормы.ДатаНачалаАвтозаполнения);
	ПараметрыФормы.Вставить("КонецПериода",  СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыФормы.Вставить("ИмяЭлемента",   "НастроитьПериодАвтозаполнения");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьПериодЗаполненияЗавершение", ЭтотОбъект);
	
	ПараметрыФормы.Вставить("ИмяЭлемента", "НастроитьПериодАвтозаполнения");
	ОткрытьФорму("Отчет.РегламентированныйОтчетНДС.Форма.ВыборПериодаАвтозаполнения",
	ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПериодЗаполненияЗавершение(Результат, ДопПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) 
		ИЛИ ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Результат.Свойство("НачалоПериода")
		ИЛИ НЕ Результат.Свойство("КонецПериода")
		ИЛИ НЕ Результат.Свойство("ИмяЭлемента") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ИмяЭлемента = "НастроитьПериодАвтозаполнения" Тогда
		СтруктураРеквизитовФормы.ДатаНачалаАвтозаполнения = Результат.НачалоПериода;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ СТЫКОВКИ С СЕРВИСОМ СДАЧИ ОТЧЕТНОСТИ ЧЕРЕЗ ПРЕДСТАВИТЕЛЯ

&НаКлиенте
Процедура ОтправитьЧерезПредставителя(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьЧерезПредставителяЗавершение", ЭтотОбъект);
	
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧерезПредставителяЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПриНажатииНаКнопкуОтправкиЧерезПредставителяВРегламентированномОтчете(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВИнтернете(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьВИнтернетеЗавершение", ЭтотОбъект);
	
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВИнтернетеЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПроверитьВИнтернете(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеТаймера()
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	ВыполнятьЗамерыПроизводительности = ОбщегоНазначения.ОбщийМодуль("ОценкаПроизводительностиВызовСервераПовтИсп").ВыполнятьЗамерыПроизводительности();
		
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОценкаПроизводительности") 
		И ВыполнятьЗамерыПроизводительности Тогда
		
		Возврат ОценкаПроизводительности.НачатьЗамерВремени();
		
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ОценкаПроизводительности
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьЗамер(ВремяНачала)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ВремяНачала <> Неопределено И ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОценкаПроизводительности") Тогда
		
		КлючеваяОперация = "ЗаполнениеФормыРеглОтчетаНДС";
		ОбщегоНазначения.ОбщийМодуль("ОценкаПроизводительности").ЗакончитьЗамерВремени(КлючеваяОперация, ВремяНачала);
		
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ОценкаПроизводительности
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОРИСОВКА И КОМАНДЫ ПАНЕЛИ ОТПРАВКИ

#Область ПанельОтправкиВКонтролирующиеОрганы

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбновитьОтправкуИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьПротоколИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеотправленноеИзвещение(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьНеотправленноеИзвещениеИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьКритическиеОшибкиИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОтправкиНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьСостояниеОтправкиИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОтправитьВКонтролирующийОрган(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаВозможностиВыгрузкиРегламентированногоОтчетаПередОтправкой", ЭтотОбъект);
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередОтправкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаВозможностиВыгрузкиРегламентированногоОтчетаПередОтправкой(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьВКонтролирующийОрганЗавершение", ЭтотОбъект);
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВКонтролирующийОрганЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПриНажатииНаКнопкуОтправкиВКонтролирующийОрган(ЭтаФорма, "ФНС");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	Оповещение = Новый ОписаниеОповещения("ПослеСохраненияФормыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьНаКлиенте(, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриАктивизацииОбласти(Элемент)
	
	Элементы.ТабличныйДокументКонтекстноеМенюУдалитьСтроку.Доступность = Ложь;
	Элементы.ТабличныйДокументКонтекстноеМенюДобавитьСтроку.Доступность = Ложь;
	
	Если СтрЧислоВхождений(Элемент.ТекущаяОбласть.Имя, "УдалитьСтроку") = 0
		И (СтрЧислоВхождений(Элемент.ТекущаяОбласть.Имя, "П0003200001") > 0
		ИЛИ СтрНачинаетсяС(Элемент.ТекущаяОбласть.Имя, "П0004М1")
		ИЛИ СтрНачинаетсяС(Элемент.ТекущаяОбласть.Имя, "П0004М2")
		ИЛИ СтрНачинаетсяС(Элемент.ТекущаяОбласть.Имя, "П0004М3")
		ИЛИ СтрНачинаетсяС(Элемент.ТекущаяОбласть.Имя, "П0006М1")
		ИЛИ СтрНачинаетсяС(Элемент.ТекущаяОбласть.Имя, "П0006М2")
		ИЛИ СтрНачинаетсяС(Элемент.ТекущаяОбласть.Имя, "П0006М3")
		ИЛИ СтрЧислоВхождений(Элемент.ТекущаяОбласть.Имя, "П0007000001") > 0
		ИЛИ ((СтрЧислоВхождений(Элемент.ТекущаяОбласть.Имя, "П00050000") > 0)
		И СтрЧислоВхождений(Элемент.ТекущаяОбласть.Имя, "_") > 0)) Тогда
		
		Элементы.ТабличныйДокументКонтекстноеМенюДобавитьСтроку.Доступность = Истина;
		
		ПозицияЗнакаПодчеркивания = СтрНайти(Элемент.ТекущаяОбласть.Имя, "_");
		
		Если НЕ ПозицияЗнакаПодчеркивания = Неопределено Тогда
			
			КодОбласти = Лев(Элемент.ТекущаяОбласть.Имя, ПозицияЗнакаПодчеркивания);
			
			Если НЕ ТабличныйДокумент.Области.Найти(КодОбласти + "2") = Неопределено Тогда
				Элементы.ТабличныйДокументКонтекстноеМенюУдалитьСтроку.Доступность = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСведенияНДС(ИмяРаздела)
	
	ЗаписьРегистраСведений = РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов.СоздатьМенеджерЗаписи();
	ЗаписьРегистраСведений.РегламентированныйОтчет = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	ЗаписьРегистраСведений.ВидДополнительногоФайла = "ТабличныйДокумент" + ИмяРаздела;
	
	ЗаписьРегистраСведений.Прочитать();
	
	Если ЗначениеЗаполнено(ЗаписьРегистраСведений.ВидДополнительногоФайла) Тогда
		АдресТабличногоДокумента = ПоместитьВоВременноеХранилище(ЗаписьРегистраСведений.СодержимоеФайла.Получить(), УникальныйИдентификатор);
		СтруктураРеквизитовФормы.Вставить("АдресТабличногоДокумента" + ИмяРаздела, АдресТабличногоДокумента);
	КонецЕсли;
	
	ЗаписьРегистраСведений = РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов.СоздатьМенеджерЗаписи();
	ЗаписьРегистраСведений.РегламентированныйОтчет = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	ЗаписьРегистраСведений.ВидДополнительногоФайла = "Данные" + ИмяРаздела;
	
	ЗаписьРегистраСведений.Прочитать();
	
	Если ЗначениеЗаполнено(ЗаписьРегистраСведений.ВидДополнительногоФайла) Тогда
		АдресДанных = ПоместитьВоВременноеХранилище(ЗаписьРегистраСведений.СодержимоеФайла.Получить(), УникальныйИдентификатор);
		СтруктураРеквизитовФормы.Вставить("АдресДанных" + ИмяРаздела, АдресДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьПризнакАктуальностиСведенийРаздела(СписокСохранения, ИмяРаздела)
	
	Если СписокСохранения.Свойство("АктуальностьСведений" + ИмяРаздела) Тогда
		ВосстанавливаемоеСостояние = СписокСохранения["АктуальностьСведений" + ИмяРаздела];
	Иначе
		ВосстанавливаемоеСостояние = 0;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.Вставить("АктуальностьСведений" + ИмяРаздела, ВосстанавливаемоеСостояние);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиРазделРегистраУчетаНДС(ИмяРаздела, НомерСтраницы = 1) Экспорт
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяРаздела;
	СтруктураРеквизитовФормы.НомерТекущейСтраницы = НомерСтраницы;
	
	ТабличныйДокументУчетаНДС.Очистить();
	
	ИмяРеквизитаАдресаМакетаОтчета = "АдресТабличногоДокумента" + ИмяРаздела;
	
	ИмяФормыОтчета = Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7);
	ИмяМакетаРаздела = Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяРаздела;
	МакетРаздела = Отчеты[ИмяФормыОтчета].ПолучитьМакет(ИмяМакетаРаздела);
	
	СписокСтраниц = РеквизитФормыВЗначение("Страницы" + ИмяРаздела);
	
	ТабличныйДокументРаздела = Новый ТабличныйДокумент;
	Если СписокСтраниц.Количество() > 0 Тогда
		НомерПервойСтрокиСегмента = СписокСтраниц[НомерСтраницы - 1].НомерПервойСтроки;
		
		ТабличныйДокументРаздела = РегламентированнаяОтчетность.СегментТабличногоДокументаРазделаДекларацииНДС(СтруктураРеквизитовФормы.мСохраненныйДок, ИмяРаздела, НомерПервойСтрокиСегмента);
		
	ИначеЕсли СтруктураРеквизитовФормы.УспешноеАвтозаполнение <> Неопределено
	        И СтруктураРеквизитовФормы.АвтозаполнениеРазделовВТекущейСессии[ИмяРаздела] Тогда
		ТабличныйДокументРаздела = МакетРаздела.ПолучитьОбласть("Пустой");
		
	ИначеЕсли СтруктураРеквизитовФормы.Свойство(ИмяРеквизитаАдресаМакетаОтчета) Тогда
		Если СтруктураРеквизитовФормы[ИмяРеквизитаАдресаМакетаОтчета] <> Неопределено Тогда
			
			ТабличныйДокументРаздела = ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы[ИмяРеквизитаАдресаМакетаОтчета]);
			
		Иначе
			ТабличныйДокументРаздела = МакетРаздела.ПолучитьОбласть("Пустой");
		КонецЕсли;
		
	Иначе
		ТабличныйДокументРаздела = МакетРаздела.ПолучитьОбласть("Незаполнено");
		
	КонецЕсли;
	
	ТабличныйДокументУчетаНДС.Вывести(ТабличныйДокументРаздела);
	
	АктуальностьРанееПредставленныхСведений = СтруктураРеквизитовФормы["АктуальностьСведений" + ИмяРаздела];
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияНДС(Контейнер, ИмяРаздела)
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	Если Контейнер[ИмяРаздела].Свойство("ФормироватьТабличныйДокумент") Тогда
		ПризнакЗаполнения = Контейнер[ИмяРаздела].ФормироватьТабличныйДокумент;
	Иначе
		ПризнакЗаполнения = Ложь;
	КонецЕсли;
	
	ПризнакЗаполнения = ТипБулево.ПривестиЗначение(ПризнакЗаполнения);
	
	СтруктураРеквизитовФормы.ВыполненоЗаполнениеРазделов.Вставить(ИмяРаздела, ПризнакЗаполнения);
	
	СформироватьСписокСекцийРаздела(ИмяРаздела);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСведенияРазделаНДС(ИмяРаздела)
	
	СтруктураРеквизитовФормы.АвтозаполнениеРазделовВТекущейСессии[ИмяРаздела] = Ложь;
	
	СписокСтраниц = РеквизитФормыВЗначение("Страницы" + ИмяРаздела);
	
	Если СписокСтраниц.Количество() > 0 Тогда
		СписокСтраниц.Очистить();
		ЗначениеВРеквизитФормы(СписокСтраниц, "Страницы" + ИмяРаздела);
		
	Иначе
		Если СтруктураРеквизитовФормы.Свойство("АдресТабличногоДокумента" + ИмяРаздела)
		   И СтруктураРеквизитовФормы["АдресТабличногоДокумента" + ИмяРаздела] <> Неопределено Тогда
			УдалитьИзВременногоХранилища(СтруктураРеквизитовФормы["АдресТабличногоДокумента" + ИмяРаздела]);
			СтруктураРеквизитовФормы.Удалить("АдресТабличногоДокумента" + ИмяРаздела);
		КонецЕсли;
		
		Если СтруктураРеквизитовФормы.Свойство("АдресДанных" + ИмяРаздела)
		   И СтруктураРеквизитовФормы["АдресДанных" + ИмяРаздела] <> Неопределено Тогда
			УдалитьИзВременногоХранилища(СтруктураРеквизитовФормы["АдресДанных" + ИмяРаздела]);
			СтруктураРеквизитовФормы.Удалить("АдресДанных" + ИмяРаздела);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНДС(ИмяРаздела)
	
	ОчиститьСведенияРазделаНДС(ИмяРаздела);
	ВывестиРазделРегистраУчетаНДС(ИмяРаздела);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСведенияНДС(ИмяРаздела)
	
	// Удаление сегментов раздела при очистке отчета.
	
	СписокСтраниц = РеквизитФормыВЗначение("Страницы" + ИмяРаздела);
	
	Если СписокСтраниц.Количество() = 0 Тогда
		РегламентированнаяОтчетность.УдалитьСегментыТабличногоДокументаРазделаДекларацииНДС(
			СтруктураРеквизитовФормы.мСохраненныйДок, ИмяРаздела);
		РегламентированнаяОтчетность.УдалитьСегментыДанныхРазделаДекларацииНДС(
			СтруктураРеквизитовФормы.мСохраненныйДок, ИмяРаздела);
		РегламентированнаяОтчетность.УдалитьИтогиРазделаДекларацииНДС(
			СтруктураРеквизитовФормы.мСохраненныйДок, ИмяРаздела);
			
	КонецЕсли;
	
	// Сохранение результатов автозаполнения без сегментирования.
	
	ЗаписьРегистраСведений = РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов.СоздатьМенеджерЗаписи();
	ЗаписьРегистраСведений.РегламентированныйОтчет = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	ЗаписьРегистраСведений.ВидДополнительногоФайла = "ТабличныйДокумент" + ИмяРаздела;
	
	Если СтруктураРеквизитовФормы.Свойство("АдресТабличногоДокумента" + ИмяРаздела)
	   И СтруктураРеквизитовФормы["АдресТабличногоДокумента" + ИмяРаздела] <> Неопределено Тогда
		
		ЗаписьРегистраСведений.СодержимоеФайла = Новый ХранилищеЗначения(
			ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы["АдресТабличногоДокумента" + ИмяРаздела]));
		ЗаписьРегистраСведений.ИмяФайла = ИмяРаздела + ".mxl";
		ЗаписьРегистраСведений.Размер = 1;
		ЗаписьРегистраСведений.ДатаДобавления = ТекущаяДатаСеанса();
		ЗаписьРегистраСведений.Записать();
		
	Иначе
		
		ЗаписьРегистраСведений.Удалить();
		
	КонецЕсли;
	
	ЗаписьРегистраСведений = РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов.СоздатьМенеджерЗаписи();
	ЗаписьРегистраСведений.РегламентированныйОтчет = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	ЗаписьРегистраСведений.ВидДополнительногоФайла = "Данные" + ИмяРаздела;
	
	Если СтруктураРеквизитовФормы.Свойство("АдресДанных" + ИмяРаздела)
	   И СтруктураРеквизитовФормы["АдресДанных" + ИмяРаздела] <> Неопределено Тогда
		
		ЗаписьРегистраСведений.СодержимоеФайла = Новый ХранилищеЗначения(
			ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы["АдресДанных" + ИмяРаздела]));
		ЗаписьРегистраСведений.ИмяФайла = ИмяРаздела + ".xml";
		ЗаписьРегистраСведений.Размер = 1;
		ЗаписьРегистраСведений.ДатаДобавления = ТекущаяДатаСеанса();
		ЗаписьРегистраСведений.Записать();
		
	Иначе
		
		ЗаписьРегистраСведений.Удалить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПризнакАктуальностиСведенийРаздела(СписокСохранения, ИмяРаздела)
	
	Если СтруктураРеквизитовФормы.Свойство("АктуальностьСведений" + ИмяРаздела) Тогда
		СохраняемоеСостояние = СтруктураРеквизитовФормы["АктуальностьСведений" + ИмяРаздела];
	Иначе
		СохраняемоеСостояние = 0;
	КонецЕсли;
	
	СписокСохранения.Вставить("АктуальностьСведений" + ИмяРаздела, СохраняемоеСостояние);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПризнакаАктуальностиРанееОтправленныхСведений()
	
	ПризнакДоступен = (НомерКорректировки <> 0);
	Элементы.АктуальностьРанееПредставленныхСведений.Доступность = ПризнакДоступен;
	
КонецПроцедуры

&НаКлиенте
Процедура АктуальностьРанееПредставленныхСведенийПриИзменении(Элемент)
	
	ИмяРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	СтруктураРеквизитовФормы.Вставить("АктуальностьСведений" + ИмяРаздела, АктуальностьРанееПредставленныхСведений);
	
	Модифицированность = Истина;
	
КонецПроцедуры

#Область ВыгрузкаЭлектронногоПредставленияСведенийРегистровУчетаНДС

&НаСервере
Функция ВыгрузкаРаздел8(ПараметрыВыгрузки)
	
	ИмяРаздела = "Раздел8";
	
	Если НЕ (ПараметрыВыгрузки.ВидДок <> "0" И ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела] = "1" И ПараметрыВыгрузки.Раздел8Обязателен) Тогда
		ДанныеРаздела = ДанныеРазделаНДСДляВыгрузки(ПараметрыВыгрузки, ИмяРаздела);
		Если ДанныеРаздела = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ИдФайл = СформироватьИдентификаторФайлаВыгрузкиНДС(ПараметрыВыгрузки, "NO_NDS.8");
	ПараметрыВыгрузки.Вставить("ИдФайл" + ИмяРаздела, ИдФайл);
	
	КомпоновщикXML = КомпоновщикXML_Новый();
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "Файл");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИдФайл", ИдФайл);
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ВерсПрог", ПараметрыВыгрузки.ВерсПрог);
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ВерсФорм", "5.05");
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "Документ");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "Индекс", "0000080");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомКорр", ПараметрыВыгрузки.ВидДок);
	
	Если ПараметрыВыгрузки.ВидДок <> "0" Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ПризнСвед8", ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела]);
	КонецЕсли;
	
	Если ПараметрыВыгрузки.ВидДок = "0" ИЛИ ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела] = "0" Тогда
		
		СтрокиРаздела = ДанныеРаздела.СтрокиРаздела;
		ИтогиРаздела = ДанныеРаздела.ИтогиРаздела;
		
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "КнигаПокуп");
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СумНДСВсКПк", ИтогиРаздела.СумНДСВсКПк, "Ч,19,2");
		
		Если ПараметрыВыгрузки.ДанныеСегментированы Тогда
			Для Каждого НомерПервойСтрокиСекции Из СтрокиРаздела Цикл
				СтрокиСегментаРаздела = РегламентированнаяОтчетность.СегментДанныхРазделаДекларацииНДС(СтруктураРеквизитовФормы.мСохраненныйДок, "Раздел8", НомерПервойСтрокиСекции);
				
				Для Каждого СтрокаДанных ИЗ СтрокиСегментаРаздела Цикл
					ВыгрузитьСтрокуСведенийРаздела8(КомпоновщикXML, СтрокаДанных);
				КонецЦикла;
			КонецЦикла;
			
		Иначе
			Для Каждого СтрокаДанных Из СтрокиРаздела Цикл
				ВыгрузитьСтрокуСведенийРаздела8(КомпоновщикXML, СтрокаДанных);
			КонецЦикла;
			
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЕсли;
	
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	
	РезультатВыгрузки = Новый Структура;
	РезультатВыгрузки.Вставить("ИмяФайлаВыгрузки", ИдФайл + ".xml");
	РезультатВыгрузки.Вставить("АдресФайлаВыгрузки", КомпоновщикXML_СсылкаНаВременноеХранилище(КомпоновщикXML));
	РезультатВыгрузки.Вставить("ТипФайлаВыгрузки", "НДС2017" + ИмяРаздела);
	РезультатВыгрузки.Вставить("КодировкаФайлаВыгрузки", "windows-1251");
	
	Возврат РезультатВыгрузки;
	
КонецФункции

&НаСервере
Процедура ВыгрузитьСтрокуСведенийРаздела8(КомпоновщикXML, СтрокаДанных)
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "КнПокСтр");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомерПор", СтрокаДанных.НомерПор, "Ч,12");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомСчФПрод", СтрокаДанных.НомСчФПрод, "Т,1000");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаСчФПрод", СтрокаДанных.ДатаСчФПрод, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомИспрСчФ", СтрокаДанных.НомИспрСчФ, "Ч,3");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаИспрСчФ", СтрокаДанных.ДатаИспрСчФ, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомКСчФПрод", СтрокаДанных.НомКСчФПрод, "Т,256");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаКСчФПрод", СтрокаДанных.ДатаКСчФПрод, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомИспрКСчФ", СтрокаДанных.НомИспрКСчФ, "Ч,3");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаИспрКСчФ", СтрокаДанных.ДатаИспрКСчФ, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ОКВ", СтрокаДанных.ОКВ, "Т,3");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СтоимПокупВ", СтрокаДанных.СтоимПокупВ, "Ч,19,2");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СумНДСВыч", СтрокаДанных.СумНДСВыч, "Ч,19,2");
	
	Для Инд = 0 По СтрокаДанных.КодВидОпер.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "КодВидОпер");
		КомпоновщикXML_ВывестиЗначениеИЗакрытьУзел(КомпоновщикXML, СтрокаДанных.КодВидОпер[Инд]);
	КонецЦикла;
	
	Для Инд = 0 По СтрокаДанных.ДокПдтвУпл.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "ДокПдтвУпл");
		
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомДокПдтвУпл", СтрокаДанных.ДокПдтвУпл[Инд].НомДокПдтвУпл, "Т,256");
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ДатаДокПдтвУпл", СтрокаДанных.ДокПдтвУпл[Инд].ДатаДокПдтвУпл, "Т,10");
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЦикла;
	
	Для Инд = 0 По СтрокаДанных.ДатаУчТов.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "ДатаУчТов");
		КомпоновщикXML_ВывестиЗначениеИЗакрытьУзел(КомпоновщикXML, СтрокаДанных.ДатаУчТов[Инд]);
	КонецЦикла;
	
	Для Инд = 0 По СтрокаДанных.СвПрод.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СвПрод");
		
		Если СтрокаДанных.СвПрод[Инд].Свойство("ИННФЛ") Тогда
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведИП");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННФЛ", СтрокаДанных.СвПрод[Инд].ИННФЛ, "Т,12");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		Иначе
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведЮЛ");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННЮЛ", СтрокаДанных.СвПрод[Инд].ИННЮЛ, "Т,10");
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "КПП", СтрокаДанных.СвПрод[Инд].КПП, "Т,9");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЦикла;
	
	Если СтрокаДанных.СвПос <> Неопределено Тогда
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СвПос");
		
		Если СтрокаДанных.СвПос.Свойство("ИННФЛ") Тогда
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведИП");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННФЛ", СтрокаДанных.СвПос.ИННФЛ, "Т,12");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		Иначе
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведЮЛ");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННЮЛ", СтрокаДанных.СвПос.ИННЮЛ, "Т,10");
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "КПП", СтрокаДанных.СвПос.КПП, "Т,9");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЕсли;
	
	Для Инд = 0 По СтрокаДанных.РегНомТД.Количество() - 1 Цикл
		КомпоновщикXML_ВывестиНеобязательныйМножественныйЭлемент(
		КомпоновщикXML, "РегНомТД", СтрокаДанных.РегНомТД[Инд], "Т,27");
	КонецЦикла;
	
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	
КонецПроцедуры

&НаСервере
Функция ВыгрузкаРаздел8_Прил1(ПараметрыВыгрузки)
	
	ИмяРаздела = "Раздел8_Прил1";
	
	ДанныеРаздела = ДанныеРазделаНДСДляВыгрузки(ПараметрыВыгрузки, ИмяРаздела);
	Если ДанныеРаздела = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокиРаздела = ДанныеРаздела.СтрокиРаздела;
	ИтогиРаздела = ДанныеРаздела.ИтогиРаздела;
	
	ИдФайл = СформироватьИдентификаторФайлаВыгрузкиНДС(ПараметрыВыгрузки, "NO_NDS.81");
	ПараметрыВыгрузки.Вставить("ИдФайл" + ИмяРаздела, ИдФайл);
	
	КомпоновщикXML = КомпоновщикXML_Новый();
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "Файл");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИдФайл", ИдФайл);
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ВерсПрог", ПараметрыВыгрузки.ВерсПрог);
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ВерсФорм", "5.05");
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "Документ");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "Индекс", "0000081");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомКорр", ПараметрыВыгрузки.ВидДок);
	
	Если ПараметрыВыгрузки.ВидДок <> "0" Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ПризнСвед81", ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела]);
	КонецЕсли;
	
	Если ПараметрыВыгрузки.ВидДок = "0" ИЛИ ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела] = "0" Тогда
		
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "КнигаПокупДЛ");
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СумНДСИтКПк",  ИтогиРаздела.СумНДСИтКПк,  "Ч,19,2");
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СумНДСИтП1Р8", ИтогиРаздела.СумНДСИтП1Р8, "Ч,19,2");
		
		Если ПараметрыВыгрузки.ДанныеСегментированы Тогда
			Для Каждого НомерПервойСтрокиСекции Из СтрокиРаздела Цикл
				СтрокиСегментаРаздела = РегламентированнаяОтчетность.СегментДанныхРазделаДекларацииНДС(СтруктураРеквизитовФормы.мСохраненныйДок, ИмяРаздела, НомерПервойСтрокиСекции);
				
				Для Каждого СтрокаДанных ИЗ СтрокиСегментаРаздела Цикл
					ВыгрузитьСтрокуСведенийРаздела8_Прил1(КомпоновщикXML, СтрокаДанных);
				КонецЦикла;
			КонецЦикла;
			
		Иначе
			Для Каждого СтрокаДанных Из СтрокиРаздела Цикл
				ВыгрузитьСтрокуСведенийРаздела8_Прил1(КомпоновщикXML, СтрокаДанных);
			КонецЦикла;
			
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		
	КонецЕсли;
	
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	
	РезультатВыгрузки = Новый Структура;
	РезультатВыгрузки.Вставить("ИмяФайлаВыгрузки", ИдФайл + ".xml");
	РезультатВыгрузки.Вставить("АдресФайлаВыгрузки", КомпоновщикXML_СсылкаНаВременноеХранилище(КомпоновщикXML));
	РезультатВыгрузки.Вставить("ТипФайлаВыгрузки", "НДС2017" + ИмяРаздела);
	РезультатВыгрузки.Вставить("КодировкаФайлаВыгрузки", "windows-1251");
	
	Возврат РезультатВыгрузки;
	
КонецФункции

&НаСервере
Процедура ВыгрузитьСтрокуСведенийРаздела8_Прил1(КомпоновщикXML, СтрокаДанных)
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "КнПокДЛСтр");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомерПор", СтрокаДанных.НомерПор, "Ч,12");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомСчФПрод", СтрокаДанных.НомСчФПрод, "Т,1000");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаСчФПрод", СтрокаДанных.ДатаСчФПрод, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомИспрСчФ", СтрокаДанных.НомИспрСчФ, "Ч,3");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаИспрСчФ", СтрокаДанных.ДатаИспрСчФ, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомКСчФПрод", СтрокаДанных.НомКСчФПрод, "Т,256");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаКСчФПрод", СтрокаДанных.ДатаКСчФПрод, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомИспрКСчФ", СтрокаДанных.НомИспрКСчФ, "Ч,3");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаИспрКСчФ", СтрокаДанных.ДатаИспрКСчФ, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ОКВ", СтрокаДанных.ОКВ, "Т,3");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СтоимПокупВ", СтрокаДанных.СтоимПокупВ, "Ч,19,2");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СумНДС", СтрокаДанных.СумНДС, "Ч,19,2");
	
	Для Инд = 0 По СтрокаДанных.КодВидОпер.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "КодВидОпер");
		КомпоновщикXML_ВывестиЗначениеИЗакрытьУзел(КомпоновщикXML, СтрокаДанных.КодВидОпер[Инд]);
	КонецЦикла;
	
	Для Инд = 0 По СтрокаДанных.ДокПдтвУпл.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "ДокПдтвУпл");
		
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомДокПдтвУпл", СтрокаДанных.ДокПдтвУпл[Инд].НомДокПдтвУпл, "Т,256");
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ДатаДокПдтвУпл", СтрокаДанных.ДокПдтвУпл[Инд].ДатаДокПдтвУпл, "Т,10");
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЦикла;
	
	Для Инд = 0 По СтрокаДанных.ДатаУчТов.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "ДатаУчТов");
		КомпоновщикXML_ВывестиЗначениеИЗакрытьУзел(КомпоновщикXML, СтрокаДанных.ДатаУчТов[Инд]);
	КонецЦикла;
	
	Для Инд = 0 По СтрокаДанных.СвПрод.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СвПрод");
		
		Если СтрокаДанных.СвПрод[Инд].Свойство("ИННФЛ") Тогда
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведИП");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННФЛ", СтрокаДанных.СвПрод[Инд].ИННФЛ, "Т,12");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		Иначе
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведЮЛ");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННЮЛ", СтрокаДанных.СвПрод[Инд].ИННЮЛ, "Т,10");
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "КПП", СтрокаДанных.СвПрод[Инд].КПП, "Т,9");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЦикла;
	
	Если СтрокаДанных.СвПос <> Неопределено Тогда
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СвПос");
		
		Если СтрокаДанных.СвПос.Свойство("ИННФЛ") Тогда
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведИП");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННФЛ", СтрокаДанных.СвПос.ИННФЛ, "Т,12");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		Иначе
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведЮЛ");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННЮЛ", СтрокаДанных.СвПос.ИННЮЛ, "Т,10");
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "КПП", СтрокаДанных.СвПос.КПП, "Т,9");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЕсли;
	
	Для Инд = 0 По СтрокаДанных.РегНомТД.Количество() - 1 Цикл
		КомпоновщикXML_ВывестиНеобязательныйМножественныйЭлемент(
		КомпоновщикXML, "РегНомТД", СтрокаДанных.РегНомТД[Инд], "Т,27");
	КонецЦикла;
	
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	
КонецПроцедуры

&НаСервере
Функция ВыгрузкаРаздел9(ПараметрыВыгрузки)
	
	ИмяРаздела = "Раздел9";
	
	Если НЕ (ПараметрыВыгрузки.ВидДок <> "0" И ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела] = "1" И ПараметрыВыгрузки.Раздел9Обязателен) Тогда
		ДанныеРаздела = ДанныеРазделаНДСДляВыгрузки(ПараметрыВыгрузки, ИмяРаздела);
		Если ДанныеРаздела = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ИдФайл = СформироватьИдентификаторФайлаВыгрузкиНДС(ПараметрыВыгрузки, "NO_NDS.9");
	ПараметрыВыгрузки.Вставить("ИдФайл" + ИмяРаздела, ИдФайл);
	
	КомпоновщикXML = КомпоновщикXML_Новый();
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "Файл");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИдФайл", ИдФайл);
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ВерсПрог", ПараметрыВыгрузки.ВерсПрог);
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ВерсФорм", "5.05");
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "Документ");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "Индекс", "0000090");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомКорр", ПараметрыВыгрузки.ВидДок);
	
	Если ПараметрыВыгрузки.ВидДок <> "0" Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ПризнСвед9", ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела]);
	КонецЕсли;
	
	Если ПараметрыВыгрузки.ВидДок = "0" ИЛИ ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела] = "0" Тогда
		
		СтрокиРаздела = ДанныеРаздела.СтрокиРаздела;
		ИтогиРаздела = ДанныеРаздела.ИтогиРаздела;
		
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "КнигаПрод");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтПродБезНДС18", ИтогиРаздела.СтПродБезНДС18, "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтПродБезНДС10", ИтогиРаздела.СтПродБезНДС10, "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтПродБезНДС0",  ИтогиРаздела.СтПродБезНДС0,  "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СумНДСВсКПр18",  ИтогиРаздела.СумНДСВсКПр18,  "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СумНДСВсКПр10",  ИтогиРаздела.СумНДСВсКПр10,  "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтПродОсвВсКПр", ИтогиРаздела.СтПродОсвВсКПр, "Ч,19,2");
		
		Если ПараметрыВыгрузки.ДанныеСегментированы Тогда
			Для Каждого НомерПервойСтрокиСекции Из СтрокиРаздела Цикл
				СтрокиСегментаРаздела = РегламентированнаяОтчетность.СегментДанныхРазделаДекларацииНДС(СтруктураРеквизитовФормы.мСохраненныйДок, ИмяРаздела, НомерПервойСтрокиСекции);
				
				Для Каждого СтрокаДанных ИЗ СтрокиСегментаРаздела Цикл
					ВыгрузитьСтрокуСведенийРаздела9(КомпоновщикXML, СтрокаДанных);
				КонецЦикла;
			КонецЦикла;
			
		Иначе
			Для Каждого СтрокаДанных Из СтрокиРаздела Цикл
				ВыгрузитьСтрокуСведенийРаздела9(КомпоновщикXML, СтрокаДанных);
			КонецЦикла;
			
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		
	КонецЕсли;
		
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	
	РезультатВыгрузки = Новый Структура;
	РезультатВыгрузки.Вставить("ИмяФайлаВыгрузки", ИдФайл + ".xml");
	РезультатВыгрузки.Вставить("АдресФайлаВыгрузки", КомпоновщикXML_СсылкаНаВременноеХранилище(КомпоновщикXML));
	РезультатВыгрузки.Вставить("ТипФайлаВыгрузки", "НДС2017" + ИмяРаздела);
	РезультатВыгрузки.Вставить("КодировкаФайлаВыгрузки", "windows-1251");
	
	Возврат РезультатВыгрузки;
	
КонецФункции

&НаСервере
Процедура ВыгрузитьСтрокуСведенийРаздела9(КомпоновщикXML, СтрокаДанных)
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "КнПродСтр");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомерПор", СтрокаДанных.НомерПор, "Ч,12");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомСчФПрод", СтрокаДанных.НомСчФПрод, "Т,1000");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ДатаСчФПрод", СтрокаДанных.ДатаСчФПрод, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомИспрСчФ", СтрокаДанных.НомИспрСчФ, "Ч,3");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаИспрСчФ", СтрокаДанных.ДатаИспрСчФ, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомКСчФПрод", СтрокаДанных.НомКСчФПрод, "Т,256");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаКСчФПрод", СтрокаДанных.ДатаКСчФПрод, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомИспрКСчФ", СтрокаДанных.НомИспрКСчФ, "Ч,3");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаИспрКСчФ", СтрокаДанных.ДатаИспрКСчФ, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ОКВ", СтрокаДанных.ОКВ, "Т,3");
	
	ВыгружатьНулевойАтрибут_СтоимПродСФВ = ЗначениеЗаполнено(СтрокаДанных.ОКВ) И СтрокаДанных.ОКВ <> "643";
	Если ВыгружатьНулевойАтрибут_СтоимПродСФВ Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СтоимПродСФВ", СтрокаДанных.СтоимПродСФВ, "Ч,19,2");
	Иначе
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтоимПродСФВ", СтрокаДанных.СтоимПродСФВ, "Ч,19,2");
	КонецЕсли;
	
	ВыгружатьНулевойАтрибут_СтоимПродСФ = НЕ ЗначениеЗаполнено(СтрокаДанных.СтоимПродСФ)
	                                    И НЕ ЗначениеЗаполнено(СтрокаДанных.СтоимПродОсв);
	Если ВыгружатьНулевойАтрибут_СтоимПродСФ Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СтоимПродСФ", СтрокаДанных.СтоимПродСФ, "Ч,19,2");
	Иначе
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтоимПродСФ", СтрокаДанных.СтоимПродСФ, "Ч,19,2");
	КонецЕсли;
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтоимПродСФ18", СтрокаДанных.СтоимПродСФ18, "Ч,19,2");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтоимПродСФ10", СтрокаДанных.СтоимПродСФ10, "Ч,19,2");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтоимПродСФ0",  СтрокаДанных.СтоимПродСФ0,  "Ч,19,2");
	
	ВыгружатьНулевойАтрибут_СумНДССФ18 = ЗначениеЗаполнено(СтрокаДанных.СтоимПродСФ18);
	Если ВыгружатьНулевойАтрибут_СумНДССФ18 Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СумНДССФ18", СтрокаДанных.СумНДССФ18, "Ч,19,2");
	Иначе
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СумНДССФ18", СтрокаДанных.СумНДССФ18, "Ч,19,2");
	КонецЕсли;
	
	ВыгружатьНулевойАтрибут_СумНДССФ10 = ЗначениеЗаполнено(СтрокаДанных.СтоимПродСФ10);
	Если ВыгружатьНулевойАтрибут_СумНДССФ10 Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СумНДССФ10", СтрокаДанных.СумНДССФ10, "Ч,19,2");
	Иначе
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СумНДССФ10", СтрокаДанных.СумНДССФ10, "Ч,19,2");
	КонецЕсли;
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтоимПродОсв", СтрокаДанных.СтоимПродОсв, "Ч,19,2");
	
	Для Инд = 0 По СтрокаДанных.КодВидОпер.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "КодВидОпер");
		КомпоновщикXML_ВывестиЗначениеИЗакрытьУзел(КомпоновщикXML, СтрокаДанных.КодВидОпер[Инд]);
	КонецЦикла;
	
	Для Инд = 0 По СтрокаДанных.РегНомТД.Количество() - 1 Цикл
		КомпоновщикXML_ВывестиНеобязательныйМножественныйЭлемент(
		КомпоновщикXML, "РегНомТД", СтрокаДанных.РегНомТД[Инд], "Т,27");
	КонецЦикла;
	
	Для Инд = 0 По СтрокаДанных.ДокПдтвОпл.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "ДокПдтвОпл");
		
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомДокПдтвОпл",  СтрокаДанных.ДокПдтвОпл[Инд].НомДокПдтвОпл,  "Т,256");
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ДатаДокПдтвОпл", СтрокаДанных.ДокПдтвОпл[Инд].ДатаДокПдтвОпл, "Т,10");
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЦикла;
	
	Для Инд = 0 По СтрокаДанных.СвПокуп.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СвПокуп");
		
		Если СтрокаДанных.СвПокуп[Инд].Свойство("ИННФЛ") Тогда
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведИП");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННФЛ", СтрокаДанных.СвПокуп[Инд].ИННФЛ, "Т,12");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		Иначе
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведЮЛ");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННЮЛ", СтрокаДанных.СвПокуп[Инд].ИННЮЛ, "Т,10");
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "КПП", СтрокаДанных.СвПокуп[Инд].КПП, "Т,9");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЦикла;
	
	Если СтрокаДанных.СвПос <> Неопределено Тогда
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СвПос");
		
		Если СтрокаДанных.СвПос.Свойство("ИННФЛ") Тогда
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведИП");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННФЛ", СтрокаДанных.СвПос.ИННФЛ, "Т,12");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		Иначе
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведЮЛ");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННЮЛ", СтрокаДанных.СвПос.ИННЮЛ, "Т,10");
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "КПП", СтрокаДанных.СвПос.КПП, "Т,9");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЕсли;
	
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	
КонецПроцедуры

&НаСервере
Функция ВыгрузкаРаздел9_Прил1(ПараметрыВыгрузки)
	
	ИмяРаздела = "Раздел9_Прил1";
	
	ДанныеРаздела = ДанныеРазделаНДСДляВыгрузки(ПараметрыВыгрузки, ИмяРаздела);
	Если ДанныеРаздела = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокиРаздела = ДанныеРаздела.СтрокиРаздела;
	ИтогиРаздела = ДанныеРаздела.ИтогиРаздела;
	
	ИдФайл = СформироватьИдентификаторФайлаВыгрузкиНДС(ПараметрыВыгрузки, "NO_NDS.91");
	ПараметрыВыгрузки.Вставить("ИдФайл" + ИмяРаздела, ИдФайл);
	
	КомпоновщикXML = КомпоновщикXML_Новый();
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "Файл");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИдФайл", ИдФайл);
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ВерсПрог", ПараметрыВыгрузки.ВерсПрог);
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ВерсФорм", "5.05");
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "Документ");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "Индекс", "0000091");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомКорр", ПараметрыВыгрузки.ВидДок);
	
	Если ПараметрыВыгрузки.ВидДок <> "0" Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ПризнСвед91", ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела]);
	КонецЕсли;
	
	Если ПараметрыВыгрузки.ВидДок = "0" ИЛИ ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела] = "0" Тогда
		
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "КнигаПродДЛ");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ИтСтПродКПр18",   ИтогиРаздела.ИтСтПродКПр18, "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ИтСтПродКПр10",   ИтогиРаздела.ИтСтПродКПр10, "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ИтСтПродКПр0",    ИтогиРаздела.ИтСтПродКПр0,  "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СумНДСИтКПр18",   ИтогиРаздела.СумНДСИтКПр18,  "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СумНДСИтКПр10",   ИтогиРаздела.СумНДСИтКПр10,  "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ИтСтПродОсвКПр",  ИтогиРаздела.ИтСтПродОсвКПр, "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтПродВсП1Р9_18", ИтогиРаздела.СтПродВсП1Р9_18,  "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтПродВсП1Р9_10", ИтогиРаздела.СтПродВсП1Р9_10, "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтПродВсП1Р9_0",  ИтогиРаздела.СтПродВсП1Р9_0,  "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СумНДСВсП1Р9_18", ИтогиРаздела.СумНДСВсП1Р9_18, "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СумНДСВсП1Р9_10", ИтогиРаздела.СумНДСВсП1Р9_10,  "Ч,19,2");
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтПродОсвП1Р9Вс", ИтогиРаздела.СтПродОсвП1Р9Вс, "Ч,19,2");
		
		Если ПараметрыВыгрузки.ДанныеСегментированы Тогда
			Для Каждого НомерПервойСтрокиСекции Из СтрокиРаздела Цикл
				СтрокиСегментаРаздела = РегламентированнаяОтчетность.СегментДанныхРазделаДекларацииНДС(СтруктураРеквизитовФормы.мСохраненныйДок, ИмяРаздела, НомерПервойСтрокиСекции);
				
				Для Каждого СтрокаДанных ИЗ СтрокиСегментаРаздела Цикл
					ВыгрузитьСтрокуСведенийРаздела9_Прил1(КомпоновщикXML, СтрокаДанных);
				КонецЦикла;
			КонецЦикла;
			
		Иначе
			Для Каждого СтрокаДанных Из СтрокиРаздела Цикл
				ВыгрузитьСтрокуСведенийРаздела9_Прил1(КомпоновщикXML, СтрокаДанных);
			КонецЦикла;
			
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		
	КонецЕсли;
	
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	
	РезультатВыгрузки = Новый Структура;
	РезультатВыгрузки.Вставить("ИмяФайлаВыгрузки", ИдФайл + ".xml");
	РезультатВыгрузки.Вставить("АдресФайлаВыгрузки", КомпоновщикXML_СсылкаНаВременноеХранилище(КомпоновщикXML));
	РезультатВыгрузки.Вставить("ТипФайлаВыгрузки", "НДС2017" + ИмяРаздела);
	РезультатВыгрузки.Вставить("КодировкаФайлаВыгрузки", "windows-1251");
	
	Возврат РезультатВыгрузки;
	
КонецФункции

&НаСервере
Процедура ВыгрузитьСтрокуСведенийРаздела9_Прил1(КомпоновщикXML, СтрокаДанных)
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "КнПродДЛСтр");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомерПор", СтрокаДанных.НомерПор, "Ч,12");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомСчФПрод", СтрокаДанных.НомСчФПрод, "Т,1000");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ДатаСчФПрод", СтрокаДанных.ДатаСчФПрод, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомИспрСчФ", СтрокаДанных.НомИспрСчФ, "Ч,3");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаИспрСчФ", СтрокаДанных.ДатаИспрСчФ, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомКСчФПрод", СтрокаДанных.НомКСчФПрод, "Т,256");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаКСчФПрод", СтрокаДанных.ДатаКСчФПрод, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомИспрКСчФ", СтрокаДанных.НомИспрКСчФ, "Ч,3");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаИспрКСчФ", СтрокаДанных.ДатаИспрКСчФ, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ОКВ", СтрокаДанных.ОКВ, "Т,3");
	
	ВыгружатьНулевойАтрибут_СтоимПродСФВ = ЗначениеЗаполнено(СтрокаДанных.ОКВ) И СтрокаДанных.ОКВ <> "643";
	Если ВыгружатьНулевойАтрибут_СтоимПродСФВ Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СтоимПродСФВ", СтрокаДанных.СтоимПродСФВ, "Ч,19,2");
	Иначе
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтоимПродСФВ", СтрокаДанных.СтоимПродСФВ, "Ч,19,2");
	КонецЕсли;
	
	ВыгружатьНулевойАтрибут_СтоимПродСФ = НЕ ЗначениеЗаполнено(СтрокаДанных.СтоимПродСФ)
	                                    И НЕ ЗначениеЗаполнено(СтрокаДанных.СтоимПродОсв);
	Если ВыгружатьНулевойАтрибут_СтоимПродСФ Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СтоимПродСФ", СтрокаДанных.СтоимПродСФ, "Ч,19,2");
	Иначе
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтоимПродСФ", СтрокаДанных.СтоимПродСФ, "Ч,19,2");
	КонецЕсли;
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтоимПродСФ18", СтрокаДанных.СтоимПродСФ18, "Ч,19,2");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтоимПродСФ10", СтрокаДанных.СтоимПродСФ10, "Ч,19,2");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтоимПродСФ0",  СтрокаДанных.СтоимПродСФ0,  "Ч,19,2");
	
	ВыгружатьНулевойАтрибут_СумНДССФ18 = ЗначениеЗаполнено(СтрокаДанных.СтоимПродСФ18);
	Если ВыгружатьНулевойАтрибут_СумНДССФ18 Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СумНДССФ18", СтрокаДанных.СумНДССФ18, "Ч,19,2");
	Иначе
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СумНДССФ18", СтрокаДанных.СумНДССФ18, "Ч,19,2");
	КонецЕсли;
	
	ВыгружатьНулевойАтрибут_СумНДССФ10 = ЗначениеЗаполнено(СтрокаДанных.СтоимПродСФ10);
	Если ВыгружатьНулевойАтрибут_СумНДССФ10 Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СумНДССФ10", СтрокаДанных.СумНДССФ10, "Ч,19,2");
	Иначе
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СумНДССФ10", СтрокаДанных.СумНДССФ10, "Ч,19,2");
	КонецЕсли;
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СтоимПродОсв", СтрокаДанных.СтоимПродОсв, "Ч,19,2");
	
	Для Инд = 0 По СтрокаДанных.КодВидОпер.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "КодВидОпер");
		КомпоновщикXML_ВывестиЗначениеИЗакрытьУзел(КомпоновщикXML, СтрокаДанных.КодВидОпер[Инд]);
	КонецЦикла;
	
	Для Инд = 0 По СтрокаДанных.РегНомТД.Количество() - 1 Цикл
		КомпоновщикXML_ВывестиНеобязательныйМножественныйЭлемент(
		КомпоновщикXML, "РегНомТД", СтрокаДанных.РегНомТД[Инд], "Т,27");
	КонецЦикла;
	
	Для Инд = 0 По СтрокаДанных.ДокПдтвОпл.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "ДокПдтвОпл");
		
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомДокПдтвОпл",  СтрокаДанных.ДокПдтвОпл[Инд].НомДокПдтвОпл,  "Т,256");
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ДатаДокПдтвОпл", СтрокаДанных.ДокПдтвОпл[Инд].ДатаДокПдтвОпл, "Т,10");
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЦикла;
	
	Для Инд = 0 По СтрокаДанных.СвПокуп.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СвПокуп");
		
		Если СтрокаДанных.СвПокуп[Инд].Свойство("ИННФЛ") Тогда
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведИП");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННФЛ", СтрокаДанных.СвПокуп[Инд].ИННФЛ, "Т,12");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		Иначе
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведЮЛ");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННЮЛ", СтрокаДанных.СвПокуп[Инд].ИННЮЛ, "Т,10");
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "КПП", СтрокаДанных.СвПокуп[Инд].КПП, "Т,9");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЦикла;
	
	Если СтрокаДанных.СвПос <> Неопределено Тогда
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СвПос");
		
		Если СтрокаДанных.СвПос.Свойство("ИННФЛ") Тогда
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведИП");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННФЛ", СтрокаДанных.СвПос.ИННФЛ, "Т,12");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		Иначе
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведЮЛ");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННЮЛ", СтрокаДанных.СвПос.ИННЮЛ, "Т,10");
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "КПП", СтрокаДанных.СвПос.КПП, "Т,9");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЕсли;
	
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	
КонецПроцедуры

&НаСервере
Функция ВыгрузкаРаздел10(ПараметрыВыгрузки)
	
	ИмяРаздела = "Раздел10";
	
	ДанныеРаздела = ДанныеРазделаНДСДляВыгрузки(ПараметрыВыгрузки, ИмяРаздела);
	Если ДанныеРаздела = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокиРаздела = ДанныеРаздела.СтрокиРаздела;
	ИтогиРаздела = ДанныеРаздела.ИтогиРаздела;
	
	ИдФайл = СформироватьИдентификаторФайлаВыгрузкиНДС(ПараметрыВыгрузки, "NO_NDS.10");
	ПараметрыВыгрузки.Вставить("ИдФайл" + ИмяРаздела, ИдФайл);
	
	КомпоновщикXML = КомпоновщикXML_Новый();
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "Файл");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИдФайл", ИдФайл);
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ВерсПрог", ПараметрыВыгрузки.ВерсПрог);
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ВерсФорм", "5.05");
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "Документ");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "Индекс", "0000100");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомКорр", ПараметрыВыгрузки.ВидДок);
	
	Если ПараметрыВыгрузки.ВидДок <> "0" Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ПризнСвед10", ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела]);
	КонецЕсли;
	
	Если ПараметрыВыгрузки.ВидДок = "0" ИЛИ ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела] = "0" Тогда
		
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "ЖУчВыстСчФ");
		
		Если ПараметрыВыгрузки.ДанныеСегментированы Тогда
			Для Каждого НомерПервойСтрокиСекции Из СтрокиРаздела Цикл
				СтрокиСегментаРаздела = РегламентированнаяОтчетность.СегментДанныхРазделаДекларацииНДС(СтруктураРеквизитовФормы.мСохраненныйДок, ИмяРаздела, НомерПервойСтрокиСекции);
				
				Для Каждого СтрокаДанных ИЗ СтрокиСегментаРаздела Цикл
					ВыгрузитьСтрокуСведенийРаздела10(КомпоновщикXML, СтрокаДанных);
				КонецЦикла;
			КонецЦикла;
			
		Иначе
			Для Каждого СтрокаДанных Из СтрокиРаздела Цикл
				ВыгрузитьСтрокуСведенийРаздела10(КомпоновщикXML, СтрокаДанных);
			КонецЦикла;
			
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		
	КонецЕсли;
	
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	
	РезультатВыгрузки = Новый Структура;
	РезультатВыгрузки.Вставить("ИмяФайлаВыгрузки", ИдФайл + ".xml");
	РезультатВыгрузки.Вставить("АдресФайлаВыгрузки", КомпоновщикXML_СсылкаНаВременноеХранилище(КомпоновщикXML));
	РезультатВыгрузки.Вставить("ТипФайлаВыгрузки", "НДС2017" + ИмяРаздела);
	РезультатВыгрузки.Вставить("КодировкаФайлаВыгрузки", "windows-1251");
	
	Возврат РезультатВыгрузки;
	
КонецФункции

&НаСервере
Процедура ВыгрузитьСтрокуСведенийРаздела10(КомпоновщикXML, СтрокаДанных)
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "ЖУчВыстСчФСтр");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомерПор", СтрокаДанных.НомерПор, "Ч,12");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомСчФПрод", СтрокаДанных.НомСчФПрод, "Т,1000");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ДатаСчФПрод", СтрокаДанных.ДатаСчФПрод, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомИспрСчФ", СтрокаДанных.НомИспрСчФ, "Ч,3");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаИспрСчФ", СтрокаДанных.ДатаИспрСчФ, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомКСчФПрод", СтрокаДанных.НомКСчФПрод, "Т,256");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаКСчФПрод", СтрокаДанных.ДатаКСчФПрод, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомИспрКСчФ", СтрокаДанных.НомИспрКСчФ, "Ч,3");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаИспрКСчФ", СтрокаДанных.ДатаИспрКСчФ, "Т,10");
	
	Для Инд = 0 По СтрокаДанных.КодВидОпер.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "КодВидОпер");
		КомпоновщикXML_ВывестиЗначениеИЗакрытьУзел(КомпоновщикXML, СтрокаДанных.КодВидОпер[Инд]);
	КонецЦикла;
	
	Если СтрокаДанных.СвПокуп <> Неопределено Тогда
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СвПокуп");
		
		Если СтрокаДанных.СвПокуп.Свойство("ИННФЛ") Тогда
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведИП");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННФЛ", СтрокаДанных.СвПокуп.ИННФЛ, "Т,12");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		Иначе
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведЮЛ");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННЮЛ", СтрокаДанных.СвПокуп.ИННЮЛ, "Т,10");
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "КПП", СтрокаДанных.СвПокуп.КПП, "Т,9");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЕсли;
	
	Для Инд = 0 По СтрокаДанных.СвСчФОтПрод.Количество() -1 Цикл
		ДанныеОДеятельности = СтрокаДанных.СвСчФОтПрод[Инд];
		
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СвСчФОтПрод");
		
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомСчФОтПрод", ДанныеОДеятельности.НомСчФОтПрод, "Т,1000");
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ДатаСчФОтПрод", ДанныеОДеятельности.ДатаСчФОтПрод, "Т,10");
		
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ОКВ", ДанныеОДеятельности.ОКВ, "Т,3");
		
		ВыгружатьАтрибуты_СтоимТовСчФВс_СумНДССчФ = НЕ ЗначениеЗаполнено(СтрокаДанных.НомКСчФПрод);
		Если ВыгружатьАтрибуты_СтоимТовСчФВс_СумНДССчФ Тогда
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СтоимТовСчФВс", ДанныеОДеятельности.СтоимТовСчФВс, "Ч,19,2");
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СумНДССчФ",     ДанныеОДеятельности.СумНДССчФ,     "Ч,19,2");
		КонецЕсли;
		
		ЕстьКорректировкаСчетаФактуры = ЗначениеЗаполнено(СтрокаДанных.НомКСчФПрод)
		                            ИЛИ ЗначениеЗаполнено(СтрокаДанных.ДатаКСчФПрод)
		                            ИЛИ ЗначениеЗаполнено(СтрокаДанных.НомИспрКСчФ)
		                            ИЛИ ЗначениеЗаполнено(СтрокаДанных.ДатаИспрКСчФ);
		
		ВыгружатьНулевойАтрибут_РазСтКСчФУм = ЕстьКорректировкаСчетаФактуры И НЕ ЗначениеЗаполнено(ДанныеОДеятельности.РазСтКСчФУв);
		Если ВыгружатьНулевойАтрибут_РазСтКСчФУм Тогда
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "РазСтКСчФУм", ДанныеОДеятельности.РазСтКСчФУм, "Ч,19,2");
		Иначе
			КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "РазСтКСчФУм", ДанныеОДеятельности.РазСтКСчФУм, "Ч,19,2");
		КонецЕсли;
		
		ВыгружатьНулевойАтрибут_РазСтКСчФУв = ЕстьКорректировкаСчетаФактуры И НЕ ЗначениеЗаполнено(ДанныеОДеятельности.РазСтКСчФУм)
		                                    И НЕ ВыгружатьНулевойАтрибут_РазСтКСчФУм;
		Если ВыгружатьНулевойАтрибут_РазСтКСчФУв Тогда
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "РазСтКСчФУв", ДанныеОДеятельности.РазСтКСчФУв, "Ч,19,2");
		Иначе
			КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "РазСтКСчФУв", ДанныеОДеятельности.РазСтКСчФУв, "Ч,19,2");
		КонецЕсли;
		
		ВыгружатьНулевойАтрибут_РазНДСКСчФУм = ВыгружатьНулевойАтрибут_РазСтКСчФУм ИЛИ ЗначениеЗаполнено(ДанныеОДеятельности.РазСтКСчФУм);
		Если ВыгружатьНулевойАтрибут_РазНДСКСчФУм Тогда
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "РазНДСКСчФУм", ДанныеОДеятельности.РазНДСКСчФУм, "Ч,19,2");
		Иначе
			КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "РазНДСКСчФУм", ДанныеОДеятельности.РазНДСКСчФУм, "Ч,19,2");
		КонецЕсли;
		
		ВыгружатьНулевойАтрибут_РазНДСКСчФУв = ВыгружатьНулевойАтрибут_РазСтКСчФУв ИЛИ ЗначениеЗаполнено(ДанныеОДеятельности.РазСтКСчФУв);
		Если ВыгружатьНулевойАтрибут_РазНДСКСчФУв Тогда
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "РазНДСКСчФУв", ДанныеОДеятельности.РазНДСКСчФУв, "Ч,19,2");
		Иначе
			КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "РазНДСКСчФУв", ДанныеОДеятельности.РазНДСКСчФУв, "Ч,19,2");
		КонецЕсли;
		
		Если ДанныеОДеятельности.СвПрод <> Неопределено Тогда
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СвПрод");
			
			Если ДанныеОДеятельности.СвПрод.Свойство("ИННФЛ") Тогда
				КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведИП");
				
				КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННФЛ", ДанныеОДеятельности.СвПрод.ИННФЛ, "Т,12");
				
				КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
			Иначе
				КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведЮЛ");
				
				КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННЮЛ", ДанныеОДеятельности.СвПрод.ИННЮЛ, "Т,10");
				КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "КПП", ДанныеОДеятельности.СвПрод.КПП, "Т,9");
				
				КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
			КонецЕсли;
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЦикла;
	
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	
КонецПроцедуры

&НаСервере
Функция ВыгрузкаРаздел11(ПараметрыВыгрузки)
	
	ИмяРаздела = "Раздел11";
	
	ДанныеРаздела = ДанныеРазделаНДСДляВыгрузки(ПараметрыВыгрузки, ИмяРаздела);
	Если ДанныеРаздела = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокиРаздела = ДанныеРаздела.СтрокиРаздела;
	ИтогиРаздела = ДанныеРаздела.ИтогиРаздела;
	
	ИдФайл = СформироватьИдентификаторФайлаВыгрузкиНДС(ПараметрыВыгрузки, "NO_NDS.11");
	ПараметрыВыгрузки.Вставить("ИдФайл" + ИмяРаздела, ИдФайл);
	
	КомпоновщикXML = КомпоновщикXML_Новый();
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "Файл");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИдФайл", ИдФайл);
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ВерсПрог", ПараметрыВыгрузки.ВерсПрог);
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ВерсФорм", "5.05");
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "Документ");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "Индекс", "0000110");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомКорр", ПараметрыВыгрузки.ВидДок);
	Если ПараметрыВыгрузки.ВидДок <> "0" Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ПризнСвед11", ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела]);
	КонецЕсли;
	
	Если ПараметрыВыгрузки.ВидДок = "0" ИЛИ ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела] = "0" Тогда
		
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "ЖУчПолучСчФ");
		
		Если ПараметрыВыгрузки.ДанныеСегментированы Тогда
			Для Каждого НомерПервойСтрокиСекции Из СтрокиРаздела Цикл
				СтрокиСегментаРаздела = РегламентированнаяОтчетность.СегментДанныхРазделаДекларацииНДС(СтруктураРеквизитовФормы.мСохраненныйДок, ИмяРаздела, НомерПервойСтрокиСекции);
				
				Для Каждого СтрокаДанных ИЗ СтрокиСегментаРаздела Цикл
					ВыгрузитьСтрокуСведенийРаздела11(КомпоновщикXML, СтрокаДанных);
				КонецЦикла;
			КонецЦикла;
			
		Иначе
			Для Каждого СтрокаДанных Из СтрокиРаздела Цикл
				ВыгрузитьСтрокуСведенийРаздела11(КомпоновщикXML, СтрокаДанных);
			КонецЦикла;
			
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		
	КонецЕсли;
	
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	
	РезультатВыгрузки = Новый Структура;
	РезультатВыгрузки.Вставить("ИмяФайлаВыгрузки", ИдФайл + ".xml");
	РезультатВыгрузки.Вставить("АдресФайлаВыгрузки", КомпоновщикXML_СсылкаНаВременноеХранилище(КомпоновщикXML));
	РезультатВыгрузки.Вставить("ТипФайлаВыгрузки", "НДС2017" + ИмяРаздела);
	РезультатВыгрузки.Вставить("КодировкаФайлаВыгрузки", "windows-1251");
	
	Возврат РезультатВыгрузки;
	
КонецФункции

&НаСервере
Процедура ВыгрузитьСтрокуСведенийРаздела11(КомпоновщикXML, СтрокаДанных)
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "ЖУчПолучСчФСтр");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомерПор", СтрокаДанных.НомерПор, "Ч,12");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомСчФПрод", СтрокаДанных.НомСчФПрод, "Т,1000");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ДатаСчФПрод", СтрокаДанных.ДатаСчФПрод, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомИспрСчФ", СтрокаДанных.НомИспрСчФ, "Ч,3");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаИспрСчФ", СтрокаДанных.ДатаИспрСчФ, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомКСчФПрод", СтрокаДанных.НомКСчФПрод, "Т,256");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаКСчФПрод", СтрокаДанных.ДатаКСчФПрод, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "НомИспрКСчФ", СтрокаДанных.НомИспрКСчФ, "Ч,3");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ДатаИспрКСчФ", СтрокаДанных.ДатаИспрКСчФ, "Т,10");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "КодВидСд", СтрокаДанных.КодВидСд, "Т,1");
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ОКВ", СтрокаДанных.ОКВ, "Т,3");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СтоимТовСчФВс", СтрокаДанных.СтоимТовСчФВс, "Ч,19,2");
	
	ЕстьКорректировкаСчетаФактуры = ЗначениеЗаполнено(СтрокаДанных.НомКСчФПрод)
	                            ИЛИ ЗначениеЗаполнено(СтрокаДанных.ДатаКСчФПрод)
	                            ИЛИ ЗначениеЗаполнено(СтрокаДанных.НомИспрКСчФ)
	                            ИЛИ ЗначениеЗаполнено(СтрокаДанных.ДатаИспрКСчФ);
	
	Если ЕстьКорректировкаСчетаФактуры Тогда
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "СумНДССчФ", СтрокаДанных.СумНДССчФ, "Ч,19,2");
	Иначе
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СумНДССчФ", СтрокаДанных.СумНДССчФ, "Ч,19,2");
	КонецЕсли;
	
	ВыгружатьНулевойАтрибут_РазСтКСчФУм = ЕстьКорректировкаСчетаФактуры И НЕ ЗначениеЗаполнено(СтрокаДанных.РазСтКСчФУв);
	Если ВыгружатьНулевойАтрибут_РазСтКСчФУм Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "РазСтКСчФУм", СтрокаДанных.РазСтКСчФУм, "Ч,19,2");
	Иначе
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "РазСтКСчФУм", СтрокаДанных.РазСтКСчФУм, "Ч,19,2");
	КонецЕсли;
	
	ВыгружатьНулевойАтрибут_РазСтКСчФУв = ЕстьКорректировкаСчетаФактуры И НЕ ЗначениеЗаполнено(СтрокаДанных.РазСтКСчФУм)
	                                    И НЕ ВыгружатьНулевойАтрибут_РазСтКСчФУм;
	Если ВыгружатьНулевойАтрибут_РазСтКСчФУв Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "РазСтКСчФУв", СтрокаДанных.РазСтКСчФУв, "Ч,19,2");
	Иначе
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "РазСтКСчФУв", СтрокаДанных.РазСтКСчФУв, "Ч,19,2");
	КонецЕсли;
	
	ВыгружатьНулевойАтрибут_РазНДСКСчФУм = ВыгружатьНулевойАтрибут_РазСтКСчФУм ИЛИ ЗначениеЗаполнено(СтрокаДанных.РазСтКСчФУм);
	Если ВыгружатьНулевойАтрибут_РазНДСКСчФУм Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "РазНДСКСчФУм", СтрокаДанных.РазНДСКСчФУм, "Ч,19,2");
	Иначе
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "РазНДСКСчФУм", СтрокаДанных.РазНДСКСчФУм, "Ч,19,2");
	КонецЕсли;
	
	ВыгружатьНулевойАтрибут_РазНДСКСчФУв = ВыгружатьНулевойАтрибут_РазСтКСчФУв ИЛИ ЗначениеЗаполнено(СтрокаДанных.РазСтКСчФУв);
	Если ВыгружатьНулевойАтрибут_РазНДСКСчФУв Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "РазНДСКСчФУв", СтрокаДанных.РазНДСКСчФУв, "Ч,19,2");
	Иначе
		КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "РазНДСКСчФУв", СтрокаДанных.РазНДСКСчФУв, "Ч,19,2");
	КонецЕсли;
	
	Для Инд = 0 По СтрокаДанных.КодВидОпер.Количество() - 1 Цикл
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "КодВидОпер");
		КомпоновщикXML_ВывестиЗначениеИЗакрытьУзел(КомпоновщикXML, СтрокаДанных.КодВидОпер[Инд]);
	КонецЦикла;
	
	Если СтрокаДанных.СвПрод <> Неопределено Тогда
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СвПрод");
		
		Если СтрокаДанных.СвПрод.Свойство("ИННФЛ") Тогда
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведИП");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННФЛ", СтрокаДанных.СвПрод.ИННФЛ, "Т,12");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		Иначе
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведЮЛ");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННЮЛ", СтрокаДанных.СвПрод.ИННЮЛ, "Т,10");
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "КПП", СтрокаДанных.СвПрод.КПП, "Т,9");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЕсли;
	
	Если СтрокаДанных.СвКомис <> Неопределено Тогда
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СвКомис");
		
		Если СтрокаДанных.СвКомис.Свойство("ИННФЛ") Тогда
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведИП");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННФЛ", СтрокаДанных.СвКомис.ИННФЛ, "Т,12");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		Иначе
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведЮЛ");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННЮЛ", СтрокаДанных.СвКомис.ИННЮЛ, "Т,10");
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "КПП", СтрокаДанных.СвКомис.КПП, "Т,9");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЕсли;
	
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	
КонецПроцедуры

&НаСервере
Функция ВыгрузкаРаздел12(ПараметрыВыгрузки)
	
	ИмяРаздела = "Раздел12";
	
	ДанныеРаздела = ДанныеРазделаНДСДляВыгрузки(ПараметрыВыгрузки, ИмяРаздела);
	Если ДанныеРаздела = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокиРаздела = ДанныеРаздела.СтрокиРаздела;
	ИтогиРаздела = ДанныеРаздела.ИтогиРаздела;
	
	ИдФайл = СформироватьИдентификаторФайлаВыгрузкиНДС(ПараметрыВыгрузки, "NO_NDS.12");
	ПараметрыВыгрузки.Вставить("ИдФайл" + ИмяРаздела, ИдФайл);
	
	КомпоновщикXML = КомпоновщикXML_Новый();
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "Файл");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИдФайл", ИдФайл);
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ВерсПрог", ПараметрыВыгрузки.ВерсПрог);
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ВерсФорм", "5.05");
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "Документ");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "Индекс", "0000120");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомКорр", ПараметрыВыгрузки.ВидДок);
	
	Если ПараметрыВыгрузки.ВидДок <> "0" Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ПризнСвед12", ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела]);
	КонецЕсли;
	
	Если ПараметрыВыгрузки.ВидДок = "0" ИЛИ ПараметрыВыгрузки["АктуальностьСведений" + ИмяРаздела] = "0" Тогда
		
		Если ПараметрыВыгрузки.ДанныеСегментированы Тогда
			Для Каждого НомерПервойСтрокиСекции Из СтрокиРаздела Цикл
				СтрокиСегментаРаздела = РегламентированнаяОтчетность.СегментДанныхРазделаДекларацииНДС(СтруктураРеквизитовФормы.мСохраненныйДок, ИмяРаздела, НомерПервойСтрокиСекции);
				
				Для Каждого СтрокаДанных ИЗ СтрокиСегментаРаздела Цикл
					ВыгрузитьСтрокуСведенийРаздела12(КомпоновщикXML, СтрокаДанных);
				КонецЦикла;
			КонецЦикла;
			
		Иначе
			Для Каждого СтрокаДанных Из СтрокиРаздела Цикл
				ВыгрузитьСтрокуСведенийРаздела12(КомпоновщикXML, СтрокаДанных);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	
	РезультатВыгрузки = Новый Структура;
	РезультатВыгрузки.Вставить("ИмяФайлаВыгрузки", ИдФайл + ".xml");
	РезультатВыгрузки.Вставить("АдресФайлаВыгрузки", КомпоновщикXML_СсылкаНаВременноеХранилище(КомпоновщикXML));
	РезультатВыгрузки.Вставить("ТипФайлаВыгрузки", "НДС2017" + ИмяРаздела);
	РезультатВыгрузки.Вставить("КодировкаФайлаВыгрузки", "windows-1251");
	
	Возврат РезультатВыгрузки;
	
КонецФункции

&НаСервере
Процедура ВыгрузитьСтрокуСведенийРаздела12(КомпоновщикXML, СтрокаДанных)
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "ВыстСчФ_173.5");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "НомСчФ", СтрокаДанных.НомСчФ, "Т,1000");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ДатаСчФ", СтрокаДанных.ДатаСчФ, "Т,10");
	
	КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, "ОКВ", СтрокаДанных.ОКВ, "Т,3");
	
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СтоимТовБНалВс", СтрокаДанных.СтоимТовБНалВс, "Ч,19,2");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СумНалПокуп",    СтрокаДанных.СумНалПокуп,    "Ч,19,2");
	КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "СтоимТовСНалВс", СтрокаДанных.СтоимТовСНалВс, "Ч,19,2");
	
	Если СтрокаДанных.СвПокуп <> Неопределено Тогда
		КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СвПокуп");
		
		Если СтрокаДанных.СвПокуп.Свойство("ИННФЛ") Тогда
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведИП");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННФЛ", СтрокаДанных.СвПокуп.ИННФЛ, "Т,12");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		Иначе
			КомпоновщикXML_СоздатьУзел(КомпоновщикXML, "СведЮЛ");
			
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "ИННЮЛ", СтрокаДанных.СвПокуп.ИННЮЛ, "Т,10");
			КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, "КПП", СтрокаДанных.СвПокуп.КПП, "Т,9");
			
			КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
		КонецЕсли;
		
		КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	КонецЕсли;
	
	КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML);
	
КонецПроцедуры

&НаСервере
Функция ДанныеРазделаНДСДляВыгрузки(ПараметрыВыгрузки, ИмяРаздела)
	
	ДанныеРаздела = Неопределено;
	
	Если ПараметрыВыгрузки.ДанныеСегментированы Тогда
		СекцииРаздела = СписокСекцийРазделаИзРегистра(ИмяРаздела);
		
		Если СекцииРаздела.Количество() > 0 Тогда
			ДанныеРаздела = Новый Структура();
			ДанныеРаздела.Вставить("СтрокиРаздела", СекцииРаздела.ВыгрузитьКолонку("НомерПервойСтроки"));
			ДанныеРаздела.Вставить("ИтогиРаздела", РегламентированнаяОтчетность.ИтогиРазделаДекларацииНДС(СтруктураРеквизитовФормы.мСохраненныйДок, ИмяРаздела));
		КонецЕсли;
		
	Иначе
		ЗаписьРегистраСведений = РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов.СоздатьМенеджерЗаписи();
		ЗаписьРегистраСведений.РегламентированныйОтчет = СтруктураРеквизитовФормы.мСохраненныйДок;
		ЗаписьРегистраСведений.ВидДополнительногоФайла = "Данные" + ИмяРаздела;
		
		ЗаписьРегистраСведений.Прочитать();
		
		Если ЗначениеЗаполнено(ЗаписьРегистраСведений.ВидДополнительногоФайла) Тогда
			Данные = ЗаписьРегистраСведений.СодержимоеФайла.Получить();
			Если Данные.Записи.Количество() > 0 Тогда
				ДанныеРаздела = Новый Структура();
				ДанныеРаздела.Вставить("СтрокиРаздела", Данные.Записи);
				Если Данные.Свойство("Итоги") Тогда
					ДанныеРаздела.Вставить("ИтогиРаздела", Данные.Итоги);
				Иначе
					ДанныеРаздела.Вставить("ИтогиРаздела", Неопределено);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеРаздела;
	
КонецФункции

&НаСервере
Функция КомпоновщикXML_Новый()
	
	КомпоновщикXML = Новый Структура;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, "windows-1251");
	ЗаписьТекста.Записать("<?xml version=""1.0"" encoding=""windows-1251""?>");
	
	КомпоновщикXML.Вставить("ИмяФайла", ИмяВременногоФайла);
	КомпоновщикXML.Вставить("ЗаписьТекста", ЗаписьТекста);
	КомпоновщикXML.Вставить("СтэкУзлов", Новый Массив);
	КомпоновщикXML.Вставить("НовыйУзелЗакрыт", Истина);
	КомпоновщикXML.Вставить("Табуляция", "");
	
	Возврат КомпоновщикXML;
	
КонецФункции

&НаСервере
Процедура КомпоновщикXML_СоздатьУзел(КомпоновщикXML, ИмяУзла)
	
	Если НЕ КомпоновщикXML.НовыйУзелЗакрыт Тогда
		КомпоновщикXML.ЗаписьТекста.Записать(">");
		КомпоновщикXML.Табуляция = КомпоновщикXML.Табуляция + Символы.Таб;
	КонецЕсли;
	
	КомпоновщикXML.СтэкУзлов.Вставить(0, ИмяУзла);
	
	КомпоновщикXML.ЗаписьТекста.Записать(Символы.ПС + КомпоновщикXML.Табуляция + "<" + ИмяУзла);
	
	КомпоновщикXML.НовыйУзелЗакрыт = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, ИмяАтрибута, ЗначениеАтрибута, ТипАтрибута = "Т")
	
	ОписаниеТипаАтрибута = СтрРазделить(ТипАтрибута, ",");
	
	Если ОписаниеТипаАтрибута[0] = "Д" Тогда
		ПредставлениеЗначения = Формат(ЗначениеАтрибута, "ДФ=dd.MM.yyyy");
		
	ИначеЕсли ОписаниеТипаАтрибута[0] = "Т" Тогда
		ПредставлениеЗначения = СокрЛП(ЗначениеАтрибута);
		ПредставлениеЗначения = ЗаменитьСимволыРазметки(ПредставлениеЗначения);
		Если ОписаниеТипаАтрибута.Количество() >= 2 Тогда
			МаксимальнаяДлина = Число(ОписаниеТипаАтрибута[1]);
			ПредставлениеЗначения = Лев(ПредставлениеЗначения, МаксимальнаяДлина);
		КонецЕсли;
		
	ИначеЕсли ОписаниеТипаАтрибута[0] = "Ч" Тогда
		СтрокаФормата = "ЧРД=.;ЧН=0;ЧГ=;";
		
		Если ОписаниеТипаАтрибута.Количество() >= 2 Тогда
			РазмерностьПолная = Число(ОписаниеТипаАтрибута[1]);
			СтрокаФормата = СтрокаФормата + "ЧЦ=" + Формат(РазмерностьПолная, "ЧГ=") + ";";
		КонецЕсли;
		
		Если ОписаниеТипаАтрибута.Количество() >= 3 Тогда
			РазмерностьДробнойЧасти = Число(ОписаниеТипаАтрибута[2]);
			СтрокаФормата = СтрокаФормата + "ЧДЦ=" + Формат(РазмерностьДробнойЧасти, "ЧГ=") + ";";
		КонецЕсли;
		
		ПредставлениеЗначения = Формат(ЗначениеАтрибута, СтрокаФормата);
		
	Иначе
		ПредставлениеЗначения = СокрЛП(ЗначениеАтрибута);
	КонецЕсли;
	
	КомпоновщикXML.ЗаписьТекста.Записать(" " + ИмяАтрибута + "=""" + ПредставлениеЗначения + """");
	
КонецПроцедуры

&НаСервере
Процедура КомпоновщикXML_ВывестиНеобязательныйАтрибут(КомпоновщикXML, ИмяАтрибута, ЗначениеАтрибута, ТипАтрибута)
	
	Если ЗначениеЗаполнено(ЗначениеАтрибута) Тогда
		КомпоновщикXML_ВывестиАтрибут(КомпоновщикXML, ИмяАтрибута, ЗначениеАтрибута, ТипАтрибута);
	КонецЕсли;
	
КонецПроцедуры

//
&НаСервере
Процедура КомпоновщикXML_ВывестиНеобязательныйМножественныйЭлемент(КомпоновщикXML, ИмяЭлемента, ЗначениеЭлемента, ТипЭлемента)
	
	Если ЗначениеЗаполнено(ЗначениеЭлемента) Тогда
		КомпоновщикXML_ВывестиМножественныйЭлемент(КомпоновщикXML, ИмяЭлемента, ЗначениеЭлемента, ТипЭлемента);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомпоновщикXML_ВывестиМножественныйЭлемент(КомпоновщикXML, ИмяЭлемента, ЗначениеЭлемента, ТипЭлемента)
	
	ОписаниеТипаАтрибута = СтрРазделить(ТипЭлемента, ",");
	
	Если ОписаниеТипаАтрибута[0] = "Т" Тогда
		ПредставлениеЗначения = СокрЛП(ЗначениеЭлемента);
		ПредставлениеЗначения = ЗаменитьСимволыРазметки(ПредставлениеЗначения);
		Если ОписаниеТипаАтрибута.Количество() >= 2 Тогда
			МаксимальнаяДлина = Число(ОписаниеТипаАтрибута[1]);
			ПредставлениеЗначения = Лев(ПредставлениеЗначения, МаксимальнаяДлина);
		КонецЕсли;
	Иначе
		ПредставлениеЗначения = СокрЛП(ЗначениеЭлемента);
	КонецЕсли;
	
	КомпоновщикXML_СоздатьУзел(КомпоновщикXML, ИмяЭлемента);
	КомпоновщикXML_ВывестиЗначениеИЗакрытьУзел(КомпоновщикXML, ПредставлениеЗначения);
	
КонецПроцедуры
//

&НаСервере
Процедура КомпоновщикXML_ВывестиЗначениеИЗакрытьУзел(КомпоновщикXML, Значение)
	
	КомпоновщикXML.ЗаписьТекста.Записать(">" + Значение + "</" + КомпоновщикXML.СтэкУзлов[0] + ">");
	
	КомпоновщикXML.СтэкУзлов.Удалить(0);
	КомпоновщикXML.НовыйУзелЗакрыт = Истина;
	
КонецПроцедуры

&НаСервере
Процедура КомпоновщикXML_ЗакрытьУзел(КомпоновщикXML)
	
	Если КомпоновщикXML.НовыйУзелЗакрыт Тогда
		КомпоновщикXML.Табуляция = Сред(КомпоновщикXML.Табуляция, 2);
		КомпоновщикXML.ЗаписьТекста.Записать(Символы.ПС + КомпоновщикXML.Табуляция + "</" + КомпоновщикXML.СтэкУзлов[0] + ">");
		
	Иначе
		КомпоновщикXML.ЗаписьТекста.Записать("/>");
		КомпоновщикXML.НовыйУзелЗакрыт = Истина;
		
	КонецЕсли;
	
	КомпоновщикXML.СтэкУзлов.Удалить(0);
	
КонецПроцедуры

&НаСервере
Функция КомпоновщикXML_СсылкаНаВременноеХранилище(КомпоновщикXML)
	
	КомпоновщикXML.ЗаписьТекста.Закрыть();
	КомпоновщикXML.ЗаписьТекста = Неопределено;
	
	ФайлВыгрузки = Новый ДвоичныеДанные(КомпоновщикXML.ИмяФайла);
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(ФайлВыгрузки, Новый УникальныйИдентификатор);
	
	УдалитьФайлы(КомпоновщикXML.ИмяФайла);
	
	Возврат АдресВХранилище;
	
КонецФункции

&НаСервере
Функция СформироватьИдентификаторФайлаВыгрузкиНДС(ПараметрыВыгрузки, ПрефиксИмени)
	
	ИдентификаторФайла = ПрефиксИмени
	                   + "_" + ?(ЗначениеЗаполнено(ПараметрыВыгрузки.КодИФНСПосредника), ПараметрыВыгрузки.КодИФНСПосредника, ПараметрыВыгрузки.КодИФНС)
	                   + "_" + ПараметрыВыгрузки.КодИФНС
	                   + "_" + ?(ПараметрыВыгрузки.Свойство("ЭтоПБОЮЛ") И ПараметрыВыгрузки.ЭтоПБОЮЛ, СокрЛП(ПараметрыВыгрузки.ИННОрг), СокрЛП(ПараметрыВыгрузки.ИННОрг) + СокрЛП(ПараметрыВыгрузки.КППОрг))
	                   + "_" + Формат(ТекущаяДатаСеанса(), "ДФ=ггггММдд")
	                   + "_" + Строка(Новый УникальныйИдентификатор);
	
	Возврат ИдентификаторФайла;
	
КонецФункции

&НаСервере
Функция ЗаменитьСимволыРазметки(Знач ПредставлениеЗначения)
	
	ПредставлениеЗначения = СтрЗаменить(ПредставлениеЗначения, "&", "&amp;");
	ПредставлениеЗначения = СтрЗаменить(ПредставлениеЗначения, "<", "&lt;");
	ПредставлениеЗначения = СтрЗаменить(ПредставлениеЗначения, ">", "&gt;");
	ПредставлениеЗначения = СтрЗаменить(ПредставлениеЗначения, """", "&quot;");
	ПредставлениеЗначения = СтрЗаменить(ПредставлениеЗначения, "'", "&apos;");
	
	Возврат ПредставлениеЗначения;
	
КонецФункции

#КонецОбласти

#Область Проверки

&НаКлиенте
Процедура ЗапуститьПроверки() Экспорт
	
	ВывестиПанельВыполненияПроверки();
	
	Если НЕ СтруктураРеквизитовФормы.ОтчетСформированОбработкойКонсолидацияОтчетностиПоНДС Тогда
		
		ПроверитьВозможностьВыгрузкиВФоне();
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗаданияПроверкиВозможностиВыгрузки", 1, Истина);
		
	КонецЕсли;
	
	//ПроверкаКонтрагентовБРО
	ПроверкаКонтрагентовБРОКлиент.ЗапуститьПроверкуКонтрагентовПослеЗаполнения(ЭтотОбъект);
	//Конец ПроверкаКонтрагентовБРО
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы(Команда)
	
	РегламентированнаяОтчетностьКлиент.СохранитьОтчетИОткрытьФормуПрисоединенныеФайлы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущийРаздел(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(
	ЭтаФорма, "ОчиститьТекущийРаздел" + Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
КонецПроцедуры

#Область ПроцедурыИФункцииМеханизмаПроверкиКонтрольныхСоотношений

&НаКлиенте
Процедура Проверить(Команда)
	
	ПоказатьПредупреждение(, НСтр(
	"ru='Проверка контрольных соотношений редакции формы, утвержденной приказом ФНС России
	|от 20.12.2016 № ММВ-7-3/696@, будет реализована в будущих версиях программы.'"));
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаКонтрагентов

&НаСервере
Функция ПолучитьРезультатРаботыФоновогоЗадания() Экспорт
	
	Возврат ПроверкаКонтрагентовБРО.ПолучитьРезультатРаботыФоновогоЗадания(ЭтотОбъект);
	
КонецФункции

&НаСервере
Процедура ПроверитьКонтрагентовВОтчете(Знач ДополнительныеПараметры) Экспорт
	
	ПроверкаКонтрагентовБРО.ПроверитьКонтрагентовВОтчете(ЭтотОбъект, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьРезультатПроверкиКонтрагентов()
	
	ПроверкаКонтрагентовБРОКлиент.ОбработатьРезультатПроверкиКонтрагентовВОтчете(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонтрагентовВОтчетеКоманда(Команда)
	
	ПроверкаКонтрагентовБРОКлиент.ПроверитьКонтрагентовВОтчетеКоманда(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОтображенияПанелиСРезультатамиПроверки

&НаКлиенте
Процедура ВывестиПанельВыполненияПроверки() Экспорт
	
	Элементы.Проверка.ТекущаяСтраница = Элементы.ПроверкаВПроцессеВыполнения;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиРезультатПроверки() Экспорт
	
	Если СтруктураРеквизитовФормы.ОтчетСформированОбработкойКонсолидацияОтчетностиПоНДС Тогда
		ВывестиРезультатПроверкиКонтрагентов();
		Возврат;
	КонецЕсли;
	
	РезультатПроверкиВыгрузки     = РезультатПроверкиВыгрузки();
	РезультатПроверкиКонтрагентов = РезультатПроверкиКонтрагентов();
	
	Если НЕ РезультатПроверкиВыгрузки.ПроверкаВыполнена
		И НЕ РезультатПроверкиКонтрагентов.ПроверкаВыполнена Тогда
		Элементы.Проверка.ТекущаяСтраница = Элементы.ПустаяПанель;
		Возврат;
		
	ИначеЕсли НЕ РезультатПроверкиВыгрузки.ПроверкаВыполнена
		ИЛИ НЕ РезультатПроверкиКонтрагентов.ПроверкаВыполнена Тогда
		ВывестиПанельВыполненияПроверки();
		Возврат;
		
	КонецЕсли;
	
	Если РезультатПроверкиВыгрузки.КоличествоОбнаруженныхОшибок > 0
		И РезультатПроверкиКонтрагентов.КоличествоОбнаруженныхОшибок > 0 Тогда
		
		ТекстРезультатаПроверкиВыгрузки = ФорматированныйТекстРезультатаПроверки(
		РезультатПроверкиВыгрузки.КоличествоОбнаруженныхОшибок, "ПроверкаВыгрузки");
		
		ТекстРезультатаПроверкиКонтрагентов = ФорматированныйТекстРезультатаПроверки(
		РезультатПроверкиКонтрагентов.КоличествоОбнаруженныхОшибок, "ПроверкаКонтрагентов");
		
		ТекстРезультатаПроверкиКонтрагентов[0] = НСтр("ru=', и ';ka=', и '");
		
		ТекстРезультатаПроверки = Новый Массив();
		ТекстРезультатаПроверки.Добавить(ТекстРезультатаПроверкиВыгрузки);
		ТекстРезультатаПроверки.Добавить(ТекстРезультатаПроверкиКонтрагентов);
		
		Элементы.ТекстCРезультатомПроверки.Заголовок = Новый ФорматированнаяСтрока(ТекстРезультатаПроверки);
		
		Элементы.РезультатПроверки.ЦветФона = Новый Цвет(251, 212, 212);
		
	ИначеЕсли РезультатПроверкиВыгрузки.КоличествоОбнаруженныхОшибок = 0
		И РезультатПроверкиКонтрагентов.КоличествоОбнаруженныхОшибок = 0 Тогда
		
		Если РезультатПроверкиКонтрагентов.ОшибкаПодключенияКСервису Тогда
			Элементы.ТекстCРезультатомПроверки.Заголовок = Новый ФорматированнаяСтрока(НСтр("ka='Нет ошибок, препятствующих отправке декларации. Проверка контрагентов сервисом ФНС не выполнена из-за ошибки подключения к сервису.';ru='Нет ошибок, препятствующих отправке декларации. Проверка контрагентов сервисом ФНС не выполнена из-за ошибки подключения к сервису.'"));
			Элементы.РезультатПроверки.ЦветФона = Новый Цвет(255, 255, 192);
			
		Иначе
			Элементы.ТекстCРезультатомПроверки.Заголовок = Новый ФорматированнаяСтрока(НСтр("ka='Нет ошибок, препятствующих отправке декларации, и ошибок проверки контрагентов сервисом ФНС.';ru='Нет ошибок, препятствующих отправке декларации, и ошибок проверки контрагентов сервисом ФНС.'"));
			Элементы.РезультатПроверки.ЦветФона = Новый Цвет(215, 240, 199);
			
		КонецЕсли;
		
	ИначеЕсли РезультатПроверкиВыгрузки.КоличествоОбнаруженныхОшибок = 0
	        И РезультатПроверкиКонтрагентов.КоличествоОбнаруженныхОшибок > 0 Тогда
		ТекстРезультатаПроверкиКонтрагентов = ФорматированныйТекстРезультатаПроверки(
		РезультатПроверкиКонтрагентов.КоличествоОбнаруженныхОшибок, "ПроверкаКонтрагентов");
		
		ТекстРезультатаПроверки = Новый Массив();
		ТекстРезультатаПроверки.Добавить(НСтр("ka='Нет ошибок, препятствующих отправке декларации.';ru='Нет ошибок, препятствующих отправке декларации.'"));
		ТекстРезультатаПроверки.Добавить(ТекстРезультатаПроверкиКонтрагентов);
		
		Элементы.ТекстCРезультатомПроверки.Заголовок = Новый ФорматированнаяСтрока(ТекстРезультатаПроверки);
		
		Элементы.РезультатПроверки.ЦветФона = Новый Цвет(255, 255, 192);
		
	ИначеЕсли РезультатПроверкиВыгрузки.КоличествоОбнаруженныхОшибок = 0
	        И РезультатПроверкиКонтрагентов.КоличествоОбнаруженныхОшибок > 0 Тогда
		ТекстРезультатаПроверкиКонтрагентов = ФорматированныйТекстРезультатаПроверки(
		РезультатПроверкиКонтрагентов.КоличествоОбнаруженныхОшибок, "ПроверкаКонтрагентов");
		
		ТекстРезультатаПроверки = Новый Массив();
		ТекстРезультатаПроверки.Добавить(НСтр("ru='Нет ошибок, препятствующих отправке декларации. ';ka='Нет ошибок, препятствующих отправке декларации. '"));
		ТекстРезультатаПроверки.Добавить(ТекстРезультатаПроверкиКонтрагентов);
		
		Элементы.ТекстCРезультатомПроверки.Заголовок = Новый ФорматированнаяСтрока(ТекстРезультатаПроверки);
		
		Элементы.РезультатПроверки.ЦветФона = Новый Цвет(255, 255, 192);
		
	ИначеЕсли РезультатПроверкиВыгрузки.КоличествоОбнаруженныхОшибок > 0
	        И РезультатПроверкиКонтрагентов.КоличествоОбнаруженныхОшибок > 0 Тогда
		ТекстРезультатаПроверкиВыгрузки     = ФорматированныйТекстРезультатаПроверки(
		РезультатПроверкиВыгрузки.КоличествоОбнаруженныхОшибок, "ПроверкаВыгрузки");
		
		ТекстРезультатаПроверкиКонтрагентов = ФорматированныйТекстРезультатаПроверки(
		РезультатПроверкиКонтрагентов.КоличествоОбнаруженныхОшибок, "ПроверкаКонтрагентов");
		
		ТекстРезультатаПроверкиКонтрагентов[0] = НСтр("ru=', и ';ka=', и '");
		
		ТекстРезультатаПроверки = Новый Массив();
		ТекстРезультатаПроверки.Добавить(ТекстРезультатаПроверкиВыгрузки);
		ТекстРезультатаПроверки.Добавить(ТекстРезультатаПроверкиКонтрагентов);
		
		Элементы.ТекстCРезультатомПроверки.Заголовок = Новый ФорматированнаяСтрока(ТекстРезультатаПроверки);
		
		Элементы.РезультатПроверки.ЦветФона = Новый Цвет(251, 212, 212);
		
	ИначеЕсли РезультатПроверкиВыгрузки.КоличествоОбнаруженныхОшибок > 0
	        И РезультатПроверкиКонтрагентов.КоличествоОбнаруженныхОшибок = 0 Тогда
		Если РезультатПроверкиКонтрагентов.ОшибкаПодключенияКСервису Тогда
			
			ТекстРезультатаПроверкиВыгрузки = ФорматированныйТекстРезультатаПроверки(
			РезультатПроверкиВыгрузки.КоличествоОбнаруженныхОшибок, "ПроверкаВыгрузки");
			
			ТекстРезультатаПроверки = Новый Массив();
			ТекстРезультатаПроверки.Добавить(ТекстРезультатаПроверкиВыгрузки);
			ТекстРезультатаПроверки.Добавить(НСтр("ka='. Проверка контрагентов сервисом ФНС не выполнена из-за ошибки подключения к сервису.';ru='. Проверка контрагентов сервисом ФНС не выполнена из-за ошибки подключения к сервису.'"));
			
			Элементы.ТекстCРезультатомПроверки.Заголовок = Новый ФорматированнаяСтрока(ТекстРезультатаПроверки);
			
		Иначе
			
			ТекстРезультатаПроверкиВыгрузки = ФорматированныйТекстРезультатаПроверки(
			РезультатПроверкиВыгрузки.КоличествоОбнаруженныхОшибок, "ПроверкаВыгрузки");
			
			ТекстРезультатаПроверки = Новый Массив();
			ТекстРезультатаПроверки.Добавить(ТекстРезультатаПроверкиВыгрузки);
			ТекстРезультатаПроверки.Добавить(НСтр("ka='. Нет ошибок проверки контрагентов сервисом ФНС.';ru='. Нет ошибок проверки контрагентов сервисом ФНС.'"));
			
			Элементы.ТекстCРезультатомПроверки.Заголовок = Новый ФорматированнаяСтрока(ТекстРезультатаПроверки);
			
		КонецЕсли;
		
		Элементы.РезультатПроверки.ЦветФона = Новый Цвет(251, 212, 212);
		
	КонецЕсли;
	
	Элементы.Проверка.ТекущаяСтраница = Элементы.РезультатПроверки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиРезультатПроверкиКонтрагентов()
	
	РезультатПроверкиКонтрагентов = РезультатПроверкиКонтрагентов();
	
	Если РезультатПроверкиКонтрагентов.КоличествоОбнаруженныхОшибок > 0 Тогда
		
		ТекстРезультатаПроверкиКонтрагентов = ФорматированныйТекстРезультатаПроверки(
		РезультатПроверкиКонтрагентов.КоличествоОбнаруженныхОшибок, "ПроверкаКонтрагентов");
		
		ТекстРезультатаПроверки = Новый Массив();
		ТекстРезультатаПроверки.Добавить(ТекстРезультатаПроверкиКонтрагентов);
		
		Элементы.ТекстCРезультатомПроверки.Заголовок = Новый ФорматированнаяСтрока(ТекстРезультатаПроверки);
		
		Элементы.РезультатПроверки.ЦветФона = Новый Цвет(255, 255, 192);
		
	ИначеЕсли РезультатПроверкиКонтрагентов.КоличествоОбнаруженныхОшибок = 0 Тогда
		
		Если РезультатПроверкиКонтрагентов.ОшибкаПодключенияКСервису Тогда
			
			Элементы.ТекстCРезультатомПроверки.Заголовок = Новый ФорматированнаяСтрока(НСтр("ka='Проверка контрагентов сервисом ФНС не выполнена из-за ошибки подключения к сервису.';ru='Проверка контрагентов сервисом ФНС не выполнена из-за ошибки подключения к сервису.'"));
			
			Элементы.РезультатПроверки.ЦветФона = Новый Цвет(255, 255, 192);
			
		Иначе
			
			Элементы.ТекстCРезультатомПроверки.Заголовок = Новый ФорматированнаяСтрока(НСтр("ka='Нет ошибок проверки контрагентов сервисом ФНС.';ru='Нет ошибок проверки контрагентов сервисом ФНС.'"));
			
			Элементы.РезультатПроверки.ЦветФона = Новый Цвет(215, 240, 199);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Проверка.ТекущаяСтраница = Элементы.РезультатПроверки;
	
КонецПроцедуры

&НаКлиенте
Функция ПанельСРезультатамиПроверкиОтображена() Экспорт
	
	Возврат ?(Элементы.Проверка.ТекущаяСтраница = Элементы.ПустаяПанель, Ложь, Истина);
	
КонецФункции

&НаКлиенте
Функция РезультатПроверкиВыгрузки()
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("ПроверкаВыполнена", Ложь);
	РезультатПроверки.Вставить("КоличествоОбнаруженныхОшибок", 0);
	
	Если СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Истина Тогда
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.АдресХранилищаПроверкиВыгрузки) Тогда
			
			РезультатВыполненияЗадания = ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы.АдресХранилищаПроверкиВыгрузки);
			
			Если ЗначениеЗаполнено(РезультатВыполненияЗадания) Тогда
				
				РезультатПроверки = Новый Структура;
				РезультатПроверки.Вставить("ПроверкаВыполнена", Истина);
				РезультатПроверки.Вставить("КоличествоОбнаруженныхОшибок", РезультатВыполненияЗадания.КоличествоОшибок);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Функция РезультатПроверкиКонтрагентов()
	
	Возврат ПроверкаКонтрагентовБРОКлиентСервер.РезультатПроверкиКонтрагентов(ЭтотОбъект);
	
КонецФункции

&НаКлиенте
Функция ФорматированныйТекстРезультатаПроверки(КолвоОшибок, НаимОперации)
	
	ТекстРезультатаПроверки = Новый Массив();
	
	Если Прав(Строка(КолвоОшибок), 1) = "1"
		И НЕ КолвоОшибок = 11 Тогда
		
		ТекстРезультатаПроверки.Добавить(НСтр("ru='Обнаружена ';ka='Обнаружена '"));
		
		Если НаимОперации = "ПроверкаВыгрузки" Тогда
			
			ТекстРезультатаПроверки.Добавить(Новый ФорматированнаяСтрока(Строка(КолвоОшибок)
			+ НСтр("ka=' ошибка';ru=' ошибка'"), , , , "ПоказатьОшибкиПроверкиВыгрузки"));
			
			ТекстРезультатаПроверки.Добавить(НСтр("ka=', препятствующая отправке декларации';ru=', препятствующая отправке декларации'"));
			
		ИначеЕсли НаимОперации = "ПроверкаКС" Тогда
			
			ТекстРезультатаПроверки.Добавить(Новый ФорматированнаяСтрока(Строка(КолвоОшибок)
			+ НСтр("ka=' ошибка';ru=' ошибка'"), , , , "ПоказатьОшибкиПроверкиКС"));
			
			ТекстРезультатаПроверки.Добавить(НСтр("ka=' в контрольных соотношениях';ru=' в контрольных соотношениях'"));
			
		ИначеЕсли НаимОперации = "ПроверкаКонтрагентов" Тогда
			
			ТекстРезультатаПроверки.Добавить(Новый ФорматированнаяСтрока(Строка(КолвоОшибок)
			+ НСтр("ka=' ошибка';ru=' ошибка'"), , , , "ПоказатьОшибкиПроверкиКонтрагентов"));
			
			ТекстРезультатаПроверки.Добавить(НСтр("ka=' проверки контрагентов сервисом ФНС.';ru=' проверки контрагентов сервисом ФНС.'"));
			
		КонецЕсли;
		
	ИначеЕсли (Прав(Строка(КолвоОшибок), 1) = "2"
		ИЛИ Прав(Строка(КолвоОшибок), 1) = "3"
		ИЛИ Прав(Строка(КолвоОшибок), 1) = "4")
		И НЕ КолвоОшибок = 12 И НЕ КолвоОшибок = 13 И НЕ КолвоОшибок = 14 Тогда
		
		ТекстРезультатаПроверки.Добавить(НСтр("ru='Обнаружено ';ka='Обнаружено '"));
		
		Если НаимОперации = "ПроверкаВыгрузки" Тогда
			
			ТекстРезультатаПроверки.Добавить(Новый ФорматированнаяСтрока(Строка(КолвоОшибок)
			+ НСтр("ka=' ошибки';ru=' ошибки'"), , , , "ПоказатьОшибкиПроверкиВыгрузки"));
			
			ТекстРезультатаПроверки.Добавить(НСтр("ka=', препятствующие отправке декларации';ru=', препятствующие отправке декларации'"));
			
		ИначеЕсли НаимОперации = "ПроверкаКС" Тогда
			
			ТекстРезультатаПроверки.Добавить(Новый ФорматированнаяСтрока(Строка(КолвоОшибок)
			+ НСтр("ka=' ошибки';ru=' ошибки'"), , , , "ПоказатьОшибкиПроверкиКС"));
			
			ТекстРезультатаПроверки.Добавить(НСтр("ka=' в контрольных соотношениях';ru=' в контрольных соотношениях'"));
			
		ИначеЕсли НаимОперации = "ПроверкаКонтрагентов" Тогда
			
			ТекстРезультатаПроверки.Добавить(Новый ФорматированнаяСтрока(Строка(КолвоОшибок)
			+ НСтр("ka=' ошибки';ru=' ошибки'"), , , , "ПоказатьОшибкиПроверкиКонтрагентов"));
			
			ТекстРезультатаПроверки.Добавить(НСтр("ka=' проверки контрагентов сервисом ФНС.';ru=' проверки контрагентов сервисом ФНС.'"));
			
		КонецЕсли;
		
	Иначе
		
		ТекстРезультатаПроверки.Добавить(НСтр("ru='Обнаружено ';ka='Обнаружено '"));
		
		Если НаимОперации = "ПроверкаВыгрузки" Тогда
			
			ТекстРезультатаПроверки.Добавить(Новый ФорматированнаяСтрока(Строка(КолвоОшибок)
			+ НСтр("ka=' ошибок';ru=' ошибок'"), , , , "ПоказатьОшибкиПроверкиВыгрузки"));
			
			ТекстРезультатаПроверки.Добавить(НСтр("ka=', препятствующих отправке декларации';ru=', препятствующих отправке декларации'"));
			
		ИначеЕсли НаимОперации = "ПроверкаКС" Тогда
			
			ТекстРезультатаПроверки.Добавить(Новый ФорматированнаяСтрока(Строка(КолвоОшибок)
			+ НСтр("ka=' ошибок';ru=' ошибок'"), , , , "ПоказатьОшибкиПроверкиКС"));
			
			ТекстРезультатаПроверки.Добавить(НСтр("ka=' в контрольных соотношениях';ru=' в контрольных соотношениях'"));
			
		ИначеЕсли НаимОперации = "ПроверкаКонтрагентов" Тогда
			
			ТекстРезультатаПроверки.Добавить(Новый ФорматированнаяСтрока(Строка(КолвоОшибок)
			+ НСтр("ka=' ошибок';ru=' ошибок'"), , , , "ПоказатьОшибкиПроверкиКонтрагентов"));
			
			ТекстРезультатаПроверки.Добавить(НСтр("ka=' проверки контрагентов сервисом ФНС.';ru=' проверки контрагентов сервисом ФНС.'"));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекстРезультатаПроверки;
	
КонецФункции

&НаКлиенте
Процедура ТекстCРезультатомПроверкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПоказатьОшибкиПроверкиВыгрузки" Тогда
		
		Если СтруктураРеквизитовФормы.Свойство("АдресХранилищаПроверкиВыгрузки") Тогда
			
			РезультатПроверкиВыгрузки = ПолучитьИзВременногоХранилища(
			СтруктураРеквизитовФормы.АдресХранилищаПроверкиВыгрузки);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("СохраненныйОтчет", СтруктураРеквизитовФормы.мСохраненныйДок);
			ПараметрыФормы.Вставить("ПредставлениеОшибок", РезультатПроверкиВыгрузки.ПредставлениеОшибок);
			ПараметрыФормы.Вставить("НазваниеДекларации", Заголовок);
			
			Если РезультатПроверкиВыгрузки.КоличествоОшибок = 0 Тогда
				ПоказатьПредупреждение( , НСтр("ka='Ошибок не обнаружено!';ru='Ошибок не обнаружено!'"));
			Иначе
				ФормаНавигацииПоОшибкам = ПолучитьФорму(
				"Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаСообщенийОбОшибках",
				ПараметрыФормы, ЭтаФорма, Новый УникальныйИдентификатор);
				ФормаНавигацииПоОшибкам.Открыть();
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПоказатьОшибкиПроверкиКС" Тогда
	
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПоказатьОшибкиПроверкиКонтрагентов" Тогда
		
		ПроверкаКонтрагентовБРОКлиент.ОткрытьОтчетПоНекорректнымКонтрагентам(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ЗаполненоНовымАлгоритмом() Экспорт
	
	Возврат СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Истина;
	
КонецФункции

&НаСервере
Процедура ПроверитьВозможностьВыгрузкиВФоне()
	
	РегламентированныйОтчет = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	ШаблоныОшибок = Отчеты.РегламентированныйОтчетНДС.ПолучитьМакет("ШаблоныСообщенийОбОшибках2017Кв1");
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПараметрыФоновогоЗадания = Новый Массив;
	ПараметрыФоновогоЗадания.Добавить(РегламентированныйОтчет);
	ПараметрыФоновогоЗадания.Добавить(ШаблоныОшибок);
	ПараметрыФоновогоЗадания.Добавить(Заголовок);
	ПараметрыФоновогоЗадания.Добавить(АдресХранилища);
	
	НаименованиеЗадания = НСтр("ka='Проверка возможности формирования электронного представления';ru='Проверка возможности формирования электронного представления'");
	Задание = ФоновыеЗадания.Выполнить("РегламентированнаяОтчетностьПроверкаНДС.ВыявитьОшибкиЗаполненияПрепятствующиеФормированиюЭлектронногоПредставления_ФормаОтчета2017Кв1", ПараметрыФоновогоЗадания, , НаименованиеЗадания);
	ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	
	ПараметрыЗаданияПроверкиВыгрузки = Новый Структура;
	ПараметрыЗаданияПроверкиВыгрузки.Вставить("МаксимальныйИнтервал", 20);
	ПараметрыЗаданияПроверкиВыгрузки.Вставить("ТекущийИнтервал", 1);
	ПараметрыЗаданияПроверкиВыгрузки.Вставить("КоэффициентУвеличенияИнтервала", 1.618);
	ПараметрыЗаданияПроверкиВыгрузки.Вставить("ИдентификаторЗадания", ИдентификаторЗадания);
	
	СтруктураРеквизитовФормы.Вставить("АдресХранилищаПроверкиВыгрузки", АдресХранилища);
	СтруктураРеквизитовФормы.Вставить("ПараметрыЗаданияПроверкиВыгрузки", ПараметрыЗаданияПроверкиВыгрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗаданияПроверкиВозможностиВыгрузки()
	
	Если СтруктураРеквизитовФормы.Свойство("ПараметрыЗаданияПроверкиВыгрузки") Тогда
		
		СостояниеЗадания = СостояниеФоновогоЗадания(СтруктураРеквизитовФормы.ПараметрыЗаданияПроверкиВыгрузки.ИдентификаторЗадания);
		
		Если СостояниеЗадания = "Завершено" Тогда
			
			ВывестиРезультатПроверки();
			
		ИначеЕсли СостояниеЗадания = "Активно" Тогда
			ТекущийИнтервал = СтруктураРеквизитовФормы.ПараметрыЗаданияПроверкиВыгрузки.ТекущийИнтервал;
			МаксимальныйИнтервал = СтруктураРеквизитовФормы.ПараметрыЗаданияПроверкиВыгрузки.МаксимальныйИнтервал;
			КоэффициентУвеличенияИнтервала = СтруктураРеквизитовФормы.ПараметрыЗаданияПроверкиВыгрузки.КоэффициентУвеличенияИнтервала;
			
			ИнтервалОжидания = Мин(ТекущийИнтервал * КоэффициентУвеличенияИнтервала, МаксимальныйИнтервал);
			СтруктураРеквизитовФормы.ПараметрыЗаданияПроверкиВыгрузки.ТекущийИнтервал = ИнтервалОжидания;
			
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗаданияПроверкиВозможностиВыгрузки", ИнтервалОжидания, Истина);
		Иначе
			ВызватьИсключение "Ошибка выполнения фонового задания проверки выгрузки";
		КонецЕсли;
	Иначе
		ВызватьИсключение "Ошибка выполнения фонового задания проверки выгрузки";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СостояниеФоновогоЗадания(ИдентификаторФоновогоЗадания)
	
	Задание = НайтиЗаданиеПоИдентификатору(ИдентификаторФоновогоЗадания);
	
	Если Задание <> Неопределено Тогда
		Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			Возврат "Активно";
		ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			Возврат "Завершено";
		ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			Возврат "ЗавершеноАварийно";
		ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			Возврат "Отменено";
		КонецЕсли;
	КонецЕсли;
	
	Возврат "Неопределено";
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиЗаданиеПоИдентификатору(Знач ИдентификаторФоновогоЗадания)
	
	Если ТипЗнч(ИдентификаторФоновогоЗадания) = Тип("Строка") Тогда
		ИдентификаторЗадания = Новый УникальныйИдентификатор(ИдентификаторФоновогоЗадания);
	КонецЕсли;
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФоновогоЗадания);
	
	Возврат Задание;
	
КонецФункции

&НаСервере
Процедура ЗаписатьРезультатПроверкиВыгрузки()
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.АдресХранилищаПроверкиВыгрузки) Тогда
		
		Результат = ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы.АдресХранилищаПроверкиВыгрузки);
		
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РегламентированныйОтчет", СтруктураРеквизитовФормы.мСохраненныйДок);
		ПараметрыЗаписи.Вставить("ВидДополнительногоФайла", "РезультатПроверкиВыгрузки.mxl");
		ПараметрыЗаписи.Вставить("Данные",                  Результат);
		
		РегламентированнаяОтчетность.ЗаписатьДанныеВРегистрДополнительныхФайлов(ПараметрыЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьРезультатПроверкиВыгрузки()
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РегламентированныйОтчет", СтруктураРеквизитовФормы.мСохраненныйДок);
	ПараметрыЗаписи.Вставить("ВидДополнительногоФайла", "РезультатПроверкиВыгрузки.mxl");
	
	Данные = РегламентированнаяОтчетность.ДанныеРегистраДополнительныхФайлов(ПараметрыЗаписи);
	
	СтруктураРеквизитовФормы.АдресХранилищаПроверкиВыгрузки = ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеЭтапаНажатие(Элемент)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтатусОтчета", СтруктураРеквизитовФормы.СтатусОтчета);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборИзСпискаСтатусаОтчетаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	СтатусыОтчета = Новый СписокЗначений;
	СтатусыОтчета.Добавить("Не отправлено");
	СтатусыОтчета.Добавить("Сдано");
	
	ПоказатьВыборИзСписка(ОписаниеОповещения, СтатусыОтчета, Элементы.НаименованиеЭтапа, ?(СтруктураРеквизитовФормы.СтатусОтчета = "Не отправлено", 0, 1));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборИзСпискаСтатусаОтчетаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		
		СтруктураРеквизитовФормы.СтатусОтчета = ВыбранныйЭлемент.Значение;
		
		Элементы.НаименованиеЭтапа.Заголовок = СтруктураРеквизитовФормы.СтатусОтчета;
		
		Если ДополнительныеПараметры.СтатусОтчета = "Сдано"
			И СтруктураРеквизитовФормы.СтатусОтчета = "Сдано" Тогда
			
			СохранитьНаКлиенте();
			
		Иначе
			
			СохранитьНаКлиенте(, , Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполненоСохранениеФайлаВыгрузки" Тогда
		
		Если НЕ СтруктураРеквизитовФормы.ПодключенДокументооборотСКонтролирующимОрганом
		   И НЕ СтруктураРеквизитовФормы.СтатусОтчета = "Сдано" Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросИзменитьСтатусОтчетаЗавершение", ЭтотОбъект);
			
			ТекстВопроса = НСтр("ka='Декларация выгружена, рекомендуется установить для нее состояние ""Сдано""."
"Для сданной декларации редактирование запрещено. Состояние можно установить"
"или снять вручную в форме декларации."
""
"Установить для декларации состояние ""Сдано""?';ru='Декларация выгружена, рекомендуется установить для нее состояние ""Сдано""."
"Для сданной декларации редактирование запрещено. Состояние можно установить"
"или снять вручную в форме декларации."
""
"Установить для декларации состояние ""Сдано""?'");
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросИзменитьСтатусОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		СтруктураРеквизитовФормы.СтатусОтчета = "Сдано";
		
		Элементы.НаименованиеЭтапа.Заголовок = СтруктураРеквизитовФормы.СтатусОтчета;
		
		СохранитьНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбъектОтчета(ЭтаФормаИмя) Экспорт
	
	Если мОбъектОтчета = Неопределено Тогда 
		мОбъектОтчета = РегламентированнаяОтчетностьВызовСервера.ОбъектОтчета(ЭтаФормаИмя);
	КонецЕсли;
	
	Возврат мОбъектОтчета;
	
КонецФункции