
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
#Если ВебКлиент Тогда
	ПоказатьПредупреждение(, НСтр("ka='ვებ-კლიენტში პროქსი-სერვერის პარამეტრების მიცემა აუცილებელია ბროუზერის გამართვებში.';ru='В веб-клиенте параметры прокси-сервера необходимо задавать в настройках браузера.';en='From the Web client proxy server settings must be set in the browser settings.'"));
	Возврат;
#КонецЕсли
	
	ОткрытьФорму("ОбщаяФорма.ПараметрыПроксиСервера", Новый Структура("НастройкаПроксиНаКлиенте", Истина));
	
КонецПроцедуры

#КонецОбласти
