
////////////////////////////////////////////////////////////////////////////////
// ПОДПИСКА НА СОБЫТИЯ

// Переопределяет стандартное представление ссылки.
//
Процедура ПолучитьПредставлениеПолейДокумента(Источник, Поля, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Ссылка");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("Проведен");
	Поля.Добавить("ПометкаУдаления");
	
КонецПроцедуры // ПолучитьПредставлениеДокумента()

// Переопределяет стандартное представление ссылки.
//
Процедура ПолучитьПредставлениеПолейДокументаТолькоЗапись(Источник, Поля, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Ссылка");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ПометкаУдаления");
	
КонецПроцедуры // ПолучитьПредставлениеДокумента()

// Переопределяет стандартное представление ссылки.
//
Процедура ПолучитьПредставлениеДокумента(Источник, Данные, Представление, СтандартнаяОбработка) Экспорт
	
	Если Данные.Номер = Null
		ИЛИ Не ЗначениеЗаполнено(Данные.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Состояние = "";
	Если Данные.ПометкаУдаления Тогда
		Состояние = НСтр("ka='(წაშლილია)';ru='(удален)';en='(Deleted)'");
	ИначеЕсли Данные.Свойство("Проведен") И НЕ Данные.Проведен Тогда
		Состояние = НСтр("ka='(არ არის გატარებული)';ru='(не проведен)';en='(Not done)'");
	КонецЕсли;
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ka='%1 %2 %3 %4-ის';ru='%1 %2 от %3 %4';en='%1 %2 from %3 %4'"),
		Данные.Ссылка.Метаданные().Представление(),
		?(Данные.Свойство("Номер"), ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Данные.Номер, Истина, Истина), ""),
		Формат(Данные.Дата, "ДЛФ=D"),
		Состояние);
	
КонецПроцедуры // ПолучитьПредставлениеДокумента()

// Вызывается перед записью любого документа.
//
Процедура ПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Хозяйственные операции
	ДокументМетаданные = Источник.Метаданные();
	Если ДокументМетаданные.Реквизиты.Найти("ХозяйственнаяОперация") <> Неопределено Тогда
		Если ДокументМетаданные.Реквизиты.Найти("ВидОперации") <> Неопределено Тогда
			Источник.ХозяйственнаяОперация = ХозяйственныеОперацииСерверПовтИсп.ПолучитьХозяйственнуюОперациюПоВидуОперацииДокумента(Источник.ВидОперации, Источник.Ссылка);
		ИначеЕсли ДокументМетаданные.Реквизиты.Найти("ВидДоговора") <> Неопределено Тогда
			Источник.ХозяйственнаяОперация = ХозяйственныеОперацииСерверПовтИсп.ПолучитьХозяйственнуюОперациюПоВидуОперацииДокумента(Источник.ВидДоговора, Источник.Ссылка);
		Иначе
			Источник.ХозяйственнаяОперация = ХозяйственныеОперацииСерверПовтИсп.ПолучитьХозяйственнуюОперациюПоВидуОперацииДокумента(ДокументМетаданные.Имя, Источник.Ссылка);
		КонецЕсли;
	КонецЕсли;
	// Конец Хозяйственные операции
	
	УправлениеНебольшойФирмойСобытияПереопределяемый.ПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДолгиКонтрагента(ТекущийКонтрагент) Экспорт
	
	// Инициализация параметров.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	МассивОрганизаций = РезультатЗапроса.ВыгрузитьКолонку("Организация");
	
	МассивТиповРасчетов = Новый Массив;
	МассивТиповРасчетов.Добавить(Перечисления.ТипыРасчетов.Аванс);
	МассивТиповРасчетов.Добавить(Перечисления.ТипыРасчетов.Долг);
    // Получить данные контрагента.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток < 0
	|				И РасчетыСПокупателямиОстатки.СуммаОстаток > 0
	|			ТОГДА -1 * РасчетыСПоставщикамиОстатки.СуммаОстаток + РасчетыСПокупателямиОстатки.СуммаОстаток
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток < 0
	|			ТОГДА -РасчетыСПоставщикамиОстатки.СуммаОстаток
	|		КОГДА РасчетыСПокупателямиОстатки.СуммаОстаток > 0
	|			ТОГДА РасчетыСПокупателямиОстатки.СуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДолгКонтрагента,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток > 0
	|				И РасчетыСПокупателямиОстатки.СуммаОстаток < 0
	|			ТОГДА -1 * РасчетыСПокупателямиОстатки.СуммаОстаток + РасчетыСПоставщикамиОстатки.СуммаОстаток
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток > 0
	|			ТОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток
	|		КОГДА РасчетыСПокупателямиОстатки.СуммаОстаток < 0
	|			ТОГДА -РасчетыСПокупателямиОстатки.СуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НашДолг
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|			,
	|			Организация В (&СписокОрганизаций)
	|				И ТипРасчетов В (&СписокТиповРасчетов)
	|				И Контрагент = &Контрагент) КАК РасчетыСПоставщикамиОстатки,
	|	РегистрНакопления.РасчетыСПокупателями.Остатки(
	|			,
	|			Организация В (&СписокОрганизаций)
	|				И ТипРасчетов В (&СписокТиповРасчетов)
	|				И Контрагент = &Контрагент) КАК РасчетыСПокупателямиОстатки";
	
	Запрос.УстановитьПараметр("СписокОрганизаций", МассивОрганизаций);
	Запрос.УстановитьПараметр("СписокТиповРасчетов", МассивТиповРасчетов);
	Запрос.УстановитьПараметр("Контрагент", ТекущийКонтрагент);
	//Запрос.УстановитьПараметр("КонтактноеЛицо", ?(КонтактноеЛицо = Неопределено, ТекущийКонтрагент.КонтактноеЛицо, КонтактноеЛицо));
	
	Результат = Запрос.Выполнить();
	
	ВыборкаКИ = Результат.Выбрать();
	
	СтруктураОтвета = Новый Структура;
	Если ВыборкаКИ.Следующий() Тогда
		СтруктураОтвета.Вставить("ИнформацияНашДолг", ВыборкаКИ.НашДолг); 
		СтруктураОтвета.Вставить("ИнформацияДолгКонтрагента", ВыборкаКИ.ДолгКонтрагента);
	Иначе
		СтруктураОтвета.Вставить("ИнформацияНашДолг", 0); 
		СтруктураОтвета.Вставить("ИнформацияДолгКонтрагента", 0);
	КонецЕсли;		
	
	Возврат СтруктураОтвета;
	
КонецФункции