
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//giga
	Если НЕ ЗначениеЗаполнено(Объект.Статус) Тогда
		Объект.Статус = Перечисления.СтатусыЗаказаНаПеремещения.НаРассмотрении
	КонецЕсли;
	//giga
	
	ОбщегоНазначенияПереопределяемый.УстановитьДополнительноеПоведениеСтандартныхКнопокТЧЗапасы(ЭтаФорма);// Kuzmich, 07.08.2019, Дополнительные инструменты в табличных частях документов движения товаров
	//Паганини_
	ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах");
	Если ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах Тогда
		ПравоИзмененияЗаказовНаПеремещения	= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(, "ПравоИзмененияЗаказовНаПеремещения");
		ОсновнойСкладПользователя			= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(, "ОсновнойСклад");
		УстановитьВидимостьИДоступность();
	Иначе
		Элементы.ЗапасыЗаполнить.Видимость 	= Ложь;
	КонецЕсли;
	//_Паганини
	
	//+++ Дмгг
	//+++ Если включена настройка то пользователь может редактировать только документы своего основного склада
	Пользователь = Пользователи.ТекущийПользователь();
	ИспользоватьФильтр = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ФильтрСкладскихДокументовПоОсновномуСкладу");
	Если НЕ ЗначениеЗаполнено(ОсновнойСкладПользователя) Тогда 
		ОсновнойСкладПользователя			= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(, "ОсновнойСклад");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И ИспользоватьФильтр
		И Объект.СтруктурнаяЕдиница <> ОсновнойСкладПользователя Тогда 
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Элемент.СписокВыбора.Очистить();
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияНачалоВыбораИзСписка(СтрокаТабличнойЧасти.Номенклатура);
		
	Для каждого ЭлСписка Из СтруктураДанные.СписокЕдиницаИзмерения Цикл
		Элемент.СписокВыбора.Добавить(ЭлСписка.Значение, ЭлСписка.Представление);
	КонецЦикла;
КонецПроцедуры
&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеЕдиницаИзмеренияНачалоВыбораИзСписка(Номенклатура)
	
	СписокЕдиницаИзмерения = Новый СписокЗначений();
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить("СписокЕдиницаИзмерения", СписокЕдиницаИзмерения);
	
	СписокЕдиницаИзмерения.Добавить(Номенклатура.ЕдиницаИзмерения, Номенклатура.ЕдиницаИзмерения.Наименование + " (ед. хранения)");
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить(Номенклатура);
	МассивОтбора.Добавить(Номенклатура.НоменклатурнаяГруппа);
	
	Родитель = Номенклатура.НоменклатурнаяГруппа.Родитель;
	
	Пока Истина Цикл
		Если НЕ ЗначениеЗаполнено(Родитель) Тогда
			Прервать;
		Иначе
			МассивОтбора.Добавить(Родитель);
		КонецЕсли;
		Родитель = Родитель.Родитель;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕдиницыИзмерения.Ссылка КАК ЕдиницаИзмерения
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Владелец В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", МассивОтбора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокЕдиницаИзмерения.Добавить(Выборка.ЕдиницаИзмерения);
	КонецЦикла;
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	ТекДанные = Элементы.Запасы.ТекущиеДанные;
	ТекДанные.ЕдиницаИзмерения = РС_ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекДанные.Номенклатура, "ЕдиницаИзмерения");
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		Элементы.Запасы.ТекущиеДанные.Количество = 1;
	КонецЕсли;
	
	//++Lazare 24-12-2021
	Если НоваяСтрока или Копирование Тогда
		Элемент.ТекущиеДанные.Проект = Объект.Проект;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьУтвержден(Команда)
	Для Каждого СтрокаТЧ Из Объект.Запасы Цикл
		СтрокаТЧ.УтвержденноеКоличество = СтрокаТЧ.Количество;
	КонецЦикла;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУтвержден(Команда)
	Для Каждого СтрокаТЧ Из Объект.Запасы Цикл
		СтрокаТЧ.УтвержденноеКоличество = 0;
	КонецЦикла;
	Модифицированность = Истина;
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	пУтвержден = (Объект.Статус = Перечисления.СтатусыЗаказаНаПеремещения.Утвержден);
	Элементы.ЗапасыУтвержденноеКоличество.Видимость = пУтвержден;
	Элементы.ЗапасыПерезаполнитьУтвержден.Видимость = пУтвержден;
	Элементы.ЗапасыОчиститьУтвержден.Видимость 		= пУтвержден;
		
	Элементы.Статус.ТолькоПросмотр = НЕ Объект.Проведен;

	Если Объект.Проведен И НЕ ПравоИзмененияЗаказовНаПеремещения Тогда
		Если СтатусПриОткритии = Перечисления.СтатусыЗаказаНаПеремещения.Утвержден Тогда
			ТолькоПросмотр = Истина;
			Элементы.ЗапасыПерезаполнитьУтвержден.Доступность 	= Ложь;
			Элементы.ЗапасыОчиститьУтвержден.Доступность 		= Ложь;
		Иначе
			Если ОсновнойСкладПользователя = Объект.СтруктурнаяЕдиницаОтправитель Тогда
				Для Каждого пЭлемент ИЗ ЭтаФорма.Элементы Цикл
					Если ТипЗнч(пЭлемент) = Тип("ПолеФормы") Тогда
						пЭлемент.ТолькоПросмотр = Истина;
					КонецЕсли;
				КонецЦикла;
				Элементы.Запасы.ТолькоПросмотр 							= Ложь;
				Элементы.Статус.ТолькоПросмотр 							= Ложь;
				Элементы.ЗапасыУтвержденноеКоличество.ТолькоПросмотр 	= Ложь;
				КомандыЗапасов = Элементы.Запасы.КоманднаяПанель.ПодчиненныеЭлементы;
				Для Каждого пКоманда Из КомандыЗапасов Цикл
					пКоманда.Доступность = Ложь;
				КонецЦикла;
				Элементы.ЗапасыЗаполнить.Доступность 					= Истина;
			Иначе
				ТолькоПросмотр = Истина;
				Элементы.ЗапасыПерезаполнитьУтвержден.Доступность 	= Ложь;
				Элементы.ЗапасыОчиститьУтвержден.Доступность 		= Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ИмяТабличнойЧасти 	= "Запасы";
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Период", 					Объект.Дата);
	ПараметрыПодбора.Вставить("Организация", 				Объект.Организация);
	ПараметрыПодбора.Вставить("СтруктурнаяЕдиница", 		Объект.СтруктурнаяЕдиницаОтправитель);
	ПараметрыПодбора.Вставить("ИспользуетсяРезервирование", Истина);
	ПараметрыПодбора.Вставить("ОтображатьКолонкуЦена", 		Ложь);
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("ТипНоменклатуры", ТипНоменклатуры);
	
	СтатусПартии = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Партия"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.Статус" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					СтатусПартии.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				СтатусПартии.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПодбора.Вставить("СтатусПартии", СтатусПартии);
	
	ПараметрыПодбора.Вставить("УникальныйИдентификаторФормыВладельца", УникальныйИдентификатор);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбора", ПараметрыПодбора, ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПодборПроизведен" 
		И ЗначениеЗаполнено(Параметр) 
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор Тогда
		
		АдресЗапасовВХранилище = Параметр;
		ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, "Запасы", Истина, Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьХарактеристики, ЕстьПартии)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		НоваяСтрока = Объект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ЗаполнитьПроектПоДокументу(Объект.Проект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроектПоДокументу(ПроектЗначение = Неопределено)
	
	Если ПроектЗначение = Неопределено Тогда
		Объект.Проект = ПредопределенноеЗначение("Справочник.Проекты.БезПроекта");
	КонецЕсли;
	
	Для Каждого СтрокаЗапасы Из Объект.Запасы Цикл
		СтрокаЗапасы.Проект = Объект.Проект;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.БуферВремени = Объект.Дата;   //giga
КонецПроцедуры
