Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НевыходыНаРаботуСотрудниковНевыходы.Ссылка.Организация КАК Организация,
	|	НевыходыНаРаботуСотрудниковНевыходы.Сотрудник КАК Сотрудник,
	|	НАЧАЛОПЕРИОДА(НевыходыНаРаботуСотрудниковНевыходы.ДатаНачала, ДЕНЬ) КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(НевыходыНаРаботуСотрудниковНевыходы.ДатаОкончания, ДЕНЬ) КАК ДатаОкончания,
	|	НевыходыНаРаботуСотрудниковНевыходы.Возмещаемый КАК Возмещаемый,
	|	НевыходыНаРаботуСотрудниковНевыходы.ПричинаНевыхода КАК ПричинаНевыхода,
//	|	НевыходыНаРаботуСотрудниковНевыходы.Ссылка.Дата КАК Период,
	|	НевыходыНаРаботуСотрудниковНевыходы.ДатаНачала КАК Период,
	|	НевыходыНаРаботуСотрудниковНевыходы.Подразделение КАК Подразделение,
	|	НевыходыНаРаботуСотрудниковНевыходы.ЧасыОтсутствия КАК ЧасыОтсутствия
	|ИЗ
	|	Документ.НевыходыНаРаботуСотрудников.Невыходы КАК НевыходыНаРаботуСотрудниковНевыходы
	|ГДЕ
	|	НевыходыНаРаботуСотрудниковНевыходы.Ссылка = &Ссылка";
	
	ТаблицаНевыходыНаРаботуСотрудников = Запрос.Выполнить().Выгрузить();
	

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНевыходыНаРаботуСотрудников", ТаблицаНевыходыНаРаботуСотрудников);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()
