
&После("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаИзменениеПараметровВА, СтруктураДополнительныеСвойства)
	
	Если Не ДокументСсылкаИзменениеПараметровВА.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
		Возврат;
	КонецЕсли;
			
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаИзменениеПараметровВА);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.ВнеоборотныйАктив.СчетУчета КАК СчетУчета,
	// Щербаков +++
	|	ТаблицаДокумента.ВнеоборотныйАктив.СчетУчетаРегл КАК СчетУчетаРегл,
	// Щербаков ---
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ТаблицаДокумента.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ТаблицаДокумента.СтоимостьДляВычисленияАмортизацииДоИзменения КАК СтоимостьДляВычисленияАмортизацииДоИзменения,
	|	ТаблицаДокумента.СчетПереоценки КАК СчетПереоценки,
	// Щербаков +++
	|	ТаблицаДокумента.СчетПереоценкиРегл КАК СчетПереоценкиРегл,
	// Щербаков ---
	|	ТаблицаДокумента.ПрименитьВТекущемМесяце КАК ПрименитьВТекущемМесяце,
	|	ТаблицаДокумента.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаДокумента.СчетЗатрат КАК СчетЗатрат,
	//+++ Истомин
	|	ТаблицаДокумента.СчетЗатратРегл КАК СчетЗатратРегл,
	//--- Истомин
	|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.Адрес КАК Адрес,
	|	ТаблицаДокумента.ГодовойПроцентАмортизацииДляУменьшенногоОстатка КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ТаблицаДокумента.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка
	// +++ { AzRy - [29.04.2013] - Jira://-// - Developer:admin - Comment://-//
	//|	,ТаблицаДокумента.ПроцентАмортизации,
	// +++ } AzRy - [29.04.2013] - Jira://-// - Developer:admin - Comment://-//
	// +++ { AzRy - [14.12.2017] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,ТаблицаДокумента.Ссылка.AzRyВидОперации,
	|   ТаблицаДокумента.AzRyСпособАмортизации,
	|	ИСТИНА КАК AzRyИзменениеСпособаМетодаАмортизаций
	// +++ } AzRy - [14.12.2017] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|ПОМЕСТИТЬ ВременнаяТаблицаИзменениеПараметровВА
	|ИЗ
	|	Документ.ИзменениеПараметровВА.ВнеоборотныеАктивы КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаИзменениеПараметровВА, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВнеоборотныеАктивы(ДокументСсылкаИзменениеПараметровВА, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаИзменениеПараметровВА, СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(ДокументСсылкаИзменениеПараметровВА, СтруктураДополнительныеСвойства);
	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ИзменениеПараметровВА(ДокументСсылкаИзменениеПараметровВА, СтруктураДополнительныеСвойства);
	// Щербакво ---
	
	// +++ { AzRy - [14.12.2017] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	AzRyСформироватьТаблицаСостоянияВнеоборотныхАктивов(ДокументСсылкаИзменениеПараметровВА, СтруктураДополнительныеСвойства);
	// +++ } AzRy - [14.12.2017] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	
КонецПроцедуры

// +++ { AzRy - [14.12.2017] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура AzRyСформироватьТаблицаСостоянияВнеоборотныхАктивов(ДокументСсылкаПринятиеКУчетуВА, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияВнеоборотныхАктивов.ПринятКУчету) КАК Состояние,
	|	ИСТИНА КАК НачислятьАмортизацию,
	|	ТаблицаДокумента.ПрименитьВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяце
	// AzRy --
	|	,
	|	ТаблицаДокумента.AzRyСпособАмортизации ,
	|   ТаблицаДокумента.AzRyИзменениеСпособаМетодаАмортизаций
	// -- AzRy
	|ИЗ
	|	ВременнаяТаблицаИзменениеПараметровВА КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостоянияВнеоборотныхАктивов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаСостоянияВнеоборотныхАктивов()

// +++ } AzRy - [14.12.2017] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
