
&Вместо("ОбработкаПроведения")
Процедура РасшAzRy_ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.ИзменениеПараметровВА.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	УправлениеНебольшойФирмойСервер.ОтразитьПараметрыВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьВнеоборотныеАктивы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	// Щербаков ---
	
	// +++ { AzRy - [14.12.2017] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	УправлениеНебольшойФирмойСервер.ОтразитьСостоянияВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	// +++ } AzRy - [14.12.2017] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура РасшAzRy_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаВнеоборотныхАктивов Из ВнеоборотныеАктивы Цикл
		
		// +++ { AzRy - [20.02.2018] - Jira:ERPM-631 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
		Если AzRyВидОперации = Перечисления.AzRyВидыОперацийИзменениеПараметровВА.ИзменениеСпособаАмортизации Тогда
			М = Новый Массив;
			М.Добавить("ВнеоборотныеАктивы.СтоимостьДляВычисленияАмортизации");
			М.Добавить("ВнеоборотныеАктивы.СчетЗатрат");
			Для каждого ТекСтрока Из М Цикл
				Индекс = ПроверяемыеРеквизиты.Найти(ТекСтрока);
				Если Не Индекс = Неопределено Тогда
					ПроверяемыеРеквизиты.Удалить(Индекс);
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли; 
		
		Если СтрокаВнеоборотныхАктивов.AzRyСпособАмортизации = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка
			И СтрокаВнеоборотныхАктивов.ГодовойПроцентАмортизацииДляУменьшенногоОстатка = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Поле Процент амортизации должен быть заполнен.'; ka = 'ამორტიზაციის პროცენტის ველი არაა შევსებული'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			ЭтотОбъект,
			ТекстСообщения,
			"ВнеоборотныеАктивы",
			СтрокаВнеоборотныхАктивов.НомерСтроки,
			"ПроцентАмортизации",
			Отказ
			);			
		КонецЕсли;
		// +++ } AzRy - [20.02.2018] - Jira:ERPM-631 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	
	КонецЦикла;
	
КонецПроцедуры
