
&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для Каждого Стр Из СписокПеремещений Цикл 
		Стр.Создать = Ложь;
	КонецЦикла;			
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВсе(Команда)
	Для Каждого Стр Из СписокПеремещений Цикл 
		Стр.Создать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьВыборку()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Тз.Ссылка,
	               |	Тз.Создать,
	               |	Тз.Склад
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЗ КАК Тз
	               |ГДЕ
	               |	Тз.Статус = &Статус
				   |	И Тз.Создать
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказПокупателяЗапасы.Номенклатура,
	               |	ЗаказПокупателяЗапасы.Характеристика,
	               |	СУММА(ЗаказПокупателяЗапасы.Количество) КАК Количество,
	               |	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	               |	ЗаказПокупателяЗапасы.Ссылка,
	               |	ВТ.Склад КАК Склад,
	               |	ЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв КАК СкладОтп,
	               |	СУММА(ЗаказПокупателяЗапасы.Сумма) КАК Сумма,
	               |	СУММА(ЗаказПокупателяЗапасы.Резерв) КАК Резерв
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	               |		ПО ВТ.Ссылка = ЗаказПокупателяЗапасы.Ссылка
	               |ГДЕ
	               |	ВТ.Создать = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказПокупателяЗапасы.Номенклатура,
	               |	ЗаказПокупателяЗапасы.Характеристика,
	               |	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	               |	ЗаказПокупателяЗапасы.Ссылка,
	               |	ВТ.Склад,
	               |	ЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв
	               |ИТОГИ ПО
	               |	Склад,
	               |	СкладОтп";
	
	Запрос.УстановитьПараметр("ТЗ",СписокПеремещений.Выгрузить());
	Запрос.УстановитьПараметр("Статус",Справочники.СостоянияЗаказовПокупателей.Собран);
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокПер(Команда)
	
	
	СоздатьДокПерНаСервере(СписокПеремещений[0].Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьДокРасНак(Команда)
	Для Каждого Стр Из СписокПеремещений Цикл 
		Если Стр.Создать И Стр.Статус <> ПолучитьСтатус() Тогда
			 Стр.ДокРасНак = СоздатьДокРасНакНаСервере(Стр.Ссылка,Стр.ДокПерем);
			 Стр.Статус = ПолучитьСтатус(); 
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатус()
	
	Возврат Справочники.СостоянияЗаказовПокупателей.Доставлен;
	
КонецФункции	

&НаСервере 
Функция  СоздатьДокРасНакНаСервере(Ссылка,ДокПерем)
	
	Док = Документы.РасходнаяНакладная.СоздатьДокумент();
	Док.ЗаполнитьПоЗаказуПокупателя(Ссылка);
	Док.Дата = ТекущаяДата(); 
	Док.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
    Док.СтруктурнаяЕдиница = Ссылка.СтруктурнаяЕдиницаРезерв;	
	Если ЗначениеЗаполнено(ДокПерем) Тогда
		Док.СтруктурнаяЕдиница = ДокПерем.СтруктурнаяЕдиницаПолучатель;
	КонецЕсли;	
	
	//+++ Дмгг
	Если НЕ ЗначениеЗаполнено(Док.ВидНалогаНДС) Тогда 
		Док.ВидНалогаНДС = Док.Организация.ВидНалогаНДС;
	КонецЕсли;
	
	Для Каждого Строк из Док.Запасы Цикл 
		Строк.Резерв = ?(РезервированиеЗапасов, Строк.Количество, 0); //Строк.Количество; +++Дмгг
	КонецЦикла;
	//--- Дмгг
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("დოკუმენტი: " + Док + " გატარდა!");
	Исключение
		Сообщить("დოკუმენტი: " + Док + " 	ვერ გატარდა!");
		Док.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
	Возврат Док.Ссылка;
	
КонецФункции	

&НаСервере 
Процедура СоздатьДокПерНаСервере(Ссылка)
	
	 	
	ВыборкаСкладОтп = ПолучитьВыборку();
	
	
	Пока ВыборкаСкладОтп.Следующий() Цикл
	сч = 1;
	
	Склад = ВыборкаСкладОтп.Склад;
	
	ВыборкаСклад = ВыборкаСкладОтп.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСклад.Следующий() Цикл
		Док = Документы.ПеремещениеЗапасов.СоздатьДокумент();
		Док.Дата = ТекущаяДата();//Ссылка.ДатаКонцаСобран Паганини
		Док.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение;
		
		Если Не ЗначениеЗаполнено(Склад) И Не ЗначениеЗаполнено(СкладОтгрузки)  Тогда
			Сообщить("სტიქონში N: " + сч + " არ არის შევსებული საწყობი!");
			Продолжить;
		КонецЕсли;
		
		Док.ЗаполнитьПоЗаказуПокупателя(Ссылка);
		Док.ЗаказПокупателя = Неопределено;
		Док.ДокументОснование = Неопределено;
		//Попытка
		//	Док.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	Сообщить("დოკუმენტი: " + Док + " ვერ გატარდა!");
		//	Док.Записать(РежимЗаписиДокумента.Запись);
		//КонецПопытки;
		
		ДокОб = Док;//Док.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(Склад) Тогда
			ДокОб.СтруктурнаяЕдиницаПолучатель = Склад;
			ДокОб.СтруктурнаяЕдиницаКонечныйПолучатель = Склад; 
		ИначеЕсли ЗначениеЗаполнено(СкладОтгрузки) Тогда 
			ДокОб.СтруктурнаяЕдиницаПолучатель = СкладОтгрузки;
			ДокОб.СтруктурнаяЕдиницаКонечныйПолучатель = СкладОтгрузки; 
		КонецЕсли;
		
		ДокОб.СтруктурнаяЕдиница = ВыборкаСклад.СкладОтп;
		
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		ДокОб.ПоложениеЗаказаПокупателя = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекущийПользователь, "ПоложениеЗаказаПокупателяВПеремещенииЗапасов"); //Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
		
		
		ДокОб.Запасы.Очистить();
		Выборка = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл 
			Стр = ДокОб.Запасы.Добавить();
			Стр.Номенклатура = Выборка.Номенклатура;
			Стр.Характеристика =  Выборка.Характеристика;  
			Стр.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
			Стр.Количество =  Выборка.Количество;
			Стр.СуммаЗаказа = Выборка.Сумма;
			Стр.ЗаказПокупателя = Выборка.Ссылка;
			Стр.Резерв = ?(РезервированиеЗапасов, Выборка.Резерв, 0); //Стр.Количество; +++ Дмгг
			
			Отбор = Новый Структура;
			Отбор.Вставить("Ссылка", Выборка.Ссылка);
			Строки = СписокПеремещений.НайтиСтроки(Отбор);
			
			ДокОб.Записать(РежимЗаписиДокумента.Запись);
			Для Каждого Стро Из Строки Цикл
				Стро.ДокПерем = ДокОб.Ссылка;
				Стро.Статус = Справочники.СостоянияЗаказовПокупателей.ВыгруженНаБорт;
			КонецЦикла;
			
		КонецЦикла;
		Попытка
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("დოკუმენტი: " + ДокОб + " გატარდა!");
		Исключение
			Сообщить("დოკუმენტი: " + ДокОб + " ვერ გატარდა!");
			ДокОб.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
	КонецЦикла;	
	
    КонецЦикла;	
		
КонецПроцедуры	


&НаСервере
Процедура ОбновитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя1.Ссылка,
	               |	ЗаказПокупателя1.Номер,
	               |	ЗаказПокупателя1.Дата,
	               |	ЗаказПокупателя1.Автор,
	               |	ЗаказПокупателя1.СостояниеЗаказа КАК Статус,
	               |	ИСТИНА КАК Создать,
	               |	ЗаказПокупателя1.Контрагент КАК Покупатель,
	               |	ПеремещениеЗапасовЗапасы.Ссылка КАК ДокПерем
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
	               |		ПО (ПеремещениеЗапасовЗапасы.ЗаказПокупателя = ЗаказПокупателя1.Ссылка)
	               |			И (ПеремещениеЗапасовЗапасы.Ссылка.Проведен = ИСТИНА)
	               |ГДЕ
	               |	ЗаказПокупателя1.Проведен = ИСТИНА
	               |	И (ЗаказПокупателя1.СостояниеЗаказа = &СостояниеЗаказа
	               |			ИЛИ ЗаказПокупателя1.СостояниеЗаказа = &СостояниеЗаказаБорт)
	               |	И ЗаказПокупателя1.Дата МЕЖДУ &ДатаНач И &ДатаКон
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказПокупателя1.Ссылка,
	               |	ЗаказПокупателя1.Номер,
	               |	ЗаказПокупателя1.Дата,
	               |	ЗаказПокупателя1.Автор,
	               |	ЗаказПокупателя1.СостояниеЗаказа,
	               |	ЗаказПокупателя1.Контрагент,
	               |	ПеремещениеЗапасовЗапасы.Ссылка";
	
	Запрос.УстановитьПараметр("СостояниеЗаказа",Справочники.СостоянияЗаказовПокупателей.Собран);
	Запрос.УстановитьПараметр("СостояниеЗаказаБорт",Справочники.СостоянияЗаказовПокупателей.ВыгруженНаБорт);
	
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаНач));
	Если ЗначениеЗаполнено(ДатаКон) Тогда
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаКон) + 1);
	Иначе
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()) + 1 );
	КонецЕсли;
	
	
	СписокПеремещений.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ОкраситьТч();
	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
	
	РезервированиеЗапасов = ПолучитьФункциональнуюОпцию("РезервированиеЗапасов");
	
КонецПроцедуры


&НаСервере
Процедура ОкраситьТч()
	
	
	МассивИменКолонокДляПодсветки = Новый Массив;
	Для каждого Стр из Элементы.СписокПеремещений.ПодчиненныеЭлементы Цикл
		МассивИменКолонокДляПодсветки.Добавить(Стр.Имя);
	КонецЦикла;
	
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",  Новый Цвет(, 255, ));
	
	ЭлементУсловия                = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.СписокПеремещений.Статус");
	ЭлементУсловия.ПравоеЗначение = Справочники.СостоянияЗаказовПокупателей.ВыгруженНаБорт;
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;   
	ЭлементУсловия.Использование  = Истина;
	
	Для каждого ТекЭлемент из МассивИменКолонокДляПодсветки Цикл
		ОформляемоеПоле      = ЭлементОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТекЭлемент);
	КонецЦикла;

	
	
КонецПроцедуры
