&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для Каждого Стр Из СписокПеремещений Цикл 
		Стр.Создать = Ложь;
	КонецЦикла;			
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВсе(Команда)
	Для Каждого Стр Из СписокПеремещений Цикл 
		Стр.Создать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВсеРасходная(Команда)
	Для Каждого Стр Из СписокРасходнаяНакладная Цикл 
		Стр.Печать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсеРасходная(Команда)
	Для Каждого Стр Из СписокРасходнаяНакладная Цикл 
		Стр.Печать = Ложь;
	КонецЦикла;			
КонецПроцедуры


&НаКлиенте
Процедура СоздатьВсеПриходная(Команда)
	Для Каждого Стр Из СписокПриходнаяНакладная Цикл 
		Стр.Создать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсеПриходная(Команда)
	Для Каждого Стр Из СписокПриходнаяНакладная Цикл 
		Стр.Создать = Ложь;
	КонецЦикла;			
КонецПроцедуры





&НаСервере
Функция ПолучитьВыборку()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Тз.Ссылка,
	|	Тз.Создать,
	|	Тз.Склад
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК Тз
	|ГДЕ
	|	Тз.Статус = &Статус
	|	И Тз.Создать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Номенклатура,
	|	ЗаказПокупателяЗапасы.Характеристика,
	|	СУММА(ЗаказПокупателяЗапасы.Количество) КАК Количество,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	|	ЗаказПокупателяЗапасы.Ссылка,
	|	ВТ.Склад КАК Склад,
	|	ЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв КАК СкладОтп,
	|	СУММА(ЗаказПокупателяЗапасы.Сумма) КАК Сумма,
	|	СУММА(ЗаказПокупателяЗапасы.Резерв) КАК Резерв,
	|	ЗаказПокупателяЗапасы.КоличествоСобр
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|		ПО ВТ.Ссылка = ЗаказПокупателяЗапасы.Ссылка
	|ГДЕ
	|	ВТ.Создать = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяЗапасы.Номенклатура,
	|	ЗаказПокупателяЗапасы.Характеристика,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	|	ЗаказПокупателяЗапасы.Ссылка,
	|	ВТ.Склад,
	|	ЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв,
	|	ЗаказПокупателяЗапасы.КоличествоСобр
	|ИТОГИ ПО
	|	Склад,
	|	СкладОтп";
	
	Запрос.УстановитьПараметр("ТЗ",СписокПеремещений.Выгрузить());
	Запрос.УстановитьПараметр("Статус",Справочники.СостоянияЗаказовПокупателей.Собран);
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокПер(Команда)
	
	
	СоздатьДокПерНаСервере(СписокПеремещений[0].Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьДокРасНак(Команда)
	
	
	//Элементы.Группа1.ТекущаяСтраница = Элементы.РасходнаяНакладная;
	
	
	Для Каждого Стр Из СписокПеремещений Цикл 
		//Если ПроверитьФункционалРезерва() Тогда
		
		Если Стр.Создать И Стр.Статус <> ПолучитьСтатус() Тогда
			Стр.ДокРасНак = СоздатьДокРасНакНаСервере(Стр.Ссылка,Стр.ДокПерем);
			Стр.Статус = ПолучитьСтатус(); 
		КонецЕсли;	
	КонецЦикла;
	ЗаполнитьСписокРасходнаяНакладная();
	
	//ЭтаФорма.КоманднаяПанель.ТекущаяСтраница = ЭтаФорма.КоманднаяПанель.Страницы.РасходнаяНакладная;
	
	
КонецПроцедуры


&НаСервере
Функция ПроверитьФункционалРезерва()
	
	Возврат Константы.ФункционалСбораТоваров.Получить();
	
КонецФункции	


&НаСервере
Функция ПолучитьСтатус()
	
	Возврат Справочники.СостоянияЗаказовПокупателей.Доставлен;
	
КонецФункции	

&НаСервере 
Функция  СоздатьДокРасНакНаСервере(Ссылка,ДокПерем)
	
	Док = Документы.РасходнаяНакладная.СоздатьДокумент();
	Док.ЗаполнитьПоЗаказуПокупателя(Ссылка);
	Если ЗначениеЗаполнено(ДатаРасходнаяНпкладная) Тогда 
		Док.Дата = ДатаРасходнаяНпкладная
	Иначе 
		Док.Дата = ТекущаяДата();
	КонецЕсли;
	Док.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
	Док.Автор = Ссылка.Автор;
	Док.Ответственный  = Ссылка.Ответственный;	
	Док.СтруктурнаяЕдиница = Ссылка.СтруктурнаяЕдиницаРезерв;	
	Если ЗначениеЗаполнено(ДокПерем) Тогда
		Док.СтруктурнаяЕдиница = ДокПерем.СтруктурнаяЕдиницаПолучатель;
	КонецЕсли;	
	//Lazare_
	Если  Док.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ПустаяСсылка() Тогда 
		Док.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке ;
	ИначеЕсли 
		Док.ПоложениеСклада = Неопределено Тогда 
		Док.ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке ;
	КонецЕсли;
	//_Lazare	
	
	
	//+++ Дмгг
	Если НЕ ЗначениеЗаполнено(Док.ВидНалогаНДС) Тогда 
		Док.ВидНалогаНДС = Док.Организация.ВидНалогаНДС;
	КонецЕсли;
	//++ Rajak
	Если  Константы.ФункционалСбораТоваров.Получить() Тогда 
		Для Каждого Строк из Док.Запасы Цикл 
			Строк.Резерв = ?(РезервированиеЗапасов, Строк.Количество, 0); //Строк.Количество; +++Дмгг
		КонецЦикла;//--Rajak
	КонецЕсли;
	//--- Дмгг
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("დოკუმენტი: " + Док + " გატარდა!");
	Исключение
		Сообщить("დოკუმენტი: " + Док + " 	ვერ გატარდა!");
		Док.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
	Возврат Док.Ссылка;
	
КонецФункции	

&НаСервере 
Процедура СоздатьДокПерНаСервере(Ссылка)
	
	ПеренестиСобрание = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиСобранноеКоличествоЗапасовИзЗаказаПокупателяВРасходнойНакладной");		
	
	ВыборкаСкладОтп = ПолучитьВыборку();
	
	
	Пока ВыборкаСкладОтп.Следующий() Цикл
		сч = 1;
		
		Склад = ВыборкаСкладОтп.Склад;
		
		ВыборкаСклад = ВыборкаСкладОтп.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСклад.Следующий() Цикл
			Док = Документы.ПеремещениеЗапасов.СоздатьДокумент();
			Док.Дата = ТекущаяДата();//Ссылка.ДатаКонцаСобран Паганини
			Док.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение;
			
			Если Не ЗначениеЗаполнено(Склад) И Не ЗначениеЗаполнено(СкладОтгрузки)  Тогда
				Сообщить("სტიქონში N: " + сч + " არ არის შევსებული საწყობი!");
				Продолжить;
			КонецЕсли;
			
			Док.ЗаполнитьПоЗаказуПокупателя(Ссылка);
			Док.ЗаказПокупателя = Неопределено;
			Док.ДокументОснование = Неопределено;
			//Попытка
			//	Док.Записать(РежимЗаписиДокумента.Проведение);
			//Исключение
			//	Сообщить("დოკუმენტი: " + Док + " ვერ გატარდა!");
			//	Док.Записать(РежимЗаписиДокумента.Запись);
			//КонецПопытки;
			
			ДокОб = Док;//Док.Ссылка.ПолучитьОбъект();
			Если ЗначениеЗаполнено(Склад) Тогда
				ДокОб.СтруктурнаяЕдиницаПолучатель = Склад;
				ДокОб.СтруктурнаяЕдиницаКонечныйПолучатель = Склад; 
			ИначеЕсли ЗначениеЗаполнено(СкладОтгрузки) Тогда 
				ДокОб.СтруктурнаяЕдиницаПолучатель = СкладОтгрузки;
				ДокОб.СтруктурнаяЕдиницаКонечныйПолучатель = СкладОтгрузки; 
			КонецЕсли;
			
			ДокОб.СтруктурнаяЕдиница = ВыборкаСклад.СкладОтп;
			
			ТекущийПользователь = Пользователи.ТекущийПользователь();
			ДокОб.ПоложениеЗаказаПокупателя = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекущийПользователь, "ПоложениеЗаказаПокупателяВПеремещенииЗапасов"); //Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
			
			
			ДокОб.Запасы.Очистить();
			Выборка = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл 
				Стр = ДокОб.Запасы.Добавить();
				Стр.Номенклатура = Выборка.Номенклатура;
				Стр.Характеристика =  Выборка.Характеристика;  
				Стр.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;		
				Стр.Количество =  ?(НЕ ПеренестиСобрание,Выборка.Количество,?(Выборка.КоличествоСобр= 0,Выборка.Количество,Выборка.КоличествоСобр));	
				Стр.СуммаЗаказа = Выборка.Сумма;
				Стр.ЗаказПокупателя = Выборка.Ссылка;
				Стр.Резерв = ?(РезервированиеЗапасов, Выборка.Резерв, 0); //Стр.Количество; +++ Дмгг
				
				Отбор = Новый Структура;
				Отбор.Вставить("Ссылка", Выборка.Ссылка);
				Строки = СписокПеремещений.НайтиСтроки(Отбор);
				
				ДокОб.Записать(РежимЗаписиДокумента.Запись);
				Для Каждого Стро Из Строки Цикл
					Стро.ДокПерем = ДокОб.Ссылка;
					Стро.Статус = Справочники.СостоянияЗаказовПокупателей.ВыгруженНаБорт;
				КонецЦикла;
				
			КонецЦикла;
			Попытка
				ДокОб.Записать(РежимЗаписиДокумента.Проведение);
				Сообщить("დოკუმენტი: " + ДокОб + " გატარდა!");
			Исключение
				Сообщить("დოკუმენტი: " + ДокОб + " ვერ გატარდა!");
				ДокОб.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
КонецПроцедуры	


&НаКлиенте
Процедура Обновить(Команда)
	
	
	СписокНологовое.Очистить();
	СписокПеремещений.Очистить();
	
	ОбновитьНаСервере();
	ОтборОтветственный = "";
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРасходная(Команда)
	
	
	СписокРасходнаяНакладная.Очистить();
	
	ЗаполнитьСписокРасходнаяНакладная();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьПриходная(Команда)
	
	
	СписокПриходнаяНакладная.Очистить();
	
	ЗаполнитьСписокПриходнаяНакладная();
КонецПроцедуры



&НаСервере
Процедура ОбновитьНаСервере()
	
	Если Константы.ФункционалСбораТоваров.Получить() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаказПокупателя1.Ссылка,
		|	ЗаказПокупателя1.Номер,
		|	ЗаказПокупателя1.Дата,
		|	ЗаказПокупателя1.Автор,
		|	ЗаказПокупателя1.СостояниеЗаказа КАК Статус,
		|	ИСТИНА КАК Создать,
		|	ЗаказПокупателя1.Контрагент КАК Покупатель,
		|	ПеремещениеЗапасовЗапасы.Ссылка КАК ДокПерем
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя1
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
		|		ПО (ПеремещениеЗапасовЗапасы.ЗаказПокупателя = ЗаказПокупателя1.Ссылка)
		|			И (ПеремещениеЗапасовЗапасы.Ссылка.Проведен = ИСТИНА)
		|ГДЕ
		|	ЗаказПокупателя1.Проведен = ИСТИНА
		|	И (ЗаказПокупателя1.СостояниеЗаказа = &СостояниеЗаказа
		|			ИЛИ ЗаказПокупателя1.СостояниеЗаказа = &СостояниеЗаказаБорт)
		|	И ЗаказПокупателя1.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателя1.Ссылка,
		|	ЗаказПокупателя1.Номер,
		|	ЗаказПокупателя1.Дата,
		|	ЗаказПокупателя1.Автор,
		|	ЗаказПокупателя1.СостояниеЗаказа,
		|	ЗаказПокупателя1.Контрагент,
		|	ПеремещениеЗапасовЗапасы.Ссылка";
		
		Запрос.УстановитьПараметр("СостояниеЗаказа",Справочники.СостоянияЗаказовПокупателей.Собран);
		Запрос.УстановитьПараметр("СостояниеЗаказаБорт",Справочники.СостоянияЗаказовПокупателей.ВыгруженНаБорт);
		
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаНач));
		Если ЗначениеЗаполнено(ДатаКон) Тогда
			Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаКон) + 1);
		Иначе
			Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()) + 1 );
		КонецЕсли;
		
		
		СписокПеремещений.Загрузить(Запрос.Выполнить().Выгрузить());
		
		ОкраситьТч();
		
	Иначе //++Rajak
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаказПокупателя1.Ссылка КАК Ссылка,
		               |	ЗаказПокупателя1.Номер КАК Номер,
		               |	ЗаказПокупателя1.Дата КАК Дата,
		               |	ЗаказПокупателя1.Автор КАК Автор,
		               |	ЗаказПокупателя1.СостояниеЗаказа КАК Статус,
		               |	ИСТИНА КАК Создать,
		               |	ЗаказПокупателя1.Контрагент КАК Покупатель,
		               |	ПеремещениеЗапасовЗапасы.Ссылка КАК ДокПерем,
		               |	МАКСИМУМ(ВЫБОР
		               |			КОГДА ЕСТЬNULL(РасходнаяНакладная.Ссылка, ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)
		               |				ТОГДА 0
		               |			КОГДА ЕСТЬNULL(РасходнаяНакладная.Ссылка, ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)
		               |					И РасходнаяНакладная.Ссылка.ПометкаУдаления
		               |				ТОГДА 0
		               |			ИНАЧЕ 1
		               |		КОНЕЦ) КАК ЕстьРН
		               |ПОМЕСТИТЬ ВТ_Предвариельная
		               |ИЗ
		               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя1
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
		               |		ПО (ПеремещениеЗапасовЗапасы.ЗаказПокупателя = ЗаказПокупателя1.Ссылка)
		               |			И (ПеремещениеЗапасовЗапасы.Ссылка.Проведен = ИСТИНА)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
		               |		ПО (РасходнаяНакладная.Заказ = ЗаказПокупателя1.Ссылка)
		               |ГДЕ
		               |	ЗаказПокупателя1.Проведен = ИСТИНА
		               |	И ЗаказПокупателя1.Дата МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ВЫБОР
		               |			КОГДА &Автор = ЗНАЧЕНИЕ(Справочник.Пользователи.Пустаяссылка)
		               |				ТОГДА ИСТИНА
		               |			ИНАЧЕ ЗаказПокупателя1.Автор = &Автор
		               |		КОНЕЦ
		               |	И ЗаказПокупателя1.СостояниеЗаказа <> &СостояниеЗаказа
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗаказПокупателя1.Ссылка,
		               |	ЗаказПокупателя1.Номер,
		               |	ЗаказПокупателя1.Дата,
		               |	ЗаказПокупателя1.Автор,
		               |	ЗаказПокупателя1.СостояниеЗаказа,
		               |	ЗаказПокупателя1.Контрагент,
		               |	ПеремещениеЗапасовЗапасы.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Предвариельная.Ссылка КАК Ссылка,
		               |	ВТ_Предвариельная.Номер КАК Номер,
		               |	ВТ_Предвариельная.Дата КАК Дата,
		               |	ВТ_Предвариельная.Автор КАК Автор,
		               |	ВТ_Предвариельная.Статус КАК Статус,
		               |	ВТ_Предвариельная.Создать КАК Создать,
		               |	ВТ_Предвариельная.Покупатель КАК Покупатель,
		               |	ВТ_Предвариельная.ДокПерем КАК ДокПерем,
		               |	ВТ_Предвариельная.ЕстьРН КАК ЕстьРН
		               |ИЗ
		               |	ВТ_Предвариельная КАК ВТ_Предвариельная
		               |ГДЕ
		               |	ВТ_Предвариельная.ЕстьРН = 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_Предвариельная.Дата,
		               |	ВТ_Предвариельная.Создать,
		               |	ВТ_Предвариельная.Автор,
		               |	ВТ_Предвариельная.Номер,
		               |	ВТ_Предвариельная.ДокПерем,
		               |	ВТ_Предвариельная.Покупатель,
		               |	ВТ_Предвариельная.Статус,
		               |	ВТ_Предвариельная.Ссылка,
		               |	ВТ_Предвариельная.ЕстьРН";
		
		//Запрос.УстановитьПараметр("СостояниеЗаказа",Справочники.СостоянияЗаказовПокупателей.Собран);
		Запрос.УстановитьПараметр("СостояниеЗаказа",Справочники.СостоянияЗаказовПокупателей.Завершен);
		//Если ЗначениеЗаполнено(ТорговыйПредставитель) Тогда 
		Запрос.УстановитьПараметр("Автор",ТорговыйПредставитель);
		
		
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаНач));
		Если ЗначениеЗаполнено(ДатаКон) Тогда
			Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаКон) + 1);
		Иначе
			Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()) + 1 );
		КонецЕсли;
		
		
		СписокПеремещений.Загрузить(Запрос.Выполнить().Выгрузить());
		//--Rajak
		
		ОкраситьТч();
		
		
	//КонецЕсли;
	
	
	
	//Для Каждого ДокументСсылка Из СписокПеремещений	 Цикл 
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	| СвязанныеДокументы.Ссылка
	//	|ИЗ
	//	| КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы";
	//	
	//	Запрос.УстановитьПараметр("ЗначениеКритерияОтбора",ДокументСсылка.Ссылка);
	//	СписокПеремещений.Загрузить(Запрос.Выполнить().Выгрузить());	
	//	//Выборка = Запрос.Выполнить().Выгрузить()
	//КонецЦикла;	
	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	////++Rajak	
	//Если Константы.ФункционалСбораТоваров.Получить() Тогда
	//	ОбновитьНаСервере();
	//	Элементы.ФилтриПрав.Видимость = Ложь;
	//	Элементы.ФормаГруппаRS.Видимость = Ложь;
	//	Элементы.ФормаСоздатьЭлНакладную.Видимость = Ложь;
	//	Элементы.НалоговыеДокументы.Видимость = Ложь;
	//КонецЕсли;
	////--Rajak	
	
	РезервированиеЗапасов = ПолучитьФункциональнуюОпцию("РезервированиеЗапасов");
	
	ЗаполнитьСписокРасходнаяНакладная();
	ЗаполнитьСписокПриходнаяНакладная()
	
	// СтандартныеПодсистемы.Печать
	//	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
КонецПроцедуры


Процедура ЗаполнитьСписокРасходнаяНакладная()
	
	ВидОперации =  Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК Ссылка,
	|	РасходнаяНакладная.Дата КАК Дата,
	|	РасходнаяНакладная.Контрагент КАК Контрагент,
	|	РасходнаяНакладная.Договор КАК Договор,
	|	РасходнаяНакладная.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.ВидОперации = &ВидОперации
	|	И РасходнаяНакладная.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаНач));
	Если ЗначениеЗаполнено(ДатаКон) Тогда
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаКон) + 1);
	Иначе
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()) + 1 );
	КонецЕсли;	
	
	
	СписокРасходнаяНакладная.Загрузить(Запрос.Выполнить().Выгрузить());
	Для Каждого стр Из СписокРасходнаяНакладная Цикл 
		
		НайденныйЭлНакладная = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйЭлНакладная(стр.Ссылка);
		Если ЗначениеЗаполнено(НайденныйЭлНакладная) Тогда 
		стр.ДокЭлНакл = НайденныйЭлНакладная.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ЗаполнитьСписокПриходнаяНакладная()
	
	ВидОперации =  Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
	
	//Перечисления.вид
	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходнаяНакладная.Ссылка КАК Ссылка,
	|	ПриходнаяНакладная.Дата КАК Дата,
	|	ПриходнаяНакладная.Контрагент КАК Контрагент,
	|	ПриходнаяНакладная.Договор КАК Договор,
	|	ПриходнаяНакладная.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.ВидОперации = &ВидОперации
	|	И ПриходнаяНакладная.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаНач));
	Если ЗначениеЗаполнено(ДатаКон) Тогда
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаКон) + 1);
	Иначе
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()) + 1 );
	КонецЕсли;
	
	
	
	СписокПриходнаяНакладная.Загрузить(Запрос.Выполнить().Выгрузить());
	Для Каждого стр Из СписокПриходнаяНакладная Цикл 
		
		НайденныйЭлНакладная = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйЭлНакладная(стр.Ссылка);
		Если ЗначениеЗаполнено(НайденныйЭлНакладная) Тогда 
		стр.ДокЭлНакл = НайденныйЭлНакладная.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры



&НаСервере
Процедура ОкраситьТч()
	
	
	МассивИменКолонокДляПодсветки = Новый Массив;
	Для каждого Стр из Элементы.СписокПеремещений.ПодчиненныеЭлементы Цикл
		МассивИменКолонокДляПодсветки.Добавить(Стр.Имя);
	КонецЦикла;
	
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",  Новый Цвет(, 255, ));
	
	ЭлементУсловия                = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.СписокПеремещений.Статус");
	ЭлементУсловия.ПравоеЗначение = Справочники.СостоянияЗаказовПокупателей.ВыгруженНаБорт;
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;   
	ЭлементУсловия.Использование  = Истина;
	
	Для каждого ТекЭлемент из МассивИменКолонокДляПодсветки Цикл
		ОформляемоеПоле      = ЭлементОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТекЭлемент);
	КонецЦикла;
	
	
	
КонецПроцедуры





//Rajak--
&НаКлиенте
Процедура СоздатьЭлНакладную(Команда)
	
	Если Элементы.Группа1.ТекущаяСтраница.Имя = "ГруппаСписокПеремещений" Тогда 
		Для Каждого Стр Из СписокПеремещений Цикл 
			//Если ПроверитьФункционалРезерва() Тогда
			
			Если Стр.Создать И ЗначениеЗаполнено(стр.ДокРасНак) Тогда
				Стр.ДокЭлНакл = СоздатьЭлНакладнуюНаСервере(Стр.ДокРасНак,Стр.ДокПерем);
				Стр.Статус = ПолучитьСтатус(); 
			КонецЕсли;	
		КонецЦикла;
	ИначеЕсли Элементы.Группа1.ТекущаяСтраница.Имя = "ПриходнаяНакладная" Тогда 
		Для Каждого Стр Из СписокПриходнаяНакладная Цикл 
			//Если ПроверитьФункционалРезерва() Тогда
			
			Если Стр.Создать Тогда
				Стр.ДокЭлНакл = СоздатьЭлНакладнуюНаСервере(Стр.Ссылка,Неопределено);
				//Стр.Статус = ПолучитьСтатус(); 
			КонецЕсли;	
		КонецЦикла;
		
		
	КонецЕсли;
	ЗаполнитьСписокРасходнаяНакладная();
КонецПроцедуры	

&НаСервере
Функция СоздатьЭлНакладнуюНаСервере(Ссылка,ДокПерем)
	
	
	ЭлНакладная = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйЭлНакладная(Ссылка);
	
	Если Не ЗначениеЗаполнено(ЭлНакладная)Тогда 
		
		Док = Документы.РС_ЭлектроннаяНакладная.СоздатьДокумент();
		
		Док.Заполнить(Ссылка);
		Док.Дата = ТекущаяДата();
		
		Если ЗначениеЗаполнено(ЭтотОбъект.НачалнаяДатаТранспортировки) Тогда 
			Док.ДатаНачалаТранспортировки = ЭтотОбъект.НачалнаяДатаТранспортировки;
		Иначе  Док.ДатаНачалаТранспортировки = ТекущаяДата();
		КонецЕсли;
		Док.Товары.Загрузить(Ссылка.Запасы.Выгрузить());
		НоваяСтрока = Док.ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = Ссылка;
		
		Док.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("დოკუმენტი: " + Док + " 	ჩაწერილია!");
		
		СтрокаСписокНологовое = СписокНологовое.Добавить();
		СтрокаСписокНологовое.Ссылка = Док.Ссылка;
		СтрокаСписокНологовое.Дата   = Док.Дата;
		СтрокаСписокНологовое.Автор  = Док.Автор;
		СтрокаСписокНологовое.Номер  = Док.Номер;
		СтрокаСписокНологовое.Создать  = Истина;
		
		Возврат Док.Ссылка;
	Иначе Сообщить("ელექტორნული დოკუმენტი უკვე არსებობს, ნომერი: " + ЭлНакладная.Номер);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура работатьТН(Команда)
	
	Если ЗначениеЗаполнено(Водитель) Или ЗначениеЗаполнено(ТранспортноеСредство) Тогда 
		
		изменитьТоварнуюНакладную();
		
	КонецЕсли;	
	
	Для Каждого Документ Из СписокНологовое Цикл
		Если Документ.Создать Тогда 
			ТекОбъект = ПолучитьФорму("Документ.РС_ЭлектроннаяНакладная.Форма.ФормаДокумента", Новый Структура("Ключ", Документ.Ссылка));
			ТекОбъект.СоздатьТН(Команда);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//&НаКлиенте
//Процедура АктивироватьТН(Команда)
//	
//	Если ЗначениеЗаполнено(Водитель) Или ЗначениеЗаполнено(ТранспортноеСредство) Тогда 
//		
//		изменитьТоварнуюНакладную();
//		
//	КонецЕсли;	
//	
//	
//	Для Каждого Документ Из СписокНологовое Цикл
//		Если Документ.Создать Тогда
//		ТекОбъект = ПолучитьФорму("Документ.РС_ЭлектроннаяНакладная.Форма.ФормаДокумента", Новый Структура("Ключ", Документ.Ссылка));
//		ТекОбъект.АктивироватьТН(Команда);
//		КонецЕсли;
//	КонецЦикла;
//КонецПроцедуры

//&НаКлиенте
//Процедура СоздатьИАктивироватьТН(Команда)
//	
//	Если ЗначениеЗаполнено(Водитель) Или ЗначениеЗаполнено(ТранспортноеСредство) Тогда 
//		
//		изменитьТоварнуюНакладную();
//		
//	КонецЕсли;	
//	
//	
//	Для Каждого Документ Из СписокНологовое Цикл
//		Если Документ.Создать Тогда
//		ТекОбъект = ПолучитьФорму("Документ.РС_ЭлектроннаяНакладная.Форма.ФормаДокумента", Новый Структура("Ключ", Документ.Ссылка));
//		ТекОбъект.СоздатьИАктивироватьТН(Команда);
//		КонецЕсли;
//	КонецЦикла;
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьСтатусТН(Команда)
//	Если ЗначениеЗаполнено(Водитель) Или ЗначениеЗаполнено(ТранспортноеСредство) Тогда 
//		
//		изменитьТоварнуюНакладную();
//		
//	КонецЕсли;	
//	
//	Для Каждого Документ Из СписокНологовое Цикл
//		ТекОбъект = ПолучитьФорму("Документ.РС_ЭлектроннаяНакладная.Форма.ФормаДокумента", Новый Структура("Ключ", Документ.Ссылка));
//		ТекОбъект.ОбновитьСтатусТН(Команда);
//	КонецЦикла;
//КонецПроцедуры

//&НаКлиенте
//Процедура ОтменитьТН(Команда)
//	
//	Если ЗначениеЗаполнено(Водитель) Или ЗначениеЗаполнено(ТранспортноеСредство) Тогда 
//		
//		изменитьТоварнуюНакладную();
//		
//	КонецЕсли;	
//	
//	Для Каждого Документ Из СписокНологовое Цикл
//		ТекОбъект = ПолучитьФорму("Документ.РС_ЭлектроннаяНакладная.Форма.ФормаДокумента", Новый Структура("Ключ", Документ.Ссылка));
//		ТекОбъект.ОтменитьТН(Команда);
//	КонецЦикла;
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗавершитьТН(Команда)
//	
//	Если ЗначениеЗаполнено(Водитель) Или ЗначениеЗаполнено(ТранспортноеСредство) Тогда 
//		
//		изменитьТоварнуюНакладную();
//		
//	КонецЕсли;	
//	
//	Для Каждого Документ Из СписокНологовое Цикл
//		ТекОбъект = ПолучитьФорму("Документ.РС_ЭлектроннаяНакладная.Форма.ФормаДокумента", Новый Структура("Ключ", Документ.Ссылка));
//		ТекОбъект.ОтменитьТН(Команда);
//	КонецЦикла;
//КонецПроцедуры

&НаКлиенте
Процедура печать(Команда)
	
	Если ЗначениеЗаполнено(СписокПеремещений) Тогда 
		ТабДок = печатьНаСервере();	
		ТабДок.Показать();
	Иначе Сообщить("შეკვეთების ცხრილი ცარიელია");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция  печатьНаСервере()
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ОбработкаСобранныхЗаказов.Макет_ЗаказаннаяПродукция");
	ТабличныйДокумент = Новый ТабличныйДокумент; 	
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_ЗаказаннаяПродукция";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ОбработкаСобранныхЗаказов_ЗаказаннаяПродукция";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗагаловокТабличнойЧасти = Макет.ПолучитьОбласть("ЗагаловокТабличнойЧасти");
	ОбластьТабличнаяЧасть = Макет.ПолучитьОбласть("ТабличнаяЧасть");	
	//ПримерСтруктуры = Новый Структура("Номенклатура, Количество, Единицаизмирения", "reg.ru", "www.craft1c.ru", 2019);
	
	Для Каждого Документ Из СписокПеремещений Цикл    
		Если  Документ.Создать Тогда 
			ОбластьШапки.Параметры.ДатаДокумента =Формат(Документ.Дата, "ДФ=dd.MM.yyyy");
			склад = Документ.Ссылка.ДокументВизита.СтруктурнаяЕдиница;
		КонецЕсли;
	КонецЦикла;	
	ОбластьШапки.Параметры.Склад = склад;
	ТабличныйДокумент.Вывести(ОбластьШапки);
	ТабличныйДокумент.Вывести(ОбластьЗагаловокТабличнойЧасти);
	
	
	МассивСоздать = СписокПеремещений.Выгрузить().ВыгрузитьКолонку("Создать");
	МассивЗаказов = Новый Массив;	
	
	Для Каждого стр Из СписокПеремещений Цикл 
		
		Если стр.Создать Тогда 
			МассивЗаказов.Добавить(стр.Ссылка);
		КонецЕсли;
		
	КонецЦикла;	
	
	
	//	МассивЗаказов = СписокПеремещений.Добавить();
	//Выгрузить().;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказПокупателяЗапасы.Количество) КАК Количество,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Ссылка В(&МассивЗаказов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяЗапасы.Номенклатура,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	
	номерСтроки = 0;
	
	Для Каждого стр Из РезультатЗапроса Цикл 
		номерСтроки  = номерСтроки + 1;
		ОбластьТабличнаяЧасть.Параметры.НомерСтроки = номерСтроки;
		ОбластьТабличнаяЧасть.Параметры.Номенлатура = стр.Номенклатура;
		ОбластьТабличнаяЧасть.Параметры.Количество = стр.Количество;
		ОбластьТабличнаяЧасть.Параметры.ЕдиницаИзмирения = стр.ЕдиницаИзмерения;
		ТабличныйДокумент.Вывести(ОбластьТабличнаяЧасть);	
	КонецЦикла;
	
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции


&НаСервере
Процедура изменитьТоварнуюНакладную()
	
	Для Каждого Документ Из СписокНологовое Цикл
		
		ДокументОбъект=Документ.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(Водитель) Тогда 
			ДокументОбъект.Водитель = Водитель;
			ДокументОбъект.НомерУдостоверения = Водитель.ИНН;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда 
			ДокументОбъект.ТранспортноеСредство = ТранспортноеСредство;
			ДокументОбъект.ГосНомерАвтомобиля =  ТранспортноеСредство.Код;
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(НачалнаяДатаТранспортировки) Тогда 
			ДокументОбъект.ДатаНачалаТранспортировки = НачалнаяДатаТранспортировки;
		КонецЕсли;
		
		ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Функция печатьТоварных()
	
	табДок = Новый Массив;
	Если ЗначениеЗаполнено(СписокНологовое)Тогда 
		//
		Для Каждого документПечати Из СписокНологовое Цикл 
			Если документПечати.Создать Тогда 
				табДок.Добавить(печатьТоварныхНаСервере(документПечати.Ссылка));
			КонецЕсли;
		КонецЦикла;			
	КонецЕсли;
	
	финальныйТабДок = возврашатьФинальныйТабдок(ТабДок);
	
	финальныйТабДок.Показать();
	
	
	//Если ЗначениеЗаполнено(табДок) Тогда 
	//	
	//	Для  Каждого стр Из табДок Цикл 
	//		стр.Показать();
	//	КонецЦикла;
	//	
	//КонецЕсли;
	//
	//
	
	
КонецФункции

&НаСервере
Функция печатьТоварныхНаСервере(документПечати)
	// Вставить содержимое обработчика.	 
	
	ИспользоватьХарактеристики = Константы.ФункциональнаяОпцияИспользоватьХарактеристики.Получить();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОбработкаСобранныхЗаказов_ПФ_MXL_ТоварнаяНакладнаяRS";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплату_ПФ_MXL_ОбработкаСобранныхЗаказов";
	//ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = истина;
	
	
	
	
	//Для Каждого стр Из СписокНологовое Цикл	
	//Если стр.Создать Тогда
	ТекущийДокумент = документПечати; //стр.Ссылка;
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РС_ЭлектроннаяНакладная.ПФ_MXL_ТоварнаяНакладнаяRS");
	
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьПриложение	= Макет.ПолучитьОбласть("Приложение");														
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");	
	ОбластьТовары		= Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьТовары2		= Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	ОбластьПустаяСтрока		= Макет.ПолучитьОбласть("ПустаяСтрока");
	
	ОбластьТЧЛицензииНаВырубкуЛесаШапка  = Макет.ПолучитьОбласть("ТЧЛицензииНаВырубкуЛесаШапка"); 
	ОбластьТЧЛицензииНаВырубкуЛесаСтрока = Макет.ПолучитьОбласть("ТЧЛицензииНаВырубкуЛесаСтрока");
	ОбластьНомерТаблички                 = Макет.ПолучитьОбласть("НомерТаблички");
	ОбластьНадписьЛицензии               = Макет.ПолучитьОбласть("НадписьЛицензии");
	
	ТабличныйДокумент.Очистить();
	
	ВалютаРегл = Константы.НациональнаяВалюта.Получить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",                ТекущийДокумент.Ссылка);
	//Запрос.УстановитьПараметр("ДатаДокумента",		   ТекущийДокумент.Ссылка.Дата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Константы.ЭлектроннаяНакладнаяДатуБратьИзДатыТранспортировки
	|			ТОГДА РС_ЭлектроннаяНакладная.ДатаНачалаТранспортировки
	|		ИНАЧЕ РС_ЭлектроннаяНакладная.ДатаАктивации
	|	КОНЕЦ КАК ДатаПоставки,
	|	РС_ЭлектроннаяНакладная.НомерТН КАК НомерНакладной,
	|	РС_ЭлектроннаяНакладная.Дата КАК ДатаДокумента,
	|	""(დღგ–ს გადამხდელი)"" КАК ПлателщикНДС1,
	|	РС_ЭлектроннаяНакладная.Организация.НаименованиеПолное КАК Отправитель,
	|	РС_ЭлектроннаяНакладная.Организация.ИНН КАК ИННОтправителя,
	|	""(დღგ–ს გადამხდელი)"" КАК ПлателщикНДС2,
	|	РС_ЭлектроннаяНакладная.ГрузоПолучатель.НаименованиеПолное КАК Получатель,
	|	РС_ЭлектроннаяНакладная.ГрузоПолучатель.ИНН КАК ИННПолучателя,
	|	РС_ЭлектроннаяНакладная.ТипТН КАК ТипТТН,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладная.АдресОтправки = """"
	|			ТОГДА ""Х""
	|		ИНАЧЕ РС_ЭлектроннаяНакладная.АдресОтправки
	|	КОНЕЦ КАК АдресНачалаТранспортировки,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладная.ТипТН = ЗНАЧЕНИЕ(Перечисление.РС_ТипыТН.РеализацияБезТранспортировки)
	|			ТОГДА ""Х""
	|		ИНАЧЕ РС_ЭлектроннаяНакладная.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Прочее)
	|			ТОГДА РС_ЭлектроннаяНакладная.КомментарийТН
	|		ИНАЧЕ РС_ЭлектроннаяНакладная.ВидТранспортировки
	|	КОНЕЦ КАК ВидТранспортировки,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладная.ТипТН = ЗНАЧЕНИЕ(Перечисление.РС_ТипыТН.РеализацияБезТранспортировки)
	|			ТОГДА ""Х""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Прочее)
	|						ИЛИ РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Железнодорожная)
	|						ИЛИ РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Авиационная)
	|					ТОГДА ""Х""
	|				ИНАЧЕ РС_ЭлектроннаяНакладная.ГосНомерАвтомобиля
	|			КОНЕЦ
	|	КОНЕЦ КАК НомерТранспорта,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладная.ТипТН = ЗНАЧЕНИЕ(Перечисление.РС_ТипыТН.РеализацияБезТранспортировки)
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Прочее)
	|						ИЛИ РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Железнодорожная)
	|						ИЛИ РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Авиационная)
	|					ТОГДА """"
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РС_ЭлектроннаяНакладная.КомментарийТН = """"""""
	|							ТОГДА ""Х""
	|						ИНАЧЕ РС_ЭлектроннаяНакладная.КомментарийТН
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ОписаниеТранспортировки,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладная.ТипТН = ЗНАЧЕНИЕ(Перечисление.РС_ТипыТН.РеализацияСТранспортировкой)
	|				И НЕ(РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Автомобильная)
	|						ИЛИ РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Автомобильная_Заграничная))
	|			ТОГДА ""Х""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РС_ЭлектроннаяНакладная.ТипТН = ЗНАЧЕНИЕ(Перечисление.РС_ТипыТН.РеализацияБезТранспортировки)
	|					ТОГДА ""Х""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РС_ЭлектроннаяНакладная.НомерУдостоверения = """"
	|							ТОГДА РС_ЭлектроннаяНакладная.Перевозчик.ИНН
	|						ИНАЧЕ РС_ЭлектроннаяНакладная.НомерУдостоверения
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ИННВодителя,
	|	РС_ЭлектроннаяНакладная.СуммаОплатыТранспортировки КАК РасходВодителя,
	|	РС_ЭлектроннаяНакладная.Отпустил КАК ОтправительТТН,
	|	РС_ЭлектроннаяНакладная.Получил КАК ПолучательТТН,
	|	РС_ЭлектроннаяНакладная.ДатаДоставкиТН КАК ДатаЗавершенияТранспортировки,
	|	РС_ЭлектроннаяНакладная.КомментарийТН КАК ПримечаниеТТН,
	|	РС_ЭлектроннаяНакладная.Прицеп
	|ИЗ
	|	Документ.РС_ЭлектроннаяНакладная КАК РС_ЭлектроннаяНакладная,
	|	Константы КАК Константы
	|ГДЕ
	|	РС_ЭлектроннаяНакладная.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РС_ЭлектроннаяНакладнаяТовары.Сумма) КАК Сумма
	|ИЗ
	|	Документ.РС_ЭлектроннаяНакладная.Товары КАК РС_ЭлектроннаяНакладнаяТовары
	|ГДЕ
	|	РС_ЭлектроннаяНакладнаяТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РС_ЭлектроннаяНакладнаяТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РС_ЭлектроннаяНакладнаяТовары.Номенклатура.НаименованиеПолное КАК СТРОКА(1))) = "" ""
	|			ТОГДА РС_ЭлектроннаяНакладнаяТовары.Номенклатура.Наименование
	|		ИНАЧЕ РС_ЭлектроннаяНакладнаяТовары.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладнаяТовары.Номенклатура.ОсновнойШтрихКод = """"
	|			ТОГДА РС_ЭлектроннаяНакладнаяТовары.Номенклатура.Код
	|		ИНАЧЕ РС_ЭлектроннаяНакладнаяТовары.Номенклатура.ОсновнойШтрихКод
	|	КОНЕЦ КАК Код1,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладнаяТовары.Номенклатура.ЕдиницаИзмерения = РС_ЭлектроннаяНакладнаяТовары.ЕдиницаИзмерения
	|			ТОГДА РС_ЭлектроннаяНакладнаяТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ РС_ЭлектроннаяНакладнаяТовары.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	РС_ЭлектроннаяНакладнаяТовары.Количество,
	|	РС_ЭлектроннаяНакладнаяТовары.Цена КАК Цена,
	|	РС_ЭлектроннаяНакладнаяТовары.Сумма КАК Сумма,
	|	РС_ЭлектроннаяНакладнаяТовары.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладнаяТовары.Ссылка.Организация.СоответствиеНоменклатур = ЗНАЧЕНИЕ(Перечисление.СоответствияНоменклатуры.ПоШтрихкоду)
	|			ТОГДА РС_ЭлектроннаяНакладнаяТовары.Номенклатура.ОсновнойШтрихКод
	|		КОГДА РС_ЭлектроннаяНакладнаяТовары.Ссылка.Организация.СоответствиеНоменклатур = ЗНАЧЕНИЕ(Перечисление.СоответствияНоменклатуры.ПоАртикулу)
	|			ТОГДА РС_ЭлектроннаяНакладнаяТовары.Номенклатура.Артикул
	|		ИНАЧЕ РС_ЭлектроннаяНакладнаяТовары.Номенклатура.Код
	|	КОНЕЦ КАК Код,
	|	"""" КАК Код2
	|ИЗ
	|	Документ.РС_ЭлектроннаяНакладная.Товары КАК РС_ЭлектроннаяНакладнаяТовары
	|ГДЕ
	|	РС_ЭлектроннаяНакладнаяТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Выборка = Запрос.ВыполнитьПакет();
	ВыборкаШапка = Выборка[0].Выбрать();
	ВыборкаШапка.Следующий();
	ОбластьШапка.Параметры.Заполнить(ВыборкаШапка);
	Попытка
		ОбластьШапка.Параметры.Дата		= Формат(ТекущийДокумент.Ссылка.ДатаНачалаТранспортировки,	"ДФ=""дд/ММ/гггг"";L = ""ka""");
	Исключение
	КонецПопытки;
	Попытка
		ОбластьШапка.Параметры.Время	= Формат(ТекущийДокумент.Ссылка.ДатаНачалаТранспортировки,	"ДФ=""ЧЧ:мм:сс"";L = ""ka""");	
	Исключение
	КонецПопытки;	
	//Если Ссылка.СтатусТН = Перечисления.РС_СтатусыТН.Отмененный Тогда
	//	ДатаОтмены = ПолучитьДатуОтмены(Ссылка);
	//	Попытка
	//		ОбластьШапка.Параметры.ДатаОтмены	= "გაუქმების თარიღი: " + Формат(ДатаОтмены,	"ДФ=""дд/ММ/гггг"";L = ""ka""");
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	
	Попытка
		ОбластьШапка.Параметры.ИННВодителя = ВыборкаШапка.ИННВодителя + "  " +ВыборкаШапка.Перевозчик;
	Исключение
	КонецПопытки;
	
	//ВыводитьПресселера = МодульСтатическихДанных.ПолучитьВыводитьТорговогоПредставителяПриПечатиНакладной();
	//Если ВыводитьПресселера Тогда
	//	Попытка
	//		ОбластьШапка.Параметры.Преселлер = Строка(ВыборкаШапка.Преселлер);
	//	Исключение
	//	КонецПопытки;
	//Иначе
	Попытка
		ОбластьШапка.Параметры.Преселлер = "";
	Исключение
	КонецПопытки;
	//КонецЕсли;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	НалогообложениеКонтрагентаСрезПоследних.ВидНалогообложения
	//|ИЗ
	//|	РегистрСведений.НалогообложениеКонтрагента.СрезПоследних(&Период, Контрагент = &Контрагент) КАК НалогообложениеКонтрагентаСрезПоследних";
	
	//Запрос.УстановитьПараметр("Период", Ссылка.Дата);
	//Запрос.УстановитьПараметр("Контрагент", Ссылка.Контрагент);
	//Резултат = Запрос.Выполнить().Выбрать();
	//Если Резултат.Следующий() Тогда 
	//	Если Резултат.ВидНалогообложения = Перечисления.НалогообложениеНДС.ОблагаетсяНДС Тогда 
	//		Попытка
	//			ОбластьШапка.Параметры.ПлателщикНДС2 = "(დღგ–ს გადამხდელი)"; 	
	//		Исключение
	//		КонецПопытки;
	//	КонецЕсли;
	//Иначе 
	//	Попытка
	ОбластьШапка.Параметры.ПлателщикНДС2 = "(დღგ–ს გადამხდელი)";
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	
	//ОбластьШапка.Параметры.КатегорияНакладной = ?(ВыборкаШапка.КатегорияТН = Перечисления.КатегорииТТН.Лесопосадки, "ხე-ტყის", "");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ВыгрузкаОбщаяСумма = Выборка[1].Выбрать();
	ВыгрузкаОбщаяСумма.Следующий();
	ОбщаяСумма = ?(ВыгрузкаОбщаяСумма.Сумма = Null, 0, ВыгрузкаОбщаяСумма.Сумма);
	
	
	ОбластьПодвал.Параметры.Заполнить(ВыборкаШапка);		
	Попытка
		ОбластьПодвал.Параметры.ОбщаяСумма = ?(ОбщаяСумма = 0, "0", ?(ОбщаяСумма >= 1, ?(ОбщаяСумма %Цел(ОбщаяСумма)= 0, Формат(ОбщаяСумма, "ЧЦ=15; ЧДЦ=0; ЧРД=.; ЧРГ=' '; ЧН=0"),
		Формат(ОбщаяСумма, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=' '; ЧН=0")),Формат(ОбщаяСумма, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=' '; ЧН=0")));
	Исключение
	КонецПопытки;
	Попытка
		ОбластьПодвал.Параметры.ОбщаяСуммаПрописью = СформироватьСуммуПрописьюБезЦифр(ОбщаяСумма, ВалютаРегл);	 
	Исключение
	КонецПопытки;
	
	Попытка
		ОбластьПодвал.Параметры.Тире ="-";		
	Исключение
	КонецПопытки;
	Попытка
		ОбластьПодвал.Параметры.НаименованиеОтправителя = ?(ВыборкаШапка.ОтправительТТН = Неопределено, "", ?(ЗначениеЗаполнено(ВыборкаШапка.ОтправительТТН.Должность), Строка(ВыборкаШапка.ОтправительТТН.Должность) + ", ", "")+ ВыборкаШапка.ОтправительТТН.Наименование); 
	Исключение
		ОбластьПодвал.Параметры.НаименованиеОтправителя = ВыборкаШапка.ОтправительТТН;
	КонецПопытки;
	Попытка
		ОбластьПодвал.Параметры.НаименованиеПолучателя  = ?(ВыборкаШапка.ПолучательТТН = Неопределено,  "", ?(ЗначениеЗаполнено(ВыборкаШапка.ПолучательТТН.Должность),  Строка(ВыборкаШапка.ПолучательТТН.Должность) + ", ", "") + ВыборкаШапка.ПолучательТТН.Наименование);
	Исключение
		ОбластьПодвал.Параметры.НаименованиеПолучателя  = ВыборкаШапка.ПолучательТТН;
	КонецПопытки;
	Если ТекущийДокумент.СтатусТН = Перечисления.РС_СтатусыТН.Завершеная Тогда 
		Попытка
			ОбластьПодвал.Параметры.ДатаЗавершения			= Формат(ВыборкаШапка.ДатаЗавершенияТранспортировки,	"ДФ=""дд/ММ/гггг"";L = ""ka""");
		Исключение
		КонецПопытки;
		Попытка
			ОбластьПодвал.Параметры.ВремяЗавершения			= Формат(ВыборкаШапка.ДатаЗавершенияТранспортировки,	"ДФ=""ЧЧ:мм:сс"";L = ""ka""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	Попытка
		ОбластьПодвал.Параметры.ВремяПечати				= Формат(ТекущаяДата(), "ДФ=""дд/ММ/гггг, ЧЧ:мм:сс"";L = ""ka""");
	Исключение
	КонецПопытки;
	Попытка
		ОбластьПодвал.Параметры.ПримечаниеТТН = ТекущийДокумент.КомментарийТН;
	Исключение
	КонецПопытки;
	
	Попытка
		ОбластьПриложение.Параметры.Приложения = ВыборкаШапка.НомерНакладной + " სასაქონლო ზედნადების დანართი";
	Исключение
	КонецПопытки;
	
	ТаблицаТовары = Выборка[2].Выгрузить();	
	
	Если ТаблицаТовары.Количество() = 0 Тогда
		ТабличныйДокумент.Вывести(ОбластьТовары);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
	Иначе	
		МассивСтрок = Новый Массив; 
		МассивСтрок.Очистить();
		МассивСтрок.Добавить(ОбластьТовары);
		МассивСтрок.Добавить(ОбластьТовары2);
		МассивСтрок.Добавить(ОбластьПустаяСтрока);
		МассивСтрок.Добавить(ОбластьПустаяСтрока);
		
		//МассивСтрок.Добавить(ОбластьПодвал);		
		КоличествоТоваров = ТаблицаТовары.Количество();	
		Для Каждого ВыборкаТовары Из ТаблицаТовары Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			Попытка
				ОбластьТовары.Параметры.Номенклатура = Строка(ВыборкаТовары.Номенклатура) + ?(ИспользоватьХарактеристики, ?(ЗначениеЗаполнено(ВыборкаТовары.ХарактеристикаНоменклатуры), ", " + Строка(ВыборкаТовары.ХарактеристикаНоменклатуры), ""), "");
			Исключение
			КонецПопытки;
			Если НЕ КоличествоТоваров = 1 Тогда
				ОбластьТовары2.Параметры.Заполнить(ТаблицаТовары[ТаблицаТовары.Количество() - КоличествоТоваров + 1]);						
				Попытка
					ОбластьТовары2.Параметры.Номенклатура = Строка(ВыборкаТовары.Номенклатура) + ?(ИспользоватьХарактеристики, ?(ЗначениеЗаполнено(ВыборкаТовары.ХарактеристикаНоменклатуры), ", " + Строка(ВыборкаТовары.ХарактеристикаНоменклатуры), ""), "");
				Исключение
				КонецПопытки;
			КонецЕсли;
			Если ТабличныйДокумент.ПроверитьВывод(МассивСтрок) Тогда
				ТабличныйДокумент.Вывести(ОбластьТовары);
				КоличествоТоваров = КоличествоТоваров - 1;
				//Если КоличествоТоваров = 6 Тогда
				//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				//	ТабличныйДокумент.Вывести(ОбластьПриложение);
				//	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
				//КонецЕсли;	 
			Иначе
				//ТабличныйДокумент.Вывести(ОбластьПодвал);
				//ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьПриложение);	
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
				ТабличныйДокумент.Вывести(ОбластьТовары);
				КоличествоТоваров = КоличествоТоваров - 1;
			КонецЕсли;
			Если КоличествоТоваров = 0 Тогда
				ТабличныйДокумент.Вывести(ОбластьПодвал);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	//КонецЕсли;
	//КонецЦикла;
	
	Возврат ТабличныйДокумент
	
КонецФункции

Функция СформироватьСуммуПрописьюБезЦифр(Сумма, Валюта)
	
	//Если Валюта.ПараметрыПрописи = "" Тогда
	//	Возврат ФорматСумм(Сумма);                           
	//Иначе                                          		
	Если Валюта.ПараметрыПрописиНаРусском = "" Тогда
		Возврат ФорматСумм(Сумма);
	Иначе
		лСтрока = СтрЗаменить(Валюта.ПараметрыПрописиНаРусском, ",", Символы.ПС);
		ФормСтрока = "Л = ka_RU; ДП = Истина";				
		ПараметрыПрописи = СтрПолучитьСтроку(лСтрока, 1) + ", " + СтрПолучитьСтроку(лСтрока, 5);
		Возврат ЧислоПрописью(Сумма, ФормСтрока, ПараметрыПрописи);
	КонецЕсли;
	//КонецЕсли;                                          
	
КонецФункции
Функция ФорматСумм(Сумма, Валюта = Неопределено, ЧН = "", ЧРГ = "")
	
	ФорматнаяСтрока = "ЧЦ=15;ЧДЦ=2" +
	?(ПустаяСтрока(ЧН), "", ";" + "ЧН=" + ЧН) +
	?(ПустаяСтрока(ЧРГ),"", ";" + "ЧРГ=" + ЧРГ);
	РезультирующаяСтрока = СокрЛ(Формат(Сумма, ФорматнаяСтрока));
	
	Если Валюта <> Неопределено Тогда
		РезультирующаяСтрока = РезультирующаяСтрока + " " + СокрП(Валюта);		
	КонецЕсли;
	
	
	
	Возврат РезультирующаяСтрока;
	
КонецФункции







&НаСервере
Функция возврашатьФинальныйТабдок(массивТабДоков)
	
	финальныйТабДок = Новый ТабличныйДокумент;
	
	Для Каждого табДок Из массивТабДоков Цикл 
		
		финальныйТабДок.Вывести(табДок);
		финальныйТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		финальныйТабДок.АвтоМасштаб = Истина;
		
		
	КонецЦикла;
	
	Возврат финальныйТабДок;
	
	
КонецФункции // возврашатьФинальныйТабдок()

//Lazare 14.06.2021
&НаКлиенте
Процедура ОтборОтветственныйПриИзменении(Элемент)
	Элементы.СписокПеремещений.ОтборСтрок = Новый ФиксированнаяСтруктура ("Автор",Элемент.ВыделенныйТекст );	
КонецПроцедуры

&НаСервере
Функция  печатьГодностьНаСервере(Документ)
	// Вставить содержимое обработчика.
	//
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ОбработкаСобранныхЗаказов.Макет_печатьГодность");
	//ТабличныйДокумент = Новый ТабличныйДокумент; 	
	//ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_печатьГодность";
	//ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ОбработкаСобранныхЗаказов_печатьГодность";
	//ТабличныйДокумент.АвтоМасштаб			= Истина;
	//
	//
	//
	////TODO
	//
	//
	//
	//ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	//ОбластьЗагаловокТабличнойЧасти = Макет.ПолучитьОбласть("ЗагаловокТабличнойЧасти");
	//ОбластьТабличнаяЧасть = Макет.ПолучитьОбласть("ТабличнаяЧасть");	
	////ПримерСтруктуры = Новый Структура("Номенклатура, Количество, Единицаизмирения", "reg.ru", "www.craft1c.ru", 2019);
	//
	//
	//
	////Для Каждого Документ Из СписокРасходнаяНакладная Цикл 
	//
	//Дата = Формат(Документ.Ссылка.Дата, "ДФ=dd.MM.yyyy"); 
	//Изгатовлено = Формат(Документ.Ссылка.Дата - 24*60*60,"ДФ=dd.MM.yyyy");
	//ОбластьШапки.Параметры.Дата =Дата;
	//ОбластьШапки.Параметры.Номер = Документ.Номер;
	//ОбластьШапки.Параметры.Организация = Документ.Организация;
	//ОбластьШапки.Параметры.ИннОрганизации = Документ.Организация.ИНН;
	//ОбластьШапки.Параметры.Контрагент = Документ.Контрагент;
	//ОбластьШапки.Параметры.ИннКонтрагента = Документ.Контрагент.ИНН;
	//ОбластьШапки.Параметры.Контрагент = Документ.Контрагент;
	//ОбластьШапки.Параметры.Договор = Документ.Договор;
	//ОбластьШапки.Параметры.АдресДоговор = Документ.Договор.Адрес;
	//
	//
	//ЛоготипЗаполнен = ЗначениеЗаполнено(Документ.Организация.ФайлЛоготип);
	//Если ЛоготипЗаполнен Тогда
	//	ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(Документ.Организация.ФайлЛоготип);
	//	Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
	//		ОбластьШапки.Рисунки.Логотип.Картинка = Новый Картинка(ДанныеКартинки);
	//	КонецЕсли;
	//КонецЕсли;
	//
	//
	//
	//
	////ОбластьШапки.Параметры.Склад = склад;
	//ТабличныйДокумент.Вывести(ОбластьШапки);
	//ТабличныйДокумент.Вывести(ОбластьЗагаловокТабличнойЧасти);
	//
	////	МассивЗаказов = СписокПеремещений.Добавить();
	////Выгрузить().;
	////
	////
	////Запрос = Новый Запрос;
	////Запрос.Текст = 
	////"ВЫБРАТЬ
	////|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	////|	СУММА(ЗаказПокупателяЗапасы.Количество) КАК Количество,
	////|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения
	////|ИЗ
	////|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	////|ГДЕ
	////|	ЗаказПокупателяЗапасы.Ссылка В(&МассивЗаказов)
	////|
	////|СГРУППИРОВАТЬ ПО
	////|	ЗаказПокупателяЗапасы.Номенклатура,
	////|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения";
	////
	////Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	////
	////РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	////
	////
	//номерСтроки = 0;
	//
	//Для Каждого стр Из Документ.Запасы Цикл 
	//	номерСтроки  = номерСтроки + 1;
	//	ОбластьТабличнаяЧасть.Параметры.НомерСтроки = номерСтроки;
	//	ОбластьТабличнаяЧасть.Параметры.Номенклатура = стр.Номенклатура;
	//	ОбластьТабличнаяЧасть.Параметры.Количество = стр.Количество;
	//	ОбластьТабличнаяЧасть.Параметры.Изгатовлено = Изгатовлено;
	//	Годен = Дата(Изгатовлено + " 00:00:00") + Число(стр.Номенклатура.СрокИсполненияЗаказа)*(24*60*60);
	//	ОбластьТабличнаяЧасть.Параметры.Годен = Формат(Годен,"ДФ=dd.MM.yyyy");
	//	
	//	ТабличныйДокумент.Вывести(ОбластьТабличнаяЧасть);	
	//КонецЦикла;
	//
	//
	//ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//ТабличныйДокумент.ОтображатьСетку = Ложь;
	//ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	////КонецЦикла;
	//Возврат ТабличныйДокумент;
	
	  ТабличныйДокумент =  Документы.РасходнаяНакладная.печатьГодность(Документ,Неопределено);
	  Возврат ТабличныйДокумент;
КонецФункции

&НаКлиенте
Процедура печатьГодность(Команда)
	
	МассивОбъектов = Новый Массив;
	Если ЗначениеЗаполнено(СписокРасходнаяНакладная) Тогда
		Для Каждого документ Из СписокРасходнаяНакладная Цикл 
			Если документ.Печать Тогда 
				МассивОбъектов.Добавить(документ.Ссылка); 
				ТабДок = печатьГодностьНаСервере(МассивОбъектов);	
				ТабДок.Показать();
			КонецЕсли;
		КонецЦикла;
	Иначе Сообщить("გასავლის ზედნადების ცხრილი ცარიელია");
		
	КонецЕсли;
	
	
	
КонецПроцедуры

//Lazare 14.06.2021


//--Rajak

&НаКлиенте
Процедура ОтборОтветственный1ПриИзменении(Элемент)
	ОтборОтветственный1ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтборОтветственный1ПриИзмененииНаСервере()
	
	
	
	Если Константы.ФункционалСбораТоваров.Получить() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаказПокупателя1.Ссылка КАК Ссылка,
		               |	ЗаказПокупателя1.Номер КАК Номер,
		               |	ЗаказПокупателя1.Дата КАК Дата,
		               |	ЗаказПокупателя1.Автор КАК Автор,
		               |	ЗаказПокупателя1.СостояниеЗаказа КАК Статус,
		               |	ИСТИНА КАК Создать,
		               |	ЗаказПокупателя1.Контрагент КАК Покупатель,
		               |	ПеремещениеЗапасовЗапасы.Ссылка КАК ДокПерем
		               |ИЗ
		               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя1
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
		               |		ПО (ПеремещениеЗапасовЗапасы.ЗаказПокупателя = ЗаказПокупателя1.Ссылка)
		               |			И (ПеремещениеЗапасовЗапасы.Ссылка.Проведен = ИСТИНА)
		               |ГДЕ
		               |	ЗаказПокупателя1.Проведен = ИСТИНА
		               |	И (ЗаказПокупателя1.СостояниеЗаказа = &СостояниеЗаказа
		               |			ИЛИ ЗаказПокупателя1.СостояниеЗаказа = &СостояниеЗаказаБорт)
		               |	И ЗаказПокупателя1.Дата МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ЗаказПокупателя1.Ответственный = &Ответственный
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗаказПокупателя1.Ссылка,
		               |	ЗаказПокупателя1.Номер,
		               |	ЗаказПокупателя1.Дата,
		               |	ЗаказПокупателя1.Автор,
		               |	ЗаказПокупателя1.СостояниеЗаказа,
		               |	ЗаказПокупателя1.Контрагент,
		               |	ПеремещениеЗапасовЗапасы.Ссылка";
		
		Запрос.УстановитьПараметр("СостояниеЗаказа",Справочники.СостоянияЗаказовПокупателей.Собран);
		Запрос.УстановитьПараметр("СостояниеЗаказаБорт",Справочники.СостоянияЗаказовПокупателей.ВыгруженНаБорт);
		Запрос.УстановитьПараметр("Ответственный",ОтборОтветственный);
		
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаНач));
		Если ЗначениеЗаполнено(ДатаКон) Тогда
			Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаКон) + 1);
		Иначе
			Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()) + 1 );
		КонецЕсли;
		
		
		СписокПеремещений.Загрузить(Запрос.Выполнить().Выгрузить());
		
		ОкраситьТч();
		
	Иначе //++Rajak
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаказПокупателя1.Ссылка КАК Ссылка,
		               |	ЗаказПокупателя1.Номер КАК Номер,
		               |	ЗаказПокупателя1.Дата КАК Дата,
		               |	ЗаказПокупателя1.Автор КАК Автор,
		               |	ЗаказПокупателя1.СостояниеЗаказа КАК Статус,
		               |	ИСТИНА КАК Создать,
		               |	ЗаказПокупателя1.Контрагент КАК Покупатель,
		               |	ПеремещениеЗапасовЗапасы.Ссылка КАК ДокПерем,
		               |	МАКСИМУМ(ВЫБОР
		               |			КОГДА ЕСТЬNULL(РасходнаяНакладная.Ссылка, ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)
		               |				ТОГДА 0
		               |			КОГДА ЕСТЬNULL(РасходнаяНакладная.Ссылка, ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)
		               |					И РасходнаяНакладная.Ссылка.ПометкаУдаления
		               |				ТОГДА 0
		               |			ИНАЧЕ 1
		               |		КОНЕЦ) КАК ЕстьРН
		               |ПОМЕСТИТЬ ВТ_Предвариельная
		               |ИЗ
		               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя1
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
		               |		ПО (ПеремещениеЗапасовЗапасы.ЗаказПокупателя = ЗаказПокупателя1.Ссылка)
		               |			И (ПеремещениеЗапасовЗапасы.Ссылка.Проведен = ИСТИНА)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
		               |		ПО (РасходнаяНакладная.Заказ = ЗаказПокупателя1.Ссылка)
		               |ГДЕ
		               |	ЗаказПокупателя1.Проведен = ИСТИНА
		               |	И ЗаказПокупателя1.Дата МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ВЫБОР
		               |			КОГДА &Автор = ЗНАЧЕНИЕ(Справочник.Пользователи.Пустаяссылка)
		               |				ТОГДА ИСТИНА
		               |			ИНАЧЕ ЗаказПокупателя1.Автор = &Автор
		               |		КОНЕЦ
		               |	И ЗаказПокупателя1.СостояниеЗаказа <> &СостояниеЗаказа
		               |	И ЗаказПокупателя1.Ответственный = &Ответственный
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗаказПокупателя1.Ссылка,
		               |	ЗаказПокупателя1.Номер,
		               |	ЗаказПокупателя1.Дата,
		               |	ЗаказПокупателя1.Автор,
		               |	ЗаказПокупателя1.СостояниеЗаказа,
		               |	ЗаказПокупателя1.Контрагент,
		               |	ПеремещениеЗапасовЗапасы.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Предвариельная.Ссылка КАК Ссылка,
		               |	ВТ_Предвариельная.Номер КАК Номер,
		               |	ВТ_Предвариельная.Дата КАК Дата,
		               |	ВТ_Предвариельная.Автор КАК Автор,
		               |	ВТ_Предвариельная.Статус КАК Статус,
		               |	ВТ_Предвариельная.Создать КАК Создать,
		               |	ВТ_Предвариельная.Покупатель КАК Покупатель,
		               |	ВТ_Предвариельная.ДокПерем КАК ДокПерем,
		               |	ВТ_Предвариельная.ЕстьРН КАК ЕстьРН
		               |ИЗ
		               |	ВТ_Предвариельная КАК ВТ_Предвариельная
		               |ГДЕ
		               |	ВТ_Предвариельная.ЕстьРН = 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_Предвариельная.Дата,
		               |	ВТ_Предвариельная.Создать,
		               |	ВТ_Предвариельная.Автор,
		               |	ВТ_Предвариельная.Номер,
		               |	ВТ_Предвариельная.ДокПерем,
		               |	ВТ_Предвариельная.Покупатель,
		               |	ВТ_Предвариельная.Статус,
		               |	ВТ_Предвариельная.Ссылка,
		               |	ВТ_Предвариельная.ЕстьРН";
		
		//Запрос.УстановитьПараметр("СостояниеЗаказа",Справочники.СостоянияЗаказовПокупателей.Собран);
		Запрос.УстановитьПараметр("СостояниеЗаказа",Справочники.СостоянияЗаказовПокупателей.Завершен);
		//Если ЗначениеЗаполнено(ТорговыйПредставитель) Тогда 
		Запрос.УстановитьПараметр("Автор",ТорговыйПредставитель);
		Запрос.УстановитьПараметр("Ответственный",ОтборОтветственный);
		
		
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаНач));
		Если ЗначениеЗаполнено(ДатаКон) Тогда
			Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаКон) + 1);
		Иначе
			Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()) + 1 );
		КонецЕсли;
		
		
		СписокПеремещений.Загрузить(Запрос.Выполнить().Выгрузить());
		//--Rajak
		
		ОкраситьТч();

	
	
	
	
КонецПроцедуры




