#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//ПараметрыОтчета=Структура("ВариантОтчета,ДатаНачала,ДатаОкончания,Договор")
Функция ПолучитьРезультат(ПараметрыОтчета, АдресНастроекВоВременномХранилище="") Экспорт
	УстановитьПривилегированныйРежим(Истина);
	СКД=ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СКД,Новый УникальныйИдентификатор);
	
	Если ПустаяСтрока(АдресНастроекВоВременномХранилище) Тогда
		Если ПараметрыОтчета.Свойство("ВариантОтчета") И Не ПустаяСтрока(ПараметрыОтчета.ВариантОтчета) Тогда
			Вариант=СКД.ВариантыНастроек.Найти(ПараметрыОтчета.ВариантОтчета);
			Если Вариант=Неопределено Тогда
			  ВызватьИсключение "Вариант отчета "+ПараметрыОтчета.ВариантОтчета+" не найден";
			КонецЕсли; 
		  Настройка=Вариант.Настройки;
		Иначе	
		  Настройка=КомпоновщикНастроек.ПолучитьНастройки();
		КонецЕсли; 		
	Иначе
		Настройка=ПолучитьИзВременногоХранилища(АдресНастроекВоВременномХранилище);
	КонецЕсли;
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременномХранилище);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройка);
	
	
	НастройкиКомпоновки=ОПТИМУС_ОбменДистрибуция.УстановитьПараметрыОтчета(КомпоновщикНастроек, ПараметрыОтчета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД,НастройкиКомпоновки,,,Тип("ГенераторМакетаКомпоновкиДанных"),Ложь);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ДокументРезультат=Новый ТабличныйДокумент;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);    
	ПроцессорВывода.Вывести(ПроцессорКомпоновки); 
	
  Возврат ДокументРезультат;
КонецФункции // ПолучитьРезультат(ПараметрыОтчета)()

ЭтоОтчетУНФ = Истина;

#КонецЕсли
