#Область ОбщиеПроцедурыИФункции
Функция ПолучитьТелоЗапросаHTTP(ЗапросHTTP)

	ТелоЗапроса = ЗапросHTTP.ПолучитьТелоКакСтроку();
	
	ПОЗ = СтрНайти(ТелоЗапроса,"JSON Data");
	Если ПОЗ>0 Тогда
		
		ТелоЗапроса = СРЕД(ТелоЗапроса,ПОЗ+9);
		
	КонецЕсли;
	
	ТелоЗапроса = СокрЛП(ТелоЗапроса);
	
	Возврат ТелоЗапроса;
КонецФункции // ()

Функция ПоискПоОдномуПараметру(ЗапросHTTP,СтрокаПараметра,ТекстЗапросаПоискаПараметра,ТекстОшибки,УбиратьКавычки=ИСТИНА,УбиратьПробелы=ИСТИНА,ДопПараметр=НЕОПРЕДЕЛЕНО)
	ПЕРЕМ ТекПараметр;
	
	СтруктураОтвета = Новый Структура("IsSuccess,Value,Message",ИСТИНА,"","");		
	Ответ = Новый HTTPСервисОтвет(200);
	
	ТекПараметр = ЗапросHTTP.ПараметрыЗапроса.Получить(СтрокаПараметра);
	
	Если ТекПараметр = НЕОПРЕДЕЛЕНО Тогда
	
		ТелоЗапроса = ПолучитьТелоЗапросаHTTP(ЗапросHTTP);
		Попытка
			
			Флаг = ЛОЖЬ;
			
			ТекстЗапроса = Новый ЧтениеJSON();
			ТекстЗапроса.УстановитьСтроку(ТелоЗапроса);
			Пока ТекстЗапроса.Прочитать() Цикл
				
				ТекTип = ТекстЗапроса.ТипТекущегоЗначения;
				Если ТекTип = ТипЗначенияJSON.ИмяСвойства Тогда
					
					Если ТекстЗапроса.ТекущееЗначение = СтрокаПараметра Тогда
					
						Флаг = ИСТИНА;
					
					КонецЕсли;
					
				ИначеЕсли ((ТекTип = ТипЗначенияJSON.Строка) ИЛИ (ТекTип = ТипЗначенияJSON.Строка)) И Флаг Тогда
					
					ТекПараметр = ТекстЗапроса.ТекущееЗначение;
					Флаг = ЛОЖЬ;
					
				КонецЕсли;
				
			КонецЦикла;
			ТекстЗапроса.Закрыть();
			
		Исключение
			
			Поз = СтрНайти(ТелоЗапроса,СтрокаПараметра+"=""");
			Если Поз>0 Тогда
			
				ТекПараметр = СРЕД(ТелоЗапроса,Поз+11);
				Поз1 = СтрНайти(ТекПараметр,"""");
				Если Поз1>0 И УбиратьКавычки Тогда
				
					//ТекПараметр = ЛЕВ(ТекПараметр,Поз1-1);
					ТекПараметр = СтрЗаменить(ТекПараметр,"""","")
				
				КонецЕсли;
			
			КонецЕсли;
			
		КонецПопытки;
	
	КонецЕсли;
	
	Если УбиратьКавычки Тогда
		ТекПараметр = СтрЗаменить(ТекПараметр,"""","")
	КонецЕсли;
	
	Если ТекПараметр = НЕОПРЕДЕЛЕНО Тогда
	
		Ответ = Новый HTTPСервисОтвет(400);
		СтруктураОтвета.IsSuccess = ЛОЖЬ;
		СтруктураОтвета.Value = "";
		СтруктураОтвета.Message = ТекстОшибки;
		
	Иначе
		
		Если УбиратьПробелы Тогда
			ТекПараметр = СтрЗаменить(ТекПараметр," ","");
		Иначе
			ТекПараметр = СокрЛП(Строка(ТекПараметр));
		КонецЕсли;
			
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаПоискаПараметра;
		
		Запрос.УстановитьПараметр("ТекПараметр", ТекПараметр);
		Если НЕ ДопПараметр=НЕОПРЕДЕЛЕНО Тогда
			Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
		КонецЕсли;
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
		
			Ответ = Новый HTTPСервисОтвет(400);
			СтруктураОтвета.IsSuccess = ЛОЖЬ;
			СтруктураОтвета.Message = ТекстОшибки;
		
		
		КонецЕсли;
		
		СтруктураОтвета.Value = ТекПараметр;

	КонецЕсли;
	
	ТелоОтвета = Новый ЗаписьJSON();
	ТелоОтвета.УстановитьСтроку();
	ЗаписатьJSON(ТелоОтвета, СтруктураОтвета);
	ТелоОтвета = ТелоОтвета.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;	

КонецФункции
#КонецОбласти

#Область СтандартныеОперации
Функция СтандартныеОперации(ЗапросHTTP,СтрокаОперации,СтрокаСодержанияУдачногоЗавершения)
	ПЕРЕМ ДеревоОбъектов;
	
	СтруктураОтвета = Новый Структура("IsSuccess,Value,Message",ИСТИНА,"","");
	Если НЕ ТипЗНЧ(СтрокаОперации)=Тип("Строка") Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		СтруктураОтвета.IsSuccess = ЛОЖЬ;
		СтруктураОтвета.Message = "String data would be truncated (Description)";
		
		ТелоОтвета = Новый ЗаписьJSON();
		ТелоОтвета.УстановитьСтроку();
		ЗаписатьJSON(ТелоОтвета, СтруктураОтвета);
		ТелоОтвета = ТелоОтвета.Закрыть();
		
		Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		
		Возврат Ответ;
	ИначеЕсли СтрДлина(СокрЛП(СтрокаОперации))=0 Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		СтруктураОтвета.IsSuccess = ЛОЖЬ;
		СтруктураОтвета.Message = "String data would be truncated (Description)";
		
		ТелоОтвета = Новый ЗаписьJSON();
		ТелоОтвета.УстановитьСтроку();
		ЗаписатьJSON(ТелоОтвета, СтруктураОтвета);
		ТелоОтвета = ТелоОтвета.Закрыть();
		
		Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		
		Возврат Ответ;
	КонецЕсли;
			
	Ответ = Новый HTTPСервисОтвет(200);
	
	ТелоЗапроса = ПолучитьТелоЗапросаHTTP(ЗапросHTTP);
		
	Попытка
	
		ТекстЗапроса = Новый ЧтениеJSON();
		ТекстЗапроса.УстановитьСтроку(ТелоЗапроса);
		
		РозницаHTTP.СформироватьДеревоJSON(ТекстЗапроса, ДеревоОбъектов);
		
		ТекстЗапроса.Закрыть();
		
	Исключение
		
		Ответ = Новый HTTPСервисОтвет(400);
		СтруктураОтвета.IsSuccess = ЛОЖЬ;
		СтруктураОтвета.Value = "";
		СтруктураОтвета.Message = "Invalid format data";
		
	КонецПопытки;
	
	Если НЕ (ТипЗНЧ(ДеревоОбъектов)=Тип("Массив") ИЛИ ТипЗНЧ(ДеревоОбъектов)=Тип("Соответствие")) Тогда
		
		Ответ = Новый HTTPСервисОтвет(400);
		СтруктураОтвета.IsSuccess = ЛОЖЬ;
		СтруктураОтвета.Value = "";
		СтруктураОтвета.Message = "Invalid format data";
		
	Иначе

		СтруктураДляВозврата = Новый Структура("Результат,ВозвращаемоеЗначение,Описание");
		
		Если СтрокаОперации="СоздатьНоменклатуру" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"OptionCode");
		ИначеЕсли СтрокаОперации="ОбновитьНоменклатуру" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"OptionCode");
		ИначеЕсли СтрокаОперации="УдалитьНоменклатуру" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"OptionCode");
			
		ИначеЕсли СтрокаОперации="СоздатьКонтрагента" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"CIN");
		ИначеЕсли СтрокаОперации="ОбновитьКонтрагента" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"CIN");
		ИначеЕсли СтрокаОперации="УдалитьКонтрагента" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"CIN");
			
		ИначеЕсли СтрокаОперации="СоздатьПриходнуюНакладную" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="ОбновитьПриходнуюНакладную" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="УдалитьПриходнуюНакладную" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
			
		ИначеЕсли СтрокаОперации="СоздатьВозвратТоваровОтПокупателя" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="ОбновитьВозвратТоваровОтПокупателя" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="УдалитьВозвратТоваровОтПокупателя" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
			
		ИначеЕсли СтрокаОперации="СоздатьПеремещениеЗапасов" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="ОбновитьПеремещениеЗапасов" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="УдалитьПеремещениеЗапасов" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
			
		ИначеЕсли СтрокаОперации="СоздатьПриходныйОрдер" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="ОбновитьПриходныйОрдер" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="УдалитьПриходныйОрдер" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
			
		ИначеЕсли СтрокаОперации="СоздатьРасходныйОрдер" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="ОбновитьРасходныйОрдер" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="УдалитьРасходныйОрдер" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
			
		ИначеЕсли СтрокаОперации="СоздатьОприходованиеЗапасовИзлишки" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="ОбновитьОприходованиеЗапасовИзлишки" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="СоздатьОприходованиеЗапасовИнвентаризация" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="ОбновитьОприходованиеЗапасовИнвентаризация" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="УдалитьОприходованиеЗапасов" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
			
		ИначеЕсли СтрокаОперации="СоздатьСписаниеЗапасовНедостача" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="ОбновитьСписаниеЗапасовНедостача" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="СоздатьСписаниеЗапасовУниформа" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="ОбновитьСписаниеЗапасовУниформа" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="СоздатьСписаниеЗапасовУтилизация" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="ОбновитьСписаниеЗапасовУтилизация" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="СоздатьСписаниеЗапасовИнвентаризация" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="ОбновитьСписаниеЗапасовИнвентаризация" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="УдалитьСписаниеЗапасов" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
			
		ИначеЕсли СтрокаОперации="СоздатьРасходнуюНакладную" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="ОбновитьРасходнуюНакладную" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="УдалитьРасходнуюНакладную" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
			
		ИначеЕсли СтрокаОперации="СоздатьОтчетОРозничныхПродажах" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="ОбновитьОтчетОРозничныхПродажах" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="УдалитьОтчетОРозничныхПродажах" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
			
		ИначеЕсли СтрокаОперации="СоздатьПеремещениеДС" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="ОбновитьПеремещениеДС" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
		ИначеЕсли СтрокаОперации="УдалитьПеремещениеДС" Тогда
			РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");
			
		ИначеЕсли СтрокаОперации="СоздатьДокументИнвентаризации" Тогда
			 РЕЗ = РозницаHTTP.ОбработатьСтандартнуюОперацию(СтруктураДляВозврата,ДеревоОбъектов,СтрокаОперации,"Ref");

			 
			 
		Иначе
			Ответ = Новый HTTPСервисОтвет(400);
			СтруктураОтвета.IsSuccess = ЛОЖЬ;
			СтруктураОтвета.Message = "String data would be truncated (Description)";
			
			ТелоОтвета = Новый ЗаписьJSON();
			ТелоОтвета.УстановитьСтроку();
			ЗаписатьJSON(ТелоОтвета, СтруктураОтвета);
			ТелоОтвета = ТелоОтвета.Закрыть();
			
			Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
			
			Возврат Ответ;
		КонецЕсли;

		Если ТипЗНЧ(РЕЗ)=Тип("Массив") Тогда
			
			МассивОтветов = Новый Массив();
			
			Ответ = Новый HTTPСервисОтвет(200);
			Для каждого СтрРЕЗ Из РЕЗ Цикл
			
				СтрМассивОтветов = Новый Структура("IsSuccess,Value,Message",СтрРЕЗ.Результат,СтрРЕЗ.ВозвращаемоеЗначение,СтрРЕЗ.Описание);
				МассивОтветов.Добавить(СтрМассивОтветов);
							
			КонецЦикла; 
			СтруктураОтвета = МассивОтветов;
			
		ИначеЕсли (ТипЗНЧ(РЕЗ)=Тип("Структура"))ИЛИ(ТипЗНЧ(РЕЗ)=Тип("Соответствие")) Тогда
			Если РЕЗ.Результат Тогда
				
				СтруктураОтвета.IsSuccess = ИСТИНА;
				Если СтрДлина(СокрЛП(РЕЗ.Описание))=0 Тогда
					СтруктураОтвета.Message = СтрокаСодержанияУдачногоЗавершения;
				Иначе
					СтруктураОтвета.Message = СокрЛП(РЕЗ.Описание);
				КонецЕсли;
				
			Иначе
				
				Ответ = Новый HTTPСервисОтвет(400);
				СтруктураОтвета.IsSuccess = ЛОЖЬ;
				Если СтрДлина(СокрЛП(РЕЗ.Описание))=0 Тогда
					СтруктураОтвета.Message = "String data would be truncated (Description)";
				Иначе
					СтруктураОтвета.Message = СокрЛП(РЕЗ.Описание);
				КонецЕсли;
				
			КонецЕсли;
			СтруктураОтвета.Value = РЕЗ.ВозвращаемоеЗначение;
		Иначе
			
			Ответ = Новый HTTPСервисОтвет(400);
			СтруктураОтвета.IsSuccess = ЛОЖЬ;
			Если СтрДлина(СокрЛП(РЕЗ.Описание))=0 Тогда
				СтруктураОтвета.Message = "String data would be truncated (Description)";
			Иначе
				СтруктураОтвета.Message = СокрЛП(РЕЗ.Описание);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТелоОтвета = Новый ЗаписьJSON();
	ТелоОтвета.УстановитьСтроку();
	ЗаписатьJSON(ТелоОтвета, СтруктураОтвета);
	ТелоОтвета = ТелоОтвета.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область Номенклатура
Функция ProductCheck(Запрос)
	
	СтрокаПараметра = "ProductId";
	
	ТекстЗапросаПоискаПараметра = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул = &ТекПараметр
		|	И НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления";
	
	ТекстОшибки = "Product not found";
	
	УбиратьКавычки=ИСТИНА;
	УбиратьПробелы=ИСТИНА;
	
	Ответ = ПоискПоОдномуПараметру(Запрос,СтрокаПараметра,ТекстЗапросаПоискаПараметра,ТекстОшибки,УбиратьКавычки=ИСТИНА,УбиратьПробелы=ИСТИНА);
		
	Возврат Ответ;
КонецФункции

Функция ProductCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьНоменклатуру","Product created successfully");
	
	Возврат Ответ;
КонецФункции

Функция ProductUpdate(Запрос)
		
	Ответ = СтандартныеОперации(Запрос,"ОбновитьНоменклатуру","Product updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция ProductDelete(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"УдалитьНоменклатуру","Product deleted successfully");
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область Контрагенты
Функция PartnerCheck(Запрос)
	
	СтрокаПараметра = "CIN";
	
	ТекстЗапросаПоискаПараметра = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ТекПараметр
		|	И НЕ Контрагенты.ЭтоГруппа
		|	И НЕ Контрагенты.ПометкаУдаления";
	
	ТекстОшибки = "Partner not found";
	
	УбиратьКавычки=ИСТИНА;
	УбиратьПробелы=ИСТИНА;
	
	Ответ = ПоискПоОдномуПараметру(Запрос,СтрокаПараметра,ТекстЗапросаПоискаПараметра,ТекстОшибки,УбиратьКавычки=ИСТИНА,УбиратьПробелы=ИСТИНА);

	Возврат Ответ;
КонецФункции

Функция PartnerCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьКонтрагента","Partner created successfully");
	
	Возврат Ответ;
КонецФункции

Функция PartnerUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьКонтрагента","Partner updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция PartnerDelete(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"УдалитьКонтрагента","Partner deleted successfully");
	
	Возврат Ответ;
КонецФункции

Функция PartnerGetRetailCustomer(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(400);
	
	СтруктураОтвета = Новый Структура("IsSuccess,Value,Message",ИСТИНА,"","");
	
	СтруктураРозничногоПокупателя = РозницаHTTP.ПолучитьРозничногоПокупателя();
	
	Если СтруктураРозничногоПокупателя.Результат Тогда
		
		Ответ = Новый HTTPСервисОтвет(200);
		
		СтруктураОтвета.IsSuccess = ИСТИНА;
		СтруктураОтвета.Value = СтруктураРозничногоПокупателя.ВозвращаемоеЗначение;
		СтруктураОтвета.Message = СокрЛП(СтруктураРозничногоПокупателя.Описание);
		
	Иначе
		
		Ответ = Новый HTTPСервисОтвет(400);
		СтруктураОтвета.IsSuccess = ЛОЖЬ;
		Если СтрДлина(СокрЛП(СтруктураРозничногоПокупателя.Описание))=0 Тогда
			СтруктураОтвета.Message = "Error";
		Иначе
			СтруктураОтвета.Message = СокрЛП(СтруктураРозничногоПокупателя.Описание);
		КонецЕсли;
		
	КонецЕсли;
	
	ТелоОтвета = Новый ЗаписьJSON();
	ТелоОтвета.УстановитьСтроку();
	ЗаписатьJSON(ТелоОтвета, СтруктураОтвета);
	ТелоОтвета = ТелоОтвета.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область ПриходнаяНакладная
Функция PurchaseDocCheck(Запрос)
	
	СтрокаПараметра = "Ref";
	
	СтруктураДополнительныхРеквизитовПриходнаяНакладная = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная);
	ДопПараметр = СтруктураДополнительныхРеквизитовПриходнаяНакладная.DocRef;
	
	ТекстЗапросаПоискаПараметра = "ВЫБРАТЬ ПЕРВЫЕ 1
	                              |	ПриходнаяНакладнаяДополнительныеРеквизиты.Ссылка
	                              |ИЗ
	                              |	Документ.ПриходнаяНакладная.ДополнительныеРеквизиты КАК ПриходнаяНакладнаяДополнительныеРеквизиты
	                              |ГДЕ
	                              |	ПриходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
	                              |	И ПриходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ТекстОшибки = "Doc purchase not found";
	
	УбиратьКавычки=ИСТИНА;
	УбиратьПробелы=ИСТИНА;
	
	Ответ = ПоискПоОдномуПараметру(Запрос,СтрокаПараметра,ТекстЗапросаПоискаПараметра,ТекстОшибки,УбиратьКавычки=ИСТИНА,УбиратьПробелы=ИСТИНА,ДопПараметр);
		
	Возврат Ответ;
КонецФункции

Функция PurchaseDocCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьПриходнуюНакладную","Doc purchase created successfully");
	
	Возврат Ответ;
КонецФункции

Функция PurchaseDocUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьПриходнуюНакладную","Doc purchase updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция PurchaseDocDelete(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"УдалитьПриходнуюНакладную","Doc purchase deleted successfully");
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область ПеремещениеЗапасов
Функция TransferDocCheck(Запрос)
	
	СтрокаПараметра = "Ref";
	
	СтруктураДополнительныхРеквизитовПриходнаяНакладная = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеЗапасов);
	ДопПараметр = СтруктураДополнительныхРеквизитовПриходнаяНакладная.DocRef;
	
	ТекстЗапросаПоискаПараметра = "ВЫБРАТЬ ПЕРВЫЕ 1
	                              |	ПеремещениеЗапасовДополнительныеРеквизиты.Ссылка
	                              |ИЗ
	                              |	Документ.ПеремещениеЗапасов.ДополнительныеРеквизиты КАК ПеремещениеЗапасовДополнительныеРеквизиты
	                              |ГДЕ
	                              |	ПеремещениеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
	                              |	И ПеремещениеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ТекстОшибки = "Doc transfer not found";
	
	УбиратьКавычки=ИСТИНА;
	УбиратьПробелы=ИСТИНА;
	
	Ответ = ПоискПоОдномуПараметру(Запрос,СтрокаПараметра,ТекстЗапросаПоискаПараметра,ТекстОшибки,УбиратьКавычки=ИСТИНА,УбиратьПробелы=ИСТИНА,ДопПараметр);
		
	Возврат Ответ;
КонецФункции

Функция TransferDocCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьПеремещениеЗапасов","Doc transfer created successfully");
	
	Возврат Ответ;
КонецФункции

Функция TransferDocUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьПеремещениеЗапасов","Doc transfer updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция TransferDocDelete(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"УдалитьПеремещениеЗапасов","Doc transfer deleted successfully");
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область ПриходныйОрдер
Функция IncomeOrderDocCheck(Запрос)
	
	СтрокаПараметра = "Ref";
	
	СтруктураДополнительныхРеквизитовПриходнаяНакладная = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходныйОрдер);
	ДопПараметр = СтруктураДополнительныхРеквизитовПриходнаяНакладная.DocRef;
	
	ТекстЗапросаПоискаПараметра = "ВЫБРАТЬ ПЕРВЫЕ 1
	                              |	ПриходныйОрдерДополнительныеРеквизиты.Ссылка
	                              |ИЗ
	                              |	Документ.ПриходныйОрдер.ДополнительныеРеквизиты КАК ПриходныйОрдерДополнительныеРеквизиты
	                              |ГДЕ
	                              |	ПриходныйОрдерДополнительныеРеквизиты.Значение = &ТекПараметр
	                              |	И ПриходныйОрдерДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ТекстОшибки = "Doc income order not found";
	
	УбиратьКавычки=ИСТИНА;
	УбиратьПробелы=ИСТИНА;
	
	Ответ = ПоискПоОдномуПараметру(Запрос,СтрокаПараметра,ТекстЗапросаПоискаПараметра,ТекстОшибки,УбиратьКавычки=ИСТИНА,УбиратьПробелы=ИСТИНА,ДопПараметр);
		
	Возврат Ответ;
КонецФункции

Функция IncomeOrderDocCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьПриходныйОрдер","Doc income order created successfully");
	
	Возврат Ответ;
КонецФункции

Функция IncomeOrderDocUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьПриходныйОрдер","Doc income order updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция IncomeOrderDocDelete(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"УдалитьПриходныйОрдер","Doc income order deleted successfully");
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область РасходныйОрдер
Функция ExpenseOrderDocCheck(Запрос)
	
	СтрокаПараметра = "Ref";
	
	СтруктураДополнительныхРеквизитовПриходнаяНакладная = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходныйОрдер);
	ДопПараметр = СтруктураДополнительныхРеквизитовПриходнаяНакладная.DocRef;
	
	ТекстЗапросаПоискаПараметра = "ВЫБРАТЬ ПЕРВЫЕ 1
	                              |	РасходныйОрдерДополнительныеРеквизиты.Ссылка
	                              |ИЗ
	                              |	Документ.РасходныйОрдер.ДополнительныеРеквизиты КАК РасходныйОрдерДополнительныеРеквизиты
	                              |ГДЕ
	                              |	РасходныйОрдерДополнительныеРеквизиты.Значение = &ТекПараметр
	                              |	И РасходныйОрдерДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ТекстОшибки = "Doc expense order not found";
	
	УбиратьКавычки=ИСТИНА;
	УбиратьПробелы=ИСТИНА;
	
	Ответ = ПоискПоОдномуПараметру(Запрос,СтрокаПараметра,ТекстЗапросаПоискаПараметра,ТекстОшибки,УбиратьКавычки=ИСТИНА,УбиратьПробелы=ИСТИНА,ДопПараметр);
		
	Возврат Ответ;
КонецФункции

Функция ExpenseOrderDocCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьРасходныйОрдер","Doc expense order created successfully");
	
	Возврат Ответ;
КонецФункции

Функция ExpenseOrderDocUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьРасходныйОрдер","Doc expense order updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция ExpenseOrderDocDelete(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"УдалитьРасходныйОрдер","Doc expense order deleted successfully");
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область ОприходованиеЗапасов
Функция SurplusDocCheck(Запрос)
	
	СтрокаПараметра = "Ref";
	
	СтруктураДополнительныхРеквизитовПриходнаяНакладная = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОприходованиеЗапасов);
	ДопПараметр = СтруктураДополнительныхРеквизитовПриходнаяНакладная.DocRef;
	
	ТекстЗапросаПоискаПараметра = "ВЫБРАТЬ ПЕРВЫЕ 1
	                              |	ОприходованиеЗапасовДополнительныеРеквизиты.Ссылка
	                              |ИЗ
	                              |	Документ.ОприходованиеЗапасов.ДополнительныеРеквизиты КАК ОприходованиеЗапасовДополнительныеРеквизиты
	                              |ГДЕ
	                              |	ОприходованиеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
	                              |	И ОприходованиеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ТекстОшибки = "Doc surplus not found";
	
	УбиратьКавычки=ИСТИНА;
	УбиратьПробелы=ИСТИНА;
	
	Ответ = ПоискПоОдномуПараметру(Запрос,СтрокаПараметра,ТекстЗапросаПоискаПараметра,ТекстОшибки,УбиратьКавычки=ИСТИНА,УбиратьПробелы=ИСТИНА,ДопПараметр);
		
	Возврат Ответ;
КонецФункции

Функция SurplusDocCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьОприходованиеЗапасовИзлишки","Doc surplus created successfully");
	
	Возврат Ответ;
КонецФункции

Функция SurplusDocUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьОприходованиеЗапасовИзлишки","Doc surplus updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция SurplusInventoryDocCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьОприходованиеЗапасовИнвентаризация","Doc surplus created successfully");
	
	Возврат Ответ;
КонецФункции

Функция SurplusInventoryDocUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьОприходованиеЗапасовИнвентаризация","Doc surplus updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция SurplusDocDelete(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"УдалитьОприходованиеЗапасов","Doc surplus deleted successfully");
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область СписаниеЗапасов
Функция WriteОffDocCheck(Запрос)
	
	СтрокаПараметра = "Ref";
	
	СтруктураДополнительныхРеквизитовПриходнаяНакладная = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СписаниеЗапасов);
	ДопПараметр = СтруктураДополнительныхРеквизитовПриходнаяНакладная.DocRef;
	
	ТекстЗапросаПоискаПараметра = "ВЫБРАТЬ ПЕРВЫЕ 1
	                              |	СписаниеЗапасовДополнительныеРеквизиты.Ссылка
	                              |ИЗ
	                              |	Документ.СписаниеЗапасов.ДополнительныеРеквизиты КАК СписаниеЗапасовДополнительныеРеквизиты
	                              |ГДЕ
	                              |	СписаниеЗапасовДополнительныеРеквизиты.Значение = &ТекПараметр
	                              |	И СписаниеЗапасовДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ТекстОшибки = "Doc write-off not found";
	
	УбиратьКавычки=ИСТИНА;
	УбиратьПробелы=ИСТИНА;
	
	Ответ = ПоискПоОдномуПараметру(Запрос,СтрокаПараметра,ТекстЗапросаПоискаПараметра,ТекстОшибки,УбиратьКавычки=ИСТИНА,УбиратьПробелы=ИСТИНА,ДопПараметр);
		
	Возврат Ответ;
КонецФункции

Функция WriteОffDocCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьСписаниеЗапасовНедостача","Doc write-off created successfully");
	
	Возврат Ответ;
КонецФункции

Функция WriteОffDocUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьСписаниеЗапасовНедостача","Doc write-off updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция WriteОffUniformDocCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьСписаниеЗапасовУниформа","Doc write-off created successfully");
	
	Возврат Ответ;
КонецФункции

Функция WriteОffUniformDocUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьСписаниеЗапасовУниформа","Doc write-off updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция WriteОffUtilizationDocCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьСписаниеЗапасовУтилизация","Doc write-off created successfully");
	
	Возврат Ответ;
КонецФункции

Функция WriteОffUtilizationDocUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьСписаниеЗапасовУтилизация","Doc write-off updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция WriteОffInventoryDocCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьСписаниеЗапасовИнвентаризация","Doc write-off created successfully");
	
	Возврат Ответ;
КонецФункции

Функция WriteОffInventoryDocUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьСписаниеЗапасовИнвентаризация","Doc write-off updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция WriteОffDocDelete(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"УдалитьСписаниеЗапасов","Doc write-off deleted successfully");
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область РасходнаяНакладная
Функция SaleDocCheck(Запрос)
	
	СтрокаПараметра = "Ref";
	
	СтруктураДополнительныхРеквизитовПриходнаяНакладная = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
	ДопПараметр = СтруктураДополнительныхРеквизитовПриходнаяНакладная.DocRef;
	
	ТекстЗапросаПоискаПараметра = "ВЫБРАТЬ ПЕРВЫЕ 1
	                              |	РасходнаяНакладнаяДополнительныеРеквизиты.Ссылка
	                              |ИЗ
	                              |	Документ.РасходнаяНакладная.ДополнительныеРеквизиты КАК РасходнаяНакладнаяДополнительныеРеквизиты
	                              |ГДЕ
	                              |	РасходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
	                              |	И РасходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ТекстОшибки = "Doc sale not found";
	
	УбиратьКавычки=ИСТИНА;
	УбиратьПробелы=ИСТИНА;
	
	Ответ = ПоискПоОдномуПараметру(Запрос,СтрокаПараметра,ТекстЗапросаПоискаПараметра,ТекстОшибки,УбиратьКавычки=ИСТИНА,УбиратьПробелы=ИСТИНА,ДопПараметр);
		
	Возврат Ответ;
КонецФункции

Функция SaleDocCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьРасходнуюНакладную","Doc sale created successfully");
	
	Возврат Ответ;
КонецФункции

Функция SaleDocUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьРасходнуюНакладную","Doc sale updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция SaleDocDelete(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"УдалитьРасходнуюНакладную","Doc sale deleted successfully");
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область ОтчетОРозничныхПродажах
Функция RetailDocCheck(Запрос)
	
	СтрокаПараметра = "Ref";
	
	СтруктураДополнительныхРеквизитовПриходнаяНакладная = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОтчетОРозничныхПродажах);
	ДопПараметр = СтруктураДополнительныхРеквизитовПриходнаяНакладная.DocRef;
	
	ТекстЗапросаПоискаПараметра = "ВЫБРАТЬ ПЕРВЫЕ 1
	                              |	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Ссылка
	                              |ИЗ
	                              |	Документ.ОтчетОРозничныхПродажах.ДополнительныеРеквизиты КАК ОтчетОРозничныхПродажахДополнительныеРеквизиты
	                              |ГДЕ
	                              |	ОтчетОРозничныхПродажахДополнительныеРеквизиты.Значение = &ТекПараметр
	                              |	И ОтчетОРозничныхПродажахДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ТекстОшибки = "Doc retail not found";
	
	УбиратьКавычки=ИСТИНА;
	УбиратьПробелы=ИСТИНА;
	
	Ответ = ПоискПоОдномуПараметру(Запрос,СтрокаПараметра,ТекстЗапросаПоискаПараметра,ТекстОшибки,УбиратьКавычки=ИСТИНА,УбиратьПробелы=ИСТИНА,ДопПараметр);
		
	Возврат Ответ;
КонецФункции

Функция RetailDocCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьОтчетОРозничныхПродажах","Doc retail created successfully");
	
	Возврат Ответ;
КонецФункции

Функция RetailDocUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьОтчетОРозничныхПродажах","Doc retail updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция RetailDocDelete(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"УдалитьОтчетОРозничныхПродажах","Doc retail deleted successfully");
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область ВозвратТоваровОтПокупателя
Функция ReturnOfGoodsDocCheck(Запрос)
	
	СтрокаПараметра = "Ref";
	
	СтруктураДополнительныхРеквизитовПриходнаяНакладная = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная);
	ДопПараметр = СтруктураДополнительныхРеквизитовПриходнаяНакладная.DocRef;
	
	ТекстЗапросаПоискаПараметра = "ВЫБРАТЬ ПЕРВЫЕ 1
	                              |	ПриходнаяНакладнаяДополнительныеРеквизиты.Ссылка
	                              |ИЗ
	                              |	Документ.ПриходнаяНакладная.ДополнительныеРеквизиты КАК ПриходнаяНакладнаяДополнительныеРеквизиты
	                              |ГДЕ
	                              |	ПриходнаяНакладнаяДополнительныеРеквизиты.Значение = &ТекПараметр
	                              |	И ПриходнаяНакладнаяДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ТекстОшибки = "Doc return of goods not found";
	
	УбиратьКавычки=ИСТИНА;
	УбиратьПробелы=ИСТИНА;
	
	Ответ = ПоискПоОдномуПараметру(Запрос,СтрокаПараметра,ТекстЗапросаПоискаПараметра,ТекстОшибки,УбиратьКавычки=ИСТИНА,УбиратьПробелы=ИСТИНА,ДопПараметр);
		
	Возврат Ответ;
КонецФункции

Функция ReturnOfGoodsDocCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьВозвратТоваровОтПокупателя","Doc return of goods created successfully");
	
	Возврат Ответ;
КонецФункции

Функция ReturnOfGoodsDocUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьВозвратТоваровОтПокупателя","Doc return of goods updated successfully");
	
	Возврат Ответ;
КонецФункции

Функция ReturnOfGoodsDocDelete(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"УдалитьВозвратТоваровОтПокупателя","Doc return of goods deleted successfully");
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область Сотрудники 
Функция GetEmployee(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	СтруктураОтвета = РозницаHTTP.ПолучитьМассивСотрудников();
	
	ТелоОтвета = Новый ЗаписьJSON();
	ТелоОтвета.УстановитьСтроку();
	ЗаписатьJSON(ТелоОтвета, СтруктураОтвета);
	ТелоОтвета = ТелоОтвета.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);

	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область СтруктураПодчиненности
Функция CheckWithReference(ЗапросHTTP)

	СтрокаПараметра = "Ref";
	
	СтруктураОтвета = Новый Структура("IsSuccess,Value,Message",ИСТИНА,"","");		
	Ответ = Новый HTTPСервисОтвет(200);
	
	ТекСсылка = ЗапросHTTP.ПараметрыЗапроса.Получить(СтрокаПараметра);
	
	Если ТекСсылка = НЕОПРЕДЕЛЕНО Тогда
	
		ТелоЗапроса = ПолучитьТелоЗапросаHTTP(ЗапросHTTP);
		Попытка
			
			Флаг = ЛОЖЬ;
			
			ТекстЗапроса = Новый ЧтениеJSON();
			ТекстЗапроса.УстановитьСтроку(ТелоЗапроса);
			Пока ТекстЗапроса.Прочитать() Цикл
				
				ТекTип = ТекстЗапроса.ТипТекущегоЗначения;
				Если ТекTип = ТипЗначенияJSON.ИмяСвойства Тогда
					
					Если ТекстЗапроса.ТекущееЗначение = СтрокаПараметра Тогда
					
						Флаг = ИСТИНА;
					
					КонецЕсли;
					
				ИначеЕсли ((ТекTип = ТипЗначенияJSON.Строка) ИЛИ (ТекTип = ТипЗначенияJSON.Строка)) И Флаг Тогда
					
					ТекСсылка = ТекстЗапроса.ТекущееЗначение;
					Флаг = ЛОЖЬ;
					
				КонецЕсли;
				
			КонецЦикла;
			ТекстЗапроса.Закрыть();
			
		Исключение
			
			Поз = СтрНайти(ТелоЗапроса,СтрокаПараметра+"=""");
			Если Поз>0 Тогда
			
				ТекСсылка = СРЕД(ТелоЗапроса,Поз+11);
			
			КонецЕсли;
			
		КонецПопытки;
	
	КонецЕсли;
		
	Если ТекСсылка = НЕОПРЕДЕЛЕНО Тогда
	
		Ответ = Новый HTTPСервисОтвет(400);
		СтруктураОтвета.IsSuccess = ЛОЖЬ;
		СтруктураОтвета.Value = ТекСсылка;
		СтруктураОтвета.Message = "Invalid reference";
		
	Иначе
		
		//Поз1 = СтрНайти(ТекСсылка,"""");
		//Если Поз1>0 Тогда
		//	ТекСсылка = СтрЗаменить(ТекСсылка,"""","")
		//КонецЕсли;
		
		Ответ = Новый HTTPСервисОтвет(200);
		
		СтруктураОтвета = Новый Структура("IsSuccess,Value,Message",ИСТИНА,"","");
		
		СтруктураДляВозврата = Новый Структура("Результат,ВозвращаемоеЗначение,Описание");
		
		РЕЗ = РозницаHTTP.ПолучитьСвязанныеОбъекты(СтруктураДляВозврата,ТекСсылка);
		
		Если ТипЗНЧ(РЕЗ)=Тип("Массив") Тогда
			
			МассивОтветов = Новый Массив();
			
			Ответ = Новый HTTPСервисОтвет(200);
			Для каждого СтрРЕЗ Из РЕЗ Цикл
			
				СтрМассивОтветов = Новый Структура("IsSuccess,Value,Message",СтрРЕЗ.Результат,СтрРЕЗ.ВозвращаемоеЗначение,СтрРЕЗ.Описание);
				МассивОтветов.Добавить(СтрМассивОтветов);
							
			КонецЦикла; 
			СтруктураОтвета = МассивОтветов;
			
		ИначеЕсли (ТипЗНЧ(РЕЗ)=Тип("Структура"))ИЛИ(ТипЗНЧ(РЕЗ)=Тип("Соответствие")) Тогда
			Если РЕЗ.Результат Тогда
				
				СтруктураОтвета.IsSuccess = ИСТИНА;
				СтруктураОтвета.Message = СокрЛП(РЕЗ.Описание);
				
			Иначе
				
				Ответ = Новый HTTPСервисОтвет(400);
				СтруктураОтвета.IsSuccess = ЛОЖЬ;
				Если СтрДлина(СокрЛП(РЕЗ.Описание))=0 Тогда
					СтруктураОтвета.Message = "String data would be truncated (Description)";
				Иначе
					СтруктураОтвета.Message = СокрЛП(РЕЗ.Описание);
				КонецЕсли;
				
			КонецЕсли;
			СтруктураОтвета.Value = РЕЗ.ВозвращаемоеЗначение;
		Иначе
			
			Ответ = Новый HTTPСервисОтвет(400);
			СтруктураОтвета.IsSuccess = ЛОЖЬ;
			Если СтрДлина(СокрЛП(РЕЗ.Описание))=0 Тогда
				СтруктураОтвета.Message = "String data would be truncated (Description)";
			Иначе
				СтруктураОтвета.Message = СокрЛП(РЕЗ.Описание);
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЕсли;
	
	ТелоОтвета = Новый ЗаписьJSON();
	ТелоОтвета.УстановитьСтроку();
	ЗаписатьJSON(ТелоОтвета, СтруктураОтвета);
	ТелоОтвета = ТелоОтвета.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область ПеремещениеДС
Функция MoneyTransferDocCheck(Запрос)
		
	СтрокаПараметра = "Ref";
	
	СтруктураДополнительныхРеквизитовПеремещениеДС = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеДС);
	ДопПараметр = СтруктураДополнительныхРеквизитовПеремещениеДС.DocRef;
	
	ТекстЗапросаПоискаПараметра = "ВЫБРАТЬ ПЕРВЫЕ 1
	                              |	ПеремещениеДСДополнительныеРеквизиты.Ссылка
	                              |ИЗ
	                              |	Документ.ПеремещениеДС.ДополнительныеРеквизиты КАК ПеремещениеДСДополнительныеРеквизиты
	                              |ГДЕ
	                              |	ПеремещениеДСДополнительныеРеквизиты.Значение = &ТекПараметр
	                              |	И ПеремещениеДСДополнительныеРеквизиты.Свойство = &ДопПараметр";
	
	ТекстОшибки = "Doc money transfer not found";
	
	УбиратьКавычки=ИСТИНА;
	УбиратьПробелы=ИСТИНА;
	
	Ответ = ПоискПоОдномуПараметру(Запрос,СтрокаПараметра,ТекстЗапросаПоискаПараметра,ТекстОшибки,УбиратьКавычки=ИСТИНА,УбиратьПробелы=ИСТИНА,ДопПараметр);
		
	Возврат Ответ;
КонецФункции

Функция MoneyTransferDocCreate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"СоздатьПеремещениеДС","Doc money transfer created successfully");
	
	Возврат Ответ;
КонецФункции


Функция MoneyTransferDocUpdate(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"ОбновитьПеремещениеДС","Doc money transfer updated successfully");
	
	Возврат Ответ;
КонецФункции


Функция MoneyTransferDocDelete(Запрос)
	
	Ответ = СтандартныеОперации(Запрос,"УдалитьПеремещениеДС","Doc money transfer deleted successfully");
	
	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область Инвентаризация

Функция InventorisationDocCreate(Запрос)
	//Ответ = Новый HTTPСервисОтвет(200);
	Ответ = СтандартныеОперации(Запрос,"СоздатьДокументИнвентаризации","Doc Inventorisation created successfully");
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти


