
&НаКлиенте
Процедура загрузить(Команда)
	
	
	ЕстьОшибки = ЛОЖЬ;
	загрузитьНаСервере(ЕстьОшибки) ;

	Если ЕстьОшибки Тогда 
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(НСтр("ru = 'Продолжить выполнение операции?';"
		+ "ka = 'გაგრძელდეს მონაემების ჩატვირთვა ?'"), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе 
			загрузитьРегистрыНаСервере();
		КонецЕсли;	
	Иначе 	
		загрузитьРегистрыНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура загрузитьНаСервере(ЕстьОшибки)
		
	ТЗЗапасыИЗатраты.Очистить();
	КолСтрок = ТабличнийДокумент.ВысотаТаблицы;
	
	
	Для Стр = 2 По КолСтрок Цикл
		
		НомерСтр =Стр -1 ;
		ИС1 = Формат(Стр, "ЧГ=0");
		
		
		НовСтрока	= ТЗЗапасыИЗатраты.Добавить();
		
		
		//ВидДвижения
		Если не ЗначениеЗаполнено(ВидДвиженияПоУмолчанию) тогда
			НовСтрока.ВидДвижения = ?(ТабличнийДокумент.Область("R"+ИС1+"C4").Текст = "შემოსავალი", ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		Иначе 
			НовСтрока.ВидДвижения =  ?(ВидДвиженияПоУмолчанию = "შემოსავალი",ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход) ;
		КонецЕсли;			
		
		//Период
		Если ЗначениеЗаполнено(Период) тогда
			НовСтрока.Период 		= Период  ;
		Иначе 
			Попытка
				//НовСтрока.Период 		= Дата(Сред(ТекстПериод, 7, 10), Сред(ТекстПериод, 4, 5), Сред(ТекстПериод, 1, 2), Сред(ТекстПериод, 12, 13), Сред(ТекстПериод, 15, 16), Сред(ТекстПериод, 18, 19));//31.03.2013 23:59:59							
				ТекстПериод = ТабличнийДокумент.Область("R"+ИС1+"C1").Текст;
				НовСтрока.Период 		= Дата(Сред(ТекстПериод, 7, 10), Сред(ТекстПериод, 4, 5), Сред(ТекстПериод, 1, 2));//30.12.2020		
			Исключение
				Сообщить("თარიღის ველი შესავსებია ან ფორმატი არასწორია.სწორი ფორმატია: 30.12.2020" +" " + "სტრ " + НомерСтр);
			КонецПопытки;
		КонецЕсли;
		
		//Организация
		НовСтрока.Организация = Организация;
		
		//СтруктурнаяЕдиница
		Если ЗначениеЗаполнено(СтруктурнаяЕдиница)Тогда 
			НовСтрока.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
		Иначе 
			НовСтрока.СтруктурнаяЕдиница = ТабличнийДокумент.Область("R"+ИС1+"C6").Текст;
		КонецЕсли;
					
		//Номенклатруа 
		ТекстНоменклатруа = ТабличнийДокумент.Область("R"+ИС1+"C7").Текст;
		Если не ПустаяСтрока(ТекстНоменклатруа) Тогда 
			Номенклатруа = Справочники.Номенклатура.НайтиПоКоду(ТекстНоменклатруа);
			Если ЗначениеЗаполнено(Номенклатруа) тогда
				НовСтрока.Номенклатура = Номенклатруа;	
			Иначе 		
				Номенклатруа = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",ТекстНоменклатруа);
				Если  ЗначениеЗаполнено(Номенклатруа)Тогда 
					НовСтрока.Номенклатура = Номенклатруа;	
				Иначе 
					Попытка
						Номенклатруа = Справочники.Номенклатура.НайтиПоНаименованию(ТекстНоменклатруа);
						НовСтрока.Номенклатура = Номенклатруа;
					Исключение 
						
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		//ЗаказПокупателя
		
			
		//СчетУчетаРегл
		ТекстСчетУчетаРегл = ТабличнийДокумент.Область("R"+ИС1+"C11").Текст;
		СчетУчетаРегл = ПланыСчетов.Хозрасчетный.НайтиПоКоду(ТекстСчетУчетаРегл);
		Если ЗначениеЗаполнено(СчетУчетаРегл) тогда
			НовСтрока.СчетУчетаРегл = СчетУчетаРегл;
		Иначе 
			Попытка
				СчетУчетаРегл = ПланыСчетов.Хозрасчетный.НайтиПоНаименованию(ТекстСчетУчетаРегл);
				НовСтрока.СчетУчетаРегл = СчетУчетаРегл;
			Исключение 
				
			КонецПопытки;
			
		КонецЕсли;		
		
		//СчетУчетаЗатратРегл
		ТекстСчетУчетаЗатратРегл = ТабличнийДокумент.Область("R"+ИС1+"C12").Текст;
		СчетУчетаЗатратРегл = ПланыСчетов.Хозрасчетный.НайтиПоКоду(ТекстСчетУчетаЗатратРегл);
		Если ЗначениеЗаполнено(СчетУчетаЗатратРегл) тогда
			НовСтрока.СчетУчетаЗатратРегл = СчетУчетаЗатратРегл;
		//Иначе 
		//	Попытка
		//		СчетУчетаЗатратРегл = ПланыСчетов.Хозрасчетный.НайтиПоНаименованию(ТекстСчетУчетаЗатратРегл);
		//		НовСтрока.СчетУчетаЗатратРегл = СчетУчетаЗатратРегл;
		//	Исключение 
		//		
		//	КонецПопытки;
		//	
		КонецЕсли;
		
		//Количество
		ТекстКоличество = ТабличнийДокумент.Область("R"+ИС1+"C13").Текст;
		НовСтрока.Количество = Число(ТекстКоличество);
		
		//Сумма
		ТекстСумма = ТабличнийДокумент.Область("R"+ИС1+"C14").Текст;
		НовСтрока.Сумма = Число(ТекстСумма);
		
		//КоррСтруктурнаяЕдиница
		ТекстКоррСтруктурнаяЕдиница = ТабличнийДокумент.Область("R"+ИС1+"C15").Текст;
		КоррСтруктурнаяЕдиница      = Справочники.СтруктурныеЕдиницы.НайтиПоКоду(ТекстКоррСтруктурнаяЕдиница);
		Если ЗначениеЗаполнено(КоррСтруктурнаяЕдиница) тогда
			НовСтрока.КоррСтруктурнаяЕдиница = КоррСтруктурнаяЕдиница;
		Иначе 
			Попытка
				КоррСтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию(ТекстКоррСтруктурнаяЕдиница);
				НовСтрока.КоррСтруктурнаяЕдиница = КоррСтруктурнаяЕдиница;
			Исключение 
				
			КонецПопытки;
			
		КонецЕсли;
			
		//КоррНоменклатура
		ТекстКоррНоменклатура = ТабличнийДокумент.Область("R"+ИС1+"C16").Текст;
		Если не ПустаяСтрока(ТекстКоррНоменклатура) Тогда 
			КоррНоменклатура = Справочники.Номенклатура.НайтиПоКоду(ТекстКоррНоменклатура);
			Если ЗначениеЗаполнено(КоррНоменклатура) тогда
				НовСтрока.Номенклатура = Номенклатруа;	
			Иначе 		
				КоррНоменклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",ТекстКоррНоменклатура);
				Если  ЗначениеЗаполнено(КоррНоменклатура)Тогда 
					НовСтрока.КоррНоменклатура = КоррНоменклатура;	
				Иначе 
					Попытка
						КоррНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(ТекстКоррНоменклатура);
						НовСтрока.КоррНоменклатура = КоррНоменклатура;
					Исключение 
						
					КонецПопытки;		
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;

		//КоррХарактеристика
		
		//КоррПартия
		
		//КоррЗаказПокупателя
		ТекстКоррЗаказПокупателя = ТабличнийДокумент.Область("R"+ИС1+"C19").Текст;
		Попытка
			КоррЗаказПокупателя      = Документы.ЗаказПокупателя.НайтиПоНомеру(ТекстКоррЗаказПокупателя,ТекущаяДата());	
			НовСтрока.КоррЗаказПокупателя = КоррЗаказПокупателя;
		Исключение 
			
		КонецПопытки;


		
		//Спецификация
		
		//КоррСпецификация
		
		//ЗаказПродажи
		ТекстЗаказПродажи = ТабличнийДокумент.Область("R"+ИС1+"C22").Текст;
		Попытка
			КоррЗаказПродажи      = Документы.ЗаказПокупателя.НайтиПоНомеру(ТекстЗаказПродажи,ТекущаяДата());	
			НовСтрока.ЗаказПродажи = КоррЗаказПродажи;
		Исключение 
			
		КонецПопытки;
		
		//ДокументПродажи
		
		//ПодразделениеПродажи
		НовСтрока.Подразделение = Подразделение;
			
		//Ответственный
		НовСтрока.Ответственный = Ответственный; 
		
		//СтавкаНДС
		Если не ПустаяСтрока(ТабличнийДокумент.Область("R1"+ИС1+"C26").Текст) Тогда 
			СтавкаНДСТекст = ТабличнийДокумент.Область("R1"+ИС1+"C26").Текст;
			НовСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию(СтавкаНДСТекст); 
			
		Иначе 
			СтавкаНДСТекст = ТабличнийДокумент.Область("R"+ИС1+"C26").Текст;
			Если СтавкаНДСТекст = "1" Тогда 
				  НовСтрока.СтавкаНДС = Справочники.СтавкиНДС.НДС0; 
			  ИначеЕсли СтавкаНДСТекст = "2" Тогда 
				  НовСтрока.СтавкаНДС = Справочники.СтавкиНДС.НДС18; 
				 ИначеЕсли СтавкаНДСТекст = "3" Тогда 
				  НовСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС; 
				 ИначеЕсли СтавкаНДСТекст = "4" Тогда 
				  НовСтрока.СтавкаНДС = Справочники.СтавкиНДС.ОсвобожденОтНДС; 
			КонецЕсли;	  		
		КонецЕсли;
		
		//ФиксированнаяСтоимость
		ТекстФиксированнаяСтоимость = ТабличнийДокумент.Область("R"+ИС1+"C27").Текст;
		Если ТекстФиксированнаяСтоимость =  "1" Тогда 			
			НовСтрока.ФиксированнаяСтоимость = Истина;
		Иначе 
			НовСтрока.ФиксированнаяСтоимость = Ложь;		
		КонецЕсли;
		
		//ЗатратыНаВыпуск
		ТекстЗатратыНаВыпуск = ТабличнийДокумент.Область("R"+ИС1+"C28").Текст;
		Если ТекстЗатратыНаВыпуск = "1" Тогда 			
			НовСтрока.ЗатратыНаВыпуск = Истина;
		Иначе 
			НовСтрока.ЗатратыНаВыпуск = Ложь;		
		КонецЕсли;
		
		//Возврат
		ТекстВозврат = ТабличнийДокумент.Область("R"+ИС1+"C29").Текст;
		Если ТекстВозврат = "1" Тогда 			
			НовСтрока.Возврат = Истина;
		Иначе 
			НовСтрока.Возврат = Ложь;		
		КонецЕсли;
		
		//СодержаниеПроводки
		
		
		//ПеремещениеВРозницуСуммовойУчет
		ТекстПеремещениеВРозницуСуммовойУчет = ТабличнийДокумент.Область("R"+ИС1+"C31").Текст;
		Если ТекстПеремещениеВРозницуСуммовойУчет = "1" Тогда 			
			НовСтрока.ПеремещениеВРозницуСуммовойУчет = Истина;
		Иначе 
			НовСтрока.ПеремещениеВРозницуСуммовойУчет = Ложь;		
		КонецЕсли;
		

		//ХозяйственнаяОперация	
		ТекстХозяйственнаяОперация = ТабличнийДокумент.Область("R"+ИС1+"C32").Текст;
		Попытка	
			НовСтрока.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.НайтиПоНаименованию(ТекстХозяйственнаяОперация);
		Исключение
			
		КонецПопытки;	
		
		//КоррСчетУчетаРегл
		ТекстКоррСчетУчетаРегл = ТабличнийДокумент.Область("R"+ИС1+"C33").Текст;
		КоррСчетУчетаРегл = ПланыСчетов.Хозрасчетный.НайтиПоКоду(ТекстКоррСчетУчетаРегл);
		Если ЗначениеЗаполнено(КоррСчетУчетаРегл) тогда
			НовСтрока.КоррСчетУчетаРегл = КоррСчетУчетаРегл;
		//Иначе 
		//	Попытка
		//		КоррСчетУчетаРегл = ПланыСчетов.Хозрасчетный.НайтиПоНаименованию(ТекстКоррСчетУчетаРегл);
		//		НовСтрока.КоррСчетУчетаРегл = КоррСчетУчетаРегл;
		//	Исключение 
		//		
		//	КонецПопытки;
			
		КонецЕсли;
		
		//Резервирование
		ТекстРезервирование = ТабличнийДокумент.Область("R"+ИС1+"C34").Текст;
		Если ТекстРезервирование = "1" Тогда 			
			НовСтрока.Резервирование = Истина;
		Иначе 
			НовСтрока.Резервирование = Ложь;		
		КонецЕсли

				
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура загрузитьРегистрыНаСервере()
	
	ТаблицаЗагрузки = ТЗЗапасыИЗатраты.Выгрузить();
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	тзЗагрузки.Период КАК Период,
	//	|	тзЗагрузки.Активность КАК Активность,
	//	|	тзЗагрузки.ВидДвижения КАК ВидДвижения,
	//	|	тзЗагрузки.Организация КАК Организация,
	//	|	тзЗагрузки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//	|	тзЗагрузки.Номенклатура КАК Номенклатура,
	//	|	тзЗагрузки.Характеристика КАК Характеристика,
	//	|	тзЗагрузки.Партия КАК Партия,
	//	|	тзЗагрузки.ЗаказПокупателя КАК ЗаказПокупателя,
	//	|	тзЗагрузки.СчетУчетаРегл КАК СчетУчетаРегл,
	//	|	тзЗагрузки.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	//	|	тзЗагрузки.Количество КАК Количество,
	//	|	тзЗагрузки.Сумма КАК Сумма,
	//	|	тзЗагрузки.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	//	|	тзЗагрузки.КоррНоменклатура КАК КоррНоменклатура,
	//	|	тзЗагрузки.КоррХарактеристика КАК КоррХарактеристика,
	//	|	тзЗагрузки.КоррПартия КАК КоррПартия,
	//	|	тзЗагрузки.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	//	|	тзЗагрузки.Спецификация КАК Спецификация,
	//	|	тзЗагрузки.КоррСпецификация КАК КоррСпецификация,
	//	|	тзЗагрузки.ЗаказПродажи КАК ЗаказПродажи,
	//	|	тзЗагрузки.ДокументПродажи КАК ДокументПродажи,
	//	|	тзЗагрузки.Подразделение КАК Подразделение,
	//	|	тзЗагрузки.Ответственный КАК Ответственный,
	//	|	тзЗагрузки.СтавкаНДС КАК СтавкаНДС,
	//	|	тзЗагрузки.ФиксированнаяСтоимость КАК ФиксированнаяСтоимость,
	//	|	тзЗагрузки.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	//	|	тзЗагрузки.Возврат КАК Возврат,
	//	|	тзЗагрузки.СодержаниеПроводки КАК СодержаниеПроводки,
	//	|	тзЗагрузки.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	//	|	тзЗагрузки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	//	|	тзЗагрузки.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл
	//	|ПОМЕСТИТЬ ВТ_Загрузки
	//	|ИЗ
	//	|	&тзЗагрузки КАК тзЗагрузки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Загрузки.Период КАК Период,
	//	|	ВТ_Загрузки.Активность КАК Активность,
	//	|	ВТ_Загрузки.ВидДвижения КАК ВидДвижения,
	//	|	ВТ_Загрузки.Организация КАК Организация,
	//	|	ВТ_Загрузки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//	|	ВТ_Загрузки.Номенклатура КАК Номенклатура,
	//	|	ВТ_Загрузки.Характеристика КАК Характеристика,
	//	|	ВТ_Загрузки.Партия КАК Партия,
	//	|	ВТ_Загрузки.ЗаказПокупателя КАК ЗаказПокупателя,
	//	|	ВТ_Загрузки.СчетУчетаРегл КАК СчетУчетаРегл,
	//	|	ВТ_Загрузки.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	//	|	ВТ_Загрузки.Количество КАК Количество,
	//	|	ВТ_Загрузки.Сумма КАК Сумма,
	//	|	ВТ_Загрузки.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	//	|	ВТ_Загрузки.КоррНоменклатура КАК КоррНоменклатура,
	//	|	ВТ_Загрузки.КоррХарактеристика КАК КоррХарактеристика,
	//	|	ВТ_Загрузки.КоррПартия КАК КоррПартия,
	//	|	ВТ_Загрузки.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	//	|	ВТ_Загрузки.Спецификация КАК Спецификация,
	//	|	ВТ_Загрузки.КоррСпецификация КАК КоррСпецификация,
	//	|	ВТ_Загрузки.ЗаказПродажи КАК ЗаказПродажи,
	//	|	ВТ_Загрузки.ДокументПродажи КАК ДокументПродажи,
	//	|	ВТ_Загрузки.Подразделение КАК Подразделение,
	//	|	ВТ_Загрузки.Ответственный КАК Ответственный,
	//	|	ВТ_Загрузки.СтавкаНДС КАК СтавкаНДС,
	//	|	ВТ_Загрузки.ФиксированнаяСтоимость КАК ФиксированнаяСтоимость,
	//	|	ВТ_Загрузки.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	//	|	ВТ_Загрузки.Возврат КАК Возврат,
	//	|	ВТ_Загрузки.СодержаниеПроводки КАК СодержаниеПроводки,
	//	|	ВТ_Загрузки.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	//	|	ВТ_Загрузки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	//	|	ВТ_Загрузки.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл
	//	|ИЗ
	//	|	ВТ_Загрузки КАК ВТ_Загрузки";
	//
	//Запрос.УстановитьПараметр("тзЗагрузки", ТаблицаЗагрузки);
	//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//
	НаборЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗапасы.Отбор.Регистратор.Установить(Регистратор);
	НаборЗапасы.Прочитать();
	НаборЗапасы.Загрузить(ТаблицаЗагрузки);
	НаборЗапасы.ОбменДанными.Загрузка = Истина;
	НаборЗапасы.Записать();

	

КонецПроцедуры // загрузитьНаСервере1()

&НаСервере
Функция ПолучитьЗначениеКолонки(ТаблицаПоиска, ТекстПоиска)
	
	РезультатПоиска = Неопределено;
	
	ПоискСтрок = ТаблицаПоиска.НайтиСтроки(Новый Структура("Код",ТекстПоиска));
	
	Если ПоискСтрок.Количество() > 0 Тогда 
		РезультатПоиска = ПоискСтрок[0].Ссылка;
	КонецЕсли;
	
	
	Возврат РезультатПоиска;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеКолонки1(ТаблицаПоиска, ТекстПоиска)
	
	РезультатПоиска = Неопределено;
	
	ПоискСтрок = ТаблицаПоиска.НайтиСтроки(Новый Структура("Наименование",ТекстПоиска));
	
	Если ПоискСтрок.Количество() > 0 Тогда 
		РезультатПоиска = ПоискСтрок[0].Ссылка;
	КонецЕсли;
	
	
	Возврат РезультатПоиска;
	
КонецФункции



