
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство.Получить() Тогда
		
		// ФО Использовать подсистему Производство.
		УстановитьВидимостьОтФОИспользоватьПодсистемуПроизводство();
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость реквизитов формы от опции
// Использовать подсистему Производство.
//
// Параметры:
// Нет.
//
&НаСервере
Процедура УстановитьВидимостьОтФОИспользоватьПодсистемуПроизводство()
	
	ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипСчета");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.Использование = Истина;
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТипыСчетов.НезавершенноеПроизводство);
	СписокЗначений.Добавить(Перечисления.ТипыСчетов.КосвенныеЗатраты);
	
	ЭлементОтбора.ПравоеЗначение = СписокЗначений;
	
КонецПроцедуры // УстановитьВидимостьОтФОИспользоватьПодсистемуПроизводство()

&НаСервере
Процедура ЗаполнитьПоШаблонуНаСервере()
	
	МакетСоотвПС = ПланыСчетов.Управленческий.ПолучитьМакет("Макет");
	облСоотвПланСчетов = МакетСоотвПС.ПолучитьОбласть("СоотвПланСчетов");
	
	ПолеОтсчета = 11;
	ПолеЗавершения = облСоотвПланСчетов.ВысотаТаблицы + ПолеОтсчета - 1 ;
	
	Для инд = ПолеОтсчета По ПолеЗавершения Цикл
		
		Предопределенное = МакетСоотвПС.Область("R"+ инд + "C1").Текст;
		КодСчета		 = МакетСоотвПС.Область("R"+ инд + "C2").Текст;
		КодРодителья	 = МакетСоотвПС.Область("R"+ инд + "C3").Текст;
		ПредопрИмя		 = МакетСоотвПС.Область("R"+ инд + "C4").Текст;
		врНаименование	 = МакетСоотвПС.Область("R"+ инд + "C5").Текст;
		врТип		     = МакетСоотвПС.Область("R"+ инд + "C6").Текст;
		впТипСчета		 = МакетСоотвПС.Область("R"+ инд + "C7").Текст;
		врВалютный		 = МакетСоотвПС.Область("R"+ инд + "C8").Текст;
		врПорядок		 = МакетСоотвПС.Область("R"+ инд + "C9").Текст;
		врСпособРаспределения = МакетСоотвПС.Область("R"+ инд + "C10").Текст;
		врКодСчетЗакрытия	  = МакетСоотвПС.Область("R"+ инд + "C11").Текст;
		
		ИзменитПредопрСчет(Предопределенное,КодСчета,КодРодителья,ПредопрИмя,врНаименование,врТип,впТипСчета,врВалютный,врПорядок,врСпособРаспределения,врКодСчетЗакрытия);
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура  ИзменитПредопрСчет(Предопределенное,КодСчета,КодРодителья,ПредопрИмя,врНаименование,врТип,впТипСчета,врВалютный,врПорядок,врСпособРаспределения,врКодСчетЗакрытия)

	врВидСчета = ?(врТип = "0","Пассивный",?(врТип = "1","Активный","АктивноПассивный"));
	
	Если Предопределенное = "0" Тогда
		
		наидСчет = ПланыСчетов.Управленческий.НайтиПоКоду(КодСчета);
		Если наидСчет = ПланыСчетов.Управленческий.ПустаяСсылка() Тогда
			текПланыСчетов = ПланыСчетов.Управленческий.СоздатьСчет();
		Иначе 	
			текПланыСчетов = наидСчет.ПолучитьОбъект();
		КонецЕсли;
		
	ИначеЕсли Предопределенное = "1" Тогда
		текПланыСчетов = ПланыСчетов.Управленческий[ПредопрИмя].ПолучитьОбъект();
	КонецЕсли;

	текПланыСчетов.Наименование = врНаименование;
	текПланыСчетов.Код = КодСчета;
	текПланыСчетов.Родитель = ПланыСчетов.Управленческий.НайтиПоКоду(КодРодителья);
	текПланыСчетов.Вид = ВидСчета["Активный"];
	текПланыСчетов.ТипСчета = Перечисления.ТипыСчетов[впТипСчета];
	текПланыСчетов.Валютный = ?(врВалютный = "1",Истина,Ложь);
	текПланыСчетов.Порядок = врПорядок;
	текПланыСчетов.СпособРаспределения = Перечисления.БазыРаспределенияРасходов[врСпособРаспределения];
	текПланыСчетов.СчетЗакрытия = ?(врКодСчетЗакрытия = "", ПланыСчетов.Управленческий.ПустаяСсылка(), ПланыСчетов.Управленческий.НайтиПоКоду(врКодСчетЗакрытия));
	
	текПланыСчетов.Записать();

КонецПроцедуры 


&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	ЗаполнитьПоШаблонуНаСервере();
КонецПроцедуры


#КонецОбласти
