
&Насервере
Процедура ПриЗаписи(Отказ)

Если Не Константы.КонтролУникалностиПоКодуТранспортныеСредства.Получить()= Истина Тогда	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТранспортныеСредства.Код,
		|	ТранспортныеСредства.Ссылка
		|ИЗ
		|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
		|ГДЕ
		|	ТранспортныеСредства.Код = &Код
		|	И ТранспортныеСредства.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		 	Сообщение = Новый СообщениеПользователю;
           Сообщение.Текст = НСтр("ru='Код не уникален';ka='სარეგისტრაციო ნიშანი არა არის უნიკალური'");
           Сообщение.Сообщить();
           Отказ = Истина;

	КонецЕсли;
	

КонецЕсли;	
	
	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Lazare_
	Если Предопределенный Тогда 	
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВидТранспортногоСредства"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Код"));
		ВидТранспортногоСредства = Перечисления.ВидыТранспортныхСредств.ПустаяСсылка();
		Код = "" ;		
	КонецЕсли;
	//_Lazare	
КонецПроцедуры

