#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Применяется Тогда
			Запись.Представление = 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='თანხა ხარჯი: %1';ru='Сумма расхода:%1'"), Запись.СуммаРасходов)
				+СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka=', კრედიტის პროცენტი:%1';ru=', процент по кредиту:%1'"), Запись.ПроцентыПоКредиту)
				+ ?(ЗначениеЗаполнено(Запись.КодИФНС), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka=', საგადასახადო სამსახურის ინსპექციის კოდი:%1';ru=', код ИФНС:%1'"),Запись.КодИФНС),"")
				+ ?(ЗначениеЗаполнено(Запись.НомерУведомления), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka=', номер уведомления:%1';ru=', номер уведомления:%1'"),Запись.НомерУведомления),"")
				+ ?(ЗначениеЗаполнено(Запись.ДатаУведомления), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka=', შეტყობინების თარიღი:%1';ru=', дата уведомления:%1'"),Запись.ДатаУведомления),"");
			Иначе
				Запись.Представление =  НСтр("ka='ქონებრივი დაქვითვა არ გამოიყენება';ru='Имущественный вычет не применяется'");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли