
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	ЭтотОбъект.ОснованиеСоздания = Параметры.Основание;
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	
	Элементы.ЗаказПокупателя.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ЗаказНаПроизводство);
	Элементы.ДокументОснованиеНадпись.Видимость = НЕ ПолучитьФункциональнуюОпцию("РезервированиеЗапасов");
	
	ИменаТЧ = Новый Массив;
	ИменаТЧ.Добавить(Новый Структура("ИмяПоляПроверки, ИмяПоляОформления", "Объект.Продукция.СтранаПроисхождения", "ПродукцияНомерГТД"));
	ИменаТЧ.Добавить(Новый Структура("ИмяПоляПроверки, ИмяПоляОформления", "Объект.Запасы.СтранаПроисхождения", "ЗапасыНомерГТД"));
	
	ГрузовыеТаможенныеДекларацииСервер.ПриСозданииНаСервере(ЭтаФорма, ИменаТЧ, КэшЗначений);
	КэшЗначений.Вставить("ВОРазборка", Перечисления.ВидыОперацийСборкаЗапасов.Разборка);
	КэшЗначений.Вставить("ВОСборка", Перечисления.ВидыОперацийСборкаЗапасов.Сборка);
	
	//ПодольскийАИ #УчетПроектов 13.10.2020 {
	КэшЗначений.Вставить("ПустойПроект", Справочники.Проекты.ПустаяСсылка());
	//ПодольскийАИ #УчетПроектов 13.10.2020 }
	
	УстановитьВидимостьИДоступность();
	УстановитьРежимИСписокВыбора();
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.СборкаЗапасов.ТабличныеЧасти.Запасы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	// ПодключаемоеОборудование.
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	СписокЭлектронныхВесов = МенеджерОборудованияВызовСервера.ПолучитьСписокОборудования("ЭлектронныеВесы", , МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
	Если СписокЭлектронныхВесов.Количество() = 0 Тогда
		// Нет подключенных весов.
		Элементы.ЗапасыПолучитьВес.Видимость = Ложь;
	КонецЕсли;
	Элементы.ЗапасыЗагрузитьДанныеИзТСД.Видимость = ИспользоватьПодключаемоеОборудование;
	// Конец ПодключаемоеОборудование
	
	УстановитьВидимостьИДоступностьМобильноеПриложение();
	
	// КопированиеСтрокТабличныхЧастей
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Продукция");
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Запасы");
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Отходы");
	
	// Серийные номера
	ИспользоватьСерийныеНомераОстатки = РаботаССерийнымиНомерами.ИспользоватьСерийныеНомераОстатки();
	//++Lazare 13.12.2021
	ЗапретРедактирования = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ЗапретРедактированияПроведенныхДокументовСборкаЗапасов");//Lazare-04.11.2021

	Если Объект.Ссылка.Пустая() Тогда
		Объект.ОснованиеПроизводство = Неопределено;
	Иначе            //Lazare-04.11.2021
		Если Объект.Проведен Тогда     
			ТолькоПросмотр = ЗапретРедактирования;
		КонецЕсли;   //Lazare-04.11.2021	
	КонецЕсли;//Паганини
	ОбщегоНазначенияПереопределяемый.УстановитьДополнительноеПоведениеСтандартныхКнопокТЧЗапасы(ЭтаФорма);// Kuzmich, 07.08.2019, Дополнительные инструменты в табличных частях документов движения товаров
	
	ДополнительныеПараметры = УправлениеСвойствамиПереопределяемый.ЗаполнитьДополнительныеПараметры(Объект, "ДополнительныеРеквизиты", , "КомандыОбычные");
	
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	
	УстановитьВидимостьКнопкиПроизводства(); //+++ Дмгг
	
	// ЗагрузкаДанныхИзВнешнегоИсточника
	//Lazare_
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.СборкаЗапасов.ТабличныеЧасти.Запасы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	
	Элементы.ТыпОперации.Видимость = Константы.ПроизводственныеПотери.Получить() и Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСборкаЗапасов.Сборка");
	//_Lazare
	//--------------------------------------------------------------------------
	// © Шишка В.В. [23 декабря 2023]  НАЧАЛО
	УчитыватьДополнительныеЗатратыВПроизводстве = ПолучитьФункциональнуюОпцию("УчитыватьДополнительныеЗатратыВПроизводстве");	
	// © Шишка В.В. [23 декабря 2023]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	
	ФункционалСобраниеЗапасовВДокументе = РегистрыСведений.УчетнаяПолитикаРегл.ЗначениеПоляУчетнойПолитики("СобраниеЗапасовВДокументеСборкаЗапасов", Объект.Организация);
	Элементы.ЗапасыКоличествоСобр.Видимость = ФункционалСобраниеЗапасовВДокументе;  
	
	//+++ Дмгг, ONESOFT-2638
	ВалютаРасчетов = Справочники.Валюты.НайтиПоНаименованию("GEL");    
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();  
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	СтруктураНадписи = Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦенКонтрагента, НалогообложениеНДС,ВидЦен", Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, 1, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦенКонтрагента, Объект.НалогообложениеНДС, ВидЦен);
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	//--- Дмгг, ONESOFT-2638     
	
	ФункционалИзменитьЛогикуСобранияЗапасов = РегистрыСведений.УчетнаяПолитикаРегл.ЗначениеПоляУчетнойПолитики("ИзменитьЛогикуСобранияЗапасов", Объект.Организация);
	
	//ONESOFT-3694
	Элементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументЧекККМСоздатьНаОсновании.видимость = Константы.СозданиеДокументаЧекКкмНаОснованииДокументаСборкаЗапасов.Получить(); 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступностьМобильноеПриложение()
	
	// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
		Элементы.ТЧОтходы.Видимость = Ложь;
		Элементы.ЛеваяКолонка.Видимость = Ложь;
		Элементы.ВидОперации.Видимость = Ложь;
		Элементы.Организация.Видимость = Ложь;
		Элементы.ГруппаСкладПродукцияСборка.Видимость = Ложь;
		Элементы.ГруппаСкладПродукцияРазборка.Видимость = Ложь;
		Элементы.ПродукцияПродукцияПодбор.Видимость = Ложь;
		Элементы.ПродукцияГруппаКопированиеСтрок.Видимость = Ложь;
		Элементы.ПродукцияХарактеристика.Видимость = Ложь;
		Элементы.ГруппаСкладЗапасыСборка.Видимость = Ложь;
		Элементы.ГруппаСкладЗапасыРазборка.Видимость = Ложь;
		Элементы.ГруппаТорговоеОборудование.Видимость = Ложь;
		Элементы.ЗапасыГруппаКопированиеСтрок.Видимость = Ложь;
		Элементы.ЗапасыПодбор.Видимость = Ложь;
		Элементы.КомандаЗаполнитьПоСпецификации.Видимость = Ложь;
		Элементы.ЗапасыИзменитьРезерв.Видимость = Ложь;
		Элементы.ЗапасыХарактеристика.Видимость = Ложь;
		Элементы.ФормаЗаписать.Видимость = Ложь;
		Элементы.ФормаПровести.Видимость = Ложь;
		Элементы.ФормаОтменаПроведения.Видимость = Ложь;
		Элементы.ФормаПоказатьВСписке.Видимость = Ложь;
		Элементы.ГруппаГлобальныеКоманды.Видимость = Ложь;
		Элементы.ДокументОснованиеНадпись.Видимость = Ложь;
		Элементы.ФормаПровестиИЗакрыть.Заголовок = "Готово";
		Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаПродукции) Тогда
			Объект.СтруктурнаяЕдиницаПродукции = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаЗапасов) Тогда
			Объект.СтруктурнаяЕдиницаЗапасов = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаОтходов) Тогда
			Объект.СтруктурнаяЕдиницаОтходов = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
		КонецЕсли;
		
	КонецЕсли;
	// Конец МобильноеПриложение
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтатистикаИспользованияФормКлиент.ПроверитьЗаписатьСтатистикуКоманды(
		"СоздатьНаОсновании.СборкаЗапасов",
		ЭтотОбъект.ВладелецФормы,
		ЭтотОбъект.ОснованиеСоздания
	);
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик события ПередЗаписью.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "Проведение"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
	
	Если НетЗапасов() И ТаблицаЗапасовДолжнаБытьЗаполнена() Тогда
		Отказ = Истина;
		Предупреждение("არ არის არჩეული არც ერთი მასალა", 0, "შეცდომა");
	КонецЕсли;
	
	Если ФункционалСобраниеЗапасовВДокументе и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Отказ = ПроверитьСобраниеЗапасовВДокументеПередЗаписью();
		Если Отказ Тогда 
 			Предупреждение("არ არის აგროვებული ყველა მასალა");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

&НаСервере
Функция НетЗапасов()
	Возврат (Объект.Запасы.Количество() = 0);
КонецФункции

&НаСервере
Функция ТаблицаЗапасовДолжнаБытьЗаполнена()
	Возврат УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВДокументеПроизводстваТаблицаЗапасовДолжнаБытьЗаполнена");
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность",Модифицированность);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ИзФормыДокумента",	Истина);//Паганини
	// Конец Обсуждения
	
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ОповеститьОбИзменении(Объект.ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Процедура - обработчик события ОбработкаОповещения формы.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование"
	   И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			//Преобразуем предварительно к ожидаемому формату
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество, ДоляСтоимости", Параметр[0], 1, 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество, ДоляСтоимости", Параметр[1][1], 1, 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;
			
			ПолученыШтрихкоды(Данные);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если ИмяСобытия = "ПодборПроизведен" 
		И ЗначениеЗаполнено(Параметр) 
		//Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		АдресЗапасовВХранилище	= Параметр;
		
		Если МаркерПодбора = "Продукция" Тогда
			
			ИмяТабличнойЧасти = "Продукция";
			
		ИначеЕсли МаркерПодбора = "Запасы" Тогда
			
			ИмяТабличнойЧасти = "Запасы";
			
		ИначеЕсли МаркерПодбора = "Отходы" Тогда
			
			ИмяТабличнойЧасти = "Отходы";
			
		КонецЕсли;
		
		ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, Истина, Истина);
		
	ИначеЕсли ИмяСобытия = "ПодборСерий"
		И ЗначениеЗаполнено(Параметр) 
		//Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.ТЧПродукция Тогда
			ПолучитьСерийныеНомераПродукцииИзХранилища(Параметр.АдресВоВременномХранилище, Параметр.КлючСтроки);
		Иначе
			ПолучитьСерийныеНомераЗапасыИзХранилища(Параметр.АдресВоВременномХранилище, Параметр.КлючСтроки);
		КонецЕсли;
		
		
	КонецЕсли;
	
	// КопированиеСтрокТабличныхЧастей
	Если ИмяСобытия = "БуферОбменаТабличнаяЧастьКопированиеСтрок" Тогда
		КопированиеТабличнойЧастиКлиент.ОбработкаОповещения(Элементы, "Продукция");
		КопированиеТабличнойЧастиКлиент.ОбработкаОповещения(Элементы, "Запасы");
		КопированиеТабличнойЧастиКлиент.ОбработкаОповещения(Элементы, "Отходы");
	КонецЕсли;
	
	// Обсуждения
	ОбсужденияКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения

КонецПроцедуры // ОбработкаОповещения()

// Процедура - обработчик события ПриЗакрытии.
//
&НаКлиенте
Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры // ПриЗакрытии()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//+lazare 15.12.2022
	Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалВидимостиСвободногоОстаткаЗапасовВВокументах") Тогда 
		Для Каждого Ст из Объект.Запасы Цикл 	
			Ст.КоличествоНаСкладе = УправлениеНебольшойФирмойСервер.ПолучитьКоличествоЗапасовНаСкладе(Объект.Дата, Ст.Номенклатура,Ст.Характеристика,Ст.Партия,Объект.Организация,Объект.СтруктурнаяЕдиницаЗапасов);//++Lazare 13.12.2022	
		КонецЦикла;	
		
		Для Каждого Ст из Объект.Продукция Цикл 	
			Ст.КоличествоНаСкладе = УправлениеНебольшойФирмойСервер.ПолучитьКоличествоЗапасовНаСкладе(Объект.Дата, Ст.Номенклатура,Ст.Характеристика,Ст.Партия,Объект.Организация,Объект.СтруктурнаяЕдиницаПродукции);//++Lazare 13.12.2022	
		КонецЦикла;	
	КонецЕсли;
	//-Lazare 15.12.2022
		
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении поля ввода Дата.
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;        
		
		//+++ Дмгг, ONESOFT-2638     
		Для Каждого Строк Из Объект.ДополнительныеРасходы Цикл 
			СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением, Строк.Валюта);
			
			Если ЗначениеЗаполнено(Строк.Валюта) Тогда
				ПересчитатьКурсКратностьВалютыДокументаПоСтрокеДопРасходы(СтруктураДанные, Строк);
			КонецЕсли;
		КонецЦикла;  
		//--- Дмгг, ONESOFT-2638
	КонецЕсли;                       
	
КонецПроцедуры // ДатаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Организация.
// В процедуре осуществляется очистка номера документа,
// а также производится установка параметров функциональных опций формы.
// Переопределяет соответствующий параметр формы.
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	// Обработка события изменения организации.
	Объект.Номер = "";
	СтруктураДанные = ПолучитьДанныеОрганизацияПриИзменении(Объект.Организация);
	Компания = СтруктураДанные.Компания;
	
	Объект.ПодписьРуководителя = СтруктураДанные.ПодписьРуководителя;
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ДокументОснование.
//
&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	Элементы.ЗаказПокупателя.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ДокументОснование);
	
КонецПроцедуры // ДокументОснованиеПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ЗаказПокупателя.
//
&НаКлиенте
Процедура ЗаказПокупателяПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСборкаЗапасов.Разборка") Тогда
		
		Элементы.ПродукцияРезерв.Видимость = ЗначениеЗаполнено(Объект.ЗаказПокупателя);
		
		Для каждого СтрокаПродукция Из Объект.Продукция Цикл
			СтрокаПродукция.Резерв = 0;
		КонецЦикла;
		
	Иначе
		
		Элементы.ЗапасыРезерв.Видимость = ЗначениеЗаполнено(Объект.ЗаказПокупателя);
		Элементы.ЗапасыИзменитьРезерв.Видимость = ЗначениеЗаполнено(Объект.ЗаказПокупателя);
		
		Для каждого СтрокаЗапасы Из Объект.Запасы Цикл
			СтрокаЗапасы.Резерв = 0;
		КонецЦикла;
		
		ИспользуетсяРезервирование = ЗначениеЗаполнено(Объект.ЗаказПокупателя);
		
	КонецЕсли;
	
КонецПроцедуры // ЗаказПокупателяПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ВидОперации.
//
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();
	
	ИмяТабличнойЧасти = ?(Объект.ВидОперации = КэшЗначений.ВОСборка, "Продукция", "Запасы");
	Для каждого СтрокаТабличнойЧасти Из Объект[ИмяТабличнойЧасти] Цикл
		
		СтрокаТабличнойЧасти["СтранаПроисхождения"] = Неопределено;
		СтрокаТабличнойЧасти["НомерГТД"] = Неопределено;
		
	КонецЦикла;
	
	УстановитьВидимостьКнопкиПроизводства(); // Kuzmich, 18.12.2019
КонецПроцедуры // ВидОперацииПриИзменении()

#Область СтруктурнаяЕдиницаИзготовитель

// Процедура - обработчик события ПриИзменении поля ввода СтруктурнаяЕдиница.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
	
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("Подразделение", Объект.СтруктурнаяЕдиница);
		СтруктураДанные.Вставить("ВидОперации", Объект.ВидОперации);
		
		СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиницаПриИзменении(СтруктураДанные);
		
		Элементы.Ячейка.Доступность = СтруктураДанные.ОрдерныйСклад;
		
		Если ЗначениеЗаполнено(СтруктураДанные.СтруктурнаяЕдиницаПродукции) Тогда
			
			Объект.СтруктурнаяЕдиницаПродукции = СтруктураДанные.СтруктурнаяЕдиницаПродукции;
			Объект.ЯчейкаПродукции = СтруктураДанные.ЯчейкаПродукции;
			Элементы.ЯчейкаПродукцииСборка.Доступность = СтруктураДанные.ОрдерныйСкладПродукции;
			Элементы.ЯчейкаПродукцииРазборка.Доступность = СтруктураДанные.ОрдерныйСкладПродукции;
			
		Иначе
			
			Объект.СтруктурнаяЕдиницаПродукции = Объект.СтруктурнаяЕдиница;
			Объект.ЯчейкаПродукции = Объект.Ячейка;
			Элементы.ЯчейкаПродукцииСборка.Доступность = СтруктураДанные.ОрдерныйСклад;
			Элементы.ЯчейкаПродукцииРазборка.Доступность = СтруктураДанные.ОрдерныйСклад;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанные.СтруктурнаяЕдиницаЗапасов) Тогда
			
			Объект.СтруктурнаяЕдиницаЗапасов = СтруктураДанные.СтруктурнаяЕдиницаЗапасов;
			Объект.ЯчейкаЗапасов = СтруктураДанные.ЯчейкаЗапасов;
			Элементы.ЯчейкаЗапасовСборка.Доступность = СтруктураДанные.ОрдерныйСкладЗапасов;
			Элементы.ЯчейкаЗапасовРазборка.Доступность = СтруктураДанные.ОрдерныйСкладЗапасов;
			
		Иначе
			
			Объект.СтруктурнаяЕдиницаЗапасов = Объект.СтруктурнаяЕдиница;
			Объект.ЯчейкаЗапасов = Объект.Ячейка;
			Элементы.ЯчейкаЗапасовСборка.Доступность = СтруктураДанные.ОрдерныйСклад;
			Элементы.ЯчейкаЗапасовРазборка.Доступность = СтруктураДанные.ОрдерныйСклад;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанные.СтруктурнаяЕдиницаОтходов) Тогда
			
			Объект.СтруктурнаяЕдиницаОтходов = СтруктураДанные.СтруктурнаяЕдиницаОтходов;
			Объект.ЯчейкаОтходов = СтруктураДанные.ЯчейкаОтходов;
			Элементы.ЯчейкаОтходов.Доступность = СтруктураДанные.ОрдерныйСкладОтходов;
			
		Иначе
			
			Объект.СтруктурнаяЕдиницаОтходов = Объект.СтруктурнаяЕдиница;
			Объект.ЯчейкаОтходов = Объект.Ячейка;
			Элементы.ЯчейкаОтходов.Доступность = СтруктураДанные.ОрдерныйСклад;
			
		КонецЕсли;
		
		Объект.ПодписьКладовщикаОтправил = ?(СтруктураДанные.ЭтоСборка, СтруктураДанные.СтруктурнаяЕдиницаЗапасовПодписьМОЛ, СтруктураДанные.СтруктурнаяЕдиницаПродукцииПодписьМОЛ);
		Объект.ПодписьКладовщикаПолучил = ?(СтруктураДанные.ЭтоСборка, СтруктураДанные.СтруктурнаяЕдиницаПродукцииПодписьМОЛ, СтруктураДанные.СтруктурнаяЕдиницаЗапасовПодписьМОЛ);
		
	Иначе
		
		Элементы.Ячейка.Доступность = Ложь;
		
		Объект.ПодписьКладовщикаОтправил = Неопределено;
		Объект.ПодписьКладовщикаПолучил = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры // СтруктурнаяЕдиницаПриИзменении()

// Процедура - обработчик события Открытие поля СтруктурнаяЕдиница.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Элементы.СтруктурнаяЕдиница.РежимВыбораИзСписка
		И НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // СтруктурнаяЕдиницаОткрытие()

// Процедура - обработчик события ПриИзменении поля ввода Ячейка.
//
&НаКлиенте
Процедура ЯчейкаПриИзменении(Элемент)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("Ячейка", Объект.Ячейка);
	СтруктураДанные.Вставить("СтруктурнаяЕдиницаПродукции", Объект.СтруктурнаяЕдиницаПродукции);
	СтруктураДанные.Вставить("ЯчейкаПродукции", Объект.ЯчейкаПродукции);
	СтруктураДанные.Вставить("СтруктурнаяЕдиницаЗапасов", Объект.СтруктурнаяЕдиницаЗапасов);
	СтруктураДанные.Вставить("ЯчейкаЗапасов", Объект.ЯчейкаЗапасов);
	СтруктураДанные.Вставить("СтруктурнаяЕдиницаОтходов", Объект.СтруктурнаяЕдиницаОтходов);
	СтруктураДанные.Вставить("ЯчейкаОтходов", Объект.ЯчейкаОтходов);
	
	СтруктураДанные = ПолучитьДанныеЯчейкаПриИзменении(СтруктураДанные);
	
	Если СтруктураДанные.Свойство("НоваяЯчейкаПродукции") Тогда
		Объект.ЯчейкаПродукции = СтруктураДанные.НоваяЯчейкаПродукции;
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("НоваяЯчейкаЗапасов") Тогда
		Объект.ЯчейкаЗапасов = СтруктураДанные.НоваяЯчейкаЗапасов;
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("НоваяЯчейкаОтходов") Тогда
		Объект.ЯчейкаОтходов = СтруктураДанные.НоваяЯчейкаОтходов;
	КонецЕсли;
	
КонецПроцедуры // ЯчейкаПриИзменении()

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовПодвалаФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
		
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "удалить" Тогда
		Объект.ДокументОснование = Неопределено;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Неопределено);
		Модифицированность = Истина;
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "заполнить" Тогда
		ЗаполнитьПоОснованиюНачало();		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "выбрать" Тогда
		//Выбрать основание
		СтруктураПараметровОтбора = Новый Структура();
		_ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьОснованиеЗавершение", ЭтотОбъект);
		ОткрытьФорму("Документ.ЗаказПокупателя.ФормаВыбора", СтруктураПараметровОтбора, ЭтотОбъект, ,,,_ОповещениеОЗакрытии);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "открыть" Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) тогда
			возврат;
		КонецЕсли;
		
		РаботаСФормойДокументаКлиент.ОткрытьФормуДокументаПоТипу(Объект.ДокументОснование);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОснованиеЗавершение(ВыбЗначение, Параметры) Экспорт

	Если ВыбЗначение<>Неопределено Тогда
		Объект.ДокументОснование = ВыбЗначение;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(ВыбЗначение);
		Модифицированность = Истина;
		
		ЗаполнитьПоОснованиюНачало();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюНачало() Экспорт

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоДокументОснованиеЗавершение", ЭтотОбъект);
	ПоказатьВопрос(
		ОписаниеОповещения, 
		НСтр("ka='შევავსოთ დოკუმენტი არჩეული საფუძვლით?';ru='Заполнить документ по выбранному основанию?';en='Complete the document by the selected base?'"), 
		РежимДиалогаВопрос.ДаНет, 0);		

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументОснованиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Ответ = Результат;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        ЗаполнитьПоДокументу("ДокументОснование");
    КонецЕсли;

КонецПроцедуры // ЗаполнитьПоДокументОснование()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПродукция

// Процедура - обработчик события ПриИзменении поля ввода Номенклатура.
//
&НаКлиенте
Процедура ПродукцияНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	
	Если Объект.ВидОперации = КэшЗначений.ВОРазборка Тогда
		
		СтрокаТабличнойЧасти.СтранаПроисхождения = СтруктураДанные.СтранаПроисхождения;
		СтрокаТабличнойЧасти.НомерГТД = Неопределено;
		
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Количество = 1;
	СтрокаТабличнойЧасти.Спецификация = СтруктураДанные.Спецификация;
	
	//Серийные номера
	РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомераПродукция, СтрокаТабличнойЧасти,,ИспользоватьСерийныеНомераОстатки);
	
	СтрокаТабличнойЧасти.СрокГодности = ?(СтруктураДанные.КоличествоДни >0,Объект.Дата + СтруктураДанные.КоличествоДни * 86400,Дата(1,1,1));//+Lazare 08.11.2022

	СтрокаТабличнойЧасти.КоличествоНаСкладе = УправлениеНебольшойФирмойСервер.ПолучитьКоличествоЗапасовНаСкладе(Объект.Дата,СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Характеристика,СтрокаТабличнойЧасти.Партия,Объект.Организация, Объект.СтруктурнаяЕдиницаПродукции);//++Lazare 13.12.2022
	
	Если УчитыватьДополнительныеЗатратыВПроизводстве Тогда
	
		СтрокаТабличнойЧасти.ДоляДопРасходов = 1;	
	
	КонецЕсли; 
	
КонецПроцедуры // ПродукцияНоменклатураПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Характеристика.
//
&НаКлиенте
Процедура ПродукцияХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	
	СтруктураДанные = ПолучитьДанныеХарактеристикаПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.Спецификация = СтруктураДанные.Спецификация;
	
КонецПроцедуры // ПродукцияХарактеристикаПриИзменении()

&НаКлиенте
Процедура ПродукцияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		Элемент.ТекущиеДанные.КлючСвязи = 0;
		Элемент.ТекущиеДанные.СерийныеНомера = "";
	КонецЕсли;	
	
	//ПодольскийАИ #УчетПроектов 13.10.2020 {
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Проект = Объект.Проект;
	КонецЕсли;	
	//ПодольскийАИ #УчетПроектов 13.10.2020 }
	
	Если Элемент.ТекущийЭлемент.Имя = "ПродукцияСерийныеНомера" Тогда
		ОткрытьПодборСерийныеНомера("Продукция","СерийныеНомераПродукция");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияКоличествоПриИзменении(Элемент)
	
	// Серийные номера
	Если ИспользоватьСерийныеНомераОстатки<>Неопределено Тогда
		РаботаССерийнымиНомерамиКлиентСервер.ОбновитьСерийныеНомераКоличество(Объект, Элементы.Продукция.ТекущиеДанные, "СерийныеНомераПродукция");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПередУдалением(Элемент, Отказ)
	
	// Серийные номера
	Для каждого ВыделеннаяСтрока Из Элементы.Продукция.ВыделенныеСтроки Цикл
		ТекущиеДанныеСтроки = Элементы.Продукция.ДанныеСтроки(ВыделеннаяСтрока);
		РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомераПродукция, ТекущиеДанныеСтроки,,ИспользоватьСерийныеНомераОстатки);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНомерГТДПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	Если СтрокаТабличнойЧасти <> Неопределено
		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.НомерГТД) Тогда
		
		ДатаГТД = ГрузовыеТаможенныеДекларацииКлиент.ВыделитьДатуИзНомераГТД(Строка(СтрокаТабличнойЧасти.НомерГТД));
		Если ДатаГТД > КонецДня(Объект.Дата) Тогда
			
			ТекстСообщения = НСтр("ka='ყურადღება! არჩეული სატვირთო-საბაჟო დეკლარაცია დათარიღებულია უფრო გვიანი თარიღით, ვიდრე მიმდინარე დოკუმენტი';ru='Внимание! Выбранная ГТД датирована более поздней датой, чем текущий документ';en='Attention! Selected GTD dated later date than the current document'");
			Прилипалка = СтрШаблон("Объект.Продукция[%1].НомерГТД", СтрокаТабличнойЧасти.ПолучитьИдентификатор());
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Прилипалка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСтранаПроисхожденияПриИзменении(Элемент)
	
	Если КэшЗначений.УчетГТД Тогда
		
		СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтранаПроисхождения)
			ИЛИ СтрокаТабличнойЧасти.СтранаПроисхождения = КэшЗначений.Россия Тогда
			
			СтрокаТабличнойЧасти.НомерГТД = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область СтруктурнаяЕдиницаПродукцияПолучательСборка

// Процедура - обработчик события ПриИзменении поля ввода СтруктурнаяЕдиницаПродукцииСборка.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаПродукцииСборкаПриИзменении(Элемент)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Организация",	Объект.Организация);
	СтруктураДанные.Вставить("Склад",		Объект.СтруктурнаяЕдиницаПродукции);
	
	СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиницаПродукцияЗапасыОтходыПриИзменении(СтруктураДанные);
	Объект.ПодписьКладовщикаПолучил = СтруктураДанные.ПодписьМОЛ;
	
	Элементы.ЯчейкаПродукцииСборка.Доступность = (НЕ СтруктураДанные.ОрдерныйСклад И ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаПродукции));
	
КонецПроцедуры // СтруктурнаяЕдиницаПродукцииСборкаПриИзменении()

// Процедура - обработчик события Открытие поля СтруктурнаяЕдиницаПродукцииСборка.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаПродукцииСборкаОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Элементы.СтруктурнаяЕдиницаПродукцииСборка.РежимВыбораИзСписка
		И НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаПродукции) Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // СтруктурнаяЕдиницаПродукцииСборкаОткрытие()

#КонецОбласти

#Область СтруктурнаяЕдиницаПродукцияСписатьИзРазборка

// Процедура - обработчик события ПриИзменении поля ввода СтруктурнаяЕдиницаПродукцииРазборка.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаПродукцииРазборкаПриИзменении(Элемент)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Склад",		Объект.СтруктурнаяЕдиницаЗапасов);
	
	СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиницаПродукцияЗапасыОтходыПриИзменении(СтруктураДанные);
	Объект.ПодписьКладовщикаОтправил = СтруктураДанные.ПодписьМОЛ;
	
	Элементы.ЯчейкаПродукцииРазборка.Доступность = (НЕ СтруктураДанные.ОрдерныйСклад И ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаЗапасов));
	
КонецПроцедуры // СтруктурнаяЕдиницаПродукцииРазборкаПриИзменении()

// Процедура - обработчик события Открытие поля СтруктурнаяЕдиницаПродукцииРазборка.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаПродукцииРазборкаОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Элементы.СтруктурнаяЕдиницаПродукцииРазборка.РежимВыбораИзСписка
		И НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаЗапасов) Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // СтруктурнаяЕдиницаПродукцииРазборкаОткрытие()

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

// Процедура - обработчик события ПриИзменении поля ввода Номенклатура.
//
&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	
	Если Объект.ВидОперации = КэшЗначений.ВОСборка Тогда
		
		СтрокаТабличнойЧасти.СтранаПроисхождения = СтруктураДанные.СтранаПроисхождения;
		СтрокаТабличнойЧасти.НомерГТД = Неопределено;
		
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Спецификация = СтруктураДанные.Спецификация;
	СтрокаТабличнойЧасти.Количество = 1;
	СтрокаТабличнойЧасти.ДоляСтоимости = СтруктураДанные.КоэффициентРазборки;
	
	//Серийные номера
	РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомера, СтрокаТабличнойЧасти,,ИспользоватьСерийныеНомераОстатки);
	
	СтрокаТабличнойЧасти.СрокГодности = ?(СтруктураДанные.КоличествоДни >0,Объект.Дата + СтруктураДанные.КоличествоДни * 86400,Дата(1,1,1));//+Lazare 08.11.2022
	СтрокаТабличнойЧасти.КоличествоНаСкладе = УправлениеНебольшойФирмойСервер.ПолучитьКоличествоЗапасовНаСкладе(Объект.Дата,СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Характеристика,СтрокаТабличнойЧасти.Партия,Объект.Организация,Объект.СтруктурнаяЕдиницаЗапасов);//++Lazare 13.12.2022

КонецПроцедуры // ЗапасыНоменклатураПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Характеристика.
//
&НаКлиенте
Процедура ЗапасыХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	
	СтруктураДанные = ПолучитьДанныеХарактеристикаПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.Спецификация = СтруктураДанные.Спецификация;
	
КонецПроцедуры // ЗапасыХарактеристикаПриИзменении()

&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		Элемент.ТекущиеДанные.КлючСвязи = 0;
		Элемент.ТекущиеДанные.СерийныеНомера = "";
	КонецЕсли;	
	
	//ПодольскийАИ #УчетПроектов 13.10.2020 {
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Проект = Объект.Проект;
	КонецЕсли;	
	//ПодольскийАИ #УчетПроектов 13.10.2020 }
	
	Если Элемент.ТекущийЭлемент.Имя = "ЗапасыСерийныеНомера" Тогда
		ОткрытьПодборСерийныеНомера("Запасы", "СерийныеНомера");
	КонецЕсли;   
		
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	// Серийные номера
	Если ИспользоватьСерийныеНомераОстатки<>Неопределено Тогда
		РаботаССерийнымиНомерамиКлиентСервер.ОбновитьСерийныеНомераКоличество(Объект, Элементы.Запасы.ТекущиеДанные);
	КонецЕсли;
	
	Если ФункционалСобраниеЗапасовВДокументе Тогда 
		УстановитьЗначРеквизитаТзМатериалы(Элементы.Запасы.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередУдалением(Элемент, Отказ)
	
	// Серийные номера
	Для каждого ВыделеннаяСтрока Из Элементы.Запасы.ВыделенныеСтроки Цикл
		ТекущиеДанныеСтроки = Элементы.Запасы.ДанныеСтроки(ВыделеннаяСтрока);
		РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомера, ТекущиеДанныеСтроки,,ИспользоватьСерийныеНомераОстатки);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНомерГТДПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти <> Неопределено
		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.НомерГТД) Тогда
		
		ДатаГТД = ГрузовыеТаможенныеДекларацииКлиент.ВыделитьДатуИзНомераГТД(Строка(СтрокаТабличнойЧасти.НомерГТД));
		Если ДатаГТД > КонецДня(Объект.Дата) Тогда
			
			ТекстСообщения = НСтр("ka='ყურადღება! არჩეული სატვირთო-საბაჟო დეკლარაცია დათარიღებულია უფრო გვიანი თარიღით, ვიდრე მიმდინარე დოკუმენტი';ru='Внимание! Выбранная ГТД датирована более поздней датой, чем текущий документ';en='Attention! Selected GTD dated later date than the current document'");
			Прилипалка = СтрШаблон("Объект.Запасы[%1].НомерГТД", СтрокаТабличнойЧасти.ПолучитьИдентификатор());
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Прилипалка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСтранаПроисхожденияПриИзменении(Элемент)
	
	Если КэшЗначений.УчетГТД Тогда
		
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтранаПроисхождения)
			ИЛИ СтрокаТабличнойЧасти.СтранаПроисхождения = КэшЗначений.Россия Тогда
			
			СтрокаТабличнойЧасти.НомерГТД = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыКоличествоСобрПриИзменении(Элемент)
	
	Если ФункционалСобраниеЗапасовВДокументе Тогда 
		УстановитьЗначРеквизитаТзМатериалы(Элементы.Запасы.ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры


#Область СтруктурнаяЕдиницаЗапасыСписатьИзСборка

// Процедура - обработчик события ПриИзменении поля ввода СтруктурнаяЕдиницаЗапасовСборка.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаЗапасовСборкаПриИзменении(Элемент)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Склад",		Объект.СтруктурнаяЕдиницаЗапасов);
	
	СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиницаПродукцияЗапасыОтходыПриИзменении(СтруктураДанные);
	Объект.ПодписьКладовщикаОтправил = СтруктураДанные.ПодписьМОЛ;
	
	Элементы.ЯчейкаЗапасовСборка.Доступность = (НЕ СтруктураДанные.ОрдерныйСклад И ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаЗапасов));
	
КонецПроцедуры // СтруктурнаяЕдиницаЗапасовСборкаПриИзменении()

// Процедура - обработчик события Открытие поля СтруктурнаяЕдиницаЗапасовСборка.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаЗапасовСборкаОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Элементы.СтруктурнаяЕдиницаЗапасовСборка.РежимВыбораИзСписка
		И НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаЗапасов) Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // СтруктурнаяЕдиницаЗапасовСборкаОткрытие()

#КонецОбласти

#Область СтруктурнаяЕдиницаЗапасыПолучательРазборка

// Процедура - обработчик события ПриИзменении поля ввода СтруктурнаяЕдиницаЗапасовРазборка.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаЗапасовРазборкаПриИзменении(Элемент)
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Склад",		Объект.СтруктурнаяЕдиницаПродукции);
	
	СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиницаПродукцияЗапасыОтходыПриИзменении(СтруктураДанные);
	Объект.ПодписьКладовщикаПолучил = СтруктураДанные.ПодписьМОЛ;
	
	Элементы.ЯчейкаЗапасовРазборка.Доступность = (НЕ СтруктураДанные.ОрдерныйСклад И ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаПродукции));
	
КонецПроцедуры // СтруктурнаяЕдиницаЗапасовРазборкаПриИзменении()

// Процедура - обработчик события Открытие поля СтруктурнаяЕдиницаЗапасовРазборка.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаЗапасовРазборкаОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Элементы.СтруктурнаяЕдиницаЗапасовРазборка.РежимВыбораИзСписка
		И НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаПродукции) Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // СтруктурнаяЕдиницаЗапасовРазборкаОткрытие()

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтходы

// Процедура - обработчик события ПриИзменении поля ввода Номенклатура.
//
&НаКлиенте
Процедура ОтходыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Отходы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Количество = 1;
	
КонецПроцедуры // ОтходыНоменклатураПриИзменении()

#Область СтруктурнаяЕдиницаПолучательОтходов

// Процедура - обработчик события ПриИзменении поля ввода СтруктурнаяЕдиницаОтходов.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаОтходовПриИзменении(Элемент)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Склад", Объект.СтруктурнаяЕдиницаОтходов);
	
	СтруктураДанные = ПолучитьДанныеСтруктурнаяЕдиницаПродукцияЗапасыОтходыПриИзменении(СтруктураДанные);
	
	Элементы.ЯчейкаОтходов.Доступность = (НЕ СтруктураДанные.ОрдерныйСклад И ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаОтходов));
	
КонецПроцедуры // СтруктурнаяЕдиницаОтходовПриИзменении()

// Процедура - обработчик события Открытие поля СтруктурнаяЕдиницаОтходов.
//
&НаКлиенте
Процедура СтруктурнаяЕдиницаОтходовОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Элементы.СтруктурнаяЕдиницаОтходов.РежимВыбораИзСписка
		И НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаОтходов) Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // СтруктурнаяЕдиницаОтходовОткрытие()

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДекорацияПечатьНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияРеквизитовПечати", ЭтотОбъект);
	ОткрытьФорму("Обработка.РеквизитыПечати.Форма.РеквизитыПечатиПроизводство", Новый Структура("КонтекстПечати", Объект), ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

// Процедура - обработчик нажатия на кнопку ЗаполнитьПоОснованию.
//
&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	
	Ответ = Неопределено;

	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", ЭтотОбъект), НСтр("ka='დოკუმენტი სრულიად შეივსება ""საფუძვლით""! გავაგრძელოთ ოპერაცია?';ru='Документ будет полностью перезаполнен по ""Основанию""! Продолжить выполнение операции?';en='The document will be fully refilled by ""base""! To continue the operation?'"), РежимДиалогаВопрос.ДаНет, 0);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьПоДокументу("ЗаказНаПроизводство");
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСборкаЗапасов.Разборка") Тогда
			
			Если НЕ ЗначениеЗаполнено(Объект.ЗаказПокупателя) Тогда
				
				Для Каждого СтрокаЗапасы Из Объект.Продукция Цикл
					СтрокаЗапасы.Резерв = 0;
				КонецЦикла;
				Элементы.Продукция.ПодчиненныеЭлементы.ПродукцияРезерв.Видимость = Ложь;
				
			Иначе
				
				Если Элементы.Продукция.ПодчиненныеЭлементы.ПродукцияРезерв.Видимость = Ложь Тогда
					Элементы.Продукция.ПодчиненныеЭлементы.ПродукцияРезерв.Видимость = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если НЕ ЗначениеЗаполнено(Объект.ЗаказПокупателя) Тогда
				
				Для Каждого СтрокаЗапасы Из Объект.Запасы Цикл
					СтрокаЗапасы.Резерв = 0;
				КонецЦикла;
				Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыРезерв.Видимость = Ложь;
				Элементы.ЗапасыИзменитьРезерв.Видимость = Ложь;
				ИспользуетсяРезервирование = Ложь;
				
			Иначе
				
				Если Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыРезерв.Видимость = Ложь Тогда
					Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыРезерв.Видимость = Истина;
					Элементы.ЗапасыИзменитьРезерв.Видимость = Истина;
					ИспользуетсяРезервирование = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  // ЗаполнитьПоОснованию()

// Процедура - обработчик нажатия на кнопку ЗаполнитьПоЗаказуПокупателя.
//
&НаКлиенте
Процедура ЗаполнитьПоЗаказуПокупателя(Команда)
	
	Ответ = Неопределено;

	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоЗаказуПокупателяЗавершение", ЭтотОбъект), НСтр("ka='დოკუმენტი სრულიად შეივსება ""მყიდველის შეკვეთით""! გავაგრძელოთ ოპერაცია?';ru='Документ будет полностью перезаполнен по ""Заказу покупателя""! Продолжить выполнение операции?';en='The document will be fully refilled by ""Buyer''s order!"" To continue the operation?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаказуПокупателяЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Ответ = Результат;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        ЗаполнитьПоДокументу("ЗаказПокупателя");
    КонецЕсли;

КонецПроцедуры // ЗаполнитьПоЗаказуПокупателя()

// Процедура - обработчик команды ЗаполнитьПоРезервам подменю ИзменитьРезерв.
//
&НаКлиенте
Процедура ИзменитьРезервЗаполнитьПоРезервам(Команда)
	
	Если Объект.Запасы.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='ცხრილი ""მარაგები და მომსახურებები"" შევსებული არ არის!';ru='Табличная часть ""Запасы и услуги"" не заполнена!';en='A table of the ""Reserves and services"" is not full!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКолонкуРезервПоРезервамНаСервере();
	
КонецПроцедуры // ИзменитьРезервЗаполнитьПоРезервам()

// Процедура - обработчик команды ОчиститьРезерв подменю ИзменитьРезерв.
//
&НаКлиенте
Процедура ИзменитьРезервОчиститьРезерв(Команда)
	
	Если Объект.Запасы.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='ცხრილი ""მარაგები და მომსახურებები"" შევსებული არ არის!';ru='Табличная часть ""Запасы и услуги"" не заполнена!';en='A table of the ""Reserves and services"" is not full!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		СтрокаТабличнойЧасти.Резерв = 0;
	КонецЦикла;
	
КонецПроцедуры // ИзменитьРезервЗаполнитьПоОстаткам()

// Процедура - обработчик команды командной панели табличной части.
//
&НаКлиенте
Процедура КомандаЗаполнитьПоСпецификации(Команда)
	
	Если Объект.Запасы.Количество() <> 0 Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаЗаполнитьПоСпецификацииЗавершение", ЭтотОбъект), НСтр("ka='ცხრილი ""მასალები"" გადაივსება! გავაგრძელოთ ოპერაციის შესრულება?';ru='Табличная часть ""Материалы"" будет перезаполнена! Продолжить выполнение операции?';en='A table of the ""Materials"" will be refilled! To continue the operation?'"), 
		РежимДиалогаВопрос.ДаНет, 0);
		Возврат;
		
	КонецЕсли;
	
	КомандаЗаполнитьПоСпецификацииФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоСпецификацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	
	КомандаЗаполнитьПоСпецификацииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоСпецификацииФрагмент()
	
	ЗаполнитьПоСпецификацииНаСервере();
	
КонецПроцедуры // КомандаЗаполнитьПоСпецификации()

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПечатьТТН.Форма.ДанныеПечати" Тогда
		
		Для каждого ЗначенияРеквизита Из ВыбранноеЗначение Цикл
			Если Объект.Свойство(ЗначенияРеквизита.Ключ) Тогда
				Объект[ЗначенияРеквизита.Ключ] = ЗначенияРеквизита.Значение;
				Модифицированность = Истина;
			КонецЕсли; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКомандуПечати(Результат.Команда);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет Запасы по спецификации.
//
&НаСервере
Процедура ЗаполнитьПоСпецификацииНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	СтекСпецификацийУзлов = Новый Массив;
	Документ.ЗаполнитьТабличнуюЧастьПоСпецификации(СтекСпецификацийУзлов);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры // ЗаполнитьМатериальныеЗатратыПоСпецификацииНаСервере()

// Получает набор данных с сервера для процедуры ДатаПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением, ВалютаДокумента = Неопределено)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", УправлениеНебольшойФирмойСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением));  
	
	//+++ Дмгг      
	Если ВалютаДокумента <> Неопределено Тогда 
		ВалютаКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаНовая, Новый Структура("Валюта", ВалютаДокумента));
		СтруктураДанные.Вставить("ВалютаКурсКратность", ВалютаКурсКратность);  
	КонецЕсли;
	//--- Дмгг
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

// Получает набор данных с сервера.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеОрганизацияПриИзменении(Организация)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Компания", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	СтруктураДанные.Вставить("ПодписьРуководителя", Организация.ПодписьРуководителя);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеОрганизацияПриИзменении()

// Получает набор данных с сервера для процедуры НоменклатураПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("СтранаПроисхождения", СтруктураДанные.Номенклатура.СтранаПроисхождения);
	
	//--------------------------------------------------------------------------
	// © Шишка В.В. [26 декабря 2023]  НАЧАЛО
	СтруктураДанные.Вставить("СтавкаНДС", СтруктураДанные.Номенклатура.СтавкаНДС);
	// © Шишка В.В. [26 декабря 2023]  КОНЕЦ
	//--------------------------------------------------------------------------
	Если СтруктураДанные.Свойство("Характеристика") Тогда
		СтруктураДанные.Вставить("Спецификация", УправлениеНебольшойФирмойСервер.ПолучитьПоУмолчаниюСпецификацию(СтруктураДанные.Номенклатура, СтруктураДанные.Характеристика));
	Иначе
		СтруктураДанные.Вставить("Спецификация", УправлениеНебольшойФирмойСервер.ПолучитьПоУмолчаниюСпецификацию(СтруктураДанные.Номенклатура));
	КонецЕсли;
	
	//+++ Дмгг
	КоэффициентРазборки = 1;
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура.Родитель) Тогда 
		КоэффициентРазборки = СтруктураДанные.Номенклатура.Родитель.КоэффициентРазборки;
	КонецЕсли;
	СтруктураДанные.Вставить("КоэффициентРазборки", КоэффициентРазборки);
	//--- Дмгг
	
	СтруктураДанные.Вставить("КоличествоДни", СтруктураДанные.Номенклатура.СрокГодности); //+++ Lazare 08.11.2022

	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

// Получает набор данных с сервера для процедуры ХарактеристикаПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеХарактеристикаПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("Спецификация", УправлениеНебольшойФирмойСервер.ПолучитьПоУмолчаниюСпецификацию(СтруктураДанные.Номенклатура, СтруктураДанные.Характеристика));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеХарактеристикаПриИзменении()

// Получает набор данных с сервера для процедуры СтруктурнаяЕдиницаПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеСтруктурнаяЕдиницаПриИзменении(СтруктураДанные)
	
	Если СтруктураДанные.Подразделение.ПолучательПеремещения.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад
		ИЛИ СтруктураДанные.Подразделение.ПолучательПеремещения.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение Тогда
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаПродукции", СтруктураДанные.Подразделение.ПолучательПеремещения);
		СтруктураДанные.Вставить("ЯчейкаПродукции", СтруктураДанные.Подразделение.ЯчейкаПолучателяПеремещения);
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаПродукцииПодписьМОЛ", СтруктураДанные.Подразделение.ПолучательПеремещения.ПодписьМОЛ);
		
	Иначе
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаПродукции", Неопределено);
		СтруктураДанные.Вставить("ЯчейкаПродукции", Неопределено);
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаПродукцииПодписьМОЛ", СтруктураДанные.Подразделение.ПодписьМОЛ);
		
	КонецЕсли;
	
	Если СтруктураДанные.Подразделение.ИсточникПеремещения.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад
		ИЛИ СтруктураДанные.Подразделение.ИсточникПеремещения.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение Тогда
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаЗапасов", СтруктураДанные.Подразделение.ИсточникПеремещения);
		СтруктураДанные.Вставить("ЯчейкаЗапасов", СтруктураДанные.Подразделение.ЯчейкаИсточникаПеремещения);
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаЗапасовПодписьМОЛ", СтруктураДанные.Подразделение.ИсточникПеремещения.ПодписьМОЛ);
		
	Иначе
		
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаЗапасов", Неопределено);
		СтруктураДанные.Вставить("ЯчейкаЗапасов", Неопределено);
		СтруктураДанные.Вставить("СтруктурнаяЕдиницаЗапасовПодписьМОЛ", СтруктураДанные.Подразделение.ПодписьМОЛ);
		
	КонецЕсли;
	
	СтруктураДанные.Вставить("СтруктурнаяЕдиницаОтходов", СтруктураДанные.Подразделение.ПолучательОтходов);
	СтруктураДанные.Вставить("ЯчейкаОтходов", СтруктураДанные.Подразделение.ЯчейкаПолучателяОтходов);
	
	СтруктураДанные.Вставить("ОрдерныйСклад", НЕ СтруктураДанные.Подразделение.ОрдерныйСклад);
	СтруктураДанные.Вставить("ОрдерныйСкладПродукции", НЕ СтруктураДанные.Подразделение.ПолучательПеремещения.ОрдерныйСклад);
	СтруктураДанные.Вставить("ОрдерныйСкладОтходов", НЕ СтруктураДанные.Подразделение.ПолучательОтходов.ОрдерныйСклад);
	СтруктураДанные.Вставить("ОрдерныйСкладЗапасов", НЕ СтруктураДанные.Подразделение.ИсточникПеремещения.ОрдерныйСклад);
	СтруктураДанные.Вставить("ЭтоСборка", (СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеСтруктурнаяЕдиницаПриИзменении()

// Получает набор данных с сервера для процедуры ЯчейкаПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеЯчейкаПриИзменении(СтруктураДанные)
	
	Если СтруктураДанные.СтруктурнаяЕдиница = СтруктураДанные.СтруктурнаяЕдиницаПродукции Тогда
		
		Если СтруктураДанные.СтруктурнаяЕдиница.ПолучательПеремещения <> СтруктураДанные.СтруктурнаяЕдиницаПродукции
			ИЛИ СтруктураДанные.СтруктурнаяЕдиница.ЯчейкаПолучателяПеремещения <> СтруктураДанные.ЯчейкаПродукции Тогда
			
			СтруктураДанные.Вставить("НоваяЯчейкаПродукции", СтруктураДанные.Ячейка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураДанные.СтруктурнаяЕдиница = СтруктураДанные.СтруктурнаяЕдиницаЗапасов Тогда
		
		Если СтруктураДанные.СтруктурнаяЕдиница.ИсточникПеремещения <> СтруктураДанные.СтруктурнаяЕдиницаЗапасов
			ИЛИ СтруктураДанные.СтруктурнаяЕдиница.ЯчейкаИсточникаПеремещения <> СтруктураДанные.ЯчейкаЗапасов Тогда
			
			СтруктураДанные.Вставить("НоваяЯчейкаЗапасов", СтруктураДанные.Ячейка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураДанные.СтруктурнаяЕдиница = СтруктураДанные.СтруктурнаяЕдиницаОтходов Тогда
		
		Если СтруктураДанные.СтруктурнаяЕдиница.ПолучательОтходов <> СтруктураДанные.СтруктурнаяЕдиницаОтходов
			ИЛИ СтруктураДанные.СтруктурнаяЕдиница.ЯчейкаПолучателяОтходов <> СтруктураДанные.ЯчейкаОтходов Тогда
			
			СтруктураДанные.Вставить("НоваяЯчейкаОтходов", СтруктураДанные.Ячейка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеЯчейкаПриИзменении()

// Получает набор данных с сервера для процедуры СтруктурнаяЕдиницаПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеСтруктурнаяЕдиницаПродукцияЗапасыОтходыПриИзменении(СтруктураДанные)
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанные.Склад, "ОрдерныйСклад, ПодписьМОЛ");
	
	СтруктураДанные.Вставить("ОрдерныйСклад", ЗначенияРеквизитов.ОрдерныйСклад = Истина);
	СтруктураДанные.Вставить("ПодписьМОЛ", ЗначенияРеквизитов.ПодписьМОЛ);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеСтруктурнаяЕдиницаПродукцияЗапасыОтходыПриИзменении()

// Процедура вызывает обработку заполнения документа по основанию.
//
&НаСервере
Процедура ЗаполнитьПоДокументу(РеквизитОснование = "ДокументОснование")
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.Заполнить(Объект[РеквизитОснование]);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры // ЗаполнитьПоДокументу()

// ПодключаемоеОборудование
// Процедура получает данные по штрихкодам.
//
&НаСервереБезКонтекста
Процедура ПолучитьДанныеПоШтрихКодам(СтруктураДанные)
	
	// Преобразование весовых штрихкодов.
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ТекШтрихкод);
		
	КонецЦикла;
	
	ДанныеПоШтрихКодам = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодам(СтруктураДанные.МассивШтрихкодов);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		ДанныеШтрихкода = ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если ДанныеШтрихкода <> Неопределено
		   И ДанныеШтрихкода.Количество() <> 0 Тогда
			
			СтруктураДанныеНоменклатуры = Новый Структура();
			СтруктураДанныеНоменклатуры.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
			СтруктураДанныеНоменклатуры.Вставить("ТипНоменклатуры", ДанныеШтрихкода.Номенклатура.ТипНоменклатуры);
			СтруктураДанныеНоменклатуры.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
			ДанныеШтрихкода.Вставить("СтруктураДанныеНоменклатуры", ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры));
			
			Если НЕ ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения) Тогда
				ДанныеШтрихкода.ЕдиницаИзмерения  = ДанныеШтрихкода.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДанные.Вставить("ДанныеПоШтрихКодам", ДанныеПоШтрихКодам);
	
	Для каждого парам Из Метаданные.Документы.СборкаЗапасов.ТабличныеЧасти.Запасы.Реквизиты.Номенклатура.ПараметрыВыбора Цикл
		Если парам.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(парам.Значение)=Тип("ФиксированныйМассив") Тогда
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", парам.Значение);
			Иначе
			    МассивТипов = Новый Массив;
				МассивТипов.Добавить(парам.Значение);
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", МассивТипов);
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПолучитьДанныеПоШтрихКодам()

&НаКлиенте
Функция ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрикодов)
		
	НеизвестныеШтрихкоды = Новый Массив;
	ШтрихкодыНекорректногоТипа = Новый Массив;
	
	Если ТипЗнч(ДанныеШтрикодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрикодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрикодов);
	КонецЕсли;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("МассивШтрихкодов", МассивШтрихкодов);
	ПолучитьДанныеПоШтрихКодам(СтруктураДанные);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		ДанныеШтрихкода = СтруктураДанные.ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если ДанныеШтрихкода <> Неопределено
		   И ДанныеШтрихкода.Количество() = 0 Тогда
			НеизвестныеШтрихкоды.Добавить(ТекШтрихкод);
		ИначеЕсли СтруктураДанные.ОтборТипНоменклатуры.Найти(ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры) = Неопределено Тогда
			ШтрихкодыНекорректногоТипа.Добавить(Новый Структура("Штрихкод,Номенклатура,ТипНоменклатуры", ТекШтрихкод.Штрихкод, ДанныеШтрихкода.Номенклатура, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры));
		Иначе
			МассивСтрокТЧ = Объект.Запасы.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,ЕдиницаИзмерения",ДанныеШтрихкода.Номенклатура,ДанныеШтрихкода.Характеристика,ДанныеШтрихкода.ЕдиницаИзмерения));
			Если не ФункционалСобраниеЗапасовВДокументе Тогда 
				Если МассивСтрокТЧ.Количество() = 0 Тогда
					НоваяСтрока = Объект.Запасы.Добавить();
					НоваяСтрока.Номенклатура = ДанныеШтрихкода.Номенклатура;
					НоваяСтрока.Характеристика = ДанныеШтрихкода.Характеристика;
					НоваяСтрока.Партия = ДанныеШтрихкода.Партия;
					НоваяСтрока.Количество = ТекШтрихкод.Количество;
					НоваяСтрока.ДоляСтоимости = 1;
					НоваяСтрока.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения), ДанныеШтрихкода.ЕдиницаИзмерения, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЕдиницаИзмерения);
					НоваяСтрока.Спецификация = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.Спецификация;
					Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
					НоваяСтрока.КоличествоНаСкладе = УправлениеНебольшойФирмойСервер.ПолучитьКоличествоЗапасовНаСкладе(Объект.Дата,НоваяСтрока.Номенклатура,НоваяСтрока.Характеристика,НоваяСтрока.Партия,Объект.Организация,Объект.СтруктурнаяЕдиницаЗапасов);//++Lazare 13.12.2022
				Иначе
					НоваяСтрока = МассивСтрокТЧ[0];
					НоваяСтрока.Количество = НоваяСтрока.Количество + ТекШтрихкод.Количество;
					Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
				КонецЕсли;
			Иначе 
				
				Если МассивСтрокТЧ.Количество() = 0 Тогда 
					
					ТекстПредупреждения = Строка(ДанныеШтрихкода.Номенклатура) + НСтр("ru = '- Номенклатура не выбрана в тз. материалы'; ka = '- მოცემული ნომენკლატურა მასალებში დამატებული არაა'") ; 
					Предупреждение(ТекстПредупреждения);
				Иначе 	
					НоваяСтрока = МассивСтрокТЧ[0];
					
					Если НужнаПроверит(НоваяСтрока.Номенклатура) Тогда 
						
						ОтклонениеПроцент = ПолучитьОтклонение(НоваяСтрока.Номенклатура);
						
						Если ОтклонениеПроцент = 0 Тогда 
							Если НоваяСтрока.КоличествоСобр + ТекШтрихкод.Количество <= НоваяСтрока.Количество Тогда 
								//++ONESOFT-3137
								Если ФункционалИзменитьЛогикуСобранияЗапасов Тогда 
									НоваяСтрока.КоличествоСобр = ТекШтрихкод.Количество;
								Иначе    
								//++ONESOFT-3137	
									НоваяСтрока.КоличествоСобр = НоваяСтрока.КоличествоСобр + ТекШтрихкод.Количество;  
								КонецЕсли; 
								
								Если НоваяСтрока.Количество = НоваяСтрока.КоличествоСобр Тогда 
									НоваяСтрока.ОК = Истина;
								КонецЕсли;	
								
								
							Иначе 
								ПоказатьПредупреждение(,"სტრიქონში N: " + НоваяСтрока.НомерСтроки + " ნომეკლატურა ' " + НоваяСтрока.Номенклатура + "' აგროვებულია!");
								Продолжить;
							КонецЕсли;
						Иначе 
							
							ИнтервалОтклоненияМин  = НоваяСтрока.Количество - (НоваяСтрока.Количество * ОтклонениеПроцент/100);
							ИнтервалОтклоненияМакс = НоваяСтрока.Количество + (НоваяСтрока.Количество * ОтклонениеПроцент/100);
							Если НоваяСтрока.КоличествоСобр + ТекШтрихкод.Количество <= ИнтервалОтклоненияМакс Тогда 
								//++ONESOFT-3137
								Если ФункционалИзменитьЛогикуСобранияЗапасов Тогда 
									НоваяСтрока.КоличествоСобр = ТекШтрихкод.Количество;
								Иначе 
								//++ONESOFT-3137
									НоваяСтрока.КоличествоСобр = НоваяСтрока.КоличествоСобр + ТекШтрихкод.Количество; 
								КонецЕсли;
								Если НоваяСтрока.КоличествоСобр >= ИнтервалОтклоненияМин и НоваяСтрока.КоличествоСобр <=  ИнтервалОтклоненияМакс тогда
									НоваяСтрока.ОК = Истина;
								КонецЕсли; 
								
							Иначе 
								ПоказатьПредупреждение(,"სტრიქონში N: " + НоваяСтрока.НомерСтроки + " ნომეკლატურა ' " + НоваяСтрока.Номенклатура + "' აგროვებულია!");
								Продолжить;
							КонецЕсли;

							
						КонецЕсли;				
						
					Иначе 	
						//++ONESOFT-3137
						Если ФункционалИзменитьЛогикуСобранияЗапасов Тогда 
							НоваяСтрока.КоличествоСобр = ТекШтрихкод.Количество; 
						Иначе  
						//++ONESOFT-3137
							НоваяСтрока.КоличествоСобр = НоваяСтрока.КоличествоСобр + ТекШтрихкод.Количество;  
						КонецЕсли;
						Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();		
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		
			
			Если ДанныеШтрихкода.Свойство("СерийныйНомер") И ЗначениеЗаполнено(ДанныеШтрихкода.СерийныйНомер) Тогда
				РаботаССерийнымиНомерамиКлиентСервер.ДобавитьСерийныйНомерВСтроку(НоваяСтрока, ДанныеШтрихкода.СерийныйНомер, Объект);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа",НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа);
КонецФункции // ЗаполнитьПоДаннымШтрихкодов()

&Насервере
Функция НужнаПроверит(Номенклатура)
	
	Возврат Номенклатура.НужнаПроверит;
	
КонецФункции

&Насервере
Функция ПолучитьОтклонение(Номенклатура)
	
	Возврат Номенклатура.Отклонение;
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗначРеквизитаТзМатериалы(ТекущиеДанные);
	
	Если НужнаПроверит(ТекущиеДанные.Номенклатура) Тогда
		
		//Если ТекущиеДанные.КоличествоСобр = 0 Тогда 
		//	ТекущиеДанные.ОК = Истина;		
		//	Возврат;
		//КонецЕсли;
		
		ОтклонениеПроцент = ПолучитьОтклонение(ТекущиеДанные.Номенклатура);
		
		Если ОтклонениеПроцент = 0 Тогда 
			Если ТекущиеДанные.Количество = ТекущиеДанные.КоличествоСобр Тогда 
				ТекущиеДанные.ОК = Истина;
			Иначе 
				ТекущиеДанные.ОК = Ложь;
			КонецЕсли;		
		Иначе 
			
			ИнтервалОтклоненияМин  = ТекущиеДанные.Количество - (ТекущиеДанные.Количество * ОтклонениеПроцент/100);
			ИнтервалОтклоненияМакс = ТекущиеДанные.Количество + (ТекущиеДанные.Количество * ОтклонениеПроцент/100);
			
			Если ТекущиеДанные.КоличествоСобр >= ИнтервалОтклоненияМин и ТекущиеДанные.КоличествоСобр <=  ИнтервалОтклоненияМакс тогда
				ТекущиеДанные.ОК = Истина;
			Иначе 
				ТекущиеДанные.ОК = Ложь;
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьСобраниеЗапасовВДокументеПередЗаписью();
	
	Отказ = Ложь;
	
	Для Каждого Ст из Объект.Запасы Цикл 
		
		Если Ст.Номенклатура.НужнаПроверит Тогда 
			
			ОтклонениеПроцент = ПолучитьОтклонение(Ст.Номенклатура);
			
			Если ОтклонениеПроцент = 0 Тогда 
				Если Ст.Количество = Ст.КоличествоСобр Тогда 
					Отказ = Ложь;
				Иначе 
					Отказ = Истина;
					Возврат Отказ;
				КонецЕсли;		
			Иначе 	
				ИнтервалОтклоненияМин  = Ст.Количество - (Ст.Количество * ОтклонениеПроцент/100);
				ИнтервалОтклоненияМакс = Ст.Количество + (Ст.Количество * ОтклонениеПроцент/100);
				
				Если Ст.КоличествоСобр >= ИнтервалОтклоненияМин и Ст.КоличествоСобр <=  ИнтервалОтклоненияМакс тогда
					Отказ = Ложь;
				Иначе 
					Отказ = Истина;
					Возврат Отказ;
				КонецЕсли;			
			КонецЕсли;		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Процедура ПолученыШтрихкоды(ДанныеШтрикодов) Экспорт
	
	Модифицированность = Истина;
	
	НедобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрикодов);
	НеизвестныеШтрихкоды		= НедобавленныеШтрихкоды.НеизвестныеШтрихкоды;
	ШтрихкодыНекорректногоТипа	= НедобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
	
	ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	
	Если НеизвестныеШтрихкоды.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПолученыШтрихкодыЗавершение", ЭтотОбъект, НеизвестныеШтрихкоды);
		
		ОткрытьФорму(
			"РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры",
			Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды), ЭтотОбъект,,,,Оповещение
		);
		
		Возврат;
		
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры // ПолученыШтрихкоды()

&НаКлиенте
Процедура ПолученыШтрихкодыЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт
	
	НеизвестныеШтрихкоды = Параметры;
	
	Если ВозвращаемыеПараметры <> Неопределено Тогда
		
		МассивШтрихкодов = Новый Массив;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ЗарегистрированныеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ПолученыНовыеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		НедобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(МассивШтрихкодов);
		НеизвестныеШтрихкоды		= НедобавленныеШтрихкоды.НеизвестныеШтрихкоды;
		ШтрихкодыНекорректногоТипа	= НедобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
		ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды) Экспорт
	
	Для каждого ТекНеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
		
		СтрокаСообщения = НСтр("ka='მონაცემები შტრიხკოდის მიხედვით ნაპოვნი არ არის: %1%; რაოდენობა: %2%';ru='Данные по штрихкоду не найдены: %1%; количество: %2%';en='Data on the barcode is not found:% 1%; amount% 2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНеизвестныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНеизвестныйШтрихкод.Количество);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа) Экспорт
	
	Для каждого ТекНекорректныйШтрихкод Из ШтрихкодыНекорректногоТипа Цикл
		
		СтрокаСообщения = НСтр("ka='შტრიხკოდ %1%-ით მოძებნილ ნომენკლატურას -%2%- აქვს ტიპი %3%, რომელიც ამ ცხრილის შესაფერი არ არის';ru='Найденная по штрихкоду %1% номенклатура -%2%- имеет тип %3%, который не подходит для этой табличной части';en='Found by barcode nomenclature% 1% -% 2% - 3% of type%, which is not suitable for this table part'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНекорректныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНекорректныйШтрихкод.Номенклатура);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", ТекНекорректныйШтрихкод.ТипНоменклатуры);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

// Конец ПодключаемоеОборудование

// Процедура заполняет колонку Резерв по резервам под заказ.
//
&НаСервере
Процедура ЗаполнитьКолонкуРезервПоРезервамНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьКолонкуРезервПоРезервам();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры // ЗаполнитьКолонкуРезервПоРезервамНаСервере()

#КонецОбласти

#Область РаботаСПодбором

// Процедура - обработчик события Действие команды Подбор
//
&НаКлиенте
Процедура Подбор(Команда)
	
	ИмяТабличнойЧасти 	= "Запасы";
	МаркерПодбора = "Запасы";
	
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("Период", 		Объект.Дата);
	ПараметрыПодбора.Вставить("Организация", 	Компания);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСборкаЗапасов.Сборка") Тогда
		ПараметрыПодбора.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиницаЗапасов);
	Иначе
		ПараметрыПодбора.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиницаПродукции);
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("ИспользуютсяСпецификации", Истина);
	ПараметрыПодбора.Вставить("ИспользуетсяРезервирование", ИспользуетсяРезервирование);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСборкаЗапасов.Сборка") Тогда
		ПараметрыПодбора.Вставить("ЭтоПриходныйДокумент", Ложь);
		ПараметрыПодбора.Вставить("ДоступноРедактированиеСтруктурнойЕдиницы", Истина);
	Иначе
		ПараметрыПодбора.Вставить("ЭтоПриходныйДокумент", Истина);
		ПараметрыПодбора.Вставить("ДоступноРедактированиеСтруктурнойЕдиницы", Ложь);
	КонецЕсли;
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("ТипНоменклатуры", ТипНоменклатуры);
	
	СтатусПартии = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Партия"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.Статус" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					СтатусПартии.Добавить(ЭлементФиксМассива);
				КонецЦикла;
			Иначе
				СтатусПартии.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПодбора.Вставить("СтатусПартии", СтатусПартии);
	
	ПараметрыПодбора.Вставить("УникальныйИдентификаторФормыВладельца", УникальныйИдентификатор);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбора", ПараметрыПодбора, ЭтотОбъект);
	
КонецПроцедуры // Подбор()

// Процедура - обработчик события Действие команды Подбор ТЧ Продукция.
//
&НаКлиенте
Процедура ПодборПродукция(Команда)
	
	ИмяТабличнойЧасти = "Продукция";
	МаркерПодбора = "Продукция";
	
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("Период", 		Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",	Компания);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСборкаЗапасов.Сборка") Тогда
		ПараметрыПодбора.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиницаПродукции);
	Иначе
		ПараметрыПодбора.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиницаЗапасов);
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("ИспользуютсяСпецификации", Истина);
	ПараметрыПодбора.Вставить("ИспользуетсяРезервирование", ИспользуетсяРезервирование);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСборкаЗапасов.Сборка") Тогда
		ПараметрыПодбора.Вставить("ЭтоПриходныйДокумент", Истина);
		ПараметрыПодбора.Вставить("ДоступноРедактированиеСтруктурнойЕдиницы", Ложь);
	Иначе
		ПараметрыПодбора.Вставить("ЭтоПриходныйДокумент", Ложь);
		ПараметрыПодбора.Вставить("ДоступноРедактированиеСтруктурнойЕдиницы", Истина);
	КонецЕсли;
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла;
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("ТипНоменклатуры", ТипНоменклатуры);
	
	СтатусПартии = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Партия"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.Статус" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					СтатусПартии.Добавить(ЭлементФиксМассива);
				КонецЦикла;
			Иначе
				СтатусПартии.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПодбора.Вставить("СтатусПартии", СтатусПартии);
	
	ПараметрыПодбора.Вставить("УникальныйИдентификаторФормыВладельца", УникальныйИдентификатор);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбора", ПараметрыПодбора, ЭтотОбъект);
	
КонецПроцедуры // ПодборПродукция()

// Процедура - обработчик события Действие команды Подбор
//
&НаКлиенте
Процедура ОтходыПодбор(Команда)
	
	ИмяТабличнойЧасти 	= "Отходы";
	МаркерПодбора = "Отходы";
	
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("Период", 				Объект.Дата);
	ПараметрыПодбора.Вставить("Организация", 			Компания);
	ПараметрыПодбора.Вставить("ЭтоПриходныйДокумент",	Истина);
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("ТипНоменклатуры", ТипНоменклатуры);
	
	СтатусПартии = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Партия"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.Статус" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					СтатусПартии.Добавить(ЭлементФиксМассива);
				КонецЦикла;
			Иначе
				СтатусПартии.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПодбора.Вставить("СтатусПартии", СтатусПартии);
	
	ПараметрыПодбора.Вставить("УникальныйИдентификаторФормыВладельца", УникальныйИдентификатор);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбора", ПараметрыПодбора, ЭтотОбъект);
	
КонецПроцедуры // ПодборВыполнить()

// Функция получает список товаров из временного хранилища
//
&НаСервере
Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьХарактеристики, ЕстьПартии)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		НоваяСтрока = Объект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
		
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

// ПодключаемоеОборудование
// Процедура - обработчик команды командной панели табличной части.
//
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ТекШтрихкод = "";
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект, Новый Структура("ТекШтрихкод", ТекШтрихкод)), ТекШтрихкод, НСтр("ka='შეიყვანეთ შტრიხკოდი';ru='Введите штрихкод';en='enter the barcode'"));

КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ТекШтрихкод = ?(Результат = Неопределено, ДополнительныеПараметры.ТекШтрихкод, Результат);
    
    
    Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
        ПолученыШтрихкоды(Новый Структура("Штрихкод, Количество, ДоляСтоимости", ТекШтрихкод, 1, 1));
    КонецЕсли;

КонецПроцедуры // ПоискПоШтрихкоду()

// Процедура - обработчик события Действие команды ПолучитьВес
//
&НаКлиенте
Процедура ПолучитьВес(Команда)
	
	ПодключаемоеОборудованиеУНФКлиент.ПолучениеВесаСЭлектронныхВесовДляТабличнойЧасти(ЭтотОбъект, "Запасы", Ложь);
	
КонецПроцедуры // ПолучитьВес()

// Процедура - обработчик команды ЗагрузитьДанныеИзТСД.
//
&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ПодключаемоеОборудованиеУНФКлиент.ПолучитьДанныеИзТСД(ЭтотОбъект);
	
КонецПроцедуры // ЗагрузитьДанныеИзТСД()

// Конец ПодключаемоеОборудование

#КонецОбласти

#Область УправлениеВнешнимВидомФормы

// Процедура устанавливает доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	ЭтоРазборка	= (Объект.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Разборка);
	ЭтоСборка	= (Объект.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка);
	
	Если ЭтоРазборка Тогда
		
		// Резерв.
		Элементы.ЗапасыРезерв.Видимость = Ложь;
		ИспользуетсяРезервирование = Ложь;
		Элементы.ЗапасыИзменитьРезерв.Видимость = Ложь;
		Элементы.ПродукцияРезерв.Видимость = ЗначениеЗаполнено(Объект.ЗаказПокупателя);
		Элементы.ЗапасыДоляСтоимости.Видимость = Истина;
		
		// Статус партии.
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(Перечисления.СтатусыПартий.СобственныеЗапасы);
		НовыйМассив.Добавить(Перечисления.СтатусыПартий.ДавальческоеСырье);
		МассивЗапасРабота = Новый ФиксированныйМассив(НовыйМассив);
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Статус", МассивЗапасРабота);
		НовыйПараметр2 = Новый ПараметрВыбора("Дополнительно.ОграничениеСтатуса", МассивЗапасРабота);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыйМассив.Добавить(НовыйПараметр2);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.ПродукцияПартия.ПараметрыВыбора = НовыеПараметры;
		
		Элементы.ГруппаСкладПродукцияСборка.Видимость = Ложь;
		Элементы.ГруппаСкладПродукцияРазборка.Видимость = Истина;
		
		Элементы.ГруппаСкладЗапасыСборка.Видимость = Ложь;
		Элементы.ГруппаСкладЗапасыРазборка.Видимость = Истина;
		
		Элементы.ПродукцияСрокГодности.Видимость = Ложь;
		Элементы.ЗапасыСрокГодности.Видимость = Истина;

		
	Иначе
		
		// Резерв.
		Элементы.ЗапасыРезерв.Видимость = ЗначениеЗаполнено(Объект.ЗаказПокупателя);
		ИспользуетсяРезервирование = ЗначениеЗаполнено(Объект.ЗаказПокупателя);
		Элементы.ЗапасыИзменитьРезерв.Видимость = ЗначениеЗаполнено(Объект.ЗаказПокупателя);
		Элементы.ПродукцияРезерв.Видимость = Ложь;
		Элементы.ЗапасыДоляСтоимости.Видимость = Ложь;
		
		// Статус партии.
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Статус", Перечисления.СтатусыПартий.СобственныеЗапасы);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.ПродукцияПартия.ПараметрыВыбора = НовыеПараметры;
		
		Для каждого СтрокаПродукция Из Объект.Продукция Цикл
			
			Если ЗначениеЗаполнено(СтрокаПродукция.Партия)
				И СтрокаПродукция.Партия.Статус = Перечисления.СтатусыПартий.ДавальческоеСырье Тогда
				СтрокаПродукция.Партия = Неопределено;
			КонецЕсли;
			
		КонецЦикла;
		
		Элементы.ГруппаСкладПродукцияСборка.Видимость = Истина;
		Элементы.ГруппаСкладПродукцияРазборка.Видимость = Ложь;
		
		Элементы.ГруппаСкладЗапасыСборка.Видимость = Истина;
		Элементы.ГруппаСкладЗапасыРазборка.Видимость = Ложь;	
		Элементы.ЗапасыСрокГодности.Видимость = Ложь;
		Элементы.ПродукцияСрокГодности.Видимость = Истина;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПродукцияСтранаПроисхождения",	"Видимость", ЭтоРазборка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПродукцияНомерГТД",				"Видимость", ЭтоРазборка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыСтранаПроисхождения",		"Видимость", ЭтоСборка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыНомерГТД", 				"Видимость", ЭтоСборка);
	
	//++Lazare 13.12.2022
	ФункционалВидимостиСвободногоОстаткаЗапасовВВокументах = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалВидимостиСвободногоОстаткаЗапасовВВокументах");
	Элементы.ПродукцияКоличествоНаСкладе.Видимость = ФункционалВидимостиСвободногоОстаткаЗапасовВВокументах;
	Элементы.ЗапасыКоличествоНаСкладе.Видимость    = ФункционалВидимостиСвободногоОстаткаЗапасовВВокументах;
	//--Lazare 13.12.2022
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

// Процедура устанавливает режим выбора и список выбора для элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьРежимИСписокВыбора()
	
	Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница)
		ИЛИ Объект.СтруктурнаяЕдиница.ОрдерныйСклад Тогда
		Элементы.Ячейка.Доступность = Ложь;
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаПродукции)
		ИЛИ Объект.СтруктурнаяЕдиницаПродукции.ОрдерныйСклад Тогда
		Элементы.ЯчейкаПродукцииСборка.Доступность = Ложь;
		Элементы.ЯчейкаЗапасовРазборка.Доступность = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаЗапасов)
		ИЛИ Объект.СтруктурнаяЕдиницаЗапасов.ОрдерныйСклад Тогда
		Элементы.ЯчейкаЗапасовСборка.Доступность = Ложь;
		Элементы.ЯчейкаПродукцииРазборка.Доступность = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиницаОтходов)
		ИЛИ Объект.СтруктурнаяЕдиницаОтходов.ОрдерныйСклад Тогда
		Элементы.ЯчейкаОтходов.Доступность = Ложь;
	КонецЕсли;
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить()
		И НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимСкладам.Получить() Тогда
		
		Элементы.СтруктурнаяЕдиница.РежимВыбораИзСписка = Истина;
		Элементы.СтруктурнаяЕдиница.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
		Элементы.СтруктурнаяЕдиница.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
		
		Элементы.СтруктурнаяЕдиницаПродукцииСборка.РежимВыбораИзСписка = Истина;
		Элементы.СтруктурнаяЕдиницаПродукцииСборка.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
		Элементы.СтруктурнаяЕдиницаПродукцииСборка.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
		
		Элементы.СтруктурнаяЕдиницаПродукцииРазборка.РежимВыбораИзСписка = Истина;
		Элементы.СтруктурнаяЕдиницаПродукцииРазборка.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
		Элементы.СтруктурнаяЕдиницаПродукцииРазборка.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
		
		Элементы.СтруктурнаяЕдиницаЗапасовСборка.РежимВыбораИзСписка = Истина;
		Элементы.СтруктурнаяЕдиницаЗапасовСборка.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
		Элементы.СтруктурнаяЕдиницаЗапасовСборка.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
		
		Элементы.СтруктурнаяЕдиницаЗапасовРазборка.РежимВыбораИзСписка = Истина;
		Элементы.СтруктурнаяЕдиницаЗапасовРазборка.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
		Элементы.СтруктурнаяЕдиницаЗапасовРазборка.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
		
		Элементы.СтруктурнаяЕдиницаОтходов.РежимВыбораИзСписка = Истина;
		Элементы.СтруктурнаяЕдиницаОтходов.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
		Элементы.СтруктурнаяЕдиницаОтходов.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьРежимИСписокВыбора()

#КонецОбласти

#Область ЗаполнениеОбъектов

&НаКлиенте
Процедура СохранитьДокументКакШаблон(Параметр) Экспорт
	
	ЗаполнениеОбъектовУНФКлиент.СохранитьДокументКакШаблон(Объект, ОтображаемыеРеквизиты(), Параметр);
	
КонецПроцедуры

&НаСервере
Функция ОтображаемыеРеквизиты()
	
	Возврат ЗаполнениеОбъектовУНФ.ОтображаемыеРеквизиты(ЭтотОбъект);
	
КонецФункции

#КонецОбласти

#Область КопированиеСтрокТабличныхЧастей

// Процедура - обработчик нажатия кнопки Копировать строки в ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыКопироватьСтроки(Команда)
	
	КопироватьСтроки("Запасы");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Вставить строки в ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыВставитьСтроки(Команда)
	
	ВставитьСтроки("Запасы");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Копировать строки в ТЧ Продукция.
//
&НаКлиенте
Процедура ПродукцияКопироватьСтроки(Команда)
	
	КопироватьСтроки("Продукция");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Вставить строки в ТЧ Продукция.
//
&НаКлиенте
Процедура ПродукцияВставитьСтроки(Команда)
	
	ВставитьСтроки("Продукция");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтходыКопироватьСтроки(Команда)
	
	КопироватьСтроки("Отходы");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Вставить строки в ТЧ Отходы.
//
&НаКлиенте
Процедура ОтходыВставитьСтроки(Команда)
	
	ВставитьСтроки("Отходы");
	
КонецПроцедуры

// Вызывает процедуру копирования строк и оповещает пользователя о количестве скопированных.
//
&НаКлиенте
Процедура КопироватьСтроки(ИмяТЧ)
	
	Если КопированиеТабличнойЧастиКлиент.МожноКопироватьСтроки(Объект[ИмяТЧ], Элементы[ИмяТЧ].ТекущиеДанные) Тогда
		КоличествоСкопированных = 0;
		КопироватьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных);
		КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОКопированииСтрок(КоличествоСкопированных);
	КонецЕсли;
	
КонецПроцедуры

// Вызывает процедуру вставки строк и оповещает пользователя о количетсве вставленных.
//
&НаКлиенте
Процедура ВставитьСтроки(ИмяТЧ)
	
	КоличествоСкопированных = 0;
	КоличествоВставленных = 0;
	ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных);
	КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоСкопированных, КоличествоВставленных);
	
КонецПроцедуры

// Выполняет копирование выделенных строк в буфер обмена.
//
&НаСервере
Процедура КопироватьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных)
	
	КопированиеТабличнойЧастиСервер.Копировать(Объект[ИмяТЧ], Элементы[ИмяТЧ].ВыделенныеСтроки, КоличествоСкопированных);
	
КонецПроцедуры

// Вставляет скопированные строки из буфера обмена в выбранную табличную часть.
//
&НаСервере
Процедура ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных)
	
	КопированиеТабличнойЧастиСервер.Вставить(Объект, ИмяТЧ, Элементы, КоличествоСкопированных, КоличествоВставленных);
	ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных);
	
КонецПроцедуры

// Обрабатывает вставленные строки.
//
&НаСервере
Процедура ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных)
	
	Количество = Объект[ИмяТЧ].Количество();
	Для Итератор = 1 По КоличествоВставленных Цикл
		Строка = Объект[ИмяТЧ][Количество - Итератор];
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
		СтруктураДанные.Вставить("Характеристика", Строка.Характеристика);
		
		СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		
		Если ИмяТЧ = "Продукция" ИЛИ ИмяТЧ = "Запасы" Тогда
			Если НЕ ЗначениеЗаполнено(Строка.Спецификация) Тогда
				Строка.Спецификация = СтруктураДанные.Спецификация;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.ЕдиницаИзмерения) Тогда
			Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаССерийнымиНомерами

&НаКлиенте
Процедура ЗапасыСерийныеНомераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерийныеНомера("Запасы", "СерийныеНомера");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерийныеНомера(ИмяТЧЗапасы, ИмяТЧСерийныеНомера)
		
	ТекущиеДанныеИдентификатор = Элементы[ИмяТЧЗапасы].ТекущиеДанные.ПолучитьИдентификатор();
	ПараметрыСерийныхНомеров = ПараметрыПодбораСерийныхНомеров(ТекущиеДанныеИдентификатор, ИмяТЧЗапасы, ИмяТЧСерийныеНомера);
	// Для подбора СН используем поле СтруктурнаяЕдиницаЗапасов
	ПараметрыСерийныхНомеров.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиницаЗапасов);
	ПараметрыСерийныхНомеров.Вставить("Ячейка", Объект.ЯчейкаЗапасов);
	ОткрытьФорму("Обработка.ПодборСерийныхНомеров.Форма", ПараметрыСерийныхНомеров, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСерийныеНомераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерийныеНомера("Продукция","СерийныеНомераПродукция");
	
КонецПроцедуры

Функция ПолучитьСерийныеНомераЗапасыИзХранилища(АдресВоВременномХранилище, КлючСтроки)
	
	ПараметрыИменаПолей = Новый Структура;
	ПараметрыИменаПолей.Вставить("ИмяТЧЗапасы", "Запасы");
	ПараметрыИменаПолей.Вставить("ИмяТЧСерийныеНомера", "СерийныеНомера");
	
	Возврат РаботаСФормойДокумента.ПолучитьСерийныеНомераИзХранилища(Объект, АдресВоВременномХранилище, КлючСтроки, ПараметрыИменаПолей);
	
КонецФункции

Функция ПолучитьСерийныеНомераПродукцииИзХранилища(АдресВоВременномХранилище, КлючСтроки)
	
	ПараметрыИменаПолей = Новый Структура;
	ПараметрыИменаПолей.Вставить("ИмяТЧЗапасы", "Продукция");
	ПараметрыИменаПолей.Вставить("ИмяТЧСерийныеНомера", "СерийныеНомераПродукция");
	
	Возврат РаботаСФормойДокумента.ПолучитьСерийныеНомераИзХранилища(Объект, АдресВоВременномХранилище, КлючСтроки, ПараметрыИменаПолей);
	
КонецФункции

Функция ПараметрыПодбораСерийныхНомеров(ТекущиеДанныеИдентификатор, ИмяТЧ, ИмяТЧСерийныеНомера)
	
	Если ИмяТЧ = "Запасы" И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСборкаЗапасов.Сборка") Тогда
	    РежимПодбора = Истина;
	ИначеЕсли ИмяТЧ = "Продукция" И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСборкаЗапасов.Разборка") Тогда
		РежимПодбора = Истина;
	Иначе
		РежимПодбора = Ложь;
	КонецЕсли;
	
	Возврат РаботаСФормойДокумента.ПараметрыПодбораСерийныхНомеров(Объект, ЭтотОбъект.УникальныйИдентификатор, ТекущиеДанныеИдентификатор, РежимПодбора, ИмяТЧ, ИмяТЧСерийныеНомера);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

//+++ Дмгг
&НаСервере
Процедура ПеремещениеПродукцияНаСервере(ДанныеФормы, МассивВыделеныхСтрок)
	
	МассивОставляемыхСтрок = Новый Массив;
	
	Для Каждого ИдентефикаторСТроки Из МассивВыделеныхСтрок Цикл 
		МассивОставляемыхСтрок.Добавить(Объект.Продукция.НайтиПоИдентификатору(ИдентефикаторСТроки));
	КонецЦикла;
	
	тзОставляемыхСтрок = Объект.Продукция.Выгрузить(МассивОставляемыхСтрок);
	
	Док = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ПеремещениеЗапасов")); // Получаем объект из данных формы ИЛИ
	
	Док = Документы.ПеремещениеЗапасов.СоздатьДокумент();
	
	ЗаполнитьПоСборкеЗапасовСборка(Док);//Док.Заполнить(Объект.Ссылка);
	
	МассивУдаляемыхСтрок = Новый Массив;
	Для Каждого СтрокПроизводства Из Док.Запасы Цикл 
		
		МассивНайденныхСтрок = тзОставляемыхСтрок.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Количество, ЕдиницаИзмерения", СтрокПроизводства.Номенклатура, СтрокПроизводства.Характеристика, СтрокПроизводства.Количество, СтрокПроизводства.ЕдиницаИзмерения));
		
		Если МассивНайденныхСтрок.Количество() = 0 Тогда 
			МассивУдаляемыхСтрок.Добавить(СтрокПроизводства);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокУдаления Из МассивУдаляемыхСтрок Цикл 
		
		Док.Запасы.Удалить(СтрокУдаления);
		
	КонецЦикла;
	// Kuzmich, 16.12.2019
	ДанныеФормы.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение");
	НастройкиПользователейОтбор = Новый Структура("Пользователь,Настройка", Объект.Автор,ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойСклад);
	ДанныеФормы.СтруктурнаяЕдиница = РегистрыСведений.НастройкиПользователей.Получить(НастройкиПользователейОтбор);
	// Kuzmich, 16.12.2019
	ЗначениеВДанныеФормы(Док,ДанныеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеПродукция(Команда)
	
	МассивВыделеныхСтрок = Элементы.Продукция.ВыделенныеСтроки;
	
	Форма = ПолучитьФорму("Документ.ПеремещениеЗапасов.ФормаОбъекта");
	ДанныеФормы = Форма.Объект; 
	ПеремещениеПродукцияНаСервере(ДанныеФормы, МассивВыделеныхСтрок); 
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); 
	Форма.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПеремещениеЗапасыНаСервере(ДанныеФормы, МассивВыделеныхСтрок)
		
	МассивОставляемыхСтрок = Новый Массив;
	
	Для Каждого ИдентефикаторСТроки Из МассивВыделеныхСтрок Цикл 
		МассивОставляемыхСтрок.Добавить(Объект.Запасы.НайтиПоИдентификатору(ИдентефикаторСТроки));
	КонецЦикла;
	
	тзОставляемыхСтрок = Объект.Запасы.Выгрузить(МассивОставляемыхСтрок);
	
	Док = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ПеремещениеЗапасов")); // Получаем объект из данных формы ИЛИ
	
	Док = Документы.ПеремещениеЗапасов.СоздатьДокумент();
	
	ЗаполнитьПоСборкеЗапасовРазборка(Док);//Док.Заполнить(Объект.Ссылка);
	
	//МассивУдаляемыхСтрок = Новый Массив;
	//Для Каждого СтрокПроизводства Из Док.Запасы Цикл 
	//	
	//	//МассивНайденныхСтрок = тзОставляемыхСтрок.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Количество, ЕдиницаИзмерения", СтрокПроизводства.Номенклатура, СтрокПроизводства.Характеристика, СтрокПроизводства.Количество, СтрокПроизводства.ЕдиницаИзмерения));
	//	МассивНайденныхСтрок = тзОставляемыхСтрок.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ЕдиницаИзмерения", СтрокПроизводства.Номенклатура, СтрокПроизводства.Характеристика, СтрокПроизводства.ЕдиницаИзмерения)); // Kuzmich, 16.12.2019
	//	
	//	Если МассивНайденныхСтрок.Количество() = 0 Тогда 
	//		МассивУдаляемыхСтрок.Добавить(СтрокПроизводства);
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//Для Каждого СтрокУдаления Из МассивУдаляемыхСтрок Цикл 
	//	
	//	Док.Запасы.Удалить(СтрокУдаления);
	//	
	//КонецЦикла;
	// Kuzmich, 16.12.2019
	Док.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение");
	
	Если ЗначениеЗаполнено(Объект.Автор) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь
		|	И НастройкиПользователей.Настройка = &Настройка";
		
		Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойСклад);
		Запрос.УстановитьПараметр("Пользователь", Объект.Автор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Док.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.Значение
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(Док.СтруктурнаяЕдиница) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастройкиПользователей.Значение
			|ИЗ
			|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
			|ГДЕ
			|	НастройкиПользователей.Пользователь = &Пользователь
			|	И НастройкиПользователей.Настройка = &Настройка";
			
			Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойСклад);
			Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Док.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.Значение
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Док.ДокументОснование = Объект.Ссылка;
	Док.Организация = Объект.Организация;
	// Kuzmich, 16.12.2019
	ЗначениеВДанныеФормы(Док,ДанныеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеЗапасы(Команда)
	// Kuzmich, 16.12.2019
	Если Объект.Ссылка.Пустая() ИЛИ ЭтаФорма.Модифицированность Тогда
		Контекст = НЕОПРЕДЕЛЕНО;
		
		ТекстВопроса = НСтр("ka='მონაცემები ჯერ არ არის ჩაწერილი. მოქმედება შესრულება შესაძლებელია მხოლოდ მონაცემთა ჩაწერის შემდეგ. მონაცემები ჩაიწერება.';ru='Данные еще не записаны."
		"Выполнение действия возможно только после записи данных."
		"Данные будут записаны.'");
		
		Обработчик = Новый ОписаниеОповещения("ПродолжитьВыполнениеПеремещениеЗапасы", ЭтотОбъект, Контекст);
		
		ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
		Возврат;
	КонецЕсли;
	// Kuzmich, 16.12.2019
	МассивВыделеныхСтрок = Элементы.Запасы.ВыделенныеСтроки;
	
	Форма = ПолучитьФорму("Документ.ПеремещениеЗапасов.ФормаОбъекта");
	ДанныеФормы = Форма.Объект; 
	ПеремещениеЗапасыНаСервере(ДанныеФормы, МассивВыделеныхСтрок); 
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); 
	Форма.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопкиПроизводства()

	ЗначениеВидивости = ПолучитьФункциональнуюОпцию("ФункциональнаяОпцияДополнительныеФункцииПроизводства");
	
	Элементы.ЗапасыПеремещениеЗапасы.Видимость = ЗначениеВидивости;
	Элементы.ПродукцияПеремещениеПродукция.Видимость = ЗначениеВидивости;
	Элементы.ЗапасыЗаполнитьПоОстаткам.Видимость = ЗначениеВидивости;

	Элементы.ПродукцияЗаполнитьПоОстаткамПродукция.Видимость = (ЗначениеВидивости И Объект.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Разборка); // Kuzmich, 18.12.2019
	
КонецПроцедуры

Процедура ЗаполнитьПоСборкеЗапасовСборка(ДокПеремещения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СборкаЗапасов.Ссылка КАК ДокументОснование,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение) КАК ВидОперации,
	|	СборкаЗапасов.Организация КАК Организация,
	|	СборкаЗапасов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СборкаЗапасов.СтруктурнаяЕдиницаПродукции КАК СтруктурнаяЕдиница,
	|	СборкаЗапасов.ЯчейкаПродукции КАК Ячейка,
	|	ВЫБОР
	|		КОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|			ТОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	КОНЕЦ КАК СтруктурнаяЕдиницаПолучатель,
	|	ВЫБОР
	|		КОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|			ТОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ЯчейкаПолучателяПеремещения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
	|	КОНЕЦ КАК ЯчейкаПолучатель,
	|	СборкаЗапасов.Продукция.(
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		Партия КАК Партия,
	|		Ссылка.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		ВЫБОР
	|			КОГДА СборкаЗапасов.Продукция.Ссылка.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				ТОГДА 0
	|			ИНАЧЕ СборкаЗапасов.Продукция.Количество
	|		КОНЕЦ КАК Резерв,
	|		СерийныеНомера,
	|		КлючСвязи
	|	)
	|ИЗ
	|	Документ.СборкаЗапасов КАК СборкаЗапасов
	|ГДЕ
	|	СборкаЗапасов.Ссылка = &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	ДокПеремещения.Запасы.Очистить();
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаИзРезультатаЗапроса.Следующий();
		
		ЗаполнитьЗначенияСвойств(ДокПеремещения, ВыборкаИзРезультатаЗапроса);
		
		ВыборкаПродукция = ВыборкаИзРезультатаЗапроса.Продукция.Выбрать();
		Пока ВыборкаПродукция.Следующий() Цикл
			НоваяСтрока = ДокПеремещения.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПродукция);
		КонецЦикла;
		
		РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ДокПеремещения, Объект.Ссылка, "Продукция", "СерийныеНомераПродукция");
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоСборкеЗапасовРазборка(ДокПеремещения)
	
	ТЗ_ТоваровПеремещенийЗапасовСозданныхНаОсновании = ПолучитьТаблицуТоваровПеремещенийЗапасовСозданныхНаОсновании(); // Kuzmich, 16.12.2019
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СборкаЗапасов.Ссылка КАК ДокументОснование,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение) КАК ВидОперации,
	|	СборкаЗапасов.Организация КАК Организация,
	|	СборкаЗапасов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СборкаЗапасов.СтруктурнаяЕдиницаПродукции КАК СтруктурнаяЕдиница,
	|	СборкаЗапасов.ЯчейкаПродукции КАК Ячейка,
	|	ВЫБОР
	|		КОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|			ТОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	КОНЕЦ КАК СтруктурнаяЕдиницаПолучатель,
	|	ВЫБОР
	|		КОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ПолучательПеремещения.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
	|			ТОГДА СборкаЗапасов.СтруктурнаяЕдиницаПродукции.ЯчейкаПолучателяПеремещения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
	|	КОНЕЦ КАК ЯчейкаПолучатель,
	|	СборкаЗапасов.Запасы.(
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		Партия КАК Партия,
	|		Количество КАК Количество,
	|		ВЫБОР
	|			КОГДА СборкаЗапасов.Запасы.Ссылка.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				ТОГДА 0
	|			ИНАЧЕ СборкаЗапасов.Запасы.Количество
	|		КОНЕЦ КАК Резерв,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Ссылка.ЗаказПокупателя КАК ЗаказПокупателя,
	|		СерийныеНомера,
	|		КлючСвязи
	|	)
	|ИЗ
	|	Документ.СборкаЗапасов КАК СборкаЗапасов
	|ГДЕ
	|	СборкаЗапасов.Ссылка = &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	ДокПеремещения.Запасы.Очистить();
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаИзРезультатаЗапроса.Следующий();
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаИзРезультатаЗапроса);
		
		ВыборкаЗапасы = ВыборкаИзРезультатаЗапроса.Запасы.Выбрать();
		Пока ВыборкаЗапасы.Следующий() Цикл
			
			// Kuzmich, 16.12.2019
			КоличествоУжеПеремещенных=0;
			МассивТоваровПеремещенийЗапасовСозданныхНаОсновании = ТЗ_ТоваровПеремещенийЗапасовСозданныхНаОсновании.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Партия, ЕдиницаИзмерения", ВыборкаЗапасы.Номенклатура, ВыборкаЗапасы.Характеристика, ВыборкаЗапасы.Партия, ВыборкаЗапасы.ЕдиницаИзмерения));
			Если МассивТоваровПеремещенийЗапасовСозданныхНаОсновании.Количество()>0 Тогда
				Для каждого СтрМассивТоваровПеремещенийЗапасовСозданныхНаОсновании Из МассивТоваровПеремещенийЗапасовСозданныхНаОсновании Цикл
					КоличествоУжеПеремещенных = КоличествоУжеПеремещенных + СтрМассивТоваровПеремещенийЗапасовСозданныхНаОсновании.Количество;
				КонецЦикла; 
			КонецЕсли;
			Если (ВыборкаЗапасы.Количество - КоличествоУжеПеремещенных)<=0 Тогда
				Продолжить;
			КонецЕсли;
			// Kuzmich, 16.12.2019
			
			НоваяСтрока = ДокПеремещения.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗапасы);
			
			//// Kuzmich, 16.12.2019
			//НоваяСтрока.Количество = НоваяСтрока.Количество - КоличествоУжеПеремещенных;
			//Если НоваяСтрока.Резерв>0 Тогда
			//	НоваяСтрока.Резерв = НоваяСтрока.Количество;
			//КонецЕсли;
			//// Kuzmich, 16.12.2019
			НоваяСтрока.Резерв = 0;
		КонецЦикла;
		
		РаботаССерийнымиНомерами.ЗаполнитьТЧСерийныеНомераПоКлючуСвязи(ДокПеремещения, Объект.Ссылка);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере(Это_ТЧ_Продукция=ЛОЖЬ)
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьТабличнуюЧастьПоОстаткам(Это_ТЧ_Продукция);
	ЗначениеВРеквизитФормы(Документ, "Объект");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	
	Если Объект.Запасы.Количество() <> 0 Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаЗаполнитьПоОстаткамЗавершение", ЭтотОбъект), НСтр("ka='ცხრილი ""მასალები"" გადაივსება! გავაგრძელოთ ოპერაციის შესრულება?';ru='Табличная часть ""Материалы"" будет перезаполнена! Продолжить выполнение операции?';en='A table of the ""Materials"" will be refilled! To continue the operation?'"), 
		РежимДиалогаВопрос.ДаНет, 0);
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьПоОстаткамНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоОстаткамЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	
	КомандаЗаполнитьПоОстаткамФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоОстаткамФрагмент(Это_ТЧ_Продукция=ЛОЖЬ)
	
	ЗаполнитьПоОстаткамНаСервере(Это_ТЧ_Продукция);
	
КонецПроцедуры
//--- Дмгг

// Kuzmich, 18.12.2019
&НаКлиенте
Процедура ПродолжитьВыполнениеПеремещениеЗапасы(Ответ, Контекст) Экспорт
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ОчиститьСообщения();
		ЭтаФорма.Записать();
		Если Объект.Ссылка.Пустая() ИЛИ ЭтаФорма.Модифицированность Тогда
			Возврат; // Запись не удалась, сообщения о причинах выводит платформа.
		КонецЕсли;
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	ПеремещениеЗапасы(ЭтаФорма.Команды.Найти("ПеремещениеЗапасы"));
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуТоваровПеремещенийЗапасовСозданныхНаОсновании()
	ПЕРЕМ РЕЗ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеЗапасовЗапасы.Номенклатура,
		|	ПеремещениеЗапасовЗапасы.Характеристика,
		|	ПеремещениеЗапасовЗапасы.Партия,
		|	ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения,
		|	СУММА(ПеремещениеЗапасовЗапасы.Количество) КАК Количество
		|ИЗ
		|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
		|ГДЕ
		|	ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование = &ДокументОснование
		|	И ПеремещениеЗапасовЗапасы.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеЗапасовЗапасы.Номенклатура,
		|	ПеремещениеЗапасовЗапасы.Характеристика,
		|	ПеремещениеЗапасовЗапасы.Партия,
		|	ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РЕЗ = РезультатЗапроса.Выгрузить();
	
	Возврат РЕЗ;
КонецФункции // ()

&НаКлиенте
Процедура ЗаполнитьПоОстаткамПродукция(Команда)
	
	Если Объект.Продукция.Количество() <> 0 Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаЗаполнитьПоОстаткамПродукцияЗавершение", ЭтотОбъект), НСтр("ka='ცხრილი ""პროდუქცია"" გადაივსება! გავაგრძელოთ ოპერაციის შესრულება?';ru='Табличная часть ""Продукция"" будет перезаполнена! Продолжить выполнение операции?';en='A table of the ""Products"" will be refilled! To continue the operation?'"), 
		РежимДиалогаВопрос.ДаНет, 0);
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьПоОстаткамНаСервере(ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоОстаткамПродукцияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	
	КомандаЗаполнитьПоОстаткамФрагмент(ИСТИНА);
	
КонецПроцедуры

// Kuzmich, 18.12.2019
#КонецОбласти



//+++Lazare 09.03.2021
// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	ТоварыДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаТовары = Объект.Запасы.Добавить();
		НоваяСтрокаТовары.Номенклатура = СтрокаТаблицы.Номенклатура;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
			
			НоваяСтрокаТовары.Характеристика = СтрокаТаблицы.Характеристика;
			
		КонецЕсли;
		
		//НоваяСтрокаТовары.Цена = СтрокаТаблицы.Цена;
		НоваяСтрокаТовары.Количество = СтрокаТаблицы.Количество;
		
		Если ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения") Тогда
			
			НоваяСтрокаТовары.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
			
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрокаТовары.Номенклатура) Тогда
			
			НоваяСтрокаТовары.ЕдиницаИзмерения = СтрокаТаблицы.Номенклатура.ЕдиницаИзмерения;
			
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(СтрокаТаблицы.СтавкаНДС) Тогда
		//	НоваяСтрокаТовары.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
		//Иначе
		//	НоваяСтрокаТовары.СтавкаНДС = СтрокаТаблицы.Номенклатура.СтавкаНДС;
		//КонецЕсли;
		
		ТоварыДобавлены = Истина;
		
	КонецЦикла;
	
	Если ТоварыДобавлены Тогда
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных);
	//
	//Для каждого СтрокаТаблицы Из Объект.Запасы Цикл 
	//	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТаблицы);
	//КонецЦикла;
	//
	//ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			ОбработатьПодготовленныеДанные(РезультатЗагрузки);
			
		КонецЕсли;
		
	Иначе
		
		ЗагрузитьИзФайлаЗавершение(РезультатЗагрузки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодготовленныеДанные(РезультатЗагрузки)
	
	Попытка
		
		НачатьТранзакцию();
		
		ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			Если ЗагрузкаВПриложениеВозможна Тогда
				
				НоваяСтрока = Объект.Запасы.Добавить();
				
				ИменаСвойств = "Номенклатура,Количество,ЕдиницаИзмерения,Резерв";
				Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
					
					ИменаСвойств = ИменаСвойств + ", Характеристика";
					
				КонецЕсли;
				
				Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
					
					ИменаСвойств = ИменаСвойств + ", Партия";
					
				КонецЕсли;
				//
				//Если ПолучитьФункциональнуюОпцию("УчетГТД") Тогда
				//	
				//	ИменаСвойств = ИменаСвойств + ", СтранаПроисхождения, НомерГТД";
				//	
				//КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				
				//НоваяСтрока.ТипНоменклатурыЗапас = (НоваяСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
				//НоваяСтрока.Цена = СтрокаТаблицы.Цена;
				ОбработатьТаблицуНаСервереВезИзм(НоваяСтрока);
				//НоваяСтрока.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;   ტესტ
				//НоваяСтрока.Сумма = НоваяСтрока.Цена * СтрокаТаблицы.Количество;
				
				//Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
				//	
				//	Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтавкаНДС) Тогда
				//		
				//		НоваяСтрока.СтавкаНДС = ?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура.СтавкаНДС), НоваяСтрока.Номенклатура.СтавкаНДС, Объект.Организация.СтавкаНДСПоУмолчанию);
				//		
				//	КонецЕсли;
				//	
				//	Если ЗначениеЗаполнено(СтрокаТаблицы.СуммаНДС) Тогда
				//		
				//		НоваяСтрока.СуммаНДС = СтрокаТаблицы.СуммаНДС;
				//		
				//	Иначе
				//		
				//		СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
				//		
				//		НоваяСтрока.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
				//			НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДС + 100) / 100),
				//			НоваяСтрока.Сумма * СтавкаНДС / 100);
				//		
				//	КонецЕсли;
				//	
				//Иначе
					
					//НоваяСтрока.СтавкаНДС = ?(Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС,
					//	УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС(),
					//	УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль());
					//
					//НоваяСтрока.СуммаНДС = 0;
				//	
				//КонецЕсли;
				
				//НоваяСтрока.Всего = НоваяСтрока.Сумма + ?(Объект.СуммаВключаетНДС, 0, НоваяСтрока.СуммаНДС);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ka='მონაცემების ჩატვირთვა';ru='Загрузка данных';en='Loading data'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Номенклатура, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуНаСервереВезИзм(Строка)
		
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", Строка.Характеристика);
	//СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	
	//Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
	//	
	//	СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
	//	СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	//	СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	//	СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
	//	СтруктураДанные.Вставить("Коэффициент", 1);
	//	СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
	//	
	//КонецЕсли;
	
	// ДисконтныеКарты
	//СтруктураДанные.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
	//СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);		
	// Конец ДисконтныеКарты
	
	//СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	//Если Строка.Цена = 0 Тогда
	//	Строка.Цена = СтруктураДанные.Цена;
	//КонецЕсли;
	//
	//Строка.НаименованиеДляРС = Строка(Строка.Номенклатура) + " " + Строка(Строка.Характеристика);
	
КонецПроцедуры
&НаКлиенте

Процедура ЗапасыЗагрузкаДанныхИзВнешнегоИсточника(Команда)
ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	НастройкиЗагрузкиДанных.Вставить("ИмяМакетаСШаблоном","ЗагрузкаИзФайла");
	НастройкиЗагрузкиДанных.Вставить("Заголовок", НСтр("ka='მარაგების ჩატვირთვა ფაილიდან';ru='Загрузка запасов из файла';en='Download the file from the reserves'"));
	НастройкиЗагрузкиДанных.Вставить("СодержаниеВидимо", Истина);
	//НастройкиЗагрузкиДанных.Вставить("ПоложениеЗаказаВДокументе", Объект.ПоложениеЗаказаПокупателя);
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяТабличнойЧасти", "СборкаЗапасов.Запасы");
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
КонецПроцедуры
//---Lazare 09.03.2021

//ПодольскийАИ #УчетПроектов 13.10.2020 {
&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ЗаполнитьПроектПоДокументу(Объект.Проект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	//ПодольскийАИ #УчетПроектов 13.10.2020 {
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Проект = Объект.Проект;
	КонецЕсли;	
	//ПодольскийАИ #УчетПроектов 13.10.2020 }
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроектПоДокументу(ПроектЗначение = Неопределено, ИмяТЧ = Неопределено)
	
	Если ПроектЗначение = Неопределено Тогда
		Объект.Проект = КэшЗначений.ПустойПроект;
	КонецЕсли;
	
	Если ИмяТЧ = Неопределено Тогда
		ЗаполнитьПроектПоДокументуВТабЧасти("Продукция");
		ЗаполнитьПроектПоДокументуВТабЧасти("Запасы");
		ЗаполнитьПроектПоДокументуВТабЧасти("Отходы");
		ЗаполнитьПроектПоДокументуВТабЧасти("ДополнительныеРасходы"); //+++ Дмгг, 17.04.24, ONESOFT-2638
	Иначе
		ЗаполнитьПроектПоДокументуВТабЧасти(ИмяТЧ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроектПоДокументуВТабЧасти(ИмяТЧ, ТекДанные = Неопределено);
	
	Если ТекДанные = Неопределено Тогда
		Для Каждого ТекСтрока Из Объект[ИмяТЧ] Цикл
			ТекСтрока.Проект = Объект.Проект;
		КонецЦикла;
	Иначе
		ТекДанные.Проект = Объект.Проект;
	КонецЕсли;
	
КонецПроцедуры

//+++ Дмгг
&НаКлиенте
Процедура ВариантыПродукции(Команда)
	
	АдресВариантовПродукцииВХранилище = ПоместитьПредоплатаВХранилище();
	ПараметрыПодбора = Новый Структура("АдресВариантовПродукцииВХранилище",АдресВариантовПродукцииВХранилище);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораПродукции", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("ВариантыПродукцииЗавершение", ЭтотОбъект, Новый Структура("АдресВариантовПродукцииВХранилище", АдресВариантовПродукцииВХранилище)));
    Возврат;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьПредоплатаВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.Запасы.Выгрузить(,
			"НомерСтроки,
			|Номенклатура,
			|Характеристика,
			|Партия,
			|Количество,
			|ЕдиницаИзмерения"),
		УникальныйИдентификатор
	);
	
КонецФункции

&НаКлиенте
Процедура ВариантыПродукцииЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    АдресВариантовПродукцииВХранилище = ДополнительныеПараметры.АдресВариантовПродукцииВХранилище;
    
    КодВозврата = Результат;
    
    ВариантыПродукцииФрагмент(АдресВариантовПродукцииВХранилище, КодВозврата);

КонецПроцедуры

&НаКлиенте
Процедура ВариантыПродукцииФрагмент(Знач АдресВариантовПродукцииВХранилище, Знач КодВозврата)
    
	КлючКМатериалам = "";
    Если (КодВозврата = КодВозвратаДиалога.OK) Тогда
        ПолучитьВариантыПродукцииИзХранилища(АдресВариантовПродукцииВХранилище, КлючКМатериалам);
	КонецЕсли;
	
	Если КлючКМатериалам <> "" Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(НСтр("ru = 'Перезаполнить таблицу материалов согласно выбранному варианту продукции?';"
		+ " ka = 'მასალების ცხრილის გადავსება საწარმოებლად შერჩეული პროდუქციის მიხედვით';"
		+ " en = 'Перезаполнить таблицу материалов согласно выбранному варианту продукции?'"), Режим, 0);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ПерезаполнитьМатериалыПоКлючу(КлючКМатериалам);
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Процедура ПолучитьВариантыПродукцииИзХранилища(АдресВариантовПродукцииВХранилище, КлючКМатериалам)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресВариантовПродукцииВХранилище);
	Объект.Продукция.Загрузить(ТаблицаДляЗагрузки);
	
	Если ТаблицаДляЗагрузки.Количество() > 0 Тогда 
		КлючКМатериалам = ТаблицаДляЗагрузки[0].КлючСвязи;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьМатериалыПоКлючу(КлючКМатериалам)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыПроизводстваМатериалы.Материал КАК Номенклатура,
		|	ВариантыПроизводстваМатериалы.Характеристика КАК Характеристика,
		|	ВариантыПроизводстваМатериалы.Количество КАК Количество,
		|	ВариантыПроизводстваМатериалы.ЕдиницаИзмерений КАК ЕдиницаИзмерения,
		|	1 КАК ДоляСтоимости
		|ИЗ
		|	РегистрСведений.ВариантыПроизводстваМатериалы КАК ВариантыПроизводстваМатериалы
		|ГДЕ
		|	ВариантыПроизводстваМатериалы.КлючСвязи = &КлючСвязи";
	
	Запрос.УстановитьПараметр("КлючСвязи", КлючКМатериалам);
	
	тзМатериалы = Запрос.Выполнить().Выгрузить();
	
	Объект.Запасы.Загрузить(тзМатериалы);	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеСпецификацийПоПоследнейДатеСоздания(Команда)
	ЗаполнениеСпецификацийПоПоследнейДатеСозданияНаСервере();
КонецПроцедуры

//--- Дмгг

// Kuzmich, 18.12.2023, (ONESOFT-2753) Добавление две константы
&НаСервере
Процедура ЗаполнениеСпецификацийПоПоследнейДатеСозданияНаСервере()
	
	ТЗ_Номенклатура = Объект.Продукция.Выгрузить(,"НомерСтроки,Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ_Номенклатура.НомерСтроки КАК НомерСтроки,
		|	ТЗ_Номенклатура.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТЗ_Номенклатура
		|ИЗ
		|	&ТЗ_Номенклатура КАК ТЗ_Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ_Номенклатура.Номенклатура КАК Владелец,
		|	ТЗ_Номенклатура.НомерСтроки КАК НомерСтроки,
		|	МАКСИМУМ(Спецификации.ДатаСоздания) КАК ДатаСоздания
		|ПОМЕСТИТЬ СпецификацииОтборПред
		|ИЗ
		|	Справочник.Спецификации КАК Спецификации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗ_Номенклатура КАК ТЗ_Номенклатура
		|		ПО Спецификации.Владелец = ТЗ_Номенклатура.Номенклатура
		|ГДЕ
		|	НЕ Спецификации.ПометкаУдаления
		|	И Спецификации.ДатаСоздания <= &ДатаСоздания
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЗ_Номенклатура.Номенклатура,
		|	ТЗ_Номенклатура.НомерСтроки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Владелец,
		|	ДатаСоздания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Спецификации.Ссылка КАК Спецификация,
		|	СпецификацииОтборПред.НомерСтроки КАК НомерСтроки,
		|	Спецификации.ДатаСоздания КАК ДатаСоздания
		|ИЗ
		|	Справочник.Спецификации КАК Спецификации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпецификацииОтборПред КАК СпецификацииОтборПред
		|		ПО Спецификации.ДатаСоздания = СпецификацииОтборПред.ДатаСоздания
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ТЗ_Номенклатура", ТЗ_Номенклатура);
	Запрос.УстановитьПараметр("ДатаСоздания", ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТекущаяСтрока = Объект.Продукция[ВыборкаДетальныеЗаписи.НомерСтроки-1];
		ТекущаяСтрока.Спецификация = ВыборкаДетальныеЗаписи.Спецификация;
		
	КонецЦикла;	
	
КонецПроцедуры
// Kuzmich, 18.12.2023, (ONESOFT-2753) Добавление две константы

//--------------------------------------------------------------------------
// © Шишка В.В. [23 декабря 2023]  НАЧАЛО
#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеЗатраты

&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти = Неопределено) Экспорт 
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.ДополнительныеРасходы.ТекущиеДанные;
	КонецЕсли;
	
	Если УчитыватьДополнительныеЗатратыВПроизводстве Тогда 
		
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
		
		РассчитатьСуммуНДС(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
		СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.СуммаНДС;
		
	КонецЕсли;
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	УИД_Строки = СтрокаТабличнойЧасти.ПолучитьИдентификатор();
	СтуктураЗаполнения = ПолучитьСтавкиНаСервере(УИД_Строки); 
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидУдержанияНДФЛ) Тогда 
		СтрокаТабличнойЧасти.СуммаНДФЛ = СтуктураЗаполнения.СуммаНДФЛ;  
	Иначе
		СтрокаТабличнойЧасти.СуммаНДФЛ = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидУдержанияПФ) Тогда
		СтрокаТабличнойЧасти.СуммаПФ = СтуктураЗаполнения.СуммаПФ;
	Иначе
		СтрокаТабличнойЧасти.СуммаПФ = 0;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.СуммаНДС = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.СуммаПФ - СтрокаТабличнойЧасти.СуммаНДФЛ)-(СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.СуммаПФ - СтрокаТабличнойЧасти.СуммаНДФЛ)/(1 + (СтавкаНДС/100));
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена + СтрокаТабличнойЧасти.СуммаНДФЛ + СтрокаТабличнойЧасти.СуммаПФ;
	СтрокаТабличнойЧасти.СуммаБезНалогов = СтрокаТабличнойЧасти.Всего - СтрокаТабличнойЧасти.СуммаНДФЛ - СтрокаТабличнойЧасти.СуммаПФ - СтрокаТабличнойЧасти.СуммаНДС;
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

&НаСервере
Процедура РассчитатьСуммуНДС(ИдентификаторСтроки)
	
	СтрокаТабличнойЧасти = Объект.ДополнительныеРасходы.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	
	СтрокаТабличнойЧасти.СуммаНДФЛ = 0;
	СтрокаТабличнойЧасти.СуммаПФ = 0;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидУдержанияНДФЛ) 
		И СтрокаТабличнойЧасти.ВидУдержанияНДФЛ.СтавкаНДФЛ > 0 Тогда
	
		СтрокаТабличнойЧасти.СуммаНДФЛ = СтрокаТабличнойЧасти.Сумма * СтрокаТабличнойЧасти.ВидУдержанияНДФЛ.СтавкаНДФЛ / 100; 				
	
	
	КонецЕсли; 
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидУдержанияПФ) И СтрокаТабличнойЧасти.ВидУдержанияПФ.СтавкаПФ > 0 Тогда
	
		СтрокаТабличнойЧасти.СуммаПФ = СтрокаТабличнойЧасти.Сумма * СтрокаТабличнойЧасти.ВидУдержанияПФ.СтавкаПФ / 100; 				
	
	
	КонецЕсли;      
	
	СтрокаТабличнойЧасти.СуммаНДС = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.СуммаПФ - СтрокаТабличнойЧасти.СуммаНДФЛ)-(СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.СуммаПФ - СтрокаТабличнойЧасти.СуммаНДФЛ)/(1 + (СтавкаНДС/100));
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена + СтрокаТабличнойЧасти.СуммаНДФЛ + СтрокаТабличнойЧасти.СуммаПФ;
	СтрокаТабличнойЧасти.СуммаБезНалогов = СтрокаТабличнойЧасти.Всего - СтрокаТабличнойЧасти.СуммаНДФЛ - СтрокаТабличнойЧасти.СуммаПФ - СтрокаТабличнойЧасти.СуммаНДС;
	
КонецПроцедуры // РассчитатьСуммуНДС()

&НаКлиенте
Процедура ДополнительныеРасходыЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРасходыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ДополнительныеРасходы.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРасходыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ДополнительныеРасходы.ТекущиеДанные;
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	//СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	//СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	//СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	//СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРасходыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ДополнительныеРасходы.ТекущиеДанные;
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРасходыВидУдержанияНДФЛПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ДополнительныеРасходы.ТекущиеДанные;
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРасходыВидУдержанияПФПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ДополнительныеРасходы.ТекущиеДанные;
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);	
	
КонецПроцедуры

//+++ Дмгг, ONESOFT-2638
&НаКлиенте
Процедура ДополнительныеРасходыКонтрагентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДополнительныеРасходы.ТекущиеДанные; 
	УИД_Строки = ТекущаяСтрока.ПолучитьИдентификатор();
	
	Если ТипЗнч(ТекущаяСтрока.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда 
		СтруктураДанные = ПолучитьДанныеКонтрагентПриИзменении(Объект.Дата, ТекущаяСтрока.Контрагент, Объект.Организация);
		
		ТекущаяСтрока.Договор = СтруктураДанные.Договор;
		ТекущаяСтрока.СтавкаНДС = СтруктураДанные.СтавкаНДС;  
		
		ТекущаяСтрока.ВидУдержанияНДФЛ = УправлениеНебольшойФирмойСервер.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Договор, "ВидУдержанияНДФЛ");
		ТекущаяСтрока.ВидУдержанияПФ = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьВидУдержанияПФ(Объект.Дата, ТекущаяСтрока.Контрагент, ТекущаяСтрока.Договор);
		
		СтуктураЗаполнения = ПолучитьСтавкиНаСервере(УИД_Строки);
		ТекущаяСтрока.СуммаНДФЛ = СтуктураЗаполнения.СуммаНДФЛ;
		ТекущаяСтрока.СуммаПФ = СтуктураЗаполнения.СуммаПФ;   
		
	ИначеЕсли ТипЗнч(ТекущаяСтрока.Контрагент) = Тип("СправочникСсылка.Сотрудники") Тогда  
		
		ТекущаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.БезНДС");  
		
		СтруктураСтрудника = ПолучитьСтруктуруСотрудникаНаСервере(УИД_Строки);
		
		ТекущаяСтрока.Валюта 			= Объект.ВалютаДокумента;
		ТекущаяСтрока.ВидУдержанияНДФЛ	= СтруктураСтрудника.ВидУдержанияНДФЛ;
		ТекущаяСтрока.ВидУдержанияПФ	= СтруктураСтрудника.ВидУдержанияПФ; 
		ТекущаяСтрока.Подразделение		= СтруктураСтрудника.Подразделение;
		
		СтуктураЗаполнения = ПолучитьСтавкиНаСервере(УИД_Строки);
		ТекущаяСтрока.СуммаНДФЛ = СтуктураЗаполнения.СуммаНДФЛ;
		ТекущаяСтрока.СуммаПФ = СтуктураЗаполнения.СуммаПФ;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Функция ПолучитьСтруктуруСотрудникаНаСервере(УИД_Строки)
	
	ТекущаяСтрока = Объект.ДополнительныеРасходы.НайтиПоИдентификатору(УИД_Строки);
	
	СтруктураВозврта = Новый Структура("ВидУдержанияНДФЛ, ВидУдержанияПФ, Подразделение");     
	
	тзСтавки = РегистрыСведений.Сотрудники.СрезПоследних(ДатаДокумента, Новый Структура("Сотрудник, Организация", ТекущаяСтрока.Контрагент, Объект.Организация));
	Если тзСтавки.Количество() <> 0 Тогда       
		СтруктураВозврта.ВидУдержанияНДФЛ = тзСтавки[0].ВидУдержанияНДФЛ;
		СтруктураВозврта.ВидУдержанияПФ = тзСтавки[0].ВидУдержанияПФ; 
		СтруктураВозврта.Подразделение = тзСтавки[0].СтруктурнаяЕдиница;
	КонецЕсли;
	
	Возврат СтруктураВозврта;
	
КонецФункции    

&НаСервере
Функция ПолучитьДанныеКонтрагентПриИзменении(Дата, Контрагент, Организация)
	
	ДоговорПоУмолчанию = ПолучитьДоговорПоУмолчанию(Объект.Ссылка, Контрагент, Организация, Объект.ВидОперации);
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"КонтактноеЛицоПодписант",
		Контрагент.КонтактноеЛицоПодписант
	);
	
	СтруктураДанные.Вставить(
		"Договор",
		ДоговорПоУмолчанию
	);
		
	СтруктураДанные.Вставить(
		"ВалютаРасчетов",
		ДоговорПоУмолчанию.ВалютаРасчетов
	);
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетовКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ДоговорПоУмолчанию.ВалютаРасчетов))
	);
	
	СтруктураДанные.Вставить(
		"ВидЦенКонтрагента",
		ДоговорПоУмолчанию.ВидЦенКонтрагента
	);
	
	СтруктураДанные.Вставить(
		"РасчетыВУсловныхЕдиницах",
		ДоговорПоУмолчанию.РасчетыВУсловныхЕдиницах
	);
	
	СтруктураДанные.Вставить(
		"СуммаВключаетНДС",
		?(ЗначениеЗаполнено(ДоговорПоУмолчанию.ВидЦенКонтрагента), ДоговорПоУмолчанию.ВидЦенКонтрагента.ЦенаВключаетНДС, Неопределено)
	);
	
	СтруктураДанные.Вставить(
		"УчетЦенКонтрагентов",
		ПолучитьФункциональнуюОпцию("УчетЦенКонтрагентов")
	);
	
	СтруктураДанные.Вставить(
		"ВидЦен",
		ДоговорПоУмолчанию.ВидЦен);
		
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") И Контрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда 
		
		СтруктураДанные.Вставить(
			"СтавкаНДС",
			Справочники.СтавкиНДС.НДС18
		); 
		
	Иначе
		
		СтруктураДанные.Вставить(
			"СтавкаНДС",
			Справочники.СтавкиНДС.БезНДС
		); 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДоговорПоУмолчанию) Тогда 
		СтруктураДанные.Вставить("ПроектИзДоговора", ДоговорПоУмолчанию.Проект);
	Иначе
		СтруктураДанные.Вставить("ПроектИзДоговора", Справочники.Проекты.ПустаяСсылка());
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеКонтрагентПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДоговорПоУмолчанию(Документ, Контрагент, Организация, ВидОперации)
	
	Если Не Контрагент.ВестиРасчетыПоДоговорам Тогда
		Возврат Контрагент.ДоговорПоУмолчанию;
	КонецЕсли;
	
	МенеджерСправочника = Справочники.ДоговорыКонтрагентов;
	
	СписокВидовДоговоров = МенеджерСправочника.ПолучитьСписокВидовДоговораДляДокумента(Документ, ВидОперации);
	ДоговорПоУмолчанию = МенеджерСправочника.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(Контрагент, Организация, СписокВидовДоговоров);
	// Kuzmich, 19.08.2019, Использовать виды договоров, Доработка
	Если ЗначениеЗаполнено(ДоговорПоУмолчанию) И Константы.ИспользоватьВидыДоговоров.Получить() Тогда
		Если НЕ ДоговорПоУмолчанию.Поставщик Тогда
			ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	// Kuzmich, 19.08.2019, Использовать виды договоров, Доработка
	
	Возврат ДоговорПоУмолчанию;
	
КонецФункции

&НаСервере
Функция ПолучитьСтавкиНаСервере(УИД_Строки)
	
	ТекущаяСтрока = Объект.ДополнительныеРасходы.НайтиПоИдентификатору(УИД_Строки);
	
	СуммаРасчетов = ТекущаяСтрока.Сумма;
	СтруктураВозврата = Новый Структура;          
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Контрагент) Тогда 
		СтруктураВозврата.Вставить("СуммаНДФЛ",0);
		СтруктураВозврата.Вставить("СуммаПФ", 0); 
		СтруктураВозврата.Вставить("СтавкаНДС", 0);
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Контрагент) И  ТипЗнч(ТекущаяСтрока.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда     
		
		СтавкаПФ = 0;
		тзСтавкиПФ = РегистрыСведений.УдержанияДляПенсионногоФонда.СрезПоследних(ДатаДокумента, Новый Структура("Контрагент, Договор", ТекущаяСтрока.Контрагент, ТекущаяСтрока.Договор));
		Если тзСтавкиПФ.Количество() <> 0 Тогда 
			СтавкаПФ = тзСтавкиПФ[0].ВидУдержания.СтавкаПФ;
		КонецЕсли;
		
		СтавкаНДС = 0;
		Если НЕ ТекущаяСтрока.Контрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
			
			Если ТекущаяСтрока.Контрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
				СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
			Иначе
				СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
			КонецЕсли;
			
		Иначе
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
		КонецЕсли;  
		
		Если Объект.СуммаВключаетНДС Тогда      
			
			Если ЗначениеЗаполнено(ТекущаяСтрока.Контрагент) И  ТипЗнч(ТекущаяСтрока.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда   
				Ставки = РС_ОбщегоНазначения.ПолучитьЗначенииСтавок(0, ТекущаяСтрока.Договор.ВидУдержанияНДФЛ);
				СтавкаНДФЛ = Ставки.СтавкаНДФЛ;  
			КонецЕсли;
			СуммаБезНалогов = СуммаРасчетов;
			СуммаНДФЛ		= Окр(СуммаРасчетов/((100-СтавкаНДФЛ)/100)*(СтавкаНДФЛ/100), 2);
			СуммаПФ			= Окр(((СуммаРасчетов+СуммаНДФЛ)/((100-СтавкаПФ)/100))*(СтавкаПФ/100), 2);
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаПФ;
			
			СтруктураВозврата.Вставить("СуммаНДФЛ",СуммаНДФЛ);
			СтруктураВозврата.Вставить("СуммаПФ", СуммаПФ);  
			СтруктураВозврата.Вставить("СтавкаНДС", СтавкаНДС);
			
		Иначе

			Если ЗначениеЗаполнено(ТекущаяСтрока.Контрагент) И  ТипЗнч(ТекущаяСтрока.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда  
				Ставки = РС_ОбщегоНазначения.ПолучитьЗначенииСтавок(0, ТекущаяСтрока.Договор.ВидУдержанияНДФЛ);
				СтавкаНДФЛ = Ставки.СтавкаНДФЛ;  
			КонецЕсли;
			СуммаБезНалогов = СуммаРасчетов;
			СуммаНДС		= Окр(СуммаРасчетов - СуммаРасчетов*((100-СтавкаНДС)/100), 2);
			СуммаНДФЛ		= Окр((СуммаРасчетов + СуммаНДС)/((100-СтавкаНДФЛ)/100)*(СтавкаНДФЛ/100), 2);
			СуммаПФ			= Окр(((СуммаРасчетов + СуммаНДС + СуммаНДФЛ)/((100-СтавкаПФ)/100)) * (СтавкаПФ / 100), 2);
			
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
			
			СтруктураВозврата.Вставить("СуммаНДФЛ",СуммаНДФЛ);
			СтруктураВозврата.Вставить("СуммаПФ", СуммаПФ);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Контрагент) И ТипЗнч(ТекущаяСтрока.Контрагент) = Тип("СправочникСсылка.Сотрудники") Тогда 
		
		СтавкаПФ = 0;
		СтавкаНДФЛ = 0;
		
		тзСтавки = РегистрыСведений.Сотрудники.СрезПоследних(ДатаДокумента, Новый Структура("Сотрудник, Организация", ТекущаяСтрока.Контрагент, Объект.Организация));
		Если тзСтавки.Количество() <> 0 Тогда 
			
			СтавкаПФ = ?(ЗначениеЗаполнено(ТекущаяСтрока.ВидУдержанияПФ), ТекущаяСтрока.ВидУдержанияПФ.СтавкаПФ, тзСтавки[0].ВидУдержанияПФ.СтавкаПФ); 
			СтавкаНДФЛ = ?(ЗначениеЗаполнено(ТекущаяСтрока.ВидУдержанияНДФЛ), ТекущаяСтрока.ВидУдержанияНДФЛ.СтавкаНДФЛ, тзСтавки[0].ВидУдержанияНДФЛ.СтавкаНДФЛ);
			
		Иначе
			
			СтавкаПФ = ?(ЗначениеЗаполнено(ТекущаяСтрока.ВидУдержанияПФ), ТекущаяСтрока.ВидУдержанияПФ.СтавкаПФ, 0);
			СтавкаНДФЛ = ?(ЗначениеЗаполнено(ТекущаяСтрока.ВидУдержанияНДФЛ), ТекущаяСтрока.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0);
			
		КонецЕсли;   
		
		СтавкаНДС = Объект.Организация.СтавкаНДСПоУмолчанию; 
		
		СуммаБезНалогов = СуммаРасчетов;
		СуммаНДФЛ		= Окр(СуммаРасчетов/((100-СтавкаНДФЛ)/100)*(СтавкаНДФЛ/100), 2);
		СуммаПФ			= Окр(((СуммаРасчетов+СуммаНДФЛ)/((100-СтавкаПФ)/100))*(СтавкаПФ/100), 2);
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаПФ;
		
		СтруктураВозврата.Вставить("СуммаНДФЛ",СуммаНДФЛ);
		СтруктураВозврата.Вставить("СуммаПФ", СуммаПФ);  
		СтруктураВозврата.Вставить("СтавкаНДС", СтавкаНДС);
		
	Иначе   
		
		СтруктураВозврата.Вставить("СуммаНДФЛ",0);
		СтруктураВозврата.Вставить("СуммаПФ", 0);  
		СтруктураВозврата.Вставить("СтавкаНДС", СтавкаНДС); 
		
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(ТекущаяСтрока.Контрагент) И ТипЗнч(ТекущаяСтрока.Контрагент) = Тип("СправочникСсылка.Контрагенты") И ТекущаяСтрока.Договор.УчитыватьНДФЛ Тогда          
	//	
	//	Если Объект.СуммаВключаетНДС Тогда      
	//		
	//		Если ЗначениеЗаполнено(ТекущаяСтрока.Контрагент) И  ТипЗнч(ТекущаяСтрока.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда   
	//			Ставки = РС_ОбщегоНазначения.ПолучитьЗначенииСтавок(0, ТекущаяСтрока.Договор.ВидУдержанияНДФЛ);
	//			СтавкаНДФЛ = Ставки.СтавкаНДФЛ;  
	//		КонецЕсли;
	//		СуммаБезНалогов = СуммаРасчетов;
	//		СуммаНДФЛ		= Окр(СуммаРасчетов/((100-СтавкаНДФЛ)/100)*(СтавкаНДФЛ/100), 2);
	//		СуммаПФ			= Окр(((СуммаРасчетов+СуммаНДФЛ)/((100-СтавкаПФ)/100))*(СтавкаПФ/100), 2);
	//		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаПФ;
	//		
	//		СтруктураВозврата.Вставить("СуммаНДФЛ",СуммаНДФЛ);
	//		СтруктураВозврата.Вставить("СуммаПФ", СуммаПФ);  
	//		СтруктураВозврата.Вставить("СтавкаНДС", СтавкаНДС);
	//		
	//	Иначе

	//		Если ЗначениеЗаполнено(ТекущаяСтрока.Контрагент) И  ТипЗнч(ТекущаяСтрока.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда  
	//			Ставки = РС_ОбщегоНазначения.ПолучитьЗначенииСтавок(0, ТекущаяСтрока.Договор.ВидУдержанияНДФЛ);
	//			СтавкаНДФЛ = Ставки.СтавкаНДФЛ;  
	//		КонецЕсли;
	//		СуммаБезНалогов = СуммаРасчетов;
	//		СуммаНДС		= Окр(СуммаРасчетов - СуммаРасчетов*((100-СтавкаНДС)/100), 2);
	//		СуммаНДФЛ		= Окр((СуммаРасчетов + СуммаНДС)/((100-СтавкаНДФЛ)/100)*(СтавкаНДФЛ/100), 2);
	//		СуммаПФ			= Окр(((СуммаРасчетов + СуммаНДС + СуммаНДФЛ)/((100-СтавкаПФ)/100)) * (СтавкаПФ / 100), 2);
	//		
	//		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
	//		
	//		СтруктураВозврата.Вставить("СуммаНДФЛ",СуммаНДФЛ);
	//		СтруктураВозврата.Вставить("СуммаПФ", СуммаПФ);
	//		
	//	КонецЕсли;
	//Иначе 
	//	СтруктураВозврата.Вставить("СуммаНДФЛ",0);
	//	СтруктураВозврата.Вставить("СуммаПФ", 0);  
	//	СтруктураВозврата.Вставить("СтавкаНДС", СтавкаНДС);
	//КонецЕсли;

	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ЦеныИВалютаНажатие(Элемент, СтандартнаяОбработка)
	
	Если ЭтаФорма.ТолькоПросмотр = Истина Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ОбработатьИзмененияПоКнопкеЦеныИВалюты(Объект.ВалютаДокумента);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалюты(Знач ВалютаРасчетовПередИзменением, ПересчитатьЦены = Ложь, ПерезаполнитьЦены = Ложь, ТекстПредупреждения = "")
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВалютаДокумента",		  Объект.ВалютаДокумента);
	СтруктураПараметров.Вставить("Курс",				  Объект.Курс);
	СтруктураПараметров.Вставить("Кратность",			  Объект.Кратность);
	СтруктураПараметров.Вставить("НалогообложениеНДС",	  НалогообложениеНДС_ФормаЦеныИВалюта());
	СтруктураПараметров.Вставить("СуммаВключаетНДС",	  Объект.СуммаВключаетНДС);
	СтруктураПараметров.Вставить("НДСВключатьВСтоимость", Объект.НДСВключатьВСтоимость);
	//СтруктураПараметров.Вставить("Контрагент",			  Объект.Контрагент);
	//СтруктураПараметров.Вставить("Договор",				  Объект.Договор);
	СтруктураПараметров.Вставить("Организация",			  Компания);
	СтруктураПараметров.Вставить("ДатаДокумента",		  Объект.Дата);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	  ПерезаполнитьЦены);
	СтруктураПараметров.Вставить("ПересчитатьЦены",		  ПересчитатьЦены);
	СтруктураПараметров.Вставить("БылиВнесеныИзменения",  Ложь);
	//СтруктураПараметров.Вставить("ВидЦенКонтрагента", 	  Объект.ВидЦенКонтрагента);
	СтруктураПараметров.Вставить("РегистрироватьЦеныПоставщика", ЛОЖЬ);//Объект.РегистрироватьЦеныПоставщика);
	СтруктураПараметров.Вставить("ТекстПредупреждения",	  ТекстПредупреждения);
	// ДисконтныеКарты
	//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя") Тогда
	//	СтруктураПараметров.Вставить("ДисконтнаяКарта",	  Объект.ДисконтнаяКарта);
	//КонецЕсли;
	//// Конец ДисконтныеКарты
	////+++ Lazare_13.04.2021
	//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя") Тогда
	//	СтруктураПараметров.Вставить("ВидЦен",	  Объект.ВидЦен);
	//	СтруктураПараметров.Удалить("ВидЦенКонтрагента")  ;
	//КонецЕсли;
	////--- Lazare_13.04.2021
	//// Kuzmich, 03.02.2024, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
	//Если Установить_СуммаВключаетНДС_ДляНЕрезидента() Тогда
	//	СтруктураПараметров.Вставить("ДоступностьСуммаВключаетНДС", ЛОЖЬ);
	//КонецЕсли;
	//// Kuzmich, 03.02.2024, (ONESOFT-2587) Расчет НДС неправильный в документ приходная накладная (услуги)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияПоКнопкеЦеныИВалютыЗавершение", ЭтотОбъект, Новый Структура("ВалютаРасчетовПередИзменением", ВалютаРасчетовПередИзменением));
	ОткрытьФорму("ОбщаяФорма.ФормаЦеныИВалюта", СтруктураПараметров, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОбработатьИзмененияПоКнопкеЦеныИВалюты()

&НаСервере
Функция НалогообложениеНДС_ФормаЦеныИВалюта()
	ПЕРЕМ РЕЗ;
	
	РЕЗ = Объект.НалогообложениеНДС;
	//Если ЗначениеЗаполнено(Объект.Контрагент) И Объект.Контрагент.ЯвляетсяНеРезидентом Тогда
	//	РЕЗ = Объект.Контрагент.НалогообложениеНДС;
	//КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции // ()

&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалютыЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	// 3. Перезаполняем табличную часть "Запасы" если были внесены изменения в форме "Цены и Валюта".
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура")
		И РезультатЗакрытия.БылиВнесеныИзменения Тогда
		
		Объект.ВалютаДокумента = РезультатЗакрытия.ВалютаДокумента;
		Объект.Курс = РезультатЗакрытия.КурсРасчетов;
		Объект.Кратность = РезультатЗакрытия.КратностьРасчетов;
		Объект.НалогообложениеНДС = РезультатЗакрытия.НалогообложениеНДС;
		Объект.СуммаВключаетНДС = РезультатЗакрытия.СуммаВключаетНДС;
		Объект.НДСВключатьВСтоимость = РезультатЗакрытия.НДСВключатьВСтоимость;
		//Объект.ВидЦенКонтрагента = РезультатЗакрытия.ВидЦенКонтрагента;
		//Объект.ВидЦен			 = РезультатЗакрытия.ВидЦен;
		// Олег Литвиненко <---
		//Объект.РегистрироватьЦеныПоставщика = РезультатЗакрытия.РегистрироватьЦеныПоставщика;
		// ДисконтныеКарты
		//Если ЗначениеЗаполнено(РезультатЗакрытия.ДисконтнаяКарта) И ЗначениеЗаполнено(РезультатЗакрытия.Контрагент) И Не Объект.Контрагент.Пустая() Тогда
		//	Если РезультатЗакрытия.Контрагент = Объект.Контрагент Тогда
		//		Объект.ДисконтнаяКарта = РезультатЗакрытия.ДисконтнаяКарта;
		//	Иначе // Выдадим сообщение и не будем менять данные о дисконтной карте.
		//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		//		НСтр("ka='დისკონტური ბარათი არ არის წაკითხული. დისკონტური ბარათის მფლობელი დოკუმენტში არსებულ კონტრაგენტს არ ემთხვევა.';ru='Дисконтная карта не считана. Владелец дисконтной карты не совпадает с контрагентом в документе.';en='The discount card is not read. The owner of a discount card does not coincide with the counterpart in the document.'"),
		//		,
		//		"Контрагент",
		//		"Объект");
		//	КонецЕсли;
		//Иначе
		//	Объект.ДисконтнаяКарта = РезультатЗакрытия.ДисконтнаяКарта;
		//КонецЕсли;
		// Конец ДисконтныеКарты
		
		// Пересчитываем цены по виду цен.
		//Если РезультатЗакрытия.ПерезаполнитьЦены Тогда
		//	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя") Тогда
		//		УправлениеНебольшойФирмойКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтотОбъект, "Запасы");
		//	Иначе
				ПерезаполнитьЦеныТабличнойЧастиПоВидуЦенКонтрагента(ЭтотОбъект, "ДополнительныеРасходы");
		//	КонецЕсли;
		//КонецЕсли;

		// Пересчитываем цены по валюте.
		Если НЕ РезультатЗакрытия.ПерезаполнитьЦены
			И РезультатЗакрытия.ПересчитатьЦены Тогда
			УправлениеНебольшойФирмойКлиент.ПересчитатьЦеныТабличнойЧастиПоВалюте(ЭтотОбъект, ДополнительныеПараметры.ВалютаРасчетовПередИзменением, "ДополнительныеРасходы");
		КонецЕсли;
		
		Если ЛОЖЬ И РезультатЗакрытия.НалогообложениеНДС <> РезультатЗакрытия.ПредНалогообложениеНДС ИЛИ РезультатЗакрытия.СуммаВключаетНДС <> РезультатЗакрытия.ПредСуммаВключаетНДС Тогда 
			//ЗаполнитьСтавкуНДСПоНалогообложениеНДС(РезультатЗакрытия.ПредНалогообложениеНДС, РезультатЗакрытия.ПредСуммаВключаетНДС);
		КонецЕсли;	
			
	КонецЕсли;
	
	//СтруктураНадписи = Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦенКонтрагента, НалогообложениеНДС,ВидЦен", Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, КурсНациональнаяВалюта, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.ВидЦенКонтрагента, Объект.НалогообложениеНДС,Объект.ВидЦен);
	СтруктураНадписи = Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦенКонтрагента, НалогообложениеНДС,ВидЦен", Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, 1, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦенКонтрагента, Объект.НалогообложениеНДС, ВидЦен);
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	
	//ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьНадписьЦеныИВалюта(СтруктураНадписи)
	
	ТекстНадписи = "";
	
	// Валюта.
	Если СтруктураНадписи.УчетВалютныхОпераций Тогда
		Если ЗначениеЗаполнено(СтруктураНадписи.ВалютаДокумента) Тогда
			ТекстНадписи = НСтр("ka='%Валюта%';ru='%Валюта%';en='%Currency%'");
			ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Валюта%", СокрЛП(Строка(СтруктураНадписи.ВалютаДокумента)));
		КонецЕсли;
	КонецЕсли;
		
	// Вид цен контрагента.
	Если ЗначениеЗаполнено(СтруктураНадписи.ВидЦенКонтрагента) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%ВидЦенКонтрагента%';ru='%ВидЦенКонтрагента%';en='% VidTsenKontragenta%'");
		Иначе	
			ТекстНадписи = ТекстНадписи + НСтр("ru = ' • %ВидЦенКонтрагента%'; ka = ' • %ВидЦенКонтрагента%'; en = ' • %ВидЦенКонтрагента%'");
		КонецЕсли;	
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ВидЦенКонтрагента%", СокрЛП(Строка(СтруктураНадписи.ВидЦенКонтрагента)));
	КонецЕсли;
	
	// Налогообложение НДС.
	Если ЗначениеЗаполнено(СтруктураНадписи.НалогообложениеНДС) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%НалогообложениеНДС%';ru='%НалогообложениеНДС%';en='% NalogooblozhenieNDS%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ka=' • %НалогообложениеНДС%';ru=' • %НалогообложениеНДС%'");
		КонецЕсли;	
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%НалогообложениеНДС%", РаботаСФормойДокументаКлиентСервер.КраткоеПредставлениеТипаНалогообложенияНДС(СтруктураНадписи.НалогообложениеНДС));
	КонецЕсли;
	
	// Флаг сумма включает НДС.
	Если ПустаяСтрока(ТекстНадписи) Тогда	
		Если СтруктураНадписи.СуммаВключаетНДС Тогда	
			ТекстНадписи = НСтр("en='Amount with VAT';ka='თანხა შეიცავს დღგ-ს';ru='Сумма включает НДС'");
		Иначе		
			ТекстНадписи = НСтр("ka='თანხა არ შეიცავს დღგ-ს';ru='Сумма не включает НДС';en='The sum does not include VAT'");
		КонецЕсли;	
	КонецЕсли;	
	
	//++Lazare_13.04.2021
	// Вид цен
	Если ЗначениеЗаполнено(СтруктураНадписи.ВидЦен) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%ВидЦен%';ru='%ВидЦен%';en='% VidTsen%'");
		Иначе	
			ТекстНадписи = ТекстНадписи + НСтр("ka=' • %ВидЦен%';ru=' • %ВидЦен%'");
		КонецЕсли;
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ВидЦен%", СокрЛП(Строка(СтруктураНадписи.ВидЦен)));
	КонецЕсли;
	//--Lazare_13.04.2021
 
	Возврат ТекстНадписи;
	
КонецФункции // СформироватьНадписьЦеныИВалюта()

// Выполняем пересчет цены табличной части документа после изменений в форме 
// "Цены и валюта".
//
&НаКлиенте
Процедура ПерезаполнитьЦеныТабличнойЧастиПоВидуЦенКонтрагента(ФормаДокумента, ИмяТабличнойЧасти) Экспорт
	
	СтруктураДанных = Новый Структура;
	ТабличнаяЧастьДокумента = Новый Массив;

	СтруктураДанных.Вставить("Дата",				ФормаДокумента.Объект.Дата);
	СтруктураДанных.Вставить("Организация",			ФормаДокумента.Компания);
	//СтруктураДанных.Вставить("ВидЦенКонтрагента",	ФормаДокумента.Объект.ВидЦенКонтрагента);
	СтруктураДанных.Вставить("ВалютаДокумента",		ФормаДокумента.Объект.ВалютаДокумента);
	СтруктураДанных.Вставить("СуммаВключаетНДС",	ФормаДокумента.Объект.СуммаВключаетНДС);
	
	Для каждого СтрокаТЧ Из ФормаДокумента.Объект[ИмяТабличнойЧасти] Цикл
		
		СтрокаТЧ.Цена = 0;
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			Продолжить;	
		КонецЕсли;          
		
		Если ФормаДокумента.Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") Тогда 
			СтрокаТЧ.СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.НДС18");  
		Иначе
			СтрокаТЧ.СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.БезНДС");
		КонецЕсли;
		
		СтрокаТабличнойЧасти = Новый Структура();
		СтрокаТабличнойЧасти.Вставить("Номенклатура",		СтрокаТЧ.Номенклатура);
		//СтрокаТабличнойЧасти.Вставить("Характеристика",		СтрокаТЧ.Характеристика);
		СтрокаТабличнойЧасти.Вставить("ЕдиницаИзмерения",	СтрокаТЧ.ЕдиницаИзмерения);  
		СтрокаТабличнойЧасти.Вставить("СтавкаНДС",			СтрокаТЧ.СтавкаНДС);
		//Если ФормаДокумента.Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") Тогда 
		//	СтрокаТабличнойЧасти.Вставить("СтавкаНДС",			ПредопределенноеЗначение("Справочник.СтавкиНДС.НДС18"));  
		//Иначе
		//	СтрокаТабличнойЧасти.Вставить("СтавкаНДС",			ПредопределенноеЗначение("Справочник.СтавкиНДС.БезНДС"));
		//КонецЕсли;
		СтрокаТабличнойЧасти.Вставить("Цена",				0);
		
		ТабличнаяЧастьДокумента.Добавить(СтрокаТабличнойЧасти);
		
	КонецЦикла;
		
	ПолучитьЦеныТабличнойЧастиПоВидуЦенКонтрагента(СтруктураДанных, ТабличнаяЧастьДокумента);
		
	Для каждого СтрокаТЧ Из ТабличнаяЧастьДокумента Цикл

		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура",		СтрокаТЧ.Номенклатура);
		//СтруктураПоиска.Вставить("Характеристика",		СтрокаТЧ.Характеристика);
		СтруктураПоиска.Вставить("ЕдиницаИзмерения",	СтрокаТЧ.ЕдиницаИзмерения);
		СтруктураПоиска.Вставить("СтавкаНДС",			СтрокаТЧ.СтавкаНДС);
		
		РезультатПоиска = ФормаДокумента.Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураПоиска);
		
		Для каждого СтрокаРезультат Из РезультатПоиска Цикл
			
			СтрокаРезультат.Цена = СтрокаТЧ.Цена;
			РассчитатьСуммуСтрокиТабличнойЧасти(ФормаДокумента, СтрокаРезультат);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен() 

// Процедура рассчитывает сумму строки табличной части при заполнение по "Цены и валюта".
//
&НаКлиенте
Процедура РассчитатьСуммуСтрокиТабличнойЧасти(ФормаДокумента, СтрокаТабЧасти, ОбнулятьАвтоСкидки = Истина)
	
	Если СтрокаТабЧасти.Свойство("Количество") И СтрокаТабЧасти.Свойство("Цена") Тогда
		СтрокаТабЧасти.Сумма = СтрокаТабЧасти.Количество * СтрокаТабЧасти.Цена;
	КонецЕсли;
	
	Если СтрокаТабЧасти.Свойство("ПроцентСкидкиНаценки") Тогда
		Если СтрокаТабЧасти.ПроцентСкидкиНаценки = 100 Тогда
			СтрокаТабЧасти.Сумма = 0;
		ИначеЕсли СтрокаТабЧасти.ПроцентСкидкиНаценки <> 0 И СтрокаТабЧасти.Количество <> 0 Тогда
			СтрокаТабЧасти.Сумма = СтрокаТабЧасти.Сумма * (1 - СтрокаТабЧасти.ПроцентСкидкиНаценки / 100);
		КонецЕсли;
	КонецЕсли;	

	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабЧасти.СтавкаНДС);
			
	Если ФормаДокумента.Объект.Свойство("СуммаВключаетНДС") Тогда
		
		Если СтрокаТабЧасти.Свойство("Сумма") Тогда
			
			СтрокаТабЧасти.СуммаНДС = ?(
				ФормаДокумента.Объект.СуммаВключаетНДС, 
				СтрокаТабЧасти.Сумма - (СтрокаТабЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
				СтрокаТабЧасти.Сумма * СтавкаНДС / 100
			);
			СтрокаТабЧасти.Всего = СтрокаТабЧасти.Сумма + ?(ФормаДокумента.Объект.СуммаВключаетНДС, 0, СтрокаТабЧасти.СуммаНДС);
			
		Иначе
			
			БазаРасчетаНДС = СтрокаТабЧасти.ТаможеннаяСтоимость + СтрокаТабЧасти.СуммаПошлины;
			
			СтрокаТабЧасти.СуммаНДС = ?(
				ФормаДокумента.Объект.СуммаВключаетНДС, 
				БазаРасчетаНДС - (БазаРасчетаНДС) / ((СтавкаНДС + 100) / 100),
				БазаРасчетаНДС * СтавкаНДС / 100
			);
			
		КонецЕсли;
		
	Иначе
		
		СтрокаТабЧасти.СуммаНДС = СтрокаТабЧасти.Сумма * СтавкаНДС / 100;
		СтрокаТабЧасти.Всего = СтрокаТабЧасти.Сумма + СтрокаТабЧасти.СуммаНДС;
		
	КонецЕсли;
	
	// АвтоматическиеСкидки
	Если ОбнулятьАвтоСкидки Тогда
		Если СтрокаТабЧасти.Свойство("ПроцентАвтоматическойСкидки") Тогда
			СтрокаТабЧасти.ПроцентАвтоматическойСкидки = 0;
			СтрокаТабЧасти.СуммаАвтоматическойСкидки = 0;
		КонецЕсли;
		Если СтрокаТабЧасти.Свойство("ОбщаяСуммаСкидкиБольшеСуммы") Тогда
			СтрокаТабЧасти.ОбщаяСуммаСкидкиБольшеСуммы = Ложь;
		КонецЕсли;
	Иначе
		Если СтрокаТабЧасти.Свойство("ОбщаяСуммаСкидкиБольшеСуммы") Тогда
			ТекСуммаРучнойСкидки = ?(СтрокаТабЧасти.ПроцентСкидкиНаценки = 0, СтрокаТабЧасти.Цена * СтрокаТабЧасти.Количество * СтрокаТабЧасти.ПроцентСкидкиНаценки / 100, 0);
			ТекСуммаСкидки = ТекСуммаРучнойСкидки + СтрокаТабЧасти.СуммаАвтоматическойСкидки;
			Если ТекСуммаСкидки >= СтрокаТабЧасти.Сумма И СтрокаТабЧасти.Цена > 0 Тогда
				СтрокаТабЧасти.ОбщаяСуммаСкидкиБольшеСуммы = Истина;
			Иначе
				СтрокаТабЧасти.ОбщаяСуммаСкидкиБольшеСуммы = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Конец АвтоматическиеСкидки
	
КонецПроцедуры // РассчитатьСуммуСтрокиТабличнойЧасти()	

&НаСервере
Процедура ДополнительныеРасходыДоговорПриИзмененииНаСервере(УИДСтроки)
	
	ТекущаяСтрока = Объект.ДополнительныеРасходы.НайтиПоИдентификатору(УИДСтроки);  
	
	ТекущаяСтрока.Валюта = ТекущаяСтрока.Договор.ВалютаРасчетов;  
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРасходыДоговорПриИзменении(Элемент)       
	
	ТекущаяСтрока = Элементы.ДополнительныеРасходы.ТекущиеДанные;
	УИДСтроки = ТекущаяСтрока.ПолучитьИдентификатор(); 
	ДополнительныеРасходыДоговорПриИзмененииНаСервере(УИДСтроки);
	СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, Объект.Дата, ТекущаяСтрока.Валюта);
	ПересчитатьКурсКратностьВалютыДокументаПоСтрокеДопРасходы(СтруктураДанные, ТекущаяСтрока);  
	
	ТекущаяСтрока.ВидУдержанияНДФЛ = УправлениеНебольшойФирмойСервер.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Договор, "ВидУдержанияНДФЛ");
	ТекущаяСтрока.ВидУдержанияПФ = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьВидУдержанияПФ(Объект.Дата, ТекущаяСтрока.Контрагент, ТекущаяСтрока.Договор);
	
	СтуктураЗаполнения = ПолучитьСтавкиНаСервере(УИДСтроки);
	ТекущаяСтрока.СуммаНДФЛ = СтуктураЗаполнения.СуммаНДФЛ;
	ТекущаяСтрока.СуммаПФ = СтуктураЗаполнения.СуммаПФ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКурсКратностьВалютыДокументаПоСтрокеДопРасходы(СтруктураДанные, СтрокаТабличноыйЧасти)
	
	КурсНовый = ?(СтруктураДанные.ВалютаКурсКратность.Курс = 0, 1, СтруктураДанные.ВалютаКурсКратность.Курс);
	КратностьНовый = ?(СтруктураДанные.ВалютаКурсКратность.Кратность = 0, 1, СтруктураДанные.ВалютаКурсКратность.Кратность);
	
	Если СтрокаТабличноыйЧасти.Курс <> КурсНовый
		ИЛИ СтрокаТабличноыйЧасти.Кратность <> КратностьНовый Тогда
		
		СтрокаТабличноыйЧасти.Курс = КурсНовый;
		СтрокаТабличноыйЧасти.Кратность = КратностьНовый;
		
	КонецЕсли;
	
КонецПроцедуры           

&НаКлиенте
Процедура ДополнительныеРасходыПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДополнительныеРасходы.ТекущиеДанные; 
	Если ТекущаяСтрока <> НЕОПРЕДЕЛЕНО И НЕ ЗначениеЗаполнено(ТекущаяСтрока.Валюта) Тогда 
		ТекущаяСтрока.Валюта = Объект.ВалютаДокумента;  
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, Объект.Дата, ТекущаяСтрока.Валюта);
		ПересчитатьКурсКратностьВалютыДокументаПоСтрокеДопРасходы(СтруктураДанные, ТекущаяСтрока);
	КонецЕсли;
	//ТекущаяСтрока.Курс = Объект.Курс; 
	//ТекущаяСтрока.Кратность = Объект.Кратность;
	
КонецПроцедуры            

&НаСервере
Процедура ПолучитьЦеныТабличнойЧастиПоВидуЦенКонтрагента(СтруктураДанных, ТабличнаяЧастьДокумента) Экспорт
	
	// 1. Сформируем таблицу документа.
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	
	Массив = Новый Массив;
	
	// Номенклатура.
	Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив, ,);
	Массив.Очистить();
	
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", ОписаниеТипов);
	
	// Характеристика.
	//Массив.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
	//ОписаниеТипов = Новый ОписаниеТипов(Массив, ,);
	//Массив.Очистить();
	
	//ТаблицаНоменклатуры.Колонки.Добавить("Характеристика", ОписаниеТипов);
	
	// СтавкиНДС.
	Массив.Добавить(Тип("СправочникСсылка.СтавкиНДС"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив, ,);
	Массив.Очистить();
	
	ТаблицаНоменклатуры.Колонки.Добавить("СтавкаНДС", ОписаниеТипов);	
	
	// ЕдиницаИзмерения.
	Массив.Добавить(Тип("СправочникСсылка.ЕдиницыИзмерения"));
	Массив.Добавить(Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив, ,);
	Массив.Очистить();
	
	ТаблицаНоменклатуры.Колонки.Добавить("ЕдиницаИзмерения", ОписаниеТипов);	
	
	// Коэффициент.
	Массив.Добавить(Тип("Число"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив, ,);
	Массив.Очистить();
	
	ТаблицаНоменклатуры.Колонки.Добавить("Коэффициент", ОписаниеТипов);
	
	Для каждого СтрокаТЧ Из ТабличнаяЧастьДокумента Цикл
		
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура	 = СтрокаТЧ.Номенклатура;
		//НоваяСтрока.Характеристика	 = СтрокаТЧ.Характеристика;
		НоваяСтрока.ЕдиницаИзмерения = СтрокаТЧ.ЕдиницаИзмерения;
		НоваяСтрока.СтавкаНДС		 = СтрокаТЧ.СтавкаНДС;
		
		Если ТипЗнч(СтрокаТЧ.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			НоваяСтрока.Коэффициент = 1;
		Иначе
			НоваяСтрока.Коэффициент = СтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура,
	//|	ТаблицаНоменклатуры.Характеристика,
	|	ТаблицаНоменклатуры.ЕдиницаИзмерения,
	|	ТаблицаНоменклатуры.СтавкаНДС,
	|	ТаблицаНоменклатуры.Коэффициент
	|ПОМЕСТИТЬ ВременнаяТаблицаНоменклатуры
	|ИЗ
	|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры";
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	Запрос.Выполнить();
	
	// 2. Заполним цены.
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	//
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	////|	ТаблицаНоменклатуры.Характеристика КАК Характеристика,
	//|	ТаблицаНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	ТаблицаНоменклатуры.СтавкаНДС КАК СтавкаНДС
	////|	ЦеныНоменклатурыКонтрагентовСрезПоследних.ВидЦенКонтрагента.ВалютаЦены КАК ЦеныНоменклатурыВалюта,
	////|	ЦеныНоменклатурыКонтрагентовСрезПоследних.ВидЦенКонтрагента.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	////|	ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена * КурсВалютыВидЦен.Курс * КурсВалютыДокумента.Кратность / (КурсВалютыДокумента.Курс * КурсВалютыВидЦен.Кратность) * ЕСТЬNULL(ТаблицаНоменклатуры.Коэффициент, 1) / ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1), 0) КАК Цена
	//|ИЗ
	//|	ВременнаяТаблицаНоменклатуры КАК ТаблицаНоменклатуры";
	////|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаОбработки, ВидЦенКонтрагента = &ВидЦенКонтрагента) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	////|		ПО ТаблицаНоменклатуры.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	////|			И ТаблицаНоменклатуры.Характеристика = ЦеныНоменклатурыКонтрагентовСрезПоследних.Характеристика
	////|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОбработки, ) КАК КурсВалютыВидЦен
	////|		ПО (ЦеныНоменклатурыКонтрагентовСрезПоследних.ВидЦенКонтрагента.ВалютаЦены = КурсВалютыВидЦен.Валюта),
	////|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОбработки, Валюта = &ВалютаДокумента) КАК КурсВалютыДокумента
	////|ГДЕ
	////|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Актуальность";
	//	
	//Запрос.УстановитьПараметр("ДатаОбработки", 		СтруктураДанных.Дата);
	////Запрос.УстановитьПараметр("ВидЦенКонтрагента",	СтруктураДанных.ВидЦенКонтрагента);
	//Запрос.УстановитьПараметр("ВалютаДокумента", 	СтруктураДанных.ВалютаДокумента);
	//
	//ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	//Для каждого СтрокаТабЧасти Из ТабличнаяЧастьДокумента Цикл
	//	
	//	СтруктураПоиска = Новый Структура;
	//	СтруктураПоиска.Вставить("Номенклатура",	 СтрокаТабЧасти.Номенклатура);
	//	//СтруктураПоиска.Вставить("Характеристика",	 СтрокаТабЧасти.Характеристика);
	//	СтруктураПоиска.Вставить("ЕдиницаИзмерения", СтрокаТабЧасти.ЕдиницаИзмерения);
	//	СтруктураПоиска.Вставить("СтавкаНДС",		 СтрокаТабЧасти.СтавкаНДС);
	//	
	//	РезультатПоиска = ТаблицаЦен.НайтиСтроки(СтруктураПоиска);
	//	Если РезультатПоиска.Количество() > 0 Тогда
	//		
	//		Цена = РезультатПоиска[0].Цена;
	//		Если Цена = 0 Тогда
	//			СтрокаТабЧасти.Цена = Цена;
	//		Иначе
	//			
	//			// Учитываем: сумма включает НДС.
	//			Если (СтруктураДанных.СуммаВключаетНДС И Не РезультатПоиска[0].ЦенаВключаетНДС) 
	//				ИЛИ (Не СтруктураДанных.СуммаВключаетНДС И РезультатПоиска[0].ЦенаВключаетНДС) Тогда
	//				Цена = ПересчитатьСуммуПриИзмененииФлаговНДС(Цена, СтруктураДанных.СуммаВключаетНДС, СтрокаТабЧасти.СтавкаНДС);
	//			КонецЕсли;
	//			
	//			СтрокаТабЧасти.Цена = Цена;
	//			
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры     

&НаСервере
Функция ПересчитатьСуммуПриИзмененииФлаговНДС(Сумма, СуммаВключаетНДС, СтавкаНДС) Экспорт
	
	Ставка = СтавкаНДС.Ставка;
	
	Если СуммаВключаетНДС Тогда
		
		Сумма = (Сумма * (100 + Ставка)) / 100;
		
	Иначе
		
		Сумма = (Сумма * 100) / (100 + Ставка);
		
	КонецЕсли;
	
	Возврат Сумма;
	
КонецФункции

&НаКлиенте
Процедура ДополнительныеРасходыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ДополнительныеРасходы.ТекущиеДанные;
	
	Если УчитыватьДополнительныеЗатратыВПроизводстве Тогда 
		
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
		
		РассчитатьСуммуНДС(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
		СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.СуммаНДС;
		
	КонецЕсли;
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	УИД_Строки = СтрокаТабличнойЧасти.ПолучитьИдентификатор();
	СтуктураЗаполнения = ПолучитьСтавкиНаСервере(УИД_Строки);
	СтрокаТабличнойЧасти.СуммаНДФЛ = СтуктураЗаполнения.СуммаНДФЛ;
	СтрокаТабличнойЧасти.СуммаПФ = СтуктураЗаполнения.СуммаПФ;  
	
	СтрокаТабличнойЧасти.СуммаНДС = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.СуммаПФ - СтрокаТабличнойЧасти.СуммаНДФЛ)-(СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.СуммаПФ - СтрокаТабличнойЧасти.СуммаНДФЛ)/(1 + (СтавкаНДС/100));
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена + СтрокаТабличнойЧасти.СуммаНДФЛ + СтрокаТабличнойЧасти.СуммаПФ;
	СтрокаТабличнойЧасти.СуммаБезНалогов = СтрокаТабличнойЧасти.Всего - СтрокаТабличнойЧасти.СуммаНДФЛ - СтрокаТабличнойЧасти.СуммаПФ - СтрокаТабличнойЧасти.СуммаНДС;
	
КонецПроцедуры


//--- Дмгг, ONESOFT-2638

#КонецОбласти
// © Шишка В.В. [23 декабря 2023]  КОНЕЦ
//--------------------------------------------------------------------------

//ПодольскийАИ #УчетПроектов 03.10.2020 }

//&НаСервере
//Процедура УстановитьВидимостьКнопки_ЗаполнитьКолонкуОС()
//	
//	ЭтоПеремещениеНаОС = Объект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС;
//	
//	Элементы.ЗапасыЗаполнитьКолонкуОС.Видимость = ЭтоПеремещениеНаОС;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьКолонкуОС(Команда)
//	ФормаВыбораОС = ПолучитьФорму("Справочник.ВнеоборотныеАктивы.ФормаВыбора",,Этаформа);
//	ФормаВыбораОС.Открыть();
//КонецПроцедуры
// Конец ЗагрузкаДанныхИзВнешнегоИсточника


