
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	ХЗНастройкиОбмена = Константы.НастройкиОбменаСДаннымиОПосещенииСотрудников.Получить();
	УстановитьПривилегированныйРежим(Истина);
	Если ХЗНастройкиОбмена <> Неопределено И ТипЗнч(ХЗНастройкиОбмена) = Тип("ХранилищеЗначения") Тогда
	
		НастройкиОбмена = ХЗНастройкиОбмена.Получить();
		Если ТипЗнч(НастройкиОбмена) = Тип("Структура") Тогда
		
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОбмена);	
		
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	ТекстВопроса = НСтр("ka='Сохранить настройки?';ru='Сохранить настройки?';en='Сохранить настройки?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("СохранитьНастройкиЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
	
		СтруктураНастроек = Новый Структура("ПутьКФайлу, Организация", ПутьКФайлу, Организация);
		СохранитьНастройкиОбмена(СтруктураНастроек);
	
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкиОбмена(СтруктураНастроек)

	УстановитьПривилегированныйРежим(Истина);
	Константы.НастройкиОбменаСДаннымиОПосещенииСотрудников.Установить(Новый ХранилищеЗначения(СтруктураНастроек, Новый СжатиеДанных(9)));
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры // СохранитьНастройкиОбмена()

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = НСтр("ka='Выберите файл загрузки';ru='Выберите файл загрузки';en=""Выберите файл загрузки""");
	Диалог.ПолноеИмяФайла = ПутьКФайлу;
	Каталог = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПутьКФайлу);
	Диалог.Каталог = Каталог.Путь;
	Фильтр = НСтр("ka='Файл Excel (*.xls)|*.xls';ru='Файл Excel (*.xls)|*.xls';en='Excel file (* .xls) | * .xls'");
	Диалог.Фильтр = Фильтр;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Показать(Новый ОписаниеОповещения("ВыбратьФайлExcelЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлExcelЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено
		И ТипЗнч(Результат) = Тип("Массив")
		Тогда
	
		Файл = Новый Файл(Результат[0]);
		Если Файл.Существует() Тогда
		
			ПутьКФайлу = Результат[0];	
		
		Иначе
		
			ТекстПредупреждения = НСтр("ka='Файл ';ru='Файл ';en='Файл '") + Результат[0] + НСтр("ka=' не найден';ru=' не найден';en=' не найден'");
			ПоказатьПредупреждение(, ТекстПредупреждения);	
		
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры

 

