#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтефейс

// Перезаполняет ТЧ Запасы на основании ТЧ РасшифровкаБиллинга.
//
// Параметры:
//  СчетНаОплату - Структура, СправочникОбъект - Объект документа СчетНаОплату.
//
Процедура ПерезаполнитьЗапасыПоРасшифровкеБиллинга(СчетНаОплату) Экспорт
	
	СчетНаОплату.Запасы.Очистить();
	
	РасшифровкаЗапасов = СчетНаОплату.РасшифровкаБиллинга.Выгрузить();
	РасшифровкаЗапасов.Колонки.Добавить("ПредставлениеВСчетеЕдиницаИзмерения", 
		Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения,СправочникСсылка.КлассификаторЕдиницИзмерения")
	);
	
	ЕстьНезаполненныеСтрокиВРасшифровке = Ложь;
	Для каждого Стр Из РасшифровкаЗапасов Цикл
		
		Если Стр.Количество = 0
			ИЛИ Стр.Цена = 0
			ИЛИ Стр.Сумма = 0
			ИЛИ ТипЗнч(Стр.ОбъектДоговораОбслуживания) = Тип("ПланСчетовСсылка.Управленческий") 
				И НЕ ЗначениеЗаполнено(Стр.ПредставлениеВСчете) Тогда
			
			ЕстьНезаполненныеСтрокиВРасшифровке = Истина;
			Прервать;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Стр.ПредставлениеВСчете) Тогда
			Стр.ПредставлениеВСчете = Стр.ОбъектДоговораОбслуживания;
			Стр.ПредставлениеВСчетеЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
		Иначе
			Стр.ПредставлениеВСчетеЕдиницаИзмерения = Стр.ПредставлениеВСчете.ЕдиницаИзмерения;
			Стр.Характеристика = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьНезаполненныеСтрокиВРасшифровке Тогда
		Возврат;
	КонецЕсли;
	
	РасшифровкаЗапасов.Свернуть("ПредставлениеВСчете,ПредставлениеВСчетеЕдиницаИзмерения,Характеристика", "Количество,Сумма");
	
	Для каждого Стр Из РасшифровкаЗапасов Цикл
		
		НоваяСтрока = СчетНаОплату.Запасы.Добавить();
		НоваяСтрока.Номенклатура     = Стр.ПредставлениеВСчете;
		НоваяСтрока.Характеристика   = Стр.Характеристика;
		НоваяСтрока.ЕдиницаИзмерения = Стр.ПредставлениеВСчетеЕдиницаИзмерения;
		НоваяСтрока.Количество       = Стр.Количество;
		НоваяСтрока.Цена             = Стр.Сумма / Стр.Количество;
		НоваяСтрока.Сумма            = Стр.Сумма;
		
		СтруктураДанные = Новый Структура();
		
		СтруктураДанные.Вставить("Организация",      СчетНаОплату.Организация);
		СтруктураДанные.Вставить("ДатаОбработки",    СчетНаОплату.Дата);
		СтруктураДанные.Вставить("ВидЦен",           СчетНаОплату.ВидЦен);
		СтруктураДанные.Вставить("ВалютаДокумента",  СчетНаОплату.ВалютаДокумента);
		СтруктураДанные.Вставить("СуммаВключаетНДС", СчетНаОплату.СуммаВключаетНДС);
		СтруктураДанные.Вставить("Номенклатура",     НоваяСтрока.Номенклатура);
		СтруктураДанные.Вставить("Характеристика",   Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		СтруктураДанные.Вставить("Коэффициент",      1);
		СтруктураДанные.Вставить("НалогообложениеНДС", СчетНаОплату.НалогообложениеНДС);
		СтруктураДанные.Вставить("ВидСкидкиНаценки", СчетНаОплату.ВидСкидкиНаценки);
		
		// ДисконтныеКарты
		СтруктураДанные.Вставить("ДисконтнаяКарта", СчетНаОплату.ДисконтнаяКарта);
		СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", СчетНаОплату.ПроцентСкидкиПоДисконтнойКарте);		
		// Конец ДисконтныеКарты
		
		СтруктураДанные = РаботаСФормойДокумента.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		
		НоваяСтрока.ПроцентСкидкиНаценки = СтруктураДанные.ПроцентСкидкиНаценки;
		НоваяСтрока.СтавкаНДС = СтруктураДанные.СтавкаНДС;
		НоваяСтрока.Содержание = "";
		
		Если НоваяСтрока.ПроцентСкидкиНаценки = 100 Тогда
			НоваяСтрока.Сумма = 0;
		ИначеЕсли НоваяСтрока.ПроцентСкидкиНаценки <> 0
				И НоваяСтрока.Количество <> 0 Тогда
			НоваяСтрока.Сумма = НоваяСтрока.Сумма * (1 - НоваяСтрока.ПроцентСкидкиНаценки / 100);
		КонецЕсли;
		
		СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
		
		НоваяСтрока.СуммаНДС = ?(СчетНаОплату.СуммаВключаетНДС, 
										  НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДС + 100) / 100),
										  НоваяСтрока.Сумма * СтавкаНДС / 100);
		
		НоваяСтрока.Всего = НоваяСтрока.Сумма + ?(СчетНаОплату.СуммаВключаетНДС, 0, НоваяСтрока.СуммаНДС);
		
		// АвтоматическиеСкидки.
		НоваяСтрока.ПроцентАвтоматическойСкидки = 0;
		НоваяСтрока.СуммаАвтоматическойСкидки = 0;
		// Конец АвтоматическиеСкидки
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет ТЧ РасшифровкаБиллинга на основании ТЧ Запасы.
// Используется при вводе на основании.
//
Процедура ЗаполнитьРасшифровкуБиллинга(СчетНаОплату) Экспорт
	
	СчетНаОплату.РасшифровкаБиллинга.Очистить();
	Для каждого Стр Из СчетНаОплату.Запасы Цикл
		
		НоваяСтрока = СчетНаОплату.РасшифровкаБиллинга.Добавить();
		НоваяСтрока.ОбъектДоговораОбслуживания = Стр.Номенклатура;
		НоваяСтрока.Характеристика             = Стр.Характеристика;
		НоваяСтрока.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
		НоваяСтрока.Количество       = Стр.Количество;
		НоваяСтрока.Цена             = Стр.Цена;
		НоваяСтрока.Сумма            = Стр.Цена * Стр.Количество;
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет во временную таблицу все позиции таблицы "Запасы"
//
// Параметры:
//  СчетаНаОплату                  - ДокументСсылка.СчетНаОплату, Массив
// 
// Возвращаемое значение:
//   - МенеджерВременныхТаблиц
//
Функция ВТСчетНаОплатуЗапасы(Знач СчетаНаОплату) Экспорт
	
	Если ТипЗнч(СчетаНаОплату) <> Тип("Массив") Тогда
		СчетаНаОплату = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СчетаНаОплату);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СчетНаОплатуЗапасы.Ссылка,
	|	СчетНаОплатуЗапасы.Номенклатура,
	|	СчетНаОплатуЗапасы.СтавкаНДС,
	|	СчетНаОплатуЗапасы.СуммаНДС,
	|	СчетНаОплатуЗапасы.Всего
	|ПОМЕСТИТЬ ВТСчетНаОплатуЗапасы
	|ИЗ
	|	Документ.СчетНаОплату.Запасы КАК СчетНаОплатуЗапасы
	|ГДЕ
	|	СчетНаОплатуЗапасы.Ссылка В(&СчетаНаОплату)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетНаОплату.Ссылка,
	|	СчетНаОплату.НоменклатураДоставки,
	|	СчетНаОплату.СтавкаНДСДоставки,
	|	СчетНаОплату.СуммаНДСДоставки,
	|	СчетНаОплату.СтоимостьДоставки
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплату
	|ГДЕ
	|	СчетНаОплату.Ссылка В(&СчетаНаОплату)
	|	И СчетНаОплату.НоменклатураДоставки <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)");
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СчетаНаОплату", СчетаНаОплату);
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура формирования таблицы платежного календаря.
//
// Параметры:
//	ДокументСсылка - ДокументСсылка.ПриходДенежныхСредствПлан - Текущий документ
//	ДополнительныеСвойства - ДополнительныеСвойства - Дополнительные свойства документа
//
Процедура СформироватьТаблицаПлатежныйКалендарь(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.ДатаОплаты КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.ТипДенежныхСредств,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыУтвержденияПлатежей.Утвержден) КАК СтатусУтвержденияПлатежа,
	|	ТаблицаДокумента.Ссылка КАК СчетНаОплату,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей) КАК Статья,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|			ТОГДА ТаблицаДокумента.Ссылка.Касса
	|		КОГДА ТаблицаДокумента.Ссылка.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|			ТОГДА ТаблицаДокумента.Ссылка.БанковскийСчет
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Договор.РасчетыВУсловныхЕдиницах
	|			ТОГДА ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.ВалютаДокумента
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Договор.РасчетыВУсловныхЕдиницах
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.СуммаОплаты * ВЫБОР
	|						КОГДА КурсыВалютРасчетов.Курс <> 0
	|								И КурсыВалютДокумента.Кратность <> 0
	|							ТОГДА КурсыВалютДокумента.Курс * КурсыВалютРасчетов.Кратность / (ЕСТЬNULL(КурсыВалютРасчетов.Курс, 1) * ЕСТЬNULL(КурсыВалютДокумента.Кратность, 1))
	|						ИНАЧЕ 1
	|					КОНЕЦ КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ТаблицаДокумента.СуммаОплаты
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	Документ.СчетНаОплату.ПлатежныйКалендарь КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютДокумента
	|		ПО ТаблицаДокумента.Ссылка.ВалютаДокумента = КурсыВалютДокумента.Валюта
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлатежныйКалендарь", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПлатежныйКалендарь()

// Процедура формирования таблицы счетов на оплату.
//
// Параметры:
//	ДокументСсылка - ДокументСсылка.ПриходДенежныхСредствПлан - Текущий документ
//	ДополнительныеСвойства - ДополнительныеСвойства - Дополнительные свойства документа
//
Процедура СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Ссылка КАК СчетНаОплату,
	|	ТаблицаДокумента.СуммаДокумента КАК Сумма
	|ИЗ
	|	Документ.СчетНаОплату КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Контрагент.ВестиУчетОплатыПоСчетам
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.СуммаДокумента <> 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОплатаСчетовИЗаказов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаОплатаСчетовИЗаказов()

// Формирует таблицу данных документа.
//
// Параметры:
//	ДокументСсылка - ДокументСсылка.ПриходДенежныхСредствПлан - Текущий документ
//	СтруктураДополнительныеСвойства - ДополнительныеСвойства - Дополнительные свойства документа
//	
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	СформироватьТаблицаПлатежныйКалендарь(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область ЗагрузкаДанныхИзВнешнегоИсточника

Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Штрихкод", "Штрихкод", ОписаниеТиповСтрока200, ОписаниеТиповКолонка, "Номенклатура", 1, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Артикул", "Артикул", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование", "Номенклатура (наименование)", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Номенклатура", 3, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименованиеПолное","Номенклатура (полное наименование)", ОписаниеТиповСтрока1000, ОписаниеТиповКолонка, "Номенклатура", 5, , Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Содержание", "Содержание", ОписаниеТиповСтрока1000, ОписаниеТиповСтрока1000, , , , , НастройкиЗагрузкиДанных.СодержаниеВидимо);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Характеристика", "Характеристика (наименование)", ОписаниеТиповСтрока150, ОписаниеТиповКолонка);
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Партия", "Партия (наименование)", ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
		
	КонецЕсли;
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Количество", "Количество", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , Истина);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения, СправочникСсылка.ЕдиницыИзмерения");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ЕдиницаИзмерения", "Ед. изм.", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, , , , , ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения"));
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Цена", "Цена", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Истина);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СтавкаНДС", "Ставка НДС", ОписаниеТиповСтрока50, ОписаниеТиповКолонка);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СуммаНДС", "Сумма НДС", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2);
	
КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_mxl", "ОбразецЗагрузкиДанных_mxl");
	
	Образец_csv = ПолучитьМакет("ОбразецЗагрузкиДанных_csv");
	ОбразецЗагрузкиДанных_csv = ПоместитьВоВременноеХранилище(Образец_csv, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_csv", ОбразецЗагрузкиДанных_csv);
	
КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ТаблицаСопоставленияДанных, НастройкиЗагрузкиДанных) Экспорт
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Артикул, СтрокаТаблицыФормы.НоменклатураНаименование, СтрокаТаблицыФормы.НоменклатураНаименованиеПолное);
		
		// Содержание
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Содержание, СтрокаТаблицыФормы.Содержание_ВходящиеДанные);
		
		// Характеристика по Владельцу и Наименованию
		Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
			
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
				
				ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьХарактеристику(СтрокаТаблицыФормы.Характеристика, СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Характеристика_ВходящиеДанные);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Партия по Владельцу и Наименованию
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
			
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
				
				ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьПартию(СтрокаТаблицыФормы.Партия, СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Партия_ВходящиеДанные);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Количество
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Количество, СтрокаТаблицыФормы.Количество_ВходящиеДанные, 1);
		
		// ЕдиницыИзмерения по Наименованию (так же рассмотреть возможность прикрутить пользовательские ЕИ)
		ЗначениеПоУмолчанию = ?(ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура), СтрокаТаблицыФормы.Номенклатура.ЕдиницаИзмерения, Справочники.КлассификаторЕдиницИзмерения.шт);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЕдиницыИзмерения(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.ЕдиницаИзмерения, СтрокаТаблицыФормы.ЕдиницаИзмерения_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// Цена
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Цена, СтрокаТаблицыФормы.Цена_ВходящиеДанные, 1);
		
		// СтавкаНДС по наименованию
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСтавкуНДС(СтрокаТаблицыФормы.СтавкаНДС, СтрокаТаблицыФормы.СтавкаНДС_ВходящиеДанные, Неопределено);
		
		// СуммаНДС
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.СуммаНДС, СтрокаТаблицыФормы.СуммаНДС_ВходящиеДанные, 0);
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура)
		И (СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас 
			ИЛИ СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга)
		И СтрокаТаблицыФормы.Количество <> 0;
	
КонецПроцедуры

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

Функция УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов, ИспользоватьФаксимиле)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ИспользоватьФаксимиле", ИспользоватьФаксимиле);
	
	Запрос.Текст = 
	"
	//:::Шапка
	|Выбрать
	|	СчетНаОплату.Ссылка КАК Ссылка
	|	,СчетНаОплату.Дата КАК ДатаДокумента
	|	,СчетНаОплату.Номер КАК Номер
	|	,СчетНаОплату.Организация КАК Организация
	|	,СчетНаОплату.Организация.Префикс КАК Префикс
	|	,СчетНаОплату.Организация.ФайлЛоготип КАК ФайлЛоготип
	|	,СчетНаОплату.Организация.ФайлФаксимильнаяПечать КАК ФаксимилеПечати
	|	,СчетНаОплату.Подразделение
	|	,Выбор когда &ИспользоватьФаксимиле = Истина 
	|		Тогда Значение(Перечисление.ДаНет.Да)
	|		Иначе Значение(Перечисление.ДаНет.Нет) Конец КАК ИспользоватьФаксимиле
	|	,СчетНаОплату.ПодписьРуководителя.Должность КАК ДолжностьРуководителя
	|	,СчетНаОплату.ПодписьРуководителя.РасшифровкаПодписи КАК РасшифровкаПодписиРуководителя
	|	,СчетНаОплату.ПодписьРуководителя.РасшифровкаПодписи КАК РасшифровкаПодписиВыполнилРаботыУслуги
	|	,СчетНаОплату.ПодписьРуководителя.Факсимиле КАК ФаксимилеРуководителя
	|	,СчетНаОплату.ПодписьГлавногоБухгалтера.Должность КАК ДолжностьГлавногоБухгалтера
	|	,СчетНаОплату.ПодписьГлавногоБухгалтера.РасшифровкаПодписи КАК РасшифровкаПодписиГлавногоБухгалтера
	|	,СчетНаОплату.ПодписьГлавногоБухгалтера.Факсимиле КАК ФаксимилеГлавногоБухгалтера
	|	,СчетНаОплату.БанковскийСчет КАК БанковскийСчет
	|	,СчетНаОплату.СуммаВключаетНДС КАК СуммаВключаетНДС
	|	,СчетНаОплату.ВалютаДокумента КАК ВалютаДокумента
	|	,СчетНаОплату.Контрагент КАК Контрагент
	|	,СчетНаОплату.Договор
	|	,СчетНаОплату.УсловияСчетаЗаказа КАК ДополнительныеУсловия
	|	,СчетНаОплату.ДокументОснование
	|	,СчетНаОплату.Ответственный
	|	,СчетНаОплату.Автор
	|	,СчетНаОплату.ДисконтнаяКарта
	|	,СчетНаОплату.ПроцентСкидкиПоДисконтнойКарте
	|	,СчетНаОплату.Комментарий КАК Комментарий
	|	,СчетНаОплату.ОснованиеПечати КАК ОснованиеПечати
	|	,СчетНаОплату.ОснованиеПечатиСсылка КАК ОснованиеПечатиСсылка
	|	,ЛОЖЬ КАК ОжидаетсяВыборВариантаКП
	|	,СчетНаОплату.Вес
	|	,СчетНаОплату.Объем
	|	,СчетНаОплату.НоменклатураДоставки
	|	,ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(СчетНаОплату.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			ТОГДА СчетНаОплату.НоменклатураДоставки.Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(СчетНаОплату.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000))
	|	КОНЕЦ КАК ПредставлениеНоменклатурыДоставки
	|	,СчетНаОплату.НоменклатураДоставки.Артикул КАК АртикулДоставки
	|	,СчетНаОплату.НоменклатураДоставки.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДоставки
	|	,СчетНаОплату.СтоимостьДоставки
	|	,СчетНаОплату.СуммаНДСДоставки
	|
	//:::Табличная часть "Запасы"
	|	,СчетНаОплату.Запасы.(
	|		НомерСтроки КАК НомерСтроки
	|		,Выбор когда (Выразить(СчетНаОплату.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			Тогда СчетНаОплату.Запасы.Номенклатура.Наименование
	|			Иначе Выразить(СчетНаОплату.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) Конец КАК ПредставлениеНоменклатуры
	|		,Характеристика
	|		,Номенклатура.Артикул КАК Артикул
	|		,ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|		,Цена КАК Цена
	|		,Сумма КАК Сумма
	|		,СуммаНДС КАК СуммаНДС
	|		,Всего КАК Всего
	|		,Количество КАК Количество
	|		,Вес КАК Вес
	|		,Объем КАК Объем
	|		,Содержание
	|		,ПроцентСкидкиНаценки
	|		,Выбор когда СчетНаОплату.Запасы.ПроцентСкидкиНаценки <> 0
	|					ИЛИ СчетНаОплату.Запасы.СуммаАвтоматическойСкидки <> 0
	|			Тогда 1
	|			Иначе 0 Конец КАК ЕстьСкидка
	|		,СуммаАвтоматическойСкидки
	|		,Ложь КАК ЭтоРазделитель
	|	) КАК ТаблицаЗапасы
	|
	//:::Табличная часть "Платежный календарь"
	|	,СчетНаОплату.ПлатежныйКалендарь.(
	|		ПроцентОплаты
	|		,СуммаОплаты
	|		,СуммаНДСОплаты
	|	) КАК ТаблицаПланаОплат
	|
	|Из Документ.СчетНаОплату КАК СчетНаОплату
	|Где СчетНаОплату.Ссылка В(&МассивОбъектов)
	|Упорядочить по Ссылка, НомерСтроки";
	
	ДанныеДокументов = Запрос.Выполнить().Выгрузить();
	ДоставкаСервер.ДобавитьСтрокуДоставкиУниверсальныеДанные(ДанныеДокументов);
	Возврат ДанныеДокументов;
	
КонецФункции

Функция ПечатьПриложениеКДоговору(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	Перем Ошибки;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплату.Ссылка КАК Ссылка,
	|	СчетНаОплату.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	СчетНаОплату.ВалютаДокумента КАК ВалютаДокумента,
	|	СчетНаОплату.Дата КАК ДатаДокумента,
	|	СчетНаОплату.Номер КАК Номер,
	|	СчетНаОплату.БанковскийСчет КАК БанковскийСчет,
	|	СчетНаОплату.Контрагент КАК Контрагент,
	|	СчетНаОплату.Организация КАК Организация,
	|	СчетНаОплату.Организация.Префикс КАК Префикс,
	|	СчетНаОплату.НоменклатураДоставки,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(СчетНаОплату.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|			ТОГДА СчетНаОплату.НоменклатураДоставки.Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(СчетНаОплату.НоменклатураДоставки.НаименованиеПолное КАК СТРОКА(1000))
	|	КОНЕЦ КАК ЗапасДоставки,
	|	СчетНаОплату.НоменклатураДоставки.Код КАК КодДоставки,
	|	СчетНаОплату.НоменклатураДоставки.Артикул КАК АртикулДоставки,
	|	СчетНаОплату.НоменклатураДоставки.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДоставки,
	|	СчетНаОплату.СтоимостьДоставки,
	|	СчетНаОплату.СуммаНДСДоставки,
	|	СчетНаОплату.Запасы.(
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(СчетНаОплату.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|				ТОГДА СчетНаОплату.Запасы.Номенклатура.Наименование
	|			ИНАЧЕ ВЫРАЗИТЬ(СчетНаОплату.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
	|		КОНЕЦ КАК Запас,
	|		Номенклатура.Артикул КАК Артикул,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		СуммаНДС КАК СуммаНДС,
	|		Всего КАК Всего,
	|		Количество КАК Количество,
	|		Характеристика,
	|		Содержание,
	|		ПроцентСкидкиНаценки,
	|		ВЫБОР
	|			КОГДА СчетНаОплату.Запасы.ПроцентСкидкиНаценки <> 0
	|					ИЛИ СчетНаОплату.Запасы.СуммаАвтоматическойСкидки <> 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЕстьСкидка,
	|		НомерСтроки КАК НомерСтроки,
	|		СуммаАвтоматическойСкидки
	|	),
	|	СчетНаОплату.ПлатежныйКалендарь.(
	|		ПроцентОплаты,
	|		СуммаОплаты,
	|		СуммаНДСОплаты
	|	),
	|	ДоговорыКонтрагентов.Ссылка КАК СсылкаДоговора,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДатаДоговора,
	|	ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплату
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО СчетНаОплату.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	СчетНаОплату.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Шапка.Следующий() Цикл
		
		ПечататьДоставку = ЗначениеЗаполнено(Шапка.НоменклатураДоставки);
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
		ТаблицаПредоплаты = Шапка.ПлатежныйКалендарь.Выгрузить(); 
				
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + ИмяМакета + "_" + ИмяМакета;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СчетНаОплату.ПФ_MXL_" + ИмяМакета);
		
		СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
		СведенияОбКонтрагенте = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.ДатаДокумента);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = "к договору № "
												+ Шапка.НомерДоговора
												+ " от "
												+ Формат(Шапка.ДатаДоговора, "ДЛФ=DD");
												
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.ПредставлениеПолучателя = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбКонтрагенте, "ПолноеНаименование,ИНН,КПП,РегистрационныйНомер,ЮридическийАдрес,Телефоны,");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ЕстьСкидки = Шапка.Запасы.Выгрузить().Итог("ЕстьСкидка") <> 0;
		
		Если ЕстьСкидки Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаСоСкидкой");
			
		Иначе
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			
		КонецЕсли;
		
		Сумма		= 0;
		СуммаНДС	= 0;
		Всего		= 0;
		Количество	= 0;

		ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
		Пока ЕстьДанныеДляВывода ИЛИ ПечататьДоставку Цикл
			
			Если ПечататьДоставку И НЕ ЕстьДанныеДляВывода Тогда
				ПечататьДоставку = Ложь;
				ДанныеСтроки = ДоставкаСервер.ДанныеПечатиДоставки(Шапка);
			Иначе
				ДанныеСтроки = ВыборкаСтрокЗапасы;
			КонецЕсли; 
			
			Количество = Количество + 1;
			ОбластьМакета.Параметры.Заполнить(ДанныеСтроки);
			ОбластьМакета.Параметры.НомерСтроки = Количество;
			
			Если ЗначениеЗаполнено(ДанныеСтроки.Содержание) Тогда
				ОбластьМакета.Параметры.Запас = ДанныеСтроки.Содержание;
			Иначе
				ОбластьМакета.Параметры.Запас = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(ДанныеСтроки.Запас, 
																	ДанныеСтроки.Характеристика, ДанныеСтроки.Артикул);
			КонецЕсли;
						
			Если ЕстьСкидки Тогда
				Если ДанныеСтроки.ПроцентСкидкиНаценки = 100 Тогда
					Скидка = ДанныеСтроки.Цена * ДанныеСтроки.Количество;
					ОбластьМакета.Параметры.Скидка         = Скидка;
					ОбластьМакета.Параметры.СуммаБезСкидки = Скидка;
				ИначеЕсли ДанныеСтроки.ПроцентСкидкиНаценки = 0 И ДанныеСтроки.СуммаАвтоматическойСкидки = 0 Тогда
					ОбластьМакета.Параметры.Скидка         = 0;
					ОбластьМакета.Параметры.СуммаБезСкидки = ДанныеСтроки.Сумма;
				Иначе
					Скидка = ДанныеСтроки.Количество * ДанныеСтроки.Цена - ДанныеСтроки.Сумма; // АвтоматическиеСкидки
					ОбластьМакета.Параметры.Скидка         = Скидка;
					ОбластьМакета.Параметры.СуммаБезСкидки = ДанныеСтроки.Сумма + Скидка;
				КонецЕсли;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Сумма		= Сумма		+ ДанныеСтроки.Сумма;
			СуммаНДС	= СуммаНДС	+ ДанныеСтроки.СуммаНДС;
			Всего		= Всего 	+ ДанныеСтроки.Всего;
			ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Всего = УправлениеНебольшойФирмойСервер.ФорматСумм(Сумма);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
		Если СуммаНДС = 0 Тогда
			
			ОбластьМакета.Параметры.НДС = "Без налога (НДС)";
			ОбластьМакета.Параметры.ВсегоНДС = "-";
			
		Иначе
			
			ОбластьМакета.Параметры.НДС = ?(Шапка.СуммаВключаетНДС, "В том числе НДС:", "Сумма НДС:");
			ОбластьМакета.Параметры.ВсегоНДС = УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаНДС);
			
		КонецЕсли; 
		
		Если ИмяМакета = "СчетНаЧастичнуюОплату" Тогда
			
			Если СуммаНДС = 0 Тогда
				ОбластьМакета.Параметры.НДСкОплате = "Без налога (НДС)";
				ОбластьМакета.Параметры.ВсегоНДСкОплате = "-";
			Иначе
				ОбластьМакета.Параметры.НДСкОплате = ?(Шапка.СуммаВключаетНДС, "В том числе НДС оплаты:", "Сумма НДС оплаты:");
				Если ТаблицаПредоплаты.Итог("ПроцентОплаты") > 0 Тогда
					ОбластьМакета.Параметры.ВсегоНДСкОплате = УправлениеНебольшойФирмойСервер.ФорматСумм(ТаблицаПредоплаты.Итог("СуммаНДСОплаты"));
				Иначе
					ОбластьМакета.Параметры.ВсегоНДСкОплате = "-";
				КонецЕсли;
			КонецЕсли; 
			
			Если ТаблицаПредоплаты.Итог("ПроцентОплаты") > 0 Тогда
				ОбластьМакета.Параметры.ВсегоКОплате = УправлениеНебольшойФирмойСервер.ФорматСумм(ТаблицаПредоплаты.Итог("СуммаОплаты"));
				ОбластьМакета.Параметры.ПроцентОплаты = ТаблицаПредоплаты.Итог("ПроцентОплаты");
			Иначе
				ОбластьМакета.Параметры.ВсегоКОплате = "-";
				ОбластьМакета.Параметры.ПроцентОплаты = "-";
			КонецЕсли;
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если Макет.Области.Найти("ИтогоКОплате") = Неопределено Тогда
			
			ТекстСообщения = НСтр("ka='ყურადღება! მაკეტის არეალი ""სულ გადასახდელად"" არ არის აღმოჩენილი. შეიძლება გამოიყენება სამომხმარებლო მაკეტი.';ru='ВНИМАНИЕ! Не обнаружена область макета ""Итог к оплате"". Возможно используется пользовательский макет.';en='ATTENTION! Not found the layout area ""Bottom line for payment."" Perhaps using a custom layout.'");
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , ТекстСообщения, Неопределено);
			
		Иначе
			
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКОплате");
			ОбластьМакета.Параметры.Заполнить(Новый Структура("ИтогоКОплате", УправлениеНебольшойФирмойСервер.ФорматСумм(Всего)));
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Всего;
		ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего наименований "
												+ Строка(Количество)
												+ ", на сумму "
												+ УправлениеНебольшойФирмойСервер.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента);
		
		ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;

КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "СчетНаОплату");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьСчетНаОплату.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьСчетНаОплату.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьСчетНаОплату.ПредставлениеПФ(Ложь, Ложь);
		
		ДанныеОбъектовПечати = УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов, Ложь);
		Обработки.ПечатьСчетНаОплату.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати, Ложь);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "СчетНаОплатуСФаксимиле");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьСчетНаОплату.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьСчетНаОплату.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьСчетНаОплату.ПредставлениеПФ(Ложь, Истина);
		
		ДанныеОбъектовПечати = УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов, Истина);
		Обработки.ПечатьСчетНаОплату.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати, Ложь);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "СчетНаЧастичнуюОплату");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьСчетНаОплату.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьСчетНаОплату.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьСчетНаОплату.ПредставлениеПФ(Истина, Ложь);
		
		ДанныеОбъектовПечати = УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов, Ложь);
		Обработки.ПечатьСчетНаОплату.УчестьОсобенностиЧастичнойОплаты(ДанныеОбъектовПечати);
		Обработки.ПечатьСчетНаОплату.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати, Истина);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "СчетНаЧастичнуюОплатуСФаксимиле");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьСчетНаОплату.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьСчетНаОплату.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьСчетНаОплату.ПредставлениеПФ(Истина, Истина);
		
		ДанныеОбъектовПечати = УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов, Истина);
		Обработки.ПечатьСчетНаОплату.УчестьОсобенностиЧастичнойОплаты(ДанныеОбъектовПечати);
		Обработки.ПечатьСчетНаОплату.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати, Истина);
		
	КонецЕсли;
	
	//Паганини_
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Invoice Geo") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Invoice Geo", "Invoice Geo", НапечататьInvoice(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;//_Паганини
	
	//T
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Invoice Eng") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Invoice Eng", "Invoice Eng", НапечататьInvoiceEng(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
	
	//N
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Invoice Rus") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Invoice Rus", "Invoice Rus", НапечататьInvoiceRus(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
	// Приложение к договору
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриложениеКДоговору") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПриложениеКДоговору", "Приложение к договору", ПечатьПриложениеКДоговору(МассивОбъектов, ОбъектыПечати, "ПриложениеКДоговору"));
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список команд печати Заказа покупателя
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//Паганини_
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "Invoice Geo";
	КомандаПечати.Представление 					= "Invoice Geo";
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок 							= 1;//_Паганини
	
	
	//T
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "Invoice Eng";
	КомандаПечати.Представление 					= "Invoice Eng";
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок 							= 1;
	
	//N
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 					= "Invoice Rus";
	КомандаПечати.Представление 					= "Invoice Rus";
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.Порядок 							= 1;

	
	// Счет на оплату
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетНаОплату";
	КомандаПечати.Представление = Обработки.ПечатьСчетНаОплату.ПредставлениеПФ(Ложь, Ложь);
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПредложитьЗаполнитьРеквизитыОрганизации";
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетНаОплатуСфаксимиле";
	КомандаПечати.Представление = Обработки.ПечатьСчетНаОплату.ПредставлениеПФ(Ложь, Истина);
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПредложитьЗаполнитьРеквизитыОрганизации";
	КомандаПечати.Порядок = 1;
	
	// Счет на оплату (частичная оплата)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетНаЧастичнуюОплату";
	КомандаПечати.Представление = Обработки.ПечатьСчетНаОплату.ПредставлениеПФ(Истина, Ложь);
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.ФункциональныеОпции = "ПлатежныйКалендарь";
	КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПредложитьЗаполнитьРеквизитыОрганизации";
	КомандаПечати.Порядок = 4;
	
	// Счет на оплату (частичная оплата)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетНаЧастичнуюОплатуСФаксимиле";
	КомандаПечати.Представление = Обработки.ПечатьСчетНаОплату.ПредставлениеПФ(Истина, Истина);
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.ФункциональныеОпции = "ПлатежныйКалендарь";
	КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПредложитьЗаполнитьРеквизитыОрганизации";
	КомандаПечати.Порядок = 4;
	
	// Договор
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеНебольшойФирмойКлиент.СформироватьБланкиДоговоров";
	КомандаПечати.Идентификатор = "БланкДоговора";
	КомандаПечати.Представление = НСтр("ka='ხელშეკრულების ფორმა';ru='Форма договора';en='Form of contract'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаСпискаДокументов";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 7;
	
	// Приложение к договору
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПриложениеКДоговору";
	КомандаПечати.Представление = НСтр("ka='ხელშეკრულების დანართი';ru='Приложение к договору';en='Annex to a contract'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаСпискаДокументов";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 10;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Конверт";
	КомандаПечати.Представление = НСтр("ka='კონვერტი';ru='Конверт';en='The envelope'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаСпискаДокументов";
	КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПечатьКонверта";
	КомандаПечати.Порядок = 14;
	
КонецПроцедуры

//Паганини_
Функция НапечататьInvoice(МассивОбъектов, ОбъектыПечати)

	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Invoice";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплату_Invoice";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуЗапасы.Ссылка КАК Документ,
		|	СчетНаОплатуЗапасы.Ссылка.Дата КАК Дата,
		|	СчетНаОплатуЗапасы.Ссылка.Номер КАК Номер,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(СчетНаОплатуЗапасы.Ссылка.Организация.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА СчетНаОплатуЗапасы.Ссылка.Организация.Наименование
		|		ИНАЧЕ СчетНаОплатуЗапасы.Ссылка.Организация.НаименованиеПолное
		|	КОНЕЦ КАК Продавец,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(СчетНаОплатуЗапасы.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА СчетНаОплатуЗапасы.Ссылка.Контрагент.Наименование
		|		ИНАЧЕ СчетНаОплатуЗапасы.Ссылка.Контрагент.НаименованиеПолное
		|	КОНЕЦ КАК Покупатель,
		|	СчетНаОплатуЗапасы.Ссылка.Договор КАК Договор,
		|	СчетНаОплатуЗапасы.Ссылка.СуммаДокумента КАК Сумма,
		|	СчетНаОплатуЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
		|	СчетНаОплатуЗапасы.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(СчетНаОплатуЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА СчетНаОплатуЗапасы.Номенклатура.Наименование
		|		ИНАЧЕ СчетНаОплатуЗапасы.Номенклатура.НаименованиеПолное
		|	КОНЕЦ КАК Номенклатура,
		|	СчетНаОплатуЗапасы.Характеристика КАК Характеристика,
		|	СчетНаОплатуЗапасы.Количество КАК Количество,
		|	СчетНаОплатуЗапасы.Цена КАК Цена,
		|	СчетНаОплатуЗапасы.СуммаНДС КАК СуммаНДС,
		|	СчетНаОплатуЗапасы.Всего КАК Всего,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.НомерСчета КАК БанковскийСчет,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Код КАК БанкКод,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Наименование КАК Банк,
		|	СчетНаОплатуЗапасы.Ссылка.Контрагент.ИНН КАК ПокупательИНН,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.ИНН КАК ПродавецИНН,
		|	СчетНаОплатуЗапасы.Ссылка.Ответственный.Физлицо КАК Ответственный,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.ФайлЛоготип КАК ФайлЛоготип,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.ФайлФаксимильнаяПечать КАК ФайлФаксимильнаяПечать,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.ФайлПечати КАК ФайлПечати,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо КАК Руководитель
		|ИЗ
		|	Документ.СчетНаОплату.Запасы КАК СчетНаОплатуЗапасы
		|ГДЕ
		|	СчетНаОплатуЗапасы.Ссылка В(&МассивОбъектов)
		|ИТОГИ
		|	МАКСИМУМ(Продавец),
		|	МАКСИМУМ(Покупатель),
		|	КОЛИЧЕСТВО(НомерСтроки),
		|	СУММА(СуммаНДС),
		|	СУММА(Всего),
		|	МАКСИМУМ(БанковскийСчет)
		|ПО
		|	Документ";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		МакетПечатнойФормы	= УправлениеПечатью.МакетПечатнойФормы("Документ.СчетНаОплату.ПФ_MXL_Invoice");//ПолучитьМакет("ПФ_MXL_Invoice");
		
		// Вывод шапки для документа
		ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка");
		ОбластьШапки.Параметры.Заполнить(ВыборкаДокумент);
		Попытка
			ОбластьШапки.Параметры.Дата	= Формат(ВыборкаДокумент.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлЛоготип) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлЛоготип);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьШапки.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапки);
				
		// Вывод таблицной части
		ВыборкаДанныхДокумента = ВыборкаДокумент.Выбрать();
		ОбластьСтрока = МакетПечатнойФормы.ПолучитьОбласть("ТабличаяЧасть");
		Пока ВыборкаДанныхДокумента.Следующий() Цикл 
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДанныхДокумента);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		// Вывод подвала для документа
		ОбластьПодвал = МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(ВыборкаДокумент);
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлФаксимильнаяПечать) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлФаксимильнаяПечать);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Факсимилия.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлПечати) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлПечати);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.Руководитель) Тогда
			Попытка
				ОбластьПодвал.Параметры.Руководитель = РС_ОбщегоНазначения.ПолучитьФИОФизЛиц(ВыборкаДокумент.Руководитель, ВыборкаДокумент.Дата);
			Исключение
			КонецПопытки;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокумент.Документ);   
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции//_Паганини


//T
Функция НапечататьInvoiceEng(МассивОбъектов, ОбъектыПечати)

	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_InvoiceEng";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплату_InvoiceEng";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуЗапасы.Ссылка КАК Документ,
		|	СчетНаОплатуЗапасы.Ссылка.Дата КАК Дата,
		|	СчетНаОплатуЗапасы.Ссылка.Номер КАК Номер,
		|	ВЫБОР
		|		КОГДА СчетНаОплатуЗапасы.Ссылка.Организация.НаименованиеАнглийское = """"
		|			ТОГДА СчетНаОплатуЗапасы.Ссылка.Организация.Наименование
		|		ИНАЧЕ СчетНаОплатуЗапасы.Ссылка.Организация.НаименованиеАнглийское
		|	КОНЕЦ КАК Продавец,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(СчетНаОплатуЗапасы.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА СчетНаОплатуЗапасы.Ссылка.Контрагент.Наименование
		|		ИНАЧЕ СчетНаОплатуЗапасы.Ссылка.Контрагент.НаименованиеПолное
		|	КОНЕЦ КАК Покупатель,
		|	СчетНаОплатуЗапасы.Ссылка.Договор КАК Договор,
		|	СчетНаОплатуЗапасы.Ссылка.СуммаДокумента КАК Сумма,
		|	СчетНаОплатуЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
		|	СчетНаОплатуЗапасы.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(СчетНаОплатуЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА СчетНаОплатуЗапасы.Номенклатура.Наименование
		|		ИНАЧЕ СчетНаОплатуЗапасы.Номенклатура.НаименованиеПолное
		|	КОНЕЦ КАК Номенклатура,
		|	СчетНаОплатуЗапасы.Характеристика КАК Характеристика,
		|	СчетНаОплатуЗапасы.Количество КАК Количество,
		|	СчетНаОплатуЗапасы.Цена КАК Цена,
		|	СчетНаОплатуЗапасы.СуммаНДС КАК СуммаНДС,
		|	СчетНаОплатуЗапасы.Всего КАК Всего,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.НомерСчета КАК БанковскийСчет,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Код КАК БанкКод,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(СчетНаОплатуЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.НаименованиеАнглиское КАК СТРОКА(100))) = """"
		|			ТОГДА СчетНаОплатуЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Наименование
		|		ИНАЧЕ СчетНаОплатуЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.НаименованиеАнглиское
		|	КОНЕЦ КАК Банк,
		|	СчетНаОплатуЗапасы.Ссылка.Контрагент.ИНН КАК ПокупательИНН,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.ИНН КАК ПродавецИНН,
		|	СчетНаОплатуЗапасы.Ссылка.Ответственный.Физлицо КАК Ответственный,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.ФайлЛоготип КАК ФайлЛоготип,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.ФайлФаксимильнаяПечать КАК ФайлФаксимильнаяПечать,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.ФайлПечати КАК ФайлПечати,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(СчетНаОплатуЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо.НаименованиеАнглиское КАК СТРОКА(100))) = """"
		|			ТОГДА СчетНаОплатуЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо
		|		ИНАЧЕ СчетНаОплатуЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо.НаименованиеАнглиское
		|	КОНЕЦ КАК Руководитель
		|ИЗ
		|	Документ.СчетНаОплату.Запасы КАК СчетНаОплатуЗапасы
		|ГДЕ
		|	СчетНаОплатуЗапасы.Ссылка В(&МассивОбъектов)
		|ИТОГИ
		|	МАКСИМУМ(Продавец),
		|	МАКСИМУМ(Покупатель),
		|	КОЛИЧЕСТВО(НомерСтроки),
		|	СУММА(СуммаНДС),
		|	СУММА(Всего),
		|	МАКСИМУМ(БанковскийСчет)
		|ПО
		|	Документ";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		МакетПечатнойФормы	= УправлениеПечатью.МакетПечатнойФормы("Документ.СчетНаОплату.ПФ_MXL_InvoiceEng");//ПолучитьМакет("ПФ_MXL_Invoice");
		
		// Вывод шапки для документа
		ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка");
		ОбластьШапки.Параметры.Заполнить(ВыборкаДокумент);
		Попытка
			ОбластьШапки.Параметры.Дата	= Формат(ВыборкаДокумент.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлЛоготип) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлЛоготип);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьШапки.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапки);
				
		// Вывод таблицной части
		ВыборкаДанныхДокумента = ВыборкаДокумент.Выбрать();
		ОбластьСтрока = МакетПечатнойФормы.ПолучитьОбласть("ТабличаяЧасть");
		Пока ВыборкаДанныхДокумента.Следующий() Цикл 
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДанныхДокумента);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		// Вывод подвала для документа
		ОбластьПодвал = МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(ВыборкаДокумент);
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлФаксимильнаяПечать) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлФаксимильнаяПечать);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Факсимилия.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлПечати) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлПечати);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.Руководитель) Тогда
			Попытка
				ОбластьПодвал.Параметры.Руководитель = ВыборкаДокумент.Руководитель;
			Исключение
			КонецПопытки;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокумент.Документ);   
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

//N
Функция НапечататьInvoiceRus(МассивОбъектов, ОбъектыПечати)

	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_InvoiceRus";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплату_InvoiceRus";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуЗапасы.Ссылка КАК Документ,
		|	СчетНаОплатуЗапасы.Ссылка.Дата КАК Дата,
		|	СчетНаОплатуЗапасы.Ссылка.Номер КАК Номер,
		|	ВЫБОР
		|		КОГДА СчетНаОплатуЗапасы.Ссылка.Организация.НаименованиеРуское = """"
		|			ТОГДА СчетНаОплатуЗапасы.Ссылка.Организация.Наименование
		|		ИНАЧЕ СчетНаОплатуЗапасы.Ссылка.Организация.НаименованиеРуское
		|	КОНЕЦ КАК Продавец,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(СчетНаОплатуЗапасы.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА СчетНаОплатуЗапасы.Ссылка.Контрагент.Наименование
		|		ИНАЧЕ СчетНаОплатуЗапасы.Ссылка.Контрагент.НаименованиеПолное
		|	КОНЕЦ КАК Покупатель,
		|	СчетНаОплатуЗапасы.Ссылка.Договор КАК Договор,
		|	СчетНаОплатуЗапасы.Ссылка.СуммаДокумента КАК Сумма,
		|	СчетНаОплатуЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
		|	СчетНаОплатуЗапасы.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(СчетНаОплатуЗапасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100))) = """"
		|			ТОГДА СчетНаОплатуЗапасы.Номенклатура.Наименование
		|		ИНАЧЕ СчетНаОплатуЗапасы.Номенклатура.НаименованиеПолное
		|	КОНЕЦ КАК Номенклатура,
		|	СчетНаОплатуЗапасы.Характеристика КАК Характеристика,
		|	СчетНаОплатуЗапасы.Количество КАК Количество,
		|	СчетНаОплатуЗапасы.Цена КАК Цена,
		|	СчетНаОплатуЗапасы.СуммаНДС КАК СуммаНДС,
		|	СчетНаОплатуЗапасы.Всего КАК Всего,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.НомерСчета КАК БанковскийСчет,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Код КАК БанкКод,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(СчетНаОплатуЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.НаименованиеРуское КАК СТРОКА(100))) = """"
		|			ТОГДА СчетНаОплатуЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.Наименование
		|		ИНАЧЕ СчетНаОплатуЗапасы.Ссылка.Организация.БанковскийСчетПоУмолчанию.Банк.НаименованиеРуское
		|	КОНЕЦ КАК Банк,
		|	СчетНаОплатуЗапасы.Ссылка.Контрагент.ИНН КАК ПокупательИНН,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.ИНН КАК ПродавецИНН,
		|	СчетНаОплатуЗапасы.Ссылка.Ответственный.Физлицо КАК Ответственный,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.ФайлЛоготип КАК ФайлЛоготип,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.ФайлФаксимильнаяПечать КАК ФайлФаксимильнаяПечать,
		|	СчетНаОплатуЗапасы.Ссылка.Организация.ФайлПечати КАК ФайлПечати,
		|	ВЫБОР
		|		КОГДА СчетНаОплатуЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо.НаименованиеРуское = """"
		|			ТОГДА СчетНаОплатуЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо
		|		ИНАЧЕ СчетНаОплатуЗапасы.Ссылка.Организация.ПодписьРуководителя.ФизическоеЛицо.НаименованиеРуское
		|	КОНЕЦ КАК Руководитель
		|ИЗ
		|	Документ.СчетНаОплату.Запасы КАК СчетНаОплатуЗапасы
		|ГДЕ
		|	СчетНаОплатуЗапасы.Ссылка В(&МассивОбъектов)
		|ИТОГИ
		|	МАКСИМУМ(Продавец),
		|	МАКСИМУМ(Покупатель),
		|	КОЛИЧЕСТВО(НомерСтроки),
		|	СУММА(СуммаНДС),
		|	СУММА(Всего),
		|	МАКСИМУМ(БанковскийСчет)
		|ПО
		|	Документ";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		МакетПечатнойФормы	= УправлениеПечатью.МакетПечатнойФормы("Документ.СчетНаОплату.ПФ_MXL_InvoiceRus");//ПолучитьМакет("ПФ_MXL_Invoice");
		
		// Вывод шапки для документа
		ОбластьШапки = МакетПечатнойФормы.ПолучитьОбласть("Шапка");
		ОбластьШапки.Параметры.Заполнить(ВыборкаДокумент);
		Попытка
			ОбластьШапки.Параметры.Дата	= Формат(ВыборкаДокумент.Дата , "ДФ=dd.MM.yyyy");
		Исключение
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлЛоготип) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлЛоготип);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьШапки.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапки);
				
		// Вывод таблицной части
		ВыборкаДанныхДокумента = ВыборкаДокумент.Выбрать();
		ОбластьСтрока = МакетПечатнойФормы.ПолучитьОбласть("ТабличаяЧасть");
		Пока ВыборкаДанныхДокумента.Следующий() Цикл 
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДанныхДокумента);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		// Вывод подвала для документа
		ОбластьПодвал = МакетПечатнойФормы.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(ВыборкаДокумент);
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлФаксимильнаяПечать) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлФаксимильнаяПечать);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Факсимилия.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.ФайлПечати) Тогда
			ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДокумент.ФайлПечати);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
				Попытка
					ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДанныеКартинки);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокумент.Руководитель) Тогда
			Попытка
				ОбластьПодвал.Параметры.Руководитель = ВыборкаДокумент.Руководитель;
			Исключение
			КонецПопытки;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокумент.Документ);   
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции


#КонецОбласти

#Область ШаблоныСообщений

// Вызывается при подготовке шаблонов сообщений и позволяет переопределить список реквизитов и вложений.
//
// Параметры:
//  Реквизиты               - ДеревоЗначений - список реквизитов шаблона.
//         ** Имя            - Строка - Уникальное имя общего реквизита.
//         ** Представление  - Строка - Представление общего реквизита.
//         ** Тип            - Тип    - Тип реквизита. По умолчанию строка.
//         ** Формат         - Строка - Формат вывода значения для чисел, дат, строк и булевых значений.
//  Вложения                - ТаблицаЗначений - печатные формы и вложения
//         ** Имя            - Строка - Уникальное имя вложения.
//         ** Представление  - Строка - Представление варианта.
//         ** ТипФайла       - Строка - Тип вложения, который соответствует расширению файла: "pdf", "png", "jpg", mxl" и др.
//  ДополнительныеПараметры - Структура - дополнительные сведения о шаблоне сообщений.
//
Процедура ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, ДополнительныеПараметры) Экспорт
	
	
КонецПроцедуры

// Вызывается в момент создания сообщений по шаблону для заполнения значений реквизитов и вложений.
//
// Параметры:
//  Сообщение - Структура - структура с ключами:
//    * ЗначенияРеквизитов - Соответствие - список используемых в шаблоне реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * ЗначенияОбщихРеквизитов - Соответствие - список используемых в шаблоне общих реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * Вложения - Соответствие - значения реквизитов 
//      ** Ключ     - Строка - имя вложения в шаблоне;
//      ** Значение - ДвоичныеДанные, Строка - двоичные данные или адрес во временном хранилище вложения.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект являющийся источником данных.
//  ДополнительныеПараметры - Структура -  Дополнительная информация о шаблоне сообщения.
//
Процедура ПриФормированииСообщения(Сообщение, ПредметСообщения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// Заполняет список получателей SMS при отправке сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиSMS - ТаблицаЗначений - список получается SMS.
//     * НомерТелефона - Строка - номер телефона, куда будет отправлено сообщение SMS.
//     * Представление - Строка - представление получателя сообщения SMS.
//     * Контакт       - Произвольный - контакт, которому принадлежит номер телефона.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.//
//
Процедура ПриЗаполненииТелефоновПолучателейВСообщении(ПолучателиSMS, ПредметСообщения) Экспорт
	
КонецПроцедуры

// Заполняет список получателей письма при отправки сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиПисьма - ТаблицаЗначений - список получается письма.
//     * Адрес           - Строка - адрес электронной почты получателя.
//     * Представление   - Строка - представление получается письма.
//     * Контакт         - Произвольный - контакт, которому принадлежит адрес электрнной почты.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//                                              если шаблон содержит произвольные параметры:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.
//
Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, ПредметСообщения) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли