&Вместо("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства)
	
	Если Не ДокументСсылкаАвансовыйОтчет.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
		AzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАвансовыйОтчет);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='მარაგების შემოსავალში აყვანა';ru='Оприходование запасов';en='Posting of Goods'"));
	Запрос.УстановитьПараметр("ПрочиеРасходы", НСтр("ka='დანახარჯების ასახვა';ru='Отражение затрат';en='reflection costs'"));
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаНациональная", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Документ.Статья КАК Статья
	|ИЗ
	|	Документ.АвансовыйОтчет.ВыданныеАвансы КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И &КассовыйМетодУчетаДоходовИРасходов
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Статья = РезультатЗапроса.Статья;
	Иначе
		Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Статья", Статья);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.УчитыватьВНУ КАК УчитыватьВНУ,
	|	ТаблицаДокумента.Ссылка.Организация КАК ОрганизацияВНУ,
	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.ЭтоДоговорОбслуживания
	|				И ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВестиУчетРасходовПоДоговорамОбслуживания,
	|	ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности КАК ДоговорОбслуживанияНаправлениеДеятельности,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов КАК Валюта,
	|	ТаблицаДокумента.ПризнакАванса КАК ПризнакАванса,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.Ссылка.Сотрудник КАК Сотрудник,
	// +++ { AzRy - [08.12.2021] - Developer:გიორგი მამულაშვილი - Comment: 
	//|	ТаблицаДокумента.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов КАК ВалютаДокумента,
	// +++ } AzRy - [08.12.2021] - Developer:გიორგი მამულაშვილი - Comment:
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	ТаблицаДокумента.AzRyПроект КАК AzRyПроект,
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ КАК СчетУчета,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|	ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщикуРегл КАК СчетУчетаАвансовПоставщикуРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ТаблицаДокумента.СчетНаОплату КАК СчетНаОплату,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетНаОплату.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.СчетНаОплату
	|		КОГДА ТаблицаДокумента.Заказ.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетНаОплатуДляПлатежногоКалендаря,
	|	ТаблицаДокумента.Курс КАК Курс,
	|	ТаблицаДокумента.Кратность КАК Кратность,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Статья = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|		ИНАЧЕ ТаблицаДокумента.Статья
	|	КОНЕЦ КАК Статья,
	|	СУММА(ТаблицаДокумента.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * ТаблицаДокумента.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * ТаблицаДокумента.Ссылка.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК СчетНачисленияНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК СчетКОплатеНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ТаблицаДокумента.ВидУдержанияПФ.СчетЗатратРегл КАК СчетЗатратРеглПФ,
	|	ТаблицаДокумента.ВидУдержанияПФ.СчетЗатрат КАК СчетЗатратПФ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|			ТОГДА ТаблицаДокумента.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета
	|		ИНАЧЕ ТаблицаДокумента.ВидУдержанияПФ.СчетЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчетаЗатратПФ,
	|	ТаблицаДокумента.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	ТаблицаДокумента.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФСотрудника,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФОрганизации,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|					ТОГДА ТаблицаДокумента.СуммаНДФЛ * КурсыВалютНациональная.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютНациональная.Кратность)
	|				ИНАЧЕ ТаблицаДокумента.СуммаНДФЛ * ТаблицаДокумента.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * ТаблицаДокумента.Ссылка.Кратность)
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаНДФЛ,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|					ТОГДА ТаблицаДокумента.СуммаНДФЛ * КурсыВалютНациональная.Курс * ТаблицаДокумента.Ссылка.Кратность / (ТаблицаДокумента.Ссылка.Курс * КурсыВалютНациональная.Кратность)
	|				ИНАЧЕ ТаблицаДокумента.СуммаНДФЛ
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаНДФЛВал,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|					ТОГДА ТаблицаДокумента.СуммаПФ * КурсыВалютНациональная.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютНациональная.Кратность)
	|				ИНАЧЕ ТаблицаДокумента.СуммаПФ * ТаблицаДокумента.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * ТаблицаДокумента.Ссылка.Кратность)
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаПФ,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|					ТОГДА ТаблицаДокумента.СуммаПФ * КурсыВалютНациональная.Курс * ТаблицаДокумента.Ссылка.Кратность / (ТаблицаДокумента.Ссылка.Курс * КурсыВалютНациональная.Кратность)
	|				ИНАЧЕ ТаблицаДокумента.СуммаПФ
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаПФВал
	|ПОМЕСТИТЬ ВременнаяТаблицаОплаты
	|ИЗ
	|	Документ.АвансовыйОтчет.Оплаты КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаНациональная) КАК КурсыВалютНациональная
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.Курс,
	|	ТаблицаДокумента.Кратность,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Ссылка.Сотрудник,
	|	ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовПоПерерасходуРегл,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл,
	|	ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетНаОплату.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.СчетНаОплату
	|		КОГДА ТаблицаДокумента.Заказ.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.ЭтоДоговорОбслуживания
	|				И ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.УчитыватьВНУ,
	|	ТаблицаДокумента.Ссылка.Организация,
	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияПФ,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.СчетЗатратРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.СчетЗатрат,
	|	ТаблицаДокумента.ВидУдержанияПФ.Контрагент,
	|	ТаблицаДокумента.ВидУдержанияПФ.Договор,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|			ТОГДА ТаблицаДокумента.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета
	|		ИНАЧЕ ТаблицаДокумента.ВидУдержанияПФ.СчетЗатрат.ТипСчета
	|	КОНЕЦ
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,ТаблицаДокумента.AzRyПроект
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансовыйОтчетЗапасы.НомерСтроки КАК НомерСтроки,
	|	АвансовыйОтчетЗапасы.Период КАК Период,
	|	АвансовыйОтчетЗапасы.Организация КАК Организация,
	|	АвансовыйОтчетЗапасы.УчитыватьВНУ КАК УчитыватьВНУ,
	|	АвансовыйОтчетЗапасы.ОрганизацияВНУ КАК ОрганизацияВНУ,
	|	АвансовыйОтчетЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	АвансовыйОтчетЗапасы.СтруктурнаяЕдиница.ОрдерныйСклад КАК ОрдерныйСклад,
	|	АвансовыйОтчетЗапасы.Ячейка КАК Ячейка,
	|	АвансовыйОтчетЗапасы.СчетУчета КАК СчетУчета,
	|	АвансовыйОтчетЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	АвансовыйОтчетЗапасы.Номенклатура КАК Номенклатура,
	|	АвансовыйОтчетЗапасы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	АвансовыйОтчетЗапасы.Сотрудник КАК Сотрудник,
	|	АвансовыйОтчетЗапасы.Валюта КАК Валюта,
	|	АвансовыйОтчетЗапасы.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	АвансовыйОтчетЗапасы.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|	АвансовыйОтчетЗапасы.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|	АвансовыйОтчетЗапасы.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	|	АвансовыйОтчетЗапасы.СчетРасчетовСПерсоналомРегл КАК СчетРасчетовСПерсоналомРегл,
	|	АвансовыйОтчетЗапасы.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК СчетНачисленияНДФЛ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК СчетКОплатеНДФЛ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.СчетЗатратРегл КАК СчетЗатратРеглПФ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.СчетЗатрат КАК СчетЗатратПФ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|			ТОГДА АвансовыйОтчетЗапасы.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета
	|		ИНАЧЕ АвансовыйОтчетЗапасы.ВидУдержанияПФ.СчетЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчетаЗатратПФ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФСотрудника,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФОрганизации,
	|	АвансовыйОтчетЗапасы.СуммаПФ,
	|	АвансовыйОтчетЗапасы.СуммаПФВал,
	|	АвансовыйОтчетЗапасы.СуммаНДФЛВал,
	|	АвансовыйОтчетЗапасы.СуммаВключаетНДС,
	|	АвансовыйОтчетЗапасы.СуммаБезНалогов,
	|	АвансовыйОтчетЗапасы.СуммаБезНалоговВал,
	|	АвансовыйОтчетЗапасы.СуммаРасходовНДФЛ КАК СуммаРасходовНДФЛ,
	|	АвансовыйОтчетЗапасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	АвансовыйОтчетЗапасы.Характеристика КАК Характеристика,
	|	АвансовыйОтчетЗапасы.Партия КАК Партия,
	|	АвансовыйОтчетЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	АвансовыйОтчетЗапасы.Количество КАК Количество,
	|	АвансовыйОтчетЗапасы.Сумма КАК Сумма,
	|	АвансовыйОтчетЗапасы.ВидНалогаНДС КАК ВидНалогаНДС,
	|	АвансовыйОтчетЗапасы.СуммаВал КАК СуммаВал,
	|	АвансовыйОтчетЗапасы.СуммаНДС КАК СуммаНДС,
	|	АвансовыйОтчетЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	АвансовыйОтчетЗапасы.СуммаНДСЗакупки КАК СуммаНДСЗакупки,
	|	АвансовыйОтчетЗапасы.СуммаНДСВал КАК СуммаНДСВал,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчетЗапасы.Статья = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА &Статья
	|		ИНАЧЕ АвансовыйОтчетЗапасы.Статья
	|	КОНЕЦ КАК Статья,
	|	АвансовыйОтчетЗапасы.ТоварыДляПроизводства КАК ТоварыДляПроизводства,
	|	&Ссылка КАК Документ
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	(ВЫБРАТЬ
	|		АвансовыйОтчетЗапасы.НомерСтроки КАК НомерСтроки,
	|		АвансовыйОтчетЗапасы.Ссылка.Дата КАК Период,
	|		&Организация КАК Организация,
	|		АвансовыйОтчетЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		АвансовыйОтчетЗапасы.Ячейка КАК Ячейка,
	|		АвансовыйОтчетЗапасы.Номенклатура.СчетУчетаЗапасов КАК СчетУчета,
	|		АвансовыйОтчетЗапасы.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|		АвансовыйОтчетЗапасы.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		АвансовыйОтчетЗапасы.Номенклатура КАК Номенклатура,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник КАК Сотрудник,
	|		АвансовыйОтчетЗапасы.Ссылка.УчитыватьВНУ КАК УчитыватьВНУ,
	|		АвансовыйОтчетЗапасы.Ссылка.Организация КАК ОрганизацияВНУ,
	|		АвансовыйОтчетЗапасы.СтавкаНДС КАК СтавкаНДС,
	|		АвансовыйОтчетЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник.СчетРасчетовСПерсоналомРегл КАК СчетРасчетовСПерсоналомРегл,
	|		АвансовыйОтчетЗапасы.ВидНалогаНДС КАК ВидНалогаНДС,
	|		АвансовыйОтчетЗапасы.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|		АвансовыйОтчетЗапасы.СуммаРасходовНДФЛ КАК СуммаНДФЛВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетЗапасы.СуммаРасходовНДФЛ * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаРасходовНДФЛ,
	|		АвансовыйОтчетЗапасы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|		АвансовыйОтчетЗапасы.СуммаПФ КАК СуммаПФВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетЗапасы.СуммаПФ * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаПФ,
	|		АвансовыйОтчетЗапасы.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		АвансовыйОтчетЗапасы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|		АвансовыйОтчетЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ВЫБОР
	|			КОГДА &ИспользоватьХарактеристики
	|				ТОГДА АвансовыйОтчетЗапасы.Характеристика
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		КОНЕЦ КАК Характеристика,
	|		ВЫБОР
	|			КОГДА &ИспользоватьПартии
	|				ТОГДА АвансовыйОтчетЗапасы.Партия
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|		КОНЕЦ КАК Партия,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(АвансовыйОтчетЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|				ТОГДА АвансовыйОтчетЗапасы.Количество
	|			ИНАЧЕ АвансовыйОтчетЗапасы.Количество * АвансовыйОтчетЗапасы.ЕдиницаИзмерения.Коэффициент
	|		КОНЕЦ КАК Количество,
	|		АвансовыйОтчетЗапасы.СуммаНДС КАК СуммаНДСВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетЗапасы.СуммаНДС * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|		ВЫРАЗИТЬ((АвансовыйОтчетЗапасы.Всего - АвансовыйОтчетЗапасы.СуммаРасходовНДФЛ - АвансовыйОтчетЗапасы.СуммаПФ) * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаБезНалогов,
	|		АвансовыйОтчетЗапасы.Всего - АвансовыйОтчетЗапасы.СуммаРасходовНДФЛ - АвансовыйОтчетЗапасы.СуммаПФ КАК СуммаБезНалоговВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетЗапасы.СуммаНДС * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДСЗакупки,
	|		АвансовыйОтчетЗапасы.Всего КАК СуммаВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетЗапасы.Всего * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|		АвансовыйОтчетЗапасы.Статья КАК Статья,
	|		АвансовыйОтчетЗапасы.ТоварыДляПроизводства КАК ТоварыДляПроизводства,
	|		&ОприходованиеЗапасов КАК СодержаниеПроводки
	|	ИЗ
	|		Документ.АвансовыйОтчет.Запасы КАК АвансовыйОтчетЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|					&МоментВремени,
	|					Валюта В
	|						(ВЫБРАТЬ
	|							Константы.ВалютаУчета
	|						ИЗ
	|							Константы КАК Константы)) КАК КурсыВалютУчета
	|			ПО (ИСТИНА)
	|	ГДЕ
	|		АвансовыйОтчетЗапасы.Ссылка = &Ссылка) КАК АвансовыйОтчетЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансовыйОтчетРасходы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	АвансовыйОтчетРасходы.Период КАК Период,
	|	АвансовыйОтчетРасходы.Организация КАК Организация,
	|	АвансовыйОтчетРасходы.ОрганизацияВНУ КАК ОрганизацияВНУ,
	|	АвансовыйОтчетРасходы.УчитыватьВНУ КАК УчитыватьВНУ,
	|	АвансовыйОтчетРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	АвансовыйОтчетРасходы.СчетУчета КАК СчетУчета,
	|	АвансовыйОтчетРасходы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	АвансовыйОтчетРасходы.Номенклатура КАК Номенклатура,
	|	АвансовыйОтчетРасходы.Сотрудник КАК Сотрудник,
	|	АвансовыйОтчетРасходы.Валюта КАК Валюта,
	|	АвансовыйОтчетРасходы.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	АвансовыйОтчетРасходы.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|	АвансовыйОтчетРасходы.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|	АвансовыйОтчетРасходы.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	|	АвансовыйОтчетРасходы.СчетРасчетовСПерсоналомРегл КАК СчетРасчетовСПерсоналомРегл,
	|	АвансовыйОтчетРасходы.ВидНалогаНДС КАК ВидНалогаНДС,
	|	АвансовыйОтчетРасходы.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	АвансовыйОтчетРасходы.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК СчетНачисленияНДФЛ,
	|	АвансовыйОтчетРасходы.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК СчетКОплатеНДФЛ,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.СчетЗатратРегл КАК СчетЗатратРеглПФ,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.СчетЗатрат КАК СчетЗатратПФ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|			ТОГДА АвансовыйОтчетРасходы.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета
	|		ИНАЧЕ АвансовыйОтчетРасходы.ВидУдержанияПФ.СчетЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчетаЗатратПФ,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФСотрудника,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФОрганизации,
	|	АвансовыйОтчетРасходы.СуммаПФ,
	|	АвансовыйОтчетРасходы.СуммаПФВал,
	|	АвансовыйОтчетРасходы.СуммаНДФЛВал,
	|	АвансовыйОтчетРасходы.СуммаВключаетНДС,
	|	АвансовыйОтчетРасходы.СуммаБезНалогов,
	|	АвансовыйОтчетРасходы.СуммаБезНалоговВал,
	|	АвансовыйОтчетРасходы.Характеристика КАК Характеристика,
	|	АвансовыйОтчетРасходы.Партия КАК Партия,
	|	АвансовыйОтчетРасходы.Количество КАК Количество,
	|	АвансовыйОтчетРасходы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	АвансовыйОтчетРасходы.Сумма КАК Сумма,
	|	АвансовыйОтчетРасходы.СуммаВал КАК СуммаВал,
	|	АвансовыйОтчетРасходы.СтавкаНДС КАК СтавкаНДС,
	|	АвансовыйОтчетРасходы.СуммаНДС КАК СуммаНДС,
	|	АвансовыйОтчетРасходы.СуммаНДСВал КАК СуммаНДСВал,
	|	АвансовыйОтчетРасходы.СуммаНДСЗакупки КАК СуммаНДСЗакупки,
	|	ВЫРАЗИТЬ(АвансовыйОтчетРасходы.СуммаРасходовНДФЛ КАК ЧИСЛО(15, 2)) КАК СуммаНДФЛ,
	|	АвансовыйОтчетРасходы.ТипСчетУчета КАК ТипСчетУчета,
	|	АвансовыйОтчетРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчетРасходы.Статья = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА &Статья
	|		ИНАЧЕ АвансовыйОтчетРасходы.Статья
	|	КОНЕЦ КАК Статья,
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	&Ссылка КАК Документ
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,АвансовыйОтчетРасходы.AzRyПроект КАК AzRyПроект 
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|ПОМЕСТИТЬ ВременнаяТаблицаРасходы
	|ИЗ
	|	(ВЫБРАТЬ
	|		АвансовыйОтчетРасходы.НомерСтроки КАК НомерСтроки,
	|		АвансовыйОтчетРасходы.Ссылка.Дата КАК Период,
	|		&Организация КАК Организация,
	|		АвансовыйОтчетРасходы.Ссылка.УчитыватьВНУ КАК УчитыватьВНУ,
	|		АвансовыйОтчетРасходы.Ссылка.Организация КАК ОрганизацияВНУ,
	|		АвансовыйОтчетРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		АвансовыйОтчетРасходы.Номенклатура.СчетУчетаЗатрат КАК СчетУчета,
	|		АвансовыйОтчетРасходы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаРегл,
	|		АвансовыйОтчетРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		АвансовыйОтчетРасходы.Номенклатура КАК Номенклатура,
	|		АвансовыйОтчетРасходы.СтавкаНДС КАК СтавкаНДС,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник КАК Сотрудник,
	|		АвансовыйОтчетРасходы.Ссылка.ВалютаДокумента КАК Валюта,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник.СчетРасчетовСПерсоналомРегл КАК СчетРасчетовСПерсоналомРегл,
	|		АвансовыйОтчетРасходы.ВидНалогаНДС КАК ВидНалогаНДС,
	|		АвансовыйОтчетРасходы.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|		АвансовыйОтчетРасходы.СуммаНДФЛ КАК СуммаНДФЛВал,
	|		АвансовыйОтчетРасходы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|		АвансовыйОтчетРасходы.СуммаПФ КАК СуммаПФВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетРасходы.СуммаПФ * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаПФ,
	|		АвансовыйОтчетРасходы.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		ВЫРАЗИТЬ(АвансовыйОтчетРасходы.СуммаНДФЛ * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаРасходовНДФЛ,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|		ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(АвансовыйОтчетРасходы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|				ТОГДА АвансовыйОтчетРасходы.Количество
	|			ИНАЧЕ АвансовыйОтчетРасходы.Количество * АвансовыйОтчетРасходы.ЕдиницаИзмерения.Коэффициент
	|		КОНЕЦ КАК Количество,
	|		АвансовыйОтчетРасходы.ЗаказПокупателя КАК ЗаказПокупателя,
	|		АвансовыйОтчетРасходы.СуммаНДС КАК СуммаНДСВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетРасходы.СуммаНДС * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|		ВЫРАЗИТЬ((АвансовыйОтчетРасходы.СуммаБезНалогов + АвансовыйОтчетРасходы.СуммаНДС) * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаБезНалогов,
	|		АвансовыйОтчетРасходы.СуммаБезНалогов + АвансовыйОтчетРасходы.СуммаНДС КАК СуммаБезНалоговВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетРасходы.СуммаНДС * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДСЗакупки,
	|		АвансовыйОтчетРасходы.Всего КАК СуммаВал,
	|		АвансовыйОтчетРасходы.Статья КАК Статья,
	|		ВЫРАЗИТЬ(АвансовыйОтчетРасходы.Всего * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|		ВЫБОР
	|			КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|				ТОГДА АвансовыйОтчетРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета
	|			ИНАЧЕ АвансовыйОтчетРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета
	|		КОНЕЦ КАК ТипСчетУчета
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,АвансовыйОтчетРасходы.AzRyПроект КАК AzRyПроект 
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	ИЗ
	|		Документ.АвансовыйОтчет.Расходы КАК АвансовыйОтчетРасходы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|					&МоментВремени,
	|					Валюта В
	|						(ВЫБРАТЬ
	|							Константы.ВалютаУчета
	|						ИЗ
	|							Константы КАК Константы)) КАК КурсыВалютУчета
	|			ПО (ИСТИНА)
	|	ГДЕ
	|		АвансовыйОтчетРасходы.Ссылка = &Ссылка) КАК АвансовыйОтчетРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(АвансовыйОтчетПлатежныеВедомости.НомерСтроки) КАК НомерСтроки,
	|	АвансовыйОтчетПлатежныеВедомости.Ведомость КАК ПлатежнаяВедомость,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Дата КАК Период,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка КАК Ссылка,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Организация КАК Организация,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник КАК Сотрудник,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПерсоналом КАК СчетРасчетовСПерсоналом,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПерсоналомРегл КАК СчетРасчетовСПерсоналомРегл,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник КАК СотрудникВедомость,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * АвансовыйОтчетПлатежныеВедомости.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетПлатежныеВедомости.Ссылка.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаПоСотруднику,
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаПлатежа) КАК СуммаПоСотрудникуВал,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания КАК ВидУдержания,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации КАК ВедомостьВидОперации,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.НДФЛПлатежа * АвансовыйОтчетПлатежныеВедомости.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетПлатежныеВедомости.Ссылка.Кратность) КАК ЧИСЛО(15, 2))) КАК НДФЛПлатежа,
	|	СУММА(ПлатежнаяВедомостьСотрудники.НДФЛПлатежа) КАК НДФЛПлатежаВал,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПФПлатежа * АвансовыйОтчетПлатежныеВедомости.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетПлатежныеВедомости.Ссылка.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаПФПлатежа,
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаПФПлатежа) КАК СуммаПФПлатежаВал,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаЛгот)
	|ПОМЕСТИТЬ ВременнаяТаблицаПлатежныеВедомости
	|ИЗ
	|	Документ.АвансовыйОтчет.ПлатежныеВедомости КАК АвансовыйОтчетПлатежныеВедомости
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
	|		ПО АвансовыйОтчетПлатежныеВедомости.Ведомость = ПлатежнаяВедомостьСотрудники.Ссылка
	|ГДЕ
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчетПлатежныеВедомости.Ведомость,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Дата,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПерсоналом,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.ВалютаДокумента,
	|	ВЫРАЗИТЬ(АвансовыйОтчетПлатежныеВедомости.Сумма * АвансовыйОтчетПлатежныеВедомости.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетПлатежныеВедомости.Ссылка.Кратность) КАК ЧИСЛО(15, 2)),
	|	АвансовыйОтчетПлатежныеВедомости.Сумма,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовПоПерерасходуРегл,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПерсоналомРегл,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Организация,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.СтруктурнаяЕдиница";
	
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаЗапасы(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыКПоступлениюНаСклады(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗакупки(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПлатежныйКалендарь(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	//ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_АвансовыйОтчет(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства); //+++ Дмгг
	СформироватьТаблицаЗакупкиДляКУДиР(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыНДФЛ(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);//Паганини
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_АвансовыйОтчет(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	//Паганини ПФ_
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыСПенсионнымФондом_АвансовыйОтчет(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаДекларация_АвансовыйОтчет(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	//_Паганини ПФ
	СформироватьТаблицаНалоговыеЛготы(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОстаткиНалоговыхЛьгот(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	
	//СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства); //+++ Дмгг
		
	
КонецПроцедуры

Процедура AzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАвансовыйОтчет);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='მარაგების შემოსავალში აყვანა';ru='Оприходование запасов';en='Posting of Goods'"));
	Запрос.УстановитьПараметр("ПрочиеРасходы", НСтр("ka='დანახარჯების ასახვა';ru='Отражение затрат';en='reflection costs'"));
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаНациональная", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Документ.Статья КАК Статья
	|ИЗ
	|	Документ.АвансовыйОтчет.ВыданныеАвансы КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И &КассовыйМетодУчетаДоходовИРасходов
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Статья = РезультатЗапроса.Статья;
	Иначе
		Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Статья", Статья);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.УчитыватьВНУ КАК УчитыватьВНУ,
	|	ТаблицаДокумента.Ссылка.Организация КАК ОрганизацияВНУ,
	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.ЭтоДоговорОбслуживания
	|				И ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВестиУчетРасходовПоДоговорамОбслуживания,
	|	ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности КАК ДоговорОбслуживанияНаправлениеДеятельности,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов КАК Валюта,
	|	ТаблицаДокумента.ПризнакАванса КАК ПризнакАванса,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.Ссылка.Сотрудник КАК Сотрудник,
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ КАК СчетУчета,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|	ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщикуРегл КАК СчетУчетаАвансовПоставщикуРегл,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|		ИНАЧЕ ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ТаблицаДокумента.СчетНаОплату КАК СчетНаОплату,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетНаОплату.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.СчетНаОплату
	|		КОГДА ТаблицаДокумента.Заказ.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетНаОплатуДляПлатежногоКалендаря,
	|	ТаблицаДокумента.Курс КАК Курс,
	|	ТаблицаДокумента.Кратность КАК Кратность,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Статья = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|		ИНАЧЕ ТаблицаДокумента.Статья
	|	КОНЕЦ КАК Статья,
	|	СУММА(ТаблицаДокумента.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * ТаблицаДокумента.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * ТаблицаДокумента.Ссылка.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК СчетНачисленияНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК СчетКОплатеНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ТаблицаДокумента.ВидУдержанияПФ.СчетЗатратРегл КАК СчетЗатратРеглПФ,
	|	ТаблицаДокумента.ВидУдержанияПФ.СчетЗатрат КАК СчетЗатратПФ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|			ТОГДА ТаблицаДокумента.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета
	|		ИНАЧЕ ТаблицаДокумента.ВидУдержанияПФ.СчетЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчетаЗатратПФ,
	|	ТаблицаДокумента.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	ТаблицаДокумента.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФСотрудника,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФОрганизации,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|					ТОГДА ТаблицаДокумента.СуммаНДФЛ * КурсыВалютНациональная.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютНациональная.Кратность)
	|				ИНАЧЕ ТаблицаДокумента.СуммаНДФЛ * ТаблицаДокумента.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * ТаблицаДокумента.Ссылка.Кратность)
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаНДФЛ,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|					ТОГДА ТаблицаДокумента.СуммаНДФЛ * КурсыВалютНациональная.Курс * ТаблицаДокумента.Ссылка.Кратность / (ТаблицаДокумента.Ссылка.Курс * КурсыВалютНациональная.Кратность)
	|				ИНАЧЕ ТаблицаДокумента.СуммаНДФЛ
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаНДФЛВал,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|					ТОГДА ТаблицаДокумента.СуммаПФ * КурсыВалютНациональная.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютНациональная.Кратность)
	|				ИНАЧЕ ТаблицаДокумента.СуммаПФ * ТаблицаДокумента.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * ТаблицаДокумента.Ссылка.Кратность)
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаПФ,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|					ТОГДА ТаблицаДокумента.СуммаПФ * КурсыВалютНациональная.Курс * ТаблицаДокумента.Ссылка.Кратность / (ТаблицаДокумента.Ссылка.Курс * КурсыВалютНациональная.Кратность)
	|				ИНАЧЕ ТаблицаДокумента.СуммаПФ
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаПФВал
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,ТаблицаДокумента.AzRyПроект КАК AzRyПроект
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:		
	|ПОМЕСТИТЬ ВременнаяТаблицаОплаты
	|ИЗ
	|	Документ.АвансовыйОтчет.Оплаты КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаНациональная) КАК КурсыВалютНациональная
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.Курс,
	|	ТаблицаДокумента.Кратность,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Ссылка.Сотрудник,
	|	ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовПоПерерасходуРегл,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл,
	|	ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетНаОплату.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.СчетНаОплату
	|		КОГДА ТаблицаДокумента.Заказ.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.ЭтоДоговорОбслуживания
	|				И ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.УчитыватьВНУ,
	|	ТаблицаДокумента.Ссылка.Организация,
	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ,
	|	ТаблицаДокумента.ВидУдержанияПФ,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.СчетЗатратРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.СчетЗатрат,
	|	ТаблицаДокумента.ВидУдержанияПФ.Контрагент,
	|	ТаблицаДокумента.ВидУдержанияПФ.Договор,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл,
	|	ТаблицаДокумента.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|			ТОГДА ТаблицаДокумента.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета
	|		ИНАЧЕ ТаблицаДокумента.ВидУдержанияПФ.СчетЗатрат.ТипСчета
	|	КОНЕЦ
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,ТаблицаДокумента.AzRyПроект
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансовыйОтчетЗапасы.НомерСтроки КАК НомерСтроки,
	|	АвансовыйОтчетЗапасы.Период КАК Период,
	|	АвансовыйОтчетЗапасы.Организация КАК Организация,
	|	АвансовыйОтчетЗапасы.УчитыватьВНУ КАК УчитыватьВНУ,
	|	АвансовыйОтчетЗапасы.ОрганизацияВНУ КАК ОрганизацияВНУ,
	|	АвансовыйОтчетЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	АвансовыйОтчетЗапасы.СтруктурнаяЕдиница.ОрдерныйСклад КАК ОрдерныйСклад,
	|	АвансовыйОтчетЗапасы.Ячейка КАК Ячейка,
	|	АвансовыйОтчетЗапасы.СчетУчета КАК СчетУчета,
	|	АвансовыйОтчетЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	АвансовыйОтчетЗапасы.Номенклатура КАК Номенклатура,
	|	АвансовыйОтчетЗапасы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	АвансовыйОтчетЗапасы.Сотрудник КАК Сотрудник,
	|	АвансовыйОтчетЗапасы.Валюта КАК Валюта,
	|	АвансовыйОтчетЗапасы.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	АвансовыйОтчетЗапасы.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|	АвансовыйОтчетЗапасы.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|	АвансовыйОтчетЗапасы.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	|	АвансовыйОтчетЗапасы.СчетРасчетовСПерсоналомРегл КАК СчетРасчетовСПерсоналомРегл,
	|	АвансовыйОтчетЗапасы.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК СчетНачисленияНДФЛ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК СчетКОплатеНДФЛ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.СчетЗатратРегл КАК СчетЗатратРеглПФ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.СчетЗатрат КАК СчетЗатратПФ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|			ТОГДА АвансовыйОтчетЗапасы.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета
	|		ИНАЧЕ АвансовыйОтчетЗапасы.ВидУдержанияПФ.СчетЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчетаЗатратПФ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФСотрудника,
	|	АвансовыйОтчетЗапасы.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФОрганизации,
	|	АвансовыйОтчетЗапасы.СуммаПФ КАК СуммаПФ,
	|	АвансовыйОтчетЗапасы.СуммаПФВал КАК СуммаПФВал,
	|	АвансовыйОтчетЗапасы.СуммаНДФЛВал КАК СуммаНДФЛВал,
	|	АвансовыйОтчетЗапасы.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	АвансовыйОтчетЗапасы.СуммаБезНалогов КАК СуммаБезНалогов,
	|	АвансовыйОтчетЗапасы.СуммаБезНалоговВал КАК СуммаБезНалоговВал,
	|	АвансовыйОтчетЗапасы.СуммаРасходовНДФЛ КАК СуммаРасходовНДФЛ,
	|	АвансовыйОтчетЗапасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	АвансовыйОтчетЗапасы.Характеристика КАК Характеристика,
	|	АвансовыйОтчетЗапасы.Партия КАК Партия,
	|	АвансовыйОтчетЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	АвансовыйОтчетЗапасы.Количество КАК Количество,
	|	АвансовыйОтчетЗапасы.Сумма КАК Сумма,
	|	АвансовыйОтчетЗапасы.ВидНалогаНДС КАК ВидНалогаНДС,
	|	АвансовыйОтчетЗапасы.СуммаВал КАК СуммаВал,
	|	АвансовыйОтчетЗапасы.СуммаНДС КАК СуммаНДС,
	|	АвансовыйОтчетЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	АвансовыйОтчетЗапасы.СуммаНДСЗакупки КАК СуммаНДСЗакупки,
	|	АвансовыйОтчетЗапасы.СуммаНДСВал КАК СуммаНДСВал,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчетЗапасы.Статья = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА &Статья
	|		ИНАЧЕ АвансовыйОтчетЗапасы.Статья
	|	КОНЕЦ КАК Статья,
	|	АвансовыйОтчетЗапасы.ТоварыДляПроизводства КАК ТоварыДляПроизводства,
	|	&Ссылка КАК Документ
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	(ВЫБРАТЬ
	|		АвансовыйОтчетЗапасы.НомерСтроки КАК НомерСтроки,
	|		АвансовыйОтчетЗапасы.Ссылка.Дата КАК Период,
	|		&Организация КАК Организация,
	|		АвансовыйОтчетЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		АвансовыйОтчетЗапасы.Ячейка КАК Ячейка,
	|		АвансовыйОтчетЗапасы.Номенклатура.СчетУчетаЗапасов КАК СчетУчета,
	|		АвансовыйОтчетЗапасы.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|		АвансовыйОтчетЗапасы.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		АвансовыйОтчетЗапасы.Номенклатура КАК Номенклатура,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник КАК Сотрудник,
	|		АвансовыйОтчетЗапасы.Ссылка.УчитыватьВНУ КАК УчитыватьВНУ,
	|		АвансовыйОтчетЗапасы.Ссылка.Организация КАК ОрганизацияВНУ,
	|		АвансовыйОтчетЗапасы.СтавкаНДС КАК СтавкаНДС,
	|		АвансовыйОтчетЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник.СчетРасчетовСПерсоналомРегл КАК СчетРасчетовСПерсоналомРегл,
	|		АвансовыйОтчетЗапасы.ВидНалогаНДС КАК ВидНалогаНДС,
	|		АвансовыйОтчетЗапасы.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|		АвансовыйОтчетЗапасы.СуммаРасходовНДФЛ КАК СуммаНДФЛВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетЗапасы.СуммаРасходовНДФЛ * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаРасходовНДФЛ,
	|		АвансовыйОтчетЗапасы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|		АвансовыйОтчетЗапасы.СуммаПФ КАК СуммаПФВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетЗапасы.СуммаПФ * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаПФ,
	|		АвансовыйОтчетЗапасы.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		АвансовыйОтчетЗапасы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|		АвансовыйОтчетЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ВЫБОР
	|			КОГДА &ИспользоватьХарактеристики
	|				ТОГДА АвансовыйОтчетЗапасы.Характеристика
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		КОНЕЦ КАК Характеристика,
	|		ВЫБОР
	|			КОГДА &ИспользоватьПартии
	|				ТОГДА АвансовыйОтчетЗапасы.Партия
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|		КОНЕЦ КАК Партия,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(АвансовыйОтчетЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|				ТОГДА АвансовыйОтчетЗапасы.Количество
	|			ИНАЧЕ АвансовыйОтчетЗапасы.Количество * АвансовыйОтчетЗапасы.ЕдиницаИзмерения.Коэффициент
	|		КОНЕЦ КАК Количество,
	|		АвансовыйОтчетЗапасы.СуммаНДС КАК СуммаНДСВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетЗапасы.СуммаНДС * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|		ВЫРАЗИТЬ((АвансовыйОтчетЗапасы.Всего - АвансовыйОтчетЗапасы.СуммаРасходовНДФЛ - АвансовыйОтчетЗапасы.СуммаПФ) * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаБезНалогов,
	|		АвансовыйОтчетЗапасы.Всего - АвансовыйОтчетЗапасы.СуммаРасходовНДФЛ - АвансовыйОтчетЗапасы.СуммаПФ КАК СуммаБезНалоговВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетЗапасы.СуммаНДС * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДСЗакупки,
	|		АвансовыйОтчетЗапасы.Всего КАК СуммаВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетЗапасы.Всего * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|		АвансовыйОтчетЗапасы.Статья КАК Статья,
	|		АвансовыйОтчетЗапасы.ТоварыДляПроизводства КАК ТоварыДляПроизводства,
	|		&ОприходованиеЗапасов КАК СодержаниеПроводки
	|	ИЗ
	|		Документ.АвансовыйОтчет.Запасы КАК АвансовыйОтчетЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|					&МоментВремени,
	|					Валюта В
	|						(ВЫБРАТЬ
	|							Константы.ВалютаУчета
	|						ИЗ
	|							Константы КАК Константы)) КАК КурсыВалютУчета
	|			ПО (ИСТИНА)
	|	ГДЕ
	|		АвансовыйОтчетЗапасы.Ссылка = &Ссылка) КАК АвансовыйОтчетЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансовыйОтчетРасходы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	АвансовыйОтчетРасходы.Период КАК Период,
	|	АвансовыйОтчетРасходы.Организация КАК Организация,
	|	АвансовыйОтчетРасходы.ОрганизацияВНУ КАК ОрганизацияВНУ,
	|	АвансовыйОтчетРасходы.УчитыватьВНУ КАК УчитыватьВНУ,
	|	АвансовыйОтчетРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	АвансовыйОтчетРасходы.СчетУчета КАК СчетУчета,
	|	АвансовыйОтчетРасходы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	АвансовыйОтчетРасходы.Номенклатура КАК Номенклатура,
	|	АвансовыйОтчетРасходы.Сотрудник КАК Сотрудник,
	|	АвансовыйОтчетРасходы.Валюта КАК Валюта,
	|	АвансовыйОтчетРасходы.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	АвансовыйОтчетРасходы.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|	АвансовыйОтчетРасходы.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|	АвансовыйОтчетРасходы.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	|	АвансовыйОтчетРасходы.СчетРасчетовСПерсоналомРегл КАК СчетРасчетовСПерсоналомРегл,
	|	АвансовыйОтчетРасходы.ВидНалогаНДС КАК ВидНалогаНДС,
	|	АвансовыйОтчетРасходы.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	АвансовыйОтчетРасходы.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК СчетНачисленияНДФЛ,
	|	АвансовыйОтчетРасходы.ВидУдержанияНДФЛ.ВидНалогаВыплат.СчетУчетаКВозмещениюРегл КАК СчетКОплатеНДФЛ,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.СчетЗатратРегл КАК СчетЗатратРеглПФ,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.СчетЗатрат КАК СчетЗатратПФ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|			ТОГДА АвансовыйОтчетРасходы.ВидУдержанияПФ.СчетЗатратРегл.ТипСчета
	|		ИНАЧЕ АвансовыйОтчетРасходы.ВидУдержанияПФ.СчетЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчетаЗатратПФ,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.Договор КАК ДоговорПФ,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФСотрудника,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФСотрудника,
	|	АвансовыйОтчетРасходы.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетКОплатеПФОрганизации,
	|	АвансовыйОтчетРасходы.СуммаПФ КАК СуммаПФ,
	|	АвансовыйОтчетРасходы.СуммаПФВал КАК СуммаПФВал,
	|	АвансовыйОтчетРасходы.СуммаНДФЛВал КАК СуммаНДФЛВал,
	|	АвансовыйОтчетРасходы.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	АвансовыйОтчетРасходы.СуммаБезНалогов КАК СуммаБезНалогов,
	|	АвансовыйОтчетРасходы.СуммаБезНалоговВал КАК СуммаБезНалоговВал,
	|	АвансовыйОтчетРасходы.Характеристика КАК Характеристика,
	|	АвансовыйОтчетРасходы.Партия КАК Партия,
	|	АвансовыйОтчетРасходы.Количество КАК Количество,
	|	АвансовыйОтчетРасходы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	АвансовыйОтчетРасходы.Сумма КАК Сумма,
	|	АвансовыйОтчетРасходы.СуммаВал КАК СуммаВал,
	|	АвансовыйОтчетРасходы.СтавкаНДС КАК СтавкаНДС,
	|	АвансовыйОтчетРасходы.СуммаНДС КАК СуммаНДС,
	|	АвансовыйОтчетРасходы.СуммаНДСВал КАК СуммаНДСВал,
	|	АвансовыйОтчетРасходы.СуммаНДСЗакупки КАК СуммаНДСЗакупки,
	|	ВЫРАЗИТЬ(АвансовыйОтчетРасходы.СуммаРасходовНДФЛ КАК ЧИСЛО(15, 2)) КАК СуммаНДФЛ,
	|	АвансовыйОтчетРасходы.ТипСчетУчета КАК ТипСчетУчета,
	|	АвансовыйОтчетРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчетРасходы.Статья = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА &Статья
	|		ИНАЧЕ АвансовыйОтчетРасходы.Статья
	|	КОНЕЦ КАК Статья,
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	&Ссылка КАК Документ
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,АвансовыйОтчетРасходы.AzRyПроект КАК AzRyПроект 
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|ПОМЕСТИТЬ ВременнаяТаблицаРасходы
	|ИЗ
	|	(ВЫБРАТЬ
	|		АвансовыйОтчетРасходы.НомерСтроки КАК НомерСтроки,
	|		АвансовыйОтчетРасходы.Ссылка.Дата КАК Период,
	|		&Организация КАК Организация,
	|		АвансовыйОтчетРасходы.Ссылка.УчитыватьВНУ КАК УчитыватьВНУ,
	|		АвансовыйОтчетРасходы.Ссылка.Организация КАК ОрганизацияВНУ,
	|		АвансовыйОтчетРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		АвансовыйОтчетРасходы.Номенклатура.СчетУчетаЗатрат КАК СчетУчета,
	|		АвансовыйОтчетРасходы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаРегл,
	|		АвансовыйОтчетРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		АвансовыйОтчетРасходы.Номенклатура КАК Номенклатура,
	|		АвансовыйОтчетРасходы.СтавкаНДС КАК СтавкаНДС,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник КАК Сотрудник,
	|		АвансовыйОтчетРасходы.Ссылка.ВалютаДокумента КАК Валюта,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник.СчетРасчетовСПерсоналомРегл КАК СчетРасчетовСПерсоналомРегл,
	|		АвансовыйОтчетРасходы.ВидНалогаНДС КАК ВидНалогаНДС,
	|		АвансовыйОтчетРасходы.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|		АвансовыйОтчетРасходы.СуммаНДФЛ КАК СуммаНДФЛВал,
	|		АвансовыйОтчетРасходы.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|		АвансовыйОтчетРасходы.СуммаПФ КАК СуммаПФВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетРасходы.СуммаПФ * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаПФ,
	|		АвансовыйОтчетРасходы.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		ВЫРАЗИТЬ(АвансовыйОтчетРасходы.СуммаНДФЛ * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаРасходовНДФЛ,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|		ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(АвансовыйОтчетРасходы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|				ТОГДА АвансовыйОтчетРасходы.Количество
	|			ИНАЧЕ АвансовыйОтчетРасходы.Количество * АвансовыйОтчетРасходы.ЕдиницаИзмерения.Коэффициент
	|		КОНЕЦ КАК Количество,
	|		АвансовыйОтчетРасходы.ЗаказПокупателя КАК ЗаказПокупателя,
	|		АвансовыйОтчетРасходы.СуммаНДС КАК СуммаНДСВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетРасходы.СуммаНДС * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|		ВЫРАЗИТЬ((АвансовыйОтчетРасходы.СуммаБезНалогов + АвансовыйОтчетРасходы.СуммаНДС) * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаБезНалогов,
	|		АвансовыйОтчетРасходы.СуммаБезНалогов + АвансовыйОтчетРасходы.СуммаНДС КАК СуммаБезНалоговВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетРасходы.СуммаНДС * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДСЗакупки,
	|		АвансовыйОтчетРасходы.Всего КАК СуммаВал,
	|		АвансовыйОтчетРасходы.Статья КАК Статья,
	|		ВЫРАЗИТЬ(АвансовыйОтчетРасходы.Всего * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|		ВЫБОР
	|			КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|				ТОГДА АвансовыйОтчетРасходы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета
	|			ИНАЧЕ АвансовыйОтчетРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета
	|		КОНЕЦ КАК ТипСчетУчета
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,АвансовыйОтчетРасходы.AzRyПроект КАК AzRyПроект 
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|	ИЗ
	|		Документ.АвансовыйОтчет.Расходы КАК АвансовыйОтчетРасходы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|					&МоментВремени,
	|					Валюта В
	|						(ВЫБРАТЬ
	|							Константы.ВалютаУчета
	|						ИЗ
	|							Константы КАК Константы)) КАК КурсыВалютУчета
	|			ПО (ИСТИНА)
	|	ГДЕ
	|		АвансовыйОтчетРасходы.Ссылка = &Ссылка) КАК АвансовыйОтчетРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(АвансовыйОтчетПлатежныеВедомости.НомерСтроки) КАК НомерСтроки,
	|	АвансовыйОтчетПлатежныеВедомости.Ведомость КАК ПлатежнаяВедомость,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Дата КАК Период,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка КАК Ссылка,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Организация КАК Организация,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник КАК Сотрудник,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПерсоналом КАК СчетРасчетовСПерсоналом,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПерсоналомРегл КАК СчетРасчетовСПерсоналомРегл,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник КАК СотрудникВедомость,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПлатежа * АвансовыйОтчетПлатежныеВедомости.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетПлатежныеВедомости.Ссылка.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаПоСотруднику,
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаПлатежа) КАК СуммаПоСотрудникуВал,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания КАК ВидУдержания,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации КАК ВедомостьВидОперации,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.НДФЛПлатежа * АвансовыйОтчетПлатежныеВедомости.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетПлатежныеВедомости.Ссылка.Кратность) КАК ЧИСЛО(15, 2))) КАК НДФЛПлатежа,
	|	СУММА(ПлатежнаяВедомостьСотрудники.НДФЛПлатежа) КАК НДФЛПлатежаВал,
	|	СУММА(ВЫРАЗИТЬ(ПлатежнаяВедомостьСотрудники.СуммаПФПлатежа * АвансовыйОтчетПлатежныеВедомости.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетПлатежныеВедомости.Ссылка.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаПФПлатежа,
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаПФПлатежа) КАК СуммаПФПлатежаВал,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ПлатежнаяВедомостьСотрудники.СуммаЛгот) КАК СуммаЛгот,
	//++ Giorgi Shagidze Nexia
	|	АвансовыйОтчетПлатежныеВедомости.Ведомость.ПериодРегистрации КАК ПериодРегистрации
	//-- Giorgi Shagidze Nexia
	|ПОМЕСТИТЬ ВременнаяТаблицаПлатежныеВедомости
	|ИЗ
	|	Документ.АвансовыйОтчет.ПлатежныеВедомости КАК АвансовыйОтчетПлатежныеВедомости
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
	|		ПО АвансовыйОтчетПлатежныеВедомости.Ведомость = ПлатежнаяВедомостьСотрудники.Ссылка
	|ГДЕ
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчетПлатежныеВедомости.Ведомость,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.ВидОперации,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Дата,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПерсоналом,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.ВалютаДокумента,
	|	ВЫРАЗИТЬ(АвансовыйОтчетПлатежныеВедомости.Сумма * АвансовыйОтчетПлатежныеВедомости.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетПлатежныеВедомости.Ссылка.Кратность) КАК ЧИСЛО(15, 2)),
	|	АвансовыйОтчетПлатежныеВедомости.Сумма,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовПоПерерасходуРегл,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Сотрудник.СчетРасчетовСПерсоналомРегл,
	|	ПлатежнаяВедомостьСотрудники.Сотрудник,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ,
	|	ПлатежнаяВедомостьСотрудники.ВидУдержания,
	|	АвансовыйОтчетПлатежныеВедомости.Ссылка.Организация,
	|	ПлатежнаяВедомостьСотрудники.Ссылка.СтруктурнаяЕдиница";
	
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаЗапасы(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыКПоступлениюНаСклады(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗакупки(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПлатежныйКалендарь(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	//ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_АвансовыйОтчет(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства); //+++ Дмгг
	СформироватьТаблицаЗакупкиДляКУДиР(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыНДФЛ(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);//Паганини
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_АвансовыйОтчет(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	//Паганини ПФ_
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаРасчетыСПенсионнымФондом_АвансовыйОтчет(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаДекларация_АвансовыйОтчет(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	//_Паганини ПФ
	СформироватьТаблицаНалоговыеЛготы(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОстаткиНалоговыхЛьгот(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	
	//СформироватьТаблицаРасчетыСПерсоналом(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства); //+++ Дмгг
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

&Вместо("СформироватьТаблицаРасчетыСПодотчетниками")
Процедура РасшAzRy_СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства)
	
	Если Не ДокументСсылкаАвансовыйОтчет.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
		ПродолжитьВызов(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАвансовыйОтчет);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ПогашениеДолгаПодотчетника", НСтр("ka='საქვეანგარიშო პირის ვალის დაფარვა';ru='Погашение долга подотчетника';en='Repayment of debt podotchetnika'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов); //+++ ДМГГ	
	
	// +++ { AzRy - [28.11.2013] - Jira://--// - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment://--//
	Если (Не ДокументСсылкаАвансовыйОтчет.ВыданныеАвансы.Количество() = 0) Тогда // Tu carielia is seleqti romelshic shevitane cvlilebebi ar shesruldeba isedac. ase rom "ВалютаДенежныхСредств=Неопределено"
		Если ДокументСсылкаАвансовыйОтчет.ВыданныеАвансы[0].Документ.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.AzRyПоставщикуПодотчетнику 
			Или ДокументСсылкаАвансовыйОтчет.ВыданныеАвансы[0].Документ.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику Тогда
			Запрос.УстановитьПараметр("ВалютаДенежныхСредств", ДокументСсылкаАвансовыйОтчет.ВыданныеАвансы[0].Документ.РасшифровкаПлатежа[0].AzRyВалюта);
		Иначе 
			Запрос.УстановитьПараметр("ВалютаДенежныхСредств", ДокументСсылкаАвансовыйОтчет.ВыданныеАвансы[0].Документ.ВалютаДенежныхСредств);
		КонецЕсли;
	Иначе
		    Запрос.УстановитьПараметр("ВалютаДенежныхСредств", Неопределено);
	КонецЕсли;
	// +++ } AzRy - [28.11.2013] - Jira://--// - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment://--//	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицыДокумента.ЭтоЗП КАК ЭтоЗП,
	|	МАКСИМУМ(ТаблицыДокумента.НомерСтроки) КАК НомерСтроки,
	|	&ПогашениеДолгаПодотчетника КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ТаблицыДокумента.Период КАК Период,
	|	ТаблицыДокумента.Сотрудник КАК Сотрудник,
	|	ТаблицыДокумента.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	ТаблицыДокумента.СчетРасчетовПоПерерасходу КАК СчетУчета,
	|	ТаблицыДокумента.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|	ТаблицыДокумента.СчетРасчетовПоПерерасходуРегл КАК СчетУчетаРегл,
	|	ТаблицыДокумента.Валюта КАК Валюта,
	|	&Ссылка КАК Документ,
	|	СУММА(ТаблицыДокумента.Сумма) КАК Сумма,
	|	СУММА(ТаблицыДокумента.СуммаВал) КАК СуммаВал,
	|	ТаблицыДокумента.Статья
	|ПОМЕСТИТЬ ВременнаяТаблицаРасходыПодотчетногоЛица
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЛОЖЬ КАК ЭтоЗП,
	|		МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|		ТаблицаДокумента.Период КАК Период,
	|		ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	|		ТаблицаДокумента.Валюта КАК Валюта,
	|		ТаблицаДокумента.Статья КАК Статья,
	|		СУММА(ТаблицаДокумента.СуммаБезНалогов) КАК Сумма,
	|		СУММА(ТаблицаДокумента.СуммаБезНалоговВал) КАК СуммаВал
	|	ИЗ
	|		ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходу,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходуРегл,
	|		ТаблицаДокумента.Статья,
	|		ТаблицаДокумента.Валюта
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЛОЖЬ,
	|		МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходу,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходуРегл,
	|		ТаблицаДокумента.Валюта,
	|		ТаблицаДокумента.Статья,
	|		СУММА(ТаблицаДокумента.СуммаБезНалогов),
	|		СУММА(ТаблицаДокумента.СуммаБезНалоговВал)
	|	ИЗ
	|		ВременнаяТаблицаРасходы КАК ТаблицаДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходу,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходуРегл,
	|		ТаблицаДокумента.Статья,
	|		ТаблицаДокумента.Валюта
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЛОЖЬ,
	|		МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходу,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходуРегл,
	|		ТаблицаДокумента.ВалютаДокумента,
	|		ТаблицаДокумента.Статья,
	|		СУММА(ТаблицаДокумента.Сумма),
	
	//|		СУММА(ТаблицаДокумента.СуммаПлатежа)
	|		СУММА(ТаблицаДокумента.СуммаВал)
	
	|	ИЗ
	|		ВременнаяТаблицаОплаты КАК ТаблицаДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходу,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовПоПерерасходуРегл,
	|		ТаблицаДокумента.Статья,
	|		ТаблицаДокумента.ВалютаДокумента
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИСТИНА,
	|		МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовСПерсоналом,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовСПерсоналомРегл,
	|		ТаблицаДокумента.ВалютаДокумента,
	|		NULL,
	|		СУММА(ТаблицаДокумента.СуммаПоСотруднику),
	|		СУММА(ТаблицаДокумента.СуммаПоСотрудникуВал)
	|	ИЗ
	|		ВременнаяТаблицаПлатежныеВедомости КАК ТаблицаДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Сотрудник,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетниками,
	|		ТаблицаДокумента.СчетРасчетовСПерсоналом,
	|		ТаблицаДокумента.СчетРасчетовСПодотчетникамиРегл,
	|		ТаблицаДокумента.СчетРасчетовСПерсоналомРегл,
	|		ТаблицаДокумента.ВалютаДокумента) КАК ТаблицыДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицыДокумента.ЭтоЗП,
	|	ТаблицыДокумента.Период,
	|	ТаблицыДокумента.Сотрудник,
	|	ТаблицыДокумента.СчетРасчетовСПодотчетниками,
	|	ТаблицыДокумента.СчетРасчетовПоПерерасходу,
	|	ТаблицыДокумента.СчетРасчетовСПодотчетникамиРегл,
	|	ТаблицыДокумента.СчетРасчетовПоПерерасходуРегл,
	|	ТаблицыДокумента.Валюта,
	|	ТаблицыДокумента.Статья
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	&ПогашениеДолгаПодотчетника КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	ТаблицаДокумента.Ссылка.Сотрудник КАК Сотрудник,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетУчета,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл КАК СчетРасчетовСПодотчетникамиРегл,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовПоПерерасходуРегл КАК СчетРасчетовПоПерерасходуРегл,
	//+++ Дмгг
	//|	ТаблицаДокумента.Документ.ВалютаДенежныхСредств КАК Валюта, 
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Конвертация
	|			ТОГДА ТаблицаДокумента.Документ.ВалютаПолучатель
	// +++ { AzRy - [08.12.2021] - Developer:გიორგი მამულაშვილი - Comment: 
	//|		ИНАЧЕ ТаблицаДокумента.Документ.ВалютаДенежныхСредств
	// +++ { AzRy - [28.11.2013] - Jira://--// - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment://--//
	|	ИНАЧЕ &ВалютаДенежныхСредств
	// +++ } AzRy - [28.11.2013] - Jira://--// - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment://--//	
	// +++ } AzRy - [08.12.2021] - Developer:გიორგი მამულაშვილი - Comment:	
	
	|	КОНЕЦ КАК Валюта,
	//--- Дмгг		
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.Документ.Статья КАК Статья,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.Сумма * КурсыВалютВыданныхАвансов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютВыданныхАвансов.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаВал,
	|	-СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.Сумма * КурсыВалютВыданныхАвансов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютВыданныхАвансов.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаДляОстатка,
	|	-СУММА(ТаблицаДокумента.Сумма) КАК СуммаВалДляОстатка
	|ПОМЕСТИТЬ ВременнаяТаблицаВыданныеАвансы
	|ИЗ
	|	Документ.АвансовыйОтчет.ВыданныеАвансы КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютВыданныхАвансов
	//|		ПО ТаблицаДокумента.Документ.ВалютаДенежныхСредств = КурсыВалютВыданныхАвансов.Валюта
	|		ПО ВЫБОР
	|			КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Конвертация
	|				ТОГДА ТаблицаДокумента.Документ.ВалютаПолучатель
	// +++ { AzRy - [08.12.2021] - Developer:გიორგი მამულაშვილი - Comment: 
	//|				ИНАЧЕ ТаблицаДокумента.Документ.ВалютаДенежныхСредств
	// +++ { AzRy - [28.11.2013] - Jira://--// - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment://--//
	|		ИНАЧЕ &ВалютаДенежныхСредств
	// +++ } AzRy - [28.11.2013] - Jira://--// - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment://--//	
	// +++ } AzRy - [08.12.2021] - Developer:გიორგი მამულაშვილი - Comment:
	|		КОНЕЦ = КурсыВалютВыданныхАвансов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Ссылка.Сотрудник,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетникамиРегл,
	//|	ТаблицаДокумента.Документ.ВалютаДенежныхСредств
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Конвертация
	|			ТОГДА ТаблицаДокумента.Документ.ВалютаПолучатель
	// +++ { AzRy - [08.12.2021] - Developer:გიორგი მამულაშვილი - Comment: 
	//|		ИНАЧЕ ТаблицаДокумента.Документ.ВалютаДенежныхСредств
	// +++ { AzRy - [28.11.2013] - Jira://--// - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment://--//
	|	ИНАЧЕ  &ВалютаДенежныхСредств
	// +++ } AzRy - [28.11.2013] - Jira://--// - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment://--//	
	// +++ } AzRy - [08.12.2021] - Developer:გიორგი მამულაშვილი - Comment:
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	Валюта,
	|	Документ,
	|	СчетУчета,
	|	СчетУчетаРегл";
	
	Запрос.ВыполнитьПакет();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с подотчетными лицами.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВременнаяТаблицаВыданныеАвансы.Организация КАК Организация,
	|	ВременнаяТаблицаВыданныеАвансы.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблицаВыданныеАвансы.Валюта КАК Валюта,
	|	ВременнаяТаблицаВыданныеАвансы.Документ КАК Документ
	|ИЗ
	|	ВременнаяТаблицаВыданныеАвансы КАК ВременнаяТаблицаВыданныеАвансы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПодотчетниками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	//Паганини_
	//|	ТаблицаДокумента.Сумма КАК Сумма
	|	ТаблицаДокумента.СуммаБезНалогов КАК Сумма
	//_Паганини
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	//Паганини_
	//|	ТаблицаДокумента.Сумма
	|	ТаблицаДокумента.СуммаБезНалогов
	//_Паганини
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаОплаты.Сумма
	|ИЗ
	|	ВременнаяТаблицаОплаты КАК ВременнаяТаблицаОплаты
	//+++ Дмгг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаПлатежныеВедомости.СуммаПоСотруднику
	|ИЗ
	|	ВременнаяТаблицаПлатежныеВедомости КАК ВременнаяТаблицаПлатежныеВедомости
	//--- Дмгг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыОстатки.Организация КАК Организация,
	|	РасчетыОстатки.Сотрудник КАК Сотрудник,
	|	РасчетыОстатки.Валюта КАК Валюта,
	|	РасчетыОстатки.Документ КАК Документ,
	|	РасчетыОстатки.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетУчета,
	|	РасчетыОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл КАК СчетУчетаРегл, //+++
	|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
	|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВременнаяТаблица.Организация КАК Организация,
	|		ВременнаяТаблица.Сотрудник КАК Сотрудник,
	|		ВременнаяТаблица.Валюта КАК Валюта,
	|		ВременнаяТаблица.Документ КАК Документ,
	|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
	|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
	|	ИЗ
	|		ВременнаяТаблицаВыданныеАвансы КАК ВременнаяТаблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаОстатки.Организация,
	|		ТаблицаОстатки.Сотрудник,
	|		ТаблицаОстатки.Валюта,
	|		ТаблицаОстатки.Документ,
	|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
	|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
	|	ИЗ
	|		РегистрНакопления.РасчетыСПодотчетниками.Остатки(
	|				&МоментВремени,
	|				(Организация, Сотрудник, Валюта, Документ) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВременнаяТаблицаВыданныеАвансы.Организация,
	|						ВременнаяТаблицаВыданныеАвансы.Сотрудник,
	|						ВременнаяТаблицаВыданныеАвансы.Валюта,
	|						ВременнаяТаблицаВыданныеАвансы.Документ
	|					ИЗ
	|						ВременнаяТаблицаВыданныеАвансы)) КАК ТаблицаОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокумента.Организация,
	|		ДвиженияДокумента.Сотрудник,
	|		ДвиженияДокумента.Валюта,
	|		ДвиженияДокумента.Документ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РасчетыСПодотчетниками КАК ДвиженияДокумента
	|	ГДЕ
	|		ДвиженияДокумента.Регистратор = &Ссылка
	|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыОстатки.Организация,
	|	РасчетыОстатки.Сотрудник,
	|	РасчетыОстатки.Валюта,
	|	РасчетыОстатки.Документ,
	|	РасчетыОстатки.Сотрудник.СчетРасчетовСПодотчетниками
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	Валюта,
	|	Документ,
	|	СчетУчета,
	|	СчетУчетаРегл //+++ Дмгг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	1 КАК НомерСтроки,
	|	&ПериодКонтроля КАК Дата,
	|	ТаблицаРасчеты.Организация КАК Организация,
	|	ТаблицаРасчеты.Сотрудник КАК Сотрудник,
	|	ТаблицаРасчеты.Валюта КАК Валюта,
	|	ТаблицаРасчеты.Документ КАК Документ,
	|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
	|	ТаблицаРасчеты.СчетУчета КАК СчетУчета,
	|	ТаблицаРасчеты.СчетУчетаРегл КАК СчетУчетаРегл //+++
	|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками
	|ИЗ
	|	ВременнаяТаблицаВыданныеАвансы КАК ТаблицаРасчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
	|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
	|			И ТаблицаРасчеты.Сотрудник = ТаблицаОстатки.Сотрудник
	|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.Валюта
	|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
	|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
	//+++ Дмгг
	//|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
	|			И ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА ТаблицаРасчеты.СчетУчетаРегл = ТаблицаОстатки.СчетУчетаРегл
	|				ИНАЧЕ ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
	|			КОНЕЦ
	//--- Дмгг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаВалютаУчета.Значение
	|					ИЗ
	|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВременнаяТаблицаВыданныеАвансы.Валюта
	|					ИЗ
	|						ВременнаяТаблицаВыданныеАвансы)) КАК КурсыВалютРасчетовСрезПоследних
	|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
	|ГДЕ
	|	(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
	|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
	|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
	|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРегл КАК СчетУчетаРегл, //+++
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Валюта КАК Валюта,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ТаблицаДокумента.СуммаВал КАК СуммаВал
	|ИЗ
	|	ВременнаяТаблицаВыданныеАвансы КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.СодержаниеПроводки,
	|	ТаблицаДокумента.ВидДвижения,
	|	ТаблицаДокумента.СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРегл, //+++
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Сотрудник,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Валюта,
	|	ТаблицаДокумента.Сумма - ЕСТЬNULL(ТаблицаВыданныеАвансы.Сумма, 0),
	|	ТаблицаДокумента.СуммаВал - ЕСТЬNULL(ТаблицаВыданныеАвансы.СуммаВал, 0)
	|ИЗ
	|	ВременнаяТаблицаРасходыПодотчетногоЛица КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВременнаяТаблицаВыданныеАвансы.Валюта КАК Валюта,
	|			СУММА(ВременнаяТаблицаВыданныеАвансы.Сумма) КАК Сумма,
	|			СУММА(ВременнаяТаблицаВыданныеАвансы.СуммаВал) КАК СуммаВал
	|		ИЗ
	|			ВременнаяТаблицаВыданныеАвансы КАК ВременнаяТаблицаВыданныеАвансы
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВременнаяТаблицаВыданныеАвансы.Валюта) КАК ТаблицаВыданныеАвансы
	|		ПО ТаблицаДокумента.Валюта = ТаблицаВыданныеАвансы.Валюта
	|ГДЕ
	|	ТаблицаДокумента.СуммаВал - ЕСТЬNULL(ТаблицаВыданныеАвансы.СуммаВал, 0) > 0
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	3,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	&КурсоваяРазница,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|	КОНЕЦ,
	//|	ТаблицаДокумента.СчетУчета,
	//|	ТаблицаДокумента.СчетУчетаРегл,
	//|	ТаблицаДокумента.Документ,
	//|	ТаблицаДокумента.Сотрудник,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ТаблицаДокумента.Валюта,
	//|	ВЫБОР
	//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	//|	КОНЕЦ,
	//|	0
	//|ИЗ
	//|	ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаСумм = МассивРезультатов[0].Выгрузить(); // таблица для расчета ошибки округления
	ТаблицаРезультата = МассивРезультатов[3].Выгрузить();
	
	СуммаВсего = ТаблицаСумм.Итог("Сумма"); // сумма для расчета ошибки округления
	СуммаРезультата = ТаблицаРезультата.Итог("Сумма");
	РазницаРезультата = СуммаВсего - СуммаРезультата;
	
	//Если РазницаРезультата <> 0
	//	И ТаблицаРезультата.Количество() > 0 Тогда
	//	ТаблицаРезультата[0].Сумма = ТаблицаРезультата[0].Сумма + РазницаРезультата;
	//КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПодотчетниками", ТаблицаРезультата);
		
КонецПроцедуры

&Вместо("СформироватьТаблицаОплатаСчетовИЗаказов")
Процедура РасшAzRy_СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства)
	
	Если Не ДокументСсылкаАвансовыйОтчет.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
		ПродолжитьВызов(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.СчетНаОплату КАК СчетНаОплату,
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	ТаблицаДокумента.AzRyПроект КАК Проект,
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА ТаблицаДокумента.ВалютаДокумента = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаПлатежа
	|			КОГДА ТаблицаДокумента.Валюта = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаВал
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) КАК СуммаАванса,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА ТаблицаДокумента.ВалютаДокумента = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаПлатежа
	|			КОГДА ТаблицаДокумента.Валюта = ТаблицаДокумента.СчетНаОплату.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаВал
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) КАК СуммаОплаты
	|ИЗ
	|	ВременнаяТаблицаОплаты КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютСчета
	|		ПО ТаблицаДокумента.СчетНаОплату.ВалютаДокумента = КурсыВалютСчета.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДокумента = КурсыВалютКассы.Валюта
	|ГДЕ
	|	ТаблицаДокумента.СчетНаОплату <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПоставщика.ПустаяСсылка)
	|	И ТаблицаДокумента.ВестиУчетОплатыПоСчетам
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.СчетНаОплату
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,ТаблицаДокумента.AzRyПроект
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Период,
	|	&Организация,
	|	ТаблицаДокумента.Заказ,
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	ТаблицаДокумента.AzRyПроект КАК Проект,
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	|			КОГДА ТаблицаДокумента.ВалютаДокумента = ТаблицаДокумента.Заказ.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаПлатежа
	|			КОГДА ТаблицаДокумента.Валюта = ТаблицаДокумента.Заказ.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаВал
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.ПризнакАванса
	|				ТОГДА 0
	
	// AzRy
	//|			КОГДА ТаблицаДокумента.ВалютаДокумента = ТаблицаДокумента.Заказ.ВалютаДокумента
	//|				ТОГДА ТаблицаДокумента.СуммаПлатежа
	// AzRy
	
	|			КОГДА ТаблицаДокумента.Валюта = ТаблицаДокумента.Заказ.ВалютаДокумента
	|				ТОГДА ТаблицаДокумента.СуммаВал
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютСчета.Кратность / (КурсыВалютСчета.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ)
	|ИЗ
	|	ВременнаяТаблицаОплаты КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютСчета
	|		ПО ТаблицаДокумента.Заказ.ВалютаДокумента = КурсыВалютСчета.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютКассы
	|		ПО ТаблицаДокумента.ВалютаДокумента = КурсыВалютКассы.Валюта
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Заказ) = ТИП(Документ.ЗаказПокупателя)
	|				И ТаблицаДокумента.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Заказ) = ТИП(Документ.ЗаказПоставщику)
	|				И ТаблицаДокумента.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Заказ
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,ТаблицаДокумента.AzRyПроект
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОплатаСчетовИЗаказов", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

&Вместо("СформироватьТаблицаРасчетыСПоставщиками_deleteme")
Процедура РасшAzRy_СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства)
	
	Если Не ДокументСсылкаАвансовыйОтчет.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
		ПродолжитьВызов(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
		Возврат;
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАвансовыйОтчет);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ПогашениеОбязательствПередПоставщиком", "Погашение обязательств перед поставщиком");
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	//ПодольскийАИ #УчетПроектов 15.02.2021 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 15.02.2021 }
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаОплаты.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаОплаты.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаОплаты.ПризнакАванса
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаОплаты.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	&ПогашениеОбязательствПередПоставщиком КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаОплаты.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ КАК ТипРасчетов,
	|	ВременнаяТаблицаОплаты.СчетУчета КАК СчетУчета,
	|	ВременнаяТаблицаОплаты.СчетУчетаРегл КАК СчетУчетаРегл, //+++
	|	ВременнаяТаблицаОплаты.Валюта КАК Валюта,
	|	ВременнаяТаблицаОплаты.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаОплаты.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаОплаты.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаОплаты.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	//ПодольскийАИ #УчетПроектов 15.02.2021 {
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) КАК Проект,
	//ПодольскийАИ #УчетПроектов 15.02.2021 }
	|	ВременнаяТаблицаОплаты.Период КАК Дата,
	|	СУММА(ВременнаяТаблицаОплаты.Сумма) КАК Сумма,
	|	СУММА(ВременнаяТаблицаОплаты.СуммаВал) КАК СуммаВал,
	|	-СУММА(ВременнаяТаблицаОплаты.Сумма) КАК СуммаДляОстатка,
	|	-СУММА(ВременнаяТаблицаОплаты.СуммаВал) КАК СуммаВалДляОстатка
	
	|	,Истина КАК ВестиРасчетыПоДокументам
	
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщиками
	|ИЗ
	|	ВременнаяТаблицаОплаты КАК ВременнаяТаблицаОплаты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаОплаты.НомерСтроки,
	|	ВременнаяТаблицаОплаты.СчетУчета,
	|	ВременнаяТаблицаОплаты.СчетУчетаРегл, //+++
	|	ВременнаяТаблицаОплаты.Валюта,
	|	ВременнаяТаблицаОплаты.Контрагент,
	|	ВременнаяТаблицаОплаты.Договор,
	|	ВременнаяТаблицаОплаты.Период,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаОплаты.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаОплаты.ПризнакАванса
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаОплаты.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаОплаты.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаОплаты.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаОплаты.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 15.02.2021 {
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//ПодольскийАИ #УчетПроектов 15.02.2021 }
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов,
	|	СчетУчета,
	|	СчетУчетаРегл";
	
	// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment: 
	AzRyУправлениеНебольшойФирмойСервер.ПриходнаяНакладная_ИнициализироватьДанныеДокумента_ДопТекстЗапроса("АвансовыйОтчет", Запрос, ДокументСсылкаАвансовыйОтчет.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено, "Оплаты");	
	// +++ } AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment:	
	
	Запрос.Выполнить();

	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПоставщиками.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПоставщиками";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщиками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	//// +++ { AzRy - [17.01.2022] - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:
	//Если ДокументСсылкаАвансовыйОтчет.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
	//	
	//	// +++ { AzRy - [17.01.2022] - Jira:ERPM-223 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:კურსი დოკ. კურსზე დავსვით
	//	Запрос.УстановитьПараметр("КурсыВалютРасчетовСрезПоследних_Курс", ДокументСсылкаАвансовыйОтчет.Курс);
	//	Запрос.УстановитьПараметр("КурсыВалютРасчетовСрезПоследних_Кратность", ДокументСсылкаАвансовыйОтчет.Кратность);
	//	// +++ } AzRy - [17.01.2022] - Jira:ERPM-223 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:კურსი დოკ. კურსზე დავსვით
	//	
	//	// +++ { AzRy - [17.01.2022] - Developer:გიორგი მამულაშვილი - Comment:
	//	AzRyУправлениеНебольшойФирмойСервер.Сформировать_ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная(Запрос);
	//	// +++ } AzRy - [17.01.2022] - Developer:გიორგი მამულაშვილი - Comment:
	//	
	//	НомерЗапроса = 0;
	//	Запрос.Текст = AzRyУправлениеНебольшойФирмойСервер.AzRy_ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса, ДокументСсылкаАвансовыйОтчет);
	//	МассивРезультатов = Запрос.ВыполнитьПакет();
	//	
	//	НомерЗапроса = 0;
	//	Запрос.Текст = AzRyУправлениеНебольшойФирмойСервер.AzRy_ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиРегл(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса,, ДокументСсылкаАвансовыйОтчет);
	//	МассивРезультатов = Запрос.ВыполнитьПакет();		
	//Иначе 	
		НомерЗапроса = 0;
		Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		//+++
		НомерЗапроса = 0;
		Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиРегл(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		//---	
	//КонецЕсли;
	//// +++ } AzRy - [17.01.2022] - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:	
		
	ТаблицаРезультата = МассивРезультатов[НомерЗапроса].Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", ТаблицаРезультата);	
	
КонецПроцедуры

&Вместо("СформироватьТаблицаДоходыИРасходы")
Процедура РасшAzRy_СформироватьТаблицаДоходыИРасходы(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства)
	
	
	МассивСчетовФинРезРасходы = РегламентированныйУчетСервер.ПолучитьСчетаФинРезРасход();
	СтруктураСчетовКурсРазниц = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(СтруктураДополнительныеСвойства.ДляПроведения.Организация, СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАвансовыйОтчет);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ПрочиеРасходы", НСтр("ka='დანახარჯების ასახვა';ru='Отражение затрат';en='reflection costs'"));
	Запрос.УстановитьПараметр("СчетаФинРезРасходы", МассивСчетовФинРезРасходы);
	
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность);
		
	Иначе
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);

	КонецЕсли;
	//Паганини ПФ_
	Запрос.УстановитьПараметр("ЗатратаПенсионногоФонда",	НСтр("ka='ორგანიზაციის ხარჯი საპენსიო ფონდისთვის';ru='Удержание организации для пенсионного фонда';en='Hold the organization to the Pension Fund'"));
	//_Паганини ПФ
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Валюта КАК Аналитика,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ КАК Сумма
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,NULL КАК Проект
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСчетУчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|		ИНАЧЕ ТаблицаДокумента.НаправлениеДеятельности
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСчетУчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаДокумента.ЗаказПокупателя
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРегл,
	|	ТаблицаДокумента.Номенклатура,
	|	&ПрочиеРасходы,
	|	0,
	|	ТаблицаДокумента.Сумма,
	|	ТаблицаДокумента.Сумма
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,ТаблицаДокумента.AzRyПроект КАК Проект
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаДокумента
	|ГДЕ
	|	(ТаблицаДокумента.ТипСчетУчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ИЛИ ТаблицаДокумента.ТипСчетУчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|	ИЛИ ТаблицаДокумента.СчетУчетаРегл В (&СчетаФинРезРасходы)
	|
	//Паганини ПФ_
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2.1,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСчетаЗатратПФ = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|		ИНАЧЕ ТаблицаДокумента.НаправлениеДеятельности
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСчетаЗатратПФ = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаДокумента.ЗаказПокупателя
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетЗатратПФ,
	|	ТаблицаДокумента.СчетЗатратРеглПФ,
	|	ТаблицаДокумента.Номенклатура,
	|	&ЗатратаПенсионногоФонда,
	|	0,
	|	ТаблицаДокумента.СуммаПФ,
	|	ТаблицаДокумента.СуммаПФ
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,ТаблицаДокумента.AzRyПроект КАК Проект
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.СуммаПФ > 0
	|	И НЕ ТаблицаДокумента.ВидУдержанияПФ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2.1,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСчетаЗатратПФ = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|		ИНАЧЕ ТаблицаДокумента.НаправлениеДеятельности
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТипСчетаЗатратПФ = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаДокумента.ЗаказПокупателя
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетЗатратПФ,
	|	ТаблицаДокумента.СчетЗатратРеглПФ,
	|	ТаблицаДокумента.Номенклатура,
	|	&ЗатратаПенсионногоФонда,
	|	0,
	|	ТаблицаДокумента.СуммаПФ,
	|	ТаблицаДокумента.СуммаПФ
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,NULL КАК Проект
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.СуммаПФ > 0
	|	И НЕ ТаблицаДокумента.ВидУдержанияПФ = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)
	|
	//_Паганини ПФ
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	&КурсоваяРазница,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,NULL КАК Проект
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	ТаблицаДокумента.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
