
//&После("ОбработкаПроверкиЗаполнения_Deprecated")
//Процедура РасшAzRy_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//	
//	//Если AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
//	//	Отказ = Ложь;
//	//КонецЕсли;
//	
//КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура РасшAzRy_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходныйОрдер")] = "ЗаполнитьПоПриходномуОрдеру";
	СтратегияЗаполнения[Тип("ДокументСсылка.РасходИзКассы")] = "ЗаполнитьПоРасходуИзКассы";
	СтратегияЗаполнения[Тип("ДокументСсылка.РасходСоСчета")] = "ЗаполнитьПоРасходуСоСчета";
	
	// +++ { AzRy - [06.06.2022] - Jira:ERPM-887 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПриходнаяНакладная";
	СтратегияЗаполнения[Тип("ДокументСсылка.ДополнительныеРасходы")] = "ЗаполнитьПоДополнительныеРасходы";
	// +++ } AzRy - [06.06.2022] - Jira:ERPM-887 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры

// +++ { AzRy - [06.06.2022] - Jira:ERPM-887 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
Процедура ЗаполнитьПоПриходнаяНакладная(ДанныеЗаполнения) Экспорт 
	
	Организация = ДанныеЗаполнения.Организация;
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	Оплаты.Очистить();
	
	НоваяСтрока = Оплаты.Добавить();
	НоваяСтрока.Контрагент	= ДанныеЗаполнения.Контрагент;
	НоваяСтрока.Договор		= ДанныеЗаполнения.Договор;
	НоваяСтрока.Заказ		= ДанныеЗаполнения.Заказ;
	НоваяСтрока.ПризнакАванса	= Ложь;
	НоваяСтрока.Документ		= ДанныеЗаполнения.Ссылка;
	НоваяСтрока.СуммаРасчетов	= ДанныеЗаполнения.СуммаДокумента;
	НоваяСтрока.Курс			= ДанныеЗаполнения.Курс;
	НоваяСтрока.Кратность		= ДанныеЗаполнения.Кратность;
	НоваяСтрока.СуммаПлатежа	= ДанныеЗаполнения.СуммаДокумента * ДанныеЗаполнения.Курс / ДанныеЗаполнения.Кратность;
	НоваяСтрока.ДатаВходящегоДокумента	= ДанныеЗаполнения.ДатаВходящегоДокумента;
	НоваяСтрока.НомерВходящегоДокумента	= ДанныеЗаполнения.НомерВходящегоДокумента;
	
КонецПроцедуры // ЗаполнитьПоРасходСоСчета()

Процедура ЗаполнитьПоДополнительныеРасходы(ДанныеЗаполнения) Экспорт 
	
	Организация = ДанныеЗаполнения.Организация;
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	Оплаты.Очистить();
	
	НоваяСтрока = Оплаты.Добавить();
	НоваяСтрока.Контрагент	= ДанныеЗаполнения.Контрагент;
	НоваяСтрока.Договор		= ДанныеЗаполнения.Договор;
	НоваяСтрока.Заказ		= ДанныеЗаполнения.ЗаказПоставщику;
	НоваяСтрока.ПризнакАванса	= Ложь;
	НоваяСтрока.Документ		= ДанныеЗаполнения.Ссылка;
	НоваяСтрока.СуммаРасчетов	= ДанныеЗаполнения.СуммаДокумента;
	НоваяСтрока.Курс			= ДанныеЗаполнения.Курс;
	НоваяСтрока.Кратность		= ДанныеЗаполнения.Кратность;
	НоваяСтрока.СуммаПлатежа	= ДанныеЗаполнения.СуммаДокумента * ДанныеЗаполнения.Курс / ДанныеЗаполнения.Кратность;
	НоваяСтрока.ДатаВходящегоДокумента	= ДанныеЗаполнения.ДатаВходящегоДокумента;
	НоваяСтрока.НомерВходящегоДокумента	= ДанныеЗаполнения.НомерВходящегоДокумента;
	
КонецПроцедуры // ЗаполнитьПоРасходСоСчета()
// +++ } AzRy - [06.06.2022] - Jira:ERPM-887 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
