
#Область ОписаниеПеременных

&НаКлиенте
Перем ОбновитьПодчиненнуюСчетФактуру;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата())); //+++ Дмгг

	//+++ Дмгг
	ИспользоватьПроекты = ПолучитьФункциональнуюОпцию("УчетПоПроектам");
	//--- Дмгг
	
	Если Параметры.Свойство("СозданПоКомандеИзФормыСписка") Тогда
		СозданПоКомандеИзФормыСписка = Параметры.СозданПоКомандеИзФормыСписка;
	Иначе
		СозданПоКомандеИзФормыСписка = Ложь;
	КонецЕсли;
	
	ФормаСоздана = Истина;
	
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	ЭтотОбъект.ОснованиеСоздания = Параметры.Основание;
	
	// Предопределенные значения
	ВариантЗаполненияРасшифровкиАвтоматически = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияРасшифровкиПлатежа.Автоматически");
	ВариантЗаполненияРасшифровкиСПомощником = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияРасшифровкиПлатежа.СПомощником");
	ВариантЗаполненияРасшифровкиВручную = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияРасшифровкиПлатежа.Вручную");
	
	ВидОперацииОтПокупателя = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя;
	ВидОперацииЭквайринг = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам;
	ВидОперацииОтПоставщика = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика;
	ВидОперацииОтКурьерскойКомпанииПочты = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты;
	
	УчетПоКомпании = Константы.УчетПоКомпании.Получить();
	// Конец Предопределенные значения
	
	// Зачет долгов
	Если Объект.ВариантЗаполненияРасшифровки.Пустая() ИЛИ
		(Объект.Ссылка.Пустая() И Параметры.Свойство("Основание") И ЗначениеЗаполнено(Параметры.Основание)) Тогда
		Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиВручную;
	ИначеЕсли Объект.Ссылка.Пустая() И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		ИмяКлючаОбъекта = СтрЗаменить(ИмяФормы,".","");
		СохраненноеЗначение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+"_ВариантЗаполненияРасшифровки");
		Если ЗначениеЗаполнено(СохраненноеЗначение) Тогда
			Объект.ВариантЗаполненияРасшифровки = СохраненноеЗначение;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьИнформациюОСуммеИВалютеОснования();
	// Конец Зачет долгов
	
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		Объект.РасшифровкаПлатежа.Добавить();
		Объект.РасшифровкаПлатежа[0].СуммаПлатежа = Объект.СуммаДокумента;
	КонецЕсли;
	
	//ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Если Объект.Ссылка.Пустая() //ДокументОбъект.ЭтоНовый()
	И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Если ЗначениеЗаполнено(Параметры.ДокументОснование) Тогда
			ЗаполнитьПоДокументу(Параметры.ДокументОснование);
		ИначеЕсли Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
			Объект.ВидОперации = ВидОперацииОтПокупателя;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.БанковскийСчет)
			И ТипЗнч(Объект.БанковскийСчет.Владелец) <> Тип("СправочникСсылка.Организации") Тогда
			Объект.БанковскийСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Организация)
			И ЗначениеЗаполнено(Объект.БанковскийСчет)
			И Объект.БанковскийСчет.Владелец <> Объект.Организация Тогда
			Объект.Организация = Объект.БанковскийСчет.Владелец;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
			Если ЗначениеЗаполнено(Объект.ВалютаДенежныхСредств) Тогда
				Если Объект.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств = Объект.ВалютаДенежныхСредств Тогда
					Объект.БанковскийСчет = Объект.Организация.БанковскийСчетПоУмолчанию;
				КонецЕсли;
			Иначе
				Объект.БанковскийСчет = Объект.Организация.БанковскийСчетПоУмолчанию;
				Объект.ВалютаДенежныхСредств = Объект.БанковскийСчет.ВалютаДенежныхСредств;
			КонецЕсли;
		Иначе
			Объект.ВалютаДенежныхСредств = Объект.БанковскийСчет.ВалютаДенежныхСредств;
		КонецЕсли;
		Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником") И
			Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам") Тогда
			Если ЗначениеЗаполнено(Объект.Контрагент)
				И Объект.РасшифровкаПлатежа.Количество() > 0
				И НЕ ЗначениеЗаполнено(Параметры.ДокументОснование) Тогда
				Если НЕ ЗначениеЗаполнено(Объект.РасшифровкаПлатежа[0].Договор) Тогда
					Объект.РасшифровкаПлатежа[0].Договор = Объект.Контрагент.ДоговорПоУмолчанию;
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.РасшифровкаПлатежа[0].Договор) Тогда
					ДоговорВалютаКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.РасшифровкаПлатежа[0].Договор.ВалютаРасчетов));
					Объект.РасшифровкаПлатежа[0].Курс = ?(ДоговорВалютаКурсКратность.Курс = 0, 1, ДоговорВалютаКурсКратность.Курс);
					Объект.РасшифровкаПлатежа[0].Кратность = ?(ДоговорВалютаКурсКратность.Кратность = 0, 1, ДоговорВалютаКурсКратность.Кратность);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// Статья может прийти из шаблона документа или из документа планирования и тогда её заполнять не нужно.
		Если НЕ (Параметры.ЗначенияЗаполнения.Свойство("ШаблонДокумента") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.ШаблонДокумента) И
				Параметры.ЗначенияЗаполнения.Свойство("Статья") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Статья)
			)
			И НЕ (
				(ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ПоступлениеДСПлан") ИЛИ ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ПеремещениеДСПлан"))
				И НЕ Параметры.Основание.СтатьяДвиженияДенежныхСредств.Пустая()
				)
			Тогда
			
			УстановитьСтатьюДДС();
			Если НЕ Объект.Контрагент.Пустая() Тогда
				УстановитьСтатьиДДСВРасшифровкеПлатежа();
			КонецЕсли;
			
		ИначеЕсли	((ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ПоступлениеДСПлан") ИЛИ ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ПеремещениеДСПлан"))
					И НЕ Параметры.Основание.СтатьяДвиженияДенежныхСредств.Пустая()
					)
			Тогда
			
			Объект.УчитыватьВНУ = СтатьяУчитываетсяВНУ(Объект.Статья, Объект.Организация, Объект.Дата);
			
		КонецЕсли;
	КонецЕсли;
	
	// Установка реквизитов формы.
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаДенежныхСредств));
	
	Курс = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	Кратность = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
	УстановитьВидимостьКурсаВалюты(Объект.ВалютаДенежныхСредств);
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Константы.ВалютаУчета.Получить()));
	
	КурсВалютыУчета = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	КратностьВалютыУчета = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
	ДополнитьСписокВыбораВидовОпераций();
	
	СозданиеНового = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) 
	   И НЕ ЗначениеЗаполнено(Параметры.Основание) 
	   И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования)
	   И НЕ Параметры.Свойство("ДокументОснование") Тогда
		ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
		СозданиеНового = Истина;
	Иначе
		УстановитьВидимостьНалогообложениеНДС();
	КонецЕсли;
	
	Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		СтавкаНДСПоУмолчанию = Объект.Организация.СтавкаНДСПоУмолчанию;
	ИначеЕсли Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
		СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
	Иначе
		СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
	КонецЕсли;
	СтавкаНДСПоУмолчаниюЧисло = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтавкаНДСПоУмолчанию);
	
	ВидОперации = Объект.ВидОперации;
	ВалютаДенежныхСредств = Объект.ВалютаДенежныхСредств;
	
	// Счет фактура и документ-основание
	НайденныйСчетФактура = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйСчетФактуру(Объект.Ссылка, Ложь);
	Элементы.СчетФактураНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(НайденныйСчетФактура,,СчетФактураТекст);
	Элементы.СчетФактураНадписьАвто.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(НайденныйСчетФактура,,СчетФактураТекст);
	Элементы.СчетФактураНадписьВручную.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(НайденныйСчетФактура,,СчетФактураТекст);
	Элементы.СчетФактураНадписьСПомощником.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(НайденныйСчетФактура,,СчетФактураТекст);
	
	Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Объект.ДокументОснование, ТолькоПросмотр);
	Элементы.ДокументОснованиеНадписьАвто.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Объект.ДокументОснование, ТолькоПросмотр);
	Элементы.ДокументОснованиеНадписьВручную.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Объект.ДокументОснование, ТолькоПросмотр);
	Элементы.ДокументОснованиеНадписьСПомощником.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Объект.ДокументОснование, ТолькоПросмотр);
	// Конец Счет фактура и документ-основание
	
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	// Зачет долгов
	Если Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником Тогда
		Элементы.СтраницыРасчетовСКонтрагентом.ТекущаяСтраница = Элементы.СтраницаЗаполнениеСПомощником;
	ИначеЕсли Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиВручную Тогда
		Элементы.СтраницыРасчетовСКонтрагентом.ТекущаяСтраница = Элементы.СтраницаРучноеЗаполнение;
	КонецЕсли;
	
	ОбновитьИнформациюОбАвансеВРасшифровкеПлатежа();
	ПересчитатьИтогиПриИзмененииАвансаНаСервере();
	
	ИсходнаяСуммаРавнаНулю = (Объект.СуммаДокумента = 0);
	// Конец Зачет долгов
	
	ВестиРасчетыПоДокументам = Объект.Контрагент.ВестиРасчетыПоДокументам;
	
	//+++ Дмгг
	Если ИспользоватьТолькоРегламентированногоПланаСчетов Тогда 
		УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденцииРегл(СозданиеНового);
	Иначе
		УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденции(СозданиеНового);
	КонецЕсли;
	//--- Дмгг
	
	УстановитьВидимостьЭлементовВЗависимостиОтВидаОперации(Истина);
	УстановитьВидимостьИДоступность();
	
	ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов = Константы.ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов.Получить();
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Налоги Тогда
		Элементы.НаправлениеДеятельностиНалоги.Видимость = ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов;
	КонецЕсли;
	
	// Заполнение табличной части при вводе документа из рабочего места.
	Если ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")
		И Параметры.ЗначенияЗаполнения.Свойство("ЗаполнитьРасшифровкаПлатежа")
		И Параметры.ЗначенияЗаполнения.ЗаполнитьРасшифровкаПлатежа Тогда
		
		СтрокаТабличнойЧасти = Объект.РасшифровкаПлатежа[0];
		
		СтрокаТабличнойЧасти.СуммаПлатежа = Объект.СуммаДокумента;
		СтрокаТабличнойЧасти.Курс = ?(
			СтрокаТабличнойЧасти.Курс = 0,
			1,
			СтрокаТабличнойЧасти.Курс
		);
		
		СтрокаТабличнойЧасти.Кратность = ?(
			СтрокаТабличнойЧасти.Кратность = 0,
			1,
			СтрокаТабличнойЧасти.Кратность
		);
		
		СтрокаТабличнойЧасти.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
			СтрокаТабличнойЧасти.СуммаПлатежа,
			Курс,
			СтрокаТабличнойЧасти.Курс,
			Кратность,
			СтрокаТабличнойЧасти.Кратность
		);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
			СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаПлатежа - (СтрокаТабличнойЧасти.СуммаПлатежа) / ((СтрокаТабличнойЧасти.СтавкаНДС.Ставка + 100) / 100);
		
	КонецЕсли;
	
	УстановитьВидимостьРеквизитовРасчетов();
	НастроитьРеквизитыЭлементовФормы();
	
	// Эквайринг
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам") Тогда
		ЭквайринговыйТерминал = Объект.ЭквайринговыйТерминал;
		Для Каждого ТекущаяСтрока Из Объект.ЭквайринговыеОперации Цикл
			ТекущаяСтрока.СуммаПлатежаИтогоПоСтроке = ТекущаяСтрока.СуммаРасчетов-ТекущаяСтрока.СуммаРасчетовВозврата
								-ТекущаяСтрока.СуммаРасчетовКомиссии-ТекущаяСтрока.СуммаРасчетовКомиссииВозврата;
			ТекущаяСтрока.СуммаКомиссииИтогоПоСтроке = ТекущаяСтрока.СуммаРасчетовКомиссии+ТекущаяСтрока.СуммаРасчетовКомиссииВозврата;
		КонецЦикла;
		ТипСчетаЗатратШапка = Объект.ЭквайринговыйТерминал.СчетЗатрат.ТипСчета;
		НастроитьВидимостьИУстановитьЗначенияПоТипуСчетаЗатрат(Объект.Ссылка.Пустая());
	// Конец Эквайринг
	КонецЕсли;
	
	ОбменСGoogle.ПодключитьОбработчикиСобытияАвтоподбор(ЭтаФорма);
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// Остатки ДС и взаиморасчетов на форме
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	ОбновитьВидимостьИОстаткиДС();
	
	УстановитьСвязиПараметровВыбораДоступныеТипы();
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаВажныеКоманды);
	// Конец СтандартныеПодсистемы.Печать
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = УправлениеСвойствамиПереопределяемый.ЗаполнитьДополнительныеПараметры(Объект, "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОпределитьВидимостьНастроекУчетаВНалогообложении();
	
	//+++ Истомин
	ИспользоватьИнтеграциюСБанком = ПолучитьФункциональнуюОпцию("ИспользоватьЗагрузкуИзБанка");
	
	Если ИспользоватьИнтеграциюСБанком И ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		УстановитьЗагруженИзИнтернетБанка();
	Иначе
		Элементы.ДекорацияЗагруженИзБанка.Видимость = Ложь;
	КонецЕсли;
	//ПаганиниDMS_
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.TL_DMSNo  = "";
	КонецЕсли;
	//_ПаганиниDMS
	
	//+++ Дмгг
	ПустойРеквизитСтатьяВДокументах = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПустойРеквизитСтатьяВДокументах");
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ПустойРеквизитСтатьяВДокументах Тогда 
		Объект.Статья = ПустаяСтатьяДДС;
		
		Для Каждого Строк Из Объект.РасшифровкаПлатежа Цикл 
			Строк.СтатьяДДС = ПустаяСтатьяДДС;
		КонецЦикла;
	КонецЕсли;
	//--- Дмгг
	
	//+++ Дмгг
	УстановитьВидимостьПроекта();
	//--- Дмгг
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекущуюСтраницу();
	
	СтатистикаИспользованияФормКлиент.ПроверитьЗаписатьСтатистикуКоманды(
		"СоздатьНаОсновании.ПоступлениеНаСчет",
		ЭтотОбъект.ВладелецФормы,
		ЭтотОбъект.ОснованиеСоздания
	);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.СчетФактура.Форма.ФормаДокумента" Тогда
		СчетФактураТекст = ВыбранноеЗначение;
		Элементы.СчетФактураНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(ВыбранноеЗначение);
		Элементы.СчетФактураНадписьАвто.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(ВыбранноеЗначение);
		Элементы.СчетФактураНадписьВручную.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(ВыбранноеЗначение);
		Элементы.СчетФактураНадписьСПомощником.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеТекстаПроСчетФактуру" Тогда
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			Если Параметр.ДокументОснование = Объект.Ссылка Тогда
				СчетФактураТекст = Параметр.Представление;
				Элементы.СчетФактураНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(Параметр.Представление);
				Элементы.СчетФактураНадписьАвто.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(Параметр.Представление);
				Элементы.СчетФактураНадписьВручную.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(Параметр.Представление);
				Элементы.СчетФактураНадписьСПомощником.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(Параметр.Представление);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_Контрагент" Тогда
		Если ЗначениеЗаполнено(Параметр)
		   И Объект.Контрагент = Параметр Тогда
			УстановитьВидимостьРеквизитовРасчетов();
		КонецЕсли;
	КонецЕсли;
	
	// Прочие расчеты
	Если ИмяСобытия = "Запись_ПланСчетовУправленческий" Тогда
		Если ЗначениеЗаполнено(Параметр)
		   И Объект.Корреспонденция = Параметр Тогда
			УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденции(Ложь);
		КонецЕсли;
	КонецЕсли;
	// Конец Прочие расчеты
	
	//+++ Дмгг
	// Прочие расчеты
	Если ИмяСобытия = "Запись_ПланСчетовХозрасчетный" Тогда
		Если ЗначениеЗаполнено(Параметр)
		   И Объект.КорреспонденцияРегл = Параметр Тогда
			УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденцииРегл(Ложь);
		КонецЕсли;
	КонецЕсли;
	// Конец Прочие расчеты
	//--- Дмгг
	
	// Обсуждения
	ОбсужденияКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтаФорма, Объект.Ссылка);
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Зачет долгов
	Если ФормаСоздана Тогда
		НастроитьЭлементыРаспределенияДолговНаСервере(Истина);
	КонецЕсли;
	// Конец Зачет долгов
	
	ВестиРасчетыПоДокументам = Объект.Контрагент.ВестиРасчетыПоДокументам;
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "Проведение"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
	ОбновитьПодчиненнуюСчетФактуру = Модифицированность;
	
	// Зачет долгов с помощником
	// Удалим строку с авансом, если он = 0, и строки с нулевыми суммами.
	Если ВидОперации = ВидОперацииОтПокупателя Тогда
		Если Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником Тогда
		//Если Элементы.СтраницыИтоги.ТекущаяСтраница = Элементы.СтраницаРаспределениеСПомощником Тогда
			
			Если СуммаПлатежаАванс = 0 Тогда
				
				СтрокаАванса = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ИдентификаторСтрокиАванса);
				Если СтрокаАванса <> Неопределено Тогда
					Объект.РасшифровкаПлатежа.Удалить(СтрокаАванса.НомерСтроки - 1);
				КонецЕсли;
				
			ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И
				Объект.ДоговорДляЗачетаАвансаСПомощником.Пустая() Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не выбран договор для учета аванса. Документ не проведен!";
				Сообщение.Поле = "Объект.ДоговорДляЗачетаАвансаСПомощником";
				Сообщение.Сообщить();
				Отказ = Истина;
				Возврат;
				
			КонецЕсли;
			
			Индекс = Объект.РасшифровкаПлатежа.Количество() - 1;
			Пока Индекс >= 0 Цикл
				ТекущаяСтрока = Объект.РасшифровкаПлатежа[Индекс];
				Если ТекущаяСтрока.СуммаРасчетов = 0 И ТекущаяСтрока.СуммаПлатежа = 0 Тогда
					Объект.РасшифровкаПлатежа.Удалить(Индекс);
				КонецЕсли;
				
				Индекс = Индекс - 1;
			КонецЦикла;
		ИначеЕсли Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиАвтоматически Тогда
			
			Объект.РасшифровкаПлатежа.Очистить();
			ДобавитьСтрокуАвансаНаКлиенте();
		КонецЕсли;
	КонецЕсли;
	// Конец Зачет долгов с помощником
	//Паганини_
	
	//++NINI
	//Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам") Тогда
	//	Если Не ЗначениеЗаполнено(Объект.СуммаКомиссииДокумента) тогда
	//		СуммаПлатежа	= Объект.ЭквайринговыеОперации.Итог("СуммаПлатежаИтогоПоСтроке");
	//		СуммаКомиссии	= Объект.ЭквайринговыеОперации.Итог("СуммаКомиссииИтогоПоСтроке");
	//	иначе
	//		СуммаКомиссии	= Объект.СуммаКомиссииДокумента;
	//	КонецЕсли;
	//NINI--
	
	Если ВидОперации  = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам") Тогда
		СуммаПлатежа  = Объект.ЭквайринговыеОперации.Итог("СуммаПлатежаИтогоПоСтроке");
		СуммаКомиссии = Объект.ЭквайринговыеОперации.Итог("СуммаКомиссииИтогоПоСтроке");
		
		Если НЕ СуммаПлатежа = Объект.СуммаДокумента И НЕ СуммаКомиссии = Объект.СуммаКомиссииДокумента Тогда
			Если Вопрос(НСтр("ka='არ ემთხვევა დოკუმენტის თანხა და საკომისიოს თანხა მისი გაშიფვრებთან. გადაითვალოს თანხები?';ru='Не совпадают сумма документа и сумма коммисионных с ее рассшифровками. Пересчитать суммы?';en='Do not match the amount of the document and the amount of its Brokerage rassshifrovkami. Calculate the sum of?'"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.СуммаДокумента 			= СуммаПлатежа;
				Объект.СуммаКомиссииДокумента	= СуммаКомиссии;
			КонецЕсли;
		ИначеЕсли НЕ СуммаПлатежа = Объект.СуммаДокумента Тогда
			Если Вопрос(НСтр("ka='არ ემთხვევა დოკუმენტის თანხა და მისი გაშიფვრა. გადაითვალოს დოკუმენტის თანხა?';ru='Не совпадают сумма документа и ее расшифровка. Пересчитать сумму документа?';en='Do not match the amount of the document and its interpretation. Calculate the sum of the document?'"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.СуммаДокумента 			= СуммаПлатежа;
			КонецЕсли;
		ИначеЕсли НЕ СуммаКомиссии = Объект.СуммаКомиссииДокумента Тогда
			Если Вопрос(НСтр("ka='არ ემთხვევა დოკუმენტის საკომისიოს თანხა და მისი გაშიფვრა. გადაითვალოს დოკუმენტის საკომისიოს თანხა?';ru='Не совпадают сумма коммисионных документа и ее расшифровка. Пересчитать сумму коммисионных документа?';en='Brokerage not match the amount of the document and its interpretation. Calculate the amount of Brokerage document?'"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.СуммаКомиссииДокумента 	= СуммаКомиссии;
			КонецЕсли;
		КонецЕсли;
		
		//++NINI
		//Если НЕ СуммаКомиссии = Объект.СуммаКомиссииДокумента Тогда
		//	Если Вопрос(НСтр("ka='არ ემთხვევა დოკუმენტის საკომისიოს თანხა და მისი გაშიფვრა. გადაითვალოს დოკუმენტის საკომისიოს თანხა?';ru='Не совпадают сумма коммисионных документа и ее расшифровка. Пересчитать сумму коммисионных документа?';en='Brokerage not match the amount of the document and its interpretation. Calculate the amount of Brokerage document?'"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		//		//Объект.СуммаКомиссииДокумента 	= СуммаКомиссии;
		//		СуммаПлатежа = Объект.СуммаДокумента + СуммаКомиссии - Объект.СуммаКомиссииДокумента;
		//	КонецЕсли;
		//КонецЕсли;
		//--NINI
		
	КонецЕсли;
	//_Паганини
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ТекстСообщения = "";
		Если ВидОперации = ВидОперацииОтПокупателя И Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиАвтоматически Тогда
			ПроверитьСоответствиеДоговораУсловиямДокумента(Объект.ДоговорыАвтоЗачетаДолгов, ТекстСообщения, Объект.Ссылка, Объект.Организация, Объект.Контрагент, Объект.ВидОперации, Отказ, Объект.ДоговорКредитаЗайма);
		Иначе
			ПроверитьСоответствиеДоговораУсловиямДокумента(Объект.РасшифровкаПлатежа, ТекстСообщения, Объект.Ссылка, Объект.Организация, Объект.Контрагент, Объект.ВидОперации, Отказ, Объект.ДоговорКредитаЗайма);
		КонецЕсли;
		
		Если ТекстСообщения <> "" Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ?(Отказ, НСтр("ru='Документ не проведен! ';ka='დოკუმენტი არ გატარებულა!'") + ТекстСообщения, ТекстСообщения);
			Сообщение.Сообщить();
			
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		// Эквайринг
		Если ПолучитьФункциональнуюОпцию("РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям") И ТекущийОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам Тогда
			// Дата документа должна быть больше даты операции.
			Для Каждого ТекущаяСтрока Из ТекущийОбъект.ЭквайринговыеОперации Цикл
				Если ТекущаяСтрока.Документ <> Неопределено И ТекущаяСтрока.Документ.Дата >= ТекущийОбъект.Дата Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = НСтр("ka='ოპერაციის თარიღი დოკუმენტის თარიღზე მეტი ან მისი ტოლია!';ru='Дата операции больше или равна дате документа!';en='Date of operation is greater than or equal to the date of the document!'");
					Сообщение.Поле = "ЭквайринговыеОперации["+(ТекущаяСтрока.НомерСтроки-1)+"].Документ";
					Сообщение.ПутьКДанным = "Объект";
					Сообщение.Сообщить();
					
					Отказ = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если Отказ Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ka='დოკუმენტის თარიღი ყველა იმ ოპერაციის თარიღზე მეტი უნდა იყოს, რომელიც მითითებულია ცხრილ ""ეკვაირინგის ოპერაციები""-ში. დოკუმენტი არ არის გატარებული!';ru='Дата документа должна быть больше даты всех операций, которые указаны в табличной части ""Эквайринговые операции"". Документ не проведен!';en='Document Date must be greater than the dates of all operations that are listed in the table of the ""acquiring step"". Document is not approved!'");
				Сообщение.Сообщить();
				
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		// Конец Эквайринг
		
		// Курьерская компания и почта
		Если НЕ ПолучитьФункциональнуюОпцию("КорректировкиДолга")
			И Объект.ВидОперации = ВидОперацииОтКурьерскойКомпанииПочты Тогда
			УстановитьПривилегированныйРежим(Истина);
			Константы.ФункциональнаяОпцияИспользоватьКорректировкиДолга.Установить(Истина);
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		// Конец. Курьерская компания и почта
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность",Модифицированность);
	// Конец Обсуждения
	
	// Расчеты с курьерской компанией или почтой
	Если Объект.Ссылка.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты Тогда
		СписокКорректировокДляУдаления = Новый Массив;
		СписокКорректировокДляУдаления.Очистить();
		Для Каждого СтрокаРасшифровкиОтАгента Из Объект.Ссылка.РасшифровкаПлатежаОтАгента Цикл
			СписокКорректировокДляУдаления.Добавить(СтрокаРасшифровкиОтАгента.КорректировкаДолга);
		КонецЦикла;
	КонецЕсли;
	// Конец. Расчеты с курьерской компанией или почтой
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбменСGoogle.УвеличитьЗначениеСчетчикаПодсказок(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Прочие расчеты
	Если ТекущийОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником") Или
		ТекущийОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам") Тогда
		ЗаполнитьИнформациюПоКредитуЗаймуНаСервере();
	КонецЕсли;
	// Конец Прочие расчеты
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	ОбновитьВидимостьИОстаткиДС();
	
	// Зачет долгов
	ОбновитьИнформациюОбАвансеВРасшифровкеПлатежа();
	
	ИмяКлючаОбъекта = СтрЗаменить(ИмяФормы,".","");
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+"_ВариантЗаполненияРасшифровки", Объект.ВариантЗаполненияРасшифровки);
	
	ИсходнаяСуммаРавнаНулю = (Объект.СуммаДокумента = 0);
	// Конец Зачет долгов
	
	// Расчеты с курьерской компанией или почтой
	Если ЗначениеЗаполнено(СписокКорректировокДляУдаления) Тогда
		Для Каждого ЭлементСписка Из СписокКорректировокДляУдаления Цикл
			
			Если Не ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекущийОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты") Тогда
				НайденныеСтроки = Объект.РасшифровкаПлатежаОтАгента.НайтиСтроки(Новый Структура("КорректировкаДолга", ЭлементСписка.Значение));
				Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			ДокКорректировки = ЭлементСписка.Значение.ПолучитьОбъект();
			Попытка
				УстановитьПривилегированныйРежим(Истина);
				ДокКорректировки.УстановитьПометкуУдаления(Истина);
				УстановитьПривилегированныйРежим(Ложь);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	Если ТекущийОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты") Тогда
		СоздатьОбнвоитьДокументыПереносаДолгаНаСервере(ТекущийОбъект);
	КонецЕсли;
	
	ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата())); //+++ Дмгг

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если СозданПоКомандеИзФормыСписка Тогда
		ПараметрыОповещения = Новый Структура("Ссылка", Объект.Ссылка);
		Оповестить("Запись_ПоступлениеНаСчет", ПараметрыОповещения);
	КонецЕсли;
	
	// Оповещение об оплате.
	ОповеститьОбОплатеСчета = Ложь;
	ОповеститьОбОплатеЗаказа = Ложь;
	
	Для каждого ТекСтрока Из Объект.РасшифровкаПлатежа Цикл
		ОповеститьОбОплатеСчета = ?(
			ОповеститьОбОплатеСчета,
			ОповеститьОбОплатеСчета,
			ЗначениеЗаполнено(ТекСтрока.СчетНаОплату)
		);
		ОповеститьОбОплатеЗаказа = ?(
			ОповеститьОбОплатеЗаказа,
			ОповеститьОбОплатеЗаказа,
			ЗначениеЗаполнено(ТекСтрока.Заказ)
		);
	КонецЦикла;
	
	Если ОповеститьОбОплатеСчета Тогда
		ОповеститьОбИзменении(Тип("ДокументСсылка.СчетНаОплату"));
		ОповеститьОбИзменении(Тип("ДокументСсылка.СчетНаОплатуПоставщика"));
	КонецЕсли;
	
	Если ОповеститьОбОплатеЗаказа Тогда
		Оповестить("ОповещениеОбОплатеЗаказа", Объект.Ссылка);
	КонецЕсли;
	
	Оповестить("ОповещениеОбИзмененииДолга");
	
	//Если НЕ СчетФактураТекст = "Ввести счет-фактуру"
	Если НЕ СчетФактураТекст = ""
		И ?(НЕ ОбновитьПодчиненнуюСчетФактуру = Неопределено, ОбновитьПодчиненнуюСчетФактуру, Ложь) Тогда
		
		ТекстВопроса = НСтр("ka='დოკუმენტში განხორციელდა ცვლილებები. საჭიროა თუ არა დაქვემდებარებული ანგარიშფაქტურის განმეორებით შევსება?';ru='В документе были произведены изменения. "
"Требуется ли повторно заполнить подчиненный Счет-фактуру?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ОпределитьНеобходимостьЗаполненияПодчиненногоСчетФактуры", ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеИнтерактивно(Команда)
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ПометитьНаУдалениеИнтерактивноЗавершение", ЭтотОбъект);
	Если Модифицированность Тогда
		Если Объект.ПометкаУдаления Тогда
			ТекстВопроса = НСтр("ka='Для снятия пометки удаления необходимо записать внесенные вами изменения. Записать данные?';ru='Для снятия пометки удаления необходимо записать внесенные вами изменения. Записать данные?';en='To deselect removal is necessary to record your changes. Write data?'");
		Иначе
			ТекстВопроса = НСтр("ka='Для установки отметки удаления необходимо записать внесенные вами изменения. Записать данные?';ru='Для установки отметки удаления необходимо записать внесенные вами изменения. Записать данные?';en='To set the mark removal is necessary to record your changes. Write data?'");
		КонецЕсли;
	Иначе
		Если Объект.ПометкаУдаления Тогда
			ТекстВопроса = НСтр("ka='Снять с ""';ru='Снять с ""';en='Remove from the ""'")+Объект.Ссылка + НСтр("ka='"" пометку на удаление?';ru='"" пометку на удаление?';en='""Marked for deletion?'");
		Иначе
			ТекстВопроса = НСтр("ka='მონიშვნა ""';ru='Пометить ""';en='Mark ""'")+Объект.Ссылка + НСтр("ka='"" на удаление?';ru='"" на удаление?';en='""To remove?'");
		КонецЕсли;
	КонецЕсли;
	
	ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеИнтерактивноЗавершение(ОтветНаВопрос, ДопПараметры) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		ПометитьНаУдалениеИнтерактивноНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеИнтерактивноНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Попытка
		Если Модифицированность Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		ДокОбъект.ПометкаУдаления = Не ДокОбъект.ПометкаУдаления;
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		
		Модифицированность = Ложь;
		
		Если ДокОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты") Тогда
			СоздатьОбнвоитьДокументыПереносаДолгаНаСервере(ДокОбъект);
		КонецЕсли;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СчетФактураНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	УправлениеНебольшойФирмойКлиент.ОткрытьСчетФактуру(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "удалить" Тогда
		
		Объект.ДокументОснование = Неопределено;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Неопределено);
		Элементы.ДокументОснованиеНадписьАвто.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Неопределено);
		Элементы.ДокументОснованиеНадписьВручную.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Неопределено);
		Элементы.ДокументОснованиеНадписьСПомощником.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Неопределено);
		Модифицированность = Истина;
		
		ДокументОснованиеВалютаПредставление = "";
		ДокументОснованиеСумма = 0;
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "заполнить" Тогда
		ЗаполнитьПоОснованиюНачало();
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "выбрать" Тогда
		
		//Выбрать основание
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборТипаОснованияЗавершение", ЭтотОбъект);
		ПоказатьВыборИзМеню(ОписаниеОповещения, ПолучитьСписокДляВыбораДокументаОснования(), Элемент);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "открыть" Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) тогда
			возврат;
		КонецЕсли;
		
		РаботаСФормойДокументаКлиент.ОткрытьФормуДокументаПоТипу(Объект.ДокументОснование);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	// Зачет долгов
	Если Объект.ВидОперации = ВидОперацииОтПокупателя И 
		(Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником 
		ИЛИ
		Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиАвтоматически)Тогда
		Объект.РасшифровкаПлатежа.Очистить();
		ДобавитьСтрокуАвансаНаКлиенте();
		ПересчитатьИтогиПриИзмененииАвансаНаКлиенте(Истина);
	КонецЕсли;
	// Конец Зачет долгов
	
	СтруктураДанные = ПолучитьДанныеКонтрагентПриИзменении(Объект.Контрагент, Объект.Организация, Объект.Дата);
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда 
		  
		Объект.РасшифровкаПлатежа[0].Договор = СтруктураДанные.Договор;
		
		Если ЗначениеЗаполнено(Объект.РасшифровкаПлатежа[0].Договор) Тогда
			Объект.РасшифровкаПлатежа[0].Курс = ?(
				СтруктураДанные.ДоговорВалютаКурсКратность.Курс = 0,
				1,
				СтруктураДанные.ДоговорВалютаКурсКратность.Курс
			);
			Объект.РасшифровкаПлатежа[0].Кратность = ?(
				СтруктураДанные.ДоговорВалютаКурсКратность.Кратность = 0,
				1,
				СтруктураДанные.ДоговорВалютаКурсКратность.Кратность
			);
		КонецЕсли;
		
		Объект.РасшифровкаПлатежа[0].Курс = ?(
			Объект.РасшифровкаПлатежа[0].Курс = 0,
			1,
			Объект.РасшифровкаПлатежа[0].Курс
		);
		Объект.РасшифровкаПлатежа[0].Кратность = ?(
			Объект.РасшифровкаПлатежа[0].Кратность = 0,
			1,
			Объект.РасшифровкаПлатежа[0].Кратность
		);
		
		Объект.РасшифровкаПлатежа[0].СуммаРасчетов = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
			Объект.РасшифровкаПлатежа[0].СуммаПлатежа,
			Курс,
			Объект.РасшифровкаПлатежа[0].Курс,
			Кратность,
			Объект.РасшифровкаПлатежа[0].Кратность
		);
		
		//+++ Дмгг
		Объект.РасшифровкаПлатежа[0].Проект = СтруктураДанные.Проект;
		//--- Дмгг
		
	КонецЕсли;
	
	// Статьи ДДС
	УстановитьСтатьиДДСВРасшифровкеПлатежа();
	// Конец Статьи ДДС
	
	// Прочие расчеты
	Если СтруктураДанные.Свойство("ДоговорКредитаЗаймаПоУмолчанию") Тогда
		Объект.ДоговорКредитаЗайма = СтруктураДанные.ДоговорКредитаЗаймаПоУмолчанию;
		ОбработатьИзменениеДоговораКредитаИлиЗайма();
	КонецЕсли;
	// Конец Прочие расчеты
	
	// Зачет долгов
	Объект.ДоговорДляЗачетаАвансаСПомощником = СтруктураДанные.Договор;
	//+++ Дмгг
	Объект.ПроектДляЗачетаАвансаСПомощником = СтруктураДанные.Проект;
	//--- Дмгг
	СоздатьЭлементыДоговоровЗачетаДолгов();
	// Конец Зачет долгов
	
	Если ЗначениеЗаполнено(СтруктураДанные.СтатьяДДСПоУмолчанию) Тогда
		Если НЕ ПустойРеквизитСтатьяВДокументах Тогда 
			Объект.Статья = СтруктураДанные.СтатьяДДСПоУмолчанию;
		КонецЕсли;
		Объект.УчитыватьВНУ = СтруктураДанные.УчитыватьВНУ;
	КонецЕсли;
	
	ВестиРасчетыПоДокументам = СтруктураДанные.ВестиРасчетыПоДокументам;
	Если ВестиРасчетыПоДокументам И Объект.ВидОперации = ВидОперацииОтПоставщика Тогда
		Для Каждого ТекущаяСтрокаРасшифровки Из Объект.РасшифровкаПлатежа Цикл
			ТекущаяСтрокаРасшифровки.ПризнакАванса = Ложь;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // КонтрагентПриИзменении()

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ВидОперацииПередИзменением = ВидОперации;
	ВидОперации = Объект.ВидОперации;
	
	Если ВидОперации <> ВидОперацииПередИзменением Тогда
		УстановитьТекущуюСтраницу();
		ОчиститьРеквизитыНеОтносящиесяКОперации();
		ВидОперацииПриИзмененииНаСервере();
		Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
			Объект.РасшифровкаПлатежа[0].СуммаПлатежа = Объект.СуммаДокумента;
		КонецЕсли;
	КонецЕсли;
	//+++ Дмгг
	Видимость = ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратДенегОтСотрудника");
	УстановитьВидимостьДляОперацииВозвартДенегОтСотрудника(Видимость);
	
	УстановитьВидимостьДляОперацииВозвартЗаймаОтСотрудника();
	//--- Дмгг
	//+++ Дмгг
	УстановитьВидимостьПроекта();
	//--- Дмгг
КонецПроцедуры // ВидОперацииПриИзменении()

// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата())); //+++ Дмгг

	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
		
		// Помощник зачета долгов
		Если Объект.ВидОперации = ВидОперацииОтПокупателя И Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником Тогда
			ПерезаполнитьПолеДатаДокБольшеДатыДокументаВТаблицеДолгов();
		КонецЕсли;
		// Конец Помощник зачета долгов
		
		// Обновление курсов расчетов
		СтруктураДанные.Вставить("ОбновитьКурсыРасчетов", (Объект.РасшифровкаПлатежа.Количество() > 0 И Объект.РасшифровкаПлатежа.Итог("Курс") > 0 И
			Объект.РасшифровкаПлатежа.Количество() <> Объект.РасшифровкаПлатежа.Итог("Курс")));
		СтруктураДанные.Вставить("ОбновитьКурсыРасчетовТекстВопроса", НСтр("ka='დოკუმენტის თარიღი შეიცვალა. ანგარიშსწორების კურსი დავაწესოთ ხელშეკრულების ვალუტის კურსის შესაბამისად?';ru='Изменилась дата документа. Установить курс расчетов в соответствии с курсом валюты договора?';en='Changed the date of the document. Set rate calculation according to the course of the contract currency?'"));
		// Конец Обновление курсов расчетов
		
		ТекстСообщения = НСтр("ka='შეიცვალა საბანკო ანგარიშის ვალუტის კურსი. გადავთვალოთ დოკუმენტის თანხები?';ru='Изменился курс валюты банковского счета. Пересчитать суммы документа?';en='I changed the exchange rate of the bank account. Calculate the sum of the document?'");
		ПересчитатьСуммыПриИзмененииКурсаВалютыДенежныхСредств(СтруктураДанные, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры // ДатаПриИзменении()

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	// Обработка события изменения организации.
	Объект.Номер = "";
	СтруктураДанные = ПолучитьДанныеОрганизацияПриИзменении();
	Компания = СтруктураДанные.Компания;
	Объект.БанковскийСчет = СтруктураДанные.БанковскийСчет;
	
	ВалютаДенежныхСредствПередИзменением = ВалютаДенежныхСредств;
	Объект.ВалютаДенежныхСредств = СтруктураДанные.ВалютаДенежныхСредств;
	ВалютаДенежныхСредств = СтруктураДанные.ВалютаДенежныхСредств;
	
	Если Объект.ВидОперации = ВидОперацииОтПокупателя И Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником Тогда
		ЗаполнитьДолги(Истина);
	КонецЕсли;
	
	УстановитьНастройкиУчетаВНалогообложении();
	
	// Если валюта не изменилась, то ничего не делаем.
	Если ВалютаДенежныхСредств = ВалютаДенежныхСредствПередИзменением Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
		Для Каждого ТекущаяСтрока Из Объект.РасшифровкаПлатежа Цикл
			ТекущаяСтрока.Договор = Неопределено;
		КонецЦикла;
	КонецЕсли;
	Если Объект.ДоговорыАвтоЗачетаДолгов.Количество() > 0 Тогда
		Для Каждого ТекущаяСтрока Из Объект.ДоговорыАвтоЗачетаДолгов Цикл
			ТекущаяСтрока.Договор = Неопределено;
		КонецЦикла;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ka='შეიცვალა საბანკო ანგარიშის ვალუტა. გადავთვალოთ დოკუმენტის თანხები?';ru='Изменилась валюта банковского счета. Пересчитать суммы документа?';en='Change currency bank account. Calculate the sum of the document?'");
	ПересчитатьСуммыПриИзмененииКурсаВалютыДенежныхСредств(СтруктураДанные, ТекстСообщения);
	
	
КонецПроцедуры // ОрганизацияПриИзменении()

&НаКлиенте
Процедура БанковскийСчетПриИзменении(Элемент)
	
	ВалютаДенежныхСредствПередИзменением = ВалютаДенежныхСредств;
	
	СтруктураДанные = ПолучитьДанныеБанковскийСчетПриИзменении(
		Объект.Дата,
		Объект.БанковскийСчет,
		Объект.СчетКонтрагента
	);
	
	Объект.ВалютаДенежныхСредств = СтруктураДанные.ВалютаДенежныхСредств;
	ВалютаДенежныхСредств = СтруктураДанные.ВалютаДенежныхСредств;
	
	Если Объект.ВидОперации = ВидОперацииЭквайринг Тогда
		Объект.СуммаДокумента = 0;
		Объект.СуммаКомиссииДокумента = 0;
		Объект.ЭквайринговыеОперации.Очистить();
	КонецЕсли;
	
	// Если валюта не изменилась, то ничего не делаем.
	Если ВалютаДенежныхСредств = ВалютаДенежныхСредствПередИзменением Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ka='შეიცვალა საბანკო ანგარიშის ვალუტა. გადავთვალოთ დოკუმენტის თანხები?';ru='Изменилась валюта банковского счета. Пересчитать суммы документа?';en='Change currency bank account. Calculate the sum of the document?'");
	ПересчитатьСуммыПриИзмененииКурсаВалютыДенежныхСредств(СтруктураДанные, ТекстСообщения);
	
	Если Объект.ВидОперации = ВидОперацииОтПокупателя И НЕ ЗначениеЗаполнено(ВалютаДенежныхСредствПередИзменением) И НЕ Объект.ВалютаДенежныхСредств.Пустая() Тогда
		ЗаполнитьДолги(Истина);
	КонецЕсли;
	
КонецПроцедуры // БанковскийСчетПриИзменении()

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	ИсходнаяСуммаРавнаНулю = (Объект.СуммаДокумента = 0);
	
	СуммаДокументаПриИзмененииФрагмент();
	
КонецПроцедуры // СуммаДокументаПриИзменении()

&НаКлиенте
Процедура СуммаДокументаПриИзмененииФрагмент()
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 И
		НЕ (Объект.ВидОперации = ВидОперацииОтПокупателя И 
		Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником) Тогда
	 
		СтрокаТабличнойЧасти = Объект.РасшифровкаПлатежа[0];
		
		СтрокаТабличнойЧасти.СуммаПлатежа = Объект.СуммаДокумента;
			СтрокаТабличнойЧасти.Курс = ?(
			СтрокаТабличнойЧасти.Курс = 0,
			1,
		СтрокаТабличнойЧасти.Курс
		);
		
		СтрокаТабличнойЧасти.Кратность = ?(
			СтрокаТабличнойЧасти.Кратность = 0,
			1,
			СтрокаТабличнойЧасти.Кратность
		);
		
		СтрокаТабличнойЧасти.СуммаРасчетов = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
			СтрокаТабличнойЧасти.СуммаПлатежа,
			Курс,
			СтрокаТабличнойЧасти.Курс,
			Кратность,
			СтрокаТабличнойЧасти.Кратность
		);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
			СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса, СтрокаТабличнойЧасти.СуммаПлатежа, 0);
		
		РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
		
	КонецЕсли;
	
	РассчитатьСуммуУчета();
	
	Если Объект.ВидОперации = ВидОперацииОтПокупателя Тогда
		
		Если Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником Тогда
			Если Объект.СуммаДокумента = ТаблицаДолгов.Итог("ДолгВалПлатежа") Тогда
				ЗачестьДолгиАвтоматическиФрагмент();
			Иначе
				ПересчитатьИтогиПриИзмененииАвансаНаСервере(Истина);
			КонецЕсли;
		ИначеЕсли Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиАвтоматически И Объект.ДоговорыАвтоЗачетаДолгов.Количество() = 1 Тогда
			Объект.ДоговорыАвтоЗачетаДолгов[0].СуммаПлатежа = Объект.СуммаДокумента;
			ПересчитатьИтогиПриИзмененииАвансаНаСервере();
		Иначе
			ПересчитатьИтогиПриИзмененииАвансаНаСервере();
		КонецЕсли;
		
	Иначе
		
		СуммаПлатежаДляУсловногоОформления = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
	КонецЕсли;
	
	//+++ Дмгг
	Если объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратДенегОтСотрудника") Тогда 
		РасчитатьСуммы_ПФ_НДФЛ();
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры // СуммаДокументаПриИзменении()

//+++ Дмгг 
&НаСервере
Процедура РасчитатьСуммы_ПФ_НДФЛ()
	
	СтавкаНДФЛ	= 0;
	СтавкаПФ	= 0;
	
	//ТекСтрока = Объект.Сотрудники.НайтиПоИдентификатору(Идентификатор);
	Если ЗначениеЗаполнено(Объект.ВидУдержанияНДФЛ) Тогда
		СтавкаНДФЛ = Объект.ВидУдержанияНДФЛ.СтавкаНДФЛ;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВидУдержанияПФ) Тогда
		СтавкаПФ = Объект.ВидУдержанияПФ.СтавкаПФ;
	КонецЕсли;
	
	Объект.НДФЛПлатежа		= Окр(Объект.СуммаДокумента * СтавкаНДФЛ/(100 - СтавкаНДФЛ), 2);
	Объект.СуммаПФПлатежа	= Окр((Объект.СуммаДокумента + Объект.НДФЛПлатежа) * СтавкаПФ/(100 - СтавкаПФ), 2);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Статья) Тогда
		Объект.УчитыватьВНУ = СтатьяУчитываетсяВНУ(Объект.Статья, Объект.Организация, Объект.Дата);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОстатокВзаиморасчетовНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	РаботаСФормойДокументаКлиент.ОткрытьОтчетВзаиморасчетрыСКонтрагентом(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстатокВзаиморасчетовОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСФормойДокументаКлиент.ОткрытьОтчетВзаиморасчетрыСКонтрагентом(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстатокДенежныхСредствНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	РаботаСФормойДокументаКлиент.ОткрытьОтчетДенежныеСредства(Объект.БанковскийСчет, Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстатокДенежныхСредствОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСФормойДокументаКлиент.ОткрытьОтчетДенежныеСредства(Объект.БанковскийСчет, Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантЗаполненияРасшифровкиПриИзменении(Элемент)
	
	НастроитьЭлементыРаспределенияДолговНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	Если Объект.ВидОперации = ВидОперацииОтПокупателя Тогда
		
		СуммаИтог = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
		Если СуммаИтог <> 0 И СуммаИтог <> Объект.СуммаДокумента
			И Объект.ВариантЗаполненияРасшифровки <> ВариантЗаполненияРасшифровкиАвтоматически
			Тогда
			НадписьВСкобках = ?(Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиВручную, 
				НСтр("ka='გავრცელებულია მექანიკურად';ru='разнесено вручную';en='spaced manually'"),
				НСтр("ka='ჩათვლილია + ავანსი';ru='зачтено + аванс';en='Passed down payment +'"));
			
			Элемент.СписокВыбора.Добавить(СуммаИтог, ""+СуммаИтог+" ("+НадписьВСкобках+")");
		КонецЕсли;
		
		Если Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником Тогда
			СуммаИтогЗачесть = ТаблицаДолгов.Итог("ДолгВалПлатежа");
			Если СуммаИтогЗачесть <> 0 И СуммаИтогЗачесть <> Объект.СуммаДокумента
				Тогда
				Элемент.СписокВыбора.Добавить(СуммаИтогЗачесть, ""+СуммаИтогЗачесть+НСтр("ka='(მიმდინარე დავალიანება)';ru=' (текущий долг)'"));
			КонецЕсли;
		ИначеЕсли Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиАвтоматически Тогда
			СуммаИтогЗачесть = Объект.ДоговорыАвтоЗачетаДолгов.Итог("СуммаПлатежа");
			Если СуммаИтогЗачесть <> 0 И СуммаИтогЗачесть <> Объект.СуммаДокумента
				Тогда
				Элемент.СписокВыбора.Добавить(СуммаИтогЗачесть, ""+СуммаИтогЗачесть+НСтр("ka='(გატარებულია ხელშეკრულებების მიხედვით)';ru=' (разнесено по договорам)'"));
			КонецЕсли;
		КонецЕсли;
		
		Если ОстатокВзаиморасчетов > 0 И (ОстатокВзаиморасчетов) <> Объект.СуммаДокумента Тогда
			Элемент.СписокВыбора.Добавить(ОстатокВзаиморасчетов, ""+(ОстатокВзаиморасчетов)+НСтр("ka='(დავალიანება აქვს ჩვენ მიმართ)';ru=' (должен нам)'"));
		КонецЕсли;
		
		Если Элемент.СписокВыбора.Количество() = 0 Тогда
			Элемент.СписокВыбора.Добавить(Объект.СуммаДокумента, НСтр("ka='შესავსებად მონაცემები არ არის';ru='Нет данных для заполнения';en='No data to fill'"));
		КонецЕсли;
		
	ИначеЕсли Объект.ВидОперации = ВидОперацииОтКурьерскойКомпанииПочты Тогда
		
		СуммаИтог = Объект.РасшифровкаПлатежаОтАгента.Итог("СуммаПлатежа");
		
		Если СуммаИтог <> 0 И СуммаИтог <> Объект.СуммаДокумента
			И Объект.ВариантЗаполненияРасшифровки <> ВариантЗаполненияРасшифровкиАвтоматически
			Тогда
			НадписьВСкобках = НСтр("ka='გავრცელებულია მექანიკურად';ru='разнесено вручную';en='spaced manually'");
			
			Элемент.СписокВыбора.Добавить(СуммаИтог, ""+СуммаИтог+" ("+НадписьВСкобках+")");
		КонецЕсли;
		
		Если ОстатокВзаиморасчетов > 0 И (ОстатокВзаиморасчетов) <> Объект.СуммаДокумента Тогда
			Элемент.СписокВыбора.Добавить(ОстатокВзаиморасчетов, ""+(ОстатокВзаиморасчетов)+НСтр("ka='(დავალიანება აქვს ჩვენ მიმართ)';ru=' (должен нам)'"));
		КонецЕсли;
		
		Если Элемент.СписокВыбора.Количество() = 0 Тогда
			Элемент.СписокВыбора.Добавить(Объект.СуммаДокумента, НСтр("ka='შესავსებად მონაცემები არ არის';ru='Нет данных для заполнения';en='No data to fill'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПоДоговоруПриИзменении(Элемент)
	
	Если Элементы.СнятьОтборПоДоговору.Доступность Тогда
		
		Для каждого ЭлементОтбораСтрок Из Элементы.ТаблицаДолгов.ОтборСтрок Цикл
			ВыполнитьПоискПоДоговоруНаСервере(ЭлементОтбораСтрок.Ключ);
			Прервать;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Подотчетник.Пустая() Тогда
		УправлениеНебольшойФирмойКлиент.СообщитьОбОшибке(Объект,НСтр("ka='თავდაპირველად, საჭიროა ანგარიშვალდებული პირის არჩევა';ru='Сначала нужно выбрать подотчетника';en='First you need to choose podotchetnika'"),,,"Объект.Подотчетник");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПокупкаВалютыКурсПриИзменении(Элемент)
	
	РассчитатьСуммуУчета();
	
КонецПроцедуры // РассчитатьСуммуУчета()

&НаКлиенте
Процедура ПокупкаВалютыКратностьПриИзменении(Элемент)
	
	РассчитатьСуммуУчета();
	
КонецПроцедуры // РассчитатьСуммуУчета()

&НаКлиенте
Процедура ПокупкаВалютыСуммаУчетаПриИзменении(Элемент)
	
	Объект.Курс = ?(
		Объект.Курс = 0,
		1,
		Объект.Курс
	);
	
	Объект.Кратность = ?(
		Объект.Кратность = 0,
		1,
		Объект.Кратность
	);
	
	Объект.Курс = ?(
		Объект.СуммаДокумента = 0,
		1,
		Объект.СуммаУчета / Объект.СуммаДокумента * КурсВалютыУчета
	);
	
КонецПроцедуры // ПокупкаВалютыСуммаУчетаПриИзменении()

&НаКлиенте
Процедура НалогообложениеНДСПриИзменении(Элемент)
	
	ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеПлатежаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.НазначениеПлатежа", НСтр("ka='გადახდის დანიშნულება';ru='Назначение платежа';en='Purpose of payment'"));
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасшифровкаПлатежа

&НаКлиенте
Процедура РасшифровкаПлатежаПередУдалением(Элемент, Отказ)
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // РасшифровкаПлатежаПередУдалением()

&НаКлиенте
Процедура РасшифровкаПлатежаПослеУдаления(Элемент)
	
	ПересчитатьИтогиПриИзмененииАвансаНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаДоговорПриИзменении(Элемент)
	
	ОбработатьИзменениеДоговораКонтрагента();
	
КонецПроцедуры // РасшифровкаПлатежаДоговорПриИзменении()

&НаКлиенте
Процедура РасшифровкаПлатежаДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораДоговораКонтрагента(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПризнакАвансаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя") Тогда
		Если СтрокаТабличнойЧасти.ПризнакАванса Тогда
			СтрокаТабличнойЧасти.Документ = Неопределено;
		Иначе
			СтрокаТабличнойЧасти.ДокументПланирования = Неопределено;
		КонецЕсли;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПоставщика")
		И ВестиРасчетыПоДокументам Тогда
		Если ТипЗнч(СтрокаТабличнойЧасти.Документ) = Тип("ДокументСсылка.РасходИзКассы")
		 ИЛИ ТипЗнч(СтрокаТабличнойЧасти.Документ) = Тип("ДокументСсылка.РасходСоСчета")
		 ИЛИ ТипЗнч(СтрокаТабличнойЧасти.Документ) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
			СтрокаТабличнойЧасти.ПризнакАванса = Истина;
			ПоказатьПредупреждение(Неопределено,НСтр("ka='ანგარიშსწორებათა დოკუმენტის მოცემული ტიპისთვის ავანსის თვისება ყოველთვის დაყენებულია!';ru='Для данного типа документа расчетов признак аванса всегда установлен!';en='For this calculation the document type attribute is always set advance!'"));
		ИначеЕсли ТипЗнч(СтрокаТабличнойЧасти.Документ) <> Тип("ДокументСсылка.Взаимозачет") Тогда
			СтрокаТабличнойЧасти.ПризнакАванса = Ложь;
			ПоказатьПредупреждение(Неопределено,НСтр("ka='ანგარიშსწორებათა დოკუმენტის მოცემული ტიპისთვის არ შეიძლება ავანსის თვისების დაყენება!';ru='Для данного типа документа расчетов нельзя установить признак аванса!';en='For this type of document can not be established settlements sign advance!'"));
		КонецЕсли;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса , СтрокаТабличнойЧасти.СуммаПлатежа, 0);
	ПересчитатьИтогиПриИзмененииАвансаНаКлиенте();
	
КонецПроцедуры // РасшифровкаПлатежаПризнакАвансаПриИзменении()

&НаКлиенте
Процедура РасшифровкаПлатежаДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ПризнакАванса
		И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя") Тогда
		
		ПоказатьПредупреждение(, НСтр("ka='ანგარიშსწორების სახისთვის ნიშნით ""ავანსი"" ანგარიშსწორების დოკუმენტი იქნება მიმდინარე!';ru='Для вида расчета с признаком ""Аванс"" документом расчетов будет текущий!';en='For the type of calculation with the sign of ""advance"" payment document is current!'"));
		
	Иначе
		
		ЭтоРасчетыСПокупателями = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя");
		
		СтруктураОтбор = Новый Структура();
		СтруктураОтбор.Вставить("Контрагент", Объект.Контрагент);
		
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
			СтруктураОтбор.Вставить("Договор", СтрокаТабличнойЧасти.Договор);
		КонецЕсли;
		Если НЕ УчетПоКомпании Тогда
			СтруктураОтбор.Вставить("Организация", Объект.Организация);
		КонецЕсли;
		
		СтруктураПараметры = Новый Структура("Отбор, ЭтоРасчетыСПокупателями, ТипДокумента",
			СтруктураОтбор,
			ЭтоРасчетыСПокупателями,
			ТипЗнч(Объект.Ссылка)
		);
		
		ОткрытьФорму("ОбщаяФорма.ФормаВыборДокументаРасчетов", СтруктураПараметры, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры // РасшифровкаПлатежаДокументНачалоВыбора()

&НаКлиенте
Процедура РасшифровкаПлатежаДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбработатьВыборДокументаРасчетов(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСуммаРасчетовПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежа.ТекущиеДанные);
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 ИЛИ ИсходнаяСуммаРавнаНулю Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	КонецЕсли;
	
КонецПроцедуры // РасшифровкаПлатежаСуммаРасчетовПриИзменении()

&НаКлиенте
Процедура РасшифровкаПлатежаКурсПриИзменении(Элемент)
	
	РасшифровкаПлатежаКурсПриИзмененииФрагмент(Элементы.РасшифровкаПлатежа.ТекущиеДанные);
	
КонецПроцедуры // РасшифровкаПлатежаКурсПриИзменении()

&НаКлиенте
Процедура РасшифровкаПлатежаКурсПриИзмененииФрагмент(ТекущиеДанные)
	
	Если ТекущиеДанные.СуммаПлатежа = 0 И ТекущиеДанные.СуммаРасчетов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуПлатежаНаКлиенте(ТекущиеДанные, "Курс");
		
	Если Объект.РасшифровкаПлатежа.Количество() = 1 ИЛИ ИсходнаяСуммаРавнаНулю Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	КонецЕсли;
	
КонецПроцедуры // РасшифровкаПлатежаКурсПриИзменении()

&НаКлиенте
Процедура РасшифровкаПлатежаКратностьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТекущиеДанные.СуммаПлатежа = 0 И ТекущиеДанные.СуммаРасчетов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежа.ТекущиеДанные, "Кратность");
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 ИЛИ ИсходнаяСуммаРавнаНулю Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	КонецЕсли;
	
КонецПроцедуры // РасшифровкаПлатежаКратностьПриИзменении()

&НаКлиенте
Процедура РасшифровкаПлатежаСуммаПлатежаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	РасшифровкаПлатежаСуммаПлатежаПриИзмененииЗавершениеНаКлиенте(СтрокаТабличнойЧасти);
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 ИЛИ ИсходнаяСуммаРавнаНулю Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	КонецЕсли;
		
	ПересчитатьИтогиПриИзмененииАвансаНаКлиенте();
	
КонецПроцедуры // РасшифровкаПлатежаСуммаПлатежаПриИзменении()

&НаКлиенте
Процедура РасшифровкаПлатежаСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
	
КонецПроцедуры // РасшифровкаПлатежаСтавкаНДСПриИзменении()

&НаКлиенте
Процедура СтавкаНДСРасчетыСАгентомПриИзменении(Элемент)
	
	Если Объект.РасшифровкаПлатежа.Количество() > 1 Тогда
		Объект.РасшифровкаПлатежа.Очистить();
	КонецЕсли;
	
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		СтрокаТабличнойЧасти = Объект.РасшифровкаПлатежа.Добавить();
		СтрокаТабличнойЧасти.СуммаПлатежа = Объект.СуммаДокумента;
	Иначе
		СтрокаТабличнойЧасти = Объект.РасшифровкаПлатежа[0];
	КонецЕсли;
	
	РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаДокументПриИзменении(Элемент)
	
	ВыполнитьДействияПриИзмененииДокументаРасчетов();
	
КонецПроцедуры // РасшифровкаПлатежаДокументПриИзменении()

&НаКлиенте
Процедура РасшифровкаПлатежаСчетНаОплатуПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ВидОперацииОтПокупателя Тогда
		РасшифровкаПлатежаСчетНаОплатуПриИзмененииФрагмент(Элементы.РасшифровкаПлатежа.ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаПлатежаСчетНаОплатуПриИзмененииФрагмент(ТекущиеДанныеИдентификатор)
	
	ТекущиеДанные = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
	Если Объект.Контрагент.ВестиРасчетыПоЗаказам Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.СчетНаОплату) И 
			НЕ ЗначениеЗаполнено(ТекущиеДанные.Заказ) И
			ТипЗнч(ТекущиеДанные.СчетНаОплату) = Тип("ДокументСсылка.СчетНаОплату") И
			ТипЗнч(ТекущиеДанные.СчетНаОплату.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ТекущиеДанные.Заказ = ТекущиеДанные.СчетНаОплату.ДокументОснование;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаЗаказПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ВидОперацииОтПокупателя Тогда
		РасшифровкаПлатежаЗаказПриИзмененииФрагмент(Элементы.РасшифровкаПлатежа.ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаПлатежаЗаказПриИзмененииФрагмент(ТекущиеДанныеИдентификатор)
	
	ТекущиеДанные = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
	Если Объект.Контрагент.ВестиУчетОплатыПоСчетам Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.Заказ) И 
			НЕ ЗначениеЗаполнено(ТекущиеДанные.СчетНаОплату) И
			ТипЗнч(ТекущиеДанные.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетНаОплату.Ссылка КАК СчетНаОплату
			|ИЗ
			|	Документ.СчетНаОплату КАК СчетНаОплату
			|ГДЕ
			|	СчетНаОплату.ДокументОснование = &ДокументОснование";
			
			Запрос.УстановитьПараметр("ДокументОснование", ТекущиеДанные.Заказ);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Количество() = 1
				И Выборка.Следующий() Тогда
				
				ТекущиеДанные.СчетНаОплату = Выборка.СчетНаОплату;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ТекущиеДанные.ПризнакАванса
		И ТекущиеДанные.Заказ.Контрагент.ВестиРасчетыПоДокументам
		И ЗначениеЗаполнено(ТекущиеДанные.Заказ)
		И НЕ ЗначениеЗаполнено(ТекущиеДанные.Документ) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасходнаяНакладнаяЗапасы.Ссылка КАК Ссылка,
			|	СУММА(РасходнаяНакладнаяЗапасы.Всего) КАК Всего
			|ИЗ
			|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
			|ГДЕ
			|	РасходнаяНакладнаяЗапасы.Заказ = &Заказ
			|	И РасходнаяНакладнаяЗапасы.Ссылка.Проведен
			|
			|СГРУППИРОВАТЬ ПО
			|	РасходнаяНакладнаяЗапасы.Ссылка";
		
		Запрос.УстановитьПараметр("Заказ", ТекущиеДанные.Заказ);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Количество() = 1 Тогда
			
			Выборка.Следующий();
			
			ТекущиеДанные.Документ = Выборка.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСуммаПлатежаПриИзмененииЗавершениеНаКлиенте(СтрокаТабличнойЧасти, ИмяКолонки = "СуммаПлатежа")
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтруктураДанные = ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении(
			Объект.Дата,
			СтрокаТабличнойЧасти.Договор
		);
		
	Если СтрокаТабличнойЧасти.СуммаПлатежа = 0 Тогда
		СтрокаТабличнойЧасти.СуммаРасчетов = 0;
		СтрокаТабличнойЧасти.Курс = СтруктураДанные.ДоговорВалютаКурсКратность.Курс;
	ИначеЕсли Объект.ВалютаДенежныхСредств = СтруктураДанные.ВалютаРасчетов Тогда
		СтрокаТабличнойЧасти.СуммаРасчетов = СтрокаТабличнойЧасти.СуммаПлатежа;
	ИначеЕсли СтрокаТабличнойЧасти.СуммаРасчетов = 0 Тогда
		СтрокаТабличнойЧасти.СуммаРасчетов = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
			СтрокаТабличнойЧасти.СуммаПлатежа,
			Курс,
			СтрокаТабличнойЧасти.Курс,
			Кратность,
			СтрокаТабличнойЧасти.Кратность
		);
	Иначе
		СтрокаТабличнойЧасти.Курс = ?(
			СтрокаТабличнойЧасти.СуммаРасчетов = 0 ИЛИ СтрокаТабличнойЧасти.СуммаПлатежа = 0,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс,
			СтрокаТабличнойЧасти.СуммаПлатежа / СтрокаТабличнойЧасти.СуммаРасчетов * Курс
		);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
		СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
	РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
	
	СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса, СтрокаТабличнойЧасти.СуммаПлатежа, 0);
	
КонецПроцедуры // РасшифровкаПлатежаСуммаПлатежаПриИзменении()

&НаСервере
Процедура РасшифровкаПлатежаСуммаПлатежаПриИзмененииЗавершениеНаСервере(СтрокаТабличнойЧасти, ДолгВалДоговора = 0, ДолгВалПлатежа = 0)
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтруктураДанные = ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении(
			Объект.Дата,
			СтрокаТабличнойЧасти.Договор
		);
		
	Если СтрокаТабличнойЧасти.СуммаПлатежа = 0 Тогда
		СтрокаТабличнойЧасти.СуммаРасчетов = 0;
		СтрокаТабличнойЧасти.Курс = СтруктураДанные.ДоговорВалютаКурсКратность.Курс;
	ИначеЕсли Объект.ВалютаДенежныхСредств = СтруктураДанные.ВалютаРасчетов Тогда
		СтрокаТабличнойЧасти.СуммаРасчетов = СтрокаТабличнойЧасти.СуммаПлатежа;
	ИначеЕсли СтрокаТабличнойЧасти.СуммаРасчетов = 0 Тогда
		Если ДолгВалДоговора <> 0 И ДолгВалПлатежа = СтрокаТабличнойЧасти.СуммаПлатежа Тогда
			СтрокаТабличнойЧасти.СуммаРасчетов = ДолгВалДоговора;
		Иначе
			СтрокаТабличнойЧасти.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
				СтрокаТабличнойЧасти.СуммаПлатежа,
				Курс,
				СтрокаТабличнойЧасти.Курс,
				Кратность,
				СтрокаТабличнойЧасти.Кратность
			);
		КонецЕсли;
	Иначе
		СтрокаТабличнойЧасти.Курс = ?(
			СтрокаТабличнойЧасти.СуммаРасчетов = 0 ИЛИ СтрокаТабличнойЧасти.СуммаПлатежа = 0,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс,
			СтрокаТабличнойЧасти.СуммаПлатежа / СтрокаТабличнойЧасти.СуммаРасчетов * Курс
		);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
		СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
	РассчитатьСуммуНДСНаСервере(СтрокаТабличнойЧасти);
	
	СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса, СтрокаТабличнойЧасти.СуммаПлатежа, 0);
	
КонецПроцедуры // РасшифровкаПлатежаСуммаПлатежаПриИзменении()

&НаКлиенте
Процедура РасчетыСПодотчетникомРасшифровкаПлатежаСуммаПлатежаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.РасчетыСПодотчетникомРасшифровкаПлатежа.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.СуммаРасчетов = ТекущаяСтрока.СуммаПлатежа;
	КонецЕсли;
	ПересчитатьИтогиПриИзмененииАвансаНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаДокументПланированияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	СтруктураДанных = ПолучитьДанныеДокументаПланированияПриИзменении(ТекущиеДанные.ДокументПланирования);
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументПланирования) Тогда
		Если НЕ ПустойРеквизитСтатьяВДокументах Тогда 
			ТекущиеДанные.СтатьяДДС = СтруктураДанных.СтатьяДДС;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыДокументПланированияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные;
	СтруктураДанных = ПолучитьДанныеДокументаПланированияПриИзменении(ТекущиеДанные.ДокументПланирования);
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументПланирования) Тогда
		Если НЕ ПустойРеквизитСтатьяВДокументах Тогда 
			ТекущиеДанные.СтатьяДДС = СтруктураДанных.СтатьяДДС;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетыСПодотчетникомРасшифровкаПлатежаСчетНаОплатуПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасчетыСПодотчетникомРасшифровкаПлатежа.ТекущиеДанные;
	СтруктураДанных = ПолучитьДанныеДокументаПланированияПриИзменении(ТекущиеДанные.ДокументПланирования);
	
	Если ЗначениеЗаполнено(СтруктураДанных.СтатьяДДС) Тогда
		Если НЕ ПустойРеквизитСтатьяВДокументах Тогда 
			ТекущиеДанные.СтатьяДДС = СтруктураДанных.СтатьяДДС;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаРасчетыПоКредитамДокументПланированияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежаРасчетыПоКредитам.ТекущиеДанные;
	СтруктураДанных = ПолучитьДанныеДокументаПланированияПриИзменении(ТекущиеДанные.ДокументПланирования);
	
	Если ЗначениеЗаполнено(СтруктураДанных.СтатьяДДС) Тогда
		Если НЕ ПустойРеквизитСтатьяВДокументах Тогда 
			ТекущиеДанные.СтатьяДДС = СтруктураДанных.СтатьяДДС;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДолгов

&НаКлиенте
Процедура ТаблицаДолговВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТаблицаДолговДокумент" Тогда
		ТекущиеДанные = Элементы.ТаблицаДолгов.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТекущиеДанные.Документ) Тогда
			ПараметрыОткрытия = Новый Структура("Ключ", ТекущиеДанные.Документ);
			ОткрытьФорму("Документ."+ПолучитьИмяТипаДокумента(ТекущиеДанные.Документ)+".ФормаОбъекта", ПараметрыОткрытия);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "ТаблицаДолговЗаказ" ИЛИ Поле.Имя = "ТаблицаДолговЗаказКогдаНетУчетаПоДокументам" Тогда
		ТекущиеДанные = Элементы.ТаблицаДолгов.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТекущиеДанные.Заказ) Тогда
			ПараметрыОткрытия = Новый Структура("Ключ", ТекущиеДанные.Заказ);
			Если ТипЗнч(ТекущиеДанные.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				ОткрытьФорму("Документ.ЗаказПокупателя.ФормаОбъекта", ПараметрыОткрытия);
			Иначе
				ОткрытьФорму("Документ.ЗаказПоставщику.ФормаОбъекта", ПараметрыОткрытия);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДолговВыбранПриИзменении(Элемент)
	
	ТаблицаДолговВыбранПриИзмененииЗавершение(Элементы.ТаблицаДолгов.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаДолговВыбранПриИзмененииЗавершение(ИдентификаторТаблицыДолгов)
	
	ТекущаяСтрокаДолгов = ТаблицаДолгов.НайтиПоИдентификатору(ИдентификаторТаблицыДолгов);
	
	Если ТекущаяСтрокаДолгов.Выбран Тогда // Возможно, требуется добавить новую строку.
		ПриИзмененииВТаблицеДолгов("Выбран", ТекущаяСтрокаДолгов.ПолучитьИдентификатор());
	Иначе
		ТекущаяСтрокаРасшифровки = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ТекущаяСтрокаДолгов.ИдентификаторСтрокиРасшифровкиПлатежа);
		Если ТекущаяСтрокаРасшифровки <> Неопределено Тогда
			ТекущаяСтрокаРасшифровки.СуммаРасчетов = 0;
			ТекущаяСтрокаРасшифровки.СуммаПлатежа = 0;
			ТекущаяСтрокаРасшифровки.СуммаНДС = 0;
		КонецЕсли;
		
		ТекущаяСтрокаДолгов.СуммаРасчетов = 0;
		ТекущаяСтрокаДолгов.Зачесть = 0;
		ТекущаяСтрокаДолгов.ЗачестьВыбрано = 0;
		
		ПересчитатьИтогиПриИзмененииАвансаНаСервере(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДолговЗачестьПриИзменении(Элемент)
	
	ТекущаяСтрокаДолгов = Элементы.ТаблицаДолгов.ТекущиеДанные;
	
	ТекущаяСтрокаДолгов.Выбран = Истина;
	ПриИзмененииВТаблицеДолгов("Зачесть", ТекущаяСтрокаДолгов.ПолучитьИдентификатор(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДолговСуммаРасчетовПриИзменении(Элемент)
	
	ТекущаяСтрокаДолгов = Элементы.ТаблицаДолгов.ТекущиеДанные;
	
	ТекущаяСтрокаДолгов.Выбран = Истина;
	ПриИзмененииВТаблицеДолгов("СуммаРасчетов", ТекущаяСтрокаДолгов.ПолучитьИдентификатор(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДолговКурсПриИзменении(Элемент)
	
	ТаблицаДолговКурсПриИзмененииФрагмент(Элементы.ТаблицаДолгов.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДолговКурсПриИзмененииФрагмент(ТекущаяСтрокаДолгов)
	
	ТекущаяСтрокаДолгов.Выбран = Истина;
	ПриИзмененииВТаблицеДолгов("Курс", ТекущаяСтрокаДолгов.ПолучитьИдентификатор(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДолговКратностьПриИзменении(Элемент)
	
	ТекущаяСтрокаДолгов = Элементы.ТаблицаДолгов.ТекущиеДанные;
	
	ТекущаяСтрокаДолгов.Выбран = Истина;
	ПриИзмененииВТаблицеДолгов("Кратность", ТекущаяСтрокаДолгов.ПолучитьИдентификатор(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДолговСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрокаДолгов = Элементы.ТаблицаДолгов.ТекущиеДанные;
	
	ТекущаяСтрокаДолгов.Выбран = Истина;
	ПриИзмененииВТаблицеДолгов("СтавкаНДС", ТекущаяСтрокаДолгов.ПолучитьИдентификатор(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДолговСчетПриИзменении(Элемент)
	
	ТекущаяСтрокаДолгов = Элементы.ТаблицаДолгов.ТекущиеДанные;
	ТекущаяСтрокаДолгов.Выбран = Истина;
	ПриИзмененииВТаблицеДолгов("СчетНаОплату", ТекущаяСтрокаДолгов.ПолучитьИдентификатор(), Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ka='დასაწყისში მიუთითეთ კონტრაგენტი!';ru='Укажите вначале контрагента!';en='Specify the first contractor!'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчет)
	   И НЕ ЗначениеЗаполнено(Объект.ВалютаДенежныхСредств) Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ka='თავდაპირველად, მიუთითეთ საბანკო ანგარიში!';ru='Укажите вначале банковский счет!';en='Specify the first bank account!'"));
		Возврат;
	КонецЕсли;
	
	АдресРасшифровкаПлатежаВХранилище = ПоместитьРасшифровкаПлатежаВХранилище();
	
	ПараметрыПодбора = Новый Структура(
		"АдресРасшифровкаПлатежаВХранилище,
		|Компания,
		|Дата,
		|Контрагент,
		|Ссылка,
		|ВидОперации,
		|ВалютаДенежныхСредств,
		|СуммаДокумента,
		|БанковскийСчет,
		|ЭквайринговыйТерминал",
		АдресРасшифровкаПлатежаВХранилище,
		Компания,
		Объект.Дата,
		Объект.Контрагент,
		Объект.Ссылка,
		Объект.ВидОперации,
		Объект.ВалютаДенежныхСредств,
		Объект.СуммаДокумента,
		Объект.БанковскийСчет,
		Объект.ЭквайринговыйТерминал
	);
		
	Результат = Неопределено;

		
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораДолговПокупателей", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект, Новый Структура("АдресРасшифровкаПлатежаВХранилище", АдресРасшифровкаПлатежаВХранилище)));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗавершение(Результат1, ДополнительныеПараметры) Экспорт
	
	АдресРасшифровкаПлатежаВХранилище = ДополнительныеПараметры.АдресРасшифровкаПлатежаВХранилище;
	
	
	Результат = Результат1;
	Если Результат = КодВозвратаДиалога.OK Тогда
		
		ПолучитьРасшифровкаПлатежаИзХранилища(АдресРасшифровкаПлатежаВХранилище);
		ИмяТабличнойЧасти = "РасшифровкаПлатежа";
		Для каждого СтрокаРасшифровкаПлатежа Из Объект.РасшифровкаПлатежа Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаРасшифровкаПлатежа.СтавкаНДС) Тогда
				СтрокаРасшифровкаПлатежа.СтавкаНДС = СтавкаНДСПоУмолчанию;
			КонецЕсли;
			РассчитатьСуммуПлатежаНаКлиенте(СтрокаРасшифровкаПлатежа);
		КонецЦикла;
		
		УстановитьТекущуюСтраницу();
		
		Если Объект.РасшифровкаПлатежа.Количество() = 1 ИЛИ ИсходнаяСуммаРавнаНулю Тогда
			Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // Подбор()

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ПоказатьПредупреждение(Неопределено,Нстр("ka='არ არის არჩეული დოკუმენტი საფუძველი!';ru='Не выбран документ основание!';en='Do not select a document base!'"));
		Возврат;
	КонецЕсли;
	
	Ответ = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", ЭтотОбъект), НСтр("ka='დოკუმენტი სრულად გადაივსება ""საფუძველი-დოკუმენტით""! გავაგრძელოთ ოპერაციის შესრულება?';ru='Документ будет полностью перезаполнен по ""Документу-основанию""! Продолжить выполнение операции?';en='The document will be fully refilled by ""document-base!"" To continue the operation?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ПредЗначениеБанковскийСчет = Объект.БанковскийСчет;
		// Возможно, что будет прерываение при заполнении на основании приема и передачи в ремонт и тогда банковский счет останется пустым.
		Если ТипЗнч(Объект.ДокументОснование) <> Тип("ДокументСсылка.ПриемИПередачаВРемонт") Тогда
			Объект.БанковскийСчет = Неопределено;
		КонецЕсли;
		Объект.СчетКонтрагента = Неопределено;
		ЗаполнитьПоДокументу(Объект.ДокументОснование);
		
		Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
			Объект.РасшифровкаПлатежа.Добавить();
			Объект.РасшифровкаПлатежа[0].СуммаПлатежа = Объект.СуммаДокумента;
		КонецЕсли;
		
		ВидОперации = Объект.ВидОперации;
		ВалютаДенежныхСредств = Объект.ВалютаДенежныхСредств;
		ДатаДокумента = Объект.Дата;
		
		УстановитьТекущуюСтраницу();
		ЗаполнитьПоОснованиюЗавершениеНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоОснованию()

&НаСервере
Процедура ЗаполнитьПоОснованиюЗавершениеНаСервере()
	
	ВидОперацииПриИзмененииНаСервере();
	
	Если Объект.ВидОперации = ВидОперацииОтПокупателя И Объект.ВариантЗаполненияРасшифровки <> ВариантЗаполненияРасшифровкиВручную Тогда
		Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиВручную;
		НастроитьЭлементыРаспределенияДолговНаСервере();
	КонецЕсли;
	
	Если НЕ (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеДСПлан")
		ИЛИ ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеДСПлан"))
	Тогда
		
		УстановитьСтатьюДДС();
		Если НЕ Объект.Контрагент.Пустая() Тогда
			УстановитьСтатьиДДСВРасшифровкеПлатежа();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасшифровку(Команда)
	
	Если Объект.СуммаДокумента = 0 Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ka='მიუთითეთ დასაწყისში დოკუმენტის თანხა.';ru='Укажите вначале сумму документа.';en='Specify the first amount of the document.'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчет)
	   И НЕ ЗначениеЗаполнено(Объект.ВалютаДенежныхСредств) Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ka='თავდაპირველად, მიუთითეთ საბანკო ანგარიში!';ru='Укажите вначале банковский счет!';en='Specify the first bank account!'"));
		Возврат;
	КонецЕсли;
	
	Ответ = Неопределено;

	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьРасшифровкуЗавершение", ЭтотОбъект), 
		НСтр("ka='გაშიფრვა სრულად გადაივსება. გავაგრძელოთ?';ru='Расшифровка будет полностью перезаполнена. Продолжить?';en='Decryption is completely refilled. Proceed?'"),
		РежимДиалогаВопрос.ДаНет
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасшифровкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Объект.РасшифровкаПлатежа.Очистить();
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя") Тогда
		
		ЗаполнитьРасшифровкуПлатежа();
		
	КонецЕсли;
	
	УстановитьТекущуюСтраницу();
	
КонецПроцедуры // ЗаполнитьРасшифровку()

&НаКлиенте
Процедура ОбновитьКурсВТекущейСтрокеРасшифровки(Команда)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	СтруктураДанных = ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении(Объект.Дата, ТекущиеДанные.Договор);
	ТекущиеДанные.Курс = СтруктураДанных.ДоговорВалютаКурсКратность.Курс;
	ТекущиеДанные.Кратность = СтруктураДанных.ДоговорВалютаКурсКратность.Кратность;
	РасшифровкаПлатежаКурсПриИзмененииФрагмент(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачестьДолгиАвтоматически(Команда)
	
	ЗачестьДолгиАвтоматическиФрагмент();
	
КонецПроцедуры

&НаСервере
Процедура ЗачестьДолгиАвтоматическиФрагмент()
	
	Для Каждого ТекущаяСтрока Из ТаблицаДолгов Цикл
		Если ТекущаяСтрока.Выбран Тогда
			ТекущаяСтрока.Выбран = Ложь;
			ТаблицаДолговВыбранПриИзмененииЗавершение(ТекущаяСтрока.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	// Отметка у всех строк снята, а значит аванс = сумме документа!
	// Эта строка нужна для случая, когда в строке не было отмечено ни одной строки.
	// Если отмечена хоть одна строка, то сумма аванса будет обновлена при снятии отметки.
	СуммаПлатежаАванс = Объект.СуммаДокумента;
	
	НужноРаспределить = Объект.СуммаДокумента;
	Для Каждого ТекущаяСтрока Из ТаблицаДолгов Цикл
		
		Если ТекущаяСтрока.ДолгВалПлатежа <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НужноРаспределить <= 0 Тогда
			Прервать;
		Иначе
			ТекущаяСтрока.Зачесть = Мин(НужноРаспределить, ТекущаяСтрока.ДолгВалПлатежа);
			ТекущаяСтрока.Выбран = Истина;
			ТекущаяСтрока.ЗачестьВыбрано = ТекущаяСтрока.Зачесть;
			
			ТаблицаДолговВыбранПриИзмененииЗавершение(ТекущаяСтрока.ПолучитьИдентификатор());
			
			НужноРаспределить = НужноРаспределить - ТекущаяСтрока.Зачесть;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоДоговору(Команда)
	
	СписокПодменю = Новый СписокЗначений;
	СписокПодменю.Добавить("Договор", "Фильтр по договору");
	СписокПодменю.Добавить("ДолгВалДоговора", "Фильтр по сумме долга");
	СписокПодменю.Добавить("Документ", "Фильтр по документу");
	СписокПодменю.Добавить("Заказ", "Фильтр по заказу");
	
	ПоказатьВыборИзМеню(Новый ОписаниеОповещения("УстановитьОтборПоДоговоруЗавершение", ЭтотОбъект), СписокПодменю, Элементы.УстановитьОтборПоДоговору);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоДоговоруЗавершение(РезультатЗавершения, ПараметрыЗавершения) Экспорт
	
	Если РезультатЗавершения <> Неопределено Тогда
		ВыполнитьПоискПоДоговоруНаСервере(РезультатЗавершения.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтборПоДоговору(Команда)
	СнятьОтборПоДоговоруНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицаДолгов(Команда)
	
	Если Объект.Контрагент.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ka='დასაწყისში მიუთითეთ კონტრაგენტი!';ru='Укажите вначале контрагента!';en='Specify the first contractor!'"));
		Возврат;
	КонецЕсли;
	Если Объект.Организация.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ka='თავდაპირველად, მიუთითეთ ორგანიზაცია!';ru='Укажите вначале организацию!';en='Specify the first organization!'"));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДолги(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СнятьОтборПоДоговоруНаСервере()
	
	Элементы.ТаблицаДолгов.ОтборСтрок = Неопределено;
	Элементы.СнятьОтборПоДоговору.Доступность = Ложь;
	Элементы.УстановитьОтборПоДоговору.Доступность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуРасчетовВСпискеДолгов(ТекущаяСтрокаРасшифровки, ТекущаяСтрокаДолгов, ИмяКолонки, ДолгВалДоговора = 0, ДолгВалПлатежа = 0)
	
	ТекущаяСтрокаРасшифровки.СуммаПлатежа = ТекущаяСтрокаДолгов.Зачесть;
	
	РасшифровкаПлатежаСуммаПлатежаПриИзмененииЗавершениеНаСервере(ТекущаяСтрокаРасшифровки, ДолгВалДоговора, ДолгВалПлатежа);
	
	ТекущаяСтрокаДолгов.СуммаРасчетов = ТекущаяСтрокаРасшифровки.СуммаРасчетов;
	ТекущаяСтрокаДолгов.Курс = ТекущаяСтрокаРасшифровки.Курс;
	// Обновим кратность на случай, если пользователь обнулил курс и кратность, когда сумма расчетов и сумма платежа были = 0.
	ТекущаяСтрокаДолгов.Кратность = ТекущаяСтрокаРасшифровки.Кратность;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуПлатежаВСпискеДолгов(ТекущаяСтрокаРасшифровки, ТекущаяСтрокаДолгов, ИмяКолонки)
	
	ТекущаяСтрокаРасшифровки.СуммаРасчетов = ТекущаяСтрокаДолгов.СуммаРасчетов;
	
	РассчитатьСуммуПлатежаНаСервере(ТекущаяСтрокаРасшифровки);
	
	ТекущаяСтрокаДолгов.Зачесть = ТекущаяСтрокаРасшифровки.СуммаПлатежа;
	ТекущаяСтрокаДолгов.ЗачестьВыбрано = ?(ТекущаяСтрокаДолгов.Выбран, ТекущаяСтрокаРасшифровки.СуммаПлатежа, 0);
	ТекущаяСтрокаДолгов.Курс = ТекущаяСтрокаРасшифровки.Курс;
	// Обновим кратность на случай, если пользователь обнулил курс и кратность, когда сумма расчетов и сумма платежа были = 0.
	ТекущаяСтрокаДолгов.Кратность = ТекущаяСтрокаРасшифровки.Кратность;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПолеДатаДокБольшеДатыДокументаВТаблицеДолгов()
	
	Для Каждого ТекущаяСтрока Из ТаблицаДолгов Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.Документ) Тогда
			ТекущаяСтрока.ДатаДокБольшеДатыДокумента = (КонецДня(ТекущаяСтрока.ДатаДокумента) > КонецДня(Объект.Дата));
		Иначе
			ТекущаяСтрока.ДатаДокБольшеДатыДокумента = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДляВыбораДокументаОснования()
	
	СписокОснований = Новый СписокЗначений;
	
	СписокОснований.Добавить("Документ.АктВыполненныхРабот.ФормаВыбора", "Акт выполненных работ");
	Если ПолучитьФункциональнуюОпцию("УчетВнеоборотныхАктивов") Тогда
		СписокОснований.Добавить("Документ.ПередачаВА.ФормаВыбора", "Продажа имущества");
	КонецЕсли;
	СписокОснований.Добавить("Документ.РасходнаяНакладная.ФормаВыбора", "Расходная накладная");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРемонты") Тогда
		СписокОснований.Добавить("Документ.ПриемИПередачаВРемонт.ФормаВыбора", "Прием и передача в ремонт");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("КредитыИЗаймы") Тогда
		СписокОснований.Добавить("Документ.НачисленияПоКредитамИЗаймам.ФормаВыбора", "Начисления по кредитам и займам");
		СписокОснований.Добавить("Документ.ДоговорКредитаИЗайма.ФормаВыбора", "Договор кредита (займа)");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь") Тогда
		СписокОснований.Добавить("Документ.ПеремещениеДСПлан.ФормаВыбора", "Перемещение денег (план)");
		СписокОснований.Добавить("Документ.ПоступлениеДСПлан.ФормаВыбора", "Поступление денег (план)");
	КонецЕсли;
	СписокОснований.Добавить("Документ.ЗаказПокупателя.ФормаВыбора", "Заказ покупателя");
	СписокОснований.Добавить("Документ.СчетНаОплату.ФормаВыбора", "Счет на оплату");
	
	СписокОснований.Добавить("Документ.НачислениеНалогов.ФормаВыбора", "Начисление налогов");
	
	СписокОснований.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
	Возврат СписокОснований;
	
КонецФункции

&НаКлиенте
Процедура ВыборТипаОснованияЗавершение(ВыбИмяФормы, Параметры) Экспорт
	
	Если ВыбИмяФормы<>Неопределено Тогда
		
		СтруктураПараметровОтбора = Новый Структура();
		Для каждого элОтбора Из ПараметрыВыбораДокументаОснования Цикл
			ИмяПоляОтбора = СтрЗаменить(элОтбора.Имя,"Отбор.","");
			СтруктураПараметровОтбора.Вставить(ИмяПоляОтбора, элОтбора.Значение);
		КонецЦикла;
		_ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьОснованиеЗавершение", ЭтотОбъект);
		ОткрытьФорму(ВыбИмяФормы.Значение, СтруктураПараметровОтбора, ЭтотОбъект, ,,,_ОповещениеОЗакрытии);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОснованиеЗавершение(ВыбЗначение, Параметры) Экспорт

	Если ВыбЗначение<>Неопределено Тогда
		Объект.ДокументОснование = ВыбЗначение;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(ВыбЗначение);
		Элементы.ДокументОснованиеНадписьАвто.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(ВыбЗначение);
		Элементы.ДокументОснованиеНадписьВручную.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(ВыбЗначение);
		Элементы.ДокументОснованиеНадписьСПомощником.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(ВыбЗначение);
		Модифицированность = Истина;
		
		ЗаполнитьПоОснованиюНачало();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюНачало() Экспорт

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", ЭтотОбъект);
	ПоказатьВопрос(
		ОписаниеОповещения, 
		НСтр("ka='შევავსოთ დოკუმენტი არჩეული საფუძვლით?';ru='Заполнить документ по выбранному основанию?';en='Complete the document by the selected base?'"), 
		РежимДиалогаВопрос.ДаНет, 0);		

КонецПроцедуры

&НаСервере
Процедура УстановитьСтатьюДДСПриСменеВидаОперации()
	
	Если (Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты)
		И (Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам
		ИЛИ Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.Прочее) Тогда
		Если НЕ ПустойРеквизитСтатьяВДокументах Тогда 
			Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей;
		КонецЕсли;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика
		И (Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей
		ИЛИ Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.Прочее) Тогда
		Если НЕ ПустойРеквизитСтатьяВДокументах Тогда 
			Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам;
		КонецЕсли;
	ИначеЕсли ((Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей И 
				Объект.ВидОперации <> Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя)
		ИЛИ (Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам И
				Объект.ВидОперации <> Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика)) Тогда
		Если НЕ ПустойРеквизитСтатьяВДокументах Тогда 
			Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.Прочее;
		КонецЕсли;
	КонецЕсли;
	
	СистемаНалогообложенияСтруктура = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(Объект.Организация, Объект.Дата);
	
	// Если используется стандартная статья Прочее, то нужно установить УчитыватьВНУ
	Если Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.Прочее
		И (Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Налоги) Тогда
		Объект.УчитыватьВНУ = СистемаНалогообложенияСтруктура.ПлательщикУСН;
	Иначе
		Если ЗначениеЗаполнено(Объект.Статья) Тогда
			Объект.УчитыватьВНУ = Объект.Статья.УчитыватьВНУ И СистемаНалогообложенияСтруктура.ПлательщикУСН;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ВидОперацииПриИзмененииНаСервере()

&НаСервере
Процедура УстановитьСтатьюДДС()
	
	СтруктураДанных = ПолучитьДанныеСтатьиДДС();
	
	Если НЕ ПустойРеквизитСтатьяВДокументах Тогда 
		Объект.Статья = СтруктураДанных.Статья;
	КонецЕсли;
	Объект.УчитыватьВНУ = СтруктураДанных.УчитыватьВНУ;
	
КонецПроцедуры // ВидОперацииПриИзмененииНаСервере()

&НаСервере
Функция ПолучитьДанныеСтатьиДДС()
	
	СтруктураДляВозврата = Новый Структура;
	
	Если НЕ Объект.Контрагент.Пустая() И НЕ Объект.Контрагент.СтатьяДДСПоУмолчанию.Пустая() Тогда
		СтруктураДляВозврата.Вставить("Статья", Объект.Контрагент.СтатьяДДСПоУмолчанию);
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты Тогда
		СтруктураДляВозврата.Вставить("Статья", Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей);
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика Тогда
		СтруктураДляВозврата.Вставить("Статья", Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам);
	Иначе
		СтруктураДляВозврата.Вставить("Статья", Справочники.СтатьиДвиженияДенежныхСредств.Прочее);
	КонецЕсли;
	
	СистемаНалогообложенияСтруктура = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(Объект.Организация, Объект.Дата);
	
	// Если используется стандартная статья Прочее, то нужно установить УчитыватьВНУ
	Если Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.Прочее
		И (Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Налоги) Тогда
		СтруктураДляВозврата.Вставить("УчитыватьВНУ", СистемаНалогообложенияСтруктура.ПлательщикУСН);
	Иначе
		Если ЗначениеЗаполнено(Объект.Статья) Тогда
			СтруктураДляВозврата.Вставить("УчитыватьВНУ", Объект.Статья.УчитыватьВНУ И СистемаНалогообложенияСтруктура.ПлательщикУСН);
		Иначе
			СтруктураДляВозврата.Вставить("УчитыватьВНУ", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураДляВозврата;
	
КонецФункции // ПолучитьДанныеСтатьиДДС()

&НаСервере
Процедура ДополнитьСписокВыбораВидовОпераций()
	
	СписокВидовОпераций = ДвиженияДенежныхСредствВызовСервера.ПолучитьСписокВидовОперацийПоступленияДСБанк();
	Элементы.ВидОперации.СписокВыбора.ЗагрузитьЗначения(СписокВидовОпераций.ВыгрузитьЗначения());
	
КонецПроцедуры // ДополнитСписокВыбораВидовОпераций()

&НаСервере
Процедура ЗаполнитьИнформациюОСуммеИВалютеОснования()
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Попытка
			ДокументОснованиеСумма = Объект.ДокументОснование.СуммаДокумента;
			ДокументОснованиеВалютаПредставление = Объект.ДокументОснование.ВалютаДокумента.СимвольноеПредставление;
		Исключение
			// Нет реквизита "СуммаДокумента" или "ВалютаДокумента".
			ДокументОснованиеСумма = 0;
			ДокументОснованиеВалютаПредставление = "";
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументу(ДокОснование)
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.Заполнить(ДокОснование);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Истина;
	
	УстановитьВидимостьНалогообложениеНДС();
	УстановитьВидимостьРеквизитовРасчетов();
	
	ЗаполнитьИнформациюОСуммеИВалютеОснования();
	
КонецПроцедуры // ЗаполнитьПоДокументу()

&НаСервере
Функция ПоместитьРасшифровкаПлатежаВХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.РасшифровкаПлатежа.Выгрузить(,
			"Договор,
			|ПризнакАванса,
			|Документ,
			|Заказ,
			|СуммаРасчетов,
			|Курс,
			|Кратность,
			|СуммаРасчетовКомиссии"
		),
		УникальныйИдентификатор
	);
	
КонецФункции // ПоместитьРасшифровкаПлатежаВХранилище()

&НаСервере
Функция ПоместитьРасшифровкаПлатежаОтАгентаВХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.РасшифровкаПлатежаОтАгента.Выгрузить(,
			"Документ,
			|Заказ,
			|СуммаПлатежа"
		),
		УникальныйИдентификатор
	);
	
КонецФункции // ПоместитьРасшифровкаПлатежаВХранилище()

&НаСервере
Процедура ПолучитьРасшифровкаПлатежаИзХранилища(АдресРасшифровкаПлатежаВХранилище, Очищать = Истина)
	
	ТаблицаРасшифровкаПлатежа = ПолучитьИзВременногоХранилища(АдресРасшифровкаПлатежаВХранилище);
	Если Очищать Тогда
		Объект.РасшифровкаПлатежа.Очистить();
	КонецЕсли;
	Для каждого СтрокаРасшифровкаПлатежа Из ТаблицаРасшифровкаПлатежа Цикл
		Строка = Объект.РасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаРасшифровкаПлатежа);
		Если НЕ Строка.Договор.Пустая() Тогда
			Если НЕ ПустойРеквизитСтатьяВДокументах Тогда 
				Строка.СтатьяДДС = Строка.Договор.СтатьяДДСПоУмолчанию;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПолучитьРасшифровкаПлатежаИзХранилища()

&НаСервере
Процедура ПересчитатьСуммыДокумента(Курс, Кратность, ПересчитатьСуммуПлатежа, ДополнительныеПараметры)
	
	Для каждого СтрокаТабличнойЧасти Из Объект.РасшифровкаПлатежа Цикл
		Если СтрокаТабличнойЧасти.Договор.ВалютаРасчетов = Объект.ВалютаДенежныхСредств Тогда
			Если ПересчитатьСуммуПлатежа Тогда
				СтрокаТабличнойЧасти.СуммаПлатежа = СтрокаТабличнойЧасти.СуммаРасчетов;
				СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса, СтрокаТабличнойЧасти.СуммаПлатежа, 0);
				РассчитатьСуммуНДСНаСервере(СтрокаТабличнойЧасти);
			Иначе
				СтрокаТабличнойЧасти.СуммаРасчетов = СтрокаТабличнойЧасти.СуммаПлатежа;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Если ПересчитатьСуммуПлатежа Тогда
			СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
				СтрокаТабличнойЧасти.СуммаРасчетов,
				СтрокаТабличнойЧасти.Курс,
				Курс,
				СтрокаТабличнойЧасти.Кратность,
				Кратность
			);
			СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса, СтрокаТабличнойЧасти.СуммаПлатежа, 0);
			РассчитатьСуммуНДСНаСервере(СтрокаТабличнойЧасти);
		Иначе
			СтрокаТабличнойЧасти.Курс = ?(
				СтрокаТабличнойЧасти.Курс = 0,
				1,
				СтрокаТабличнойЧасти.Курс
			);
			СтрокаТабличнойЧасти.Кратность = ?(
				СтрокаТабличнойЧасти.Кратность = 0,
				1,
				СтрокаТабличнойЧасти.Кратность
			);
			СтрокаТабличнойЧасти.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
				СтрокаТабличнойЧасти.СуммаПлатежа,
				Курс,
				СтрокаТабличнойЧасти.Курс,
				Кратность,
				СтрокаТабличнойЧасти.Кратность
			);
		КонецЕсли;
	КонецЦикла;
	
	// Если нужно, то пересчитаем суммы в ТЧ ДоговорыАвтоЗачетаДолгов.
	Если ПересчитатьСуммуПлатежа И Объект.ВидОперации = ВидОперацииОтПокупателя И Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиАвтоматически Тогда
		Для каждого СтрокаТабличнойЧасти Из Объект.ДоговорыАвтоЗачетаДолгов Цикл
			СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
				СтрокаТабличнойЧасти.СуммаПлатежа,
				ДополнительныеПараметры.КурсПередИзменением,
				Курс,
				ДополнительныеПараметры.КратностьПередИзменением,
				Кратность
			);
		КонецЦикла;
		Объект.СуммаДокумента = Объект.ДоговорыАвтоЗачетаДолгов.Итог("СуммаПлатежа");
	ИначеЕсли ПересчитатьСуммуПлатежа Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	КонецЕсли;
	
	Если Объект.ВидОперации = ВидОперацииОтПокупателя И Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником Тогда
		ЗаполнитьСуммовыеПоказателиТаблицыДолговПоРасшифровкеПлатежа();
	Иначе
		ПересчитатьИтогиПриИзмененииАвансаНаСервере();
	КонецЕсли;
	
КонецПроцедуры // ПересчитатьСуммыДокумента()

&НаКлиенте
Процедура ПересчитатьСуммыПриИзмененииКурсаВалютыДенежныхСредств(СтруктураДанные, ТекстВопроса)
	
	КурсПередИзменением = Курс;
	КратностьПередИзменением = Кратность;
	
	Если ЗначениеЗаполнено(Объект.ВалютаДенежныхСредств) Тогда
		Курс = ?(
			СтруктураДанные.ВалютаКурсКратность.Курс = 0,
			1,
			СтруктураДанные.ВалютаКурсКратность.Курс
		);
		Кратность = ?(
			СтруктураДанные.ВалютаКурсКратность.Кратность = 0,
			1,
			СтруктураДанные.ВалютаКурсКратность.Кратность
		);
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПокупкаВалюты") Тогда
			Объект.Курс = Курс;
			Объект.Кратность = Кратность;
		КонецЕсли;
	КонецЕсли;
	
	// Если курс валюты не изменился или не заполнена валюта денежных средств
	// или документ не заполнен, то ничего не делаем.
	Если (Курс = КурсПередИзменением
		И Кратность = КратностьПередИзменением)
	 ИЛИ (НЕ ЗначениеЗаполнено(Объект.ВалютаДенежныхСредств))
	 ИЛИ (Объект.РасшифровкаПлатежа.Итог("СуммаРасчетов") = 0
	 И НЕ ЗначениеЗаполнено(Объект.СуммаДокумента)) Тогда
		
		// Обновить курсы расчетов
		// Если в расшифровке платежа есть курс <> 1, то предложим его перезаполнить.
		Если НЕ (Объект.ВидОперации = ВидОперацииОтПокупателя И Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиАвтоматически) И
			СтруктураДанные.Свойство("ОбновитьКурсыРасчетов") И СтруктураДанные.ОбновитьКурсыРасчетов Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбновитьКурсВРасшифровкеПлатежаИПересчитатьСуммы", ЭтотОбъект), СтруктураДанные.ОбновитьКурсыРасчетовТекстВопроса, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		// Конец Обновить курсы расчетов
		
		Возврат;
	КонецЕсли;
	
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КурсПередИзменением", КурсПередИзменением);
	ДополнительныеПараметры.Вставить("КратностьПередИзменением", КратностьПередИзменением);
	
	// Обновить курсы расчетов
	Если СтруктураДанные.Свойство("ОбновитьКурсыРасчетов") Тогда
		ДополнительныеПараметры.Вставить("ОбновитьКурсыРасчетов", СтруктураДанные.ОбновитьКурсыРасчетов);
		ДополнительныеПараметры.Вставить("ОбновитьКурсыРасчетовТекстВопроса", СтруктураДанные.ОбновитьКурсыРасчетовТекстВопроса);
	КонецЕсли;
	// Конец Обновить курсы расчетов
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОпределитьНеобходимостьПересчетаСуммПриИзмененииКурса", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры // ПересчитатьСуммыПриИзмененииКурсаВалютыДенежныхСредств()

&НаКлиенте
Процедура РассчитатьСуммуПлатежаНаКлиенте(СтрокаТабличнойЧасти, ИмяКолонки = "")
	
	СтруктураДанные = ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении(
			Объект.Дата,
			СтрокаТабличнойЧасти.Договор
		);
		
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		?(СтруктураДанные.ДоговорВалютаКурсКратность.Курс =0, 1, СтруктураДанные.ДоговорВалютаКурсКратность.Курс),
		СтрокаТабличнойЧасти.Курс
	);
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
	);
	
	Если СтрокаТабличнойЧасти.СуммаРасчетов = 0 Тогда
		СтрокаТабличнойЧасти.СуммаПлатежа = 0;
		СтрокаТабличнойЧасти.Курс = СтруктураДанные.ДоговорВалютаКурсКратность.Курс;
	ИначеЕсли Объект.ВалютаДенежныхСредств = СтруктураДанные.ВалютаРасчетов Тогда
		СтрокаТабличнойЧасти.СуммаПлатежа = СтрокаТабличнойЧасти.СуммаРасчетов;
	ИначеЕсли СтрокаТабличнойЧасти.СуммаПлатежа = 0 ИЛИ
		(ИмяКолонки = "Курс" ИЛИ ИмяКолонки = "Кратность") Тогда
		Если СтрокаТабличнойЧасти.Курс = 0 Тогда
			СтрокаТабличнойЧасти.СуммаПлатежа = 0;
		Иначе
			СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
				СтрокаТабличнойЧасти.СуммаРасчетов,
				СтрокаТабличнойЧасти.Курс,
				Курс,
				СтрокаТабличнойЧасти.Кратность,
				Кратность
			);
		КонецЕсли;
	Иначе
		СтрокаТабличнойЧасти.Курс = ?(
			СтрокаТабличнойЧасти.СуммаРасчетов = 0 ИЛИ СтрокаТабличнойЧасти.СуммаПлатежа = 0,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс, //СтрокаТабличнойЧасти.Курс,
			СтрокаТабличнойЧасти.СуммаПлатежа / СтрокаТабличнойЧасти.СуммаРасчетов * Курс
		);
		СтрокаТабличнойЧасти.Кратность = ?(
			СтрокаТабличнойЧасти.СуммаРасчетов = 0 ИЛИ СтрокаТабличнойЧасти.СуммаПлатежа = 0,
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность,
			СтрокаТабличнойЧасти.Кратность
		);
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса, СтрокаТабличнойЧасти.СуммаПлатежа, 0);
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
		СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
	РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
	ПересчитатьИтогиПриИзмененииАвансаНаКлиенте();
	
КонецПроцедуры // РассчитатьСуммуПлатежаНаКлиенте()

&НаСервере
Процедура РассчитатьСуммуПлатежаНаСервере(СтрокаТабличнойЧасти, ИмяКолонки = "")
	
	СтруктураДанные = ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении(
			Объект.Дата,
			СтрокаТабличнойЧасти.Договор
		);
		
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		?(СтруктураДанные.ДоговорВалютаКурсКратность.Курс =0, 1, СтруктураДанные.ДоговорВалютаКурсКратность.Курс),
		СтрокаТабличнойЧасти.Курс
	);
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
	);
	
	Если СтрокаТабличнойЧасти.СуммаРасчетов = 0 Тогда
		СтрокаТабличнойЧасти.СуммаПлатежа = 0;
		СтрокаТабличнойЧасти.Курс = СтруктураДанные.ДоговорВалютаКурсКратность.Курс;
	ИначеЕсли Объект.ВалютаДенежныхСредств = СтруктураДанные.ВалютаРасчетов Тогда
		СтрокаТабличнойЧасти.СуммаПлатежа = СтрокаТабличнойЧасти.СуммаРасчетов;
	ИначеЕсли СтрокаТабличнойЧасти.СуммаПлатежа = 0 ИЛИ
		(ИмяКолонки = "Курс" ИЛИ ИмяКолонки = "Кратность") Тогда
		Если СтрокаТабличнойЧасти.Курс = 0 Тогда
			СтрокаТабличнойЧасти.СуммаПлатежа = 0;
		Иначе
			СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
				СтрокаТабличнойЧасти.СуммаРасчетов,
				СтрокаТабличнойЧасти.Курс,
				Курс,
				СтрокаТабличнойЧасти.Кратность,
				Кратность
			);
		КонецЕсли;
	Иначе
		СтрокаТабличнойЧасти.Курс = ?(
			СтрокаТабличнойЧасти.СуммаРасчетов = 0 ИЛИ СтрокаТабличнойЧасти.СуммаПлатежа = 0,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс, //СтрокаТабличнойЧасти.Курс,
			СтрокаТабличнойЧасти.СуммаПлатежа / СтрокаТабличнойЧасти.СуммаРасчетов * Курс
		);
		СтрокаТабличнойЧасти.Кратность = ?(
			СтрокаТабличнойЧасти.СуммаРасчетов = 0 ИЛИ СтрокаТабличнойЧасти.СуммаПлатежа = 0,
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность,
			СтрокаТабличнойЧасти.Кратность
		);
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Аванс = ?(СтрокаТабличнойЧасти.ПризнакАванса, СтрокаТабличнойЧасти.СуммаПлатежа, 0);
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
		СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
	РассчитатьСуммуНДСНаСервере(СтрокаТабличнойЧасти);
	ПересчитатьИтогиПриИзмененииАвансаНаСервере();
	
КонецПроцедуры // РассчитатьСуммуПлатежаНаСервере()

&НаКлиенте
Процедура РассчитатьСуммуУчета()
	
	Объект.Курс = ?(
		Объект.Курс = 0,
		1,
		Объект.Курс
	);
	Объект.Кратность = ?(
		Объект.Кратность = 0,
		1,
		Объект.Кратность
	);
	
	Объект.СуммаУчета = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		Объект.СуммаДокумента,
		Объект.Курс,
		КурсВалютыУчета,
		Объект.Кратность,
		КратностьВалютыУчета
	);
	
КонецПроцедуры // РассчитатьСуммуУчета()

&НаКлиенте
Процедура РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаПлатежа - (СтрокаТабличнойЧасти.СуммаПлатежа) / ((СтавкаНДС + 100) / 100);
	
КонецПроцедуры // РассчитатьСуммуНДСНаКлиенте()

&НаСервере
Процедура РассчитатьСуммуНДСНаСервере(СтрокаТабличнойЧасти)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаПлатежа - (СтрокаТабличнойЧасти.СуммаПлатежа) / ((СтавкаНДС + 100) / 100);
	
КонецПроцедуры // РассчитатьСуммуНДС()

&НаСервереБезКонтекста
Функция ПолучитьДанныеДокументаПланированияПриИзменении(ДокументПланирования)
	
	СтруктураДанных = Новый Структура("СтатьяДДС", Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеДСПлан.СтатьяДвиженияДенежныхСредств
		|ИЗ
		|	Документ.ПоступлениеДСПлан КАК ПоступлениеДСПлан
		|ГДЕ
		|	ПоступлениеДСПлан.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументПланирования);
	
	Если ТипЗнч(ДокументПланирования) = Тип("ДокументСсылка.ПеремещениеДСПлан") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПоступлениеДСПлан КАК ПоступлениеДСПлан", "Документ.ПеремещениеДСПлан КАК ПоступлениеДСПлан");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураДанных.Вставить("СтатьяДДС", Выборка.СтатьяДвиженияДенежныхСредств);
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеКонтрагентПриИзменении(Контрагент, Организация, Дата)
	
	ДоговорПоУмолчанию = ПолучитьДоговорПоУмолчанию(Объект.Ссылка, Контрагент, Организация, Объект.ВидОперации);
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"Договор",
		ДоговорПоУмолчанию
	);
	
	СтруктураДанные.Вставить(
		"ДоговорВалютаКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
			Дата,
			Новый Структура("Валюта", ДоговорПоУмолчанию.ВалютаРасчетов)
		)
	);
	
	СтруктураДанные.Вставить(
		"ВестиРасчетыПоДоговорам",
		Контрагент.ВестиРасчетыПоДоговорам
	);
	
	СтруктураДанные.Вставить(
		"ВестиРасчетыПоДокументам",
		Контрагент.ВестиРасчетыПоДокументам
	);
	
	СтруктураДанные.Вставить(
		"ВестиРасчетыПоЗаказам",
		Контрагент.ВестиРасчетыПоЗаказам
	);
	
	СтруктураДанные.Вставить(
		"ВестиУчетОплатыПоСчетам",
		Контрагент.ВестиУчетОплатыПоСчетам
	);
	
	// Прочие расчеты
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам Тогда
		ДоговорКредитаЗаймаПоУмолчанию = ПолучитьДоговорКредитаЗаймаПоУмолчанию(Объект.Ссылка, Контрагент, Организация, Объект.ВидОперации);
		СтруктураДанные.Вставить(
			"ДоговорКредитаЗаймаПоУмолчанию",
			ДоговорКредитаЗаймаПоУмолчанию
		);
	КонецЕсли;
	// Конец Прочие расчеты
	
	УстановитьВидимостьРеквизитовРасчетов();
	
	Если Объект.ВидОперации = ВидОперацииОтПокупателя И Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником Тогда
		ЗаполнитьДолги(Истина);
	КонецЕсли;
	
	СтруктураДанные.Вставить("СтатьяДДСПоУмолчанию", Контрагент.СтатьяДДСПоУмолчанию);
	Если ЗначениеЗаполнено(Контрагент.СтатьяДДСПоУмолчанию) Тогда
		СтруктураДанные.Вставить("УчитыватьВНУ", СтатьяУчитываетсяВНУ(Контрагент.СтатьяДДСПоУмолчанию, Организация, Дата));
	Иначе
		СтруктураДанных = ПолучитьДанныеСтатьиДДС();
		СтруктураДанные.Вставить("СтатьяДДСПоУмолчанию", СтруктураДанных.Статья);
		СтруктураДанные.Вставить("УчитыватьВНУ", СтруктураДанных.УчитыватьВНУ);
	КонецЕсли;
	
	//+++ Дмгг
	СтруктураДанные.Вставить("Проект", СтруктураДанные.Договор.Проект);
	//--- Дмгг
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеКонтрагентПриИзменении()

&НаСервере
Процедура УстановитьВидимостьРеквизитовРасчетов()
	
	КонтрагентВестиРасчетыПоДоговорам = Объект.Контрагент.ВестиРасчетыПоДоговорам;
	
	Элементы.РасшифровкаПлатежаДоговор.Видимость = КонтрагентВестиРасчетыПоДоговорам;
	Элементы.ГруппаДоговоров.Видимость = КонтрагентВестиРасчетыПоДоговорам;
	Элементы.РасшифровкаПлатежаДокумент.Видимость = Объект.Контрагент.ВестиРасчетыПоДокументам;
	Элементы.РасшифровкаПлатежаЗаказ.Видимость = Объект.Контрагент.ВестиРасчетыПоЗаказам;
	Элементы.РасшифровкаПлатежаСчетНаОплату.Видимость = Объект.Контрагент.ВестиУчетОплатыПоСчетам;
	
	// Прочие расчеты
	Элементы.РасшифровкаПлатежаПрочиеРасчетыДоговор.Видимость = КонтрагентВестиРасчетыПоДоговорам;
	// Конец Прочие расчеты
	
	// Помощник зачета долгов
	Элементы.ТаблицаДолговДокумент.Видимость = Объект.Контрагент.ВестиРасчетыПоДокументам;
	Элементы.ТаблицаДолговГруппаСуммаДокумента.Видимость = Объект.Контрагент.ВестиРасчетыПоДокументам;
	Элементы.ТаблицаДолговЗаказ.Видимость = Объект.Контрагент.ВестиРасчетыПоЗаказам И Объект.Контрагент.ВестиРасчетыПоДокументам;
	Элементы.ТаблицаДолговЗаказКогдаНетУчетаПоДокументам.Видимость = Объект.Контрагент.ВестиРасчетыПоЗаказам И НЕ Объект.Контрагент.ВестиРасчетыПоДокументам;
	Элементы.ТаблицаДолговГруппаСуммаЗаказа.Видимость = Объект.Контрагент.ВестиРасчетыПоЗаказам;
	Элементы.ТаблицаДолговСчетНаОплату.Видимость = Объект.Контрагент.ВестиУчетОплатыПоСчетам;
	Элементы.ТаблицаДолговГруппаСуммаСчета.Видимость = Объект.Контрагент.ВестиУчетОплатыПоСчетам;
	Элементы.ТаблицаДолговДоговор.Видимость = КонтрагентВестиРасчетыПоДоговорам;
	Элементы.ДоговорДляЗачетаАвансаСПомощником.Видимость = КонтрагентВестиРасчетыПоДоговорам;
	// Когда только по договорам, то сделаем ширину поля с договором больше.
	Если НЕ Объект.Контрагент.ВестиРасчетыПоЗаказам И НЕ Объект.Контрагент.ВестиРасчетыПоДокументам И
		КонтрагентВестиРасчетыПоДоговорам Тогда
		Элементы.ТаблицаДолговДоговор.Ширина = 25 + Элементы.ТаблицаДолговДокумент.Ширина;
	Иначе
		Элементы.ТаблицаДолговДоговор.Ширина = 25;
	КонецЕсли;
	// Конец Помощник зачета долгов
	
	Элементы.РасшифровкаПлатежаДоговорВалютаРасчетовСимвольноеПредставление.Видимость = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	
	Элементы.ДоговорСАгентом.Видимость = КонтрагентВестиРасчетыПоДоговорам;
	
КонецПроцедуры // УстановитьВидимостьРеквизитовРасчетов()

//+++ Дмгг
&НаСервере
Процедура УстановитьВидимостьПроекта()
	
	ВидимостиПроекта = ВидОперации <> Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя
						И ВидОперации <> Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика;
						
	Элементы.Проект.Видимость = ВидимостиПроекта И ИспользоватьПроекты;
	
КонецПроцедуры // УстановитьВидимостьРеквизитовРасчетов()
//--- ДМгг

&НаСервере
Функция ПолучитьДанныеБанковскийСчетПриИзменении(Дата, БанковскийСчет, СчетКонтрагента)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"ВалютаКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
			Дата,
			Новый Структура("Валюта", БанковскийСчет.ВалютаДенежныхСредств)
		)
	);
	СтруктураДанные.Вставить(
		"ВалютаДенежныхСредств",
		БанковскийСчет.ВалютаДенежныхСредств
	);
	
	СтруктураДанные.Вставить(
		"СчетКонтрагента",
		?(ЗначениеЗаполнено(СчетКонтрагента) И СчетКонтрагента.ВалютаДенежныхСредств = БанковскийСчет.ВалютаДенежныхСредств, СчетКонтрагента, Неопределено)
	);
	
	СтруктураДанные.Вставить(
		"СчетЭквайринговогоТерминала",
		?(ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал), Объект.ЭквайринговыйТерминал.БанковскийСчетЭквайринг, Неопределено)
	);
	
	ОбновитьВидимостьИОстаткиДС();
	
	УстановитьЗаголовкиКолонокТабличныхЧастей(СтруктураДанные.ВалютаДенежныхСредств);
	ОбновитьДолгиВПомощникеЗачетаДолгов(СтруктураДанные);
	
	УстановитьВидимостьКурсаВалюты(БанковскийСчет.ВалютаДенежныхСредств);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеБанковскийСчетПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении(Дата, Договор, ДокументПланирования = Неопределено, СтатьяДДС = Неопределено)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"ДоговорВалютаКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
			Дата,
			Новый Структура("Валюта", Договор.ВалютаРасчетов)
		)
	);
	СтруктураДанные.Вставить("ВалютаРасчетов", Договор.ВалютаРасчетов);
	// Статья в заявке на расход (РасходДСПЛан) приоритетнее.
	Если ЗначениеЗаполнено(ДокументПланирования) Тогда
		СтруктураДанные.Вставить("СтатьяДДСПоУмолчанию", СтатьяДДС);
	Иначе
		СтруктураДанные.Вставить("СтатьяДДСПоУмолчанию",
			?(ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов"),
			Договор.СтатьяДДСПоУмолчанию,
			Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка()));
	КонецЕсли;
	
	//+++ Дмгг
	Если ЗначениеЗаполнено(Договор) И ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда 
		СтруктураДанные.Вставить("Проект", Договор.Проект);
	КонецЕсли;
	//--- Дмгг
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьСтатьюДДСПоУмолчаниюДляСтрокиРасшифровки(Договор, ДокументПланирования = Неопределено, СтатьяДДС = Неопределено)
	
	// Статья в заявке на расход (РасходДСПЛан) приоритетнее.
	Если ЗначениеЗаполнено(ДокументПланирования) Тогда
		Возврат СтатьяДДС;
	ИначеЕсли ЗначениеЗаполнено(Договор) Тогда
		Возврат Договор.СтатьяДДСПоУмолчанию;
	Иначе
		Возврат Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции // ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении()

&НаСервере
Процедура УстановитьСтатьиДДСВРасшифровкеПлатежа();
	
	Для Каждого ТекущаяСтрока Из Объект.РасшифровкаПлатежа Цикл
		Если Объект.ВидОперации <> Перечисления.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам Тогда
			Если НЕ ПустойРеквизитСтатьяВДокументах Тогда 
				ТекущаяСтрока.СтатьяДДС = ПолучитьСтатьюДДСПоУмолчаниюДляСтрокиРасшифровки(ТекущаяСтрока.Договор,
					ТекущаяСтрока.ДокументПланирования,
					ТекущаяСтрока.СтатьяДДС);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДатаПриИзменении(ДатаПередИзменением)
	
	РазностьДат = УправлениеНебольшойФирмойСервер.ПроверитьНомерДокумента(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
	ВалютаКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаДенежныхСредств));
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"РазностьДат",
		РазностьДат
	);
	СтруктураДанные.Вставить(
		"ВалютаКурсКратность",
		ВалютаКурсКратность
	);
	
	ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

&НаСервере
Функция ПолучитьДанныеОрганизацияПриИзменении()
	
	БанковскийСчетПоУмолчанию = ПолучитьБанковскийСчетПоУмолчанию(Объект.Организация);
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"Компания",
		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация)
	);
	СтруктураДанные.Вставить(
		"БанковскийСчет",
		БанковскийСчетПоУмолчанию
	);
	СтруктураДанные.Вставить(
		"ВалютаКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
			Объект.Дата,
			Новый Структура("Валюта", БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств)
		)
	);
	СтруктураДанные.Вставить(
		"ВалютаДенежныхСредств",
		БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств
	);
	СтруктураДанные.Вставить(
		"СчетКонтрагента",
		?(ЗначениеЗаполнено(Объект.СчетКонтрагента) И СтруктураДанные.БанковскийСчет.ВалютаДенежныхСредств = Объект.СчетКонтрагента.ВалютаДенежныхСредств, Объект.СчетКонтрагента, Справочники.БанковскиеСчета.ПустаяСсылка())
	);
	
	ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
	
	ОбновитьВидимостьИОстаткиДС(СтруктураДанные.БанковскийСчет);
	
	УстановитьЗаголовкиКолонокТабличныхЧастей(СтруктураДанные.ВалютаДенежныхСредств);
	ОбновитьДолгиВПомощникеЗачетаДолгов(СтруктураДанные);
	
	УстановитьВидимостьКурсаВалюты(СтруктураДанные.БанковскийСчет.ВалютаДенежныхСредств);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеОрганизацияПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеСчетаНаОплатуПриИзменении(СчетНаОплату)

	СтруктураВозврат = Новый Структура("Сумма, Валюта", 0, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплату.СуммаДокумента,
		|	СчетНаОплату.ВалютаДокумента
		|ИЗ
		|	Документ.СчетНаОплату КАК СчетНаОплату
		|ГДЕ
		|	СчетНаОплату.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СчетНаОплату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураВозврат.Вставить("Сумма", ВыборкаДетальныеЗаписи.СуммаДокумента);
		СтруктураВозврат.Вставить("Валюта", УправлениеНебольшойФирмойПовтИсп.ПолучитьСимвольноеПредставлениеВалюты(ВыборкаДетальныеЗаписи.ВалютаДокумента));
	КонецЕсли;
	
	Возврат СтруктураВозврат;
	
КонецФункции // ПолучитьДанныеСчетаНаОплатуПриИзменении()

&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	
	УстановитьСвязиПараметровВыбораДоступныеТипы();
	
	// Прочие расчеты
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты 
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВзносНаличными
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПереводСДругогоСчета Тогда
		СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
		СтавкаНДСПоУмолчаниюЧисло = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтавкаНДСПоУмолчанию);
		Объект.РасшифровкаПлатежа[0].СтавкаНДС = СтавкаНДСПоУмолчанию;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником Тогда
		СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
		СтавкаНДСПоУмолчаниюЧисло = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтавкаНДСПоУмолчанию);
	// Конец Прочие расчеты
	Иначе
		ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты Тогда
		Если Не ИспользоватьТолькоРегламентированногоПланаСчетов Тогда
			Объект.Корреспонденция = ПланыСчетов.Управленческий.РасчетыСРазнымиКредиторами;
		КонецЕсли;
		Объект.КорреспонденцияРегл = ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками;
	КонецЕсли;
	
	УстановитьВидимостьЭлементовВЗависимостиОтВидаОперации();
	УстановитьСтатьюДДСПриСменеВидаОперации();
	
КонецПроцедуры // ВидОперацииПриИзмененииНаСервере()

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоУмолчанию()
	
	Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		СтавкаНДСПоУмолчанию = Объект.Организация.СтавкаНДСПоУмолчанию;
	ИначеЕсли Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
		СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
	Иначе
		СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
	КонецЕсли;
	СтавкаНДСПоУмолчаниюЧисло = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтавкаНДСПоУмолчанию);
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоУмолчанию()

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС()
	
	НалогообложениеПередИзменением = Объект.НалогообложениеНДС;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя Тогда
		
		Объект.НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Объект.Организация,, Объект.Дата);
		
	Иначе
		
		Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		
	КонецЕсли;
	
	Если НЕ (Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Прочее
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПокупкаВалюты)
	   И НЕ НалогообложениеПередИзменением = Объект.НалогообложениеНДС Тогда
		
		ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
		
	Иначе
		
		ЗаполнитьСтавкуНДСПоУмолчанию();
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоНалогообложениеНДС()

&НаСервере
Процедура УстановитьВидимостьДокументыПланирования()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика
		ИЛИ НЕ ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь") Тогда
		Элементы.ДокументыПланирования.Видимость = Ложь;
	// Эквайринг
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам Тогда
		Если ПолучитьФункциональнуюОпцию("РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям") 
			ИЛИ НЕ ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь") Тогда
			Элементы.ДокументыПланирования.Видимость = Ложь;
		Иначе
			Элементы.ДокументыПланирования.Видимость = Истина;
		КонецЕсли;
	// Прочие расчеты
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником Тогда
		Элементы.ДокументыПланирования.Видимость = Ложь;
	Иначе
		Элементы.ДокументыПланирования.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьНалогообложениеНДС()

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоНалогообложениеНДС(ВосстанавливатьСтавкиНДС = Истина)
	
	ЗаполнитьСтавкуНДСПоУмолчанию();
	
	Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя
		 ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика Тогда
			
			Элементы.РасшифровкаПлатежаСтавкаНДС.Видимость = Истина;
			Элементы.РасшифровкаПлатежаСуммаНДС.Видимость = Истина;
			Элементы.СуммаНДС.Видимость = Истина;
			
		КонецЕсли;
		
		СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтавкаНДСПоУмолчанию);
		
		Если ВосстанавливатьСтавкиНДС Тогда
			Для каждого СтрокаТабличнойЧасти Из Объект.РасшифровкаПлатежа Цикл
				СтрокаТабличнойЧасти.СтавкаНДС = Объект.Организация.СтавкаНДСПоУмолчанию;
				СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.СуммаПлатежа - (СтрокаТабличнойЧасти.СуммаПлатежа) / ((СтавкаНДС + 100) / 100);
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя
		 ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика Тогда
			
			Элементы.РасшифровкаПлатежаСтавкаНДС.Видимость = Ложь;
			Элементы.РасшифровкаПлатежаСуммаНДС.Видимость = Ложь;
			Элементы.СуммаНДС.Видимость = Ложь;
			
		КонецЕсли;
		
		Если ВосстанавливатьСтавкиНДС Тогда
			Для каждого СтрокаТабличнойЧасти Из Объект.РасшифровкаПлатежа Цикл
				СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
				СтрокаТабличнойЧасти.СуммаНДС = 0;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьВидимостьДокументыПланирования();
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоНалогообложениеНДС()

&НаСервере
Процедура УстановитьВидимостьНалогообложениеНДС()
	
	Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя
		 ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика Тогда
			
			Элементы.РасшифровкаПлатежаСтавкаНДС.Видимость = Истина;
			Элементы.РасшифровкаПлатежаСуммаНДС.Видимость = Истина;
			
		КонецЕсли;
		
		СтавкаНДСПоУмолчанию = Объект.Организация.СтавкаНДСПоУмолчанию;
		
	Иначе
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя
		 ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика Тогда
			
			Элементы.РасшифровкаПлатежаСтавкаНДС.Видимость = Ложь;
			Элементы.РасшифровкаПлатежаСуммаНДС.Видимость = Ложь;
			
		КонецЕсли;
		
		Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда	
			СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
		Иначе
			СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
		КонецЕсли;
		
	КонецЕсли;
	СтавкаНДСПоУмолчаниюЧисло = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтавкаНДСПоУмолчанию);
	
КонецПроцедуры // УстановитьВидимостьНалогообложениеНДС()

&НаСервере
Процедура УстановитьВидиомостьНадписиСчетФактура(НоваяВидимость)
	
	Элементы.СчетФактураНадпись.Видимость = НоваяВидимость;
	Элементы.СчетФактураНадписьАвто.Видимость = НоваяВидимость;
	Элементы.СчетФактураНадписьВручную.Видимость = НоваяВидимость;
	Элементы.СчетФактураНадписьСПомощником.Видимость = НоваяВидимость;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовВЗависимостиОтВидаОперации(ПриСозданииНаСервере = Ложь)
	
	Элементы.РасшифровкаПлатежаСуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	Элементы.РасшифровкаПлатежаПрочиеРасчетыСуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	Элементы.РасшифровкаПлатежаРасчетыПоКредитамСуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	
	Элементы.Подвал.Видимость = Истина;
	Элементы.СтраницыРасчетовСКонтрагентомПодвал.Видимость = Ложь;
	
	Элементы.РасчетыСКонтрагентом.Видимость = Ложь;
	Элементы.РасчетыСПодотчетником.Видимость = Ложь;
	Элементы.ПокупкаВалюты.Видимость = Ложь;
	Элементы.РасчетыПрочие.Видимость = Ложь;
	Элементы.РасчетыПоНалогам.Видимость = Ложь;
	Элементы.ДокументыПланирования.Видимость = Ложь;
	
	Элементы.ГруппаКонтрагент.Видимость = Ложь;
	Элементы.Подотчетник.Видимость = Ложь;
	Элементы.СчетКонтрагента.Видимость = Ложь;
	УстановитьВидиомостьНадписиСчетФактура(Ложь);
	Элементы.НалогообложениеНДС.Видимость = Ложь;
	
	// Эквайринг
	Элементы.РасчетыПоЭквайрингу.Видимость = Ложь;
	Элементы.ЭквайринговыйТерминал.Видимость = Ложь;
	Элементы.СуммаПлатежаЭквайринг.Видимость = Ложь;
	Элементы.СуммаКомиссииДокумента.Видимость = Ложь;
	Элементы.СуммаДокумента.Заголовок = НСТР("ka='თანხა';ru='Сумма';en='Сумма'");
	// Конец Эквайринг
	// Прочие расчеты
	Элементы.РасчетыПоКредитам.Видимость = Ложь;
	Элементы.РасчетыПоКредитам.Заголовок = НСТР("ka='ანგარიშსწორება კრედიტების მიხედვით';ru='Расчеты по кредитам';en='loan calculations'");
	Элементы.ДоговорЗаймаСотруднику.Видимость = Ложь;
	Элементы.ЗаполнитьПоДоговоруЗайма.Видимость = Ложь;
	Элементы.ДоговорКредита.Видимость = Ложь;
	Элементы.ЗаполнитьПоДоговоруКредита.Видимость = Ложь;
	Элементы.ГруппаИнформацияПоДоговору.Видимость = Ложь;
	Элементы.Сотрудник.Видимость = Ложь;
	Элементы.СуммаКомиссииЭквайринг.Видимость = Ложь;
	// Конец Прочие расчеты
	
	// Курьерские компании и почта
	Элементы.ГруппаДоговорРасчетыСПочтой.Видимость = Ложь;
	Элементы.СуммаПлатежаАгент.Видимость = Ложь;
	Элементы.СуммаУдержаноАгентом.Видимость = Ложь;
	Элементы.ОбработкаМенеджерПодсказок_РасчетыСКурьерскойКомпанией.Видимость = Ложь;
	Элементы.РасчетыСАгентом.Видимость = Ложь;
	Элементы.СтавкаНДСРасчетыСАгентом.Видимость = Ложь;
	Элементы.СуммаНДСРасчетыСАгентом.Видимость = Ложь;
	
	Элементы.СуммаДокумента.КнопкаВыпадающегоСписка = Ложь;
	Элементы.СчетПлательщика.Видимость = Ложь;
	Элементы.Касса.Видимость = Ложь;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя") Тогда
		
		Элементы.РасчетыСКонтрагентом.Видимость = Истина;
		Элементы.РасшифровкаПлатежаПодбор.Видимость = Истина;
		Элементы.РасшифровкаПлатежаЗаполнитьРасшифровку.Видимость = Истина;
		
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.Контрагент.Заголовок = НСТР("ka='მყიდველი';ru='Покупатель';en='Customer'");
		Элементы.СчетКонтрагента.Видимость = Истина;
		
		УстановитьВидиомостьНадписиСчетФактура(Истина);
		Элементы.НалогообложениеНДС.Видимость = Истина;
		
		НовыйМассив = Новый Массив();
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.Контрагент");
		НовыйМассив.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.РасшифровкаПлатежаСчетНаОплату.СвязиПараметровВыбора = НовыеСвязи;
		
		Элементы.СуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
		Элементы.СуммаПлатежа.Заголовок = НСтр("ka='გავრცელებიულია';ru='Разнесено';en='spaced'");
		Элементы.СуммаРасчетов.Видимость = НЕ ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
		
		Элементы.СуммаРазнесеноВручную.Видимость = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
		Элементы.СуммаРасчетовРазнесеноВручную.Видимость = НЕ Элементы.СуммаРазнесеноВручную.Видимость;
		
		Элементы.СуммаНДС.Видимость = Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		
		// Подвал
		Элементы.Подвал.Видимость = Ложь;
		Элементы.СтраницыРасчетовСКонтрагентомПодвал.Видимость = Истина;
		Элементы.СуммаРазнесеноВручную.Заголовок = НСТР("ka='სულ გადანაწილებულია ხელით';ru='Итого разнесено вручную';en='Total spaced manually'");
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПоставщика") Тогда
		
		Элементы.РасчетыСКонтрагентом.Видимость = Истина;
		Элементы.РасшифровкаПлатежаПодбор.Видимость = Ложь;
		Элементы.РасшифровкаПлатежаЗаполнитьРасшифровку.Видимость = Ложь;
		
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.Контрагент.Заголовок = НСТР("ka='მომწოდებელი';ru='Поставщик';en='Supplier'");
		Элементы.СчетКонтрагента.Видимость = Истина;
		УстановитьВидиомостьНадписиСчетФактура(Истина);
		Элементы.НалогообложениеНДС.Видимость = Истина;
		
		НовыйМассив = Новый Массив();
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.Контрагент");
		НовыйМассив.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.РасшифровкаПлатежаСчетНаОплату.СвязиПараметровВыбора = НовыеСвязи;
		
		Элементы.СуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
		Элементы.СуммаПлатежа.Заголовок = НСтр("ka='გადახდის თანხა';ru='Сумма платежа';en='Amount of Payment'");
		Элементы.СуммаРасчетов.Видимость = НЕ ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
		
		Элементы.СуммаРазнесеноВручную.Видимость = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
		Элементы.СуммаРасчетовРазнесеноВручную.Видимость = НЕ Элементы.СуммаРазнесеноВручную.Видимость;
		
		Элементы.СуммаНДС.Видимость = Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		
		Элементы.СтраницыРасчетовСКонтрагентом.ТекущаяСтраница = Элементы.СтраницаРучноеЗаполнение;
		Элементы.РасчетыСКонтрагентом.Заголовок = НСТР("ka='დავალიანებების ჩათვლა';ru='Зачет долгов';en='Set-off of debts'");
		
		// Подвал
		Элементы.Подвал.Видимость = Ложь;
		Элементы.СтраницыРасчетовСКонтрагентомПодвал.Видимость = Истина;
		Элементы.СуммаРазнесеноВручную.Заголовок = НСТР("ka='სულ გადანაწილებულია';ru='Итого разнесено';en='Total spaced'");
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника") Тогда
		
		Элементы.РасчетыСПодотчетником.Видимость = Истина;
		Элементы.Подотчетник.Видимость = Истина;
		
		Элементы.СуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь");
		Элементы.СуммаПлатежа.Заголовок = ?(ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"), НСтр("ka='თანხა (გეგმ.)';ru='Сумма (план)';en='Amount (plan)'"), НСтр("ka='გადახდის თანხა';ru='Сумма платежа';en='Amount of Payment'"));
		Элементы.СуммаПлатежаВалюта.Видимость = Элементы.СуммаПлатежа.Видимость;
		Элементы.СуммаРасчетов.Видимость = Ложь;
		Элементы.СуммаНДС.Видимость = Ложь;
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПокупкаВалюты") Тогда
		
		Элементы.ПокупкаВалюты.Видимость = Истина;
		
		Элементы.СуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь");
		Элементы.СуммаПлатежа.Заголовок = ?(ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"), НСтр("ka='თანხა (გეგმ.)';ru='Сумма (план)';en='Amount (plan)'"), НСтр("ka='გადახდის თანხა';ru='Сумма платежа';en='Amount of Payment'"));
		Элементы.СуммаПлатежаВалюта.Видимость = Элементы.СуммаПлатежа.Видимость;
		Элементы.СуммаРасчетов.Видимость = Ложь;
		Элементы.СуммаНДС.Видимость = Ложь;
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.Налоги") Тогда
		
		Элементы.РасчетыПоНалогам.Видимость = Истина;
		
		Элементы.СуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь");
		Элементы.СуммаПлатежа.Заголовок = ?(ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"), НСтр("ka='თანხა (გეგმ.)';ru='Сумма (план)';en='Amount (plan)'"), НСтр("ka='გადახდის თანხა';ru='Сумма платежа';en='Amount of Payment'"));
		Элементы.СуммаПлатежаВалюта.Видимость = Элементы.СуммаПлатежа.Видимость;
		Элементы.СуммаРасчетов.Видимость = Ложь;
		Элементы.СуммаНДС.Видимость = Ложь;
		
	// Эквайринг
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам") Тогда
		
		//Элементы.ОснованиеЗаполнить.Видимость = Ложь;
		Элементы.РасчетыСКонтрагентом.Видимость = Ложь;
		
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.Контрагент.Заголовок = НСТР("ka='ბანკი-ეკვაირერი';ru='Банк-эквайрер';en='The acquirer'");
		Элементы.СчетКонтрагента.Видимость = Истина;
		
		Элементы.ЭквайринговыйТерминал.Видимость = Истина;
		
		Элементы.НалогообложениеНДС.Видимость = Истина;
		
		Элементы.РасчетыПоЭквайрингу.Видимость = Истина;
		Элементы.СуммаКомиссииЭквайринг.Видимость = Истина;
		
		Если ПолучитьФункциональнуюОпцию("РазноситьОплатуОтЭквайрераПоЭквайринговымОперациям") Тогда
			Элементы.СуммаПлатежа.Видимость = Ложь;
			Элементы.СуммаРасчетов.Видимость = Ложь;
			Элементы.СуммаНДС.Видимость = Ложь;
			Элементы.СуммаПлатежаЭквайринг.Видимость = Истина;
			Если НЕ ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций") Тогда
				Элементы.СуммаПлатежаЭквайринг.Заголовок = НСТР("ka='ანგარიშსწორების თანხა';ru='Сумма расчетов';en='The amount of payments'");
			Иначе
				Элементы.СуммаПлатежаЭквайринг.Заголовок = НСТР("ka='გადახდის თანხა';ru='Сумма платежа';en='Amount of Payment'");
			КонецЕсли;
			
			Элементы.ЭквайринговыеОперации.Видимость = Истина;
			Элементы.ЭквайринговыеОперацииЗаполнитьЭквайринговыеОперацииСВыборомПериода.Видимость = Истина;
			Элементы.СуммаДокумента.Заголовок = НСТР("ka='თანხა/საკომისიო';ru='Сумма/комиссия';en='Sum / Commission'");
			Элементы.СуммаКомиссииДокумента.Видимость = Истина;
			
			Элементы.ЭквайринговыеОперацииСуммаРасчетовКомиссииВозврата.Видимость = Объект.ЭквайринговыйТерминал.ЭквайрерБеретКомиссиюЗаВозвратДС;
		Иначе
			Элементы.СуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь");
			Элементы.СуммаПлатежа.Заголовок = ?(ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"), НСтр("ka='თანხა (გეგმ.)';ru='Сумма (план)';en='Amount (plan)'"), НСтр("ka='გადახდის თანხა';ru='Сумма платежа';en='Amount of Payment'"));
			Элементы.СуммаРасчетов.Видимость = Ложь;
			Элементы.СуммаНДС.Видимость = Ложь;
			Элементы.СуммаПлатежаЭквайринг.Видимость = Ложь;
			
			Элементы.ЭквайринговыеОперации.Видимость = Ложь;
			Элементы.ЭквайринговыеОперацииЗаполнитьЭквайринговыеОперацииСВыборомПериода.Видимость = Ложь;
			Элементы.СуммаДокумента.Заголовок = НСТР("ka='თანხა/საკომისიო';ru='Сумма/комиссия';en='Sum / Commission'");
			Элементы.СуммаКомиссииДокумента.Видимость = Истина;
		КонецЕсли;
		
		Элементы.РасчетыСКонтрагентом.Видимость = Ложь;
		
		Если ТипСчетаЗатратШапка = Перечисления.ТипыСчетов.Расходы Тогда
			Элементы.ПодразделениеЗатраты.Видимость = Истина;
			Элементы.НаправлениеДеятельностиЗатраты.Видимость = Истина;
		Иначе
			Элементы.ПодразделениеЗатраты.Видимость = Ложь;
			Элементы.НаправлениеДеятельностиЗатраты.Видимость = Ложь;
		КонецЕсли;
		
	// Конец Эквайринг
	// Прочие расчеты
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.Прочее") Тогда
		
		Элементы.РасчетыПрочие.Видимость = Истина;
		
		Элементы.СуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь");
		Элементы.СуммаПлатежа.Заголовок = ?(ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"), НСтр("ka='თანხა (გეგმ.)';ru='Сумма (план)';en='Amount (plan)'"), НСтр("ka='გადახდის თანხა';ru='Сумма платежа';en='Amount of Payment'"));
		Элементы.СуммаПлатежаВалюта.Видимость = Элементы.СуммаПлатежа.Видимость;
		Элементы.СуммаРасчетов.Видимость = Ложь;
		Элементы.СуммаНДС.Видимость = Ложь;
		Элементы.РасчетыСПодотчетникомРасшифровкаПлатежаСуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь");
		
		Элементы.РасшифровкаПлатежаПрочиеРасчеты.Видимость = Ложь;
		//+++ Дмгг
		Если ИспользоватьТолькоРегламентированногоПланаСчетов Тогда 
			УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденцииРегл(Ложь);
		Иначе
			УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденции(Ложь);
		КонецЕсли;
		//--- Дмгг
		
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты") Тогда
		
		Элементы.РасчетыПрочие.Видимость = Истина;
		
		Элементы.СуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
		Элементы.СуммаПлатежа.Заголовок = НСтр("ka='გადახდის თანხა';ru='Сумма платежа';en='Amount of Payment'");
		Элементы.СуммаРасчетов.Видимость = НЕ ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
		Элементы.СуммаНДС.Видимость = Ложь;
		Элементы.РасчетыСПодотчетникомРасшифровкаПлатежаСуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь");
		
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.Контрагент.Заголовок = "Контрагент";
		Элементы.РасшифровкаПлатежаПрочиеРасчеты.Видимость = Истина;
		Элементы.РасшифровкаПлатежаПрочиеРасчетыДоговор.Видимость = Объект.Контрагент.ВестиРасчетыПоДоговорам;
		//+++ Дмгг
		Если ИспользоватьТолькоРегламентированногоПланаСчетов Тогда 
			УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденцииРегл(Ложь);
		Иначе
			УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденции(Ложь);
		КонецЕсли;
		//--- Дмгг
		
		Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
			Идентификатор = Объект.РасшифровкаПлатежа[0].ПолучитьИдентификатор();
			Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущаяСтрока = Идентификатор;
		КонецЕсли;
		
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам") Тогда
		
		Элементы.РасчетыПоКредитам.Видимость = Истина;
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.Контрагент.Заголовок = НСтр("ka='ბანკი';ru='Банк';en='Bank'");
		Элементы.РасчетыПоКредитам.Видимость = Истина;
		Элементы.РасшифровкаПлатежаРасчетыПоКредитам.Видимость = Ложь;
		
		//Элементы.ОснованиеЗаполнить.Видимость = Ложь;
		
		Элементы.ДоговорКредита.Видимость = Истина;
		Элементы.ЗаполнитьПоДоговоруКредита.Видимость = Истина;
		Элементы.ВалютаДенежныхСредств.Доступность = Ложь;
		
		ЗаполнитьИнформациюПоКредитуЗаймуНаСервере();
		
		Элементы.ГруппаИнформацияПоДоговору.Видимость = Истина;
		
		Элементы.СуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь");
		Элементы.СуммаПлатежа.Заголовок = НСтр("ka='გადახდის თანხა';ru='Сумма платежа';en='Amount of Payment'");
		Элементы.СуммаПлатежаВалюта.Видимость = Элементы.СуммаПлатежа.Видимость;
		Элементы.СуммаРасчетов.Видимость = Ложь;
		Элементы.СуммаНДС.Видимость = Ложь;
		Элементы.РасчетыСПодотчетникомРасшифровкаПлатежаСуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь");
		
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником") Тогда
		
		Элементы.Сотрудник.Видимость = Истина;
		Элементы.РасчетыПоКредитам.Заголовок = НСтр("ka='ანგარიშსწორება სესხის მიხედვით';ru='Расчеты по займам';en='Borrowing calculations'");
		Элементы.РасчетыПоКредитам.Видимость = Истина;
		Элементы.НалогообложениеНДС.Видимость = Истина;
		Элементы.РасшифровкаПлатежаРасчетыПоКредитам.Видимость = Истина;
		
		//Элементы.ОснованиеЗаполнить.Видимость = Ложь;
		
		Элементы.ДоговорЗаймаСотруднику.Видимость = Истина;
		Элементы.ЗаполнитьПоДоговоруЗайма.Видимость = Истина;
		Элементы.ВалютаДенежныхСредств.Доступность = Ложь;
		
		ЗаполнитьИнформациюПоКредитуЗаймуНаСервере();
		
		Элементы.ГруппаИнформацияПоДоговору.Видимость = Истина;
		
		Элементы.СуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
		Элементы.СуммаПлатежа.Заголовок = НСтр("ka='გადახდის თანხა';ru='Сумма платежа';en='Amount of Payment'");
		Элементы.СуммаРасчетов.Видимость = Истина;
		Элементы.СуммаНДС.Видимость = Ложь;
		Элементы.РасчетыСПодотчетникомРасшифровкаПлатежаСуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь");
		
	// Конец Прочие расчеты
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВзносНаличными") Тогда
		
		Элементы.СуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь");
		Элементы.СуммаПлатежа.Заголовок = ?(ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"), НСтр("ka='თანხა (გეგმ.)';ru='Сумма (план)';en='Amount (plan)'"), НСтр("ka='გადახდის თანხა';ru='Сумма платежа';en='Amount of Payment'"));
		Элементы.СуммаПлатежаВалюта.Видимость = Элементы.СуммаПлатежа.Видимость;
		Элементы.СуммаРасчетов.Видимость = Ложь;
		Элементы.СуммаНДС.Видимость = Ложь;
		Элементы.Касса.Видимость = Истина;
		
		Элементы.РасшифровкаПлатежаПрочиеРасчеты.Видимость = Ложь;
		
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПереводСДругогоСчета") Тогда
		
		Элементы.СчетПлательщика.Видимость = Истина;
		
		Элементы.СуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь");
		Элементы.СуммаПлатежа.Заголовок = ?(ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"), НСтр("ka='თანხა (გეგმ.)';ru='Сумма (план)';en='Amount (plan)'"), НСтр("ka='გადახდის თანხა';ru='Сумма платежа';en='Amount of Payment'"));
		Элементы.СуммаПлатежаВалюта.Видимость = Элементы.СуммаПлатежа.Видимость;
		Элементы.СуммаРасчетов.Видимость = Ложь;
		Элементы.СуммаНДС.Видимость = Ложь;
		
		Элементы.РасшифровкаПлатежаПрочиеРасчеты.Видимость = Ложь;
		
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты") Тогда
		
		Элементы.ГруппаДоговорРасчетыСПочтой.Видимость = Истина;
		
		Элементы.РасчетыСАгентом.Видимость = Истина;
		
		// Итоговые суммы
		Элементы.СуммаПлатежа.Видимость = Ложь;
		Элементы.СуммаРасчетов.Видимость = Ложь;
		Элементы.СуммаПлатежаАгент.Видимость = Истина;
		Элементы.СуммаУдержаноАгентом.Видимость = Истина;
		Элементы.СуммаНДС.Видимость = Ложь;
		
		Элементы.ОбработкаМенеджерПодсказок_РасчетыСКурьерскойКомпанией.Видимость = Истина;
		
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.Контрагент.Заголовок = НСтр("ka='კონტრაგენტი';ru='Контрагент';en='Counterparty'");
		
		Элементы.ДоговорСАгентом.Видимость = Объект.Контрагент.ВестиРасчетыПоДоговорам;
		Элементы.ДоговорСАгентом.Заголовок = ?(ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций"), НСтр("ka='Договор (руб.)';ru='Договор (руб.)';en='Treaty (rub.)'"), НСтр("ka='ხელშეკრულება';ru='Договор';en='Agreement'"));
		
		//+++ Дмгг
		Если ИспользоватьТолькоРегламентированногоПланаСчетов Тогда 
			УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденцииРегл(Ложь, "АналитикаПрочихДоходовИРасходовРасчетыСПочтой");
		Иначе
			УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденции(Ложь, "АналитикаПрочихДоходовИРасходовРасчетыСПочтой");
		КонецЕсли;
		//--- Дмгг
		
		Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
			Идентификатор = Объект.РасшифровкаПлатежа[0].ПолучитьИдентификатор();
			//Элементы.РасшифровкаПлатежаРасчетыСПочтой.ТекущаяСтрока = Идентификатор;
		КонецЕсли;
		
		Элементы.СуммаДокумента.КнопкаВыпадающегоСписка = Истина;
		
		// НДС
		Элементы.СтавкаНДСРасчетыСАгентом.Видимость = Истина;
		Элементы.СуммаНДСРасчетыСАгентом.Видимость = Истина;
		
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратДенегОтСотрудника") Тогда
		
		УстановитьВидимостьДляОперацииВозвартДенегОтСотрудника(Истина);
		
	Иначе
		
		Элементы.РасчетыПрочие.Видимость = Истина;
		
		Элементы.СуммаПлатежа.Видимость = ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь");
		Элементы.СуммаПлатежа.Заголовок = ?(ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"), НСтр("ka='თანხა (გეგმ.)';ru='Сумма (план)';en='Amount (plan)'"), НСтр("ka='გადახდის თანხა';ru='Сумма платежа';en='Amount of Payment'"));
		Элементы.СуммаПлатежаВалюта.Видимость = Элементы.СуммаПлатежа.Видимость;
		Элементы.СуммаРасчетов.Видимость = Ложь;
		Элементы.СуммаНДС.Видимость = Ложь;
		
	КонецЕсли;
	
	УстановитьВидимостьДокументыПланирования();
	НастроитьЭлементыРаспределенияДолговНаСервере(ПриСозданииНаСервере);
	
	ОпределитьВидимостьНастроекУчетаВНалогообложении();
КонецПроцедуры // УстановитьВидимостьЭлементовВЗависимостиОтВидаОперации()

&НаКлиенте
Процедура ОбработатьИзменениеДоговораКонтрагента(СтрокаТабличнойЧасти = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
		СтруктураДанные = ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении(
			Объект.Дата,
			СтрокаТабличнойЧасти.Договор,
			СтрокаТабличнойЧасти.ДокументПланирования,
			СтрокаТабличнойЧасти.СтатьяДДС
		);
		СтрокаТабличнойЧасти.Курс = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс
		);
		СтрокаТабличнойЧасти.Кратность = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность
		);
		
		Если НЕ ПустойРеквизитСтатьяВДокументах Тогда 
			СтрокаТабличнойЧасти.СтатьяДДС = СтруктураДанные.СтатьяДДСПоУмолчанию;
		КонецЕсли;
		
		//+++ Дмгг
		СтрокаТабличнойЧасти.Проект = СтруктураДанные.Проект;
		//--- Дмгг
		
	Иначе
		Если НЕ ПустойРеквизитСтатьяВДокументах Тогда 
			СтрокаТабличнойЧасти.СтатьяДДС = ПолучитьСтатьюДДСПоУмолчаниюДляСтрокиРасшифровки(СтрокаТабличнойЧасти.Договор,
				СтрокаТабличнойЧасти.ДокументПланирования,
				СтрокаТабличнойЧасти.СтатьяДДС);
		КонецЕсли;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.СуммаРасчетов = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаПлатежа,
		Курс,
		СтрокаТабличнойЧасти.Курс,
		Кратность,
		СтрокаТабличнойЧасти.Кратность
	);
	
КонецПроцедуры // ОбработатьИзменениеДоговораКонтрагента()

&НаСервере
Процедура ОбновитьКурсыРасчетовРасшифровкиПлатежаНаСервере()
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.РасшифровкаПлатежа Цикл
			
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
			СтруктураДанные = ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении(
				Объект.Дата,
				СтрокаТабличнойЧасти.Договор
			);
			СтрокаТабличнойЧасти.Курс = ?(
				СтруктураДанные.ДоговорВалютаКурсКратность.Курс = 0,
				1,
				СтруктураДанные.ДоговорВалютаКурсКратность.Курс
			);
			СтрокаТабличнойЧасти.Кратность = ?(
				СтруктураДанные.ДоговорВалютаКурсКратность.Кратность = 0,
				1,
				СтруктураДанные.ДоговорВалютаКурсКратность.Кратность
			);
		КонецЕсли;
		
		СтрокаТабличнойЧасти.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
			СтрокаТабличнойЧасти.СуммаПлатежа,
			Курс,
			СтрокаТабличнойЧасти.Курс,
			Кратность,
			СтрокаТабличнойЧасти.Кратность
		);
		
	КонецЦикла;
	
	Если Объект.ВидОперации = ВидОперацииОтПокупателя И Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником Тогда
		ЗаполнитьСуммовыеПоказателиТаблицыДолговПоРасшифровкеПлатежа();
	ИначеЕсли Объект.ВидОперации = ВидОперацииОтПокупателя Тогда
		ПересчитатьИтогиПриИзмененииАвансаНаСервере();
	КонецЕсли;
	
КонецПроцедуры // ОбработатьИзменениеДоговораКонтрагента()

&НаКлиенте
Процедура ОбновитьКурсВРасшифровкеПлатежаИПересчитатьСуммы(КнопкаРезультат, ДополнительныеПараметры) Экспорт

	Если КнопкаРезультат = КодВозвратаДиалога.Да Тогда
		ОбновитьКурсыРасчетовРасшифровкиПлатежаНаСервере();
	КонецЕсли;

КонецПроцедуры // ОбновитьКурсВРасшифровкеПлатежаИПересчитатьСуммыЗавершение()

&НаКлиенте
Процедура ОбработатьНачалоВыбораДоговораКонтрагента(Элемент, СтандартнаяОбработка, Знач ТекущийДоговор = Неопределено)
	
	Если ТекущийДоговор = Неопределено Тогда
		Если Элементы.РасшифровкаПлатежа.ТекущиеДанные = Неопределено Тогда
			Возврат;
		Иначе
			ТекущийДоговор = Элементы.РасшифровкаПлатежа.ТекущиеДанные.Договор;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы = ПолучитьПараметрыФормыВыбора(Объект.Ссылка, Объект.Организация, Объект.Контрагент, ТекущийДоговор, Объект.ВидОперации);
	Если ПараметрыФормы.КонтролироватьВыборДоговора Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработатьИзменениеДоговораКонтрагента()

&НаКлиенте
Процедура ОбработатьВыборДокументаРасчетов(ДанныеДокумента)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТипЗнч(ДанныеДокумента) = Тип("Структура") Тогда
		
		СтрокаТабличнойЧасти.Документ = ДанныеДокумента.Документ;
		СтрокаТабличнойЧасти.Заказ = ДанныеДокумента.Заказ;
		СтрокаТабличнойЧасти.СчетНаОплату = ДанныеДокумента.СчетНаОплату;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
			СтрокаТабличнойЧасти.Договор = ДанныеДокумента.Договор;
			ОбработатьИзменениеДоговораКонтрагента(СтрокаТабличнойЧасти);
		КонецЕсли;
		
		ВыполнитьДействияПриИзмененииДокументаРасчетов();
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработатьВыборДокументаРасчетов()

&НаКлиенте
Процедура ВыполнитьДействияПриИзмененииДокументаРасчетов()
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПоставщика") Тогда
		
		Если ТипЗнч(СтрокаТабличнойЧасти.Документ) = Тип("ДокументСсылка.РасходИзКассы")
			ИЛИ ТипЗнч(СтрокаТабличнойЧасти.Документ) = Тип("ДокументСсылка.РасходСоСчета")
			ИЛИ ТипЗнч(СтрокаТабличнойЧасти.Документ) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
			
			СтрокаТабличнойЧасти.ПризнакАванса = Истина;
			
		Иначе
			
			СтрокаТабличнойЧасти.ПризнакАванса = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьДействияПриИзмененииДокументаРасчетов()

&НаСервере
Процедура ЗаполнитьРасшифровкуПлатежа(ТекущийОбъект = Неопределено)
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьРасшифровкуПлатежа();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Истина;
	
КонецПроцедуры // ЗаполнитьРасшифровкуПлатежа()

&НаСервереБезКонтекста
Процедура ПроверитьСоответствиеДоговораУсловиямДокумента(Знач ТЧРасшифровкаПлатежа, ТекстСообщения, Документ, Организация, Контрагент, ВидОперации, Отказ, ДоговорКредитаЗайма)
	
	Если Не УправлениеНебольшойФирмойПовтИсп.ТребуетсяКонтрольДоговоровКонтрагентов()
		ИЛИ Не Контрагент.ВестиРасчетыПоДоговорам 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам
		Тогда
		
		Возврат;
	КонецЕсли;
	
	МенеджерСправочника = Справочники.ДоговорыКонтрагентов;
	
	// Прочие расчеты
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам Тогда
		
		СписокВидовДоговора = Новый СписокЗначений;
		СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоровКредитаИЗайма.КредитПолученный);
		
		Если Не МенеджерСправочника.ДоговорСоответствуетУсловиямДокумента(ТекстСообщения, ДоговорКредитаЗайма, Организация, Контрагент, СписокВидовДоговора)
			И Константы.НеПроводитьДокументыСНекорректнымиДоговорами.Получить() Тогда
			
			Отказ = Истина;
			
		КонецЕсли;
		
	Иначе
	// Конец Прочие расчеты
	
		СписокВидовДоговора = МенеджерСправочника.ПолучитьСписокВидовДоговораДляДокумента(Документ, ВидОперации);
		
		Для каждого СтрокаТабличнойЧасти Из ТЧРасшифровкаПлатежа Цикл
			
			Если Не МенеджерСправочника.ДоговорСоответствуетУсловиямДокумента(ТекстСообщения, СтрокаТабличнойЧасти.Договор, Организация, Контрагент, СписокВидовДоговора)
				И Константы.НеПроводитьДокументыСНекорректнымиДоговорами.Получить() Тогда
				
				Отказ = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыФормыВыбора(Документ, Организация, Контрагент, Договор, ВидОперации)
	
	СписокВидовДоговоров = Справочники.ДоговорыКонтрагентов.ПолучитьСписокВидовДоговораДляДокумента(Документ, ВидОперации);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КонтролироватьВыборДоговора", Контрагент.ВестиРасчетыПоДоговорам);
	ПараметрыФормы.Вставить("Контрагент", Контрагент);
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ВидыДоговоров", СписокВидовДоговоров);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Договор);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДоговорПоУмолчанию(Документ, Контрагент, Организация, ВидОперации)
	
	Если Не Контрагент.ВестиРасчетыПоДоговорам Тогда
		Возврат Контрагент.ДоговорПоУмолчанию;
	КонецЕсли;
	
	МенеджерСправочника = Справочники.ДоговорыКонтрагентов;
	
	СписокВидовДоговоров = МенеджерСправочника.ПолучитьСписокВидовДоговораДляДокумента(Документ, ВидОперации);
	ДоговорПоУмолчанию = МенеджерСправочника.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(Контрагент, Организация, СписокВидовДоговоров);
	
	Возврат ДоговорПоУмолчанию;
	
КонецФункции

&НаСервереБезКонтекста
Функция СтатьяУчитываетсяВНУ(Статья, Организация, Дата)
	СистемаНалогообложенияСтруктура = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(Организация, Дата);
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Статья, "УчитыватьВНУ") И СистемаНалогообложенияСтруктура.ПлательщикУСН;
КонецФункции

&НаСервере
Процедура ОбновитьВидимостьИОстаткиВзаиморасчетов()
	
	Элементы.ОстатокВзаиморасчетов.Видимость = НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Контрагент);
	ОстатокВзаиморасчетов = 0;
	
	Если НЕ Элементы.ОстатокВзаиморасчетов.Видимость Тогда
		//Только для новых объектов
		Элементы.Контрагент.АвтоМаксимальнаяШирина = Истина;
	КонецЕсли;
	
	Элементы.Контрагент.АвтоМаксимальнаяШирина = Ложь;
	Элементы.Контрагент.МаксимальнаяШирина = 22;
	Элементы.ОстатокВзаиморасчетов.Заголовок = РаботаСКонтрагентамиУНФ.ЗаголовокНадписиВзаиморасчетов(Объект.Контрагент, ОстатокВзаиморасчетов);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьИОстаткиДС(БанковскийСчет = Неопределено)
	
	Если БанковскийСчет = Неопределено Тогда
		ТекущийБанковскийСчет = Объект.БанковскийСчет;
	Иначе
		ТекущийБанковскийСчет = БанковскийСчет;
	КонецЕсли;
	
	Элементы.ОстатокДенежныхСредств.Видимость = НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(ТекущийБанковскийСчет);
	ОстатокДенежныхСредств = 0;
	
	Если НЕ Элементы.ОстатокДенежныхСредств.Видимость Тогда
		//Только для новых объектов
		Элементы.БанковскийСчет.АвтоМаксимальнаяШирина = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.БанковскийСчет.АвтоМаксимальнаяШирина = Ложь;
	Элементы.БанковскийСчет.МаксимальнаяШирина = 22;
	Элементы.ОстатокДенежныхСредств.Заголовок = ДвиженияДенежныхСредствВызовСервера.ЗаголовокНадписиОстатковДС(ТекущийБанковскийСчет, Объект.Организация, ОстатокДенежныхСредств);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДолги(ПересчитыватьСлужебныеДанные)
	
	// Не будем в табличную часть помещать документы, дата которых больше даты текущего документа.
	Если Объект.Контрагент.Пустая() Тогда
		ТаблицаДолгов.Очистить();
		ОпределитьТекущуюСтраницуПомощника();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
	|	РасчетыСПокупателямиОстатки.Организация КАК Организация,
	|	РасчетыСПокупателямиОстатки.Договор КАК Договор,
	|	РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|	РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток
	|ПОМЕСТИТЬ РасчетыСПокупателямиОстатки
	|ИЗ
	|	РегистрНакопления.РасчетыСПокупателями.Остатки(
	|			,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК РасчетыСПокупателямиОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияДокументаРасчетыСПоставщиками.Контрагент,
	|	ДвиженияДокументаРасчетыСПоставщиками.Организация,
	|	ДвиженияДокументаРасчетыСПоставщиками.Договор,
	|	ДвиженияДокументаРасчетыСПоставщиками.Документ,
	|	ДвиженияДокументаРасчетыСПоставщиками.Заказ,
	|	ВЫБОР
	|		КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|		ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокументаРасчетыСПоставщиками
	|ГДЕ
	|	ДвиженияДокументаРасчетыСПоставщиками.Регистратор = &Ссылка
	|	И ДвиженияДокументаРасчетыСПоставщиками.Организация = &Организация
	|	И ДвиженияДокументаРасчетыСПоставщиками.Контрагент = &Контрагент
	|	И ДвиженияДокументаРасчетыСПоставщиками.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
	|	РасчетыСПокупателямиОстатки.Организация КАК Организация,
	|	РасчетыСПокупателямиОстатки.Договор КАК Договор,
	|	РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|	РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаВалОстаток) КАК ДолгВалДоговора,
	|	РасчетыСПокупателямиОстатки.Документ.Дата КАК ДокументДата,
	|	КурсыВалютРасчетов.Курс КАК Курс,
	|	КурсыВалютРасчетов.Кратность КАК Кратность,
	|	0 КАК Вниз,
	|	""+"" КАК Добавить
	|ПОМЕСТИТЬ ВременнаяТаблицаДолгов
	|ИЗ
	|	РасчетыСПокупателямиОстатки КАК РасчетыСПокупателямиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(КОНЕЦПЕРИОДА(&Период, ДЕНЬ), ) КАК КурсыВалютРасчетов
	|		ПО РасчетыСПокупателямиОстатки.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПокупателямиОстатки.Контрагент,
	|	РасчетыСПокупателямиОстатки.Организация,
	|	РасчетыСПокупателямиОстатки.Договор,
	|	РасчетыСПокупателямиОстатки.Документ,
	|	РасчетыСПокупателямиОстатки.Заказ,
	|	РасчетыСПокупателямиОстатки.Документ.Дата,
	|	КурсыВалютРасчетов.Курс,
	|	КурсыВалютРасчетов.Кратность
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаВалОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетНаОплату.Ссылка) КАК КоличествоСчетов,
	|	СчетНаОплату.ДокументОснование КАК Заказ
	|ПОМЕСТИТЬ ВременнаяТаблицаКолвоСчетовПоЗаказу
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплату
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетыСПокупателямиОстатки КАК РасчетыСПокупателямиОстатки
	|		ПО СчетНаОплату.ДокументОснование = РасчетыСПокупателямиОстатки.Заказ
	|			И (СчетНаОплату.ДокументОснование <> НЕОПРЕДЕЛЕНО)
	|			И (НЕ СчетНаОплату.ДокументОснование ЕСТЬ NULL )
	|			И (СчетНаОплату.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
	|ГДЕ
	|	СчетНаОплату.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетНаОплату.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплату.Ссылка КАК СчетНаОПлату,
	|	СчетНаОплату.ДокументОснование КАК Заказ
	|ПОМЕСТИТЬ ВременнаяТаблицаСчетаНаОплату
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплату
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаКолвоСчетовПоЗаказу КАК ВременнаяТаблицаКолвоСчетовПоЗаказу
	|		ПО СчетНаОплату.ДокументОснование = ВременнаяТаблицаКолвоСчетовПоЗаказу.Заказ
	|			И (ВременнаяТаблицаКолвоСчетовПоЗаказу.КоличествоСчетов = 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаДолгов.Организация,
	|	ВременнаяТаблицаДолгов.Договор КАК Договор,
	|	ВременнаяТаблицаДолгов.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаДолгов.Заказ ЕСТЬ NULL 
	|				ИЛИ ВременнаяТаблицаДолгов.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				ИЛИ ВременнаяТаблицаДолгов.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВременнаяТаблицаДолгов.Заказ
	|	КОНЕЦ КАК Заказ,
	|	ВременнаяТаблицаДолгов.Заказ.Дата КАК ДатаЗаказа,
	|	ВременнаяТаблицаДолгов.ДолгВалДоговора,
	|	ВременнаяТаблицаДолгов.ДокументДата КАК ДатаДокумента,
	|	ВременнаяТаблицаДолгов.Курс,
	|	ВременнаяТаблицаДолгов.Кратность,
	|	ВременнаяТаблицаДолгов.Вниз,
	|	ВременнаяТаблицаДолгов.Добавить,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаДолгов.Документ) = ТИП(Документ.Взаимозачет)
	|			ТОГДА ВременнаяТаблицаДолгов.Документ.СуммаУчета
	|		ИНАЧЕ ВременнаяТаблицаДолгов.Документ.СуммаДокумента
	|	КОНЕЦ КАК СуммаДокумента,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаДолгов.Документ) = ТИП(Документ.РасходИзКассы)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ВременнаяТаблицаДолгов.Документ) = ТИП(Документ.РасходСоСчета)
	|			ТОГДА ВременнаяТаблицаДолгов.Документ.ВалютаДенежныхСредств.СимвольноеПредставление
	|		КОГДА ТИПЗНАЧЕНИЯ(ВременнаяТаблицаДолгов.Документ) = ТИП(Документ.Взаимозачет)
	|			ТОГДА ВалютаУчета.Значение.СимвольноеПредставление
	|		ИНАЧЕ ВременнаяТаблицаДолгов.Документ.ВалютаДокумента.СимвольноеПредставление
	|	КОНЕЦ КАК ВалютаДокумента,
	|	ВременнаяТаблицаДолгов.ДолгВалДоговора * ВременнаяТаблицаДолгов.Курс * КурсыВалютСрезПоследних.Кратность / (ВременнаяТаблицаДолгов.Кратность * КурсыВалютСрезПоследних.Курс) КАК ДолгВалПлатежа,
	|	&СтавкаНДС,
	|	ВременнаяТаблицаДолгов.Заказ.СуммаДокумента КАК СуммаЗаказа,
	|	ВременнаяТаблицаДолгов.Заказ.ВалютаДокумента.СимвольноеПредставление КАК ВалютаЗаказа,
	|	-1 КАК ИдентификаторСтрокиРасшифровкиПлатежа,
	|	ВременнаяТаблицаДолгов.Договор.ВалютаРасчетов.СимвольноеПредставление КАК ВалютаДоговора,
	|	ВременнаяТаблицаДолгов.Договор.ВалютаРасчетов КАК ВалютаДоговораСсылка,
	|	ВременнаяТаблицаДолгов.Курс КАК КурсИсходный,
	|	ВременнаяТаблицаСчетаНаОплату.СчетНаОПлату,
	|	ВременнаяТаблицаСчетаНаОплату.СчетНаОПлату.ВалютаДокумента.СимвольноеПредставление КАК ВалютаСчета,
	|	ВременнаяТаблицаСчетаНаОплату.СчетНаОПлату.СуммаДокумента КАК СуммаСчета,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаДолгов.Контрагент.ВестиРасчетыПоДокументам
	|				И КОНЕЦПЕРИОДА(ВременнаяТаблицаДолгов.ДокументДата, ДЕНЬ) > КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДатаДокБольшеДатыДокумента,
	|	ВЫБОР
	|		КОГДА НЕ ВременнаяТаблицаДолгов.Контрагент.ВестиРасчетыПоДокументам
	|				И ВременнаяТаблицаДолгов.Контрагент.ВестиРасчетыПоЗаказам
	|				И КОНЕЦПЕРИОДА(ВременнаяТаблицаДолгов.Заказ.Дата, ДЕНЬ) > КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДатаЗаказаБольшеДатыДокумента
	|ИЗ
	|	ВременнаяТаблицаДолгов КАК ВременнаяТаблицаДолгов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСчетаНаОплату КАК ВременнаяТаблицаСчетаНаОплату
	|		ПО ВременнаяТаблицаДолгов.Заказ = ВременнаяТаблицаСчетаНаОплату.Заказ,
	|	Константа.ВалютаУчета КАК ВалютаУчета,
	|	РегистрСведений.КурсыВалют.СрезПоследних(КОНЕЦПЕРИОДА(&Период, ДЕНЬ), Валюта = &Валюта) КАК КурсыВалютСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ,
	|	Заказ,
	|	Договор
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Период", ?(Объект.Дата = '00010101', ТекущаяДатаСеанса(), Объект.Дата));
	Запрос.УстановитьПараметр("Валюта", Объект.ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДСПоУмолчанию);
	
	НуженОтборПоДоговорам = УправлениеНебольшойФирмойПовтИсп.ТребуетсяКонтрольДоговоровКонтрагентов();
	Если Объект.Контрагент.ВестиРасчетыПоДоговорам
	   И НуженОтборПоДоговорам Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "// ТекстДоговорОтбор", "И Договор.ВидДоговора В (&СписокВидовДоговоров)");
		Запрос.УстановитьПараметр("СписокВидовДоговоров", Справочники.ДоговорыКонтрагентов.ПолучитьСписокВидовДоговораДляДокумента(Объект.Ссылка, ВидОперации));
	КонецЕсли;
	
	ТЗДолгов = Запрос.Выполнить().Выгрузить();
	ТаблицаДолгов.Загрузить(ТЗДолгов);
	
	Для Каждого ТекущаяСтрока Из ТаблицаДолгов Цикл
		ДолгВалДоговораСтрока = ТекущаяСтрока.ДолгВалДоговора;
		ДолгВалДоговораСтрока = СтрЗаменить(ДолгВалДоговораСтрока, Символы.НПП, "");
		ТекущаяСтрока.ДолгВалДоговораСтрока = ДолгВалДоговораСтрока;
	КонецЦикла;
	
	Если ТаблицаДолгов.Количество() = 0 Тогда
		Элементы.ТаблицаДолгов.Подсказка = ""; //"Долги отсутствуют";
	Иначе
		Элементы.ТаблицаДолгов.Подсказка = "";
	КонецЕсли;
	
	Элементы.ГруппаФильтры.Видимость = ТаблицаДолгов.Количество() > 5;
	Если НЕ Элементы.ГруппаФильтры.Видимость Тогда
		Элементы.ТаблицаДолгов.ОтборСтрок = Неопределено;
	КонецЕсли;
	
	Если ПересчитыватьСлужебныеДанные Тогда
		РаспределитьРасшифровкуПоТаблицеДолгов();
		ПересчитатьИтогиПриИзмененииАвансаНаСервере();
	КонецЕсли;
	
	ОпределитьТекущуюСтраницуПомощника();
	
КонецПроцедуры // ЗаполнитьДолги()

&НаКлиенте
Процедура ПересчитатьИтогиПриИзмененииАвансаНаКлиенте(ОбновитьВидимостьАвансовогоДоговора = Ложь)
	
	СуммаПлатежаАванс = Объект.РасшифровкаПлатежа.Итог("Аванс");
	СуммаПлатежаДляУсловногоОформления = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	СуммаЗачтено = СуммаПлатежаДляУсловногоОформления - СуммаПлатежаАванс;
	СуммаРазнесено = ТаблицаДолгов.Итог("ЗачестьВыбрано") + СуммаПлатежаАванс;
	
	Если ОбновитьВидимостьАвансовогоДоговора Тогда
		НастроитьДоступностьСуммыИДоговораАванса();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтогиПриИзмененииАвансаНаСервере(ОбновитьСтрокуАванса = Ложь)
	
	Если ОбновитьСтрокуАванса Тогда
		ОбновитьСуммаВСтрокеАванса();
	КонецЕсли;
	
	СуммаПлатежаАванс = Объект.РасшифровкаПлатежа.Итог("Аванс");
	СуммаПлатежаДляУсловногоОформления = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	СуммаЗачтено = СуммаПлатежаДляУсловногоОформления - СуммаПлатежаАванс;
	СуммаРазнесено = ТаблицаДолгов.Итог("ЗачестьВыбрано") + СуммаПлатежаАванс;
	
	РассчитатьСуммуНДСПоУмолчаниюНаСервере();
	
	НастроитьДоступностьСуммыИДоговораАванса();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуНДСПоУмолчаниюНаСервере()
	
	ИтогоРазнесено = Объект.ДоговорыАвтоЗачетаДолгов.Итог("СуммаПлатежа");
	//СуммаНДСПоУмолчанию = Объект.СуммаДокумента - (Объект.СуммаДокумента) / ((СтавкаНДСПоУмолчаниюЧисло + 100) / 100);
	СуммаНДСПоУмолчанию = ИтогоРазнесено - (ИтогоРазнесено) / ((СтавкаНДСПоУмолчаниюЧисло + 100) / 100);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуНДСПоУмолчаниюНаКлиенте()
	
	ИтогоРазнесено = Объект.ДоговорыАвтоЗачетаДолгов.Итог("СуммаПлатежа");
	СуммаНДСПоУмолчанию = ИтогоРазнесено - (ИтогоРазнесено) / ((СтавкаНДСПоУмолчаниюЧисло + 100) / 100);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьСуммыИДоговораАванса()
	
	ДоступностьПредыдущееЗначение = Элементы.ГруппаСПомощникомИтогиАванс.Доступность;
	Элементы.ГруппаСПомощникомИтогиАванс.Доступность = Не (СуммаПлатежаАванс = 0);
	// Возможно, что фокус ушел из таблицы долгов.
	Если ДоступностьПредыдущееЗначение <> Элементы.ГруппаСПомощникомИтогиАванс.Доступность Тогда
		ТекущийЭлемент = Элементы.ТаблицаДолгов;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммовыеПоказателиТаблицыДолговПоРасшифровкеПлатежа()

	Для Каждого ТекущаяСтрокаДолгов Из ТаблицаДолгов Цикл
		ТекущаяСтрокаРасшифровки = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ТекущаяСтрокаДолгов.ИдентификаторСтрокиРасшифровкиПлатежа);
		Если ТекущаяСтрокаРасшифровки <> Неопределено Тогда
			ТекущаяСтрокаДолгов.СуммаРасчетов = ТекущаяСтрокаРасшифровки.СуммаРасчетов;
			ТекущаяСтрокаДолгов.Курс = ТекущаяСтрокаРасшифровки.Курс;
			ТекущаяСтрокаДолгов.Кратность = ТекущаяСтрокаРасшифровки.Кратность;
			ТекущаяСтрокаДолгов.Зачесть = ТекущаяСтрокаРасшифровки.СуммаПлатежа;
			ТекущаяСтрокаДолгов.ЗачестьВыбрано = ?(ТекущаяСтрокаДолгов.Выбран, ТекущаяСтрокаДолгов.Зачесть, 0);
		КонецЕсли;
	КонецЦикла;

	СуммаЗачтено = ТаблицаДолгов.Итог("ЗачестьВыбрано");
	ПересчитатьИтогиПриИзмененииАвансаНаСервере();
	
	Если Объект.ВидОперации = ВидОперацииОтПокупателя И Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником Тогда
		ОбновитьДолгиВПомощникеЗачетаДолгов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьНеобходимостьПересчетаСуммПриИзмененииКурса(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = КодВозвратаДиалога.Да Тогда
		
		КурсПередИзменением = ДополнительныеПараметры.КурсПередИзменением;
		КратностьПередИзменением = ДополнительныеПараметры.КратностьПередИзменением;
		
		Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
			
			Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя")
				ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПоставщика") Тогда
				
				ПересчитатьСуммыДокумента(Курс, Кратность, Истина, ДополнительныеПараметры);
				
			// Прочие расчеты
			ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты")
				ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты")
				ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником") Тогда
				
				ПересчитатьСуммыДокумента(Курс, Кратность, Истина, ДополнительныеПараметры);
				
			// Конец Прочие расчеты
			Иначе
				
				СуммаДокументаРавнаИтогуСуммыПлатежа = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа") = Объект.СуммаДокумента;
				
				Для каждого СтрокаТабличнойЧасти Из Объект.РасшифровкаПлатежа Цикл // для видов операций с планируемыми платежами пересчитываем сумму плана.
					
					СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
						СтрокаТабличнойЧасти.СуммаПлатежа,
						КурсПередИзменением,
						Курс,
						КратностьПередИзменением,
						Кратность
					);
					
					РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
				КонецЦикла;
					
				Если СуммаДокументаРавнаИтогуСуммыПлатежа Тогда
					
					Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
					
				Иначе
					
					Объект.СуммаДокумента = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
						Объект.СуммаДокумента,
						КурсПередИзменением,
						Курс,
						КратностьПередИзменением,
						Кратность
					);
					
				КонецЕсли;
				
				ПересчитатьИтогиПриИзмененииАвансаНаКлиенте();
				
			КонецЕсли;
			
		Иначе
			
			Объект.СуммаДокумента = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
				Объект.СуммаДокумента,
				КурсПередИзменением,
				Курс,
				КратностьПередИзменением,
				Кратность
			);
			
		КонецЕсли;
		
	Иначе
		
		Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
			
			ПересчитатьСуммыДокумента(Курс, Кратность, Ложь, ДополнительныеПараметры);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПокупкаВалюты") Тогда
		
		РассчитатьСуммуУчета();
		
	КонецЕсли;
	
	// Обновить курсы расчетов
	Если НЕ (Объект.ВидОперации = ВидОперацииОтПокупателя И Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиАвтоматически) Тогда
		Если ДополнительныеПараметры.Свойство("ОбновитьКурсыРасчетов")  И ДополнительныеПараметры.ОбновитьКурсыРасчетов Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбновитьКурсВРасшифровкеПлатежаИПересчитатьСуммы", ЭтотОбъект),
				ДополнительныеПараметры.ОбновитьКурсыРасчетовТекстВопроса,
				РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
	// Конец Обновить курсы расчетов
	
КонецПроцедуры // ОпределитьНеобходимостьПересчетаСуммПриИзмененииКурса()

&НаКлиенте
Процедура ОпределитьНеобходимостьЗаполненияПодчиненногоСчетФактуры(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = КодВозвратаДиалога.Да Тогда
		
		УправлениеНебольшойФирмойСервер.ИзменитьПодчиненнуюСчетФактуру(Объект.Ссылка);
		Оповестить("ОбновитьДокументИБПослеЗаполнения");
		
	КонецЕсли;
	
КонецПроцедуры // ОпределитьНеобходимостьЗаполненияПодчиненногоСчетФактуры()

&НаСервереБезКонтекста
Функция ПолучитьПараметрыФормыВыбораДоговора(Документ, Организация, Контрагент, Договор, ВидОперации)
	
	СписокВидовДоговоров = Справочники.ДоговорыКонтрагентов.ПолучитьСписокВидовДоговораДляДокумента(Документ, ВидОперации);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КонтролироватьВыборДоговора", Контрагент.ВестиРасчетыПоДоговорам);
	ПараметрыФормы.Вставить("Контрагент", Контрагент);
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ВидыДоговоров", СписокВидовДоговоров);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Договор);
	
	Возврат ПараметрыФормы;
	
КонецФункции

#КонецОбласти

#Область УправлениеВнешнимВидомФормы

&НаКлиенте
Процедура УстановитьТекущуюСтраницу()
	
	КоличествоСтрок = Объект.РасшифровкаПлатежа.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		Объект.РасшифровкаПлатежа.Добавить();
		Объект.РасшифровкаПлатежа[0].СуммаПлатежа = Объект.СуммаДокумента;
		КоличествоСтрок = 1;
	КонецЕсли;
	
КонецПроцедуры // УстановитьТекущуюСтраницу()

&НаКлиенте
Процедура ОчиститьРеквизитыНеОтносящиесяКОперации()
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПоставщика") Тогда
		Объект.Корреспонденция = Неопределено;
		Объект.КорреспонденцияРегл = Неопределено; //+++ Дмгг
		Объект.ВидНалога = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.СуммаУчета = 0;
		Объект.Курс = 0;
		Объект.Кратность = 0;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Для каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТаблицы.Заказ = Неопределено;
			СтрокаТаблицы.Документ = Неопределено;
			СтрокаТаблицы.ПризнакАванса = Ложь;
		КонецЦикла;
		Объект.ЭквайринговыеОперации.Очистить();
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника") Тогда
		Объект.Корреспонденция = Неопределено;
		Объект.КорреспонденцияРегл = Неопределено; //+++ Дмгг
		Объект.ВидНалога = Неопределено;
		Объект.Контрагент = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.СуммаУчета = 0;
		Объект.Курс = 0;
		Объект.Кратность = 0;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Для каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТаблицы.Договор = Неопределено;
			СтрокаТаблицы.ПризнакАванса = Ложь;
			СтрокаТаблицы.Документ = Неопределено;
			СтрокаТаблицы.Заказ = Неопределено;
			СтрокаТаблицы.СчетНаОплату = Неопределено;
		КонецЦикла;
		Объект.ЭквайринговыеОперации.Очистить();
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.Прочее") 
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВзносНаличными")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПереводСДругогоСчета") Тогда
		Объект.Контрагент = Неопределено;
		Объект.ВидНалога = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.СуммаУчета = 0;
		Объект.Курс = 0;
		Объект.Кратность = 0;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Объект.ДоговорДляЗачетаАвансаСПомощником = Неопределено; //+++ Дмгг
		Для каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТаблицы.Договор = Неопределено;
			СтрокаТаблицы.ПризнакАванса = Ложь;
			СтрокаТаблицы.Документ = Неопределено;
			СтрокаТаблицы.Заказ = Неопределено;
			СтрокаТаблицы.СчетНаОплату = Неопределено;
			СтрокаТаблицы.СтавкаНДС = Неопределено;
			СтрокаТаблицы.СуммаНДС = Неопределено;
			СтрокаТаблицы.СуммаНДС = Неопределено;
		КонецЦикла;
		Объект.ЭквайринговыеОперации.Очистить();
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПокупкаВалюты") Тогда
		Объект.Контрагент = Неопределено;
		Объект.ВидНалога = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Объект.Курс = ?(ЗначениеЗаполнено(Курс),
			Курс,
			1
		);
		Объект.Кратность = ?(ЗначениеЗаполнено(Кратность),
			Кратность, 1
		);
		Для каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТаблицы.Договор = Неопределено;
			СтрокаТаблицы.ПризнакАванса = Ложь;
			СтрокаТаблицы.Документ = Неопределено;
			СтрокаТаблицы.Заказ = Неопределено;
			СтрокаТаблицы.СчетНаОплату = Неопределено;
			СтрокаТаблицы.СтавкаНДС = Неопределено;
			СтрокаТаблицы.СуммаНДС = Неопределено;
		КонецЦикла;
		РассчитатьСуммуУчета();
		Объект.ЭквайринговыеОперации.Очистить();
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.Налоги") Тогда
		Объект.Контрагент = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.Корреспонденция = Неопределено;
		Объект.КорреспонденцияРегл = Неопределено; //+++ Дмгг
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Если НЕ ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов Тогда
			Объект.НаправлениеДеятельности = Неопределено;
		КонецЕсли;
		Для каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТаблицы.Договор = Неопределено;
			СтрокаТаблицы.ПризнакАванса = Ложь;
			СтрокаТаблицы.Документ = Неопределено;
			СтрокаТаблицы.Заказ = Неопределено;
			СтрокаТаблицы.СчетНаОплату = Неопределено;
			СтрокаТаблицы.СтавкаНДС = Неопределено;
			СтрокаТаблицы.СуммаНДС = Неопределено;
		КонецЦикла;
		Объект.ЭквайринговыеОперации.Очистить();
	// Эквайринг
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам") Тогда
		Объект.Корреспонденция = Неопределено;
		Объект.КорреспонденцияРегл = Неопределено; //+++ Дмгг
		Объект.ВидНалога = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.СуммаУчета = 0;
		Объект.Курс = 0;
		Объект.Кратность = 0;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Для каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТаблицы.Заказ = Неопределено;
			СтрокаТаблицы.Документ = Неопределено;
			СтрокаТаблицы.ПризнакАванса = Ложь;
			СтрокаТаблицы.СтатьяДДС = Неопределено;
		КонецЦикла;
	// Конец Эквайринг
	// Прочие расчеты
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам") Тогда
		Объект.Корреспонденция = Неопределено;
		Объект.КорреспонденцияРегл = Неопределено; //+++ Дмгг
		Объект.Контрагент = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.НаправлениеДеятельности = Неопределено;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Объект.СуммаУчета = 0;
		Объект.Курс = 0;
		Объект.Кратность = 0;
		Для каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТаблицы.Договор = Неопределено;
			СтрокаТаблицы.ПризнакАванса = Ложь;
			СтрокаТаблицы.Документ = Неопределено;
			СтрокаТаблицы.Заказ = Неопределено;
			СтрокаТаблицы.СчетНаОплату = Неопределено;
			СтрокаТаблицы.СтавкаНДС = Неопределено;
			СтрокаТаблицы.СуммаНДС = Неопределено;
		КонецЦикла;
		Объект.ЭквайринговыеОперации.Очистить();
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником") Тогда
		Объект.Корреспонденция = Неопределено;
		Объект.КорреспонденцияРегл = Неопределено;//+++ Дмгг
		Объект.Контрагент = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.НаправлениеДеятельности = Неопределено;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Объект.СуммаУчета = 0;
		Объект.Курс = 0;
		Объект.Кратность = 0;
		Для каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			СтрокаТаблицы.Договор = Неопределено;
			СтрокаТаблицы.ПризнакАванса = Ложь;
			СтрокаТаблицы.Документ = Неопределено;
			СтрокаТаблицы.Заказ = Неопределено;
			СтрокаТаблицы.СчетНаОплату = Неопределено;
			СтрокаТаблицы.СтавкаНДС = Неопределено;
			СтрокаТаблицы.СуммаНДС = Неопределено;
			//СтрокаТаблицы.СтатьяДДС = Неопределено;
		КонецЦикла;
		Объект.ЭквайринговыеОперации.Очистить();
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты") Тогда
		Объект.Корреспонденция = Неопределено;
		Объект.КорреспонденцияРегл = Неопределено;//+++ Дмгг
		Объект.Контрагент = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.НаправлениеДеятельности = Неопределено;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Объект.СуммаУчета = 0;
		Объект.Курс = 0;
		Объект.Кратность = 0;
		Объект.РасшифровкаПлатежа.Очистить();
		Объект.РасшифровкаПлатежа.Добавить();
		Объект.РасшифровкаПлатежа[0].СуммаПлатежа = Объект.СуммаДокумента;
		Объект.ЭквайринговыеОперации.Очистить();
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты") Тогда
		Объект.Корреспонденция = Неопределено;
		Объект.КорреспонденцияРегл = Неопределено;//+++ Дмгг
		Объект.Контрагент = Неопределено;
		Объект.СчетКонтрагента = Неопределено;
		Объект.Подотчетник = Неопределено;
		Объект.Документ = Неопределено;
		Объект.НаправлениеДеятельности = Неопределено;
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Объект.СуммаУчета = 0;
		Объект.Курс = 0;
		Объект.Кратность = 0;
		Объект.РасшифровкаПлатежа.Очистить();
		Объект.РасшифровкаПлатежа.Добавить();
		Объект.РасшифровкаПлатежа[0].СуммаПлатежа = Объект.СуммаДокумента;
		Объект.ЭквайринговыеОперации.Очистить();
		Объект.РасшифровкаПлатежаОтАгента.Очистить();
	// Конец Прочие расчеты
	КонецЕсли;
	
КонецПроцедуры // ОчиститьРеквизитыНеОтносящиесяКОперации()

&НаСервере
Процедура УстановитьСвязиПараметровВыбораДоступныеТипы()
	
	// Прочие расчеты
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты")
		Тогда
		УстановитьПараметрыВыбораПоУчетуПрочихРасчетовНаСервереДляЭлементаСчета();
	Иначе
		УстановитьПараметрыВыбораПоМетаданнымДляЭлементаСчета();
	КонецЕсли;
	// Конец Прочие расчеты
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя") Тогда
		
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПриемИПередачаВРемонт") 
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "ВариантРемонта") <> Перечисления.ВариантыРемонта.НашаМастерскаяМногоэтапныйРемонт
			Тогда
			//ПриемИПередачаВРемонт это одновременно и заказ, и документ расхода
			Элементы.РасшифровкаПлатежаДокумент.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ПриемИПередачаВРемонт");
			Элементы.РасшифровкаПлатежаЗаказ.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ПриемИПередачаВРемонт");
		Иначе
		
			Массив = Новый Массив();
			Массив.Добавить(Тип("ДокументСсылка.ПередачаВА"));
			Массив.Добавить(Тип("ДокументСсылка.АктВыполненныхРабот"));
			Массив.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
			Массив.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
			Массив.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
			Массив.Добавить(Тип("ДокументСсылка.ОтчетКомиссионера"));
			Массив.Добавить(Тип("ДокументСсылка.ОтчетОПереработке"));
			Массив.Добавить(Тип("ДокументСсылка.Взаимозачет"));
			Массив.Добавить(Тип("ДокументСсылка.ПриемИПередачаВРемонт"));
			
			ДопустимыеТипы = Новый ОписаниеТипов(Массив, , );
			Элементы.РасшифровкаПлатежаДокумент.ОграничениеТипа = ДопустимыеТипы;
			
			ДопустимыеТипы = Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя");
			Элементы.РасшифровкаПлатежаЗаказ.ОграничениеТипа = ДопустимыеТипы;
		
		КонецЕсли;
		
		ДопустимыеТипы = Новый ОписаниеТипов("ДокументСсылка.СчетНаОплату", , );
		Элементы.РасшифровкаПлатежаСчетНаОплату.ОграничениеТипа = ДопустимыеТипы;
		
		Элементы.РасшифровкаПлатежаДокумент.Подсказка = "Оплачиваемый документ отгрузки товаров, работ и услуг контрагенту";
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПоставщика") Тогда
		
		Массив = Новый Массив();
		Массив.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
		Массив.Добавить(Тип("ДокументСсылка.РасходИзКассы"));
		Массив.Добавить(Тип("ДокументСсылка.РасходСоСчета"));
		Массив.Добавить(Тип("ДокументСсылка.Взаимозачет"));
		Массив.Добавить(Тип("ДокументСсылка.ДополнительныеРасходы"));
		Массив.Добавить(Тип("ДокументСсылка.ОтчетКомитенту"));
		Массив.Добавить(Тип("ДокументСсылка.ОтчетПереработчика"));
		Массив.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
		Массив.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
		
		ДопустимыеТипы = Новый ОписаниеТипов(Массив, , );
		Элементы.РасшифровкаПлатежаДокумент.ОграничениеТипа = ДопустимыеТипы;
		
		ДопустимыеТипы = Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику", , );
		Элементы.РасшифровкаПлатежаЗаказ.ОграничениеТипа = ДопустимыеТипы;
		
		ДопустимыеТипы = Новый ОписаниеТипов("ДокументСсылка.СчетНаОплатуПоставщика", , );
		Элементы.РасшифровкаПлатежаСчетНаОплату.ОграничениеТипа = ДопустимыеТипы;
		
		Элементы.РасшифровкаПлатежаДокумент.Подсказка = "Документ расчетов с контрагентом, по которому осуществляется возврат денежных средств";
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьСвязиПараметровВыбораДоступныеТипы()

&НаСервере
Процедура УстановитьВидимостьКурсаВалюты(ВалютаДенежныхСредств)
	
	Элементы.Курс.Видимость = (ВалютаДенежныхСредств <> Константы.НациональнаяВалюта.Получить());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступность(ИзмененВидОперации = Ложь)
	
	// Документ основание.
	НовыйМассив = Новый Массив();
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	ПараметрыВыбораДокументаОснования = НовыеПараметры;
	// Конец Документ основание.
	
	Если ТолькоПросмотр И НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Элементы.ДокументОснованиеНадписьАвто.Доступность = Ложь;
		Элементы.ДокументОснованиеНадписьСПомощником.Доступность = Ложь;
		Элементы.ДокументОснованиеНадписьВручную.Доступность = Ложь;
		Элементы.ДокументОснованиеНадпись.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

&НаСервере
Процедура НастроитьЭлементДоговораЗайма()
	
	Элементы.ДоговорЗаймаСотруднику.Доступность = НЕ Объект.Подотчетник.Пустая();
	Если Элементы.ДоговорЗаймаСотруднику.Доступность Тогда
		Элементы.ДоговорЗаймаСотруднику.ПодсказкаВвода = "";
	Иначе
		Элементы.ДоговорЗаймаСотруднику.ПодсказкаВвода = НСтр("ka='ხელშეკრულების ასარჩევად აირჩიეთ თანამშრომელი';ru='Чтобы выбрать договор, выберите сотрудника';en='To select an agreement, select employee'");
	КонецЕсли;
	
	Элементы.ДоговорКредита.Доступность = НЕ Объект.Контрагент.Пустая();
	Если Элементы.ДоговорКредита.Доступность Тогда
		Элементы.ДоговорКредита.ПодсказкаВвода = "";
	Иначе
		Элементы.ДоговорКредита.ПодсказкаВвода = НСтр("ka='ხელშეკრულების ასარჩევად აირჩიეთ ბანკი';ru='Чтобы выбрать договор, выберите банк';en='To select the contract, select the bank'");
	КонецЕсли;
	
КонецПроцедуры

//+++ Истомин
&НаСервере
Процедура УстановитьЗагруженИзИнтернетБанка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УИДДокументовВИнтернетБанке.ДокументСсылка,
		|	УИДДокументовВИнтернетБанке.УИДДокументаВБанке,
		|	УИДДокументовВИнтернетБанке.Выгружен
		|ИЗ
		|	РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
		|ГДЕ
		|	УИДДокументовВИнтернетБанке.ДокументСсылка = &ДокументСсылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		Элементы.ДекорацияЗагруженИзБанка.Видимость = Истина;
		Элементы.ДекорацияЗагруженИзБанка.Заголовок = НСтр("ka='ჩატვირთული ონლაინ საბანკოდან';ru='Загружен из интернет банка';en='Downloaded from the Internet bank'");
		Элементы.ДекорацияЗагруженИзБанка.ЦветТекста = Новый Цвет(0,255,0);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДляОперацииВозвартДенегОтСотрудника(Видимость = ЛОЖЬ)
	
	Элементы.Сотрудник.Видимость = Видимость;
	Элементы.ВозвратДенегЗПОтСтрудника.Видимость = Видимость;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДляОперацииВозвартЗаймаОтСотрудника()
	
	Видимость = ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником");	
	
	Элементы.Сотрудник.Видимость = Видимость;
	
КонецПроцедуры

//--- Истомин

#КонецОбласти

#Область ЗаполнениеОбъектов

&НаКлиенте
Процедура СохранитьДокументКакШаблон(Параметр) Экспорт
	
	ЗаполнениеОбъектовУНФКлиент.СохранитьДокументКакШаблон(Объект, ОтображаемыеРеквизиты(), Параметр);
	
КонецПроцедуры

&НаСервере
Функция ОтображаемыеРеквизиты()
	
	Возврат ЗаполнениеОбъектовУНФ.ОтображаемыеРеквизиты(ЭтаФорма);
	
КонецФункции

#КонецОбласти

#Область Эквайринг

&НаСервере
Функция ПоместитьЭквайринговыеОперацииВХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.ЭквайринговыеОперации.Выгрузить(),
		УникальныйИдентификатор
	);
	
КонецФункции // ПоместитьЭквайринговыеОперацииВХранилище()

&НаСервере
Процедура ПолучитьЭквайринговыеОперацииИзХранилища(АдресЭквайринговыеОперацииВХранилище)
	
	ТаблицаЭквайринговыеОперации = ПолучитьИзВременногоХранилища(АдресЭквайринговыеОперацииВХранилище);
	Объект.ЭквайринговыеОперации.Очистить();
	Для каждого СтрокаЭквайринговыеОперации Из ТаблицаЭквайринговыеОперации Цикл
		Строка = Объект.ЭквайринговыеОперации.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаЭквайринговыеОперации);
	КонецЦикла;
	
КонецПроцедуры // ПолучитьРасшифровкаПлатежаИзХранилища()

&НаСервереБезКонтекста
Функция ПолучитьПараметрыЭквайринговогоТерминалаПриИзменении(ЭквайринговыйТерминал, ИспользоватьТолькоРегламентированногоПланаСчетов, Дата)
	
	ПараметрыЭквайринговогоТерминала = Новый Структура;
	
	ПараметрыЭквайринговогоТерминала.Вставить("Договор", ЭквайринговыйТерминал.Договор);
	//+++ Дмгг
	Если НЕ ИспользоватьТолькоРегламентированногоПланаСчетов Тогда 
		Если Не ЭквайринговыйТерминал.СчетУчета.Пустая() Тогда
			ПараметрыЭквайринговогоТерминала.Вставить("СчетУчета", ЭквайринговыйТерминал.СчетУчета);
		Иначе
			ПараметрыЭквайринговогоТерминала.Вставить("СчетУчета", ПредопределенноеЗначение("ПланСчетов.Управленческий.ПереводыВПути"));
		КонецЕсли;
		Если Не ЭквайринговыйТерминал.СчетЗатрат.Пустая() Тогда
			ПараметрыЭквайринговогоТерминала.Вставить("СчетЗатрат", ЭквайринговыйТерминал.СчетЗатрат);
			ПараметрыЭквайринговогоТерминала.Вставить("ТипСчетаЗатрат", ЭквайринговыйТерминал.СчетЗатрат.ТипСчета);
		Иначе
			ПараметрыЭквайринговогоТерминала.Вставить("СчетЗатрат", ПредопределенноеЗначение("ПланСчетов.Управленческий.ПрочиеРасходы"));
			ПараметрыЭквайринговогоТерминала.Вставить("ТипСчетаЗатрат", ПараметрыЭквайринговогоТерминала.СчетЗатрат.ТипСчета);
		КонецЕсли;
	Иначе
		Если Не ЭквайринговыйТерминал.СчетУчета.Пустая() Тогда
			ПараметрыЭквайринговогоТерминала.Вставить("СчетУчета", ЭквайринговыйТерминал.СчетУчетаРегл);
			ПараметрыЭквайринговогоТерминала.Вставить("СчетУчетаРегл", ЭквайринговыйТерминал.СчетУчетаРегл);
		Иначе
			ПараметрыЭквайринговогоТерминала.Вставить("СчетУчета", ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПереводыВПути"));
			ПараметрыЭквайринговогоТерминала.Вставить("СчетУчетаРегл", ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПереводыВПути"));
		КонецЕсли;
		Если Не ЭквайринговыйТерминал.СчетЗатрат.Пустая() Тогда
			ПараметрыЭквайринговогоТерминала.Вставить("СчетЗатрат", ЭквайринговыйТерминал.СчетЗатратРегл);
			ПараметрыЭквайринговогоТерминала.Вставить("ТипСчетаЗатрат", ЭквайринговыйТерминал.СчетЗатратРегл.ТипСчета);
			ПараметрыЭквайринговогоТерминала.Вставить("СчетЗатратРегл", ЭквайринговыйТерминал.СчетЗатратРегл);
			ПараметрыЭквайринговогоТерминала.Вставить("ТипСчетаЗатратРегл", ЭквайринговыйТерминал.СчетЗатратРегл.ТипСчета);
		Иначе
			тзСчетовУчетнойПолитикиРегл = РегистрыСведений.УчетнаяПолитикаРегл.СрезПоследних(Дата, Новый Структура("Организация", ЭквайринговыйТерминал.Организация));
			СчетПрочиеРасходыРегл = ?(тзСчетовУчетнойПолитикиРегл.Количество() > 0, тзСчетовУчетнойПолитикиРегл[0].СчетПрочихРасходов ,ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка"));
			
			ПараметрыЭквайринговогоТерминала.Вставить("СчетЗатрат", СчетПрочиеРасходыРегл);
			ПараметрыЭквайринговогоТерминала.Вставить("ТипСчетаЗатрат", ПараметрыЭквайринговогоТерминала.СчетЗатрат.ТипСчета);
			ПараметрыЭквайринговогоТерминала.Вставить("СчетЗатратРегл", СчетПрочиеРасходыРегл);
			ПараметрыЭквайринговогоТерминала.Вставить("ТипСчетаЗатратРегл", ПараметрыЭквайринговогоТерминала.СчетЗатратРегл.ТипСчета);
		КонецЕсли;
	КонецЕсли;
	//--- Дмгг
	Если Не ЭквайринговыйТерминал.НаправлениеДеятельности.Пустая() Тогда
		ПараметрыЭквайринговогоТерминала.Вставить("НаправлениеДеятельности", ЭквайринговыйТерминал.НаправлениеДеятельности);
	Иначе
		ПараметрыЭквайринговогоТерминала.Вставить("НаправлениеДеятельности", ПредопределенноеЗначение("Справочник.НаправленияДеятельности.Прочее"));
	КонецЕсли;
	Если Не ЭквайринговыйТерминал.Подразделение.Пустая() Тогда
		ПараметрыЭквайринговогоТерминала.Вставить("Подразделение", ЭквайринговыйТерминал.Подразделение);
	Иначе
		Пользователь = Пользователи.ТекущийПользователь();
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновноеПодразделение");
		ПараметрыЭквайринговогоТерминала.Вставить("Подразделение", ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение));
	КонецЕсли;
	ПараметрыЭквайринговогоТерминала.Вставить("БанковскийСчетЭквайринг", ЭквайринговыйТерминал.БанковскийСчетЭквайринг);
	
	Возврат ПараметрыЭквайринговогоТерминала;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЭквайринговыеОперации(Команда)
	
	ВыполнитьВозврат = ПроверитьРеквизитыПередЗаполнениемТабличнойЧасти();
	Если ВыполнитьВозврат Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ЗаполнитьЭквайринговыеОперацииЗавершение", ЭтотОбъект);
	Если Объект.ЭквайринговыеОперации.Количество() > 0 Тогда
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, НСтр("ka='ეკვაირინგის ოპერაციები სრულად იქნება გადავსებული. გავაგრძელოთ?';ru='Эквайринговые операции будут полностью перезаполнены. Продолжить?';en='Acquiring operation will be fully refilled. Proceed?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	Иначе
		ЗаполнитьЭквайринговыеОперацииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьРеквизитыПередЗаполнениемТабличнойЧасти()
	
	ВыполнитьВозврат = Ложь;
	Если Объект.Контрагент.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='დასაწყისში მიუთითეთ კონტრაგენტი!';ru='Укажите вначале контрагента!';en='Specify the first contractor!'");
		Сообщение.Поле = "Контрагент";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
		
		ВыполнитьВозврат = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчет)
	   И НЕ ЗначениеЗаполнено(Объект.ВалютаДенежныхСредств) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='თავდაპირველად, მიუთითეთ საბანკო ანგარიში!';ru='Укажите вначале банковский счет!';en='Specify the first bank account!'");
		Сообщение.Поле = "БанковскийСчет";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
		
		ВыполнитьВозврат = Истина;
	КонецЕсли;

	ВыполнитьВозврат = Ложь;
	Если Объект.ЭквайринговыйТерминал.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='თავდაპირველად მიუთითეთ ეკვაირინგის ტერმინალი!';ru='Укажите вначале эквайринговый терминал!';en='Specify first acquiring the terminal!'");
		Сообщение.Поле = "ЭквайринговыйТерминал";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
		
		ВыполнитьВозврат = Истина;
	КонецЕсли;
	
	Возврат ВыполнитьВозврат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЭквайринговыеОперацииЗавершение(Ответ, Параметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЭквайринговыеОперацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭквайринговыеОперацииНаСервере(ДатаНачала = '00010101', ДатаОкончания = '00010101')
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьЭквайринговыеОперации(ДатаНачала, ДатаОкончания);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингПодборЗавершение(Результат1, ДополнительныеПараметры) Экспорт
	
	АдресЭквайринговыеОперацииВХранилище = ДополнительныеПараметры.АдресЭквайринговыеОперацииВХранилище;
	
	Результат = Результат1;
	Если Результат = КодВозвратаДиалога.OK Тогда
		
		ПолучитьЭквайринговыеОперацииИзХранилища(АдресЭквайринговыеОперацииВХранилище);
		
		Для Каждого ТекущаяСтрока Из Объект.ЭквайринговыеОперации Цикл
			ТекущаяСтрока.СуммаПлатежаИтогоПоСтроке = ТекущаяСтрока.СуммаРасчетов-ТекущаяСтрока.СуммаРасчетовВозврата
									-ТекущаяСтрока.СуммаРасчетовКомиссии-ТекущаяСтрока.СуммаРасчетовКомиссииВозврата;
			ТекущаяСтрока.СуммаКомиссииИтогоПоСтроке = ТекущаяСтрока.СуммаРасчетовКомиссии+ТекущаяСтрока.СуммаРасчетовКомиссииВозврата;
		КонецЦикла;
		
		УстановитьТекущуюСтраницу();
		
		Если Объект.ЭквайринговыеОперации.Количество() = 1 Тогда
			Объект.СуммаДокумента = Объект.ЭквайринговыеОперации.Итог("СуммаПлатежаИтогоПоСтроке");
			Объект.СуммаКомиссииДокумента = Объект.ЭквайринговыеОперации.Итог("СуммаКомиссииИтогоПоСтроке");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ЭквайрингПодборЗавершение()

&НаКлиенте
Процедура ЭквайринговыйТерминалПриИзменении(Элемент)
	
	Если ЭквайринговыйТерминал <> Объект.ЭквайринговыйТерминал Тогда
		ПараметрыЭквайринговогоТерминала = ПолучитьПараметрыЭквайринговогоТерминалаПриИзменении(Объект.ЭквайринговыйТерминал, ИспользоватьТолькоРегламентированногоПланаСчетов, Объект.Дата);
		ТипСчетаЗатратШапка = ПараметрыЭквайринговогоТерминала.ТипСчетаЗатрат;
		ЭквайринговыйТерминалПриИзмененииНаСервере();
		Объект.НаправлениеДеятельностиЗатраты = ПараметрыЭквайринговогоТерминала.НаправлениеДеятельности;
		Объект.ПодразделениеЗатраты = ПараметрыЭквайринговогоТерминала.Подразделение;
		Если Объект.БанковскийСчет <> ПараметрыЭквайринговогоТерминала.БанковскийСчетЭквайринг И ПараметрыЭквайринговогоТерминала.БанковскийСчетЭквайринг.Выбран() Тогда
			Объект.БанковскийСчет = ПараметрыЭквайринговогоТерминала.БанковскийСчетЭквайринг;
			БанковскийСчетПриИзменении(Элемент);
		КонецЕсли;
		
		ЭквайринговыйТерминал = Объект.ЭквайринговыйТерминал;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЭквайринговыйТерминалПриИзмененииНаСервере()
	
	НастроитьВидимостьИУстановитьЗначенияПоТипуСчетаЗатрат();
	Элементы.ЭквайринговыеОперацииСуммаРасчетовКомиссииВозврата.Видимость = Объект.ЭквайринговыйТерминал.ЭквайрерБеретКомиссиюЗаВозвратДС;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквайринговыйТерминалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЕстьСообщения = Ложь;
	Если Объект.Контрагент.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='თავდაპირველად, აირჩიეთ ეკვაირერი ბანკი!';ru='Сначала выберите банк-эквайрер!';en='First, select the acquirer!'");
		Сообщение.Поле = "Объект.Контрагент";
		Сообщение.Сообщить();
		
		ЕстьСообщения = Истина;
	КонецЕсли;
	
	Если Объект.БанковскийСчет.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='თავდაპირველად, აირჩიეთ საბანკო ანგარიში!';ru='Сначала выберите банковский счет!';en='First, select the bank account!'");
		Сообщение.Поле = "Объект.БанковскийСчет";
		Сообщение.Сообщить();
		
		ЕстьСообщения = Истина;
	КонецЕсли;
	
	Если ЕстьСообщения Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьИУстановитьЗначенияПоТипуСчетаЗатрат(УстанавливатьЗначения = Истина)
	
	Если ТипСчетаЗатратШапка = Перечисления.ТипыСчетов.Расходы Тогда
		
		ПараметрыЭквайринговогоТерминала = ПолучитьПараметрыЭквайринговогоТерминалаПриИзменении(Объект.ЭквайринговыйТерминал, ИспользоватьТолькоРегламентированногоПланаСчетов, Объект.Дата);
		
		Если УстанавливатьЗначения Тогда
			Объект.НаправлениеДеятельностиЗатраты = ПараметрыЭквайринговогоТерминала.НаправлениеДеятельности;
			Объект.ПодразделениеЗатраты = ПараметрыЭквайринговогоТерминала.Подразделение;
		КонецЕсли;
		
		Элементы.ПодразделениеЗатраты.Видимость = Истина;
		Элементы.НаправлениеДеятельностиЗатраты.Видимость = Истина;
		
	Иначе
		
		Если УстанавливатьЗначения Тогда
			Объект.НаправлениеДеятельностиЗатраты = Справочники.НаправленияДеятельности.Прочее;
			Объект.ПодразделениеЗатраты = Неопределено;
		КонецЕсли;
		
		Элементы.ПодразделениеЗатраты.Видимость = Ложь;
		Элементы.НаправлениеДеятельностиЗатраты.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквайринговыеОперацииСуммаРасчетовПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЭквайринговыеОперации.ТекущиеДанные;
	
	Если ТекущаяСтрока.СуммаРасчетов <> 0 Тогда
		ТекущаяСтрока.СуммаРасчетовВозврата = 0;
	КонецЕсли;
	
	ПересчитатьСуммуПлатежаИКомиссииЭквайринга(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуПлатежаИКомиссииЭквайринга(ТекущаяСтрока)
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.СуммаПлатежаИтогоПоСтроке = ТекущаяСтрока.СуммаРасчетов-ТекущаяСтрока.СуммаРасчетовВозврата
								-ТекущаяСтрока.СуммаРасчетовКомиссии-ТекущаяСтрока.СуммаРасчетовКомиссииВозврата;
		ТекущаяСтрока.СуммаКомиссииИтогоПоСтроке = ТекущаяСтрока.СуммаРасчетовКомиссии + ТекущаяСтрока.СуммаРасчетовКомиссииВозврата;
		
		Если Объект.ЭквайринговыеОперации.Количество() = 1 Тогда
			Объект.СуммаДокумента = Объект.ЭквайринговыеОперации[0].СуммаПлатежаИтогоПоСтроке;
			Объект.СуммаКомиссииДокумента = Объект.ЭквайринговыеОперации[0].СуммаКомиссииИтогоПоСтроке;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквайринговыеОперацииСуммаРасчетовВозвратаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЭквайринговыеОперации.ТекущиеДанные;
	
	Если ТекущаяСтрока.СуммаРасчетовВозврата <> 0 Тогда
		ТекущаяСтрока.СуммаРасчетов = 0;
	КонецЕсли;
	
	ПересчитатьСуммуПлатежаИКомиссииЭквайринга(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквайринговыеОперацииСуммаРасчетовКомиссииПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЭквайринговыеОперации.ТекущиеДанные;
	ПересчитатьСуммуПлатежаИКомиссииЭквайринга(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквайринговыеОперацииСуммаРасчетовКомиссииВозвратаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЭквайринговыеОперации.ТекущиеДанные;
	ПересчитатьСуммуПлатежаИКомиссииЭквайринга(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквайринговыеОперацииДокументПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЭквайринговыеОперации.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		СтукрутраПараметров = ПолучитьПараметрыЭквайринговойОперации(ТекущаяСтрока.Документ, Объект.ЭквайринговыйТерминал);
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтукрутраПараметров);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыЭквайринговойОперации(СсылкаНаДокумент, ЭквайринговыйТерминал)
	
	СтукрутраПараметров = Новый Структура("ДатаПлатежа, НомерПлатежнойКарты, ВидПлатежнойКарты");
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ОперацияПоПлатежнымКартам") Тогда
		СтукрутраПараметров.ДатаПлатежа = СсылкаНаДокумент.Дата;
		СтукрутраПараметров.НомерПлатежнойКарты = СсылкаНаДокумент.НомерПлатежнойКарты;
		СтукрутраПараметров.ВидПлатежнойКарты = СсылкаНаДокумент.ВидПлатежнойКарты;
		Если СсылкаНаДокумент.РасшифровкаПлатежа.Количество() = 1 Тогда
			Если ЗначениеЗаполнено(СсылкаНаДокумент.РасшифровкаПлатежа[0].Заказ) Тогда
				СтукрутраПараметров.Вставить("Заказ", СсылкаНаДокумент.РасшифровкаПлатежа[0].Заказ);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
		СтукрутраПараметров.ДатаПлатежа = СсылкаНаДокумент.Дата;
		Если СсылкаНаДокумент.ОплатаПлатежнымиКартами.Количество() = 1 Тогда
			ПерваяСтрокаОплатыКартой = СсылкаНаДокумент.ОплатаПлатежнымиКартами[0];
			Если ПерваяСтрокаОплатыКартой.ЭквайринговыйТерминал = ЭквайринговыйТерминал Тогда
				СтукрутраПараметров.НомерПлатежнойКарты = ПерваяСтрокаОплатыКартой.НомерПлатежнойКарты;
				СтукрутраПараметров.ВидПлатежнойКарты = ПерваяСтрокаОплатыКартой.ВидПлатежнойКарты;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтукрутраПараметров;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЭквайринговыеОперацииСВыборомПериода(Команда)
	
	ВыполнитьВозврат = ПроверитьРеквизитыПередЗаполнениемТабличнойЧасти();
	Если ВыполнитьВозврат Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ЗаполнитьЭквайринговыеОперацииСВыборомПериодаЗавершение", ЭтотОбъект);
	Если Объект.ЭквайринговыеОперации.Количество() > 0 Тогда
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, НСтр("ka='ეკვაირინგის ოპერაციები სრულად იქნება გადავსებული. გავაგრძელოთ?';ru='Эквайринговые операции будут полностью перезаполнены. Продолжить?';en='Acquiring operation will be fully refilled. Proceed?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	Иначе
		ОткрытьФормуВыбораПериодаРасчета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЭквайринговыеОперацииСВыборомПериодаЗавершение(Ответ, Параметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуВыбораПериодаРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПериодаРасчета()
	
	ПараметрыЗаполнения = Новый Структура("Контрагент, БанковскийСчет, ЭквайринговыйТерминал, Организация, Ссылка, ВалютаДенежныхСредств, РасшифровкаПлатежа", 
		Объект.Контрагент, 
		Объект.БанковскийСчет, 
		Объект.ЭквайринговыйТерминал,
		Объект.Организация,
		Объект.Ссылка,
		Объект.ВалютаДенежныхСредств,
		ПоместитьРасшифровкаПлатежаВХранилище());
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОткрытьФормуВыбораПериодаРасчетаЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.ПоступлениеНаСчет.Форма.ФормаВыбораПериода", ПараметрыЗаполнения, ЭтотОбъект, УникальныйИдентификатор,,, ОписаниеОповещенияОЗавершении, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПериодаРасчетаЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗаполнитьЭквайринговыеОперацииНаСервере(Результат.ПериодРасчетовДатаНачала, Результат.ПериодРасчетовДатаОкончания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЭквайринговыхОпераций(Команда)
	
	// Эквайринг
	Если (НЕ ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал) ИЛИ НЕ ЗначениеЗаполнено(Объект.Контрагент) 
		ИЛИ (НЕ ЗначениеЗаполнено(Объект.БанковскийСчет)
		И НЕ ЗначениеЗаполнено(Объект.ВалютаДенежныхСредств))) Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ka='არჩეული უნდა იქნას ბანკი-ეკვაირერი, ეკვაირინგის ტერმინალი და საბანკო ანგარიში!';ru='Должнен быть выбран банк-эквайрер, эквайринговый терминал и банковский счет!';en='It should be chosen acquirer, acquiring a terminal and a bank account!'"));
		Возврат;
	КонецЕсли;
	
	АдресЭквайринговыеОперацииВХранилище = ПоместитьЭквайринговыеОперацииВХранилище();
	
	ПараметрыПодбора = Новый Структура(
		"АдресЭквайринговыеОперацииВХранилище,
		|Компания,
		|Дата,
		|Контрагент,
		|Ссылка,
		|ВидОперации,
		|ВалютаДенежныхСредств,
		|СуммаДокумента,
		|БанковскийСчет,
		|ЭквайринговыйТерминал",
		АдресЭквайринговыеОперацииВХранилище,
		Компания,
		Объект.Дата,
		Объект.Контрагент,
		Объект.Ссылка,
		Объект.ВидОперации,
		Объект.ВалютаДенежныхСредств,
		Объект.СуммаДокумента,
		Объект.БанковскийСчет,
		Объект.ЭквайринговыйТерминал
	);
		
	Результат = Неопределено;

	ОткрытьФорму("ОбщаяФорма.ФормаПодбораДолговПоЭквайрингу", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("ЭквайрингПодборЗавершение", ЭтотОбъект, Новый Структура("АдресЭквайринговыеОперацииВХранилище", АдресЭквайринговыеОперацииВХранилище)));
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеРасчеты

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДоговорЗаймаСотрудникуПриИзменении(Элемент)
	
	ОбработатьИзменениеДоговораКредитаИлиЗайма();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКредитаПриИзменении(Элемент)
	
	ОбработатьИзменениеДоговораКредитаИлиЗайма();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорСАгентомНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ka='Сначала выберите операцию.';ru='Сначала выберите операцию.';en='First select the operation.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ka='Сначала выберите контрагента.';ru='Сначала выберите контрагента.';en='First, select a contractor.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.РасшифровкаПлатежа.Количество() = 0) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ka='Ошибка заполнения документа. Проверьте заполнение организации, операции, контрагента.';ru='Ошибка заполнения документа. Проверьте заполнение организации, операции, контрагента.';en='Error filling document. Check the filling of the organization, operations, contractor.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПолучитьПараметрыФормыВыбораДоговора(Объект.Ссылка, Объект.Организация, Объект.Контрагент, Объект.РасшифровкаПлатежа[0].Договор, Объект.ВидОперации);
	Если ПараметрыФормы.КонтролироватьВыборДоговора Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеДоговораКредитаИлиЗайма()
	
	ДанныеДоговораЗаймаСотруднику = ДоговорЗаймаСотрудникуПриИзмененииНаСервере(Объект.ДоговорКредитаЗайма, Объект.Дата);
	
	ЗаполнитьИнформациюПоКредитуЗаймуНаСервере();
	
	СтруктураДанные = ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении(
			Объект.Дата,
			Объект.ДоговорКредитаЗайма
		);
		
	Для Каждого СтрокаТабличнойЧасти Из Объект.РасшифровкаПлатежа Цикл
		СтрокаТабличнойЧасти.Курс = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс
		);
		СтрокаТабличнойЧасти.Кратность = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность
		);
		
		СтрокаТабличнойЧасти.СуммаРасчетов = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
			СтрокаТабличнойЧасти.СуммаПлатежа,
			Курс,
			СтрокаТабличнойЧасти.Курс,
			Кратность,
			СтрокаТабличнойЧасти.Кратность
		);
		
		//+++ Дмгг
		Если СтруктураДанные.Свойство("Проект") Тогда 
			СтрокаТабличнойЧасти.Проект = СтруктураДанные.Проект;
		КонецЕсли;
		//--- Дмгг
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоговорЗаймаСотрудникуПриИзмененииНаСервере(ДоговорЗаймаСотруднику, Дата)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить("ВалютаРасчетов", ДоговорЗаймаСотруднику.ВалютаРасчетов);
	СтруктураДанные.Вставить("Контрагент", ДоговорЗаймаСотруднику.Контрагент);
	СтруктураДанные.Вставить("Сотрудник", ДоговорЗаймаСотруднику.Сотрудник);
	СтруктураДанные.Вставить("ЭтоДоговорЗайма", ДоговорЗаймаСотруднику.ВидДоговора = Перечисления.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	СтруктураДанные = ПолучитьДанныеСотрудникПриИзменении(Объект.Подотчетник, Объект.Дата, Объект.Организация);
	Объект.ДоговорКредитаЗайма = СтруктураДанные.ДоговорКредитаЗайма;
	ОбработатьИзменениеДоговораКредитаИлиЗайма();
	//+++ Дмгг
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратДенегОтСотрудника") Тогда 
		УстановитьТекущееЗначениеПодразделенияСотрудника();
		ПодотчетникПриИзмененииНаСервере();
	КонецЕсли;
	//--- Дмгг
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСотрудникПриИзменении(Сотрудник, Дата, Организация)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить("ДоговорКредитаЗайма", Документы.ДоговорКредитаИЗайма.ПолучитьДоговорКредитаИЗаймаПоУмолчаниюПоОрганизацииВидуДоговора(Сотрудник, Организация));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеПодотчетникПриИзменении()

&НаКлиенте
Процедура РасчетыПрочиеКорреспонденцияПриИзменении(Элемент)
	
	Если Корреспонденция <> Объект.Корреспонденция Тогда
		УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденции(Истина);
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Корреспонденция = Объект.Корреспонденция;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьВНУПриИзменении(Элемент)
	Если Объект.УчитыватьВНУ Тогда
		Объект.Патент = ПредопределенноеЗначение("Справочник.Патенты.ПустаяСсылка");
	КонецЕсли;
	Элементы.Патент.Доступность = Не Объект.УчитыватьВНУ;
КонецПроцедуры

&НаКлиенте
Процедура ПатентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Патент) Тогда
		Объект.УчитыватьВНУ = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасшифровкаПлатежа

&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыСуммаРасчетовПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные);
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа[0].СуммаПлатежа;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыПередУдалением(Элемент, Отказ)
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыКурсПриИзменении(Элемент)
		
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные);
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа[0].СуммаПлатежа;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыКратностьПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные);
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа[0].СуммаПлатежа;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыСуммаПлатежаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.СуммаРасчетов = 0,
		1,
		СтрокаТабличнойЧасти.СуммаПлатежа / СтрокаТабличнойЧасти.СуммаРасчетов * Курс
	);
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
		СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
	РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Контрагент.Пустая() Тогда
		СтандартнаяОбработка = Ложь;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='თავდაპირველად, აირჩიეთ კონტრაგენტი';ru='Сначала выберите контрагента';en='First, select a contractor'");
		Сообщение.Поле = "Объект.Контрагент";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	ОбработатьНачалоВыбораДоговораКонтрагентаПрочиеРасчеты(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыДоговорПриИзменении(Элемент)
	
	ОбработатьИзменениеДоговораКонтрагентаПрочиеРасчеты();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПрочиеРасчетыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные;
	РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаРасчетыПоКредитамСуммаРасчетовПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежаРасчетыПоКредитам.ТекущиеДанные);
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа[0].СуммаПлатежа;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаРасчетыПоКредитамКурсПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежаРасчетыПоКредитам.ТекущиеДанные);
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа[0].СуммаПлатежа;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаРасчетыПоКредитамКратностьПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежаНаКлиенте(Элементы.РасшифровкаПлатежаРасчетыПоКредитам.ТекущиеДанные);
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа[0].СуммаПлатежа;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаРасчетыПоКредитамСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежаРасчетыПоКредитам.ТекущиеДанные;
	РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаРасчетыПоКредитамСуммаПлатежаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежаРасчетыПоКредитам.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.СуммаРасчетов = 0,
		1,
		СтрокаТабличнойЧасти.СуммаПлатежа / СтрокаТабличнойЧасти.СуммаРасчетов * Курс
	);
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
		СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
	РассчитатьСуммуНДСНаКлиенте(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаРасчетыПоКредитамПередУдалением(Элемент, Отказ)
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Заполняет сумму документа остатком суммы кредита, которую еще не получили от банка.
//
&НаСервере
Процедура ЗаполнитьПоДоговоруКредитаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов КАК ВалютаРасчетов,
	|	РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалРасход
	|ПОМЕСТИТЬ ВременнаяТаблицаВыданныеРанееСуммы
	|ИЗ
	|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Обороты(
	|			,
	|			,
	|			,
	|			ДоговорКредитаЗайма = &ДоговорЗаймаСотруднику
	|				И Организация = &Организация) КАК РасчетыПоКредитамИЗаймамОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыПоКредитамИЗаймам.ДоговорКредитаЗайма.ВалютаРасчетов,
	|	ВЫБОР
	|		КОГДА РасчетыПоКредитамИЗаймам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -РасчетыПоКредитамИЗаймам.ОсновнойДолгВал
	|		ИНАЧЕ РасчетыПоКредитамИЗаймам.ОсновнойДолгВал
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.РасчетыПоКредитамИЗаймам КАК РасчетыПоКредитамИЗаймам
	|ГДЕ
	|	РасчетыПоКредитамИЗаймам.Регистратор = &Ссылка
	|	И РасчетыПоКредитамИЗаймам.ДоговорКредитаЗайма = &ДоговорЗаймаСотруднику
	|	И РасчетыПоКредитамИЗаймам.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаВыданныеРанееСуммы.ВалютаРасчетов,
	|	СУММА(ВременнаяТаблицаВыданныеРанееСуммы.ОсновнойДолгВалРасход) КАК ОсновнойДолгВалРасход,
	|	ДоговорЗаймаСотруднику.СуммаДокумента
	|ИЗ
	|	ВременнаяТаблицаВыданныеРанееСуммы КАК ВременнаяТаблицаВыданныеРанееСуммы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДоговорКредитаИЗайма КАК ДоговорЗаймаСотруднику
	|		ПО ВременнаяТаблицаВыданныеРанееСуммы.ВалютаРасчетов = ДоговорЗаймаСотруднику.ВалютаРасчетов
	|ГДЕ
	|	ДоговорЗаймаСотруднику.Ссылка = &ДоговорЗаймаСотруднику
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаВыданныеРанееСуммы.ВалютаРасчетов,
	|	ДоговорЗаймаСотруднику.СуммаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &ВалютаРасчетов) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &ВалютаДенежныхСредств) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("ДоговорЗаймаСотруднику", Объект.ДоговорКредитаЗайма);
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВалютаРасчетов", Объект.ДоговорКредитаЗайма.ВалютаРасчетов);
	Запрос.УстановитьПараметр("ВалютаДенежныхСредств", Объект.ВалютаДенежныхСредств);
	
	МРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = МРезультатов[1].Выбрать();
	
	ВыборкаВалютаДоговора = МРезультатов[2].Выбрать();
	Если ВыборкаВалютаДоговора.Следующий() Тогда
		КурсДоговора = ВыборкаВалютаДоговора.Курс;
		КратностьДоговора = ВыборкаВалютаДоговора.Кратность;
	Иначе
		КурсДоговора = 1;
		КратностьДоговора = 1;
	КонецЕсли;
	
	ВыборкаВалютыДС = МРезультатов[3].Выбрать();
	Если ВыборкаВалютыДС.Следующий() Тогда
		КурсДокумента = ВыборкаВалютыДС.Курс;
		КратностьДокумента = ВыборкаВалютыДС.Кратность;
	Иначе
		КурсДокумента = 1;
		КратностьДокумента = 1;
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		ТекстСообщения = "";
		Если Выборка.СуммаДокумента < Выборка.ОсновнойДолгВалРасход Тогда
			ТекстСообщения = "По договору кредита уже выдано "+Выборка.ОсновнойДолгВалРасход+" ("+Выборка.ВалютаРасчетов+").";
		ИначеЕсли Выборка.СуммаДокумента = Выборка.ОсновнойДолгВалРасход Тогда
			ТекстСообщения = "По договору кредита уже выдана вся сумма: "+Выборка.ОсновнойДолгВалРасход+" ("+Выборка.ВалютаРасчетов+").";
		Иначе
			Объект.СуммаДокумента = (Выборка.СуммаДокумента - Выборка.ОсновнойДолгВалРасход) * КурсДоговора * КратностьДокумента / (КратностьДоговора * КурсДокумента);
		КонецЕсли;
		
		Если ТекстСообщения <> "" Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Поле = "ДоговорЗаймаСотруднику";
			Сообщение.Сообщить();
		КонецЕсли;
	Иначе
		Объект.СуммаДокумента = Объект.ДоговорКредитаЗайма.СуммаДокумента * КурсДоговора * КратностьДокумента / (КратностьДоговора * КурсДокумента);
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДоговоруКредита(Команда)
	
	Если Объект.ДоговорКредитаЗайма.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, "Выберите договор");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоДоговоруКредитаНаСервере();
	СуммаДокументаПриИзменении(Элементы.СуммаДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДоговоруЗайма(Команда)
	
	Если Объект.ДоговорКредитаЗайма.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, "Выберите договор");
		Возврат;
	КонецЕсли;
	
	АдресРасшифровкиПлатежаВХранилище = ПоместитьРасшифровкаПлатежаВХранилище();
	ПараметрыОтбора = Новый Структура("
		|АдресРасшифровкиПлатежаВХранилище,
		|Организация,
		|Регистратор,
		|ИдентификаторФормыДокумента,
		|ВидОперации,
		|Дата,
		|Валюта,
		|ДоговорКредитаЗайма,
		|СуммаДокумента,
		|Контрагент,
		|СтавкаНДСПоУмолчанию,
		|СуммаПлатежа,
		|Курс,
		|Кратность,
		|Сотрудник",
		АдресРасшифровкиПлатежаВХранилище,
		Объект.Организация,
		Объект.Ссылка,
		УникальныйИдентификатор,
		Объект.ВидОперации,
		Объект.Дата,
		Объект.ВалютаДенежныхСредств,
		Объект.ДоговорКредитаЗайма,
		Объект.СуммаДокумента,
		Объект.Контрагент,
		СтавкаНДСПоУмолчанию,
		Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа"),
		Курс,
		Кратность,
		Объект.Подотчетник);
	
	ОткрытьФорму("ОбщаяФорма.ФормаЗаполненияРасшифровкиПлатежаПоКредитамИЗаймам", 
						ПараметрыОтбора,
						ЭтаФорма,,,,Новый ОписаниеОповещения("ЗаполнитьПоДоговоруЗаймаЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДоговоруЗаймаЗавершение(РезультатЗаполнения, ПараметрыЗавершения) Экспорт
	ЗаполнитьСуммуДокумента = Ложь;
	Если ТипЗнч(РезультатЗаполнения) = Тип("Структура") Тогда
		Если РезультатЗаполнения.Свойство("ОчищатьТабличнуюЧастьПриЗаполнении") И РезультатЗаполнения.ОчищатьТабличнуюЧастьПриЗаполнении Тогда
			Объект.РасшифровкаПлатежа.Очистить();
			ЗаполнитьСуммуДокумента = Истина;
		КонецЕсли;
		Если РезультатЗаполнения.Свойство("АдресРасшифровкиПлатежаВХранилище") Тогда
			ПолучитьРасшифровкаПлатежаИзХранилища(РезультатЗаполнения.АдресРасшифровкиПлатежаВХранилище, Ложь);
			
			Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
				Объект.СуммаДокумента = Объект.РасшифровкаПлатежа[0].СуммаПлатежа;
			КонецЕсли;
		КонецЕсли;
		Если ЗаполнитьСуммуДокумента Тогда
			Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
			СуммаДокументаПриИзменении(Элементы.СуммаДокумента);
		КонецЕсли;
		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьИзменениеДоговораКонтрагентаПрочиеРасчеты()
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
		СтруктураДанные = ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении(
			Объект.Дата,
			СтрокаТабличнойЧасти.Договор,
			СтрокаТабличнойЧасти.ДокументПланирования,
			СтрокаТабличнойЧасти.СтатьяДДС
		);
		СтрокаТабличнойЧасти.Курс = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Курс
		);
		СтрокаТабличнойЧасти.Кратность = ?(
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность = 0,
			1,
			СтруктураДанные.ДоговорВалютаКурсКратность.Кратность
		);
		
		СтрокаТабличнойЧасти.СтатьяДДС = СтруктураДанные.СтатьяДДСПоУмолчанию;
	Иначе
		СтрокаТабличнойЧасти.СтатьяДДС = ПолучитьСтатьюДДСПоУмолчаниюДляСтрокиРасшифровки(СтрокаТабличнойЧасти.Договор,
			СтрокаТабличнойЧасти.ДокументПланирования,
			СтрокаТабличнойЧасти.СтатьяДДС);
	КонецЕсли;
	
	СтрокаТабличнойЧасти.СуммаРасчетов = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаПлатежа,
		Курс,
		СтрокаТабличнойЧасти.Курс,
		Кратность,
		СтрокаТабличнойЧасти.Кратность
	);
	
КонецПроцедуры // ОбработатьИзменениеДоговораКонтрагента()

&НаКлиенте
Процедура ОбработатьНачалоВыбораДоговораКонтрагентаПрочиеРасчеты(Элемент, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежаПрочиеРасчеты.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПолучитьПараметрыФормыВыбора(Объект.Ссылка, Объект.Организация, Объект.Контрагент, СтрокаТабличнойЧасти.Договор, Объект.ВидОперации);
	Если ПараметрыФормы.КонтролироватьВыборДоговора Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработатьИзменениеДоговораКонтрагента()

&НаСервере
Процедура ЗаполнитьИнформациюПоКредитуЗаймуНаСервере()
	
	НастроитьЭлементДоговораЗайма();
	
	Если Объект.ДоговорКредитаЗайма.Пустая() Тогда
		Элементы.НадписьИнформацияПоКредиту.Заголовок = "<Выберите договор кредита (займа)>";
		Элементы.НадписьОстатокДолгаПоКредиту.Заголовок = "";
		
		Элементы.НадписьИнформацияПоКредиту.ЦветТекста = ЦветаСтиля.ЦветРамки;
		Элементы.НадписьОстатокДолгаПоКредиту.ЦветТекста = ЦветаСтиля.ЦветРамки;
		
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником") Тогда
		ЗаполнитьИнформациюПоЗаймуНаСервере();
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам") Тогда
		ЗаполнитьИнформациюПоКредитуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюПоЗаймуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикПогашенияКредитовИЗаймовСрезПоследних.Период,
		|	ГрафикПогашенияКредитовИЗаймовСрезПоследних.СуммаОсновногоДолга,
		|	ГрафикПогашенияКредитовИЗаймовСрезПоследних.СуммаПроцентов,
		|	ГрафикПогашенияКредитовИЗаймовСрезПоследних.СуммаКомиссии,
		|	ГрафикПогашенияКредитовИЗаймовСрезПоследних.ДоговорКредитаЗайма.ВалютаРасчетов.Наименование КАК ВалютаРасчетовНаименование
		|ИЗ
		|	РегистрСведений.ГрафикПогашенияКредитовИЗаймов.СрезПоследних(&ДатаСрезаПоследних, ДоговорКредитаЗайма = &ДоговорКредитаЗайма) КАК ГрафикПогашенияКредитовИЗаймовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгВалОстаток) КАК ОсновнойДолгВалОстаток,
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.ВалютаРасчетов,
		|	СУММА(РасчетыПоКредитамИЗаймамОстатки.ПроцентыВалОстаток) КАК ПроцентыВалОстаток,
		|	СУММА(РасчетыПоКредитамИЗаймамОстатки.КомиссияВалОстаток) КАК КомиссияВалОстаток,
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.ВалютаРасчетов.Наименование КАК ВалютаРасчетовНаименование
		|ИЗ
		|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(, ДоговорКредитаЗайма = &ДоговорКредитаЗайма) КАК РасчетыПоКредитамИЗаймамОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.ВалютаРасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрафикПогашенияКредитовИЗаймовСрезПервых.Период,
		|	ГрафикПогашенияКредитовИЗаймовСрезПервых.СуммаОсновногоДолга,
		|	ГрафикПогашенияКредитовИЗаймовСрезПервых.СуммаПроцентов,
		|	ГрафикПогашенияКредитовИЗаймовСрезПервых.СуммаКомиссии,
		|	ГрафикПогашенияКредитовИЗаймовСрезПервых.ДоговорКредитаЗайма.ВалютаРасчетов.Наименование КАК ВалютаРасчетовНаименование
		|ИЗ
		|	РегистрСведений.ГрафикПогашенияКредитовИЗаймов.СрезПервых(&ДатаСрезаПоследних, ДоговорКредитаЗайма = &ДоговорКредитаЗайма) КАК ГрафикПогашенияКредитовИЗаймовСрезПервых";
	
	Запрос.УстановитьПараметр("ДатаСрезаПоследних", ?(Объект.Дата = '00010101', НачалоДня(ТекущаяДата()), НачалоДня(Объект.Дата)));
	Запрос.УстановитьПараметр("ДоговорКредитаЗайма", Объект.ДоговорКредитаЗайма);
	
	МРезультатов = Запрос.ВыполнитьПакет();
	
	Если Объект.ДоговорКредитаЗайма.ВидДоговора = Перечисления.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику Тогда
		Множитель = 1;
	Иначе
		Множитель = -1;
	КонецЕсли;
	
	ИнфомрацияПоКредитуЗайму = "";
	
	ВыборкаГрафик = МРезультатов[0].Выбрать();
	ВыборкаГрафикБудущиеМесяцы = МРезультатов[2].Выбрать();
	
	НадписьИнформацияПоКредитуЦветТекста = ЦветаСтиля.ЦветРамки;
	НадписьОстатокДолгаПоКредитуЦветТекста = ЦветаСтиля.ЦветРамки;
	
	Если ВыборкаГрафикБудущиеМесяцы.Следующий() Тогда
		
		Если НачалоМесяца(?(Объект.Дата = '00010101', ТекущаяДата(), Объект.Дата)) = НачалоМесяца(ВыборкаГрафикБудущиеМесяцы.Период) Тогда
			ДатаПлатежа = "" + Формат(ВыборкаГрафикБудущиеМесяцы.Период, "ДФ=dd.MM.yyyy");
		Иначе
			ДатаПлатежа = "" + Формат(ВыборкаГрафикБудущиеМесяцы.Период, "ДФ=dd.MM.yyyy") + " (не в тек. месяце)";
			НадписьИнформацияПоКредитуЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
		КонецЕсли;
			
		НадписьИнформацияПоКредиту = "Дата платежа: "+ДатаПлатежа+". Сумма долга: "+Формат(ВыборкаГрафикБудущиеМесяцы.СуммаОсновногоДолга, "ЧДЦ=2; ЧН=0")+". Сумма %: "+
			Формат(ВыборкаГрафикБудущиеМесяцы.СуммаПроцентов, "ЧДЦ=2; ЧН=0")+
			". Комиссия: "+Формат(ВыборкаГрафикБудущиеМесяцы.СуммаКомиссии, "ЧДЦ=2; ЧН=0")+" ("+ВыборкаГрафикБудущиеМесяцы.ВалютаРасчетовНаименование+")";
		
	ИначеЕсли ВыборкаГрафик.Следующий() Тогда
		
		Если НачалоМесяца(?(Объект.Дата = '00010101', ТекущаяДата(), Объект.Дата)) = НачалоМесяца(ВыборкаГрафик.Период) Тогда
			ДатаПлатежа = "" + Формат(ВыборкаГрафик.Период, "ДФ=dd.MM.yyyy");
		Иначе
			ДатаПлатежа = "" + Формат(ВыборкаГрафик.Период, "ДФ=dd.MM.yyyy") + " (не в тек. месяце)";
			НадписьИнформацияПоКредитуЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
		КонецЕсли;
			
		НадписьИнформацияПоКредиту = "Дата платежа: "+ДатаПлатежа+". Сумма долга: "+Формат(ВыборкаГрафик.СуммаОсновногоДолга, "ЧДЦ=2; ЧН=0")+". Сумма %: "+
			Формат(ВыборкаГрафик.СуммаПроцентов, "ЧДЦ=2; ЧН=0")+
			". Комиссия: "+Формат(ВыборкаГрафик.СуммаКомиссии, "ЧДЦ=2; ЧН=0")+" ("+ВыборкаГрафик.ВалютаРасчетовНаименование+")";
		
	Иначе
		
		НадписьИнформацияПоКредиту = "Дата платежа: <не определена>";
		
	КонецЕсли;
	
	ВыборкаОстатки = МРезультатов[1].Выбрать();
	Если ВыборкаОстатки.Следующий() Тогда
		
		НадписьОстатокДолгаПоКредиту = ИнфомрацияПоКредитуЗайму + "Остаток долга: "+Формат(Множитель * ВыборкаОстатки.ОсновнойДолгВалОстаток, "ЧДЦ=2; ЧН=0")+". Сумма %: "+
			Формат(Множитель * ВыборкаОстатки.ПроцентыВалОстаток, "ЧДЦ=2; ЧН=0")+
			". Комиссия: "+Формат(Множитель * ВыборкаОстатки.КомиссияВалОстаток, "ЧДЦ=2; ЧН=0")+" ("+ВыборкаОстатки.ВалютаРасчетовНаименование+")";
			
		Если Множитель * ВыборкаОстатки.ОсновнойДолгВалОстаток >= 0 И (Множитель * ВыборкаОстатки.ПроцентыВалОстаток < 0 ИЛИ 
			Множитель * ВыборкаОстатки.КомиссияВалОстаток < 0) Тогда
			НадписьОстатокДолгаПоКредитуЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
		КонецЕсли;
		
		Если Множитель * ВыборкаОстатки.ОсновнойДолгВалОстаток < 0 Тогда
			НадписьОстатокДолгаПоКредитуЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
		КонецЕсли;
	Иначе
		
		НадписьОстатокДолгаПоКредиту = ИнфомрацияПоКредитуЗайму + "Остаток долга: <не определен> "
		
	КонецЕсли;
	
	Элементы.НадписьИнформацияПоКредиту.Заголовок = НадписьИнформацияПоКредиту;
	Элементы.НадписьОстатокДолгаПоКредиту.Заголовок = НадписьОстатокДолгаПоКредиту;
	
	Элементы.НадписьИнформацияПоКредиту.ЦветТекста = НадписьИнформацияПоКредитуЦветТекста;
	Элементы.НадписьОстатокДолгаПоКредиту.ЦветТекста = НадписьОстатокДолгаПоКредитуЦветТекста;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюПоКредитуНаСервере()

	НадписьИнформацияПоКредитуЦветТекста = ЦветаСтиля.ЦветРамки;
	НадписьОстатокДолгаПоКредитуЦветТекста = ЦветаСтиля.ЦветРамки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалРасход
		|ПОМЕСТИТЬ ВременнаяТаблицаВыданныеРанееСуммы
		|ИЗ
		|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Обороты(
		|			,
		|			,
		|			,
		|			ДоговорКредитаЗайма = &ДоговорЗаймаСотруднику
		|				И Организация = &Организация) КАК РасчетыПоКредитамИЗаймамОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаВыданныеРанееСуммы.ВалютаРасчетов,
		|	СУММА(ВременнаяТаблицаВыданныеРанееСуммы.ОсновнойДолгВалРасход) КАК ОсновнойДолгВалРасход,
		|	ДоговорЗаймаСотруднику.СуммаДокумента
		|ИЗ
		|	ВременнаяТаблицаВыданныеРанееСуммы КАК ВременнаяТаблицаВыданныеРанееСуммы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДоговорКредитаИЗайма КАК ДоговорЗаймаСотруднику
		|		ПО ВременнаяТаблицаВыданныеРанееСуммы.ВалютаРасчетов = ДоговорЗаймаСотруднику.ВалютаРасчетов
		|ГДЕ
		|	ДоговорЗаймаСотруднику.Ссылка = &ДоговорЗаймаСотруднику
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаВыданныеРанееСуммы.ВалютаРасчетов,
		|	ДоговорЗаймаСотруднику.СуммаДокумента";
	
	Запрос.УстановитьПараметр("ДоговорЗаймаСотруднику", Объект.ДоговорКредитаЗайма);
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Сотрудник", Объект.Подотчетник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		НадписьИнформацияПоКредиту = "Сумма кредита: "+Выборка.СуммаДокумента+" ("+Выборка.ВалютаРасчетов+")";
		
		Если Выборка.СуммаДокумента < Выборка.ОсновнойДолгВалРасход Тогда
			НадписьОстатокДолгаПоКредиту = "Осталось получить: "+(Выборка.СуммаДокумента-Выборка.ОсновнойДолгВалРасход)+" ("+Выборка.ВалютаРасчетов+")"+
				". Уже получено "+Выборка.ОсновнойДолгВалРасход+" ("+Выборка.ВалютаРасчетов+").";
			НадписьОстатокДолгаПоКредитуЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
		ИначеЕсли Выборка.СуммаДокумента = Выборка.ОсновнойДолгВалРасход Тогда
			НадписьОстатокДолгаПоКредиту = "Осталось получить: 0 ("+Выборка.ВалютаРасчетов+")";
			НадписьОстатокДолгаПоКредитуЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
		Иначе
			НадписьОстатокДолгаПоКредиту = "Осталось получить: "+(Выборка.СуммаДокумента-Выборка.ОсновнойДолгВалРасход)+" ("+Выборка.ВалютаРасчетов+")"+
				". Уже получено "+Выборка.ОсновнойДолгВалРасход+" ("+Выборка.ВалютаРасчетов+").";
		КонецЕсли;
	Иначе
		НадписьИнформацияПоКредиту = "Сумма кредита: "+Объект.ДоговорКредитаЗайма.СуммаДокумента+" ("+Объект.ДоговорКредитаЗайма.ВалютаРасчетов+")";
		НадписьОстатокДолгаПоКредиту = "Осталось получить: "+Объект.ДоговорКредитаЗайма.СуммаДокумента+" ("+Объект.ДоговорКредитаЗайма.ВалютаРасчетов+")";
	КонецЕсли;
	
	Элементы.НадписьИнформацияПоКредиту.Заголовок = НадписьИнформацияПоКредиту;
	Элементы.НадписьОстатокДолгаПоКредиту.Заголовок = НадписьОстатокДолгаПоКредиту;
	
	Элементы.НадписьИнформацияПоКредиту.ЦветТекста = НадписьИнформацияПоКредитуЦветТекста;
	Элементы.НадписьОстатокДолгаПоКредиту.ЦветТекста = НадписьОстатокДолгаПоКредитуЦветТекста;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденции(ОчиститьАналитику = Ложь, ЭлементАналитикиНаименование = "")
	
	Если ЭлементАналитикиНаименование = "" Тогда
		ТекЭлементАналитики = Элементы.АналитикаПрочихДоходовИРасходов;
	Иначе
		ТекЭлементАналитики = Элементы[ЭлементАналитикиНаименование];
	КонецЕсли;
	
	ТекЭлементАналитики.Видимость = Ложь;
	
	ЗначенияРеквитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Корреспонденция, "ТипСчета, АналитикаДоходовИРасходов");
	
	Если ЗначенияРеквитов.ТипСчета <> Перечисления.ТипыСчетов.Расходы Тогда
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Прочее Тогда
			
			Если ОчиститьАналитику И ЗначениеЗаполнено(ЗначенияРеквитов.АналитикаДоходовИРасходов) Тогда
				ТекЭлементАналитики.ОграничениеТипа = Новый ОписаниеТипов(ЗначенияРеквитов.АналитикаДоходовИРасходов);
				ТекЭлементАналитики.Заголовок = Строка(ТекЭлементАналитики.ОграничениеТипа);
				Объект.АналитикаПрочихДоходовИРасходов = Новый(ЗначенияРеквитов.АналитикаДоходовИРасходов);
				ТекЭлементАналитики.Доступность = Истина;
				ТекЭлементАналитики.Видимость = Истина;
				ТекЭлементАналитики.ПодсказкаВвода = "";
			ИначеЕсли ЗначениеЗаполнено(ЗначенияРеквитов.АналитикаДоходовИРасходов) Тогда
				ТекЭлементАналитики.ОграничениеТипа = Новый ОписаниеТипов(ЗначенияРеквитов.АналитикаДоходовИРасходов);
				ТекЭлементАналитики.Заголовок = Строка(ТекЭлементАналитики.ОграничениеТипа);
				ТекЭлементАналитики.Доступность = Истина;
				ТекЭлементАналитики.Видимость = Истина;
				ТекЭлементАналитики.ПодсказкаВвода = "";
			Иначе // Очистить и не заполнена аналитика.
				Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
				ТекЭлементАналитики.Заголовок = "Аналитика доходов";
				ТекЭлементАналитики.ПодсказкаВвода = "<Не настроена у этого счета>";
				ТекЭлементАналитики.Доступность = Ложь;
				ТекЭлементАналитики.Видимость = Истина;
			КонецЕсли;
		Иначе
			ТекЭлементАналитики.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьДокументыПланирования();
	
КонецПроцедуры // УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденции()

&НаСервереБезКонтекста
Функция ПолучитьДоговорКредитаЗаймаПоУмолчанию(Документ, Контрагент, Организация, ВидОперации)
	
	МенеджерДокумента = Документы.ДоговорКредитаИЗайма;
	
	СписокВидовДоговоров = Новый СписокЗначений;
	СписокВидовДоговоров.Добавить(?(ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам, 
		Перечисления.ВидыДоговоровКредитаИЗайма.КредитПолученный,
		Перечисления.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику));
	
	ДоговорКредитаЗаймаПоУмолчанию = МенеджерДокумента.ПолучитьДоговорКредитаИЗаймаПоУмолчаниюПоОрганизацииВидуДоговора(Контрагент, Организация, СписокВидовДоговоров);
	
	Возврат ДоговорКредитаЗаймаПоУмолчанию;
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыВыбораПоУчетуПрочихРасчетовНаСервереДляЭлементаСчета()

	Элемент = Элементы.РасчетыПрочиеКорреспонденция;
	
	ПараметрыВыбораЭлемента = Новый Массив;
	ОтборПоТипуСчета = Новый Массив;
	
	Для Каждого Параметр Из Элемент.ПараметрыВыбора Цикл
		Если Параметр.Имя = "Отбор.ТипСчета" Тогда
			ОтборПоТипуСчета.Добавить(Перечисления.ТипыСчетов.Дебиторы);
			ОтборПоТипуСчета.Добавить(Перечисления.ТипыСчетов.Кредиторы);
			ОтборПоТипуСчета.Добавить(Перечисления.ТипыСчетов.Капитал);
			
			ПараметрыВыбораЭлемента.Добавить(Новый ПараметрВыбора("Отбор.ТипСчета", Новый ФиксированныйМассив(ОтборПоТипуСчета)));
		Иначе
			ПараметрыВыбораЭлемента.Добавить(Параметр);
		КонецЕсли;
	КонецЦикла;
	
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЭлемента);
	
	//+++ Дмгг
	ЭлементРегл = Элементы.РасчетыПрочиеКорреспонденцияРегл;
	
	ПараметрыВыбораЭлементаРегл = Новый Массив;
	ОтборПоТипуСчетаРегл = Новый Массив;
	
	Для Каждого Параметр Из Элемент.ПараметрыВыбора Цикл
		Если Параметр.Имя = "Отбор.ТипСчета" Тогда
			ОтборПоТипуСчетаРегл.Добавить(Перечисления.ТипыСчетов.Дебиторы);
			ОтборПоТипуСчетаРегл.Добавить(Перечисления.ТипыСчетов.Кредиторы);
			ОтборПоТипуСчетаРегл.Добавить(Перечисления.ТипыСчетов.Капитал);
			
			ПараметрыВыбораЭлементаРегл.Добавить(Новый ПараметрВыбора("Отбор.ТипСчета", Новый ФиксированныйМассив(ОтборПоТипуСчетаРегл)));
		Иначе
			ПараметрыВыбораЭлементаРегл.Добавить(Параметр);
		КонецЕсли;
	КонецЦикла;
	
	ЭлементРегл.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЭлементаРегл);
	//--- Дмгг
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораПоМетаданнымДляЭлементаСчета()

	Элемент = Элементы.РасчетыПрочиеКорреспонденция;
	
	ПараметрыВыбораЭлемента = Новый Массив;
	ОтборПоТипуСчета = Новый Массив;
	
	ПараметрыВыбораИзМетаданных = Объект.Ссылка.Метаданные().Реквизиты.Корреспонденция.ПараметрыВыбора;
	Для Каждого Параметр Из ПараметрыВыбораИзМетаданных Цикл
		ПараметрыВыбораЭлемента.Добавить(Параметр);
	КонецЦикла;
	
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЭлемента);
	
	//+++ Дмгг
	ЭлементРегл = Элементы.РасчетыПрочиеКорреспонденцияРегл;
	
	ПараметрыВыбораЭлементаРегл = Новый Массив;
	ОтборПоТипуСчетаРегл = Новый Массив;
	
	ПараметрыВыбораИзМетаданныхРегл = Объект.Ссылка.Метаданные().Реквизиты.Корреспонденция.ПараметрыВыбора;
	Для Каждого Параметр Из ПараметрыВыбораИзМетаданныхРегл Цикл
		ПараметрыВыбораЭлементаРегл.Добавить(Параметр);
	КонецЦикла;
	
	ЭлементРегл.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЭлементаРегл);
	//--- Дмгг
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьВидимостьНастроекУчетаВНалогообложении()
	
	Если РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Объект.Организация) Тогда
		Элементы.ГруппаУчетВНУ.Видимость = Ложь;
		
		Возврат;
	Иначе
		Элементы.ГруппаУчетВНУ.Видимость = Истина;
	КонецЕсли;
	
	СистемаНалогообложенияСтруктура = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(Объект.Организация, Объект.Дата);
	ПлательщикУСН =  СистемаНалогообложенияСтруктура.ПлательщикУСН;
	ПрименяетсяПатент = СистемаНалогообложенияСтруктура.ПрименяетсяПатент;
	
	Если Не ПлательщикУСН И Не ПрименяетсяПатент Тогда
		Элементы.ГруппаУчетВНУ.Видимость = Ложь;
	Иначе
		Если Не ПлательщикУСН Тогда
			Элементы.УчитыватьВНУ.Видимость = Ложь;
		Иначе
			Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя
				ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика
				ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Налоги 
				ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам
				ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Прочее
				ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты
				ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты Тогда
				Элементы.УчитыватьВНУ.Видимость = Истина;
			Иначе
				Элементы.УчитыватьВНУ.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
			
		Если Не ПрименяетсяПатент Тогда
			Элементы.Патент.Видимость = Ложь;
		Иначе
			Элементы.Патент.Доступность = Не Объект.УчитыватьВНУ ИЛИ НЕ Элементы.УчитыватьВНУ.Видимость;
			// Определяем теперь видимость патента от вида операций 
			Если (Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя
				ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам
				ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Прочее
				ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты
				ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты) Тогда
				Элементы.Патент.Видимость = Истина;
			Иначе
				Элементы.Патент.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если Элементы.Патент.Видимость ИЛИ Элементы.УчитыватьВНУ.Видимость Тогда
			Элементы.ГруппаУчетВНУ.Видимость = Истина;
		Иначе
			Элементы.ГруппаУчетВНУ.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиУчетаВНалогообложении()
	
	ОпределитьВидимостьНастроекУчетаВНалогообложении();
	Если ЗначениеЗаполнено(Объект.Статья) Тогда
		Объект.УчитыватьВНУ = СтатьяУчитываетсяВНУ(Объект.Статья, Объект.Организация, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

//+++ Дмгг
Процедура УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденцииРегл(ОчиститьАналитику = Ложь, ЭлементАналитикиНаименование = "")
	
	Если ЭлементАналитикиНаименование = "" Тогда
		ТекЭлементАналитики = Элементы.АналитикаПрочихДоходовИРасходов;
	Иначе
		ТекЭлементАналитики = Элементы[ЭлементАналитикиНаименование];
	КонецЕсли;
	
	ТекЭлементАналитики.Видимость = Ложь;
	
	ЗначенияРеквитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.КорреспонденцияРегл, "ТипСчета, АналитикаДоходовИРасходов");
	
	Если ЗначенияРеквитов.ТипСчета <> Перечисления.ТипыСчетов.Расходы Тогда
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Прочее Тогда
			
			Если ОчиститьАналитику И ЗначениеЗаполнено(ЗначенияРеквитов.АналитикаДоходовИРасходов) Тогда
				ТекЭлементАналитики.ОграничениеТипа = Новый ОписаниеТипов(ЗначенияРеквитов.АналитикаДоходовИРасходов);
				ТекЭлементАналитики.Заголовок = Строка(ТекЭлементАналитики.ОграничениеТипа);
				Объект.АналитикаПрочихДоходовИРасходов = Новый(ЗначенияРеквитов.АналитикаДоходовИРасходов);
				ТекЭлементАналитики.Доступность = Истина;
				ТекЭлементАналитики.Видимость = Истина;
				ТекЭлементАналитики.ПодсказкаВвода = "";
			ИначеЕсли ЗначениеЗаполнено(ЗначенияРеквитов.АналитикаДоходовИРасходов) Тогда
				ТекЭлементАналитики.ОграничениеТипа = Новый ОписаниеТипов(ЗначенияРеквитов.АналитикаДоходовИРасходов);
				ТекЭлементАналитики.Заголовок = Строка(ТекЭлементАналитики.ОграничениеТипа);
				ТекЭлементАналитики.Доступность = Истина;
				ТекЭлементАналитики.Видимость = Истина;
				ТекЭлементАналитики.ПодсказкаВвода = "";
			Иначе // Очистить и не заполнена аналитика.
				Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
				ТекЭлементАналитики.Заголовок = "Аналитика доходов";
				ТекЭлементАналитики.ПодсказкаВвода = "<Не настроена у этого счета>";
				ТекЭлементАналитики.Доступность = Ложь;
				ТекЭлементАналитики.Видимость = Истина;
			КонецЕсли;
		Иначе
			ТекЭлементАналитики.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьДокументыПланирования();
	
КонецПроцедуры // УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденцииРегл()

#КонецОбласти

#КонецОбласти

#Область ОбменСGoogle

&НаКлиенте
Процедура Подключаемый_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбменСGoogleКлиент.Подключаемый_ОбработкаВыбора(
	ЭтаФорма,
	Элемент,
	ВыбранноеЗначение,
	СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ОбменСGoogleКлиент.Подключаемый_АвтоПодбор(
	ЭтаФорма,
	Элемент,
	Текст,
	ДанныеВыбора,
	Параметры,
	Ожидание,
	СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область Разобрать

&НаСервере
Процедура ПриИзмененииВТаблицеДолгов(ИмяКолонки, ТекущаяСтрокаДолговИдентификатор, УстанавливатьЗачитываемуюСумму = Истина)
	
	ТекущаяСтрокаДолгов = ТаблицаДолгов.НайтиПоИдентификатору(ТекущаяСтрокаДолговИдентификатор);
	
	ТекущаяСтрокаРасшифровки = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ТекущаяСтрокаДолгов.ИдентификаторСтрокиРасшифровкиПлатежа);
	Если ТекущаяСтрокаРасшифровки = Неопределено Тогда
		ТекущаяСтрокаРасшифровки = Объект.РасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрокаРасшифровки, ТекущаяСтрокаДолгов);
	КонецЕсли;
	
	Если УстанавливатьЗачитываемуюСумму Тогда
		Если СуммаПлатежаАванс = 0 И ИсходнаяСуммаРавнаНулю Тогда
			ТекущаяСтрокаДолгов.Зачесть = ТекущаяСтрокаДолгов.ДолгВалПлатежа;
		Иначе
			ТекущаяСтрокаДолгов.Зачесть = Мин(СуммаПлатежаАванс, ТекущаяСтрокаДолгов.ДолгВалПлатежа);
		КонецЕсли;
	КонецЕсли;
	
	// Алгоритмы работы с суммами и курсом должны быть одинаковы в обоих режимах: "С помощником" и "Вручную".
	Если ИмяКолонки = "Зачесть" Или ИмяКолонки = "Выбран" Тогда
		
		ПересчитатьСуммуРасчетовВСпискеДолгов(ТекущаяСтрокаРасшифровки, 
			ТекущаяСтрокаДолгов, 
			ИмяКолонки, 
			ТекущаяСтрокаДолгов.ДолгВалДоговора, 
			ТекущаяСтрокаДолгов.ДолгВалПлатежа
		);
		
		ТекущаяСтрокаДолгов.ДолгВалПлатежа = РассчитатьСуммуДолгаВВалютеПлатежа(
			ТекущаяСтрокаДолгов.ДолгВалДоговора,
			ТекущаяСтрокаДолгов.Курс,
			ТекущаяСтрокаДолгов.Кратность,
			ТекущаяСтрокаДолгов.Договор
		);
		
	ИначеЕсли ИмяКолонки = "СуммаРасчетов" Тогда
		
		ПересчитатьСуммуПлатежаВСпискеДолгов(ТекущаяСтрокаРасшифровки, ТекущаяСтрокаДолгов, ИмяКолонки);
		
		ТекущаяСтрокаДолгов.ДолгВалПлатежа = РассчитатьСуммуДолгаВВалютеПлатежа(
			ТекущаяСтрокаДолгов.ДолгВалДоговора,
			ТекущаяСтрокаДолгов.Курс,
			ТекущаяСтрокаДолгов.Кратность,
			ТекущаяСтрокаДолгов.Договор
		);
		
	ИначеЕсли ИмяКолонки = "СтавкаНДС" Тогда
		
		ТекущаяСтрокаРасшифровки.СтавкаНДС = ТекущаяСтрокаДолгов.СтавкаНДС;
		РассчитатьСуммуНДСНаСервере(ТекущаяСтрокаРасшифровки);
		
	ИначеЕсли ИмяКолонки = "Курс" ИЛИ ИмяКолонки = "Кратность" Тогда
		
		Если ТекущаяСтрокаДолгов.СуммаРасчетов <> 0 ИЛИ ТекущаяСтрокаДолгов.Зачесть <> 0 Тогда
			ТекущаяСтрокаРасшифровки.Курс = ТекущаяСтрокаДолгов.Курс;
			ТекущаяСтрокаРасшифровки.Кратность = ТекущаяСтрокаДолгов.Кратность;
			
			РассчитатьСуммуПлатежаНаСервере(ТекущаяСтрокаРасшифровки, ИмяКолонки);
			ТекущаяСтрокаДолгов.Зачесть = ТекущаяСтрокаРасшифровки.СуммаПлатежа;
			
			// На случай, если пользователь обнулил курс или кратность.
			ТекущаяСтрокаДолгов.Курс = ТекущаяСтрокаРасшифровки.Курс;
			ТекущаяСтрокаДолгов.Кратность = ТекущаяСтрокаРасшифровки.Кратность;
			
			ТекущаяСтрокаДолгов.ДолгВалПлатежа = РассчитатьСуммуДолгаВВалютеПлатежа(
				ТекущаяСтрокаДолгов.ДолгВалДоговора,
				ТекущаяСтрокаДолгов.Курс,
				ТекущаяСтрокаДолгов.Кратность,
				ТекущаяСтрокаДолгов.Договор
			);
		КонецЕсли;
		
	ИначеЕсли ИмяКолонки = "СчетНаОплату" Тогда
		
		ТекущаяСтрокаРасшифровки.СчетНаОплату = ТекущаяСтрокаДолгов.СчетНаОплату;
		СтуркутраДанных = ПолучитьДанныеСчетаНаОплатуПриИзменении(ТекущаяСтрокаДолгов.СчетНаОплату);
		ТекущаяСтрокаДолгов.СуммаСчета = СтуркутраДанных.Сумма;
		ТекущаяСтрокаДолгов.ВалютаСчета = СтуркутраДанных.Валюта;
		
	КонецЕсли;
	
	ТекущаяСтрокаДолгов.ИдентификаторСтрокиРасшифровкиПлатежа = ТекущаяСтрокаРасшифровки.ПолучитьИдентификатор();
	ТекущаяСтрокаДолгов.ЗачестьВыбрано = ?(ТекущаяСтрокаДолгов.Выбран, ТекущаяСтрокаДолгов.Зачесть, 0);
	Если ИсходнаяСуммаРавнаНулю Тогда
		Объект.СуммаДокумента = ТаблицаДолгов.Итог("ЗачестьВыбрано");
	КонецЕсли;
	ПересчитатьИтогиПриИзмененииАвансаНаСервере(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммаВСтрокеАванса()
	
	СтрокаАванса = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ИдентификаторСтрокиАванса);
	ТекущаяСуммаАванса = Объект.СуммаДокумента - ТаблицаДолгов.Итог("ЗачестьВыбрано");
	Если СтрокаАванса = Неопределено И ТекущаяСуммаАванса > 0 Тогда
		СтрокаАванса = ДобавитьСтрокуАвансаНаСервере();
	КонецЕсли;
	Если СтрокаАванса <> Неопределено Тогда
		СтрокаАванса.СуммаПлатежа = ТекущаяСуммаАванса;
		СтрокаАванса.Аванс = СтрокаАванса.СуммаПлатежа;
		
		РасшифровкаПлатежаСуммаПлатежаПриИзмененииЗавершениеНаСервере(СтрокаАванса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыДоговоровЗачетаДолгов(ПриСозданииНаСервере = Ложь)
	
	Если ПриСозданииНаСервере Тогда
		Для Каждого ТекущаяСтрокаДоговора Из Объект.ДоговорыАвтоЗачетаДолгов Цикл
			//+++ Дмгг
			Если ИспользоватьПроекты Тогда 
				ДобавитьДоговорЗачетаДолговСПроектамиНажатиеНаСервере(ТекущаяСтрокаДоговора);
			Иначе
				ДобавитьДоговорЗачетаДолговНажатиеНаСервере(ТекущаяСтрокаДоговора);
			КонецЕсли;
			//--- Дмгг
		КонецЦикла;
	Иначе
		//+++ Дмгг
		//ТЗДоговоров = Объект.РасшифровкаПлатежа.Выгрузить(, "Договор");
		//ТЗДоговоров.Свернуть("Договор");
		Если ИспользоватьПроекты Тогда 
			ТЗДоговоров = Объект.РасшифровкаПлатежа.Выгрузить(, "Договор, Проект");
			ТЗДоговоров.Свернуть("Договор, Проект");
		Иначе 
			ТЗДоговоров = Объект.РасшифровкаПлатежа.Выгрузить(, "Договор");
			ТЗДоговоров.Свернуть("Договор");
		КонецЕсли;
		//--- Дмгг
		
		МассивЭлементовДляУдаления = Новый Массив;
		Для Каждого ЭлементДобавленногоДоговора Из Элементы.ГруппаДобавленныхДоговоровСлева.ПодчиненныеЭлементы Цикл
			МассивЭлементовДляУдаления.Добавить(ЭлементДобавленногоДоговора);
		КонецЦикла;
		Для Каждого ЭлементДобавленногоДоговора Из Элементы.ГруппаДобавленныхДоговоровСправа.ПодчиненныеЭлементы Цикл
			МассивЭлементовДляУдаления.Добавить(ЭлементДобавленногоДоговора);
		КонецЦикла;
		
		Для Каждого ЭлементДобавленногоДоговора Из МассивЭлементовДляУдаления Цикл
			Элементы.Удалить(ЭлементДобавленногоДоговора);
		КонецЦикла;
		Элементы.ГруппаДобавленныхДоговоровСправа.Видимость = Ложь;
		
		Если ТЗДоговоров.Количество() = 0 Тогда
			Объект.ДоговорыАвтоЗачетаДолгов.Очистить();
		Иначе
			Объект.ДоговорыАвтоЗачетаДолгов.Очистить();
			
			ЭтоПерваяСтрока = Истина;
			Для Каждого ДоговорЗачетаДолгов Из ТЗДоговоров Цикл
				Если ДоговорЗачетаДолгов.Договор.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = Объект.ДоговорыАвтоЗачетаДолгов.Добавить();
				НоваяСтрока.Договор = ДоговорЗачетаДолгов.Договор;
				
				//+++ Дмгг
				Если ИспользоватьПроекты Тогда 
					НоваяСтрока.Проект = ДоговорЗачетаДолгов.Проект;
				КонецЕсли;
				//--- Дмгг
				
				Если ЭтоПерваяСтрока Тогда
					ЭтоПерваяСтрока = Ложь;
					НоваяСтрока.СуммаПлатежа = Объект.СуммаДокумента;
				КонецЕсли;
				
				//+++ Дмгг
				Если ИспользоватьПроекты Тогда 
					ДобавитьДоговорЗачетаДолговСПроектамиНажатиеНаСервере();
				Иначе
					ДобавитьДоговорЗачетаДолговНажатиеНаСервере();
				КонецЕсли;
				//--- Дмгг
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// На случай, когда в расшифровки платежа только строки с незаполненым договором.
	Если Объект.ДоговорыАвтоЗачетаДолгов.Количество() = 0 Тогда
		НоваяСтрока = Объект.ДоговорыАвтоЗачетаДолгов.Добавить();
		ДоговорПоУмолчанию = ПолучитьДоговорПоУмолчанию(Объект.Ссылка, Объект.Контрагент, Объект.Организация, Объект.ВидОперации);
		НоваяСтрока.Договор = ДоговорПоУмолчанию;
		НоваяСтрока.СуммаПлатежа = Объект.СуммаДокумента;
		
		//+++ Дмгг
		Если ИспользоватьПроекты Тогда 
			ДобавитьДоговорЗачетаДолговСПроектамиНажатиеНаСервере();
		Иначе
			ДобавитьДоговорЗачетаДолговНажатиеНаСервере();
		КонецЕсли;
		//--- Дмгг
	КонецЕсли;
	
	РассчитатьСуммуНДСПоУмолчаниюНаСервере();
	СформироватьЗаголовокГруппыЗачетаДолгов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыНовойСтрокиТаблицыДолгов(НоваяСтрока, ТекущаяСтрокаРасшифровки)
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрокаРасшифровки);
	НоваяСтрока.КурсИсходный = НоваяСтрока.Курс;
	НоваяСтрока.Зачесть = ТекущаяСтрокаРасшифровки.СуммаПлатежа;
	НоваяСтрока.ЗачестьВыбрано = ТекущаяСтрокаРасшифровки.СуммаПлатежа;
	НоваяСтрока.Выбран = Истина;
	НоваяСтрока.ИдентификаторСтрокиРасшифровкиПлатежа = ТекущаяСтрокаРасшифровки.ПолучитьИдентификатор();
	Если ЗначениеЗаполнено(ТекущаяСтрокаРасшифровки.Документ) Тогда
		НоваяСтрока.ДатаДокумента = ТекущаяСтрокаРасшифровки.Документ.Дата;
		Попытка
			Если ТипЗнч(ТекущаяСтрокаРасшифровки.Документ) = Тип("ДокументСсылка.ОтчетПереработчика") Тогда
				НоваяСтрока.СуммаДокумента = ТекущаяСтрокаРасшифровки.Документ.Сумма;
			ИначеЕсли ТипЗнч(ТекущаяСтрокаРасшифровки.Документ) = Тип("ДокументСсылка.Взаимозачет") Тогда
				НоваяСтрока.СуммаДокумента = ТекущаяСтрокаРасшифровки.Документ.СуммаУчета;
			Иначе
				НоваяСтрока.СуммаДокумента = ТекущаяСтрокаРасшифровки.Документ.СуммаДокумента;
			КонецЕсли;
			Если ТипЗнч(ТекущаяСтрокаРасшифровки.Документ) = Тип("ДокументСсылка.РасходИзКассы") ИЛИ
				ТипЗнч(ТекущаяСтрокаРасшифровки.Документ) = Тип("ДокументСсылка.РасходСоСчета") Тогда
				НоваяСтрока.ВалютаДокумента = ТекущаяСтрокаРасшифровки.Документ.ВалютаДенежныхСредств.СимвольноеПредставление;
			ИначеЕсли ТипЗнч(ТекущаяСтрокаРасшифровки.Документ) = Тип("ДокументСсылка.Взаимозачет") Тогда
				НоваяСтрока.ВалютаДокумента = Константы.ВалютаУчета.Получить().СимвольноеПредставление;
			Иначе
				НоваяСтрока.ВалютаДокумента = ТекущаяСтрокаРасшифровки.Документ.ВалютаДокумента.СимвольноеПредставление;
			КонецЕсли;
		Исключение
			// Пользователю об этом сообщать не будем.
		КонецПопытки;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущаяСтрокаРасшифровки.Заказ) Тогда
		НоваяСтрока.ДатаЗаказа = ТекущаяСтрокаРасшифровки.Заказ.Дата;
		НоваяСтрока.ВалютаЗаказа = ТекущаяСтрокаРасшифровки.Заказ.ВалютаДокумента;
		НоваяСтрока.СуммаЗаказа = ТекущаяСтрокаРасшифровки.Заказ.СуммаДокумента;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущаяСтрокаРасшифровки.Договор) Тогда
		НоваяСтрока.ВалютаДоговора = ТекущаяСтрокаРасшифровки.Договор.ВалютаРасчетов.СимвольноеПредставление;
		НоваяСтрока.ВалютаДоговораСсылка = ТекущаяСтрокаРасшифровки.Договор.ВалютаРасчетов;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущаяСтрокаРасшифровки.СчетНаОплату) Тогда
		НоваяСтрока.СуммаСчета = ТекущаяСтрокаРасшифровки.СчетНаОплату.СуммаДокумента;
		НоваяСтрока.ВалютаСчета = ТекущаяСтрокаРасшифровки.СчетНаОплату.ВалютаДокумента;
	КонецЕсли;
	НоваяСтрока.ДатаДокБольшеДатыДокумента = (Объект.Контрагент.ВестиРасчетыПоДокументам И КонецДня(НоваяСтрока.ДатаДокумента) > КонецДня(НоваяСтрока.ДатаЗаказа));
	НоваяСтрока.ДатаЗаказаБольшеДатыДокумента = НЕ Объект.Контрагент.ВестиРасчетыПоДокументам И Объект.Контрагент.ВестиРасчетыПоЗаказам И
		КонецДня(НоваяСтрока.ДатаДокумента) > КонецДня(НоваяСтрока.ДатаЗаказа);
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьРасшифровкуПоТаблицеДолгов()
	
	Если Объект.РасшифровкаПлатежа.Количество() = 0 ИЛИ
		Объект.Контрагент.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем расшифровку платежа.
	ЕстьСтрокаАванса = Ложь;
	ИдентификаторСтрокиАванса = "";
	МассивУдаляемыхСтрок = Новый Массив;
	
	Для Каждого ТекущаяСтрокаРасшифровки Из Объект.РасшифровкаПлатежа Цикл
		Если ТекущаяСтрокаРасшифровки.ПризнакАванса Тогда
			Если Не ЕстьСтрокаАванса Тогда
				
				ЕстьСтрокаАванса = Истина;
				Объект.ДоговорДляЗачетаАвансаСПомощником = ТекущаяСтрокаРасшифровки.Договор;
				ИдентификаторСтрокиАванса = ТекущаяСтрокаРасшифровки.ПолучитьИдентификатор();
				
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		// Строки, в которых не выбраны данные для идентификации строк в помощнике переходят в аванс.
		Если ТекущаяСтрокаРасшифровки.Договор.Пустая() ИЛИ
			(Объект.Контрагент.ВестиРасчетыПоДокументам И НЕ ЗначениеЗаполнено(ТекущаяСтрокаРасшифровки.Документ)) ИЛИ
			(ТекущаяСтрокаРасшифровки.СуммаРасчетов = 0 И ТекущаяСтрокаРасшифровки.СуммаПлатежа = 0) Тогда
			МассивУдаляемыхСтрок.Добавить(ТекущаяСтрокаРасшифровки);
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Договор", ТекущаяСтрокаРасшифровки.Договор);
		Если Объект.Контрагент.ВестиРасчетыПоДокументам Тогда
			ПараметрыОтбора.Вставить("Документ", ТекущаяСтрокаРасшифровки.Документ);
		КонецЕсли;
		Если Объект.Контрагент.ВестиРасчетыПоЗаказам Тогда
			ПараметрыОтбора.Вставить("Заказ", ?(ЗначениеЗаполнено(ТекущаяСтрокаРасшифровки.Заказ), ТекущаяСтрокаРасшифровки.Заказ, Документы.ЗаказПокупателя.ПустаяСсылка()));
		КонецЕсли;
		
		МассивСтрок = ТаблицаДолгов.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество() > 0 Тогда
			ТекущаяСтрокаДолгов = МассивСтрок[0];
			
			ТекущаяСтрокаДолгов.Зачесть = ТекущаяСтрокаРасшифровки.СуммаПлатежа;
			ТекущаяСтрокаДолгов.Выбран = (ТекущаяСтрокаРасшифровки.СуммаПлатежа > 0);
			ТекущаяСтрокаДолгов.ЗачестьВыбрано = ?(ТекущаяСтрокаДолгов.Выбран, ТекущаяСтрокаРасшифровки.СуммаПлатежа, 0);
			
			ЗаполнитьЗначенияСвойств(
				МассивСтрок[0],
				ТекущаяСтрокаРасшифровки,
				"СтавкаНДС, СуммаРасчетов, Курс, Кратность, СчетНаОплату");
				
			МассивСтрок[0].ИдентификаторСтрокиРасшифровкиПлатежа = ТекущаяСтрокаРасшифровки.ПолучитьИдентификатор();
			
			// Курс в расшифровке может отличаться от курса валюты на дату документа.
			// Нужно обновить информацию о сумме долга в валюте платежа.
			ТекущаяСтрокаДолгов.ДолгВалПлатежа = РассчитатьСуммуДолгаВВалютеПлатежа(
				ТекущаяСтрокаДолгов.ДолгВалДоговора,
				ТекущаяСтрокаДолгов.Курс,
				ТекущаяСтрокаДолгов.Кратность,
				ТекущаяСтрокаДолгов.Договор
			);
			
		Иначе
			НоваяСтрока = ТаблицаДолгов.Добавить();
			ЗаполнитьРеквизитыНовойСтрокиТаблицыДолгов(НоваяСтрока, ТекущаяСтрокаРасшифровки);
		КонецЕсли;
	КонецЦикла;
	
	// Сумму удаляемых строк перенесем в аванс.
	ДельтаСуммыАванса = 0;
	СчУдаляемыхСтрок = МассивУдаляемыхСтрок.Количество();
	Пока СчУдаляемыхСтрок > 0 Цикл
		УдаляемаяСтрока = МассивУдаляемыхСтрок[СчУдаляемыхСтрок - 1];
		ДельтаСуммыАванса = ДельтаСуммыАванса + УдаляемаяСтрока.СуммаПлатежа;
		Объект.РасшифровкаПлатежа.Удалить(Объект.РасшифровкаПлатежа.Индекс(УдаляемаяСтрока));
		СчУдаляемыхСтрок = СчУдаляемыхСтрок - 1;
	КонецЦикла;
	
	// Добавим строку аванса, если это нужно. В этом случае аванс = 0.
	Если НЕ ЕстьСтрокаАванса Тогда
		СтрокаАванса = Объект.РасшифровкаПлатежа.Добавить();
		СтрокаАванса.ПризнакАванса = Истина;
		СтрокаАванса.СуммаПлатежа = ДельтаСуммыАванса;
		//СтрокаАванса.Аванс = ДельтаСуммыАванса;
		СтрокаАванса.Договор = Объект.ДоговорДляЗачетаАвансаСПомощником;
		РасшифровкаПлатежаСуммаПлатежаПриИзмененииЗавершениеНаСервере(СтрокаАванса);
		
		ИдентификаторСтрокиАванса = СтрокаАванса.ПолучитьИдентификатор();
	ИначеЕсли ДельтаСуммыАванса > 0 Тогда
		СтрокаАванса = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ИдентификаторСтрокиАванса);
		СтрокаАванса.СуммаПлатежа = СтрокаАванса.СуммаПлатежа + ДельтаСуммыАванса;
		РасшифровкаПлатежаСуммаПлатежаПриИзмененииЗавершениеНаСервере(СтрокаАванса);
	КонецЕсли;
	
	ТаблицаДолгов.Сортировать("ДатаДокумента, Документ, ДатаЗаказа, Заказ, Договор");
	
	// Найдём первую строку, где есть долг и сделаем ее текущей.
	Для Каждого ТекущаяСтрока Из ТаблицаДолгов Цикл
		Если ТекущаяСтрока.СуммаРасчетов > 0 ИЛИ ТекущаяСтрока.Зачесть > 0 Тогда
			Элементы.ТаблицаДолгов.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьСтрокуАвансаНаСервере()
	
	НоваяСтрока = Объект.РасшифровкаПлатежа.Добавить();
	НоваяСтрока.ПризнакАванса = Истина;
	НоваяСтрока.СуммаПлатежа = Объект.СуммаДокумента;
	НоваяСтрока.Аванс = Объект.СуммаДокумента;
	НоваяСтрока.Договор = Объект.ДоговорДляЗачетаАвансаСПомощником;
	РасшифровкаПлатежаСуммаПлатежаПриИзмененииЗавершениеНаСервере(НоваяСтрока);
	
	ИдентификаторСтрокиАванса = НоваяСтрока.ПолучитьИдентификатор();
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Функция ДобавитьСтрокуАвансаНаКлиенте()
	
	НоваяСтрока = Объект.РасшифровкаПлатежа.Добавить();
	НоваяСтрока.ПризнакАванса = Истина;
	НоваяСтрока.СуммаПлатежа = Объект.СуммаДокумента;
	НоваяСтрока.Аванс = Объект.СуммаДокумента;
	Если Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиАвтоматически Тогда
		Если Объект.ДоговорыАвтоЗачетаДолгов.Количество() > 0 Тогда
			НоваяСтрока.Договор = Объект.ДоговорыАвтоЗачетаДолгов[0].Договор;
		КонецЕсли;
	Иначе
		НоваяСтрока.Договор = Объект.ДоговорДляЗачетаАвансаСПомощником;
	КонецЕсли;
	РасшифровкаПлатежаСуммаПлатежаПриИзмененииЗавершениеНаКлиенте(НоваяСтрока);
	
	ИдентификаторСтрокиАванса = НоваяСтрока.ПолучитьИдентификатор();
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаСервере
Процедура УдалитьСтрокуСАвансомИСтрокиСНулевымиЗначениями()
	
	Если СуммаПлатежаАванс = 0 И Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником Тогда
		//Элементы.СтраницыИтоги.ТекущаяСтраница = Элементы.СтраницаРаспределениеСПомощником Тогда
		СтрокаАванса = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ИдентификаторСтрокиАванса);
		Если СтрокаАванса <> Неопределено Тогда
			Объект.РасшифровкаПлатежа.Удалить(СтрокаАванса.НомерСтроки - 1);
		КонецЕсли;
		ИдентификаторСтрокиАванса = "";
	КонецЕсли;
	
	Индекс = Объект.РасшифровкаПлатежа.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ТекущаяСтрока = Объект.РасшифровкаПлатежа[Индекс];
		Если ТекущаяСтрока.СуммаРасчетов = 0 И ТекущаяСтрока.СуммаПлатежа = 0 Тогда
			Объект.РасшифровкаПлатежа.Удалить(Индекс);
		КонецЕсли;
		
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыРаспределенияДолговНаСервере(ПриСозданииНаСервере = Ложь)
	
	Если Объект.ВидОперации <> Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя Тогда
		
		Элементы.ВариантЗаполненияРасшифровки.Видимость = Ложь;
		Элементы.ДекорацияРазделитель6.Видимость = Ложь;
		Элементы.КоманднаяПанельПомощника.Видимость = Ложь;
		Элементы.ГруппаФильтры.Видимость = Ложь;
		Элементы.КоманднаяПанельРучногоЗаполнения.Видимость = Истина;
		Элементы.СтраницыРасчетовСКонтрагентомПодвал.ТекущаяСтраница = Элементы.ПодвалВручную;
		
	Иначе
		
		//**********************************************************************************************************
		// Настроим видимость.
		Элементы.ВариантЗаполненияРасшифровки.Видимость = Истина;
		Элементы.ДекорацияРазделитель6.Видимость = Истина;
		Элементы.КоманднаяПанельПомощника.Видимость = Истина;
		Элементы.ГруппаФильтры.Видимость = Ложь;
		
		// При вводе на основании заполним информацию о договре аванса из первой строки расшифровки платежа.
		Если ПриСозданииНаСервере И Объект.Ссылка.Пустая() И Объект.ДоговорДляЗачетаАвансаСПомощником.Пустая() И Параметры.Свойство("Основание") Тогда
			Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
				Объект.ДоговорДляЗачетаАвансаСПомощником = Объект.РасшифровкаПлатежа[0].Договор;
			Иначе
				Объект.ДоговорДляЗачетаАвансаСПомощником = ПолучитьДоговорПоУмолчанию(Объект.Ссылка, Объект.Контрагент, Объект.Организация, Объект.ВидОперации);
			КонецЕсли;
		КонецЕсли;
		
		//**********************************************************************************************************
		// Автоматическое заполнение.
		Если Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиАвтоматически Тогда
			
			// Удалим строку с авансом, если он = 0, и строки с нулевыми суммами.
			Если Элементы.СтраницыРасчетовСКонтрагентом.ТекущаяСтраница = Элементы.СтраницаЗаполнениеСПомощником Тогда
				УдалитьСтрокуСАвансомИСтрокиСНулевымиЗначениями();
			КонецЕсли;
			
			// Заполнение элементов
			СоздатьЭлементыДоговоровЗачетаДолгов(ПриСозданииНаСервере);
			
			//**********************************************************************************************************
			// Настройка видимости и заголовков
			Элементы.КоманднаяПанельПомощника.Видимость = Ложь;
			Элементы.КоманднаяПанельРучногоЗаполнения.Видимость = Ложь;
			
			//Элементы.СуммаПлатежаАванс.Видимость = Ложь;
			Элементы.СуммаДокумента.КнопкаВыпадающегоСписка = Истина;
			
			//Элементы.СтраницыИтоги.ТекущаяСтраница = Элементы.СтраницаРаспределениеАвтоматическое;
			Элементы.СтраницыРасчетовСКонтрагентом.ТекущаяСтраница = Элементы.СтраницаАвтоматическоеЗаполнение;
			Элементы.СтраницыРасчетовСКонтрагентомПодвал.ТекущаяСтраница = Элементы.ПодвалАвто;
			
		//**********************************************************************************************************
		// Заполнение с помощником.
		ИначеЕсли Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником Тогда
			
			// Заполнение элементов
			//Если ПриСозданииНаСервере И Не Объект.Ссылка.Пустая() Тогда // Открываем ранее заполненный документ.
			
			// Если перешли с автоматического режима, то все строки удалим и добавим только одну, с договором по умолчанию.
			Если Элементы.СтраницыРасчетовСКонтрагентом.ТекущаяСтраница = Элементы.СтраницаАвтоматическоеЗаполнение Тогда
				Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
					ДобавитьСтрокуАвансаНаСервере();
				КонецЕсли;
			КонецЕсли;
			
			ЗаполнитьДолги(Ложь);
			РаспределитьРасшифровкуПоТаблицеДолгов();
			
			//**********************************************************************************************************
			// Настройка видимости и заголовков
			
			Элементы.КоманднаяПанельПомощника.Видимость = Истина;
			Элементы.КоманднаяПанельРучногоЗаполнения.Видимость = Ложь;
			
			//Элементы.СуммаПлатежаАванс.Видимость = Истина;
			Элементы.СуммаДокумента.КнопкаВыпадающегоСписка = Истина; // Для сулчая, когда хотят зачесть больше, чем изначально планировалось.
			
			Элементы.СтраницыРасчетовСКонтрагентом.ТекущаяСтраница = Элементы.СтраницаЗаполнениеСПомощником;
			Элементы.СтраницыРасчетовСКонтрагентомПодвал.ТекущаяСтраница = Элементы.ПодвалСПомощником;
			
		//**********************************************************************************************************
		// Ручное заполнение.
		ИначеЕсли Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиВручную Тогда
			
			//Элементы.РасчетыСКонтрагентом.ПутьКДаннымЗаголовка = "Объект.РасшифровкаПлатежа.КоличествоСтрок";
			
			// Удалим строку с авансом, если он = 0, и строки с нулевыми суммами.
			Если Элементы.СтраницыРасчетовСКонтрагентом.ТекущаяСтраница = Элементы.СтраницаЗаполнениеСПомощником Тогда
				УдалитьСтрокуСАвансомИСтрокиСНулевымиЗначениями();
			КонецЕсли;
			
			//**********************************************************************************************************
			// Заполнение элементов
			КоличествоСтрок = Объект.РасшифровкаПлатежа.Количество();
		
			Если КоличествоСтрок = 0 Тогда
				Объект.РасшифровкаПлатежа.Добавить();
				Объект.РасшифровкаПлатежа[0].СуммаПлатежа = Объект.СуммаДокумента;
				РасшифровкаПлатежаСуммаПлатежаПриИзмененииЗавершениеНаСервере(Объект.РасшифровкаПлатежа[0]);
				КоличествоСтрок = 1;
			КонецЕсли;
			
			//**********************************************************************************************************
			// Настройка видимости и заголовков
			Элементы.КоманднаяПанельПомощника.Видимость = Ложь;
			Элементы.КоманднаяПанельРучногоЗаполнения.Видимость = Истина;
			
			//Элементы.СуммаПлатежаАванс.Видимость = Истина;
			Элементы.СуммаДокумента.КнопкаВыпадающегоСписка = Истина;
			
			Элементы.СтраницыРасчетовСКонтрагентом.ТекущаяСтраница = Элементы.СтраницаРучноеЗаполнение;
			Элементы.СтраницыРасчетовСКонтрагентомПодвал.ТекущаяСтраница = Элементы.ПодвалВручную;
			
		КонецЕсли;
		
		//**********************************************************************************************************
		// Общие действия
		СуммаЗачтено = ТаблицаДолгов.Итог("ЗачестьВыбрано");
		ПересчитатьИтогиПриИзмененииАвансаНаСервере();
		СформироватьЗаголовокГруппыЗачетаДолгов();
		УстановитьЗаголовкиКолонокТабличныхЧастей(Объект.ВалютаДенежныхСредств);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискПоДоговоруНаСервере(Знач ИмяКолонкиТЧ)
	
	ОтборПоСуммеЧисло = Ложь;
	Если СтрНайти(ИмяКолонкиТЧ, "ДолгВал") > 0 Тогда
		Если СтрНайти(ИмяКолонкиТЧ, "Строка") > 0 Тогда
			ИмяКолонкиТЧ = СтрЗаменить(ИмяКолонкиТЧ, "Строка", "");
		КонецЕсли;
		
		Попытка
			СтруктураОтбора = Новый Структура(ИмяКолонкиТЧ, Число(СтрокаПоискаПоДоговору));
			Если ТаблицаДолгов.НайтиСтроки(СтруктураОтбора).Количество() = 0 Тогда
				СтруктураОтбора = Новый Структура(ИмяКолонкиТЧ+"Строка", СокрЛП(СтрЗаменить(СтрокаПоискаПоДоговору, Символы.НПП, "")));
			КонецЕсли;
		Исключение
			СтруктураОтбора = Новый Структура(ИмяКолонкиТЧ+"Строка", СокрЛП(СтрЗаменить(СтрокаПоискаПоДоговору, Символы.НПП, "")));
		КонецПопытки;
	Иначе
		СтруктураОтбора = Новый Структура(ИмяКолонкиТЧ, СокрЛП(СтрокаПоискаПоДоговору));
	КонецЕсли;
	Элементы.ТаблицаДолгов.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	Элементы.СнятьОтборПоДоговору.Доступность = Истина;
	Элементы.УстановитьОтборПоДоговору.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокГруппыЗачетаДолгов()
	
	// Автоматическое заполнение.
	Если Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиАвтоматически Тогда
		
		Если Объект.Контрагент.Пустая() Или НЕ Объект.Контрагент.ВестиРасчетыПоДоговорам Тогда
			Элементы.РасчетыСКонтрагентом.Заголовок = "Зачет долгов: автоматически";
		Иначе
			КоличествоСтрок = Объект.ДоговорыАвтоЗачетаДолгов.Количество();
			Если КоличествоСтрок = 1 И ЗначениеЗаполнено(Объект.ДоговорыАвтоЗачетаДолгов[0].Договор) Тогда
				Элементы.РасчетыСКонтрагентом.Заголовок = "Зачет долгов: автоматически по договору """+Объект.ДоговорыАвтоЗачетаДолгов[0].Договор+"""";
			ИначеЕсли КоличествоСтрок > 1 Тогда
				Если КоличествоСтрок > 4 Тогда
					Элементы.РасчетыСКонтрагентом.Заголовок = НСтр("ka='ვალების ჩათვლა: ავტომატურად, რამდენიმე ხელშეკრულების მიხედვით (';ru='Зачет долгов: автоматически по нескольким договорам (';en='Set-off of debts: automatically on multiple contracts ('") + КоличествоСтрок + ")";
				Иначе
					ЗаголовокГруппы = НСтр("ka='ვალების ჩათვლა: ავტომატურად ხელშეკრულების %КоличествоСтрок%-ით';ru='Зачет долгов: автоматически по %КоличествоСтрок%-м договорам';en='Set-off of debts: automatically KolichestvoStrok%% m contracts'");
					ЗаголовокГруппы = СтрЗаменить(ЗаголовокГруппы, "%КоличествоСтрок%", КоличествоСтрок);
					Элементы.РасчетыСКонтрагентом.Заголовок = ЗаголовокГруппы;
				КонецЕсли;
			Иначе
				Элементы.РасчетыСКонтрагентом.Заголовок = "Зачет долгов: автоматически (выберите договор)";
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиСПомощником Тогда
		
		ОпределитьТекущуюСтраницуПомощника();
		Элементы.РасчетыСКонтрагентом.Заголовок = НСтр("ka='ვალების ჩათვლა: დამხმარესთან ერთად';ru='Зачет долгов: с помощником';en='Set-off of debt: an assistant'");
		
	// Ручное заполнение.
	ИначеЕсли Объект.ВариантЗаполненияРасшифровки = ВариантЗаполненияРасшифровкиВручную Тогда
		
		Элементы.РасчетыСКонтрагентом.Заголовок = НСтр("ka='ვალების ჩათვლა: ხელით';ru='Зачет долгов: вручную';en='Set-off of debts: manually'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьТекущуюСтраницуПомощника()
	
	Если ТаблицаДолгов.Количество() = 0 Тогда
		Элементы.СтраницыПомощник.ТекущаяСтраница = Элементы.СтраницаНетДанныхВПомощнике;
	Иначе
		Элементы.СтраницыПомощник.ТекущаяСтраница = Элементы.СтраницаЕстьДанныеВПомощнике;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДоговорЗачетаДолговНажатие(Элемент)
	
	ТекущаяСтрока = Объект.ДоговорыАвтоЗачетаДолгов.Добавить();
	
	//+++ Дмгг
	Если ИспользоватьПроекты Тогда 
		ДобавитьДоговорЗачетаДолговСПроектамиНажатиеНаСервере();
	Иначе
		ДобавитьДоговорЗачетаДолговНажатиеНаСервере();
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДоговорЗачетаДолговНажатиеНаСервере(ТекущаяСтрокаТаблицыДоговоровАвтоЗачета = Неопределено)
	
	// Добавление элемента для последней добавленной в таблицу строки.
	Если ТекущаяСтрокаТаблицыДоговоровАвтоЗачета = Неопределено Тогда
		ИндексДоговораУчетаРасчетов = Объект.ДоговорыАвтоЗачетаДолгов.Количество() - 1;
	// Добавление элемента для строки, которая передана в качестве параметра.
	Иначе
		ИндексДоговораУчетаРасчетов = Объект.ДоговорыАвтоЗачетаДолгов.Индекс(ТекущаяСтрокаТаблицыДоговоровАвтоЗачета);
	КонецЕсли;
	
	// Создадим элемент для договора.
	ПолеДоговора = Элементы.Добавить("ДоговорАвтоЗачетаДолгов_" + ИндексДоговораУчетаРасчетов,
		Тип("ПолеФормы"),
		Элементы.ГруппаДобавленныхДоговоровСлева
	);
	
	ПолеДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ПолеДоговора.ПутьКДанным = "Объект.ДоговорыАвтоЗачетаДолгов[" + ИндексДоговораУчетаРасчетов + "].Договор";
	ПолеДоговора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеДоговора.Заголовок = ?(ИндексДоговораУчетаРасчетов = 0, НСтр("ka='ხელშეკრულების მიხედვით';ru='По договору';en='Under contract'"), НСтр("ka='და ხელშეკრულების მიხედვით';ru='и по договору';en='and the contract'"));
	ПолеДоговора.РастягиватьПоГоризонтали = Истина;
	ПолеДоговора.УстановитьДействие("ПриИзменении", "Подключаемый_ДоговорыАвтоЗачетаДолговДоговорПриИзменении");
	ПолеДоговора.УстановитьДействие("НачалоВыбора", "Подключаемый_ДоговорыАвтоЗачетаДолговДоговорНачалоВыбора");
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	ПолеДоговора.СвязиПараметровВыбора = НовыеСвязи;
	ПолеДоговора.АвтоОтметкаНезаполненного = Ложь;
	ПолеДоговора.ПодсказкаВвода = "Если не выбран, то игнорируется";
	
	// Создадим элемент для суммы платежа.
	ДобавитьСуммуПлатежаЗачетаДолгов(ИндексДоговораУчетаРасчетов);
	
	// Если договоров > 1, тогда выводим сумму, которая будет зачтена для каждого договора.
	Если ИндексДоговораУчетаРасчетов = 1 Тогда
		Элементы.ГруппаДобавленныхДоговоровСправа.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДоговорЗачетаДолговСПроектамиНажатиеНаСервере(ТекущаяСтрокаТаблицыДоговоровАвтоЗачета = Неопределено)
	
	// Добавление элемента для последней добавленной в таблицу строки.
	Если ТекущаяСтрокаТаблицыДоговоровАвтоЗачета = Неопределено Тогда
		ИндексДоговораУчетаРасчетов = Объект.ДоговорыАвтоЗачетаДолгов.Количество() - 1;
	// Добавление элемента для строки, которая передана в качестве параметра.
	Иначе
		ИндексДоговораУчетаРасчетов = Объект.ДоговорыАвтоЗачетаДолгов.Индекс(ТекущаяСтрокаТаблицыДоговоровАвтоЗачета);
	КонецЕсли;
	
	ГруппаДоговоровСПроектами = Элементы.Добавить("ГруппаДобавленныхДоговоровСПроектами_" + ИндексДоговораУчетаРасчетов,
		Тип("ГруппаФормы"),
		Элементы.ГруппаДобавленныхДоговоровСлева
	);
	
	ГруппаДоговоровСПроектами.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДоговоровСПроектами.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаДоговоровСПроектами.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаДоговоровСПроектами.ОтображатьЗаголовок = ЛОЖЬ;
	
	// Создадим элемент для договора.
	ПолеДоговора = Элементы.Добавить("ДоговорАвтоЗачетаДолгов_" + ИндексДоговораУчетаРасчетов,
		Тип("ПолеФормы"),
		ГруппаДоговоровСПроектами
	);
	
	//+++ Дмгг
	ПолеПроекта = Элементы.Добавить("ПроектАвтоЗачетаДолгов_" + ИндексДоговораУчетаРасчетов,
		Тип("ПолеФормы"),
		ГруппаДоговоровСПроектами
	);
	//--- Дмгг
	
	ПолеДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ПолеДоговора.ПутьКДанным = "Объект.ДоговорыАвтоЗачетаДолгов[" + ИндексДоговораУчетаРасчетов + "].Договор";
	ПолеДоговора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеДоговора.Заголовок = ?(ИндексДоговораУчетаРасчетов = 0, НСтр("ka='ხელშეკრულების მიხედვით';ru='По договору'"), НСтр("ka='და ხელშეკრულების მიხედვით';ru='и по договору'"));
	ПолеДоговора.РастягиватьПоГоризонтали = Истина;
	ПолеДоговора.УстановитьДействие("ПриИзменении", "Подключаемый_ДоговорыАвтоЗачетаДолговДоговорПриИзменении");
	ПолеДоговора.УстановитьДействие("НачалоВыбора", "Подключаемый_ДоговорыАвтоЗачетаДолговДоговорНачалоВыбора");
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	ПолеДоговора.СвязиПараметровВыбора = НовыеСвязи;
	ПолеДоговора.АвтоОтметкаНезаполненного = Ложь;
	ПолеДоговора.ПодсказкаВвода = "Если не выбран, то игнорируется";
	
	//+++ Дмгг
	ПолеПроекта.Вид = ВидПоляФормы.ПолеВвода;
	ПолеПроекта.ПутьКДанным = "Объект.ДоговорыАвтоЗачетаДолгов[" + ИндексДоговораУчетаРасчетов + "].Проект";
	ПолеПроекта.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеПроекта.Заголовок = ?(ИндексДоговораУчетаРасчетов = 0, НСтр("ka='პროექტი მიხედვით';ru='По проекту'"), НСтр("ka='და პროექტი მიხედვით';ru='и по проекту'"));
	ПолеПроекта.РастягиватьПоГоризонтали = Истина;
	//ПолеПроекта.УстановитьДействие("ПриИзменении", "Подключаемый_ДоговорыАвтоЗачетаДолговДоговорПриИзменении");
	//ПолеПроекта.УстановитьДействие("НачалоВыбора", "Подключаемый_ДоговорыАвтоЗачетаДолговДоговорНачалоВыбора");
	//НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	ПолеПроекта.КнопкаОчистки = Истина;
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	ПолеПроекта.СвязиПараметровВыбора = НовыеСвязи;
	ПолеПроекта.АвтоОтметкаНезаполненного = Ложь;
	ПолеПроекта.ПодсказкаВвода = "Если не выбран, то игнорируется";
	//--- Дмгг
	
	// Создадим элемент для суммы платежа.
	ДобавитьСуммуПлатежаЗачетаДолгов(ИндексДоговораУчетаРасчетов);
	
	// Если договоров > 1, тогда выводим сумму, которая будет зачтена для каждого договора.
	Если ИндексДоговораУчетаРасчетов = 1 Тогда
		Элементы.ГруппаДобавленныхДоговоровСправа.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСуммуПлатежаЗачетаДолгов(ИндексДоговораУчетаРасчетов)

	// Поле суммы.
	ПолеСуммыПлатежа = Элементы.Добавить("СуммаПлатежаАвтоЗачетаДолгов_" + ИндексДоговораУчетаРасчетов,
			Тип("ПолеФормы"),
			Элементы.ГруппаДобавленныхДоговоровСправа
		);
		
	ПолеСуммыПлатежа.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСуммыПлатежа.ПутьКДанным = "Объект.ДоговорыАвтоЗачетаДолгов[" + ИндексДоговораУчетаРасчетов + "].СуммаПлатежа";
	ПолеСуммыПлатежа.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеСуммыПлатежа.Заголовок = НСтр("ka='თანხა';ru='сумма';en='sum'");
	ПолеСуммыПлатежа.РастягиватьПоГоризонтали = Ложь;
	ПолеСуммыПлатежа.Ширина = 11;
	ПолеСуммыПлатежа.АвтоОтметкаНезаполненного = Ложь;
	ПолеСуммыПлатежа.УстановитьДействие("ПриИзменении", "Подключаемый_ДоговорыАвтоЗачетаДолговСуммаПлатежаПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДоговорыАвтоЗачетаДолговДоговорПриИзменении(Элемент)
	
	СформироватьЗаголовокГруппыЗачетаДолгов();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДоговорыАвтоЗачетаДолговДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НомерСимвола = СтрНайти(Элемент.Имя, "_");
	Если НомерСимвола = 0 Тогда
		ОбработатьНачалоВыбораДоговораКонтрагента(Элемент, СтандартнаяОбработка);
	Иначе
		Попытка
			Индекс = Число(Сред(Элемент.Имя, НомерСимвола + 1));
			ОбработатьНачалоВыбораДоговораКонтрагента(Элемент, СтандартнаяОбработка, Объект.ДоговорыАвтоЗачетаДолгов[Индекс].Договор);
		Исключение
			ОбработатьНачалоВыбораДоговораКонтрагента(Элемент, СтандартнаяОбработка);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДоговорыАвтоЗачетаДолговСуммаПлатежаПриИзменении(Элемент)
	
	Если ИсходнаяСуммаРавнаНулю Тогда
		Объект.СуммаДокумента = Объект.ДоговорыАвтоЗачетаДолгов.Итог("СуммаПлатежа");
		СуммаДокументаПриИзмененииФрагмент();
	Иначе
		РассчитатьСуммуНДСПоУмолчаниюНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорДляЗачетаАванса2ПриИзменении(Элемент)
	
	СтрокаАванса = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ИдентификаторСтрокиАванса);
	Если СтрокаАванса <> Неопределено Тогда
		СтрокаАванса.Договор = Объект.ДоговорДляЗачетаАвансаСПомощником;
		ОбработатьИзменениеДоговораКонтрагента(СтрокаАванса);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорДляЗачетаАванса2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Контрагент.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ka='თავდაპირველად, საჭიროა მომწოდებლის არჩევა';ru='Сначала нужно выбрать поставщика';en='First you need to choose a provider'"));
		
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяТипаДокумента(СсылкаНаДокумент)

	Возврат СсылкаНаДокумент.Метаданные().Имя;

КонецФункции // ПолучитьИмяТипаДокумента()

&НаКлиенте
Процедура РасшифровкаПлатежаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		ПересчитатьИтогиПриИзмененииАвансаНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.СуммаДокумента = ВыбранноеЗначение;
	СуммаДокументаПриИзменении(Элемент);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиКолонокТабличныхЧастей(ВалютаСсылка)
	
	// Долги будем всегда выводить в валюте документа, чтобы было легче распределить.
	ПредставлениеВалюты = УправлениеНебольшойФирмойПовтИсп.ПолучитьСимвольноеПредставлениеВалюты(ВалютаСсылка);
	
	Элементы.ТаблицаДолговДолгВалПлатежа.Заголовок = НСтр("ka='Текущий долг ';ru='Текущий долг '")+ПредставлениеВалюты;
	Элементы.ТаблицаДолговЗачесть.Заголовок = НСтр("ka='Зачитываем ';ru='Зачитываем '")+ПредставлениеВалюты;
	
	Элементы.РасшифровкаПлатежаСуммаПлатежа.Заголовок = НСтр("ka='Сумма ';ru='Сумма '")+ПредставлениеВалюты;
	
КонецПроцедуры

&НаСервере
Функция РассчитатьСуммуДолгаВВалютеПлатежа(ПараметрДолгВалДоговора, ПараметрКурс, ПараметрКратность, ПараметрДоговор, ПараметрыБанковскогоСчета = Неопределено)
	
	Если ПараметрыБанковскогоСчета = Неопределено Тогда
		ТекущаяВалютаДС = Объект.ВалютаДенежныхСредств;
		ТекущийКурс = Курс;
		ТекущаяКратность = Кратность;
	Иначе
		ТекущаяВалютаДС = ПараметрыБанковскогоСчета.ВалютаДенежныхСредств;
		ТекущийКурс = ПараметрыБанковскогоСчета.ВалютаКурсКратность.Курс;
		ТекущаяКратность = ПараметрыБанковскогоСчета.ВалютаКурсКратность.Кратность;
	КонецЕсли;
	Если ПараметрДоговор.ВалютаРасчетов = ТекущаяВалютаДС Тогда
		Возврат ПараметрДолгВалДоговора;
	Иначе
		Возврат УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
			ПараметрДолгВалДоговора,
			ПараметрКурс,
			ТекущийКурс,
			ПараметрКратность,
			ТекущаяКратность
		)
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОбновитьИнформациюОбАвансеВРасшифровкеПлатежа()
	
	Для каждого ТекущаяСтрока Из Объект.РасшифровкаПлатежа Цикл
		ТекущаяСтрока.Аванс = ?(ТекущаяСтрока.ПризнакАванса , ТекущаяСтрока.СуммаПлатежа, 0);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДолгиВПомощникеЗачетаДолгов(ПараметрыБанковскогоСчета = Неопределено)
	
	Для Каждого ТекущаяСтрокаДолгов Из ТаблицаДолгов Цикл
		ТекущаяСтрокаДолгов.ДолгВалПлатежа = РассчитатьСуммуДолгаВВалютеПлатежа(
			ТекущаяСтрокаДолгов.ДолгВалДоговора,
			ТекущаяСтрокаДолгов.Курс,
			ТекущаяСтрокаДолгов.Кратность,
			ТекущаяСтрокаДолгов.Договор,
			ПараметрыБанковскогоСчета
		);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура РассчитатьСуммуПлатежаОтАгента(ДанныеСтроки)
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки.СуммаПлатежа = ДанныеСтроки.ПолученоОтКлиента - ДанныеСтроки.УдержаноАгентом;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаОтАгентаПолученоОтКлиентаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.РасшифровкаПлатежаОтАгента.ТекущиеДанные;
	РассчитатьСуммуПлатежаОтАгента(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаОтАгентаУдержаноАгентомПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.РасшифровкаПлатежаОтАгента.ТекущиеДанные;
	РассчитатьСуммуПлатежаОтАгента(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаОтАгентаСуммаПлатежаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.РасшифровкаПлатежаОтАгента.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.ПолученоОтКлиента = ТекущаяСтрока.СуммаПлатежа + ТекущаяСтрока.УдержаноАгентом;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаПлатежаОтАгентаЗаказПриИзмененииНаСервере(ТекущиеДанныеИдентификатор)
	
	ТекущиеДанные = Объект.РасшифровкаПлатежаОтАгента.НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Заказ) И ТекущиеДанные.Заказ.Договор.ВалютаРасчетов <> Константы.НациональнаяВалюта.Получить() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ka='Не поддерживается выбор заказов, которые оформлены по договорам в валюте или у.е.';ru='Не поддерживается выбор заказов, которые оформлены по договорам в валюте или у.е.';en='It is not supported by the choice of orders which are furnished under contracts in currency or USD'");
			Сообщение.Поле = "РасшифровкаПлатежаОтАгента["+Объект.РасшифровкаПлатежаОтАгента.Индекс(ТекущиеДанные)+"].Документ";
			Сообщение.Сообщить();
			
			ТекущиеДанные.Заказ = Неопределено;
			Возврат;
		КонецЕсли;
		
		Если ТекущиеДанные.Заказ.Контрагент.ВестиУчетОплатыПоСчетам
			И ЗначениеЗаполнено(ТекущиеДанные.Заказ)
			И НЕ ЗначениеЗаполнено(ТекущиеДанные.СчетНаОплату) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетНаОплату.Ссылка КАК СчетНаОплату
			|ИЗ
			|	Документ.СчетНаОплату КАК СчетНаОплату
			|ГДЕ
			|	СчетНаОплату.ДокументОснование = &ДокументОснование";
			
			Запрос.УстановитьПараметр("ДокументОснование", ТекущиеДанные.Заказ);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Количество() = 1
				И Выборка.Следующий() Тогда
				
				ТекущиеДанные.СчетНаОплату = Выборка.СчетНаОплату;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПолучилиСуммуИзРасходнойНакладной = Ложь;
		Если ТекущиеДанные.Заказ.Контрагент.ВестиРасчетыПоДокументам
			И ЗначениеЗаполнено(ТекущиеДанные.Заказ)
			И НЕ ЗначениеЗаполнено(ТекущиеДанные.Документ) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	РасходнаяНакладнаяЗапасы.Ссылка КАК Ссылка,
				|	СУММА(РасходнаяНакладнаяЗапасы.Всего) КАК Всего
				|ИЗ
				|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
				|ГДЕ
				|	РасходнаяНакладнаяЗапасы.Заказ = &Заказ
				|	И РасходнаяНакладнаяЗапасы.Ссылка.Проведен
				|
				|СГРУППИРОВАТЬ ПО
				|	РасходнаяНакладнаяЗапасы.Ссылка";
			
			Запрос.УстановитьПараметр("Заказ", ТекущиеДанные.Заказ);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Количество() = 1 Тогда
				
				Выборка.Следующий();
				
				ТекущиеДанные.Документ = Выборка.Ссылка;
				ПолучилиСуммуИзРасходнойНакладной = Истина;
				УстановитьСуммыСтрокиАгент(ТекущиеДанные, Выборка.Всего);
				
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Заказ)
			И ЗначениеЗаполнено(ТекущиеДанные.Документ)
			И ТекущиеДанные.Документ.Заказ <> ТекущиеДанные.Заказ Тогда
			
			НашлиЗаказ = Ложь;
			Для Каждого ТекущаяСтрокаРН Из ТекущиеДанные.Документ.Запасы Цикл
				
				Если ТекущаяСтрокаРН.Заказ = ТекущиеДанные.Заказ Тогда
					НашлиЗаказ = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ НашлиЗаказ Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ka='В расходной накладной не выбран заказ, который выбран в текущей строке. Выберите другой документ или другой заказ.';ru='В расходной накладной не выбран заказ, который выбран в текущей строке. Выберите другой документ или другой заказ.';en='In the expenditure invoice is not selected order, which has been selected in the current row. Select another document or a different order.'");
				Сообщение.Поле = "РасшифровкаПлатежаОтАгента["+Объект.РасшифровкаПлатежаОтАгента.Индекс(ТекущиеДанные)+"].Документ";
				Сообщение.Сообщить();
				
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ПолучилиСуммуИзРасходнойНакладной Тогда
			УстановитьСуммыСтрокиАгент(ТекущиеДанные, ТекущиеДанные.Заказ.СуммаДокумента);
		КонецЕсли;
		
		СвойстваЗаказа = РегистрыСведений.ЯндексДоставка.СвойстваЗаказа(ТекущиеДанные.Заказ);
		ТекущиеДанные.НомерЗаказаАгента = СвойстваЗаказа.НомерЗаказа;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСуммыСтрокиАгент(ТекущиеДанные, СуммаДокументаОтгрузкиЗаказа)
	
	Если ТекущиеДанные.СуммаПлатежа = 0
		И ТекущиеДанные.ПолученоОтКлиента = 0 Тогда
		ТекущиеДанные.ПолученоОтКлиента = СуммаДокументаОтгрузкиЗаказа;
		ТекущиеДанные.СуммаПлатежа = ТекущиеДанные.ПолученоОтКлиента - ТекущиеДанные.УдержаноАгентом;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаОтАгентаЗаказПриИзменении(Элемент)
	
	РасшифровкаПлатежаОтАгентаЗаказПриИзмененииНаСервере(Элементы.РасшифровкаПлатежаОтАгента.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаПлатежаОтАгентаДокументПриИзмененииНаСервере(ТекущиеДанныеИдентификатор)
	
	ТекущиеДанные = Объект.РасшифровкаПлатежаОтАгента.НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Документ) И ТекущиеДанные.Документ.Договор.ВалютаРасчетов <> Константы.НациональнаяВалюта.Получить() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ka='Не поддерживается выбор документов, которые оформлены по договорам в валюте или у.е.';ru='Не поддерживается выбор документов, которые оформлены по договорам в валюте или у.е.';en='It is not supported by the choice of instruments, which are furnished under contracts in currency or USD'");
			Сообщение.Поле = "РасшифровкаПлатежаОтАгента["+Объект.РасшифровкаПлатежаОтАгента.Индекс(ТекущиеДанные)+"].Документ";
			Сообщение.Сообщить();
			
			ТекущиеДанные.Документ = Неопределено;
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Заказ) И ЗначениеЗаполнено(ТекущиеДанные.Документ) И 
			ЗначениеЗаполнено(ТекущиеДанные.Документ.Заказ)
			Тогда
			
			ТекущиеДанные.Заказ = ТекущиеДанные.Документ.Заказ;
			
			РасшифровкаПлатежаОтАгентаЗаказПриИзмененииНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
			Если ТекущиеДанные.Документ.ВалютаДокумента = Объект.ВалютаДенежныхСредств Тогда
				ТекущиеДанные.ПолученоОтКлиента = ТекущиеДанные.Документ.СуммаДокумента;
				ТекущиеДанные.СуммаПлатежа = ТекущиеДанные.ПолученоОтКлиента - ТекущиеДанные.УдержаноАгентом;
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Заказ)
			И ЗначениеЗаполнено(ТекущиеДанные.Документ)
			И ТекущиеДанные.Документ.Заказ <> ТекущиеДанные.Заказ Тогда
			
			НашлиЗаказ = Ложь;
			Для Каждого ТекущаяСтрокаРН Из ТекущиеДанные.Документ.Запасы Цикл
				
				Если ТекущаяСтрокаРН.Заказ = ТекущиеДанные.Заказ Тогда
					НашлиЗаказ = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ НашлиЗаказ Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ka='В расходной накладной не выбран заказ, который выбран в текущей строке. Выберите другой документ или другой заказ.';ru='В расходной накладной не выбран заказ, который выбран в текущей строке. Выберите другой документ или другой заказ.';en='In the expenditure invoice is not selected order, which has been selected in the current row. Select another document or a different order.'");
				Сообщение.Поле = "РасшифровкаПлатежаОтАгента["+Объект.РасшифровкаПлатежаОтАгента.Индекс(ТекущиеДанные)+"].Документ";
				Сообщение.Сообщить();
				
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаОтАгентаДокументПриИзменении(Элемент)
	
	РасшифровкаПлатежаОтАгентаДокументПриИзмененииНаСервере(Элементы.РасшифровкаПлатежаОтАгента.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура НастроитьРеквизитыЭлементовФормы()
	
	// ДоговорСАгентом
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВалютаРасчетов", Константы.НациональнаяВалюта.Получить()));
	
	Элементы.ДоговорСАгентом.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
	// Документ и заказ от покупателя
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВалютаДокумента", Константы.НациональнаяВалюта.Получить()));
	
	Элементы.РасшифровкаПлатежаОтАгентаДокумент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	Элементы.РасшифровкаПлатежаОтАгентаЗаказ.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты
		И Объект.Ссылка.Пустая()
		И Объект.Корреспонденция.Пустая() Тогда
		
		Если Не ИспользоватьТолькоРегламентированногоПланаСчетов Тогда
			Объект.Корреспонденция = ПланыСчетов.Управленческий.РасчетыСРазнымиКредиторами;
		КонецЕсли;
		Объект.КорреспонденцияРегл = ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками; //+++ Дмгг
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаПлатежаОтАгентаСчетНаОплатуПриИзмененииНаСервере(ТекущиеДанныеИдентификатор)
	
	ТекущиеДанные = Объект.РасшифровкаПлатежаОтАгента.НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
	Если ТекущиеДанные.СчетНаОплату.Контрагент.ВестиРасчетыПоЗаказам Тогда
		Если ТипЗнч(ТекущиеДанные.СчетНаОплату.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Если ЗначениеЗаполнено(ТекущиеДанные.СчетНаОплату) И 
				НЕ ЗначениеЗаполнено(ТекущиеДанные.Заказ) Тогда
				ТекущиеДанные.Заказ = ТекущиеДанные.СчетНаОплату.ДокументОснование;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ТекущиеДанные.СчетНаОплату) И 
				НЕ ЗначениеЗаполнено(ТекущиеДанные.Документ) Тогда
				ТекущиеДанные.Документ = ТекущиеДанные.СчетНаОплату.ДокументОснование;
				РасшифровкаПлатежаОтАгентаДокументПриИзмененииНаСервере(ТекущиеДанныеИдентификатор);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаОтАгентаСчетНаОплатуПриИзменении(Элемент)
	
	РасшифровкаПлатежаОтАгентаСчетНаОплатуПриИзмененииНаСервере(Элементы.РасшифровкаПлатежаОтАгента.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОбнвоитьДокументыПереносаДолгаНаСервере(ДокОбъект)
	
	СтруктураДляЗаполнения = Новый Структура("Ссылка, ИндексСтрокиРасшифровки", ДокОбъект.Ссылка, 0);
	
	СоздатьОбновить = ДокОбъект.Проведен;
	ПометитьНаУдаление = ДокОбъект.ПометкаУдаления;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ТекущаяСтрока Из ДокОбъект.РасшифровкаПлатежаОтАгента Цикл
		
		Если СоздатьОбновить Тогда
			
			СтруктураДляЗаполнения.Вставить("ИндексСтрокиРасшифровки", ДокОбъект.РасшифровкаПлатежаОтАгента.Индекс(ТекущаяСтрока));
			Если НЕ ТекущаяСтрока.КорректировкаДолга.Пустая() Тогда
				ДокументПереносаДолга = ТекущаяСтрока.КорректировкаДолга.ПолучитьОбъект();
			Иначе
				ДокументПереносаДолга = Документы.Взаимозачет.СоздатьДокумент();
			КонецЕсли;
			ДокументПереносаДолга.Заполнить(СтруктураДляЗаполнения);
			Попытка
				Если ДокументПереносаДолга.ПометкаУдаления Тогда
					ДокументПереносаДолга.УстановитьПометкуУдаления(Ложь);
				КонецЕсли;
				ДокументПереносаДолга.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				ДокументПереносаДолга.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не получилось провести документ переноса долга." + Символы.ПС + ОписаниеОшибки();
				Сообщение.Поле = "Объект.РасшифровкаПлатежаОтАгента["+СтруктураДляЗаполнения.ИндексСтрокиРасшифровки+"].КорректировкаДолга";
				Сообщение.Сообщить();
			КонецПопытки;
			
			ТекущаяСтрока.КорректировкаДолга = ДокументПереносаДолга.Ссылка;
			
		ИначеЕсли ПометитьНаУдаление И НЕ ТекущаяСтрока.КорректировкаДолга.Пустая() И НЕ ТекущаяСтрока.КорректировкаДолга.ПометкаУдаления Тогда
			
			Попытка
				ТекущаяСтрока.КорректировкаДолга.
					ПолучитьОбъект().
					УстановитьПометкуУдаления(Истина);
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не получилось пометить на удаление документ переноса долга." + Символы.ПС + ОписаниеОшибки();
				Сообщение.Поле = "Объект.РасшифровкаПлатежаОтАгента["+СтруктураДляЗаполнения.ИндексСтрокиРасшифровки+"].КорректировкаДолга";
				Сообщение.Сообщить();
			КонецПопытки;
			
		ИначеЕсли НЕ ПометитьНаУдаление И НЕ СоздатьОбновить И НЕ ТекущаяСтрока.КорректировкаДолга.Пустая() Тогда
			
			Если ТекущаяСтрока.КорректировкаДолга.Проведен Тогда
				
				Попытка
					ТекущаяСтрока.КорректировкаДолга.
						ПолучитьОбъект().
						Записать(РежимЗаписиДокумента.ОтменаПроведения, РежимПроведенияДокумента.Неоперативный);
				Исключение
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Не получилось отменить проведение документа переноса долга." + Символы.ПС + ОписаниеОшибки();
					Сообщение.Поле = "Объект.РасшифровкаПлатежаОтАгента["+СтруктураДляЗаполнения.ИндексСтрокиРасшифровки+"].КорректировкаДолга";
					Сообщение.Сообщить();
				КонецПопытки;
				
			ИначеЕсли ТекущаяСтрока.КорректировкаДолга.ПометкаУдаления Тогда
				
				Попытка
					ТекущаяСтрока.КорректировкаДолга.
						ПолучитьОбъект().
						УстановитьПометкуУдаления(Ложь);
				Исключение
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Не получилось снять пометку удаления с документа переноса долга." + Символы.ПС + ОписаниеОшибки();
					Сообщение.Поле = "Объект.РасшифровкаПлатежаОтАгента["+СтруктураДляЗаполнения.ИндексСтрокиРасшифровки+"].КорректировкаДолга";
					Сообщение.Сообщить();
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Если при интерактивном проведении, тогда перезапишем документ без перепроведения, иначе ссылки на корректировки не сохранятся.
	Если СоздатьОбновить Тогда
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборРасшифровкиПлатежаОтАгента(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ka='დასაწყისში მიუთითეთ კონტრაგენტი!';ru='Укажите вначале контрагента!';en='Specify the first contractor!'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчет)
	   И НЕ ЗначениеЗаполнено(Объект.ВалютаДенежныхСредств) Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ka='თავდაპირველად, მიუთითეთ საბანკო ანგარიში!';ru='Укажите вначале банковский счет!';en='Specify the first bank account!'"));
		Возврат;
	КонецЕсли;
	
	АдресРасшифровкаПлатежаВХранилище = ПоместитьРасшифровкаПлатежаОтАгентаВХранилище();
	
	ПараметрыПодбора = Новый Структура(
		"АдресРасшифровкаПлатежаВХранилище,
		|Компания,
		|Дата,
		|Ссылка,
		|ВалютаДенежныхСредств,
		|СуммаДокумента",
		АдресРасшифровкаПлатежаВХранилище,
		Компания,
		Объект.Дата,
		Объект.Ссылка,
		Объект.ВалютаДенежныхСредств,
		Объект.СуммаДокумента
	);
		
	Результат = Неопределено;
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораРасшифровкиПлатежаОтАгента", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("ПодборОтАгентаЗавершение", ЭтотОбъект, Новый Структура("АдресРасшифровкаПлатежаВХранилище", АдресРасшифровкаПлатежаВХранилище)));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборОтАгентаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	АдресРасшифровкаПлатежаВХранилище = ДополнительныеПараметры.АдресРасшифровкаПлатежаВХранилище;
	
	Если Результат = КодВозвратаДиалога.OK Тогда
		
		ПолучитьРасшифровкаПлатежаОтАгентаИзХранилища(АдресРасшифровкаПлатежаВХранилище);
		
	КонецЕсли;

КонецПроцедуры // Подбор()

&НаСервере
Процедура ПолучитьРасшифровкаПлатежаОтАгентаИзХранилища(АдресРасшифровкаПлатежаВХранилище, Очищать = Истина)
	
	ТаблицаРасшифровкаПлатежа = ПолучитьИзВременногоХранилища(АдресРасшифровкаПлатежаВХранилище);
	Если Очищать Тогда
		Объект.РасшифровкаПлатежаОтАгента.Очистить();
	КонецЕсли;
	Для каждого СтрокаРасшифровкаПлатежа Из ТаблицаРасшифровкаПлатежа Цикл
		Строка = Объект.РасшифровкаПлатежаОтАгента.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаРасшифровкаПлатежа);
		Строка.ПолученоОтКлиента = СтрокаРасшифровкаПлатежа.СуммаПлатежа;
	КонецЦикла;
	
КонецПроцедуры // ПолучитьРасшифровкаПлатежаИзХранилища()

&НаКлиенте
Процедура РасчетыСАгентомКорреспонденцияПриИзменении(Элемент)
	
	Если Корреспонденция <> Объект.Корреспонденция Тогда
		УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденции(Истина, "АналитикаПрочихДоходовИРасходовРасчетыСПочтой");
		Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
		Корреспонденция = Объект.Корреспонденция;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПокупкаВалютыКорреспонденцияРеглПриИзменении(Элемент)
	
	Если Не ИспользоватьТолькоРегламентированногоПланаСчетов Тогда
		РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(Объект.КорреспонденцияРегл, Объект.Корреспонденция);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетыПрочиеКорреспонденцияРеглПриИзменении(Элемент)
	
	Если НЕ ИспользоватьТолькоРегламентированногоПланаСчетов Тогда 
		РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(Объект.КорреспонденцияРегл, Объект.Корреспонденция);
		РасчетыПрочиеКорреспонденцияПриИзменении(Элементы.РасчетыПрочиеКорреспонденция);
	Иначе
		Если КорреспонденцияРегл <> Объект.КорреспонденцияРегл Тогда
			УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденцииРегл(Истина);
			Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
			КорреспонденцияРегл = Объект.КорреспонденцияРегл;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидУдержанияНДФЛПриИзменении(Элемент)
	РасчитатьСуммы_ПФ_НДФЛ();
КонецПроцедуры

&НаКлиенте
Процедура ВидУдержанияПФПриИзменении(Элемент)
	РасчитатьСуммы_ПФ_НДФЛ();
КонецПроцедуры

//+++ Дмгг
&НаСервере
Процедура УстановитьТекущееЗначениеПодразделенияСотрудника()
	
	ДатаСреза = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	тзСрез = РегистрыСведений.Сотрудники.СрезПоследних(ДатаСреза, Новый Структура("Организация, Сотрудник", Объект.Организация, Объект.Подотчетник));	
	
	Если тзСрез.Количество() <> 0 Тогда 
		Объект.СтруктурнаяЕдиница = тзСрез[0].СтруктурнаяЕдиница;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПодотчетникПриИзмененииНаСервере()
	
	тзДанныеСотрудника = РегистрыСведений.Сотрудники.СрезПоследних(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()),Новый Структура("Организация, Сотрудник", Объект.Организация, Объект.Подотчетник));
	
	Если тзДанныеСотрудника.Количество() <> 0 Тогда 
		//Объект.СтруктурнаяЕдиница = тзДанныеСотрудника[0].СтруктурнаяЕдиница;
		//СтрокаЗапасов.УдерживатьПенсию = тзДанныеСотрудника[0].УчастникПенсионногоФонда;
		Объект.ВидУдержанияПФ = тзДанныеСотрудника[0].ВидУдержанияПФ;
		Объект.ВидУдержанияНДФЛ = тзДанныеСотрудника[0].ВидУдержанияНДФЛ;
		//СтрокаЗапасов.ВидНачисленияУдержания  = ВидНалогаНДФЛ[0].ВидНачисленияУдержания;
	КонецЕсли;
	
КонецПроцедуры
//--- Дмгг

Функция ПолучитьБанковскийСчетПоУмолчанию(Организация)

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Организации.БанковскийСчетПоУмолчанию
	               |ПОМЕСТИТЬ ВТБанковскиеСчета
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	Организации.Ссылка = &Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	БанковскиеСчета.Ссылка КАК БанковскийСчетПоУмолчанию
	               |ИЗ
	               |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБанковскиеСчета КАК ВТБанковскиеСчета
	               |		ПО (ВТБанковскиеСчета.БанковскийСчетПоУмолчанию = БанковскиеСчета.Ссылка)";
	
	Запрос.УстановитьПараметр("Организация",Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.БанковскийСчетПоУмолчанию;
	Иначе
		Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции	


&НаКлиенте
Процедура РасчетыСАгентомКорреспонденцияРеглПриИзменении(Элемент)
	
	Если НЕ ИспользоватьТолькоРегламентированногоПланаСчетов Тогда 
		РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(Объект.КорреспонденцияРегл, Объект.Корреспонденция);
		РасчетыСАгентомКорреспонденцияПриИзменении(Элементы.РасчетыПрочиеКорреспонденция);
	Иначе
		Если КорреспонденцияРегл <> Объект.КорреспонденцияРегл Тогда
			УстановитьВидимостьРеквизитовВЗависимостиОтКорреспонденцииРегл(Истина, "АналитикаПрочихДоходовИРасходовРасчетыСПочтой");
			Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
			КорреспонденцияРегл = Объект.КорреспонденцияРегл;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

