
Функция ВыполнитьМетодСервиса(ИмяМетода, ПараметрыМетода = Неопределено, Режим = 1, Token, ЗапускатьРеальныйБанк = ЛОЖЬ) Экспорт
	
	ПараметрыЗапроса = Новый Структура;     
	
	Если НЕ ПараметрыМетода = Неопределено Тогда
		ПараметрыЗапроса.Вставить("param", ПараметрыМетода);
	КонецЕсли;
	
	//результатом является Массив Соответсвий
	//РезультатЗапроса = ОтправитьЗапросXML(ПараметрыЗапроса, Режим, Token, ИмяМетода, ЗапускатьРеальныйБанк);
	РезультатЗапроса = ОтправитьЗапросXML_1С(ПараметрыЗапроса, Режим, Token, ИмяМетода, ЗапускатьРеальныйБанк);
	
	Если ИмяМетода = "api/documents/status/" Тогда
		//возвращаем статус
		
		Если РезультатЗапроса = Неопределено Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ka='ინფორმაციის გადაცემის შეცდომა! დოკუმენტს არ აქვს მინიჭებული უნიკალური გასაღები!';ru='Ошибка передачи информации! Документу не присвоен уникальный ключ!';en='Information Communication error! The document has not been assigned a unique key!'");		
			Сообщение.Сообщить();
		Иначе 
			
			КодОшибки = РезультатЗапроса.Получить("RejectCode");
			
			Если КодОшибки = "22" Тогда 
				ТекстОшибки = "გაუქმებულია, დამატებითი ინფორმაციისთვის დაგვიკავშირდით 2444444"; 
			ИначеЕсли КодОшибки = "21" Тогда 
				ТекстОшибки = "მიმღების ანგარიში და დასახელება არ ედრება"; 
			ИначеЕсли КодОшибки = "20" Тогда 
				ТекстОшибки = "დასააქცეპდებელი ბარათი"; 
			ИначеЕсли КодОшибки = "19" Тогда 
				ТекстОшибки = "ვადაგასული ბარათი"; 
			ИначеЕсли КодОшибки = "18" Тогда 
				ТекстОшибки = "დაბლოკილი ბარათი"; 
			ИначеЕсли КодОшибки = "17" Тогда 
				ТекстОшибки = "არასაკმარისი თანხა"; 
			ИначеЕсли КодОшибки = "16" Тогда 
				ТекстОшибки = "ფონტი არ იკითხება"; 
			ИначеЕсли КодОшибки = "15" Тогда 
				ТекстОшибки = "არასწორი დანიშნულება";
			ИначеЕсли КодОшибки = "14" Тогда 
				ТекстОшибки = "მიმღების ანგარიში არასწორია";
			ИначеЕсли КодОшибки = "13" Тогда 
				ТекстОшибки = "არ არის მითითებული სახაზინო კოდი";
			ИначеЕсли КодОшибки = "12" Тогда 
				ТекстОшибки = "არასწორი IBAN-ის ფორმატი";
			Иначе 
				Возврат РезультатЗапроса.Получить("Status");
			КонецЕсли;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ka='BoG ის სერვისთან მიმართვის შეცდომა!';ru='Ошибка обращения к сервисам BoG!';en='Error handling services to BoG!'") + Символы.ПС
			+ НСтр("ru = 'Код ошибки: '; ka = 'შეცდომის კოდი: '") + КодОшибки + Символы.ПС 
			+ НСтр("ru = 'Описание: '; ka = 'აღწერა: '") + ТекстОшибки + Символы.ПС;
			
			Сообщение.Сообщить();
		КонецЕсли;
		
	ИначеЕсли ИмяМетода = "api/rates/commercial/" Тогда 
		
		Если РезультатЗапроса = Неопределено Тогда  
			Возврат Неопределено;
		ИначеЕсли ТипЗнч(РезультатЗапроса) = Тип("Строка") Тогда
			Возврат РезультатЗапроса;
		Иначе
			//возвращаем курсы коммерческих валют
			Структура = Новый Структура;
			Структура.Вставить("КурсПродажи", РезультатЗапроса.Получить("Sell"));
			Структура.Вставить("КурсПокупки", РезультатЗапроса.Получить("Buy"));			
			Возврат Структура;
		КонецЕсли;
		
	ИначеЕсли ИмяМетода = "api/rates/commercial//" Тогда 
		
		Если РезультатЗапроса = Неопределено ИЛИ ТипЗнч(РезультатЗапроса) = Тип("Строка") Тогда
			Возврат Неопределено;
		Иначе
			//возвращаем курсы коммерческих валют
			Структура = Новый Структура;
			Структура.Вставить("КроссКурс", РезультатЗапроса);
			
			Возврат Структура;
		КонецЕсли;
		
	ИначеЕсли ИмяМетода = "api/accounts/" Тогда	
		
		Если РезультатЗапроса = Неопределено ИЛИ ТипЗнч(РезультатЗапроса) = Тип("Строка") Тогда
			Возврат Неопределено;
		Иначе 
			//возвращаем остаток на счете
			Структура = Новый Структура;
			Структура.Вставить("ДоступныйОстатокНаСчете", РезультатЗапроса.Получить("AvailableBalance"));
			Структура.Вставить("ТекущийОстатокНаСчете", РезультатЗапроса.Получить("CurrentBalance"));
			
			Возврат Структура;		
		КонецЕсли;
		
	ИначеЕсли ИмяМетода = "api/documents/bulk/domestic" ИЛИ ИмяМетода = "api/documents/bulk/foreign"  Тогда 
		
		Если ТипЗнч(РезультатЗапроса) = Тип("Соответствие") Тогда
			Для Каждого ЭлементМассива Из РезультатЗапроса Цикл 
				Если ЭлементМассива.Значение = "An error has occurred." Тогда 
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = НСтр("ka='BoG ის სერვისთან მიმართვის შეცდომა!';ru='Ошибка обращения к сервисам BoG!';en='Error handling services to BoG!'") + Символы.ПС
					+ НСтр("ru = 'Код ошибки: '; ka = 'შეცდომის კოდი: '") + "500" + Символы.ПС 
					+ НСтр("ru = 'Описание: '; ka = 'აღწერა: '") + ЭлементМассива.Значение + Символы.ПС;
					
					Сообщение.Сообщить();
				КонецЕсли;			
			КонецЦикла;	
		Иначе 	
			Структура = Новый Структура;
			Структура.Вставить("Результат", 0);
			Структура.Вставить("УникальныйКлюч", СтрЗаменить(СтрЗаменить(РезультатЗапроса, ",", ""),Символы.НПП,"")); 
			
			Возврат Структура;			
			
		КонецЕсли;
		
	ИначеЕсли ИмяМетода = "api/documents/bulk/status/" Тогда
		
		ТаблицаСтатусов = Новый ТаблицаЗначений;
		
		ТаблицаСтатусов.Колонки.Добавить("УникальныйИД" , Новый ОписаниеТипов("Строка"));
		ТаблицаСтатусов.Колонки.Добавить("Статус"       , Новый ОписаниеТипов("Строка"));
		
		Если ТипЗнч(РезультатЗапроса) = Тип("Соответствие") Тогда
			Для Каждого ЭлементМассива Из РезультатЗапроса Цикл 
				Если ЭлементМассива.Значение = "An error has occurred." Тогда 
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = НСтр("ka='BoG ის სერვისთან მიმართვის შეცდომა!';ru='Ошибка обращения к сервисам BoG!';en='Error handling services to BoG!'") + Символы.ПС
					+ НСтр("ru = 'Код ошибки: '; ka = 'შეცდომის კოდი: '") + "500" + Символы.ПС 
					+ НСтр("ru = 'Описание: '; ka = 'აღწერა: '") + ЭлементМассива.Значение + Символы.ПС;
					
					Сообщение.Сообщить();
				ИначеЕсли ТипЗнч(ЭлементМассива.Значение) = Тип("Массив") Тогда 
					
					Для Каждого СтрМассива Из ЭлементМассива.Значение Цикл											
						НоваяСтрока = ТаблицаСтатусов.Добавить();
						НоваяСтрока.УникальныйИД = СтрЗаменить(СтрМассива.Получить("UniqueId"), "-", "");
						НоваяСтрока.Статус       = СтрМассива.Получить("Status");
					КонецЦикла;
					
					Возврат ТаблицаСтатусов;
				Иначе 
					НоваяСтрока = ТаблицаСтатусов.Добавить();
					НоваяСтрока.УникальныйИД = РезультатЗапроса.Получить("UniqueId");
					НоваяСтрока.Статус       = РезультатЗапроса.Получить("Status");
				КонецЕсли;			
			КонецЦикла;				
		КонецЕсли;
		
	ИначеЕсли ИмяМетода = "api/statement/" Тогда
		
		Если Не РезультатЗапроса = Неопределено Тогда 
			
			Структура = Новый Структура;
			Структура.Вставить("Id", РезультатЗапроса.Получить("Id"));
			Структура.Вставить("Count", РезультатЗапроса.Получить("Count")); 
			
			Возврат Структура;	
			
		КонецЕсли;
		
	ИначеЕсли ИмяМетода = "api/statement////" Тогда
		
		Если Не ТипЗнч(РезультатЗапроса) = Тип("Массив") И Не РезультатЗапроса = Неопределено Тогда
			
			Если РезультатЗапроса["Message"] = "An error has occurred." Тогда 
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ka='მითითებული პერიოდისთვის მონაცემები ვერ მოიძებნა!';ru='Не найдено данных на указанный период!';en='Found data for this period!'") + Символы.ПС
				+ НСтр("ru = 'Код ошибки: '; ka = 'შეცდომის კოდი: '") + "500" + Символы.ПС;
				
				Сообщение.Сообщить();			
			КонецЕсли;    
		Иначе 
			Возврат РезультатЗапроса;
			
		КонецЕсли;	
	ИначеЕсли ИмяМетода = "api/statement/summary/" Тогда
		
		Если Не РезультатЗапроса = Неопределено Тогда
			Возврат РезультатЗапроса;			
		Иначе 
			Если РезультатЗапроса["Message"] = "An error has occurred." Тогда 
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ka='BoG ის სერვისთან მიმართვის შეცდომა!';ru='Ошибка обращения к сервисам BoG!';en='Error handling services to BoG!'") + Символы.ПС
				+ НСтр("ru = 'Код ошибки: '; ka = 'შეცდომის კოდი: '") + "500" + Символы.ПС 
				+ НСтр("ru = 'Описание: '; ka = 'აღწერა: '") + Символы.ПС;
				
				Сообщение.Сообщить();			
			КонецЕсли; 
			
		КонецЕсли;	
	Иначе 
		
		Если Не РезультатЗапроса = Неопределено Тогда 
			
			Для Каждого ЭлементМассива Из РезультатЗапроса Цикл 				
				Если Не ТипЗнч(ЭлементМассива) = Тип("Соответствие") Тогда            
					Если ЭлементМассива.Значение = "An error has occurred." Тогда 
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = НСтр("ka='BoG ის სერვისთან მიმართვის შეცდომა!';ru='Ошибка обращения к сервисам BoG!';en='Error handling services to BoG!'") + Символы.ПС
						+ НСтр("ru = 'Код ошибки: '; ka = 'შეცდომის კოდი: '") + "500" + Символы.ПС 
						+ НСтр("ru = 'Описание: '; ka = 'აღწერა: '") + ЭлементМассива.Значение + Символы.ПС;
						
						Сообщение.Сообщить();
					КонецЕсли;			
				Иначе 
					Результат = ЭлементМассива.Получить("ResultCode");
					// проверки по кодам --
					Если Результат = 0 Тогда
						
						Структура = Новый Структура;
						Структура.Вставить("Результат", ЭлементМассива.Получить("ResultCode"));
						Структура.Вставить("УникальныйКлюч", ЭлементМассива.Получить("UniqueKey")); 
						
						Возврат Структура;
						
					ИначеЕсли Результат = 147 Тогда 
						ТекстСообщения = "არასწორი IBAN-ის ფორმატი";
					ИначеЕсли Результат = 333 Тогда
						ТекстСообщения = "სამუშაო ნაშთი არ არის საკმარისი. გსურთ საბუთის შექმნა?";
					ИначеЕсли Результат = 363 Тогда
						ТекстСообщения = "დოკუმენტი დუბლირებულია. გსურთ საბუთის შექმნა?";
					ИначеЕсли Результат = 112 Тогда
						ТекстСообщения = "გამგზავნის ანგარიში არასწორია";
					ИначеЕсли Результат = 4 Тогда
						ТекстСообщения = "კონვერტაციის კურსი არასწორია";
					ИначеЕсли Результат = 111 Тогда
						ТекстСообщения = "გადარიცხვის ვალუტა არასწორია";
					ИначеЕсли Результат = 110 Тогда
						ТекстСообщения = "თანხის ფორმატი არასწორია";
					ИначеЕсли Результат = 91 Тогда
						ТекстСообщения = "დანიშნულება გრძელია";
					ИначеЕсли Результат = 90 Тогда
						ТекстСообщения = "მიმღების დასახელება გრძელია";
					ИначеЕсли Результат = 444 Тогда
						ТекстСообщения = "თანხა არ არის საკმარისი";
						//+++ Истомин, Костыль. Документ выгружается
						Сообщить("თანხა არ არის საკმარისი. საჭიროა კორექტირება");
						Структура = Новый Структура;
						Структура.Вставить("Результат", ЭлементМассива.Получить("ResultCode"));
						Структура.Вставить("УникальныйКлюч", ЭлементМассива.Получить("UniqueKey")); 
						//---
						
						Возврат Структура;
					ИначеЕсли Результат = 999 Тогда
						ТекстСообщения = "document.result.code.general.exception";
					ИначеЕсли Результат = 123 Тогда
						ТекстСообщения = "document.result.code.general.exception";
					ИначеЕсли Результат = 122 Тогда
						ТекстСообщения = "document.result.code.general.exception";
					ИначеЕсли Результат = 47 Тогда
						ТекстСообщения = "ვალუტირების თარიღი არასწორია";
					ИначеЕсли Результат = 48 Тогда
						ТекстСообщения = "ვალუტირების თარიღი არასწორია";
					ИначеЕсли Результат = 57 Тогда
						ТекстСообщения = "დოკუმენტის ვალიდაციისას დაფიქსირდა შეცდომა";
					ИначеЕсли Результат = 40 Тогда
						ТекстСообщения = "ხაზინაში გადარიცხვის პარამეტრები არასწორია";
					ИначеЕсли Результат = 36 Тогда
						ТекстСообщения = "გამგზავნის საიდენტიფიკაციო კოდი არასწორია";
					ИначеЕсли Результат = 35 Тогда
						ТекстСообщения = "გამგზავნის ანგარიშის ტიპი არასწორია";
					ИначеЕсли Результат = 33 Тогда
						ТекстСообщения = "გამგზავნის ანგარიში არასწორია";
					ИначеЕсли Результат = 34 Тогда
						ТекстСообщения = "გამგზავნის ანგარიშის ვალუტა არასწორია";
					ИначеЕсли Результат = 150 Тогда
						ТекстСообщения = "აუცილებელი ველი";
					ИначеЕсли Результат = 151 Тогда
						ТекстСообщения = "ველის მნიშვნელობა უნდა იყოს რიცვითი";
					ИначеЕсли Результат = 152 Тогда
						ТекстСообщения = "ველის ფორმატი არასწორია";
					ИначеЕсли Результат = 153 Тогда
						ТекстСообщения = "ველის სიგრძე არასწორია";
					ИначеЕсли Результат = 154 Тогда
						ТекстСообщения = "ველის მნიშვნელობა არ მოიძებნა, აირჩიეთ ჩამონათვალიდან";			
					ИначеЕсли Результат = 121 Тогда
						ТекстСообщения = "ოპერაციის ვალუტა არასწორია";
					ИначеЕсли Результат = 120 Тогда
						ТекстСообщения = "ოპერაციის ვალუტისთვის ვერ მოიძებნა კურსი";
					ИначеЕсли Результат = 119 Тогда
						ТекстСообщения = "დანიშნულება დასაშვებზე გრძელია";
					ИначеЕсли Результат = 118 Тогда
						ТекстСообщения = "დოკუმენტში პარამეტრები არასწორია";
					ИначеЕсли Результат = 117 Тогда
						ТекстСообщения = "გამგზავნი და მიმღები ფილიალი სხვადასხვაა";			
					ИначеЕсли Результат = 116 Тогда
						ТекстСообщения = "გამგზავნი და მიმღები სხვადასხვა კლიენტია";			
					ИначеЕсли Результат = 115 Тогда
						ТекстСообщения = "გამგზავნი და მიმღების ანგარიშების ვალუტა ერთიდაიგივეა";				
					ИначеЕсли Результат = 114 Тогда
						ТекстСообщения = "გამგზავნი და მიმღების ანგარიშები ერთიდაიგივეა";			
					ИначеЕсли Результат = 113 Тогда
						ТекстСообщения = "მიმღების ანგარიში არასწორია";			
					ИначеЕсли Результат = 87 Тогда
						ТекстСообщения = "მიმღების ანგარიში არასწორია";
					ИначеЕсли Результат = 86 Тогда
						ТекстСообщения = "საკომისიოს ანგარიში არასწორია";				
					ИначеЕсли Результат = 85 Тогда
						ТекстСообщения = "საკომისიოს პარამეტრების არასწორია";
					ИначеЕсли Результат = 84 Тогда
						ТекстСообщения = "სისტემური ფაზა (მიმდინარეობს დღის დახურვა)";
					ИначеЕсли Результат = 83 Тогда
						ТекстСообщения = "არასაკმარისი თანხა";				
					ИначеЕсли Результат = 82 Тогда
						ТекстСообщения = "ვალუტა არასწორია";
					ИначеЕсли Результат = 81 Тогда
						ТекстСообщения = "ვალუტირების თარიღი არასწორია";
					ИначеЕсли Результат = 80 Тогда
						ТекстСообщения = "გადარიცხვის დანიშნულების ფორმატი არასწორია";				
					ИначеЕсли Результат = 79 Тогда
						ТекстСообщения = "გადარიცხვის დეტალების ფორმატი არასწორია";
					ИначеЕсли Результат = 78 Тогда
						ТекстСообщения = "მიმღების ანგარიში არასწორია";				
					ИначеЕсли Результат = 77 Тогда
						ТекстСообщения = "მიმღების ანგარიში ცარიელია";
					ИначеЕсли Результат = 76 Тогда
						ТекстСообщения = "შუამავალის ინფორმაცია ცარიელია";			
					ИначеЕсли Результат = 75 Тогда
						ТекстСообщения = "მიმღების დასახელება ცარიელია";
					ИначеЕсли Результат = 74 Тогда
						ТекстСообщения = "გამგზავნის დასახელება ცარიელია";				
					ИначеЕсли Результат = 73 Тогда
						ТекстСообщения = "გამგზავნის ანგარიში არასწორია";				
					ИначеЕсли Результат = 72 Тогда
						ТекстСообщения = "მიმღების პარამეტრები არასწორია";				
					ИначеЕсли Результат = 71 Тогда
						ТекстСообщения = "გამგზავნი და მიმღების ანგარიშების ვალუტა არასწორია";			
					ИначеЕсли Результат = 2 Тогда
						ТекстСообщения = "დოკუმენტის ტიპი არ მოიძებნა";				
					ИначеЕсли Результат = 1 Тогда
						ТекстСообщения = "დოკუმენტი არ მოიძებნა";
					ИначеЕсли Результат = 50 Тогда
						ТекстСообщения = "თანხის ფორმატი არასწორია";				
					ИначеЕсли Результат = 45 Тогда
						ТекстСообщения = "მიმღების ანგარიშის ვალუტა არასწორია";				
					ИначеЕсли Результат = 30 Тогда
						ТекстСообщения = "მიმღების ანგარიში და ბანკის კოდი არის ცარიელი";			
					ИначеЕсли Результат = 44 Тогда
						ТекстСообщения = "მიმღების ანგარიში არასწორია";				
					ИначеЕсли Результат = 46 Тогда
						ТекстСообщения = "მიმღების ანგარიშის ტიპი არასწორია";				
					ИначеЕсли Результат = 37 Тогда
						ТекстСообщения = "მიმღების ანგარიში ცარიელია";				
					ИначеЕсли Результат = 38 Тогда
						ТекстСообщения = "მიმღების ანგარიშის სიგრძე დასშვებზე მეტია";
					ИначеЕсли Результат = 39 Тогда
						ТекстСообщения = "მიმღების ანგარიში არასწორია";		
					ИначеЕсли Результат = 31 Тогда
						ТекстСообщения = "მიმღები ბანკის კოდი არასწორია";			
					ИначеЕсли Результат = 42 Тогда
						ТекстСообщения = "მიმღების დასახელება ცარიელია";
					ИначеЕсли Результат = 43 Тогда
						ТекстСообщения = "მიმღების დასახელების სიგრძე დასშვებზე მეტია";
					ИначеЕсли Результат = 41 Тогда
						ТекстСообщения = "მიმღების Inn არასწორია";
					ИначеЕсли Результат = 49 Тогда
						ТекстСообщения = "გადარიცხვის ვალუტა არასწორია";
					ИначеЕсли Результат = 58 Тогда
						ТекстСообщения = "დოკუმენტის შექმნისას დაფიქსირდა შეცდომა";
					ИначеЕсли Результат = 51 Тогда
						ТекстСообщения = "საკომისიო თანხის ფორმატი არასწორია";
					ИначеЕсли Результат = 56 Тогда
						ТекстСообщения = "დამატებითი ველის სიგრძე დასაშვებზე მეტია";
					ИначеЕсли Результат = 54 Тогда
						ТекстСообщения = "გადარიცხვის დანიშნულება ცარიელია";
					ИначеЕсли Результат = 55 Тогда
						ТекстСообщения = "გადარიცხვის დანიშნულების სიგრძე დასაშვებზე მეტია";
					ИначеЕсли Результат = 52 Тогда
						ТекстСообщения = "გადამხდელის Inn არასწორია";
					ИначеЕсли Результат = 32 Тогда
						ТекстСообщения = "მოცემული ტიპის გადარიცხვისთვის შაბლონი არ არის განსაზღვრული";		
					ИначеЕсли Результат = 1001 Тогда
						ТекстСообщения = "გამგზავნის ანგარიში არასწორია";	
					ИначеЕсли Результат = 1002 Тогда
						ТекстСообщения = "მიმღების პარამეტრები არასწორია";	
					КонецЕсли;  		
					
					КодОшибки = ЭлементМассива["ResultCode"];
					КраткоеОписание = ЭлементМассива["error_str"];
					ДеталиОшибки = ЭлементМассива["error_detail"];
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = НСтр("ka='BoG ის სერვისთან მიმართვის შეცდომა!';ru='Ошибка обращения к сервисам BoG!';en='Error handling services to BoG!'") + Символы.ПС
					+ НСтр("ru = 'Код ошибки: '; ka = 'შეცდომის კოდი: '") + КодОшибки + Символы.ПС 
					+ НСтр("ru = 'Описание: '; ka = 'აღწერა: '") + ТекстСообщения + Символы.ПС;
					
					Сообщение.Сообщить();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#Область Комментарий

//Функция ОтправитьЗапросXML(ПараметрыЗапроса, Режим = 1, Token, ИмяМетода) Экспорт
//	
//	Перем mhttp;
//	
//	//Сервер = "https://cib2-web-dev.bog.ge/";
//	Сервер = "https://api.businessonline.ge/";

//	Если mhttp = Неопределено Тогда
//		mhttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1"); 
//	Конецесли;
//	
//	mhttp.SetTimeouts(6000000, 6000000, 6000000, 6000000);
//	
//	Если ИмяМетода = "api/documents/foreign" ИЛИ ИмяМетода = "api/documents/domestic" ИЛИ ИмяМетода = "api/documents/conversion" ИЛИ ИмяМетода = "api/documents/bulk/domestic" ИЛИ ИмяМетода = "api/documents/bulk/foreign" Тогда  
//		mhttp.open("POST", Сервер+ИмяМетода, False);	
//	ИначеЕсли ИмяМетода = "api/documents/status/" ИЛИ ИмяМетода = "api/documents/bulk/status/" Тогда 
//		Если ЗначениеЗаполнено(ПараметрыЗапроса.param.Key) Тогда 
//			mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.Key+"", False);		
//		Иначе 	
//			Возврат Неопределено;
//		КонецЕсли;
//	ИначеЕсли ИмяМетода = "api/rates/commercial/" Тогда  
//		mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.currency+"", False);	
//	ИначеЕсли ИмяМетода = "api/rates/commercial//" Тогда  
//		mhttp.open("GET", Сервер+"api/rates/commercial/"+ПараметрыЗапроса.param.sellCurrency+"/"+ПараметрыЗапроса.param.buyCurrency, False);	
//	ИначеЕсли ИмяМетода = "api/accounts/" Тогда 
//		mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"", False);	
//	ИначеЕсли ИмяМетода = "api/statement/" Тогда 	                                            
//		mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"/"+ПараметрыЗапроса.param.startDate+"/"+ПараметрыЗапроса.param.endDate+"", False);	
//	ИначеЕсли ИмяМетода = "api/statement////" Тогда 	                                            
//		mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"/"+ПараметрыЗапроса.param.id+"/"+ПараметрыЗапроса.param.page+"", False);
//	ИначеЕсли ИмяМетода = "api/statement/summary/" Тогда  	
//		mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"/"+ПараметрыЗапроса.param.id+"", False);
//		//api/statement/summary/{accountNumber}/{currency}/{id}
//	КонецЕсли;
//	
//	//Попытка
//	//	mhttp.SetClientCertificate("LOCAL_MACHINE\\Intermediate Certification Authorities\\Certificates\\CIB2-WEB-DEV.bog.ge");
//	//Исключение
//	//	Сообщение = Новый СообщениеПользователю;
//	//	Сообщение.Текст = НСтр("ka='ინფორმაციის გადაცემის შეცდომა! შეამოწმეთ აწყობის პარამეტრების შევსება';ru='Ошибка передачи информации! Проверьте правильность заполнения настроек';en='Information Communication error! Check the correctness of the settings'");
//	//	ПриЗагрузкеВозниклиОшибки = Истина
//	//КонецПопытки;	
//	
//	mhttp.setRequestHeader("Content-Type", "text/xml; charset=utf-8");
//	mhttp.setRequestHeader("Authorization", "Bearer " + Token + " ");			
//	//mhttp.setRequestHeader("Accept", "application/xml");  // если хочу ответ в формате XML	
//	
//	Если ИмяМетода = "api/documents/foreign" Тогда 
//		
//		МД5Объект = ПолучитьОбъектМД5();
//		
//		UniqueId = MD5(МД5Объект, ПараметрыЗапроса.param.DocumentNo);
//		
//		xml = "<?xml version=""1.0"" encoding=""UTF-8""?>" 
//		+"<ArrayOfForeignPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"
//		+"<ForeignPayment>"
//		+"<Amount>"+ПараметрыЗапроса.param.Amount+"</Amount>"
//		+"<BeneficiaryAccountNumber>"+ПараметрыЗапроса.param.BeneficiaryAccountNumber+"</BeneficiaryAccountNumber>"
//		+"<Currency>"+ПараметрыЗапроса.param.Currency+"</Currency>"
//		+"<DocumentNo>"+ПараметрыЗапроса.param.DocumentNo+"</DocumentNo>"
//		+"<SourceAccountNumber>"+ПараметрыЗапроса.param.SourceAccountNumber+"</SourceAccountNumber>"
//		+"<UniqueId>"+UniqueId+"</UniqueId>"
//		+"<AdditionalInformation>"+ПараметрыЗапроса.param.AdditionalInformation+"</AdditionalInformation>"
//		+"<BeneficiaryBankCode>"+ПараметрыЗапроса.param.BeneficiaryBankCode+"</BeneficiaryBankCode>"
//		+"<BeneficiaryBankName>"+ПараметрыЗапроса.param.BeneficiaryBankName+"</BeneficiaryBankName>"
//		+"<BeneficiaryInn>"+ПараметрыЗапроса.param.BeneficiaryInn+"</BeneficiaryInn>"
//		+"<BeneficiaryName>"+ПараметрыЗапроса.param.BeneficiaryName+"</BeneficiaryName>"
//		+"<Charges>"+ПараметрыЗапроса.param.Charges+"</Charges>"
//		+"<ComissionAccountNumber>"+ПараметрыЗапроса.param.SourceAccountNumber+"</ComissionAccountNumber>"
//		+"<IntermediaryBankCode>"+ПараметрыЗапроса.param.IntermediaryBankCode+"</IntermediaryBankCode>"
//		+"<IntermediaryBankName>"+ПараметрыЗапроса.param.IntermediaryBankName+"</IntermediaryBankName>"
//		+"<PaymentDetail>"+ПараметрыЗапроса.param.PaymentDetail+"</PaymentDetail>"
//		+"<ValueDate>"+ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата())+"</ValueDate>"
//		+"</ForeignPayment>"
//		+"</ArrayOfForeignPayment>";
//		
//	ИначеЕсли ИмяМетода = "api/documents/domestic" Тогда  
//		
//		МД5Объект = ПолучитьОбъектМД5();
//		UniqueId = MD5(МД5Объект, ПараметрыЗапроса.param.DocumentNo);
//		
//		xml = "<?xml version=""1.0"" encoding=""UTF-8""?>" 
//		+"<ArrayOfDomesticPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"
//		+"<DomesticPayment>"	
//		+"<Amount>"+ПараметрыЗапроса.param.Amount+"</Amount>"
//		+"<BeneficiaryAccountNumber>"+ПараметрыЗапроса.param.BeneficiaryAccountNumber+"</BeneficiaryAccountNumber>"
//		+"<Currency>"+ПараметрыЗапроса.param.Currency+"</Currency>"
//		+"<DocumentNo>"+ПараметрыЗапроса.param.DocumentNo+"</DocumentNo>"
//		+"<SourceAccountNumber>"+ПараметрыЗапроса.param.SourceAccountNumber+"</SourceAccountNumber>"
//		+"<UniqueId>"+UniqueId+"</UniqueId>"
//		+"<AdditionalInformation>"+ПараметрыЗапроса.param.AdditionalInformation+"</AdditionalInformation>"
//		+"<BeneficiaryBankCode>"+ПараметрыЗапроса.param.BeneficiaryBankCode+"</BeneficiaryBankCode>"
//		+"<BeneficiaryInn>"+ПараметрыЗапроса.param.BeneficiaryInn+"</BeneficiaryInn>"
//		+"<BeneficiaryName>"+ПараметрыЗапроса.param.BeneficiaryName+"</BeneficiaryName>"
//		+"<DispatchType>"+ПараметрыЗапроса.param.DispatchType+"</DispatchType>"
//		+"<Nomination>"+ПараметрыЗапроса.param.Nomination+"</Nomination>"
//		+"<PayerInn>"+ПараметрыЗапроса.param.PayerInn+"</PayerInn>"
//		+"<PayerName>"+ПараметрыЗапроса.param.PayerName+"</PayerName>"
//		+"<ValueDate>"+ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата())+"</ValueDate>"
//		+"</DomesticPayment>"
//		+"</ArrayOfDomesticPayment>";
//		
//	ИначеЕсли ИмяМетода = "api/documents/bulk/foreign" Тогда  
//		
//		xml = "";
//		ТекстЗапроса = "";
//		
//		МД5Объект = ПолучитьОбъектМД5();
//		
//		Для Каждого Строка Из ПараметрыЗапроса.param.Документ.ВыплатаЗаработнойПлаты Цикл
//			
//			ТаблицаУИД = Новый ТаблицаЗначений;
//			ТаблицаУИД.Колонки.Добавить("УникальныйИД", Новый ОписаниеТипов("Строка"));
//			ТаблицаУИД.Колонки.Добавить("НомерСтроки" , Новый ОписаниеТипов("Число"));
//			ТаблицаУИД.Колонки.Добавить("Ведомость"   , Новый ОписаниеТипов("ДокументСсылка.ЗарплатаКВыплате"));
//			
//			Для Каждого Строка1 ИЗ Строка.Ведомость.СуммаКВыплате Цикл 
//				
//				//документ генерируется из Номера документа + НомерВедомости + НомерСтроки.
//				//так как длина документа ограничена, у номера документа и у номера ведосомти отсекаются 0 с левой стороны.
//				
//				ДлинаНомераДокумента = СтрДлина(ПараметрыЗапроса.param.Документ.Номер);
//				ДлинаНомераВедомости = СтрДлина(Строка.Ведомость.Номер);
//				
//				НомерДокумента = ПараметрыЗапроса.param.Документ.Номер;
//				НомерВедомости = Строка.Ведомость.Номер;
//				
//				Пока ДлинаНомераДокумента > 0 И Найти(НомерДокумента, 0) = 1 Цикл
//					НомерДокумента = Прав(НомерДокумента, ДлинаНомераДокумента -1); 
//					ДлинаНомераДокумента = ДлинаНомераДокумента -1;
//				КонецЦикла;
//				
//				Пока ДлинаНомераВедомости > 0 И Найти(НомерВедомости, 0) = 1 Цикл
//					НомерВедомости = Прав(НомерВедомости, ДлинаНомераВедомости -1); 
//					ДлинаНомераВедомости = ДлинаНомераВедомости -1;
//				КонецЦикла;
//				
//				DocumentNoПред = НомерДокумента + Прав(СтрЗаменить(Год(ПараметрыЗапроса.param.Документ.Дата), ",", ""),2) + НомерВедомости + Прав(СтрЗаменить(Год(Строка.Ведомость.Дата), ",", ""),2) + Строка1.НомерСтроки;
//				
//				DocumentNo = MD5(МД5Объект, DocumentNoПред); 
//				
//				ДокНом_УИД = Лев(DocumentNo, 16);
//				
//				// присваиваю УникИД строкам ТЧ			
//				НоваяСтрока = ТаблицаУИД.Добавить();
//				НоваяСтрока.УникальныйИД = DocumentNo;
//				НоваяСтрока.НомерСтроки  = Строка1.НомерСтроки;
//				НоваяСтрока.Ведомость    = Строка.Ведомость;
//				// присваиваю УникИД строкам ТЧ
//				
//				Amount = СтрЗаменить(СтрЗаменить(Строка(Строка1.СуммаКВыплате),",", ""), " ", "");
//				
//				ТекстЗапроса = ТекстЗапроса+"<ForeignPayment>"	
//				+"<Amount>"+Amount+"</Amount>"
//				//+"<BeneficiaryAccountNumber>"+Строка1.ОсновнойБанковскийСчет.НомерСчета+"</BeneficiaryAccountNumber>" //DO-25834
//				+"<BeneficiaryAccountNumber>"+Лев(СокрЛП(Строка1.Сотрудник.ОсновнойБанковскийСчет.НомерСчета),22)+"</BeneficiaryAccountNumber>"
//				+"<Currency>"+ПараметрыЗапроса.param.Currency+"</Currency>"
//				+"<DocumentNo>"+ДокНом_УИД+"</DocumentNo>"
//				+"<SourceAccountNumber>"+ПараметрыЗапроса.param.Документ.СчетОрганизации.НомерСчета+"</SourceAccountNumber>"
//				+"<UniqueId>"+DocumentNo+"</UniqueId>"
//				+"<AdditionalInformation>"+ПараметрыЗапроса.param.Документ.Комментарий+"</AdditionalInformation>"
//				//+"<BeneficiaryBankCode>"+Строка1.ОсновнойБанковскийСчет.Банк.Код+"</BeneficiaryBankCode>"
//				//+"<BeneficiaryBankName>"+Строка1.ОсновнойБанковскийСчет.Банк.Наименование+"</BeneficiaryBankName>"
//				+"<BeneficiaryBankCode>"+Строка1.Сотрудник.ОсновнойБанковскийСчет.Банк.Код+"</BeneficiaryBankCode>"
//				+"<BeneficiaryBankName>"+Строка1.Сотрудник.ОсновнойБанковскийСчет.Банк.Наименование+"</BeneficiaryBankName>"
//				//+"<BeneficiaryInn>"+Строка1.Сотрудник.Физлицо.ЛичныйНомер+"</BeneficiaryInn>"
//				+"<BeneficiaryInn></BeneficiaryInn>"
//				+"<BeneficiaryName>"+Строка1.Сотрудник.Наименование+"</BeneficiaryName>"
//				+"<Charges>"+ПараметрыЗапроса.param.Документ.ТипКомиссии+"</Charges>"
//				+"<ComissionAccountNumber>"+ПараметрыЗапроса.param.ComissionAccountNumber+"</ComissionAccountNumber>"
//				+"<IntermediaryBankCode>"+ПараметрыЗапроса.param.IntermediaryBankCode+"</IntermediaryBankCode>"
//				+"<IntermediaryBankName>"+ПараметрыЗапроса.param.IntermediaryBankName+"</IntermediaryBankName>"
//				+"<PaymentDetail>"+ПараметрыЗапроса.param.PaymentDetail+"</PaymentDetail>"
//				+"<ValueDate>"+ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата())+"</ValueDate>"
//				+"</ForeignPayment>"
//				
//			КонецЦикла;
//		КонецЦикла;
//		
//		xml = xml+"<?xml version=""1.0"" encoding=""UTF-8""?>"+"<ArrayOfForeignPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"+ТекстЗапроса+"</ArrayOfForeignPayment>";
//		
//	ИначеЕсли ИмяМетода = "api/documents/bulk/domestic" Тогда  
//		
//		xml = "";
//		ТекстЗапроса = "";
//		
//		МД5Объект = ПолучитьОбъектМД5();
//		
//		Для Каждого Строка Из ПараметрыЗапроса.param.Документ.ВыплатаЗаработнойПлаты Цикл
//			
//			ТаблицаУИД = Новый ТаблицаЗначений;
//			ТаблицаУИД.Колонки.Добавить("УникальныйИД", Новый ОписаниеТипов("Строка"));
//			ТаблицаУИД.Колонки.Добавить("НомерСтроки" , Новый ОписаниеТипов("Число"));
//			ТаблицаУИД.Колонки.Добавить("Ведомость"   , Новый ОписаниеТипов("ДокументСсылка.ЗарплатаКВыплате"));
//			
//			Для Каждого Строка1 ИЗ Строка.Ведомость.СуммаКВыплате Цикл 
//				
//				//документ генерируется из Номера документа + НомерВедомости + НомерСтроки.
//				//так как длина документа ограничена, у номера документа и у номера ведосомти отсекаются 0 с левой стороны.
//				
//				ДлинаНомераДокумента = СтрДлина(ПараметрыЗапроса.param.Документ.Номер);
//				ДлинаНомераВедомости = СтрДлина(Строка.Ведомость.Номер);
//				
//				НомерДокумента = ПараметрыЗапроса.param.Документ.Номер;
//				НомерВедомости = Строка.Ведомость.Номер;
//				
//				Пока ДлинаНомераДокумента > 0 И Найти(НомерДокумента, 0) = 1 Цикл
//					НомерДокумента = Прав(НомерДокумента, ДлинаНомераДокумента -1); 
//					ДлинаНомераДокумента = ДлинаНомераДокумента -1;
//				КонецЦикла;
//				
//				Пока ДлинаНомераВедомости > 0 И Найти(НомерВедомости, 0) = 1 Цикл
//					НомерВедомости = Прав(НомерВедомости, ДлинаНомераВедомости -1); 
//					ДлинаНомераВедомости = ДлинаНомераВедомости -1;
//				КонецЦикла;
//				
//				DocumentNoПред = НомерДокумента + Прав(СтрЗаменить(Год(ПараметрыЗапроса.param.Документ.Дата), ",", ""),2) + НомерВедомости + Прав(СтрЗаменить(Год(Строка.Ведомость.Дата), ",", ""),2) + Строка1.НомерСтроки;
//				
//				DocumentNo = MD5(МД5Объект, DocumentNoПред); 
//				
//				ДокНом_УИД = Лев(DocumentNo, 16);
//				
//				// присваиваю УникИД строкам ТЧ			
//				НоваяСтрока = ТаблицаУИД.Добавить();
//				НоваяСтрока.УникальныйИД = DocumentNo;
//				НоваяСтрока.НомерСтроки  = Строка1.НомерСтроки;
//				НоваяСтрока.Ведомость    = Строка.Ведомость;
//				// присваиваю УникИД строкам ТЧ               
//				
//				Amount = СтрЗаменить(СтрЗаменить(Строка(Строка1.СуммаКВыплате),",", ""), " ", "");
//				
//				BeneficiaryAccountNumber = Лев(СокрЛП(Строка1.Сотрудник.ОсновнойБанковскийСчет.НомерСчета),22); //DO-25834
//				//Лев(СокрЛП(Строка1.ОсновнойБанковскийСчет.НомерСчета),22);
//				SourceAccountNumber = Лев(СокрЛП(ПараметрыЗапроса.param.Документ.СчетОрганизации.НомерСчета), 22);
//				
//				ТекстЗапроса = ТекстЗапроса+"<DomesticPayment>"	
//				+"<Amount>"+Amount+"</Amount>"
//				//+"<BeneficiaryAccountNumber>"+Строка1.ОсновнойБанковскийСчет.НомерСчета+"</BeneficiaryAccountNumber>"
//				+"<BeneficiaryAccountNumber>"+BeneficiaryAccountNumber+"</BeneficiaryAccountNumber>"
//				+"<Currency>"+ПараметрыЗапроса.param.Currency+"</Currency>"
//				+"<DocumentNo>"+ДокНом_УИД+"</DocumentNo>"
//				//+"<SourceAccountNumber>"+ПараметрыЗапроса.param.Документ.СчетОрганизации.НомерСчета+"</SourceAccountNumber>"
//				+"<SourceAccountNumber>"+SourceAccountNumber+"</SourceAccountNumber>"
//				+"<UniqueId>"+DocumentNo+"</UniqueId>"
//				+"<AdditionalInformation>"+ПараметрыЗапроса.param.Документ.Комментарий+"</AdditionalInformation>"
//				//+"<BeneficiaryBankCode>"+Строка1.ОсновнойБанковскийСчет.Банк.Код+"</BeneficiaryBankCode>"
//				+"<BeneficiaryBankCode>"+Строка1.Сотрудник.ОсновнойБанковскийСчет.Банк.Код+"</BeneficiaryBankCode>"
//				//+"<BeneficiaryInn>"+Строка1.Сотрудник.Физлицо.ЛичныйНомер+"</BeneficiaryInn>"
//				+"<BeneficiaryInn></BeneficiaryInn>"
//				+"<BeneficiaryName>"+Строка1.Сотрудник.Наименование+"</BeneficiaryName>"
//				+"<DispatchType>"+ПараметрыЗапроса.param.Документ.ТипОтправки+"</DispatchType>"
//				+"<Nomination>"+Строка.Ведомость.Комментарий+"</Nomination>"
//				+"<PayerInn>"+ПараметрыЗапроса.param.Документ.Организация.ИНН+"</PayerInn>"
//				+"<PayerName>"+ПараметрыЗапроса.param.Документ.Организация+"</PayerName>"
//				+"<ValueDate>"+ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата())+"</ValueDate>"
//				+"</DomesticPayment>";
//				
//			КонецЦикла;
//		КонецЦикла;
//		
//		xml = xml+"<?xml version=""1.0"" encoding=""UTF-8""?>"+"<ArrayOfDomesticPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"+ТекстЗапроса+"</ArrayOfDomesticPayment>";
//		
//	ИначеЕсли ИмяМетода = "api/documents/conversion" Тогда 
//		
//		МД5Объект = ПолучитьОбъектМД5();
//		UniqueId = MD5(МД5Объект, ПараметрыЗапроса.param.DocumentNo);
//		
//		xml = "<?xml version=""1.0"" encoding=""UTF-8""?>" 
//		+"<ArrayOfConversionPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"
//		+"<ConversionPayment>"
//		+"<AdditionalInfo>"+ПараметрыЗапроса.param.AdditionalInfo+"</AdditionalInfo>"
//		+"<Amount>"+ПараметрыЗапроса.param.Amount+"</Amount>"
//		+"<DestinationAccountNumber>"+ПараметрыЗапроса.param.DestinationAccountNumber+"</DestinationAccountNumber>"
//		+"<DestinationCurrency>"+ПараметрыЗапроса.param.DestinationCurrency+"</DestinationCurrency>"
//		+"<DocumentNo>"+ПараметрыЗапроса.param.DocumentNo+"</DocumentNo>"
//		+"<Rate>"+ПараметрыЗапроса.param.Rate+"</Rate>"
//		+"<SourceAccountNumber>"+ПараметрыЗапроса.param.SourceAccountNumber+"</SourceAccountNumber>"
//		+"<SourceCurrency>"+ПараметрыЗапроса.param.SourceCurrency+"</SourceCurrency>"
//		+"<UniqueId>"+UniqueId+"</UniqueId>"
//		+"</ConversionPayment>"
//		+"</ArrayOfConversionPayment>";
//		
//	ИначеЕсли ИмяМетода = "api/documents/status/" Или  ИмяМетода = "api/rates/commercial//" ИЛИ ИмяМетода = "api/rates/commercial/" ИЛИ ИмяМетода = "api/accounts/" ИЛИ ИмяМетода = "api/documents/bulk/status" ИЛИ ИмяМетода = "api/statement/" ИЛИ ИмяМетода = "api/statement////" ИЛИ ИмяМетода = "api/statement/summary/" Тогда
//		xml = "";
//	КонецЕсли;	
//	
//	//Текст = Новый ТекстовыйДокумент();
//	//Текст.ДобавитьСтроку(xml);
//	//Текст.Записать("D:\test.txt");
//	
//	Попытка        
//		mhttp.send(xml);
//		res = mhttp.WaitForResponse();
//	Исключение
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = НСтр("ka='ინფორმაციის გადაცემის შეცდომა! შეამოწმეთ აწყობის პარამეტრების შევსება';ru='Ошибка передачи информации! Проверьте правильность заполнения настроек';en='Information Communication error! Check the correctness of the settings'");
//		Сообщить(ОписаниеОшибки());
//		ПриЗагрузкеВозниклиОшибки = Истина
//	КонецПопытки;	
//	
//	Если Не res Тогда
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = НСтр("ka='კავშირის შეცდომა';ru='Ошибка связи';en='communication error'");
//		Сообщение.Сообщить(ОписаниеОшибки());
//		ПриЗагрузкеВозниклиОшибки = Истина
//	Конецесли;
//	
//	СтрокаJSONРезультат = mhttp.responseText;
//	
//	Если Не СтрокаJSONРезультат = "" Тогда	
//		Если ИмяМетода = "api/documents/bulk/domestic" ИЛИ ИмяМетода = "api/documents/bulk/foreign" Тогда 
//			ЗаполнитьУникальныеИД(ТаблицаУИД, ПараметрыЗапроса);
//		КонецЕсли;
//		Возврат ПрочитатьJSON1(СтрокаJSONРезультат);		
//	Иначе 
//		КодОшибки = mhttp.Status;
//		КраткоеОписание = mhttp.StatusText;
//		ДеталиОшибки = mhttp.ResponseText;
//		
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = НСтр("ka='BoG ის სერვისთან მიმართვის შეცდომა!';ru='Ошибка обращения к сервисам BoG!';en='Error handling services to BoG!'") + Символы.ПС
//		+ НСтр("ru = 'Код ошибки: '; ka = 'შეცდომის კოდი: '") + КодОшибки + Символы.ПС 
//		+ НСтр("ru = 'Описание: '; ka = 'აღწერა: '") + КраткоеОписание + Символы.ПС;
//		
//		Сообщение.Сообщить();
//		Возврат Неопределено;
//	КонецЕсли;	
//	
//КонецФункции

#КонецОбласти

// DO-25848
// kuzmich, 18.01.2016
Функция ОтправитьЗапросXML(ПараметрыЗапроса, Режим = 1, Token, ИмяМетода, ЗапускатьРеальныйБанк = ЛОЖЬ) Экспорт
	
	Перем mhttp;
	
	Сервер = "https://cib2-web-dev.bog.ge:8090/";
	Если НЕ ЗапускатьРеальныйБанк Тогда 
		Сервер = "https://cib2-web-dev.bog.ge:8090/";
	ИНаче
		Сервер = "https://api.businessonline.ge/";
	КонецЕсли;

	Если mhttp = Неопределено Тогда
		mhttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1"); 
	Конецесли;
	
	mhttp.SetTimeouts(6000000, 6000000, 6000000, 6000000);
	
	Если ИмяМетода = "api/documents/foreign" ИЛИ ИмяМетода = "api/documents/domestic" ИЛИ ИмяМетода = "api/documents/conversion" ИЛИ ИмяМетода = "api/documents/bulk/domestic" ИЛИ ИмяМетода = "api/documents/bulk/foreign" Тогда  
		mhttp.open("POST", Сервер+ИмяМетода, False);	
	ИначеЕсли ИмяМетода = "api/documents/status/" ИЛИ ИмяМетода = "api/documents/bulk/status/" Тогда 
		Если ЗначениеЗаполнено(ПараметрыЗапроса.param.Key) Тогда 
			mhttp.open("GET", Сервер+ИмяМетода+СтрЗаменить(ПараметрыЗапроса.param.Key,Символы.НПП,"")+"", False);		
		Иначе 	
			Возврат Неопределено;
		КонецЕсли;
	ИначеЕсли ИмяМетода = "api/rates/commercial/" Тогда  
		mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.currency+"", False);	
	ИначеЕсли ИмяМетода = "api/rates/commercial//" Тогда  
		mhttp.open("GET", Сервер+"api/rates/commercial/"+ПараметрыЗапроса.param.sellCurrency+"/"+ПараметрыЗапроса.param.buyCurrency, False);	
	ИначеЕсли ИмяМетода = "api/accounts/" Тогда 
		mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"", False);	
	ИначеЕсли ИмяМетода = "api/statement/" Тогда 	                                            
		mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"/"+ПараметрыЗапроса.param.startDate+"/"+ПараметрыЗапроса.param.endDate+"", False);	
	ИначеЕсли ИмяМетода = "api/statement////" Тогда 	                                            
		mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"/"+СтрЗаменить(ПараметрыЗапроса.param.id, Символы.НПП,"")+"/"+ПараметрыЗапроса.param.page+"", False);
	ИначеЕсли ИмяМетода = "api/statement/summary/" Тогда  	
		mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"/"+СтрЗаменить(ПараметрыЗапроса.param.id, Символы.НПП,"")+"", False);
		//api/statement/summary/{accountNumber}/{currency}/{id}
	КонецЕсли;
	
	//Попытка
	//	mhttp.SetClientCertificate("LOCAL_MACHINE\\Intermediate Certification Authorities\\Certificates\\CIB2-WEB-DEV.bog.ge");
	//Исключение
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = НСтр("ka='ინფორმაციის გადაცემის შეცდომა! შეამოწმეთ აწყობის პარამეტრების შევსება';ru='Ошибка передачи информации! Проверьте правильность заполнения настроек';en='Information Communication error! Check the correctness of the settings'");
	//	ПриЗагрузкеВозниклиОшибки = Истина
	//КонецПопытки;	
	
	mhttp.setRequestHeader("Content-Type", "text/xml; charset=utf-8");
	mhttp.setRequestHeader("Authorization", "Bearer " + Token + " ");			
	//mhttp.setRequestHeader("Accept", "application/xml");  // если хочу ответ в формате XML	
	
	//+++
	DocumentNo = "b6b20b62-d596-4a5f-bfd5-97cd2869bf6e";
	UniqueId = "b6b20b62-d596-4a5f-bfd5-97cd2869bf6e";
	//---
	
	Если ИмяМетода = "api/documents/foreign" Тогда 
		
		//МД5Объект = ПолучитьОбъектМД5();
		//
		//UniqueId = MD5(МД5Объект, ПараметрыЗапроса.param.DocumentNo);
		
		xml = "<?xml version=""1.0"" encoding=""UTF-8""?>" 
		+"<ArrayOfForeignPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"
		+"<ForeignPayment>"
		+"<Amount>"+СтрЗаменить(СтрЗаменить(СокрЛП(ПараметрыЗапроса.param.Amount),",","."), Символы.НПП, "")+"</Amount>"
		+"<BeneficiaryAccountNumber>"+Лев(СокрЛП(ПараметрыЗапроса.param.BeneficiaryAccountNumber),22)+"</BeneficiaryAccountNumber>"
		+"<Currency>"+СокрЛП(ПараметрыЗапроса.param.Currency)+"</Currency>"
		+"<DocumentNo>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.DocumentNo))+"</DocumentNo>"
		+"<SourceAccountNumber>"+Лев(СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.SourceAccountNumber)),22)+"</SourceAccountNumber>"
		+"<UniqueId>"+UniqueId+"</UniqueId>"
		+"<AdditionalInformation>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.AdditionalInformation))+"</AdditionalInformation>"
		+"<BeneficiaryBankCode>"+СокрЛП(ПараметрыЗапроса.param.BeneficiaryBankCode)+"</BeneficiaryBankCode>"
		+"<BeneficiaryBankName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.BeneficiaryBankName))+"</BeneficiaryBankName>"
		+"<BeneficiaryInn>"+СокрЛП(ПараметрыЗапроса.param.BeneficiaryInn)+"</BeneficiaryInn>"
		+"<BeneficiaryName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.BeneficiaryName))+"</BeneficiaryName>"
		+"<Charges>"+СокрЛП(ПараметрыЗапроса.param.Charges)+"</Charges>"
		+"<ComissionAccountNumber>"+Лев(СокрЛП(ПараметрыЗапроса.param.SourceAccountNumber),22)+"</ComissionAccountNumber>"
		+"<IntermediaryBankCode>"+СокрЛП(ПараметрыЗапроса.param.IntermediaryBankCode)+"</IntermediaryBankCode>"
		+"<IntermediaryBankName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.IntermediaryBankName))+"</IntermediaryBankName>"
		+"<PaymentDetail>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.PaymentDetail))+"</PaymentDetail>"
		+"<ValueDate>"+СокрЛП(ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата()))+"</ValueDate>"
		+"</ForeignPayment>"
		+"</ArrayOfForeignPayment>";
		
	ИначеЕсли ИмяМетода = "api/documents/domestic" Тогда  
		
		//МД5Объект = ПолучитьОбъектМД5();
		//UniqueId = MD5(МД5Объект, ПараметрыЗапроса.param.DocumentNo);
		
		xml = "<?xml version=""1.0"" encoding=""UTF-8""?>" 
		+"<ArrayOfDomesticPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"
		+"<DomesticPayment>"	
		+"<Amount>"+СтрЗаменить(СтрЗаменить(СокрЛП(ПараметрыЗапроса.param.Amount),",","."), Символы.НПП, "")+"</Amount>"
		+"<BeneficiaryAccountNumber>"+СокрЛП(ПараметрыЗапроса.param.BeneficiaryAccountNumber)+"</BeneficiaryAccountNumber>"
		+"<Currency>"+СокрЛП(ПараметрыЗапроса.param.Currency)+"</Currency>"
		+"<DocumentNo>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.DocumentNo))+"</DocumentNo>"
		+"<SourceAccountNumber>"+СокрЛП(ПараметрыЗапроса.param.SourceAccountNumber)+"</SourceAccountNumber>"
		+"<UniqueId>"+UniqueId+"</UniqueId>"
		+"<AdditionalInformation>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.AdditionalInformation))+"</AdditionalInformation>"
		+"<BeneficiaryBankCode>"+СокрЛП(ПараметрыЗапроса.param.BeneficiaryBankCode)+"</BeneficiaryBankCode>"
		+"<BeneficiaryInn>"+СокрЛП(ПараметрыЗапроса.param.BeneficiaryInn)+"</BeneficiaryInn>"
		+"<BeneficiaryName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.BeneficiaryName))+"</BeneficiaryName>"
		+"<DispatchType>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.DispatchType))+"</DispatchType>"
		+"<Nomination>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Nomination))+"</Nomination>"
		+"<PayerInn>"+СокрЛП(ПараметрыЗапроса.param.PayerInn)+"</PayerInn>"
		+"<PayerName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.PayerName))+"</PayerName>"
		+"<ValueDate>"+СокрЛП(ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата()))+"</ValueDate>"
		+"</DomesticPayment>"
		+"</ArrayOfDomesticPayment>";
		
	ИначеЕсли ИмяМетода = "api/documents/bulk/foreign" Тогда  
		
		xml = "";
		ТекстЗапроса = "";
		
		//МД5Объект = ПолучитьОбъектМД5();
		
		Если ПараметрыЗапроса.param.Документ.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата Тогда
			Для Каждого Строка Из ПараметрыЗапроса.param.Документ.ВыплатаЗаработнойПлаты Цикл
				
				ТаблицаУИД = Новый ТаблицаЗначений;
				ТаблицаУИД.Колонки.Добавить("УникальныйИД", Новый ОписаниеТипов("Строка"));
				ТаблицаУИД.Колонки.Добавить("НомерСтроки" , Новый ОписаниеТипов("Число"));
				ТаблицаУИД.Колонки.Добавить("Ведомость"   , Новый ОписаниеТипов("ДокументСсылка.ПлатежнаяВедомость"));
				
				Для Каждого Строка1 ИЗ Строка.Ведомость.Сотрудники Цикл 
					
					//документ генерируется из Номера документа + НомерВедомости + НомерСтроки.
					//так как длина документа ограничена, у номера документа и у номера ведосомти отсекаются 0 с левой стороны.
					
					ДлинаНомераДокумента = СтрДлина(ПараметрыЗапроса.param.Документ.Номер);
					ДлинаНомераВедомости = СтрДлина(Строка.Ведомость.Номер);
					
					НомерДокумента = ПараметрыЗапроса.param.Документ.Номер;
					НомерВедомости = Строка.Ведомость.Номер;
					
					Пока ДлинаНомераДокумента > 0 И Найти(НомерДокумента, 0) = 1 Цикл
						НомерДокумента = Прав(НомерДокумента, ДлинаНомераДокумента -1); 
						ДлинаНомераДокумента = ДлинаНомераДокумента -1;
					КонецЦикла;
					
					Пока ДлинаНомераВедомости > 0 И Найти(НомерВедомости, 0) = 1 Цикл
						НомерВедомости = Прав(НомерВедомости, ДлинаНомераВедомости -1); 
						ДлинаНомераВедомости = ДлинаНомераВедомости -1;
					КонецЦикла;
					
					DocumentNoПред = НомерДокумента + Прав(СтрЗаменить(Год(ПараметрыЗапроса.param.Документ.Дата), ",", ""),2) + НомерВедомости + Прав(СтрЗаменить(Год(Строка.Ведомость.Дата), ",", ""),2) + Строка1.НомерСтроки;
					
					//DocumentNo = MD5(МД5Объект, DocumentNoПред); 
					
					DocumentNo = Новый УникальныйИдентификатор;
					
					ДокНом_УИД = Лев(DocumentNo, 16);
					
					// присваиваю УникИД строкам ТЧ			
					НоваяСтрока = ТаблицаУИД.Добавить();
					НоваяСтрока.УникальныйИД = DocumentNo;
					НоваяСтрока.НомерСтроки  = Строка1.НомерСтроки;
					НоваяСтрока.Ведомость    = Строка.Ведомость;
					// присваиваю УникИД строкам ТЧ
					
					Amount = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Строка1.СуммаПлатежа),",", ""), " ", ""),Символы.НПП,"");
					
					ТекстЗапроса = ТекстЗапроса+"<ForeignPayment>"	
					+"<Amount>"+Amount+"</Amount>"
					//+"<BeneficiaryAccountNumber>"+Строка1.ОсновнойБанковскийСчет.НомерСчета+"</BeneficiaryAccountNumber>" //DO-25834
					+"<BeneficiaryAccountNumber>"+Лев(СокрЛП(Строка1.Сотрудник.БанковскийСчетПоУмолчанию.НомерСчета),22)+"</BeneficiaryAccountNumber>"
					+"<Currency>"+СокрЛП(ПараметрыЗапроса.param.Currency)+"</Currency>"
					+"<DocumentNo>"+СокрЛП(ОбработатьТекстДляXML(ДокНом_УИД))+"</DocumentNo>"
					+"<SourceAccountNumber>"+СокрЛП(ПараметрыЗапроса.param.Документ.БанковскийСчет.НомерСчета)+"</SourceAccountNumber>"
					+"<UniqueId>"+DocumentNo+"</UniqueId>"
					+"<AdditionalInformation>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Комментарий))+"</AdditionalInformation>"
					//+"<BeneficiaryBankCode>"+Строка1.ОсновнойБанковскийСчет.Банк.Код+"</BeneficiaryBankCode>"
					//+"<BeneficiaryBankName>"+Строка1.ОсновнойБанковскийСчет.Банк.Наименование+"</BeneficiaryBankName>"
					+"<BeneficiaryBankCode>"+СокрЛП(Строка1.Сотрудник.БанковскийСчетПоУмолчанию.Банк.СВИФТБИК)+"</BeneficiaryBankCode>"
					+"<BeneficiaryBankName>"+СокрЛП(ОбработатьТекстДляXML(Строка1.Сотрудник.БанковскийСчетПоУмолчанию.Банк.Наименование))+"</BeneficiaryBankName>"
					//+"<BeneficiaryInn>"+Строка1.Сотрудник.Физлицо.ЛичныйНомер+"</BeneficiaryInn>"
					+"<BeneficiaryInn></BeneficiaryInn>"
					+"<BeneficiaryName>"+СокрЛП(ОбработатьТекстДляXML(Строка1.Сотрудник.Наименование))+"</BeneficiaryName>"
					+"<Charges>"+СокрЛП(ПараметрыЗапроса.param.Документ.ТипКомиссии)+"</Charges>"
					+"<ComissionAccountNumber>"+СокрЛП(ПараметрыЗапроса.param.ComissionAccountNumber)+"</ComissionAccountNumber>"
					+"<IntermediaryBankCode>"+СокрЛП(ПараметрыЗапроса.param.IntermediaryBankCode)+"</IntermediaryBankCode>"
					+"<IntermediaryBankName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.IntermediaryBankName))+"</IntermediaryBankName>"
					+"<PaymentDetail>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.PaymentDetail))+"</PaymentDetail>"
					+"<ValueDate>"+СокрЛП(ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата()))+".0373796+04:00"+"</ValueDate>"
					+"</ForeignPayment>"
					
				КонецЦикла;
			КонецЦикла;
		Иначе 
			ТаблицаУИД = Новый ТаблицаЗначений;
			ТаблицаУИД.Колонки.Добавить("УникальныйИД", Новый ОписаниеТипов("Строка"));
			ТаблицаУИД.Колонки.Добавить("НомерСтроки" , Новый ОписаниеТипов("Число"));
			ТаблицаУИД.Колонки.Добавить("Ведомость", Новый ОписаниеТипов("ДокументСсылка.ПлатежнаяВедомость"));
			Для Каждого Строка Из ПараметрыЗапроса.param.Документ.ВыплатаЗаработнойПлаты Цикл				
				//Для Каждого Строка1 ИЗ Строка.Ведомость.СуммаКВыплате Цикл 
				
				//документ генерируется из Номера документа + НомерВедомости + НомерСтроки.
				//так как длина документа ограничена, у номера документа и у номера ведосомти отсекаются 0 с левой стороны.
				
				ДлинаНомераДокумента = СтрДлина(ПараметрыЗапроса.param.Документ.Номер);
				ДлинаНомераВедомости = СтрДлина(Строка.Ведомость.Номер);
				
				НомерДокумента = ПараметрыЗапроса.param.Документ.Номер;
				НомерВедомости = Строка.Ведомость.Номер;
				
				Пока ДлинаНомераДокумента > 0 И Найти(НомерДокумента, 0) = 1 Цикл
					НомерДокумента = Прав(НомерДокумента, ДлинаНомераДокумента -1); 
					ДлинаНомераДокумента = ДлинаНомераДокумента -1;
				КонецЦикла;
				
				Пока ДлинаНомераВедомости > 0 И Найти(НомерВедомости, 0) = 1 Цикл
					НомерВедомости = Прав(НомерВедомости, ДлинаНомераВедомости -1); 
					ДлинаНомераВедомости = ДлинаНомераВедомости -1;
				КонецЦикла;
				
				//DocumentNoПред = НомерДокумента + Прав(СтрЗаменить(Год(ПараметрыЗапроса.param.Документ.Дата), ",", ""),2) + НомерВедомости + Прав(СтрЗаменить(Год(Строка.Ведомость.Дата), ",", ""),2) + Строка1.НомерСтроки;
				
				//DocumentNo = MD5(МД5Объект, DocumentNoПред); 
				DocumentNo = Новый УникальныйИдентификатор;
				
				ДокНом_УИД = Лев(DocumentNo, 16);
				
				// присваиваю УникИД строкам ТЧ			
				НоваяСтрока = ТаблицаУИД.Добавить();
				НоваяСтрока.УникальныйИД = DocumentNo;
				НоваяСтрока.НомерСтроки  = Строка.НомерСтроки;
				НоваяСтрока.Ведомость    = Строка.Ведомость;
				// присваиваю УникИД строкам ТЧ               
				
				Amount = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Строка.СуммаПлатежа),",", ""), " ", ""), Символы.НПП, "");//СуммаКВыплате),",", ""), " ", "");
				
				BeneficiaryAccountNumber = Лев(СокрЛП(Строка.БанковскийСчет.НомерСчета),22); //DO-25834
				//Лев(СокрЛП(Строка1.ОсновнойБанковскийСчет.НомерСчета),22);
				SourceAccountNumber = Лев(СокрЛП(ПараметрыЗапроса.param.Документ.БанковскийСчет.НомерСчета), 22);
				
				ТекстЗапроса = ТекстЗапроса+"<ForeignPayment>"	
				+"<Amount>"+Amount+"</Amount>"
				//+"<BeneficiaryAccountNumber>"+Строка1.ОсновнойБанковскийСчет.НомерСчета+"</BeneficiaryAccountNumber>"
				+"<BeneficiaryAccountNumber>"+СокрЛП(BeneficiaryAccountNumber)+"</BeneficiaryAccountNumber>"
				+"<Currency>"+СокрЛП(ПараметрыЗапроса.param.Currency)+"</Currency>"
				+"<DocumentNo>"+СокрЛП(ОбработатьТекстДляXML(ДокНом_УИД))+"</DocumentNo>"
				//+"<SourceAccountNumber>"+ПараметрыЗапроса.param.Документ.СчетОрганизации.НомерСчета+"</SourceAccountNumber>"
				+"<SourceAccountNumber>"+СокрЛП(SourceAccountNumber)+"</SourceAccountNumber>"
				+"<UniqueId>"+СокрЛП(DocumentNo)+"</UniqueId>"
				+"<AdditionalInformation>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Комментарий))+"</AdditionalInformation>"
				//+"<BeneficiaryBankCode>"+Строка1.ОсновнойБанковскийСчет.Банк.Код+"</BeneficiaryBankCode>"
				+"<BeneficiaryBankCode>"+СокрЛП(Строка.БанковскийСчет.Банк.Код)+"</BeneficiaryBankCode>"
				//+"<BeneficiaryInn>"+Строка1.Сотрудник.Физлицо.ЛичныйНомер+"</BeneficiaryInn>"
				+"<BeneficiaryInn>"+СокрЛП(Строка.Сотрудник.Физлицо.ИНН)+"</BeneficiaryInn>"
				+"<BeneficiaryName>"+СокрЛП(ОбработатьТекстДляXML(Строка.Сотрудник.Наименование))+"</BeneficiaryName>"
				+"<DispatchType>"+СокрЛП(ПараметрыЗапроса.param.Документ.ТипОтправки)+"</DispatchType>"
				+"<Nomination>"+СокрЛП(ОбработатьТекстДляXML(Строка.Ведомость.Комментарий))+"</Nomination>"
				+"<PayerInn>"+СокрЛП(ПараметрыЗапроса.param.Документ.Организация.ИНН)+"</PayerInn>"
				+"<PayerName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Организация))+"</PayerName>"
				+"<ValueDate>"+СокрЛП(ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата()))+"</ValueDate>"
				+"</ForeignPayment>";
				
			КонецЦикла;
		КонецЕсли;
		
		xml = xml+"<?xml version=""1.0"" encoding=""UTF-8""?>"+"<ArrayOfForeignPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"+ТекстЗапроса+"</ArrayOfForeignPayment>";
		
	ИначеЕсли ИмяМетода = "api/documents/bulk/domestic" Тогда  
		
		xml = "";
		ТекстЗапроса = "";
		
		//МД5Объект = ПолучитьОбъектМД5();
		ТаблицаУИД = Новый ТаблицаЗначений;
		ТаблицаУИД.Колонки.Добавить("УникальныйИД", Новый ОписаниеТипов("Строка"));
		ТаблицаУИД.Колонки.Добавить("НомерСтроки" , Новый ОписаниеТипов("Число"));
		
		//Если ПараметрыЗапроса.param.Документ.ВидОперации = Перечисления.ВидыОперацийППИсходящее.НачисленияИВыплатаЗаработнойПлатыРаботнику Тогда
		Если ПараметрыЗапроса.param.Документ.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата Тогда
			//Для Каждого Строка Из ПараметрыЗапроса.param.Документ.НачислениеЗарплатыРаботникам Цикл
			Для Каждого Строка Из ПараметрыЗапроса.param.Документ.ВыплатаЗаработнойПлаты Цикл//ПараметрыЗапроса.param.Документ.ДокументОснование.Сотрудники Цикл
				
				Для Каждого Строка1 ИЗ Строка.Ведомость.Сотрудники Цикл 
					
					//документ генерируется из Номера документа + НомерВедомости + НомерСтроки.
					//так как длина документа ограничена, у номера документа и у номера ведосомти отсекаются 0 с левой стороны.
					
					ДлинаНомераДокумента = СтрДлина(ПараметрыЗапроса.param.Документ.Номер);
					//ДлинаНомераВедомости = СтрДлина(Строка.Ведомость.Номер);
					
					НомерДокумента = ПараметрыЗапроса.param.Документ.Номер;
					//НомерВедомости = Строка.Ведомость.Номер;
					
					Пока ДлинаНомераДокумента > 0 И Найти(НомерДокумента, 0) = 1 Цикл
						НомерДокумента = Прав(НомерДокумента, ДлинаНомераДокумента -1); 
						ДлинаНомераДокумента = ДлинаНомераДокумента -1;
					КонецЦикла;
					
					//Пока ДлинаНомераВедомости > 0 И Найти(НомерВедомости, 0) = 1 Цикл
					//	НомерВедомости = Прав(НомерВедомости, ДлинаНомераВедомости -1); 
					//	ДлинаНомераВедомости = ДлинаНомераВедомости -1;
					//КонецЦикла;
					
					//DocumentNoПред = НомерДокумента + Прав(СтрЗаменить(Год(ПараметрыЗапроса.param.Документ.Дата), ",", ""),2) + Строка.НомерСтроки;
					
					//DocumentNo = MD5(МД5Объект, DocumentNoПред);
					DocumentNo = Новый УникальныйИдентификатор;//MD5(МД5Объект, DocumentNoПред);
					
					ДокНом_УИД = Лев(DocumentNo, 16);
					
					// присваиваю УникИД строкам ТЧ			
					НоваяСтрока = ТаблицаУИД.Добавить();
					НоваяСтрока.УникальныйИД = DocumentNo;
					НоваяСтрока.НомерСтроки  = Строка1.НомерСтроки;
					//НоваяСтрока.Ведомость    = Строка.Ведомость;
					// присваиваю УникИД строкам ТЧ               
					
					//Amount = СтрЗаменить(СтрЗаменить(Строка(Строка.СуммаБезНДФЛ),",", ""), " ", "");
					Amount = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Строка1.СуммаПлатежа),",", ""), " ", ""),Символы.НПП,"");
					
					//BeneficiaryAccountNumber = Лев(СокрЛП(Строка.Сотрудник.ОсновнойБанковскийСчет.НомерСчета),22); //DO-25834
					BeneficiaryAccountNumber = Лев(СокрЛП(Строка1.Сотрудник.БанковскийСчетПоУмолчанию.НомерСчета),22); //DO-25834
					//Лев(СокрЛП(Строка1.ОсновнойБанковскийСчет.НомерСчета),22);
					//SourceAccountNumber = Лев(СокрЛП(ПараметрыЗапроса.param.Документ.СчетОрганизации.НомерСчета), 22);    БанковскийСчет
					SourceAccountNumber = Лев(СокрЛП(ПараметрыЗапроса.param.Документ.БанковскийСчет.НомерСчета), 22);    
					
					ТекстЗапроса = ТекстЗапроса+"<DomesticPayment>"	
					//
					+"<Amount>"+Amount+"</Amount>"
					//+"<BeneficiaryAccountNumber>"+Строка1.ОсновнойБанковскийСчет.НомерСчета+"</BeneficiaryAccountNumber>"
					+"<BeneficiaryAccountNumber>"+СокрЛП(BeneficiaryAccountNumber)+"</BeneficiaryAccountNumber>"
					+"<Currency>"+СокрЛП(ПараметрыЗапроса.param.Currency)+"</Currency>"
					+"<DocumentNo>"+СокрЛП(ОбработатьТекстДляXML(ДокНом_УИД))+"</DocumentNo>"
					//+"<SourceAccountNumber>"+ПараметрыЗапроса.param.Документ.СчетОрганизации.НомерСчета+"</SourceAccountNumber>"
					+"<SourceAccountNumber>"+СокрЛП(SourceAccountNumber)+"</SourceAccountNumber>"
					+"<UniqueId>"+СокрЛП(DocumentNo)+"</UniqueId>"
					//+"<IsSalary>Yes</IsSalary>"
					+"<AdditionalInformation>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Комментарий))+"</AdditionalInformation>"
					//+"<BeneficiaryBankCode>"+Строка1.ОсновнойБанковскийСчет.Банк.Код+"</BeneficiaryBankCode>"
					//+"<BeneficiaryBankCode>"+Строка.Сотрудник.ОсновнойБанковскийСчет.Банк.Код+"</BeneficiaryBankCode>"
					+"<BeneficiaryBankCode>"+СокрЛП(Строка1.Сотрудник.БанковскийСчетПоУмолчанию.Банк.СВИФТБИК)+"</BeneficiaryBankCode>"
					//+"<BeneficiaryInn>"+Строка1.Сотрудник.Физлицо.ЛичныйНомер+"</BeneficiaryInn>"
					//+"<BeneficiaryInn>"+Строка.Сотрудник.Физлицо.ЛичныйНомер+"</BeneficiaryInn>"  ИНН
					+"<BeneficiaryInn>"+СокрЛП(Строка1.Сотрудник.Физлицо.ИНН)+"</BeneficiaryInn>"  
					+"<BeneficiaryName>"+СокрЛП(ОбработатьТекстДляXML(Строка1.Сотрудник.Наименование))+"</BeneficiaryName>"
					+"<DispatchType>"+СокрЛП(ПараметрыЗапроса.param.Документ.ТипОтправки)+"</DispatchType>"
					+"<Nomination>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.НазначениеПлатежа))+"</Nomination>"
					+"<PayerInn>"+СокрЛП(ПараметрыЗапроса.param.Документ.Организация.ИНН)+"</PayerInn>"
					+"<PayerName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Организация))+"</PayerName>"
					+"<ValueDate>"+СокрЛП(ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата()))+"</ValueDate>"
					+"</DomesticPayment>";
					///////////////////////////////////////////////////////
					//+"<AdditionalInformation>"+ПараметрыЗапроса.param.AdditionalInformation+"</AdditionalInformation>"
					//+"<SourceAccountNumber>"+SourceAccountNumber+"</SourceAccountNumber>"
					//+"<DocumentNo>"+ОбработатьТекстДляXML(ДокНом_УИД)+"</DocumentNo>"
					//+"<BeneficiaryBankCode>"+Строка1.Сотрудник.БанковскийСчетПоУмолчанию.Банк.СВИФТБИК+"</BeneficiaryBankCode>"
					//+"<BeneficiaryAccountNumber>"+BeneficiaryAccountNumber+"</BeneficiaryAccountNumber>"
					//+"<BeneficiaryName>"+ОбработатьТекстДляXML(Строка1.Сотрудник.Наименование)+"</BeneficiaryName>"
					//+"<BeneficiaryInn>"+Строка1.Сотрудник.Физлицо.ИНН+"</BeneficiaryInn>"//Строка1.Сотрудник.Физлицо.ИНН+"</BeneficiaryInn>"
					//+"<Nomination>"+ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.НазначениеПлатежа)+"</Nomination>"
					//+"<Amount>"+Amount+"</Amount>"
					//+"<IsSalary>True</IsSalary>"
					//+"<DispatchType>"+ПараметрыЗапроса.param.Документ.ТипОтправки+"</DispatchType>"
					//
					//
					////
					//
					////+"<CheckInn>True</ CheckInn>"
					////+"<Currency>"+ПараметрыЗапроса.param.Currency+"</Currency>"
					////
					//
					////+"<UniqueId>"+DocumentNo+"</UniqueId>"
					////+"<DispatchType>"+ПараметрыЗапроса.param.Документ.ТипОтправки+"</DispatchType>"
					////+"<IsSalary>True</IsSalary>"
					////
					//////+"<PayerInn>"+"</PayerInn>"//+ПараметрыЗапроса.param.Документ.Организация.ИНН+"</PayerInn>"
					//////+"<PayerName>"+"</PayerName>"//+ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Организация)+"</PayerName>"
					//////+"<ValueDate>"+ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата())+"</ValueDate>"
					//+"</DomesticPayment>";
					
				КонецЦикла;
			КонецЦикла;	
		Иначе
			ТаблицаУИД.Колонки.Добавить("Ведомость", Новый ОписаниеТипов("ДокументСсылка.ПлатежнаяВедомость"));
			Для Каждого Строка Из ПараметрыЗапроса.param.Документ.ВыплатаЗаработнойПлаты Цикл				
				//Для Каждого Строка1 ИЗ Строка.Ведомость.СуммаКВыплате Цикл 
					
					//документ генерируется из Номера документа + НомерВедомости + НомерСтроки.
					//так как длина документа ограничена, у номера документа и у номера ведосомти отсекаются 0 с левой стороны.
					
					ДлинаНомераДокумента = СтрДлина(ПараметрыЗапроса.param.Документ.Номер);
					ДлинаНомераВедомости = СтрДлина(Строка.Ведомость.Номер);
					
					НомерДокумента = ПараметрыЗапроса.param.Документ.Номер;
					НомерВедомости = Строка.Ведомость.Номер;
					
					Пока ДлинаНомераДокумента > 0 И Найти(НомерДокумента, 0) = 1 Цикл
						НомерДокумента = Прав(НомерДокумента, ДлинаНомераДокумента -1); 
						ДлинаНомераДокумента = ДлинаНомераДокумента -1;
					КонецЦикла;
					
					Пока ДлинаНомераВедомости > 0 И Найти(НомерВедомости, 0) = 1 Цикл
						НомерВедомости = Прав(НомерВедомости, ДлинаНомераВедомости -1); 
						ДлинаНомераВедомости = ДлинаНомераВедомости -1;
					КонецЦикла;
					
					//DocumentNoПред = НомерДокумента + Прав(СтрЗаменить(Год(ПараметрыЗапроса.param.Документ.Дата), ",", ""),2) + НомерВедомости + Прав(СтрЗаменить(Год(Строка.Ведомость.Дата), ",", ""),2) + Строка1.НомерСтроки;
					
					//DocumentNo = MD5(МД5Объект, DocumentNoПред); 
					DocumentNo = Новый УникальныйИдентификатор;
					
					ДокНом_УИД = Лев(DocumentNo, 16);
					
					// присваиваю УникИД строкам ТЧ			
					НоваяСтрока = ТаблицаУИД.Добавить();
					НоваяСтрока.УникальныйИД = DocumentNo;
					НоваяСтрока.НомерСтроки  = Строка.НомерСтроки;
					НоваяСтрока.Ведомость    = Строка.Ведомость;
					// присваиваю УникИД строкам ТЧ               
					
					Amount = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Строка.СуммаПлатежа),",", ""), " ", ""), Символы.НПП, "");//СуммаКВыплате),",", ""), " ", "");
					
					BeneficiaryAccountNumber = Лев(СокрЛП(Строка.БанковскийСчет.НомерСчета),22); //DO-25834
					//Лев(СокрЛП(Строка1.ОсновнойБанковскийСчет.НомерСчета),22);
					SourceAccountNumber = Лев(СокрЛП(ПараметрыЗапроса.param.Документ.БанковскийСчет.НомерСчета), 22);
					
					ТекстЗапроса = ТекстЗапроса+"<DomesticPayment>"	
					+"<Amount>"+Amount+"</Amount>"
					//+"<BeneficiaryAccountNumber>"+Строка1.ОсновнойБанковскийСчет.НомерСчета+"</BeneficiaryAccountNumber>"
					+"<BeneficiaryAccountNumber>"+СокрЛП(BeneficiaryAccountNumber)+"</BeneficiaryAccountNumber>"
					+"<Currency>"+СокрЛП(ПараметрыЗапроса.param.Currency)+"</Currency>"
					+"<DocumentNo>"+СокрЛП(ОбработатьТекстДляXML(ДокНом_УИД))+"</DocumentNo>"
					//+"<SourceAccountNumber>"+ПараметрыЗапроса.param.Документ.СчетОрганизации.НомерСчета+"</SourceAccountNumber>"
					+"<SourceAccountNumber>"+СокрЛП(SourceAccountNumber)+"</SourceAccountNumber>"
					+"<UniqueId>"+СокрЛП(DocumentNo)+"</UniqueId>"
					+"<AdditionalInformation>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Комментарий))+"</AdditionalInformation>"
					//+"<BeneficiaryBankCode>"+Строка1.ОсновнойБанковскийСчет.Банк.Код+"</BeneficiaryBankCode>"
					+"<BeneficiaryBankCode>"+СокрЛП(Строка.БанковскийСчет.Банк.СВИФТБИК)+"</BeneficiaryBankCode>"
					//+"<BeneficiaryInn>"+Строка1.Сотрудник.Физлицо.ЛичныйНомер+"</BeneficiaryInn>"
					+"<BeneficiaryInn>"+СокрЛП(Строка.Сотрудник.Физлицо.ИНН)+"</BeneficiaryInn>"
					+"<BeneficiaryName>"+СокрЛП(ОбработатьТекстДляXML(Строка.Сотрудник.Наименование))+"</BeneficiaryName>"
					+"<DispatchType>"+СокрЛП(ПараметрыЗапроса.param.Документ.ТипОтправки)+"</DispatchType>"
					+"<Nomination>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.НазначениеПлатежа))+"</Nomination>"
					+"<PayerInn>"+СокрЛП(ПараметрыЗапроса.param.Документ.Организация.ИНН)+"</PayerInn>"
					+"<PayerName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Организация))+"</PayerName>"
					+"<ValueDate>"+СокрЛП(ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата()))+"</ValueDate>"
					+"</DomesticPayment>";
					
				КонецЦикла;
			//КонецЦикла;
		КонецЕсли;
		xml = xml+"<?xml version=""1.0"" encoding=""UTF-8""?>"+"<ArrayOfDomesticPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"+ТекстЗапроса+"</ArrayOfDomesticPayment>";
		
	ИначеЕсли ИмяМетода = "api/documents/conversion" Тогда 
		
		//МД5Объект = ПолучитьОбъектМД5();
		//UniqueId = MD5(МД5Объект, ПараметрыЗапроса.param.DocumentNo);
		
		xml = "<?xml version=""1.0"" encoding=""UTF-8""?>" 
		+"<ArrayOfConversionPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"
		+"<ConversionPayment>"
		+"<AdditionalInfo>"+ОбработатьТекстДляXML(ПараметрыЗапроса.param.AdditionalInfo)+"</AdditionalInfo>"
		+"<Amount>"+СтрЗаменить(СтрЗаменить(СокрЛП(ПараметрыЗапроса.param.Amount),",","."), Символы.НПП, "")+"</Amount>"
		+"<DestinationAccountNumber>"+Лев(ПараметрыЗапроса.param.DestinationAccountNumber,25)+"</DestinationAccountNumber>"
		+"<DestinationCurrency>"+ПараметрыЗапроса.param.DestinationCurrency+"</DestinationCurrency>"
		+"<DocumentNo>"+ОбработатьТекстДляXML(ПараметрыЗапроса.param.DocumentNo)+"</DocumentNo>"
		+"<Rate>"+СтрЗаменить(Строка(ПараметрыЗапроса.param.Rate),",",".")+"</Rate>"
		+"<SourceAccountNumber>"+Лев(ПараметрыЗапроса.param.SourceAccountNumber,25)+"</SourceAccountNumber>"
		+"<SourceCurrency>"+ПараметрыЗапроса.param.SourceCurrency+"</SourceCurrency>"
		+"<UniqueId>"+UniqueId+"</UniqueId>"
		+"</ConversionPayment>"
		+"</ArrayOfConversionPayment>";
		
	ИначеЕсли ИмяМетода = "api/documents/status/" Или  ИмяМетода = "api/rates/commercial//" ИЛИ ИмяМетода = "api/rates/commercial/" ИЛИ ИмяМетода = "api/accounts/" ИЛИ ИмяМетода = "api/documents/bulk/status" ИЛИ ИмяМетода = "api/statement/" ИЛИ ИмяМетода = "api/statement////" ИЛИ ИмяМетода = "api/statement/summary/" Тогда
		xml = "";
	КонецЕсли;	
	
	//Текст = Новый ТекстовыйДокумент();
	//Текст.ДобавитьСтроку(xml);
	//Текст.Записать("D:\test.txt");
	
	Попытка        
		mhttp.send(xml);
		res = mhttp.WaitForResponse();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='ინფორმაციის გადაცემის შეცდომა! შეამოწმეთ აწყობის პარამეტრების შევსება';ru='Ошибка передачи информации! Проверьте правильность заполнения настроек';en='Information Communication error! Check the correctness of the settings'");
		Сообщить(ОписаниеОшибки());
		ПриЗагрузкеВозниклиОшибки = Истина
	КонецПопытки;	
	
	Если Не res Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='კავშირის შეცდომა';ru='Ошибка связи';en='communication error'");
		Сообщение.Сообщить(ОписаниеОшибки());
		ПриЗагрузкеВозниклиОшибки = Истина
	Конецесли;
	
	СтрокаJSONРезультат = mhttp.responseText;
	
	Если Не СтрокаJSONРезультат = "" Тогда	
		Если ИмяМетода = "api/documents/bulk/domestic" ИЛИ ИмяМетода = "api/documents/bulk/foreign" Тогда 
			ЗаполнитьУникальныеИД(ТаблицаУИД, ПараметрыЗапроса);
		КонецЕсли;
		Возврат ПрочитатьJSON1(СтрокаJSONРезультат);		
	Иначе 
		КодОшибки = mhttp.Status;
		КраткоеОписание = mhttp.StatusText;
		ДеталиОшибки = mhttp.ResponseText;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='BoG ის სერვისთან მიმართვის შეცდომა!';ru='Ошибка обращения к сервисам BoG!';en='Error handling services to BoG!'") + Символы.ПС
		+ НСтр("ru = 'Код ошибки: '; ka = 'შეცდომის კოდი: '") + КодОшибки + Символы.ПС 
		+ НСтр("ru = 'Описание: '; ka = 'აღწერა: '") + КраткоеОписание + Символы.ПС;
		
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции
// DO-25848

//+++ Дмгг, Запрост средствами платформи
Функция ОтправитьЗапросXML_1С(ПараметрыЗапроса, Режим = 1, Token, ИмяМетода, ЗапускатьРеальныйБанк = ЛОЖЬ) Экспорт
	
	Перем mhttp;
	
	Если НЕ ЗапускатьРеальныйБанк Тогда 
		Сервер = "cib2-web-dev.bog.ge";
	ИНаче
		Сервер = "api.businessonline.ge";
	КонецЕсли;
	
	Если mhttp = Неопределено Тогда
		Если НЕ ЗапускатьРеальныйБанк Тогда 
			mhttp = Новый HTTPСоединение(Сервер,8090,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		Иначе
			mhttp = Новый HTTPСоединение(Сервер,,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		КонецЕсли;
	Конецесли;
	
	Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");  //application/json; charset=utf-8
	Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
	Заголовки.Вставить("Authorization", "Bearer " + Token + " ");
	
	Если ИмяМетода = "api/documents/foreign" ИЛИ ИмяМетода = "api/documents/domestic" ИЛИ ИмяМетода = "api/documents/conversion" ИЛИ ИмяМетода = "api/documents/bulk/domestic" ИЛИ ИмяМетода = "api/documents/bulk/foreign" Тогда  
		//mhttp.open("POST", Сервер+ИмяМетода, False);
		Запрос = Новый HTTPЗапрос("/" + ИмяМетода, Заголовки);
	ИначеЕсли ИмяМетода = "api/documents/status/" ИЛИ ИмяМетода = "api/documents/bulk/status/" Тогда 
		Если ЗначениеЗаполнено(ПараметрыЗапроса.param.Key) Тогда 
			//mhttp.open("GET", Сервер+ИмяМетода+СтрЗаменить(ПараметрыЗапроса.param.Key,Символы.НПП,"")+"", False);	
			Запрос = Новый HTTPЗапрос("/" + ИмяМетода+СтрЗаменить(ПараметрыЗапроса.param.Key,Символы.НПП,""), Заголовки);
		Иначе 	
			Возврат Неопределено;
		КонецЕсли;
	ИначеЕсли ИмяМетода = "api/rates/commercial/" Тогда  
		//mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.currency+"", False);
		Запрос = Новый HTTPЗапрос("/" + ИмяМетода + ПараметрыЗапроса.param.currency, Заголовки);
	ИначеЕсли ИмяМетода = "api/rates/commercial//" Тогда  
		//mhttp.open("GET", Сервер+"api/rates/commercial/"+ПараметрыЗапроса.param.sellCurrency+"/"+ПараметрыЗапроса.param.buyCurrency, False);
		Запрос = Новый HTTPЗапрос("/" + ИмяМетода+ПараметрыЗапроса.param.sellCurrency+"/"+ПараметрыЗапроса.param.buyCurrency, Заголовки);
	ИначеЕсли ИмяМетода = "api/accounts/" Тогда 
		//mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"", False);	
		Запрос = Новый HTTPЗапрос("/" + ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency, Заголовки);
	ИначеЕсли ИмяМетода = "api/statement/" Тогда 	                                            
		//mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"/"+ПараметрыЗапроса.param.startDate+"/"+ПараметрыЗапроса.param.endDate+"", False);	
		Запрос = Новый HTTPЗапрос("/" + ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"/"+ПараметрыЗапроса.param.startDate+"/"+ПараметрыЗапроса.param.endDate, Заголовки);
	ИначеЕсли ИмяМетода = "api/statement////" Тогда 	                                            
		//mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"/"+СтрЗаменить(ПараметрыЗапроса.param.id, Символы.НПП,"")+"/"+ПараметрыЗапроса.param.page+"", False);
		Запрос = Новый HTTPЗапрос("/" + ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"/"+СтрЗаменить(ПараметрыЗапроса.param.id, Символы.НПП,"")+"/"+ПараметрыЗапроса.param.page, Заголовки);
	ИначеЕсли ИмяМетода = "api/statement/summary/" Тогда  	
		//mhttp.open("GET", Сервер+ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"/"+СтрЗаменить(ПараметрыЗапроса.param.id, Символы.НПП,"")+"", False);
		Запрос = Новый HTTPЗапрос("/" + ИмяМетода+ПараметрыЗапроса.param.accountNumber+"/"+ПараметрыЗапроса.param.currency+"/"+СтрЗаменить(ПараметрыЗапроса.param.id, Символы.НПП,""), Заголовки);
		//api/statement/summary/{accountNumber}/{currency}/{id}
	КонецЕсли;
	
	//Попытка
	//	mhttp.SetClientCertificate("LOCAL_MACHINE\\Intermediate Certification Authorities\\Certificates\\CIB2-WEB-DEV.bog.ge");
	//Исключение
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = НСтр("ka='ინფორმაციის გადაცემის შეცდომა! შეამოწმეთ აწყობის პარამეტრების შევსება';ru='Ошибка передачи информации! Проверьте правильность заполнения настроек';en='Information Communication error! Check the correctness of the settings'");
	//	ПриЗагрузкеВозниклиОшибки = Истина
	//КонецПопытки;	
	
	//mhttp.setRequestHeader("Content-Type", "text/xml; charset=utf-8");
	//mhttp.setRequestHeader("Authorization", "Bearer " + Token + " ");			
	//mhttp.setRequestHeader("Accept", "application/xml");  // если хочу ответ в формате XML	
	
	//+++
	DocumentNo = "b6b20b62-d596-4a5f-bfd5-97cd2869bf6e";
	UniqueId = "b6b20b62-d596-4a5f-bfd5-97cd2869bf6e";
	//---
	
	Если ИмяМетода = "api/documents/foreign" Тогда 
		
		//МД5Объект = ПолучитьОбъектМД5();
		//
		//UniqueId = MD5(МД5Объект, ПараметрыЗапроса.param.DocumentNo);
		
		xml = "<?xml version=""1.0"" encoding=""UTF-8""?>" 
		+"<ArrayOfForeignPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"
		+"<ForeignPayment>"
		+"<Amount>"+СтрЗаменить(СтрЗаменить(СокрЛП(ПараметрыЗапроса.param.Amount),",","."), Символы.НПП, "")+"</Amount>"
		+"<BeneficiaryAccountNumber>"+Лев(СокрЛП(ПараметрыЗапроса.param.BeneficiaryAccountNumber),22)+"</BeneficiaryAccountNumber>"
		+"<Currency>"+СокрЛП(ПараметрыЗапроса.param.Currency)+"</Currency>"
		+"<DocumentNo>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.DocumentNo))+"</DocumentNo>"
		+"<SourceAccountNumber>"+Лев(СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.SourceAccountNumber)),22)+"</SourceAccountNumber>"
		+"<UniqueId>"+UniqueId+"</UniqueId>"
		+"<AdditionalInformation>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.AdditionalInformation))+"</AdditionalInformation>"
		+"<BeneficiaryBankCode>"+СокрЛП(ПараметрыЗапроса.param.BeneficiaryBankCode)+"</BeneficiaryBankCode>"
		+"<BeneficiaryBankName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.BeneficiaryBankName))+"</BeneficiaryBankName>"
		+"<BeneficiaryInn>"+СокрЛП(ПараметрыЗапроса.param.BeneficiaryInn)+"</BeneficiaryInn>"
		+"<BeneficiaryName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.BeneficiaryName))+"</BeneficiaryName>"
		+"<Charges>"+СокрЛП(ПараметрыЗапроса.param.Charges)+"</Charges>"
		+"<ComissionAccountNumber>"+Лев(СокрЛП(ПараметрыЗапроса.param.SourceAccountNumber),22)+"</ComissionAccountNumber>"
		+"<IntermediaryBankCode>"+СокрЛП(ПараметрыЗапроса.param.IntermediaryBankCode)+"</IntermediaryBankCode>"
		+"<IntermediaryBankName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.IntermediaryBankName))+"</IntermediaryBankName>"
		+"<PaymentDetail>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.PaymentDetail))+"</PaymentDetail>"
		+"<ValueDate>"+СокрЛП(ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата()))+"</ValueDate>"
		+"</ForeignPayment>"
		+"</ArrayOfForeignPayment>";
		
	ИначеЕсли ИмяМетода = "api/documents/domestic" Тогда  
		
		//МД5Объект = ПолучитьОбъектМД5();
		//UniqueId = MD5(МД5Объект, ПараметрыЗапроса.param.DocumentNo);
		
		xml = "<?xml version=""1.0"" encoding=""UTF-8""?>" 
		+"<ArrayOfDomesticPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"
		+"<DomesticPayment>"	
		+"<Amount>"+СтрЗаменить(СтрЗаменить(СокрЛП(ПараметрыЗапроса.param.Amount),",","."), Символы.НПП, "")+"</Amount>"
		+"<BeneficiaryAccountNumber>"+СокрЛП(ПараметрыЗапроса.param.BeneficiaryAccountNumber)+"</BeneficiaryAccountNumber>"
		+"<Currency>"+СокрЛП(ПараметрыЗапроса.param.Currency)+"</Currency>"
		+"<DocumentNo>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.DocumentNo))+"</DocumentNo>"
		+"<SourceAccountNumber>"+СокрЛП(ПараметрыЗапроса.param.SourceAccountNumber)+"</SourceAccountNumber>"
		+"<UniqueId>"+UniqueId+"</UniqueId>"
		+"<AdditionalInformation>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.AdditionalInformation))+"</AdditionalInformation>"
		+"<BeneficiaryBankCode>"+СокрЛП(ПараметрыЗапроса.param.BeneficiaryBankCode)+"</BeneficiaryBankCode>"
		+"<BeneficiaryInn>"+СокрЛП(ПараметрыЗапроса.param.BeneficiaryInn)+"</BeneficiaryInn>"
		+"<BeneficiaryName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.BeneficiaryName))+"</BeneficiaryName>"
		+"<DispatchType>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.DispatchType))+"</DispatchType>"
		+"<Nomination>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Nomination))+"</Nomination>"
		+"<PayerInn>"+СокрЛП(ПараметрыЗапроса.param.PayerInn)+"</PayerInn>"
		+"<PayerName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.PayerName))+"</PayerName>"
		+"<ValueDate>"+СокрЛП(ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата()))+"</ValueDate>"
		+"</DomesticPayment>"
		+"</ArrayOfDomesticPayment>";
		
	ИначеЕсли ИмяМетода = "api/documents/bulk/foreign" Тогда  
		
		xml = "";
		ТекстЗапроса = "";
		
		//МД5Объект = ПолучитьОбъектМД5();
		
		Если ПараметрыЗапроса.param.Документ.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата Тогда
			Для Каждого Строка Из ПараметрыЗапроса.param.Документ.ВыплатаЗаработнойПлаты Цикл
				
				ТаблицаУИД = Новый ТаблицаЗначений;
				ТаблицаУИД.Колонки.Добавить("УникальныйИД", Новый ОписаниеТипов("Строка"));
				ТаблицаУИД.Колонки.Добавить("НомерСтроки" , Новый ОписаниеТипов("Число"));
				ТаблицаУИД.Колонки.Добавить("Ведомость"   , Новый ОписаниеТипов("ДокументСсылка.ПлатежнаяВедомость"));
				
				Для Каждого Строка1 ИЗ Строка.Ведомость.Сотрудники Цикл 
					
					//документ генерируется из Номера документа + НомерВедомости + НомерСтроки.
					//так как длина документа ограничена, у номера документа и у номера ведосомти отсекаются 0 с левой стороны.
					
					ДлинаНомераДокумента = СтрДлина(ПараметрыЗапроса.param.Документ.Номер);
					ДлинаНомераВедомости = СтрДлина(Строка.Ведомость.Номер);
					
					НомерДокумента = ПараметрыЗапроса.param.Документ.Номер;
					НомерВедомости = Строка.Ведомость.Номер;
					
					Пока ДлинаНомераДокумента > 0 И Найти(НомерДокумента, 0) = 1 Цикл
						НомерДокумента = Прав(НомерДокумента, ДлинаНомераДокумента -1); 
						ДлинаНомераДокумента = ДлинаНомераДокумента -1;
					КонецЦикла;
					
					Пока ДлинаНомераВедомости > 0 И Найти(НомерВедомости, 0) = 1 Цикл
						НомерВедомости = Прав(НомерВедомости, ДлинаНомераВедомости -1); 
						ДлинаНомераВедомости = ДлинаНомераВедомости -1;
					КонецЦикла;
					
					DocumentNoПред = НомерДокумента + Прав(СтрЗаменить(Год(ПараметрыЗапроса.param.Документ.Дата), ",", ""),2) + НомерВедомости + Прав(СтрЗаменить(Год(Строка.Ведомость.Дата), ",", ""),2) + Строка1.НомерСтроки;
					
					//DocumentNo = MD5(МД5Объект, DocumentNoПред); 
					
					DocumentNo = Новый УникальныйИдентификатор;
					
					ДокНом_УИД = Лев(DocumentNo, 16);
					
					// присваиваю УникИД строкам ТЧ			
					НоваяСтрока = ТаблицаУИД.Добавить();
					НоваяСтрока.УникальныйИД = DocumentNo;
					НоваяСтрока.НомерСтроки  = Строка1.НомерСтроки;
					НоваяСтрока.Ведомость    = Строка.Ведомость;
					// присваиваю УникИД строкам ТЧ
					
					Amount = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Строка1.СуммаПлатежа),",", ""), " ", ""),Символы.НПП,"");
					
					ТекстЗапроса = ТекстЗапроса+"<ForeignPayment>"	
					+"<Amount>"+Amount+"</Amount>"
					//+"<BeneficiaryAccountNumber>"+Строка1.ОсновнойБанковскийСчет.НомерСчета+"</BeneficiaryAccountNumber>" //DO-25834
					+"<BeneficiaryAccountNumber>"+Лев(СокрЛП(Строка1.Сотрудник.БанковскийСчетПоУмолчанию.НомерСчета),22)+"</BeneficiaryAccountNumber>"
					+"<Currency>"+СокрЛП(ПараметрыЗапроса.param.Currency)+"</Currency>"
					+"<DocumentNo>"+СокрЛП(ОбработатьТекстДляXML(ДокНом_УИД))+"</DocumentNo>"
					+"<SourceAccountNumber>"+СокрЛП(ПараметрыЗапроса.param.Документ.БанковскийСчет.НомерСчета)+"</SourceAccountNumber>"
					+"<UniqueId>"+DocumentNo+"</UniqueId>"
					+"<AdditionalInformation>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Комментарий))+"</AdditionalInformation>"
					//+"<BeneficiaryBankCode>"+Строка1.ОсновнойБанковскийСчет.Банк.Код+"</BeneficiaryBankCode>"
					//+"<BeneficiaryBankName>"+Строка1.ОсновнойБанковскийСчет.Банк.Наименование+"</BeneficiaryBankName>"
					+"<BeneficiaryBankCode>"+СокрЛП(Строка1.Сотрудник.БанковскийСчетПоУмолчанию.Банк.СВИФТБИК)+"</BeneficiaryBankCode>"
					+"<BeneficiaryBankName>"+СокрЛП(ОбработатьТекстДляXML(Строка1.Сотрудник.БанковскийСчетПоУмолчанию.Банк.Наименование))+"</BeneficiaryBankName>"
					//+"<BeneficiaryInn>"+Строка1.Сотрудник.Физлицо.ЛичныйНомер+"</BeneficiaryInn>"
					+"<BeneficiaryInn></BeneficiaryInn>"
					+"<BeneficiaryName>"+СокрЛП(ОбработатьТекстДляXML(Строка1.Сотрудник.Наименование))+"</BeneficiaryName>"
					+"<Charges>"+СокрЛП(ПараметрыЗапроса.param.Документ.ТипКомиссии)+"</Charges>"
					+"<ComissionAccountNumber>"+СокрЛП(ПараметрыЗапроса.param.ComissionAccountNumber)+"</ComissionAccountNumber>"
					+"<IntermediaryBankCode>"+СокрЛП(ПараметрыЗапроса.param.IntermediaryBankCode)+"</IntermediaryBankCode>"
					+"<IntermediaryBankName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.IntermediaryBankName))+"</IntermediaryBankName>"
					+"<PaymentDetail>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.PaymentDetail))+"</PaymentDetail>"
					+"<ValueDate>"+СокрЛП(ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата()))+".0373796+04:00"+"</ValueDate>"
					+"</ForeignPayment>"
					
				КонецЦикла;
			КонецЦикла;
		Иначе 
			ТаблицаУИД = Новый ТаблицаЗначений;
			ТаблицаУИД.Колонки.Добавить("УникальныйИД", Новый ОписаниеТипов("Строка"));
			ТаблицаУИД.Колонки.Добавить("НомерСтроки" , Новый ОписаниеТипов("Число"));
			ТаблицаУИД.Колонки.Добавить("Ведомость", Новый ОписаниеТипов("ДокументСсылка.ПлатежнаяВедомость"));
			Для Каждого Строка Из ПараметрыЗапроса.param.Документ.ВыплатаЗаработнойПлаты Цикл				
				//Для Каждого Строка1 ИЗ Строка.Ведомость.СуммаКВыплате Цикл 
				
				//документ генерируется из Номера документа + НомерВедомости + НомерСтроки.
				//так как длина документа ограничена, у номера документа и у номера ведосомти отсекаются 0 с левой стороны.
				
				ДлинаНомераДокумента = СтрДлина(ПараметрыЗапроса.param.Документ.Номер);
				ДлинаНомераВедомости = СтрДлина(Строка.Ведомость.Номер);
				
				НомерДокумента = ПараметрыЗапроса.param.Документ.Номер;
				НомерВедомости = Строка.Ведомость.Номер;
				
				Пока ДлинаНомераДокумента > 0 И Найти(НомерДокумента, 0) = 1 Цикл
					НомерДокумента = Прав(НомерДокумента, ДлинаНомераДокумента -1); 
					ДлинаНомераДокумента = ДлинаНомераДокумента -1;
				КонецЦикла;
				
				Пока ДлинаНомераВедомости > 0 И Найти(НомерВедомости, 0) = 1 Цикл
					НомерВедомости = Прав(НомерВедомости, ДлинаНомераВедомости -1); 
					ДлинаНомераВедомости = ДлинаНомераВедомости -1;
				КонецЦикла;
				
				//DocumentNoПред = НомерДокумента + Прав(СтрЗаменить(Год(ПараметрыЗапроса.param.Документ.Дата), ",", ""),2) + НомерВедомости + Прав(СтрЗаменить(Год(Строка.Ведомость.Дата), ",", ""),2) + Строка1.НомерСтроки;
				
				//DocumentNo = MD5(МД5Объект, DocumentNoПред); 
				DocumentNo = Новый УникальныйИдентификатор;
				
				ДокНом_УИД = Лев(DocumentNo, 16);
				
				// присваиваю УникИД строкам ТЧ			
				НоваяСтрока = ТаблицаУИД.Добавить();
				НоваяСтрока.УникальныйИД = DocumentNo;
				НоваяСтрока.НомерСтроки  = Строка.НомерСтроки;
				НоваяСтрока.Ведомость    = Строка.Ведомость;
				// присваиваю УникИД строкам ТЧ               
				
				Amount = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Строка.СуммаПлатежа),",", ""), " ", ""), Символы.НПП, "");//СуммаКВыплате),",", ""), " ", "");
				
				BeneficiaryAccountNumber = Лев(СокрЛП(Строка.БанковскийСчет.НомерСчета),22); //DO-25834
				//Лев(СокрЛП(Строка1.ОсновнойБанковскийСчет.НомерСчета),22);
				SourceAccountNumber = Лев(СокрЛП(ПараметрыЗапроса.param.Документ.БанковскийСчет.НомерСчета), 22);
				
				ТекстЗапроса = ТекстЗапроса+"<ForeignPayment>"	
				+"<Amount>"+Amount+"</Amount>"
				//+"<BeneficiaryAccountNumber>"+Строка1.ОсновнойБанковскийСчет.НомерСчета+"</BeneficiaryAccountNumber>"
				+"<BeneficiaryAccountNumber>"+СокрЛП(BeneficiaryAccountNumber)+"</BeneficiaryAccountNumber>"
				+"<Currency>"+СокрЛП(ПараметрыЗапроса.param.Currency)+"</Currency>"
				+"<DocumentNo>"+СокрЛП(ОбработатьТекстДляXML(ДокНом_УИД))+"</DocumentNo>"
				//+"<SourceAccountNumber>"+ПараметрыЗапроса.param.Документ.СчетОрганизации.НомерСчета+"</SourceAccountNumber>"
				+"<SourceAccountNumber>"+СокрЛП(SourceAccountNumber)+"</SourceAccountNumber>"
				+"<UniqueId>"+СокрЛП(DocumentNo)+"</UniqueId>"
				+"<AdditionalInformation>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Комментарий))+"</AdditionalInformation>"
				//+"<BeneficiaryBankCode>"+Строка1.ОсновнойБанковскийСчет.Банк.Код+"</BeneficiaryBankCode>"
				+"<BeneficiaryBankCode>"+СокрЛП(Строка.БанковскийСчет.Банк.Код)+"</BeneficiaryBankCode>"
				//+"<BeneficiaryInn>"+Строка1.Сотрудник.Физлицо.ЛичныйНомер+"</BeneficiaryInn>"
				+"<BeneficiaryInn>"+СокрЛП(Строка.Сотрудник.Физлицо.ИНН)+"</BeneficiaryInn>"
				+"<BeneficiaryName>"+СокрЛП(ОбработатьТекстДляXML(Строка.Сотрудник.Наименование))+"</BeneficiaryName>"
				+"<DispatchType>"+СокрЛП(ПараметрыЗапроса.param.Документ.ТипОтправки)+"</DispatchType>"
				+"<Nomination>"+СокрЛП(ОбработатьТекстДляXML(Строка.Ведомость.Комментарий))+"</Nomination>"
				+"<PayerInn>"+СокрЛП(ПараметрыЗапроса.param.Документ.Организация.ИНН)+"</PayerInn>"
				+"<PayerName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Организация))+"</PayerName>"
				+"<ValueDate>"+СокрЛП(ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата()))+"</ValueDate>"
				+"</ForeignPayment>";
				
			КонецЦикла;
		КонецЕсли;
		
		xml = xml+"<?xml version=""1.0"" encoding=""UTF-8""?>"+"<ArrayOfForeignPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"+ТекстЗапроса+"</ArrayOfForeignPayment>";
		
	ИначеЕсли ИмяМетода = "api/documents/bulk/domestic" Тогда  
		
		xml = "";
		ТекстЗапроса = "";
		
		//МД5Объект = ПолучитьОбъектМД5();
		ТаблицаУИД = Новый ТаблицаЗначений;
		ТаблицаУИД.Колонки.Добавить("УникальныйИД", Новый ОписаниеТипов("Строка"));
		ТаблицаУИД.Колонки.Добавить("НомерСтроки" , Новый ОписаниеТипов("Число"));
		
		//Если ПараметрыЗапроса.param.Документ.ВидОперации = Перечисления.ВидыОперацийППИсходящее.НачисленияИВыплатаЗаработнойПлатыРаботнику Тогда
		Если ПараметрыЗапроса.param.Документ.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата Тогда
			//Для Каждого Строка Из ПараметрыЗапроса.param.Документ.НачислениеЗарплатыРаботникам Цикл
			Для Каждого Строка Из ПараметрыЗапроса.param.Документ.ВыплатаЗаработнойПлаты Цикл//ПараметрыЗапроса.param.Документ.ДокументОснование.Сотрудники Цикл
				
				Для Каждого Строка1 ИЗ Строка.Ведомость.Сотрудники Цикл 
					
					//документ генерируется из Номера документа + НомерВедомости + НомерСтроки.
					//так как длина документа ограничена, у номера документа и у номера ведосомти отсекаются 0 с левой стороны.
					
					ДлинаНомераДокумента = СтрДлина(ПараметрыЗапроса.param.Документ.Номер);
					//ДлинаНомераВедомости = СтрДлина(Строка.Ведомость.Номер);
					
					НомерДокумента = ПараметрыЗапроса.param.Документ.Номер;
					//НомерВедомости = Строка.Ведомость.Номер;
					
					Пока ДлинаНомераДокумента > 0 И Найти(НомерДокумента, 0) = 1 Цикл
						НомерДокумента = Прав(НомерДокумента, ДлинаНомераДокумента -1); 
						ДлинаНомераДокумента = ДлинаНомераДокумента -1;
					КонецЦикла;
					
					//Пока ДлинаНомераВедомости > 0 И Найти(НомерВедомости, 0) = 1 Цикл
					//	НомерВедомости = Прав(НомерВедомости, ДлинаНомераВедомости -1); 
					//	ДлинаНомераВедомости = ДлинаНомераВедомости -1;
					//КонецЦикла;
					
					//DocumentNoПред = НомерДокумента + Прав(СтрЗаменить(Год(ПараметрыЗапроса.param.Документ.Дата), ",", ""),2) + Строка.НомерСтроки;
					
					//DocumentNo = MD5(МД5Объект, DocumentNoПред);
					DocumentNo = Новый УникальныйИдентификатор;//MD5(МД5Объект, DocumentNoПред);
					
					ДокНом_УИД = Лев(DocumentNo, 16);
					
					// присваиваю УникИД строкам ТЧ			
					НоваяСтрока = ТаблицаУИД.Добавить();
					НоваяСтрока.УникальныйИД = DocumentNo;
					НоваяСтрока.НомерСтроки  = Строка1.НомерСтроки;
					//НоваяСтрока.Ведомость    = Строка.Ведомость;
					// присваиваю УникИД строкам ТЧ               
					
					//Amount = СтрЗаменить(СтрЗаменить(Строка(Строка.СуммаБезНДФЛ),",", ""), " ", "");
					Amount = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Строка1.СуммаПлатежа),",", ""), " ", ""),Символы.НПП,"");
					
					//BeneficiaryAccountNumber = Лев(СокрЛП(Строка.Сотрудник.ОсновнойБанковскийСчет.НомерСчета),22); //DO-25834
					BeneficiaryAccountNumber = Лев(СокрЛП(Строка1.Сотрудник.БанковскийСчетПоУмолчанию.НомерСчета),22); //DO-25834
					//Лев(СокрЛП(Строка1.ОсновнойБанковскийСчет.НомерСчета),22);
					//SourceAccountNumber = Лев(СокрЛП(ПараметрыЗапроса.param.Документ.СчетОрганизации.НомерСчета), 22);    БанковскийСчет
					SourceAccountNumber = Лев(СокрЛП(ПараметрыЗапроса.param.Документ.БанковскийСчет.НомерСчета), 22);    
					
					ТекстЗапроса = ТекстЗапроса+"<DomesticPayment>"	
					//
					+"<Amount>"+Amount+"</Amount>"
					//+"<BeneficiaryAccountNumber>"+Строка1.ОсновнойБанковскийСчет.НомерСчета+"</BeneficiaryAccountNumber>"
					+"<BeneficiaryAccountNumber>"+СокрЛП(BeneficiaryAccountNumber)+"</BeneficiaryAccountNumber>"
					+"<Currency>"+СокрЛП(ПараметрыЗапроса.param.Currency)+"</Currency>"
					+"<DocumentNo>"+СокрЛП(ОбработатьТекстДляXML(ДокНом_УИД))+"</DocumentNo>"
					//+"<SourceAccountNumber>"+ПараметрыЗапроса.param.Документ.СчетОрганизации.НомерСчета+"</SourceAccountNumber>"
					+"<SourceAccountNumber>"+СокрЛП(SourceAccountNumber)+"</SourceAccountNumber>"
					+"<UniqueId>"+СокрЛП(DocumentNo)+"</UniqueId>"
					//+"<IsSalary>Yes</IsSalary>"
					+"<AdditionalInformation>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Комментарий))+"</AdditionalInformation>"
					//+"<BeneficiaryBankCode>"+Строка1.ОсновнойБанковскийСчет.Банк.Код+"</BeneficiaryBankCode>"
					//+"<BeneficiaryBankCode>"+Строка.Сотрудник.ОсновнойБанковскийСчет.Банк.Код+"</BeneficiaryBankCode>"
					+"<BeneficiaryBankCode>"+СокрЛП(Строка1.Сотрудник.БанковскийСчетПоУмолчанию.Банк.СВИФТБИК)+"</BeneficiaryBankCode>"
					//+"<BeneficiaryInn>"+Строка1.Сотрудник.Физлицо.ЛичныйНомер+"</BeneficiaryInn>"
					//+"<BeneficiaryInn>"+Строка.Сотрудник.Физлицо.ЛичныйНомер+"</BeneficiaryInn>"  ИНН
					+"<BeneficiaryInn>"+СокрЛП(Строка1.Сотрудник.Физлицо.ИНН)+"</BeneficiaryInn>"  
					+"<BeneficiaryName>"+СокрЛП(ОбработатьТекстДляXML(Строка1.Сотрудник.Наименование))+"</BeneficiaryName>"
					+"<DispatchType>"+СокрЛП(ПараметрыЗапроса.param.Документ.ТипОтправки)+"</DispatchType>"
					+"<Nomination>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.НазначениеПлатежа))+"</Nomination>"
					+"<PayerInn>"+СокрЛП(ПараметрыЗапроса.param.Документ.Организация.ИНН)+"</PayerInn>"
					+"<PayerName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Организация))+"</PayerName>"
					+"<ValueDate>"+СокрЛП(ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата()))+"</ValueDate>"
					+"</DomesticPayment>";
					///////////////////////////////////////////////////////
					//+"<AdditionalInformation>"+ПараметрыЗапроса.param.AdditionalInformation+"</AdditionalInformation>"
					//+"<SourceAccountNumber>"+SourceAccountNumber+"</SourceAccountNumber>"
					//+"<DocumentNo>"+ОбработатьТекстДляXML(ДокНом_УИД)+"</DocumentNo>"
					//+"<BeneficiaryBankCode>"+Строка1.Сотрудник.БанковскийСчетПоУмолчанию.Банк.СВИФТБИК+"</BeneficiaryBankCode>"
					//+"<BeneficiaryAccountNumber>"+BeneficiaryAccountNumber+"</BeneficiaryAccountNumber>"
					//+"<BeneficiaryName>"+ОбработатьТекстДляXML(Строка1.Сотрудник.Наименование)+"</BeneficiaryName>"
					//+"<BeneficiaryInn>"+Строка1.Сотрудник.Физлицо.ИНН+"</BeneficiaryInn>"//Строка1.Сотрудник.Физлицо.ИНН+"</BeneficiaryInn>"
					//+"<Nomination>"+ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.НазначениеПлатежа)+"</Nomination>"
					//+"<Amount>"+Amount+"</Amount>"
					//+"<IsSalary>True</IsSalary>"
					//+"<DispatchType>"+ПараметрыЗапроса.param.Документ.ТипОтправки+"</DispatchType>"
					//
					//
					////
					//
					////+"<CheckInn>True</ CheckInn>"
					////+"<Currency>"+ПараметрыЗапроса.param.Currency+"</Currency>"
					////
					//
					////+"<UniqueId>"+DocumentNo+"</UniqueId>"
					////+"<DispatchType>"+ПараметрыЗапроса.param.Документ.ТипОтправки+"</DispatchType>"
					////+"<IsSalary>True</IsSalary>"
					////
					//////+"<PayerInn>"+"</PayerInn>"//+ПараметрыЗапроса.param.Документ.Организация.ИНН+"</PayerInn>"
					//////+"<PayerName>"+"</PayerName>"//+ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Организация)+"</PayerName>"
					//////+"<ValueDate>"+ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата())+"</ValueDate>"
					//+"</DomesticPayment>";
					
				КонецЦикла;
			КонецЦикла;	
		Иначе
			ТаблицаУИД.Колонки.Добавить("Ведомость", Новый ОписаниеТипов("ДокументСсылка.ПлатежнаяВедомость"));
			Для Каждого Строка Из ПараметрыЗапроса.param.Документ.ВыплатаЗаработнойПлаты Цикл				
				//Для Каждого Строка1 ИЗ Строка.Ведомость.СуммаКВыплате Цикл 
					
					//документ генерируется из Номера документа + НомерВедомости + НомерСтроки.
					//так как длина документа ограничена, у номера документа и у номера ведосомти отсекаются 0 с левой стороны.
					
					ДлинаНомераДокумента = СтрДлина(ПараметрыЗапроса.param.Документ.Номер);
					ДлинаНомераВедомости = СтрДлина(Строка.Ведомость.Номер);
					
					НомерДокумента = ПараметрыЗапроса.param.Документ.Номер;
					НомерВедомости = Строка.Ведомость.Номер;
					
					Пока ДлинаНомераДокумента > 0 И Найти(НомерДокумента, 0) = 1 Цикл
						НомерДокумента = Прав(НомерДокумента, ДлинаНомераДокумента -1); 
						ДлинаНомераДокумента = ДлинаНомераДокумента -1;
					КонецЦикла;
					
					Пока ДлинаНомераВедомости > 0 И Найти(НомерВедомости, 0) = 1 Цикл
						НомерВедомости = Прав(НомерВедомости, ДлинаНомераВедомости -1); 
						ДлинаНомераВедомости = ДлинаНомераВедомости -1;
					КонецЦикла;
					
					//DocumentNoПред = НомерДокумента + Прав(СтрЗаменить(Год(ПараметрыЗапроса.param.Документ.Дата), ",", ""),2) + НомерВедомости + Прав(СтрЗаменить(Год(Строка.Ведомость.Дата), ",", ""),2) + Строка1.НомерСтроки;
					
					//DocumentNo = MD5(МД5Объект, DocumentNoПред); 
					DocumentNo = Новый УникальныйИдентификатор;
					
					ДокНом_УИД = Лев(DocumentNo, 16);
					
					// присваиваю УникИД строкам ТЧ			
					НоваяСтрока = ТаблицаУИД.Добавить();
					НоваяСтрока.УникальныйИД = DocumentNo;
					НоваяСтрока.НомерСтроки  = Строка.НомерСтроки;
					НоваяСтрока.Ведомость    = Строка.Ведомость;
					// присваиваю УникИД строкам ТЧ               
					
					Amount = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Строка.СуммаПлатежа),",", ""), " ", ""), Символы.НПП, "");//СуммаКВыплате),",", ""), " ", "");
					
					BeneficiaryAccountNumber = Лев(СокрЛП(Строка.БанковскийСчет.НомерСчета),22); //DO-25834
					//Лев(СокрЛП(Строка1.ОсновнойБанковскийСчет.НомерСчета),22);
					SourceAccountNumber = Лев(СокрЛП(ПараметрыЗапроса.param.Документ.БанковскийСчет.НомерСчета), 22);
					
					ТекстЗапроса = ТекстЗапроса+"<DomesticPayment>"	
					+"<Amount>"+Amount+"</Amount>"
					//+"<BeneficiaryAccountNumber>"+Строка1.ОсновнойБанковскийСчет.НомерСчета+"</BeneficiaryAccountNumber>"
					+"<BeneficiaryAccountNumber>"+СокрЛП(BeneficiaryAccountNumber)+"</BeneficiaryAccountNumber>"
					+"<Currency>"+СокрЛП(ПараметрыЗапроса.param.Currency)+"</Currency>"
					+"<DocumentNo>"+СокрЛП(ОбработатьТекстДляXML(ДокНом_УИД))+"</DocumentNo>"
					//+"<SourceAccountNumber>"+ПараметрыЗапроса.param.Документ.СчетОрганизации.НомерСчета+"</SourceAccountNumber>"
					+"<SourceAccountNumber>"+СокрЛП(SourceAccountNumber)+"</SourceAccountNumber>"
					+"<UniqueId>"+СокрЛП(DocumentNo)+"</UniqueId>"
					+"<AdditionalInformation>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Комментарий))+"</AdditionalInformation>"
					//+"<BeneficiaryBankCode>"+Строка1.ОсновнойБанковскийСчет.Банк.Код+"</BeneficiaryBankCode>"
					+"<BeneficiaryBankCode>"+СокрЛП(Строка.БанковскийСчет.Банк.СВИФТБИК)+"</BeneficiaryBankCode>"
					//+"<BeneficiaryInn>"+Строка1.Сотрудник.Физлицо.ЛичныйНомер+"</BeneficiaryInn>"
					+"<BeneficiaryInn>"+СокрЛП(Строка.Сотрудник.Физлицо.ИНН)+"</BeneficiaryInn>"
					+"<BeneficiaryName>"+СокрЛП(ОбработатьТекстДляXML(Строка.Сотрудник.Наименование))+"</BeneficiaryName>"
					+"<DispatchType>"+СокрЛП(ПараметрыЗапроса.param.Документ.ТипОтправки)+"</DispatchType>"
					+"<Nomination>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.НазначениеПлатежа))+"</Nomination>"
					+"<PayerInn>"+СокрЛП(ПараметрыЗапроса.param.Документ.Организация.ИНН)+"</PayerInn>"
					+"<PayerName>"+СокрЛП(ОбработатьТекстДляXML(ПараметрыЗапроса.param.Документ.Организация))+"</PayerName>"
					+"<ValueDate>"+СокрЛП(ДельтаНСФ.ДатаВремяВСтроку(ТекущаяДата()))+"</ValueDate>"
					+"</DomesticPayment>";
					
				КонецЦикла;
			//КонецЦикла;
		КонецЕсли;
		xml = xml+"<?xml version=""1.0"" encoding=""UTF-8""?>"+"<ArrayOfDomesticPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"+ТекстЗапроса+"</ArrayOfDomesticPayment>";
		
	ИначеЕсли ИмяМетода = "api/documents/conversion" Тогда 
		
		//МД5Объект = ПолучитьОбъектМД5();
		//UniqueId = MD5(МД5Объект, ПараметрыЗапроса.param.DocumentNo);
		
		xml = "<?xml version=""1.0"" encoding=""UTF-8""?>" 
		+"<ArrayOfConversionPayment xmlns:i=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://schemas.datacontract.org/2004/07/CIBApi.Models"">"
		+"<ConversionPayment>"
		+"<AdditionalInfo>"+ОбработатьТекстДляXML(ПараметрыЗапроса.param.AdditionalInfo)+"</AdditionalInfo>"
		+"<Amount>"+СтрЗаменить(СтрЗаменить(СокрЛП(ПараметрыЗапроса.param.Amount),",","."), Символы.НПП, "")+"</Amount>"
		+"<DestinationAccountNumber>"+Лев(ПараметрыЗапроса.param.DestinationAccountNumber,25)+"</DestinationAccountNumber>"
		+"<DestinationCurrency>"+ПараметрыЗапроса.param.DestinationCurrency+"</DestinationCurrency>"
		+"<DocumentNo>"+ОбработатьТекстДляXML(ПараметрыЗапроса.param.DocumentNo)+"</DocumentNo>"
		+"<Rate>"+СтрЗаменить(Строка(ПараметрыЗапроса.param.Rate),",",".")+"</Rate>"
		+"<SourceAccountNumber>"+Лев(ПараметрыЗапроса.param.SourceAccountNumber,25)+"</SourceAccountNumber>"
		+"<SourceCurrency>"+ПараметрыЗапроса.param.SourceCurrency+"</SourceCurrency>"
		+"<UniqueId>"+UniqueId+"</UniqueId>"
		+"</ConversionPayment>"
		+"</ArrayOfConversionPayment>";
		
	ИначеЕсли ИмяМетода = "api/documents/status/" Или  ИмяМетода = "api/rates/commercial//" ИЛИ ИмяМетода = "api/rates/commercial/" ИЛИ ИмяМетода = "api/accounts/" ИЛИ ИмяМетода = "api/documents/bulk/status" ИЛИ ИмяМетода = "api/statement/" ИЛИ ИмяМетода = "api/statement////" ИЛИ ИмяМетода = "api/statement/summary/" Тогда
		xml = "";
	КонецЕсли;	
	
	//Текст = Новый ТекстовыйДокумент();
	//Текст.ДобавитьСтроку(xml);
	//Текст.Записать("D:\test.txt");
	
	ИмяВременногофайла = ПолучитьИмяВременногоФайла(); 
	Если xml <> "" Тогда 
		// POST запрос
		Запрос.УстановитьТелоИзСтроки(xml, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.Использовать);
		Попытка        
			//mhttp.send(xml);
			//res = mhttp.WaitForResponse();
			Результат = mhttp.ОтправитьДляОбработки(Запрос);
			//Результат =  mhttp.Получить(Запрос);
			res = Результат.КодСостояния;
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ka='ინფორმაციის გადაცემის შეცდომა! შეამოწმეთ აწყობის პარამეტრების შევსება';ru='Ошибка передачи информации! Проверьте правильность заполнения настроек';en='Information Communication error! Check the correctness of the settings'");
			Сообщить(ОписаниеОшибки());
			ПриЗагрузкеВозниклиОшибки = Истина
		КонецПопытки;
		
	Иначе 
		// GET запрос
		Попытка        
			//mhttp.send(xml);
			//res = mhttp.WaitForResponse();
			Результат =  mhttp.Получить(Запрос);
			res = Результат.КодСостояния;
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ka='ინფორმაციის გადაცემის შეცდომა! შეამოწმეთ აწყობის პარამეტრების შევსება';ru='Ошибка передачи информации! Проверьте правильность заполнения настроек';en='Information Communication error! Check the correctness of the settings'");
			Сообщить(ОписаниеОшибки());
			ПриЗагрузкеВозниклиОшибки = Истина
		КонецПопытки;
	КонецЕсли;
	
	//Попытка        
	//	mhttp.send(xml);
	//	res = mhttp.WaitForResponse();
	//Исключение
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = НСтр("ka='ინფორმაციის გადაცემის შეცდომა! შეამოწმეთ აწყობის პარამეტრების შევსება';ru='Ошибка передачи информации! Проверьте правильность заполнения настроек';en='Information Communication error! Check the correctness of the settings'");
	//	Сообщить(ОписаниеОшибки());
	//	ПриЗагрузкеВозниклиОшибки = Истина
	//КонецПопытки;	
	
	Если Не res Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='კავშირის შეცდომა';ru='Ошибка связи';en='communication error'");
		Сообщение.Сообщить(ОписаниеОшибки());
		ПриЗагрузкеВозниклиОшибки = Истина
	Конецесли;
	
	СтрокаJSONРезультат = Результат.ПолучитьТелоКакСтроку(); // mhttp.responseText;
	
	//Попытка
	//    ЧтениеJSON = Новый ЧтениеJSON;
	//	//ЧтениеJSON.Закрыть();
	//	ЧтениеJSON.УстановитьСтроку(СтрокаJSONРезультат);
	//    РезультатЧтения = ПрочитатьJSON(ЧтениеJSON, Истина);
	//	Возврат РезультатЧтения;
	//Исключение
	//	а=1;
	//	//Возврат jsonПрочитатьИнициализация(Значение, Стандарт, ПредставленияСсылок);
	//КонецПопытки;
	
	Если Не СтрокаJSONРезультат = "" Тогда	
		Если ИмяМетода = "api/documents/bulk/domestic" ИЛИ ИмяМетода = "api/documents/bulk/foreign" Тогда 
			ЗаполнитьУникальныеИД(ТаблицаУИД, ПараметрыЗапроса);
		КонецЕсли;
		//Возврат ПрочитатьJSON1(СтрокаJSONРезультат);	
		
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			//ЧтениеJSON.Закрыть();
			ЧтениеJSON.УстановитьСтроку(СтрокаJSONРезультат);
			РезультатЧтения = ПрочитатьJSON(ЧтениеJSON, Истина);
			Возврат РезультатЧтения;
		Исключение
			а=1;
			//Возврат jsonПрочитатьИнициализация(Значение, Стандарт, ПредставленияСсылок);
		КонецПопытки;
	Иначе 
		КодОшибки = Результат.КодСостояния;
		КраткоеОписание = "";//mhttp.StatusText;
		ДеталиОшибки = Результат.ПолучитьТелоКакСтроку();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='BoG ის სერვისთან მიმართვის შეცდომა!';ru='Ошибка обращения к сервисам BoG!';en='Error handling services to BoG!'") + Символы.ПС
		+ НСтр("ru = 'Код ошибки: '; ka = 'შეცდომის კოდი: '") + КодОшибки + Символы.ПС 
		+ НСтр("ru = 'Описание: '; ka = 'აღწერა: '") + КраткоеОписание + Символы.ПС;
		
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции
//--- Дмгг

Функция ЗаполнитьУникальныеИД(ТаблицаУИД, ПараметрыЗапроса)
	
	Если НЕ ТаблицаУИД.Колонки.Найти("Ведомость") = Неопределено Тогда
		Для Каждого СтрокаТЧ ИЗ ПараметрыЗапроса.param.Документ.ВыплатаЗаработнойПлаты Цикл
			//ВедомостьОбъект = СтрокаТЧ.Ведомость.ПолучитьОБъект();
			
			//Для Каждого Строка ИЗ ВедомостьОбъект.СуммаКВыплате Цикл 
			Для Каждого Строка ИЗ СтрокаТЧ.Ведомость.Сотрудники Цикл
				
				Для Каждого СтрокаТЗ ИЗ ТаблицаУИД Цикл 
					Если СтрокаТЗ.НомерСтроки = Строка.НомерСтроки Тогда
						ЗначениеУИД = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрокаТЗ.УникальныйИД,",",""),Символы.НПП,""), " ","");
						//Строка.УникальныйИдентификаторВИнтернетБанке = СтрокаТЗ.УникальныйИД;
						
						НаборЗаписейУИДДокумента = РегистрыСведений.УИДДокументовВИнтернетБанке.СоздатьНаборЗаписей();
						НаборЗаписейУИДДокумента.Отбор.ДокументСсылка.Установить(СтрокаТЧ.Ведомость);
						НаборЗаписейУИДДокумента.Отбор.Сотрудник.Установить(Строка.Сотрудник);
						НаборЗаписейУИДДокумента.Отбор.Банк.Установить(ПараметрыЗапроса.param.Документ.БанковскийСчет.Банк);
						
						НовыйУИД = НаборЗаписейУИДДокумента.Добавить();
						НовыйУИД.ДокументСсылка = СтрокаТЧ.Ведомость;
						НовыйУИД.Сотрудник = Строка.Сотрудник;
						НовыйУИД.Банк = ПараметрыЗапроса.param.Документ.БанковскийСчет.Банк;
						НовыйУИД.УИДДокументаВБанке = ЗначениеУИД;//СтрЗаменить(СтрЗаменить(СтрокаТЗ.УникальныйИД,",",""),Символы.НПП,"");
						НовыйУИД.Выгружен = Истина;
						
						НаборЗаписейУИДДокумента.Записать();
						
					КонецЕсли;			
				КонецЦикла;		
			КонецЦикла;
			
			//ВедомостьОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДокументЗарплатыКВыплате", Истина);
			//ВедомостьОбъект.Записать();
		КонецЦикла;
	Иначе
		//ДокОбъект = ПараметрыЗапроса.param.Документ.ПолучитьОБъект();
		//ПлатежнаяВедомостьОбъект = ДокОбъект.ДокументОснование.ПолучитьОбъект();
		//Для Каждого СтрокаТЧ ИЗ ДокОбъект.НачислениеЗарплатыРаботникам Цикл ПараметрыЗапроса.param.Документ.ДокументОснование.Сотрудники
		Для Каждого СтрокаТЧ ИЗ ПараметрыЗапроса.param.Документ.ВыплатаЗаработнойПлаты Цикл //ПлатежнаяВедомостьОбъект.Сотрудники Цикл 
			Для Каждого Сотрудник Из СтрокаТЧ.Ведомость.Сотрудники Цикл 
			Для Каждого СтрокаТЗ ИЗ ТаблицаУИД Цикл 
				Если СтрокаТЗ.НомерСтроки = Сотрудник.НомерСтроки Тогда        
					ЗначениеУИД = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЗ.УникальныйИД),",","")," ",""),Символы.НПП,"");
					//СтрокаТЧ.УникальныйИдентификаторВИнтернетБанке = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЗ.УникальныйИД),",","")," ",""),Символы.НПП,"");		
					
					НаборЗаписейУИДДокумента = РегистрыСведений.УИДДокументовВИнтернетБанке.СоздатьНаборЗаписей();
					НаборЗаписейУИДДокумента.Отбор.ДокументСсылка.Установить(СтрокаТЧ.Ведомость);
					НаборЗаписейУИДДокумента.Отбор.Сотрудник.Установить(Сотрудник.Сотрудник);
					НаборЗаписейУИДДокумента.Отбор.Банк.Установить(ПараметрыЗапроса.param.Документ.БанковскийСчет.Банк);
					
					НовыйУИД = НаборЗаписейУИДДокумента.Добавить();
					НовыйУИД.ДокументСсылка = СтрокаТЧ.Ведомость;
					НовыйУИД.Сотрудник = Сотрудник.Сотрудник;
					НовыйУИД.Банк = ПараметрыЗапроса.param.Документ.БанковскийСчет.Банк;
					НовыйУИД.УИДДокументаВБанке = ЗначениеУИД;//СтрЗаменить(СтрЗаменить(СтрокаТЗ.УникальныйИД,",",""),Символы.НПП,"");
					НовыйУИД.Выгружен = Истина;
					
					НаборЗаписейУИДДокумента.Записать();
				КонецЕсли;			
			КонецЦикла;	
			КонецЦикла;
		КонецЦикла;
		//ПлатежнаяВедомостьОбъект.Записать();
		//ДокОбъект.Записать();
	КонецЕсли;
	
КонецФункции

// JSON парсер.
//
// Параметры:
//	Значение - Строка. Строка данных в формате JSON для парсинга;
//
//  Стандарт - Неопределено, Булево. Режим работы:
//		- Истина - стандартный режим (значение по умолчанию);
//		- Ложь - альтернативный режим;
//		- Неопределено - автоопределение режима;
//
//  ПредставленияСсылок - Неопределено, Булево. Режим передачи ссылочных типов, с их представлением или без:
//		- Истина - ссылки передаются вместе со своим представлением, как объекты с двумя свойствами содержащими саму ссылку и ее представление;
//		- Ложь - ссылки передаются без представления (значение по умолчанию).
//		- Неопределено - автоопределение режима.
// 
// Возвращаемое значение:
//  Набор данных согласно содержимому входящих данных. 
//
Функция ПрочитатьJSON1(Значение, Стандарт = Истина, ПредставленияСсылок = Ложь) Экспорт 
	
	Возврат jsonПрочитатьИнициализация(Значение, Стандарт, ПредставленияСсылок);
	
КонецФункции // ПрочитатьJSON()

// JSON сериализатор.
//
// Параметры:
//	Значение. Набор данных сериализуемых в формат JSON;
//
//  Стандарт - Булево. Режим работы:
//		- Истина - стандартный режим (значение по умолчанию);
//		- Ложь - альтернативный режим;
//
//  ПредставленияСсылок - Булево. Режим передачи ссылочных типов, с их представлением или без:
//		- Истина - ссылки передаются вместе со своим представлением, как объекты с двумя свойствами содержащими саму ссылку и ее представление;
//		- Ложь - ссылки передаются без представления (значение по умолчанию).
// 
// Возвращаемое значение:
//  Строка. Строка данных в формате JSON согласно содержимому входящих данных. 
//
Функция ЗаписатьJSON1(Значение, Стандарт = Истина, ПредставленияСсылок = Ложь) Экспорт 
	
	Возврат jsonЗаписатьИнициализация(Значение, Стандарт, ПредставленияСсылок);
	
КонецФункции // ЗаписатьJSON()

// ─────────────────────────────────────────────────────────────────────────────
//  НАСТРОЙКИ
// Функция управляющая настройкой "АвтоматическоеПриведениеОбъектаКСтруктуре".
//
// Возвращаемое значение:
//  Булево. Значение настройки:
//		- Истина - выполняется автоматическое приведение объекта к структуре; 
//		- Ложь - автоматическое приведение объекта к структуре не выполняется, все объекты преобразуются в соответствие. 
//
// Примечание:
//  Автоматическое приведение к структуре выполняется только для объектов имена свойств которых могут быть 
//  использованы как ключи структуры, все остальные объекты преобразуются в соответствие.
//
Функция НастройкаАвтоматическоеПриведениеОбъектаКСтруктуре()
	
	Возврат Ложь;	// Измените для использования автоматического приведения объекта к структуре.
	
КонецФункции // НастройкаАвтоматическоеПриведениеОбъектаКСтруктуре()

// Функция управляющая настройкой "ПолноеМаскированиеСимволов".
//
// Возвращаемое значение:
//  Булево. Значение настройки:
//		- Истина - выполняется полное маскирование символов некорректно обрабатываемых JavaScript-ом; 
//		- Ложь - маскирование выполняется только согласно стандарту и дополнительно маскируются специальные символы. 
//
// Примечание:
//	Маскирование специальных символов из диапазона [0x0000, 0x001f] выполняется в не зависимости от настройки.
//
Функция НастройкаПолноеМаскированиеСимволов()
	
	Возврат Истина;	// Измените для неполного маскирования символов.
	
КонецФункции // НастройкаПолноеМаскированиеСимволов()

// Функция управляющая настройкой "МаскированиеКириллицы".
//
// Возвращаемое значение:
//  Булево. Значение настройки:
//		- Истина - выполняется маскирование кириллических символов; 
//		- Ложь - маскирование выполняется только согласно стандарту и дополнительно маскируются специальные символы. 
//
// Примечание:
//	Маскирование специальных символов из диапазона [0x0000, 0x001f] выполняется в не зависимости от настройки.
//
Функция НастройкаМаскированиеКириллицы()
	
	Возврат Ложь;	// Измените для маскирования кириллических символов.
	
КонецФункции // НастройкаМаскированиеКириллицы()

// Функция управляющая настройкой "НеявноеПриведениеПримитивныхЗначенийКлюча".
//
// Возвращаемое значение:
//  Булево. Значение настройки:
//		- Истина - выполняется неявное приведение примитивных типов значений ключей соответствий к их строковому представлению в формате 1С; 
//		- Ложь - неявное приведение примитивных типов значений ключей соответствий к строковому представлению не выполняется. 
//
// Примечание:
//	Неявно приводимые типы: Null, Булево, Число, Дата, Строка, УникальныйИдентификатор.
//
Функция НастройкаНеявноеПриведениеПримитивныхЗначенийКлюча()
	
	Возврат Ложь;	// Измените для использования неявного приведения примитивных значений ключей соответствий к строке.
	
КонецФункции // НастройкаНеявноеПриведениеПримитивныхЗначенийКлюча()


// ─────────────────────────────────────────────────────────────────────────────
//  ПАРСЕР

Функция jsonПрочитатьИнициализация(Значение, Знач Стандарт, Знач ПредставленияСсылок)
	
	// Проверка параметров.
	Если (Не Стандарт = Истина) И (Не Стандарт = Ложь) И (Не Стандарт = Неопределено) Тогда ВызватьИсключение ИсключениеНекорректныйПараметр("Стандарт"); КонецЕсли; 
	Если (Не ПредставленияСсылок = Истина) И (Не ПредставленияСсылок = Ложь) И (Не ПредставленияСсылок = Неопределено) Тогда ВызватьИсключение ИсключениеНекорректныйПараметр("ПредставленияСсылок"); КонецЕсли; 
	
	// Использование более общего случая параметров.
	Альтернативный = (Стандарт = Неопределено) Или (Не Стандарт); Стандарт = (Стандарт = Неопределено) Или Стандарт; ПредставленияСсылок = (ПредставленияСсылок = Неопределено) Или ПредставленияСсылок;
	
	// Схема подстановок шестнадцатиричной системы.
	СхемаПодстановок = Новый Соответствие; ШестнадцатиричнаяСистема = "0123456789abcdef"; ДесятичноеЧисло = 0;
	Для ВторойРазряд = 1 По 16 Цикл Для ПервыйРазряд = 1 По 16 Цикл СхемаПодстановок.Вставить(Сред(ШестнадцатиричнаяСистема, ВторойРазряд, 1) + Сред(ШестнадцатиричнаяСистема, ПервыйРазряд, 1), ДесятичноеЧисло); ДесятичноеЧисло = ДесятичноеЧисло + 1; КонецЦикла; КонецЦикла;
	
	// Вспомогательные данные.
	ВспомогательныеДанные = Новый Структура("ТипСтроки,СхемаПодстановок,АвтоматическиПриводитьКСтруктуре",
	Тип("Строка"),
	СхемаПодстановок,
	(НастройкаАвтоматическоеПриведениеОбъектаКСтруктуре() = Истина));
	
	// Стартовые значения.
	Индекс = 1; Длина = СтрДлина(Значение);
	
	// Форматирование (первый шаг парсера).
	Если Стандарт Тогда СимволыФорматирования = " " + Символы.ВК + Символы.ПС + Символы.Таб; jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); КонецЕсли;
	Если (Индекс > Длина) Тогда ВызватьИсключение ИсключениеПустойПакетДанных(); КонецЕсли; 
	
	// Парсер.
	Возврат jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, Истина);
	
КонецФункции // jsonПрочитатьИнициализация()

Функция jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, ПервыйУровень)
	
	Символ = Сред(Значение, Индекс, 1);
	Если (Символ = """") Или (Символ = "'") Тогда        																	// " , '
		
		// Строка.
		Подстрока = Сред(Значение, Индекс + 1); Начало = Индекс; Пока Истина Цикл
			Позиция = Найти(Подстрока, Символ);
			
			Если (Позиция > 0) Тогда
				Индекс = Индекс + Позиция; Откат = Позиция - 1; Маскировка = Ложь; Пока (Сред(Подстрока, Откат, 1) = "\") И Откат Цикл Маскировка = Не Маскировка; Откат = Откат - 1; КонецЦикла;
				Если Маскировка Тогда Подстрока = Сред(Подстрока, Позиция + 1); Иначе Прервать; КонецЕсли;
			Иначе
				ВызватьИсключение ИсключениеНеожиданноеОкончаниеПакетаДанных();
			КонецЕсли;
			
		КонецЦикла;
		
		// Строка.
		Результат = jsonПрочитатьСтроку(Сред(Значение, Начало + 1, Индекс - Начало - 1), Стандарт, Начало, ВспомогательныеДанные.СхемаПодстановок, (Символ = "'"));
		
		Если jsonПрочитатьОпределитьДату(Результат) Тогда
			// Дата.
			Результат = jsonПрочитатьДату(Результат, Начало);
		ИначеЕсли jsonПрочитатьОпределитьИдентификатор(Результат) Тогда
			// Идентификатор.
			Результат = jsonПрочитатьИдентификатор(Результат, Начало);
		Иначе
			Если Альтернативный И jsonПрочитатьОпределитьВнутреннийТип(Результат) Тогда
				// Внутренний тип.
				Результат = jsonПрочитатьВнутреннийТип(Результат, Начало);
			КонецЕсли;
		КонецЕсли;
		
		// Корректировка индекса.
		Индекс = Индекс + 1;
		
	ИначеЕсли (Символ = "[") Тогда																							// [
		
		// Массив.
		Результат = Новый Массив;
		
		Индекс = Индекс + 1; Если Стандарт Тогда jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); КонецЕсли; Если (Индекс > Длина) Тогда ВызватьИсключение ИсключениеНеожиданноеОкончаниеМассива(Длина); КонецЕсли;
		Символ = Сред(Значение, Индекс, 1); Если (Символ = "]") Тогда														// ] 
			
			// Пустой массив.
			Индекс = Индекс + 1;
			
		Иначе
			
			Пока (Индекс <= Длина) Цикл
				
				// Значение.
				Результат.Добавить(jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, Ложь));
				
				Символ = Сред(Значение, Индекс, 1);
				Если (Символ = "]") Тогда																					// ]
					// Окончание массива.
					Индекс = Индекс + 1; Прервать;
				Иначе
					// Продолжение массива.
					Если (Символ = ",") Тогда																				// ,
						Индекс = Индекс + 1; Если Стандарт Тогда jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); КонецЕсли; Если (Индекс >= Длина) Тогда ВызватьИсключение ИсключениеНеожиданноеОкончаниеМассива(Длина); КонецЕсли;
					Иначе
						ВызватьИсключение ИсключениеНедопустимыйСимвол(Индекс, ",");
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли (Символ = "{") Тогда																							// {
		
		// Объект.
		Индекс = Индекс + 1; Если Стандарт Тогда jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); КонецЕсли; Если (Индекс > Длина) Тогда ВызватьИсключение ИсключениеНеожиданноеОкончаниеМассива(Длина); КонецЕсли;
		Символ = Сред(Значение, Индекс, 1); Если (Символ = "}") Тогда														// } 
			
			// Пустой объект.
			Индекс = Индекс + 1;
			
			// Структура или соответствие.
			Если ВспомогательныеДанные.АвтоматическиПриводитьКСтруктуре Тогда Результат = Новый Структура; Иначе Результат = Новый Соответствие; КонецЕсли; 
			
		Иначе
			
			Результат = Новый Соответствие;
			
			ТипСтроки = ВспомогательныеДанные.ТипСтроки; Пока (Индекс <= Длина) Цикл
				
				// Ключ.
				Начало = Индекс; КлючЭлемента = jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, Ложь); Если (Не ТипЗнч(КлючЭлемента) = ТипСтроки) Тогда ВызватьИсключение ИсключениеНедопустимыйТипКлюча(Начало, КлючЭлемента); КонецЕсли;
				
				Символ = Сред(Значение, Индекс, 1);
				Если (Символ = ":") Тогда																					// :
					Индекс = Индекс + 1; Если Стандарт Тогда jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); КонецЕсли; Если (Индекс >= Длина) Тогда ВызватьИсключение ИсключениеНеожиданноеОкончаниеОбъетка(Длина); КонецЕсли;
				Иначе
					ВызватьИсключение ИсключениеНедопустимыйСимвол(Индекс, ":");
				КонецЕсли;
				
				// Значение.
				ЗначениеЭлемента = jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, Ложь);
				
				// Коллекция.
				Результат.Вставить(КлючЭлемента, ЗначениеЭлемента);
				
				Символ = Сред(Значение, Индекс, 1);
				Если (Символ = "}") Тогда																					// }
					// Окончание объекта.
					Индекс = Индекс + 1; Прервать;
				Иначе
					// Продолжение объекта.
					Если (Символ = ",") Тогда																				// ,
						Индекс = Индекс + 1; Если Стандарт Тогда jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); КонецЕсли; Если (Индекс >= Длина) Тогда ВызватьИсключение ИсключениеНеожиданноеОкончаниеОбъетка(Длина); КонецЕсли;
					Иначе
						ВызватьИсключение ИсключениеНедопустимыйСимвол(Индекс, ",");
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			// Структура или соответствие.
			Если ВспомогательныеДанные.АвтоматическиПриводитьКСтруктуре Тогда
				
				РезультатСтруктура = Новый Структура; 
				Для Каждого Элемент Из Результат Цикл Попытка РезультатСтруктура.Вставить(Элемент.Ключ, Элемент.Значение); Исключение РезультатСтруктура = Результат; АвтоматическоеПриведениеНеВыполнено = Истина; Прервать; КонецПопытки; КонецЦикла;
				Результат = РезультатСтруктура;
				
				// Ссылка.
				Если ПредставленияСсылок Тогда Результат = jsonПрочитатьСсылку(Результат, (АвтоматическоеПриведениеНеВыполнено = Истина)); КонецЕсли;
				
			Иначе
				
				// Ссылка.
				Если ПредставленияСсылок Тогда Результат = jsonПрочитатьСсылку(Результат, Истина); КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	Иначе
		
		// Остальные примитивные типы.
		Если (Символ = "n") Тогда
			
			// Null.
			Если (Сред(Значение, Индекс, 4) = "null") Тогда Индекс = Индекс + 4; Результат = Null; Иначе ВызватьИсключение ИсключениеНекорректныйТипNull(Индекс); КонецЕсли;
			
		ИначеЕсли (Символ = "t") Тогда
			
			// Истина.
			Если (Сред(Значение, Индекс, 4) = "true") Тогда Индекс = Индекс + 4; Результат = Истина; Иначе ВызватьИсключение ИсключениеНекорректныйТипБулево(Индекс); КонецЕсли;
			
		ИначеЕсли (Символ = "f") Тогда
			
			// Ложь.
			Если (Сред(Значение, Индекс, 5) = "false") Тогда Индекс = Индекс + 5; Результат = Ложь; Иначе ВызватьИсключение ИсключениеНекорректныйТипБулево(Индекс); КонецЕсли;
			
		ИначеЕсли (Символ = "u") Тогда
			
			// Неопределено.
			Если (Сред(Значение, Индекс, 9) = "undefined") Тогда Индекс = Индекс + 9; Результат = Неопределено; Иначе ВызватьИсключение ИсключениеНекорректныйТипНеопределено(Индекс); КонецЕсли;
			
		Иначе
			
			// Число.
			Начало = Индекс; Пока Найти("-+0123456789.", Символ) И (Индекс <= Длина) Цикл Индекс = Индекс + 1; Символ = Сред(Значение, Индекс, 1); КонецЦикла;
			
			// Преобразование числа.
			Попытка
				Результат = Число(Сред(Значение, Начало, Индекс - Начало));
			Исключение
				ВызватьИсключение ИсключениеНекорректныйФорматЧисла(Начало, Сред(Значение, Начало, Индекс - Начало)); 
			КонецПопытки;
			
			// Экспоненциальная часть.
			Если (Символ = "E") Или (Символ = "e") Тогда
				
				// Степень.
				Индекс = Индекс + 1; Позиция = Индекс; Символ = Сред(Значение, Индекс, 1); Пока Найти("-+0123456789", Символ) И (Индекс <= Длина) Цикл Индекс = Индекс + 1; Символ = Сред(Значение, Индекс, 1); КонецЦикла;
				
				// Преобразование степени.
				Попытка
					Степень = Число(Сред(Значение, Позиция, Индекс - Позиция));
				Исключение
					ВызватьИсключение ИсключениеНекорректныйФорматЧисла(Начало, Сред(Значение, Начало, Индекс - Начало)); 
				КонецПопытки;
				
				// Возвидение числа в степень.
				Результат = Результат * Pow(10, Степень);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Форматирование.
	Если Стандарт Тогда jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); КонецЕсли; Если ПервыйУровень Тогда Если (Индекс <= Длина) Тогда ВызватьИсключение ИсключениеНекорректныйПакетДанных(Индекс); КонецЕсли; Иначе Если (Индекс > Длина) Тогда ВызватьИсключение ИсключениеНеожиданноеОкончаниеПакетаДанных(); КонецЕсли; КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // jsonПрочитать()

Функция jsonПрочитатьОпределитьДату(Значение)
	
	// Проверка.
	Если (СтрДлина(Значение) = 20) Тогда
		Если (Сред(Значение, 05, 1) = "-") И				// -
			(Сред(Значение, 08, 1) = "-") И				// -
			(Сред(Значение, 11, 1) = "T") И				// T
			(Сред(Значение, 14, 1) = ":") И				// :
			(Сред(Значение, 17, 1) = ":") И				// :
			(Сред(Значение, 20, 1) = "Z") Тогда			// Z
			// Год. 
			Если Найти("0123456789", Сред(Значение, 01, 1)) И
				Найти("0123456789", Сред(Значение, 02, 1)) И
				Найти("0123456789", Сред(Значение, 03, 1)) И
				Найти("0123456789", Сред(Значение, 04, 1)) И
				// Месяц.
				Найти("0123456789", Сред(Значение, 06, 1)) И
				Найти("0123456789", Сред(Значение, 07, 1)) И
				// День.
				Найти("0123456789", Сред(Значение, 09, 1)) И
				Найти("0123456789", Сред(Значение, 10, 1)) И
				// Час.
				Найти("0123456789", Сред(Значение, 12, 1)) И
				Найти("0123456789", Сред(Значение, 13, 1)) И
				// Минута.
				Найти("0123456789", Сред(Значение, 15, 1)) И
				Найти("0123456789", Сред(Значение, 16, 1)) И
				// Секунда.
				Найти("0123456789", Сред(Значение, 18, 1)) И
				Найти("0123456789", Сред(Значение, 19, 1)) Тогда
				Возврат Истина; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // jsonПрочитатьОпределитьДату()

Функция jsonПрочитатьОпределитьИдентификатор(Значение)
	
	// Проверка.
	Если (СтрДлина(Значение) = 36) Тогда
		Если (Сред(Значение, 09, 1) = "-") И					// -
			(Сред(Значение, 14, 1) = "-") И					// -
			(Сред(Значение, 19, 1) = "-") И					// -
			(Сред(Значение, 24, 1) = "-") Тогда				// -
			// Первая часть. 
			Для Индекс = 01 По 08 Цикл Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда Возврат Ложь; КонецЕсли; КонецЦикла;
			// Вторая часть. 
			Для Индекс = 10 По 13 Цикл Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда Возврат Ложь; КонецЕсли; КонецЦикла;
			// Третья часть. 
			Для Индекс = 15 По 18 Цикл Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда Возврат Ложь; КонецЕсли; КонецЦикла;
			// Четвертая часть. 
			Для Индекс = 20 По 23 Цикл Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда Возврат Ложь; КонецЕсли; КонецЦикла;
			// Пятая часть. 
			Для Индекс = 25 По 36 Цикл Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда Возврат Ложь; КонецЕсли; КонецЦикла;
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // jsonПрочитатьОпределитьИдентификатор()

Функция jsonПрочитатьОпределитьВнутреннийТип(Значение)
	
	// Поиск.
	Возврат (Лев(Значение, 1) = "¦") И (Сред(Значение, 5, 1) = "¦") И (Прав(Значение, 1) = "¦"); // ¦xxx¦ ... ¦
	
КонецФункции // jsonПрочитатьОпределитьВнутреннийТип()

Функция jsonПрочитатьСтроку(Значение, Стандарт, Индекс, СхемаПодстановок, ОдинарнаяКавычка)
	
	// Последоавтельность перемаскировки.
	ПоследоавтельностьПеремаскировки = "\" + Символ(65535);
	
	// Демаскирование служебных символов.
	Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Значение, 
	"\\",			ПоследоавтельностьПеремаскировки),		// Перемаскирование последовательности.
	"\/",			"/"),           // x2f
	"\b",			Символ(008)),	// x08
	"\t",			Символы.Таб),   // x09
	"\n",			Символы.ПС),    // x0a
	"\f",			Символы.ПФ),    // x0c
	"\r",			Символы.ВК),    // x0d
	"\""",			"""");          // x22
	
	// Демаскирование Юникод символов.
	Позиция = Найти(Результат, "\u"); Пока Позиция Цикл
		СтаршийБайт = СхемаПодстановок[НРег(Сред(Результат, Позиция + 2, 2))]; МладшийБайт = СхемаПодстановок[НРег(Сред(Результат, Позиция + 4, 2))]; Если (СтаршийБайт = Неопределено) Или (МладшийБайт = Неопределено) Тогда ВызватьИсключение ИсключениеНекорректныйФорматСтроки(Индекс); КонецЕсли;
		Результат = СтрЗаменить(Результат, Сред(Результат, Позиция, 6), Символ(256 * СтаршийБайт + МладшийБайт)); Позиция = Найти(Результат, "\u");
	КонецЦикла;
	
	// Одинарная кавычка.
	Если ОдинарнаяКавычка Тогда Результат = СтрЗаменить(Результат, "\'", "'"); КонецЕсли;
	
	// Демаскирование перемаскированой последовательности.
	Возврат СтрЗаменить(Результат, ПоследоавтельностьПеремаскировки, "\");				
	
КонецФункции // jsonПрочитатьСтроку()

Функция jsonПрочитатьДату(Значение, Индекс)
	
	// Поиск.
	Попытка
		Возврат Дата(Лев(Значение, 4) + Сред(Значение, 06, 2) + Сред(Значение, 09, 2) + 
		Сред(Значение, 12, 2) + Сред(Значение, 15, 2) + Сред(Значение, 18, 2));
	Исключение
		ВызватьИсключение ИсключениеНекорректныйФорматДаты(Индекс, Значение);
	КонецПопытки;
	
КонецФункции // jsonПрочитатьДату()

Функция jsonПрочитатьСсылку(Значение, Соответствие)
	
	Перем Ссылка;
	
	// Ссылка.
	Если (Значение.Количество() = 2) Тогда 
		Если Соответствие Тогда
			Ссылка = Значение.Получить("Ссылка"); Если (Не Ссылка = Неопределено) И (Не Значение.Получить("Представление") = Неопределено) Тогда Возврат Ссылка; КонецЕсли;
		Иначе
			Если Значение.Свойство("Представление") И Значение.Свойство("Ссылка", Ссылка) Тогда Возврат Ссылка; КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Значение;
	
КонецФункции // jsonПрочитатьСсылку()

Функция jsonПрочитатьИдентификатор(Значение, Индекс)
	
	// Поиск.
	Возврат Новый УникальныйИдентификатор(Значение);
	
КонецФункции // jsonПрочитатьИдентификатор()

Функция jsonПрочитатьВнутреннийТип(Значение, Индекс)
	#Если ВебКлиент Или ТонкийКлиент Тогда
		ВызватьИсключение ИсключениеНевозможноПреобразоватьЗначениеНаКлиенте(Индекс, Значение);
	#Иначе
		
		// Поиск.
		Тип = Сред(Значение, 2, 3); Данные = Сред(Значение, 6, СтрДлина(Значение) - 6);
		
		Если (Тип = "ref") Тогда
			Попытка
				Возврат ЗначениеИзСтрокиВнутр("{""#""," + СтрЗаменить(СтрЗаменить(Данные, "×", ":"), "÷", ",") + "}");
			Исключение
				ВызватьИсключение ИсключениеНевозможноПреобразоватьЗначение(Индекс, Значение);
			КонецПопытки;
		КонецЕсли;
		
		ВызватьИсключение ИсключениеНеопознанныйТип(Индекс, Тип);
		
	#КонецЕсли
КонецФункции // jsonПрочитатьВнутреннийТип()

Процедура jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования)
	
	// Пропуск форматирования.
	Пока (Индекс <= Длина) И Найти(СимволыФорматирования, Сред(Значение, Индекс, 1)) Цикл Индекс = Индекс + 1; КонецЦикла;
	// Пробел его не видно, \r, \n, \t .
	
КонецПроцедуры // jsonПрочитатьПропуститьФорматирование()

//─────────────────────────────────────────────────────────────────────────────
// СЕРИАЛИЗАТОР

Функция jsonЗаписатьИнициализация(Значение, Знач Стандарт, Знач ПредставленияСсылок)
	
	// Проверка параметров.
	Если (Не Стандарт = Истина) И (Не Стандарт = Ложь) Тогда ВызватьИсключение ИсключениеНекорректныйПараметр("Стандарт"); КонецЕсли; 
	Если (Не ПредставленияСсылок = Истина) И (Не ПредставленияСсылок = Ложь) Тогда ВызватьИсключение ИсключениеНекорректныйПараметр("ПредставленияСсылок"); КонецЕсли; 
	
	ВспомогательныеДанные = Новый Структура("ПримитивныеТипы,Массивы,Структуры,Соответсвия,Построители,КлиентскиеТипы,ТипДопустимыхКлючей", 
	Новый ОписаниеТипов("Null,Булево,Число,Дата,УникальныйИдентификатор"),									// ПримитивныеТипы.
	#Если ВебКлиент Или ТонкийКлиент Тогда
		Новый ОписаниеТипов("Массив,ФиксированныйМассив"),													// Массивы.
		Новый ОписаниеТипов("Структура,ФиксированнаяСтруктура"),											// Структуры.
		Новый ОписаниеТипов("Структура,ФиксированнаяСтруктура,Соответствие,ФиксированноеСоответствие"),		// Соответсвия.
	#Иначе
		#Если НаСервере Тогда
			Новый ОписаниеТипов("Массив,ФиксированныйМассив,ФиксированнаяКоллекция"),						// Массивы.
			Новый ОписаниеТипов("Структура,ФиксированнаяСтруктура"),										// Структуры.
			Новый ОписаниеТипов("Структура,ФиксированнаяСтруктура,Соответствие,ФиксированноеСоответствие"),	// Соответсвия.
		#Иначе
			Новый ОписаниеТипов("Массив,ФиксированныйМассив"),												// Массивы.
			Новый ОписаниеТипов("Структура"),																// Структуры.
			Новый ОписаниеТипов("Структура,Соответствие"),													// Соответсвия.
		#КонецЕсли
	#КонецЕсли
	#Если ВебКлиент Или ТонкийКлиент Тогда
		Неопределено,																						// Построители.
	#Иначе
		Новый ОписаниеТипов("ПостроительЗапроса,ПостроительОтчета"),										// Построители.
	#КонецЕсли
	#Если НаСервере Тогда
		Новый ОписаниеТипов("ДанныеФормыКоллекция,ДанныеФормыСтруктураСКоллекцией,ДанныеФормыДерево"),		// КлиентскиеТипы.
	#Иначе
		Неопределено,																						// КлиентскиеТипы.
	#КонецЕсли
	Новый ОписаниеТипов("Строка"));																			// ТипДопустимыхКлючей.
	
	// Типы допустимых ключей.
	Если (НастройкаНеявноеПриведениеПримитивныхЗначенийКлюча() = Истина) Тогда ВспомогательныеДанные.ТипДопустимыхКлючей = Новый ОписаниеТипов("Null,Булево,Число,Дата,Строка,УникальныйИдентификатор"); КонецЕсли;
	
	// форматирование.
	Если Стандарт Тогда Смещение = ""; Отступ = " "; Табуляция = "    "; ПереносСтроки = Символы.ПС; Иначе Смещение = ""; Отступ = ""; Табуляция = ""; ПереносСтроки = ""; КонецЕсли;
	
	// Сериализация.
	Возврат jsonЗаписать(Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, (НастройкаПолноеМаскированиеСимволов() = Истина), (НастройкаМаскированиеКириллицы() = Истина));
	
КонецФункции // jsonЗаписатьИнициализация()

Функция jsonЗаписать(Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы)
	
	// Определение типа.
	Тип = ТипЗнч(Значение);
	
	// Строка.
	Если (Тип = Тип("Строка")) Тогда Возврат jsonЗаписатьСтроку(Значение, ПолноеМаскированиеСимволов, МаскированиеКириллицы); КонецЕсли;
	
	// Неопределено и примитивные типы.
	Если ВспомогательныеДанные.ПримитивныеТипы.СодержитТип(Тип) Тогда 
		#Если ВебКлиент Или ТонкийКлиент Тогда
			Если (Значение = Null) Или (Значение = Неопределено) Тогда Возврат "null"; ИначеЕсли (Тип = Тип("Дата")) Тогда Возврат """" + Формат(Значение, "ДФ=yyyy-MM-ddTHH:mm:ss; ДП=") + "Z""" ИначеЕсли (Тип = Тип("УникальныйИдентификатор")) Тогда Возврат """" + Значение + """"; Иначе Возврат Формат(Значение, "ЧРД=.; ЧН=; ЧГ=; БЛ=false; БИ=true"); КонецЕсли;
		#Иначе
			Если (Значение = Null) Или (Значение = Неопределено) Тогда Возврат "null"; ИначеЕсли (Тип = Тип("Дата")) Тогда Возврат """" + XMLСтрока(Значение) + "Z""" ИначеЕсли (Тип = Тип("УникальныйИдентификатор")) Тогда Возврат """" + XMLСтрока(Значение) + """"; Иначе Возврат XMLСтрока(Значение); КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	
	// Структуры и строка дерева значений (структурой).
	Если ВспомогательныеДанные.Структуры.СодержитТип(Тип) Тогда
		Если Значение.Количество() Тогда
			
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;
			
			Если (Колонки = Неопределено) Тогда
				
				// Структуры.
				Если МаскированиеКириллицы Тогда
					
					Первый = Истина; Для Каждого Элемент Из Значение Цикл
						Если Первый Тогда
							Результат = ПереносСтроки + СледующееСмещение + jsonЗаписатьСтроку(Элемент.Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы) + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
						Иначе
							Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписатьСтроку(Элемент.Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы) + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
						КонецЕсли;
					КонецЦикла;
					
				Иначе
					
					Первый = Истина; Для Каждого Элемент Из Значение Цикл
						Если Первый Тогда
							Результат = ПереносСтроки + СледующееСмещение + """" + Элемент.Ключ + """:" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
						Иначе
							Результат = Результат + "," + ПереносСтроки + СледующееСмещение + """" + Элемент.Ключ + """:" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				
				// Строка дерева значений (структурой).
				Если МаскированиеКириллицы Тогда
					
					Первый = Истина; Для Каждого Элемент Из Значение Цикл
						Если (Элемент.Ключ = "Строки") Тогда Продолжить; КонецЕсли;
						Если Первый Тогда
							Результат = ПереносСтроки + СледующееСмещение + jsonЗаписатьСтроку(Элемент.Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы) + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
						Иначе
							Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписатьСтроку(Элемент.Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы) + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
						КонецЕсли;
					КонецЦикла;
					Если Первый Тогда
						Результат = ПереносСтроки + СледующееСмещение + """\u0421\u0442\u0440\u043e\u043a\u0438"":" + Отступ + jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					Иначе
						Результат = Результат + "," + ПереносСтроки + СледующееСмещение + """\u0421\u0442\u0440\u043e\u043a\u0438"":" + Отступ + jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					КонецЕсли;
					
				Иначе
					
					Первый = Истина; Для Каждого Элемент Из Значение Цикл
						Если (Элемент.Ключ = "Строки") Тогда Продолжить; КонецЕсли;
						Если Первый Тогда
							Результат = ПереносСтроки + СледующееСмещение + """" + Элемент.Ключ + """:" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
						Иначе
							Результат = Результат + "," + ПереносСтроки + СледующееСмещение + """" + Элемент.Ключ + """:" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
						КонецЕсли;
					КонецЦикла;
					Если Первый Тогда
						Результат = ПереносСтроки + СледующееСмещение + """Строки"":" + Отступ + jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					Иначе
						Результат = Результат + "," + ПереносСтроки + СледующееСмещение + """Строки"":" + Отступ + jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			Возврат "{" + Результат + ПереносСтроки + Смещение + "}";
			
		Иначе
			
			// Пустая структура.
			Возврат "{}";
			
		КонецЕсли;
	КонецЕсли;
	
	// Соответсвия.
	Если ВспомогательныеДанные.Соответсвия.СодержитТип(Тип) Тогда
		Если Значение.Количество() Тогда
			
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;
			
			// Соответсвия.
			ТипДопустимыхКлючей = ВспомогательныеДанные.ТипДопустимыхКлючей;
			
			Если МаскированиеКириллицы Тогда
				
				Первый = Истина; Для Каждого Элемент Из Значение Цикл
					Ключ = Элемент.Ключ; Если ТипДопустимыхКлючей.СодержитТип(ТипЗнч(Ключ)) Тогда Ключ = jsonЗаписатьСтроку(Строка(Ключ), ПолноеМаскированиеСимволов, МаскированиеКириллицы); Иначе ВызватьИсключение ИсключениеНедопустимыйТипКлюча(Неопределено, Ключ); КонецЕсли;
					Если Первый Тогда
						Результат = ПереносСтроки + СледующееСмещение + Ключ + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
					Иначе
						Результат = Результат + "," + ПереносСтроки + СледующееСмещение + Ключ + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				
				Первый = Истина; Для Каждого Элемент Из Значение Цикл
					Ключ = Элемент.Ключ; Тип = ТипЗнч(Ключ); Если (Тип = Тип("Строка")) Тогда Ключ = jsonЗаписатьСтроку(Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы); ИначеЕсли ТипДопустимыхКлючей.СодержитТип(Тип) Тогда Ключ = """" + Ключ + """"; Иначе ВызватьИсключение ИсключениеНедопустимыйТипКлюча(Неопределено, Ключ); КонецЕсли;
					Если Первый Тогда
						Результат = ПереносСтроки + СледующееСмещение + Ключ + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
					Иначе
						Результат = Результат + "," + ПереносСтроки + СледующееСмещение + Ключ + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			Возврат "{" + Результат + ПереносСтроки + Смещение + "}";
			
		Иначе
			
			// Пустое соответсвие.
			Возврат "{}";
			
		КонецЕсли;
	КонецЕсли;
	
	// Массивы.
	Если ВспомогательныеДанные.Массивы.СодержитТип(Тип) Тогда
		Если Значение.Количество() Тогда
			
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;
			
			Первый = Истина; Для Каждого Элемент Из Значение Цикл
				Если Первый Тогда
					Результат = ПереносСтроки + СледующееСмещение + jsonЗаписать(Элемент, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
				Иначе
					Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписать(Элемент, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
				КонецЕсли;
			КонецЦикла;
			
			Возврат "[" + Результат + ПереносСтроки + Смещение + "]";
			
		Иначе
			
			// Пустой массив.
			Возврат "[]";
			
		КонецЕсли;
	КонецЕсли;
	
	// Список значений.
	Если (Тип = Тип("СписокЗначений")) Тогда
		Если Значение.Количество() Тогда
			
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;
			
			Структура = Новый Структура("Значение,Представление,Пометка");
			Первый = Истина; Для Каждого Элемент Из Значение Цикл
				ЗаполнитьЗначенияСвойств(Структура, Элемент);
				Если Первый Тогда
					Результат = ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
				Иначе
					Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
				КонецЕсли;
			КонецЦикла;
			
			Возврат "[" + Результат + ПереносСтроки + Смещение + "]";
			
		Иначе
			
			// Пустой список значений.
			Возврат "[]";
			
		КонецЕсли;
	КонецЕсли;
	
	// Таблица значений.
	#Если ВебКлиент Или ТонкийКлиент Тогда
	#Иначе
		Если (Тип = Тип("ТаблицаЗначений")) Тогда
			Если Значение.Количество() Тогда
				
				// форматирование.
				СледующееСмещение = Смещение + Табуляция;
				
				Структура = Новый Структура; НаборКолонок = Значение.Колонки; Для Каждого Колонка Из НаборКолонок Цикл Структура.Вставить(Колонка.Имя); КонецЦикла;
				
				Первый = Истина; Для Каждого Элемент Из Значение Цикл
					ЗаполнитьЗначенияСвойств(Структура, Элемент);
					Если Первый Тогда
						Результат = ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
					Иначе
						Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					КонецЕсли;
				КонецЦикла;
				Возврат "[" + Результат + ПереносСтроки + Смещение + "]";
				
			Иначе
				
				// Пустая таблица значений.
				Возврат "[]";
				
			КонецЕсли;
		КонецЕсли;
		
		// Коллекция строк дерева значений.
		Если (Тип = Тип("КоллекцияСтрокДереваЗначений")) Тогда
			Если Значение.Количество() Тогда
				
				// форматирование.
				СледующееСмещение = Смещение + Табуляция;
				
				Структура = Колонки; Первый = Истина; Для Каждого Элемент Из Значение Цикл
					ЗаполнитьЗначенияСвойств(Структура, Элемент); Структура.Строки = Элемент.Строки;
					Если Первый Тогда
						Результат = ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
					Иначе
						Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					КонецЕсли;
				КонецЦикла;
				Возврат "[" + Результат + ПереносСтроки + Смещение + "]";
				
			Иначе
				
				// Пустая коллекция строк.
				Возврат "[]";
				
			КонецЕсли;
		КонецЕсли;
		
		// Дерево значений.
		Если (Тип = Тип("ДеревоЗначений")) Тогда
			
			Структура = Новый Структура("Строки"); НаборКолонок = Значение.Колонки; Для Каждого Колонка Из НаборКолонок Цикл Структура.Вставить(Колонка.Имя); КонецЦикла;
			Возврат jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Структура, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
			
		КонецЕсли;
		
		// Запрос.
		Если (Тип = Тип("Запрос")) Тогда Попытка Возврат jsonЗаписать(Значение.Выполнить().Выгрузить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Исключение ВызватьИсключение ИсключениеНевозможноВыполнитьЗапрос(ИнформацияОбОшибке().Причина.Описание); КонецПопытки; КонецЕсли;
		
		// Результат запроса.
		Если (Тип = Тип("РезультатЗапроса")) Тогда Возврат jsonЗаписать(Значение.Выгрузить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); КонецЕсли;
		
		// Выборка из результата запроса.
		Если (Тип = Тип("ВыборкаИзРезультатаЗапроса")) Тогда
			
			Структура = Новый Структура; НаборКолонок = Значение.Владелец().Колонки; Для Каждого Колонка Из НаборКолонок Цикл Структура.Вставить(Колонка.Имя); КонецЦикла;
			ЗаполнитьЗначенияСвойств(Структура, Значение);
			Возврат jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
			
		КонецЕсли;
		
		// Построители.
		Если ВспомогательныеДанные.Построители.СодержитТип(Тип) Тогда Попытка Значение.Выполнить(); Исключение ВызватьИсключение ИсключениеНевозможноВыполнитьЗапрос(ИнформацияОбОшибке().Причина.Описание); КонецПопытки; Возврат jsonЗаписать(Значение.Результат, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); КонецЕсли;
		
		// Хранилище значения.
		Если (Тип = Тип("ХранилищеЗначения")) Тогда Возврат jsonЗаписать(Значение.Получить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); КонецЕсли;
	#КонецЕсли
	
	// Двоичные данные.
	Если (Тип = Тип("ДвоичныеДанные")) Тогда
		#Если ВебКлиент Или ТонкийКлиент Тогда
			Возврат """" + СтрЗаменить(СтрЗаменить(СтрЗаменить(Base64Строка(Значение), Символы.ВК, ""), Символы.ПС, ""), "/", "\/") + """";
		#Иначе
			Возврат """" + СтрЗаменить(СтрЗаменить(СтрЗаменить(XMLСтрока(Значение), Символы.ВК, ""), Символы.ПС, ""), "/", "\/") + """";
		#КонецЕсли
	КонецЕсли;
	
	// Картинка.
	Если (Тип = Тип("Картинка")) Тогда
		#Если ВебКлиент Или ТонкийКлиент Тогда
			Возврат """" + СтрЗаменить(СтрЗаменить(СтрЗаменить(Base64Строка(Значение.ПолучитьДвоичныеДанные()), Символы.ВК, ""), Символы.ПС, ""), "/", "\/") + """";
		#Иначе
			Возврат """" + СтрЗаменить(СтрЗаменить(СтрЗаменить(XMLСтрока(Значение.ПолучитьДвоичныеДанные()), Символы.ВК, ""), Символы.ПС, ""), "/", "\/") + """";
		#КонецЕсли
	КонецЕсли;
	
	// Ключ и значение.
	Если (Тип = Тип("КлючИЗначение")) Тогда Возврат jsonЗаписать(Новый Структура("Ключ,Значение", Значение.Ключ, Значение.Значение), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); КонецЕсли;
	
	// Клиентские типы.
	#Если НаСервере Тогда
		Если ВспомогательныеДанные.КлиентскиеТипы.СодержитТип(Тип) Тогда
			Если (Тип = Тип("ДанныеФормыДерево")) Тогда
				Возврат jsonЗаписать(ДанныеФормыВЗначение(Значение, Тип("ДеревоЗначений")), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
			Иначе
				Возврат jsonЗаписать(Значение.Выгрузить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
	// COMSafeArray.
	#Если ВебКлиент Тогда
	#Иначе
		Если (Тип = Тип("COMSafeArray")) Тогда Возврат jsonЗаписать(Значение.Выгрузить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); КонецЕсли;
	#КонецЕсли
	
	// Ссылки.
	#Если ВебКлиент Или ТонкийКлиент Тогда
	#Иначе
		Перечисление = Перечисления.ТипВсеСсылки().СодержитТип(Тип);
		Если Перечисление Или
			Справочники.ТипВсеСсылки().СодержитТип(Тип) Или
			Документы.ТипВсеСсылки().СодержитТип(Тип) Или
			ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип) Или
			ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип) Или
			ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип) Или
			Задачи.ТипВсеСсылки().СодержитТип(Тип) Или
			БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип) Или
			БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().СодержитТип(Тип) Или
			ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип) Тогда 
			Возврат jsonЗаписатьСсылку(Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Перечисление, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
		КонецЕсли;
	#КонецЕсли
	
	// Неподдерживаемые типы.
	Возврат jsonЗаписатьСтроку(Значение, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
	
КонецФункции // jsonЗаписать()

Функция jsonЗаписатьСтроку(Значение, ПолноеМаскированиеСимволов, МаскированиеКириллицы)
	
	// Маскирование служебных символов.
	Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Значение, 
	"\",			"\\"),			// x5c
	"/",			"\/"),			// x2f
	Символ(008),	"\b"),			// x08
	Символы.Таб,	"\t"), 			// x09
	Символы.ПС,		"\n"),			// x0a
	Символы.ПФ,		"\f"),			// x0c
	Символы.ВК,		"\r"),			// x0d
	"""",			"\""");			// x22
	
	// Маскирование специальных символов.
	Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
	Символ(00),		"\u0000"),
	Символ(01),		"\u0001"),
	Символ(02),		"\u0002"),
	Символ(03),		"\u0003"),
	Символ(04),		"\u0004"),
	Символ(05),		"\u0005"),
	Символ(06),		"\u0006"),
	Символ(07),		"\u0007"),
	Символ(11),		"\u000b"),
	Символ(14),		"\u000e"),
	Символ(15),		"\u000f"),
	Символ(16),		"\u0010"),
	Символ(17),		"\u0011"),
	Символ(18),		"\u0012"),
	Символ(19),		"\u0013"),
	Символ(20),		"\u0014"),
	Символ(21),		"\u0015"),
	Символ(22),		"\u0016"),
	Символ(23),		"\u0017"),
	Символ(24),		"\u0018"),
	Символ(25),		"\u0019"),
	Символ(26),		"\u001a"),
	Символ(27),		"\u001b"),
	Символ(28),		"\u001c"),
	Символ(29),		"\u001d"),
	Символ(30),		"\u001e"),
	Символ(31),		"\u001f");
	
	Если ПолноеМаскированиеСимволов Тогда
		
		// Маскирование сиволов обрабатываемых JavaScript-ом не правильно.
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
		Символ(127),	"\u007f"),
		Символ(128),	"\u0080"),
		Символ(129),	"\u0081"),
		Символ(130),	"\u0082"),
		Символ(131),	"\u0083"),
		Символ(132),	"\u0084"),
		Символ(133),	"\u0085"),
		Символ(134),	"\u0086"),
		Символ(135),	"\u0087"),
		Символ(136),	"\u0088"),
		Символ(137),	"\u0089"),
		Символ(138),	"\u008a"),
		Символ(139),	"\u008b"),
		Символ(140),	"\u008c"),
		Символ(141),	"\u008d"),
		Символ(142),	"\u008e"),
		Символ(143),	"\u008f"),
		Символ(144),	"\u0090"),
		Символ(145),	"\u0091"),
		Символ(146),	"\u0092"),
		Символ(147),	"\u0093"),
		Символ(148),	"\u0094"),
		Символ(149),	"\u0095"),
		Символ(150),	"\u0096"),
		Символ(151),	"\u0097"),
		Символ(152),	"\u0098"),
		Символ(153),	"\u0099"),
		Символ(154),	"\u009a"),
		Символ(155),	"\u009b"),
		Символ(156),	"\u009c"),
		Символ(157),	"\u009d"),
		Символ(158),	"\u009e"),
		Символ(159),	"\u009f"),
		Символ(173),	"\u00ad");
		
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
		Символ(1536),	"\u0600"),
		Символ(1537),	"\u0601"),
		Символ(1538),	"\u0602"),
		Символ(1539),	"\u0603"),
		Символ(1540),	"\u0604"),
		Символ(1807),	"\u070f"),
		Символ(6068),	"\u17b4"),
		Символ(6069),	"\u17b5"),
		Символ(8204),	"\u200c"),
		Символ(8205),	"\u200d"),
		Символ(8206),	"\u200e"),
		Символ(8207),	"\u200f"),
		Символ(8232),	"\u2028"),
		Символ(8233),	"\u2029"),
		Символ(8234),	"\u202a"),
		Символ(8235),	"\u202b"),
		Символ(8236),	"\u202c"),
		Символ(8237),	"\u202d"),
		Символ(8238),	"\u202e"),
		Символ(8239),	"\u202f"),
		Символ(8288),	"\u2060"),
		Символ(8289),	"\u2061"),
		Символ(8290),	"\u2062"),
		Символ(8291),	"\u2063"),
		Символ(8292),	"\u2064"),
		Символ(8293),	"\u2065"),
		Символ(8294),	"\u2066"),
		Символ(8295),	"\u2067");
		
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
		Символ(8296),	"\u2068"),
		Символ(8297),	"\u2069"),
		Символ(8268),	"\u206a"),
		Символ(8299),	"\u206b"),
		Символ(8300),	"\u206c"),
		Символ(8301),	"\u206d"),
		Символ(8302),	"\u206e"),
		Символ(8303),	"\u206f"),
		Символ(65279),	"\ufeff"),
		Символ(65520),	"\ufff0"),
		Символ(65521),	"\ufff1"),
		Символ(65522),	"\ufff2"),
		Символ(65523),	"\ufff3"),
		Символ(65524),	"\ufff4"),
		Символ(65525),	"\ufff5"),
		Символ(65526),	"\ufff6"),
		Символ(65527),	"\ufff7"),
		Символ(65528),	"\ufff8"),
		Символ(65529),	"\ufff9"),
		Символ(65530),	"\ufffa"),
		Символ(65531),	"\ufffb"),
		Символ(65532),	"\ufffc"),
		Символ(65533),	"\ufffd"),
		Символ(65534),	"\ufffe"),
		Символ(65535),	"\uffff");
		
	КонецЕсли;
	
	Если МаскированиеКириллицы Тогда
		
		// Маскирование кириллических символов.
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
		"А",            "\u0410"),
		"Б",            "\u0411"),
		"В",            "\u0412"),
		"Г",            "\u0413"),
		"Д",            "\u0414"),
		"Е",            "\u0415"),
		"Ж",            "\u0416"),
		"З",            "\u0417"),
		"И",            "\u0418"),
		"Й",            "\u0419"),
		"К",            "\u041a"),
		"Л",            "\u041b"),
		"М",            "\u041c"),
		"Н",            "\u041d"),
		"О",            "\u041e"),
		"П",            "\u041f"),
		"Р",            "\u0420"),
		"С",            "\u0421"),
		"Т",            "\u0422"),
		"У",            "\u0423"),
		"Ф",            "\u0424"),
		"Х",            "\u0425"),
		"Ц",            "\u0426"),
		"Ч",            "\u0427"),
		"Ш",            "\u0428"),
		"Щ",            "\u0429"),
		"Ъ",            "\u042a"),
		"Ы",            "\u042b"),
		"Ь",            "\u042c"),
		"Э",            "\u042d"),
		"Ю",            "\u042e"),
		"Я",            "\u042f");
		
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
		"а",            "\u0430"),
		"б",            "\u0431"),
		"в",            "\u0432"),
		"г",            "\u0433"),
		"д",            "\u0434"),
		"е",            "\u0435"),
		"ж",            "\u0436"),
		"з",            "\u0437"),
		"и",            "\u0438"),
		"й",            "\u0439"),
		"к",            "\u043a"),
		"л",            "\u043b"),
		"м",            "\u043c"),
		"н",            "\u043d"),
		"о",            "\u043e"),
		"п",            "\u043f"),
		"р",            "\u0440"),
		"с",            "\u0441"),
		"т",            "\u0442"),
		"у",            "\u0443"),
		"ф",            "\u0444"),
		"х",            "\u0445"),
		"ц",            "\u0446"),
		"ч",            "\u0447"),
		"ш",            "\u0448"),
		"щ",            "\u0449"),
		"ъ",            "\u044a"),
		"ы",            "\u044b"),
		"ь",            "\u044c"),
		"э",            "\u044d"),
		"ю",            "\u044e"),
		"я",            "\u044f");
		
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
		"’",            "\u2019"),
		"Ґ",            "\u0490"),
		"Ђ",            "\u0402"),
		"Ѓ",            "\u0403"),
		"Ѐ",            "\u0400"),
		"Ё",            "\u0401"),
		"Є",            "\u0404"),
		"Ѕ",            "\u0405"),
		"Ѝ",            "\u040d"),
		"І",            "\u0406"),
		"Ї",            "\u0407"),
		"Ј",            "\u0408"),
		"Љ",            "\u0409"),
		"Њ",            "\u040a"),
		"Ћ",            "\u040b"),
		"Ќ",            "\u040c"),
		"Ў",            "\u040e"),
		"Џ",            "\u040f"),
		"ґ",            "\u0491"),
		"ђ",            "\u0452"),
		"ѓ",            "\u0453"),
		"ѐ",            "\u0450"),
		"ё",            "\u0451"),
		"є",            "\u0454"),
		"ѕ",            "\u0455"),
		"ѝ",            "\u045d"),
		"і",            "\u0456"),
		"ї",            "\u0457"),
		"ј",            "\u0458"),
		"љ",            "\u0459"),
		"њ",            "\u045a"),
		"ћ",            "\u045b"),
		"ќ",            "\u045c"),
		"ў",            "\u045e"),
		"џ",            "\u045f");						
		
	КонецЕсли;
	
	// Кавычки.
	Возврат """" + Результат + """";
	
КонецФункции // jsonЗаписатьСтроку()

Функция jsonЗаписатьСсылку(Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Перечисление, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы)
	#Если ВебКлиент Или ТонкийКлиент Тогда
	#Иначе
		
		// Идентификатор.
		Если Стандарт Тогда 
			Если Перечисление Тогда Идентификатор = Лев(Прав(ЗначениеВСтрокуВнутр(Значение), 33), 32); Идентификатор = Прав(Идентификатор, 8) + "-" + Сред(Идентификатор, 21, 4) + "-" + Сред(Идентификатор, 17, 4) + "-" + Лев(Идентификатор, 4) + "-" + Сред(Идентификатор, 5, 12); Иначе Идентификатор = XMLСтрока(Значение); КонецЕсли;
		Иначе 
			Идентификатор = ЗначениеВСтрокуВнутр(Значение); Идентификатор = "¦ref¦" + СтрЗаменить(СтрЗаменить(Сред(Идентификатор, 6, СтрДлина(Идентификатор) - 6), ":", "×"), ",", "÷") + "¦";
		КонецЕсли;
		
		// Включая представление ссылки.
		Если ПредставленияСсылок Тогда Возврат jsonЗаписать(Новый Структура("Ссылка,Представление", Идентификатор, Строка(Значение)), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); КонецЕсли;
		
		// Ссылка.
		Возврат """" + Идентификатор + """";
		
	#КонецЕсли
КонецФункции // jsonЗаписатьСсылку()

// ─────────────────────────────────────────────────────────────────────────────
//  ЛОКАЛИЗАЦИЯ

Функция СформироватьСтрокуПоШаблону(Строка, Параметры)
	
	Результат = Строка;
	
	Для Каждого Параметр Из Параметры Цикл
		Результат = СтрЗаменить(Результат, "[" + Параметр.Ключ + "]", Строка(Параметр.Значение));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СформироватьСтрокуПоШаблону()

Функция ИсключениеПустойПакетДанных()
	
	Возврат НСтр("ka='JSON: მონაცემების პაკეტი ცარიელია.';ru='JSON: Пустой пакет данных.';en='JSON: empty data packet.'");
	
КонецФункции // ИсключениеНеожиданноеОкончаниеСтроки()

Функция ИсключениеНекорректныйПакетДанных(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: არაკორექტული მონაცემების პაკეტი პოზიციაში [Индекс].';ru='JSON: Некорректный пакет данных в позиции [Индекс].';en='JSON: Incorrect data packet in a position to [Index].'"),
	Новый Структура("Индекс", Индекс));
	
КонецФункции // ИсключениеНекорректныйПакетДанных()

Функция ИсключениеНеожиданноеОкончаниеПакетаДанных()
	
	Возврат НСтр("ka='JSON: მონაცემების პაკეტის მოულოდნელი დასრულება.';ru='JSON: Неожиданное окончание пакета данных.';en='JSON: Unexpected end of data packet.'");
	
КонецФункции // ИсключениеНеожиданноеОкончаниеПакетаДанных()

Функция ИсключениеНеожиданноеОкончаниеМассива(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: მასივის მოულოდნელი დასრულება პოზიციაში [Индекс].';ru='JSON: Неожиданное окончание массива в позиции [Индекс].';en='JSON: Unexpected end of array in a position to [Index].'"),
	Новый Структура("Индекс", Индекс));
	
КонецФункции // ИсключениеНеожиданноеОкончаниеМассива()

Функция ИсключениеНеожиданноеОкончаниеОбъетка(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: ობიექტის მოულოდნელი დასრულება პოზიციაში [Индекс].';ru='JSON: Неожиданное окончание объекта в позиции [Индекс].';en='JSON: Unexpected end of an object in a position to [Index].'"),
	Новый Структура("Индекс", Индекс));
	
КонецФункции // ИсключениеНеожиданноеОкончаниеОбъетка()

Функция ИсключениеНекорректныйТипNull(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: არაკორექტული ტიპი Null პოზიციაში [Индекс].';ru='JSON: Некорректный тип Null в позиции [Индекс].';en='JSON: An incorrect type Null in a position to [Index].'"),
	Новый Структура("Индекс", Индекс));
	
КонецФункции // ИсключениеНекорректныйТипNull()

Функция ИсключениеНекорректныйТипБулево(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: არაკორექტული ტიპი boolean პოზიციაში [Индекс].';ru='JSON: Некорректный тип Булево в позиции [Индекс].';en='JSON: Invalid Boolean type to [Index].'"),
	Новый Структура("Индекс", Индекс));
	
КонецФункции // ИсключениеНекорректныйТипБулево()

Функция ИсключениеНекорректныйТипНеопределено(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: არაკორექტული ტიპი განუსაზღვრელი პოზიციაში [Индекс].';ru='JSON: Некорректный тип Неопределено в позиции [Индекс].';en='JSON: Incorrect type Undefined in a position to [Index].'"),
	Новый Структура("Индекс", Индекс));
	
КонецФункции // ИсключениеНекорректныйТипНеопределено()

Функция ИсключениеНекорректныйФорматСтроки(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: არაკორექტული სტრიქონი ფორმატი პოზიციაში [Индекс].';ru='JSON: Некорректный формат строки в позиции [Индекс].';en='JSON: Invalid line in the position format to [Index].'"),
	Новый Структура("Индекс", Индекс));
	
КонецФункции // ИсключениеНекорректныйФорматСтроки()

Функция ИсключениеНекорректныйФорматДаты(Индекс, Значение)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: თარიღის არაკორექტული ფორმატი პოზიციაში [Индекс].';ru='JSON: Некорректный формат даты [Значение] в позиции [Индекс].';en='JSON: Incorrect date format [value] to [Index].'"),
	Новый Структура("Индекс", Индекс, Символ(034) + Значение + Символ(034)));
	
КонецФункции // ИсключениеНекорректныйФорматДаты()

Функция ИсключениеНекорректныйФорматЧисла(Индекс, Значение)
	
	Если ПустаяСтрока(Значение) Тогда
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: არასწორი მონაცემის ტიპი პოზიციაში [Индекс].';ru='JSON: Неверный формат данных в позиции [Индекс].';en='JSON: Invalid data format in a position to [Index].'"),
		Новый Структура("Индекс", Индекс));
		
	Иначе
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: არაკორექტული რიცხვის ფორმატი [Значение] у პოზიციაში [Индекс].';ru='JSON: Некорректный формат числа [Значение] в позиции [Индекс].';en='JSON: Invalid number format [Value] at position [Index].'"),
		Новый Структура("Индекс,Значение", Индекс, Символ(034) + Значение + Символ(034)));
		
	КонецЕсли;
	
КонецФункции // ИсключениеНекорректныйФорматЧисла()

Функция ИсключениеНедопустимыйСимвол(Индекс, Символ)
	
	Если (Символ = Неопределено) Тогда
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: დაუშვებელი სიმბოლო პოზიციაში [Индекс].';ru='JSON: Недопустимый символ в позиции [Индекс].';en='JSON: Invalid character in a position to [Index].'"),
		Новый Структура("Индекс", Индекс));
		
	Иначе
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: დაუშვებელი სიმბოლო პოზიციაში [Индекс], მოსალოდნელია [Символ].';ru='JSON: Недопустимый символ в позиции [Индекс], ожидается [Символ].';en='JSON: Invalid character in a position to [Index], expected [Symbol].'"),
		Новый Структура("Индекс,Символ", Индекс, Символ(034) + Символ + Символ(034)));
		
	КонецЕсли;
	
КонецФункции // ИсключениеНедопустимыйСимвол()

Функция ИсключениеНеопознанныйТип(Индекс, Тип)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: დაუშვებელი ტიპი [Тип] პოზიციაში [Индекс].';ru='JSON: Недопустимый тип [Тип] в позиции [Индекс].';en='JSON: Invalid type [Type] to [Index].'"),
	Новый Структура("Индекс,Тип", Индекс, Символ(034) + Тип + Символ(034)));
	
КонецФункции // ИсключениеНеопознанныйТип()

Функция ИсключениеНевозможноПреобразоватьЗначение(Индекс, Значение)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: შეუძლებელია ტიპის გარდაქმნა [Значение] პოზიციაში [Индекс].';ru='JSON: Невозможно преобразовать значение [Значение] в позиции [Индекс].';en='JSON: Can not convert the value [value] to [Index].'"),
	Новый Структура("Индекс,Значение", Индекс, Символ(034) + Значение + Символ(034)));
	
КонецФункции // ИсключениеНевозможноПреобразоватьЗначение()

Функция ИсключениеНевозможноПреобразоватьЗначениеНаКлиенте(Индекс, Значение)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: შეუძლებელია კლიენტის მხარეს გარდაიქმნას მნიშვნელობა [Значение] პოზიციაში [Индекс].';ru='JSON: Невозможно на клиенте преобразовать значение [Значение] в позиции [Индекс].';en='JSON: Unable to convert the value to the client [value] to [Index].'"),
	Новый Структура("Индекс,Значение", Индекс, Символ(034) + Значение + Символ(034)));
	
КонецФункции // ИсключениеНевозможноПреобразоватьЗначениеНаКлиенте()

Функция ИсключениеНекорректныйПараметр(Параметр)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: პარამეტრის [Параметр] დაუშვებელი ტიპი .';ru='JSON: Недопустимое значение параметра [Параметр].';en='JSON: Invalid parameter [parameter].'"),
	Новый Структура("Параметр", Символ(034) + Параметр + Символ(034)));
	
КонецФункции // ИсключениеНекорректныйПараметр()

Функция ИсключениеНедопустимыйТипКлюча(Индекс, Значение)
	
	Если (Индекс = Неопределено) Тогда
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: გასაღების [Тип] მნიშვნელობის დაუშვებელი ტიპი.';ru='JSON: Недопустимый тип значения ключа [Тип].';en='JSON: Invalid type key values ​​[type].'"),
		Новый Структура("Тип", ТипЗнч(Значение)));
		
	Иначе
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ka='JSON: გასაღების [Тип] მნიშვნელობის დაუშვებელი ტიპი პოზიციაში [Индекс].';ru='JSON: Недопустимый тип значения ключа [Тип] в позиции [Индекс].';en='JSON: Invalid type of key value [Type] to [Index].'"),
		Новый Структура("Индекс,Тип", Индекс, Символ(034) + ТипЗнч(Значение) + Символ(034)));
		
	КонецЕсли;
	
КонецФункции // ИсключениеНедопустимыйТипКлюча()

Функция ИсключениеНевозможноВыполнитьЗапрос(Описание)
	
	Позиция = Найти(Описание, "}: "); Если Позиция Тогда Позиция = Позиция + 3; Иначе Позиция = 1; КонецЕсли;
	Длина = Найти(Описание, Символы.ПС); Если Длина Тогда Длина = Длина - Позиция; Иначе Длина = СтрДлина(Описание); КонецЕсли;
	Возврат НСтр("ru = 'JSON: Невозможно выполнить запрос. '; ka = 'JSON: მოთხოვნის შესრულება შეუძლებელია. '") + Сред(Описание, Позиция, Длина) + ".";
	
КонецФункции // ИсключениеНевозможноВыполнитьЗапрос()

// ─────────────────────────────────────────────────────────────────────────────
//	JSON

Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач ТекстJSON) Экспорт
	
	Результат = Новый Структура;
	
	ТекстJSON = СтрЗаменить(ТекстJSON, "\""", """");	// заменим последовательность \" на "
	ТекстJSON = СтрЗаменить(ТекстJSON, """", "");		// а теперь удалим все кавычки
	
	Если Лев(ТекстJSON, 1) = "{" Тогда
		// начало структуры
		ЗаполнитьДанныеИзОтветаJSON(Результат, ТекстJSON, "Структура");
		
	ИначеЕсли Лев(ТекстJSON, 1) = "[" Тогда
		// начало массива
		МассивДанных = Новый Массив;
		ЗаполнитьДанныеИзОтветаJSON(МассивДанных, ТекстJSON, "Массив");
		
		Результат.Вставить("Значение", МассивДанных);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДанныеИзОтветаJSON(Результат, ТекстJSON, ТипДанных)
	
	ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));	// удалим открывающий символ структуры(массива)
	
	НомерЗначения = 0;
	
	Пока ТекстJSON <> "" Цикл
		
		ПервыйСимвол = Лев(ТекстJSON, 1);
		Если ПервыйСимвол = "{" Тогда
			// вложенная структура
			Значение = Новый Структура;
			ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Структура");
			
			Если ТипДанных = "Структура" Тогда
				Результат.Вставить("Значение" + ?(НомерЗначения = 0, "", НомерЗначения), Значение);
				НомерЗначения = НомерЗначения + 1;
			ИначеЕсли ТипДанных = "Массив" Тогда
				Результат.Добавить(Значение);
			КонецЕсли;
			
		ИначеЕсли ПервыйСимвол = "[" Тогда
			// вложенный массив
			Значение = Новый Массив;
			ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Массив");
			
			Если ТипДанных = "Структура" Тогда
				Результат.Вставить("Значение" + ?(НомерЗначения = 0, "", НомерЗначения), Значение);
				НомерЗначения = НомерЗначения + 1;
			Иначе
				Результат.Добавить(Значение);
			КонецЕсли;
			
		ИначеЕсли ПервыйСимвол = "}" И ТипДанных = "Структура" Тогда
			// структура закончилась
			ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
			Если Лев(ТекстJSON, 1) = "," Тогда
				ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
			КонецЕсли;
			
			Возврат;
			
		ИначеЕсли ПервыйСимвол = "]" И ТипДанных = "Массив" Тогда
			// массив закончился
			ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
			Если Лев(ТекстJSON, 1) = "," Тогда
				ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
			КонецЕсли;
			
			Возврат;
			
		Иначе
			
			Если ТипДанных = "Структура" Тогда
				
				Поз = Найти(ТекстJSON, ":");
				Если Поз = 0 Тогда
					// неверный формат, прервемся
					Прервать;
				КонецЕсли;
				
				ИмяЗначения = СокрЛП(Лев(ТекстJSON, Поз-1));
				
				ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз+1));
				
				Если Лев(ТекстJSON, 1) = "{" Тогда
					// значение является структурой
					Значение = Новый Структура;
					ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Структура");
					
				ИначеЕсли Лев(ТекстJSON, 1) = "[" Тогда
					// значение является массивом
					Значение = Новый Массив;
					ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Массив");
					
				Иначе
					// обычное значение
					Поз = 0;
					Для Сч = 1 По СтрДлина(ТекстJSON) Цикл
						Символ = Сред(ТекстJSON, Сч, 1);
						Если Символ = "," ИЛИ Символ = "]" ИЛИ Символ = "}" Тогда
							Поз = Сч;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если Поз = 0 Тогда
						Значение = ТекстJSON;
						ТекстJSON = "";
						
					Иначе
						Значение = Лев(ТекстJSON, Поз-1);
						ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз + ?(Сред(ТекстJSON, Поз, 1) = ",", 1, 0)));
						
					КонецЕсли;
					
					Значение = СокрЛП(Значение);
					//Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Значение) Тогда
					//	Значение = Число(Значение);
					//КонецЕсли;
					
				КонецЕсли;
				
				Результат.Вставить(ИмяЗначения, Значение);
				
			ИначеЕсли ТипДанных = "Массив" Тогда
				
				// обычное значение
				Поз = 0;
				Для Сч = 1 По СтрДлина(ТекстJSON) Цикл
					Символ = Сред(ТекстJSON, Сч, 1);
					Если Символ = "," ИЛИ Символ = "]" ИЛИ Символ = "}" Тогда
						Поз = Сч;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Поз = 0 Тогда
					Значение = ТекстJSON;
					ТекстJSON = "";
					
				Иначе
					Значение = Лев(ТекстJSON, Поз-1);
					ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз + ?(Сред(ТекстJSON, Поз, 1) = ",", 1, 0)));
					
				КонецЕсли;
				
				Значение = СокрЛП(Значение);
				
				Результат.Добавить(Значение);
				
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры



// ─────────────────────────────────────────────────────────────────────────────
//	MD5

Функция ПолучитьОбъектМД5()
	
	ScrptCtrl = Новый COMОбъект("MSScriptControl.ScriptControl");
	ScrptCtrl.Language = "JScript";
	ScrptCtrl.AddCode("
	|var MD5=function(string){function RotateLeft(lValue,iShiftBits){return(lValue<<iShiftBits)|(lValue>>>(32-iShiftBits));}
	|function AddUnsigned(lX,lY){var lX4,lY4,lX8,lY8,lResult;lX8=(lX&0x80000000);lY8=(lY&0x80000000);lX4=(lX&0x40000000);lY4=(lY&0x40000000);lResult=(lX&0x3FFFFFFF)+(lY&0x3FFFFFFF);if(lX4&lY4){return(lResult^0x80000000^lX8^lY8);}
	|if(lX4|lY4){if(lResult&0x40000000){return(lResult^0xC0000000^lX8^lY8);}else{return(lResult^0x40000000^lX8^lY8);}}else{return(lResult^lX8^lY8);}}
	|function F(x,y,z){return(x&y)|((~x)&z);}
	|function G(x,y,z){return(x&z)|(y&(~z));}
	|function H(x,y,z){return(x^y^z);}
	|function I(x,y,z){return(y^(x|(~z)));}
	|function FF(a,b,c,d,x,s,ac){a=AddUnsigned(a,AddUnsigned(AddUnsigned(F(b,c,d),x),ac));return AddUnsigned(RotateLeft(a,s),b);};function GG(a,b,c,d,x,s,ac){a=AddUnsigned(a,AddUnsigned(AddUnsigned(G(b,c,d),x),ac));return AddUnsigned(RotateLeft(a,s),b);};function HH(a,b,c,d,x,s,ac){a=AddUnsigned(a,AddUnsigned(AddUnsigned(H(b,c,d),x),ac));return AddUnsigned(RotateLeft(a,s),b);};function II(a,b,c,d,x,s,ac){a=AddUnsigned(a,AddUnsigned(AddUnsigned(I(b,c,d),x),ac));return AddUnsigned(RotateLeft(a,s),b);};function ConvertToWordArray(string){var lWordCount;var lMessageLength=string.length;var lNumberOfWords_temp1=lMessageLength+8;var lNumberOfWords_temp2=(lNumberOfWords_temp1-(lNumberOfWords_temp1%64))/64;var lNumberOfWords=(lNumberOfWords_temp2+1)*16;var lWordArray=Array(lNumberOfWords-1);var lBytePosition=0;var lByteCount=0;while(lByteCount<lMessageLength){lWordCount=(lByteCount-(lByteCount%4))/4;lBytePosition=(lByteCount%4)*8;lWordArray[lWordCount]=(lWordArray[lWordCount]|(string.charCodeAt(lByteCount)<<lBytePosition));lByteCount++;}
	|lWordCount=(lByteCount-(lByteCount%4))/4;lBytePosition=(lByteCount%4)*8;lWordArray[lWordCount]=lWordArray[lWordCount]|(0x80<<lBytePosition);lWordArray[lNumberOfWords-2]=lMessageLength<<3;lWordArray[lNumberOfWords-1]=lMessageLength>>>29;return lWordArray;};function WordToHex(lValue){var WordToHexValue="""",WordToHexValue_temp="""",lByte,lCount;for(lCount=0;lCount<=3;lCount++){lByte=(lValue>>>(lCount*8))&255;WordToHexValue_temp=""0""+lByte.toString(16);WordToHexValue=WordToHexValue+WordToHexValue_temp.substr(WordToHexValue_temp.length-2,2);}
	|return WordToHexValue;};function Utf8Encode(string){string=string.replace(/\r\n/g,""\n"");var utftext="""";for(var n=0;n<string.length;n++){var c=string.charCodeAt(n);if(c<128){utftext+=String.fromCharCode(c);}
	|else if((c>127)&&(c<2048)){utftext+=String.fromCharCode((c>>6)|192);utftext+=String.fromCharCode((c&63)|128);}
	|else{utftext+=String.fromCharCode((c>>12)|224);utftext+=String.fromCharCode(((c>>6)&63)|128);utftext+=String.fromCharCode((c&63)|128);}}
	|return utftext;};var x=Array();var k,AA,BB,CC,DD,a,b,c,d;var S11=7,S12=12,S13=17,S14=22;var S21=5,S22=9,S23=14,S24=20;var S31=4,S32=11,S33=16,S34=23;var S41=6,S42=10,S43=15,S44=21;string=Utf8Encode(string);x=ConvertToWordArray(string);a=0x67452301;b=0xEFCDAB89;c=0x98BADCFE;d=0x10325476;for(k=0;k<x.length;k+=16){AA=a;BB=b;CC=c;DD=d;a=FF(a,b,c,d,x[k+0],S11,0xD76AA478);d=FF(d,a,b,c,x[k+1],S12,0xE8C7B756);c=FF(c,d,a,b,x[k+2],S13,0x242070DB);b=FF(b,c,d,a,x[k+3],S14,0xC1BDCEEE);a=FF(a,b,c,d,x[k+4],S11,0xF57C0FAF);d=FF(d,a,b,c,x[k+5],S12,0x4787C62A);c=FF(c,d,a,b,x[k+6],S13,0xA8304613);b=FF(b,c,d,a,x[k+7],S14,0xFD469501);a=FF(a,b,c,d,x[k+8],S11,0x698098D8);d=FF(d,a,b,c,x[k+9],S12,0x8B44F7AF);c=FF(c,d,a,b,x[k+10],S13,0xFFFF5BB1);b=FF(b,c,d,a,x[k+11],S14,0x895CD7BE);a=FF(a,b,c,d,x[k+12],S11,0x6B901122);d=FF(d,a,b,c,x[k+13],S12,0xFD987193);c=FF(c,d,a,b,x[k+14],S13,0xA679438E);b=FF(b,c,d,a,x[k+15],S14,0x49B40821);a=GG(a,b,c,d,x[k+1],S21,0xF61E2562);d=GG(d,a,b,c,x[k+6],S22,0xC040B340);c=GG(c,d,a,b,x[k+11],S23,0x265E5A51);b=GG(b,c,d,a,x[k+0],S24,0xE9B6C7AA);a=GG(a,b,c,d,x[k+5],S21,0xD62F105D);d=GG(d,a,b,c,x[k+10],S22,0x2441453);c=GG(c,d,a,b,x[k+15],S23,0xD8A1E681);b=GG(b,c,d,a,x[k+4],S24,0xE7D3FBC8);a=GG(a,b,c,d,x[k+9],S21,0x21E1CDE6);d=GG(d,a,b,c,x[k+14],S22,0xC33707D6);c=GG(c,d,a,b,x[k+3],S23,0xF4D50D87);b=GG(b,c,d,a,x[k+8],S24,0x455A14ED);a=GG(a,b,c,d,x[k+13],S21,0xA9E3E905);d=GG(d,a,b,c,x[k+2],S22,0xFCEFA3F8);c=GG(c,d,a,b,x[k+7],S23,0x676F02D9);b=GG(b,c,d,a,x[k+12],S24,0x8D2A4C8A);a=HH(a,b,c,d,x[k+5],S31,0xFFFA3942);d=HH(d,a,b,c,x[k+8],S32,0x8771F681);c=HH(c,d,a,b,x[k+11],S33,0x6D9D6122);b=HH(b,c,d,a,x[k+14],S34,0xFDE5380C);a=HH(a,b,c,d,x[k+1],S31,0xA4BEEA44);d=HH(d,a,b,c,x[k+4],S32,0x4BDECFA9);c=HH(c,d,a,b,x[k+7],S33,0xF6BB4B60);b=HH(b,c,d,a,x[k+10],S34,0xBEBFBC70);a=HH(a,b,c,d,x[k+13],S31,0x289B7EC6);d=HH(d,a,b,c,x[k+0],S32,0xEAA127FA);c=HH(c,d,a,b,x[k+3],S33,0xD4EF3085);b=HH(b,c,d,a,x[k+6],S34,0x4881D05);a=HH(a,b,c,d,x[k+9],S31,0xD9D4D039);d=HH(d,a,b,c,x[k+12],S32,0xE6DB99E5);c=HH(c,d,a,b,x[k+15],S33,0x1FA27CF8);b=HH(b,c,d,a,x[k+2],S34,0xC4AC5665);a=II(a,b,c,d,x[k+0],S41,0xF4292244);d=II(d,a,b,c,x[k+7],S42,0x432AFF97);c=II(c,d,a,b,x[k+14],S43,0xAB9423A7);b=II(b,c,d,a,x[k+5],S44,0xFC93A039);a=II(a,b,c,d,x[k+12],S41,0x655B59C3);d=II(d,a,b,c,x[k+3],S42,0x8F0CCC92);c=II(c,d,a,b,x[k+10],S43,0xFFEFF47D);b=II(b,c,d,a,x[k+1],S44,0x85845DD1);a=II(a,b,c,d,x[k+8],S41,0x6FA87E4F);d=II(d,a,b,c,x[k+15],S42,0xFE2CE6E0);c=II(c,d,a,b,x[k+6],S43,0xA3014314);b=II(b,c,d,a,x[k+13],S44,0x4E0811A1);a=II(a,b,c,d,x[k+4],S41,0xF7537E82);d=II(d,a,b,c,x[k+11],S42,0xBD3AF235);c=II(c,d,a,b,x[k+2],S43,0x2AD7D2BB);b=II(b,c,d,a,x[k+9],S44,0xEB86D391);a=AddUnsigned(a,AA);b=AddUnsigned(b,BB);c=AddUnsigned(c,CC);d=AddUnsigned(d,DD);}
	|var temp=WordToHex(a)+WordToHex(b)+WordToHex(c)+WordToHex(d);return temp.toLowerCase();}
	|");
	
	Возврат ScrptCtrl;
	
КонецФункции

Функция MD5(ScrptCtrl, КодируемаяСтрока)
	
	ЗначениеВозврата = Истина;
	Попытка      
		Хэш = "";
		Хэш = ScrptCtrl.Run("MD5", КодируемаяСтрока);
	Исключение
		Хэш = "0";
	КонецПопытки;
	
	Возврат Хэш;
	
КонецФункции // MD5()





Процедура Ожидание(КоличествоСекунд) Экспорт
	
	//ДатаОкончанияОжидания = ТекущаяДата() + КоличествоСекунд;
	
	//Пока ТекущаяДата() <= ДатаОкончанияОжидания Цикл
	//КонецЦикла;
	
КонецПроцедуры

// DO-25848
// kuzmich, 18.01.2016
Функция ОбработатьТекстДляXML(ВходящаяСтрока)
	ПЕРЕМ РЕЗ;
	
	РЕЗ=Строка(ВходящаяСтрока);
	
	ТекДлинаСтроки = СтрДлина(ВходящаяСтрока);
	
	РЕЗ=СтрЗаменить(РЕЗ,"&","&amp;");
	РЕЗ=СтрЗаменить(РЕЗ,"<","&lt;");
	РЕЗ=СтрЗаменить(РЕЗ,">","&gt;");
	РЕЗ=СтрЗаменить(РЕЗ,"'","&apos;");
	РЕЗ=СтрЗаменить(РЕЗ,"""","&quot;");
	
	Возврат РЕЗ;	
КонецФункции
// DO-25848

Функция ПолучитьДанныеДокументовПоИнтернетБанку(МассивДокументов, ДатаСреза) Экспорт
	
	СоответствиеВозврата = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыДокументовВИнтернетБанке.ДокументСсылка,
	|	СтатусыДокументовВИнтернетБанке.СтатусДокументаВИнтернетБанке,
	|	ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") КАК УИД
	|ИЗ
	|	РегистрСведений.СтатусыДокументовВИнтернетБанке.СрезПоследних(, ДокументСсылка В (&МассивДокументов)) КАК СтатусыДокументовВИнтернетБанке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
	|		ПО СтатусыДокументовВИнтернетБанке.ДокументСсылка = УИДДокументовВИнтернетБанке.ДокументСсылка";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	ВыборкаРезультат = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультат.Следующий() Цикл 
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("УИД", ВыборкаРезультат.УИД);
		СтруктураДанных.Вставить("Статус", ВыборкаРезультат.СтатусДокументаВИнтернетБанке);
		Если ВыборкаРезультат.УИД = "" Тогда 
			СтруктураДанных.Вставить("Выгружено", ЛОЖЬ);
		Иначе
			СтруктураДанных.Вставить("Выгружено", Истина);
		КонецЕсли;
		
		СоответствиеВозврата.Вставить(ВыборкаРезультат.ДокументСсылка, СтруктураДанных);
		
	КонецЦикла;
	
	Возврат СоответствиеВозврата;
	
КонецФункции
