#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем ИспользоватьТолькоРегламентированныйПланСчетов Экспорт;
#Область ОбработчикиСобытыий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Перем СтратегияЗаполнения;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		Сотрудник = ДанныеЗаполнения;
		ВидДоговора = Перечисления.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		СтратегияЗаполнения = Новый Соответствие;
		СтратегияЗаполнения[Тип("ДокументСсылка.РасходнаяНакладная")] = "ЗаполнитьПоРасходнойНакладной";
		
	//--------------------------------------------------------------------------
	// © Шишка В.В. [4 декабря 2023]  НАЧАЛО
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя")
			И ДанныеЗаполнения.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд")
			Тогда
		
		СтратегияЗаполнения = Новый Соответствие;
		СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуНаряду";
		
	// © Шишка В.В. [4 декабря 2023]  КОНЕЦ
	//--------------------------------------------------------------------------
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Сотрудник") И 
			ЗначениеЗаполнено(ДанныеЗаполнения.Сотрудник) Тогда
			
			Сотрудник = ДанныеЗаполнения;
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			ВидДоговора = Перечисления.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику;
			
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Контрагент") И
			ЗначениеЗаполнено(ДанныеЗаполнения.Контрагент) Тогда
			
			Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
			Контрагент = ДанныеЗаполнения.Контрагент;
			ВидДоговора = Перечисления.ВидыДоговоровКредитаИЗайма.КредитПолученный;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ВидДоговора = Перечисления.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику Тогда
		Контрагент = Неопределено;
	Иначе
		Сотрудник = Неопределено;
		ПогашатьИзЗаработнойПлаты = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ОбработкаПроведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ДоговорКредитаИЗайма.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьГрафикПогашенияКредитовИЗаймов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоКредитамИЗаймам(ДополнительныеСвойства, Движения, Отказ);
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.ДоговорКредитаИЗайма.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаПроверкиЗаполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())); //+++ Дмгг
	
	Если ВидДоговора = Перечисления.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику Тогда
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Контрагент");
		Если ПроцентнаяСтавкаГодовая = 0 Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаПроцентов");
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаПроцентовРегл");//+++
		КонецЕсли;
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаКомиссии");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаКомиссииРегл");//+++
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ТипКомиссии");
		
	Иначе
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Сотрудник");
		Если ПроцентнаяСтавкаГодовая = 0 Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаПроцентов");
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаПроцентовРегл");//+++
		КонецЕсли;
		Если ТипКомиссии = Перечисления.ТипыКомиссииКредитовИЗаймов.Нет Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаКомиссии");
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаКомиссииРегл");//+++
		КонецЕсли;
		
	КонецЕсли;
	
	//+++ Дмг
	Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
		
		Если СчетУчетаРегл.ТипСчета <> Перечисления.ТипыСчетов.Расходы И
			СчетУчетаКомиссииРегл.ТипСчета <> Перечисления.ТипыСчетов.Расходы И
			СчетУчетаПроцентовРегл.ТипСчета <> Перечисления.ТипыСчетов.Расходы 
			Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтруктурнаяЕдиница");
		КонецЕсли;
		
	Иначе
	//--- Дмгг
		Если СчетУчета.ТипСчета <> Перечисления.ТипыСчетов.Расходы И
			СчетУчетаКомиссии.ТипСчета <> Перечисления.ТипыСчетов.Расходы И
			СчетУчетаПроцентов.ТипСчета <> Перечисления.ТипыСчетов.Расходы 
			Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтруктурнаяЕдиница");
		КонецЕсли;
	КонецЕсли; //+++ Дмгг
	
	//+++ Дмгг
	Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчета");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаПроцентов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаКомиссии");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатрат");    
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.ДоговорКредитаИЗайма.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполнения документа на основании.
//
// Параметры:
//	ДокументОснование - ДокументСсылка.РасходнаяНакладная - Данные заполнения документа.
//	
Процедура ЗаполнитьПоРасходнойНакладной(ДокументОснование) Экспорт
	
	Если ДокументОснование.ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
		ТекстИсключения = НСтр("ka='დოკუმენტის შეყვანა ოპერაციის საფუძველზე შეუძლებელია - ""%ВидОперации""!';ru='Невозможен ввод документа на основании операции - ""%ВидОперации""!';en='You can not enter a document on the basis of the operation - ""% VidOperatsii""!'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ВидОперации", ДокументОснование.ВидОперации);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.КредитВыданный) КАК ВидДоговора,
	|	&Ссылка КАК ДокументОснование,
	|	ДокументРасходнаяНакладная.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(&Ссылка) КАК Основание,
	|	ДокументРасходнаяНакладная.Контрагент КАК Контрагент,
	|	ДокументРасходнаяНакладная.ВалютаДокумента КАК ВалютаРасчетов,
	|	&Ссылка КАК ДокументРеализации,
	|	&Дата КАК ДатаПредоставления
	|ИЗ
	|	Документ.РасходнаяНакладная КАК ДокументРасходнаяНакладная
	|ГДЕ
	|	ДокументРасходнаяНакладная.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЕсли;
	
	ЗаполнитьСуммуОстаткомЗадолженности();
	
КонецПроцедуры

//--------------------------------------------------------------------------
// © Шишка В.В. [4 декабря 2023]  НАЧАЛО
// Процедура заполнения документа на основании.
//
// Параметры:
//	ДокументОснование - ДокументСсылка.ЗаказПокупателя - Данные заполнения документа.
//	
Процедура ЗаполнитьПоЗаказуНаряду(ДокументОснование) Экспорт
	
	Если ДокументОснование.ВидОперации <> Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		ТекстИсключения = НСтр("ka='დოკუმენტის შეყვანა ოპერაციის საფუძველზე შეუძლებელია - ""%ВидОперации""!';ru='Невозможен ввод документа на основании операции - ""%ВидОперации""!';en='You can not enter a document on the basis of the operation - ""%ВидОперации""!'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ВидОперации", ДокументОснование.ВидОперации);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Если ДокументОснование.СостояниеЗаказа <> Справочники.СостоянияЗаказНарядов.Завершен Тогда
		ТекстИсключения = НСтр("ka='დოკუმენტის შეყვანა ოპერაციის საფუძველზე შეუძლებელია - ""%Состояние""!';ru='Невозможен ввод документа в состоянии - ""%Состояние""!';en='You can not enter a document on the basis of the status - ""%Состояние""!'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%Состояние", ДокументОснование.СостояниеЗаказа);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
//ДокументОснование.СостояниеЗаказа	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.КредитВыданный) КАК ВидДоговора,
	|	&Ссылка КАК ДокументОснование,
	|	ДокументЗаказНаряд.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(&Ссылка) КАК Основание,
	|	ДокументЗаказНаряд.Контрагент КАК Контрагент,
	|	ДокументЗаказНаряд.ВалютаДокумента КАК ВалютаРасчетов,
	|	&Ссылка КАК ДокументРеализации,
	|	&Дата КАК ДатаПредоставления
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДокументЗаказНаряд
	|ГДЕ
	|	ДокументЗаказНаряд.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЕсли;
	
	ЗаполнитьСуммуОстаткомЗадолженности();
	
КонецПроцедуры
	
// © Шишка В.В. [4 декабря 2023]  КОНЕЦ
//--------------------------------------------------------------------------

Процедура ЗаполнитьСуммуОстаткомЗадолженности()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0)) КАК СуммаЗадолженности
	|ИЗ
	|	РегистрНакопления.РасчетыСПокупателями.Остатки(
	|			&Дата,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И &УсловиеПоДоговору
	|				И &УсловиеПоДокументу) КАК РасчетыСПокупателямиОстатки";
	
	ПараметрыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДокументРеализации,
		"Договор, Контрагент.ВестиРасчетыПоДоговорам, Контрагент.ВестиРасчетыПоДокументам");
	
	Если ПараметрыСделки.КонтрагентВестиРасчетыПоДоговорам Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДоговору", "Договор = &Договор");
		Запрос.УстановитьПараметр("Договор", ПараметрыСделки.Договор);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДоговору", "ИСТИНА");
	КонецЕсли;
	
	Если ПараметрыСделки.КонтрагентВестиРасчетыПоДокументам Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДокументу", "Документ = &Документ");
		Запрос.УстановитьПараметр("Документ", ДокументРеализации);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДокументу", "ИСТИНА");
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СуммаДокумента = Выборка.СуммаЗадолженности;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())); //+++ Дмгг
#КонецЕсли