#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	Возврат;	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗапасыВВалюте.НомерСтроки КАК НомерСтроки,
	|	ЗапасыВВалюте.Организация КАК Организация,
	|	ЗапасыВВалюте.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыВВалюте.СчетУчета КАК СчетУчета,
	|	ЗапасыВВалюте.СчетУчетаРегл КАК СчетУчетаРегл,//+++ Дмгг
	|	ЗапасыВВалюте.Номенклатура КАК Номенклатура,
	|	ЗапасыВВалюте.Характеристика КАК Характеристика,
	|	ЗапасыВВалюте.Партия КАК Партия,
	|	ЗапасыВВалюте.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗапасыВВалюте.Количество КАК КоличествоПередЗаписью,
	|	ЗапасыВВалюте.Количество КАК КоличествоИзменение,
	|	ЗапасыВВалюте.Количество КАК КоличествоПриЗаписи,
	|	ЗапасыВВалюте.СуммаВал КАК СуммаПередЗаписью,
	|	ЗапасыВВалюте.СуммаВал КАК СуммаИзменение,
	|	ЗапасыВВалюте.СуммаВал КАК СуммаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияЗапасыВалИзменение
	|ИЗ
	|	РегистрНакопления.ЗапасыВВалюте КАК Запасы");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияЗапасыВалИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#КонецОбласти

#КонецЕсли