
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем МассивДокументов;
	
	Если Параметры.Свойство("МассивДокументов",МассивДокументов) Тогда
		СписокДокументов.ЗагрузитьЗначения(МассивДокументов);
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Результат.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяЗапасы.Ссылка КАК Документ,
		|	ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента,
		|	ПриходнаяНакладнаяЗапасы.Номенклатура,
		|	ЕСТЬNULL(ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
		|	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения,
		|	ПриходнаяНакладнаяЗапасы.Характеристика,
		|	ПриходнаяНакладнаяЗапасы.СтавкаНДС,
		|	ПриходнаяНакладнаяЗапасы.Ссылка.НДСВключатьВСтоимость КАК СуммаВключаетНДС,
		|	ВЫБОР
		|		КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.НДСВключатьВСтоимость
		|			ТОГДА ПриходнаяНакладнаяЗапасы.Сумма
		|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Сумма + ПриходнаяНакладнаяЗапасы.СуммаНДС
		|	КОНЕЦ КАК СуммаСНДС,
		|	ПриходнаяНакладнаяЗапасы.Количество
		|ИЗ
		|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		|ГДЕ
		|	ПриходнаяНакладнаяЗапасы.Ссылка В(&СписокДокументов)";
	
	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_Данных = РезультатЗапроса.Выгрузить();
	ТЗ_Данных.Колонки.Добавить("ЦенаРеализации",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2,ДопустимыйЗнак.Неотрицательный)));
	ТЗ_Данных.Колонки.Добавить("СуммаРеализации",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2,ДопустимыйЗнак.Любой)));
	ТЗ_Данных.Колонки.Добавить("Прибыль",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2,ДопустимыйЗнак.Любой)));
	ТЗ_Данных.Колонки.Добавить("Маржа",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,2,ДопустимыйЗнак.Любой)));
	
	Для каждого СтрТЗ_Данных Из ТЗ_Данных Цикл
		СтрТЗ_Данных.ЦенаРеализации = УправлениеНебольшойФирмойСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(Новый Структура("ВидЦен,ДатаОбработки,Номенклатура,Характеристика,Коэффициент,ВалютаДокумента,СуммаВключаетНДС,СтавкаНДС",ВидЦен,ТекущаяДата,СтрТЗ_Данных.Номенклатура,СтрТЗ_Данных.Характеристика,СтрТЗ_Данных.Коэффициент,СтрТЗ_Данных.ВалютаДокумента,СтрТЗ_Данных.СуммаВключаетНДС,СтрТЗ_Данных.СтавкаНДС));
		СтрТЗ_Данных.СуммаРеализации = СтрТЗ_Данных.ЦенаРеализации * СтрТЗ_Данных.Количество;
		СтрТЗ_Данных.Прибыль = СтрТЗ_Данных.СуммаРеализации - СтрТЗ_Данных.СуммаСНДС;
		СтрТЗ_Данных.Маржа = СтрТЗ_Данных.Прибыль * 100 / СтрТЗ_Данных.СуммаСНДС;
	КонецЦикла;
	
	НаборыДанных = Новый Структура("ТЗ_Данных", ТЗ_Данных);
	
	СхемаСКД = Документы.ПриходнаяНакладная.ПолучитьМакет("ИнформацияОПрибыли");
	Настройки = СхемаСКД.НастройкиПоУмолчанию;
	КомпоновщикНастроекДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаСКД));
	КомпоновщикНастроекДанных.ЗагрузитьНастройки(СхемаСКД.НастройкиПоУмолчанию);
	//
	//Параметр = КомпоновщикНастроекДанных.Настройки.ПараметрыДанных.Элементы.Найти("ТекущаяДата");
	//Параметр.Использование = Истина;
	//Параметр.Значение = ТекущаяДата;
	//
	//Параметр = КомпоновщикНастроекДанных.Настройки.ПараметрыДанных.Элементы.Найти("СписокДокументов");
	//Параметр.Использование = Истина;
	//Параметр.Значение = СписокДокументов;
	//
	//Параметр = КомпоновщикНастроекДанных.Настройки.ПараметрыДанных.Элементы.Найти("ВидЦен");
	//Параметр.Использование = Истина;
	//Параметр.Значение = ВидЦен;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СхемаСКД, КомпоновщикНастроекДанных.ПолучитьНастройки());
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,НаборыДанных);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
КонецПроцедуры