#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл	
		Запись.ПредставлениеИсточника = ОбщегоНазначения.ПредметСтрокой(Запись.Источник);
		Запись.ВремяСобытия = ТекущаяДата();
		Если Не ЗначениеЗаполнено(Запись.Автор2) Тогда
			Запись.Автор2 = Запись.Отправитель;
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли