
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Перем ДополнительныеПараметры;
	
    Если Параметры.Свойство("ДополнительныеПараметры", ДополнительныеПараметры) Тогда
            
        // Выключим стандартную обработку
        СтандартнаяОбработка = Ложь;
        
        ДанныеВыбора    =    ПолучитьДанныеВыбораАдресс(ДополнительныеПараметры.Адрес);
            
	КонецЕсли;
																					
КонецПроцедуры

Функция ПолучитьДанныеВыбораАдресс(Адрес)

	спВыбора    =    Новый СписокЗначений;
    
    // Подготовим шаблоны поиска по вхождению
    Если НЕ ЗначениеЗаполнено(СокрЛП(Адрес)) Тогда
        Возврат Неопределено;    
    Иначе
        Адрес    =  "%" + СокрЛП(Адрес) + "%";
    КонецЕсли;
    
    // Сформируем запрос в котором достаточно данных для наглядного представления адреса
    Запрос    =    Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	Адреса.Ссылка,
		|	Адреса.Наименование,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Адреса.Ссылка) КАК ПредставлениеАдреса
		|ИЗ
		|	Справочник.Адреса КАК Адреса
		|ГДЕ
		|	Адреса.Наименование ПОДОБНО &Наименование";
	
    Запрос.УстановитьПараметр("Наименование", Адрес);
    
    Выборка    =    Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        
        ПредставлениеАдреса    =    Выборка.Наименование;
		//ПредставлениеКонтрагента    =    ПредставлениеКонтрагента + "(" + Выборка.КонтрагентКод +":" + Выборка.КонтрагентПредставление + ")";
        
        спВыбора.Добавить(Выборка.Ссылка, 
                                ПредставлениеАдреса);    
    
    КонецЦикла; 
    
    Возврат спВыбора;	

КонецФункции // ПолучитьДанныеВыбораАдресс(ДополнительныеПараметры.Адрес)()
