
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
		//+++ Дмгг
		ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()); //+++ Дмгг
	Иначе
		ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ДатаДокумента);
		//--- Дмгг
	КонецЕсли;
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	
	Элементы.Ячейка.Видимость = НЕ Объект.СтруктурнаяЕдиница.ОрдерныйСклад;
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновноеПодразделение");
	ОсновноеПодразделение = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаВажныеКоманды);
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновлениеСостоянийВнеоборотныхАктивов");
	
КонецПроцедуры // ПослеЗаписи()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
Процедура ДатаПриИзменении(Элемент)
	
	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли; 
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Объект.Дата); //+++ Дмгг
	
КонецПроцедуры // ДатаПриИзменении()

&НаКлиенте
// В процедуре осуществляется очистка номера документа,
// а также производится установка параметров функциональных опций формы.
// Переопределяет соответствующий параметр формы.
//
Процедура ОрганизацияПриИзменении(Элемент)
	
	// Обработка события изменения организации.
	Объект.Номер = "";
	СтруктураДанные = ПолучитьДанныеОрганизацияПриИзменении(Объект.Организация);
	Компания = СтруктураДанные.Компания;
	
КонецПроцедуры // ОрганизацияПриИзменении()

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура",Объект.Номенклатура);
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	Объект.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	
	ПолучитьСебестоймость();
	
КонецПроцедуры // НоменклатураПриИзменении()

Процедура ПолучитьСебестоймость()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапасыОстатки.КоличествоОстаток,
	               |	ЗапасыОстатки.СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.Запасы.Остатки(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |				И Номенклатура = &Номенклатура
	               |				И Характеристика = &Характеристика) КАК ЗапасыОстатки
	               |ГДЕ
	               |	ЗапасыОстатки.КоличествоОстаток <> 0";
	
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Номенклатура",Объект.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",Объект.Характеристика);
	Запрос.УстановитьПараметр("Дата",?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.Сумма = (Выборка.СуммаОстаток / Выборка.КоличествоОстаток) * Объект.Количество;
	Иначе
		Объект.Сумма = 0;
	КонецЕсли;
	
	УстановитьНачальнуюСтоймость();
	
КонецПроцедуры

Процедура УстановитьНачальнуюСтоймость()
	
	Если Объект.ВнеоборотныеАктивы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СуммаНач = Окр(Объект.Сумма / Объект.ВнеоборотныеАктивы.Количество(), 2);
	СуммаОкругления = СуммаНач * Объект.ВнеоборотныеАктивы.Количество();
	РазницаОкруления = Объект.Сумма - СуммаОкругления;
	
	Для Каждого Стр Из Объект.ВнеоборотныеАктивы Цикл 
		Стр.НачальнаяСтоимость = СуммаНач;
	КонецЦикла;	
	
	Стр.НачальнаяСтоимость = Стр.НачальнаяСтоимость + РазницаОкруления;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	УстановитьВидимостьЯчейки("Ячейка", Объект.СтруктурнаяЕдиница);
	ПолучитьСебестоймость();
	
КонецПроцедуры // СтруктурнаяЕдиницаПриИзменении()

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВнеоборотныеАктивы

&НаКлиенте
Процедура ВнеоборотныеАктивыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
 
		СтрокаТабличнойЧасти = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ОсновноеПодразделение;
		
	КонецЕсли;
	
КонецПроцедуры // ВнеоборотныеАктивыПриНачалеРедактирования()

&НаКлиенте
Процедура ВнеоборотныеАктивыОбъемПродукцииРаботДляВычисленияАмортизацииПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	СтруктураДанные = ПолучитьДанныеВнеоборотныйАктив(СтрокаТабличнойЧасти.ВнеоборотныйАктив);
	
	Если НЕ СтруктураДанные.СпособАмортизацииПропорциональноОбъемуПродукции Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ka='""პროდუქციის (სამუშაოების) მოცულობა ამორტიზაციის გამოსათვლელად"" არ შეიძლება შევსებული იქნას ამორტიზაციის დარიცხვის მითითებული მეთოდისთვის!';ru='""Объем продукции (работ) для исчисления амортизации"" не может быть заполнен для указанного способа начисления амортизации!';en='""The volume of goods (works) for the calculation of depreciation"" can not be completed for the method of calculating depreciation!'"));
		СтрокаТабличнойЧасти.ОбъемПродукцииРаботДляВычисленияАмортизации = 0;
	КонецЕсли;
	
КонецПроцедуры // ВнеоборотныеАктивыОбъемПродукцииРаботДляВычисленияАмортизацииПриИзменении()

&НаКлиенте
Процедура ВнеоборотныеАктивыСрокИспользованияДляВычисленияАмортизацииПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	СтруктураДанные = ПолучитьДанныеВнеоборотныйАктив(СтрокаТабличнойЧасти.ВнеоборотныйАктив);
	
	Если СтруктураДанные.СпособАмортизацииПропорциональноОбъемуПродукции Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ka='""ამორტიზაციის გამოსათვლელად გამოყენების ვადა"" არ შეიძლება შევსებული იქნას ამორტიზაციის დარიცხვის მითითებული მეთოდისთვის!';ru='""Срок использования для вычисления амортизации"" не может быть заполнен для указанного способа начисления амортизации!';en='""The term of use for the calculation of depreciation"" can not be completed for the method of calculating depreciation!'"));
		СтрокаТабличнойЧасти.СрокИспользованияДляВычисленияАмортизации = 0;
	КонецЕсли;
	
КонецПроцедуры // ВнеоборотныеАктивыСрокИспользованияДляВычисленияАмортизацииПриИзменении()

&НаКлиенте
Процедура ВнеоборотныеАктивыВнеоборотныйАктивПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	СтруктураДанные = ПолучитьДанныеВнеоборотныйАктив(СтрокаТабличнойЧасти.ВнеоборотныйАктив);
	
	Если СтруктураДанные.СпособАмортизацииПропорциональноОбъемуПродукции Тогда
		
		СтрокаТабличнойЧасти.СрокИспользованияДляВычисленияАмортизации 			= 0;
		СтрокаТабличнойЧасти.ГодовойПроцентАмортизацииДляУменьшенногоОстатка 	= 0;
		СтрокаТабличнойЧасти.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка 		= 0;
		
	ИначеЕсли СтруктураДанные.СпособАмортизацииЛинейный Тогда
		
		СтрокаТабличнойЧасти.ОбъемПродукцииРаботДляВычисленияАмортизации 		= 0;
		СтрокаТабличнойЧасти.ГодовойПроцентАмортизацииДляУменьшенногоОстатка 	= 0;
		СтрокаТабличнойЧасти.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка 		= 0;
		СтрокаТабличнойЧасти.НачальнаяСтоимость 								= СтруктураДанные.НачальнаяСтоимость;
		
	ИначеЕсли СтруктураДанные.СпособАмортизацииУменьшенногоОстатка Тогда
		
		СтрокаТабличнойЧасти.ОбъемПродукцииРаботДляВычисленияАмортизации 		= 0;
		СтрокаТабличнойЧасти.ГодовойПроцентАмортизацииДляУменьшенногоОстатка 	= СтруктураДанные.ГодовойПроцентАмортизацииДляУменьшенногоОстатка;
		СтрокаТабличнойЧасти.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка 		= СтруктураДанные.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка;
		СтрокаТабличнойЧасти.НачальнаяСтоимость							 		= СтруктураДанные.НачальнаяСтоимостьДляУменьшенногоОстатка;
		
	КонецЕсли;
	
КонецПроцедуры // ВнеоборотныеАктивыВнеоборотныйАктивПриИзменении()

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЯчейки(ИмяЯчейки, Склад)
	
	Элементы[ИмяЯчейки].Видимость = НЕ Склад.ОрдерныйСклад;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	РазностьДат = УправлениеНебольшойФирмойСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить(
		"РазностьДат",
		РазностьДат
	);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеОрганизацияПриИзменении(Организация)
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить(
		"Компания",
		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация)		
	);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеОрганизацияПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);		
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеВнеоборотныйАктив(ВнеоборотныйАктив)
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить("СпособАмортизацииПропорциональноОбъемуПродукции"	, ВнеоборотныйАктив.СпособАмортизации = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.ПропорциональноОбъемуПродукции);
	СтруктураДанные.Вставить("СпособАмортизацииЛинейный"						, ВнеоборотныйАктив.СпособАмортизации = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.Линейный);
	СтруктураДанные.Вставить("СпособАмортизацииУменьшенногоОстатка"				, ВнеоборотныйАктив.СпособАмортизации = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка);
	СтруктураДанные.Вставить("ГодовойПроцентАмортизацииДляУменьшенногоОстатка"	, ВнеоборотныйАктив.ГодовойПроцентАмортизацииДляУменьшенногоОстатка);
	СтруктураДанные.Вставить("ЛиквидационнаяСтоимостьДляУменьшенногоОстатка"	, ВнеоборотныйАктив.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка);
	СтруктураДанные.Вставить("НачальнаяСтоимостьДляУменьшенногоОстатка"			, ВнеоборотныйАктив.НачальнаяСтоимостьДляУменьшенногоОстатка);
	СтруктураДанные.Вставить("НачальнаяСтоимость"								, ВнеоборотныйАктив.НачальнаяСтоимость);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеВнеоборотныйАктив()

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыСчетЗатратРеглПриИзменении(Элемент)
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(ТекСтрока.СчетЗатратРегл, ТекСтрока.СчетЗатрат);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	ПолучитьСебестоймость();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	ПолучитьСебестоймость();
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыПриИзменении(Элемент)
	УстановитьНачальнуюСтоймость();
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

//+++ Дмгг
&НаКлиенте
Функция ПолучитьДанныеВыбораПоАдресу(Элемент, Адрес, СтандартнаяОбработка)

    // Выключим стандартную обработку
    СтандартнаяОбработка    =    Ложь;
    
    // Определим структуру для получения параметров отбора, 
    // так как стандартный выбор мы выключим значения структуры пусты                                                            
    ПараметрыПодбора    =    Новый Структура("Отбор,СтрокаПоиска,ВыборГруппИЭлементов",
                                Новый Структура(), // Здесь можно установить отбор
                                "",                // Передаем введенный в поле текст
                                ПредопределенноеЗначение("ИспользованиеГруппИЭлементов.Элементы"));
                                
    // Дополним стандартную структуру с дополнительными параметрами для поиска по адресу
    ПараметрыПодбора.Вставить("ДополнительныеПараметры", Новый Структура("Адрес", Адрес));
    
    
    // Передаем адрес и получаем список выбора
    Возврат    ПолучитьДанныеВыбора(Тип("СправочникСсылка.Адреса"), ПараметрыПодбора);

КонецФункции

&НаКлиенте
Процедура ВнеоборотныеАктивыАдрессАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;

    знТекст    =    ?(ПустаяСтрока(Текст), ТекСтрока.Адрес, Текст);
    ДанныеВыбора    =    ПолучитьДанныеВыбораПоАдресу(Элемент, знТекст, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыАдрессОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	
	ТекСтрока.Адрес    =    ВыбранноеЗначение;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыАдрессНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	
	П = Новый Структура;
    П.Вставить("Ключ", ТекСтрока.Адрес);

   ОткрытьФорму("Справочник.Адреса.ФормаВыбора", П, ЭтаФорма,,,,Новый ОписаниеОповещения("РедактироватьАдресаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
   
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьАдресаЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	Если ЗначениеЗаполнено(Результат) Тогда 
		ТекСтрока.Адрес = Результат;
	КонецЕсли;

КонецПроцедуры
//--- Дмгг

#КонецОбласти