Процедура ЗаполнитьХозяйственнуюОперациюВНабореЗаписей(НаборЗаписей) Экспорт
	
	Регистратор = НаборЗаписей.Отбор.Регистратор.Значение;
	РегистраторМетаданные = Регистратор.Метаданные();
	Если РегистраторМетаданные.Реквизиты.Найти("ХозяйственнаяОперация") <> Неопределено Тогда
		Для Каждого Движение Из НаборЗаписей Цикл
			//+++ Дмгг
			Если НЕ ЗначениеЗаполнено(Движение.ХозяйственнаяОперация) Тогда 
				Движение.ХозяйственнаяОперация = Регистратор.ХозяйственнаяОперация;
			КонецЕсли;
			//--- Дмгг
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры