#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НачатьЗамерВремени()
	
	Возврат ?(ВыполнятьЗамерыПроизводительности, ОценкаПроизводительности.НачатьЗамерВремени(), Неопределено);
	
КонецФункции

&НаСервере
Процедура ЗакончитьЗамерВремени(НачалоЗамера, ИмяКлючевойОперации, Комментарий = "");

	Если ВыполнятьЗамерыПроизводительности Тогда
		
		ОценкаПроизводительности.ЗакончитьЗамерВремени(ИмяКлючевойОперации, НачалоЗамера, , Комментарий);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет табличную часть "Сотрудники" с отбором по подразделению.
//
Процедура ЗаполнитьПоПодразделению()
	Перем НачалоЗамераПодразделение, НачалоЗамераПараметр;
	
	НачалоЗамераПодразделение = НачатьЗамерВремени();
	
	Объект.НачисленияУдержания.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.Параметры.Вставить("НачалоМесяца", 		Объект.ПериодРегистрации);
	Запрос.Параметры.Вставить("ОкончаниеМесяца",	КонецМесяца(Объект.ПериодРегистрации));
	Запрос.Параметры.Вставить("Организация", 		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация));
	Запрос.Параметры.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.Параметры.Вставить("Валюта", 			Объект.ВалютаДокумента);
	Запрос.Параметры.Вставить("ВидНачисленияОтбор",	Объект.ВидНачисленияОтбор);
		
	// 1. Определяем интересующих сотрудников	
	// 2. Определяем все движения интересующих сотрудников и начисления в нужном подразделении.
	Запрос.Текст = 
	"//////////////////////////////////////////////////////////////////////////////// 0
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ СотрудникиПодразделения
	|ИЗ
	|	(ВЫБРАТЬ
	|		СотрудникиСрезПоследних.Сотрудник КАК Сотрудник
	|	ИЗ
	|		РегистрСведений.Сотрудники.СрезПоследних(&НачалоМесяца, Организация = &Организация) КАК СотрудникиСрезПоследних
	|	ГДЕ
	|		СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Сотрудники.Сотрудник
	|	ИЗ
	|		РегистрСведений.Сотрудники КАК Сотрудники
	|	ГДЕ
	|		Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		И Сотрудники.Период МЕЖДУ &НачалоМесяца И &ОкончаниеМесяца
	|		И Сотрудники.Организация = &Организация) КАК ВложенныйЗапрос
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 1
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.Должность КАК Должность,
	|	ПлановыеНачисленияИУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ПлановыеНачисленияИУдержания.Сумма КАК Сумма,
	|	ПлановыеНачисленияИУдержания.СчетЗатрат КАК СчетЗатрат,
	|	ПлановыеНачисленияИУдержания.Актуальность КАК Актуальность,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ВидУдержанияПФ,
	|	ВложенныйЗапрос.ДрПодрУвольнение КАК ДрПодрУвольнение
	|ПОМЕСТИТЬ ДвиженияСотрудники
	|ИЗ
	|	(ВЫБРАТЬ
	|		СотрудникиПодразделения.Сотрудник КАК Сотрудник,
	|		Сотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		Сотрудники.Должность КАК Должность,
	|		МАКСИМУМ(ПлановыеНачисленияИУдержания.Период) КАК ПериодНачисления,
	|		Сотрудники.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК ДрПодрУвольнение,
	|		ПлановыеНачисленияИУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|		Сотрудники.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|		ПлановыеНачисленияИУдержания.Валюта КАК Валюта
	|	ИЗ
	|		СотрудникиПодразделения КАК СотрудникиПодразделения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК Сотрудники
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания КАК ПлановыеНачисленияИУдержания
	|				ПО Сотрудники.Организация = ПлановыеНачисленияИУдержания.Организация
	|					И Сотрудники.Сотрудник = ПлановыеНачисленияИУдержания.Сотрудник
	|					И Сотрудники.Период >= ПлановыеНачисленияИУдержания.Период
	|					И (Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
	|					И (ПлановыеНачисленияИУдержания.Валюта = &Валюта)
	|					И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата))
	|					И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент))
	|					И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ФиксированнаяСумма))
	|			ПО СотрудникиПодразделения.Сотрудник = Сотрудники.Сотрудник
	|	ГДЕ
	|		Сотрудники.Организация = &Организация
	|		И Сотрудники.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&НачалоМесяца, ДЕНЬ, 1) И &ОкончаниеМесяца
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Сотрудники.СтруктурнаяЕдиница,
	|		СотрудникиПодразделения.Сотрудник,
	|		Сотрудники.Должность,
	|		Сотрудники.Период,
	|		ПлановыеНачисленияИУдержания.ВидНачисленияУдержания,
	|		ПлановыеНачисленияИУдержания.Валюта,
	|		Сотрудники.ВидУдержанияПФ,
	|		ВЫБОР
	|			КОГДА Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания КАК ПлановыеНачисленияИУдержания
	|		ПО ВложенныйЗапрос.Сотрудник = ПлановыеНачисленияИУдержания.Сотрудник
	|			И (ПлановыеНачисленияИУдержания.Валюта = &Валюта)
	|			И (ПлановыеНачисленияИУдержания.Организация = &Организация)
	|			И ВложенныйЗапрос.ПериодНачисления = ПлановыеНачисленияИУдержания.Период
	|			И ВложенныйЗапрос.ВидНачисленияУдержания = ПлановыеНачисленияИУдержания.ВидНачисленияУдержания
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 2
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ВидНачисленияУдержания,
	|	ВложенныйЗапрос.Сумма,
	|	ВложенныйЗапрос.СчетЗатрат,
	|	ВложенныйЗапрос.Актуальность,
	|	Сотрудники.СтруктурнаяЕдиница,
	|	Сотрудники.ВидУдержанияПФ,
	|	Сотрудники.Должность
	|ПОМЕСТИТЬ ДвиженияПлановыеНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПлановыеНачисленияИУдержания.Сотрудник КАК Сотрудник,
	|		ПлановыеНачисленияИУдержания.Период КАК Период,
	|		ПлановыеНачисленияИУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|		ПлановыеНачисленияИУдержания.Сумма КАК Сумма,
	|		ВЫБОР
	|			КОГДА ПлановыеНачисленияИУдержания.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|				ТОГДА ПлановыеНачисленияИУдержания.ВидНачисленияУдержания.СчетЗатрат
	|			ИНАЧЕ ПлановыеНачисленияИУдержания.СчетЗатрат
	|		КОНЕЦ КАК СчетЗатрат,
	|		ПлановыеНачисленияИУдержания.Актуальность КАК Актуальность,
	|		МАКСИМУМ(Сотрудники.Период) КАК ПериодСотрудники
	|	ИЗ
	|		СотрудникиПодразделения КАК СотрудникиПодразделения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания КАК ПлановыеНачисленияИУдержания
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК Сотрудники
	|				ПО ПлановыеНачисленияИУдержания.Сотрудник = Сотрудники.Сотрудник
	|					И ПлановыеНачисленияИУдержания.Период >= Сотрудники.Период
	|					И (Сотрудники.Организация = &Организация)
	|			ПО СотрудникиПодразделения.Сотрудник = ПлановыеНачисленияИУдержания.Сотрудник
	|				И (ПлановыеНачисленияИУдержания.Валюта = &Валюта)
	|				И (ПлановыеНачисленияИУдержания.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&НачалоМесяца, ДЕНЬ, 1) И &ОкончаниеМесяца)
	|				И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата))
	|				И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент))
	|				И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ФиксированнаяСумма))
	|				И (ПлановыеНачисленияИУдержания.Организация = &Организация
	|)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПлановыеНачисленияИУдержания.Актуальность,
	|		ВЫБОР
	|			КОГДА ПлановыеНачисленияИУдержания.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|				ТОГДА ПлановыеНачисленияИУдержания.ВидНачисленияУдержания.СчетЗатрат
	|			ИНАЧЕ ПлановыеНачисленияИУдержания.СчетЗатрат
	|		КОНЕЦ,
	|		ПлановыеНачисленияИУдержания.Период,
	|		ПлановыеНачисленияИУдержания.ВидНачисленияУдержания,
	|		ПлановыеНачисленияИУдержания.Сотрудник,
	|		ПлановыеНачисленияИУдержания.Сумма) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК Сотрудники
	|		ПО ВложенныйЗапрос.ПериодСотрудники = Сотрудники.Период
	|			И (Сотрудники.Организация = &Организация)
	|			И ВложенныйЗапрос.Сотрудник = Сотрудники.Сотрудник
	|ГДЕ
	|	Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 3
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.Должность КАК Должность,
	|	ВложенныйЗапрос.ДатаДействияНачало КАК ДатаДействияНачало,
	|	ВложенныйЗапрос.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ВложенныйЗапрос.Размер КАК Размер,
	|	ВложенныйЗапрос.СчетЗатрат КАК СчетЗатрат,
	|	ВложенныйЗапрос.Актуальность,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ДругоеПодрУвольнение,
	|	ВложенныйЗапрос.ВидУдержанияПФ,
	//Паганини#Удержания_
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|				ИЛИ ВложенныйЗапрос.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.УдержаниеДляКонтрагента)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтаУдержание,
	|	ВложенныйЗапрос.ВидНачисленияУдержания.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	ЕСТЬNULL(ВложенныйЗапрос.ВидНачисленияУдержания.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0) КАК СтавкаНДФЛ,
	|	ВложенныйЗапрос.ВидНачисленияУдержания.ВидУдержанияПФ КАК ВидУдержанияПФ_,
	|	ЕСТЬNULL(ВложенныйЗапрос.ВидНачисленияУдержания.ВидУдержанияПФ.СтавкаПФ, 0) КАК СтавкаПФ,
	//_Паганини#Удержания
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоНалог
	|ИЗ
	|	(ВЫБРАТЬ
	|		СотрудникиПодразделения.Сотрудник КАК Сотрудник,
	|		СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		СотрудникиСрезПоследних.Должность КАК Должность,
	|		&НачалоМесяца КАК ДатаДействияНачало,
	|		ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|		ПлановыеНачисленияИУдержанияСрезПоследних.Сумма КАК Размер,
	|		ВЫБОР
	|			КОГДА ПлановыеНачисленияИУдержанияСрезПоследних.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|				ТОГДА ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания.СчетЗатрат
	|			ИНАЧЕ ПлановыеНачисленияИУдержанияСрезПоследних.СчетЗатрат
	|		КОНЕЦ КАК СчетЗатрат,
	|		СотрудникиСрезПоследних.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|		ИСТИНА КАК Актуальность
	|	ИЗ
	|		СотрудникиПодразделения КАК СотрудникиПодразделения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(&НачалоМесяца, Организация = &Организация) КАК СотрудникиСрезПоследних
	|			ПО СотрудникиПодразделения.Сотрудник = СотрудникиСрезПоследних.Сотрудник
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(
	|					&НачалоМесяца,
	|					Организация = &Организация
	|						И Валюта = &Валюта) КАК ПлановыеНачисленияИУдержанияСрезПоследних
	|			ПО СотрудникиПодразделения.Сотрудник = ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник
	|	ГДЕ
	|		ПлановыеНачисленияИУдержанияСрезПоследних.Актуальность
	|		И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата)
	|		И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент)
	|		И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ФиксированнаяСумма)
	|		И СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.Сотрудник
	|			ИНАЧЕ Сотрудники.Сотрудник
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.СтруктурнаяЕдиница
	|			ИНАЧЕ Сотрудники.СтруктурнаяЕдиница
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.Должность
	|			ИНАЧЕ Сотрудники.Должность
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.Период
	|			ИНАЧЕ Сотрудники.Период
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.ВидНачисленияУдержания
	|			ИНАЧЕ Сотрудники.ВидНачисленияУдержания
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.Сумма
	|			ИНАЧЕ Сотрудники.Сумма
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ВЫБОР
	|						КОГДА ПлановыеНачисленияИУдержания.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|							ТОГДА ПлановыеНачисленияИУдержания.ВидНачисленияУдержания.СчетЗатрат
	|						ИНАЧЕ ПлановыеНачисленияИУдержания.СчетЗатрат
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Сотрудники.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|						ТОГДА Сотрудники.ВидНачисленияУдержания.СчетЗатрат
	|					ИНАЧЕ Сотрудники.СчетЗатрат
	|				КОНЕЦ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.ВидУдержанияПФ ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.ВидУдержанияПФ
	|			ИНАЧЕ Сотрудники.ВидУдержанияПФ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.Актуальность
	|			ИНАЧЕ Сотрудники.Актуальность
	|		КОНЕЦ
	|	ИЗ
	|		ДвиженияСотрудники КАК Сотрудники
	|			ПОЛНОЕ СОЕДИНЕНИЕ ДвиженияПлановыеНачисления КАК ПлановыеНачисленияИУдержания
	|			ПО Сотрудники.Сотрудник = ПлановыеНачисленияИУдержания.Сотрудник
	|				И Сотрудники.Период = ПлановыеНачисленияИУдержания.Период
	|				И Сотрудники.ВидНачисленияУдержания = ПлановыеНачисленияИУдержания.ВидНачисленияУдержания) КАК ВложенныйЗапрос
	|ГДЕ ВЫБОР КОГДА НЕ (&ВидНачисленияОтбор = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка))
	|						ТОГДА ВложенныйЗапрос.ВидНачисленияУдержания = &ВидНачисленияОтбор
	|						ИНАЧЕ ИСТИНА КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	ДатаДействияНачало
	|ИТОГИ ПО
	|	Сотрудник";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// 3. Определяем даты окончания периодов, заполняем таблицу значений.
	
	КонецМесяца = НачалоДня(КонецМесяца(Объект.ПериодРегистрации));
	ВыборкаСотрудник = МассивРезультатов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сотрудник");
	Пока ВыборкаСотрудник.Следующий() Цикл
		
		Выборка = ВыборкаСотрудник.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			//Если Выборка.ДругоеПодрУвольнение Тогда
			//	ЗаменитьДатуМассив = Объект.НачисленияУдержания.НайтиСтроки(Новый Структура("ДатаОкончания, Сотрудник", КонецМесяца, Выборка.Сотрудник));
			//	Для каждого ЭлементМассива Из ЗаменитьДатуМассив Цикл
			//		ЭлементМассива.ДатаОкончания = Выборка.ДатаДействияНачало - 60*60*24;
			//	КонецЦикла;
			//	Продолжить;
			//КонецЕсли; 
			//
			//ЗаменитьДатуМассив = Объект.НачисленияУдержания.НайтиСтроки(Новый Структура("ДатаОкончания, Сотрудник, ВидНачисленияУдержания", КонецМесяца, Выборка.Сотрудник, Выборка.ВидНачисленияУдержания));
			//Для каждого ЭлементМассива Из ЗаменитьДатуМассив Цикл
			//	ЭлементМассива.ДатаОкончания = Выборка.ДатаДействияНачало - 60*60*24;
			//КонецЦикла;
			
			Если ЗначениеЗаполнено(Выборка.ВидНачисленияУдержания) И Выборка.Актуальность Тогда
			
				Если Выборка.ЭтоНалог Тогда
				//	
				//	//Паганини_ ПФ
				//	Если Объект.НалогиНаДоходы.НайтиСтроки(Новый Структура("Сотрудник, ВидНачисленияУдержания", 
				//										   Выборка.Сотрудник, Выборка.ВидНачисленияУдержания)).Количество() > 0 Тогда
				//		Продолжить;
				//	КонецЕсли;//_Паганини ПФ
				//	НоваяСтрока							= Объект.НалогиНаДоходы.Добавить();
				//	НоваяСтрока.Сотрудник 				= Выборка.Сотрудник;
				//	НоваяСтрока.ВидНачисленияУдержания 	= Выборка.ВидНачисленияУдержания;
				////Паганини#Удержания_
			    ИначеЕсли Выборка.ЭтаУдержание Тогда
				//	Если Выборка.Размер > 0 Тогда
				//		НоваяСтрокаУ = Объект.Удержания.Добавить();
				//		ЗаполнитьЗначенияСвойств(НоваяСтрокаУ, Выборка);
				//		НоваяСтрокаУ.ВидУдержания 	= Выборка.ВидНачисленияУдержания;
				//		НоваяСтрокаУ.ВидУдержанияПФ = Выборка.ВидУдержанияПФ_;
				//		НоваяСтрокаУ.Сумма			= Выборка.Размер;
				//		НоваяСтрокаУ.СуммаНДФЛ		= НоваяСтрокаУ.Сумма * Выборка.СтавкаНДФЛ / (100 - Выборка.СтавкаНДФЛ);
				//		НоваяСтрокаУ.СуммаПФ		= (НоваяСтрокаУ.Сумма + НоваяСтрокаУ.СуммаНДФЛ) * Выборка.СтавкаПФ / (100 - Выборка.СтавкаПФ);
				//	КонецЕсли;
				////_Паганини#Удержания
				Иначе
				
					НоваяСтрока							= Объект.НачисленияУдержания.Добавить();
					НоваяСтрока.Сотрудник 				= Выборка.Сотрудник;
					//НоваяСтрока.Должность 				= Выборка.Должность;
											
					НоваяСтрока.ВидНачисленияУдержания 	= Выборка.ВидНачисленияУдержания;
					//НоваяСтрока.СчетЗатратРегл		 	= Выборка.ВидНачисленияУдержания.СчетЗатратРегл;//+++
					//НоваяСтрока.ДатаНачала 				= Выборка.ДатаДействияНачало;
					//НоваяСтрока.ДатаОкончания 			= КонецМесяца;
					НоваяСтрока.Размер 					= Выборка.Размер;
					//НоваяСтрока.ВидУдержанияПФ 			= Выборка.ВидУдержанияПФ;//Паганини
					
					НоваяСтрока.ВидОдноразовогоНачисления = Объект.ВидОдноразовогоНачисления;
					
					ТипСчета = Выборка.СчетЗатрат.ТипСчета;
					Если Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение
						И  НЕ (ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
						ИЛИ ТипСчета = Перечисления.ТипыСчетов.Расходы
						ИЛИ ТипСчета = Перечисления.ТипыСчетов.ПрочиеОборотныеАктивы
						ИЛИ ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
						ИЛИ ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство
						ИЛИ ТипСчета = Перечисления.ТипыСчетов.ПрочиеОборотныеАктивы
						ИЛИ ТипСчета = Перечисления.ТипыСчетов.Кредиторы) Тогда
					
						НоваяСтрока.СчетЗатрат = ПланыСчетов.Управленческий.ПустаяСсылка();
						
					Иначе
						
						НоваяСтрока.СчетЗатрат = Выборка.СчетЗатрат;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЦикла;

	Объект.НачисленияУдержания.Сортировать("Сотрудник Возр, ВидНачисленияУдержания Возр");
	
	ОбновитьПодвалФормы();
	
	ЗакончитьЗамерВремени(НачалоЗамераПодразделение, "НачислениеЗарплаты_ЗаполнитьПоПодразделению");
	
КонецПроцедуры // ЗаполнитьПоПодразделению()

&НаСервере
// Процедура заполняет табличную часть "Сотрудники" с отбором по подразделению.
//
Процедура ЗаполнитьПоПодразделениюРегл()
	Перем НачалоЗамераПодразделение, НачалоЗамераПараметр;
	
	НачалоЗамераПодразделение = НачатьЗамерВремени();
	
	Объект.НачисленияУдержания.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.Параметры.Вставить("НачалоМесяца", 		Объект.ПериодРегистрации);
	Запрос.Параметры.Вставить("ОкончаниеМесяца",	КонецМесяца(Объект.ПериодРегистрации));
	Запрос.Параметры.Вставить("Организация", 		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация));
	Запрос.Параметры.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.Параметры.Вставить("Валюта", 			Объект.ВалютаДокумента);
	Запрос.Параметры.Вставить("ВидНачисленияУдержания",Объект.ВидНачисленияОтбор);
		
	// 1. Определяем интересующих сотрудников	
	// 2. Определяем все движения интересующих сотрудников и начисления в нужном подразделении.
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ СотрудникиПодразделения
	|ИЗ
	|	(ВЫБРАТЬ
	|		СотрудникиСрезПоследних.Сотрудник КАК Сотрудник
	|	ИЗ
	|		РегистрСведений.Сотрудники.СрезПоследних(&НачалоМесяца, Организация = &Организация) КАК СотрудникиСрезПоследних
	|	ГДЕ
	|		СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Сотрудники.Сотрудник
	|	ИЗ
	|		РегистрСведений.Сотрудники КАК Сотрудники
	|	ГДЕ
	|		Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		И Сотрудники.Период МЕЖДУ &НачалоМесяца И &ОкончаниеМесяца
	|		И Сотрудники.Организация = &Организация) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.Должность КАК Должность,
	|	ПлановыеНачисленияИУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ПлановыеНачисленияИУдержания.Сумма КАК Сумма,
	|	ПлановыеНачисленияИУдержания.СчетЗатратРегл КАК СчетЗатрат,
	|	ПлановыеНачисленияИУдержания.Актуальность КАК Актуальность,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ВидУдержанияПФ,
	|	ВложенныйЗапрос.ДрПодрУвольнение КАК ДрПодрУвольнение
	|ПОМЕСТИТЬ ДвиженияСотрудники
	|ИЗ
	|	(ВЫБРАТЬ
	|		СотрудникиПодразделения.Сотрудник КАК Сотрудник,
	|		Сотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		Сотрудники.Должность КАК Должность,
	|		МАКСИМУМ(ПлановыеНачисленияИУдержания.Период) КАК ПериодНачисления,
	|		Сотрудники.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК ДрПодрУвольнение,
	|		ПлановыеНачисленияИУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|		Сотрудники.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|		ПлановыеНачисленияИУдержания.Валюта КАК Валюта
	|	ИЗ
	|		СотрудникиПодразделения КАК СотрудникиПодразделения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК Сотрудники
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания КАК ПлановыеНачисленияИУдержания
	|				ПО Сотрудники.Организация = ПлановыеНачисленияИУдержания.Организация
	|					И Сотрудники.Сотрудник = ПлановыеНачисленияИУдержания.Сотрудник
	|					И Сотрудники.Период >= ПлановыеНачисленияИУдержания.Период
	|					И (Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница)
	|					И (ПлановыеНачисленияИУдержания.Валюта = &Валюта)
	|					И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата))
	|					И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент))
	|					И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ФиксированнаяСумма))
	|			ПО СотрудникиПодразделения.Сотрудник = Сотрудники.Сотрудник
	|	ГДЕ
	|		Сотрудники.Организация = &Организация
	|		И Сотрудники.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&НачалоМесяца, ДЕНЬ, 1) И &ОкончаниеМесяца
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Сотрудники.СтруктурнаяЕдиница,
	|		СотрудникиПодразделения.Сотрудник,
	|		Сотрудники.Должность,
	|		Сотрудники.Период,
	|		ПлановыеНачисленияИУдержания.ВидНачисленияУдержания,
	|		ПлановыеНачисленияИУдержания.Валюта,
	|		Сотрудники.ВидУдержанияПФ,
	|		ВЫБОР
	|			КОГДА Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания КАК ПлановыеНачисленияИУдержания
	|		ПО ВложенныйЗапрос.Сотрудник = ПлановыеНачисленияИУдержания.Сотрудник
	|			И (ПлановыеНачисленияИУдержания.Валюта = &Валюта)
	|			И (ПлановыеНачисленияИУдержания.Организация = &Организация)
	|			И ВложенныйЗапрос.ПериодНачисления = ПлановыеНачисленияИУдержания.Период
	|			И ВложенныйЗапрос.ВидНачисленияУдержания = ПлановыеНачисленияИУдержания.ВидНачисленияУдержания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ВидНачисленияУдержания,
	|	ВложенныйЗапрос.Сумма,
	|	ВложенныйЗапрос.СчетЗатрат,
	|	ВложенныйЗапрос.Актуальность,
	|	Сотрудники.СтруктурнаяЕдиница,
	|	Сотрудники.ВидУдержанияПФ,
	|	Сотрудники.Должность
	|ПОМЕСТИТЬ ДвиженияПлановыеНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПлановыеНачисленияИУдержания.Сотрудник КАК Сотрудник,
	|		ПлановыеНачисленияИУдержания.Период КАК Период,
	|		ПлановыеНачисленияИУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|		ПлановыеНачисленияИУдержания.Сумма КАК Сумма,
	|		ВЫБОР
	|			КОГДА ПлановыеНачисленияИУдержания.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|				ТОГДА ПлановыеНачисленияИУдержания.ВидНачисленияУдержания.СчетЗатратРегл
	|			ИНАЧЕ ПлановыеНачисленияИУдержания.СчетЗатратРегл
	|		КОНЕЦ КАК СчетЗатрат,
	|		ПлановыеНачисленияИУдержания.Актуальность КАК Актуальность,
	|		МАКСИМУМ(Сотрудники.Период) КАК ПериодСотрудники
	|	ИЗ
	|		СотрудникиПодразделения КАК СотрудникиПодразделения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания КАК ПлановыеНачисленияИУдержания
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК Сотрудники
	|				ПО ПлановыеНачисленияИУдержания.Сотрудник = Сотрудники.Сотрудник
	|					И ПлановыеНачисленияИУдержания.Период >= Сотрудники.Период
	|					И (Сотрудники.Организация = &Организация)
	|			ПО СотрудникиПодразделения.Сотрудник = ПлановыеНачисленияИУдержания.Сотрудник
	|				И (ПлановыеНачисленияИУдержания.Валюта = &Валюта)
	|				И (ПлановыеНачисленияИУдержания.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&НачалоМесяца, ДЕНЬ, 1) И &ОкончаниеМесяца)
	|				И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата))
	|				И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент))
	|				И (ПлановыеНачисленияИУдержания.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ФиксированнаяСумма))
	|				И (ПлановыеНачисленияИУдержания.Организация = &Организация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПлановыеНачисленияИУдержания.Актуальность,
	|		ПлановыеНачисленияИУдержания.Период,
	|		ПлановыеНачисленияИУдержания.ВидНачисленияУдержания,
	|		ПлановыеНачисленияИУдержания.Сотрудник,
	|		ПлановыеНачисленияИУдержания.Сумма,
	|		ВЫБОР
	|			КОГДА ПлановыеНачисленияИУдержания.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|				ТОГДА ПлановыеНачисленияИУдержания.ВидНачисленияУдержания.СчетЗатратРегл
	|			ИНАЧЕ ПлановыеНачисленияИУдержания.СчетЗатратРегл
	|		КОНЕЦ) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК Сотрудники
	|		ПО ВложенныйЗапрос.ПериодСотрудники = Сотрудники.Период
	|			И (Сотрудники.Организация = &Организация)
	|			И ВложенныйЗапрос.Сотрудник = Сотрудники.Сотрудник
	|ГДЕ
	|	Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.Должность КАК Должность,
	|	ВложенныйЗапрос.ДатаДействияНачало КАК ДатаДействияНачало,
	|	ВложенныйЗапрос.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ВложенныйЗапрос.Размер КАК Размер,
	|	ВложенныйЗапрос.СчетЗатрат КАК СчетЗатрат,
	|	ВложенныйЗапрос.Актуальность,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ДругоеПодрУвольнение,
	|	ВложенныйЗапрос.ВидУдержанияПФ,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Удержание)
	|				ИЛИ ВложенныйЗапрос.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.УдержаниеДляКонтрагента)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтаУдержание,
	|	ВложенныйЗапрос.ВидНачисленияУдержания.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	ЕСТЬNULL(ВложенныйЗапрос.ВидНачисленияУдержания.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0) КАК СтавкаНДФЛ,
	|	ВложенныйЗапрос.ВидНачисленияУдержания.ВидУдержанияПФ КАК ВидУдержанияПФ_,
	|	ЕСТЬNULL(ВложенныйЗапрос.ВидНачисленияУдержания.ВидУдержанияПФ.СтавкаПФ, 0) КАК СтавкаПФ,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Налог)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоНалог
	|ИЗ
	|	(ВЫБРАТЬ
	|		СотрудникиПодразделения.Сотрудник КАК Сотрудник,
	|		СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		СотрудникиСрезПоследних.Должность КАК Должность,
	|		&НачалоМесяца КАК ДатаДействияНачало,
	|		ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|		ПлановыеНачисленияИУдержанияСрезПоследних.Сумма КАК Размер,
	|		ВЫБОР
	|			КОГДА ПлановыеНачисленияИУдержанияСрезПоследних.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|				ТОГДА ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания.СчетЗатратРегл
	|			ИНАЧЕ ПлановыеНачисленияИУдержанияСрезПоследних.СчетЗатратРегл
	|		КОНЕЦ КАК СчетЗатрат,
	|		СотрудникиСрезПоследних.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|		ИСТИНА КАК Актуальность
	|	ИЗ
	|		СотрудникиПодразделения КАК СотрудникиПодразделения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(&НачалоМесяца, Организация = &Организация) КАК СотрудникиСрезПоследних
	|			ПО СотрудникиПодразделения.Сотрудник = СотрудникиСрезПоследних.Сотрудник
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(
	|					&НачалоМесяца,
	|					Организация = &Организация
	|						И Валюта = &Валюта) КАК ПлановыеНачисленияИУдержанияСрезПоследних
	|			ПО СотрудникиПодразделения.Сотрудник = ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник
	|	ГДЕ
	|		ПлановыеНачисленияИУдержанияСрезПоследних.Актуальность
	|		И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата)
	|		И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент)
	|		И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания <> ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ФиксированнаяСумма)
	|		И СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.Сотрудник
	|			ИНАЧЕ Сотрудники.Сотрудник
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.СтруктурнаяЕдиница
	|			ИНАЧЕ Сотрудники.СтруктурнаяЕдиница
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.Должность
	|			ИНАЧЕ Сотрудники.Должность
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.Период
	|			ИНАЧЕ Сотрудники.Период
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.ВидНачисленияУдержания
	|			ИНАЧЕ Сотрудники.ВидНачисленияУдержания
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.Сумма
	|			ИНАЧЕ Сотрудники.Сумма
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ВЫБОР
	|						КОГДА ПлановыеНачисленияИУдержания.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|							ТОГДА ПлановыеНачисленияИУдержания.ВидНачисленияУдержания.СчетЗатрат
	|						ИНАЧЕ ПлановыеНачисленияИУдержания.СчетЗатрат
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Сотрудники.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|						ТОГДА Сотрудники.ВидНачисленияУдержания.СчетЗатрат
	|					ИНАЧЕ Сотрудники.СчетЗатрат
	|				КОНЕЦ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.ВидУдержанияПФ ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.ВидУдержанияПФ
	|			ИНАЧЕ Сотрудники.ВидУдержанияПФ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Сотрудники.Сотрудник ЕСТЬ NULL
	|				ТОГДА ПлановыеНачисленияИУдержания.Актуальность
	|			ИНАЧЕ Сотрудники.Актуальность
	|		КОНЕЦ
	|	ИЗ
	|		ДвиженияСотрудники КАК Сотрудники
	|			ПОЛНОЕ СОЕДИНЕНИЕ ДвиженияПлановыеНачисления КАК ПлановыеНачисленияИУдержания
	|			ПО Сотрудники.Сотрудник = ПлановыеНачисленияИУдержания.Сотрудник
	|				И Сотрудники.Период = ПлановыеНачисленияИУдержания.Период
	|				И Сотрудники.ВидНачисленияУдержания = ПлановыеНачисленияИУдержания.ВидНачисленияУдержания) КАК ВложенныйЗапрос"+
	//+++ Дмгг
	?(ЗначениеЗаполнено(Объект.ВидНачисленияОтбор),"
	|ГДЕ
	|	ВложенныйЗапрос.ВидНачисленияУдержания = &ВидНачисленияУдержания", "")+
	//--- Дмгг
	"
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	ДатаДействияНачало
	|ИТОГИ ПО
	|	Сотрудник";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// 3. Определяем даты окончания периодов, заполняем таблицу значений.
	
	КонецМесяца = НачалоДня(КонецМесяца(Объект.ПериодРегистрации));
	ВыборкаСотрудник = МассивРезультатов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сотрудник");
	Пока ВыборкаСотрудник.Следующий() Цикл
		
		Выборка = ВыборкаСотрудник.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			//Если Выборка.ДругоеПодрУвольнение Тогда
			//	ЗаменитьДатуМассив = Объект.НачисленияУдержания.НайтиСтроки(Новый Структура("ДатаОкончания, Сотрудник", КонецМесяца, Выборка.Сотрудник));
			//	Для каждого ЭлементМассива Из ЗаменитьДатуМассив Цикл
			//		ЭлементМассива.ДатаОкончания = Выборка.ДатаДействияНачало - 60*60*24;
			//	КонецЦикла;
			//	Продолжить;
			//КонецЕсли; 
			//
			//ЗаменитьДатуМассив = Объект.НачисленияУдержания.НайтиСтроки(Новый Структура("ДатаОкончания, Сотрудник, ВидНачисленияУдержания", КонецМесяца, Выборка.Сотрудник, Выборка.ВидНачисленияУдержания));
			//Для каждого ЭлементМассива Из ЗаменитьДатуМассив Цикл
			//	ЭлементМассива.ДатаОкончания = Выборка.ДатаДействияНачало - 60*60*24;
			//КонецЦикла;
			
			Если ЗначениеЗаполнено(Выборка.ВидНачисленияУдержания) И Выборка.Актуальность Тогда
			
				Если Выборка.ЭтоНалог Тогда
				//	
				//	//Паганини_ ПФ
				//	Если Объект.НалогиНаДоходы.НайтиСтроки(Новый Структура("Сотрудник, ВидНачисленияУдержания", 
				//										   Выборка.Сотрудник, Выборка.ВидНачисленияУдержания)).Количество() > 0 Тогда
				//		Продолжить;
				//	КонецЕсли;//_Паганини ПФ
				//	НоваяСтрока							= Объект.НалогиНаДоходы.Добавить();
				//	НоваяСтрока.Сотрудник 				= Выборка.Сотрудник;
				//	НоваяСтрока.ВидНачисленияУдержания 	= Выборка.ВидНачисленияУдержания;
				////Паганини#Удержания_
			    ИначеЕсли Выборка.ЭтаУдержание Тогда
				//	Если Выборка.Размер > 0 Тогда
				//		НоваяСтрокаУ = Объект.Удержания.Добавить();
				//		ЗаполнитьЗначенияСвойств(НоваяСтрокаУ, Выборка);
				//		НоваяСтрокаУ.ВидУдержания 	= Выборка.ВидНачисленияУдержания;
				//		НоваяСтрокаУ.ВидУдержанияПФ = Выборка.ВидУдержанияПФ_;
				//		НоваяСтрокаУ.Сумма			= Выборка.Размер;
				//		НоваяСтрокаУ.СуммаНДФЛ		= НоваяСтрокаУ.Сумма * Выборка.СтавкаНДФЛ / (100 - Выборка.СтавкаНДФЛ);
				//		НоваяСтрокаУ.СуммаПФ		= (НоваяСтрокаУ.Сумма + НоваяСтрокаУ.СуммаНДФЛ) * Выборка.СтавкаПФ / (100 - Выборка.СтавкаПФ);
				//	КонецЕсли;
				////_Паганини#Удержания
				Иначе
				
					НоваяСтрока							= Объект.НачисленияУдержания.Добавить();
					НоваяСтрока.Сотрудник 				= Выборка.Сотрудник;
					НоваяСтрока.Должность 				= Выборка.Должность;
											
					НоваяСтрока.ВидНачисленияУдержания 	= Выборка.ВидНачисленияУдержания;
					//НоваяСтрока.СчетЗатратРегл		 	= Выборка.ВидНачисленияУдержания.СчетЗатратРегл;//+++
					//НоваяСтрока.ДатаНачала 				= Выборка.ДатаДействияНачало;
					//НоваяСтрока.ДатаОкончания 			= КонецМесяца;
					НоваяСтрока.Размер 					= Выборка.Размер;
					//НоваяСтрока.ВидУдержанияПФ 			= Выборка.ВидУдержанияПФ;//Паганини
					
					НоваяСтрока.ВидОдноразовогоНачисления = Объект.ВидОдноразовогоНачисления;
					
					ТипСчета = Выборка.СчетЗатрат.ТипСчета;
					Если Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение
						И  НЕ (ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
						ИЛИ ТипСчета = Перечисления.ТипыСчетов.Расходы
						ИЛИ ТипСчета = Перечисления.ТипыСчетов.ПрочиеОборотныеАктивы
						ИЛИ ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
						ИЛИ ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство
						ИЛИ ТипСчета = Перечисления.ТипыСчетов.ПрочиеОборотныеАктивы
						ИЛИ ТипСчета = Перечисления.ТипыСчетов.Кредиторы) Тогда
					
						НоваяСтрока.СчетЗатрат = ПланыСчетов.Управленческий.ПустаяСсылка();
						
					Иначе
						
						НоваяСтрока.СчетЗатрат = Выборка.СчетЗатрат;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЦикла;
	
	Объект.НачисленияУдержания.Сортировать("Сотрудник Возр, ВидНачисленияУдержания Возр");
	
	ОбновитьПодвалФормы();
	
	ЗакончитьЗамерВремени(НачалоЗамераПодразделение, "НачислениеЗарплаты_ЗаполнитьПоПодразделению");
	
КонецПроцедуры // ЗаполнитьПоПодразделению()

&НаСервере
// Процедура выполняет расчет размера начисления или удержания по формуле.
//
Процедура РассчитатьПоФормулам()

	Для каждого СтрокаНачислений Из Объект.НачисленияУдержания Цикл
		
		Если СтрокаНачислений.РучнаяКорректировка ИЛИ НЕ ЗначениеЗаполнено(СтрокаНачислений.ВидНачисленияУдержания.Формула) Тогда
			Продолжить;
		КонецЕсли; 
		
		// 1. Добавляем параметры и значения в структуру
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТарифнаяСтавка", СтрокаНачислений.Размер);
		СтруктураПараметров.Вставить("ОтработаноДней", СтрокаНачислений.ОтработаноДней);
		СтруктураПараметров.Вставить("ОтработаноЧасов", СтрокаНачислений.ОтработаноЧасов);
		
		Для Счетчик = 1 По 3 Цикл
			Если ЗначениеЗаполнено(СтрокаНачислений["Представление" + Счетчик]) Тогда
				СтруктураПараметров.Вставить(СтрокаНачислений["Показатель" + Счетчик], СтрокаНачислений["Значение" + Счетчик]);
			КонецЕсли; 
		КонецЦикла; 
		
		
		// 2. Рассчитываем по формулам
			 
		Формула = СтрокаНачислений.ВидНачисленияУдержания.Формула;
		Для каждого Параметр Из СтруктураПараметров Цикл
			Формула = СтрЗаменить(Формула, "[" + Параметр.Ключ + "]", Формат(Параметр.Значение, "ЧРД=.; ЧН=0; ЧГ=0"));
		КонецЦикла;
		Попытка
			РассчитаннаяСумма = Вычислить(Формула);
		Исключение
			ТекстСообщения = НСтр("ka='ვერ მოხერხდა დარიცხვის თანხის გაანგარისება სტრიქონ №%НомерСтроки%. შეიძლება, ფორმულა შეიცავს შეცდომებს არნ შეუვსებელია მაჩვენებლები.';ru='Не удалось рассчитать сумму начисления  в строке №%НомерСтроки%. Возможно, формула содержит ошибку или не заполнены показатели.';en='Failed to calculate the amount of charge on line number% NomerStroki%. Perhaps the formula contains an error or not filled performance.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", (Объект.НачисленияУдержания.Индекс(СтрокаНачислений) + 1));
			ПолеСообщения = "Объект.НачисленияУдержания[" + Объект.НачисленияУдержания.Индекс(СтрокаНачислений) + "].ВидНачисленияУдержания";
			
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Объект, ТекстСообщения,,,ПолеСообщения);
			
			РассчитаннаяСумма = 0;
		КонецПопытки;
		СтрокаНачислений.Сумма = Окр(РассчитаннаяСумма, 2); 

	КонецЦикла;
	
	//Паганини ПФ_
	Для Каждого СтрокаНачислений ИЗ Объект.НачисленияУдержания Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаНачислений.ВидУдержанияПФ) Тогда
			Продолжить;
		КонецЕсли;
		СтавкаПФ = СтрокаНачислений.ВидУдержанияПФ.СтавкаПФ;
		СтрокаНачислений.СуммаПФ	= Окр(СтрокаНачислений.Сумма * СтавкаПФ/100, 2);
	КонецЦикла;
	//_Паганини ПФ	
	
	ОбновитьПодвалФормы();

КонецПроцедуры // РассчитатьПоФормулам()

&НаСервере
// Процедура обновляет данные в подвале формы.
//
Процедура ОбновитьПодвалФормы()
	
	Документ = РеквизитФормыВЗначение("Объект");
	СтруктураИтогов = Документ.ПолучитьСуммуДокумента();
	СуммаДокумента = СтруктураИтогов.СуммаДокумента;

	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры // ОбновитьПодвалФормы()

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.БазаРасчетаПоБонуснымБаллам.Видимость = Объект.РасчетПоБонуснымБаллам;
	Элементы.НачисленияУдержанияБонусныеБаллы.Видимость = Объект.РасчетПоБонуснымБаллам;
	Элементы.РассчитатьПоБонуснымБаллам.Видимость = Объект.РасчетПоБонуснымБаллам;
	
	Элементы.ГруппаПочасоваяОплата.Видимость = Объект.РасчетПоБонуснымБаллам;
	
	Элементы.КоличествоРабочихЧасов.Видимость = Объект.ПочасоваяСтавкаЗарплаты;
	Элементы.КоличествоРабочихДней.Видимость = Объект.ПочасоваяСтавкаЗарплаты;

КонецПроцедуры

&НаКлиенте
Процедура РасчитатьСуммуПоБонуснымБаллам(СтрокаТабличнойЧасти)

	Если (Объект.РасчетПоБонуснымБаллам) И (НЕ (Объект.БазаРасчетаПоБонуснымБаллам=0)) И (НЕ (СтрокаТабличнойЧасти.Размер=0)) Тогда
	
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Размер * СтрокаТабличнойЧасти.БонусныеБаллы / Объект.БазаРасчетаПоБонуснымБаллам;
		Если Объект.ПочасоваяСтавкаЗарплаты Тогда
			СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма * Объект.КоличествоРабочихЧасов * Объект.КоличествоРабочихДней;
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
// В процедуре осуществляется
// - инициализация параметров формы,
// - установка параметров функциональных опций формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображениеПериодаРегистрации = Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
		ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата());
	Иначе
		ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ДатаДокумента);
	КонецЕсли;
	
	ВалютаДокумента = Объект.ВалютаДокумента;
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	
	ВыполнятьЗамерыПроизводительности = ОценкаПроизводительностиВызовСервераПовтИсп.ВыполнятьЗамерыПроизводительности();
	
	ОбновитьПодвалФормы();
	
	//Если НЕ Константы.ФункциональнаяОпцияИспользоватьСовместительство.Получить() Тогда
	//	
	//	Если Элементы.Найти("НачисленияУдержанияСотрудникКод") <> Неопределено Тогда
	//		
	//		Элементы.НачисленияУдержанияСотрудникКод.Видимость = Ложь;
	//		
	//	КонецЕсли;
	//	
	//	Если Элементы.Найти("НалогиНаДоходыСотрудникКод") <> Неопределено Тогда
	//		
	//		Элементы.НалогиНаДоходыСотрудникКод.Видимость = Ложь;
	//		
	//	КонецЕсли;
	//	
	//	Если Элементы.Найти("СтраховыеВзносыСотрудникКод") <> Неопределено Тогда
	//		
	//		Элементы.СтраховыеВзносыСотрудникКод.Видимость = Ложь;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Если Объект.НачисленияУдержания.Количество() > 0 Тогда
	//	
	//	Для каждого СтрокаДанных Из Объект.НачисленияУдержания Цикл
	//		
	//		Если ЗначениеЗаполнено(СтрокаДанных.СчетЗатрат) Тогда
	//			
	//			СтрокаДанных.ТипСчета = ?(ИспользоватьТолькоРегламентированныйПланСчетов, СтрокаДанных.СчетЗатратРегл.ТипСчета, СтрокаДанных.СчетЗатрат.ТипСчета);//+++ Дмгг
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаВажныеКоманды);
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры
&НаКлиенте
// Процедура - обработчик события формы ОбработкаВыбора
//
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
		И СтрНайти(ИсточникВыбора.ИмяФормы, "ФормаКалендаря") > 0 Тогда
		
		Объект.ПериодРегистрации = КонецДня(ВыбранноеЗначение);
		УправлениеНебольшойФирмойКлиент.ПриИзмененииПериодаРегистрации(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаВыбора()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура заполняет табличную часть "Сотрудники" с отбором по подразделению.
//
Процедура Заполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='ქვეგანყოფილება შეუვსებელია! დოკუმენტის შევსება გაუქმებულია.';ru='Не заполнено подразделение! Заполнение документа отменено.';en='Not filled unit! Filling the document is canceled.'");
		Сообщение.Поле = "Объект.СтруктурнаяЕдиница";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.НачисленияУдержания.Количество() > 0 
		//ИЛИ Объект.НалогиНаДоходы.Количество() > 0 
		//ИЛИ	Объект.ПогашениеЗаймов.Количество() > 0 
		Тогда // Прочие расчеты
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), НСтр("ka='დოკუმენტის ცხრილი გასუფთავდება! გავაგრძელოთ ოპერაციის შესრულება?';ru='Табличная часть документа будет очищена! Продолжить выполнение операции?';en='A table of the document will be cleared! To continue the operation?'"), РежимДиалогаВопрос.ДаНет, 0);
		Возврат; 
		
	КонецЕсли;
	
	ЗаполнитьФрагмент();
	//	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
		
	КонецЕсли; 
	
	//ТекстВопроса = "";
	//РассчитыватьБезВзносов = Ложь;
	//Расшифровка = Новый Структура;
	//Если Не ПроверитьЗаполнениеРеквизитовОрганизацииДляРасчетаВзносов(Объект.Организация, Объект.ПериодРегистрации, ТекстВопроса, РассчитыватьБезВзносов, Расшифровка) Тогда
	//	СписокКнопок = Новый СписокЗначений;
	//	СписокКнопок.Добавить(КодВозвратаДиалога.Да, Нстр("ka='შევსება';ru='Заполнить';en='Insert'"));
	//	СписокКнопок.Добавить(КодВозвратаДиалога.Нет, Нстр("ka='შენატანების გარეშე გამოთვლა';ru='Рассчитать без взносов';en='Calculate without fees'"));
	//	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, Нстр("ka='გაუქმება';ru='Отмена';en='cancellation'"));
	//	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьРеквизитыОрганизацииЗавершение", ЭтотОбъект, Новый Структура("Расшифровка, ПроцедураВыполнения", Расшифровка, "ЗаполнитьПоПодразделению")), ТекстВопроса, СписокКнопок);
	//	
	//	Возврат; 
	//КонецЕсли;
	
	ЗаполнитьФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФрагмент()
	
	Если НЕ ИспользоватьТолькоРегламентированныйПланСчетов Тогда
		ЗаполнитьПоПодразделению();
	Иначе 
		ЗаполнитьПоПодразделениюРегл();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовФормы

//Процедура обработчик события регулирования поля ПериодРегистрации
//
&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	УправлениеНебольшойФирмойКлиент.ПриРегулированииПериодаРегистрации(ЭтаФорма, Направление);
	УправлениеНебольшойФирмойКлиент.ПриИзмененииПериодаРегистрации(ЭтаФорма);
	
КонецПроцедуры //ПериодРегистрацииРегулирование()

//Процедура обработчик события начала ввода данных поля ПериодРегистрации
//
&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	 = Ложь;
	
	ДатаКалендаряПриОткрытии = ?(ЗначениеЗаполнено(Объект.ПериодРегистрации), Объект.ПериодРегистрации, УправлениеНебольшойФирмойПовтИсп.ПолучитьТекущуюДатаСеанса());
	
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", УправлениеНебольшойФирмойКлиент.ПолучитьПараметрыОткрытияФормыКалендаря(ДатаКалендаряПриОткрытии), ЭтаФорма);
	
КонецПроцедуры //ПериодРегистрацииНачалоВыбора()

&НаКлиенте
Процедура НачисленияУдержанияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПочасоваяСтавкаЗарплатыПриИзменении(Элемент)
	
	Если Объект.ПочасоваяСтавкаЗарплаты Тогда
		
		Для каждого СтрНачисленияУдержания Из Объект.НачисленияУдержания Цикл
			
			СтрНачисленияУдержания.Сумма = 0;
			
		КонецЦикла; 		
		
	КонецЕсли;

	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетПоБонуснымБалламПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияУдержанияБонусныеБаллыПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.НачисленияУдержания.ТекущиеДанные;
	РасчитатьСуммуПоБонуснымБаллам(СтрокаТабличнойЧасти);
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоБонуснымБаллам(Команда)
	
	Для каждого СтрНачисленияУдержания Из Объект.НачисленияУдержания Цикл
	
		РасчитатьСуммуПоБонуснымБаллам(СтрНачисленияУдержания);
	
	КонецЦикла;
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти