
Процедура ОбработкаПроведения(Отказ, Режим)


	// регистр LT_СоответствияКатегорииЗапасов
	Движения.LT_КатегорииЗапасов.Записывать = Истина;
	Для Каждого ТекСтрокаСоответствияКатегории Из LT_КатегорииЗапасов Цикл
		Движение = Движения.LT_КатегорииЗапасов.Добавить();
		Движение.Период = Дата;
		Движение.InventoryPostingGroup = ТекСтрокаСоответствияКатегории.InventoryPostingGroup;
		Движение.MakeCode = ТекСтрокаСоответствияКатегории.MakeCode;
		Движение.UnitOfMeasure = ТекСтрокаСоответствияКатегории.UnitOfMeasure;
		Движение.Категория = ТекСтрокаСоответствияКатегории.Категория;
	КонецЦикла;

	// регистр LT_СоответствияDescriptionOfInstruction
	Движения.LT_СоответствияУслуг99.Записывать = Истина;
	Для Каждого ТекСтрокаСоответствияDescriptionOfInstruction Из LT_СоответствияУслуг99 Цикл
		Движение = Движения.LT_СоответствияУслуг99.Добавить();
		Движение.Период = Дата;
		Движение.DescriptionOfInstruction = ТекСтрокаСоответствияDescriptionOfInstruction.DescriptionOfInstruction;
		Движение.Номенклатура = ТекСтрокаСоответствияDescriptionOfInstruction.Номенклатура;
	КонецЦикла;

	// регистр LT_СоответствияPOS
	Движения.LT_СоответствияБанковскихСчетовКассы.Записывать = Истина;
	Для Каждого ТекСтрокаСоответствияPOS Из LT_СоответствияБанковскихСчетов Цикл
		Движение = Движения.LT_СоответствияБанковскихСчетовКассы.Добавить();
		Движение.Период 				= Дата;
		Движение.POS 					= ТекСтрокаСоответствияPOS.POS;
		Движение.БанковскийСчетКасса 	= ТекСтрокаСоответствияPOS.БанковскийСчетКасса;
	КонецЦикла;

	// регистр LT_КатегорияУслуги
	Движения.LT_КатегорияУслуги.Записывать = Истина;
	Если ЗначениеЗаполнено(КатегорияУслуги) Тогда
		Движение = Движения.LT_КатегорияУслуги.Добавить();
		Движение.Период = Дата;
		Движение.Категория = КатегорияУслуги;
	КонецЕсли;

	// регистр LT_НаправленияДеятельностиЗапасов
	Движения.LT_НаправленияДеятельностиЗапасов.Записывать = Истина;
	Для Каждого ТекСтрокаНаправленияДеятельностиЗапасов Из LT_НаправленияДеятельностиЗапасов Цикл
		Движение = Движения.LT_НаправленияДеятельностиЗапасов.Добавить();
		Движение.Период 					= Дата;
		Движение.КатегорияНоменклатуры 		= ТекСтрокаНаправленияДеятельностиЗапасов.КатегорияНоменклатуры;
		Движение.НаправлениеДеятельности 	= ТекСтрокаНаправленияДеятельностиЗапасов.НаправлениеДеятельности;
	КонецЦикла;
	
	// регистр LT_НаправленияДеятельностиУслуг
	Движения.LT_НаправленияДеятельностиУслуг.Записывать = Истина;
	Для Каждого ТекСтрокаСоответствияDescriptionOfInstruction Из LT_СоответствияУслуг Цикл
		Движение = Движения.LT_НаправленияДеятельностиУслуг.Добавить();
		Движение.Период = Дата;
		Движение.DescriptionOfInstruction = ТекСтрокаСоответствияDescriptionOfInstruction.DescriptionOfInstruction;
		Движение.НаправлениеДеятельности = ТекСтрокаСоответствияDescriptionOfInstruction.НаправленияДеятельности;
	КонецЦикла;
	
	Движения.LT_ГруппаЗапасов.Записывать = Истина;
	Для Каждого ТекГруппаЗапасов Из LT_ГруппаЗапасов Цикл
		Движение = Движения.LT_ГруппаЗапасов.Добавить();
		Движение.Период 					= Дата;
		Движение.DescriptionOfInstruction 	= ТекГруппаЗапасов.DescriptionOfInstruction;
		Движение.Группа 	                = ТекГруппаЗапасов.Группа;
	КонецЦикла;

КонецПроцедуры

