#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасы(ДокументСсылкаСписаниеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	// Установка исключительной блокировки контролируемых остатков запасов.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	//ПодольскийАИ #УчетПроектов 07.09.2021 {
	|	ТаблицаЗапасы.Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 07.09.2021 }
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя,
	|	ТаблицаЗапасы.СчетУчетаРегл
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.Списание
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	//ПодольскийАИ #УчетПроектов 07.09.2021 {
	|	ТаблицаЗапасы.Проект,
	//ПодольскийАИ #УчетПроектов 07.09.2021 }
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.СчетУчетаРегл";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Запасы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;

	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл
		Если СтрНайти(КолонкаРезультатЗапроса.Имя, "Оприходование") = 0 Тогда
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
		КонецЕсли;
	КонецЦикла;
	Блокировка.Заблокировать();
	
	// Получение остатков запасов по стоимости.
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОстатки.Организация КАК Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|		ЗапасыОстатки.Характеристика КАК Характеристика,
	|		ЗапасыОстатки.Партия КАК Партия,
	|		СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|		СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				&МоментКонтроля,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|				(Организация, СтруктурнаяЕдиница, СчетУчета, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|					(ВЫБРАТЬ
	|						ТаблицаЗапасы.Организация,
	|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.СчетУчета,
	|						ТаблицаЗапасы.СчетУчетаРегл, //+++ Дмгг
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗапасыОстатки.Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета,
	|		ЗапасыОстатки.Номенклатура,
	|		ЗапасыОстатки.Характеристика,
	|		ЗапасыОстатки.Партия,
	|		ЗапасыОстатки.СчетУчетаРегл
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗапасы.Организация,
	|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	|		ДвиженияДокументаЗапасы.СчетУчета,
	|		ДвиженияДокументаЗапасы.СчетУчетаРегл,
	|		ДвиженияДокументаЗапасы.Номенклатура,
	|		ДвиженияДокументаЗапасы.Характеристика,
	|		ДвиженияДокументаЗапасы.Партия,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Сумма, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Сумма, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|	ГДЕ
	|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|		И ДвиженияДокументаЗапасы.Период <= &ПериодКонтроля) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета,
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия,
	|	ЗапасыОстатки.СчетУчетаРегл";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСписаниеЗапасов);
	Запрос.УстановитьПараметр("МоментКонтроля", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗапасыОстатки = РезультатЗапроса.Выгрузить();
	ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,Номенклатура,Характеристика,Партия");
	
	ВалютаУчета = Константы.ВалютаУчета.Получить(); //+++
	
	КоличествоСтрок = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Количество() - 1;
	
	Для н = 0 По КоличествоСтрок Цикл
		
		СтрокаТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы[н];
		
		СтруктураДляПоиска = Новый Структура;
		СтруктураДляПоиска.Вставить("Организация", СтрокаТаблицаЗапасы.Организация);
		СтруктураДляПоиска.Вставить("СтруктурнаяЕдиница", СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
		СтруктураДляПоиска.Вставить("СчетУчета", СтрокаТаблицаЗапасы.СчетУчета);
		СтруктураДляПоиска.Вставить("СчетУчетаРегл", СтрокаТаблицаЗапасы.СчетУчетаРегл);
		СтруктураДляПоиска.Вставить("Номенклатура", СтрокаТаблицаЗапасы.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", СтрокаТаблицаЗапасы.Характеристика);
		СтруктураДляПоиска.Вставить("Партия", СтрокаТаблицаЗапасы.Партия);
		
		КоличествоТребуется = СтрокаТаблицаЗапасы.Количество;
		
		Если КоличествоТребуется > 0 Тогда
			
			МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
			
			КоличествоОстаток = 0;
			СуммаОстаток = 0;
			
			Если МассивСтрокОстатков.Количество() > 0 Тогда
				КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
				СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток;
			КонецЕсли;
			
			Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуется Тогда

				СуммаКСписанию = Окр(СуммаОстаток * КоличествоТребуется / КоличествоОстаток , 2, 1);

				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуется;
				МассивСтрокОстатков[0].СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток - СуммаКСписанию;

			ИначеЕсли КоличествоОстаток = КоличествоТребуется Тогда

				СуммаКСписанию = СуммаОстаток;

				МассивСтрокОстатков[0].КоличествоОстаток = 0;
				МассивСтрокОстатков[0].СуммаОстаток = 0;

			Иначе
				СуммаКСписанию = 0;	
			КонецЕсли;
	
			СтрокаТаблицаЗапасы.Сумма = СуммаКСписанию;
			СтрокаТаблицаЗапасы.Количество = КоличествоТребуется;
					
		КонецЕсли;
		
		// Сформируем проводки.
		Если Окр(СтрокаТаблицаЗапасы.Сумма, 2, 1) <> 0 Тогда
			СтрокаТаблицаУправленческий = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицаУправленческий, СтрокаТаблицаЗапасы);
			
			Если ДокументСсылкаСписаниеЗапасов.ПриходоватьТоварыПоСебестоимостиСписания Тогда
				СтрокаТаблицаУправленческий.СчетДт = СтрокаТаблицаЗапасы.СчетДтОприходование;
			КонецЕсли;
			
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ПересортицаЗапасов(ДокументСсылкаСписаниеЗапасов, СтруктураДополнительныеСвойства, ВалютаУчета, СтрокаТаблицаЗапасы);
		КонецЕсли;
		
		// Данные для корректировки А.
		Если ДокументСсылкаСписаниеЗапасов.ПриходоватьТоварыПоСебестоимостиСписания Тогда
			СтрокаТаблицаЗапасы.КоррСчетУчета = СтрокаТаблицаЗапасы.СчетУчетаОприходование;
			СтрокаТаблицаЗапасы.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаОприходованиеРегл;
			СтрокаТаблицаЗапасы.КоррНоменклатура = СтрокаТаблицаЗапасы.НоменклатураОприходование;
			СтрокаТаблицаЗапасы.КоррХарактеристика = СтрокаТаблицаЗапасы.ХарактеристикаОприходование;
			СтрокаТаблицаЗапасы.КоррПартия = СтрокаТаблицаЗапасы.ПартияОприходование;
			СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
			
			//ПодольскийАИ #УчетПроектов 08.09.2021 {
			СтрокаТаблицаЗапасы.КоррПроект = СтрокаТаблицаЗапасы.ПроектОприходование;
			//ПодольскийАИ #УчетПроектов 08.09.2021 }
			
		КонецЕсли;
		
		// Строка оприходования
		НоваяСтрокаОприходование = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаОприходование, СтрокаТаблицаЗапасы);
		НоваяСтрокаОприходование.Номенклатура = СтрокаТаблицаЗапасы.НоменклатураОприходование;
		НоваяСтрокаОприходование.Характеристика = СтрокаТаблицаЗапасы.ХарактеристикаОприходование;
		НоваяСтрокаОприходование.Партия = СтрокаТаблицаЗапасы.ПартияОприходование;
		НоваяСтрокаОприходование.СчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаОприходованиеРегл;
		
		//ПодольскийАИ #УчетПроектов 08.09.2021 {
		НоваяСтрокаОприходование.Проект = СтрокаТаблицаЗапасы.ПроектОприходование;
		НоваяСтрокаОприходование.ПроектОприходование = СтрокаТаблицаЗапасы.Проект;
		//ПодольскийАИ #УчетПроектов 08.09.2021 }
			
		Если НЕ ДокументСсылкаСписаниеЗапасов.ПриходоватьТоварыПоСебестоимостиСписания Тогда
			НоваяСтрокаОприходование.Сумма = СтрокаТаблицаЗапасы.СуммаОприходование;
		КонецЕсли;
		НоваяСтрокаОприходование.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		// Сформируем проводки.
		Если НЕ ДокументСсылкаСписаниеЗапасов.ПриходоватьТоварыПоСебестоимостиСписания И Окр(НоваяСтрокаОприходование.Сумма, 2, 1) <> 0 Тогда
			СтрокаТаблицаУправленческийОприходование = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицаУправленческийОприходование, НоваяСтрокаОприходование);
			СтрокаТаблицаУправленческийОприходование.СчетДт = СтрокаТаблицаЗапасы.СчетДтОприходование;
			СтрокаТаблицаУправленческийОприходование.СчетКт = СтрокаТаблицаЗапасы.СчетКтОприходование;
		
			//+++ Проводки Регл
			СтрокаТаблицаХозрасчетныйОприходование = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицаХозрасчетныйОприходование, НоваяСтрокаОприходование);
			
			СтрокаТаблицаХозрасчетныйОприходование.СчетДт = НоваяСтрокаОприходование.СчетДтОприходованиеРегл;
			СтрокаТаблицаХозрасчетныйОприходование.СчетКт = НоваяСтрокаОприходование.СчетКтОприходованиеРегл;
			
			//ПодольскийАИ #УчетПроектов 08.09.2021 {
			СтрокаТаблицаХозрасчетныйОприходование.Проект = НоваяСтрокаОприходование.ПроектОприходование;
			СтрокаТаблицаХозрасчетныйОприходование.ПроектОприходование = НоваяСтрокаОприходование.Проект;
			//ПодольскийАИ #УчетПроектов 08.09.2021 }
			
			//Валюта
			Если СтрокаТаблицаХозрасчетныйОприходование.СчетДт.Валютный Тогда 
				СтрокаТаблицаХозрасчетныйОприходование.ВалютаДт = ВалютаУчета;
			КонецЕсли;
			Если СтрокаТаблицаХозрасчетныйОприходование.СчетКт.Валютный Тогда
				СтрокаТаблицаХозрасчетныйОприходование.ВалютаКт = ВалютаУчета;
			КонецЕсли;
			//Количество
			Если СтрокаТаблицаХозрасчетныйОприходование.СчетДт.Количественный Тогда
				СтрокаТаблицаХозрасчетныйОприходование.КоличествоДт = НоваяСтрокаОприходование.Количество;
			КонецЕсли;
			Если СтрокаТаблицаХозрасчетныйОприходование.СчетКт.Количественный Тогда
				СтрокаТаблицаХозрасчетныйОприходование.КоличествоКт = НоваяСтрокаОприходование.Количество;
			КонецЕсли; 
			
			СтрокаТаблицаХозрасчетныйОприходование.СубконтоДт1 = НоваяСтрокаОприходование.СтруктурнаяЕдиница;
			СтрокаТаблицаХозрасчетныйОприходование.СубконтоДт2 = НоваяСтрокаОприходование.НоменклатураОприходование;
			СтрокаТаблицаХозрасчетныйОприходование.СубконтоДт3 = НоваяСтрокаОприходование.ХарактеристикаОприходование;
			Если ДокументСсылкаСписаниеЗапасов.ПриходоватьТоварыПоСебестоимостиСписания Тогда 
				СтрокаТаблицаХозрасчетныйОприходование.СубконтоКт1 = НоваяСтрокаОприходование.СтруктурнаяЕдиница;
			Иначе
				СтрокаТаблицаХозрасчетныйОприходование.СубконтоКт1 = НоваяСтрокаОприходование.Подразделение
			КонецЕсли;
			СтрокаТаблицаХозрасчетныйОприходование.СубконтоКт2 = НоваяСтрокаОприходование.Номенклатура;
			СтрокаТаблицаХозрасчетныйОприходование.СубконтоКт3 = НоваяСтрокаОприходование.Характеристика;
			СтрокаТаблицаХозрасчетныйОприходование.ВидСубконтоДт1 = "Склады";
			СтрокаТаблицаХозрасчетныйОприходование.ВидСубконтоДт2 = "Номенклатура";
			СтрокаТаблицаХозрасчетныйОприходование.ВидСубконтоДт3 = "ХарактеристикиНоменклатуры";
			Если ДокументСсылкаСписаниеЗапасов.ПриходоватьТоварыПоСебестоимостиСписания Тогда 
				СтрокаТаблицаХозрасчетныйОприходование.ВидСубконтоКт1 = "Склады";
			Иначе
				СтрокаТаблицаХозрасчетныйОприходование.ВидСубконтоКт1 = "Подразделения";
			КонецЕсли;
			СтрокаТаблицаХозрасчетныйОприходование.ВидСубконтоКт2 = "Номенклатура";
			СтрокаТаблицаХозрасчетныйОприходование.ВидСубконтоКт3 = "ХарактеристикиНоменклатуры";
			//---
		КонецЕсли;
		
		// Данные для корректировки Б.
		НоваяСтрокаОприходование.ДокументПродажи = Неопределено;
		Если ДокументСсылкаСписаниеЗапасов.ПриходоватьТоварыПоСебестоимостиСписания Тогда
			НоваяСтрокаОприходование.КоррСчетУчета = СтрокаТаблицаЗапасы.СчетУчета;
			НоваяСтрокаОприходование.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
			НоваяСтрокаОприходование.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
			НоваяСтрокаОприходование.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
			НоваяСтрокаОприходование.КоррПартия = СтрокаТаблицаЗапасы.Партия;
			НоваяСтрокаОприходование.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
			
			//ПодольскийАИ #УчетПроектов 08.09.2021 {
			НоваяСтрокаОприходование.КоррПроект = СтрокаТаблицаЗапасы.Проект;
			//ПодольскийАИ #УчетПроектов 08.09.2021 }
			
		Иначе
			НоваяСтрокаОприходование.ФиксированнаяСтоимость = Истина;
		КонецЕсли;
		НоваяСтрокаОприходование.СодержаниеПроводки = СтрокаТаблицаЗапасы.СодержаниеПроводкиОприходование;
		
		// Для подсчета итоговых сумма доходов и расходов
		СтрокаТаблицаЗапасы.СуммаРасход = СтрокаТаблицаЗапасы.Сумма;
		СтрокаТаблицаЗапасы.СуммаПриход = 0;
		
		НоваяСтрокаОприходование.СуммаРасход = 0;
		НоваяСтрокаОприходование.СуммаПриход = НоваяСтрокаОприходование.Сумма;
		
		Если Не УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков() И
			ДокументСсылкаСписаниеЗапасов.ПриходоватьТоварыПоСебестоимостиСписания И НоваяСтрокаОприходование.Сумма <= 0 Тогда
			
			ЗаголовокОшибки = НСтр("ka='შეცდომა:';ru='Ошибка:';en='Mistake:'");
			ШаблонЗаголовкаСообщения = ЗаголовокОшибки + Символы.ПС + НСтр("ka='Попытка оприходовать номенклатуру с нулевой стоимостью.';ru='Попытка оприходовать номенклатуру с нулевой стоимостью.';en='Trying to debit the range of zero-cost.'");
			
			ШаблонСообщения = НСтр("ka='Номенклатура: %НоменклатураХарактеристикаПартия%';ru='Номенклатура: %НоменклатураХарактеристикаПартия%';en='Nomenclature:% NomenklaturaHarakteristikaPartiya%'");
			
			ПредставлениеНоменклатуры = УправлениеНебольшойФирмойСервер.ПредставлениеНоменклатуры(НоваяСтрокаОприходование.Номенклатура.Наименование,
				НоваяСтрокаОприходование.Характеристика.Наименование,
				НоваяСтрокаОприходование.Партия.Наименование);
				
			ТекстСообщения = ШаблонЗаголовкаСообщения + Символы.ПС + СтрЗаменить(ШаблонСообщения, "%НоменклатураХарактеристикаПартия%", ПредставлениеНоменклатуры);
			
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ДокументСсылкаСписаниеЗапасов.ПолучитьОбъект(), ТекстСообщения,,, "Запасы");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьТаблицаЗапасов()

Процедура СформироватьТаблицаЗапасыВРазрезеГТД(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаЗапасыНаСкладах.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период КАК Период,
	|	ТаблицаЗапасыНаСкладах.Организация КАК Организация,
	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Характеристика КАК Характеристика,
	|	ТаблицаЗапасыНаСкладах.Партия КАК Партия,
	|	ТаблицаЗапасыНаСкладах.НомерГТД КАК НомерГТД,
	|	ТаблицаЗапасыНаСкладах.СтранаПроисхождения КАК СтранаПроисхождения,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|ГДЕ
	|	ТаблицаЗапасыНаСкладах.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|	И ТаблицаЗапасыНаСкладах.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяССылка)
	|	И ТаблицаЗапасыНаСкладах.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяССылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Организация,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Характеристика,
	|	ТаблицаЗапасыНаСкладах.Партия,
	|	ТаблицаЗапасыНаСкладах.НомерГТД,
	|	ТаблицаЗапасыНаСкладах.СтранаПроисхождения,
	|	ТаблицаЗапасыНаСкладах.ВидДвижения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыВРазрезеГТД", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаСписаниеЗапасов, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);

	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	СписаниеЗапасовЗапасы.КлючСвязи КАК КлючСвязи,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	СписаниеЗапасовЗапасы.Ссылка КАК Ссылка,
	|	СписаниеЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад КАК ОрдерныйСклад,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СписаниеЗапасовЗапасы.Ссылка.Ячейка КАК Ячейка,
	|	ВЫБОР
	|		КОГДА СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СписатьЗапасыИзЭксплуатации
	|			ТОГДА СписаниеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ СписаниеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|	КОНЕЦ КАК СчетУчета,
	//+++
	|	ВЫБОР
	|		КОГДА СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СписатьЗапасыИзЭксплуатации
	|			ТОГДА СписаниеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ СписаниеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	СписаниеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	//---
	|	СписаниеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	СписаниеЗапасовЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	СписаниеЗапасовЗапасы.НомерГТД КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА СписаниеЗапасовЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	//ПодольскийАИ #УчетПроектов 07.09.2021 {
	|	ВЫБОР 
	|		КОГДА СписаниеЗапасовЗапасы.Проект = Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА Значение(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ СписаниеЗапасовЗапасы.Проект
	|	КОНЕЦ КАК Проект,
	//ПодольскийАИ #УчетПроектов 07.09.2021 }
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА СписаниеЗапасовЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СписаниеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА СписаниеЗапасовЗапасы.Количество
	|		ИНАЧЕ СписаниеЗапасовЗапасы.Количество * СписаниеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	0 КАК Сумма,
	|	СписаниеЗапасовЗапасы.Ссылка.Корреспонденция КАК СчетДт,
	|	ВЫБОР
	|		КОГДА СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СписатьЗапасыИзЭксплуатации
	|			ТОГДА СписаниеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ СписаниеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|	КОНЕЦ КАК СчетКт,
	//+++
	|	СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияРегл КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СписатьЗапасыИзЭксплуатации
	|			ТОГДА СписаниеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ СписаниеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|	КОНЕЦ КАК СчетКтРегл,
	//---
	|	&СписаниеЗапасов КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвиженияОрдерныйСклад,
	|	ИСТИНА КАК Списание,
	|	СписаниеЗапасовЗапасы.НоменклатураОприходование КАК НоменклатураОприходование,
	|	СписаниеЗапасовЗапасы.ХарактеристикаОприходование КАК ХарактеристикаОприходование,
	//ПодольскийАИ #УчетПроектов 07.09.2021 {
	|	ВЫБОР 
	|		КОГДА СписаниеЗапасовЗапасы.ПроектОприходование = Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА Значение(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ СписаниеЗапасовЗапасы.ПроектОприходование
	|	КОНЕЦ КАК ПроектОприходование,
	//ПодольскийАИ #УчетПроектов 07.09.2021 }
	|	СписаниеЗапасовЗапасы.ПартияОприходование КАК ПартияОприходование,
	|	ВЫБОР
	|		КОГДА СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СписатьЗапасыИзЭксплуатации
	|			ТОГДА СписаниеЗапасовЗапасы.НоменклатураОприходование.СчетУчетаЗапасов
	|		ИНАЧЕ СписаниеЗапасовЗапасы.НоменклатураОприходование.СчетУчетаЗатрат
	|	КОНЕЦ КАК СчетУчетаОприходование,
	//+++
	|	ВЫБОР
	|		КОГДА СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СписатьЗапасыИзЭксплуатации
	|			ТОГДА СписаниеЗапасовЗапасы.НоменклатураОприходование.СчетУчетаЗапасовРегл
	|		ИНАЧЕ СписаниеЗапасовЗапасы.НоменклатураОприходование.СчетУчетаЗатратРегл
	|	КОНЕЦ КАК СчетУчетаОприходованиеРегл,
	//---
	|	СписаниеЗапасовЗапасы.Сумма КАК СуммаОприходование,
	|	ВЫБОР
	|		КОГДА СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СписатьЗапасыИзЭксплуатации
	|			ТОГДА СписаниеЗапасовЗапасы.НоменклатураОприходование.СчетУчетаЗапасов
	|		ИНАЧЕ СписаниеЗапасовЗапасы.НоменклатураОприходование.СчетУчетаЗатрат
	|	КОНЕЦ КАК СчетДтОприходование,
	|	СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияОприходование КАК СчетКтОприходование,
	//+++
	|	ВЫБОР
	|		КОГДА СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СписатьЗапасыИзЭксплуатации
	|			ТОГДА СписаниеЗапасовЗапасы.НоменклатураОприходование.СчетУчетаЗапасовРегл
	|		ИНАЧЕ СписаниеЗапасовЗапасы.НоменклатураОприходование.СчетУчетаЗатратРегл
	|	КОНЕЦ КАК СчетДтОприходованиеРегл,
	|	СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияОприходованиеРегл КАК СчетКтОприходованиеРегл,
	//---
	|	&ОприходованиеЗапасов КАК СодержаниеПроводкиОприходование,
	|	СписаниеЗапасовЗапасы.Ссылка.ПриходоватьТоварыПоСебестоимостиСписания
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ПересортицаЗапасов.Запасы КАК СписаниеЗапасовЗапасы
	|ГДЕ
	|	СписаниеЗапасовЗапасы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеЗапасовЗапасы.НомерСтроки,
	|	СписаниеЗапасовЗапасы.КлючСвязи,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	СписаниеЗапасовЗапасы.Ссылка,
	|	СписаниеЗапасовЗапасы.Ссылка.Дата,
	|	СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	СписаниеЗапасовЗапасы.Ссылка.Ячейка,
	|	ВЫБОР
	|		КОГДА СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СписатьЗапасыИзЭксплуатации
	|			ТОГДА СписаниеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ СписаниеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|	КОНЕЦ,
	//+++
	|	ВЫБОР
	|		КОГДА СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СписатьЗапасыИзЭксплуатации
	|			ТОГДА СписаниеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ СписаниеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|	КОНЕЦ,
	|	СписаниеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл,
	//---
	|	СписаниеЗапасовЗапасы.НоменклатураОприходование,
	|	СписаниеЗапасовЗапасы.СтранаПроисхожденияОприходование,
	|	СписаниеЗапасовЗапасы.НомерГТДОприходование,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА СписаниеЗапасовЗапасы.ХарактеристикаОприходование
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 07.09.2021 {
	|	ВЫБОР 
	|		КОГДА СписаниеЗапасовЗапасы.ПроектОприходование = Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА Значение(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ СписаниеЗапасовЗапасы.ПроектОприходование
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 07.09.2021 }
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА СписаниеЗапасовЗапасы.ПартияОприходование
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СписаниеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА СписаниеЗапасовЗапасы.Количество
	|		ИНАЧЕ СписаниеЗапасовЗапасы.Количество * СписаниеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ,
	|	СписаниеЗапасовЗапасы.Сумма,
	|	ВЫБОР
	|		КОГДА СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СписатьЗапасыИзЭксплуатации
	|			ТОГДА СписаниеЗапасовЗапасы.НоменклатураОприходование.СчетУчетаЗапасов
	|		ИНАЧЕ СписаниеЗапасовЗапасы.НоменклатураОприходование.СчетУчетаЗатрат
	|	КОНЕЦ,
	|	СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияОприходование,
	//+++
	|	ВЫБОР
	|		КОГДА СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				ИЛИ СписаниеЗапасовЗапасы.Ссылка.СписатьЗапасыИзЭксплуатации
	|			ТОГДА СписаниеЗапасовЗапасы.НоменклатураОприходование.СчетУчетаЗапасовРегл
	|		ИНАЧЕ СписаниеЗапасовЗапасы.НоменклатураОприходование.СчетУчетаЗатратРегл
	|	КОНЕЦ,
	|	СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияОприходованиеРегл,
	//---
	|	&ОприходованиеЗапасов,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЛОЖЬ,
	|	NULL,
	|	NULL,
	//ПодольскийАИ #УчетПроектов 07.09.2021 {
	|	Значение(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 07.09.2021 }
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СписаниеЗапасовЗапасы.Ссылка.ПриходоватьТоварыПоСебестоимостиСписания
	|ИЗ
	|	Документ.ПересортицаЗапасов.Запасы КАК СписаниеЗапасовЗапасы
	|ГДЕ
	|	СписаниеЗапасовЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаЗапасы.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СценарийПланирования КАК СценарийПланирования,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	//+++
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	//---
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	//ПодольскийАИ #УчетПроектов 07.09.2021 {
	|	ТаблицаЗапасы.Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 07.09.2021 }
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.Списание
	|				И НЕ ТаблицаЗапасы.ПриходоватьТоварыПоСебестоимостиСписания
	|			ТОГДА ТаблицаЗапасы.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ПересортицаЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ДокументПродажи,
	|	ТаблицаЗапасы.СчетДт КАК СчетДт,
	|	ТаблицаЗапасы.СчетКт КАК СчетКт,
	//+++
	|	ТаблицаЗапасы.СчетДтРегл КАК СчетДтРегл,
	|	ТаблицаЗапасы.СчетКтРегл КАК СчетКтРегл,
	//---
	|	ТаблицаЗапасы.СодержаниеПроводки КАК СодержаниеПроводки,
	|	ТаблицаЗапасы.СодержаниеПроводки КАК Содержание,
	|	СУММА(ТаблицаЗапасы.Количество) КАК Количество,
	|	СУММА(ТаблицаЗапасы.Сумма) КАК Сумма,
	|	ТаблицаЗапасы.Списание,
	|	ТаблицаЗапасы.СуммаОприходование,
	|	ТаблицаЗапасы.СчетДтОприходование,
	|	ТаблицаЗапасы.СчетКтОприходование,
	//+++
	|	ТаблицаЗапасы.СчетДтОприходованиеРегл,
	|	ТаблицаЗапасы.СчетКтОприходованиеРегл,
	//---
	|	0 КАК СуммаПриход,
	|	0 КАК СуммаРасход,
	|	ТаблицаЗапасы.НоменклатураОприходование,
	|	ТаблицаЗапасы.ХарактеристикаОприходование,
	//ПодольскийАИ #УчетПроектов 07.09.2021 {
	|	ТаблицаЗапасы.ПроектОприходование,
	//ПодольскийАИ #УчетПроектов 07.09.2021 }
	|	ТаблицаЗапасы.ПартияОприходование,
	|	ТаблицаЗапасы.СчетУчетаОприходование,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка) КАК КоррСчетУчета,
	//+++
	|	ТаблицаЗапасы.СчетУчетаОприходованиеРегл,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК КоррСчетУчетаРегл,
	|	ТаблицаЗапасы.Ссылка.ПодразделениеДляПроводок КАК Подразделение,
	//---
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК КоррНоменклатура,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК КоррПартия,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК КоррХарактеристика,
	//ПодольскийАИ #УчетПроектов 07.09.2021 {
	|	Значение(Справочник.Проекты.БезПроекта) КАК КоррПроект,
	//ПодольскийАИ #УчетПроектов 07.09.2021 }
	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СодержаниеПроводкиОприходование,
	|	ЛОЖЬ КАК ФиксированнаяСтоимость
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.Списание
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.ВидДвижения,
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СценарийПланирования,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл,//+++
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	//ПодольскийАИ #УчетПроектов 07.09.2021 {
	|	ТаблицаЗапасы.Проект,
	//ПодольскийАИ #УчетПроектов 07.09.2021 }
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.СодержаниеПроводки,
	|	ТаблицаЗапасы.СчетДт,
	|	ТаблицаЗапасы.СчетКт,
	//+++
	|	ТаблицаЗапасы.СчетДтРегл,
	|	ТаблицаЗапасы.СчетКтРегл,
	|	ТаблицаЗапасы.Ссылка.ПодразделениеДляПроводок,
	|	ТаблицаЗапасы.СчетУчетаЗатратРегл,
	//---
	|	ТаблицаЗапасы.Списание,
	|	ТаблицаЗапасы.СуммаОприходование,
	|	ТаблицаЗапасы.СчетДтОприходование,
	|	ТаблицаЗапасы.СчетКтОприходование,
	//+++
	|	ТаблицаЗапасы.СчетДтОприходованиеРегл,
	|	ТаблицаЗапасы.СчетКтОприходованиеРегл,
	//---
	|	ТаблицаЗапасы.НоменклатураОприходование,
	|	ТаблицаЗапасы.ХарактеристикаОприходование,
	//ПодольскийАИ #УчетПроектов 07.09.2021 {
	|	ТаблицаЗапасы.ПроектОприходование,
	//ПодольскийАИ #УчетПроектов 07.09.2021 }
	|	ТаблицаЗапасы.ПартияОприходование,
	|	ТаблицаЗапасы.СчетУчетаОприходование,
	|	ТаблицаЗапасы.СчетУчетаОприходованиеРегл, //+++
	|	ТаблицаЗапасы.СодержаниеПроводкиОприходование,
	//ПодольскийАИ #УчетПроектов 07.09.2021 {
	|	Значение(Справочник.Проекты.БезПроекта),
	//ПодольскийАИ #УчетПроектов 07.09.2021 }
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.Списание
	|				И НЕ ТаблицаЗапасы.ПриходоватьТоварыПоСебестоимостиСписания
	|			ТОГДА ТаблицаЗапасы.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ПересортицаЗапасов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаЗапасы.СодержаниеПроводки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	ТаблицаЗапасы.Списание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗапасы.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Ячейка КАК Ячейка,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	//ПодольскийАИ #УчетПроектов 07.09.2021 {
	|	ТаблицаЗапасы.Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 07.09.2021 }
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.Количество КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ОрдерныйСклад = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗапасы.ВидДвиженияОрдерныйСклад КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	//ПодольскийАИ #УчетПроектов 07.09.2021 {
	|	ТаблицаЗапасы.Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 07.09.2021 }
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.Количество КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ОрдерныйСклад = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапасы.Ссылка.Дата КАК Период,
	|	ТаблицаЗапасы.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК ДатаСобытия,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Расход) КАК Операция,
	|	ТаблицаСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	&Организация КАК Организация,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Ячейка КАК Ячейка,
	|	1 КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПересортицаЗапасов.СерийныеНомера КАК ТаблицаСерийныеНомера
	|		ПО ТаблицаЗапасы.Ссылка = ТаблицаСерийныеНомера.Ссылка
	|			И ТаблицаЗапасы.КлючСвязи = ТаблицаСерийныеНомера.КлючСвязи
	|ГДЕ
	|	ТаблицаСерийныеНомера.Ссылка = &Ссылка
	|	И ТаблицаЗапасы.Ссылка = &Ссылка
	|	И &ИспользоватьСерийныеНомера
	|	И НЕ ТаблицаЗапасы.ОрдерныйСклад
	|	И ТаблицаЗапасы.Списание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаЗапасы.Ссылка.Дата,
	|	ТаблицаЗапасы.ВидДвижения,
	|	ТаблицаЗапасы.Период,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Приход),
	|	ПересортицаЗапасовСерийныеНомераОприходование.СерийныйНомер,
	|	&Организация,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Ячейка,
	|	1
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПересортицаЗапасов.СерийныеНомераОприходование КАК ПересортицаЗапасовСерийныеНомераОприходование
	|		ПО ТаблицаЗапасы.Ссылка = ПересортицаЗапасовСерийныеНомераОприходование.Ссылка
	|			И ТаблицаЗапасы.КлючСвязи = ПересортицаЗапасовСерийныеНомераОприходование.КлючСвязи
	|ГДЕ
	|	ПересортицаЗапасовСерийныеНомераОприходование.Ссылка = &Ссылка
	|	И ТаблицаЗапасы.Ссылка = &Ссылка
	|	И &ИспользоватьСерийныеНомера
	|	И НЕ ТаблицаЗапасы.ОрдерныйСклад
	|	И НЕ ТаблицаЗапасы.Списание";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСписаниеЗапасов);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("УчетПоЯчейкам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоЯчейкам);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	
	Запрос.УстановитьПараметр("ИспользоватьСерийныеНомера", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьСерийныеНомера);
	
	Запрос.УстановитьПараметр("СписаниеЗапасов", НСтр("ka='მარაგების ჩამოწერა';ru='Списание запасов';en='Write-off stocks'"));
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='მარაგების შემოსავალში აყვანა';ru='Оприходование запасов';en='Posting of Goods'"));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", МассивРезультатов[1].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", МассивРезультатов[2].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыКРасходуСоСкладов", МассивРезультатов[3].Выгрузить());
	
	// Серийные номера
	РезультатЗапроса4 = МассивРезультатов[4].Выгрузить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", РезультатЗапроса4);
	Если СтруктураДополнительныеСвойства.УчетнаяПолитика.ОстаткиСерийныхНомеров Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", РезультатЗапроса4);
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", Новый ТаблицаЗначений);
	КонецЕсли;
	
	// Сформируем путую таблицу проводок.
	УправлениеНебольшойФирмойСервер.СформироватьТаблицуПроводок(ДокументСсылкаСписаниеЗапасов, СтруктураДополнительныеСвойства);
	//ПодольскийАИ #УчетПроектов 08.09.2021 {
	Если СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам Тогда
		Если СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Найти("Проект") = Неопределено Тогда
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("Проект");
		КонецЕсли;
		Если СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Найти("ПроектОприходование") = Неопределено Тогда
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("ПроектОприходование");
		КонецЕсли;
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 08.09.2021 }
	
	// Расчет стоимости списания запасов.
	СформироватьТаблицаЗапасы(ДокументСсылкаСписаниеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыВРазрезеГТД(СтруктураДополнительныеСвойства);
	
	МассивСчетовФинРезРасходы = РегламентированныйУчетСервер.ПолучитьСчетаФинРезРасход();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СписаниеЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	&Сумма КАК СуммаРасходов,
	|	&Сумма КАК Сумма,
	|	СписаниеЗапасовЗапасы.Ссылка.Корреспонденция КАК СчетУчета,
	|	СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияРегл КАК СчетУчетаРегл, //+++
	|	СписаниеЗапасовЗапасы.Номенклатура КАК Аналитика,
	|	&ПоступлениеРасходов КАК СодержаниеПроводки,
	|	0 КАК СуммаДоходов
	|ИЗ
	|	Документ.ПересортицаЗапасов.Запасы КАК СписаниеЗапасовЗапасы
	|ГДЕ
	|	СписаниеЗапасовЗапасы.Ссылка = &Ссылка
	|	И &Сумма > 0
	|	И (ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|		ИНАЧЕ СписаниеЗапасовЗапасы.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|	КОНЕЦ ИЛИ СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияРегл В (&СчетаФинРезРасходы))
	|	И НЕ &ПриходоватьТоварыПоСебестоимостиСписания
	|
	|СГРУППИРОВАТЬ ПО
	|	СписаниеЗапасовЗапасы.Ссылка,
	|	СписаниеЗапасовЗапасы.Ссылка.Дата,
	|	СписаниеЗапасовЗапасы.Ссылка.Корреспонденция,
	|	СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияРегл,
	|	СписаниеЗапасовЗапасы.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеЗапасовЗапасы.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	0,
	|	&СуммаОприходование,
	|	СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияОприходование,
	|	СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияОприходованиеРегл, //+++
	|	СписаниеЗапасовЗапасы.НоменклатураОприходование,
	|	&ПоступлениеДоходов,
	|	&СуммаОприходование
	|ИЗ
	|	Документ.ПересортицаЗапасов.Запасы КАК СписаниеЗапасовЗапасы
	|ГДЕ
	|	СписаниеЗапасовЗапасы.Ссылка = &Ссылка
	|	И &СуммаОприходование > 0
	|	И (ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияОприходованиеРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|		ИНАЧЕ СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияОприходование.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|	КОНЕЦ
	|		ИЛИ СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияОприходованиеРегл В (&СчетаФинРезРасходы))
	|	И НЕ &ПриходоватьТоварыПоСебестоимостиСписания
	|
	|СГРУППИРОВАТЬ ПО
	|	СписаниеЗапасовЗапасы.Ссылка,
	|	СписаниеЗапасовЗапасы.Ссылка.Дата,
	|	СписаниеЗапасовЗапасы.НоменклатураОприходование,
	|	СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияОприходование,
	|	СписаниеЗапасовЗапасы.Ссылка.КорреспонденцияОприходованиеРегл");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСписаниеЗапасов);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Запрос.УстановитьПараметр("Сумма", СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Итог("СуммаРасход"));
	Запрос.УстановитьПараметр("СуммаОприходование", СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Итог("СуммаПриход"));
	Запрос.УстановитьПараметр("ПриходоватьТоварыПоСебестоимостиСписания", ДокументСсылкаСписаниеЗапасов.ПриходоватьТоварыПоСебестоимостиСписания);
	Запрос.УстановитьПараметр("СчетаФинРезРасходы", МассивСчетовФинРезРасходы);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(ДокументСсылкаСписаниеЗапасов.Дата),ДокументСсылкаСписаниеЗапасов.Дата,ТекущаяДата())));

	Запрос.УстановитьПараметр("ПоступлениеРасходов", НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'"));
	Запрос.УстановитьПараметр("ПоступлениеДоходов", НСтр("ka='სხვა შემოსავლების შემოსვლა';ru='Поступление прочих доходов';en='Receipt of other income'"));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", МассивРезультатов[0].Выгрузить());

КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаСписаниеЗапасов, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	// Kuzmich, 25.07.2019, Контролировать остатки запасов на складах при проведении документов
	Если Константы.КонтролироватьОстаткиЗапасовНаСкладахПриПроведении.Получить() Тогда
		
		Результат = УправлениеНебольшойФирмойСервер.ЗапросОтрицательныхОстатковЗапасовНаСкладахПриПроведенииДокумента(ДокументСсылкаСписаниеЗапасов);
		
		Если НЕ Результат.Пустой() Тогда
			ДокументСсылкаСписаниеЗапасов_Объект = ДокументСсылкаСписаниеЗапасов.ПолучитьОбъект();
			ВыборкаИзРезультатаЗапроса = Результат.Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладах(ДокументСсылкаСписаниеЗапасов_Объект, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;			
		
	КонецЕсли;
	// Kuzmich, 25.07.2019, Контролировать остатки запасов на складах при проведении документов
	
	Если Не УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияЗапасыНаСкладахИзменение", "ДвиженияЗапасыИзменение"
	// содержат записи, необходимо выполнить контроль реализации товаров.
	Если СтруктураВременныеТаблицы.ДвиженияЗапасыНаСкладахИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыВРазрезеГТДИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияСерийныеНомераИзменение
		Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияЗапасыНаСкладахИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Характеристика) КАК ХарактеристикаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Партия) КАК ПартияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Ячейка) КАК ЯчейкаПредставление,
		|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыНаСкладахИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыНаСкладах,
		|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
		|ИЗ
		|	ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|				&МоментКонтроля,
		|				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия, Ячейка) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыНаСкладахИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|						ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыНаСкладахИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыНаСкладахИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыНаСкладахИзменение.Ячейка КАК Ячейка
		|					ИЗ
		|						ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение)) КАК ЗапасыНаСкладахОстатки
		|		ПО ДвиженияЗапасыНаСкладахИзменение.Организация = ЗапасыНаСкладахОстатки.Организация
		|			И ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница = ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница
		|			И ДвиженияЗапасыНаСкладахИзменение.Номенклатура = ЗапасыНаСкладахОстатки.Номенклатура
		|			И ДвиженияЗапасыНаСкладахИзменение.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
		|			И ДвиженияЗапасыНаСкладахИзменение.Партия = ЗапасыНаСкладахОстатки.Партия
		|			И ДвиженияЗапасыНаСкладахИзменение.Ячейка = ЗапасыНаСкладахОстатки.Ячейка
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.СчетУчета) КАК СчетУчетаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Характеристика) КАК ХарактеристикаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Партия) КАК ПартияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.ЗаказПокупателя) КАК ЗаказПокупателяПредставление,
		|	ЗапасыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) КАК СуммаОстатокЗапасы
		|ИЗ
		|	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
		|				&МоментКонтроля,
		|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|						ДвиженияЗапасыИзменение.СчетУчета КАК СчетУчета,
		|						ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателя
		|					ИЗ
		|						ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение)) КАК ЗапасыОстатки
		|		ПО ДвиженияЗапасыИзменение.Организация = ЗапасыОстатки.Организация
		|			И ДвиженияЗапасыИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
		|			И ДвиженияЗапасыИзменение.СчетУчета = ЗапасыОстатки.СчетУчета
		|			И ДвиженияЗапасыИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
		|			И ДвиженияЗапасыИзменение.Характеристика = ЗапасыОстатки.Характеристика
		|			И ДвиженияЗапасыИзменение.Партия = ЗапасыОстатки.Партия
		|			И ДвиженияЗапасыИзменение.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияСерийныеНомераИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияСерийныеНомераИзменение.СерийныйНомер КАК СерийныйНомерПредставление,
		|	ДвиженияСерийныеНомераИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		|	ДвиженияСерийныеНомераИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияСерийныеНомераИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ДвиженияСерийныеНомераИзменение.Партия КАК ПартияПредставление,
		|	ДвиженияСерийныеНомераИзменение.Ячейка КАК ЯчейкаПредставление,
		|	СерийныеНомераОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	СерийныеНомераОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияСерийныеНомераИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(СерийныеНомераОстатки.КоличествоОстаток, 0) КАК ОстатокСерийныеНомера,
		|	ЕСТЬNULL(СерийныеНомераОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокСерийныеНомера
		|ИЗ
		|	ДвиженияСерийныеНомераИзменение КАК ДвиженияСерийныеНомераИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СерийныеНомера.Остатки(&МоментКонтроля, ) КАК СерийныеНомераОстатки
		|		ПО ДвиженияСерийныеНомераИзменение.СтруктурнаяЕдиница = СерийныеНомераОстатки.СтруктурнаяЕдиница
		|			И ДвиженияСерийныеНомераИзменение.Номенклатура = СерийныеНомераОстатки.Номенклатура
		|			И ДвиженияСерийныеНомераИзменение.Характеристика = СерийныеНомераОстатки.Характеристика
		|			И ДвиженияСерийныеНомераИзменение.Партия = СерийныеНомераОстатки.Партия
		|			И ДвиженияСерийныеНомераИзменение.СерийныйНомер = СерийныеНомераОстатки.СерийныйНомер
		|			И ДвиженияСерийныеНомераИзменение.Ячейка = СерийныеНомераОстатки.Ячейка
		|			И (ЕСТЬNULL(СерийныеНомераОстатки.КоличествоОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыВРазрезеГТДИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД) КАК НомерГТДПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика) КАК ХарактеристикаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Партия) КАК ПартияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения) КАК СтранаПроисхожденияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыВРазрезеГТДОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыВРазрезеГТДИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыВРазрезеГТД,
		|	ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыВРазрезеГТД
		|ИЗ
		|	ДвиженияЗапасыВРазрезеГТДИзменение КАК ДвиженияЗапасыВРазрезеГТДИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыВРазрезеГТД.Остатки(
		|				&МоментКонтроля,
		|				(Организация, НомерГТД, Номенклатура, Характеристика, Партия, СтранаПроисхождения) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД КАК НомерГТД,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения КАК СтранаПроисхождения
		|					ИЗ
		|						ДвиженияЗапасыВРазрезеГТДИзменение КАК ДвиженияЗапасыВРазрезеГТДИзменение)) КАК ЗапасыВРазрезеГТДОстатки
		|		ПО ДвиженияЗапасыВРазрезеГТДИзменение.Организация = ЗапасыВРазрезеГТДОстатки.Организация
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД = ЗапасыВРазрезеГТДОстатки.НомерГТД
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура = ЗапасыВРазрезеГТДОстатки.Номенклатура
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика = ЗапасыВРазрезеГТДОстатки.Характеристика
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Партия = ЗапасыВРазрезеГТДОстатки.Партия
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения = ЗапасыВРазрезеГТДОстатки.СтранаПроисхождения
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасы.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.СчетУчета) КАК СчетУчетаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.Характеристика) КАК ХарактеристикаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.Партия) КАК ПартияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.ЗаказПокупателя) КАК ЗаказПокупателяПредставление,
		|	ДвиженияЗапасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ДвиженияЗапасы.Сумма КАК СуммаОстатокЗапасы
		|ИЗ
		|	РегистрНакопления.Запасы КАК ДвиженияЗапасы
		|ГДЕ
		|	ДвиженияЗапасы.Регистратор = &Ссылка
		|	И ЕСТЬNULL(ДвиженияЗапасы.Сумма, 0) <= 0
		|	И &ПриходоватьТоварыПоСебестоимостиСписания
		|	И ДвиженияЗапасы.ВидДвижения = Значение(ВидДвиженияНакопления.Приход)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		//+++ Дмгг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.СчетУчетаРегл) КАК СчетУчетаРеглПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Характеристика) КАК ХарактеристикаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Партия) КАК ПартияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.ЗаказПокупателя) КАК ЗаказПокупателяПредставление,
		|	ЗапасыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) КАК СуммаОстатокЗапасы
		|ИЗ
		|	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
		|				&МоментКонтроля,
		|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|						ДвиженияЗапасыИзменение.СчетУчетаРегл КАК СчетУчетаРегл,
		|						ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателя
		|					ИЗ
		|						ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение)) КАК ЗапасыОстатки
		|		ПО ДвиженияЗапасыИзменение.Организация = ЗапасыОстатки.Организация
		|			И ДвиженияЗапасыИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
		|			И ДвиженияЗапасыИзменение.СчетУчетаРегл = ЗапасыОстатки.СчетУчетаРегл
		|			И ДвиженияЗапасыИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
		|			И ДвиженияЗапасыИзменение.Характеристика = ЗапасыОстатки.Характеристика
		|			И ДвиженияЗапасыИзменение.Партия = ЗапасыОстатки.Партия
		|			И ДвиженияЗапасыИзменение.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасы.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.СчетУчетаРегл) КАК СчетУчетаРеглПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.Характеристика) КАК ХарактеристикаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.Партия) КАК ПартияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.ЗаказПокупателя) КАК ЗаказПокупателяПредставление,
		|	ДвиженияЗапасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасы.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ДвиженияЗапасы.Сумма КАК СуммаОстатокЗапасы
		|ИЗ
		|	РегистрНакопления.Запасы КАК ДвиженияЗапасы
		|ГДЕ
		|	ДвиженияЗапасы.Регистратор = &Ссылка
		|	И ЕСТЬNULL(ДвиженияЗапасы.Сумма, 0) <= 0
		|	И &ПриходоватьТоварыПоСебестоимостиСписания
		|	И ДвиженияЗапасы.ВидДвижения = Значение(ВидДвиженияНакопления.Приход)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		//--- Дмгг
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		Запрос.УстановитьПараметр("ПриходоватьТоварыПоСебестоимостиСписания", ДокументСсылкаСписаниеЗапасов.ПриходоватьТоварыПоСебестоимостиСписания);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСписаниеЗапасов);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Если НЕ МассивРезультатов[0].Пустой()
			ИЛИ НЕ МассивРезультатов[1].Пустой()
			ИЛИ НЕ МассивРезультатов[2].Пустой()
			ИЛИ НЕ МассивРезультатов[3].Пустой()
			ИЛИ НЕ МассивРезультатов[5].Пустой() //+++ Дмгг
			Тогда
			
			ДокументОбъектСписаниеЗапасов = ДокументСсылкаСписаниеЗапасов.ПолучитьОбъект()
			
		КонецЕсли;
		
		// Отрицательный остаток запасов на складе.
		Если НЕ МассивРезультатов[0].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[0].Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладах(ДокументОбъектСписаниеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
		// Отрицательный остаток учета запасов и затрат.
		Если НЕ ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов Тогда //+++ Дмгг
			Если НЕ МассивРезультатов[1].Пустой() Тогда
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[1].Выбрать();
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументОбъектСписаниеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
			КонецЕсли;
		//+++ Дмгг
		Иначе
			Если НЕ МассивРезультатов[5].Пустой() Тогда
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[5].Выбрать();
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументОбъектСписаниеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
			КонецЕсли;
		КонецЕсли;
		//--- Дмгг
		
		// Отрицательный остаток учета серийных номеров.
		Если НЕ МассивРезультатов[2].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[2].Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструСерийныеНомера(ДокументОбъектСписаниеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
		// Отрицательный остаток по остаткам запасов в разрезе номеров ГТД.
		Если Константы.КонтролироватьОстаткиПоНомерамГТД.Получить()
			И НЕ МассивРезультатов[3].Пустой() Тогда
			
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[3].Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыВРазрезеГТД(ДокументОбъектСписаниеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
		// Оприходование товаров с нулевой стоимостью.
		Если НЕ ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов Тогда //+++ Дмгг
			Если НЕ МассивРезультатов[4].Пустой() Тогда
				
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[4].Выбрать();
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыОприходование(ДокументОбъектСписаниеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
				
			КонецЕсли;
		//+++ Дмгг
		Иначе
			Если НЕ МассивРезультатов[6].Пустой() Тогда
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[6].Выбрать();
				//ПодольскийАИ #ОшибкаКонтроля 13.09.2021 {
				//Было---
				//УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументОбъектСписаниеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
				//Стало+++
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыОприходование(ДокументОбъектСписаниеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
				//ПодольскийАИ #ОшибкаКонтроля 13.09.2021 }
			КонецЕсли;
		КонецЕсли;
		//--- Дмгг
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтроль()

#Область ИнтерфейсПечати

Процедура СформироватьАктПересортицыТоваров(ТабДокумент, ТекущийДокумент)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДопКолонка = "Артикул";
	ВыводитьДопКолонку = Константы.АртикулНоменклатурыВСодержание.Получить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК Дата,
	|	Документ.СтруктурнаяЕдиница КАК Склад,
	|	Документ.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(Документ.СтруктурнаяЕдиница) КАК СкладПредставление,
	|	Документ.Организация.Префикс КАК Префикс,
	|	Документ.Автор КАК Ответственный,
	|	Документ.ДокументОснование КАК ДокументОснование,
	|	ПРЕДСТАВЛЕНИЕ(Документ.ДокументОснование) КАК ОснованиеПредставление
	|ИЗ
	|	Документ.ПересортицаЗапасов КАК Документ
	|ГДЕ
	|	Документ.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Номенклатура КАК НоменклатураСписание,
	|	ТаблицаТовары.Номенклатура.НаименованиеПолное КАК НоменклатураСписаниеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаТовары.Характеристика) КАК ХарактеристикаСписаниеПредставление,
	|	ТаблицаТовары.Номенклатура." + ДопКолонка +" КАК ДопКолонкаСписание,
	|	ТаблицаТовары.НоменклатураОприходование КАК НоменклатураОприходование,
	|	ТаблицаТовары.НоменклатураОприходование." + ДопКолонка +" КАК ДопКолонкаОприходование,
	|	ТаблицаТовары.НоменклатураОприходование.НаименованиеПолное КАК НоменклатураОприходованиеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаТовары.ХарактеристикаОприходование) КАК ХарактеристикаОприходованиеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияСписаниеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаТовары.НоменклатураОприходование.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияОприходованиеПредставление,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.Ссылка КАК Ссылка,
	|	ТаблицаТовары.КлючСвязи КАК КлючСвязи
	|ИЗ
	|	Документ.ПересортицаЗапасов.Запасы КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СерийныеНомера.НомерСтроки КАК НомерСтроки,
	|	СерийныеНомера.Ссылка КАК Ссылка,
	|	СерийныеНомера.СерийныйНомер,
	|	СерийныеНомера.КлючСвязи
	|ИЗ
	|	Документ.ПересортицаЗапасов.СерийныеНомера КАК СерийныеНомера
	|ГДЕ
	|	СерийныеНомера.Ссылка = &ТекущийДокумент
	|	И СерийныеНомера.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СерийныеНомераОприходование.НомерСтроки КАК НомерСтроки,
	|	СерийныеНомераОприходование.Ссылка КАК Ссылка,
	|	СерийныеНомераОприходование.СерийныйНомер,
	|	СерийныеНомераОприходование.КлючСвязи
	|ИЗ
	|	Документ.ПересортицаЗапасов.СерийныеНомераОприходование КАК СерийныеНомераОприходование
	|ГДЕ
	|	СерийныеНомераОприходование.Ссылка = &ТекущийДокумент
	|	И СерийныеНомераОприходование.Ссылка.Проведен";

	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	СинонимДокумента = НСтр("ka='Акт о пересортице товаров';ru='Акт о пересортице товаров';en='Act on the regrading of the goods'");

	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПересортицаЗапасов_АктОПересортицеТоваров";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПересортицаЗапасов.ПФ_MXL_АктОПересортицеТоваров");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьОснование  = Макет.ПолучитьОбласть("Основание");

	ОбластьНомераШапка              = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьКодовСписаниеШапка       = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодовСписание");
	ОбластьКодовОприходованиеШапка  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодовОприходование");
	ОбластьТоварСписаниеШапка       = Макет.ПолучитьОбласть("ШапкаТаблицы|ТоварСписание");
	ОбластьТоварОприходованиеШапка  = Макет.ПолучитьОбласть("ШапкаТаблицы|ТоварОприходование");
	ОбластьЕдиницаСписаниеШапка       = Макет.ПолучитьОбласть("ШапкаТаблицы|ЕдиницаИзмеренияСписание");
	ОбластьЕдиницаОприходованиеШапка  = Макет.ПолучитьОбласть("ШапкаТаблицы|ЕдиницаИзмеренияОприходование");
	ОбластьДанныеШапка              = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");

	Если Не ВыводитьДопКолонку Тогда

		Макет.Область("ТоварСписание").ШиринаКолонки = Макет.Область("ТоварСписание").ШиринаКолонки
				+ Макет.Область("КолонкаКодовСписание").ШиринаКолонки;
		Макет.Область("ТоварОприходование").ШиринаКолонки = Макет.Область("ТоварОприходование").ШиринаКолонки
				+ Макет.Область("КолонкаКодовОприходование").ШиринаКолонки;

	КонецЕсли;

	ОбластьНомераСтрока              = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ОбластьКодовСписаниеСтрока       = Макет.ПолучитьОбласть("Строка|КолонкаКодовСписание");
	ОбластьКодовОприходованиеСтрока  = Макет.ПолучитьОбласть("Строка|КолонкаКодовОприходование");
	ОбластьТоварСписаниеСтрока       = Макет.ПолучитьОбласть("Строка|ТоварСписание");
	ОбластьТоварОприходованиеСтрока  = Макет.ПолучитьОбласть("Строка|ТоварОприходование");
	ОбластьЕдиницаСписаниеСтрока       = Макет.ПолучитьОбласть("Строка|ЕдиницаИзмеренияСписание");
	ОбластьЕдиницаОприходованиеСтрока  = Макет.ПолучитьОбласть("Строка|ЕдиницаИзмеренияОприходование");
	ОбластьДанныхСтрока              = Макет.ПолучитьОбласть("Строка|Данные");

	ОбластьПодвалТаблицы  = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьПодписи        = Макет.ПолучитьОбласть("Подписи");
	ОбластьСуммаПрописью  = Макет.ПолучитьОбласть("СуммаПрописью");
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДокументы = РезультатыЗапроса[0].Выбрать();
	ВыборкаПоТабличнымЧастям = РезультатыЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСтрокСерийныеНомера = РезультатыЗапроса[2].Выбрать();
	ВыборкаСтрокСерийныеНомераОприходование = РезультатыЗапроса[3].Выбрать();
	
	ПервыйДокумент = Истина;
	Пока ВыборкаДокументы.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		// Выводим шапку накладной.
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаДокументы);
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументы);
		
		НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(РеквизитыДокумента.Дата, РеквизитыДокумента.Номер, РеквизитыДокумента.Префикс);
		
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = "Пересортица запасов № "
											+ НомерДокумента
											+ " от "
											+ Формат(РеквизитыДокумента.Дата, "ДЛФ=DD");
		
		ОрганизацияПредставление = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ВыборкаДокументы.Организация, ВыборкаДокументы.Дата), "ПолноеНаименование,");
		
		ОбластьЗаголовок.Параметры.ОрганизацияПредставление = ОрганизацияПредставление;
		
		ТабДокумент.Вывести(ОбластьЗаголовок);

		Если ЗначениеЗаполнено(ВыборкаДокументы.ДокументОснование) Тогда
			ОбластьОснование.Параметры.ОснованиеПредставление = ВыборкаДокументы.ОснованиеПредставление;
			ТабДокумент.Вывести(ОбластьОснование);
		КонецЕсли;

		// Вывод шапки.
		ТабДокумент.Вывести(ОбластьНомераШапка);

		Если ВыводитьДопКолонку Тогда

			ТабДокумент.Присоединить(ОбластьКодовСписаниеШапка);

		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьТоварСписаниеШапка);
		ТабДокумент.Присоединить(ОбластьЕдиницаСписаниеШапка);
		
		Если ВыводитьДопКолонку Тогда

			ТабДокумент.Присоединить(ОбластьКодовОприходованиеШапка);

		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьТоварОприходованиеШапка);
	  	ТабДокумент.Присоединить(ОбластьЕдиницаОприходованиеШапка);

		ТабДокумент.Присоединить(ОбластьДанныеШапка);

		СуммаВсего = 0;
		ВсегоНаименований = 0;

		// Вывод строк.
		ВыборкаПоТабличнымЧастям.НайтиСледующий(Новый Структура("Ссылка",ВыборкаДокументы.Ссылка));
		
		ВыборкаПоСтрокам = ВыборкаПоТабличнымЧастям.Выбрать();
		
		Если ВыборкаПоТабличнымЧастям.Количество() > 0 Тогда
			Пока ВыборкаПоСтрокам.Следующий() Цикл

				ОбластьНомераСтрока.Параметры.Заполнить(ВыборкаПоСтрокам);
				ТабДокумент.Вывести(ОбластьНомераСтрока);

				Если ВыводитьДопКолонку Тогда

					ОбластьКодовСписаниеСтрока.Параметры.Заполнить(ВыборкаПоСтрокам);
					ТабДокумент.Присоединить(ОбластьКодовСписаниеСтрока);

				КонецЕсли;

				// Номенклатура.
				ОбластьТоварСписаниеСтрока.Параметры.НоменклатураСписание = ВыборкаПоСтрокам.НоменклатураСписание;
				
				//ФормированиеПечатныхФормСервер.ПолучитьПредставлениеНоменклатурыДляПечати(
				//		ВыборкаПоСтрокам.НоменклатураСписаниеПредставление,
				//		ВыборкаПоСтрокам.ХарактеристикаСписаниеПредставление);
						
				СтрокаСерийныеНомера = РаботаССерийнымиНомерами.СтрокаСерийныеНомераИзВыборки(ВыборкаСтрокСерийныеНомера, ВыборкаПоСтрокам.КлючСвязи);
				ОбластьТоварСписаниеСтрока.Параметры.НоменклатураСписаниеПредставление = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(
					ВыборкаПоСтрокам.НоменклатураСписаниеПредставление,
					ВыборкаПоСтрокам.ХарактеристикаСписаниеПредставление,
					, //ВыборкаПоСтрокам.ДопКолонкаСписание,
					СтрокаСерийныеНомера);
				
				ТабДокумент.Присоединить(ОбластьТоварСписаниеСтрока);
				
				ОбластьЕдиницаСписаниеСтрока.Параметры.Заполнить(ВыборкаПоСтрокам);
				ТабДокумент.Присоединить(ОбластьЕдиницаСписаниеСтрока);
				
				
				Если ВыводитьДопКолонку Тогда

					ОбластьКодовОприходованиеСтрока.Параметры.Заполнить(ВыборкаПоСтрокам);
					ТабДокумент.Присоединить(ОбластьКодовОприходованиеСтрока);

				КонецЕсли;

				// Номенклатура.
				СтрокаСерийныеНомера = РаботаССерийнымиНомерами.СтрокаСерийныеНомераИзВыборки(ВыборкаСтрокСерийныеНомераОприходование, ВыборкаПоСтрокам.КлючСвязи);
				ОбластьТоварОприходованиеСтрока.Параметры.НоменклатураОприходование = ВыборкаПоСтрокам.НоменклатураОприходование;
				ОбластьТоварОприходованиеСтрока.Параметры.НоменклатураОприходованиеПредставление = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(
						ВыборкаПоСтрокам.НоменклатураОприходованиеПредставление,
						ВыборкаПоСтрокам.ХарактеристикаОприходованиеПредставление,
						, //ВыборкаПоСтрокам.ДопКолонкаОприходование,
						СтрокаСерийныеНомера
				);
						
						
				ТабДокумент.Присоединить(ОбластьТоварОприходованиеСтрока);
				
				ОбластьЕдиницаОприходованиеСтрока.Параметры.Заполнить(ВыборкаПоСтрокам);
				ТабДокумент.Присоединить(ОбластьЕдиницаОприходованиеСтрока);

				// Данные количестве.
				ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаПоСтрокам);
				
				ТабДокумент.Присоединить(ОбластьДанныхСтрока);

				ВсегоНаименований = ВсегоНаименований + 1;

			КонецЦикла;
			
			// Вывод подвала.
			ТабДокумент.Вывести(ОбластьПодвалТаблицы);
			// Вывод Суммы прописью.
		
		Иначе
			
			// Вывод подвала.
			ТабДокумент.Вывести(ОбластьПодвалТаблицы);
			// Вывод Суммы прописью.
		
			ОбластьНомераСтрокаПусто              = Макет.ПолучитьОбласть("СтрокаПусто|НомерСтроки");
			ОбластьКодовСписаниеСтрокаПусто       = Макет.ПолучитьОбласть("СтрокаПусто|КолонкаКодовСписание");
			ОбластьКодовОприходованиеСтрокаПусто  = Макет.ПолучитьОбласть("СтрокаПусто|КолонкаКодовОприходование");
			ОбластьТоварСписаниеСтрокаПусто       = Макет.ПолучитьОбласть("СтрокаПусто|ТоварСписание");
			ОбластьТоварОприходованиеСтрокаПусто  = Макет.ПолучитьОбласть("СтрокаПусто|ТоварОприходование");
			ОбластьЕдиницаСписаниеСтрокаПусто       = Макет.ПолучитьОбласть("СтрокаПусто|ЕдиницаИзмеренияСписание");
			ОбластьЕдиницаОприходованиеСтрокаПусто  = Макет.ПолучитьОбласть("СтрокаПусто|ЕдиницаИзмеренияОприходование");
			ОбластьДанныхСтрокаПусто              = Макет.ПолучитьОбласть("СтрокаПусто|Данные");
			
			ТабДокумент.Вывести(ОбластьНомераСтрокаПусто);
			Если ВыводитьДопКолонку Тогда
				ТабДокумент.Присоединить(ОбластьКодовСписаниеСтрокаПусто);
			КонецЕсли;
			ТабДокумент.Присоединить(ОбластьТоварСписаниеСтрокаПусто);
			ТабДокумент.Присоединить(ОбластьЕдиницаСписаниеСтрокаПусто);
			Если ВыводитьДопКолонку Тогда
				ТабДокумент.Присоединить(ОбластьКодовОприходованиеСтрокаПусто);
			КонецЕсли;
			ТабДокумент.Присоединить(ОбластьТоварОприходованиеСтрокаПусто);
			ТабДокумент.Присоединить(ОбластьЕдиницаОприходованиеСтрокаПусто);
			ТабДокумент.Присоединить(ОбластьДанныхСтрокаПусто);
			
		КонецЕсли;

		
		ТекстИтоговойСтроки = НСтр("ka='Всего наименований %ВсегоНаименований%';ru='Всего наименований %ВсегоНаименований%';en='Total items VsegoNaimenovany%%'");
		
		ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", ВсегоНаименований);
		
		ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока = ТекстИтоговойСтроки;

		ТабДокумент.Вывести(ОбластьСуммаПрописью);

		// Вывод подписей.
		ОбластьПодписи.Параметры.Ответственный = ВыборкаДокументы.Ответственный; //УправлениеНебольшойФирмойСервер.ДанныеФизЛица(ВыборкаДокументы.Организация, ВыборкаДокументы.Ответственный, ВыборкаДокументы.Дата); //ФормированиеПечатныхФормСервер.ФамилияИнициалыФизЛица(ВыборкаДокументы.Ответственный);
		ТабДокумент.Вывести(ОбластьПодписи);

	КонецЦикла;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПересортицаЗапасов";

	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "АктПересортицыТоваров" Тогда
			
			СформироватьАктПересортицыТоваров(ТабличныйДокумент, ТекущийДокумент);
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПересортицыТоваров") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПересортицыТоваров",
				НСтр("ka='Акт о пересортице товаров';ru='Акт о пересортице товаров';en='Act on the regrading of the goods'"),
				ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "АктПересортицыТоваров")
		);

	КонецЕсли;

	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Акт о пересортице товаров
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктПересортицыТоваров";
	КомандаПечати.Представление = НСтр("ka='Акт о пересортице товаров';ru='Акт о пересортице товаров';en='Act on the regrading of the goods'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли