
Функция AzRy_ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиРегл(МенеджерВременныхТаблиц, СЗачетомАванса, НомерЗапроса, ЭтоВозвратПоставщика = Ложь, ДокументСсылка = Неопределено) Экспорт
	
	//РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаРасчетыСПоставщиками");
	РассчитыватьКурсовыеРазницы = ДокументСсылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено;
	//РассчитыватьКурсовыеРазницы = Ложь;
	
	Если НЕ РассчитыватьКурсовыеРазницы Тогда
		
		Если ЭтоВозвратПоставщика Тогда 
			
			НомерЗапроса = 3;
			
			ТекстЗапроса =
						
			"ВЫБРАТЬ
			|	ВложенныйЗапрос.Документ КАК Документ,
			|	ВложенныйЗапрос.ДокументВалютаДокумента КАК ДокументВалютаДокумента,
			|	ВложенныйЗапрос.ДокументДата КАК ДокументДата,
			|	ВложенныйЗапрос.Курс КАК Курс,
			|	ВложенныйЗапрос.Кратность КАК Кратность
			|ПОМЕСТИТЬ ВременнаяТаблицаКурсовДокументовРасчета
			|ИЗ
			|	(ВЫБРАТЬ
			|		ВременнаяТаблицаРасчетыСПоставщиками.Документ КАК Документ,
			|		ВременнаяТаблицаРасчетыСПоставщиками.Документ.ВалютаДенежныхСредств КАК ДокументВалютаДокумента,
			|		ВременнаяТаблицаРасчетыСПоставщиками.Документ.Дата КАК ДокументДата,
			|		КурсыВалют.Курс КАК Курс,
			|		КурсыВалют.Кратность КАК Кратность
			|	ИЗ
			|		ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблицаРасчетыСПоставщиками
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				КурсыВалют.Валюта КАК Валюта,
			|				МАКСИМУМ(КурсыВалют.Период) КАК Период,
			|				ВременнаяТаблицаРасчетыСПоставщиками.Документ КАК Документ,
			|				ВременнаяТаблицаРасчетыСПоставщиками.Документ.Дата КАК ДокументДата,
			|				ВременнаяТаблицаРасчетыСПоставщиками.Документ.ВалютаДенежныхСредств КАК ДокументВалютаДокумента
			|			ИЗ
			|				ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблицаРасчетыСПоставщиками
			|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
			|					ПО ВременнаяТаблицаРасчетыСПоставщиками.Документ.ВалютаДенежныхСредств = КурсыВалют.Валюта
			|						И ВременнаяТаблицаРасчетыСПоставщиками.Документ.Дата >= КурсыВалют.Период
			|			
			|			СГРУППИРОВАТЬ ПО
			|				КурсыВалют.Валюта,
			|				ВременнаяТаблицаРасчетыСПоставщиками.Документ,
			|				ВременнаяТаблицаРасчетыСПоставщиками.Документ.Дата,
			|				ВременнаяТаблицаРасчетыСПоставщиками.Документ.ВалютаДенежныхСредств) КАК ВложенныйЗапрос
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
			|				ПО ВложенныйЗапрос.Валюта = КурсыВалют.Валюта
			|					И ВложенныйЗапрос.Период = КурсыВалют.Период
			|			ПО ВременнаяТаблицаРасчетыСПоставщиками.Документ.ВалютаДенежныхСредств = ВложенныйЗапрос.Валюта) КАК ВложенныйЗапрос
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыОстатки.Организация КАК Организация,
			|	РасчетыОстатки.Контрагент КАК Контрагент,
			|	РасчетыОстатки.Договор КАК Договор,
			|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
			|	РасчетыОстатки.Документ КАК Документ,
			|	РасчетыОстатки.Заказ КАК Заказ,
			|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
			|	ВЫБОР
			|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
			|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
			|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщикуРегл
			|	КОНЕЦ КАК СчетУчета,
			|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
			|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток,
			|	СУММА(РасчетыОстатки.СуммаДокумента) КАК СуммаДокумента,
			|	СУММА(РасчетыОстатки.СуммаВал) КАК СуммаРасчетов,
			|	СУММА(РасчетыОстатки.Курс) КАК Курс,
			|	РасчетыОстатки.Кратность КАК Кратность
			|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл
			|ИЗ
			|	(ВЫБРАТЬ
			|		1 КАК Порядок,
			|		ВременнаяТаблица.Организация КАК Организация,
			|		ВременнаяТаблица.Контрагент КАК Контрагент,
			|		ВременнаяТаблица.Договор КАК Договор,
			|		ВременнаяТаблица.Документ КАК Документ,
			|		ВременнаяТаблица.Заказ КАК Заказ,
			|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
			|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
			|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток,
			|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаДокумента,
			|		ВременнаяТаблица.СуммаВал КАК СуммаВал,
			|		-КурсыВалютБанковскогоСчета.Курс КАК Курс,
			|		КурсыВалютБанковскогоСчета.Кратность КАК Кратность
			|	ИЗ
			|		ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблица
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютБанковскогоСчета
			|			ПО ВременнаяТаблица.ВалютаДенежныхСредств = КурсыВалютБанковскогоСчета.Валюта
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		2,
			|		ТаблицаОстатки.Организация,
			|		ТаблицаОстатки.Контрагент,
			|		ТаблицаОстатки.Договор,
			|		ТаблицаОстатки.Документ,
			|		ТаблицаОстатки.Заказ,
			|		ТаблицаОстатки.ТипРасчетов,
			|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
			|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0),
			|		0,
			|		0,
			|		ВременнаяТаблицаКурсовДокументовРасчета.Курс,
			|		ВременнаяТаблицаКурсовДокументовРасчета.Кратность
			|	ИЗ
			|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
			|				&МоментВремени2,
			|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ВременнаяТаблицаРасчетыСПоставщиками.Организация,
			|						ВременнаяТаблицаРасчетыСПоставщиками.Контрагент,
			|						ВременнаяТаблицаРасчетыСПоставщиками.Договор,
			|						ВременнаяТаблицаРасчетыСПоставщиками.Документ,
			|						ВременнаяТаблицаРасчетыСПоставщиками.Заказ,
			|						ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов
			|					ИЗ
			|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК ТаблицаОстатки
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсовДокументовРасчета КАК ВременнаяТаблицаКурсовДокументовРасчета
			|			ПО ТаблицаОстатки.Документ = ВременнаяТаблицаКурсовДокументовРасчета.Документ
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблица
			|			ПО ТаблицаОстатки.Документ = ВременнаяТаблица.Документ
			|				И ТаблицаОстатки.Документ = ВременнаяТаблица.Документ
			|				И ТаблицаОстатки.Организация = ВременнаяТаблица.Организация
			|				И ТаблицаОстатки.Контрагент = ВременнаяТаблица.Контрагент
			|				И ТаблицаОстатки.Заказ = ВременнаяТаблица.Заказ
			|				И ТаблицаОстатки.ТипРасчетов = ВременнаяТаблица.ТипРасчетов) КАК РасчетыОстатки
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетыОстатки.Кратность,
			|	РасчетыОстатки.Организация,
			|	РасчетыОстатки.Контрагент,
			|	РасчетыОстатки.Договор,
			|	РасчетыОстатки.Документ,
			|	РасчетыОстатки.Заказ,
			|	РасчетыОстатки.ТипРасчетов,
			|	РасчетыОстатки.Договор.ВалютаРасчетов,
			|	ВЫБОР
			|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
			|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
			|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
			|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
			|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщикуРегл
			|	КОНЕЦ
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Организация,
			|	Контрагент,
			|	Договор,
			|	ВалютаРасчетов,
			|	Документ,
			|	Заказ,
			|	ТипРасчетов,
			|	СчетУчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	1 КАК НомерСтроки,
			|	&ПериодКонтроля КАК Дата,
			|	ТаблицаРасчеты.Организация КАК Организация,
			|	ТаблицаРасчеты.Контрагент КАК Контрагент,
			|	ТаблицаРасчеты.Договор КАК Договор,
			|	ТаблицаРасчеты.Документ КАК Документ,
			|	ТаблицаРасчеты.Заказ КАК Заказ,
			|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
			|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницыСтарая,
			|	ТаблицаРасчеты.Валюта КАК Валюта,
			|	ТаблицаРасчеты.СчетУчета КАК СчетУчета,
			|	ТаблицаРасчеты.СчетУчетаРегл КАК СчетУчетаРегл,
			|	ТаблицаОстатки.СуммаРасчетов * ТаблицаОстатки.Курс КАК СуммаКурсовойРазницы//КурсоваяРазница
			|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиРегл
			|ИЗ
			|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчеты
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведенияРегл КАК ТаблицаОстатки
			|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
			|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
			|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
			|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
			|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
			|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
			|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
			|			И ТаблицаРасчеты.СчетУчетаРегл = ТаблицаОстатки.СчетУчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
			|				&МоментВремени,
			|				Валюта В
			|					(ВЫБРАТЬ
			|						КонстантаВалютаУчета.Значение
			|					ИЗ
			|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
			|				&МоментВремени,
			|				Валюта В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ВременнаяТаблицаРасчетыСПоставщиками.Валюта
			|					ИЗ
			|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК КурсыВалютРасчетовСрезПоследних
			|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
			|ГДЕ
			|	ТаблицаРасчеты.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
			|	И (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
			|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	1 КАК Порядок,
			|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
			|	ТаблицаДокумента.Дата КАК Период,
			|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
			|	ТаблицаДокумента.Организация КАК Организация,
			|	ТаблицаДокумента.Контрагент КАК Контрагент,
			|	ТаблицаДокумента.Договор КАК Договор,
			|	ТаблицаДокумента.Документ КАК Документ,
			|	ТаблицаДокумента.Заказ КАК Заказ,
			|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
			|	ТаблицаДокумента.Сумма КАК Сумма,
			|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
			|	ТаблицаДокумента.СчетУчета,
			|	ТаблицаДокумента.Валюта,
			|	ТаблицаДокумента.СодержаниеПроводки,
			|	0 КАК КурсоваяРазницв
			|ИЗ
			|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	2,
			|	ТаблицаДокумента.НомерСтроки,
			|	ТаблицаДокумента.Дата,
			|	ВЫБОР
			|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
			|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|	КОНЕЦ,
			|	ТаблицаДокумента.Организация,
			|	ТаблицаДокумента.Контрагент,
			|	ТаблицаДокумента.Договор,
			|	ТаблицаДокумента.Документ,
			|	ТаблицаДокумента.Заказ,
			|	ТаблицаДокумента.ТипРасчетов,
			//|	ВЫБОР
			//|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
			//|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
			//|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
			//|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
			|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
			|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
			|	КОНЕЦ,
			//|	ТаблицаДокумента.СуммаКурсовойРазницы, //КурсоваяРазница,
			|	0,
			|	ТаблицаДокумента.СчетУчета,
			|	ТаблицаДокумента.Валюта,
			|	&КурсоваяРазница,
			|	ВЫБОР
			|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
			|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
			|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
			|	КОНЕЦ
			//|	ТаблицаДокумента.СуммаКурсовойРазницы //КурсоваяРазница
			|ИЗ
			|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиРегл КАК ТаблицаДокумента
			|
			|УПОРЯДОЧИТЬ ПО
			|	Порядок,
			|	НомерСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	3 КАК Поле1,
			|	ДвиженияДокумента.Организация,
			|	ДвиженияДокумента.Контрагент,
			|	ДвиженияДокумента.Договор,
			|	ДвиженияДокумента.Документ,
			|	ДвиженияДокумента.Заказ,
			|	ДвиженияДокумента.ТипРасчетов,
			|	ВЫБОР
			|		КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|			ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
			|		ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
			|	КОНЕЦ КАК Поле2,
			|	ВЫБОР
			|		КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|			ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
			|		ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
			|	КОНЕЦ КАК Поле3,
			|	0 КАК Поле4,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0) / ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
			|	КОНЕЦ КАК Поле5,
			|	ВременнаяТаблицаКурсовДокументовРасчета.Курс,
			|	ВременнаяТаблицаКурсовДокументовРасчета.Кратность
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсовДокументовРасчета КАК ВременнаяТаблицаКурсовДокументовРасчета
			|		ПО ДвиженияДокумента.Документ = ВременнаяТаблицаКурсовДокументовРасчета.Документ
			|ГДЕ
			|	ДвиженияДокумента.Регистратор = &Ссылка
			|	И ДвиженияДокумента.Период <= &ПериодКонтроля";
			
		Иначе
			
			НомерЗапроса = 1;
			
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	1 КАК НомерСтроки,
			|	&ПериодКонтроля КАК Дата,
			|	ТаблицаРасчеты.Организация КАК Организация,
			|	ТаблицаРасчеты.Контрагент КАК Контрагент,
			|	ТаблицаРасчеты.Договор КАК Договор,
			|	ТаблицаРасчеты.Документ КАК Документ,
			|	ТаблицаРасчеты.Заказ КАК Заказ,
			|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
			|	0 КАК СуммаКурсовойРазницы,
			|	ТаблицаРасчеты.Валюта КАК Валюта,
			|	ТаблицаРасчеты.СчетУчета КАК СчетУчета,
			|	ТаблицаРасчеты.СчетУчетаРегл КАК СчетУчетаРегл
			|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиРегл
			|ИЗ
			|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчеты
			|ГДЕ
			|	ЛОЖЬ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаДокумента.Дата КАК Период,
			|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
			|	ТаблицаДокумента.Организация КАК Организация,
			|	ТаблицаДокумента.Контрагент КАК Контрагент,
			|	ТаблицаДокумента.Договор КАК Договор,
			|	ТаблицаДокумента.Документ КАК Документ,
			|	ТаблицаДокумента.Заказ КАК Заказ,
			|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
			|	ТаблицаДокумента.Сумма КАК Сумма,
			|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
			|	ТаблицаДокумента.СчетУчетаРегл КАК СчетУчета,
			|	ТаблицаДокумента.Валюта,
			|	ТаблицаДокумента.СодержаниеПроводки
			|ИЗ
			|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
			|
			|УПОРЯДОЧИТЬ ПО
			|	ТаблицаДокумента.СодержаниеПроводки,
			|	Документ,
			|	Заказ,
			|	ВидДвижения";
			
		КонецЕсли;
	
	ИначеЕсли СЗачетомАванса Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщикуРегл
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПоставщиками.Организация,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Контрагент,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Договор,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Документ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Заказ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчетаРегл КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведенияРегл КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчетаРегл = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment:	
		|"; 
		Если ДокументСсылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|		ЛЕВОЕ СОЕДИНЕНИЕ AzRyВременнаяТаблицаПредоплатаКурсы КАК КурсыВалютРасчетовСрезПоследних
			|		ПО ТаблицаРасчеты.Документ = КурсыВалютРасчетовСрезПоследних.Документ	
			|";	
		Иначе 	
			
			ТекстЗапроса = ТекстЗапроса +
			"
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
			|				&МоментВремени,
			|				Валюта В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ВременнаяТаблицаРасчетыСПоставщиками.Договор.ВалютаРасчетов
			|					ИЗ
			|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК КурсыВалютРасчетовСрезПоследних
			|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
			|";
			
		КонецЕсли; 

		ТекстЗапроса = ТекстЗапроса +
		"
		// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment:
		|ГДЕ
		//|	(ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		//|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) = 0)
		//|   И
		|	(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Период КАК Период,
		|	ТаблицаДвижений.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДвижений.Организация КАК Организация,
		|	ТаблицаДвижений.Контрагент КАК Контрагент,
		|	ТаблицаДвижений.Договор КАК Договор,
		|	ТаблицаДвижений.Документ КАК Документ,
		|	ТаблицаДвижений.Заказ КАК Заказ,
		|	ТаблицаДвижений.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДвижений.Валюта КАК Валюта,
		|	СУММА(ТаблицаДвижений.Сумма) КАК Сумма,
		|	СУММА(ТаблицаДвижений.СуммаВал) КАК СуммаВал,
		|	ТаблицаДвижений.СодержаниеПроводки КАК СодержаниеПроводки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Период,
		|		ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.Сумма КАК Сумма,
		|		ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|		ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаДвижений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДвижений.Период,
		|	ТаблицаДвижений.Организация,
		|	ТаблицаДвижений.Контрагент,
		|	ТаблицаДвижений.Договор,
		|	ТаблицаДвижений.Документ,
		|	ТаблицаДвижений.Заказ,
		|	ТаблицаДвижений.ТипРасчетов,
		|	ТаблицаДвижений.Валюта,
		|	ТаблицаДвижений.СодержаниеПроводки,
		|	ТаблицаДвижений.ВидДвижения
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ТаблицаДвижений.Сумма) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.Сумма) <= -0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) <= -0.005)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаКурсовыхРазниц.Организация КАК Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент КАК Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор КАК Договор,
		|	ТаблицаКурсовыхРазниц.Документ КАК Документ,
		|	ТаблицаКурсовыхРазниц.Заказ КАК Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов КАК ТипРасчетов,
		|	СУММА(ТаблицаКурсовыхРазниц.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы,
		|	ТаблицаКурсовыхРазниц.Валюта КАК Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиРегл
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Дата,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|		ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ВЫРАЗИТЬ(ТаблицаДокумента.Контрагент КАК Справочник.Контрагенты).СчетУчетаРасчетовСПоставщикомРегл,
		|		ТаблицаДокумента.СуммаКурсовойРазницы
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазниц
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаКурсовыхРазниц.Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор,
		|	ТаблицаКурсовыхРазниц.Документ,
		|	ТаблицаКурсовыхРазниц.Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов,
		|	ТаблицаКурсовыхРазниц.Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительнаяРегл";
		
	Иначе
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщикуРегл
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПоставщиками.Организация,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Контрагент,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Договор,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Документ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Заказ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщикуРегл
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиРегл
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведенияРегл КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчетаРегл = ТаблицаОстатки.СчетУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПоставщиками.Валюта
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	ТаблицаРасчеты.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	И (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ТаблицаДокумента.Дата,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.Контрагент,
		|	ТаблицаДокумента.Договор,
		|	ТаблицаДокумента.Документ,
		|	ТаблицаДокумента.Заказ,
		|	ТаблицаДокумента.ТипРасчетов,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	&КурсоваяРазница
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиРегл КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция AzRy_ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками(МенеджерВременныхТаблиц, СЗачетомАванса, НомерЗапроса, ДокументСсылка = Неопределено) Экспорт
	
	//РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаРасчетыСПоставщиками");
	РассчитыватьКурсовыеРазницы = ДокументСсылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено;
	//РассчитыватьКурсовыеРазницы = Ложь;
	
	Если НЕ РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета,
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА ТаблицаРасчеты.Проект
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчеты
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки,
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА ТаблицаДокумента.Проект
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаДокумента.СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения";
	
	ИначеЕсли СЗачетомАванса Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток,
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА РасчетыОстатки.Проект
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток,
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|		ВЫБОР 
		|			КОГДА &УчетПоПроектам 
		|				ТОГДА ВременнаяТаблица.Проект
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|		КОНЕЦ КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0),
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|		ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПоставщиками.Организация,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Контрагент,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Договор,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Документ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Заказ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ,
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|		ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|	РасчетыОстатки.Проект,
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета,
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|	Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета,
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|		ВЫБОР 
		|			КОГДА &УчетПоПроектам 
		|				ТОГДА ТаблицаРасчеты.Проект
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|		КОНЕЦ КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|			И ТаблицаРасчеты.Проект = ТаблицаОстатки.Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment:	
		|"; 
		Если ДокументСсылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|		ЛЕВОЕ СОЕДИНЕНИЕ AzRyВременнаяТаблицаПредоплатаКурсы КАК КурсыВалютРасчетовСрезПоследних
			|		ПО ТаблицаРасчеты.Документ = КурсыВалютРасчетовСрезПоследних.Документ	
			|";	
		Иначе 	
			
			ТекстЗапроса = ТекстЗапроса +
			"
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
			|				&МоментВремени,
			|				Валюта В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ВременнаяТаблицаРасчетыСПоставщиками.Договор.ВалютаРасчетов
			|					ИЗ
			|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК КурсыВалютРасчетовСрезПоследних
			|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
			|";
			
		КонецЕсли; 

		ТекстЗапроса = ТекстЗапроса +
		"
		// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment:		
		|ГДЕ
		//|	(ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		//|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) = 0)
		//|   И
		|   (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Период КАК Период,
		|	ТаблицаДвижений.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДвижений.Организация КАК Организация,
		|	ТаблицаДвижений.Контрагент КАК Контрагент,
		|	ТаблицаДвижений.Договор КАК Договор,
		|	ТаблицаДвижений.Документ КАК Документ,
		|	ТаблицаДвижений.Заказ КАК Заказ,
		|	ТаблицаДвижений.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДвижений.Валюта КАК Валюта,
		|	СУММА(ТаблицаДвижений.Сумма) КАК Сумма,
		|	СУММА(ТаблицаДвижений.СуммаВал) КАК СуммаВал,
		|	ТаблицаДвижений.СодержаниеПроводки КАК СодержаниеПроводки,
		//+++ Дмгг
		|	ТаблицаДвижений.Проект КАК Проект
		//--- Дмгг
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Период,
		|		ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.Сумма КАК Сумма,
		|		ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|		ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|		ВЫБОР 
		|			КОГДА &УчетПоПроектам 
		|				ТОГДА ТаблицаДокумента.Проект
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|		КОНЕЦ КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100)),
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|		ТаблицаДокумента.Проект КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100)),
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|		ТаблицаДокумента.Проект КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100)),
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|		ТаблицаДокумента.Проект КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100)),
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|		ТаблицаДокумента.Проект КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаДвижений
		|
		|СГРУППИРОВАТЬ ПО
		//+++ Дмгг
		|	ТаблицаДвижений.Проект,
		//--- Дмгг
		|	ТаблицаДвижений.Период,
		|	ТаблицаДвижений.Организация,
		|	ТаблицаДвижений.Контрагент,
		|	ТаблицаДвижений.Договор,
		|	ТаблицаДвижений.Документ,
		|	ТаблицаДвижений.Заказ,
		|	ТаблицаДвижений.ТипРасчетов,
		|	ТаблицаДвижений.Валюта,
		|	ТаблицаДвижений.СодержаниеПроводки,
		|	ТаблицаДвижений.ВидДвижения
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ТаблицаДвижений.Сумма) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.Сумма) <= -0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) <= -0.005)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаКурсовыхРазниц.Организация КАК Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент КАК Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор КАК Договор,
		|	ТаблицаКурсовыхРазниц.Документ КАК Документ,
		|	ТаблицаКурсовыхРазниц.Заказ КАК Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов КАК ТипРасчетов,
		|	СУММА(ТаблицаКурсовыхРазниц.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы,
		|	ТаблицаКурсовыхРазниц.Валюта КАК Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета КАК СчетУчета,
		//+++ Дмгг
		|	ТаблицаКурсовыхРазниц.Проект КАК Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Дата,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|		ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы,
		//+++ Дмгг
		|		ТаблицаДокумента.Проект КАК Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ВЫРАЗИТЬ(ТаблицаДокумента.Контрагент КАК Справочник.Контрагенты).СчетУчетаРасчетовСПоставщиком,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		//+++ Дмгг
		|		ТаблицаДокумента.Проект КАК Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазниц
		|
		|СГРУППИРОВАТЬ ПО
		//+++ Дмгг
		|	ТаблицаКурсовыхРазниц.Проект,
		//--- Дмгг
		|	ТаблицаКурсовыхРазниц.Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор,
		|	ТаблицаКурсовыхРазниц.Документ,
		|	ТаблицаКурсовыхРазниц.Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов,
		|	ТаблицаКурсовыхРазниц.Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщикамиПредварительная";
		
	Иначе
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток,
		//+++ Дмгг
		|	РасчетыОстатки.Проект КАК Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток,
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|		ВЫБОР 
		|			КОГДА &УчетПоПроектам 
		|				ТОГДА ВременнаяТаблица.Проект
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|		КОНЕЦ КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0),
		//+++ Дмгг
		|		ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект
		//--- Дмгг
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПоставщиками.Организация,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Контрагент,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Договор,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Документ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.Заказ,
		|						ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ,
		//+++ Дмгг
		|		ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект
		//--- Дмгг
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		//+++ Дмгг
		|	РасчетыОстатки.Проект,
		//--- Дмгг
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПоставщику
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета,
		//+++ Дмгг
		|   Проект
		//--- Дмгг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета,
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|		ВЫБОР 
		|			КОГДА &УчетПоПроектам 
		|				ТОГДА ТаблицаРасчеты.Проект
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|		КОНЕЦ КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|			И ВЫБОР 
		|				КОГДА &УчетПоПроектам 
		|					ТОГДА ТаблицаРасчеты.Проект = ТаблицаОстатки.Проект
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПоставщиками.Валюта
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПоставщиками)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	ТаблицаРасчеты.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	И (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки,
		//ПодольскийАИ #УчетПроектов 10.10.2020 {
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам 
		|			ТОГДА ТаблицаДокумента.Проект
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
		|	КОНЕЦ КАК Проект
		//ПодольскийАИ #УчетПроектов 10.10.2020 }
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПоставщиками КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ТаблицаДокумента.Дата,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.Контрагент,
		|	ТаблицаДокумента.Договор,
		|	ТаблицаДокумента.Документ,
		|	ТаблицаДокумента.Заказ,
		|	ТаблицаДокумента.ТипРасчетов,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	&КурсоваяРазница,
		//+++ Дмгг
		|	ТаблицаДокумента.Проект КАК Проект
		//--- Дмгг
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницРасчетыСПоставщиками КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ПриходнаяНакладная_ИнициализироватьДанныеДокумента_ДопТекстЗапроса(Документ, Запрос, AzRyДокументЗагруженИзДругойБазы) Экспорт

	Если AzRyДокументЗагруженИзДругойБазы Тогда
		
		Запрос.Текст = Запрос.Текст + 
		";
		|////////////////////////////////////////////////////////////////////////////////		
		|ВЫБРАТЬ
		|	Док.Документ КАК Документ,
		|	Док.Курс КАК Курс,
		|	Док.Кратность КАК Кратность
		|ПОМЕСТИТЬ AzRyВременнаяТаблицаПредоплатаКурсы
		|ИЗ
		|	Документ." + Документ + ".Предоплата КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка";
		
	КонецЕсли; 

КонецПроцедуры

Функция AzRy_ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями(МенеджерВременныхТаблиц, СЗачетомАванса, НомерЗапроса, ДокументСсылка = Неопределено) Экспорт
	
	//РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаРасчетыСПокупателями");
	РассчитыватьКурсовыеРазницы = ДокументСсылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено;
	
	Если НЕ РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		//+++ Дмгг
		|,
		|	ТаблицаРасчеты.Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаРасчеты
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки
		//+++ Дмгг
		|,
		|	ТаблицаДокумента.Проект
		//--- Дмгг
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаДокумента.СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения";
	
	ИначеЕсли СЗачетомАванса Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		//+++ Дмгг
		|,
		|	РасчетыОстатки.Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		//+++ Дмгг
		|,
		|		ВременнаяТаблица.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПокупателями КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		//+++ Дмгг
		|,
		|		ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект
		//--- Дмгг
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПокупателями.Организация,
		|						ВременнаяТаблицаРасчетыСПокупателями.Контрагент,
		|						ВременнаяТаблицаРасчетыСПокупателями.Договор,
		|						ВременнаяТаблицаРасчетыСПокупателями.Документ,
		|						ВременнаяТаблицаРасчетыСПокупателями.Заказ,
		|						ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПокупателями)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		//+++ Дмгг
		|,
		|		ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		//--- Дмгг
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ
		//+++ Дмгг
		|,
		|	РасчетыОстатки.Проект
		//--- Дмгг
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		//+++ Дмгг
		|,
		|	Проект
		//--- Дмгг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		//+++ Дмгг
		|,
		|	ТаблицаРасчеты.Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		//+++ Дмгг
		|			И ТаблицаРасчеты.Проект = ТаблицаОстатки.Проект
		//--- Дмгг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		
		// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment:	
		|"; 
		Если ДокументСсылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|		ЛЕВОЕ СОЕДИНЕНИЕ AzRyВременнаяТаблицаПредоплатаКурсы КАК КурсыВалютРасчетовСрезПоследних
			|		ПО ТаблицаРасчеты.Документ = КурсыВалютРасчетовСрезПоследних.Документ	
			|";	
		Иначе 	
			
			ТекстЗапроса = ТекстЗапроса +
			"
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
			|				&МоментВремени,
			|				Валюта В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ВременнаяТаблицаРасчетыСПокупателями.Договор.ВалютаРасчетов
			|					ИЗ
			|						ВременнаяТаблицаРасчетыСПокупателями)) КАК КурсыВалютРасчетовСрезПоследних
			|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
			|";
			
		КонецЕсли; 

		ТекстЗапроса = ТекстЗапроса +
		"
		// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment:	
		
		|ГДЕ
		//|	(ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		//|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) = 0)
		//|	И
		|   (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Период КАК Период,
		|	ТаблицаДвижений.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДвижений.Организация КАК Организация,
		|	ТаблицаДвижений.Контрагент КАК Контрагент,
		|	ТаблицаДвижений.Договор КАК Договор,
		|	ТаблицаДвижений.Документ КАК Документ,
		|	ТаблицаДвижений.Заказ КАК Заказ,
		|	ТаблицаДвижений.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДвижений.Валюта КАК Валюта,
		|	СУММА(ТаблицаДвижений.Сумма) КАК Сумма,
		|	СУММА(ТаблицаДвижений.СуммаВал) КАК СуммаВал,
		|	ТаблицаДвижений.СодержаниеПроводки КАК СодержаниеПроводки
		//+++ Дмгг
		|,
		|	ТаблицаДвижений.Проект
		//--- Дмгг
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Период,
		|		ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.Сумма КАК Сумма,
		|		ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|		ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
		//+++ Дмгг
		|,
		|		ТаблицаДокумента.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
		//+++ Дмгг
		|,
		|		ТаблицаДокумента.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		//+++ Дмгг
		|,
		|		ТаблицаДокумента.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		//+++ Дмгг
		|,
		|		ТаблицаДокумента.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
		//+++ Дмгг
		|,
		|		ТаблицаДокумента.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаДвижений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДвижений.Период,
		|	ТаблицаДвижений.Организация,
		|	ТаблицаДвижений.Контрагент,
		|	ТаблицаДвижений.Договор,
		|	ТаблицаДвижений.Документ,
		|	ТаблицаДвижений.Заказ,
		|	ТаблицаДвижений.ТипРасчетов,
		|	ТаблицаДвижений.Валюта,
		|	ТаблицаДвижений.СодержаниеПроводки,
		|	ТаблицаДвижений.ВидДвижения
		//+++ Дмгг
		|,
		|	ТаблицаДвижений.Проект
		//--- Дмгг
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ТаблицаДвижений.Сумма) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.Сумма) <= -0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) <= -0.005)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаКурсовыхРазниц.Организация КАК Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент КАК Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор КАК Договор,
		|	ТаблицаКурсовыхРазниц.Документ КАК Документ,
		|	ТаблицаКурсовыхРазниц.Заказ КАК Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов КАК ТипРасчетов,
		|	СУММА(ТаблицаКурсовыхРазниц.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы,
		|	ТаблицаКурсовыхРазниц.Валюта КАК Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета КАК СчетУчета
		//+++ Дмгг
		|,
		|	ТаблицаКурсовыхРазниц.Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Дата,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|		ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы
		//+++ Дмгг
		|,
		|		ТаблицаДокумента.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПокупателем,
		|		ТаблицаДокумента.СуммаКурсовойРазницы
		//+++ Дмгг
		|,
		|		ТаблицаДокумента.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазниц
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаКурсовыхРазниц.Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор,
		|	ТаблицаКурсовыхРазниц.Документ,
		|	ТаблицаКурсовыхРазниц.Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов,
		|	ТаблицаКурсовыхРазниц.Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета
		//+++ Дмгг
		|,
		|	ТаблицаКурсовыхРазниц.Проект
		//--- Дмг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная";
		
	Иначе
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		//+++ Дмгг
		|,
		|	РасчетыОстатки.Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		//+++ Дмгг
		|,
		|		ВременнаяТаблица.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПокупателями КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		//+++ Дмгг
		|,
		|		ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект
		//--- Дмгг
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПокупателями.Организация,
		|						ВременнаяТаблицаРасчетыСПокупателями.Контрагент,
		|						ВременнаяТаблицаРасчетыСПокупателями.Договор,
		|						ВременнаяТаблицаРасчетыСПокупателями.Документ,
		|						ВременнаяТаблицаРасчетыСПокупателями.Заказ,
		|						ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПокупателями)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		//+++ Дмгг
		|,
		|		ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		//--- Дмгг
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ
		//+++ Дмгг
		|,
		|	РасчетыОстатки.Проект
		//--- Дмгг
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		//+++ Дмгг
		|,
		|	Проект
		//--- Дмгг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		//+++ Дмгг
		|,
		|	ТаблицаРасчеты.Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		//+++ Дмгг
		|			И ТаблицаРасчеты.Проект = ТаблицаОстатки.Проект
		//--- Дмгг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПокупателями.Валюта
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПокупателями)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	ТаблицаРасчеты.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	И (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки
		//+++ Дмгг
		|,
		|	ТаблицаДокумента.Проект
		//--- Дмгг
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ТаблицаДокумента.Дата,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.Контрагент,
		|	ТаблицаДокумента.Договор,
		|	ТаблицаДокумента.Документ,
		|	ТаблицаДокумента.Заказ,
		|	ТаблицаДокумента.ТипРасчетов,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	&КурсоваяРазница
		//+++ Дмгг
		|,
		|	ТаблицаДокумента.Проект
		//--- Дмгг
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями()

Функция AzRy_ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателямиРегл(МенеджерВременныхТаблиц, СЗачетомАванса, НомерЗапроса, ДокументСсылка = Неопределено) Экспорт
	
	//РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаРасчетыСПокупателями");
	РассчитыватьКурсовыеРазницы = ДокументСсылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено;
	
	Если НЕ РассчитыватьКурсовыеРазницы Тогда
		
		НомерЗапроса = 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	0 КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		//+++ Дмгг
		|,
		|	ТаблицаРасчеты.Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаРасчеты
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки
		//+++ Дмгг
		|,
		|	ТаблицаДокумента.Проект
		//--- Дмгг
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаДокумента.СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения";
	
	ИначеЕсли СЗачетомАванса Тогда
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателемРегл
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателяРегл
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		//+++ Дмгг
		|,
		|	РасчетыОстатки.Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		//+++ Дмгг
		|,
		|		ВременнаяТаблица.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПокупателями КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		//+++ Дмгг
		|,
		|		ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект
		//--- Дмгг
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПокупателями.Организация,
		|						ВременнаяТаблицаРасчетыСПокупателями.Контрагент,
		|						ВременнаяТаблицаРасчетыСПокупателями.Договор,
		|						ВременнаяТаблицаРасчетыСПокупателями.Документ,
		|						ВременнаяТаблицаРасчетыСПокупателями.Заказ,
		|						ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПокупателями)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		//+++ Дмгг
		|,
		|		ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		//--- Дмгг
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателемРегл
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ
		//+++ Дмгг
		|,
		|	РасчетыОстатки.Проект
		//--- Дмгг
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		//+++ Дмгг
		|,
		|	Проект
		//--- Дмгг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчетаРегл КАК СчетУчета
		//+++ Дмгг
		|,
		|	ТаблицаРасчеты.Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведенияРегл КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчетаРегл = ТаблицаОстатки.СчетУчета
		//+++ Дмгг
		|			И ТаблицаРасчеты.Проект = ТаблицаОстатки.Проект
		//--- Дмгг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		
		// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment:	
		|"; 
		Если ДокументСсылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|		ЛЕВОЕ СОЕДИНЕНИЕ AzRyВременнаяТаблицаПредоплатаКурсы КАК КурсыВалютРасчетовСрезПоследних
			|		ПО ТаблицаРасчеты.Документ = КурсыВалютРасчетовСрезПоследних.Документ	
			|";	
		Иначе 	
			
			ТекстЗапроса = ТекстЗапроса +
			"
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
			|				&МоментВремени,
			|				Валюта В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ВременнаяТаблицаРасчетыСПокупателями.Договор.ВалютаРасчетов
			|					ИЗ
			|						ВременнаяТаблицаРасчетыСПокупателями)) КАК КурсыВалютРасчетовСрезПоследних
			|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
			|";
			
		КонецЕсли; 

		ТекстЗапроса = ТекстЗапроса +
		"
		// +++ { AzRy - [29.10.2021] - Developer:გიორგი მამულაშვილი - Comment:	
		
		|ГДЕ
		//|	(ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		//|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) = 0)
		//|	И
		|   (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Период КАК Период,
		|	ТаблицаДвижений.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДвижений.Организация КАК Организация,
		|	ТаблицаДвижений.Контрагент КАК Контрагент,
		|	ТаблицаДвижений.Договор КАК Договор,
		|	ТаблицаДвижений.Документ КАК Документ,
		|	ТаблицаДвижений.Заказ КАК Заказ,
		|	ТаблицаДвижений.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДвижений.Валюта КАК Валюта,
		|	СУММА(ТаблицаДвижений.Сумма) КАК Сумма,
		|	СУММА(ТаблицаДвижений.СуммаВал) КАК СуммаВал,
		|	ТаблицаДвижений.СодержаниеПроводки КАК СодержаниеПроводки
		//+++ Дмгг
		|,
		|	ТаблицаДвижений.Проект
		//--- Дмгг
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Период,
		|		ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.Сумма КАК Сумма,
		|		ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|		ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
		//+++ Дмгг
		|,
		|		ТаблицаДокумента.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
		//+++ Дмгг
		|,
		|		ТаблицаДокумента.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ТаблицаДокумента.Документ,
		|		ТаблицаДокумента.Заказ,
		|		ТаблицаДокумента.ТипРасчетов,
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		//+++ Дмгг
		|,
		|		ТаблицаДокумента.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
		//+++ Дмгг
		|,
		|		ТаблицаДокумента.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.СуммаКурсовойРазницы,
		|		0,
		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
		//+++ Дмгг
		|,
		|		ТаблицаДокумента.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаДвижений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДвижений.Период,
		|	ТаблицаДвижений.Организация,
		|	ТаблицаДвижений.Контрагент,
		|	ТаблицаДвижений.Договор,
		|	ТаблицаДвижений.Документ,
		|	ТаблицаДвижений.Заказ,
		|	ТаблицаДвижений.ТипРасчетов,
		|	ТаблицаДвижений.Валюта,
		|	ТаблицаДвижений.СодержаниеПроводки,
		|	ТаблицаДвижений.ВидДвижения
		//+++ Дмгг
		|,
		|	ТаблицаДвижений.Проект
		//--- Дмгг
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ТаблицаДвижений.Сумма) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.Сумма) <= -0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) >= 0.005
		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) <= -0.005)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПроводки,
		|	Документ,
		|	Заказ,
		|	ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаКурсовыхРазниц.Организация КАК Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент КАК Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор КАК Договор,
		|	ТаблицаКурсовыхРазниц.Документ КАК Документ,
		|	ТаблицаКурсовыхРазниц.Заказ КАК Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов КАК ТипРасчетов,
		|	СУММА(ТаблицаКурсовыхРазниц.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы,
		|	ТаблицаКурсовыхРазниц.Валюта КАК Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета КАК СчетУчета
		//+++ Дмгг
		|,
		|	ТаблицаКурсовыхРазниц.Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиРегл
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДокумента.Дата КАК Дата,
		|		ТаблицаДокумента.Организация КАК Организация,
		|		ТаблицаДокумента.Контрагент КАК Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор КАК Договор,
		|		ТаблицаДокумента.Документ КАК Документ,
		|		ТаблицаДокумента.Заказ КАК Заказ,
		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|		ТаблицаДокумента.Валюта КАК Валюта,
		|		ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|		ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы
		//+++ Дмгг
		|,
		|		ТаблицаДокумента.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДокумента.Дата,
		|		ТаблицаДокумента.Организация,
		|		ТаблицаДокумента.Контрагент,
		|		ТаблицаДокумента.ВестиРасчетыПоДокументам,
		|		ТаблицаДокумента.Договор,
		|		ВЫБОР
		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
		|				ТОГДА &Ссылка
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ,
		|		ТаблицаДокумента.Заказ,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
		|		ТаблицаДокумента.Валюта,
		|		ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
		|		ТаблицаДокумента.СуммаКурсовойРазницы
		//+++ Дмгг
		|,
		|		ТаблицаДокумента.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл КАК ТаблицаДокумента
		|	ГДЕ
		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазниц
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаКурсовыхРазниц.Организация,
		|	ТаблицаКурсовыхРазниц.Контрагент,
		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам,
		|	ТаблицаКурсовыхРазниц.Договор,
		|	ТаблицаКурсовыхРазниц.Документ,
		|	ТаблицаКурсовыхРазниц.Заказ,
		|	ТаблицаКурсовыхРазниц.ТипРасчетов,
		|	ТаблицаКурсовыхРазниц.Валюта,
		|	ТаблицаКурсовыхРазниц.СчетУчета
		//+++ Дмгг
		|,
		|	ТаблицаКурсовыхРазниц.Проект
		//--- Дмг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл";
		
	Иначе
		
		НомерЗапроса = 2;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасчетыОстатки.Организация КАК Организация,
		|	РасчетыОстатки.Контрагент КАК Контрагент,
		|	РасчетыОстатки.Договор КАК Договор,
		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	РасчетыОстатки.Документ КАК Документ,
		|	РасчетыОстатки.Заказ КАК Заказ,
		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ КАК СчетУчета,
		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
		//+++ Дмгг
		|,
		|	РасчетыОстатки.Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблица.Организация КАК Организация,
		|		ВременнаяТаблица.Контрагент КАК Контрагент,
		|		ВременнаяТаблица.Договор КАК Договор,
		|		ВременнаяТаблица.Документ КАК Документ,
		|		ВременнаяТаблица.Заказ КАК Заказ,
		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
		//+++ Дмгг
		|,
		|		ВременнаяТаблица.Проект
		//--- Дмгг
		|	ИЗ
		|		ВременнаяТаблицаРасчетыСПокупателями КАК ВременнаяТаблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаОстатки.Организация,
		|		ТаблицаОстатки.Контрагент,
		|		ТаблицаОстатки.Договор,
		|		ТаблицаОстатки.Документ,
		|		ТаблицаОстатки.Заказ,
		|		ТаблицаОстатки.ТипРасчетов,
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
		//+++ Дмгг
		|,
		|		ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект
		//--- Дмгг
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями.Остатки(
		|				&МоментВремени,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПокупателями.Организация,
		|						ВременнаяТаблицаРасчетыСПокупателями.Контрагент,
		|						ВременнаяТаблицаРасчетыСПокупателями.Договор,
		|						ВременнаяТаблицаРасчетыСПокупателями.Документ,
		|						ВременнаяТаблицаРасчетыСПокупателями.Заказ,
		|						ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПокупателями)) КАК ТаблицаОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Организация,
		|		ДвиженияДокумента.Контрагент,
		|		ДвиженияДокумента.Договор,
		|		ДвиженияДокумента.Документ,
		|		ДвиженияДокумента.Заказ,
		|		ДвиженияДокумента.ТипРасчетов,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
		|		КОНЕЦ
		//+++ Дмгг
		|,
		|		ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		//--- Дмгг
		|	ИЗ
		|		РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокумента
		|	ГДЕ
		|		ДвиженияДокумента.Регистратор = &Ссылка
		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыОстатки.Организация,
		|	РасчетыОстатки.Контрагент,
		|	РасчетыОстатки.Договор,
		|	РасчетыОстатки.Документ,
		|	РасчетыОстатки.Заказ,
		|	РасчетыОстатки.ТипРасчетов,
		|	РасчетыОстатки.Договор.ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
		|	КОНЕЦ
		//+++ Дмгг
		|,
		|	РасчетыОстатки.Проект
		//--- Дмгг
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Контрагент,
		|	Договор,
		|	ВалютаРасчетов,
		|	Документ,
		|	Заказ,
		|	ТипРасчетов,
		|	СчетУчета
		//+++ Дмгг
		|,
		|	Проект
		//--- Дмгг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	&ПериодКонтроля КАК Дата,
		|	ТаблицаРасчеты.Организация КАК Организация,
		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ТаблицаРасчеты.Договор КАК Договор,
		|	ТаблицаРасчеты.Документ КАК Документ,
		|	ТаблицаРасчеты.Заказ КАК Заказ,
		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
		|	ТаблицаРасчеты.Валюта КАК Валюта,
		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
		//+++ Дмгг
		|,
		|	ТаблицаРасчеты.Проект
		//--- Дмгг
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведения КАК ТаблицаОстатки
		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
		//+++ Дмгг
		|			И ТаблицаРасчеты.Проект = ТаблицаОстатки.Проект
		//--- Дмгг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаРасчетыСПокупателями.Валюта
		|					ИЗ
		|						ВременнаяТаблицаРасчетыСПокупателями)) КАК КурсыВалютРасчетовСрезПоследних
		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
		|ГДЕ
		|	ТаблицаРасчеты.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	И (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Дата КАК Период,
		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Документ КАК Документ,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	ТаблицаДокумента.СодержаниеПроводки
		//+++ Дмгг
		|,
		|	ТаблицаДокумента.Проект
		//--- Дмгг
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ТаблицаДокумента.НомерСтроки,
		|	ТаблицаДокумента.Дата,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.Контрагент,
		|	ТаблицаДокумента.Договор,
		|	ТаблицаДокумента.Документ,
		|	ТаблицаДокумента.Заказ,
		|	ТаблицаДокумента.ТипРасчетов,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
		|	КОНЕЦ,
		|	0,
		|	ТаблицаДокумента.СчетУчета,
		|	ТаблицаДокумента.Валюта,
		|	&КурсоваяРазница
		//+++ Дмгг
		|,
		|	ТаблицаДокумента.Проект
		//--- Дмгг
		|ИЗ
		|	ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведения";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями()


//// Функция возвращает текст запроса для расчета курсовых разниц.
////
//Функция AzRy_ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателямиРегл(МенеджерВременныхТаблиц, СЗачетомАванса, НомерЗапроса, ДокументСсылка = Неопределено) Экспорт
//	
//	//РассчитыватьКурсовыеРазницы = ПолучитьНеобходимостьРасчетаКурсовыхРазниц(МенеджерВременныхТаблиц, "ВременнаяТаблицаРасчетыСПокупателями");
//	РассчитыватьКурсовыеРазницы = ДокументСсылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено;
//	
//	Если НЕ РассчитыватьКурсовыеРазницы Тогда
//		
//		НомерЗапроса = 1;
//		
//		ТекстЗапроса =
//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	1 КАК НомерСтроки,
//		|	&ПериодКонтроля КАК Дата,
//		|	ТаблицаРасчеты.Организация КАК Организация,
//		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
//		|	ТаблицаРасчеты.Договор КАК Договор,
//		|	ТаблицаРасчеты.Документ КАК Документ,
//		|	ТаблицаРасчеты.Заказ КАК Заказ,
//		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
//		|	0 КАК СуммаКурсовойРазницы,
//		|	ТаблицаРасчеты.Валюта КАК Валюта,
//		|	ТаблицаРасчеты.СчетУчетаРегл КАК СчетУчета
//		//+++ Дмгг
//		|,
//		|	ТаблицаРасчеты.Проект КАК Проект
//		//--- Дмгг
//		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиРегл
//		|ИЗ
//		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаРасчеты
//		|ГДЕ
//		|	ЛОЖЬ
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ТаблицаДокумента.Дата КАК Период,
//		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
//		|	ТаблицаДокумента.Организация КАК Организация,
//		|	ТаблицаДокумента.Контрагент КАК Контрагент,
//		|	ТаблицаДокумента.Договор КАК Договор,
//		|	ТаблицаДокумента.Документ КАК Документ,
//		|	ТаблицаДокумента.Заказ КАК Заказ,
//		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
//		|	ТаблицаДокумента.Сумма КАК Сумма,
//		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
//		|	ТаблицаДокумента.СчетУчетаРегл КАК СчетУчета,
//		|	ТаблицаДокумента.Валюта,
//		|	ТаблицаДокумента.СодержаниеПроводки
//		//+++ Дмгг
//		|,
//		|	ТаблицаДокумента.Проект КАК Проект
//		//--- Дмгг
//		|ИЗ
//		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	ТаблицаДокумента.СодержаниеПроводки,
//		|	Документ,
//		|	Заказ,
//		|	ВидДвижения";
//	
//	ИначеЕсли СЗачетомАванса Тогда
//		
//		НомерЗапроса = 2;
//		
//		ТекстЗапроса =
//		"ВЫБРАТЬ
//		|	РасчетыОстатки.Организация КАК Организация,
//		|	РасчетыОстатки.Контрагент КАК Контрагент,
//		|	РасчетыОстатки.Договор КАК Договор,
//		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
//		|	РасчетыОстатки.Документ КАК Документ,
//		|	РасчетыОстатки.Заказ КАК Заказ,
//		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
//		|	ВЫБОР
//		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
//		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателемРегл
//		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателяРегл
//		|	КОНЕЦ КАК СчетУчета,
//		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
//		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
//		//+++ Дмгг
//		|,
//		|	РасчетыОстатки.Проект
//		//--- Дмгг
//		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ВременнаяТаблица.Организация КАК Организация,
//		|		ВременнаяТаблица.Контрагент КАК Контрагент,
//		|		ВременнаяТаблица.Договор КАК Договор,
//		|		ВременнаяТаблица.Документ КАК Документ,
//		|		ВременнаяТаблица.Заказ КАК Заказ,
//		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
//		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
//		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
//		//+++ Дмгг
//		|,
//		|		ВременнаяТаблица.Проект
//		//--- Дмгг
//		|	ИЗ
//		|		ВременнаяТаблицаРасчетыСПокупателями КАК ВременнаяТаблица
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ТаблицаОстатки.Организация,
//		|		ТаблицаОстатки.Контрагент,
//		|		ТаблицаОстатки.Договор,
//		|		ТаблицаОстатки.Документ,
//		|		ТаблицаОстатки.Заказ,
//		|		ТаблицаОстатки.ТипРасчетов,
//		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
//		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
//		//+++ Дмгг
//		|,
//		|		ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект
//		//--- Дмгг
//		|	ИЗ
//		|		РегистрНакопления.РасчетыСПокупателями.Остатки(
//		|				&МоментВремени,
//		//+++ Дмгг
//		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
//		//|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов, Проект) В
//		//--- Дмгг
//		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|						ВременнаяТаблицаРасчетыСПокупателями.Организация,
//		|						ВременнаяТаблицаРасчетыСПокупателями.Контрагент,
//		|						ВременнаяТаблицаРасчетыСПокупателями.Договор,
//		|						ВременнаяТаблицаРасчетыСПокупателями.Документ,
//		|						ВременнаяТаблицаРасчетыСПокупателями.Заказ,
//		|						ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов
//		//+++ Дмгг
//		//|,
//		//|						ВременнаяТаблицаРасчетыСПокупателями.Проект
//		//--- Дмгг
//		|					ИЗ
//		|						ВременнаяТаблицаРасчетыСПокупателями)) КАК ТаблицаОстатки
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ДвиженияДокумента.Организация,
//		|		ДвиженияДокумента.Контрагент,
//		|		ДвиженияДокумента.Договор,
//		|		ДвиженияДокумента.Документ,
//		|		ДвиженияДокумента.Заказ,
//		|		ДвиженияДокумента.ТипРасчетов,
//		|		ВЫБОР
//		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
//		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
//		|		КОНЕЦ,
//		|		ВЫБОР
//		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
//		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
//		|		КОНЕЦ
//		//+++ Дмгг
//		|,
//		|		ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
//		//--- Дмгг
//		|	ИЗ
//		|		РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокумента
//		|	ГДЕ
//		|		ДвиженияДокумента.Регистратор = &Ссылка
//		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
//		|
//		|СГРУППИРОВАТЬ ПО
//		////+++ Дмгг
//		//|	РасчетыОстатки.Проект,
//		////--- Дмгг
//		|	РасчетыОстатки.Организация,
//		|	РасчетыОстатки.Контрагент,
//		|	РасчетыОстатки.Договор,
//		|	РасчетыОстатки.Документ,
//		|	РасчетыОстатки.Заказ,
//		|	РасчетыОстатки.ТипРасчетов,
//		|	РасчетыОстатки.Договор.ВалютаРасчетов,
//		|	ВЫБОР
//		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
//		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
//		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
//		|	КОНЕЦ
//		|	,
//		|	РасчетыОстатки.Проект
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Организация,
//		|	Контрагент,
//		|	Договор,
//		|	ВалютаРасчетов,
//		|	Документ,
//		|	Заказ,
//		|	ТипРасчетов,
//		|	СчетУчета
//		//+++ Дмгг
//		|,
//		|	Проект
//		//--- Дмгг
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	1 КАК НомерСтроки,
//		|	&ПериодКонтроля КАК Дата,
//		|	ТаблицаРасчеты.Организация КАК Организация,
//		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
//		|	ТаблицаРасчеты.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
//		|	ТаблицаРасчеты.Договор КАК Договор,
//		|	ТаблицаРасчеты.Документ КАК Документ,
//		|	ТаблицаРасчеты.Заказ КАК Заказ,
//		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
//		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
//		|	ТаблицаРасчеты.Валюта КАК Валюта,
//		|	ТаблицаРасчеты.СчетУчетаРегл КАК СчетУчета
//		//+++ Дмгг
//		|,
//		|	ТаблицаРасчеты.Проект
//		//--- Дмгг
//		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл
//		|ИЗ
//		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаРасчеты
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведенияРегл КАК ТаблицаОстатки
//		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
//		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
//		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
//		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
//		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
//		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
//		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
//		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
//		
//		|			И ТаблицаРасчеты.Проект = ТаблицаОстатки.Проект
//		
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
//		|				&МоментВремени,
//		|				Валюта В
//		|					(ВЫБРАТЬ
//		|						КонстантаВалютаУчета.Значение
//		|					ИЗ
//		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
//		|		ПО (ИСТИНА)
//		
//		// +++ { AzRy - [15.11.2021] - Developer:გიორგი მამულაშვილი - Comment:	
//		|"; 
//		Если ДокументСсылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
//			
//			ТекстЗапроса = ТекстЗапроса + 
//			"
//			|		ЛЕВОЕ СОЕДИНЕНИЕ AzRyВременнаяТаблицаПредоплатаКурсы КАК КурсыВалютРасчетовСрезПоследних
//			|		ПО ТаблицаРасчеты.Документ = КурсыВалютРасчетовСрезПоследних.Документ	
//			|";	
//		Иначе 	
//			
//			ТекстЗапроса = ТекстЗапроса +
//			"
//			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
//			|				&МоментВремени,
//			|				Валюта В
//			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
//			|						ВременнаяТаблицаРасчетыСПокупателями.Договор.ВалютаРасчетов
//			|					ИЗ
//			|						ВременнаяТаблицаРасчетыСПокупателями)) КАК КурсыВалютРасчетовСрезПоследних
//			|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
//			|";
//			
//		КонецЕсли; 

//		ТекстЗапроса = ТекстЗапроса +
//		"
//		// +++ { AzRy - [15.11.2021] - Developer:გიორგი მამულაშვილი - Comment:
//		
//		|ГДЕ
//		//|	(ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
//		//|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) = 0)
//		//|	И
//		|	(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
//		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ТаблицаДвижений.Период КАК Период,
//		|	ТаблицаДвижений.ВидДвижения КАК ВидДвижения,
//		|	ТаблицаДвижений.Организация КАК Организация,
//		|	ТаблицаДвижений.Контрагент КАК Контрагент,
//		|	ТаблицаДвижений.Договор КАК Договор,
//		|	ТаблицаДвижений.Документ КАК Документ,
//		|	ТаблицаДвижений.Заказ КАК Заказ,
//		|	ТаблицаДвижений.ТипРасчетов КАК ТипРасчетов,
//		|	ТаблицаДвижений.Валюта КАК Валюта,
//		|	СУММА(ТаблицаДвижений.Сумма) КАК Сумма,
//		|	СУММА(ТаблицаДвижений.СуммаВал) КАК СуммаВал,
//		|	ТаблицаДвижений.СодержаниеПроводки КАК СодержаниеПроводки
//		//+++ Дмгг
//		|,
//		|	ТаблицаДвижений.Проект
//		//--- Дмгг
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ТаблицаДокумента.Дата КАК Период,
//		|		ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
//		|		ТаблицаДокумента.Организация КАК Организация,
//		|		ТаблицаДокумента.Контрагент КАК Контрагент,
//		|		ТаблицаДокумента.Договор КАК Договор,
//		|		ТаблицаДокумента.Документ КАК Документ,
//		|		ТаблицаДокумента.Заказ КАК Заказ,
//		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
//		|		ТаблицаДокумента.Валюта КАК Валюта,
//		|		ТаблицаДокумента.Сумма КАК Сумма,
//		|		ТаблицаДокумента.СуммаВал КАК СуммаВал,
//		|		ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
//		//+++ Дмгг
//		|,
//		|		ТаблицаДокумента.Проект
//		//--- Дмгг
//		|	ИЗ
//		|		ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ТаблицаДокумента.Дата,
//		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
//		|		ТаблицаДокумента.Организация,
//		|		ТаблицаДокумента.Контрагент,
//		|		ТаблицаДокумента.Договор,
//		|		ТаблицаДокумента.Документ,
//		|		ТаблицаДокумента.Заказ,
//		|		ТаблицаДокумента.ТипРасчетов,
//		|		ТаблицаДокумента.Валюта,
//		|		ТаблицаДокумента.СуммаКурсовойРазницы,
//		|		0,
//		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
//		//+++ Дмгг
//		|,
//		|		ТаблицаДокумента.Проект
//		//--- Дмгг
//		|	ИЗ
//		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл КАК ТаблицаДокумента
//		|	ГДЕ
//		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ТаблицаДокумента.Дата,
//		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
//		|		ТаблицаДокумента.Организация,
//		|		ТаблицаДокумента.Контрагент,
//		|		ТаблицаДокумента.Договор,
//		|		ТаблицаДокумента.Документ,
//		|		ТаблицаДокумента.Заказ,
//		|		ТаблицаДокумента.ТипРасчетов,
//		|		ТаблицаДокумента.Валюта,
//		|		ТаблицаДокумента.СуммаКурсовойРазницы,
//		|		0,
//		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
//		//+++ Дмгг
//		|,
//		|		ТаблицаДокумента.Проект
//		//--- Дмгг
//		|	ИЗ
//		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл КАК ТаблицаДокумента
//		|	ГДЕ
//		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ТаблицаДокумента.Дата,
//		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
//		|		ТаблицаДокумента.Организация,
//		|		ТаблицаДокумента.Контрагент,
//		|		ТаблицаДокумента.Договор,
//		|		ВЫБОР
//		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//		|				ТОГДА &Ссылка
//		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
//		|		КОНЕЦ,
//		|		ТаблицаДокумента.Заказ,
//		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
//		|		ТаблицаДокумента.Валюта,
//		|		ТаблицаДокумента.СуммаКурсовойРазницы,
//		|		0,
//		|		ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
//		//+++ Дмгг
//		|,
//		|		ТаблицаДокумента.Проект
//		//--- Дмгг
//		|	ИЗ
//		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл КАК ТаблицаДокумента
//		|	ГДЕ
//		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ТаблицаДокумента.Дата,
//		|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
//		|		ТаблицаДокумента.Организация,
//		|		ТаблицаДокумента.Контрагент,
//		|		ТаблицаДокумента.Договор,
//		|		ВЫБОР
//		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//		|				ТОГДА &Ссылка
//		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
//		|		КОНЕЦ,
//		|		ТаблицаДокумента.Заказ,
//		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
//		|		ТаблицаДокумента.Валюта,
//		|		ТаблицаДокумента.СуммаКурсовойРазницы,
//		|		0,
//		|		ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100))
//		//+++ Дмгг
//		|,
//		|		ТаблицаДокумента.Проект
//		//--- Дмгг
//		|	ИЗ
//		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл КАК ТаблицаДокумента
//		|	ГДЕ
//		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаДвижений
//		|
//		|СГРУППИРОВАТЬ ПО
//		//+++ Дмгг
//		//|	ТаблицаДвижений.Проект,
//		//--- Дмгг
//		|	ТаблицаДвижений.Период,
//		|	ТаблицаДвижений.Организация,
//		|	ТаблицаДвижений.Контрагент,
//		|	ТаблицаДвижений.Договор,
//		|	ТаблицаДвижений.Документ,
//		|	ТаблицаДвижений.Заказ,
//		|	ТаблицаДвижений.ТипРасчетов,
//		|	ТаблицаДвижений.Валюта,
//		|	ТаблицаДвижений.СодержаниеПроводки,
//		|	ТаблицаДвижений.ВидДвижения
//		|,
//		|	ТаблицаДвижений.Проект
//		|
//		|ИМЕЮЩИЕ
//		|	(СУММА(ТаблицаДвижений.Сумма) >= 0.005
//		|		ИЛИ СУММА(ТаблицаДвижений.Сумма) <= -0.005
//		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) >= 0.005
//		|		ИЛИ СУММА(ТаблицаДвижений.СуммаВал) <= -0.005)
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	СодержаниеПроводки,
//		|	Документ,
//		|	Заказ,
//		|	ВидДвижения
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	1 КАК НомерСтроки,
//		|	&ПериодКонтроля КАК Дата,
//		|	ТаблицаКурсовыхРазниц.Организация КАК Организация,
//		|	ТаблицаКурсовыхРазниц.Контрагент КАК Контрагент,
//		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
//		|	ТаблицаКурсовыхРазниц.Договор КАК Договор,
//		|	ТаблицаКурсовыхРазниц.Документ КАК Документ,
//		|	ТаблицаКурсовыхРазниц.Заказ КАК Заказ,
//		|	ТаблицаКурсовыхРазниц.ТипРасчетов КАК ТипРасчетов,
//		|	СУММА(ТаблицаКурсовыхРазниц.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы,
//		|	ТаблицаКурсовыхРазниц.Валюта КАК Валюта,
//		|	ТаблицаКурсовыхРазниц.СчетУчета КАК СчетУчета
//		//+++ Дмгг
//		|,
//		|	ТаблицаКурсовыхРазниц.Проект
//		//--- Дмгг
//		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиРегл
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ТаблицаДокумента.Дата КАК Дата,
//		|		ТаблицаДокумента.Организация КАК Организация,
//		|		ТаблицаДокумента.Контрагент КАК Контрагент,
//		|		ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
//		|		ТаблицаДокумента.Договор КАК Договор,
//		|		ТаблицаДокумента.Документ КАК Документ,
//		|		ТаблицаДокумента.Заказ КАК Заказ,
//		|		ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
//		|		ТаблицаДокумента.Валюта КАК Валюта,
//		|		ТаблицаДокумента.СчетУчета КАК СчетУчета,
//		|		ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы
//		//+++ Дмгг
//		|,
//		|		ТаблицаДокумента.Проект КАК Проект
//		//--- Дмгг
//		|	ИЗ
//		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл КАК ТаблицаДокумента
//		|	ГДЕ
//		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ТаблицаДокумента.Дата,
//		|		ТаблицаДокумента.Организация,
//		|		ТаблицаДокумента.Контрагент,
//		|		ТаблицаДокумента.ВестиРасчетыПоДокументам,
//		|		ТаблицаДокумента.Договор,
//		|		ВЫБОР
//		|			КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
//		|				ТОГДА &Ссылка
//		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
//		|		КОНЕЦ,
//		|		ТаблицаДокумента.Заказ,
//		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
//		|		ТаблицаДокумента.Валюта,
//		|		ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
//		|		ТаблицаДокумента.СуммаКурсовойРазницы
//		//+++ Дмгг
//		|,
//		|		ТаблицаДокумента.Проект
//		//--- Дмгг
//		|	ИЗ
//		|		ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл КАК ТаблицаДокумента
//		|	ГДЕ
//		|		ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазниц
//		|
//		|СГРУППИРОВАТЬ ПО
//		//+++ Дмгг
//		|	ТаблицаКурсовыхРазниц.Проект,
//		//--- Дмгг
//		|	ТаблицаКурсовыхРазниц.Организация,
//		|	ТаблицаКурсовыхРазниц.Контрагент,
//		|	ТаблицаКурсовыхРазниц.ВестиРасчетыПоДокументам,
//		|	ТаблицаКурсовыхРазниц.Договор,
//		|	ТаблицаКурсовыхРазниц.Документ,
//		|	ТаблицаКурсовыхРазниц.Заказ,
//		|	ТаблицаКурсовыхРазниц.ТипРасчетов,
//		|	ТаблицаКурсовыхРазниц.Валюта,
//		|	ТаблицаКурсовыхРазниц.СчетУчета
//		|;";
//		//|
//		//|////////////////////////////////////////////////////////////////////////////////
//		//|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл
//		//|;
//		//|
//		//|////////////////////////////////////////////////////////////////////////////////
//		//|УНИЧТОЖИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительнаяРегл";
//		
//	Иначе
//		
//		НомерЗапроса = 2;
//		
//		ТекстЗапроса =
//		"ВЫБРАТЬ
//		|	РасчетыОстатки.Организация КАК Организация,
//		|	РасчетыОстатки.Контрагент КАК Контрагент,
//		|	РасчетыОстатки.Договор КАК Договор,
//		|	РасчетыОстатки.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
//		|	РасчетыОстатки.Документ КАК Документ,
//		|	РасчетыОстатки.Заказ КАК Заказ,
//		|	РасчетыОстатки.ТипРасчетов КАК ТипРасчетов,
//		|	ВЫБОР
//		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
//		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателемРегл
//		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателяРегл
//		|	КОНЕЦ КАК СчетУчета,
//		|	СУММА(РасчетыОстатки.СуммаОстаток) КАК СуммаОстаток,
//		|	СУММА(РасчетыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
//		//+++ Дмгг
//		|,
//		|	РасчетыОстатки.Проект КАК Проект
//		//--- Дмгг
//		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ВременнаяТаблица.Организация КАК Организация,
//		|		ВременнаяТаблица.Контрагент КАК Контрагент,
//		|		ВременнаяТаблица.Договор КАК Договор,
//		|		ВременнаяТаблица.Документ КАК Документ,
//		|		ВременнаяТаблица.Заказ КАК Заказ,
//		|		ВременнаяТаблица.ТипРасчетов КАК ТипРасчетов,
//		|		ВременнаяТаблица.СуммаДляОстатка КАК СуммаОстаток,
//		|		ВременнаяТаблица.СуммаВалДляОстатка КАК СуммаВалОстаток
//		//+++ Дмгг
//		|,
//		|		ВременнаяТаблица.Проект КАК Проект
//		//--- Дмгг
//		|	ИЗ
//		|		ВременнаяТаблицаРасчетыСПокупателями КАК ВременнаяТаблица
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ТаблицаОстатки.Организация,
//		|		ТаблицаОстатки.Контрагент,
//		|		ТаблицаОстатки.Договор,
//		|		ТаблицаОстатки.Документ,
//		|		ТаблицаОстатки.Заказ,
//		|		ТаблицаОстатки.ТипРасчетов,
//		|		ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0),
//		|		ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0)
//		//+++ Дмгг
//		//|,
//		//|		ТаблицаОстатки.Проект
//		//--- Дмгг
//		|	ИЗ
//		|		РегистрНакопления.РасчетыСПокупателями.Остатки(
//		|				&МоментВремени,
//		//+++ Дмгг
//		//|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
//		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов, Проект) В
//		//--- Дмгг
//		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|						ВременнаяТаблицаРасчетыСПокупателями.Организация,
//		|						ВременнаяТаблицаРасчетыСПокупателями.Контрагент,
//		|						ВременнаяТаблицаРасчетыСПокупателями.Договор,
//		|						ВременнаяТаблицаРасчетыСПокупателями.Документ,
//		|						ВременнаяТаблицаРасчетыСПокупателями.Заказ,
//		|						ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов
//		//+++ Дмгг
//		|,
//		|						ВременнаяТаблицаРасчетыСПокупателями.Проект
//		//--- Дмгг
//		|					ИЗ
//		|						ВременнаяТаблицаРасчетыСПокупателями)) КАК ТаблицаОстатки
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ДвиженияДокумента.Организация,
//		|		ДвиженияДокумента.Контрагент,
//		|		ДвиженияДокумента.Договор,
//		|		ДвиженияДокумента.Документ,
//		|		ДвиженияДокумента.Заказ,
//		|		ДвиженияДокумента.ТипРасчетов,
//		|		ВЫБОР
//		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
//		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.Сумма, 0)
//		|		КОНЕЦ,
//		|		ВЫБОР
//		|			КОГДА ДвиженияДокумента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//		|				ТОГДА -ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
//		|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокумента.СуммаВал, 0)
//		|		КОНЕЦ
//		//+++ Дмгг
//		//|,
//		//|		ДвиженияДокумента.Проект
//		//--- Дмгг
//		|	ИЗ
//		|		РегистрНакопления.РасчетыСПокупателями КАК ДвиженияДокумента
//		|	ГДЕ
//		|		ДвиженияДокумента.Регистратор = &Ссылка
//		|		И ДвиженияДокумента.Период <= &ПериодКонтроля) КАК РасчетыОстатки
//		|
//		|СГРУППИРОВАТЬ ПО
//		//+++ Дмгг
//		|	РасчетыОстатки.Проект,
//		//--- Дмгг
//		|	РасчетыОстатки.Организация,
//		|	РасчетыОстатки.Контрагент,
//		|	РасчетыОстатки.Договор,
//		|	РасчетыОстатки.Документ,
//		|	РасчетыОстатки.Заказ,
//		|	РасчетыОстатки.ТипРасчетов,
//		|	РасчетыОстатки.Договор.ВалютаРасчетов,
//		|	ВЫБОР
//		|		КОГДА РасчетыОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
//		|			ТОГДА РасчетыОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
//		|		ИНАЧЕ РасчетыОстатки.Контрагент.СчетУчетаАвансовПокупателя
//		|	КОНЕЦ
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Организация,
//		|	Контрагент,
//		|	Договор,
//		|	ВалютаРасчетов,
//		|	Документ,
//		|	Заказ,
//		|	ТипРасчетов,
//		|	СчетУчета
//		//+++ Дмгг
//		|,
//		|   Проект
//		//--- Дмгг
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	1 КАК НомерСтроки,
//		|	&ПериодКонтроля КАК Дата,
//		|	ТаблицаРасчеты.Организация КАК Организация,
//		|	ТаблицаРасчеты.Контрагент КАК Контрагент,
//		|	ТаблицаРасчеты.Договор КАК Договор,
//		|	ТаблицаРасчеты.Документ КАК Документ,
//		|	ТаблицаРасчеты.Заказ КАК Заказ,
//		|	ТаблицаРасчеты.ТипРасчетов КАК ТипРасчетов,
//		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКурсовойРазницы,
//		|	ТаблицаРасчеты.Валюта КАК Валюта,
//		|	ТаблицаРасчеты.СчетУчета КАК СчетУчета
//		//+++ Дмгг
//		|,
//		|	ТаблицаРасчеты.Проект КАК Проект
//		//--- Дмгг
//		|ПОМЕСТИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиРегл
//		|ИЗ
//		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаРасчеты
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаткиПослеПроведенияРегл КАК ТаблицаОстатки
//		|		ПО ТаблицаРасчеты.Организация = ТаблицаОстатки.Организация
//		|			И ТаблицаРасчеты.Контрагент = ТаблицаОстатки.Контрагент
//		|			И ТаблицаРасчеты.Договор = ТаблицаОстатки.Договор
//		|			И ТаблицаРасчеты.Документ = ТаблицаОстатки.Документ
//		|			И ТаблицаРасчеты.Заказ = ТаблицаОстатки.Заказ
//		|			И ТаблицаРасчеты.ТипРасчетов = ТаблицаОстатки.ТипРасчетов
//		|			И ТаблицаРасчеты.Валюта = ТаблицаОстатки.ВалютаРасчетов
//		|			И ТаблицаРасчеты.СчетУчета = ТаблицаОстатки.СчетУчета
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
//		|				&МоментВремени,
//		|				Валюта В
//		|					(ВЫБРАТЬ
//		|						КонстантаВалютаУчета.Значение
//		|					ИЗ
//		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
//		|		ПО (ИСТИНА)
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
//		|				&МоментВремени,
//		|				Валюта В
//		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|						ВременнаяТаблицаРасчетыСПокупателями.Валюта
//		|					ИЗ
//		|						ВременнаяТаблицаРасчетыСПокупателями)) КАК КурсыВалютРасчетовСрезПоследних
//		|		ПО ТаблицаРасчеты.Валюта = КурсыВалютРасчетовСрезПоследних.Валюта
//		|ГДЕ
//		|	ТаблицаРасчеты.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
//		|	И (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) >= 0.005
//		|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютРасчетовСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютРасчетовСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) <= -0.005)
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	1 КАК Порядок,
//		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
//		|	ТаблицаДокумента.Дата КАК Период,
//		|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
//		|	ТаблицаДокумента.Организация КАК Организация,
//		|	ТаблицаДокумента.Контрагент КАК Контрагент,
//		|	ТаблицаДокумента.Договор КАК Договор,
//		|	ТаблицаДокумента.Документ КАК Документ,
//		|	ТаблицаДокумента.Заказ КАК Заказ,
//		|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
//		|	ТаблицаДокумента.Сумма КАК Сумма,
//		|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
//		|	ТаблицаДокумента.СчетУчета,
//		|	ТаблицаДокумента.Валюта,
//		|	ТаблицаДокумента.СодержаниеПроводки
//		//+++ Дмгг
//		|,
//		|	ТаблицаДокумента.Проект КАК Проект
//		//--- Дмгг
//		|ИЗ
//		|	ВременнаяТаблицаРасчетыСПокупателями КАК ТаблицаДокумента
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	2,
//		|	ТаблицаДокумента.НомерСтроки,
//		|	ТаблицаДокумента.Дата,
//		|	ВЫБОР
//		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
//		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//		|	КОНЕЦ,
//		|	ТаблицаДокумента.Организация,
//		|	ТаблицаДокумента.Контрагент,
//		|	ТаблицаДокумента.Договор,
//		|	ТаблицаДокумента.Документ,
//		|	ТаблицаДокумента.Заказ,
//		|	ТаблицаДокумента.ТипРасчетов,
//		|	ВЫБОР
//		|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
//		|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
//		|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
//		|	КОНЕЦ,
//		|	0,
//		|	ТаблицаДокумента.СчетУчета,
//		|	ТаблицаДокумента.Валюта,
//		|	&КурсоваяРазница
//		//+++ Дмгг
//		|,
//		|	ТаблицаДокумента.Проект
//		//--- Дмгг
//		|ИЗ
//		|	ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиРегл КАК ТаблицаДокумента
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	Порядок,
//		|	НомерСтроки
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|УНИЧТОЖИТЬ ВременнаяТаблицаОстаткиПослеПроведенияРегл";
//		
//	КонецЕсли;
//	
//	Возврат ТекстЗапроса;
//	
//КонецФункции // ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями()
