
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Компания = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяОрганизация");
	ВозможностьДобавлятьНовыеВидыОтпусков = РегистрыСведений.УчетнаяПолитикаРегл.ЗначениеПоляУчетнойПолитики("ВозможностьДобавлятьНовыеВидыОтпусков", Компания);
	ВозможностьДобавлятьНовыеВидыОтпусков = ?(ВозможностьДобавлятьНовыеВидыОтпусков = Неопределено, Ложь, ВозможностьДобавлятьНовыеВидыОтпусков);
	
	Если НЕ ВозможностьДобавлятьНовыеВидыОтпусков Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВидВариантовВидовОтпуска");
	КонецЕсли;
	
КонецПроцедуры
