
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ЗапретитьРедактированияДокументов(ПараметрКоманды);
	ПараметрыВыполненияКоманды.Источник.ОбновитьОтображениеДанных();
	ОбновитьИнтерфейс();

КонецПроцедуры

&НаСервере
Процедура ЗапретитьРедактированияДокументов(ПараметрКоманды)
	
	Для каждого ДокументСсылка Из ПараметрКоманды Цикл
		Если Не ПраваРедактированияДокументов(ДокументСсылка)  Тогда 
			Продолжить;
		КонецЕсли;
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.ЗапретРедактированияДокументов = Не ДокументОбъект.ЗапретРедактированияДокументов;
		ДокументОбъект.ДополнительныеСвойства.Вставить("ПроводитЗапретныеДляРедактированияДокументов", Истина);
		//ДокументОбъект.ПроводитЗапретныеДляРедактированияДокументов = Истина;
		Попытка
			Если ДокументОбъект.Проведен Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			Иначе 
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция ПраваРедактированияДокументов(ДокументСсылка)
	
	Возврат Пользователи.ТекущийПользователь().ПраваНаЗапретРедактированияДокументов Или ДокументСсылка.ПометкаУдаления;
	
КонецФункции
