
&Вместо("ПриОпределенииНастроекОтчета")
Процедура РасшAzRy_ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов)

	НастройкиВариантов["ВедомостьВВалюте"].Рекомендуемый = Истина;
	
	//ПодольскийАИ #УчетПроектов 01.12.2020 {
	//НастройкиВариантов["ВедомостьВВалютеПоПроекту"].Рекомендуемый = Истина;
	//ПодольскийАИ #УчетПроектов 01.12.2020 }
	
	ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов);
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры
