
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Элементы.ГруппаОбщееДеталная.Видимость	= ЗначениеЗаполнено(Объект.ТипТН);
	Элементы.ГруппаДистрибуция.Видимость	= Объект.ТипТН = Перечисления.РС_ТипыТН.ПодчиненнаяТН;
	Элементы.ВидЦены.Видимость				= Объект.ТипТН = Перечисления.РС_ТипыТН.Дистрибуция;
	
	
	пБезТранспортировки = (Объект.ТипТН = Перечисления.РС_ТипыТН.РеализацияБезТранспортировки);
	Элементы.АдресДоставки.Видимость		= НЕ пБезТранспортировки;
	Элементы.ГруппаПеревозчика.Видимость	= НЕ пБезТранспортировки И Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Перегрузчик_Автомобильная;
	Элементы.ДругойТранспорт.Видимость 		= НЕ пБезТранспортировки И Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Прочее;
	
	Если Объект.ТипТН = Перечисления.РС_ТипыТН.РеализацияСТранспортировкой ИЛИ Объект.ТипТН = Перечисления.РС_ТипыТН.ВозвратОтПокупателя Тогда
		Элементы.ЗатратаТранспортировки.Видимость = Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Автомобильная ИЛИ
													Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Автомобильная_Заграничная ИЛИ
													Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Перегрузчик_Автомобильная;
	Иначе
		Элементы.ЗатратаТранспортировки.Видимость = Ложь;
	КонецЕсли;
	Если ЭтаПеремещениеВА Тогда
		Элементы.ТоварыИмущество.Видимость		= Истина;
		Элементы.ТоварыНоменклатура.Видимость	= Ложь;
		Элементы.ТоварыХарактеристика.Видимость = Ложь;
	Иначе
		Элементы.ТоварыИмущество.Видимость		= Ложь;
		Элементы.ТоварыНоменклатура.Видимость	= Истина;
		Элементы.ТоварыХарактеристика.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Параметры.Свойство("ДокументыОснования") Тогда
		
		Для Каждого ДокументОснование Из Параметры.ДокументыОснования Цикл
			НоваяСтрока = Объект.ДокументыОснования.Добавить();
			НоваяСтрока.ДокументОснование = ДокументОснование;
		КонецЦикла;
		Если Параметры.Свойство("НакладнаяДистрибюций") Тогда 
			Объект.НакладнаяДистрибюций = Параметры.НакладнаяДистрибюций;
			СсылкаЭН = Параметры.СсылкаЭН;
			Объект.ТранспортноеСредство	= СсылкаЭН.ТранспортноеСредство;
			Объект.ГосНомерАвтомобиля	= СсылкаЭН.ГосНомерАвтомобиля;
			Объект.Водитель				= СсылкаЭН.Водитель;
			Объект.НомерУдостоверения	= СсылкаЭН.НомерУдостоверения;
			Объект.ДругойТранспорт      = СсылкаЭН.ДругойТранспорт;
		КонецЕсли;
		ЗапольнитьРеквизитиНакладной(Параметры.ДокументыОснования);
	КонецЕсли;
	СписокДокументыОснования.ЗагрузитьЗначения(Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование"));
	УстановитьПараметрыВыбора_ТипТН(Истина);	
	УстановитьВидимостьИДоступность();
	
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузополучателя, 	Объект.ГрузоПолучатель); //ГрузоПолучатель
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузоотправителя, 	Объект.ГрузоОтправитель);//ГрузоОтправитель
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННПеревозчика, 		Объект.Перевозчик);      //Перевозчик
	
	ВидТранспортировкиПриИзмененииНаСервере();// Kuzmich, 16.05.2022. ПлательщикТранспортировкиТН по-умолчанию
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТНПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
	Если Объект.ТипТН = ПредопределенноеЗначение("Перечисление.РС_ТипыТН.Дистрибуция") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ВидЦены) Тогда
			Объект.ВидЦены = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ВидыЦен", "Оптовая");
		КонецЕсли;
		ЗаполнитьЦеныПоДистрибюции();
	ИначеЕсли Объект.ТипТН = ПредопределенноеЗначение("Перечисление.РС_ТипыТН.РеализацияБезТранспортировки") Тогда
		Объект.АдресДоставки		= "";
		Объект.ВидТранспортировки	= Неопределено;
		//Объект.ДругойТранспорт		= "";
		Объект.Перевозчик			= Неопределено;
		ИННПеревозчика				= "";
		Объект.НомерУдостоверения	= "";
		Объект.Водитель				= "";
		Объект.ТранспортноеСредство = "";
		Объект.ГосНомерАвтомобиля	= "";
		Объект.Прицеп               = "";
	КонецЕсли;
КонецПроцедуры
 
 
 //<Запольнить Реквизити Накладной>
 //Запольняется таб часть
 &НаСервере
 Процедура ЗапольнитьРеквизитиНакладной(МассивДокументовОснования)
	 
	 //ЗапольнитьЗначенияШапки();
	 Если Объект.ТипТН = Перечисления.РС_ТипыТН.ВозвратОтПокупателя Тогда
		 Объект.Товары.Загрузить(ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуВозврата(МассивДокументовОснования));
	 ИначеЕсли Объект.ТипТН = Перечисления.РС_ТипыТН.ВнутреннееПеремещение ИЛИ Объект.ТипТН = Перечисления.РС_ТипыТН.Дистрибуция Тогда
		 Объект.Товары.Загрузить(ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуПеремешения(МассивДокументовОснования));
		Если Объект.ТипТН = Перечисления.РС_ТипыТН.Дистрибуция Тогда
			Объект.ВидЦены = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ВидыЦен", "Оптовая");
			ЗаполнитьЦеныПоДистрибюции();
		КонецЕсли;
	 Иначе
		 Объект.Товары.Загрузить(ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицуРеализации(МассивДокументовОснования));
	 КонецЕсли;
	 //Записать();Паганини
	 
	// УдалитьУслугиИзТаблицы();//Паганини#OneSoft: Перенес в условие, где заполняется таблица
	
	Если ТипЗнч(Объект.ГрузоПолучатель)= Тип("СправочникСсылка.Контрагенты")и Объект.ГрузоПолучатель.ПересчитатьКоличество
		Тогда 
		ПересчитатьКоличествоИзДополнительнойЕдиницыИзмеренияВОсновнуюЕдиницуИзмерения();	
	КонецЕсли;
	 
	 ДокументОбъект = РеквизитФормыВЗначение("Объект");
	 ДокументОбъект.СформироватьТаблицуЭлНакладных();
	 ДокументОбъект.СформироватьТаблицуШапкаRS();
	 ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	 Записать();//Паганини
 
 КонецПроцедуры // ()

 Процедура УдалитьУслугиИзТаблицы() 
	
	Для Каждого Стр Из Объект.Товары Цикл 
		Если Стр.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас Тогда
			Объект.Товары.Удалить(Стр);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТоварыНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда
		Записать();
	КонецЕсли;

	Объект.Товары.Очистить(); 
	ЗапольнитьРеквизитиНакладной(Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование"));
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьТовары(Команда)
	
	Если Объект.Товары.Количество() > 0 Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		ТекстВопроса = Нстр("ka='შევსებამდე გასუფთავდება არსებული საქონლის ცხრილი. გაგრძელდეს?';ru='Перед заполнением очистится табличная часть Товары. Продолжить?';en='Before filling cleared tabular section Goods. Proceed?'");
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	Иначе 
		ЗаполнитьТоварыНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе 
		ЗаполнитьТоварыНаСервере();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузоотправителя, Объект.ГрузоОтправитель);
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННГрузополучателя, Объект.ГрузоПолучатель);
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ТранспортноеСредствоПриИзмененииНаСервере();

	КонецПроцедуры

&НаСервере
Процедура ТранспортноеСредствоПриИзмененииНаСервере()
	
	//Lazare_
	Если Объект.ТранспортноеСредство = ПредопределенноеЗначение("Справочник.ТранспортныеСредства.ОбщественныйТранспорт") Тогда 
		Возврат ;	 
	КонецЕсли;
	//_Lazare	
		
	Если ТипЗнч(Объект.ТранспортноеСредство) = Тип("СправочникСсылка.ТранспортныеСредства") Тогда
		Объект.ГосНомерАвтомобиля = Объект.ТранспортноеСредство.Код;
		ОсновнойВодитель = Объект.ТранспортноеСредство.ОсновнойВодитель;
		Если ЗначениеЗаполнено(ОсновнойВодитель) Тогда
			Если НЕ ЗначениеЗаполнено(Объект.Водитель) Тогда
				Объект.Водитель 			= ОсновнойВодитель;
				Объект.НомерУдостоверения 	= ОсновнойВодитель.ИНН;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ВодительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВодительПриИзмененииНаСервере()
	
	Объект.НомерУдостоверения = Объект.Водитель.ИНН;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТН(Команда) Экспорт 
	ОбновитьДанныеОтправкиНаСервере();	
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
	
КонецПроцедуры


&НаКлиенте
Процедура Операция_ЭлНакладная(КомандаТН)
	
	ОчиститьСообщения();//Паганини
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		Если Не Объект.РучнаяКорректировка Тогда 
			ОбновитьДанныеОтправкиНаСервере();
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		КонецЕсли; 
	КонецЕсли;
	
	Результат = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбработатьОперациюТН(КомандаТН, Объект);
	Если Не Результат = 0 Тогда 
		Сообщить(Результат);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруЭлНакладных()
	
	Возврат Документы.РС_ЭлектроннаяНакладная.ПолучитьСтруктуруЭлНакладных(Объект.Ссылка);
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеОтправкиНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	//Lazare_
	Если Не ПустаяСтрока(ДокументОбъект.ТранспортноеСредство)и ДокументОбъект.ТранспортноеСредство = ПредопределенноеЗначение("Справочник.ТранспортныеСредства.ОбщественныйТранспорт")Тогда 
		ДокументОбъект.ГосНомерАвтомобиля = ДокументОбъект.ТранспортноеСредство.Наименование ;
	КонецЕсли ;	
	//_Lazare	
	ДокументОбъект.СформироватьТаблицуЭлНакладных();
	ДокументОбъект.СформироватьТаблицуШапкаRS();
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеОтправки(Команда)
	ОбновитьДанныеОтправкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусТН(Команда) Экспорт
	ОбновитьДанныеОтправкиНаСервере();
	Если ЗначениеЗаполнено(Объект.ID_ТН) Тогда
		Операция_ЭлНакладная(Команда.Имя);
		Прочитать();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьИД(Команда)
	Элементы.ID_ТН.ТолькоПросмотр = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьТН(Команда) Экспорт
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьТН(Команда) Экспорт
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьТН(Команда) Экспорт
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос(НСтр("ru = 'Вы уверены что хотите отменить ТН?';"
	+ " ka = 'დარწმუნებული ხართ რომ გნებავთ ზედნადების გაუქმება?'"), Режим, 0);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИАктивироватьТН(Команда) Экспорт
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

//Паганини
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.Сумма 	= ТекДанные.Количество	* ТекДанные.Цена;
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.Сумма 	= ТекДанные.Количество	* ТекДанные.Цена;
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.Цена 	= ?(ТекДанные.Количество = 0, 0, Окр(ТекДанные.Сумма / ТекДанные.Количество, 2));
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры



&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.ЕдиницаИзмерения 	= ПолучитьЗначенияРеквизита(ТекДанные.Номенклатура, "ЕдиницаИзмерения");
	ТекДанные.СтавкаНДС 		= ПолучитьЗначенияРеквизита(ТекДанные.Номенклатура, "СтавкаНДС");
	СтавкаНДС = ПолучитьЗначенияРеквизита(ТекДанные.СтавкаНДС, "Ставка");
	ТекДанные.СуммаНДС	= Окр(ТекДанные.Сумма	* СтавкаНДС/(100 + СтавкаНДС), 2);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначенияРеквизита(Ссылка, ИмяРеквизита)
	Возврат Ссылка[ИмяРеквизита];
КонецФункции

&НаКлиенте
Процедура ВидТранспортировкиПриИзменении(Элемент)
	ВидТранспортировкиПриИзмененииНаСервере();// Kuzmich, 16.05.2022. ПлательщикТранспортировкиТН по-умолчанию
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаСервере
Процедура ВидТранспортировкиПриИзмененииНаСервере()
	// Kuzmich, 17.05.2022. ПлательщикТранспортировкиТН по-умолчанию
	Если Константы.ПлательщикТранспортировкиТН_в_Организации.Получить() Тогда
		
		Если Объект.ТипТН = Перечисления.РС_ТипыТН.РеализацияСТранспортировкой ИЛИ Объект.ТипТН = Перечисления.РС_ТипыТН.ВозвратОтПокупателя Тогда
			Если Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Автомобильная
				ИЛИ Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Автомобильная_Заграничная
				ИЛИ	Объект.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Перегрузчик_Автомобильная
				Тогда
				Если ЗначениеЗаполнено(Объект.Организация) Тогда
					Объект.ПлательщикТранспортировкиТН = Объект.Организация.ПлательщикТранспортировкиТН;
				Иначе
					Объект.ПлательщикТранспортировкиТН = Перечисления.ПлательщикТранспортировкиТН.ПустаяСсылка();
				КонецЕсли;
			Иначе
				Объект.ПлательщикТранспортировкиТН = Перечисления.ПлательщикТранспортировкиТН.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;
	// Kuzmich, 17.05.2022. ПлательщикТранспортировкиТН по-умолчанию
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикПриИзменении(Элемент)
	ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ИННПеревозчика, Объект.Перевозчик);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьИНН_ПеревозчикаГрузоотправителяГрузополучателя(ПолеИНН, Контрагент)
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ПолеИНН = Контрагент.ИНН;
	Иначе
		ПолеИНН = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)
	ЗаполнитьЦеныПоДистрибюции();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныПоДистрибюции()
	Если Константы.ЦенаИСуммаВПеремешении.Получить() Тогда
		Возврат;
	КонецЕсли;	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл 
		РС_ОбщегоНазначения.ЗаполнитьЦену(СтрокаТЧ, Объект.ВидЦены);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбора_ТипТН(ПриОткрытии = Ложь)
	
	ЭтаПеремещениеВА = Ложь;
	Если СписокДокументыОснования.Количество() = 0 Тогда
		Объект.ДокументыОснования.Очистить();
		Возврат;
	КонецЕсли;
	ТипЗнченияДокумента = ТипЗнч(СписокДокументыОснования[0].Значение);
	ЭтаПеремещениеВА	= (ТипЗнченияДокумента = Тип("ДокументСсылка.ПеремещениеВА"));
	
	Если СписокДокументыОснования[0].Значение <> Неопределено Тогда
		Попытка
			ВидОперации = СписокДокументыОснования[0].Значение.ВидОперации;
		Исключение
		КонецПопытки;
	КонецЕсли;	
	
	Массив_ТипТН = Новый Массив;
	Если ТипЗнченияДокумента = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ВнутреннееПеремещение"));
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.Дистрибуция"));
	ИначеЕсли ТипЗнченияДокумента = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ВозвратОтПокупателя"));
	ИначеЕсли ЭтаПеремещениеВА Тогда
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ВнутреннееПеремещение"));
	Иначе
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ПодчиненнаяТН"));
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.РеализацияБезТранспортировки"));
		Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.РеализацияСТранспортировкой"));
		Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку") Тогда
			Массив_ТипТН.Добавить(ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ВнутреннееПеремещение"));
		КонецЕсли;				
	КонецЕсли;
	
	Элементы.ТипТН.СписокВыбора.ЗагрузитьЗначения(Массив_ТипТН);
	
	Если НЕ ПриОткрытии И Массив_ТипТН.Найти(Объект.ТипТН) = Неопределено Тогда
		Если ТипЗнченияДокумента = Тип("ДокументСсылка.ПеремещениеЗапасов") ИЛИ
			 ТипЗнченияДокумента = Тип("ДокументСсылка.ПеремещениеВА") Тогда
			Объект.ТипТН = ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ВнутреннееПеремещение");
		ИначеЕсли ТипЗнченияДокумента = Тип("ДокументСсылка.ЗаказПокупателя") Тогда	
			Объект.ТипТН = ПредопределенноеЗначение("Перечисление.РС_ТипыТН.РеализацияСТранспортировкой");	
		ИначеЕсли ТипЗнченияДокумента = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			Объект.ТипТН = ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ВозвратОтПокупателя");
		Иначе
			Объект.ТипТН = ПредопределенноеЗначение("Перечисление.РС_ТипыТН.РеализацияСТранспортировкой");
			Если ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку Тогда
				Объект.ТипТН = ПредопределенноеЗначение("Перечисление.РС_ТипыТН.ВнутреннееПеремещение");
			КонецЕсли;
		КонецЕсли;
		УстановитьВидимостьИДоступность();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументыОснованияПриИзменении(Элемент)
	УстановитьПараметрыВыбора_ТипТН();
	Модифицированность = Истина;
КонецПроцедуры

#Область ОбработчикиБиблиотек
// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ДокументыОснования.Очистить();
	Для Каждого ЗнДокумента ИЗ СписокДокументыОснования Цикл
		НоваяСтрока = Объект.ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ЗнДокумента.Значение;
	КонецЦикла;
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПеревозчику(Команда)
	ОбновитьДанныеОтправкиНаСервере();
	Операция_ЭлНакладная(Команда.Имя);
	Прочитать();
КонецПроцедуры

//++Lazare 05.06.2022
&НаСервере
Процедура ПересчитатьКоличествоИзДополнительнойЕдиницыИзмеренияВОсновнуюЕдиницуИзмерения()
		
	Для Каждого Стр Из Объект.Товары Цикл 	
		
		Если ТипЗнч(Стр.ЕдиницаИзмерения)= ТИП("СправочникСсылка.КлассификаторЕдиницИзмерения")и Стр.ЕдиницаИзмерения.ПересчитатьКоличествоВТТН Тогда 	
			СпЕдиницыИзмерения = ПолучитьЕдиницыИзмеренияНоманклатры(Стр.номенклатура);
			Если СпЕдиницыИзмерения <> Неопределено Тогда 
				Стр.Количество  = Стр.Количество / СпЕдиницыИзмерения.Коэффициент;
				Стр.Цена        = Стр.Цена * СпЕдиницыИзмерения.Коэффициент;
				Стр.Сумма       = Стр.Количество * Стр.Цена;
				Стр.ЕдиницаИзмерения  = СпЕдиницыИзмерения;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	 
 КонецПроцедуры
 
 &Насервере
 Функция  ПолучитьЕдиницыИзмеренияНоманклатры(Номенклатруа)
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст =  
	 "ВЫБРАТЬ
	 |	ЕдиницыИзмерения.Ссылка КАК ЕдиницыИзмерения
	 |ИЗ
	 |	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	 |ГДЕ
	 |	ЕдиницыИзмерения.Владелец = &Владелец
	 |	И ЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ";
	 
	 Запрос.УстановитьПараметр("Владелец",Номенклатруа);
	 
	 РезЗапроса = Запрос.Выполнить().Выгрузить();
	 
	 Если РезЗапроса.Количество()> 0 Тогда 
		 Возврат РезЗапроса[0].ЕдиницыИзмерения;
	 КонецЕсли;      	 
	 
 КонецФункции
 //--Lazare 05.06.2022



