#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция возвращает список имен «ключевых» реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ВидНалога");
	//Паганини ПФ_
	Результат.Добавить("ВидНалогаВыплат");
	Результат.Добавить("СтавкаНДФЛ");
	Результат.Добавить("Контрагент");
	Результат.Добавить("Договор");
	Результат.Добавить("СтавкаПФ");
	Результат.Добавить("ПенсионныйНалогСотрудника");
	Результат.Добавить("ПенсионныйНалогОрганизации");
	Результат.Добавить("СчетЗатратРегл");
	Результат.Добавить("ВидУдержанияНДФЛ");
	Результат.Добавить("ВидУдержанияПФ");
	//_Паганини ПФ	
	Результат.Добавить("Тип");
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

#КонецЕсли