
Функция ВыполнитьОчистку() Экспорт

	П = Новый Структура;
	П.Вставить("Ошибка", Ложь);
	П.Вставить("Текст", "");
	
	НачатьТранзакцию();
	
	Попытка				
		ОчисткаДокументов();
	Исключение
		ОтменитьТранзакцию();
		П.Вставить("Ошибка", Истина);
		П.Вставить("Текст", НСтр("ru = 'Ошибка'; ka = 'შეცდომა'") + " - " + ОписаниеОшибки());
		Возврат П;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	П.Вставить("Текст", НСтр("ru = 'Удаление записей прошло успешно'; ka = 'ჩანაწერების წაიშალა წარმატებით'"));
	Возврат П;

КонецФункции

Процедура ОчисткаДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаРаботу.Ссылка
	|ИЗ
	|	Документ.ЗаданиеНаРаботу КАК ЗаданиеНаРаботу
	|ГДЕ
	|	ЗаданиеНаРаботу.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаНачало));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаКонец));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ДокОбъект.УстановитьПометкуУдаления(Истина);
		ДокОбъект.Удалить();
	КонецЦикла;	
	
КонецПроцедуры

  