Функция ДанныеЗапроса(Запрос, ИмяТаблицы) Экспорт
	
	ДанныеТаблицы = Новый Запрос;
	ДанныеТаблицы.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ДанныеТаблицы.Текст =
	"Выбрать *
	|    Из "+ИмяТаблицы+"
	|";
	
	Возврат ДанныеТаблицы.Выполнить().Выгрузить();
	
КонецФункции 

Функция ДанныеЗапроса2(Запрос, ТекстЗапроса) Экспорт
	
	ДанныеТаблицы = Новый Запрос;
	ДанныеТаблицы.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ДанныеТаблицы.Текст = ТекстЗапроса;
	
	Возврат ДанныеТаблицы.Выполнить().Выгрузить();
	
КонецФункции 

 // ПроверкаКонтрагентаПоИНН
Функция ПроверкаКонтрагентаПоИНН(ИНН, Объект) Экспорт 

	ИННПР = СтрЗаменить(ИНН, " ", "");
	НайденКонтрагент = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	                |	Контрагенты.ИНН,
	                |	Контрагенты.Ссылка
	                |ИЗ
	                |	Справочник.Контрагенты КАК Контрагенты
	                |ГДЕ
	                |	Контрагенты.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", ИННПР);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НайденКонтрагент = Истина;			
		Сообщение = Новый СообщениеПользователю();
		Текст = "კონტრაგენტი ინნ-ით " + "(" + ИННПР + ")" + " უკვე არსებობს სისტემაში! ნაპოვნი კონტრაგენტი: (" + Выборка.Ссылка.Наименование + ")";
		Сообщение.Текст = Текст;
		Сообщение.Поле = "Объект.ИНН"; 
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();		
	КонецЦикла;

	Возврат НайденКонтрагент;

КонецФункции // ПроверкаКонтрагентаПоИНН()

 // ПроверкаНоменклатурыПоАртикуле
Функция ПроверкаНоменклатурыПоАртикуле(Артикул, Объект) Экспорт 

	//ИННПР = СтрЗаменить(Артикул, " ", "");
	НайденОбъект = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка,
	               |	Номенклатура.Артикул
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Артикул", Артикул);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НайденОбъект = Истина;			
		Сообщение = Новый СообщениеПользователю();
		Текст = "ნომენკლატურა არტიკულით " + "(" + Артикул + ")" + " უკვე არსებობს სისტემაში! ნაპოვნი ნომენკლატურა: (" + Выборка.Ссылка.Наименование + ")";
		Сообщение.Текст = Текст;
		Сообщение.Поле = "Объект.Артикул"; 
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();		
	КонецЦикла;

	Возврат НайденОбъект;

КонецФункции // ПроверкаКонтрагентаПоИНН()


 // Наименование печатной формы документа на грузинском
Процедура ГРНаимПечФормыДляПочты() Экспорт

	
	
КонецПроцедуры // ГРНаимПечФормыДляПочты()

Функция КоличествоРабочихДнейВМесяце(Год, ДатаГрафика1, ДатаГрафика2) Экспорт

	К = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК КоличествоРабочихДнейВМесяце
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		|ГДЕ
		|	КалендарныеГрафики.Год = &Год
		|	И КалендарныеГрафики.Календарь = &Календарь
		|	И КалендарныеГрафики.ДатаГрафика МЕЖДУ &ДатаГрафика1 И &ДатаГрафика2
		|	И КалендарныеГрафики.ДеньВключенВГрафик = &ДеньВключенВГрафик";

	Запрос.УстановитьПараметр("Год", Год);
	Запрос.УстановитьПараметр("ДатаГрафика1", ДатаГрафика1);
	Запрос.УстановитьПараметр("ДатаГрафика2", ДатаГрафика2);
	Запрос.УстановитьПараметр("ДеньВключенВГрафик", Истина);
	Запрос.УстановитьПараметр("Календарь", Справочники.AzRyНастройки.Календари.Значение);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого ТекСтрока Из РезультатЗапроса Цикл
	
		К = ТекСтрока.КоличествоРабочихДнейВМесяце;
	
	КонецЦикла;

	Возврат К;
	
КонецФункции // Количе()

//////////////////////////////////////////////////////////////////////////////////////////
//                         ГЛОБАЛЬНЫЙ ОБРАБОТЧИК СОБЫТИЯ СПРАВОЧНИКА
//////////////////////////////////////////////////////////////////////////////////////////

// Процедура-обработчик события "ПередЗаписью" Справочника 
Процедура ПоправкаИННРеквизитаКонтрагента(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Контрагенты") Тогда
		Если Не Источник.ЭтоГруппа Тогда 
			Источник.ИНН = СтрЗаменить(Источник.ИНН, " ", "");		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
 

 //////////////////////////////////////////////////////////////////////////////////////////
 //                         ТЗ АКТИВНЫЕ ПОЛЬЗОВАТЕЛИ
 
 
Функция АктивныеСотрудники(ДатаОбновления, Организация, СтруктурнаяЕдиница, МассивСотрудники = Неопределено) Экспорт
	
	Парам = ?(МассивСотрудники = Неопределено, "", " И СотрудникиСрезПоследних.Сотрудник В(&Сотрудники) ");
	
	// 1) ТЗ Активных сотрудников
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СотрудникиСрезПоследних.Период,
	               |	СотрудникиСрезПоследних.Регистратор,
	               |	СотрудникиСрезПоследних.НомерСтроки,
	               |	СотрудникиСрезПоследних.Активность,
	               |	СотрудникиСрезПоследних.Организация,
	               |	СотрудникиСрезПоследних.Сотрудник,
	               |	СотрудникиСрезПоследних.СтруктурнаяЕдиница,
				   |	СотрудникиСрезПоследних.AzRyDivision,
	               |	СотрудникиСрезПоследних.Должность,
	               |	СотрудникиСрезПоследних.ЗанимаемыхСтавок,
	               |	СотрудникиСрезПоследних.ГрафикРаботы
	               |ИЗ
	               |	РегистрСведений.Сотрудники.СрезПоследних(&Дата, ) КАК СотрудникиСрезПоследних
	               |ГДЕ
	               |	СотрудникиСрезПоследних.Организация = &Организация
				   |	И НЕ СотрудникиСрезПоследних.Регистратор ССЫЛКА Документ.Увольнение
	               |	И СотрудникиСрезПоследних.СтруктурнаяЕдиница В(&СтруктурнаяЕдиница) " + Парам;
				   
				   
	Запрос.Текст = Запрос.Текст +               
	               "ОБЪЕДИНИТЬ ВСЕ
	               |ВЫБРАТЬ
	               |	СотрудникиСрезПоследних.Период,
	               |	СотрудникиСрезПоследних.Регистратор,
	               |	СотрудникиСрезПоследних.НомерСтроки,
	               |	СотрудникиСрезПоследних.Активность,
	               |	СотрудникиСрезПоследних.Организация,
	               |	СотрудникиСрезПоследних.Сотрудник,
	               |	СотрудникиСрезПоследних.СтруктурнаяЕдиница,
				   |	СотрудникиСрезПоследних.AzRyDivision,
	               |	СотрудникиСрезПоследних.Должность,
	               |	СотрудникиСрезПоследних.ЗанимаемыхСтавок,
	               |	СотрудникиСрезПоследних.ГрафикРаботы
	               |ИЗ
	               |	РегистрСведений.Сотрудники.СрезПоследних(&Период2, НЕ Регистратор ССЫЛКА Документ.Увольнение) КАК СотрудникиСрезПоследних
	               |ГДЕ
	               |	СотрудникиСрезПоследних.Организация = &Организация
	               |	И СотрудникиСрезПоследних.СтруктурнаяЕдиница В(&СтруктурнаяЕдиница)
	               //|	И СотрудникиСрезПоследних.Период МЕЖДУ &Период1 И &Период2
	               |	И СотрудникиСрезПоследних.Сотрудник В
	               |			(ВЫБРАТЬ
	               |				СотрудникиСрезПоследних.Сотрудник
	               |			ИЗ
	               |				РегистрСведений.Сотрудники КАК СотрудникиСрезПоследних
	               |			ГДЕ
	               |				СотрудникиСрезПоследних.Регистратор ССЫЛКА Документ.Увольнение
	               |				И СотрудникиСрезПоследних.Организация = &Организация
	               |				И СотрудникиСрезПоследних.Период МЕЖДУ &Период1 И &Период2)" + Парам;
	
	Запрос.УстановитьПараметр("Дата", ДатаОбновления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сотрудники", МассивСотрудники);
	Запрос.УстановитьПараметр("Период1", НачалоМесяца(ДатаОбновления));
	Запрос.УстановитьПараметр("Период2", КонецМесяца(ДатаОбновления));
	
	Возврат Запрос.Выполнить().Выгрузить();
 
 КонецФункции 
  
Функция ВсеАктивныеСотрудники(ДатаОбновления, ВидНачисленияУдержания=Неопределено) Экспорт
	
	Если ВидНачисленияУдержания = Неопределено Тогда 
		ДопЗапрос = "";	
	Иначе 
		ДопЗапрос = "		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(&Дата, ВидНачисленияУдержания = &ВидНачисленияУдержания) КАК ПлановыеНачисленияИУдержанияСрезПоследних
	                 |		ПО СотрудникиСрезПоследних.Сотрудник = ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник
	                 |			И СотрудникиСрезПоследних.Организация = ПлановыеНачисленияИУдержанияСрезПоследних.Организация";
	КонецЕсли;
	
	 // 1) ТЗ Активных сотрудников
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	СотрудникиСрезПоследних.Период,
	                |	СотрудникиСрезПоследних.Регистратор,
	                |	СотрудникиСрезПоследних.НомерСтроки,
	                |	СотрудникиСрезПоследних.Активность,
	                |	СотрудникиСрезПоследних.Организация,
	                |	СотрудникиСрезПоследних.Сотрудник,
	                |	СотрудникиСрезПоследних.СтруктурнаяЕдиница,
	                |	СотрудникиСрезПоследних.Должность,
	                |	СотрудникиСрезПоследних.ЗанимаемыхСтавок,
	                |	СотрудникиСрезПоследних.ГрафикРаботы
	                |	" + ?(ВидНачисленияУдержания = Неопределено, "", ", ЕСТЬNULL(ПлановыеНачисленияИУдержанияСрезПоследних.Сумма, 0) КАК Сумма") +  
	                " ИЗ
	                  |	РегистрСведений.Сотрудники.СрезПоследних(&Дата, ) КАК СотрудникиСрезПоследних " + ДопЗапрос;   
	 
	 Запрос.УстановитьПараметр("Дата", ДатаОбновления);
	 Запрос.УстановитьПараметр("ВидНачисленияУдержания", ВидНачисленияУдержания);
	 
	 РезультатТЗ = Запрос.Выполнить().Выгрузить();
	 
	 МассивУ = Новый Массив;
	 
	 Для каждого ТекСтрока Из РезультатТЗ Цикл	    
		 Если ТипЗнч(ТекСтрока.Регистратор) =  Тип("ДокументСсылка.Увольнение") Тогда 
			 МассивУ.Добавить(ТекСтрока);
		 КонецЕсли;		
	 КонецЦикла;
	 
	 Для каждого ТекМассив Из МассивУ Цикл	
		 РезультатТЗ.Удалить(ТекМассив);	
	 КонецЦикла;

	 Возврат РезультатТЗ;
 
 КонецФункции

Функция АктивныеСотрудникиДжира(Дата) Экспорт

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаданияНаРаботу.Сотрудник
		|ИЗ
		|	РегистрНакопления.ЗаданияНаРаботу КАК ЗаданияНаРаботу
		|ГДЕ
		|	ЗаданияНаРаботу.Период МЕЖДУ &Период1 И &Период2";

	Запрос.УстановитьПараметр("Период1", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Период2", КонецМесяца(Дата));

	Возврат Запрос.Выполнить().Выгрузить(); //test.	

КонецФункции
  

 //////////////////////////////////////////////////////////////////////////////////////////
 //                           ГЛ  ПОДПИСКИ НА СОБЫТИЯ
 //////////////////////////////////////////////////////////////////////////////////////////
 
Процедура ЗапретСозданиеДокументаКопированием(Источник, ОбъектКопирования) Экспорт
	
	//Обнулит реквизиты при копирований -------------------------
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РасходнаяНакладная") Тогда  
		Источник.AzRySynch_RS_GE = Ложь;
		Источник.AzRyWayBill_ID  = "";
		Источник.AzRyWayBill_NUMBER = "";
		Источник.AzRy_STATUS = "";
		//Источник.AzRyWayBill_TRANSPORT_COAST = "";
		//Источник.AzRyWayBill_TRAN_COST_PAYER = "";
		//Источник.AzRyWayBilll_TRANSPORT_TYPES = Неопределено;
		//Источник.AzRyWayBilll_TRANSPORT_TYPES_TXT = "";
		//Источник.AzRyWayBilll_TYPES = "";
		//Источник.AzRyWayBilll_АдресДоставки = "";
		//Источник.AzRyWayBilll_АдресОтправки = "";
		//Источник.AzRyWayBilll_Водителы = Неопределено;
		Источник.AzRy_s_user_id = "";
		Источник.AzRy_su = "";
		Источник.AzRy_un_id = "";
		
		Для каждого ТекСтрока Из Источник.Запасы Цикл
			ТекСтрока.AzRyWayBill_ID = "";
			ТекСтрока.AzRyWayBillERROR = "";
		КонецЦикла;		
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.АктВыполненныхРабот") Тогда  
		
		Источник.Предоплата.Очистить();
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РасходнаяНакладная") Тогда  
		
		Источник.Предоплата.Очистить();	
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ДополнительныеРасходы") Тогда  
		
		Источник.Предоплата.Очистить();	
		
	КонецЕсли;
	
	// Запрет копирование документа для бугалтера
	Если РольДоступна("Бугалтер") Тогда  
		ВызватьИсключение НСтр("ru = 'Копирование документа запрешено!'; ka = 'დოკუმენტის შექმნა კოპირებით აკრძალულია'");
	КонецЕсли;
	 
 КонецПроцедуры
 
 //////////////////////////////////////////////////////////////////////////////////////////
 //                                 E.Xpert
 
Функция ExpertФорматСумми(Сумма) Экспорт
	 
	 Возврат Формат(Сумма, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
 
 КонецФункции // ExpertФорматСумм()
 
Функция ExpertФорматКоличество(Количество) Экспорт
	 
	 Возврат Формат(Количество, "ЧЦ=15; ЧДЦ=3; ЧРД=.; ЧГ=0");
 
 КонецФункции // ExpertФорматСумм()
 
 //////////////////////////////////////////////////////////////////////////////////////////
 //                                WAYBILLS RS.GE
 
Процедура ОтразитьWAYBILLS(ДокументСсылка, Отказ) Экспорт
	 
	 Если СокрЛП(ДокументСсылка.AzRy_STATUS) <> "1" И СокрЛП(ДокументСсылка.AzRy_STATUS) <> "" Тогда
		 ТекстОщибки = "სტატუსი არ იძლევა შესაძლებლობას ზედნადების RS.GE - სთან სინქრონიზაციას. ზედნადები განახლდა მხოლოდ ლოკალურად. ზედნადების სტატუსია: " + СокрЛП(ДокументСсылка.AzRy_STATUS);
		 УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ДокументСсылка, ТекстОщибки, , , , );
		 Возврат;
	 КонецЕсли;	 
	 
	 Если ДокументСсылка.AzRySynch_RS_GE Тогда 
		 Если Не Отказ Тогда 
			 Если ДокументСсылка.Проведен Тогда 
				 
				 AzRyEservices_RS_GE = Обработки.AzRyEservices_RS_GE.Создать();
				 
				 // 1) Проверка ИНН контрагента на коректность			
				 СтруктураОтветПИНН = AzRyEservices_RS_GE.get_name_from_tin(ДокументСсылка.Контрагент, ДокументСсылка.Организация);
				 
				 Если СтруктураОтветПИНН.Ощибка Тогда 
					 //Режим = РежимДиалогаВопрос.ДаНет;
					 //ОбщегоНазначения.СообщитьОбОшибке(СтруктураОтветПИНН.ТекстОщибки, , "WayBill: შეტყობინება!", СтатусСообщения.Информация);
					 //Ответ = Вопрос(СтруктураОтветПИНН.ТекстОщибки + " გავაგრძელო ოპერაციის შესრულება?", Режим, 0);
					 //Если Ответ = КодВозвратаДиалога.Нет Тогда
					 //	Отказ = Истина;
					 //	Возврат;
					 //КонецЕсли;
					 УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ДокументСсылка, СтруктураОтветПИНН.ТекстОщибки,,,"КонтрагентИНН", Отказ);
					 Возврат;
				 КонецЕсли;									
				 
				 СтруктураОтвет = AzRyEservices_RS_GE.save_waybill(ДокументСсылка, ДокументСсылка.Организация);
				 
				 Если СтруктураОтвет.Ощибка Тогда 
					 ТекстОщибки = "ელ. ზედნადების შექმნა ვერ მოხერხდა! გთხოვთ მოახდინოთ ლოკალური ზედნადების სინქრონიზაცია ელ. ზედნადების ბაზასთან მოგვიანებით. შეცდომის კოდი: ( " + СтруктураОтвет.ТекстОщибки + ", კოდის განმარტება: " + ТекстОшибкиПоКоду(СтруктураОтвет.ТекстОщибки) + ")";
					 УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ДокументСсылка, ТекстОщибки, , , , Отказ);
					 //УправлениеНебольшойФирмойСервер.СообщитьОбОшибке("ელ. ზედნადების შექმნა ვერ მოხერხდა! გთხოვთ მოახდინოთ ლოკალური ზედნადების სინქრონიზაცია ელ. ზედნადების ბაზასთან მოგვიანებით. შეცდომის კოდი: (" + СтруктураОтвет.ТекстОщибки + ")", , "WayBill: შეტყობინება!", СтатусСообщения.ОченьВажное);
				 Иначе							
					 Текст = "ელ. ზედნადების ბაზასთან სინქრონიზაციამ ჩაიარა წარმატებით.";
					 УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ДокументСсылка, Текст, , , , );
					 //УправлениеНебольшойФирмойСервер.СообщитьОбОшибке("ელ. ზედნადების ბაზასთან სინქრონიზაციამ ჩაიარა წარმატებით.", , "WayBill: შეტყობინება!", СтатусСообщения.Информация);
					 //AzRyWayBill_Модифицированность = Истина;
					 ОтветРезултат = AzRyEservices_RS_GE.ОбновитьДокументРТУДаннымиWaiBill(ДокументСсылка, СтруктураОтвет);			
					 Если ОтветРезултат Тогда 
						 Текст = "ლოკალურ დოკუმენტში ელ. ზედნადების დამატებამ ჩაიარა წარმატებით.";
						 УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ДокументСсылка, Текст, , , , );
						 //ОбщегоНазначения.СообщитьОбОшибке("ლოკალურ დოკუმენტში ელ. ზედნადების დამატებამ ჩაიარა წარმატებით.", , "WayBill: შეტყობინება!", СтатусСообщения.Информация);
					 Иначе 
						 ТекстОщибки = "ლოკალურ დოკუმენტში ელ. ზედნადების დამატებამ ჩაიარა წარუმატებლად.";
						 УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ДокументСсылка, ТекстОщибки, , , , );
						 //ОбщегоНазначения.СообщитьОбОшибке("ლოკალურ დოკუმენტში ელ. ზედნადების დამატებამ ჩაიარა წარუმატებლად.", , "WayBill: შეტყობინება!", СтатусСообщения.ОченьВажное);
					 КонецЕсли;	
				 КонецЕсли;
				 
			 КонецЕсли;
		 КонецЕсли;
	 КонецЕсли;
 
 КонецПроцедуры
  
Процедура AzRyОбновлениеСтатусовWayBills() Экспорт
	 
	 обработкаОбъект = Обработки.AzRyEservices_RS_GE.Создать();
	 
	 Выборка = Справочники.Организации.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 
		 Ответ = обработкаОбъект.ОбновлениеСтатусовНакладных(Выборка.Ссылка);
		 
	 КонецЦикла;
	 
КонецПроцедуры

Функция ТекстОшибкиПоКоду(ID)
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AzRyWayBilll_ERRORS.Ссылка,
		|	AzRyWayBilll_ERRORS.ВерсияДанных,
		|	AzRyWayBilll_ERRORS.ПометкаУдаления,
		|	AzRyWayBilll_ERRORS.Предопределенный,
		|	AzRyWayBilll_ERRORS.Код,
		|	AzRyWayBilll_ERRORS.Наименование,
		|	AzRyWayBilll_ERRORS.ID,
		|	AzRyWayBilll_ERRORS.TYPE
		|ИЗ
		|	Справочник.AzRyWayBilll_ERRORS КАК AzRyWayBilll_ERRORS
		|ГДЕ
		|	AzRyWayBilll_ERRORS.ID = &ID";

	Запрос.УстановитьПараметр("ID", СокрЛП(ID));

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекстОшибки = ВыборкаДетальныеЗаписи.Наименование;
	КонецЦикла;	
	
	Возврат ТекстОшибки;
	
КонецФункции	

//Функция ТЗСуммаВНацВалютеДля_RS_GE(МоментВремени, Организация, Ссылка) Экспорт
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
//		|	&Организация КАК Организация,
//		|	ВЫБОР
//		|		КОГДА ТИПЗНАЧЕНИЯ(РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
//		|			ТОГДА РасходнаяНакладнаяЗапасы.Количество
//		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Количество * РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения.Коэффициент
//		|	КОНЕЦ КАК Количество,
//		|	РасходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
//		|	ВЫРАЗИТЬ(ВЫБОР
//		|			КОГДА РасходнаяНакладнаяЗапасы.Ссылка.НДСВключатьВСтоимость
//		|				ТОГДА 0
//		|			ИНАЧЕ ВЫБОР
//		|					КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
//		|						ТОГДА РасходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
//		|					ИНАЧЕ РасходнаяНакладнаяЗапасы.СуммаНДС * РасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * РасходнаяНакладнаяЗапасы.Ссылка.Кратность)
//		|				КОНЕЦ
//		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
//		|	ВЫРАЗИТЬ(ВЫБОР
//		|			КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
//		|				ТОГДА РасходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
//		|			ИНАЧЕ РасходнаяНакладнаяЗапасы.СуммаНДС * РасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * РасходнаяНакладнаяЗапасы.Ссылка.Кратность)
//		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСЗакупкиПродажи,
//		|	ВЫРАЗИТЬ(ВЫБОР
//		|			КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
//		|				ТОГДА РасходнаяНакладнаяЗапасы.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
//		|			ИНАЧЕ РасходнаяНакладнаяЗапасы.Всего * РасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * РасходнаяНакладнаяЗапасы.Ссылка.Кратность)
//		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
//		|	ВЫРАЗИТЬ(ВЫБОР
//		|			КОГДА РасходнаяНакладнаяЗапасы.Ссылка.НДСВключатьВСтоимость
//		|				ТОГДА 0
//		|			ИНАЧЕ ВЫБОР
//		|					КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
//		|						ТОГДА РасходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * РасходнаяНакладнаяЗапасы.Ссылка.Кратность / (РасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
//		|					ИНАЧЕ РасходнаяНакладнаяЗапасы.СуммаНДС
//		|				КОНЕЦ
//		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСВал,
//		|	ВЫРАЗИТЬ(ВЫБОР
//		|			КОГДА РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
//		|				ТОГДА РасходнаяНакладнаяЗапасы.Всего * КурсыРегВалюты.Курс * РасходнаяНакладнаяЗапасы.Ссылка.Кратность / (РасходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
//		|			ИНАЧЕ РасходнаяНакладнаяЗапасы.Всего
//		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаВал,
//		|	РасходнаяНакладнаяЗапасы.Всего КАК СуммаРасчетовПринятыеПереданные,
//		|	РасходнаяНакладнаяЗапасы.Номенклатура,
//		|	РасходнаяНакладнаяЗапасы.Характеристика,
//		|	РасходнаяНакладнаяЗапасы.Партия,
//		|	РасходнаяНакладнаяЗапасы.Количество КАК Количество1,
//		|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения,
//		|	РасходнаяНакладнаяЗапасы.Цена,
//		|	РасходнаяНакладнаяЗапасы.Сумма КАК СуммаНацВал,
//		|	РасходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС1,
//		|	РасходнаяНакладнаяЗапасы.СуммаНДС КАК СуммаНДС1
//		|ИЗ
//		|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
//		|				&МоментВремени,
//		|				Валюта В
//		|					(ВЫБРАТЬ
//		|						КонстантаВалютаУчета.Значение
//		|					ИЗ
//		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты
//		|		ПО (ИСТИНА)
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
//		|				&МоментВремени,
//		|				Валюта В
//		|					(ВЫБРАТЬ
//		|						КонстантаНациональнаяВалюта.Значение
//		|					ИЗ
//		|						Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты
//		|		ПО (ИСТИНА),
//		|	Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта
//		|ГДЕ
//		|	РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка";
//	
//	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
//	Запрос.УстановитьПараметр("Организация", Организация);
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	
//	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
//	
//	Возврат РезультатЗапроса;
//	

//КонецФункции

Функция ТЗКурсыВалют(МоментВремени) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыРегВалюты.Период КАК РегВалюты_Период,
		|	КурсыРегВалюты.Валюта КАК РегВалюты_Валюта,
		|	КурсыРегВалюты.Курс КАК РегВалюты_Курс,
		|	КурсыРегВалюты.Кратность КАК РегВалюты_Кратность,
		|	КурсыУпрВалюты.Период КАК УпрВалюты_Период,
		|	КурсыУпрВалюты.Валюта КАК УпрВалюты_Валюта,
		|	КурсыУпрВалюты.Курс КАК УпрВалюты_Курс,
		|	КурсыУпрВалюты.Кратность КАК УпрВалюты_Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(
		|			&МоментВремени,
		|			Валюта В
		|				(ВЫБРАТЬ
		|					КонстантаВалютаУчета.Значение
		|				ИЗ
		|					Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты,
		|	РегистрСведений.КурсыВалют.СрезПоследних(
		|			&МоментВремени,
		|			Валюта В
		|				(ВЫБРАТЬ
		|					КонстантаНациональнаяВалюта.Значение
		|				ИЗ
		|					Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции


Функция СуммаВНацВалютеДля_RS_GE(ДокументСсылка, ТекСтрока, ТЗ) Экспорт

	Стр = Новый Структура;
	Стр.Вставить("Сумма", ТекСтрока.Всего * ДокументСсылка.Курс * ТЗ[0].УпрВалюты_Кратность / (ТЗ[0].УпрВалюты_Курс * ДокументСсылка.Кратность));
	Стр.Вставить("Цена", Стр.Сумма / ТекСтрока.Количество);
		
	Возврат Стр;
	
КонецФункции
 

 //////////////////////////////////////////////////////////////////////////////////////////
 //                                 Загрузить Курсы Валют WWW.NBG.GE
 
 Процедура ЗагрузитьКурсыВалютNBG() Экспорт 
	 	 
	 ОбработкаОбъект = Обработки.AzRyЗагрузкаКурсовВалют.Создать();
	 ОбработкаОбъект.ЗагрузитьКурсыNBG();
	
 КонецПроцедуры	
 
 
 //////////////////////////////////////////////////////////////////////////////////////////
 //                                 Сумма прописю - ka
 
 // Функция формирует представление суммы прописью в указанной валюте
//
// Параметры:
//  Сумма - Число - сумма, которую надо представить прописью 
//  Валюта - СправочникСсылка.Валюты - валюта, в которой нужно представить сумму.
//  ВыводитьСуммуБезКопеек - Булево - флаг представления суммы без копеек.
//
// Возвращаемое значение:
//  Строка - сумма прописью
//
Функция СформироватьСуммуПрописью(Знач Сумма, Валюта, ВыводитьСуммуБезКопеек = Ложь) Экспорт
	
	Результат         = ?(Сумма < 0, -Сумма, Сумма);
	ЦелаяЧасть        = Цел(Результат);
	ФорматСтрока      = "Л=ka_GE; ДП=Ложь";
	ПараметрыПредмета = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Валюта, "ПараметрыПрописиНаРусском");
	
	Если Результат = ЦелаяЧасть Тогда
		
		Если ВыводитьСуммуБезКопеек Тогда
			
			Результат = ЧислоПрописью(Результат, ФорматСтрока, ПараметрыПредмета.ПараметрыПрописиНаРусском);
			Результат = Лев(Результат, Найти(Результат, "0") - 1);
			
		Иначе
			
			Результат = ЧислоПрописью(Результат, ФорматСтрока, ПараметрыПредмета.ПараметрыПрописиНаРусском);
			
		КонецЕсли;
		
	Иначе
		
		Результат = ЧислоПрописью(Результат, ФорматСтрока, ПараметрыПредмета.ПараметрыПрописиНаРусском);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


// Возвращает структуру данных со сводным описанием контрагента.
//
// Параметры: 
//  СписокСведений - список значений со значениями параметров организации
//   СписокСведений формируется функцией СведенияОЮрФизЛице
//  Список         - список запрашиваемых параметров организации
//  СПрефиксом     - Признак выводить или нет префикс параметра организации
//
// Возвращаемое значение:
//  Строка - описатель организации / контрагента / физ.лица.
//
Функция ОписаниеОрганизации(СписокСведений, Список = "", СПрефиксом = Истина) Экспорт

	Если ПустаяСтрока(Список) Тогда
		Список = "ПолноеНаименование,ИНН,Свидетельство,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет";
	КонецЕсли; 

	Результат = "";

	СоответствиеПараметров = Новый Соответствие();
	СоответствиеПараметров.Вставить("ПолноеНаименование",		" ");
	СоответствиеПараметров.Вставить("ИНН",						" გ.ს.ნ ");
	СоответствиеПараметров.Вставить("КПП",						"  ");
	СоответствиеПараметров.Вставить("Свидетельство",			" ");
	СоответствиеПараметров.Вставить("СвидетельствоДатаВыдачи",	" - ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес",			" ");
	СоответствиеПараметров.Вставить("Телефоны",					" ტელ.: ");
	СоответствиеПараметров.Вставить("НомерСчета",				" ა/ნ ");
	СоответствиеПараметров.Вставить("Банк",               		" ბანკში ");
	СоответствиеПараметров.Вставить("БИК",                		" ბსკ ");
	СоответствиеПараметров.Вставить("КоррСчет",           		" ანგ. ");
	СоответствиеПараметров.Вставить("КодПоОКПО",          		"  ");

	Список          = Список + ?(Прав(Список, 1) = ",", "", ",");
	ЧислоПараметров = СтрЧислоВхождений(Список, ",");

	Для Счетчик = 1 по ЧислоПараметров Цикл

		ПозЗапятой = Найти(Список, ",");

		Если ПозЗапятой > 0  Тогда
			ИмяПараметра = Лев(Список, ПозЗапятой - 1);
			Список = Сред(Список, ПозЗапятой + 1, СтрДлина(Список));

			Попытка
				СтрокаДополнения = "";
				СписокСведений.Свойство(ИмяПараметра, СтрокаДополнения);

				Если ПустаяСтрока(СтрокаДополнения) Тогда
					Продолжить;
				КонецЕсли;

				Префикс = СоответствиеПараметров[ИмяПараметра];
				Если Не ПустаяСтрока(Результат)  Тогда
					Результат = Результат + ",";
				КонецЕсли; 

				Результат = Результат + ?(СПрефиксом = Истина, Префикс, "") + СтрокаДополнения;

			Исключение

				Сообщение = Новый СообщениеПользователю();
		        Сообщение.Текст = НСтр("ru='Не удалось определить значение параметра организации: ';ka='Не удалось определить значение параметра организации: '") + ИмяПараметра;
				Сообщение.Сообщить();

			КонецПопытки;

		КонецЕсли; 

	КонецЦикла;

	Возврат Результат;

КонецФункции // ОписаниеОрганизации()


 //////////////////////////////////////////////////////////////////////////////////////////
 //                                Валюта

// Пересчитывает Сумму из Текущей валюты в Новую валюту по параметрам их курсов. 
//   Параметры курсов валют можно получить воспользовавшись функцией 
//   РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ДатаКурса).
// 
// Параметры:
//   Сумма                  (Число)     Сумма, которую следует пересчитать
//   ПараметрыТекущегоКурса (Структура) Параметры курса валюты, из которой надо пересчитать
//       |- Валюта    (СправочникСсылка.Валюты)
//       |- Курс      (Число)
//       |- Кратность (Число)
//   ПараметрыНовогоКурса   (Структура) Параметры курса валюты, в  которую надо пересчитать
//       |- Валюта    (СправочникСсылка.Валюты)
//       |- Курс      (Число)
//       |- Кратность (Число)
// 
// Возвращаемое значение: 
//   (Число) Сумма, пересчитанная в другую валюту
// 
Функция ПересчитатьПоКурсу(Сумма, ПараметрыТекущегоКурса, ПараметрыНовогоКурса) Экспорт
	Если ПараметрыТекущегоКурса.Валюта = ПараметрыНовогоКурса.Валюта
		ИЛИ (
			ПараметрыТекущегоКурса.Курс = ПараметрыНовогоКурса.Курс 
			И ПараметрыТекущегоКурса.Кратность = ПараметрыНовогоКурса.Кратность
		) Тогда
		
		Возврат Сумма;
		
	КонецЕсли;
	
	Если ПараметрыТекущегоКурса.Курс = 0
		ИЛИ ПараметрыТекущегоКурса.Кратность = 0
		ИЛИ ПараметрыНовогоКурса.Курс = 0
		ИЛИ ПараметрыНовогоКурса.Кратность = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'При пересчете в валюту %1 сумма %2 установлена в нулевое значение, т.к. курс валюты не задан.'"), 
				ПараметрыНовогоКурса.Валюта, 
				Формат(Сумма, "ЧДЦ=2; ЧН=0")
			)
		);
		
		Возврат 0;
		
	КонецЕсли;
	
	Возврат Окр((Сумма * ПараметрыТекущегоКурса.Курс * ПараметрыНовогоКурса.Кратность) / (ПараметрыНовогоКурса.Курс * ПараметрыТекущегоКурса.Кратность), 2);
КонецФункции

// Возвращает курс валюты на дату
// 
// Параметры:
//   Валюта    (СправочникСсылка.Валюты) Валюта, для которой получается курс
//   ДатаКурса (Дата) Дата, на которую получается курс
// 
// Возвращаемое значение: 
//   (Структура) 
//       |- Валюта    (СправочникСсылка.Валюты)
//       |- Курс      (Число)
//       |- Кратность (Число)
//       |- ДатаКурса (Дата)
// 
Функция ПолучитьКурсВалюты(Валюта, ДатаКурса) Экспорт
	
	Результат = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Новый Структура("Валюта", Валюта));
	
	Результат.Вставить("Валюта",    Валюта);
	Результат.Вставить("ДатаКурса", ДатаКурса);
	
	Возврат Результат;
	
КонецФункции


//////////////////////////////////////////////////////////////////////////////////////////
//                                 Изменение проводки документов

Процедура РасходСоСчета_ОтразитьУправленческий(ТаблицаУправленческий, ДополнительныеСвойства) Экспорт
	
	Если ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.РасходСоСчета") Тогда
		Если ДополнительныеСвойства.ДляПроведения.Ссылка.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата Тогда 
			
			//// Регистр бухгалтерии "Управленческий"
			//Ставка = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация.СтавкаНДФЛ;
			//
			//Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.ВыплатаЗаработнойПлаты Цикл
			//	
			//	Сумма  = 0;
			//	Коэффициент = Ставка / (100 - Ставка);				
			//	Сумма = Сумма + Коэффициент * ТекСтрока.СуммаПлатежа;

			//	НоваяСтрока = ТаблицаУправленческий.Добавить();
			//	//НоваяСтрока.ВалютаДт           = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДенежныхСредств;
			//	//НоваяСтрока.ВалютаКт           = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДенежныхСредств;
			//	НоваяСтрока.Организация        = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
			//	НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
			//	НоваяСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
			//	//НоваяСтрока.Порядок            = 
			//	НоваяСтрока.Содержание         = "გადახდების საშემოსავლო გადასახადი";
			//	НоваяСтрока.Сумма              = Сумма;
			//	//НоваяСтрока.СуммаВалДт         = Сумма;
			//	//НоваяСтрока.СуммаВалКт         = Сумма;
			//	НоваяСтрока.СчетДт             = Справочники.AzRyНастройки.РасходСоСчета_ВидДокументаЗарплата_СчетДТ.Значение;
			//	НоваяСтрока.СчетКт             = Справочники.AzRyНастройки.РасходСоСчета_ВидДокументаЗарплата_СчетКТ.Значение;		
			//	
			//КонецЦикла;
		
		КонецЕсли;
			
	ИначеЕсли ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
						
		Для каждого ТС Из ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата Цикл
			Если ТипЗнч(ТС.Документ) = Тип("ДокументСсылка.ПоступлениеНаСчет") И ЗначениеЗаполнено(ТС.Документ.ДокументОснование)
				И ТипЗнч(ТС.Документ.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") И ТС.Документ.ДокументОснование.AzRyАванс Тогда
				//БухПоведение(ТС.Документ.РасшифровкаПлатежа, ТС.Документ, ТаблицаУправленческий, ДополнительныеСвойства.ДляПроведения.Ссылка.Дата);
				//БухПоведение2(ТС, ДополнительныеСвойства.ДляПроведения.Ссылка, ТаблицаУправленческий);
			КонецЕсли; 	
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.АмортизацияВА") Тогда	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПараметрыВнеоборотныхАктивовСрезПервых.СчетЗатрат,
		|	ПараметрыВнеоборотныхАктивовСрезПервых.ВнеоборотныйАктив,
		|	ПараметрыВнеоборотныхАктивовСрезПервых.Организация
		|ИЗ
		|	РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПервых(, ) КАК ПараметрыВнеоборотныхАктивовСрезПервых
		|ГДЕ
		|	ПараметрыВнеоборотныхАктивовСрезПервых.ВнеоборотныйАктив В(&ВнеоборотныйАктив)";
		
		Запрос.УстановитьПараметр("ВнеоборотныйАктив", ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.ВыгрузитьКолонку("ВнеоборотныйАктив")); 

		Запрос.УстановитьПараметр("Дата", КонецДня(ДополнительныеСвойства.ДляПроведения.Дата));
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Для каждого ТекВНАКТ Из ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий Цикл
			
			Если Не ЗначениеЗаполнено(ТекВНАКТ.ВнеоборотныйАктив) Тогда Продолжить; КонецЕсли; 
			
			Отбор = Новый Структура();
			Отбор.Вставить("ВнеоборотныйАктив", ТекВНАКТ.ВнеоборотныйАктив);
			Отбор.Вставить("Организация", ТекВНАКТ.Организация);
			Строки = РезультатЗапроса.НайтиСтроки(Отбор);
			
			ТекВНАКТ.СчетДт = Строки[0].СчетЗатрат;
		
		КонецЦикла;
						
	ИначеЕсли ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.РасходИзКассы") Тогда
		Если ДополнительныеСвойства.ДляПроведения.Ссылка.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Зарплата Тогда 	
			
			
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
		Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.РасшифровкаПлатежа Цикл
			Если ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") И ДополнительныеСвойства.ДляПроведения.Ссылка.ДокументОснование.AzRyАванс Тогда
				Если ТекСтрока.ПризнакАванса Тогда
					
					//// 1) 
					//НоваяСтрока = ТаблицаУправленческий.Добавить();
					//Если ДополнительныеСвойства.ДляПроведения.Ссылка.БанковскийСчет.СчетУчета.Валютный Тогда
					//	НоваяСтрока.ВалютаДт           = ТекСтрока.Договор.ВалютаРасчетов;
					//	НоваяСтрока.ВалютаКт           = ТекСтрока.Договор.ВалютаРасчетов;
					//Иначе 	
					//	НоваяСтрока.ВалютаДт           = Неопределено;
					//	НоваяСтрока.ВалютаКт           = Неопределено;					
					//КонецЕсли; 
					//НоваяСтрока.Организация        = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					//НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					//НоваяСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
					//НоваяСтрока.Содержание         = "Возникновение аванса покупателя";
					//НоваяСтрока.Сумма              = ТекСтрока.СуммаПлатежа - ТекСтрока.СуммаНДС;
					//НоваяСтрока.СуммаВалДт         = ТекСтрока.СуммаРасчетов - (ТекСтрока.СуммаРасчетов - (ТекСтрока.СуммаРасчетов) / ((ТекСтрока.СтавкаНДС.Ставка + 100) / 100)); 
					//НоваяСтрока.СуммаВалКт         = ТекСтрока.СуммаРасчетов - (ТекСтрока.СуммаРасчетов - (ТекСтрока.СуммаРасчетов) / ((ТекСтрока.СтавкаНДС.Ставка + 100) / 100));
					//НоваяСтрока.СчетДт             = ДополнительныеСвойства.ДляПроведения.Ссылка.БанковскийСчет.СчетУчета;
					//НоваяСтрока.СчетКт             = Справочники.AzRyНастройки.ПоступлениеНаСчет_СчетКТ_БезНДС.Значение;
					//
					//// 2) 
					//Если ДополнительныеСвойства.ДляПроведения.Ссылка.БанковскийСчет.СчетУчета.Валютный Тогда
					//	НоваяСтрока.ВалютаДт           = ТекСтрока.Договор.ВалютаРасчетов;
					//	НоваяСтрока.ВалютаКт           = ТекСтрока.Договор.ВалютаРасчетов;
					//Иначе 	
					//	НоваяСтрока.ВалютаДт           = Неопределено;
					//	НоваяСтрока.ВалютаКт           = Неопределено;					
					//КонецЕсли;
					//НоваяСтрока.Организация        = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					//НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					//НоваяСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
					//НоваяСтрока.Содержание         = "Возникновение аванса покупателя";
					//НоваяСтрока.Сумма              = ТекСтрока.СуммаНДС;
					//НоваяСтрока.СуммаВалДт         = (ТекСтрока.СуммаРасчетов - (ТекСтрока.СуммаРасчетов) / ((ТекСтрока.СтавкаНДС.Ставка + 100) / 100)); 
					//НоваяСтрока.СуммаВалКт         = (ТекСтрока.СуммаРасчетов - (ТекСтрока.СуммаРасчетов) / ((ТекСтрока.СтавкаНДС.Ставка + 100) / 100));
					//НоваяСтрока.СчетДт             = ДополнительныеСвойства.ДляПроведения.Ссылка.БанковскийСчет.СчетУчета;
					//НоваяСтрока.СчетКт             = Справочники.AzRyНастройки.ПоступлениеНаСчет_СчетКТ_СНДС.Значение;
					//
					//// 3) 
					//НоваяСтрока = ТаблицаУправленческий.Добавить();
					////НоваяСтрока.ВалютаДт           = ТекСтрока.Договор.ВалютаРасчетов;
					////НоваяСтрока.ВалютаКт           = ТекСтрока.Договор.ВалютаРасчетов;
					//НоваяСтрока.Организация        = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					//НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					//НоваяСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
					//НоваяСтрока.Содержание         = "Возникновение аванса покупателя";
					//НоваяСтрока.Сумма              = ТекСтрока.СуммаНДС;
					////НоваяСтрока.СуммаВалДт         = 0; 
					////НоваяСтрока.СуммаВалКт         = 0;
					//НоваяСтрока.СчетДт             = Справочники.AzRyНастройки.ПоступлениеНаСчет_СчетДТ_3333.Значение;
					//НоваяСтрока.СчетКт             = Справочники.AzRyНастройки.ПоступлениеНаСчет_СчетКТ_3330.Значение;
				КонецЕсли;
			КонецЕсли;  				
		КонецЦикла;		
	ИначеЕсли ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда	
		Если ДополнительныеСвойства.ДляПроведения.Ссылка.СуммаВключаетНДС Тогда 
						
			// Регистр бухгалтерии "Управленческий"
			Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.РаботыИУслуги Цикл
				
				// Выручка от продажи ------------------------------------------------------------------------------------
				ВалютаУчета = Константы.ВалютаУчета.Получить();
				
				ПараметрыВалютаУчета = Новый Структура;
				ПараметрыВалютаУчета.Вставить("Валюта",    ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента);
				ПараметрыВалютаУчета.Вставить("Курс",      ДополнительныеСвойства.ДляПроведения.Ссылка.Курс);
				ПараметрыВалютаУчета.Вставить("Кратность", ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность);
				
                ПараметрыВалюты = Новый Структура;
				ПараметрыВалюты.Вставить("Валюта",    ВалютаУчета);
				ПараметрыВалюты.Вставить("Курс",      1);
				ПараметрыВалюты.Вставить("Кратность", 1);

				СуммаНДС = ПересчитатьПоКурсу(ТекСтрока.СуммаНДС, ПараметрыВалютаУчета, ПараметрыВалюты);
				
				// 1) Выручка от продажи
				НоваяСтрока = ТаблицаУправленческий.Добавить();
				//НоваяСтрока.ВалютаДт           = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
				//НоваяСтрока.ВалютаКт           = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДенежныхСредств;
				НоваяСтрока.Организация        = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
				НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
				НоваяСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
				//НоваяСтрока.Порядок            = 
				НоваяСтрока.Содержание         = "Выручка от продажи";
				НоваяСтрока.Сумма              = - СуммаНДС;
			    //НоваяСтрока.СуммаВалДт         = ТекСтрока.СуммаНДС;
				//НоваяСтрока.СуммаВалКт         = Сумма;
				НоваяСтрока.СчетДт             = Справочники.AzRyНастройки.АктВыполненныхРабот_ПрибыльСРеализацийДТ.Значение;
				НоваяСтрока.СчетКт             = ТекСтрока.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж;	
				
				// Начисление НДС --------------------------------------------------------------------------------------------
				ВалютаУчета = Константы.ВалютаУчета.Получить();
				
				ПараметрыВалютаУчета = Новый Структура;
				ПараметрыВалютаУчета.Вставить("Валюта",    ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента);
				ПараметрыВалютаУчета.Вставить("Курс",      ДополнительныеСвойства.ДляПроведения.Ссылка.Курс);
				ПараметрыВалютаУчета.Вставить("Кратность", ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность);
				
                ПараметрыВалюты = Новый Структура;
				ПараметрыВалюты.Вставить("Валюта",    ВалютаУчета);
				ПараметрыВалюты.Вставить("Курс",      1);
				ПараметрыВалюты.Вставить("Кратность", 1);

				//СуммаНДС = ПересчитатьПоКурсу(ТекСтрока.СуммаНДС, ПараметрыВалютаУчета, ПараметрыВалюты);
				
				// 1) Выручка от продажи
				НоваяСтрока = ТаблицаУправленческий.Добавить();
				//НоваяСтрока.ВалютаДт           = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
				//НоваяСтрока.ВалютаКт           = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДенежныхСредств;
				НоваяСтрока.Организация        = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
				НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
				НоваяСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
				//НоваяСтрока.Порядок            = 
				НоваяСтрока.Содержание         = "Начисление НДС";
				НоваяСтрока.Сумма              = СуммаНДС;
				//НоваяСтрока.СуммаВалДт         = ТекСтрока.СуммаНДС;
				//НоваяСтрока.СуммаВалКт         = Сумма;
				НоваяСтрока.СчетДт             = Справочники.AzRyНастройки.АктВыполненныхРабот_НДС_ДТ.Значение;
				НоваяСтрока.СчетКт             = Справочники.AzRyНастройки.АктВыполненныхРабот_НДС_КТ.Значение;
				
			КонецЦикла;
		КонецЕсли;
		
		//Для каждого ТС Из ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата Цикл
		//	Если ТипЗнч(ТС.Документ) = Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
		//    	БухПоведение(ТС.Документ.РасшифровкаПлатежа, ТС.Документ, ТаблицаУправленческий, ДополнительныеСвойства.ДляПроведения.Ссылка.Дата); 
		//	КонецЕсли; 	
		//КонецЦикла;		
			
	ИначеЕсли ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Или ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.ДополнительныеРасходы") Тогда	
		
		Если ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.ПриходнаяНакладная") И ДополнительныеСвойства.ДляПроведения.Ссылка.Контрагент.Нерезидент Тогда 			
			Если ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата.Количество() = 0 Тогда  
				
				// Расходы
				Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Расходы Цикл						
					Курс                = ДополнительныеСвойства.ДляПроведения.Ссылка.Курс;
					Кратность           = ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность;
					СуммаДокумента      = ТекСтрока.Сумма;
					
					// 1)
					НоваяСтрока = ТаблицаУправленческий.Добавить();
					//НоваяСтрока.ВалютаДт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					//НоваяСтрока.ВалютаКт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					НоваяСтрока.НомерСтроки         = ТаблицаУправленческий.Количество() + 1;
					НоваяСтрока.Организация         = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					НоваяСтрока.Период              = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					НоваяСтрока.ПериодПланирования  = Справочники.ПериодыПланирования.Фактический;
					НоваяСтрока.Содержание          = "დანახარჯების ასახვა";
					
					Сумма = СуммаДокумента * (Курс / Кратность) / 90*10;
					
					НоваяСтрока.Сумма               = Сумма;
					//НоваяСтрока.СуммаВалДт          = Сумма;
					//НоваяСтрока.СуммаВалКт          = Сумма;
					НоваяСтрока.СчетДт              = ТекСтрока.Номенклатура.СчетУчетаЗатрат;
					НоваяСтрока.СчетКт              = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_КТ_1_2.Значение;
					
					// 2)
					НоваяСтрока = ТаблицаУправленческий.Добавить();
					//НоваяСтрока.ВалютаДт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					//НоваяСтрока.ВалютаКт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					НоваяСтрока.НомерСтроки         = ТаблицаУправленческий.Количество() + 1;
					НоваяСтрока.Организация         = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					НоваяСтрока.Период              = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					НоваяСтрока.ПериодПланирования  = Справочники.ПериодыПланирования.Фактический;
					НоваяСтрока.Содержание          = "";
					
					Сумма1 = СуммаДокумента * (Курс / Кратность) / 90*10;
					Сумма2 = СуммаДокумента * (Курс / Кратность);
					
					НоваяСтрока.Сумма               = (Сумма1 + Сумма2) * 0.18;
					//НоваяСтрока.СуммаВалДт          = Сумма;
					//НоваяСтрока.СуммаВалКт          = Сумма;
					НоваяСтрока.СчетДт              = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_ДТ_2_1.Значение;
					НоваяСтрока.СчетКт              = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_КТ_2_2.Значение;										
				КонецЦикла;
				
				// Запасы
				Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Запасы Цикл						
					Курс                = ДополнительныеСвойства.ДляПроведения.Ссылка.Курс;
					Кратность           = ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность;
					СуммаДокумента      = ТекСтрока.Сумма;
					
					// 1)
					НоваяСтрока = ТаблицаУправленческий.Добавить();
					//НоваяСтрока.ВалютаДт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					//НоваяСтрока.ВалютаКт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					НоваяСтрока.НомерСтроки         = ТаблицаУправленческий.Количество() + 1;
					НоваяСтрока.Организация         = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					НоваяСтрока.Период              = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					НоваяСтрока.ПериодПланирования  = Справочники.ПериодыПланирования.Фактический;
					НоваяСтрока.Содержание          = "დანახარჯების ასახვა";
					
					Сумма = СуммаДокумента * (Курс / Кратность) / 90*10;
					
					НоваяСтрока.Сумма               = Сумма;
					//НоваяСтрока.СуммаВалДт          = Сумма;
					//НоваяСтрока.СуммаВалКт          = Сумма;
					//НоваяСтрока.СчетДт              = ПланыСчетов.Управленческий.СырьеИМатериалы.Ссылка;
					НоваяСтрока.СчетДт              = ТекСтрока.Номенклатура.СчетУчетаЗапасов;
					НоваяСтрока.СчетКт              = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_КТ_1_2.Значение;
					
					// 2)
					НоваяСтрока = ТаблицаУправленческий.Добавить();
					//НоваяСтрока.ВалютаДт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					//НоваяСтрока.ВалютаКт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					НоваяСтрока.НомерСтроки         = ТаблицаУправленческий.Количество() + 1;
					НоваяСтрока.Организация         = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					НоваяСтрока.Период              = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					НоваяСтрока.ПериодПланирования  = Справочники.ПериодыПланирования.Фактический;
					НоваяСтрока.Содержание          = "";
					
					Сумма1 = СуммаДокумента * (Курс / Кратность) / 90*10;
					Сумма2 = СуммаДокумента * (Курс / Кратность);
					
					НоваяСтрока.Сумма               = (Сумма1 + Сумма2) * 0.18;
					//НоваяСтрока.СуммаВалДт          = Сумма;
					//НоваяСтрока.СуммаВалКт          = Сумма;
					НоваяСтрока.СчетДт              = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_ДТ_2_1.Значение;
					НоваяСтрока.СчетКт              = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_КТ_2_2.Значение;										
				КонецЦикла;
				
			Иначе 
				
				// Расходы
				Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Расходы Цикл
					
					ПредоплатаКурс      = ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата[0].Курс;
					ПредоплатаКратность = ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата[0].Кратность;
					Курс                = ДополнительныеСвойства.ДляПроведения.Ссылка.Курс;
					Кратность           = ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность;
					СуммаДокумента      = ТекСтрока.Сумма;
					
					// 1)
					НоваяСтрока = ТаблицаУправленческий.Добавить();
					//НоваяСтрока.ВалютаДт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					//НоваяСтрока.ВалютаКт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					НоваяСтрока.НомерСтроки         = ТаблицаУправленческий.Количество() + 1;
					НоваяСтрока.Организация         = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					НоваяСтрока.Период              = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					НоваяСтрока.ПериодПланирования  = Справочники.ПериодыПланирования.Фактический;
					НоваяСтрока.Содержание          = "დანახარჯების ასახვა";
					
					Сумма = СуммаДокумента * (ПредоплатаКурс / ПредоплатаКратность) / 90*10;
					
					НоваяСтрока.Сумма               = Сумма;
					//НоваяСтрока.СуммаВалДт          = Сумма;
					//НоваяСтрока.СуммаВалКт          = Сумма;
					//НоваяСтрока.СчетДт              = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_ДТ_1_1.Значение;
					НоваяСтрока.СчетДт              = ТекСтрока.Номенклатура.СчетУчетаЗатрат;
					НоваяСтрока.СчетКт              = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_КТ_1_2.Значение;
					
					// 2)
					НоваяСтрока = ТаблицаУправленческий.Добавить();
					//НоваяСтрока.ВалютаДт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					//НоваяСтрока.ВалютаКт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					НоваяСтрока.НомерСтроки         = ТаблицаУправленческий.Количество() + 1;
					НоваяСтрока.Организация         = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					НоваяСтрока.Период              = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					НоваяСтрока.ПериодПланирования  = Справочники.ПериодыПланирования.Фактический;
					НоваяСтрока.Содержание          = "";
					
					Сумма1 = СуммаДокумента * (ПредоплатаКурс / ПредоплатаКратность) / 90*10;
					Сумма2 = СуммаДокумента * (Курс / Кратность);
					
					НоваяСтрока.Сумма               = (Сумма1 + Сумма2) * 0.18;
					//НоваяСтрока.СуммаВалДт          = Сумма;
					//НоваяСтрока.СуммаВалКт          = Сумма;
					НоваяСтрока.СчетДт              = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_ДТ_2_1.Значение;
					НоваяСтрока.СчетКт              = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_КТ_2_2.Значение;
					
				КонецЦикла;
				
				// Запасы
				Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Запасы Цикл
					
					ПредоплатаКурс      = ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата[0].Курс;
					ПредоплатаКратность = ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата[0].Кратность;
					Курс                = ДополнительныеСвойства.ДляПроведения.Ссылка.Курс;
					Кратность           = ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность;
					СуммаДокумента      = ТекСтрока.Сумма;
					
					// 1)
					НоваяСтрока = ТаблицаУправленческий.Добавить();
					//НоваяСтрока.ВалютаДт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					//НоваяСтрока.ВалютаКт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					НоваяСтрока.НомерСтроки         = ТаблицаУправленческий.Количество() + 1;
					НоваяСтрока.Организация         = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					НоваяСтрока.Период              = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					НоваяСтрока.ПериодПланирования  = Справочники.ПериодыПланирования.Фактический;
					НоваяСтрока.Содержание          = "დანახარჯების ასახვა";
					
					Сумма = СуммаДокумента * (ПредоплатаКурс / ПредоплатаКратность) / 90*10;
					
					НоваяСтрока.Сумма               = Сумма;
					//НоваяСтрока.СуммаВалДт          = Сумма;
					//НоваяСтрока.СуммаВалКт          = Сумма;
					//НоваяСтрока.СчетДт              = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_ДТ_1_1.Значение;
					НоваяСтрока.СчетДт              = ТекСтрока.Номенклатура.СчетУчетаЗапасов;
					НоваяСтрока.СчетКт              = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_КТ_1_2.Значение;
					
					// 2)
					НоваяСтрока = ТаблицаУправленческий.Добавить();
					//НоваяСтрока.ВалютаДт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					//НоваяСтрока.ВалютаКт            = ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента;
					НоваяСтрока.НомерСтроки         = ТаблицаУправленческий.Количество() + 1;
					НоваяСтрока.Организация         = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					НоваяСтрока.Период              = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					НоваяСтрока.ПериодПланирования  = Справочники.ПериодыПланирования.Фактический;
					НоваяСтрока.Содержание          = "";
					
					Сумма1 = СуммаДокумента * (ПредоплатаКурс / ПредоплатаКратность) / 90*10;
					Сумма2 = СуммаДокумента * (Курс / Кратность);
					
					НоваяСтрока.Сумма               = (Сумма1 + Сумма2) * 0.18;
					//НоваяСтрока.СуммаВалДт          = Сумма;
					//НоваяСтрока.СуммаВалКт          = Сумма;
					НоваяСтрока.СчетДт              = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_ДТ_2_1.Значение;
					НоваяСтрока.СчетКт              = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_КТ_2_2.Значение;
					
				КонецЦикла;
				
			КонецЕсли;		
		КонецЕсли;
		
		Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата Цикл
			Если ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) <> Тип("ДокументСсылка.ДополнительныеРасходы") И ТипЗнч(ТекСтрока.Заказ) = Тип("ДокументСсылка.ЗаказПоставщику") И ТекСтрока.Заказ.AzRyАванс Тогда
				
				Об = ДополнительныеСвойства.ДляПроведения.Ссылка;
				
				ИтогВсего      = Об.Запасы.Итог("Всего") + Об.Расходы.Итог("Всего");
				ИтогСуммаНДС   = Об.Запасы.Итог("СуммаНДС") + Об.Расходы.Итог("СуммаНДС");
				ИтогСуммаНДСУВ = ПолучитьСуммуВУчетнойВВалюте(Об.ВалютаДокумента, Об.Дата, ИтогСуммаНДС, , Об.Курс, Об.Кратность);
				
				//Для каждого ТекСтрока2 Из ТекСтрока.Документ.РасшифровкаПлатежа Цикл
					//Если ТекСтрока2.ПризнакАванса Тогда
						
						Сумму   = ТекСтрока.СуммаПлатежа;
						СуммуУВ = ПолучитьСуммуВУчетнойВВалюте(ТекСтрока.Документ.ВалютаДенежныхСредств, ТекСтрока.Документ.Дата, ТекСтрока.СуммаПлатежа, , ТекСтрока.Курс, ТекСтрока.Кратность);
						
						Сумму   = Сумму - Сумму / ((ТекСтрока.Документ.Организация.СтавкаНДСПоУмолчанию.Ставка + 100) / 100);
						СуммуУВ = СуммуУВ - СуммуУВ / ((ТекСтрока.Документ.Организация.СтавкаНДСПоУмолчанию.Ставка + 100) / 100);
						
						НоваяСтрока = ТаблицаУправленческий.Добавить();
						НоваяСтрока.НомерСтроки        = ТаблицаУправленческий.Количество() + 1;
						НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
						НоваяСтрока.Организация 	   = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
						НоваяСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
						НоваяСтрока.СчетДт             = Справочники.AzRyНастройки.РасходСоСчета_Аванс_НДС_3340_001.Значение;
						Если Справочники.AzRyНастройки.РасходСоСчета_Аванс_НДС_3340_001.Значение.Валютный Тогда
							НоваяСтрока.ВалютаДт       = Об.ВалютаДокумента; 
						Иначе 
							НоваяСтрока.ВалютаДт       = Неопределено;
						КонецЕсли; 
						Если Справочники.AzRyНастройки.РасходСоСчета_Аванс_НДС_3340_001.Значение.Валютный Тогда
							НоваяСтрока.СуммаВалДт     = -?(Сумму > ИтогСуммаНДС, ИтогСуммаНДС, Сумму); 
						Иначе 
							НоваяСтрока.СуммаВалДт     = Неопределено;
						КонецЕсли;  
						НоваяСтрока.СчетКт             = Справочники.AzRyНастройки.РасходСоСчета_Аванс_НДС_3340_004.Значение;			
						Если Справочники.AzRyНастройки.РасходСоСчета_Аванс_НДС_3340_004.Значение.Валютный Тогда
							НоваяСтрока.ВалютаКт       = Об.ВалютаДокумента; 
						Иначе 
							НоваяСтрока.ВалютаКт       = Неопределено;
						КонецЕсли;
						Если Справочники.AzRyНастройки.РасходСоСчета_Аванс_НДС_3340_004.Значение.Валютный Тогда
							НоваяСтрока.СуммаВалКт     = -?(Сумму > ИтогСуммаНДС, ИтогСуммаНДС, Сумму); 
						Иначе 
							НоваяСтрока.СуммаВалКт     = Неопределено;
						КонецЕсли;						
						НоваяСтрока.Сумма              = -?(СуммуУВ > ИтогСуммаНДСУВ, ИтогСуммаНДСУВ, СуммуУВ); 
						НоваяСтрока.Содержание         = НСтр("ru='Начисление НДС';ka='Начисление НДС'");						
					//КонецЕсли; 
				//КонецЦикла;	
			КонецЕсли; 
		КонецЦикла; 		
	КонецЕсли;
	
КонецПроцедуры

Процедура БухПоведение(ТЗ, Документ, ТаблицаУправленческий, Дата)

	Для каждого ТС2 Из ТЗ Цикл
		Если ТС2.ПризнакАванса Тогда	
			//ВалютаУчета = Константы.ВалютаУчета.Получить();
			//
			//ПараметрыВалютаУчета = Новый Структура;
			//ПараметрыВалютаУчета.Вставить("Валюта",    ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента);
			//ПараметрыВалютаУчета.Вставить("Курс",      ДополнительныеСвойства.ДляПроведения.Ссылка.Курс);
			//ПараметрыВалютаУчета.Вставить("Кратность", ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность);
			//
			//ПараметрыВалюты = Новый Структура;
			//ПараметрыВалюты.Вставить("Валюта",    ВалютаУчета);
			//ПараметрыВалюты.Вставить("Курс",      1);
			//ПараметрыВалюты.Вставить("Кратность", 1);
			//
			//СуммаНДС = ПересчитатьПоКурсу(ТекСтрока.СуммаНДС, ПараметрыВалютаУчета, ПараметрыВалюты)
			Сумма       = ТС2.СуммаПлатежа; 
			СуммаНДС    = ТС2.СуммаНДС;
			СуммаБезНДС = ТС2.СуммаПлатежа - ТС2.СуммаНДС;
			
			// 1) 
			НоваяСтрока = ТаблицаУправленческий.Добавить();
			НоваяСтрока.ВалютаДт           = ТС2.Договор.ВалютаРасчетов;
			НоваяСтрока.ВалютаКт           = ТС2.Договор.ВалютаРасчетов;
			НоваяСтрока.Организация        = Документ.Организация;
			НоваяСтрока.Период             = Дата;
			НоваяСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
			НоваяСтрока.Содержание         = "წინასწარ გადახდილი თანხის ჩათვლა";
			НоваяСтрока.Сумма              = СуммаБезНДС;
			НоваяСтрока.СуммаВалДт         = ТС2.СуммаРасчетов - (ТС2.СуммаРасчетов - (ТС2.СуммаРасчетов) / ((18 + 100) / 100)); 
			НоваяСтрока.СуммаВалКт         = ТС2.СуммаРасчетов - (ТС2.СуммаРасчетов - (ТС2.СуммаРасчетов) / ((18 + 100) / 100));
			НоваяСтрока.СчетДт             = Справочники.AzRyНастройки.ПоступлениеНаСчет_СчетКТ_БезНДС.Значение;
			НоваяСтрока.СчетКт             = ПланыСчетов.Управленческий.РасчетыСПокупателями.Ссылка;	
			
			// Начисление НДС --------------------------------------------------------------------------------------------
			//ВалютаУчета = Константы.ВалютаУчета.Получить();
			//
			//ПараметрыВалютаУчета = Новый Структура;
			//ПараметрыВалютаУчета.Вставить("Валюта",    ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента);
			//ПараметрыВалютаУчета.Вставить("Курс",      ДополнительныеСвойства.ДляПроведения.Ссылка.Курс);
			//ПараметрыВалютаУчета.Вставить("Кратность", ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность);
			//
			//ПараметрыВалюты = Новый Структура;
			//ПараметрыВалюты.Вставить("Валюта",    ВалютаУчета);
			//ПараметрыВалюты.Вставить("Курс",      1);
			//ПараметрыВалюты.Вставить("Кратность", 1);
			
			//СуммаНДС = ПересчитатьПоКурсу(ТекСтрока.СуммаНДС, ПараметрыВалютаУчета, ПараметрыВалюты);
			
			// 2)
			НоваяСтрока = ТаблицаУправленческий.Добавить();
			НоваяСтрока.ВалютаДт           = ТС2.Договор.ВалютаРасчетов;
			НоваяСтрока.ВалютаКт           = ТС2.Договор.ВалютаРасчетов;
			НоваяСтрока.Организация        = Документ.Организация;
			НоваяСтрока.Период             = Дата;
			НоваяСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
			НоваяСтрока.Содержание         = "წინასწარ გადახდილი თანხის ჩათვლა";
			НоваяСтрока.Сумма              = СуммаНДС;
			НоваяСтрока.СуммаВалДт         = (ТС2.СуммаРасчетов - (ТС2.СуммаРасчетов) / ((18 + 100) / 100));
			НоваяСтрока.СуммаВалКт         = (ТС2.СуммаРасчетов - (ТС2.СуммаРасчетов) / ((18 + 100) / 100));
			НоваяСтрока.СчетДт             = Справочники.AzRyНастройки.ПоступлениеНаСчет_СчетКТ_СНДС.Значение;
			НоваяСтрока.СчетКт             = ПланыСчетов.Управленческий.РасчетыСПокупателями.Ссылка;
			
			// 3)
			НоваяСтрока = ТаблицаУправленческий.Добавить();
			//НоваяСтрока.ВалютаДт           = ТС2.Договор.ВалютаРасчетов;
			//НоваяСтрока.ВалютаКт           = ТС2.Договор.ВалютаРасчетов;
			НоваяСтрока.Организация        = Документ.Организация;
			НоваяСтрока.Период             = Дата;
			НоваяСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
			НоваяСтрока.Содержание         = "Начисление НДС";
			НоваяСтрока.Сумма              = - СуммаНДС;
			НоваяСтрока.СуммаВалДт         = 0;
			НоваяСтрока.СуммаВалКт         = 0;
			НоваяСтрока.СчетДт             = Справочники.AzRyНастройки.ПоступлениеНаСчет_СчетДТ_3333.Значение;
			НоваяСтрока.СчетКт             = Справочники.AzRyНастройки.ПоступлениеНаСчет_СчетКТ_3330.Значение;
		КонецЕсли; 
	КонецЦикла;	

КонецПроцедуры

Процедура БухПоведение2(ТС2, Документ, ТаблицаУправленческий)

	//Для каждого ТС2 Из ТЗ Цикл
		Если ТС2.ПризнакАванса Тогда	
			//ВалютаУчета = Константы.ВалютаУчета.Получить();
			//
			//ПараметрыВалютаУчета = Новый Структура;
			//ПараметрыВалютаУчета.Вставить("Валюта",    ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента);
			//ПараметрыВалютаУчета.Вставить("Курс",      ДополнительныеСвойства.ДляПроведения.Ссылка.Курс);
			//ПараметрыВалютаУчета.Вставить("Кратность", ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность);
			//
			//ПараметрыВалюты = Новый Структура;
			//ПараметрыВалюты.Вставить("Валюта",    ВалютаУчета);
			//ПараметрыВалюты.Вставить("Курс",      1);
			//ПараметрыВалюты.Вставить("Кратность", 1);
			//
			//СуммаНДС = ПересчитатьПоКурсу(ТекСтрока.СуммаНДС, ПараметрыВалютаУчета, ПараметрыВалюты)
			Сумма       = ТС2.СуммаПлатежа; 
			СуммаНДС    = ТС2.СуммаНДС;
			СуммаБезНДС = ТС2.СуммаПлатежа - ТС2.СуммаНДС;
			
			// 1) 
			НоваяСтрока = ТаблицаУправленческий.Добавить();
			НоваяСтрока.ВалютаДт           = ТС2.Договор.ВалютаРасчетов;
			НоваяСтрока.ВалютаКт           = ТС2.Договор.ВалютаРасчетов;
			НоваяСтрока.Организация        = Документ.Организация;
			НоваяСтрока.Период             = Документ.Дата;
			НоваяСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
			НоваяСтрока.Содержание         = "წინასწარ გადახდილი თანხის ჩათვლა";
			НоваяСтрока.Сумма              = СуммаБезНДС;
			НоваяСтрока.СуммаВалДт         = ТС2.СуммаРасчетов - (ТС2.СуммаРасчетов - (ТС2.СуммаРасчетов) / ((18 + 100) / 100)); 
			НоваяСтрока.СуммаВалКт         = ТС2.СуммаРасчетов - (ТС2.СуммаРасчетов - (ТС2.СуммаРасчетов) / ((18 + 100) / 100));
			НоваяСтрока.СчетДт             = Справочники.AzRyНастройки.ПоступлениеНаСчет_СчетКТ_БезНДС.Значение;
			НоваяСтрока.СчетКт             = ПланыСчетов.Управленческий.РасчетыСПокупателями.Ссылка;	
			
			// Начисление НДС --------------------------------------------------------------------------------------------
			//ВалютаУчета = Константы.ВалютаУчета.Получить();
			//
			//ПараметрыВалютаУчета = Новый Структура;
			//ПараметрыВалютаУчета.Вставить("Валюта",    ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента);
			//ПараметрыВалютаУчета.Вставить("Курс",      ДополнительныеСвойства.ДляПроведения.Ссылка.Курс);
			//ПараметрыВалютаУчета.Вставить("Кратность", ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность);
			//
			//ПараметрыВалюты = Новый Структура;
			//ПараметрыВалюты.Вставить("Валюта",    ВалютаУчета);
			//ПараметрыВалюты.Вставить("Курс",      1);
			//ПараметрыВалюты.Вставить("Кратность", 1);
			
			//СуммаНДС = ПересчитатьПоКурсу(ТекСтрока.СуммаНДС, ПараметрыВалютаУчета, ПараметрыВалюты);
			
			// 2)
			НоваяСтрока = ТаблицаУправленческий.Добавить();
			НоваяСтрока.ВалютаДт           = ТС2.Договор.ВалютаРасчетов;
			НоваяСтрока.ВалютаКт           = ТС2.Договор.ВалютаРасчетов;
			НоваяСтрока.Организация        = Документ.Организация;
			НоваяСтрока.Период             = Документ.Дата;
			НоваяСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
			НоваяСтрока.Содержание         = "წინასწარ გადახდილი თანხის ჩათვლა";
			НоваяСтрока.Сумма              = СуммаНДС;
			НоваяСтрока.СуммаВалДт         = (ТС2.СуммаРасчетов - (ТС2.СуммаРасчетов) / ((18 + 100) / 100));
			НоваяСтрока.СуммаВалКт         = (ТС2.СуммаРасчетов - (ТС2.СуммаРасчетов) / ((18 + 100) / 100));
			НоваяСтрока.СчетДт             = Справочники.AzRyНастройки.ПоступлениеНаСчет_СчетКТ_СНДС.Значение;
			НоваяСтрока.СчетКт             = ПланыСчетов.Управленческий.РасчетыСПокупателями.Ссылка;
			
			// 3)
			НоваяСтрока = ТаблицаУправленческий.Добавить();
			//НоваяСтрока.ВалютаДт           = ТС2.Договор.ВалютаРасчетов;
			//НоваяСтрока.ВалютаКт           = ТС2.Договор.ВалютаРасчетов;
			НоваяСтрока.Организация        = Документ.Организация;
			НоваяСтрока.Период             = Документ.Дата;
			НоваяСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
			НоваяСтрока.Содержание         = "Начисление НДС";
			НоваяСтрока.Сумма              = - СуммаНДС;
			НоваяСтрока.СуммаВалДт         = 0;
			НоваяСтрока.СуммаВалКт         = 0;
			НоваяСтрока.СчетДт             = Справочники.AzRyНастройки.ПоступлениеНаСчет_СчетДТ_3333.Значение;
			НоваяСтрока.СчетКт             = Справочники.AzRyНастройки.ПоступлениеНаСчет_СчетКТ_3330.Значение;
		КонецЕсли; 
	//КонецЦикла;	

КонецПроцедуры
 
Процедура РасходСоСчета_ОтразитьРасчетыПоНалогам(ТаблицаРасчетыПоНалогам ,ДополнительныеСвойства) Экспорт
	
	Если ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.РасходСоСчета") Тогда
		Если ДополнительныеСвойства.ДляПроведения.Ссылка.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Зарплата Тогда 
			
			//МассивУдаления = Новый Массив;
			//
			//НайденнаяСтрока = ТаблицаРасчетыПоНалогам.Найти(ВидДвиженияНакопления.Расход, "ВидДвижения");
			//Если Не НайденнаяСтрока = Неопределено Тогда
			//	МассивУдаления.Добавить(НайденнаяСтрока);
			//КонецЕсли; 
			//
			//Для каждого ТекМассив Из МассивУдаления Цикл
			//	ТаблицаРасчетыПоНалогам.Удалить(ТекМассив);
			//КонецЦикла;
			
			ТаблицаРасчетыПоНалогам.Очистить();
			
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс,
		|	КурсыВалютСрезПоследних.Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
		|ГДЕ
		|	КурсыВалютСрезПоследних.Валюта = &ВалютаУчета";
		Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
		Запрос.УстановитьПараметр("Период", ДополнительныеСвойства.ДляПроведения.Дата);
		Резултат = Запрос.Выполнить();
		Выборка = Резултат.Выбрать();
		КурсУчета = 0;
		КратностьУчета = 0;
		Если Выборка.Следующий() Тогда
			КурсУчета = Выборка.Курс;
			КратностьУчета = Выборка.Кратность;
		КонецЕсли;
	
		Если ДополнительныеСвойства.ДляПроведения.Ссылка.СуммаВключаетНДС Тогда
			
			ТаблицаРасчетыПоНалогам.Колонки.Добавить("ВидДвижения");
			ТаблицаРасчетыПоНалогам.Колонки.Добавить("ВидНалога");
			ТаблицаРасчетыПоНалогам.Колонки.Добавить("Организация");
			ТаблицаРасчетыПоНалогам.Колонки.Добавить("Период");
			ТаблицаРасчетыПоНалогам.Колонки.Добавить("СодержаниеПроводки");
			ТаблицаРасчетыПоНалогам.Колонки.Добавить("Сумма");
			ТаблицаРасчетыПоНалогам.Колонки.Добавить("СчетУчета");
			
			Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.РаботыИУслуги Цикл
				
				ВалютаУчета = Константы.ВалютаУчета.Получить();
				
				ПараметрыВалютаУчета = Новый Структура;
				ПараметрыВалютаУчета.Вставить("Валюта",    ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента);
				ПараметрыВалютаУчета.Вставить("Курс",      ДополнительныеСвойства.ДляПроведения.Ссылка.Курс);
				ПараметрыВалютаУчета.Вставить("Кратность", ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность);
				
				ПараметрыВалюты = Новый Структура;
				ПараметрыВалюты.Вставить("Валюта",    ВалютаУчета);
				ПараметрыВалюты.Вставить("Курс",      1);
				ПараметрыВалюты.Вставить("Кратность", 1);
				
				СуммаНДС = ПересчитатьПоКурсу(ТекСтрока.СуммаНДС, ПараметрыВалютаУчета, ПараметрыВалюты);
								
				НоваяСтрока = ТаблицаРасчетыПоНалогам.Добавить();		
				НоваяСтрока.ВидДвижения        = ВидДвиженияНакопления.Приход;
				НоваяСтрока.ВидНалога          = Справочники.AzRyНастройки.АктВыполненныхРабот_ВидыНалогов.Значение;
				НоваяСтрока.Организация        = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
				НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата; 
				НоваяСтрока.СодержаниеПроводки = "";
				НоваяСтрока.Сумма              = СуммаНДС;
				
			КонецЦикла;
			
			Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата Цикл
				Если ТипЗнч(ТекСтрока.Документ) = Тип("ДокументСсылка.ПоступлениеНаСчет") 
					И ЗначениеЗаполнено(ТекСтрока.Документ.ДокументОснование)
					И ТипЗнч(ТекСтрока.Документ.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") 
					И ТекСтрока.Документ.ДокументОснование.AzRyАванс Тогда
					
					НоваяСтрока = ТаблицаРасчетыПоНалогам.Добавить();		
					НоваяСтрока.ВидДвижения        = ВидДвиженияНакопления.Расход;
					НоваяСтрока.ВидНалога          = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация.ВидНалогаНДС;
					НоваяСтрока.Организация        = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата; 
					НоваяСтрока.СодержаниеПроводки = "";
					
					КурсО      = ТекСтрока.Курс;
					КратностьО = ТекСтрока.Кратность;
					
					Сумма = ТекСтрока.СуммаПлатежа * КурсО / КратностьО * КратностьУчета / КурсУчета;		
					НоваяСтрока.Сумма              = (Сумма - Сумма / ((ДополнительныеСвойства.ДляПроведения.Организация.СтавкаНДСПоУмолчанию.Ставка + 100) / 100));
					
					//Для каждого ТекСтрока2 Из ТекСтрока.Документ.РасшифровкаПлатежа Цикл
					//	Если ТекСтрока2.ПризнакАванса Тогда																		
					//		НоваяСтрока = ТаблицаРасчетыПоНалогам.Добавить();		
					//		НоваяСтрока.ВидДвижения        = ВидДвиженияНакопления.Расход;
					//		НоваяСтрока.ВидНалога          = ТекСтрока.Документ.Организация.ВидНалогаНДС;
					//		НоваяСтрока.Организация        = ТекСтрока.Документ.Организация;
					//		НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата; 
					//		НоваяСтрока.СодержаниеПроводки = "";
					//		НоваяСтрока.Сумма              = ТекСтрока2.СуммаНДС;
					//	КонецЕсли; 
					//КонецЦикла;
				КонецЕсли; 
			КонецЦикла;	
		КонецЕсли;	
	ИначеЕсли ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс,
		|	КурсыВалютСрезПоследних.Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
		|ГДЕ
		|	КурсыВалютСрезПоследних.Валюта = &ВалютаУчета";
		Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
		Запрос.УстановитьПараметр("Период", ДополнительныеСвойства.ДляПроведения.Дата);
		Резултат = Запрос.Выполнить();
		Выборка = Резултат.Выбрать();
		КурсУчета = 0;
		КратностьУчета = 0;
		Если Выборка.Следующий() Тогда
			КурсУчета = Выборка.Курс;
			КратностьУчета = Выборка.Кратность;
		КонецЕсли;
		
		ТаблицаРасчетыПоНалогам.Колонки.Добавить("ВидДвижения");
		ТаблицаРасчетыПоНалогам.Колонки.Добавить("ВидНалога");
		ТаблицаРасчетыПоНалогам.Колонки.Добавить("Организация");
		ТаблицаРасчетыПоНалогам.Колонки.Добавить("Период");
		ТаблицаРасчетыПоНалогам.Колонки.Добавить("СодержаниеПроводки");
		ТаблицаРасчетыПоНалогам.Колонки.Добавить("Сумма");
		ТаблицаРасчетыПоНалогам.Колонки.Добавить("СчетУчета");
		
		Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата Цикл
			Если ТипЗнч(ТекСтрока.Документ) = Тип("ДокументСсылка.ПоступлениеНаСчет") 
				И ЗначениеЗаполнено(ТекСтрока.Документ.ДокументОснование)
				И ТипЗнч(ТекСтрока.Документ.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") 
				И ТекСтрока.Документ.ДокументОснование.AzRyАванс Тогда
					
				НоваяСтрока = ТаблицаРасчетыПоНалогам.Добавить();		
				НоваяСтрока.ВидДвижения        = ВидДвиженияНакопления.Расход;
				НоваяСтрока.ВидНалога          = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация.ВидНалогаНДС;
				НоваяСтрока.Организация        = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
				НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата; 
				НоваяСтрока.СодержаниеПроводки = "";
				
				КурсО      = ТекСтрока.Курс;
				КратностьО = ТекСтрока.Кратность;
				
				Сумма = ТекСтрока.СуммаПлатежа * КурсО / КратностьО * КратностьУчета / КурсУчета;		
				НоваяСтрока.Сумма              = (Сумма - Сумма / ((ДополнительныеСвойства.ДляПроведения.Организация.СтавкаНДСПоУмолчанию.Ставка + 100) / 100));
								
			КонецЕсли; 
		КонецЦикла;			
	ИначеЕсли ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда	
		//Если ДополнительныеСвойства.ДляПроведения.Ссылка.СуммаВключаетНДС Тогда
			
			ТаблицаРасчетыПоНалогам.Колонки.Добавить("ВидДвижения");
			ТаблицаРасчетыПоНалогам.Колонки.Добавить("ВидНалога");
			ТаблицаРасчетыПоНалогам.Колонки.Добавить("Организация");
			ТаблицаРасчетыПоНалогам.Колонки.Добавить("Период");
			ТаблицаРасчетыПоНалогам.Колонки.Добавить("СодержаниеПроводки");
			ТаблицаРасчетыПоНалогам.Колонки.Добавить("Сумма");
			ТаблицаРасчетыПоНалогам.Колонки.Добавить("СчетУчета");
			
			Если ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата.Количество() = 0 Тогда
				
				Курс                = ДополнительныеСвойства.ДляПроведения.Ссылка.Курс;
				Кратность           = ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность;
				СуммаДокумента      = ДополнительныеСвойства.ДляПроведения.Ссылка.СуммаДокумента;
				
				Сумма = СуммаДокумента * (Курс / Кратность) / 90*10;
				
				НоваяСтрока = ТаблицаРасчетыПоНалогам.Добавить();		
				НоваяСтрока.ВидДвижения        = ВидДвиженияНакопления.Приход;
				НоваяСтрока.ВидНалога          = Справочники.AzRyНастройки.ПриходнаяНакладная_ВидыНалогов_1.Значение;
				НоваяСтрока.Организация        = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
				НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата; 
				НоваяСтрока.СодержаниеПроводки = "";
				НоваяСтрока.Сумма              = Сумма;
				
				Сумма1 = СуммаДокумента * (Курс / Кратность) / 90*10;
				Сумма2 = СуммаДокумента * (Курс / Кратность);
				
				НоваяСтрока = ТаблицаРасчетыПоНалогам.Добавить();		
				НоваяСтрока.ВидДвижения        = ВидДвиженияНакопления.Приход;
				НоваяСтрока.ВидНалога          = Справочники.AzRyНастройки.ПриходнаяНакладная_ВидыНалогов_2.Значение;
				НоваяСтрока.Организация        = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
				НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата; 
				НоваяСтрока.СодержаниеПроводки = "";
				НоваяСтрока.Сумма              = (Сумма1 + Сумма2) * 0.18;
				
			Иначе 
				
				ПредоплатаКурс      = ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата[0].Курс;
				ПредоплатаКратность = ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата[0].Кратность;
				Курс                = ДополнительныеСвойства.ДляПроведения.Ссылка.Курс;
				Кратность           = ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность;
				СуммаДокумента      = ДополнительныеСвойства.ДляПроведения.Ссылка.СуммаДокумента;
				
				Сумма = СуммаДокумента * (ПредоплатаКурс / ПредоплатаКратность) / 90*10;
				
				НоваяСтрока = ТаблицаРасчетыПоНалогам.Добавить();		
				НоваяСтрока.ВидДвижения        = ВидДвиженияНакопления.Приход;
				НоваяСтрока.ВидНалога          = Справочники.AzRyНастройки.ПриходнаяНакладная_ВидыНалогов_1.Значение;
				НоваяСтрока.Организация        = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
				НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата; 
				НоваяСтрока.СодержаниеПроводки = "";
				НоваяСтрока.Сумма              = Сумма;
				
				Сумма1 = СуммаДокумента * (ПредоплатаКурс / ПредоплатаКратность) / 90*10;
				Сумма2 = СуммаДокумента * (Курс / Кратность);
				
				НоваяСтрока = ТаблицаРасчетыПоНалогам.Добавить();		
				НоваяСтрока.ВидДвижения        = ВидДвиженияНакопления.Приход;
				НоваяСтрока.ВидНалога          = Справочники.AzRyНастройки.ПриходнаяНакладная_ВидыНалогов_2.Значение;
				НоваяСтрока.Организация        = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
				НоваяСтрока.Период             = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата; 
				НоваяСтрока.СодержаниеПроводки = "";
				НоваяСтрока.Сумма              = (Сумма1 + Сумма2) * 0.18;
				
			КонецЕсли;	
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

Процедура ОтразитьДоходыИРасходы(ТаблицаРасчетыПоНалогам ,ДополнительныеСвойства) Экспорт 
	
Если ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда	
		Если ДополнительныеСвойства.ДляПроведения.Ссылка.СуммаВключаетНДС Тогда 
			
			// Регистр бухгалтерии "Управленческий"
			Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.РаботыИУслуги Цикл
				
				ДокСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
				ВалютаУчета = Константы.ВалютаУчета.Получить();
				
				ПараметрыВалютаУчета = Новый Структура;
				ПараметрыВалютаУчета.Вставить("Валюта",    ДополнительныеСвойства.ДляПроведения.Ссылка.ВалютаДокумента);
				ПараметрыВалютаУчета.Вставить("Курс",      ДополнительныеСвойства.ДляПроведения.Ссылка.Курс);
				ПараметрыВалютаУчета.Вставить("Кратность", ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность);
				
				ПараметрыВалюты = Новый Структура;
				ПараметрыВалюты.Вставить("Валюта",    ВалютаУчета);                   
				ПараметрыВалюты.Вставить("Курс",      1);
				ПараметрыВалюты.Вставить("Кратность", 1);
				
				СуммаНДС = ПересчитатьПоКурсу(ТекСтрока.СуммаНДС, ПараметрыВалютаУчета, ПараметрыВалюты);
				
				НоваяСтрока = ТаблицаРасчетыПоНалогам.Добавить();
				НоваяСтрока.НаправлениеДеятельности = ТекСтрока.Номенклатура.НаправлениеДеятельности; 
				НоваяСтрока.ЗаказПокупателя         = ?(ДокСсылка.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка(), ТекСтрока.ЗаказПокупателя, ДокСсылка.ЗаказПокупателя);   
				НоваяСтрока.НомерСтроки             = ТаблицаРасчетыПоНалогам.Количество() + 1;
				НоваяСтрока.Организация             = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
				НоваяСтрока.Период                  = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата; 
				НоваяСтрока.Порядок                 = ТаблицаРасчетыПоНалогам.Количество() + 1;
				НоваяСтрока.СодержаниеПроводки      = "Отражение доходов";
				НоваяСтрока.СтруктурнаяЕдиница      = ДополнительныеСвойства.ДляПроведения.Ссылка.Подразделение;
				НоваяСтрока.Сумма                   = - СуммаНДС;
				НоваяСтрока.СуммаДоходов            = - СуммаНДС;
				//НоваяСтрока.СуммаРасходов           =
				НоваяСтрока.СчетУчета               = ТекСтрока.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж;
				
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		Если ДополнительныеСвойства.ДляПроведения.Ссылка.Контрагент.Нерезидент Тогда 
			
			Если ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата.Количество() = 0 Тогда  
				
				// Расходы
				Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Расходы Цикл						
					Курс                = ДополнительныеСвойства.ДляПроведения.Ссылка.Курс;
					Кратность           = ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность;
					СуммаДокумента      = ТекСтрока.Сумма;
					
					Сумма = СуммаДокумента * (Курс / Кратность) / 90*10;	
					
					НоваяСтрока = ТаблицаРасчетыПоНалогам.Добавить();
					НоваяСтрока.ЗаказПокупателя            = ТекСтрока.Заказ;
					НоваяСтрока.НаправлениеДеятельности    = ТекСтрока.НаправлениеДеятельности;
					НоваяСтрока.НомерСтроки                = ?(НоваяСтрока.НомерСтроки = Неопределено, 0, НоваяСтрока.НомерСтроки) + 1;
					НоваяСтрока.Организация                = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					НоваяСтрока.Период                     = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					НоваяСтрока.Порядок                    = 1;
					НоваяСтрока.СодержаниеПроводки         = "დანახარჯების ასახვა";
					НоваяСтрока.СтруктурнаяЕдиница         = ТекСтрока.СтруктурнаяЕдиница;
					НоваяСтрока.Сумма                      = Сумма;
					НоваяСтрока.СуммаДоходов               = 0;
					НоваяСтрока.СуммаРасходов              = Сумма;
					//НоваяСтрока.СчетУчета                  = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_ДТ_1_1.Значение;
					НоваяСтрока.СчетУчета                  = ТекСтрока.Номенклатура.СчетУчетаЗатрат;

				КонецЦикла;
				
				// Запасы
				Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Запасы Цикл
					
					Если ТекСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда Продолжить; КонецЕсли; 
					
					Курс                = ДополнительныеСвойства.ДляПроведения.Ссылка.Курс;
					Кратность           = ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность;
					СуммаДокумента      = ТекСтрока.Сумма;
										
					Сумма = СуммаДокумента * (Курс / Кратность) / 90*10;
					
					НоваяСтрока = ТаблицаРасчетыПоНалогам.Добавить();
					НоваяСтрока.ЗаказПокупателя            = ТекСтрока.Заказ;
					//НоваяСтрока.НаправлениеДеятельности    = ТекСтрока.НаправлениеДеятельности;
					НоваяСтрока.НомерСтроки                = ?(НоваяСтрока.НомерСтроки = Неопределено, 0, НоваяСтрока.НомерСтроки) + 1;
					НоваяСтрока.Организация                = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					НоваяСтрока.Период                     = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					НоваяСтрока.Порядок                    = 1;
					НоваяСтрока.СодержаниеПроводки         = "დანახარჯების ასახვა";
					НоваяСтрока.СтруктурнаяЕдиница         = ДополнительныеСвойства.ДляПроведения.Ссылка.СтруктурнаяЕдиница;
					НоваяСтрока.Сумма                      = Сумма;
					НоваяСтрока.СуммаДоходов               = 0;
					НоваяСтрока.СуммаРасходов              = Сумма;
					НоваяСтрока.СчетУчета                  = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_ДТ_1_1.Значение;
					
				КонецЦикла;
				
			Иначе 
				
				// Расходы
				Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Расходы Цикл
					
					ПредоплатаКурс      = ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата[0].Курс;
					ПредоплатаКратность = ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата[0].Кратность;
					Курс                = ДополнительныеСвойства.ДляПроведения.Ссылка.Курс;
					Кратность           = ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность;
					СуммаДокумента      = ТекСтрока.Сумма;
					
					Сумма = СуммаДокумента * (ПредоплатаКурс / ПредоплатаКратность) / 90*10;
					
					// 1)
					НоваяСтрока = ТаблицаРасчетыПоНалогам.Добавить();
					НоваяСтрока.ЗаказПокупателя            = ТекСтрока.Заказ;
					НоваяСтрока.НаправлениеДеятельности    = ТекСтрока.НаправлениеДеятельности;
					НоваяСтрока.НомерСтроки                = ?(НоваяСтрока.НомерСтроки = Неопределено, 0, НоваяСтрока.НомерСтроки) + 1;
					НоваяСтрока.Организация                = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					НоваяСтрока.Период                     = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					НоваяСтрока.Порядок                    = 1;
					НоваяСтрока.СодержаниеПроводки         = "დანახარჯების ასახვა";
					НоваяСтрока.СтруктурнаяЕдиница         = ТекСтрока.СтруктурнаяЕдиница;   
					НоваяСтрока.Сумма                      = Сумма;
					НоваяСтрока.СуммаДоходов               = 0;
					НоваяСтрока.СуммаРасходов              = Сумма;
					//НоваяСтрока.СчетУчета                  = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_ДТ_1_1.Значение;
					НоваяСтрока.СчетУчета                  = ТекСтрока.Номенклатура.СчетУчетаЗатрат;
					
				КонецЦикла;
				
				// Запасы
				Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Запасы Цикл
					
					Если ТекСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда Продолжить; КонецЕсли; 
					
					ПредоплатаКурс      = ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата[0].Курс;
					ПредоплатаКратность = ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата[0].Кратность;
					Курс                = ДополнительныеСвойства.ДляПроведения.Ссылка.Курс;
					Кратность           = ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность;
					СуммаДокумента      = ТекСтрока.Сумма;
										
					Сумма = СуммаДокумента * (ПредоплатаКурс / ПредоплатаКратность) / 90*10;
					
					НоваяСтрока = ТаблицаРасчетыПоНалогам.Добавить();
					НоваяСтрока.ЗаказПокупателя            = ТекСтрока.Заказ;
					//НоваяСтрока.НаправлениеДеятельности    = ТекСтрока.НаправлениеДеятельности;
					НоваяСтрока.НомерСтроки                = ?(НоваяСтрока.НомерСтроки = Неопределено, 0, НоваяСтрока.НомерСтроки) + 1;
					НоваяСтрока.Организация                = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
					НоваяСтрока.Период                     = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
					НоваяСтрока.Порядок                    = 1;
					НоваяСтрока.СодержаниеПроводки         = "დანახარჯების ასახვა";
					НоваяСтрока.СтруктурнаяЕдиница         = ДополнительныеСвойства.ДляПроведения.Ссылка.СтруктурнаяЕдиница;
					НоваяСтрока.Сумма                      = Сумма;
					НоваяСтрока.СуммаДоходов               = 0;
					НоваяСтрока.СуммаРасходов              = Сумма;
					НоваяСтрока.СчетУчета                  = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_ДТ_1_1.Значение;
					
				КонецЦикла;
				
			КонецЕсли;
						
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПриходнаяНакладная_ОтразитьЗапасы(ТаблицаЗапасы, ДополнительныеСвойства) Экспорт
		
	Если ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		Если ДополнительныеСвойства.ДляПроведения.Ссылка.Контрагент.Нерезидент Тогда
			
			Если ДополнительныеСвойства.ДляПроведения.Ссылка.Предоплата.Количество() = 0 Тогда  
				
				Если ДополнительныеСвойства.ДляПроведения.Ссылка.Запасы.Количество() <> 0  Тогда 
					
					// Расходы
					Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Расходы Цикл						
						Курс                = ДополнительныеСвойства.ДляПроведения.Ссылка.Курс;
						Кратность           = ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность;
						СуммаДокумента      = ТекСтрока.Сумма;
						
						// 1)
						НоваяСтрока = ТаблицаЗапасы.Добавить();	
						
						НоваяСтрока.ВидДвижения             = ВидДвиженияНакопления.Приход;
						//НоваяСтрока.Возврат                 = Ложь;
						//НоваяСтрока.ДокументПродажи         = Неопределено;
						НоваяСтрока.ЗаказПокупателя         = Неопределено;
						//НоваяСтрока.ИсточникОбеспечения     = ДополнительныеСвойства.ДляПроведения.Ссылка.ДокументОснование;
						НоваяСтрока.Количество              = ТекСтрока.Количество;
						//НоваяСтрока.КоррЗаказПокупателя     =
						//НоваяСтрока.КоррНоменклатура        =
						//НоваяСтрока.КоррОрганизация         =
						//НоваяСтрока.КоррПартия              =
						//НоваяСтрока.КоррСтруктурнаяЕдиница  =
						//НоваяСтрока.КоррСчетУчета           =
						//НоваяСтрока.КоррХарактеристика      =
						НоваяСтрока.Номенклатура            = ТекСтрока.Номенклатура;
						НоваяСтрока.НомерСтроки             = ?(НоваяСтрока.НомерСтроки = Неопределено, 0, НоваяСтрока.НомерСтроки) + 1;
						НоваяСтрока.Организация             = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
						//НоваяСтрока.Ответственный           = ДополнительныеСвойства.ДляПроведения.Ссылка.Ответственный;
						НоваяСтрока.Партия                  = Неопределено;
						НоваяСтрока.Период                  = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
						//НоваяСтрока.ПериодПланирования      = Справочники.ПериодыПланирования.Фактический;
						//НоваяСтрока.Себестоимость           = ТекСтрока.Себестоимость;
						НоваяСтрока.СодержаниеПроводки      = "Оприходование запасов";
						//НоваяСтрока.СтавкаНДС               = ТекСтрока.СтавкаНДС;
						НоваяСтрока.СтруктурнаяЕдиница      = ДополнительныеСвойства.ДляПроведения.Ссылка.СтруктурнаяЕдиница;
						НоваяСтрока.Сумма                   = СуммаДокумента * (Курс / Кратность) / 90*10;
						НоваяСтрока.СчетУчета               = ПланыСчетов.Управленческий.ТоварыПродукция;
						НоваяСтрока.ФиксированнаяСтоимость  = ПланыСчетов.Управленческий.СырьеИМатериалы;
						//НоваяСтрока.Характеристика          = ТекСтрока.Характеристика;									
					КонецЦикла;
					
					// Запасы
					Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Запасы Цикл						
						Курс                = ДополнительныеСвойства.ДляПроведения.Ссылка.Курс;
						Кратность           = ДополнительныеСвойства.ДляПроведения.Ссылка.Кратность;
						СуммаДокумента      = ТекСтрока.Сумма;
						
						// 1)
						НоваяСтрока = ТаблицаЗапасы.Добавить();	
						
						НоваяСтрока.ВидДвижения             = ВидДвиженияНакопления.Приход;
						//НоваяСтрока.Возврат                 = Ложь;
						//НоваяСтрока.ДокументПродажи         = Неопределено;
						НоваяСтрока.ЗаказПокупателя         = Неопределено;
						//НоваяСтрока.ИсточникОбеспечения     = ДополнительныеСвойства.ДляПроведения.Ссылка.ДокументОснование;
						НоваяСтрока.Количество              = ТекСтрока.Количество;
						//НоваяСтрока.КоррЗаказПокупателя     =
						//НоваяСтрока.КоррНоменклатура        =
						//НоваяСтрока.КоррОрганизация         =
						//НоваяСтрока.КоррПартия              =
						//НоваяСтрока.КоррСтруктурнаяЕдиница  =
						//НоваяСтрока.КоррСчетУчета           =
						//НоваяСтрока.КоррХарактеристика      =
						НоваяСтрока.Номенклатура            = ТекСтрока.Номенклатура;
						НоваяСтрока.НомерСтроки             = ?(НоваяСтрока.НомерСтроки = Неопределено, 0, НоваяСтрока.НомерСтроки) + 1;
						НоваяСтрока.Организация             = ДополнительныеСвойства.ДляПроведения.Ссылка.Организация;
						//НоваяСтрока.Ответственный           = ДополнительныеСвойства.ДляПроведения.Ссылка.Ответственный;
						НоваяСтрока.Партия                  = Неопределено;
						НоваяСтрока.Период                  = ДополнительныеСвойства.ДляПроведения.Ссылка.Дата;
						//НоваяСтрока.ПериодПланирования      = Справочники.ПериодыПланирования.Фактический;
						//НоваяСтрока.Себестоимость           = ТекСтрока.Себестоимость;
						НоваяСтрока.СодержаниеПроводки      = "Оприходование запасов";
						//НоваяСтрока.СтавкаНДС               = ТекСтрока.СтавкаНДС;
						НоваяСтрока.СтруктурнаяЕдиница      = ДополнительныеСвойства.ДляПроведения.Ссылка.СтруктурнаяЕдиница;
						НоваяСтрока.Сумма                   = СуммаДокумента * (Курс / Кратность) / 90*10;
						НоваяСтрока.СчетУчета               = ПланыСчетов.Управленческий.ТоварыПродукция;
						НоваяСтрока.ФиксированнаяСтоимость  = ПланыСчетов.Управленческий.СырьеИМатериалы;
						НоваяСтрока.Характеристика          = ТекСтрока.Характеристика;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнительныеРасходы_ОтразитьЗапасы(ТаблицаЗапасы, ДополнительныеСвойства) Экспорт
	
	Для каждого ТекСтрока Из ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы Цикл
		ТекСтрока.ЗаказПокупателя = Неопределено;
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПередачаВА_ОтрозитьДоходыИРасходы(ДополнительныеСвойства, Движения) Экспорт
	
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПередачаВА") Тогда
		
		Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.ВнеоборотныеАктивы Цикл						
			Движение = Движения.ДоходыИРасходы.Добавить();
			Движение.Период = ДокументСсылка.Дата;
			Движение.Организация = ДокументСсылка.Организация;
			//Движение.СтруктурнаяЕдиница = ДокументСсылка.СтруктурнаяЕдиница;
			Движение.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
			Движение.СчетУчета = ПланыСчетов.Управленческий.НайтиПоКоду("7455");
			Движение.СуммаРасходов = ТекСтрока.АмортизацияЗаМесяц;
			Движение.СодержаниеПроводки = НСтр("ru='Начисление амортизации';ka='ამორტიზაციის დარიცხვა'");			
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ЧекККМ_ОтрозитьРасчетыСПокупателями(ДополнительныеСвойства, Движения) Экспорт 
	
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЧекККМ") Или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
		
		Если Не (ДополнительныеСвойства.ДляПроведения.ЧекПробит И (Не ДополнительныеСвойства.ДляПроведения.Архивный)) Тогда
			Возврат;
		КонецЕсли; 
		
		Движения.РасчетыСПокупателями.Записывать = Истина;
		
		Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Запасы Цикл						
			Движение = Движения.РасчетыСПокупателями.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период      = ДокументСсылка.Дата;
			Движение.Организация = ДокументСсылка.Организация;
			Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
			Движение.Контрагент  = ДокументСсылка.Контрагент;
			Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
			Движение.Документ    = ДокументСсылка;
			Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
			Движение.Сумма       = ТекСтрока.Сумма;
			Движение.СуммаВал    = ТекСтрока.Сумма;
			Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
			
			Если ДополнительныеСвойства.ДляПроведения.Ссылка.AzRyВидыОперацийЧекККМ <> Перечисления.AzRyВидыОперацийЧекККМ.Терминалом Тогда		
				Движение = Движения.РасчетыСПокупателями.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период      = ДокументСсылка.Дата;
				Движение.Организация = ДокументСсылка.Организация;
				Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
				Движение.Контрагент  = ДокументСсылка.Контрагент;
				Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
				Движение.Документ    = ДокументСсылка;
				Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
				Движение.Сумма       = ТекСтрока.Сумма;
				Движение.СуммаВал    = ТекСтрока.Сумма;
				Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";
			КонецЕсли; 
			
			Если ДополнительныеСвойства.ДляПроведения.Ссылка.AzRyВидыОперацийЧекККМ = Перечисления.AzRyВидыОперацийЧекККМ.РасходнаяНакладнаяПлатежнаяКарта Тогда				
				Движение = Движения.РасчетыСПокупателями.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период      = ДокументСсылка.Дата;
				Движение.Организация = ДокументСсылка.Организация;
				Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
				Движение.Контрагент  = Справочники.AzRyНастройки.ЧекККМКонтрагентТерминал.Значение;
				Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
				Движение.Документ    = ДокументСсылка;
				Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
				Движение.Сумма       = ТекСтрока.Сумма;
				Движение.СуммаВал    = ТекСтрока.Сумма;
				Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";		
			КонецЕсли; 
		КонецЦикла;
		
		Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.ОплатаПлатежнымиКартами Цикл						
			Движение = Движения.РасчетыСПокупателями.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период      = ДокументСсылка.Дата;
			Движение.Организация = ДокументСсылка.Организация;
			Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
			Движение.Контрагент  = ДокументСсылка.Контрагент;
			Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
			Движение.Документ    = ДокументСсылка;
			Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
			Движение.Сумма       = ТекСтрока.Сумма;
			Движение.СуммаВал    = ТекСтрока.Сумма;
			Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
			
			Если ДополнительныеСвойства.ДляПроведения.Ссылка.AzRyВидыОперацийЧекККМ <> Перечисления.AzRyВидыОперацийЧекККМ.Терминалом Тогда
				Движение = Движения.РасчетыСПокупателями.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период      = ДокументСсылка.Дата;
				Движение.Организация = ДокументСсылка.Организация;
				Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
				Движение.Контрагент  = ДокументСсылка.Контрагент;
				Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
				Движение.Документ    = ДокументСсылка;
				Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
				Движение.Сумма       = ТекСтрока.Сумма;
				Движение.СуммаВал    = ТекСтрока.Сумма;
				Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";
			КонецЕсли;
			
			Если ДополнительныеСвойства.ДляПроведения.Ссылка.AzRyВидыОперацийЧекККМ = Перечисления.AzRyВидыОперацийЧекККМ.РасходнаяНакладнаяПлатежнаяКарта Тогда				
				Движение = Движения.РасчетыСПокупателями.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период      = ДокументСсылка.Дата;
				Движение.Организация = ДокументСсылка.Организация;
				Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
				Движение.Контрагент  = Справочники.AzRyНастройки.ЧекККМКонтрагентТерминал.Значение;
				Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
				Движение.Документ    = ДокументСсылка;
				Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
				Движение.Сумма       = ТекСтрока.Сумма;
				Движение.СуммаВал    = ТекСтрока.Сумма;
				Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";		
			КонецЕсли;
		КонецЦикла;
		
		// ანალიტიკისთვის
		
		Движения.AzRyАналитикаРасчетыСПокупателями.Записывать = Истина;
		
		Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Запасы Цикл						
			Движение = Движения.AzRyАналитикаРасчетыСПокупателями.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период      = ДокументСсылка.Дата;
			Движение.Организация = ДокументСсылка.Организация;
			Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
			Движение.Контрагент  = ДокументСсылка.AzRyАналитикаКонтрагент;
			Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
			Движение.Документ    = ДокументСсылка;
			Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
			Движение.Сумма       = ТекСтрока.Сумма;
			Движение.СуммаВал    = ТекСтрока.Сумма;
			Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
			
			Движение = Движения.AzRyАналитикаРасчетыСПокупателями.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период      = ДокументСсылка.Дата;
			Движение.Организация = ДокументСсылка.Организация;
			Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
			Движение.Контрагент  = ДокументСсылка.AzRyАналитикаКонтрагент;
			Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
			Движение.Документ    = ДокументСсылка;
			Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
			Движение.Сумма       = ТекСтрока.Сумма;
			Движение.СуммаВал    = ТекСтрока.Сумма;
			Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
		КонецЦикла;
		
		//Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.ОплатаПлатежнымиКартами Цикл						
		//	Движение = Движения.AzRyАналитикаРасчетыСПокупателями.Добавить();
		//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		//	Движение.Период      = ДокументСсылка.Дата;
		//	Движение.Организация = ДокументСсылка.Организация;
		//	Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
		//	Движение.Контрагент  = ДокументСсылка.AzRyАналитикаКонтрагент;
		//	Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
		//	Движение.Документ    = ДокументСсылка;
		//	Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
		//	Движение.Сумма       = ТекСтрока.Сумма;
		//	Движение.СуммаВал    = ТекСтрока.Сумма;
		//	Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
		//	
		//	Движение = Движения.AzRyАналитикаРасчетыСПокупателями.Добавить();
		//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		//	Движение.Период      = ДокументСсылка.Дата;
		//	Движение.Организация = ДокументСсылка.Организация;
		//	Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
		//	Движение.Контрагент  = ДокументСсылка.AzRyАналитикаКонтрагент;
		//	Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
		//	Движение.Документ    = ДокументСсылка;
		//	Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
		//	Движение.Сумма       = ТекСтрока.Сумма;
		//	Движение.СуммаВал    = ТекСтрока.Сумма;
		//	Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";			
		//КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
				
		Движения.РасчетыСПокупателями.Записывать = Истина;
		
		Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Запасы Цикл						
			Движение = Движения.РасчетыСПокупателями.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период      = ДокументСсылка.Дата;
			Движение.Организация = ДокументСсылка.Организация;
			Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
			Движение.Контрагент  = ТекСтрока.Контрагент;
			Движение.Договор     = ТекСтрока.AzRyЗаказПокупателя.Договор;
			Движение.Документ    = ДокументСсылка;
			Движение.Заказ       = ТекСтрока.AzRyЗаказПокупателя;
			Движение.Сумма       = ТекСтрока.Сумма;
			Движение.СуммаВал    = ТекСтрока.Сумма;
			Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";
			
			Если ТекСтрока.AzRyВидыОперацийЧекККМ <> Перечисления.AzRyВидыОперацийЧекККМ.Терминалом Тогда
				Движение = Движения.РасчетыСПокупателями.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период      = ДокументСсылка.Дата;
				Движение.Организация = ДокументСсылка.Организация;
				Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
				Движение.Контрагент  = ТекСтрока.Контрагент;
				Движение.Договор     = ТекСтрока.AzRyЗаказПокупателя.Договор;
				Движение.Документ    = ДокументСсылка;
				Движение.Заказ       = ТекСтрока.AzRyЗаказПокупателя;
				Движение.Сумма       = ТекСтрока.Сумма;
				Движение.СуммаВал    = ТекСтрока.Сумма;
				Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";
			КонецЕсли;
			
			Если ТекСтрока.AzRyВидыОперацийЧекККМ = Перечисления.AzRyВидыОперацийЧекККМ.РасходнаяНакладнаяПлатежнаяКарта Тогда				
				Движение = Движения.РасчетыСПокупателями.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период      = ДокументСсылка.Дата;
				Движение.Организация = ДокументСсылка.Организация;
				Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
				Движение.Контрагент  = Справочники.AzRyНастройки.ЧекККМКонтрагентТерминал.Значение;
				Движение.Договор     = ТекСтрока.AzRyЗаказПокупателя.Договор;
				Движение.Документ    = ДокументСсылка;
				Движение.Заказ       = ТекСтрока.AzRyЗаказПокупателя;
				Движение.Сумма       = ТекСтрока.Сумма;
				Движение.СуммаВал    = ТекСтрока.Сумма;
				Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
			КонецЕсли;
		КонецЦикла;
		
		//Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.ОплатаПлатежнымиКартами Цикл						
		//	Движение = Движения.РасчетыСПокупателями.Добавить();
		//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		//	Движение.Период      = ДокументСсылка.Дата;
		//	Движение.Организация = ДокументСсылка.Организация;
		//	Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
		//	//Движение.Контрагент  = ТекСтрока.Контрагент;
		//	//Движение.Договор     = ТекСтрока.AzRyЗаказПокупателя.Договор;
		//	Движение.Документ    = ДокументСсылка;
		//	//Движение.Заказ       = ТекСтрока.AzRyЗаказПокупателя;
		//	Движение.Сумма       = ТекСтрока.Сумма;
		//	Движение.СуммаВал    = ТекСтрока.Сумма;
		//	Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
		//	
		//	Движение = Движения.РасчетыСПокупателями.Добавить();
		//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		//	Движение.Период      = ДокументСсылка.Дата;
		//	Движение.Организация = ДокументСсылка.Организация;
		//	Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
		//	//Движение.Контрагент  = ТекСтрока.Контрагент;
		//	//Движение.Договор     = ТекСтрока.AzRyЗаказПокупателя.Договор;
		//	Движение.Документ    = ДокументСсылка;
		//	//Движение.Заказ       = ТекСтрока.AzRyЗаказПокупателя;
		//	Движение.Сумма       = ТекСтрока.Сумма;
		//	Движение.СуммаВал    = ТекСтрока.Сумма;
		//	Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";
		//	
		//	Если ТекСтрока.AzRyВидыОперацийЧекККМ = Перечисления.AzRyВидыОперацийЧекККМ.РасходнаяНакладнаяПлатежнаяКарта Тогда				
		//		Движение = Движения.РасчетыСПокупателями.Добавить();
		//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		//		Движение.Период      = ДокументСсылка.Дата;
		//		Движение.Организация = ДокументСсылка.Организация;
		//		Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
		//		Движение.Контрагент  = Справочники.AzRyНастройки.ЧекККМКонтрагентТерминал.Значение;
		//		//Движение.Договор     = ТекСтрока.AzRyЗаказПокупателя.Договор;
		//		Движение.Документ    = ДокументСсылка;
		//		//Движение.Заказ       = ТекСтрока.AzRyЗаказПокупателя;
		//		Движение.Сумма       = ТекСтрока.Сумма;
		//		Движение.СуммаВал    = ТекСтрока.Сумма;
		//		Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";		
		//	КонецЕсли;			
		//КонецЦикла;
		
		// ანალიტიკისთვის
		
		Движения.AzRyАналитикаРасчетыСПокупателями.Записывать = Истина;
		
		Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Запасы Цикл						
			Движение = Движения.AzRyАналитикаРасчетыСПокупателями.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период      = ДокументСсылка.Дата;
			Движение.Организация = ДокументСсылка.Организация;
			Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
			Движение.Контрагент  = ТекСтрока.AzRyАналитикаКонтрагент;
			Движение.Договор     = ТекСтрока.AzRyЗаказПокупателя.Договор;
			Движение.Документ    = ДокументСсылка;
			Движение.Заказ       = ТекСтрока.AzRyЗаказПокупателя;
			Движение.Сумма       = ТекСтрока.Сумма;
			Движение.СуммаВал    = ТекСтрока.Сумма;
			Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
			
			Движение = Движения.AzRyАналитикаРасчетыСПокупателями.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период      = ДокументСсылка.Дата;
			Движение.Организация = ДокументСсылка.Организация;
			Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
			Движение.Контрагент  = ТекСтрока.AzRyАналитикаКонтрагент;
			Движение.Договор     = ТекСтрока.AzRyЗаказПокупателя.Договор;
			Движение.Документ    = ДокументСсылка;
			Движение.Заказ       = ТекСтрока.AzRyЗаказПокупателя;
			Движение.Сумма       = ТекСтрока.Сумма;
			Движение.СуммаВал    = ТекСтрока.Сумма;
			Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
		КонецЦикла;
		
		//Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.ОплатаПлатежнымиКартами Цикл						
		//	Движение = Движения.AzRyАналитикаРасчетыСПокупателями.Добавить();
		//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		//	Движение.Период      = ДокументСсылка.Дата;
		//	Движение.Организация = ДокументСсылка.Организация;
		//	Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
		//	Движение.Контрагент  = ТекСтрока.AzRyАналитикаКонтрагент;
		//	Движение.Договор     = ТекСтрока.AzRyЗаказПокупателя.Договор;
		//	Движение.Документ    = ДокументСсылка;
		//	Движение.Заказ       = ТекСтрока.AzRyЗаказПокупателя;
		//	Движение.Сумма       = ТекСтрока.Сумма;
		//	Движение.СуммаВал    = ТекСтрока.Сумма;
		//	Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
		//	
		//	Движение = Движения.РасчетыСПокупателями.Добавить();
		//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		//	Движение.Период      = ДокументСсылка.Дата;
		//	Движение.Организация = ДокументСсылка.Организация;
		//	Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
		//	Движение.Контрагент  = ТекСтрока.AzRyАналитикаКонтрагент;
		//	Движение.Договор     = ТекСтрока.AzRyЗаказПокупателя.Договор;
		//	Движение.Документ    = ДокументСсылка;
		//	Движение.Заказ       = ТекСтрока.AzRyЗаказПокупателя;
		//	Движение.Сумма       = ТекСтрока.Сумма;
		//	Движение.СуммаВал    = ТекСтрока.Сумма;
		//	Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";			
		//КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

Процедура ЧекККМ_ОтрозитьУправленческий(ДополнительныеСвойства, Движения) Экспорт 
	
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
		
		Движения.Управленческий.Записывать = Истина;
		Для каждого ТС Из ДополнительныеСвойства.ДляПроведения.Ссылка.Запасы Цикл
			Если Не ТС.AzRyВидыОперацийЧекККМ = Перечисления.AzRyВидыОперацийЧекККМ.Терминалом И Не ТС.AzRyВидыОперацийЧекККМ = Перечисления.AzRyВидыОперацийЧекККМ.РасходнаяНакладнаяПлатежнаяКарта Тогда
				Движение = Движения.Управленческий.Добавить();
				Движение.Период = ДокументСсылка.Дата;
				Движение.Организация = ДокументСсылка.Организация;
				Движение.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
				Движение.СчетКт = ТС.Контрагент.СчетУчетаРасчетовСПокупателем;
				Движение.ВалютаДт = ДокументСсылка.ВалютаДокумента;
				Движение.СуммаВалДт = ТС.Сумма;
				Движение.СчетДт = ДокументСсылка.КассаККМ.СчетУчета;
				Движение.Сумма = ПолучитьСуммуВУчетнойВВалюте(ДокументСсылка.ВалютаДокумента, ДокументСсылка.Дата, ТС.Сумма, Неопределено);
				Движение.Содержание = "ფულის შეტანა სალაროში";			
			КонецЕсли; 	
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоступлениеНаСчет_ОтразитьРасчетыПоНалогам(ДокументСсылка, Движения, Отказ) Экспорт
		
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
		Для каждого ТекСтрока Из ДокументСсылка.РасшифровкаПлатежа Цикл
			Если ЗначениеЗаполнено(ДокументСсылка.ДокументОснование) И ТипЗнч(ДокументСсылка.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя")
				И ДокументСсылка.ДокументОснование.AzRyАванс И ТекСтрока.ПризнакАванса Тогда
				Движения.РасчетыПоНалогам.Записывать = Истина;
				Движение = Движения.РасчетыПоНалогам.Добавить();
				Движение.Период = ДокументСсылка.Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Организация = ДокументСсылка.Организация;
				Движение.ВидНалога = ДокументСсылка.Организация.ВидНалогаНДС;
				//СуммаНДС = ТекСтрока.СуммаРасчетов - ТекСтрока.СуммаРасчетов / ((ТекСтрока.СтавкаНДС.Ставка + 100) / 100);
				//Движение.Сумма = ПолучитьСуммуВУчетнойВВалюте(ДокументСсылка.ВалютаДенежныхСредств, ДокументСсылка.Дата, ТекСтрока.СуммаНДС, ДокументСсылка);
				Движение.Сумма = ТекСтрока.СуммаНДС;
			КонецЕсли; 
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходСоСчета") Тогда
		Для каждого ТекСтрока Из ДокументСсылка.РасшифровкаПлатежа Цикл   
			Если (ТипЗнч(ТекСтрока.Заказ) = Тип("ДокументСсылка.ЗаказПоставщику") И ТекСтрока.Заказ.AzRyАванс) И ТекСтрока.ПризнакАванса Тогда
				Движения.РасчетыПоНалогам.Записывать = Истина;
				Движение = Движения.РасчетыПоНалогам.Добавить();
				Движение.Период = ДокументСсылка.Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Организация = ДокументСсылка.Организация;
				Движение.ВидНалога = ДокументСсылка.Организация.ВидНалогаНДС;
				//Движение.Сумма = ТекСтрока.СуммаНДС;
				Движение.Сумма = ТекСтрока.СуммаПлатежа - (ТекСтрока.СуммаПлатежа) / ((ДокументСсылка.Организация.СтавкаНДСПоУмолчанию.Ставка + 100) / 100);
				Движение.Сумма = ПолучитьСуммуВУчетнойВВалюте(ДокументСсылка.ВалютаДенежныхСредств, ДокументСсылка.Дата, Движение.Сумма, , , );
			КонецЕсли; 
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриходнаяНакладная_ОтразитьРасчетыПоНалогам(ДокументСсылка, Движения, Отказ) Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ДополнительныеРасходы") Тогда 
		
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Сумма");
		ТЗ.Колонки.Добавить("СодержаниеПроводки");
		ТЗ.Колонки.Добавить("ВидНалога");
		
		ИтогСуммаУВ   = 0;
		СуммаУВ       = 0;
		ПризнакАванса = Ложь;
		
		Об = ДокументСсылка;	
		ИтогВсего      = Об.Запасы.Итог("Всего") + Об.Расходы.Итог("Всего");
		ИтогСуммаНДС   = Об.Запасы.Итог("СуммаНДС") + Об.Расходы.Итог("СуммаНДС");
		ИтогСуммаНДСУВ = ПолучитьСуммуВУчетнойВВалюте(Об.ВалютаДокумента, Об.Дата, ИтогСуммаНДС, , Об.Курс, Об.Кратность);
		
		Для каждого ТекСтрока Из ДокументСсылка.Предоплата Цикл
			Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.ДополнительныеРасходы") И ТипЗнч(ТекСтрока.Заказ) = Тип("ДокументСсылка.ЗаказПоставщику") И ТекСтрока.Заказ.AzRyАванс Тогда
				
				ПризнакАванса = Истина;
				СуммаУВ = ПолучитьСуммуВУчетнойВВалюте(ТекСтрока.Документ.ВалютаДенежныхСредств, ТекСтрока.Документ.Дата, ТекСтрока.СуммаПлатежа, , , );
				СуммаУВ = СуммаУВ - СуммаУВ / ((ТекСтрока.Документ.Организация.СтавкаНДСПоУмолчанию.Ставка + 100) / 100);
				ИтогСуммаУВ = ИтогСуммаУВ + СуммаУВ;								
				
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока.Сумма = -?(СуммаУВ > ИтогСуммаНДСУВ, ИтогСуммаНДСУВ, СуммаУВ);
			КонецЕсли; 
		КонецЦикла; 
		
		Для каждого ТекСтрока Из ДокументСсылка.Расходы Цикл
			Если ДокументСсылка.Договор.AzRyУдерживатьПенсионныйНалог Тогда
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока.Сумма = ТекСтрока.Сумма * Константы.AzRyПенсионныйНалогПроцент.Получить(); 
				НоваяСтрока.СодержаниеПроводки = НСтр("ru = 'Накопительная пенсия - Процент'; ka = 'დაგროვებითი საპენსიოს პროცენტი'");
				НоваяСтрока.ВидНалога = ДокументСсылка.Договор.AzRyСчетПенсионногоНалога; 
			КонецЕсли; 
		КонецЦикла;
		
		//Если (ДокументСсылка.Предоплата.Количество() > 0 И ПризнакАванса) Тогда
		Для каждого ТекСтрока Из ТЗ Цикл		
			Движения.РасчетыПоНалогам.Записывать = Истина;
			Движение = Движения.РасчетыПоНалогам.Добавить();
			Движение.Период      = ДокументСсылка.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Организация = ДокументСсылка.Организация;
			Движение.ВидНалога   = ?(ЗначениеЗаполнено(ТекСтрока.ВидНалога), ТекСтрока.ВидНалога, ДокументСсылка.Организация.ВидНалогаНДС);
			Движение.Сумма       = ТекСтрока.Сумма;
			Движение.СодержаниеПроводки = ТекСтрока.СодержаниеПроводки;
		КонецЦикла;
		//КонецЕсли; 
			
	КонецЕсли;
	
КонецПроцедуры
 
Процедура ПриходнаяНакладная_СформироватьТаблицаЗакупки(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗакупки.Период КАК Период,
	|	ТаблицаЗакупки.Организация КАК Организация,
	|	ТаблицаЗакупки.Номенклатура КАК Номенклатура,
	|	ТаблицаЗакупки.Характеристика КАК Характеристика,
	|	ТаблицаЗакупки.Партия КАК Партия,
	|	ТаблицаЗакупки.Заказ КАК ЗаказПоставщику,
	|	ТаблицаЗакупки.Документ КАК Документ,
	|	ТаблицаЗакупки.СтавкаНДС КАК СтавкаНДС,
	// +++ { AzRy - [16.06.2014] - Jira:ERPM-287 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:registrshi unda moxvdes axali rekviziti
	|	ТаблицаЗакупки.AzRyНаименованияПоставщиков КАК AzRyНаименованияПоставщиков,
	|	ТаблицаЗакупки.AzRyШтрихкодыНоменклатуры КАК AzRyШтрихкодыНоменклатуры,
	// +++ } AzRy - [16.06.2014] - Jira:ERPM-287 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:registrshi unda moxvdes axali rekviziti
	|	СУММА(ТаблицаЗакупки.Количество) КАК Количество,
	|	СУММА(ТаблицаЗакупки.СуммаНДСЗакупкиПродажи) КАК СуммаНДС,
	|	СУММА(ТаблицаЗакупки.Сумма) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗакупки
	|ГДЕ
	|	(ТаблицаЗакупки.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика)
	|			ИЛИ ТаблицаЗакупки.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗакупки.Период,
	|	ТаблицаЗакупки.Организация,
	|	ТаблицаЗакупки.Номенклатура,
	|	ТаблицаЗакупки.Характеристика,
	|	ТаблицаЗакупки.Партия,
	|	ТаблицаЗакупки.Заказ,
	|	ТаблицаЗакупки.Документ,
	|	ТаблицаЗакупки.СтавкаНДС,
	// +++ { AzRy - [16.06.2014] - Jira:ERPM-287 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:registrshi unda moxvdes axali rekviziti
	|	ТаблицаЗакупки.AzRyНаименованияПоставщиков,
	|	ТаблицаЗакупки.AzRyШтрихкодыНоменклатуры
	// +++ } AzRy - [16.06.2014] - Jira:ERPM-287 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:registrshi unda moxvdes axali rekviziti
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаЗакупки.Период КАК Период,
	|	ТаблицаЗакупки.Организация КАК Организация,
	|	ТаблицаЗакупки.Номенклатура КАК Номенклатура,
	|	ТаблицаЗакупки.Характеристика КАК Характеристика,
	|	ТаблицаЗакупки.Партия КАК Партия,
	|	ТаблицаЗакупки.Заказ КАК ЗаказПоставщику,
	|	ТаблицаЗакупки.Документ КАК Документ,
	|	ТаблицаЗакупки.СтавкаНДС КАК СтавкаНДС,
	// +++ { AzRy - [16.06.2014] - Jira:ERPM-287 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:registrshi unda moxvdes axali rekviziti
	|	ТаблицаЗакупки.AzRyНаименованияПоставщиков КАК AzRyНаименованияПоставщиков,
	|	ТаблицаЗакупки.AzRyШтрихкодыНоменклатуры КАК AzRyШтрихкодыНоменклатуры,
	// +++ } AzRy - [16.06.2014] - Jira:ERPM-287 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:registrshi unda moxvdes axali rekviziti
	|	0 КАК Количество,
	|	СУММА(ТаблицаЗакупки.AzRyСуммаРасходовНДС) КАК СуммаНДС,
	|	СУММА(ТаблицаЗакупки.AzRyСуммаРасходовВключаяНДС) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗакупки
	|ГДЕ
	|	(ТаблицаЗакупки.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика)
	|			ИЛИ ТаблицаЗакупки.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗакупки.Период,
	|	ТаблицаЗакупки.Организация,
	|	ТаблицаЗакупки.Номенклатура,
	|	ТаблицаЗакупки.Характеристика,
	|	ТаблицаЗакупки.Партия,
	|	ТаблицаЗакупки.Заказ,
	|	ТаблицаЗакупки.Документ,
	|	ТаблицаЗакупки.СтавкаНДС,
	// +++ { AzRy - [16.06.2014] - Jira:ERPM-287 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:registrshi unda moxvdes axali rekviziti
	|	ТаблицаЗакупки.AzRyНаименованияПоставщиков,
	|	ТаблицаЗакупки.AzRyШтрихкодыНоменклатуры ";
	// +++ } AzRy - [16.06.2014] - Jira:ERPM-287 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:registrshi unda moxvdes axali rekviziti
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗакупки", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗакупки()

Процедура ДополнительныеРасходы_СформироватьТаблицаЗакупки(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет) КАК ВидДвиженияУправленческий,
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	&ОприходованиеЗапасов КАК СодержаниеПроводки,
	|	0 КАК Количество,
	|	ТаблицаЗапасы.AzRyШтрихкодыНоменклатуры КАК AzRyШтрихкодыНоменклатуры,
	|	ТаблицаЗапасы.AzRyСуммаРасходовВключаяНДС КАК Сумма,
	|	ТаблицаЗапасы.AzRyСуммаРасходовНДС КАК СуммаНДС,
	|	ТаблицаЗапасы.Документ КАК Документ,
	|	ТаблицаЗапасы.ОснованиеДокументПоступления КАК ЗаказПоставщику
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы";
	
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ru='Оприходование запасов';ka='მარაგების შემოსავალში აყვანა'"));
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗакупки", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗакупки()


/////////////////////////////////////////////////////////////////////////////////////////
//                                 Подписки на события

Процедура ПодпискаНаСобытие1ОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
		                               
	//НР_Источник         = Метаданные.НайтиПоТипу(ТипЗнч(Источник)).Реквизиты.Найти("AzRyJiraCode");
	//															   Метаданные.НайтиПоТипу(ТипЗнч(ДанныеЗаполнения.ОрганизацияДокумента)).Реквизиты.Найти("AzRyJiraCode")             
	//Если Не ДанныеЗаполнения = Неопределено Тогда 
	//	НР_ДанныеЗаполнения = Метаданные.НайтиПоТипу(ТипЗнч(ДанныеЗаполнения)).Реквизиты.Найти("AzRyJiraCode");
	//Иначе 
	//	НР_Источник         = Неопределено;  
	//	НР_ДанныеЗаполнения = Неопределено;
	//КонецЕсли;	
	//	
	//Если Не НР_Источник = Неопределено Или Не НР_ДанныеЗаполнения = Неопределено Тогда 		
	//	Источник.AzRyПроекты  = ДанныеЗаполнения.AzRyПроекты;
	//	Источник.AzRyJiraCode = ДанныеЗаполнения.AzRyJiraCode;		
	//КонецЕсли;
	
КонецПроцедуры

	
//////////////////////////////////////////////////////////////////////////////////////////
//                                 Изменение проводки документов 2

Процедура ОтразитьЗапасы(ДокументСсылка, Движения, Отказ)  Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ДополнительныеРасходы") Тогда
		
		Если ДокументСсылка.Контрагент.Нерезидент Тогда
						
			Курс      = 0;
			Кратность = 0;			
			ПолучитьКурсДокумента(ДокументСсылка, Курс, Кратность);
			
			Движения.Запасы.Записывать = Истина;
			Для Каждого ТекСтрока Из ДокументСсылка.Запасы Цикл
				Движение = Движения.Запасы.Добавить();
				Движение.ВидДвижения             = ВидДвиженияНакопления.Приход;
				Движение.Период                  = ДокументСсылка.Дата;
				Движение.Организация             = ДокументСсылка.Организация;
				Движение.СтруктурнаяЕдиница      = ДокументСсылка.СтруктурнаяЕдиница;
				Движение.СчетУчета               = ТекСтрока.Номенклатура.СчетУчетаЗапасов;
				Движение.Номенклатура            = ТекСтрока.Номенклатура;
				Движение.Характеристика          = ТекСтрока.Характеристика;
				Движение.Партия                  = ТекСтрока.Партия;
				Движение.ЗаказПокупателя         = ?(ДокументСсылка.Договор.УдерживатьПодоходныйНалог, Неопределено, ТекСтрока.ЗаказПокупателя);
				Движение.Количество              = 0;
				Движение.Сумма                   = ТекСтрока.СуммаРасходов * (Курс / Кратность) / 90*10;
				Движение.ФиксированнаяСтоимость  = Истина;
				Движение.ЗатратыНаВыпуск         = Ложь;
				Движение.Возврат                 = Ложь;
				Движение.СодержаниеПроводки      = "Оприходование запасов";
				Движение.ПеремещениеВРозницуСуммовойУчет = Ложь;					
			КонецЦикла;						
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры	

Процедура ОтразитьУправленческий(ДокументСсылка, Движения, Отказ)  Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ДополнительныеРасходы") Тогда
		
		Если ДокументСсылка.Контрагент.Нерезидент Тогда
			
			Курс      = 0;
			Кратность = 0;
			ПолучитьКурсДокумента(ДокументСсылка, Курс, Кратность);
			
			Движения.Управленческий.Записывать = Истина;
			Для Каждого ТекСтрока Из ДокументСсылка.Запасы Цикл
				Движение = Движения.Управленческий.Добавить();
				Движение.Период             = ДокументСсылка.Дата;
				Движение.Организация        = ДокументСсылка.Организация;
				Движение.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
				Движение.СчетДт             = ТекСтрока.Номенклатура.СчетУчетаЗапасов;
				Движение.СчетКт             = Справочники.AzRyНастройки.ПриходнаяНакладная_Счет_КТ_1_2.Значение;
				//Движение.ВалютаКт           = ДокументСсылка.Договор.ВалютаРасчетов;
				Движение.Сумма              = ТекСтрока.СуммаРасходов * (Курс / Кратность) / 90*10;
				//Движение.СуммаВалКт         = ТекСтрока.СуммаРасходов;
				Движение.Содержание         = "დამატებითი ხარჯების შესავალში გატარება";
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОтразитьРасчетыПоНалогам(ДокументСсылка, Движения, Отказ)  Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ДополнительныеРасходы") Тогда
		
		Если ДокументСсылка.Контрагент.Нерезидент Тогда
			
			Курс      = 0;
			Кратность = 0;
			ПолучитьКурсДокумента(ДокументСсылка, Курс, Кратность);
			
			Движения.РасчетыПоНалогам.Записывать = Истина;
			Для Каждого ТекСтрока Из Движения.РасчетыПоНалогам Цикл
				ТекСтрока.Сумма = ТекСтрока.Сумма * (Курс / Кратность) / 90*10;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////////
//                                 Изменение проводки документов 2 - доп функций

Процедура ПолучитьКурсДокумента(ДокументСсылка, Курс, Кратность)
	
	Если ДокументСсылка.Предоплата.Количество() = 0 Тогда
		Курс      = ДокументСсылка.Курс;
		Кратность = ДокументСсылка.Кратность;
	Иначе 
		Курс      = ДокументСсылка.Предоплата[0].Курс;
		Кратность = ДокументСсылка.Предоплата[0].Кратность;
	КонецЕсли;	
		
КонецПроцедуры	
	
Функция АмортизацияДатаПредДокумента(ДатаДокумента) Экспорт

	ДатаДляВозврата = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АмортизацияВА.Дата КАК Дата,
		|	АмортизацияВА.Ссылка
		|ИЗ
		|	Документ.АмортизацияВА КАК АмортизацияВА
		|ГДЕ
		|	АмортизацияВА.Проведен = ИСТИНА
		|	И АмортизацияВА.Дата < &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		
	Запрос.УстановитьПараметр("Дата", ДатаДокумента);	

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		Возврат Запрос.Выполнить().Выгрузить()[0].Дата;
	КонецЦикла;
	
	Возврат ДатаДляВозврата;

КонецФункции
	

//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ДВИЖЕНИЙ РЕГИСТРОВ

// Выполняет движения регистра накопления РасчетыСПодотчетниками.
//
Процедура ОтразитьРасчетыСПодотчетниками(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчетыСПодотчетниками = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПодотчетниками1;
	
	Если Отказ
	 ИЛИ ТаблицаРасчетыСПодотчетниками.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРасчетыСПодотчетниками = Движения.РасчетыСПодотчетниками;
	ДвиженияРасчетыСПодотчетниками.Записывать = Истина;
	ДвиженияРасчетыСПодотчетниками.Загрузить(ТаблицаРасчетыСПодотчетниками);
	
КонецПроцедуры // ВыполнитьРасходПоРасчетамСПодотчетнымиЛицами()

//////////////////////////////////////////////////////////////////////////////// 
// OPTIMUS НДС-IS GATAREBIS KOREQTIREBULI (CHANACVLEBULI) VERSIA	

Процедура ОПТИМУС_ПроведениеНДСНаСервере_ОтрозитьДоходыИРасходы(ДокументСсылка, Движения, Отказ) Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		Если ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика 
			И ДокументСсылка.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
			
			Если Не ДокументСсылка.ВключатьРасходыВСебестоимость = Истина Тогда
				
				Движения.ДоходыИРасходы.Записывать = Истина;
				Для каждого ТекСтрока Из ДокументСсылка.Расходы Цикл
					
					Если ТекСтрока.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы 
						Или ТекСтрока.Номенклатура.СчетУчетаЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
						
						Движение = Движения.ДоходыИРасходы.Добавить();
						Движение.Период = ДокументСсылка.Дата;
						Движение.Организация = ДокументСсылка.Организация;
						Движение.СтруктурнаяЕдиница = ДокументСсылка.Подразделение;
						Движение.НаправлениеДеятельности = ТекСтрока.НаправлениеДеятельности;
						Движение.ЗаказПокупателя = ДокументСсылка.Расходы[0].Заказ;
						Движение.СчетУчета = ТекСтрока.Номенклатура.СчетУчетаЗатрат;
						Движение.СуммаРасходов = - 1 * ПолучитьСуммуВУчетнойВВалюте(ДокументСсылка.ВалютаДокумента, ДокументСсылка.Дата, ТекСтрока.СуммаНДС, ДокументСсылка);
						Движение.СодержаниеПроводки = "Корректировка начисленного НДС";
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		ИначеЕсли ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя Тогда
			ЗапросПоТабличнойЧасти = Новый Запрос;
			ЗапросПоТабличнойЧасти.Текст = "ВЫБРАТЬ
			                               |	ПриходнаяНакладнаяЗапасы.Ссылка.Дата КАК Период,
			                               |	ПриходнаяНакладнаяЗапасы.Ссылка.Организация КАК Организация,
			                               |	ПриходнаяНакладнаяЗапасы.Ссылка.Подразделение КАК СтруктурнаяЕдиница,
			                               |	ПриходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельности,
			                               |	ВЫБОР
			                               |		КОГДА ПриходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
			                               |				И ПриходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
			                               |			ТОГДА ПриходнаяНакладнаяЗапасы.Заказ
			                               |		КОГДА ПриходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
			                               |				И ПриходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
			                               |			ТОГДА ПриходнаяНакладнаяЗапасы.Заказ
			                               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
			                               |	КОНЕЦ КАК ЗаказПокупателя,
			                               |	ПриходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж КАК СчетУчета,
			                               |	СУММА(ПриходнаяНакладнаяЗапасы.СуммаНДС * ПриходнаяНакладнаяЗапасы.Ссылка.Курс / ПриходнаяНакладнаяЗапасы.Ссылка.Кратность) КАК СуммаДоходов,
			                               |	""Отражение доходов"" КАК СодержаниеПроводки
			                               |ИЗ
			                               |	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
			                               |ГДЕ
			                               |	ПриходнаяНакладнаяЗапасы.Ссылка.Ссылка = &Ссылка
			                               |
			                               |СГРУППИРОВАТЬ ПО
			                               |	ПриходнаяНакладнаяЗапасы.Ссылка.Организация,
			                               |	ПриходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности,
			                               |	ПриходнаяНакладнаяЗапасы.Ссылка.Подразделение,
			                               |	ПриходнаяНакладнаяЗапасы.Ссылка.Дата,
			                               |	ПриходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж,
			                               |	ВЫБОР
			                               |		КОГДА ПриходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПокупателя
			                               |				И ПриходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
			                               |			ТОГДА ПриходнаяНакладнаяЗапасы.Заказ
			                               |		КОГДА ПриходнаяНакладнаяЗапасы.Заказ ССЫЛКА Документ.ЗаказПоставщику
			                               |				И ПриходнаяНакладнаяЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
			                               |			ТОГДА ПриходнаяНакладнаяЗапасы.Заказ
			                               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
			                               |	КОНЕЦ";
			ЗапросПоТабличнойЧасти.УстановитьПараметр("Ссылка", ДокументСсылка);
			ВыборкаИзТабличнойЧасти = ЗапросПоТабличнойЧасти.Выполнить().Выбрать();
			Пока ВыборкаИзТабличнойЧасти.Следующий() Цикл
				Движение = Движения.ДоходыИРасходы.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, ВыборкаИзТабличнойЧасти);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		Сумм = 0;
		Для каждого ТС Из ДокументСсылка.Запасы Цикл
			Если ЗначениеЗаполнено(ТС.Номенклатура.АкцизныйКод) Тогда
				Сумм = Сумм + ТС.Номенклатура.АкцизныйКод.Ставка;
			КонецЕсли;
		КонецЦикла;
		Если Сумм > 0 Тогда
			Движения.ДоходыИРасходы.Записывать = Истина;
			Для каждого ТС Из ДокументСсылка.Запасы Цикл
				Если ЗначениеЗаполнено(ТС.Номенклатура.АкцизныйКод) Тогда
					Движение = Движения.ДоходыИРасходы.Добавить();
					Движение.Период = ДокументСсылка.Дата;
					Движение.Организация = ДокументСсылка.Организация;
					Движение.СтруктурнаяЕдиница = ДокументСсылка.СтруктурнаяЕдиница;
					Движение.НаправлениеДеятельности = ТС.Номенклатура.Подразделение;
					Заказ = Неопределено;
					Если ЗначениеЗаполнено(ДокументСсылка.Заказ) Тогда 
						Если ТипЗнч(ДокументСсылка.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
							Заказ = ДокументСсылка.Заказ;
						Иначе 
							Заказ = ДокументСсылка.Заказ.ЗаказПокупателя;
						КонецЕсли;	
					Иначе 	
						Если ТипЗнч(ТС.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
							Заказ = ТС.Заказ;
						Иначе 
							Заказ = ТС.Заказ.ЗаказПокупателя;
						КонецЕсли;
					КонецЕсли;
					Движение.СчетУчета = ТС.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж;
					Движение.СуммаДоходов = - 1 * ПолучитьСуммуВУчетнойВВалюте(ДокументСсылка.ВалютаДокумента, ДокументСсылка.Дата, ТС.Номенклатура.АкцизныйКод.Ставка, ДокументСсылка);
					Движение.СодержаниеПроводки = "Отражение доходов";
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю И ДокументСсылка.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
			Движения.ДоходыИРасходы.Записывать = Истина;
			Для каждого ТС Из ДокументСсылка.Запасы Цикл
				Движение = Движения.ДоходыИРасходы.Добавить();
				Движение.Период = ДокументСсылка.Дата;
				Движение.Организация = ДокументСсылка.Организация;
				Движение.СтруктурнаяЕдиница = ДокументСсылка.Подразделение;
				Движение.НаправлениеДеятельности = ТС.Номенклатура.НаправлениеДеятельности;
				Движение.ЗаказПокупателя = ДокументСсылка.Заказ;
				
				Заказ = Неопределено;
				Если ЗначениеЗаполнено(ДокументСсылка.Заказ) Тогда 
					Если ТипЗнч(ДокументСсылка.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
						Заказ = ДокументСсылка.Заказ;
					Иначе 
						Заказ = ДокументСсылка.Заказ.ЗаказПокупателя;
					КонецЕсли;	
				ИначеЕсли ЗначениеЗаполнено(ТС.Заказ) Тогда 	
					Если ТипЗнч(ТС.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
						Заказ = ТС.Заказ;
					Иначе 
						Заказ = ТС.Заказ.ЗаказПокупателя;
					КонецЕсли;
				КонецЕсли;	
				
				Движение.ЗаказПокупателя = Заказ;		
				Движение.СчетУчета = ТС.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж;
				Движение.СуммаДоходов = - 1 * ПолучитьСуммуВУчетнойВВалюте(ДокументСсылка.ВалютаДокумента, ДокументСсылка.Дата, ТС.СуммаНДС, ДокументСсылка);
				Движение.СодержаниеПроводки = "Отражение доходов";
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;



	
КонецПроцедуры	

Процедура ОПТИМУС_ПроведениеНДСНаСервере_ОтразитьЗапасы(ДокументСсылка, Движения, Отказ) Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда		
		Если ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика И ДокументСсылка.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
			Если ДокументСсылка.ВключатьРасходыВСебестоимость = Ложь Тогда
				Движения.Запасы.Записывать = Истина;
				Для каждого ТС Из ДокументСсылка.Запасы Цикл
					Движение = Движения.Запасы.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = ДокументСсылка.Дата;
					Движение.Организация = ДокументСсылка.Организация;
					Движение.СтруктурнаяЕдиница = ДокументСсылка.СтруктурнаяЕдиница;
					Движение.СчетУчета = ТС.Номенклатура.СчетУчетаЗапасов;
					Движение.Номенклатура = ТС.Номенклатура;
					Движение.Характеристика = ТС.Характеристика;
					Движение.Партия = ТС.Партия;
					Если ТипЗнч(ТС.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") 
						И Не ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя
						И Не (ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемВПереработку
						И Не Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить()) Тогда
						
						Движение.ЗаказПокупателя = ТС.Заказ;
						//Иначе
						//	Движение.ЗаказПокупателя = ТС.Заказ.ЗаказПокупателя;
					КонецЕсли;
					Движение.AzRyНаименованияПоставщиков = ТС.AzRyНаименованияПоставщиков;
					Движение.Количество = 0;
					Движение.Сумма = - 1 * ПолучитьСуммуВУчетнойВВалюте(ДокументСсылка.Договор.ВалютаРасчетов, ДокументСсылка.Дата, ТС.СуммаНДС, ДокументСсылка);
					Движение.ФиксированнаяСтоимость = Истина;
					Движение.ЗатратыНаВыпуск = Ложь;
					Движение.Возврат = Ложь;
					Движение.СодержаниеПроводки = "Оприходование запасов";
					Движение.ПеремещениеВРозницуСуммовойУчет = Ложь;
				КонецЦикла;
				Для каждого ТС Из ДокументСсылка.Расходы Цикл
					Если ТС.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство И ТС.Номенклатура.СчетУчетаЗатрат.ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
						Продолжить;
					КонецЕсли;
					Движение = Движения.Запасы.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = ДокументСсылка.Дата;
					Движение.Организация = ДокументСсылка.Организация;
					Движение.СтруктурнаяЕдиница = ?(ТС.СтруктурнаяЕдиница.Пустая(), ДокументСсылка.Подразделение, ТС.СтруктурнаяЕдиница);
					Движение.СчетУчета = ТС.Номенклатура.СчетУчетаЗатрат;
					Если ТипЗнч(ТС.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") 
						И Не ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя
						И Не (ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемВПереработку
						И Не Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить()) Тогда
						
						Движение.ЗаказПокупателя = ТС.Заказ;
						//Иначе
						//	Движение.ЗаказПокупателя = ТС.Заказ.ЗаказПокупателя;
					КонецЕсли;
					Движение.AzRyНаименованияПоставщиков = ТС.AzRyНаименованияПоставщиков;
					Движение.Количество = 0;
					Движение.Сумма = - 1 * ПолучитьСуммуВУчетнойВВалюте(ДокументСсылка.Договор.ВалютаРасчетов, ДокументСсылка.Дата, ТС.СуммаНДС, ДокументСсылка);
					Движение.ФиксированнаяСтоимость = Истина;
					Движение.ЗатратыНаВыпуск = Ложь;
					Движение.Возврат = Ложь;
					Движение.СодержаниеПроводки = "Отражение затрат";
					Движение.ПеремещениеВРозницуСуммовойУчет = Ложь;
				КонецЦикла;
			Иначе
				Движения.Запасы.Записывать = Истина;
				Для каждого ТС Из ДокументСсылка.Запасы Цикл
					Движение = Движения.Запасы.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = ДокументСсылка.Дата;
					Движение.Организация = ДокументСсылка.Организация;
					Движение.СтруктурнаяЕдиница = ДокументСсылка.СтруктурнаяЕдиница;
					Движение.СчетУчета = ТС.Номенклатура.СчетУчетаЗапасов;
					Движение.Номенклатура = ТС.Номенклатура;
					Движение.Характеристика = ТС.Характеристика;
					Движение.Партия = ТС.Партия;					
					Если ТипЗнч(ТС.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") 
						И Не ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя
						И Не (ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПриемВПереработку
						И Не Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить()) Тогда
						
						Движение.ЗаказПокупателя = ТС.Заказ;
						//Иначе
						//	Движение.ЗаказПокупателя = ТС.Заказ.ЗаказПокупателя;
					КонецЕсли;
					Движение.AzRyНаименованияПоставщиков = ТС.AzRyНаименованияПоставщиков;
					Движение.Количество = 0;
					Движение.Сумма = - 1 * ПолучитьСуммуВУчетнойВВалюте(ДокументСсылка.Договор.ВалютаРасчетов, ДокументСсылка.Дата, ТС.СуммаНДС, ДокументСсылка);
					Движение.ФиксированнаяСтоимость = Истина;
					Движение.ЗатратыНаВыпуск = Ложь;
					Движение.Возврат = Ложь;
					Движение.СодержаниеПроводки = "Оприходование запасов";
					Движение.ПеремещениеВРозницуСуммовойУчет = Ложь;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

Функция ПолучитьСуммуВУчетнойВВалюте(ВалютаОпераций, Период, Сумма, ДокументСсылка = Неопределено, Курс = Неопределено, Кратность = Неопределено)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Курс,
	               |	КурсыВалютСрезПоследних.Кратность
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
	               |ГДЕ
	               |	КурсыВалютСрезПоследних.Валюта = &ВалютаУчета";
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("Период", Период);
	Резултат = Запрос.Выполнить();
	Выборка = Резултат.Выбрать();
	КурсУчета = 0;
	КратностьУчета = 0;
	Если Выборка.Следующий() Тогда
		КурсУчета = Выборка.Курс;
		КратностьУчета = Выборка.Кратность;
	КонецЕсли;

	Если ДокументСсылка = Неопределено Тогда
		Если Курс = Неопределено И Кратность = Неопределено Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	КурсыВалютСрезПоследних.Курс,
			|	КурсыВалютСрезПоследних.Кратность
			|ИЗ
			|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
			|ГДЕ
			|	КурсыВалютСрезПоследних.Валюта = &ВалютаОп";
			Запрос.УстановитьПараметр("ВалютаОп", ВалютаОпераций);
			Запрос.УстановитьПараметр("Период", Период);
			Резултат = Запрос.Выполнить();
			Выборка = Резултат.Выбрать();
			КурсНац = 1;
			КратностьНац = 1;
			Если Выборка.Следующий() Тогда
				КурсО      = Выборка.Курс;
				КратностьО = Выборка.Кратность;
			КонецЕсли;
		Иначе 	
			КурсО      = Курс;
			КратностьО = Кратность;			
		КонецЕсли; 
	Иначе		
		Если Курс = Неопределено И Кратность = Неопределено Тогда
			КурсО      = ДокументСсылка.Курс;
			КратностьО = ДокументСсылка.Кратность;	
		Иначе 	
			КурсО      = Курс;
			КратностьО = Кратность;			
		КонецЕсли;
	КонецЕсли;

	Возврат Сумма * КурсО / КратностьО * КратностьУчета / КурсУчета;
КонецФункции

//////////////////////////////////////////////////////////////////////////////// 
// ФОРМА ВЫБОРА ДОКУМЕНТА ОТБОР

Процедура ФормаВыбораДокументаОтбор(Список, ПолеКомпоновкиДанных, ВидСравненияКД, Использование, ПравоеЗначение) Экспорт

	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеКомпоновкиДанных);
    ЭлементОтбора.ВидСравнения = ВидСравненияКД;
    ЭлементОтбора.Использование = Использование;
    ЭлементОтбора.ПравоеЗначение = ПравоеЗначение;

КонецПроцедуры
 
//////////////////////////////////////////////////////////////////////////////// 
// Спецификации

Функция СебестоимостьСпецификаций(МассивНоменклатур) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЗапасыОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
		|			ТОГДА NULL
		|		ИНАЧЕ ЗапасыОстаткиИОбороты.Регистратор
		|	КОНЕЦ КАК Регистратор,
		|	ЗапасыОстаткиИОбороты.ПериодСекунда,
		|	ЗапасыОстаткиИОбороты.ПериодМинута,
		|	ЗапасыОстаткиИОбороты.ПериодЧас,
		|	ЗапасыОстаткиИОбороты.ПериодДень,
		|	ЗапасыОстаткиИОбороты.ПериодНеделя,
		|	ЗапасыОстаткиИОбороты.ПериодДекада,
		|	ЗапасыОстаткиИОбороты.ПериодМесяц,
		|	ЗапасыОстаткиИОбороты.ПериодКвартал,
		|	ЗапасыОстаткиИОбороты.ПериодПолугодие,
		|	ЗапасыОстаткиИОбороты.ПериодГод,
		|	ЗапасыОстаткиИОбороты.Организация,
		|	ЗапасыОстаткиИОбороты.СтруктурнаяЕдиница,
		|	ЗапасыОстаткиИОбороты.СчетУчета,
		|	ЗапасыОстаткиИОбороты.Номенклатура,
		|	ЗапасыОстаткиИОбороты.Характеристика,
		|	ЗапасыОстаткиИОбороты.Партия,
		|	ЗапасыОстаткиИОбороты.ЗаказПокупателя,
		|	ЗапасыОстаткиИОбороты.КоличествоНачальныйОстаток,
		|	ЗапасыОстаткиИОбороты.КоличествоКонечныйОстаток,
		|	ЗапасыОстаткиИОбороты.КоличествоОборот,
		|	ЗапасыОстаткиИОбороты.КоличествоПриход,
		|	ЗапасыОстаткиИОбороты.КоличествоРасход,
		|	ЗапасыОстаткиИОбороты.СуммаНачальныйОстаток,
		|	ЗапасыОстаткиИОбороты.СуммаКонечныйОстаток,
		|	ЗапасыОстаткиИОбороты.СуммаОборот,
		|	ЗапасыОстаткиИОбороты.СуммаПриход,
		|	ЗапасыОстаткиИОбороты.СуммаРасход,
		|	ЗапасыОстаткиИОбороты.Номенклатура.ЕдиницаИзмерения
		|ИЗ
		|	РегистрНакопления.Запасы.ОстаткиИОбороты(, , Авто, Движения, СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Запасы)) КАК ЗапасыОстаткиИОбороты
		|ГДЕ
		|	ЗапасыОстаткиИОбороты.Номенклатура В(&МассивНоменклатур)";

	Запрос.УстановитьПараметр("МассивНоменклатур", МассивНоменклатур);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;

КонецФункции

//////////////////////////////////////////////////////////////////////////////// 
// Штрихкоды-Utils

Функция ЗапросШтрихкодыПоНоменклатуре(МассивНоменклатуры) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика,
		|	ШтрихкодыНоменклатуры.Партия,
		|	ШтрихкодыНоменклатуры.ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПолучитьШтрихкодыВОднойСтроке(Строки, Колонка) Экспорт
	
	Штрихкод = "";
	Для Ч=0 По Строки.Количество()-1 Цикл
		Префкс = ?(Ч+1 = Строки.Количество(), "", ",  ");
		Штрихкод = Штрихкод + Строки[Ч][Колонка] + Префкс;
	КонецЦикла;
	
	Возврат Штрихкод;
	
КонецФункции	

//////////////////////////////////////////////////////////////////////////////// 
// Utils

Функция ПолучитьЗаказ(ТЗ) Экспорт

	Ответ = Неопределено;
	
	Для каждого ТекСтрока Из ТЗ Цикл
	
		Если ЗначениеЗаполнено(ТекСтрока.Заказ) Тогда 
			Ответ = ТекСтрока.Заказ;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции 
 
Функция ПолучитьНастройкиПользователя(Пользователь, Настройка) Экспорт
	
	Значение = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь
		|	И НастройкиПользователей.Настройка = &Настройка";
	
	Запрос.УстановитьПараметр("Настройка", Настройка);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Значение = ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
	Возврат Значение;

КонецФункции

Функция ЗапросФаилыПоНоменклатуре(ТЗНоменклатуры) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗН1.Номенклатура
		|ПОМЕСТИТЬ ТЗН1
		|ИЗ
		|	&ТЗН1 КАК ТЗН1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФайлыAzRyТегКартинки.Ссылка,
		|	ФайлыAzRyТегКартинки.НомерСтроки,
		|	ФайлыAzRyТегКартинки.Тег,
		|	ФайлыAzRyТегКартинки.Ссылка.ВладелецФайла,
		|	ТЗН1.Номенклатура
		|ИЗ
		|	Справочник.Файлы.AzRyТегКартинки КАК ФайлыAzRyТегКартинки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗН1 КАК ТЗН1
		|		ПО ТЗН1.Номенклатура = ФайлыAzRyТегКартинки.Ссылка.ВладелецФайла
		|ГДЕ
		|	ФайлыAzRyТегКартинки.Ссылка.ВладелецФайла В(&ВладелецФайла)
		|	И ФайлыAzRyТегКартинки.Ссылка.ТекущаяВерсияРасширение В(&ТекущаяВерсияРасширение)";
	
	Запрос.УстановитьПараметр("ВладелецФайла", ТЗНоменклатуры.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ТекущаяВерсияРасширение", Обработки.AzRyEcommerceConsole.Создать().МассивРасширенияКартинок);
	Запрос.УстановитьПараметр("ТЗН1", ТЗНоменклатуры);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ЗапросНоменклатурыПоКоду(Код) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.Код
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Код В(&Код)";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЗапросНоменклатурыПоШтрихкоду(Штрихкод) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика,
		|	ШтрихкодыНоменклатуры.Партия,
		|	ШтрихкодыНоменклатуры.ЕдиницаИзмерения,
		|	ШтрихкодыНоменклатуры.AzRyНоменклатура,
		|	ШтрихкодыНоменклатуры.AzRyСтрана,
		|	ШтрихкодыНоменклатуры.AzRyЗарезервировано,
		|	ШтрихкодыНоменклатуры.AzRyМодель,
		|	ШтрихкодыНоменклатуры.AzRyКатегория,
		|	ШтрихкодыНоменклатуры.AzRyБренд,
		|	ШтрихкодыНоменклатуры.AzRyПродукт,
		|	ШтрихкодыНоменклатуры.AzRyКонтрольноеЧисло
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод В(&Штрихкод)";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЗапросХарактеристикиПоКоду(Код) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Код,
		|	ХарактеристикиНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Код В(&Код)";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЗапросПартииПоКоду(Код) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартииНоменклатуры.Код,
		|	ПартииНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
		|ГДЕ
		|	ПартииНоменклатуры.Код В(&Код)";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЗапросПартииПоНаименованиюИВладелец(Наименование) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартииНоменклатуры.Ссылка,
		|	ПартииНоменклатуры.Владелец,
		|	ПартииНоменклатуры.Владелец.Код,
		|	ПартииНоменклатуры.Наименование
		|ИЗ
		|	Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
		|ГДЕ
		|	ПартииНоменклатуры.Наименование В(&Наименование)";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЗапросЕдиницыИзмеренияПоНаименованию(Наименование) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторЕдиницИзмерения.Код,
		|	КлассификаторЕдиницИзмерения.Ссылка,
		|	КлассификаторЕдиницИзмерения.Наименование
		|ИЗ
		|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
		|ГДЕ
		|	КлассификаторЕдиницИзмерения.Наименование В(&Наименование)";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЗапросСтавкиНДСПоНаименованию(Наименование) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка,
		|	СтавкиНДС.Наименование
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Наименование В(&Наименование)";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция НайтиСтруктурнаяЕдиницаВДокументе(Документ) Экспорт
	
	ОП_СборкаЗапасов              = Новый ОписаниеТипов("ДокументСсылка.СборкаЗапасов");
	ОП_ЗаказПокупателя_ЗаказНаряд = Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя");
	ОП                            = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");
	
	Для каждого ТекСтрока Из Документ.Метаданные().Реквизиты Цикл
		
		Если Тип("ДокументСсылка.СборкаЗапасов") = ТипЗнч(Документ) Тогда
			Если ТекСтрока.Тип = ОП И ТекСтрока.Имя = "СтруктурнаяЕдиницаЗапасов" Тогда
				Возврат Документ[ТекСтрока.Имя];
			КонецЕсли;		
		ИначеЕсли Тип("ДокументСсылка.ЗаказПокупателя") = ТипЗнч(Документ) И Документ.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда 	
			Если ТекСтрока.Тип = ОП И ТекСтрока.Имя = "СтруктурнаяЕдиницаРезерв" Тогда
				Возврат Документ[ТекСтрока.Имя];
			КонецЕсли;			
		Иначе 	
			Если ТекСтрока.Тип = ОП И ТекСтрока.Имя <> "Подразделение" Тогда 		
				Возврат Документ[ТекСтрока.Имя];
			КонецЕсли;
		КонецЕсли;  
	КонецЦикла;
	
	Возврат Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	
КонецФункции

Функция РазницаДатВМесяцах(Дата1, Дата2) Экспорт 
	
	ДатаНач	= ?(Дата1 < Дата2, Дата1, Дата2); 
	ДатаКон	= ?(Дата1 < Дата2, Дата2, Дата1); 
	Годы = Год( датаКон ) - Год( датаНач ); 
	Месяцы = Месяц( датаКон ) - Месяц( датаНач ); 
	Разность = месяцы + годы * 12; 
	
	Возврат Разность; 
	
КонецФункции

// Процедура вычисляет количество лет, месяцев и дней между двумя датами
//
// Параметры
//  Дата1    – дата, первая дата (более поздняя, часто текущая, стаж определяется по состоянию на эту дату)
//  Дата2    – дата, вторая дата (ранняя дата, с нее начинается "течение" стажа)
//  Лет        – Число, в этот параметр будет записано кол-во лет между двумя датами (Дата1-Дата2)
//  Месяцев    – Число, в этот параметр будет записано кол-во месяцев между двумя датами (Дата1-Дата2)
//  Дней    – Число, в этот параметр будет записано кол-во дней между двумя датами (Дата1-Дата2)
//
Процедура РазобратьРазностьДат(Дата1, Дата2, Лет = 0, Месяцев = 0, Дней = 0) Экспорт

    

    Лет        = 0;

    Месяцев    = 0;

    Дней    = 0;

    Если Дата1 > Дата2 Тогда

        

        ВременнаяДата = Дата1;

        Если День(ВременнаяДата) < День(Дата2) Тогда

            Дней = (ВременнаяДата - ДобавитьМесяц(ВременнаяДата,-1))/86400;

            ВременнаяДата = ДобавитьМесяц(ВременнаяДата,-1);

        КонецЕсли;

        Если Месяц(ВременнаяДата) < Месяц(Дата2) Тогда

            ВременнаяДата = ДобавитьМесяц(ВременнаяДата,-12);

            Месяцев = 12;

        КонецЕсли;

        Лет        = Макс(             Год(ВременнаяДата)        - Год(Дата2),    0);

        Месяцев    = Макс(Месяцев    + Месяц(ВременнаяДата)    - Месяц(Дата2),    0);

        Дней    = Макс(Дней        + День(ВременнаяДата)    - День(Дата2),    0);

        

        // скорректируем отображаемое значение, если "вмешалось" разное количество дней в месяцах

        Если Дата2 <> (ДобавитьМесяц(Дата1,-Лет*12-Месяцев)-Дней*86400) Тогда

            Дней = Дней + (День(КонецМесяца(Дата2)) - День(НачалоМесяца(Дата2))) - (День(КонецМесяца(ДобавитьМесяц(Дата1,-1))) - День(НачалоМесяца(ДобавитьМесяц(Дата1,-1))));

        КонецЕсли;

        

    КонецЕсли;



КонецПроцедуры    // РазобратьРазностьДат

//////////////////////////////////////////////////////////////////////////////// 
// ЧекККМ - Utils

Функция ОбновитьСостояниеКассовойСмены(ТекущаяКассоваяСмена) Экспорт

	СостояниеКассовойСмены = "";
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСменыНаСервере(ТекущаяКассоваяСмена);
	Если ЗначениеЗаполнено(СтруктураСостояниеКассовойСмены.СтатусКассовойСмены) Тогда
		
		ТекстСообщения = НСтр("ru='Смена № %НомерСмены%, Статус: %СтатусСмены% %ВремяИзменения%, В кассе %НаличностьВКассе% %Валюта%';ka='ცვლა № %НомерСмены%, სტატუსი: %СтатусСмены% %ВремяИзменения%, სალაროში %НаличностьВКассе% %Валюта%'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСмены%", СокрЛП(СтруктураСостояниеКассовойСмены.НомерКассовойСмены));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СтатусСмены%", СтруктураСостояниеКассовойСмены.СтатусКассовойСмены);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НаличностьВКассе%", СтруктураСостояниеКассовойСмены.НаличностьВКассе);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Валюта%", СтруктураСостояниеКассовойСмены.ВалютаДокументаПредставление);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВремяИзменения%", Формат(СтруктураСостояниеКассовойСмены.ДатаИзмененияСтатуса,"ДФ='dd.MM.yy ЧЧ:мм'"));
		
		СостояниеКассовойСмены = ТекстСообщения;
		
	Иначе
		
		СостояниеКассовойСмены = НСтр("ru='Смена не открыта.';ka='ცვლა არ არის გახსნილი.'");
		
	КонецЕсли;		
	
	Возврат СостояниеКассовойСмены;

КонецФункции

Функция ПолучитьСостояниеКассовойСменыНаСервере(ТекущаяКассоваяСмена)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СУММА(ЧекККМ.СуммаДокумента) КАК НаличностьВКассе
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.Архивный = ЛОЖЬ
	|	И ЧекККМ.КассоваяСмена = &КассоваяСмена";
	
	Запрос.УстановитьПараметр("КассоваяСмена", ТекущаяКассоваяСмена);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОписаниеКассовойСмены = ПолучитьСтруктуруОписанияКассовойСмены();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОписаниеКассовойСмены, Выборка);
	КонецЕсли;
	ОписаниеКассовойСмены.СтатусКассовойСмены = ТекущаяКассоваяСмена.СтатусКассовойСмены;
	ОписаниеКассовойСмены.НомерКассовойСмены = ТекущаяКассоваяСмена.Номер;
	
	Возврат ОписаниеКассовойСмены;

КонецФункции

Функция ПолучитьСтруктуруОписанияКассовойСмены()
	
	СостояниеКассовойСмены = Новый Структура;
	СостояниеКассовойСмены.Вставить("ДатаИзмененияСтатуса");
	СостояниеКассовойСмены.Вставить("СтатусКассовойСмены");
	СостояниеКассовойСмены.Вставить("КассоваяСмена");
	СостояниеКассовойСмены.Вставить("НаличностьВКассе");
	СостояниеКассовойСмены.Вставить("НомерКассовойСмены");
	СостояниеКассовойСмены.Вставить("СменаОткрыта", Ложь);
	
	// Описание реквизитов кассовой смены
	СостояниеКассовойСмены.Вставить("КассаККМ");
	СостояниеКассовойСмены.Вставить("ВалютаДокумента");
	СостояниеКассовойСмены.Вставить("ВалютаДокументаПредставление");
	СостояниеКассовойСмены.Вставить("ВидЦен");
	СостояниеКассовойСмены.Вставить("Организация");
	СостояниеКассовойСмены.Вставить("Ответственный");
	СостояниеКассовойСмены.Вставить("Подразделение");
	СостояниеКассовойСмены.Вставить("СтруктурнаяЕдиница");
	СостояниеКассовойСмены.Вставить("СуммаВключаетНДС");
	СостояниеКассовойСмены.Вставить("НДСВключатьВСтоимость");
	СостояниеКассовойСмены.Вставить("НалогообложениеНДС");
	
	Возврат СостояниеКассовойСмены;
	
КонецФункции
 
//////////////////////////////////////////////////////////////////////////////// 
// Картинка - Utils

Функция AzRyСоздатьThumbnailФайлНаСервере(Док) Экспорт
	
	ХранимыйФайл = Обработки.AzRyEcommerceConsole.Создать().ПолучитьХранимыеФайлыВерсий(Док);
	
	ИМФ = ПолучитьИмяВременногоФайла(Док.ТекущаяВерсияРасширение);
	ИМФ2 = ПолучитьИмяВременногоФайла(Док.ТекущаяВерсияРасширение);
	
	Картинка = Новый Картинка(ХранимыйФайл.Получить());
	Картинка.Записать(ИМФ);
	Картинка.Записать(ИМФ2);
	
	Файл = Новый Файл(ИМФ2);
	
	ИмяФайла = ИМФ;
	GFLAx = Новый COMОбъект("GFLAx.GFLAx");
	GFLAx.LoadBitmap(ИмяФайла);
	ШиринаИзо = GFLAx.Width;
	ВысотаИзо = GFLAx.Height;
	Если ШиринаИзо>ВысотаИзо Тогда
		Делитель=ШиринаИзо/192;
	Иначе
		Делитель=ВысотаИзо/192;    
	КонецЕсли;
	Делитель = ?(0,1,Делитель);
	ШиринаИзо = ШиринаИзо/Делитель;
	ВысотаИзо = ВысотаИзо/Делитель;
	GFLAx.Resize(Цел(ШиринаИзо),Цел(ВысотаИзо));
	
	НовИмя = Файл.Путь + Док.Наименование + "_ThumbNail." + Док.ТекущаяВерсияРасширение;
	
	GFLAx.SaveBitmap(НовИмя);   
	
	Двоичное = Новый ДвоичныеДанные(НовИмя);
	Адрес = ПоместитьВоВременноеХранилище(Двоичное);
	
	Стр = Новый Структура;
	Стр.Вставить("Адрес", Адрес);
	Стр.Вставить("ТекущаяВерсияРасширение", Док.ТекущаяВерсияРасширение);
	Стр.Вставить("ИмяФайла", Док.Наименование + "_ThumbNail." + Док.ТекущаяВерсияРасширение);
	Стр.Вставить("Путь", Файл.Путь);
	
	Возврат Стр;
	
КонецФункции

Процедура ИзменитьСтатусКартинки(Файл, AzRyВидыКатинкиДляПрайсЛиста) Экспорт

	О = Файл.ПолучитьОбъект();
	О.AzRyВидыКатинкиДляПрайсЛиста = ?(AzRyВидыКатинкиДляПрайсЛиста = 0, Перечисления.AzRyВидыКатинкиДляПрайсЛиста.РеальныйРазмер, Перечисления.AzRyВидыКатинкиДляПрайсЛиста.Thumbnail);
	О.Записать();

КонецПроцедуры

Функция ДобавитьАвтоматическийThumbnailПриСозданийКартинки() Экспорт

	Возврат ?(Справочники.AzRyНастройки.ДобавитьАвтоматическийThumbnailПриСозданийКартинки.Значение = Неопределено, Ложь, Справочники.AzRyНастройки.ДобавитьАвтоматическийThumbnailПриСозданийКартинки.Значение);

КонецФункции

Процедура УстановитьThumbnailККартинке(Картинка, Thumbnail) Экспорт

	О = Картинка.ПолучитьОбъект();
	О.AzRyThumbnail = Thumbnail;
	О.Записать();
	
КонецПроцедуры

Функция ПроверитьФайлКартинка(Расширение) Экспорт

	МассивРасширенияКартинок = Обработки.AzRyEcommerceConsole.Создать().МассивРасширенияКартинок;
	
	ЭтаКартинка = Ложь;
	Для каждого ТекСтрока Из МассивРасширенияКартинок Цикл
		Если "." + ТекСтрока = НРег(Расширение) Тогда
			ЭтаКартинка = Истина;	
		КонецЕсли; 
	КонецЦикла;

	Возврат ЭтаКартинка;
	
КонецФункции
 

//////////////////////////////////////////////////////////////////////////////// 
// РасходСоСчета - ვირტ. ცხრილის დაშლა

Процедура РасходСоСчета_ВременнаяТаблицаКурсовыхРазницДенежныеСредства(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;	
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("РасходДенежныхСредств", НСтр("ru='Расход денежных средств';ka='ფულადი სახსრების დანახარჯი'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ru='Курсовая разница';ka='სხვაობა კურსებს შორის'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДенежныеСредстваОстатки.Организация КАК Организация,
	|	ДенежныеСредстваОстатки.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ДенежныеСредстваОстатки.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ДенежныеСредстваОстатки.Валюта КАК Валюта,
	|	ДенежныеСредстваОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ДенежныеСредстваОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ДенежныеСредстваОстатки.Поле1
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДенежныеСредстваОстатки.Организация КАК Организация,
	|		ДенежныеСредстваОстатки.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|		ДенежныеСредстваОстатки.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|		ДенежныеСредстваОстатки.Валюта КАК Валюта,
	|		ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|		ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
	|		""1"" КАК Поле1
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредства.Остатки(
	|				&МоментВремени,
	|				(Организация, ТипДенежныхСредств, БанковскийСчетКасса, Валюта) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВременнаяТаблицаДенежныеСредства.Организация,
	|						ВременнаяТаблицаДенежныеСредства.ТипДенежныхСредств,
	|						ВременнаяТаблицаДенежныеСредства.БанковскийСчетКасса,
	|						ВременнаяТаблицаДенежныеСредства.Валюта
	|					ИЗ
	|						ВременнаяТаблицаДенежныеСредства)) КАК ДенежныеСредстваОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаДенежныеСредства.Организация,
	|		ДвиженияДокументаДенежныеСредства.ТипДенежныхСредств,
	|		ДвиженияДокументаДенежныеСредства.БанковскийСчетКасса,
	|		ДвиженияДокументаДенежныеСредства.Валюта,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаДенежныеСредства.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаДенежныеСредства.Сумма, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаДенежныеСредства.СуммаВал, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаДенежныеСредства.СуммаВал, 0)
	|		КОНЕЦ,
	|		""2""
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредства КАК ДвиженияДокументаДенежныеСредства
	|	ГДЕ
	|		ДвиженияДокументаДенежныеСредства.Регистратор = &Ссылка
	|		И ДвиженияДокументаДенежныеСредства.Период <= &ПериодКонтроля) КАК ДенежныеСредстваОстатки";
	
	МассивРезультатов = Запрос.Выполнить().Выгрузить();
	//T = МассивРезультатов.Выгрузить();
	
	СуммаВалОстаток = МассивРезультатов[0].СуммаВалОстаток;
	СуммаОстаток    = МассивРезультатов[0].СуммаОстаток;
	
	// ---------------------------------
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;	
	
	Запрос.УстановитьПараметр("Организация", МассивРезультатов[0].Организация);
	Запрос.УстановитьПараметр("ТипДенежныхСредств", МассивРезультатов[0].ТипДенежныхСредств);
	Запрос.УстановитьПараметр("БанковскийСчетКасса", МассивРезультатов[0].БанковскийСчетКасса);
	Запрос.УстановитьПараметр("Валюта", МассивРезультатов[0].Валюта);
	Запрос.УстановитьПараметр("Период", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДенежныеСредства.Организация КАК Организация,
	|	ДенежныеСредства.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Регистратор КАК Регистратор,
	|	ДенежныеСредства.НомерСтроки КАК НомерСтроки,
	|	ДенежныеСредства.Активность КАК Активность,
	|	ДенежныеСредства.ВидДвижения КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -ЕСТЬNULL(ДенежныеСредства.Сумма, 0)
	|		ИНАЧЕ ЕСТЬNULL(ДенежныеСредства.Сумма, 0)
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -ЕСТЬNULL(ДенежныеСредства.СуммаВал, 0)
	|		ИНАЧЕ ЕСТЬNULL(ДенежныеСредства.СуммаВал, 0)
	|	КОНЕЦ КАК СуммаВал,
	|	ДенежныеСредства.СодержаниеПроводки КАК СодержаниеПроводки,
	|	ДенежныеСредства.Статья КАК Статья
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	|ГДЕ
	|	ДенежныеСредства.Организация = &Организация
	|	И ДенежныеСредства.ТипДенежныхСредств = &ТипДенежныхСредств
	|	И ДенежныеСредства.БанковскийСчетКасса = &БанковскийСчетКасса
	|	И ДенежныеСредства.Валюта = &Валюта
	|	И ДенежныеСредства.Период <= &Период";
	
	МассивРезультатов22 = Запрос.Выполнить().Выгрузить();

	
	
	// ---------------------------------
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("РасходДенежныхСредств", НСтр("ru='Расход денежных средств';ka='ფულადი სახსრების დანახარჯი'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ru='Курсовая разница';ka='სხვაობა კურსებს შორის'"));
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВременнаяТаблицаДенежныеСредства.Сумма) КАК Сумма,
	               |	СУММА(ВременнаяТаблицаДенежныеСредства.СуммаВал) КАК СуммаВал
	               |ИЗ
	               |	ВременнаяТаблицаДенежныеСредства КАК ВременнаяТаблицаДенежныеСредства";
				   
	СуммыДокумента = Запрос.Выполнить().Выгрузить();
	
	СуммаВал = СуммыДокумента[0].СуммаВал;
	Сумма    = СуммыДокумента[0].Сумма;
	
	// ---------------------------------
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("РасходДенежныхСредств", НСтр("ru='Расход денежных средств';ka='ფულადი სახსრების დანახარჯი'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ru='Курсовая разница';ka='სხვაობა კურსებს შორის'"));

	Запрос.Текст = "ВЫБРАТЬ
	               |	КурсыВалютБанковскийСчетКассаСрезПоследних.Период,
	               |	КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта,
	               |	КурсыВалютБанковскийСчетКассаСрезПоследних.Курс,
	               |	КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(
	               |			&МоментВремени,
	               |			Валюта В
	               |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |					ВременнаяТаблицаДенежныеСредства.Валюта
	               |				ИЗ
	               |					ВременнаяТаблицаДенежныеСредства)) КАК КурсыВалютБанковскийСчетКассаСрезПоследних";
				   
	КурсыВалютБанковскийСчетКассаСрезПоследних = Запрос.Выполнить().Выгрузить();
	
	КурсыВалютБанковскийСчетКассаСрезПоследних_Курс = КурсыВалютБанковскийСчетКассаСрезПоследних[0].Курс;
	КурсыВалютБанковскийСчетКассаСрезПоследних_Кратность = КурсыВалютБанковскийСчетКассаСрезПоследних[0].Кратность;
	
	
	// ---------------------------------
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходСоСчета);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("РасходДенежныхСредств", НСтр("ru='Расход денежных средств';ka='ფულადი სახსრების დანახარჯი'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ru='Курсовая разница';ka='სხვაობა კურსებს შორის'"));

	Запрос.Текст = "ВЫБРАТЬ
	               |	КурсыВалютУчетаСрезПоследних.Период,
	               |	КурсыВалютУчетаСрезПоследних.Валюта,
	               |	КурсыВалютУчетаСрезПоследних.Курс,
	               |	КурсыВалютУчетаСрезПоследних.Кратность
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(
	               |			&МоментВремени,
	               |			Валюта В
	               |				(ВЫБРАТЬ
	               |					Константы.ВалютаУчета
	               |				ИЗ
	               |					Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних";
				   
	КурсыВалютУчетаСрезПоследних = Запрос.Выполнить().Выгрузить();
	
	КурсыВалютУчетаСрезПоследних_Курс = КурсыВалютУчетаСрезПоследних[0].Курс;
	КурсыВалютУчетаСрезПоследних_Кратность = КурсыВалютУчетаСрезПоследних[0].Кратность;
	
	A = (СуммаВалОстаток - СуммаВал) * КурсыВалютБанковскийСчетКассаСрезПоследних_Курс * КурсыВалютУчетаСрезПоследних_Кратность 
	
	/ (КурсыВалютУчетаСрезПоследних_Курс * КурсыВалютБанковскийСчетКассаСрезПоследних_Кратность) 
	
	- (СуммаОстаток - Сумма);	
	
КонецПроцедуры

Процедура AzRyПриКопированийДокументаПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя") ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда 
		Источник.AzRyАванс = Ложь;
	КонецЕсли;
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////// 
// АмортизацияВА - 

Процедура АмортизацияВА(Запрос, СтруктураДополнительныеСвойства, Объект) Экспорт 
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.АмортизацияВА") Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	ТаблицаРасчетаАмортизации КАК ТаблицаДокумента";
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока Из РезультатЗапроса Цикл
			Если ТекСтрока.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка Тогда
				Если ТекСтрока.Амортизация_old = 0 Тогда		
					ТекСтрока.Продолжить = Ложь;
				Иначе 	
					ГодАморт = Год(ТекСтрока.Период) - Год(ТекСтрока.ДатаПринятия2);
					БалансоваяСтоимостьГодовая = 0;
					БалансоваяСтоимостьГодоваяСумма = 0;
					ВсегоОсталосьСписать = ТекСтрока.СтоимостьДляВычисленияАмортизации;
					Ств = Новый Соответствие;
					Для Ч = 1 По ГодАморт+1 Цикл
						ДатаФормулы = ?(Ч = 1, ТекСтрока.ДатаПринятия2, ТекСтрока.Период);
						КолДнейВГодуСначалоПриема = ?(Ч = 1, (НачалоДня(КонецГода((ДатаФормулы))+1) - НачалоДня(ДатаФормулы)) / (60 * 60 * 24), 365);
						БалансоваяСтоимостьГодовая = (ВсегоОсталосьСписать / 100 * ТекСтрока.ПроцентАмортизацииДляВычисленияАмортизации) / 365 * КолДнейВГодуСначалоПриема;
						БалансоваяСтоимостьГодоваяСумма = БалансоваяСтоимостьГодоваяСумма + БалансоваяСтоимостьГодовая; 
						ВсегоОсталосьСписатьДо = ВсегоОсталосьСписать;
						ВсегоОсталосьСписать = (ВсегоОсталосьСписать - БалансоваяСтоимостьГодовая);
						Стр = Новый Структура;
						Стр.Вставить("БалансоваяСтоимостьГодовая", БалансоваяСтоимостьГодовая);
						Стр.Вставить("БалансоваяСтоимостьГодоваяСумма", БалансоваяСтоимостьГодоваяСумма);
						Стр.Вставить("ВсегоОсталосьСписать", ВсегоОсталосьСписатьДо);
						Ств.Вставить(Ч, Стр);
					КонецЦикла;
					
					Если ТекСтрока.ПоследныйМесяц Тогда
						ТекСтрока.Амортизация = ТекСтрока.БалансоваяСтоимость - ТекСтрока.АмортизацияКонечныйОстаток;	
					Иначе			
						//Если Месяц(ТекСтрока.Период) = 12 Тогда // 12 - ე თვე
						//	ТекСтрока.Амортизация = БалансоваяСтоимостьГодовая - (ТекСтрока.АмортизацияКонечныйОстаток - ?(Ств[ГодАморт] = Неопределено, 0, Ств[ГодАморт].БалансоваяСтоимостьГодовая));
						//Иначе
						Если НачалоМесяца(ТекСтрока.ДатаПринятия2) = НачалоМесяца(ТекСтрока.Период) Тогда
							КоличествоДнейВМесяц = Число(Сред(КонецМесяца(ТекСтрока.ДатаПринятия2), 1, 2));
							ТекДень              = День(ТекСтрока.ДатаПринятия2)-1;
							КолДны               = КоличествоДнейВМесяц - ТекДень;
							//ТекСтрока.Амортизация = Окр((БалансоваяСтоимостьГодовая / 12) / КоличествоДнейВМесяц, 2) * КолДны;
							ТекСтрока.Амортизация = (ТекСтрока.БалансоваяСтоимость / 100 * ТекСтрока.ПроцентАмортизацииДляВычисленияАмортизации) / 365 * КолДны;
						Иначе
							КоличествоДнейВМесяц = Число(Сред(КонецМесяца(ТекСтрока.Период), 1, 2));
							ТекСтрока.Амортизация = (Ств[ГодАморт+1].ВсегоОсталосьСписать / 100 * ТекСтрока.ПроцентАмортизацииДляВычисленияАмортизации) / 365 * КоличествоДнейВМесяц;
						КонецЕсли;
						//КонецЕсли;
					КонецЕсли;			
				КонецЕсли; 			 
			ИначеЕсли ТекСтрока.СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.Линейный Тогда
				Если ТекСтрока.Амортизация_old = 0 Тогда		
					ТекСтрока.Продолжить = Ложь;
				Иначе 	
					Амортизация = 1 / ТекСтрока.СрокИспользованияДляВычисленияАмортизации * ТекСтрока.СтоимостьДляВычисленияАмортизации;
					Если НачалоМесяца(ТекСтрока.ДатаПринятия2) = НачалоМесяца(ТекСтрока.Период) Тогда
						КоличествоДнейВМесяц = Число(Сред(КонецМесяца(ТекСтрока.ДатаПринятия2), 1, 2));
						ТекДень              = День(ТекСтрока.ДатаПринятия2)-1;
						КолДны               = КоличествоДнейВМесяц - ТекДень;
						
						ТекСтрока.Амортизация = Амортизация / КоличествоДнейВМесяц * КолДны;
					ИначеЕсли ТекСтрока.ПоследныйМесяц Тогда 
						ТекСтрока.Амортизация = ТекСтрока.ВсегоОсталосьСписать;
					Иначе 	
						ТекСтрока.Амортизация = Амортизация;	
					КонецЕсли;					
				КонецЕсли;	 	
			КонецЕсли; 
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.Текст =
		"
		| УНИЧТОЖИТЬ ТаблицаРасчетаАмортизации;
		|
		|//////////////////////////////////////////////
		|
		|ВЫБРАТЬ  *
		|ПОМЕСТИТЬ ТаблицаРасчетаАмортизации
		|ИЗ
		|&Таблица КАК Таблица";
		
		Запрос.УстановитьПараметр("Таблица", РезультатЗапроса);	
		Запрос.Выполнить();
		
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПередачаВА") Или ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.СписаниеВА") Тогда
		
		// 1
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияВнеоборотныхАктивовСрезПоследних.AzRyСпособАмортизации,
		|	СостоянияВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив,
		|	ПараметрыВнеоборотныхАктивовСрезПоследних.ПроцентАмортизации
		|ИЗ
		|	РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(&Дата, ВнеоборотныйАктив В (&СписокЗначений)) КАК СостоянияВнеоборотныхАктивовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних КАК ПараметрыВнеоборотныхАктивовСрезПоследних
		|		ПО СостоянияВнеоборотныхАктивовСрезПоследних.Организация = ПараметрыВнеоборотныхАктивовСрезПоследних.Организация
		|			И СостоянияВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив = ПараметрыВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив
		|ГДЕ
		|	СостоянияВнеоборотныхАктивовСрезПоследних.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостоянияВнеоборотныхАктивовСрезПервых.AzRyСпособАмортизации,
		|	СостоянияВнеоборотныхАктивовСрезПервых.ВнеоборотныйАктив,
		|	СостоянияВнеоборотныхАктивовСрезПервых.Период
		|ИЗ
		|	РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПервых(, ВнеоборотныйАктив В (&СписокЗначений)) КАК СостоянияВнеоборотныхАктивовСрезПервых";
		
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("СписокЗначений", СтруктураДополнительныеСвойства.ВыгрузитьКолонку("ВнеоборотныйАктив"));
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();		
		РезультатЗапроса1 = МассивРезультатов[0].Выгрузить();
		РезультатЗапроса2 = МассивРезультатов[1].Выгрузить();
				
		// 2
		Для каждого ТекСтрока Из СтруктураДополнительныеСвойства Цикл		
			НайденнаяСтрока = РезультатЗапроса1.Найти(ТекСтрока.ВнеоборотныйАктив, "ВнеоборотныйАктив");
			Если НайденнаяСтрока <> Неопределено И НайденнаяСтрока.AzRyСпособАмортизации = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка Тогда
				
				НайденнаяСтрока2 = РезультатЗапроса2.Найти(ТекСтрока.ВнеоборотныйАктив, "ВнеоборотныйАктив");
				
				ГодАморт = Год(Объект.Дата) - Год(НайденнаяСтрока2.Период);
				БалансоваяСтоимостьГодовая = 0;
				БалансоваяСтоимостьГодоваяСумма = 0;
				ВсегоОсталосьСписать = ТекСтрока.Стоимость;
				Ств = Новый Соответствие;
				Для Ч = 1 По ГодАморт+1 Цикл
					ДатаФормулы = ?(Ч = 1, НайденнаяСтрока2.Период, Объект.Дата);
					КолДнейВГодуСначалоПриема = ?(Ч = 1, (НачалоДня(КонецГода((ДатаФормулы))+1) - НачалоДня(ДатаФормулы)) / (60 * 60 * 24), 365);
					БалансоваяСтоимостьГодовая = (ВсегоОсталосьСписать / 100 * НайденнаяСтрока.ПроцентАмортизации) / 365 * КолДнейВГодуСначалоПриема;
					БалансоваяСтоимостьГодоваяСумма = БалансоваяСтоимостьГодоваяСумма + БалансоваяСтоимостьГодовая; 
					ВсегоОсталосьСписатьДо = ВсегоОсталосьСписать;
					ВсегоОсталосьСписать = (ВсегоОсталосьСписать - БалансоваяСтоимостьГодовая);
					Стр = Новый Структура;
					Стр.Вставить("БалансоваяСтоимостьГодовая", БалансоваяСтоимостьГодовая);
					Стр.Вставить("БалансоваяСтоимостьГодоваяСумма", БалансоваяСтоимостьГодоваяСумма);
					Стр.Вставить("ВсегоОсталосьСписать", ВсегоОсталосьСписатьДо);
					Ств.Вставить(Ч, Стр);
				КонецЦикла;
				
				
				КоличествоДнейВМесяц = Число(Сред(КонецМесяца(Объект.Дата), 1, 2));
				ТекДень              = День(Объект.Дата)-1;
				//КолДны               = КоличествоДнейВМесяц - ТекДень;
				ТекСтрока.АмортизацияЗаМесяц = (Ств[ГодАморт+1].ВсегоОсталосьСписать / 100 * НайденнаяСтрока.ПроцентАмортизации) / 365 * ТекДень;	
			КонецЕсли;  			
		КонецЦикла;				
	КонецЕсли;	
	
КонецПроцедуры

Процедура АмортизацияВА_КолДней(Запрос, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	ВременнаяТаблицаДляРасчетаКоличествоМесяцев КАК ТаблицаДокумента";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ВнеоборотныйАктив", Новый ОписаниеТипов("СправочникСсылка.ВнеоборотныеАктивы"));
	ТЗ.Колонки.Добавить("Кол", Новый ОписаниеТипов("Число")); 
	ТЗ.Колонки.Добавить("ПериодДляВичисленияКолДней", Новый ОписаниеТипов("Число")); 
	ТЗ.Колонки.Добавить("ДатаПринятия", Новый ОписаниеТипов("Дата"));

	
	Для каждого ТекСтрока Из РезультатЗапроса Цикл
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК Кол
		|ИЗ
		|	РегистрНакопления.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы
		|ГДЕ
		|	(ВнеоборотныеАктивы.Регистратор ССЫЛКА Документ.АмортизацияВА
		//|			ИЛИ ВнеоборотныеАктивы.Регистратор ССЫЛКА Документ.ПринятиеКУчетуВА
		//| 			ИЛИ ВнеоборотныеАктивы.Регистратор ССЫЛКА Документ.ИзменениеПараметровВА
		|)
		|	И ВнеоборотныеАктивы.Период МЕЖДУ &ПериодНачало И &ПериодКонец
		|	И ВнеоборотныеАктивы.Организация = &Организация
		|	И ВнеоборотныеАктивы.ВнеоборотныйАктив = &ВнеоборотныйАктив";
		
		Запрос.УстановитьПараметр("ПериодНачало", ТекСтрока.Начало);
		Запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(ТекСтрока.Конец));
		Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
		Запрос.УстановитьПараметр("ВнеоборотныйАктив", ТекСтрока.ВнеоборотныйАктив);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();						
		Для каждого ТекИм Из РезультатЗапроса Цикл
			НоаяСтрока = ТЗ.Добавить();
			НоаяСтрока.ВнеоборотныйАктив = ТекСтрока.ВнеоборотныйАктив; 
			НоаяСтрока.ДатаПринятия = ТекСтрока.Начало;
			НоаяСтрока.Кол = (ТекИм.Кол+1);
			НоаяСтрока.ПериодДляВичисленияКолДней = ТекСтрока.ПериодДляВичисленияКолДней;
		КонецЦикла;
		
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	" ВЫБРАТЬ  *
	|ПОМЕСТИТЬ ВременнаяТаблицаКолМесяцев
	|ИЗ
	|&Таблица КАК Таблица";
	
	Запрос.УстановитьПараметр("Таблица", ТЗ);	
	Запрос.Выполнить();
	
КонецПроцедуры
 

//////////////////////////////////////////////////////////////////////////////// 
// ИзменениеПараметровВА - 

Процедура ИзменениеПараметровВА(ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив,
		|	СостоянияВнеоборотныхАктивовСрезПоследних.AzRyИзменениеСпособаМетодаАмортизаций,
		|	СостоянияВнеоборотныхАктивовСрезПоследних.AzRyСпособАмортизации
		|ИЗ
		|	РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(&Дата, ВнеоборотныйАктив В (&ВнеоборотныйАктив)) КАК СостоянияВнеоборотныхАктивовСрезПоследних
		|ГДЕ
		|	СостоянияВнеоборотныхАктивовСрезПоследних.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ВнеоборотныйАктив", ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСостоянияВнеоборотныхАктивов.ВыгрузитьКолонку("ВнеоборотныйАктив"));
	Запрос.УстановитьПараметр("Дата", ДополнительныеСвойства.ДляПроведения.Дата-1);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
	Для каждого ТекСтрока Из ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСостоянияВнеоборотныхАктивов Цикл
		НайденнаяСтрока = РезультатЗапроса.Найти(ТекСтрока.ВнеоборотныйАктив, "ВнеоборотныйАктив");
		ТекСтрока.AzRyИзменениеСпособаМетодаАмортизаций = НайденнаяСтрока.AzRyСпособАмортизации <> ТекСтрока.AzRyСпособАмортизации;	
	КонецЦикла;			

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// НачислениеЗарплаты -

&НаСервере
Функция НаправленияДеятельностиНоменклатура(НаправлениеДеятельностыНоменклатура) Экспорт
	
	Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаправлениеДеятельностыНоменклатура, Истина);  
	Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
		Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
		Номенклатура.УстановитьНовыйКод();
		Номенклатура.Наименование            = НаправлениеДеятельностыНоменклатура;
		Номенклатура.НаименованиеПолное      = НаправлениеДеятельностыНоменклатура;
		//Номенклатура.Артикул                 = СтрокаАртикул;
		Номенклатура.ТипНоменклатуры         = Перечисления.ТипыНоменклатуры.Запас;
		//Номенклатура.НоменклатурнаяГруппа    = Справочники.НоменклатурныеГруппы.ОсновнаяГруппа;
		Номенклатура.ЕдиницаИзмерения        = Справочники.КлассификаторЕдиницИзмерения.шт;
		Номенклатура.СтавкаНДС               = Справочники.СтавкиНДС.НайтиПоНаименованию("18%");
		Номенклатура.Комментарий             = "გამოიყენება ხელფასების დარიცხვაში რეგისტრში 'შესყიდვები'";
		Номенклатура.Записать();		
	КонецЕсли;	
	Возврат Номенклатура.Ссылка;	
	
КонецФункции


//////////////////////////////////////////////////////////////////////////////// 
// AzRy - Подписки на события

Процедура ПодпискаНаСобытиеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	СтруктураВременныеТаблицы = Источник.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;	
	Если Не СтруктураВременныеТаблицы.Свойство("AzRyДвиженияЗапасыИзменение") Или Отказ Или Не СтруктураВременныеТаблицы.AzRyДвиженияЗапасыИзменение Или СтруктураВременныеТаблицы.AzRyАвторДокумента = СтруктураВременныеТаблицы.AzRyОтветственныйЗаСклад Тогда
		Возврат;	
	КонецЕсли; 
	
	// ვიძახებთ დამუშავებას და ვაგზავნით მეილს	                     
	ОтправитьПисьмоОтветственногоЗаСкладом(СтруктураВременныеТаблицы.AzRyРегистратор, Пользователи.ТекущийПользователь());
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// Other 

Процедура ИзменениеПроводкиНачислениеЗарплаты(ТЗ) Экспорт
	
	Для каждого ТекСтрока Из ТЗ Цикл
		Если ТекСтрока.ВидНачисленияУдержания = Справочники.AzRyНастройки.НачислениеПенсия.Значение Тогда
			ТекСтрока.СчетКт = Справочники.AzRyНастройки.НачислениеЗарплаты_3320_04.Значение;
			ТекСтрока.ВалютаКт   = ?(Справочники.AzRyНастройки.НачислениеЗарплаты_3320_04.Значение.Валютный, ТекСтрока.ВалютаКт, Неопределено);
			ТекСтрока.СуммаВалКт = ?(Справочники.AzRyНастройки.НачислениеЗарплаты_3320_04.Значение.Валютный, ТекСтрока.СуммаВалКт, Неопределено);
		КонецЕсли; 
	КонецЦикла;	

КонецПроцедуры

Функция РассчитатьКоефициент(СуммаВходящая,ВсегоСуммаВходящая,СуммаРаспределения) 
   ПроцентОтОбщей=СуммаВходящая /(ВсегоСуммаВходящая/100); 
   Дельта=Окр(СуммаРаспределения/100*ПроцентОтОбщей,2,РежимОкругления.Окр15как20); 
   Возврат Дельта; 
КонецФункции

Процедура ОтправитьПисьмоОтветственногоЗаСкладом(Регистратор, АвторДокумента) Экспорт

	О = Обработки.AzRyПриИзмененийОстатковЗапасаУведомитьВладельцаСклада.Создать();
	О.КомандаОтправитьПисьмо(ПолучитьНавигационнуюСсылку(Регистратор), АвторДокумента);			

КонецПроцедуры

Функция СписокПользователейДляКонтроляОстатковНаСкладе() Экспорт 
	
	С = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПользователиAzRyСкладыДляКонтроляОстатков.Склад КАК Склад,
		|	ПользователиAzRyСкладыДляКонтроляОстатков.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи.AzRyСкладыДляКонтроляОстатков КАК ПользователиAzRyСкладыДляКонтроляОстатков
		|ГДЕ
		|	ПользователиAzRyСкладыДляКонтроляОстатков.Ссылка В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				Пользователи.Ссылка КАК Ссылка
		|			ИЗ
		|				Справочник.Пользователи КАК Пользователи
		|			ГДЕ
		|				НЕ Пользователи.Ссылка.ПометкаУдаления
		|				И Пользователи.Ссылка.AzRyСкладскойКонтроль)
		|	И ПользователиAzRyСкладыДляКонтроляОстатков.Актуальность
		|	И НЕ ПользователиAzRyСкладыДляКонтроляОстатков.Ссылка.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		С = Новый Структура("Пользователь, Склад", ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Склад); 		
	КонецЦикла;
	
	Возврат С;
	
КонецФункции
 



