
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Страна = справочники.СтраныМира.НайтиПоКоду("GEO");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантВводаАдресаПриИзменении(Элемент)
	
	Если ВариантВводаАдреса = "" Тогда 
		Элементы.ГруппаПомошник.Видимость = Истина;
		Элементы.Наименование.Доступность = ЛОЖЬ;
	Иначе
		Элементы.ГруппаПомошник.Видимость = ЛОЖЬ;
		Элементы.Наименование.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧастьАдресаПриИзменении(Элемент)
	
	Объект.Наименование =
	?(ЗначениеЗаполнено(Объект.Страна), Строка(Объект.Страна) + ", ", "")
	+ ?(ЗначениеЗаполнено(Объект.Город), Объект.Город + ", ", "")
	+ ?(ЗначениеЗаполнено(Объект.Улица), Объект.Улица + " ", "")
	+ ?(ЗначениеЗаполнено(Объект.Дом), Объект.Дом, "")
	+ ?(ЗначениеЗаполнено(Объект.Корпус), Объект.Корпус + ", ", "")
	+ ?(ЗначениеЗаполнено(Объект.КварираОфис), Объект.КварираОфис, "");
	
КонецПроцедуры
