
&Вместо("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаКадровоеПеремещение, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	КадровоеПеремещениеСотрудники.НомерСтроки КАК НомерСтроки,
	|	КадровоеПеремещениеСотрудники.Сотрудник КАК Сотрудник,
	|	КадровоеПеремещениеСотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	КадровоеПеремещениеСотрудники.Должность КАК Должность,
	|	КадровоеПеремещениеСотрудники.ГрафикРаботы КАК ГрафикРаботы,
	|	КадровоеПеремещениеСотрудники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	КадровоеПеремещениеСотрудники.Период КАК Период,
	|	КадровоеПеремещениеСотрудники.КлючСвязи КАК КлючСвязи,
	|	КадровоеПеремещениеСотрудники.УчастникПенсионногоФонда КАК УчастникПенсионногоФонда,
	|	КадровоеПеремещениеСотрудники.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	КадровоеПеремещениеСотрудники.УчаствуетДобровольно КАК УчаствуетДобровольно,
	|	КадровоеПеремещениеСотрудники.Ссылка КАК Ссылка,																																
	|	КадровоеПеремещениеСотрудники.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
	|	КадровоеПеремещениеСотрудники.ВидОтпуска КАК ВидОтпуска,
	|	КадровоеПеремещениеСотрудники.КоличествоДней КАК КоличествоДней,
	|	КадровоеПеремещениеСотрудники.Ссылка.Дата КАК Дата  
	|,	КадровоеПеремещениеСотрудники.Ссылка.Подразделение КАК Подразделение
	// +++ { AzRy - [19.07.2022] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,КадровоеПеремещениеСотрудники.AzRyDivision КАК AzRyDivision
	// +++ } AzRy - [19.07.2022] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|ПОМЕСТИТЬ ТаблицаСотрудники
	|ИЗ
	|	Документ.КадровоеПеремещение.Сотрудники КАК КадровоеПеремещениеСотрудники
	|ГДЕ
	|	КадровоеПеремещениеСотрудники.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	КадровоеПеремещениеСотрудники.НомерСтроки КАК НомерСтроки,
	|	КадровоеПеремещениеСотрудники.Сотрудник КАК Сотрудник,
	|	КадровоеПеремещениеСотрудники.Период КАК Период,
	|	КадровоеПеремещениеНачисленияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	КадровоеПеремещениеНачисленияУдержания.Валюта КАК Валюта,
	|	КадровоеПеремещениеНачисленияУдержания.Сумма КАК Сумма,
	|	КадровоеПеремещениеНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	КадровоеПеремещениеНачисленияУдержания.СчетЗатратРегл КАК СчетЗатратРегл,
	|	КадровоеПеремещениеНачисленияУдержания.Актуальность КАК Актуальность,
	|	КадровоеПеремещениеСотрудники.ВидОтпуска КАК ВидОтпуска,
	|	КадровоеПеремещениеСотрудники.КоличествоДней КАК КоличествоДней
	|ПОМЕСТИТЬ ТаблицаНачисленияУдержания
	|ИЗ
	|	Документ.КадровоеПеремещение.Сотрудники КАК КадровоеПеремещениеСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещение.НачисленияУдержания КАК КадровоеПеремещениеНачисленияУдержания
	|		ПО КадровоеПеремещениеСотрудники.КлючСвязи = КадровоеПеремещениеНачисленияУдержания.КлючСвязи
	|ГДЕ
	|	КадровоеПеремещениеСотрудники.Ссылка = &Ссылка
	|	И КадровоеПеремещениеНачисленияУдержания.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	КадровоеПеремещениеСотрудники.НомерСтроки,
	|	КадровоеПеремещениеСотрудники.Сотрудник,
	|	КадровоеПеремещениеСотрудники.Период,
	|	КадровоеПеремещениеНалогиНаДоходы.ВидНачисленияУдержания,
	|	КадровоеПеремещениеНалогиНаДоходы.Валюта,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	КадровоеПеремещениеНалогиНаДоходы.Актуальность,
	|	КадровоеПеремещениеСотрудники.ВидОтпуска,
	|	КадровоеПеремещениеСотрудники.КоличествоДней
	|ИЗ
	|	Документ.КадровоеПеремещение.Сотрудники КАК КадровоеПеремещениеСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещение.НалогиНаДоходы КАК КадровоеПеремещениеНалогиНаДоходы
	|		ПО КадровоеПеремещениеСотрудники.КлючСвязи = КадровоеПеремещениеНалогиНаДоходы.КлючСвязи
	|ГДЕ
	|	КадровоеПеремещениеСотрудники.Ссылка = &Ссылка
	|	И КадровоеПеремещениеНалогиНаДоходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КадровоеПеремещениеНалогиНаДоходы.КлючСвязи КАК КлючСвязи,
	|	МАКСИМУМ(КадровоеПеремещениеНалогиНаДоходы.ВидНачисленияУдержания) КАК ВидУдержанияНДФЛ
	|ПОМЕСТИТЬ ТаблицаСтавкиНДФЛ
	|ИЗ
	|	Документ.КадровоеПеремещение.НалогиНаДоходы КАК КадровоеПеремещениеНалогиНаДоходы
	|ГДЕ
	|	КадровоеПеремещениеНалогиНаДоходы.Ссылка = &Ссылка
	|	И КадровоеПеремещениеНалогиНаДоходы.Актуальность
	|
	|СГРУППИРОВАТЬ ПО
	|	КадровоеПеремещениеНалогиНаДоходы.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСотрудники.Организация КАК Организация,
	|	ТаблицаСотрудники.НомерСтроки КАК НомерСтроки,
	|	ТаблицаСотрудники.Сотрудник КАК Сотрудник,
	|	ТаблицаСотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаСотрудники.Должность КАК Должность,
	|	ТаблицаСотрудники.ГрафикРаботы КАК ГрафикРаботы,
	|	ТаблицаСотрудники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	ЕСТЬNULL(ТаблицаСтавкиНДФЛ.ВидУдержанияНДФЛ, ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)) КАК ВидУдержанияНДФЛ,
	|	ТаблицаСотрудники.УчастникПенсионногоФонда КАК УчастникПенсионногоФонда,
	|	ТаблицаСотрудники.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ТаблицаСотрудники.УчаствуетДобровольно КАК УчаствуетДобровольно,
	|	ТаблицаСотрудники.Период КАК Период,
	|	ТаблицаСотрудники.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
	|	ВЫБОР
	|		КОГДА ТаблицаСотрудники.ВидОтпуска = ЗНАЧЕНИЕ(Справочник.ВидыОтпусков.ПустаяСсылка)
	|			ТОГДА СотрудникиСрезПоследних.ВидОтпуска
	|		ИНАЧЕ ТаблицаСотрудники.ВидОтпуска
	|	КОНЕЦ КАК ВидОтпуска,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаСотрудники.КоличествоДней, 0) = 0
	|			ТОГДА СотрудникиСрезПоследних.КоличествоДнейОтпуска
	|		ИНАЧЕ ТаблицаСотрудники.КоличествоДней
	|	КОНЕЦ КАК КоличествоДнейОтпуска
	|ИЗ
	|	ТаблицаСотрудники КАК ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСтавкиНДФЛ КАК ТаблицаСтавкиНДФЛ
	|		ПО ТаблицаСотрудники.КлючСвязи = ТаблицаСтавкиНДФЛ.КлючСвязи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(
	|				&ДатаСрееза,
	|				(Организация, Сотрудник) В
	|					(ВЫБРАТЬ
	|						а.Организация,
	|						а.Сотрудник
	|					ИЗ
	|						ТаблицаСотрудники КАК а)) КАК СотрудникиСрезПоследних
	|		ПО ТаблицаСотрудники.Организация = СотрудникиСрезПоследних.Организация
	|			И ТаблицаСотрудники.Сотрудник = СотрудникиСрезПоследних.Сотрудник
	|	ТаблицаСотрудники.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора
	// +++ { AzRy - [19.07.2022] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,ТаблицаСотрудники.AzRyDivision КАК AzRyDivision
	// +++ } AzRy - [19.07.2022] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|ИЗ
	|	ТаблицаСотрудники КАК ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСтавкиНДФЛ КАК ТаблицаСтавкиНДФЛ
	|		ПО ТаблицаСотрудники.КлючСвязи = ТаблицаСтавкиНДФЛ.КлючСвязи
	|ГДЕ
	|	ТаблицаСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКадровоеПеремещение.ПеремещениеИИзменениеСпособаОплаты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачисленияУдержания.Организация КАК Организация,
	|	ТаблицаНачисленияУдержания.НомерСтроки КАК НомерСтроки,
	|	ТаблицаНачисленияУдержания.Сотрудник КАК Сотрудник,
	|	ТаблицаНачисленияУдержания.Период КАК Период,
	|	ТаблицаНачисленияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ТаблицаНачисленияУдержания.Валюта КАК Валюта,
	|	ТаблицаНачисленияУдержания.Сумма КАК Сумма,
	|	ТаблицаНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаНачисленияУдержания.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ТаблицаНачисленияУдержания.Актуальность КАК Актуальность
	|ИЗ
	|	ТаблицаНачисленияУдержания КАК ТаблицаНачисленияУдержания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаСотрудники.Организация КАК Организация,
	|	ТаблицаСотрудники.НомерСтроки КАК НомерСтроки,
	|	ТаблицаСотрудники.Сотрудник КАК Сотрудник,  
	|	ТаблицаСотрудники.Подразделение КАК СтруктурнаяЕдиница,
	|	ТаблицаСотрудники.Дата КАК Период,
	|	ТаблицаСотрудники.ВидОтпуска КАК ВидНачисленияОтпуска,
	|	ТаблицаСотрудники.КоличествоДней КАК КоличествоДней
	|ИЗ
	|	ТаблицаСотрудники КАК ТаблицаСотрудники
	|ГДЕ
	|	ТаблицаСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКадровоеПеремещение.СписаниеДнейОтпуска)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиСрезПоследних.Период КАК Период,
	|	ТаблицаСотрудники.Ссылка КАК Регистратор,
	|	ТаблицаСотрудники.НомерСтроки КАК НомерСтроки,
	|	СотрудникиСрезПоследних.Активность КАК Активность,
	|	ТаблицаСотрудники.Организация КАК Организация,
	|	ТаблицаСотрудники.Сотрудник КАК Сотрудник,
	|	СотрудникиСрезПоследних.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.Должность КАК Должность,
	|	СотрудникиСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
	|	СотрудникиСрезПоследних.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	СотрудникиСрезПоследних.УчастникПенсионногоФонда КАК УчастникПенсионногоФонда,
	|	СотрудникиСрезПоследних.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	СотрудникиСрезПоследних.УчаствуетДобровольно КАК УчаствуетДобровольно,
	|	ТаблицаСотрудники.ВидОтпуска КАК ВидОтпуска,
	|	ТаблицаСотрудники.КоличествоДней КАК КоличествоДнейОтпуска
	|ИЗ
	|	ТаблицаСотрудники КАК ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(
	|				&ДатаСрееза,
	|				(Организация, Сотрудник) В
	|					(ВЫБРАТЬ
	|						а.Организация,
	|						а.Сотрудник
	|					ИЗ
	|						ТаблицаСотрудники КАК а)) КАК СотрудникиСрезПоследних
	|		ПО ТаблицаСотрудники.Организация = СотрудникиСрезПоследних.Организация
	|			И ТаблицаСотрудники.Сотрудник = СотрудникиСрезПоследних.Сотрудник
	|ГДЕ
	|	ТаблицаСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКадровоеПеремещение.ВидыОтпусков)");
	//--- Дмгг Таск ONESOFT-2766 08.12.22
	                
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаКадровоеПеремещение);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ДатаСрееза", НачалоДня(ДокументСсылкаКадровоеПеремещение.Дата) - 1);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСотрудники", 				МассивРезультатов[3].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлановыеНачисленияИУдержания", МассивРезультатов[4].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДниОтпускаСотрудников", МассивРезультатов[5].Выгрузить());
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСотрудники", МассивРезультатов[6].Выгрузить());
	
	СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	
КонецПроцедуры
