
&НаКлиенте
Процедура АдресСтраницыАутентификацииДокументСформирован(Элемент)
	
	Если ТокенПолучен Тогда
		Возврат;
	КонецЕсли;
	
	Если Найти(Элемент.Документ.location.href, "access_token=") <> 0 Тогда	
		ТокенДоступа = ПолучитьТокенИзURL();
		УстановитьТокенДоступа(ТокенДоступа);
		Токен = ТокенДоступа;
		ТокенПолучен = Истина;
		
		СтруктураОпомещения = Новый Структура("Токен, ТокенПолучен", Токен, ТокенПолучен);
		//Оповестить("ИнтеграцияСБанком_Авторизация", СтруктураОпомещения);
		ЭтаФорма.Закрыть(Токен);
		//Элементы.СтраницаОбщая.Видимость = Истина;
		//Элементы.СтраницыВебСервисов.Видимость = Ложь;
	КонецЕсли;
	
	          
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	АвторизацияАккаунта(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияАккаунта(Команда)	
	
	//ID_Пользователя = ПолучитьIDПользователя();
	//
	//АдресСтраницыАутентификации = "https://cib2-web-dev.bog.ge:8090/Oauth/Connect/Authorize.aspx?client_id="+ID_Пользователя+"&response_type=token&scope=read+write&redirect_uri=https%3A%2F%2Fcib2-web-dev.bog.ge%3A8090%2FOauth%2FConnect%2FToken.aspx&state=e46fcdf4-a4bf-4dc6-8a42-e1b12e27826b";
	
	ID_Пользователя = "4b59427a-4d5c-4d62-9ecf-a7a0d02bd5fb";
	АдресСтраницыАутентификации = "https://businessonline.ge/Oauth/Connect/Authorize.aspx?client_id="+ID_Пользователя+"&response_type=token&scope=read+write&redirect_uri=https://businessonline.ge/Oauth/Connect/Token.aspx&state=e46fcdf4-a4bf-4dc6-8a42-e1b12e27826b";
		
КонецПроцедуры

&НаСервере
Функция ПолучитьIDПользователя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиПользователей.Значение КАК IDПользователяАппликацииBoG
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь = &Пользователь
	|	И НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.IDПользователяАппликацииBoG)";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.IDПользователяАппликацииBoG;	
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьТокенДоступа(ТокенДоступа)
	
	Константы.ТокенДоступаBoG.Установить(ТокенДоступа);
	
	// плюс новая система
	ТекПользователь = Пользователи.АвторизованныйПользователь();
	
	НаборЗаписейТокена = РегистрыСведений.ТокеныПользователейBOG.СоздатьНаборЗаписей();
	
	НаборЗаписейТокена.Отбор.Пользователь.Установить(ТекПользователь);
	
	НоваяЗапись = НаборЗаписейТокена.Добавить();
	НоваяЗапись.Пользователь = ТекПользователь;
	НоваяЗапись.Токен = ТокенДоступа;
	НоваяЗапись.ДатаВремяПолучения = ТекущаяДата();
	
	НаборЗаписейТокена.Записать();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТокенИзURL()
	
	ТекущийURL = Элементы.АдресСтраницыАутентификации.Документ.location.href;
	НачалоТокена = Найти(ТекущийURL, "access_token=") + 13;
	КонецТокена = Найти(Сред(ТекущийURL, НачалоТокена), "&") - 1;
	Если КонецТокена > -1 Тогда 
		Возврат Сред(ТекущийURL, НачалоТокена, КонецТокена);
	Иначе
		Возврат Сред(ТекущийURL, НачалоТокена);	
	КонецЕсли;	
	
КонецФункции